{"newsArray":[{"article_id":"27468014de683ee182433dddcb320ef7","title":"Shubman Gill Breaks Silence On Replacing Hardik Pandya As GT Skipper","link":"https://sports.ndtv.com/cricket/to-all-fans-shubman-gills-first-reaction-on-replacing-hardik-pandya-as-gujarat-titans-skipper-4610573","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill expressed his delight after being announced as the captain of the Indian Premier League franchise Gujarat Titans.","content":"India's rising star Shubman Gill expressed his delight after being announced as the captain of the Indian Premier League franchise Gujarat Titans ahead of the Indian Premier League (IPL) 2024 season. After the former GT skipper went back to his beloved Mumbai Indian earlier on Monday, the 'Little Prince' of Ahmedabad was handed the captaincy duties. Gill stated that he was proud to assume the role and thanked the franchise for putting their trust in him. \"I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let's make it memorable! To all the fans... #AavaDe,\" Gill wrote on X. Gill has amassed 1373 runs in 33 innings at an average of 47.34, with three centuries and eight fifties. Last season was monumental for the opener as he slammed 890 runs in 17 matches at an average of 59.33, with three centuries and four fifties and was also named Orange Cap winner. I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let's make it memorable! To all the fans… #AavaDe ! pic.twitter.com/LNELWqwURD The opener was instrumental in GT's sensation run since its debut in the IPL. Last season, he smoked 129 runs in 60 balls against Mumbai Indians, the highest by a batter in the IPL playoffs. \"I am delighted and proud to assume the Captaincy of Gujarat Titans and thank the franchise for their trust in me to lead such a fine team. We have had two exceptional seasons and I keenly look forward to leading the team with our exciting brand of cricket,\" Gill said in the announcement. After winning the Indian Premier League (IPL) in their debut season in 2022, GT reached the finals in the next season, losing to Chennai Super Kings (CSK). Gill also hammered three centuries in the last IPL. Only Royal Challengers Bangalore (RCB) batter Virat Kohli (2016) and Rajasthan Royals batter Jos Buttler (2022) had more in a single IPL season, scoring four each. Pandya moving back to Mumbai Indians could turn out to be a major loss for GT as under the leadership of an experienced all-rounder, GT lifted the IPL trophy in their debut season and made their place in the final in the subsequent season but ended up falling short against MS Dhoni's Chennai Super Kings.","pubDate":"2023-11-28 02:40:09","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8aa491642c824464b43a3cf5ffe7ed2","title":"IPL 2024 से पहले ही मुंबई इंडियंस के बॉलर ने किया बड़ा धमाका, करियर में पूरे किए 1000 विकेट","link":"https://www.indiatv.in/sports/cricket/piyush-chawla-completes-1000-wickets-in-career-mumbai-indians-bowler-vijay-hazare-trophy-2023-11-28-1004416","keywords":null,"creator":null,"video_url":null,"description":"Mumabi Indians: मुंबई इंडियंस के एक स्टार खिलाड़ी ने घरेलू क्रिकेट में कमाल का प्रदर्शन किया है। इस खिलाड़ी ने अपने करियर में 1000 विकेट पूरे कर लिए हैं।","content":"IPL 2024 के लिए फैंस बहुत ही ज्यादा उत्साहित हैं। आईपीएल 2024 के लिए मिनी ऑक्शन का आयोजन दुबई में 19 दिसंबर को आयोजित किया जाएगा। सभी आईपीएल टीमों ने अपनी रिटेंशन और रिलीज खिलाड़ियों की लिस्ट आईपीएल गवर्निंग काउंसिल को सौंप दी है। अब आईपीएल 2024 से पहले ही मुंबई इंडियंस के एक स्टार खिलाड़ी ने कमाल करते हुए करियर में 1000 विकेट पूरे कर लिए हैं। आइए जानते हैं, इस खिलाड़ी के बारे में। मुंबई इंडियंस के स्टार खिलाड़ी पीयूष चावला ने घरेलू क्रिकेट में विजय हजारे ट्रॉफी में खेलते हुए कमाल का प्रदर्शन किया है। उन्होंने गुजरात के लिए खेलते हुए अरुणाचल प्रदेश के खिलाफ 10 ओवर में 30 रन देकर 3 विकेट चटकाए। उन्होंने एक ओवर मेडन भी फेंका। इसी के साथ वह अपने क्रिकेट करियर में 1000 विकेट पूरे करने में सफल रहे। पीयूष अपनी बेहतरीन गेंदबाजी के लिए जाने जाते हैं और उनकी स्पिन को खेलना किसी भी बल्लेबाज के लिए आसान नहीं है। उनकी गुगली का कोई जवाब नहीं है। पीयूष चावला ने फर्स्ट क्लास करियर में 445 विकेट, टी20 क्रिकेट में 302 विकेट और लिस्ट-ए क्रिकेट में 254 विकेट चटकाए हैं। इस तरह से उनके नाम अब 1001 विकेट दर्ज हो गए हैं। वह 34 साल के हो चुके हैं। फिर भी उनकी फुर्ती मैदान पर देखते बनती है। उन्हें आईपीएल 2023 ऑक्शन में मुंबई इंडियंस की टीम ने 50 लाख रुपये में खरीदा था। इसके बाद उन्होंने आईपीएल 2023 में कमाल का प्रदर्शन भी किया। उन्होंने मुंबई के लिए 16 मैचों में 18 विकेट अपने नाम किए। पीयूष चावला ने भारत के लिए तीनों ही फॉर्मेट में क्रिकेट खेला है। उन्होंने भारत के लिए साल 2006 में टेस्ट में डेब्यू किया था। लेकिन टीम इंडिया में उन्हें पिछले 12 साल से मौका नहीं मिला है। उन्होंने भारत के लिए 2 टेस्ट, 25 वनडे और 7 टी20 मैच खेले हैं। यह भी पढ़ें:","pubDate":"2023-11-28 02:37:47","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"702b2344096ed8b8be4a372211e50f87","title":"India's Predicted XI vs Australia, 3rd T20I: Will Shivam Dube Make Cut?","link":"https://sports.ndtv.com/cricket/ind-vs-aus-3rd-t20i-india-s-predicted-xi-4609740","keywords":null,"creator":null,"video_url":null,"description":"India had named the same Playing XI for the second T20I against Australia which featured in the first match","content":"India will take on Australia in 3rd T20I of Australia in India, five-match T20I Series 2023 on November 28 at Barsapara Cricket Stadium in Guwahati. The match commences at 7:00 PM IST. India registered two convincing victories in the series so far. With the ongoing tour happening swiftly after the end of the ODI World Cup, a lot of India's first-choice players were not involved in the playing XI. Suryakumar Yadav, who featured in the final against Australia in Ahmedabad, was chosen to lead the Indian side in the series as Rohit Sharma and vice-captain Hardik Pandya were unavailable for selection. Yadav starred with a terrific 80 off 42 balls in the first T20I to steer India to a record run chase. In the last match in Thiruvananthapuram, India batted first and mounted a huge total. Yashasvi Jaiswal, Ruturaj Gaikwad and Ishan Kishan scored half-centuries, while Rinku Singh chipped in with a terrific 31 off nine balls to finish the innings, as India ended with 235/4 in 20 overs. Australia could only manage 191/9 in reply, as Ravi Bishnoi and Prasidh Krishna returned with three wickets each. Here's India's predicted XI for the third T20I Openers: Yashasvi Jaiswal, Ruturaj Gaikwad Yashasvi Jaiswal has been in top form in this series and registered a quickfire half-century in the last match at the Greenfield Stadium. His 53 off 25 balls set the tone for the middle order, which included nine fours and two sixes. He was also named Player of the Match for his effort. Ruturaj Gaikwad, after being run out without facing a ball in the first match, got a well-timed half-century. He played the anchor as Jaiswal and Ishan Kishan went after the bowlers. His 58 off 43 deliveries included three fours and two sixes. Middle order: Ishan Kishan, Suryakumar Yadav, Tilak Varma, Rinku Singh Advertisement The Indian middle order has three hard-hitting left-handed batters who are capable of changing the game on its head. The only right-handed batter in this setup is the skipper Suryakumar Yadav, who is the only cricketer with an average of 40+ and a strike-rate of 170+ in T20 internationals. Suryakumar Yadav smashed a terrific 80 off 42 balls in the first T20I and got a good start with a 10-ball 19 in the second match. Ishan Kishan took time to get going in both matches, but finished with much-needed half-centuries. He is the leading run-scorer in the series currently for India. Rinku Singh delivered a big finish to help India complete the big run chase in the first T20I. He was at it once again in the second match, smashing a quickfire 31. Tilak Varma got some big hits in both matches but is yet to fire with a big knock. All-rounders: Axar Patel In both high-scoring encounters, Axar Patel has been the only redeeming factor in the Indian bowling setup in terms of economy. His 0/32 in the first T20I was instrumental in not letting Australia run away with a bigger score, while his 1/25 in four overs while defending 236 runs was an outright match-winning contribution. He is capable of chipping in with runs with the bat as well. Bowlers: Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna Ravi Bishnoi was taken for runs in the opening match, but he has scalped crucial wickets so far. Bishnoi has four wickets, including three in the last match. He dismissed three destructive batters in Matthew Short, Josh Inglis and Tim David to put India in the driver's seat. The pacers' trio of Arshdeep Singh, Mukesh Kumar and Prasidh Krishna have been very expensive so far, but they have picked up timely wickets. Prasidh returned with three wickets in the second T20I, while Mukesh bowled an excellent final over in the first T20I, giving away only five runs. India's predicted playing XI: Yashasvi Jaiswal, Ruturaj Gaikwad, Ishan Kishan (wk), Suryakumar Yadav (captain), Rinku Singh, Tilak Varma, Axar Patel, Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna","pubDate":"2023-11-28 02:31:14","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d069ab29fd322ac1e44a1f0b2e541d1a","title":"Iceland Cricket's Hilarious Request To ICC On Hosting CT 2025 Goes Viral","link":"https://sports.ndtv.com/cricket/iceland-crickets-hilarious-request-to-icc-on-hosting-champions-trophy-2025-goes-viral-4611690","keywords":null,"creator":null,"video_url":null,"description":"Iceland Cricket took to social media to express their interest in hosting the Champions Trophy 2025 in a hilarious post amid rumours of Pakistan losing on the hosting rights.","content":"Iceland Cricket took to social media to express their interest in hosting the Champions Trophy 2025 in a hilarious post amid rumours of Pakistan losing on the hosting rights due to India's stance on not travelling. India and Pakistan have not played a bilateral series for around a decade due to political tensions and several reports have claimed that the tournament can be shifted to Dubai. Iceland Cricket wrote an entire letter with jokes regarding their challenging weather conditions and lack of standard cricket grounds in a bid to host the competition amid the ongoing reports and rumours. \"We are not people who hold back. We have today issued our bid to host the Champions Trophy of 2025, and we look forward to hearing what Greg Barclay of ICC has to say about it,\" the post read on X. Earlier, Iceland Cricket took a fresh aim at Pakistan star batter Babar Azam , who recently stepped down as captain of the team across formats. We are not people who hold back. We have today issued our bid to host the Champions Trophy of 2025, and we look forward to hearing what Greg Barclay of @ICC has to say about it. pic.twitter.com/EsRzsikCqF Babar relinquished his captaincy amid backlash over Pakistan's early exit from the Cricket World Cup 2023. Babar had a below par tournament with the bat as Pakistan failed to qualify for the semi-finals. He scored 320 runs in the nine matches, averaging less than 40. Taking to social media platform X, Iceland Cricket trolled Babar over his average. Responding to a post, which read \"What is something that still hasn't gone back to normal after the pandemic?\", Iceland Cricket replied, saying: \"The batting average of Babar Azam\". Babar's captaincy came under the spotlight after Pakistan lost to minnows Afghanistan in the World Cup. Pakistan lost five of their nine matches and finished fifth in the points table. Team director Mickey Arthur and head coach Grant Bradburn have been removed from their positions with former skipper Mohammad Hafeez taking over both their roles.","pubDate":"2023-11-28 02:24:38","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3ef8089f55ccab6533894478eeb1c0a6","title":"\"I Know You Will...\": Hardik's Message To MI After Sealing Return From GT","link":"https://sports.ndtv.com/cricket/i-know-you-will-hardik-pandyas-message-to-mumbai-indians-after-completing-switch-from-gujarat-titans-4611842","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team all-rounder Hardik Pandya completed a sensational move to Mumbai Indians from Gujarat Titans.","content":"Hardik Pandya, who made his return to the Indian Premier League (IPL) franchise Mumbai Indians (MI), on Monday reflected back on his journey with the five-time champions. After tasting success with Gujarat Titans in the past two years, the experienced all-rounder on Monday returned to the franchise where his career began in 2015.\"I am back. Rohit, Bumrah, Surya, Ishan, Polly (Pollard), Malinga. Come on let's begin. Obviously, the feeling of coming back to Mumbai is very special for a lot of reasons. How my cricketing journey started in 2015 with MI, them noticing me in 2013...when I look back...how my span of 10 years has been something very special. It has not sunk in yet that finally, I am back where my whole cricketing journey started. I have achieved all the possible things. They have been the most important part of my life,\" Hardik said in a video posted by MI on X Watch talk about his happy homecoming, teaming up with his and resuming his journey with #MumbaiIndians #OneFamily #MumbaiMeriJaan @hardikpandya7 pic.twitter.com/sm6dXGJYCI He talked about the special bond he shares with the MI owners as well as the fans. \"Special bond with Akash and the whole family. They have been with me through thick and thin and it is much more emotional because it feels like I am coming back to my home. I am coming back to my family where it all started. Paltan, you supported me the first time and all the memories have a special place in my heart and all the memories have a special place in my heart. I know you will back me once again. We created history as a team and now I am looking forward to creating some wonderful moments with the boys once again. Mere hardik swagat ke liye , thank you,\" Hardik added. Hardik played 92 matches for MI from 2015-2021, scoring 1,476 runs at an average of 27.33 at a strike rate of over 153, with four half-centuries and best score of 91. He also took 42 wickets for the team, with the best bowling figures of 3/20. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-28 02:20:29","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bc3775f31d4b590438cc067de51aab89","title":"IND Vs AUS T20I 3rd Match: இந்தியா - ஆஸ்திரேலியா அணிகள் மோதும், மூன்றாவது டி20 தொடர்: தொடரை வெல்லும் முனைப்பில் தீவிர பயிற்சியில் இந்திய அணி.!","link":"https://tamil.latestly.com/sports/ind-vs-aus-t20i-3rd-match-today-in-assam-guwahati-cricket-stadium-on-28-nov-2023-10155.html","keywords":null,"creator":null,"video_url":null,"description":"நவம்பர் 28ம் தேதியான இன்று, இந்தியா - ஆஸ்திரேலியா அணிகளுக்கான 20 ஓவர்கள் கொண்ட டி20 கிரிக்கெட் தொடர் ஆட்டம் நடைபெறுகிறது.","content":"நவம்பர் 28, அசாம் (Sports News): 5 போட்டிகள் கொண்ட டி20 தொடர்களில் இந்தியா - ஆஸ்திரேலியா (T20I Series India Vs Australia) அணிகள் மோதிக்கொள்ளும் இரண்டு ஆட்டங்கள் நிறைவுபெற்றுள்ளன. இரண்டு போட்டிகளிலும் இந்திய அணி அபார வெற்றி அடைந்துள்ளது. நவம்பர் 28ம் தேதியான இன்று, இந்தியா - ஆஸ்திரேலியா அணிகளுக்கான 20 ஓவர்கள் கொண்ட டி20 கிரிக்கெட் தொடர், அசாம் மாநிலத்தில் உள்ள கவுகாத்தியில் இருக்கும் பர்சபரா கிரிக்கெட் மைதானத்தில் வைத்து நடைபெறுகிறது. Earthquake Today: நியூ கினியா, சீனா, பாகிஸ்தான் நாடுகளில் அதிகாலையில் அடுத்தடுத்து பயங்கர நிலநடுக்கம்: அச்சத்தில் மக்கள்.! இந்த ஆட்டத்தை இந்திய கிரிக்கெட் அணி சூரியகுமார் யாதவின் தலைமையில் எதிர்கொள்கிறது. கடந்த இரண்டு போட்டிகளிலும் வென்று, தொடரை கைப்பற்றும் முனைப்புடன் இந்திய அணி விளையாடி வருகிறது. இன்றைய ஆட்டத்தினை ஜியோ சினிமா செயலி, ஸ்போர்ட்ஸ் 18 தொலைக்காட்சி ஆகியவற்றில் நேரலையில் கண்டுமகிழலாம். இன்று இரவு இந்திய நேரப்படி, 06:30க்கு டாஸ் போடப்பட்டு 07:00 மணியளவில் ஆட்டம் தொடங்கும். இந்தியா 5ல் 2 போட்டிகளில் வெற்றிபெற்று 2 - 0 கணக்கில் முன்னிலையில் இருக்கிறது. முன்னதாக 2023 உலகக்கோப்பை தொடரை இந்திய மண்ணில் ஆஸ்திரேலிய அணி கைப்பற்றியது குறிப்பிடத்தக்கது.","pubDate":"2023-11-28 02:02:35","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"tamil"},{"article_id":"f0731b98ba0a12fc10f83b44e631bb57","title":"RCB में कैमरून ग्रीन को मिलेगा ये रोल, टीम डायरेक्टर ने कर दिया बिल्कुल साफ","link":"https://www.indiatv.in/sports/cricket/rcb-team-director-of-cricket-mo-bobat-on-cameron-green-role-in-team-middle-order-2023-11-28-1004409","keywords":null,"creator":null,"video_url":null,"description":"RCB की टीम ने ऑस्ट्रेलियाई ऑलराउंडर कैमरून ग्रीन को मुंबई इंडियंस से ट्रेड किया है। आरसीबी की टीम में ग्रीन का क्या रोल होगा। इस पर टीम डायरेक्टर ने बड़ी बात कही है।","content":"IPL रिटेंशन के बाद आरसीबी की टीम ने कैमरून ग्रीन को मुंबई इंडियंस से ट्रेड कर लिया है। आरसीबी ने इसके लिए 17.50 करोड़ रुपये की रकम चुकाई। ग्रीन बेहतरीन गेंदबाजी के साथ-साथ धाकड़ बैटिंग करने में माहिर प्लेयर हैं। उनके आरसीबी में आने से टीम को संतुलन मिलेगा। ग्रीन बेहतरीन फॉर्म में चल रहे हैं और टी20 क्रिकेट में वह चंद गेंदों में मैच का रुख बदल देते हैं। आरसीबी की टीम में उनका क्या रोल होगा। इसको लेकर डायरेक्टर मो बोबाट ने बड़ा बयान दिया है। RCB के निदेशक मो बोबाट के कहा कि कैमरून ग्रीन रॉयल चैलेंजर्स बैंगलोर के लिए एक विस्फोटक पैकेज हो सकते हैं, खासकर चिन्नास्वामी स्टेडियम में। आरसीबी बोल्ड डायरीज में उन्होंने कहा कि वह मिडिल ऑर्डर में पावर हिटर की भूमिका के लिए बिल्कुल फिट हैं। वह बेहतरीन और कुशल बल्लेबाज हैं। उनके पास तेज और स्पिन गेंदबाजी दोनों को खेलने वाले शॉट हैं। ग्रीन शानदार फील्डर भी हैं। उसने हाल के दिनों में फील्डिंग करते हुए अच्छे कैच लपके हैं और गली में फील्डिंग करते हुए वह काफी प्रभावशाली हैं। आरसीबी के नए मुख्य कोच एंडी फ्लावर भी कैमरून ग्रीन को टीम में शामिल करने से उत्साहित थे। फ्लॉवर ने कहा कि हमारा फोकस वास्तव में मिडिल ऑर्डर के आसपास था और हम मिडिल ऑर्डर में सुधार कर सकते हैं। हम विदेशी खिलाड़ियों पर सही संतुलन बनाना चाहते हैं। आज के समय में ऑलराउंडर अहम हैं। ऐसे में हमने काफी बहस की और ग्रीन की एंट्री हो गई है। कैमरून ग्रीन की एंट्री के बाद आरसीबी के पास आईपीएल 2024 ऑक्शन से पहले 23.25 करोड़ रुपये बचे हुए हैं। टीम ने आईपीएल रिटेंशन में 11 खिलाड़ियों को रिलीज किया है। वानिंदु हसरंगा, हर्षल पटेल, जोश हेजलवुड, फिन एलन, माइकल ब्रेसवेल, डेविड विली, वेन पार्नेल, सोनू यादव, अविनाश सिंह, सिद्धार्थ कौल, केदार जाधव शामिल हैं। वहीं ट्रेड के जरिए शाहबाज अहमद को सनराइजर्स हैदराबाद में भेज दिया गया है। रिटेन खिलाड़ी: फाफ डु प्लेसिस, रजत पाटीदार, विराट कोहली, अनुज रावत, दिनेश कार्तिक, सुयश प्रभुदेसाई, विल जैक्स, ग्लेन मैक्सवेल, महिपाल लोमरोर, कर्ण शर्मा, मनोज भंडागे, आकाश दीप, मोहम्मद सिराज, रीस टॉपले, हिमांशु शर्मा, राजन कुमार, विशक विजयकुमार, मयंक डागर और कैमरून ग्रीन (ट्रेड से हासिल किया) यह भी पढ़ें:","pubDate":"2023-11-28 01:47:36","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2e0ca3cdfef7de2db42344455d0b59da","title":"See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act","link":"https://www.dailymail.co.uk/sport/cricket/article-12797567/Adam-Gilchrist-son-Harry-Instagram-park-cricket-funny.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The batting and wicketkeeping great's Instagram pics had his teammates Jason Gillespie and Damien Martyn in stitches.","content":"See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act All-time great wicketkeeper posted funny pic on Instagram Features his son Harry proving that parenting isn't easy Photos had other Aussie cricket greats in stitches By Shayne Bugden For Daily Mail Australia Published: 19:48 EST, 27 November 2023 | Updated: 19:48 EST, 27 November 2023 e-mail View comments Adam Gilchrist made taking catches and scoring centuries look easy when he was starring in the Australian cricket team, but his recent light-hearted post on Instagram showed parenting doesn't always come easy for the 52-year-old. The legendary wicketkeeper showed his followers two shots of his eldest son Harry in Adam Gilchrist Park in the northern NSW village of Caniaba, on the outskirts of Lismore. They were accompanied by the caption: 'Set an example, and then hope to gain your child's respect. All you can ask for as a parent.' The first shot shows Harry smiling as he poses next to the sign bearing his father's name - but the second photo shows him pretending to urinate on it. The cricket great's first photo showed his eldest son innocently smiling as he posed in a park named after his father in northern NSW But the second image is what left other cricket stars in stitches as Harry pretended to urinate on the sign bearing his dad's name Gilchrist's hilarious post has been liked more than 25,000 times with some of the cricketer's world-famous teammates enjoying a good laugh at his expense. Fast bowler Jason Gillespie responded with a series of cry-laughing emojis, with Damien Martyn writing 'That's gold' along with fire and more cry-laughing emojis. Women's star Beth Mooney also chipped in and footy commentator James Brayshaw added, 'You wouldn't have it any other way.' However, some Indian cricket fans - who were likely still getting over their side's shock loss to Australia in the World Cup final - used the opportunity to slam Aussies. 'Its simple like Michel marsh [sic] putting his leg on world cup trophy ..its in your culture ..no wonder,' one wrote, referring to the furore over Mitchell Marsh being photographed with his foot on one of cricket's biggest awards. Gilchrist (pictured at Perth stadium earlier this month) got a big laugh out of his former teammate Jason Gillespie with the cheeky display on Instagram Another of Gilchrist's mates from his playing days, Damien Martyn (pictured) responded to the photos by writing 'That's gold' Harry, 21, is the eldest of Gilchrist's four children with wife Melinda: Annie, 18, Archie, 16, and Ted, 12. Lismore - where the cricket great moved to as a teenager after being born in Bellingen near the NSW north coast - also features the Adam Gilchrist Oval and Pavilion. In March the ex-wickie played in a star-studded celebrity T20 cricket match to raise money for the town after it was smashed by the biggest flood in modern Australian history in February 2022. 'It's something close to my heart,' Gilchrist said. 'I've watched with sadness and frustration from afar so when Steve [Krieg, mayor] asked me if I'd be keen to help create a T20 match with some high profile players I jumped at the opportunity. 'It's a privilege and a pleasure to be able to contribute in some small way.' Instagram New South Wales Share or comment on this article: See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-28 00:48:14","image_url":"https://i.dailymail.co.uk/1s/2023/11/28/00/78297589-0-image-m-14_1701129830217.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2229f8b92898735d299897404e6b18b8","title":"IND vs AUS: गुवाहाटी में होगी रनों की बरसात या गेंदबाजों को मिलेगा साथ? मैच से पहले पढ़ें ये पिच रिपोर्ट","link":"https://www.indiatv.in/sports/cricket/ind-vs-aus-3rd-t20i-barsapara-cricket-stadium-guwahati-pitch-report-2023-11-27-1004391","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd T20I: ऑस्ट्रेलिया के खिलाफ 5 मैचों की टी20 सीरीज का तीसरा मैच टीम इंडिया गुवाहाटी में खेलेगी। इस मैदान पर ये चौथा टी20I मैच होगा।","content":"भारत और ऑस्ट्रेलिया के बीच सीरीज का तीसरा टी20 मैच आज (28 नवंबर) गुवाहाटी के बारसापारा क्रिकेट स्टेडियम में खेला जाएगा। इस सीरीज में टीम इंडिया फिलहाल 2-0 से आगे चल रही है। ऐसे में टीम इंडिया तीसरे टी-20 मैच में सीरीज सील करने के इरादे से मैदान पर उतरेगी। वहीं, ऑस्ट्रेलियाई टीम सीरीज में वापसी के इरादे के साथ उतरेगी। गुवाहाटी के बरसापारा क्रिकेट स्टेडियम का विकेट धीमा माना जाता है। लेकिन इस मैदान पर खेला गया आखिरी टी20 काफी हाई स्कोरिंग रहा था। पिछले साल इस मैदान पर अक्टूबर में भारत और साउथ अफ्रीका के बीच खेले गए टी20 मैच में कुल 400 से ज्यादा रन देखने को मिले थे। यानी इस सीरीज में एक बार फिर हाई स्कोरिंग मैच देखने को मिल सकता है। ऑस्ट्रेलिया ने यहां भारत के खिलाफ एक टी20 इंटरनेशनल मैच खेला है, जिसमें ऑस्ट्रेलियाई टीम ने 8 विकटों से बाजी मारी थी। वहीं, टीम इंडिया ने इस मैदान पर 3 में से 1 ही मैच जीता है और एक बेनतीजा रहा था। भारत ने 3 में से एक मैच ऑस्ट्रेलिया के खिलाफ गंवाया है और श्रीलंका के खिलाफ भारतीय टीम का मुकाबला बेनतीजा रहा है। वहीं, इस मैदान पर उसने अपने आखिरी मैच में साउथ अफ्रीका को हराया था। सूर्यकुमार यादव (कप्तान), ऋतुराज गायकवाड (उपकप्तान), ईशान किशन, यशस्वी जयसवाल, तिलक वर्मा, रिंकू सिंह, जितेश शर्मा (विकेटकीपर), वॉशिंगटन सुंदर, अक्षर पटेल, शिवम दुबे, रवि बिश्नोई, अर्शदीप सिंह, प्रसिद्ध कृष्णा, आवेश खान, मुकेश कुमार। श्रेयस अय्यर (आखिरी 2 मैचों के लिए उपकप्तान ) मैथ्यू वेड (कप्तान), जेसन बेहरेनडोर्फ, सीन एबॉट, टिम डेविड, नाथन एलिस, ट्रेविस हेड, जोश इंग्लिस, ग्लेन मैक्सवेल, केन रिचर्डसन, तनवीर सांघा, मैट शॉर्ट, स्टीव स्मिथ, मार्कस स्टोइनिस, डेविड वार्नर, एडम जम्पा।","pubDate":"2023-11-28 00:30:01","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"520927a9d6acb3992f39cdbbe76cd74c","title":"Hathurusingha excited to oversee Bangladesh’s change of guard","link":"https://www.ft.lk/sports/Hathurusingha-excited-to-oversee-Bangladesh-s-change-of-guard/23-755671","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Bangladesh’s Head Coach Chandika Hathurusingha believes that the upcoming Test series against New Zealand is an exciting opportunity for the youngsters. After an underwhelming ICC Men’s Cricket World Cup campaign, Bangladesh will change formats and take on New Zealand in a two-Test series at home. The side will bear a new look, given a number of senior players are skipping the series due to various reasons. Shakib Al Hasan misses out due to a finger injury, Litton Das has been granted a paternity leave, and Taskin Ahmed has a shoulder niggle to manage. Apart from them, senior opener Tamim Iqbal also remains out of contention. Speaking to the reporters ahead of the game, Hathurusingha stated that losing this amount of experience was a significant setback for Bangladesh. “It’s challenging to lose that much of experience from any team, especially for Bangladesh. Those guys have been part of the Bangladesh team in every format for more than 15 years. Some of them for ten years.” However, he added that this only meant that opportunities opened up for Bangladesh’s upcoming cricketing talent. “It is however something to look forward to, to see what the youngsters can do,” Hathurusingha added that it was also a time for change. “I think it’s a time that we need to move on from some of the players that have played for a long time. They are not going to be there forever. “But this is happening because of many reasons. I think it’s exciting and it’s an opportunity for some of the youngsters to make their name and then have a long career.” Bangladesh’s squad features three players uncapped at the Test level: Hasan Murad, Hasan Mahmud, and Shahadat Hossain Dipu. At the same time, Hathurusingha was well aware of the challenge of having not played much red-ball cricket leading into the series. A number of Bangladesh’s players, however, managed to feature in the last round of their first-class National Cricket League, after arriving home from the World Cup. “The challenge is these guys haven’t played enough cricket leading up to. So our planning has to be a little bit better than this going forward and making a bigger pool of players available for every position in bowling and batting. “We used the NCL matches for the guys who played the World Cup as preparation. “Most of the batters made use of that opportunity. Most of the other players have been playing NCL. This is almost like a new-look Bangladesh team for various reasons. Not by design. I think we are ready as we can be and I’m looking forward to this Test series.” The coach banked on his spin attack to deliver for the Tigers in the series. “There is experience in Taijul (Islam) and (Mehidy Hasan) Miraz. Taijul has 177 Test wickets. Definitely, he’ll be a leader of the attack and Miraz is playing since 2016 if I remember correctly,” Hathurusingha added. “Then there’s young Murad and Naeem Hassan. I think playing on this condition and this heat, those guys, spinners mainly, will play a big role.” The first Test commences on Tuesday, 28 November in Sylhet. Bangladesh Test squad: Najmul Hossain Shanto (c), Shadman Islam, Mehidy Hasan Miraz, Mominul Haque, Shahadat Hossain Dipu, Mushfiqur Rahim, Nurul Hasan, Mahmudul Hasan, Taijul Islam, Naeem Hasan, Khaled Ahmed, Shoriful Islam, Hasan Mahmud, Hasan Murad, Zakir Hasan.","pubDate":"2023-11-27 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"27468014de683ee182433dddcb320ef7","title":"Shubman Gill Breaks Silence On Replacing Hardik Pandya As GT Skipper","link":"https://sports.ndtv.com/cricket/to-all-fans-shubman-gills-first-reaction-on-replacing-hardik-pandya-as-gujarat-titans-skipper-4610573","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill expressed his delight after being announced as the captain of the Indian Premier League franchise Gujarat Titans.","content":"India's rising star Shubman Gill expressed his delight after being announced as the captain of the Indian Premier League franchise Gujarat Titans ahead of the Indian Premier League (IPL) 2024 season. After the former GT skipper went back to his beloved Mumbai Indian earlier on Monday, the 'Little Prince' of Ahmedabad was handed the captaincy duties. Gill stated that he was proud to assume the role and thanked the franchise for putting their trust in him. \"I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let's make it memorable! To all the fans... #AavaDe,\" Gill wrote on X. Gill has amassed 1373 runs in 33 innings at an average of 47.34, with three centuries and eight fifties. Last season was monumental for the opener as he slammed 890 runs in 17 matches at an average of 59.33, with three centuries and four fifties and was also named Orange Cap winner. I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let's make it memorable! To all the fans… #AavaDe ! pic.twitter.com/LNELWqwURD The opener was instrumental in GT's sensation run since its debut in the IPL. Last season, he smoked 129 runs in 60 balls against Mumbai Indians, the highest by a batter in the IPL playoffs. \"I am delighted and proud to assume the Captaincy of Gujarat Titans and thank the franchise for their trust in me to lead such a fine team. We have had two exceptional seasons and I keenly look forward to leading the team with our exciting brand of cricket,\" Gill said in the announcement. After winning the Indian Premier League (IPL) in their debut season in 2022, GT reached the finals in the next season, losing to Chennai Super Kings (CSK). Gill also hammered three centuries in the last IPL. Only Royal Challengers Bangalore (RCB) batter Virat Kohli (2016) and Rajasthan Royals batter Jos Buttler (2022) had more in a single IPL season, scoring four each. Pandya moving back to Mumbai Indians could turn out to be a major loss for GT as under the leadership of an experienced all-rounder, GT lifted the IPL trophy in their debut season and made their place in the final in the subsequent season but ended up falling short against MS Dhoni's Chennai Super Kings.","pubDate":"2023-11-28 02:40:09","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8aa491642c824464b43a3cf5ffe7ed2","title":"IPL 2024 से पहले ही मुंबई इंडियंस के बॉलर ने किया बड़ा धमाका, करियर में पूरे किए 1000 विकेट","link":"https://www.indiatv.in/sports/cricket/piyush-chawla-completes-1000-wickets-in-career-mumbai-indians-bowler-vijay-hazare-trophy-2023-11-28-1004416","keywords":null,"creator":null,"video_url":null,"description":"Mumabi Indians: मुंबई इंडियंस के एक स्टार खिलाड़ी ने घरेलू क्रिकेट में कमाल का प्रदर्शन किया है। इस खिलाड़ी ने अपने करियर में 1000 विकेट पूरे कर लिए हैं।","content":"IPL 2024 के लिए फैंस बहुत ही ज्यादा उत्साहित हैं। आईपीएल 2024 के लिए मिनी ऑक्शन का आयोजन दुबई में 19 दिसंबर को आयोजित किया जाएगा। सभी आईपीएल टीमों ने अपनी रिटेंशन और रिलीज खिलाड़ियों की लिस्ट आईपीएल गवर्निंग काउंसिल को सौंप दी है। अब आईपीएल 2024 से पहले ही मुंबई इंडियंस के एक स्टार खिलाड़ी ने कमाल करते हुए करियर में 1000 विकेट पूरे कर लिए हैं। आइए जानते हैं, इस खिलाड़ी के बारे में। मुंबई इंडियंस के स्टार खिलाड़ी पीयूष चावला ने घरेलू क्रिकेट में विजय हजारे ट्रॉफी में खेलते हुए कमाल का प्रदर्शन किया है। उन्होंने गुजरात के लिए खेलते हुए अरुणाचल प्रदेश के खिलाफ 10 ओवर में 30 रन देकर 3 विकेट चटकाए। उन्होंने एक ओवर मेडन भी फेंका। इसी के साथ वह अपने क्रिकेट करियर में 1000 विकेट पूरे करने में सफल रहे। पीयूष अपनी बेहतरीन गेंदबाजी के लिए जाने जाते हैं और उनकी स्पिन को खेलना किसी भी बल्लेबाज के लिए आसान नहीं है। उनकी गुगली का कोई जवाब नहीं है। पीयूष चावला ने फर्स्ट क्लास करियर में 445 विकेट, टी20 क्रिकेट में 302 विकेट और लिस्ट-ए क्रिकेट में 254 विकेट चटकाए हैं। इस तरह से उनके नाम अब 1001 विकेट दर्ज हो गए हैं। वह 34 साल के हो चुके हैं। फिर भी उनकी फुर्ती मैदान पर देखते बनती है। उन्हें आईपीएल 2023 ऑक्शन में मुंबई इंडियंस की टीम ने 50 लाख रुपये में खरीदा था। इसके बाद उन्होंने आईपीएल 2023 में कमाल का प्रदर्शन भी किया। उन्होंने मुंबई के लिए 16 मैचों में 18 विकेट अपने नाम किए। पीयूष चावला ने भारत के लिए तीनों ही फॉर्मेट में क्रिकेट खेला है। उन्होंने भारत के लिए साल 2006 में टेस्ट में डेब्यू किया था। लेकिन टीम इंडिया में उन्हें पिछले 12 साल से मौका नहीं मिला है। उन्होंने भारत के लिए 2 टेस्ट, 25 वनडे और 7 टी20 मैच खेले हैं। यह भी पढ़ें:","pubDate":"2023-11-28 02:37:47","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"702b2344096ed8b8be4a372211e50f87","title":"India's Predicted XI vs Australia, 3rd T20I: Will Shivam Dube Make Cut?","link":"https://sports.ndtv.com/cricket/ind-vs-aus-3rd-t20i-india-s-predicted-xi-4609740","keywords":null,"creator":null,"video_url":null,"description":"India had named the same Playing XI for the second T20I against Australia which featured in the first match","content":"India will take on Australia in 3rd T20I of Australia in India, five-match T20I Series 2023 on November 28 at Barsapara Cricket Stadium in Guwahati. The match commences at 7:00 PM IST. India registered two convincing victories in the series so far. With the ongoing tour happening swiftly after the end of the ODI World Cup, a lot of India's first-choice players were not involved in the playing XI. Suryakumar Yadav, who featured in the final against Australia in Ahmedabad, was chosen to lead the Indian side in the series as Rohit Sharma and vice-captain Hardik Pandya were unavailable for selection. Yadav starred with a terrific 80 off 42 balls in the first T20I to steer India to a record run chase. In the last match in Thiruvananthapuram, India batted first and mounted a huge total. Yashasvi Jaiswal, Ruturaj Gaikwad and Ishan Kishan scored half-centuries, while Rinku Singh chipped in with a terrific 31 off nine balls to finish the innings, as India ended with 235/4 in 20 overs. Australia could only manage 191/9 in reply, as Ravi Bishnoi and Prasidh Krishna returned with three wickets each. Here's India's predicted XI for the third T20I Openers: Yashasvi Jaiswal, Ruturaj Gaikwad Yashasvi Jaiswal has been in top form in this series and registered a quickfire half-century in the last match at the Greenfield Stadium. His 53 off 25 balls set the tone for the middle order, which included nine fours and two sixes. He was also named Player of the Match for his effort. Ruturaj Gaikwad, after being run out without facing a ball in the first match, got a well-timed half-century. He played the anchor as Jaiswal and Ishan Kishan went after the bowlers. His 58 off 43 deliveries included three fours and two sixes. Middle order: Ishan Kishan, Suryakumar Yadav, Tilak Varma, Rinku Singh Advertisement The Indian middle order has three hard-hitting left-handed batters who are capable of changing the game on its head. The only right-handed batter in this setup is the skipper Suryakumar Yadav, who is the only cricketer with an average of 40+ and a strike-rate of 170+ in T20 internationals. Suryakumar Yadav smashed a terrific 80 off 42 balls in the first T20I and got a good start with a 10-ball 19 in the second match. Ishan Kishan took time to get going in both matches, but finished with much-needed half-centuries. He is the leading run-scorer in the series currently for India. Rinku Singh delivered a big finish to help India complete the big run chase in the first T20I. He was at it once again in the second match, smashing a quickfire 31. Tilak Varma got some big hits in both matches but is yet to fire with a big knock. All-rounders: Axar Patel In both high-scoring encounters, Axar Patel has been the only redeeming factor in the Indian bowling setup in terms of economy. His 0/32 in the first T20I was instrumental in not letting Australia run away with a bigger score, while his 1/25 in four overs while defending 236 runs was an outright match-winning contribution. He is capable of chipping in with runs with the bat as well. Bowlers: Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna Ravi Bishnoi was taken for runs in the opening match, but he has scalped crucial wickets so far. Bishnoi has four wickets, including three in the last match. He dismissed three destructive batters in Matthew Short, Josh Inglis and Tim David to put India in the driver's seat. The pacers' trio of Arshdeep Singh, Mukesh Kumar and Prasidh Krishna have been very expensive so far, but they have picked up timely wickets. Prasidh returned with three wickets in the second T20I, while Mukesh bowled an excellent final over in the first T20I, giving away only five runs. India's predicted playing XI: Yashasvi Jaiswal, Ruturaj Gaikwad, Ishan Kishan (wk), Suryakumar Yadav (captain), Rinku Singh, Tilak Varma, Axar Patel, Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna","pubDate":"2023-11-28 02:31:14","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d069ab29fd322ac1e44a1f0b2e541d1a","title":"Iceland Cricket's Hilarious Request To ICC On Hosting CT 2025 Goes Viral","link":"https://sports.ndtv.com/cricket/iceland-crickets-hilarious-request-to-icc-on-hosting-champions-trophy-2025-goes-viral-4611690","keywords":null,"creator":null,"video_url":null,"description":"Iceland Cricket took to social media to express their interest in hosting the Champions Trophy 2025 in a hilarious post amid rumours of Pakistan losing on the hosting rights.","content":"Iceland Cricket took to social media to express their interest in hosting the Champions Trophy 2025 in a hilarious post amid rumours of Pakistan losing on the hosting rights due to India's stance on not travelling. India and Pakistan have not played a bilateral series for around a decade due to political tensions and several reports have claimed that the tournament can be shifted to Dubai. Iceland Cricket wrote an entire letter with jokes regarding their challenging weather conditions and lack of standard cricket grounds in a bid to host the competition amid the ongoing reports and rumours. \"We are not people who hold back. We have today issued our bid to host the Champions Trophy of 2025, and we look forward to hearing what Greg Barclay of ICC has to say about it,\" the post read on X. Earlier, Iceland Cricket took a fresh aim at Pakistan star batter Babar Azam , who recently stepped down as captain of the team across formats. We are not people who hold back. We have today issued our bid to host the Champions Trophy of 2025, and we look forward to hearing what Greg Barclay of @ICC has to say about it. pic.twitter.com/EsRzsikCqF Babar relinquished his captaincy amid backlash over Pakistan's early exit from the Cricket World Cup 2023. Babar had a below par tournament with the bat as Pakistan failed to qualify for the semi-finals. He scored 320 runs in the nine matches, averaging less than 40. Taking to social media platform X, Iceland Cricket trolled Babar over his average. Responding to a post, which read \"What is something that still hasn't gone back to normal after the pandemic?\", Iceland Cricket replied, saying: \"The batting average of Babar Azam\". Babar's captaincy came under the spotlight after Pakistan lost to minnows Afghanistan in the World Cup. Pakistan lost five of their nine matches and finished fifth in the points table. Team director Mickey Arthur and head coach Grant Bradburn have been removed from their positions with former skipper Mohammad Hafeez taking over both their roles.","pubDate":"2023-11-28 02:24:38","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3ef8089f55ccab6533894478eeb1c0a6","title":"\"I Know You Will...\": Hardik's Message To MI After Sealing Return From GT","link":"https://sports.ndtv.com/cricket/i-know-you-will-hardik-pandyas-message-to-mumbai-indians-after-completing-switch-from-gujarat-titans-4611842","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team all-rounder Hardik Pandya completed a sensational move to Mumbai Indians from Gujarat Titans.","content":"Hardik Pandya, who made his return to the Indian Premier League (IPL) franchise Mumbai Indians (MI), on Monday reflected back on his journey with the five-time champions. After tasting success with Gujarat Titans in the past two years, the experienced all-rounder on Monday returned to the franchise where his career began in 2015.\"I am back. Rohit, Bumrah, Surya, Ishan, Polly (Pollard), Malinga. Come on let's begin. Obviously, the feeling of coming back to Mumbai is very special for a lot of reasons. How my cricketing journey started in 2015 with MI, them noticing me in 2013...when I look back...how my span of 10 years has been something very special. It has not sunk in yet that finally, I am back where my whole cricketing journey started. I have achieved all the possible things. They have been the most important part of my life,\" Hardik said in a video posted by MI on X Watch talk about his happy homecoming, teaming up with his and resuming his journey with #MumbaiIndians #OneFamily #MumbaiMeriJaan @hardikpandya7 pic.twitter.com/sm6dXGJYCI He talked about the special bond he shares with the MI owners as well as the fans. \"Special bond with Akash and the whole family. They have been with me through thick and thin and it is much more emotional because it feels like I am coming back to my home. I am coming back to my family where it all started. Paltan, you supported me the first time and all the memories have a special place in my heart and all the memories have a special place in my heart. I know you will back me once again. We created history as a team and now I am looking forward to creating some wonderful moments with the boys once again. Mere hardik swagat ke liye , thank you,\" Hardik added. Hardik played 92 matches for MI from 2015-2021, scoring 1,476 runs at an average of 27.33 at a strike rate of over 153, with four half-centuries and best score of 91. He also took 42 wickets for the team, with the best bowling figures of 3/20. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-28 02:20:29","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bc3775f31d4b590438cc067de51aab89","title":"IND Vs AUS T20I 3rd Match: இந்தியா - ஆஸ்திரேலியா அணிகள் மோதும், மூன்றாவது டி20 தொடர்: தொடரை வெல்லும் முனைப்பில் தீவிர பயிற்சியில் இந்திய அணி.!","link":"https://tamil.latestly.com/sports/ind-vs-aus-t20i-3rd-match-today-in-assam-guwahati-cricket-stadium-on-28-nov-2023-10155.html","keywords":null,"creator":null,"video_url":null,"description":"நவம்பர் 28ம் தேதியான இன்று, இந்தியா - ஆஸ்திரேலியா அணிகளுக்கான 20 ஓவர்கள் கொண்ட டி20 கிரிக்கெட் தொடர் ஆட்டம் நடைபெறுகிறது.","content":"நவம்பர் 28, அசாம் (Sports News): 5 போட்டிகள் கொண்ட டி20 தொடர்களில் இந்தியா - ஆஸ்திரேலியா (T20I Series India Vs Australia) அணிகள் மோதிக்கொள்ளும் இரண்டு ஆட்டங்கள் நிறைவுபெற்றுள்ளன. இரண்டு போட்டிகளிலும் இந்திய அணி அபார வெற்றி அடைந்துள்ளது. நவம்பர் 28ம் தேதியான இன்று, இந்தியா - ஆஸ்திரேலியா அணிகளுக்கான 20 ஓவர்கள் கொண்ட டி20 கிரிக்கெட் தொடர், அசாம் மாநிலத்தில் உள்ள கவுகாத்தியில் இருக்கும் பர்சபரா கிரிக்கெட் மைதானத்தில் வைத்து நடைபெறுகிறது. Earthquake Today: நியூ கினியா, சீனா, பாகிஸ்தான் நாடுகளில் அதிகாலையில் அடுத்தடுத்து பயங்கர நிலநடுக்கம்: அச்சத்தில் மக்கள்.! இந்த ஆட்டத்தை இந்திய கிரிக்கெட் அணி சூரியகுமார் யாதவின் தலைமையில் எதிர்கொள்கிறது. கடந்த இரண்டு போட்டிகளிலும் வென்று, தொடரை கைப்பற்றும் முனைப்புடன் இந்திய அணி விளையாடி வருகிறது. இன்றைய ஆட்டத்தினை ஜியோ சினிமா செயலி, ஸ்போர்ட்ஸ் 18 தொலைக்காட்சி ஆகியவற்றில் நேரலையில் கண்டுமகிழலாம். இன்று இரவு இந்திய நேரப்படி, 06:30க்கு டாஸ் போடப்பட்டு 07:00 மணியளவில் ஆட்டம் தொடங்கும். இந்தியா 5ல் 2 போட்டிகளில் வெற்றிபெற்று 2 - 0 கணக்கில் முன்னிலையில் இருக்கிறது. முன்னதாக 2023 உலகக்கோப்பை தொடரை இந்திய மண்ணில் ஆஸ்திரேலிய அணி கைப்பற்றியது குறிப்பிடத்தக்கது.","pubDate":"2023-11-28 02:02:35","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"tamil"},{"article_id":"f0731b98ba0a12fc10f83b44e631bb57","title":"RCB में कैमरून ग्रीन को मिलेगा ये रोल, टीम डायरेक्टर ने कर दिया बिल्कुल साफ","link":"https://www.indiatv.in/sports/cricket/rcb-team-director-of-cricket-mo-bobat-on-cameron-green-role-in-team-middle-order-2023-11-28-1004409","keywords":null,"creator":null,"video_url":null,"description":"RCB की टीम ने ऑस्ट्रेलियाई ऑलराउंडर कैमरून ग्रीन को मुंबई इंडियंस से ट्रेड किया है। आरसीबी की टीम में ग्रीन का क्या रोल होगा। इस पर टीम डायरेक्टर ने बड़ी बात कही है।","content":"IPL रिटेंशन के बाद आरसीबी की टीम ने कैमरून ग्रीन को मुंबई इंडियंस से ट्रेड कर लिया है। आरसीबी ने इसके लिए 17.50 करोड़ रुपये की रकम चुकाई। ग्रीन बेहतरीन गेंदबाजी के साथ-साथ धाकड़ बैटिंग करने में माहिर प्लेयर हैं। उनके आरसीबी में आने से टीम को संतुलन मिलेगा। ग्रीन बेहतरीन फॉर्म में चल रहे हैं और टी20 क्रिकेट में वह चंद गेंदों में मैच का रुख बदल देते हैं। आरसीबी की टीम में उनका क्या रोल होगा। इसको लेकर डायरेक्टर मो बोबाट ने बड़ा बयान दिया है। RCB के निदेशक मो बोबाट के कहा कि कैमरून ग्रीन रॉयल चैलेंजर्स बैंगलोर के लिए एक विस्फोटक पैकेज हो सकते हैं, खासकर चिन्नास्वामी स्टेडियम में। आरसीबी बोल्ड डायरीज में उन्होंने कहा कि वह मिडिल ऑर्डर में पावर हिटर की भूमिका के लिए बिल्कुल फिट हैं। वह बेहतरीन और कुशल बल्लेबाज हैं। उनके पास तेज और स्पिन गेंदबाजी दोनों को खेलने वाले शॉट हैं। ग्रीन शानदार फील्डर भी हैं। उसने हाल के दिनों में फील्डिंग करते हुए अच्छे कैच लपके हैं और गली में फील्डिंग करते हुए वह काफी प्रभावशाली हैं। आरसीबी के नए मुख्य कोच एंडी फ्लावर भी कैमरून ग्रीन को टीम में शामिल करने से उत्साहित थे। फ्लॉवर ने कहा कि हमारा फोकस वास्तव में मिडिल ऑर्डर के आसपास था और हम मिडिल ऑर्डर में सुधार कर सकते हैं। हम विदेशी खिलाड़ियों पर सही संतुलन बनाना चाहते हैं। आज के समय में ऑलराउंडर अहम हैं। ऐसे में हमने काफी बहस की और ग्रीन की एंट्री हो गई है। कैमरून ग्रीन की एंट्री के बाद आरसीबी के पास आईपीएल 2024 ऑक्शन से पहले 23.25 करोड़ रुपये बचे हुए हैं। टीम ने आईपीएल रिटेंशन में 11 खिलाड़ियों को रिलीज किया है। वानिंदु हसरंगा, हर्षल पटेल, जोश हेजलवुड, फिन एलन, माइकल ब्रेसवेल, डेविड विली, वेन पार्नेल, सोनू यादव, अविनाश सिंह, सिद्धार्थ कौल, केदार जाधव शामिल हैं। वहीं ट्रेड के जरिए शाहबाज अहमद को सनराइजर्स हैदराबाद में भेज दिया गया है। रिटेन खिलाड़ी: फाफ डु प्लेसिस, रजत पाटीदार, विराट कोहली, अनुज रावत, दिनेश कार्तिक, सुयश प्रभुदेसाई, विल जैक्स, ग्लेन मैक्सवेल, महिपाल लोमरोर, कर्ण शर्मा, मनोज भंडागे, आकाश दीप, मोहम्मद सिराज, रीस टॉपले, हिमांशु शर्मा, राजन कुमार, विशक विजयकुमार, मयंक डागर और कैमरून ग्रीन (ट्रेड से हासिल किया) यह भी पढ़ें:","pubDate":"2023-11-28 01:47:36","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2e0ca3cdfef7de2db42344455d0b59da","title":"See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act","link":"https://www.dailymail.co.uk/sport/cricket/article-12797567/Adam-Gilchrist-son-Harry-Instagram-park-cricket-funny.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The batting and wicketkeeping great's Instagram pics had his teammates Jason Gillespie and Damien Martyn in stitches.","content":"See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act All-time great wicketkeeper posted funny pic on Instagram Features his son Harry proving that parenting isn't easy Photos had other Aussie cricket greats in stitches By Shayne Bugden For Daily Mail Australia Published: 19:48 EST, 27 November 2023 | Updated: 19:48 EST, 27 November 2023 e-mail View comments Adam Gilchrist made taking catches and scoring centuries look easy when he was starring in the Australian cricket team, but his recent light-hearted post on Instagram showed parenting doesn't always come easy for the 52-year-old. The legendary wicketkeeper showed his followers two shots of his eldest son Harry in Adam Gilchrist Park in the northern NSW village of Caniaba, on the outskirts of Lismore. They were accompanied by the caption: 'Set an example, and then hope to gain your child's respect. All you can ask for as a parent.' The first shot shows Harry smiling as he poses next to the sign bearing his father's name - but the second photo shows him pretending to urinate on it. The cricket great's first photo showed his eldest son innocently smiling as he posed in a park named after his father in northern NSW But the second image is what left other cricket stars in stitches as Harry pretended to urinate on the sign bearing his dad's name Gilchrist's hilarious post has been liked more than 25,000 times with some of the cricketer's world-famous teammates enjoying a good laugh at his expense. Fast bowler Jason Gillespie responded with a series of cry-laughing emojis, with Damien Martyn writing 'That's gold' along with fire and more cry-laughing emojis. Women's star Beth Mooney also chipped in and footy commentator James Brayshaw added, 'You wouldn't have it any other way.' However, some Indian cricket fans - who were likely still getting over their side's shock loss to Australia in the World Cup final - used the opportunity to slam Aussies. 'Its simple like Michel marsh [sic] putting his leg on world cup trophy ..its in your culture ..no wonder,' one wrote, referring to the furore over Mitchell Marsh being photographed with his foot on one of cricket's biggest awards. Gilchrist (pictured at Perth stadium earlier this month) got a big laugh out of his former teammate Jason Gillespie with the cheeky display on Instagram Another of Gilchrist's mates from his playing days, Damien Martyn (pictured) responded to the photos by writing 'That's gold' Harry, 21, is the eldest of Gilchrist's four children with wife Melinda: Annie, 18, Archie, 16, and Ted, 12. Lismore - where the cricket great moved to as a teenager after being born in Bellingen near the NSW north coast - also features the Adam Gilchrist Oval and Pavilion. In March the ex-wickie played in a star-studded celebrity T20 cricket match to raise money for the town after it was smashed by the biggest flood in modern Australian history in February 2022. 'It's something close to my heart,' Gilchrist said. 'I've watched with sadness and frustration from afar so when Steve [Krieg, mayor] asked me if I'd be keen to help create a T20 match with some high profile players I jumped at the opportunity. 'It's a privilege and a pleasure to be able to contribute in some small way.' Instagram New South Wales Share or comment on this article: See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-28 00:48:14","image_url":"https://i.dailymail.co.uk/1s/2023/11/28/00/78297589-0-image-m-14_1701129830217.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2229f8b92898735d299897404e6b18b8","title":"IND vs AUS: गुवाहाटी में होगी रनों की बरसात या गेंदबाजों को मिलेगा साथ? मैच से पहले पढ़ें ये पिच रिपोर्ट","link":"https://www.indiatv.in/sports/cricket/ind-vs-aus-3rd-t20i-barsapara-cricket-stadium-guwahati-pitch-report-2023-11-27-1004391","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd T20I: ऑस्ट्रेलिया के खिलाफ 5 मैचों की टी20 सीरीज का तीसरा मैच टीम इंडिया गुवाहाटी में खेलेगी। इस मैदान पर ये चौथा टी20I मैच होगा।","content":"भारत और ऑस्ट्रेलिया के बीच सीरीज का तीसरा टी20 मैच आज (28 नवंबर) गुवाहाटी के बारसापारा क्रिकेट स्टेडियम में खेला जाएगा। इस सीरीज में टीम इंडिया फिलहाल 2-0 से आगे चल रही है। ऐसे में टीम इंडिया तीसरे टी-20 मैच में सीरीज सील करने के इरादे से मैदान पर उतरेगी। वहीं, ऑस्ट्रेलियाई टीम सीरीज में वापसी के इरादे के साथ उतरेगी। गुवाहाटी के बरसापारा क्रिकेट स्टेडियम का विकेट धीमा माना जाता है। लेकिन इस मैदान पर खेला गया आखिरी टी20 काफी हाई स्कोरिंग रहा था। पिछले साल इस मैदान पर अक्टूबर में भारत और साउथ अफ्रीका के बीच खेले गए टी20 मैच में कुल 400 से ज्यादा रन देखने को मिले थे। यानी इस सीरीज में एक बार फिर हाई स्कोरिंग मैच देखने को मिल सकता है। ऑस्ट्रेलिया ने यहां भारत के खिलाफ एक टी20 इंटरनेशनल मैच खेला है, जिसमें ऑस्ट्रेलियाई टीम ने 8 विकटों से बाजी मारी थी। वहीं, टीम इंडिया ने इस मैदान पर 3 में से 1 ही मैच जीता है और एक बेनतीजा रहा था। भारत ने 3 में से एक मैच ऑस्ट्रेलिया के खिलाफ गंवाया है और श्रीलंका के खिलाफ भारतीय टीम का मुकाबला बेनतीजा रहा है। वहीं, इस मैदान पर उसने अपने आखिरी मैच में साउथ अफ्रीका को हराया था। सूर्यकुमार यादव (कप्तान), ऋतुराज गायकवाड (उपकप्तान), ईशान किशन, यशस्वी जयसवाल, तिलक वर्मा, रिंकू सिंह, जितेश शर्मा (विकेटकीपर), वॉशिंगटन सुंदर, अक्षर पटेल, शिवम दुबे, रवि बिश्नोई, अर्शदीप सिंह, प्रसिद्ध कृष्णा, आवेश खान, मुकेश कुमार। श्रेयस अय्यर (आखिरी 2 मैचों के लिए उपकप्तान ) मैथ्यू वेड (कप्तान), जेसन बेहरेनडोर्फ, सीन एबॉट, टिम डेविड, नाथन एलिस, ट्रेविस हेड, जोश इंग्लिस, ग्लेन मैक्सवेल, केन रिचर्डसन, तनवीर सांघा, मैट शॉर्ट, स्टीव स्मिथ, मार्कस स्टोइनिस, डेविड वार्नर, एडम जम्पा।","pubDate":"2023-11-28 00:30:01","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"520927a9d6acb3992f39cdbbe76cd74c","title":"Hathurusingha excited to oversee Bangladesh’s change of guard","link":"https://www.ft.lk/sports/Hathurusingha-excited-to-oversee-Bangladesh-s-change-of-guard/23-755671","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Bangladesh’s Head Coach Chandika Hathurusingha believes that the upcoming Test series against New Zealand is an exciting opportunity for the youngsters. After an underwhelming ICC Men’s Cricket World Cup campaign, Bangladesh will change formats and take on New Zealand in a two-Test series at home. The side will bear a new look, given a number of senior players are skipping the series due to various reasons. Shakib Al Hasan misses out due to a finger injury, Litton Das has been granted a paternity leave, and Taskin Ahmed has a shoulder niggle to manage. Apart from them, senior opener Tamim Iqbal also remains out of contention. Speaking to the reporters ahead of the game, Hathurusingha stated that losing this amount of experience was a significant setback for Bangladesh. “It’s challenging to lose that much of experience from any team, especially for Bangladesh. Those guys have been part of the Bangladesh team in every format for more than 15 years. Some of them for ten years.” However, he added that this only meant that opportunities opened up for Bangladesh’s upcoming cricketing talent. “It is however something to look forward to, to see what the youngsters can do,” Hathurusingha added that it was also a time for change. “I think it’s a time that we need to move on from some of the players that have played for a long time. They are not going to be there forever. “But this is happening because of many reasons. I think it’s exciting and it’s an opportunity for some of the youngsters to make their name and then have a long career.” Bangladesh’s squad features three players uncapped at the Test level: Hasan Murad, Hasan Mahmud, and Shahadat Hossain Dipu. At the same time, Hathurusingha was well aware of the challenge of having not played much red-ball cricket leading into the series. A number of Bangladesh’s players, however, managed to feature in the last round of their first-class National Cricket League, after arriving home from the World Cup. “The challenge is these guys haven’t played enough cricket leading up to. So our planning has to be a little bit better than this going forward and making a bigger pool of players available for every position in bowling and batting. “We used the NCL matches for the guys who played the World Cup as preparation. “Most of the batters made use of that opportunity. Most of the other players have been playing NCL. This is almost like a new-look Bangladesh team for various reasons. Not by design. I think we are ready as we can be and I’m looking forward to this Test series.” The coach banked on his spin attack to deliver for the Tigers in the series. “There is experience in Taijul (Islam) and (Mehidy Hasan) Miraz. Taijul has 177 Test wickets. Definitely, he’ll be a leader of the attack and Miraz is playing since 2016 if I remember correctly,” Hathurusingha added. “Then there’s young Murad and Naeem Hassan. I think playing on this condition and this heat, those guys, spinners mainly, will play a big role.” The first Test commences on Tuesday, 28 November in Sylhet. Bangladesh Test squad: Najmul Hossain Shanto (c), Shadman Islam, Mehidy Hasan Miraz, Mominul Haque, Shahadat Hossain Dipu, Mushfiqur Rahim, Nurul Hasan, Mahmudul Hasan, Taijul Islam, Naeem Hasan, Khaled Ahmed, Shoriful Islam, Hasan Mahmud, Hasan Murad, Zakir Hasan.","pubDate":"2023-11-27 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"27468014de683ee182433dddcb320ef7","title":"Shubman Gill Breaks Silence On Replacing Hardik Pandya As GT Skipper","link":"https://sports.ndtv.com/cricket/to-all-fans-shubman-gills-first-reaction-on-replacing-hardik-pandya-as-gujarat-titans-skipper-4610573","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill expressed his delight after being announced as the captain of the Indian Premier League franchise Gujarat Titans.","content":"India's rising star Shubman Gill expressed his delight after being announced as the captain of the Indian Premier League franchise Gujarat Titans ahead of the Indian Premier League (IPL) 2024 season. After the former GT skipper went back to his beloved Mumbai Indian earlier on Monday, the 'Little Prince' of Ahmedabad was handed the captaincy duties. Gill stated that he was proud to assume the role and thanked the franchise for putting their trust in him. \"I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let's make it memorable! To all the fans... #AavaDe,\" Gill wrote on X. Gill has amassed 1373 runs in 33 innings at an average of 47.34, with three centuries and eight fifties. Last season was monumental for the opener as he slammed 890 runs in 17 matches at an average of 59.33, with three centuries and four fifties and was also named Orange Cap winner. I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let's make it memorable! To all the fans… #AavaDe ! pic.twitter.com/LNELWqwURD The opener was instrumental in GT's sensation run since its debut in the IPL. Last season, he smoked 129 runs in 60 balls against Mumbai Indians, the highest by a batter in the IPL playoffs. \"I am delighted and proud to assume the Captaincy of Gujarat Titans and thank the franchise for their trust in me to lead such a fine team. We have had two exceptional seasons and I keenly look forward to leading the team with our exciting brand of cricket,\" Gill said in the announcement. After winning the Indian Premier League (IPL) in their debut season in 2022, GT reached the finals in the next season, losing to Chennai Super Kings (CSK). Gill also hammered three centuries in the last IPL. Only Royal Challengers Bangalore (RCB) batter Virat Kohli (2016) and Rajasthan Royals batter Jos Buttler (2022) had more in a single IPL season, scoring four each. Pandya moving back to Mumbai Indians could turn out to be a major loss for GT as under the leadership of an experienced all-rounder, GT lifted the IPL trophy in their debut season and made their place in the final in the subsequent season but ended up falling short against MS Dhoni's Chennai Super Kings.","pubDate":"2023-11-28 02:40:09","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8aa491642c824464b43a3cf5ffe7ed2","title":"IPL 2024 से पहले ही मुंबई इंडियंस के बॉलर ने किया बड़ा धमाका, करियर में पूरे किए 1000 विकेट","link":"https://www.indiatv.in/sports/cricket/piyush-chawla-completes-1000-wickets-in-career-mumbai-indians-bowler-vijay-hazare-trophy-2023-11-28-1004416","keywords":null,"creator":null,"video_url":null,"description":"Mumabi Indians: मुंबई इंडियंस के एक स्टार खिलाड़ी ने घरेलू क्रिकेट में कमाल का प्रदर्शन किया है। इस खिलाड़ी ने अपने करियर में 1000 विकेट पूरे कर लिए हैं।","content":"IPL 2024 के लिए फैंस बहुत ही ज्यादा उत्साहित हैं। आईपीएल 2024 के लिए मिनी ऑक्शन का आयोजन दुबई में 19 दिसंबर को आयोजित किया जाएगा। सभी आईपीएल टीमों ने अपनी रिटेंशन और रिलीज खिलाड़ियों की लिस्ट आईपीएल गवर्निंग काउंसिल को सौंप दी है। अब आईपीएल 2024 से पहले ही मुंबई इंडियंस के एक स्टार खिलाड़ी ने कमाल करते हुए करियर में 1000 विकेट पूरे कर लिए हैं। आइए जानते हैं, इस खिलाड़ी के बारे में। मुंबई इंडियंस के स्टार खिलाड़ी पीयूष चावला ने घरेलू क्रिकेट में विजय हजारे ट्रॉफी में खेलते हुए कमाल का प्रदर्शन किया है। उन्होंने गुजरात के लिए खेलते हुए अरुणाचल प्रदेश के खिलाफ 10 ओवर में 30 रन देकर 3 विकेट चटकाए। उन्होंने एक ओवर मेडन भी फेंका। इसी के साथ वह अपने क्रिकेट करियर में 1000 विकेट पूरे करने में सफल रहे। पीयूष अपनी बेहतरीन गेंदबाजी के लिए जाने जाते हैं और उनकी स्पिन को खेलना किसी भी बल्लेबाज के लिए आसान नहीं है। उनकी गुगली का कोई जवाब नहीं है। पीयूष चावला ने फर्स्ट क्लास करियर में 445 विकेट, टी20 क्रिकेट में 302 विकेट और लिस्ट-ए क्रिकेट में 254 विकेट चटकाए हैं। इस तरह से उनके नाम अब 1001 विकेट दर्ज हो गए हैं। वह 34 साल के हो चुके हैं। फिर भी उनकी फुर्ती मैदान पर देखते बनती है। उन्हें आईपीएल 2023 ऑक्शन में मुंबई इंडियंस की टीम ने 50 लाख रुपये में खरीदा था। इसके बाद उन्होंने आईपीएल 2023 में कमाल का प्रदर्शन भी किया। उन्होंने मुंबई के लिए 16 मैचों में 18 विकेट अपने नाम किए। पीयूष चावला ने भारत के लिए तीनों ही फॉर्मेट में क्रिकेट खेला है। उन्होंने भारत के लिए साल 2006 में टेस्ट में डेब्यू किया था। लेकिन टीम इंडिया में उन्हें पिछले 12 साल से मौका नहीं मिला है। उन्होंने भारत के लिए 2 टेस्ट, 25 वनडे और 7 टी20 मैच खेले हैं। यह भी पढ़ें:","pubDate":"2023-11-28 02:37:47","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"702b2344096ed8b8be4a372211e50f87","title":"India's Predicted XI vs Australia, 3rd T20I: Will Shivam Dube Make Cut?","link":"https://sports.ndtv.com/cricket/ind-vs-aus-3rd-t20i-india-s-predicted-xi-4609740","keywords":null,"creator":null,"video_url":null,"description":"India had named the same Playing XI for the second T20I against Australia which featured in the first match","content":"India will take on Australia in 3rd T20I of Australia in India, five-match T20I Series 2023 on November 28 at Barsapara Cricket Stadium in Guwahati. The match commences at 7:00 PM IST. India registered two convincing victories in the series so far. With the ongoing tour happening swiftly after the end of the ODI World Cup, a lot of India's first-choice players were not involved in the playing XI. Suryakumar Yadav, who featured in the final against Australia in Ahmedabad, was chosen to lead the Indian side in the series as Rohit Sharma and vice-captain Hardik Pandya were unavailable for selection. Yadav starred with a terrific 80 off 42 balls in the first T20I to steer India to a record run chase. In the last match in Thiruvananthapuram, India batted first and mounted a huge total. Yashasvi Jaiswal, Ruturaj Gaikwad and Ishan Kishan scored half-centuries, while Rinku Singh chipped in with a terrific 31 off nine balls to finish the innings, as India ended with 235/4 in 20 overs. Australia could only manage 191/9 in reply, as Ravi Bishnoi and Prasidh Krishna returned with three wickets each. Here's India's predicted XI for the third T20I Openers: Yashasvi Jaiswal, Ruturaj Gaikwad Yashasvi Jaiswal has been in top form in this series and registered a quickfire half-century in the last match at the Greenfield Stadium. His 53 off 25 balls set the tone for the middle order, which included nine fours and two sixes. He was also named Player of the Match for his effort. Ruturaj Gaikwad, after being run out without facing a ball in the first match, got a well-timed half-century. He played the anchor as Jaiswal and Ishan Kishan went after the bowlers. His 58 off 43 deliveries included three fours and two sixes. Middle order: Ishan Kishan, Suryakumar Yadav, Tilak Varma, Rinku Singh Advertisement The Indian middle order has three hard-hitting left-handed batters who are capable of changing the game on its head. The only right-handed batter in this setup is the skipper Suryakumar Yadav, who is the only cricketer with an average of 40+ and a strike-rate of 170+ in T20 internationals. Suryakumar Yadav smashed a terrific 80 off 42 balls in the first T20I and got a good start with a 10-ball 19 in the second match. Ishan Kishan took time to get going in both matches, but finished with much-needed half-centuries. He is the leading run-scorer in the series currently for India. Rinku Singh delivered a big finish to help India complete the big run chase in the first T20I. He was at it once again in the second match, smashing a quickfire 31. Tilak Varma got some big hits in both matches but is yet to fire with a big knock. All-rounders: Axar Patel In both high-scoring encounters, Axar Patel has been the only redeeming factor in the Indian bowling setup in terms of economy. His 0/32 in the first T20I was instrumental in not letting Australia run away with a bigger score, while his 1/25 in four overs while defending 236 runs was an outright match-winning contribution. He is capable of chipping in with runs with the bat as well. Bowlers: Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna Ravi Bishnoi was taken for runs in the opening match, but he has scalped crucial wickets so far. Bishnoi has four wickets, including three in the last match. He dismissed three destructive batters in Matthew Short, Josh Inglis and Tim David to put India in the driver's seat. The pacers' trio of Arshdeep Singh, Mukesh Kumar and Prasidh Krishna have been very expensive so far, but they have picked up timely wickets. Prasidh returned with three wickets in the second T20I, while Mukesh bowled an excellent final over in the first T20I, giving away only five runs. India's predicted playing XI: Yashasvi Jaiswal, Ruturaj Gaikwad, Ishan Kishan (wk), Suryakumar Yadav (captain), Rinku Singh, Tilak Varma, Axar Patel, Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna","pubDate":"2023-11-28 02:31:14","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d069ab29fd322ac1e44a1f0b2e541d1a","title":"Iceland Cricket's Hilarious Request To ICC On Hosting CT 2025 Goes Viral","link":"https://sports.ndtv.com/cricket/iceland-crickets-hilarious-request-to-icc-on-hosting-champions-trophy-2025-goes-viral-4611690","keywords":null,"creator":null,"video_url":null,"description":"Iceland Cricket took to social media to express their interest in hosting the Champions Trophy 2025 in a hilarious post amid rumours of Pakistan losing on the hosting rights.","content":"Iceland Cricket took to social media to express their interest in hosting the Champions Trophy 2025 in a hilarious post amid rumours of Pakistan losing on the hosting rights due to India's stance on not travelling. India and Pakistan have not played a bilateral series for around a decade due to political tensions and several reports have claimed that the tournament can be shifted to Dubai. Iceland Cricket wrote an entire letter with jokes regarding their challenging weather conditions and lack of standard cricket grounds in a bid to host the competition amid the ongoing reports and rumours. \"We are not people who hold back. We have today issued our bid to host the Champions Trophy of 2025, and we look forward to hearing what Greg Barclay of ICC has to say about it,\" the post read on X. Earlier, Iceland Cricket took a fresh aim at Pakistan star batter Babar Azam , who recently stepped down as captain of the team across formats. We are not people who hold back. We have today issued our bid to host the Champions Trophy of 2025, and we look forward to hearing what Greg Barclay of @ICC has to say about it. pic.twitter.com/EsRzsikCqF Babar relinquished his captaincy amid backlash over Pakistan's early exit from the Cricket World Cup 2023. Babar had a below par tournament with the bat as Pakistan failed to qualify for the semi-finals. He scored 320 runs in the nine matches, averaging less than 40. Taking to social media platform X, Iceland Cricket trolled Babar over his average. Responding to a post, which read \"What is something that still hasn't gone back to normal after the pandemic?\", Iceland Cricket replied, saying: \"The batting average of Babar Azam\". Babar's captaincy came under the spotlight after Pakistan lost to minnows Afghanistan in the World Cup. Pakistan lost five of their nine matches and finished fifth in the points table. Team director Mickey Arthur and head coach Grant Bradburn have been removed from their positions with former skipper Mohammad Hafeez taking over both their roles.","pubDate":"2023-11-28 02:24:38","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3ef8089f55ccab6533894478eeb1c0a6","title":"\"I Know You Will...\": Hardik's Message To MI After Sealing Return From GT","link":"https://sports.ndtv.com/cricket/i-know-you-will-hardik-pandyas-message-to-mumbai-indians-after-completing-switch-from-gujarat-titans-4611842","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team all-rounder Hardik Pandya completed a sensational move to Mumbai Indians from Gujarat Titans.","content":"Hardik Pandya, who made his return to the Indian Premier League (IPL) franchise Mumbai Indians (MI), on Monday reflected back on his journey with the five-time champions. After tasting success with Gujarat Titans in the past two years, the experienced all-rounder on Monday returned to the franchise where his career began in 2015.\"I am back. Rohit, Bumrah, Surya, Ishan, Polly (Pollard), Malinga. Come on let's begin. Obviously, the feeling of coming back to Mumbai is very special for a lot of reasons. How my cricketing journey started in 2015 with MI, them noticing me in 2013...when I look back...how my span of 10 years has been something very special. It has not sunk in yet that finally, I am back where my whole cricketing journey started. I have achieved all the possible things. They have been the most important part of my life,\" Hardik said in a video posted by MI on X Watch talk about his happy homecoming, teaming up with his and resuming his journey with #MumbaiIndians #OneFamily #MumbaiMeriJaan @hardikpandya7 pic.twitter.com/sm6dXGJYCI He talked about the special bond he shares with the MI owners as well as the fans. \"Special bond with Akash and the whole family. They have been with me through thick and thin and it is much more emotional because it feels like I am coming back to my home. I am coming back to my family where it all started. Paltan, you supported me the first time and all the memories have a special place in my heart and all the memories have a special place in my heart. I know you will back me once again. We created history as a team and now I am looking forward to creating some wonderful moments with the boys once again. Mere hardik swagat ke liye , thank you,\" Hardik added. Hardik played 92 matches for MI from 2015-2021, scoring 1,476 runs at an average of 27.33 at a strike rate of over 153, with four half-centuries and best score of 91. He also took 42 wickets for the team, with the best bowling figures of 3/20. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-28 02:20:29","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bc3775f31d4b590438cc067de51aab89","title":"IND Vs AUS T20I 3rd Match: இந்தியா - ஆஸ்திரேலியா அணிகள் மோதும், மூன்றாவது டி20 தொடர்: தொடரை வெல்லும் முனைப்பில் தீவிர பயிற்சியில் இந்திய அணி.!","link":"https://tamil.latestly.com/sports/ind-vs-aus-t20i-3rd-match-today-in-assam-guwahati-cricket-stadium-on-28-nov-2023-10155.html","keywords":null,"creator":null,"video_url":null,"description":"நவம்பர் 28ம் தேதியான இன்று, இந்தியா - ஆஸ்திரேலியா அணிகளுக்கான 20 ஓவர்கள் கொண்ட டி20 கிரிக்கெட் தொடர் ஆட்டம் நடைபெறுகிறது.","content":"நவம்பர் 28, அசாம் (Sports News): 5 போட்டிகள் கொண்ட டி20 தொடர்களில் இந்தியா - ஆஸ்திரேலியா (T20I Series India Vs Australia) அணிகள் மோதிக்கொள்ளும் இரண்டு ஆட்டங்கள் நிறைவுபெற்றுள்ளன. இரண்டு போட்டிகளிலும் இந்திய அணி அபார வெற்றி அடைந்துள்ளது. நவம்பர் 28ம் தேதியான இன்று, இந்தியா - ஆஸ்திரேலியா அணிகளுக்கான 20 ஓவர்கள் கொண்ட டி20 கிரிக்கெட் தொடர், அசாம் மாநிலத்தில் உள்ள கவுகாத்தியில் இருக்கும் பர்சபரா கிரிக்கெட் மைதானத்தில் வைத்து நடைபெறுகிறது. Earthquake Today: நியூ கினியா, சீனா, பாகிஸ்தான் நாடுகளில் அதிகாலையில் அடுத்தடுத்து பயங்கர நிலநடுக்கம்: அச்சத்தில் மக்கள்.! இந்த ஆட்டத்தை இந்திய கிரிக்கெட் அணி சூரியகுமார் யாதவின் தலைமையில் எதிர்கொள்கிறது. கடந்த இரண்டு போட்டிகளிலும் வென்று, தொடரை கைப்பற்றும் முனைப்புடன் இந்திய அணி விளையாடி வருகிறது. இன்றைய ஆட்டத்தினை ஜியோ சினிமா செயலி, ஸ்போர்ட்ஸ் 18 தொலைக்காட்சி ஆகியவற்றில் நேரலையில் கண்டுமகிழலாம். இன்று இரவு இந்திய நேரப்படி, 06:30க்கு டாஸ் போடப்பட்டு 07:00 மணியளவில் ஆட்டம் தொடங்கும். இந்தியா 5ல் 2 போட்டிகளில் வெற்றிபெற்று 2 - 0 கணக்கில் முன்னிலையில் இருக்கிறது. முன்னதாக 2023 உலகக்கோப்பை தொடரை இந்திய மண்ணில் ஆஸ்திரேலிய அணி கைப்பற்றியது குறிப்பிடத்தக்கது.","pubDate":"2023-11-28 02:02:35","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"tamil"},{"article_id":"f0731b98ba0a12fc10f83b44e631bb57","title":"RCB में कैमरून ग्रीन को मिलेगा ये रोल, टीम डायरेक्टर ने कर दिया बिल्कुल साफ","link":"https://www.indiatv.in/sports/cricket/rcb-team-director-of-cricket-mo-bobat-on-cameron-green-role-in-team-middle-order-2023-11-28-1004409","keywords":null,"creator":null,"video_url":null,"description":"RCB की टीम ने ऑस्ट्रेलियाई ऑलराउंडर कैमरून ग्रीन को मुंबई इंडियंस से ट्रेड किया है। आरसीबी की टीम में ग्रीन का क्या रोल होगा। इस पर टीम डायरेक्टर ने बड़ी बात कही है।","content":"IPL रिटेंशन के बाद आरसीबी की टीम ने कैमरून ग्रीन को मुंबई इंडियंस से ट्रेड कर लिया है। आरसीबी ने इसके लिए 17.50 करोड़ रुपये की रकम चुकाई। ग्रीन बेहतरीन गेंदबाजी के साथ-साथ धाकड़ बैटिंग करने में माहिर प्लेयर हैं। उनके आरसीबी में आने से टीम को संतुलन मिलेगा। ग्रीन बेहतरीन फॉर्म में चल रहे हैं और टी20 क्रिकेट में वह चंद गेंदों में मैच का रुख बदल देते हैं। आरसीबी की टीम में उनका क्या रोल होगा। इसको लेकर डायरेक्टर मो बोबाट ने बड़ा बयान दिया है। RCB के निदेशक मो बोबाट के कहा कि कैमरून ग्रीन रॉयल चैलेंजर्स बैंगलोर के लिए एक विस्फोटक पैकेज हो सकते हैं, खासकर चिन्नास्वामी स्टेडियम में। आरसीबी बोल्ड डायरीज में उन्होंने कहा कि वह मिडिल ऑर्डर में पावर हिटर की भूमिका के लिए बिल्कुल फिट हैं। वह बेहतरीन और कुशल बल्लेबाज हैं। उनके पास तेज और स्पिन गेंदबाजी दोनों को खेलने वाले शॉट हैं। ग्रीन शानदार फील्डर भी हैं। उसने हाल के दिनों में फील्डिंग करते हुए अच्छे कैच लपके हैं और गली में फील्डिंग करते हुए वह काफी प्रभावशाली हैं। आरसीबी के नए मुख्य कोच एंडी फ्लावर भी कैमरून ग्रीन को टीम में शामिल करने से उत्साहित थे। फ्लॉवर ने कहा कि हमारा फोकस वास्तव में मिडिल ऑर्डर के आसपास था और हम मिडिल ऑर्डर में सुधार कर सकते हैं। हम विदेशी खिलाड़ियों पर सही संतुलन बनाना चाहते हैं। आज के समय में ऑलराउंडर अहम हैं। ऐसे में हमने काफी बहस की और ग्रीन की एंट्री हो गई है। कैमरून ग्रीन की एंट्री के बाद आरसीबी के पास आईपीएल 2024 ऑक्शन से पहले 23.25 करोड़ रुपये बचे हुए हैं। टीम ने आईपीएल रिटेंशन में 11 खिलाड़ियों को रिलीज किया है। वानिंदु हसरंगा, हर्षल पटेल, जोश हेजलवुड, फिन एलन, माइकल ब्रेसवेल, डेविड विली, वेन पार्नेल, सोनू यादव, अविनाश सिंह, सिद्धार्थ कौल, केदार जाधव शामिल हैं। वहीं ट्रेड के जरिए शाहबाज अहमद को सनराइजर्स हैदराबाद में भेज दिया गया है। रिटेन खिलाड़ी: फाफ डु प्लेसिस, रजत पाटीदार, विराट कोहली, अनुज रावत, दिनेश कार्तिक, सुयश प्रभुदेसाई, विल जैक्स, ग्लेन मैक्सवेल, महिपाल लोमरोर, कर्ण शर्मा, मनोज भंडागे, आकाश दीप, मोहम्मद सिराज, रीस टॉपले, हिमांशु शर्मा, राजन कुमार, विशक विजयकुमार, मयंक डागर और कैमरून ग्रीन (ट्रेड से हासिल किया) यह भी पढ़ें:","pubDate":"2023-11-28 01:47:36","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2e0ca3cdfef7de2db42344455d0b59da","title":"See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act","link":"https://www.dailymail.co.uk/sport/cricket/article-12797567/Adam-Gilchrist-son-Harry-Instagram-park-cricket-funny.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The batting and wicketkeeping great's Instagram pics had his teammates Jason Gillespie and Damien Martyn in stitches.","content":"See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act All-time great wicketkeeper posted funny pic on Instagram Features his son Harry proving that parenting isn't easy Photos had other Aussie cricket greats in stitches By Shayne Bugden For Daily Mail Australia Published: 19:48 EST, 27 November 2023 | Updated: 19:48 EST, 27 November 2023 e-mail View comments Adam Gilchrist made taking catches and scoring centuries look easy when he was starring in the Australian cricket team, but his recent light-hearted post on Instagram showed parenting doesn't always come easy for the 52-year-old. The legendary wicketkeeper showed his followers two shots of his eldest son Harry in Adam Gilchrist Park in the northern NSW village of Caniaba, on the outskirts of Lismore. They were accompanied by the caption: 'Set an example, and then hope to gain your child's respect. All you can ask for as a parent.' The first shot shows Harry smiling as he poses next to the sign bearing his father's name - but the second photo shows him pretending to urinate on it. The cricket great's first photo showed his eldest son innocently smiling as he posed in a park named after his father in northern NSW But the second image is what left other cricket stars in stitches as Harry pretended to urinate on the sign bearing his dad's name Gilchrist's hilarious post has been liked more than 25,000 times with some of the cricketer's world-famous teammates enjoying a good laugh at his expense. Fast bowler Jason Gillespie responded with a series of cry-laughing emojis, with Damien Martyn writing 'That's gold' along with fire and more cry-laughing emojis. Women's star Beth Mooney also chipped in and footy commentator James Brayshaw added, 'You wouldn't have it any other way.' However, some Indian cricket fans - who were likely still getting over their side's shock loss to Australia in the World Cup final - used the opportunity to slam Aussies. 'Its simple like Michel marsh [sic] putting his leg on world cup trophy ..its in your culture ..no wonder,' one wrote, referring to the furore over Mitchell Marsh being photographed with his foot on one of cricket's biggest awards. Gilchrist (pictured at Perth stadium earlier this month) got a big laugh out of his former teammate Jason Gillespie with the cheeky display on Instagram Another of Gilchrist's mates from his playing days, Damien Martyn (pictured) responded to the photos by writing 'That's gold' Harry, 21, is the eldest of Gilchrist's four children with wife Melinda: Annie, 18, Archie, 16, and Ted, 12. Lismore - where the cricket great moved to as a teenager after being born in Bellingen near the NSW north coast - also features the Adam Gilchrist Oval and Pavilion. In March the ex-wickie played in a star-studded celebrity T20 cricket match to raise money for the town after it was smashed by the biggest flood in modern Australian history in February 2022. 'It's something close to my heart,' Gilchrist said. 'I've watched with sadness and frustration from afar so when Steve [Krieg, mayor] asked me if I'd be keen to help create a T20 match with some high profile players I jumped at the opportunity. 'It's a privilege and a pleasure to be able to contribute in some small way.' Instagram New South Wales Share or comment on this article: See Aussie cricket legend Adam Gilchrist's hilariously rude post about his son performing a shocking act e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-28 00:48:14","image_url":"https://i.dailymail.co.uk/1s/2023/11/28/00/78297589-0-image-m-14_1701129830217.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2229f8b92898735d299897404e6b18b8","title":"IND vs AUS: गुवाहाटी में होगी रनों की बरसात या गेंदबाजों को मिलेगा साथ? मैच से पहले पढ़ें ये पिच रिपोर्ट","link":"https://www.indiatv.in/sports/cricket/ind-vs-aus-3rd-t20i-barsapara-cricket-stadium-guwahati-pitch-report-2023-11-27-1004391","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd T20I: ऑस्ट्रेलिया के खिलाफ 5 मैचों की टी20 सीरीज का तीसरा मैच टीम इंडिया गुवाहाटी में खेलेगी। इस मैदान पर ये चौथा टी20I मैच होगा।","content":"भारत और ऑस्ट्रेलिया के बीच सीरीज का तीसरा टी20 मैच आज (28 नवंबर) गुवाहाटी के बारसापारा क्रिकेट स्टेडियम में खेला जाएगा। इस सीरीज में टीम इंडिया फिलहाल 2-0 से आगे चल रही है। ऐसे में टीम इंडिया तीसरे टी-20 मैच में सीरीज सील करने के इरादे से मैदान पर उतरेगी। वहीं, ऑस्ट्रेलियाई टीम सीरीज में वापसी के इरादे के साथ उतरेगी। गुवाहाटी के बरसापारा क्रिकेट स्टेडियम का विकेट धीमा माना जाता है। लेकिन इस मैदान पर खेला गया आखिरी टी20 काफी हाई स्कोरिंग रहा था। पिछले साल इस मैदान पर अक्टूबर में भारत और साउथ अफ्रीका के बीच खेले गए टी20 मैच में कुल 400 से ज्यादा रन देखने को मिले थे। यानी इस सीरीज में एक बार फिर हाई स्कोरिंग मैच देखने को मिल सकता है। ऑस्ट्रेलिया ने यहां भारत के खिलाफ एक टी20 इंटरनेशनल मैच खेला है, जिसमें ऑस्ट्रेलियाई टीम ने 8 विकटों से बाजी मारी थी। वहीं, टीम इंडिया ने इस मैदान पर 3 में से 1 ही मैच जीता है और एक बेनतीजा रहा था। भारत ने 3 में से एक मैच ऑस्ट्रेलिया के खिलाफ गंवाया है और श्रीलंका के खिलाफ भारतीय टीम का मुकाबला बेनतीजा रहा है। वहीं, इस मैदान पर उसने अपने आखिरी मैच में साउथ अफ्रीका को हराया था। सूर्यकुमार यादव (कप्तान), ऋतुराज गायकवाड (उपकप्तान), ईशान किशन, यशस्वी जयसवाल, तिलक वर्मा, रिंकू सिंह, जितेश शर्मा (विकेटकीपर), वॉशिंगटन सुंदर, अक्षर पटेल, शिवम दुबे, रवि बिश्नोई, अर्शदीप सिंह, प्रसिद्ध कृष्णा, आवेश खान, मुकेश कुमार। श्रेयस अय्यर (आखिरी 2 मैचों के लिए उपकप्तान ) मैथ्यू वेड (कप्तान), जेसन बेहरेनडोर्फ, सीन एबॉट, टिम डेविड, नाथन एलिस, ट्रेविस हेड, जोश इंग्लिस, ग्लेन मैक्सवेल, केन रिचर्डसन, तनवीर सांघा, मैट शॉर्ट, स्टीव स्मिथ, मार्कस स्टोइनिस, डेविड वार्नर, एडम जम्पा।","pubDate":"2023-11-28 00:30:01","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"520927a9d6acb3992f39cdbbe76cd74c","title":"Hathurusingha excited to oversee Bangladesh’s change of guard","link":"https://www.ft.lk/sports/Hathurusingha-excited-to-oversee-Bangladesh-s-change-of-guard/23-755671","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Bangladesh’s Head Coach Chandika Hathurusingha believes that the upcoming Test series against New Zealand is an exciting opportunity for the youngsters. After an underwhelming ICC Men’s Cricket World Cup campaign, Bangladesh will change formats and take on New Zealand in a two-Test series at home. The side will bear a new look, given a number of senior players are skipping the series due to various reasons. Shakib Al Hasan misses out due to a finger injury, Litton Das has been granted a paternity leave, and Taskin Ahmed has a shoulder niggle to manage. Apart from them, senior opener Tamim Iqbal also remains out of contention. Speaking to the reporters ahead of the game, Hathurusingha stated that losing this amount of experience was a significant setback for Bangladesh. “It’s challenging to lose that much of experience from any team, especially for Bangladesh. Those guys have been part of the Bangladesh team in every format for more than 15 years. Some of them for ten years.” However, he added that this only meant that opportunities opened up for Bangladesh’s upcoming cricketing talent. “It is however something to look forward to, to see what the youngsters can do,” Hathurusingha added that it was also a time for change. “I think it’s a time that we need to move on from some of the players that have played for a long time. They are not going to be there forever. “But this is happening because of many reasons. I think it’s exciting and it’s an opportunity for some of the youngsters to make their name and then have a long career.” Bangladesh’s squad features three players uncapped at the Test level: Hasan Murad, Hasan Mahmud, and Shahadat Hossain Dipu. At the same time, Hathurusingha was well aware of the challenge of having not played much red-ball cricket leading into the series. A number of Bangladesh’s players, however, managed to feature in the last round of their first-class National Cricket League, after arriving home from the World Cup. “The challenge is these guys haven’t played enough cricket leading up to. So our planning has to be a little bit better than this going forward and making a bigger pool of players available for every position in bowling and batting. “We used the NCL matches for the guys who played the World Cup as preparation. “Most of the batters made use of that opportunity. Most of the other players have been playing NCL. This is almost like a new-look Bangladesh team for various reasons. Not by design. I think we are ready as we can be and I’m looking forward to this Test series.” The coach banked on his spin attack to deliver for the Tigers in the series. “There is experience in Taijul (Islam) and (Mehidy Hasan) Miraz. Taijul has 177 Test wickets. Definitely, he’ll be a leader of the attack and Miraz is playing since 2016 if I remember correctly,” Hathurusingha added. “Then there’s young Murad and Naeem Hassan. I think playing on this condition and this heat, those guys, spinners mainly, will play a big role.” The first Test commences on Tuesday, 28 November in Sylhet. Bangladesh Test squad: Najmul Hossain Shanto (c), Shadman Islam, Mehidy Hasan Miraz, Mominul Haque, Shahadat Hossain Dipu, Mushfiqur Rahim, Nurul Hasan, Mahmudul Hasan, Taijul Islam, Naeem Hasan, Khaled Ahmed, Shoriful Islam, Hasan Mahmud, Hasan Murad, Zakir Hasan.","pubDate":"2023-11-27 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"}]}