{"newsArray":[{"title":"How rugby and GAA became married to mutual respect and success","link":"https://www.independent.ie/sport/gaelic-games/how-rugby-and-gaa-became-married-to-mutual-respect-and-success-42013825.html","keywords":["GAA"],"creator":null,"video_url":null,"description":"This summer was the 175th anniversary of Michael Cusack’s birth, known to so many as the founder of the GAA but also, to some, as a rugby devotee, not to mention one who believed that cricket could become Ireland’s national sport.","content":null,"pubDate":"2022-09-24 01:30:00","image_url":"https://www.independent.ie/sport/gaelic-games/3a761/42013824.ece/AUTOCROP/w1240h700/CG168%20Irish%20Rugby%20Stock","source_id":"independent","country":["ireland"],"category":["sports"],"language":"english"},{"title":"PCB hires foreign coaches for domestic teams","link":"https://www.thenews.com.pk/print/994080-pcb-hires-foreign-coaches-for-domestic-teams","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The Pakistan Cricket Board has hired the services of two foreign coaches who will deliver their services while coaching the domestic teams during the forthcoming Quaid-e-Azam trophy which will begin in a few days.According to sources, Paul Franks of England, having played one ODI for...","content":"KARACHI: The Pakistan Cricket Board (PCB) has hired the services of two foreign coaches who will deliver their services while coaching the domestic teams during the forthcoming Quaid-e-Azam trophy which will begin in a few days. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ According to sources, Paul Franks of England, having played one ODI for England, will coach Central Punjab. Paul Nixon, who played 19 ODIs and 1 T20I for England, will coach Sindh in the top-tier event. Nottinghamshire coach Bilal Shafayat will act as fielding coach of Central Punjab, sources said. According to sources, four more coaches are expected to be hired to work with different outfits during the event.","pubDate":"2022-09-24 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"IND v AUS: 2nd T20 full match highlights","link":"https://www.cairnspost.com.au/sport/cricket/ind-v-aus-2nd-t20-full-match-highlights/video/27b410156c46472f91ceaf65f0e120f2","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: India made light work of Australia in the second T20, easily chasing down a meagre total.","content":null,"pubDate":"2022-09-23 21:27:24","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Shan Masood proved that”: Mohammad Amir believes Shan Masood can bat at any number in T20Is","link":"https://thesportsrush.com/cricket-news-shan-masood-proved-that-mohammad-amir-believes-shan-masood-can-bat-at-any-number-in-t20is/","keywords":["Cricket","England","England tour of Pakistan 2022","Mohammad Amir","Pakistan","Shan Masood"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Mohammad Amir believes Shan Masood: The former Pakistan speedster is impressed by this format’s rookie batter. England are once again in the lead after winning the third T20I of their tour of Pakistan in Karachi tonight. A clinical victory for the visitors saw them shining across departments to put on display a pretty much one-sided… The post “Shan Masood proved that”: Mohammad Amir believes Shan Masood can bat at any number in T20Is appeared first on The SportsRush.","content":"England are once again in the lead after winning the third T20I of their tour of Pakistan in Karachi tonight. A clinical victory for the visitors saw them shining across departments to put on display a pretty much one-sided victory. Having won by 63 runs, England have registered their sixth-biggest T20I victory (by runs). Speaking to host broadcaster during the post-match presentation ceremony, captain Moeen Ali hailed rookie batters for standing tall on their potential and bringing their Pakistan Super League experience into play. “Brooky [Harry Brook], hopefully, he grows and becomes one of those top, top players. All got a bit of experience from the PSL. [Will] Jacks took it to the bowlers, the future for England cricket is amazing,” Ali said. While Ben Duckett and Brook scored individual half-centuries in a winning cause, debutant Jacks had scored a stroke-filled 40 (22) at the top of the order. Readers must note that both Duckett and Jacks represent Islamabad United in the PSL. Brooks, on the other hand, is a Lahore Qalandars product even getting involved in a with his Qalandars teammate Haris Rauf on Friday. An opening batter by default, Pakistan’s Shan Masood grabbed an opportunity of batting in the middle-order with both hands to be a lone positive among the hosts in this match. Been playing international cricket for almost nine years now, Masood had made his T20I debut earlier this week. It was only his second innings in the shortest format that Masood brought up a maiden half-century to somehow steer Pakistan past the 150-run mark. Known for his work ethic and stupendous run-scoring ability in domestic cricket, Masood has literally earned a T20I debut on the back of consistent performances for Multan Sultans and Derbyshire Falcons in the recent years. Masood’s one-man show for Pakistan caught the attention of former fast bowler Mohammad Amir, who took to social media platform Twitter to highlight how the 32-year old player has proved a point by contributing in the middle-order. wining or losing its a part of game but good player can bat on any number today proved that 👍 👌. — Mohammad Amir (@iamamirofficial) Masood, who scored 65*(40) with the help of three fours and four sixes, has hardly batted in the middle-order in his 11-year old T20 career. Brought into the team as a replacement for Fakhar Zaman, Masood might be seen batting at his No. 3 position during the ICC T20 World Cup 2022.","pubDate":"2022-09-23 21:17:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Harry Brook lights up big England win in third T20 international against Pakistan - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL3NlcC8yMy9tYXJrLXdvb2Qtcm9hcnMtYmFjay1mcm9tLWluanVyeS1hcy1lbmdsYW5kLXRocmFzaC1wYWtpc3Rhbi1pbi10aGlyZC10MjDSAXZodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9zZXAvMjMvbWFyay13b29kLXJvYXJzLWJhY2stZnJvbS1pbmp1cnktYXMtZW5nbGFuZC10aHJhc2gtcGFraXN0YW4taW4tdGhpcmQtdDIw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Harry Brook lights up big England win in third T20 international against Pakistan  The GuardianPakistan vs England - third T20I recap: How Harry Brook, Ben Duckett helped convincing victory  Sky SportsMark Wood makes blistering return to help England reclaim T20 lead over Pakistan  Kidderminster ShuttlePakistan v England: third men’s T20 cricket international – live  The GuardianPakistan vs England: Harry Brook & Ben Duckett star with bat as tourists retake series lead  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-23 21:06:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND vs AUS: Axar's 2 overs made the difference, says Finch after India defeat Australia in 2nd T20I","link":"https://www.thehansindia.com/sports/cricket/ind-vs-aus-axars-2-overs-made-the-difference-says-finch-after-india-defeat-australia-in-2nd-t20i-762917","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Axar Patel finished with figures of 2 for 13 in 2 oversIndia defeated Australia by 6 wickets on FridayRohit Sharma was the Player of the Match for scoring an unbeaten 46 off 20","content":"Aaron Finch Aaron Finch said that Australia \"got out executed a little bit\" towards the end after their six-wicket loss to India in the second T20I on Friday. With the win, India made it 1-1 with the third and final game remaining. Finch acknowledged that the two overs bowled by Indian spinner Axar Patel made the difference in the end. Axar gave away just 13 runs and picked up two wickets in his quota of two overs. The Australian skipper also praised his Indian counterpart Rohit Sharma, who was named the Player of the Match for his unbeaten knock of 46 off 20 deliveries during India's successful chase of 91. The second T20I in Nagpur was restricted to eight overs per side after the start of the game was delayed by a wet outfield. Maxi 🤝🏻 VK. ❤️ Rain delays are always a good time to bond. 😉 #PlayBold #TeamIndia #INDvAUS pic.twitter.com/Mltf3D68LK \"You probably plan for 5 over games and add a little bit on to it. When you are doing all your planning for World Cups you always have them in the back of your mind. We just got out executed a little bit towards the back end. Rohit was brilliant. And the two overs Axar bowled was probably the difference in the game,\" said Finch after Australia's defeat on Friday. Australia managed to reach 90 in the first innings, thanks to Matthew Wade's 20-ball 43. He struck three sixes and four fours as he scored the runs at a great strike rate of 215. Finch heaped praise on Wade, saying the wicketkeeper-batsman has \"grown into a finisher's role.\" \"Wade is such a calm customer at the back end of the innings and he has grown into that finisher's role. He did a wonderful job for us. We got close. Zampa was good too,\" added Finch. Adam Zampa, who dismissed KL Rahul, brought Australia back into the game for a brief time by taking removing Virat Kohli and Suryakumar Yadav on two successive deliveries. Zampa dismissed Kohli for the eighth time in 29 matches in international cricket. It's the most times an Australian bowler has dismissed the former India captain at the highest level. The victory in the second T20I against Australia also saw Team India equal Pakistan's record of most T20I wins in a calendar year – 20 wins. Babar Azam and his men achieved the feat in 2021. Rohit's team India has a chance to break the record ahead of the third T20I against Australia, which is scheduled to be played on Sunday (Sept. 25). With the series level at 1-1, the third game is the decider.","pubDate":"2022-09-23 21:01:08","image_url":"https://assets.thehansindia.com/h-upload/2022/09/23/500x300_1313616-aro.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS 2nd T20 highlights: Are IND vs AUS highlights available on Hotstar?","link":"https://thesportsrush.com/cricket-news-ind-vs-aus-2nd-t20-highlights-are-ind-vs-aus-highlights-available-on-hotstar/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs AUS 2nd T20 highlights: Despite a rain-affected encounter, the Nagpur crowd was witness to some entertaining stuff tonight. Impressive performances with the ball from Axar Patel, and later off the bat of skipper Rohit Sharma, meant that team India prevailed against Australia by 6 wickets, in what was a rain-curtailed 8 Overs-a-side contest… The post IND vs AUS 2nd T20 highlights: Are IND vs AUS highlights available on Hotstar? appeared first on The SportsRush.","content":"IND vs AUS 2nd T20 highlights: Despite a rain-affected encounter, the Nagpur crowd was witness to some entertaining stuff tonight. Impressive performances with the ball from Axar Patel, and later off the bat of skipper Rohit Sharma, meant that team India prevailed against Australia by 6 wickets, in what was a rain-curtailed 8 Overs-a-side contest at the Vidarbha Cricket Association Stadium in Nagpur. Tonight’s win has ensured that team India take the three-match series into the final, deciding match, which will be played in Hyderabad on Sunday. En route the target of 91 runs, Rohit Sharma (46* off 20) took off right from the word go, as he smashed Josh Hazlewood, for three Sixes during the very first Over of the chase, to collect a total of 20 runs. With all the batters going for the kill straight away, wickets did keep falling at the other end at regular intervals, but Rohit held one end up, and kept handing crunching blows regularly, to keep the required run-rate well within reach. Ultimately, team’s designated finisher Dinesh Karthik (10* off 2) smashed a boundary and a Six off the first two balls of the last Over, to win it for his side with four balls to spare. All square. See you in Hyderabad. pic.twitter.com/2DZM41SMEc — Virat Kohli (@imVkohli) September 23, 2022 IND vs AUS 2nd T20 highlights Earlier, India’s left-arm spinner Axar Patel (2-0-13-2) impressed the team for the second consecutive time, as he got rid of the dangerous Glenn Mazwell for a Golden Duck, and then the aggressive hitter Tim David (2 off 3), to help his team restrict the Aussie batting line-up below the 100-run mark. However, wicket-keeper batter Matthew Wade (43* off 20) yet again was at his brutal best against the Indians, to finish the game on a high for his bowlers. Rohit Sharma, for his fine knock comprising 4 Fours and as many Sixes, was awarded the ‘Player of the Match’. Are IND vs AUS highlights available on Hotstar? Yes, the highlights of the India versus Australia second T20I (run-curtailed) at Nagpur is available on Hotstar, and can be watched by clicking here. The post IND vs AUS 2nd T20 highlights: Are IND vs AUS highlights available on Hotstar? appeared first on The SportsRush.","pubDate":"2022-09-23 19:14:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BCCI AGM on October 18, general body to select India’s representative to ICC","link":"https://kashmirreader.com/2022/09/24/bcci-agm-on-october-18-general-body-to-select-indias-representative-to-icc/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Mumbai: The BCCI has confirmed its AGM (Annual General Meeting) will be held on October 18. According to a notification sent by BCCI secretary Jay Shah, the AGM will be held in Mumbai. Women’s IPL is one of the important items on the agenda circulated to the state associations on Thursday evening. Also on the […]","content":"Mumbai: The BCCI has confirmed its AGM (Annual General Meeting) will be held on October 18. According to a notification sent by BCCI secretary Jay Shah, the AGM will be held in Mumbai. Women’s IPL is one of the important items on the agenda circulated to the state associations on Thursday evening. Also on the agenda are election to the office-bearers: president, vice-president, secretary, joint secretary and treasurer. High on the agenda will also be election of India’s representative at the International Cricket Council. The two candidates as of now are 77-year-old former BCCI strongman N Srinivasan and the 50-year-old current BCCI president Sourav Ganguly. There are 29 points on the agenda. There will be election of two representatives (one male and one female) in Apex Council from Indian Cricketers’ Association (ICA). Two members from the general body will also be inducted into the Governing Council of IPL. There will be appointment of all the standing committees and cricket committees, including Umpires’ Committee. There will be appointment of Ombudsman and Ethics Officer. —PTI     Press Trust of Indiakashmirreader.com","pubDate":"2022-09-23 18:56:25","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"2nd T20: Record-breaking Babar Azam, Rizwan star as Pakistan down England","link":"https://kashmirreader.com/2022/09/24/2nd-t20-record-breaking-babar-azam-rizwan-star-as-pakistan-down-england/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"KARACHI: Openers Babar Azam and Mohammad Rizwan put on an unbeaten 203-run partnership as Pakistan claimed a remarkable 10-wicket victory over England in the second T20 international in Karachi on Thursday. Azam hammered 110 not out for his second T20I hundred while Rizwan scored an undefeated 88 as the pair completed a chase of 200 […]","content":"KARACHI: Openers Babar Azam and Mohammad Rizwan put on an unbeaten 203-run partnership as Pakistan claimed a remarkable 10-wicket victory over England in the second T20 international in Karachi on Thursday. Azam hammered 110 not out for his second T20I hundred while Rizwan scored an undefeated 88 as the pair completed a chase of 200 in 19.3 overs at a packed National Stadium. With 1,929 runs together, the Azam-Rizwan partnership has become the most prolific in T20Is, beating Indian stars Shikhar Dhawan and Rohit Sharma’s record of 1,743 in 51 matches. Azam and Rizwan have achieved the record in just 36 games. The win levelled the seven-match series at 1-1 after England won the first game by six wickets, also in Karachi on Tuesday. Azam, who endured a miserable Asia Cup earlier this month with just 68 runs in six matches, smashed five sixes and 11 fours off 66 balls, while Rizwan struck four sixes and five boundaries in his 51-ball innings. Azam’s hundred came off 62 balls, adding to his 122 against South Africa at Centurion last year. The pair reached 100 in just 11.2 overs — their seventh century stand together in T20I cricket. Rizwan, dropped on 23 by Alex Hales off Liam Dawson, completed his fifty off 30 balls while Azam took 39 deliveries for his half-century. It was Pakistan’s second 10-wicket win in the format following their first against India in last year’s T20 World Cup. The pair also improved on their 197-run opening stand they set against South Africa last year. “We had done it in the past so we had the belief that we can do it again,” said Azam whose team have now successfully chased down three 200-plus targets. “It was easier batting second under lights and Rizwan was superb so we did it together and that is a very confidence-boosting win.” England captain Moeen Ali said a dropped catch was crucial. “It was a really good wicket in the end, thought we batted well, but we dropped a big catch,” he said. “Rizwan and Babar (Azam) were brilliant.” Earlier, Moeen struck a rapid half-century to lead his team to 199-5 after they won the toss and batted first. Moeen smashed four sixes and as many fours in his 23-ball 55 not out. Ben Duckett (43), Harry Brook (31) and Hales (30) also contributed as England plundered 119 in the last 10 overs. Moeen hit two towering sixes off pacer Mohammad Hasnain’s last two deliveries of the innings. Fast bowlers Haris Rauf (2-30) and Shahnawaz Dahani (2-37) were the pick of Pakistan bowlers. England are on their first tour of Pakistan in 17 years. The next two matches are in Karachi on Friday and Sunday. —Agencies   Press Trust of Indiakashmirreader.com","pubDate":"2022-09-23 18:56:11","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Pant with his “dare and courage” is must in Indian starting line-up: Gilchrist","link":"https://kashmirreader.com/2022/09/24/pant-with-his-dare-and-courage-is-must-in-indian-starting-line-up-gilchrist/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: For his sheer “courage and dare”, Rishabh Pant should be a part of India’s starting XI during the T20 World Cup, feels former Australian great Adam Gilchrist. There has been a debate if it should be Pant or Dinesh Karthik in India’s playing XI and it seemed that Gilchrist’s vote of confidence is in […]","content":"Dubai: For his sheer “courage and dare”, Rishabh Pant should be a part of India’s starting XI during the T20 World Cup, feels former Australian great Adam Gilchrist. There has been a debate if it should be Pant or Dinesh Karthik in India’s playing XI and it seemed that Gilchrist’s vote of confidence is in favour of the much younger Delhi cricketer. “The dare of Rishabh Pant and the courage in him, the way in which he takes on bowling attacks, I think he’s got to be a must in that Indian line-up,” Gilchrist was quoted as saying in an ICC release. “They can play together, but I think Rishabh Pant has definitely got to be in there.” India included both Pant and Karthik in the 15-member squad for the upcoming T20 World Cup in Australia but the former’s underwhelming record in T20Is might go against him. Pant has 934 runs in 58 T20Is at an average of 23.94 and a strike-rate of 126.21. But he hasn’t quite enjoyed the success what was expected of him in this format unlike Test cricket where he is already an established star. Add to it, Karthik has of late blossomed as a finisher, which could work in his favour. But just like his former skipper Ricky Ponting, Gilchrist too feels that both the stumper batters can play together in the eleven. “It’ll be interesting to see if they can both play in the same team. I think they can. What they bring to a team the versatility of Dinesh Karthik, he can play at the top of the order, he can, as he has done more so later in his career, be in the middle and late overs to finish. He has a really nice touch game,” the former Australia wicketkeeper batter signed off. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-09-23 18:55:51","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"County cricket: Somerset win seals safety, Surrey celebrate title – as it happened - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIyL3NlcC8yMy9jb3VudHktY3JpY2tldC1zb21lcnNldC12LW5vcnRoYW50cy1zdXJyZXktdGl0bGUtY2VsZWJyYXRpb25zLWFuZC1zdHJhdXNzLXJldmlldy1yZWFjdGlvbi1saXZl0gGRAWh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvc2VwLzIzL2NvdW50eS1jcmlja2V0LXNvbWVyc2V0LXYtbm9ydGhhbnRzLXN1cnJleS10aXRsZS1jZWxlYnJhdGlvbnMtYW5kLXN0cmF1c3MtcmV2aWV3LXJlYWN0aW9uLWxpdmU?oc=5","keywords":null,"creator":null,"video_url":null,"description":"County cricket: Somerset win seals safety, Surrey celebrate title – as it happened  The GuardianCounty Championship: Tom Abell hits his second ton of the game as Somerset build a huge lead  BBCSadler says weary Northants 'running on empty' as they are thrashed by Somerset  Northampton Chronicle and EchoSomerset finish Northants off in style  Somerset County Cricket ClubLV= County Championship: Somerset defeat Northamptonshire to secure Division One survival  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-23 18:44:11","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-Brook, Duckett star as England rout Pakistan in third T20","link":"https://www.thestar.com.my/sport/cricket/2022/09/24/cricket-brook-duckett-star-as-england-rout-pakistan-in-third-t20","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's Harry Brook and Ben Duckett combined for a brilliant partnership and the returning Mark Wood snared three wickets as the visitors beat Pakistan by 63 runs in the third Twenty20 in Karachi on Friday to take a 2-1 lead in the seven-match series. Read full story","content":"(Reuters) - England's Harry Brook and Ben Duckett combined for a brilliant partnership and the returning Mark Wood snared three wickets as the visitors beat Pakistan by 63 runs in the third Twenty20 in Karachi on Friday to take a 2-1 lead in the seven-match series. Set a mammoth 222 for victory, Pakistan were rocked early by the searing pace of Wood (3-24), who missed the entire English summer due to an elbow injury, when he removed Babar Azam (8) and Haider Ali (3) to leave the hosts wobbling on 28-4. Shan Masood (65 not out) briefly resurrected the chase with a fighting half-century but the total proved well out of reach for Pakistan, who had demolished England by 10 wickets 24 hours earlier. After England were put in to bat, Brook (81) and Duckett (70) smashed their maiden T20 fifties and shared an unbeaten 139-run stand for the fourth wicket to help England post 221-3 after debutant Will Jacks (40) had given them a fine start. Leg-spinner Usman Qadir (2-48) removed Jacks and Dawid Malan (14) in quick succession before Duckett and Brook made full use of a flat batting wicket and tore into the Pakistan attack with some sublime strokeplay. Brook was especially impressive as he hit five sixes while Duckett used the sweep shot to devastating effect, helping himself to eight fours and a six during his 42-ball knock. The teams will play the fourth game at the same venue on Sunday. (Reporting by Dhruv Munjal in Bengaluru; Editing by Ken Ferris)","pubDate":"2022-09-23 18:43:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“Skills, technique and jazba”: Mohammad Kaif terms Rohit Sharma as perfect mix for all formats after he wins Man of the Match today India vs Australia","link":"https://thesportsrush.com/cricket-news-skills-technique-and-jazba-mohammad-kaif-terms-rohit-sharma-as-perfect-mix-for-all-formats-after-he-wins-man-of-the-match-today-india-vs-australia/","keywords":["Cricket","Australia tour of India 2022","mohammad kaif","Rohit Sharma"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Mohammad Kaif terms Rohit Sharma as the perfect mix while batting in the shortest format as he wins it for India during the second T20I. In what was a proper eight-Over entertaining slogfest of the highest order, team India have defeated Australia by 6 wickets during the second official T20I at the Vidarbha Cricket Association… The post “Skills, technique and jazba”: Mohammad Kaif terms Rohit Sharma as perfect mix for all formats after he wins Man of the Match today India vs Australia appeared first on The SportsRush.","content":"In what was a proper eight-Over entertaining slogfest of the highest order, team India have defeated Australia by 6 wickets during the second official T20I at the Vidarbha Cricket Association Stadium in Nagpur, to drew level the three-match series 1-1. En route the target of 91 runs, the crowd was witness to an absolute clinical display of batsmanship from team India skipper , who tonked an unbeaten 20-ball 46, while batting right till the end despite an eight Over-a-side contest. With no second guessing from the batters of either teams as far as their approach for the contest tonight was concerned, Rohit set the tune for the chase right from the get-go, smashing the no.1 ranked bowler in the format Josh Hazlewood for three Sixes in the first Over, to collect 20 runs off it. However, with 40 runs required off the last four Overs, and with India in the driver’s seat, leg-spinner Adam Zampa got rid of Virat Kohli (11 off 6) and Suryakumar Yadav (0 off 1) off successive deliveries, to make a mini comeback of sorts. However, with the Indian skipper smashing boundaries at crucial junctures when things looked like going a bit haywire, the required run-rate never skyrocketed to unattainable height, despite wickets falling at the other end. Ultimately, team’s designated finisher Dinesh Karthik (10* off 2) smashed a boundary and a Six off the first two balls of the last Over, to win it for his side with four balls to spare. Former India batter and gun fielder Mohammad Kaif, took to his social media batter to hail Rohit Sharma as a perfect mix of ‘skills, technique, and jazba’, whilst chasing a steep target during a shortened version of a contest as was witnessed tonight. Rohit sharma has skills, technique and jazba the perfect mix when you are chasing 11 runs per over. One player all formats. — Mohammad Kaif (@MohammadKaif) Resultantly, for his 4 Fours and as many Sixes, and returning back with a strike rate of 230 runs per 100 balls, the 35-year-old was also awarded the ‘Player of the Match’.","pubDate":"2022-09-23 18:24:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Rohit leads India to six-wicket win over Australia in shortened T20","link":"https://www.thestar.com.my/sport/cricket/2022/09/24/cricket-rohit-leads-india-to-six-wicket-win-over-australia-in-shortened-t20","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Skipper Rohit Sharma's blazing knock lifted India to a six-wicket victory over Australia in an enthralling and shortened second Twenty20 international in Nagpur on Friday to level the three-match series at 1-1. Read full story","content":"(Reuters) - Skipper Rohit Sharma's blazing knock lifted India to a six-wicket victory over Australia in an enthralling and shortened second Twenty20 international in Nagpur on Friday to level the three-match series at 1-1. Chasing 91 after the match was reduced to eight overs a side due to a wet outfield, Rohit finished with a 20-ball unbeaten 46 while Dinesh Karthik scored the winning runs with four balls to spare after Axar Patel (2-13) did the damage earlier. India were cruising at 51-1 at the halfway stage, with Adam Zampa briefly halting their momentum by taking out opener KL Rahul (10) before turning the game on its head by dismissing Virat Kohli (11) and Suryakumar Yadav (0) in successive balls. The hosts never lost control of the chase, despite Zampa's outstanding 3-16 spell, thanks to captain Rohit leading the charge before Karthik hit a four and a six off the only two balls he faced to wrap up the victory. Overnight rain had rendered the outfield waterlogged and although the weather had been clear on Friday, the start of play was postponed by 2-1/2 hours after several pitch inspections. India elected to bowl first and reduced Australia to 31-3 in 3.1 overs after Cameron Green was run out and Glenn Maxwell fell for a golden duck to Axar, who bowled Tim David in his next over. Jasprit Bumrah, playing his first match in over two months, marked his return with a searing yorker to dismiss Aaron Finch (31) before Matthew Wade's unbeaten 43 off 20 carried Australia to 90-5 as Harshal Patel conceded 19 runs in the final over. Australia clinched a four-wicket victory in the series opener in Mohali on Tuesday after chasing down 208 runs with four balls to spare. The teams will meet in Hyderabad on Sunday for the series decider. (Reporting by Hritika Sharma in Bengaluru; Editing by Ken Ferris)","pubDate":"2022-09-23 18:13:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IND vs AUS 2nd T20 | Rohit’s aggression; DK’s final touch – India strike back at Aussies","link":"https://thenewsglory.com/ind-vs-aus-2nd-t20-rohits-aggression-dks-final-touch-india-strike-back-at-aussies/","keywords":["Sports","Australia","Cricket","India","Rohit Sharma"],"creator":["The News Glory"],"video_url":null,"description":"Nagpur: The Indian team has won the 2nd T20I cricket match against the Australian team. The 2nd T20I match between India and Australia took place in Nagpur today. The match, which was supposed to start at 7 o’clock, got off to a late start due to rain and was reduced to 8 overs each. Australia […]","content":"Nagpur: The Indian team has won the 2nd T20I cricket match against the Australian team. The 2nd T20I match between India and Australia took place in Nagpur today. The match, which was supposed to start at 7 o’clock, got off to a late start due to rain and was reduced to 8 overs each. Australia won the toss and chose to bowl, Finch and Green. Green was run out in the second over and the top-order players took wickets at regular intervals. However, Finch got out after collecting 31 runs. Mathew Watt, who was excellent in the last match, again maintained the same form. Harshal Patel added 90 runs for the loss of five wickets in 8 overs, hitting 3 sixes in the final over alone. Axar Patel took 2 wickets.","pubDate":"2022-09-23 18:03:04","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia: Adam Zampa dismisses Virat Kohli for record 8th time in international cricket","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-australia-adam-zampa-dismisses-virat-kohli-for-record-8th-time-in-international-cricket-2004108-2022-09-23?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: Zampa dismisses Virat Kohli for record 8th time in international cricket","content":"Australia leg-spinner Adam Zampa, on Friday, September 23, dismissed Virat Kohli for the eighth time in 29 matches in international cricket. It’s the most times an Australian bowler has dismissed the Delhi-born Kohli at the highest level. Out of them, Kohli got out ‘caught by fielders’ five times while he got out bowled twice. In the second T20I between India and Australia at VCA Stadium in Mohali, Zampa cleaned up the 33-year-old Virat with an absolute peach. Kohli tried to shimmy down the track and play the ball on the leg side. However, he was beaten in flight and he missed the ball altogether. The ball went and hit the stumps and Kohli had to go back after scoring 11 runs off six balls with two fours. It was also the third time Zampa got the better of Kohli in T20Is. Kohli’s troubles against leg-spinners in T20Is are also evident from the fact that Kohli has got out to New Zealand leggie Ish Sodhi. As far as Zampa is concerned, he went past the Australian fast bowler Pat Cummins , who had dismissed Kohli in seven out of 28 innings. Kohli earlier returned to form after he scored his maiden T20I century against Mohammad Nabi’s Afghanistan in a Super Four match of Asia Cup 202 at Dubai International Cricket Stadium. However, after failing in two innings against Australia, Kohli will be looking to make amends in the third and final T20I. In the meantime, India beat Australia by six wickets in the second T20I to draw level in the three-match series. Live TV --- ENDS --- Also Read | India vs Australia: Rohit Sharma surpasses Martin Guptill to hit most sixes in T20Is","pubDate":"2022-09-23 17:57:16","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS Man of the Match today: Who won Man of the Match award in India vs Australia 2nd T20I in Nagpur?","link":"https://thesportsrush.com/cricket-news-ind-vs-aus-man-of-the-match-today-who-won-man-of-the-match-award-in-india-vs-australia-2nd-t20i-in-nagpur/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs AUS Man of the Match: The Indian all-rounder won the match award for excelling as a bowler in a high-scoring match. During the second T20I of Australia’s tour of India 2022 in Nagpur, India beat Australia by 6 wickets to remain alive in the series ahead of a series-decider in Hyderabad on Sunday.… The post IND vs AUS Man of the Match today: Who won Man of the Match award in India vs Australia 2nd T20I in Nagpur? appeared first on The SportsRush.","content":"IND vs AUS Man of the Match: The Indian all-rounder won the match award for excelling as a bowler in a high-scoring match. During the second T20I of Australia’s tour of India 2022 in Nagpur, India beat Australia by 6 wickets to remain alive in the series ahead of a series-decider in Hyderabad on Sunday. Chasing a 91-run target in a eight-over contest, India sealed the chase with four balls remaining in the match as veteran batter Dinesh Karthik (10*) hit a six and four off Australia all-rounder Daniel Sams to once again justify his reputation of being a designated “finisher”. Captain Rohit Sharma (46*) led from the front by playing some eye-catching boundaries. Having hit four fours and as many sixes during his 20-ball stay, Sharma batted at a strike rate of 230 to always keep his team in the match in spite of others not contributing as much as he would’ve expected. IND vs AUS Man of the Match today Much like Sharma, his Australian counterpart in Aaron Finch (31) also caught the attention of the fans with his four fours and a six. Australia wicket-keeper batter Matthew Wade (43*) generated impact for the second time in a row hitting four fours and three sixes at the Vidharbha Cricket Association Stadium tonight. With all other Indian bowlers leaking runs at an economy rate in excess of 10, all-rounder Axar Patel emerged as a game-changer with bowling figures of 2-0-13-2. Having opened the bowling with Hardik Pandya (0/10 and 9), Patel bowled at an economy rate of 6.5 despite bowling a powerplay over. Patel, whose disciplined and simplistic lines and lengths earned him wickets of hard-hitting batters namely Glenn Maxwell (0) and Tim David (2), was adjudged the Player of the Match for the fourth time in his T20I career. India coming back into the series in wet conditions #INDvAUS pic.twitter.com/g7PQUHzalN — Wasim Jaffer (@WasimJaffer14) September 23, 2022   The post IND vs AUS Man of the Match today: Who won Man of the Match award in India vs Australia 2nd T20I in Nagpur? appeared first on The SportsRush.","pubDate":"2022-09-23 17:49:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England: Score and live updates from the third T20 International - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjIvMDkvMjMvdDIwLWludGVybmF0aW9uYWwtcGFraXN0YW4tdnMtZW5nbGFuZC1saXZlLTNyZC10MjAtc2NvcmUtbGF0ZXN0L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs England: Score and live updates from the third T20 International  The TelegraphPakistan v England: third men’s T20 cricket international – live  The GuardianPakistan vs England: Babar Azam century in stunning opening stand with Mohammad Rizwan secures remarkable win  Sky SportsHarry Brook and Ben Duckett impress as England set Pakistan 222 to win  Lancashire TelegraphBabar Azam’s century fires Pakistan to 10-wicket T20 win against England  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-09-23 17:26:57","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Record for Rohit Sharma in shortened Australia T20I - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI4MDA5MDHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Record for Rohit Sharma in shortened Australia T20I  ICC CricketIndia vs Australia 2nd T20I Highlights: Rohit Sharma shines as India beat Australia by 6 wickets to level series 1-1  Times of IndiaRecent Match Report - Australia vs India 2nd T20I 2022  ESPNcricinfoRohit Sharma blitzkrieg leads India to six-wicket win over Australia, level series 1-1  SportstarIndia vs Australia, 2nd T20I: Didn't expect to hit it like that, glad it came off, says Rohit Sharma - Firstpost  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-09-23 17:12:17","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Hopefully, Harry Brook is alright”: Harry Brook hugged by Haris Rauf after catching ball in helmet grille in Karachi T20I","link":"https://thesportsrush.com/cricket-news-hopefully-harry-brook-is-alright-harry-brook-hugged-by-haris-rauf-after-catching-ball-in-helmet-grille-in-karachi-t20i/","keywords":["Cricket","Videos","England","England tour of Pakistan 2022","Haris Rauf","Harry Brook","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Harry Brook hugged by Haris Rauf: The debutant batter was involved in a bizarre incident at the National Stadium tonight. England captain Moeen Ali had hinted at the toss about needing to post a big score in third T20I against Pakistan in Karachi earlier in the evening. Ali would have been a happy skipper after… The post “Hopefully, Harry Brook is alright”: Harry Brook hugged by Haris Rauf after catching ball in helmet grille in Karachi T20I appeared first on The SportsRush.","content":"Harry Brook hugged by Haris Rauf: The debutant batter was involved in a bizarre incident at the National Stadium tonight. England captain Moeen Ali had hinted at the toss about needing to post a big score in third T20I against Pakistan in Karachi earlier in the evening. Ali would have been a happy skipper after the first innings as his team put on board 221/3 in 20 overs without even requiring him in the batting department. Playing only their fourth and seventh T20I respectively, England batters Ben Duckett and Harry Brook put together a 69-ball 139-run fourth-wicket partnership to outdo their batting performance from last night. In what is the fourth-highest fourth-wicket partnership in T20Is, it is the highest among England batters for this wicket and sixth-highest for any wicket. While Duckett scored 70* (42) at a strike rate of 166.66, Brook caused more damage scoring 81* (35) at a strike rate of 231.42 after coming in to bat at No. 5 in the ninth over. The pair hit a total of 16 fours and six sixes between them to not let fall of wickets hamper England’s progress in the middle overs. Harry Brook hugged by Haris Rauf after catching ball in helmet grille Brook, however, was involved in a bizarre incident at the National Stadium tonight. It all happened on the fourth delivery of the 17th over when Brook completely missed reading a bouncer from Pakistan fast bowler and his Lahore Qalandars teammate Haris Rauf. As a result, what followed was Brook finding himself in an uncomfortable position only to get hit on the grille of his helmet. Having practically caught the ball with his grille, the right-handed batter registered a strange sight but was lucky enough to not get hurt. “Oh, that’s got caught in the grille. It’s a dead ball. Hopefully, Harry Brook is alright. He could have just run and got a single,” commentators were heard saying as they saw the funny side of the whole episode. “Caught in the grille” Brook gets a hug from Rauf after the sharp bouncer #PAKvENG | #UKSePK pic.twitter.com/UZRljMQt9C — Pakistan Cricket (@TheRealPCB) September 23, 2022 Handed a debut to replace Alex Hales (rested) in the Playing XI, England’s Will Jacks also batted well to score 40 (22) with the help of eight fours at a strike rate of 181.81. The post “Hopefully, Harry Brook is alright”: Harry Brook hugged by Haris Rauf after catching ball in helmet grille in Karachi T20I appeared first on The SportsRush.","pubDate":"2022-09-23 17:09:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs AUS: Rohit Sharma overtakes Martin Guptill, becomes leading six hitter in T20I history","link":"https://www.dnaindia.com/cricket/report-ind-vs-aus-rohit-sharma-overtakes-martin-guptill-becomes-leading-six-hitter-in-t20i-history-2987557","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Team India skipper Rohit Sharma on Friday shattered the world record by becoming the leading six-hitter in T20I cricket history during IND vs AUS.","content":null,"pubDate":"2022-09-23 17:04:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“Masterclass in T20 batting”: James Taylor expresses awe of Harry Brook and Ben Duckett as they smash maiden T20I half-centuries vs Pakistan in Karachi","link":"https://thesportsrush.com/cricket-news-masterclass-in-t20-batting-james-taylor-expresses-awe-of-harry-brook-and-ben-duckett-as-they-smash-maiden-t20i-half-centuries-vs-pakistan-in-karachi/","keywords":["Cricket","Ben Duckett","England tour of Pakistan 2022","Harry Brook","James Taylor"],"creator":["Gurpreet Singh"],"video_url":null,"description":"James Taylor expresses awe of Harry Brook and Ben Duckett as they hand Pakistan a much steeper target than the second T20I in Karachi. During the third T20I of the ongoing England’s tour of Pakistan at the National Stadium in Karachi, a couple of innings of the highest order from Harry Brook (81* off 35)… The post “Masterclass in T20 batting”: James Taylor expresses awe of Harry Brook and Ben Duckett as they smash maiden T20I half-centuries vs Pakistan in Karachi appeared first on The SportsRush.","content":"James Taylor expresses awe of Harry Brook and Ben Duckett as they hand Pakistan a much steeper target than the second T20I in Karachi. During the third T20I of the ongoing England’s tour of Pakistan at the National Stadium in Karachi, a couple of innings of the highest order from Harry Brook (81* off 35) and Southpaw Ben Duckett (70* off 42), powered England to a towering total of 221/3 in their 20 Overs. Making a mockery of the Pakistani bowling attack for the second consecutive night, the duo stitched together an unbeaten 139-run stand off mere 69 deliveries for the fourth wicket, to puncture the spirits of the Karachi crowd, who will yet again stare at their opening batting pair of skipper Babar Azam and Mohammad Rizwan to repeat a miracle of sorts akin the previous T20I. Opting to field first post winning the Toss, and going in with an unchanged squad, Pakistan bowlers had to yet again face the aggressive side of the England batters, with debutant Will Jacks (40 off 22) getting them off to a flier. However, having removed their top-3 batters within nine Overs, the local fans might have sensed a mini comeback of sorts, until Duckett and Brook decided to beat the five Pakistani bowlers black and blue till the very end. James Taylor expresses awe of Harry Brook and Ben Duckett While Brook reached his maiden T20I fifty off 24 balls, Duckett too reached his landmark moment for the first time in the format off mere 31 deliveries. Brook, in particular, was at his absolute best as he tonked five Sixes and eight Fours, and returned back after striking at 231.43 runs per hundred balls. Former England batter and team selector James Taylor, took to his social media handle, to praise the duo for their exceptional knocks. Taylor further added that the two have been rewarded for their domestic performances, and are now showcasing their immense talent at the international stage as well. Now this is a masterclass in T20 batting!! So pleased for Brook and Duckett! They’ve done it in domestic cricket for a while and now showing us how it’s done on the international stage!! There’s so much talent in England in white ball cricket!!!#PAKvENG — James Taylor (@jamestaylor20) September 23, 2022 For more Cricket-related news, click here. The post “Masterclass in T20 batting”: James Taylor expresses awe of Harry Brook and Ben Duckett as they smash maiden T20I half-centuries vs Pakistan in Karachi appeared first on The SportsRush.","pubDate":"2022-09-23 16:57:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma becomes leading six-hitter in T20Is, overtakes Martin Guptill","link":"https://sportstar.thehindu.com/cricket/rohit-sharma-most-sixes-t20is-marting-guptill-batting-records-india-vs-australia/article65914179.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"IND vs AUS, 2022: Rohit Sharma surpassed Martin Guptill to become the leading six-hitter in T20I cricket during India’s first match against Australia in Nagpur on Friday.","content":"Rohit Sharma became the leading six-hitter in T20I cricket on Friday during India’s second match against Australia in Nagpur. The Indian skipper surpassed New Zealand’s Martin Guptill with his first six of the match and raised his overall tally to 174 maximums in the format with another six. Rohit is also the leading run-scorer in T20Is with 3600-plus runs under his belt. Rohit and Guptill (172) are followed by Chris Gayle (124), Eoin Morgan (120) and Aaron Finch (119) in the top five. Rohit is also the leading six-hitter among Indians in all T20 cricket - 454*. Rohit is currently second among all six-hitters in international cricket with 488 maximums, only behind Chris Gayle’s 551. Read more stories on Cricket.","pubDate":"2022-09-23 16:53:44","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia Live Score Ball by Ball, India vs Australia, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-australia-live-score-over-2nd-t20i-t20-6-10-updates-3372427","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Live Updates of Today Match between India vs Australia from Vidarbha Cricket Association Ground, Nagpur. Check commentary and full scoreboard of the match.","content":"Follow the India vs Australia, 2022 live cricket score on Sports.NDTV.com . After 8.0 overs, Australia are 90/5. Get live score, ball by ball commentary and much more. Keep track of India vs Australia, 2022 today match between India and Australia. Everything related to India and Australia match will be available on Sports.NDTV.com . Stay updated with India vs Australia live score. Do check for India vs Australia scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. The chase is set to begin. ... RUN CHASE ... India will look to come out all guns blazing and they have strengthened their batting order considerably. They will want the openers to attack the Australian bowlers without worrying about keeping wickets in hand. With just 8 overs to bowl, the visitors will hope to maintain discipline and restrict the scoring. If that brings about wickets it would be a massive bonus for them. An exciting run chase awaits us. Do join us shortly. Australia began with positive intent with the captain Aaron Finch playing the aggressor role. A brilliant piece of fielding from Virat Kohli got rid of last game's half-centurion Cameron Green and the decision to bowl out Axar Patel early proved to be a masterstroke as he claimed the wickets of Glenn Maxwell and Tim David to peg Australia back. Aaron Finch motored along though and made a quickfire 31 before being dismissed by Jasprit Bumrah with a trademark yorker. Matthew Wade continued his good form and played some exquisite strokes en route to his 43 runs as he took Australia to the 90-run mark. Axar Patel was the pick of the bowlers taking two wickets in his 2 overs and conceding just 13 runs. Matthew Wade's sensational form continues! Australia have put up a decent total of 90 on the board but will feel they lost wickets far too frequently early on and are 10-15 runs short of a formidable target. India have done well with the ball but need to work on their death bowling as Harshal Patel conceded 19 runs in the last over. That said, they will know that they have enough firepower in their arsenal to chase down this target. 7.6 overs (0 Run) OUT! RUN OUT! Steven Smith looks to steal a single but gets run out. It is a slower one, full and on off. Wade works it back to the bowler. Meanwhile, Smith is already half way down the track. Patel gathers the ball and sprints to the non-striker's end. Australia have ended their innings at 90/5. 7.5 overs (6 Runs) SIX! Consecutive maximums. This is a slower ball, short and on off. Matthew Wade stands tall and dispatches it over the square leg fence. 19 runs off the over already. 7.4 overs (6 Runs) SIX! Matthew Wade gets the second maximum in the over. A full toss, outside off. Wade stays back and powers it over the deep point fence for a biggie. Matthew Wade is asking the umpire for a no ball, but it looks like the ball is dipping. 7.3 overs (0 Run) Patel goes full, around off. Wade drives it back to the bowler. Harshal Patel gets low in a flash and makes a half-stop. 7.2 overs (6 Runs) SIX! High and handsome. There is no stopping Wade at the moment. Back of a length, Matthew Wade picks the length early and smokes it over the mid-wicket fence from outside off for a maximum. 7.1 overs (1 Run) Short ball, wide of off. Smith reaches out and pushes it to deep point for a single. 6.6 overs (1 Run) It is full again, on middle and leg. Smith tucks it to deep square leg. They take a single. 6.5 overs (1 Run) Full length, on the pads, Wade flicks it to mid-wicket for just a single. 6.4 overs (4 Runs) FOUR! Exceptional shot. It is full, outside off. Wade opens the face of the bat late and steers it past backward point. 6.3 overs (1 Run) Steven Smith nearly gets the taste of the pitch. Jasprit Bumrah serves an inswinging yorker, on leg. Steven Smith tries to dig it out but losses his stance while doing so. 6.2 overs (4 Runs) FOUR! Steven Smith gets his first boundary, a fortunate one though. It is full, around off. Smith swings hard, it takes the outside edge and goes down to third man. A couple of bounces over the ropes. 6.1 overs (1 Run) A low full toss, outside off. Wade pushes it through mid off and rotates the strike. 5.6 overs (1 Run) Wade premeditates the scoop but it does not come off as he expected it to. It goes to fine leg off the inner half. They take a single. 5.5 overs (4 Runs) FOUR! Matthew Wade gets the second boundary of the over. Back of a length, outside off. Wade did not have much pace to work with but still manages to cut it through covers for four runs. 5.4 overs (2 Runs) Patel goes for the yorker ends up as a full length. Wade works it to long on and they collect a brace. 5.3 overs (1 Run) Fuller, on the pads, Smith clips it to deep square leg for a single. 5.2 overs (1 Run) Much fuller, around off. Wade inside-edges it on his pads. It rolls out to the off side and they take a single. 5.1 overs (4 Runs) FOUR! Nicely played! A short ball, outside off. Wade stays back and cuts it past backward point. Yuzvendra Chahal in the deep had no chance to stop this one.","pubDate":"2022-09-23 16:44:01","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637995680298569767.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia: India vs Australia, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-australia-live-score-over-2nd-t20i-t20-1-5-updates-3372298","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Live Updates of Today Match between India vs Australia from Vidarbha Cricket Association Ground, Nagpur. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-09-23 16:26:55","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637995670033801594.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia 2nd T20I: Match to begin at 9:30 pm, reduced to 8 overs","link":"https://www.tribuneindia.com/news/sports/india-vs-australia-2nd-t20i-match-to-begin-at-930-pm-reduced-to-8-overs-434644","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, September 23 The second T20I clash between India and Australia is set to start at 9:30 pm. The toss will take place at 9:15 pm. The decision has been taken after umpires inspected the pitch at 8:45 pm. Moreover, the match has been reduced to just 8 overs amid rain and waterlogging in the outfield. 🚨 Update 🚨Play to commence at 09.30 PM IST. 👏 Toss will take place at 09.15 PM IST. 👍The second @mastercardindia #INDvAUS T20I will be an eight overs/side match. #TeamIndia pic.twitter.com/qZtKmTm3oG — BCCI (@BCCI) September 23, 2022 𝗨𝗽𝗱𝗮𝘁𝗲𝗱 𝗺𝗮𝘁𝗰𝗵-𝗽𝗹𝗮𝘆𝗶𝗻𝗴 𝗰𝗼𝗻𝗱𝗶𝘁𝗶𝗼𝗻𝘀 🔽1st Innings: 9:30 -10:04 PMInterval: 10:04 - 10:14 PM2nd Innings: 10:14-10:48 PMPowerplay 2 OversA maximum of 2 Overs per bowlerNo in game penalty for Slow-Over rateNo drinks break#TeamIndia | #INDvAUS pic.twitter.com/7cw5nsyjAS — BCCI (@BCCI) September 23, 2022 A wet patch at the deep mid-on continued to delay the start of the match and the umpires have deemed it too risky for the players. The wet area between wide min-on and deep mid-on is soft and moving underfoot and not safe for the players, the umpires K.N Ananthapadmanabhan and Nitin Menon concluded after a second inspection of the outfield at the Vidarbha Cricket Association (VCA) Stadium at Jamtha here. The umpires earlier had a chat with the two captains and informed them of their decision. They were hoping that the ground staff could dry that particular area in the next 30-odd minutes and it could be safe for the players. Though the ground was under covers since Wednesday, rainwater seemed to have leaked at one or two places. The match was officially set to start at 7 pm. The ground staff has been working on the wet patches near the boundary rope since the afternoon, running the light roller. They have been seen sprinkling sawdust on some of the patches. Orange City has experienced some heavy spells of rain in the last few days. It had rained very heavily on Wednesday night. Though it has not rained since Thursday afternoon, the ground staff could not take out the covers because of overcast conditions. A spell of rain was predicted for Thursday evening, though it did not rain. Though the sun came out at noon on Friday, it was not potent enough to dry the outfield quickly. With agency inputs","content":"Tribune Web Desk Nagpur, September 23 India captain Rohit Sharma won the toss and elected to bowl first against Australia in the T20 International of the three-match series at the Vidarbha Cricket Association (VCA) Stadium, Jamtha here on Friday. The match, which was delayed by around 2 hours and 30 minutes, will be an 8-overs-a-side affair and a bowler can bowl a maximum of two overs. India made two changes to the side that lost to Australia in the first match at Mohali, bringing in pacer Jasprit Bumrah for Umesh Yadav and Rishabh Pant in place of Bhuvaneshwar Kumar. \"I don't know what to expect from a game like this but it's nice something is happening,\" said Rohit Sharma at the toss, \"So many people have come out to watch us. An eight-over game is challenging, you don't know what to expect. We just had a huddle and I told them (the players) to go express yourselves,\" Rohit said. Australia skipper Aaron Finch said, he too would have bowled first. Australia too made two changes -- with Nathan Ellis, out with an injury, replaced by Daniel Sams while Sean Abbott comes in for Josh Inglis. Playing XIs: India: Rohit Sharma (c), KL Rahul, Virat Kohli, Suryakumar Yadav, Rishabh Pant, Hardik Pandya, Dinesh Karthik (wk), Axar Patel, Harshal Patel, Jasprit Bumrah, Yuzvendra Chahal Australia: Aaron Finch (c), Cameron Green, Steven Smith, Glenn Maxwell, Tim David, Matthew Wade (wk), Pat Cummins, Daniel Sams, Sean Abbott, Adam Zampa, Josh Hazlewood. --IANS","pubDate":"2022-09-23 15:39:40","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1118002819.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia Live 2nd T20I: Toss at 9.15PM, 8-overs a side match - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmRpYS12cy1hdXN0cmFsaWEtbGl2ZS1zY29yZS0ybmQtdDIwLTIwMjItaW5kLXZzLWF1cy10b2RheS1jcmlja2V0LW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtYXQtbmFncHVyLTEwMTY2MzkzNDYxMDk1Ny5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia Live 2nd T20I: Toss at 9.15PM, 8-overs a side match  Hindustan TimesLive Cricket Score - India vs Australia, 2nd T20I, 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIndia vs Australia, 2nd T20I Live Updates: Match Reducted To 8-Overs Per Side, Toss At 9:15 PM  NDTV SportsIND vs AUS 2022: 3 player battles to watch out for in the second T20I between India and Australia  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2022-09-23 15:24:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'Richest cricket board': BCCI trolled by fans as hair dryer being used to dry Nagpur pitch","link":"https://www.dnaindia.com/cricket/report-richest-cricket-board-bcci-trolled-by-fans-as-hair-dryer-being-used-to-dry-nagpur-pitch-2987486","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Fans on Twitter were disappointed after IND vs AUS 2nd T20I got delayed and some even trolled BCCI after an image of hair dryer being used went viral","content":null,"pubDate":"2022-09-23 15:19:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG 3rd T20 Live Score Updates: Qadir snaps up his 2nd wicket as Jacks walks back - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9wYWstdnMtZW5nLTNyZC10MjAtbGl2ZS1zY29yZS11cGRhdGVzLTgxNjg5MTkv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs ENG 3rd T20 Live Score Updates: Qadir snaps up his 2nd wicket as Jacks walks back  The Indian ExpressPakistan vs England 2nd T20I: Babar Azam-Mohammad Rizwan Create New World Record For Highest Partner..  NDTV SportsBabar, Rizwan power Pakistan to a thumping win | Cricbuzz.com - Cricbuzz  CricbuzzPAK vs ENG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- England Tour of Pakistan, 3rd T20I  Cricket AddictorPakistan vs England, 2nd T20I Highlights: Babar Azam, Mohammad Rizwan Create New World Record As Pak..  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-23 15:15:07","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS start time deadline: Why match is delayed today 2nd T20I in Nagpur?","link":"https://thesportsrush.com/cricket-news-ind-vs-aus-start-time-deadline-why-match-is-delayed-today-2nd-t20i-in-nagpur/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs AUS start time: The second India vs Australia T20I in Nagpur has been delayed by a minimum of two hours, Had it not been for multiple wet patches at the Vidarbha Cricket Association Stadium due to yesterday’s rain, the first innings of the second India vs Australia T20I would’ve been facing its end… The post IND vs AUS start time deadline: Why match is delayed today 2nd T20I in Nagpur? appeared first on The SportsRush.","content":"IND vs AUS start time: The second India vs Australia T20I in Nagpur has been delayed by a minimum of two hours, Had it not been for multiple wet patches at the Vidarbha Cricket Association Stadium due to yesterday’s rain, the first innings of the second India vs Australia T20I would’ve been facing its end by now. With toss delayed by over a couple of hours and having it in it to be further delayed due to a wet outfield, there are chances of the match getting cancelled altogether. Assuming that the same happens, it would be quite a pity for Nagpur fans who had an opportunity of watching an international match after almost three years. What will be all the more disappointing would be the fact that the match would get abandoned without a ball being bowled on a day when it hasn’t rained at all in the city. IND vs AUS start time Originally scheduled to happen at 06:30 PM (IST), the first delay to the toss which this match faced lasted for 30 minutes. The length of the second delay got doubled as match officials eventually decided to have another ground inspection at 08:00 PM. Still not satisfied with the condition of the ground especially a few patches which fall near the fast bowlers’ run-up, umpires have now decided to conduct an inspection at 08:45 PM. “Still not safe for the players. It’s wet underneath. We are looking at the safety of the players. Ground staff working their best,” umpire KN Ananthapadmanabhan told Star Sports about the reason behind such an elongated delay. Honestly, there is a stampede in Hyderabad, police beat up the fans. They cannot start a match even an hour after scheduled time in Nagpur despite there being no rain. This is not the 1980s. BCCI are now the richest, most powerful board. The fans deserve better, honestly. — Abhishek Mukherjee (@ovshake42) September 23, 2022 The possibility of a curtailed match, by and large, should be decided during the next inspection. Readers must note that there’s a 09:45 PM deadline for the first ball to be bowled. If the same doesn’t happen, the match will have to be cancelled. The post IND vs AUS start time deadline: Why match is delayed today 2nd T20I in Nagpur? appeared first on The SportsRush.","pubDate":"2022-09-23 15:11:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}