{"newsArray":[{"title":"Sad truth about Candice’s marriage to Warner","link":"https://www.news.com.au/sport/sports-life/candice-warner-reveals-the-truth-about-her-marriage-to-aussie-cricket-star/news-story/cc1d417d4a81a871260de386d8c83f1c","keywords":null,"creator":null,"video_url":null,"description":"Former Ironwoman Candice Warner has opened up on her relationship with Aussie cricket star David, revealing the difficulties associated with being married to someone who spends so many days a year away from home.","content":null,"pubDate":"2021-12-10 00:11:00","full_description":"Former Ironwoman Candice Warner has opened up on her relationship with Aussie cricket star David, revealing the difficulties associated with being married to someone who spends so many days a year away from home. Speaking on the latest episode of Cathrine Mahoney and Sarah McGilvray’s Not Another Parenting Podcast , Candice elaborated on juggling looking after the couple’s three young daughters with all her other commitments as David travels the world playing for Australia in all three formats. Catch every moment of The Ashes live and ad-break free during play on Kayo. Join now for just $5 for 2-months Kayo Basic . New customers only, ends 13th Dec. Candice said she and David had only spent the equivalent of three months together over the past 14 months and admitted lockdowns took their toll. “Just being the single mum, it’s kind of not what I signed up for,” Candice said. “Building a house, home schooling, lockdowns — it has been a juggle and it’s been really tough, to be completely honest. I haven’t enjoyed it. “Each day is something different and my kids are at the age where they start to test you, they miss dad, they understand what’s going on and it has been difficult.” Time away from her husband is hard, but it’s also a shock to the system when David — a veteran of 86 Test matches — comes home. “You get so used to being on your own and doing things your way, and then your husband comes home and all of a sudden — you’ve got more washing, which isn’t great — and it’s the inconsistency,” Candice said. “He wants to have fun with the kids and they want their daddy, but you still have a household to run. “I had my own routine. I’d wake up, I’d get the kids to school, I’d go to the gym. All of a sudden he’s home, my routine’s all mixed up. It is really, really weird.” Candice also spoke about how it can be tough knowing who to turn to when she needs support, because even though she knows David will be there for her, she doesn’t want to put any extra pressure on him because he needs a clear mind to perform at the highest level. “I don’t like to burden him with things because he’s so far away, there’s not much he can do about it,” Candice told the Not Another Parenting Podcast . “He’s your husband and your best friend and he’s the person that you turn to, but knowing that he’s got a game for Australia, a World Cup final or The Ashes, and I don’t want him to be distracted and he’s purely focused on that ... you feel very alone and then, well, who can I turn to? “That’s where, for me, it’s been difficult these past three months. Who do I turn to when my husband’s there and yes, he would love me to open up to him, but I don’t want him to have that burden and that pressure when he’s already going through so much. “He needs to be focused, he needs to be clear-minded and go out there and open the batting for Australia in the best possible headspace. So that’s where it’s a challenge.” Candice added there are times when she cries in the car because life can get overwhelming at times. “It has been a challenge and you think as a mum, as a wife, as anyone, you’re invincible. But we all have our weaknesses and our moments,” she said. “There have been times where … I’ve been driving and I just break down into tears. Or my kids are in the back screaming. I’m just like, “When is this going to end?’” A WWE legend has had his contract torn up over an ugly stand-off behind the scenes, ending his 30-year career in wrestling. A famous two-time Olympic gold medallist has been taken into custody following allegations of “rape and sexual assault” of a 15-year-old. Mark Cavendish’s kids “feared for their lives” as armed robbers assaulted the Olympian and threatened his wife during a horror ordeal.","image_url":null,"source_id":"news"},{"title":"Ashes 2021-22: Australia v England first Test, day three – live! - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIxL2RlYy8xMC9hc2hlcy0yMDIxLTIyLWRheS0zLXRocmVlLWNyaWNrZXQtYXVzdHJhbGlhLXZzLWVuZ2xhbmQtZmlyc3QtdGVzdC1saXZlLXNjb3JlLWNhcmQtYXVzLXYtZW5nLXN0YXJ0LXRpbWUtbGF0ZXN0LXVwZGF0ZXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2021-22: Australia v England first Test, day three – live!  The GuardianAustralia reacts as X-rated stump mic swear comes through crystal clear  NEWS.com.au“It was incredible striking”: Marnus pays tribute to Head | Alinta News Wrap  cricket.com.auGrandstand at Stumps Day 2: Head accelerates Australia's charge  ABC News‘Bloody awful’: Terrifying moment Australian centurion Travis Head hits the deck  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-09 23:37:42","image_url":null,"source_id":"google"},{"title":"Mandhana ideal choice as Mithali's successor: Shantha","link":"https://www.thehansindia.com/sports/cricket/mandhana-ideal-choice-as-mithalis-successor-shantha-718997","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Smriti Mandhana is the ideal candidate to lead India after ODI and Test skipper Mithali Raj retires following the conclusion of the Women's World Cup in New Zealand next year, said former captain Shantha Rangaswamy.","content":"Mithali Raj,Smriti MandhanaMithali Raj,Smriti MandhanaNew Delhi: Smriti Mandhana is the ideal candidate to lead India after ODI and Test skipper Mithali Raj retires following the conclusion of the Women's World Cup in New Zealand next year, said former captain Shantha Rangaswamy.Harmanpreet Kaur has been the T20 captain since 2016 but her inconsistent run as a batter doesn't make her an automatic choice to replace Mithali in the longer formats. Mandhana, on the other hand, has established herself as among the best batters in the world. \"Smriti is the ideal choice after Mithali retires. She has been an excellent performer for India and should be given the opportunity to lead the country,\" Shantha, who led India to their first ever Test win back in 1976, told PTI. Shantha, who also happens to be a BCCI Apex Council member, feels captaincy has impacted Harmanpreet's batting which she thinks is key for India's success. Mandhana, who has played four Tests, 62 ODIs and 84 T20s, was last seen in the Women's Big Bash in Australia where he also scored a hundred against Melbourne Renegades. Harmanpreet, who has been battling with form and fitness over the last 12 months, also did well in the Big Bash and it remains to be seen if she can carry that form to the highest level. India's next assignment will be the away series against New Zealand before the World Cup in March-April. India had finished runners-up in 2017. With the Women's Challenger concluding on Thursday, Shantha said the competition showed there is no dearth of talent in the country. \"The event has unearthed a lot of talent which augurs well for women's cricket. It also shows that we are ready for a Women's IPL,\" she added. (PTI)","pubDate":"2021-12-09 20:05:11","full_description":"Mithali Raj,Smriti Mandhana New Delhi: Smriti Mandhana is the ideal candidate to lead India after ODI and Test skipper Mithali Raj retires following the conclusion of the Women's World Cup in New Zealand next year, said former captain Shantha Rangaswamy. Harmanpreet Kaur has been the T20 captain since 2016 but her inconsistent run as a batter doesn't make her an automatic choice to replace Mithali in the longer formats. Mandhana, on the other hand, has established herself as among the best batters in the world. \"Smriti is the ideal choice after Mithali retires. She has been an excellent performer for India and should be given the opportunity to lead the country,\" Shantha, who led India to their first ever Test win back in 1976, told PTI. Shantha, who also happens to be a BCCI Apex Council member, feels captaincy has impacted Harmanpreet's batting which she thinks is key for India's success. Mandhana, who has played four Tests, 62 ODIs and 84 T20s, was last seen in the Women's Big Bash in Australia where he also scored a hundred against Melbourne Renegades. Harmanpreet, who has been battling with form and fitness over the last 12 months, also did well in the Big Bash and it remains to be seen if she can carry that form to the highest level. India's next assignment will be the away series against New Zealand before the World Cup in March-April. India had finished runners-up in 2017. With the Women's Challenger concluding on Thursday, Shantha said the competition showed there is no dearth of talent in the country. \"The event has unearthed a lot of talent which augurs well for women's cricket. It also shows that we are ready for a Women's IPL,\" she added. (PTI)","image_url":"https://assets.thehansindia.com/h-upload/2021/12/09/500x300_1127919-mthali.jpg","source_id":"thehansindia"},{"title":"Canberra bids to host fifth Ashes Test","link":"https://www.news.com.au/sport/canberra-bids-to-host-fifth-ashes-test/video/b32875d3f1a3ee57f6ee2d35938ee799","keywords":null,"creator":null,"video_url":null,"description":"Canberra has joined the chase to host the final Ashes cricket Test of the summer. The venue for game five remains undecided – with a tender process underway, prompting an historic bid from the nation's capital.","content":null,"pubDate":"2021-12-09 19:50:21","full_description":null,"image_url":null,"source_id":"news"},{"title":"Canberra bids to host fifth Ashes Test","link":"https://www.cairnspost.com.au/sport/canberra-bids-to-host-fifth-ashes-test/video/b32875d3f1a3ee57f6ee2d35938ee799","keywords":["Lifestyle - syndicated","National","Sport news and galleries"],"creator":null,"video_url":null,"description":"Canberra has joined the chase to host the final Ashes cricket Test of the summer. The venue for game five remains undecided – with a tender process underway, prompting an historic bid from the nation's capital.","content":null,"pubDate":"2021-12-09 19:50:21","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Australia reacts as X-rated stump mic swear comes through crystal clear","link":"https://www.foxsports.com.au/cricket/the-ashes/australia-reacts-as-xrated-stump-mic-swear-comes-through-crystal-clear/news-story/6020a4821531f2c8a10baaca92af636b","keywords":null,"creator":null,"video_url":null,"description":"Travis Head hit his first Ashes century and the third of his Test match cricket career on Thursday as he helped Australia put England to the sword.","content":null,"pubDate":"2021-12-09 19:20:00","full_description":null,"image_url":null,"source_id":"foxsports"},{"title":"‘Oh you what’: Stump mic catches Aussie out","link":"https://www.cairnspost.com.au/affiliates/kayo/australia-reacts-as-xrated-stump-mic-swear-comes-through-crystal-clear/news-story/06dab90d98a706eb1affe21835b806cf","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Travis Head hit his first Ashes century and the third of his Test match cricket career on Thursday as he helped Australia put England to the sword.","content":null,"pubDate":"2021-12-09 18:21:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ben Stokes injury update: Will Ben Stokes further play in Gabba Test vs Australia at Brisbane?","link":"https://thesportsrush.com/cricket-news-ben-stokes-injury-update-will-ben-stokes-further-play-in-gabba-test-vs-australia-at-brisbane/","keywords":["Cricket","Ashes 2021-22","Australia vs England","Ben Stokes","Ben Stokes injury"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ben Stokes injury update: Ben Stokes suffered a knee injury while fielding in what was a day dominated by Australia on Day 2 of Gabba Test. Having skittled the English line-up for a mere 147 in 50.1 Overs in their first innings on Day 1, Australia dominated the proceedings on Day 2 with the bat,… The post Ben Stokes injury update: Will Ben Stokes further play in Gabba Test vs Australia at Brisbane? appeared first on The SportsRush.","content":"Ben Stokes injury update: Ben Stokes suffered a knee injury while fielding in what was a day dominated by Australia on Day 2 of Gabba Test. Having skittled the English line-up for a mere 147 in 50.1 Overs in their first innings on Day 1, Australia dominated the proceedings on Day 2 with the bat, with the English attack clearly missing the services of their veteran pacers in James Anderson and Stuart Broad during the first Ashes Test at The Gabba in Brisbane. A unbeaten century from in-form Travis Head (112* off 95), coupled with useful innings from David Warner (94 off 176) and Marnus Labushane (74 off 117) made sure Australia have taken a massive 196-run lead as they would continue to bat on Day 3 with 343/7 posted on the scoreboard. Adding to the woes and nervoursness of the English camp is their premier all-rounder Ben Stokes’s injury, which got surfaced during the 29th Over of the innings while fielding. Ben Stokes injury update: What happened to Ben Stokes? During the 29th Over of the Australian innings, Stokes appeared to suffer the injury to his knee when he chased a ball to the boundary. Post his slide, he was clearly seen struggling on the field for the rest of the day’s play. During the fag end of the third session, Stokes clearly wasn’t running hard into his run-up, bowling mostly around 128-130 kmph mark. “Obviously Ben has hurt himself on the field today so didn’t bowl full pace at the back end of the day. Think our medical guys will assess him overnight and see how he is. Other than that the guys are okay,” England bowling coach Jon Lewis was quoted as saying. He might thus, return back to the field on Day 3, but it remains to be seen how well he has recovered overnight. B Stokes injury @benstokes38 #Ashes #Ashes2021 @sports_tale #AUSvENG pic.twitter.com/j6TQ5Hv7th — Inian Kumar Ganesan (@Inian14) December 9, 2021 Pacer Ollie Robinson too left off the field during the final session and did not take the second new ball but England bowling coach Jon Lewis said he wasn’t injured. Ben Stokes was in the news throughout the day’s play post managing (almost) to get rid of David Warner in his first over back in Test cricket off a No-Ball. It soon transpired that he had overstepped on the first three deliveries of the over as well – but a broken system meant they weren’t called by the third umpire under the new protocols. It was later confirmed that the technology put in place to allow the TV official to monitor the frontline had gone down before the match started so this Test is being played under the previous playing conditions where only wicket-taking deliveries are checked. Host broadcaster Channel Seven later showed that in Stokes’ first five overs there had been 14 no-balls with only one called on field.   The post Ben Stokes injury update: Will Ben Stokes further play in Gabba Test vs Australia at Brisbane? appeared first on The SportsRush.","pubDate":"2021-12-09 18:02:53","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Gilchrist’s wise words to Carey the blueprint for Australian cricket","link":"https://www.theage.com.au/sport/cricket/gilchrist-s-wise-words-to-carey-the-blueprint-for-australian-cricket-20211209-p59g54.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Webster"],"video_url":null,"description":"Former Australian wicketkeeper’s speech was one of the finest pieces of sports broadcasting seen in a long time, and should be seen as the motto for a game reeling from the Tim Paine sexting scandal.","content":null,"pubDate":"2021-12-09 18:00:00","full_description":"It was one of the finest pieces of sports broadcasting seen in a long time. Before play in the first Ashes Test at the Gabba, wicketkeeping great Adam Gilchrist was asked to present debutant Alex Carey with his baggy green. The face of Fox Cricket, Gilchrist had his lapel microphone turned on, and it didn’t just take the viewer into the inner sanctum but made us part of it. Every word Gilchrist spoke was worth bottling, although one part stands out. “There’s a lot of value placed on this cap, but not for a moment is there any sense of entitlement that comes with it,” Gilchrist told Carey. “It doesn’t make you any more special than anyone else in society. But if you play with humility, if you play with integrity, honesty and complete commitment to this group of people … society will ride with you in the highs. More importantly, when the lows come they will pick you up and carry you.” During his career, Gilchrist demonstrated you could be a successful Australian cricketer and not be a prick. Not everyone who has worn the baggy green has matched those standards. All round good bloke: Adam Gilchrist. Credit: AAP There’s a clear difference between entitlement and swagger, between arrogance and aggression. The national team runs best when it leans towards the latter. The ball-tampering episode in South Africa showed what can happen when it leans to the former. That entitlement reared its ugly little head during the SCG Test against India last summer when then captain Tim Paine petulantly sledged Ravi Ashwin and was fined for swearing at umpire Paul Wilson . Some continue to paint Paine as the victim following his dramatic resignation over a sexting scandal involving a Cricket Tasmania staffer, which is quite remarkable. Anyone who has read that text message exchange understands that Paine was the one using sexually explicit language, while the woman essentially dismissed him. It was Paine who sent an unsolicited image of his genitalia, not her. That hubris ultimately cost Paine his international career and exposed Cricket Australia as inept in handling important matters. People argue there’s a demarcation between what happens on the field and off it. That horse, in professional sport, bolted long ago. There’s also a myth that’s been perpetuated that Australia play their best cricket when acting like a schoolyard bully. That’s also bullshit, as detailed in Herald columnist Greg Chappell ’s recently released book Greg Chappell: Not Out . He reveals how he confronted former coach Darren Lehmann about turning David Warner into the “attack dog” of the side. “There was a feeling from the team’s management and leadership that an attack dog was needed and that haranguing opposition players and getting in their faces was part of how the team won,” Chappell writes. “I disagreed totally, but the counterview from Darren was, ‘That’s the way we’ve always played cricket.’ My response was, ‘No Darren, maybe that’s the way you’ve played cricket, but it wasn’t the way I played.‘” The result was Sandpapergate, an episode Australian cricket might never live down. Life will be different under new captain Pat Cummins , a cleanskin seemingly made for the front of Weet-Bix boxes. Australia have resembled cranky bikies kicking cute puppies with steel-capped boots in the first two days of this series, but at no point have they looked like “headbutting the line”. It’s a long summer, of course. Pressure and fatigue can make players — and especially the skipper — act in ways he regrets. As the captain who instructed his brother, Trevor, to bowl an underarm delivery in a one-day international against New Zealand in 1981, Chappell understands that more than most. But there’s a difference between an error of judgement and a team philosophy. Stick with Gilly’s. He usually knows best. The SCG remains hopeful it can host the fifth Ashes Test, under lights with a pink ball, although the smart money is on Hobart. NSW, Victoria and Tasmania lodged their tenders to Cricket Australia on Wednesday but there’s a belief head office is mindful of how cranky Cricket Tasmania remains over the way it handled the Tim Paine affair. A true federation, CA needs to keep the states onside. Meanwhile, the SCG will unveil new inductees into its Media Hall of Fame this summer, including rugby broadcaster Gordon Bray , football’s Les Murray , photographic pioneer Herb Fishwick (who built the world’s first telephoto lens) and the Herald ’s former chief league and cricket writer Tom Goodman . As Alan Clarkson , another Herald legend, said of Goodman: “There has never been a finer sporting journalist than Tom Goodman, a man who loved all sport and particularly those he covered with such distinction.” They will be honoured with commemorative panels in the corridor that runs behind the press and broadcast facilities in the Noble Bradman Messenger Stand. Abdo goes under the knife A big shout out to NRL chief executive Andrew Abdo , who has had emergency surgery to have his gall bladder removed. One of the hardest workers in the game, Abdo has been privately struggling all year with what he believed were stomach ulcers. He was in extreme pain in grand final week as COVID-19 infections in Queensland raised the possibility of the match between Penrith and Souths being postponed. The pain in his tummy only eased on the final morning when state government officials allowed the decider to be held at Suncorp Stadium. Earlier this week, though, he was rushed to hospital in excruciating pain. He was advised his gall bladder was infected and should be removed before it burst. Typically, workaholic Abdo was back on deck within days. We wish him all the best. The natives were restless following last week’s item about feisty Mudgee Race Club ex-president Colleen Walker , who has been “warned off” the track where she’s been a volunteer for 30 years amid claims of bullying and harassment, which she emphatically denies. Fellow director James O’Neill , who owns the Butcher Shop Cafe, fired off a series of cranky emails to this column. “Stick to rugby league, your [sic] better than this,” O’Neill predictably advised before following up with this missive: “64-year-old grandmother, sounds like you should be back at Newscorpse [News Corp]“. I’m not sure what O’Neill has against grandmothers — or facts for that matter — but Walker is, indeed, a 64-year-old grandmother. O’Neill was a noticeable absentee at Tuesday’s annual general meeting, which was a “civil” affair according to those in attendance. Local publican Tony Brown was installed as president and the decision made to appoint a chief executive. Sounds like a good idea. Colleen Walker, who has been stood down from Mudgee Race Club indefinitely over bullying allegations. Suggestions aired at the meeting that last week’s story was “watered down” following legal threats from Racing NSW are wildly incorrect. Pressure was applied from certain people — it always is — but not a word was changed. A clarification, too: Walker isn’t concerned about getting a fair hearing on the appeals panel, should she take that course of action, but the show-cause panel, which is her first avenue if she wants to return to the club. The Carbine Club will hold its Christmas lunch at the SCG on Friday where a glass — and bread roll, no doubt — will be raised in honour of cricketing great Alan Davidson , who passed away on October 30. (Davo would famously use a bread roll like it was a cricket ball to demonstrate the point he was making during functions). Davidson’s son, Neil, has donated a rare bat that not only carries Davo’s signature but that of every Sheffield Shield cricketer of the 1995-1996 season, including Mark Taylor , Steve and Mark Waugh , Ricky Ponting , Matthew Hayden , Andrew Symonds , Jason Gillespie and David Boon . The Carbine Club raises invaluable funds for junior sport, something Davidson, as a founding member of the NSW branch, was passionate about. You can bid for the bat by emailing: carbinensw@bigpond.com.au . THE QUOTE “He love-bombed me for the first three months.” — Instagram model Chiara Passari on former boyfriend Nick Kyrgios . Incoming! THUMBS UP Yes, we’ve become a little obsessed with Sam Kerr in this section the last few weeks but she’s quite hard to deny. Just ask Arsenal keeper Manuela Zinsberger , who Kerr beat twice in Chelsea’s 3-0 win in the FA Cup final at Wembley, prompting declarations from Kerr’s coach Emma Hayes that she’s “the best striker in the world”. THUMBS DOWN As a lifelong Cold Chisel fan, it hurts to write this but … Ian Moss requiring a cheat sheet to sing the national anthem before the Bathurst 1000, and not even hiding it with the drivers standing by and TV cameras showing the piece of paper in front of him, is a “Meatloaf moment”, as one viewer described it. It’s a big weekend for … crack pacers King of Swing and Expensive Ego (I feel seen) in the Inter Dominion final at Menangle on Saturday night. The time-honoured event hasn’t been held for two years because of COVID-19. Herald turf editor Chris Roots is tipping King of Swing. It’s an even bigger weekend for … former unified lightweight world champion Vasiliy Lomachenko , who meets Richard Commey in a 12-round main event at Madison Square Garden on Sunday. A fight between the Ukrainian and Australia’s George Kambosos jnr looms. “Of course, Kambosos is a fight I would like,” he said earlier this week. Bring it on. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage"},{"title":"Gilchrist’s wise words to Carey the blueprint for Australian cricket","link":"https://www.smh.com.au/sport/cricket/gilchrist-s-wise-words-to-carey-the-blueprint-for-australian-cricket-20211209-p59g54.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Webster"],"video_url":null,"description":"Former Australian wicketkeeper’s speech was one of the finest pieces of sports broadcasting seen in a long time, and should be seen as the motto for a game reeling from the Tim Paine sexting scandal.","content":null,"pubDate":"2021-12-09 18:00:00","full_description":"It was one of the finest pieces of sports broadcasting seen in a long time. Before play in the first Ashes Test at the Gabba, wicketkeeping great Adam Gilchrist was asked to present debutant Alex Carey with his baggy green. The face of Fox Cricket, Gilchrist had his lapel microphone turned on, and it didn’t just take the viewer into the inner sanctum but made us part of it. Every word Gilchrist spoke was worth bottling, although one part stands out. “There’s a lot of value placed on this cap, but not for a moment is there any sense of entitlement that comes with it,” Gilchrist told Carey. “It doesn’t make you any more special than anyone else in society. But if you play with humility, if you play with integrity, honesty and complete commitment to this group of people … society will ride with you in the highs. More importantly, when the lows come they will pick you up and carry you.” During his career, Gilchrist demonstrated you could be a successful Australian cricketer and not be a prick. Not everyone who has worn the baggy green has matched those standards. All round good bloke: Adam Gilchrist. Credit: AAP There’s a clear difference between entitlement and swagger, between arrogance and aggression. The national team runs best when it leans towards the latter. The ball-tampering episode in South Africa showed what can happen when it leans to the former. That entitlement reared its ugly little head during the SCG Test against India last summer when then captain Tim Paine petulantly sledged Ravi Ashwin and was fined for swearing at umpire Paul Wilson . Some continue to paint Paine as the victim following his dramatic resignation over a sexting scandal involving a Cricket Tasmania staffer, which is quite remarkable. Anyone who has read that text message exchange understands that Paine was the one using sexually explicit language, while the woman essentially dismissed him. It was Paine who sent an unsolicited image of his genitalia, not her. That hubris ultimately cost Paine his international career and exposed Cricket Australia as inept in handling important matters. People argue there’s a demarcation between what happens on the field and off it. That horse, in professional sport, bolted long ago. There’s also a myth that’s been perpetuated that Australia play their best cricket when acting like a schoolyard bully. That’s also bullshit, as detailed in Herald columnist Greg Chappell ’s recently released book Greg Chappell: Not Out . He reveals how he confronted former coach Darren Lehmann about turning David Warner into the “attack dog” of the side. “There was a feeling from the team’s management and leadership that an attack dog was needed and that haranguing opposition players and getting in their faces was part of how the team won,” Chappell writes. “I disagreed totally, but the counterview from Darren was, ‘That’s the way we’ve always played cricket.’ My response was, ‘No Darren, maybe that’s the way you’ve played cricket, but it wasn’t the way I played.‘” The result was Sandpapergate, an episode Australian cricket might never live down. Life will be different under new captain Pat Cummins , a cleanskin seemingly made for the front of Weet-Bix boxes. Australia have resembled cranky bikies kicking cute puppies with steel-capped boots in the first two days of this series, but at no point have they looked like “headbutting the line”. It’s a long summer, of course. Pressure and fatigue can make players — and especially the skipper — act in ways he regrets. As the captain who instructed his brother, Trevor, to bowl an underarm delivery in a one-day international against New Zealand in 1981, Chappell understands that more than most. But there’s a difference between an error of judgement and a team philosophy. Stick with Gilly’s. He usually knows best. The SCG remains hopeful it can host the fifth Ashes Test, under lights with a pink ball, although the smart money is on Hobart. NSW, Victoria and Tasmania lodged their tenders to Cricket Australia on Wednesday but there’s a belief head office is mindful of how cranky Cricket Tasmania remains over the way it handled the Tim Paine affair. A true federation, CA needs to keep the states onside. Meanwhile, the SCG will unveil new inductees into its Media Hall of Fame this summer, including rugby broadcaster Gordon Bray , football’s Les Murray , photographic pioneer Herb Fishwick (who built the world’s first telephoto lens) and the Herald ’s former chief league and cricket writer Tom Goodman . As Alan Clarkson , another Herald legend, said of Goodman: “There has never been a finer sporting journalist than Tom Goodman, a man who loved all sport and particularly those he covered with such distinction.” They will be honoured with commemorative panels in the corridor that runs behind the press and broadcast facilities in the Noble Bradman Messenger Stand. Abdo goes under the knife A big shout out to NRL chief executive Andrew Abdo , who has had emergency surgery to have his gall bladder removed. One of the hardest workers in the game, Abdo has been privately struggling all year with what he believed were stomach ulcers. He was in extreme pain in grand final week as COVID-19 infections in Queensland raised the possibility of the match between Penrith and Souths being postponed. The pain in his tummy only eased on the final morning when state government officials allowed the decider to be held at Suncorp Stadium. Earlier this week, though, he was rushed to hospital in excruciating pain. He was advised his gall bladder was infected and should be removed before it burst. Typically, workaholic Abdo was back on deck within days. We wish him all the best. The natives were restless following last week’s item about feisty Mudgee Race Club ex-president Colleen Walker , who has been “warned off” the track where she’s been a volunteer for 30 years amid claims of bullying and harassment, which she emphatically denies. Fellow director James O’Neill , who owns the Butcher Shop Cafe, fired off a series of cranky emails to this column. “Stick to rugby league, your [sic] better than this,” O’Neill predictably advised before following up with this missive: “64-year-old grandmother, sounds like you should be back at Newscorpse [News Corp]“. I’m not sure what O’Neill has against grandmothers — or facts for that matter — but Walker is, indeed, a 64-year-old grandmother. O’Neill was a noticeable absentee at Tuesday’s annual general meeting, which was a “civil” affair according to those in attendance. Local publican Tony Brown was installed as president and the decision made to appoint a chief executive. Sounds like a good idea. Colleen Walker, who has been stood down from Mudgee Race Club indefinitely over bullying allegations. Suggestions aired at the meeting that last week’s story was “watered down” following legal threats from Racing NSW are wildly incorrect. Pressure was applied from certain people — it always is — but not a word was changed. A clarification, too: Walker isn’t concerned about getting a fair hearing on the appeals panel, should she take that course of action, but the show-cause panel, which is her first avenue if she wants to return to the club. The Carbine Club will hold its Christmas lunch at the SCG on Friday where a glass — and bread roll, no doubt — will be raised in honour of cricketing great Alan Davidson , who passed away on October 30. (Davo would famously use a bread roll like it was a cricket ball to demonstrate the point he was making during functions). Davidson’s son, Neil, has donated a rare bat that not only carries Davo’s signature but that of every Sheffield Shield cricketer of the 1995-1996 season, including Mark Taylor , Steve and Mark Waugh , Ricky Ponting , Matthew Hayden , Andrew Symonds , Jason Gillespie and David Boon . The Carbine Club raises invaluable funds for junior sport, something Davidson, as a founding member of the NSW branch, was passionate about. You can bid for the bat by emailing: carbinensw@bigpond.com.au . THE QUOTE “He love-bombed me for the first three months.” — Instagram model Chiara Passari on former boyfriend Nick Kyrgios . Incoming! THUMBS UP Yes, we’ve become a little obsessed with Sam Kerr in this section the last few weeks but she’s quite hard to deny. Just ask Arsenal keeper Manuela Zinsberger , who Kerr beat twice in Chelsea’s 3-0 win in the FA Cup final at Wembley, prompting declarations from Kerr’s coach Emma Hayes that she’s “the best striker in the world”. THUMBS DOWN As a lifelong Cold Chisel fan, it hurts to write this but … Ian Moss requiring a cheat sheet to sing the national anthem before the Bathurst 1000, and not even hiding it with the drivers standing by and TV cameras showing the piece of paper in front of him, is a “Meatloaf moment”, as one viewer described it. It’s a big weekend for … crack pacers King of Swing and Expensive Ego (I feel seen) in the Inter Dominion final at Menangle on Saturday night. The time-honoured event hasn’t been held for two years because of COVID-19. Herald turf editor Chris Roots is tipping King of Swing. It’s an even bigger weekend for … former unified lightweight world champion Vasiliy Lomachenko , who meets Richard Commey in a 12-round main event at Madison Square Garden on Sunday. A fight between the Ukrainian and Australia’s George Kambosos jnr looms. “Of course, Kambosos is a fight I would like,” he said earlier this week. Bring it on. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh"},{"title":"Gilchrist’s wise words to Carey the blueprint for Australian cricket","link":"https://www.smh.com.au/sport/cricket/gilchrist-s-wise-words-to-carey-the-blueprint-for-australian-cricket-20211209-p59g54.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Webster"],"video_url":null,"description":"Former Australian wicketkeeper’s speech was one of the finest pieces of sports broadcasting seen in a long time, and should be seen as the motto for a game reeling from the Tim Paine sexting scandal.","content":null,"pubDate":"2021-12-09 18:00:00","full_description":"It was one of the finest pieces of sports broadcasting seen in a long time. Before play in the first Ashes Test at the Gabba, wicketkeeping great Adam Gilchrist was asked to present debutant Alex Carey with his baggy green. The face of Fox Cricket, Gilchrist had his lapel microphone turned on, and it didn’t just take the viewer into the inner sanctum but made us part of it. Every word Gilchrist spoke was worth bottling, although one part stands out. “There’s a lot of value placed on this cap, but not for a moment is there any sense of entitlement that comes with it,” Gilchrist told Carey. “It doesn’t make you any more special than anyone else in society. But if you play with humility, if you play with integrity, honesty and complete commitment to this group of people … society will ride with you in the highs. More importantly, when the lows come they will pick you up and carry you.” During his career, Gilchrist demonstrated you could be a successful Australian cricketer and not be a prick. Not everyone who has worn the baggy green has matched those standards. All round good bloke: Adam Gilchrist. Credit: AAP There’s a clear difference between entitlement and swagger, between arrogance and aggression. The national team runs best when it leans towards the latter. The ball-tampering episode in South Africa showed what can happen when it leans to the former. That entitlement reared its ugly little head during the SCG Test against India last summer when then captain Tim Paine petulantly sledged Ravi Ashwin and was fined for swearing at umpire Paul Wilson . Some continue to paint Paine as the victim following his dramatic resignation over a sexting scandal involving a Cricket Tasmania staffer, which is quite remarkable. Anyone who has read that text message exchange understands that Paine was the one using sexually explicit language, while the woman essentially dismissed him. It was Paine who sent an unsolicited image of his genitalia, not her. That hubris ultimately cost Paine his international career and exposed Cricket Australia as inept in handling important matters. People argue there’s a demarcation between what happens on the field and off it. That horse, in professional sport, bolted long ago. There’s also a myth that’s been perpetuated that Australia play their best cricket when acting like a schoolyard bully. That’s also bullshit, as detailed in Herald columnist Greg Chappell ’s recently released book Greg Chappell: Not Out . He reveals how he confronted former coach Darren Lehmann about turning David Warner into the “attack dog” of the side. “There was a feeling from the team’s management and leadership that an attack dog was needed and that haranguing opposition players and getting in their faces was part of how the team won,” Chappell writes. “I disagreed totally, but the counterview from Darren was, ‘That’s the way we’ve always played cricket.’ My response was, ‘No Darren, maybe that’s the way you’ve played cricket, but it wasn’t the way I played.‘” The result was Sandpapergate, an episode Australian cricket might never live down. Life will be different under new captain Pat Cummins , a cleanskin seemingly made for the front of Weet-Bix boxes. Australia have resembled cranky bikies kicking cute puppies with steel-capped boots in the first two days of this series, but at no point have they looked like “headbutting the line”. It’s a long summer, of course. Pressure and fatigue can make players — and especially the skipper — act in ways he regrets. As the captain who instructed his brother, Trevor, to bowl an underarm delivery in a one-day international against New Zealand in 1981, Chappell understands that more than most. But there’s a difference between an error of judgement and a team philosophy. Stick with Gilly’s. He usually knows best. The SCG remains hopeful it can host the fifth Ashes Test, under lights with a pink ball, although the smart money is on Hobart. NSW, Victoria and Tasmania lodged their tenders to Cricket Australia on Wednesday but there’s a belief head office is mindful of how cranky Cricket Tasmania remains over the way it handled the Tim Paine affair. A true federation, CA needs to keep the states onside. Meanwhile, the SCG will unveil new inductees into its Media Hall of Fame this summer, including rugby broadcaster Gordon Bray , football’s Les Murray , photographic pioneer Herb Fishwick (who built the world’s first telephoto lens) and the Herald ’s former chief league and cricket writer Tom Goodman . As Alan Clarkson , another Herald legend, said of Goodman: “There has never been a finer sporting journalist than Tom Goodman, a man who loved all sport and particularly those he covered with such distinction.” They will be honoured with commemorative panels in the corridor that runs behind the press and broadcast facilities in the Noble Bradman Messenger Stand. Abdo goes under the knife A big shout out to NRL chief executive Andrew Abdo , who has had emergency surgery to have his gall bladder removed. One of the hardest workers in the game, Abdo has been privately struggling all year with what he believed were stomach ulcers. He was in extreme pain in grand final week as COVID-19 infections in Queensland raised the possibility of the match between Penrith and Souths being postponed. The pain in his tummy only eased on the final morning when state government officials allowed the decider to be held at Suncorp Stadium. Earlier this week, though, he was rushed to hospital in excruciating pain. He was advised his gall bladder was infected and should be removed before it burst. Typically, workaholic Abdo was back on deck within days. We wish him all the best. The natives were restless following last week’s item about feisty Mudgee Race Club ex-president Colleen Walker , who has been “warned off” the track where she’s been a volunteer for 30 years amid claims of bullying and harassment, which she emphatically denies. Fellow director James O’Neill , who owns the Butcher Shop Cafe, fired off a series of cranky emails to this column. “Stick to rugby league, your [sic] better than this,” O’Neill predictably advised before following up with this missive: “64-year-old grandmother, sounds like you should be back at Newscorpse [News Corp]“. I’m not sure what O’Neill has against grandmothers — or facts for that matter — but Walker is, indeed, a 64-year-old grandmother. O’Neill was a noticeable absentee at Tuesday’s annual general meeting, which was a “civil” affair according to those in attendance. Local publican Tony Brown was installed as president and the decision made to appoint a chief executive. Sounds like a good idea. Colleen Walker, who has been stood down from Mudgee Race Club indefinitely over bullying allegations. Suggestions aired at the meeting that last week’s story was “watered down” following legal threats from Racing NSW are wildly incorrect. Pressure was applied from certain people — it always is — but not a word was changed. A clarification, too: Walker isn’t concerned about getting a fair hearing on the appeals panel, should she take that course of action, but the show-cause panel, which is her first avenue if she wants to return to the club. The Carbine Club will hold its Christmas lunch at the SCG on Friday where a glass — and bread roll, no doubt — will be raised in honour of cricketing great Alan Davidson , who passed away on October 30. (Davo would famously use a bread roll like it was a cricket ball to demonstrate the point he was making during functions). Davidson’s son, Neil, has donated a rare bat that not only carries Davo’s signature but that of every Sheffield Shield cricketer of the 1995-1996 season, including Mark Taylor , Steve and Mark Waugh , Ricky Ponting , Matthew Hayden , Andrew Symonds , Jason Gillespie and David Boon . The Carbine Club raises invaluable funds for junior sport, something Davidson, as a founding member of the NSW branch, was passionate about. You can bid for the bat by emailing: carbinensw@bigpond.com.au . THE QUOTE “He love-bombed me for the first three months.” — Instagram model Chiara Passari on former boyfriend Nick Kyrgios . Incoming! THUMBS UP Yes, we’ve become a little obsessed with Sam Kerr in this section the last few weeks but she’s quite hard to deny. Just ask Arsenal keeper Manuela Zinsberger , who Kerr beat twice in Chelsea’s 3-0 win in the FA Cup final at Wembley, prompting declarations from Kerr’s coach Emma Hayes that she’s “the best striker in the world”. THUMBS DOWN As a lifelong Cold Chisel fan, it hurts to write this but … Ian Moss requiring a cheat sheet to sing the national anthem before the Bathurst 1000, and not even hiding it with the drivers standing by and TV cameras showing the piece of paper in front of him, is a “Meatloaf moment”, as one viewer described it. It’s a big weekend for … crack pacers King of Swing and Expensive Ego (I feel seen) in the Inter Dominion final at Menangle on Saturday night. The time-honoured event hasn’t been held for two years because of COVID-19. Herald turf editor Chris Roots is tipping King of Swing. It’s an even bigger weekend for … former unified lightweight world champion Vasiliy Lomachenko , who meets Richard Commey in a 12-round main event at Madison Square Garden on Sunday. A fight between the Ukrainian and Australia’s George Kambosos jnr looms. “Of course, Kambosos is a fight I would like,” he said earlier this week. Bring it on. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh"},{"title":"KL Rahul vice captain: Who will be Team India’s new Vice captain in ODI and T20?","link":"https://thesportsrush.com/cricket-news-kl-rahul-vice-captain-who-will-be-team-indias-new-vice-captain-in-odi-and-t20/","keywords":["Cricket","Miscellaneous","BCCI","KL Rahul","Rohit Sharma","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"KL Rahul vice captain: After Rohit Sharma’s alleviation to the post of ODI captain, KL Rahul is likely to be Team India’s new Vice-captain. The BCCI had opened the floodgates of discussions, debates, animosity and what not ever since BCCI’s selection committee selected an 18-member Test squad for Team India’s tour of South Africa. The… The post KL Rahul vice captain: Who will be Team India’s new Vice captain in ODI and T20? appeared first on The SportsRush.","content":"KL Rahul vice captain: After Rohit Sharma’s alleviation to the post of ODI captain, KL Rahul is likely to be Team India’s new Vice-captain. The BCCI had opened the floodgates of discussions, debates, animosity and what not ever since BCCI’s selection committee selected an 18-member Test squad for Team India’s tour of South Africa. The topic however, was not regarding the squad analysis, but regarding a supposed ouster of Virat Kohli as Team India’s ODI captain. The BCCI, in its press release merely mentioned the fact that Rohit Sharma has been appointed as the team’s new ODI skipper, without citing the reason(s) for Kohli’s removal from the post, or an official statement from Kohli himself on the same. All of this came at a time when the selection committee did not even announce the 3-match ODI squad for the tour. However, after almost 24 hours of all the confusion and drama, BCCI president Sourav Ganguly finally shed light on the reason for the move, and why he (and the BCCI) felt India could not go on with two captains in the limited Overs format. With Rohit Sharma set to lead the team in the White-ball format altogether beginning with the ODI series in South Africa from January 19, the post of vice-captain of the team falls vacant. KL Rahul vice captain: Rahul likely to be named vice-captain in limited Overs With the selection committee likely to announce the squad for the 3-match ODI series in a few days time, KL Rahul, if sources are to be believed, is likely to be appointed as Team India’s new vice-captain in White Ball Cricket. “KL (Rahul) will be the next vice-captain. It was an obvious choice in white-ball formats. He has done excellently over the last few years. He has 6-7 years left in him and can be groomed to become the next captain. With Rohit and Virat around besides Dravid, he will learn a lot,” a senior BCCI official told InsideSport. Rishabh Pant as vice captain was on the cards as well As per the above mentioned source, BCCI had also considered wicketkeeper-batter Rishabh Pant’s name for Rohit Sharma’s deputy as well. But, considering his young age (24 years), the think tank felt the responsibility would prove to be an unnecessary additional burden on him. “Rishabh is very young and at this stage, giving him extra responsibility could become a burden for him. With the seniors around, he will learn a lot. Personally, I don’t think it would have been the right call to hand over the responsibility as the vice-captain will have to lead at some point when seniors like Rohit are rested,” the BCCI official told InsideSport. Team India will begin their 3-match ODI series against South Africa at Paarl from January 19, with the 4-match T20I series postponed to a later date.       The post KL Rahul vice captain: Who will be Team India’s new Vice captain in ODI and T20? appeared first on The SportsRush.","pubDate":"2021-12-09 16:57:09","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“BCCI requested Virat not to step down as T20I skipper”: Sourav Ganguly sheds light on why Virat Kohli was removed from captaincy in ODIs for India","link":"https://thesportsrush.com/cricket-news-bcci-requested-virat-not-to-step-down-as-t20i-skipper-sourav-ganguly-sheds-light-on-why-virat-kohli-was-removed-from-captaincy-in-odis-for-india/","keywords":["Cricket","BCCI","Sourav Ganguly","Team India","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sourav Ganguly sheds light on why Virat Kohli was removed as Team India’s captain in ODIs after BCCI is being criticized for the move. Virat Kohli’s unceremonious exit as captain of Team India in the 50-Over format of the game has witnessed two extreme reactions by fans and experts. While Rohit Sharma’s appointment as his… The post “BCCI requested Virat not to step down as T20I skipper”: Sourav Ganguly sheds light on why Virat Kohli was removed from captaincy in ODIs for India appeared first on The SportsRush.","content":"Sourav Ganguly sheds light on why Virat Kohli was removed as Team India’s captain in ODIs after BCCI is being criticized for the move. Virat Kohli’s unceremonious exit as captain of Team India in the 50-Over format of the game has witnessed two extreme reactions by fans and experts. While Rohit Sharma’s appointment as his new replacement has been welcomed by people, the other section was rightly unimpressed by the BCCI for not providing a valid explanation for the reason(s) for Kohli’s removal from the post. ALSO READ: Team India announce 18-member Test squad for South Africa tour With no word from Kohli either on the issue, one should not be gaslighted for believing that all is not right between the ex-White ball skipper and the BCCI. However, after almost 24 hours of all the drama and confusion, BCCI president Sourav Ganguly has finally opened up on the issue and has cited the reason for Kohli’s removal from the captaincy spot and Rohit Sharma’s appointment as his replacement. “BCCI requested Virat not to step down as T20I skipper”: Sourav Ganguly It is worth mentioning that Virat had stepped down as team India’s skipper in the T20 format just before the team was about to begin their 2021 T20 World Cup campaign, and after yet another failure to win an IPL title for his franchise Royal Challengers Bangalore (RCB). Kohli had cited ‘workload management’ as one of the important reasons for him arriving at the decision, and had explicitly mentioned that he would continue leading the side in the ODI and the Test format. pic.twitter.com/Ds7okjhj9J — Virat Kohli (@imVkohli) September 16, 2021 Ganguly, on Thursday mentioned that Kohli was requested by the BCCI not to step down as T20I captain of the team, but he refused to change his decision. He also stated that it was a collective decision made by the BCCI officials to appoint Rohit Sharma as the team’s new limited Overs format skipper. “Actually, the BCCI had requested Virat to not step down as the T20I skipper but obviously, he did not agree. And the selectors then did not feel it right to have two different captains for two white-ball formats,” Ganguly was quoted as saying to ANI. “So it was decided that Virat will continue as Test captain and Rohit will take over as the white-ball captain. I as President personally spoke to Virat Kohli and the chairman of selectors has also spoken to him,” Ganguly further added. Ganguly thanked Kohli for his contributions as captain in T20Is and ODIs, while backing Rohit’s abilities as skipper. “We have full faith in Rohit Sharma’s leadership abilities, and Virat will continue as the Test captain. We as BCCI are confident that Indian cricket is in good hands. We thank Virat Kohli for his contributions as captain in the white-ball format,” the BCCI president said.           The post “BCCI requested Virat not to step down as T20I skipper”: Sourav Ganguly sheds light on why Virat Kohli was removed from captaincy in ODIs for India appeared first on The SportsRush.","pubDate":"2021-12-09 15:00:42","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Couldn't afford ‘too much of leadership’, says Ganguly on Rohit replacing Kohli as ODI skipper - The Hindu","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy50aGVoaW5kdS5jb20vc3BvcnQvY3JpY2tldC9jb3VsZG50LWFmZm9yZC10b28tbXVjaC1vZi1sZWFkZXJzaGlwLXNheXMtZ2FuZ3VseS1vbi1yb2hpdC1yZXBsYWNpbmcta29obGktYXMtb2RpLXNraXBwZXIvYXJ0aWNsZTM3OTE0NjgzLmVjZdIBmgFodHRwczovL3d3dy50aGVoaW5kdS5jb20vc3BvcnQvY3JpY2tldC9jb3VsZG50LWFmZm9yZC10b28tbXVjaC1vZi1sZWFkZXJzaGlwLXNheXMtZ2FuZ3VseS1vbi1yb2hpdC1yZXBsYWNpbmcta29obGktYXMtb2RpLXNraXBwZXIvYXJ0aWNsZTM3OTE0NjgzLmVjZS9hbXAv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Couldn't afford ‘too much of leadership’, says Ganguly on Rohit replacing Kohli as ODI skipper  The HinduSelectors must groom someone as the future captain: Vengsarkar  The Indian ExpressRohit Sharma's ascent to ODI captaincy predictable and sensible  ESPNcricinfoBCCI President Sourav Ganguly Explains Why Rohit Sharma Replaced Virat Kohli As Full-Time Team India..  NDTV SportsRajkumar Sharma says Virat Kohli still has a bright 5-6 years cricket left in him  NEWS9 liveView Full coverage on Google News","content":null,"pubDate":"2021-12-09 14:02:38","image_url":null,"source_id":"google"},{"title":"BCCI President Sourav Ganguly Explains Why Rohit Sharma Replaced Virat Kohli As Full-Time Team India.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2RpZC1ub3QtZmVlbC1pdC1yaWdodC1iY2NpLXByZXNpZGVudC1zb3VyYXYtZ2FuZ3VseS1leHBsYWlucy1yb2hpdC1zaGFybWEtcmVwbGFjaW5nLXZpcmF0LWtvaGxpLWFzLWZ1bGwtdGltZS10ZWFtLWluZGlhLXdoaXRlLWJhbGwtY2FwdGFpbi0yNjQ0Mjg40gG4AWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvZGlkLW5vdC1mZWVsLWl0LXJpZ2h0LWJjY2ktcHJlc2lkZW50LXNvdXJhdi1nYW5ndWx5LWV4cGxhaW5zLXJvaGl0LXNoYXJtYS1yZXBsYWNpbmctdmlyYXQta29obGktYXMtZnVsbC10aW1lLXRlYW0taW5kaWEtd2hpdGUtYmFsbC1jYXB0YWluLTI2NDQyODgvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BCCI President Sourav Ganguly Explains Why Rohit Sharma Replaced Virat Kohli As Full-Time Team India..  NDTVSports.comInjured Ravindra Jadeja, Axar Patel out of South Africa tour; Rohit Sharma named ODI captain | Cricbuzz.com - Cricbuzz  CricbuzzRajkumar Sharma says Virat Kohli still has a bright 5-6 years cricket left in him  NEWS9 liveSA vs IND: 3 surprising inclusions in India’s Test squad  CricTrackerImportance of player is not measured by his captaincy, says Kirti Azad  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-09 13:55:00","image_url":null,"source_id":"google"},{"title":"BCCI President Sourav Ganguly Explains Why Rohit Sharma Replaced Virat Kohli As Full-Time Team India.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2RpZC1ub3QtZmVlbC1pdC1yaWdodC1iY2NpLXByZXNpZGVudC1zb3VyYXYtZ2FuZ3VseS1leHBsYWlucy1yb2hpdC1zaGFybWEtcmVwbGFjaW5nLXZpcmF0LWtvaGxpLWFzLWZ1bGwtdGltZS10ZWFtLWluZGlhLXdoaXRlLWJhbGwtY2FwdGFpbi0yNjQ0Mjg40gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BCCI President Sourav Ganguly Explains Why Rohit Sharma Replaced Virat Kohli As Full-Time Team India..  NDTV SportsRohit Sharma's ascent to ODI captaincy predictable and sensible  ESPNcricinfoSelectors must groom someone as the future captain: Vengsarkar  The Indian ExpressRajkumar Sharma says Virat Kohli still has a bright 5-6 years cricket left in him  NEWS9 liveSourav Ganguly: 'Had requested Virat not to step down as T20I captain'  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2021-12-09 13:55:00","image_url":null,"source_id":"google"},{"title":"Ashes 2021, Australia vs England, First Test Day 3 live: Cricket scores, weather Brisbane, live updates, video, updates","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-first-test-day-3-live-cricket-scores-weather-brisbane-live-updates-video-updates/news-story/df08071e613f2c26d5dff32aa9ded54f","keywords":null,"creator":null,"video_url":null,"description":"Travis Head blasted the third-fastest century in Ashes history to crush England hopes on the second day of the opening Test at the Gabba on Thursday.","content":null,"pubDate":"2021-12-09 13:00:00","full_description":"Travis Head blasted the third-fastest century in Ashes history to crush England hopes on the second day of the opening Test at the Gabba on Thursday. At the close of play a dominant Australia were 343-7, a lead of 196 on England’s dismal first-innings total of 147. Play resumes on day three at 10:30AM EDT with Head on 112 alongside Mitchell Starc on 10. Catch every moment of The Ashes live and ad-break free during play on Kayo. Join now for just $5 for 2-months Kayo Basic. New customers only, ends 13th Dec. England had threatened a comeback after tea when Ollie Robinson took two wickets in consecutive balls, but Head’s aggressive innings put paid to any hopes of a miracle recovery. The 27-year-old Head, controversially recalled to the Australia side ahead of veteran Usman Khawaja, justified his selection by passing 100 off only 85 balls. He smashed two sixes and 12 fours in his century - the third-fastest in the Ashes behind only Adam Gilchrist’s 56-ball ton in Perth in 2006 and Gilbert Jessop’s 76-ball effort at The Oval in 1902. Head WHACKS 85-ball century on day two | 02:23 “I’m still pinching myself -- I can’t quite work out what transpired over the past couple of hours,” Head said. “I took some chances -- technically and mentally I was really composed, really relaxed,” he added. “I found the first 20 runs really tough, but the game opened up and I was able to take the chances, which is pleasing.” Head attacked from the outset and was particularly harsh on spinners Jack Leach and Joe Root, the English skipper. Head came to the crease with Australia 189-3 after Steve Smith edged Mark Wood to keeper Jos Buttler just before tea. He then watched David Warner (94) and Cameron Green depart to Robinson’s accurate seamers after the break, with Australia still only 89 runs ahead. Head cops nasty BEAMER to the chin! | 01:56 Earlier, Warner rode his luck in the first two sessions. The gritty Australian batsman was bowled by a no-ball by Ben Stokes before lunch, then dropped by Rory Burns in the first over after the break, before Haseeb Hameed bungled a simple run-out. Warner’s good fortune began when Stokes bowled him when he was on 17, but the all-rounder had overstepped to give the Australian opener a mighty reprieve. Television replays showed that Stokes had also overstepped on the first three balls of his over, but nothing was called. It later transpired that technology issues were at the centre of the no-ball drama. Warner falls agonisingly short of ton | 02:18 England needed to take all their chances to keep their hopes of salvaging anything from the first Test after their disastrous start on Wednesday, when they were bowled out in just 50.1 calamitous overs. They started well when Robinson claimed his first Ashes wicket, Marcus Harris, with the score on 10. England went into the Test without veteran seamers Jimmy Anderson and Stuart Broad, surprising many, including Australian captain Pat Cummins. But the seam attack of Robinson, Chris Woakes and the outright pace of Wood were able to keep the Australian batters pinned down early on with some tight and accurate bowling. Robinson was particularly dangerous and made the breakthrough when he enticed Harris to play forward to a ball that left him slightly, the Australian opener edging to second slip, where Dawid Malan took a good low catch. TONKED! Every time Leach was launched | 02:34 England bowling coach Jon Lewis was full of praise for his seamers, especially Robinson, but said they needed to be more consistent. “There was some really positive stuff, if you were critical you could say we needed to be a lot more consistent and there were times when the Australians got on top of us,” he said. “(Robinson) threatened all the way through -- every time he got the ball in his hand he looked a threat and I think the Australian batsmen found him hard to play.” After Harris’s early exit, Warner and Marnus Labuschagne consolidated, but late in the second session Labuschagne sliced an attempted cut off Leach to Wood at backward point to fall for 74. Soon after Wood, who bowled with real pace all day, gave England some cheer when he removed the dangerous Smith -- so often England’s tormentor -- in the penultimate over of the second session. When Warner slapped a short Robinson ball to Stokes at short cover after tea and then Green shouldered arms and was bowled next ball, England must have had some belief. But that was soon quashed by Head’s swashbuckling innings. Follow Day 3 of the First Ashes Test in our live blog below!","image_url":null,"source_id":"foxsports"},{"title":"Fears for Leach's career after 'brutal' onslaught","link":"https://wwos.nine.com.au/cricket/the-ashes-2021-england-reaction-jack-leach-bowling-destroyed-by-australia/0ecfed28-be93-4c39-9d0b-81cbc4d33fc8","keywords":null,"creator":["wwos"],"video_url":null,"description":"UK VIEW: He was a hero during the previous Ashes series, but Jack Leach's career is now on life support.","content":"There are fears England spinner Jack Leach may be playing in his final Ashes Test after being subjected to a merciless assault from Australia's batsmen on Day 2. England's decision to pick Leach - a left-arm spinner - over veteran seamer Stuart Broad was questioned at the coin toss and his first innings performance so far has done little to silence the critics.The 30-year-old bowled just 11 overs, even with the likes of Ollie Robinson and Ben Stokes struggling in the searing Brisbane heat, with Australia plundering the spinner for 95 runs in those overs. ASHES WRAP: Head heroics power Aussies to big lead after Day 2Leach's economy rate of 8.63 was one that is considered high even in the game's shortest format, let alone Test cricket, and allowed Australia to break the shackles after a tense opening session.Australia's relentless assault on Leach was similar to the tactic adopted against Pakistan spinner Yasir Shah, who was smacked for 124 off 14 overs during the New Year's Test back in 2017.Leach's performance was a stark contrast to his output in the drawn 2019 series between the two sides, where he took 12 wickets in four Tests, including 4-49 at The Oval.READ MORE: England fumes over umpires' missed no-ball calls on StokesREAD MORE: The technical switch behind Head's batting masterclassThe performance left many back in the UK wondering whether Brisbane would be the last they would see of the man who became a cult hero for his role in the Ben Stokes miracle in Headingley two years ago.\"It is almost frightening, and certainly demoralising, how quickly a Test match in Australia can slip away,\" Scyld Berry wrote in The Telegraph.\"This is why England's selection for the Gabba Test was wrong. They had to pack their side with four seamers, plus Ben Stokes, and no spinner except Joe Root.\"Leach could not fill this vacuum as the Australian batsmen decided to take him apart, and the runs he conceded - at the rate of 8.6 per over - have scuppered England's chances.\"Former England captain Michael Atherton said the Australians attacked the left-arm spinner with \"brutal intent\".\"Gone was the dark cloud and humidity of the first day, replaced by piercing blue skies and sapping heat,\" he wrote in The Telegraph.READ MORE: 'Nasty' delivery floors Head moments after maiden Ashes century\"Splendid batting conditions, in other words, and an opportunity for Australia's batsmen to twist the knife, which they did, slowly for the most part, unless Leach was bowling, when they attacked with brutal intent.\"The ruthless attack on Leach left BBC commentator Jonathan Agnew feeling some sympathy for the spinner.\"Jack Leach was a bad selection for the pitch,\" he said.\"It is a five-seamer pitch and it seems a total luxury but you are five for this game because you don't know how fit Ben Stokes is and you can bowl a seamer when you need him.\"It was utterly predictable that Australia were going to attack Leach – it is what we said yesterday. It was very obvious that's what was going to happen.\"I feel sorry for him – he has hardly played since India. He's bowled very well. He didn't bowl particularly badly but they just smashed him.\"While Leach was far from the only thing to go wrong for England on Day 2, inews.co.uk correspondent Chris Stocks said the spinner's showing was \"the most alarming development\".Leach is not the first English spinner to be taken apart on Australian soil, with the likes of Graeme Swann and Moeen Ali suffering similar fates in previous tours down under, but the left-armer's performance received little sympathy from Stocks.\"What Leach served up at the Gabba ... was worse than anything seen by either Moeen or Swann,\" he wrote.\"Indeed, barring a miraculous performance in Australia's second innings – presuming they actually have to bat again – he's virtually unselectable for the rest of the series.\"You have to feel for the 30-year-old because he has been put in an impossible position by being asked to play his first Test in nine months on the biggest and most unforgiving stage of all.\"Leach is clearly not trusted by captain Joe Root, who opted against picking him for any of last summer's six home Tests.\"The Telegraph's Nick Hoult even laid some of the blame on Leach for Stokes' struggles.\"The non-selection of James Anderson and Stuart Broad will rumble for a long time and picking four seamers put pressure on Stokes to bowl when not fully ready,\" he wrote.\"Also pity poor Leach was was overlooked all summer and then thrust into an Ashes Test on a green pitch. No surprise he was belted around.\"Despite the treatment he received, England's bowling coach Jon Lewis was not prepared to count Leach out.\"It wouldn't be one of his better days and he'll want to put it at the back of his memory, but like I said about the other guys I know Jack is a pretty resilient fella,\" Lewis said. \"We're definitely not defeated yet. Expect Jack to come back strong tomorrow and show the character I know he has.\"With Stokes all but certain to be hampered for the remainder of this Test match, England will require a superhuman reversal of fortunes for its left-arm spinner in the second innings.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-09 12:54:20","full_description":"There are fears England spinner Jack Leach may be playing in his final Ashes Test after being subjected to a merciless assault from Australia's batsmen on Day 2. England's decision to pick Leach - a left-arm spinner - over veteran seamer Stuart Broad was questioned at the coin toss and his first innings performance so far has done little to silence the critics. The 30-year-old bowled just 11 overs, even with the likes of Ollie Robinson and Ben Stokes struggling in the searing Brisbane heat, with Australia plundering the spinner for 95 runs in those overs. ASHES WRAP: Head heroics power Aussies to big lead after Day 2 Leach's economy rate of 8.63 was one that is considered high even in the game's shortest format, let alone Test cricket, and allowed Australia to break the shackles after a tense opening session. Australia's relentless assault on Leach was similar to the tactic adopted against Pakistan spinner Yasir Shah, who was smacked for 124 off 14 overs during the New Year's Test back in 2017. Leach's performance was a stark contrast to his output in the drawn 2019 series between the two sides, where he took 12 wickets in four Tests, including 4-49 at The Oval. READ MORE: England fumes over umpires' missed no-ball calls on Stokes READ MORE: The technical switch behind Head's batting masterclass The performance left many back in the UK wondering whether Brisbane would be the last they would see of the man who became a cult hero for his role in the Ben Stokes miracle in Headingley two years ago. \"It is almost frightening, and certainly demoralising, how quickly a Test match in Australia can slip away,\" Scyld Berry wrote in The Telegraph . \"This is why England's selection for the Gabba Test was wrong. They had to pack their side with four seamers, plus Ben Stokes, and no spinner except Joe Root. \"Leach could not fill this vacuum as the Australian batsmen decided to take him apart, and the runs he conceded - at the rate of 8.6 per over - have scuppered England's chances.\" Former England captain Michael Atherton said the Australians attacked the left-arm spinner with \"brutal intent\". \"Gone was the dark cloud and humidity of the first day, replaced by piercing blue skies and sapping heat,\" he wrote in The Telegraph . READ MORE: 'Nasty' delivery floors Head moments after maiden Ashes century \"Splendid batting conditions, in other words, and an opportunity for Australia's batsmen to twist the knife, which they did, slowly for the most part, unless Leach was bowling, when they attacked with brutal intent.\" The ruthless attack on Leach left BBC commentator Jonathan Agnew feeling some sympathy for the spinner. \"Jack Leach was a bad selection for the pitch,\" he said. \"It is a five-seamer pitch and it seems a total luxury but you are five for this game because you don't know how fit Ben Stokes is and you can bowl a seamer when you need him. \"It was utterly predictable that Australia were going to attack Leach – it is what we said yesterday. It was very obvious that's what was going to happen. \"I feel sorry for him – he has hardly played since India. He's bowled very well. He didn't bowl particularly badly but they just smashed him.\" While Leach was far from the only thing to go wrong for England on Day 2, inews.co.uk correspondent Chris Stocks said the spinner's showing was \"the most alarming development\". Leach is not the first English spinner to be taken apart on Australian soil, with the likes of Graeme Swann and Moeen Ali suffering similar fates in previous tours down under, but the left-armer's performance received little sympathy from Stocks. \"What Leach served up at the Gabba ... was worse than anything seen by either Moeen or Swann,\" he wrote. \"Indeed, barring a miraculous performance in Australia's second innings – presuming they actually have to bat again – he's virtually unselectable for the rest of the series. \"You have to feel for the 30-year-old because he has been put in an impossible position by being asked to play his first Test in nine months on the biggest and most unforgiving stage of all. \"Leach is clearly not trusted by captain Joe Root, who opted against picking him for any of last summer's six home Tests.\" The Telegraph 's Nick Hoult even laid some of the blame on Leach for Stokes' struggles. \"The non-selection of James Anderson and Stuart Broad will rumble for a long time and picking four seamers put pressure on Stokes to bowl when not fully ready,\" he wrote. \"Also pity poor Leach was was overlooked all summer and then thrust into an Ashes Test on a green pitch. No surprise he was belted around.\" Despite the treatment he received, England's bowling coach Jon Lewis was not prepared to count Leach out. \"It wouldn't be one of his better days and he'll want to put it at the back of his memory, but like I said about the other guys I know Jack is a pretty resilient fella,\" Lewis said. \"We're definitely not defeated yet. Expect Jack to come back strong tomorrow and show the character I know he has.\" With Stokes all but certain to be hampered for the remainder of this Test match, England will require a superhuman reversal of fortunes for its left-arm spinner in the second innings. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/398276/pickerimage.jpg","source_id":"nine"},{"title":"\"Thank You Captain\": BCCI Lauds Virat Kohli For ODI Leadership - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiY2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvdGhhbmsteW91LWNhcHRhaW4tYmNjaS1sYXVkcy12aXJhdC1rb2hsaS1mb3Itb2RpLWxlYWRlcnNoaXAtMjY0NDI1M9IBaWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvdGhhbmsteW91LWNhcHRhaW4tYmNjaS1sYXVkcy12aXJhdC1rb2hsaS1mb3Itb2RpLWxlYWRlcnNoaXAtMjY0NDI1My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Thank You Captain\": BCCI Lauds Virat Kohli For ODI Leadership  NDTVSports.comInjured Ravindra Jadeja, Axar Patel out of South Africa tour; Rohit Sharma named ODI captain | Cricbuzz.com - Cricbuzz  CricbuzzVirat Kohli Sacked: Sourav Ganguly gives blunt clarification, check out  InsideSportRohit replaces Kohli as ODI captain, takes over from Rahane as Test vice-captain  ESPNcricinfoRajkumar Sharma says Virat Kohli still has a bright 5-6 years cricket left in him  NEWS9 liveView Full coverage on Google News","content":null,"pubDate":"2021-12-09 12:52:45","image_url":null,"source_id":"google"},{"title":"Ganguly opens up on Rohit being named India's ODI skipper","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-south-africa/sourav-ganguly-opens-up-on-rohit-sharma-being-named-indias-odi-skipper/articleshow/88189050.cms","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) president Sourav Ganguly on Thursday said the board and selectors together took the call to appoint Rohit Sharma as the full-time white-ball captain of the side.","content":null,"pubDate":"2021-12-09 12:46:29","full_description":null,"image_url":null,"source_id":"toi"},{"title":"rohit sharma: Sourav Ganguly opens up on Rohit Sharma being named India's ODI skipper | Cricket News - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pbmRpYS1pbi1zb3V0aC1hZnJpY2Evc291cmF2LWdhbmd1bHktb3BlbnMtdXAtb24tcm9oaXQtc2hhcm1hLWJlaW5nLW5hbWVkLWluZGlhcy1vZGktc2tpcHBlci9hcnRpY2xlc2hvdy84ODE4OTA1MC5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"rohit sharma: Sourav Ganguly opens up on Rohit Sharma being named India's ODI skipper | Cricket News  Times of IndiaInjured Ravindra Jadeja, Axar Patel out of South Africa tour; Rohit Sharma named ODI captain | Cricbuzz.com - Cricbuzz  CricbuzzRohit replaces Kohli as ODI captain, takes over from Rahane as Test vice-captain  ESPNcricinfoSA vs IND: 3 surprising inclusions in India’s Test squad  CricTrackerRajkumar Sharma says Virat Kohli still has a bright 5-6 years cricket left in him  NEWS9 liveView Full coverage on Google News","content":null,"pubDate":"2021-12-09 12:46:00","image_url":null,"source_id":"google"},{"title":"I spoke to Virat Kohli: Sourav Ganguly opens up for first time on Rohit Sharma being named India's ODI skipper","link":"https://zeenews.india.com/cricket/i-spoke-to-virat-kohli-sourav-ganguly-opens-up-for-first-time-on-rohit-sharma-being-named-indias-odi-skipper-2417770.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) President Sourav Ganguly on Thursday said the board and selectors together took the call to appoint Rohit Sharma as the full-time white-ball captain of the side.","content":null,"pubDate":"2021-12-09 12:32:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Horror Melbourne Renegades run out farce triggers BBL ‘embarrassment’ - NEWS.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMingFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2JpZy1iYXNoL2hvcnJvci1tZWxib3VybmUtcmVuZWdhZGVzLXJ1bi1vdXQtZmFyY2UtdHJpZ2dlcnMtYmJsLWVtYmFycmFzc21lbnQvbmV3cy1zdG9yeS8xMWMxMWY2N2RhMTM1MTI5MThmMjE4ZjRlNGFmMmM1ZdIBogFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2JpZy1iYXNoL2hvcnJvci1tZWxib3VybmUtcmVuZWdhZGVzLXJ1bi1vdXQtZmFyY2UtdHJpZ2dlcnMtYmJsLWVtYmFycmFzc21lbnQvbmV3cy1zdG9yeS8xMWMxMWY2N2RhMTM1MTI5MThmMjE4ZjRlNGFmMmM1ZT9hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Horror Melbourne Renegades run out farce triggers BBL ‘embarrassment’  NEWS.com.au‘Just too good’: Renegades outclassed by experienced Strikers bowling attack  Fox SportsAdelaide Strikers v Melbourne Renegades, Big Bash 2021-22: report, result, score, scorecard  The CricketerPerth Scorchers vs Adelaide Strikers Preview & Prediction  The Stats ZoneStrikers skittle Renegades in statement victory | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-09 12:30:04","image_url":null,"source_id":"google"},{"title":"‘One of worst I’ve seen’ – Watch England’s Mark Wood hit Australia’s Travis Head on CHIN with vicious Ashes beamer","link":"https://www.thesun.co.uk/sport/16987867/watch-england-wood-hit-australia-head-chin-ashes-beamer/","keywords":["Cricket","Sport","Australia Cricket Team","England Cricket","The Ashes 2021-22"],"creator":["Giacomo Pisa"],"video_url":null,"description":"THE ASHES is famous for its hotly contested matches, with neither side willing to give the other an inch in the fight to lift the famous old urn. And England fast bowler Mark Wood seemed to get caught up in the moment, unleashing a vicious beamer at Travis Head on Day Two of the first […]","content":"THE ASHES is famous for its hotly contested matches, with neither side willing to give the other an inch in the fight to lift the famous old urn. And England fast bowler Mark Wood seemed to get caught up in the moment, unleashing a vicious beamer at Travis Head on Day Two of the first Test in Brisbane. The ball squirted up and smashed Head in the chin Head crumpled to the ground after being hit in the face APHead went down holding his chin after being struck by the delivery[/caption] EPAA concerned Wood held his hand to his chin as Head received treatment[/caption] Wood steamed in and launched the ball down the track, but misdirected his delivery and accidentally bowled a beamer straight into Australia batsman Head. Ball tracking registered the delivery at close to 83mph, with the ball flicking up off Head’s glove and smashing him square in the CHIN. The 27-year-old immediately dropped to the ground as Wood came rushing over to apologise. Head somehow managed to quickly brush himself off and reassure Wood and the concerned trainers that he was ok to continue. The Australian middle order batsman was lucky, and escaped from a potentially serious situation with minimal injury. Commentating on the game for Fox Cricket, Australia legend Steve Waugh shuddered: “That’s one of the worst beamers I’ve seen, that could’ve been very, very nasty.” Most read in Cricket HEAD BOY England battle but Aussies streak ahead in 1st Test with rapid Travis Head century UP AGAINST IT Ex-England captain Cook tells Root’s side to go on attack after horror start down under When is the Ashes 2021/22? Dates, UK start time, TV channel and live stream free THE ASHES England collapse to 147 all out as Australian bowlers run riot in Brisbane SIX APPEAL Meet The Ashes Wags, from a BBC Radio 1 presenter to an ex-pro ironwoman ASH CLOUD England rolled for 147 in awful Ashes start as they lose wicket with first ball JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) Meanwhile ex-fast bowler Brett Lee said: “He actually got out of that really well Travis, he sort of cushioned the blow on his glove and then it flicked him under the chin.” Durham local Wood was officially crowned as the fastest Twenty20 bowler in the world earlier this year. And although this incident was with the red ball rather than the white one, batsmen still know about it if a Wood delivery thuds into them. Amazingly Head wasn’t too shaken up and ended the day unbeaten on 112, after being struck soon after clocking up his century from just 85 balls. The Australia No5 came into the Ashes with question marks over his place in the team, but answered those questions by helping his side end Day Two on 343/7, 196 runs ahead of England. That’s after Joe Root’s side were skittled out for just 147 on Day One. Head will now be looking to kick on tomorrow and turn his 112 into a mammoth score, and in doing so take the first Test match of the series away from Joe Root and his travelling England side.","pubDate":"2021-12-09 11:50:53","full_description":"THE ASHES is famous for its hotly contested matches, with neither side willing to give the other an inch in the fight to lift the famous old urn. And England fast bowler Mark Wood seemed to get caught up in the moment, unleashing a vicious beamer at Travis Head on Day Two of the first Test in Brisbane. Wood steamed in and launched the ball down the track, but misdirected his delivery and accidentally bowled a beamer straight into Australia batsman Head. Ball tracking registered the delivery at close to 83mph, with the ball flicking up off Head's glove and smashing him square in the CHIN . The 27-year-old immediately dropped to the ground as Wood came rushing over to apologise. Head somehow managed to quickly brush himself off and reassure Wood and the concerned trainers that he was ok to continue. The Australian middle order batsman was lucky, and escaped from a potentially serious situation with minimal injury. Commentating on the game for Fox Cricket , Australia legend Steve Waugh shuddered: \"That’s one of the worst beamers I’ve seen, that could’ve been very, very nasty.\" JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) Meanwhile ex-fast bowler Brett Lee said: \"He actually got out of that really well Travis, he sort of cushioned the blow on his glove and then it flicked him under the chin.\" Durham local Wood was officially crowned as the fastest Twenty20 bowler in the world earlier this year. And although this incident was with the red ball rather than the white one, batsmen still know about it if a Wood delivery thuds into them. Amazingly Head wasn't too shaken up and ended the day unbeaten on 112, after being struck soon after clocking up his century from just 85 balls. The Australia No5 came into the Ashes with question marks over his place in the team, but answered those questions by helping his side end Day Two on 343/7, 196 runs ahead of England. That's after Joe Root's side were skittled out for just 147 on Day One . Head will now be looking to kick on tomorrow and turn his 112 into a mammoth score, and in doing so take the first Test match of the series away from Joe Root and his travelling England side.","image_url":null,"source_id":"thesun"},{"title":"Cricket Fraternity Reacts To Ben Stokes' No-Ball Controversy In Ashes","link":"https://sports.ndtv.com/cricket/cricket-fraternity-reacts-after-ben-stokes-oversteps-14-times-but-umpires-call-no-ball-twice-in-australia-vs-england-1st-test-2643977","keywords":null,"creator":null,"video_url":null,"description":"England all-rounder Ben Stokes reportedly overstepped 14 times on Day 2 of the England vs Australia first Ashes Test in Brisbane but umpires called no-ball only twice. Here's how the cricket...","content":null,"pubDate":"2021-12-09 11:08:18","full_description":"Social media was buzzing with reactions and opinion from the cricket fraternity after a video shared by an Australian channel showed England all-rounder Ben Stokes reportedly overstepping 14 times on Day 2 of the first Ashes Test in Brisbane but only being called no-ball twice by the on-field umpires. One of them was when he had dismissed David Warner for 17 in the 13th over of Australia's first innings. England were left scratching their heads when Warner got a reprieve early on in his innings. The matter escalated further after the left-hander went on to score 94 and then Channel 7 shared a video showing Stokes had overstepped on all of his previous three deliveries before he was called the fourth time, which was actually the wicket ball. The turn of events were surprising as since the early part of this year, ICC had made it clear that the third umpire will monitor the front foot no-ball on every delivery and would call it a no-ball if the bowler oversteps. The answer to why Stokes' other no-balls weren't called was given by broadcaster Alison Mitchell, who informed that the technology to track the front foot no-ball for every delivery “went down.” Huge moment in the game the Warner wicket off a no-ball. We looked at all of Ben Stokes' balls bowled today. FOURTEEN no-balls, only ONE called on field. Many layers to this… #Ashes | @7Cricket @Channel7 pic.twitter.com/a6LreMiLvi \"What happened before the start of this Test match is the technology that's provided to the ICC to enable (checking no-balls) went down,\" she said. Promoted Then how did the third umpire adjudge Warner's dismissal as a no-ball? Mitchell said “only wicket-taking deliveries” were supposed to be checked by the third umpire while the others rested on the on-field umpires' call. “Only wicket-taking deliveries are being checked for no-ball by TV umpire this match. All other deliveries are responsibility of on-field umpire,” she added. Only wicket-taking deliveries are being checked for no ball by TV umpire this match. All other deliveries are responsibility of on-field umpire. #ashes #Stokes #Warner https://t.co/6BfRaKT26y “Oh dear No doubt if the first few were called Stokes would have sorted it out and the wicket ball he may have been behind the line. Quite concerning really,” tweeted former Australia women's cricketer Lisa Sthalekar. Oh dear ????????‍♀️ No doubt if the first few were called Stokes would have sorted it out and the wicket ball he may have been behind the line. Quite concerning really #AUSvENG https://t.co/6n4uo9yi08 “Apparently hawkeye picked up Ben Stokes bowling *14* no-balls in the first session,” wrote former English women's cricketer Isabelle Westbury. Apparently hawkeye picked up Ben Stokes bowling *14* no-balls in the first session. #ashes ???? “When the only explanation is “uhhhh I forgot that was my job lol”,” tweeted New Zealand all-rounder Jimmy Neesham. When the only explanation is “uhhhh I forgot that was my job lol” https://t.co/LquKC1uJyz “Just watched footage of the 14 no-balls that Ben Stokes bowled today and which weren't called. Yes, the simple technology wasn't operational but some of those were huge no-balls. It wasn't that long ago that umpires were supposed to spot them,” wrote renowned broadcaster Harsha Bhogle. Just watched footage of the 14 no-balls that Ben Stokes bowled today and which weren't called. Yes, the simple technology wasn't operational but some of those were huge no-balls. It wasn't that long ago that umpires were supposed to spot them. Meanwhile, Australia took complete control of the series opener courtesy of a blistering hundred from Travis Head. At the close of play, Australia were 343-7 , a lead of 196 on England's dismal first-innings total of 147. Head was on 112 from only 95 balls, alongside Mitchell Starc, who was not-out 10.","image_url":"https://c.ndtvimg.com/2021-12/nt4o2k5_ben-stokes-afp_625x300_09_December_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"CA close to locking in fifth Test venue","link":"https://www.perthnow.com.au/sport/cricket/ca-close-to-locking-in-fifth-test-venue-c-4887025","keywords":null,"creator":["Rob Forsaith"],"video_url":null,"description":"Uncertainty regarding the venue for the fifth men's Ashes Test could soon end with Cricket Australia almost ready to make a call.","content":null,"pubDate":"2021-12-09 11:07:04","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4887025/2bf8824951e18472fe8b8a448b02c71d912598bc-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"CA close to locking in fifth Test venue","link":"https://thewest.com.au/sport/cricket/ca-close-to-locking-in-fifth-test-venue-c-4887022","keywords":null,"creator":["Rob Forsaith"],"video_url":null,"description":"Uncertainty regarding the venue for the fifth men's Ashes Test could soon end with Cricket Australia almost ready to make a call.","content":null,"pubDate":"2021-12-09 11:07:03","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4887022/2bf8824951e18472fe8b8a448b02c71d912598bc-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"Vijay Hazare Trophy 2021-22: Ruturaj Gaikwad slams 2nd consecutive century for Maharashtra","link":"https://www.indiatvnews.com/sports/cricket/vijay-hazare-trophy-2021-22-ruturaj-gaikwad-slams-2nd-consecutive-century-for-maharashtra-continues-good-form-748811","keywords":null,"creator":null,"video_url":null,"description":"Maharashtra opening batsman Ruturaj Gaikwad has slammed his second consecutive hundred in the ongoing Vijay Hazare Trophy 2021-22 here at the Saurashtra Cricket Association Stadium, Rajkot against Chhattisgarh on Thursday. Earlier, on Wednesday the right-hand batsman slammed 136 runs to help his side secure a five-wicket win against Madhya Pradesh. The 24-year-old was adjudged as the captain of Maharashtra ahead of the tournament. ","content":null,"pubDate":"2021-12-09 10:59:04","full_description":"Maharashtra opening batsman Ruturaj Gaikwad has slammed his second consecutive hundred in the ongoing Vijay Hazare Trophy 2021-22 here at the Saurashtra Cricket Association Stadium, Rajkot against Chhattisgarh on Thursday. Earlier, on Wednesday the right-hand batsman slammed 136 runs to help his side secure a five-wicket win against Madhya Pradesh. The 24-year-old was adjudged as the captain of Maharashtra ahead of the tournament. Ruturaj is in form of his life as he was also the leading run-scorer in the 2021 while playing for Chennai Super Kings. Gaikwad became the youngest player in the history of the Indian Premier League to finish the season with the Orange Cap. The talisman scored 635 runs in 16 matches with one century and four fifties under his belt. Opening the batting for CSK he had an average of 45.35 and strike rate of 136.26 in the 14th edition of the IPL. The budding batsman has been retained by CSK for six crores ahead of IPL 2022 mega auction. In the recently concluded BCCI's domestic season of Syed Mushtaq Ali 2021-22, the stalwart from Maharashtra averaged 51.80 in his five outings. Amassing a total of 259 runs, he had a phenomenal strike rate of 149.71. As of now, the young player has hit 261 runs in two games and is the top run-scorer in the ongoing Vijay Hazare Trophy.","image_url":null,"source_id":"indiatvnews"},{"title":"ICC WTC Points Table: Standings After Pakistan's Emphatic Win vs Bangladesh In Dhaka Test - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaWNjLXd0Yy1wb2ludHMtdGFibGUtc3RhbmRpbmdzLWFmdGVyLXBha2lzdGFucy1lbXBoYXRpYy13aW4tdnMtYmFuZ2xhZGVzaC1pbi1kaGFrYS10ZXN0LTI2NDI2NTHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC WTC Points Table: Standings After Pakistan's Emphatic Win vs Bangladesh In Dhaka Test  NDTV SportsBabar Azam On The Incredible Win In Dhaka Test And His First Test wicket | PCB | MA2T  Pakistan CricketUpdated World Test Championship Points Table After Bangladesh vs Pakistan 2nd Test  Cricket AddictorNon-existent top-order the only shocking thing!  The Daily StarSajid Khan bowls Pakistan to dramatic win in fading light | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-09 10:41:00","image_url":null,"source_id":"google"},{"title":"Hobart or Melbourne in photo finish call on fifth Test","link":"https://www.smh.com.au/sport/cricket/hobart-or-melbourne-in-photo-finish-decision-for-fifth-ashes-test-20211209-p59gd7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Cricket Australia boss Nick Hockley is expected to present his verdict on the fifth Ashes Test to the Cricket Australia board as soon as Friday.","content":null,"pubDate":"2021-12-09 10:36:45","full_description":"In what is looming as a photo finish between Hobart and Melbourne, the Cricket Australia chief executive Nick Hockley is expected to present his recommendation on the venue for the fifth Ashes Test to the board as soon as Friday. Hockley, based in Sydney, spent much of Thursday in looking over the submissions of possible venues, weighing up their commercial, logistical and constitutional merits. Melbourne is a strong chance to host the fifth Ashes Test under lights at the MCG. Credit: Getty Images Tasmania’s claims to the final Test of the series, after Perth was ruled out due to Western Australia’s hard border and associated logistical problems, have been strong due to its loss of a match against Afghanistan this summer. However the Victorian government and its major events minister Martin Pakula have made a strong bid to have the day-night match played at the MCG , citing an “undeniable” commercial case given the vast size of the ground and potential for a revenue return of more than $20 million. While Hockley has been at pains to state the call for submissions had been run in order to be “fair to everyone”, some eyebrows have been raised in Tasmania at the fact that a tender process was needed at all. Test matches are traditionally distributed among the six member states year by year. Sydney, Adelaide and Canberra have also been involved in the tender process put out to the states by CA at the start of the week, but Hockley’s final call is set to weigh up the commercial strength of a second match at the MCG in mid-January versus Cricket Tasmania’s constitutional standing as a one-sixth member of CA. Broadcasters have made their preference for a Melbourne or Sydney finale clear, with the Fox Cricket commentator Adam Gilchrist talking up the need for the match to be played at an “iconic” Ashes venue. Among Hockley’s many considerations will be questions like the availability of hotel accommodation for all the events, broadcast and media staff involved in the match, in addition to the two teams and match officials. On Thursday Hockley rebuffed claims by the WA state government that the governing body had been inflexible and “poor” in their handling of the issue. “I think that is highly unfair,” Hockley told SEN Radio. “I think we’ve worked really constructively with governments right around the country throughout the last 18 months. “In the end delivering a Test match is a massive logistical endeavour, a major event, five days, a huge number of production personnel and in the end it became pretty clear in the last 10 days it was just logistically not feasible. I haven’t seen those comments but they’re certainly not reflective of the discussions I’ve been part of.” Hockley also pointed out the differences between the AFL’s relatively simple staging of this year’s grand final in Perth, and the myriad complexities of international cricket. “People have made comparisons to the AFL. The AFL were able to put in an additional bye round and get those two weeks clear,” he said. “That wasn’t something that was possible. England have got further commitments beyond this and we only had a short gap between the fourth and the fifth Tests. “I think we worked constructively with the stadium, with WA police to try to find solutions, which effectively created a 14-day very strict lockdown bubble. But in the end that would’ve prejudiced the broadcast in Sydney and made it very difficult in Perth. In the end it just became unfeasible.” The Prime Minister, Scott Morrison, has stated his personal preference for a Hobart Ashes Test. “For there to be one in Tassie, I think would be great,” he said on Wednesday. “Particularly as the Afghanistan Test obviously didn’t proceed for clear reasons.” Asked about Morrison’s comments, Hockley described the level of interest as commensurate with the “prestige” of an Ashes series. “What that shows is the prestige, the history, how compelling an Ashes Test is, so we’ve tried to be fair to everyone, given everyone an opportunity,” he said. “We’ll be taking into account a range of considerations and ultimately it’s my job to put a recommendation to the board.” Sports news, results and expert commentary. Sign up for our Sport newsletter","image_url":null,"source_id":"smh"}]}