{"newsArray":[{"title":"International League 2023 Most Runs and Most Wickets standings: Alex Hales and Chris Jordan top ILT20 charts - Updated after Final","link":"https://www.sportskeeda.com/cricket/news-international-league-2023-most-runs-most-wickets-standings-alex-hales-chris-jordan-top-ilt20-charts-updated-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"The Gulf Giants became the champions of the inaugural edition of ILT20 2023. On Sunday, February 12, James Vince and Co. defeated Desert Vipers by seven wickets in the final at the Dubai International Cricket Stadium. After being put in to bat first, the Vipers got themselves up to 146 for the loss of eight wickets. Wanindu Hasaranga scored 55 off 27 and helped his team post a respectable score. But his efforts went in vain as the Vipers chased the target down with eight balls to spare. Chris Lynn stayed unbeaten on 72 off 50 balls with nine fours and one six. Shimron Hetmyer stayed unbeaten on 25 off 13 balls with five fours. Alex Hales of the Desert Vipers finished the tournament as the leading run-scorer. In 12 matches, the right-handed batter scored 469 runs at an average of 46.90 and a strike-rate of 151.77 with four half-centuries and a century to his name. James Vince of the Gulf Giants finished second on the list, having scored 439 runs from 11 matches at an average of 48.77 with four half-centuries to show for his efforts. Hales and Vince were the only batters who managed to cross the 400-run mark in the tournament. Kieron Pollard finished six runs short of that mark. Chris Jordan of the Gulf Giants finished the championship as the top wicket-taker. The England fast bowler picked up 20 wickets from 10 matches at an economy rate of 7.39. Jordan’s teammate David Wiese accounted for 18 scalps from 11 matches at a better economy rate of seven. Wanindu Hasaranga of Desert Vipers was also pretty impressive after the leg-spin bowler finished with 15 wickets from nine matches at an economy rate of 7.18. Dwayne Bravo, Sheldon Cottrell and Fazalhaq Farooqi picked up 13, 12 and 12 wickets respectively. Get IND-W vs PAK-W Live Score from Womens T20 World Cup 2023. Follow Sportskeeda for latest updates. Poll : 0 votes Quick Links","pubDate":"2023-02-12 22:47:20","image_url":"https://static.sportskeeda.com/editor/2023/02/dd48f-16762252770863-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Star spotted rocking short skirt and heels","link":"https://www.cairnspost.com.au/sport/john-cena-spotted-rocking-short-skirt-thighhighs-and-heels-in-melbourne/news-story/bb3b3f4ff0d38b0109f5bf600cae982e","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"John Cena has a brand new look that has fans raising their eyebrows.","content":"Sport Don't miss out on the headlines from Sport. Followed categories will be added to My News. John Cena has a brand new look that has fans raising their eyebrows. The former WWE star, 45, was spotted in Melbourne recently filming his upcoming flick Ricky Stanicky — and rocking some traditionally feminine-looking garments. Cena sported a black T-shirt; a short, black-and-white plaid skirt; thigh-high stockings, and lace-up black leather heels. Ricky Stanicky is a comedy, directed by Peter Farrelly, that follows three friends who play a prank by burning down a house. The teens then create a fake character on whom to blame for their actions. Over the next two decades, the trio used the lie to get out of sticky situations — until one day they have to hire an actor to portray Stanicky. Cena rocked a plaid skirt, heels, and stockings as part of his outfit. Picture: BackGrid The Peacemaker actor was spotted walking around the set. Picture: BackGrid Zac Efron and William H. Macy help round out the cast. A release date has yet to be set. Cena tweeted his enthusiasm about the flick on Feb. 1. “Beyond excited to help bring these characters to life (both on- and off-screen) with an incredible cast, our director and producers and partners at @AmazonStudios @primevideo,” the Peacemaker star wrote. American actor John Cena filming at Avalon Airport. Picture: Mark Wilson “#RickyStanicky is a best friend to all — can’t wait for you to meet him!” he gushed. The Suicide Squad actor opened up to British GQ last year about switching up careers from wrestling to acting. “The term Hollywood has such a mystique and lustre around it. If you’re skilled at doing one thing, and then you transition into doing another — really, it sounds the same, but it’s a completely different thing,” he said. Cena on a previous trip to Australia with WWE. John Cena. Picture: Mark Stewart “If you have any chance of success, you have to really, really prepare as much as you can.” For the Massachusetts native, his drive comes from “just trying to work as hard as I can to catch up to everybody else,” he said. More Coverage Megan’s ‘savage’ public move against MGK MAFS grooms’ pre-wedding sex aired “If you feel you don’t have a head start, you’ve just got to put rubber to the road and work your ass off,” Cena added. “So that’s kind of where I’m at, dipping my toes back into the screen side of entertainment rather than live events.” This article was originally published by the New York Post and reproduced with permission Originally published as John Cena spotted rocking short skirt, thigh-highs and heels in Melbourne Join the conversation Add your comment to this story To join the conversation, please log in. Don't have an account? Register Join the conversation, you are commenting as Logout More related stories NFL Billionaire heiress declares ‘I’m single’ Gracie Hunt — the daughter of a billionaire NFL owner — is single and “looking for that number one draft pick” at the Super Bowl. Read more Cricket ‘Dark days’: Fallout from Australia Day stance Ash Gardner bowled Australia to victory in the opening T20 World Cup match and then opened up on a tumultuous time. Read more","pubDate":"2023-02-12 20:14:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"Chris Lynn powers Gulf Giants to inaugural ILT20 title","link":"https://www.indiatoday.in/sports/cricket/story/chris-lynns-heroic-knock-guides-gulf-giants-to-inaugural-ilt20-title-2333885-2023-02-13?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chris Lynn powers Gulf Giants to inaugural ILT20 title","content":": Australia batter Chris Lynn scored an unbeaten half-century to guide Gulf Giants to the inaugural International League T20 title at the Dubai International Stadium. Gulf Giants defeated Desert Vipers by 7 wickets in the final. James Vince won the toss for the Gulf Giants and opted to field first. Desert Vipers got off to the poor start with star-opener Alex Hales being dismissed by Carlos Brathwaite in the second over. Opener Rohan Mustafa also could not hold onto his wicket for long, and was run out in the same over to leave the Vipers reeling at 13/2. Adam Lyth could not move the scoreboard much as Colin de Grandhomme sent him back to the pavilion in the fifth over. Chris Jordan provided the Giants with an important breakthrough, dismissing Vipers captain Colin Munroe for just 6 runs. Wicket-keeping batter Sam Billings, along with Sri Lanka all-rounder Wanindu Hasaranga got the Vipers back in the game with a 72-run partnership. However, Billings couldn’t hold on to his wicket for long and was dismissed by Braithwaite after scoring 31 runs off 29 balls. Hasaranga completed a quick-fire half-century before Qais Ahmad sent him packing. Hasaranga was the top-scorer for the Vipers, amassing 55 runs in 27 deliveries. Ahmed then dismissed Luke Wood, before Braithwaite cleaned up England’s Tom Curran as Desert Vipers ended their innings with 146/8 after 20 overs. In the second innings, Luke Wood dismissed Vince in the fourth over, before Curran cleaned up Colin de Grandhomme to peg the Giants back. However, Chris Lynn had other plans in mind. The right-hander formed an important 73-run partnership with wicket-keeping batter Gerhard Erasmus. Lynn went on to complete his half-century as he, alongside West Indian batter Shimron Hetmyer, to guide the Giants to a 7 wicket win with 8 balls remaining. Lynn top-scored for the Giants, scoring 72 runs off 50 balls, while hitting nine boundaries and a six. Meanwhile, Hetmyer scored 25 runs off 13 balls as the Giants lifted the inaugural ILT20 trophy.","pubDate":"2023-02-12 18:33:50","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Third Test set to be moved - and why it’s a blow for Australia","link":"https://www.smh.com.au/sport/cricket/third-test-set-to-be-moved-and-why-it-s-a-blow-for-australia-20230213-p5cjy0.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"In a fresh blow to Australia’s chances of success in India, the third Test is poised to be moved from Dharamsala, which Steve Smith regarded as the best pitch from the 2017 series.","content":"Australia’s faltering campaign in India has taken another turn for the worse with the third Test poised to be moved from the venue expected to best suit fast bowling. There are multiple reports in Indian media that the match will be relocated from the picturesque Himachal Pradesh Cricket Association Stadium in Dharamsala due to concerns over the state of the outfield. The venue, with the snow-capped Himalayas in the background, was scheduled to stage the third Test, from March 1-5. There were also dramas over the schedule in the last series between the two countries in Australia in 2020/21 when India threatened to boycott the Gabba Test over concerns about Queensland’s COVID-19 quarantine restrictions. Australian captain Pat Cummins removes the cover to inspect the pitch ahead of the first cricket in Nagpur, India. Credit: The decision was reportedly made on Sunday after an inspection of the ground by a team of BCCI officials. There are several bare patches on the playing surface, relaid last year to fit in a new drainage system. As reported by The Sydney Morning Herald and The Age over the weekend , a source familiar with the issue said foggy conditions in the town, located at an altitude of 1451 metres, meant there had been insufficient sunlight for grass to grow. While skipper Pat Cummins has told his team “embracing the chaos” was part of what made tours to India so special, there seems to be a new twist every day in this campaign. On Sunday, Australia’s plans to conduct centre-wicket practice on a fourth-day Test pitch at the VCA Stadium were scuppered because ground staff had watered the pitch and the training nets, despite having granted them permission to use them. The session was cancelled. The cold weather in Dharamsala, where temperatures often dip into single figures at this time of year, would have made it difficult for curators to prepare a dry spin-friendly pitch to suit India’s strengths. Pace played a significant part when Australia played there in 2017 at the venue’s only Test when India speedster Umesh Yadav produced a burst with the new ball to run through the visitors’ top order. In his 2017 autobiography The Journey , then captain Steve Smith wrote that the pitch had pace and bounce and was the “best pitch of the lot”. Australia’s quest to regain the Border-Gavaskar Trophy started in disastrous fashion with an innings defeat in Nagpur. Only three Australian sides have come from 1-0 down in the past 100 years to win a series. Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-12 18:19:16","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jaydev Unadkat: ऑस्ट्रेलिया पर धमाकेदार जीत के बाद टीम इंडिया में हुआ बड़ा बदलाव, टीम से बाहर हुआ यह स्टार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jaydev-unadkat-play-ranji-trophy-final-released-from-the-india-squad/articleshow/97846117.cms","keywords":null,"creator":null,"video_url":null,"description":"Jaydev Unadkat: भारतीय क्रिकेट टीम ने तेज गेंदबाज जयदेव उनादकट को ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज से रिलीज कर दिया है। जयदेव अब सौराष्ट्र के लिए रणजी ट्रॉफी का फाइनल मैच खेलेंगे। इससे पहले उन्हें टीम इंडिया के टेस्ट स्क्वाड में शामिल किया गया था।","content":"ऑस्ट्रेलिया के खिलाफ जारी चार टेस्ट मैचों की सीरीज से तेज गेंदबाज जयदेव उनादकट को रिलीज कर दिया गया है। उनादकट रणजी ट्रॉफी 2022-23 फाइनल के लिए सौराष्ट्र टीम से खेलेंगे। बीसीसीआई की मीडिया विज्ञप्ति के अनुसार, चयन समिति ने भारतीय टीम मैनेजमेंट के परामर्श से उनादकट को रिलीज करने का निर्णय लिया। मीडिया विज्ञप्ति में कहा गया कि,'अखिल भारतीय सीनियर चयन समिति ने भारतीय टीम प्रबंधन के परामर्श से बॉर्डर-गावस्कर ट्रॉफी के लिए भारत के ऑस्ट्रेलिया दौरे के दूसरे टेस्ट के लिए जयदेव उनादकट को भारत की टीम से रिलीज करने का फैसला किया है।' विज्ञप्ति में कहा गया कि, 'उनादकट अब सौराष्ट्र की टीम में शामिल होंगे, जिसने बंगाल के खिलाफ 16 फरवरी से ईडन गार्डन्स, कोलकाता में खेले जाने वाले रणजी ट्रॉफी फाइनल के लिए क्वालीफाई किया है।' 31 वर्षीय तेज गेंदबाज ने पिछले साल भारत के बांग्लादेश दौरे के दौरान टेस्ट में वापसी की और ऑस्ट्रेलिया के खिलाफ पहले दो टेस्ट मैचों के लिए टीम में चुने गए थे। बीसीसीआई ने टीम में उनादकट के लिए किसी और खिलाड़ी का नाम नहीं लिया है, जिसमें तेज आक्रमण में मोहम्मद शमी, मोहम्मद सिराज और उमेश यादव शामिल हैं। ऑस्ट्रेलिया के खिलाफ चार टेस्ट मैचों की सीरीज के पहले मैच में टीम इंडिया ने धमाकेदार जीत दर्ज करते हुए सीरीज में 1-0 की बढ़त बना ली है। मैच में ऑस्ट्रेलिया के कप्तान पैट कमिंस ने टॉस जीतकर पहले बल्लेबाजी किया और पूरी टीम 177 रन के स्कोर पर सिमट गई। इसके जवाब में भारत के लिए कप्तान रोहित शर्मा शतकीय पारी खेली। इसके बाद रविंद्र जडेजा और अक्षर पटेल ने भी अर्धशतक लगाए और टीम इंडिया ने 400 रन का स्कोर खड़ा कर 223 रनों की बढ़त हासिल की। इसके जवाब में जब ऑस्ट्रेलिया की टीम दूसरी पारी में बल्लेबाजी के लिए उतरी सिर्फ 91 रन के स्कोर ढेर हो गई और इस तरह भारत ने मैच को पारी और 132 रन से जीत लिया। वहीं सीरीज का दूसरा टेस्ट मैच अब दिल्ली के अरुण जेटली फिरोजशाह कोटला स्टेडियम में 17 से 21 फरवरी के बीच खेला जाएगा।","pubDate":"2023-02-12 17:56:58","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पाकिस्तान वर्ल्ड कप से हुआ बाहर! तीन दिन के अंदर हो जाएगी पुष्टि, पूर्व क्रिकेटर का चौंकाने वाला दावा","link":"https://hindi.news18.com/news/sports/cricket-pakistani-former-cricketer-danish-kaneria-has-made-a-shocking-claim-for-the-odi-world-cup-2023-5373003.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"इन दिनों वर्ल्ड कप 2023 को लेकर दो कट्टर प्रतिद्वंदियों के बीच तनातनी देखने को मिल रही है. भारत एशिया कप के लिए पाकिस्तान नहीं जाने की जिद में है तो पाकिस्तान वर्ल्ड कप में हिस्सा नहीं लेने की धमकी दे रहा है. इस बहस के बीच पूर्व पाकिस्तानी क्रिकेटर दानिश कननेरिया ने चौंकाने वाला खुलासा किया है.","content":"वनडे वर्ल्ड कप 2023 को लेकर पाकिस्तान से एक चौंकाने वाला दावा सामने आया है. (AFP) नई दिल्ली. भारत और पाकिस्तान, दो ऐसे देश जो क्रिकेट के मैदान से लेकर बॉर्डर तक कट्टर प्रतिद्वंदी माने जाते हैं. टी20 वर्ल्ड कप के बाद से दोनों देश की टीमें क्रिकेट के मैदान पर आमने-सामने नहीं आईं हैं. इसके बावजूद इनके बारे में लगातार चर्चा हो रही है. मुद्दा है वनडे वर्ल्ड कप (World Cup 2023) और एशिया कप (Asia Cup) जैसे टूर्नामेंट. इन टूर्नामेंट्स को लेकर बहस जगजाहिर हो चुकी है. लेकिन अब यह बहस एक नया मोड़ लेती दिखाई दे रही है. गौरतलब है कि इस साल एशिया कप की मेजबानी पाकिस्तान करेगा. जिसके लिए भारतीय क्रिकेट कंट्रोल बोर्ड ने टीम इंडिया को पाकिस्तान जाने के लिए साफ इनकार कर दिया था. चारो तरफ तरह-तरह की बातें हुईं. वहीं, पाकिस्तान का दावा है कि यदि भारत हमारे देश नहीं आएगा तो हम वनडे वर्ल्ड कप के लिए भारत की यात्रा नहीं करेंगे. हालांकि, आधिकारिक तौर पर इस बात पर अभी मुहर नहीं लगी है. इस बीच पाकिस्तान के पूर्व क्रिकेटर दानिश कनेरिया का चौंकाने वाला दावा किया है. पाकिस्तानी टीम वर्ल्ड कप के लिए भारत नहीं जाएगी- दानिश कनेरिया दानिश कनेरिया ने वर्ल्ड कप को लेकर अपने यूट्यूब चैनल पर कहा, ‘पाकिस्तानी क्रिकेट टीम आगामी वर्ल्ड कप के लिए भारत का दौरा नहीं करेगी. दो या तीन दिन में इस बात की पुष्टि हो जाएगी. यदि पाकिस्तान दुबई या कतर में एशिया कप की मेजबानी के लिए तैयार हो जाता है तो फिर ये काफी अच्छी बात होगी.’ 1 चौके से जेमिमा ने किए दो शिकार, पाकिस्तान का हुआ काम तमाम, वर्ल्ड कप रिकॉर्ड बुक में लिखवाया नाम मार्च में हो जाएगा फैसला एशिया कप वेन्यू को लेकर एशियन क्रिकेट काउंसिल की मीटिंग हो चुकी है. जिसमें पूरी तरह से निर्णय नहीं लिया जा सका है. एसीसी द्वारा इस फैसले को मार्च तक टाल दिया गया था. हालांकि, एशिया कप के वेन्यू को लेकर यूएई का नाम टॉप पर है. आधिकारिक तौर पर मार्च में इस मु्द्दे पर फैसला हो जाएगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , India Vs Pakistan , ODI World Cup , Team india 300 लड़कियों का तोड़ा दिल, 3 बार की शादी, मान्यता दत्त के साथ में मिला संजू बाबा को सुकून, देखें शादी की फोटोज पति की एक्स वाइफ पर सरेआम फेंका ग्लास, गुस्से में चिल्लाने लगीं रवीना टंडन, बहुत बड़ी थी लड़ाई की वजह PHOTOS: दुनिया देखेगी भारत का दम, कल से बेंगलुरु में शुरू होगा ‘एयरो इंडिया शो’, जानें क्या होगा खास","pubDate":"2023-02-12 17:55:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/Screenshot-2023-01-31-165339-16751643283x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranji Trophy 2022-23: Bengal sets up title clash with Saurashtra","link":"https://www.thehansindia.com/sports/cricket/ranji-trophy-2022-23-bengal-sets-up-title-clash-with-saurashtra-782525","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Finals to be held at Eden Gardens, Kolkata on Feb 16","content":"Indore: Left-arm spinner Pradipta Pramanik's brilliant fifer (5/51) led Bengal to the Ranji Trophy 2022-23 final with a massive 306-run win over defending champions Madhya Pradesh in the second semi-final at Holkar Cricket Stadium, here on Sunday. Chasing a mammoth target of 548, Madhya Pradesh could only score 241 in their second innings. With this, Bengal also avenged last season's semi-final loss to MP. They will now face Saurashtra in the summit clash on February 16 at the Eden Gardens, Kolkata. Since MP was chasing a big total, most of their batters looked to play with positive intent on the final day. However, in the process, they ended up losing wickets at regular intervals. Rajat Patidar was the top-scorer for the side with a 58-ball 52 while no other MP batter passed the 50-run mark. The likes of Yash Dubey and Anubhav Agarwal scored 30 each. On the other hand, Mukesh Kumar, Shahbaz Ahmed and Akash Deep provided support to Pramanik by chipping in with crucial wickets. Earlier, Anustup Majumdar and Sudip Gharami scored hundreds in the first innings to lay the foundation for Bengal's win. Akash then ripped through MP's batting order to bag a five-for as Bengal gained the crucial first innings lead of 268. In their second innings, Bengal scored 279, leaving MP with an improbable target to chase on the last day. In the first semifinal match, Arpit Vasavada, fter his brilliant double-century in the first innings, followed up his with a vital unbeaten 47 to guide Saurashtra to the Ranji Trophy 2022-23 final with a four-wicket win over Karnataka Vasavada's knock helped Saurashtra chase down the target of 115 in the 35th over. With spinner Krishnappa Gowtham running through Saurashtra's batting order by removing Sheldon Jackson, Vishvaraj Jadeja and Chirag Jani, Saurashtra were struggling at 42 for 5. But, Chetan Sakariya scored a crucial 47-ball 24 and also stitched a key partnership of 63 runs with Vasavada to almost seal the win for his team. Semifinals Brief scores: Karnataka 407 (Mayank Agarwal 249; Chetan Sakariya 3-73) and 234 (Nikin Jose 109, Mayank Agarwal 55; Chetan Sakariya 4-45) lost to Saurashtra 527 (Arpit Vasavada 202, Sheldon Jackson 160; Vidwath Kaverappa 5-82) and 117/6 (Arpit Vasavada 47 not out; V Koushik 3-32, K Gowtham 3-38) by four wickets. Bengal 438 (Anustup Majumdar 120, Sudip Gharami 112; Kumar Kartikeya 3/95) & 279 (Anustup Majumdar 80; Saransh Jain 6-103) beat Madhya Pradesh 170 (Saransh Jain 65; Akash Deep 5-42) & 241 (Rajat Patidar 52; Pradipta Pramanik 5-51) by 306 runs.","pubDate":"2023-02-12 17:54:52","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335549-ranji-trophy.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Third India-Australia Test to be moved out of Dharamsala","link":"https://www.thehansindia.com/sports/third-india-australia-test-to-be-moved-out-of-dharamsala-782522","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"The third Test of the ongoing Border-Gavaskar Trophy between India and Australia, originally scheduled to be held in Dharamsala from March 1, will be shifted to a new venue as the ground in the Himalayas is not ready to host the match","content":"New Delhi: The third Test of the ongoing Border-Gavaskar Trophy between India and Australia, originally scheduled to be held in Dharamsala from March 1, will be shifted to a new venue as the ground in the Himalayas is not ready to host the match. The BCCI is yet to finalise the new venue but Indore and Rajkot are the frontrunners to host the second Test. A final decision on the venue is expected to be taken soon, a ESPNcricinfo report said. The decision to move the game out of Dharamsala has been taken after an unfavourable report from the board's inspection panel. The panel visited the ground on February 11 and noted several bare patches on the outfield, which was re-laid recently by the Himachal Pradesh Cricket Association (HPCA) to install a new drainage system. Another obstacle was that no cricket had been played in Dharamsala since the two T20Is between India and Sri Lanka in February 2022. Notably, Dharamsala has hosted only one Test so far -- in 2017 when India beat Australia to clinch the series 2-1. India are up 1-0 in the Border-Gavaskar Trophy, after beating Australia by an innings and 132 runs inside three days in the first Test in Nagpur. The second Test will be played at the Arun Jaitley stadium in Delhi from February 17.","pubDate":"2023-02-12 17:51:37","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335546-dharamsala.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Women's T20 World Cup: India beat Pak by 7 wkts in campaign opener","link":"https://www.thehansindia.com/sports/cricket/womens-t20-world-cup-india-beat-pak-by-7-wkts-in-campaign-opener-782521","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Australia thrash New Zealand by 97 runs","content":"India's Shafali Verma plays a shot as Pakistan's Muneeba Ali Siddiqui looks on Cape Town (South Africa): India produced an impressive performance to beat arch-rivals Pakistan by seven wickets in their opening match of Women's T20 World Cup 2023 at Newlands Cricket Ground, here on Sunday. Riding on brilliant performances by Bismah Maroof (68 not out off 55) and Ayesha Naseem (43 not out off 25), Pakistan posted a competitive total of 149-4 in stipulated 20 overs. Chasing 150, Shafali Verma was partnered by Yastika Bhatia for India at the top with Smriti Mandhana out injured. The duo put on 38 for the opening wicket before Yastike was dismissed by Sadia Iqbal in the final over of the Powerplay. Verma and Jemimah Rodrigues rebuilt, but Pakistan struck in the 10th over when Sidra Amin pulled off a stunning catch close to the ropes to send back Verma. While Harmanpreet Kaur and Jemimah fought back for a bit, Nashra Sandhu sent back Kaur in the 14th over to give Pakistan a massive boost. But, Jemimah Rodrigues led India's fight in the run chase by smashing a fine unbeaten fifty (53 not out off 38) and along with Richa Ghosh (31 not out off 20), took India over the victory line in 19 overs with seven wickets in hand. Earlier, Pakistan, who won the toss and opted to bat first, lost opener Javeria Khan to Deepti Sharma in the second over. Bismah Maroof and Muneeba Ali took the attack to Deepti to help Pakistan to 39/1 at the end of the Powerplay, their highest against India in the first six overs in women's T20Is. However, Radha Yadav struck soon after with the wicket of Muneeba and Pooja Vastrakar sent back Nida Dar for a duck to put India back on top. The in-form Sidra Amin joined Maroof in the middle and the duo put on 25 for the fourth wicket before a freak dismissal saw Amin dismissed by Radha. Ayesha Naseem's entry added impetus to Pakistan's innings as she raced off the blocks with some lusty blows. Maroof held one end up as Ayesha charged from the other to lift Pakistan past the 100-run mark in the 16th over. Maroof completed her fifty soon after as the duo put on a partnership that pushed India onto the back foot. The unbeaten 81-run stand helped Pakistan to 149/4 at the end of 20 overs. The last five overs yielded 58 runs as Pakistan gave India a stiff target. In another match, Alyssa Healy smashed 55 on her return from injury while Ashleigh Gardner picked a five-wicket haul as Australia thrashed New Zealand by 97 runs to kickstart their defence of the Women's T20 World Cup on a high. Alyssa's 55, her highest score in the format since the 2020 Women's T20 World Cup Final helped Australia post an imposing 173/9 in their 20 overs. In reply, New Zealand lost Suzie Bates on the very first ball and were bundled out for just 76 in 14 overs. Brief scores Pakistan Women 149-4 in 20 Overs (Bismah Maroof 68 not out, Ayesha Naseem 43 not out; Radha Yadav 2/21) lost to India Women 151-3 in 19 Overs (Jemimah Rodrigues 53 not out, Richa Ghosh 31 not out; Nashra Sandhu 2/15) by 7 wickets. Australia 173/9 in 20 overs (Alyssa Healy 55, Ellyse Perry 40; Amelia Kerr 3/23, Lea Tahuhu 3/37) beat New Zealand 76 all out in 14 overs (Amelia Kerr 21, Bernadine Bezuidenhout 14; Ashleigh Gardner 5/12, Megan Schutt 2/8) by 97 runs.","pubDate":"2023-02-12 17:49:47","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335543-shafali-verma.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | 'Nobody gave us a chance,' says riveting Roelof after Sunrisers 'Moneyball' to SA20 victory","link":"https://www.news24.com/sport/Cricket/SA20/nobody-gave-us-a-chance-says-riveting-roelof-after-sunrisers-moneyball-to-sa20-victory-20230212","keywords":null,"creator":null,"video_url":null,"description":"The 38-year-old is credited with instigating the turnaround in Sunrisers Eastern Cape's victorious campaign after a poor start with skipper Aiden Markram stating he was a \"leading character\".","content":"Even at 38, the \"Bulldog\" still has a very serious bite. Roelof van der Merwe - mere months after breaking Proteas hearts at the ICC T20 World Cup with the stunning catch that saw the Netherlands knock them out - is back endearing himself to the South African cricketing public with his infectious enthusiasm and skill, headlined by a Man of the Match performance in the historic SA20 final here on Sunday. The wily left-arm tweaker produced a superb spell of 4/31 as Sunrisers Eastern Cape flouted expectations with a four-wicket victory over Pretoria Capitals, the cherry on top to finishing joint leading wicket-taker (20) with Anrich Nortje. Yet, as much as Van der Merwe - who represented the Proteas before switching allegiance to the Netherlands - delivered a defining contribution when the stakes were at their highest, it was the turnaround he instigated in the early part of his franchise's campaign that stands out. After losing their opening two encounters, Sunrisers' fortunes changed once he was picked. Not that he'll take any credit for that. READ | Sunrisers' pair of bulldogs tear off Capitals' hopes to claim momentous SA20 title \"Even if I didn't play a game, we probably still would've won it. I don't know. I don't know what to tell you,\" said Van der Merwe. \"We're sitting here with a trophy and I'm still trying to figure out how we really won it. Nobody gave us a chance when the tournament started, that's a fact. But we gelled well and almost 'Moneyballed' our way to success. \"In the end, we knew exactly what all of us were going to do and we got on with it. Happy days.\" For his skipper, Aiden Markram, his share in the team's triumph was stark. \"He played a huge role in the turnaround of our season. I've said it before, after we lost out first two games, we needed characters to be out there on the park and lead the fight,\" said the Proteas star, whose own profitable performances in the tournament saw him being named the Most Valuable Player. \"There's no better man than Roelof to lead it. He rubs off on everyone else. It bestows a massive role on him because everyone wants to follow him. \"You can also speak about his skillset, which is still incredible. But the biggest thing for us was to have passion and inspiration to win. And that's what Roelof brought.\" Van der Merwe's game-changing abilities were on full show in front of a full house, striking with his first delivery to calm the nerves of a Sunrisers attack that seemingly tried too hard to exploit a good toss to win and a favourable surface. \"The ball pinged off the bat in the first few overs and suddenly you're wondering if you made the right call at the toss,\" said Markram. \"It was probably just because we were a bit off with the new ball. But Roelof struck and he paused the game for that period. He bowled a couple of good overs and it led to wickets. He started it off for us.\" It's likely that Van der Merwe will grace local shores soon again when the Netherlands come to finish a postponed ODI series against the Proteas in late March, a skirmish that will determine South Africa's hope of qualifying automatically for the 50-over World Cup later this year. And he's not planning on relenting on his approach and output. \"I love coming back here, I was here back in 2019. I just love playing in South Africa and it's very satisfying to be able to contribute towards winning a trophy. We're here to win them after all. \"Even at my age, I still have something left in the tank. I'm glad I could put it to good use,\" said Van der Merwe. \"I just love competing, whatever I'm doing. I love to be a competitor. As long as that desire remains in place, I'll keeping coming back. That's the main thing.\"","pubDate":"2023-02-12 17:45:36","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"International League 2023 Most Runs and Most Wickets standings: Alex Hales and Chris Jordan top ILT20 charts - Updated after Final","link":"https://www.sportskeeda.com/cricket/news-international-league-2023-most-runs-most-wickets-standings-alex-hales-chris-jordan-top-ilt20-charts-updated-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"The Gulf Giants became the champions of the inaugural edition of ILT20 2023. On Sunday, February 12, James Vince and Co. defeated Desert Vipers by seven wickets in the final at the Dubai International Cricket Stadium. After being put in to bat first, the Vipers got themselves up to 146 for the loss of eight wickets. Wanindu Hasaranga scored 55 off 27 and helped his team post a respectable score. But his efforts went in vain as the Vipers chased the target down with eight balls to spare. Chris Lynn stayed unbeaten on 72 off 50 balls with nine fours and one six. Shimron Hetmyer stayed unbeaten on 25 off 13 balls with five fours. Alex Hales of the Desert Vipers finished the tournament as the leading run-scorer. In 12 matches, the right-handed batter scored 469 runs at an average of 46.90 and a strike-rate of 151.77 with four half-centuries and a century to his name. James Vince of the Gulf Giants finished second on the list, having scored 439 runs from 11 matches at an average of 48.77 with four half-centuries to show for his efforts. Hales and Vince were the only batters who managed to cross the 400-run mark in the tournament. Kieron Pollard finished six runs short of that mark. Chris Jordan of the Gulf Giants finished the championship as the top wicket-taker. The England fast bowler picked up 20 wickets from 10 matches at an economy rate of 7.39. Jordan’s teammate David Wiese accounted for 18 scalps from 11 matches at a better economy rate of seven. Wanindu Hasaranga of Desert Vipers was also pretty impressive after the leg-spin bowler finished with 15 wickets from nine matches at an economy rate of 7.18. Dwayne Bravo, Sheldon Cottrell and Fazalhaq Farooqi picked up 13, 12 and 12 wickets respectively. Get IND-W vs PAK-W Live Score from Womens T20 World Cup 2023. Follow Sportskeeda for latest updates. Poll : 0 votes Quick Links","pubDate":"2023-02-12 22:47:20","image_url":"https://static.sportskeeda.com/editor/2023/02/dd48f-16762252770863-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Star spotted rocking short skirt and heels","link":"https://www.cairnspost.com.au/sport/john-cena-spotted-rocking-short-skirt-thighhighs-and-heels-in-melbourne/news-story/bb3b3f4ff0d38b0109f5bf600cae982e","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"John Cena has a brand new look that has fans raising their eyebrows.","content":"Sport Don't miss out on the headlines from Sport. Followed categories will be added to My News. John Cena has a brand new look that has fans raising their eyebrows. The former WWE star, 45, was spotted in Melbourne recently filming his upcoming flick Ricky Stanicky — and rocking some traditionally feminine-looking garments. Cena sported a black T-shirt; a short, black-and-white plaid skirt; thigh-high stockings, and lace-up black leather heels. Ricky Stanicky is a comedy, directed by Peter Farrelly, that follows three friends who play a prank by burning down a house. The teens then create a fake character on whom to blame for their actions. Over the next two decades, the trio used the lie to get out of sticky situations — until one day they have to hire an actor to portray Stanicky. Cena rocked a plaid skirt, heels, and stockings as part of his outfit. Picture: BackGrid The Peacemaker actor was spotted walking around the set. Picture: BackGrid Zac Efron and William H. Macy help round out the cast. A release date has yet to be set. Cena tweeted his enthusiasm about the flick on Feb. 1. “Beyond excited to help bring these characters to life (both on- and off-screen) with an incredible cast, our director and producers and partners at @AmazonStudios @primevideo,” the Peacemaker star wrote. American actor John Cena filming at Avalon Airport. Picture: Mark Wilson “#RickyStanicky is a best friend to all — can’t wait for you to meet him!” he gushed. The Suicide Squad actor opened up to British GQ last year about switching up careers from wrestling to acting. “The term Hollywood has such a mystique and lustre around it. If you’re skilled at doing one thing, and then you transition into doing another — really, it sounds the same, but it’s a completely different thing,” he said. Cena on a previous trip to Australia with WWE. John Cena. Picture: Mark Stewart “If you have any chance of success, you have to really, really prepare as much as you can.” For the Massachusetts native, his drive comes from “just trying to work as hard as I can to catch up to everybody else,” he said. More Coverage Megan’s ‘savage’ public move against MGK MAFS grooms’ pre-wedding sex aired “If you feel you don’t have a head start, you’ve just got to put rubber to the road and work your ass off,” Cena added. “So that’s kind of where I’m at, dipping my toes back into the screen side of entertainment rather than live events.” This article was originally published by the New York Post and reproduced with permission Originally published as John Cena spotted rocking short skirt, thigh-highs and heels in Melbourne Join the conversation Add your comment to this story To join the conversation, please log in. Don't have an account? Register Join the conversation, you are commenting as Logout More related stories NFL Billionaire heiress declares ‘I’m single’ Gracie Hunt — the daughter of a billionaire NFL owner — is single and “looking for that number one draft pick” at the Super Bowl. Read more Cricket ‘Dark days’: Fallout from Australia Day stance Ash Gardner bowled Australia to victory in the opening T20 World Cup match and then opened up on a tumultuous time. Read more","pubDate":"2023-02-12 20:14:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"Chris Lynn powers Gulf Giants to inaugural ILT20 title","link":"https://www.indiatoday.in/sports/cricket/story/chris-lynns-heroic-knock-guides-gulf-giants-to-inaugural-ilt20-title-2333885-2023-02-13?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chris Lynn powers Gulf Giants to inaugural ILT20 title","content":": Australia batter Chris Lynn scored an unbeaten half-century to guide Gulf Giants to the inaugural International League T20 title at the Dubai International Stadium. Gulf Giants defeated Desert Vipers by 7 wickets in the final. James Vince won the toss for the Gulf Giants and opted to field first. Desert Vipers got off to the poor start with star-opener Alex Hales being dismissed by Carlos Brathwaite in the second over. Opener Rohan Mustafa also could not hold onto his wicket for long, and was run out in the same over to leave the Vipers reeling at 13/2. Adam Lyth could not move the scoreboard much as Colin de Grandhomme sent him back to the pavilion in the fifth over. Chris Jordan provided the Giants with an important breakthrough, dismissing Vipers captain Colin Munroe for just 6 runs. Wicket-keeping batter Sam Billings, along with Sri Lanka all-rounder Wanindu Hasaranga got the Vipers back in the game with a 72-run partnership. However, Billings couldn’t hold on to his wicket for long and was dismissed by Braithwaite after scoring 31 runs off 29 balls. Hasaranga completed a quick-fire half-century before Qais Ahmad sent him packing. Hasaranga was the top-scorer for the Vipers, amassing 55 runs in 27 deliveries. Ahmed then dismissed Luke Wood, before Braithwaite cleaned up England’s Tom Curran as Desert Vipers ended their innings with 146/8 after 20 overs. In the second innings, Luke Wood dismissed Vince in the fourth over, before Curran cleaned up Colin de Grandhomme to peg the Giants back. However, Chris Lynn had other plans in mind. The right-hander formed an important 73-run partnership with wicket-keeping batter Gerhard Erasmus. Lynn went on to complete his half-century as he, alongside West Indian batter Shimron Hetmyer, to guide the Giants to a 7 wicket win with 8 balls remaining. Lynn top-scored for the Giants, scoring 72 runs off 50 balls, while hitting nine boundaries and a six. Meanwhile, Hetmyer scored 25 runs off 13 balls as the Giants lifted the inaugural ILT20 trophy.","pubDate":"2023-02-12 18:33:50","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Third Test set to be moved - and why it’s a blow for Australia","link":"https://www.smh.com.au/sport/cricket/third-test-set-to-be-moved-and-why-it-s-a-blow-for-australia-20230213-p5cjy0.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"In a fresh blow to Australia’s chances of success in India, the third Test is poised to be moved from Dharamsala, which Steve Smith regarded as the best pitch from the 2017 series.","content":"Australia’s faltering campaign in India has taken another turn for the worse with the third Test poised to be moved from the venue expected to best suit fast bowling. There are multiple reports in Indian media that the match will be relocated from the picturesque Himachal Pradesh Cricket Association Stadium in Dharamsala due to concerns over the state of the outfield. The venue, with the snow-capped Himalayas in the background, was scheduled to stage the third Test, from March 1-5. There were also dramas over the schedule in the last series between the two countries in Australia in 2020/21 when India threatened to boycott the Gabba Test over concerns about Queensland’s COVID-19 quarantine restrictions. Australian captain Pat Cummins removes the cover to inspect the pitch ahead of the first cricket in Nagpur, India. Credit: The decision was reportedly made on Sunday after an inspection of the ground by a team of BCCI officials. There are several bare patches on the playing surface, relaid last year to fit in a new drainage system. As reported by The Sydney Morning Herald and The Age over the weekend , a source familiar with the issue said foggy conditions in the town, located at an altitude of 1451 metres, meant there had been insufficient sunlight for grass to grow. While skipper Pat Cummins has told his team “embracing the chaos” was part of what made tours to India so special, there seems to be a new twist every day in this campaign. On Sunday, Australia’s plans to conduct centre-wicket practice on a fourth-day Test pitch at the VCA Stadium were scuppered because ground staff had watered the pitch and the training nets, despite having granted them permission to use them. The session was cancelled. The cold weather in Dharamsala, where temperatures often dip into single figures at this time of year, would have made it difficult for curators to prepare a dry spin-friendly pitch to suit India’s strengths. Pace played a significant part when Australia played there in 2017 at the venue’s only Test when India speedster Umesh Yadav produced a burst with the new ball to run through the visitors’ top order. In his 2017 autobiography The Journey , then captain Steve Smith wrote that the pitch had pace and bounce and was the “best pitch of the lot”. Australia’s quest to regain the Border-Gavaskar Trophy started in disastrous fashion with an innings defeat in Nagpur. Only three Australian sides have come from 1-0 down in the past 100 years to win a series. Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-12 18:19:16","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jaydev Unadkat: ऑस्ट्रेलिया पर धमाकेदार जीत के बाद टीम इंडिया में हुआ बड़ा बदलाव, टीम से बाहर हुआ यह स्टार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jaydev-unadkat-play-ranji-trophy-final-released-from-the-india-squad/articleshow/97846117.cms","keywords":null,"creator":null,"video_url":null,"description":"Jaydev Unadkat: भारतीय क्रिकेट टीम ने तेज गेंदबाज जयदेव उनादकट को ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज से रिलीज कर दिया है। जयदेव अब सौराष्ट्र के लिए रणजी ट्रॉफी का फाइनल मैच खेलेंगे। इससे पहले उन्हें टीम इंडिया के टेस्ट स्क्वाड में शामिल किया गया था।","content":"ऑस्ट्रेलिया के खिलाफ जारी चार टेस्ट मैचों की सीरीज से तेज गेंदबाज जयदेव उनादकट को रिलीज कर दिया गया है। उनादकट रणजी ट्रॉफी 2022-23 फाइनल के लिए सौराष्ट्र टीम से खेलेंगे। बीसीसीआई की मीडिया विज्ञप्ति के अनुसार, चयन समिति ने भारतीय टीम मैनेजमेंट के परामर्श से उनादकट को रिलीज करने का निर्णय लिया। मीडिया विज्ञप्ति में कहा गया कि,'अखिल भारतीय सीनियर चयन समिति ने भारतीय टीम प्रबंधन के परामर्श से बॉर्डर-गावस्कर ट्रॉफी के लिए भारत के ऑस्ट्रेलिया दौरे के दूसरे टेस्ट के लिए जयदेव उनादकट को भारत की टीम से रिलीज करने का फैसला किया है।' विज्ञप्ति में कहा गया कि, 'उनादकट अब सौराष्ट्र की टीम में शामिल होंगे, जिसने बंगाल के खिलाफ 16 फरवरी से ईडन गार्डन्स, कोलकाता में खेले जाने वाले रणजी ट्रॉफी फाइनल के लिए क्वालीफाई किया है।' 31 वर्षीय तेज गेंदबाज ने पिछले साल भारत के बांग्लादेश दौरे के दौरान टेस्ट में वापसी की और ऑस्ट्रेलिया के खिलाफ पहले दो टेस्ट मैचों के लिए टीम में चुने गए थे। बीसीसीआई ने टीम में उनादकट के लिए किसी और खिलाड़ी का नाम नहीं लिया है, जिसमें तेज आक्रमण में मोहम्मद शमी, मोहम्मद सिराज और उमेश यादव शामिल हैं। ऑस्ट्रेलिया के खिलाफ चार टेस्ट मैचों की सीरीज के पहले मैच में टीम इंडिया ने धमाकेदार जीत दर्ज करते हुए सीरीज में 1-0 की बढ़त बना ली है। मैच में ऑस्ट्रेलिया के कप्तान पैट कमिंस ने टॉस जीतकर पहले बल्लेबाजी किया और पूरी टीम 177 रन के स्कोर पर सिमट गई। इसके जवाब में भारत के लिए कप्तान रोहित शर्मा शतकीय पारी खेली। इसके बाद रविंद्र जडेजा और अक्षर पटेल ने भी अर्धशतक लगाए और टीम इंडिया ने 400 रन का स्कोर खड़ा कर 223 रनों की बढ़त हासिल की। इसके जवाब में जब ऑस्ट्रेलिया की टीम दूसरी पारी में बल्लेबाजी के लिए उतरी सिर्फ 91 रन के स्कोर ढेर हो गई और इस तरह भारत ने मैच को पारी और 132 रन से जीत लिया। वहीं सीरीज का दूसरा टेस्ट मैच अब दिल्ली के अरुण जेटली फिरोजशाह कोटला स्टेडियम में 17 से 21 फरवरी के बीच खेला जाएगा।","pubDate":"2023-02-12 17:56:58","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पाकिस्तान वर्ल्ड कप से हुआ बाहर! तीन दिन के अंदर हो जाएगी पुष्टि, पूर्व क्रिकेटर का चौंकाने वाला दावा","link":"https://hindi.news18.com/news/sports/cricket-pakistani-former-cricketer-danish-kaneria-has-made-a-shocking-claim-for-the-odi-world-cup-2023-5373003.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"इन दिनों वर्ल्ड कप 2023 को लेकर दो कट्टर प्रतिद्वंदियों के बीच तनातनी देखने को मिल रही है. भारत एशिया कप के लिए पाकिस्तान नहीं जाने की जिद में है तो पाकिस्तान वर्ल्ड कप में हिस्सा नहीं लेने की धमकी दे रहा है. इस बहस के बीच पूर्व पाकिस्तानी क्रिकेटर दानिश कननेरिया ने चौंकाने वाला खुलासा किया है.","content":"वनडे वर्ल्ड कप 2023 को लेकर पाकिस्तान से एक चौंकाने वाला दावा सामने आया है. (AFP) नई दिल्ली. भारत और पाकिस्तान, दो ऐसे देश जो क्रिकेट के मैदान से लेकर बॉर्डर तक कट्टर प्रतिद्वंदी माने जाते हैं. टी20 वर्ल्ड कप के बाद से दोनों देश की टीमें क्रिकेट के मैदान पर आमने-सामने नहीं आईं हैं. इसके बावजूद इनके बारे में लगातार चर्चा हो रही है. मुद्दा है वनडे वर्ल्ड कप (World Cup 2023) और एशिया कप (Asia Cup) जैसे टूर्नामेंट. इन टूर्नामेंट्स को लेकर बहस जगजाहिर हो चुकी है. लेकिन अब यह बहस एक नया मोड़ लेती दिखाई दे रही है. गौरतलब है कि इस साल एशिया कप की मेजबानी पाकिस्तान करेगा. जिसके लिए भारतीय क्रिकेट कंट्रोल बोर्ड ने टीम इंडिया को पाकिस्तान जाने के लिए साफ इनकार कर दिया था. चारो तरफ तरह-तरह की बातें हुईं. वहीं, पाकिस्तान का दावा है कि यदि भारत हमारे देश नहीं आएगा तो हम वनडे वर्ल्ड कप के लिए भारत की यात्रा नहीं करेंगे. हालांकि, आधिकारिक तौर पर इस बात पर अभी मुहर नहीं लगी है. इस बीच पाकिस्तान के पूर्व क्रिकेटर दानिश कनेरिया का चौंकाने वाला दावा किया है. पाकिस्तानी टीम वर्ल्ड कप के लिए भारत नहीं जाएगी- दानिश कनेरिया दानिश कनेरिया ने वर्ल्ड कप को लेकर अपने यूट्यूब चैनल पर कहा, ‘पाकिस्तानी क्रिकेट टीम आगामी वर्ल्ड कप के लिए भारत का दौरा नहीं करेगी. दो या तीन दिन में इस बात की पुष्टि हो जाएगी. यदि पाकिस्तान दुबई या कतर में एशिया कप की मेजबानी के लिए तैयार हो जाता है तो फिर ये काफी अच्छी बात होगी.’ 1 चौके से जेमिमा ने किए दो शिकार, पाकिस्तान का हुआ काम तमाम, वर्ल्ड कप रिकॉर्ड बुक में लिखवाया नाम मार्च में हो जाएगा फैसला एशिया कप वेन्यू को लेकर एशियन क्रिकेट काउंसिल की मीटिंग हो चुकी है. जिसमें पूरी तरह से निर्णय नहीं लिया जा सका है. एसीसी द्वारा इस फैसले को मार्च तक टाल दिया गया था. हालांकि, एशिया कप के वेन्यू को लेकर यूएई का नाम टॉप पर है. आधिकारिक तौर पर मार्च में इस मु्द्दे पर फैसला हो जाएगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , India Vs Pakistan , ODI World Cup , Team india 300 लड़कियों का तोड़ा दिल, 3 बार की शादी, मान्यता दत्त के साथ में मिला संजू बाबा को सुकून, देखें शादी की फोटोज पति की एक्स वाइफ पर सरेआम फेंका ग्लास, गुस्से में चिल्लाने लगीं रवीना टंडन, बहुत बड़ी थी लड़ाई की वजह PHOTOS: दुनिया देखेगी भारत का दम, कल से बेंगलुरु में शुरू होगा ‘एयरो इंडिया शो’, जानें क्या होगा खास","pubDate":"2023-02-12 17:55:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/Screenshot-2023-01-31-165339-16751643283x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranji Trophy 2022-23: Bengal sets up title clash with Saurashtra","link":"https://www.thehansindia.com/sports/cricket/ranji-trophy-2022-23-bengal-sets-up-title-clash-with-saurashtra-782525","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Finals to be held at Eden Gardens, Kolkata on Feb 16","content":"Indore: Left-arm spinner Pradipta Pramanik's brilliant fifer (5/51) led Bengal to the Ranji Trophy 2022-23 final with a massive 306-run win over defending champions Madhya Pradesh in the second semi-final at Holkar Cricket Stadium, here on Sunday. Chasing a mammoth target of 548, Madhya Pradesh could only score 241 in their second innings. With this, Bengal also avenged last season's semi-final loss to MP. They will now face Saurashtra in the summit clash on February 16 at the Eden Gardens, Kolkata. Since MP was chasing a big total, most of their batters looked to play with positive intent on the final day. However, in the process, they ended up losing wickets at regular intervals. Rajat Patidar was the top-scorer for the side with a 58-ball 52 while no other MP batter passed the 50-run mark. The likes of Yash Dubey and Anubhav Agarwal scored 30 each. On the other hand, Mukesh Kumar, Shahbaz Ahmed and Akash Deep provided support to Pramanik by chipping in with crucial wickets. Earlier, Anustup Majumdar and Sudip Gharami scored hundreds in the first innings to lay the foundation for Bengal's win. Akash then ripped through MP's batting order to bag a five-for as Bengal gained the crucial first innings lead of 268. In their second innings, Bengal scored 279, leaving MP with an improbable target to chase on the last day. In the first semifinal match, Arpit Vasavada, fter his brilliant double-century in the first innings, followed up his with a vital unbeaten 47 to guide Saurashtra to the Ranji Trophy 2022-23 final with a four-wicket win over Karnataka Vasavada's knock helped Saurashtra chase down the target of 115 in the 35th over. With spinner Krishnappa Gowtham running through Saurashtra's batting order by removing Sheldon Jackson, Vishvaraj Jadeja and Chirag Jani, Saurashtra were struggling at 42 for 5. But, Chetan Sakariya scored a crucial 47-ball 24 and also stitched a key partnership of 63 runs with Vasavada to almost seal the win for his team. Semifinals Brief scores: Karnataka 407 (Mayank Agarwal 249; Chetan Sakariya 3-73) and 234 (Nikin Jose 109, Mayank Agarwal 55; Chetan Sakariya 4-45) lost to Saurashtra 527 (Arpit Vasavada 202, Sheldon Jackson 160; Vidwath Kaverappa 5-82) and 117/6 (Arpit Vasavada 47 not out; V Koushik 3-32, K Gowtham 3-38) by four wickets. Bengal 438 (Anustup Majumdar 120, Sudip Gharami 112; Kumar Kartikeya 3/95) & 279 (Anustup Majumdar 80; Saransh Jain 6-103) beat Madhya Pradesh 170 (Saransh Jain 65; Akash Deep 5-42) & 241 (Rajat Patidar 52; Pradipta Pramanik 5-51) by 306 runs.","pubDate":"2023-02-12 17:54:52","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335549-ranji-trophy.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Third India-Australia Test to be moved out of Dharamsala","link":"https://www.thehansindia.com/sports/third-india-australia-test-to-be-moved-out-of-dharamsala-782522","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"The third Test of the ongoing Border-Gavaskar Trophy between India and Australia, originally scheduled to be held in Dharamsala from March 1, will be shifted to a new venue as the ground in the Himalayas is not ready to host the match","content":"New Delhi: The third Test of the ongoing Border-Gavaskar Trophy between India and Australia, originally scheduled to be held in Dharamsala from March 1, will be shifted to a new venue as the ground in the Himalayas is not ready to host the match. The BCCI is yet to finalise the new venue but Indore and Rajkot are the frontrunners to host the second Test. A final decision on the venue is expected to be taken soon, a ESPNcricinfo report said. The decision to move the game out of Dharamsala has been taken after an unfavourable report from the board's inspection panel. The panel visited the ground on February 11 and noted several bare patches on the outfield, which was re-laid recently by the Himachal Pradesh Cricket Association (HPCA) to install a new drainage system. Another obstacle was that no cricket had been played in Dharamsala since the two T20Is between India and Sri Lanka in February 2022. Notably, Dharamsala has hosted only one Test so far -- in 2017 when India beat Australia to clinch the series 2-1. India are up 1-0 in the Border-Gavaskar Trophy, after beating Australia by an innings and 132 runs inside three days in the first Test in Nagpur. The second Test will be played at the Arun Jaitley stadium in Delhi from February 17.","pubDate":"2023-02-12 17:51:37","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335546-dharamsala.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Women's T20 World Cup: India beat Pak by 7 wkts in campaign opener","link":"https://www.thehansindia.com/sports/cricket/womens-t20-world-cup-india-beat-pak-by-7-wkts-in-campaign-opener-782521","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Australia thrash New Zealand by 97 runs","content":"India's Shafali Verma plays a shot as Pakistan's Muneeba Ali Siddiqui looks on Cape Town (South Africa): India produced an impressive performance to beat arch-rivals Pakistan by seven wickets in their opening match of Women's T20 World Cup 2023 at Newlands Cricket Ground, here on Sunday. Riding on brilliant performances by Bismah Maroof (68 not out off 55) and Ayesha Naseem (43 not out off 25), Pakistan posted a competitive total of 149-4 in stipulated 20 overs. Chasing 150, Shafali Verma was partnered by Yastika Bhatia for India at the top with Smriti Mandhana out injured. The duo put on 38 for the opening wicket before Yastike was dismissed by Sadia Iqbal in the final over of the Powerplay. Verma and Jemimah Rodrigues rebuilt, but Pakistan struck in the 10th over when Sidra Amin pulled off a stunning catch close to the ropes to send back Verma. While Harmanpreet Kaur and Jemimah fought back for a bit, Nashra Sandhu sent back Kaur in the 14th over to give Pakistan a massive boost. But, Jemimah Rodrigues led India's fight in the run chase by smashing a fine unbeaten fifty (53 not out off 38) and along with Richa Ghosh (31 not out off 20), took India over the victory line in 19 overs with seven wickets in hand. Earlier, Pakistan, who won the toss and opted to bat first, lost opener Javeria Khan to Deepti Sharma in the second over. Bismah Maroof and Muneeba Ali took the attack to Deepti to help Pakistan to 39/1 at the end of the Powerplay, their highest against India in the first six overs in women's T20Is. However, Radha Yadav struck soon after with the wicket of Muneeba and Pooja Vastrakar sent back Nida Dar for a duck to put India back on top. The in-form Sidra Amin joined Maroof in the middle and the duo put on 25 for the fourth wicket before a freak dismissal saw Amin dismissed by Radha. Ayesha Naseem's entry added impetus to Pakistan's innings as she raced off the blocks with some lusty blows. Maroof held one end up as Ayesha charged from the other to lift Pakistan past the 100-run mark in the 16th over. Maroof completed her fifty soon after as the duo put on a partnership that pushed India onto the back foot. The unbeaten 81-run stand helped Pakistan to 149/4 at the end of 20 overs. The last five overs yielded 58 runs as Pakistan gave India a stiff target. In another match, Alyssa Healy smashed 55 on her return from injury while Ashleigh Gardner picked a five-wicket haul as Australia thrashed New Zealand by 97 runs to kickstart their defence of the Women's T20 World Cup on a high. Alyssa's 55, her highest score in the format since the 2020 Women's T20 World Cup Final helped Australia post an imposing 173/9 in their 20 overs. In reply, New Zealand lost Suzie Bates on the very first ball and were bundled out for just 76 in 14 overs. Brief scores Pakistan Women 149-4 in 20 Overs (Bismah Maroof 68 not out, Ayesha Naseem 43 not out; Radha Yadav 2/21) lost to India Women 151-3 in 19 Overs (Jemimah Rodrigues 53 not out, Richa Ghosh 31 not out; Nashra Sandhu 2/15) by 7 wickets. Australia 173/9 in 20 overs (Alyssa Healy 55, Ellyse Perry 40; Amelia Kerr 3/23, Lea Tahuhu 3/37) beat New Zealand 76 all out in 14 overs (Amelia Kerr 21, Bernadine Bezuidenhout 14; Ashleigh Gardner 5/12, Megan Schutt 2/8) by 97 runs.","pubDate":"2023-02-12 17:49:47","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335543-shafali-verma.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | 'Nobody gave us a chance,' says riveting Roelof after Sunrisers 'Moneyball' to SA20 victory","link":"https://www.news24.com/sport/Cricket/SA20/nobody-gave-us-a-chance-says-riveting-roelof-after-sunrisers-moneyball-to-sa20-victory-20230212","keywords":null,"creator":null,"video_url":null,"description":"The 38-year-old is credited with instigating the turnaround in Sunrisers Eastern Cape's victorious campaign after a poor start with skipper Aiden Markram stating he was a \"leading character\".","content":"Even at 38, the \"Bulldog\" still has a very serious bite. Roelof van der Merwe - mere months after breaking Proteas hearts at the ICC T20 World Cup with the stunning catch that saw the Netherlands knock them out - is back endearing himself to the South African cricketing public with his infectious enthusiasm and skill, headlined by a Man of the Match performance in the historic SA20 final here on Sunday. The wily left-arm tweaker produced a superb spell of 4/31 as Sunrisers Eastern Cape flouted expectations with a four-wicket victory over Pretoria Capitals, the cherry on top to finishing joint leading wicket-taker (20) with Anrich Nortje. Yet, as much as Van der Merwe - who represented the Proteas before switching allegiance to the Netherlands - delivered a defining contribution when the stakes were at their highest, it was the turnaround he instigated in the early part of his franchise's campaign that stands out. After losing their opening two encounters, Sunrisers' fortunes changed once he was picked. Not that he'll take any credit for that. READ | Sunrisers' pair of bulldogs tear off Capitals' hopes to claim momentous SA20 title \"Even if I didn't play a game, we probably still would've won it. I don't know. I don't know what to tell you,\" said Van der Merwe. \"We're sitting here with a trophy and I'm still trying to figure out how we really won it. Nobody gave us a chance when the tournament started, that's a fact. But we gelled well and almost 'Moneyballed' our way to success. \"In the end, we knew exactly what all of us were going to do and we got on with it. Happy days.\" For his skipper, Aiden Markram, his share in the team's triumph was stark. \"He played a huge role in the turnaround of our season. I've said it before, after we lost out first two games, we needed characters to be out there on the park and lead the fight,\" said the Proteas star, whose own profitable performances in the tournament saw him being named the Most Valuable Player. \"There's no better man than Roelof to lead it. He rubs off on everyone else. It bestows a massive role on him because everyone wants to follow him. \"You can also speak about his skillset, which is still incredible. But the biggest thing for us was to have passion and inspiration to win. And that's what Roelof brought.\" Van der Merwe's game-changing abilities were on full show in front of a full house, striking with his first delivery to calm the nerves of a Sunrisers attack that seemingly tried too hard to exploit a good toss to win and a favourable surface. \"The ball pinged off the bat in the first few overs and suddenly you're wondering if you made the right call at the toss,\" said Markram. \"It was probably just because we were a bit off with the new ball. But Roelof struck and he paused the game for that period. He bowled a couple of good overs and it led to wickets. He started it off for us.\" It's likely that Van der Merwe will grace local shores soon again when the Netherlands come to finish a postponed ODI series against the Proteas in late March, a skirmish that will determine South Africa's hope of qualifying automatically for the 50-over World Cup later this year. And he's not planning on relenting on his approach and output. \"I love coming back here, I was here back in 2019. I just love playing in South Africa and it's very satisfying to be able to contribute towards winning a trophy. We're here to win them after all. \"Even at my age, I still have something left in the tank. I'm glad I could put it to good use,\" said Van der Merwe. \"I just love competing, whatever I'm doing. I love to be a competitor. As long as that desire remains in place, I'll keeping coming back. That's the main thing.\"","pubDate":"2023-02-12 17:45:36","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"International League 2023 Most Runs and Most Wickets standings: Alex Hales and Chris Jordan top ILT20 charts - Updated after Final","link":"https://www.sportskeeda.com/cricket/news-international-league-2023-most-runs-most-wickets-standings-alex-hales-chris-jordan-top-ilt20-charts-updated-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"The Gulf Giants became the champions of the inaugural edition of ILT20 2023. On Sunday, February 12, James Vince and Co. defeated Desert Vipers by seven wickets in the final at the Dubai International Cricket Stadium. After being put in to bat first, the Vipers got themselves up to 146 for the loss of eight wickets. Wanindu Hasaranga scored 55 off 27 and helped his team post a respectable score. But his efforts went in vain as the Vipers chased the target down with eight balls to spare. Chris Lynn stayed unbeaten on 72 off 50 balls with nine fours and one six. Shimron Hetmyer stayed unbeaten on 25 off 13 balls with five fours. Alex Hales of the Desert Vipers finished the tournament as the leading run-scorer. In 12 matches, the right-handed batter scored 469 runs at an average of 46.90 and a strike-rate of 151.77 with four half-centuries and a century to his name. James Vince of the Gulf Giants finished second on the list, having scored 439 runs from 11 matches at an average of 48.77 with four half-centuries to show for his efforts. Hales and Vince were the only batters who managed to cross the 400-run mark in the tournament. Kieron Pollard finished six runs short of that mark. Chris Jordan of the Gulf Giants finished the championship as the top wicket-taker. The England fast bowler picked up 20 wickets from 10 matches at an economy rate of 7.39. Jordan’s teammate David Wiese accounted for 18 scalps from 11 matches at a better economy rate of seven. Wanindu Hasaranga of Desert Vipers was also pretty impressive after the leg-spin bowler finished with 15 wickets from nine matches at an economy rate of 7.18. Dwayne Bravo, Sheldon Cottrell and Fazalhaq Farooqi picked up 13, 12 and 12 wickets respectively. Get IND-W vs PAK-W Live Score from Womens T20 World Cup 2023. Follow Sportskeeda for latest updates. Poll : 0 votes Quick Links","pubDate":"2023-02-12 22:47:20","image_url":"https://static.sportskeeda.com/editor/2023/02/dd48f-16762252770863-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Star spotted rocking short skirt and heels","link":"https://www.cairnspost.com.au/sport/john-cena-spotted-rocking-short-skirt-thighhighs-and-heels-in-melbourne/news-story/bb3b3f4ff0d38b0109f5bf600cae982e","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"John Cena has a brand new look that has fans raising their eyebrows.","content":"Sport Don't miss out on the headlines from Sport. Followed categories will be added to My News. John Cena has a brand new look that has fans raising their eyebrows. The former WWE star, 45, was spotted in Melbourne recently filming his upcoming flick Ricky Stanicky — and rocking some traditionally feminine-looking garments. Cena sported a black T-shirt; a short, black-and-white plaid skirt; thigh-high stockings, and lace-up black leather heels. Ricky Stanicky is a comedy, directed by Peter Farrelly, that follows three friends who play a prank by burning down a house. The teens then create a fake character on whom to blame for their actions. Over the next two decades, the trio used the lie to get out of sticky situations — until one day they have to hire an actor to portray Stanicky. Cena rocked a plaid skirt, heels, and stockings as part of his outfit. Picture: BackGrid The Peacemaker actor was spotted walking around the set. Picture: BackGrid Zac Efron and William H. Macy help round out the cast. A release date has yet to be set. Cena tweeted his enthusiasm about the flick on Feb. 1. “Beyond excited to help bring these characters to life (both on- and off-screen) with an incredible cast, our director and producers and partners at @AmazonStudios @primevideo,” the Peacemaker star wrote. American actor John Cena filming at Avalon Airport. Picture: Mark Wilson “#RickyStanicky is a best friend to all — can’t wait for you to meet him!” he gushed. The Suicide Squad actor opened up to British GQ last year about switching up careers from wrestling to acting. “The term Hollywood has such a mystique and lustre around it. If you’re skilled at doing one thing, and then you transition into doing another — really, it sounds the same, but it’s a completely different thing,” he said. Cena on a previous trip to Australia with WWE. John Cena. Picture: Mark Stewart “If you have any chance of success, you have to really, really prepare as much as you can.” For the Massachusetts native, his drive comes from “just trying to work as hard as I can to catch up to everybody else,” he said. More Coverage Megan’s ‘savage’ public move against MGK MAFS grooms’ pre-wedding sex aired “If you feel you don’t have a head start, you’ve just got to put rubber to the road and work your ass off,” Cena added. “So that’s kind of where I’m at, dipping my toes back into the screen side of entertainment rather than live events.” This article was originally published by the New York Post and reproduced with permission Originally published as John Cena spotted rocking short skirt, thigh-highs and heels in Melbourne Join the conversation Add your comment to this story To join the conversation, please log in. Don't have an account? Register Join the conversation, you are commenting as Logout More related stories NFL Billionaire heiress declares ‘I’m single’ Gracie Hunt — the daughter of a billionaire NFL owner — is single and “looking for that number one draft pick” at the Super Bowl. Read more Cricket ‘Dark days’: Fallout from Australia Day stance Ash Gardner bowled Australia to victory in the opening T20 World Cup match and then opened up on a tumultuous time. Read more","pubDate":"2023-02-12 20:14:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"Chris Lynn powers Gulf Giants to inaugural ILT20 title","link":"https://www.indiatoday.in/sports/cricket/story/chris-lynns-heroic-knock-guides-gulf-giants-to-inaugural-ilt20-title-2333885-2023-02-13?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chris Lynn powers Gulf Giants to inaugural ILT20 title","content":": Australia batter Chris Lynn scored an unbeaten half-century to guide Gulf Giants to the inaugural International League T20 title at the Dubai International Stadium. Gulf Giants defeated Desert Vipers by 7 wickets in the final. James Vince won the toss for the Gulf Giants and opted to field first. Desert Vipers got off to the poor start with star-opener Alex Hales being dismissed by Carlos Brathwaite in the second over. Opener Rohan Mustafa also could not hold onto his wicket for long, and was run out in the same over to leave the Vipers reeling at 13/2. Adam Lyth could not move the scoreboard much as Colin de Grandhomme sent him back to the pavilion in the fifth over. Chris Jordan provided the Giants with an important breakthrough, dismissing Vipers captain Colin Munroe for just 6 runs. Wicket-keeping batter Sam Billings, along with Sri Lanka all-rounder Wanindu Hasaranga got the Vipers back in the game with a 72-run partnership. However, Billings couldn’t hold on to his wicket for long and was dismissed by Braithwaite after scoring 31 runs off 29 balls. Hasaranga completed a quick-fire half-century before Qais Ahmad sent him packing. Hasaranga was the top-scorer for the Vipers, amassing 55 runs in 27 deliveries. Ahmed then dismissed Luke Wood, before Braithwaite cleaned up England’s Tom Curran as Desert Vipers ended their innings with 146/8 after 20 overs. In the second innings, Luke Wood dismissed Vince in the fourth over, before Curran cleaned up Colin de Grandhomme to peg the Giants back. However, Chris Lynn had other plans in mind. The right-hander formed an important 73-run partnership with wicket-keeping batter Gerhard Erasmus. Lynn went on to complete his half-century as he, alongside West Indian batter Shimron Hetmyer, to guide the Giants to a 7 wicket win with 8 balls remaining. Lynn top-scored for the Giants, scoring 72 runs off 50 balls, while hitting nine boundaries and a six. Meanwhile, Hetmyer scored 25 runs off 13 balls as the Giants lifted the inaugural ILT20 trophy.","pubDate":"2023-02-12 18:33:50","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Third Test set to be moved - and why it’s a blow for Australia","link":"https://www.smh.com.au/sport/cricket/third-test-set-to-be-moved-and-why-it-s-a-blow-for-australia-20230213-p5cjy0.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"In a fresh blow to Australia’s chances of success in India, the third Test is poised to be moved from Dharamsala, which Steve Smith regarded as the best pitch from the 2017 series.","content":"Australia’s faltering campaign in India has taken another turn for the worse with the third Test poised to be moved from the venue expected to best suit fast bowling. There are multiple reports in Indian media that the match will be relocated from the picturesque Himachal Pradesh Cricket Association Stadium in Dharamsala due to concerns over the state of the outfield. The venue, with the snow-capped Himalayas in the background, was scheduled to stage the third Test, from March 1-5. There were also dramas over the schedule in the last series between the two countries in Australia in 2020/21 when India threatened to boycott the Gabba Test over concerns about Queensland’s COVID-19 quarantine restrictions. Australian captain Pat Cummins removes the cover to inspect the pitch ahead of the first cricket in Nagpur, India. Credit: The decision was reportedly made on Sunday after an inspection of the ground by a team of BCCI officials. There are several bare patches on the playing surface, relaid last year to fit in a new drainage system. As reported by The Sydney Morning Herald and The Age over the weekend , a source familiar with the issue said foggy conditions in the town, located at an altitude of 1451 metres, meant there had been insufficient sunlight for grass to grow. While skipper Pat Cummins has told his team “embracing the chaos” was part of what made tours to India so special, there seems to be a new twist every day in this campaign. On Sunday, Australia’s plans to conduct centre-wicket practice on a fourth-day Test pitch at the VCA Stadium were scuppered because ground staff had watered the pitch and the training nets, despite having granted them permission to use them. The session was cancelled. The cold weather in Dharamsala, where temperatures often dip into single figures at this time of year, would have made it difficult for curators to prepare a dry spin-friendly pitch to suit India’s strengths. Pace played a significant part when Australia played there in 2017 at the venue’s only Test when India speedster Umesh Yadav produced a burst with the new ball to run through the visitors’ top order. In his 2017 autobiography The Journey , then captain Steve Smith wrote that the pitch had pace and bounce and was the “best pitch of the lot”. Australia’s quest to regain the Border-Gavaskar Trophy started in disastrous fashion with an innings defeat in Nagpur. Only three Australian sides have come from 1-0 down in the past 100 years to win a series. Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-12 18:19:16","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jaydev Unadkat: ऑस्ट्रेलिया पर धमाकेदार जीत के बाद टीम इंडिया में हुआ बड़ा बदलाव, टीम से बाहर हुआ यह स्टार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jaydev-unadkat-play-ranji-trophy-final-released-from-the-india-squad/articleshow/97846117.cms","keywords":null,"creator":null,"video_url":null,"description":"Jaydev Unadkat: भारतीय क्रिकेट टीम ने तेज गेंदबाज जयदेव उनादकट को ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज से रिलीज कर दिया है। जयदेव अब सौराष्ट्र के लिए रणजी ट्रॉफी का फाइनल मैच खेलेंगे। इससे पहले उन्हें टीम इंडिया के टेस्ट स्क्वाड में शामिल किया गया था।","content":"ऑस्ट्रेलिया के खिलाफ जारी चार टेस्ट मैचों की सीरीज से तेज गेंदबाज जयदेव उनादकट को रिलीज कर दिया गया है। उनादकट रणजी ट्रॉफी 2022-23 फाइनल के लिए सौराष्ट्र टीम से खेलेंगे। बीसीसीआई की मीडिया विज्ञप्ति के अनुसार, चयन समिति ने भारतीय टीम मैनेजमेंट के परामर्श से उनादकट को रिलीज करने का निर्णय लिया। मीडिया विज्ञप्ति में कहा गया कि,'अखिल भारतीय सीनियर चयन समिति ने भारतीय टीम प्रबंधन के परामर्श से बॉर्डर-गावस्कर ट्रॉफी के लिए भारत के ऑस्ट्रेलिया दौरे के दूसरे टेस्ट के लिए जयदेव उनादकट को भारत की टीम से रिलीज करने का फैसला किया है।' विज्ञप्ति में कहा गया कि, 'उनादकट अब सौराष्ट्र की टीम में शामिल होंगे, जिसने बंगाल के खिलाफ 16 फरवरी से ईडन गार्डन्स, कोलकाता में खेले जाने वाले रणजी ट्रॉफी फाइनल के लिए क्वालीफाई किया है।' 31 वर्षीय तेज गेंदबाज ने पिछले साल भारत के बांग्लादेश दौरे के दौरान टेस्ट में वापसी की और ऑस्ट्रेलिया के खिलाफ पहले दो टेस्ट मैचों के लिए टीम में चुने गए थे। बीसीसीआई ने टीम में उनादकट के लिए किसी और खिलाड़ी का नाम नहीं लिया है, जिसमें तेज आक्रमण में मोहम्मद शमी, मोहम्मद सिराज और उमेश यादव शामिल हैं। ऑस्ट्रेलिया के खिलाफ चार टेस्ट मैचों की सीरीज के पहले मैच में टीम इंडिया ने धमाकेदार जीत दर्ज करते हुए सीरीज में 1-0 की बढ़त बना ली है। मैच में ऑस्ट्रेलिया के कप्तान पैट कमिंस ने टॉस जीतकर पहले बल्लेबाजी किया और पूरी टीम 177 रन के स्कोर पर सिमट गई। इसके जवाब में भारत के लिए कप्तान रोहित शर्मा शतकीय पारी खेली। इसके बाद रविंद्र जडेजा और अक्षर पटेल ने भी अर्धशतक लगाए और टीम इंडिया ने 400 रन का स्कोर खड़ा कर 223 रनों की बढ़त हासिल की। इसके जवाब में जब ऑस्ट्रेलिया की टीम दूसरी पारी में बल्लेबाजी के लिए उतरी सिर्फ 91 रन के स्कोर ढेर हो गई और इस तरह भारत ने मैच को पारी और 132 रन से जीत लिया। वहीं सीरीज का दूसरा टेस्ट मैच अब दिल्ली के अरुण जेटली फिरोजशाह कोटला स्टेडियम में 17 से 21 फरवरी के बीच खेला जाएगा।","pubDate":"2023-02-12 17:56:58","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पाकिस्तान वर्ल्ड कप से हुआ बाहर! तीन दिन के अंदर हो जाएगी पुष्टि, पूर्व क्रिकेटर का चौंकाने वाला दावा","link":"https://hindi.news18.com/news/sports/cricket-pakistani-former-cricketer-danish-kaneria-has-made-a-shocking-claim-for-the-odi-world-cup-2023-5373003.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"इन दिनों वर्ल्ड कप 2023 को लेकर दो कट्टर प्रतिद्वंदियों के बीच तनातनी देखने को मिल रही है. भारत एशिया कप के लिए पाकिस्तान नहीं जाने की जिद में है तो पाकिस्तान वर्ल्ड कप में हिस्सा नहीं लेने की धमकी दे रहा है. इस बहस के बीच पूर्व पाकिस्तानी क्रिकेटर दानिश कननेरिया ने चौंकाने वाला खुलासा किया है.","content":"वनडे वर्ल्ड कप 2023 को लेकर पाकिस्तान से एक चौंकाने वाला दावा सामने आया है. (AFP) नई दिल्ली. भारत और पाकिस्तान, दो ऐसे देश जो क्रिकेट के मैदान से लेकर बॉर्डर तक कट्टर प्रतिद्वंदी माने जाते हैं. टी20 वर्ल्ड कप के बाद से दोनों देश की टीमें क्रिकेट के मैदान पर आमने-सामने नहीं आईं हैं. इसके बावजूद इनके बारे में लगातार चर्चा हो रही है. मुद्दा है वनडे वर्ल्ड कप (World Cup 2023) और एशिया कप (Asia Cup) जैसे टूर्नामेंट. इन टूर्नामेंट्स को लेकर बहस जगजाहिर हो चुकी है. लेकिन अब यह बहस एक नया मोड़ लेती दिखाई दे रही है. गौरतलब है कि इस साल एशिया कप की मेजबानी पाकिस्तान करेगा. जिसके लिए भारतीय क्रिकेट कंट्रोल बोर्ड ने टीम इंडिया को पाकिस्तान जाने के लिए साफ इनकार कर दिया था. चारो तरफ तरह-तरह की बातें हुईं. वहीं, पाकिस्तान का दावा है कि यदि भारत हमारे देश नहीं आएगा तो हम वनडे वर्ल्ड कप के लिए भारत की यात्रा नहीं करेंगे. हालांकि, आधिकारिक तौर पर इस बात पर अभी मुहर नहीं लगी है. इस बीच पाकिस्तान के पूर्व क्रिकेटर दानिश कनेरिया का चौंकाने वाला दावा किया है. पाकिस्तानी टीम वर्ल्ड कप के लिए भारत नहीं जाएगी- दानिश कनेरिया दानिश कनेरिया ने वर्ल्ड कप को लेकर अपने यूट्यूब चैनल पर कहा, ‘पाकिस्तानी क्रिकेट टीम आगामी वर्ल्ड कप के लिए भारत का दौरा नहीं करेगी. दो या तीन दिन में इस बात की पुष्टि हो जाएगी. यदि पाकिस्तान दुबई या कतर में एशिया कप की मेजबानी के लिए तैयार हो जाता है तो फिर ये काफी अच्छी बात होगी.’ 1 चौके से जेमिमा ने किए दो शिकार, पाकिस्तान का हुआ काम तमाम, वर्ल्ड कप रिकॉर्ड बुक में लिखवाया नाम मार्च में हो जाएगा फैसला एशिया कप वेन्यू को लेकर एशियन क्रिकेट काउंसिल की मीटिंग हो चुकी है. जिसमें पूरी तरह से निर्णय नहीं लिया जा सका है. एसीसी द्वारा इस फैसले को मार्च तक टाल दिया गया था. हालांकि, एशिया कप के वेन्यू को लेकर यूएई का नाम टॉप पर है. आधिकारिक तौर पर मार्च में इस मु्द्दे पर फैसला हो जाएगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , India Vs Pakistan , ODI World Cup , Team india 300 लड़कियों का तोड़ा दिल, 3 बार की शादी, मान्यता दत्त के साथ में मिला संजू बाबा को सुकून, देखें शादी की फोटोज पति की एक्स वाइफ पर सरेआम फेंका ग्लास, गुस्से में चिल्लाने लगीं रवीना टंडन, बहुत बड़ी थी लड़ाई की वजह PHOTOS: दुनिया देखेगी भारत का दम, कल से बेंगलुरु में शुरू होगा ‘एयरो इंडिया शो’, जानें क्या होगा खास","pubDate":"2023-02-12 17:55:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/Screenshot-2023-01-31-165339-16751643283x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranji Trophy 2022-23: Bengal sets up title clash with Saurashtra","link":"https://www.thehansindia.com/sports/cricket/ranji-trophy-2022-23-bengal-sets-up-title-clash-with-saurashtra-782525","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Finals to be held at Eden Gardens, Kolkata on Feb 16","content":"Indore: Left-arm spinner Pradipta Pramanik's brilliant fifer (5/51) led Bengal to the Ranji Trophy 2022-23 final with a massive 306-run win over defending champions Madhya Pradesh in the second semi-final at Holkar Cricket Stadium, here on Sunday. Chasing a mammoth target of 548, Madhya Pradesh could only score 241 in their second innings. With this, Bengal also avenged last season's semi-final loss to MP. They will now face Saurashtra in the summit clash on February 16 at the Eden Gardens, Kolkata. Since MP was chasing a big total, most of their batters looked to play with positive intent on the final day. However, in the process, they ended up losing wickets at regular intervals. Rajat Patidar was the top-scorer for the side with a 58-ball 52 while no other MP batter passed the 50-run mark. The likes of Yash Dubey and Anubhav Agarwal scored 30 each. On the other hand, Mukesh Kumar, Shahbaz Ahmed and Akash Deep provided support to Pramanik by chipping in with crucial wickets. Earlier, Anustup Majumdar and Sudip Gharami scored hundreds in the first innings to lay the foundation for Bengal's win. Akash then ripped through MP's batting order to bag a five-for as Bengal gained the crucial first innings lead of 268. In their second innings, Bengal scored 279, leaving MP with an improbable target to chase on the last day. In the first semifinal match, Arpit Vasavada, fter his brilliant double-century in the first innings, followed up his with a vital unbeaten 47 to guide Saurashtra to the Ranji Trophy 2022-23 final with a four-wicket win over Karnataka Vasavada's knock helped Saurashtra chase down the target of 115 in the 35th over. With spinner Krishnappa Gowtham running through Saurashtra's batting order by removing Sheldon Jackson, Vishvaraj Jadeja and Chirag Jani, Saurashtra were struggling at 42 for 5. But, Chetan Sakariya scored a crucial 47-ball 24 and also stitched a key partnership of 63 runs with Vasavada to almost seal the win for his team. Semifinals Brief scores: Karnataka 407 (Mayank Agarwal 249; Chetan Sakariya 3-73) and 234 (Nikin Jose 109, Mayank Agarwal 55; Chetan Sakariya 4-45) lost to Saurashtra 527 (Arpit Vasavada 202, Sheldon Jackson 160; Vidwath Kaverappa 5-82) and 117/6 (Arpit Vasavada 47 not out; V Koushik 3-32, K Gowtham 3-38) by four wickets. Bengal 438 (Anustup Majumdar 120, Sudip Gharami 112; Kumar Kartikeya 3/95) & 279 (Anustup Majumdar 80; Saransh Jain 6-103) beat Madhya Pradesh 170 (Saransh Jain 65; Akash Deep 5-42) & 241 (Rajat Patidar 52; Pradipta Pramanik 5-51) by 306 runs.","pubDate":"2023-02-12 17:54:52","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335549-ranji-trophy.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Third India-Australia Test to be moved out of Dharamsala","link":"https://www.thehansindia.com/sports/third-india-australia-test-to-be-moved-out-of-dharamsala-782522","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"The third Test of the ongoing Border-Gavaskar Trophy between India and Australia, originally scheduled to be held in Dharamsala from March 1, will be shifted to a new venue as the ground in the Himalayas is not ready to host the match","content":"New Delhi: The third Test of the ongoing Border-Gavaskar Trophy between India and Australia, originally scheduled to be held in Dharamsala from March 1, will be shifted to a new venue as the ground in the Himalayas is not ready to host the match. The BCCI is yet to finalise the new venue but Indore and Rajkot are the frontrunners to host the second Test. A final decision on the venue is expected to be taken soon, a ESPNcricinfo report said. The decision to move the game out of Dharamsala has been taken after an unfavourable report from the board's inspection panel. The panel visited the ground on February 11 and noted several bare patches on the outfield, which was re-laid recently by the Himachal Pradesh Cricket Association (HPCA) to install a new drainage system. Another obstacle was that no cricket had been played in Dharamsala since the two T20Is between India and Sri Lanka in February 2022. Notably, Dharamsala has hosted only one Test so far -- in 2017 when India beat Australia to clinch the series 2-1. India are up 1-0 in the Border-Gavaskar Trophy, after beating Australia by an innings and 132 runs inside three days in the first Test in Nagpur. The second Test will be played at the Arun Jaitley stadium in Delhi from February 17.","pubDate":"2023-02-12 17:51:37","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335546-dharamsala.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Women's T20 World Cup: India beat Pak by 7 wkts in campaign opener","link":"https://www.thehansindia.com/sports/cricket/womens-t20-world-cup-india-beat-pak-by-7-wkts-in-campaign-opener-782521","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Australia thrash New Zealand by 97 runs","content":"India's Shafali Verma plays a shot as Pakistan's Muneeba Ali Siddiqui looks on Cape Town (South Africa): India produced an impressive performance to beat arch-rivals Pakistan by seven wickets in their opening match of Women's T20 World Cup 2023 at Newlands Cricket Ground, here on Sunday. Riding on brilliant performances by Bismah Maroof (68 not out off 55) and Ayesha Naseem (43 not out off 25), Pakistan posted a competitive total of 149-4 in stipulated 20 overs. Chasing 150, Shafali Verma was partnered by Yastika Bhatia for India at the top with Smriti Mandhana out injured. The duo put on 38 for the opening wicket before Yastike was dismissed by Sadia Iqbal in the final over of the Powerplay. Verma and Jemimah Rodrigues rebuilt, but Pakistan struck in the 10th over when Sidra Amin pulled off a stunning catch close to the ropes to send back Verma. While Harmanpreet Kaur and Jemimah fought back for a bit, Nashra Sandhu sent back Kaur in the 14th over to give Pakistan a massive boost. But, Jemimah Rodrigues led India's fight in the run chase by smashing a fine unbeaten fifty (53 not out off 38) and along with Richa Ghosh (31 not out off 20), took India over the victory line in 19 overs with seven wickets in hand. Earlier, Pakistan, who won the toss and opted to bat first, lost opener Javeria Khan to Deepti Sharma in the second over. Bismah Maroof and Muneeba Ali took the attack to Deepti to help Pakistan to 39/1 at the end of the Powerplay, their highest against India in the first six overs in women's T20Is. However, Radha Yadav struck soon after with the wicket of Muneeba and Pooja Vastrakar sent back Nida Dar for a duck to put India back on top. The in-form Sidra Amin joined Maroof in the middle and the duo put on 25 for the fourth wicket before a freak dismissal saw Amin dismissed by Radha. Ayesha Naseem's entry added impetus to Pakistan's innings as she raced off the blocks with some lusty blows. Maroof held one end up as Ayesha charged from the other to lift Pakistan past the 100-run mark in the 16th over. Maroof completed her fifty soon after as the duo put on a partnership that pushed India onto the back foot. The unbeaten 81-run stand helped Pakistan to 149/4 at the end of 20 overs. The last five overs yielded 58 runs as Pakistan gave India a stiff target. In another match, Alyssa Healy smashed 55 on her return from injury while Ashleigh Gardner picked a five-wicket haul as Australia thrashed New Zealand by 97 runs to kickstart their defence of the Women's T20 World Cup on a high. Alyssa's 55, her highest score in the format since the 2020 Women's T20 World Cup Final helped Australia post an imposing 173/9 in their 20 overs. In reply, New Zealand lost Suzie Bates on the very first ball and were bundled out for just 76 in 14 overs. Brief scores Pakistan Women 149-4 in 20 Overs (Bismah Maroof 68 not out, Ayesha Naseem 43 not out; Radha Yadav 2/21) lost to India Women 151-3 in 19 Overs (Jemimah Rodrigues 53 not out, Richa Ghosh 31 not out; Nashra Sandhu 2/15) by 7 wickets. Australia 173/9 in 20 overs (Alyssa Healy 55, Ellyse Perry 40; Amelia Kerr 3/23, Lea Tahuhu 3/37) beat New Zealand 76 all out in 14 overs (Amelia Kerr 21, Bernadine Bezuidenhout 14; Ashleigh Gardner 5/12, Megan Schutt 2/8) by 97 runs.","pubDate":"2023-02-12 17:49:47","image_url":"https://assets.thehansindia.com/h-upload/2023/02/12/500x300_1335543-shafali-verma.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | 'Nobody gave us a chance,' says riveting Roelof after Sunrisers 'Moneyball' to SA20 victory","link":"https://www.news24.com/sport/Cricket/SA20/nobody-gave-us-a-chance-says-riveting-roelof-after-sunrisers-moneyball-to-sa20-victory-20230212","keywords":null,"creator":null,"video_url":null,"description":"The 38-year-old is credited with instigating the turnaround in Sunrisers Eastern Cape's victorious campaign after a poor start with skipper Aiden Markram stating he was a \"leading character\".","content":"Even at 38, the \"Bulldog\" still has a very serious bite. Roelof van der Merwe - mere months after breaking Proteas hearts at the ICC T20 World Cup with the stunning catch that saw the Netherlands knock them out - is back endearing himself to the South African cricketing public with his infectious enthusiasm and skill, headlined by a Man of the Match performance in the historic SA20 final here on Sunday. The wily left-arm tweaker produced a superb spell of 4/31 as Sunrisers Eastern Cape flouted expectations with a four-wicket victory over Pretoria Capitals, the cherry on top to finishing joint leading wicket-taker (20) with Anrich Nortje. Yet, as much as Van der Merwe - who represented the Proteas before switching allegiance to the Netherlands - delivered a defining contribution when the stakes were at their highest, it was the turnaround he instigated in the early part of his franchise's campaign that stands out. After losing their opening two encounters, Sunrisers' fortunes changed once he was picked. Not that he'll take any credit for that. READ | Sunrisers' pair of bulldogs tear off Capitals' hopes to claim momentous SA20 title \"Even if I didn't play a game, we probably still would've won it. I don't know. I don't know what to tell you,\" said Van der Merwe. \"We're sitting here with a trophy and I'm still trying to figure out how we really won it. Nobody gave us a chance when the tournament started, that's a fact. But we gelled well and almost 'Moneyballed' our way to success. \"In the end, we knew exactly what all of us were going to do and we got on with it. Happy days.\" For his skipper, Aiden Markram, his share in the team's triumph was stark. \"He played a huge role in the turnaround of our season. I've said it before, after we lost out first two games, we needed characters to be out there on the park and lead the fight,\" said the Proteas star, whose own profitable performances in the tournament saw him being named the Most Valuable Player. \"There's no better man than Roelof to lead it. He rubs off on everyone else. It bestows a massive role on him because everyone wants to follow him. \"You can also speak about his skillset, which is still incredible. But the biggest thing for us was to have passion and inspiration to win. And that's what Roelof brought.\" Van der Merwe's game-changing abilities were on full show in front of a full house, striking with his first delivery to calm the nerves of a Sunrisers attack that seemingly tried too hard to exploit a good toss to win and a favourable surface. \"The ball pinged off the bat in the first few overs and suddenly you're wondering if you made the right call at the toss,\" said Markram. \"It was probably just because we were a bit off with the new ball. But Roelof struck and he paused the game for that period. He bowled a couple of good overs and it led to wickets. He started it off for us.\" It's likely that Van der Merwe will grace local shores soon again when the Netherlands come to finish a postponed ODI series against the Proteas in late March, a skirmish that will determine South Africa's hope of qualifying automatically for the 50-over World Cup later this year. And he's not planning on relenting on his approach and output. \"I love coming back here, I was here back in 2019. I just love playing in South Africa and it's very satisfying to be able to contribute towards winning a trophy. We're here to win them after all. \"Even at my age, I still have something left in the tank. I'm glad I could put it to good use,\" said Van der Merwe. \"I just love competing, whatever I'm doing. I love to be a competitor. As long as that desire remains in place, I'll keeping coming back. That's the main thing.\"","pubDate":"2023-02-12 17:45:36","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"}]}