{"newsArray":[{"title":"Samson averages 66 in ODI cricket; But he is on the bench – Shashi Tharoor who beat the Indian team","link":"https://thenewsglory.com/samson-averages-66-in-odi-cricket-but-he-is-on-the-bench-shashi-tharoor-who-beat-the-indian-team/","keywords":["Sports","Cricket","India","Sanju Samson","Sasi Tharoor","shashi tharoor"],"creator":["The News Glory"],"video_url":null,"description":"Sanju Samson, the wicket-keeper batsman, has been denied a chance in the playing eleven of the Indian cricket team. In this case, the member of the Lok Sabha of the Congress party Shashi Tharoor has criticized the management of the Indian team. The Indian cricket team toured New Zealand and played a cricket series. In […]","content":"Sanju Samson, the wicket-keeper batsman, has been denied a chance in the playing eleven of the Indian cricket team. In this case, the member of the Lok Sabha of the Congress party Shashi Tharoor has criticized the management of the Indian team. The Indian cricket team toured New Zealand and played a cricket series. In this, the Indian team who won the T20 series lost the ODI series. Sanju Samson played only one match in the three-match ODI series. 28-year-old Sanju Samson made his debut in the Indian team in 2015. So far he has played a total of 11 ODIs and 16 T20Is. Sanju from Kerala has scored 330 runs in ODI cricket and 296 runs in T20 cricket. But even if there is a chance for him in the team, it is a challenge to get him in the playing eleven. “Pant has failed to add runs yet again. He needs some time off from white ball cricket. Sanju Samson, on the other hand, has yet again been denied a chance. Now he has to perform well in the IPL series and showcase his batting skills. Pant has done well as a fourth batsman. So it is important to support him’ said VVS Lashman. He is the best out of form player. Bailliere struck out 10 times in 11 innings. Sanju Samson’s average in ODIs is 66. Has played well in last 5 matches,” Tharoor tweeted. One more failure for Pant, who clearly needs a break from white-ball cricket. One more opportunity denied to @IamSanjuSamson who now has to wait for the @IPL to show that he’s one of the best too-order bats in India. #IndvsNZ https://t.co/RpJKkDdp5n","pubDate":"2022-11-30 23:07:09","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Eddie’s global sport summit back with big guests","link":"https://www.couriermail.com.au/news/victoria/eddie-mcguirechaired-sportnxt-global-sport-summit-returning-to-melbourne/news-story/cd9a616a256b464e9228f9fb560c8dcc","keywords":["News","Sport","Victoria"],"creator":null,"video_url":null,"description":"An international summit on the future of sport will return to Melbourne for the next two years.","content":"SportNXT will return to Melbourne in March, bringing 50 leading industry executives to Australia’s sporting capital. International Cricket Council chair Greg Barclay, Victorian Commonwealth Games boss Peggy O’Neal, Tesla chair Robyn Denholm and News Corp Australasia executive chairman Michael Miller will be among key speakers.Other notable speakers will include Rugby Australia and Rugby World Cup board member Pip Marlow, Australian Sports Commission chair Josephine Sukkar and Star and Disney India head of sport Sanjog Gupta.More high-profile global sporting identities are expected to be added to the list in coming weeks and months, with executives coming from interstate and overseas for the event.SportNXT chair Eddie McGuire said it would build on the success of this year’s inaugural event.“Our ambition is to create the most formidable sport leadership summit globally,’’ he said.“Gathering revered international, regional, and domestic c-suite sporting leaders to probe the things that matter to ensure sport is ready for the inevitable change in the years to come.’’ The conference will run at Melbourne Park events space CENTREPIECE from March 28-30.Issues to be addressed include women and sport, leadership and culture and “the golden decade’’ ahead with the FIFA Women’s World Cup, Commonwealth Games, Rugby World Cup and Olympics.SportNXT director Bart Campbell said: “Melbourne is an internationally recognised leader in the major events industry so it is a natural home for a global sports summit of this magnitude.’’He said there would be opportunities to network and connect with global and domestic leaders throughout the conference.“SportNXT 2023 will be a nursery for cutting-edge innovation and sector-shaping ideas,” he said.sportnxt.org","pubDate":"2022-11-30 22:57:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Golf: Ryan Fox looking to cap of impressive year in similar fashion at Australian Open","link":"https://www.newstalkzb.co.nz/news/sport/golf-ryan-fox-looking-to-cap-of-impressive-year-in-similar-fashion-at-australian-open/","keywords":null,"creator":null,"video_url":null,"description":"Ryan Fox is looking to finish his phenomenal year with a flourish at the historic mixed-gender Australian Open in Melbourne. The world No 27 missed the cut at last week’s Australian PGA Championship, five days after a top-20 finish at the DP World Tour season finale in Dubai, with Fox blaming his struggles in Brisbane on jetlag. The two Australian tournaments are co-sanctioned with the DP World Tour and mark the start of the new season. After a campaign that saw him win two titles on tour, produce a slew of top-10 finishes and end the year ranked second behind world No 1 Rory McIlroy on the Order of Merit, Fox is looking forward to getting home next week. But first, two of the best golf courses in Australasia await with the tournament being staged at the Victoria Golf Club and Kingston Heath on Melbourne’s sandbelt. Fox is one of 12 New Zealanders in the field and gets underway alongside Australian Marc Leishman and Denmark’s Rasmus Hoigaard in the opening round (2:27pm) at the Victoria Golf Club on Thursday. “I slept in to 11 on Saturday morning which I haven’t done in about 15 years so that pretty much shows how tired I was last week. The rest has probably been a good thing and I am definitely feeling a little bit better this week,” Fox said. What excites Fox about this week’s tournament is the location. “They are probably two of the best golf courses in the world this week. “Kingston Heath is always up there as one of the best in Australia and Victoria is arguably not too far behind that. So yeah, it’s easy to get up for this one. The Aussie Open’s a pretty big event with a lot of history and it’s a couple of golf courses I’ve played quite a bit over the years. “I would love to play well this week. There’s probably been a little bit of a comedown from last season, even though that was only a week and a half ago at this point. But I am definitely feeling a bit more refreshed and will be giving it a good crack this week. And the plan is no different than any other week this year, just go out and try to beat the golf course and be there come Sunday afternoon.” It’s a stacked field with Cam Smith, Adam Scott, Leishman and Fox leading the men’s contenders and top Australian women Minjee Lee and Hannah Green in the women’s field. “They’ve done really well on the field and I think Melbourne will come out in force to support it, which will be nice.” While Fox will finish his year on Sunday afternoon, assuming he makes the cut, he won’t be putting away the clubs just yet. He’s the headline act at a six-hole challenge at Royal Auckland next Friday. Six teams of celebrities will play six holes, with Fox playing two holes with each group. The groups will be playing Ambrose, while Fox will be playing his own ball. “It’ll be fun,” said Fox. “Getting to play six holes at Royal will be great. And we’ve got some great celebrities and sportspeople coming to play. The format looks interesting - hopefully I can be on form because I think I’m going to have to play pretty well to beat a couple of three-man Ambrose teams.” ‘Chasing the Fox’ celebrity teams: Rugby – Beauden Barrett, Jordie Barrett, Damian McKenzie Cricket – Martin Guptill, Ross Taylor, Mitch Santner Olympics – Eric Murray, Simon Child, Tom Abercrombie NZ Warriors – Shaun Johnson, Wayde Egan, Freddy Lussick Politics – John Key, David Seymour, Max Key Media – Justin Marshall, Mark Richardson, third member TBC For tickets and more information, visit www.supersixgolf.com.","content":null,"pubDate":"2022-11-30 21:10:13","image_url":"https://www.newstalkzb.co.nz/media/5kvjvice/ryan-fox-getty-images.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Graham Arnold hails Socceroos after team ‘unites the country’ with World Cup run","link":"https://www.theguardian.com/football/2022/dec/01/graham-arnold-hails-socceroos-after-team-unite-the-country-with-world-cup-run","keywords":["World Cup 2022","Australia","Football","World Cup","Australia sport","Sport"],"creator":["Paul MacInnes at Al Janoub Stadium"],"video_url":null,"description":"Australia coach talks of a new ‘golden generation’ of playersSocceroos reach knockout phase for first time since 2006“I truly believe that the Socceroos are the team that unites the country”, said Graham Arnold, vindicated. “If the cricket team get to the final of the World Cup you don’t get scenes like tonight. You don’t see the squares like they are tonight, and not with the rugby union or rugby league either. I’m just so proud and happy. This is what World Cups are for.”The Australia coach was talking after his team had beaten the odds and perhaps even their own expectations to qualify for the round of 16 at Qatar 2022. A deserved victory over the team placed 10th in the Fifa world rankings, Arnold believes this feat has sealed the creation of a second “golden generation” for Australia after the team of 2006, but that now the focus must be on achieving more. Continue reading...","content":null,"pubDate":"2022-11-30 19:54:55","image_url":"https://i.guim.co.uk/img/media/6b3cdfa08e727dc0a7da8ee25a09f73d9ca2fbce/0_17_2930_1759/master/2930.jpg?width=460&quality=85&auto=format&fit=max&s=8ba47e1f051b2b7a99d00bffd426fa9b","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"3rd VC’s cricket tournament concludes at IUST","link":"https://kashmirreader.com/2022/12/01/3rd-vcs-cricket-tournament-concludes-at-iust/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"SRINAGAR: Islamic University of Science and Technology (IUST) Admin team beat School of Sciences department (IUST) in the finals of 3rd Vice Chancellor’s Employees Cricket Tournament played at IUST ground on Wednesday. Faheem Gul was adjudged Man of the Series and Owais Rah was awarded the Man of the Series. Congratulating the winning team on […]","content":"SRINAGAR: Islamic University of Science and Technology (IUST) Admin team beat School of Sciences department (IUST) in the finals of 3rd Vice Chancellor’s Employees Cricket Tournament played at IUST ground on Wednesday. Faheem Gul was adjudged Man of the Series and Owais Rah was awarded the Man of the Series. Congratulating the winning team on their victory, Prof Naseer Iqbal said that such activities should be encouraged on the campus as they endow confidence. Speaking on the occasion, Vice Chancellor, IUST Prof Shakeel A. Romshoo praised both teams for making it to the finals and emphasized the relevance of such activities for psychological well-being and cultivating team spirit. Dean, Academic Affairs of IUST Prof. Manzoor Ah. Malik underlined the recreational value of sports activities and encouraged student and faculty members to actively participate in extracurricular activities within and outside the campus. Other dignitaries who watched the tournament along with hundreds of students and teachers include included Prof. A. H Moon (Dean, School of Engineering and Technology), Prof. Khuroo (Dean, School of Sciences), Samir Wazir (Finance Officer, IUST), and Dr Fozia Qazi (Head, Department of Mathematical Sciences). The tournament was organized by Directorate of Physical Education & Sports, IUST . 3rd VC’s cricket tournament concludes at IUST added by KR Desk on 12:08 am December 1, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-30 18:38:51","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 LIVE Scores: Argentina face Poland challenge; Saudi Arabia meet Mexico","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-live-score-poland-vs-argentina-saudi-arabia-vs-mexico-football-match-latest-updates-11727821.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"FIFA World Cup 2022 LIVE Scores: Argentina face Poland challenge; Saudi Arabia meet Mexico","content":"FIFA World Cup 2022 LIVE Scores: Poland 0-0 Argentina; Saudi Arabia 0-0 Mexico FIFA World Cup 2022 LIVE updates: Hello and welcome to our LIVE coverage of the FIFA World Cup Group C matches on matchday three of the group stage. Two matches are on the cards, with Argentina taking on Poland with sights on victory, which is crucial for them to advance for the knockouts. FP Sports November 30, 2022 23:59:27 IST Auto refresh feeds Argentina's Lionel Messi celebrates after scoring the first goal during the World Cup group C match between Argentina and Mexico. AP Highlights LIVE NEWS and UPDATES Dec 01, 2022 - 00:32 (IST) FIFA World Cup Group C LIVE The action is underway in both matches, a huge night for Lionel Messi's Argentina, as well as Poland, whose talismanic player Robert Lewandowski will look to step up against the Argentinians. Dec 01, 2022 - 00:10 (IST) FIFA World Cup Group C LIVE Saudi Arabia vs Mexico Lineups Saudi Arabia: Mohamed Al-Owais, Sultan Al-Ghanam, Abdulelah Al-Amri, Ali Al-Bulaihi, Hassan Tambakti, Mohamed Kanno, Saud Abdulhamid, Ali Al-Hassan, Saleh Al-Shehri, Salem Al-Dawsari, Firas Al-Buraikan Mexico: Guillermo Ochoa, Cesar Montes, Edson Alvarez, Alexis Vega, Hector Moreno, Orbelin Pineda, Jorge Sanchez, Henry Martin, Hirving Lozano, Jesus Gallardo, Luis Chavez Dec 01, 2022 - 00:07 (IST) FIFA World Cup Group C LIVE Poland vs Argentina Lineups Poland: Wojciech Szczesny (GK), Kamil Glik, Jakub Kiwior, Matty Cash, Bartosz Bereszynski, Grzegorz Krychowiak, Piotr Zielinski, Krystian Bielik, Przemyslaw Frankowski, Karol Swiderski, Robert Lewandowski Argentina: Emiliano Martinez (GK), Cristian Romero, Nicolas Otamendi, Nahuel Molina, Rodrigo De Paul, Marcos Acuna, Alexis Mac Allister, Enzo Fernandez, Angel Di Maria, Julian Alvarez, Lionel Messi Nov 30, 2022 - 23:47 (IST) Hello and welcome to our LIVE coverage of the FIFA World Cup Group C matches on matchday three of the group stage. Two matches are on the cards, with Argentina taking on Poland with sights on victory, which is crucial for them to advance for the knockouts. Saudi Arabia face Mexico in the other match, with both games kicking off simultaneously (10 pm local time in Qatar, 12.30 am IST). Preview: Lionel Messi has already come to Argentina’s rescue at the World Cup. He might just have to do it all over again. Another emotionally charged evening awaits Messi and the soccer-mad South American nation that worships him when Argentina meets Poland on Wednesday for a match with so much on the line. For Messi, who is playing in likely his last World Cup. For Poland striker Robert Lewandowski, who might also be too old when soccer’s biggest tournament rolls around next in 2026. And for the World Cup as a whole. Because who really doesn’t want to see Messi — one of the game’s greatest ever players — in the late stages of a tournament that is heating up so nicely. There are multiple scenarios at play for the Group C finale. A win for the Argentines and they are sure to advance, likely as the group winners. A draw, and they can either finish in second place behind Poland or be squeezed out by either Saudi Arabia or Mexico, who are playing in a match taking place concurrently. A loss? Well, that just doesn’t bear thinking about for anyone associated with Argentina. The team wouldn’t just be eliminated but humiliated. Messi might never be seen in the Albiceleste’s sky blue-and-white jersey again. That scenario is too much for Argentina fans to take. It’s why tears were shed on the field, among the technical staff and among the fanbase after Messi scored the crucial second-half goal to set Argentina on its way to a 2-0 win over Mexico on Saturday. That victory meant Argentina bounced back from its shocking 2-1 loss to Saudi Arabia in its opening match and now has a fighting chance to avoiding a first group-stage exit since 2002. In the Group C’s other game that will take place simultaneously, Saudi Arabia face Mexico. Mexico have only earned one point from two games, and will need to beat Saudi Arabia, and hope Poland beat Argentina in order to have any hopes of advancing to the knockout stage. With inputs from AP Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 01, 2022 00:31:15 IST TAGS: Fifa World Cup 2022 Kickingaround Poland Vs Argentina Saudi Arabia Vs Mexico","pubDate":"2022-11-30 18:29:27","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Lionel-Messi7.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps denied by rain on edge of victory over India","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-denied-by-rain-on-edge-of-victory-over-india/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps have extended their unbeaten run in home ODIs but their series victory over India ended Wednesday on a suitably damp note. With the hosts in total control at Hagley Oval as they chased 220 and a second triumph in the three-match series, the rain came down to instead force the teams to settle for another no result. Cruelly for the Black Caps, who had progressed to 104-1 after 18 overs to sit well ahead of the DLS par score, only two more overs were required to constitute an official match. But it was a sadly fitting conclusion to a tour plagued by rain, with just two of the six limited-overs fixtures between the sides producing a result. New Zealand were left to content themselves with a 1-0 ODI series victory that saw them bounce back from a 1-0 T20 defeat and remain unbeaten at home in 50-over cricket since the start of 2019. Home fans, meanwhile, will be waiting 11 weeks until the team next play in this country, with the Black Caps now heading to Pakistan ahead of the first test starting in Karachi on December 27. The wash out in Christchurch was especially unfortunate for the unlikely pair of bowlers who had lifted the Black Caps into such a strong position. After Kane Williamson had won his third toss and once more opted to bowl, Adam Milne ran through the Indian top order before Daryl Mitchell prevented any resurgence, each finishing with three wickets. Williamson leaned heavily on his seamers as New Zealand took regular wickets and never let an Indian partnership progress beyond the 39-run opening stand, aided by wind, cloudy conditions and a pitch that offered some assistance. Matt Henry (0-29) set the tone for a testing innings, shutting down Shubman Gill to begin. The opener needed 12 balls to get off the mark, and looking to then hasten the pace against Milne, followed consecutive boundaries by flicking the next delivery straight to Mitchell Santner. Milne then spilled Shreyas Iyer at deep third - the only miscue on an otherwise excellent catching day for the hosts - but atoned the following over by getting Shikhar Dhawan to chop on. The paceman was playing his first ODI series in five years, having endured a rotten run of injury luck. But Milne appeared as fit as ever while bowling his 10-over allotment in succession, finding the edge of Suryakumar Yadav to finish with 3-57. That represented the second-best return of Milne’s ODI career, while at the other end Mitchell was also putting together one of his most memorable days. The allrounder has enjoyed few chances to emphasise that moniker at international level, having taken only 10 wickets across formats. But Williamson tossed him the ball in the 19th over and Mitchell quickly repaid that faith as Glenn Phillips took a good catch at deep square to dismiss Rishabh Pant. Mitchell proceeded to send down seven effective overs as India struggled to contend with his medium pace, earning career-best figures of 3-25. Iyer (49 off 59) and Washington Sundar (51 off 64) were the only batsmen to provide real resistance, with the latter’s maiden half-century pushing India past 200. The target initially appeared as though it could challenge the Black Caps, with India’s seamers similarly finding conditions to their liking. Arshdeep Singh’s opening over in particular seriously tested Devon Conway, who crawled to 2 off 16 before cracking his first boundary through cover. Finn Allen, meanwhile, rode his luck early on, sending one edge over the slip corden and another through it. But after Conway smacked four boundaries from the 10th over and Allen added a couple more in the 11th, the required run rate fell before four. Allen brought up his fourth ODI half-century in the 16th over by lofting Sundar over long off, reaching the milestone in 50 balls. He soon departed but the real blow to the Black Caps’ chances came at the end of the 18th, when the rain fell and washed away their hopes.","content":null,"pubDate":"2022-11-30 18:16:17","image_url":"https://www.newstalkzb.co.nz/media/pevppgjm/finn-allen-hit-50-to-pace-the-black-caps-chase-v-india-photosportnz.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Joe Root gives BIG update on health of England cricket team hit by viral infection in Pakistan, says THIS","link":"https://zeenews.india.com/cricket/joe-root-gives-big-update-on-health-of-england-cricket-team-hit-by-viral-infection-in-pakistan-says-this-2542179.html","keywords":null,"creator":null,"video_url":null,"description":"England had already named their playing XI for the game, with Liam Livingstone in line for his Test debut and Ben Duckett back in the side after six years.","content":null,"pubDate":"2022-11-30 16:57:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ibrahim Zadran breaks record during epic hundred against Sri Lanka - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI5MjA5MzjSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ibrahim Zadran breaks record during epic hundred against Sri Lanka  ICC CricketRecent Match Report - Afghanistan vs Sri Lanka 3rd ODI 2022/23  ESPNcricinfoSL vs AFG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update-  Cricket AddictorAFG vs SL 3rd ODI: Asalanka stars as Sri Lanka clinches thriller to level series 1-1  SportstarIbrahim Zadran Sets Record For Highest Individual Score In ODIs For Afghanistan  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-11-30 15:48:04","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"China doubles its nuclear warheads to over 400 in just 2 years; stockpile will rise to 1,500 by 2035: Pentagon","link":"https://www.firstpost.com/sports/china-doubles-its-nuclear-warheads-to-over-400-in-just-2-years-stockpile-will-rise-to-1500-by-2035-pentagon-11726921.html","keywords":["Sports"],"creator":["FP Staff"],"video_url":null,"description":"China doubles its nuclear warheads to over 400 in just 2 years; stockpile will rise to 1,500 by 2035: Pentagon","content":"Beijing: In a recent provocative speech, Chinese President Xi Jinping had told the People’s Liberation Army (PLA) of China to prepare for a “real war”. Going by its extensive preparations, the PLA seems to have taken the statement with extreme seriousness.A report by the Pentagon has claimed that China’s stockpile of nuclear weapons has increased to more than 400 in less time than anticipated by US estimates. China is focusing on increasing its nuclear capacity and may increase its nuclear stockpile to about 1,500 warheads by 2035, according to the Pentagon’s annual “China Military Power” report to Congress that was released Tuesday.China has border disputes with all neighboring countries and wants to challenge its ‘biggest enemy’ America.China’s PLA doubles nuclear arsenal in 2 yearsIn 2020, the US estimated China’s nuclear arsenal to be just over 200. The US was estimated to double its reserves in less than a decade.But just two years later, according to the 2022 China Military Power Report released on Tuesday, China has doubled its nuclear stockpile and has reached a point where it could have 1,500 nuclear weapons by 2035 if it continues to increase its stockpile at the same pace.China conducted 135 missile tests in 2021“What we have seen in the last few years is a really accelerated expansion,” a senior US defense official told the media.China’s investment on nuclear weapons in all three areas, water, land and air, is increasing the concern of the US. The report states that China has also conducted 135 ballistic missile tests in 2021, which is more than the rest of the world’s total tests. These figures do not include ballistic missiles used in the Ukraine war.The report states that the Chinese military is also developing space and counterspace weapons. China has a standing army of about one million soldiers, the largest navy by number of ships, and the third largest air force in the world.The National Defense Strategy for 2022, released last month, projects China as a major challenge to the US, which top Pentagon leaders often emphasize.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-30 14:33:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Pentagon-China-nuclear-weapons-nuclear-US-Chinese-PLA-Peoples-Liberation-Army-Xi-Jingping.png","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Foreign coaches make money and vanish': Gautam Gambhir advocates Indian coaches for Men in Blue","link":"https://www.firstpost.com/firstcricket/sports-news/foreign-coaches-make-money-and-vanish-gautam-gambhir-advocates-indian-coaches-for-men-in-blue-11726711.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Foreign coaches make money and vanish': Gautam Gambhir advocates Indian coaches for Men in Blue","content":"Cricket 'Foreign coaches make money and vanish': Gautam Gambhir advocates Indian coaches for Men in Blue The video of Gambhir's statements prompted a variety of reactions. While some people agreed with his opinion, others reminded the ex-India opener about foreign coaches like Gary Kirsten and John Wright. FP Trending November 30th, 2022 19:30:24 IST File image of Gautam Gambhir. Sportzpics It’s no surprise that former India opener Gautam Gambhir continues to dominate headlines even if it’s been years since he stepped onto the field in the India outfit. The 41-year-old recently stated that the Indian team should be coached by Indian players only. The left-handed opener also praised Anil Kumble and Rahul Dravid and wished he had been able to play under an Indian coach. Gambhir also hoped that this trend of Indians coaching the Men in Blue continued. The statements were made by Gautam Gambhir at a Federation of Indian Chambers of Commerce & Industry (FICCI) event in Delhi earlier this week. The southpaw took to social media on Wednesday to share a video of his remarks. “One really good thing that has happened in Indian cricket in the past six-seven years is that Indians have started coaching the Indian cricket team. I am a very strong believer in this. Indians should coach the Indian cricket team. All these foreign coaches, whom we end up giving a lot of importance to, they only come here, they make money and they vanish. Emotions are involved in sports, and the only people who can be emotional about Indian cricket or Indian sports are the people who have represented their country. So whether it is Rahul Dravid right now, or before him it was Ravi Shastri and Anil Kumble, I hope this trend continues. You ask Rahul Dravid, probably he will be more passionate than all those other guys. I wish I had played under any one of these Indian coaches.” Watch: View this post on Instagram A post shared by Gautam Gambhir (@gautamgambhir55) The video prompted a variety of reactions. While some people agreed with Gambhir’s opinion, others reminded the ex-India opener about foreign coaches like Gary Kirsten and John Wright. “True, without emotion cricket is nothing,” commented one person. “Then How did Gary Kirsten help India to win the icc men odi World Cup 2011 ?? He was also not an Indian coach, he was from South Africa..”, wrote another. “John Wright got us to a WC final, Gary Kirsten got us there and beyond, Duncan Fletcher oversaw us to Champions Trophy glory. If you take away emotion and favouritism of players, you can pick players based on merit and not past achievements,” one user remarked. Updated Date: November 30, 2022 19:30:24 IST Tags: Cricket Gautam Gambhir Team India Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-30 14:00:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Gautam-Gambhir-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 LIVE Scores: Tunisia vs France, Australia vs Denmark","link":"https://www.firstpost.com/sports/live-score-fifa-world-cup-2022-tunisia-vs-france-australia-vs-denmark-group-d-football-today-latest-updates-11726601.html","keywords":["Sports"],"creator":["Rachit Kanaujia"],"video_url":null,"description":"FIFA World Cup 2022 LIVE Scores: Tunisia vs France, Australia vs Denmark","content":"FIFA World Cup 2022 LIVE Scores: Tunisia vs France, Australia vs Denmark FIFA World Cup: Defending champions France have already secured qualification to the round of 16 while Tunisia, Denmark, and Australia fight for the remaining spot from Group D. Rachit Kanaujia November 30, 2022 19:11:20 IST Auto refresh feeds Defending champions France are the first team to qualify for the last 16 stage in FIFA World Cup 2022. AP Highlights LIVE NEWS and UPDATES Nov 30, 2022 - 20:25 (IST) FIFA World Cup Live Group updates: Teams gear up for their respective national anthems as they gear up to play their last group games beginning in another five minutes. Nov 30, 2022 - 20:19 (IST) FIFA World Cup Live Group D updates #AUS #DEN #TUN #FRA pic.twitter.com/xtBcqcRMbK — FIFA World Cup (@FIFAWorldCup) November 30, 2022 Nov 30, 2022 - 20:15 (IST) FIFA World Cup Live Group D updates Qualification scenario for Group D teams explained: 🇫🇷 have qualified for the knockout stages but 🇩🇰, 🇦🇺 & 🇹🇳 have it all to do if they want to make it out of Group D! #FIFAWorldCup | #Qatar2022 pic.twitter.com/PjhVehwEZm — FIFA World Cup (@FIFAWorldCup) November 30, 2022 Nov 30, 2022 - 20:03 (IST) FIFA World Cup Live Group D Australia vs Denmark updates: Playing XI: Australia Starting XI : Ryan, Degenek, Rowles, Souttar, Behich, Mooy, McGree, Irvine, Leckie, Duke, Goodwin Denmark Starting XI: Schmeichel, Andersen, Maehle, Christensen, Jensen, Braithwaite, Eriksen, Skov Olsen, Kristensen, Hojbjerg, Lindstrom Nov 30, 2022 - 20:01 (IST) FIFA World Cup Live Group D Tunisia vs France updates:​ Starting lineups Tunisia (3-4-3): Dahmen; Ghandri, Talbi, Meriah; Kechrida, Maaloul, Skhiri, Laidouni; Ben Slimane, Ben Romdhane, Khazri. Bench : Aymen Mathlouthi, Bilel Ifa, Dylan Bronn, Youssef Msakni, Hannibal Mejbri, Issam Jebali, Taha Khenissi, Ferjani Sassi, Ghaylen Chaaleli, Seifeddine Jaziri, Mohamed Drager, Bechir Ben Said, Naim Sliti, Ali Abdi, Mouez Hassen France (4-4-2): Mandanda; Disasi, Varane, Konaté, Camavinga; Guendouzi, Tchouaméni, Fofana, Veretout; Kolo Muani, Coman. Bench : Hugo Lloris, Benjamin Pavard, Jules Kounde, Antoine Griezmann, Olivier Giroud, Kylian Mbappe, Ousmane Dembele, Adrien Rabiot, William Saliba, Dayot Upamecano, Theo Hernandez, Alphonse Areola,Marcus Thuram Nov 30, 2022 - 19:53 (IST) FIFA World Cup Live Group D updates: Hello and welcome to the live blog of the FIFA World Cup 2022 group stage games between Tunisia and France, and Australia and Denmark. The FIFA World Cup Group D competition will come to an end on Wednesday evening with two simultaneous games kicking off at 8:30 PM IST, as France face Tunisia and Australia clash with Denmark to confirm a place in the last 16. Tunisia need to defeat France if they aim to stay alive in the tournament as a loss or even a draw will knock them out of the competition. However, even if they beat high-flying France, the Eagles of Carthage will have to rely on the result of a simultaneously played Group D game between Australia and Denmark to go their way. On the other hand, defending champions France have already secured qualification to the round of 16 with the wins against Australia and Denmark, and Les Bleus only need a draw to guarantee first place in Group D. In the meantime, Australia will be locking horns with Denmark. It’s a must-win tie for both teams as either of them can move to the next round with a win if Tunisia fail to stun France. Australia are at the second position right now with three points, while Denmark have only one point and are third in the tally. If both team play out a draw and Tunisia win their clash then it will come down to goal difference between Australia and Tunisia while Denmark will be knocked out. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 30, 2022 19:25:54 IST TAGS: Denmark Fifa World Cup 2022 France Kickingaround","pubDate":"2022-11-30 13:55:54","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/fifa-world-cup-2022-scenarios.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Jason Holder baffles Marnus Labuschagne with spectacular swing, Aussie batter can’t resist applauding","link":"https://www.firstpost.com/firstcricket/sports-news/watch-jason-holder-baffles-marnus-labuschagne-with-spectacular-swing-aussie-batter-cant-resist-applauding-11726801.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Watch: Jason Holder baffles Marnus Labuschagne with spectacular swing, Aussie batter can’t resist applauding","content":"Cricket Watch: Jason Holder baffles Marnus Labuschagne with spectacular swing, Aussie batter can’t resist applauding The near-perfect delivery, bowled pretty slow at 123.7 kph, triggered an epic reaction from Labuschagne. FP Trending November 30th, 2022 19:22:31 IST It was Marnus Labuschagne who led the Australian innings and took them to a comfortable position with an unbeaten 270-ball 154 at stumps. Image: Twitter screengrab @cricketcomau Australia pulled off a dominant start to the opening Test of the two-match home series against West Indies today at the Optus Stadium. The hosts concluded the first day’s play with 293 runs on the board losing just two of their batters. It was Marnus Labuschagne who led the Australian innings and took them to a comfortable position with an unbeaten 270-ball 154 at stumps. Labuschagne was in good rhythm since arriving at the crease after the early dismissal of opener David Warner. But, he faced a real challenge from West Indies pacer Jason Holder in the very first delivery of the 90th over. The Caribbean pacer bowled a length delivery off the stumps and baffled the batter with an unexpected outswing. Labuschagne was forced by the initial angle to attempt a forward defence. But he had to leave it as the ball curved away to find the keeper’s hands beating the outside edge of his bat. The near-perfect delivery, bowled pretty slow at 123.7 kph, triggered an epic reaction from Labuschagne. He wasted no time appreciating the effort by Holder. As heard on the stump mic, the right-handed batter, with a wide smile on his face, bantered, “Oh Jason, that is a delicious ball.” The same kind of reactions came from the on-air commentators. They also heaped praise on the bowler for putting the set batter in such a difficult situation. “Oh Jason that’s a delicious ball!” 😂 #AUSvWI pic.twitter.com/bv7LxDHwqY — cricket.com.au (@cricketcomau) November 30, 2022 A clip of Holder’s stunning delivery has been shared by Cricket Australia on their official Twitter. Undoubtedly, it grabbed the eyeballs of online users in no time and has received over 65,000 views since being dropped. The footage has garnered as many as 4,500 likes on the microblogging site. Referring to the remark by Labuschagne, a person sarcastically commented, “The commentators can take a break when Marnus is batting. He will do the commentary on your behalf.” The commentators can take a break when marnus is batting. He will do the commentary on your behalf — Cricket (@omar2504) November 30, 2022 Another user acknowledged, “That ball deserved a wicket.” That ball deserved a wicket… Holy Moly. Reminds me of Ambrose and Walsh. — MrLoudMouth (@kashifzuzu) November 30, 2022 An individual noted, “Marnus is a special character.” Marnus is a special character — Fidato (@tequieremos) November 30, 2022 Apart from Labuschagne, Usman Khawaja and Steve Smith made notable contributions to the score sheet. While Khawaja departed after registering 65 runs off 149 balls, Smith seemed well-settled. Updated Date: November 30, 2022 19:22:31 IST Tags: Australia Vs West Indies Cricket Jason Holder Marnus Labuschagne Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-30 13:52:31","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Marnus-640_Twitter-screengrab.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Sharath Kamal bestowed with Khel Ratna in glittering National Sports Awards ceremony","link":"https://www.tribuneindia.com/news/sports/sharath-kamal-bestowed-with-khel-ratna-in-glittering-national-sports-awards-ceremony-456333","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, November 30Table tennis legend Achanta Sharath Kamal was on Wednesday bestowed with the Major Dhyan Chand Khel Ratna, the country's highest sporting honour, by President Droupadi Murmu in a glittering National Sports Awards ceremony at the Rashtrapati Bhavan here on Wednesday.While Sharath is the lone Khel Ratna award recipient, 25 sportspersons, including shuttlers Lakshya Sen, HS Prannoy, woman boxer Nikhat Zareen, track and field athletes Eldhose Paul and Avinash Sable, were conferred with the Arjuna Award.The creme de la creme of Indian sports were recognised for their achievements in the past few years at a specially organised ceremony.The event is traditionally held every year to commemorate the birth anniversary of hockey legend Major Dhyan Chand on August 29. But last year also, the event was held on another date.The star attraction of the ceremony was Sharath, who received his Khel Ratna award amid thunderous applause from the select dignitaries present at the Durbar Hall.The Khel Ratna is given for the spectacular and most outstanding performances by a sportsperson over a period of previous four years. It carries a cash prize of Rs 25 lakh, a medal and a scroll of honour. The Arjuna award carries a cash prize of Rs 15 lakh, a bronze statue and a scroll of honour. The 40-year-old Sharath had returned from Birmingham Commonwealth Games as the most-decorated Indian athlete with four medals. He is the second table tennis player after Manika Batra to get the Khel Ratna.Besides a yellow metal in the mixed doubles, Sharath also pocketed his singles gold after 16 years, the first having won at the 2006 Melbourne CWG.The lanky paddler has claimed a whopping 13 medals from the CWG overall. He also won two bronze medals at the 2018 Asian Games, and is now in search of an elusive Olympic glory at the 2024 Paris Games.While Sharath took away the spotlight, the star attractions among Arjuna awardees were shuttler Sen, world champion boxer Zareen, boxer Amit Panghal and triple jumper Eldhose Paul, all gold medallists at Birmingham Games.The Khel Ratna was the first award to given by the President, followed by the Dronacharya award in the lifetime category, won by Rohit Sharma's coach Dinesh Jawahar Lad, football coach Bimal Prafulla Ghosh and wrestling mentor Raj Singh.The Dronacharya Award is the regular category were handed to Jiwanjot Singh Teja (archery), Mohammad Ali Qamar (boxing), Suma Siddharth Shirur (para shooting) and Sujeet Maan (wrestling).Discus thrower Seema Punia was the first to receive the Arjuna award from the President, followed by Paul, Sable, Sen, Prannoy and Panghal, among others.Dhyan Chand Award for Lifetime achievement was won by Ashwini Akkunji C (athletics), Dharamvir Singh (hockey), B C Suresh (kabaddi) and Nir Bahadur Gurung (para athletics).Sreeja, who partnered Sharath to win the mixed doubles gold in Birmingham, described the moment as unforgettable.\"It is an honour for me to be bestowed with the Arjuna award. Recognition of this kind is very motivating for a young athlete like me, and I want to thank my parents, Somnath Sir, and all my coaches and trainers,\" she said.The ceremony was also attended by sports minister Anurag Thakur along with a host of other dignitaries, including his deputy Nisith Pramanik.Major Dhyan Chand Khel Ratna Award 2022: Achanta Sharath Kamal.Arjuna Awards for outstanding performance in Sports and Games 2022: Seema Punia (Athletics), Eldhose Paul (Athletics), Avinash Mukund Sable (Athletics), Lakshya Sen (Badminton), HS Prannoy (Badminton), Amit (Boxing), Nikhat Zareen (Boxing), Bhakti Pradip Kulkarni (Chess), R Praggnanandhaa (Chess), Deep Grace Ekka (Hockey), Shushila Devi (Judo), Sakshi Kumari (Kabaddi), Nayan Moni Saikia (Lawn Bowl), Sagar Kailas Ovhalkar (Mallakhamb), Elavenil Valarivan (Shooting), Omprakash Mitharval (Shooting), Sreeja Akula (Table Tennis), Vikas Thakur (Weightlifting), Anshu (Wrestling), Sarita (Wrestling), Parveen (Wushu), Manasi Girishchandra Joshi (Para Badminton), Tarun Dhillon (Para Badminton), Swapnil Sanjay Patil (Para Swimming), Jerlin Anika J (Deaf Badminton).?Dronacharya Award for outstanding coaches in Sports and Games 2022 Regular Category: Jiwanjot Singh Teja (Archery), Mohammad Ali Qamar (Boxing), Suma Siddharth Shirur (Para Shooting), Sujeet Maan (Wrestling).Lifetime Category: Dinesh Jawahar Lad (Cricket), Bimal Prafulla Ghosh (Football), Raj Singh (Wrestling).Dhyan Chand Award for Lifetime achievement in Sports and Games 2022: Ashwini Akkunji C (Athletics), Dharamvir Singh (Hockey), B C Suresh (Kabaddi), Nir Bahadur Gurung (Para Athletics).?Rashtriya Khel Protsahan Puruskar 2022: TransStadia Enterprises Private Limited, Kalinga Institute of Industrial Technology, Ladakh Ski amp; Snowboard Association.Maulana Abul Kalam Azad (MAKA) Trophy 2022: Guru Nanak Dev University, Amritsar.Tenzing Norgay National Adventure Awards: Naina Dhakad (Land Adventure), Shubham Dhananjay Vanmali (Water Adventure), Group Captain Kunwar Bhawani Singh Samyal (Life Time Achievement).","content":null,"pubDate":"2022-11-30 13:41:41","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1975821153.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"I have got this award because of Rohit, Shardul: Dinesh Lad","link":"https://timesofindia.indiatimes.com/sports/cricket/news/i-have-got-this-award-because-of-rohit-sharma-and-shardul-thakur-says-dronacharya-awardee-dinesh-lad/articleshow/95885987.cms","keywords":null,"creator":null,"video_url":null,"description":"Dinesh Lad, the cricket coach who has mentored Indian cricket stars Rohit Sharma and Shardul Thakur, said that he is extremely honoured to have won the Dronacharya Award and credited his win to his pupils.","content":null,"pubDate":"2022-11-30 12:07:51","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Warwickshire CCC fixtures announced for 2023 season","link":"https://www.birminghammail.co.uk/sport/cricket/warwickshire-cricket-fixtures-bears-sparks-25638190","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Chris Watson)"],"video_url":null,"description":"Warwickshire County Cricket Club news from BirminghamLive as the full County Championship fixture list for the 2023 is confirmed","content":"Warwickshire County Cricket Club now have their full fixture list confirmed for the 2023 season. Warwickshire will get their LV= Insurance County Championship Division One campaign under way away to Somerset on Thursday, April 6. That is followed by home fixtures against Kent and Surrey – starting on Thursday, April 13, and Thursday, April 27, respectively. The 2023 Vitality Blast competition will be launched with Blast Off, a new double-header fixture at Edgbaston on Saturday, May 20. That will see Derbyshire Falcons take on Lancashire Lightning before the Bears play an evening match against Yorkshire Vikings. READ MORE: Warwickshire snap up pioneering graduate in new coaching role READ MORE: Bears snap up explosive 'boom' bowler for next season After that comes a Bank Holiday Family Fun Day against Lancashire Lightning on Monday, May 29, with tickets for this match available from £10. There is another double-header at Edgbaston on Saturday, June 3, when Central Sparks play Southern Vipers in the Charlotte Edwards Cup ahead of the Bears taking on Notts Outlaws. And one more key date for the diary is Friday, June 23, when local rivals Worcestershire Rapids visit Edgbaston. Fans can register now to get priority access to tickets at the best prices, which will go on sale in February online at edgbaston.com/bears . Club Captain Will Rhodes said: “Fixtures release date is always a big day in the calendar for players and fans alike. All eyes are now turning towards the new season and the excitement will start building over the coming weeks and months. “There’s obviously dates we all look for like Worcestershire Rapids here at Edgbaston where we always get an amazing crowd and the atmosphere is electric. “But this year we’ve also got the new Blast Off which is set to be an occasion to rival finals day, more Big Blast games on Friday evening and Saturday, plus a packed calendar of county and one day fixtures. The lads can’t wait to get started.” Central Sparks' first action of the new season comes away to East Midlands rivals The Blaze at Trent Bridge in the Charlotte Edwards Cup on Saturday, April 22. A week later, on Saturday, April 29, the Sparks are again in T20 action at their regional home at New Road, against Northern Diamonds, before taking centre stage at Edgbaston on Tuesday, May 23, against Northern Diamonds. August will be a busy month of one-day cricket, with eight league games scheduled in the space of 18 days. The One-Day Cup starts with a trip to Somerset on Friday, August 4, before an opening home 50-over fixture against Gloucester on Monday, August 7. The season concludes with a final Championship match at home to Somerset, starting on Tuesday, September 26. Members and Season Pass holders can claim their free Blast Off ticket, which gives access to both games, by logging-in to their online account. Fans can register to get priority access to tickets at the best prices for Blast Off, starting from £25 for adults and £5 for under 16s, online at edgbaston.com/blastoff . You can see the full 2023 fixture list here .","pubDate":"2022-11-30 11:48:48","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article25638193.ece/ALTERNATES/s615/0_Last-day-drama-pic.jpg","source_id":"birminghammail","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Labuschagne: Nice to score runs when not absolutely feeling 100% - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2F1cy12cy13aS0xc3QtdGVzdC0yMDIyLTIzLW1hcm51cy1sYWJ1c2NoYWduZS1uaWNlLXRvLXNjb3JlLXJ1bnMtd2hlbi1ub3QtYWJzb2x1dGVseS1mZWVsaW5nLTEwMC1wZXJjZW50LTEzNDcxMDbSAaABaHR0cHM6Ly93d3cuZXNwbmNyaWNpbmZvLmNvbS9zdG9yeS9hdXMtdnMtd2ktMXN0LXRlc3QtMjAyMi0yMy1tYXJudXMtbGFidXNjaGFnbmUtbmljZS10by1zY29yZS1ydW5zLXdoZW4tbm90LWFic29sdXRlbHktZmVlbGluZy0xMDAtcGVyY2VudC0xMzQ3MTA2P3BsYXRmb3JtPWFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Labuschagne: Nice to score runs when not absolutely feeling 100%  ESPNcricinfoAustralia in command as top order shine in Perth | Australia v West Indies 2022-23  cricket.com.auMarnus Labuschagne, Usman Khawaja century stand powers Australia ahead vs West Indies cricket board | Cricbuzz.com - Cricbuzz  CricbuzzRecent Match Report - Australia vs West Indies 1st Test 2022/23  ESPNcricinfoPoor final session 'made day look bad': Simmons | Australia v West Indies 2022-23  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-11-30 11:36:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishab Pant’s lean patch continues, fans slam south-paw for yet another failure","link":"https://telanganatoday.com/rishab-pants-lean-patch-continues-fans-slam-south-paw-for-yet-another-failure","keywords":["India","News","Sport","Rishabh Pant","Sanju Samson"],"creator":["Telangana Today"],"video_url":null,"description":"Indian wicket-keeper batsman Rishab Pant’s lean patch of form continued as he once again failed to score runs in the 3rd ODI match against New Zealand. Pant, who joined Shreya Iyer in the middle after getting bowled in the bowling of Adam mile, scored only 10 runs off 16 balls.","content":"Home | Sport | Rishab Pants Lean Patch Continues Fans Slam South Paw For Yet Another Failure Rishab Pant’s lean patch continues, fans slam south-paw for yet another failure Indian wicket-keeper batsman Rishab Pant’s lean patch of form continued as he once again failed to score runs in the 3rd ODI match against New Zealand. Pant, who joined Shreya Iyer in the middle after getting bowled in the bowling of Adam mile, scored only 10 runs off 16 balls. By Telangana Today Published Date - 05:05 PM, Wed - 30 November 22 Rishab Pant’s lean patch of form continued as he once again failed to score runs in the 3rd ODI match against New Zealand. Hyderabad: Indian wicket-keeper batsman Rishabh Pant ’s lean patch of form continued as he once again failed to score runs in the 3rd ODI match against New Zealand. Pant, who joined Shreya Iyer in the middle after getting bowled in the bowling of Adam mile, scored only 10 runs off 16 balls. Rishabh came to bat when India was at 55-2 after 13 overs, and with many overs left, Pant could have easily built his innings to get back into form, but he failed to utilise the opportunity. Also Read See what Urvashi Rautela said after Rishabh Pant’s “peecha choro behen” remark T20 World Cup: Pant replaces Karthik as India win toss, elect to bat first against Zimbabwe The Indian team management picked Rishabh ahead of Sanju Samson , and many fans believe that excluding the Keralite from the squad was a mistake. Fans of Sanju Samson started taking to Twitter to slam Rishabh Pant and support the former. “Great innings by #RishabhPant . I think after this innings, the BCCI should give the captaincy to Pant,” a user tweeted. “Normal players miss the century for 2 or 5 runs but, Legend missed the century just for 90 runs. What a player(sic),” wrote another. “#BCCI planning to give captaincy to #RishabhPant,” a third user said. Congress party MP from Thiruvananthapuram, Shashi Tharoor also took to Twitter to support Sanju Samson. In his tweet, he suggested Pant to take a break and expressed his disappointment for not including Sanju in the team. One more failure for Pant, who clearly needs a break from white-ball cricket. One more opportunity denied to @IamSanjuSamson who now has to wait for the @IPL to show that he’s one of the best too-order bats in India. #IndvsNZ https://t.co/RpJKkDdp5n — Shashi Tharoor (@ShashiTharoor) November 30, 2022 Here are a few other reactions: 10(16)🔥🔥incredible innings🔥secured his place for next 10 matches. This is rishabh pant for you🔥haters step back😂 #Rishabpant #SanjuSamson #BCCI pic.twitter.com/69GfOiLKfw — Navaneeth (@Navanee31078282) November 30, 2022 Okay this is now the peak of partiality, Sanju Samson is again not in the team . What he has done to @BCCI . Totally wasting a pure talent. Isse acha to India ke bahar jakar khel leta wo #Sanjusamson — Himanshu Tiwari (@himanshu0347) November 30, 2022 Aa gaya samajh aur aa gayi hansi, ab bas kar do 🙏 #Rishabpant #SanjuSamson pic.twitter.com/pfdKg6s7ho — Sarkarstic (@I_Am_Parijat) November 30, 2022 Aa gaya samajh aur aa gayi hansi, ab bas kar do 🙏 #Rishabpant #SanjuSamson pic.twitter.com/pfdKg6s7ho — Sarkarstic (@I_Am_Parijat) November 30, 2022 New Zealand won the series by 1-0 as the third ODI between India and New Zealand was called off due to rain. Batting first, the Indian team made 219 runs in 47.3 overs. In reply, New Zealand got off to a good start as their openers Finn Allen and Devon Conway stitched a 97-run partnership for the first wicket. But rain played spoilsport again for the second time in the series before the match was called off today in Christchurch. Follow Us : Tags Rishabh Pant Sanju Samson Related News IND v NZ, 2nd T20I: India storm to 65-run victory over New Zealand T20 World Cup: Pant replaces Karthik as India win toss, elect to bat first against Zimbabwe India vs South Africa: Ruturaj Gaikwad gets trolled for his slow innings IND vs SA, 1st ODI: South Africa beat India by 9-runs to take 1-0 lead IND vs ZIM, 2nd ODI: Samson, Thakur guide India to 5-wicket win over Zimbabwe See what Urvashi Rautela said after Rishabh Pant’s “peecha choro behen” remark","pubDate":"2022-11-30 11:35:51","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Old firm of Labuschagne and Smith put Australia in control against West Indies","link":"https://www.theguardian.com/sport/2022/nov/30/old-firm-of-labuschagne-and-smith-put-australia-in-control-against-west-indies","keywords":["Cricket","Australia cricket team","West Indies cricket team","Australia sport","Sport"],"creator":["Geoff Lemon in Perth"],"video_url":null,"description":"Hosts reach 293-2 on day one of the first Test in PerthQueenslander takes command with unbeaten 154 After all of the short-form mayhem, the gentle rhythms of Test cricket returned. It also returned to Perth after a pandemic-enforced absence since 2019. Australia’s players took a knee in a gesture against racism for the first time in a Test match, in solidarity with the West Indies team. Then the work as opponents began after Australia won the toss and chose to bat, coming through some serious toil against good bowling to reach 293 for 2 at stumps, with Steve Smith on 59 and Marnus Labuschagne notching his eighth Test century before carrying on to 154.The day also began with eyes on Justin Langer, after the former coach’s week of criticising his former players before trying to backtrack. “Perception and reality. Perception often sells newspapers,” said Langer, who days earlier had a full-length photo portrait published with his column on the back of the West Australian. On the field before play in his new job as a television commentator, it was all smiles and hugs with the players, who have as much reason as the coach to show grace. The bonhomie was helpfully edited into a short video package by Langer’s employer. Continue reading...","content":null,"pubDate":"2022-11-30 11:19:42","image_url":"https://i.guim.co.uk/img/media/f97da2e1e60e57dc186d889ae4d34153a60fc2ca/0_174_5221_3134/master/5221.jpg?width=460&quality=85&auto=format&fit=max&s=45287f541e38bb39c8b728d82ae64e8e","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"PCB, ECB likely to postpone Rawalpindi Test after England players fall ill","link":"https://www.livemint.com/sports/cricket-news/pcb-ecb-likely-to-postpone-rawalpindi-test-after-england-players-fall-ill-11669806476196.html","keywords":null,"creator":["Livemint"],"video_url":null,"description":"As per a report, on Wednesday, only five England players -- Harry Brook, Zak Crawley, Keaton Jennings, Ollie Pope and Joe Root -- turned up for training at the Pindi Cricket Stadium. While the rest squad members, including captain Ben Stokes, stayed back in the team hotel.","content":null,"pubDate":"2022-11-30 11:14:41","image_url":"https://images.livemint.com/img/2022/11/30/1600x900/Pakistan-England-Test_1669806652825_1669806652966_1669806652966.jpg","source_id":"livemint","country":["india"],"category":["sports"],"language":"english"},{"title":"Confirmation of first-class fixture against Essex in lead-up to Lord&#8217;s Test","link":"https://www.cricketireland.ie/news/article/confirmation-of-first-class-fixture-against-essex-in-lead-up-to-lords-test","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – Cricket Ireland today has confirmed that the Ireland Men’s cricket team will play a three-day first-class match against Essex in the lead-up to Lord’s Test match between Ireland and England in 2023.","content":null,"pubDate":"2022-11-30 11:00:28","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"‘More Asian wickets is more practical World Cup journey’, says Shikhar Dhawan as India look forward to Bangladesh","link":"https://www.firstpost.com/firstcricket/sports-news/more-asian-wickets-is-more-practical-world-cup-journey-says-shikhar-dhawan-as-india-look-forward-to-bangladesh-11725761.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"‘More Asian wickets is more practical World Cup journey’, says Shikhar Dhawan as India look forward to Bangladesh","content":"India stand-in skipper Shikhar Dhawan elaborated on the team’s learnings from the rain-marred ODI series against New Zealand.The third match was called off after 18 overs in the second innings. New Zealand had scored 104 /1 in response to India’s 219.New Zealand won the three-match series 1-0 as rain washed out two matches on either side of the Blackcaps’ victory.Dhawan, however, was optimistic and said that the team will look forward to the series against Bangladesh.The southpaw, speaking at the post-match presentations, said that more matches in Asian conditions will help the team prepare better for the 2023 World Cup.“Absolutely, going to Bangladesh, hopefully, the weather will be better there. We are a young unit. The bowling unit learnt about bowling in the good length area. We were short at times. All the seniors are going to be back in the side.“More Asian wickets is a more practical journey to the World Cup for us. Important to get the small things right – right lengths for the bowlers, batting close to the body in these conditions for the batters… these are the learnings.”New Zealand skipper Kane Williamson as well was optimistic and said that there was some good stuff in rained-off games too.“When we have been playing cricket we have been applying ourselves. Some good stuff in the rained-off games too. We knew that 20 overs would constitute a match, but we could see the weather coming, it has been following us. Daryl has been hanging out for a bowl for ages. Milne felt a niggle but didn’t want to stop.”The Kiwis will next be seen in action in a Test series against Pakistan, starting at the end of the year. Williamson said that his team will regroup as a Test unit after a break.“Focus changes to the Test arena. Guys get a break now and that’s important too. Been pretty busy. We will regroup as a Test team after the break.”Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-30 10:58:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Shikhar-Dhawan.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia v West Indies Day 1 Highlights","link":"https://www.themercury.com.au/sport/cricket/australia-v-west-indies-day-1-highlights/video/43836046db9e153c630dc9eac3c9ade6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Watch all the action from day one of the first Test between Australia and the West Indies","content":"Cricket: Watch all the action from day one of the first Test between Australia and the West Indies","pubDate":"2022-11-30 10:36:18","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Watch: वेस्टइंडीज़ के खिलाफ बल्लेबाज़ी के साथ फील्डिंग करते दिखे लाबुशेन, दिलचस्प वीडियो वायरल","link":"https://www.abplive.com/sports/cricket/aus-vs-wi-australian-batsman-marnus-labuschagne-were-giving-the-ball-to-bowler-by-hand-see-video-2270907","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Australia vs West Indies Test: ऑस्ट्रेलिया दौरे पर मौजूद वेस्टइंडीज़ टीम अपना पहला टेस्ट मैच खेल रही है. आज इस टेस्ट का पहला दिन है. ऑस्ट्रेलिया ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया. ओपनिंग पर आए डेविड वॉर्नर (5) ने 3.5 ओवरों में ही पहला विकेट गंवा दिया. इसके बाद नंबर तीन पर बल्लेबाज़ी के लिए मार्नस लाबुशेन ने शानदार शतक लगाया और वो अभी भी क्रीज़ पर मौजूद हैं. इस टेस्ट मैच के दौरान एक ऐसा दिलचस्प वाक़या पेश आया, जिसे देख सभी हैरान हो गए. बल्लेबाज़ी के साथ की फाल्डिंग शतकीय पारी खेलकर क्रीज़ पर मौजूद मार्नस लाबुशेन ने बीच मैच में कुछ ऐसा कर दिया, जिसे देख सभी चक्कर में पड़ गए. दरअसल, सोशल मीडिया पर क्रिकेट ऑस्ट्रेलिया की तरफ से एक वीडियो शेयर किया गया. इस वीडियो में आप देख सकते हैं कि नॉन स्ट्राइकर एंड पर खड़े मार्नस लाबुशेन गेंद उठाकर गेंदबाज़ को देते हुए यानी फील्डिंग करते हुए दिखाई दिए गेंद पिच के बाहर की तरफ से जा रही थी. उसी बीच मार्नस ने गेंद को पहले तो अपने बल्ले से रोका, फिर उन्होंने गेंद को हाथ से उठाकर गेंदबाज़ को दे दिया. मार्नस का इस तरह से बल्लेबाज़ी के साथ-साथ फील्डिंग में योगदान देना लोगों का काफी मज़ाकिया लगा. Marnus out here proving you can bat and field at the same time #AUSvWI pic.twitter.com/b7i9xslOyH — cricket.com.au (@cricketcomau) November 30, 2022   अच्छी रही टीम की शुरुआत पहले बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम शानदार लय में दिखी. ओपनिंग पर डेविड वॉर्नर के अलावा ओपनिंग पर आए उस्मान ख्वाजा 65 रनों की पारी खेलकर पवेलिय लौटे. इसके बाद मार्नस लाबुशेन और स्टीव स्मिथ क्रीज़ पर मौजूद है. स्मिथ अपनी अर्धशतक पूरा कर चुके हैं. कमज़ोर रहे वेस्टइंडीज़ के गेंदबाज़ वेस्टइंडीज़ के गेंदबाज़ कंगारुओं के सामने नाकाम दिखाई दिए. अभी तक सिर्फ ऑस्ट्रेलिया ने सिर्फ दो विकेट खोए हैं. इसमें जेडेन सील्स और काइल मेयर्स ने 1-1 विकेट अपने नाम किया.   ये भी पढ़ें... FIFA WC 2022: कतर के इस शानदार होटेल में रुके हैं डेविड बेकहम, एक रात का किराया जानकर हो जाएंगे हैरान!","content":null,"pubDate":"2022-11-30 10:31:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/30/bb7d774d8f686ba029b7ec78105fff971669800721854582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Tigress by the Tale: Close encounters in safaris are common, so why the uproar over Raveena Tandon's Satpura moment?","link":"https://www.firstpost.com/sports/raveena-tandon-safari-satpura-tiger-reserve-11725231.html","keywords":["Sports"],"creator":["FP Explainers"],"video_url":null,"description":"Tigress by the Tale: Close encounters in safaris are common, so why the uproar over Raveena Tandon's Satpura moment?","content":"What happens in India’s tiger reserves, doesn’t stay in India’s tiger reserves, especially if a celebrity is visiting. Case in point: Bollywood actor and wildlife lover Raveena Tandon’s recent visit to Satpura Tiger Reserve in Madhya Pradesh that is making headlines, with a great deal of hand-wringing over rules being flouted.So what happened in Satpura?Tandon was on a jeep safari in the Satpura forest, when a tigress was spotted. In a video, which has gone viral on social media, you can hear camera clicks. As the animal approaches, the actor can be heard asking that the vehicle be backed.In the video, posted on Instagram by Tandon, the striped cat growls at the vehicle and then continues into the forest.Probe Launched After Video Shows Raveena Tandon’s Vehicle Near Tigerhttps://t.co/buZEpJnyEv(Video instagrammed by Raveena Tandon) pic.twitter.com/2kyktGlsww— NDTV (@ndtv) November 29, 2022What are authorities saying?Authorities at the Satpura Tiger Reserve have started a probe as they claimed the vehicle was too close to the tigress. Sub Divisional Officer (SDO) of Forest Dheeraj Singh Chouhan on Tuesday said following the directives of senior officials, he has started a probe into the alleged incident.The vehicle driver and the officials on duty there will be served a notice and questioned, the official said. The probe report will be submitted to senior officials for further action, he said.What is Tandon saying?Tandon on Wednesday said she was travelling in a jeep licensed by the forest department which didn’t deviate from the designated “tourism path”.The actor, who visited the reserve on 22 November, in a tweet said she was accompanied on the safari by trained guides and drivers provided by the department. “A tiger gets close to the deputy rangers bike. One can never predict when and how tigers will react. It’s the Forest Department licensed vehicle,with their guides and drivers who are trained to know their boundaries and legalities,” she tweeted.#satpuratigerreserve .@News18MP reports.A tiger gets close to the deputy rangers bike. One can never predict when and how tigers will react. It’s the Forest Department licensed vehicle,with their guides and drivers who are trained to know their boundaries and legalities. pic.twitter.com/mTuGLSVPER— Raveena Tandon (@TandonRaveena) November 29, 2022In another tweet, she added, “Tigers are kings of where they roam. We are silent spectators. Any sudden movements can startle them as well.”“Luckily for us , that we did not take any sudden action, but sat quiet and watched the tigress, move on. We we’re on the tourism path, which mostly these tigers cross. And Katy the tigress in this video aswell, is habituated to coming close to vehicles and snarling,” she wrote.#satpuratigerreserve .. Tigers are kings of where they roam. We are silent spectators. Any sudden movements can startle them aswell. pic.twitter.com/5f6WrN8xRn— Raveena Tandon (@TandonRaveena) November 30, 2022Tandon is an avid wildlife lover and has often called out misbehaviour and flouting of rules in tiger reserves.Earlier this month, authorities at the Van Vihar National Park, located in Bhopal, started an investigation after Tandon shared a video and claimed some miscreants were throwing stones at a tiger enclosure in the park. “Tourists ( ruffians ) pelting stones at the tiger in closures. Having a good laugh when told not to do so. Screaming laughing, shaking the cage- throwing rocks. No security for the tiger. humiliation they are subjected to,” she tweeted.Van Vihar,Bhopal. Madhya Pradesh.Tourists ( ruffians ) pelting stones at the tiger in closures.Having a good laugh when told not to do so.Screaming laughing,shaking the cage- throwing https://t.co/XiI7SCu50Y security for the tiger.humiliation they are subjected to .@van_vihar pic.twitter.com/b3ouu4vhlA— Raveena Tandon (@TandonRaveena) November 21, 2022Park authorities had said they were investigating the incident. Such acts are punishable under the Wildlife Protection Act, they had said. In a tweet, the park management clarified, “Van Vihar National Park follows Zero Tolerance policy against any kind of action which can lead to physical harm to animals.”Van Vihar National Park follows Zero Tolerance policy against any kind of action which can lead to physical harm to animals. We urge the public to refrain from indulging any such Activities which are punishable under Wildlife Protection Act.#zerotolerance #notolerance https://t.co/dvFLtwvo6J— Van Vihar National Park (@van_vihar) November 21, 2022How does India treat its wild animals?Be it in zoos or national parks, harassment of wild animals has become all too common. In tiger reserves, tourists often pressure drivers to flout rules.In yet another video posted recently, tourists stop a safari jeep to get closer to the tiger. However, the big cat was not pleased and growled and charged toward the vehicle. At this point, the jeep driver hurriedly moved the car forward. The tiger did not hurt anyone, turned around and retreated to the jungle.Sometimes, our ‘too much’ eagerness for ‘Tiger sighting’ is nothing but intrusion in their Life…🐅#Wilderness #Wildlife #nature #RespectWildlife #KnowWildlife #ResponsibleTourism Video: WA@susantananda3 @ntca_india pic.twitter.com/B8Gjv8UmgF— Surender Mehra IFS (@surenmehra) November 27, 2022Indian Forest Officer Surrender Mehta, who shared the video, tweeted, “Sometimes, our ‘too much’ eagerness for ‘Tiger sighting’ is nothing but intrusion in their Life.”While it remains unclear in which national park in India the video was shot, the internet is flooded with clips of close encounters with tigers.Idiotitis... When human brain shuts down & mouth keeps talking.Appreciate the anger management of the tiger. But that can’t be guaranteed in future. pic.twitter.com/dSG3z37fa8— Susanta Nanda (@susantananda3) January 21, 2021In 2020, a vehicle driver and guide were suspended in Maharashtra’s Tadoba-Andhari Tiger Reserve (TATR) for blocking the path of a dominant male tiger. A year before that, a tourist and his guide were jointly fined Rs 51,000 for allegedly pelting stones at a sleeping tiger in Rajasthan’s Ranthambore Tiger Reserve (RTR) because they wanted to get a “perfect action shot”, according to a report in The Times of India.Also read: Maya, Machli, Munna, naam toh suna hoga?: How India’s legendary tigers got their names What do the rules say?After the Tadoba incident, the National Tiger Conservation Authority (NTCA) directed chief wildlife wardens of all the states to follow protocol and maintain a 500-metre distance between two vehicles during a safari to allow for the passage of wild animals.According to NTCA guidelines, each reserve is expcted to set a ceiling level on the number of visitors allowed to enter the park to prevent overcrowding. A list of dos and don’ts is a must. Safari vehicles are permitted only in the tourism zones of the forest and on designated tracks. Tourism is restricted to 20 per cent of the core areas of the reserves and a maximum of 40 cars per day are permitted.NTCA member-secretary Anup Kumar Nayak told The Times of India that it has been observed that tourist vehicles inside reserves do not maintain the 500-metre distance resulting in overcrowding around animals.How do tourists impact tigers? According to a report in Mongabay, a study examining stress hormones in tiger scat collected from two popular central Indian tiger reserves – Bandhavgarh and Kanha – revealed that the carnivores suffer from high levels of physiological stress due to wildlife tourism and a large number of vehicles entering the parks.“Chronically elevated glucocorticoid levels can negatively impact growth, reproductive success, immunity, and cause muscular atrophy,” senior author Govindhaswamy Umapathy, who is a principal scientist and project leader at the Laboratory for the Conservation of Endangered Species (LaCONES) at CSIR-Centre for Cellular and Molecular Biology (CCMB), Hyderabad told the publication. “If it continues it will have a definite impact on the population in the long-term.”The tiger needs to be saved, sometimes from irresponsible tourists and sometimes from overzealous drivers and guides. In Satpura, it looks like it was the latterWith inputs from agenciesRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-30 10:28:54","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/raveentandon.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"El primer equipo de beisbol profesional","link":"https://www.liderendeportes.com/noticias/opiniones/juan_vene/el-primer-equipo-de-beisbol-profesional/","keywords":["Juan Vené"],"creator":["Juan Vené"],"video_url":null,"description":"Disfruten de una nueva entrega de en la pelota por Juan Vené La entrada El primer equipo de beisbol profesional se publicó primero en Líder en deportes.","content":"“Tuve una novia enferma de fiebre interina”… Yogi Berra. Hoy es miércoles, Día del Correo. Por favor, si envías algún mensaje, adjunta nombre completo y población o ciudad desde donde escribes. Gracias. Edecio J. Cañizares, de San Francisco, California, pregunta: “¿Por qué los hermanos Harry y George Wright, ingleses, fueron principales en el primer equipo de beisbol profesional, si lo que jugaban era cricket?”. Amigo Chechio: Harry, mánager y pitcher de los Cincinnati Reds Stockings de 1869, había nacido en Sheffield, Inglaterra y estaba en sus 34 años de edad. Pero su hermano, George, segunda base y sortstop, nació en Nueva York, siete años después. Sí, habían sido estelares jugadores de cricket, y lo jugaban en el Elysian Field, de Hoboken, New Jersey, donde también se jugaba beisbol. Pronto fueron conquistados por el nuevo juego, y se convirtieron en notables peloteros, especialmente George, quien es considerado el mejor jugador de los de su época. Cuando en 1868, surgió en Cincinnati la inquietud por organizar el primer equipo con todos los jugadores, que eran 11, a sueldo, ellos dos fueron contratados e inauguraron a los Cincinnati Reds Stockings, en 1869. El éxito fue notable, y en 1871 se fundó la primera Liga Grande, la Nationals Association, cuando los Wright fueron a jugar con el club de Boston. Aurelio Piñeiro, de Ciudad de México, pregunta: “Siempre pondera el trabajo que realiza la “Major League Baseball Writers Association of América”, pero informa muy poco de esa gestión. ¿Podría ilustrarnos al respecto?”. Amigo Yeyo: Somos unos 800 miembros, y cerca de la mitad, sólo quienes hemos cubierto Grandes Ligas, desde los palcos de prensa durante 10 o más años, votamos para el Hall de la Fama. Nos ocupamos de que los Palcos de Prensa sean cómodos y aptos para nuestro trabajo. Incluso, revisamos cómo construyen de los nuevos Palcos y exigimos cuanto es necesario. Yo estuve en las comisiones del caso para el Loan Depot Park de los Marlins y el City Field de los Mets. Además, tras cada temporada, elegimos los Mánagers del Año, Más Valiosos, Novatos del año y Cy Youngs. Adicionalmente, en cada una y en todas ciudades con Grandes Ligas, elegimos los ganadores de los premios locales. Todos esos trofeos los pagamos de nuestro bolsillo, a través de las anualidades que aportamos para ser parte de la Asociación, que fue fundada en 1908. Gracias a la vida que me ha dado tanto, incluso un lector como tú. La entrada El primer equipo de beisbol profesional se publicó primero en Líder en deportes.","pubDate":"2022-11-30 10:00:00","image_url":null,"source_id":"liderendeportes","country":["venezuela"],"category":["sports"],"language":"spanish"},{"title":"FIFA WC 2022 Analysis | Will England, who won thanks to changes in the squad, shake off the slump in the next round?","link":"https://thenewsglory.com/fifa-wc-2022-analysis-will-england-who-won-thanks-to-changes-in-the-squad-shake-off-the-slump-in-the-next-round/","keywords":["Sports","England","FIFA WC 2022","FIFA World Cup","foot ball","Football","online special","Wales"],"creator":["The News Glory"],"video_url":null,"description":"England have advanced to the knockout stages of the 2022 FIFA World Cup in Qatar. England’s resounding 3-0 win over Wales at midnight was due in no small part to the changes made by coach Southgate. Until the break, England struggled to score as their passing and dribbling were sluggish. But it was only after […]","content":"England have advanced to the knockout stages of the 2022 FIFA World Cup in Qatar. England’s resounding 3-0 win over Wales at midnight was due in no small part to the changes made by coach Southgate. Until the break, England struggled to score as their passing and dribbling were sluggish. But it was only after the break that Southgate’s changes to the team worked perfectly. Marcus Rashford scored in the 50th and 68th minutes, and Phil Foden scored a goal in the 51st minute, assisted by Harry Kane. Wales’ dreams of qualifying for the World Cup for the first time in 64 years have been dashed. Changes made by Southgate after lackluster draw against USA: Changes need to be made, and changes need to be made quickly. But teams like England are always conservative when it comes to change. But Southgate made changes to the team after the draw against the USA. He made 4 changes from the team that played against USA for this match. He brought in Rashford, Foden, Jordan Henderson and Kyle Walker. However, the first 45 minutes against Wales were dull. Because England are not playing fast. Despite this, the defensive wall of the Welsh team remained weak. But the game heated up after the first-half ‘doze’ given to England by coach Southgate. Rashford converted a free kick in the 50th minute. But that was because the Wales goalkeeper was heading in the wrong direction. Foden also scored a goal to justify his selection in the squad and gave England plenty of inspiration. Foden’s goal was somehow assisted by Rashford. England, who are into the Round of 16, first face Senegal on Sunday. It will be a big challenge for England. While England made changes, it was surprising that Wales continued with an aging Garath Bale and Aaron Ramsey. England could have scored a couple more goals in the closing moments of the game. Calum Wilson’s brilliant shot was blocked by Wales. In the end John Stones had a golden opportunity 6 feet from goal and he wasted it by firing over the bar. The England team is not without its problems. He does not play in his place in the team. Rashford, who is supposed to play on the left, occasionally comes inside or in the middle. Likewise, Foden, who has to play on the right wing, also comes in. Harry Kane swings sluggishly. All three came to the same spot and took turns hitting each other’s ball to slow down the game. There is no Kylian Mbappe or Lionel Messi in the England team. Therefore, the team has to change its attacking strategy. Otherwise, there is a chance that the opponents will easily detect and defeat the trio of that team. There has been a criticism of the England coach that Southgate has not yet arrived at a perfect team. So far, England have to go out if they play like they did against USA that day or in the first half against Wales today when they face Senegal in the crucial knockout match on Sunday. In a sense, the Indian cricket team’s problem is the England football team’s. Just as India’s players who have taken money, fame and a bit of laziness in the IPL are kicking in the ICC series, England has players with tired legs playing in various football leagues including the English Premier League.","pubDate":"2022-11-30 09:54:12","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Several England cricketers laid low by bug on eve of Test series opener against Pakistan: Report","link":"https://www.tribuneindia.com/news/world/several-england-cricketers-laid-low-by-bug-on-eve-of-test-series-opener-against-pakistan-report-456303","keywords":null,"creator":null,"video_url":null,"description":"Rawalpindi, November 30 England's preparations for the historic Test series against Pakistan, beginning in Rawalpindi on December 1, have reportedly been \"significantly disrupted\" with at least a dozen members of the touring party down with virus. England are touring Pakistan for the first time in 17 years for a three-Test series and a report in Daily Mail said on Wednesday that less than 24 hours before the first ball is bowled, at least a dozen players in Ben Stokes' party have been laid low by the bug. The report added that it is unknown whether England will be forced to make changes to the team they had announced on Tuesday. Stokes had confirmed his team for the match on Tuesday with Liam Livingstone set for debut, but the report of several members of the side being affected could result in changes at the last minute. The report added that it's quite possible all the players could recover in time before the cricket gets going. England have employed their own chef for the tour, though the bug is not thought to be connected to food, the report said. An unnamed team spokesman has also reportedly told Daily Mail that the symptoms are not covid-related. Only five England players -- Zak Crawley, Ollie Pope, Joe Root, Harry Brook and Keaton Jennings -- who are not part of the playing XI for the opening Test, attended the optional nets session at the Rawalpindi cricket stadium on Wednesday. IANS","content":null,"pubDate":"2022-11-30 09:41:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1908405660.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 auction: Delhi Capitals to buy Cameron Green? Ricky Ponting drops big hint - Watch","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-auction-delhi-capitals-to-buy-cameron-green-ricky-ponting-drops-big-hint-watch-11725071.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023 auction: Delhi Capitals to buy Cameron Green? Ricky Ponting drops big hint - Watch","content":"Delhi Capitals (DC) head coach Ricky Ponting on Wednesday revealed that the franchise aims to buy Australia’s all-rounder Cameron Green at the upcoming IPL 2023 auction and they have set aside a “fair bit of money” for the same.The IPL 2023 mini-auction is to be held in Kochi on December 23 and it is expected that many franchises will go after Green and place high bids for him because of his all-round abilities and the fact that the 23-year-old has plenty of cricket to offer at the highest level.Moreover, being the pace-bowling all-rounder, who is always in demand, makes Green a hot property in the upcoming IPL auction and Delhi Capitals doesn’t want to let go of the opportunity to sign him as revealed by the Ponting during the first day of the opening Test between Australia and West Indies.During an interaction with Australian coach Andrew McDonald, Ponting queried about how much it will cost for Delhi Capitals to sign Cameron Green while adding that they have freed a lot of their purse for the same.“I am really interested to have an IPL conversation with you about Cam Green because I have freed up a fair bit of money at the Delhi Capitals this year,” Ponting told McDonald.Ricky Ponting, with his @delhicapitals hat on, couldn’t resist asking the Australian coach about Cam Green’s IPL availability 😂 pic.twitter.com/DwL82UuArA— 7Cricket (@7Cricket) November 30, 2022Notably, Delhi Capitals released four players and traded Shardul Thakur in exchange for Aman Khan from Kolkata Knight Riders (KKR) ahead of the IPL 2023 auction. They now have a total of INR 24.45 crores to spend in the auction.","pubDate":"2022-11-30 09:40:30","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Cameron-Green.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'After fifth six only one person crossed my mind - Yuvraj Singh': Ruturaj Gaikwad on his 7 sixes in an over","link":"https://www.firstpost.com/firstcricket/sports-news/after-fifth-six-only-one-person-crossed-my-mind-yuvraj-singh-ruturaj-gaikwad-on-his-7-sixes-in-an-over-11722731.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'After fifth six only one person crossed my mind - Yuvraj Singh': Ruturaj Gaikwad on his 7 sixes in an over","content":"Ruturaj Gaikwad joined India legend Yuvraj Singh in the exclusive club of cricketers who have hit six sixes in a single over. The Maharashtra batter achieved the feat during their Vijay Hazare Trophy quarter-final against Uttar Pradesh on 28 November at Ahmedabad’s Narendra Modi Stadium.However, Ruturaj’s innings was quite special as the right-handed batter managed to send the ball over the boundary line as many as seven times thanks to a no-ball bowled by left-arm spinner Shiva Singh. Ruturaj registered 43 runs in the over.With the exceptional batting performance, Gaikwad also etched his name in the history of the domestic circuit as it also turned out to be the joint-most expensive over of List A cricket. The Maharashtra skipper admitted that it was a dream for him to hit six sixes in an over since he watched Yuvraj Singh do the same against English pacer Stuart Broad, 15 years ago, during the 2007 T20 World Cup at Durban’s Kingsmead.Coming out of the match, Ruturaj revealed that only Yuvraj Singh’s name came to his mind after the fifth maximum and it sparked his childhood dream of reaching the milestone.“When I was quite young, I saw him hit six sixes in a row during a World Cup game. Therefore, it’s obvious that I wanted to join him, hence why I chose to go for the sixth one. I never thought any day, or in any dream, that I would be hitting six sixes in a row,” the 25-year-old batter explained. “It’s a great pleasure, a great feeling to be alongside him (Yuvraj),” Ruturaj added.🚨After the 5th SIX, @YUVSTRONG12‘s name crossed my mind: @Ruutu1331 reflects on his record-breaking feat of 7 sixes in an over! #VijayHazareTrophy2022Full Interview – https://t.co/HWQeBneZYA pic.twitter.com/IK7D2jMvhq— BCCI Domestic (@BCCIdomestic) November 29, 2022 The batter also went on to record an unbeaten double-century in the match. Coming in to open Maharashtra’s innings, the right-hander scored a massive 220 runs off 159 deliveries including 10 boundaries and 16 maximums. The captain’s knock helped his side post a mammoth 330 runs in the first innings.In reply, Uttar Pradesh opener Aryan Juyal kicked off the chase quite in style and made 159 runs off 143 balls. But the other batters could not ably support him. They were bowled out for 272 runs and endured a 58-run defeat.Maharashtra is playing the Vijay Hazare Trophy semi-final today against Assam at the Narendra Modi Stadium Ground B.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-30 09:39:39","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Ruturaj-Gaikwad.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}