{"newsArray":[{"title":"Watch: Seth Rollins left fuming, confronts fan for calling him 'fake champion' during live WWE SuperShow event","link":"https://www.hindustantimes.com/sports/wwe-news/watch-seth-rollins-left-fuming-confronts-fan-for-calling-him-fake-champion-during-live-wwe-supershow-event-101690868973124.html","keywords":null,"creator":null,"video_url":null,"description":"The incident took place after Seth Rollins’ successful title defence against his SummerSlam opponent Finn Balor","content":"WWE World Heavyweight Champion Seth Rollins has been one of the most reliable and power-packed performers in recent times. Rollins became the inaugural World Heavyweight Champion at the WWE Night of Champions in May this year. Despite this, Rollins’ wrestling career has not been devoid of criticism. Recently, at the WWE live event held in Miami, Rollins was seen confronting a fan for calling him a “fake champion.” At the WWE live event held in Miami, Rollins was seen confronting a fan for calling him a “fake champion.” Needless to say, the jibe did not go down well with ‘The Architect’ who decided to react to the fan’s remarks quite grudgingly. “Being a fighting champion is taking its toll on me. I have one guy over here, that guy right there, called me a fake champion,\" Seth Rollins responded while pointing at the fan. “I am here in your city sweating buckets, bleeding my own blood. I am far from a fake ass champion. I am a fighting champion because you and I deserve a champion that's gonna sweat and bleed his own blood,” the 37-year-old added. In the video, Seth Rollins can be seen addressing fans after the match. The clip has clocked more than 263K views, so far. The incident took place after Seth Rollins defended his title against SummerSlam opponent Finn Balor. Following his win over Balor, Rollins decided to address the crowd. As Rollins addressed the fans, the crowd kept on chanting “kick him out”. Seth Rollins was crowned the inaugural World Heavyweight Champion after defeating AJ Styles at the Night of Champions premium live event in Saudi Arabia. Rollins has so far defended his title 17 times across multiple WWE events. Roman Reigns’ supreme run as WWE Universal Champion forced Triple H to launch the World Heavyweight Championship. Seth Rollins’ topsy turvy interaction with spectators is not something new and he was previously attacked by a fan during a live show on RAW in November 2021 at the Barclays Center in Brooklyn. Elisah Spencer, 24, had tackled Rollins as the WWE star left the ring during the live show of Monday Night RAW. Security officials had to intervene to control the situation. \"It's terrifying, brother. It happened very quickly. I was mostly just reacting and hoping that our security would come and do their job. Which they did very quickly. And then was just trying to detach and move on. Hope that everybody is okay,” Rollins told TMZ following the chilling incident. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Seth Rollins Wwe","pubDate":"2023-08-01 05:59:15","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/01/1600x900/rollins_fan_1690869328140_1690869333742.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Missed opportunity’: Cummins laments series draw as Ashes era ends","link":"https://www.theage.com.au/sport/cricket/missed-opportunity-cummins-laments-series-draw-as-ashes-era-ends-20230801-p5dssq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"With just two Test regulars under 30, the selectors will look to start regenerating the team after Australia failed to with its first series in England for 22 years.","content":"London: Fireworks that failed to explode and streamers that failed to fly reflected a flat Australian team during a muted Ashes presentation which has signalled the end of an era. The celebration became a mere photo opportunity as Australia held on to the Ashes with a 2-2 series draw which captain Pat Cummins described as a “missed opportunity”, with his side failing to win a match for almost a month. After easily beating India in the World Test Championship final at the Oval and going 2-0 up with narrow wins at Edgbaston and Lord’s, Australia lost at Headingley by three wickets, were saved by rain in Manchester, and lost again at the Oval on Monday by 49 runs. “It felt like we got ourselves into some really good positions winning the first two games, and then in Headingley and this week,” Cummins said. “We got into match-winning positions and just didn’t quite capitalise. “That happens. We were out of it in Birmingham and found a way to win. Once we reflect, we will be proud we retained it. It’s been a wonderful tour. But we all turned up today hoping to get up and win 3-1.” This tour ended with the same 2-2 result as the 2019 tour, but most of the players from four years ago had the chance to return with the aim of becoming the first team in 22 years to win a series in England. However, with Travis Head and Marnus Labuschagne the only Test regulars in the team under 30, it is time for regeneration. Opposing skippers Ben Stokes and Pat Cummins. Credit: Getty The biggest question continues to revolve around David Warner, 36, as it has for much of the past year. Cummins refused to be drawn on his veteran opener’s future. “I don’t know what the future holds for anyone,” Cummins said. “There were some times he looked really good, played some really important innings. I think that is the thing about playing in England, you can get the conditions against you. He walked out sometimes under lights and clouds, and a 30 there is worth double. “The partnership [135] he put on yesterday with Uz [Khawaja] was fantastic. Probably the story of the tour. So many moments where he felt like he got on top of the game, and [England] got themselves back in.” Sunday was Warner’s second half-century of the tour in a performance across the past two months that will make it difficult for him to continue in the Test team, despite nominating this coming summer’s Sydney Test against Pakistan as his preferred swansong. He scored 285 runs at 28.5 across the five Tests, the sixth time in seven series Warner, 36, has averaged under 30. And his only century in the past nine series was his epic double hundred against South Africa at the MCG during last year’s Boxing Day Test. The selectors will need to decide whether it is fair on Warner’s replacement not to start the Australian summer at the beginning with the Pakistan series. Reserve batsmen on this tour Marcus Harris and Matthew Renshaw are the obvious candidates to replace him. Both have played Test cricket before without securing a place. The loss of spinner Nathan Lyon, 35, who suffered a serious calf strain during the second Test, was significant, but it gave more opportunities for his impressive young protégé Todd Murphy, 22, particularly during the fifth Test. Murphy finished with seven wickets at an average of under 26 from two Tests. “It’s pretty clear just how important Nath is in all conditions,” Cummins said. “We probably felt that at times at Manchester, not having a spinner out there. The change of pace, someone who you can feel like they can control the pace of the game when the wicket is flat and pace bowlers can’t as well. “This week, Todd did a fantastic job. He took four [wickets] in the second innings, and was always asking questions. It felt like he could get breakthroughs when the wicket didn’t have much on offer. “I was really impressed with Todd. Hopefully, Nathan has plenty more cricket left in him. But Todd is there ready to go, which is great.” Australia will also have to blood imposing young West Australian fast bowler Lance Morris this summer to freshen up an ageing pace attack. Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-08-01 05:47:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘Missed opportunity’: Cummins laments series draw as Ashes era ends","link":"https://www.watoday.com.au/sport/cricket/missed-opportunity-cummins-laments-series-draw-as-ashes-era-ends-20230801-p5dssq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"With just two Test regulars under 30, the selectors will look to start regenerating the team after Australia failed to with its first series in England for 22 years.","content":"London: Fireworks that failed to explode and streamers that failed to fly reflected a flat Australian team during a muted Ashes presentation which has signalled the end of an era. The celebration became a mere photo opportunity as Australia held on to the Ashes with a 2-2 series draw which captain Pat Cummins described as a “missed opportunity”, with his side failing to win a match for almost a month. After easily beating India in the World Test Championship final at the Oval and going 2-0 up with narrow wins at Edgbaston and Lord’s, Australia lost at Headingley by three wickets, were saved by rain in Manchester, and lost again at the Oval on Monday by 49 runs. “It felt like we got ourselves into some really good positions winning the first two games, and then in Headingley and this week,” Cummins said. “We got into match-winning positions and just didn’t quite capitalise. “That happens. We were out of it in Birmingham and found a way to win. Once we reflect, we will be proud we retained it. It’s been a wonderful tour. But we all turned up today hoping to get up and win 3-1.” This tour ended with the same 2-2 result as the 2019 tour, but most of the players from four years ago had the chance to return with the aim of becoming the first team in 22 years to win a series in England. However, with Travis Head and Marnus Labuschagne the only Test regulars in the team under 30, it is time for regeneration. Opposing skippers Ben Stokes and Pat Cummins. Credit: Getty The biggest question continues to revolve around David Warner, 36, as it has for much of the past year. Cummins refused to be drawn on his veteran opener’s future. “I don’t know what the future holds for anyone,” Cummins said. “There were some times he looked really good, played some really important innings. I think that is the thing about playing in England, you can get the conditions against you. He walked out sometimes under lights and clouds, and a 30 there is worth double.","pubDate":"2023-08-01 05:47:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘We Decided To Meet Up...’ Ben Stokes Issues Clarification After Allegations Surfaced About England and Australia Players Not Getting Together Following Fifth Ashes 2023 Test","link":"https://www.latestly.com/socially/sports/cricket/we-decided-to-meet-up-ben-stokes-issues-clarification-after-allegations-surfaced-about-england-and-australia-players-not-getting-together-following-fifth-ashes-5307739.html","keywords":null,"creator":null,"video_url":null,"description":"It was alleged that the Australian players waited for England to wrap up things up quickly so that they could go for a drink after the fifth and last Ashes 2023 test finished in a draw. The five-Test series finished 2-2 with Australia retaining the urn.","content":"Ben Stokes issued a clarification after allegations surfaced about the England and Australian teams not getting together for a drink after the fifth and final Ashes 2023 Test. Stokes, taking to social media, wrote that it took time for them to wrap up things because of 'multiple last time event’s', potentially talking about Stuart Broad and Moeen Ali's retirement. It was alleged that the Australian players waited for their English counterparts to have a drink together but there wasn't any response from the latter. Stokes also wrote that they did meet up eventually. \"We decided to meet up in the nightclub rather than the dressing room,\" he wrote. ‘If Stokesy Messages Me Again, I Am Going To Delete It’ Moeen Ali Confirms Retirement From Test Cricket After ENG vs AUS Ashes 2023 Ends in 2–2 Draw. Ben Stokes Clarifies England and Australia Players Did Meet After Ashes 2023 To clarify… Our wrap took longer than expected because of multiple last time event’s. We decided to meet up in the night club rather than the dressing room 🙌🙌🙌🙌🙌🙌🙌🙌 https://t.co/jJ4Qw3uCnm — Ben Stokes (@benstokes38) August 1, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-01 05:22:15","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket Australia Congratulates Pat Cummins & His Team for WTC 2023 Title and Retaining Ashes Urn","link":"https://www.latestly.com/sports/cricket/cricket-australia-congratulates-pat-cummins-his-team-for-wtc-2023-title-and-retaining-ashes-urn-5307692.html","keywords":null,"creator":null,"video_url":null,"description":"The Ashes and World Test Championship victories comprised an exciting and physically demanding period in which the Australians played six Test matches in eight weeks, Cricket Australia said in a release on Tuesday.","content":"Cricket Australia (CA) on Tuesday congratulated the Australian senior men’s team on its successful tour of England during which it won the World Test Championship (WTC) title for the first time. On the three-month-long tour of England, the Australians completed a unique double -- winning their maiden World Test Championship title and retaining the Ashes. The Ashes series finished tied 2-2 after England won the fifth Test at The Oval on Monday. ‘If Stokesy Messages Me Again, I Am Going To Delete It’ Moeen Ali Confirms Retirement From Test Cricket After ENG vs AUS Ashes 2023 Ends in 2–2 Draw The Ashes and World Test Championship victories comprised an exciting and physically demanding period in which the Australians played six Test matches in eight weeks, Cricket Australia said in a release on Tuesday. “We are all enormously proud of Pat Cummins and his team for all they have achieved on their tour of England,\" Nick Hockley, Cricket Australia, chief executive, said: “The squad was determined to return with the World Test Championship trophy and the Ashes, and to achieve both objectives in often difficult conditions against world-class opposition and in front of extremely passionate and occasionally hostile crowds, is a credit to all the players and support staff,\" he was quoted as saying in a release. Hockley said the series lived up to the billing of one of the greatest rivalries in cricket. Magic Again! Stuart Broad Switches Bails And Dismisses Alex Carey Next Ball During ENG vs AUS Ashes 2023 5th Test (Watch Video) “Both the men's and women's Ashes have been epic series that has captured the imagination of the cricketing world and lived up to the billing of one of the greatest rivalries in world sport. They will no doubt inspire lots of boys and girls to pick up a bat and ball this summer,\" he said. He also congratulated the England team for its enterprising play in the series. “I would also like to congratulate England, whose enterprising play has helped to make these such memorable series, and particularly retiring fast-bowler Stuart Broad who has been such a formidable opponent and competitor over many years,\" he added. Hockley said Cricket Australia is already looking forward to hosting England for the return series in 2025-26. (The above story first appeared on LatestLY on Aug 01, 2023 10:43 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-01 05:15:12","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"East Zone vs West Zone, Deodhar Trophy 2023 Live Streaming: কখন কোথায় কিভাবে দেখবেন দেওধর ট্রফির হাড্ডাহাড্ডি লড়াই, জেনে নিন এক নজরে","link":"https://bangla.latestly.com/sports/east-zone-vs-west-zone-deodhar-trophy-2023-live-streaminghow-to-watch-east-zone-vs-west-zone-deodhar-trophy-2023-live-streaming-online-get-free-live-telecast-of-ez-vs-wz-cricket-match-with-time-in-231455.html","keywords":null,"creator":null,"video_url":null,"description":"ইতিমধ্যে পশ্চিমাঞ্চল তাদের শেষ ম্যাচে উত্তরাঞ্চলকে ছয় উইকেটে হারিয়ে এই ম্যাচ খেলতে নেমেছে অপরদিকে শেষ ম্যাচে দক্ষিণাঞ্চলের কাছে হেরেছে পূর্বাঞ্চল। তাই ফাইনালে উঠতে গেলে পূর্বাঞ্চলকে জিততেই হবে।","content":"আজ দেওধর ট্রফির খেলায় মুখোমুখি পূর্বাঞ্চল ও পশ্চিমাঞ্চল। ইতিমধ্যে পশ্চিমাঞ্চল তাদের শেষ ম্যাচে উত্তরাঞ্চলকে ছয় উইকেটে হারিয়ে এই ম্যাচ খেলতে নেমেছে অপরদিকে শেষ ম্যাচে দক্ষিণাঞ্চলের কাছে হেরেছে পূর্বাঞ্চল। তাই ফাইনালে উঠতে গেলে পূর্বাঞ্চলকে জিততেই হবে। পন্ডিচেরীর ২নং গ্রাউন্ডে সকাল ৯টায় শুরু হবে এই খেলা। দুই দলের তালিকায় একবার চোখ বুলিয়ে নেওয়া যাক। পূর্বাঞ্চল: সৌরভ তিওয়ারি (অধিনায়ক), অভিষেক পোড়েল (উইকেটকিপার), অভিমন্যু ঈশ্বরণ, রিয়ান পরাগ, শুভ্রাংশু সেনাপতি, বিরাট সিং, আকাশ দীপ, মণিশঙ্কর মুরাসিংহ, শাহবাজ নাদিম, উত্কর্ষ সিং, অভিনোভ চৌধুরী, ঋষব দাস, মুখতার হোসেন, সুদীপ কুমার ঘরামি, কুমার কুশাগ্র। পশ্চিমাঞ্চল: প্রিয়ঙ্ক পাঞ্চাল (অধিনায়ক), হারভিক দেশাই, অঙ্কিত বাওনে, রাহুল ত্রিপাঠী, পৃথ্বী শ, সরফরাজ খান, হেট প্যাটেল, শিবম দুবে, রাজবর্ধন হাঙ্গেরকর, শামস মুলানি, অতীত শেঠ, পার্থ ভুত, সমর্থ ব্যাস, চিন্তন গজা, আরজান নাগওয়াসওয়ালা। কখন থেকে শুরু হবে পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম দক্ষিণাঞ্চল, দেওধর ট্রফির ম্যাচ শুরু হবে ভারতীয় সময় সকাল ৯ঃ০০টায়। জেনে নিন টিভিতে কোথায় সরাসরি দেখবেন পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি ভারতে টেলিভিশনে সম্প্রচার করা হবে না। জেনে নিন অনলাইনে কোথায় সরাসরি দেখবেন পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি অনলাইনে সরাসরি সম্প্রচার করা হবে বিসিসিআই অ্যাপে","pubDate":"2023-08-01 05:04:28","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"India vs West Indies, 3rd ODI: Here's how to watch it live online and on TV for free","link":"https://economictimes.indiatimes.com/news/sports/india-vs-west-indies-3rd-odi-heres-how-to-watch-its-live-streaming-for-free/articleshow/102298873.cms","keywords":null,"creator":null,"video_url":null,"description":"The match starts at 7 pm (IST) and the toss at 6.30 pm. The winner of the match will win the series. The match will also be the first men’s ODI game at the Brian Lara Stadium.","content":"Synopsis The match starts at 7 pm (IST) and the toss at 6.30 pm. The winner of the match will win the series. The match will also be the first men’s ODI game at the Brian Lara Stadium. PTI In the second match at Kensington Oval, India lost by six wickets. India will take on the West Indies in the third and final one-day international match in the three-match series later today. With the series at a 1-1 draw now, the Men in Blue will certainly look to seal the series with a win in the 3rd ODI match, which is to be played at Brian Lara Stadium, Tarouba, Trinidad. The third ODI is to be played today (August 1) and the good news for cricket lovers back home is that they can watch it for free online. The match is to start at 7 pm (Indian Standard Time) later today, and the toss for the same will take place at 6.30 pm. The live streaming of the match will be available on Jiocinema 's website as well as on the app. If you don't want to spend data on it, then you can watch it on TV on Doordarshan Sports (DD Sports) channel. The third ODI between the West Indies and India has become crucial—something of a final—as the series is now at a 1-1 draw. So whoever wins the match, will win the series as well. In the second ODI, the Indians were outplayed by the Indies. In the second match at Kensington Oval, India lost by six wickets. India were bowled out for 181, with the West Indies chasing down the target in 36.4 overs with six wickets in hand. The decider will also be the first time the Brian Lara Stadium will be hosting a men’s ODI game after having hosted a men’s T20I game between these two teams last year. Probable Teams: West Indies: Shai Hope (captain), Rovman Powell (vice-captain), Alick Athanaze, Yannic Cariah, Keacy Carty, Dominic Drakes, Shimron Hetmyer, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Jayden Seales, Romario Shepherd, Kevin Sinclair, Oshane Thomas. India: Rohit Sharma (captain), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Surya Kumar Yadav, Sanju Samson (wicket-keeper), Ishan Kishan (wicket-keeper), Hardik Pandya (vice-captain), Shardul Thakur, Ravindra Jadeja, Axar Patel, Yuzvendra Chahal, Kuldeep Yadav, Jaydev Unadkat, Umran Malik, Mukesh Kumar. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Tuesday, 01 Aug, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies & Economy Smart Investing More Binny Checks Out; Walmart Stake in Flipkart Hits 80% Walmart’s shareholding in Flipkart is likely to rise to around 80%, strengthening its ownership of the Indian ecommerce firm, as cofounder Binny Bansal and other minority investors sell more shares to the Bentonville, US-based retailer, according to regulatory filings in Singapore, accessed by ET. Piyush Goyal may Meet Top Ecomm Execs Tomorrow The commerce and industry ministry has invited executives of ecommerce firms including online marketplaces, food-delivery companies, logistics and quick commerce platforms for consultations before finalising its much-awaited National Ecommerce Policy, several people aware of the matter told ET. Niti Moots Mining Sops to Help Charge up Li-ion Battery Manufacturing The Niti Aayog has proposed royalties and tax benefits, production-linked incentive (PLI) schemes and other measures to support the processing and refining of critical minerals used in lithium-ion batteries as part of efforts aimed at promoting electric vehicles and meeting net-zero goals. Read More News on india west indies 3rd odi india cricket live jiocinema dd sport virat (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Aviation Q1 preview: Street expects IndiGo to serve record profit, SpiceJet’s menu card to be low on flavour 11 mins read Investing M&M’s tryst with banking puts focus on RBL Bank. But investors must prepare for a long journey. 9 mins read Under the lens Lessons from the doused Wagner rebellion: why private armies can be a ticking bomb for governments 10 mins read Subscribe to ETPrime","pubDate":"2023-08-01 05:01:58","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-174136,resizemode-4,msid-102298873/india-vs-west-indies-3rd-odi-heres-how-to-watch-it-live-online-and-on-tv-for-free.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Calem Nieuwenhof primed for Hearts battles as he goes to dodging sharks down under to fulfilling 'dream' at Tynecastle","link":"https://www.dailyrecord.co.uk/sport/football/calem-nieuwenhof-primed-hearts-battles-30597299","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Michael Gannon)"],"video_url":null,"description":"The new Hearts signing reckons he will learn a lot from Steven Naismith and wants to push for a World Cup spot.","content":"Calem Nieuwenhof Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Calem Nieuwenhof reckons he’ll have no trouble negotiating the choppy waters of Scottish football after growing up swerving great white sharks. The Hearts new boy spent his youth on the water but swapped the surf for turf as he made waves as a footballer in Australia. Nieuwenhof was thrown in at the deep end for his debut against Leeds on Sunday but managed to stay afloat and is confident he won’t sink in Scotland. The former Western Sydney Wanderers star might have grown up not far from Bondi Beach but his dad’s Dutch DNA gave him a love for football. And a visit to Tynecastle as a kid in 2018 made such an impression that he was thrilled to make his return permanent – even if Gorgie is different world to what he’s used to. Read More Related Articles Celtic and Rangers in Viaplay Cup TV double header as schedulers solve Hearts and Hibs headache Read More Related Articles Final SPFL Premiership table predicted amid Celtic and Rangers title tussle and tight relegation dogfight Nieuwenhof said: “I was pretty typical growing up. I have lived in one or two suburbs my whole life in the northern beaches of Sydney. I used to be a big surfer. Surfing here? Yeah, it will be a bit colder so I think I’d better remember the wetsuit, for sure! Were there sharks? Yeah, they might have prepared me a little bit for coming over here and playing in front of these fans! “There were so many different sports. Growing up I played football, surfed a fair bit. I mean my family is a pretty big surfing family. I played cricket, did Nippers (a club for young surf lifesavers) and a bit of touch football, a bit of everything. In Australia my dad played football so growing up there were never really any other options for me. “As soon as I was old enough to walk, I was kicking a ball around and as soon as I could I got into the local club team and I fell in love with the game. I just grew up playing football and now I’m lucky enough to come and play in the European leagues. That is every young player’s dream in Australia and it’s something I’m really proud of. I’m looking forward to making the most of it.” Nieuwenhof revealed he got a taste of Tynie five years ago – and he jumped at the chance to come back. He said: “I came here in 2018 as part of a football tour around the UK. I remember pretty vividly that we came to a Hearts game – I think it was against Dundee – and I remember how energetic and passionate the fans were. “That was the thing that really stood out for me. The stadium as well, I love it. It is such an awesome stadium. It was good to see them come out for the Leeds game and I’m sure they are going to get behind us this season. That’s something I’m looking forward to. The reception was awesome. I couldn’t believe how many rocked up for a pre-season friendly so I’ve obviously come to a really good club where the fanbase is massive.” Calem Nieuwenhof Nieuwenhof is following a familiar path with plenty of Aussies soaring in Scotland. He’ll have Socceroos Kye Rowles, Cammy Devlin and Nathaniel Atkinson for company in Gorgie and he’s hoping to be the next man from Down Under to make an impact in these parts – so he can blast his way towards the next World Cup . He said: “Talking to a few of the boys back home – I played with Olly Bozanic last season and he spoke nothing but highly about his time here and the league – that helped me make a good decision. I know that there are so many Australians who have come to Scotland and they are all doing well so it has proven to be a really good step forward. “It has shown to be the next level from the A League to come here. The World Cup is something I aspire to, 100 per cent. All the boys in the team now are in the Socceroos and that’s somewhere I want to go. That made my decision to come here even easier because I know that if I come here and perform well I could get a national team call-up. I know it’s now on me.” Nieuwenhof looked the part in the 1-0 defeat to Leeds on Sunday but Hearts are still a work in progress. The 22-year-old said: “It is a different game style than in Australia and this is my first week training with the boys. I definitely have a lot of learning to do and I’m going to learn more from Steven Naismith and the other coaches about how they want us to play. “That is something we can take forward into the league because I know we want to be a team that plays with the ball and dominates other teams. That is a team I want to play in so that is really positive for me. It is very different from Australia and I am being thrust right into it. “That is a real positive in my eyes, the amount of games that we play over here. That is something I’m looking forward to, getting a number of games under my belt and showing good consistency.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Hearts FC Steven Naismith Leeds United FC World Cup","pubDate":"2023-08-01 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30588553.ece/ALTERNATES/s615/0_JS307006161.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Novak Djokovic makes surprising addition to US Open 2023 plans days after raising health concerns post Alcaraz loss","link":"https://www.hindustantimes.com/sports/tennis/novak-djokovic-makes-surprising-addition-to-us-open-2023-plans-raising-health-concerns-post-carlos-alcaraz-loss-101690863896391.html","keywords":null,"creator":null,"video_url":null,"description":"Novak Djokovic is all set to return to U.S soil for the first time in two years after having missed last year's North American hardcourt swing","content":"Novak Djokovic is all set to return to U.S soil for the first time in two years as he revealed Cincinnati Masters 1000 as his only plan for preparation for the 2023 US Open. But on Tuesday, Djokovic left tennis world surprised when he made a new addition to his plans for the final Grand Slam of the calendar year just days after raising health concerns post that heartbreaking loss to Carlos Alcaraz in the Wimbledon final. Novak Djokovic has left everyone surprised with his new US Open plan(REUTERS) Djokovic has his name in the entry list for the first Masters 1000 event of the US Open tune-up - Rogers Cup in Toronto - but he announced his withdrawal from the event last week citing fatigue, thereby extending his stay away from tennis action since that five-setter loss at the SW19 a little over a fortnight back. However, he still had his intentions for an appearance in the Cincinnati Masters, which he had earlier revealed as the only tournament he would appear before heading towards the Flushing Meadows in New York. ALSO READ: Watch: Tennis player collapses during Citi Open match, forced to retire weeks after alarming Wimbledon incident On Tuesday, the Serb took everyone by surprise when he announced that in addition to the singles event, he will also compete in the doubles category alongside compatriot Nikola Cacic, who is presently ranked 57 in the world and has won three ATP titles in his career - Chengdu 2019, Montpellier 2020 and Buenos Aires 2021. Djokovic, meanwhile, has only one ATP doubles title to show, which he had won 13 years back at the AEGON Championships and has a career record of 62 wins and 77 losses This will be the third time that Djokovic will be pairing with Cacic for doubles, but all them happened representing Serbia in team events. The first was in 2021 in ATP Cup (lost to Germany's Jan-Lennard Struff and Alexander Zverev), followed by two in 2022 Davis Cup where they lost to German pair of Tim Puetz and Kevin Krawietz before beating Kazakhstan's Andrey Golubev and Aleksandr Nedovyesov. Djokovic has been more a handful of appearances in the doubles category in recent times - with Vasek Pospisil (Adelaide 1 in 2023), Erlich (Tel Aviv in 2022), Filip Krajinovic (Paris Masters 1000 in 2021), Carlos Gomez- Herrera (Mallorca in 2021, finalists) and Marin Cilic (Dubai in 2020). At the Cincinnati Masters, it will be his third appearance in the category, the last being in 2019, where he had suffered a first-round exit alongside compatriot Janko Tipsarević. He had however reached the quarters in Cincinnati back in 2007 with Nenad Zimonjić as his partner. The doubles entry list at the 2023 Cincinnati Masters also features Andrey Rublev/Max Purcell, Hubert Hurkacz/Mektic Pavic, Alexander Bublik/Adrian Mannarino and Stefanos Tsitsipas/Davidovich Fokina as well. Return to U.S soil Djokovic had missed last year's North American hardcourt swing owing to his stance on Covid vaccination with disallowed him entry into America as per the rules of the government for international travellers. It in fact saw him miss the 2022 US Open as well. Djokovic has won the US Open trophy thrice in his career, the last being in 2018. He did have the chance in 2021 when he had reached the final with a win away from a monumental Calendar Slam before losing in straight sets to Daniil Medvedev. Overall, he has a 81-13 record in New York with eight finals and 12 appearances in semi-final. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Novak Djokovic Carlos Alcaraz Us Open","pubDate":"2023-08-01 04:58:57","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/01/1600x900/TENNIS-AUSOPEN--446_1674565131781_1674565131781_1690864045869.JPG","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Wenn \"Kleinherne\" und \"Nüsken\" zu Zungenbrechern werden","link":"https://www.sportschau.de/fussball/fifa-frauen-wm/wm-melbourne-australien-deutsch-lernen-100.html","keywords":null,"creator":null,"video_url":null,"description":"Jessika Rabe arbeitet seit mehr als 20 Jahren als Deutschlehrerin in Melbourne. Die WM in Australien verfolgt sie genau - und bringt sie auch in den Unterricht.","content":"Stand: 01.08.2023 06:53 Uhr Die sportbegeisterte Jessika Rabe arbeitet seit mehr als 20 Jahren als Deutschlehrerin in Melbourne. Dass die Fußball-WM nun in Australien stattfindet, freut sie sehr. Für die gebürtige Niedersächsin eine klare Sache: Das deutsche Nationalteam ist auch Unterrichtsthema. \"Sophia Klien-hörne\" - \"Kleinherne, fantastisch, wunderbar.\" Und: \"Sjo-key Nuss-ken\" - \"Nüsken, fantastisch - well done.\" Diese Deutschstunde an der Mentone Grammar School in Melbourne ist etwas besonderes. Für die Siebt- und Achtklässler steht die Fußball-WM der Frauen in Down Under auf dem Stundenplan. Und Lehrerin Jessika Rabe lobt ihre Schülerinnen und Schüler. Das Goethe-Institut Australien hat extra Unterrichtsmaterialien erstellt, in denen es um die deutsche Nationalmannschaft geht. Inklusive Namen, die für die normalerweise ja nur Englisch sprechenden Zwölf- bis 14-Jährige gar nicht so einfach auszusprechen sind. Jessika Rabe kommt aus Niedersachsen, aufgewachsen ist sie in Nienhagen in der Nähe der Stadt Celle. Sport hat die Lehrer schon immer begeistert. Als sie Ende der 1990er-Jahre für einen längere Zeit in Australien war, lernte sie ihren heutigen Mann Adam kennen. Nach der Jahrtausendwende zog sie zu ihm nach Melbourne. Heute hat das Paar drei Kinder, die zweisprachig aufwachsen. An der Mentone Grammar School ist Deutsch für viele Kinder die erste Fremdsprache. Das Urteil fällt gemischt aus: \"Ick finde Deutsch supa\", sagt Holly und lacht. \"Ich finde Deutsch kompliziert\", sagt Lukas. Luca kann mit Abstand am besten Deutsch. \"Mein Papa ist deutsch, er hat es mir beigebracht\", erklärt der Junge. Alternative zum Deutschunterricht ist vor allem Chinesisch, das an der Privatschule auch im Präsenzunterricht angeboten wird. Spanisch oder Französisch gibt es als E-Learningkurse. So lernen auch die 15-jährige Lilly und ihr kleiner Bruder Jonty die Sprache ihrer Mutter - allerdings zu Hause. Denn an ihrer Schule gibt es keinen Deutschunterricht. Jessika will aber keinen Druck ausüben, weil sie weiß, dass ihre Kinder mit dem normalen Schulunterricht meist schon genug ausgelastet sind. Lilly war für ein paar Wochen in Deutschland an einer Schule. Ihre vier Jahre ältere Schwester Yani hat bereits ihr Abitur gemacht und an einem Schüleraustausch teilgenommen. \"Wir sind deutsch, aber das ist bei uns kein riesiges Ding\", sagt Yani. \"Unsere Freunde würden nur auch gerne eine andere Sprache so gut sprechen können.\" In Australien leben über 100.000 Deutsche. Rund ein Fünftel davon in Melbourne - die Stadt hat damit die größte deutsche Gemeinde des Landes. Melbourne ist multikulturell - auch viele Griechen, Italiener oder Schotten hat es im 20. Jahrhundert hierher verschlagen. \"Genau das mag ich an meiner Heimatstadt\", sagt Vater Adam, der als Professor für Unternehmertum und Innovationen arbeitet. Das Spiel der DFB-Elf gegen Marokko in Melbourne schaute sich Jessica Rabe mit ihrer Familie im Stadion an. Bei ihm stehen eigentlich Australian Football, Cricket, Rugby, Golf, Tennis und auch Leichtathletik vor dem europäischen Soccer, den eigentlich nur Jessika und Jonty interessiert verfolgen. Beim ersten deutschen Spiel in Melbourne war dann aber doch die ganze Familie im Stadion - und nach dem 6:0-Erfolg gegen Marokko begeistert. Und auch die zweite Chance auf ein deutsches Spiel haben sie sich nicht entgehen lassen: Sie haben Karten für das Achtelfinale am 8. August. Nach der 1:2-Niederlage gegen Kolumbien sieht es aber eher danach aus, dass die DFB-Frauen - wenn überhaupt - in der Runde der besten 16 in Adelaide antreten müssen. \"Wenn wir schon nicht Deutschland zu sehen bekommen, dann zumindest Kolumbien mit Linda Caicedo. Sie wird der nächste Superstar\", ist Jessika überzeugt. So ganz hat sich von Gedanken, beim deutschen Achtelfinale dabei zu sein, allerdings noch nicht verabschiedet. \"Die DFB-Frauen müssen sich ein Beispiel an Australien nehmen, alles ist möglich. Sie müssen es genauso machen wie Australien gegen Kanada\", hofft die 51-Jährige, die den 4:0-Erfolg der \"Matildas\" zusammen mit der ganzen Familie vor dem Fernseher verfolgt hat. \"Wir haben wie verrückt gejubelt.\" 31.07.2023 Nach der ersten Niederlage bei der WM bringt die deutschen Fußballerinnen nur ein eigener Sieg im letzten Gruppenspiel sicher ins Achtelfinale. Doch es gibt noch andere Szenarien fürs Weiterkommen. mehr In Melbourne wird trotzdem weiter Deutsch gelernt. \"Hört genau zu: Wie heißt die Spielerin und was ist ihr Spitzname\", fragt Lehrerin Jessika Rabe ihre Schülerinnen und Schüler. Das Goethe-Instut hat Video-Interviews mit Jule Brand, Nicole Anyomi, Nüsken, Kleinherne und Maximiliane Rall, die es nicht in den WM-Kader geschafft hat, geführt. Auf Fragebögen sollen die richtigen Antworten angekreuzt werden. \"Ich glaube, sie hat 2000 gesagt\", vermutet Anish bei der Frage nach dem Geburtsdatum von Anyomi. Außerdem geht es um Hobbys, Musik oder auch das Lieblingsessen. Jessika Rabe ist sehr zufrieden mit den WM-Unterrichtsstunden. \"Die sind sehr gut angekommen. Natürlich lernen die Schülerinnen und Schüler viel lieber so etwas über die deutsche Kultur als Verben zu konjugieren oder sich mit dem Präteritum zu beschäftigen\", sagt sie lachend. 31.07.2023 WM-Gastgeber Australien hat das \"Alles-oder-nichts\"-Spiel gegen Kanada überraschend klar dominiert und bleibt nach einem mitreißenden Auftritt im Turnier. mehr analyse 30.07.2023 Nach vorne gelang den Spielerinnen von Bundestrainerin Martina Voss-Tecklenburg fast nichts. Und in zwei Situationen sahen sie auch hinten schlecht aus. mehr 31.07.2023 Das zweite WM-Gruppenspiel brachte neben der bitteren Niederlage auch eine neue Verletzte. Dafür steht gegen Südkorea Marina Hegering wieder zur Verfügung. mehr Dieses Thema im Programm: Das Erste | Sportschau FIFA Frauen WM | 02.08.2023 | 08:35 Uhr","pubDate":"2023-08-01 04:53:14","image_url":null,"source_id":"sportschau","category":["sports"],"country":["germany"],"language":"german"},{"title":"Watch: Seth Rollins left fuming, confronts fan for calling him 'fake champion' during live WWE SuperShow event","link":"https://www.hindustantimes.com/sports/wwe-news/watch-seth-rollins-left-fuming-confronts-fan-for-calling-him-fake-champion-during-live-wwe-supershow-event-101690868973124.html","keywords":null,"creator":null,"video_url":null,"description":"The incident took place after Seth Rollins’ successful title defence against his SummerSlam opponent Finn Balor","content":"WWE World Heavyweight Champion Seth Rollins has been one of the most reliable and power-packed performers in recent times. Rollins became the inaugural World Heavyweight Champion at the WWE Night of Champions in May this year. Despite this, Rollins’ wrestling career has not been devoid of criticism. Recently, at the WWE live event held in Miami, Rollins was seen confronting a fan for calling him a “fake champion.” At the WWE live event held in Miami, Rollins was seen confronting a fan for calling him a “fake champion.” Needless to say, the jibe did not go down well with ‘The Architect’ who decided to react to the fan’s remarks quite grudgingly. “Being a fighting champion is taking its toll on me. I have one guy over here, that guy right there, called me a fake champion,\" Seth Rollins responded while pointing at the fan. “I am here in your city sweating buckets, bleeding my own blood. I am far from a fake ass champion. I am a fighting champion because you and I deserve a champion that's gonna sweat and bleed his own blood,” the 37-year-old added. In the video, Seth Rollins can be seen addressing fans after the match. The clip has clocked more than 263K views, so far. The incident took place after Seth Rollins defended his title against SummerSlam opponent Finn Balor. Following his win over Balor, Rollins decided to address the crowd. As Rollins addressed the fans, the crowd kept on chanting “kick him out”. Seth Rollins was crowned the inaugural World Heavyweight Champion after defeating AJ Styles at the Night of Champions premium live event in Saudi Arabia. Rollins has so far defended his title 17 times across multiple WWE events. Roman Reigns’ supreme run as WWE Universal Champion forced Triple H to launch the World Heavyweight Championship. Seth Rollins’ topsy turvy interaction with spectators is not something new and he was previously attacked by a fan during a live show on RAW in November 2021 at the Barclays Center in Brooklyn. Elisah Spencer, 24, had tackled Rollins as the WWE star left the ring during the live show of Monday Night RAW. Security officials had to intervene to control the situation. \"It's terrifying, brother. It happened very quickly. I was mostly just reacting and hoping that our security would come and do their job. Which they did very quickly. And then was just trying to detach and move on. Hope that everybody is okay,” Rollins told TMZ following the chilling incident. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Seth Rollins Wwe","pubDate":"2023-08-01 05:59:15","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/01/1600x900/rollins_fan_1690869328140_1690869333742.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Missed opportunity’: Cummins laments series draw as Ashes era ends","link":"https://www.theage.com.au/sport/cricket/missed-opportunity-cummins-laments-series-draw-as-ashes-era-ends-20230801-p5dssq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"With just two Test regulars under 30, the selectors will look to start regenerating the team after Australia failed to with its first series in England for 22 years.","content":"London: Fireworks that failed to explode and streamers that failed to fly reflected a flat Australian team during a muted Ashes presentation which has signalled the end of an era. The celebration became a mere photo opportunity as Australia held on to the Ashes with a 2-2 series draw which captain Pat Cummins described as a “missed opportunity”, with his side failing to win a match for almost a month. After easily beating India in the World Test Championship final at the Oval and going 2-0 up with narrow wins at Edgbaston and Lord’s, Australia lost at Headingley by three wickets, were saved by rain in Manchester, and lost again at the Oval on Monday by 49 runs. “It felt like we got ourselves into some really good positions winning the first two games, and then in Headingley and this week,” Cummins said. “We got into match-winning positions and just didn’t quite capitalise. “That happens. We were out of it in Birmingham and found a way to win. Once we reflect, we will be proud we retained it. It’s been a wonderful tour. But we all turned up today hoping to get up and win 3-1.” This tour ended with the same 2-2 result as the 2019 tour, but most of the players from four years ago had the chance to return with the aim of becoming the first team in 22 years to win a series in England. However, with Travis Head and Marnus Labuschagne the only Test regulars in the team under 30, it is time for regeneration. Opposing skippers Ben Stokes and Pat Cummins. Credit: Getty The biggest question continues to revolve around David Warner, 36, as it has for much of the past year. Cummins refused to be drawn on his veteran opener’s future. “I don’t know what the future holds for anyone,” Cummins said. “There were some times he looked really good, played some really important innings. I think that is the thing about playing in England, you can get the conditions against you. He walked out sometimes under lights and clouds, and a 30 there is worth double. “The partnership [135] he put on yesterday with Uz [Khawaja] was fantastic. Probably the story of the tour. So many moments where he felt like he got on top of the game, and [England] got themselves back in.” Sunday was Warner’s second half-century of the tour in a performance across the past two months that will make it difficult for him to continue in the Test team, despite nominating this coming summer’s Sydney Test against Pakistan as his preferred swansong. He scored 285 runs at 28.5 across the five Tests, the sixth time in seven series Warner, 36, has averaged under 30. And his only century in the past nine series was his epic double hundred against South Africa at the MCG during last year’s Boxing Day Test. The selectors will need to decide whether it is fair on Warner’s replacement not to start the Australian summer at the beginning with the Pakistan series. Reserve batsmen on this tour Marcus Harris and Matthew Renshaw are the obvious candidates to replace him. Both have played Test cricket before without securing a place. The loss of spinner Nathan Lyon, 35, who suffered a serious calf strain during the second Test, was significant, but it gave more opportunities for his impressive young protégé Todd Murphy, 22, particularly during the fifth Test. Murphy finished with seven wickets at an average of under 26 from two Tests. “It’s pretty clear just how important Nath is in all conditions,” Cummins said. “We probably felt that at times at Manchester, not having a spinner out there. The change of pace, someone who you can feel like they can control the pace of the game when the wicket is flat and pace bowlers can’t as well. “This week, Todd did a fantastic job. He took four [wickets] in the second innings, and was always asking questions. It felt like he could get breakthroughs when the wicket didn’t have much on offer. “I was really impressed with Todd. Hopefully, Nathan has plenty more cricket left in him. But Todd is there ready to go, which is great.” Australia will also have to blood imposing young West Australian fast bowler Lance Morris this summer to freshen up an ageing pace attack. Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-08-01 05:47:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘Missed opportunity’: Cummins laments series draw as Ashes era ends","link":"https://www.watoday.com.au/sport/cricket/missed-opportunity-cummins-laments-series-draw-as-ashes-era-ends-20230801-p5dssq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"With just two Test regulars under 30, the selectors will look to start regenerating the team after Australia failed to with its first series in England for 22 years.","content":"London: Fireworks that failed to explode and streamers that failed to fly reflected a flat Australian team during a muted Ashes presentation which has signalled the end of an era. The celebration became a mere photo opportunity as Australia held on to the Ashes with a 2-2 series draw which captain Pat Cummins described as a “missed opportunity”, with his side failing to win a match for almost a month. After easily beating India in the World Test Championship final at the Oval and going 2-0 up with narrow wins at Edgbaston and Lord’s, Australia lost at Headingley by three wickets, were saved by rain in Manchester, and lost again at the Oval on Monday by 49 runs. “It felt like we got ourselves into some really good positions winning the first two games, and then in Headingley and this week,” Cummins said. “We got into match-winning positions and just didn’t quite capitalise. “That happens. We were out of it in Birmingham and found a way to win. Once we reflect, we will be proud we retained it. It’s been a wonderful tour. But we all turned up today hoping to get up and win 3-1.” This tour ended with the same 2-2 result as the 2019 tour, but most of the players from four years ago had the chance to return with the aim of becoming the first team in 22 years to win a series in England. However, with Travis Head and Marnus Labuschagne the only Test regulars in the team under 30, it is time for regeneration. Opposing skippers Ben Stokes and Pat Cummins. Credit: Getty The biggest question continues to revolve around David Warner, 36, as it has for much of the past year. Cummins refused to be drawn on his veteran opener’s future. “I don’t know what the future holds for anyone,” Cummins said. “There were some times he looked really good, played some really important innings. I think that is the thing about playing in England, you can get the conditions against you. He walked out sometimes under lights and clouds, and a 30 there is worth double.","pubDate":"2023-08-01 05:47:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘We Decided To Meet Up...’ Ben Stokes Issues Clarification After Allegations Surfaced About England and Australia Players Not Getting Together Following Fifth Ashes 2023 Test","link":"https://www.latestly.com/socially/sports/cricket/we-decided-to-meet-up-ben-stokes-issues-clarification-after-allegations-surfaced-about-england-and-australia-players-not-getting-together-following-fifth-ashes-5307739.html","keywords":null,"creator":null,"video_url":null,"description":"It was alleged that the Australian players waited for England to wrap up things up quickly so that they could go for a drink after the fifth and last Ashes 2023 test finished in a draw. The five-Test series finished 2-2 with Australia retaining the urn.","content":"Ben Stokes issued a clarification after allegations surfaced about the England and Australian teams not getting together for a drink after the fifth and final Ashes 2023 Test. Stokes, taking to social media, wrote that it took time for them to wrap up things because of 'multiple last time event’s', potentially talking about Stuart Broad and Moeen Ali's retirement. It was alleged that the Australian players waited for their English counterparts to have a drink together but there wasn't any response from the latter. Stokes also wrote that they did meet up eventually. \"We decided to meet up in the nightclub rather than the dressing room,\" he wrote. ‘If Stokesy Messages Me Again, I Am Going To Delete It’ Moeen Ali Confirms Retirement From Test Cricket After ENG vs AUS Ashes 2023 Ends in 2–2 Draw. Ben Stokes Clarifies England and Australia Players Did Meet After Ashes 2023 To clarify… Our wrap took longer than expected because of multiple last time event’s. We decided to meet up in the night club rather than the dressing room 🙌🙌🙌🙌🙌🙌🙌🙌 https://t.co/jJ4Qw3uCnm — Ben Stokes (@benstokes38) August 1, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-01 05:22:15","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket Australia Congratulates Pat Cummins & His Team for WTC 2023 Title and Retaining Ashes Urn","link":"https://www.latestly.com/sports/cricket/cricket-australia-congratulates-pat-cummins-his-team-for-wtc-2023-title-and-retaining-ashes-urn-5307692.html","keywords":null,"creator":null,"video_url":null,"description":"The Ashes and World Test Championship victories comprised an exciting and physically demanding period in which the Australians played six Test matches in eight weeks, Cricket Australia said in a release on Tuesday.","content":"Cricket Australia (CA) on Tuesday congratulated the Australian senior men’s team on its successful tour of England during which it won the World Test Championship (WTC) title for the first time. On the three-month-long tour of England, the Australians completed a unique double -- winning their maiden World Test Championship title and retaining the Ashes. The Ashes series finished tied 2-2 after England won the fifth Test at The Oval on Monday. ‘If Stokesy Messages Me Again, I Am Going To Delete It’ Moeen Ali Confirms Retirement From Test Cricket After ENG vs AUS Ashes 2023 Ends in 2–2 Draw The Ashes and World Test Championship victories comprised an exciting and physically demanding period in which the Australians played six Test matches in eight weeks, Cricket Australia said in a release on Tuesday. “We are all enormously proud of Pat Cummins and his team for all they have achieved on their tour of England,\" Nick Hockley, Cricket Australia, chief executive, said: “The squad was determined to return with the World Test Championship trophy and the Ashes, and to achieve both objectives in often difficult conditions against world-class opposition and in front of extremely passionate and occasionally hostile crowds, is a credit to all the players and support staff,\" he was quoted as saying in a release. Hockley said the series lived up to the billing of one of the greatest rivalries in cricket. Magic Again! Stuart Broad Switches Bails And Dismisses Alex Carey Next Ball During ENG vs AUS Ashes 2023 5th Test (Watch Video) “Both the men's and women's Ashes have been epic series that has captured the imagination of the cricketing world and lived up to the billing of one of the greatest rivalries in world sport. They will no doubt inspire lots of boys and girls to pick up a bat and ball this summer,\" he said. He also congratulated the England team for its enterprising play in the series. “I would also like to congratulate England, whose enterprising play has helped to make these such memorable series, and particularly retiring fast-bowler Stuart Broad who has been such a formidable opponent and competitor over many years,\" he added. Hockley said Cricket Australia is already looking forward to hosting England for the return series in 2025-26. (The above story first appeared on LatestLY on Aug 01, 2023 10:43 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-01 05:15:12","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"East Zone vs West Zone, Deodhar Trophy 2023 Live Streaming: কখন কোথায় কিভাবে দেখবেন দেওধর ট্রফির হাড্ডাহাড্ডি লড়াই, জেনে নিন এক নজরে","link":"https://bangla.latestly.com/sports/east-zone-vs-west-zone-deodhar-trophy-2023-live-streaminghow-to-watch-east-zone-vs-west-zone-deodhar-trophy-2023-live-streaming-online-get-free-live-telecast-of-ez-vs-wz-cricket-match-with-time-in-231455.html","keywords":null,"creator":null,"video_url":null,"description":"ইতিমধ্যে পশ্চিমাঞ্চল তাদের শেষ ম্যাচে উত্তরাঞ্চলকে ছয় উইকেটে হারিয়ে এই ম্যাচ খেলতে নেমেছে অপরদিকে শেষ ম্যাচে দক্ষিণাঞ্চলের কাছে হেরেছে পূর্বাঞ্চল। তাই ফাইনালে উঠতে গেলে পূর্বাঞ্চলকে জিততেই হবে।","content":"আজ দেওধর ট্রফির খেলায় মুখোমুখি পূর্বাঞ্চল ও পশ্চিমাঞ্চল। ইতিমধ্যে পশ্চিমাঞ্চল তাদের শেষ ম্যাচে উত্তরাঞ্চলকে ছয় উইকেটে হারিয়ে এই ম্যাচ খেলতে নেমেছে অপরদিকে শেষ ম্যাচে দক্ষিণাঞ্চলের কাছে হেরেছে পূর্বাঞ্চল। তাই ফাইনালে উঠতে গেলে পূর্বাঞ্চলকে জিততেই হবে। পন্ডিচেরীর ২নং গ্রাউন্ডে সকাল ৯টায় শুরু হবে এই খেলা। দুই দলের তালিকায় একবার চোখ বুলিয়ে নেওয়া যাক। পূর্বাঞ্চল: সৌরভ তিওয়ারি (অধিনায়ক), অভিষেক পোড়েল (উইকেটকিপার), অভিমন্যু ঈশ্বরণ, রিয়ান পরাগ, শুভ্রাংশু সেনাপতি, বিরাট সিং, আকাশ দীপ, মণিশঙ্কর মুরাসিংহ, শাহবাজ নাদিম, উত্কর্ষ সিং, অভিনোভ চৌধুরী, ঋষব দাস, মুখতার হোসেন, সুদীপ কুমার ঘরামি, কুমার কুশাগ্র। পশ্চিমাঞ্চল: প্রিয়ঙ্ক পাঞ্চাল (অধিনায়ক), হারভিক দেশাই, অঙ্কিত বাওনে, রাহুল ত্রিপাঠী, পৃথ্বী শ, সরফরাজ খান, হেট প্যাটেল, শিবম দুবে, রাজবর্ধন হাঙ্গেরকর, শামস মুলানি, অতীত শেঠ, পার্থ ভুত, সমর্থ ব্যাস, চিন্তন গজা, আরজান নাগওয়াসওয়ালা। কখন থেকে শুরু হবে পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম দক্ষিণাঞ্চল, দেওধর ট্রফির ম্যাচ শুরু হবে ভারতীয় সময় সকাল ৯ঃ০০টায়। জেনে নিন টিভিতে কোথায় সরাসরি দেখবেন পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি ভারতে টেলিভিশনে সম্প্রচার করা হবে না। জেনে নিন অনলাইনে কোথায় সরাসরি দেখবেন পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি অনলাইনে সরাসরি সম্প্রচার করা হবে বিসিসিআই অ্যাপে","pubDate":"2023-08-01 05:04:28","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"India vs West Indies, 3rd ODI: Here's how to watch it live online and on TV for free","link":"https://economictimes.indiatimes.com/news/sports/india-vs-west-indies-3rd-odi-heres-how-to-watch-its-live-streaming-for-free/articleshow/102298873.cms","keywords":null,"creator":null,"video_url":null,"description":"The match starts at 7 pm (IST) and the toss at 6.30 pm. The winner of the match will win the series. The match will also be the first men’s ODI game at the Brian Lara Stadium.","content":"Synopsis The match starts at 7 pm (IST) and the toss at 6.30 pm. The winner of the match will win the series. The match will also be the first men’s ODI game at the Brian Lara Stadium. PTI In the second match at Kensington Oval, India lost by six wickets. India will take on the West Indies in the third and final one-day international match in the three-match series later today. With the series at a 1-1 draw now, the Men in Blue will certainly look to seal the series with a win in the 3rd ODI match, which is to be played at Brian Lara Stadium, Tarouba, Trinidad. The third ODI is to be played today (August 1) and the good news for cricket lovers back home is that they can watch it for free online. The match is to start at 7 pm (Indian Standard Time) later today, and the toss for the same will take place at 6.30 pm. The live streaming of the match will be available on Jiocinema 's website as well as on the app. If you don't want to spend data on it, then you can watch it on TV on Doordarshan Sports (DD Sports) channel. The third ODI between the West Indies and India has become crucial—something of a final—as the series is now at a 1-1 draw. So whoever wins the match, will win the series as well. In the second ODI, the Indians were outplayed by the Indies. In the second match at Kensington Oval, India lost by six wickets. India were bowled out for 181, with the West Indies chasing down the target in 36.4 overs with six wickets in hand. The decider will also be the first time the Brian Lara Stadium will be hosting a men’s ODI game after having hosted a men’s T20I game between these two teams last year. Probable Teams: West Indies: Shai Hope (captain), Rovman Powell (vice-captain), Alick Athanaze, Yannic Cariah, Keacy Carty, Dominic Drakes, Shimron Hetmyer, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Jayden Seales, Romario Shepherd, Kevin Sinclair, Oshane Thomas. India: Rohit Sharma (captain), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Surya Kumar Yadav, Sanju Samson (wicket-keeper), Ishan Kishan (wicket-keeper), Hardik Pandya (vice-captain), Shardul Thakur, Ravindra Jadeja, Axar Patel, Yuzvendra Chahal, Kuldeep Yadav, Jaydev Unadkat, Umran Malik, Mukesh Kumar. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Tuesday, 01 Aug, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies & Economy Smart Investing More Binny Checks Out; Walmart Stake in Flipkart Hits 80% Walmart’s shareholding in Flipkart is likely to rise to around 80%, strengthening its ownership of the Indian ecommerce firm, as cofounder Binny Bansal and other minority investors sell more shares to the Bentonville, US-based retailer, according to regulatory filings in Singapore, accessed by ET. Piyush Goyal may Meet Top Ecomm Execs Tomorrow The commerce and industry ministry has invited executives of ecommerce firms including online marketplaces, food-delivery companies, logistics and quick commerce platforms for consultations before finalising its much-awaited National Ecommerce Policy, several people aware of the matter told ET. Niti Moots Mining Sops to Help Charge up Li-ion Battery Manufacturing The Niti Aayog has proposed royalties and tax benefits, production-linked incentive (PLI) schemes and other measures to support the processing and refining of critical minerals used in lithium-ion batteries as part of efforts aimed at promoting electric vehicles and meeting net-zero goals. Read More News on india west indies 3rd odi india cricket live jiocinema dd sport virat (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Aviation Q1 preview: Street expects IndiGo to serve record profit, SpiceJet’s menu card to be low on flavour 11 mins read Investing M&M’s tryst with banking puts focus on RBL Bank. But investors must prepare for a long journey. 9 mins read Under the lens Lessons from the doused Wagner rebellion: why private armies can be a ticking bomb for governments 10 mins read Subscribe to ETPrime","pubDate":"2023-08-01 05:01:58","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-174136,resizemode-4,msid-102298873/india-vs-west-indies-3rd-odi-heres-how-to-watch-it-live-online-and-on-tv-for-free.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Calem Nieuwenhof primed for Hearts battles as he goes to dodging sharks down under to fulfilling 'dream' at Tynecastle","link":"https://www.dailyrecord.co.uk/sport/football/calem-nieuwenhof-primed-hearts-battles-30597299","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Michael Gannon)"],"video_url":null,"description":"The new Hearts signing reckons he will learn a lot from Steven Naismith and wants to push for a World Cup spot.","content":"Calem Nieuwenhof Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Calem Nieuwenhof reckons he’ll have no trouble negotiating the choppy waters of Scottish football after growing up swerving great white sharks. The Hearts new boy spent his youth on the water but swapped the surf for turf as he made waves as a footballer in Australia. Nieuwenhof was thrown in at the deep end for his debut against Leeds on Sunday but managed to stay afloat and is confident he won’t sink in Scotland. The former Western Sydney Wanderers star might have grown up not far from Bondi Beach but his dad’s Dutch DNA gave him a love for football. And a visit to Tynecastle as a kid in 2018 made such an impression that he was thrilled to make his return permanent – even if Gorgie is different world to what he’s used to. Read More Related Articles Celtic and Rangers in Viaplay Cup TV double header as schedulers solve Hearts and Hibs headache Read More Related Articles Final SPFL Premiership table predicted amid Celtic and Rangers title tussle and tight relegation dogfight Nieuwenhof said: “I was pretty typical growing up. I have lived in one or two suburbs my whole life in the northern beaches of Sydney. I used to be a big surfer. Surfing here? Yeah, it will be a bit colder so I think I’d better remember the wetsuit, for sure! Were there sharks? Yeah, they might have prepared me a little bit for coming over here and playing in front of these fans! “There were so many different sports. Growing up I played football, surfed a fair bit. I mean my family is a pretty big surfing family. I played cricket, did Nippers (a club for young surf lifesavers) and a bit of touch football, a bit of everything. In Australia my dad played football so growing up there were never really any other options for me. “As soon as I was old enough to walk, I was kicking a ball around and as soon as I could I got into the local club team and I fell in love with the game. I just grew up playing football and now I’m lucky enough to come and play in the European leagues. That is every young player’s dream in Australia and it’s something I’m really proud of. I’m looking forward to making the most of it.” Nieuwenhof revealed he got a taste of Tynie five years ago – and he jumped at the chance to come back. He said: “I came here in 2018 as part of a football tour around the UK. I remember pretty vividly that we came to a Hearts game – I think it was against Dundee – and I remember how energetic and passionate the fans were. “That was the thing that really stood out for me. The stadium as well, I love it. It is such an awesome stadium. It was good to see them come out for the Leeds game and I’m sure they are going to get behind us this season. That’s something I’m looking forward to. The reception was awesome. I couldn’t believe how many rocked up for a pre-season friendly so I’ve obviously come to a really good club where the fanbase is massive.” Calem Nieuwenhof Nieuwenhof is following a familiar path with plenty of Aussies soaring in Scotland. He’ll have Socceroos Kye Rowles, Cammy Devlin and Nathaniel Atkinson for company in Gorgie and he’s hoping to be the next man from Down Under to make an impact in these parts – so he can blast his way towards the next World Cup . He said: “Talking to a few of the boys back home – I played with Olly Bozanic last season and he spoke nothing but highly about his time here and the league – that helped me make a good decision. I know that there are so many Australians who have come to Scotland and they are all doing well so it has proven to be a really good step forward. “It has shown to be the next level from the A League to come here. The World Cup is something I aspire to, 100 per cent. All the boys in the team now are in the Socceroos and that’s somewhere I want to go. That made my decision to come here even easier because I know that if I come here and perform well I could get a national team call-up. I know it’s now on me.” Nieuwenhof looked the part in the 1-0 defeat to Leeds on Sunday but Hearts are still a work in progress. The 22-year-old said: “It is a different game style than in Australia and this is my first week training with the boys. I definitely have a lot of learning to do and I’m going to learn more from Steven Naismith and the other coaches about how they want us to play. “That is something we can take forward into the league because I know we want to be a team that plays with the ball and dominates other teams. That is a team I want to play in so that is really positive for me. It is very different from Australia and I am being thrust right into it. “That is a real positive in my eyes, the amount of games that we play over here. That is something I’m looking forward to, getting a number of games under my belt and showing good consistency.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Hearts FC Steven Naismith Leeds United FC World Cup","pubDate":"2023-08-01 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30588553.ece/ALTERNATES/s615/0_JS307006161.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Novak Djokovic makes surprising addition to US Open 2023 plans days after raising health concerns post Alcaraz loss","link":"https://www.hindustantimes.com/sports/tennis/novak-djokovic-makes-surprising-addition-to-us-open-2023-plans-raising-health-concerns-post-carlos-alcaraz-loss-101690863896391.html","keywords":null,"creator":null,"video_url":null,"description":"Novak Djokovic is all set to return to U.S soil for the first time in two years after having missed last year's North American hardcourt swing","content":"Novak Djokovic is all set to return to U.S soil for the first time in two years as he revealed Cincinnati Masters 1000 as his only plan for preparation for the 2023 US Open. But on Tuesday, Djokovic left tennis world surprised when he made a new addition to his plans for the final Grand Slam of the calendar year just days after raising health concerns post that heartbreaking loss to Carlos Alcaraz in the Wimbledon final. Novak Djokovic has left everyone surprised with his new US Open plan(REUTERS) Djokovic has his name in the entry list for the first Masters 1000 event of the US Open tune-up - Rogers Cup in Toronto - but he announced his withdrawal from the event last week citing fatigue, thereby extending his stay away from tennis action since that five-setter loss at the SW19 a little over a fortnight back. However, he still had his intentions for an appearance in the Cincinnati Masters, which he had earlier revealed as the only tournament he would appear before heading towards the Flushing Meadows in New York. ALSO READ: Watch: Tennis player collapses during Citi Open match, forced to retire weeks after alarming Wimbledon incident On Tuesday, the Serb took everyone by surprise when he announced that in addition to the singles event, he will also compete in the doubles category alongside compatriot Nikola Cacic, who is presently ranked 57 in the world and has won three ATP titles in his career - Chengdu 2019, Montpellier 2020 and Buenos Aires 2021. Djokovic, meanwhile, has only one ATP doubles title to show, which he had won 13 years back at the AEGON Championships and has a career record of 62 wins and 77 losses This will be the third time that Djokovic will be pairing with Cacic for doubles, but all them happened representing Serbia in team events. The first was in 2021 in ATP Cup (lost to Germany's Jan-Lennard Struff and Alexander Zverev), followed by two in 2022 Davis Cup where they lost to German pair of Tim Puetz and Kevin Krawietz before beating Kazakhstan's Andrey Golubev and Aleksandr Nedovyesov. Djokovic has been more a handful of appearances in the doubles category in recent times - with Vasek Pospisil (Adelaide 1 in 2023), Erlich (Tel Aviv in 2022), Filip Krajinovic (Paris Masters 1000 in 2021), Carlos Gomez- Herrera (Mallorca in 2021, finalists) and Marin Cilic (Dubai in 2020). At the Cincinnati Masters, it will be his third appearance in the category, the last being in 2019, where he had suffered a first-round exit alongside compatriot Janko Tipsarević. He had however reached the quarters in Cincinnati back in 2007 with Nenad Zimonjić as his partner. The doubles entry list at the 2023 Cincinnati Masters also features Andrey Rublev/Max Purcell, Hubert Hurkacz/Mektic Pavic, Alexander Bublik/Adrian Mannarino and Stefanos Tsitsipas/Davidovich Fokina as well. Return to U.S soil Djokovic had missed last year's North American hardcourt swing owing to his stance on Covid vaccination with disallowed him entry into America as per the rules of the government for international travellers. It in fact saw him miss the 2022 US Open as well. Djokovic has won the US Open trophy thrice in his career, the last being in 2018. He did have the chance in 2021 when he had reached the final with a win away from a monumental Calendar Slam before losing in straight sets to Daniil Medvedev. Overall, he has a 81-13 record in New York with eight finals and 12 appearances in semi-final. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Novak Djokovic Carlos Alcaraz Us Open","pubDate":"2023-08-01 04:58:57","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/01/1600x900/TENNIS-AUSOPEN--446_1674565131781_1674565131781_1690864045869.JPG","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Wenn \"Kleinherne\" und \"Nüsken\" zu Zungenbrechern werden","link":"https://www.sportschau.de/fussball/fifa-frauen-wm/wm-melbourne-australien-deutsch-lernen-100.html","keywords":null,"creator":null,"video_url":null,"description":"Jessika Rabe arbeitet seit mehr als 20 Jahren als Deutschlehrerin in Melbourne. Die WM in Australien verfolgt sie genau - und bringt sie auch in den Unterricht.","content":"Stand: 01.08.2023 06:53 Uhr Die sportbegeisterte Jessika Rabe arbeitet seit mehr als 20 Jahren als Deutschlehrerin in Melbourne. Dass die Fußball-WM nun in Australien stattfindet, freut sie sehr. Für die gebürtige Niedersächsin eine klare Sache: Das deutsche Nationalteam ist auch Unterrichtsthema. \"Sophia Klien-hörne\" - \"Kleinherne, fantastisch, wunderbar.\" Und: \"Sjo-key Nuss-ken\" - \"Nüsken, fantastisch - well done.\" Diese Deutschstunde an der Mentone Grammar School in Melbourne ist etwas besonderes. Für die Siebt- und Achtklässler steht die Fußball-WM der Frauen in Down Under auf dem Stundenplan. Und Lehrerin Jessika Rabe lobt ihre Schülerinnen und Schüler. Das Goethe-Institut Australien hat extra Unterrichtsmaterialien erstellt, in denen es um die deutsche Nationalmannschaft geht. Inklusive Namen, die für die normalerweise ja nur Englisch sprechenden Zwölf- bis 14-Jährige gar nicht so einfach auszusprechen sind. Jessika Rabe kommt aus Niedersachsen, aufgewachsen ist sie in Nienhagen in der Nähe der Stadt Celle. Sport hat die Lehrer schon immer begeistert. Als sie Ende der 1990er-Jahre für einen längere Zeit in Australien war, lernte sie ihren heutigen Mann Adam kennen. Nach der Jahrtausendwende zog sie zu ihm nach Melbourne. Heute hat das Paar drei Kinder, die zweisprachig aufwachsen. An der Mentone Grammar School ist Deutsch für viele Kinder die erste Fremdsprache. Das Urteil fällt gemischt aus: \"Ick finde Deutsch supa\", sagt Holly und lacht. \"Ich finde Deutsch kompliziert\", sagt Lukas. Luca kann mit Abstand am besten Deutsch. \"Mein Papa ist deutsch, er hat es mir beigebracht\", erklärt der Junge. Alternative zum Deutschunterricht ist vor allem Chinesisch, das an der Privatschule auch im Präsenzunterricht angeboten wird. Spanisch oder Französisch gibt es als E-Learningkurse. So lernen auch die 15-jährige Lilly und ihr kleiner Bruder Jonty die Sprache ihrer Mutter - allerdings zu Hause. Denn an ihrer Schule gibt es keinen Deutschunterricht. Jessika will aber keinen Druck ausüben, weil sie weiß, dass ihre Kinder mit dem normalen Schulunterricht meist schon genug ausgelastet sind. Lilly war für ein paar Wochen in Deutschland an einer Schule. Ihre vier Jahre ältere Schwester Yani hat bereits ihr Abitur gemacht und an einem Schüleraustausch teilgenommen. \"Wir sind deutsch, aber das ist bei uns kein riesiges Ding\", sagt Yani. \"Unsere Freunde würden nur auch gerne eine andere Sprache so gut sprechen können.\" In Australien leben über 100.000 Deutsche. Rund ein Fünftel davon in Melbourne - die Stadt hat damit die größte deutsche Gemeinde des Landes. Melbourne ist multikulturell - auch viele Griechen, Italiener oder Schotten hat es im 20. Jahrhundert hierher verschlagen. \"Genau das mag ich an meiner Heimatstadt\", sagt Vater Adam, der als Professor für Unternehmertum und Innovationen arbeitet. Das Spiel der DFB-Elf gegen Marokko in Melbourne schaute sich Jessica Rabe mit ihrer Familie im Stadion an. Bei ihm stehen eigentlich Australian Football, Cricket, Rugby, Golf, Tennis und auch Leichtathletik vor dem europäischen Soccer, den eigentlich nur Jessika und Jonty interessiert verfolgen. Beim ersten deutschen Spiel in Melbourne war dann aber doch die ganze Familie im Stadion - und nach dem 6:0-Erfolg gegen Marokko begeistert. Und auch die zweite Chance auf ein deutsches Spiel haben sie sich nicht entgehen lassen: Sie haben Karten für das Achtelfinale am 8. August. Nach der 1:2-Niederlage gegen Kolumbien sieht es aber eher danach aus, dass die DFB-Frauen - wenn überhaupt - in der Runde der besten 16 in Adelaide antreten müssen. \"Wenn wir schon nicht Deutschland zu sehen bekommen, dann zumindest Kolumbien mit Linda Caicedo. Sie wird der nächste Superstar\", ist Jessika überzeugt. So ganz hat sich von Gedanken, beim deutschen Achtelfinale dabei zu sein, allerdings noch nicht verabschiedet. \"Die DFB-Frauen müssen sich ein Beispiel an Australien nehmen, alles ist möglich. Sie müssen es genauso machen wie Australien gegen Kanada\", hofft die 51-Jährige, die den 4:0-Erfolg der \"Matildas\" zusammen mit der ganzen Familie vor dem Fernseher verfolgt hat. \"Wir haben wie verrückt gejubelt.\" 31.07.2023 Nach der ersten Niederlage bei der WM bringt die deutschen Fußballerinnen nur ein eigener Sieg im letzten Gruppenspiel sicher ins Achtelfinale. Doch es gibt noch andere Szenarien fürs Weiterkommen. mehr In Melbourne wird trotzdem weiter Deutsch gelernt. \"Hört genau zu: Wie heißt die Spielerin und was ist ihr Spitzname\", fragt Lehrerin Jessika Rabe ihre Schülerinnen und Schüler. Das Goethe-Instut hat Video-Interviews mit Jule Brand, Nicole Anyomi, Nüsken, Kleinherne und Maximiliane Rall, die es nicht in den WM-Kader geschafft hat, geführt. Auf Fragebögen sollen die richtigen Antworten angekreuzt werden. \"Ich glaube, sie hat 2000 gesagt\", vermutet Anish bei der Frage nach dem Geburtsdatum von Anyomi. Außerdem geht es um Hobbys, Musik oder auch das Lieblingsessen. Jessika Rabe ist sehr zufrieden mit den WM-Unterrichtsstunden. \"Die sind sehr gut angekommen. Natürlich lernen die Schülerinnen und Schüler viel lieber so etwas über die deutsche Kultur als Verben zu konjugieren oder sich mit dem Präteritum zu beschäftigen\", sagt sie lachend. 31.07.2023 WM-Gastgeber Australien hat das \"Alles-oder-nichts\"-Spiel gegen Kanada überraschend klar dominiert und bleibt nach einem mitreißenden Auftritt im Turnier. mehr analyse 30.07.2023 Nach vorne gelang den Spielerinnen von Bundestrainerin Martina Voss-Tecklenburg fast nichts. Und in zwei Situationen sahen sie auch hinten schlecht aus. mehr 31.07.2023 Das zweite WM-Gruppenspiel brachte neben der bitteren Niederlage auch eine neue Verletzte. Dafür steht gegen Südkorea Marina Hegering wieder zur Verfügung. mehr Dieses Thema im Programm: Das Erste | Sportschau FIFA Frauen WM | 02.08.2023 | 08:35 Uhr","pubDate":"2023-08-01 04:53:14","image_url":null,"source_id":"sportschau","category":["sports"],"country":["germany"],"language":"german"},{"title":"Watch: Seth Rollins left fuming, confronts fan for calling him 'fake champion' during live WWE SuperShow event","link":"https://www.hindustantimes.com/sports/wwe-news/watch-seth-rollins-left-fuming-confronts-fan-for-calling-him-fake-champion-during-live-wwe-supershow-event-101690868973124.html","keywords":null,"creator":null,"video_url":null,"description":"The incident took place after Seth Rollins’ successful title defence against his SummerSlam opponent Finn Balor","content":"WWE World Heavyweight Champion Seth Rollins has been one of the most reliable and power-packed performers in recent times. Rollins became the inaugural World Heavyweight Champion at the WWE Night of Champions in May this year. Despite this, Rollins’ wrestling career has not been devoid of criticism. Recently, at the WWE live event held in Miami, Rollins was seen confronting a fan for calling him a “fake champion.” At the WWE live event held in Miami, Rollins was seen confronting a fan for calling him a “fake champion.” Needless to say, the jibe did not go down well with ‘The Architect’ who decided to react to the fan’s remarks quite grudgingly. “Being a fighting champion is taking its toll on me. I have one guy over here, that guy right there, called me a fake champion,\" Seth Rollins responded while pointing at the fan. “I am here in your city sweating buckets, bleeding my own blood. I am far from a fake ass champion. I am a fighting champion because you and I deserve a champion that's gonna sweat and bleed his own blood,” the 37-year-old added. In the video, Seth Rollins can be seen addressing fans after the match. The clip has clocked more than 263K views, so far. The incident took place after Seth Rollins defended his title against SummerSlam opponent Finn Balor. Following his win over Balor, Rollins decided to address the crowd. As Rollins addressed the fans, the crowd kept on chanting “kick him out”. Seth Rollins was crowned the inaugural World Heavyweight Champion after defeating AJ Styles at the Night of Champions premium live event in Saudi Arabia. Rollins has so far defended his title 17 times across multiple WWE events. Roman Reigns’ supreme run as WWE Universal Champion forced Triple H to launch the World Heavyweight Championship. Seth Rollins’ topsy turvy interaction with spectators is not something new and he was previously attacked by a fan during a live show on RAW in November 2021 at the Barclays Center in Brooklyn. Elisah Spencer, 24, had tackled Rollins as the WWE star left the ring during the live show of Monday Night RAW. Security officials had to intervene to control the situation. \"It's terrifying, brother. It happened very quickly. I was mostly just reacting and hoping that our security would come and do their job. Which they did very quickly. And then was just trying to detach and move on. Hope that everybody is okay,” Rollins told TMZ following the chilling incident. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Seth Rollins Wwe","pubDate":"2023-08-01 05:59:15","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/01/1600x900/rollins_fan_1690869328140_1690869333742.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Missed opportunity’: Cummins laments series draw as Ashes era ends","link":"https://www.theage.com.au/sport/cricket/missed-opportunity-cummins-laments-series-draw-as-ashes-era-ends-20230801-p5dssq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"With just two Test regulars under 30, the selectors will look to start regenerating the team after Australia failed to with its first series in England for 22 years.","content":"London: Fireworks that failed to explode and streamers that failed to fly reflected a flat Australian team during a muted Ashes presentation which has signalled the end of an era. The celebration became a mere photo opportunity as Australia held on to the Ashes with a 2-2 series draw which captain Pat Cummins described as a “missed opportunity”, with his side failing to win a match for almost a month. After easily beating India in the World Test Championship final at the Oval and going 2-0 up with narrow wins at Edgbaston and Lord’s, Australia lost at Headingley by three wickets, were saved by rain in Manchester, and lost again at the Oval on Monday by 49 runs. “It felt like we got ourselves into some really good positions winning the first two games, and then in Headingley and this week,” Cummins said. “We got into match-winning positions and just didn’t quite capitalise. “That happens. We were out of it in Birmingham and found a way to win. Once we reflect, we will be proud we retained it. It’s been a wonderful tour. But we all turned up today hoping to get up and win 3-1.” This tour ended with the same 2-2 result as the 2019 tour, but most of the players from four years ago had the chance to return with the aim of becoming the first team in 22 years to win a series in England. However, with Travis Head and Marnus Labuschagne the only Test regulars in the team under 30, it is time for regeneration. Opposing skippers Ben Stokes and Pat Cummins. Credit: Getty The biggest question continues to revolve around David Warner, 36, as it has for much of the past year. Cummins refused to be drawn on his veteran opener’s future. “I don’t know what the future holds for anyone,” Cummins said. “There were some times he looked really good, played some really important innings. I think that is the thing about playing in England, you can get the conditions against you. He walked out sometimes under lights and clouds, and a 30 there is worth double. “The partnership [135] he put on yesterday with Uz [Khawaja] was fantastic. Probably the story of the tour. So many moments where he felt like he got on top of the game, and [England] got themselves back in.” Sunday was Warner’s second half-century of the tour in a performance across the past two months that will make it difficult for him to continue in the Test team, despite nominating this coming summer’s Sydney Test against Pakistan as his preferred swansong. He scored 285 runs at 28.5 across the five Tests, the sixth time in seven series Warner, 36, has averaged under 30. And his only century in the past nine series was his epic double hundred against South Africa at the MCG during last year’s Boxing Day Test. The selectors will need to decide whether it is fair on Warner’s replacement not to start the Australian summer at the beginning with the Pakistan series. Reserve batsmen on this tour Marcus Harris and Matthew Renshaw are the obvious candidates to replace him. Both have played Test cricket before without securing a place. The loss of spinner Nathan Lyon, 35, who suffered a serious calf strain during the second Test, was significant, but it gave more opportunities for his impressive young protégé Todd Murphy, 22, particularly during the fifth Test. Murphy finished with seven wickets at an average of under 26 from two Tests. “It’s pretty clear just how important Nath is in all conditions,” Cummins said. “We probably felt that at times at Manchester, not having a spinner out there. The change of pace, someone who you can feel like they can control the pace of the game when the wicket is flat and pace bowlers can’t as well. “This week, Todd did a fantastic job. He took four [wickets] in the second innings, and was always asking questions. It felt like he could get breakthroughs when the wicket didn’t have much on offer. “I was really impressed with Todd. Hopefully, Nathan has plenty more cricket left in him. But Todd is there ready to go, which is great.” Australia will also have to blood imposing young West Australian fast bowler Lance Morris this summer to freshen up an ageing pace attack. Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-08-01 05:47:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘Missed opportunity’: Cummins laments series draw as Ashes era ends","link":"https://www.watoday.com.au/sport/cricket/missed-opportunity-cummins-laments-series-draw-as-ashes-era-ends-20230801-p5dssq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"With just two Test regulars under 30, the selectors will look to start regenerating the team after Australia failed to with its first series in England for 22 years.","content":"London: Fireworks that failed to explode and streamers that failed to fly reflected a flat Australian team during a muted Ashes presentation which has signalled the end of an era. The celebration became a mere photo opportunity as Australia held on to the Ashes with a 2-2 series draw which captain Pat Cummins described as a “missed opportunity”, with his side failing to win a match for almost a month. After easily beating India in the World Test Championship final at the Oval and going 2-0 up with narrow wins at Edgbaston and Lord’s, Australia lost at Headingley by three wickets, were saved by rain in Manchester, and lost again at the Oval on Monday by 49 runs. “It felt like we got ourselves into some really good positions winning the first two games, and then in Headingley and this week,” Cummins said. “We got into match-winning positions and just didn’t quite capitalise. “That happens. We were out of it in Birmingham and found a way to win. Once we reflect, we will be proud we retained it. It’s been a wonderful tour. But we all turned up today hoping to get up and win 3-1.” This tour ended with the same 2-2 result as the 2019 tour, but most of the players from four years ago had the chance to return with the aim of becoming the first team in 22 years to win a series in England. However, with Travis Head and Marnus Labuschagne the only Test regulars in the team under 30, it is time for regeneration. Opposing skippers Ben Stokes and Pat Cummins. Credit: Getty The biggest question continues to revolve around David Warner, 36, as it has for much of the past year. Cummins refused to be drawn on his veteran opener’s future. “I don’t know what the future holds for anyone,” Cummins said. “There were some times he looked really good, played some really important innings. I think that is the thing about playing in England, you can get the conditions against you. He walked out sometimes under lights and clouds, and a 30 there is worth double.","pubDate":"2023-08-01 05:47:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘We Decided To Meet Up...’ Ben Stokes Issues Clarification After Allegations Surfaced About England and Australia Players Not Getting Together Following Fifth Ashes 2023 Test","link":"https://www.latestly.com/socially/sports/cricket/we-decided-to-meet-up-ben-stokes-issues-clarification-after-allegations-surfaced-about-england-and-australia-players-not-getting-together-following-fifth-ashes-5307739.html","keywords":null,"creator":null,"video_url":null,"description":"It was alleged that the Australian players waited for England to wrap up things up quickly so that they could go for a drink after the fifth and last Ashes 2023 test finished in a draw. The five-Test series finished 2-2 with Australia retaining the urn.","content":"Ben Stokes issued a clarification after allegations surfaced about the England and Australian teams not getting together for a drink after the fifth and final Ashes 2023 Test. Stokes, taking to social media, wrote that it took time for them to wrap up things because of 'multiple last time event’s', potentially talking about Stuart Broad and Moeen Ali's retirement. It was alleged that the Australian players waited for their English counterparts to have a drink together but there wasn't any response from the latter. Stokes also wrote that they did meet up eventually. \"We decided to meet up in the nightclub rather than the dressing room,\" he wrote. ‘If Stokesy Messages Me Again, I Am Going To Delete It’ Moeen Ali Confirms Retirement From Test Cricket After ENG vs AUS Ashes 2023 Ends in 2–2 Draw. Ben Stokes Clarifies England and Australia Players Did Meet After Ashes 2023 To clarify… Our wrap took longer than expected because of multiple last time event’s. We decided to meet up in the night club rather than the dressing room 🙌🙌🙌🙌🙌🙌🙌🙌 https://t.co/jJ4Qw3uCnm — Ben Stokes (@benstokes38) August 1, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-01 05:22:15","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket Australia Congratulates Pat Cummins & His Team for WTC 2023 Title and Retaining Ashes Urn","link":"https://www.latestly.com/sports/cricket/cricket-australia-congratulates-pat-cummins-his-team-for-wtc-2023-title-and-retaining-ashes-urn-5307692.html","keywords":null,"creator":null,"video_url":null,"description":"The Ashes and World Test Championship victories comprised an exciting and physically demanding period in which the Australians played six Test matches in eight weeks, Cricket Australia said in a release on Tuesday.","content":"Cricket Australia (CA) on Tuesday congratulated the Australian senior men’s team on its successful tour of England during which it won the World Test Championship (WTC) title for the first time. On the three-month-long tour of England, the Australians completed a unique double -- winning their maiden World Test Championship title and retaining the Ashes. The Ashes series finished tied 2-2 after England won the fifth Test at The Oval on Monday. ‘If Stokesy Messages Me Again, I Am Going To Delete It’ Moeen Ali Confirms Retirement From Test Cricket After ENG vs AUS Ashes 2023 Ends in 2–2 Draw The Ashes and World Test Championship victories comprised an exciting and physically demanding period in which the Australians played six Test matches in eight weeks, Cricket Australia said in a release on Tuesday. “We are all enormously proud of Pat Cummins and his team for all they have achieved on their tour of England,\" Nick Hockley, Cricket Australia, chief executive, said: “The squad was determined to return with the World Test Championship trophy and the Ashes, and to achieve both objectives in often difficult conditions against world-class opposition and in front of extremely passionate and occasionally hostile crowds, is a credit to all the players and support staff,\" he was quoted as saying in a release. Hockley said the series lived up to the billing of one of the greatest rivalries in cricket. Magic Again! Stuart Broad Switches Bails And Dismisses Alex Carey Next Ball During ENG vs AUS Ashes 2023 5th Test (Watch Video) “Both the men's and women's Ashes have been epic series that has captured the imagination of the cricketing world and lived up to the billing of one of the greatest rivalries in world sport. They will no doubt inspire lots of boys and girls to pick up a bat and ball this summer,\" he said. He also congratulated the England team for its enterprising play in the series. “I would also like to congratulate England, whose enterprising play has helped to make these such memorable series, and particularly retiring fast-bowler Stuart Broad who has been such a formidable opponent and competitor over many years,\" he added. Hockley said Cricket Australia is already looking forward to hosting England for the return series in 2025-26. (The above story first appeared on LatestLY on Aug 01, 2023 10:43 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-01 05:15:12","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"East Zone vs West Zone, Deodhar Trophy 2023 Live Streaming: কখন কোথায় কিভাবে দেখবেন দেওধর ট্রফির হাড্ডাহাড্ডি লড়াই, জেনে নিন এক নজরে","link":"https://bangla.latestly.com/sports/east-zone-vs-west-zone-deodhar-trophy-2023-live-streaminghow-to-watch-east-zone-vs-west-zone-deodhar-trophy-2023-live-streaming-online-get-free-live-telecast-of-ez-vs-wz-cricket-match-with-time-in-231455.html","keywords":null,"creator":null,"video_url":null,"description":"ইতিমধ্যে পশ্চিমাঞ্চল তাদের শেষ ম্যাচে উত্তরাঞ্চলকে ছয় উইকেটে হারিয়ে এই ম্যাচ খেলতে নেমেছে অপরদিকে শেষ ম্যাচে দক্ষিণাঞ্চলের কাছে হেরেছে পূর্বাঞ্চল। তাই ফাইনালে উঠতে গেলে পূর্বাঞ্চলকে জিততেই হবে।","content":"আজ দেওধর ট্রফির খেলায় মুখোমুখি পূর্বাঞ্চল ও পশ্চিমাঞ্চল। ইতিমধ্যে পশ্চিমাঞ্চল তাদের শেষ ম্যাচে উত্তরাঞ্চলকে ছয় উইকেটে হারিয়ে এই ম্যাচ খেলতে নেমেছে অপরদিকে শেষ ম্যাচে দক্ষিণাঞ্চলের কাছে হেরেছে পূর্বাঞ্চল। তাই ফাইনালে উঠতে গেলে পূর্বাঞ্চলকে জিততেই হবে। পন্ডিচেরীর ২নং গ্রাউন্ডে সকাল ৯টায় শুরু হবে এই খেলা। দুই দলের তালিকায় একবার চোখ বুলিয়ে নেওয়া যাক। পূর্বাঞ্চল: সৌরভ তিওয়ারি (অধিনায়ক), অভিষেক পোড়েল (উইকেটকিপার), অভিমন্যু ঈশ্বরণ, রিয়ান পরাগ, শুভ্রাংশু সেনাপতি, বিরাট সিং, আকাশ দীপ, মণিশঙ্কর মুরাসিংহ, শাহবাজ নাদিম, উত্কর্ষ সিং, অভিনোভ চৌধুরী, ঋষব দাস, মুখতার হোসেন, সুদীপ কুমার ঘরামি, কুমার কুশাগ্র। পশ্চিমাঞ্চল: প্রিয়ঙ্ক পাঞ্চাল (অধিনায়ক), হারভিক দেশাই, অঙ্কিত বাওনে, রাহুল ত্রিপাঠী, পৃথ্বী শ, সরফরাজ খান, হেট প্যাটেল, শিবম দুবে, রাজবর্ধন হাঙ্গেরকর, শামস মুলানি, অতীত শেঠ, পার্থ ভুত, সমর্থ ব্যাস, চিন্তন গজা, আরজান নাগওয়াসওয়ালা। কখন থেকে শুরু হবে পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম দক্ষিণাঞ্চল, দেওধর ট্রফির ম্যাচ শুরু হবে ভারতীয় সময় সকাল ৯ঃ০০টায়। জেনে নিন টিভিতে কোথায় সরাসরি দেখবেন পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি ভারতে টেলিভিশনে সম্প্রচার করা হবে না। জেনে নিন অনলাইনে কোথায় সরাসরি দেখবেন পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি? পশ্চিমাঞ্চল বনাম পূর্বাঞ্চল , দেওধর ট্রফি অনলাইনে সরাসরি সম্প্রচার করা হবে বিসিসিআই অ্যাপে","pubDate":"2023-08-01 05:04:28","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"India vs West Indies, 3rd ODI: Here's how to watch it live online and on TV for free","link":"https://economictimes.indiatimes.com/news/sports/india-vs-west-indies-3rd-odi-heres-how-to-watch-its-live-streaming-for-free/articleshow/102298873.cms","keywords":null,"creator":null,"video_url":null,"description":"The match starts at 7 pm (IST) and the toss at 6.30 pm. The winner of the match will win the series. The match will also be the first men’s ODI game at the Brian Lara Stadium.","content":"Synopsis The match starts at 7 pm (IST) and the toss at 6.30 pm. The winner of the match will win the series. The match will also be the first men’s ODI game at the Brian Lara Stadium. PTI In the second match at Kensington Oval, India lost by six wickets. India will take on the West Indies in the third and final one-day international match in the three-match series later today. With the series at a 1-1 draw now, the Men in Blue will certainly look to seal the series with a win in the 3rd ODI match, which is to be played at Brian Lara Stadium, Tarouba, Trinidad. The third ODI is to be played today (August 1) and the good news for cricket lovers back home is that they can watch it for free online. The match is to start at 7 pm (Indian Standard Time) later today, and the toss for the same will take place at 6.30 pm. The live streaming of the match will be available on Jiocinema 's website as well as on the app. If you don't want to spend data on it, then you can watch it on TV on Doordarshan Sports (DD Sports) channel. The third ODI between the West Indies and India has become crucial—something of a final—as the series is now at a 1-1 draw. So whoever wins the match, will win the series as well. In the second ODI, the Indians were outplayed by the Indies. In the second match at Kensington Oval, India lost by six wickets. India were bowled out for 181, with the West Indies chasing down the target in 36.4 overs with six wickets in hand. The decider will also be the first time the Brian Lara Stadium will be hosting a men’s ODI game after having hosted a men’s T20I game between these two teams last year. Probable Teams: West Indies: Shai Hope (captain), Rovman Powell (vice-captain), Alick Athanaze, Yannic Cariah, Keacy Carty, Dominic Drakes, Shimron Hetmyer, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Jayden Seales, Romario Shepherd, Kevin Sinclair, Oshane Thomas. India: Rohit Sharma (captain), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Surya Kumar Yadav, Sanju Samson (wicket-keeper), Ishan Kishan (wicket-keeper), Hardik Pandya (vice-captain), Shardul Thakur, Ravindra Jadeja, Axar Patel, Yuzvendra Chahal, Kuldeep Yadav, Jaydev Unadkat, Umran Malik, Mukesh Kumar. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Tuesday, 01 Aug, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies & Economy Smart Investing More Binny Checks Out; Walmart Stake in Flipkart Hits 80% Walmart’s shareholding in Flipkart is likely to rise to around 80%, strengthening its ownership of the Indian ecommerce firm, as cofounder Binny Bansal and other minority investors sell more shares to the Bentonville, US-based retailer, according to regulatory filings in Singapore, accessed by ET. Piyush Goyal may Meet Top Ecomm Execs Tomorrow The commerce and industry ministry has invited executives of ecommerce firms including online marketplaces, food-delivery companies, logistics and quick commerce platforms for consultations before finalising its much-awaited National Ecommerce Policy, several people aware of the matter told ET. Niti Moots Mining Sops to Help Charge up Li-ion Battery Manufacturing The Niti Aayog has proposed royalties and tax benefits, production-linked incentive (PLI) schemes and other measures to support the processing and refining of critical minerals used in lithium-ion batteries as part of efforts aimed at promoting electric vehicles and meeting net-zero goals. Read More News on india west indies 3rd odi india cricket live jiocinema dd sport virat (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Aviation Q1 preview: Street expects IndiGo to serve record profit, SpiceJet’s menu card to be low on flavour 11 mins read Investing M&M’s tryst with banking puts focus on RBL Bank. But investors must prepare for a long journey. 9 mins read Under the lens Lessons from the doused Wagner rebellion: why private armies can be a ticking bomb for governments 10 mins read Subscribe to ETPrime","pubDate":"2023-08-01 05:01:58","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-174136,resizemode-4,msid-102298873/india-vs-west-indies-3rd-odi-heres-how-to-watch-it-live-online-and-on-tv-for-free.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Calem Nieuwenhof primed for Hearts battles as he goes to dodging sharks down under to fulfilling 'dream' at Tynecastle","link":"https://www.dailyrecord.co.uk/sport/football/calem-nieuwenhof-primed-hearts-battles-30597299","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Michael Gannon)"],"video_url":null,"description":"The new Hearts signing reckons he will learn a lot from Steven Naismith and wants to push for a World Cup spot.","content":"Calem Nieuwenhof Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Calem Nieuwenhof reckons he’ll have no trouble negotiating the choppy waters of Scottish football after growing up swerving great white sharks. The Hearts new boy spent his youth on the water but swapped the surf for turf as he made waves as a footballer in Australia. Nieuwenhof was thrown in at the deep end for his debut against Leeds on Sunday but managed to stay afloat and is confident he won’t sink in Scotland. The former Western Sydney Wanderers star might have grown up not far from Bondi Beach but his dad’s Dutch DNA gave him a love for football. And a visit to Tynecastle as a kid in 2018 made such an impression that he was thrilled to make his return permanent – even if Gorgie is different world to what he’s used to. Read More Related Articles Celtic and Rangers in Viaplay Cup TV double header as schedulers solve Hearts and Hibs headache Read More Related Articles Final SPFL Premiership table predicted amid Celtic and Rangers title tussle and tight relegation dogfight Nieuwenhof said: “I was pretty typical growing up. I have lived in one or two suburbs my whole life in the northern beaches of Sydney. I used to be a big surfer. Surfing here? Yeah, it will be a bit colder so I think I’d better remember the wetsuit, for sure! Were there sharks? Yeah, they might have prepared me a little bit for coming over here and playing in front of these fans! “There were so many different sports. Growing up I played football, surfed a fair bit. I mean my family is a pretty big surfing family. I played cricket, did Nippers (a club for young surf lifesavers) and a bit of touch football, a bit of everything. In Australia my dad played football so growing up there were never really any other options for me. “As soon as I was old enough to walk, I was kicking a ball around and as soon as I could I got into the local club team and I fell in love with the game. I just grew up playing football and now I’m lucky enough to come and play in the European leagues. That is every young player’s dream in Australia and it’s something I’m really proud of. I’m looking forward to making the most of it.” Nieuwenhof revealed he got a taste of Tynie five years ago – and he jumped at the chance to come back. He said: “I came here in 2018 as part of a football tour around the UK. I remember pretty vividly that we came to a Hearts game – I think it was against Dundee – and I remember how energetic and passionate the fans were. “That was the thing that really stood out for me. The stadium as well, I love it. It is such an awesome stadium. It was good to see them come out for the Leeds game and I’m sure they are going to get behind us this season. That’s something I’m looking forward to. The reception was awesome. I couldn’t believe how many rocked up for a pre-season friendly so I’ve obviously come to a really good club where the fanbase is massive.” Calem Nieuwenhof Nieuwenhof is following a familiar path with plenty of Aussies soaring in Scotland. He’ll have Socceroos Kye Rowles, Cammy Devlin and Nathaniel Atkinson for company in Gorgie and he’s hoping to be the next man from Down Under to make an impact in these parts – so he can blast his way towards the next World Cup . He said: “Talking to a few of the boys back home – I played with Olly Bozanic last season and he spoke nothing but highly about his time here and the league – that helped me make a good decision. I know that there are so many Australians who have come to Scotland and they are all doing well so it has proven to be a really good step forward. “It has shown to be the next level from the A League to come here. The World Cup is something I aspire to, 100 per cent. All the boys in the team now are in the Socceroos and that’s somewhere I want to go. That made my decision to come here even easier because I know that if I come here and perform well I could get a national team call-up. I know it’s now on me.” Nieuwenhof looked the part in the 1-0 defeat to Leeds on Sunday but Hearts are still a work in progress. The 22-year-old said: “It is a different game style than in Australia and this is my first week training with the boys. I definitely have a lot of learning to do and I’m going to learn more from Steven Naismith and the other coaches about how they want us to play. “That is something we can take forward into the league because I know we want to be a team that plays with the ball and dominates other teams. That is a team I want to play in so that is really positive for me. It is very different from Australia and I am being thrust right into it. “That is a real positive in my eyes, the amount of games that we play over here. That is something I’m looking forward to, getting a number of games under my belt and showing good consistency.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Hearts FC Steven Naismith Leeds United FC World Cup","pubDate":"2023-08-01 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30588553.ece/ALTERNATES/s615/0_JS307006161.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Novak Djokovic makes surprising addition to US Open 2023 plans days after raising health concerns post Alcaraz loss","link":"https://www.hindustantimes.com/sports/tennis/novak-djokovic-makes-surprising-addition-to-us-open-2023-plans-raising-health-concerns-post-carlos-alcaraz-loss-101690863896391.html","keywords":null,"creator":null,"video_url":null,"description":"Novak Djokovic is all set to return to U.S soil for the first time in two years after having missed last year's North American hardcourt swing","content":"Novak Djokovic is all set to return to U.S soil for the first time in two years as he revealed Cincinnati Masters 1000 as his only plan for preparation for the 2023 US Open. But on Tuesday, Djokovic left tennis world surprised when he made a new addition to his plans for the final Grand Slam of the calendar year just days after raising health concerns post that heartbreaking loss to Carlos Alcaraz in the Wimbledon final. Novak Djokovic has left everyone surprised with his new US Open plan(REUTERS) Djokovic has his name in the entry list for the first Masters 1000 event of the US Open tune-up - Rogers Cup in Toronto - but he announced his withdrawal from the event last week citing fatigue, thereby extending his stay away from tennis action since that five-setter loss at the SW19 a little over a fortnight back. However, he still had his intentions for an appearance in the Cincinnati Masters, which he had earlier revealed as the only tournament he would appear before heading towards the Flushing Meadows in New York. ALSO READ: Watch: Tennis player collapses during Citi Open match, forced to retire weeks after alarming Wimbledon incident On Tuesday, the Serb took everyone by surprise when he announced that in addition to the singles event, he will also compete in the doubles category alongside compatriot Nikola Cacic, who is presently ranked 57 in the world and has won three ATP titles in his career - Chengdu 2019, Montpellier 2020 and Buenos Aires 2021. Djokovic, meanwhile, has only one ATP doubles title to show, which he had won 13 years back at the AEGON Championships and has a career record of 62 wins and 77 losses This will be the third time that Djokovic will be pairing with Cacic for doubles, but all them happened representing Serbia in team events. The first was in 2021 in ATP Cup (lost to Germany's Jan-Lennard Struff and Alexander Zverev), followed by two in 2022 Davis Cup where they lost to German pair of Tim Puetz and Kevin Krawietz before beating Kazakhstan's Andrey Golubev and Aleksandr Nedovyesov. Djokovic has been more a handful of appearances in the doubles category in recent times - with Vasek Pospisil (Adelaide 1 in 2023), Erlich (Tel Aviv in 2022), Filip Krajinovic (Paris Masters 1000 in 2021), Carlos Gomez- Herrera (Mallorca in 2021, finalists) and Marin Cilic (Dubai in 2020). At the Cincinnati Masters, it will be his third appearance in the category, the last being in 2019, where he had suffered a first-round exit alongside compatriot Janko Tipsarević. He had however reached the quarters in Cincinnati back in 2007 with Nenad Zimonjić as his partner. The doubles entry list at the 2023 Cincinnati Masters also features Andrey Rublev/Max Purcell, Hubert Hurkacz/Mektic Pavic, Alexander Bublik/Adrian Mannarino and Stefanos Tsitsipas/Davidovich Fokina as well. Return to U.S soil Djokovic had missed last year's North American hardcourt swing owing to his stance on Covid vaccination with disallowed him entry into America as per the rules of the government for international travellers. It in fact saw him miss the 2022 US Open as well. Djokovic has won the US Open trophy thrice in his career, the last being in 2018. He did have the chance in 2021 when he had reached the final with a win away from a monumental Calendar Slam before losing in straight sets to Daniil Medvedev. Overall, he has a 81-13 record in New York with eight finals and 12 appearances in semi-final. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Novak Djokovic Carlos Alcaraz Us Open","pubDate":"2023-08-01 04:58:57","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/01/1600x900/TENNIS-AUSOPEN--446_1674565131781_1674565131781_1690864045869.JPG","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Wenn \"Kleinherne\" und \"Nüsken\" zu Zungenbrechern werden","link":"https://www.sportschau.de/fussball/fifa-frauen-wm/wm-melbourne-australien-deutsch-lernen-100.html","keywords":null,"creator":null,"video_url":null,"description":"Jessika Rabe arbeitet seit mehr als 20 Jahren als Deutschlehrerin in Melbourne. Die WM in Australien verfolgt sie genau - und bringt sie auch in den Unterricht.","content":"Stand: 01.08.2023 06:53 Uhr Die sportbegeisterte Jessika Rabe arbeitet seit mehr als 20 Jahren als Deutschlehrerin in Melbourne. Dass die Fußball-WM nun in Australien stattfindet, freut sie sehr. Für die gebürtige Niedersächsin eine klare Sache: Das deutsche Nationalteam ist auch Unterrichtsthema. \"Sophia Klien-hörne\" - \"Kleinherne, fantastisch, wunderbar.\" Und: \"Sjo-key Nuss-ken\" - \"Nüsken, fantastisch - well done.\" Diese Deutschstunde an der Mentone Grammar School in Melbourne ist etwas besonderes. Für die Siebt- und Achtklässler steht die Fußball-WM der Frauen in Down Under auf dem Stundenplan. Und Lehrerin Jessika Rabe lobt ihre Schülerinnen und Schüler. Das Goethe-Institut Australien hat extra Unterrichtsmaterialien erstellt, in denen es um die deutsche Nationalmannschaft geht. Inklusive Namen, die für die normalerweise ja nur Englisch sprechenden Zwölf- bis 14-Jährige gar nicht so einfach auszusprechen sind. Jessika Rabe kommt aus Niedersachsen, aufgewachsen ist sie in Nienhagen in der Nähe der Stadt Celle. Sport hat die Lehrer schon immer begeistert. Als sie Ende der 1990er-Jahre für einen längere Zeit in Australien war, lernte sie ihren heutigen Mann Adam kennen. Nach der Jahrtausendwende zog sie zu ihm nach Melbourne. Heute hat das Paar drei Kinder, die zweisprachig aufwachsen. An der Mentone Grammar School ist Deutsch für viele Kinder die erste Fremdsprache. Das Urteil fällt gemischt aus: \"Ick finde Deutsch supa\", sagt Holly und lacht. \"Ich finde Deutsch kompliziert\", sagt Lukas. Luca kann mit Abstand am besten Deutsch. \"Mein Papa ist deutsch, er hat es mir beigebracht\", erklärt der Junge. Alternative zum Deutschunterricht ist vor allem Chinesisch, das an der Privatschule auch im Präsenzunterricht angeboten wird. Spanisch oder Französisch gibt es als E-Learningkurse. So lernen auch die 15-jährige Lilly und ihr kleiner Bruder Jonty die Sprache ihrer Mutter - allerdings zu Hause. Denn an ihrer Schule gibt es keinen Deutschunterricht. Jessika will aber keinen Druck ausüben, weil sie weiß, dass ihre Kinder mit dem normalen Schulunterricht meist schon genug ausgelastet sind. Lilly war für ein paar Wochen in Deutschland an einer Schule. Ihre vier Jahre ältere Schwester Yani hat bereits ihr Abitur gemacht und an einem Schüleraustausch teilgenommen. \"Wir sind deutsch, aber das ist bei uns kein riesiges Ding\", sagt Yani. \"Unsere Freunde würden nur auch gerne eine andere Sprache so gut sprechen können.\" In Australien leben über 100.000 Deutsche. Rund ein Fünftel davon in Melbourne - die Stadt hat damit die größte deutsche Gemeinde des Landes. Melbourne ist multikulturell - auch viele Griechen, Italiener oder Schotten hat es im 20. Jahrhundert hierher verschlagen. \"Genau das mag ich an meiner Heimatstadt\", sagt Vater Adam, der als Professor für Unternehmertum und Innovationen arbeitet. Das Spiel der DFB-Elf gegen Marokko in Melbourne schaute sich Jessica Rabe mit ihrer Familie im Stadion an. Bei ihm stehen eigentlich Australian Football, Cricket, Rugby, Golf, Tennis und auch Leichtathletik vor dem europäischen Soccer, den eigentlich nur Jessika und Jonty interessiert verfolgen. Beim ersten deutschen Spiel in Melbourne war dann aber doch die ganze Familie im Stadion - und nach dem 6:0-Erfolg gegen Marokko begeistert. Und auch die zweite Chance auf ein deutsches Spiel haben sie sich nicht entgehen lassen: Sie haben Karten für das Achtelfinale am 8. August. Nach der 1:2-Niederlage gegen Kolumbien sieht es aber eher danach aus, dass die DFB-Frauen - wenn überhaupt - in der Runde der besten 16 in Adelaide antreten müssen. \"Wenn wir schon nicht Deutschland zu sehen bekommen, dann zumindest Kolumbien mit Linda Caicedo. Sie wird der nächste Superstar\", ist Jessika überzeugt. So ganz hat sich von Gedanken, beim deutschen Achtelfinale dabei zu sein, allerdings noch nicht verabschiedet. \"Die DFB-Frauen müssen sich ein Beispiel an Australien nehmen, alles ist möglich. Sie müssen es genauso machen wie Australien gegen Kanada\", hofft die 51-Jährige, die den 4:0-Erfolg der \"Matildas\" zusammen mit der ganzen Familie vor dem Fernseher verfolgt hat. \"Wir haben wie verrückt gejubelt.\" 31.07.2023 Nach der ersten Niederlage bei der WM bringt die deutschen Fußballerinnen nur ein eigener Sieg im letzten Gruppenspiel sicher ins Achtelfinale. Doch es gibt noch andere Szenarien fürs Weiterkommen. mehr In Melbourne wird trotzdem weiter Deutsch gelernt. \"Hört genau zu: Wie heißt die Spielerin und was ist ihr Spitzname\", fragt Lehrerin Jessika Rabe ihre Schülerinnen und Schüler. Das Goethe-Instut hat Video-Interviews mit Jule Brand, Nicole Anyomi, Nüsken, Kleinherne und Maximiliane Rall, die es nicht in den WM-Kader geschafft hat, geführt. Auf Fragebögen sollen die richtigen Antworten angekreuzt werden. \"Ich glaube, sie hat 2000 gesagt\", vermutet Anish bei der Frage nach dem Geburtsdatum von Anyomi. Außerdem geht es um Hobbys, Musik oder auch das Lieblingsessen. Jessika Rabe ist sehr zufrieden mit den WM-Unterrichtsstunden. \"Die sind sehr gut angekommen. Natürlich lernen die Schülerinnen und Schüler viel lieber so etwas über die deutsche Kultur als Verben zu konjugieren oder sich mit dem Präteritum zu beschäftigen\", sagt sie lachend. 31.07.2023 WM-Gastgeber Australien hat das \"Alles-oder-nichts\"-Spiel gegen Kanada überraschend klar dominiert und bleibt nach einem mitreißenden Auftritt im Turnier. mehr analyse 30.07.2023 Nach vorne gelang den Spielerinnen von Bundestrainerin Martina Voss-Tecklenburg fast nichts. Und in zwei Situationen sahen sie auch hinten schlecht aus. mehr 31.07.2023 Das zweite WM-Gruppenspiel brachte neben der bitteren Niederlage auch eine neue Verletzte. Dafür steht gegen Südkorea Marina Hegering wieder zur Verfügung. mehr Dieses Thema im Programm: Das Erste | Sportschau FIFA Frauen WM | 02.08.2023 | 08:35 Uhr","pubDate":"2023-08-01 04:53:14","image_url":null,"source_id":"sportschau","category":["sports"],"country":["germany"],"language":"german"}]}