{"newsArray":[{"title":"India's Tour To South Africa To Can Be Postponed For A Week","link":"https://www.sentinelassam.com/sports/cricket/indias-tour-to-south-africa-to-can-be-postponed-for-a-week-565905","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Notably, Sports Minister Anurag Thakur had asked BCCI to take approval from the government before sending the team to South Africa.","content":"New Delhi: In the wake of COVID-19 variant Omicron, India's tour of South Africa can be postponed for a week.Reportedly, it was also feared that this tour could also be canceled in the current circumstances. However, recently the Board of Control for Cricket in India (BCCI) President Sourav Ganguly said that so far no decision has been taken in this regard.As per the schedule, from December 17, India will play three-Test series in South Africa. On the other hand, a three-match ODI series is to be played on January 11 and then a four-match T20 series from January 19. According to the pre-decided schedule, India has to leave for South Africa on December 9.\"We are discussing extending the series by a week. This can be done due to the Omicron variant of the corona virus. We are waiting for the approval of the Government of India. The cricket boards of both the countries like BCCI and CSA are in touch with each other and discussing every aspect. The health and safety of the cricketers is paramount,'' a BCCI official was quoted by media as saying.Notably, Sports Minister Anurag Thakur had asked BCCI to take approval from the government before sending the team to South Africa. \"Not only BCCI but every board should take permission from the Government of India before sending the team to the country where a new variant of Corona has been found. If BCCI asks us only then we can take further steps,\" he had said.Presently, India A team is also on a tour of South Africa.The COVID-19 tally in South Africa nearly doubled in a day, signaling a dramatic surge in the country. According to official statistics, new confirmed cases rose to 8,561 Wednesday from 4,373 a day earlier.Following the new cases, which were reported on Wednesday represent a 16.5% COVID-19 positive rate in South Africa.Also read:Focus on pitch, team combination and weather as India gear up for 2nd TestAlso watch:","pubDate":"2021-12-02 10:30:23","full_description":"New Delhi: In the wake of COVID-19 variant Omicron, India's tour of South Africa can be postponed for a week. Reportedly, it was also feared that this tour could also be canceled in the current circumstances. However, recently the Board of Control for Cricket in India (BCCI) President Sourav Ganguly said that so far no decision has been taken in this regard. As per the schedule, from December 17, India will play three-Test series in South Africa. On the other hand, a three-match ODI series is to be played on January 11 and then a four-match T20 series from January 19. According to the pre-decided schedule, India has to leave for South Africa on December 9. \"We are discussing extending the series by a week. This can be done due to the Omicron variant of the corona virus. We are waiting for the approval of the Government of India. The cricket boards of both the countries like BCCI and CSA are in touch with each other and discussing every aspect. The health and safety of the cricketers is paramount,'' a BCCI official was quoted by media as saying. Notably, Sports Minister Anurag Thakur had asked BCCI to take approval from the government before sending the team to South Africa. \"Not only BCCI but every board should take permission from the Government of India before sending the team to the country where a new variant of Corona has been found. If BCCI asks us only then we can take further steps,\" he had said. Presently, India A team is also on a tour of South Africa. The COVID-19 tally in South Africa nearly doubled in a day, signaling a dramatic surge in the country. According to official statistics, new confirmed cases rose to 8,561 Wednesday from 4,373 a day earlier. Following the new cases, which were reported on Wednesday represent a 16.5% COVID-19 positive rate in South Africa. Also read: Focus on pitch, team combination and weather as India gear up for 2nd Test Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/02/276973-sa.jpg","source_id":"sentinel"},{"title":"Uncertainty over India's South Africa tour","link":"https://www.perthnow.com.au/sport/cricket/uncertainty-over-indias-south-africa-tour-c-4792289","keywords":null,"creator":["Sudipto Ganguly"],"video_url":null,"description":"A decision on whether India's 10-match cricket tour of South Africa will proceed is expected within days, according to Virat Kohli.","content":null,"pubDate":"2021-12-02 09:41:53","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4792289/96c06a5fc1e1c427bfb178fae6fd81b358246734-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Uncertainty over India's South Africa tour","link":"https://thewest.com.au/sport/cricket/uncertainty-over-indias-south-africa-tour-c-4792284","keywords":null,"creator":["Sudipto Ganguly"],"video_url":null,"description":"A decision on whether India's 10-match cricket tour of South Africa will proceed is expected within days, according to Virat Kohli.","content":null,"pubDate":"2021-12-02 09:41:34","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4792284/96c06a5fc1e1c427bfb178fae6fd81b358246734-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Cricket: CSA postpones provincial fixtures due to COVID-19 ","link":"https://www.channelnewsasia.com/sport/cricket-csa-postpones-provincial-fixtures-due-covid-19-2353641","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 09:24:34","full_description":"CAPE TOWN : Cricket South Africa have postponed the latest round of matches in division two of the country’s four-day provincial competition after a number of COVID-19 cases, the move coming just two weeks before the start of a three-test series with India. The provincial sides involved have not been staying in bio-secure environments ahead of the three matches that were scheduled to start on Thursday. Sport in South Africa began to shut down last week following the emergence of the Omicron new coronavirus variant, with travel bans and restrictions on flights leaving rugby teams and golfers scrambling to leave the country. \"In the last couple of days, some positive COVID-19 test results have emerged following team pre-arrival testing sessions,\" CSA said in a statement. \"Activating the precautionary and preventative measures stipulated in the organisation’s COVID-19 protocols to ensure the health, safety and well-being of all involved is a top priority for CSA.\" None of the teams feature players expected to be selected for the test series against India, which is due to start in Johannesburg on Dec. 17, but will spark alarm as COVID-19 cases continue to rise sharply in the country. India are scheduled to board their charter flight for South Africa soon after the second test against New Zealand ends on Dec. 7, though reports in the country have stated the Board of Control for Cricket in India will make a decision on whether to postpone the tour by Sunday. CSA director of cricket Graeme Smith told reporters that no discussions on a postponement had yet taken place. (Reporting by Nick Said; Editing by Peter Rutherford)","image_url":null,"source_id":"channelnewsasia"},{"title":"Cricket: Fate of India&#039;s South Africa tour should be known in days, says Kohli","link":"https://www.thestar.com.my/sport/cricket/2021/12/02/cricket-fate-of-india039s-south-africa-tour-should-be-known-in-days-says-kohli","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - India cricketers expect to know in the next few days whether their tour of South Africa later this month will go ahead following the emergence there of the Omicron coronavirus variant, captain Virat Kohli said on Thursday. Read full story","content":null,"pubDate":"2021-12-02 09:16:00","full_description":"MUMBAI (Reuters) - India cricketers expect to know in the next few days whether their tour of South Africa later this month will go ahead following the emergence there of the Omicron coronavirus variant, captain Virat Kohli said on Thursday. Sport in South Africa began to shut down last week following the emergence of Omicron, with travel bans and restrictions on flights leaving rugby teams and golfers scrambling to leave the country. South Africa are set to host India in a three-test series starting in Johannesburg on Dec. 17 followed by three one-day internationals (ODI) and four Twenty20 matches. \"We're not playing in normal times anyways,\" Kohli told reporters ahead of India's second and final test against New Zealand in Mumbai from Friday. \"So there's a lot of planning that's involved. There's a lot of preparation that's involved in terms of understanding exactly what's going on. \"There are players who are not part of the group right now who will be entering quarantine to join the team in the bubble to fly in a charter (aircraft) those kinds of things. You want to seek clarity as soon as possible.\" Indian cricket board (BCCI) chief Sourav Ganguly told Reuters last week that they were monitoring the situation in South Africa. When asked if there were discussions to postpone the India tour, Ganguly's Cricket South Africa counterpart Graeme Smith told reporters: \"Nothing like this has been discussed.\" Kohli said coach Rahul Dravid has initiated discussions among the senior members of the Indian squad regarding the upcoming tour. \"We've been talking to the board and we are pretty confident within a day or two or pretty soon we'll have absolute clarity as to what is going on,\" said Kohli. \"But yeah, look, we need to be realistic about things as well. We cannot just ignore the things that potentially could put you in a confusing place and no one wants to be there. \"So I'm sure everyone's working hard towards finding clarity and giving us the situation as it unfolds as soon as possible. And we all are hopeful that will happen soon.\" (Reporting by Sudipto Ganguly in Mumbai; additional reporting by Nick Said in Cape Town; editing by Simon Cameron-Moore)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/02/1390028.jpg","source_id":"thestar_my"},{"title":"Cricket South Africa postpones round 4 of Division 2 matches due to rise in COVID-19 cases","link":"https://www.indiatoday.in/sports/cricket/story/cricket-south-africa-postpones-round-4-of-division-2-matches-due-to-rise-in-covid-19-cases-1883329-2021-12-02?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa postpones Division 2 fixtures due to positive COVID-19 cases","content":null,"pubDate":"2021-12-02 09:14:35","full_description":"Cricket South Africa has postponed the latest round of matches in division two of the country’s four-day provincial competition after a number of COVID-19 cases, the move coming just two weeks before the start of a three-Test series with India. The provincial sides involved have not been staying in bio-secure environments ahead of the three matches that were scheduled to start on Thursday. Sport in South Africa began to shut down last week following the emergence of the Omicron new coronavirus variant, with travel bans and restrictions on flights leaving rugby teams and golfers scrambling to leave the country. \"In the last couple of days, some positive COVID-19 test results have emerged following team pre-arrival testing sessions,\" CSA said in a statement. \"Activating the precautionary and preventative measures stipulated in the organisation’s COVID-19 protocols to ensure the health, safety and well-being of all involved is a top priority for CSA.\" None of the teams feature players expected to be selected for the Test series against India, which is due to start in Johannesburg on Dec. 17, but will spark alarm as COVID-19 cases continue to rise sharply in the country. India are scheduled to board their charter flight for South Africa soon after the second test against New Zealand ends on Dec. 7, though reports in the country have stated the Board of Control for Cricket in India will make a decision on whether to postpone the tour by Sunday. CSA director of cricket Graeme Smith told reporters that no discussions on a postponement had yet taken place. Live TV Also Read | Virat Kohli on India's tour of South Africa: We'll have clarity soon Also Read | India tour of South Africa likely to be pushed back by a week amid fears over Omicron","image_url":null,"source_id":"indiatoday"},{"title":"Cricket: Australia are &#039;beatable&#039; on home turf - Anderson","link":"https://www.thestar.com.my/sport/cricket/2021/12/02/cricket-australia-are-039beatable039-on-home-turf---anderson","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Australia are no longer a dominant force on home soil and England have real belief they can secure victory in the upcoming Ashes series, fast bowler James Anderson said ahead of next week's opening test at the Gabba. Read full story","content":null,"pubDate":"2021-12-02 09:13:00","full_description":"(Reuters) - Australia are no longer a dominant force on home soil and England have real belief they can secure victory in the upcoming Ashes series, fast bowler James Anderson said ahead of next week's opening test at the Gabba. England have lost nine of their last 10 test matches in Australia, but Anderson said the tourists were ready to turn things around. \"We believe we have got a group of players who can win. I'm not just saying that,\" he told the BBC. \"Quite often you do say that because you have to be positive, but we do genuinely believe we can win out here.\" Anderson pointed to the recent success of India and South Africa in Australia as proof the hosts were beatable over the five-match series. \"It's not like years ago when they were such a dominant force, you would go there tentatively,\" added the 39-year-old, who will likely be playing his final Ashes in Australia. He added that the impressive form of captain Joe Root and the return of Ben Stokes would boost England's chances of victory. \"We've got some world-class players. We've got the best batsman in the world and the best all-rounder in the world,\" Anderson said. The series begins in Brisbane on Dec. 8. Australia retained the Ashes in 2019 after a 2-2 draw in England. (Reporting by Aadi Nair in Bengaluru; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/02/1390023.jpg","source_id":"thestar_my"},{"title":"Cricket: Australia are 'beatable' on home turf - Anderson","link":"https://www.channelnewsasia.com/sport/cricket-australia-are-beatable-home-turf-anderson-2353616","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 09:09:23","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--0wsAnsQZ--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-02t090649z_1_lynxmpehb10bc_rtroptp_3_cricket-test-eng-ind.jpg?itok=HQoL3rES","source_id":"channelnewsasia"},{"title":"Cricket: Fate of India's South Africa tour should be known in days, says Kohli","link":"https://www.channelnewsasia.com/sport/cricket-fate-indias-south-africa-tour-should-be-known-days-says-kohli-2353606","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 09:04:43","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--qgAZPEoP--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-02t090136z_2_lynxmpehb10b0_rtroptp_3_cricket-test-ind-nzl.jpg?itok=u5NoUbaC","source_id":"channelnewsasia"},{"title":"WA Sports Minister Tony Buti’s cricket gaffe brings more confusion over Perth’s hopes to stage Ashes Test","link":"https://www.perthnow.com.au/sport/the-ashes/wa-sports-minister-tony-butis-cricket-gaffe-brings-more-confusion-over-perths-hopes-to-stage-ashes-test-c-4791037","keywords":null,"creator":["Peter Law"],"video_url":null,"description":"WA Sports Minister Tony Buti has wrongly claimed there was no Test cricket played in the Eastern States last summer as he held out hope Perth may still host the Ashes.","content":null,"pubDate":"2021-12-02 08:14:01","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4791037/9549f92d9b296a1b7efda3d7a84e09821e8eb6a3-16x9-x611y450w4240h2385.jpg","source_id":"perthnow"},{"title":"Record sporting victories with massive winning margins as Irish women’s football team make history","link":"https://www.thesun.ie/sport/8006028/record-sporting-victories-winning-margins-irish-women/","keywords":["Sport"],"creator":["Fionnuala Walsh"],"video_url":null,"description":"ON Tuesday night, the Irish women’s football team made history when they defeated Georgia 11-0. This was the biggest ever win by an Irish international football team and the game was also watched by a record number for a women’s match. An average of 209,000 people tuned in, with numbers peaking at 340,000 towards the […]","content":"ON Tuesday night, the Irish women’s football team made history when they defeated Georgia 11-0. This was the biggest ever win by an Irish international football team and the game was also watched by a record number for a women’s match. Republic of Ireland’s Katie McCabe and Denise O’Sullivan applaud the fans after winPA An average of 209,000 people tuned in, with numbers peaking at 340,000 towards the end of the game. Denise O’Sullivan had a hat-trick, Katie McCabe scored two, while Kyra Carusa, Lucy Quinn, Saoirse Noonan, Amber Barrett and Megan Connolly all netted one each, with an own goal by Georgia making it 11. It was a magnificent night for the Irish, beating their previous record of a 9-0 victory. However, it is not the highest score in a single match. Here NICOLA BARDON looks at some of cricket score-like results that have been put in the board in footie, GAA and rugby. STOCKPORT COUNTY vs HALIFAX TOWN 13-0 (Football) The highest score in a league match is 13 and this first happened in January 1934 when Stockport thumped Halifax. It was an English Third Division fixture and was the league debut for Halifax goalie Stanley Milton. While he was doing well at half-time, keeping it at 2-0, the second half proved disastrous. NEWCASTLE UNITED vs NEWPORT COUNTY 13-0 (Football) Back in October 1946, Newcastle beat Newport 13-0 in an English Second Division fixture. It was the debut for the Magpies’ Len Shackleton and he scored six of the goals. This included a hat-trick in just two and a half minutes. AUSTRALIA vs AMERICAN SAMOA 31-0 (Football) It is the biggest win ever recorded in an international soccer match. Back in 2001, for their 2002 World Cup qualifier, Australia annihilated American Samoa by 31 goals. Archie Thompson put 13 of those in the back of the net. Despite this, the Aussies failed to qualify for the World Cup. AUSTRALIA vs NAMIBIA 142-0 (Rugby) Back in 2003, the Wallabies welcomed the African team Namibia to Adelaide. But it was like they never arrived after the Aussies beat them 142-0 with 22 tries on the day. And Chris Latham scored five of them. BRAZIL vs NICARAGUA 14-0 (Football) In 1975, the Pan American Games saw a match between these two nations. It was a Group D game, and Brazil emerged on top, scoring three goals within the first five minutes. It ended 14-0, with Luis Alberto netting four goals. GERMANY vs SAN MARINO 13-0 (Football) As part of their Euro 2008 qualifiers, San Marino played Germany at home in September 2006. It became the record-winning margin by any team in the European Championship. Lukas Podolski scored four and San Marino were knocked out of the tournament. GALWAY vs ANTRIM 10-23 to 0-01 (GAA) There won’t be many people who will know of this score, but back in 1900 Galway faced Antrim in the All-Ireland hurling semi-final. It ended up being a landslide, with Galway winning by 52 points — 10-23 to 0-01. ENGLAND vs LATVIA 20-0 (Football) Ireland were not the only women’s team breaking records on Tuesday night, as the England Lionesses smashed home 20 goals in their game against Latvia. Lauren May Hemp was responsible for four of those at the Keepmoat Stadium as part of their World Cup qualifying campaign. NEW ZEALAND vs JAPAN 145-17 (rugby) The All Blacks are tough to play and Japan learned that in spades when they faced them in 1995 in the World Cup in South Africa. There were 162 points scored in the match, but unfortunately for the Japanese, most of them were by the Kiwis. It ended with 21 tries for the All Blacks and a scoreline of 145-17. AS ADEMA vs SO L’EMYRNE 149-0 (Football) It is recorded in the Guinness Book of Records as the largest ever margin win in football. You might wonder how they could have let 149 goals in in a 90-minute match, but it turns out the 2002 game was a protest by SO l’Emyrne, — who purposely conceded the goals to protest refereeing decisions made on the day. The team’s coach and four of their players were suspended but the referee received no punishment. ADAMSTOWN vs CLONEE 15-14 to 0-0 (GAA) Junior football can often go under the radar but this game captured the nation’s attention after the Wexford side won by a 59-point margin against Meath’s Clonee. Adamstown player Johnny Connors was responsible for seven of the goals and two of the points. WEXFORD V KILKENNY 17-20 to 0-1 (GAA) They are forces to be dealt with in hurling, but the Kilkenny minor team had a wake-up call in 2016 when they lost by 70 points. Wexford put in two goals in the opening minutes and the scores just kept coming.","pubDate":"2021-12-02 08:00:00","full_description":"ON Tuesday night, the Irish women’s football team made history when they defeated Georgia 11-0. This was the biggest ever win by an Irish international football team and the game was also watched by a record number for a women’s match. An average of 209,000 people tuned in, with numbers peaking at 340,000 towards the end of the game. Denise O’Sullivan had a hat-trick, Katie McCabe scored two, while Kyra Carusa, Lucy Quinn, Saoirse Noonan, Amber Barrett and Megan Connolly all netted one each, with an own goal by Georgia making it 11. It was a magnificent night for the Irish, beating their previous record of a 9-0 victory. However, it is not the highest score in a single match. Here NICOLA BARDON looks at some of cricket score-like results that have been put in the board in footie, GAA and rugby. The highest score in a league match is 13 and this first happened in January 1934 when Stockport thumped Halifax. It was an English Third Division fixture and was the league debut for Halifax goalie Stanley Milton. While he was doing well at half-time, keeping it at 2-0, the second half proved disastrous. Back in October 1946, Newcastle beat Newport 13-0 in an English Second Division fixture. It was the debut for the Magpies’ Len Shackleton and he scored six of the goals. This included a hat-trick in just two and a half minutes. It is the biggest win ever recorded in an international soccer match. Back in 2001, for their 2002 World Cup qualifier, Australia annihilated American Samoa by 31 goals. Archie Thompson put 13 of those in the back of the net. Despite this, the Aussies failed to qualify for the World Cup. Back in 2003, the Wallabies welcomed the African team Namibia to Adelaide. But it was like they never arrived after the Aussies beat them 142-0 with 22 tries on the day. And Chris Latham scored five of them. In 1975, the Pan American Games saw a match between these two nations. It was a Group D game, and Brazil emerged on top, scoring three goals within the first five minutes. It ended 14-0, with Luis Alberto netting four goals. As part of their Euro 2008 qualifiers, San Marino played Germany at home in September 2006. It became the record-winning margin by any team in the European Championship. Lukas Podolski scored four and San Marino were knocked out of the tournament. There won’t be many people who will know of this score, but back in 1900 Galway faced Antrim in the All-Ireland hurling semi-final. It ended up being a landslide, with Galway winning by 52 points — 10-23 to 0-01. Ireland were not the only women’s team breaking records on Tuesday night, as the England Lionesses smashed home 20 goals in their game against Latvia. Lauren May Hemp was responsible for four of those at the Keepmoat Stadium as part of their World Cup qualifying campaign. The All Blacks are tough to play and Japan learned that in spades when they faced them in 1995 in the World Cup in South Africa. There were 162 points scored in the match, but unfortunately for the Japanese, most of them were by the Kiwis. It ended with 21 tries for the All Blacks and a scoreline of 145-17. It is recorded in the Guinness Book of Records as the largest ever margin win in football. You might wonder how they could have let 149 goals in in a 90-minute match, but it turns out the 2002 game was a protest by SO l’Emyrne, — who purposely conceded the goals to protest refereeing decisions made on the day. The team’s coach and four of their players were suspended but the referee received no punishment. Junior football can often go under the radar but this game captured the nation’s attention after the Wexford side won by a 59-point margin against Meath’s Clonee. Adamstown player Johnny Connors was responsible for seven of the goals and two of the points. They are forces to be dealt with in hurling, but the Kilkenny minor team had a wake-up call in 2016 when they lost by 70 points. Wexford put in two goals in the opening minutes and the scores just kept coming.","image_url":null,"source_id":"thesun_ie"},{"title":"IND vs NZ: Test cricket returns to Wankhede after 2016 as India, New Zealand face off in 2nd Test","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-test-cricket-returns-to-wankhede-after-2016-as-india-new-zealand-face-off-in-2nd-test-747748","keywords":null,"creator":null,"video_url":null,"description":"The iconic Wankhede Stadium, which has hosted several high-profile matches, including the 2011 ODI World Cup final, will host a Test after almost five years when India take on New Zealand in the second match of the series.","content":null,"pubDate":"2021-12-02 07:57:23","full_description":"The iconic Wankhede Stadium, which has hosted several high-profile matches, including the 2011 ODI World Cup final, will host a Test after almost five years when India take on New Zealand in the second match of the series. The last Test, which the South Mumbai ground hosted was against England from December 8-12, 2016 against England, which the hosts won by an innings and 36 runs. The venue has hosted 25 Test matches and India have won 11 of them while losing seven and the rest of the seven were drawn games. The first Test at this ground was played against the West Indies, in January 1975 and the visitors had then thrashed the hosts by 201 runs. India had recorded their first Test win at the Wankhede against New Zealand in 1976 by 162 runs and Sunil Gavaskar had scored 119 in the first innings. For the record, the visitors New Zealand last played a Test here in November 1988 and had won that game by 136 runs. The Mumbai Cricket Association (MCA) is taking all precautions on its part and is adhering to the COVID-19 protocols laid down by the Maharashtra government with only 25 per cent spectators allowed on each of the five days. Last time, when India played here, skipper has scored a monumental 235, so come Friday it remains to be seen where the skipper, who had taken a break for the first test, can score another daddy hundred, which has been missing for the past two years.","image_url":null,"source_id":"indiatvnews"},{"title":"Wasim Jaffer Names Two Players Who Could Make Way For Virat Kohli In India's Playing XI vs New Zeala.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL3dhc2ltLWphZmZlci1uYW1lcy10d28tcGxheWVycy13aG8tY291bGQtbWFrZS13YXktZm9yLXZpcmF0LWtvaGxpLWluLWluZGlhcy1wbGF5aW5nLXhpLXZzLW5ldy16ZWFsYW5kLTI2MzM4ODbSAaUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaW5kaWEtdnMtbmV3LXplYWxhbmQtMjAyMS93YXNpbS1qYWZmZXItbmFtZXMtdHdvLXBsYXllcnMtd2hvLWNvdWxkLW1ha2Utd2F5LWZvci12aXJhdC1rb2hsaS1pbi1pbmRpYXMtcGxheWluZy14aS12cy1uZXctemVhbGFuZC0yNjMzODg2L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Wasim Jaffer Names Two Players Who Could Make Way For Virat Kohli In India's Playing XI vs New Zeala..  NDTVSports.comIndia vs New Zealand, 2nd Test: Weather, combination worry for Captain Virat Kohli as series on line for Team India | Cricket News  Times of IndiaWho goes out of India's XI when Virat Kohli comes in?  ESPNcricinfo.comIND vs NZ 2021: Zaheer Khan Says India Might Drop An Opener To Make Way For Virat Kohli In The Second Test, Cheteshwar Pujara Could Open  Cricket Addictor'Selecting playing XI with Virat back': Jaffer shares hilarious 'Hera Pheri' clip to describe selection dilemma  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2021-12-02 07:54:08","image_url":null,"source_id":"google"},{"title":"UDK vs GBM Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Inter District T20 2021, Match 20","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/udk-vs-gbm-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-inter-district-t20-2021-match-20?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 07:26:50","full_description":"Uttar Dinajpur Kulik Bird (UDK) will take on Gour Badsha Malda (GBM) in the 20th match of the Bengal Inter District T20 2021 at the Bengal Cricket Academy Ground in Kalyani on Thursday. Uttar Dinajpur Kulik Bird started their Bengal Inter District T20 2021 campaign in style by registering a handsome 34-run win over the Manbhum Warriors. Gour Badsha Malda, meanwhile, suffered a terrible defeat at the hands of Hooghly Rivers as they lost the game by seven wickets. They will look to turn things around today. UDK XI Aniket Jha, Debasish Saha (c), Satu Chowdhury, Rabi Sankar Prasad, Debayan Kiskoo, Bibek Das, Arnab Mondal, Narayan Rana, Rahul Saha, Anup Sanyashi, Uday Modak GBM XI Pratik Das, Najibul Sk, Manas Roy Choudhury (wk), Md Nizamuddin (c), Ananta Pramanik, Md Firoz Hossain, Mrityunjoy Mandal, Jhantu Sanyal, Asit Gupta, Sayan Dutta, Bakul Das UDK vs GBM, Bengal Inter District T20 2021, Match 20 Date and Time: 2nd December, 2021, 12:45 PM IST Venue: Bengal Cricket Academy Ground, Kalyani The surface at the Bengal Cricket Academy Ground in Kalyani is expected to favor the batters, as seen in previous Bengal Inter District T20 2021 matches. Bowlers will look to make the most of the conditions upfront and pick up a few wickets in the powerplay overs. Wicketkeeper M Nizamuddin is a must-have wicketkeeper-batter for your Dream11 fantasy side. He’s safe behind the stumps and can also score important runs. Batters M Firoz Hussain, known for his patient and calculative approach to batting, could play a big knock today. He also picked up a wicket in the first game. R Sankar Prasad had a phenomenal outing in the previous match against the Manbhum Warriors. He scored 45 runs and also scalped two wickets. Prasad will be a wonderful captaincy choice for your UDK vs GBM Dream11 fantasy team. All-rounder M Mandal is an excellent all-rounder with plenty of experience. Mandal, who picked up two wickets in the previous game, has been in fine form. Bowlers N Rana will be leading Uttar Dinajpur's bowling unit today. He picked up two wickets and scored 11 runs in the previous game. R Sankar Prasad (UDK) – 125 points N Rana (UDK) – 98 points M Mandal (GBM) – 67 points S Chowdhury (UDK) – 63 points A Mondal (UDK) – 61 points R Sankar Prasad: 45 runs and 2 wickets N Rana: 11 runs and 2 wickets M Mandal: 9 runs and 2 wickets S Chowdhury: 2 wickets A Mondal: 8 runs and 1 wicket Fantasy Suggestion #1: D Saha, M Nizamuddin, R Sankar Prasad, M Firoz Hossain, A Jha, M Mandal, S Chowdhury, A Mondal, N Rana, B Das, S Dutta Captain: R Sankar Prasad. Vice-captain: M Mandal. Fantasy Suggestion #2: D Saha, M Nizamuddin, R Sankar Prasad, M Firoz Hossain, A Jha, M Mandal, S Chowdhury, A Mondal, N Rana, B Das, U Modak Captain: S Chowdhury. Vice-captain: N Rana.","image_url":"https://static.sportskeeda.com/editor/2021/12/74602-16384240047377-1920.jpg","source_id":"sportskeeda"},{"title":"IND vs NZ Dream11 Team Prediction, Fantasy Cricket Hints INDIA vs NEW ZEALAND: Captain, Probable Playing 11s, Team News; Injury Updates For the 2nd Test at Wankhede Stadium, Mumbai at 9.30 AM IST December 3","link":"https://zeenews.india.com/cricket/ind-vs-nz-dream11-team-prediction-fantasy-cricket-hints-india-vs-new-zealand-captain-probable-playing-11s-team-news-injury-updates-for-the-2nd-test-at-wankhede-stadium-mumbai-at-9-30-am-ist-december-3-2415403.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ Dream11 Team Prediction India vs New Zealand Test series","content":null,"pubDate":"2021-12-02 07:21:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Warne feels for Vaughan as commentator’s Australian arrival up in air","link":"https://www.theage.com.au/sport/cricket/warne-feels-for-vaughan-as-commentator-s-australian-arrival-up-in-air-20211202-p59e9i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Former England skipper Michael Vaughan is still set to feature on Fox Cricket’s Ashes coverage this summer, provided he can get to Australia after testing positive to COVID-19.","content":null,"pubDate":"2021-12-02 07:05:32","full_description":"Former England skipper Michael Vaughan is still set to feature on Fox Cricket’s Ashes coverage this summer, provided he can get to Australia after testing positive to COVID-19, despite being embroiled in the Yorkshire racism scandal. It comes as British broadcaster BT Sport made plans to ensure his commentary would not be seen in the northern hemisphere, while fellow Fox Sports commentator Shane Warne said he felt for his former international opponent amid the recent controversy. Vaughan had previously been removed from BBC Radio’s coverage. Fox Cricket commentators Michael Vaughan and Shane Warne in 2019. Credit: Getty Vaughan’s immediate future as a commentator has been under a cloud following claims by former Yorkshire cricketer Azeem Rafiq that he heard Vaughan say, “there’s too many of you lot, we need to do something about that” to four Asian players before a match in 2009. Vaughan has strenuously denied the allegations, as well as making any racist remarks during his time as a professional cricketer, but has been removed by the BBC Radio’s Test Match Special team for the Ashes. “I just remember it clearly that I was proud as punch that we had four Asian players representing Yorkshire County Cricket Club,” Vaughan said recently in a BBC interview. Vaughan, however, has been told by the BBC he can expect to work with them again in the future. Fox Sports wants Vaughan to continue with them but his situation has been complicated by the fact he was unable to board a flight to Australia this week because of a “frustrating” positive COVID-19 test. Executive director of Fox Sports, Steve Crawley, told the Herald Vaughan would miss the first Test but would likely be in Australia later in the series. “I spoke to him a couple of nights ago and it’s complicated,” Crawley said. “I’m keeping an eye on the situation with quarantine and border closures. I don’t know when he’s going to get here. I know he’s not going to be here for the first Test. It’s just a matter of monitoring when he could get here.” Crawley declined to comment when asked about the network’s position on Vaughan in light of the Yorkshire saga, or BT Sport’s decision to remove him from their coverage. Meanwhile, Australian cricket great Warne did not elaborate at length when asked for his views on Vaughan’s broadcasting issue, but said he hoped his former rival overcame COVID-19. “I feel for Michael Vaughan at the moment,” Warne told the Herald . “I hope it all gets resolved very quickly. “Vaughany is coming to my house on Christmas Day, so I hope he gets over his COVID. He is spending Christmas Day with my family and I. “I think he’s a fantastic commentator, a good addition to our team at Fox Cricket, and we’re looking forward to him coming out. Hopefully he’s out here soon.” UK broadcaster BT Sport have announced they will take Fox Sports’ feed throughout the series but do not want Vaughan on their coverage. As a solution, BT Sport is willing to bring in a separate commentary team to call Tests when Vaughan is on air for Fox Sports. “Given these recent events and the controversy with the situation, we have taken the decision that including Michael Vaughan within our Ashes coverage would not be editorially appropriate or fit with BT Sport’s values,” read a BT Sport statement. “We are still finalising plans but we are assessing the option of taking a hybrid approach, using Fox commentary where possible with the aim of putting our own commentary team in place if necessary.” In a statement, the BBC said: “We’re in regular contact with Michael and have had positive conversations with him in recent days. Our contributors are required to talk about relevant issues, so Michael’s involvement in a story of such significance means it’s not possible for him to be part of our Ashes coverage or wider cricket coverage at the moment. We’re pleased with how our conversations are going and expect to work with Michael again in the future. He remains on contract to the BBC.” Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage"},{"title":"Warne feels for Vaughan as commentator’s Australian arrival up in air","link":"https://www.smh.com.au/sport/cricket/warne-feels-for-vaughan-as-commentator-s-australian-arrival-up-in-air-20211202-p59e9i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Former England skipper Michael Vaughan is still set to feature on Fox Cricket’s Ashes coverage this summer, provided he can get to Australia after testing positive to COVID-19.","content":null,"pubDate":"2021-12-02 07:05:32","full_description":"Former England skipper Michael Vaughan is still set to feature on Fox Cricket’s Ashes coverage this summer, provided he can get to Australia after testing positive to COVID-19, despite being embroiled in the Yorkshire racism scandal. It comes as British broadcaster BT Sport made plans to ensure his commentary would not be seen in the northern hemisphere, while fellow Fox Sports commentator Shane Warne said he felt for his former international opponent amid the recent controversy. Vaughan had previously been removed from BBC Radio’s coverage. Fox Cricket commentators Michael Vaughan and Shane Warne in 2019. Credit: Getty Vaughan’s immediate future as a commentator has been under a cloud following claims by former Yorkshire cricketer Azeem Rafiq that he heard Vaughan say, “there’s too many of you lot, we need to do something about that” to four Asian players before a match in 2009. Vaughan has strenuously denied the allegations, as well as making any racist remarks during his time as a professional cricketer, but has been removed by the BBC Radio’s Test Match Special team for the Ashes. “I just remember it clearly that I was proud as punch that we had four Asian players representing Yorkshire County Cricket Club,” Vaughan said recently in a BBC interview. Vaughan, however, has been told by the BBC he can expect to work with them again in the future. Fox Sports wants Vaughan to continue with them but his situation has been complicated by the fact he was unable to board a flight to Australia this week because of a “frustrating” positive COVID-19 test. Executive director of Fox Sports, Steve Crawley, told the Herald Vaughan would miss the first Test but would likely be in Australia later in the series. “I spoke to him a couple of nights ago and it’s complicated,” Crawley said. “I’m keeping an eye on the situation with quarantine and border closures. I don’t know when he’s going to get here. I know he’s not going to be here for the first Test. It’s just a matter of monitoring when he could get here.” Crawley declined to comment when asked about the network’s position on Vaughan in light of the Yorkshire saga, or BT Sport’s decision to remove him from their coverage. Meanwhile, Australian cricket great Warne did not elaborate at length when asked for his views on Vaughan’s broadcasting issue, but said he hoped his former rival overcame COVID-19. “I feel for Michael Vaughan at the moment,” Warne told the Herald . “I hope it all gets resolved very quickly. “Vaughany is coming to my house on Christmas Day, so I hope he gets over his COVID. He is spending Christmas Day with my family and I. “I think he’s a fantastic commentator, a good addition to our team at Fox Cricket, and we’re looking forward to him coming out. Hopefully he’s out here soon.” UK broadcaster BT Sport have announced they will take Fox Sports’ feed throughout the series but do not want Vaughan on their coverage. As a solution, BT Sport is willing to bring in a separate commentary team to call Tests when Vaughan is on air for Fox Sports. “Given these recent events and the controversy with the situation, we have taken the decision that including Michael Vaughan within our Ashes coverage would not be editorially appropriate or fit with BT Sport’s values,” read a BT Sport statement. “We are still finalising plans but we are assessing the option of taking a hybrid approach, using Fox commentary where possible with the aim of putting our own commentary team in place if necessary.” In a statement, the BBC said: “We’re in regular contact with Michael and have had positive conversations with him in recent days. Our contributors are required to talk about relevant issues, so Michael’s involvement in a story of such significance means it’s not possible for him to be part of our Ashes coverage or wider cricket coverage at the moment. We’re pleased with how our conversations are going and expect to work with Michael again in the future. He remains on contract to the BBC.” Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh"},{"title":"India trains indoors, New Zealand calls off training due to wet outfield","link":"https://sportstar.thehindu.com/cricket/india-trains-indoors-wankhede-stadium-new-zealand-calls-off-training-session-rain-bandra-kurla-complex/article37801382.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Ahead of the second Test, the Indian team sweats it out at the Mumbai Cricket Association’s Bandra-Kurla Complex under the watchful eyes of Rahul Dravid.","content":null,"pubDate":"2021-12-02 06:59:35","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"India vs New Zealand, 2nd Test Predicted XI: Ajinkya Rahane Can Make Way For Virat Kohli - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZGlhLXZzLW5ldy16ZWFsYW5kLTJuZC10ZXN0LXByZWRpY3RlZC14aS1hamlua3lhLXJhaGFuZS1jYW4tbWFrZS13YXktZm9yLXZpcmF0LWtvaGxpLTI2MzM3ODbSAZYBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaW5kaWEtdnMtbmV3LXplYWxhbmQtMjAyMS9pbmRpYS12cy1uZXctemVhbGFuZC0ybmQtdGVzdC1wcmVkaWN0ZWQteGktYWppbmt5YS1yYWhhbmUtY2FuLW1ha2Utd2F5LWZvci12aXJhdC1rb2hsaS0yNjMzNzg2L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 2nd Test Predicted XI: Ajinkya Rahane Can Make Way For Virat Kohli  NDTVSports.comWho goes out of India's XI when Virat Kohli comes in?  ESPNcricinfo.comIndia vs New Zealand, 2nd Test: Weather, combination worry for Captain Virat Kohli as series on line for  Times of India'Selecting playing XI with Virat back': Jaffer shares hilarious 'Hera Pheri' clip to describe selection dilemma  Hindustan TimesIND vs NZ 2021: Zaheer Khan Says India Might Drop An Opener To Make Way For Virat Kohli In The Second Test, Cheteshwar Pujara Could Open  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2021-12-02 06:58:00","image_url":null,"source_id":"google"},{"title":"IPL 2022: Venkatesh Iyer grateful to Kolkata Knight Riders after India debut, says THIS","link":"https://zeenews.india.com/cricket/ipl-2022-venkatesh-iyer-grateful-to-kolkata-knight-riders-after-india-debut-says-this-2415390.html","keywords":null,"creator":null,"video_url":null,"description":"Venkatesh Iyer thanked the Kolkata Knight Riders management for giving him the opportunity to play in the IPL 2021 season and said that KKR introduced him to the world of top-level cricket.","content":null,"pubDate":"2021-12-02 06:48:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Cricket: England expect the unexpected from rain-sodden Gabba pitch","link":"https://www.thestar.com.my/sport/cricket/2021/12/02/cricket-england-expect-the-unexpected-from-rain-sodden-gabba-pitch","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - All-rounder Chris Woakes said England were preparing to play on a very different Gabba wicket in the first Ashes test next week after an unusually wet Brisbane spring left ground staff scrambling to prepare the surface. Read full story","content":null,"pubDate":"2021-12-02 06:17:00","full_description":"SYDNEY (Reuters) - All-rounder Chris Woakes said England were preparing to play on a very different Gabba wicket in the first Ashes test next week after an unusually wet Brisbane spring left ground staff scrambling to prepare the surface. After days preparing in indoor nets, the England players finally got to play outside on Brisbane's Ian Healy Oval on Thursday on what should have been the third day of a four-day intra-squad match. A few miles away in the south of the city, Gabba head groundsman David Sandurski and his team were making the most of the break in the rain to get some preparatory work done before the wet weather descends again. Woakes, who is hoping to play in his fourth Ashes series over the next couple of months, said an untypical surface could be a key factor in deciding the first of the five tests. \"It could be anything. We've played at the Gabba before and it's a pretty true wicket, relatively bouncy, typical Australian conditions,\" he told reporters. \"But obviously the past week hasn't been typical Australian conditions with the rain. I think we're just trying to keep our minds open and whichever team adapts early on will probably come out on top.\" Woakes said that finally getting out to play on grass on Thursday was a big plus for the tourists. \"It is important, you can do as much indoor nets and net sessions as you want but actually middle practice is really important going into such a big series,\" he said. \"So it's been really good for us to get out today. It's obviously a bit squidgy out there with the amount of rain that's happened, but we're really pleased to be out there.\" Woakes was named in the England Lions squad for Tuesday's runout but the 32-year-old did not think the return of fellow all-rounder Ben Stokes necessarily meant the end of his hopes of claiming a spot on the test team. \"I think we've played in the same team before,\" he added. \"Look, Ben's a world class cricketer, gets into any XI in the world, it's great that he's back with us and hopefully he can find form in the series. But I think we can play together.\" (Reporting by Nick Mulvenney, Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/02/1389728.jpg","source_id":"thestar_my"},{"title":"Cricket | Rahul Dravidâ€™s innings as India coach could be his toughest so far","link":"https://www.moneycontrol.com/news/sports/cricket-|-rahul-dravidâ€™s-innings-as-india-coach-could-be-his-toughest-so-far_15827141.html","keywords":null,"creator":null,"video_url":null,"description":"What will work in Rahul Dravidâ€™s favour is that he is respected by all the players (the superstars included), and none can blame him of having a hidden agenda in the decisions he takes","content":null,"pubDate":"2021-12-02 06:15:18","full_description":null,"image_url":null,"source_id":"moneycontrol"},{"title":"Cricket: England expect the unexpected from rain-sodden Gabba pitch","link":"https://www.channelnewsasia.com/sport/cricket-england-expect-unexpected-rain-sodden-gabba-pitch-2353236","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 06:14:25","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--VZfsZbQY--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-02t061119z_1_lynxmpehb1069_rtroptp_3_cricket-australia-aus-eng.jpg?itok=60xdYJvu","source_id":"channelnewsasia"},{"title":"Cricket faces \"uncomfortable\" truths: Guha","link":"https://www.perthnow.com.au/sport/cricket/cricket-faces-uncomfortable-truths-guha-c-4789215","keywords":null,"creator":["Rob Forsaith"],"video_url":null,"description":"Isa Guha says Azeem Rafiq's experience of racism at Yorkshire and ensuing fallout represents a significant chapter for cricket around the world.","content":null,"pubDate":"2021-12-02 06:14:18","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4789215/bfa460d5002fac9ef032aaa5f4be8f31ed9f5918-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Cricket faces \"uncomfortable\" truths: Guha","link":"https://thewest.com.au/sport/cricket/cricket-faces-uncomfortable-truths-guha-c-4789207","keywords":null,"creator":["Rob Forsaith"],"video_url":null,"description":"Isa Guha says Azeem Rafiq's experience of racism at Yorkshire and ensuing fallout represents a significant chapter for cricket around the world.","content":null,"pubDate":"2021-12-02 06:13:59","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4789207/bfa460d5002fac9ef032aaa5f4be8f31ed9f5918-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Cricket faces \"uncomfortable\" truths: Guha","link":"https://www.busseltonmail.com.au/story/7535994/cricket-faces-uncomfortable-truths-guha/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 06:12:01","full_description":"Ex-England cricketer Isa Guha says cricket \"has had to face some uncomfortable truths\" recently. Isa Guha believes English cricket's racism saga is one of the most significant chapters in the sport's history, saying it can be a catalyst for meaningful change and a more inclusive game. Former Yorkshire player Azeem Rafiq, who was born in Pakistan and moved to England at age 10, has detailed how \"institutional racism\" at the club left him on the brink of suicide. Yorkshire's ensuing formal investigation found Rafiq was the \"victim of racial harassment and bullying\". Yet no player or executive faced immediate disciplinary action after the probe, with the club reportedly dismissing racist language directed at Rafiq as \"banter between friends\". The response ignited outrage throughout English cricketing circles and indeed the country, with the fallout continuing after Rafiq fronted a parliamentary select committee. Guha, speaking at Fox Cricket's summer launch as she prepared to call the men's Ashes series beginning next week, vowed to talk about the subject in more depth when the time was right. But Guha, a 2009 one-day World Cup winner, made it clear the challenging time represented \"probably the most significant thing to happen in cricket\". \"It is something that is globally relevant. What's happening in England, I think is something that will be felt all around the world,\" Guha told AAP. \"The game has had to face some uncomfortable truths. \"But if this is what it takes to get to a place where we can create long-lasting change and a more inclusive sport than a period of reflection and uneasiness is certainly necessary. \"The healing process will happen at some stage. \"Everyone wants to take a look at themselves and how they can be better. And if everyone is doing that then, absolutely, we can move forward.\" The England and Wales Cricket Board (ECB) last month suspended Yorkshire from hosting international cricket. Test captain and Yorkshire star Joe Root told reporters earlier this week he had exchanged messages with Rafiq and planned to discuss the matter with him after this summer. Root maintained he never witnessed incidents detailed by Rafiq. \"Things have happened, especially at Yorkshire, which are unacceptable,\" Root said. Guha, believed to be first woman from an Asian background to represent England in any team sport, noted Root was right to \"front up and talk about these issues\". \"I know that it's something they talk about a lot in the dressing room. It's something that has affected everyone,\" she said. \"Everyone has a part to play in moving things forward. \"It's about accepting there are issues - and they are serious issues - and being able to find ways to move forward. \"This is happening in cricket. But it's something that affects society.\" Lifeline 13 11 14 beyondblue 1300 22 4636 Australian Associated Press","image_url":"https://transform.newsnow.io/transform/v1/crop/frm/silverstone-feed-data/7eeddedf-f827-48d2-8e8d-6a89f324913b.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail"},{"title":"BCCI Sets Sunday Deadline To Decide On India's Tour of South Africa","link":"https://sports.ndtv.com/cricket/bcci-sets-sunday-deadline-to-decide-on-indias-tour-of-south-africa-2633744","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) has set a deadline of Sunday to decide on the fate of the Indian men's cricket team's upcoming tour of South Africa, sources have informed NDTV.","content":null,"pubDate":"2021-12-02 06:11:48","full_description":"The Board of Control for Cricket in India (BCCI) has set a deadline of Sunday to decide on the fate of the Indian men's cricket team's upcoming tour of South Africa , sources have informed NDTV. The future of the tour, which begins with the first Test match in Johannesburg from December 17, has been under question ever since the spread of the new COVID-19 variant Omicron. It has been learnt that the board has asked for some time from Cricket South Africa (CSA) to discuss the matter internally. Sources have informed NDTV that under the current circumstances, BCCI could ask CSA to delay the series. India are scheduled to play three Tests, three ODIs and four T20Is as part of the tour. The 10-match tour is worth around R 700 million (South African Rand), roughly 330 Cr INR. The heavily-mutated Omicron variant of the coronavirus was last month identified in South Africa, where cases reportedly doubled within 24 hours on Wednesday. The Omicron variant has reached as many as 24 countries, according to the World Health Organisation (WHO). Many countries have responded to the situation by issuing travel curbs on visitors from southern African countries, a move that has been criticised by South African president Cyril Ramaphosa as \"unjustified and unfairly discriminate\". The India \"A\" team is currently playing three unofficial Tests in South Africa and is slated to stay in the country till December 6. The Department of International Relations and Cooperation (DIRCO), which is South Africa's foreign ministry, praised India for continuing with the tour. \"India's decision to show solidarity by choosing to continue with the tour of the Indian ''A'' Team stands in contrast with a number of countries who have decided to close their borders and to restrict travel from Southern African...,\" it said in a statement. Promoted On the other hand, CSA chairman Lawson Naidoo had told NDTV on Wednesday about the safety measures in place for the upcoming tour, saying Team India would be staying in two hotels during the trip. \"The tour schedule has been planned on the basis that the first two Test matches will be played in Johannesburg and Centurion (with players staying at the same hotels for these games). The third Test and all white ball games will be played in Cape Town and Paarl (with players once again staying at the same hotels for both sets of games). This planning has been done on the basis that the BSE 'bubble' will only be moved once, from Gauteng to Cape Town,\" Naidoo said.","image_url":"https://c.ndtvimg.com/2021-11/ihv7bfug_india-test-afp_625x300_26_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"India’s cricket tour to South Africa to be delayed by a week amid Omicron scare","link":"https://indianexpress.com/article/sports/cricket/indias-cricket-tour-to-south-africa-to-be-delayed-by-a-week-7652120/","keywords":["Cricket","Sports"],"creator":["Shamik Chakrabarty"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-02 06:11:39","full_description":"India’s tour of South Africa is set to be delayed at least by a week, The Indian Express understands. It is learnt that the BCCI has been negotiating with Cricket South Africa over a deferment following the detection of the Omicron variant of the coronavirus in several countries, including southern Africa. The India A team is currently touring South Africa and although the BCCI is not yet pulling the plug on that tour, the cricket board is seriously considering delaying the senior team’s tour. The Indian team was scheduled to fly out on December 9 via a charter flight, but according to sources, that has been put on hold. Squads selection for the South Africa tour, too, has been deferred accordingly. The selection meeting was scheduled to take place after India’s first Test against New Zealand. But as the Indian board is keeping constant touch with its South African counterpart, it has been decided to hold the selection meeting after having clarity about the road ahead. https://images.indianexpress.com/2020/08/1x1.png The team is scheduled to play three Tests, three ODIs and four T20Is in South Africa. Back in September, the Indian team had refused to play the fifth Test against England in Manchester following a Covid outbreak in the camp. Top Sports News Now India's cricket tour to South Africa to be delayed by a week amid Omicron scare After going toe to toe against the best, New Zealand bust punching above their weight cliché Junior World Cup hockey: Penalty corner surprise, flawless defence takes India into semifinals Click here for more The A team, meanwhile, is playing their second unofficial four-day Test against South Africa A in Bloemfontein. Amid rising concerns, the Indian government’s travel advisory has identified certain countries as “at-risk” countries, while a Health Ministry advisory to all the states last week had identified the new variant of the virus, B.1.1.529, to potentially have “serious public health implications”. On Monday, Olympic javelin gold medalist Neeraj Chopra cancelled his trip to South Africa, where he was supposed to go for a training-and-competition stint. The Covid figures issued by the health ministry of the South African government on December 1 identified 8,561 new cases, although it didn’t mention the number of infections from the Omicron variant.","image_url":null,"source_id":"indianexpress"},{"title":"“New school batting is hit a six then another six”: David Hussey wants to replicate KKR’s approach with Melbourne Stars in BBL 11","link":"https://thesportsrush.com/cricket-news-new-school-batting-is-hit-a-six-then-another-six-david-hussey-wants-to-replicate-kkrs-approach-with-melbourne-stars-in-bbl-11/","keywords":["Cricket","BBL 2021-22","David Hussey","Melbourne Stars"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"BBL 11: Melbourne Stars coach David Hussey wishes to follow the Kolkata Knight Riders’ template with Melbourne Stars in the Big Bash League. The BBL is about to start in Australia, with the first game to be played on 5 December 2021. Melbourne Stars is one of the fan-favourite teams with the likes of Maxwell,… The post “New school batting is hit a six then another six”: David Hussey wants to replicate KKR’s approach with Melbourne Stars in BBL 11 appeared first on The SportsRush.","content":"BBL 11: Melbourne Stars coach David Hussey wishes to follow the Kolkata Knight Riders’ template with Melbourne Stars in the Big Bash League. The BBL is about to start in Australia, with the first game to be played on 5 December 2021. Melbourne Stars is one of the fan-favourite teams with the likes of Maxwell, Stoinis, and Zampa, but they have not won a single title. With the new season arriving, they are again termed as the title favourites. David Hussey, the coach of the Stars talked with ESPN Cricinfo before the tournament. He joined the team in 2019-20, where they lost in the finals against Sydney Sixers. However, they could not even reach the playoffs in the 2020-21 season. “I actually learned more about [the job] last year when we’re not playing as well than the first year when everything was going smoothly,” Hussey said. “A lot of man management, a lot of strategy meetings, and sometimes your strategy is not always correct.” BBL 11: David Hussey wants to implement Brendon McCullum’s role in KKR with the Melbourne Stars David Hussey works with Brendon McCullum in IPL as an assistant coach of the KKR. He has revealed that Brendon believes in his assistants, and David wants to do the same with the Stars staff. He has Ben Rohrer and Clint McKay as assistants in the BBL 2021-22. KKR turned their fortunes around in the second half of IPL 2021 by playing bold cricket. 4⃣ SLEEPS TO GO ARE YOU READY #TeamGreen Showtime is just around the corner!!! #TeamGreen #WeWillShine pic.twitter.com/C9PtWUlu6k — Melbourne Stars (@StarsBBL) December 1, 2021 Hussey also wants the Melbourne Stars side to play expressive cricket in the BBL. They have signed Joe Clarke, whereas the likes of Marcus Stoinis and Glenn Maxwell are also there in the team. The players like Beau Webster, Hilton Cartwright, and Nick Larkin can also play the part. “Old school T20 batting is hit a six and a one,” Hussey said. “But new school batting is hit a six then another six. Put the bowler under as much pressure as possible.” So my thinking has changed. But if you go in with negative thoughts as a batter and pass it on, they start doubting themselves so it’s all about giving them as much confidence as they possibly can and if they want to hit six sixes in the over, they’ve got our blessing.” Melbourne Stars will start their BBL 2021-22 campaign against Sydney Stars in the season opener on 5th December 2021. The post “New school batting is hit a six then another six”: David Hussey wants to replicate KKR’s approach with Melbourne Stars in BBL 11 appeared first on The SportsRush.","pubDate":"2021-12-02 06:00:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"India’s cricket tour to South Africa to be delayed by a week amid Omicron scare - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYXMtY3JpY2tldC10b3VyLXRvLXNvdXRoLWFmcmljYS10by1iZS1kZWxheWVkLWJ5LWEtd2Vlay03NjUyMTIwL9IBemh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYXMtY3JpY2tldC10b3VyLXRvLXNvdXRoLWFmcmljYS10by1iZS1kZWxheWVkLWJ5LWEtd2Vlay03NjUyMTIwL2xpdGUv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India’s cricket tour to South Africa to be delayed by a week amid Omicron scare  The Indian ExpressAmidst Omicron scare, South Africa hope to host India | Cricbuzz.com - Cricbuzz  CricbuzzBCCI Wants South Africa Tour Delayed, Decision By Sunday Likely: Sources  NDTVSports.comIndia vs South Africa: BCCI President Sourav Ganguly says 'tour is on as of now' amid Omicron scare  Republic WorldIndia tour of SA might be pushed back by one week amid Omicron scare  ANI NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-02 05:51:22","image_url":null,"source_id":"google"}]}