{"newsArray":[{"title":"PAK vs ENG, 6th T20I: Philip Salt goes all guns blazing, sets Twitter ablaze with his blistering knock","link":"https://www.indiatvnews.com/sports/cricket/pak-vs-eng-6th-t20i-philip-salt-goes-all-guns-blazing-sets-twitter-ablaze-with-his-blistering-knock-highlights-reaction-scoreboard-2022-10-01-812791","keywords":null,"creator":null,"video_url":null,"description":"PAK vs ENG, 6th T20I: Philip Salt, the English wicketkeeper-batsman, in one of the finest knocks ever played in T20 cricket has left Pakistan stunned and begging for answers. Babar Azam and his troops were in with a golden chance of winning the seven-match T20I series, but Philip Salt gatecrashed their party and now the series hangs in balance with both the hosts and visitors winning three games each. The series decider will now be played on October 1, 2022.","content":null,"pubDate":"2022-10-01 02:04:54","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG, 6th T20I: England stay alive, series to be decided in final encounter","link":"https://www.indiatvnews.com/sports/cricket/pak-vs-eng-6th-t20i-england-stay-alive-series-to-be-decided-in-final-encounter-2022-10-01-812778","keywords":null,"creator":null,"video_url":null,"description":"PAK vs ENG, 6th T20I: In a series that is constantly swinging both ways, this is the third time that it has been leveled. Rubbing \"Salt\" into the wounds of Pakistan, England rather pulled off a spectacular chase. By every means, this was a clinical chase by the English cricket team as they never looked in any kind of trouble. Both these teams will now clash in the series decider that will be played on October 2, 2022, at the Gaddafi Stadium, Lahore.","content":null,"pubDate":"2022-10-01 01:14:30","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Shahzad Azam Rana is no more","link":"https://www.thenews.com.pk/print/996054-shahzad-azam-rana-is-no-more","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Former Pakistan A pacer Shahzad Azam Rana who was just one month shy of 37 died of cardiac arrest at his residence in PWD Colony on Friday. Shahzad, who was knocking at the doors of the national cricket team ten years back, was taken to a hospital as he felt chest pain early Friday...","content":null,"pubDate":"2022-10-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Sarfaraz be brought back: Nadeem Omar","link":"https://www.thenews.com.pk/print/996050-sarfaraz-be-brought-back-nadeem-omar","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Quetta Gladiators owner Nadeem Omar has praised the former captain Sarfaraz Ahmed's contribution to Pakistan cricket and urged the selectors to give him another chance.Speaking to media at a local cricket event, he said, “Rizwan is currently performing outstandingly but if you want...","content":"KARACHI: Quetta Gladiators owner Nadeem Omar has praised the former captain Sarfaraz Ahmed's contribution to Pakistan cricket and urged the selectors to give him another chance. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Speaking to media at a local cricket event, he said, “Rizwan is currently performing outstandingly but if you want to improve the batting then Sarfaraz and Rizwan can play together.\" He said Sarfaraz was a good player of fast bowling. \"He has great experience of playing sensibly against fast bowling,\" Nadeem added. The Quetta Gladiators' owner demanded that Pakistan Cricket Board (PCB) arrange a school tournament immediately to find young talent and improve the grassroots cricket. “PCB should organise a local inter- school event. Nadeem revealed that an English county club will come to Karachi next month. \"An English county club will visit Karachi next month. Gladiators and Omar Associates will host a few matches at the KCCA Stadium,\" he added. He also hinted that Asad Shafiq will be part of the Quetta Gladiators squad for the next season of the Pakistan Super League owing to his recent performance in the KPL-II.","pubDate":"2022-10-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Balochistan, Northern begin Quaid Trophy with wins","link":"https://www.thenews.com.pk/print/996044-balochistan-northern-begin-quaid-trophy-with-wins","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Defending champions Khyber Pakhtunkhwa had a poor start to their Quaid-e-Azam Trophy 2022-23 campaign as they faced a 134-run defeat against Balochistan at the Abbottabad Cricket Stadium.Set 370 to win, Khyber Pakhtunkhwa were bowled out for 235 in just 68.5 overs on what was the fourth...","content":"LAHORE: Defending champions Khyber Pakhtunkhwa had a poor start to their Quaid-e-Azam Trophy 2022-23 campaign as they faced a 134-run defeat against Balochistan at the Abbottabad Cricket Stadium. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Set 370 to win, Khyber Pakhtunkhwa were bowled out for 235 in just 68.5 overs on what was the fourth and final day of the opening round after fighting 60s from one-drop Sahibzada Farhan (63 off 67) and number four Kamran Ghulam (61 off 109). Khurram Shahzad finished with seven wickets in the match – returning three for 61 in the last innings of the match. Balochistan’s Hussain Talat stroked a half-century earlier in the day. The left-handed batter made 55 off 80. His team had started the day on 107 for four and declared on 187 for five. Northern, the finalists of the last season, thrashed Southern Punjab by 10 wickets at Faisalabad’s Iqbal Stadium. Northern were set eight to win, which they overhauled in nine balls, to occupy the top spot in the six-team points table with 25 points. Southern Punjab, following on, began the day trailing by by 117 runs with Imran Rafiq and Usman Salahuddin at the crease. Usman added only 15 more to his overnight score before he was run out on 55. Imran (not out on 34 yesterday) went on to score 90 off 228 balls, hitting 14 fours. Mehran and Musa Khan finished with three wickets each. The match between Central Punjab and Sindh ended in a draw. Tayyab Tahir, resuming from 72, scored a century and was unbeaten on 152 off 252 (18 fours and three sixes) when his captain Mohammad Saad declared the innings on 277 for nine. Sindh, needing 338 to win, were 132 for four, with Khurram Manzoor scoring 50 off 88, at the close of play. The second round of the Quaid-e-Azam Trophy begins on Monday. Balochistan play Central Punjab at the Pindi Cricket Stadium, Khyber Pakhtunkhwa and Southern Punjab lock horns at the Abbottabad Cricket Stadium and Northern and Sindh face off at the Iqbal Stadium, Faisalabad. Scores in brief: Balochistan beat Khyber Pakhtunkhwa by 134 runs at Abbottabad Cricket Stadium Balochistan 473 all out, 123 overs (Azeem Ghumman 78, Kashif Bhatti 71, Abdul Wahid Bangalzai 69, Ali Waqas 59, Haseebullah 53, Khurram Shahzad 47; Arshad Iqbal 4-114, Mohammad Sarwar Afrid 2-55, Ihsanullah 2-104) and 187-5, 52 overs (Hussain Talat 55, Ali Waqas 37, Azeem Ghumman 28; Arshad Iqbal 2-33) Khyber Pakhtunkhwa 291 all out, 85.4 overs (Kamran Ghulam 102, Khalid Usman 43, Rehan Afridi 35; Khurram Shahzad 4-67, Kashif Bhatti 2-43, Akif Javed 2-87) and 235 all out, 68.5 overs (Sahibzada Farhan 63, Kamran Ghulam 61, Rehan Afridi 28; Khurram Shahzad 3-61, Kashif Bhatti 2-43, Akif Javed 2-75) Match points – Balochistan (23), Khyber Pakhtunkhwa (four) Northern beat Southern Punjab by 10 wickets at Iqbal Stadium, Faisalabad Northern 529-5d, 133 overs (Mubasir Khan 170 not out, Abdul Faseeh 151, Umar Amin 89, Sarmad Bhatti 81; Hassan Khan 3-94, Ali Usman 2-143) and 8-0, 1.3 overs Southern Punjab 269 all out, 86.2 overs (Zain Abbas 120, Salman Ali Agha 36, Hassan Khan 34; Nauman Ali 4-73, Musa Khan 2-51, Mehran Mumtaz 2-63) and 265 all out, 104 overs (Imran Rafiq 90, Usman Salahuddin 55, Umar Siddiq 35, Zain Abbas 32; Musa Khan 3-39, Mehran Mumtaz 3-72, Mubasir Khan 2-55) Match points – Northern (25), Southern Punjab (three) Match drawn between Sindh and Central Punjab at Pindi Cricket Stadium, Rawalpindi Central Punjab 428 all out, 102.2 overs (Abdullah Shafique 232, Aamer Yamin 70; Mir Hamza 3-72, Asif Mehmood 3-128) and 277-9, 90.4 overs (Tayyab Tahir 152 not out, Abdullah Shafique 61; Asif Mehmood 4-59, Mir Hamza 3-41) Sindh 368 all out, 85.5 overs (Fawad Alam 127 not out, Sarfaraz Ahmed 78, Saim Ayub 71, Saad Khan 30; Mohammad Ali 4-84, Aamer Yamin 3-80) and 132-4, 44 overs (Khurram Manzoor 50, Omair Bin Yousuf 37) Match points – Central Punjab (13), Sindh (12)","pubDate":"2022-10-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"CP, SP win opening round matches","link":"https://www.thenews.com.pk/print/996040-cp-sp-win-opening-round-matches","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Half-centuries from Imran Dogar and Rizwan Hussain led Central Punjab to a two-wicket win over Sindh at the UBL Sports Complex, Karachi, in the first round of Cricket Associations Championship on Friday.At the UBL Sports Complex, a 169-run opening partnership between Imran and Rizwan...","content":"LAHORE: Half-centuries from Imran Dogar and Rizwan Hussain led Central Punjab to a two-wicket win over Sindh at the UBL Sports Complex, Karachi, in the first round of Cricket Associations Championship on Friday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ At the UBL Sports Complex, a 169-run opening partnership between Imran and Rizwan helped Central Punjab to chase down the 225-run target in the 65th over. Rizwan top-scored with 88 off 137 balls, smashing 12 fours and two sixes. Imran struck 12 boundaries in his 139-ball 72. Sindh’s Arish Ali Khan bagged four wickets for 47 and ended the match with eight wickets. Majid Asghar grabbed three wickets for 47 and ended the match with six wickets. At the KCCA Stadium, Southern Punjab defeated Northern by 66 runs. Resuming their second innings at the overnight score of 101 for one, Northern were bowled out for 313 to hand 66-run victory to Southern Punjab. Half centuries by Northern’s Taimoor Sultan (64, 123b, eight fours, one six), Hasan Raza (63, 99b, three fours, two sixes) and Nasir Nawaz (59, 70b, four fours, two sixes) went in vain.","pubDate":"2022-10-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022: Aggressive Irfan and Yusuf Pathan help Bhilwara Kings beat Gujarat Giants and book place in playoffs","link":"https://zeenews.india.com/cricket/legends-league-cricket-2022-aggressive-irfan-and-yusuf-pathan-help-bhilwara-kings-beat-gujarat-giants-and-book-place-in-playoffs-2516446.html","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket 2022: Yusuf and Irfan played aggressive knocks to help the Bhilwara Kings chase down the target and win the game by five wickets.","content":"Irfan and Yusuf Pathan together overshadowed a blistening innings from Chris Gayle on Friday (September 30) to help Bhilwara Kongs beat Gujarat Giants in the 11th match of the Legends League Cricket (LLC) at the Barkatullah Khan Stadium in Jodhpur on Friday and confirm their place in the playoffs as well. After Gayle's hurricane 68 off 40 balls had helped the Gujarat Giants post 186/7 in 20 overs, Yusuf and Irfan played aggressive knocks to help the Bhilwara Kings chase down the target and win the game by five wickets. The Kings had a moderately good start as their openers put on 57 runs. But after Morne van Wyk's dismissal, their scoring rate dipped. The Kings lost set batter William Porterfield (40 off 37 balls) in the 12th over making things difficult for themselves. But then began the Yusuf storm. With four gigantic sixes and a four, Yusuf made 39 off 18 balls before he was out in the 16th over. Irfan then took over the baton from his brother. The Kings captain, along with Jesal Karia (39 not out off 24 balls), ensured that they reached home with two balls to spare. Irfan stayed unbeaten on 26 off 14 balls. Highlights of @Bhilwarakings from the game! #BossLogonKaGame #LLCT20 #LegendsLeagueCricket pic.twitter.com/0UDckcQn07 — Legends League Cricket (@llct20) September 30, 2022 Earlier, the Giants went for an all-Caribbean opening combination as Lendl Simmons opened the innings along with Gayle. After Simmons' dismissal for 22 in the fifth over, the Giants had the worst possible finish to their Powerplay as they lost two wickets — captain Parthiv Patel and Kevin O'Brien — in the very next over. Yusuf was the man who inflicted the damage on the Giants. Yusuf, however, got a reality check soon after. While one expected the Giants to be on the backfoot following those wickets, Gayle, a stalwart of the shortest format of the game, was in no mood to spend a quiet night in Jodhpur. In the eighth over of the innings, he hit Yusuf for three fours and two sixes, his fifty coming up in 23 balls. Yashpal Singh (58 off 37 balls) too got a fifty to help the Giants get a formidable total. In the end though, it proved insufficient. How it stands After Friday's match, India Capitals and Bhilwara Kings confirmed their places in the playoffs with 7 points each. Only three teams will be moving ahead with the fourth being eliminated straightaway. The battle for the third playoffs place is between the Gujarat Giants and Manipal Tigers. If the Tigers, who are currently on 3 points, lose their last league phase game against India Capitals on Saturday, the Giants with 5 points will finish third and make the playoffs. But if the Tigers win, they too will be on 5 points, the same as the Giants, and so it will all come down to the net run rate. As on Friday, the Giants had a net run rate -0.366 while the Tigers were poorer with -0.607.","pubDate":"2022-10-01 00:50:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Phil Salt powers England to emphatic victory and levels series with Pakistan - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiY2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL3NlcC8zMC9wYWtpc3Rhbi1lbmdsYW5kLXNpeHRoLXQyMC1pbnRlcm5hdGlvbmFsLW1hdGNoLXJlcG9ydNIBY2h0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL3NlcC8zMC9wYWtpc3Rhbi1lbmdsYW5kLXNpeHRoLXQyMC1pbnRlcm5hdGlvbmFsLW1hdGNoLXJlcG9ydA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Phil Salt powers England to emphatic victory and levels series with Pakistan  The GuardianEngland set up T20I series decider with Pakistan as Phil Salt powers tourists to thumping win in Lahore  Sky SportsPhil Salt smashes 88 as England thrash Pakistan by eight wickets to set up T20 series decider  Daily MailEngland beat Pakistan by eight wickets in sixth men’s T20 cricket international – as it happened  The GuardianPhil Salt's brutal assault drives England to victory and squares the series  The TelegraphView Full coverage on Google News","content":null,"pubDate":"2022-09-30 23:58:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"TFL vs CBS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Japan Cricket league 2022, Match 3","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/tfl-vs-cbs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-japan-cricket-league-2022-match-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-30 23:02:18","image_url":"https://static.sportskeeda.com/editor/2022/09/bdf9f-16645590684067-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup | Bumrah not out yet – Ganguly informs","link":"https://thenewsglory.com/t20-world-cup-bumrah-not-out-yet-ganguly-informs/","keywords":["Sports","Bumrah","Cricket","Ganguly","Jasprit Bumrah","T20 World Cup.","World Cup"],"creator":["The News Glory"],"video_url":null,"description":"Indian fast bowler Jasprit Bumrah is suffering due to injury and his participation in the upcoming T20 World Cup in Australia has become a problem. It is reported that he is away from the tournament. However, it has not been officially announced. At the same time, BCCI has confirmed the injury and has not announced […]","content":"Indian fast bowler Jasprit Bumrah is suffering due to injury and his participation in the upcoming T20 World Cup in Australia has become a problem. It is reported that he is away from the tournament. However, it has not been officially announced. At the same time, BCCI has confirmed the injury and has not announced his replacement in the World Cup. Currently, Mohammad Siraj has been announced as Bumrah’s replacement for the T20 matches against South Africa. Bumrah went to the National Cricket Academy in Bengaluru to know the severity of his back pain. Although back pain problem does not require surgery, it is said to take a long time to recover from it. However, BCCI president Sourav Ganguly has confirmed that no decision has been taken on the Bumrah issue yet. In an interview to a media outlet, he informed, “Bumrah is not out of the World Cup yet. We are sure something will happen. He will get fit again very soon. So, we have not ruled him out yet. It will be known in the next two or three days.”","pubDate":"2022-09-30 22:54:07","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"SAU-U19 vs OMN-U19 Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for U19 World Cup Asia Division 2 Qualifier, Match 5","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sau-u19-vs-omn-u19-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-u19-world-cup-asia-division-2-qualifier-match-5?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-30 22:53:40","image_url":"https://static.sportskeeda.com/editor/2022/09/3f116-16645586503089-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Scary’ Aussie prodigy’s worrying dilemma","link":"https://www.foxsports.com.au/cricket/australia/cameron-greens-sudden-emergence-as-t20-powerhouse-creates-workload-management-headache/news-story/bf1560cbb972865027cd1de2e3d09206","keywords":null,"creator":null,"video_url":null,"description":"Cameron Green’s sudden emergence as a three-format player will create plenty of headaches for Cricket Australia over the coming 18 months, with the young all-rounder’s workload set to be pushed to its absolute limit.","content":"Cameron Green’s sudden emergence as a three-format player will create plenty of headaches for Cricket Australia over the coming 18 months, with the young all-rounder’s workload set to be pushed to its absolute limit. Before last week’s T20I series against India in the sub-continent, Green boasted a modest record in the 20-over format, failing to reach fifty in 14 matches. But the 23-year-old, who was omitted from Australia’s 15-player T20 World Cup squad, proved his versatility by smacking two half-centuries against India’s talented bowling attack to finish as the highest run-scorer of the three-match series. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > India suffer injury blow before T20 WC | 00:33 Green’s raw power makes him a leading candidate to replace Australian white-ball captain Aaron Finch at the top of the order when the Victorian veteran decides to hang up the boots, potentially after the T20 World Cup. Australian teammate Josh Hazlewood, the No. 1 ranked T20I bowler in the world, admitted net sessions with Green had become a terrifying ordeal. “It was a bit scary, actually, the first net session in India, felt like you needed a helmet almost bowling to Cam Green,” he told reporters on Friday morning as CA unveiled NRMA Insurance as its new naming rights sponsor. “He’s so imposing, such a big guy, full face of the bat back towards you, it’s pretty scary.” In the space of six days, Green had transformed from a T20 substitute to one of the most sought-after talents ahead of next year’s Indian Premier League Auction. But Green, who has been susceptible to back injuries throughout his short career, may need to start prioritising certain formats and competitions as workload management becomes a genuine cause of concern . Sunil Gavaskar revealed during the third T20 in India that Cricket Australia were considering blocking Green from putting his hat in the ring of the IPL - something Matthew Hayden blasted. Australian all-rounder Cameron Green. Photo by NOAH SEELAM / AFP Source: AFP Due to the sport’s oversaturated calendar and the growth of high-paying domestic T20 leagues, it has become almost impossible for international cricketers to commit to all three formats – particularly all-rounders. A quick glance at Australia’s fixture list for the next 12 months highlights Green’s dilemma – three ODIs against England, two Tests against the West Indies, three Tests against South Africa, a four-Test tour of India, six ODIs against India and Afghanistan, the World Test Championship final, a five-Test Ashes series, an eight-match white-ball tour of South Africa and a 50-over World Cup in India before the 2023/24 home summer kicks off. But don’t forget Sheffield Shield, Marsh Cup and Big Bash League fixtures for Western Australia and the Perth Scorchers – and who knows, perhaps he’ll be approached for a stint in The Hundred. Green will need to cut some corners, and it would be unreasonable for CA to prevent the young gun from plying his trade in the IPL, where he’ll presumably be snapped up for a hefty seven-figure sum. He could earn more dosh in two months of IPL cricket than he’d make in three years on a CA contract. Green’s international career is still in its infancy, but the tall right-hander has already shown off his budding potential in red and white-ball cricket. He has received a Player of the Match accolade in all three formats at international level, becoming the first Australian male to achieve the feat before their 24th birthday. READ MORE BURNING QS: Awkward Green dilemma selectors should’ve seen coming as WC wildcard ignites Exclusive: ‘I am who I am’ — Warner opens up on the hate amid big retirement hint Australian captain Aaron Finch and Cameron Green. Photo by Indranil MUKHERJEE / AFP Source: AFP Australian Test captain Pat Cummins, who also battled injury early in his professional career, said protecting Green from injury is one of his highest priorities. “It‘s one my first thoughts whenever I bowl him is we don’t want to burn him,” Cummins told reporters. “Think it‘s been a huge win from the medical side of things to have him play as much cricket as he has over the last couple of years, fortunately he can fall back on his batting even if he’s not bowling. “Now he’s in and around three formats, it becomes even more important. He’s someone who loves playing, even when he goes back to WA we have to manage that as well. There’s 15 Tests in the next few months plus a World Cup, lots of cricket. “You can‘t really blame anyone for going in (the IPL). He’s going to have huge demand on him wherever he plays. Decisions will be made, there’s a lot of cricket around.” Pat Cummins speaks to the media in Sydney. Photo by Matt King/Getty Images for Cricket Australia Source: Getty Images Cummins warned that CA will need to be proactive with how it manages Green, a cricketer that’s capable of batting anywhere in the top eight and bowling in excess of 140km/h. “The world is changing almost every month now as new leagues and opportunities pop up,” he explained. “We are lucky here in Australia that for all of us players and fans Test cricket is number one, so wherever there is a Test tour on that is where us players want to be, you feel like all the cricket fans are watching. “But we can‘t take it for granted that will always be the case. Maybe (it’s) the way we structure contracts, manage different players because unfortunately, or fortunately, it’s the reality of the world.” Green was retained in the Australian squad for next week’s two-match T20 series in Queensland, which gets underway on Wednesday evening.","pubDate":"2022-09-30 22:51:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cummins eager to avoid bowler burnout","link":"https://www.cairnspost.com.au/sport/cricket/cummins-eager-to-avoid-bowler-burnout/video/a9121705926c5940603e646b3f47b9dd","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Captain Pat Cummins wants to ensure Cam Green and others aren't burned out if he takes up the one day captaincy.","content":null,"pubDate":"2022-09-30 22:45:26","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Explosive England smash Pakistan","link":"https://www.cairnspost.com.au/sport/cricket/explosive-england-smash-pakistan/video/9e4a61ba90b15544e2ad228c0c2b009d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Phil Salt delivered a massive knock to force a series decider against Pakistan.","content":null,"pubDate":"2022-09-30 22:36:18","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Paine in a 'good place' for cricket return","link":"https://www.perthnow.com.au/sport/cricket/paine-in-a-good-place-for-cricket-return-c-8412348","keywords":null,"creator":["Ethan James"],"video_url":null,"description":"Australia's former Test cricket captain Tim Paine will make a return to the sport for grade side University in Tasmania's premier league competition.","content":"Tim Paine is as fit as ever and in a good place mentally, according to the coach of the Hobart grade cricket side for whom the former Australian Test captain will make his playing return. Some 18 months after his last first-class appearance, Paine will take the field for University of Tasmania against New Town at Kingston on Sunday in a premier league 50-over game. The 37-year-old wicketkeeper walked away from the sport in the lead-up to the 2021 Ashes series against England when a sexting scandal dating back to late 2017 became public. \"He's looking forward to playing and we're thrilled to have him back,\" Damien Wright, coach of University, Paine's junior club, told AAP. \"He's as fit as he's ever been. Mentally, he's in a really good place as well. From all reports he's been training the house down. \"I see him quite regularly. He knows there's a bit of hype around it. It's a great story - he's still got plenty of cricket left in him, we believe.\" Paine has been training with the Tasmanian Tigers squad in recent months as an uncontracted player, with coach Jeff Vaughan indicating he was in the mix for selection in the Sheffield Shield. The Tigers open their Shield season against Queensland on October 6. Wright, who played 123 first-class games in a career that included Shield success with Tasmania, believes Paine will end up making a return for the Tigers. \"If he's available and ready to play, you'd have him in the team. It's only going to give the team ... the experience and the passion he's had about Tasmanian cricket,\" Wright said. \"I do believe it will happen.\" Fellow Tasmanian and former Test captain Ricky Ponting, head of strategy for Hobart Hurricanes, has openly stated his desire for Paine to again turn out for the BBL franchise. The Hurricanes have one empty spot on their roster. Paine quit the Test captaincy after admitting involvement in a lewd text exchange with a female employee of Cricket Tasmania. Cricket Australia investigated at the time and cleared him of wrongdoing.","pubDate":"2022-09-30 22:32:39","image_url":"https://images.perthnow.com.au/publication/C-8412348/a9407ef742fd7caff465711ee2ccbad6089841b1-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Leinster Rugby pay touching tribute to former U-19 player and Dublin GAA legend Brian Mullins after 68 year-old’s death","link":"https://www.thesun.ie/sport/gaa-football/9494789/leinster-pay-tribute-dublin-gaa-brian-mullins-death/","keywords":["GAA Football","Rugby Union","Sport","GAA","Gaelic Football","Rugby union"],"creator":["Niall McGrath"],"video_url":null,"description":null,"content":"LEINSTER Rugby have paid tribute to GAA football legend Brian Mullins. It was announced today that the four-time All-Ireland winner passed away after a short illness . He was not only a great gaelic footballer. The Boys in Blue icon played rugby on a famous Leinster under-19 team, with people like future internationals John Robbie. The St Vincent's man played second-row for his province, and grew up playing a number of sports that included rugby, soccer, swimming, hurling, football, cricket, tennis and running. Leo Cullen's Leinster side forged a strong bond with the Clontarf man due to him playing for the province at underage level - and he also acted as Director of sport at UCD - where Leinster's training facilities are. The Club's social media team posted a touching tribute after news of the icon's death broke as they offered their condolences. It read: \"UCD has been our home since 2012 & nobody has made us feel more at home than Brian Mullins. Our hearts are broken for his family and his friends at @StVincentsGAA1 @DubGAAOfficial @ucddublin One of the all time GAA greats. And an even better man. Fathach fir. Croí bhriste.\" Mullins' retired from inter-county competition in 1985. During his time with the Boys in Blue, he pocketed nine Leinster titles, and two league championships, to go alongside his four All-Ireland titles. He also bagged two All-Star selections during his inter-county career. The highlight of Mullins' club career with St Vincent's came in 1976 when they defeated Roscommon Gaels to claim the All-Ireland Club Championship. His death is a heartfelt loss for one of Irish sports’ most famous teams. Fan tributes poured in after news of his death was made public as they hailed the legend for his storied, and legendary career.","pubDate":"2022-09-30 20:46:46","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Sylhet International Cricket Stadium pitch report: Sylhet District Stadium IND W vs SL W pitch report Women’s Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-sylhet-international-cricket-stadium-pitch-report-sylhet-district-stadium-ind-w-vs-sl-w-pitch-report-womens-asia-cup-2022/","keywords":["Cricket","India","Sri Lanka","Sylhet International Cricket Stadium","Women's Asia Cup 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sylhet International Cricket Stadium pitch report: A high in confidence India will take on Sri Lanka in their first match of Asia Cup 2022. Riding on self-belief and confidence after winning a bilateral series (3-0) against England for the first time since 1999, team India, under Harmanpreet Kaur will now battle for the continental supremacy,… The post Sylhet International Cricket Stadium pitch report: Sylhet District Stadium IND W vs SL W pitch report Women’s Asia Cup 2022 appeared first on The SportsRush.","content":"Riding on self-belief and confidence after winning a bilateral series (3-0) against England for the first time since 1999, team India, under Harmanpreet Kaur will now battle for the continental supremacy, with the first match versus Sri Lanka today, at the Sylhet Outer Cricket Stadium. The top seven Asian teams will fight for the Asia Cup, while also keep an eye on the T20 World Cup slated to be played next year in South Africa. : For those unaware, the tournament will see these teams playing against each other once in a round robin format, with the top-4 sides making it through to the semi-finals. The grand finale will be played on October 15. Hosts Bangladesh are the defending Asia Cup champions, having defeated six-time winners India during the previous edition’s final in the year 2018. 🗣️ 🗣️ Captain discusses how will approach the . — BCCI Women (@BCCIWomen) Across the 44 T20 matches at the Sylhet International Cricket Stadium, the average score stands at 158.4 runs. Specifically, across the 24 women’s T20I matches at this venue, the average score dips down to 120.4 runs. The pitch at this venue generally favours the spinners, as the wicket tends to play slow. With the deliveries likely to hold up after pitching on the surface, expect the pacers as well to take some pace off their deliveries every now and then. The last time this venue hosted a women’s international fixture was back in 2014 during the T20 World Cup, which means that both the sides would be unaware of what to expect of the pitch behaviour today. Expect the captain winning the Toss to opt to field first, and back their batting unit to chase the total down.","pubDate":"2022-09-30 19:41:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Little snoozing, I guess”: Haider Ali pulls Richard Gleeson to smash ball directly at square leg umpire Aleem Dar in Lahore T20I","link":"https://thesportsrush.com/cricket-news-little-snoozing-i-guess-haider-ali-pulls-richard-gleeson-to-smash-ball-directly-at-square-leg-umpire-aleem-dar-in-lahore-t20i/","keywords":["Cricket","Aleem Dar","England tour of Pakistan 2022","Haider Ali","Richard Gleeson"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Haider Ali pulls Richard Gleeson straight towards umpire Aleem Dar stationed at square leg during the penultimate T20I of the series. During the sixth match of the ongoing historic seven-match T20I series between Pakistan and England at the Gaddafi Stadium in Lahore, a fierce onslaught of the highest order from England opener Phil Salt (88*… The post “Little snoozing, I guess”: Haider Ali pulls Richard Gleeson to smash ball directly at square leg umpire Aleem Dar in Lahore T20I appeared first on The SportsRush.","content":"During the sixth match of the ongoing historic seven-match T20I series between Pakistan and England at the Gaddafi Stadium in Lahore, a of the highest order from England opener Phil Salt (88* off 41), helped his side register a 8-wicket victory, with 5.3 Overs to spare, and most importantly level the seven-match series 3-3, with the series decider to take place on Sunday. Also, this is any team’s second-biggest victory with balls to spare while chasing a target of 170 and more. While it was all about Salt during the second innings, it was Pakistan skipper Babar Azam, who hogged the limelight after being invited to bat first, as he returned with a 59-ball 87*, to help his team get to a respectable total of 169/6. Apart from Babar’s master class, a moment involving square leg umpire Aleem Dar during the Pakistan innings invited hilarious reactions from the Lahore crowd and the commentators. The incident took place on the penultimate delivery of the sixth Over. Pakistan batter Haider Ali (18 off 14) played a well-timed pull to a short delivery bowled by Richard Gleeson, only to hit the square leg umpire Aleem Dar, who hilariously couldn’t manage to evade the ball coming towards him. While Dar had spotted the ball coming straight at him, he perhaps expected it to hit him someone around his upper chest height, but completely failed to judge its trajectory, to ultimately get hit on his left back thigh. Fortunately for him and everyone out there in the field, the ball did not hit him on any of his body joints, as he was only spotted rubbing the area, with an eerie smile on his face. Ouch! 😬 | — Pakistan Cricket (@TheRealPCB) For more Cricket-related news, click .","pubDate":"2022-09-30 18:45:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Guwahati Cricket Stadium T20 records: Barsapara Cricket Stadium records and highest innings total T20I","link":"https://thesportsrush.com/cricket-news-guwahati-cricket-stadium-t20-records-barsapara-cricket-stadium-records-and-highest-innings-total-t20i/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Guwahati Cricket Stadium T20 records: Barsapara Cricket Stadium will be hosting its third T20I on Sunday. The second T20I of South Africa’s second tour of India 2022 will be played in Guwahati on the day after tomorrow. With India winning the first T20I in Thiruvananthapuram on Tuesday, another win will confirm a series victory for… The post Guwahati Cricket Stadium T20 records: Barsapara Cricket Stadium records and highest innings total T20I appeared first on The SportsRush.","content":"Guwahati Cricket Stadium T20 records: Barsapara Cricket Stadium will be hosting its third T20I on Sunday. The second T20I of South Africa’s second tour of India 2022 will be played in Guwahati on the day after tomorrow. With India winning the first T20I in Thiruvananthapuram on Tuesday, another win will confirm a series victory for them. South Africa, on the other hand, would be wanting to return to winning ways in a bid to keep the series alive. Irrespective of who wins on Sunday, both fans and players would be hoping for a much better pitch at the Barsapara Cricket Stadium than it was at the Greenfield International Stadium on the day before yesterday. In what is going to be the fourth international match at this venue, it will be the third T20I. Readers must note that India are yet to win a T20I here. The Proteas, meanwhile, will be playing their first-ever international match at this stadium. Guwahati Cricket Stadium T20 records With the second Guwahati T20I abandoned after a toss due to rain, there remains only one completed T20I here. As far as batters part of the current Indian squad are concerned, Rohit Sharma (8) and Virat Kohli (0) would want to contribute significantly higher than their performance in the inaugural T20I at this venue. ALSO READ: Pitch report of Barsapara Cricket Stadium for second India vs South Africa T20I Speaking about the bowlers, Bhuvneshwar Kumar and Jasprit Bumrah had picked a wicket each in their only Guwahati T20I. With both of them not part of the series anymore, no Indian bowler part of the current squad has a T20I wicket at the Barsapara Cricket Stadium. Highest T20I innings total at Barsapara Cricket Stadium One of their worst T20I batting performances at home had witnessed India scoring 118/10 in 20 overs against Australia half-a-decade ago. The only completed T20I at the Barsapara Cricket Stadium was won by Australia after a match-winning 109-run third-wicket partnership between Moises Henriques and Travis Head had sealed a 119-run chase in the 16th over. The post Guwahati Cricket Stadium T20 records: Barsapara Cricket Stadium records and highest innings total T20I appeared first on The SportsRush.","pubDate":"2022-09-30 18:30:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Salt sinks Pakistan as England force series decider","link":"https://www.thestar.com.my/sport/cricket/2022/10/01/cricket-salt-sinks-pakistan-as-england-force-series-decider","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's Phil Salt scored a blistering half-century as the visitors raced to an eight-wicket win over Pakistan in their sixth Twenty20 clash in Lahore on Friday to level the seven-match series at 3-3. Read full story","content":"(Reuters) - England's Phil Salt scored a blistering half-century as the visitors raced to an eight-wicket win over Pakistan in their sixth Twenty20 clash in Lahore on Friday to level the seven-match series at 3-3. Salt, who had struggled for runs coming into the game, looked in ominous form from the outset when he opened his innings with two fours before helping England bring up 100 in just seven overs with a six off Aamer Jamal. Alex Hales gave him support with a breezy 27 while Dawid Malan contributed 26, with both batsmen falling to the leg-spin of Shadab Khan. The wickets proved to be mere consolation for Pakistan as Salt continued his onslaught and struck the winning runs in the 15th over, ending with 13 fours and three sixes in his 41-ball knock. Earlier, Pakistan lost their opening two wickets for 15 after being put in to bat before captain Babar Azam launched a fine counter-attack, hitting seven fours and three sixes in an unbeaten 59-ball 87. He was briefly supported by Iftikhar Ahmed (31) but Pakistan's middle-order failings cost them again as the bowling pair of David Willey (2-32) and Sam Curran (2-26) restricted the hosts to 169-6. The teams will contest the final match in the series at the same venue on Sunday. (Reporting by Dhruv Munjal in Bengaluru; Editing by Ken Ferris)","pubDate":"2022-09-30 18:18:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli and Babar Azam's childhood pictures go viral, duo seen wearing similar shirts","link":"https://www.indiatvnews.com/sports/cricket/virat-kohli-and-babar-azam-s-childhood-pictures-go-viral-duo-seen-wearing-similar-shirts-2022-09-30-812770","keywords":null,"creator":null,"video_url":null,"description":"Babar Azam and Virat Kohli are one of the best batsmen of the current era. Both have brought laurels to their country in cricket. Apart from cricket, both are also very famous among fans for their style.","content":"and are one of the best batsmen of the current era. Both have brought laurels to their country in cricket. Apart from cricket, both are also very famous among fans for their style. While there is a never-ending debate among the fans considering their form and their records, their similarities have also come in limelight across social media. Meanwhile, a childhood picture of both of them is becoming fiercely viral on social media. Actually, a social media user shared a collage of childhood pictures of Virat Kohli and Babar Azam on social media. In this picture, both the players are wearing similar clothes. And at the same time, there are many similarities in their hairstyles too. In the picture, Virat and Babar are wearing white and black-coloured shirts. Sharing the picture, a social media user wrote, \"How both Babar and Kohli are wearing the same shirt and that bowl cut.\" If we compare the current form, Babar Azam is way ahead of Kohli, who has just been out of the pale shadow. Babar has been in the form of his life, stacking up centuries and half-centuries for fun, and has definitely taken his game to new heights. Virat, on the other hand, has been there, and done that. He did it for around a decade has bounced back from the slump. This year's T20 World Cup is being played in Australia from 16 October. In the year 2022, the team of India and Pakistan have come face-to-face twice. Both the teams won one match each. The people of both countries are eagerly waiting for the match between India and Pakistan.The match between India and Pakistan will be played in Melbourne on 23 October.","pubDate":"2022-09-30 18:15:01","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Women’s Asia Cup Live Telecast Channel in India: When and where to watch Women’s Asia Cup 2022 matches?","link":"https://thesportsrush.com/cricket-news-womens-asia-cup-live-telecast-channel-in-india-when-and-where-to-watch-womens-asia-cup-2022-matches/","keywords":["Cricket","India Women","Women's Asia Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Women’s Asia Cup Live Telecast Channel: The SportsRush present before you the timing and live streaming details of Women’s Asia Cup 2022. The eighth edition of Women’s Asia Cup will commence in less than 12 hours from now with hosts and defending champions Bangladesh set to take on Thailand in Sylhet tomorrow morning. A double-header… The post Women’s Asia Cup Live Telecast Channel in India: When and where to watch Women’s Asia Cup 2022 matches? appeared first on The SportsRush.","content":"The eighth edition of Women’s Asia Cup will commence in less than 12 hours from now with hosts and defending champions Bangladesh set to take on Thailand in Sylhet tomorrow morning. A double-header day will witness locking horns in the afternoon. Much like the recently concluded Men’s edition, Women’s Asia Cup is also happening after facing its fair share of delays due to COVID-19 pandemic. In what is going to be the fourth Women’s Asia Cup in the shortest format, it will be the first one to be played in Bangladesh. A seven-team tournament will be played in the round robin format wherein each team will get to play six league matches before Top Four teams qualify for the semi-finals. Women’s Asia Cup 2022 will be a 15-day tournament comprising of 24 matches (21 league matches and three knockouts to be played on October 13 and 15). Much like Men’s Asia Cup 2022, Women’s Asia Cup 2022 will also be available on Star Sports Network in India. However, unlike the Men’s tournament, don’t expect premier channels being allocated to the Women’s tournament. Furthermore, it is unlikely that there would be multilingual commentators for this tournament. While will be televising Irani Cup 2022 tomorrow, Star Sports 2/2 HD will be televising Asia Cup 2022. A hectic season of international and domestic cricket means that these series will only be available on just one channel. Online users in India will be able to stream Women’s Asia Cup 2022 matches on Star’s streaming application named Disney+Hotstar with a paid subscription. It is worth mentioning that fans won’t be able to watch match of this tournament on any other streaming app or for free of cost. The captains have arrived in Sylhet and they have their eyes on the prize as the Women’s Asia Cup 2022 trophy is unveiled. I would like to take this opportunity to wish the teams participating all the very best. May the best team win. — Jay Shah (@JayShah) – 01/10/2022 (Saturday) – 15/10/2022 (Thursday). – 01:00 PM (India) and 01:30 PM (Bangladesh). – Star Sports 2/2 HD (India). – Disney+Hotstar (India).","pubDate":"2022-09-30 17:44:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Tickets For India vs South Africa 2nd T20I Match At Guwahati 'Sold Out'","link":"https://sports.ndtv.com/cricket/ind-vs-sa-tickets-for-india-vs-south-africa-2nd-t20i-match-at-guwahati-sold-out-3393723","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"IND vs SA: India take on South Africa at the Barsapara Cricket Stadium, Guwahati in the second T20I of the three-match series on Sunday.","content":"The T20 International between India and South Africa in Guwahati on Sunday is set to be a full house with all tickets sold out, an official said. The transparent manner in which the tickets were sold has also increased the enthusiasm among the cricket fans, Assam Cricket Association (ACA) secretary Devajit Saikia told PTI on Friday. \"We are expecting a full house. Out of about 38,000 seats, 21,200 were for the general public and the tickets were sold online in two phases. The tickets were sold out in no time,\" he said. Another 12,000 tickets were made available for the public through the district associations, and those were sold over the counters. \"Usually, 40-50 per cent of tickets sent to the districts return unsold. This time, hardly 100 tickets have come back to us,\" Saikia said. The rest of the tickets are sent to state associations and some are given as complimentary passes to special guests and invitees, he added. The capacity of the ACA Stadium in Guwahati is 39,500, but 1,500 are \"killed seats\" as the view of the field is not available from there. \"The fact that the ticket sale was completely transparent ensured that genuine lovers of the game will get an opportunity to watch their favourite players in action. There is unprecedented enthusiasm among them,\" Saikia claimed. He said that since the last match hosted at the venue in January 2020 was washed out, the enthusiasm among the people is even more. Crowd management, security and traffic arrangements are foolproof with all agencies working in coordination, he said. \"The match day is in the middle of Durga Puja and additional arrangements have been made for all aspects,\" he added. Saikia said a high-scoring match is expected and ACA is ready with additional entertainment for the crowd, besides the one on the field by the players. Promoted \"We have a crowd entertainment system in place. DJs will be playing and fireworks will be on display. It will run throughout the match. We are expecting a good game,\" he said. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-09-30 17:36:08","image_url":"https://c.ndtvimg.com/2021-10/qn27vgio_cricket-fans-generic-afp_625x300_06_October_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket: Shane Watson recalls Rajasthan Royals days after landing in Jodhpur, says 'I am back home'","link":"https://zeenews.india.com/cricket/legends-league-cricket-shane-watson-recalls-rajasthan-royals-days-after-landing-in-jodhpur-says-i-am-back-home-2516389.html","keywords":null,"creator":null,"video_url":null,"description":"The Aussie legend will be donning the jersey of Bhilwara Kings in the tournament and said that the state of Rajasthan is like his second home","content":"Former Australia all-rounder Shane Watson recalled his Rajasthan Royals (RR) days when he landed in Jodhpur on Friday (September 30) for the Legends League Cricket 2022 . Watson is well aware of the conditions in Rajasthan's cricket stadiums courtesy his time with the IPL franchise. Watson will join Bhilwara Kings for the remainder of the tournament (LLC). The Aussie legend will be donning the jersey of Bhilwara Kings in the tournament and said that the state of Rajasthan is like his second home. \"I am back home. I have so many incredible memories of playing in the state. I felt that connection again when I landed in Jodhpur today. The fans of the state love me and I am always humbled by their support. I am looking forward to playing here,\" Watson said in a press conference on Friday . The conference was also attended by former New Zealand captain Ross Taylor, former India pacer S Sreesanth, Ireland great Kevin O’ Brien and Raman Raheja, Co-Founder and CEO of Legends League Cricket. These legends matches throwing very interesting scenarios. Yusuf Pathan and Shane Watson played against each other yesterday, they are playing in the same team today. — Omkar Mankame (@Oam_16) September 30, 2022 Watson said the competition is high among the four teams and he will try to push the boundaries. With two matches left, all four teams — Gujarat Giants, Bhilwara Kings, India Capitals and Manipal Tigers — are in contention to clinch the playoffs berth. “I am following the tournament. It’s great to be here. I am well prepared. I know all the guys have been pushing their bodies to the limit. That’s the commitment we always had towards the game. So it’s not surprising to me. There’s nothing like whether you have retired or not. You are always trying to push the boundaries when you are playing the game. With everyone giving their best, I will also try to push the boundaries,” the 41-year-old said. Watson’s assessment of the tournament is indeed true. The game has seen tremendous competitive spirit among the cricketers. From Mohammed Kaif and Muttiah Muralidharan taking brilliant catches in the field to pacers Fidel Edwards and Tino Best peppering the batters with bouncers, the cricketers have refused to yield an inch without a fight. Taylor agreed with Watson too. “Competitiveness kicks in when you cross the rope. I am really happy with the way the legends have played the game. We have shown a lot of spirit and I am looking forward to playing the matches with more vigour,” he said.","pubDate":"2022-09-30 17:33:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma's Team India to undergo special preparation camp in Australia ahead of T20 World Cup - Here's all you need to know","link":"https://zeenews.india.com/cricket/rohit-sharmas-team-india-to-undergo-special-preparation-camp-in-australia-ahead-of-t20-world-cup-heres-all-you-need-to-know-2516381.html","keywords":null,"creator":null,"video_url":null,"description":"India is now awaiting the health update of Hooda and Jasprit Bumrah, who are both receiving treatment for back problems at the National Cricket Academy in Bengaluru.","content":"The Indian cricket team is expected to fly to Australia on October 6 ahead of the ICC T20 World Cup to attend a special preparation camp. For a training camp leading up to the T20 World Cup, the Indian side will fly out to Australia on October 6, two days after the T20I series against South Africa is over as a reserve team, captained most likely by Shikhar Dhawan, will be announced by the selectors for the three one-day internationals against South Africa from October 6-11 according to ESPNcricinfo. Captain leading from the front! Great comeback by Men in Blue! What a win. Congratulations Team India and @Imro45 .. pic.twitter.com/FgSN5Q1qNt — Amit Mishra (@MishiAmit) September 23, 2022 Prior to travelling to Brisbane for two additional exhibition matches against Australia and New Zealand before the tournament proper, India will train there till October 13 and are scheduled to play a practice match against Western Australia there as well. Up to five members of the T20 World Cup team, including the standbys, have never played in Australia's premier cricket league. Suryakumar Yadav, Harshal Patel (who travelled once with the U-19s in 2009), Arshdeep Singh, Deepak Hooda (who travelled once with the U-19s in 2013), and Ravi Bishnoi are the individuals mentioned. Therefore, these games might make it easier for these players to adjust and prepare for matches. India is now awaiting the health update of Hooda and Jasprit Bumrah, who are both receiving treatment for back problems at the National Cricket Academy in Bengaluru. Hooda was declared ineligible for the South Africa series, but Bumrah was only dropped on Wednesday, the day before the first T20I after he reported a back injury. Bumrah had only recently returned for the T20Is against Australia earlier this month after missing the Asia Cup due to back problems. He is currently back in the care of the NCA's medical staff, where it is thought that he had scans. He hasn't been completely disqualified from the T20 World Cup, but there are serious questions about his participation. It is probable that Chahar and Mohammad Shami will be called up to the main squad if injuries do prevent both Hooda and Bumrah from playing. India has put a lot of effort into getting ready for the T20 World Cup. They played T20Is in Ireland, England, the Caribbean, and the UAE over the course of the past three months, in addition to the home series against Australia and South Africa. At the ICC competition, India is in Group 2 with Pakistan, Bangladesh, South Africa, and two qualifiers. Following their October 23 encounter against Pakistan at the MCG, they will play on October 27, against a qualifier in Sydney, on October 30, against South Africa in Perth, on November 2, against Bangladesh in Adelaide, and on November 6. (vs qualifier in Melbourne). India T20 World Cup squad: Rohit Sharma (capt), KL Rahul (vice-capt), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah*, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh. Reserve players: Mohammed Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar.","pubDate":"2022-09-30 17:09:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"INDW vs SLW T20 2022 records: IND W vs SL W head to head record in T20 history","link":"https://thesportsrush.com/cricket-news-indw-vs-slw-t20-2022-records-ind-w-vs-sl-w-head-to-head-record-in-t20-history/","keywords":["Cricket","India Women","Sri Lanka Women","Women's Asia Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND W vs SL W head to head record: The SportsRush presents for you the Head to Head statistics for IND-W vs SL-W T20I. The second match of the eighth season of Women’s Asia Cup will be played between India Women and Sri Lanka Women in Sylhet tomorrow. An afternoon contest will follow the tournament… The post INDW vs SLW T20 2022 records: IND W vs SL W head to head record in T20 history appeared first on The SportsRush.","content":"The second match of the eighth season of Women’s Asia Cup will be played between India Women and Sri Lanka Women in Sylhet tomorrow. An afternoon contest will follow the tournament opener to be played in the morning. Having faced each other in this format just over a couple of months ago, India and Sri Lanka will be locking horns in the first high-profile match of the tournament. As far as Sylhet International Cricket Stadium, Academy Ground, is concerned, it will be hosting both the teams for the first time on Saturday. India, who have quite a one-sided T20I record against Sri Lanka, have maintained a similar kind of domination when it comes to playing at neutral venues. Having said that, the only India-Sri Lanka T20I in Bangladesh during Women’s World T20 2014 was won by Sri Lanka. Excitement Levels 🆙! 👏 👏 All set for the ! 👍 👍 — BCCI Women (@BCCIWomen) While India did win their last bilateral series against Sri Lanka, Sri Lanka had managed to win the last match primarily due to captain Chamari Athapaththu scoring a match-winning 80* (48) in a 139-run chase at the Rangiri Dambulla International Stadium. Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-09-30 17:04:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gayle storm in Jodhpur: West Indies great smashes 40-ball 68 for Gujarat Giants in Legends League Cricket 2022","link":"https://www.indiatoday.in/sports/cricket/story/chris-gayle-68-legends-league-cricket-gujarat-giants-vs-bhilwara-kings-2006922-2022-09-30?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Gayle storm in Jodhpur: WI great smashes 40-ball 68 in Legends League Cricket","content":null,"pubDate":"2022-09-30 16:56:00","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Umran Malik, Mohammed Siraj set travel with Team India following Jasprit Bumrah's injury","link":"https://zeenews.india.com/cricket/t20-world-cup-2022-umran-malik-mohammed-siraj-set-travel-with-team-india-following-jasprit-bumrahs-injury-2516377.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) Secretary Jay Shah on Friday said in a statement, \"Bumrah has sustained a back injury and is currently under the supervision of the BCCI medical team.\"","content":"T20 World Cup 2022: After several reports of India's pace spearhead Jasprit Bumrah likely to miss out on playing in the Men's T20 World Cup, starting in Australia from the next month due to back injury. BCCI confirmed on Friday that Bumrah will be replaced by fellow teammate Mohammed Siraj for the remainder of the T20I series against South Africa after sustaining a back injury. Adding to that, Sportstar reports that Umran Malik will also travel with Team India to Perth on October 6, where the Rohit Sharma-led side will do practice before going to Brisbane for their first warm-up game. The Board of Control for Cricket in India (BCCI) Secretary Jay Shah on Friday said in a statement, \"Bumrah has sustained a back injury and is currently under the supervision of the BCCI medical team.\" Umran Malik might be very dangerous bowler in Australian condition. #UmranMalik #INDvsSA #T20WorldCup #t20wc #T20WorldCup2022 pic.twitter.com/xZRvqQB68Q — Cricket Videos (@Crickket__Video) September 30, 2022 Currently, India have already started their series against South Africa at home which is their last assignment ahead the T20 World Cup 2022 in Australia. BCCI announced the squad for the South Africa series before the Australia series only and except for Hardik Pandya and Bhuvneshwar Kumar. Both Mohammed Siraj and Umran Malik will be on the team flight to Perth as the Rahul Dravid troops will carry atleast two additional pacers as back-up for Jasprit Bumrah and net bowlers in order to prepare for the major tournament. After Bumrah's injury, surely Rohit Sharma and the head coach have a lot to discuss now. India's squad for T20 World Cup 2022 (Announced earlier) Standby Players: Mohammad Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar. India: Rohit Sharma (c), KL Rahul, Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant, Dinesh Karthik, Hardik Pandya, R Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh.","pubDate":"2022-09-30 16:56:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajkot Cricket Stadium pitch report Irani Cup 2022: Saurashtra Cricket Association Stadium pitch report SAU vs ROI match","link":"https://thesportsrush.com/cricket-news-rajkot-cricket-stadium-pitch-report-irani-cup-2022-saurashtra-cricket-association-stadium-pitch-report-sau-vs-roi-match/","keywords":["Cricket","Irani Cup 2022","Rest of India","Saurashtra"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rajkot Cricket Stadium pitch report Irani Cup 2022: With the Irani Cup is set to return after a three-year gap. With the Irani Cup set to return after three years, the 2019-20 Ranji Trophy champions will take on the Rest of India (ROI) from Saturday onwards, at the Saurashtra Cricket Association Stadium, in Rajkot. While… The post Rajkot Cricket Stadium pitch report Irani Cup 2022: Saurashtra Cricket Association Stadium pitch report SAU vs ROI match appeared first on The SportsRush.","content":"Rajkot Cricket Stadium pitch report Irani Cup 2022: With the Irani Cup is set to return after a three-year gap. With the Irani Cup set to return after three years, the 2019-20 Ranji Trophy champions will take on the Rest of India (ROI) from Saturday onwards, at the Saurashtra Cricket Association Stadium, in Rajkot. While the veteran left-arm pacer Jaydev Unadkat will be leading the Saurashtra side, Rest of India will be skippered by India’s Test team middle-order batter Hanuma Vihari. The notable feature of the star-studded ROI side is the inclusion of as many as five opener batters, including the likes of Yashaswi Jaiswal and Yash Dhull, both of who have been experiencing a purple patch of form in First-Class matches off-late. ALSO READ: Irani Cup 2022 live telecast details While Jaiswal returned with his FC career-best innings of 265 for the West Zone in the Duleep Trophy versus South Zone, Dhull has just not looked behind ever since leading the Indian team to lift the Under-19 World Cup this year, smashing centuries in his maiden Ranji Trophy and Duleep Trophy appearances post the Cup. As for Saurshtra, fans’ eyes will be on the experienced Cheteshwar Pujara, who has had a stellar stint with Sussex, in both the County Championship matches and List ‘A’ matches this year. #IraniCup returns and how The prestigious match is back after 3⃣ years and will see some familiar faces take each other on #YehHaiNayiDilli pic.twitter.com/qDTUIgZiZo — Delhi Capitals (@DelhiCapitals) September 29, 2022 Rajkot Cricket Stadium pitch report Irani Cup 2022 The Saurashtra Cricket Association Stadium pitch at Rajkot is expected to offer truckload of runs to the batters, especially during the first two days of the contest. As for the bowlers, the optimum time for the fast bowlers to have a go at the batters is with the new ball upfront wherein there might be some lateral movement for them on offer off the deck. The spinners are likely to come into play from ‘Day 3’ onwards, when the pitch will gradually slow down due to wear and tear, thereby proving them the required grip off the surface. All in all, with both the teams being batting heavy, expect a high-scoring contest during the Irani Cup 2022 contest tomorrow onwards. The post Rajkot Cricket Stadium pitch report Irani Cup 2022: Saurashtra Cricket Association Stadium pitch report SAU vs ROI match appeared first on The SportsRush.","pubDate":"2022-09-30 16:54:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chris Gayle LLC: लीजेंड्स लीग क्रिकेट में आया गेल स्ट्रॉम, मार-मार कर गेंदबाजों की निकाली हवा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/chris-gayle-scored-68-runs-in-40-balls-for-gujarat-giants-in-legends-league-cricket/articleshow/94569285.cms","keywords":null,"creator":null,"video_url":null,"description":"Chris Gayle Legends League Cricket 2022: वेस्टइंडीज के विस्फोटक बल्लेबाज क्रिस गेल का बल्ला लीजेंड्स लीग क्रिकेट में भी जमकर बोल रहा है। उन्होंने टूर्नामेंट के 11वें मैच में भीलवाड़ा किंग्स के खिलाफ 68 रनों की तूफानी पारी खेली और अपनी टीम गुजरात जायंट्स के बड़े स्कोर तक पहुंचा दिया।","content":null,"pubDate":"2022-09-30 16:11:59","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"}]}