{"newsArray":[{"title":"19 पारियां, 9 सिंगल डिजिट स्कोर... आकाश चोपड़ा का ऐसा है इंटरनेशनल क्रिकेट करियर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/aakash-chopra-flop-record-in-international-cricket-great-in-domestic/articleshow/98136354.cms","keywords":null,"creator":null,"video_url":null,"description":"Aakash Chopra: आकाश चोपड़ा घरेलू क्रिकेट के दिग्गज खिलाड़ी थे लेकिन इंटरनेशनल क्रिकेट में उनका रिकॉर्ड कैसा है। 2003 में उन्हें न्यूजीलैंड के खिलाफ भारत के लिए टेस्ट डेब्यू करने का मौका मिला था। 2004 में उन्होंने अपना आखिरी मैच खेला। हम आपको बताते हैं कि टेस्ट क्रिकेट में उन्होंने क्या किया।","content":"भारतीय टीम के सलामी बल्लेबाज केएल राहुल (KL Rahul) लगातार खराब फॉर्म में चल रहे हैं। उन्हें लेकर सोशल मीडिया पर खूब हल्ला हो रहा है। लोग दो भागों में बंट गए हैं। कुछ राहुल को अभी और मौके देना चाहते हैं तो कुछ उन्हें बाहर करने के पक्ष में हैं। पूर्व भारतीय ओपनर आकाश चोपड़ा (Aakash Chopra) केएल राहुल के पक्ष में हैं। वह राहुल पर सवाल उठाने वाले दिग्गज तेज गेंदबाज वेकटेंश प्रसाद (Venkatesh Prasad) से सोशल मीडिया पर भिड़ गए। केएल राहुल के साथ खड़े आकाश चोपड़ा भी भारत के लिए टेस्ट मैच खेल चुके हैं। अभी वह क्रिकेट कमेंटेटर और यूट्यूबर हैं। 45 साल के आकाश चोपड़ा ने अक्टूबर 2003 में भारत के लिए टेस्ट डेब्यू किया था। अहमदाबाद में न्यूजीलैंड के खिलाफ उस मुकाबले में उन्होंने 42 और 31 रनों की पारियां खेली थीं। उसी सीरीज के दूसरे मुकाबले में उन्होंने 60 और 52 रन बनाए। साल के अंत में बॉर्डर गावस्कर सीरीज खेलने टीम इंडिया ऑस्ट्रेलिया गई और आकाश चोपड़ा को उस टीम में चुना गया। बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) में उन्हें चारों टेस्ट खेलने का मौका मिला। 8 पारियों में उनके बल्ले से 23.25 की औसत से 186 रन निकले। बिना किसी फिफ्टी या सेंचुरी के। उस सीरीज में भारत के अन्य प्रमुख बल्लेबाजों में राहुल द्रविड़ ने 619, वीवीएस लक्ष्मण ने 494, वीरेंद्र सहवाग ने 464, सचिन तेंदुलकर ने 383 और सौरव गांगुली ने 284 रन बनाए थे। सचिन और लक्ष्मण ने 7-7 जबकि गांगुली ने तो 6 ही पारियों में ही बल्लेबाजी की थी। 2004 में टीम इंडिया ऐतिहासिक टेस्ट सीरीज खेलने पाकिस्तान गई। वहां आकाश चोपड़ा को दो टेस्ट में मौका मिला और वह फेल रहे। तीसरे में वह प्लेइंग इलेवन का हिस्सा नहीं थे। 2004 में ऑस्ट्रेलिया भारत आया तो भी उन्हें दो मैचों में मौका मिला। इन दोनों मैचों में वह दहाई के आंकड़े तक भी नहीं पहुंच पाए। उसके बाद उन्हें कभी टीम इंडिया के लिए खेलने का मौका नहीं मिला। 10 मैचों के टेस्ट करियर में आकाश चोपड़ा ने 19 पारियां खेलीं। उनके नाम 23 की औसत से 437 रन हैं। 9 बार तो वह दहाई के आंकड़ों को भी नहीं छू पाए। 2004 में ही भारत के लिए गौतम गंभीर ने टेस्ट डेब्यू किया। इसके वीरेंद्र सहवाग परमानेंट ओपनर थे ही। इसके अलावा वसीम जाफर भी खेल रहे थे। यही वजह है कि घरेलू क्रिकेट में अच्छा प्रदर्शन करने के बाद भी आकाश चोपड़ा भारत के लिए दोबारा टेस्ट क्रिकेट नहीं खेल पाए। आकाश चोपड़ा भले ही इंटरनेशनल क्रिकेट में कमाल नहीं कर पाए लेकिन घरेलू क्रिकेट में उनका रिकॉर्ड बेहतरीन है। उन्होंने दिल्ली, हिमाचल प्रदेश और राजस्थान के लिए मुकाबले खेले। 162 फर्स्ट क्लास मैच में उन्होंने 45.35 की औसत से 10839 रन बनाए हैं। इसमें 29 शतक के साथ ही 53 फिफ्टी भी हैं। उनके नाम तिहरा शतक भी दर्ज है। घरेलू क्रिकेट में इसी दमदार रिकॉर्ड की वजह से उन्हें इंटरनेशनल मैचों में मौका मिला। लेकिन आकाश चोपड़ा वहां अपनी क्षमता के अनुसार खेल नहीं दिखा पाए।","pubDate":"2023-02-22 03:04:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"मुरलीधरन का भी गुरु... बल्लेबाजों का सबसे बड़ा काल, चटकाए एक या दो नहीं चार हजार से ज्यादा विकेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/wilfred-rhodes-took-most-wickets-in-first-class-cricket-4204-wickets/articleshow/98135867.cms","keywords":null,"creator":null,"video_url":null,"description":"Wilfred Rhodes Wickets: क्रिकेट में कई ऐसे रिकॉर्ड हैं जिसका टूटना लगभग नामुमकिन है। ऐसा ही एक रिकॉर्ड है सबसे ज्यादा विकेट लेने का। श्रीलंका मुथैया मुरलीधरन के नाम टेस्ट में 800 विकेट हैं। लेकिन इंग्लैंड के दिग्गज गेंदबाज ने 4000 से ज्यादा बल्लेबाजों को पवेलियन की राह दिलाई है।","content":"श्रीलंका के ऑफ स्पिनर मुथैया मुरलीधरन का नाम हम सभी को पता है। मुरली टेस्ट क्रिकेट में सबसे ज्यादा 800 विकेट लेने वाले गेंदबाज हैं। वनडे में भी उनके नाम सबसे ज्यादा विकेट हैं। लेकिन मैं अगर आपको कहूं कि फर्स्ट क्लास क्रिकेट में मुरली विकेट लेने के मामले में दूर-दूर तक नहीं है तो क्या आप भरोसा करेंगे। आप ये भी जानना चाहेंगे कि फिर फर्स्ट क्लास क्रिकेट में स सबसे ज्यादा विकेट हैं किसके नाम। तो हम आपको बताते हैं कि यह रिकॉर्ड किसके नाम है। इंग्लैंड के विल्फ्रेड रोड्स के नाम फर्स्ट क्लास क्रिकेट में सबसे ज्यादा विकेट हैं। अब क्या आप अनुमान लगा सकते हैं कि उन्होंने कितने विकेट चटकाए होंगे। उनके विकेट की संख्या मुरलीधरन के टेस्ट विकेट से 5 गुणा से भी ज्यादा है। बाएं हाथ के स्पिन ऑलराउंडर विल्फ्रेड रोड्स के नाम 1110 मैच में 4204 विकेट हैं। वह चार हजार से ज्यादा विकेट लेने वाले एकमात्र गेंदबाज हैं। ये विकेट उन्हें 16.72 की औसत और 44.1 की स्ट्राइक रेट से मिले। 287 बार उन्होंने पारी में 5 विकेट और 68 बार मैच में 10 विकेट लिये। उनके नाम सबसे ज्यादा फर्स्ट क्लास मैच खेलने का भी रिकॉर्ड है। 1898 से 1930 के बीच रोड्स ने यॉर्कशायर के लिए क्रिकेट खेला था। गेंदबाज के साथ ही वह बेहतरीन बल्लेबाज भी थे। 1877 में जन्मे विल्फ्रेड रोड्स ने 1899 और 1930 के बीच इंग्लैंड के लिए 58 टेस्ट मैच खेले। टेस्ट में रोड्स ने 127 विकेट लिए और 2,325 रन बनाए। वह टेस्ट मैचों में 1,000 रन और 100 विकेट का दोहरा पूरा करने वाले पहले अंग्रेज थे। 1930 में जब उन्होंने अपना आखिरी टेस्ट खेला तो उनकी उम्र 52 साल और 165 दिन थी। वह टेस्ट मैच खेलने वाले सबसे उम्रदराज खिलाड़ी भी हैं। 1110 मैचों में विल्फ्रेड रोड्स के नाम 30.81 की औसत से 39969 रन भी हैं। उन्होंने 58 शतक और 197 फिफ्टी लगाई है। उनका सबसे बड़ा स्कोर 267 रन है। वह फर्स्ट क्लास क्रिकेट में 199 शतक बनाने वाले जैक हॉब्स के साथ पारी की शुरुआत भी करते थे। 2009 में रोड्स को आईसीसी क्रिकेट हॉल ऑफ फेम में शामिल किया गया था।","pubDate":"2023-02-22 01:56:34","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK के लिए आईपीएल 2023 से पहले बड़ी खुशखबरी, मैच विनर खिलाड़ी हुआ पूरी तरह फिट","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/deepak-chahar-fully-fit-to-play-in-ipl-2023-for-chennai-super-kings/articleshow/98135698.cms","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings: महेंद्र सिंह धोनी की कप्तानी वाली चेन्नई सुपर किंग्स को आईपीएल 2023 से पहले बड़ी खुशखबरी आई है। टीम 31 मार्च को गुजरात के खिलाफ सीजन का पहला मैच खेलेगी। इससे पहले टीम के मैच विनर खिलाड़ी ने घोषणा कर दी है कि वह पूरी तरह फिट है।","content":"पिछले साल दो बड़ी चोटों से जूझने के बाद भारतीय तेज गेंदबाज दीपक चाहर ( ) ने कहा है कि वह पूरी तरह से फिट हैं। 31 मार्च से शुरू हो रहे इंडियन प्रीमियर लीग से वापसी करने को तैयार हैं। तीस साल तेज गेंदबाज को स्ट्रेस फ्रैक्चर और फिर जांघ की तीसरे ग्रेड की चोट से उबरने में काफी मुश्किल हुई। वह पिछली बार भारत की ओर से बांग्लादेश में दूसरे वनडे में खेले थे जहां वह सिर्फ तीन ओवर गेंदबाजी कर पाए थे। वर्ष 2022 में चाहर भारत के लिए केवल 15 मैच ही खेल सके थे और चोट के कारण टी20 विश्व कप से भी बाहर हो गए थे। राष्ट्रीय क्रिकेट अकादमी (एनसीए) में रिहैबिलिटेशन के बाद चाहर आईपीएल की तैयारी कर रहे हैं जहां वह चेन्नई सुपर किंग्स का प्रतिनिधित्व करेंगे। चाहर ने कहा, ‘मैं अपनी फिटनेस पर पिछले दो-तीन महीनों से कड़ी मेहनत कर रहा हूं, मैं पूरी तरह से फिट हूं और आईपीएल के लिए अच्छी तैयारी कर रहा हूं।’ उन्होंने कहा, ‘मुझे दो बड़ी चोट लगी थीं। एक स्ट्रेस फ्रैक्चर था और एक जांघ की तीसरे ग्रेड की चोट। दोनों बहुत बड़ी चोट हैं। आप महीनों के लिए बाहर हो जाते हैं। चोट के बाद वापसी करते हुए समय लगता है, खासकर तेज गेंदबाजों को। अगर मैं एक बल्लेबाज होता तो मैं लंबे समय तक खेलता लेकिन एक तेज गेंदबाज के रूप में जब आपको स्ट्रेस फ्रैक्चर होता है, तो वापसी करना बहुत कठिन होता है। आप अन्य गेंदबाजों को भी पीठ या कमर की चोट को लेकर संघर्ष करते हुए देख सकते हैं।’ राजस्थान के तेज गेंदबाज ने पिछले महीने सेना के खिलाफ प्रथम श्रेणी मैच के साथ प्रतिस्पर्धी क्रिकेट में वापसी की थी लेकिन यह उनका एकमात्र रणजी ट्रॉफी मैच था। चोटों के कारण संभावित खिलाड़ियों की सूची में नीचे खिसकने वाले चाहर को इस साल के अंत में स्वदेश में एकदिवसीय विश्व कप के लिए भारतीय टीम का हिस्सा बनने की उम्मीद हैं। उन्होंने कहा, ‘मैं अपने पूरे जीवन में एक नियम से जिया हूं। अगर मैं पूरी तरह से अपनी इच्छानुसार गेंदबाजी कर रहा हूं, अगर मैं अपनी इच्छानुसार बल्लेबाजी कर रहा हूं, तो मुझे कोई रोक नहीं सकता है। यही वह मूल नियम था जिसके साथ मैंने अपने करियर की शुरुआत की थी।'","pubDate":"2023-02-22 01:16:56","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दो हार से तिलमिला उठा ऑस्ट्रेलिया का पूर्व दिग्गज, अपने ही कप्तान को सुना दी खरी खोटी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/allan-border-raised-questions-on-captaincy-of-pat-cummins/articleshow/98135582.cms","keywords":null,"creator":null,"video_url":null,"description":"Border Gavaskar Trophy:ऑस्ट्रेलिया को बॉर्डर गावस्कर सीरीज में भारत के खिलाफ लगातार दो हार मिल गई है। नागपुर और फिर दिल्ली में हुए टेस्ट को भारतीय टीम ने अपने नाम किया। इस हार के बाद ऑस्ट्रेलिया के पूर्व कप्तान और दिग्गज खिलाड़ी ने अपने ही कप्तान पैट कमिंस पर ही सवाल उठा दिये हैं।","content":"दिग्गज क्रिकेटर एलन बॉर्डर का मानना है कि पैट कमिंस के पास चिंता करने के लिए काफी कुछ है। क्योंकि भारत के खिलाफ सीरीज ‘कप्तान के रूप में उनकी पहली असली परीक्षा’ थी और इस प्रक्रिया में दिल्ली में दूसरे टेस्ट में उन्होंने स्वयं से काफी कम गेंदबाजी कराई। ऑस्ट्रेलिया ने नागपुर और दिल्ली में शुरुआती दो टेस्ट हारने के बाद बॉर्डर-गावस्कर ट्रॉफी जीतने का मौका गंवा दिया है। भारत दौरे पर आने से पहले कप्तान के रूप में सिर्फ एक मैच में शिकस्त झेलने वाले कमिंस दिल्ली में छह विकेट की हार के दौरान ऑस्ट्रेलियाई अंतिम एकादश में एकमात्र तेज गेंदबाज थे। उन्होंने पहली पारी में सिर्फ 13 ओवर फेंके और भारत की दूसरी पारी में बिल्कुल भी गेंदबाजी नहीं की। एलन बॉर्डर ने ‘एसईएन रेडियो’ से कहा, ‘मुझे लगता है कि पैट ने उस टेस्ट मैच में खुद से बहुत कम गेंदबाजी कराई। ऐसे मौके थे जब हम भटकने लगे थे, खासकर भारत की पहली पारी में जब हमने उन्हें एक अच्छी साझेदारी बनाने का मौका दिया। उस समय अगर वह दो या तीन ओवर आक्रामक गेंदबाजी करता तो...’’ ऑस्ट्रेलिया ने भारत का स्कोर सात विकेट पर 139 रन कर दिया था लेकिन अक्षर पटेल और रविचंद्रन अश्विन ने 114 रन की साझेदारी की जिससे मेजबान टीम ने अपने स्कोर को मेहमान टीम के स्कोर से एक रन कम तक पहुंचा दिया। उन्होंने कहा, ‘मुझे लगता है कि मैदान पर अन्य लोग हैं जो कप्तान के पास जा सकते हैं और कह सकते हैं, ‘दोस्त, आप गेंदबाजी क्यों नहीं करते?‘ बॉर्डर ने कहा, ‘लेकिन मुझे लगता है कि एक कप्तान के रूप में पैट की यह पहली वास्तविक परीक्षा है, बाकी सब आसान रहा है, आप उपमहाद्वीप में जाते हैं और अचानक हर विभाग में आपकी परीक्षा होती है।’ उन्होंने कहा, ‘वह बहुत सी अलग-अलग चीजों को लेकर चिंतित है, मुझे लगता है कि वह खुद से गेंदबाजी कराना भूल गया। जब आपका प्रमुख तेज गेंदबाज आपका कप्तान हो तो ऐसा हो सकता है।’ पूर्व विकेटकीपर इयान हीली ने महसूस किया कि कमिंस ने दूसरी पारी में ‘मानसिक शक्ति’ खो दी जिससे दूसरी पारी में सही क्षेत्ररक्षण नहीं लगा पाए। हीली ने कहा, ‘फिर मानसिक तनाव जिसके कारण वह सही क्षेत्ररक्षण नहीं लगा पाया।’ उन्होंने कहा, ‘बल्ले के चारों तरफ कैच लेने वाले अधिक क्षेत्ररक्षक लगाने के बजाय उसने बाउंड्री पर क्षेत्ररक्षक लगाए थे। इसके (गेंदबाजी में बदलाव) बारे में सोचने के लिए दिमाग की बहुत शक्ति की जरूरत होती है।’","pubDate":"2023-02-22 01:01:03","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad- Report","link":"https://www.thetimesofbengal.com/sports/prime-minister-narendra-modi-and-australian-pm-anthony-albanese-to-attend-india-vs-australia-4th-test-in-ahmedabad-report/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad- Report The fourth Test is scheduled to be held at Ahmedabad from March 9-13. Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad. (Image: Twitter) New […]","content":"New Delhi: Australian Prime Minister Anthony Albanese is set to make his maiden trip to India early next month with an aim to boost overall bilateral engagement in a range of areas, including trade, investment and critical minerals. People familiar with the plan for his visit said on Monday that Albanese is expected to begin the visit around March 8 and he and Prime Minister Narerndra Modi are likely to travel to Ahmedabad to witness the fourth cricket Test match between India and Australia. The fourth Test is scheduled to be held at Ahmedabad from March 9-13. It will be Albanese’s first visit to India after he became prime minister in May last year. External Affairs Minister S Jaishankar visited Australia last week ostensibly to prepare for the visit to India by the Australian prime minister. There is no official announcement of the visit yet. However, Albanese mentioned about his visit to India in a tweet after meeting Mr Jaishankar on Saturday. “It was wonderful to meet with @DrSJaishankar his morning ahead of my trip to India next month. We discussed our strategic partnership, economic opportunities and the people-to-people ties that enrich our nations,” he tweeted. The people said expansion of cooperation in the Indo-Pacific in the backdrop of China’s growing military muscle-flexing in the region is expected to figure in the talks during the Australian prime minister’s visit to India. They said boosting trade, investment and critical minerals will figure high on the agenda of talks between Prime Minister Modi and Albanese. The ties between India and Australia have been on an upswing in the last few years. The India-Australia Economic Cooperation and Trade Agreement (ECTA) came into force in December and it is expected to facilitate significant expansion of two-way trade. Defence and security ties between India and Australia have been on an upswing in the last few years. In June 2020, India and Australia elevated their ties to a comprehensive strategic partnership and signed a landmark deal for reciprocal access to military bases for logistics support. The Mutual Logistics Support Agreement (MLSA) allows the militaries of the two countries to use each other’s bases for repair and replenishment of supplies, besides facilitating scaling up of overall defence cooperation. In August last year, four Sukhoi-30 MKI fighter jets and two C-17 heavy-lift aircraft of the Indian Air Force joined a 17-nation air combat exercise in Australia. Over 100 aircraft and 2,500 personnel from Australia, Canada, France, Germany, Indonesia, India, Japan, Malaysia, the Netherlands, New Zealand, the Philippines, Republic of Korea, the UAE, Singapore, Thailand, the US and the UK participated in the exercise in Australia’s Northern Territory. Australia is set to host the Malabar naval exercise later this year. It will involve the navies of India, Australia, Japan and the US. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-22 00:31:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Super sub: Who could be your AFL team’s swingman in 2023?","link":"https://www.brisbanetimes.com.au/sport/afl/super-sub-who-could-be-your-afl-team-s-swingman-in-2023-20230221-p5cm4w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"The super sub is back, with clubs drilling into their lists to determine who would be the best fit to cover for injury, while also potentially having the ability to be a late match winner. We look at each club’s potential candidates.","content":"The back-to-the-future AFL ruling that will allow coaches to activate a substitute at any time of a game in 2023 has clubs dissecting who best should fill the role. Having had four men on the bench plus a medical substitute over the past two years, the AFL has this season ditched the medical sub – as it became , in part, too hard to monitor – in favour of a “super sub”. Who will be your club’s super sub in 2023? Credit: Pat Scala/Jamie Brown It was through 2011-15 that there were three men on the bench plus a substitute – the latter able to be activated at any point for any reason in the game. Game plans, the strength and health of a list, and opposition tactics will have a bearing on who is the 23rd man. Ahead of the practice match campaign officially beginning on Thursday , Demons head of football Alan Richardson said clubs had to weigh up several factors when determining their sub. “You wouldn’t want to enact it too early in a game just in case you get an injury. It’s probably going to be something after half-time I reckon, then it can depend,” Richardson said. “It will be a combination for us of how the team is going in a certain area, or do we potentially want to bring someone in that might bolster an area for us? It might be a combination, along with what the opposition are doing. What have the opposition got, and what are we going in fearing, and what do we need to control? Is there someone that can exploit something, or control something? “That is sort of where we are at. It will be good in these couple of games to look at it.” Speed in the game, or injecting a tough-nut extractor, are likely to be the primary weapons considered, according to most clubs, but other club chiefs have wondered whether a fresh marking tall, or even a ruck, could be activated. Adelaide Shane McAdam , who has had an injury-impacted pre-season, can play as a high half-forward and take a strong mark. And veteran Matt Crouch , after an indifferent 2022 when he managed only 11 games, could provide midfield class and experience with the contest on the line. Brisbane Lions The versatile Callum Ah Chee was used as the substitute several times last season. Irishman Conor McKenna , back in the AFL fold, has the speed to burn tiring opponents across half-back and further afield. Carlton Jack Silvagni may be squeezed from the Blues’ best 22 this season, but his versatility – as a forward, reserve ruckman and even midfielder – makes him an ideal 23rd man. Draftee Oliver Hollands and Josh Honey can provide run and carry. Matthew Cottrell was injected four times as the sub last season. Could Jack Silvagni be the Blues’ ideal super sub, or will Michael Voss prefer an injection of speed in 2023? Credit: Getty Images Collingwood Will Hoskin-Elliott faces a fight to be in the Magpies’ best 22, but his run off the bench would be more than handy. Finlay Macrae , who may struggle to break into a blue-chip midfield, could also do the job. Essendon Big-bodied former Carlton midfielder Will Setterfield shapes as an ideal fit off the bench, while Ben Hobbs , on the mend from a calf strain, can head into the midfield or forward line and influence a game. Loading Fremantle High-pressure small forward Bailey Banfield is an ideal fit, having been regularly used as the sub last season, including in both finals. If Banfield forces his way into the starting 22, speedster Liam Henry could do the role. Geelong Versatile Irishman Mark O’Connor , who replaced an injured Max Holmes in the premiership 22 last year, is an ideal fit. Talented recruits Tanner Bruhn , Ollie Henry and Jack Bowes face a squeeze to make the Cats’ best 22, but could easily start as the spare man. Versatile Geelong utility Mark O’Connor in action. Credit: Getty Images Gold Coast Brayden Fiorini has the speed to trouble opponents off the bench, while defender Sean Lemmons and Rory Atkins , the latter used as a sub last year, are also options. Greater Western Sydney Toby Bedford will hope to avoid the role, as the former Demon started several games as the medical sub last season. Fellow small forward Brent Daniels could be an ideal fit, while Jacob Wehr and Callum Brown provide versatility. Loading Hawthorn The Hawks will have a new-look midfield this season. Finn Maginness , a tagger last season, may be squeezed out of the 22 if the Hawks look to attack early in games. Lachlan Bramble has the versatility. Melbourne Premiership defender Jake Bowey fell out of the starting rotation last year. Buoyed by a strong pre-season, he could provide run off the bench. Tom Sparrow , fighting for a midfield spot, is another option. After a short-lived retirement, former Hawthorn forward Liam Shiels could be a valuable swingman at his new club, North Melbourne. Credit: Getty Images North Melbourne Alastair Clarkson trusts his former Hawthorn mates, so having either veterans Liam Shiels or Daniel Howe off the bench, particularly early in the season, makes sense. Is Jaidyn Stephenson , used at half-back and half-forward in last weekend’s intra-club clash, an option? Port Adelaide Xavier Duursma , seeking to revive his career, and midfielder Sam Powell-Pepper are strong options, while youngster Jase Burgyone , with eight games last season, is also a possibility. Richmond Jason Castagna was used as a substitute last year, and his run through high half-forward and ability to hit the scoreboard could be important for the Tigers. Hugo Ralphsmith is versatile and can provide rebound from half-back, while also going to a wing. Jack Ross is another option. Will the Tigers again turn to Jason Castagna to spend time as a substitute this season? Credit: Getty Images St Kilda Former Blue Liam Stocker is seen as a burst player who could have an impact at half-back and through the midfield. Nick Coffield , once fully fit, and Hunter Clark are also options. Loading Sydney Emerging half-back Braeden Campbell can provide run and carry and push into the midfield. Joel Amartey , Hayden McLean and Sam Wicks can also provide punch off the bench. West Coast Former hard-running Demon Jayden Hunt shapes as an ideal fit to help turn a game after half-time, while veteran Jamie Cripps can deliver up forward. Versatile defenders Josh Rotham and Jamaine Jones and midfielder Greg Clark were used in the role last season. Western Bulldogs Jason Johannisen is an ideal fit, for he has pace, and can play multiple roles, but is likely to be in the best 22. Anthony Scott can go into the midfield or forward, while Hayden Crozier and Riley Garcia can deliver in bursts. Veteran half-forward Mitch Hannan could be a calming hand. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Carlton Blues Collingwood Magpies Essendon Bombers Hawthorn Hawks More… Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-02-22 00:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Why Dewald Brevis Will Be The Man To Watch Out In Mumbai Indians Camp","link":"https://www.thetimesofbengal.com/sports/why-dewald-brevis-will-be-the-man-to-watch-out-in-mumbai-indians-camp/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Why Dewald Brevis Will Be The Man To Watch Out In Mumbai Indians Camp IPL legend AB De Villiers compares Brevis to Surya Kumar Yadav and picks the young South African to shine in the white-ball format. Dewald Brevis turned out for MI Cape Town in the recently-concluded SA20. (Photo: BCCI) […]","content":"New Delhi: The 2023 edition of the Indian Premier League is upon us and cricket pundits have started picking the players who are likely to shine in the world’s biggest T20 league. South African teenager Dewald Brevis is expected to turn heads, believes former IPL superstar AB De Villiers . This will be Dewald Brevis’ second season in IPL. In 2022, Mumbai Indians picked the highly-rated South African all-rounder for Rs 3 crores. Five-time IPL champions Mumbai Indians are in rebuilding mode and Brevis will surely be among the core players who can help MI regain their glorious days. Brevis is nicknamed as ‘Baby AB’. He has shown the versatility in stroke-making and bats in the middle-order, a position where De Villiers, under pressure, excelled in both building an innings and shifting gears while chasing. It is not for nothing that De Villiers is backing Brevis to shine in IPL 2023. Brevis has just played for MI Cape Town in the SA20. He ran hot and cold with the bat. An unbeaten 70 off 41 balls helped MI Cape Town beat Davis Miller-led Paarl Royals by eight wickets. Brevis had two more scores in the 40s, opening the batting. When IPL starts on March 31, Brevis is expected to match ready when Mumbai Indians play their first match against Royal Challengers Bangalore on April 2 at Bangalore’s Chinnaswamy Stadium. While he will certainly be an opening option, MI may want him to bat in the middle order where Surya Kumar Yadav will be a mainstay. Dewald Brevis will be 20 when IPL will be at the mid-way stage. He is at that stage of his career where he can only learn and learn. And what better to be in a team where there are seasoned players like Rohit Sharma, Surya Kumar Yadav and Cameron Green. AB De Villers feels Brevis has shades of Yadav in his game. Yadav, nicknamed SKY, has rocked white-ball cricket with his range of strokes and power-hitting. He says: “There are certainly similarities in the way that they approach the game. They’re both really aggressive, they want to take the bowlers on and they don’t let the bowlers settle. “Dewald is obviously a lot younger and has still got a lot to learn, whereas SKY is experienced these days. He come a long way having performed well for the Mumbai Indians at the IPL. But they both excite me a lot.” Dewald Brevis has the potential to fill De Villiers’ shoes for South Africa, a team that has lost a lot of punch and flair at the world stage. At least, the numbers indicate Brevis has the promise to do so. MI spotted him after the South African captain became the highest run-getter in the ICC Under-19 World Cup 2021-22. In six matches, Brevis amassed 506 runs, including two hundreds and three fifties. With a strike-rate of 90-plus, Brevis was simply outstanding. Brevis has more big numbers to back his talent. He was the youngest South African at 19 years 185 days to slam a men’s T20 century. By slamming 162, Brevis is the highest T20 scorer in South African cricket. Only Chris Gayle (175 not out) and Aaron Finch (172) are ahead of Brevis. Season 2023 will be one of redemption for Mumbai Indians. Having finished last in 2022 among 10 teams, MI will look to claw back. Brevis will be part of the plans and he will get a lot of ‘home’ support from former South African stumper and coach, Mark Boucher, the new Mumbai Indians boss. In his maiden season with MI, Brevis scored 161 runs in seven matches at an average of 23. His strike-rate was a breezy 142.48 but that’s not enough. It’s time to produce the big numbers on Indian soil. And AB De Villiers will surely be watching. (Soumitra Bose is a senior journalist and research scholar. He tweets @soumitra65. Views are personal) $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-22 00:23:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Wolvaardt and Brits help Proteas secure semifinal spot in T20 World Cup","link":"https://www.dailymaverick.co.za/article/2023-02-21-wolvaardt-and-brits-help-proteas-secure-semifinal-spot-in-t20-world-cup/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Openers Tazmin Brits and Laura Wolvaardt struck a century partnership to help the Proteas to a 10-wicket victory over Bangladesh. They will now face England in the second semifinal on Friday. The post Wolvaardt and Brits help Proteas secure semifinal spot in T20 World Cup appeared first on Daily Maverick.","content":"A superb century stand by openers Laura Wolvaardt and Tazmin Brits helped the Proteas women to a comfortable 10-wicket win over Bangladesh on Tuesday. The victory means South Africa will face England in the semifinal of the T20 World Cup at Newlands on Friday. In what was essentially a quarterfinal clash for the Proteas, Wolvaardt struck a well-paced 66 off 56 deliveries while Brits held her own with an important 50 off 51 deliveries. Laura Wolvaardt of South Africa on her way to scoring 66 off 56 deliveries in the ICC Women’s T20 World Cup match between against Bangladesh at Newlands Cricket Ground in Cape Town on 21 February 2023. (Photo: Ashley Vlotman / Gallo Images) Wolvaardt’s confidence-boosting half-century contained seven fours and one magnificent six over mid-on. Bangladesh skipper Nigar Sultana won the toss and elected to bat first. The Proteas restricted them to 113 for six, but it wasn’t all easy going for the host nation, chasing 114 for victory. The opening pair struggled to pierce the gaps and rotate the strike in the first half of the innings, scoring only 43 in the first 10 overs. But the handbrake was released after that point, with South Africa thrashing 74 runs in the last 47 deliveries of their innings to secure their passage to the next round with 13 balls to spare. “An extra 20 to 30 runs would have made a big difference,” said Sultana after the match. It was a good return to form for Wolvaardt, whose previous highest score in the World Cup was 19 in South Africa’s last match against Australia. The victory, however, was once again set up by South Africa’s phenomenal bowlers. Ayabonga Khaka of South Africa picked up two wickets against Bangladesh. (Photo: Ashley Vlotman / Gallo Images) Only Nadine de Klerk and Chloe Tryon — who shared the load of the fifth bowler — went for more than six runs an over, while Marizanne Kapp registered magnificent figures of two wickets for 17 runs in her four overs. One of her wickets included that of skipper Sultana for 30 in the final over of the innings, just as she was getting going. Ayabonga Khaka also picked up two wickets as she and Kapp restricted the Bangladeshis masterfully at the end of the innings. Visit Daily Maverick’s home page for more news, analysis and investigations Left-arm orthodox Nonkululeko Mlaba once again opened the bowling alongside Shabnim Ismail and the pair kept things tight upfront while taking one wicket apiece. However, South Africa’s fielding left a lot to be desired as the batting heroines Wolvaardt and Brits dropped two sitters. There were several overthrows as well, which helped Bangladesh reach their below-par total. The Proteas will need to sharpen up in that department if they are to reach their first World Cup final. Just a few hours before South Africa’s victory, their semifinal opponents, England, dismantled Pakistan by 114 runs. England smashed their way to the highest Women’s T20 World Cup score of 213 for five before bowling Pakistan out for 99. India and Australia will face off in the first semifinal on Thursday. South Africa’s semifinal against England starts at 3pm on Friday. DM","pubDate":"2023-02-21 21:38:51","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Nat Sciver-Brunt, Wyatt, Jones break Women’s T20 World Cup record in win over Pakistan","link":"http://island.lk/nat-sciver-brunt-wyatt-jones-break-womens-t20-world-cup-record-in-win-over-pakistan/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"England smashed the highest ever women’s T20 World Cup total in a record 114 run thrashing of Pakistan in Newlands to complete an unbeaten group phase Brief scores: England 213 for 5 (Nat Sciver-Brunt 81*, Danni Wyatt 59, Fatima Sana 2-44) beat Pakistan 99 for 9 (Tuba Hassan 28, Katherine Sciver-Brunt 2-14) by 114 runs","content":"England Pakistan Published on By Asian Youth Championship medallist Nirmali Wickramasinghe of Wickramabahu Central, Gampola is among dozens of leading youth athletes vying to achieve qualifying standards for the next edition of the Asian event which will be held in Uzbekistan. The final selection trial to pick Sri Lanka’s team for the Asian event will be held today and tomorrow at Diyagama. Despite a marked drop in performance standards at the last Asian Youth Championships, Sri Lanka Athletics has set tough qualifying standards to select the team for the next edition . While setting up tough entry standard even for the trial meet, the Athletics officials have raised the qualifying standards in some events. The qualifying standard for the boys’ 1500 metres is set at four minutes despite even the gold medal of the last meet being decided in a time of 4:04.59 minutes. In the corresponding girls event too the qualifying standard is 4:48.00 minutes. The gold medal of the last championship was decided in 4:51.61 minutes. Wickramasinghe who won the silver medal of the girls’ 800 metres at the Asian Youth Championship in Kuwait last year has run the 1500m below the qualifying standard and will be among dozen others eager to excell at the two-day meet. In the 400 metres, the event where Sri Lanka won two medals last year, the qualifying standard is 48.80 seconds for boys while it is 56.50 for girls. Women’s 3,000m, Men’s 3,000m, Women’s 200m Heats, Men’s 200m Heats, Women’s 400m Hurdles, Men’s 400m Hurdles, Men’s high jump, Women’s Long Jump, Women’s 800m, Men’s 800m, Women’s 100m hurdles, Men’s 110m hurdles, Men’s triple jump, Men’s pole vault, Women’s 200m, Men’s 200m. Published on By Dinara de Silva, Sandas Usgodaarachchi and Methwan Wijemanne registered victories in their respective singles matches of the Junior Davis Cup and Junior Billie Jean King Cup tournament matches played at the Sri Lanka Tennis Association courts on Monday. Methwan Wijemanne Published on By It started with a sensational win over South Africa in the tournament opener and ended with a whimper as they were dismissed for their third-lowest total in T20Is. It’s fair to say Sri Lanka came, saw, conquered and then crashed out. For Chamari Athapaththu, it’s not a calamity. “The world has not ended. The sun will come up tomorrow. I want to build a good team for the future. Today the feeling is not good but my focus is the next tour,” she said, still smiling, afterwards. That Athapaththu can even talk about the next tour is a win for Sri Lanka. They went without fixtures between March 2020 and January 2022 and know what the effects of a prolonged absence from the game can do for a team’s momentum. Now, thanks to the first ever women’s FTP, they have visits from Bangladesh (which did not take place prior to the World Cup as initially scheduled) and New Zealand to look forward to, as well as a tour of England later this year. “The youngsters need some experience. They need to play more cricket in future,” Chamari said. “We have to play a lot of cricket against the top four teams.” Chamari’s youngsters include under-19 captain Vishmi Gunaratne, who is only 16, offspinner Kavisha Dilhari, who has 10 more T20I caps to her name than her age of 22, and her opening partner, 24-year-old Harshitha Samarawickrama. All of them were excited about the prospect of reaching the semi-finals and anxious about beating New Zealand after losing to Australia, even if that result had been somewhat priced in. “I’m not worried about the Australia games but I’m a little bit worried about today’s game,” she said. “It was a very crucial game for us and I felt some of the girls in my team put too much pressure on their shoulders. I think they didn’t handle that pressure very well.” Sri Lanka’s nerves showed almost immediately. They missed a run-out chance that would have seen Bernadine Bezuidenhout dismissed for 7 and then dropped her on 19. She went on to score 32 and share in a 46-run opening stand with Suzie Bates that set up New Zealand’s innings. They also dropped Bates, on 37, as her 56 off 49 balls propelled New Zealand to a score above 160. In response, Sri Lanka were completely shell-shocked. They played their big shots too early and picked out fielders and once Athapaththu was dismissed, it became a procession as the last five wickets fell for 25 runs. Their opposition knows exactly what that feels like. It was less than a week ago that New Zealand were bundled out for 67 – the second-lowest T20I total – two days after Australia had dismissed them for 76 to all but end their hopes of qualifying for the semi-finals. They were particularly distressed after their 65-run defeat to South Africa – a match that had the weight of a quarter-final attached to it – and captain Sophie Devine emphasised the need to figure out and discuss where things were going wrong. Athapaththu may be tempted to do the same but Amelia Kerr, who was part of Devine’s team’s talks, had some advice. “When there is emotion involved, sometimes you don’t know what to say and it’s better to review it the next day.” When New Zealand did that, they came up with a mantra for their last two games: “be tougher when things get tough,” Kerr explained. “There was nothing wrong with the talent we have in this room, it was just to have that belief and be tough.” That may work for New Zealand, who have a fairly developed professional structure as opposed to Sri Lanka, whom FICA’s annual global employment report said had “not professional structures”, and both Athapaththu and Kerr acknowledged the gap is growing. Unsurprisingly, they both cited Australia as the benchmark and while Athapaththu zoned in on the domestic structure, Kerr looked at T20 franchise leagues that have made the difference. “Australia has a good domestic structure. They play a lot of cricket – domestic tournaments and schools tournaments,” Athapaththu said, while Kerr described the resources the Australian players have as “outstanding”. But they also pointed to the growing prowess of India as a signal to the rest to speed up their development. “In terms of what we are seeing around the world, with the Hundred in England, the WBBL in Australia and now the WPL, it’s going to strengthen those countries a lot,” Kerr said. “We are heading in the right direction: our match fees being equal to the men, and it allows us to earn more money so we can train more. Most of us do cricket full-time which is only going to help our game. We are behind those countries but if all countries can get that opportunity it is going to help grow the women’s game.” And for Athapaththu, that is especially significant for the other teams on the subcontinent, which could have just one representative – India – in the final four. “India has a good structure but in Pakistan, Sri Lanka and Bangladesh, we have to develop our structure,” she said. Because she wants to be part of that process, Athapaththu herself has committed to at least another T20 World Cup – the next tournament is in Bangladesh in September/October 2024 – and perhaps even another 50-over tournament. “I want to build a good team for Sri Lanka for the future, so that’s my goal,” she said. “I want to encourage the youngsters and be a role model. I always try to lead them from the front, so my target is playing another one or two years for Sri Lanka. That’s what I want to do.”","pubDate":"2023-02-21 20:51:43","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"South Africa beat Bangladesh to secure spot in World cup semi-finals","link":"https://www.thesouthafrican.com/sport/cricket/south-africa-beat-bangladesh-in-t20-womens-world-cup-semi-final-bound-21-february-2023/","keywords":["Cricket","Sport","bangladesh","Featured","ICC Women’s T20 World Cup","Important","Proteas"],"creator":["Zareena Gaibee"],"video_url":null,"description":"South Africa beat Bangladesh by 10 wickets, in Cape Town to secure their place in the semi finals of their home Women's T20 World Cup.","content":"South Africa beat Bangladesh by wickets 10, in Cape Town to secure its place in the semi-finals of the Women’s T20 World Cup. In the final pool game, Bangladesh won the toss and chose to bat first. South Africa beat Bangladesh ALSO READ: Proteas Wolvaardt embracing pressure of must-win Bangladesh set a target of 114 Bangladesh struggled to form partnerships with wickets falling regularly. Captain Nigar Sultana Joty top scored with 30 off 34 deliveries. Sobhana Mostary made 27 off 30 and Nahida Akter ended with an unbeaten 15* off 11. The innings ended with Bangladesh 113/6. Veteran Marizanne Kapp was the pick of the South African bowlers with 2/17. Ayabonga Khaka took 2/21. Nonkululeko Mlaba, who opens the bowling managed 1/21 and pacer Shabnim Ismail took 1/22. ALSO READ: Women’s T20 World Cup: Watch from the grass or couch South Africa takes things slow The Proteas got off to a nervy start with successful reviews, missed fielding, and desperate shots. The openers managed to put on a 100-run partnership, only the second one of 50 plus for the team this Women’s T20 World Cup. Both openers made unbeaten half-centuries with Laura Wolvaardt top-scoring with 66* off 56. Tamzin Brits joined her with 50* off 51. Bangladesh’s bowlers created chances but the team failed to take them. Missed stumpings and dropped catches saw them go wicketless. ALSO READ: The Proteas fate back in their own hands thanks to White Ferns win The business end of the Women’s T20 World Cup Australia faces India on Thursday, 23 February in Cape Town at 15:00 for the first semi-final. The Proteas take on an inform England on Friday, 24 February at 15:00 also in Cape Town. The final will be played on Sunday, 26 February. CLICK HERE TO READ MORE ARTICLES BY ZAREENA GAIBEE","pubDate":"2023-02-21 20:24:51","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"19 पारियां, 9 सिंगल डिजिट स्कोर... आकाश चोपड़ा का ऐसा है इंटरनेशनल क्रिकेट करियर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/aakash-chopra-flop-record-in-international-cricket-great-in-domestic/articleshow/98136354.cms","keywords":null,"creator":null,"video_url":null,"description":"Aakash Chopra: आकाश चोपड़ा घरेलू क्रिकेट के दिग्गज खिलाड़ी थे लेकिन इंटरनेशनल क्रिकेट में उनका रिकॉर्ड कैसा है। 2003 में उन्हें न्यूजीलैंड के खिलाफ भारत के लिए टेस्ट डेब्यू करने का मौका मिला था। 2004 में उन्होंने अपना आखिरी मैच खेला। हम आपको बताते हैं कि टेस्ट क्रिकेट में उन्होंने क्या किया।","content":"भारतीय टीम के सलामी बल्लेबाज केएल राहुल (KL Rahul) लगातार खराब फॉर्म में चल रहे हैं। उन्हें लेकर सोशल मीडिया पर खूब हल्ला हो रहा है। लोग दो भागों में बंट गए हैं। कुछ राहुल को अभी और मौके देना चाहते हैं तो कुछ उन्हें बाहर करने के पक्ष में हैं। पूर्व भारतीय ओपनर आकाश चोपड़ा (Aakash Chopra) केएल राहुल के पक्ष में हैं। वह राहुल पर सवाल उठाने वाले दिग्गज तेज गेंदबाज वेकटेंश प्रसाद (Venkatesh Prasad) से सोशल मीडिया पर भिड़ गए। केएल राहुल के साथ खड़े आकाश चोपड़ा भी भारत के लिए टेस्ट मैच खेल चुके हैं। अभी वह क्रिकेट कमेंटेटर और यूट्यूबर हैं। 45 साल के आकाश चोपड़ा ने अक्टूबर 2003 में भारत के लिए टेस्ट डेब्यू किया था। अहमदाबाद में न्यूजीलैंड के खिलाफ उस मुकाबले में उन्होंने 42 और 31 रनों की पारियां खेली थीं। उसी सीरीज के दूसरे मुकाबले में उन्होंने 60 और 52 रन बनाए। साल के अंत में बॉर्डर गावस्कर सीरीज खेलने टीम इंडिया ऑस्ट्रेलिया गई और आकाश चोपड़ा को उस टीम में चुना गया। बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) में उन्हें चारों टेस्ट खेलने का मौका मिला। 8 पारियों में उनके बल्ले से 23.25 की औसत से 186 रन निकले। बिना किसी फिफ्टी या सेंचुरी के। उस सीरीज में भारत के अन्य प्रमुख बल्लेबाजों में राहुल द्रविड़ ने 619, वीवीएस लक्ष्मण ने 494, वीरेंद्र सहवाग ने 464, सचिन तेंदुलकर ने 383 और सौरव गांगुली ने 284 रन बनाए थे। सचिन और लक्ष्मण ने 7-7 जबकि गांगुली ने तो 6 ही पारियों में ही बल्लेबाजी की थी। 2004 में टीम इंडिया ऐतिहासिक टेस्ट सीरीज खेलने पाकिस्तान गई। वहां आकाश चोपड़ा को दो टेस्ट में मौका मिला और वह फेल रहे। तीसरे में वह प्लेइंग इलेवन का हिस्सा नहीं थे। 2004 में ऑस्ट्रेलिया भारत आया तो भी उन्हें दो मैचों में मौका मिला। इन दोनों मैचों में वह दहाई के आंकड़े तक भी नहीं पहुंच पाए। उसके बाद उन्हें कभी टीम इंडिया के लिए खेलने का मौका नहीं मिला। 10 मैचों के टेस्ट करियर में आकाश चोपड़ा ने 19 पारियां खेलीं। उनके नाम 23 की औसत से 437 रन हैं। 9 बार तो वह दहाई के आंकड़ों को भी नहीं छू पाए। 2004 में ही भारत के लिए गौतम गंभीर ने टेस्ट डेब्यू किया। इसके वीरेंद्र सहवाग परमानेंट ओपनर थे ही। इसके अलावा वसीम जाफर भी खेल रहे थे। यही वजह है कि घरेलू क्रिकेट में अच्छा प्रदर्शन करने के बाद भी आकाश चोपड़ा भारत के लिए दोबारा टेस्ट क्रिकेट नहीं खेल पाए। आकाश चोपड़ा भले ही इंटरनेशनल क्रिकेट में कमाल नहीं कर पाए लेकिन घरेलू क्रिकेट में उनका रिकॉर्ड बेहतरीन है। उन्होंने दिल्ली, हिमाचल प्रदेश और राजस्थान के लिए मुकाबले खेले। 162 फर्स्ट क्लास मैच में उन्होंने 45.35 की औसत से 10839 रन बनाए हैं। इसमें 29 शतक के साथ ही 53 फिफ्टी भी हैं। उनके नाम तिहरा शतक भी दर्ज है। घरेलू क्रिकेट में इसी दमदार रिकॉर्ड की वजह से उन्हें इंटरनेशनल मैचों में मौका मिला। लेकिन आकाश चोपड़ा वहां अपनी क्षमता के अनुसार खेल नहीं दिखा पाए।","pubDate":"2023-02-22 03:04:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"मुरलीधरन का भी गुरु... बल्लेबाजों का सबसे बड़ा काल, चटकाए एक या दो नहीं चार हजार से ज्यादा विकेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/wilfred-rhodes-took-most-wickets-in-first-class-cricket-4204-wickets/articleshow/98135867.cms","keywords":null,"creator":null,"video_url":null,"description":"Wilfred Rhodes Wickets: क्रिकेट में कई ऐसे रिकॉर्ड हैं जिसका टूटना लगभग नामुमकिन है। ऐसा ही एक रिकॉर्ड है सबसे ज्यादा विकेट लेने का। श्रीलंका मुथैया मुरलीधरन के नाम टेस्ट में 800 विकेट हैं। लेकिन इंग्लैंड के दिग्गज गेंदबाज ने 4000 से ज्यादा बल्लेबाजों को पवेलियन की राह दिलाई है।","content":"श्रीलंका के ऑफ स्पिनर मुथैया मुरलीधरन का नाम हम सभी को पता है। मुरली टेस्ट क्रिकेट में सबसे ज्यादा 800 विकेट लेने वाले गेंदबाज हैं। वनडे में भी उनके नाम सबसे ज्यादा विकेट हैं। लेकिन मैं अगर आपको कहूं कि फर्स्ट क्लास क्रिकेट में मुरली विकेट लेने के मामले में दूर-दूर तक नहीं है तो क्या आप भरोसा करेंगे। आप ये भी जानना चाहेंगे कि फिर फर्स्ट क्लास क्रिकेट में स सबसे ज्यादा विकेट हैं किसके नाम। तो हम आपको बताते हैं कि यह रिकॉर्ड किसके नाम है। इंग्लैंड के विल्फ्रेड रोड्स के नाम फर्स्ट क्लास क्रिकेट में सबसे ज्यादा विकेट हैं। अब क्या आप अनुमान लगा सकते हैं कि उन्होंने कितने विकेट चटकाए होंगे। उनके विकेट की संख्या मुरलीधरन के टेस्ट विकेट से 5 गुणा से भी ज्यादा है। बाएं हाथ के स्पिन ऑलराउंडर विल्फ्रेड रोड्स के नाम 1110 मैच में 4204 विकेट हैं। वह चार हजार से ज्यादा विकेट लेने वाले एकमात्र गेंदबाज हैं। ये विकेट उन्हें 16.72 की औसत और 44.1 की स्ट्राइक रेट से मिले। 287 बार उन्होंने पारी में 5 विकेट और 68 बार मैच में 10 विकेट लिये। उनके नाम सबसे ज्यादा फर्स्ट क्लास मैच खेलने का भी रिकॉर्ड है। 1898 से 1930 के बीच रोड्स ने यॉर्कशायर के लिए क्रिकेट खेला था। गेंदबाज के साथ ही वह बेहतरीन बल्लेबाज भी थे। 1877 में जन्मे विल्फ्रेड रोड्स ने 1899 और 1930 के बीच इंग्लैंड के लिए 58 टेस्ट मैच खेले। टेस्ट में रोड्स ने 127 विकेट लिए और 2,325 रन बनाए। वह टेस्ट मैचों में 1,000 रन और 100 विकेट का दोहरा पूरा करने वाले पहले अंग्रेज थे। 1930 में जब उन्होंने अपना आखिरी टेस्ट खेला तो उनकी उम्र 52 साल और 165 दिन थी। वह टेस्ट मैच खेलने वाले सबसे उम्रदराज खिलाड़ी भी हैं। 1110 मैचों में विल्फ्रेड रोड्स के नाम 30.81 की औसत से 39969 रन भी हैं। उन्होंने 58 शतक और 197 फिफ्टी लगाई है। उनका सबसे बड़ा स्कोर 267 रन है। वह फर्स्ट क्लास क्रिकेट में 199 शतक बनाने वाले जैक हॉब्स के साथ पारी की शुरुआत भी करते थे। 2009 में रोड्स को आईसीसी क्रिकेट हॉल ऑफ फेम में शामिल किया गया था।","pubDate":"2023-02-22 01:56:34","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK के लिए आईपीएल 2023 से पहले बड़ी खुशखबरी, मैच विनर खिलाड़ी हुआ पूरी तरह फिट","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/deepak-chahar-fully-fit-to-play-in-ipl-2023-for-chennai-super-kings/articleshow/98135698.cms","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings: महेंद्र सिंह धोनी की कप्तानी वाली चेन्नई सुपर किंग्स को आईपीएल 2023 से पहले बड़ी खुशखबरी आई है। टीम 31 मार्च को गुजरात के खिलाफ सीजन का पहला मैच खेलेगी। इससे पहले टीम के मैच विनर खिलाड़ी ने घोषणा कर दी है कि वह पूरी तरह फिट है।","content":"पिछले साल दो बड़ी चोटों से जूझने के बाद भारतीय तेज गेंदबाज दीपक चाहर ( ) ने कहा है कि वह पूरी तरह से फिट हैं। 31 मार्च से शुरू हो रहे इंडियन प्रीमियर लीग से वापसी करने को तैयार हैं। तीस साल तेज गेंदबाज को स्ट्रेस फ्रैक्चर और फिर जांघ की तीसरे ग्रेड की चोट से उबरने में काफी मुश्किल हुई। वह पिछली बार भारत की ओर से बांग्लादेश में दूसरे वनडे में खेले थे जहां वह सिर्फ तीन ओवर गेंदबाजी कर पाए थे। वर्ष 2022 में चाहर भारत के लिए केवल 15 मैच ही खेल सके थे और चोट के कारण टी20 विश्व कप से भी बाहर हो गए थे। राष्ट्रीय क्रिकेट अकादमी (एनसीए) में रिहैबिलिटेशन के बाद चाहर आईपीएल की तैयारी कर रहे हैं जहां वह चेन्नई सुपर किंग्स का प्रतिनिधित्व करेंगे। चाहर ने कहा, ‘मैं अपनी फिटनेस पर पिछले दो-तीन महीनों से कड़ी मेहनत कर रहा हूं, मैं पूरी तरह से फिट हूं और आईपीएल के लिए अच्छी तैयारी कर रहा हूं।’ उन्होंने कहा, ‘मुझे दो बड़ी चोट लगी थीं। एक स्ट्रेस फ्रैक्चर था और एक जांघ की तीसरे ग्रेड की चोट। दोनों बहुत बड़ी चोट हैं। आप महीनों के लिए बाहर हो जाते हैं। चोट के बाद वापसी करते हुए समय लगता है, खासकर तेज गेंदबाजों को। अगर मैं एक बल्लेबाज होता तो मैं लंबे समय तक खेलता लेकिन एक तेज गेंदबाज के रूप में जब आपको स्ट्रेस फ्रैक्चर होता है, तो वापसी करना बहुत कठिन होता है। आप अन्य गेंदबाजों को भी पीठ या कमर की चोट को लेकर संघर्ष करते हुए देख सकते हैं।’ राजस्थान के तेज गेंदबाज ने पिछले महीने सेना के खिलाफ प्रथम श्रेणी मैच के साथ प्रतिस्पर्धी क्रिकेट में वापसी की थी लेकिन यह उनका एकमात्र रणजी ट्रॉफी मैच था। चोटों के कारण संभावित खिलाड़ियों की सूची में नीचे खिसकने वाले चाहर को इस साल के अंत में स्वदेश में एकदिवसीय विश्व कप के लिए भारतीय टीम का हिस्सा बनने की उम्मीद हैं। उन्होंने कहा, ‘मैं अपने पूरे जीवन में एक नियम से जिया हूं। अगर मैं पूरी तरह से अपनी इच्छानुसार गेंदबाजी कर रहा हूं, अगर मैं अपनी इच्छानुसार बल्लेबाजी कर रहा हूं, तो मुझे कोई रोक नहीं सकता है। यही वह मूल नियम था जिसके साथ मैंने अपने करियर की शुरुआत की थी।'","pubDate":"2023-02-22 01:16:56","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दो हार से तिलमिला उठा ऑस्ट्रेलिया का पूर्व दिग्गज, अपने ही कप्तान को सुना दी खरी खोटी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/allan-border-raised-questions-on-captaincy-of-pat-cummins/articleshow/98135582.cms","keywords":null,"creator":null,"video_url":null,"description":"Border Gavaskar Trophy:ऑस्ट्रेलिया को बॉर्डर गावस्कर सीरीज में भारत के खिलाफ लगातार दो हार मिल गई है। नागपुर और फिर दिल्ली में हुए टेस्ट को भारतीय टीम ने अपने नाम किया। इस हार के बाद ऑस्ट्रेलिया के पूर्व कप्तान और दिग्गज खिलाड़ी ने अपने ही कप्तान पैट कमिंस पर ही सवाल उठा दिये हैं।","content":"दिग्गज क्रिकेटर एलन बॉर्डर का मानना है कि पैट कमिंस के पास चिंता करने के लिए काफी कुछ है। क्योंकि भारत के खिलाफ सीरीज ‘कप्तान के रूप में उनकी पहली असली परीक्षा’ थी और इस प्रक्रिया में दिल्ली में दूसरे टेस्ट में उन्होंने स्वयं से काफी कम गेंदबाजी कराई। ऑस्ट्रेलिया ने नागपुर और दिल्ली में शुरुआती दो टेस्ट हारने के बाद बॉर्डर-गावस्कर ट्रॉफी जीतने का मौका गंवा दिया है। भारत दौरे पर आने से पहले कप्तान के रूप में सिर्फ एक मैच में शिकस्त झेलने वाले कमिंस दिल्ली में छह विकेट की हार के दौरान ऑस्ट्रेलियाई अंतिम एकादश में एकमात्र तेज गेंदबाज थे। उन्होंने पहली पारी में सिर्फ 13 ओवर फेंके और भारत की दूसरी पारी में बिल्कुल भी गेंदबाजी नहीं की। एलन बॉर्डर ने ‘एसईएन रेडियो’ से कहा, ‘मुझे लगता है कि पैट ने उस टेस्ट मैच में खुद से बहुत कम गेंदबाजी कराई। ऐसे मौके थे जब हम भटकने लगे थे, खासकर भारत की पहली पारी में जब हमने उन्हें एक अच्छी साझेदारी बनाने का मौका दिया। उस समय अगर वह दो या तीन ओवर आक्रामक गेंदबाजी करता तो...’’ ऑस्ट्रेलिया ने भारत का स्कोर सात विकेट पर 139 रन कर दिया था लेकिन अक्षर पटेल और रविचंद्रन अश्विन ने 114 रन की साझेदारी की जिससे मेजबान टीम ने अपने स्कोर को मेहमान टीम के स्कोर से एक रन कम तक पहुंचा दिया। उन्होंने कहा, ‘मुझे लगता है कि मैदान पर अन्य लोग हैं जो कप्तान के पास जा सकते हैं और कह सकते हैं, ‘दोस्त, आप गेंदबाजी क्यों नहीं करते?‘ बॉर्डर ने कहा, ‘लेकिन मुझे लगता है कि एक कप्तान के रूप में पैट की यह पहली वास्तविक परीक्षा है, बाकी सब आसान रहा है, आप उपमहाद्वीप में जाते हैं और अचानक हर विभाग में आपकी परीक्षा होती है।’ उन्होंने कहा, ‘वह बहुत सी अलग-अलग चीजों को लेकर चिंतित है, मुझे लगता है कि वह खुद से गेंदबाजी कराना भूल गया। जब आपका प्रमुख तेज गेंदबाज आपका कप्तान हो तो ऐसा हो सकता है।’ पूर्व विकेटकीपर इयान हीली ने महसूस किया कि कमिंस ने दूसरी पारी में ‘मानसिक शक्ति’ खो दी जिससे दूसरी पारी में सही क्षेत्ररक्षण नहीं लगा पाए। हीली ने कहा, ‘फिर मानसिक तनाव जिसके कारण वह सही क्षेत्ररक्षण नहीं लगा पाया।’ उन्होंने कहा, ‘बल्ले के चारों तरफ कैच लेने वाले अधिक क्षेत्ररक्षक लगाने के बजाय उसने बाउंड्री पर क्षेत्ररक्षक लगाए थे। इसके (गेंदबाजी में बदलाव) बारे में सोचने के लिए दिमाग की बहुत शक्ति की जरूरत होती है।’","pubDate":"2023-02-22 01:01:03","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad- Report","link":"https://www.thetimesofbengal.com/sports/prime-minister-narendra-modi-and-australian-pm-anthony-albanese-to-attend-india-vs-australia-4th-test-in-ahmedabad-report/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad- Report The fourth Test is scheduled to be held at Ahmedabad from March 9-13. Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad. (Image: Twitter) New […]","content":"New Delhi: Australian Prime Minister Anthony Albanese is set to make his maiden trip to India early next month with an aim to boost overall bilateral engagement in a range of areas, including trade, investment and critical minerals. People familiar with the plan for his visit said on Monday that Albanese is expected to begin the visit around March 8 and he and Prime Minister Narerndra Modi are likely to travel to Ahmedabad to witness the fourth cricket Test match between India and Australia. The fourth Test is scheduled to be held at Ahmedabad from March 9-13. It will be Albanese’s first visit to India after he became prime minister in May last year. External Affairs Minister S Jaishankar visited Australia last week ostensibly to prepare for the visit to India by the Australian prime minister. There is no official announcement of the visit yet. However, Albanese mentioned about his visit to India in a tweet after meeting Mr Jaishankar on Saturday. “It was wonderful to meet with @DrSJaishankar his morning ahead of my trip to India next month. We discussed our strategic partnership, economic opportunities and the people-to-people ties that enrich our nations,” he tweeted. The people said expansion of cooperation in the Indo-Pacific in the backdrop of China’s growing military muscle-flexing in the region is expected to figure in the talks during the Australian prime minister’s visit to India. They said boosting trade, investment and critical minerals will figure high on the agenda of talks between Prime Minister Modi and Albanese. The ties between India and Australia have been on an upswing in the last few years. The India-Australia Economic Cooperation and Trade Agreement (ECTA) came into force in December and it is expected to facilitate significant expansion of two-way trade. Defence and security ties between India and Australia have been on an upswing in the last few years. In June 2020, India and Australia elevated their ties to a comprehensive strategic partnership and signed a landmark deal for reciprocal access to military bases for logistics support. The Mutual Logistics Support Agreement (MLSA) allows the militaries of the two countries to use each other’s bases for repair and replenishment of supplies, besides facilitating scaling up of overall defence cooperation. In August last year, four Sukhoi-30 MKI fighter jets and two C-17 heavy-lift aircraft of the Indian Air Force joined a 17-nation air combat exercise in Australia. Over 100 aircraft and 2,500 personnel from Australia, Canada, France, Germany, Indonesia, India, Japan, Malaysia, the Netherlands, New Zealand, the Philippines, Republic of Korea, the UAE, Singapore, Thailand, the US and the UK participated in the exercise in Australia’s Northern Territory. Australia is set to host the Malabar naval exercise later this year. It will involve the navies of India, Australia, Japan and the US. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-22 00:31:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Super sub: Who could be your AFL team’s swingman in 2023?","link":"https://www.brisbanetimes.com.au/sport/afl/super-sub-who-could-be-your-afl-team-s-swingman-in-2023-20230221-p5cm4w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"The super sub is back, with clubs drilling into their lists to determine who would be the best fit to cover for injury, while also potentially having the ability to be a late match winner. We look at each club’s potential candidates.","content":"The back-to-the-future AFL ruling that will allow coaches to activate a substitute at any time of a game in 2023 has clubs dissecting who best should fill the role. Having had four men on the bench plus a medical substitute over the past two years, the AFL has this season ditched the medical sub – as it became , in part, too hard to monitor – in favour of a “super sub”. Who will be your club’s super sub in 2023? Credit: Pat Scala/Jamie Brown It was through 2011-15 that there were three men on the bench plus a substitute – the latter able to be activated at any point for any reason in the game. Game plans, the strength and health of a list, and opposition tactics will have a bearing on who is the 23rd man. Ahead of the practice match campaign officially beginning on Thursday , Demons head of football Alan Richardson said clubs had to weigh up several factors when determining their sub. “You wouldn’t want to enact it too early in a game just in case you get an injury. It’s probably going to be something after half-time I reckon, then it can depend,” Richardson said. “It will be a combination for us of how the team is going in a certain area, or do we potentially want to bring someone in that might bolster an area for us? It might be a combination, along with what the opposition are doing. What have the opposition got, and what are we going in fearing, and what do we need to control? Is there someone that can exploit something, or control something? “That is sort of where we are at. It will be good in these couple of games to look at it.” Speed in the game, or injecting a tough-nut extractor, are likely to be the primary weapons considered, according to most clubs, but other club chiefs have wondered whether a fresh marking tall, or even a ruck, could be activated. Adelaide Shane McAdam , who has had an injury-impacted pre-season, can play as a high half-forward and take a strong mark. And veteran Matt Crouch , after an indifferent 2022 when he managed only 11 games, could provide midfield class and experience with the contest on the line. Brisbane Lions The versatile Callum Ah Chee was used as the substitute several times last season. Irishman Conor McKenna , back in the AFL fold, has the speed to burn tiring opponents across half-back and further afield. Carlton Jack Silvagni may be squeezed from the Blues’ best 22 this season, but his versatility – as a forward, reserve ruckman and even midfielder – makes him an ideal 23rd man. Draftee Oliver Hollands and Josh Honey can provide run and carry. Matthew Cottrell was injected four times as the sub last season. Could Jack Silvagni be the Blues’ ideal super sub, or will Michael Voss prefer an injection of speed in 2023? Credit: Getty Images Collingwood Will Hoskin-Elliott faces a fight to be in the Magpies’ best 22, but his run off the bench would be more than handy. Finlay Macrae , who may struggle to break into a blue-chip midfield, could also do the job. Essendon Big-bodied former Carlton midfielder Will Setterfield shapes as an ideal fit off the bench, while Ben Hobbs , on the mend from a calf strain, can head into the midfield or forward line and influence a game. Loading Fremantle High-pressure small forward Bailey Banfield is an ideal fit, having been regularly used as the sub last season, including in both finals. If Banfield forces his way into the starting 22, speedster Liam Henry could do the role. Geelong Versatile Irishman Mark O’Connor , who replaced an injured Max Holmes in the premiership 22 last year, is an ideal fit. Talented recruits Tanner Bruhn , Ollie Henry and Jack Bowes face a squeeze to make the Cats’ best 22, but could easily start as the spare man. Versatile Geelong utility Mark O’Connor in action. Credit: Getty Images Gold Coast Brayden Fiorini has the speed to trouble opponents off the bench, while defender Sean Lemmons and Rory Atkins , the latter used as a sub last year, are also options. Greater Western Sydney Toby Bedford will hope to avoid the role, as the former Demon started several games as the medical sub last season. Fellow small forward Brent Daniels could be an ideal fit, while Jacob Wehr and Callum Brown provide versatility. Loading Hawthorn The Hawks will have a new-look midfield this season. Finn Maginness , a tagger last season, may be squeezed out of the 22 if the Hawks look to attack early in games. Lachlan Bramble has the versatility. Melbourne Premiership defender Jake Bowey fell out of the starting rotation last year. Buoyed by a strong pre-season, he could provide run off the bench. Tom Sparrow , fighting for a midfield spot, is another option. After a short-lived retirement, former Hawthorn forward Liam Shiels could be a valuable swingman at his new club, North Melbourne. Credit: Getty Images North Melbourne Alastair Clarkson trusts his former Hawthorn mates, so having either veterans Liam Shiels or Daniel Howe off the bench, particularly early in the season, makes sense. Is Jaidyn Stephenson , used at half-back and half-forward in last weekend’s intra-club clash, an option? Port Adelaide Xavier Duursma , seeking to revive his career, and midfielder Sam Powell-Pepper are strong options, while youngster Jase Burgyone , with eight games last season, is also a possibility. Richmond Jason Castagna was used as a substitute last year, and his run through high half-forward and ability to hit the scoreboard could be important for the Tigers. Hugo Ralphsmith is versatile and can provide rebound from half-back, while also going to a wing. Jack Ross is another option. Will the Tigers again turn to Jason Castagna to spend time as a substitute this season? Credit: Getty Images St Kilda Former Blue Liam Stocker is seen as a burst player who could have an impact at half-back and through the midfield. Nick Coffield , once fully fit, and Hunter Clark are also options. Loading Sydney Emerging half-back Braeden Campbell can provide run and carry and push into the midfield. Joel Amartey , Hayden McLean and Sam Wicks can also provide punch off the bench. West Coast Former hard-running Demon Jayden Hunt shapes as an ideal fit to help turn a game after half-time, while veteran Jamie Cripps can deliver up forward. Versatile defenders Josh Rotham and Jamaine Jones and midfielder Greg Clark were used in the role last season. Western Bulldogs Jason Johannisen is an ideal fit, for he has pace, and can play multiple roles, but is likely to be in the best 22. Anthony Scott can go into the midfield or forward, while Hayden Crozier and Riley Garcia can deliver in bursts. Veteran half-forward Mitch Hannan could be a calming hand. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Carlton Blues Collingwood Magpies Essendon Bombers Hawthorn Hawks More… Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-02-22 00:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Why Dewald Brevis Will Be The Man To Watch Out In Mumbai Indians Camp","link":"https://www.thetimesofbengal.com/sports/why-dewald-brevis-will-be-the-man-to-watch-out-in-mumbai-indians-camp/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Why Dewald Brevis Will Be The Man To Watch Out In Mumbai Indians Camp IPL legend AB De Villiers compares Brevis to Surya Kumar Yadav and picks the young South African to shine in the white-ball format. Dewald Brevis turned out for MI Cape Town in the recently-concluded SA20. (Photo: BCCI) […]","content":"New Delhi: The 2023 edition of the Indian Premier League is upon us and cricket pundits have started picking the players who are likely to shine in the world’s biggest T20 league. South African teenager Dewald Brevis is expected to turn heads, believes former IPL superstar AB De Villiers . This will be Dewald Brevis’ second season in IPL. In 2022, Mumbai Indians picked the highly-rated South African all-rounder for Rs 3 crores. Five-time IPL champions Mumbai Indians are in rebuilding mode and Brevis will surely be among the core players who can help MI regain their glorious days. Brevis is nicknamed as ‘Baby AB’. He has shown the versatility in stroke-making and bats in the middle-order, a position where De Villiers, under pressure, excelled in both building an innings and shifting gears while chasing. It is not for nothing that De Villiers is backing Brevis to shine in IPL 2023. Brevis has just played for MI Cape Town in the SA20. He ran hot and cold with the bat. An unbeaten 70 off 41 balls helped MI Cape Town beat Davis Miller-led Paarl Royals by eight wickets. Brevis had two more scores in the 40s, opening the batting. When IPL starts on March 31, Brevis is expected to match ready when Mumbai Indians play their first match against Royal Challengers Bangalore on April 2 at Bangalore’s Chinnaswamy Stadium. While he will certainly be an opening option, MI may want him to bat in the middle order where Surya Kumar Yadav will be a mainstay. Dewald Brevis will be 20 when IPL will be at the mid-way stage. He is at that stage of his career where he can only learn and learn. And what better to be in a team where there are seasoned players like Rohit Sharma, Surya Kumar Yadav and Cameron Green. AB De Villers feels Brevis has shades of Yadav in his game. Yadav, nicknamed SKY, has rocked white-ball cricket with his range of strokes and power-hitting. He says: “There are certainly similarities in the way that they approach the game. They’re both really aggressive, they want to take the bowlers on and they don’t let the bowlers settle. “Dewald is obviously a lot younger and has still got a lot to learn, whereas SKY is experienced these days. He come a long way having performed well for the Mumbai Indians at the IPL. But they both excite me a lot.” Dewald Brevis has the potential to fill De Villiers’ shoes for South Africa, a team that has lost a lot of punch and flair at the world stage. At least, the numbers indicate Brevis has the promise to do so. MI spotted him after the South African captain became the highest run-getter in the ICC Under-19 World Cup 2021-22. In six matches, Brevis amassed 506 runs, including two hundreds and three fifties. With a strike-rate of 90-plus, Brevis was simply outstanding. Brevis has more big numbers to back his talent. He was the youngest South African at 19 years 185 days to slam a men’s T20 century. By slamming 162, Brevis is the highest T20 scorer in South African cricket. Only Chris Gayle (175 not out) and Aaron Finch (172) are ahead of Brevis. Season 2023 will be one of redemption for Mumbai Indians. Having finished last in 2022 among 10 teams, MI will look to claw back. Brevis will be part of the plans and he will get a lot of ‘home’ support from former South African stumper and coach, Mark Boucher, the new Mumbai Indians boss. In his maiden season with MI, Brevis scored 161 runs in seven matches at an average of 23. His strike-rate was a breezy 142.48 but that’s not enough. It’s time to produce the big numbers on Indian soil. And AB De Villiers will surely be watching. (Soumitra Bose is a senior journalist and research scholar. He tweets @soumitra65. Views are personal) $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-22 00:23:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Wolvaardt and Brits help Proteas secure semifinal spot in T20 World Cup","link":"https://www.dailymaverick.co.za/article/2023-02-21-wolvaardt-and-brits-help-proteas-secure-semifinal-spot-in-t20-world-cup/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Openers Tazmin Brits and Laura Wolvaardt struck a century partnership to help the Proteas to a 10-wicket victory over Bangladesh. They will now face England in the second semifinal on Friday. The post Wolvaardt and Brits help Proteas secure semifinal spot in T20 World Cup appeared first on Daily Maverick.","content":"A superb century stand by openers Laura Wolvaardt and Tazmin Brits helped the Proteas women to a comfortable 10-wicket win over Bangladesh on Tuesday. The victory means South Africa will face England in the semifinal of the T20 World Cup at Newlands on Friday. In what was essentially a quarterfinal clash for the Proteas, Wolvaardt struck a well-paced 66 off 56 deliveries while Brits held her own with an important 50 off 51 deliveries. Laura Wolvaardt of South Africa on her way to scoring 66 off 56 deliveries in the ICC Women’s T20 World Cup match between against Bangladesh at Newlands Cricket Ground in Cape Town on 21 February 2023. (Photo: Ashley Vlotman / Gallo Images) Wolvaardt’s confidence-boosting half-century contained seven fours and one magnificent six over mid-on. Bangladesh skipper Nigar Sultana won the toss and elected to bat first. The Proteas restricted them to 113 for six, but it wasn’t all easy going for the host nation, chasing 114 for victory. The opening pair struggled to pierce the gaps and rotate the strike in the first half of the innings, scoring only 43 in the first 10 overs. But the handbrake was released after that point, with South Africa thrashing 74 runs in the last 47 deliveries of their innings to secure their passage to the next round with 13 balls to spare. “An extra 20 to 30 runs would have made a big difference,” said Sultana after the match. It was a good return to form for Wolvaardt, whose previous highest score in the World Cup was 19 in South Africa’s last match against Australia. The victory, however, was once again set up by South Africa’s phenomenal bowlers. Ayabonga Khaka of South Africa picked up two wickets against Bangladesh. (Photo: Ashley Vlotman / Gallo Images) Only Nadine de Klerk and Chloe Tryon — who shared the load of the fifth bowler — went for more than six runs an over, while Marizanne Kapp registered magnificent figures of two wickets for 17 runs in her four overs. One of her wickets included that of skipper Sultana for 30 in the final over of the innings, just as she was getting going. Ayabonga Khaka also picked up two wickets as she and Kapp restricted the Bangladeshis masterfully at the end of the innings. Visit Daily Maverick’s home page for more news, analysis and investigations Left-arm orthodox Nonkululeko Mlaba once again opened the bowling alongside Shabnim Ismail and the pair kept things tight upfront while taking one wicket apiece. However, South Africa’s fielding left a lot to be desired as the batting heroines Wolvaardt and Brits dropped two sitters. There were several overthrows as well, which helped Bangladesh reach their below-par total. The Proteas will need to sharpen up in that department if they are to reach their first World Cup final. Just a few hours before South Africa’s victory, their semifinal opponents, England, dismantled Pakistan by 114 runs. England smashed their way to the highest Women’s T20 World Cup score of 213 for five before bowling Pakistan out for 99. India and Australia will face off in the first semifinal on Thursday. South Africa’s semifinal against England starts at 3pm on Friday. DM","pubDate":"2023-02-21 21:38:51","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Nat Sciver-Brunt, Wyatt, Jones break Women’s T20 World Cup record in win over Pakistan","link":"http://island.lk/nat-sciver-brunt-wyatt-jones-break-womens-t20-world-cup-record-in-win-over-pakistan/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"England smashed the highest ever women’s T20 World Cup total in a record 114 run thrashing of Pakistan in Newlands to complete an unbeaten group phase Brief scores: England 213 for 5 (Nat Sciver-Brunt 81*, Danni Wyatt 59, Fatima Sana 2-44) beat Pakistan 99 for 9 (Tuba Hassan 28, Katherine Sciver-Brunt 2-14) by 114 runs","content":"England Pakistan Published on By Asian Youth Championship medallist Nirmali Wickramasinghe of Wickramabahu Central, Gampola is among dozens of leading youth athletes vying to achieve qualifying standards for the next edition of the Asian event which will be held in Uzbekistan. The final selection trial to pick Sri Lanka’s team for the Asian event will be held today and tomorrow at Diyagama. Despite a marked drop in performance standards at the last Asian Youth Championships, Sri Lanka Athletics has set tough qualifying standards to select the team for the next edition . While setting up tough entry standard even for the trial meet, the Athletics officials have raised the qualifying standards in some events. The qualifying standard for the boys’ 1500 metres is set at four minutes despite even the gold medal of the last meet being decided in a time of 4:04.59 minutes. In the corresponding girls event too the qualifying standard is 4:48.00 minutes. The gold medal of the last championship was decided in 4:51.61 minutes. Wickramasinghe who won the silver medal of the girls’ 800 metres at the Asian Youth Championship in Kuwait last year has run the 1500m below the qualifying standard and will be among dozen others eager to excell at the two-day meet. In the 400 metres, the event where Sri Lanka won two medals last year, the qualifying standard is 48.80 seconds for boys while it is 56.50 for girls. Women’s 3,000m, Men’s 3,000m, Women’s 200m Heats, Men’s 200m Heats, Women’s 400m Hurdles, Men’s 400m Hurdles, Men’s high jump, Women’s Long Jump, Women’s 800m, Men’s 800m, Women’s 100m hurdles, Men’s 110m hurdles, Men’s triple jump, Men’s pole vault, Women’s 200m, Men’s 200m. Published on By Dinara de Silva, Sandas Usgodaarachchi and Methwan Wijemanne registered victories in their respective singles matches of the Junior Davis Cup and Junior Billie Jean King Cup tournament matches played at the Sri Lanka Tennis Association courts on Monday. Methwan Wijemanne Published on By It started with a sensational win over South Africa in the tournament opener and ended with a whimper as they were dismissed for their third-lowest total in T20Is. It’s fair to say Sri Lanka came, saw, conquered and then crashed out. For Chamari Athapaththu, it’s not a calamity. “The world has not ended. The sun will come up tomorrow. I want to build a good team for the future. Today the feeling is not good but my focus is the next tour,” she said, still smiling, afterwards. That Athapaththu can even talk about the next tour is a win for Sri Lanka. They went without fixtures between March 2020 and January 2022 and know what the effects of a prolonged absence from the game can do for a team’s momentum. Now, thanks to the first ever women’s FTP, they have visits from Bangladesh (which did not take place prior to the World Cup as initially scheduled) and New Zealand to look forward to, as well as a tour of England later this year. “The youngsters need some experience. They need to play more cricket in future,” Chamari said. “We have to play a lot of cricket against the top four teams.” Chamari’s youngsters include under-19 captain Vishmi Gunaratne, who is only 16, offspinner Kavisha Dilhari, who has 10 more T20I caps to her name than her age of 22, and her opening partner, 24-year-old Harshitha Samarawickrama. All of them were excited about the prospect of reaching the semi-finals and anxious about beating New Zealand after losing to Australia, even if that result had been somewhat priced in. “I’m not worried about the Australia games but I’m a little bit worried about today’s game,” she said. “It was a very crucial game for us and I felt some of the girls in my team put too much pressure on their shoulders. I think they didn’t handle that pressure very well.” Sri Lanka’s nerves showed almost immediately. They missed a run-out chance that would have seen Bernadine Bezuidenhout dismissed for 7 and then dropped her on 19. She went on to score 32 and share in a 46-run opening stand with Suzie Bates that set up New Zealand’s innings. They also dropped Bates, on 37, as her 56 off 49 balls propelled New Zealand to a score above 160. In response, Sri Lanka were completely shell-shocked. They played their big shots too early and picked out fielders and once Athapaththu was dismissed, it became a procession as the last five wickets fell for 25 runs. Their opposition knows exactly what that feels like. It was less than a week ago that New Zealand were bundled out for 67 – the second-lowest T20I total – two days after Australia had dismissed them for 76 to all but end their hopes of qualifying for the semi-finals. They were particularly distressed after their 65-run defeat to South Africa – a match that had the weight of a quarter-final attached to it – and captain Sophie Devine emphasised the need to figure out and discuss where things were going wrong. Athapaththu may be tempted to do the same but Amelia Kerr, who was part of Devine’s team’s talks, had some advice. “When there is emotion involved, sometimes you don’t know what to say and it’s better to review it the next day.” When New Zealand did that, they came up with a mantra for their last two games: “be tougher when things get tough,” Kerr explained. “There was nothing wrong with the talent we have in this room, it was just to have that belief and be tough.” That may work for New Zealand, who have a fairly developed professional structure as opposed to Sri Lanka, whom FICA’s annual global employment report said had “not professional structures”, and both Athapaththu and Kerr acknowledged the gap is growing. Unsurprisingly, they both cited Australia as the benchmark and while Athapaththu zoned in on the domestic structure, Kerr looked at T20 franchise leagues that have made the difference. “Australia has a good domestic structure. They play a lot of cricket – domestic tournaments and schools tournaments,” Athapaththu said, while Kerr described the resources the Australian players have as “outstanding”. But they also pointed to the growing prowess of India as a signal to the rest to speed up their development. “In terms of what we are seeing around the world, with the Hundred in England, the WBBL in Australia and now the WPL, it’s going to strengthen those countries a lot,” Kerr said. “We are heading in the right direction: our match fees being equal to the men, and it allows us to earn more money so we can train more. Most of us do cricket full-time which is only going to help our game. We are behind those countries but if all countries can get that opportunity it is going to help grow the women’s game.” And for Athapaththu, that is especially significant for the other teams on the subcontinent, which could have just one representative – India – in the final four. “India has a good structure but in Pakistan, Sri Lanka and Bangladesh, we have to develop our structure,” she said. Because she wants to be part of that process, Athapaththu herself has committed to at least another T20 World Cup – the next tournament is in Bangladesh in September/October 2024 – and perhaps even another 50-over tournament. “I want to build a good team for Sri Lanka for the future, so that’s my goal,” she said. “I want to encourage the youngsters and be a role model. I always try to lead them from the front, so my target is playing another one or two years for Sri Lanka. That’s what I want to do.”","pubDate":"2023-02-21 20:51:43","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"South Africa beat Bangladesh to secure spot in World cup semi-finals","link":"https://www.thesouthafrican.com/sport/cricket/south-africa-beat-bangladesh-in-t20-womens-world-cup-semi-final-bound-21-february-2023/","keywords":["Cricket","Sport","bangladesh","Featured","ICC Women’s T20 World Cup","Important","Proteas"],"creator":["Zareena Gaibee"],"video_url":null,"description":"South Africa beat Bangladesh by 10 wickets, in Cape Town to secure their place in the semi finals of their home Women's T20 World Cup.","content":"South Africa beat Bangladesh by wickets 10, in Cape Town to secure its place in the semi-finals of the Women’s T20 World Cup. In the final pool game, Bangladesh won the toss and chose to bat first. South Africa beat Bangladesh ALSO READ: Proteas Wolvaardt embracing pressure of must-win Bangladesh set a target of 114 Bangladesh struggled to form partnerships with wickets falling regularly. Captain Nigar Sultana Joty top scored with 30 off 34 deliveries. Sobhana Mostary made 27 off 30 and Nahida Akter ended with an unbeaten 15* off 11. The innings ended with Bangladesh 113/6. Veteran Marizanne Kapp was the pick of the South African bowlers with 2/17. Ayabonga Khaka took 2/21. Nonkululeko Mlaba, who opens the bowling managed 1/21 and pacer Shabnim Ismail took 1/22. ALSO READ: Women’s T20 World Cup: Watch from the grass or couch South Africa takes things slow The Proteas got off to a nervy start with successful reviews, missed fielding, and desperate shots. The openers managed to put on a 100-run partnership, only the second one of 50 plus for the team this Women’s T20 World Cup. Both openers made unbeaten half-centuries with Laura Wolvaardt top-scoring with 66* off 56. Tamzin Brits joined her with 50* off 51. Bangladesh’s bowlers created chances but the team failed to take them. Missed stumpings and dropped catches saw them go wicketless. ALSO READ: The Proteas fate back in their own hands thanks to White Ferns win The business end of the Women’s T20 World Cup Australia faces India on Thursday, 23 February in Cape Town at 15:00 for the first semi-final. The Proteas take on an inform England on Friday, 24 February at 15:00 also in Cape Town. The final will be played on Sunday, 26 February. CLICK HERE TO READ MORE ARTICLES BY ZAREENA GAIBEE","pubDate":"2023-02-21 20:24:51","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"19 पारियां, 9 सिंगल डिजिट स्कोर... आकाश चोपड़ा का ऐसा है इंटरनेशनल क्रिकेट करियर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/aakash-chopra-flop-record-in-international-cricket-great-in-domestic/articleshow/98136354.cms","keywords":null,"creator":null,"video_url":null,"description":"Aakash Chopra: आकाश चोपड़ा घरेलू क्रिकेट के दिग्गज खिलाड़ी थे लेकिन इंटरनेशनल क्रिकेट में उनका रिकॉर्ड कैसा है। 2003 में उन्हें न्यूजीलैंड के खिलाफ भारत के लिए टेस्ट डेब्यू करने का मौका मिला था। 2004 में उन्होंने अपना आखिरी मैच खेला। हम आपको बताते हैं कि टेस्ट क्रिकेट में उन्होंने क्या किया।","content":"भारतीय टीम के सलामी बल्लेबाज केएल राहुल (KL Rahul) लगातार खराब फॉर्म में चल रहे हैं। उन्हें लेकर सोशल मीडिया पर खूब हल्ला हो रहा है। लोग दो भागों में बंट गए हैं। कुछ राहुल को अभी और मौके देना चाहते हैं तो कुछ उन्हें बाहर करने के पक्ष में हैं। पूर्व भारतीय ओपनर आकाश चोपड़ा (Aakash Chopra) केएल राहुल के पक्ष में हैं। वह राहुल पर सवाल उठाने वाले दिग्गज तेज गेंदबाज वेकटेंश प्रसाद (Venkatesh Prasad) से सोशल मीडिया पर भिड़ गए। केएल राहुल के साथ खड़े आकाश चोपड़ा भी भारत के लिए टेस्ट मैच खेल चुके हैं। अभी वह क्रिकेट कमेंटेटर और यूट्यूबर हैं। 45 साल के आकाश चोपड़ा ने अक्टूबर 2003 में भारत के लिए टेस्ट डेब्यू किया था। अहमदाबाद में न्यूजीलैंड के खिलाफ उस मुकाबले में उन्होंने 42 और 31 रनों की पारियां खेली थीं। उसी सीरीज के दूसरे मुकाबले में उन्होंने 60 और 52 रन बनाए। साल के अंत में बॉर्डर गावस्कर सीरीज खेलने टीम इंडिया ऑस्ट्रेलिया गई और आकाश चोपड़ा को उस टीम में चुना गया। बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) में उन्हें चारों टेस्ट खेलने का मौका मिला। 8 पारियों में उनके बल्ले से 23.25 की औसत से 186 रन निकले। बिना किसी फिफ्टी या सेंचुरी के। उस सीरीज में भारत के अन्य प्रमुख बल्लेबाजों में राहुल द्रविड़ ने 619, वीवीएस लक्ष्मण ने 494, वीरेंद्र सहवाग ने 464, सचिन तेंदुलकर ने 383 और सौरव गांगुली ने 284 रन बनाए थे। सचिन और लक्ष्मण ने 7-7 जबकि गांगुली ने तो 6 ही पारियों में ही बल्लेबाजी की थी। 2004 में टीम इंडिया ऐतिहासिक टेस्ट सीरीज खेलने पाकिस्तान गई। वहां आकाश चोपड़ा को दो टेस्ट में मौका मिला और वह फेल रहे। तीसरे में वह प्लेइंग इलेवन का हिस्सा नहीं थे। 2004 में ऑस्ट्रेलिया भारत आया तो भी उन्हें दो मैचों में मौका मिला। इन दोनों मैचों में वह दहाई के आंकड़े तक भी नहीं पहुंच पाए। उसके बाद उन्हें कभी टीम इंडिया के लिए खेलने का मौका नहीं मिला। 10 मैचों के टेस्ट करियर में आकाश चोपड़ा ने 19 पारियां खेलीं। उनके नाम 23 की औसत से 437 रन हैं। 9 बार तो वह दहाई के आंकड़ों को भी नहीं छू पाए। 2004 में ही भारत के लिए गौतम गंभीर ने टेस्ट डेब्यू किया। इसके वीरेंद्र सहवाग परमानेंट ओपनर थे ही। इसके अलावा वसीम जाफर भी खेल रहे थे। यही वजह है कि घरेलू क्रिकेट में अच्छा प्रदर्शन करने के बाद भी आकाश चोपड़ा भारत के लिए दोबारा टेस्ट क्रिकेट नहीं खेल पाए। आकाश चोपड़ा भले ही इंटरनेशनल क्रिकेट में कमाल नहीं कर पाए लेकिन घरेलू क्रिकेट में उनका रिकॉर्ड बेहतरीन है। उन्होंने दिल्ली, हिमाचल प्रदेश और राजस्थान के लिए मुकाबले खेले। 162 फर्स्ट क्लास मैच में उन्होंने 45.35 की औसत से 10839 रन बनाए हैं। इसमें 29 शतक के साथ ही 53 फिफ्टी भी हैं। उनके नाम तिहरा शतक भी दर्ज है। घरेलू क्रिकेट में इसी दमदार रिकॉर्ड की वजह से उन्हें इंटरनेशनल मैचों में मौका मिला। लेकिन आकाश चोपड़ा वहां अपनी क्षमता के अनुसार खेल नहीं दिखा पाए।","pubDate":"2023-02-22 03:04:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"मुरलीधरन का भी गुरु... बल्लेबाजों का सबसे बड़ा काल, चटकाए एक या दो नहीं चार हजार से ज्यादा विकेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/wilfred-rhodes-took-most-wickets-in-first-class-cricket-4204-wickets/articleshow/98135867.cms","keywords":null,"creator":null,"video_url":null,"description":"Wilfred Rhodes Wickets: क्रिकेट में कई ऐसे रिकॉर्ड हैं जिसका टूटना लगभग नामुमकिन है। ऐसा ही एक रिकॉर्ड है सबसे ज्यादा विकेट लेने का। श्रीलंका मुथैया मुरलीधरन के नाम टेस्ट में 800 विकेट हैं। लेकिन इंग्लैंड के दिग्गज गेंदबाज ने 4000 से ज्यादा बल्लेबाजों को पवेलियन की राह दिलाई है।","content":"श्रीलंका के ऑफ स्पिनर मुथैया मुरलीधरन का नाम हम सभी को पता है। मुरली टेस्ट क्रिकेट में सबसे ज्यादा 800 विकेट लेने वाले गेंदबाज हैं। वनडे में भी उनके नाम सबसे ज्यादा विकेट हैं। लेकिन मैं अगर आपको कहूं कि फर्स्ट क्लास क्रिकेट में मुरली विकेट लेने के मामले में दूर-दूर तक नहीं है तो क्या आप भरोसा करेंगे। आप ये भी जानना चाहेंगे कि फिर फर्स्ट क्लास क्रिकेट में स सबसे ज्यादा विकेट हैं किसके नाम। तो हम आपको बताते हैं कि यह रिकॉर्ड किसके नाम है। इंग्लैंड के विल्फ्रेड रोड्स के नाम फर्स्ट क्लास क्रिकेट में सबसे ज्यादा विकेट हैं। अब क्या आप अनुमान लगा सकते हैं कि उन्होंने कितने विकेट चटकाए होंगे। उनके विकेट की संख्या मुरलीधरन के टेस्ट विकेट से 5 गुणा से भी ज्यादा है। बाएं हाथ के स्पिन ऑलराउंडर विल्फ्रेड रोड्स के नाम 1110 मैच में 4204 विकेट हैं। वह चार हजार से ज्यादा विकेट लेने वाले एकमात्र गेंदबाज हैं। ये विकेट उन्हें 16.72 की औसत और 44.1 की स्ट्राइक रेट से मिले। 287 बार उन्होंने पारी में 5 विकेट और 68 बार मैच में 10 विकेट लिये। उनके नाम सबसे ज्यादा फर्स्ट क्लास मैच खेलने का भी रिकॉर्ड है। 1898 से 1930 के बीच रोड्स ने यॉर्कशायर के लिए क्रिकेट खेला था। गेंदबाज के साथ ही वह बेहतरीन बल्लेबाज भी थे। 1877 में जन्मे विल्फ्रेड रोड्स ने 1899 और 1930 के बीच इंग्लैंड के लिए 58 टेस्ट मैच खेले। टेस्ट में रोड्स ने 127 विकेट लिए और 2,325 रन बनाए। वह टेस्ट मैचों में 1,000 रन और 100 विकेट का दोहरा पूरा करने वाले पहले अंग्रेज थे। 1930 में जब उन्होंने अपना आखिरी टेस्ट खेला तो उनकी उम्र 52 साल और 165 दिन थी। वह टेस्ट मैच खेलने वाले सबसे उम्रदराज खिलाड़ी भी हैं। 1110 मैचों में विल्फ्रेड रोड्स के नाम 30.81 की औसत से 39969 रन भी हैं। उन्होंने 58 शतक और 197 फिफ्टी लगाई है। उनका सबसे बड़ा स्कोर 267 रन है। वह फर्स्ट क्लास क्रिकेट में 199 शतक बनाने वाले जैक हॉब्स के साथ पारी की शुरुआत भी करते थे। 2009 में रोड्स को आईसीसी क्रिकेट हॉल ऑफ फेम में शामिल किया गया था।","pubDate":"2023-02-22 01:56:34","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK के लिए आईपीएल 2023 से पहले बड़ी खुशखबरी, मैच विनर खिलाड़ी हुआ पूरी तरह फिट","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/deepak-chahar-fully-fit-to-play-in-ipl-2023-for-chennai-super-kings/articleshow/98135698.cms","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings: महेंद्र सिंह धोनी की कप्तानी वाली चेन्नई सुपर किंग्स को आईपीएल 2023 से पहले बड़ी खुशखबरी आई है। टीम 31 मार्च को गुजरात के खिलाफ सीजन का पहला मैच खेलेगी। इससे पहले टीम के मैच विनर खिलाड़ी ने घोषणा कर दी है कि वह पूरी तरह फिट है।","content":"पिछले साल दो बड़ी चोटों से जूझने के बाद भारतीय तेज गेंदबाज दीपक चाहर ( ) ने कहा है कि वह पूरी तरह से फिट हैं। 31 मार्च से शुरू हो रहे इंडियन प्रीमियर लीग से वापसी करने को तैयार हैं। तीस साल तेज गेंदबाज को स्ट्रेस फ्रैक्चर और फिर जांघ की तीसरे ग्रेड की चोट से उबरने में काफी मुश्किल हुई। वह पिछली बार भारत की ओर से बांग्लादेश में दूसरे वनडे में खेले थे जहां वह सिर्फ तीन ओवर गेंदबाजी कर पाए थे। वर्ष 2022 में चाहर भारत के लिए केवल 15 मैच ही खेल सके थे और चोट के कारण टी20 विश्व कप से भी बाहर हो गए थे। राष्ट्रीय क्रिकेट अकादमी (एनसीए) में रिहैबिलिटेशन के बाद चाहर आईपीएल की तैयारी कर रहे हैं जहां वह चेन्नई सुपर किंग्स का प्रतिनिधित्व करेंगे। चाहर ने कहा, ‘मैं अपनी फिटनेस पर पिछले दो-तीन महीनों से कड़ी मेहनत कर रहा हूं, मैं पूरी तरह से फिट हूं और आईपीएल के लिए अच्छी तैयारी कर रहा हूं।’ उन्होंने कहा, ‘मुझे दो बड़ी चोट लगी थीं। एक स्ट्रेस फ्रैक्चर था और एक जांघ की तीसरे ग्रेड की चोट। दोनों बहुत बड़ी चोट हैं। आप महीनों के लिए बाहर हो जाते हैं। चोट के बाद वापसी करते हुए समय लगता है, खासकर तेज गेंदबाजों को। अगर मैं एक बल्लेबाज होता तो मैं लंबे समय तक खेलता लेकिन एक तेज गेंदबाज के रूप में जब आपको स्ट्रेस फ्रैक्चर होता है, तो वापसी करना बहुत कठिन होता है। आप अन्य गेंदबाजों को भी पीठ या कमर की चोट को लेकर संघर्ष करते हुए देख सकते हैं।’ राजस्थान के तेज गेंदबाज ने पिछले महीने सेना के खिलाफ प्रथम श्रेणी मैच के साथ प्रतिस्पर्धी क्रिकेट में वापसी की थी लेकिन यह उनका एकमात्र रणजी ट्रॉफी मैच था। चोटों के कारण संभावित खिलाड़ियों की सूची में नीचे खिसकने वाले चाहर को इस साल के अंत में स्वदेश में एकदिवसीय विश्व कप के लिए भारतीय टीम का हिस्सा बनने की उम्मीद हैं। उन्होंने कहा, ‘मैं अपने पूरे जीवन में एक नियम से जिया हूं। अगर मैं पूरी तरह से अपनी इच्छानुसार गेंदबाजी कर रहा हूं, अगर मैं अपनी इच्छानुसार बल्लेबाजी कर रहा हूं, तो मुझे कोई रोक नहीं सकता है। यही वह मूल नियम था जिसके साथ मैंने अपने करियर की शुरुआत की थी।'","pubDate":"2023-02-22 01:16:56","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दो हार से तिलमिला उठा ऑस्ट्रेलिया का पूर्व दिग्गज, अपने ही कप्तान को सुना दी खरी खोटी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/allan-border-raised-questions-on-captaincy-of-pat-cummins/articleshow/98135582.cms","keywords":null,"creator":null,"video_url":null,"description":"Border Gavaskar Trophy:ऑस्ट्रेलिया को बॉर्डर गावस्कर सीरीज में भारत के खिलाफ लगातार दो हार मिल गई है। नागपुर और फिर दिल्ली में हुए टेस्ट को भारतीय टीम ने अपने नाम किया। इस हार के बाद ऑस्ट्रेलिया के पूर्व कप्तान और दिग्गज खिलाड़ी ने अपने ही कप्तान पैट कमिंस पर ही सवाल उठा दिये हैं।","content":"दिग्गज क्रिकेटर एलन बॉर्डर का मानना है कि पैट कमिंस के पास चिंता करने के लिए काफी कुछ है। क्योंकि भारत के खिलाफ सीरीज ‘कप्तान के रूप में उनकी पहली असली परीक्षा’ थी और इस प्रक्रिया में दिल्ली में दूसरे टेस्ट में उन्होंने स्वयं से काफी कम गेंदबाजी कराई। ऑस्ट्रेलिया ने नागपुर और दिल्ली में शुरुआती दो टेस्ट हारने के बाद बॉर्डर-गावस्कर ट्रॉफी जीतने का मौका गंवा दिया है। भारत दौरे पर आने से पहले कप्तान के रूप में सिर्फ एक मैच में शिकस्त झेलने वाले कमिंस दिल्ली में छह विकेट की हार के दौरान ऑस्ट्रेलियाई अंतिम एकादश में एकमात्र तेज गेंदबाज थे। उन्होंने पहली पारी में सिर्फ 13 ओवर फेंके और भारत की दूसरी पारी में बिल्कुल भी गेंदबाजी नहीं की। एलन बॉर्डर ने ‘एसईएन रेडियो’ से कहा, ‘मुझे लगता है कि पैट ने उस टेस्ट मैच में खुद से बहुत कम गेंदबाजी कराई। ऐसे मौके थे जब हम भटकने लगे थे, खासकर भारत की पहली पारी में जब हमने उन्हें एक अच्छी साझेदारी बनाने का मौका दिया। उस समय अगर वह दो या तीन ओवर आक्रामक गेंदबाजी करता तो...’’ ऑस्ट्रेलिया ने भारत का स्कोर सात विकेट पर 139 रन कर दिया था लेकिन अक्षर पटेल और रविचंद्रन अश्विन ने 114 रन की साझेदारी की जिससे मेजबान टीम ने अपने स्कोर को मेहमान टीम के स्कोर से एक रन कम तक पहुंचा दिया। उन्होंने कहा, ‘मुझे लगता है कि मैदान पर अन्य लोग हैं जो कप्तान के पास जा सकते हैं और कह सकते हैं, ‘दोस्त, आप गेंदबाजी क्यों नहीं करते?‘ बॉर्डर ने कहा, ‘लेकिन मुझे लगता है कि एक कप्तान के रूप में पैट की यह पहली वास्तविक परीक्षा है, बाकी सब आसान रहा है, आप उपमहाद्वीप में जाते हैं और अचानक हर विभाग में आपकी परीक्षा होती है।’ उन्होंने कहा, ‘वह बहुत सी अलग-अलग चीजों को लेकर चिंतित है, मुझे लगता है कि वह खुद से गेंदबाजी कराना भूल गया। जब आपका प्रमुख तेज गेंदबाज आपका कप्तान हो तो ऐसा हो सकता है।’ पूर्व विकेटकीपर इयान हीली ने महसूस किया कि कमिंस ने दूसरी पारी में ‘मानसिक शक्ति’ खो दी जिससे दूसरी पारी में सही क्षेत्ररक्षण नहीं लगा पाए। हीली ने कहा, ‘फिर मानसिक तनाव जिसके कारण वह सही क्षेत्ररक्षण नहीं लगा पाया।’ उन्होंने कहा, ‘बल्ले के चारों तरफ कैच लेने वाले अधिक क्षेत्ररक्षक लगाने के बजाय उसने बाउंड्री पर क्षेत्ररक्षक लगाए थे। इसके (गेंदबाजी में बदलाव) बारे में सोचने के लिए दिमाग की बहुत शक्ति की जरूरत होती है।’","pubDate":"2023-02-22 01:01:03","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad- Report","link":"https://www.thetimesofbengal.com/sports/prime-minister-narendra-modi-and-australian-pm-anthony-albanese-to-attend-india-vs-australia-4th-test-in-ahmedabad-report/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad- Report The fourth Test is scheduled to be held at Ahmedabad from March 9-13. Prime Minister Narendra Modi and Australian PM Anthony Albanese to Attend India vs Australia 4th Test in Ahmedabad. (Image: Twitter) New […]","content":"New Delhi: Australian Prime Minister Anthony Albanese is set to make his maiden trip to India early next month with an aim to boost overall bilateral engagement in a range of areas, including trade, investment and critical minerals. People familiar with the plan for his visit said on Monday that Albanese is expected to begin the visit around March 8 and he and Prime Minister Narerndra Modi are likely to travel to Ahmedabad to witness the fourth cricket Test match between India and Australia. The fourth Test is scheduled to be held at Ahmedabad from March 9-13. It will be Albanese’s first visit to India after he became prime minister in May last year. External Affairs Minister S Jaishankar visited Australia last week ostensibly to prepare for the visit to India by the Australian prime minister. There is no official announcement of the visit yet. However, Albanese mentioned about his visit to India in a tweet after meeting Mr Jaishankar on Saturday. “It was wonderful to meet with @DrSJaishankar his morning ahead of my trip to India next month. We discussed our strategic partnership, economic opportunities and the people-to-people ties that enrich our nations,” he tweeted. The people said expansion of cooperation in the Indo-Pacific in the backdrop of China’s growing military muscle-flexing in the region is expected to figure in the talks during the Australian prime minister’s visit to India. They said boosting trade, investment and critical minerals will figure high on the agenda of talks between Prime Minister Modi and Albanese. The ties between India and Australia have been on an upswing in the last few years. The India-Australia Economic Cooperation and Trade Agreement (ECTA) came into force in December and it is expected to facilitate significant expansion of two-way trade. Defence and security ties between India and Australia have been on an upswing in the last few years. In June 2020, India and Australia elevated their ties to a comprehensive strategic partnership and signed a landmark deal for reciprocal access to military bases for logistics support. The Mutual Logistics Support Agreement (MLSA) allows the militaries of the two countries to use each other’s bases for repair and replenishment of supplies, besides facilitating scaling up of overall defence cooperation. In August last year, four Sukhoi-30 MKI fighter jets and two C-17 heavy-lift aircraft of the Indian Air Force joined a 17-nation air combat exercise in Australia. Over 100 aircraft and 2,500 personnel from Australia, Canada, France, Germany, Indonesia, India, Japan, Malaysia, the Netherlands, New Zealand, the Philippines, Republic of Korea, the UAE, Singapore, Thailand, the US and the UK participated in the exercise in Australia’s Northern Territory. Australia is set to host the Malabar naval exercise later this year. It will involve the navies of India, Australia, Japan and the US. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-22 00:31:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Super sub: Who could be your AFL team’s swingman in 2023?","link":"https://www.brisbanetimes.com.au/sport/afl/super-sub-who-could-be-your-afl-team-s-swingman-in-2023-20230221-p5cm4w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"The super sub is back, with clubs drilling into their lists to determine who would be the best fit to cover for injury, while also potentially having the ability to be a late match winner. We look at each club’s potential candidates.","content":"The back-to-the-future AFL ruling that will allow coaches to activate a substitute at any time of a game in 2023 has clubs dissecting who best should fill the role. Having had four men on the bench plus a medical substitute over the past two years, the AFL has this season ditched the medical sub – as it became , in part, too hard to monitor – in favour of a “super sub”. Who will be your club’s super sub in 2023? Credit: Pat Scala/Jamie Brown It was through 2011-15 that there were three men on the bench plus a substitute – the latter able to be activated at any point for any reason in the game. Game plans, the strength and health of a list, and opposition tactics will have a bearing on who is the 23rd man. Ahead of the practice match campaign officially beginning on Thursday , Demons head of football Alan Richardson said clubs had to weigh up several factors when determining their sub. “You wouldn’t want to enact it too early in a game just in case you get an injury. It’s probably going to be something after half-time I reckon, then it can depend,” Richardson said. “It will be a combination for us of how the team is going in a certain area, or do we potentially want to bring someone in that might bolster an area for us? It might be a combination, along with what the opposition are doing. What have the opposition got, and what are we going in fearing, and what do we need to control? Is there someone that can exploit something, or control something? “That is sort of where we are at. It will be good in these couple of games to look at it.” Speed in the game, or injecting a tough-nut extractor, are likely to be the primary weapons considered, according to most clubs, but other club chiefs have wondered whether a fresh marking tall, or even a ruck, could be activated. Adelaide Shane McAdam , who has had an injury-impacted pre-season, can play as a high half-forward and take a strong mark. And veteran Matt Crouch , after an indifferent 2022 when he managed only 11 games, could provide midfield class and experience with the contest on the line. Brisbane Lions The versatile Callum Ah Chee was used as the substitute several times last season. Irishman Conor McKenna , back in the AFL fold, has the speed to burn tiring opponents across half-back and further afield. Carlton Jack Silvagni may be squeezed from the Blues’ best 22 this season, but his versatility – as a forward, reserve ruckman and even midfielder – makes him an ideal 23rd man. Draftee Oliver Hollands and Josh Honey can provide run and carry. Matthew Cottrell was injected four times as the sub last season. Could Jack Silvagni be the Blues’ ideal super sub, or will Michael Voss prefer an injection of speed in 2023? Credit: Getty Images Collingwood Will Hoskin-Elliott faces a fight to be in the Magpies’ best 22, but his run off the bench would be more than handy. Finlay Macrae , who may struggle to break into a blue-chip midfield, could also do the job. Essendon Big-bodied former Carlton midfielder Will Setterfield shapes as an ideal fit off the bench, while Ben Hobbs , on the mend from a calf strain, can head into the midfield or forward line and influence a game. Loading Fremantle High-pressure small forward Bailey Banfield is an ideal fit, having been regularly used as the sub last season, including in both finals. If Banfield forces his way into the starting 22, speedster Liam Henry could do the role. Geelong Versatile Irishman Mark O’Connor , who replaced an injured Max Holmes in the premiership 22 last year, is an ideal fit. Talented recruits Tanner Bruhn , Ollie Henry and Jack Bowes face a squeeze to make the Cats’ best 22, but could easily start as the spare man. Versatile Geelong utility Mark O’Connor in action. Credit: Getty Images Gold Coast Brayden Fiorini has the speed to trouble opponents off the bench, while defender Sean Lemmons and Rory Atkins , the latter used as a sub last year, are also options. Greater Western Sydney Toby Bedford will hope to avoid the role, as the former Demon started several games as the medical sub last season. Fellow small forward Brent Daniels could be an ideal fit, while Jacob Wehr and Callum Brown provide versatility. Loading Hawthorn The Hawks will have a new-look midfield this season. Finn Maginness , a tagger last season, may be squeezed out of the 22 if the Hawks look to attack early in games. Lachlan Bramble has the versatility. Melbourne Premiership defender Jake Bowey fell out of the starting rotation last year. Buoyed by a strong pre-season, he could provide run off the bench. Tom Sparrow , fighting for a midfield spot, is another option. After a short-lived retirement, former Hawthorn forward Liam Shiels could be a valuable swingman at his new club, North Melbourne. Credit: Getty Images North Melbourne Alastair Clarkson trusts his former Hawthorn mates, so having either veterans Liam Shiels or Daniel Howe off the bench, particularly early in the season, makes sense. Is Jaidyn Stephenson , used at half-back and half-forward in last weekend’s intra-club clash, an option? Port Adelaide Xavier Duursma , seeking to revive his career, and midfielder Sam Powell-Pepper are strong options, while youngster Jase Burgyone , with eight games last season, is also a possibility. Richmond Jason Castagna was used as a substitute last year, and his run through high half-forward and ability to hit the scoreboard could be important for the Tigers. Hugo Ralphsmith is versatile and can provide rebound from half-back, while also going to a wing. Jack Ross is another option. Will the Tigers again turn to Jason Castagna to spend time as a substitute this season? Credit: Getty Images St Kilda Former Blue Liam Stocker is seen as a burst player who could have an impact at half-back and through the midfield. Nick Coffield , once fully fit, and Hunter Clark are also options. Loading Sydney Emerging half-back Braeden Campbell can provide run and carry and push into the midfield. Joel Amartey , Hayden McLean and Sam Wicks can also provide punch off the bench. West Coast Former hard-running Demon Jayden Hunt shapes as an ideal fit to help turn a game after half-time, while veteran Jamie Cripps can deliver up forward. Versatile defenders Josh Rotham and Jamaine Jones and midfielder Greg Clark were used in the role last season. Western Bulldogs Jason Johannisen is an ideal fit, for he has pace, and can play multiple roles, but is likely to be in the best 22. Anthony Scott can go into the midfield or forward, while Hayden Crozier and Riley Garcia can deliver in bursts. Veteran half-forward Mitch Hannan could be a calming hand. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Carlton Blues Collingwood Magpies Essendon Bombers Hawthorn Hawks More… Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-02-22 00:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Why Dewald Brevis Will Be The Man To Watch Out In Mumbai Indians Camp","link":"https://www.thetimesofbengal.com/sports/why-dewald-brevis-will-be-the-man-to-watch-out-in-mumbai-indians-camp/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Why Dewald Brevis Will Be The Man To Watch Out In Mumbai Indians Camp IPL legend AB De Villiers compares Brevis to Surya Kumar Yadav and picks the young South African to shine in the white-ball format. Dewald Brevis turned out for MI Cape Town in the recently-concluded SA20. (Photo: BCCI) […]","content":"New Delhi: The 2023 edition of the Indian Premier League is upon us and cricket pundits have started picking the players who are likely to shine in the world’s biggest T20 league. South African teenager Dewald Brevis is expected to turn heads, believes former IPL superstar AB De Villiers . This will be Dewald Brevis’ second season in IPL. In 2022, Mumbai Indians picked the highly-rated South African all-rounder for Rs 3 crores. Five-time IPL champions Mumbai Indians are in rebuilding mode and Brevis will surely be among the core players who can help MI regain their glorious days. Brevis is nicknamed as ‘Baby AB’. He has shown the versatility in stroke-making and bats in the middle-order, a position where De Villiers, under pressure, excelled in both building an innings and shifting gears while chasing. It is not for nothing that De Villiers is backing Brevis to shine in IPL 2023. Brevis has just played for MI Cape Town in the SA20. He ran hot and cold with the bat. An unbeaten 70 off 41 balls helped MI Cape Town beat Davis Miller-led Paarl Royals by eight wickets. Brevis had two more scores in the 40s, opening the batting. When IPL starts on March 31, Brevis is expected to match ready when Mumbai Indians play their first match against Royal Challengers Bangalore on April 2 at Bangalore’s Chinnaswamy Stadium. While he will certainly be an opening option, MI may want him to bat in the middle order where Surya Kumar Yadav will be a mainstay. Dewald Brevis will be 20 when IPL will be at the mid-way stage. He is at that stage of his career where he can only learn and learn. And what better to be in a team where there are seasoned players like Rohit Sharma, Surya Kumar Yadav and Cameron Green. AB De Villers feels Brevis has shades of Yadav in his game. Yadav, nicknamed SKY, has rocked white-ball cricket with his range of strokes and power-hitting. He says: “There are certainly similarities in the way that they approach the game. They’re both really aggressive, they want to take the bowlers on and they don’t let the bowlers settle. “Dewald is obviously a lot younger and has still got a lot to learn, whereas SKY is experienced these days. He come a long way having performed well for the Mumbai Indians at the IPL. But they both excite me a lot.” Dewald Brevis has the potential to fill De Villiers’ shoes for South Africa, a team that has lost a lot of punch and flair at the world stage. At least, the numbers indicate Brevis has the promise to do so. MI spotted him after the South African captain became the highest run-getter in the ICC Under-19 World Cup 2021-22. In six matches, Brevis amassed 506 runs, including two hundreds and three fifties. With a strike-rate of 90-plus, Brevis was simply outstanding. Brevis has more big numbers to back his talent. He was the youngest South African at 19 years 185 days to slam a men’s T20 century. By slamming 162, Brevis is the highest T20 scorer in South African cricket. Only Chris Gayle (175 not out) and Aaron Finch (172) are ahead of Brevis. Season 2023 will be one of redemption for Mumbai Indians. Having finished last in 2022 among 10 teams, MI will look to claw back. Brevis will be part of the plans and he will get a lot of ‘home’ support from former South African stumper and coach, Mark Boucher, the new Mumbai Indians boss. In his maiden season with MI, Brevis scored 161 runs in seven matches at an average of 23. His strike-rate was a breezy 142.48 but that’s not enough. It’s time to produce the big numbers on Indian soil. And AB De Villiers will surely be watching. (Soumitra Bose is a senior journalist and research scholar. He tweets @soumitra65. Views are personal) $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-22 00:23:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Wolvaardt and Brits help Proteas secure semifinal spot in T20 World Cup","link":"https://www.dailymaverick.co.za/article/2023-02-21-wolvaardt-and-brits-help-proteas-secure-semifinal-spot-in-t20-world-cup/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Openers Tazmin Brits and Laura Wolvaardt struck a century partnership to help the Proteas to a 10-wicket victory over Bangladesh. They will now face England in the second semifinal on Friday. The post Wolvaardt and Brits help Proteas secure semifinal spot in T20 World Cup appeared first on Daily Maverick.","content":"A superb century stand by openers Laura Wolvaardt and Tazmin Brits helped the Proteas women to a comfortable 10-wicket win over Bangladesh on Tuesday. The victory means South Africa will face England in the semifinal of the T20 World Cup at Newlands on Friday. In what was essentially a quarterfinal clash for the Proteas, Wolvaardt struck a well-paced 66 off 56 deliveries while Brits held her own with an important 50 off 51 deliveries. Laura Wolvaardt of South Africa on her way to scoring 66 off 56 deliveries in the ICC Women’s T20 World Cup match between against Bangladesh at Newlands Cricket Ground in Cape Town on 21 February 2023. (Photo: Ashley Vlotman / Gallo Images) Wolvaardt’s confidence-boosting half-century contained seven fours and one magnificent six over mid-on. Bangladesh skipper Nigar Sultana won the toss and elected to bat first. The Proteas restricted them to 113 for six, but it wasn’t all easy going for the host nation, chasing 114 for victory. The opening pair struggled to pierce the gaps and rotate the strike in the first half of the innings, scoring only 43 in the first 10 overs. But the handbrake was released after that point, with South Africa thrashing 74 runs in the last 47 deliveries of their innings to secure their passage to the next round with 13 balls to spare. “An extra 20 to 30 runs would have made a big difference,” said Sultana after the match. It was a good return to form for Wolvaardt, whose previous highest score in the World Cup was 19 in South Africa’s last match against Australia. The victory, however, was once again set up by South Africa’s phenomenal bowlers. Ayabonga Khaka of South Africa picked up two wickets against Bangladesh. (Photo: Ashley Vlotman / Gallo Images) Only Nadine de Klerk and Chloe Tryon — who shared the load of the fifth bowler — went for more than six runs an over, while Marizanne Kapp registered magnificent figures of two wickets for 17 runs in her four overs. One of her wickets included that of skipper Sultana for 30 in the final over of the innings, just as she was getting going. Ayabonga Khaka also picked up two wickets as she and Kapp restricted the Bangladeshis masterfully at the end of the innings. Visit Daily Maverick’s home page for more news, analysis and investigations Left-arm orthodox Nonkululeko Mlaba once again opened the bowling alongside Shabnim Ismail and the pair kept things tight upfront while taking one wicket apiece. However, South Africa’s fielding left a lot to be desired as the batting heroines Wolvaardt and Brits dropped two sitters. There were several overthrows as well, which helped Bangladesh reach their below-par total. The Proteas will need to sharpen up in that department if they are to reach their first World Cup final. Just a few hours before South Africa’s victory, their semifinal opponents, England, dismantled Pakistan by 114 runs. England smashed their way to the highest Women’s T20 World Cup score of 213 for five before bowling Pakistan out for 99. India and Australia will face off in the first semifinal on Thursday. South Africa’s semifinal against England starts at 3pm on Friday. DM","pubDate":"2023-02-21 21:38:51","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Nat Sciver-Brunt, Wyatt, Jones break Women’s T20 World Cup record in win over Pakistan","link":"http://island.lk/nat-sciver-brunt-wyatt-jones-break-womens-t20-world-cup-record-in-win-over-pakistan/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"England smashed the highest ever women’s T20 World Cup total in a record 114 run thrashing of Pakistan in Newlands to complete an unbeaten group phase Brief scores: England 213 for 5 (Nat Sciver-Brunt 81*, Danni Wyatt 59, Fatima Sana 2-44) beat Pakistan 99 for 9 (Tuba Hassan 28, Katherine Sciver-Brunt 2-14) by 114 runs","content":"England Pakistan Published on By Asian Youth Championship medallist Nirmali Wickramasinghe of Wickramabahu Central, Gampola is among dozens of leading youth athletes vying to achieve qualifying standards for the next edition of the Asian event which will be held in Uzbekistan. The final selection trial to pick Sri Lanka’s team for the Asian event will be held today and tomorrow at Diyagama. Despite a marked drop in performance standards at the last Asian Youth Championships, Sri Lanka Athletics has set tough qualifying standards to select the team for the next edition . While setting up tough entry standard even for the trial meet, the Athletics officials have raised the qualifying standards in some events. The qualifying standard for the boys’ 1500 metres is set at four minutes despite even the gold medal of the last meet being decided in a time of 4:04.59 minutes. In the corresponding girls event too the qualifying standard is 4:48.00 minutes. The gold medal of the last championship was decided in 4:51.61 minutes. Wickramasinghe who won the silver medal of the girls’ 800 metres at the Asian Youth Championship in Kuwait last year has run the 1500m below the qualifying standard and will be among dozen others eager to excell at the two-day meet. In the 400 metres, the event where Sri Lanka won two medals last year, the qualifying standard is 48.80 seconds for boys while it is 56.50 for girls. Women’s 3,000m, Men’s 3,000m, Women’s 200m Heats, Men’s 200m Heats, Women’s 400m Hurdles, Men’s 400m Hurdles, Men’s high jump, Women’s Long Jump, Women’s 800m, Men’s 800m, Women’s 100m hurdles, Men’s 110m hurdles, Men’s triple jump, Men’s pole vault, Women’s 200m, Men’s 200m. Published on By Dinara de Silva, Sandas Usgodaarachchi and Methwan Wijemanne registered victories in their respective singles matches of the Junior Davis Cup and Junior Billie Jean King Cup tournament matches played at the Sri Lanka Tennis Association courts on Monday. Methwan Wijemanne Published on By It started with a sensational win over South Africa in the tournament opener and ended with a whimper as they were dismissed for their third-lowest total in T20Is. It’s fair to say Sri Lanka came, saw, conquered and then crashed out. For Chamari Athapaththu, it’s not a calamity. “The world has not ended. The sun will come up tomorrow. I want to build a good team for the future. Today the feeling is not good but my focus is the next tour,” she said, still smiling, afterwards. That Athapaththu can even talk about the next tour is a win for Sri Lanka. They went without fixtures between March 2020 and January 2022 and know what the effects of a prolonged absence from the game can do for a team’s momentum. Now, thanks to the first ever women’s FTP, they have visits from Bangladesh (which did not take place prior to the World Cup as initially scheduled) and New Zealand to look forward to, as well as a tour of England later this year. “The youngsters need some experience. They need to play more cricket in future,” Chamari said. “We have to play a lot of cricket against the top four teams.” Chamari’s youngsters include under-19 captain Vishmi Gunaratne, who is only 16, offspinner Kavisha Dilhari, who has 10 more T20I caps to her name than her age of 22, and her opening partner, 24-year-old Harshitha Samarawickrama. All of them were excited about the prospect of reaching the semi-finals and anxious about beating New Zealand after losing to Australia, even if that result had been somewhat priced in. “I’m not worried about the Australia games but I’m a little bit worried about today’s game,” she said. “It was a very crucial game for us and I felt some of the girls in my team put too much pressure on their shoulders. I think they didn’t handle that pressure very well.” Sri Lanka’s nerves showed almost immediately. They missed a run-out chance that would have seen Bernadine Bezuidenhout dismissed for 7 and then dropped her on 19. She went on to score 32 and share in a 46-run opening stand with Suzie Bates that set up New Zealand’s innings. They also dropped Bates, on 37, as her 56 off 49 balls propelled New Zealand to a score above 160. In response, Sri Lanka were completely shell-shocked. They played their big shots too early and picked out fielders and once Athapaththu was dismissed, it became a procession as the last five wickets fell for 25 runs. Their opposition knows exactly what that feels like. It was less than a week ago that New Zealand were bundled out for 67 – the second-lowest T20I total – two days after Australia had dismissed them for 76 to all but end their hopes of qualifying for the semi-finals. They were particularly distressed after their 65-run defeat to South Africa – a match that had the weight of a quarter-final attached to it – and captain Sophie Devine emphasised the need to figure out and discuss where things were going wrong. Athapaththu may be tempted to do the same but Amelia Kerr, who was part of Devine’s team’s talks, had some advice. “When there is emotion involved, sometimes you don’t know what to say and it’s better to review it the next day.” When New Zealand did that, they came up with a mantra for their last two games: “be tougher when things get tough,” Kerr explained. “There was nothing wrong with the talent we have in this room, it was just to have that belief and be tough.” That may work for New Zealand, who have a fairly developed professional structure as opposed to Sri Lanka, whom FICA’s annual global employment report said had “not professional structures”, and both Athapaththu and Kerr acknowledged the gap is growing. Unsurprisingly, they both cited Australia as the benchmark and while Athapaththu zoned in on the domestic structure, Kerr looked at T20 franchise leagues that have made the difference. “Australia has a good domestic structure. They play a lot of cricket – domestic tournaments and schools tournaments,” Athapaththu said, while Kerr described the resources the Australian players have as “outstanding”. But they also pointed to the growing prowess of India as a signal to the rest to speed up their development. “In terms of what we are seeing around the world, with the Hundred in England, the WBBL in Australia and now the WPL, it’s going to strengthen those countries a lot,” Kerr said. “We are heading in the right direction: our match fees being equal to the men, and it allows us to earn more money so we can train more. Most of us do cricket full-time which is only going to help our game. We are behind those countries but if all countries can get that opportunity it is going to help grow the women’s game.” And for Athapaththu, that is especially significant for the other teams on the subcontinent, which could have just one representative – India – in the final four. “India has a good structure but in Pakistan, Sri Lanka and Bangladesh, we have to develop our structure,” she said. Because she wants to be part of that process, Athapaththu herself has committed to at least another T20 World Cup – the next tournament is in Bangladesh in September/October 2024 – and perhaps even another 50-over tournament. “I want to build a good team for Sri Lanka for the future, so that’s my goal,” she said. “I want to encourage the youngsters and be a role model. I always try to lead them from the front, so my target is playing another one or two years for Sri Lanka. That’s what I want to do.”","pubDate":"2023-02-21 20:51:43","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"South Africa beat Bangladesh to secure spot in World cup semi-finals","link":"https://www.thesouthafrican.com/sport/cricket/south-africa-beat-bangladesh-in-t20-womens-world-cup-semi-final-bound-21-february-2023/","keywords":["Cricket","Sport","bangladesh","Featured","ICC Women’s T20 World Cup","Important","Proteas"],"creator":["Zareena Gaibee"],"video_url":null,"description":"South Africa beat Bangladesh by 10 wickets, in Cape Town to secure their place in the semi finals of their home Women's T20 World Cup.","content":"South Africa beat Bangladesh by wickets 10, in Cape Town to secure its place in the semi-finals of the Women’s T20 World Cup. In the final pool game, Bangladesh won the toss and chose to bat first. South Africa beat Bangladesh ALSO READ: Proteas Wolvaardt embracing pressure of must-win Bangladesh set a target of 114 Bangladesh struggled to form partnerships with wickets falling regularly. Captain Nigar Sultana Joty top scored with 30 off 34 deliveries. Sobhana Mostary made 27 off 30 and Nahida Akter ended with an unbeaten 15* off 11. The innings ended with Bangladesh 113/6. Veteran Marizanne Kapp was the pick of the South African bowlers with 2/17. Ayabonga Khaka took 2/21. Nonkululeko Mlaba, who opens the bowling managed 1/21 and pacer Shabnim Ismail took 1/22. ALSO READ: Women’s T20 World Cup: Watch from the grass or couch South Africa takes things slow The Proteas got off to a nervy start with successful reviews, missed fielding, and desperate shots. The openers managed to put on a 100-run partnership, only the second one of 50 plus for the team this Women’s T20 World Cup. Both openers made unbeaten half-centuries with Laura Wolvaardt top-scoring with 66* off 56. Tamzin Brits joined her with 50* off 51. Bangladesh’s bowlers created chances but the team failed to take them. Missed stumpings and dropped catches saw them go wicketless. ALSO READ: The Proteas fate back in their own hands thanks to White Ferns win The business end of the Women’s T20 World Cup Australia faces India on Thursday, 23 February in Cape Town at 15:00 for the first semi-final. The Proteas take on an inform England on Friday, 24 February at 15:00 also in Cape Town. The final will be played on Sunday, 26 February. CLICK HERE TO READ MORE ARTICLES BY ZAREENA GAIBEE","pubDate":"2023-02-21 20:24:51","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"}]}