{"newsArray":[{"title":"Cricket-England need &#039;systemic change&#039;: Giles","link":"https://www.thestar.com.my/sport/cricket/2022/01/05/cricket-england-need-039systemic-change039-giles","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England director Ashley Giles said he felt the responsibility for their Ashes series loss in Australia but warned that getting rid of the current leadership without bringing in systemic change was not the answer to their problems in red-ball cricket. Read full story","content":null,"pubDate":"2022-01-05 04:16:00","full_description":"(Reuters) - England director Ashley Giles said he felt the responsibility for their Ashes series loss in Australia but warned that getting rid of the current leadership without bringing in systemic change was not the answer to their problems in red-ball cricket. England have lost the first three matches in the Ashes series and are playing only for pride in the remaining two tests in Sydney and Hobart. It has been an abysmal 12 months in test cricket for England, who lost four series in a year for the first time. \"Being here now in this position, I absolutely feel the responsibility of losing this Ashes series,\" Giles told reporters at the Sydney Cricket Ground on Tuesday. \"Absolutely, we all do, and we can only apologise. \"I know there will be a lot of emotion, a lot of anger about how we've lost it but we know it's not an easy place to come. We can't kid ourselves. In 34 years we've come here and won once. \"We'll review the tour and there will be a full review, everything will be on the table.\" Captain Joe Root and coach Chris Silverwood have come in for heavy criticism, with pressure on the pair growing since England lost the third test in Melbourne by an innings and 14 runs. Giles said that hasty changes to the England and Wales Cricket Board (ECB) or test team leadership would not solve the issues. \"If it was a failing of this leadership, then fine, I'd take that, I'm at peace with accountability,\" Giles said. \"Unless we look at more systemic change and a collective responsibility and collective solutions, we can make whatever changes we want. \"You can change me, change the head coach, change the captain, but we're only setting up future leaders for failure. That's all we're doing. We're only pushing it down the road.\" While England may pick up wins over teams below them in the rankings it was important to focus on finding a way to win in the most difficult conditions, he said. \"What's important is that we don't try to paper over the cracks,\" Giles added. \"We could easily go to West Indies and win, then win this summer. I think we still need to be truly focused on finding a way we can compete in Australia and in India.\" (Reporting by Aadi Nair in Bengaluru; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/05/1431943.jpg","source_id":"thestar_my"},{"title":"“I am a soldier of Bangladesh”: Ebadot Hossain opens up after Bangladesh’s historic test win over New Zealand","link":"https://thesportsrush.com/cricket-news-i-am-a-soldier-of-bangladesh-ebadot-hossain-opens-up-after-bangladeshs-historic-test-win-over-new-zealand/","keywords":["Cricket","Ebadot Hossain","New Zealand vs Bangladesh","World Test Championship"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"New Zealand vs Bangladesh: Ebadot Hossain won Man of the Match in Bangladesh’s historic test over the Blackcaps at the Bay Oval. Bangladesh created history by defeating the Blackcaps in their own backyard. This is their first-ever win in New Zealand in any format of the game. Bangladesh also registered their first-ever away test win… The post “I am a soldier of Bangladesh”: Ebadot Hossain opens up after Bangladesh’s historic test win over New Zealand appeared first on The SportsRush.","content":"New Zealand vs Bangladesh: Ebadot Hossain won Man of the Match in Bangladesh’s historic test over the Blackcaps at the Bay Oval. Bangladesh created history by defeating the Blackcaps in their own backyard. This is their first-ever win in New Zealand in any format of the game. Bangladesh also registered their first-ever away test win against any of the top-5 sides. New Zealand managed to score a decent total of 328 runs in the first innings. Conway scored a century for the hosts, whereas Young and Nicholls made half-centuries. Bangla spin duo of Mominul and Mehidy Hasan combined for five wickets. However, Bangladesh surprised everyone by batting brilliantly in the 1st innings. They managed to score 458 runs and took a brilliant lead of 130 runs. Mahmudul Hasan, Mominul Haque, Najmul Shanto, and Liton Das scored brilliant half-centuries. In the 2nd innings, Ebadot Hossain took six wickets and the Blackcaps bundled down for just 169 runs. Chasing just 40 runs to win the game, Bangladesh won it by eight wickets. With this win, they got 12 prestigious points in the World Test Championship. This defeat has been a vital blow to New Zealand’s chances. Bangladesh Team dressing room celebrations following the historic win at Mount Maunganui.#BCB #cricket #BANvsNZ pic.twitter.com/78pGFQ30wP — Bangladesh Cricket (@BCBtigers) January 5, 2022 New Zealand vs Bangladesh: Ebadot Hossain wishes to inspire generations ahead Bangladesh pacer Ebadot Hossain won the Man of the Match for picking six wickets in the 2nd innings. Hossain believes that this win will inspire the next generation of cricketers to do the same in away conditions. “When we came this time, we set a goal and we said to ourselves we can do it,” Ebadot said. “New Zealand are Test Champions and if we beat them then it will inspire the next generation to do the same.” Ebadot Hossain was unstoppable in the second innings against New Zealand. His splendid performance earned him Player of the Match honours #NZvBAN | #WTC23 pic.twitter.com/thzGkX81pt — ICC (@ICC) January 5, 2022 Hossain said that the conditions in Bangladesh are quite flat, and he enjoyed bowling here. Ebadot used to play volleyball before switching to cricket. “The conditions are too flat in Bangladesh and we are still learning how to bowl away from home,” Hossain added. “I am a soldier of Bangladesh and know how to celebrate (after a wicket). My journey from volleyball to cricket is a long story. I am enjoying my cricket.” The 2nd test game of the series will start from 9 January 2022 at the Hagley Oval in Christchurch. The post “I am a soldier of Bangladesh”: Ebadot Hossain opens up after Bangladesh’s historic test win over New Zealand appeared first on The SportsRush.","pubDate":"2022-01-05 04:10:39","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Shardul Thakur: My best bowling is yet to come","link":"https://sportstar.thehindu.com/cricket-videos/south-africa-v-india-second-test-shardul-thakur-seven-wickets-best-figures-indian-bowler-press-conference/article38122839.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Shardul Thakur made history at the Wanderers on Tuesday. His seven for 61 is the best ever figures by an Indian bowler against South Africa in Test cricket, but he believes his best is yet to come.","content":null,"pubDate":"2022-01-05 04:08:35","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Watch: Ebadot Hossain Gives \"One Of The Best Post-Match Interviews\" Ever After Bangladesh's Historic.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2ViYWRvdC1ob3NzYWluLWdpdmVzLW9uZS1vZi10aGUtYmVzdC1wb3N0LW1hdGNoLWludGVydmlld3MtZXZlci1hZnRlci1iYW5nbGFkZXNocy1oaXN0b3JpYy10ZXN0LXdpbi1pbi1uZXctemVhbGFuZC13YXRjaC0yNjg5NDkz0gGmAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvZWJhZG90LWhvc3NhaW4tZ2l2ZXMtb25lLW9mLXRoZS1iZXN0LXBvc3QtbWF0Y2gtaW50ZXJ2aWV3cy1ldmVyLWFmdGVyLWJhbmdsYWRlc2hzLWhpc3RvcmljLXRlc3Qtd2luLWluLW5ldy16ZWFsYW5kLXdhdGNoLTI2ODk0OTMvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Ebadot Hossain Gives \"One Of The Best Post-Match Interviews\" Ever After Bangladesh's Historic..  NDTVSports.comNew Zealand vs Bangladesh: Ebadot Hossain takes six wickets as Bangladesh register first-ever Test win ov  Times of IndiaStatistical highlights from Bangladesh cricket's historic win | Cricbuzz.com - Cricbuzz  CricbuzzWatch: Bangladesh Just Took DRS For This. Is It The Worst Review Ever?  NDTV SportsOur process was excellent, says Mahmud - Sentinelassam  The Sentinel AssamView Full coverage on Google News","content":null,"pubDate":"2022-01-05 03:41:25","image_url":null,"source_id":"google"},{"title":"Broad celebrates ANOTHER Warner scalp with a jig","link":"https://www.news.com.au/sport/cricket/broad-celebrates-another-warner-scalp-with-a-jig/video/01245395f9d60197f58fa936af4c0685","keywords":null,"creator":null,"video_url":null,"description":"Cricket: After claiming David Warner for a 13th time, Stuart Broad celebrated the wicket with a small dance.","content":null,"pubDate":"2022-01-05 03:40:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"“He’s a match-winner, Mitch Marsh”: Shane Warner believes Mitchell Marsh should have played Ashes 2021-22 Sydney test over Usman Khawaja","link":"https://thesportsrush.com/cricket-news-hes-a-match-winner-mitch-marsh-shane-warner-believes-mitchell-marsh-should-have-played-ashes-2021-22-sydney-test-over-usman-khawaja/","keywords":["Cricket"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ashes 2021-22: Shane Warne believes Australia missed the trick by not playing Mitchell Marsh over Usman Khawaja in the Sydney test. Australia have wrapped up the Ashes 2021-22 by winning the Boxing Day test in Melbourne. However, they still can’t take the remaining two games lightly. The Ashes is decided, but the 24 points of… The post “He’s a match-winner, Mitch Marsh”: Shane Warner believes Mitchell Marsh should have played Ashes 2021-22 Sydney test over Usman Khawaja appeared first on The SportsRush.","content":"Ashes 2021-22: Shane Warne believes Australia missed the trick by not playing Mitchell Marsh over Usman Khawaja in the Sydney test. Australia have wrapped up the Ashes 2021-22 by winning the Boxing Day test in Melbourne. However, they still can’t take the remaining two games lightly. The Ashes is decided, but the 24 points of the World Test Championship are still to play for. Australia would want to take all 60 points from the series. As expected, Usman Khawaja replaced Travis Head in the eleven in the Sydney test. Travis Head is missing this game after a positive Covid positive result. Khawaja has been in top form in the Sheffield Shield. He has scored 326 runs this season at 81.50, where he has scored two consecutive centuries. Usman batted at the number four slot for Queensland in the Shield games, and it makes him an obvious replacement. Ashes 2021-22: Shane Warne tips Mitchell Marsh as “match-winner” Shane Warne ahead of the game said that he would have preferred Mitchell Marsh in this game. He insists that Khawaja deserves his chance, but as a bowler, he would rather bowl to Khawaja than Marsh. “I’m sure the selection would have gone for a while,” Warne said on Fox Cricket. “Australia has been waiting a long time for Mitchell Marsh to come good .. and right at the moment he’s in the form of his life.” “For me, I just think as a bowler who would I rather bowl to, Khawaja or Mitchell Marsh? I’d much rather bowl to Khawaja. Mitchell Marsh can hurt you, he’s dangerous and we’ve been waiting for him to have a chance.” JUST WOW! What a knock from Mitch Marsh! His first #BBL ! pic.twitter.com/eGjW3AuBU0 — cricket.com.au (@cricketcomau) December 14, 2021 Warne has hailed Mitchell Marsh as a “match-winner”. He insists that this would have been the best time to test Mitchell Marsh in front of James Anderson and Stuart Broad. “Khawaja deserves his chance, don’t get me wrong,” Warne said. “But we’ve been waiting a long time for Marsh to come good and what a time now, when you’ve won the Ashes, what a time to say ‘have you got it at this level? You’re going to be tested against Broad and Anderson, let’s see what you’ve got in this form’.” “He’s a match-winner, Mitch Marsh.” The post “He’s a match-winner, Mitch Marsh”: Shane Warner believes Mitchell Marsh should have played Ashes 2021-22 Sydney test over Usman Khawaja appeared first on The SportsRush.","pubDate":"2022-01-05 03:33:19","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Bangladesh beats New Zealand by 8 wickets","link":"https://www.tribuneindia.com/news/sports/bangladesh-beats-new-zealand-by-8-wickets-358314","keywords":null,"creator":null,"video_url":null,"description":"Mount Maunganui (New Zealand), January 5 Fast bowler Ebadot Hossain took a career-best 6-46 as Bangladesh beat World Test Champion New Zealand by eight wickets in the first cricket test Wednesday, capturing its first-ever win in New Zealand. Ebadot had bowled Bangladesh to the brink of a famous victory by the end of the fourth day when he had figures of 4-39. He broke down the last of New Zealand's resistance with two quick wickets as the home team was dismissed in its second innings for 169, its lowest score against Bangladesh. New Zealand trailed by 130 runs on the first innings, leaving Bangladesh to score only 40 for victory. It lost two wickets in doing so but current captain Mominul Haque, top-scorer in the first innings, and former captain Mushfiqur Rahim were at the crease when Bangladesh reached 42-2. It was only Bangladesh's sixth test win away from home and its first test win over a team ranked in the top 5 ranked team: New Zealand is ranked No. 2 and Bangladesh No. 9. The result also brought to an end New Zealand's unbeaten streak in its last 17 tests at home. Ebadot, a former volleyball player who became a test cricketer after winning a fast bowling competition, had only 11 test wickets at an average of 81 when he came into this match as Bangladesh's third seamer. He took 1-75 in New Zealand's first innings of 328 but came into his own in the second innings, running through the middle order on Tuesday with the wickets of Devon Conway (13), Henry Nicholls (0), Tom Blundell (0) and Will Young (69). That left New Zealand 147-5 at the start of play Wednesday, only 17 ahead of Bangladesh. The possibility of any stern resistance by New Zealand, marshaled around veteran batsman Ross Taylor who was 37 not out when play began, quickly dissolved, thanks to Ebadot. The tall right-armer, who snaps to attention and salutes when he takes a wicket, saluted twice when he bowled Taylor for 40. Then he dismissed Kyle Jamieson to leave New Zealand 160-7. Shoriful pulled off a brilliant diving catch at mid-wicket to complete the second dismissal. Taskin Ahmed then stepped in to help wrap up the New Zealand innings. He removed the other overnight batsman, allrounder Rachin Ravindra, for 16. Ravindra had edged a delivery from Ebadot between first slip and the wicketkeeper but this time the edge carried finer to keeper Liton Das. Taskin bowled Tim Southee (0) and Mehidy Hasan Miraz finished it off with the wicket of Trent Boult, who was brilliantly caught at deep mid-wicket by the substitute Taijul Islam. \"It's a long story, volleyball player to test cricketer,\" Ebadot said. \"But I'm a soldier of the Bangladesh Air Force and I know how to salute. \"On New Zealand soil over the last 11 years our brothers and our teams didn't get any wins. But when we came to New Zealand we set a goal. We raised our hands and said Yes, we have to do it and we can do it on New Zealand soil.\" \"New Zealand are test champions so if we raise our hands and beat New Zealand on New Zealand soil our next generation will be able to beat them too.\" Ebadot credits Bangladesh's West Indies-born bowling coach Ottis Gibson for his transformation as a fast bowler, for urging him to pitch the ball up on off stump. That was the key to Bangladesh's bowling success on the a docile pitch at Bay Oval, where New Zealand's shorter lengths were unsuccessful. \"We were short in all three facets,\" New Zealand captain Tom Latham said. \"Bangladesh showed us how to go about things on that wicket. They were able to build partnerships, to bowl well from both ends and build pressure and unfortunately we weren't able to do it for long enough.\" The second test begins at Christchurch on Sunday. (AP)","content":null,"pubDate":"2022-01-05 03:31:32","full_description":"Mount Maunganui (New Zealand), January 5 Fast bowler Ebadot Hossain took a career-best 6-46 as Bangladesh beat World Test Champion New Zealand by eight wickets in the first cricket test Wednesday, capturing its first-ever win in New Zealand. Ebadot had bowled Bangladesh to the brink of a famous victory by the end of the fourth day when he had figures of 4-39. He broke down the last of New Zealand's resistance with two quick wickets as the home team was dismissed in its second innings for 169, its lowest score against Bangladesh. New Zealand trailed by 130 runs on the first innings, leaving Bangladesh to score only 40 for victory. It lost two wickets in doing so but current captain Mominul Haque, top-scorer in the first innings, and former captain Mushfiqur Rahim were at the crease when Bangladesh reached 42-2. It was only Bangladesh's sixth test win away from home and its first test win over a team ranked in the top 5 ranked team: New Zealand is ranked No. 2 and Bangladesh No. 9. The result also brought to an end New Zealand's unbeaten streak in its last 17 tests at home. Ebadot, a former volleyball player who became a test cricketer after winning a fast bowling competition, had only 11 test wickets at an average of 81 when he came into this match as Bangladesh's third seamer. He took 1-75 in New Zealand's first innings of 328 but came into his own in the second innings, running through the middle order on Tuesday with the wickets of Devon Conway (13), Henry Nicholls (0), Tom Blundell (0) and Will Young (69). That left New Zealand 147-5 at the start of play Wednesday, only 17 ahead of Bangladesh. The possibility of any stern resistance by New Zealand, marshaled around veteran batsman Ross Taylor who was 37 not out when play began, quickly dissolved, thanks to Ebadot. The tall right-armer, who snaps to attention and salutes when he takes a wicket, saluted twice when he bowled Taylor for 40. Then he dismissed Kyle Jamieson to leave New Zealand 160-7. Shoriful pulled off a brilliant diving catch at mid-wicket to complete the second dismissal. Taskin Ahmed then stepped in to help wrap up the New Zealand innings. He removed the other overnight batsman, allrounder Rachin Ravindra, for 16. Ravindra had edged a delivery from Ebadot between first slip and the wicketkeeper but this time the edge carried finer to keeper Liton Das. Taskin bowled Tim Southee (0) and Mehidy Hasan Miraz finished it off with the wicket of Trent Boult, who was brilliantly caught at deep mid-wicket by the substitute Taijul Islam. “It's a long story, volleyball player to test cricketer,” Ebadot said. “But I'm a soldier of the Bangladesh Air Force and I know how to salute. “On New Zealand soil over the last 11 years our brothers and our teams didn't get any wins. But when we came to New Zealand we set a goal. We raised our hands and said Yes, we have to do it and we can do it on New Zealand soil.” “New Zealand are test champions so if we raise our hands and beat New Zealand on New Zealand soil our next generation will be able to beat them too.” Ebadot credits Bangladesh's West Indies-born bowling coach Ottis Gibson for his transformation as a fast bowler, for urging him to pitch the ball up on off stump. That was the key to Bangladesh's bowling success on the a docile pitch at Bay Oval, where New Zealand's shorter lengths were unsuccessful. “We were short in all three facets,” New Zealand captain Tom Latham said. “Bangladesh showed us how to go about things on that wicket. They were able to build partnerships, to bowl well from both ends and build pressure and unfortunately we weren't able to do it for long enough.” The second test begins at Christchurch on Sunday. (AP)","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_767998533.JPG","source_id":"tribuneindia"},{"title":"Cricket-Mominul hails Bangladesh&#039;s &#039;unbelievable&#039; win over NZ","link":"https://www.thestar.com.my/sport/cricket/2022/01/05/cricket-mominul-hails-bangladesh039s-039unbelievable039-win-over-nz","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Mominul Haque hailed Bangladesh's \"unbelievable\" win over New Zealand on Wednesday after they beat the world test champions by eight wickets to end the 'Black Caps' run of 17 matches without defeat on home soil. Read full story","content":null,"pubDate":"2022-01-05 03:25:00","full_description":"(Reuters) - Mominul Haque hailed Bangladesh's \"unbelievable\" win over New Zealand on Wednesday after they beat the world test champions by eight wickets to end the 'Black Caps' run of 17 matches without defeat on home soil. Seamer Ebadot Hossain took a career best 6-46 as the tourists dismissed New Zealand for 169 early on day five at Mount Maunganui and then knocked off the 40 runs for victory for the loss of two wickets. It was Bangladesh's first win in any format of the game in New Zealand and gave them a 1-0 lead in the two-match series. \"I can't describe it, it's unbelievable. I couldn't sleep yesterday because of the pressure,\" skipper Mominul told reporters. \"It was very important to win this test match. Two years ago, we didn't play that much test cricket, so we were keen to improve. \"I think it was a team performance, we did very in all three departments. Our bowlers used the moisture really well, and the batters did really well too. I said previously that we need to win these test matches for our legacy.\" Bangladesh had gone into the match focusing on the process rather than the result, he added. \"You have to have a clear mindset, before playing anywhere. If you're going out of the subcontinent, and you think to yourself that 'it will be tough,' then it will be tough,\" said Mominul. \"We didn't focus too much on the result of the test matches, we tried to focus on the process.\" The Bangladesh captain also praised the performance of Ebadot, saying he had worked really well over the last two or three years. \"He has come from the Air Force and used to be a volleyball player,\" Mominul added. \"Our coaching staff did a lot of work to support him and helped him bowl in the right areas, and it was an unbelievable spell from him.\" The second test of the series will be played at the Hagley Oval in Christchurch from Jan. 9-13. (Reporting by Aadi Nair in Bengaluru; Editing by Peter Rutherford)","image_url":null,"source_id":"thestar_my"},{"title":"Is Justin Langer being judged too harshly?","link":"https://www.news.com.au/sport/cricket/is-justin-langer-being-judged-too-harshly/video/7d98bfea3240067a8818e27037663de3","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Michael Vaughan and Kerry O'Keeffe discuss whether Australian coach Justin Langer should remain with the team or whether his tenure as coach should end.","content":null,"pubDate":"2022-01-05 02:40:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"‘Uncle Al’s’ hilarious Ashes introduction","link":"https://www.news.com.au/sport/uncle-als-hilarious-ashes-introduction/video/20d3d31bc083fa61f6b651235491a711","keywords":null,"creator":null,"video_url":null,"description":"Cricket fans were treated to something very special before the first ball of the Ashes Test in Sydney as “Uncle Al” stole the show.","content":null,"pubDate":"2022-01-05 02:36:04","full_description":null,"image_url":null,"source_id":"news"},{"title":"Final-over thrillers highlight opening day of Albany’s Southern Smash T20 tournament","link":"https://thewest.com.au/news/albany-advertiser/final-over-thrillers-highlight-opening-day-of-albanys-southern-smash-t20-tournament--c-5180359","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"Six teams took part in regional WA’s premier Twenty20 tournament on December 28 and 29, played on turf wickets at Albany’s cricket grounds in the Centennial Park Sporting Precinct.","content":null,"pubDate":"2022-01-05 02:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5180359/4d1165bc0e25b5436662c9c098f555651957544b-16x9-x0y250w4806h2703.jpg","source_id":"thewest"},{"title":"‘Where there’s a will... there’s relatives’: Fans, players lose it over hilarious Ashes moment","link":"https://www.foxsports.com.au/cricket/the-ashes/where-theres-a-will-theres-relatives-fans-players-lose-it-over-hilarious-ashes-moment/news-story/4aaceddd438d0a63f1a815b3d471cfbb","keywords":null,"creator":null,"video_url":null,"description":"Cricket were treated to an unexpected stand up comedy show during the pre-game ceremonies ahead the fourth Test at the SCG.","content":null,"pubDate":"2022-01-05 02:00:00","full_description":"Cricket fans were treated to an unexpected stand-up comedy show during the official pre-game ceremony ahead of the fourth Test at the SCG . Aboriginal elder Uncle Allen Madden delivered the traditional Welcome to Country but infused some of his own comedic stylings into it. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. The result was the “best Welcome to Country ever”, packed with dad jokes and one-liners that left the crowd and the players in stitches. You knew you were in for something different when Madden started his speech with: “For my first song …” Smith looking to break century drought | 02:57 READ MORE LIVE: ‘Not goot enough’ — Poms guilty of same tactical blunder RATHER BOWL TO KHAWAJA: Big Marsh mistake Warne fears selectors have made It prompted a laugh and round of applause from the Sydney crowd – Australian spinner Nathan Lyon was particularly amused. Madden later said there were only three things surer than this being Aboriginal land: “Coming, taxation, and going.” He finished with his best joke of the day: “There’s an old Aboriginal saying out there, and I think it’s very appropriate for you mob here today. They say where there’s a will, there’s relatives.” The SCG crowd and Australian cricket team were left in hysterics. Former Australian hockey player Georgie Parker posted: “This is the best welcome to country I’ve ever heard. I love Him.”","image_url":null,"source_id":"foxsports"},{"title":"How chat with Zaheer Khan put Shardul Thakur on path to become Lord Thakur - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMibmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9ob3ctY2hhdC13aXRoLXphaGVlci1raGFuLWhlbHBlZC1sb3JkLXNoYXJkdWwtdGhha3VyLTc3MDY2MDcv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"How chat with Zaheer Khan put Shardul Thakur on path to become Lord Thakur  The Indian ExpressIndia vs South Africa 2nd Test Highlights: India 85/2 at stumps on Day 2, lead by 58 runs  Times of IndiaHighlights IND vs SA 2nd Test, Day 2: India Lead by 58 Runs at Stumps, Shardul Thakur's 7-Fer Skittles Out So  India.comLive Cricket Score - South Africa vs India, 2nd Test, Day 2, Johannesburg | Cricbuzz.com - Cricbuzz  CricbuzzI am playing more of my natural game: Ashwin  The HinduView Full coverage on Google News","content":null,"pubDate":"2022-01-05 01:15:50","image_url":null,"source_id":"google"},{"title":"Cricket world stunned by historic, astonishing upset","link":"https://www.news.com.au/sport/cricket/cricket-world-stunned-as-world-champion-kiwis-knocked-off-in-huge-upset/news-story/883b1b43fcf2d3d393cf7f4af58bb99b","keywords":null,"creator":null,"video_url":null,"description":"After 21 painful years, Bangladesh have finally tasted victory in New Zealand in one of the most stunning upsets in Test cricket history.","content":null,"pubDate":"2022-01-05 01:08:00","full_description":"After 21 painful years, Bangladesh have finally tasted victory in New Zealand in one of the most stunning upsets in Test cricket history. Ever since 2001, a Bangladesh tour of New Zealand has ended with the same glum feeling on the trip home. Thirty-two times Bangladesh set foot on a New Zealand ground, and 32 times they walked off defeated. But not today. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . The NZ Herald reports an eight-wicket win over the Black Caps in Mount Maunganui will go down as one of the greatest moments in Bangladesh cricket history, and it’s exactly what they deserved. Dominant throughout the Test, Bangladesh continued their stunning performance on day five, claiming victory before lunch as they wrapped up the New Zealand tail with five wickets for 22 runs, before knocking off their fourth-innings target of 40 to claim a historic triumph. It’s just their sixth Test victory away from home, the previous five being two scalps against the West Indies, two over Zimbabwe and one against Sri Lanka. This will be sweeter than all of them – a triumph over the world Test champions; a team who had gone 17 games unbeaten at home, including crushing wins over India, England and Pakistan. And yet, that towering Test team – the best New Zealand has produced and which beat India in the final of the World Test Championship last year – came undone against a side who had only beaten Zimbabwe in their last 14 Tests. This was never meant to happen. A month ago, Bangladesh were walloped at home by Pakistan, including a dismal second-Test defeat where they were rolled for 87 in the first innings. None of their young batsmen made runs, and they were promptly installed as $21 outsiders to beat New Zealand. Then they got to Mount Maunganui, and those young batsmen who looked so overwhelmed at home looked so assured away. With only one player over 30 in their XI, and seven 26 or under, perhaps coach Russell Domingo was right when he optimistically proclaimed that his players would be lacking the mental scars accrued by veterans of many defeats in Aotearoa. Those players made the Black Caps bowlers toil in the field for 176.2 overs, making the Bay Oval wicket look like a road — a batsmen’s paradise, incapable of assistance for bowlers. Those players then made the Black Caps batsmen look like fools, destroying the hosts for 169 and proving that no, the wicket was not to be blamed – the players were. From the relative confidence of 2/136 late on day four, the Black Caps collapsed. Resuming on day five at 5/147, there was no resistance. Ross Taylor was bowled in the second over of the day, Kyle Jamieson caught in the fourth, Rachin Ravindra nicked off in the fifth, Tim Southee was yorked in the seventh and Trent Boult holed out in the 11th. Ebadot Hossain, a man who came into the Test with a bowling average of 81.5, ended with 6/46, each wicket accompanied by the Bangladesh Air Force member’s trademark salute. His efforts – the second-best figures by a Bangladeshi seamer - left his batsmen just 40 runs to make history. Seventeen overs later and Bangladesh walked off Bay Oval overjoyed, leaving the Black Caps shell-shocked. Their unbeaten run is over, their fear factor at home is greatly diminished, and their World Test Championship defence is in tatters. Cricket world reacts Journalist Melinda Farrell tweeted: “What a special moment for Bangladesh cricket, not to mention Test cricket.” Bangladesh cricket writer Mohammad Isam wrote: “For me personally, this Test win brings a strange emotion. I was in Christchurch in 2019 when the Test match got cancelled due to the Al Noor Mosque shooting. To see them win their next Test in New Zealand, is personally a special occasion.” Cricket reporter Daniel Brettig added: “Incredible that Bangladesh are even there when you consider this. Terrific stuff.” English journalist Chris Stocks said: “Congratulations Bangladesh. Hell of a result not only beating NZ but hammering them on their own patch.” Fellow English reporter Lawrence Booth called it “the greatest achievement in their (Bangladesh’s) history” while sports journalist Daniel Cherny tweeted: “If there has been a bigger upset in Test cricket, I cannot remember it.” With the NZ Herald Uncle Allen Madden stole the show on day one of the New Year’s Test in Sydney with “the best Welcome to Country ever”. Cricket fans were treated to something very special before the first ball of the Ashes Test in Sydney as “Uncle Al” stole the show. Just how bad has England been this Ashes? And how bad will things get if the end result is 5-0? Follow the day one action from the SCG.","image_url":null,"source_id":"news"},{"title":"Ebadot Hossain headlines Bangladesh's historic Test win | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTIwNTMwL2ViYWRvdC1ob3NzYWluLWhlYWRsaW5lcy1iYW5nbGFkZXNocy1oaXN0b3JpYy10ZXN0LXdpbi1jcmljYnV6emNvbdIBcGh0dHA6Ly9tLmNyaWNidXp6LmNvbS9hbXAvY3JpY2tldC1uZXdzLzEyMDUzMC9lYmFkb3QtaG9zc2Fpbi1oZWFkbGluZXMtYmFuZ2xhZGVzaHMtaGlzdG9yaWMtdGVzdC13aW4tY3JpY2J1enpjb20?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ebadot Hossain headlines Bangladesh's historic Test win | Cricbuzz.com - Cricbuzz  CricbuzzWatch: Bangladesh Just Took DRS For This. Is It The Worst Review Ever?  NDTV SportsHistoric! Bangladesh beat World Test Champions New Zealand for the first time in red ball cricket!  BT SportOur process was excellent, says Mahmud - Sentinelassam  The Sentinel AssamBangladesh tour of New Zealand, 2022: Ebadot's brilliant spell leaves New Zealand gasping | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-01-05 01:04:07","image_url":null,"source_id":"google"},{"title":"SL name interim coach for Zimbabwe ODI series","link":"https://www.thenews.com.pk/print/922582-sl-name-interim-coach-for-zimbabwe-odi-series","keywords":null,"creator":null,"video_url":null,"description":"COLOMBO: Sri Lanka on Tuesday named fast-bowling coach Rumesh Ratnayake as interim head coach for the upcoming home ODI series against Zimbabwe.The 58-year-old will coach the team for the series starting January 16, Sri Lanka Cricket said.Sri Lanka is yet to confirm a long-term replacement for...","content":null,"pubDate":"2022-01-05 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Ramiz, CM discuss PSL preparations","link":"https://www.thenews.com.pk/print/922575-ramiz-cm-discuss-psl-preparations","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: In order to pave the way for a successful holding of the Karachi leg of the Pakistan Super League seventh edition, Pakistan Cricket Board chairman Ramiz Raja on Tuesday held meetings with Sindh government’s top functionaries, including the Chief Minister Murad Ali Shah, to...","content":null,"pubDate":"2022-01-05 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Malan named Ireland cricket coach","link":"https://www.thenews.com.pk/print/922578-malan-named-ireland-cricket-coach","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN: Heinrich Malan was named the head coach of the Ireland men’s cricket team on Tuesday, filling the void left by Graham Ford who stepped down last November.The 40-year-old South African has been based in New Zealand for several years with his latest role coach of the Auckland...","content":null,"pubDate":"2022-01-05 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"PCB unveils nominees for 2021 awards","link":"https://www.thenews.com.pk/print/922577-pcb-unveils-nominees-for-2021-awards","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The Pakistan Cricket Board has unveiled the categories and the nominees for its annual ‘PCB Awards 2021 with pacer Shaheen Shah Afridi nominated in five categories, Hasan Ali and Mohammad Rizwan in three categories each and Babar Azam, Fawad Alam and Haris Rauf in two each.The...","content":null,"pubDate":"2022-01-05 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"PCB chairman likely to miss NA body's meeting today","link":"https://www.thenews.com.pk/print/922571-pcb-chairman-likely-to-miss-na-body-s-meeting-today","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pakistan Cricket Board chairman Ramiz Raja who spent a busy day in Karachi on Tuesday is unlikely to appear for briefing during the meeting of National Assembly Standing Committee on Inter-Provincial Coordination due to what is called pre-arranged meetings in the metropolitan city.The...","content":null,"pubDate":"2022-01-05 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Bangladesh in historic Test win over NZ","link":"https://www.perthnow.com.au/sport/cricket/bangladesh-in-historic-test-win-over-nz-c-5190025","keywords":null,"creator":["AAP"],"video_url":null,"description":"Bangladesh have beaten New Zealand by eight wickets on the fifth day of the first cricket Test at Bay Oval in Mount Maunganui.","content":null,"pubDate":"2022-01-05 00:50:06","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5190025/022aa99ed6321c150632685484c5772a1c5ed81f-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Bangladesh in historic Test win over NZ","link":"https://thewest.com.au/sport/cricket/bangladesh-in-historic-test-win-over-nz-c-5190027","keywords":null,"creator":["AAP"],"video_url":null,"description":"Bangladesh have beaten New Zealand by eight wickets on the fifth day of the first cricket Test at Bay Oval in Mount Maunganui.","content":null,"pubDate":"2022-01-05 00:50:06","full_description":"Bangladesh beat New Zealand for the first time in a Test at the 16th attempt with a stunning eight-wicket victory at Mount Maunganui that snapped the world champions' 17-match unbeaten run on home soil. Seamer Ebadot Hossain took 6-46 as Bangladesh dismissed the Black Caps for 169 on day five of the first Test at Bay Oval and the tourists knocked off the 40 runs for victory for the loss of two wickets. Bangladesh's first win in any format of the game in New Zealand gave them a 1-0 lead in the two-match series with the second match starting in Christchurch on Sunday. New Zealand resumed on 5-147 with a slender lead of 17 but were quickly on the back foot when Ebadot bowled Ross Taylor for 40 and removed Kyle Jamieson for a duck in his first two overs. Taskin Ahmed chipped in with his second wicket in the fifth over of the morning when he had allrounder Rachin Ravindra caught behind for 16 and the Black Caps were rocking on 160-8. Tim Southee had his middle stump removed in Taskin's next over and Trent Boult departed for eight when he holed out in the deep to end the innings. Shadman Islam scored the first runs of the chase but was caught behind for three and his fellow opener Najmul Hossain Shanto departed for 17 with victory in sight. It was left to captain Mominul Haque, who scored 13 not out, and the experienced Mushfiqur Rahim, unbeaten on five, to usher Bangladesh to their historic triumph.","image_url":"https://images.thewest.com.au/publication/C-5190027/022aa99ed6321c150632685484c5772a1c5ed81f-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Cricket loses it over hilarious Ashes intro","link":"https://www.cairnspost.com.au/sport/cricket/live-fourth-ashes-test-scores-updates-weather-in-sydney/news-story/c4f202070c4d639e9bfc00e836176f73","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"The Sydney Test kicks off today and that can mean only one thing — rain in the NSW capital.","content":null,"pubDate":"2022-01-05 00:44:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Cricket-Bangladesh beat New Zealand by eight wickets","link":"https://www.thestar.com.my/sport/cricket/2022/01/05/cricket-bangladesh-beat-new-zealand-by-eight-wickets","keywords":null,"creator":null,"video_url":null,"description":"WELLINGTON (Reuters) - Bangladesh beat New Zealand for the first time in a test match with an eight-wicket victory at Mount Maunganui on Wednesday, snapping the World Test Champions' 17-match unbeaten run on home soil. Read full story","content":null,"pubDate":"2022-01-05 00:31:00","full_description":"WELLINGTON (Reuters) - Bangladesh beat New Zealand for the first time in a test match at the 16th attempt with a stunning eight-wicket victory at Mount Maunganui on Wednesday that snapped the World Test Champions' 17-match unbeaten run on home soil. Seamer Ebadot Hossain took 6-46 as Bangladesh dismissed the Black Caps for 169 on day five of the first test at Bay Oval and the tourists knocked off the 40 runs for victory for the loss of two wickets. Bangladesh's first win in any format of the game in New Zealand gave them a 1-0 lead in the two-match series with the second match starting in Christchurch on Sunday. New Zealand resumed on 147-5 with a slender lead of 17 but were quickly on the back foot when Ebadot clean bowled Ross Taylor for 40 and removed Kyle Jamieson for a duck in his first two overs. Taskin Ahmed chipped in with his second wicket in the fifth over of the morning when he had all-rounder Rachin Ravindra caught behind for 16 and the Black Caps were rocking on 160-8. Tim Southee had his middle stump removed in Taskin's next over and Trent Boult departed for eight when he holed out in the deep to end the innings. Shadman Islam scored the first runs of the chase but was caught behind for three and his fellow opener Najmul Hossain Shanto departed for 17 with victory in sight. It was left to captain Mominul Haque, who scored 13 not out, and the experienced Mushfiqur Rahim, unbeaten on five, to usher Bangladesh to their historic triumph. (Reporting by Nick Mulvenney in Sydney; Editing by Himani Sarkar)","image_url":null,"source_id":"thestar_my"},{"title":"Racism in English cricket extends to protecting white players accused of match fixing, claims undercover investigator","link":"https://www.scmp.com/sport/cricket/article/3162105/racism-english-cricket-extends-protecting-white-players-accused-match?utm_source=rss_feed","keywords":null,"creator":["Nazvi Careem"],"video_url":null,"description":"The recent Yorkshire racism scandal that tarnished English cricket goes beyond insulting and humiliating minorities and also extends to match-fixing, according to an undercover investigator who has penetrated and embedded himself in the underbelly of corruption in the sport.The investigator, who prefers to remain anonymous because he continues to perform undercover work in sports corruption, said white players were largely ignored by authorities investigating suspicious activity in cricket,…","content":null,"pubDate":"2022-01-05 00:15:14","image_url":"https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/01/04/cdb4a5db-a59d-40a3-b32e-c30dcd62c2fa_ca802e86.jpg?itok=0PxAeTQz","source_id":"scmp"},{"title":"DA COSTA: Broad recalled as battered England tries to salvage some pride in fourth Ashes cricket Test","link":"https://torontosun.com/sports/other-sports/da-costa-broad-recalled-as-battered-england-tries-to-salvage-some-pride-in-fourth-ashes-cricket-test","keywords":null,"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-05 00:09:46","full_description":"Stuart Broad has been brought in to share the new ball with his old partner James Anderson as England tries to salvage some pride in the Ashes series that has all gone Australia’s way. The rampaging Baggy Greens have outplayed the visitors in every aspect of the game to take an unassailable 3-0 lead in the five-Test series. Australia’s captain Pat Cummins has said it’s his intention to complete a 5-0 whitewash while Joe Root’s sad-sack England will want to avoid this embarrassment. The fourth match moves to Sydney on Wednesday and the English selectors have finally granted Broad his chance to share the new ball with Anderson. The two have been England’s greatest new-ball bowlers since Fred Trueman and Brian Statham, and the reckless decision to drop them in the first Test in Brisbane even took the Australians by surprise. It was the first time since 2006 that neither of the pair was on the field in an Ashes encounter. Anderson showed his class by taking four wickets for 30 runs in the last Test while Broad was demoted to running in the drinks. “Only playing once has made this a very disappointing trip, one that has not met my personal expectations,” Broad wrote in his Mail on Sunday column. “The biggest frustration is losing the Ashes, being 3-0 down and feeling like I’ve not really done anything.’’ Broad comes in for fellow-seamer Ollie Robinson, who has been sidelined by a shoulder injury and is the only change from the team that was annihilated by an innings and 14 runs in Melbourne. Australia has also made just one change with Usman Khawaja replacing Travis Head, who sits out following a positive COVID test. The virus has also taken its toll on England’s coaching staff, including head coach Chris Silverwood. He has been replaced by his assistant Graham Thorpe for the Sydney encounter. Silverwood and Root have both come under fire for their team selection and pundits have asked for their removal. Silverwood will definitely lose his job while Root said he will decide on his status once the team returns home. THAKUR STARS FOR INDIA Shardul Thakur was at his sensational best as he single-handedly put India in a strong position in the second Test against South Africa at the Wanderers Stadium in Johannesburg. India, playing without injured skipper Virat Kohli, was reduced to 202 in its first innings but South Africa wasn’t able to cash in as the Proteas were bundled out for 229. At close on the second day India made 85 for two to take a 58-run lead. Two players fighting to keep their places on the team, Cheteshwar Pujara (35 not out) and Ajinkya Rahane (11 not out), were at the crease at close of play. Thakur grabbed seven for 61, his best Test figures, and he received a standing ovation from the Indian squad in an empty stadium. Before the game, wicket-keeper Quinton de Kock stunned his teammates and South African fans by retiring from Test cricket, but will continue playing in T20s and ODIs. The star wicket-keeper, who made his debut in 2014 and scored six centuries and 22 half centuries in 54 matches, said he wanted to spend more time with his family. De Kock and his wife Sasha are expecting their first child later this month. BANGLADESH EYES VICTORY New Zealand will be hoping Ross Taylor, one of the country’s greatest batsmen, will put up a huge score to guide it to safety against upstart Bangladesh in the first Test at Mount Maunganui. The 37-year-old Taylor announced before the start of the match that he will hang up his bat after this two-Test series and the upcoming white-ball tour of Australia and the Netherlands in February and March. In an exciting encounter, the home team made 328 and 147 for five with Taylor batting on 37 for a lead of 17 runs. The damage was done by 27-year-old right-arm pacer Ebadot Hossain, who took four wickets to put Bangladesh on the path to its first Test victory in New Zealand. Scores: New Zealand 328 and 147 for five (Will Young 69, Hossain four for 39). Bangladesh 458 (Mahmudul Hasan Joy 78, Najmul Hossain Shanto 64, Mominul Haque 88, Liton Das 86, Mahedy Hasan 47; Trent Boult four for 85).","image_url":null,"source_id":"torontosun"},{"title":"Ashes 2021-22: Pat Cummins’ calm captaincy strikes a chord with Australian Test team","link":"https://thewest.com.au/sport/ashes-2021-22-pat-cummins-calm-captaincy-strikes-a-chord-with-australian-test-team-c-5187902","keywords":null,"creator":["Ben Horne"],"video_url":null,"description":"Pat Cummins’ calm captaincy style has struck an immediate chord with teammates in the Australian Test team and drawn comparisons with an Aussie cricket legend.","content":null,"pubDate":"2022-01-04 23:51:29","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5187902/864818a30a1a0bd9584def83f2f5525561b0ba1b-16x9-x1y0w2446h1376.jpg","source_id":"thewest"},{"title":"Quality Time with Brad Haddin and 4WD Supa Centre – Ep. 4","link":"https://www.news.com.au/sport/quality-time-with-brad-haddin-and-4wd-supa-centre-ep-4/video/9dac32777b851ad422604ca132cfcd79","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Apart from his excellent skills as a wicketkeeper, Brendon's guest this week was also known for his attacking batting style, and it's no surprise he represented his country in 66 Tests.","content":null,"pubDate":"2022-01-04 23:28:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Fourth Ashes Test: Australia vs England LIVE!","link":"https://www.skysports.com/live-scores/cricket/australia-v-england/36456/commentary","keywords":null,"creator":null,"video_url":null,"description":"Updates from the fourth Ashes Test at the Sydney Cricket Ground as England look for their first win of the series.","content":null,"pubDate":"2022-01-04 23:25:00","full_description":null,"image_url":"https://e0.365dm.com/21/12/1920x1080/skysports-ap-newsroom-joe-root_5610072.jpg?20211210063821","source_id":"skysports"},{"title":"Cricket-Toss delayed by rain in fourth Ashes test","link":"https://www.thestar.com.my/sport/cricket/2022/01/05/cricket-toss-delayed-by-rain-in-fourth-ashes-test","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - The start of the fourth Ashes test between Australia and England will be delayed by at least 30 minutes because of heavy rainfall at the Sydney Cricket Ground on Wednesday morning. Read full story","content":null,"pubDate":"2022-01-04 23:14:00","full_description":"SYDNEY (Reuters) -Australia captain Pat Cummins won the toss and chose to bat first in the fourth Ashes test against England at the Sydney Cricket Ground (SCG) on Wednesday. The toss was delayed by 30 minutes after heavy early morning rain and there were still dark clouds over Sydney's Eastern suburbs when Cummins elected to send his openers in. \"It's a bit tempting with the clouds and a bit of weather about,\" said Australia skipper Pat Cummins. \"But I think the SCG has always been a bat first wicket and I don't see a lot different here. The runs are there if you can get them.\" Australia have an unassailable 3-0 lead in the five-match series after big wins in Brisbane, Adelaide and Melbourne leaving the tourists playing only for pride as they seek a first test win Down Under in 11 years. \"We'd have probably batted as well,\" said England skipper Joe Root. \"We've not been anywhere near our best, we accept that, but there's an opportunity here to turn that round.\" Both sides announced their teams on Tuesday. Australia brought Usman Khawaja into the middle order in place of Travis Head, who tested positive for COVID-19 but retained paceman Scott Boland, who took 6-7 in the second innings on debut in Melbourne. \"Ussy's played a lot of cricket here, he's on top of his game and he'll slot right in,\" Cummins added. With Ollie Robinson and Chris Woakes both struggling with shoulder problems, England recalled seamer Stuart Broad to bowl in tandem with James Anderson. The fifth test, originally scheduled for Perth, will take place in Hobart from Jan. 14-18. (Reporting by Nick Mulvenney, editing by Toby Davis)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/05/1431750.jpg","source_id":"thestar_my"}]}