{"newsArray":[{"title":"How To Watch MLC 2023 Free Live Streaming Online, TSK vs LAKR on JioCinema? Get TV Telecast Details of Texas Super Kings vs Los Angeles Knight Riders Major League Cricket 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-mlc-2023-free-live-streaming-online-tsk-vs-lakr-on-jiocinema-get-tv-telecast-details-of-texas-super-kings-vs-los-angeles-knight-riders-major-league-cricket-2023-match-5264355.html","keywords":null,"creator":null,"video_url":null,"description":"Some top stars from both sides would be in action in the inaugural match of the brand new T20 competition. Sunil Narine would be leading the Los Angeles Knight Riders while Texas Super Kings would be captained by Faf du Plessis.","content":"The Major League Cricket 2023 is set to kick start with Texas Super Kings taking on Los Angeles Knight Riders at the Grand Prairie Stadium, USA. The match is slated to start at 6:00 am IST (Indian Standard Time). Viacom18 has bagged the media rights of the tournament in India and the live telecast of this match will be available on Sports 18. Fans can also watch live streaming of this contest for free on the JioCinema app and website. MLC 2023 All Squads: Full Players List of All Major League Cricket T20 Franchises For Inaugural Edition. Texas Super Kings vs Los Angeles Knight Riders Live At the stroke of dawn 🌅 in 🇮🇳, beckons the dawn of a T20 extravaganza in the 🇺🇸! Texas Super Kings take on the Los Angeles Knight Riders to kick off the inaugural edition of #MajorLeagueCricket 🏏 Catch the action LIVE on #JioCinema & #Sports18 #MLConJioCinema #MLConSports18 pic.twitter.com/C4GKVeMKIF — JioCinema (@JioCinema) July 13, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-14 00:00:05","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Roosters’ big blow with Origin star ruled out; Dolphins set for halves switch: NRL Late Mail","link":"https://www.foxsports.com.au/nrl/nrl-premiership/kevvies-blow-as-flyer-goes-down-in-training-mishap-dogs-count-cost-of-blues-win-late-mail/news-story/7776a16f2133a4c353d24267bc37f993","keywords":null,"creator":null,"video_url":null,"description":"Roosters coach Trent Robinson has confirmed James Tedesco won’t back up for the Roosters after starring for the Blues on Wednesday night. Joey Manu will start at fullback.","content":"Roosters coach Trent Robinson has confirmed James Tedesco won’t back up for the Roosters after starring for the Blues on Wednesday night. Joey Manu will start at fullback. The Dolphins could be set for a late switch in the halves if scenes at Wednesday’s training are anything to go by. Elsewhere, the Broncos have suffered a big blow with Kevin Walters confirming winger Corey Oates went down with injury at training on Wednesday Round 20 NRL Jul 14 8:00pm AEST Knights Tigers MATCH CENTRE $1.26 $3.90 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 3:00pm AEST Bulldogs Broncos MATCH CENTRE $2.70 $1.47 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 5:30pm AEST Sea Eagles Cowboys MATCH CENTRE $2.25 $1.65 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 7:35pm AEST Roosters Storm MATCH CENTRE $2.50 $1.53 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 2:00pm AEST Warriors Sharks MATCH CENTRE $1.95 $1.85 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 4:05pm AEST Dolphins Panthers MATCH CENTRE $5.20 $1.16 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 6:15pm AEST Eels Titans MATCH CENTRE $1.27 $3.80 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES Watch every game of every round of the 2023 NRL Telstra Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >>> Oates was due to play his 200th NRL game against the Bulldogs but suffered a knee injury. “We lost a winger at training yesterday,” Walters said on SENQ 693am. “He’s injured his knee in a training incident so he won’t be available this weekend. “He’s off to see the surgeon and the specialist today to see if (he will miss) any time away from the game. “He certainly won’t be playing against the Bulldogs but we’re very fortunate that we have got great depth in a lot of positions. “That depth is being tested at the moment which I’m ok with. NSW star Josh Addo-Carr is in doubt for the Bulldogs after being taken out of Game III in the 77th minute with a hamstring injury. Meanwhile a host of State of Origin stars are in doubt after picking up knocks. Follow all the latest team news for Round 20 below: FRIDAY Newcastle Knights vs Wests Tigers at McDonald Jones Stadium, 8:00pm AEDT Knights team : 1. Kalyn Ponga 2. Dominic Young 19. Enari Tuala 4. Bradman Best 5. Greg Marzhew 6. Tyson Gamble 7. Jackson Hastings 8. Daniel Saifiti 9. Phoenix Crossland 10. Leo Thompson 11. Tyson Frizell 12. Lachlan Fitzgibbon 13. Adam Elliott 14. Kurt Mann 15. Jacob Saifiti 16. Jack Hetherington 17. Mathew Croker 18. Dylan Lucas 20. Brodie Jones Players Cut: 3. Dane Gagai 21. Hymel Hunt 22. Adam Clune LATE MAIL: Blues hero Bradman Best is in doubt after picking up a calf complaint on his Origin debut. According to the Daily Telegraph he complained of tightness at halftime. It could prompt Adam O’Brien to rest the centre, although the Knights coach sounds confident both he and fellow Origin teammate Jacob Saifiti will back up. “Bradman is in a bit of a purple patch at the moment with five tries in two weeks of footy,” O’Brien said on Thursday, suggesting the pair will be cleared to play. “They tell me that it’s easier to back up from Origin after two days as opposed to four days. We don’t have to make a decision right now, but we’ll make a really educated one.” The Knights will be without Dane Gagai though, seeing Enari Tuala join the starting team. Tigers team : 1. Jahream Bula 2. Asu Kepaoa 3. Starford To’a 4. Tommy Talau 5. Junior Tupou 6. Will Smith 7. Brandon Wakeham 8. Stefano Utoikamanu 9. Apisai Koroisau 10. David Klemmer 11. Isaiah Papali’i 12. John Bateman 13. Fonua Pole 14. Jake Simpkin 15. Shawn Blore 16. Alex Twal 17. Alex Seyfarth 18. Daine Laurie 19. Aistasi James Players Cut: 20. Tallyn Da Silva 21. Justin Matamua 22. Brent Naden LATE MAIL: Tallyn Da Silva is cut which is confirmation Apisai Koroisau will be good to return from a broken jaw. SATURDAY Canterbury-Bankstown Bulldogs vs Brisbane Broncos at Belmore Sports Ground, 3:00pm AEDT Bulldogs team : 1. Jake Averillo 2. Blake Wilson 3. Braidon Burns 4. Jacob Kiraz 5. Josh Addo-Carr 6. Matt Burton 7. Toby Sexton 8. Max King 9. Reed Mahoney 10. Raymond Faitala-Mariner 11. Jackson Topine 12. Jacob Preston 13. Corey Waddell 14. Kyle Flanagan 15. Kurtis Morrin 16. Tevita Pangai Junior 17. Jayden Okunbor 19. Fa’amanu Brown 20. Jeral Skelton 21. Reece Hoffman 22. Paul Alamoti 23. Chris Patolo LATE MAIL : Josh Addo-Carr looks set to miss the clash with the Broncos after suffering a hamstring injury in the final minutes of the Blues Origin victory. The winger was spotted on the bench with ice on his leg. Brad Fittler said he believed Addo-Carr was “alright” but the short turnaround means the Dogs will almost certainly rule him out. Broncos team : 1. Tristan Sailor 2. Corey Oates 3. Kotoni Staggs 4. Herbie Farnworth 5. Selwyn Cobbo 6. Ezra Mam 7. Adam Reynolds 8. Keenan Palasia 9. Billy Walters 10. Corey Jensen 11. Kurt Capewell 12. Brendan Piakura 13. Kobe Hetherington 14. Tyson Smoothy 15. Xavier Willison 16. Jesse Arthars 17. Martin Taupau 18. Deine Mariner 19. Patrick Carrigan 20. Jock Madden 21. Delouise Hoeter 22. Jordan Pereira LATE MAIL: Corey Oates will have to wait for his 200th game after suffering a knee injury at Broncos training on Wednesday. Kevin Walters confirmed the blow on radio and revealed Jesse Arthars will replace him in the side. Patrick Carrigan is the only representative player backing up for the Broncos and has been named at 20. Manly Sea Eagles vs North Queensland Cowboys at 4 Pines Park, 5:40pm AEDT Sea Eagles team : 1. Reuben Garrick 2. Jason Saab 3. Brad Parker 4. Tolutau Koula 5. Christian Tuipulotu 6. Josh Schuster 7. Daly Cherry-Evans 8. Taniela Paseka 9. Lachlan Croker 10. Toafofoa Sipley 11. Haumole Olakau’atu 12. Kelma Tuilagi 13. Jake Trbojevic 14. Dean Matterson 15. Aaron Woods 16. Ethan Bullemor 17. Josh Aloiai 18. Sean Keppie 19. Morgan Harper 20. Ray Tuaimalo-Vaega 21. Jakob Arthur 22. Gordon Chan Kum Tong Cowboys team : 1. Scott Drinkwater 2. Semi Valemei 3. Valentine Holmes 4. Peta Hiku 5. Murray Taulagi 6. Tom Dearden 7. Chad Townsend 8. Jordan McLean 9. Reece Robson 10. Coen Hess 11. Luciano Leilua 12. Jeremiah Nanai 13. Reuben Cotter 14. Jake Granville 15. Griffin Neame 16. Jason Taumalolo 17. Kulikefu Finefeuiaki 18. Kyle Feldt 19. Jamayne Taunoa-Brown 20. Zac Laybutt 21. Sam McIntyre 22. Riley Price 23. Ben Hampton 24. Brendan Elliot Sydney Roosters vs Melbourne Storm at Sydney Cricket Ground, 7:35pm AEDT Roosters team : 4. Joseph Manu 2. Daniel Tupou 3. Billy Smith 5. Joseph Suaalii 6. Luke Keary 7. Sandon Smith 8. Jared Waerea-Hargreaves 9. Jake Turpin 10. Lindsay Collins 11. Victor Radley 12. Nat Butcher 13. Nathan Brown 14. Brandon Smith 15. Egan Butcher 16. Siua Wong 17. Naufahu Whyte 18. Drew Hutchison 19. Terrell May 20. Corey Allan 21. Fetalaiga Pauga 22. Dylan Napa Players Cut: 1. James Tedesco LATE MAIL: Captain James Tedesco won’t back up from Origin Game III. Joseph Manu will shift to fullback. Coach Trent Robinson says this break for Tedesco has been planned for weeks. Storm team : 1. Nick Meaney 2. William Warbrick 3. Reimis Smith 4. Justin Olam 5. Xavier Coates 6. Cameron Munster 7. Jahrome Hughes 8. Tui Kamikamica 9. Harry Grant 10. Christian Welch 11. Trent Loiero 12. Nelson Asofa-Solomona 13. Josh King 14. Tyran Wishart 15. Tom Eisenhuth 16. Tariq Sims 17. Bronson Garlick 18. Grant Anderson 19. Alec MacDonald 20. Jayden Nikorima 21. Marion Seve 22. Chris Lewis 23. George Jennings SUNDAY Warriors vs Cronulla Sharks at Go Media Stadium, 2:00pm AEDT Warriors team : 1. Charnze Nicoll-Klokstad 2. Dallin Watene-Zelezniak 3. Rocco Berry 4. Adam Pompey 5. Marcelo Montoya 6. Luke Metcalf 7. Shaun Johnson 8. Addin Fonua-Blake 9. Wayde Egan 10. Mitchell Barnett 11. Jackson Ford 12. Josh Curran 13. Tohu Harris 14. Freddy Lussick 15. Bayley Sironen 16. Tom Ale 17. Dylan Walker 18. Kalani Going 20. Ronald Volkman 21. Taine Tuaupiki 22. Zyon Maiu’u 23. Viliami Vailea Sharks team : 1. William Kennedy 2. Sione Katoa 3. Jesse Ramien 4. Siosifa Talakai 5. Ronaldo Mulitalo 6. Matt Moylan 7. Nicho Hynes 8. Oregon Kaufusi 9. Blayke Brailey 10. Toby Rudolf 11. Briton Nikora 12. Teig Wilton 13. Cameron McInnes 14. Wade Graham 15. Thomas Hazelton 16. Jack Williams 17. Jesse Colquhoun 18. Connor Tracey 19. Kayal Iro 20. Braden Hamlin-Uele 21. Braydon Trindall 22. Tuku Hau Tapuha Dolphins vs Penrith Panthers at Kayo Stadium, 4:05pm AEDT Dolphins team : 1. Kodi Nikorima 2. Jamayne Isaako 3. Euan Aitken 4. Hamiso Tabuai-Fidow 5. Tesi Niu 6. Isaiya Katoa 7. Sean O’Sullivan 8. Jesse Bromwich 9. Harrison Graham 10. Kenny Bromwich 11. Felise Kaufusi 12. Connelly Lemuelu 13. Ray Stone 14. Herman Ese’ese 15. Mark Nicholls 16. Anthony Milford 17. Jarrod Wallace 18. Josh Kerr 19. Valynce Te Whare 20. Poasa Faamausili 21. Brenko Lee 22. Kurt Donoghoe LATE MAIL: Anthony Milford trained at five-eighth on Wednesday with Isaiya Katoa running around for the reserves, prompting speculation Wayne Bennett could pull a late switch on game day. Panthers team : 1. Dylan Edwards 2. Sunia Turuva 3. Izack Tago 4. Stephen Crichton 5. Brian To’o 6. Jarome Luai 7. Jack Cogger 8. Moses Leota 9. Mitch Kenny 10. James Fisher-Harris 11. Scott Sorensen 12. Liam Martin 13. Isaah Yeo 14. Soni Luke 15. Lindsay Smith 16. Spencer Leniu 17. Jaeman Salmon 18. Zac Hosking 19. Matt Eisenhuth 20. Luke Garner 21. Tyrone Peachey 22. Thomas Jenkins 23. Jesse McLean 24. Nathan Cleary LATE MAIL: Penrith coach Ivan Cleary has a big decision to make and reportedly is mulling over whether to rest his representative stars Stephen Crichton , Brian To’o , Liam Martin and Isaah Yeo . “We’ve got a system in place and some contingencies around that as well. We’ll make the decisions later,” Cleary said. The Panthers coach is confident though that son Nathan Cleary will return from a hamstring injury. “There’s a pretty good chance (he’ll play) I reckon … he’s tracking really well,” Ivan said on Wednesday. “No, not fast-tracking. This was the weekend that he was always aiming to play in. He’s gone well in his rehab, so we just have to see how the week goes.” Parramatta Eels vs Gold Coast Titans at CommBank Stadium, 6:15pm AEDT Eels team : 1. Clinton Gutherson 2. Maika Sivo 3. Will Penisini 4. Bailey Simonsson 5. Sean Russell 6. Daejarn Asi 7. Mitchell Moses 8. Reagan Campbell-Gillard 9. Brendan Hands 10. Junior Paulo 11. Shaun Lane 12. Bryce Cartwright 13. J’maine Hopgood 14. Luca Moretti 15. Joe Ofahengaue 16. Andrew Davey 17. Ryan Matterson 18. Ofahiki Ogden 19. Makahesi Makatoa 20. Waqa Blake 21. Matt Doorey 22. Haze Dunster 23. Isaac Lumelume Titans team : 1. AJ Brimson 2. Alofiana Khan-Pereira 3. Brian Kelly 4. Aaron Schoupp 5. Phillip Sami 6. Kieran Foran 7. Tanah Boyd 8. Moeaki Fotuaika 9. Sam Verrills 10. Tino Fa’asuamaleaui 11. David Fifita 12. Klese Haas 13. Isaac Liu 14. Jayden Campbell 15. Chris Randall 16. Erin Clark 17. Jojo Fifita 18. Iszac Fa’asumaleaui 19. Jacob Alick 20. Keano Kini 21. Kruise Leeming 22. Ken Maumalo 23. Tony Francis 24. Thomas Mikaele LATE MAIL: The Titans’ Origin stars have all been named to back up but David Fifita will be assessed after reportedly pulling up with back tightness. He was limited to just 33 minutes. Bye: Dragons, Rabbitohs, Raiders","pubDate":"2023-07-13 23:34:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket’s Big Three in talks to launch women’s Champions League","link":"https://www.smh.com.au/sport/cricket/cricket-s-big-three-in-talks-to-launch-women-s-champions-league-20230714-p5do6k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australia, India and England are in high-level talks to launch a women’s Twenty20 Champions League as soon as next year following the success of the first Women’s Premier League in India.","content":"Manchester: Australia, India and England are in high-level talks to launch a women’s Twenty20 Champions League as soon as next year, following the high-profile success of the first Women’s Premier League in India . Nick Hockley and Mike Baird, the Cricket Australia chief executive and chair, have been discussing the concept with their opposite numbers at the BCCI and the ECB in recent weeks, including meetings around the Lord’s Ashes Test and the World Test Championship final at the Oval . Jess Jonassen (centre) celebrates with her Australian teammates after catching Sophia Dunkley in the T20 match at Lord’s. Credit: Getty Images A CA spokesperson confirmed discussions were ongoing but declined to comment further when contacted by this masthead. More talks took place this week around the ICC’s annual conference in South Africa, where member nations have approved a proposal to hand the BCCI as much as 38 per cent of revenue from the recent $US3 billion ($4.35 billion) sale of the rights to global events. This is nearly double the 22 per cent India were allotted under the previous distribution deal, signed off in 2017. Among other determinations, T20 franchise leagues were given greater regulation including a minimum threshold of seven local players per team. Baird, who became the new chair of CA earlier this year , is set to join the ICC’s powerful finance and commercial affairs committee, placing him head to head with the BCCI’s influential secretary Jay Shah on the big questions of cricket economics. The WPL’s spectacle, featuring big crowds and large TV audiences after the BCCI sold rights to the event to Viacom18 for $US116.5 million ($169 million) over five years, has been a significant driver for the Champions League idea. It would be a far more significant development for the game than the announcement of equal prize money for men’s and women’s World Cups at the end of the Durban meeting. Unlike tennis or golf, the lifeblood of a cricketer’s career is contracts and match payments, which would rise considerably should the Champions League become a success. Introduction of the league, with broadcast rights revenue to be shared among the countries involved, would mimic the attempt to start a men’s T20 Champions League when the IPL was launched in 2008. That tournament, sold for nearly $US1 billion ($1.45 billion) to Star Sports, was abandoned after six editions as it failed to generate enough spectator interest to justify the high price tag. Its revenue was shared between India, Australia and South Africa, after England’s board dropped out of discussions. This time around, the concept of a women’s Champions League is seen as the logical next step to capitalise on the strength of the WPL, the WBBL and the Hundred competition in England. There is no suggestion that CA, the BCCI and the ECB are considering the relaunch of a men’s Champions League. Big crowds and high-quality cricket have been a hallmark of each of the last two women’s T20 World Cups also, in 2020 in Australia shortly before the outbreak of COVID-19, and then in South Africa earlier this year, where Australia again prevailed in a tight tussle against the hosts. It is possible that the tournament will also include teams from other leagues such as the Caribbean Premier League, but there is a desire to start the event in a focused manner and grow from there. Locations would be rotated, with match revenue from tickets and corporate hospitality to be retained by the host nation. Australia’s captain Alyssa Healy has spoken about the need for the women’s game to be supported by wider investment down development pathways in more nations. Meg Lanning’s dismissal for 35 was a big moment in the WPL final this year. Credit: Getty Images “I think it takes support and investment from the global bodies to invest in their women’s teams and their women’s pathways in particular,” Healy said earlier on the current Ashes tour. “There’s no secret to why this team has been successful for a long period of time, it’s because we’ve got great domestic pathways. “They were invested in a long time ago and it’s developed some amazing players. The likes of Annabel Sutherland and Phoebe Litchfield can almost come straight into international cricket and perform right away. That really helps, and I think a lot of nations are catching up, they’re doing some great things.” The Marylebone Cricket Club’s world cricket committee reached a similar conclusion at their recent meeting ahead of the Lord’s Ashes Test. “The growth of the women’s game must also be consistent with the growth of the game as a whole,” chair Mike Gatting said. “We need to ensure that nations are rewarded for their commitment to investing in both the men’s and women’s game alike, and a ring-fenced fund could be an important step here. “We have seen similar reports previously, which haven’t led to actions or tangible improvements. The WCC firmly believes that if we are to protect the game of cricket as a whole, immediate action must be taken to bring about significant transformation in the sport.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-13 22:38:32","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"2023 Sports Capital &amp; Equipment Programme to open on 17 July","link":"https://www.cricketireland.ie/news/article/2023-sports-capital-equipment-programme-to-open-on-17-july","keywords":null,"creator":null,"video_url":null,"description":"The Sports Capital and Equipment Programme (SCEP) is operated by the Irish Government and provides grants to assist in the development or refurbishment of sports facilities and the provision of sports equipment. It is part funded from the proceeds of the National Lottery.","content":"The 2023 round of the Programme will open for applications from 9am, Monday 17 July 2023 until 5pm, Friday 8 September 2023 and Cricket Ireland is urging all clubs based in the Republic of Ireland to consider, prepare, and apply ahead of the deadline. If they haven’t done so in previous rounds of the scheme, clubs must register with the programme in advance and the deadline for registration of a club is 5pm on Friday 25th August 2023. The Department have renewed the portal that is used to apply for funding and manage the drawdown of grants and it can be accessed at www.sportscapitalprogramme.ie To support clubs with their applications, Cricket Ireland in partnership with the various Provincial Unions, will deliver several guidance workshops, the details of which will be announced shortly. Outlined below are several underlined Useful Links that clubs are encouraged to visit if considering an application. Within them there are details about the programme, how to register and apply and video guide to making an application. 1. A guide to registration is available. 2. Frequently Asked Questions about the Programme 3. The 2023 Guide to making an application 4. A video guide to making an application 5. The 2020 Sports Capital Programme Scoring System and Assessment Procedures 6. The Sports Capital Programme Guide to Accessible Gym Equipment . For more information on #6 above, Cara - Sport Inclusion Ireland have created resource Factsheets on how to make your sports facilities, equipment and activities more accessible to people with disabilities. If your clubs are interested in applying and would like further information, feel free to contact richard.fahey@cricketireland.ie , emma.butler@cricketireland.ie or your Provincial Union.","pubDate":"2023-07-13 22:10:16","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Jaiswal, Rohit tons put India on top against Windies","link":"https://www.perthnow.com.au/sport/cricket/jaiswal-rohit-tons-put-india-on-top-against-windies-c-11274047","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Opening bats Yashasvi Jaiswal and captain Rohit Sharma have put India in a commanding position in the first Test against the West Indies in Dominica.","content":"Centuries by debutant Yashasvi Jaiswal and captain Rohit Sharma have given India a 162-run lead against the West Indies on day two of the first Test. Jaiswal carried his bat through the day to be 143 not out on debut. He and Rohit moved their opening partnership from 80 overnight to 229. But after a middle-session pick up, India crawled to stumps on 2-312. Virat Kohli (36 not out) was with Jaiswal. West Indies middle-order bat Alick Athanaze earned his maiden Test wicket when he got Rohit and broke the massive opening stand. Athanaze's 13 overs of off-spin compensated for the absence of Rahkeem Cornwall, who bowled his third maiden over before walking off in the morning session due to a chest infection. Jaiswal and Rohit were restricted to 66 runs in 32 overs in the first session, but that was enough to post India's first 100-run opening partnership in 11 Tests. After lunch, Jaiswal and Rohit showed more intent without really getting their timing right. They passed West Indies' total of 150 about six overs quicker, marking the first time India took a first-innings lead in a Test without losing a wicket. After the stand reached 200, Jaiswal became the 17th Indian man to score a Test century on debut, matching Rohit, who was the 14th in 2013. From the 215th ball he faced, Jaiswal paddle-swept a single to fine leg off Athanaze and celebrated exuberantly, raising his arms and leaping to punch the air. Soon after, the batters owned the highest opening partnership outside Asia when they eclipsed the 213 by Sunil Gavaskar and Chetan Chauhan in 1979 against England at the Oval. This was only India's third ever double-century opening stand outside Asia. Rohit finally posted his 10th Test hundred with a cover drive to the boundary, then was out next ball when he gloved Athanaze off his thigh to wicketkeeper Joshua Da Silva. Rohit made 103 off 221 balls with 10 boundaries and two sixes. Shubman Gill requested to drop in the order from opener to No.3 and made only six when he was caught by Athanaze at short second slip off spinner Jomel Warrican. India added 99 runs in the middle session and only 67 runs in 32 overs after tea. West Indies used up their third and last review trying to get Kohli out on nine but he didn't touch the ball. Without a review, West Indies rued what might have been when pacer Kemar Roach hit Jaiswal on his back pad on 133. West Indies appealed for leg before without success and ball tracking showed the ball would have hit leg stump. Kohli, content to help Jaiswal grind things out, took 81 balls to hit his first boundary and punched the air. By stumps, he'd used up 96 balls to make 36. He played second fiddle to Jaiswal, who had the highest score by an Indian man on debut outside Asia, and counting.","pubDate":"2023-07-13 22:05:50","image_url":"https://images.perthnow.com.au/publication/C-11274047/300c022dedf0b76f8771ed4ad4482c5c98b391c3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Zimbabwe cricket growth charms Andy Flower","link":"https://www.chronicle.co.zw/zimbabwe-cricket-growth-charms-andy-flower/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com CRICKET in Zimbabwe has been on a positive trajectory over the past couple of years and has seen a rise in followership with fans filling stadia whenever the national team plays. The steady growth of the sport in the country has charmed many from even outside the borders. The passion and love […]","content":"The Chronicle CRICKET in Zimbabwe has been on a positive trajectory over the past couple of years and has seen a rise in followership with fans filling stadia whenever the national team plays. The steady growth of the sport in the country has charmed many from even outside the borders. The passion and love that has been seen over the past years is testimony that the game is gaining popularity. One man who liked what he saw during the recently ended 2023 Men’s Cricket World Cup Qualifiers which were held in Zimbabwe is one of the country’s finest cricketers ever and an International Cricket Council (ICC) Hall of Famer, Andy Flower. Returning to Zimbabwe as part of the commentary team for the Qualifiers for the first time in over two decades, Flower was pleased with the growth of the sport in the country as a lot of work and effort has been put in to make sure that the game stays on top where it belongs. In an interview with ICC, Flower said he was pleased with what he saw at the country’s two biggest cricket stadiums, Queens Sports Club and Harare Sports Club having watched matches in Bulawayo and Harare where fans and the atmosphere was out of this world. He also noted a change in followership of the sport in the country as it has now become more popular to the black majority who have been showing appreciation for the sport unlike during their days as players. “Before I arrived in Zimbabwe, I would have had a lukewarm response to a question about the future of Zimbabwean cricket. Now that I’m just about to leave, I feel much more positive. They (fans) threw love out towards everyone in the ground, even the little bit of barracking with the opposition was done in good spirit, and that I think I’ll remember for years. “The energy in the crowd. The love for the game, the feeling of support and love for the players while they were playing and while the crowd was singing and dancing and loving their day, but also taking note of every single ball. It was really interesting for me to see the change in the demographic in the crowd. When we were playing, it was mostly a White crowd, and the change that I have seen after being away for so long is such a great change for Zimbabwe,” he said. Over the past year, Zimbabwe has been playing positive cricket under the stewardship of Dave Houghton. Some of the Chevrons’ notable victories include a final ball one run win over Pakistan in the T20 World Cup and also their first ODI victory over Australia Down Under, winning by three wickets after a Ryan Burl masterclass with the ball. The Chevrons also managed to reach the Super 12 stage of the T20 World Cup for the first time. Most recently, Zimbabwe beat the West Indies in their group match of the World Cup Qualifiers at Harare Sports Club. The positivity, courage and the mentality that the team now has is something that also caught Flower’s attention. Zimbabwe has enjoyed a good run in international cricket. “One thing that stands out for me is the confidence with which Zimbabwe are playing their cricket, and I think partly that comes from exposure to international matches, to international tournaments and series. I see a certainly strong spirit in them. They have some experienced players, they’ve got a few youngsters and it’ll be an interesting transition when they move on from some of their experienced players in the next few years. But I do see a fighting spirit. You see that in the way that they field,” said Flower He remains the only Zimbabwean to have made it to the ICC Hall of Fame and is considered one of the finest wicket-keeper batters of all time across the globe. In 63 Test matches, Flower scored 4 794 runs with a high score of 232 runs not out at a staggering average of 51,54 while in one day cricket, the 55-year-old scored 6 786 runs from 213 games with a high score of 145 runs and an average of 35,34. He has 16 international tons. – @brandon_malvin","pubDate":"2023-07-13 22:01:26","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping","link":"https://www.dailymail.co.uk/sport/cricket/article-12297173/Why-fast-bowling-crickets-primeval-act-does-not-just-spill-blood-gets-pumping.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Fast bowling has always been cricket's most primeval act, a skill that comes from the heart not the brain and takes practitioners to places beyond logic.","content":"Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping... that's why there will be a guttural roar when England's Mark Wood charges in to bowl at 97mph at Old Trafford next week Crowd gasped after Mark Wood’s fastest ball at Leeds — 96.5mph — was relayed Shoaib Akhtar holds record for a delivery clocked at 100.2mph against England Dennis Lillee rejoiced in terrorising batsmen with a bouncer at the rib-cage By Lawrence Booth for the Daily Mail Updated: 22:57, 13 July 2023 e-mail View comments On the day he sparked Australia ’s dramatic first innings collapse in the third Test, Mark Wood was asked what it was like to see his speed flashed up on Headingley’s big screen. He answered in two syllables: ‘Woo hoo!’ Frankly, what more was there to be said? Fast bowling has always been cricket’s most primeval act, a skill that comes from the heart not the brain and takes practitioners to places beyond logic. Frank Tyson, the England quick who terrorised Australia in 1954-55, spoke of the ‘glad animal action’ of bowling fast. On the other side of the Ashes divide, Dennis Lillee rejoiced in the ‘sheer “I can fly” exhilaration… it’s seeing that look of apprehension on your quarry’s face’. The language is bestial, of hunter and hunted. When Wood’s fastest ball at Leeds — 96.5mph — was relayed to the crowd, they gasped at the brutishness it conveyed. And, for Wood, it was confirmation that everything was in working order. Woo hoo indeed. Not that he came close to the world record. That is held by Pakistan’s Shoaib Akhtar, who in a World Cup game against England at Cape Town in 2003 was clocked at 100.2mph and was known as the Rawalpindi Express. Strange, then, that the delivery — in the words of Wisden — was ‘comfortably repulsed’ by Nick Knight. Fast bowler Mark Wood sparked Australia’s dramatic first innings collapse in the third Test Australia's Dennis Lillee rejoiced in terrorising batsmen with a bouncer at the rib-cage Since Shoaib, only two others have passed the mythical 100mph, both in one-day internationals for Australia — Brett Lee, in 2005 against New Zealand at Napier, and Shaun Tait, in 2010 against England at Lord’s. Wood says he can bowl faster than at Headingley and with good reason — last winter against Pakistan at Multan, he flew in at 97.3mph. One thing is certain. In a series already overflowing with subplots, all eyes will be on the speed gun when the Ashes resumes in Manchester next week. Central to the drama surrounding fast bowling is the threat of physical danger, as if cricket becomes something the Romans might have bayed for in the Colosseum. Jeff Thomson, the slingy Australian who was once said to have clocked 99.8mph at Perth’s WACA, was unapologetic about the edge this threat gave him. After putting an opponent in hospital for a week with a blow to the eye in a grade match, he admitted it was ‘frightening to see this bloke just screaming and shaking and the pitch splattered with blood as it poured through his fingers’. Ominously, though, he added: ‘I never let this sort of thing put me off.’ He was especially undeterred against England, whom he destroyed during the 1974-75 Ashes with the help of Lillee. ‘I thought, “Stuff that stiff-upper-lip crap”,’ said Thomson. ‘Let’s see how stiff it is when it’s split.’ Lillee was just as unflinching. ‘I try to hit a batsman in the rib-cage when I bowl a purposeful bouncer,’ he once said. ‘I want it to hurt, so the batsman doesn’t want to face me any more.’ The English players from that series, which Australia won 4-1, speak of shellshock, as if the balls were bullets and the crease a trench. David ‘Bumble’ Lloyd’s after-dinner story about having his inadequate box snapped open and, painfully, shut by Thomson has given that tour more humour than it deserves. Above all, there is little time for manoeuvre against fast bowling. While a 90mph delivery might slow to about 80mph before pitching, then to 72mph after it hits the turf, that still leaves the batsman just 0.4 seconds to react. Yet a study in Western Australia once suggested you need 0.3 of a second to make any sense of where the ball may land and another 0.3 of a second to execute your stroke. In other words, pre-meditation is the only option. As John Snow, the England fast bowler who helped Ray Illingworth’s side win the Ashes in Australia in 1970-71, put it: ‘Speed defeats reactions.’ You could see it in the way Australia’s lower order flinched at Wood, hoping to connect or simply survive. Only when Travis Head had his eye in on the third evening was Wood treated with anything other than apprehension. Fast bowling does not just spill blood, it gets it pumping like nothing else in cricket and like few activities in any sport. Perhaps the most famous over ever bowled was by Michael Holding to Geoffrey Boycott at Bridgetown, Barbados, in 1981, which ended with Boycott bowled for a duck. After he fell to Holding again in the second innings for a single, he was asked by a curious, and brave, waiter at the team hotel: ‘Did you see any of them?’ Australian paceman Jeff Thomson was unapologetic about the edge this threat gave him Boycott, owner of arguably the tightest defence in the game’s history, replied: ‘I saw them all. I just couldn’t play any of them.’ Others chose not to play any of them. On a brute of a pitch in Jamaica in 1976, Bishan Bedi declared India’s first innings on 306 for six to spare his lower order the ordeal of facing Holding, Wayne Daniel and Co. In the second innings, India got to 97 for two, but no further. Three wickets fell for none, while the remaining five batsmen were ‘absent hurt’. It was sobering to think West Indies had not yet embarked on their reign of terror, in which the psychological and physical grip exerted by their four-man attacks ensured they did not lose a Test series between 1980 and 1995. See off Holding and Andy Roberts and you had to contend with Joel Garner and Colin Croft. After them came Malcolm Marshall, Patrick Patterson, Curtly Ambrose and Courtney Walsh. There have been few more thrilling spells in England than the one sent down by Jofra Archer to Steve Smith in the 2019 Ashes Test at Lord’s. Hit on the head, Smith was ruled out of the next game due to concussion. The legend of Archer’s spell meant Smith recently pointed out on Twitter that Archer had not, in fact, taken his wicket. Only the toughest mentally survive the assault. Graham Gooch, one of the greatest players of pace, once said: ‘If I went out to start an innings thinking about being hit, I could not play the game. My entire technique would collapse.’ His England team-mate Robin Smith, another superb player of fast bowling, went for hypnosis after he had his jaw broken by West Indies’ Ian Bishop at Old Trafford in 1995. The hypnotist was Derren Brown and his techniques did the trick. Smith never feared fast bowling again and later explained his tactics to the Guardian: ‘You draw an imaginary line down the pitch, somewhere near the middle, and whenever the ball hits that line, you hit the f****** deck.’ Not all fast bowlers have been comfortable inflicting pain. England’s Peter Lever could never forget hitting New Zealand No 11 Ewen Chatfield on the left temple at Auckland in 1975, years before protective headwear. Chatfield collapsed to the ground and swallowed his tongue. For a few seconds his heart stopped beating and it needed quick work by England physio Bernie Thomas to save his life. ‘I honestly thought I had killed him,’ said Lever. ‘I felt sick and ashamed. All I could think when I got back to the pavilion was I wanted to retire.’ Len Pascoe, a rugged Australian quick, had similar thoughts after hitting India’s Sandeep Patil in the face in 1981. Until then, he had traded off fear, but the incident led to introspection. ‘The game’s not worth dying over,’ he said. ‘I was worried about what I was becoming. It wasn’t me.’ After the death of Australia batsman Phillip Hughes following a blow to his vertebral artery on the side of his neck in a Sheffield Shield game in 2014, research was done into the number of deaths caused by cricket. According to Peter Brukner, then Australia team doctor, and historian Tom Gara, there were 544 cricket-related deaths in Australia, Britain and New Zealand dating back to 1850, with most caused by a blow to the heart or head. Since their research covered only three countries, the true number is likely to be much higher. Batsmen these days, of course, have more protection thanks to the introduction of helmets in the late 1970s, though this also means they are less likely to sway out of the way of bouncers, paradoxically increasing the chances of being hit. Are fast bowlers getting faster? Fred Trueman of Yorkshire and England, who once described himself as ‘the greatest bloody fast bowler that ever drew breath’, would be appalled at the thought that he was not in the same category as Wood, even if footage suggests he was not. Yet fast bowling may be one area of human endeavour where progress is not plotted on a smooth curve. Harold Larwood, England’s Bodyline hero of 1932-33, was said to have touched 96mph, though the evidence for this is sketchy. Shoaib’s record, meanwhile, has remained intact for 20 years. Since fast bowling is about more than the speed of the approach, it is easy to see why bowlers are not simply getting quicker. Also important are a long final stride, a braced front leg and the speed of the arm. As Shoaib found, a hyperextending elbow can help, too. There is no one-size-fits-all, no identikit method of making a fast bowler. It can be a mysterious process, dependent on temperament and defying reason. It connects with fans at an elemental level and makes batsmen question their life choices. It is why, when the Ashes resume, there will be a guttural roar as Wood charges in to deliver his first ball. Share or comment on this article: Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 21:30:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/21/73195497-0-image-m-30_1689281790530.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 1st Test 2023: Yashasvi Jaiswal, Rohit Sharma's Centuries on Day 2 Pile More Misery on West Indies, India Lead By 162 Runs","link":"https://www.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-2023-yashasvi-jaiswal-rohit-sharmas-centuries-on-day-2-pile-more-misery-on-west-indies-india-lead-by-162-runs-5264338.html","keywords":null,"creator":null,"video_url":null,"description":"It was another day of India's dominance in this Test match with centuries from both openers laying the platform for a huge first innings total. West Indies had two successes with Alick Athanaze and Jomel Warrican amongst the wickets.","content":"India have dominated yet another day in this Test match, with the highlight of the performance being sparkling hundreds from Rohit Sharma and Yashasvi Jaiswal. While the Indian captain got to his 10th Test hundred, for Jaiswal, it was a historic first as he became the first Indian to score a Test century on debut in the West Indies, in addition to becoming the 17th overall from the country to get to the three-figure mark. Rohit departed after his hundred and West Indies gained a bit of momentum after they Shubman Gill (6) as well in a short span of time. But Jaiswal and Virat Kohli (36*) added 72 undefeated runs to help India finish Day 2 with a 162-run lead. Virat Kohli Completes 8500 Test Runs, Surpasses Virender Sehwag To Become Fifth-Highest Run-Scorer for India in Longest Format During IND vs WI 1st Test 2023. Yashasvi Jaiswal, Rohit Sharma Help India Dominate Day 2 India continues to dominate in Dominica!!! Jaiswal & Rohit are the stars with terrific hundreds then Kohli has been solid with 36* - lead by 162 runs in first innings during Day 2 stumps. pic.twitter.com/Wp7KUjQljv — Johns. (@CricCrazyJohns) July 13, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-13 21:29:27","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-1st-test-highlights-jaiswals-ton-on-debut-helps-india-reach-312-2-at-stumps-stretch-lead-to-162-12863972.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162","content":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162 India vs West Indies 1st Test Day 2 Highlights: IND 312/2; Yashasvi Jaiswal remains unbeaten on 143 off 350 balls with Virat Kohli batting on 36 and the unbroken partnership between the two worth 72 as India end the day 162 runs ahead of West Indies. FirstCricket Staff Last Updated:July 14, 2023 02:57:10 IST India vs West Indies, 1st Test Day 2 LIVE Score: India opener Yashasvi Jaiswal in action on Day 2 of the first Test against West Indies at the Windsor Park in Roseau, Dominica. AP FP commentary Quick Scorecard Full scorecard Ball by ball commentary West Indies Vs India At Windsor Park, Roseau, Dominica, 12 July, 2023 12 July, 2023 Starts 19:30 (IST) Stumps West Indies 150/10 (64.3 ov) 1st Test India 312/2 (113.0 ov) Live Blog Live Updates Highlights 02:56 (IST) That brings us to the end of our coverage of Day 2 of the first Test between West Indies and India at the Windsor Park in Roseau, Dominica. Do join us tomorrow for the third day's play. For now, this is Amit signing off, wishing you all a good night! Full Scorecard 02:52 (IST) India vs West Indies LIVE Score Yashasvi Jaiswal, who remained unbeaten on 143 at the close of play, speaks to Samuel Badree after stumps: “I think this knock was one of the emotional knock for me. I would like to thank each and everyone, especially selectors and Rohit bhai for giving me the chance to go and express myself. Wicket was difficult to bat on. I was taking to Rohit bhai and Virat bhaiya about scoring on this surface. It’s been pretty hot, and I have to keep thinking that I have to do it for the country. I was just enjoying my cricket. I love Test cricket because it is always going to test you and I love that challenge. I had prepared for it. We really worked hard on each and every part. (On the century celebration) It was really emotional, and I am proud of myself. This is just the start.\" Full Scorecard 02:45 (IST) India vs West Indies LIVE Score After 113 overs,India 312/2 ( Yashasvi Jaiswal 143 , Virat Kohli 36) STUMPS ON DAY 2: Yashasvi Jaiswal remains unbeaten on 143 in 350 deliveries, stitching a patient third-wicket partnership with Virat Kohli worth 72 as India end the day 162 runs ahead of the West Indies with eight wickets in hand! Barring a couple of hiccups shortly before the tea interval in which Rohit Sharma and Shubman Gill fell to spin in quick succession, the day well and truly belonged to the Indians, who did not lose a single wicket in two out of three seasons and are well placed to stretch their lead beyond the Windies' reach on the third day and go 1-0 up in the two-match series. Jaiswal, meanwhile, will be heading back to the team hotel dreaming about the possibility of becoming the first Indian batter to score a double-hundred on Test debut. Full Scorecard 02:28 (IST) India vs West Indies LIVE Score After 109 overs,India 302/2 ( Yashasvi Jaiswal 140 , Virat Kohli 29) FOUR! Virat Kohli punches the air in delight after collecting his first boundary after facing 81 deliveries! Drives the flighted delivery from Jomel Warrican outside off through the extra cover region for an easy boundary. The boundary also brings up the 300 for India . Full Scorecard 02:26 (IST) India vs West Indies LIVE Score After 108 overs,India 298/2 ( Yashasvi Jaiswal 140 , Virat Kohli 25) West Indies keeper Joshua Da Silva cops a painful blow while collecting the ball in Roach's 16th over. Apparently the ball had hit him on a taped-up finger and leads to the home team physio walking out to have a look. Meanwhile, Alzarri Joseph has left the field and he is replaced by left-arm seamer Raymond Reifer, who has bowled a solitary over so far today. Two singles off Reifer's over, the second of which takes Virat Kohli past Virender Sehwag's Test run-tally of 8,503 runs for India . Full Scorecard 02:14 (IST) India vs West Indies LIVE Score After 106 overs,India 296/2 ( Yashasvi Jaiswal 139 , Virat Kohli 24) Kohli collects a brace after steering the ball wide of the slip cordon off Roach's bowling at the start of the 105th over. FOUR! Jaiswal punches a length ball from Joseph outside off behind point to collect his 14th boundary, and the first of the innings in nearly 24 overs. India a hit away from 300 now. Another seven overs left to be bowled today. Full Scorecard 02:08 (IST) India vs West Indies LIVE Score After 104 overs,India 290/2 ( Yashasvi Jaiswal 135 , Virat Kohli 22) Jaiswal and Kohli collect a single each in Joseph's 13th over, and that brings up the fifty partnership for the third wicket . The pair have consumed 150 balls in the stand so far. Full Scorecard 02:07 (IST) India vs West Indies LIVE Score After 103 overs,India 288/2 ( Yashasvi Jaiswal 134 , Virat Kohli 21) Lucky escape for Yashasvi Jaiswal after a confident shout for LBW by Kemar Roach and the West Indians! Umpire Richard Kettleborough shakes his head, and Windies unfortunately are out of reviews! HawkEye shows three reds in favour of the bowling side , with Impact bang at the centre of the middle stump and the ball going on to hit middle and leg. Roach buries his head in disappointment, knowing he fully deserved the wicket. It's just been his day so far. Jaiswal sets off for a risky single in the next ball and manages to reach the non-striker's end despite a direct hit from mid off. Jaiswal, meanwhile, adds another feather to his cap, going past Mohammad Azharuddin's record for most deliveries faced by an Indian on Test debut. Azharuddin had faced 322 deliveries on debut against England at Kolkata's Eden Gardens in 1984. Full Scorecard 01:54 (IST) India vs West Indies LIVE Score After 102 overs,India 286/2 ( Yashasvi Jaiswal 133 , Virat Kohli 20) West Indies finally have decided to take the second new ball after the 100th over, with skipper Brathwaite opting to hand the brand new Dukes cherry to Kemar Roach and Alzarri Joseph. Roach appeals for an LBW against Kohli in the first delivery with the second new ball, with the umpire shaking his head and the ball appearing to slide down leg. Full Scorecard 01:47 (IST) India vs West Indies LIVE Score After 100 overs,India 282/2 ( Yashasvi Jaiswal 132 , Virat Kohli 18) Jermaine Blackwood, who bowls off-spin part time, comes in as the ninth bowling option for the West Indies in this innings. Concedes a single off his first delivery with Kohli working the ball through the midwicket region. Turns out to be a case of change from both ends with Kemar Roach steaming in from the other end. Kohli welcomes him into his new spell with a drive through the extra cover region that fetches him a brace. Jaiswal collects a brace off Blackwood in the following over with a brace off a cut in front of square. 100 overs up in the Indian innings. The visitors continue to collect runs at a steady pace, their scoring rate remaining below three throughout today. Full Scorecard Load More Highlights 02:45 (IST) India vs West Indies LIVE Score After 113 overs,India 312/2 ( Yashasvi Jaiswal 143 , Virat Kohli 36) STUMPS ON DAY 2: Yashasvi Jaiswal remains unbeaten on 143 in 350 deliveries, stitching a patient third-wicket partnership with Virat Kohli worth 72 as India end the day 162 runs ahead of the West Indies with eight wickets in hand! Barring a couple of hiccups shortly before the tea interval in which Rohit Sharma and Shubman Gill fell to spin in quick succession, the day well and truly belonged to the Indians, who did not lose a single wicket in two out of three seasons and are well placed to stretch their lead beyond the Windies' reach on the third day and go 1-0 up in the two-match series. Jaiswal, meanwhile, will be heading back to the team hotel dreaming about the possibility of becoming the first Indian batter to score a double-hundred on Test debut. 02:28 (IST) India vs West Indies LIVE Score After 109 overs,India 302/2 ( Yashasvi Jaiswal 140 , Virat Kohli 29) FOUR! Virat Kohli punches the air in delight after collecting his first boundary after facing 81 deliveries! Drives the flighted delivery from Jomel Warrican outside off through the extra cover region for an easy boundary. The boundary also brings up the 300 for India . 02:26 (IST) India vs West Indies LIVE Score After 108 overs,India 298/2 ( Yashasvi Jaiswal 140 , Virat Kohli 25) West Indies keeper Joshua Da Silva cops a painful blow while collecting the ball in Roach's 16th over. Apparently the ball had hit him on a taped-up finger and leads to the home team physio walking out to have a look. Meanwhile, Alzarri Joseph has left the field and he is replaced by left-arm seamer Raymond Reifer, who has bowled a solitary over so far today. Two singles off Reifer's over, the second of which takes Virat Kohli past Virender Sehwag's Test run-tally of 8,503 runs for India . 02:08 (IST) India vs West Indies LIVE Score After 104 overs,India 290/2 ( Yashasvi Jaiswal 135 , Virat Kohli 22) Jaiswal and Kohli collect a single each in Joseph's 13th over, and that brings up the fifty partnership for the third wicket . The pair have consumed 150 balls in the stand so far. 02:07 (IST) India vs West Indies LIVE Score After 103 overs,India 288/2 ( Yashasvi Jaiswal 134 , Virat Kohli 21) Lucky escape for Yashasvi Jaiswal after a confident shout for LBW by Kemar Roach and the West Indians! Umpire Richard Kettleborough shakes his head, and Windies unfortunately are out of reviews! HawkEye shows three reds in favour of the bowling side , with Impact bang at the centre of the middle stump and the ball going on to hit middle and leg. Roach buries his head in disappointment, knowing he fully deserved the wicket. It's just been his day so far. Jaiswal sets off for a risky single in the next ball and manages to reach the non-striker's end despite a direct hit from mid off. Jaiswal, meanwhile, adds another feather to his cap, going past Mohammad Azharuddin's record for most deliveries faced by an Indian on Test debut. Azharuddin had faced 322 deliveries on debut against England at Kolkata's Eden Gardens in 1984. 00:19 (IST) IND vs WI LIVE Cricket Score After 81 overs,India 245/2 ( Yashasvi Jaiswal 116 , Virat Kohli 4) TEA ON DAY 2: West Indies claw back with the wickets of Rohit Sharma and Shubman Gill, both of whom fall to spin towards the end of the second session, though India still are well ahead of the hosts with a lead worth 95 and a well set Yashasvi Jaiswal at the crease. The second new ball is now available, but Windies skipper Kraigg Brathwaite is yet to take it. They might at the start of the evening session. Meanwhile, the Windsor Park surface is starting to really assist the spinners, and while the Indian batters might face a challenge from the likes of Jomel Warrican and Alick Athanaze, the development might just get Ravichandran Ashwin and Ravindra Jadeja a lot more excited. 00:06 (IST) IND vs WI LIVE Cricket Score OUT! Athanaze is part of another dismissal, this time taking a regulation catch at gully after Gill gets a nick off Warrican's bowling while attemping a defensive push. Not the best of starts for him at the No 3 position as he departs for 6. IND 240/2 Gill c Athanaze b Warrican 6(11) 00:02 (IST) IND vs WI LIVE Cricket Score OUT! Rohit departs right after bringing up his century as Alick Athanaze gets his maiden Test wicket on debut! Brathwaite goes for the review after the appeal for a catch by the keeper is turned down, and UltraEdge shows the ball brushing Rohit's glove before taking a deflection off his pad and landing between Da Silva's gloves. West Indies finally break the mammoth opening stand shortly before tea on the second day. Shubman Gill, batting at No 3 for the first time, makes his way to the centre. IND 229/1 in 76 Rohit c Da Silva b Athanaze 103(221) 23:53 (IST) IND vs WI LIVE Cricket Score FOUR! And now Rohit Sharma brings up his century — his 10th in Tests — shortly after Yashasvi Jaiswal brings up the milestone, driving a full toss from Athanaze through the covers. Reaches the milestone in 220 deliveries, collecting 10 fours and two maximums along the way. This is only his second ton away from home after his 127 against England at The Oval. IND 229/1 after 75.3 23:23 (IST) IND vs WI LIVE Cricket Score CENTURY ON TEST DEBUT FOR YASHASVI JAISWAL! What a start to the southpaw's international career! Brings up the milestone with a single off Alick Athanaze, taking 215 deliveries to bring up the milestone. Jaiswal thus becomes the 17th Indian batter to score a century on Test debut. IND 205/0 23:19 (IST) IND vs WI LIVE Cricket Score Yashasvi Jaiswal brings up 200 of the opening partnership with skipper Rohit Sharma with a single off Kemar Roach right after the drinks interval. The single also takes him to 99! IND 200/0; lead by 50 22:37 (IST) West Indies vs India LIVE Score After 61 overs,India 167/0 ( Yashasvi Jaiswal 78 , Rohit Sharma (C) 73) FOUR! Full and wide from Holder, and Jaiswal comfortably drives this behind point, joining Rohit in the 70s and bringing up India's highest opening partnership in the West Indies ! Jaiswal collects another boundary later in the 61st over, this time slashing a shorter delivery outside off but targetting the same region to move to 78. 22:34 (IST) West Indies vs India LIVE Score After 58 overs,India 151/0 ( Yashasvi Jaiswal 67 , Rohit Sharma (C) 68) Jaiswal looks to attack Warrican in the 58th over, dancing down the track in the first delivery only to push it for a dot and getting an inside edge while attempting a drive in the next delivery, coming back for a second to bring up the 150 for the visitors. He then collects a single to put India in the lead . 21:35 (IST) India vs West Indies LIVE Score After 55 overs,India 146/0 ( Yashasvi Jaiswal 62 , Rohit Sharma (C) 68) LUNCH ON DAY 2 : Rohit Sharma and Yashasvi Jaiswal continue to stand strong, both bringing up their half-centuries and stretching their partnership past the century mark as India head to the lunch interval on 146 for no loss , trailing by just four with all 10 wickets in hand. Rohit and Jaiswal have certainly been a lot more cautious in the morning session, scoring at less than three-an-over. Windies skipper Brathwaite decides to give debutant Alick Athanaze the final over of the session, and the part-time off-spinner concedes a couple of singles. 20:42 (IST) India vs West Indies LIVE Score FIFTY! India skipper Rohit Sharma gets to his 15th half-century in Test cricket! It's been a calm and composed knock from the Mumbai cricketer, and more importantly, he has been leading his team from the front here. IND 118/0 20:18 (IST) India vs West Indies LIVE Score FOUR! Pulled away in front of square by Jaiswal off Alzarri Joseph, and that brings up a half-century on international debut for the southpaw from Mumbai! Jaiswal took his time to get off the mark yesterday, but has looked a completely different batter once settled. Also brings up the century opening stand with Rohit Sharma. IND 103/0 Day 1 report: India will look to consolidate their position in the first Test against West Indies in Dominica, when they take field on Thursday for Day 2. The visitors were clinical in their approach on Wednesday after being asked to field first, with Ravichandran Ashwin, returning to the side, finishing with figures of 5/60 to see Windies off for 150. He was well-supported by fellow spin-bowling all-rounder Ravindra Jadeja, who collected three wickets for 26 runs. This was Ashwin’s 33rd five-fer in Test cricket, as well as his fifth against Windies since he made his Test debut against this very side in 2011. Barring debutant Alick Athanaze (47), none of the West Indian batters were able to convert starts into big knocks. Local boy Athanaze narrowly missed out on a half-century on Test debut, getting dismissed by Ashwin shortly before tea on the opening day. And in their first innings reply, India were 80/0 after 23 overs at stumps, with debutant Yashasvi Jaiswal (40*) and his skipper Rohit Sharma (30*) at the other end. Published on: July 13, 2023 18:01:28 IST Tags: Cricket India Vs West Indies Rohit Sharma Yashasvi Jaiswal Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-07-13 21:27:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/07/Yashasvi-Jaiswal-IND-WI-Dominica-Day-2-AP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI, 1st Test, Day 2: दूसरे दिन भारत 312/2, जायसवाल 143 रन पर नाबाद","link":"https://sports.ndtv.com/hindi/cricket/india-vs-west-indies-1st-test-day-2-live-score-updates-4204323#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, Day 2: आखिरी सीजन में विराट और जायसवाल ने पिच पर एकदम लंगर डालकर बल्लेबाजी की. खासकर विराट ने पूरी तरह से पिच पर जमने को प्राथमिकता दी. और ये दोनों अभी तक तीसरे विकेट के लिए नाबाद 72 रन की साझेदारी कर चुके हैं.","content":"IND vs WI 1st Test, Day 2: दूसरे दिन का आकर्षण पूरी तरह से यशस्वी जायसवाल की पारी रही विंडीज के खिलाफ बुधवार से शुरू हुई दो टेस्ट मैचों की सीरीज के पहले टेस्ट के दूसरे दिन वीरवार को मेहमान भारतीय टीम ने विंडीज पर शिकंजा कसते हुए दिन का खेल खत्म होने पर 2 विकेट पर 312 रन बना लिए हैं. पहले ही टेस्ट में शतक बनाने वाले यशस्वी जायसवाल 143 और विराट कोहली 36 रन बनाकर पिच पर जमे हुए हैं. इस तरह भारत ने पहली पारी के आधार पर फिलहाल 162 रन की बढ़त हासिल कर ली. आखिरी सेशन में विंडीज के गेंदबाज कोई विकेट नहीं ले सके. हालांकि, केमार रोच की एक गेंद पर जायसवाल एलबीडब्ल्यू आउट थे, लेकिन जब अंपायर ने उन्हें नॉटआउट दिया, तो मेजबान टीम के रिव्यू खत्म हो चुके थे. बहरहाल, इस आखिरी सेशन में विराट और जायसवाल ने पिच पर एकदम लंगर डालकर बल्लेबाजी की. खासकर विराट ने पूरी तरह से पिच पर जमने को प्राथमिकता दी. और ये दोनों अभी तक तीसरे विकेट के लिए नाबाद 72 रन की साझेदारी कर चुके हैं. इससे पहले चायकाल के समय भारत ने अपनी पहली पारी में 2 विकेट पर 244 रन बना लिए थे. इस समय ओपनर यशस्वी जायसवाल 116 और विराट कोहली 4 रन बनाकर क्रीज पर जमे हुए थे. दूसरे सेशन में जहां करियर का पहला टेस्ट खेल रहे लेफ्टी बल्लेबाज यशस्वी जायसवाल ने शतक जड़ा, तो कप्तान रोहित शर्मा भी करियर का 10वां शतक बनाने में कामयाब रहे. हालांकि, रोहित शतक बनाने के कुछ देर बाद आउट हो गए, लेकिन उन्होंने जायसवाल के साथ पहले विकेट के लिए 229 रन की साझेदारी करके भारत के विशाल स्कोर की मजबूत आधारशिला रख दी. भारत के 2 विकेट गिर चुके हैं. अगले बल्लेबाज शुभमन गिल 6 ही रन बना सके. विंडीज के लिए एक विकेट अथांजे, तो एक वारिकैन ने लिया. और दिन भर में भारत के गिरने वाले बस यही दो विकेट रहे. शुरुआती सेशन की बात करें, तो भारत ने मेजबानों पर अपना शिकंजा और कसते हुए अपनी पहली पारी में बिना नुकसान के 146 रन बनाए थे. और इस समय भारत पहली पारी में विंडीज से सिर्फ 4 ही रन पीछे था.. वीरवार को भारत ने अपने बुधवार के स्कोर बिना नुकसान के 80 रन से आगे खेलना शुरू किया. और दोनों ही नाबाद बल्लेबाजों बिना कोई उतावलापन दिखाए हुए पिच पर टिककर बल्लेबाजी की. एक-दो जोरदार अपीलों को छोड़ दें, तो विंडीज के बॉलर रोहित और जायसवाल पर बिल्कुल भी असर नहीं डाल सके. जायसवाल अर्द्धशतक ने पहले चौके जड़कर अर्द्धशतक पूरा किया, तो उसके कुछ देर बाद रोहित ने भी पचासा जड़ दिया. लंच के समय कप्तान रोहित 68 और जायसवाल 62 रन बनाकर क्रीज पर जमे हुए थे. मैच के पहले दिन टीम इंडिया मेजबान टीम को उसकी पहली पारी में 150 रन पर समेटने के बाद दिन का खेल समाप्त होने पर अपनी पहली पारी में बिना किसी नुकसान के 80 रन बना लिए थे. तब रोहित शर्मा नाबाद 30 और जायसवाल बिना आउट हुए 40 रन बनाकर पिच पर जमे हए थे. इस टेस्ट के जरिए यशस्वी जायसवाल और इशान किशन अपने टेस्ट करियर का आगाज किया रोहित शर्मा (कप्तान) 2. यशस्वी जायसवाल 3. शुभमन गिल 4. विराट कोहली, 5. अजिंक्य रहाणे 6. रवींद्र जडेजा 7. इशान किशन 8. आर. अश्विन 9. शार्दूल ठाकुर 10. जयदेव उनाडकट11. मोहम्मद सिराज 1, क्रेग ब्रैथवेट (कप्तान) 2, तेजनारायण चंद्रपॉल 3. रेमन रीफर 4, जर्मेन ब्लैकवुड 5. एलिक अथानाज़ 6. जोशुआ डा सिल्वा (विकेट कीपर) 7. जेसन होल्डर 8. केमार रोच 9. अल्ज़ारी जोसफ 10. रकीम कोर्नवाल 11. जोमेल वारिकन| पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-07-13 21:19:48","image_url":"https://c.ndtvimg.com/2023-07/gc2dbt7_s_625x300_13_July_23.jpg?im=FeatureCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"How To Watch MLC 2023 Free Live Streaming Online, TSK vs LAKR on JioCinema? Get TV Telecast Details of Texas Super Kings vs Los Angeles Knight Riders Major League Cricket 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-mlc-2023-free-live-streaming-online-tsk-vs-lakr-on-jiocinema-get-tv-telecast-details-of-texas-super-kings-vs-los-angeles-knight-riders-major-league-cricket-2023-match-5264355.html","keywords":null,"creator":null,"video_url":null,"description":"Some top stars from both sides would be in action in the inaugural match of the brand new T20 competition. Sunil Narine would be leading the Los Angeles Knight Riders while Texas Super Kings would be captained by Faf du Plessis.","content":"The Major League Cricket 2023 is set to kick start with Texas Super Kings taking on Los Angeles Knight Riders at the Grand Prairie Stadium, USA. The match is slated to start at 6:00 am IST (Indian Standard Time). Viacom18 has bagged the media rights of the tournament in India and the live telecast of this match will be available on Sports 18. Fans can also watch live streaming of this contest for free on the JioCinema app and website. MLC 2023 All Squads: Full Players List of All Major League Cricket T20 Franchises For Inaugural Edition. Texas Super Kings vs Los Angeles Knight Riders Live At the stroke of dawn 🌅 in 🇮🇳, beckons the dawn of a T20 extravaganza in the 🇺🇸! Texas Super Kings take on the Los Angeles Knight Riders to kick off the inaugural edition of #MajorLeagueCricket 🏏 Catch the action LIVE on #JioCinema & #Sports18 #MLConJioCinema #MLConSports18 pic.twitter.com/C4GKVeMKIF — JioCinema (@JioCinema) July 13, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-14 00:00:05","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Roosters’ big blow with Origin star ruled out; Dolphins set for halves switch: NRL Late Mail","link":"https://www.foxsports.com.au/nrl/nrl-premiership/kevvies-blow-as-flyer-goes-down-in-training-mishap-dogs-count-cost-of-blues-win-late-mail/news-story/7776a16f2133a4c353d24267bc37f993","keywords":null,"creator":null,"video_url":null,"description":"Roosters coach Trent Robinson has confirmed James Tedesco won’t back up for the Roosters after starring for the Blues on Wednesday night. Joey Manu will start at fullback.","content":"Roosters coach Trent Robinson has confirmed James Tedesco won’t back up for the Roosters after starring for the Blues on Wednesday night. Joey Manu will start at fullback. The Dolphins could be set for a late switch in the halves if scenes at Wednesday’s training are anything to go by. Elsewhere, the Broncos have suffered a big blow with Kevin Walters confirming winger Corey Oates went down with injury at training on Wednesday Round 20 NRL Jul 14 8:00pm AEST Knights Tigers MATCH CENTRE $1.26 $3.90 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 3:00pm AEST Bulldogs Broncos MATCH CENTRE $2.70 $1.47 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 5:30pm AEST Sea Eagles Cowboys MATCH CENTRE $2.25 $1.65 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 7:35pm AEST Roosters Storm MATCH CENTRE $2.50 $1.53 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 2:00pm AEST Warriors Sharks MATCH CENTRE $1.95 $1.85 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 4:05pm AEST Dolphins Panthers MATCH CENTRE $5.20 $1.16 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 6:15pm AEST Eels Titans MATCH CENTRE $1.27 $3.80 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES Watch every game of every round of the 2023 NRL Telstra Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >>> Oates was due to play his 200th NRL game against the Bulldogs but suffered a knee injury. “We lost a winger at training yesterday,” Walters said on SENQ 693am. “He’s injured his knee in a training incident so he won’t be available this weekend. “He’s off to see the surgeon and the specialist today to see if (he will miss) any time away from the game. “He certainly won’t be playing against the Bulldogs but we’re very fortunate that we have got great depth in a lot of positions. “That depth is being tested at the moment which I’m ok with. NSW star Josh Addo-Carr is in doubt for the Bulldogs after being taken out of Game III in the 77th minute with a hamstring injury. Meanwhile a host of State of Origin stars are in doubt after picking up knocks. Follow all the latest team news for Round 20 below: FRIDAY Newcastle Knights vs Wests Tigers at McDonald Jones Stadium, 8:00pm AEDT Knights team : 1. Kalyn Ponga 2. Dominic Young 19. Enari Tuala 4. Bradman Best 5. Greg Marzhew 6. Tyson Gamble 7. Jackson Hastings 8. Daniel Saifiti 9. Phoenix Crossland 10. Leo Thompson 11. Tyson Frizell 12. Lachlan Fitzgibbon 13. Adam Elliott 14. Kurt Mann 15. Jacob Saifiti 16. Jack Hetherington 17. Mathew Croker 18. Dylan Lucas 20. Brodie Jones Players Cut: 3. Dane Gagai 21. Hymel Hunt 22. Adam Clune LATE MAIL: Blues hero Bradman Best is in doubt after picking up a calf complaint on his Origin debut. According to the Daily Telegraph he complained of tightness at halftime. It could prompt Adam O’Brien to rest the centre, although the Knights coach sounds confident both he and fellow Origin teammate Jacob Saifiti will back up. “Bradman is in a bit of a purple patch at the moment with five tries in two weeks of footy,” O’Brien said on Thursday, suggesting the pair will be cleared to play. “They tell me that it’s easier to back up from Origin after two days as opposed to four days. We don’t have to make a decision right now, but we’ll make a really educated one.” The Knights will be without Dane Gagai though, seeing Enari Tuala join the starting team. Tigers team : 1. Jahream Bula 2. Asu Kepaoa 3. Starford To’a 4. Tommy Talau 5. Junior Tupou 6. Will Smith 7. Brandon Wakeham 8. Stefano Utoikamanu 9. Apisai Koroisau 10. David Klemmer 11. Isaiah Papali’i 12. John Bateman 13. Fonua Pole 14. Jake Simpkin 15. Shawn Blore 16. Alex Twal 17. Alex Seyfarth 18. Daine Laurie 19. Aistasi James Players Cut: 20. Tallyn Da Silva 21. Justin Matamua 22. Brent Naden LATE MAIL: Tallyn Da Silva is cut which is confirmation Apisai Koroisau will be good to return from a broken jaw. SATURDAY Canterbury-Bankstown Bulldogs vs Brisbane Broncos at Belmore Sports Ground, 3:00pm AEDT Bulldogs team : 1. Jake Averillo 2. Blake Wilson 3. Braidon Burns 4. Jacob Kiraz 5. Josh Addo-Carr 6. Matt Burton 7. Toby Sexton 8. Max King 9. Reed Mahoney 10. Raymond Faitala-Mariner 11. Jackson Topine 12. Jacob Preston 13. Corey Waddell 14. Kyle Flanagan 15. Kurtis Morrin 16. Tevita Pangai Junior 17. Jayden Okunbor 19. Fa’amanu Brown 20. Jeral Skelton 21. Reece Hoffman 22. Paul Alamoti 23. Chris Patolo LATE MAIL : Josh Addo-Carr looks set to miss the clash with the Broncos after suffering a hamstring injury in the final minutes of the Blues Origin victory. The winger was spotted on the bench with ice on his leg. Brad Fittler said he believed Addo-Carr was “alright” but the short turnaround means the Dogs will almost certainly rule him out. Broncos team : 1. Tristan Sailor 2. Corey Oates 3. Kotoni Staggs 4. Herbie Farnworth 5. Selwyn Cobbo 6. Ezra Mam 7. Adam Reynolds 8. Keenan Palasia 9. Billy Walters 10. Corey Jensen 11. Kurt Capewell 12. Brendan Piakura 13. Kobe Hetherington 14. Tyson Smoothy 15. Xavier Willison 16. Jesse Arthars 17. Martin Taupau 18. Deine Mariner 19. Patrick Carrigan 20. Jock Madden 21. Delouise Hoeter 22. Jordan Pereira LATE MAIL: Corey Oates will have to wait for his 200th game after suffering a knee injury at Broncos training on Wednesday. Kevin Walters confirmed the blow on radio and revealed Jesse Arthars will replace him in the side. Patrick Carrigan is the only representative player backing up for the Broncos and has been named at 20. Manly Sea Eagles vs North Queensland Cowboys at 4 Pines Park, 5:40pm AEDT Sea Eagles team : 1. Reuben Garrick 2. Jason Saab 3. Brad Parker 4. Tolutau Koula 5. Christian Tuipulotu 6. Josh Schuster 7. Daly Cherry-Evans 8. Taniela Paseka 9. Lachlan Croker 10. Toafofoa Sipley 11. Haumole Olakau’atu 12. Kelma Tuilagi 13. Jake Trbojevic 14. Dean Matterson 15. Aaron Woods 16. Ethan Bullemor 17. Josh Aloiai 18. Sean Keppie 19. Morgan Harper 20. Ray Tuaimalo-Vaega 21. Jakob Arthur 22. Gordon Chan Kum Tong Cowboys team : 1. Scott Drinkwater 2. Semi Valemei 3. Valentine Holmes 4. Peta Hiku 5. Murray Taulagi 6. Tom Dearden 7. Chad Townsend 8. Jordan McLean 9. Reece Robson 10. Coen Hess 11. Luciano Leilua 12. Jeremiah Nanai 13. Reuben Cotter 14. Jake Granville 15. Griffin Neame 16. Jason Taumalolo 17. Kulikefu Finefeuiaki 18. Kyle Feldt 19. Jamayne Taunoa-Brown 20. Zac Laybutt 21. Sam McIntyre 22. Riley Price 23. Ben Hampton 24. Brendan Elliot Sydney Roosters vs Melbourne Storm at Sydney Cricket Ground, 7:35pm AEDT Roosters team : 4. Joseph Manu 2. Daniel Tupou 3. Billy Smith 5. Joseph Suaalii 6. Luke Keary 7. Sandon Smith 8. Jared Waerea-Hargreaves 9. Jake Turpin 10. Lindsay Collins 11. Victor Radley 12. Nat Butcher 13. Nathan Brown 14. Brandon Smith 15. Egan Butcher 16. Siua Wong 17. Naufahu Whyte 18. Drew Hutchison 19. Terrell May 20. Corey Allan 21. Fetalaiga Pauga 22. Dylan Napa Players Cut: 1. James Tedesco LATE MAIL: Captain James Tedesco won’t back up from Origin Game III. Joseph Manu will shift to fullback. Coach Trent Robinson says this break for Tedesco has been planned for weeks. Storm team : 1. Nick Meaney 2. William Warbrick 3. Reimis Smith 4. Justin Olam 5. Xavier Coates 6. Cameron Munster 7. Jahrome Hughes 8. Tui Kamikamica 9. Harry Grant 10. Christian Welch 11. Trent Loiero 12. Nelson Asofa-Solomona 13. Josh King 14. Tyran Wishart 15. Tom Eisenhuth 16. Tariq Sims 17. Bronson Garlick 18. Grant Anderson 19. Alec MacDonald 20. Jayden Nikorima 21. Marion Seve 22. Chris Lewis 23. George Jennings SUNDAY Warriors vs Cronulla Sharks at Go Media Stadium, 2:00pm AEDT Warriors team : 1. Charnze Nicoll-Klokstad 2. Dallin Watene-Zelezniak 3. Rocco Berry 4. Adam Pompey 5. Marcelo Montoya 6. Luke Metcalf 7. Shaun Johnson 8. Addin Fonua-Blake 9. Wayde Egan 10. Mitchell Barnett 11. Jackson Ford 12. Josh Curran 13. Tohu Harris 14. Freddy Lussick 15. Bayley Sironen 16. Tom Ale 17. Dylan Walker 18. Kalani Going 20. Ronald Volkman 21. Taine Tuaupiki 22. Zyon Maiu’u 23. Viliami Vailea Sharks team : 1. William Kennedy 2. Sione Katoa 3. Jesse Ramien 4. Siosifa Talakai 5. Ronaldo Mulitalo 6. Matt Moylan 7. Nicho Hynes 8. Oregon Kaufusi 9. Blayke Brailey 10. Toby Rudolf 11. Briton Nikora 12. Teig Wilton 13. Cameron McInnes 14. Wade Graham 15. Thomas Hazelton 16. Jack Williams 17. Jesse Colquhoun 18. Connor Tracey 19. Kayal Iro 20. Braden Hamlin-Uele 21. Braydon Trindall 22. Tuku Hau Tapuha Dolphins vs Penrith Panthers at Kayo Stadium, 4:05pm AEDT Dolphins team : 1. Kodi Nikorima 2. Jamayne Isaako 3. Euan Aitken 4. Hamiso Tabuai-Fidow 5. Tesi Niu 6. Isaiya Katoa 7. Sean O’Sullivan 8. Jesse Bromwich 9. Harrison Graham 10. Kenny Bromwich 11. Felise Kaufusi 12. Connelly Lemuelu 13. Ray Stone 14. Herman Ese’ese 15. Mark Nicholls 16. Anthony Milford 17. Jarrod Wallace 18. Josh Kerr 19. Valynce Te Whare 20. Poasa Faamausili 21. Brenko Lee 22. Kurt Donoghoe LATE MAIL: Anthony Milford trained at five-eighth on Wednesday with Isaiya Katoa running around for the reserves, prompting speculation Wayne Bennett could pull a late switch on game day. Panthers team : 1. Dylan Edwards 2. Sunia Turuva 3. Izack Tago 4. Stephen Crichton 5. Brian To’o 6. Jarome Luai 7. Jack Cogger 8. Moses Leota 9. Mitch Kenny 10. James Fisher-Harris 11. Scott Sorensen 12. Liam Martin 13. Isaah Yeo 14. Soni Luke 15. Lindsay Smith 16. Spencer Leniu 17. Jaeman Salmon 18. Zac Hosking 19. Matt Eisenhuth 20. Luke Garner 21. Tyrone Peachey 22. Thomas Jenkins 23. Jesse McLean 24. Nathan Cleary LATE MAIL: Penrith coach Ivan Cleary has a big decision to make and reportedly is mulling over whether to rest his representative stars Stephen Crichton , Brian To’o , Liam Martin and Isaah Yeo . “We’ve got a system in place and some contingencies around that as well. We’ll make the decisions later,” Cleary said. The Panthers coach is confident though that son Nathan Cleary will return from a hamstring injury. “There’s a pretty good chance (he’ll play) I reckon … he’s tracking really well,” Ivan said on Wednesday. “No, not fast-tracking. This was the weekend that he was always aiming to play in. He’s gone well in his rehab, so we just have to see how the week goes.” Parramatta Eels vs Gold Coast Titans at CommBank Stadium, 6:15pm AEDT Eels team : 1. Clinton Gutherson 2. Maika Sivo 3. Will Penisini 4. Bailey Simonsson 5. Sean Russell 6. Daejarn Asi 7. Mitchell Moses 8. Reagan Campbell-Gillard 9. Brendan Hands 10. Junior Paulo 11. Shaun Lane 12. Bryce Cartwright 13. J’maine Hopgood 14. Luca Moretti 15. Joe Ofahengaue 16. Andrew Davey 17. Ryan Matterson 18. Ofahiki Ogden 19. Makahesi Makatoa 20. Waqa Blake 21. Matt Doorey 22. Haze Dunster 23. Isaac Lumelume Titans team : 1. AJ Brimson 2. Alofiana Khan-Pereira 3. Brian Kelly 4. Aaron Schoupp 5. Phillip Sami 6. Kieran Foran 7. Tanah Boyd 8. Moeaki Fotuaika 9. Sam Verrills 10. Tino Fa’asuamaleaui 11. David Fifita 12. Klese Haas 13. Isaac Liu 14. Jayden Campbell 15. Chris Randall 16. Erin Clark 17. Jojo Fifita 18. Iszac Fa’asumaleaui 19. Jacob Alick 20. Keano Kini 21. Kruise Leeming 22. Ken Maumalo 23. Tony Francis 24. Thomas Mikaele LATE MAIL: The Titans’ Origin stars have all been named to back up but David Fifita will be assessed after reportedly pulling up with back tightness. He was limited to just 33 minutes. Bye: Dragons, Rabbitohs, Raiders","pubDate":"2023-07-13 23:34:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket’s Big Three in talks to launch women’s Champions League","link":"https://www.smh.com.au/sport/cricket/cricket-s-big-three-in-talks-to-launch-women-s-champions-league-20230714-p5do6k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australia, India and England are in high-level talks to launch a women’s Twenty20 Champions League as soon as next year following the success of the first Women’s Premier League in India.","content":"Manchester: Australia, India and England are in high-level talks to launch a women’s Twenty20 Champions League as soon as next year, following the high-profile success of the first Women’s Premier League in India . Nick Hockley and Mike Baird, the Cricket Australia chief executive and chair, have been discussing the concept with their opposite numbers at the BCCI and the ECB in recent weeks, including meetings around the Lord’s Ashes Test and the World Test Championship final at the Oval . Jess Jonassen (centre) celebrates with her Australian teammates after catching Sophia Dunkley in the T20 match at Lord’s. Credit: Getty Images A CA spokesperson confirmed discussions were ongoing but declined to comment further when contacted by this masthead. More talks took place this week around the ICC’s annual conference in South Africa, where member nations have approved a proposal to hand the BCCI as much as 38 per cent of revenue from the recent $US3 billion ($4.35 billion) sale of the rights to global events. This is nearly double the 22 per cent India were allotted under the previous distribution deal, signed off in 2017. Among other determinations, T20 franchise leagues were given greater regulation including a minimum threshold of seven local players per team. Baird, who became the new chair of CA earlier this year , is set to join the ICC’s powerful finance and commercial affairs committee, placing him head to head with the BCCI’s influential secretary Jay Shah on the big questions of cricket economics. The WPL’s spectacle, featuring big crowds and large TV audiences after the BCCI sold rights to the event to Viacom18 for $US116.5 million ($169 million) over five years, has been a significant driver for the Champions League idea. It would be a far more significant development for the game than the announcement of equal prize money for men’s and women’s World Cups at the end of the Durban meeting. Unlike tennis or golf, the lifeblood of a cricketer’s career is contracts and match payments, which would rise considerably should the Champions League become a success. Introduction of the league, with broadcast rights revenue to be shared among the countries involved, would mimic the attempt to start a men’s T20 Champions League when the IPL was launched in 2008. That tournament, sold for nearly $US1 billion ($1.45 billion) to Star Sports, was abandoned after six editions as it failed to generate enough spectator interest to justify the high price tag. Its revenue was shared between India, Australia and South Africa, after England’s board dropped out of discussions. This time around, the concept of a women’s Champions League is seen as the logical next step to capitalise on the strength of the WPL, the WBBL and the Hundred competition in England. There is no suggestion that CA, the BCCI and the ECB are considering the relaunch of a men’s Champions League. Big crowds and high-quality cricket have been a hallmark of each of the last two women’s T20 World Cups also, in 2020 in Australia shortly before the outbreak of COVID-19, and then in South Africa earlier this year, where Australia again prevailed in a tight tussle against the hosts. It is possible that the tournament will also include teams from other leagues such as the Caribbean Premier League, but there is a desire to start the event in a focused manner and grow from there. Locations would be rotated, with match revenue from tickets and corporate hospitality to be retained by the host nation. Australia’s captain Alyssa Healy has spoken about the need for the women’s game to be supported by wider investment down development pathways in more nations. Meg Lanning’s dismissal for 35 was a big moment in the WPL final this year. Credit: Getty Images “I think it takes support and investment from the global bodies to invest in their women’s teams and their women’s pathways in particular,” Healy said earlier on the current Ashes tour. “There’s no secret to why this team has been successful for a long period of time, it’s because we’ve got great domestic pathways. “They were invested in a long time ago and it’s developed some amazing players. The likes of Annabel Sutherland and Phoebe Litchfield can almost come straight into international cricket and perform right away. That really helps, and I think a lot of nations are catching up, they’re doing some great things.” The Marylebone Cricket Club’s world cricket committee reached a similar conclusion at their recent meeting ahead of the Lord’s Ashes Test. “The growth of the women’s game must also be consistent with the growth of the game as a whole,” chair Mike Gatting said. “We need to ensure that nations are rewarded for their commitment to investing in both the men’s and women’s game alike, and a ring-fenced fund could be an important step here. “We have seen similar reports previously, which haven’t led to actions or tangible improvements. The WCC firmly believes that if we are to protect the game of cricket as a whole, immediate action must be taken to bring about significant transformation in the sport.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-13 22:38:32","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"2023 Sports Capital &amp; Equipment Programme to open on 17 July","link":"https://www.cricketireland.ie/news/article/2023-sports-capital-equipment-programme-to-open-on-17-july","keywords":null,"creator":null,"video_url":null,"description":"The Sports Capital and Equipment Programme (SCEP) is operated by the Irish Government and provides grants to assist in the development or refurbishment of sports facilities and the provision of sports equipment. It is part funded from the proceeds of the National Lottery.","content":"The 2023 round of the Programme will open for applications from 9am, Monday 17 July 2023 until 5pm, Friday 8 September 2023 and Cricket Ireland is urging all clubs based in the Republic of Ireland to consider, prepare, and apply ahead of the deadline. If they haven’t done so in previous rounds of the scheme, clubs must register with the programme in advance and the deadline for registration of a club is 5pm on Friday 25th August 2023. The Department have renewed the portal that is used to apply for funding and manage the drawdown of grants and it can be accessed at www.sportscapitalprogramme.ie To support clubs with their applications, Cricket Ireland in partnership with the various Provincial Unions, will deliver several guidance workshops, the details of which will be announced shortly. Outlined below are several underlined Useful Links that clubs are encouraged to visit if considering an application. Within them there are details about the programme, how to register and apply and video guide to making an application. 1. A guide to registration is available. 2. Frequently Asked Questions about the Programme 3. The 2023 Guide to making an application 4. A video guide to making an application 5. The 2020 Sports Capital Programme Scoring System and Assessment Procedures 6. The Sports Capital Programme Guide to Accessible Gym Equipment . For more information on #6 above, Cara - Sport Inclusion Ireland have created resource Factsheets on how to make your sports facilities, equipment and activities more accessible to people with disabilities. If your clubs are interested in applying and would like further information, feel free to contact richard.fahey@cricketireland.ie , emma.butler@cricketireland.ie or your Provincial Union.","pubDate":"2023-07-13 22:10:16","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Jaiswal, Rohit tons put India on top against Windies","link":"https://www.perthnow.com.au/sport/cricket/jaiswal-rohit-tons-put-india-on-top-against-windies-c-11274047","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Opening bats Yashasvi Jaiswal and captain Rohit Sharma have put India in a commanding position in the first Test against the West Indies in Dominica.","content":"Centuries by debutant Yashasvi Jaiswal and captain Rohit Sharma have given India a 162-run lead against the West Indies on day two of the first Test. Jaiswal carried his bat through the day to be 143 not out on debut. He and Rohit moved their opening partnership from 80 overnight to 229. But after a middle-session pick up, India crawled to stumps on 2-312. Virat Kohli (36 not out) was with Jaiswal. West Indies middle-order bat Alick Athanaze earned his maiden Test wicket when he got Rohit and broke the massive opening stand. Athanaze's 13 overs of off-spin compensated for the absence of Rahkeem Cornwall, who bowled his third maiden over before walking off in the morning session due to a chest infection. Jaiswal and Rohit were restricted to 66 runs in 32 overs in the first session, but that was enough to post India's first 100-run opening partnership in 11 Tests. After lunch, Jaiswal and Rohit showed more intent without really getting their timing right. They passed West Indies' total of 150 about six overs quicker, marking the first time India took a first-innings lead in a Test without losing a wicket. After the stand reached 200, Jaiswal became the 17th Indian man to score a Test century on debut, matching Rohit, who was the 14th in 2013. From the 215th ball he faced, Jaiswal paddle-swept a single to fine leg off Athanaze and celebrated exuberantly, raising his arms and leaping to punch the air. Soon after, the batters owned the highest opening partnership outside Asia when they eclipsed the 213 by Sunil Gavaskar and Chetan Chauhan in 1979 against England at the Oval. This was only India's third ever double-century opening stand outside Asia. Rohit finally posted his 10th Test hundred with a cover drive to the boundary, then was out next ball when he gloved Athanaze off his thigh to wicketkeeper Joshua Da Silva. Rohit made 103 off 221 balls with 10 boundaries and two sixes. Shubman Gill requested to drop in the order from opener to No.3 and made only six when he was caught by Athanaze at short second slip off spinner Jomel Warrican. India added 99 runs in the middle session and only 67 runs in 32 overs after tea. West Indies used up their third and last review trying to get Kohli out on nine but he didn't touch the ball. Without a review, West Indies rued what might have been when pacer Kemar Roach hit Jaiswal on his back pad on 133. West Indies appealed for leg before without success and ball tracking showed the ball would have hit leg stump. Kohli, content to help Jaiswal grind things out, took 81 balls to hit his first boundary and punched the air. By stumps, he'd used up 96 balls to make 36. He played second fiddle to Jaiswal, who had the highest score by an Indian man on debut outside Asia, and counting.","pubDate":"2023-07-13 22:05:50","image_url":"https://images.perthnow.com.au/publication/C-11274047/300c022dedf0b76f8771ed4ad4482c5c98b391c3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Zimbabwe cricket growth charms Andy Flower","link":"https://www.chronicle.co.zw/zimbabwe-cricket-growth-charms-andy-flower/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com CRICKET in Zimbabwe has been on a positive trajectory over the past couple of years and has seen a rise in followership with fans filling stadia whenever the national team plays. The steady growth of the sport in the country has charmed many from even outside the borders. The passion and love […]","content":"The Chronicle CRICKET in Zimbabwe has been on a positive trajectory over the past couple of years and has seen a rise in followership with fans filling stadia whenever the national team plays. The steady growth of the sport in the country has charmed many from even outside the borders. The passion and love that has been seen over the past years is testimony that the game is gaining popularity. One man who liked what he saw during the recently ended 2023 Men’s Cricket World Cup Qualifiers which were held in Zimbabwe is one of the country’s finest cricketers ever and an International Cricket Council (ICC) Hall of Famer, Andy Flower. Returning to Zimbabwe as part of the commentary team for the Qualifiers for the first time in over two decades, Flower was pleased with the growth of the sport in the country as a lot of work and effort has been put in to make sure that the game stays on top where it belongs. In an interview with ICC, Flower said he was pleased with what he saw at the country’s two biggest cricket stadiums, Queens Sports Club and Harare Sports Club having watched matches in Bulawayo and Harare where fans and the atmosphere was out of this world. He also noted a change in followership of the sport in the country as it has now become more popular to the black majority who have been showing appreciation for the sport unlike during their days as players. “Before I arrived in Zimbabwe, I would have had a lukewarm response to a question about the future of Zimbabwean cricket. Now that I’m just about to leave, I feel much more positive. They (fans) threw love out towards everyone in the ground, even the little bit of barracking with the opposition was done in good spirit, and that I think I’ll remember for years. “The energy in the crowd. The love for the game, the feeling of support and love for the players while they were playing and while the crowd was singing and dancing and loving their day, but also taking note of every single ball. It was really interesting for me to see the change in the demographic in the crowd. When we were playing, it was mostly a White crowd, and the change that I have seen after being away for so long is such a great change for Zimbabwe,” he said. Over the past year, Zimbabwe has been playing positive cricket under the stewardship of Dave Houghton. Some of the Chevrons’ notable victories include a final ball one run win over Pakistan in the T20 World Cup and also their first ODI victory over Australia Down Under, winning by three wickets after a Ryan Burl masterclass with the ball. The Chevrons also managed to reach the Super 12 stage of the T20 World Cup for the first time. Most recently, Zimbabwe beat the West Indies in their group match of the World Cup Qualifiers at Harare Sports Club. The positivity, courage and the mentality that the team now has is something that also caught Flower’s attention. Zimbabwe has enjoyed a good run in international cricket. “One thing that stands out for me is the confidence with which Zimbabwe are playing their cricket, and I think partly that comes from exposure to international matches, to international tournaments and series. I see a certainly strong spirit in them. They have some experienced players, they’ve got a few youngsters and it’ll be an interesting transition when they move on from some of their experienced players in the next few years. But I do see a fighting spirit. You see that in the way that they field,” said Flower He remains the only Zimbabwean to have made it to the ICC Hall of Fame and is considered one of the finest wicket-keeper batters of all time across the globe. In 63 Test matches, Flower scored 4 794 runs with a high score of 232 runs not out at a staggering average of 51,54 while in one day cricket, the 55-year-old scored 6 786 runs from 213 games with a high score of 145 runs and an average of 35,34. He has 16 international tons. – @brandon_malvin","pubDate":"2023-07-13 22:01:26","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping","link":"https://www.dailymail.co.uk/sport/cricket/article-12297173/Why-fast-bowling-crickets-primeval-act-does-not-just-spill-blood-gets-pumping.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Fast bowling has always been cricket's most primeval act, a skill that comes from the heart not the brain and takes practitioners to places beyond logic.","content":"Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping... that's why there will be a guttural roar when England's Mark Wood charges in to bowl at 97mph at Old Trafford next week Crowd gasped after Mark Wood’s fastest ball at Leeds — 96.5mph — was relayed Shoaib Akhtar holds record for a delivery clocked at 100.2mph against England Dennis Lillee rejoiced in terrorising batsmen with a bouncer at the rib-cage By Lawrence Booth for the Daily Mail Updated: 22:57, 13 July 2023 e-mail View comments On the day he sparked Australia ’s dramatic first innings collapse in the third Test, Mark Wood was asked what it was like to see his speed flashed up on Headingley’s big screen. He answered in two syllables: ‘Woo hoo!’ Frankly, what more was there to be said? Fast bowling has always been cricket’s most primeval act, a skill that comes from the heart not the brain and takes practitioners to places beyond logic. Frank Tyson, the England quick who terrorised Australia in 1954-55, spoke of the ‘glad animal action’ of bowling fast. On the other side of the Ashes divide, Dennis Lillee rejoiced in the ‘sheer “I can fly” exhilaration… it’s seeing that look of apprehension on your quarry’s face’. The language is bestial, of hunter and hunted. When Wood’s fastest ball at Leeds — 96.5mph — was relayed to the crowd, they gasped at the brutishness it conveyed. And, for Wood, it was confirmation that everything was in working order. Woo hoo indeed. Not that he came close to the world record. That is held by Pakistan’s Shoaib Akhtar, who in a World Cup game against England at Cape Town in 2003 was clocked at 100.2mph and was known as the Rawalpindi Express. Strange, then, that the delivery — in the words of Wisden — was ‘comfortably repulsed’ by Nick Knight. Fast bowler Mark Wood sparked Australia’s dramatic first innings collapse in the third Test Australia's Dennis Lillee rejoiced in terrorising batsmen with a bouncer at the rib-cage Since Shoaib, only two others have passed the mythical 100mph, both in one-day internationals for Australia — Brett Lee, in 2005 against New Zealand at Napier, and Shaun Tait, in 2010 against England at Lord’s. Wood says he can bowl faster than at Headingley and with good reason — last winter against Pakistan at Multan, he flew in at 97.3mph. One thing is certain. In a series already overflowing with subplots, all eyes will be on the speed gun when the Ashes resumes in Manchester next week. Central to the drama surrounding fast bowling is the threat of physical danger, as if cricket becomes something the Romans might have bayed for in the Colosseum. Jeff Thomson, the slingy Australian who was once said to have clocked 99.8mph at Perth’s WACA, was unapologetic about the edge this threat gave him. After putting an opponent in hospital for a week with a blow to the eye in a grade match, he admitted it was ‘frightening to see this bloke just screaming and shaking and the pitch splattered with blood as it poured through his fingers’. Ominously, though, he added: ‘I never let this sort of thing put me off.’ He was especially undeterred against England, whom he destroyed during the 1974-75 Ashes with the help of Lillee. ‘I thought, “Stuff that stiff-upper-lip crap”,’ said Thomson. ‘Let’s see how stiff it is when it’s split.’ Lillee was just as unflinching. ‘I try to hit a batsman in the rib-cage when I bowl a purposeful bouncer,’ he once said. ‘I want it to hurt, so the batsman doesn’t want to face me any more.’ The English players from that series, which Australia won 4-1, speak of shellshock, as if the balls were bullets and the crease a trench. David ‘Bumble’ Lloyd’s after-dinner story about having his inadequate box snapped open and, painfully, shut by Thomson has given that tour more humour than it deserves. Above all, there is little time for manoeuvre against fast bowling. While a 90mph delivery might slow to about 80mph before pitching, then to 72mph after it hits the turf, that still leaves the batsman just 0.4 seconds to react. Yet a study in Western Australia once suggested you need 0.3 of a second to make any sense of where the ball may land and another 0.3 of a second to execute your stroke. In other words, pre-meditation is the only option. As John Snow, the England fast bowler who helped Ray Illingworth’s side win the Ashes in Australia in 1970-71, put it: ‘Speed defeats reactions.’ You could see it in the way Australia’s lower order flinched at Wood, hoping to connect or simply survive. Only when Travis Head had his eye in on the third evening was Wood treated with anything other than apprehension. Fast bowling does not just spill blood, it gets it pumping like nothing else in cricket and like few activities in any sport. Perhaps the most famous over ever bowled was by Michael Holding to Geoffrey Boycott at Bridgetown, Barbados, in 1981, which ended with Boycott bowled for a duck. After he fell to Holding again in the second innings for a single, he was asked by a curious, and brave, waiter at the team hotel: ‘Did you see any of them?’ Australian paceman Jeff Thomson was unapologetic about the edge this threat gave him Boycott, owner of arguably the tightest defence in the game’s history, replied: ‘I saw them all. I just couldn’t play any of them.’ Others chose not to play any of them. On a brute of a pitch in Jamaica in 1976, Bishan Bedi declared India’s first innings on 306 for six to spare his lower order the ordeal of facing Holding, Wayne Daniel and Co. In the second innings, India got to 97 for two, but no further. Three wickets fell for none, while the remaining five batsmen were ‘absent hurt’. It was sobering to think West Indies had not yet embarked on their reign of terror, in which the psychological and physical grip exerted by their four-man attacks ensured they did not lose a Test series between 1980 and 1995. See off Holding and Andy Roberts and you had to contend with Joel Garner and Colin Croft. After them came Malcolm Marshall, Patrick Patterson, Curtly Ambrose and Courtney Walsh. There have been few more thrilling spells in England than the one sent down by Jofra Archer to Steve Smith in the 2019 Ashes Test at Lord’s. Hit on the head, Smith was ruled out of the next game due to concussion. The legend of Archer’s spell meant Smith recently pointed out on Twitter that Archer had not, in fact, taken his wicket. Only the toughest mentally survive the assault. Graham Gooch, one of the greatest players of pace, once said: ‘If I went out to start an innings thinking about being hit, I could not play the game. My entire technique would collapse.’ His England team-mate Robin Smith, another superb player of fast bowling, went for hypnosis after he had his jaw broken by West Indies’ Ian Bishop at Old Trafford in 1995. The hypnotist was Derren Brown and his techniques did the trick. Smith never feared fast bowling again and later explained his tactics to the Guardian: ‘You draw an imaginary line down the pitch, somewhere near the middle, and whenever the ball hits that line, you hit the f****** deck.’ Not all fast bowlers have been comfortable inflicting pain. England’s Peter Lever could never forget hitting New Zealand No 11 Ewen Chatfield on the left temple at Auckland in 1975, years before protective headwear. Chatfield collapsed to the ground and swallowed his tongue. For a few seconds his heart stopped beating and it needed quick work by England physio Bernie Thomas to save his life. ‘I honestly thought I had killed him,’ said Lever. ‘I felt sick and ashamed. All I could think when I got back to the pavilion was I wanted to retire.’ Len Pascoe, a rugged Australian quick, had similar thoughts after hitting India’s Sandeep Patil in the face in 1981. Until then, he had traded off fear, but the incident led to introspection. ‘The game’s not worth dying over,’ he said. ‘I was worried about what I was becoming. It wasn’t me.’ After the death of Australia batsman Phillip Hughes following a blow to his vertebral artery on the side of his neck in a Sheffield Shield game in 2014, research was done into the number of deaths caused by cricket. According to Peter Brukner, then Australia team doctor, and historian Tom Gara, there were 544 cricket-related deaths in Australia, Britain and New Zealand dating back to 1850, with most caused by a blow to the heart or head. Since their research covered only three countries, the true number is likely to be much higher. Batsmen these days, of course, have more protection thanks to the introduction of helmets in the late 1970s, though this also means they are less likely to sway out of the way of bouncers, paradoxically increasing the chances of being hit. Are fast bowlers getting faster? Fred Trueman of Yorkshire and England, who once described himself as ‘the greatest bloody fast bowler that ever drew breath’, would be appalled at the thought that he was not in the same category as Wood, even if footage suggests he was not. Yet fast bowling may be one area of human endeavour where progress is not plotted on a smooth curve. Harold Larwood, England’s Bodyline hero of 1932-33, was said to have touched 96mph, though the evidence for this is sketchy. Shoaib’s record, meanwhile, has remained intact for 20 years. Since fast bowling is about more than the speed of the approach, it is easy to see why bowlers are not simply getting quicker. Also important are a long final stride, a braced front leg and the speed of the arm. As Shoaib found, a hyperextending elbow can help, too. There is no one-size-fits-all, no identikit method of making a fast bowler. It can be a mysterious process, dependent on temperament and defying reason. It connects with fans at an elemental level and makes batsmen question their life choices. It is why, when the Ashes resume, there will be a guttural roar as Wood charges in to deliver his first ball. Share or comment on this article: Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 21:30:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/21/73195497-0-image-m-30_1689281790530.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 1st Test 2023: Yashasvi Jaiswal, Rohit Sharma's Centuries on Day 2 Pile More Misery on West Indies, India Lead By 162 Runs","link":"https://www.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-2023-yashasvi-jaiswal-rohit-sharmas-centuries-on-day-2-pile-more-misery-on-west-indies-india-lead-by-162-runs-5264338.html","keywords":null,"creator":null,"video_url":null,"description":"It was another day of India's dominance in this Test match with centuries from both openers laying the platform for a huge first innings total. West Indies had two successes with Alick Athanaze and Jomel Warrican amongst the wickets.","content":"India have dominated yet another day in this Test match, with the highlight of the performance being sparkling hundreds from Rohit Sharma and Yashasvi Jaiswal. While the Indian captain got to his 10th Test hundred, for Jaiswal, it was a historic first as he became the first Indian to score a Test century on debut in the West Indies, in addition to becoming the 17th overall from the country to get to the three-figure mark. Rohit departed after his hundred and West Indies gained a bit of momentum after they Shubman Gill (6) as well in a short span of time. But Jaiswal and Virat Kohli (36*) added 72 undefeated runs to help India finish Day 2 with a 162-run lead. Virat Kohli Completes 8500 Test Runs, Surpasses Virender Sehwag To Become Fifth-Highest Run-Scorer for India in Longest Format During IND vs WI 1st Test 2023. Yashasvi Jaiswal, Rohit Sharma Help India Dominate Day 2 India continues to dominate in Dominica!!! Jaiswal & Rohit are the stars with terrific hundreds then Kohli has been solid with 36* - lead by 162 runs in first innings during Day 2 stumps. pic.twitter.com/Wp7KUjQljv — Johns. (@CricCrazyJohns) July 13, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-13 21:29:27","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-1st-test-highlights-jaiswals-ton-on-debut-helps-india-reach-312-2-at-stumps-stretch-lead-to-162-12863972.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162","content":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162 India vs West Indies 1st Test Day 2 Highlights: IND 312/2; Yashasvi Jaiswal remains unbeaten on 143 off 350 balls with Virat Kohli batting on 36 and the unbroken partnership between the two worth 72 as India end the day 162 runs ahead of West Indies. FirstCricket Staff Last Updated:July 14, 2023 02:57:10 IST India vs West Indies, 1st Test Day 2 LIVE Score: India opener Yashasvi Jaiswal in action on Day 2 of the first Test against West Indies at the Windsor Park in Roseau, Dominica. AP FP commentary Quick Scorecard Full scorecard Ball by ball commentary West Indies Vs India At Windsor Park, Roseau, Dominica, 12 July, 2023 12 July, 2023 Starts 19:30 (IST) Stumps West Indies 150/10 (64.3 ov) 1st Test India 312/2 (113.0 ov) Live Blog Live Updates Highlights 02:56 (IST) That brings us to the end of our coverage of Day 2 of the first Test between West Indies and India at the Windsor Park in Roseau, Dominica. Do join us tomorrow for the third day's play. For now, this is Amit signing off, wishing you all a good night! Full Scorecard 02:52 (IST) India vs West Indies LIVE Score Yashasvi Jaiswal, who remained unbeaten on 143 at the close of play, speaks to Samuel Badree after stumps: “I think this knock was one of the emotional knock for me. I would like to thank each and everyone, especially selectors and Rohit bhai for giving me the chance to go and express myself. Wicket was difficult to bat on. I was taking to Rohit bhai and Virat bhaiya about scoring on this surface. It’s been pretty hot, and I have to keep thinking that I have to do it for the country. I was just enjoying my cricket. I love Test cricket because it is always going to test you and I love that challenge. I had prepared for it. We really worked hard on each and every part. (On the century celebration) It was really emotional, and I am proud of myself. This is just the start.\" Full Scorecard 02:45 (IST) India vs West Indies LIVE Score After 113 overs,India 312/2 ( Yashasvi Jaiswal 143 , Virat Kohli 36) STUMPS ON DAY 2: Yashasvi Jaiswal remains unbeaten on 143 in 350 deliveries, stitching a patient third-wicket partnership with Virat Kohli worth 72 as India end the day 162 runs ahead of the West Indies with eight wickets in hand! Barring a couple of hiccups shortly before the tea interval in which Rohit Sharma and Shubman Gill fell to spin in quick succession, the day well and truly belonged to the Indians, who did not lose a single wicket in two out of three seasons and are well placed to stretch their lead beyond the Windies' reach on the third day and go 1-0 up in the two-match series. Jaiswal, meanwhile, will be heading back to the team hotel dreaming about the possibility of becoming the first Indian batter to score a double-hundred on Test debut. Full Scorecard 02:28 (IST) India vs West Indies LIVE Score After 109 overs,India 302/2 ( Yashasvi Jaiswal 140 , Virat Kohli 29) FOUR! Virat Kohli punches the air in delight after collecting his first boundary after facing 81 deliveries! Drives the flighted delivery from Jomel Warrican outside off through the extra cover region for an easy boundary. The boundary also brings up the 300 for India . Full Scorecard 02:26 (IST) India vs West Indies LIVE Score After 108 overs,India 298/2 ( Yashasvi Jaiswal 140 , Virat Kohli 25) West Indies keeper Joshua Da Silva cops a painful blow while collecting the ball in Roach's 16th over. Apparently the ball had hit him on a taped-up finger and leads to the home team physio walking out to have a look. Meanwhile, Alzarri Joseph has left the field and he is replaced by left-arm seamer Raymond Reifer, who has bowled a solitary over so far today. Two singles off Reifer's over, the second of which takes Virat Kohli past Virender Sehwag's Test run-tally of 8,503 runs for India . Full Scorecard 02:14 (IST) India vs West Indies LIVE Score After 106 overs,India 296/2 ( Yashasvi Jaiswal 139 , Virat Kohli 24) Kohli collects a brace after steering the ball wide of the slip cordon off Roach's bowling at the start of the 105th over. FOUR! Jaiswal punches a length ball from Joseph outside off behind point to collect his 14th boundary, and the first of the innings in nearly 24 overs. India a hit away from 300 now. Another seven overs left to be bowled today. Full Scorecard 02:08 (IST) India vs West Indies LIVE Score After 104 overs,India 290/2 ( Yashasvi Jaiswal 135 , Virat Kohli 22) Jaiswal and Kohli collect a single each in Joseph's 13th over, and that brings up the fifty partnership for the third wicket . The pair have consumed 150 balls in the stand so far. Full Scorecard 02:07 (IST) India vs West Indies LIVE Score After 103 overs,India 288/2 ( Yashasvi Jaiswal 134 , Virat Kohli 21) Lucky escape for Yashasvi Jaiswal after a confident shout for LBW by Kemar Roach and the West Indians! Umpire Richard Kettleborough shakes his head, and Windies unfortunately are out of reviews! HawkEye shows three reds in favour of the bowling side , with Impact bang at the centre of the middle stump and the ball going on to hit middle and leg. Roach buries his head in disappointment, knowing he fully deserved the wicket. It's just been his day so far. Jaiswal sets off for a risky single in the next ball and manages to reach the non-striker's end despite a direct hit from mid off. Jaiswal, meanwhile, adds another feather to his cap, going past Mohammad Azharuddin's record for most deliveries faced by an Indian on Test debut. Azharuddin had faced 322 deliveries on debut against England at Kolkata's Eden Gardens in 1984. Full Scorecard 01:54 (IST) India vs West Indies LIVE Score After 102 overs,India 286/2 ( Yashasvi Jaiswal 133 , Virat Kohli 20) West Indies finally have decided to take the second new ball after the 100th over, with skipper Brathwaite opting to hand the brand new Dukes cherry to Kemar Roach and Alzarri Joseph. Roach appeals for an LBW against Kohli in the first delivery with the second new ball, with the umpire shaking his head and the ball appearing to slide down leg. Full Scorecard 01:47 (IST) India vs West Indies LIVE Score After 100 overs,India 282/2 ( Yashasvi Jaiswal 132 , Virat Kohli 18) Jermaine Blackwood, who bowls off-spin part time, comes in as the ninth bowling option for the West Indies in this innings. Concedes a single off his first delivery with Kohli working the ball through the midwicket region. Turns out to be a case of change from both ends with Kemar Roach steaming in from the other end. Kohli welcomes him into his new spell with a drive through the extra cover region that fetches him a brace. Jaiswal collects a brace off Blackwood in the following over with a brace off a cut in front of square. 100 overs up in the Indian innings. The visitors continue to collect runs at a steady pace, their scoring rate remaining below three throughout today. Full Scorecard Load More Highlights 02:45 (IST) India vs West Indies LIVE Score After 113 overs,India 312/2 ( Yashasvi Jaiswal 143 , Virat Kohli 36) STUMPS ON DAY 2: Yashasvi Jaiswal remains unbeaten on 143 in 350 deliveries, stitching a patient third-wicket partnership with Virat Kohli worth 72 as India end the day 162 runs ahead of the West Indies with eight wickets in hand! Barring a couple of hiccups shortly before the tea interval in which Rohit Sharma and Shubman Gill fell to spin in quick succession, the day well and truly belonged to the Indians, who did not lose a single wicket in two out of three seasons and are well placed to stretch their lead beyond the Windies' reach on the third day and go 1-0 up in the two-match series. Jaiswal, meanwhile, will be heading back to the team hotel dreaming about the possibility of becoming the first Indian batter to score a double-hundred on Test debut. 02:28 (IST) India vs West Indies LIVE Score After 109 overs,India 302/2 ( Yashasvi Jaiswal 140 , Virat Kohli 29) FOUR! Virat Kohli punches the air in delight after collecting his first boundary after facing 81 deliveries! Drives the flighted delivery from Jomel Warrican outside off through the extra cover region for an easy boundary. The boundary also brings up the 300 for India . 02:26 (IST) India vs West Indies LIVE Score After 108 overs,India 298/2 ( Yashasvi Jaiswal 140 , Virat Kohli 25) West Indies keeper Joshua Da Silva cops a painful blow while collecting the ball in Roach's 16th over. Apparently the ball had hit him on a taped-up finger and leads to the home team physio walking out to have a look. Meanwhile, Alzarri Joseph has left the field and he is replaced by left-arm seamer Raymond Reifer, who has bowled a solitary over so far today. Two singles off Reifer's over, the second of which takes Virat Kohli past Virender Sehwag's Test run-tally of 8,503 runs for India . 02:08 (IST) India vs West Indies LIVE Score After 104 overs,India 290/2 ( Yashasvi Jaiswal 135 , Virat Kohli 22) Jaiswal and Kohli collect a single each in Joseph's 13th over, and that brings up the fifty partnership for the third wicket . The pair have consumed 150 balls in the stand so far. 02:07 (IST) India vs West Indies LIVE Score After 103 overs,India 288/2 ( Yashasvi Jaiswal 134 , Virat Kohli 21) Lucky escape for Yashasvi Jaiswal after a confident shout for LBW by Kemar Roach and the West Indians! Umpire Richard Kettleborough shakes his head, and Windies unfortunately are out of reviews! HawkEye shows three reds in favour of the bowling side , with Impact bang at the centre of the middle stump and the ball going on to hit middle and leg. Roach buries his head in disappointment, knowing he fully deserved the wicket. It's just been his day so far. Jaiswal sets off for a risky single in the next ball and manages to reach the non-striker's end despite a direct hit from mid off. Jaiswal, meanwhile, adds another feather to his cap, going past Mohammad Azharuddin's record for most deliveries faced by an Indian on Test debut. Azharuddin had faced 322 deliveries on debut against England at Kolkata's Eden Gardens in 1984. 00:19 (IST) IND vs WI LIVE Cricket Score After 81 overs,India 245/2 ( Yashasvi Jaiswal 116 , Virat Kohli 4) TEA ON DAY 2: West Indies claw back with the wickets of Rohit Sharma and Shubman Gill, both of whom fall to spin towards the end of the second session, though India still are well ahead of the hosts with a lead worth 95 and a well set Yashasvi Jaiswal at the crease. The second new ball is now available, but Windies skipper Kraigg Brathwaite is yet to take it. They might at the start of the evening session. Meanwhile, the Windsor Park surface is starting to really assist the spinners, and while the Indian batters might face a challenge from the likes of Jomel Warrican and Alick Athanaze, the development might just get Ravichandran Ashwin and Ravindra Jadeja a lot more excited. 00:06 (IST) IND vs WI LIVE Cricket Score OUT! Athanaze is part of another dismissal, this time taking a regulation catch at gully after Gill gets a nick off Warrican's bowling while attemping a defensive push. Not the best of starts for him at the No 3 position as he departs for 6. IND 240/2 Gill c Athanaze b Warrican 6(11) 00:02 (IST) IND vs WI LIVE Cricket Score OUT! Rohit departs right after bringing up his century as Alick Athanaze gets his maiden Test wicket on debut! Brathwaite goes for the review after the appeal for a catch by the keeper is turned down, and UltraEdge shows the ball brushing Rohit's glove before taking a deflection off his pad and landing between Da Silva's gloves. West Indies finally break the mammoth opening stand shortly before tea on the second day. Shubman Gill, batting at No 3 for the first time, makes his way to the centre. IND 229/1 in 76 Rohit c Da Silva b Athanaze 103(221) 23:53 (IST) IND vs WI LIVE Cricket Score FOUR! And now Rohit Sharma brings up his century — his 10th in Tests — shortly after Yashasvi Jaiswal brings up the milestone, driving a full toss from Athanaze through the covers. Reaches the milestone in 220 deliveries, collecting 10 fours and two maximums along the way. This is only his second ton away from home after his 127 against England at The Oval. IND 229/1 after 75.3 23:23 (IST) IND vs WI LIVE Cricket Score CENTURY ON TEST DEBUT FOR YASHASVI JAISWAL! What a start to the southpaw's international career! Brings up the milestone with a single off Alick Athanaze, taking 215 deliveries to bring up the milestone. Jaiswal thus becomes the 17th Indian batter to score a century on Test debut. IND 205/0 23:19 (IST) IND vs WI LIVE Cricket Score Yashasvi Jaiswal brings up 200 of the opening partnership with skipper Rohit Sharma with a single off Kemar Roach right after the drinks interval. The single also takes him to 99! IND 200/0; lead by 50 22:37 (IST) West Indies vs India LIVE Score After 61 overs,India 167/0 ( Yashasvi Jaiswal 78 , Rohit Sharma (C) 73) FOUR! Full and wide from Holder, and Jaiswal comfortably drives this behind point, joining Rohit in the 70s and bringing up India's highest opening partnership in the West Indies ! Jaiswal collects another boundary later in the 61st over, this time slashing a shorter delivery outside off but targetting the same region to move to 78. 22:34 (IST) West Indies vs India LIVE Score After 58 overs,India 151/0 ( Yashasvi Jaiswal 67 , Rohit Sharma (C) 68) Jaiswal looks to attack Warrican in the 58th over, dancing down the track in the first delivery only to push it for a dot and getting an inside edge while attempting a drive in the next delivery, coming back for a second to bring up the 150 for the visitors. He then collects a single to put India in the lead . 21:35 (IST) India vs West Indies LIVE Score After 55 overs,India 146/0 ( Yashasvi Jaiswal 62 , Rohit Sharma (C) 68) LUNCH ON DAY 2 : Rohit Sharma and Yashasvi Jaiswal continue to stand strong, both bringing up their half-centuries and stretching their partnership past the century mark as India head to the lunch interval on 146 for no loss , trailing by just four with all 10 wickets in hand. Rohit and Jaiswal have certainly been a lot more cautious in the morning session, scoring at less than three-an-over. Windies skipper Brathwaite decides to give debutant Alick Athanaze the final over of the session, and the part-time off-spinner concedes a couple of singles. 20:42 (IST) India vs West Indies LIVE Score FIFTY! India skipper Rohit Sharma gets to his 15th half-century in Test cricket! It's been a calm and composed knock from the Mumbai cricketer, and more importantly, he has been leading his team from the front here. IND 118/0 20:18 (IST) India vs West Indies LIVE Score FOUR! Pulled away in front of square by Jaiswal off Alzarri Joseph, and that brings up a half-century on international debut for the southpaw from Mumbai! Jaiswal took his time to get off the mark yesterday, but has looked a completely different batter once settled. Also brings up the century opening stand with Rohit Sharma. IND 103/0 Day 1 report: India will look to consolidate their position in the first Test against West Indies in Dominica, when they take field on Thursday for Day 2. The visitors were clinical in their approach on Wednesday after being asked to field first, with Ravichandran Ashwin, returning to the side, finishing with figures of 5/60 to see Windies off for 150. He was well-supported by fellow spin-bowling all-rounder Ravindra Jadeja, who collected three wickets for 26 runs. This was Ashwin’s 33rd five-fer in Test cricket, as well as his fifth against Windies since he made his Test debut against this very side in 2011. Barring debutant Alick Athanaze (47), none of the West Indian batters were able to convert starts into big knocks. Local boy Athanaze narrowly missed out on a half-century on Test debut, getting dismissed by Ashwin shortly before tea on the opening day. And in their first innings reply, India were 80/0 after 23 overs at stumps, with debutant Yashasvi Jaiswal (40*) and his skipper Rohit Sharma (30*) at the other end. Published on: July 13, 2023 18:01:28 IST Tags: Cricket India Vs West Indies Rohit Sharma Yashasvi Jaiswal Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-07-13 21:27:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/07/Yashasvi-Jaiswal-IND-WI-Dominica-Day-2-AP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI, 1st Test, Day 2: दूसरे दिन भारत 312/2, जायसवाल 143 रन पर नाबाद","link":"https://sports.ndtv.com/hindi/cricket/india-vs-west-indies-1st-test-day-2-live-score-updates-4204323#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, Day 2: आखिरी सीजन में विराट और जायसवाल ने पिच पर एकदम लंगर डालकर बल्लेबाजी की. खासकर विराट ने पूरी तरह से पिच पर जमने को प्राथमिकता दी. और ये दोनों अभी तक तीसरे विकेट के लिए नाबाद 72 रन की साझेदारी कर चुके हैं.","content":"IND vs WI 1st Test, Day 2: दूसरे दिन का आकर्षण पूरी तरह से यशस्वी जायसवाल की पारी रही विंडीज के खिलाफ बुधवार से शुरू हुई दो टेस्ट मैचों की सीरीज के पहले टेस्ट के दूसरे दिन वीरवार को मेहमान भारतीय टीम ने विंडीज पर शिकंजा कसते हुए दिन का खेल खत्म होने पर 2 विकेट पर 312 रन बना लिए हैं. पहले ही टेस्ट में शतक बनाने वाले यशस्वी जायसवाल 143 और विराट कोहली 36 रन बनाकर पिच पर जमे हुए हैं. इस तरह भारत ने पहली पारी के आधार पर फिलहाल 162 रन की बढ़त हासिल कर ली. आखिरी सेशन में विंडीज के गेंदबाज कोई विकेट नहीं ले सके. हालांकि, केमार रोच की एक गेंद पर जायसवाल एलबीडब्ल्यू आउट थे, लेकिन जब अंपायर ने उन्हें नॉटआउट दिया, तो मेजबान टीम के रिव्यू खत्म हो चुके थे. बहरहाल, इस आखिरी सेशन में विराट और जायसवाल ने पिच पर एकदम लंगर डालकर बल्लेबाजी की. खासकर विराट ने पूरी तरह से पिच पर जमने को प्राथमिकता दी. और ये दोनों अभी तक तीसरे विकेट के लिए नाबाद 72 रन की साझेदारी कर चुके हैं. इससे पहले चायकाल के समय भारत ने अपनी पहली पारी में 2 विकेट पर 244 रन बना लिए थे. इस समय ओपनर यशस्वी जायसवाल 116 और विराट कोहली 4 रन बनाकर क्रीज पर जमे हुए थे. दूसरे सेशन में जहां करियर का पहला टेस्ट खेल रहे लेफ्टी बल्लेबाज यशस्वी जायसवाल ने शतक जड़ा, तो कप्तान रोहित शर्मा भी करियर का 10वां शतक बनाने में कामयाब रहे. हालांकि, रोहित शतक बनाने के कुछ देर बाद आउट हो गए, लेकिन उन्होंने जायसवाल के साथ पहले विकेट के लिए 229 रन की साझेदारी करके भारत के विशाल स्कोर की मजबूत आधारशिला रख दी. भारत के 2 विकेट गिर चुके हैं. अगले बल्लेबाज शुभमन गिल 6 ही रन बना सके. विंडीज के लिए एक विकेट अथांजे, तो एक वारिकैन ने लिया. और दिन भर में भारत के गिरने वाले बस यही दो विकेट रहे. शुरुआती सेशन की बात करें, तो भारत ने मेजबानों पर अपना शिकंजा और कसते हुए अपनी पहली पारी में बिना नुकसान के 146 रन बनाए थे. और इस समय भारत पहली पारी में विंडीज से सिर्फ 4 ही रन पीछे था.. वीरवार को भारत ने अपने बुधवार के स्कोर बिना नुकसान के 80 रन से आगे खेलना शुरू किया. और दोनों ही नाबाद बल्लेबाजों बिना कोई उतावलापन दिखाए हुए पिच पर टिककर बल्लेबाजी की. एक-दो जोरदार अपीलों को छोड़ दें, तो विंडीज के बॉलर रोहित और जायसवाल पर बिल्कुल भी असर नहीं डाल सके. जायसवाल अर्द्धशतक ने पहले चौके जड़कर अर्द्धशतक पूरा किया, तो उसके कुछ देर बाद रोहित ने भी पचासा जड़ दिया. लंच के समय कप्तान रोहित 68 और जायसवाल 62 रन बनाकर क्रीज पर जमे हुए थे. मैच के पहले दिन टीम इंडिया मेजबान टीम को उसकी पहली पारी में 150 रन पर समेटने के बाद दिन का खेल समाप्त होने पर अपनी पहली पारी में बिना किसी नुकसान के 80 रन बना लिए थे. तब रोहित शर्मा नाबाद 30 और जायसवाल बिना आउट हुए 40 रन बनाकर पिच पर जमे हए थे. इस टेस्ट के जरिए यशस्वी जायसवाल और इशान किशन अपने टेस्ट करियर का आगाज किया रोहित शर्मा (कप्तान) 2. यशस्वी जायसवाल 3. शुभमन गिल 4. विराट कोहली, 5. अजिंक्य रहाणे 6. रवींद्र जडेजा 7. इशान किशन 8. आर. अश्विन 9. शार्दूल ठाकुर 10. जयदेव उनाडकट11. मोहम्मद सिराज 1, क्रेग ब्रैथवेट (कप्तान) 2, तेजनारायण चंद्रपॉल 3. रेमन रीफर 4, जर्मेन ब्लैकवुड 5. एलिक अथानाज़ 6. जोशुआ डा सिल्वा (विकेट कीपर) 7. जेसन होल्डर 8. केमार रोच 9. अल्ज़ारी जोसफ 10. रकीम कोर्नवाल 11. जोमेल वारिकन| पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-07-13 21:19:48","image_url":"https://c.ndtvimg.com/2023-07/gc2dbt7_s_625x300_13_July_23.jpg?im=FeatureCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"How To Watch MLC 2023 Free Live Streaming Online, TSK vs LAKR on JioCinema? Get TV Telecast Details of Texas Super Kings vs Los Angeles Knight Riders Major League Cricket 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-mlc-2023-free-live-streaming-online-tsk-vs-lakr-on-jiocinema-get-tv-telecast-details-of-texas-super-kings-vs-los-angeles-knight-riders-major-league-cricket-2023-match-5264355.html","keywords":null,"creator":null,"video_url":null,"description":"Some top stars from both sides would be in action in the inaugural match of the brand new T20 competition. Sunil Narine would be leading the Los Angeles Knight Riders while Texas Super Kings would be captained by Faf du Plessis.","content":"The Major League Cricket 2023 is set to kick start with Texas Super Kings taking on Los Angeles Knight Riders at the Grand Prairie Stadium, USA. The match is slated to start at 6:00 am IST (Indian Standard Time). Viacom18 has bagged the media rights of the tournament in India and the live telecast of this match will be available on Sports 18. Fans can also watch live streaming of this contest for free on the JioCinema app and website. MLC 2023 All Squads: Full Players List of All Major League Cricket T20 Franchises For Inaugural Edition. Texas Super Kings vs Los Angeles Knight Riders Live At the stroke of dawn 🌅 in 🇮🇳, beckons the dawn of a T20 extravaganza in the 🇺🇸! Texas Super Kings take on the Los Angeles Knight Riders to kick off the inaugural edition of #MajorLeagueCricket 🏏 Catch the action LIVE on #JioCinema & #Sports18 #MLConJioCinema #MLConSports18 pic.twitter.com/C4GKVeMKIF — JioCinema (@JioCinema) July 13, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-14 00:00:05","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Roosters’ big blow with Origin star ruled out; Dolphins set for halves switch: NRL Late Mail","link":"https://www.foxsports.com.au/nrl/nrl-premiership/kevvies-blow-as-flyer-goes-down-in-training-mishap-dogs-count-cost-of-blues-win-late-mail/news-story/7776a16f2133a4c353d24267bc37f993","keywords":null,"creator":null,"video_url":null,"description":"Roosters coach Trent Robinson has confirmed James Tedesco won’t back up for the Roosters after starring for the Blues on Wednesday night. Joey Manu will start at fullback.","content":"Roosters coach Trent Robinson has confirmed James Tedesco won’t back up for the Roosters after starring for the Blues on Wednesday night. Joey Manu will start at fullback. The Dolphins could be set for a late switch in the halves if scenes at Wednesday’s training are anything to go by. Elsewhere, the Broncos have suffered a big blow with Kevin Walters confirming winger Corey Oates went down with injury at training on Wednesday Round 20 NRL Jul 14 8:00pm AEST Knights Tigers MATCH CENTRE $1.26 $3.90 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 3:00pm AEST Bulldogs Broncos MATCH CENTRE $2.70 $1.47 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 5:30pm AEST Sea Eagles Cowboys MATCH CENTRE $2.25 $1.65 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 15 7:35pm AEST Roosters Storm MATCH CENTRE $2.50 $1.53 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 2:00pm AEST Warriors Sharks MATCH CENTRE $1.95 $1.85 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 4:05pm AEST Dolphins Panthers MATCH CENTRE $5.20 $1.16 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES NRL Jul 16 6:15pm AEST Eels Titans MATCH CENTRE $1.27 $3.80 BET *Odds are current as of 14th July 2023, 10:13am AEST VIEW ALL SCORES Watch every game of every round of the 2023 NRL Telstra Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >>> Oates was due to play his 200th NRL game against the Bulldogs but suffered a knee injury. “We lost a winger at training yesterday,” Walters said on SENQ 693am. “He’s injured his knee in a training incident so he won’t be available this weekend. “He’s off to see the surgeon and the specialist today to see if (he will miss) any time away from the game. “He certainly won’t be playing against the Bulldogs but we’re very fortunate that we have got great depth in a lot of positions. “That depth is being tested at the moment which I’m ok with. NSW star Josh Addo-Carr is in doubt for the Bulldogs after being taken out of Game III in the 77th minute with a hamstring injury. Meanwhile a host of State of Origin stars are in doubt after picking up knocks. Follow all the latest team news for Round 20 below: FRIDAY Newcastle Knights vs Wests Tigers at McDonald Jones Stadium, 8:00pm AEDT Knights team : 1. Kalyn Ponga 2. Dominic Young 19. Enari Tuala 4. Bradman Best 5. Greg Marzhew 6. Tyson Gamble 7. Jackson Hastings 8. Daniel Saifiti 9. Phoenix Crossland 10. Leo Thompson 11. Tyson Frizell 12. Lachlan Fitzgibbon 13. Adam Elliott 14. Kurt Mann 15. Jacob Saifiti 16. Jack Hetherington 17. Mathew Croker 18. Dylan Lucas 20. Brodie Jones Players Cut: 3. Dane Gagai 21. Hymel Hunt 22. Adam Clune LATE MAIL: Blues hero Bradman Best is in doubt after picking up a calf complaint on his Origin debut. According to the Daily Telegraph he complained of tightness at halftime. It could prompt Adam O’Brien to rest the centre, although the Knights coach sounds confident both he and fellow Origin teammate Jacob Saifiti will back up. “Bradman is in a bit of a purple patch at the moment with five tries in two weeks of footy,” O’Brien said on Thursday, suggesting the pair will be cleared to play. “They tell me that it’s easier to back up from Origin after two days as opposed to four days. We don’t have to make a decision right now, but we’ll make a really educated one.” The Knights will be without Dane Gagai though, seeing Enari Tuala join the starting team. Tigers team : 1. Jahream Bula 2. Asu Kepaoa 3. Starford To’a 4. Tommy Talau 5. Junior Tupou 6. Will Smith 7. Brandon Wakeham 8. Stefano Utoikamanu 9. Apisai Koroisau 10. David Klemmer 11. Isaiah Papali’i 12. John Bateman 13. Fonua Pole 14. Jake Simpkin 15. Shawn Blore 16. Alex Twal 17. Alex Seyfarth 18. Daine Laurie 19. Aistasi James Players Cut: 20. Tallyn Da Silva 21. Justin Matamua 22. Brent Naden LATE MAIL: Tallyn Da Silva is cut which is confirmation Apisai Koroisau will be good to return from a broken jaw. SATURDAY Canterbury-Bankstown Bulldogs vs Brisbane Broncos at Belmore Sports Ground, 3:00pm AEDT Bulldogs team : 1. Jake Averillo 2. Blake Wilson 3. Braidon Burns 4. Jacob Kiraz 5. Josh Addo-Carr 6. Matt Burton 7. Toby Sexton 8. Max King 9. Reed Mahoney 10. Raymond Faitala-Mariner 11. Jackson Topine 12. Jacob Preston 13. Corey Waddell 14. Kyle Flanagan 15. Kurtis Morrin 16. Tevita Pangai Junior 17. Jayden Okunbor 19. Fa’amanu Brown 20. Jeral Skelton 21. Reece Hoffman 22. Paul Alamoti 23. Chris Patolo LATE MAIL : Josh Addo-Carr looks set to miss the clash with the Broncos after suffering a hamstring injury in the final minutes of the Blues Origin victory. The winger was spotted on the bench with ice on his leg. Brad Fittler said he believed Addo-Carr was “alright” but the short turnaround means the Dogs will almost certainly rule him out. Broncos team : 1. Tristan Sailor 2. Corey Oates 3. Kotoni Staggs 4. Herbie Farnworth 5. Selwyn Cobbo 6. Ezra Mam 7. Adam Reynolds 8. Keenan Palasia 9. Billy Walters 10. Corey Jensen 11. Kurt Capewell 12. Brendan Piakura 13. Kobe Hetherington 14. Tyson Smoothy 15. Xavier Willison 16. Jesse Arthars 17. Martin Taupau 18. Deine Mariner 19. Patrick Carrigan 20. Jock Madden 21. Delouise Hoeter 22. Jordan Pereira LATE MAIL: Corey Oates will have to wait for his 200th game after suffering a knee injury at Broncos training on Wednesday. Kevin Walters confirmed the blow on radio and revealed Jesse Arthars will replace him in the side. Patrick Carrigan is the only representative player backing up for the Broncos and has been named at 20. Manly Sea Eagles vs North Queensland Cowboys at 4 Pines Park, 5:40pm AEDT Sea Eagles team : 1. Reuben Garrick 2. Jason Saab 3. Brad Parker 4. Tolutau Koula 5. Christian Tuipulotu 6. Josh Schuster 7. Daly Cherry-Evans 8. Taniela Paseka 9. Lachlan Croker 10. Toafofoa Sipley 11. Haumole Olakau’atu 12. Kelma Tuilagi 13. Jake Trbojevic 14. Dean Matterson 15. Aaron Woods 16. Ethan Bullemor 17. Josh Aloiai 18. Sean Keppie 19. Morgan Harper 20. Ray Tuaimalo-Vaega 21. Jakob Arthur 22. Gordon Chan Kum Tong Cowboys team : 1. Scott Drinkwater 2. Semi Valemei 3. Valentine Holmes 4. Peta Hiku 5. Murray Taulagi 6. Tom Dearden 7. Chad Townsend 8. Jordan McLean 9. Reece Robson 10. Coen Hess 11. Luciano Leilua 12. Jeremiah Nanai 13. Reuben Cotter 14. Jake Granville 15. Griffin Neame 16. Jason Taumalolo 17. Kulikefu Finefeuiaki 18. Kyle Feldt 19. Jamayne Taunoa-Brown 20. Zac Laybutt 21. Sam McIntyre 22. Riley Price 23. Ben Hampton 24. Brendan Elliot Sydney Roosters vs Melbourne Storm at Sydney Cricket Ground, 7:35pm AEDT Roosters team : 4. Joseph Manu 2. Daniel Tupou 3. Billy Smith 5. Joseph Suaalii 6. Luke Keary 7. Sandon Smith 8. Jared Waerea-Hargreaves 9. Jake Turpin 10. Lindsay Collins 11. Victor Radley 12. Nat Butcher 13. Nathan Brown 14. Brandon Smith 15. Egan Butcher 16. Siua Wong 17. Naufahu Whyte 18. Drew Hutchison 19. Terrell May 20. Corey Allan 21. Fetalaiga Pauga 22. Dylan Napa Players Cut: 1. James Tedesco LATE MAIL: Captain James Tedesco won’t back up from Origin Game III. Joseph Manu will shift to fullback. Coach Trent Robinson says this break for Tedesco has been planned for weeks. Storm team : 1. Nick Meaney 2. William Warbrick 3. Reimis Smith 4. Justin Olam 5. Xavier Coates 6. Cameron Munster 7. Jahrome Hughes 8. Tui Kamikamica 9. Harry Grant 10. Christian Welch 11. Trent Loiero 12. Nelson Asofa-Solomona 13. Josh King 14. Tyran Wishart 15. Tom Eisenhuth 16. Tariq Sims 17. Bronson Garlick 18. Grant Anderson 19. Alec MacDonald 20. Jayden Nikorima 21. Marion Seve 22. Chris Lewis 23. George Jennings SUNDAY Warriors vs Cronulla Sharks at Go Media Stadium, 2:00pm AEDT Warriors team : 1. Charnze Nicoll-Klokstad 2. Dallin Watene-Zelezniak 3. Rocco Berry 4. Adam Pompey 5. Marcelo Montoya 6. Luke Metcalf 7. Shaun Johnson 8. Addin Fonua-Blake 9. Wayde Egan 10. Mitchell Barnett 11. Jackson Ford 12. Josh Curran 13. Tohu Harris 14. Freddy Lussick 15. Bayley Sironen 16. Tom Ale 17. Dylan Walker 18. Kalani Going 20. Ronald Volkman 21. Taine Tuaupiki 22. Zyon Maiu’u 23. Viliami Vailea Sharks team : 1. William Kennedy 2. Sione Katoa 3. Jesse Ramien 4. Siosifa Talakai 5. Ronaldo Mulitalo 6. Matt Moylan 7. Nicho Hynes 8. Oregon Kaufusi 9. Blayke Brailey 10. Toby Rudolf 11. Briton Nikora 12. Teig Wilton 13. Cameron McInnes 14. Wade Graham 15. Thomas Hazelton 16. Jack Williams 17. Jesse Colquhoun 18. Connor Tracey 19. Kayal Iro 20. Braden Hamlin-Uele 21. Braydon Trindall 22. Tuku Hau Tapuha Dolphins vs Penrith Panthers at Kayo Stadium, 4:05pm AEDT Dolphins team : 1. Kodi Nikorima 2. Jamayne Isaako 3. Euan Aitken 4. Hamiso Tabuai-Fidow 5. Tesi Niu 6. Isaiya Katoa 7. Sean O’Sullivan 8. Jesse Bromwich 9. Harrison Graham 10. Kenny Bromwich 11. Felise Kaufusi 12. Connelly Lemuelu 13. Ray Stone 14. Herman Ese’ese 15. Mark Nicholls 16. Anthony Milford 17. Jarrod Wallace 18. Josh Kerr 19. Valynce Te Whare 20. Poasa Faamausili 21. Brenko Lee 22. Kurt Donoghoe LATE MAIL: Anthony Milford trained at five-eighth on Wednesday with Isaiya Katoa running around for the reserves, prompting speculation Wayne Bennett could pull a late switch on game day. Panthers team : 1. Dylan Edwards 2. Sunia Turuva 3. Izack Tago 4. Stephen Crichton 5. Brian To’o 6. Jarome Luai 7. Jack Cogger 8. Moses Leota 9. Mitch Kenny 10. James Fisher-Harris 11. Scott Sorensen 12. Liam Martin 13. Isaah Yeo 14. Soni Luke 15. Lindsay Smith 16. Spencer Leniu 17. Jaeman Salmon 18. Zac Hosking 19. Matt Eisenhuth 20. Luke Garner 21. Tyrone Peachey 22. Thomas Jenkins 23. Jesse McLean 24. Nathan Cleary LATE MAIL: Penrith coach Ivan Cleary has a big decision to make and reportedly is mulling over whether to rest his representative stars Stephen Crichton , Brian To’o , Liam Martin and Isaah Yeo . “We’ve got a system in place and some contingencies around that as well. We’ll make the decisions later,” Cleary said. The Panthers coach is confident though that son Nathan Cleary will return from a hamstring injury. “There’s a pretty good chance (he’ll play) I reckon … he’s tracking really well,” Ivan said on Wednesday. “No, not fast-tracking. This was the weekend that he was always aiming to play in. He’s gone well in his rehab, so we just have to see how the week goes.” Parramatta Eels vs Gold Coast Titans at CommBank Stadium, 6:15pm AEDT Eels team : 1. Clinton Gutherson 2. Maika Sivo 3. Will Penisini 4. Bailey Simonsson 5. Sean Russell 6. Daejarn Asi 7. Mitchell Moses 8. Reagan Campbell-Gillard 9. Brendan Hands 10. Junior Paulo 11. Shaun Lane 12. Bryce Cartwright 13. J’maine Hopgood 14. Luca Moretti 15. Joe Ofahengaue 16. Andrew Davey 17. Ryan Matterson 18. Ofahiki Ogden 19. Makahesi Makatoa 20. Waqa Blake 21. Matt Doorey 22. Haze Dunster 23. Isaac Lumelume Titans team : 1. AJ Brimson 2. Alofiana Khan-Pereira 3. Brian Kelly 4. Aaron Schoupp 5. Phillip Sami 6. Kieran Foran 7. Tanah Boyd 8. Moeaki Fotuaika 9. Sam Verrills 10. Tino Fa’asuamaleaui 11. David Fifita 12. Klese Haas 13. Isaac Liu 14. Jayden Campbell 15. Chris Randall 16. Erin Clark 17. Jojo Fifita 18. Iszac Fa’asumaleaui 19. Jacob Alick 20. Keano Kini 21. Kruise Leeming 22. Ken Maumalo 23. Tony Francis 24. Thomas Mikaele LATE MAIL: The Titans’ Origin stars have all been named to back up but David Fifita will be assessed after reportedly pulling up with back tightness. He was limited to just 33 minutes. Bye: Dragons, Rabbitohs, Raiders","pubDate":"2023-07-13 23:34:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket’s Big Three in talks to launch women’s Champions League","link":"https://www.smh.com.au/sport/cricket/cricket-s-big-three-in-talks-to-launch-women-s-champions-league-20230714-p5do6k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australia, India and England are in high-level talks to launch a women’s Twenty20 Champions League as soon as next year following the success of the first Women’s Premier League in India.","content":"Manchester: Australia, India and England are in high-level talks to launch a women’s Twenty20 Champions League as soon as next year, following the high-profile success of the first Women’s Premier League in India . Nick Hockley and Mike Baird, the Cricket Australia chief executive and chair, have been discussing the concept with their opposite numbers at the BCCI and the ECB in recent weeks, including meetings around the Lord’s Ashes Test and the World Test Championship final at the Oval . Jess Jonassen (centre) celebrates with her Australian teammates after catching Sophia Dunkley in the T20 match at Lord’s. Credit: Getty Images A CA spokesperson confirmed discussions were ongoing but declined to comment further when contacted by this masthead. More talks took place this week around the ICC’s annual conference in South Africa, where member nations have approved a proposal to hand the BCCI as much as 38 per cent of revenue from the recent $US3 billion ($4.35 billion) sale of the rights to global events. This is nearly double the 22 per cent India were allotted under the previous distribution deal, signed off in 2017. Among other determinations, T20 franchise leagues were given greater regulation including a minimum threshold of seven local players per team. Baird, who became the new chair of CA earlier this year , is set to join the ICC’s powerful finance and commercial affairs committee, placing him head to head with the BCCI’s influential secretary Jay Shah on the big questions of cricket economics. The WPL’s spectacle, featuring big crowds and large TV audiences after the BCCI sold rights to the event to Viacom18 for $US116.5 million ($169 million) over five years, has been a significant driver for the Champions League idea. It would be a far more significant development for the game than the announcement of equal prize money for men’s and women’s World Cups at the end of the Durban meeting. Unlike tennis or golf, the lifeblood of a cricketer’s career is contracts and match payments, which would rise considerably should the Champions League become a success. Introduction of the league, with broadcast rights revenue to be shared among the countries involved, would mimic the attempt to start a men’s T20 Champions League when the IPL was launched in 2008. That tournament, sold for nearly $US1 billion ($1.45 billion) to Star Sports, was abandoned after six editions as it failed to generate enough spectator interest to justify the high price tag. Its revenue was shared between India, Australia and South Africa, after England’s board dropped out of discussions. This time around, the concept of a women’s Champions League is seen as the logical next step to capitalise on the strength of the WPL, the WBBL and the Hundred competition in England. There is no suggestion that CA, the BCCI and the ECB are considering the relaunch of a men’s Champions League. Big crowds and high-quality cricket have been a hallmark of each of the last two women’s T20 World Cups also, in 2020 in Australia shortly before the outbreak of COVID-19, and then in South Africa earlier this year, where Australia again prevailed in a tight tussle against the hosts. It is possible that the tournament will also include teams from other leagues such as the Caribbean Premier League, but there is a desire to start the event in a focused manner and grow from there. Locations would be rotated, with match revenue from tickets and corporate hospitality to be retained by the host nation. Australia’s captain Alyssa Healy has spoken about the need for the women’s game to be supported by wider investment down development pathways in more nations. Meg Lanning’s dismissal for 35 was a big moment in the WPL final this year. Credit: Getty Images “I think it takes support and investment from the global bodies to invest in their women’s teams and their women’s pathways in particular,” Healy said earlier on the current Ashes tour. “There’s no secret to why this team has been successful for a long period of time, it’s because we’ve got great domestic pathways. “They were invested in a long time ago and it’s developed some amazing players. The likes of Annabel Sutherland and Phoebe Litchfield can almost come straight into international cricket and perform right away. That really helps, and I think a lot of nations are catching up, they’re doing some great things.” The Marylebone Cricket Club’s world cricket committee reached a similar conclusion at their recent meeting ahead of the Lord’s Ashes Test. “The growth of the women’s game must also be consistent with the growth of the game as a whole,” chair Mike Gatting said. “We need to ensure that nations are rewarded for their commitment to investing in both the men’s and women’s game alike, and a ring-fenced fund could be an important step here. “We have seen similar reports previously, which haven’t led to actions or tangible improvements. The WCC firmly believes that if we are to protect the game of cricket as a whole, immediate action must be taken to bring about significant transformation in the sport.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-13 22:38:32","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"2023 Sports Capital &amp; Equipment Programme to open on 17 July","link":"https://www.cricketireland.ie/news/article/2023-sports-capital-equipment-programme-to-open-on-17-july","keywords":null,"creator":null,"video_url":null,"description":"The Sports Capital and Equipment Programme (SCEP) is operated by the Irish Government and provides grants to assist in the development or refurbishment of sports facilities and the provision of sports equipment. It is part funded from the proceeds of the National Lottery.","content":"The 2023 round of the Programme will open for applications from 9am, Monday 17 July 2023 until 5pm, Friday 8 September 2023 and Cricket Ireland is urging all clubs based in the Republic of Ireland to consider, prepare, and apply ahead of the deadline. If they haven’t done so in previous rounds of the scheme, clubs must register with the programme in advance and the deadline for registration of a club is 5pm on Friday 25th August 2023. The Department have renewed the portal that is used to apply for funding and manage the drawdown of grants and it can be accessed at www.sportscapitalprogramme.ie To support clubs with their applications, Cricket Ireland in partnership with the various Provincial Unions, will deliver several guidance workshops, the details of which will be announced shortly. Outlined below are several underlined Useful Links that clubs are encouraged to visit if considering an application. Within them there are details about the programme, how to register and apply and video guide to making an application. 1. A guide to registration is available. 2. Frequently Asked Questions about the Programme 3. The 2023 Guide to making an application 4. A video guide to making an application 5. The 2020 Sports Capital Programme Scoring System and Assessment Procedures 6. The Sports Capital Programme Guide to Accessible Gym Equipment . For more information on #6 above, Cara - Sport Inclusion Ireland have created resource Factsheets on how to make your sports facilities, equipment and activities more accessible to people with disabilities. If your clubs are interested in applying and would like further information, feel free to contact richard.fahey@cricketireland.ie , emma.butler@cricketireland.ie or your Provincial Union.","pubDate":"2023-07-13 22:10:16","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Jaiswal, Rohit tons put India on top against Windies","link":"https://www.perthnow.com.au/sport/cricket/jaiswal-rohit-tons-put-india-on-top-against-windies-c-11274047","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Opening bats Yashasvi Jaiswal and captain Rohit Sharma have put India in a commanding position in the first Test against the West Indies in Dominica.","content":"Centuries by debutant Yashasvi Jaiswal and captain Rohit Sharma have given India a 162-run lead against the West Indies on day two of the first Test. Jaiswal carried his bat through the day to be 143 not out on debut. He and Rohit moved their opening partnership from 80 overnight to 229. But after a middle-session pick up, India crawled to stumps on 2-312. Virat Kohli (36 not out) was with Jaiswal. West Indies middle-order bat Alick Athanaze earned his maiden Test wicket when he got Rohit and broke the massive opening stand. Athanaze's 13 overs of off-spin compensated for the absence of Rahkeem Cornwall, who bowled his third maiden over before walking off in the morning session due to a chest infection. Jaiswal and Rohit were restricted to 66 runs in 32 overs in the first session, but that was enough to post India's first 100-run opening partnership in 11 Tests. After lunch, Jaiswal and Rohit showed more intent without really getting their timing right. They passed West Indies' total of 150 about six overs quicker, marking the first time India took a first-innings lead in a Test without losing a wicket. After the stand reached 200, Jaiswal became the 17th Indian man to score a Test century on debut, matching Rohit, who was the 14th in 2013. From the 215th ball he faced, Jaiswal paddle-swept a single to fine leg off Athanaze and celebrated exuberantly, raising his arms and leaping to punch the air. Soon after, the batters owned the highest opening partnership outside Asia when they eclipsed the 213 by Sunil Gavaskar and Chetan Chauhan in 1979 against England at the Oval. This was only India's third ever double-century opening stand outside Asia. Rohit finally posted his 10th Test hundred with a cover drive to the boundary, then was out next ball when he gloved Athanaze off his thigh to wicketkeeper Joshua Da Silva. Rohit made 103 off 221 balls with 10 boundaries and two sixes. Shubman Gill requested to drop in the order from opener to No.3 and made only six when he was caught by Athanaze at short second slip off spinner Jomel Warrican. India added 99 runs in the middle session and only 67 runs in 32 overs after tea. West Indies used up their third and last review trying to get Kohli out on nine but he didn't touch the ball. Without a review, West Indies rued what might have been when pacer Kemar Roach hit Jaiswal on his back pad on 133. West Indies appealed for leg before without success and ball tracking showed the ball would have hit leg stump. Kohli, content to help Jaiswal grind things out, took 81 balls to hit his first boundary and punched the air. By stumps, he'd used up 96 balls to make 36. He played second fiddle to Jaiswal, who had the highest score by an Indian man on debut outside Asia, and counting.","pubDate":"2023-07-13 22:05:50","image_url":"https://images.perthnow.com.au/publication/C-11274047/300c022dedf0b76f8771ed4ad4482c5c98b391c3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Zimbabwe cricket growth charms Andy Flower","link":"https://www.chronicle.co.zw/zimbabwe-cricket-growth-charms-andy-flower/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com CRICKET in Zimbabwe has been on a positive trajectory over the past couple of years and has seen a rise in followership with fans filling stadia whenever the national team plays. The steady growth of the sport in the country has charmed many from even outside the borders. The passion and love […]","content":"The Chronicle CRICKET in Zimbabwe has been on a positive trajectory over the past couple of years and has seen a rise in followership with fans filling stadia whenever the national team plays. The steady growth of the sport in the country has charmed many from even outside the borders. The passion and love that has been seen over the past years is testimony that the game is gaining popularity. One man who liked what he saw during the recently ended 2023 Men’s Cricket World Cup Qualifiers which were held in Zimbabwe is one of the country’s finest cricketers ever and an International Cricket Council (ICC) Hall of Famer, Andy Flower. Returning to Zimbabwe as part of the commentary team for the Qualifiers for the first time in over two decades, Flower was pleased with the growth of the sport in the country as a lot of work and effort has been put in to make sure that the game stays on top where it belongs. In an interview with ICC, Flower said he was pleased with what he saw at the country’s two biggest cricket stadiums, Queens Sports Club and Harare Sports Club having watched matches in Bulawayo and Harare where fans and the atmosphere was out of this world. He also noted a change in followership of the sport in the country as it has now become more popular to the black majority who have been showing appreciation for the sport unlike during their days as players. “Before I arrived in Zimbabwe, I would have had a lukewarm response to a question about the future of Zimbabwean cricket. Now that I’m just about to leave, I feel much more positive. They (fans) threw love out towards everyone in the ground, even the little bit of barracking with the opposition was done in good spirit, and that I think I’ll remember for years. “The energy in the crowd. The love for the game, the feeling of support and love for the players while they were playing and while the crowd was singing and dancing and loving their day, but also taking note of every single ball. It was really interesting for me to see the change in the demographic in the crowd. When we were playing, it was mostly a White crowd, and the change that I have seen after being away for so long is such a great change for Zimbabwe,” he said. Over the past year, Zimbabwe has been playing positive cricket under the stewardship of Dave Houghton. Some of the Chevrons’ notable victories include a final ball one run win over Pakistan in the T20 World Cup and also their first ODI victory over Australia Down Under, winning by three wickets after a Ryan Burl masterclass with the ball. The Chevrons also managed to reach the Super 12 stage of the T20 World Cup for the first time. Most recently, Zimbabwe beat the West Indies in their group match of the World Cup Qualifiers at Harare Sports Club. The positivity, courage and the mentality that the team now has is something that also caught Flower’s attention. Zimbabwe has enjoyed a good run in international cricket. “One thing that stands out for me is the confidence with which Zimbabwe are playing their cricket, and I think partly that comes from exposure to international matches, to international tournaments and series. I see a certainly strong spirit in them. They have some experienced players, they’ve got a few youngsters and it’ll be an interesting transition when they move on from some of their experienced players in the next few years. But I do see a fighting spirit. You see that in the way that they field,” said Flower He remains the only Zimbabwean to have made it to the ICC Hall of Fame and is considered one of the finest wicket-keeper batters of all time across the globe. In 63 Test matches, Flower scored 4 794 runs with a high score of 232 runs not out at a staggering average of 51,54 while in one day cricket, the 55-year-old scored 6 786 runs from 213 games with a high score of 145 runs and an average of 35,34. He has 16 international tons. – @brandon_malvin","pubDate":"2023-07-13 22:01:26","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping","link":"https://www.dailymail.co.uk/sport/cricket/article-12297173/Why-fast-bowling-crickets-primeval-act-does-not-just-spill-blood-gets-pumping.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Fast bowling has always been cricket's most primeval act, a skill that comes from the heart not the brain and takes practitioners to places beyond logic.","content":"Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping... that's why there will be a guttural roar when England's Mark Wood charges in to bowl at 97mph at Old Trafford next week Crowd gasped after Mark Wood’s fastest ball at Leeds — 96.5mph — was relayed Shoaib Akhtar holds record for a delivery clocked at 100.2mph against England Dennis Lillee rejoiced in terrorising batsmen with a bouncer at the rib-cage By Lawrence Booth for the Daily Mail Updated: 22:57, 13 July 2023 e-mail View comments On the day he sparked Australia ’s dramatic first innings collapse in the third Test, Mark Wood was asked what it was like to see his speed flashed up on Headingley’s big screen. He answered in two syllables: ‘Woo hoo!’ Frankly, what more was there to be said? Fast bowling has always been cricket’s most primeval act, a skill that comes from the heart not the brain and takes practitioners to places beyond logic. Frank Tyson, the England quick who terrorised Australia in 1954-55, spoke of the ‘glad animal action’ of bowling fast. On the other side of the Ashes divide, Dennis Lillee rejoiced in the ‘sheer “I can fly” exhilaration… it’s seeing that look of apprehension on your quarry’s face’. The language is bestial, of hunter and hunted. When Wood’s fastest ball at Leeds — 96.5mph — was relayed to the crowd, they gasped at the brutishness it conveyed. And, for Wood, it was confirmation that everything was in working order. Woo hoo indeed. Not that he came close to the world record. That is held by Pakistan’s Shoaib Akhtar, who in a World Cup game against England at Cape Town in 2003 was clocked at 100.2mph and was known as the Rawalpindi Express. Strange, then, that the delivery — in the words of Wisden — was ‘comfortably repulsed’ by Nick Knight. Fast bowler Mark Wood sparked Australia’s dramatic first innings collapse in the third Test Australia's Dennis Lillee rejoiced in terrorising batsmen with a bouncer at the rib-cage Since Shoaib, only two others have passed the mythical 100mph, both in one-day internationals for Australia — Brett Lee, in 2005 against New Zealand at Napier, and Shaun Tait, in 2010 against England at Lord’s. Wood says he can bowl faster than at Headingley and with good reason — last winter against Pakistan at Multan, he flew in at 97.3mph. One thing is certain. In a series already overflowing with subplots, all eyes will be on the speed gun when the Ashes resumes in Manchester next week. Central to the drama surrounding fast bowling is the threat of physical danger, as if cricket becomes something the Romans might have bayed for in the Colosseum. Jeff Thomson, the slingy Australian who was once said to have clocked 99.8mph at Perth’s WACA, was unapologetic about the edge this threat gave him. After putting an opponent in hospital for a week with a blow to the eye in a grade match, he admitted it was ‘frightening to see this bloke just screaming and shaking and the pitch splattered with blood as it poured through his fingers’. Ominously, though, he added: ‘I never let this sort of thing put me off.’ He was especially undeterred against England, whom he destroyed during the 1974-75 Ashes with the help of Lillee. ‘I thought, “Stuff that stiff-upper-lip crap”,’ said Thomson. ‘Let’s see how stiff it is when it’s split.’ Lillee was just as unflinching. ‘I try to hit a batsman in the rib-cage when I bowl a purposeful bouncer,’ he once said. ‘I want it to hurt, so the batsman doesn’t want to face me any more.’ The English players from that series, which Australia won 4-1, speak of shellshock, as if the balls were bullets and the crease a trench. David ‘Bumble’ Lloyd’s after-dinner story about having his inadequate box snapped open and, painfully, shut by Thomson has given that tour more humour than it deserves. Above all, there is little time for manoeuvre against fast bowling. While a 90mph delivery might slow to about 80mph before pitching, then to 72mph after it hits the turf, that still leaves the batsman just 0.4 seconds to react. Yet a study in Western Australia once suggested you need 0.3 of a second to make any sense of where the ball may land and another 0.3 of a second to execute your stroke. In other words, pre-meditation is the only option. As John Snow, the England fast bowler who helped Ray Illingworth’s side win the Ashes in Australia in 1970-71, put it: ‘Speed defeats reactions.’ You could see it in the way Australia’s lower order flinched at Wood, hoping to connect or simply survive. Only when Travis Head had his eye in on the third evening was Wood treated with anything other than apprehension. Fast bowling does not just spill blood, it gets it pumping like nothing else in cricket and like few activities in any sport. Perhaps the most famous over ever bowled was by Michael Holding to Geoffrey Boycott at Bridgetown, Barbados, in 1981, which ended with Boycott bowled for a duck. After he fell to Holding again in the second innings for a single, he was asked by a curious, and brave, waiter at the team hotel: ‘Did you see any of them?’ Australian paceman Jeff Thomson was unapologetic about the edge this threat gave him Boycott, owner of arguably the tightest defence in the game’s history, replied: ‘I saw them all. I just couldn’t play any of them.’ Others chose not to play any of them. On a brute of a pitch in Jamaica in 1976, Bishan Bedi declared India’s first innings on 306 for six to spare his lower order the ordeal of facing Holding, Wayne Daniel and Co. In the second innings, India got to 97 for two, but no further. Three wickets fell for none, while the remaining five batsmen were ‘absent hurt’. It was sobering to think West Indies had not yet embarked on their reign of terror, in which the psychological and physical grip exerted by their four-man attacks ensured they did not lose a Test series between 1980 and 1995. See off Holding and Andy Roberts and you had to contend with Joel Garner and Colin Croft. After them came Malcolm Marshall, Patrick Patterson, Curtly Ambrose and Courtney Walsh. There have been few more thrilling spells in England than the one sent down by Jofra Archer to Steve Smith in the 2019 Ashes Test at Lord’s. Hit on the head, Smith was ruled out of the next game due to concussion. The legend of Archer’s spell meant Smith recently pointed out on Twitter that Archer had not, in fact, taken his wicket. Only the toughest mentally survive the assault. Graham Gooch, one of the greatest players of pace, once said: ‘If I went out to start an innings thinking about being hit, I could not play the game. My entire technique would collapse.’ His England team-mate Robin Smith, another superb player of fast bowling, went for hypnosis after he had his jaw broken by West Indies’ Ian Bishop at Old Trafford in 1995. The hypnotist was Derren Brown and his techniques did the trick. Smith never feared fast bowling again and later explained his tactics to the Guardian: ‘You draw an imaginary line down the pitch, somewhere near the middle, and whenever the ball hits that line, you hit the f****** deck.’ Not all fast bowlers have been comfortable inflicting pain. England’s Peter Lever could never forget hitting New Zealand No 11 Ewen Chatfield on the left temple at Auckland in 1975, years before protective headwear. Chatfield collapsed to the ground and swallowed his tongue. For a few seconds his heart stopped beating and it needed quick work by England physio Bernie Thomas to save his life. ‘I honestly thought I had killed him,’ said Lever. ‘I felt sick and ashamed. All I could think when I got back to the pavilion was I wanted to retire.’ Len Pascoe, a rugged Australian quick, had similar thoughts after hitting India’s Sandeep Patil in the face in 1981. Until then, he had traded off fear, but the incident led to introspection. ‘The game’s not worth dying over,’ he said. ‘I was worried about what I was becoming. It wasn’t me.’ After the death of Australia batsman Phillip Hughes following a blow to his vertebral artery on the side of his neck in a Sheffield Shield game in 2014, research was done into the number of deaths caused by cricket. According to Peter Brukner, then Australia team doctor, and historian Tom Gara, there were 544 cricket-related deaths in Australia, Britain and New Zealand dating back to 1850, with most caused by a blow to the heart or head. Since their research covered only three countries, the true number is likely to be much higher. Batsmen these days, of course, have more protection thanks to the introduction of helmets in the late 1970s, though this also means they are less likely to sway out of the way of bouncers, paradoxically increasing the chances of being hit. Are fast bowlers getting faster? Fred Trueman of Yorkshire and England, who once described himself as ‘the greatest bloody fast bowler that ever drew breath’, would be appalled at the thought that he was not in the same category as Wood, even if footage suggests he was not. Yet fast bowling may be one area of human endeavour where progress is not plotted on a smooth curve. Harold Larwood, England’s Bodyline hero of 1932-33, was said to have touched 96mph, though the evidence for this is sketchy. Shoaib’s record, meanwhile, has remained intact for 20 years. Since fast bowling is about more than the speed of the approach, it is easy to see why bowlers are not simply getting quicker. Also important are a long final stride, a braced front leg and the speed of the arm. As Shoaib found, a hyperextending elbow can help, too. There is no one-size-fits-all, no identikit method of making a fast bowler. It can be a mysterious process, dependent on temperament and defying reason. It connects with fans at an elemental level and makes batsmen question their life choices. It is why, when the Ashes resume, there will be a guttural roar as Wood charges in to deliver his first ball. Share or comment on this article: Why fast bowling is cricket's most primeval act: It does not just spill blood, it gets it pumping e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 21:30:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/21/73195497-0-image-m-30_1689281790530.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 1st Test 2023: Yashasvi Jaiswal, Rohit Sharma's Centuries on Day 2 Pile More Misery on West Indies, India Lead By 162 Runs","link":"https://www.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-2023-yashasvi-jaiswal-rohit-sharmas-centuries-on-day-2-pile-more-misery-on-west-indies-india-lead-by-162-runs-5264338.html","keywords":null,"creator":null,"video_url":null,"description":"It was another day of India's dominance in this Test match with centuries from both openers laying the platform for a huge first innings total. West Indies had two successes with Alick Athanaze and Jomel Warrican amongst the wickets.","content":"India have dominated yet another day in this Test match, with the highlight of the performance being sparkling hundreds from Rohit Sharma and Yashasvi Jaiswal. While the Indian captain got to his 10th Test hundred, for Jaiswal, it was a historic first as he became the first Indian to score a Test century on debut in the West Indies, in addition to becoming the 17th overall from the country to get to the three-figure mark. Rohit departed after his hundred and West Indies gained a bit of momentum after they Shubman Gill (6) as well in a short span of time. But Jaiswal and Virat Kohli (36*) added 72 undefeated runs to help India finish Day 2 with a 162-run lead. Virat Kohli Completes 8500 Test Runs, Surpasses Virender Sehwag To Become Fifth-Highest Run-Scorer for India in Longest Format During IND vs WI 1st Test 2023. Yashasvi Jaiswal, Rohit Sharma Help India Dominate Day 2 India continues to dominate in Dominica!!! Jaiswal & Rohit are the stars with terrific hundreds then Kohli has been solid with 36* - lead by 162 runs in first innings during Day 2 stumps. pic.twitter.com/Wp7KUjQljv — Johns. (@CricCrazyJohns) July 13, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-13 21:29:27","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-1st-test-highlights-jaiswals-ton-on-debut-helps-india-reach-312-2-at-stumps-stretch-lead-to-162-12863972.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162","content":"India vs West Indies 1st Test Highlights: Jaiswal's ton on debut helps India reach 312/2 at stumps, stretch lead to 162 India vs West Indies 1st Test Day 2 Highlights: IND 312/2; Yashasvi Jaiswal remains unbeaten on 143 off 350 balls with Virat Kohli batting on 36 and the unbroken partnership between the two worth 72 as India end the day 162 runs ahead of West Indies. FirstCricket Staff Last Updated:July 14, 2023 02:57:10 IST India vs West Indies, 1st Test Day 2 LIVE Score: India opener Yashasvi Jaiswal in action on Day 2 of the first Test against West Indies at the Windsor Park in Roseau, Dominica. AP FP commentary Quick Scorecard Full scorecard Ball by ball commentary West Indies Vs India At Windsor Park, Roseau, Dominica, 12 July, 2023 12 July, 2023 Starts 19:30 (IST) Stumps West Indies 150/10 (64.3 ov) 1st Test India 312/2 (113.0 ov) Live Blog Live Updates Highlights 02:56 (IST) That brings us to the end of our coverage of Day 2 of the first Test between West Indies and India at the Windsor Park in Roseau, Dominica. Do join us tomorrow for the third day's play. For now, this is Amit signing off, wishing you all a good night! Full Scorecard 02:52 (IST) India vs West Indies LIVE Score Yashasvi Jaiswal, who remained unbeaten on 143 at the close of play, speaks to Samuel Badree after stumps: “I think this knock was one of the emotional knock for me. I would like to thank each and everyone, especially selectors and Rohit bhai for giving me the chance to go and express myself. Wicket was difficult to bat on. I was taking to Rohit bhai and Virat bhaiya about scoring on this surface. It’s been pretty hot, and I have to keep thinking that I have to do it for the country. I was just enjoying my cricket. I love Test cricket because it is always going to test you and I love that challenge. I had prepared for it. We really worked hard on each and every part. (On the century celebration) It was really emotional, and I am proud of myself. This is just the start.\" Full Scorecard 02:45 (IST) India vs West Indies LIVE Score After 113 overs,India 312/2 ( Yashasvi Jaiswal 143 , Virat Kohli 36) STUMPS ON DAY 2: Yashasvi Jaiswal remains unbeaten on 143 in 350 deliveries, stitching a patient third-wicket partnership with Virat Kohli worth 72 as India end the day 162 runs ahead of the West Indies with eight wickets in hand! Barring a couple of hiccups shortly before the tea interval in which Rohit Sharma and Shubman Gill fell to spin in quick succession, the day well and truly belonged to the Indians, who did not lose a single wicket in two out of three seasons and are well placed to stretch their lead beyond the Windies' reach on the third day and go 1-0 up in the two-match series. Jaiswal, meanwhile, will be heading back to the team hotel dreaming about the possibility of becoming the first Indian batter to score a double-hundred on Test debut. Full Scorecard 02:28 (IST) India vs West Indies LIVE Score After 109 overs,India 302/2 ( Yashasvi Jaiswal 140 , Virat Kohli 29) FOUR! Virat Kohli punches the air in delight after collecting his first boundary after facing 81 deliveries! Drives the flighted delivery from Jomel Warrican outside off through the extra cover region for an easy boundary. The boundary also brings up the 300 for India . Full Scorecard 02:26 (IST) India vs West Indies LIVE Score After 108 overs,India 298/2 ( Yashasvi Jaiswal 140 , Virat Kohli 25) West Indies keeper Joshua Da Silva cops a painful blow while collecting the ball in Roach's 16th over. Apparently the ball had hit him on a taped-up finger and leads to the home team physio walking out to have a look. Meanwhile, Alzarri Joseph has left the field and he is replaced by left-arm seamer Raymond Reifer, who has bowled a solitary over so far today. Two singles off Reifer's over, the second of which takes Virat Kohli past Virender Sehwag's Test run-tally of 8,503 runs for India . Full Scorecard 02:14 (IST) India vs West Indies LIVE Score After 106 overs,India 296/2 ( Yashasvi Jaiswal 139 , Virat Kohli 24) Kohli collects a brace after steering the ball wide of the slip cordon off Roach's bowling at the start of the 105th over. FOUR! Jaiswal punches a length ball from Joseph outside off behind point to collect his 14th boundary, and the first of the innings in nearly 24 overs. India a hit away from 300 now. Another seven overs left to be bowled today. Full Scorecard 02:08 (IST) India vs West Indies LIVE Score After 104 overs,India 290/2 ( Yashasvi Jaiswal 135 , Virat Kohli 22) Jaiswal and Kohli collect a single each in Joseph's 13th over, and that brings up the fifty partnership for the third wicket . The pair have consumed 150 balls in the stand so far. Full Scorecard 02:07 (IST) India vs West Indies LIVE Score After 103 overs,India 288/2 ( Yashasvi Jaiswal 134 , Virat Kohli 21) Lucky escape for Yashasvi Jaiswal after a confident shout for LBW by Kemar Roach and the West Indians! Umpire Richard Kettleborough shakes his head, and Windies unfortunately are out of reviews! HawkEye shows three reds in favour of the bowling side , with Impact bang at the centre of the middle stump and the ball going on to hit middle and leg. Roach buries his head in disappointment, knowing he fully deserved the wicket. It's just been his day so far. Jaiswal sets off for a risky single in the next ball and manages to reach the non-striker's end despite a direct hit from mid off. Jaiswal, meanwhile, adds another feather to his cap, going past Mohammad Azharuddin's record for most deliveries faced by an Indian on Test debut. Azharuddin had faced 322 deliveries on debut against England at Kolkata's Eden Gardens in 1984. Full Scorecard 01:54 (IST) India vs West Indies LIVE Score After 102 overs,India 286/2 ( Yashasvi Jaiswal 133 , Virat Kohli 20) West Indies finally have decided to take the second new ball after the 100th over, with skipper Brathwaite opting to hand the brand new Dukes cherry to Kemar Roach and Alzarri Joseph. Roach appeals for an LBW against Kohli in the first delivery with the second new ball, with the umpire shaking his head and the ball appearing to slide down leg. Full Scorecard 01:47 (IST) India vs West Indies LIVE Score After 100 overs,India 282/2 ( Yashasvi Jaiswal 132 , Virat Kohli 18) Jermaine Blackwood, who bowls off-spin part time, comes in as the ninth bowling option for the West Indies in this innings. Concedes a single off his first delivery with Kohli working the ball through the midwicket region. Turns out to be a case of change from both ends with Kemar Roach steaming in from the other end. Kohli welcomes him into his new spell with a drive through the extra cover region that fetches him a brace. Jaiswal collects a brace off Blackwood in the following over with a brace off a cut in front of square. 100 overs up in the Indian innings. The visitors continue to collect runs at a steady pace, their scoring rate remaining below three throughout today. Full Scorecard Load More Highlights 02:45 (IST) India vs West Indies LIVE Score After 113 overs,India 312/2 ( Yashasvi Jaiswal 143 , Virat Kohli 36) STUMPS ON DAY 2: Yashasvi Jaiswal remains unbeaten on 143 in 350 deliveries, stitching a patient third-wicket partnership with Virat Kohli worth 72 as India end the day 162 runs ahead of the West Indies with eight wickets in hand! Barring a couple of hiccups shortly before the tea interval in which Rohit Sharma and Shubman Gill fell to spin in quick succession, the day well and truly belonged to the Indians, who did not lose a single wicket in two out of three seasons and are well placed to stretch their lead beyond the Windies' reach on the third day and go 1-0 up in the two-match series. Jaiswal, meanwhile, will be heading back to the team hotel dreaming about the possibility of becoming the first Indian batter to score a double-hundred on Test debut. 02:28 (IST) India vs West Indies LIVE Score After 109 overs,India 302/2 ( Yashasvi Jaiswal 140 , Virat Kohli 29) FOUR! Virat Kohli punches the air in delight after collecting his first boundary after facing 81 deliveries! Drives the flighted delivery from Jomel Warrican outside off through the extra cover region for an easy boundary. The boundary also brings up the 300 for India . 02:26 (IST) India vs West Indies LIVE Score After 108 overs,India 298/2 ( Yashasvi Jaiswal 140 , Virat Kohli 25) West Indies keeper Joshua Da Silva cops a painful blow while collecting the ball in Roach's 16th over. Apparently the ball had hit him on a taped-up finger and leads to the home team physio walking out to have a look. Meanwhile, Alzarri Joseph has left the field and he is replaced by left-arm seamer Raymond Reifer, who has bowled a solitary over so far today. Two singles off Reifer's over, the second of which takes Virat Kohli past Virender Sehwag's Test run-tally of 8,503 runs for India . 02:08 (IST) India vs West Indies LIVE Score After 104 overs,India 290/2 ( Yashasvi Jaiswal 135 , Virat Kohli 22) Jaiswal and Kohli collect a single each in Joseph's 13th over, and that brings up the fifty partnership for the third wicket . The pair have consumed 150 balls in the stand so far. 02:07 (IST) India vs West Indies LIVE Score After 103 overs,India 288/2 ( Yashasvi Jaiswal 134 , Virat Kohli 21) Lucky escape for Yashasvi Jaiswal after a confident shout for LBW by Kemar Roach and the West Indians! Umpire Richard Kettleborough shakes his head, and Windies unfortunately are out of reviews! HawkEye shows three reds in favour of the bowling side , with Impact bang at the centre of the middle stump and the ball going on to hit middle and leg. Roach buries his head in disappointment, knowing he fully deserved the wicket. It's just been his day so far. Jaiswal sets off for a risky single in the next ball and manages to reach the non-striker's end despite a direct hit from mid off. Jaiswal, meanwhile, adds another feather to his cap, going past Mohammad Azharuddin's record for most deliveries faced by an Indian on Test debut. Azharuddin had faced 322 deliveries on debut against England at Kolkata's Eden Gardens in 1984. 00:19 (IST) IND vs WI LIVE Cricket Score After 81 overs,India 245/2 ( Yashasvi Jaiswal 116 , Virat Kohli 4) TEA ON DAY 2: West Indies claw back with the wickets of Rohit Sharma and Shubman Gill, both of whom fall to spin towards the end of the second session, though India still are well ahead of the hosts with a lead worth 95 and a well set Yashasvi Jaiswal at the crease. The second new ball is now available, but Windies skipper Kraigg Brathwaite is yet to take it. They might at the start of the evening session. Meanwhile, the Windsor Park surface is starting to really assist the spinners, and while the Indian batters might face a challenge from the likes of Jomel Warrican and Alick Athanaze, the development might just get Ravichandran Ashwin and Ravindra Jadeja a lot more excited. 00:06 (IST) IND vs WI LIVE Cricket Score OUT! Athanaze is part of another dismissal, this time taking a regulation catch at gully after Gill gets a nick off Warrican's bowling while attemping a defensive push. Not the best of starts for him at the No 3 position as he departs for 6. IND 240/2 Gill c Athanaze b Warrican 6(11) 00:02 (IST) IND vs WI LIVE Cricket Score OUT! Rohit departs right after bringing up his century as Alick Athanaze gets his maiden Test wicket on debut! Brathwaite goes for the review after the appeal for a catch by the keeper is turned down, and UltraEdge shows the ball brushing Rohit's glove before taking a deflection off his pad and landing between Da Silva's gloves. West Indies finally break the mammoth opening stand shortly before tea on the second day. Shubman Gill, batting at No 3 for the first time, makes his way to the centre. IND 229/1 in 76 Rohit c Da Silva b Athanaze 103(221) 23:53 (IST) IND vs WI LIVE Cricket Score FOUR! And now Rohit Sharma brings up his century — his 10th in Tests — shortly after Yashasvi Jaiswal brings up the milestone, driving a full toss from Athanaze through the covers. Reaches the milestone in 220 deliveries, collecting 10 fours and two maximums along the way. This is only his second ton away from home after his 127 against England at The Oval. IND 229/1 after 75.3 23:23 (IST) IND vs WI LIVE Cricket Score CENTURY ON TEST DEBUT FOR YASHASVI JAISWAL! What a start to the southpaw's international career! Brings up the milestone with a single off Alick Athanaze, taking 215 deliveries to bring up the milestone. Jaiswal thus becomes the 17th Indian batter to score a century on Test debut. IND 205/0 23:19 (IST) IND vs WI LIVE Cricket Score Yashasvi Jaiswal brings up 200 of the opening partnership with skipper Rohit Sharma with a single off Kemar Roach right after the drinks interval. The single also takes him to 99! IND 200/0; lead by 50 22:37 (IST) West Indies vs India LIVE Score After 61 overs,India 167/0 ( Yashasvi Jaiswal 78 , Rohit Sharma (C) 73) FOUR! Full and wide from Holder, and Jaiswal comfortably drives this behind point, joining Rohit in the 70s and bringing up India's highest opening partnership in the West Indies ! Jaiswal collects another boundary later in the 61st over, this time slashing a shorter delivery outside off but targetting the same region to move to 78. 22:34 (IST) West Indies vs India LIVE Score After 58 overs,India 151/0 ( Yashasvi Jaiswal 67 , Rohit Sharma (C) 68) Jaiswal looks to attack Warrican in the 58th over, dancing down the track in the first delivery only to push it for a dot and getting an inside edge while attempting a drive in the next delivery, coming back for a second to bring up the 150 for the visitors. He then collects a single to put India in the lead . 21:35 (IST) India vs West Indies LIVE Score After 55 overs,India 146/0 ( Yashasvi Jaiswal 62 , Rohit Sharma (C) 68) LUNCH ON DAY 2 : Rohit Sharma and Yashasvi Jaiswal continue to stand strong, both bringing up their half-centuries and stretching their partnership past the century mark as India head to the lunch interval on 146 for no loss , trailing by just four with all 10 wickets in hand. Rohit and Jaiswal have certainly been a lot more cautious in the morning session, scoring at less than three-an-over. Windies skipper Brathwaite decides to give debutant Alick Athanaze the final over of the session, and the part-time off-spinner concedes a couple of singles. 20:42 (IST) India vs West Indies LIVE Score FIFTY! India skipper Rohit Sharma gets to his 15th half-century in Test cricket! It's been a calm and composed knock from the Mumbai cricketer, and more importantly, he has been leading his team from the front here. IND 118/0 20:18 (IST) India vs West Indies LIVE Score FOUR! Pulled away in front of square by Jaiswal off Alzarri Joseph, and that brings up a half-century on international debut for the southpaw from Mumbai! Jaiswal took his time to get off the mark yesterday, but has looked a completely different batter once settled. Also brings up the century opening stand with Rohit Sharma. IND 103/0 Day 1 report: India will look to consolidate their position in the first Test against West Indies in Dominica, when they take field on Thursday for Day 2. The visitors were clinical in their approach on Wednesday after being asked to field first, with Ravichandran Ashwin, returning to the side, finishing with figures of 5/60 to see Windies off for 150. He was well-supported by fellow spin-bowling all-rounder Ravindra Jadeja, who collected three wickets for 26 runs. This was Ashwin’s 33rd five-fer in Test cricket, as well as his fifth against Windies since he made his Test debut against this very side in 2011. Barring debutant Alick Athanaze (47), none of the West Indian batters were able to convert starts into big knocks. Local boy Athanaze narrowly missed out on a half-century on Test debut, getting dismissed by Ashwin shortly before tea on the opening day. And in their first innings reply, India were 80/0 after 23 overs at stumps, with debutant Yashasvi Jaiswal (40*) and his skipper Rohit Sharma (30*) at the other end. Published on: July 13, 2023 18:01:28 IST Tags: Cricket India Vs West Indies Rohit Sharma Yashasvi Jaiswal Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-07-13 21:27:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/07/Yashasvi-Jaiswal-IND-WI-Dominica-Day-2-AP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI, 1st Test, Day 2: दूसरे दिन भारत 312/2, जायसवाल 143 रन पर नाबाद","link":"https://sports.ndtv.com/hindi/cricket/india-vs-west-indies-1st-test-day-2-live-score-updates-4204323#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, Day 2: आखिरी सीजन में विराट और जायसवाल ने पिच पर एकदम लंगर डालकर बल्लेबाजी की. खासकर विराट ने पूरी तरह से पिच पर जमने को प्राथमिकता दी. और ये दोनों अभी तक तीसरे विकेट के लिए नाबाद 72 रन की साझेदारी कर चुके हैं.","content":"IND vs WI 1st Test, Day 2: दूसरे दिन का आकर्षण पूरी तरह से यशस्वी जायसवाल की पारी रही विंडीज के खिलाफ बुधवार से शुरू हुई दो टेस्ट मैचों की सीरीज के पहले टेस्ट के दूसरे दिन वीरवार को मेहमान भारतीय टीम ने विंडीज पर शिकंजा कसते हुए दिन का खेल खत्म होने पर 2 विकेट पर 312 रन बना लिए हैं. पहले ही टेस्ट में शतक बनाने वाले यशस्वी जायसवाल 143 और विराट कोहली 36 रन बनाकर पिच पर जमे हुए हैं. इस तरह भारत ने पहली पारी के आधार पर फिलहाल 162 रन की बढ़त हासिल कर ली. आखिरी सेशन में विंडीज के गेंदबाज कोई विकेट नहीं ले सके. हालांकि, केमार रोच की एक गेंद पर जायसवाल एलबीडब्ल्यू आउट थे, लेकिन जब अंपायर ने उन्हें नॉटआउट दिया, तो मेजबान टीम के रिव्यू खत्म हो चुके थे. बहरहाल, इस आखिरी सेशन में विराट और जायसवाल ने पिच पर एकदम लंगर डालकर बल्लेबाजी की. खासकर विराट ने पूरी तरह से पिच पर जमने को प्राथमिकता दी. और ये दोनों अभी तक तीसरे विकेट के लिए नाबाद 72 रन की साझेदारी कर चुके हैं. इससे पहले चायकाल के समय भारत ने अपनी पहली पारी में 2 विकेट पर 244 रन बना लिए थे. इस समय ओपनर यशस्वी जायसवाल 116 और विराट कोहली 4 रन बनाकर क्रीज पर जमे हुए थे. दूसरे सेशन में जहां करियर का पहला टेस्ट खेल रहे लेफ्टी बल्लेबाज यशस्वी जायसवाल ने शतक जड़ा, तो कप्तान रोहित शर्मा भी करियर का 10वां शतक बनाने में कामयाब रहे. हालांकि, रोहित शतक बनाने के कुछ देर बाद आउट हो गए, लेकिन उन्होंने जायसवाल के साथ पहले विकेट के लिए 229 रन की साझेदारी करके भारत के विशाल स्कोर की मजबूत आधारशिला रख दी. भारत के 2 विकेट गिर चुके हैं. अगले बल्लेबाज शुभमन गिल 6 ही रन बना सके. विंडीज के लिए एक विकेट अथांजे, तो एक वारिकैन ने लिया. और दिन भर में भारत के गिरने वाले बस यही दो विकेट रहे. शुरुआती सेशन की बात करें, तो भारत ने मेजबानों पर अपना शिकंजा और कसते हुए अपनी पहली पारी में बिना नुकसान के 146 रन बनाए थे. और इस समय भारत पहली पारी में विंडीज से सिर्फ 4 ही रन पीछे था.. वीरवार को भारत ने अपने बुधवार के स्कोर बिना नुकसान के 80 रन से आगे खेलना शुरू किया. और दोनों ही नाबाद बल्लेबाजों बिना कोई उतावलापन दिखाए हुए पिच पर टिककर बल्लेबाजी की. एक-दो जोरदार अपीलों को छोड़ दें, तो विंडीज के बॉलर रोहित और जायसवाल पर बिल्कुल भी असर नहीं डाल सके. जायसवाल अर्द्धशतक ने पहले चौके जड़कर अर्द्धशतक पूरा किया, तो उसके कुछ देर बाद रोहित ने भी पचासा जड़ दिया. लंच के समय कप्तान रोहित 68 और जायसवाल 62 रन बनाकर क्रीज पर जमे हुए थे. मैच के पहले दिन टीम इंडिया मेजबान टीम को उसकी पहली पारी में 150 रन पर समेटने के बाद दिन का खेल समाप्त होने पर अपनी पहली पारी में बिना किसी नुकसान के 80 रन बना लिए थे. तब रोहित शर्मा नाबाद 30 और जायसवाल बिना आउट हुए 40 रन बनाकर पिच पर जमे हए थे. इस टेस्ट के जरिए यशस्वी जायसवाल और इशान किशन अपने टेस्ट करियर का आगाज किया रोहित शर्मा (कप्तान) 2. यशस्वी जायसवाल 3. शुभमन गिल 4. विराट कोहली, 5. अजिंक्य रहाणे 6. रवींद्र जडेजा 7. इशान किशन 8. आर. अश्विन 9. शार्दूल ठाकुर 10. जयदेव उनाडकट11. मोहम्मद सिराज 1, क्रेग ब्रैथवेट (कप्तान) 2, तेजनारायण चंद्रपॉल 3. रेमन रीफर 4, जर्मेन ब्लैकवुड 5. एलिक अथानाज़ 6. जोशुआ डा सिल्वा (विकेट कीपर) 7. जेसन होल्डर 8. केमार रोच 9. अल्ज़ारी जोसफ 10. रकीम कोर्नवाल 11. जोमेल वारिकन| पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-07-13 21:19:48","image_url":"https://c.ndtvimg.com/2023-07/gc2dbt7_s_625x300_13_July_23.jpg?im=FeatureCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"}]}