{"newsArray":[{"title":"Aussies claim gold in cricket amid COVID drama","link":"https://www.cairnspost.com.au/sport/commonwealth-games/aussies-claim-gold-in-cricket-amid-covid-drama/video/b2db668b681fdf4cdd70c211207aa0ef","keywords":["Commonwealth Games"],"creator":null,"video_url":null,"description":"Commonwealth Games: Australia have beaten India by nine runs to claim gold in the cricket amid COVID drama.","content":null,"pubDate":"2022-08-07 23:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia win historic cricket gold at Commonwealths as athletics wraps up","link":"https://www.bangkokpost.com/sports/2363786/australia-win-historic-cricket-gold-at-commonwealths-as-athletics-wraps-up","keywords":null,"creator":null,"video_url":null,"description":"BIRMINGHAM (UNITED KINGDOM) - Australia won the first women's cricket gold medal in Commonwealth Games history on Sunday as Scotland's Laura Muir captured the 1500m title on the final night of athletics.","content":"BIRMINGHAM (UNITED KINGDOM) - Australia won the first women's cricket gold medal in Commonwealth Games history on Sunday as Scotland's Laura Muir captured the 1500m title on the final night of athletics. On the penultimate day of competition in Birmingham, England's women won hockey gold and Australia beat Jamaica in the netball final. With just a few events to go on Monday, Australia lead the way with 66 golds, 11 ahead of hosts England. Hot favourites Australia held their nerve to beat India by nine runs in a Twenty20 thriller in front of a big Edgbaston crowd. Opener Beth Mooney top-scored with 61 as Australia made 161-8 in their 20 overs in the warm sunshine. India appeared to be on course for a shock win when they were cruising at 118-2. But the dismissals of Jemimah Rodrigues (33) and captain Harmanpreet Kaur (65) sapped their momentum and they fell frustratingly short. Australia partied on the pitch as the lights went out around the stadium. \"It's absolutely huge,\" said left-arm spinner Jess Jonassen. \"We are blessed enough to be part of some winning World Cup teams but to win the first gold medal for women's cricket in the Commonwealth Games, you're only ever going to do that once.\" Victory underlines the dominance of Australia's women, who are also world champions in the 20-over and 50-over formats. In the bronze medal match earlier on Sunday, New Zealand coasted to an eight-wicket win over England. - Muir gold - Muir ended her Commonwealth Games campaign with a flourish by winning gold in the 1500m at the Alexander Stadium. The 29-year-old's team-mate, 10,000m champion Eilish McColgan, just failed in her bid for memorable double, finishing second behind Kenya's impressive world silver medallist Beatrice Chebet in the women's 5,000m. Muir, who won bronze in the 800m on Saturday, kicked for glory before the bell and ran a fairly moderate field -- lacking two-time Olympic champion Faith Kipyegon -- ragged, timing 4min 02.75sec. The Olympic silver medallist was overjoyed, having failed to medal in 2014 and missing the 2018 Games due to veterinary exams. \"You learn from it and your time will come,\" said Muir. \"It sounds cheesy but it's true. Eight years of Commonwealths and it's been bugging me so this means a lot.\" Wyclife Kinyamal defended his men's 800m crown in a time of 1:47.52. It was an impressive turnaround for the 25-year-old, who finished last in the final of the world championships in July. \"Eugene (the world final) was disappointing but it is just like any race,\" he said. \"Because if today you win, tomorrow you lose. \"I guess because I failed there, I looked forward to coming here to defend my title.\" New Zealand cyclist Aaron Gate won the men's road race to collect his fourth gold medal of the Commonwealth Games. \"Three felt great and I was super happy with that,\" said Gate, who won three track events earlier in the Games. \"I came here today and managed to help the team, and if the opportunity arose to go for a fourth one I just had to grab it with both hands.\" In the women's race, Australia's Georgia Baker won her third gold of the games. England won hockey gold for the first time after holding off a fightback from Australia to win 2-1. Second-quarter goals from Holly Hunt and Tess Howard ultimately provided decisive 24 hours after the men's team had suffered semi-final despair at the hands of Australia. Australia's men, who are six-time defending champions, take on India in the final on Monday. There was more joy for Australia in the netball competition, with a 55-51 over Jamaica in the final. Australia also shone at the Sandwell Aquatics Centre, wrapping up the diving competition in style. Cassiel Rousseau took the men's 10m platform title and Maddison Keeney won her second gold of the games in the women's 3m springboard. England's Delicious Orie won super heavyweight gold on a busy night of boxing, beating India's Sagar Ahlawat. India won three other golds in boxing but Northern Ireland took five, including a special double for Aidan Walsh and his sister Michaela.","pubDate":"2022-08-07 22:45:09","image_url":null,"source_id":"bangkokpost","country":["thailand"],"category":["sports"],"language":"english"},{"title":"Aussies win epic as COVID-19 drama strikes","link":"https://wwos.nine.com.au/commonwealth-games/commonwealth-games-2022-australia-claims-inaugural-commonwealth-games-gold/5487f2ad-18f6-463f-b8c2-61ea79f0cdfb","keywords":null,"creator":["wwos"],"video_url":null,"description":"Australia has claimed the inaugural cricket gold despite a COVID-19 scare hours before the toss.","content":"Australia has added Commonwealth Games gold to its ODI and T20 World Cup wins after beating India in a thrilling final at Edgbaston. In the final of T20 cricket's first medal-paying appearance in the Commonwealth Games, India was cruising at 2-118 in reply to Australia's 161 when they lost 3-4 in the space of two overs. They then lost their last five wickets in the space of 13 balls to hand the gold to the Aussies. READ MORE: Rage erupts as Aussie boxer 'burgled' of gold READ MORE: Winner in scary state after 'extraordinary' finish READ MORE: 'Really strange' Buddy contract move slammed The Australian camp was thrown into disarray before a ball was even bowled with all-rounder Tahlia McGrath returning a positive COVID test in the morning before the match. The toss was delayed while the ICC determined if McGrath would play. The Commonwealth Games Federation RACEG (Results Analysis Clinical Expert Group) had already allowed her to do so. McGrath had minor symptoms, and did not sing the national anthem alongside her teammates before the match. When not on the field, she sat away from her teammates and wore a mask. She took it off to bat, but lasted just four balls. When she took a catch during India's innings, she had to shoo away teammates who had come over to celebrate. Batting first, Australia made 8-161 thanks to 61 from Beth Mooney with cameos from Meg Lanning (36) and Ashleigh Gardner (25). Australia picked up both Indian openers in the powerplay, before a big third wicket partnership between Jemimah Rodrigues (33) and Hermanpreet Kaur (65) threatened to derail the Aussie's plans. India needed just 44 runs from 34 balls when Rodrigues was bowled by Megan Schutt, before Gardner picked up the wickets of Kaur and Vastrakar in consecutive balls. With two new batters at the crease, the Alana King and bowlers applied massive pressure before forcing a mistake between Sneh Rana and Deepti Sharma. Needing 11 of the last over with two wickets in hand, skipper Meg Lanning threw the ball to Jess Jonassen, who to that point had figures of 0-20 from three overs. Indian concussion-sub Yastika Bhatia stunned the Aussies by choosing to keep the strike after hitting the first ball to mid-on where an easy single was on offer. She hit the second to long off, triggering a runout while coming back for the second. Back on strike, Yastika then tried to reverse sweep Jess Jonassen and was struck on the pads bang in front. They reviewed it, but to no avail. The ball was clipping the middle bail and Australia were champions. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-08-07 21:30:58","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/08/445463/sport.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Netballers win Australia’s 1,000th Commonwealth Games gold medal","link":"https://www.theguardian.com/sport/2022/aug/08/commonwealth-games-day-10-australia-medal-roundup","keywords":["Commonwealth Games 2022","Commonwealth Games","Australia sport","Sport","Australia news"],"creator":["Courtney Walsh"],"video_url":null,"description":"Diamonds beat Jamaica 55-51 to claim goldAustralia beat India in T20 cricket final by nine runsAnother rush of gold on a tense day in Birmingham saw Australia reach a major milestone as the Diamonds netball team claimed the nation’s 1,000th Commonwealth Games gold medal.Gretal Bueta shot 100% in a 55-51 win over Jamaica as Australia became the first nation to reach the milestone with their 66th gold of these Games in Birmingham. Continue reading...","content":"Another rush of gold in Birmingham saw Australia reach a major milestone as the Diamonds netball team claimed the nation’s 1,000th Commonwealth Games gold medal. It followed success – and another slice of history – for the women’s T20 cricketers at Edgbaston after they edged India by nine runs to win the first Commonwealth gold medal awarded to women. Chef de Mission Petria Thomas said it was an honour to have led the team towards such a momentous occasion. “Australia has a long and proud sporting history, with this 1,000th gold medal cementing our spot at the top of the Commonwealth table,” said Thomas. “On behalf of the whole team, I congratulate the Diamonds in bringing home this significant medal in our amazing history and all those who have stood atop the podium at this year’s Games and all the Games, dating back to Hamilton in 1930.” Inspired England beat Australia to win Commonwealth Games hockey gold Read more At the NEC Arena, Gretal Bueta shot 100% in a 55-51 win over Jamaica as Australia bounced back from the disappointment of silver on the Gold Coast four years ago to became the first nation to reach the milestone with their 66th gold of these Games in Birmingham. In the two teams’ final pool game, Australia had let slip a six-goal lead at the final break and fell to their first Commonwealth loss to Jamaica. With their confidence high, the Jamaicans then routed New Zealand, as Australia found form when too strong for England. It set the tone for a fierce final. But Australia were not going to make the same mistake again. Having levelled by half-time, they wrested control in the third quarter, moving 10 points ahead at one stage, and showed strong resistance against their richly-talented rivals to claim gold. Steph Wood said there were flashbacks to the traumatic loss in the final against England on the Gold Coast but this time around they found a way to maintain their focus. “It’s very surreal. The emotion after the game. There were tears [and] a bit of PTSD from the Gold Coast in that last little bit,” she said. “It’s such a tight-knit group. We wanted to do it for each other.” At Edgbaston, Meg Lanning’s all-conquering side added to their stunning record in women’s cricket, but it was a near run thing, with India threatening to pull off a remarkable run chase right to the death. On a day of drama, Australia confirmed midway through their innings that Tahlia McGrath had tested positive to Covid-19 on Sunday morning. If the final had been held in Australia, she would not have been able to play but the Commonwealth Games rules are more relaxed to match the laws of the host nation. After checking with bodies including the International Cricket Council and the Commonwealth Games Foundation, she was allowed to take her place, with precautions. She sat isolated from her teammates during the batting innings and in a surreal moment after taking a catch in the third over, she waved her teammates away as they ran to celebrate. Australia had been on top until reeled in late in their innings. Indian captain Harmanpreet Kaur then batted brilliantly when scoring 65 from 43 balls. But when she was caught by record-breaking wicketkeeper Alyssa Healy off the bowling of Gardner in the 16th over, the momentum swung back towards the Australians. As Australia were trying to reel India’s run chase in, Peter Bol set off in pursuit of Kenyan Wycliffe Kinyamal at Alexander Stadium but had to settle for silver 0.14 seconds behind the record-breaker, who became the first man to defend the Commonwealth Games 800m title in 1:47.52. “I got a medal and that’s what we wanted,” Bol said. “I had a lot of pressure and a lot of expectations, but I lived up to it, and that’s my first medal at a major championships.” Earlier on Sunday, the Hockeyroos also fared second best in their final against England when beaten 2-1. A week after the Lionesses became the pride of England, the chant of “Hockey’s coming home” was heard ringing around the University of Birmingham as the host nation claimed their first gold medal in women’s hockey. There were several standout individual performances from Australians leading into the women’s teams events later in the day. Kelsey-Lee Barber throws on her way to gold in Birmingham. Photograph: Dean Lewins/AAP A double world champion in javelin, Kelsey-Lee Barber saved her very best for last again. Stricken with Covid-19 after her success at the world championships in Oregon, the 30-year-old missed the opening ceremony and spent several days isolated from her teammates. Her compatriot Mackenzie Little raised the bar with a personal best in the final of 64.27m. But Barber, who was cleared to compete late in the week, loves a challenge. She responded with her final throw to edge her teammate by 16cm to continue her success in major championships with gold. Cassiel Rousseau dived superbly to claim gold in the men’s 10m platform, scoring massive points with his final entry in the morning qualification and bettering that with a superb effort to close out the competition. Cyclist Georgia Baker also saved her best for the finish of the women’s road race, in the process claiming a third gold following triumphs in London in the team pursuit and points race. As Australia’s cricket innings began, Chris McHugh and Paul Burnett also clinched a gold medal for the nation in beach volleyball. But the defence of the title was not without drama either. McHugh, who was part of Australia’s winning combination on the Gold Coast, and Burnett dropped the first set and had to save two match points in the decider when winning 17-21, 21-17, 20-18 over Canada. Amid the tension, referee Giovanni Bake had to be replaced at 12-all in the deciding set, ostensibly due to baking in the sun. “It is crazy. To come from two match points down is a surreal experience,” Burnett said. “This is why we play, for moments like this, feelings like this.” The women’s pairing of Mariafe Artacho del Solar and Taliqua Clancy won silver after falling in their final to Canada’s Sarah Pavan and Melissa Humana-Paredes in three sets.","pubDate":"2022-08-07 21:18:43","image_url":"https://i.guim.co.uk/img/media/0d218e414786a80a033748f5dd719bd1a7030423/0_43_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=a7a22ee9f7607149c72213952777e6e4","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"Inspired England beat Australia to win Commonwealth Games hockey gold - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2F1Zy8wNy9lbmdsYW5kLXdvbWVuLWF1c3RyYWxpYS1jb21tb253ZWFsdGgtZ2FtZXMtaG9ja2V5LWdvbGQtbWVkYWwtbWF0Y2gtcmVwb3J00gF3aHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3Nwb3J0LzIwMjIvYXVnLzA3L2VuZ2xhbmQtd29tZW4tYXVzdHJhbGlhLWNvbW1vbndlYWx0aC1nYW1lcy1ob2NrZXktZ29sZC1tZWRhbC1tYXRjaC1yZXBvcnQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Inspired England beat Australia to win Commonwealth Games hockey gold  The GuardianCommonwealth Games live: Australia wins historic women's cricket final and Diamonds win Australia's 1,000th gold with netball title  ABC News‘Absolute chaos’: Heartbreak for Hockeyroos  news.com.auAussies scrape through to T20 Games final  The StandardThe sisterhood of travelling netball fans comes full circle in Birmingham  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2022-08-07 21:10:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"“They will go home disappointed”: Sourav Ganguly remarks Commonwealth Games final was India’s game to win vs Australia at Edgbaston","link":"https://thesportsrush.com/cricket-news-they-will-go-home-disappointed-sourav-ganguly-remarks-commonwealth-games-final-was-indias-game-to-win-vs-australia-at-edgbaston/","keywords":["Cricket","Australia Women","commonwealth games 2022","India Women","Sourav Ganguly"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Commonwealth Games final: India and Australia participated in a closely contested tense final at Edgbaston tonight. During the final match of Commonwealth Games 2022 Women’s Cricket Competition between India Women and Australia Women in Birmingham, Australia beat India by 9 runs to continue their domination both over this opposition and in this format. In fact,… The post “They will go home disappointed”: Sourav Ganguly remarks Commonwealth Games final was India’s game to win vs Australia at Edgbaston appeared first on The SportsRush.","content":"Commonwealth Games final: India and Australia participated in a closely contested tense final at Edgbaston tonight. During the final match of Commonwealth Games 2022 Women’s Cricket Competition between India Women and Australia Women in Birmingham, Australia beat India by 9 runs to continue their domination both over this opposition and in this format. In fact, Australia have been able to achieve a historic triplet of being the ODI, T20I and Commonwealth Games champions (all under Meg Lanning) at the same time. That said, winning the gold medal at Edgbaston was possible only after participating in a quintessential closely contested tense final. In spite of being pushed on the back foot for a considerable duration by India, Australia put forth their A-game when it mattered the most. Seizing crucial moments played a vital role in Australia defending a 162-run target tonight. Former India captain and current BCCI (Board of Control for Cricket in India) President Sourav Ganguly took to social media platform Twitter to congratulate the Indian team on winning a silver medal in the Commonwealth Games. However, Ganguly also opined that the match was for India to win especially after batter Jemimah Rodrigues (33) and captain Harmanpreet Kaur (65) had bailed them out of trouble. Congratulations to the Indian women’s team for winning silver ..But they will go home disappointed as it was their game tonite .. @BCCIWomen — Sourav Ganguly (@SGanguly99) August 7, 2022 Having lost opening batters Smriti Mandhana (6) and Shafali Verma (11) in the first three overs, India were rescued by a 71-ball 96-run third-wicket partnership between Rodrigues and Kaur. Needing 44 runs to win off 34 balls, India lost Rodrigues, all-rounder Pooja Vastrakar (1) and Kaur within the next nine deliveries. The initiation of a downward spiral had no coming back for India as they ended up on the losing side in yet another knockout match of a multi-team tournament. ALSO WATCH: Radha Yadav grabs outstanding catch to dismiss Tahlia McGrath at Edgbaston Former India all-rounder Irfan Pathan also tweeted on similar lines believing that the game was in India’s hands. I thought the game was in our hand. Nevertheless congratulations on the silver @BCCIWomen #CommonwealthGames2022 — Irfan Pathan (@IrfanPathan) August 7, 2022 A primary reason why this heartbreaking loss is hurting fans quite a lot is because India had also lost the ICC Women’s T20 World Cup final to Australia some 30 months ago. As far as losing close finals in England is concerned, India had also lost the 2017 Cricket World Cup final by 9 runs.","pubDate":"2022-08-07 20:51:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India wins silver after losing to Australia by 9 runs in 1st Commonwealth women’s cricket final","link":"https://www.thehindu.com/sport/cricket/india-wins-silver-after-losing-to-australia-by-9-runs-in-1st-commonwealth-womens-cricket-final/article65743684.ece","keywords":null,"creator":["\n        AFP  \n    "],"video_url":null,"description":"India, chasing down Australia’s target of 162, appeared to be on course for a shock victory in the Commonwealth Games women’s cricket final when they were 118-2 in the 15th over, but a clatter of wickets slowed their charge","content":"Silver medallists India celebrate during the medal ceremony | Photo Credit: Reuters There couldn’t have been a more fitting finale to the women’s T20 cricket event of the Commonwealth Games. For the Indian fans, an overwhelming majority in the crowd that turned up at the Edgbaston Stadium, it may have brought back unpleasant memories of the 2017 women’s World Cup final between India and England when the Women In Blue shockingly went down to the host by nine runs at Lord’s. On Sunday, the margin of defeat was similar as skipper Harmanpreet Kaur’s 65 (43b, 7x4, 2x6) went in vain against Australia. The Indian women had to settle for silver in their maiden CWG cricket campaign. India appeared to be on course for a shock victory when they were 118-2 in the 15th over but a clatter of wickets slowed their charge. They still found boundaries to keep them in the hunt and reached the final over with 11 runs needed and two wickets in hand. But Meghna Singh was run out off the second ball and Yastika Bhatia was trapped lbw the following ball. Victory underlines the dominance of Australia’s women, who are also world champions in the 20-over and 50-over formats. The toss, delayed over discussions surrounding Australia all-rounder Tahlia McGrath’s inclusion in the XI even though she tested positive for COVID-19, saw Meg Lanning opt to bat. Meg Lanning (36, 26b, 5x4, 6x1) and Beth Mooney (61, 41b, 8x4) added 74 in 47 balls, the best of the Australian innings, as the team finished with 161 for eight in 20 overs. Australia were unable to create the momentum they wanted, losing wickets at regular intervals in the face of an impressive performance by India in the field In reply, India opener Shafali Verma got off the blocks early with two fours in the first over bowled by Megan Schutt. It was an outing to forget for Smriti Mandhana, who ended up shuffling across a tad too much towards the off stump and getting bowled. But Jemimah Rodrigues and captain Harmanpreet Kaur rebuilt the innings at a raucous Edgbaston, where most of the support was for India. But just when India appeared to be taking the game away from Australia, Rodrigues was bowled by Megan Schutt for 33 in the 15th over, ending a stand of 96. The moment of the match came when McGrath, after taking Shafali’s catch, asked her teammates who had forgotten all about her COVID-19 diagnosis to stay away from her and celebrate. Harmanpreet and Jemimah did their best but fell in quick succession. The Aussies kept their nerve even the Indians lost theirs. In the bronze medal match earlier on Sunday, New Zealand coasted to an eight-wicket win over England. The home side won the toss and elected to bat but could only muster 110-9 in their 20 overs. England captain Nat Sciver top-scored with 27 and Amy Jones hit 26 but the total looked well short of par. New Zealand raced to 46 after just four overs and shrugged off the loss of Suzie Bates (20) and Georgia Plimmer (four) to reach their target with more than eight overs to spare. Sophie Devine, the New Zealand captain, top-scored with 51 not out off 40 balls. The scores: Australia 161/8 in 20 overs (Beth Mooney 61, Meg Lanning 36, Renuka Singh 2/25, Sneh Rana 2/38) bt India 152 in 19.3 overs (Harmanpreet Kaur 65, Jemimah Rodrigues 33, Gardner 3/16, Megan Schutt 2/27). (With inputs from AFP) Our code of editorial values Printable version | Aug 8, 2022 2:29:17 am | https://www.thehindu.com/sport/cricket/india-wins-silver-after-losing-to-australia-by-9-runs-in-1st-commonwealth-womens-cricket-final/article65743684.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-08-07 20:17:30","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussies are on another level in historic trifecta at Commonwealth Games","link":"https://www.foxsports.com.au/commonwealth-games/aussies-are-on-another-level-in-historic-trifecta-at-commonwealth-games/news-story/941d0ef59bab8458ac78547ba6af2ba5","keywords":null,"creator":null,"video_url":null,"description":"Good luck trying to name any national sporting team on the planet as red-hot as the Australian women’s cricket team right now","content":"Good luck trying to name any national sporting team on the planet as red-hot as the Australian women’s cricket team right now The Aussies did it again on Monday morning (AEST) in the Commonwealth Games final when they showed extreme class in the nail-biting final overs to defeat India by 17 runs. The win gives Australia a never-before-seen trifecta as ODI world champions, T20 world champions and Commonwealth Games gold medallists. The drama at the death was almost matched by the drama at the start of the day’s play as it was revealed following the toss of the coin that Aussie allrounder Tahlia McGrath had tested positive for Covid-19 the morning of the match. Despite the test, McGrath was allowed to play, with the full support of the ICC, the Australian Commonwealth Games team and the Commonwealth Games Federation. Best team in the world. Photo by Ryan Pierse/Getty Images. Source: Getty Images Jess Jonassen celebrates the wicket of Taniya Bhatia. Photo by Alex Davidson/Getty Images. Source: Getty Images There were also reports the Indian team was not told about McGrath’s test result until the toss of the coin - causing a delay of more than 10 minutes for the game to start. Reports in India claimed the Indian team wanted McGrath to be stood down. Somehow the drama at the end of India’s run chase even exceeded the explosive news about McGrath. McGrath was seen wearing a face mask and was isolated from the rest of her teammates as Australia batted in the first innings. She had removed the mask as she walked out to bat. Her innings only lasted four balls and she was dismissed for just two runs when Radha Yadav took a ripping catch. Her cameo was a minor ripple as Australia reached 8/161 at the end of their 20 overs. India’s run chase was looking good at 2/118 after 14 overs, however, that’s when Ash Gardner turned the contest with two crucial wickets as India lost 3/3 in two overs. It left India needing 41 from the final four overs with five wickets in hand. However, the wickets kept tumbling from there and India found themselves needing 16 runs from the final two overs. India then lost four wickets in nine balls, crumbling at the finish line, bowled all out for 152 from 19.3 overs. Earlier, McGrath presented with mild symptoms on the morning before the game and then returned a positive result after speaking to Aussie team officials. The Australian Commonwealth Games team said comprehensive protocols have been put in place. Tahlia McGrath isolated. Photo by Alex Davidson/Getty Images. Source: Getty Images Tahlia McGrath isolated from teammates. Photo: Channel 7. Source: Channel 7 The Aussie Commonwealth Games team announced the decision to allow McGrath to play was made in consultation with the ICC and Australian medical staff. “Commonwealth Games Australia (CGA) can confirm that cricketer Tahlia McGrath has returned a positive test for Covid-19,” the CGA statement read. “CGA clinical staff have consulted with the Commonwealth Games Federation RACEG (Results Analysis Clinical Expert Group) team and match officials, and McGrath is taking part in today’s final against India. “McGrath presented to team management with mild symptoms on Sunday and subsequently returned the positive test. She was named in the starting XI at the toss and the International Cricket Council (ICC) approved her participation in the final. Tahlia McGrath of Team Australia looks on whilst wearing a face mas. Photo by Alex Davidson/Getty Images. Source: Getty Images Australia's Tahlia McGrath walks back to the dressing room. Photo by Darren Staples / AFP. Source: AFP “In consultation with the CGF and the ICC, CGA and Cricket Australia medical staff have implemented a range of comprehensive protocols which will be observed throughout the game and for post-match activity, to minimise the risk of transmission to all players and officials. The CGA has maintained a comprehensive Covid-19 risk mitigation strategy for the Birmingham 2022 Commonwealth Games, with testing protocols over and above those required by the Birmingham 2022 Organising Committee.” Indian sport commentators were fuming about the ruling that has allowed McGrath to play. Bloomberg News reporter Akshat Rathi described it as a “dereliction of duties”. He posted on Twitter: “I don’t understand how the rules are allowing Tahlia McGrath on the field playing a cricket match after having tested positive for Covid-19. Dereliction of duty by authorities”. Sports reporter Naveen Sharma said it was “shameless” by Australia. “Australians always preach about right or wrong but they forget everything when it comes to them,” he posted on Twitter. Other commentators said the ruling opens up Pandora’s Box.","pubDate":"2022-08-07 19:57:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"England all-rounder Moeen Ali fears losing 50-over cricket due to unsustainable schedule","link":"https://kashmirreader.com/2022/08/08/england-all-rounder-moeen-ali-fears-losing-50-over-cricket-due-to-unsustainable-schedule/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"LONDON: England all-rounder Moeen Ali has warned that other players could follow teammate Ben Stokes in quitting one-day internationals and that the format could become completely obsolete if nothing is done to fix the game’s hectic calendar. Stokes, England’s Test captain, announced his shock retirement from 50-over cricket at the age 31 last month, citing […]","content":"LONDON: England all-rounder Moeen Ali has warned that other players could follow teammate Ben Stokes in quitting one-day internationals and that the format could become completely obsolete if nothing is done to fix the game’s hectic calendar. Stokes, England’s Test captain, announced his shock retirement from 50-over cricket at the age 31 last month, citing an “unsustainable” schedule that has come under strain because of the emergence of franchise-based Twenty20 leagues. The International Cricket Council’s (ICC) insistence on staging one global event every year has further added to that workload. “At the moment it’s not sustainable, in my opinion,” Moeen said on the sidelines of The Hundred, where he is leading Birmingham Phoenix. “Something has to be done because I fear losing the 50-over format in a couple of years because it’s almost like the long, boring one… the 50 overs is just in the middle – there’s no importance given to it at the moment.” Other England players such as Jos Buttler and Joe Root have also voiced their concerns about scheduling while India spinner Ravichandran Ashwin has questioned the relevance of the format. “International cricket in all three formats is by far the best cricket to play,” added Moeen, who quit Test cricket last year. “But I do worry there are so many tournaments out there that players are retiring more now – and you’ll see more retiring soon – because of overlapping schedules.” The ICC this week said it hoped to retain the sport’s all-format players despite mounting criticism, with chief executive Geoff Allardice stressing that most players still had ambitions to play in World Cups and ICC events. —Agencies England all-rounder Moeen Ali fears losing 50-over cricket due to unsustainable schedule added by KR Desk on 1:15 am August 8, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-08-07 19:45:22","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Australia beat India by 9 runs to win maiden gold medal in women’s cricket","link":"https://telanganatoday.com/cwg-2022-australia-beat-india-by-9-runs-to-win-maiden-gold-medal-in-womens-cricket","keywords":["Cricket","News","Sport","Australia","Commonwealth Games","Harmanpreet Kaur","India"],"creator":["PTI"],"video_url":null,"description":"Birmingham: World champions Australia beat India by nine runs in a thriller to win the gold medal in the women’s cricket event at the Commonwealth Games on Sunday. Batting first, Australia scored 161 for 8 in 20 overs with Beth Mooney scoring 61 off 41 balls while Renuka Singh taking 2 for 25. In reply, […]","content":"Birmingham: World champions Australia beat India by nine runs in a thriller to win the gold medal in the women’s cricket event at the Commonwealth Games on Sunday. Batting first, Australia scored 161 for 8 in 20 overs with Beth Mooney scoring 61 off 41 balls while Renuka Singh taking 2 for 25. In reply, skipper Harmanpreet Kaur smashed 65 off 43 balls but India’s lower-order caved in meekly to get all out for 152 in 19.3 overs. The Southern Stars took the last five wickets for 13 runs. Spinner Ashleigh Gardner was the most successful bowler with 3 for 16. Brief Scores: Australia 161/8 (Beth Mooney 61, Renuka Singh 2/25, Sneh Rana 2/38). India: 152 in 19.3 overs (Harmanpreet Kaur 65, Ashleigh Gardner 3/16). PTI KHS KHS ATK","pubDate":"2022-08-07 19:25:58","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022 India Women vs Australia Women Final Highlights: India Go Down By 9 Runs To Australia, Win Silver - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NvbW1vbndlYWx0aC1nYW1lcy0yMDIyL2N3Zy0yMDIyLWluZGlhLXdvbWVuLXZzLWF1c3RyYWxpYS13b21lbi1maW5hbC1saXZlLXNjb3JlLXVwZGF0ZXMtMzIzNDA0NdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CWG 2022 India Women vs Australia Women Final Highlights: India Go Down By 9 Runs To Australia, Win Silver  NDTV SportsIndia Women vs Australia Women Live Streaming Details- When And Where To Watch IN-W vs AUS-W Live Commonwealth Games In Your Country? Commonwealth Games 2022  Cricket AddictorMooney: 'The belief in the Australia dressing room is at an unprecedented level'  ESPNcricinfoSmriti Mandhana sparkles as India defeat England and go for Commonwealth gold  Sporting NewsIndia Women vs Australia Women Commonwealth Games 2022 Highlights, Edgbaston: INDW Succumb Under Pressure Onc  Cricket Country NewsView Full coverage on Google News","content":null,"pubDate":"2022-08-07 19:20:17","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG: Australia Beat India By 9 Runs To Win Gold In Women's Cricket","link":"https://sports.ndtv.com/cricket/cwg-australia-beat-india-by-9-runs-to-win-maiden-gold-medal-in-womens-cricket-3234698","keywords":null,"creator":null,"video_url":null,"description":"Batting first, Australia scored 161 for 8 in 20 overs with Beth Mooney scoring 61 off 41 balls while Renuka Singh taking 2 for 25. In reply, skipper Harmanpreet Kaur smashed 65 off 43 balls but...","content":"The Indian women's cricket team once again succumbed to the big stage fright to suffer a nine-run defeat against the mighty Australia in the gold medal match of the Commonwealth Games here on Sunday. The 'Women In Blue' lost the battle of nerves and also the last five wickets for 13 runs with some poor strategic moves and even more atrocious shot selections leaving a lot to be desired. Losing like winning is also a habit and in the end, the self belief of the Southern Stars prevailed with the opposition taking a lot of pressure on themselves. Beth Mooney (61 off 41) made a stroke-filled half century as Australia managed to reach 161 for eight despite a spirited fielding effort from India. With 50 needed off the last six overs with eight wickets in hand, and Harmanpreet (65 off 43) in the middle of a special innings, it should have been a straightforward chase for India. However, India found a way to fluff it as they lost eight wickets for 32 runs to come short in a major final once again. India's inexplicable batting collapse was also reminiscent of their failure in the 2017 ODI World Cup final in England. Sharing an 96-run stand after the fall of openers, Harmanpreet and Jemimah Rodrigues (33 off 33) were controlling the chase but the latter's dismissal triggered the collapse. The batters manufactured ways to get dismissed with innings including three run outs. India were eventually bowled out for 152 with three balls left. The shots that Harmanpreet and Jemimah played were also questionable but they could not be solely blamed for the abject surrender. It was between 14.3 overs and 15.5 overs, a space of nine deliveries that India lost the game with Jemimah being bowled by Megan Schutt and Harmanpreet playing a suicidal lap-scoop off Ashleigh Gardner which was brilliantly pouched by an alert Alyssa Healy. Deepti Sharma going for a non-existent second run and Concussion sub Yastika Bhatia being sent after Radha Yadav were questionable decisions taken by coach Ramesh Powar and skipper Harman. A silver medal finish was still a creditable one for India who beat England in the semi-finals on Saturday. It can also be said the women's cricket debut at the Commonwealth Games was largely a success. A packed house at Edgbaston witnessed the first ever final in CWG.. Earlier, Australia opted to bat on a bright and sunny afternoon. Renuka Singh, the stand-out pacer for India in this tournament, once again provided an early breakthrough by trapping the dangerous Alyssa Healy leg before with a delivery that moved in a shade. The Indians went for the DRS in the last second and it was successful. Mooney (61 off 41)and skipper Meg Lanning (36 off 26) then stitched a 78-run stand and once again it seemed Australia would bat India out of the game like they had done in the T20 World Cup final couple of years ago. Lanning made her intent clear as she dispatched a length ball off Renuka over mid off for the first six of the match. The Indian fielders who are often criticised had a fine day in the middle. It started with a close run out of Lanning and included two fine catches from Deepti Sharma and Radha Yadav. Deepti plucked one off the right hand to get rid of a well set Mooney while Radha took a low diving catch at backward point to dismiss Tahlia McGrath, who played the game despite testing positive for COVID-19. Australia looked set for a 180 plus total but India fought back in the last five overs taking five wickets for 35 runs. Promoted Renuka ended with tidy figures of 2 for 25 in four overs while fellow pacer Meghna Singh was underbowled as India used seven bowling options. Sneh Rana (2/38) was the most expensive bowler who bowled their full quota but took two crucial wickets of Mooney and Ashleigh Gardner.","pubDate":"2022-08-07 19:19:09","image_url":"https://c.ndtvimg.com/2022-07/grb2vni8_harmanpreet-kaur_650x400_29_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Harmanpreet fight not enough as India women fall short to take CWG silver in women's T20, Australia win gold","link":"https://www.hindustantimes.com/sports/commonwealth-games/harmanpreet-kaur-fight-not-enough-as-india-women-fall-short-to-take-cwg-silver-in-women-s-t20-australia-win-gold-101659688228751.html","keywords":null,"creator":null,"video_url":null,"description":"The India women's cricket team put on a brave fight but ended second best as they lost to Australia in the women's T20 gold medal match at the Commonwealth Games 2022 on Sunday.","content":null,"pubDate":"2022-08-07 19:18:03","image_url":"https://images.hindustantimes.com/img/2022/08/07/1600x900/india-women-cricket-cwg-getty_1659899735015_1659899738559_1659899738559.jpg","source_id":"hindustantimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya: This is 'new India' with the freedom and talent we have","link":"https://www.thehansindia.com/sports/cricket/hardik-pandya-this-is-new-india-with-the-freedom-and-talent-we-have-756849","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India defeated WI by 88 runs in the 5th T20IIndia sealed the series 4-1Hardik led India on Sunday in Rohit’s absence","content":"Hardik Pandya Hardik Pandya heaped praise on the Indian team, saying \"this is new India\" with the \"kind of talent the players have and the freedom we have\" after their victory over West Indies in the fifth T20I. India defeated West Indies by 88 runs at Central Broward Regional Park Stadium Turf Ground, Lauderhill, Florida and finished the five-match series 4-1 on Sunday. The visitors rested four key players, Rohit Sharma, Rishabh Pant, Suryakumar Yadav, and Bhuvneshwar Kumar. In the absence of Rohit, Surya, and Pant, Shreyas Iyer opened the innings with Ishan Kishan, becoming India's ninth opening pair in the T20Is this year. Iyer top-scored for India in the first innings with his knock of 64 runs off 40 balls as the Men in Blue put up 188 for 7 in 20 overs. \"It is very special to get a chance to lead your country. And getting that chance and getting that victory means a lot to me as captain and an individual. I was just following our captain's roles,\" said Hardik after India's 88-run win on Sunday. When he was asked if he sees himself as a permanent captain, the all-rounder replied,\" Yeah, why not? If I get an opportunity, I'll be more than happy to do that. We have a World Cup and Asia Cup now though, so we need to focus on that and use our skillsets there.\" What a lovely series win 🇮🇳 Well done to this wonderful team 👏🏾🔝 pic.twitter.com/v4EsPHlBvQ In their last 13 outings in the T20Is, Team India has suffered just two losses. Speaking about what makes India consistent, Hardik said,\" The kind of talent the players have and the freedom we have. This is the new India how they are playing. They are expressing themselves well, and when you have the freedom you get more dangerous. The credit goes to the management and whole group to make that environment. They are not worried about whether they won't get picked or whether they will get dropped.\" During the Windies' chase, the trio of Axar Patel, Kuldeep Yadav, and Ravi Bishnoi wreaked havoc as they shared all the 10 wickets between them. It was the first instance in men's T20I where all the wickets were bagged by spinners. \"I wanted to make sure I gave Axar the new ball and wanted him to get the confidence back and bowl dots. I knew the kind of bowler he is, when he bowls tight he creates chances. Then the wrist spinners have some weapons that can trouble batters. I just hand to hand over the ball and told them to enjoy,\" Hardik added. The T20 World Cup is scheduled to take place later this year in Australia. On being asked about how well India are prepared for the tournament, Hardik replied,\" Absolutely close. Just got to know how to keep getting better. Pressure and environment wise we are ready but in this sport, you never stop learning.\" T20I Series In The Bag 👏 🏆 Smiles All Around 😊 😊 #TeamIndia | #WIvIND pic.twitter.com/GsDf1x8J6I We were not good enough, says WI skipper Nicholas Pooran Meanwhile, West Indies skipper Nicholas Pooran admitted that his side \"didn't learn\" and was not \"good enough\" against the Indian team. \"We weren't good enough. India came out aggressive, but as batters, we didn't learn. As bowlers, we are getting better, but we need to learn faster. It is a game of skills vs skills and today we weren't good. We didn't put partnerships together, except for Hetmyer. When you come against one of the top teams in the world then execution is important. We didn't come up with trumps. \"As a batting and bowling team, we have a lot to do. There's a lot of cricket to be played, lot of experience to be gained. Hope we learn as a team with these losses. We just won a series, we lost another series here, but we are building towards a World Cup and when we reach there we are ready to compete,\" added Pooran in the post-match presentation. Speaking about Jason Holder opening West Indies' innings on Sunday, Pooran said,\" King and Mayers weren't playing today. We gave him an opportunity today. We know how well he bats. In hindsight, we could've played two spinners, something for us to think about. Both Hayden and Akeal are bowling well. Thank you to the fans in America.\" The Indian team's next assignment is a tour of Zimbabwe to play three ODIs. Senior players such as Rohit, Pant, Virat Kohli, Bhuvneshwar Kumar, and Jasprit Bumrah are not a part of the travelling squad. Shikhar Dhawan will lead India in the ODI series in Harare, which is due to begin on Aug. 18.","pubDate":"2022-08-07 19:17:05","image_url":"https://assets.thehansindia.com/h-upload/2022/08/07/500x300_1306862-hardik-pandya.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian women's cricket team settle for silver in CWG 2022, face defeat against Australia in final","link":"https://zeenews.india.com/cricket/indian-womens-cricket-team-settle-for-silver-in-cwg-2022-face-defeat-against-australia-in-final-2494632.html","keywords":null,"creator":null,"video_url":null,"description":"Beth Mooney top-scored with 61, but a terrific fightback from India in the last five overs meant that Australia finished at 161/8.","content":"Australian women's cricket team thrashed India by nine runs to win the gold medal in the Commonwealth Games 2022 at the Edgbaston, Birmingham on Sunday. Ashleigh Gardner and Megan Schutt were top performers for Aussies with the ball. Schutt picked two wickets while Gardner claimed three. Congratulations Australia _ Australia beat India, wins the GOLD MEDAL in #B2022 _ _ Scorecard: https://t.co/2jCQ4wcdbl pic.twitter.com/cZlBLY2IYc — ICC (@ICC) August 7, 2022 Earlier in the first inning, opener Beth Mooney top-scored with 61, but a terrific fightback from India in the last five overs meant that Australia finished at 161/8. Apart from the 74-run stand between Beth and captain Meg Lanning, Australia wasn't allowed to break free as India conceded only 36 runs in the last five overs, taking five scalps. India were splendid in their fielding, making tight stops, taking brilliant catches and effecting terrific run-outs. With the ball, Renuka Thakur and Sneh Rana took two wickets each while Deepti Sharma and Radha Yadav had a wicket apiece. Renuka and Meghna Singh built pressure on Australia as nine runs came off first two overs, with an edgy four for Alyssa Healy. That worked wonders for India as a last moment review showed Alyssa was trapped lbw by an inswinger from Renuka while going for a swipe across the line in the third over. Beth got going with boundaries through drive and flick while Meg nailed a drive through off-side and then hit an effortless six over long-off as Australia reached 39-1 in power-play. Beth and Meg continued to rotate strike and hit occasional boundaries before the duo took 17 runs off Harmanpreet Kaur's first over, with the Australia skipper hitting three fours off her Indian counterpart. But her promising knock was cut short by Radha flicking a sharp underarm throw to non-striker's end on Beth pushing back the ball to bowler, catching Meg inches short of her crease. Tahlia McGrath, playing despite testing positive for Covid-19, fell cheaply as Radha dived full length to her left at backward point to take a stunning catch off Deepti. Ashleigh Gardner had hit a few boundaries, including a towering six over long-on off Radha. But Sneh deceived her with flight and loop to be stumped easily by Taniyaa Bhatia. Beth got her fifty by thumping a juicy full toss over long-off. But India continued to take scalps as Grace Harris miscued to mid-on off Renuka. In the next over, Beth tried to clear long-on off Sneh. But Deepti backtracked from mid-on and stuck out her right arm even as she was losing balance to complete a one-handed blinder. India's impressive fielding show continued as Meghna took a sharp catch at mid-wicket to send Alana King back while Jess Jonassen was caught short of her crease by a direct hit from Smriti Mandhana as Australia managed to finish with 161-8.","pubDate":"2022-08-07 19:16:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022, Cricket: Heartbreak for India as Harmanpreet fifty not enough, Australia win historic Gold","link":"https://www.indiatoday.in/sports/commonwealth-games-2022/story/cwg-2022-india-silver-australia-win-historic-gold-cricket-final-1984996-2022-08-08?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Heartbreak for India as Australia win historic cricket Gold at CWG 2022","content":"It was not meant to be for India in the historic cricket final at Commonwealth Games 2022. Harmanpreet Kaur led from the front and produced a knock that reminded fans of the 2017 World Cup blitz but it was not enough for India in their chase of 162 in the women's cricket Gold medal match at Edgbaston on Sunday. India lost to Australia by 9 runs in the final and finished with silver while Meg Lanning's Australia won the historic Gold, completing a hat-trick of major world trophies - the T20 World Cup, the 50-over World Cup and the Commonwealth Games. Chasing 162, India got off to a poor start as they lost their highest-scorer in the tournament, Smriti Mandhana for 6 as early as the 2nd over. Smriti, who has been spotless at the Commonwealth Games in Birmingham, tried to heave one through the leg side but Australia pacer Darcie Brown came up with a clever delivery, pushed through that cluttered into the leg-stump. India at CWG 2022, Day 10 Updates | Medal Table Ash Gardner then got the big wicket of big-hitter Shafali Verma for 11 inside the powerplay. HARMANPREET PUTS ON A SHOW However, captain Harmanpreet and young Jemimah Rodrigues, who has been in fine form in CWG 2022 after having been dropped for the World Cup earlier this year, stitched a 96-run stand in just 71 balls to give Australia a mighty scare. Harmanpreet led India's chase from the front, taking the attack to the Australian batters, playing free-flowing cricket as the skipper looked determined to take India past the finish line. Harmanpreet Kaur hit 7 boundaries and 2 sixes as she adopted a fearless approach. With the music of the dhols ringing around the Edgbaston Cricket Stadium, Harmanpreet Kaur put on a show with a spotless hitting display as she made sure that the asking rate was kept under control till the time she was in the middle. However, India suffered a massive collapse as Megan Schutt triggered it by getting the big wicket of Jemimah Rodrigues (33 off 33) in the 15th over. Ash Gardner then returned to pick up two big wickets, including that of captain Harmanpreet (65 off 43 balls) in the very next over. Gardner got big-hitter Pooja Vastrakar before Harmanpreet tried to scoop one past the wicketkeeper. However, the ball ricocheted onto her helmet before lobbing up in the air. Wicketkeeper Alyssa Healy was alert to pounce it and send the India captain back. India suffered a massive collapse as they slipped from 118 for 2 to 149 for 8. Live TV --- ENDS --- Also Read | CWG 2022: Sharath Kamal and G Sathiyan win silver in men’s doubles after valiant battle in final Also Read | 5th T20I: Shreyas, Ravi star as India decimate WI to win series 4-1","pubDate":"2022-08-07 19:15:38","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Spinners shine as India beat West Indies by 88 runs","link":"https://www.thestar.com.my/sport/cricket/2022/08/08/cricket-spinners-shine-as-india-beat-west-indies-by-88-runs","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India produced a spin-bowling masterclass on Sunday as they defeated West Indies by 88 runs in the final game of their five-match Twenty20 series in Lauderhill, Florida. Read full story","content":null,"pubDate":"2022-08-07 18:41:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IND vs WI Man of the Match 5th T20I: Who won India vs West Indies Man of the Match today in Lauderhill?","link":"https://thesportsrush.com/cricket-news-ind-vs-wi-man-of-the-match-5th-t20i-who-won-india-vs-west-indies-man-of-the-match-today-in-lauderhill/","keywords":["Cricket","Axar Patel","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs WI Man of the Match 5th T20I: The Indian all-rounder won the match award for running through the West Indian top-order. During the fifth T20I of the ongoing India’s tour of West Indies in Lauderhill, India beat West Indies by 88 runs to register a comprehensive 4-1 series victory. Stand-in captain Hardik Pandya… The post IND vs WI Man of the Match 5th T20I: Who won India vs West Indies Man of the Match today in Lauderhill? appeared first on The SportsRush.","content":"IND vs WI Man of the Match 5th T20I: The Indian all-rounder won the match award for running through the West Indian top-order. During the fifth T20I of the ongoing India’s tour of West Indies in Lauderhill, India beat West Indies by 88 runs to register a comprehensive 4-1 series victory. Stand-in captain Hardik Pandya (28), who won the toss and chose to bat, witnessed his batters supporting his decision on the back of putting on board 188/7 in 20 overs. Opening the batting for the first time in international cricket and after four years in T20s, Shreyas Iyer returned to form with a seventh T20I half-century. The right-handed batter was the pick of the Indian batters with his 64 (40) comprising of eight fours and two sixes at a strike rate of 160. INDIA WIN 💙 A stunning performance by our tweakers saw them pick all 1⃣0⃣ on the night as we cruised to a win 🙌🏼 #WIvIND pic.twitter.com/iGIdlCWKG3 — Delhi Capitals (@DelhiCapitals) August 7, 2022 Chasing a 189-run target, West Indies never looked like giving India a fight as their ploy of promoting former captain Jason Holder (0) as an opener for the first time at the highest level failed miserably. With the hosts losing all their wickets to three Indian spinners tonight, Shimron Hetmyer scoring 56 (35) with the help of five fours and four sixes remained the only positive in an otherwise lacklustre and shambolic batting effort. Not even able to last for a total of 20 overs, West Indies were bundled out for 100 in 15.4 overs. Opening the bowling for India, all-rounder Axar Patel drew first blood in the form of Holder to start with a wicket-maiden. Patel, who also dismissed other top-order batters in Shamarh Brooks (13) and Devon Thomas (10), picked bowling figures of 3-1-15-3 to win his third T20I match award. “I was just focusing on keeping things simple, instead of trying too many things. Was just looking to use the surface to my advantage. The surfaces [in this series] have been helpful for me, so that has proved advantageous to me. Both in the ODIs and T20s, the pitches were fairly same,” Patel told ESPN Caribbean during the post-match presentation ceremony.","pubDate":"2022-08-07 18:32:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Table Tennis Live Updates, Commonwealth Games 2022: Sharath Kamal and Sreeja Akula wins mixed doubles gold - Sportstar","link":"https://news.google.com/__i/rss/rd/articles/CBMiwQFodHRwczovL3Nwb3J0c3Rhci50aGVoaW5kdS5jb20vY29tbW9ud2VhbHRoLWdhbWVzL25ld3MvdGFibGUtdGVubmlzLWxpdmUtdXBkYXRlcy1jb21tb253ZWFsdGgtZ2FtZXMtMjAyMi1zaGFyYXRoLWthbWFsLXNhdGhpeWFuLXNyZWVqYS1zY2hlZHVsZS1yZXN1bHRzLW1lZGFscy1jd2ctYmlybWluZ2hhbS9hcnRpY2xlNjU3NDA1NjAuZWNl0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Table Tennis Live Updates, Commonwealth Games 2022: Sharath Kamal and Sreeja Akula wins mixed doubles gold  SportstarCWG 2022 Badminton Highlights: Sindhu, Lakshya, Satwik-Sairaj assured of medals  Hindustan TimesCWG 2022: Sharath Kamal-Sreeja Akula pair wins gold in mixed doubles TT  Times of IndiaIndia at the Commonwealth Games Live updates & latest scores from Day 10 - Cricket, Badminton & Athletics - 07 Aug 2022  SportskeedaSharath Kamal & G Sathiyan Win Silver In Men's Doubles After Valiant Battle In Final  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-08-07 18:15:04","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Radha Yadav catch: Indian cricketer Radha Yadav grabs outstanding catch to dismiss Tahlia McGrath in Commonwealth Games final","link":"https://thesportsrush.com/cricket-news-radha-yadav-catch-indian-cricketer-radha-yadav-grabs-outstanding-catch-to-dismiss-tahlia-mcgrath-in-commonwealth-games-final/","keywords":["Cricket","Videos","Australia Women","commonwealth games 2022","Deepti Sharma","India Women","Radha Yadav","Tahlia McGrath"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Radha Yadav catch: The Indian spinner was exceptional on the field during a Gold Medal match at Edgbaston today. Spinner Radha Yadav became a source of inspiration for her teammates leading them to one of their best days on the field in the history of Indian Women’s cricket. The fact that Yadav’s excellence came in… The post Radha Yadav catch: Indian cricketer Radha Yadav grabs outstanding catch to dismiss Tahlia McGrath in Commonwealth Games final appeared first on The SportsRush.","content":"Radha Yadav catch: The Indian spinner was exceptional on the field during a Gold Medal match at Edgbaston today. Spinner Radha Yadav became a source of inspiration for her teammates leading them to one of their best days on the field in the history of Indian Women’s cricket. The fact that Yadav’s excellence came in the final match of Commonwealth Games 2022 Women’s Cricket Competition against Australia Women in Birmingham spoke highly about her agility, awareness and temperament. While Yadav’s economical bowling figures of 4-0-24-1 also aided her team in restricting Australia to 161/8 in 20 overs, it was her efforts on the field which earned her all the accolades. Bowling her second over right after the halfway mark, Yadav put an end to a 74-run second-wicket partnership between Australia opening batter Beth Mooney (61) and captain Meg Lanning (36). With Mooney hitting the ball back to Yadav, she was aware enough to back-flick the ball to the stumps. With Lanning’s bat in the air, Yadav’s direct-hit provided India with a much-needed wicket. In was in the following over when Yadav put on display an acrobatic low catch at point to send Australia all-rounder Tahlia McGrath (2) back to the pavilion. Having cut a Deepti Sharma delivery aerially, McGrath had to return to walk back after Yadav took a few steps towards her left before completing an outstanding catch. Mooney, who hit eight fours at a strike rate of 148.78 at Edgbaston today, was the pick of the Australian batters. For India, pacer Renuka Singh Thakur and all-rounder Sneh Rana picked a couple of wickets each. The hunger for 🥇 is visible on the ground. The new India can compete at the world stage with so much confidence. Chak De 🇮🇳 #CWG2022 #INDvsAUS pic.twitter.com/PFCJELoKkw — Kashyap Kadagattur 🇮🇳 (@iamkash_kr) August 7, 2022 Two overs, two moments of magic from Radha Yadav to help India fight back. #CWG2022 #INDvAUS pic.twitter.com/sRqcW56TLq — Aditya Chaturvedi (@aditya_c19) August 7, 2022 We have already seen Indian left-arm spinners who have been GUN fielders throughout their career. Radha Yadav just another addition to the list that already includes players like Ravindra Jadeja and Yuvraj Singh. She has been a live wire in the field today!! #INDvAUS — Prasenjit Dey (@CricPrasen) August 7, 2022 Wait, how is Radha Yadav fielding everywhere on the field? — Abhishek Mukherjee (@ovshake42) August 7, 2022 Catches like these can win you a Gold Medal #RadhaYadav #INDvsAUS #IndWvsAusW #CWG — Vikrant Gupta (@vikrantgupta73) August 7, 2022 For more cricket-related news, click here .","pubDate":"2022-08-07 18:12:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CWG 22: India flawless on field, restrict Australia to 161 in women’s cricket final","link":"https://www.indiatoday.in/sports/commonwealth-games-2022/story/cwg-22-india-flawless-on-field-restrict-australia-to-161-in-women-s-cricket-final-1984986-2022-08-07?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"CWG 22: India flawless on field, restrict Australia to 161 in cricket final","content":null,"pubDate":"2022-08-07 17:55:57","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games live: Australia wins historic gold in women's cricket, more golds in beach volleyball, diving, cycling and athletics - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA4LTA4L2NvbW1vbndlYWx0aC1nYW1lcy1saXZlLWRheS0xMC1ob2NrZXktbmV0YmFsbC1jcmlja2V0LzEwMTMwODc2NtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Commonwealth Games live: Australia wins historic gold in women's cricket, more golds in beach volleyball, diving, cycling and athletics  ABC NewsWild scenes as netball star straddles pole  news.com.auAussies scrape through to T20 Games final  The StandardThe sisterhood of travelling netball fans comes full circle in Birmingham  ABC News‘Absolute chaos’: Heartbreak for Hockeyroos  news.com.auView Full coverage on Google News","content":null,"pubDate":"2022-08-07 17:50:48","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Tahlia McGrath plays CWG final despite testing positive for Covid-19 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXVzLXZzLWluZC1jd2ctMjAyMi10YWhsaWEtbWNncmF0aC1wbGF5cy1maW5hbC1kZXNwaXRlLXRlc3RpbmctcG9zaXRpdmUtZm9yLWNvdmlkLTE5LTEzMjgyMTLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tahlia McGrath plays CWG final despite testing positive for Covid-19  ESPNcricinfoIndia Women vs Australia Women Live Streaming Details- When And Where To Watch IN-W vs AUS-W Live Commonwealth Games In Your Country? Commonwealth Games 2022  Cricket AddictorCWG 2022: India win silver in Lawn Bowls (Men's Fours)  ESPNMatch Preview - AUS Women vs IND Women, Commonwealth Games Women's Cricket Competition 2022, Final  ESPNcricinfoSmriti Mandhana sparkles as India defeat England and go for Commonwealth gold  Sporting NewsView Full Coverage on Google News","content":null,"pubDate":"2022-08-07 17:36:35","image_url":null,"source_id":"google","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Mandhana, Shafali hold record for top-5 fastest 50s for India","link":"https://www.thehansindia.com/sports/mandhana-shafali-hold-record-for-top-5-fastest-50s-for-india-756811","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"India’s women's T20I sets up title clash with Australia","content":"Birmingham: Only two Indian women cricketers, Smriti Mandhana and Shafali Verma, share the top-five fastest fifties for the country in Women's T20I cricket, with the 26-year-old vice-captain laying claim to three of them. On Sunday evening against England, Mandhana smashed a 23-ball half-century against England in the Commonwealth Games semifinal to shatter her own record and, in the process, guide India into the final of the gold-medal clash against Australia. Mandhana went after the England bowlers from the word go. She was accurate in her footwork, usage of crease, timing and placing the shots very well, all in an elegant manner. Katherine Brunt was hit for three boundaries while Alice Capsey was slammed for a brace of fours. She hit five boundaries inside the first three overs and added five more before the end of the powerplay to race to a 23-ball half-century, the fastest by an Indian woman cricketer. It beat her own record of a 24-ball fifty against New Zealand in 2019. She had also hit another half-century off 25 balls against England in 2018 in Mumbai. Mandhana was eventually dismissed in the ninth over for a 32-ball 61, a stunning innings that included eight fours and three sixes.","pubDate":"2022-08-07 17:28:35","image_url":"https://assets.thehansindia.com/h-upload/2022/08/07/500x300_1306815-mandhana.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"McGrath plays Commonwealth Games final despite testing positive for Covid","link":"https://www.business-standard.com/article/sports/mcgrath-plays-commonwealth-games-final-despite-testing-positive-for-covid-122080700949_1.html","keywords":null,"creator":null,"video_url":null,"description":"In a dramatic development, Australia all-rounder Tahlia McGrath was named in the playing eleven for the Commonwealth Games final despite testing positive for COVID-19. The toss was delayed slightly as the Indian cricket team only found about Mcgrath's health status before the flip of the coin. \"Cricket Australia (CA) can confirm that cricketer Tahlia McGrath has returned a positive test for Covid-19. CGA clinical staff have consulted with the Commonwealth Games Federation RACEG (Results Analysis Clinical Expert Group) team and match officials, and McGrath is taking part in today's final against India. \"McGrath presented to team management with mild symptoms on Sunday and subsequently returned the positive test. She was named in the starting XI at the toss and the International Cricket Council (ICC) approved her participation in the final,\" said Cricket Australia in a statement. The BCCI as well as team sources confirmed to PTI that the players including skipper Harmanpreet Kaur got","content":"In a dramatic development, Australia all-rounder Tahlia McGrath was named in the playing eleven for the Commonwealth Games final despite testing positive for COVID-19. The toss was delayed slightly as the Indian cricket team only found about Mcgrath's health status before the flip of the coin. \" Cricket Australia (CA) can confirm that cricketer Tahlia McGrath has returned a positive test for Covid-19. CGA clinical staff have consulted with the Commonwealth Games Federation RACEG (Results Analysis Clinical Expert Group) team and match officials, and McGrath is taking part in today's final against India. \"McGrath presented to team management with mild symptoms on Sunday and subsequently returned the positive test. She was named in the starting XI at the toss and the International Cricket Council (ICC) approved her participation in the final,\" said Cricket Australia in a statement. The BCCI as well as team sources confirmed to PTI that the players including skipper Harmanpreet Kaur got a bit edgy when they found out about Mcgrath. \"There was no time to react since the Indian team only found out about it at the toss. Obviously there was concern but it is the decision of the authorities,\" said a source. The Indian team was itself hit by COVID 19 before its departure to Birmingham with Pooja Vastrakar and S Meghana testing positive at NCA in Bengaluru. \"In consultation with the CGF and the ICC, CGA and Cricket Australia medical staff have implemented a range of comprehensive protocols which will be observed throughout the game and for post-match activity, to minimise the risk of transmission to all players and officials. \"The CGA has maintained a comprehensive Covid-19 risk mitigation strategy for the Birmingham 2022 Commonwealth Games, with testing protocols over and above those required by the Birmingham 2022 Organising Committee,\" the CA statement added. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-08-07 17:27:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220807/thumb-122080700949.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - AUS Women vs IND Women Final 2022 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9jb21tb253ZWFsdGgtZ2FtZXMtd29tZW4tcy1jcmlja2V0LWNvbXBldGl0aW9uLTIwMjItMTI4OTE5NC9pbmRpYS13b21lbi12cy1hdXN0cmFsaWEtd29tZW4tZmluYWwtMTI4OTI3NC9tYXRjaC1yZXBvcnTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - AUS Women vs IND Women Final 2022  ESPNcricinfoAustralia beats India by nine runs at Edgbaston to win Commonwealth Games women's T20 cricket gold  ABC NewsStellar start sees India into golden decider - Cricket Rookie Me Central  Rookie Me CentralAustralia wary of golden opportunity for India revenge  cricket.com.auSmriti Mandhana sparkles as India defeat England and go for Commonwealth gold  Sporting NewsView Full coverage on Google News","content":null,"pubDate":"2022-08-07 17:12:43","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"WI vs IND, 5th T20I: Hardik to lead, Rohit rested as India opt to bat","link":"https://www.thehansindia.com/sports/cricket/wi-vs-ind-5th-t20i-hardik-to-lead-rohit-rested-as-india-opt-to-bat-756808","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India are 3-1 up and have sealed the 5-match seriesThe fifth T20I is currently underway in FloridaIndia have rested 4 players, including Rohit","content":"India have rested four players including Rohit Sharma in the fifth T20I against West Indies, which is currently underway in Florida. The other three players who have been rested are Rishabh Pant, Bhuvneshwar Kumar, and Suryakumar Yadav. Hardik Pandya has been named India's stand-in captain as the tourists have opted to bat at Central Broward Regional Park Stadium Turf Ground, Lauderhill. India have already sealed the series as they are 3-1 up in the five-match T20I series against West Indies. After winning the opening fixture, the hosts bounced back to win the second game before losing the next two. \"Batting gets slower in the second innings. We don't feel we are playing in Miami but in some Indian city. It is fantastic to come abroad and get this support,\" said Hardik after winning the toss. When Hardik was asked about Team India's goal in the dead-rubber fifth T20I, the skipper replied,\" We spoke to the boys that no matter what happens, we have set some standards for the Indian cricket team so the intensity and the attitude stays the same. Four changes: all are resting, Rohit, Rishabh, Bhuvneshwar, Suryakumar go out.\" It's Huddle Time 👍 👍 #TeamIndia | #WIvIND pic.twitter.com/2wVhKHWmHS Suryakumar is the leading run-scorer in the five-match series. He has scored 135 runs in four innings at an average of 33.75 and at a strike rate of 168.75. West Indies' medium-fast pacer Obed McCoy has most wickets as of now, with nine scalps in four T20Is. Going into the fifth game, even West Indies wanted to bat, as per their captain Nicholas Pooran. \"We wanted to bat first but that's fine. We have four changes. Brooks, Walsh, Odean Smith and Keemo Paul have come in. We have to prepare for the WC. This is a fresh group and India is a great team as well. The venue was small at St. Kitts and hence Walsh wasn't included. But we know when we do need a spin option, we have them,\" said Pooran. West Indies vs India, 5th T20I: Playing XI West Indies XI: Shamarh Brooks, Shimron Hetmyer, Nicholas Pooran (c), Devon Thomas (wk), Jason Holder, Odean Smith, Keemo Paul, Dominic Drakes, Obed McCoy, Hayden Walsh, Rovman Powell India XI: Ishan Kishan, Shreyas Iyer, Sanju Samson, Hardik Pandya (c), Deepak Hooda, Dinesh Karthik (wk), Axar Patel, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Arshdeep Singh","pubDate":"2022-08-07 17:02:26","image_url":"https://assets.thehansindia.com/h-upload/2022/08/07/500x300_1306812-hardikrohit.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia Cricketer Tests Positive For COVID-19, Allowed To Play CWG Final","link":"https://sports.ndtv.com/cricket/australia-player-tahlia-mcgrath-allowed-to-play-cwg-final-despite-testing-positive-for-covid-19-3234470","keywords":null,"creator":null,"video_url":null,"description":"McGrath presented to team management with mild symptoms on Sunday and subsequently returned a positive test. She was named in the starting XI at the toss and the International Cricket Council (ICC)...","content":"Cricket Australia (CA) on Sunday confirmed that cricketer Tahlia McGrath returned a positive test for COVID-19 ahead of the Commonwealth Games gold medal match against India. \"CGA clinical staff have consulted with the Commonwealth Games Federation RACEG (Results Analysis Clinical Expert Group) team and match officials, and McGrath is taking part in today's final against India,\" stated an official Cricket Australia release. McGrath presented to team management with mild symptoms on Sunday and subsequently returned a positive test. She was named in the starting XI at the toss and the International Cricket Council (ICC) approved her participation in the final. \"In consultation with the CGF and the ICC, CGA and Cricket Australia medical staff have implemented a range of comprehensive protocols which will be observed throughout the game and for post-match activity, to minimise the risk of transmission to all players and officials,\" stated the release further. She's in. Cleared to play by Commonwealth Games Australia, Tahlia McGrath strides to the middle of Edgbaston #AUSvIND #B2022 https://t.co/MCGyNkp2z6 \"The CGA has maintained a comprehensive Covid-19 risk mitigation strategy for the Birmingham 2022 Commonwealth Games, with testing protocols over and above those required by the Birmingham 2022 Organising Committee,\" it added. In the gold medal match between India and Australia, the latter won the toss and opted to bat first. It is important to note that the toss for the gold medal match was delayed for almost 10-15 minutes. Promoted McGrath was dismissed for 2 runs during Australia's innings India had defeated England in the semi-finals by four runs while Australia had gotten the better of New Zealand.","pubDate":"2022-08-07 16:59:49","image_url":"https://c.ndtvimg.com/2022-03/ivfhrk78_tahlia-mcgrath-afp_625x300_18_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"'He's your best player!' | KP says England must back Roy","link":"https://www.skysports.com/cricket/news/12040/12668038/jason-roy-kevin-pietersen-says-england-have-to-back-best-player-as-opener-struggles-for-form","keywords":null,"creator":null,"video_url":null,"description":"Kevin Pietersen has urged England to back \"best player\" Jason Roy amid the opener's loss of form in white-ball cricket.","content":"Last Updated: 07/08/22 6:29pm Kevin Pietersen has urged England to back \"best player\" Jason Roy amid the opener's loss of form in white-ball cricket. Roy has been one of England's most dependable and exciting players at the top of the order in recent years and was a key part of the World Cup win in 2019, but has struggled so far this summer. Roy has scored just 197 runs across 11 England games, with zero fifties, while he has started his Hundred campaign with the Oval Invincibles with a first-ball duck followed by just 10 against Welsh Fire. Speaking before Roy's cheap dismissal on Sunday, Pietersen said on Sky Sports that Roy has been England's \"best player\" and needs to be given assurances, particularly with a T20 World Cup coming up in October. Please use Chrome browser for a more accessible video player \"Jason has just turned 32 years old,\" said Pietersen. \"What I'm sick and tired of in this country is the journalists writing people off at such a young age. \"Jason Roy's a World Cup winner, He's done an unbelievable job for Eoin Morgan. He was told by Morgan to go out and smack that ball. Now with smacking the ball and being a risk taker, you are going to fail. And when you start failing, failing could happen for a long time. \"If Rob Key [managing director of England cricket] is listening to this, he is your best player and he has been your best player for a number of years. \"What they should be saying and I think this is actually what's happening behind the scenes, back your best players.\" Before the World Cup in Australia, England face Pakistan in seven T20 matches and Pietersen believes Roy will rediscover his form in that series. \"Leave Roy now,\" he added. \"Give Roy the opportunity, through The Hundred, through those T20s to find form again. \"Back him! They've done it with Zak Crawley in Test matches, Ben Stokes has said categorically that that Crawley will play for the rest of the season. They need to do that with Jason Roy in the T20 team.\" Oval Invincibles captain Sam Billings also lent his support to Roy after his latest blow, as he was dismissed for just 10 runs when being caught at short fine leg against Welsh Fire. Please use Chrome browser for a more accessible video player \"He's a world-class player,\" said Billings. \"We've seen him for so long dominate attacks. \"It's only a matter of time before he gets going. Today he's middled one straight to fine leg. \"It will turn, he's too good not to turn. We keep on getting him playing that positive way, getting us off to a great start.\" Tickets for The Hundred are selling fast! If you want to be part of the action, go to thehundred.com/tickets","pubDate":"2022-08-07 16:57:00","image_url":"https://e2.365dm.com/22/08/1920x1080/skysports-jason-roy-invincibles_5857757.jpg?20220807181616","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Aussie star playing despite testing positive","link":"https://www.couriermail.com.au/sport/commonwealth-games/aussie-star-playing-in-commonwealth-games-cricket-final-despite-testing-positive/news-story/ed6c49bc0984c1e2f6cb4bb67131397d","keywords":["Commonwealth Games","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Aussie star Tahlia McGrath is playing in the Commonwealth Games cricket final despite testing positive just hours before the start of play.","content":"McGrath presented with mild symptoms on the morning before the game and then returned a positive result.The Australian Commonwealth Games team confirmed comprehensive protocols have been put in place. McGrath was seen wearing a face mask and was isolated from the rest of her teammates as Australia batted in the first innings.She also walked out to bat still wearing the mask. “Commonwealth Games Australia (CGA) can confirm that cricketer Tahlia McGrath has returned a positive test for Covid-19,” the CGA statement read. “CGA clinical staff have consulted with the Commonwealth Games Federation RACEG (Results Analysis Clinical Expert Group) team and match officials, and McGrath is taking part in today’s final against India.“McGrath presented to team management with mild symptoms on Sunday and subsequently returned the positive test. She was named in the starting XI at the toss and the International Cricket Council (ICC) approved her participation in the final.“In consultation with the CGF and the ICC, CGA and Cricket Australia medical staff have implemented a range of comprehensive protocols which will be observed throughout the game and for post-match activity, to minimise the risk of transmission to all players and officials.The CGA has maintained a comprehensive Covid-19 risk mitigation strategy for the Birmingham 2022 Commonwealth Games, with testing protocols over and above those required by the Birmingham 2022 Organising Committee.”","pubDate":"2022-08-07 16:57:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"}]}