{"newsArray":[{"title":"Tuskers women jump to second in Fifty50 Challenge","link":"https://www.chronicle.co.zw/tuskers-women-jump-to-second-in-fifty50-challenge/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter TUSKERS women moved into second place in the Fifty50 Challenge, a provincial cricket competition after registering a six wicket triumph over Mega Market Mountaineers at Kwekwe Sports Club on Saturday to put pressure on leaders, Eagles. The win took the Bulawayo-based side to 30 points, the same as Eagles, leaving the […]","content":"The Chronicle TUSKERS women moved into second place in the Fifty50 Challenge, a provincial cricket competition after registering a six wicket triumph over Mega Market Mountaineers at Kwekwe Sports Club on Saturday to put pressure on leaders, Eagles. The win took the Bulawayo-based side to 30 points, the same as Eagles, leaving the teams separated by net run rate. After opting to field first, Tuskers bowled out their opponents for 110 runs in 31 overs and went on to finish on 112/4 in 20.1 overs to win their third game in five matches. Team captain, Nomvelo Sibanda put up a magnificent display with the ball as she helped restrict Mountaineers to a low score. In seven overs, the left arm seamer took three wickets for 16 runs, with two of her overs not costing a run. She was supported by Lindokuhle Mabhera who finished with 2/8 in three overs while Loreen Tshuma also took two wickets for 19 runs in six overs. The other wicket takers for Tuskers were Philanthropic Shango, Buhlebenkosi Maposa and Tasmeen Granger who all took one scalp each for 16, 14 and 15 runs respectively. Nyasha Gwanzura top scored for Mountaineers with 32 runs off 46 deliveries while Pellagia Mujaji fell for 20 runs from 30 balls faced. In their chase, the Trevor Phiri coached Tuskers side lost the wickets of Chiedza Dhururu for five runs, Tshuma for a three-ball duck, Natasha Mthomba went for two runs and Granger contributed 11 runs. Sharne Mayers was the star with the bat, remaining undefeated on 64 runs which came off 65 deliveries to help guide her team to victory. Sibanda also remained not out on five runs to see the team through. Kudzai Chigora and Audrey Cherengo took two wickets each for Mountaineers. In the other match, log leaders Eagles swept aside Rhinos with a thumping 130 runs win at Goldridge College in Kwekwe. Batting first, Kelis Ndhlovu’s ton helped Eagles finish on 274/7 in 50 overs to give their opponents a mountain to climb. Ndhlovu finished on 109 runs off 102 deliveries while Modester Mupachikwa fell eight runs short of her century on 92 runs from 112 balls. Eagles went on to restrict Rhinos to 144/9 in 50 overs after a Precious Marange master class with the ball. Marange took four wickets for 25 runs in 10 overs and was supported by Ndhlovu, on the other end who finished with figures 2/20 in 10 overs to be awarded Player of the Match. Christabel Chatonzwa and Olinda Chare took one wicket each. All-rounder Josephine Nkomo top scored for Rhinos with an unbeaten 63 runs off 119 deliveries while Ashley Ndiraya fell for a run a ball 13 as the duo finished as the team’s leading run getters. Three teams are tied on 30 points on the standings having played five matches apiece. Eagles are leading the pack, followed by Tuskers and Rhinos while Mountaineers are at the bottom of the log have 10 points after just one win. — @brandon_malvin","pubDate":"2023-03-28 22:04:23","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"‘CRICKET IS NOW NUMBER ONE","link":"https://www.hmetro.co.zw/cricket-is-now-number-one/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"CRICKET is now the number one sporting discipline in Zimbabwe.","content":"H-Metro Blessing Malinganiza CRICKET is now the number one sporting discipline in Zimbabwe. That is the view of ZC managing director Givemore Makoni. “It is now a foregone conclusion that cricket is now the country’s number one supported sport, by the time the usually followed sporting codes wake up from their slumber, we would be unmatched,” he said. “We are expecting this wave to continue and remain permanent leading into the ICC World Cup Qualifiers scheduled for Harare and Bulawayo in Harare.” Zimbabwe Cricket officials could not have been happier at the turn of events as fans turned out in their thousands at Harare Sports Club for the deciding One Day International match against Netherlands. Their union with local sports company, Oracle Sport, in a fan engagement initiative appeared to be a futile exercise when it was started last year in April. But, it is now a success. “We had no doubt that Oracle could deliver on the mandate set on them to make Harare Sports Club a bubbly fantasy and home for every cricket- loving fanatic. “Of course, they did not do it alone, our media department was also running a parallel campaign which was meant to achieve the same result,” Makoni said. Oracle Sport’s task was to fill the grounds during Zimbabwe A versus South Africa A Twenty20 series at Harare Sports Club, a task that appeared insurmountable. In the recently-ended One Day International series, the Dutch took an early lead in the three-match ICC World Cup Super League series with a three-wicket win in the first ODI. Zimbabwe hung by a thread, holding on to a one-run in the second match to set up a pulsating final on Saturday. This was Netherlands’ biggest mistake to let the Chevrons off the hook as a weekend ensured a bumper crowd for the hosts. Oracle Sport, a local sports consultancy company and ZC official fan engagement partner, invaded the high-density areas with a mini vehicle dishing out fliers and pamphlets, inviting fans to come and support the Chevrons. Prior to the series against Netherlands, Oracle had been giving out incentives for the fans to come to the ground via their #OracleSport#PaintHarareSportsClubRed#AllBehindTheChevrons social media campaign. However, for this particular series, they decided to temporarily suspend the giveaways to gauge the game’s popularity. “Since our relationship with ZC started we have been luring corporates to come on board and affiliate themselves with the cricket brand. “We had Exide Batteries giving us batteries to give away to the lucky fans. “We had EatnLick giving us meal vouchers and we saw Seed Co Limited putting their weight behind us through their maize seed donations. “Lately we had Synstead Investments pouring in USD cash being won by lucky fans at the ground,” Oracle Sport marketing manager, Blessing Chikadaga told H-Metro. “We then took a deliberate stance to ‘starve’ off any of the usual product lines we were giving in the past just to see how much cricket is supported in the country without any carrot dangled on the fans and the result was amazing. “The ground was filled to the brim and even when the game ended some were still trying to make their way into the stands which is quite encouraging.”","pubDate":"2023-03-28 22:03:11","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ZC bans two players for recreational drug use","link":"https://www.chronicle.co.zw/zc-bans-two-players-for-recreational-drug-use/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Mehluli Sibanda, Sports Editor ZIMBABWE Cricket have slapped two emerging cricketers with a three-month ban for using a recreational drug in an out-of-competition case. In a statement released yesterday, ZC said the two up-and-coming players were hauled before a disciplinary committee after being reported to the cricket mother body by a concerned citizen. “Zimbabwe Cricket […]","content":"The Chronicle ZIMBABWE Cricket have slapped two emerging cricketers with a three-month ban for using a recreational drug in an out-of-competition case. In a statement released yesterday, ZC said the two up-and-coming players were hauled before a disciplinary committee after being reported to the cricket mother body by a concerned citizen. “Zimbabwe Cricket (ZC) has suspended two emerging players for three months for using a recreational drug in an out-of-competition case. The two players were summoned to appear before a disciplinary hearing after they were reported to ZC by a concerned citizen who caught them red-handed partaking in suspected substance abuse within the premises of a private residential complex. “They admitted to using a social drug on the day in question resulting in each one of them receiving a three-month ban from cricket activities for breaching the ZC Code of Conduct for Players and Team Officials under which they were charged,’’ read part of the ZC statement. It said the two cricketers could have been in deep trouble had they used the drug during a competition as this would have seen them face tough sanctions. “The Disciplinary Committee noted that had they committed the offence in competition, they would have been charged under ZC’s anti-doping rules and attracted stiffer sanctions, including a ban of up to two years. The two players are first-time offenders and ZC has opted to keep their identities confidential in order to give them the best chance of rehabilitation,’’ said the ZC statement. While ZC did not identify the two offending cricketers, investigations by this publication revealed that they are both based in Masvingo and one of them was in the Zimbabwe Under-19 structures a few years ago. The two are said to have been caught smoking marijuana. _29","pubDate":"2023-03-28 22:01:43","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"No rest for Sikandar Raza … Star all-rounder leaves for Indian Premier League","link":"https://www.chronicle.co.zw/no-rest-for-sikandar-raza-star-all-rounder-leaves-for-indian-premier-league/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter THERE is no rest for Zimbabwe’s star all-rounder Sikandar Raza as he has left the country for Asia once again, this time to take part in the biggest franchise cricket competition, the Indian Premier League (IPL), which officially gets underway on Friday. Raza will turn out for the Punjab Kings for […]","content":"The Chronicle THERE is no rest for Zimbabwe’s star all-rounder Sikandar Raza as he has left the country for Asia once again, this time to take part in the biggest franchise cricket competition, the Indian Premier League (IPL), which officially gets underway on Friday. Raza will turn out for the Punjab Kings for the 16th edition of the richest T20 competition in the world. The Chevrons all-rounder was sold for INR 50 lakhs (US$61 000) in the draft last year and joined an elite group of Zimbabwean cricketers to have been bought by an IPL team, the others being Ray Price, Brendan Taylor, Tatenda Taibu. Price and Taibu remain the only Zimbabweans to play in the IPL after Taylor was signed by the Sunrise Hyderabad in 2014 but when he chose to delay his travel to India because of his wedding, he was placed on standby and never got to feature in the tournament. Raza will be looking at helping his new team reach the play-offs for the first time since 2014. His team finished sixth in 2022 with seven and same number of losses from the 14 matches they played. His departure to the biggest franchise league in the world comes after he helped Zimbabwe win a One Day International (ODI) series against Netherlands in Harare last week. Zimbabwe bagged the three-match contest 2-1 with Raza scoring the final runs, with an unbeaten 18 in the decider. The all-rounder also finished with five wickets in the three matches. “It’s IPL time. See you soon Punjab Kings family, inshallah,” Raza posted on his Twitter page with the Punjab Kings saying they can’t wait to see him. Raza’s Punjab Kings will kick off their campaign against Kolkata Knight Riders on Saturday afternoon. The Zimbabwean was picked for the IPL after a brilliant 2022 which saw him break records in the international arena. He was named in the T20 World Cup Team of the Tournament and was also nominated in the Player of the Tournament category. At Punjab Kings, Raza will be joined by Sam Curran, the son of former Zimbabwe international Kevin Curran. The 36-year-old Chevrons star will be no stranger to international franchise leagues having been part of the Lahore Qalandars side that successfully defended the Pakistan Super League (PSL) title to become only the second Zimbabwean to win it after fast bowler Blessing Muzarabani won it with the Andy Flower coached Multan Sultans in 2021. On top of that, Raza played for the Dubai Capitals in the International League T20 and the Rangpur Riders in the Bangladesh Premier League. At the end of last year, Raza turned out for the Biratnagar Super Kings in the Nepal T20 League. Punjab Kings, who have begun preparations for the tournament will be without the services of Johnny Bairstow who has been ruled out due to a leg injury that he suffered in September last year while playing golf. The Shikhar Dhawan captained side will also be without South Africa’s Kagiso Rabada in the opening match who is set to join the team after the completion of the Proteas’ ODI series against Netherlands. The IPL experience will come in handy for Raza and the Chevrons as they look to qualify for the 50 over World Cup that will be hosted in India later in the year. Zimbabwe will have to go through the Qualifiers which they will host in June thus, the exposure to different international players will be a big boost for him and the team as a whole. – @brandon_malvin","pubDate":"2023-03-28 22:01:16","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ZC ban two players for recreational drug use","link":"https://www.hmetro.co.zw/zc-ban-two-players-for-recreational-drug-use/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE Cricket have suspended two emerging players for three months for using a recreational drug in an out-of-competition case.","content":"H-Metro ZIMBABWE Cricket have suspended two emerging players for three months for using a recreational drug in an out-of-competition case. The two players were summoned to appear for a disciplinary hearing after they were reported to ZC by a concerned citizen who caught them red-handed partaking in suspected substance abuse within the premises of a private residential complex. They admitted to using a social drug on the day in question, resulting in each one of them receiving a three-month ban from cricket activities for breaching the ZC Code of Conduct for Players and Team Officials under which they were charged. The Disciplinary Committee noted that had they committed the offence in competition, they would have been charged under ZC’s anti-doping rules and attracted stiffer sanctions, including a ban of up to two years. – zimcricket","pubDate":"2023-03-28 22:01:09","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"IPL 2023 में कब तक होगी श्रेयस अय्यर की वापसी? KKR के कोच ने दिया ये जवाब","link":"https://www.indiatv.in/sports/cricket/kkr-coach-gave-big-statement-on-shreyas-iyer-return-in-ipl-2023-2023-03-28-946357","keywords":null,"creator":null,"video_url":null,"description":"केकेआर के कोच ने आईपीएल 2023 में श्रेयस अय्यर की वापसी पर एक बड़ा बयान दिया है।","content":"आईपीएल 2023 के शुरू होने से पहले ही कोलकाता नाइट राइडर्स की टीम मुश्किल में है। केकेआर के कप्तान श्रेयस अय्यर चोटिल होने के चलते कई मुकाबलों से बाहर हो गए। उनकी जगह नितीश राणा टीम की कमान संभालेंगे। अय्यर अभी तक पूरे आईपीएल से बाहर नहीं हुए हैं। और इस बात का भी अभी नहीं पता है कि ये खिलाड़ी कब तक वापसी कर पाएगा। वहीं अय्यर की वापसी पर अब केकेआर के कोच चंद्रकांत पंडित ने एक बड़ा बयान दिया। चंद्रकांत पंडित ने कहा कि मैंने जो भी थोड़ी-बहुत क्रिकेट खेली या कोचिंग दी है, मैं टीम में अनुपलब्धता जैसी चीजों से कभी पीछे नहीं हटता। श्रेयस की अनुपस्थिति से फर्क पड़ेगा क्योंकि वह महत्वपूर्ण हैं, लेकिन यह वास्तव में दुर्भाग्यपूर्ण है। हम उम्मीद कर रहे हैं कि श्रेयस बहुत जल्द वापस आएंगे और इससे टीम पर बहुत फर्क पड़ेगा। चंद्रकांत ने आगे कहा कि जब हम खिलाड़ियों का चयन करते हैं और खिलाड़ियों को जिम्मेदारी देते हैं, तो हम देखते हैं कि कौन सक्षम है। और नितीश सक्षम हैं। वह लंबे समय से केकेआर के साथ हैं और उनका घरेलू रिकॉर्ड भी मजबूत है। मैं यह जानकर सहज हूं कि वो भूमिका को संभाल सकता है। हम यह नहीं देखते कि कोई योग्य है या नहीं। हर खिलाड़ी के पास अलग-अलग कौशल है और हमें अपने फैसले पर भरोसा है। बता दें कि श्रेयस अय्यर की चोट केकेआर के लिए सिरदर्द बनी हुई थी। बता दें कि नितीश राणा पहली बार आईपीएल में किसी भी टीम के लिए कप्तानी करते हुए नजर आएंगे। मुंबई इंडियंस के लिए कुछ साल शानदार प्रदर्शन करने के बाद नितीश राणा को केकेआर की टीम ने अपने साथ शामिल किया था। उन्होंने केकेआर की टीम के लिए 91 मैचों में 2181 रन बनाए हैं। उनका सर्वश्रेष्ठ स्कोर 87 रन है। आईपीएल 2022 में उन्होंने केकेआर की टीम के लिए 14 मैचों में 361 रन बनाए थे।","pubDate":"2023-03-28 18:07:59","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 के कई मुकाबलों से बाहर हुए रोहित, ये खिलाड़ी करेगा मुंबई की कप्तानी","link":"https://www.indiatv.in/sports/cricket/rohit-sharma-will-be-out-of-starting-matches-of-ipl-2023-suryakumar-yadav-will-be-captain-of-mumbai-indians-2023-03-28-946343","keywords":null,"creator":null,"video_url":null,"description":"मुंबई इंडियंस के कप्तान रोहित शर्मा आईपीएल 2023 के शुरुआती मुकाबलों से बाहर रहेंगे। ऐसे में मुंबई की टीम एक नए कप्तान के अंडर खेलेगी।","content":"आईपीएल के 16वें सीजन को शुरू होने में अब सिर्फ कुछ ही दिनों का समय बाकी है। सभी टीमों ने अपनी तैयारियां शुरू कर दी हैं। वहीं खिलाड़ी अपने-अपने होम ग्राउंड्स में जमकर प्रैक्टिस कर रहे हैं। लेकिन इसी बीच मुंबई इंडियंस के लिए एक चौंकाने वाली खबर सामने आई है। खबर है कि मुंबई के कप्तान रोहित शर्मा इस सीजन के शुरुआती मैचों में नहीं खेल पाएंगे। इंडियंन एक्सप्रेस की एक रिपोर्ट के मुताबिक रोहित शर्मा वर्कलोड मैनेज करने के चलते शुरुआती मैचों से बाहर रहेंगे। आईपीएल फाइनल के बाद टीम इंडिया को एक हफ्ते बाद वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेलना है। वहीं इसके बाद सभी खिलाड़ी घर में होने वाले वर्ल्ड कप की तैयारियों में जुटेगी। रोहित की गैरमौजूदगी में मुंबई इंडियंस की कमान सूर्यकुमार यादव संभालेंगे। सूर्यकुमार लंबे समय से मुंबई इंडियंस टीम का हिस्सा रहे हैं। वहीं रोहित डग आउट से बैठकर ही मैच पर ध्यान देंगे। बता दें कि रोहित अक्सर ज्यादा वर्कलोड होने के चलते पहले चोटिल हो चुके हैं। ऐसे में आईपीएल में वो खुद के शरीर पर ज्यादा लोड नहीं डालना चाहते। सूर्यकुमार यादव ने पिछले एक साल में टी20 क्रिकेट में तूफान मचा दिया है। इस फॉर्मेट में सूर्या दुनिया के नंबर एक बल्लेबाज हैं। आईपीएल में मुंबई इंडियंस के लिए पिछले कई सालों से खेल रहे सूर्या को इस साल आईपीएल में देखना खास रहेगा। वहीं वो आईपीएल 2023 में सबसे ज्यादा छक्के लगाने के बड़े दावेदार हैं। आईपीएल में सूर्या ने आईपीएल में 62 मैच खेले और 59 पारियों में उन्होंने 1575 रन बनाए। सूर्यकुमार का आईपीएल में सर्वोच्च स्कोर 82 रन है। उनके नाम 0 आईपीएल शतक और 10 आईपीएल अर्धशतक हैं।","pubDate":"2023-03-28 17:20:30","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एनुअल कॉन्ट्रैक्ट से बाहर होने पर रहाणे-भुवनेश्वर का करियर खत्म? इंडिया टीवी के पोल में लोगों का ये रहा जवाब","link":"https://www.indiatv.in/sports/cricket/india-tv-pole-on-bhuvneshwar-kumar-and-ajinkya-rahane-career-after-annual-contract-list-2023-03-28-946323","keywords":null,"creator":null,"video_url":null,"description":"एनुअल कॉन्ट्रैक्ट से बाहर होने पर रहाणे-भुवनेश्वर के करियर पर सवाल उठने लगे हैं।","content":"भारतीय क्रिकेट कंट्रोल बोर्ड (बीसीसीआई) ने रविवार को अक्टूबर 2022 से सितंबर 2023 के लिए खिलाड़ियों के एनुअल कॉन्ट्रैक्ट की लिस्ट जारी कर दी। एनुअल कॉन्ट्रैक्ट की किसी भी कैटेगरी में टीम इंडिया के दिग्गज बल्लेबाज अजिंक्य रहाणे और तेज गेंदबाज भुवनेश्वर कुमार का नाम नहीं था। ऐसे में इन दोनों ही खिलाड़ियों का करियर संकट में नजर आ रहा है। वहीं इंडिया टीवी एक सोशल मीडिया सर्वे में भी क्रिकेट फैंस ने इन दोनों खिलाड़ियों के करियर पर अलग-अलग रिएक्शन दिया। अजिंक्य रहाणे और भुवनेश्वर कुमार पर इंडिया टीवी के एक सोशल मीडिया सर्वे में लोगों के अलग-अलग विचार रहे। इंडिया टीवी ने सर्वे में पूछा कि क्या सालाना कॉन्ट्रैक्ट से बाहर होने के बाद रहाणे और भुवनेश्वर कुमार का करियर खत्म हो जाएगा? इसपर 46.5% लोगों ने हां को वोट किया। वहीं 42.5% लोगों ने कहा कि नहीं ऐसा नहीं होगा। इसके अलावा 11 प्रतिशत लोग इस सवाल को लेकर कुछ भी विचार नहीं रख पाए। रहाणे को दक्षिण अफ्रीका दौरे की समाप्ति के बाद टेस्ट टीम से बाहर कर दिया गया था। इस खिलाड़ी को करीब एक साल से टीम में जगह नहीं मिली है। रहाणे, जोकि एक समय टेस्ट फॉर्मेट में भारतीय टीम की कप्तानी कर रहे थे अब उनकी वापसी के सभी रास्ते लगभग बंद हो चुके हैं। रहाणे ने भारत के लिए 82 टेस्ट, 90 वनडे और 20 टी20 मुकाबले खेले हैं। भुवी को भी लंबे समय से किसी भी फॉर्मेट के लिए टीम इंडिया में नहीं चुना जा रहा है। ऐसे में उनके करियर पर भी संकट मंडरा रहा है। भुवी की बात करें तो उन्होंने 21 टेस्ट, 121 वनडे और 87 टी20 मुकाबले भारत के लिए खेले हैं। इस दौरान उन्होंने क्रमश: 63, 141 और 90 विकेट झटके।","pubDate":"2023-03-28 16:19:39","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Stokes heads for IPL after jab in wounded knee","link":"https://thewest.com.au/sport/cricket/stokes-heads-for-ipl-after-jab-in-wounded-knee-c-10184927","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"England captain Ben Stokes has joined his IPL team after an injection in the troublesome knee which restricted his bowling during the tour of New Zealand.","content":"Ben Stokes' injured knee looks set to become as much a part of Ashes folklore as Terry Alderman's shoulder, Glenn McGrath's ankle and Jofra Archer's elbow. England are hoping unlike those injuries Stokes' left knee does not keep him out of any Test matches, but he has joined his Indian Premier League side only after having an injection in it. Stokes is due to play for Chennai Super Kings (CSK), who open the IPL against defending champions Gujarat Titans in Friday. He will not, however, be bowling, said CSK's batting coach Mike Hussey. \"He's ready to go as a batsman from the start, the bowling might be wait and see. I know he had his first very light bowl this week since he had his injections in his knee,\" said the Australian. \"My understanding is he won't be bowling much at all in the first few games of the tournament, or it might be a few weeks. Hopefully we'll get him bowling at some stage in the tournament.\" The all-rounder was visibly troubled by his knee during England's recent series in New Zealand. He bowled only nine of the 345 overs England sent down (40-year-old Jimmy Anderson bowled 43). He was clearly restricted by it when batting in England's final innings having appeared to exacerbate the injury in the field. In an ideal world England would prefer he did not go to the IPL, but CSK paid 1.6 million pounds ($A2.9 million) for his services and Stokes has long said he will honour his commitment (with the proviso he leaves before the finals to prepare for England's first Test of the summer against against Ireland, beginning on 1 June). However if Stokes can't bowl, that affects the balance of the side, England traditionally preferring to go with five bowlers, one being an all-rounder, than four as Australian teams often do. Ironically the emergence of Cam Green means it could be the tourists with the extra bowler this series. And if the injury actually prevents Stokes playing, a real possibility with five Tests in seven weeks, well that's something English cricket would rather not think about. Sign up for our emails","pubDate":"2023-03-28 16:11:57","image_url":"https://images.thewest.com.au/publication/C-10184927/22fc81516ecc05691ff2918025cdc7d48dfdcba7-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka Penalised, Docked One Point For Slow Over Rate","link":"https://www.thetimesofbengal.com/sports/sri-lanka-penalised-docked-one-point-for-slow-over-rate/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports NZ Vs SL, 1st ODI: Sri Lanka Penalised, Docked One Point For Slow Over-Rate The deduction along with a washout in Christchurch during the second ODI means that Sri Lanka now have 81 instead of 82 points.\r Sri Lanka players celebrate after taking a New Zealand wicket in 1st ODI. (Image: Blackcaps/Twitter) Dubai: […]","content":"Dubai: Sri Lanka have been fined 20 per cent of their match fee and docked a point in the ongoing ICC Men’s Cricket World Cup Super League cycle for maintaining a slow over-rate in the first ODI against New Zealand in Auckland. Jeff Crowe of the ICC Elite Panel of Match Referees imposed the sanction after Dasun Shanaka’s side was ruled to be one over short of the target after time allowances were taken into consideration for the game played on Saturday. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time. In addition, as per Article 16.12.2 of the ICC Men’s Cricket World Cup Super League Playing Conditions, a side is penalised one point for each over short. Consequently, Sri Lanka lost one point from their points tally. “Shanaka pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing,” the ICC said in a media release. On-field umpires Shaun Haig and Wayne Knights, third umpire Chris Brown and fourth umpire Cory Black levelled the charge. The top eight sides in the ICC Men’s Cricket World Cup Super League standings qualify directly for the World Cup. Sri Lanka are currently placed in the ninth spot with a game to go. South Africa (78 points) are one below with two to play, and Ireland (68 points) have three fixtures in hand. This deduction along with a washout in Christchurch during the second ODI means that Sri Lanka now have 81 instead of 82 points. With only a solitary fixture in their hand, the Sri Lankans are in danger of missing out on a direct berth to the World Cup. Sri Lanka need to win the third ODI to surpass West Indies and move up to the eighth position in the standings. But even if they win the final ODI against New Zealand to earn an extra 10 Super League points and rise into the eighth spot on the standings, their qualification hopes depend on the performance of South Africa, who are currently in the tenth position with 80 points. Sri Lanka only have one match remaining in the Super League, with their clash against New Zealand in the third and final ODI in Hamilton on Friday their last chance to overtake the West Indies and move into a critical top-eight place to qualify automatically for this year’s tournament. But even if Sri Lanka do win that final ODI against New Zealand to earn an extra 10 Super League points and rise into the eighth spot on the standings, they could still be forced into the Qualifier in Zimbabwe as 10th placed South Africa have enough matches in hand to overtake them. South Africa have two matches left of their postponed ODI series against the Netherlands and wins in both of those contests would see the Proteas jump in front of both Sri Lanka and the West Indies and into the pivotal eighth place. The 11th-placed Ireland could also still qualify automatically, given they have three matches remaining against Bangladesh in May. New Zealand currently sit at the top of the Super League standings with 165 points and also have one match left to play in the series. Source link","pubDate":"2023-03-28 15:57:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Tuskers women jump to second in Fifty50 Challenge","link":"https://www.chronicle.co.zw/tuskers-women-jump-to-second-in-fifty50-challenge/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter TUSKERS women moved into second place in the Fifty50 Challenge, a provincial cricket competition after registering a six wicket triumph over Mega Market Mountaineers at Kwekwe Sports Club on Saturday to put pressure on leaders, Eagles. The win took the Bulawayo-based side to 30 points, the same as Eagles, leaving the […]","content":"The Chronicle TUSKERS women moved into second place in the Fifty50 Challenge, a provincial cricket competition after registering a six wicket triumph over Mega Market Mountaineers at Kwekwe Sports Club on Saturday to put pressure on leaders, Eagles. The win took the Bulawayo-based side to 30 points, the same as Eagles, leaving the teams separated by net run rate. After opting to field first, Tuskers bowled out their opponents for 110 runs in 31 overs and went on to finish on 112/4 in 20.1 overs to win their third game in five matches. Team captain, Nomvelo Sibanda put up a magnificent display with the ball as she helped restrict Mountaineers to a low score. In seven overs, the left arm seamer took three wickets for 16 runs, with two of her overs not costing a run. She was supported by Lindokuhle Mabhera who finished with 2/8 in three overs while Loreen Tshuma also took two wickets for 19 runs in six overs. The other wicket takers for Tuskers were Philanthropic Shango, Buhlebenkosi Maposa and Tasmeen Granger who all took one scalp each for 16, 14 and 15 runs respectively. Nyasha Gwanzura top scored for Mountaineers with 32 runs off 46 deliveries while Pellagia Mujaji fell for 20 runs from 30 balls faced. In their chase, the Trevor Phiri coached Tuskers side lost the wickets of Chiedza Dhururu for five runs, Tshuma for a three-ball duck, Natasha Mthomba went for two runs and Granger contributed 11 runs. Sharne Mayers was the star with the bat, remaining undefeated on 64 runs which came off 65 deliveries to help guide her team to victory. Sibanda also remained not out on five runs to see the team through. Kudzai Chigora and Audrey Cherengo took two wickets each for Mountaineers. In the other match, log leaders Eagles swept aside Rhinos with a thumping 130 runs win at Goldridge College in Kwekwe. Batting first, Kelis Ndhlovu’s ton helped Eagles finish on 274/7 in 50 overs to give their opponents a mountain to climb. Ndhlovu finished on 109 runs off 102 deliveries while Modester Mupachikwa fell eight runs short of her century on 92 runs from 112 balls. Eagles went on to restrict Rhinos to 144/9 in 50 overs after a Precious Marange master class with the ball. Marange took four wickets for 25 runs in 10 overs and was supported by Ndhlovu, on the other end who finished with figures 2/20 in 10 overs to be awarded Player of the Match. Christabel Chatonzwa and Olinda Chare took one wicket each. All-rounder Josephine Nkomo top scored for Rhinos with an unbeaten 63 runs off 119 deliveries while Ashley Ndiraya fell for a run a ball 13 as the duo finished as the team’s leading run getters. Three teams are tied on 30 points on the standings having played five matches apiece. Eagles are leading the pack, followed by Tuskers and Rhinos while Mountaineers are at the bottom of the log have 10 points after just one win. — @brandon_malvin","pubDate":"2023-03-28 22:04:23","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"‘CRICKET IS NOW NUMBER ONE","link":"https://www.hmetro.co.zw/cricket-is-now-number-one/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"CRICKET is now the number one sporting discipline in Zimbabwe.","content":"H-Metro Blessing Malinganiza CRICKET is now the number one sporting discipline in Zimbabwe. That is the view of ZC managing director Givemore Makoni. “It is now a foregone conclusion that cricket is now the country’s number one supported sport, by the time the usually followed sporting codes wake up from their slumber, we would be unmatched,” he said. “We are expecting this wave to continue and remain permanent leading into the ICC World Cup Qualifiers scheduled for Harare and Bulawayo in Harare.” Zimbabwe Cricket officials could not have been happier at the turn of events as fans turned out in their thousands at Harare Sports Club for the deciding One Day International match against Netherlands. Their union with local sports company, Oracle Sport, in a fan engagement initiative appeared to be a futile exercise when it was started last year in April. But, it is now a success. “We had no doubt that Oracle could deliver on the mandate set on them to make Harare Sports Club a bubbly fantasy and home for every cricket- loving fanatic. “Of course, they did not do it alone, our media department was also running a parallel campaign which was meant to achieve the same result,” Makoni said. Oracle Sport’s task was to fill the grounds during Zimbabwe A versus South Africa A Twenty20 series at Harare Sports Club, a task that appeared insurmountable. In the recently-ended One Day International series, the Dutch took an early lead in the three-match ICC World Cup Super League series with a three-wicket win in the first ODI. Zimbabwe hung by a thread, holding on to a one-run in the second match to set up a pulsating final on Saturday. This was Netherlands’ biggest mistake to let the Chevrons off the hook as a weekend ensured a bumper crowd for the hosts. Oracle Sport, a local sports consultancy company and ZC official fan engagement partner, invaded the high-density areas with a mini vehicle dishing out fliers and pamphlets, inviting fans to come and support the Chevrons. Prior to the series against Netherlands, Oracle had been giving out incentives for the fans to come to the ground via their #OracleSport#PaintHarareSportsClubRed#AllBehindTheChevrons social media campaign. However, for this particular series, they decided to temporarily suspend the giveaways to gauge the game’s popularity. “Since our relationship with ZC started we have been luring corporates to come on board and affiliate themselves with the cricket brand. “We had Exide Batteries giving us batteries to give away to the lucky fans. “We had EatnLick giving us meal vouchers and we saw Seed Co Limited putting their weight behind us through their maize seed donations. “Lately we had Synstead Investments pouring in USD cash being won by lucky fans at the ground,” Oracle Sport marketing manager, Blessing Chikadaga told H-Metro. “We then took a deliberate stance to ‘starve’ off any of the usual product lines we were giving in the past just to see how much cricket is supported in the country without any carrot dangled on the fans and the result was amazing. “The ground was filled to the brim and even when the game ended some were still trying to make their way into the stands which is quite encouraging.”","pubDate":"2023-03-28 22:03:11","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ZC bans two players for recreational drug use","link":"https://www.chronicle.co.zw/zc-bans-two-players-for-recreational-drug-use/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Mehluli Sibanda, Sports Editor ZIMBABWE Cricket have slapped two emerging cricketers with a three-month ban for using a recreational drug in an out-of-competition case. In a statement released yesterday, ZC said the two up-and-coming players were hauled before a disciplinary committee after being reported to the cricket mother body by a concerned citizen. “Zimbabwe Cricket […]","content":"The Chronicle ZIMBABWE Cricket have slapped two emerging cricketers with a three-month ban for using a recreational drug in an out-of-competition case. In a statement released yesterday, ZC said the two up-and-coming players were hauled before a disciplinary committee after being reported to the cricket mother body by a concerned citizen. “Zimbabwe Cricket (ZC) has suspended two emerging players for three months for using a recreational drug in an out-of-competition case. The two players were summoned to appear before a disciplinary hearing after they were reported to ZC by a concerned citizen who caught them red-handed partaking in suspected substance abuse within the premises of a private residential complex. “They admitted to using a social drug on the day in question resulting in each one of them receiving a three-month ban from cricket activities for breaching the ZC Code of Conduct for Players and Team Officials under which they were charged,’’ read part of the ZC statement. It said the two cricketers could have been in deep trouble had they used the drug during a competition as this would have seen them face tough sanctions. “The Disciplinary Committee noted that had they committed the offence in competition, they would have been charged under ZC’s anti-doping rules and attracted stiffer sanctions, including a ban of up to two years. The two players are first-time offenders and ZC has opted to keep their identities confidential in order to give them the best chance of rehabilitation,’’ said the ZC statement. While ZC did not identify the two offending cricketers, investigations by this publication revealed that they are both based in Masvingo and one of them was in the Zimbabwe Under-19 structures a few years ago. The two are said to have been caught smoking marijuana. _29","pubDate":"2023-03-28 22:01:43","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"No rest for Sikandar Raza … Star all-rounder leaves for Indian Premier League","link":"https://www.chronicle.co.zw/no-rest-for-sikandar-raza-star-all-rounder-leaves-for-indian-premier-league/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter THERE is no rest for Zimbabwe’s star all-rounder Sikandar Raza as he has left the country for Asia once again, this time to take part in the biggest franchise cricket competition, the Indian Premier League (IPL), which officially gets underway on Friday. Raza will turn out for the Punjab Kings for […]","content":"The Chronicle THERE is no rest for Zimbabwe’s star all-rounder Sikandar Raza as he has left the country for Asia once again, this time to take part in the biggest franchise cricket competition, the Indian Premier League (IPL), which officially gets underway on Friday. Raza will turn out for the Punjab Kings for the 16th edition of the richest T20 competition in the world. The Chevrons all-rounder was sold for INR 50 lakhs (US$61 000) in the draft last year and joined an elite group of Zimbabwean cricketers to have been bought by an IPL team, the others being Ray Price, Brendan Taylor, Tatenda Taibu. Price and Taibu remain the only Zimbabweans to play in the IPL after Taylor was signed by the Sunrise Hyderabad in 2014 but when he chose to delay his travel to India because of his wedding, he was placed on standby and never got to feature in the tournament. Raza will be looking at helping his new team reach the play-offs for the first time since 2014. His team finished sixth in 2022 with seven and same number of losses from the 14 matches they played. His departure to the biggest franchise league in the world comes after he helped Zimbabwe win a One Day International (ODI) series against Netherlands in Harare last week. Zimbabwe bagged the three-match contest 2-1 with Raza scoring the final runs, with an unbeaten 18 in the decider. The all-rounder also finished with five wickets in the three matches. “It’s IPL time. See you soon Punjab Kings family, inshallah,” Raza posted on his Twitter page with the Punjab Kings saying they can’t wait to see him. Raza’s Punjab Kings will kick off their campaign against Kolkata Knight Riders on Saturday afternoon. The Zimbabwean was picked for the IPL after a brilliant 2022 which saw him break records in the international arena. He was named in the T20 World Cup Team of the Tournament and was also nominated in the Player of the Tournament category. At Punjab Kings, Raza will be joined by Sam Curran, the son of former Zimbabwe international Kevin Curran. The 36-year-old Chevrons star will be no stranger to international franchise leagues having been part of the Lahore Qalandars side that successfully defended the Pakistan Super League (PSL) title to become only the second Zimbabwean to win it after fast bowler Blessing Muzarabani won it with the Andy Flower coached Multan Sultans in 2021. On top of that, Raza played for the Dubai Capitals in the International League T20 and the Rangpur Riders in the Bangladesh Premier League. At the end of last year, Raza turned out for the Biratnagar Super Kings in the Nepal T20 League. Punjab Kings, who have begun preparations for the tournament will be without the services of Johnny Bairstow who has been ruled out due to a leg injury that he suffered in September last year while playing golf. The Shikhar Dhawan captained side will also be without South Africa’s Kagiso Rabada in the opening match who is set to join the team after the completion of the Proteas’ ODI series against Netherlands. The IPL experience will come in handy for Raza and the Chevrons as they look to qualify for the 50 over World Cup that will be hosted in India later in the year. Zimbabwe will have to go through the Qualifiers which they will host in June thus, the exposure to different international players will be a big boost for him and the team as a whole. – @brandon_malvin","pubDate":"2023-03-28 22:01:16","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ZC ban two players for recreational drug use","link":"https://www.hmetro.co.zw/zc-ban-two-players-for-recreational-drug-use/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE Cricket have suspended two emerging players for three months for using a recreational drug in an out-of-competition case.","content":"H-Metro ZIMBABWE Cricket have suspended two emerging players for three months for using a recreational drug in an out-of-competition case. The two players were summoned to appear for a disciplinary hearing after they were reported to ZC by a concerned citizen who caught them red-handed partaking in suspected substance abuse within the premises of a private residential complex. They admitted to using a social drug on the day in question, resulting in each one of them receiving a three-month ban from cricket activities for breaching the ZC Code of Conduct for Players and Team Officials under which they were charged. The Disciplinary Committee noted that had they committed the offence in competition, they would have been charged under ZC’s anti-doping rules and attracted stiffer sanctions, including a ban of up to two years. – zimcricket","pubDate":"2023-03-28 22:01:09","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"IPL 2023 में कब तक होगी श्रेयस अय्यर की वापसी? KKR के कोच ने दिया ये जवाब","link":"https://www.indiatv.in/sports/cricket/kkr-coach-gave-big-statement-on-shreyas-iyer-return-in-ipl-2023-2023-03-28-946357","keywords":null,"creator":null,"video_url":null,"description":"केकेआर के कोच ने आईपीएल 2023 में श्रेयस अय्यर की वापसी पर एक बड़ा बयान दिया है।","content":"आईपीएल 2023 के शुरू होने से पहले ही कोलकाता नाइट राइडर्स की टीम मुश्किल में है। केकेआर के कप्तान श्रेयस अय्यर चोटिल होने के चलते कई मुकाबलों से बाहर हो गए। उनकी जगह नितीश राणा टीम की कमान संभालेंगे। अय्यर अभी तक पूरे आईपीएल से बाहर नहीं हुए हैं। और इस बात का भी अभी नहीं पता है कि ये खिलाड़ी कब तक वापसी कर पाएगा। वहीं अय्यर की वापसी पर अब केकेआर के कोच चंद्रकांत पंडित ने एक बड़ा बयान दिया। चंद्रकांत पंडित ने कहा कि मैंने जो भी थोड़ी-बहुत क्रिकेट खेली या कोचिंग दी है, मैं टीम में अनुपलब्धता जैसी चीजों से कभी पीछे नहीं हटता। श्रेयस की अनुपस्थिति से फर्क पड़ेगा क्योंकि वह महत्वपूर्ण हैं, लेकिन यह वास्तव में दुर्भाग्यपूर्ण है। हम उम्मीद कर रहे हैं कि श्रेयस बहुत जल्द वापस आएंगे और इससे टीम पर बहुत फर्क पड़ेगा। चंद्रकांत ने आगे कहा कि जब हम खिलाड़ियों का चयन करते हैं और खिलाड़ियों को जिम्मेदारी देते हैं, तो हम देखते हैं कि कौन सक्षम है। और नितीश सक्षम हैं। वह लंबे समय से केकेआर के साथ हैं और उनका घरेलू रिकॉर्ड भी मजबूत है। मैं यह जानकर सहज हूं कि वो भूमिका को संभाल सकता है। हम यह नहीं देखते कि कोई योग्य है या नहीं। हर खिलाड़ी के पास अलग-अलग कौशल है और हमें अपने फैसले पर भरोसा है। बता दें कि श्रेयस अय्यर की चोट केकेआर के लिए सिरदर्द बनी हुई थी। बता दें कि नितीश राणा पहली बार आईपीएल में किसी भी टीम के लिए कप्तानी करते हुए नजर आएंगे। मुंबई इंडियंस के लिए कुछ साल शानदार प्रदर्शन करने के बाद नितीश राणा को केकेआर की टीम ने अपने साथ शामिल किया था। उन्होंने केकेआर की टीम के लिए 91 मैचों में 2181 रन बनाए हैं। उनका सर्वश्रेष्ठ स्कोर 87 रन है। आईपीएल 2022 में उन्होंने केकेआर की टीम के लिए 14 मैचों में 361 रन बनाए थे।","pubDate":"2023-03-28 18:07:59","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 के कई मुकाबलों से बाहर हुए रोहित, ये खिलाड़ी करेगा मुंबई की कप्तानी","link":"https://www.indiatv.in/sports/cricket/rohit-sharma-will-be-out-of-starting-matches-of-ipl-2023-suryakumar-yadav-will-be-captain-of-mumbai-indians-2023-03-28-946343","keywords":null,"creator":null,"video_url":null,"description":"मुंबई इंडियंस के कप्तान रोहित शर्मा आईपीएल 2023 के शुरुआती मुकाबलों से बाहर रहेंगे। ऐसे में मुंबई की टीम एक नए कप्तान के अंडर खेलेगी।","content":"आईपीएल के 16वें सीजन को शुरू होने में अब सिर्फ कुछ ही दिनों का समय बाकी है। सभी टीमों ने अपनी तैयारियां शुरू कर दी हैं। वहीं खिलाड़ी अपने-अपने होम ग्राउंड्स में जमकर प्रैक्टिस कर रहे हैं। लेकिन इसी बीच मुंबई इंडियंस के लिए एक चौंकाने वाली खबर सामने आई है। खबर है कि मुंबई के कप्तान रोहित शर्मा इस सीजन के शुरुआती मैचों में नहीं खेल पाएंगे। इंडियंन एक्सप्रेस की एक रिपोर्ट के मुताबिक रोहित शर्मा वर्कलोड मैनेज करने के चलते शुरुआती मैचों से बाहर रहेंगे। आईपीएल फाइनल के बाद टीम इंडिया को एक हफ्ते बाद वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेलना है। वहीं इसके बाद सभी खिलाड़ी घर में होने वाले वर्ल्ड कप की तैयारियों में जुटेगी। रोहित की गैरमौजूदगी में मुंबई इंडियंस की कमान सूर्यकुमार यादव संभालेंगे। सूर्यकुमार लंबे समय से मुंबई इंडियंस टीम का हिस्सा रहे हैं। वहीं रोहित डग आउट से बैठकर ही मैच पर ध्यान देंगे। बता दें कि रोहित अक्सर ज्यादा वर्कलोड होने के चलते पहले चोटिल हो चुके हैं। ऐसे में आईपीएल में वो खुद के शरीर पर ज्यादा लोड नहीं डालना चाहते। सूर्यकुमार यादव ने पिछले एक साल में टी20 क्रिकेट में तूफान मचा दिया है। इस फॉर्मेट में सूर्या दुनिया के नंबर एक बल्लेबाज हैं। आईपीएल में मुंबई इंडियंस के लिए पिछले कई सालों से खेल रहे सूर्या को इस साल आईपीएल में देखना खास रहेगा। वहीं वो आईपीएल 2023 में सबसे ज्यादा छक्के लगाने के बड़े दावेदार हैं। आईपीएल में सूर्या ने आईपीएल में 62 मैच खेले और 59 पारियों में उन्होंने 1575 रन बनाए। सूर्यकुमार का आईपीएल में सर्वोच्च स्कोर 82 रन है। उनके नाम 0 आईपीएल शतक और 10 आईपीएल अर्धशतक हैं।","pubDate":"2023-03-28 17:20:30","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एनुअल कॉन्ट्रैक्ट से बाहर होने पर रहाणे-भुवनेश्वर का करियर खत्म? इंडिया टीवी के पोल में लोगों का ये रहा जवाब","link":"https://www.indiatv.in/sports/cricket/india-tv-pole-on-bhuvneshwar-kumar-and-ajinkya-rahane-career-after-annual-contract-list-2023-03-28-946323","keywords":null,"creator":null,"video_url":null,"description":"एनुअल कॉन्ट्रैक्ट से बाहर होने पर रहाणे-भुवनेश्वर के करियर पर सवाल उठने लगे हैं।","content":"भारतीय क्रिकेट कंट्रोल बोर्ड (बीसीसीआई) ने रविवार को अक्टूबर 2022 से सितंबर 2023 के लिए खिलाड़ियों के एनुअल कॉन्ट्रैक्ट की लिस्ट जारी कर दी। एनुअल कॉन्ट्रैक्ट की किसी भी कैटेगरी में टीम इंडिया के दिग्गज बल्लेबाज अजिंक्य रहाणे और तेज गेंदबाज भुवनेश्वर कुमार का नाम नहीं था। ऐसे में इन दोनों ही खिलाड़ियों का करियर संकट में नजर आ रहा है। वहीं इंडिया टीवी एक सोशल मीडिया सर्वे में भी क्रिकेट फैंस ने इन दोनों खिलाड़ियों के करियर पर अलग-अलग रिएक्शन दिया। अजिंक्य रहाणे और भुवनेश्वर कुमार पर इंडिया टीवी के एक सोशल मीडिया सर्वे में लोगों के अलग-अलग विचार रहे। इंडिया टीवी ने सर्वे में पूछा कि क्या सालाना कॉन्ट्रैक्ट से बाहर होने के बाद रहाणे और भुवनेश्वर कुमार का करियर खत्म हो जाएगा? इसपर 46.5% लोगों ने हां को वोट किया। वहीं 42.5% लोगों ने कहा कि नहीं ऐसा नहीं होगा। इसके अलावा 11 प्रतिशत लोग इस सवाल को लेकर कुछ भी विचार नहीं रख पाए। रहाणे को दक्षिण अफ्रीका दौरे की समाप्ति के बाद टेस्ट टीम से बाहर कर दिया गया था। इस खिलाड़ी को करीब एक साल से टीम में जगह नहीं मिली है। रहाणे, जोकि एक समय टेस्ट फॉर्मेट में भारतीय टीम की कप्तानी कर रहे थे अब उनकी वापसी के सभी रास्ते लगभग बंद हो चुके हैं। रहाणे ने भारत के लिए 82 टेस्ट, 90 वनडे और 20 टी20 मुकाबले खेले हैं। भुवी को भी लंबे समय से किसी भी फॉर्मेट के लिए टीम इंडिया में नहीं चुना जा रहा है। ऐसे में उनके करियर पर भी संकट मंडरा रहा है। भुवी की बात करें तो उन्होंने 21 टेस्ट, 121 वनडे और 87 टी20 मुकाबले भारत के लिए खेले हैं। इस दौरान उन्होंने क्रमश: 63, 141 और 90 विकेट झटके।","pubDate":"2023-03-28 16:19:39","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Stokes heads for IPL after jab in wounded knee","link":"https://thewest.com.au/sport/cricket/stokes-heads-for-ipl-after-jab-in-wounded-knee-c-10184927","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"England captain Ben Stokes has joined his IPL team after an injection in the troublesome knee which restricted his bowling during the tour of New Zealand.","content":"Ben Stokes' injured knee looks set to become as much a part of Ashes folklore as Terry Alderman's shoulder, Glenn McGrath's ankle and Jofra Archer's elbow. England are hoping unlike those injuries Stokes' left knee does not keep him out of any Test matches, but he has joined his Indian Premier League side only after having an injection in it. Stokes is due to play for Chennai Super Kings (CSK), who open the IPL against defending champions Gujarat Titans in Friday. He will not, however, be bowling, said CSK's batting coach Mike Hussey. \"He's ready to go as a batsman from the start, the bowling might be wait and see. I know he had his first very light bowl this week since he had his injections in his knee,\" said the Australian. \"My understanding is he won't be bowling much at all in the first few games of the tournament, or it might be a few weeks. Hopefully we'll get him bowling at some stage in the tournament.\" The all-rounder was visibly troubled by his knee during England's recent series in New Zealand. He bowled only nine of the 345 overs England sent down (40-year-old Jimmy Anderson bowled 43). He was clearly restricted by it when batting in England's final innings having appeared to exacerbate the injury in the field. In an ideal world England would prefer he did not go to the IPL, but CSK paid 1.6 million pounds ($A2.9 million) for his services and Stokes has long said he will honour his commitment (with the proviso he leaves before the finals to prepare for England's first Test of the summer against against Ireland, beginning on 1 June). However if Stokes can't bowl, that affects the balance of the side, England traditionally preferring to go with five bowlers, one being an all-rounder, than four as Australian teams often do. Ironically the emergence of Cam Green means it could be the tourists with the extra bowler this series. And if the injury actually prevents Stokes playing, a real possibility with five Tests in seven weeks, well that's something English cricket would rather not think about. Sign up for our emails","pubDate":"2023-03-28 16:11:57","image_url":"https://images.thewest.com.au/publication/C-10184927/22fc81516ecc05691ff2918025cdc7d48dfdcba7-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka Penalised, Docked One Point For Slow Over Rate","link":"https://www.thetimesofbengal.com/sports/sri-lanka-penalised-docked-one-point-for-slow-over-rate/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports NZ Vs SL, 1st ODI: Sri Lanka Penalised, Docked One Point For Slow Over-Rate The deduction along with a washout in Christchurch during the second ODI means that Sri Lanka now have 81 instead of 82 points.\r Sri Lanka players celebrate after taking a New Zealand wicket in 1st ODI. (Image: Blackcaps/Twitter) Dubai: […]","content":"Dubai: Sri Lanka have been fined 20 per cent of their match fee and docked a point in the ongoing ICC Men’s Cricket World Cup Super League cycle for maintaining a slow over-rate in the first ODI against New Zealand in Auckland. Jeff Crowe of the ICC Elite Panel of Match Referees imposed the sanction after Dasun Shanaka’s side was ruled to be one over short of the target after time allowances were taken into consideration for the game played on Saturday. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time. In addition, as per Article 16.12.2 of the ICC Men’s Cricket World Cup Super League Playing Conditions, a side is penalised one point for each over short. Consequently, Sri Lanka lost one point from their points tally. “Shanaka pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing,” the ICC said in a media release. On-field umpires Shaun Haig and Wayne Knights, third umpire Chris Brown and fourth umpire Cory Black levelled the charge. The top eight sides in the ICC Men’s Cricket World Cup Super League standings qualify directly for the World Cup. Sri Lanka are currently placed in the ninth spot with a game to go. South Africa (78 points) are one below with two to play, and Ireland (68 points) have three fixtures in hand. This deduction along with a washout in Christchurch during the second ODI means that Sri Lanka now have 81 instead of 82 points. With only a solitary fixture in their hand, the Sri Lankans are in danger of missing out on a direct berth to the World Cup. Sri Lanka need to win the third ODI to surpass West Indies and move up to the eighth position in the standings. But even if they win the final ODI against New Zealand to earn an extra 10 Super League points and rise into the eighth spot on the standings, their qualification hopes depend on the performance of South Africa, who are currently in the tenth position with 80 points. Sri Lanka only have one match remaining in the Super League, with their clash against New Zealand in the third and final ODI in Hamilton on Friday their last chance to overtake the West Indies and move into a critical top-eight place to qualify automatically for this year’s tournament. But even if Sri Lanka do win that final ODI against New Zealand to earn an extra 10 Super League points and rise into the eighth spot on the standings, they could still be forced into the Qualifier in Zimbabwe as 10th placed South Africa have enough matches in hand to overtake them. South Africa have two matches left of their postponed ODI series against the Netherlands and wins in both of those contests would see the Proteas jump in front of both Sri Lanka and the West Indies and into the pivotal eighth place. The 11th-placed Ireland could also still qualify automatically, given they have three matches remaining against Bangladesh in May. New Zealand currently sit at the top of the Super League standings with 165 points and also have one match left to play in the series. Source link","pubDate":"2023-03-28 15:57:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Tuskers women jump to second in Fifty50 Challenge","link":"https://www.chronicle.co.zw/tuskers-women-jump-to-second-in-fifty50-challenge/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter TUSKERS women moved into second place in the Fifty50 Challenge, a provincial cricket competition after registering a six wicket triumph over Mega Market Mountaineers at Kwekwe Sports Club on Saturday to put pressure on leaders, Eagles. The win took the Bulawayo-based side to 30 points, the same as Eagles, leaving the […]","content":"The Chronicle TUSKERS women moved into second place in the Fifty50 Challenge, a provincial cricket competition after registering a six wicket triumph over Mega Market Mountaineers at Kwekwe Sports Club on Saturday to put pressure on leaders, Eagles. The win took the Bulawayo-based side to 30 points, the same as Eagles, leaving the teams separated by net run rate. After opting to field first, Tuskers bowled out their opponents for 110 runs in 31 overs and went on to finish on 112/4 in 20.1 overs to win their third game in five matches. Team captain, Nomvelo Sibanda put up a magnificent display with the ball as she helped restrict Mountaineers to a low score. In seven overs, the left arm seamer took three wickets for 16 runs, with two of her overs not costing a run. She was supported by Lindokuhle Mabhera who finished with 2/8 in three overs while Loreen Tshuma also took two wickets for 19 runs in six overs. The other wicket takers for Tuskers were Philanthropic Shango, Buhlebenkosi Maposa and Tasmeen Granger who all took one scalp each for 16, 14 and 15 runs respectively. Nyasha Gwanzura top scored for Mountaineers with 32 runs off 46 deliveries while Pellagia Mujaji fell for 20 runs from 30 balls faced. In their chase, the Trevor Phiri coached Tuskers side lost the wickets of Chiedza Dhururu for five runs, Tshuma for a three-ball duck, Natasha Mthomba went for two runs and Granger contributed 11 runs. Sharne Mayers was the star with the bat, remaining undefeated on 64 runs which came off 65 deliveries to help guide her team to victory. Sibanda also remained not out on five runs to see the team through. Kudzai Chigora and Audrey Cherengo took two wickets each for Mountaineers. In the other match, log leaders Eagles swept aside Rhinos with a thumping 130 runs win at Goldridge College in Kwekwe. Batting first, Kelis Ndhlovu’s ton helped Eagles finish on 274/7 in 50 overs to give their opponents a mountain to climb. Ndhlovu finished on 109 runs off 102 deliveries while Modester Mupachikwa fell eight runs short of her century on 92 runs from 112 balls. Eagles went on to restrict Rhinos to 144/9 in 50 overs after a Precious Marange master class with the ball. Marange took four wickets for 25 runs in 10 overs and was supported by Ndhlovu, on the other end who finished with figures 2/20 in 10 overs to be awarded Player of the Match. Christabel Chatonzwa and Olinda Chare took one wicket each. All-rounder Josephine Nkomo top scored for Rhinos with an unbeaten 63 runs off 119 deliveries while Ashley Ndiraya fell for a run a ball 13 as the duo finished as the team’s leading run getters. Three teams are tied on 30 points on the standings having played five matches apiece. Eagles are leading the pack, followed by Tuskers and Rhinos while Mountaineers are at the bottom of the log have 10 points after just one win. — @brandon_malvin","pubDate":"2023-03-28 22:04:23","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"‘CRICKET IS NOW NUMBER ONE","link":"https://www.hmetro.co.zw/cricket-is-now-number-one/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"CRICKET is now the number one sporting discipline in Zimbabwe.","content":"H-Metro Blessing Malinganiza CRICKET is now the number one sporting discipline in Zimbabwe. That is the view of ZC managing director Givemore Makoni. “It is now a foregone conclusion that cricket is now the country’s number one supported sport, by the time the usually followed sporting codes wake up from their slumber, we would be unmatched,” he said. “We are expecting this wave to continue and remain permanent leading into the ICC World Cup Qualifiers scheduled for Harare and Bulawayo in Harare.” Zimbabwe Cricket officials could not have been happier at the turn of events as fans turned out in their thousands at Harare Sports Club for the deciding One Day International match against Netherlands. Their union with local sports company, Oracle Sport, in a fan engagement initiative appeared to be a futile exercise when it was started last year in April. But, it is now a success. “We had no doubt that Oracle could deliver on the mandate set on them to make Harare Sports Club a bubbly fantasy and home for every cricket- loving fanatic. “Of course, they did not do it alone, our media department was also running a parallel campaign which was meant to achieve the same result,” Makoni said. Oracle Sport’s task was to fill the grounds during Zimbabwe A versus South Africa A Twenty20 series at Harare Sports Club, a task that appeared insurmountable. In the recently-ended One Day International series, the Dutch took an early lead in the three-match ICC World Cup Super League series with a three-wicket win in the first ODI. Zimbabwe hung by a thread, holding on to a one-run in the second match to set up a pulsating final on Saturday. This was Netherlands’ biggest mistake to let the Chevrons off the hook as a weekend ensured a bumper crowd for the hosts. Oracle Sport, a local sports consultancy company and ZC official fan engagement partner, invaded the high-density areas with a mini vehicle dishing out fliers and pamphlets, inviting fans to come and support the Chevrons. Prior to the series against Netherlands, Oracle had been giving out incentives for the fans to come to the ground via their #OracleSport#PaintHarareSportsClubRed#AllBehindTheChevrons social media campaign. However, for this particular series, they decided to temporarily suspend the giveaways to gauge the game’s popularity. “Since our relationship with ZC started we have been luring corporates to come on board and affiliate themselves with the cricket brand. “We had Exide Batteries giving us batteries to give away to the lucky fans. “We had EatnLick giving us meal vouchers and we saw Seed Co Limited putting their weight behind us through their maize seed donations. “Lately we had Synstead Investments pouring in USD cash being won by lucky fans at the ground,” Oracle Sport marketing manager, Blessing Chikadaga told H-Metro. “We then took a deliberate stance to ‘starve’ off any of the usual product lines we were giving in the past just to see how much cricket is supported in the country without any carrot dangled on the fans and the result was amazing. “The ground was filled to the brim and even when the game ended some were still trying to make their way into the stands which is quite encouraging.”","pubDate":"2023-03-28 22:03:11","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ZC bans two players for recreational drug use","link":"https://www.chronicle.co.zw/zc-bans-two-players-for-recreational-drug-use/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Mehluli Sibanda, Sports Editor ZIMBABWE Cricket have slapped two emerging cricketers with a three-month ban for using a recreational drug in an out-of-competition case. In a statement released yesterday, ZC said the two up-and-coming players were hauled before a disciplinary committee after being reported to the cricket mother body by a concerned citizen. “Zimbabwe Cricket […]","content":"The Chronicle ZIMBABWE Cricket have slapped two emerging cricketers with a three-month ban for using a recreational drug in an out-of-competition case. In a statement released yesterday, ZC said the two up-and-coming players were hauled before a disciplinary committee after being reported to the cricket mother body by a concerned citizen. “Zimbabwe Cricket (ZC) has suspended two emerging players for three months for using a recreational drug in an out-of-competition case. The two players were summoned to appear before a disciplinary hearing after they were reported to ZC by a concerned citizen who caught them red-handed partaking in suspected substance abuse within the premises of a private residential complex. “They admitted to using a social drug on the day in question resulting in each one of them receiving a three-month ban from cricket activities for breaching the ZC Code of Conduct for Players and Team Officials under which they were charged,’’ read part of the ZC statement. It said the two cricketers could have been in deep trouble had they used the drug during a competition as this would have seen them face tough sanctions. “The Disciplinary Committee noted that had they committed the offence in competition, they would have been charged under ZC’s anti-doping rules and attracted stiffer sanctions, including a ban of up to two years. The two players are first-time offenders and ZC has opted to keep their identities confidential in order to give them the best chance of rehabilitation,’’ said the ZC statement. While ZC did not identify the two offending cricketers, investigations by this publication revealed that they are both based in Masvingo and one of them was in the Zimbabwe Under-19 structures a few years ago. The two are said to have been caught smoking marijuana. _29","pubDate":"2023-03-28 22:01:43","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"No rest for Sikandar Raza … Star all-rounder leaves for Indian Premier League","link":"https://www.chronicle.co.zw/no-rest-for-sikandar-raza-star-all-rounder-leaves-for-indian-premier-league/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter THERE is no rest for Zimbabwe’s star all-rounder Sikandar Raza as he has left the country for Asia once again, this time to take part in the biggest franchise cricket competition, the Indian Premier League (IPL), which officially gets underway on Friday. Raza will turn out for the Punjab Kings for […]","content":"The Chronicle THERE is no rest for Zimbabwe’s star all-rounder Sikandar Raza as he has left the country for Asia once again, this time to take part in the biggest franchise cricket competition, the Indian Premier League (IPL), which officially gets underway on Friday. Raza will turn out for the Punjab Kings for the 16th edition of the richest T20 competition in the world. The Chevrons all-rounder was sold for INR 50 lakhs (US$61 000) in the draft last year and joined an elite group of Zimbabwean cricketers to have been bought by an IPL team, the others being Ray Price, Brendan Taylor, Tatenda Taibu. Price and Taibu remain the only Zimbabweans to play in the IPL after Taylor was signed by the Sunrise Hyderabad in 2014 but when he chose to delay his travel to India because of his wedding, he was placed on standby and never got to feature in the tournament. Raza will be looking at helping his new team reach the play-offs for the first time since 2014. His team finished sixth in 2022 with seven and same number of losses from the 14 matches they played. His departure to the biggest franchise league in the world comes after he helped Zimbabwe win a One Day International (ODI) series against Netherlands in Harare last week. Zimbabwe bagged the three-match contest 2-1 with Raza scoring the final runs, with an unbeaten 18 in the decider. The all-rounder also finished with five wickets in the three matches. “It’s IPL time. See you soon Punjab Kings family, inshallah,” Raza posted on his Twitter page with the Punjab Kings saying they can’t wait to see him. Raza’s Punjab Kings will kick off their campaign against Kolkata Knight Riders on Saturday afternoon. The Zimbabwean was picked for the IPL after a brilliant 2022 which saw him break records in the international arena. He was named in the T20 World Cup Team of the Tournament and was also nominated in the Player of the Tournament category. At Punjab Kings, Raza will be joined by Sam Curran, the son of former Zimbabwe international Kevin Curran. The 36-year-old Chevrons star will be no stranger to international franchise leagues having been part of the Lahore Qalandars side that successfully defended the Pakistan Super League (PSL) title to become only the second Zimbabwean to win it after fast bowler Blessing Muzarabani won it with the Andy Flower coached Multan Sultans in 2021. On top of that, Raza played for the Dubai Capitals in the International League T20 and the Rangpur Riders in the Bangladesh Premier League. At the end of last year, Raza turned out for the Biratnagar Super Kings in the Nepal T20 League. Punjab Kings, who have begun preparations for the tournament will be without the services of Johnny Bairstow who has been ruled out due to a leg injury that he suffered in September last year while playing golf. The Shikhar Dhawan captained side will also be without South Africa’s Kagiso Rabada in the opening match who is set to join the team after the completion of the Proteas’ ODI series against Netherlands. The IPL experience will come in handy for Raza and the Chevrons as they look to qualify for the 50 over World Cup that will be hosted in India later in the year. Zimbabwe will have to go through the Qualifiers which they will host in June thus, the exposure to different international players will be a big boost for him and the team as a whole. – @brandon_malvin","pubDate":"2023-03-28 22:01:16","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ZC ban two players for recreational drug use","link":"https://www.hmetro.co.zw/zc-ban-two-players-for-recreational-drug-use/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE Cricket have suspended two emerging players for three months for using a recreational drug in an out-of-competition case.","content":"H-Metro ZIMBABWE Cricket have suspended two emerging players for three months for using a recreational drug in an out-of-competition case. The two players were summoned to appear for a disciplinary hearing after they were reported to ZC by a concerned citizen who caught them red-handed partaking in suspected substance abuse within the premises of a private residential complex. They admitted to using a social drug on the day in question, resulting in each one of them receiving a three-month ban from cricket activities for breaching the ZC Code of Conduct for Players and Team Officials under which they were charged. The Disciplinary Committee noted that had they committed the offence in competition, they would have been charged under ZC’s anti-doping rules and attracted stiffer sanctions, including a ban of up to two years. – zimcricket","pubDate":"2023-03-28 22:01:09","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"IPL 2023 में कब तक होगी श्रेयस अय्यर की वापसी? KKR के कोच ने दिया ये जवाब","link":"https://www.indiatv.in/sports/cricket/kkr-coach-gave-big-statement-on-shreyas-iyer-return-in-ipl-2023-2023-03-28-946357","keywords":null,"creator":null,"video_url":null,"description":"केकेआर के कोच ने आईपीएल 2023 में श्रेयस अय्यर की वापसी पर एक बड़ा बयान दिया है।","content":"आईपीएल 2023 के शुरू होने से पहले ही कोलकाता नाइट राइडर्स की टीम मुश्किल में है। केकेआर के कप्तान श्रेयस अय्यर चोटिल होने के चलते कई मुकाबलों से बाहर हो गए। उनकी जगह नितीश राणा टीम की कमान संभालेंगे। अय्यर अभी तक पूरे आईपीएल से बाहर नहीं हुए हैं। और इस बात का भी अभी नहीं पता है कि ये खिलाड़ी कब तक वापसी कर पाएगा। वहीं अय्यर की वापसी पर अब केकेआर के कोच चंद्रकांत पंडित ने एक बड़ा बयान दिया। चंद्रकांत पंडित ने कहा कि मैंने जो भी थोड़ी-बहुत क्रिकेट खेली या कोचिंग दी है, मैं टीम में अनुपलब्धता जैसी चीजों से कभी पीछे नहीं हटता। श्रेयस की अनुपस्थिति से फर्क पड़ेगा क्योंकि वह महत्वपूर्ण हैं, लेकिन यह वास्तव में दुर्भाग्यपूर्ण है। हम उम्मीद कर रहे हैं कि श्रेयस बहुत जल्द वापस आएंगे और इससे टीम पर बहुत फर्क पड़ेगा। चंद्रकांत ने आगे कहा कि जब हम खिलाड़ियों का चयन करते हैं और खिलाड़ियों को जिम्मेदारी देते हैं, तो हम देखते हैं कि कौन सक्षम है। और नितीश सक्षम हैं। वह लंबे समय से केकेआर के साथ हैं और उनका घरेलू रिकॉर्ड भी मजबूत है। मैं यह जानकर सहज हूं कि वो भूमिका को संभाल सकता है। हम यह नहीं देखते कि कोई योग्य है या नहीं। हर खिलाड़ी के पास अलग-अलग कौशल है और हमें अपने फैसले पर भरोसा है। बता दें कि श्रेयस अय्यर की चोट केकेआर के लिए सिरदर्द बनी हुई थी। बता दें कि नितीश राणा पहली बार आईपीएल में किसी भी टीम के लिए कप्तानी करते हुए नजर आएंगे। मुंबई इंडियंस के लिए कुछ साल शानदार प्रदर्शन करने के बाद नितीश राणा को केकेआर की टीम ने अपने साथ शामिल किया था। उन्होंने केकेआर की टीम के लिए 91 मैचों में 2181 रन बनाए हैं। उनका सर्वश्रेष्ठ स्कोर 87 रन है। आईपीएल 2022 में उन्होंने केकेआर की टीम के लिए 14 मैचों में 361 रन बनाए थे।","pubDate":"2023-03-28 18:07:59","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 के कई मुकाबलों से बाहर हुए रोहित, ये खिलाड़ी करेगा मुंबई की कप्तानी","link":"https://www.indiatv.in/sports/cricket/rohit-sharma-will-be-out-of-starting-matches-of-ipl-2023-suryakumar-yadav-will-be-captain-of-mumbai-indians-2023-03-28-946343","keywords":null,"creator":null,"video_url":null,"description":"मुंबई इंडियंस के कप्तान रोहित शर्मा आईपीएल 2023 के शुरुआती मुकाबलों से बाहर रहेंगे। ऐसे में मुंबई की टीम एक नए कप्तान के अंडर खेलेगी।","content":"आईपीएल के 16वें सीजन को शुरू होने में अब सिर्फ कुछ ही दिनों का समय बाकी है। सभी टीमों ने अपनी तैयारियां शुरू कर दी हैं। वहीं खिलाड़ी अपने-अपने होम ग्राउंड्स में जमकर प्रैक्टिस कर रहे हैं। लेकिन इसी बीच मुंबई इंडियंस के लिए एक चौंकाने वाली खबर सामने आई है। खबर है कि मुंबई के कप्तान रोहित शर्मा इस सीजन के शुरुआती मैचों में नहीं खेल पाएंगे। इंडियंन एक्सप्रेस की एक रिपोर्ट के मुताबिक रोहित शर्मा वर्कलोड मैनेज करने के चलते शुरुआती मैचों से बाहर रहेंगे। आईपीएल फाइनल के बाद टीम इंडिया को एक हफ्ते बाद वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेलना है। वहीं इसके बाद सभी खिलाड़ी घर में होने वाले वर्ल्ड कप की तैयारियों में जुटेगी। रोहित की गैरमौजूदगी में मुंबई इंडियंस की कमान सूर्यकुमार यादव संभालेंगे। सूर्यकुमार लंबे समय से मुंबई इंडियंस टीम का हिस्सा रहे हैं। वहीं रोहित डग आउट से बैठकर ही मैच पर ध्यान देंगे। बता दें कि रोहित अक्सर ज्यादा वर्कलोड होने के चलते पहले चोटिल हो चुके हैं। ऐसे में आईपीएल में वो खुद के शरीर पर ज्यादा लोड नहीं डालना चाहते। सूर्यकुमार यादव ने पिछले एक साल में टी20 क्रिकेट में तूफान मचा दिया है। इस फॉर्मेट में सूर्या दुनिया के नंबर एक बल्लेबाज हैं। आईपीएल में मुंबई इंडियंस के लिए पिछले कई सालों से खेल रहे सूर्या को इस साल आईपीएल में देखना खास रहेगा। वहीं वो आईपीएल 2023 में सबसे ज्यादा छक्के लगाने के बड़े दावेदार हैं। आईपीएल में सूर्या ने आईपीएल में 62 मैच खेले और 59 पारियों में उन्होंने 1575 रन बनाए। सूर्यकुमार का आईपीएल में सर्वोच्च स्कोर 82 रन है। उनके नाम 0 आईपीएल शतक और 10 आईपीएल अर्धशतक हैं।","pubDate":"2023-03-28 17:20:30","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एनुअल कॉन्ट्रैक्ट से बाहर होने पर रहाणे-भुवनेश्वर का करियर खत्म? इंडिया टीवी के पोल में लोगों का ये रहा जवाब","link":"https://www.indiatv.in/sports/cricket/india-tv-pole-on-bhuvneshwar-kumar-and-ajinkya-rahane-career-after-annual-contract-list-2023-03-28-946323","keywords":null,"creator":null,"video_url":null,"description":"एनुअल कॉन्ट्रैक्ट से बाहर होने पर रहाणे-भुवनेश्वर के करियर पर सवाल उठने लगे हैं।","content":"भारतीय क्रिकेट कंट्रोल बोर्ड (बीसीसीआई) ने रविवार को अक्टूबर 2022 से सितंबर 2023 के लिए खिलाड़ियों के एनुअल कॉन्ट्रैक्ट की लिस्ट जारी कर दी। एनुअल कॉन्ट्रैक्ट की किसी भी कैटेगरी में टीम इंडिया के दिग्गज बल्लेबाज अजिंक्य रहाणे और तेज गेंदबाज भुवनेश्वर कुमार का नाम नहीं था। ऐसे में इन दोनों ही खिलाड़ियों का करियर संकट में नजर आ रहा है। वहीं इंडिया टीवी एक सोशल मीडिया सर्वे में भी क्रिकेट फैंस ने इन दोनों खिलाड़ियों के करियर पर अलग-अलग रिएक्शन दिया। अजिंक्य रहाणे और भुवनेश्वर कुमार पर इंडिया टीवी के एक सोशल मीडिया सर्वे में लोगों के अलग-अलग विचार रहे। इंडिया टीवी ने सर्वे में पूछा कि क्या सालाना कॉन्ट्रैक्ट से बाहर होने के बाद रहाणे और भुवनेश्वर कुमार का करियर खत्म हो जाएगा? इसपर 46.5% लोगों ने हां को वोट किया। वहीं 42.5% लोगों ने कहा कि नहीं ऐसा नहीं होगा। इसके अलावा 11 प्रतिशत लोग इस सवाल को लेकर कुछ भी विचार नहीं रख पाए। रहाणे को दक्षिण अफ्रीका दौरे की समाप्ति के बाद टेस्ट टीम से बाहर कर दिया गया था। इस खिलाड़ी को करीब एक साल से टीम में जगह नहीं मिली है। रहाणे, जोकि एक समय टेस्ट फॉर्मेट में भारतीय टीम की कप्तानी कर रहे थे अब उनकी वापसी के सभी रास्ते लगभग बंद हो चुके हैं। रहाणे ने भारत के लिए 82 टेस्ट, 90 वनडे और 20 टी20 मुकाबले खेले हैं। भुवी को भी लंबे समय से किसी भी फॉर्मेट के लिए टीम इंडिया में नहीं चुना जा रहा है। ऐसे में उनके करियर पर भी संकट मंडरा रहा है। भुवी की बात करें तो उन्होंने 21 टेस्ट, 121 वनडे और 87 टी20 मुकाबले भारत के लिए खेले हैं। इस दौरान उन्होंने क्रमश: 63, 141 और 90 विकेट झटके।","pubDate":"2023-03-28 16:19:39","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Stokes heads for IPL after jab in wounded knee","link":"https://thewest.com.au/sport/cricket/stokes-heads-for-ipl-after-jab-in-wounded-knee-c-10184927","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"England captain Ben Stokes has joined his IPL team after an injection in the troublesome knee which restricted his bowling during the tour of New Zealand.","content":"Ben Stokes' injured knee looks set to become as much a part of Ashes folklore as Terry Alderman's shoulder, Glenn McGrath's ankle and Jofra Archer's elbow. England are hoping unlike those injuries Stokes' left knee does not keep him out of any Test matches, but he has joined his Indian Premier League side only after having an injection in it. Stokes is due to play for Chennai Super Kings (CSK), who open the IPL against defending champions Gujarat Titans in Friday. He will not, however, be bowling, said CSK's batting coach Mike Hussey. \"He's ready to go as a batsman from the start, the bowling might be wait and see. I know he had his first very light bowl this week since he had his injections in his knee,\" said the Australian. \"My understanding is he won't be bowling much at all in the first few games of the tournament, or it might be a few weeks. Hopefully we'll get him bowling at some stage in the tournament.\" The all-rounder was visibly troubled by his knee during England's recent series in New Zealand. He bowled only nine of the 345 overs England sent down (40-year-old Jimmy Anderson bowled 43). He was clearly restricted by it when batting in England's final innings having appeared to exacerbate the injury in the field. In an ideal world England would prefer he did not go to the IPL, but CSK paid 1.6 million pounds ($A2.9 million) for his services and Stokes has long said he will honour his commitment (with the proviso he leaves before the finals to prepare for England's first Test of the summer against against Ireland, beginning on 1 June). However if Stokes can't bowl, that affects the balance of the side, England traditionally preferring to go with five bowlers, one being an all-rounder, than four as Australian teams often do. Ironically the emergence of Cam Green means it could be the tourists with the extra bowler this series. And if the injury actually prevents Stokes playing, a real possibility with five Tests in seven weeks, well that's something English cricket would rather not think about. Sign up for our emails","pubDate":"2023-03-28 16:11:57","image_url":"https://images.thewest.com.au/publication/C-10184927/22fc81516ecc05691ff2918025cdc7d48dfdcba7-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka Penalised, Docked One Point For Slow Over Rate","link":"https://www.thetimesofbengal.com/sports/sri-lanka-penalised-docked-one-point-for-slow-over-rate/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports NZ Vs SL, 1st ODI: Sri Lanka Penalised, Docked One Point For Slow Over-Rate The deduction along with a washout in Christchurch during the second ODI means that Sri Lanka now have 81 instead of 82 points.\r Sri Lanka players celebrate after taking a New Zealand wicket in 1st ODI. (Image: Blackcaps/Twitter) Dubai: […]","content":"Dubai: Sri Lanka have been fined 20 per cent of their match fee and docked a point in the ongoing ICC Men’s Cricket World Cup Super League cycle for maintaining a slow over-rate in the first ODI against New Zealand in Auckland. Jeff Crowe of the ICC Elite Panel of Match Referees imposed the sanction after Dasun Shanaka’s side was ruled to be one over short of the target after time allowances were taken into consideration for the game played on Saturday. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time. In addition, as per Article 16.12.2 of the ICC Men’s Cricket World Cup Super League Playing Conditions, a side is penalised one point for each over short. Consequently, Sri Lanka lost one point from their points tally. “Shanaka pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing,” the ICC said in a media release. On-field umpires Shaun Haig and Wayne Knights, third umpire Chris Brown and fourth umpire Cory Black levelled the charge. The top eight sides in the ICC Men’s Cricket World Cup Super League standings qualify directly for the World Cup. Sri Lanka are currently placed in the ninth spot with a game to go. South Africa (78 points) are one below with two to play, and Ireland (68 points) have three fixtures in hand. This deduction along with a washout in Christchurch during the second ODI means that Sri Lanka now have 81 instead of 82 points. With only a solitary fixture in their hand, the Sri Lankans are in danger of missing out on a direct berth to the World Cup. Sri Lanka need to win the third ODI to surpass West Indies and move up to the eighth position in the standings. But even if they win the final ODI against New Zealand to earn an extra 10 Super League points and rise into the eighth spot on the standings, their qualification hopes depend on the performance of South Africa, who are currently in the tenth position with 80 points. Sri Lanka only have one match remaining in the Super League, with their clash against New Zealand in the third and final ODI in Hamilton on Friday their last chance to overtake the West Indies and move into a critical top-eight place to qualify automatically for this year’s tournament. But even if Sri Lanka do win that final ODI against New Zealand to earn an extra 10 Super League points and rise into the eighth spot on the standings, they could still be forced into the Qualifier in Zimbabwe as 10th placed South Africa have enough matches in hand to overtake them. South Africa have two matches left of their postponed ODI series against the Netherlands and wins in both of those contests would see the Proteas jump in front of both Sri Lanka and the West Indies and into the pivotal eighth place. The 11th-placed Ireland could also still qualify automatically, given they have three matches remaining against Bangladesh in May. New Zealand currently sit at the top of the Super League standings with 165 points and also have one match left to play in the series. Source link","pubDate":"2023-03-28 15:57:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"}]}