{"newsArray":[{"title":"Even at 40 Jimmy Anderson remains among the greats but ageing footballers like Cristiano Ronaldo are freaks of nature","link":"https://www.thesun.co.uk/sport/19564203/ronaldo-anderson-sporting-greats-man-utd-karren-brady/","keywords":["Sport","Cricket","Football"],"creator":["Ian Tuckey"],"video_url":null,"description":null,"content":"AT just 40, Jimmy Anderson strides to the wicket with the natural grace that has delighted cricket lovers since he began his international career as a fast bowler. Watch him as he glides into his delivery stride. Not a creak, not a groan — 650-plus wickets into his 19-year Test career and he remains England’s finest exponent. There are a few footballers who last into early middle age but only a very, very few and certainly not at such a sustained level of excellence. Cristiano Ronaldo at 37 is trying and still has that towering leap, if only his team-mates could find it more often. So far, 37 is as long as anyone that’s currently playing in the Premier League has lasted. Chelsea’s Thiago Silva — just over a month shy of his 38th birthday — tops a list of four, with Ronaldo, Lukasz Fabianski and full-back Ashley Young joining him. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS The instant reply as to why ancients like Kent all-rounder Darren Stevens, 46, are still playing cricket successfully, is that this sport demands less physicality of its participants. While cricketers carry on a little longer, it is not necessarily that the game takes less out of them. Just as important is the comparative amount of money they earn, injuries and the intensity of matches and of training. It’s a fair bet Joe Root doesn’t earn a tenth, no, a twentieth, of Ronaldo’s salary. Obviously, Root’s name would only be generally recognised in perhaps 15 countries, while Ronaldo’s would be known in as many as our Queen’s. Ronaldo is a freak of nature in that he mostly stays fit and might well be capable of high-class football at speed for another two or three years. As he slows, his markers might catch up with him and end his career on the spot. Don’t think no one will be trying. Cricket is not an injury-free party game, either. Fast bowlers regularly suffer back, side and hamstring trouble, poorly feet and a quick ball crashing through paper-thin defence into parts that make their eyes water. Blows catch batsmen from above pad level to a rasping clang on helmets. Dementia is as common a problem in ageing cricketers as it is among centre-backs and specialist headers. It’s true to say that, on average, footballers are far fitter than cricketers. Nottinghamshire have two or three players who look as though a pint and a pie go down well — and that’s at breakfast. There are plenty who train hard. In football, all of them do and a pint and a pie on the eve of a match is considered by many managers to be practically a federal offence. Graham Taylor used to ask reporters to act as spies and tell him if they saw a player clubbing on the eve of a match. I doubt that cricket coaches have such importunate shamelessness. Football, though, is a business, as cut-throat as any I know, whereas cricket largely remains competitive fun. One lends itself to a hard and, admittedly, highly desirable career with an end-out of riches and fame; the other gives its exponents the opportunity to do well enough and to mock team-mates for the rest of their lives.","pubDate":"2022-08-19 20:31:46","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ben Stokes praises ‘relentless’ South Africa but refuses to panic after defeat - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2F1Zy8xOS9iZW4tc3Rva2VzLXByYWlzZXMtcmVsZW50bGVzcy1zb3V0aC1hZnJpY2EtYnV0LXJlZnVzZXMtdG8tcGFuaWMtYWZ0ZXItZGVmZWF00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes praises ‘relentless’ South Africa but refuses to panic after defeat  The GuardianNortje Fires SA To Victory | Highlights - England v South Africa Day 3 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardEngland lose first Test against South Africa inside three days as Anrich Nortje stars for Proteas  Sky SportsSouth Africa rout England by innings and 12 runs – as it happened  The GuardianCricket Betting Tips: In-play angles after day two of England v South Africa  Betting.betfairView Full coverage on Google News","content":null,"pubDate":"2022-08-19 20:05:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“Wonder what purpose does this 1000 day stat serve”: Shikha Pandey rubbishes Virat Kohli’s so-called 1000 days since last international century stat","link":"https://thesportsrush.com/cricket-news-wonder-what-purpose-does-this-1000-day-stat-serve-shikha-pandey-rubbishes-virat-kohlis-so-called-1000-days-since-last-international-century-stat/","keywords":["Cricket","Shikha Pandey","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shikha Pandey rubbishes Virat Kohli’s stat mentioning the total number of days since he has hit his last century for India across formats. The last time former India captain Virat Kohli scored an international century was back in November 2019, during the day-night Test match against Bangladesh at the Eden Gardens in Kolkata. As of… The post “Wonder what purpose does this 1000 day stat serve”: Shikha Pandey rubbishes Virat Kohli’s so-called 1000 days since last international century stat appeared first on The SportsRush.","content":"Shikha Pandey rubbishes Virat Kohli’s stat mentioning the total number of days since he has hit his last century for India across formats. The last time former India captain Virat Kohli scored an international century was back in November 2019, during the day-night Test match against Bangladesh at the Eden Gardens in Kolkata. As of today, it has been a total of 1,000 days since the champion batter across formats has not had an international ton beside his name. The gap, is undoubtedly huge for a person who has 70 International centuries under his belt, and for someone who seemed like smashing centuries for fun not many years ago. Such was Kohli’s run-scoring consistency, that fans and experts considered it a matter of a few years, before he would equal, and even surpass the legendary India batter Sachin Tendulkar’s tally of 100 international centuries. However, stating that it has been a thousand days since his last century for team India, is an overstatement and exaggeration of sorts, given that not much of cricketing action took place during 2020 and 2021 due to the spread of the COVID-19 pandemic. Shikha Pandey rubbishes Virat Kohli’s stat Indian women team’s bowling all-rounder Shikha Pandey seemed to rubbish the aforementioned so-called stat of Kohli’s 1000-day drought of international centuries. Pandey went on to state that she is a fan of stats and numbers involved in the sport, but seemed to scratch her head while contemplating the purpose that the stat served, with the hashtag ‘DoesItEvenQualifyAsOne’. Huge fan of stats and everything but wonder what purpose does this 1000 day stat serve? #DoesItEvenQualifyAsOne — Shikha Pandey (@shikhashauny) August 19, 2022 Even notable, verified accounts on the micro-blogging site Twitter, including journalists as well, made sure to not let their followers bereft of this ‘very crucial piece of stat’, which perhaps has no significance at all. Over 80 million seconds, 1.4 million minutes, 24000 hours and 1000 days since Virat Kohli’s last century. — Mazher Arshad (@MazherArshad) August 19, 2022 It is now 1000 days since Virat Kohli last scored an international century pic.twitter.com/phQiHr7EQv — ESPNcricinfo (@ESPNcricinfo) August 19, 2022 HE’S DONE IT! Today marks 1,000 days since Virat Kohli’s most recent century in international cricket. — Nic Savage (@nic_savage1) August 19, 2022 Congratulations to Virat Kohli on 1000 consecutive days without a century in any form of international cricket. #Celebration #BringOnZimbabwe #WhyIsHeStillInTheTeam pic.twitter.com/e1XQuWno5L — Imported Dennis (@DennisCricket_) August 19, 2022 In fact, Kohli has played 81 innings (23 in ODIs, 26 in T20Is, and 32 in Tests) since his last ton in November 2019. To be fair, his mere six half-centuries across 32 Test innings is the only concerning number as of today. Across the 49 innings in ODIs and T20Is combined since his last century, he has 18 half-centuries under his belt, which is not right up there in terms of the yardstick he has set for himself, but certainly not below average as well, so much so to deserve to be trolled in the manner he has been off-late. The post “Wonder what purpose does this 1000 day stat serve”: Shikha Pandey rubbishes Virat Kohli’s so-called 1000 days since last international century stat appeared first on The SportsRush.","pubDate":"2022-08-19 18:54:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ranji winning coach Chandrakant Pandit ready for IPL challenge after Ranji win: It’s cricket at the end of the day","link":"https://www.indiatoday.in/sports/cricket/story/ranji-winning-coach-chandrakant-pandit-ready-for-ipl-challenge-after-ranji-win-it-s-cricket-at-the-end-of-the-day-1990212-2022-08-19?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ranji winning coach Chandrakant Pandit ready for IPL challenge after Ranji win","content":null,"pubDate":"2022-08-19 18:19:07","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Sorry England slump to innings defeat inside three days against South Africa - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMibGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2F1Zy8xOS9lbmdsYW5kLXNvdXRoLWFmcmljYS1maXJzdC10ZXN0LWRheS10aHJlZS1tYXRjaC1yZXBvcnQtY3JpY2tldNIBbGh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2F1Zy8xOS9lbmdsYW5kLXNvdXRoLWFmcmljYS1maXJzdC10ZXN0LWRheS10aHJlZS1tYXRjaC1yZXBvcnQtY3JpY2tldA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sorry England slump to innings defeat inside three days against South Africa  The GuardianNortje Fires SA To Victory | Highlights - England v South Africa Day 3 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardEngland lose first Test against South Africa inside three days as Anrich Nortje stars for Proteas  Sky SportsSouth Africa rout England by innings and 12 runs – as it happened  The GuardianThis was a grim reality check for the Ben Stokes revolution  The TelegraphView Full coverage on Google News","content":null,"pubDate":"2022-08-19 18:06:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Live cricket updates: Black Caps v West Indies, second ODI","link":"https://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=12546314&ref=rss","keywords":null,"creator":null,"video_url":null,"description":"All the action from the second ODI between the Black Caps and West Indies in Barbados. ‌","content":null,"pubDate":"2022-08-19 18:00:00","image_url":null,"source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Ben Stokes suffers first defeat since becoming England captain as his side are walloped by South Africa in First Test","link":"https://www.thesun.co.uk/sport/cricket/19563246/england-lose-to-south-africa-first-test-stokes/","keywords":["Cricket"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"BEN STOKES suffered a crushing defeat – his first since becoming England captain – but insisted: “I’m not going to throw the toys out the pram.” There is not the remotest suggestion, either, that England under Stokes and head coach Brendon McCullum are having second thoughts about their ultra-attacking style. AFPSouth Africa celebrate a huge win after England’s James Anderson was bowled by Marco Jansen on day three at Lord’s[/caption] APEngland skipper Ben Stokes shows his frustration as England were out for 20 in slumping to 149 all out and an innings defeat[/caption] Bazball is here to stay all the time they are running this England team. If anything, Stokes reckoned his players were not aggressive enough in the First Test at Lord’s. That’s saying something after his team were destroyed by an innings and 12 runs in a total of just 171.5 overs – less than two days’ of playing time. Stokes explained: “The message from me and Baz will be…did we commit to everything in the way we committed to the first four Tests of the summer? “If everyone can say, yes, 100 per cent, and we just didn’t execute, then things are good. We’ll move on to the next Test match. READ MORE IN SPORT RED DEVILS LATEST Casemiro deal CONFIRMED, Ronaldo wants Dortmund move, Antony £68m bid KO OFFER Get Anthony Joshua at 40/1 OR Oleksandr Usyk at 25/1 to win with William Hill FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS “Whatever we threw at South Africa, whether batting or bowling, they seemed to counteract. You must give them a lot of credit. “It was an off game for us and that’s absolutely fine. It’s not something I’m going to be throwing our toys out of the pram over. “I like to ride a wave of whatever comes, whether it be success or failure. We have two Tests left. If we hold on to this for too long and carry baggage into the next game, we’re already one step behind South Africa. I want us to be a team that’s one step ahead.” This is undoubtedly shuddering blow to the momentum gained in the first half of the Test summer with four straight wins over New Zealand and India. Most read in Cricket MOR WOE Morgan flies 5,500 miles for nothing as SA ease to First Test win on Day Three STU BEAUTY Watch Stuart Broad take outrageous diving catch leaving England fans stunned STOKING THE FIRE Captain Stokes’ ferocious bowling gives England hope after batting tumble RED FOR RUTH Who was Ruth Strauss and how long was she married to England cricketer Andrew? STRAUSS TRIBUTE Why are England players wearing red caps? ROOTING FOR YA Who is England cricket star Joe Root's wife Carrie? And the way they crumbled in both innings was alarming – no matter how powerful the Proteas’ pace attack. But it would be wrong to describe it as a Bazball balls-up. The plain fact is that England were beaten by a better team and would have lost no matter what tactics they employed. Sure, there were a couple of poor shots – Alex Lees in the first innings and Zak Crawley in the second, for example – that might have been prompted by the desire to be aggressive but generally England’s batsmen were dismissed by top-class bowling. Anrich Nortje bowled a string of thunderbolts and had Jonny Bairstow, Alex Lees and Ben Foakes caught behind in the space of ten balls without conceding a run. They were got out legitimately with speed and skill and, in the case of Foakes, exploiting a wariness against the hard ball steaming towards him. It was clear that England’s early-summer wins were built on Bairstow’s five freakish innings and the brilliance of Joe Root. Well, they scored just 32 runs between them here and no other England batsman was able to fill the void although Ollie Pope’s 73 in the first innings was the joint top score in the match. England began their second innings with a deficit of 161 runs and Proteas skipper Dean Elgar produced a masterstroke by introducing left-arm spinner Keshav Maharaj for the eighth over – and he prompted removed both Crawley and Pope. We have a little work to do, but you don’t go from being a good team to a bad one overnight. We won’t overreact. Brendon McCullum Crawley was lbw attempting to sweep Maharaj’s third ball but he seems certain to keep his place at the top of the order for next week’s Second Test at Old Trafford despite a total collapse in his form and confidence. Part of the Bazball philosophy is to back players to the hilt, perhaps beyond all reason and logic. Root was caught in the slips when he prodded towards the ball with hard hands. Normally, Root’s more gentle touch would have allowed the ball to bounce before reaching the fielder. Stuart Broad had some fun with 35 from 29 balls and he’d earlier held a spectacular, leaping one-handed catch at mid-on from the third delivery of the day. Stokes could not produce another single-handed miracle and perished to a catch on the mid-wicket boundary. McCullum insisted: “We have a little work to do, but you don’t go from being a good team to a bad one overnight. We won’t overreact. “As we said at the outset, you have to buckle up for the ride. We’ll come back stronger. Both Stokesy and I are firm about how we want this team to play and the direction we think we can take it. We just have to polish up a few of those areas. “The conditions didn’t allow us to play with the same freedom but you’ve got to adapt and try to absorb pressure. We didn’t absorb the pressure as well as we wanted.” The warped schedule did not help, either, and meant South Africa were probably better-prepared than England. Broad and Jimmy Anderson entered the match not having bowled a competitive ball since July 4. Elgar added: “I didn’t wake up this morning thinking I’d be doing a press conference before five o’clock, that’s for sure. I’ll make sure we don’t go into a comfort zone because I know where complacency can get you in international sport.”","pubDate":"2022-08-19 17:59:12","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-Captain Elgar tips his young South Africa as potential test power","link":"https://www.thestar.com.my/sport/cricket/2022/08/20/cricket-captain-elgar-tips-his-young-south-africa-as-potential-test-power","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Captain Dean Elgar said he always believed his young South African side could become a formidable team after they beat England by an innings and 12 runs within three days in the first test at Lord’s on Friday. Read full story","content":null,"pubDate":"2022-08-19 17:50:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/20/1704638.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Hales, Hasaranga Among Desert Vipers' Overseas Signings For ILT20","link":"https://sports.ndtv.com/cricket/alex-hales-wanindu-hasaranga-among-overseas-players-signed-by-desert-vipers-for-inaugural-ilt20-3269812","keywords":null,"creator":null,"video_url":null,"description":"Alex Hales, Sam Billings, Sheldon Cottrell and Wanindu Hasaranga were among overseas signees revealed by Desert Vipers for the inaugural edition of UAE Cricket's International League T20","content":"England batter Alex Hales , wicketkeeper-batter Sam Billings , West Indies bowler Sheldon Cottrell and Sri Lankan all-rounder Wanindu Hasaranga were among overseas signees revealed by Desert Vipers for the inaugural edition of United Arab Emirates (UAE) Cricket's International League T20 on Friday. England all-rounder Tom Curran , batter Ben Duckett have also signed with the team. The franchise has appointed former Australian all-rounder Tom Moody and former England wicket-keeper batter James Foster as their Director of Cricket and head coach respectively. \"I am honoured to lead the Cricket Operations of Desert Vipers in what promises to be an entertaining and high-quality tournament. We have assembled an excellent mix of youth and experience in a highly skilled squad and I warmly welcome our players from all over the world in what is truly an international event,\" said Tom Moody in a statement. Also, head coach James Foster said in a statement, \"Working with such a quality group of players is hugely exciting and I cannot wait to get started with Desert Vipers. This tournament will contain a lot of competitive and entertaining cricket and I look forward to our squad playing a full role in that.\" On Friday, Lancer Capital unveiled its ILT20 League franchise named 'Desert Vipers'. \"Desert Vipers, owned by Lancer Capital, are proud and excited to be part of @ILT20Official,\" tweeted Desert Vipers. In July, the Emirates Cricket Board confirmed that the inaugural International League T20 (ILT20) League will be played between window of January 6 to February 12, 2023. Promoted The six-team franchise-style league will be played over a 34-match schedule at world-renowned, world-class venues in UAE. The first event is scheduled to be played between the window of January 6 and February 12, 2023. The tournament will also provide a valuable platform for Emirates Cricket to take developing their local talent to a higher level, where UAE-based players currently integrated with the board's programme, as well as those identified by the high-performance coaching and selection committee teams, will be given the opportunity to train and play alongside some of the world's best minds of today's game.","pubDate":"2022-08-19 17:23:45","image_url":"https://c.ndtvimg.com/2022-02/5e6etj1g_wanindu-hasaranga-afp_625x300_23_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Kapil Dev ने लगातार बढ़ रहे फ्रेंचाइजी क्रिकेट पर जताई चिंता, बोले- इस तरह इंटरनेशनल क्रिकेट सिर्फ वर्ल्ड कप तक सिमट जाएगा","link":"https://www.abplive.com/sports/cricket/on-the-growing-popularity-of-franchise-cricket-kapil-dev-said-that-in-such-a-situation-international-cricket-will-be-limited-to-the-world-cup-only-2196073","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Kapil Dev On Franchise Cricket: भारत समेत दुनिया भर में फ्रेंचाइजी क्रिकेट की लोकप्रियता लगातार बढ़ रही है, लेकिन इस बीच पूर्व भारतीय कप्तान कपिल देव ने बड़ा बयान दिया है. उन्होंने कहा कि अगर सभी देश फ्रेंचाइजी टी20 लीग खेलेंगे तो इंटरनेशनल क्रिकेट वर्ल्ड कप तक सिमट कर रह जाएगा. दरअसल, भारत में आईपीएल की लोकप्रियता के बाद दुनिया के अलग-अलग हिस्सों फ्रेंचाइजी टी20 लीग का आयोजन किया जा रहा है. वहीं, फ्रेंचाइजी टी20 लीग की बढ़ती लोकप्रियता पर कई क्रिकेट विशेषज्ञ अपनी चिंता जाहिर कर चुके हैं. 'क्रिकेट ठीक उसी तरह चल रहा है जैसे यूरोप में फुटबॉल' कपिल देव ने टेस्ट क्रिकेट के भविष्य पर भी बड़ा बयान दिया. उन्होंने कहा कि मेरे मुताबिक, अब टेस्ट क्रिकेट समाप्त हो रहा है. उन्होंने कहा कि आईसीसी के ऊपर एक बड़ी जिम्मेदारी है कि टेस्ट क्रिकेट को कैसे बचाया जाए. कपिल देव के मुताबिक, क्रिकेट ठीक उसी तरह चल रहा है जैसे यूरोप में फुटबॉल. यूरोप में देश चार साल में एक बार विश्व कप के अलावा एक दूसरे के खिलाफ नहीं खेलते. कपिल ने कहा कि अब यह आईसीसी पर निर्भर करता है कि वह वनडे क्रिकेट और टेस्ट क्रिकेट को बचाकर रखने के लिए क्या कदम उठाता है. 'आईपीएल और बिग बैश तक ठीक है, लेकिन...' गौरतलब है कि पिछले दिनों संयुक्त अरब अमीरात (यूएई) और दक्षिण अफ्रीका ने भी हाल ही में अपनी-अपनी फ्रेंचाइजी टी20 लीग का ऐलान किया है. ऐसा माना जा रहा है कि यह लीग जनवरी-फरवरी 2023 में आयोजित हो सकती है. कपिल देव ने कहा कि थोड़ा-बहुत क्लब क्रिकेट ठीक है, आईपीएल और बिग बैश तक ठीक है, लेकिन अब साउथ अफ्रीकी लीग और यूएई लीग भी अब शुरू हो रही है. ऐसे में अगर सभी देश क्लब क्रिकेट खेलेंगे, तो इंटरनेशनल क्रिकेट महज वर्ल्ड कप तक सिमट कर रह जाएगा. ये भी पढ़ें- IND vs PAK: कमेंट्री बॉक्स में भी होगी भारत-पाक की जंग, एशिया कप में यह दिग्गज संभालेंगे हिंदी और इंग्लिश कमेंटेटर्स की जिम्मेदारी Mumbai Half Marathon 2022: मुंबई हाफ मैराथन को हरी झंडी दिखाकर रवाना करेंगे सचिन तेंदुलकर, पढ़ें फुल डिटेल्स","content":null,"pubDate":"2022-08-19 17:23:20","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Moeen Ali, Malan Among Players Named in Sharjah Warriors Squad For ILT20","link":"https://sports.ndtv.com/cricket/moeen-ali-dawid-malan-among-players-named-in-sharjah-warriors-squad-for-ilt20-3269798","keywords":null,"creator":null,"video_url":null,"description":"Sharjah Warriors on Friday revealed the squad for the inaugural edition of United Arab Emirates (UAE) Cricket's International League T20","content":"Sharjah Warriors on Friday revealed the squad for the inaugural edition of United Arab Emirates (UAE) Cricket's International League T20. \"Presenting our Warriors for the @ilt20official Super excited for the upcoming season!!,\" tweeted Sharjah Warriors. England stars Moeen Ali , Dawid Malan , West Indies batter Evin Lewis and Afghanistan all-rounder Mohammed Nabi are some of the prominent players signed by the team. On Thursday, Capri Global announced their ILT20 team's name as 'Sharjah Warriors'. \"Capri Global is excited to announce the team Sharjah Warriors for @ILT20Official,\" tweeted Sharjah Warriors. In July, the Emirates Cricket Board confirmed that the inaugural International League T20 (ILT20) League will be played between window of January 6 to February 12, 2023. The six-team franchise-style league will be played over a 34-match schedule at world-renowned, world-class venues in UAE. The first event is scheduled to be played between the window of January 6 and February 12, 2023. Promoted The tournament will also provide a valuable platform for Emirates Cricket to take developing their local talent to a higher level, where UAE-based players currently integrated with the board's programme, as well as those identified by the high-performance coaching and selection committee teams, will be given the opportunity to train and play alongside some of the world's best minds of today's game. Sharjah Warriors squad for ILT20: Moeen Ali (Eng), Dawid Malan (Eng), Evin Lewis (WI), Mohammad Nabi (Afg), Chris Woakes (Eng), Noor Ahmad (Afg), Rahmanullah Gurbaz (Afg), Naveen-ul-Haq (Afg), Tom Kohler-Cadmore (Eng, uncapped), Chris Benjamin (Eng uncapped), Danny Briggs (Eng), Mark Deyal (WI, uncapped), Bilal Khan (Oman), JJ Smit (Namibia).","pubDate":"2022-08-19 17:19:29","image_url":"https://c.ndtvimg.com/2021-11/8vao3q88_moeen-ali-afp_625x300_28_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“This is not a wake-up call or anything”: Ben Stokes remains unperturbed despite England’s innings defeat versus South Africa at Lord’s on Day 3","link":"https://thesportsrush.com/cricket-news-this-is-not-a-wake-up-call-or-anything-ben-stokes-remains-unperturbed-despite-englands-innings-defeat-versus-south-africa-at-lords-on-day-3/","keywords":["Cricket","Ben Stokes","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ben Stokes remains unperturbed despite registering his first defeat since becoming England’s Test captain in April this year. During the first Test match of South Africa’s ongoing tour of England at the Lord’s Cricket Ground, South Africa have blown the hosts away by registering a thumping victory by an innings and 12 runs, to go… The post “This is not a wake-up call or anything”: Ben Stokes remains unperturbed despite England’s innings defeat versus South Africa at Lord’s on Day 3 appeared first on The SportsRush.","content":"Ben Stokes remains unperturbed despite registering his first defeat since becoming England’s Test captain in April this year. During the first Test match of South Africa’s ongoing tour of England at the Lord’s Cricket Ground, South Africa have blown the hosts away by registering a thumping victory by an innings and 12 runs, to go 1-0 up in the three-Test series, in a contest which lasted just over six sessions. The Proteas pace bowling trio of Kagiso Rabada, Marco Jansen, and Lungi Ngidi were the architects-in-chief for the visitors’ victory today, as they picked up 18 of the 20 England wickets across the two innings. With today’s victory, South Africa continue to march on with their exceptional Test result numbers at Lord’s, having lost just one of the previous seven Tests at this venue since the year 1992. As for England, this is their first defeat by an innings at the iconic venue in 19 years, and their first in the much talked about ‘Bazball’ era, under the captain-coach duo of Ben Stokes and Brendon McCullum. SA lose to England Lions by an innings and 56 runs SA beat England by an innings and 12 runs Big guns back with the ball, and SA smash BazBall, true to Dean Elgar’s words.#ENGvSA — Rohit Sankar (@imRohit_SN) August 19, 2022 ALSO READ: Michael Vaughan predicts England’s loss even before their second innings Ben Stokes remains unperturbed despite the loss The ‘Bazball’ approach, which had helped Stokes and his men register record-breaking victories during each of their previous four Tests while chasing, came under fire post today’s crushing loss, after the same hasn’t yet received unanimous reception from the fans, experts and some strong proponents of Test match Cricket. However, skipper Ben Stokes, claimed being not so much affected by today’s loss, which also happens be his first since taking up captainship duties of the England Test side. Although, despite ruling out the defeat as a ‘wake-up call’, he did admit that his side could not execute the plans well. “Captains before have also been criticized for the way the teams have played. This is not a wake-up call or anything, but we haven’t executed our plans well. South Africa have played better,” remarked Stokes during the post-match presentation. The post “This is not a wake-up call or anything”: Ben Stokes remains unperturbed despite England’s innings defeat versus South Africa at Lord’s on Day 3 appeared first on The SportsRush.","pubDate":"2022-08-19 17:03:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“We will enjoy tonight, it is Friday after all”: Dean Elgar keen to celebrate Test victory at Lord’s with teammates","link":"https://thesportsrush.com/cricket-news-we-will-enjoy-tonight-it-is-friday-after-all-dean-elgar-keen-to-celebrate-test-victory-at-lords-with-teammates/","keywords":["Cricket","Dean Elgar","England","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Dean Elgar keen to celebrate Test victory: The South African captain emphasized on celebrating a clinical victory at a historic venue. South Africa captain Dean Elgar has admitted that he wasn’t expecting the first Test match against England at Lord’s to come to an end on the third day itself. Resuming from their overnight score… The post “We will enjoy tonight, it is Friday after all”: Dean Elgar keen to celebrate Test victory at Lord’s with teammates appeared first on The SportsRush.","content":"Dean Elgar keen to celebrate Test victory: The South African captain emphasized on celebrating a clinical victory at a historic venue. South Africa captain Dean Elgar has admitted that he wasn’t expecting the first Test match against England at Lord’s to come to an end on the third day itself. Resuming from their overnight score of 289/7, South Africa added crucial 37 runs to their total before being bowled out with a 161-run first innings lead. Expecting England to “bat hard” in the second innings, Elgar expressed gratitude as his “young side” put an end to England’s unbeaten Test streak this summer in the first attempt. “Didn’t think [Day 3 finish], especially waking up this morning. We thought they’d bat hard and get a big lead. When it was our turn to bowl, we had to put the ball in the right areas. The guys did a great job. Very grateful with a young side,” Elgar told Sky Sports during the post-match presentation ceremony. In what is South Africa’s sixth Test victory in 2022, it is the most by any team this year. Having won a combined of four Tests at home and two overseas against four different oppositions this year, South Africa are promising a lot with these bunch of players. Also their sixth Test victory at Lord’s, South Africa have become only the second visiting team after Australia to win six (or more) Tests at this venue. Having won their eighth Test in England since the start of 2000, South Africa are the only visiting team with a positive win-loss ratio (1.333) in this country in this century. The winning moment 👏 #LoveLords | #ENGvSA pic.twitter.com/nXeRJPaj7O — Lord’s Cricket Ground (@HomeOfCricket) August 19, 2022 In no mood of leaving the venue at the scheduled time, a jubilant Elgar emphasized on celebrating an innings victory on a “Friday night”. “We will enjoy tonight, I’m sure, it is Friday after all [laughs]. We gonna take the next few days and take it all in and enjoy this experience. I’m sure we’re not gonna rush off anytime soon. Being at Lord’s, it’s a great experience. Let the young guys enjoy the moment.” Elgar, 35, credited opening partner Sarel Erwee, spinner Keshav Maharaj and fast bowler Anrich Nortje for standing tall on their potential on Day 2 and 3. While Erwee was the best South African batter on the back of a gritty half-century yesterday, Maharaj drew first blood in the second innings by dismissing a couple of top-order batters right before the lunch break. Nortje, on the other hand, created havoc post lunch picking three middle-order wickets within 10 balls to provide first signs of a South African victory today.","pubDate":"2022-08-19 16:54:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Viral Video: बाबर आज़म की अंग्रेजी सुन फैंस को याद आए सरफराज अहमद, जमकर वायरल हो रहा वीडियो","link":"https://www.abplive.com/sports/cricket/fans-compare-to-babar-azam-s-english-from-sarfaraz-ahmed-on-social-media-video-goes-viral-2196052","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Babar Azam Viral Video: पाकिस्तान क्रिकेट टीम (Pakistan Cricket Team) के कप्तान बाबर आजम (Babar Azam) का एक वीडियो सोशल मीडिया (Social Media) पर खूब वायरल हो रहा है. दरअसल, इस वीडियो में पाकिस्तानी कप्तान मैच के बाद प्रेजेंटर से अंग्रेजी में बात कर रहे हैं. सोशल मीडिया पर फैंस बाबर आजम की अंग्रेजी की तुलना पूर्व पाक कप्तान सरफराज अहमद (Sarfaraz Ahmed) से कर रहे हैं. सोशल मीडिया यूजर्स इस वीडियो को जमकर शेयर कर रहे हैं. फिलहाल नीदरलैंड के दौरे पर है पाकिस्तानी टीम गौरतलब है कि फिलहाल पाकिस्तानी क्रिकेट टीम नीदरलैंड के दौरे पर है. इस दौरे पर पाकिस्तानी टीम मेजबान नीदरलैंड के साथ 3 वनडे मैचों की सीरीज खेलेगी. पाकिस्तान 2 मैचों के बाद सीरीज में 2-0 से आगे है. वहीं, इस सीरीज का आखिरी मैच खेला जाना बाकी है. पाकिस्तान ने पहले वनडे मैच में नीदरलैंड को 16 रनों से हराया, जबकि दूसरे वनडे में मेहमान टीम ने 7 विकेट से जीत दर्ज की. वहीं, इस सीरीज का आखिरी वनडे मैच 21 अगस्त को खेला जाएगा. Even Sarfaraz used to speak better english than Babar Azam😂 pic.twitter.com/mvK4S701J3 — Vaibhav Ingale (@itzvri45) August 18, 2022 लिमिटेड ओवर में सुरहिट रहे हैं बाबर पाकिस्तान क्रिकेट टीम के कप्तान बाबर आजम के करियर की बात करें तो अब तक इस खिलाड़ी का प्रदर्शन काबिलेतारीफ रहा है. खासकर, लिमिडेट ओवर क्रिकेट में इस खिलाड़ी ने खासा प्रभावित किया है. बाबर आजम 91 वनडे मैचों में अब तक 59.39 के औसत से 4573 रन बना चुके हैं. वनडे में बाबर आजम अब तक 17 बार सौ का आंकड़ा पार कर चुके हैं. इसके अलावा बाबर अब तक 42 टेस्ट मैचों में 47.3 के औसत से 3122 रन बना चुके हैं. जबकि टी20 फॉर्मेट में बाबर आजम ने 74 मैचों में 45.53 के औसत से 2686 रन बनाए हैं. ये भी पढ़ें- विराट कोहली के बल्ले से शतक निकले हो गए 1000 दिन, पूर्व कप्तान के नाम हुआ शर्मनाक रिकॉर्ड; बार्मी आर्मी ने किया ट्रोल Asia Cup 2022: एशिया कप में हिस्सा नहीं लेगा श्रीलंका? अब तक नहीं किया टीम का एलान; 27 अगस्त से शुरू होगा टूर्नामेंट","content":null,"pubDate":"2022-08-19 16:35:43","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket - England will not abandon &#039;Bazball&#039; despite heavy defeat","link":"https://www.thestar.com.my/sport/cricket/2022/08/20/cricket---england-will-not-abandon-039bazball039-despite-heavy-defeat","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Captain Ben Stokes and coach Brendon McCullum promised to persist with England’s new attacking approach to test cricket despite being handed a heavy innings defeat on Friday in the first test against South Africa. Read full story","content":"LONDON (Reuters) - Captain Ben Stokes and coach Brendon McCullum promised to persist with England’s new attacking approach to test cricket despite being handed a heavy innings defeat on Friday in the first test against South Africa. The new England skipper and coach have adopted an attacking approach to the test arena, dubbed \"Bazball\", and have chased down impressive targets to win tests against New Zealand and India in the last two months with a swashbuckling batting style and aggressive bowling spells. But they were emphatically thumped by an innings and 12 runs at Lord's in the first of a three test-series, as South Africa’s bowlers ruled supreme, restricting England to 165 in their first innings and then dismissing them for 149 on Friday. Stokes, however, said there would be no change when the second test starts at Old Trafford next Thursday. \"Absolutely not. You know, I look at captains before me and they were always going to get criticised at times about the way that they wanted to play, and that's just part and parcel of the job. \"We know well that when we perform to the capabilities that we're capable of, then we can go out and put on an incredible performance, like everybody's seen in the four games before. \"This is absolutely not a wakeup call or anything like that. It was just unfortunate we're unable to execute in the way that we want to play this week,\" said Stokes. McCullum echoed the captain, rejecting the suggestion that the England batsmen might have been too cavalier against a strong bowling line-up. \"I don't think so. I think they were perhaps a touch timid. We approach the game with a clear mentality about the way we want to play and we want to be the best versions of ourself. It's not always going to work,\" he said. \"As we said at the time, you've got to buckle up for the ride. It's not nice at times like this but we'll come back strong,\" insisted the former New Zealand batsman. \"I think we weren't quite able to attack when the opportunity presented itself. Then we got a couple of balls that got rid of a couple of our best players. That's cricket. If you have a winner, you're going to have a loser, and South Africa deserved to win.\" (Writing by Mark Gleeson in Cape Town; Editing by Hugh Lawson)","pubDate":"2022-08-19 16:18:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/20/1704601.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“Bazball doesn’t work against world class bowling attack”: Mohammad Kaif questions Bazball tactics as England lose Lord’s Test vs South Africa","link":"https://thesportsrush.com/cricket-news-bazball-doesnt-work-against-world-class-bowling-attack-mohammad-kaif-questions-bazball-tactics-as-england-lose-lords-test-vs-south-africa/","keywords":["Cricket","Bazball","England","mohammad kaif","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Mohammad Kaif questions Bazball tactics: The former Indian batter queried around the sustainability of Bazball. South Africa have continued their domination in Test cricket by winning sixth out of their seventh Test match this year in spite of a comparatively inexperienced team. Most Test wins in 2022 despite two other teams playing more matches than… The post “Bazball doesn’t work against world class bowling attack”: Mohammad Kaif questions Bazball tactics as England lose Lord’s Test vs South Africa appeared first on The SportsRush.","content":"Mohammad Kaif questions Bazball tactics: The former Indian batter queried around the sustainability of Bazball. South Africa have continued their domination in Test cricket by winning sixth out of their seventh Test match this year in spite of a comparatively inexperienced team. Most Test wins in 2022 despite two other teams playing more matches than them speak highly about South Africa’s current form in cricket’s ancestral format. Readers must note that their victories in 2022 have come across four oppositions and three continents. The latest one has come in the first Test match against England at Lord’s after a comprehensive bowling performance propelled them to win by an innings and 12 runs on the third day itself. Trailing by 161 runs in the first innings, England registered their second batting collapse of the match on the back of getting bowled out for 149 in 37.4 overs in the second innings. A contrasting result to what had otherwise been a remarkable Test summer under new head coach Brendon McCullum and new captain Ben Stokes has made former India batter Mohammad Kaif join his former teammate Wasim Jaffer is commenting regarding Bazball . While Jaffer had just taken a dig at the concept, Kaif has questioned its sustainability against world-class bowling attacks and captains who set “smart fields”. South Africa shows that Bazball doesn’t work against world class bowling attack with variety and a sharp captain who sets smart fields. #SAvsENG — Mohammad Kaif (@MohammadKaif) August 19, 2022 In all honesty, criticizing Bazball after just one defeat is slightly unfair primarily because of the limited sample size. As a matter of fact, England winning three and losing one Test under McCullum calls for an impressive record especially after taking into consideration their Test record of the last two years or so. With England defeating New Zealand and India earlier this summer, led by Kane Williamson and Jasprit Bumrah respectively, Bazball’s failures according to Kaif can’t be given an assurance at this point in time.","pubDate":"2022-08-19 16:03:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Told you all”: Michael Vaughan gets prediction bang on as South Africa defeat England by an innings in the Lord’s Test","link":"https://thesportsrush.com/cricket-news-told-you-all-michael-vaughan-gets-prediction-bang-on-as-south-africa-defeat-england-by-an-innings-in-the-lords-test/","keywords":["Cricket","Lord's Cricket Ground","Michael vaughan","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Michael Vaughan gets prediction bang on as South African pace battery’s exceptional performance hand them a one-sided victory at Lord’s. During the first Test match of South Africa’s ongoing tour of England at the Lord’s Cricket Ground, the hosts have been decimated in just over six sessions by an innings and 12 runs, to trail… The post “Told you all”: Michael Vaughan gets prediction bang on as South Africa defeat England by an innings in the Lord’s Test appeared first on The SportsRush.","content":"Michael Vaughan gets prediction bang on as South African pace battery’s exceptional performance hand them a one-sided victory at Lord’s. During the first Test match of South Africa’s ongoing tour of England at the Lord’s Cricket Ground, the hosts have been decimated in just over six sessions by an innings and 12 runs, to trail 0-1 in the three-Test series. After an ordinary batting performance during the first innings which saw them post mere 165 on the board, their second innings, the performances in which have been their highlight in the ‘ Bazball’ era was even worse, as they bundled up for mere 149 while managing to survive mere 37.4 Overs. Apart from Ollie Pope’s 73 runs in the first innings, none of Stokes’ men could surpass the half-century mark even once, as the Proteas pace trio of Kagiso Rabada, Lungi Ngidi, and Marco Jansen scalped 18 of the 20 English wickets, to earn their skipper Dean Elgar some bragging rights after all the match build-up ahead of ‘Day 1’. With today’s victory, South Africa continue to march on with their exceptional Test result numbers at Lord’s, having lost just one of the previous seven Tests at this venue since the year 1992. Post South Africa’s first innings, during which they posted 326 runs on the board, and thereby taking a 161-run lead, former England skipper Michael Vaughan, perhaps realizing the potency of the South African pace trio, and watching the manner in which they were all over England during the first innings, had predicted South Africa’s victory on the third day itself. Early shout .. Test could finish today .. — Michael Vaughan (@MichaelVaughan) August 19, 2022 Earlier, Vaughan was also impressed with the ‘effortless’ display of pace bowling from Kagiso Rabada, who returned with a five-wicket haul in the first innings. Post England’s hapless batting during the second innings as well, with the Proteas pacers scalping eight of their wickets this time around, Vaughan made sure he took to his Twitter handle yet again, to remind his followers how bang on he had been with his earlier prediction, with England yet to bat. Told you all … 👍 — Michael Vaughan (@MichaelVaughan) August 19, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-19 15:58:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes insists England won’t change style despite heavy South Africa defeat at Lord’s","link":"https://metro.co.uk/2022/08/19/cricket-ben-stokes-reacts-south-africa-thrash-england-lords-test-17213981/","keywords":["Football","Ben Stokes","Brendon McCullum","Cricket","England cricket","South Africa cricket"],"creator":["Louis Sealey"],"video_url":null,"description":"'You don't go from being a good team to a bad one overnight.'","content":"Ben Stokes says England will not change their newly-aggressive approach despite being thrashed by South Africa inside three days at Lord’s and dismissed the suggestion the loss was a ‘wake-up call’ for his team. England succumbed to an innings-and-12-run defeat in the opening Test against South Africa after being bowled out for 165 and 146. It is the first setback of the Stokes-Brendon McCullum era, with England having beaten New Zealand in a Test series earlier in the summer and winning the one-off Test against India in fine style. ‘We’re disappointed to lose. It would be silly for me to say anything different,’ Stokes said after South Africa took a 1-0 lead in the three-Test series. ‘But we’ve got two more games to bounce back from this. We know that when we perform to what we are capable of, we are capable of some incredible performances like we have shown in the previous four games. ‘This isn’t a wake-up call or anything like that. We haven’t been able to execute the way we would like and South Africa were better than us.’ Asked whether the defeat has dented his confidence in England’s style of play, Stokes added: ‘Absolutely not. ‘I look at captains before me, captains after me – they are always going to get criticised at certain times by the way they want to play. That’s just part and parcel of life. ‘The message upstairs is going to be: “did we commit to everything we spoke about before this game?” If everyone can truly say that they did, that’s fine. ‘If we play good cricket, we give ourselves the best chance of winning the game. We’re trying not to be so fixated around the result because we didn’t think about the results in the first four games and it worked out pretty well.’ After bowling out England cheaply in the first innings, South Africa batted themselves into a dominant position on day two, reaching 289-7 at the close to lead by 124. England legend tells Virat Kohli to take 'extended break' from cricket Kagiso Rabada reacts to Lord's five-wicket haul as South Africa make England toil Lord's turns Red for Ruth during England v South Africa Test match The Proteas pushed that lead beyond 150 at the start of day three before once again ripping through England’s batting line-up. Struggling opener Zak Crawley and No. 3 Ollie Pope – who made 73 in the first innings – fell before lunch, while Root was dismissed for a second single-figure score after the break. The rapid Anrich Nortje then dismissed Jonny Bairstow, Alex Lees and Ben Foakes in quick succession to end any hopes of an England fightback. England coach McCullum said: ‘Obviously we’re disappointed, you never like losing Test matches. ‘First and foremost, we need to accept that South Africa played a lot better than us in these conditions so credit where it’s due and we’ve got some work to do in the next few days. ‘But you don’t go from being a very good cricket team a few weeks ago to making wholesale changes. We won’t overreact. ‘Both Stokesy and I are firm about how we want this team to play and the direction that we think we can take it, we just have to polish up a few of those areas. ‘The conditions didn’t allow us to play with that same freedom but that’s cricket, you’ve got to adapt and try to absorb some of that pressure. ‘When you get the opportunity to turn that pressure back on the opposition, that’s when you’ve got to be brave enough but unfortunately, we didn’t absorb the pressure as much as we’d have liked. ‘That’s sport, we’ve been on the right side of it recently but this time we were on the wrong side of it.’ South Africa will look to maintain their dominance over England when the second Test starts at Old Trafford next Thursday. Proteas skipper Dean Elgar said: ‘I can’t [believe it has finished so quickly] but I think I will when I wake up tomorrow with a hangover. ‘It was a team effort, there were a few standout performances but everyone had played their part, including the guys who weren’t playing. So it is a pretty good squad effort.’ MORE : Kagiso Rabada revels in Lord’s five-wicket haul as South Africa make England toil MORE : Lord’s turns Red for Ruth during England v South Africa Test match For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2022-08-19 15:41:54","image_url":"https://metro.co.uk/wp-content/uploads/2022/08/comp-1660922689.png","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"ENG vs SA: 36 की उम्र में चीते सी फुर्ती, स्टुअर्ट ब्रॉड ने पकड़ा हैरतअंगेज कैच, वायरल हो रहा Video","link":"https://www.abplive.com/sports/cricket/stuart-broad-took-the-catch-of-kagiso-rabada-in-the-test-match-against-south-africa-which-is-going-viral-on-social-media-2196034","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Stuart Broad Viral Video: इंग्लैंड क्रिकेट टीम के दिग्गज तेज गेंदबाज स्टुअर्ट ब्रॉड ने पिछले दिनों अपना 36वां जन्मदिन मनाया, लेकिन उम्र के इस पड़ाव भी ब्रॉड ने ऐसी फुर्ती दिखाई कि हर कोई हैरान रह गया. अब सोशल मीडिया पर स्टुअर्ट ब्रॉड का यह कैच खूब वायरल हो रहा है. वहीं, इंग्लैंड क्रिकेट ने अपने ऑफिशियल ट्विटर हैंडल से इस वीडियो को शेयर किया है. स्टुअर्ट ब्रॉड ने कगीसो रबाडा का यह कैच दक्षिण अफ्रीका की पहली पारी के 78वें ओवर में लपका. जबकि गेंदबाज मैटी पॉट्स थे. वीडियो सोशल मीडिया पर हो रहा वायरल दरअसल, टेस्ट मैच के तीसरे दिन साउथ अफ्रीका की पहली पारी का 78वां ओवर मैटी पॉट्स डाल रहे थे. साउथ अफ्रीकी बल्लेबाज कगीसो रबाडा स्ट्राइक पर थे, लेकिन वह शॉर्ट पिच गेंद को ठीक से नहीं खेल पाए, जिसके बाद मिड-ऑन पर खड़े ब्रॉड ने पीछे की ओर भागते हुए और उछल कर यह शानदार कैच लपका. यह कैच देखकर स्टेडियम में मौजूद हर शख्स हैरान रह गया. वहीं, इस मैच के दौरान स्टुअर्ट ब्रॉड ने एक बेहद खास रिकार्ड अपने नाम कर लिया. स्टुअर्ट ब्रॉड लॉडर्स के ऐतिहासिक मैदान पर टेस्ट क्रिकेट में 100 विकेट लेने वाले दूसरे गेंदबाज बन गए हैं. इससे पहले जेम्स एंडरसन ने लॉडर्स के मैदान पर टेस्ट क्रिकेट 100 विकेट अपने नाम कर चुके हैं. Oh Broady! 😱Live clips: https://t.co/2nFwGblL1E🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvSA 🇿🇦 | @StuartBroad8 pic.twitter.com/SCkwjfD7g5 — England Cricket (@englandcricket) August 19, 2022 स्टुअर्ट ब्रॉड ने अपने नाम किया यह बेहद खास रिकार्ड गौरतलब है कि स्टुअर्ट ब्रॉड दुनिया के चौथे ऐसे गेंदबाज हैं जिन्होंने एक ही मैदान पर टेस्ट क्रिकेट में 100 से ज्यादा विकेट अपने नाम किया है. वहीं, इस फेहरिस्त में जेम्स एंडरसन और श्रीलंका के मुथैया मुरलीधरन और रंगना हेरथ शामिल हैं. दोनों दिग्गज श्रीलंकाई गेंदबाज जिन्होंने टेस्ट क्रिकेट में एक ही मैदान पर 100 विकेट लेने का कारनामा कर चुके हैं. कोलंबो स्पोर्ट्स ग्राउंड पर मुरलीधरन ने 166 विकेट हासिल किए. एंडरसन लॉडर्स के मैदान पर 117 विकेट ले चुके हैं. रंगना हेरथ गाले के मैदान पर यह कारनामा कर चुके हैं. ये भी पढे़ं- जेमिमाह रोड्रिग्स के हाथ में लगी चोट, इंग्लैंड के 100 बॉल वाले टूर्नामेंट में नहीं लेंगी हिस्सा विराट कोहली के बल्ले से शतक निकले हो गए 1000 दिन, पूर्व कप्तान के नाम हुआ शर्मनाक रिकॉर्ड; बार्मी आर्मी ने किया ट्रोल","content":null,"pubDate":"2022-08-19 15:40:55","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Updated WTC Points Table After England vs South Africa 1st Test: Proteas Consolidate Top Spot After .. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L3VwZGF0ZWQtd3RjLXBvaW50cy10YWJsZS1hZnRlci1lbmdsYW5kLXZzLXNvdXRoLWFmcmljYS0xc3QtdGVzdC1wcm90ZWFzLWNvbnNvbGlkYXRlLXRvcC1zcG90LWFmdGVyLWxvcmRzLXdpbi0zMjY5NTA40gGaAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvdXBkYXRlZC13dGMtcG9pbnRzLXRhYmxlLWFmdGVyLWVuZ2xhbmQtdnMtc291dGgtYWZyaWNhLTFzdC10ZXN0LXByb3RlYXMtY29uc29saWRhdGUtdG9wLXNwb3QtYWZ0ZXItbG9yZHMtd2luLTMyNjk1MDgvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Updated WTC Points Table After England vs South Africa 1st Test: Proteas Consolidate Top Spot After ..  NDTV SportsNortje Fires SA To Victory | Highlights - England v South Africa Day 3 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardDean Elgar revels in South Africa's 'positivity' after winning Lord's Test in style  ESPNcricinfoWatch: Ben Stokes Won't Stop Hugging Stuart Broad After He Takes One-Handed Screamer In ENG vs SA 1s..  NDTV SportsLord's Test: Bazball crumbles as South Africa hand Ben Stokes 1st defeat as England captain  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-08-19 15:33:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'Bazball expired so early': Wasim Jaffer joins Netizens to troll England as SA thrash them in 1st Test","link":"https://zeenews.india.com/cricket/bazball-expired-so-early-wasim-jaffer-joins-netizens-to-troll-england-as-south-africa-beat-them-by-an-innings-and-12-runs-in-1st-test-2499207.html","keywords":null,"creator":null,"video_url":null,"description":"Meanwhile fans from India and other countries too are taking potshots at the English cricket team after their massive loss vs SA, including former Indian batter Wasim Jaffer","content":null,"pubDate":"2022-08-19 15:31:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Nortje Fires SA To Victory | Highlights - England v South Africa Day 3 | 1st LV= Insurance Test 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9UUxObnNLMUU0Y1nSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Nortje Fires SA To Victory | Highlights - England v South Africa Day 3 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardWatch: Ben Stokes Won't Stop Hugging Stuart Broad After He Takes One-Handed Screamer In ENG vs SA 1s..  NDTV SportsDay 2: England vs South Africa, 1st Test, Lord's | cricket | Cricbuzz.com - Cricbuzz  CricbuzzPace changes everything: Fans hail fiery South Africa fast bowlers as they rout England at Lord's  India TodayWhat a catch: Stuart Broad takes an overhead stunner at Lord's  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-08-19 15:16:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Batters will always need to earn the right to score runs”: Nick Compton takes subtle dig at England’s Bazball approach amidst ordinary batting at Lord’s","link":"https://thesportsrush.com/cricket-news-batters-will-always-need-to-earn-the-right-to-score-runs-nick-compton-takes-subtle-dig-at-englands-bazball-approach-amidst-ordinary-batting-at-lords/","keywords":["Cricket","Bazball","Lord's Cricket Ground","Nick Compton","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Nick Compton takes subtle dig at England’s Bazball approach as their batters struggle to get going during the ongoing Lord’s Test. On ‘Day 3’ of the ongoing first Test match of South Africa’s tour of England at the iconic Lord’s Cricket Ground, South Africa have defeated England by an innings and 12 runs, to go… The post “Batters will always need to earn the right to score runs”: Nick Compton takes subtle dig at England’s Bazball approach amidst ordinary batting at Lord’s appeared first on The SportsRush.","content":"Nick Compton takes subtle dig at England’s Bazball approach as their batters struggle to get going during the ongoing Lord’s Test. On ‘Day 3’ of the ongoing first Test match of South Africa’s tour of England at the iconic Lord’s Cricket Ground, South Africa have defeated England by an innings and 12 runs, to go 1-0 up in the three-Test series. It was an ordinary batting performance in both the innings by the English batters, amidst huge talks and discussion around their popular ‘Bazball’ approach ever since Ben Stokes and Brendon McCullum have been at the helm, with a 100% success record until today. However, apart from Ollie Pope’s 73 runs in the first innings, none of Stokes’ men could surpass the half-century mark, as the captain-coach duo face their first loss post shouldering the responsibility of a struggling English Test side. As against South Africa’s 326 in the first innings, England’s first and second innings totals read 165 and 149, with the match ending in just over six sessions. The build-up to the first Test was spicy as expected, with the South African skipper Dean Elgar, nearly dismissing England’s ‘Bazball’ approach, while also challenging them to opt the same against ‘their’ pace attack. With the Proteas pace bowling trio of Kagiso Rabada, Lungi Ngidi, and Marco Jansen picking up 18 of the 20 English wickets, Elgar indeed has the bragging rights, and most importantly a crucial victory against his team’s name as far as their chances of making it through to the World Test Championship final is concerned. As for the English camp, even if it is their only loss in five previous Tests, the Cricket fans and experts did not let the opportunity to let go an opportunity to come heavily down at ‘Bazball’, which has not found unanimous acceptance so far, in the world of Test Cricket. Former England opener turned commentator Nick Compton, took to his social media handle as well, to highlight that the format will always make sure that the batters will have to grind hard for their runs, irrespective of talks around ‘Bazball’. ALSO READ: Nick Compron praises Dean Elgar and Saral Ervee’s show with the bat during first innings He also seemed to credit the Proteas pace battery, which managed to not let the English batters settle one bit and play as per their plans during both the innings. For all the talk at Bazball one thing is for sure the great game of test cricket will never change. Batters will always need to earn the right to score runs. It’s interesting to watch how the psyche of batsmen change when there is pace in an opposition bowling attack! #ENGvSA — Nick Compton (@thecompdog) August 19, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-19 15:15:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Piers Morgan flies 5,500 miles to watch England at Lord’s for nothing as South Africa ease to First Test win on Day 3","link":"https://www.thesun.co.uk/sport/19559948/piers-morgan-england-cricket-south-africa/","keywords":["Cricket","Sport"],"creator":["Jake Lambourne"],"video_url":null,"description":null,"content":"PIERS MORGAN'S worst fears have been realised after England suffered another batting collapse to lose the First Test against South Africa. The Sun columnist flew 5,500 miles from Los Angeles to watch England face the Proteas at Lord's on Saturday in what would have been Day Four. Midway through the second innings, Morgan stated his worry that Ben Stokes ' side could fail to come out for Day Four in their opening Test match against South Africa. And his fear came true as England were all out for 149 as South Africa won by an innings and 12 runs. Having registered a measly 165 runs in their first innings , England managed to bowl out their opponents for 326. But England struggled yet again with the bat at the start of their second innings having lost two wickets before lunch. Zak Crawley's miserable summer continued after losing his wicket for LBW, before Ollie Pope went in the same fashion by spinner by Keshav Maharaj. And it didn't take Joe Root long to go as he was caught for six runs leading Morgan to take to social media. He tweeted : \" I’ve just flown 5,500 miles from Los Angeles specifically to be at Lord’s tomorrow for Day 4 of the Test match. \"*There may not be a Day 4.\" FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Things got even worse for England - and Morgan - as they lost all their remaining wickets shortly after. Jonny Bairstow was the next to fall as he managed 18 runs, with Alex Lees caught for 35 runs. Ben Foakes then went for a duck to give Anrich Nortje his third wicket after he also claimed the scalps of Bairstow and Lees. Stuart Broad and Ben Stokes managed to rack a 50-run partnership, but that ended after the former went for 35 runs. Matthew Potts then went for one after being bowled by Marco Jansen, with Stokes caught by Maharaj off a Kagiso Rabada delivery. James Anderson was the last to go as he too scored just one run after being clean bowled by Jansen. Morgan quickly took to Twitter again, where he simply stated: \"UPDATE: I won’t be going to Lord’s tomorrow.\"","pubDate":"2022-08-19 15:04:54","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“I’ll be back to full fitness very soon”: Injured Jemimah Rodrigues posts encouraging message ahead of India Women’s tour of England 2022","link":"https://thesportsrush.com/cricket-news-ill-be-back-to-full-fitness-very-soon-injured-jemimah-rodrigues-posts-encouraging-message-ahead-of-india-womens-tour-of-england-2022/","keywords":["Cricket","England Women","Gaby Lewis","India Women","India Women tour of England 2022","Jemimah Rodrigues","Northern Superchargers","The Hundred","The Hundred 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jemimah Rodrigues posts encouraging message: The Indian batter will miss the remainder of The Hundred 2022. India batter Jemimah Rodrigues has been ruled out of the ongoing second season of The Hundred due to a wrist injury she sustained during the recently concluded Commonwealth Games 2022 Women’s Cricket Competition. Rodrigues, 21, was hit whilst facing… The post “I’ll be back to full fitness very soon”: Injured Jemimah Rodrigues posts encouraging message ahead of India Women’s tour of England 2022 appeared first on The SportsRush.","content":"Jemimah Rodrigues posts encouraging message: The Indian batter will miss the remainder of The Hundred 2022. India batter Jemimah Rodrigues has been ruled out of the ongoing second season of The Hundred due to a wrist injury she sustained during the recently concluded Commonwealth Games 2022 Women’s Cricket Competition. Rodrigues, 21, was hit whilst facing Barbados’ Shakera Selman in a Group A match earlier this month. Despite a strapped hand during the subsequent parts of the tournament, Rodrigues didn’t miss a match. In fact, she was India’s second-highest run-scorer (fifth-highest overall) with her 146 runs coming at an average and strike rate of 73 and 116.80 respectively in what was the first-ever instance of Women’s Cricket in Commonwealth Games. Rodrigues, who was the highest run-scorer for Northern Superchargers in The Hundred 2021, scored a half-century in her two innings this season before aggravating her injury. Superchargers have named Ireland batter Gaby Lewis as Rodrigues’ replacement for the remainder of the tournament. An elongated stint in the English summer would’ve seen Rodrigues playing in Commonwealth Games, The Hundred and India’s tour of England next month. While an injury had initially cast doubt over Rodrigues’ participation back in the Indian jersey for six white-ball matches against England in September, her uploading an encouraging social media post hints of a strong possibility of the right-handed batter recovering well in time for India Women’s next assignment. Rodrigues, who thanked Superchargers’ family for their support, mentioned that the injury is “not serious” and that she is expecting herself to be back to “full fitness” soon. To my @N_Superchargers fam, with a heavy heart I share with you that I’ll not be playing the remainder of this season of @thehundred due to an injury on my hand. Thankfully the injury is not serious and I’ll be back to full fitness very soon! Thank you for all your Love 💜 Lil J pic.twitter.com/tpaWQjac9Y — Jemimah Rodrigues (@JemiRodrigues) August 19, 2022 Readers must note that the five Commonwealth T20Is were the first for Rodrigues in England. As far as ODIs are concerned, she had played a couple of them in England last year but without any success.","pubDate":"2022-08-19 15:04:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England lose first Test against South Africa inside three days as Anrich Nortje stars for Proteas - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjY3NjQxNC9lbmdsYW5kLWxvc2UtZmlyc3QtdGVzdC1hZ2FpbnN0LXNvdXRoLWFmcmljYS1pbnNpZGUtdGhyZWUtZGF5cy1hcy1hbnJpY2gtbm9ydGplLXN0YXJzLWZvci1wcm90ZWFz0gGbAWh0dHBzOi8vd3d3LnNreXNwb3J0cy5jb20vYW1wL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjY3NjQxNC9lbmdsYW5kLWxvc2UtZmlyc3QtdGVzdC1hZ2FpbnN0LXNvdXRoLWFmcmljYS1pbnNpZGUtdGhyZWUtZGF5cy1hcy1hbnJpY2gtbm9ydGplLXN0YXJzLWZvci1wcm90ZWFz?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England lose first Test against South Africa inside three days as Anrich Nortje stars for Proteas  Sky SportsSouth Africa rout England by innings and 12 runs – as it happened  The GuardianNortje Fires SA To Victory | Highlights - England v South Africa Day 3 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardLive England v South Africa 2022 live: reaction from the first Test defeat at Lord's  The TelegraphEngland ‘really positive’ after keeping South Africa in sight, says Stuart Broad  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-08-19 15:01:34","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Indian women footballers witness uncertain future as FIFA bans AIFF","link":"https://www.business-standard.com/article/sports/indian-women-footballers-linger-in-uncertainty-as-fifa-bans-aiff-122081900734_1.html","keywords":null,"creator":null,"video_url":null,"description":"In a country obsessed with Cricket, women footballers have defied the scant investment and tried their best to make inroads in the game, but have only gone as far as getting muted recognition","content":"International Federation of Association Football (FIFA) on August 15 banned the All India Football Federation (AIFF), citing \"undue influence from third parties\". The suspension means that the FIFA Under-17 Women's World Cup, which was slated to take place in India between October 11 and October 30, 2022, would now have to be moved to further date. Amid the ban, Indian women footballers are now in despair and are uncertain about their future. This indefinite suspension has had an immediate impact not only on just Indian football, but also on professionals down to the grassroots. The Under-17 Women's World Cup was the first FIFA tournament which India was hosting after 2017. The punishment also coincided with the Asian Football Confederation Women's Club Championship in Uzbekistan, where Indian league winners Gokulam Kerala FC were chasing a maiden title. According to one NDTV report, women's club only learned about the suspension when their flight landed in Tashkent and were barred from competing. \"We have put in so much hard work for the last two months and all the players were preparing to win the AFC trophy as well,\" club captain Ashalati Devi, also skipper of the national women's team, told India News. Lavanya Varma, who was short-listed, blamed poor governance as a reason for the ban on AIFF. She said the main reason for the ban is due to poor governance, but us innocent players have to suffer. In a country obsessed with Cricket, women footballers have defied the scant investment and tried their best to make inroads in the game, but have only gone as far as getting muted recognition. The national women's team ranked 58th in the women's global rankings, whereas, the men ranked 104th. \"Women's football in India was already struggling with a lack of resources and the ban will increase financial pressures,\" said Jamshed Chenoy, who runs Sharpshooters FC in the city of Ahmedabad. The level of support for the women's game in terms of sponsorships will take a hit, he added. According to a PTI report, the sports ministry on Friday requested FIFA and Asian Football Confederation (AFC) to allow Indian clubs- Sree Gokulam Kerala FC and ATK Mohun Bagan to compete in the tournaments as scheduled, despite the ban. The ministry also wrote an email to FIFA and AFC, apprising them of the fact that Gokulam Kerala was already in Uzbekistan when the ban was announced. This is the first time in FIFA's 85-year history that AIFF has been banned, with the apex body citing \"flagrant violations of the FIFA Statutes\" as its main reason.","pubDate":"2022-08-19 14:46:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220819/thumb-122081900734.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"England tour: Veteran pacer Jhulan Jhulan back in ODI squad; uncapped Kiran Navgire picked for T20Is","link":"https://www.tribuneindia.com/news/sports/england-tour-veteran-pacer-jhulan-jhulan-back-in-odi-squad-uncapped-kiran-navgire-picked-for-t20is-423338","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, August 19Veteran pace spearhead Jhulan Goswami made a comeback in the Indian women's ODI squad for the tour of England which also saw hard-hitting Women's T20 Challenge sensation Kiran Navgire receiving a maiden call-up in the shortest format.India will be in England on a two-week white-ball tour that comprises six white-ball games—three WT20Is and three WODIs.The T20I matches will be held in Hove (September 10), Derby (September 13) and Bristol (September 15) while the ODIs are scheduled at Hove (September 18), Canetrbury (September 21) and the Lord's (September 24).Goswami, who will be 40 in three months time, had last played for India at the ODI World Cup in New Zealand in March against Bangladesh.While her contemporary Mithali Raj had retired, the veteran seamer was nursing an injury and wasn't picked for the Sri Lanka tour.While there were speculations that she could retire but the 201-match seasoned campaigner is ready to add to his tally of 252 wickets, which is highest in the world in 50-over format.The T20I squad saw the return of Richa Ghosh in the main squad after being questionably left out of the CWG team at the expense of Taniyaa Bhatia, who has once again regained her place in both squad.While Richa is in T20I squad, Yastika Bhatia has managed to retain her place in the ODI team.But the biggest pick was the burly Kiran Navgire, a Maharshtra native, who plays domestic cricket for Nagaland.Her 34-ball-69 which had five towering sixes for Velocity during a Women's T20 Challenge game against Trailblazers gave a glimpse of his power-hitting and alongside Shafali and Richa would add impact to the team.Among those who once again missed out are veteran seamer Shikha Pandey, who has been repeatedly ignored and leg-spinner Poonam Yadav, who perhaps needs to reinvent her bowling to make a comeback.India's T20I squad: Harmanpreet Kaur (Captain), Smriti Mandhana (Vice-captain), Shafali Verma, Deepti Sharma, Pooja Vastrakar, Jemimah Rodrigues, Sneh Rana, Renuka Thakur, Meghna Singh, Radha Yadav, Sabbineni Meghana, Taniyaa Sapna Bhatia (WK), Rajeshwari Gayakwad, Dayalan Hemalatha, Simran Dil Bahadur, Richa Ghosh (WK), K.P. Navgire.India's ODI squad: Harmanpreet Kaur (Captain), Smriti Mandhana (Vice-Captain), Shafali Verma, Sabbineni Meghana, Deepti Sharma, Taniyaa Sapna Bhatia (WK), Yastika Bhatia (WK), Pooja Vastrakar, Sneh Rana, Renuka Thakur, Meghna Singh, Rajeshwari Gayakwad, Harleen Deol, Dayalan Hemalatha, Simran Dil Bahadur, Jhulan Goswami, Jemimah Rodrigues.","content":"PTI New Delhi, August 19 Veteran pace spearhead Jhulan Goswami made a comeback in the Indian women’s ODI squad for the tour of England which also saw hard-hitting Women’s T20 Challenge sensation Kiran Navgire receiving a maiden call-up in the shortest format. India will be in England on a two-week white-ball tour that comprises six white-ball games—three WT20Is and three WODIs. The T20I matches will be held in Hove (September 10), Derby (September 13) and Bristol (September 15) while the ODIs are scheduled at Hove (September 18), Canetrbury (September 21) and the Lord’s (September 24). Goswami, who will be 40 in three months time, had last played for India at the ODI World Cup in New Zealand in March against Bangladesh. While her contemporary Mithali Raj had retired, the veteran seamer was nursing an injury and wasn’t picked for the Sri Lanka tour. While there were speculations that she could retire but the 201-match seasoned campaigner is ready to add to his tally of 252 wickets, which is highest in the world in 50-over format. The T20I squad saw the return of Richa Ghosh in the main squad after being questionably left out of the CWG team at the expense of Taniyaa Bhatia, who has once again regained her place in both squad. While Richa is in T20I squad, Yastika Bhatia has managed to retain her place in the ODI team. But the biggest pick was the burly Kiran Navgire, a Maharshtra native, who plays domestic cricket for Nagaland. Her 34-ball-69 which had five towering sixes for Velocity during a Women’s T20 Challenge game against Trailblazers gave a glimpse of his power-hitting and alongside Shafali and Richa would add impact to the team. Among those who once again missed out are veteran seamer Shikha Pandey, who has been repeatedly ignored and leg-spinner Poonam Yadav, who perhaps needs to reinvent her bowling to make a comeback. India’s T20I squad: Harmanpreet Kaur (Captain), Smriti Mandhana (Vice-captain), Shafali Verma, Deepti Sharma, Pooja Vastrakar, Jemimah Rodrigues, Sneh Rana, Renuka Thakur, Meghna Singh, Radha Yadav, Sabbineni Meghana, Taniyaa Sapna Bhatia (WK), Rajeshwari Gayakwad, Dayalan Hemalatha, Simran Dil Bahadur, Richa Ghosh (WK), K.P. Navgire. India’s ODI squad: Harmanpreet Kaur (Captain), Smriti Mandhana (Vice-Captain), Shafali Verma, Sabbineni Meghana, Deepti Sharma, Taniyaa Sapna Bhatia (WK), Yastika Bhatia (WK), Pooja Vastrakar, Sneh Rana, Renuka Thakur, Meghna Singh, Rajeshwari Gayakwad, Harleen Deol, Dayalan Hemalatha, Simran Dil Bahadur, Jhulan Goswami, Jemimah Rodrigues.","pubDate":"2022-08-19 14:38:49","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_834439950.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli goes 1,000 days without scoring international century","link":"https://www.tribuneindia.com/news/sports/virat-kohli-goes-1-000-days-without-scoring-international-century-423330","keywords":null,"creator":null,"video_url":null,"description":"ANI New Delhi, August 19 Star Indian batter Virat Kohli has gone 1,000 days without scoring a century in international cricket. His final century came against Bangladesh in the second Test of the two-match series on November 23, 2019. Kohli scored a knock of 136 runs in that match. Matches since last century Since his last century, Virat Kohli has played 18 Test matches, scored 872 runs across 32 innings at an average of 27.25. He has crossed fifty-run mark six times with a best score of 79. In 50 overs format, the batter has played 23 ODIs since his final century. In these, he has scored 824 runs at an average of 35.82. He has hit ten half-centuries in the format with the best score of 89. In the shortest format of the game, Kohli has played a total of 27 T20Is since his final international ton, he has scored 858 runs in this format at an average of 42.90. His best score in this format is 94*. He has hit eight half-centuries in this format since his last ton. In all formats combined, he has featured in 68 international matches, and scored 2,554 runs across all formats in 82 innings at an average of 34.05. He has hit 24 half-centuries across all formats. Not in best form His form has not been at its best in the 2020, 2021 and 2022 calendar years. He has not been able to cross the 1,000-run mark in these years. After his final ton in 2019, he played six more matches during the rest of 2019. He scored 272 runs across six innings at an average of 68.00. He hit three fifties to end the year on a good note, with a best of 94*. In 2020, he represented India in 22 international matches and scored 842 runs in 24 innings at an average of 36.60. He hit seven half-centuries in this year and had the best score of 89. In 2021, he represented the country in 24 international matches. Across 30 innings, he scored 964 runs at an average of 37.07. He hit ten half-centuries across all formats and had the best score of 80*. The ongoing year 2022, is currently his worst year so far though not complete. He has represented India in 16 matches and across 19 innings, he had been able to score only 476 runs at a sub-par average of 25.05. Only four half-centuries have come off his bat, with the best score of 79. Fans disappointed This lack of centuries from the star batter who once used to hit them for fun has left many fans and players disappointed. The cricket fraternity has given a polarising response to Kohli's lack of form over the years. While some have backed him to come good, some have responded negatively and even questioned his place in the Indian team. Hopes to regain form Kohli will make his return to cricket after a short break, which saw him miss the tour of West Indies during the Asia Cup 2022. His first match on comeback will be against arch-rivals Pakistan on August 28. Fans will hope that Kohli regains his form during the tournament and hopefully hits his much-anticipated 71st international ton soon and raises his bat and helmet while roaring his lungs out to the delight of his fans.","content":null,"pubDate":"2022-08-19 14:38:33","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_1458416260.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: \"He needs to focus more on cricket\" - Danish Kaneria on Virat Kohli's woes of late","link":"https://www.sportskeeda.com/cricket/news-asia-cup-2022-he-needs-focus-cricket-danish-kaneria-virat-kohli-s-woes-late?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Anuj Nitin Prabhu"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-19 13:09:25","image_url":"https://static.sportskeeda.com/editor/2022/08/7197e-16609110281154-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"}]}