{"newsArray":[{"title":"Yorkshire OK to host international cricket","link":"https://www.perthnow.com.au/sport/cricket/yorkshire-ok-to-host-international-cricket-c-6282704","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Headingley is set to host international cricket once again after members of Yorkshire County Cricket Club voted in favour of governance reforms.","content":null,"pubDate":"2022-03-31 21:21:49","full_description":"Yorkshire can continue to host international cricket at Headingley after members voted in favour of governance reforms, meeting the conditions set out by the England & Wales Cricket Board. Yorkshire were barred from staging internationals after a racism scandal involving allegations by former spinner Azeem Rafiq. The ECB lifted the ban in February on condition the club approved structural changes to the board. Kamlesh Patel has been formally confirmed as Yorkshire's chairman, having taken over in November from Roger Hutton after Rafiq's explosive allegations led to resignations at the club. Rafiq, a player of Pakistani descent and a former captain of the England U19s, said last year he was made to feel like an outsider at Yorkshire and alleged he was a victim of institutional racism at the club. \"We welcome the outcome of this EGM and thank the Members for their full and proper consideration, an open exchange of views, and their votes. It is an overwhelming vote for positive change,\" Patel said in a statement on Thursday. \"This support will help Yorkshire County Cricket Club to be an inclusive and welcoming place and gives us the clarity and certainty we need to keep building this great club.\" Headingley is scheduled to host England's third Test against New Zealand from June 24 and the final match of their ODI series against South Africa in July. Rafiq welcomed the reforms and praised Patel's leadership. \"Relieved to see Lord Patel's reforms backed today and that Yorkshire members chose a bright, inclusive future for my club,\" the 30-year-old wrote on Twitter. \"Big opportunity to show the world what can be achieved when you have strong leadership and good people.\"","image_url":"https://images.perthnow.com.au/publication/C-6282704/832a749e1a800f8ce59580f2e361140c49570da3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Yorkshire OK to host international cricket","link":"https://thewest.com.au/sport/cricket/yorkshire-ok-to-host-international-cricket-c-6282692","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Headingley is set to host international cricket once again after members of Yorkshire County Cricket Club voted in favour of governance reforms.","content":null,"pubDate":"2022-03-31 21:19:49","full_description":"Yorkshire can continue to host international cricket at Headingley after members voted in favour of governance reforms, meeting the conditions set out by the England & Wales Cricket Board. Yorkshire were barred from staging internationals after a racism scandal involving allegations by former spinner Azeem Rafiq. The ECB lifted the ban in February on condition the club approved structural changes to the board. Kamlesh Patel has been formally confirmed as Yorkshire's chairman, having taken over in November from Roger Hutton after Rafiq's explosive allegations led to resignations at the club. Rafiq, a player of Pakistani descent and a former captain of the England U19s, said last year he was made to feel like an outsider at Yorkshire and alleged he was a victim of institutional racism at the club. Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news! \"We welcome the outcome of this EGM and thank the Members for their full and proper consideration, an open exchange of views, and their votes. It is an overwhelming vote for positive change,\" Patel said in a statement on Thursday. \"This support will help Yorkshire County Cricket Club to be an inclusive and welcoming place and gives us the clarity and certainty we need to keep building this great club.\" Headingley is scheduled to host England's third Test against New Zealand from June 24 and the final match of their ODI series against South Africa in July. Rafiq welcomed the reforms and praised Patel's leadership. \"Relieved to see Lord Patel's reforms backed today and that Yorkshire members chose a bright, inclusive future for my club,\" the 30-year-old wrote on Twitter. \"Big opportunity to show the world what can be achieved when you have strong leadership and good people.\"","image_url":"https://images.thewest.com.au/publication/C-6282692/832a749e1a800f8ce59580f2e361140c49570da3-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pakistan too good for Australia in ODI 2","link":"https://www.cairnspost.com.au/sport/cricket/pakistan-too-good-for-australia-in-odi-2/video/596966d10ea68bbe9f3a4fa0eadbcdcb","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia's Ben McDermott nailed a ton with the bat, but it wasn't enough for the tourists as Baba Azam played the hero for Pakistan.","content":null,"pubDate":"2022-03-31 20:36:23","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket news 2022: Aaron Finch cannot continue as captain, Australia vs Pakistan, results, analysis, video, highlights","link":"https://www.foxsports.com.au/cricket/australia/cricket-news-2022-aaron-finch-cannot-continue-as-captain-australia-vs-pakistan-results-analysis-video-highlights/news-story/39407fd053fecb2a582b43f9ba2b0d65","keywords":null,"creator":null,"video_url":null,"description":"Andrew McDonald is moving towards his first crunch call as coach.","content":null,"pubDate":"2022-03-31 20:00:00","full_description":"Andrew McDonald is moving towards his first crunch call as coach. For more than a year Aaron Finch’s future has garnered headlines. But with each passing innings, it appears the Australian great white-ball cricketer is past it. At some point the decision has to be made over Finch’s place at the top of the order. He might be captain, but the 35-year-old is a walking wicket at the top of the order. His ODI record remains superb. Finch averages more than 40 and has hit 17 centuries. He might have two half-centuries and a century in three of his past five innings, but those runs came in 2020. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > Since 2021, Finch has hardly scored a run for Australia in international cricket. He has passed 50 on just three occasions in 23 T20 knocks, while his first-ball duck on Thursday came after a grinding 23 against Pakistan as Travis Head, who was playing his first ODI since 2018, hit the eighth fastest century in Australia history. If Finch was not captain, he would not be in the side. Throughout 2021, then-coach Justin Langer and chairman of selectors George Bailey supported Finch to take them to the World Cup. The decision paid off, with Australia winning their maiden T20 tournament. But Finch struggled, making five and nought in the two knockout matches. He has no issues against the off-spin bowlers. Even on Tuesday, Finch smoked a six into the stands. But the issue is Finch opens and against genuine pace, as well as leg-spin, Finch can’t time a ball. Pakistan's Shaheen Shah Afridi (C) celebrates after taking the wicket of Australia's captain Aaron Finch (L). Photo: AFP Source: AFP McDonald, Finch’s former teammate and Victorian coach, must know this horror show can’t continue. Finch remains one of the most respected men and is the country and is an excellent leader, but the drums are beating. McDonald and Bailey, as well Tony Dodemaide, will make the call over his future. Finch will play the rest of the series against Pakistan, but with an ODI World Cup still more than a year away, as well as a home T20 series, there must be grave concerns that the long-time captain will not make it. Head’s explosive return, as well as the development of Ben McDermott, who finally appears to be finding his feet at the international level, mean Australia have options at the top of the order. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > Aaron Finch’s struggles have continued. Photo: Getty Images Source: Getty Images Only in February former Australian opener and selector Mark Waugh spoke of Finch’s struggles. “In the ideal world, we want to see Aaron Finch make runs and not have to talk about it,” Waugh said during Australia’s T20 series win over Sri Lanka in February as Finch moved down to first-drop. “But we’ve been talking about this for the past 15 months. “Now, he’s not the player he was, there’s no doubt about that, and I think the stats do back that up. His strike rate in all forms of T20 cricket — IPL, Big Bash and T20 Internationals — has dropped 20 points over the past two years, from 145 to about 125. “His average has dropped from about 35 to the high 20s and it’s probably the way he’s batting, he’s just not dominating like he used to. I think he’s a little uncomfortable against raw pace and wrist spin, so he really needs to finish this series really strongly. “I’d have him opening again, I don’t know what he didn’t open the other night when he needs runs moving forward. I’m not saying he won’t be there for the World Cup but it’d be great to see him get into some sort of form.” Every boundary from Head's magical ton | 02:51 Waugh knows the brutal realities of international cricket. He, as well as twin brother Steve, both were dropped ahead of the 2003 World Cup. The decision proved a masterstroke, with Australia winning three straight World Cups.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pakistan level ODI series with Australia as Babar Azam leads record run chase - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL21hci8zMS9jcmlja2V0LXBha2lzdGFuLWF1c3RyYWxpYS1vbmUtZGF5LWludGVybmF0aW9uYWwtbWF0Y2gtcmVwb3J00gFraHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3Nwb3J0LzIwMjIvbWFyLzMxL2NyaWNrZXQtcGFraXN0YW4tYXVzdHJhbGlhLW9uZS1kYXktaW50ZXJuYXRpb25hbC1tYXRjaC1yZXBvcnQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan level ODI series with Australia as Babar Azam leads record run chase  The GuardianAussies stunned as cricket record shattered  news.com.auHeartbreak for Aussies in thriller as Pakistan makes history with ‘unbelievable’ run chase  Fox SportsPakistan seek turnaround in second ODI  The News InternationalAustralia take same team into second ODI  Bega District NewsView Full coverage on Google News","content":null,"pubDate":"2022-03-31 19:03:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs CSK, Report: Evin Lewis, Quinton De Kock Shine As LSG Beat CSK By 6 Wickets - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1sc2ctdnMtY3NrLXJlcG9ydC1ldmluLWxld2lzLXF1aW50b24tZGUta29jay1zaGluZS1hcy1sc2ctYmVhdC1jc2stYnktNi13aWNrZXRzLTI4NTU2ODTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs CSK, Report: Evin Lewis, Quinton De Kock Shine As LSG Beat CSK By 6 Wickets  NDTV SportsLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzLSG vs CSK Highlights, IPL 2022: De Kock, Lewis star as Lucknow chase down 211 for first win  Times of IndiaLSG vs CSK Highlights IPL 2022 Latest Updates: Lewis Hits Blistering Fifty as Lucknow Chase Down 211 to Bea  News18CSK vs LSG: Evin Lewis unbeaten 55 off 23 helps LSG beat CSK. What a thriller!  DNAIndiaNewsView Full coverage on Google News","content":null,"pubDate":"2022-03-31 18:44:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“AB Baby”: Aakash Chopra bows to Ayush Badoni and Evin Lewis as CSK lose after Shivam Dube leaks 25 runs in one over","link":"https://thesportsrush.com/cricket-news-ab-baby-aakash-chopra-bows-to-ayush-badoni-and-evin-lewis-as-csk-lose-after-shivam-dube-leaks-25-runs-in-one-over/","keywords":["Cricket","CSK","IPL 2022","Lucknow Super Giants","Ayush Badoni","chennai super kings","csk","Evin Lewis","Indian Premier League","LSG","Shivam Dube"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ayush Badoni and Evin Lewis: Lucknow Super Giants have won their first match by sealing an emphatic chase tonight. During the seventh match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Chennai Super Kings at the Brabourne Stadium, Lucknow Super Giants sealed an emphatic chase against Chennai Super… The post “AB Baby”: Aakash Chopra bows to Ayush Badoni and Evin Lewis as CSK lose after Shivam Dube leaks 25 runs in one over appeared first on The SportsRush.","content":"Ayush Badoni and Evin Lewis: Lucknow Super Giants have won their first match by sealing an emphatic chase tonight. During the seventh match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Chennai Super Kings at the Brabourne Stadium, Lucknow Super Giants sealed an emphatic chase against Chennai Super Kings to win the first-ever match. Chasing a 211-run target, Super Giants needed as many as 34 runs in the last two overs. Super Kings captain Ravindra Jadeja’s ploy of introducing all-rounder Shivam Dube into the attack to bowl the penultimate over didn’t reap fruits for the defending champions. Playing only his fifth delivery, rookie LSG batter Ayush Badoni hit Dube for a six to kick-start a game-changing over. Badoni’s effort was followed by overseas batter Evin Lewis hitting two fours and a six as LSG collected 25 runs from the over. A 13-ball 40-run match-winning partnership between Lewis and Badoni powered Lucknow to a 6-wicket victory with three balls remaining in the match. In what was his fourth IPL half-century, Lewis scored 55* (23) with the help of six fours and three sixes at a strike rate of 239.13. Badoni, on the other hand, followed his maiden IPL half-century with 19* (9) comprising of a couple of sixes. Apart from the unbeaten pair, Lucknow thrived on the back of a 99-run opening partnership between captain KL Rahul (40) and wicket-keeper batter Quinton de Kock (61). Twitter reactions on Ayush Badoni and Evin Lewis as LSG beat CSK: Whoaaaaa…this kid Badoni. AB Baby. Ufff…nerves of steel. Evin Lewis. Lucknow Super Giants. Take a bow #IPL2022 #LSGvCSK — Aakash Chopra (@cricketaakash) March 31, 2022 Jaw-dropping by Ayush Badoni. Wow! #IPL2022 #CSKvLSG — Subhayan Chakraborty (@CricSubhayan) March 31, 2022 Badoni! Wow, such composure. What a find. Such a slim, little young man hitting it far…. — Harsha Bhogle (@bhogleharsha) March 31, 2022 Ayush Badani – fire in his belly, visible in his eyes. The kid’s special #CSKvLSG — Jatin Sapru (@jatinsapru) March 31, 2022 For more cricket-related news, click here. The post “AB Baby”: Aakash Chopra bows to Ayush Badoni and Evin Lewis as CSK lose after Shivam Dube leaks 25 runs in one over appeared first on The SportsRush.","pubDate":"2022-03-31 18:31:19","full_description":"Ayush Badoni and Evin Lewis: Lucknow Super Giants have won their first match by sealing an emphatic chase tonight. During the seventh match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Chennai Super Kings at the Brabourne Stadium, Lucknow Super Giants sealed an emphatic chase against Chennai Super Kings to win the first-ever match. Chasing a 211-run target, Super Giants needed as many as 34 runs in the last two overs. Super Kings captain Ravindra Jadeja’s ploy of introducing all-rounder Shivam Dube into the attack to bowl the penultimate over didn’t reap fruits for the defending champions. Playing only his fifth delivery, rookie LSG batter Ayush Badoni hit Dube for a six to kick-start a game-changing over. Badoni’s effort was followed by overseas batter Evin Lewis hitting two fours and a six as LSG collected 25 runs from the over. A match-winning 13-ball 40-run partnership between Lewis and Badoni powered Lucknow to a 6-wicket victory with three balls remaining in the match. In what was his fourth IPL half-century, Lewis scored 55* (23) with the help of six fours and three sixes at a strike rate of 239.13. Badoni, on the other hand, followed his maiden IPL half-century with 19* (9) comprising of a couple of sixes. Apart from the unbeaten pair, Lucknow thrived on the back of a 99-run opening partnership between captain KL Rahul (40) and wicket-keeper batter Quinton de Kock (61) . Whoaaaaa…this kid Badoni. AB Baby. Ufff…nerves of steel. Evin Lewis. Lucknow Super Giants. Take a bow 🙇 #IPL2022 #LSGvCSK — Aakash Chopra (@cricketaakash) March 31, 2022 Jaw-dropping by Ayush Badoni. Wow! #IPL2022 #CSKvLSG — Subhayan Chakraborty (@CricSubhayan) March 31, 2022 Badoni! Wow, such composure. What a find. Such a slim, little young man hitting it far…. — Harsha Bhogle (@bhogleharsha) March 31, 2022 Ayush Badani – fire in his belly, visible in his eyes. The kid’s special #CSKvLSG — Jatin Sapru (@jatinsapru) March 31, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022, LSG vs CSK Highlights, Full Score: Lucknow beat Chennai by 6 wickets - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy90YXRhLWlwbC0yMDIyLWxzZy12cy1jc2staGlnaGxpZ2h0cy1mdWxsLXNjb3JlLWx1Y2tub3ctYmVhdC1jaGVubmFpLWJ5LTYtd2lja2V0cy0xMDUwMjg1MS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tata IPL 2022, LSG vs CSK Highlights, Full Score: Lucknow beat Chennai by 6 wickets  FirstpostLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzLSG vs CSK Highlights, IPL 2022: De Kock, Lewis star as Lucknow chase down 211 for first win  Times of IndiaLSG vs CSK Highlights IPL 2022 Latest Updates: Lewis Hits Blistering Fifty as Lucknow Chase Down 211 to Bea  News18IPL 2022, LSG vs CSK Highlights: Lucknow beat Chennai by six wickets  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-03-31 18:17:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"KKR vs PBKS Dream11 Prediction, Fantasy Cricket Tips, Playing XI Updates, Pitch Report & Injury Updates For Match 8 – Apr 1st 2022 - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20va2tyLXZzLXBia3MtZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLXBsYXlpbmcteGktdXBkYXRlcy1waXRjaC1yZXBvcnQtaW5qdXJ5LXVwZGF0ZXMtZm9yLW1hdGNoLTgtYXByLTFzdC0yMDIyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"KKR vs PBKS Dream11 Prediction, Fantasy Cricket Tips, Playing XI Updates, Pitch Report & Injury Updates For Match 8 – Apr 1st 2022  CricTrackerKolkata Knight Riders vs Punjab Kings, Preview IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: What Yuzvendra Chahal Tweeted After RCB Leg-Spinner Stole The Show vs KKR  NDTV Sports'Dre being Dre, He Still Wanted to Try': Brendon McCullum Speaks About Russell's Shoulder Discomfort  News18Karthik’s nine lives; Akash Deep’s galloping celebration; Kohli’s lonely catching in the deep; Wanindu’s agony & ecstacy  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-03-31 17:55:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022, LSG vs CSK, Live Updates: Lewis crucial for Lucknows steep chase - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMi3wFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9sc2ctdnMtY3NrLWxpdmUtY3JpY2tldC1zY29yZS10YXRhLWlwbC0yMDIyLW1hdGNoLXNjb3JlY2FyZC1saXZlLXVwZGF0ZS1sdWNrbm93LXN1cGVyLWdpYW50cy12cy1jaGVubmFpLXN1cGVyLWtpbmdzLWluZGlhbi1wcmVtaWVyLWxlYWd1ZS1saXZlLXN0cmVhbWluZy10b2RheS0xMDUwMjg1MS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tata IPL 2022, LSG vs CSK, Live Updates: Lewis crucial for Lucknows steep chase  FirstpostLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzLSG vs CSK Live Score, IPL 2022: Lewis, Hooda keep Lucknow in the hunt as asking rate climbs  Times of IndiaLucknow Super Giants vs Chennai Super Kings Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorLSG vs CSK Live Cricket Score, IPL 2022 Latest Updates: Deepak Hooda Falls on 13 as Chennai Edge Ahead  News18View Full coverage on Google News","content":null,"pubDate":"2022-03-31 17:52:17","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-16-20-updates-2855627","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 17:49:46","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 18.1 overs, Lucknow Super Giants, chasing a target of 211, are 183/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Chennai Super Kings. Everything related to Lucknow Super Giants and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Chennai Super Kings live score. Do check for Lucknow Super Giants vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Shivam Dube will bowl the 19th over! 17.6 overs (1 Run) Just the single which means Badoni will keep strike. Do not think Chennai will mind that. Outside off, this is hit towards sweeper cover for one. 17.5 overs (2 Runs) Two more! Outside off, a yorker, this is jammed through point for two. This is now a free hit for Badoni. By free hit we mean, he can swing hard and look for a boundary. 17.4 overs (0 Run) A dot! Fails to find the gap! The idea was right but did not come off! Outside off, Badoni looks to guide it past backward point but finds the man there. 17.3 overs (2 Runs) Two more! On middle, a slower one, this is worked through square leg for two. Don't think the twos will bother Chennai. 17.3 overs (1 Run) WIDE! An appeal but that was probably to put the umpire off. Bravo goes short and down the leg side. Badoni looks to pull but misses. Wided. Ayush Badoni is the next man in. 17.2 overs (0 Run) OUT! TAKEN! Six and out for Hooda and Chennai back on top! That was there to be hit too! A full toss on middle, this is heaved but not off the middle. Longer side of the ground and Jadeja takes an easy catch at deep mid-wicket. Have to believe, everything now is on Lewis. He holds the key. Dwayne Bravo now becomes the highest wicket-taker in the Indian T20 League history! 17.1 overs (6 Runs) SIX! BANG! That is exactly the kind of start they wanted. Hooda with a maximum to begin the over and now pressure on Bravo. Fuller and on middle, Hooda smashes it down the ground for a biggie. 16.6 overs (0 Run) NOT OUT! Nothing on Ultra Edge and Chennai lose a review. Don't blame them for taking it as it was Lewis who was the man in question. This is fuller and well wide outside off. Lewis goes for it. He hits the ground in the process. It is reviewed. Replays show nothing. 16.5 overs (6 Runs) SIX! BANG! That goes over the fence! A welcome biggie. Right in the slot this one, fuller and on off, it is hit over the long off fence. Can he get another one? 16.4 overs (1 Run) Just the one! Once again, a wild swingt to this slower one outside off. It goes off the toe-end towards deep point for one. 16.3 overs (0 Run) Another dot! A slower one outside off, Hooda swings again but misses. 16.2 overs (1 Run) Lewis is looking to hit the ball way too hard! Shorter and angling into the body, Lewis looks to heave it on the leg side but gets an inside edge onto the body. A leg bye taken. 16.2 overs (1 Run) WIDE! This one does not come out right, it is well wide outside off. Left alone. 16.1 overs (0 Run) Lewis swung so hard there! Misses out though! Angled into middle, Liews looks to heave it on the leg side but gets an inside edge onto the pads. Dots are gold. DRINKS! Chennai have done well after the 10th over and have got wickets at regular intervals to put pressure back on Lucknow. However, the target is still not out of reach for Lucknow and if Lewis and Hooda get going, Lucknow are in with a great chance. Final four overs coming up... 15.6 overs (1 Run) Single to end the over! 55 needed now from 24 balls! A full delivery, outside off. Lewis hits it straight to the cover fielder in the ring. A single taken. 12 runs from the over! 15.5 overs (4 Runs) FOUR! Lewis is the man for Lucknow! Bravo serves a low full toss outside off. Lewis drills it through covers for a boundary. 15.4 overs (1 Run) Very full again, on middle and leg. Hooda looks to clip it away but misses. The ball hits his pads and goes towards the leg side. A leg bye taken. 15.3 overs (4 Runs) FOUR! Boundary now and Hooda shows his power this time! A full delivery on off. Hooda goes very deep in his crease and slams it straight down the ground for a boundary. 15.2 overs (1 Run) Just a single! Very full delivery, outside off. Lewis slices it to deep backward point for a single. 15.1 overs (1 Run) A slower yorker from 'round the wicket, around off. Hooda just digs it out towards the off side for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843655779569759.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Dhoni achieves another milestone, crosses 7000-run mark in T20s","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2022-ms-dhoni-achieves-another-milestone-crosses-7000-run-mark-in-t20s/articleshow/90576864.cms","keywords":null,"creator":null,"video_url":null,"description":"Former Chennai Super Kings captain and legendary wicketkeeper-cum batsman MS Dhoni achieved yet another milestone in his illustrious career on Thursday as he became the the sixth Indian to cross the 7000-run mark in T20 cricket during the IPL match against Lucknow Super Giants at the Brabourne Stadium in Mumbai.","content":null,"pubDate":"2022-03-31 17:42:38","full_description":"NEW DELHI: Former Chennai Super Kings captain and legendary wicketkeeper-cum batsman MS Dhoni achieved yet another milestone in his illustrious career on Thursday as he became the the sixth Indian to cross the 7000-run mark in T20 cricket during the IPL match against Lucknow Super Giants at the Brabourne Stadium in Mumbai. Needing 15 runs prior to this match, the vintage Dhoni (7001) was at his best as he smashed an unbeaten 16 off just 6 balls, that included two fours and a six, to reach the landmark. The former CSK skipper started the IPL 2022 season in style by playing a fine knock of unbeaten 50 runs that came in 38 balls against KKR. 𝗗𝗢 𝗡𝗢𝗧 𝗠𝗜𝗦𝗦!6⃣ on the first ball 💪4⃣ on the second ball 👌Sit back & relive the @msdhoni special! #TATAIPL |… https://t.co/lgOE4xn3pE — IndianPremierLeague (@IPL) 1648742606000 Former Indian captain Dhoni, who has played in all the fifteen editions of the IPL till date, is sixth on the list of Indians which include Virat Kohli (10,326), Rohit Sharma (9,936), Suresh Raina (8654), Shikhar Dhawan (8,818) and Robin Uthappa (7,120). In the overall list of highest run-getters in T20s, West Indies great Chris Gayle is sitting at the top with 14,562 runs, followed by Pakistan’s Shoaib Malik, WI’s Kieron Pollard, Australia’s Aaron Finch and Kohli.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-11-15-updates-2855567","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 17:25:56","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Lucknow Super Giants, chasing a target of 211, are 145/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Chennai Super Kings. Everything related to Lucknow Super Giants and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Chennai Super Kings live score. Do check for Lucknow Super Giants vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (4 Runs) FOUR! Good shot! Still a very good over for Chennai.67 needed from 30 balls! This is short, around leg and Evin Lewis pulls it. He beats the diving fielder at deep backward square leg and a boundary to end the over. 14.5 overs (1 Run) A fuller delivery on off. Hooda drives it to covers for a single. Deepak Hooda is the next batter in. 14.4 overs (0 Run) OUT! CAUGHT! Quinton de Kock departs and Dwaine Pretorius gets another big wicket! This is a fullish delivery on off. Quinton de Kock goes deep in his crease and looks to lauch it downtown. However, he gets a huge top edge. The ball goes high in the air and MS Dhoni settles under it to take a fine catch. Chennai right on the top now. 72 needed now from 32 balls! 14.3 overs (1 Run) A fuller delivery on off. Lewis hits it to long off for a single. 14.2 overs (0 Run) Appeal from the bowler but going down leg! Back of a length and angling into leg. Lewis looks to pull it but misses. The ball hits high on the pad of Lewis, an appeal but no damage done. 14.1 overs (1 Run) A fuller delivery on middle. Quinton de Kock drills it to long on for a single. 13.6 overs (6 Runs) SIX! That's the boundary they needed! 74 needed now from 36 balls! This is full and outside off. Lewis gets under it and tonks it over long off for a biggie. 13.5 overs (1 Run) A full delivery on middle. Quinton de Kock heaves it towards deep mid-wicket and the ball falls short of the fielder there. Single taken again. 13.4 overs (1 Run) Very good work from Jadeja! A low full toss outside off. Lewis hits it hard towards sweeper cover but Jadeja runs to his right and stops it. Just a single. 13.3 overs (1 Run) Nails a yorker this time, outside off. Quinton de Kock reaches for it and ends up hitting it towards the off side for a single. 13.2 overs (1 Run) Almost a yorker, outside off. Lewis steers it towards deep backward point for a single. 13.1 overs (4 Runs) FOUR! Just over! This is full and outside off. Lewis looks to drive it away but gets a thick outside edge. The ball goes short third man for a boundary. 13.1 overs (1 Run) WIDE! A very full delivery and outside off. Just a bit on the wrong side of the tramline and a wide is called by the umpire as Lewis leaves it alone. 12.6 overs (2 Runs) Another good over for Chennai! On middle and leg. Quinton de Kock works it away behind square on the leg side and comes back for the second run. 89 needed now from 42 balls! 12.5 overs (1 Run) Just a single again! On a length, on off. Lewis pushes it towards the leg side for a single. 12.4 overs (2 Runs) Full and on middle. Lewis works it to deep backward square leg for a couple. 12.3 overs (1 Run) Goes fuller, outside off. Quinton de Kock slices it to deep point for a single. 12.2 overs (0 Run) Angling on leg again. Quinton de Kock backs away a bit and looks to pull it but completely miscues it. The ball hits his bat and falls on the turf. 12.1 overs (2 Runs) Drifting on the pads from 'round the wicket. Quinton de Kock works it to fine leg for a couple. 11.6 overs (2 Runs) Two is the call and two is what they get! A yorker outside off, this is jammed through point for two. 11.5 overs (4 Runs) FOUR! This is carved away! A welcome boundary then! OUtside off, fuller, this is guided through point and this one races away to the fence. 11.4 overs (1 Run) A low full toss outside off, keeping it wide to de Kock, he hits it through point for one. 11.3 overs (1 Run) Fuller and on off, this is pushed down to long off for one. Evin Lewis is the next man in. 11.2 overs (0 Run) OUT! TAKEN! Another one bites the dust! Pandey does not last for long and Lucknow now in trouble! This is fuller and on off, way too full to get under. Pandey looks to hit it over mid off but hits it to Bravo there. He takes a fine catch and Tushar Deshpande gets into the wicket column now. 11.1 overs (0 Run) Dots are gold! Shorter and on off, this is pushed to mid off. Tushar Deshpande is back on. 10.6 overs (1 Run) The fielder almost lost it there! A low full toss, dipping. On middle, Pandey looks to flick but is early in the shot, it goes off the inner half towards square leg. The ball spins away from him but he does well to dive and stop it. A single in the end. 10.6 overs (1 Run) WIDE! Yet another wide as this too is bowled well outside off. 10.6 overs (1 Run) WIDE! This is well wide outside off, left alone. 10.5 overs (2 Runs) Two more! Shorter and on middle, Pandey slaps it down the ground and takes two. 10.4 overs (0 Run) Shorter and outside off, Pandey looks to cut but chops it to covers. 10.3 overs (2 Runs) Two is the call and two is what they get! Outside off, this is guided through point for a couple. Manish Pandey walks in at number 3. 10.2 overs (0 Run) OUT! TAKEN! There is the wicket Chennai needed! The big one of Rahul. Dwaine Pretorius did not do a lot with the bat but he has got the big fish. Rahul walks across, this is banged in short and outside off, Rahul looks to pull, it goes off the top edge over short fine leg. Ambati Rayudu runs back and takes a really good catch. Have to say, after this wicket, Chennai slightly ahead in the gap. 112 needed in 58. 10.1 overs (1 Run) A slower one and on off, this is pushed towards cover for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843641484839496.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Matches in Maharashtra to allow 50 per cent attendance from April 5","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/ipl-2022-indian-premier-league-to-allow-50-per-cent-attendance-from-april-5-cricket-news/article38464800.ece","keywords":null,"creator":["Amol Karhadkar"],"video_url":null,"description":"Following a green signal from the Government of Maharashtra, the BCCI has directed the Mumbai Cricket Association and the Maharashtra Cricket Association to make arrangements for 50 per cent attendance from April 5.","content":null,"pubDate":"2022-03-31 17:13:46","full_description":"The Indian Premier League (IPL) games in Maharashtra are set to witness double spectator attendance from April 5 than in the first week of the tournament, with the Board of Control for Cricket in India (BCCI) set to allow 50 per cent attendance at all four venues. The Hindu understands that following a green signal from the Government of Maharashtra, the BCCI has directed the Mumbai Cricket Association and the Maharashtra Cricket Association to make arrangements for 50 per cent attendance from April 5. A BCCI official confirmed that besides making the logistical and security arrangements, the ticketing partners has also been issued relevant instructions. ALSO READ | IPL 2022: Back at KKR, Umesh Yadav making an impact The development comes hours after the state government has lifted all the COVID-19 curbs starting April 1. Before the start of the IPL, the BCCI in consultation with the state government had announced that all four IPL venues will be allowed 25 per cent in-stadia attendance. Sources in the BCCI and MCA confirmed that a revised notification from the state government has been issued and the capacity at all the four venues will be doubled starting with Rajasthan Royals’ clash versus Royal Challengers Bangalore at Wankhede Stadium on April 5.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-6-10-updates-2855494","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 16:57:50","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.2 overs, Lucknow Super Giants, chasing a target of 211, are 99/1. The live updates of Lucknow Super Giants vs Chennai Super Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Lucknow Super Giants vs Chennai Super Kings, Lucknow Super Giants vs Chennai Super Kings live score, Lucknow Super Giants vs Chennai Super Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) Another single! Outstanding over from Dwayne Bravo! Just 8 from it and 113 needed now from 60 balls! Coming to the ball - It is again a very full delivery, outside off. Quinton de Kock hits it to sweeper cover for a single. 9.5 overs (1 Run) A full delivery on middle. Rahul drills it to long on for a single. 9.4 overs (1 Run) Fifty for Quinton de Kock! A full delivery, outside off. Quinton de Kock reaches for it and slices it to deep point for a single. This has been a brilliant innings from the wicket-keeper batter. He failed in the first game but you cannot keep the man with such immense quality quiet for a long time. 9.4 overs (1 Run) WIDE! Another fuller and wider delivery, outside off. Quinton de Kock lets it go. Wide called again. 9.4 overs (1 Run) WIDE! A fuller and slower delivery, outside off. It is too wide. Quinton de Kock lets it go. The umpire signals it wide. 9.3 overs (1 Run) This is full on leg. Rahul makes room and hits it hard back to the bowler. The ball hits Bravo on his leg and deflects towards the off side. A single taken. 9.2 overs (1 Run) A fullish delivery, outside off. Quinton de Kock slices it to deep backward point for a single. 9.1 overs (1 Run) A fuller delivery on leg. Rahul clips it to deep mid-wicket for a single. Drinks! A perfect start for Lucknow. Their two big players, their openers have stepped up and Lucknow are bossing this game now. Still 121 needed but if Chennai fail to get wickets in the next few overs, it will be very tough for Chennai to stop this batting lineup on this belter of a track. Dwayne Bravo comes back to bowl his second over. 8.6 overs (1 Run) 10 from the over! Shorter and flatter outside off. Rahul cuts it to sweeper cover for a single. 121 needed from 66 balls! 8.5 overs (1 Run) A fuller delivery on middle. Quinton de Kock nudges it to mid-wicket for a single. 8.4 overs (4 Runs) FOUR! These are not good signs for Chennai! A shorter and flatter delivery on middle. Quinton de Kock slams it through mid-wicket for a boundary. 8.3 overs (0 Run) A fuller delivery on middle. Quinton de Kock works it towards the leg side. 8.2 overs (0 Run) Goes fuller on off. Quinton de Kock looks to reverse-sweep but gets just some past of his blade. It falls back on the turf. 8.1 overs (4 Runs) FOUR! Another boundary! A shorter and flatter delivery on middle. Quinton de Kock pulls it to deep backward square leg for a boundary. 7.6 overs (2 Runs) It will go down as a drop chance but a tough one! This is fuller around off. Rahul skips down the track and slices it over cover-point. Tushar Deshpande runs behind to his left and reaches it. However, fails to pouch it. Two runs taken. 7.5 overs (6 Runs) SIX! Tossed up on middle. KL Rahul dances down the track and launches it over long on for a biggie. He is a class player and he is showing that today. 7.4 overs (1 Run) A flatter and quicker one on off. Quinton de Kock makes room again and cuts it to deep point for a single. 7.3 overs (4 Runs) FOUR! Quality shot from quality player! This is fuller on middle. Quinton de Kock makes room and lifts this over extra-cover for a boundary. 7.2 overs (1 Run) Another full delivery on middle. Rahul pushes it to long on for a single. 7.1 overs (0 Run) A fuller delivery on middle. Rahul works it towards mid on pocket. Moeen Ali is into the attack now. 6.6 overs (0 Run) A dot to end but a good over for Lucknow! Shorter, it lands outside off and skids through. de Kock looks to pull but misses to get hit on the pads. 145 needed in 78. 6.5 overs (1 Run) Flatter and angled into middle, this is pulled through mid-wicket for one. 6.4 overs (6 Runs) SIX! Over the fence! That is brilliant use of the feeet. Steps out and gets to the pitch of it, hammers it over the long on fence for a biggie. 6.3 overs (1 Run) Another run! On the pads, this is worked through square leg for a single. 6.2 overs (2 Runs) Big side and an easy two! On the pads, this is worked through square leg for a couple. 6.1 overs (1 Run) Shorter and on middle, this is pushed down to long on for one. Ravindra Jadeja, the skipper brings himself on. He and Dwayne Bravo are key for Chennai here. 5.6 overs (1 Run) A single to end a very good over by Bravo! This though is a good start from Lucknow Super Giants! They are 55 for 0 after the Powerplay! Fuller and on middle, this is pushed to mid on for one. 5.5 overs (1 Run) Just the one! Outside off, fuller, this is carved ount to deep point for one. Can he end the over well? 5.4 overs (0 Run) ANother dot! This is full and wide outside off. De Kock fails to jam it out. 5.3 overs (0 Run) Another dot! Outside off, fuller, this is hit hard to covers. 5.2 overs (0 Run) DROPPED! That was a sitter. A life to a player you do not want to give one. Fuller and outside off, de Kock hits it hard but straight to Ali who spills it. 5.1 overs (2 Runs) Two more! Outside off, de Kock hits it through covers. Two taken.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843624624584951.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"MSD IPL runs: List of batters with 7000 runs in T20 cricket","link":"https://thesportsrush.com/cricket-news-msd-ipl-runs-list-of-batters-with-7000-runs-in-t20-cricket/","keywords":["Cricket","IPL 2022","csk","IPL","MS Dhoni"],"creator":["Gurpreet Singh"],"video_url":null,"description":"MSD IPL runs: Former CSK skipper played a nice little cameo in the death, to help his side surpass the 200-run mark against LSG in IPL 2022. During the seventh match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings (CSK) and Lucknow Super Giants (LSG), former CSK skipper MS… The post MSD IPL runs: List of batters with 7000 runs in T20 cricket appeared first on The SportsRush.","content":"MSD IPL runs: Former CSK skipper played a nice little cameo in the death, to help his side surpass the 200-run mark against LSG in IPL 2022. During the seventh match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings (CSK) and Lucknow Super Giants (LSG), former CSK skipper MS Dhoni played yet another commendable knock in two consecutive matches. While he smashed a well composed half-century (50* off 38) during IPL 2022 opening match against KKR, he played a lovely little cameo (16* off 6) while coming into bat during the 19th Over. Further asserting his credibility as one of the best finishers to have graced the game, MSD smashed Avesh Khan for a huge six in the very first ball that he faced. He then sliced the ball, towards the backward point region the very next ball. Meanwhile, the 40-year-old added yet another feather in his cap by completing 7,000 runs in the T20 format, in an illustrious career which took off in the year 2006. The moment arrived on the last delivery of the innings, with him hitting Andrew Tye over backward point for a boundary. Thala Takkar Doi! #LSGvCSK #WhistlePodu #Yellove pic.twitter.com/avaufg9YJb — Chennai Super Kings (@ChennaiIPL) March 31, 2022 MSD IPL runs Across the 14 glorious years of his IPL career, MS Dhoni has now scored a total of 4,812 runs in 222 matches (195 innings) at an average of 40.10, and a strike rate of 136.00, with the help of 24 half-centuries. He is presently ranked 8th in the all-time leading run-getters list in IPL history, with Virat Kohli taking the top spot. During his career in the marquee league, Dhoni has played for a couple of franchises in CSK and Rising Pune Super Giants. List of batters with 7000 runs in T20 cricket MS Dhoni, courtesy of today’s cameo, has become the 34th player to complete 7,000 T20 runs in the history of the format. Legendary West Indies batter Chris Gayle, with 14,562 runs, is the leading run-scorer in T20 having played as many as 463 matches in the format. List of batters with 7000 runs in T20 cricket (Top-5) Chris Gayle – 14,562 runs (463 matches) Shoaib Malik – 11,698 runs (472 matches) Kieron Pollard -11,430 runs (582 matches) Aaron Finch – 10,444 runs (347 matches) Virat Kohli – 10,326 runs (328 matches) The post MSD IPL runs: List of batters with 7000 runs in T20 cricket appeared first on The SportsRush.","pubDate":"2022-03-31 16:57:42","full_description":"MSD IPL runs: Former CSK skipper played a nice little cameo in the death, to help his side surpass the 200-run mark against LSG in IPL 2022. During the seventh match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings (CSK) and Lucknow Super Giants (LSG), former CSK skipper MS Dhoni played yet another commendable knock in two consecutive matches. While he smashed a well composed half-century (50* off 38) during IPL 2022 opening match against KKR, he played a lovely little cameo (16* off 6) while coming into bat during the 19th Over. Further asserting his credibility as one of the best finishers to have graced the game, MSD smashed Avesh Khan for a huge six in the very first ball that he faced. He then sliced the ball, towards the backward point region for a Four, the very next delivery. Meanwhile, the 40-year-old added yet another feather in his cap by completing 7,000 runs in the T20 format, in an illustrious career which took off in the year 2006. The moment arrived on the last delivery of the innings, with him hitting Andrew Tye over backward point for a boundary. Thala Takkar Doi! 💥🥳 #LSGvCSK #WhistlePodu #Yellove 🦁💛 pic.twitter.com/avaufg9YJb — Chennai Super Kings (@ChennaiIPL) March 31, 2022 Across the 14 glorious years of his IPL career, MS Dhoni has now scored a total of 4,812 runs in 222 matches (195 innings) at an average of 40.10, and a strike rate of 136.00, with the help of 24 half-centuries. He is presently ranked 8th in the all-time leading run-getters list in IPL history, with Virat Kohli taking the top spot. During his career in the marquee league, Dhoni has played for a couple of franchises in CSK and Rising Pune SuperGiants. MS Dhoni, courtesy of today’s cameo, has become the 34th player to complete 7,000 T20 runs in the history of the format. Legendary West Indies batter Chris Gayle, with 14,562 runs, is the leading run-scorer in T20 having played as many as 463 matches in the format. Chris Gayle – 14,562 runs (463 matches) Shoaib Malik – 11,698 runs (472 matches) Kieron Pollard -11,430 runs (582 matches) Aaron Finch – 10,444 runs (347 matches) Virat Kohli – 10,326 runs (328 matches)","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mott open-minded on men's coaching role","link":"https://thewest.com.au/sport/cricket/mott-open-minded-on-mens-coaching-role-c-6281344","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"Matthew Mott says he's happy within the Australian women's cricket coaching setup, but will keep an open mind to future chances in the men's setup.","content":null,"pubDate":"2022-03-31 16:38:45","full_description":"Australian women's cricket team coach Matthew Mott says he's open to crossing over and the chance to lead Australia's best male cricketers - just not right now. Mott, currently in New Zealand as Australia attempts to win back the Women's World Cup, says on the advice of others he thought about getting involved in the process to replace men's coach Justin Langer. However, the Queenslander is loving life in the women's setup, where he is contracted through to 2023, and in no mood to leave. \"I certainly considered it,\" Mott told AAP. \"The process is down the track and it's not something that I'm going to be involved in at the moment. Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news! \"As a coach, you have to look at the next pathway ... there will always be that 'what's next?' \"But I'm thoroughly enjoying what I'm doing at the moment. \"I don't feel the need to rush off anywhere else.\" Under Mott, Meg Lanning's team has established themselves as the clear world No.1s, with the Ashes, Rose Bowl and T20 World Cup trophies all in their possession. On Sunday, they have the chance to reclaim the ODI World Cup, and in August, they could add Commonwealth Games gold medallists to their resume too. Mott gave short shrift to any who might consider the women's game a less worthy pursuit. \"A lot of people think it's a step up to go into the men's program. I think it's just a step across,\" he said. \"I've been involved with Australia A men's program a couple of times. I've enjoyed my work in there. \"So yeah, I'll keep an open mind. Certainly in the next six to 12 months, whoever takes that (men's coaching) role, there's potentially a reshaping of how it all looks. So a lot to be considered.\" Mott is readying his team for the World Cup final against England, but almost three months into a mammoth tour played in COVID conditions beginning with the Ashes. It's been a slog for everyone, but Mott's love for his current position is evident when asked about the men's role. \"The team's in a sweet spot. We enjoy each other's company and it's not something I want to give up,\" he said. \"We're like family on tour. We look out for each other. \"It's a very special group that we've got that genuinely cares for each other. And that is what I love most about this team.\" Based on his observations of the Pakistan tour, Mott suggested interim coach Andrew McDonald was worthy of the full-time gig. \"That was a massive (Test series) win in Pakistan. We're just so proud of the boys ... incredibly proud of the way they play,\" he said.","image_url":"https://images.thewest.com.au/publication/C-6281344/b7854c2d8409df6ddbb227f64c0bdfe90964cd3d-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mott open-minded on men's coaching role","link":"https://www.perthnow.com.au/sport/cricket/mott-open-minded-on-mens-coaching-role-c-6281305","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"Matthew Mott says he's happy within the Australian women's cricket coaching setup, but will keep an open mind to future chances in the men's setup.","content":null,"pubDate":"2022-03-31 16:37:33","full_description":"Australian women's cricket team coach Matthew Mott says he's open to crossing over and the chance to lead Australia's best male cricketers - just not right now. Mott, currently in New Zealand as Australia attempts to win back the Women's World Cup, says on the advice of others he thought about getting involved in the process to replace men's coach Justin Langer. However, the Queenslander is loving life in the women's setup, where he is contracted through to 2023, and in no mood to leave. \"I certainly considered it,\" Mott told AAP. \"The process is down the track and it's not something that I'm going to be involved in at the moment. \"As a coach, you have to look at the next pathway ... there will always be that 'what's next?' \"But I'm thoroughly enjoying what I'm doing at the moment. \"I don't feel the need to rush off anywhere else.\" Under Mott, Meg Lanning's team has established themselves as the clear world No.1s, with the Ashes, Rose Bowl and T20 World Cup trophies all in their possession. On Sunday, they have the chance to reclaim the ODI World Cup, and in August, they could add Commonwealth Games gold medallists to their resume too. Mott gave short shrift to any who might consider the women's game a less worthy pursuit. \"A lot of people think it's a step up to go into the men's program. I think it's just a step across,\" he said. \"I've been involved with Australia A men's program a couple of times. I've enjoyed my work in there. \"So yeah, I'll keep an open mind. Certainly in the next six to 12 months, whoever takes that (men's coaching) role, there's potentially a reshaping of how it all looks. So a lot to be considered.\" Mott is readying his team for the World Cup final against England, but almost three months into a mammoth tour played in COVID conditions beginning with the Ashes. It's been a slog for everyone, but Mott's love for his current position is evident when asked about the men's role. \"The team's in a sweet spot. We enjoy each other's company and it's not something I want to give up,\" he said. \"We're like family on tour. We look out for each other. \"It's a very special group that we've got that genuinely cares for each other. And that is what I love most about this team.\" Based on his observations of the Pakistan tour, Mott suggested interim coach Andrew McDonald was worthy of the full-time gig. \"That was a massive (Test series) win in Pakistan. We're just so proud of the boys ... incredibly proud of the way they play,\" he said.","image_url":"https://images.perthnow.com.au/publication/C-6281305/b7854c2d8409df6ddbb227f64c0bdfe90964cd3d-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-1-5-updates-2855427","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 16:29:53","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Lucknow Super Giants, chasing a target of 211, are 53/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Chennai Super Kings. Everything related to Lucknow Super Giants and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Chennai Super Kings live score. Do check for Lucknow Super Giants vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) A single to end another good over! On middle, this is flicked but to mid-wicket for one. 4.5 overs (4 Runs) FOUR! In the gap again! Short and on middle, de Kock hammers the pull through square leg for a boundary. 50 up for Lucknow, this is a very good start for them. 4.5 overs (1 Run) WIDE! Goes short but that is very short. Left alone. Wided. 4.4 overs (4 Runs) FOUR! Finds the gap! A full toss on the pads, this is clipped through square leg, it is in the gap and a boundary results. 4.3 overs (1 Run) Fuller and on middle, Rahul works it towards mid on and takes one. 4.2 overs (0 Run) Well fielded! Outside off, Rahul looks to guide it past point but the fielder dives and keeps it down to one. 4.1 overs (4 Runs) FOUR! Put away with disdain! Slightly shorter and Rahul picks the length early, he pulls it over mid-wicket and this one races away to the fence. 3.6 overs (0 Run) A fullish delivery on off. Quinton de Kock drives and drives it well but the fielder at cover-point makes a good stop. 3.5 overs (0 Run) Goes fuller and a bit of pace on this delivery at 138.3 kph, on middle and leg. Quinton de Kock looks to heave it across the line but misses. The ball hits his pads and there is a slight appeal from the bowler but it is going down leg. 3.4 overs (4 Runs) FOUR! Poor delivery and punished! A short delivery and down the leg side. Quinton de Kock pulls it over short fine leg for a boundary. 3.3 overs (4 Runs) FOUR! If this man gets going, it is very hard to stop him. A fullish delivery on off. Quinton de Kock drills it through covers for a boundary. 3.2 overs (0 Run) Good delivery! A good-length delivery, around off and it shapes into Quinton de Kock. He looks to push at it but gets beaten off the inside edge. 3.1 overs (4 Runs) FOUR! Hammered! This is fuller on off. Quinton de Kock plays it on up and smashes it straight down the ground for a boundary. 2.6 overs (2 Runs) 13 runs from the over as Rahul takes a couple from the last ball! Back of a length, on middle. Rahul with a short-arm pull and it goes towards deep backward square leg. The fielder cuts it off and two runs are taken. 2.5 overs (0 Run) A fullish delivery on off. Rahul drives it to mid off this time. 2.4 overs (4 Runs) FOUR! Again width on offer and Rahul punishes it! This is full and outside off. Rahul gets across and slices it over point for a boundary. 2.3 overs (6 Runs) SIX! Here is the first sign of aggression from KL Rahul! This is full and outside off. KL Rahul lifts this over deep extra-cover for a maximum. 86 metres hit over cover! 2.2 overs (0 Run) Back of a length, on off. Rahul defends it towards mid off. 2.1 overs (1 Run) Mukesh Choudhary drifts on the pads. Quinton de Kock works it to mid-wicket for a single. 1.6 overs (0 Run) A good ball to end but an expensive start from Deshpande! Outside off, this one swings away. Rahul looks to push at it but is beaten. 1.5 overs (4 Runs) FOUR LEG BYES! Lucknow won't mind how they come as long as they do! Poor ball! On the pads, Rahul looks to pull but misses, it hits the pad and rolls down to the fine leg fence. 1.4 overs (1 Run) Outside off, de Kock waits and guides it down to third man for one. 1.3 overs (4 Runs) FOUR! De Kock gets it away! His team will hope this gets him going. Shorter and on middle, this is pulled over mid-wicket for a boundary. 1.2 overs (0 Run) Finds the fielder again! Fuller and on off, this is hit hard but to mid off. 1.1 overs (0 Run) Fuller and on off, this is dirven but to mid off. Tushar Deshpande to share the new ball with Mukesh Choudhary. 0.6 over (1 Run) A single to end a tidy first over from Mukesh! Fuller and on middle, this is driven towards mid on for one. 0.5 over (0 Run) Leading edge but safe! Angled into the pads, de Kock closes the face of the bat early, it goes off a soft leading edge to cover. De Kock wants a run but is sent back. 0.4 over (0 Run) Good lines and lengths! Length and on off, de Kock defends. 0.3 over (1 Run) Rahul is off the mark! His first run of this edition! On middle, this is worked through square leg for one. 0.2 over (0 Run) Good start by Mukesh Choudhary! Length and on off, Rahul gets right behind the line and defends. 0.1 over (0 Run) A short one to begin with. Rahul wants a sighter as he leaves it alone.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843607850491871.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK vs LSG Live Score, IPL 2022: Rahul, de Kock take Lucknow to 36/0 in four overs - Sportstar","link":"https://news.google.com/__i/rss/rd/articles/CBMimwFodHRwczovL3Nwb3J0c3Rhci50aGVoaW5kdS5jb20vY3JpY2tldC9pcGwvaXBsLW5ld3MvY3NrLXZzLWxzZy1saXZlLXNjb3JlLWNoZW5uYWktc3VwZXIta2luZ3MtbHVja25vdy1zdXBlci1naWFudHMtaXBsLTIwMjItdG9kYXktbWF0Y2gvYXJ0aWNsZTM4NDY0NTY0LmVjZdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs LSG Live Score, IPL 2022: Rahul, de Kock take Lucknow to 36/0 in four overs  SportstarLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzLSG vs CSK Live Score, IPL 2022: Positive start from KL Rahul, Quinton de Kock in massive 211 chase  Times of IndiaLucknow Super Giants vs Chennai Super Kings Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL 2022 Biggest SIX: Rayudu's SIX almost lands on Marine Drive  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-03-31 16:07:28","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"MS Dhoni 6 first ball: Dhoni hits mammoth six off Avesh Khan in LSG vs CSK IPL 2022 match","link":"https://thesportsrush.com/cricket-news-ms-dhoni-6-first-ball-dhoni-hits-mammoth-six-off-avesh-khan-in-lsg-vs-csk-ipl-2022-match/","keywords":["Cricket","CSK","IPL 2022","Lucknow Super Giants","Videos","chennai super kings","csk","Indian Premier League","LSG","MS Dhoni"],"creator":["Dixit Bhargav"],"video_url":null,"description":"MS Dhoni 6 first ball: The veteran wicket-keeper batter batted at a strike rate of 266.66 at the Brabourne Stadium on Thursday. Former Chennai Super Kings captain Mahendra Singh Dhoni hit a first-ball six in the seventh match of the ongoing 15th season of the Indian Premier League against Lucknow Super Giants at the Brabourne… The post MS Dhoni 6 first ball: Dhoni hits mammoth six off Avesh Khan in LSG vs CSK IPL 2022 match appeared first on The SportsRush.","content":"MS Dhoni 6 first ball: The veteran wicket-keeper batter batted at a strike rate of 266.66 at the Brabourne Stadium on Thursday. Former Chennai Super Kings captain Mahendra Singh Dhoni hit a first-ball six in the seventh match of the ongoing 15th season of the Indian Premier League against Lucknow Super Giants at the Brabourne Stadium to become a source of amazement for one and all. Coming in to bat at No. 7 in the penultimate over, Dhoni didn’t let a short and wide Avesh Khan delivery go waste only to hit it over the cover region for a mammoth six. On the following fuller and wide delivery, Dhoni hit Khan over the vacant backward point region for a boundary to further worsen his figures. The next delivery saw Dhoni swinging the bat hard in order to hit his third consecutive boundary but it wasn’t to be because of the slow pace on the ball. Dhoni’s third boundary eventually came on the last delivery of the innings when he hit a full and wide Andrew Tye delivery for a boundary through the third-man area. Dhoni, 40, followed his 28th T20 half-century with 16* (6) comprising of two fours and a six tonight to provide Super Kings with a final push towards their journey of scoring 210/7 in 20 overs after Super Giants captain KL Rahul invited won the toss and chose to bowl. A stroke-filled innings, CSK crossed the 200-run mark on the back of vital contributions from opening batter Robin Uthappa (50) and all-rounder Shivam Dube (49). While Uthappa hit eight fours and a six at a strike rate of 185.18, Dube hit five fours and two sixes at a strike rate of 163.33. MS Dhoni 6 first ball vs LSG #Mahi maar raha hai pic.twitter.com/JVTG0wYjao — Sports Hustle (@SportsHustle3) March 31, 2022 Twitter reactions on MS Dhoni: Thala Takkar Doi! #LSGvCSK #WhistlePodu #Yellove pic.twitter.com/avaufg9YJb — Chennai Super Kings (@ChennaiIPL) March 31, 2022 Dhoni – first ball six. Once a king, always the king. — Siddarth Srinivas (@sidhuwrites) March 31, 2022 MS Dhoni completes 7,000 runs in T20 cricket. 166 sixes in 16-20 Overs . One of the best finishers ! pic.twitter.com/qtuYhxtThl — Karthigaichelvan S (@karthickselvaa) March 31, 2022 For more cricket-related news, click here. The post MS Dhoni 6 first ball: Dhoni hits mammoth six off Avesh Khan in LSG vs CSK IPL 2022 match appeared first on The SportsRush.","pubDate":"2022-03-31 16:04:25","full_description":"MS Dhoni 6 first ball: The veteran wicket-keeper batter batted at a strike rate of 266.66 at the Brabourne Stadium on Thursday. Former Chennai Super Kings captain Mahendra Singh Dhoni hit a first-ball six in the seventh match of the ongoing 15th season of the Indian Premier League against Lucknow Super Giants at the Brabourne Stadium to become a source of amazement for one and all. Coming in to bat at No. 7 in the penultimate over, Dhoni didn’t let a short and wide Avesh Khan delivery go waste only to hit it over the cover region for a mammoth six. On the following fuller and wide delivery, Dhoni hit Khan over the vacant backward point region for a boundary to further worsen his figures. The next delivery saw Dhoni swinging the bat hard in order to hit his third consecutive boundary but it wasn’t to be because of the slow pace on the ball. Dhoni’s third boundary eventually came on the last delivery of the innings when he hit a full and wide Andrew Tye delivery for a boundary through the third-man area. Dhoni, 40, followed his 28th T20 half-century with 16* (6) comprising of two fours and a six tonight to provide Super Kings with a final push towards their journey of scoring 210/7 in 20 overs after Super Giants captain KL Rahul invited won the toss and chose to bowl. A stroke-filled innings, CSK crossed the 200-run mark on the back of vital contributions from opening batter Robin Uthappa (50) and all-rounder Shivam Dube (49). While Uthappa hit eight fours and a six at a strike rate of 185.18, Dube hit five fours and two sixes at a strike rate of 163.33. #Mahi maar raha hai pic.twitter.com/JVTG0wYjao — Sports Hustle (@SportsHustle3) March 31, 2022 Thala Takkar Doi! 💥🥳 #LSGvCSK #WhistlePodu #Yellove 🦁💛 pic.twitter.com/avaufg9YJb — Chennai Super Kings (@ChennaiIPL) March 31, 2022 Dhoni – first ball six. Once a king, always the king. — Siddarth Srinivas (@sidhuwrites) March 31, 2022 MS Dhoni completes 7,000 runs in T20 cricket. 166 sixes in 16-20 Overs . One of the best finishers ! pic.twitter.com/qtuYhxtThl — Karthigaichelvan S (@karthickselvaa) March 31, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"LSG vs CSK, IPL 2022: MS Dhoni becomes 6th Indian to score 7000 runs in T20 cricket","link":"https://www.indiatoday.in/sports/cricket/story/lsg-vs-csk-ipl-2022-ms-dhoni-becomes-6th-indian-to-score-7000-runs-in-t20-cricket-1931947-2022-03-31?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"LSG vs CSK: MS Dhoni becomes 6th Indian to score 7000 T20 runs","content":null,"pubDate":"2022-03-31 15:51:13","full_description":"Chennai Super Kings star wicketkeeper-batter MS Dhoni added another feather to his already decorated cap on Thursday as he became the sixth Indian to score 7000 runs in T20 cricket during the Indian Premier League (IPL) 2022 match against Lucknow Super Giants in Mumbai. Virat Kohli, Rohit Sharma, Suresh Raina, Shikhar Dhawan and Robin Uthappa are the other five Indian batters to achieve the landmark in T20 cricket. Dhoni joined an exclusive list of cricketers to have achieved the feat before him. Dhoni needed 15 before the start of CSK's match against LSG to get to the milestone. Dhoni has now scored over 7000 runs in 349 T20 matches. He has 0 hundred and 28 fifties in the shortest format of the game. LSG vs CSK, IPL 2022 match: Live Score and Updates Dhoni walked out to bat after Shivam Dube's departure and smashed Avesh Khan for a six and a boundary on back-to-back deliveries in the 19th over. Dhoni breached the 7000-run mark with a boundary off the last delivery as CSK posted 210 after being put to bat. West Indies superstar Chris Gayle leads the all-time list of most run-getters in T20 cricket. Gayle has amassed 14,562 runs in the T20s. Shoaib Malik of Pakistan is in second, Gayle's compatriot Kieron Pollard is second on the list while Australia's Aaron Finch is in the fourth spot in the men's T20s. MS Dhoni showed signs of his vintage self when he scored his first IPL fifty in the last three seasons in the first match of IPL 2022, but his team Chennai Super Kings (CSK) suffered a defeat at the hands of Kolkata Knight Riders. A top-order collapse meant Dhoni and captain Ravindra Jadeja had to bide their time before going for the big hits, but the former India captain's return to run-scoring form will be a huge relief for the camp. The Ravindra Jadeja-led side will be hoping to pick up their first points at the Brabourne Stadium when they meet with Lucknow Super Giant on Thursday. Live TV Also Read | IPL 2022: Fit-again Suryakumar Yadav joins Mumbai Indians ahead of Rajasthan Royals clash","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-16-20-updates-2855309","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 15:35:55","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, Chennai Super Kings are 210/7. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Chennai Super Kings. Everything related to Lucknow Super Giants and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Chennai Super Kings live score. Do check for Lucknow Super Giants vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. A strong batting performance by Chennai on this very good batting strip. They started off with a bang and once they got that start, 200 was always on the cards. Lucknow have a tough task ahead of them but they have the batting arsenal and conditions are quite favourable for batting. However, they need their top order to fire today. 19.6 overs (4 Runs) FOUR! A boundary to end the innings which means Chennai end with 210! This is full and wide outside off, Dhoni carves it over point and it races away. The last ball spoils the last over, 11 from it. 19.5 overs (2 Runs) Just the two! A full toss outside off, Dhoni lifts it over cover for two. He did not look to hit that hard, just tried to time it. 19.4 overs (1 Run) No hat-trick but only one! On middle, this is woked through mid-wicket for one. Review time! A huge appeal for an LBW is turned down. Seems to be going down leg. 19.3 overs (0 Run) NOT OUT! Three reds! Another successful review by Lucknow and this is a brilliant last over by Tye so far. Two wickets after going for a boundary! This is full and on the leg pole. Dwaine Pretorius looks to flick but misses. He gets hit on the pads. An appeal but turned down. Lucknow review again. Three reds. Tye on a hat-trick. 19.2 overs (0 Run) OUT! TAKEN! Tye has his first! Jadeja will be disappointed he could not get that away! It was a full toss on the pads, this is whipped in the air and towards deep mid-wicket. Manish Pandey takes another good catch running to his right. Can Lucknow keep them under 210 now? 19.1 overs (4 Runs) FOUR! Finds the gap and the 200 is up! A full toss on middle, this is heaved through mid-wicket, in the gap and races away to the fence. 18.6 overs (0 Run) Two dots to end! Not a bad over to be honest. Despite a biggie and a boundary, 11 from it and a wicket. Shorter and outside off, Dhoni swings but misses. 18.5 overs (0 Run) Swing and a miss! Outside off, slower one. Dhoni swings but misses. 18.4 overs (4 Runs) FOUR! Carves it over! Poor from Avesh! That is not the line you want to bowl with point and third man up. Outside off, fuller, this is carved over point. 10 from the two balls faced by Dhoni. 18.3 overs (6 Runs) SIX! Over the fence! Dhoni wastes no time! That is a brute of a shot! Shorter and outside of, this is slammed over the point fence for a biggie. That is another massive hit. Shades of the old Dhoni there. MS Dhoni walks out to bat now! Can he roll back the years and help Chennai finish on a high? 18.2 overs (0 Run) OUT! TAKEN! That is a brilliant catch! Never easy when it goes so high and with the lights on. Brilliant from Lewis. End of a superb knock from Dube, he deserved a half ton but falls one short of it. Fuller and on middle, Dube looks to go over mid-wicket but hits it high up in the air, Lewis at deep md-wicket runs to his right and takes it with a slide. He does indicate he lost it in the lights so does well to hang on. Can Lucknow finish well now? 18.1 overs (1 Run) Bowling to his field! Full and outside off, this is carved towards deep point for one. 17.6 overs (2 Runs) Longer side so two more! Fuller and on middle, Dube swings, it goes off the inner half through square leg for two. Another big over for Chennai. 220 is possible now. 17.5 overs (6 Runs) SIX! That is massive! Oh my! What a shot! Shorter and on the body, this is pulled and it sails over the square leg fence. 17.4 overs (1 Run) A low full toss, this is hit down to long on for one. 17.3 overs (2 Runs) Good placement again! Shorter and on off, Jadeja pushes it wide of sweeper cover. Takes two. 17.2 overs (4 Runs) FOUR! That is not the line you want to bowl with mid-wicket up! Short and on middle, this is pulled over mid-wicket. Boundary! Jadeja has two boundaries in 4 balls. 17.1 overs (1 Run) Goes short and on the body, Dube mistimes the pull down to fine leg for one. 16.6 overs (4 Runs) FOUR! Boundary to end the great spell by Ravi Bishnoi! A fuller delivery on off. Jadeaja drills it to long off for a boundary. Good shot by the skipper. 16.5 overs (0 Run) A googly this time, it is around off. Jadeja looks to cut it but misses. Dot ball! 16.4 overs (1 Run) Goes fuller on off. Dube drills it to long off. Hooda does well in the deep and keeps it to just a single. 16.3 overs (1 Run) Flatter and shorter around off. Jadeja cuts it hard to sweeper cover for a single. Ravindra Jadeja is the next man in. 16.2 overs (0 Run) OUT! BOLWED! Ravi Bishnoi has been the shining light for Lucknow today! This is pushed quicker and flatter and it skids through. Ambati Rayudu dances down the track and looks to heave it across the line. He misses it completely and the ball shatters the stumps. Second wicket for Ravi Bishnoi and end of a fine knock from Ambati Rayudu. 16.1 overs (4 Runs) FOUR LEG BYES! This is unlucky for the bowler but that's the way this game goes! A fuller delivery, around off. Ambati Rayudu goes for a big slog-sweep but misses. The ball brushes his pads and goes towards the third man fence for a boundary. 15.6 overs (2 Runs) Two more to end a huge over for Chennai! A low full toss on the pads, this is worked wide of long on for two. 15.5 overs (1 Run) Angled into the pads, Rayudu looks to flick but misses. It hits the pad and rolls on the leg side. A run taken. 15.4 overs (6 Runs) SIX! That is massive, that is massive! Lovely use of the feet, Krunal slows it up and bowls it around off, Rayudu gets to the pitch of it and nails it over the long on fence. There seems to be some problem with the ball! We have a change of ball now and all set to resume now. 15.3 overs (1 Run) DROPPED! Dushmantha Chameera is having a poor day in the field! This is a high full toss on the pads, not high enough to be called a no all. Dube looks to pull, it goes off the inner half to short fine leg where it is dropped. This could prove costly. Dube is in some form here. A single taken. 15.2 overs (4 Runs) FOUR! Dube is in his elements here today! Outside off, this is powered through covers. The fielder in the deep runs to his right and dives but his effort goes in vain. 15.1 overs (1 Run) On middle, this is worked through square leg for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843575475871708.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs CSK Live Score: Shivam Dube Departs, Ravindra Jadeja Eyes Strong Finish For CSK vs LSG - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWxzZy12cy1jc2stbGl2ZS1zY29yZS11cGRhdGVzLXN1cGVyLWdpYW50cy12cy1zdXBlci1raW5ncy1saXZlLXNjb3JlLTI4NTQ3NDbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs CSK Live Score: Shivam Dube Departs, Ravindra Jadeja Eyes Strong Finish For CSK vs LSG  NDTV SportsLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzLSG vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorLive match blog - Super Kings vs Super Giants 7th Match 2022 - Cricket Insights  ESPNcricinfoLSG vs CSK Live Score, IPL 2022: Rayudu falls but Dube solid as Chennai eye big finish  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-03-31 15:29:11","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-11-15-updates-2855231","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 15:09:54","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Chennai Super Kings are 152/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Chennai Super Kings. Everything related to Lucknow Super Giants and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Chennai Super Kings live score. Do check for Lucknow Super Giants vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) A leg bye to end another good over for the batting side! Angled into the pads, Rayudu looks to flick but misses. It hits the pad and lobs on the off side. A leg bye taken. 14.5 overs (6 Runs) SIX! Rayudu hits it well enough! For a second Lewis might have thought he had a chance. Shorter as he sees Rayudu come down the track. He slams it over the long on fence. 14.4 overs (1 Run) On the bounce! Shorter and on middle, this is pulled towards deep mid-wicket for one. 14.3 overs (0 Run) Superb from Tye! Shorter and on off, hurries Dube who ends up hitting it to the right of the bowler. Tye dives and saves a run. 14.2 overs (1 Run) Just the one! On middle, this is worked through mid-wicket for one. Singles won't harm Lucknow. 14.1 overs (1 Run) Another slower one, this is pushed to cover for one. 14.1 overs (1 Run) WIDE! That does not come out right, looks to bowl a slower one but does so well wide outside off. Left alone. DRINKS! Lucknow has managed to control the scoring-rate a bit by taking couple of wickets but Chennai are still in the driver's seat. They are going at almost 10 runs an over and Lucknow need good last 6 overs to restrict Chennai under 200 here. Plenty of firepower to follow and Chennai will be disappointed if they don't cross 200 mark from hereon on this very good batting turf. 13.6 overs (1 Run) A fuller delivery on middle. Dube hits it hard to wide long on for a single. 13.5 overs (1 Run) Ambati Rayudu dances down the track and Pandya fires it on middle and leg. Ambati Rayudu looks to defend it but gets the inside edge onto his pads. The ball goes towards short third man for a single. 13.4 overs (0 Run) A flatter and quciker one on middle. Ambati Rayudu looks to drive but mistimes it towards the leg side. 13.3 overs (1 Run) A fuller delivery on middle. Dube works it to deep mid-wicket for a single. 13.3 overs (1 Run) WIDE! Pandya tries to push it quicker. It is way outside off and Dube leaves it alone. 13.2 overs (1 Run) Ambati Rayudu skips down the track and Pandya drags it slightly short. Ambati Rayudu works it to deep square leg for a single. 13.1 overs (1 Run) A low full toss on middle. Dube hits it to wide long on for a single. 12.6 overs (1 Run) Goes quicker and bit shorter on off. Dube knocks it down to long off and retains a single. 12 runs from the over! 12.5 overs (0 Run) A flatter and quicker delivery, around off. Dube looks to cut but mistimes it. 12.4 overs (0 Run) Slower again and around off. Dube defends it with soft hands towards point. 12.3 overs (6 Runs) SIX! This is the power of Shivam Dube! Tossed up and fuller on off. Dube gets under it and tonks it straight down the ground for a biggie. 12.2 overs (4 Runs) FOUR! Another misfield and another boundary! Short and outside off. Dube cuts it hard towards sweeper cover and the fielder covers the ground but slips at the last moment. The ball goes through him for a boundary. 12.1 overs (1 Run) Goes fuller on middle. Ambati Rayudu pushes it to long on for a single. 11.6 overs (0 Run) A quicker delivery around off and it's a googly. Dube looks to defend it but the ball turns and beats the outside edge of his blade. 11.5 overs (1 Run) On middle and fuller. Ambati Rayudu sweeps it towards deep backward square leg. Krunal Pandya there runs forward and dives but the ball falls just short of him. A single taken. Good effort by Krunal Pandya though. 11.4 overs (4 Runs) FOUR! Ohh...the pressure was just building and now the misfield allows a boundary! A fuller delivery, around off. Ambati Rayudu drives it to deep cover. Dushmantha Chameera runs to his right but ends up misjudging it and the ball races away towards the fence. 11.3 overs (0 Run) Fuller, outside off. Ambati Rayudu does not use his feet and looks to hit it away but misses. 11.2 overs (0 Run) Dot ball! A flatter delivery and slightly shorter on off. Ambati Rayudu punches it to covers. 11.1 overs (1 Run) Quicker and fuller on off. Dube drives it to covers for a single. 10.6 overs (1 Run) On the shorter side again, around off. Dube steers it towards third man for a single. Good over by Avesh Khan. 10.5 overs (1 Run) Back of a length, around off. Ambati Rayudu steers it towards third man for a single. 10.4 overs (4 Runs) FOUR! Ambati Rayudu now gets off the mark with a boundary! Lovely shot. It is short, around off. Ambati Rayudu waits for it and just guides it fine towards the third man fence for a boundary. 10.3 overs (0 Run) Nails a yorker on off. Ambati Rayudu digs it out. 10.2 overs (0 Run) A good-length delivery, around off. Ambati Rayudu leaves it alone. Ambati Rayudu walks out to bat! 10.1 overs (0 Run) OUT! BOWLED! What an inspired bowling change by KL Rahul! Avesh Khan has been expensive today but gets a big fish now! Lands on a length, on off. Moeen Ali goes for a big heave across the line but misses. The ball shatters the stumps and Avesh Khan is pumped up. So two set batters gone now and this is an opportunity for Lucknow to get back in this game.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843559866576919.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Wankhede Stadium pitch report for KKR vs PBKS match 2022: Wankhede Stadium capacity and boundary size","link":"https://thesportsrush.com/cricket-news-wankhede-stadium-pitch-report-for-kkr-vs-pbks-match-2022-wankhede-stadium-capacity-and-boundary-size/","keywords":["Cricket","IPL 2022","KKR","Punjab Kings","IPL","KKR vs PBKS","PBKS","Wankhede Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Wankhede Stadium pitch report for KKR vs PBKS match 2022: The stadium would host its third match of the ongoing IPL season on Friday. The eighth match of the ongoing 15th season of the Indian Premier League (IPL) would feature the previous season finalist Kolkata Knight Riders (KKR) take on the Punjab Kings (PBKS) at… The post Wankhede Stadium pitch report for KKR vs PBKS match 2022: Wankhede Stadium capacity and boundary size appeared first on The SportsRush.","content":"Wankhede Stadium pitch report for KKR vs PBKS match 2022: The stadium would host its third match of the ongoing IPL season on Friday. The eighth match of the ongoing 15th season of the Indian Premier League (IPL) would feature the previous season finalist Kolkata Knight Riders (KKR) take on the Punjab Kings (PBKS) at the iconic Wankhede Stadium in Mumbai. Both the teams kick-started their tournament run with comprehensive victories under their belt. While KKR beat the previous season champions Chennai Super Kings (CSK) by 6 wickets, the PBKS got the better of Royal Challengers Bangalore (RCB) in a high-scoring encounter by 5 wickets. The ‘Mum’boy made heads turn at his home ground with a solid performance for #KKR in the #IPL2022 season opener. We congratulate #AjinkyaRahane & his Mumbai teammate, #ShreyasIyer, for kicking off the season with a solid win. #MCA #Mumbai #Wankhede #BCCI #TATAIPL #CSKvKKR pic.twitter.com/1tjbNNxhIc — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) March 27, 2022 While KKR have already played the opening match of the season at the Wankhede, PBKS would play their first match at this venue. For those unaware, the stadium would host a total of 20 of the 70 league matches during the ongoing season, with each teams slated to play four matches each at the venue. Wankhede Stadium pitch report for KKR vs PBKS match 2022 The Red soil pitch at the Wankhede means that the surface would likely be prone to wear and tear as the matches progress at the venue. However, the initial few matches on the fresh pitches here would have enough carry and bounce for the pacers to exploit. Thus, the KKR vs PBKS encounter is also likely to assist the pacers upfront, where the likes of Umesh Yadav, Tim Southee, Odean Smith et al would look to provide vital breakthroughs upfront, before the dew makes an appearance. Having said that, the nature of the pitch would suit the batters in tomorrow’s encounter as well, once they negate the pacer advantage early on in the innings. The average first innings total at this venue before the start of IPL 2022 was 175. With chasing teams winning 12 of the past 15 night games at this venue, expect the team winning the Toss to have an advantage before the match commences. Wankhede Stadium capacity and boundary size The stadium seating capacity of the Wankhede Stadium is 32,000. However, with crowds to the tune of mere 25% seating capacity allowed to witness the initial matches of the IPL league stage, the stadium would take in an approximate 9,800-10,000 spectators during tomorrow’s match between KKR and PBKS. With relatively smaller boundaries at the venue, the size of the same is less than 70m across dimensions, with the square boundaries’ length likely to vary with each encounter as they would be played across five pitches adjacent to each other. The post Wankhede Stadium pitch report for KKR vs PBKS match 2022: Wankhede Stadium capacity and boundary size appeared first on The SportsRush.","pubDate":"2022-03-31 14:57:29","full_description":"Wankhede Stadium pitch report for KKR vs PBKS match 2022: The stadium would host its third match of the ongoing IPL season on Friday. The eighth match of the ongoing 15th season of the Indian Premier League (IPL) would feature the previous season finalist Kolkata Knight Riders (KKR) take on the Punjab Kings (PBKS) at the iconic Wankhede Stadium in Mumbai. Both the teams kick-started their tournament run with comprehensive victories under their belt. While KKR beat the previous season champions Chennai Super Kings (CSK) by 6 wickets, the PBKS got the better of Royal Challengers Bangalore (RCB) in a high-scoring encounter by 5 wickets. The ‘Mum’boy made heads turn at his home ground with a solid performance for #KKR in the #IPL2022 season opener. 🤩 We congratulate #AjinkyaRahane & his Mumbai teammate, #ShreyasIyer , for kicking off the season with a solid win. 🙌 #MCA #Mumbai #Wankhede #BCCI #TATAIPL #CSKvKKR pic.twitter.com/1tjbNNxhIc — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) March 27, 2022 While KKR have already played the opening match of the season at the Wankhede, PBKS would play their first match at this venue. For those unaware, the stadium would host a total of 20 of the 70 league matches during the ongoing season, with each teams slated to play four matches each at the venue. The Red soil pitch at the Wankhede means that the surface would likely be prone to wear and tear as the matches progress at the venue. However, the initial few matches on the fresh pitches here would have enough carry and bounce for the pacers to exploit. Thus, the KKR vs PBKS encounter is also likely to assist the pacers upfront, where the likes of Umesh Yadav, Tim Southee, Odean Smith et al would look to provide vital breakthroughs upfront, before the dew makes an appearance. Having said that, the nature of the pitch would suit the batters in tomorrow’s encounter as well, once they negate the pacer advantage early on in the innings. The average first innings total at this venue before the start of IPL 2022 was 175. With chasing teams winning 12 of the past 15 night games at this venue, expect the team winning the Toss to have an advantage before the match commences. The stadium seating capacity of the Wankhede Stadium is 32,000. However, with crowds to the tune of mere 25% seating capacity allowed to witness the initial matches of the IPL league stage, the stadium would take in an approximate 9,800-10,000 spectators during tomorrow’s match between KKR and PBKS. With relatively smaller boundaries at the venue, the size of the same is less than 70m across dimensions, with the square boundaries’ length likely to vary with each encounter as they would be played across five pitches adjacent to each other.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa retirement: Has Robin Uthappa retired from international cricket?","link":"https://thesportsrush.com/cricket-news-robin-uthappa-retirement-has-robin-uthappa-retired-from-international-cricket/","keywords":["Cricket","CSK","IPL 2022","Lucknow Super Giants","chennai super kings","csk","Indian Premier League","LSG","Robin Uthappa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Robin Uthappa retirement: The veteran Indian batter is literally calling the shots at the Brabourne Stadium tonight. Chennai Super Kings batter Robin Uthappa has grabbed the opportunity of opening the batting in the seventh match of the ongoing 15th season of the Indian Premier League with both hands. Uthappa, who had mostly batted at No.… The post Robin Uthappa retirement: Has Robin Uthappa retired from international cricket? appeared first on The SportsRush.","content":"Robin Uthappa retirement: The veteran Indian batter is literally calling the shots at the Brabourne Stadium tonight. Chennai Super Kings batter Robin Uthappa has grabbed the opportunity of opening the batting in the seventh match of the ongoing 15th season of the Indian Premier League with both hands. Uthappa, who had mostly batted at No. 3 in his limited appearances for Super Kings until tonight, hit two eye-catching boundaries on the first two balls of the match to set the ball rolling with respect to his batting promotion. Facing Sri Lanka fast bowler Dushmantha Chameera in the second over, Uthappa hit a six and four to provide signs of making no mistake regarding his timing at the Brabourne Stadium tonight. With Lucknow Super Giants captain KL Rahul giving another over to Avesh Khan in the powerplay, Uthappa hit another four and six to not let Super Kings feel the impact of Ruturaj Gaikwad’s (1) early departure. Returning to the IPL after a couple of years, LSG fast bowler Andrew Tye was welcomed with four boundaries in his first over for the franchise as CSK crossed the 50-run mark in the fifth over. Robin Uthappa retirement Eighth-highest run-scorer in the IPL, Uthappa registered a 25-ball half-century in the eighth over. In what is his 26th half-century in the biggest T20 league across the globe, it is his only his second for Chennai. It was in the same over that Uthappa was found wanting in front of the stumps by Lucknow spinner Ravi Bishnoi. The 36-year old player returned to the pavilion after scoring a stroke-filled 50 (27) with the help of eight fours and a six. VINTAGE ROBBIE! It is to our ears when Uthappa’s willow meets the ball. He departs for a well-deserved fifty! IPL • #RobinUthappa #CSKvLSG #LSGvCSK #IPL #IPL2022 #TATAIPL #BharatArmy pic.twitter.com/6SeL0pVFup — The Bharat Army (@thebharatarmy) March 31, 2022 Uthappa, who had played the last of his 59 white-ball matches for India during the tour of Zimbabwe seven years ago, hasn’t retired from international cricket as of now. Uthappa, who currently represents Kerala in domestic cricket after a glorious career with Karnataka, is a supporter of BCCI (Board of Control for Cricket in India) allowing non-contracted cricketers to play in overseas leagues. The post Robin Uthappa retirement: Has Robin Uthappa retired from international cricket? appeared first on The SportsRush.","pubDate":"2022-03-31 14:46:28","full_description":"Robin Uthappa retirement: The veteran Indian batter is literally calling the shots at the Brabourne Stadium tonight. Chennai Super Kings batter Robin Uthappa has grabbed the opportunity of opening the batting in the seventh match of the ongoing 15th season of the Indian Premier League with both hands. Uthappa, who had mostly batted at No. 3 in his limited appearances for Super Kings until tonight, hit two eye-catching boundaries on the first two balls of the match to set the ball rolling with respect to his batting promotion. Facing Sri Lanka fast bowler Dushmantha Chameera in the second over, Uthappa hit a six and four to provide signs of making no mistake regarding his timing at the Brabourne Stadium tonight. With Lucknow Super Giants captain KL Rahul giving another over to Avesh Khan in the powerplay, Uthappa hit another four and six to not let Super Kings feel the impact of Ruturaj Gaikwad’s (1) early departure. Returning to the IPL after a couple of years, LSG fast bowler Andrew Tye was welcomed with four boundaries in his first over for the franchise as CSK crossed the 50-run mark in the fifth over. Eighth-highest run-scorer in the IPL, Uthappa registered a 25-ball half-century in the eighth over. In what is his 26th half-century in the biggest T20 league across the globe, it is his only his second for Chennai. It was in the same over that Uthappa was found wanting in front of the stumps by Lucknow spinner Ravi Bishnoi. The 36-year old player returned to the pavilion after scoring a stroke-filled 50 (27) with the help of eight fours and a six. 🤩💛 VINTAGE ROBBIE! It is 🎶 to our ears when Uthappa’s willow meets the ball. 👏 He departs for a well-deserved fifty! 📸 IPL • #RobinUthappa #CSKvLSG #LSGvCSK #IPL #IPL2022 #TATAIPL #BharatArmy pic.twitter.com/6SeL0pVFup — The Bharat Army (@thebharatarmy) March 31, 2022 Uthappa, who had played the last of his 59 white-ball matches for India during the tour of Zimbabwe seven years ago, hasn’t retired from international cricket as of now. Uthappa, who currently represents Kerala in domestic cricket after a glorious career with Karnataka, is a supporter of BCCI (Board of Control for Cricket in India) allowing non-contracted cricketers to play in overseas leagues .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-chennai-super-kings-live-score-over-match-7-t20-6-10-updates-2855172","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-31 14:46:03","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.0 overs, Chennai Super Kings are 106/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Chennai Super Kings. Everything related to Lucknow Super Giants and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Chennai Super Kings live score. Do check for Lucknow Super Giants vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) 1 run. 9.5 overs (0 Run) BEATEN! Lovely from Moeen again! This lands on off and then turns away. Moeen plays inside the line and the ball whizzes past the outside edge. 9.4 overs (1 Run) Outside off, this is pushed through covers for one. 9.3 overs (1 Run) That should not have been a run! On off, yet again a googly, Moeen looks to defend but it goes off the outside edge to short third man. A single. The fielder was on his heels there. 9.2 overs (0 Run) BEATEN! Another good, this lands on off and spins away. Ali looks to push at it but is beaten. 9.1 overs (4 Runs) FOUR! Fortunate runs! This lands outside off and spins away a touch. Moeen looks to push at it, it goes off the outside edge down to third man. 100 up and in no time. 230 is on the cards here. 8.6 overs (0 Run) Almost chops it on! Shorter and outside off, Dube looks to cut but gets an underedge on the off side. A dot to end but the damage was done earlier on. 8.5 overs (4 Runs) FOUR! That is timed wonderfully! On a length and around off, this is sliding onto the bat nicely, Dube times it through covers, it races away to the fence. Third boundary in the over. 8.4 overs (0 Run) Fuller and on middle, Dube jams it out to mid on. 8.3 overs (4 Runs) FOUR! That is some shot! Just used the pace! He loves width on offer! Full and outside off, he times it over cover for a boundary. 8.2 overs (4 Runs) FOUR! The direction was poor there! Short and down the leg side, Dube helps it on it way towards fine leg. The fielder runs to his left and dives but his effort goes in vain. 8.1 overs (0 Run) Short! Dube is not comfortable with that delivery. He fends it away. Dushmantha Chameera to continue. He will bowl his third over now. 7.6 overs (0 Run) A dot to end a good over by Ravi! A much-needed one for his side. On the pads, this is worked to short fine leg. 7.5 overs (2 Runs) Easy two! On middle, this is worked through wide mid on. Two taken. 7.4 overs (1 Run) Dube is off the mark, flatter and outside off, this is pushed through covers for one. Shivam Dube is the next man in. 7.3 overs (0 Run) OUT! THREE REDS AND UTHAPPA IS A GONER! Huge wicket as he was taking the game away. Welcome wicket for Lucknow and it is Bishnoi, who had a poor game last time around who provides the breakthrough. This lands on middle, it straightens and skids through. Uthappa goes back to flick but is late in getting his bat down. It hits the pad. A huge appeal but turned down. Reviewed and replays show that the on-field call has to be overturned. A good innings by Uthappa, he has done his job. Can Lucknow crawl back into the game now? 7.2 overs (0 Run) Flatter and on off, this is guided to point. 7.1 overs (2 Runs) Fifty for Uthappa! He has really done well for Chennai since they have included him in the side in the last edition. Gets there by working this fine on the leg side for two. It's time for Ravi Bishnoi to show his skills now. He is into the attack. 6.6 overs (1 Run) A single to end the over then! On middle, slower one. Robin Uthappa flicks it through mid-wicket for one. 6.5 overs (1 Run) Follows the boundary with a run as this is pushed down to long on. 6.4 overs (4 Runs) FOUR! That is wonderful timing again! A boundary is coming almost every over! Length and on off, this is stroked througyh covers and this one races away to the fence. 6.3 overs (1 Run) Another run! On off, this is pushed through covers for one. 6.2 overs (1 Run) Half stop! A good stop though! On off, this is timed well towards cover. The fielder dives to his left and makes a wonderful stop. Just a run. 6.1 overs (1 Run) Good length and on off, this is guided down to third man for one. Drinks! A much-needed break for Lucknow! What a Powerplay this has been for Chennai, Robin Uthappa is looking like a man on a mission and has smashed Lucknow bowlers all over the park so far. Lucknow has got the wicket of Ruturaj Gaikwad courtesy of a brilliant piece of fielding by Ravi Bishnoi but Moeen Ali has walked out at number 3 and has started smashing it from the word go. Lucknow need wickets and need them quickly to restrict Chennai to a reasonable total. Dushmantha Chameera is back on. He went for 12 runs in his first over. 5.6 overs (4 Runs) FOUR! Moeen Ali is playing with the field here! The square leg was pushed back and the mid-wicket was got in. This is bowled shorter. Ali goes back and pulls it over mid-wicket for a boundary. A solid end to a solid Powerplay for Chennai. 5.5 overs (6 Runs) SIX! BANG! That hits the cushions on the full! Another biggie! On middle, the slog sweep is out, this is hit over square leg and it hits the cushion on the full. 5.4 overs (4 Runs) FOUR! That is timed wonderfully. On off, flatter, this is driven beautifully through covers. Races away. Chennai are oin a roll here. 5.3 overs (0 Run) Fires it on the pads, this is worked to square leg. 5.2 overs (1 Run) Angled into the pads, this is worked through mid-wicket for one. 5.1 overs (1 Run) Flatter and on middle, this is worked through mid-wicket for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637843545552966299.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Ramesh Powar’s term ends, NCA head Laxman may play bigger role in women’s cricket","link":"https://indianexpress.com/article/sports/cricket/ramesh-powar-term-ends-vvs-laxman-womens-cricket-7846647/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-31 14:08:33","full_description":"Indian women’s team head coach Ramesh Powar’s contract has expired at the conclusion of the side’s campaign in the ICC World Cup and he might have to reapply for the post as per BCCI rules. The disastrous World Cup campaign could also lead to a radical shift in women’s cricket, with National Cricket Academy (NCA) head VVS Laxman taking an active part in mentoring the next batch of the country’s cricketers. The team failed to make the semifinals of the ongoing tournament. Powar had replaced WV Raman, who had guided the team into the T20 World Cup final in 2020. https://images.indianexpress.com/2020/08/1x1.png “Powar’s contract was till World Cup. There is no provision for extension. So the entire process starts with applications and interviews. Powar can certainly reapply and CAC (Cricket Advisory Committee), as per the constitution, will take a call,” a senior BCCI source told PTI on the condition of anonymity. Eyebrows were raised after Raman wasn’t given a second term after a good show with the team and Powar, who had a chequered history with skipper Mithali Raj, was brought back. “The CAC takes the call and if they felt Ramesh would do better than Raman, it was their call. The board can’t interfere,” the source said. As PTI reported at the end of India’s campaign in New Zealand, there were serious differences of opinions between two senior players, who have been at loggerheads for years now. It is understood that Powar did precious little to defuse the tension between the warring duo, and it now remains to be seen if he gets his contract renewed. Also, there is nothing to write home about Powar’s performance in the two stints with the team, especially the current one when India lost every series under his stewardship before their unceremonious exit from the showpiece. Laxman to have bigger say ================ With the inaugural U-19 women’s T20 World Cup scheduled next year, the BCCI is keen on preparing the next batch of players, with Laxman playing a bigger role in formulating a model for long-term success. One of the major concerns is finding veteran fast bowler Jhulan Goswami’s replacement. “Even if you move past Mithali, in case of Jhulan there aren’t too many replacements. So that’s also a problem that the board is facing. Hopefully, the planned WIPL will unearth enough talent for future,” the source said. Laxman, and the men’s team head coach Rahul Dravid , who had drawn up the NCA module, is expected to be consulted going forward.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Mukesh Chaudhary cricketer: Why is Deepak Chahar not playing today’s IPL 2022 match between Chennai Super Kings and Lucknow Super Giants?","link":"https://thesportsrush.com/cricket-news-mukesh-chaudhary-cricketer-why-is-deepak-chahar-not-playing-todays-ipl-2022-match-between-chennai-super-kings-and-lucknow-super-giants/","keywords":["Cricket","CSK","IPL 2022","Lucknow Super Giants","chennai super kings","csk","deepak chahar","Dwaine Pretorius","Indian Premier League","LSG","Mukesh Chaudhary"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Deepak Chahar not playing: Chennai Super Kings have made three changes to their Playing XI for their second IPL 2022 match. During the seventh match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Chennai Super Kings at the Brabourne Stadium, Lucknow Super Giants captain KL Rahul has won… The post Mukesh Chaudhary cricketer: Why is Deepak Chahar not playing today’s IPL 2022 match between Chennai Super Kings and Lucknow Super Giants? appeared first on The SportsRush.","content":"Deepak Chahar not playing: Chennai Super Kings have made three changes to their Playing XI for their second IPL 2022 match. During the seventh match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Chennai Super Kings at the Brabourne Stadium, Lucknow Super Giants captain KL Rahul has won the toss and chose to field. “Going to bowl first. At the end of the day we need to play good cricket as well. But have been watching the last few games, ball gets wet towards the end,” Rahul told Star Sports at the toss. “Also, this looks like a fresh wicket with some grass on it. Enjoyed the last game that we played. Boys showed good fight. Showed real character. Was pleasing for us and will take confidence from that.” Australia fast bowler Andrew Tye, who had replaced England’s Mark Wood at Super Giants, will be making his debut for the franchise after replacing Mohsin Khan in the Playing XI tonight. LSG have become Tye’s fourth IPL franchise. Mukesh Chaudhary cricketer Much like Rahul, Chennai Super Kings captain Ravindra Jadeja also wanted to bowl first in this match. “Would’ve bowled first too. Now we’re batting so will look to put up a decent score. Blessed with a huge fan-following [on numerous yellow jerseys spotted at the venue],” Jadeja told Star Sports at the toss. As both the teams are looking to get off the mark, Super Kings have made three changes to their Playing XI. While batter Devon Conway has been benched after a flop IPL debut, fast bowler Adam Milne will miss this match due to a side strain. All-rounder Mitchell Santner, on the other hand, isn’t playing this match due to the return of all-rounder Moeen Ali. In addition to Ali, Chennai have handed debuts to South Africa all-rounder Dwaine Pretorius and Maharashtra fast bowler Mukesh Chaudhary. 33-year old Pretorius, who has represented the Proteas in 49 matches across formats, was bought by CSK for INR 50 lakh. Chaudhary, on the other hand, has picked 16 wickets at an average of 22.93, an economy rate of 8.50 and a strike rate of 16.1 in his 12-match T20 career. Super Debuts Mukesh Choudhary Dwaine Pretorius #WhistlePodu #Yellove #LSGvCSK — Chennai Super Kings (@ChennaiIPL) March 31, 2022 Why is Deepak Chahar not playing IPL 2022 match vs LSG today? Not part of Super Kings’ four retained players ahead of IPL 2022 mega auction in Bengaluru last month, Chahar was the centre of attraction at the auction becoming the second-costliest player after Mumbai Indians wicket-keeper batter Ishan Kishan. Chahar, who had suffered a quadricep tear during the third T20I between India and West Indies in Kolkata last month, is currently undergoing a rehabilitation process at the NCA (National Cricket Academy), Bengaluru. Readers must note that Chahar would require a miraculous recovery to take part in the first half of IPL 2022. The post Mukesh Chaudhary cricketer: Why is Deepak Chahar not playing today’s IPL 2022 match between Chennai Super Kings and Lucknow Super Giants? appeared first on The SportsRush.","pubDate":"2022-03-31 13:58:34","full_description":"Deepak Chahar not playing: Chennai Super Kings have made three changes to their Playing XI for their second IPL 2022 match. During the seventh match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Chennai Super Kings at the Brabourne Stadium, Lucknow Super Giants captain KL Rahul has won the toss and chose to field. “Going to bowl first. At the end of the day we need to play good cricket as well. But have been watching the last few games, ball gets wet towards the end,” Rahul told Star Sports at the toss. “Also, this looks like a fresh wicket with some grass on it. Enjoyed the last game that we played. Boys showed good fight. Showed real character. Was pleasing for us and will take confidence from that.” Australia fast bowler Andrew Tye, who had replaced England’s Mark Wood at Super Giants, will be making his debut for the franchise after replacing Mohsin Khan in the Playing XI tonight. LSG have become Tye’s fourth IPL franchise . Much like Rahul, Chennai Super Kings captain Ravindra Jadeja also wanted to bowl first in this match. “Would’ve bowled first too. Now we’re batting so will look to put up a decent score. Blessed with a huge fan-following [on numerous yellow jerseys spotted at the venue],” Jadeja told Star Sports at the toss. As both the teams are looking to get off the mark, Super Kings have made three changes to their Playing XI. While batter Devon Conway has been benched after a flop IPL debut, fast bowler Adam Milne will miss this match due to a side strain. All-rounder Mitchell Santner, on the other hand, isn’t playing this match due to the return of all-rounder Moeen Ali. In addition to Ali, Chennai have handed debuts to South Africa all-rounder Dwaine Pretorius and Maharashtra fast bowler Mukesh Chaudhary. 33-year old Pretorius, who has represented the Proteas in 49 matches across formats, was bought by CSK for INR 50 lakh. Chaudhary, on the other hand, has picked 16 wickets at an average of 22.93, an economy rate of 8.50 and a strike rate of 16.1 in his 12-match T20 career. Super Debuts Mukesh Choudhary 🦁 Dwaine Pretorius 🦁 #WhistlePodu #Yellove #LSGvCSK 🦁💛 — Chennai Super Kings (@ChennaiIPL) March 31, 2022 Not part of Super Kings’ four retained players ahead of IPL 2022 mega auction in Bengaluru last month, Chahar was the centre of attraction at the auction becoming the second-costliest player after Mumbai Indians wicket-keeper batter Ishan Kishan. Chahar, who had suffered a quadricep tear during the third T20I between India and West Indies in Kolkata last month, is currently undergoing a rehabilitation process at the NCA (National Cricket Academy), Bengaluru. Readers must note that Chahar would require a miraculous recovery to take part in the first half of IPL 2022.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}