{"newsArray":[{"title":"Australia captain Pat Cummins in DOUBT for the second Ashes Test vs England after Covid scare","link":"https://www.thesun.co.uk/sport/17054337/ashes-australia-pat-cummins-covid-england-cricket/","keywords":["Cricket","Sport","Australia Cricket Team","England Cricket","The Ashes 2021-22"],"creator":["Tom Sheen"],"video_url":null,"description":"AUSTRALIA captain Pat Cummins is a DOUBT for the second Ashes Test because of a Covid scare. The fast bowler was at a restaurant in Adelaide on Wednesday and a customer on the table next to him has found to be positive. Cummins, 28, is said to have left the venue immediately and contacted Cricket […]","content":"AUSTRALIA captain Pat Cummins is a DOUBT for the second Ashes Test because of a Covid scare. The fast bowler was at a restaurant in Adelaide on Wednesday and a customer on the table next to him has found to be positive. News Group Newspapers LtdAUSTRALIA captain Pat Cummins is a DOUBT for the second Ashes Test[/caption] Cummins, 28, is said to have left the venue immediately and contacted Cricket Australia, but local media reports he is unlikely to be ready for the match which starts overnight on Thursday. Cricket Australia are said to be looking into whether their star bowler will be ready to play. Cummins, rated as the top bowler in the sport, took seven wickets in the first Test, including a brilliant five-wicket haul in the first innings. Ahead of the second Test the new Aussie skipper had admitted he was determined to have a private tutorial before the end of The Ashes series. Cummins, 28, admitted: “I haven’t really picked his brains about bowling yet but I would love to. “Jimmy is just fantastic — more than 150 Test matches and the leading wicket-taker for England. Most read in Cricket JIMMY'S SECRETS Anderson asked to reveal secrets to Cummins ahead of Second Ashes Test down under When is the Ashes 2021/22? Dates, UK start time, TV channel and live stream free PINKIE PROMISE Why i pink ball being used in Test cricket, and is it being used for Ashes? SHOCK ARREST Australian cricket great Slater arrested for 'breaching restraining order' 'SUPERHERO' Root says he was wrong to expect too much from England's Stokes in First Test AUSSIE RULE England arguably worst batting line-up in memory - don't rule out Australia 5-0 “The longevity is really impressive. You get niggles and injuries as a fast bowler and he’s been at it non-stop for nearly two decades. “It just shows it’s possible to be bowling into your late 30s and still be at the top of your game. He brings experience and class to their side and is always a challenge.” As he has become older, Anderson, now 39, is more and more happy to share his knowledge and help the next generation of quick bowlers. Normally, that is England performers such as Ollie Robinson, who has been so impressive in Test cricket since his debut last summer. Anderson can mentor on the field or behind the scenes when he is not playing, like after he was omitted from the First Test defeat in Brisbane. He explained: “I guess my job as a senior player is to try to help as much as I can, whether I’m playing or not. “It’s been difficult on this tour because of the lack of preparation before the Tests started. So every bit of knowledge we can pass on to guys who have not played here before is crucial. “Myself, Stuart Broad, Ben Stokes, Jos Buttler — the guys with experience — that’s what we’ve been trying to do. “So someone like Ollie is a quality bowler. He’s been really impressive, not just in the games he’s played but when he’s been around the group in the last year or so. “He has a great amount of skill — he’s accurate and can swing a ball, which is pretty much all you need. His bowling is suited to any conditions. “It’s nice to hear the Australians saying nice things about me but I’m sure they’re not going to be saying too many nice things this week!”","pubDate":"2021-12-16 00:26:55","full_description":"AUSTRALIA captain Pat Cummins is a DOUBT for the second Ashes Test because of a Covid scare. The fast bowler was at a restaurant in Adelaide on Wednesday and a customer on the table next to him has found to be positive. Cummins, 28, is said to have left the venue immediately and contacted Cricket Australia, but local media reports he is unlikely to be ready for the match which starts overnight on Thursday. Cricket Australia are said to be looking into whether their star bowler will be ready to play. Cummins, rated as the top bowler in the sport, took seven wickets in the first Test, including a brilliant five-wicket haul in the first innings. Ahead of the second Test the new Aussie skipper had admitted he was determined to have a private tutorial before the end of The Ashes series . Cummins, 28, admitted: “I haven’t really picked his brains about bowling yet but I would love to. “Jimmy is just fantastic — more than 150 Test matches and the leading wicket-taker for England. “The longevity is really impressive. You get niggles and injuries as a fast bowler and he’s been at it non-stop for nearly two decades. “It just shows it’s possible to be bowling into your late 30s and still be at the top of your game. He brings experience and class to their side and is always a challenge.” As he has become older, Anderson, now 39, is more and more happy to share his knowledge and help the next generation of quick bowlers. Normally, that is England performers such as Ollie Robinson, who has been so impressive in Test cricket since his debut last summer. Anderson can mentor on the field or behind the scenes when he is not playing, like after he was omitted from the First Test defeat in Brisbane . He explained: “I guess my job as a senior player is to try to help as much as I can, whether I’m playing or not. “It’s been difficult on this tour because of the lack of preparation before the Tests started. So every bit of knowledge we can pass on to guys who have not played here before is crucial. “Myself, Stuart Broad, Ben Stokes, Jos Buttler — the guys with experience — that’s what we’ve been trying to do. “So someone like Ollie is a quality bowler. He’s been really impressive, not just in the games he’s played but when he’s been around the group in the last year or so. “He has a great amount of skill — he’s accurate and can swing a ball, which is pretty much all you need. His bowling is suited to any conditions. “It’s nice to hear the Australians saying nice things about me but I’m sure they’re not going to be saying too many nice things this week!”","image_url":null,"source_id":"thesun"},{"title":"Australia captain Pat Cummins in Covid-19 scare hours before second Ashes Test","link":"https://www.theguardian.com/sport/2021/dec/16/australia-ashes-second-test-captain-pat-cummins-covid-19-scare","keywords":["Ashes 2021-22","The Ashes","Australia cricket team","England cricket team","Cricket","Australia sport","Sport"],"creator":["Guardian sport"],"video_url":null,"description":"Cricket Australia investigating after restaurant visitSkipper left venue as soon as he was told of positive case Cricket Australia is investigating reports that Pat Cummins has been identified as a close contact of a Covid case just hours before the start of the second Ashes Test at Adelaide Oval.Nine Entertainment newspapers reported the new Test captain was in close proximity to a person identified as a positive case when dining at a restaurant on Wednesday night. Continue reading...","content":null,"pubDate":"2021-12-16 00:20:22","full_description":"Australia’s best-laid preparations for the second Ashes Test were thrown into disarray before the start of play at Adelaide Oval as captain Pat Cummins was ruled out after being identified as a close contact of a positive Covid-19 case. Just hours before Thursday afternoon’s toss in Adelaide, it emerged that Cummins was dining at a restaurant in the city on Wednesday night when a person at the next table was identified as a positive case. Cummins left the venue immediately and promptly informed cricket authorities, but the exposure was deemed sufficient for the fast bowler to be forced into isolation for seven days, under South Australia Health protocols. Mitchell Starc and Nathan Lyon were dining at the same restaurant as Cummins, but at a separate table outdoors. They were deemed casual contacts and as such are free to play. Cummins, who took a five-wicket haul in the first Test at the Gabba, will be replaced by Test debutant Michael Neser in Australia’s starting XI at Adelaide Oval. Steve Smith will step up to lead the team for the first time since being stripped of the captaincy in the wake of the 2008 ball-tampering scandal. Travis Head, who along with Cummins headlined the first Test in Brisbane with a century, steps into Smith’s shoes as temporary vice-captain. Strict biosecurity bubbles were not implemented for this series, with Australia and England players afforded as many freedoms as possible. There is no suggestion Cummins broke any rules, but the incident may prompt a review of protocols for the remainder of the series, with matches in Melbourne and Sydney next up. “Cummins was dining in a restaurant last night and did not breach any biosecurity protocols,” a CA statement read. “He isolated as soon as he became aware of the situation and has since had a PCR test, which produced a negative result. “We anticipate that he will be available to play in the third men’s Ashes Test at the MCG in Melbourne. Cummins is understandably very disappointed not to be able to captain Australia for the day-night Test in Adelaide.” Australia are seeking to open up a 2-0 series lead in Adelaide after a convincing victory at the Gabba last week put them in the driving seat.","image_url":"https://i.guim.co.uk/img/media/9fc3c3447b31845a76fc6af1835f3bd1347c219c/0_114_4452_2671/master/4452.jpg?width=460&quality=85&auto=format&fit=max&s=7ab9b95fda4b253c77246f004ef25fc9","source_id":"theguardian"},{"title":"Cricket-Australia board probes reports Cummins a close COVID-19 contact","link":"https://www.thestar.com.my/sport/cricket/2021/12/16/cricket-australia-board-probes-reports-cummins-a-close-covid-19-contact","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - Cricket Australia is investigating media reports test captain Pat Cummins has been identified as a close contact of a COVID-19 case, a spokesman said on Thursday. Read full story","content":null,"pubDate":"2021-12-16 00:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/16/1408272.jpg","source_id":"thestar_my"},{"title":"Australian Test captain Pat Cummins reportedly a COVID-19 close contact","link":"https://www.cairnspost.com.au/sport/australian-test-captain-pat-cummins-reportedly-a-covid19-close-contact/video/70cb91919d38b517ce70003ebe6b88fa","keywords":["National","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia is investigating reports Australian Test captain Pat Cummins has been identified as a COVID-19 close contact. Nine Newspapers are reporting Pat Cummins went to a dinner outing at a restaurant where a patron on the next table was infected with the virus. It's now unclear if the Australian captain will be able to play in the second Ashes Test – which starts this afternoon.","content":null,"pubDate":"2021-12-16 00:13:55","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"CA investigating Cummins COVID-19 link","link":"https://thewest.com.au/sport/cricket/ca-investigating-cummins-covid-19-link-c-4969821","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cricket Australia is investigating whether captain Pat Cummins can play in the second Ashes Test after he was linked to a positive COVID-19 case in Adelaide.","content":null,"pubDate":"2021-12-15 23:51:03","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4969821/4f960b5b65a00fe51f744a90fdeb49337c4c3275-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"CA investigating Cummins COVID-19 link","link":"https://www.perthnow.com.au/sport/cricket/ca-investigating-cummins-covid-19-link-c-4969823","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cricket Australia is investigating whether captain Pat Cummins can play in the second Ashes Test after he was linked to a positive COVID-19 case in Adelaide.","content":null,"pubDate":"2021-12-15 23:51:03","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4969823/4f960b5b65a00fe51f744a90fdeb49337c4c3275-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"16 dicembre 1899, nasce il Milan","link":"https://www.tuttomercatoweb.com/accadde-oggi/16-dicembre-1899-nasce-il-milan-1621527","keywords":["Accadde Oggi..."],"creator":null,"video_url":null,"description":"Il 16 dicembre 1899 un gruppo di inglesi e di italiani si riuniscono all'Hotel du Nord di Milano e costituiscono il Milan Cricket and Foot-ball Club.","content":null,"pubDate":"2021-12-15 23:00:49","full_description":"Il 16 dicembre 1899 un gruppo di inglesi e di italiani si riuniscono all'Hotel du Nord di Milano e costituiscono il Milan Cricket and Foot-ball Club. Come presidente viene eletto Alfred Edwards, vice-console britannico a Milano. Il primo allenatore e capitano fu Herbert Kilpin che porterà dall'Inghilterra le divise da gioco rossonere a strisce verticali. \"Saremo una squadra di diavoli. I nostri colori saranno il rosso come il fuoco e il nero come la paura che incuteremo agli avversari\", furono le parole pronunciate dallo stesso Kilpin. Primo campo da gioco il Trotter di piazza Doria, la prima sede è la Fiaschetteria Toscana di via Berchet. In 121 anni di gloriosa storia i rossoneri hanno vinto 7 Coppe dei Campioni/Champions League, 2 Coppe delle Coppe, 5 Supercoppe Europee, 3 Coppe Intercontinentali, 1 Mondiale per Club, 18 Campionati, 5 Coppe Italia e 6 Supercoppe Italiane.","image_url":null,"source_id":"tuttomercatoweb"},{"title":"Why Australia is gambling on Warner's fitness","link":"https://wwos.nine.com.au/cricket/ashes-2021-mark-taylor-david-warner-injury-risk-jhye-richardson/de89a6a9-7c6e-444c-8e9c-db1e12fd0260","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former Australian captain Mark Taylor says playing a less than fully fit David Warner is a risk worth taking.","content":"Former Australian Test skipper Mark Taylor says playing David Warner in the second Test despite the opener being less than 100 per cent fit is a risk worth taking.Warner will take up his spot in Australia's side despite being under a major injury cloud in the lead-up to the pink ball Test in Adelaide after dealing with bruised ribs.The veteran opener's spot in the side was confirmed by Australian captain Pat Cummins earlier this week, despite enduring a nets session where he looked extremely proppy.READ MORE: Mystery lingers over England's line-up ahead of second Test\"It's a good move for Australia and I think it shows the importance of this game,\" Taylor told Nine's TODAY ahead of the second Test.\"David Warner is probably not 100 per cent fit, but he knows this is a big game for Australia and a big game for England.\"Having won the first Test match, Australia know if they can win here in this day-night Test match - they've won eight from eight - and go 2-0 up in the series, they've just about hung onto the Ashes.READ MORE: Lyon gunning for 5-0 Ashes whitewash after Gabba hammering\"So that's the importance of this game and probably one of the main reasons David Warner is playing.\"While Warner was able to retain his spot, Josh Hazlewood won't play in Adelaide due to a side strain, with Jhye Richardson taking his spot in a move Taylor approved.\"I'm delighted for Jhye,\" he said.\"It was three years ago where he played a couple of Test matches and did well ... then dislocated his shoulder in a fielding accident.READ MORE: Ex-captain's dire warning over Hazlewood injury concerns\"It's great to see him back and obviously he's been bowling very well for Western Australia, he's taken something like 23 wickets this year in Shield cricket, he's belted the door down.\"With Josh Hazlewood's injury, he's the right man for the job and I think he'll enjoy bowling here with the pink ball particularly under lights. He could be a handful.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-15 22:35:26","full_description":"Former Australian Test skipper Mark Taylor says playing David Warner in the second Test despite the opener being less than 100 per cent fit is a risk worth taking. Warner will take up his spot in Australia's side despite being under a major injury cloud in the lead-up to the pink ball Test in Adelaide after dealing with bruised ribs. The veteran opener's spot in the side was confirmed by Australian captain Pat Cummins earlier this week, despite enduring a nets session where he looked extremely proppy . READ MORE: Mystery lingers over England's line-up ahead of second Test \"It's a good move for Australia and I think it shows the importance of this game,\" Taylor told Nine's TODAY ahead of the second Test . \"David Warner is probably not 100 per cent fit, but he knows this is a big game for Australia and a big game for England. \"Having won the first Test match, Australia know if they can win here in this day-night Test match - they've won eight from eight - and go 2-0 up in the series, they've just about hung onto the Ashes. READ MORE: Lyon gunning for 5-0 Ashes whitewash after Gabba hammering \"So that's the importance of this game and probably one of the main reasons David Warner is playing.\" While Warner was able to retain his spot, Josh Hazlewood won't play in Adelaide due to a side strain, with Jhye Richardson taking his spot in a move Taylor approved. \"I'm delighted for Jhye,\" he said. \"It was three years ago where he played a couple of Test matches and did well ... then dislocated his shoulder in a fielding accident. READ MORE: Ex-captain's dire warning over Hazlewood injury concerns \"It's great to see him back and obviously he's been bowling very well for Western Australia, he's taken something like 23 wickets this year in Shield cricket, he's belted the door down. \"With Josh Hazlewood's injury, he's the right man for the job and I think he'll enjoy bowling here with the pink ball particularly under lights. He could be a handful.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/399366/pickerimage.jpg","source_id":"nine"},{"title":"Jimmy Anderson asked to reveal secrets ahead of Second Ashes Test – to Aussie rival and world’s best bowler Pat Cummins","link":"https://www.thesun.co.uk/sport/17053278/jimmy-anderson-second-ashes-test-cummins/","keywords":["Cricket","Sport","Australia Cricket Team","The Ashes 2021-22"],"creator":["John Etheridge"],"video_url":null,"description":"JIMMY ANDERSON will be asked to reveal some of his secrets… by the best bowler in the world. Anderson’s ability to swing the ball and incredible longevity — he is playing his 167th Test more than 18 years after his debut — have caught the eye of Pat Cummins. And new Aussie skipper Cummins, the world’s […]","content":"JIMMY ANDERSON will be asked to reveal some of his secrets… by the best bowler in the world. Anderson’s ability to swing the ball and incredible longevity — he is playing his 167th Test more than 18 years after his debut — have caught the eye of Pat Cummins. Getty Images - GettyJames Anderson is one of the all-time great Test bowlers – but Pat Cummins is still seeking his advice[/caption] News Group Newspapers LtdCummins is currently rated as the best Test bowler in the world[/caption] And new Aussie skipper Cummins, the world’s No 1 ranked bowler in Test cricket, is determined to have a private tutorial before the end of The Ashes series. Cummins, 28, admitted: “I haven’t really picked his brains about bowling yet but I would love to. “Jimmy is just fantastic — more than 150 Test matches and the leading wicket-taker for England. “The longevity is really impressive. You get niggles and injuries as a fast bowler and he’s been at it non-stop for nearly two decades. “It just shows it’s possible to be bowling into your late 30s and still be at the top of your game. He brings experience and class to their side and is always a challenge.” As he has become older, Anderson, now 39, is more and more happy to share his knowledge and help the next generation of quick bowlers. Most read in Cricket down under When is the Ashes 2021/22? Dates, UK start time, TV channel and live stream free PINKIE PROMISE Why i pink ball being used in Test cricket, and is it being used for Ashes? SHOCK ARREST Australian cricket great Slater arrested for 'breaching restraining order' 'SUPERHERO' Root says he was wrong to expect too much from England's Stokes in First Test AUSSIE RULE England arguably worst batting line-up in memory - don't rule out Australia 5-0 CAMERA SHY BT forced to show Ashes first Test using ONE camera after Gabba power issue Normally, that is England performers such as Ollie Robinson, who has been so impressive in Test cricket since his debut last summer. Anderson can mentor on the field or behind the scenes when he is not playing, like after he was omitted from the First Test defeat in Brisbane. He explained: “I guess my job as a senior player is to try to help as much as I can, whether I’m playing or not. “It’s been difficult on this tour because of the lack of preparation before the Tests started. So every bit of knowledge we can pass on to guys who have not played here before is crucial. “Myself, Stuart Broad, Ben Stokes, Jos Buttler — the guys with experience — that’s what we’ve been trying to do. “So someone like Ollie is a quality bowler. He’s been really impressive, not just in the games he’s played but when he’s been around the group in the last year or so. “He has a great amount of skill — he’s accurate and can swing a ball, which is pretty much all you need. His bowling is suited to any conditions. “It’s nice to hear the Australians saying nice things about me but I’m sure they’re not going to be saying too many nice things this week!” Anderson accepts he will not play in every Test these days as England continue to rest and rotate bowlers in these Covid times. He will maybe play three matches out of five in this series. He explained: “It’s always frustrating to miss out on playing in a Test — but it’s about the bigger picture. “We have five Tests in fairly quick succession and we are just trying to keep the guys fresh. “It’s something I’ve got used to but, when the captain wants me, I try to be ready.” Durham speedster Mark Wood took his turn to be rested for the Second Test. LATEST IN SUN BINGO AND VEGAS FREE BONUS Join Sun Vegas now to get £10 free with no deposit required DAILY PRIZES Win great prizes every day in December with the FREE Christmas Sun Bingoboard WELCOME OFFER Get £50 in special bingo bonuses plus 50 free spins when you join Sun Bingo FAB FIVER Fabulous Bingo new customer offer: Get free £5 bonus with no deposit required He bowled regularly at more than 90mph in the First Test in Brisbane and some of the Aussie batsmen did not fancy his pace. Captain Joe Root explained: “With four Tests in four weeks, it’s important we keep our bowling group fresh. “Mark will play a pivotal role in this series, so we have to ensure that he is fresh and able to perform at his fullest capability.”","pubDate":"2021-12-15 22:30:00","full_description":"JIMMY ANDERSON will be asked to reveal some of his secrets... by the best bowler in the world. Anderson ’s ability to swing the ball and incredible longevity — he is playing his 167th Test more than 18 years after his debut — have caught the eye of Pat Cummins. And new Aussie skipper Cummins, the world’s No 1 ranked bowler in Test cricket, is determined to have a private tutorial before the end of The Ashes series . Cummins, 28, admitted: “I haven’t really picked his brains about bowling yet but I would love to. “Jimmy is just fantastic — more than 150 Test matches and the leading wicket-taker for England. “The longevity is really impressive. You get niggles and injuries as a fast bowler and he’s been at it non-stop for nearly two decades. “It just shows it’s possible to be bowling into your late 30s and still be at the top of your game. He brings experience and class to their side and is always a challenge.” As he has become older, Anderson, now 39, is more and more happy to share his knowledge and help the next generation of quick bowlers. Normally, that is England performers such as Ollie Robinson, who has been so impressive in Test cricket since his debut last summer. Anderson can mentor on the field or behind the scenes when he is not playing, like after he was omitted from the First Test defeat in Brisbane . He explained: “I guess my job as a senior player is to try to help as much as I can, whether I’m playing or not. “It’s been difficult on this tour because of the lack of preparation before the Tests started. So every bit of knowledge we can pass on to guys who have not played here before is crucial. “Myself, Stuart Broad, Ben Stokes, Jos Buttler — the guys with experience — that’s what we’ve been trying to do. “So someone like Ollie is a quality bowler. He’s been really impressive, not just in the games he’s played but when he’s been around the group in the last year or so. “He has a great amount of skill — he’s accurate and can swing a ball, which is pretty much all you need. His bowling is suited to any conditions. “It’s nice to hear the Australians saying nice things about me but I’m sure they’re not going to be saying too many nice things this week!” Anderson accepts he will not play in every Test these days as England continue to rest and rotate bowlers in these Covid times. He will maybe play three matches out of five in this series. He explained: “It’s always frustrating to miss out on playing in a Test — but it’s about the bigger picture. “We have five Tests in fairly quick succession and we are just trying to keep the guys fresh. “It’s something I’ve got used to but, when the captain wants me, I try to be ready.” Durham speedster Mark Wood took his turn to be rested for the Second Test. He bowled regularly at more than 90mph in the First Test in Brisbane and some of the Aussie batsmen did not fancy his pace. Captain Joe Root explained: “With four Tests in four weeks, it’s important we keep our bowling group fresh. “Mark will play a pivotal role in this series, so we have to ensure that he is fresh and able to perform at his fullest capability.”","image_url":null,"source_id":"thesun"},{"title":"Michael Slater charged with breaching AVO","link":"https://www.news.com.au/sport/cricket/michael-slater-charged-with-breaching-avo/video/eee6617d8071a064b97dcc1911f87b0e","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Former Australian opener Michael Slater has been charged by NSW police for allegedly breaching an AVO.","content":null,"pubDate":"2021-12-15 21:04:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Michael Slater charged with breaching AVO","link":"https://www.news.com.au/sport/cricket/michael-slater-charged-with-breaching-avo/video/eee6617d8071a064b97dcc1911f87b0e","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Former Australian opener Michael Slater has been charged by NSW police for allegedly breaching an AVO.","content":null,"pubDate":"2021-12-15 21:04:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Dads and Daughters Cricket program breaks down boundaries","link":"https://www.newcastleherald.com.au/story/7553027/dads-and-daughters-cricket-program-breaks-down-boundaries/?src=rss","keywords":null,"creator":["Renee Valentine"],"video_url":null,"description":"It will be run in various locations throughout Newcastle in 2022.","content":null,"pubDate":"2021-12-15 20:30:00","full_description":"Cricket Australia has formed what is hoped to become a long-standing partnership with the University of Newcastle to deliver a sport specific version of its boundary-breaking Dads and Daughters Active and Empowered (DADEE) program. The nine-week program aims to connect dads and daughters as they learn about cricket in a safe and fun environment. It was first delivered in Newcastle and Sydney in 2020 to coincide with the ICC T20 Women's World Cup but had a disrupted start due to the coronavirus pandemic. Now, it is set to be rolled out in various locations around Newcastle in 2022 along with Sydney, Victoria and Western Australia. Cricket Australia's national female participation manager Jane Moffat was in Newcastle on Sunday to relaunch the revolutionary program that she described as the \"missing piece in the puzzle\" as the sport aims to attract and retain female participants. The 2020-21 Australian Cricket Census reported only 14 per cent of junior participants were girls. The Dads and Daughters program has been designed to break down barriers faced by girls aged seven to 12. \"Girls might perceive it as being a boys sport or avoid it because it's too hard, it's too complicated,\" Moffat said. \"So, this offered an easy entry point to girls who were reluctant to sign up for something where it's just going to be them and they've got no support. \"The dads are very much involved with this program, so it feels safe.\" University of Newcastle Professor Phil Morgan formulated the DADEE program and said benefits of the cricket version included developing social-emotional skills as well as practical skills while also improving girls' knowledge of the sport. \"It's incredibly rewarding to, firstly, see people's reaction to the program and impact it has on families,\" Professor Morgan said. \"But, also, for other organisations to hear and see the program, recognise how important it is to support and empower our girls then to run a program that really does fill a gap for many of these traditionally male-dominated sports. \"We really want to be able to excite girls about the possibilities in these sports regardless of their background and interests.\" In 2018, Newcastle Junior Cricket Association (NJCA) female junior registrations numbered 148 players and six all-girl teams. Last summer, a record 333 players were registered and there were 15 all-girls' teams. That included girls from the Junior and Master Blaster programs, for kids aged five to 10, through to girls in NJCA competition. At senior level, the Newcastle District Cricket Association Women's T20 League has grown from four teams to nine in three years. Find out more about the Dads and Daughters Cricket program through www.cricketaustralia.com.au/daughtersanddadscricket . IN THE NEWS: Our journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:","image_url":"https://transform.newsnow.io/transform/v1/crop/frm/ikLFZZUcNnvgygfqz78ZET/d8ca56ff-ce89-4167-8000-0b1af1bb88ff.JPG/r0_372_3000_2062_w600_h338_fmax.jpg","source_id":"newcastleherald"},{"title":"NSW great's golden line that shut up Fatty Vautin","link":"https://wwos.nine.com.au/nrl/state-of-origin-nsw-blues-queensland-maroons-steve-mortimer-paul-vautin-scg/0aacbfb4-58d3-4f22-9813-3bd5228d021d","keywords":null,"creator":["wwos"],"video_url":null,"description":"Steve Mortimer had a brilliant line for a chirping Paul Vautin moments after NSW's first State of Origin series victory.","content":"One brilliant quip from Steve Mortimer said it all.New South Wales had just clinched the State of Origin shield for the first time, halting the dominance of Queensland after four years of pain.The breakthrough came on the night of Tuesday, June 11, 1985, when the Blues trumped the Maroons 21-14 in front of a 39,068-strong crowd at the Sydney Cricket Ground.\"Turvey,\" said Queensland forward Paul Vautin to Mortimer.READ MORE: 'Disgusted' Red Bull threatens to quit Formula 1READ MORE: Wrestling icon dies after triple amputationREAD MORE: NRL boss issues ominous COVID-19 warning\"You just did a Queensland on Queensland.\"The Blues' halfback and captain fired back the perfect reply.\"Piss off, Fatty,\" Mortimer said.\"We did a NSW on Queensland.\"NSW's first Origin series victory is relived in a terrific book released in November: If These Walls Could Talk: A Celebration of the Sydney Cricket Ground, written by Sydney Morning Herald chief sports writer Andrew Webster.As the chapter on the Blues' series win explains, NSW had dominated over the first 71 years of the interstate rivalry, spanning 1908 to 1979.But the Origin era began with Queensland winning one-off games in 1980 and 1981, before downing NSW in all three series between 1982 and 1984.The Blues' genuine hatred for the Maroons over the first four years of the Origin era was undeniable.It blew out of control on the second tackle of game two of the 1984 series, when one of the most infamous all-in brawls in Origin history was sparked by a Steve Roach punch.The Balmain front-rower was one of four men involved in a tackle on Queensland centre Gene Miles – but instead of wrapping his arms, he unloaded a barrage of uppercuts.Referee Barry Gomersall, more commonly known as 'The Grasshopper', had no hope of stopping the fight, as players wrestled and threw punches at anyone wearing a rival jumper in a wild brawl that lasted more than two minutes.But despite the hatred that lingered between the sides throughout the opening four years of the Origin era, a 2-1 defeat was the best series result NSW could muster.Legendary five-eighth Wally Lewis, now an Immortal, was the driving force behind Queensland's dominance.The Mortimer-inspired Blues stopped the rot when they backed up an 18-2 win at Lang Park with the 21-14 victory at the SCG to secure the shield in 1985.When Vautin threw his jibe at Mortimer moments after the full-time siren sounded at the SCG, the stage was set for the most relieved man in NSW to floor him with his comeback.\"Not many people manage that – to put Paul Vautin back in his box with a one-liner – but that was pretty smart from Turvey,\" Webster says in an interview with Wide World of Sports.\"There was merit in what Fatty said, because Queensland had taken Origin so seriously since its conception and NSW had just never quite got there.https://twitter.com/garmstrong61/status/1457881883203686400\"I've heard (rugby league icon) Phil Gould talk about it in the past – that Queensland have always 'got' Origin better than NSW have.\"Well, the first person that really 'got it' for NSW was Steve Mortimer.\"In that chapter, I love the image from before the first game … when they're going down Caxton Street (in Brisbane) and the Queensland fans are starting to rock the bus and (NSW hooker) Benny Elias is sitting at the back of the bus. He'd never played Origin before, looking out, looking at the Caxton Hotel, seeing these Queenslanders frothing at the mouth and throwing cans of XXXX at the bus and Turvey just saying, 'See that? They hate us. Make sure we give it back to them in spades when we get on the field'.\"That's where the real Origin contest was borne – in those matches in the mid-80s.\"Mortimer made his NSW debut in 1977 and played his first Origin game in the opening match of the 1982 series.He was a member of every one of the losing Blues squads between 1982 and 1984 and was also repeatedly shunted throughout the first four years of the Origin era, for either Newtown star Tommy Raudonokis or Parramatta gun Peter Sterling.\"It was a time when NSW drew a line in the sand, finally,\" Webster says of the 1985 series.\"And the person who drew the line in the sand was Steve Mortimer – the captain and the halfback, who'd suffered as many losses as any NSW player since Origin had first happened in 1980.\"Mortimer was chaired from the SCG turf by his teammates after the 1985 series win, hands in the air as he shouted to the heavens.He then announced his retirement from representative football in the sheds, having conquered the pinnacle.Des Hasler made his Origin debut in game three and the Blues lost 20-6 at Lang Park.But those are minor details.Mortimer had steered NSW to their first series victory and retired a winner.\"There's that iconic image of him dropping to his knees and crying in the middle of the Sydney Cricket Ground. I've interviewed Turvey many times and particularly about this moment in time, for both the Herald and this book. And I said, 'Why? What was the overriding feeling?'. And he said, 'Relief'. He's very religious, Turvey. And I said, 'What were you doing?'. And he said, 'I was just thanking God'.\"And that's how much it meant to him.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-15 20:29:34","full_description":"One brilliant quip from Steve Mortimer said it all. New South Wales had just clinched the State of Origin shield for the first time, halting the dominance of Queensland after four years of pain. The breakthrough came on the night of Tuesday, June 11, 1985, when the Blues trumped the Maroons 21-14 in front of a 39,068-strong crowd at the Sydney Cricket Ground . \"Turvey,\" said Queensland forward Paul Vautin to Mortimer. READ MORE: 'Disgusted' Red Bull threatens to quit Formula 1 READ MORE: Wrestling icon dies after triple amputation READ MORE: NRL boss issues ominous COVID-19 warning \"You just did a Queensland on Queensland.\" The Blues' halfback and captain fired back the perfect reply. \"Piss off, Fatty,\" Mortimer said. \"We did a NSW on Queensland.\" NSW's first Origin series victory is relived in a terrific book released in November: If These Walls Could Talk: A Celebration of the Sydney Cricket Ground , written by Sydney Morning Herald chief sports writer Andrew Webster . As the chapter on the Blues' series win explains, NSW had dominated over the first 71 years of the interstate rivalry, spanning 1908 to 1979. But the Origin era began with Queensland winning one-off games in 1980 and 1981, before downing NSW in all three series between 1982 and 1984. The Blues' genuine hatred for the Maroons over the first four years of the Origin era was undeniable. It blew out of control on the second tackle of game two of the 1984 series, when one of the most infamous all-in brawls in Origin history was sparked by a Steve Roach punch. The Balmain front-rower was one of four men involved in a tackle on Queensland centre Gene Miles – but instead of wrapping his arms, he unloaded a barrage of uppercuts. Referee Barry Gomersall, more commonly known as 'The Grasshopper', had no hope of stopping the fight, as players wrestled and threw punches at anyone wearing a rival jumper in a wild brawl that lasted more than two minutes. But despite the hatred that lingered between the sides throughout the opening four years of the Origin era, a 2-1 defeat was the best series result NSW could muster. Legendary five-eighth Wally Lewis , now an Immortal, was the driving force behind Queensland's dominance. The Mortimer-inspired Blues stopped the rot when they backed up an 18-2 win at Lang Park with the 21-14 victory at the SCG to secure the shield in 1985. When Vautin threw his jibe at Mortimer moments after the full-time siren sounded at the SCG, the stage was set for the most relieved man in NSW to floor him with his comeback. \"Not many people manage that – to put Paul Vautin back in his box with a one-liner – but that was pretty smart from Turvey,\" Webster says in an interview with Wide World of Sports. \"There was merit in what Fatty said, because Queensland had taken Origin so seriously since its conception and NSW had just never quite got there. \"I've heard (rugby league icon) Phil Gould talk about it in the past – that Queensland have always 'got' Origin better than NSW have. \"Well, the first person that really 'got it' for NSW was Steve Mortimer. \"In that chapter, I love the image from before the first game … when they're going down Caxton Street (in Brisbane) and the Queensland fans are starting to rock the bus and (NSW hooker) Benny Elias is sitting at the back of the bus. He'd never played Origin before, looking out, looking at the Caxton Hotel, seeing these Queenslanders frothing at the mouth and throwing cans of XXXX at the bus and Turvey just saying, 'See that? They hate us. Make sure we give it back to them in spades when we get on the field'. \"That's where the real Origin contest was borne – in those matches in the mid-80s.\" Mortimer made his NSW debut in 1977 and played his first Origin game in the opening match of the 1982 series. He was a member of every one of the losing Blues squads between 1982 and 1984 and was also repeatedly shunted throughout the first four years of the Origin era, for either Newtown star Tommy Raudonokis or Parramatta gun Peter Sterling . \"It was a time when NSW drew a line in the sand, finally,\" Webster says of the 1985 series. \"And the person who drew the line in the sand was Steve Mortimer – the captain and the halfback, who'd suffered as many losses as any NSW player since Origin had first happened in 1980.\" Mortimer was chaired from the SCG turf by his teammates after the 1985 series win, hands in the air as he shouted to the heavens. He then announced his retirement from representative football in the sheds, having conquered the pinnacle. Des Hasler made his Origin debut in game three and the Blues lost 20-6 at Lang Park. But those are minor details. Mortimer had steered NSW to their first series victory and retired a winner. \"There's that iconic image of him dropping to his knees and crying in the middle of the Sydney Cricket Ground. I've interviewed Turvey many times and particularly about this moment in time, for both the Herald and this book. And I said, 'Why? What was the overriding feeling?'. And he said, 'Relief'. He's very religious, Turvey. And I said, 'What were you doing?'. And he said, 'I was just thanking God'. \"And that's how much it meant to him.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/398099/211209.00_05_21_22.still007.jpg","source_id":"nine"},{"title":"Rohit is able captain and will have my 100% support: Kohli","link":"https://www.thehansindia.com/sports/cricket/rohit-is-able-captain-and-will-have-my-100-support-kohli-719922","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"\"Tired\" of quelling never-ending speculation about a rift with Rohit Sharma, India's Test skipper Virat Kohli on Wednesday described his white-ball successor as an \"able and tactically sound\" captain, who will have his complete backing as a senior player.","content":"Rohit and KohliRohit and KohliMumbai: \"Tired\" of quelling never-ending speculation about a rift with Rohit Sharma, India's Test skipper Virat Kohli on Wednesday described his white-ball successor as an \"able and tactically sound\" captain, who will have his complete backing as a senior player.Kohli, who was removed by the BCCI from ODI captaincy, made it clear that he was never spoken to about being replaced till chairman of selectors Chetan Sharma intimated him 90 minutes before the scheduled team selection meeting for the South Africa tour. Asked how he sees his role under Rohit Sharma's captaincy, Kohli said: \"My responsibility is obviously to push the team in the right direction, something that I've always looked to do even before I became captain, so that mindset has never changed and it will never change. \"But Rohit is a very able captain and tactically very sound. We've seen that in the games that he has captained for India and in the IPL as well. So is (Rahul) Dravid bhai, who's a very, very balanced coach, great man manager. \"Both of them will have my absolute support and my contribution in whatever vision they set for the team and I will be there to support that 100 per cent and continue to be a guy who can push the team in the right direction going forward from here,\" Kohli added in a press conference ahead of the team's departure to South Africa. When asked about the conjectures that all is not well between him and Rohit, the Test skipper said that he is tired of clarifying. \"I've clarified previously also - I'm tired of clarifying because it's asked repeatedly,\" he said. \"I can say with guarantee that any action of mine, any communication, won't be to put the team down till I play cricket. That's my commitment to Indian cricket.\" He then added that he understood why BCCI took a decision to remove him. \"I can understand why - the reason, we haven't won an ICC tournament,\" he said. \"Whether the decision they took is right or wrong, there's no debate. It's a logical decision which I understand. The events that transpired and the way I was communicated, I've told you.\" For him, he had led the side with utmost honesty. \"About captaincy, one thing I can say is, I've been honest to the responsibility and done it to the best of my ability. That's my assessment of my limited-overs captaincy. \"The batting, when you know you've been doing well at the international level, you know how to perform. Those things won't go away from you. It's about understanding your roles.\"","pubDate":"2021-12-15 19:53:14","full_description":"Rohit and Kohli Mumbai: \"Tired\" of quelling never-ending speculation about a rift with Rohit Sharma, India's Test skipper Virat Kohli on Wednesday described his white-ball successor as an \"able and tactically sound\" captain, who will have his complete backing as a senior player. Kohli, who was removed by the BCCI from ODI captaincy, made it clear that he was never spoken to about being replaced till chairman of selectors Chetan Sharma intimated him 90 minutes before the scheduled team selection meeting for the South Africa tour. Asked how he sees his role under Rohit Sharma's captaincy, Kohli said: \"My responsibility is obviously to push the team in the right direction, something that I've always looked to do even before I became captain, so that mindset has never changed and it will never change. \"But Rohit is a very able captain and tactically very sound. We've seen that in the games that he has captained for India and in the IPL as well. So is (Rahul) Dravid bhai, who's a very, very balanced coach, great man manager. \"Both of them will have my absolute support and my contribution in whatever vision they set for the team and I will be there to support that 100 per cent and continue to be a guy who can push the team in the right direction going forward from here,\" Kohli added in a press conference ahead of the team's departure to South Africa. When asked about the conjectures that all is not well between him and Rohit, the Test skipper said that he is tired of clarifying. \"I've clarified previously also - I'm tired of clarifying because it's asked repeatedly,\" he said. \"I can say with guarantee that any action of mine, any communication, won't be to put the team down till I play cricket. That's my commitment to Indian cricket.\" He then added that he understood why BCCI took a decision to remove him. \"I can understand why - the reason, we haven't won an ICC tournament,\" he said. \"Whether the decision they took is right or wrong, there's no debate. It's a logical decision which I understand. The events that transpired and the way I was communicated, I've told you.\" For him, he had led the side with utmost honesty. \"About captaincy, one thing I can say is, I've been honest to the responsibility and done it to the best of my ability. That's my assessment of my limited-overs captaincy. \"The batting, when you know you've been doing well at the international level, you know how to perform. Those things won't go away from you. It's about understanding your roles.\"","image_url":"https://assets.thehansindia.com/h-upload/2021/12/15/500x300_1135616-kohli.jpg","source_id":"thehansindia"},{"title":"WWE News: Royal Rumble Contest, Xavier Woods on Xplay, Birdie Tells the Bella Twins Her Naughty or Nice List","link":"https://411mania.com/wrestling/wwe-news-royal-rumble-contest-xavier-woods-on-xplay-birdie-tells-the-bella-twins-her-naughty-or-nice-list/","keywords":["The Bella Twins","WWE","Xavier Woods"],"creator":["JeffreyHarris"],"video_url":null,"description":"– WWE and Cricket Wireless have announced a Royal Rumble contest. Fans can enter for a chance to win a full trip to next month’s[.........] The post WWE News: Royal Rumble Contest, Xavier Woods on Xplay, Birdie Tells the Bella Twins Her Naughty or Nice List appeared first on 411MANIA.","content":null,"pubDate":"2021-12-15 19:51:52","full_description":null,"image_url":null,"source_id":"411mania"},{"title":"SAfrica to review report on discrimination","link":"https://www.perthnow.com.au/sport/cricket/safrica-to-review-report-on-discrimination-c-4968064","keywords":null,"creator":["AAP"],"video_url":null,"description":"Cricket South Africa says it will review \"with an open mind\" the recommendations made in an independent report into alleged racial discrimination.","content":null,"pubDate":"2021-12-15 19:25:22","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4968064/140f7a6f01b7d81cedd32e6c2fb14de0ace02e10-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"SAfrica to review report on discrimination","link":"https://thewest.com.au/sport/cricket/safrica-to-review-report-on-discrimination-c-4968062","keywords":null,"creator":["AAP"],"video_url":null,"description":"Cricket South Africa says it will review \"with an open mind\" the recommendations made in an independent report into alleged racial discrimination.","content":null,"pubDate":"2021-12-15 19:25:22","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4968062/140f7a6f01b7d81cedd32e6c2fb14de0ace02e10-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Ravindra Jadeja retirement: Why Ravindra Jadeja had to refute his retirement news on social media?","link":"https://thesportsrush.com/cricket-news-ravindra-jadeja-retirement-why-ravindra-jadeja-had-to-refute-his-retirement-news-on-social-media/","keywords":["Cricket","Ravindra Jadeja"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ravindra Jadeja retirement: India’s all rounder had to take to his social media handle to clear the air around reports of his retirement. Fake news and its propagation is not a new phenomenon. It dates back to many decades. But, the social media phenomenon coupled with easy internet access has made its consumption accessible in… The post Ravindra Jadeja retirement: Why Ravindra Jadeja had to refute his retirement news on social media? appeared first on The SportsRush.","content":"Ravindra Jadeja retirement: India’s all rounder had to take to his social media handle to clear the air around reports of his retirement. Fake news and its propagation is not a new phenomenon. It dates back to many decades. But, the social media phenomenon coupled with easy internet access has made its consumption accessible in a fraction of seconds. While we have a more than fair idea regarding the symptom of the disease, we have not made efforts to spread the available cure- the process/methods to avoid fake news sound believable and cross check them. Indian Cricket too, ranging from a couple of weeks to a few hours ago has been a victim of this fake news disease, especially under the garb of ‘BCCI officials’ or top sources in their vicinity. Be it Virat Kohli’s T20I and ODI captaincy, or reports of his alleged rift with Rohit Sharma, or more recently ‘reports’ of Ravindra Jadeja deciding to retire from Test Cricket, the so-called ‘sources’ keep doing what they know the best- invite some clickbaits. While the target involved usually does not react to such rumour mongering, someone like a Jadeja makes sure it is debunked as soon as possible. Ravindra Jadeja retirement: Jadeja reacts to reports of his retirement As per some ‘reports‘ which started floating since Tuesday, Ravindra Jadeja was considering retiring from Test cricket to prolong his white-ball career. This comes at a time when the left-handed all rounder has been excluded from Team India’s Test squad for the upcoming South Africa tour due to injury. Jadeja had missed the second Test against New Zealand in Mumbai earlier this month due to a swelling in the forearm. But, as per recent reports, he has had a ligament tear, which might take months to heal if he undergoes surgery. Post the spread of these fake reports, Jadeja had to resort to social media to clear the air around the same and explicitly state that he ‘has a long way to go’ while posting a picture with his Test jersey on. Long way to go pic.twitter.com/tE9EdFI7oh — Ravindrasinh jadeja (@imjadeja) December 15, 2021 pic.twitter.com/DAXGbZRGI4 — Ravindrasinh jadeja (@imjadeja) December 15, 2021 For more Cricket related news, click here.       The post Ravindra Jadeja retirement: Why Ravindra Jadeja had to refute his retirement news on social media? appeared first on The SportsRush.","pubDate":"2021-12-15 18:59:15","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Quartermaine, Miller fire as Harrismith record third win of season in run-fest against Towns","link":"https://thewest.com.au/news/narrogin-observer/quartermaine-miller-fire-as-harrismith-record-third-win-of-season-in-run-fest-against-towns--c-4910554","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"There were 431 runs scored between Harrismith and Towns in the Upper Great Southern Cricket Association but Jamie Miller and Arron Quartermaine guided their side to victory.","content":null,"pubDate":"2021-12-15 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4910554/37ee5daba10512b43eb8481b483a15369ea5d4ee-16x9-x0y866w3990h2244.jpg","source_id":"thewest"},{"title":"Kendenup notch fourth win of Great Southern Cricket Association season on the back of Scott Hillman century","link":"https://thewest.com.au/news/great-southern-herald/kendenup-notch-fourth-win-of-great-southern-cricket-association-season-on-the-back-of-scott-hillman-century--c-4931622","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"Australs suffered their eighth straight defeat of the Great Southern Cricket Association in the process and remain winless going into the mid-season break.","content":null,"pubDate":"2021-12-15 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4931622/d5242b58cf62610f44757854e6f1b8250ad3d43b-16x9-x417y769w595h335.jpg","source_id":"thewest"},{"title":"Quartermaine, Miller fire as Harrismith record third win of season in run-fest against Towns","link":"https://thewest.com.au/news/narrogin-observer/quartermaine-miller-fire-as-harrismith-record-third-win-of-season-in-run-fest-against-towns--c-4910554","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"There were 431 runs scored between Harrismith and Towns in the Upper Great Southern Cricket Association but Jamie Miller and Arron Quartermaine guided their side to victory.","content":null,"pubDate":"2021-12-15 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4910554/37ee5daba10512b43eb8481b483a15369ea5d4ee-16x9-x0y866w3990h2244.jpg","source_id":"thewest"},{"title":"Tambellup storm to fifth straight victory in Great Southern Cricket Association","link":"https://thewest.com.au/news/great-southern-herald/tambellup-storm-to-fifth-straight-victory-in-great-southern-cricket-association-c-4938562","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"Nathan Willmott snared three wickets and made an unbeaten half-century as Tambellup secured victory in 32 overs.","content":null,"pubDate":"2021-12-15 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4938562/61f8f065940f93e2e219a5b78d6922134fa8bd48-16x9-x309y425w3031h1705.jpg","source_id":"thewest"},{"title":"Australia vs England pink-ball Test Live Streaming and Timings in India: When and where to watch AUS vs ENG 2nd Test at Adelaide Oval?","link":"https://thesportsrush.com/cricket-news-australia-vs-england-pink-ball-test-live-streaming-and-timings-in-india-when-and-where-to-watch-aus-vs-eng-2nd-test-at-adelaide-oval/","keywords":["Cricket","Ashes 2021-22","Australia","England"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Australia vs England pink-ball Test Live Streaming: The SportsRush presents before you the timing and live streaming details of 2nd Ashes Test. The second Test of the ongoing Ashes series between Australia and England will commence at the Adelaide Oval from tomorrow. In what will be the 17th pink-ball Test match in the history of… The post Australia vs England pink-ball Test Live Streaming and Timings in India: When and where to watch AUS vs ENG 2nd Test at Adelaide Oval? appeared first on The SportsRush.","content":"Australia vs England pink-ball Test Live Streaming: The SportsRush presents before you the timing and live streaming details of 2nd Ashes Test. The second Test of the ongoing Ashes series between Australia and England will commence at the Adelaide Oval from tomorrow. In what will be the 17th pink-ball Test match in the history of cricket, it will be the eighth to be played in Australia and sixth at this particular venue. England, who had lost their lone day-night Test in Adelaide by 120 runs four years ago, would be looking to win this one not just to improve their record but also to improve the series score which stands at 0-1 (against them) at the moment. Speaking of the venue, Australia have won 42 and lost 18 out of their 79 Tests at the Adelaide Oval. Meanwhile, England have won nine and lost 18 out of their 32 Tests here. Readers must note that Australia have a phenomenal record in pink-ball Tests winning all the eight matches that they have played so far. England, on the other hand, had won their maiden day-night Test against West Indies in Birmingham only to lose their next three in Adelaide, Auckland and Ahmedabad. “Am I allowed to say that?” James Anderson picked up a few early laughs in his media conference on the eve of his 167th Test #Ashes pic.twitter.com/v6ICmh7dG3 — cricket.com.au (@cricketcomau) December 15, 2021 Australia, who confirmed their Playing XI on the eve of the match, have made a solitary change replacing fast bowler Josh Hazlewood with Jhye Richardson. While the visitors named a 12-member squad today, they will announce their final XI (with a change or more to the one which played in Brisbane) on the morning of the match. Australia vs England pink-ball Test Live Streaming Details in Australia and England Sony Sports Network, who are also televising the ongoing 11th season of the Big Bash League in India, are broadcasting Ashes 2021-22 as well to be the only option for Indian fans. In addition to Sony SIX (English commentary), which usually broadcasts cricket in India, Ashes 2021-22 is also available for public viewing on Sony TEN 3 (Hindi) and Sony TEN 4 (Tamil & Telugu) as well. For people who prefer to stream live cricket, Sony’s streaming application named Sony LIV is where they’ll get to watch this iconic series. It is worth mentioning that fans no longer have the option of watching the match on Airtel Xstream app as Sony Network’s channels are no longer available on this platform. As far as the local fans in Australia are concerned, they will be able to watch the Adelaide day-night Test on Channel 7 and Foxtel. Fans in the UK will have to switch to the tried and tested BT Sport to follow this match. Date – 16/12/2021 (Thursday) – 20/12/2021 (Monday). Match start Time – 04:00 AM (England), 09:30 AM (India) and 02:30 PM (Australia). TV Channel – Sony SIX, Sony TEN 3, Sony TEN 4 (India, Pakistan and Bangladesh), BT Sport 1 HD (UK) and Channel 7 and Foxtel (Australia). Online platform – Sony LIV (India, Pakistan and Bangladesh) and Kayo App (Australia). The post Australia vs England pink-ball Test Live Streaming and Timings in India: When and where to watch AUS vs ENG 2nd Test at Adelaide Oval? appeared first on The SportsRush.","pubDate":"2021-12-15 17:29:28","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Explained: Kohli, BCCI, Rohit, and Indian cricket's captaincy controversy - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiZWh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9leHBsYWluZWQvZXhwbGFpbmVkLWtvaGxpLWJjY2ktcm9oaXQtY2FwdGFpbmN5LWNvbnRyb3ZlcnN5LTc2NzQzMjEv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Explained: Kohli, BCCI, Rohit, and Indian cricket's captaincy controversy  The Indian ExpressKohli: Was told I wouldn't be ODI captain hour-and-a-half before SA Test squad was announced  ESPNcricinfoThe captaincy issue is a board-generated storm in a teacup  The Hindu'I can understand why I was removed as ODI captain': Top 10 Virat Kohli quotes from his press conference  Times of IndiaNo prior communication from selector before ODI captaincy decision: Virat Kohli | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-15 17:15:18","image_url":null,"source_id":"google"},{"title":"“A good chef knows what to show and what not to”: Pragyan Ojha takes sly dig at Virat Kohli after his pre departure press conference for South Africa tour","link":"https://thesportsrush.com/cricket-news-a-good-chef-knows-what-to-show-and-what-not-to-pragyan-ojha-takes-sly-dig-at-virat-kohli-after-his-pre-departure-press-conference-for-south-africa-tour/","keywords":["Cricket","BCCI","India tour of South Africa 2021-22","Pragyan Ojha","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Pragyan Ojha takes sly dig at Virat Kohli after latter addressed the press before India’s tour of South Africa to commence from December 26. It has been a week full of turmoil for the BCCI and the latest account presented by Team India’s Test skipper Virat Kolhi on Wednesday has further taken a toll on… The post “A good chef knows what to show and what not to”: Pragyan Ojha takes sly dig at Virat Kohli after his pre departure press conference for South Africa tour appeared first on The SportsRush.","content":"Pragyan Ojha takes sly dig at Virat Kohli after latter addressed the press before India’s tour of South Africa to commence from December 26. It has been a week full of turmoil for the BCCI and the latest account presented by Team India’s Test skipper Virat Kolhi on Wednesday has further taken a toll on their reputation before the stakeholders of Indian Cricket. As Kohli kept going on with his version of what all transpired post his decision to quit the team’s T20I captaincy and then being ousted as ODI captain as well before the press, fans and experts began shifting to the BCCI president Sourav Ganguly, as the next target for presenting contradictory ‘facts’ on the same on December 9. It is worth mentioning that Ganguly had in a media statement on December 9- a day after the selection committee’s decision to remove Kohli as Team India’s ODI captain, stated that the latter was requested not to step down as the team’s T20I skipper, but he refused. But Kohli, contrary to Ganguly’s claims, stated on Wednesday that no one had made any such requests before him and in fact his decision was welcomed by the BCCI as being in the best interest for the team moving forward. Now, team India’s former left-arm spinner Pragyan Ojha has taken a sly dig at Virat Kohli for blatantly speaking out the ‘facts’ before the press. Pragyan Ojha takes sly dig at Virat Kohli after latter addressed the press Former team India spinner and currently the Indian Cricketers’ Association (ICA) representative in the IPL governing council- Pragyan Ojha has taken a sly dig at Virat Kohli for purportedly speaking out the bare facts pertaining the matter of his T20I and ODI captaincy of team India. Referring him as a chef, on whose shoulder lies the responsibility of maintaining the reputation of the entire restaurant, Ojha perhaps tried to suggest that the 33-year-old should have done better before spilling beans on the matter as it is before the press. A good chef knows what to show and what not to, when he is trying to prepare a delicious dish! As the reputation of the kitchen and the restaurant is on him. #JustAThought — Pragyan Ojha (@pragyanojha) December 15, 2021     The post “A good chef knows what to show and what not to”: Pragyan Ojha takes sly dig at Virat Kohli after his pre departure press conference for South Africa tour appeared first on The SportsRush.","pubDate":"2021-12-15 17:11:04","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"SJN report: Cricket South Africa racially discriminated against players","link":"https://sportstar.thehindu.com/cricket/sjn-report-cricket-south-africa-smith-boucher-de-villiers-racially-discriminated-players/article37962731.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"The report recommends the appointment of a permanent ombudsman with proper funding and resources to handle race and gender-based complaints.","content":null,"pubDate":"2021-12-15 16:03:43","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Sandeep Lamichhane Nepal captain: Who has Sandeep Lamichhane replaced as Nepal national Cricket team captain?","link":"https://thesportsrush.com/cricket-news-sandeep-lamichhane-nepal-captain-who-has-sandeep-lamichhane-replaced-as-nepal-national-cricket-team-captain/","keywords":["Cricket","Nepal Cricket team","Sandeep Lamichhane"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sandeep Lamichhane Nepal captain: Nepal’s star leg spinner named as team’s new skipper after harsh disciplinary action on his predecessor. Nepal’s star leg spinner Sandeep Lamichhane has been elected as Nepal national team’s new skipper on Wednesday by the Cricket Association of Nepal (CAN). Lamichhane’s appointment comes after four players of the Nepal national side… The post Sandeep Lamichhane Nepal captain: Who has Sandeep Lamichhane replaced as Nepal national Cricket team captain? appeared first on The SportsRush.","content":"Sandeep Lamichhane Nepal captain: Nepal’s star leg spinner named as team’s new skipper after harsh disciplinary action on his predecessor. Nepal’s star leg spinner Sandeep Lamichhane has been elected as Nepal national team’s new skipper on Wednesday by the Cricket Association of Nepal (CAN). Lamichhane’s appointment comes after four players of the Nepal national side had been removed from the list of central contracted players’ for the year 2022. Lamichhane’s predecessor Gyanendra Malla, his deputy Dipendra Singh Airee were relieved from their respective posts on disciplinary grounds. Along with the duo, speedsters Sompal Kami and Kamal Singh Airee were also not considered for the first six months of the national team central contract starting 2022. Sandeep Lamichhane has been appointed captain of the Nepal Cricket Team Happy with the decision, fans? pic.twitter.com/RlmSO9cAyh — ESPNcricinfo (@ESPNcricinfo) December 15, 2021 Sandeep Lamichhane Nepal captain: Why were Gyanendra and Dipendra Singh removed? CAN had formed a probe committee after the aforementioned four players were deemed to have breached the board’s disciplinary code after the former were done with their grading system for the players’ contract list for the year 2022. The players were reportedly unimpressed by the their board’s ‘unfair grading’ while preparing the list of the pool of cricketers to hand out the central contracts to. The Cricket governing body had sought clarification from the players twice and concluded they were not satisfactory. Meanwhile, six members of the Nepal cricket board- Rishi Ram Gautam, Daud Ansari, Karan Mahatara, Amit Babu Pandey, Chhumbi Lama and Sanjay Singh have objected to the Nepal Cricket Board’s decision. “Taking action is not a solution as we have to play important matches in the near future. But, they didn’t agree. This decision is wrong; it will not benefit Nepali cricket,” said Chhumbi Lama. CAN’s decision can have serious repercussions taking into consideration that Nepal are to play the 2022 ICC T20 World Cup Qualifiers in Oman next year in February. Meanwhile, Sandeep who is currently playing for the Hobart Hurricanes in the ongoing Big Bash league 2021-22 will lead his national side for the first time. Team Nepal will play against the likes of Ireland, Canada, Oman, Phillippines, Germany, Bahrain in Group A of the the T20 World Cup qualifier. They will join Namibia, Scotland, West Indies, and Sri Lanka to battle it out for the two spots in the ‘Super 12’ teams of next year’s T20 World Cup in Australia, if they manage to qualify. Among the 16 teams, the top 8 teams from the 2021 T20 world cup are automatically qualified for the T20 world cup 2022.           The post Sandeep Lamichhane Nepal captain: Who has Sandeep Lamichhane replaced as Nepal national Cricket team captain? appeared first on The SportsRush.","pubDate":"2021-12-15 15:35:50","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"ABD, Smith accused of prejudicial conduct in Social Justice and Nation-Building commission report","link":"https://www.indiatvnews.com/sports/cricket/abd-smith-accused-of-prejudicial-conduct-in-social-justice-and-nation-building-commission-report-749750","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa (CSA) and some top former players such as Graeme Smith and A B de Villiers have been accused of engaging in racially \"prejudicial conduct\" against players by the Social Justice and Nation-Building (SJN) commission.","content":null,"pubDate":"2021-12-15 14:53:18","full_description":"Cricket South Africa (CSA) and some top former players such as Graeme Smith and A B de Villiers have been accused of engaging in racially \"prejudicial conduct\" against players by the Social Justice and Nation-Building (SJN) commission. According to 'ESPNcricinfo', a 235-page final report submitted by the SJN Commission head Dumisa Ntsebeza has accused CSA administration, former captain and current director Smith, current head coach Mark Boucher and former batter de Villiers of unfairly discriminating against black players. De Villiers, a much-admired figure in South African cricket who recently retired, denied the charge. \"I support the aims of CSA's Social Justice and Nation Building process, to ensure equal opportunities in cricket,\" he tweeted. \"However, in my career, I expressed honest cricketing opinions only ever based on what I believed was best for the team., never based on anyone's race. That's the fact.\" The report has recommended for the appointment of a permanent ombudsman to deal with race and gender-based complaints in South Africa cricket. The report has also recommended that CSA puts in place an anonymous grievance policy. The issue came to light after Boucher and former spinner Paul Adams testified that the latter was given a nickname, which had racial overtones, by his national team-mates, including the current head coach. The SJN Commission report also mentioned Thami Tsolekile's non-selection in the national side following the retirement of Boucher in 2012. \"The decision of the panel was totally irrational and showed clear signs of systemic racism,\" the report read, according to the website. \"CSA, Mr Graeme Smith and some selectors at the time really failed Mr Tsolekile and many black players of this time in many ways.\" The allegations against de Villiers were based on his handling of Khaya Zondo when he was part of South Africa's ODI squad that toured India in 2015. He was not selected in the team when was injured for the final match of the series. In Zondo's place, , who was a part of the Test squad, played in that match. The report stated that it was done \"just to ensure that a black player was not placed in a position which he deemed as requiring greater experience.\" Boucher had admitted that he was among those who sang a song which included the slur for which he has already apologised, stating that white players in South Africa were unprepared for the realities of post-Apartheid team dynamics. CSA has said that the SJN process, which was initially supposed to last four months but was extended to over six, cost the organisation USD 500,000, but felt it was \"both necessary and productive.\"","image_url":null,"source_id":"indiatvnews"},{"title":"Controversial day in Indian cricket: What happened after Virat Kohli's explosive statements - 10 points","link":"https://www.indiatoday.in/sports/cricket/story/controversial-day-in-indian-cricket-what-happened-after-virat-kohli-s-explosive-statements-10-points-1888252-2021-12-15?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Controversial day in Indian cricket: What happened after Kohli's explosive statements?","content":null,"pubDate":"2021-12-15 14:38:23","full_description":"There was very little talk about India’s tour of South Africa as Virat Kohli sat down to take questions in the customary pre-departure press conference ahead of the much-anticipated tour. The Test captain did not hold back as he quashed rumours, addressed many much-talk-about issues, but his explosive comments also gave rise to a lot of new questions that remain unanswered. One of the most powerful personalities in Indian cricket, Virat Kohli was dominating headlines over the last few days as rumours of rift between him and limited-overs captain Rohit Sharma were doing rounds. The timing of his decision to quit T20I captaincy and the way he was removed as ODI captain gave rise to plenty of speculation and rumour that he will not play the ODI series in South Africa created a stir with the likes of Sports Minister, Anurag Thakur and former India captain Mohammad Azharuddin chipping in with their take on the speculation. Also Read: Is it Virat Kohli or Sourav Ganguly? Who is speaking the truth? Kohli maintained his calm and answered some pressing questions, including the turn of events in the lead up to his sacking of ODI captain on December 8. The BCCI, in a single line in their statement to announce the Test squad for South Africa tour, had said Kohli will no longer lead India in ODIs and Rohit would assume the responsibility of full-time white-ball captain. Kohli had announced his decision to quit as T20I captain before the T20 World Cup, but at that time, stressed he would want to continue as ODI and Test captain. 1. Kohli began by confirming that he was always available for South Africa ODI series and hit out at those writing “lies” about him. I was and I am available for selection... all this time. You should not be asking me this question, honestly. These questions should be asked to those who are writing these stories and their sources. As far as I am concerned, I was always available. I had not had any communication with the BCCI that I want to rest. So there were a few things that came out in the past as well where it was said that I was attending some events or something, which was absolutely not true. All these people who are writing these things and their sources, to me, they are absolutely not credible. - Virat Kohli 2. Kohli said he was only informed by the BCCI chief selector, Chetan Sharma that he was removed as ODI captain 90 minutes before the announcement was made official. He highlighted that there was lack of communication in the lead up to his removal as the skipper of the 50-over team. Whatever was said about the communication that happened during the decision that was made was inaccurate. I was contacted 1.5 hours before the selection committee meeting on the 8th [December] for the Test series and there was no prior communication with me at all since I announced the T20 captaincy decision, up till the 8th of December when I got a call for the selection meeting The chief selector discussed with me the Test team... to which we both agreed. Before we ended the call, I was told that the five selectors had decided that I won’t be ODI captain to which I replied, ‘Okay, fine’. In the selection call afterwards we discussed it briefly. - Virat Kohli 3. Kohli contradicted BCCI president Sourav Ganguly’s claim that the former skipper had spoken to him personally and urged him to not leave T20I captaincy. About the T20I captaincy, I first approached the BCCI explaining my point of view, thought process and reasons. And at that point, it was received very well. There was no offence. There was no hesitancy. I was not told to not leave the T20I captaincy rather it was received as a progressive call. In the right direction - Virat Kohli 4. Meanwhile, Kohli also said he made it clear to the selectors in September that he wanted to continue as ODI and T20I captain but he would be happy to accept any decision that the “BCCI office-bearers or the selectors” take about him continuing as skipper in the other two formats. I had also communicated that yes, I would like to continue as the skipper in Tests and ODIs unless the office-bearers or the selectors feel I shouldn’t continue. This too was clarified on the call. So my communication with the BCCI was clear from that point on. I had given the option to the officials, that the decision was in their hands if I should continue or not. - Virat Kohli 5. Kohli labelled BCCI's decision to remove him as ODI captain logical but hinted once again he was not pleased with the way in which he was communicated about the decision. Reasons... obviously, we haven't won an ICC tournament. I can understand the reasons. There is no debate on whether the decision was right or wrong. The decision taken by the BCCI has been taken with a logical point of view which is understandable. I get it. I have already spoken about how things transpired earlier. - Virat Kohli 6. Meanwhile, a BCCI source speaking to India Today, dismissed Kohli's claims, saying that the selector had told him not to quit T20I captaincy in September. It also said that chief selector Chetan Sharma had informed about his removal from ODI captaincy in the morning of the day of the selection meeting for South Africa Tests. 7. Virat Kohli rubbished rumours of rift between him and Rohit Sharma, saying he is tired of repeating it again and again. As far as my relationship with Rohit goes, I have said earlier as well that there are no problems between us and honestly, I am tired of answering the same question over and over again over the last 2-2.5 years. I can say with absolute guarantee that no action of mine will be to bring down the team as long as I play the game. That has always been my point of view for Indian cricket and this is my commitment to Indian cricket. - Virat Kohli 8. Meanwhile, Kohli said the new ODI and T20I leadership group will have his full support. He also heaped praise on Rohit Sharma's white-ball exploits as captain. Rohit is a very able captain and very, very tactically sound. We have seen that in the games where he has captained India and in the IPL as well. And with Rahul bhai, who is a very balanced coach and great man-manager... both of them will have my absolute support and my contribution in whatever vision they set for the team. I will support that 100% and continue to be the guy who can push the team in the right direction. - Virat Kohli 9. Kohli said him not being the captain will in no way affect his commitment to the team and his keenness to win matches for the country. Well, my responsibility is always to push the team in the right direction. It is something that I have always looked to do... even before I became captain. So that mindset has never changed and it will never change. - Virat Kohli 10. Speaking to India Today, legendary Sunil Gavaskar said Sourav Ganguly is the best person to talk about the discrepancy that exists between his comments and what the India Test captain said on Wednesday. I think it (Kohli's comments) actually doesn't bring the BCCI into the picture. I think it's the individual who has to be asked where he got the impression he had conveyed such a message to Kohli. So that's the only thing. Yes, he is the BCCI president and surely he should be asked why there is this discrepancy. He is probably the best person to ask about the discrepancy in what you seem to have to say and what the Indian captain has said. - Sunil Gavaskar Live TV Also Read | Have taken a lot of pride in batting as a captain, absolutely honest to the job, says Virat Kohli","image_url":null,"source_id":"indiatoday"},{"title":"AB de Villiers, Graeme Smith accused of engaging in racially 'prejudicial conduct' against players","link":"https://zeenews.india.com/cricket/ab-de-villiers-graeme-smith-accused-of-engaging-in-racially-prejudicial-conduct-against-players-2419623.html","keywords":null,"creator":null,"video_url":null,"description":"De Villiers, a much-admired figure in South African cricket who recently retired, denied the charge.","content":null,"pubDate":"2021-12-15 14:38:00","full_description":null,"image_url":null,"source_id":"zeenews"}]}