{"newsArray":[{"title":"\"I Like To Captain How...\": Hardik Makes Honest Leadership Confession","link":"https://sports.ndtv.com/cricket/i-like-to-captain-how-skipper-hardik-pandya-makes-honest-leadership-confession-4293627","keywords":null,"creator":null,"video_url":null,"description":"The nine-wicket win over West Indies in the fourth T20I left Hardik Pandya a pleased man.","content":"After being 0-2 down in the 5-match T20I series against West Indies, Hardik Pandya's Indian team bounced back to win the next two matches in convincing fashion, making it 2-2, with just the 5th and the final match to go. After the West Indies leg of the series, both the teams arrived in the United States of America where Shubman Gill and Yashasvi Jaiswal stole th show with the bat. India skipper Hardik opened up on the dramatic turnaround in the team's fortunes, explaining his style of leadership. For Pandya it was just the beginning and urged the batters to be ready for bigger situations. \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. India were trailing 0-2 after the first two matches, but won the third and fourth games to roar back into the series. Pandya was understandably elated by the team's effort. \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Jaiswal, who struck an unbeaten 84 off 51 balls, was adjudged man of the match, and the left-hander said he batted as per the team's needs. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell. With PTI inputs","pubDate":"2023-08-13 02:56:31","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"Babar Azam Wanted To...\": Virat Kohli On First Interaction With Pak Star","link":"https://sports.ndtv.com/cricket/babar-azam-wanted-to-virat-kohli-on-first-interaction-with-pakistan-star-4293473","keywords":null,"creator":null,"video_url":null,"description":"India's stalwart batter Virat Kohli heaped praise on Pakistan skipper Babar Azam calling him probably the top batter across formats in the entire world.","content":"Indian and Pakistani players don't get to play against each other too often but there still remains mutual respect among cricketers from both countries. Virat Kohli and Babar Azam, two of the greatest batters of their generation, haven't faced each other on many occasions but both know that the quality they bring to their respective teams. In a recent interaction, Kohli opened up his rapport with Babar, calling the Pakistani batter probably the top batter across formats in the entire world. Kohli and Babar have been setting new batting standards in the world of cricket. While they compete on the field against each other, off the field Virat admitted that he has always held a lot of regard as well as respect for the top ODI batter. While speaking to Star Sports as quoted by ESPNcricinfo, Kohli spoke about his relationship with Babar. \"The first interaction I had with him (Babar Azam) was during the 2019 (ODI) World Cup after the game in Manchester. I've known Imad (Wasim) since the Under-19 World Cup, and he said Babar wanted to have a chat. We sat down and spoke about the game. I saw a lot of regard and respect from him from day one, and that hasn't changed,\" Kohli said. \"Regardless of the fact he's probably the top batsman in the world across formats, and rightly so. Performs so consistently and I've always enjoyed watching him play,\" Kohli added. The rivalry between both batters has always managed to be the centre of attraction in the action-packed encounter between India and Pakistan for the past five years. When Kohli's struggle began with the bat, Babar entered his prime and surpassed Kohli in the ODI rankings to become the top ODI batter. The 28-year-old Pakistan captain has played in 104 T20Is, 100 ODIs, and 49 Tests. He is a star in each of all three forms. He currently has 12346 runs, including 30 centuries, to his name at the top level. As far as his performance is considered in the ODIs, every time Babar Azam comes onto the pitch, there are expectations of him due to the high standards he has set in the format. He is the top-ranked ODI batsman, which makes it more obvious. Babar has barely ever been out of form in the 50-over format, scoring more than 5000 runs at an average of nearly 60. On the other hand, with 8,676 runs in 111 Tests with 29 centuries and 29 fifties each, 12,898 runs in 275 ODIs with 46 centuries and 65 fifties and 4,008 runs in 115 T20Is with one century and 37 fifties, Kohli is one of the most successful batters of all time. Advertisement Currently sitting at 25,000 international runs and 76 centuries, fans keep a count of each run and century he scores, in anticipation of him breaking legendary Indian cricketer Sachin Tendulkar's record of 34,357 international runs and 100 centuries. Both batters will once again step on the field to face each other in the upcoming Asia Cup clash on September 2. With ANI inputs","pubDate":"2023-08-13 02:43:20","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Kuldeep Yadav Conjures Spin Magic To Strike Twice In Same Over","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-4th-t20i-kuldeep-yadav-strikes-twice-in-same-over-to-halt-west-indies-charge-watch-4293635","keywords":null,"creator":null,"video_url":null,"description":"After being introduced to the attack, Kuldeep Yadav struck twice in his first over.","content":"Team India on Saturday hammared West Indies by nine wickets in the fourth T20I in Lauderhill, California to force the series-decider, which will be played at the same venue on Sunday. An outstanding effort by the bowlers, followed by a colossal opening partnership between Shubman Gill and Yashasvi Jaiswal saw India chase down 179 with three overs to spare. While Arshdeep Singh (3/38) was India's most successful bowler in terms of wickets, it was Kuldeep Yadav (2/26) who kept the Windies batting unit on a tight leash. After being introduced to the attack, Kuldeep struck twice in the same over to dismiss Nicholas Pooran and Rovman Powell . Outwitting batters; one spin at a time - Kuldeep Yadav #WIvIND #JioCinema #SabJawaabMilenge #teamindia pic.twitter.com/n2VT3TAFKz Electing to bat first, West Indies' essay revolved around two partnerships - a 49 for the fifth wicket between Hope and Hetmyer and then a 47 for the eighth wicket between Hetmyer and Odean Smith . However, the home batsmen, save Shimron Hetmyer (61) and Shai Hope (45), failed to capitalise on an excellent chance to put on board a bigger total. In reply, Jaiswal and Gill used the wicket's friendly nature to the hilt as 66 runs cascaded in the Power Play segment. Both went on to score their maiden half-centuries, and ensured that the total was not even sufficient to stretch India. Gill (77 off 47 balls) and Jaiswal (84 not out off 51 balls) added 165 runs for the first wicket.","pubDate":"2023-08-13 02:26:05","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 4th T20I: Batters Need To Take More Responsibility To Support Bowlers, Says Hardik Pandya","link":"https://news.abplive.com/sports/cricket/ind-vs-wi-4th-t20i-highlights-hardik-pandya-says-batters-need-to-take-more-responsibility-to-support-bowlers-1622635","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"IND vs WI 4th T20I Highlights: Team India's T20 captain Hardik Pandya is a pleased man following his team's series-levelling win over West Indies in IND vs WI 4th T20I on Saturday (August 12) in USA's Florida. India's nine-wicket win over West Indies is the first time when Men in Blue defeated the hosts by eight or more wickets in a T20 International match. Ebullient fifties from openers Shubman Gill 77 (4 balls) and Yashasvi Jaiswal (unbeaten 84 off 51 balls) helped India, after going down 0-2, level the five-match series 2-2. But for captain Pandya it was just the beginning as urged the batters to take more responsibility going forward to support the bowlers. The fifth and final T20I will be played on Sunday (August 13). \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. \"Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. Pandya was understandably elated by the team’s effort. \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Man of the match Yashasvi Jaiswal, who notched up his maiden T20 fifty in 4th T20I and before this had scored a ton against the same opponents on his Test debut, said he batted as per the team's requirements. \"I just try to play how the team needs and how I can express myself. I think of how quickly I can score and how many runs I can get in the power play. Of course, reading the wicket and the situation (matters), but my intent is always to score runs,\" said Jaiswal. \"I would love to thank Hardik bhai and the support staff, the way they have spoken had an impact. I just like to go out and enjoy myself,\" he said. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell. ","content":"IND vs WI 4th T20I Highlights: Team India's T20 captain Hardik Pandya is a pleased man following his team's series-levelling win over West Indies in IND vs WI 4th T20I on Saturday (August 12) in USA's Florida. India's nine-wicket win over West Indies is the first time when Men in Blue defeated the hosts by eight or more wickets in a T20 International match. Ebullient fifties from openers Shubman Gill 77 (4 balls) and Yashasvi Jaiswal (unbeaten 84 off 51 balls) helped India, after going down 0-2, level the five-match series 2-2. But for captain Pandya it was just the beginning as urged the batters to take more responsibility going forward to support the bowlers. The fifth and final T20I will be played on Sunday (August 13). \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. \"Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. Pandya was understandably elated by the team’s effort. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Man of the match Yashasvi Jaiswal, who notched up his maiden T20 fifty in 4th T20I and before this had scored a ton against the same opponents on his Test debut, said he batted as per the team's requirements. \"I just try to play how the team needs and how I can express myself. I think of how quickly I can score and how many runs I can get in the power play. Of course, reading the wicket and the situation (matters), but my intent is always to score runs,\" said Jaiswal. \"I would love to thank Hardik bhai and the support staff, the way they have spoken had an impact. I just like to go out and enjoy myself,\" he said. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell.","pubDate":"2023-08-13 02:04:51","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/13/e7b31db7f6e324916b761a0a3f4605f5169189225838524_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Percy set for retirement giving us many points to ponder","link":"http://island.lk/percy-set-for-retirement-giving-us-many-points-to-ponder/","keywords":["Sports","Featured","Gamini Dissanayake","Percy","Percy Abeysekara"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Rex Clementine Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, […]","content":"Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-13 00:01:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Over 5,000 competitors to vie for top honours","link":"http://island.lk/over-5000-competitors-to-vie-for-top-honours/","keywords":["Sports","All Island Aquatic Championship 2023","competitors"],"creator":["Thilina Walpola"],"video_url":null,"description":"48th Sri Lanka Schools All Island Aquatic Championship 2023 Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 […]","content":"Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-12 23:40:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jaiswal, Gill school Windies as India level series","link":"http://island.lk/jaiswal-gill-school-windies-as-india-level-series/","keywords":["Sports","India tour of West Indies 2023 4th T20I","Wst Indies vs India 4th T20I"],"creator":["Priyan"],"video_url":null,"description":"Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine […]","content":"Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-12 22:20:21","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"McDermott and bowlers propel Dambulla Aura to fifty run win","link":"http://island.lk/mcdermott-and-bowlers-propel-dambulla-aura-to-fifty-run-win/","keywords":["Latest News","Sports","Ben McDermott","Lanka Premier League 2023","LPL 2023"],"creator":["Priyan"],"video_url":null,"description":"An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player […]","content":"An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16 Published on By The Chinese People’s Liberation Army’s Navy warship HAI YANG 24 HAO which arrived at the port of Colombo on a formal visit on 10th August departed the island on Saturday (12) after successful completion of the visit. Published on By B-Love Kandy defeated Jaffna Kings by 8 runs to register their fourth consecutive win in the Lanka Premier League 2023. The match the 15th game in the LPL2023 was played at the R Premadasa International Cricket Stadium today (12). Mohammad Harris was named player of the match for his 51 ball 81. 178/8 in 20 overs (Mohammad Harris 81, Fakhar Zaman 22, Angelo Mathews 22; Nuwan Thushara 3-31, Dunith Wellalage 2-43, Dilshan Madushanka 2-31) 170/6 in 20 overs (Chris Lyn 27, Shoaib Malik 55*, David Miller 24, Thisara Perera 36; Angelo Mathews 3-10, Nuwan Pradeep 2-48, Isuru Udana 1-30) Published on By","pubDate":"2023-08-12 22:06:04","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Building hockey’s new golden dreams","link":"https://www.sundaymail.co.zw/building-hockeys-new-golden-dreams","keywords":["Opinion & Analysis","Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"The Art of Sport Arthur Choga TODAY, the country hosts the Zimbabwe vs Zambia Development Hockey Series at St John’s Educational Trust Astro Turf in Borrowdale, Harare. The series, which features 388 talented hockey players, has been billed as a celebration of the sport and an incubator of future stars. The event will feature six […]","content":"The Sunday Mail TODAY, the country hosts the Zimbabwe vs Zambia Development Hockey Series at St John’s Educational Trust Astro Turf in Borrowdale, Harare. The series, which features 388 talented hockey players, has been billed as a celebration of the sport and an incubator of future stars. The event will feature six international games. Fifty coaches and managers are in attendance. By the end of the series, teams will have played 33 matches. Hockey will always have a special place in the history of local sport. In 1980, women’s field hockey was introduced at the Olympics — held in Moscow, in the old Soviet Union (now Russia) — for the first time, and the Zimbabwe women’s national field hockey team won gold at that event. The squad of 16 women was assembled less than a month before the Olympics began to help fill gaps the American-led Olympic boycott created in the women’s hockey competition. The team members were Arlene Boxall, Liz Chase (vice captain), Sandra Chick, Gillian Cowley, Patricia Davies, Sarah English, Maureen George, Ann Grant (captain), Susan Huggett, Patricia McKillop, Brenda Phillips, Christine Prinsloo, Sonia Robertson, Anthea Stewart, Helen Volk and Linda Watson. Zimbabwe’s three wins and two draws in the round-robin tournament were remarkable, especially considering the team’s lack of preparation and experience. Won at a time of great political transition in Zimbabwe, the gold medal was the country’s first Olympic medal of any colour. From then on, the team was known as “The Golden Girls”. The 1980 Olympics were first to feature Zimbabwe under the new name, coming as they did just a few months after the country celebrated independence on April 18. The country had been barred from the previous three Olympics for political reasons. It had last competed as Rhodesia in 1964. The women’s hockey matches, held between July 25 and 31, were all played on artificial turf, which none of the Zimbabwean team members had ever seen before. They had also never played together until that month. After beating Poland and the Union of Soviet Socialist Republics (USSR), and drawing with Czechoslovakia and India, the Zimbabweans won the competition on the final day by 4-1 over Austria. Notably, the team was made up of some bank officials, secretaries, teachers and bookkeepers. One of the players was even listed as a housewife. The oldest member of that team, Stewart, who was 35, doubled as the coach. The youngest was goalkeeper Boxall, who was 18 years old. At the 1995 All-Africa Games that Zimbabwe hosted, and for which the country built two new purpose-made fields from scratch (one at Khumalo in Bulawayo and the other at the National Sports Stadium), the women’s team won a silver medal. The two stadia are not in use today but the basic infrastructure still exists. National team games taking place at school facilities speak directly to an urgent need for a sports infrastructure strategy for the country to ensure that, even as associations, schools and individuals invest effort and resources into developing the various sports in the country, there is an all-encompassing and deliberate drive to develop and upgrade the country’s sporting facilities. The levels of interest in the sport makes it vital to devote resources to it. One of the basics of becoming a sporting powerhouse is identifying sports you excel in as a nation and pursuing them with vigour. In an earlier article, I talked about how Sri Lanka and India do not lose sleep when their national football teams underperform, but take a major interest in the fortunes of their cricket teams. Hockey has an advantage in that the basic infrastructure is already there. In my younger days, we used to see a young man by the name of Denim Mutandwa in Mbare, who played hockey for the Eradicators team set up by Custom Kachambwa. The team included stars like Alec Isulu, Mutandwa, Jeremiah Matibiri, Erasmus Hodza, Nathan Sundayi, Emmanuel Malvas, Cletos Paraziva, Adam Ngoma, Wellington Ngoma, Duncan Donkeni and Anthony Fyfe. Eradicators played a part in bringing the game to black players and had a following in high-density areas, in much the same way Takashinga did for cricket. The current series and recent performances by junior and senior hockey teams, both male and female, bring back a sense of expectation in the sport. ■","pubDate":"2023-08-12 22:02:38","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Youth vs experience in Zimbabwe, South Africa cricket series","link":"https://www.sundaynews.co.zw/youth-vs-experience-in-zimbabwe-south-africa-cricket-series/","keywords":["Sports"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter IT will be youth versus experience when Zimbabwe and South Africa Emerging sides face off in their five-match one day series opener at the Groenkloof Oval in Pretoria, South Africa today. Zimbabwe picked an experienced squad for the series while their competitors, South Africa settled for youthful players who are yet […]","content":"The Sunday News IT will be youth versus experience when Zimbabwe and South Africa Emerging sides face off in their five-match one day series opener at the Groenkloof Oval in Pretoria, South Africa today. Zimbabwe picked an experienced squad for the series while their competitors, South Africa settled for youthful players who are yet to get a feel of the highest level. Both sides will be hoping to hit the ground running early. Only four players from Zimbabwe’s 15-member squad are yet to play international cricket while none of South Africa’s players have had a feel of the biggest stage. There are 141 One Day International (ODI) caps in the Zimbabwe Emerging camp while the hosts have none. The Zimbabwe team, which is under the tutelage of senior men’s national team assistant coach, Stuart Matsikenyeri, will go in as favourites given the experience that they possess, however, the South African youngsters would be no push overs as some have played in the Under-19s World Cup, thus know what to expect. Some of the “experienced” players in the Zimbabwean camp include Luke Jongwe, who has 40 ODI caps, Wessly Madhevere with 36 caps, Tadiwanashe Marumani with 12 caps and Victor Nyauchi who has 10 senior appearances. The players yet to get a feel of ODI cricket are Faraz Akram, Brian Bennette, Jonathan Campbell, and Tanunurwa Makoni. For the hosts, most of their players have been doing well over the past year and have the likes of former Proteas Under-19 skipper, George van Heerden, reigning CSA Domestic Newcomer of the Year, Dafabet Warriors’ batter Jordan Hermann. The 21-year-old scored 297 runs at an average of 49.50 during last season’s One-Day Cup campaign, including a top score of 150 against Paarl Rocks. His form also earned him a spot on the South Africa “A” tour of Sri Lanka in June. Some of the South African players that also took part in the Under-19 World Cup are Liam Alder, Matthew Boast, Michael Copeland and Valentine Kitime. Despite picking a youthful team compared to the Zimbabwean side, South Africa Emerging head coach Maketa said the series will be a good platform to put in action what they have been working on, adding that his side is well balanced. “We have a well-balanced squad that has worked hard for the past three months at the High-Performance Centre in Pretoria. They are looking forward to the series as it’s almost like a nice reward to put into practice what we have been working on for the past three months. “The whole aim of the National Academy is to prepare these players to get ready for the next level and this series will provide the opportunity to come up against international opposition and really put their skills to the test. “As coaches, we are looking forward to having the guys play in different situations and roles, and ultimately see how they respond to playing under pressure,” he said in a statement from Cricket South Africa (CSA). After today’s opener, the other matches will take place on 15, 18, 21 and 23 August. All games will be played at the Groenkloof Oval. All the matches will be streamed live via the official CSA YouTube channel. —@brandon_malvin","pubDate":"2023-08-12 22:02:06","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"\"I Like To Captain How...\": Hardik Makes Honest Leadership Confession","link":"https://sports.ndtv.com/cricket/i-like-to-captain-how-skipper-hardik-pandya-makes-honest-leadership-confession-4293627","keywords":null,"creator":null,"video_url":null,"description":"The nine-wicket win over West Indies in the fourth T20I left Hardik Pandya a pleased man.","content":"After being 0-2 down in the 5-match T20I series against West Indies, Hardik Pandya's Indian team bounced back to win the next two matches in convincing fashion, making it 2-2, with just the 5th and the final match to go. After the West Indies leg of the series, both the teams arrived in the United States of America where Shubman Gill and Yashasvi Jaiswal stole th show with the bat. India skipper Hardik opened up on the dramatic turnaround in the team's fortunes, explaining his style of leadership. For Pandya it was just the beginning and urged the batters to be ready for bigger situations. \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. India were trailing 0-2 after the first two matches, but won the third and fourth games to roar back into the series. Pandya was understandably elated by the team's effort. \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Jaiswal, who struck an unbeaten 84 off 51 balls, was adjudged man of the match, and the left-hander said he batted as per the team's needs. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell. With PTI inputs","pubDate":"2023-08-13 02:56:31","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"Babar Azam Wanted To...\": Virat Kohli On First Interaction With Pak Star","link":"https://sports.ndtv.com/cricket/babar-azam-wanted-to-virat-kohli-on-first-interaction-with-pakistan-star-4293473","keywords":null,"creator":null,"video_url":null,"description":"India's stalwart batter Virat Kohli heaped praise on Pakistan skipper Babar Azam calling him probably the top batter across formats in the entire world.","content":"Indian and Pakistani players don't get to play against each other too often but there still remains mutual respect among cricketers from both countries. Virat Kohli and Babar Azam, two of the greatest batters of their generation, haven't faced each other on many occasions but both know that the quality they bring to their respective teams. In a recent interaction, Kohli opened up his rapport with Babar, calling the Pakistani batter probably the top batter across formats in the entire world. Kohli and Babar have been setting new batting standards in the world of cricket. While they compete on the field against each other, off the field Virat admitted that he has always held a lot of regard as well as respect for the top ODI batter. While speaking to Star Sports as quoted by ESPNcricinfo, Kohli spoke about his relationship with Babar. \"The first interaction I had with him (Babar Azam) was during the 2019 (ODI) World Cup after the game in Manchester. I've known Imad (Wasim) since the Under-19 World Cup, and he said Babar wanted to have a chat. We sat down and spoke about the game. I saw a lot of regard and respect from him from day one, and that hasn't changed,\" Kohli said. \"Regardless of the fact he's probably the top batsman in the world across formats, and rightly so. Performs so consistently and I've always enjoyed watching him play,\" Kohli added. The rivalry between both batters has always managed to be the centre of attraction in the action-packed encounter between India and Pakistan for the past five years. When Kohli's struggle began with the bat, Babar entered his prime and surpassed Kohli in the ODI rankings to become the top ODI batter. The 28-year-old Pakistan captain has played in 104 T20Is, 100 ODIs, and 49 Tests. He is a star in each of all three forms. He currently has 12346 runs, including 30 centuries, to his name at the top level. As far as his performance is considered in the ODIs, every time Babar Azam comes onto the pitch, there are expectations of him due to the high standards he has set in the format. He is the top-ranked ODI batsman, which makes it more obvious. Babar has barely ever been out of form in the 50-over format, scoring more than 5000 runs at an average of nearly 60. On the other hand, with 8,676 runs in 111 Tests with 29 centuries and 29 fifties each, 12,898 runs in 275 ODIs with 46 centuries and 65 fifties and 4,008 runs in 115 T20Is with one century and 37 fifties, Kohli is one of the most successful batters of all time. Advertisement Currently sitting at 25,000 international runs and 76 centuries, fans keep a count of each run and century he scores, in anticipation of him breaking legendary Indian cricketer Sachin Tendulkar's record of 34,357 international runs and 100 centuries. Both batters will once again step on the field to face each other in the upcoming Asia Cup clash on September 2. With ANI inputs","pubDate":"2023-08-13 02:43:20","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Kuldeep Yadav Conjures Spin Magic To Strike Twice In Same Over","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-4th-t20i-kuldeep-yadav-strikes-twice-in-same-over-to-halt-west-indies-charge-watch-4293635","keywords":null,"creator":null,"video_url":null,"description":"After being introduced to the attack, Kuldeep Yadav struck twice in his first over.","content":"Team India on Saturday hammared West Indies by nine wickets in the fourth T20I in Lauderhill, California to force the series-decider, which will be played at the same venue on Sunday. An outstanding effort by the bowlers, followed by a colossal opening partnership between Shubman Gill and Yashasvi Jaiswal saw India chase down 179 with three overs to spare. While Arshdeep Singh (3/38) was India's most successful bowler in terms of wickets, it was Kuldeep Yadav (2/26) who kept the Windies batting unit on a tight leash. After being introduced to the attack, Kuldeep struck twice in the same over to dismiss Nicholas Pooran and Rovman Powell . Outwitting batters; one spin at a time - Kuldeep Yadav #WIvIND #JioCinema #SabJawaabMilenge #teamindia pic.twitter.com/n2VT3TAFKz Electing to bat first, West Indies' essay revolved around two partnerships - a 49 for the fifth wicket between Hope and Hetmyer and then a 47 for the eighth wicket between Hetmyer and Odean Smith . However, the home batsmen, save Shimron Hetmyer (61) and Shai Hope (45), failed to capitalise on an excellent chance to put on board a bigger total. In reply, Jaiswal and Gill used the wicket's friendly nature to the hilt as 66 runs cascaded in the Power Play segment. Both went on to score their maiden half-centuries, and ensured that the total was not even sufficient to stretch India. Gill (77 off 47 balls) and Jaiswal (84 not out off 51 balls) added 165 runs for the first wicket.","pubDate":"2023-08-13 02:26:05","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 4th T20I: Batters Need To Take More Responsibility To Support Bowlers, Says Hardik Pandya","link":"https://news.abplive.com/sports/cricket/ind-vs-wi-4th-t20i-highlights-hardik-pandya-says-batters-need-to-take-more-responsibility-to-support-bowlers-1622635","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"IND vs WI 4th T20I Highlights: Team India's T20 captain Hardik Pandya is a pleased man following his team's series-levelling win over West Indies in IND vs WI 4th T20I on Saturday (August 12) in USA's Florida. India's nine-wicket win over West Indies is the first time when Men in Blue defeated the hosts by eight or more wickets in a T20 International match. Ebullient fifties from openers Shubman Gill 77 (4 balls) and Yashasvi Jaiswal (unbeaten 84 off 51 balls) helped India, after going down 0-2, level the five-match series 2-2. But for captain Pandya it was just the beginning as urged the batters to take more responsibility going forward to support the bowlers. The fifth and final T20I will be played on Sunday (August 13). \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. \"Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. Pandya was understandably elated by the team’s effort. \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Man of the match Yashasvi Jaiswal, who notched up his maiden T20 fifty in 4th T20I and before this had scored a ton against the same opponents on his Test debut, said he batted as per the team's requirements. \"I just try to play how the team needs and how I can express myself. I think of how quickly I can score and how many runs I can get in the power play. Of course, reading the wicket and the situation (matters), but my intent is always to score runs,\" said Jaiswal. \"I would love to thank Hardik bhai and the support staff, the way they have spoken had an impact. I just like to go out and enjoy myself,\" he said. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell. ","content":"IND vs WI 4th T20I Highlights: Team India's T20 captain Hardik Pandya is a pleased man following his team's series-levelling win over West Indies in IND vs WI 4th T20I on Saturday (August 12) in USA's Florida. India's nine-wicket win over West Indies is the first time when Men in Blue defeated the hosts by eight or more wickets in a T20 International match. Ebullient fifties from openers Shubman Gill 77 (4 balls) and Yashasvi Jaiswal (unbeaten 84 off 51 balls) helped India, after going down 0-2, level the five-match series 2-2. But for captain Pandya it was just the beginning as urged the batters to take more responsibility going forward to support the bowlers. The fifth and final T20I will be played on Sunday (August 13). \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. \"Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. Pandya was understandably elated by the team’s effort. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Man of the match Yashasvi Jaiswal, who notched up his maiden T20 fifty in 4th T20I and before this had scored a ton against the same opponents on his Test debut, said he batted as per the team's requirements. \"I just try to play how the team needs and how I can express myself. I think of how quickly I can score and how many runs I can get in the power play. Of course, reading the wicket and the situation (matters), but my intent is always to score runs,\" said Jaiswal. \"I would love to thank Hardik bhai and the support staff, the way they have spoken had an impact. I just like to go out and enjoy myself,\" he said. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell.","pubDate":"2023-08-13 02:04:51","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/13/e7b31db7f6e324916b761a0a3f4605f5169189225838524_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Percy set for retirement giving us many points to ponder","link":"http://island.lk/percy-set-for-retirement-giving-us-many-points-to-ponder/","keywords":["Sports","Featured","Gamini Dissanayake","Percy","Percy Abeysekara"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Rex Clementine Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, […]","content":"Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-13 00:01:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Over 5,000 competitors to vie for top honours","link":"http://island.lk/over-5000-competitors-to-vie-for-top-honours/","keywords":["Sports","All Island Aquatic Championship 2023","competitors"],"creator":["Thilina Walpola"],"video_url":null,"description":"48th Sri Lanka Schools All Island Aquatic Championship 2023 Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 […]","content":"Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-12 23:40:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jaiswal, Gill school Windies as India level series","link":"http://island.lk/jaiswal-gill-school-windies-as-india-level-series/","keywords":["Sports","India tour of West Indies 2023 4th T20I","Wst Indies vs India 4th T20I"],"creator":["Priyan"],"video_url":null,"description":"Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine […]","content":"Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-12 22:20:21","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"McDermott and bowlers propel Dambulla Aura to fifty run win","link":"http://island.lk/mcdermott-and-bowlers-propel-dambulla-aura-to-fifty-run-win/","keywords":["Latest News","Sports","Ben McDermott","Lanka Premier League 2023","LPL 2023"],"creator":["Priyan"],"video_url":null,"description":"An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player […]","content":"An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16 Published on By The Chinese People’s Liberation Army’s Navy warship HAI YANG 24 HAO which arrived at the port of Colombo on a formal visit on 10th August departed the island on Saturday (12) after successful completion of the visit. Published on By B-Love Kandy defeated Jaffna Kings by 8 runs to register their fourth consecutive win in the Lanka Premier League 2023. The match the 15th game in the LPL2023 was played at the R Premadasa International Cricket Stadium today (12). Mohammad Harris was named player of the match for his 51 ball 81. 178/8 in 20 overs (Mohammad Harris 81, Fakhar Zaman 22, Angelo Mathews 22; Nuwan Thushara 3-31, Dunith Wellalage 2-43, Dilshan Madushanka 2-31) 170/6 in 20 overs (Chris Lyn 27, Shoaib Malik 55*, David Miller 24, Thisara Perera 36; Angelo Mathews 3-10, Nuwan Pradeep 2-48, Isuru Udana 1-30) Published on By","pubDate":"2023-08-12 22:06:04","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Building hockey’s new golden dreams","link":"https://www.sundaymail.co.zw/building-hockeys-new-golden-dreams","keywords":["Opinion & Analysis","Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"The Art of Sport Arthur Choga TODAY, the country hosts the Zimbabwe vs Zambia Development Hockey Series at St John’s Educational Trust Astro Turf in Borrowdale, Harare. The series, which features 388 talented hockey players, has been billed as a celebration of the sport and an incubator of future stars. The event will feature six […]","content":"The Sunday Mail TODAY, the country hosts the Zimbabwe vs Zambia Development Hockey Series at St John’s Educational Trust Astro Turf in Borrowdale, Harare. The series, which features 388 talented hockey players, has been billed as a celebration of the sport and an incubator of future stars. The event will feature six international games. Fifty coaches and managers are in attendance. By the end of the series, teams will have played 33 matches. Hockey will always have a special place in the history of local sport. In 1980, women’s field hockey was introduced at the Olympics — held in Moscow, in the old Soviet Union (now Russia) — for the first time, and the Zimbabwe women’s national field hockey team won gold at that event. The squad of 16 women was assembled less than a month before the Olympics began to help fill gaps the American-led Olympic boycott created in the women’s hockey competition. The team members were Arlene Boxall, Liz Chase (vice captain), Sandra Chick, Gillian Cowley, Patricia Davies, Sarah English, Maureen George, Ann Grant (captain), Susan Huggett, Patricia McKillop, Brenda Phillips, Christine Prinsloo, Sonia Robertson, Anthea Stewart, Helen Volk and Linda Watson. Zimbabwe’s three wins and two draws in the round-robin tournament were remarkable, especially considering the team’s lack of preparation and experience. Won at a time of great political transition in Zimbabwe, the gold medal was the country’s first Olympic medal of any colour. From then on, the team was known as “The Golden Girls”. The 1980 Olympics were first to feature Zimbabwe under the new name, coming as they did just a few months after the country celebrated independence on April 18. The country had been barred from the previous three Olympics for political reasons. It had last competed as Rhodesia in 1964. The women’s hockey matches, held between July 25 and 31, were all played on artificial turf, which none of the Zimbabwean team members had ever seen before. They had also never played together until that month. After beating Poland and the Union of Soviet Socialist Republics (USSR), and drawing with Czechoslovakia and India, the Zimbabweans won the competition on the final day by 4-1 over Austria. Notably, the team was made up of some bank officials, secretaries, teachers and bookkeepers. One of the players was even listed as a housewife. The oldest member of that team, Stewart, who was 35, doubled as the coach. The youngest was goalkeeper Boxall, who was 18 years old. At the 1995 All-Africa Games that Zimbabwe hosted, and for which the country built two new purpose-made fields from scratch (one at Khumalo in Bulawayo and the other at the National Sports Stadium), the women’s team won a silver medal. The two stadia are not in use today but the basic infrastructure still exists. National team games taking place at school facilities speak directly to an urgent need for a sports infrastructure strategy for the country to ensure that, even as associations, schools and individuals invest effort and resources into developing the various sports in the country, there is an all-encompassing and deliberate drive to develop and upgrade the country’s sporting facilities. The levels of interest in the sport makes it vital to devote resources to it. One of the basics of becoming a sporting powerhouse is identifying sports you excel in as a nation and pursuing them with vigour. In an earlier article, I talked about how Sri Lanka and India do not lose sleep when their national football teams underperform, but take a major interest in the fortunes of their cricket teams. Hockey has an advantage in that the basic infrastructure is already there. In my younger days, we used to see a young man by the name of Denim Mutandwa in Mbare, who played hockey for the Eradicators team set up by Custom Kachambwa. The team included stars like Alec Isulu, Mutandwa, Jeremiah Matibiri, Erasmus Hodza, Nathan Sundayi, Emmanuel Malvas, Cletos Paraziva, Adam Ngoma, Wellington Ngoma, Duncan Donkeni and Anthony Fyfe. Eradicators played a part in bringing the game to black players and had a following in high-density areas, in much the same way Takashinga did for cricket. The current series and recent performances by junior and senior hockey teams, both male and female, bring back a sense of expectation in the sport. ■","pubDate":"2023-08-12 22:02:38","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Youth vs experience in Zimbabwe, South Africa cricket series","link":"https://www.sundaynews.co.zw/youth-vs-experience-in-zimbabwe-south-africa-cricket-series/","keywords":["Sports"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter IT will be youth versus experience when Zimbabwe and South Africa Emerging sides face off in their five-match one day series opener at the Groenkloof Oval in Pretoria, South Africa today. Zimbabwe picked an experienced squad for the series while their competitors, South Africa settled for youthful players who are yet […]","content":"The Sunday News IT will be youth versus experience when Zimbabwe and South Africa Emerging sides face off in their five-match one day series opener at the Groenkloof Oval in Pretoria, South Africa today. Zimbabwe picked an experienced squad for the series while their competitors, South Africa settled for youthful players who are yet to get a feel of the highest level. Both sides will be hoping to hit the ground running early. Only four players from Zimbabwe’s 15-member squad are yet to play international cricket while none of South Africa’s players have had a feel of the biggest stage. There are 141 One Day International (ODI) caps in the Zimbabwe Emerging camp while the hosts have none. The Zimbabwe team, which is under the tutelage of senior men’s national team assistant coach, Stuart Matsikenyeri, will go in as favourites given the experience that they possess, however, the South African youngsters would be no push overs as some have played in the Under-19s World Cup, thus know what to expect. Some of the “experienced” players in the Zimbabwean camp include Luke Jongwe, who has 40 ODI caps, Wessly Madhevere with 36 caps, Tadiwanashe Marumani with 12 caps and Victor Nyauchi who has 10 senior appearances. The players yet to get a feel of ODI cricket are Faraz Akram, Brian Bennette, Jonathan Campbell, and Tanunurwa Makoni. For the hosts, most of their players have been doing well over the past year and have the likes of former Proteas Under-19 skipper, George van Heerden, reigning CSA Domestic Newcomer of the Year, Dafabet Warriors’ batter Jordan Hermann. The 21-year-old scored 297 runs at an average of 49.50 during last season’s One-Day Cup campaign, including a top score of 150 against Paarl Rocks. His form also earned him a spot on the South Africa “A” tour of Sri Lanka in June. Some of the South African players that also took part in the Under-19 World Cup are Liam Alder, Matthew Boast, Michael Copeland and Valentine Kitime. Despite picking a youthful team compared to the Zimbabwean side, South Africa Emerging head coach Maketa said the series will be a good platform to put in action what they have been working on, adding that his side is well balanced. “We have a well-balanced squad that has worked hard for the past three months at the High-Performance Centre in Pretoria. They are looking forward to the series as it’s almost like a nice reward to put into practice what we have been working on for the past three months. “The whole aim of the National Academy is to prepare these players to get ready for the next level and this series will provide the opportunity to come up against international opposition and really put their skills to the test. “As coaches, we are looking forward to having the guys play in different situations and roles, and ultimately see how they respond to playing under pressure,” he said in a statement from Cricket South Africa (CSA). After today’s opener, the other matches will take place on 15, 18, 21 and 23 August. All games will be played at the Groenkloof Oval. All the matches will be streamed live via the official CSA YouTube channel. —@brandon_malvin","pubDate":"2023-08-12 22:02:06","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"\"I Like To Captain How...\": Hardik Makes Honest Leadership Confession","link":"https://sports.ndtv.com/cricket/i-like-to-captain-how-skipper-hardik-pandya-makes-honest-leadership-confession-4293627","keywords":null,"creator":null,"video_url":null,"description":"The nine-wicket win over West Indies in the fourth T20I left Hardik Pandya a pleased man.","content":"After being 0-2 down in the 5-match T20I series against West Indies, Hardik Pandya's Indian team bounced back to win the next two matches in convincing fashion, making it 2-2, with just the 5th and the final match to go. After the West Indies leg of the series, both the teams arrived in the United States of America where Shubman Gill and Yashasvi Jaiswal stole th show with the bat. India skipper Hardik opened up on the dramatic turnaround in the team's fortunes, explaining his style of leadership. For Pandya it was just the beginning and urged the batters to be ready for bigger situations. \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. India were trailing 0-2 after the first two matches, but won the third and fourth games to roar back into the series. Pandya was understandably elated by the team's effort. \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Jaiswal, who struck an unbeaten 84 off 51 balls, was adjudged man of the match, and the left-hander said he batted as per the team's needs. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell. With PTI inputs","pubDate":"2023-08-13 02:56:31","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"Babar Azam Wanted To...\": Virat Kohli On First Interaction With Pak Star","link":"https://sports.ndtv.com/cricket/babar-azam-wanted-to-virat-kohli-on-first-interaction-with-pakistan-star-4293473","keywords":null,"creator":null,"video_url":null,"description":"India's stalwart batter Virat Kohli heaped praise on Pakistan skipper Babar Azam calling him probably the top batter across formats in the entire world.","content":"Indian and Pakistani players don't get to play against each other too often but there still remains mutual respect among cricketers from both countries. Virat Kohli and Babar Azam, two of the greatest batters of their generation, haven't faced each other on many occasions but both know that the quality they bring to their respective teams. In a recent interaction, Kohli opened up his rapport with Babar, calling the Pakistani batter probably the top batter across formats in the entire world. Kohli and Babar have been setting new batting standards in the world of cricket. While they compete on the field against each other, off the field Virat admitted that he has always held a lot of regard as well as respect for the top ODI batter. While speaking to Star Sports as quoted by ESPNcricinfo, Kohli spoke about his relationship with Babar. \"The first interaction I had with him (Babar Azam) was during the 2019 (ODI) World Cup after the game in Manchester. I've known Imad (Wasim) since the Under-19 World Cup, and he said Babar wanted to have a chat. We sat down and spoke about the game. I saw a lot of regard and respect from him from day one, and that hasn't changed,\" Kohli said. \"Regardless of the fact he's probably the top batsman in the world across formats, and rightly so. Performs so consistently and I've always enjoyed watching him play,\" Kohli added. The rivalry between both batters has always managed to be the centre of attraction in the action-packed encounter between India and Pakistan for the past five years. When Kohli's struggle began with the bat, Babar entered his prime and surpassed Kohli in the ODI rankings to become the top ODI batter. The 28-year-old Pakistan captain has played in 104 T20Is, 100 ODIs, and 49 Tests. He is a star in each of all three forms. He currently has 12346 runs, including 30 centuries, to his name at the top level. As far as his performance is considered in the ODIs, every time Babar Azam comes onto the pitch, there are expectations of him due to the high standards he has set in the format. He is the top-ranked ODI batsman, which makes it more obvious. Babar has barely ever been out of form in the 50-over format, scoring more than 5000 runs at an average of nearly 60. On the other hand, with 8,676 runs in 111 Tests with 29 centuries and 29 fifties each, 12,898 runs in 275 ODIs with 46 centuries and 65 fifties and 4,008 runs in 115 T20Is with one century and 37 fifties, Kohli is one of the most successful batters of all time. Advertisement Currently sitting at 25,000 international runs and 76 centuries, fans keep a count of each run and century he scores, in anticipation of him breaking legendary Indian cricketer Sachin Tendulkar's record of 34,357 international runs and 100 centuries. Both batters will once again step on the field to face each other in the upcoming Asia Cup clash on September 2. With ANI inputs","pubDate":"2023-08-13 02:43:20","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Kuldeep Yadav Conjures Spin Magic To Strike Twice In Same Over","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-4th-t20i-kuldeep-yadav-strikes-twice-in-same-over-to-halt-west-indies-charge-watch-4293635","keywords":null,"creator":null,"video_url":null,"description":"After being introduced to the attack, Kuldeep Yadav struck twice in his first over.","content":"Team India on Saturday hammared West Indies by nine wickets in the fourth T20I in Lauderhill, California to force the series-decider, which will be played at the same venue on Sunday. An outstanding effort by the bowlers, followed by a colossal opening partnership between Shubman Gill and Yashasvi Jaiswal saw India chase down 179 with three overs to spare. While Arshdeep Singh (3/38) was India's most successful bowler in terms of wickets, it was Kuldeep Yadav (2/26) who kept the Windies batting unit on a tight leash. After being introduced to the attack, Kuldeep struck twice in the same over to dismiss Nicholas Pooran and Rovman Powell . Outwitting batters; one spin at a time - Kuldeep Yadav #WIvIND #JioCinema #SabJawaabMilenge #teamindia pic.twitter.com/n2VT3TAFKz Electing to bat first, West Indies' essay revolved around two partnerships - a 49 for the fifth wicket between Hope and Hetmyer and then a 47 for the eighth wicket between Hetmyer and Odean Smith . However, the home batsmen, save Shimron Hetmyer (61) and Shai Hope (45), failed to capitalise on an excellent chance to put on board a bigger total. In reply, Jaiswal and Gill used the wicket's friendly nature to the hilt as 66 runs cascaded in the Power Play segment. Both went on to score their maiden half-centuries, and ensured that the total was not even sufficient to stretch India. Gill (77 off 47 balls) and Jaiswal (84 not out off 51 balls) added 165 runs for the first wicket.","pubDate":"2023-08-13 02:26:05","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 4th T20I: Batters Need To Take More Responsibility To Support Bowlers, Says Hardik Pandya","link":"https://news.abplive.com/sports/cricket/ind-vs-wi-4th-t20i-highlights-hardik-pandya-says-batters-need-to-take-more-responsibility-to-support-bowlers-1622635","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"IND vs WI 4th T20I Highlights: Team India's T20 captain Hardik Pandya is a pleased man following his team's series-levelling win over West Indies in IND vs WI 4th T20I on Saturday (August 12) in USA's Florida. India's nine-wicket win over West Indies is the first time when Men in Blue defeated the hosts by eight or more wickets in a T20 International match. Ebullient fifties from openers Shubman Gill 77 (4 balls) and Yashasvi Jaiswal (unbeaten 84 off 51 balls) helped India, after going down 0-2, level the five-match series 2-2. But for captain Pandya it was just the beginning as urged the batters to take more responsibility going forward to support the bowlers. The fifth and final T20I will be played on Sunday (August 13). \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. \"Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. Pandya was understandably elated by the team’s effort. \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Man of the match Yashasvi Jaiswal, who notched up his maiden T20 fifty in 4th T20I and before this had scored a ton against the same opponents on his Test debut, said he batted as per the team's requirements. \"I just try to play how the team needs and how I can express myself. I think of how quickly I can score and how many runs I can get in the power play. Of course, reading the wicket and the situation (matters), but my intent is always to score runs,\" said Jaiswal. \"I would love to thank Hardik bhai and the support staff, the way they have spoken had an impact. I just like to go out and enjoy myself,\" he said. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell. ","content":"IND vs WI 4th T20I Highlights: Team India's T20 captain Hardik Pandya is a pleased man following his team's series-levelling win over West Indies in IND vs WI 4th T20I on Saturday (August 12) in USA's Florida. India's nine-wicket win over West Indies is the first time when Men in Blue defeated the hosts by eight or more wickets in a T20 International match. Ebullient fifties from openers Shubman Gill 77 (4 balls) and Yashasvi Jaiswal (unbeaten 84 off 51 balls) helped India, after going down 0-2, level the five-match series 2-2. But for captain Pandya it was just the beginning as urged the batters to take more responsibility going forward to support the bowlers. The fifth and final T20I will be played on Sunday (August 13). \"Gill and Jaiswal were brilliant. There is no doubt over their skillset. They just needed to spend some time between the wickets. \"Going forward we have to take more responsibility as a batting group and support the bowlers. I've always believed bowlers win matches,\" said Pandya after the match. Pandya was understandably elated by the team’s effort. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); \"We lost two games but in the first game it was our own errors. We were cruising and in the last four overs we slipped. We spoke about how these kinds of games show our character. \"The boys took it (defeats) in their stride. The two games (after the first two defeats) we played reflected that we pulled up our socks and played some good cricket,” he added. Man of the match Yashasvi Jaiswal, who notched up his maiden T20 fifty in 4th T20I and before this had scored a ton against the same opponents on his Test debut, said he batted as per the team's requirements. \"I just try to play how the team needs and how I can express myself. I think of how quickly I can score and how many runs I can get in the power play. Of course, reading the wicket and the situation (matters), but my intent is always to score runs,\" said Jaiswal. \"I would love to thank Hardik bhai and the support staff, the way they have spoken had an impact. I just like to go out and enjoy myself,\" he said. West Indies captain Rovman Powell said batsmen need to stick to their plans and play India spinners better. \"We didn't stick to our plans. We always knew this series would come down to how we play against spinners (of India),\" said Powell.","pubDate":"2023-08-13 02:04:51","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/13/e7b31db7f6e324916b761a0a3f4605f5169189225838524_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Percy set for retirement giving us many points to ponder","link":"http://island.lk/percy-set-for-retirement-giving-us-many-points-to-ponder/","keywords":["Sports","Featured","Gamini Dissanayake","Percy","Percy Abeysekara"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Rex Clementine Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, […]","content":"Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-13 00:01:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Over 5,000 competitors to vie for top honours","link":"http://island.lk/over-5000-competitors-to-vie-for-top-honours/","keywords":["Sports","All Island Aquatic Championship 2023","competitors"],"creator":["Thilina Walpola"],"video_url":null,"description":"48th Sri Lanka Schools All Island Aquatic Championship 2023 Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 […]","content":"Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-12 23:40:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jaiswal, Gill school Windies as India level series","link":"http://island.lk/jaiswal-gill-school-windies-as-india-level-series/","keywords":["Sports","India tour of West Indies 2023 4th T20I","Wst Indies vs India 4th T20I"],"creator":["Priyan"],"video_url":null,"description":"Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine […]","content":"Yashasvi Jaiswal (84*) and Shubhman Gill’s (77) record-setting 165-run partnership levelled the ongoing five-match T20I series for India against West Indies with a commanding 9-wicket win in Florida, setting up a Sunday decider. The openers put on the joint highest opening partnership for India to help overhaul the 179-run target with three overs and nine wickets to spare. The decider will be played on Sunday (August 13) at the same venue. Brief scores Published on By Those of us who love the game of cricket make a decent living from the sport and we need to be grateful for that. Players, match officials, ground staff and the media are able to keep the home fire burning thanks to the game we love. But here’s this man Percy Abeysekara, who had dedicated his life for the game of cricket expecting nothing in return. At every game be it in Colombo, Kandy, Galle, Suriyawewa or Dambulla Percy was ever present when a cricket game was on. Some of these venues like Suriyawewa aren’t spectator friendly for the lack of public transport. You never saw Percy driving a vehicle. But he made sure that he was there at every nook and corner. Often, spectators, players, and officials are quick to give Percy a lift. One day after a game at Suriyawewa several jeeps were heading towards Hambantota as Percy was walking back to his stay. One jeep stopped and Percy was told to get into the jeep in front. So who was in the jeep, we asked Percy. ‘It was Suriyawewa Ceaser.’ A notorious gangster in the south. Even the most hardcore criminal’s heart melted when he saw Percy. Once former Board Chairman Gamini Dissanayake, a powerful government minister gave Percy a lift to Colombo after a game at Asgiriya. Mr. Dissanayake asked, ‘Percy you are so knowledgeable about the game. Why don’t you join the cricket board? For this Percy replied, ‘Sir, I’d rather be on the footboard than the cricket board.’ It was a rare occurrence to not see Percy during the recent Galle Test. He had fallen ill and had been advised to rest in bed. Amidst this some social media champions had spread rumours shocking the entire cricketing world. Percy’s association of cricket dates back to over 50 years before the country gained Test status. While he got on well with most cricketers, Percy did get under the skin of a few of them. What made Percy a class act from the others is that he knew the history of the game and his command of the English language was superb. He was equally good at his Sinhalese. Before Prime Minister Sirimavo Bandaranaike took over the Christian schools in 1962, Catholic schools were run by foreign missionaries. There were Oblate fathers looking after North and Western Provinces while Jesuit Priests were put in charge of East and South. The Central Province belonged to the Benedictine Monks. Percy had his education at St. Aloysius College, Galle which was run by Italian Jesuits. His eloquence of English was thanks to his education. Percy’s wit is quick and spontaneous. For the Zimbabwe Test in 2002 at Asgiriya, Russel Arnold had been dropped after a bad patch. He was doing 12th man duty. Percy was after a few drinks and Arnold wound him up saying, ‘Okay Percy, now enough. You are boring.’ Quick came the reply, ‘I’m boring but you are not scoring.’ During the 1984 Lord’s Test when Sri Lanka gave England an unexpected hiding, Percy was doing the rounds with the lion flag. An English lady asked Percy, ‘Is that a lamb in your flag.’ For which Percy replied, ‘Lamb is in your team.’ (Referring to Allan Lamb). ‘Lion is in my flag.’ Kudos to ACL Cables as well for employing Percy beyond 80 years. A company generally gives five to ten years extension even for their most loyal employees, but ACL Cables have supported him well beyond his retirement. There’s leave in abundance for cricket’s most famous face when there are games at both home and overseas. Such employers are rare and need to be appreciated. Beyond his wit and funny side, Percy also has a human side. He deeply cares for former players who had fallen on hard times not able to make ends meet. Former captain Roshan Mahanama irrespective of a person’s stature is quick to give the cold shoulder if he didn’t like a person’s values. This week he was making urgent phone calls to find out where Percy lives and to make a visit to his residence. That certainly is a high enough accolade for Percy as Roshan is someone who maintains such high standards. The impact Percy has had over cricket stars is massive. Sir Richard Hadlee was Chairman of Selectors in 2002 when the Kiwis were playing a warm-up game at NCC. He had just turned up at the venue and having spotted Percy at the boundary rope made a beeline to greet his friend. Another Kiwi Martin Crowe gave away his Man of the Match award in the 1984 tour. Ravi Shastri autographed one of his t-shirts with these words, ‘Dear Percy, don’t ever lose your voice. Sri Lanka needs it more than you.’ We are not sure whether we will see the same energetic Percy again. When you ask Percy his age, he proudly declares, ‘I am two days younger to Sir Garry Sobers. But certainly, fitter than Sir Garry Sobers.’ Percy named his only son Garfield, after his favourite cricketer. One Garfield wasn’t enough for the family. So, he named his grandson Garfield too. The other grandson was of course Sachin. Percy’s energy will be missed. He kept the crowd going. As he often declares, ‘Percy has no mercy, for cricketers and spectators who are lazy.’ Published on By Preparations are underway for the much anticipated 48th Annual Sri Lanka Schools All Island Aquatic Championship. Set to be held from 23rd to 27th August 2023 at the Sugathadasa Swimming Complex in Colombo, the championship will offer a national platform for 5,000 children representing over 200 schools, to showcase their talents in swimming and diving. Organized by the Sri Lanka Schools’ Aquatic Sports Association, the championship will yet again be sponsored by Nestlé MILO in line with its ambition of supporting grass-root sports in the country, whilst nourishing children to go further. A total of 164 events including 24 relays will be held during the five-day championships. They will be conducted in six age categories, namely Under 10, 12, 14, 16, 18, and 20 for both girls and boys. Certificates will be awarded to those who achieve merit standards in the Under 10 and 12 age categories. In a bid to encourage juniors the competitors achieving the first eight places from the Under 14 age category and above will be awarded certificates. Certificates and medals will be awarded to the first three places. According to SLSASA 130 boys’ schools, 68 girls’ schools and 54 mixed schools will vie for honours. Western Province has the highest number of schools (92) participating, while Northern Province has fielded just two schools . Published on By An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16","pubDate":"2023-08-12 22:20:21","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"McDermott and bowlers propel Dambulla Aura to fifty run win","link":"http://island.lk/mcdermott-and-bowlers-propel-dambulla-aura-to-fifty-run-win/","keywords":["Latest News","Sports","Ben McDermott","Lanka Premier League 2023","LPL 2023"],"creator":["Priyan"],"video_url":null,"description":"An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player […]","content":"An unbeaten half ton by Ben McDermott followed up by Binura Fernando, Hasan Ali and Noor Ahmad sharing seven wickets between them helped Dambulla Aura overcome Colombo Strikers by 50 runs in the 16th match of LPL 2023 played at the R Premadasa International Cricket stadium on Saturday (12) night. Ben McDermott was named player of the match for his unbeaten 69 off 46 balls. 166/5 in 20 overs (Ben McDermott 69*, Alex Ross 52; Naseem Shah 1-38, Chamika Karunaratne 1-35, Matheesh Pathirana 2-36, Jeffrey Vandersay 1-21) 116 in 19.4 overs (Nuwanidu Fernando 21, Mohammad Nawaz 20; Binura Fernando 2-18, Hasan Ali 3-16, Janith Liyanage 1-26, Noor Ahmad 2-14, Dushan Hemantha 2-16 Published on By The Chinese People’s Liberation Army’s Navy warship HAI YANG 24 HAO which arrived at the port of Colombo on a formal visit on 10th August departed the island on Saturday (12) after successful completion of the visit. Published on By B-Love Kandy defeated Jaffna Kings by 8 runs to register their fourth consecutive win in the Lanka Premier League 2023. The match the 15th game in the LPL2023 was played at the R Premadasa International Cricket Stadium today (12). Mohammad Harris was named player of the match for his 51 ball 81. 178/8 in 20 overs (Mohammad Harris 81, Fakhar Zaman 22, Angelo Mathews 22; Nuwan Thushara 3-31, Dunith Wellalage 2-43, Dilshan Madushanka 2-31) 170/6 in 20 overs (Chris Lyn 27, Shoaib Malik 55*, David Miller 24, Thisara Perera 36; Angelo Mathews 3-10, Nuwan Pradeep 2-48, Isuru Udana 1-30) Published on By","pubDate":"2023-08-12 22:06:04","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Building hockey’s new golden dreams","link":"https://www.sundaymail.co.zw/building-hockeys-new-golden-dreams","keywords":["Opinion & Analysis","Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"The Art of Sport Arthur Choga TODAY, the country hosts the Zimbabwe vs Zambia Development Hockey Series at St John’s Educational Trust Astro Turf in Borrowdale, Harare. The series, which features 388 talented hockey players, has been billed as a celebration of the sport and an incubator of future stars. The event will feature six […]","content":"The Sunday Mail TODAY, the country hosts the Zimbabwe vs Zambia Development Hockey Series at St John’s Educational Trust Astro Turf in Borrowdale, Harare. The series, which features 388 talented hockey players, has been billed as a celebration of the sport and an incubator of future stars. The event will feature six international games. Fifty coaches and managers are in attendance. By the end of the series, teams will have played 33 matches. Hockey will always have a special place in the history of local sport. In 1980, women’s field hockey was introduced at the Olympics — held in Moscow, in the old Soviet Union (now Russia) — for the first time, and the Zimbabwe women’s national field hockey team won gold at that event. The squad of 16 women was assembled less than a month before the Olympics began to help fill gaps the American-led Olympic boycott created in the women’s hockey competition. The team members were Arlene Boxall, Liz Chase (vice captain), Sandra Chick, Gillian Cowley, Patricia Davies, Sarah English, Maureen George, Ann Grant (captain), Susan Huggett, Patricia McKillop, Brenda Phillips, Christine Prinsloo, Sonia Robertson, Anthea Stewart, Helen Volk and Linda Watson. Zimbabwe’s three wins and two draws in the round-robin tournament were remarkable, especially considering the team’s lack of preparation and experience. Won at a time of great political transition in Zimbabwe, the gold medal was the country’s first Olympic medal of any colour. From then on, the team was known as “The Golden Girls”. The 1980 Olympics were first to feature Zimbabwe under the new name, coming as they did just a few months after the country celebrated independence on April 18. The country had been barred from the previous three Olympics for political reasons. It had last competed as Rhodesia in 1964. The women’s hockey matches, held between July 25 and 31, were all played on artificial turf, which none of the Zimbabwean team members had ever seen before. They had also never played together until that month. After beating Poland and the Union of Soviet Socialist Republics (USSR), and drawing with Czechoslovakia and India, the Zimbabweans won the competition on the final day by 4-1 over Austria. Notably, the team was made up of some bank officials, secretaries, teachers and bookkeepers. One of the players was even listed as a housewife. The oldest member of that team, Stewart, who was 35, doubled as the coach. The youngest was goalkeeper Boxall, who was 18 years old. At the 1995 All-Africa Games that Zimbabwe hosted, and for which the country built two new purpose-made fields from scratch (one at Khumalo in Bulawayo and the other at the National Sports Stadium), the women’s team won a silver medal. The two stadia are not in use today but the basic infrastructure still exists. National team games taking place at school facilities speak directly to an urgent need for a sports infrastructure strategy for the country to ensure that, even as associations, schools and individuals invest effort and resources into developing the various sports in the country, there is an all-encompassing and deliberate drive to develop and upgrade the country’s sporting facilities. The levels of interest in the sport makes it vital to devote resources to it. One of the basics of becoming a sporting powerhouse is identifying sports you excel in as a nation and pursuing them with vigour. In an earlier article, I talked about how Sri Lanka and India do not lose sleep when their national football teams underperform, but take a major interest in the fortunes of their cricket teams. Hockey has an advantage in that the basic infrastructure is already there. In my younger days, we used to see a young man by the name of Denim Mutandwa in Mbare, who played hockey for the Eradicators team set up by Custom Kachambwa. The team included stars like Alec Isulu, Mutandwa, Jeremiah Matibiri, Erasmus Hodza, Nathan Sundayi, Emmanuel Malvas, Cletos Paraziva, Adam Ngoma, Wellington Ngoma, Duncan Donkeni and Anthony Fyfe. Eradicators played a part in bringing the game to black players and had a following in high-density areas, in much the same way Takashinga did for cricket. The current series and recent performances by junior and senior hockey teams, both male and female, bring back a sense of expectation in the sport. ■","pubDate":"2023-08-12 22:02:38","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Youth vs experience in Zimbabwe, South Africa cricket series","link":"https://www.sundaynews.co.zw/youth-vs-experience-in-zimbabwe-south-africa-cricket-series/","keywords":["Sports"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter IT will be youth versus experience when Zimbabwe and South Africa Emerging sides face off in their five-match one day series opener at the Groenkloof Oval in Pretoria, South Africa today. Zimbabwe picked an experienced squad for the series while their competitors, South Africa settled for youthful players who are yet […]","content":"The Sunday News IT will be youth versus experience when Zimbabwe and South Africa Emerging sides face off in their five-match one day series opener at the Groenkloof Oval in Pretoria, South Africa today. Zimbabwe picked an experienced squad for the series while their competitors, South Africa settled for youthful players who are yet to get a feel of the highest level. Both sides will be hoping to hit the ground running early. Only four players from Zimbabwe’s 15-member squad are yet to play international cricket while none of South Africa’s players have had a feel of the biggest stage. There are 141 One Day International (ODI) caps in the Zimbabwe Emerging camp while the hosts have none. The Zimbabwe team, which is under the tutelage of senior men’s national team assistant coach, Stuart Matsikenyeri, will go in as favourites given the experience that they possess, however, the South African youngsters would be no push overs as some have played in the Under-19s World Cup, thus know what to expect. Some of the “experienced” players in the Zimbabwean camp include Luke Jongwe, who has 40 ODI caps, Wessly Madhevere with 36 caps, Tadiwanashe Marumani with 12 caps and Victor Nyauchi who has 10 senior appearances. The players yet to get a feel of ODI cricket are Faraz Akram, Brian Bennette, Jonathan Campbell, and Tanunurwa Makoni. For the hosts, most of their players have been doing well over the past year and have the likes of former Proteas Under-19 skipper, George van Heerden, reigning CSA Domestic Newcomer of the Year, Dafabet Warriors’ batter Jordan Hermann. The 21-year-old scored 297 runs at an average of 49.50 during last season’s One-Day Cup campaign, including a top score of 150 against Paarl Rocks. His form also earned him a spot on the South Africa “A” tour of Sri Lanka in June. Some of the South African players that also took part in the Under-19 World Cup are Liam Alder, Matthew Boast, Michael Copeland and Valentine Kitime. Despite picking a youthful team compared to the Zimbabwean side, South Africa Emerging head coach Maketa said the series will be a good platform to put in action what they have been working on, adding that his side is well balanced. “We have a well-balanced squad that has worked hard for the past three months at the High-Performance Centre in Pretoria. They are looking forward to the series as it’s almost like a nice reward to put into practice what we have been working on for the past three months. “The whole aim of the National Academy is to prepare these players to get ready for the next level and this series will provide the opportunity to come up against international opposition and really put their skills to the test. “As coaches, we are looking forward to having the guys play in different situations and roles, and ultimately see how they respond to playing under pressure,” he said in a statement from Cricket South Africa (CSA). After today’s opener, the other matches will take place on 15, 18, 21 and 23 August. All games will be played at the Groenkloof Oval. All the matches will be streamed live via the official CSA YouTube channel. —@brandon_malvin","pubDate":"2023-08-12 22:02:06","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"}]}