{"newsArray":[{"title":"CA announce McDonald as men's coach","link":"https://www.perthnow.com.au/sport/cricket/ca-announce-mcdonald-as-mens-coach-c-6432555","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Cricket Australia have confirmed Justin Langer's full-time successor, with Andrew McDonald given a four-year contract to coach the men's team.","content":null,"pubDate":"2022-04-12 23:58:39","full_description":"Andrew McDonald has been rewarded for an impressive interim stint by being given a four-year contract to coach the Australian men’s cricket team. The favourite to secure the job full-time after Australia’s 1-0 Test series win in Pakistan, McDonald’s appointment has been by confirmed by Cricket Australia. “The journey so far has been particularly pleasing, and I am honoured to be given this incredible opportunity for what is an exciting period ahead,” McDonald said.","image_url":"https://images.perthnow.com.au/publication/C-6432555/9cdb3cb12b5f825123af01e2ba99c169a76aed03-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"“I would like to dedicate to my wife”: Ravindra Jadeja dedicates first win as captain to wife Reeva Solanki after CSK beat RCB in IPL 2022","link":"https://thesportsrush.com/cricket-news-i-would-like-to-dedicate-to-my-wife-ravindra-jadeja-dedicates-first-win-as-captain-to-wife-reeva-solanki-after-csk-beat-rcb-in-ipl-2022/","keywords":["Cricket","CSK","IPL 2022","RCB","chennai super kings","csk","Indian Premier League","Ravindra Jadeja","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ravindra Jadeja dedicates first win: Chennai Super Kings beat Royal Challengers Bangalore by 23 runs in Navi Mumbai tonight. It has taken Ravindra Jadeja a never-seen-before four consecutive losses at Chennai Super Kings at the start of an Indian Premier League season to win his first-ever match as a captain in competitive cricket. Leading Super… The post “I would like to dedicate to my wife”: Ravindra Jadeja dedicates first win as captain to wife Reeva Solanki after CSK beat RCB in IPL 2022 appeared first on The SportsRush.","content":"Ravindra Jadeja dedicates first win: Chennai Super Kings beat Royal Challengers Bangalore by 23 runs in Navi Mumbai tonight. It has taken Ravindra Jadeja a never-seen-before four consecutive losses at Chennai Super Kings at the start of an Indian Premier League season to win his first-ever match as a captain in competitive cricket. Leading Super Kings in the ongoing 15th season of the IPL, Jadeja finally managed to secure a victory in the fifth attempt. While Jadeja (0) failed to contribute with the bat in the first innings, his bowling figures of 4-0-39-3 comprising dismissals of Glenn Maxwell (26), Wanindu Hasaranga (7) and Akash Deep (0) played a crucial role in reducing Royal Challengers Bangalore to 193/9 in a 217-run chase. Among the two batters who played their career-best IPL knocks tonight, Chennai all-rounder Shivam Dube was adjudged the ‘Player of the Match‘ for scoring a hard-hitting 95* (46) with the help of five fours and eight sixes at a strike rate of 206.52. Great spirit shown by the boys. Important win under our belt. Onwards and upwards @chennaiIPL #Yellove #WhistlePodu #CSK pic.twitter.com/jyvt9uIVqm — Robin Aiyuda Uthappa (@robbieuthappa) April 12, 2022 Ravindra Jadeja dedicates first win as captain to wife Reeva Solanki Having played in excess of 600 matches across formats before the start of IPL 2022, this is the first time when Jadeja is leading a side. The 33-year old player considered it as an apt opportunity to dedicate this victory to his wife Reeva Solanki. “First of all, this is the first victory as a captain ever. I would like to dedicate to my wife and also the team because first victory is always special,” Jadeja told Star Sports during the post-match presentation ceremony. Jadeja sounded relieved by the prospect of them getting off the mark on the points table. Clicking as a unit at the Dr DY Patil Sports Academy on Tuesday, Chennai prevented themselves from what would’ve been an embarrassing fifth loss in a row. “Previous four games, we couldn’t cross the line. But as a team, we came good. As a batting unit, everybody did a good job. Robbie [Robin Uthappa] and Shivam [Dube] batted brilliantly. The bowlers contributed with the ball as well,” Jadeja added. Playing his ninth IPL season for CSK, Jadeja explained how he has the management’s faith. In what is evident after watching Super Kings’ matches, Jadeja further admitted to consulting former captain Mahendra Singh Dhoni when it comes to captaincy-related decisions. “Our management don’t put pressure on me. They are relaxed. They always come to me and motivate. As a captain, I am still picking brains of the senior players. Mahi bhai [MS Dhoni] is there, I always go to him and discuss,” Jadeja concluded. The post “I would like to dedicate to my wife”: Ravindra Jadeja dedicates first win as captain to wife Reeva Solanki after CSK beat RCB in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-12 19:57:58","full_description":"Ravindra Jadeja dedicates first win: Chennai Super Kings beat Royal Challengers Bangalore by 23 runs in Navi Mumbai tonight. It has taken Ravindra Jadeja a never-seen-before four consecutive losses at Chennai Super Kings at the start of an Indian Premier League season to win his first-ever match as a captain in competitive cricket. Leading Super Kings in the ongoing 15th season of the IPL, Jadeja finally managed to secure a victory in the fifth attempt. While Jadeja (0) failed to contribute with the bat in the first innings, his bowling figures of 4-0-39-3 comprising dismissals of Glenn Maxwell (26), Wanindu Hasaranga (7) and Akash Deep (0) played a crucial role in reducing Royal Challengers Bangalore to 193/9 in a 217-run chase. Among the two batters who played their career-best IPL knocks tonight, Chennai all-rounder Shivam Dube was adjudged the ‘ Player of the Match ‘ for scoring a hard-hitting 95* (46) with the help of five fours and eight sixes at a strike rate of 206.52. Great spirit shown by the boys. Important win under our belt. Onwards and upwards @chennaiIPL 💪 #Yellove #WhistlePodu #CSK pic.twitter.com/jyvt9uIVqm — Robin Aiyuda Uthappa (@robbieuthappa) April 12, 2022 Having played in excess of 600 matches across formats before the start of IPL 2022, this is the first time when Jadeja is leading a side. The 33-year old player considered it as an apt opportunity to dedicate this victory to his wife Reeva Solanki. “First of all, this is the first victory as a captain ever. I would like to dedicate to my wife and also the team because first victory is always special,” Jadeja told Star Sports during the post-match presentation ceremony. Jadeja sounded relieved by the prospect of them getting off the mark on the points table. Clicking as a unit at the Dr DY Patil Sports Academy on Tuesday, Chennai prevented themselves from what would’ve been an embarrassing fifth loss in a row. “Previous four games, we couldn’t cross the line. But as a team, we came good. As a batting unit, everybody did a good job. Robbie [Robin Uthappa] and Shivam [Dube] batted brilliantly . The bowlers contributed with the ball as well,” Jadeja added. Playing his ninth IPL season for CSK, Jadeja explained how he has the management’s faith. In what is evident after watching Super Kings’ matches, Jadeja further admitted to consulting former captain Mahendra Singh Dhoni when it comes to captaincy-related decisions. “Our management don’t put pressure on me. They are relaxed. They always come to me and motivate. As a captain, I am still picking brains of the senior players. Mahi bhai [MS Dhoni] is there, I always go to him and discuss,” Jadeja concluded.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Always go to Mahi Bhai and discuss, says Jadeja after CSK's first win","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-always-go-to-mahi-bhai-and-discuss-says-jadeja-after-csks-first-win-737803","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"CSK defeated RCB by 23 runs on TuesdayIt was CSK's first win in the IPL 2022Shivam Dube scored 95 in the first innings","content":"Chennai Super Kings (CSK) captain Ravindra Jadeja has said he always goes to 'Mahi Bhai' [MS Dhoni] to discuss strategies.Jadeja's comments came after CSK's first win of the Indian Premier League (IPL) 2022 on Tuesday. After losing their first four games, CSK defeated Royal Challengers Bangalore (RCB) by 23 runs to finally go off the mark in the underway campaign. Batting first, CSK posted 216 for 4 in 20 overs, thanks to Robin Uthappa's 88 and Shivam Dube's 95. Jadeja, who took over CSK's captaincy from Dhoni ahead of IPL 2022, dedicated his first win as captain to his wife and the team. \"First of all, this is the first victory as a captain ever. I would like to dedicate it to my wife and also the team because a first victory is always special. Previous four games, we couldn't cross the line. But as a team, we came good. As a batting unit, everybody did a good job. Robbie and Shivam batted brilliantly. The bowlers contributed with the ball as well,\" Jadeja said at the post-match presentation on Tuesday. The CSK all-rounder also said that the team management does not put pressure on him and instead, they are always motivating him. \"As a captain, I am still picking the brains of the senior players. Mahi bhai is there, I always go to him and discuss. Moulding into a new role, it'll take time to get things going. I am still learning and trying to get better with each game. \"We have plenty of experience in our dressing room. Experience comes into play, we don't panic early. We try to keep ourselves calm, we back ourselves and we look to play positive cricket. We'll look to push hard, we've got the momentum, we'll try and continue the momentum,\" added Jadeja. Jaddu Hosanna!! 🤷🏻‍♂️Captain's relief....! 😍#CSKvRCB #WhistlePodu #Yellove 🦁💛 @imjadeja pic.twitter.com/5Q94RFIKVF— Chennai Super Kings (@ChennaiIPL) April 12, 2022 Sri Lanka's Maheesh Theekshana, along with his skipper Jadeja, were the standouts with the ball for CSK in the second innings. Theekshana, who is playing in his maiden season, recorded his best figures in the IPL as he picked up four wickets for 33 runs. Jadeja also bagged three scalps. IPL 2022: We missed Harshal Patel against CSK, says RCB captain du Plessis On Tuesday, RCB lost their top-order batters inside the powerplay overs. RCB captain Faf du Plessis was the first one to depart. The Proteas batsman scored just eight off nine deliveries. From 14 for 1, RCB went two-down with just 20 runs on the board, and this time, it was the big fish Virat Kohli to depart. Anuj Rawat was also sent back to the pavilion an over later. \"When you are chasing a big score you have to have a good start. One of the first four setting up the foundation, we didn't have that tonight. Good bowling from Chennai, they used their spinners well on a pitch that had some grip. We lost momentum with wickets, but we came back well. That shows the depth in our batting. \"Impressed by the way the guys coming in on a debut at 5 or 6 and playing like that just shows depth in our bowling. Even though we lost we were only 20 runs short on a total we should have been blown out of order and that is impressive,\" said RCB captain du Plessis after his side's loss at DY Patil Stadium. Du Plessis also acknowledged the fact that they missed Harshal Patel's services with the ball and bat. The pacer left RCB's bio-bubble after their previous game following the death of his sister. \"You see the value he (Harshal) offers not just to this team but any team. He has got the ability to really stop the game. We missed that tonight. Even towards the end, we lacked the variety. Big miss for us, hopefully, we will have him back soon again,\" added du Plessis. RCB now have a three-day break before they take on Delhi Capitals (DC) in IPL 2022 on Saturday (April 16) at Wankhede Stadium, Mumbai. CSK's next game is against Gujarat Titans (GT) on Sunday at MCA Stadium, Pune.","pubDate":"2022-04-12 19:35:16","full_description":"Chennai Super Kings (CSK) captain Ravindra Jadeja has said he always goes to 'Mahi Bhai' [MS Dhoni] to discuss strategies. Jadeja's comments came after CSK's first win of the Indian Premier League (IPL) 2022 on Tuesday. After losing their first four games, CSK defeated Royal Challengers Bangalore (RCB) by 23 runs to finally go off the mark in the underway campaign. Batting first, CSK posted 216 for 4 in 20 overs, thanks to Robin Uthappa's 88 and Shivam Dube's 95. Jadeja, who took over CSK's captaincy from Dhoni ahead of IPL 2022, dedicated his first win as captain to his wife and the team. \"First of all, this is the first victory as a captain ever. I would like to dedicate it to my wife and also the team because a first victory is always special. Previous four games, we couldn't cross the line. But as a team, we came good. As a batting unit, everybody did a good job. Robbie and Shivam batted brilliantly. The bowlers contributed with the ball as well,\" Jadeja said at the post-match presentation on Tuesday. The CSK all-rounder also said that the team management does not put pressure on him and instead, they are always motivating him. \"As a captain, I am still picking the brains of the senior players. Mahi bhai is there, I always go to him and discuss. Moulding into a new role, it'll take time to get things going. I am still learning and trying to get better with each game. \"We have plenty of experience in our dressing room. Experience comes into play, we don't panic early. We try to keep ourselves calm, we back ourselves and we look to play positive cricket. We'll look to push hard, we've got the momentum, we'll try and continue the momentum,\" added Jadeja. Jaddu Hosanna!! 🤷🏻‍♂️ Captain's relief....! 😍 #CSKvRCB #WhistlePodu #Yellove 🦁💛 @imjadeja pic.twitter.com/5Q94RFIKVF Sri Lanka's Maheesh Theekshana, along with his skipper Jadeja, were the standouts with the ball for CSK in the second innings. Theekshana, who is playing in his maiden season, recorded his best figures in the IPL as he picked up four wickets for 33 runs. Jadeja also bagged three scalps. IPL 2022: We missed Harshal Patel against CSK, says RCB captain du Plessis On Tuesday, RCB lost their top-order batters inside the powerplay overs. RCB captain Faf du Plessis was the first one to depart. The Proteas batsman scored just eight off nine deliveries. From 14 for 1, RCB went two-down with just 20 runs on the board, and this time, it was the big fish Virat Kohli to depart. Anuj Rawat was also sent back to the pavilion an over later. \"When you are chasing a big score you have to have a good start. One of the first four setting up the foundation, we didn't have that tonight. Good bowling from Chennai, they used their spinners well on a pitch that had some grip. We lost momentum with wickets, but we came back well. That shows the depth in our batting. \"Impressed by the way the guys coming in on a debut at 5 or 6 and playing like that just shows depth in our bowling. Even though we lost we were only 20 runs short on a total we should have been blown out of order and that is impressive,\" said RCB captain du Plessis after his side's loss at DY Patil Stadium. Du Plessis also acknowledged the fact that they missed Harshal Patel's services with the ball and bat. The pacer left RCB's bio-bubble after their previous game following the death of his sister. \"You see the value he (Harshal) offers not just to this team but any team. He has got the ability to really stop the game. We missed that tonight. Even towards the end, we lacked the variety. Big miss for us, hopefully, we will have him back soon again,\" added du Plessis. RCB now have a three-day break before they take on Delhi Capitals (DC) in IPL 2022 on Saturday (April 16) at Wankhede Stadium, Mumbai. CSK's next game is against Gujarat Titans (GT) on Sunday at MCA Stadium, Pune.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/12/500x300_1286620-csk.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians are in transition phase: Bumrah","link":"https://www.thehansindia.com/sports/cricket/mumbai-indians-are-in-transition-phase-bumrah-737795","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"MI have already lost four games on trot and lack of bowling options is hurting the five-time champions badly","content":"Pune: Mumbai Indians vice-captain Jasprit Bumrah understands and accepts the hard truth that Mumbai Indians is indeed going through a \"transition phase\" and the new kids in the block need to understand how to react to pressure situations in a high intensity tournament like IPL.MI have already lost four games on trot and lack of bowling options is hurting the five-time champions badly. \"It's a transition phase that every cricketer understands, and every team goes through that. We are in that phase; we have got a new group,\" Bumrah said. \"So understanding the format of the IPL, how you have to handle pressure and achieve success in this league. \"We are going through that. We are looking forward that we go through this transition, and then we have all the players we had and the quality will come back again,\" he said. For Bumrah, it is important that MI lives in the present rather than stressing on the past \"Right now, we live in the present. Yes, things have not gone according to plan so far, but we keep on fighting and we keep on finding a way,\" Bumrah was quoted as saying in media release issued by the franchise. \"That is the way the game of cricket works. Whenever a challenge comes, you try to find solutions to the challenge and we are trying to do that,\" he added. Bumrah feels that the tracks have been heavily loaded in favour of batters this time and the toss has proved to be crucial so far. \"This year when the wickets are helping the batters and it's difficult to take wickets, you have to find your ways. We are no different. We are trying to find new ways. We've come up with a few plans,\" the right-arm speedster said, without divulging the plans. Toss indeed has become a crucial factor.","pubDate":"2022-04-12 19:16:30","full_description":"Pune: Mumbai Indians vice-captain Jasprit Bumrah understands and accepts the hard truth that Mumbai Indians is indeed going through a \"transition phase\" and the new kids in the block need to understand how to react to pressure situations in a high intensity tournament like IPL. MI have already lost four games on trot and lack of bowling options is hurting the five-time champions badly. \"It's a transition phase that every cricketer understands, and every team goes through that. We are in that phase; we have got a new group,\" Bumrah said. \"So understanding the format of the IPL, how you have to handle pressure and achieve success in this league. \"We are going through that. We are looking forward that we go through this transition, and then we have all the players we had and the quality will come back again,\" he said. For Bumrah, it is important that MI lives in the present rather than stressing on the past \"Right now, we live in the present. Yes, things have not gone according to plan so far, but we keep on fighting and we keep on finding a way,\" Bumrah was quoted as saying in media release issued by the franchise. \"That is the way the game of cricket works. Whenever a challenge comes, you try to find solutions to the challenge and we are trying to do that,\" he added. Bumrah feels that the tracks have been heavily loaded in favour of batters this time and the toss has proved to be crucial so far. \"This year when the wickets are helping the batters and it's difficult to take wickets, you have to find your ways. We are no different. We are trying to find new ways. We've come up with a few plans,\" the right-arm speedster said, without divulging the plans. Toss indeed has become a crucial factor.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/12/500x300_1286613-mumbai-indians.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Leave IPL for a week, support Lankan protests","link":"https://www.thehansindia.com/sports/cricket/leave-ipl-for-a-week-support-lankan-protests-737788","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former cricketer and minister Arjuna Ranatunga on Tuesday urged all the Sri Lankan players, who are playing in the Indian Premier League","content":"Former cricketer and minister Arjuna RanatungaFormer cricketer and minister Arjuna RanatungaColombo: Former cricketer and minister Arjuna Ranatunga on Tuesday urged all the Sri Lankan players, who are playing in the Indian Premier League (IPL), to come and stand in support of their country during the ongoing economic crisis. Sri Lanka is battling a severe economic crisis with food and fuel scarcity affecting a large number of the people in the island nation. The economy has been in a free-fall since the onset of the COVID-19 pandemic.\"I really don't know but there are some cricketers who are lavishly playing in the IPL and haven't spoken about their country. Unfortunately, people are scared to speak against the government. These cricketers are also working for the cricket board under the ministry and they are trying to protect their jobs. But now they have to take a step as some of the young cricketers also came forward and gave statements in support of the protest,\" Arjuna Ranatunga told ANI. \"When something is going wrong, you should have the guts to come out and speak against it, without thinking about your business. People ask me why I am not in the protests. It's just that I have been into politics for the last 19 years and this is not a political issue. So far, none of the political parties and politicians have got into the protests and that's the biggest strength of the people of this country,\" he added.","pubDate":"2022-04-12 19:08:45","full_description":"Former cricketer and minister Arjuna Ranatunga Colombo: Former cricketer and minister Arjuna Ranatunga on Tuesday urged all the Sri Lankan players, who are playing in the Indian Premier League (IPL), to come and stand in support of their country during the ongoing economic crisis. Sri Lanka is battling a severe economic crisis with food and fuel scarcity affecting a large number of the people in the island nation. The economy has been in a free-fall since the onset of the COVID-19 pandemic. \"I really don't know but there are some cricketers who are lavishly playing in the IPL and haven't spoken about their country. Unfortunately, people are scared to speak against the government. These cricketers are also working for the cricket board under the ministry and they are trying to protect their jobs. But now they have to take a step as some of the young cricketers also came forward and gave statements in support of the protest,\" Arjuna Ranatunga told ANI. \"When something is going wrong, you should have the guts to come out and speak against it, without thinking about your business. People ask me why I am not in the protests. It's just that I have been into politics for the last 19 years and this is not a political issue. So far, none of the political parties and politicians have got into the protests and that's the biggest strength of the people of this country,\" he added.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/12/500x300_1286607-arjuna-ranatunga.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Batters have stopped taking risks against me: Rashid","link":"https://www.thehansindia.com/sports/cricket/batters-have-stopped-taking-risks-against-me-rashid-737782","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Rashid Khan has been steady without being extraordinary like previous years and the reason for that is the safety first approach by opposition batters during this edition of IPL, feels Gujarat Titans spinner.","content":"Rashid KhanRashid KhanMumbai: Rashid Khan has been steady without being extraordinary like previous years and the reason for that is the safety first approach by opposition batters during this edition of IPL, feels Gujarat Titans spinner.Rashid has taken six wickets from four matches at an economy rate of 6.68 but batters across teams have negotiated the Afghan great pretty well. But the 23-year-old, who is among the most sought-after leg-spinners in franchise cricket around the world, is not surprised and says it's just a matter of time. \"I'm happy with the way I'm bowling in this competition so far,\" Rashid said in a virtual media interaction here. \"I don't really focus on results, it's all about how I'm bowling. At the moment, my bowling is great. But it's about the opposition, they don't take that kind of risk against you which will allow you to take more wickets,\" Rashid said. \"But whenever there are enough opportunities as a bowler, I would be smart enough to get them out. So far I'm happy with my bowling, the pitching has been great,\" he added. Against his old team Sunrisers Hyderabad on Monday, Rashid had decent figures of 1/28 as Gujarat suffered their first defeat after three wins, losing by eight wickets. One shy of getting his 100th IPL scalp, Rashid said he's always been a slow starter in the IPL. \"If you look at the stats in IPL, I always have similar (slow) starts. I've always taken 5-6 wickets, not 12-13 in the first four-five games. It always remained the same. But definitely, I will try my best to keep improving. Definitely, there will be a time when I'll deliver that magic spell,\" he promised. Rashid, who has played 80 matches across 2017-2022, said it's an unbelievable journey for him so far. \"Coming here from Afghanistan and playing all the games since my debut, it's been amazing. Five years back, I didn't even think of playing IPL. Nearing 100 (wickets), becoming vice-captain of Gujarat, it's massive. I'm so lucky and blessed.\" On being part of the leadership group by being the deputy to Hardik Pandya, Rashid said the best part is about having clarity about their individual roles. \"At times, you perform and at times you don't. The mindset is about giving 100 per cent that's more important than the result. We as a team are clear about it and everyone knows about their roles.\" Asked about their defeat against SRH, Rashid said they fell short for about 15-20 runs. The Titans, who were asked to bat first, set a reasonable 163-run target but the Kane Williamson-led side secured a comprehensive win with five balls to spare. \"I felt like we fell short by 15-20 runs and could not capitalise on the start. They did well chasing under pressure and kept the run-rate going,\" Rashid added. Gujarat Titans next face Rajasthan Royals at the DY Patil on Thursday.","pubDate":"2022-04-12 19:01:42","full_description":"Rashid Khan Mumbai: Rashid Khan has been steady without being extraordinary like previous years and the reason for that is the safety first approach by opposition batters during this edition of IPL, feels Gujarat Titans spinner. Rashid has taken six wickets from four matches at an economy rate of 6.68 but batters across teams have negotiated the Afghan great pretty well. But the 23-year-old, who is among the most sought-after leg-spinners in franchise cricket around the world, is not surprised and says it's just a matter of time. \"I'm happy with the way I'm bowling in this competition so far,\" Rashid said in a virtual media interaction here. \"I don't really focus on results, it's all about how I'm bowling. At the moment, my bowling is great. But it's about the opposition, they don't take that kind of risk against you which will allow you to take more wickets,\" Rashid said. \"But whenever there are enough opportunities as a bowler, I would be smart enough to get them out. So far I'm happy with my bowling, the pitching has been great,\" he added. Against his old team Sunrisers Hyderabad on Monday, Rashid had decent figures of 1/28 as Gujarat suffered their first defeat after three wins, losing by eight wickets. One shy of getting his 100th IPL scalp, Rashid said he's always been a slow starter in the IPL. \"If you look at the stats in IPL, I always have similar (slow) starts. I've always taken 5-6 wickets, not 12-13 in the first four-five games. It always remained the same. But definitely, I will try my best to keep improving. Definitely, there will be a time when I'll deliver that magic spell,\" he promised. Rashid, who has played 80 matches across 2017-2022, said it's an unbelievable journey for him so far. \"Coming here from Afghanistan and playing all the games since my debut, it's been amazing. Five years back, I didn't even think of playing IPL. Nearing 100 (wickets), becoming vice-captain of Gujarat, it's massive. I'm so lucky and blessed.\" On being part of the leadership group by being the deputy to Hardik Pandya, Rashid said the best part is about having clarity about their individual roles. \"At times, you perform and at times you don't. The mindset is about giving 100 per cent that's more important than the result. We as a team are clear about it and everyone knows about their roles.\" Asked about their defeat against SRH, Rashid said they fell short for about 15-20 runs. The Titans, who were asked to bat first, set a reasonable 163-run target but the Kane Williamson-led side secured a comprehensive win with five balls to spare. \"I felt like we fell short by 15-20 runs and could not capitalise on the start. They did well chasing under pressure and kept the run-rate going,\" Rashid added. Gujarat Titans next face Rajasthan Royals at the DY Patil on Thursday.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/12/500x300_1286600-rashid-khan.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Shivam Dube, Robin Uthappa And Maheesh Theekshana Set Up CSK's 23-Run Over RCB - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLXNoaXZhbS1kdWJlLXJvYmluLXV0aGFwcGEtYW5kLW1haGVlc2gtdGhlZWtzaGFuYS1zZXQtdXAtY3Nrcy0yMy1ydW4tb3Zlci1yY2ItMjg4MzM5N9IBhAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1zaGl2YW0tZHViZS1yb2Jpbi11dGhhcHBhLWFuZC1tYWhlZXNoLXRoZWVrc2hhbmEtc2V0LXVwLWNza3MtMjMtcnVuLW92ZXItcmNiLTI4ODMzOTcvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Shivam Dube, Robin Uthappa And Maheesh Theekshana Set Up CSK's 23-Run Over RCB  NDTV SportsCSK v RCB: Game Day Preview | IPL 2022  Royal Challengers BangaloreLive match blog - Super Kings vs RCB 22nd Match 2022 - Cricket Insights  ESPNcricinfoHerald: CSK spoil Goan Suyash's dream debut  Herald GoaVirat Kohli and Faf Du Plessis at practice before CSK v RCB | IPL 2022  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-04-12 18:31:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK vs RCB Man of the Match 2022: Who is the Man of the Match today IPL match between Chennai and Bangalore?","link":"https://thesportsrush.com/cricket-news-csk-vs-rcb-man-of-the-match-2022-who-is-the-man-of-the-match-today-ipl-match-between-chennai-and-bangalore/","keywords":["Cricket","CSK","IPL 2022","RCB","chennai super kings","csk","Indian Premier League","Royal Challengers Bangalore","Shivam Dube"],"creator":["Dixit Bhargav"],"video_url":null,"description":"CSK vs RCB Man of the Match: The all-rounder from Chennai Super Kings won his maiden Indian Premier League match award tonight. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Chennai Super Kings beat Royal Challengers Bangalore by… The post CSK vs RCB Man of the Match 2022: Who is the Man of the Match today IPL match between Chennai and Bangalore? appeared first on The SportsRush.","content":"CSK vs RCB Man of the Match: The all-rounder from Chennai Super Kings won his maiden Indian Premier League match award tonight. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Chennai Super Kings beat Royal Challengers Bangalore by 23 runs to get off the mark on the points table. Chasing a 217-run target, all Royal Challengers could score in the powerplay was 42/3 losing the likes of Faf du Plessis (8), Virat Kohli (1) and Anuj Rawat (12) in the process. Vital middle-order contributions from Shahbaz Ahmed (41), Dinesh Karthik (34) and Suyash Prabhudessai (34) did power Royal Challengers to 193/9 in 20 overs but they never looked like challenging the opposition in the death overs. First win ku #WhistlePodu #CSKvRCB #Yellove pic.twitter.com/VJtaA92h22 — Chennai Super Kings (@ChennaiIPL) April 12, 2022 With bowling figures of 4-0-33-4, Super Kings spinner Maheesh Theekshana was the pick of their bowlers at the Dr DY Patil Cricket Academy tonight. Captain Ravindra Jadeja dismissed three batters as Super Kings’ spinners picked combined bowling figures of 8-0-72-7. CSK vs RCB Man of the Match today IPL match After being put in to bat first by Bangalore captain Faf du Plessis, Chennai scored 216/4 in 20 overs to register the highest innings total of the season. Coming on the back of four consecutive losses, the defending champions turned the tables on the back of a third-wicket 165-run partnership between opening batter Robin Uthappa (88) and all-rounder Shivam Dube (95*). In between them, Uthappa and Dube hit 183 (96) with the help of nine fours and 17 sixes at a magnificent strike rate of 190.62. Dube, who scored more runs at a better strike rate whilst remaining unbeaten, was rightly adjudged the ‘Man of the Match’ on Tuesday. “We were looking for the first win and I am happy to contribute. I am more focused this time on my basics. I spoke to the seniors and Mahi bhai [MS Dhoni] also helped me. He said let your skill take care. I wanted to time the ball well and stay still and maintain my balance,” Dube told Star Sports during the post-match presentation ceremony. The post CSK vs RCB Man of the Match 2022: Who is the Man of the Match today IPL match between Chennai and Bangalore? appeared first on The SportsRush.","pubDate":"2022-04-12 18:18:25","full_description":"CSK vs RCB Man of the Match: The all-rounder from Chennai Super Kings won his maiden Indian Premier League match award tonight. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Chennai Super Kings beat Royal Challengers Bangalore by 23 runs to get off the mark on the points table. Chasing a 217-run target, all Royal Challengers could score in the powerplay was 42/3 losing the likes of Faf du Plessis (8), Virat Kohli (1) and Anuj Rawat (12) in the process. Vital middle-order contributions from Shahbaz Ahmed (41), Dinesh Karthik (34) and Suyash Prabhudessai (34) did power Royal Challengers to 193/9 in 20 overs but they never looked like challenging the opposition in the death overs. First win ku #WhistlePodu 🥳💛 #CSKvRCB #Yellove 🦁 pic.twitter.com/VJtaA92h22 — Chennai Super Kings (@ChennaiIPL) April 12, 2022 With bowling figures of 4-0-33-4, Super Kings spinner Maheesh Theekshana was the pick of their bowlers at the Dr DY Patil Cricket Academy tonight. Captain Ravindra Jadeja dismissed three batters as Super Kings’ spinners picked combined bowling figures of 8-0-72-7. After being put in to bat first by Bangalore captain Faf du Plessis, Chennai scored 216/4 in 20 overs to register the highest innings total of the season. Coming on the back of four consecutive losses, the defending champions turned the tables on the back of a third-wicket 165-run partnership between opening batter Robin Uthappa (88) and all-rounder Shivam Dube (95*). In between them, Uthappa and Dube hit 183 (96) with the help of nine fours and 17 sixes at a magnificent strike rate of 190.62. Dube, who scored more runs at a better strike rate whilst remaining unbeaten, was rightly adjudged the ‘Man of the Match’ on Tuesday. “We were looking for the first win and I am happy to contribute. I am more focused this time on my basics. I spoke to the seniors and Mahi bhai [MS Dhoni] also helped me. He said let your skill take care. I wanted to time the ball well and stay still and maintain my balance,” Dube told Star Sports during the post-match presentation ceremony.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-16-20-updates-2883221","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 17:41:46","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, Royal Challengers Bangalore, chasing a target of 217, are 193/9. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Royal Challengers Bangalore. Everything related to Chennai Super Kings and Royal Challengers Bangalore match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Royal Challengers Bangalore live score. Do check for Chennai Super Kings vs Royal Challengers Bangalore scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Ravindra Jadeja would be a happier man after this victory without a doubt! This is the Chennai we all were familiar with. What a dominating performance by the men in yellow. Maheesh Theekshana stood out amongst the bowlers for Chennai. He grabbed four wickets and most of them came when the game was being taken away from them. It was an evening filled with mixed emotions for Mukesh Choudhary. A moment to savour as he took the wicket of Virat Kohli, but a night to forget with a couple of dropped catches in the field. Things could've gotten worse for Chennai but the experience of Dwayne Bravo came to the rescue, once he sent back Dinesh Karthik in the 18th over. All smiles for the people in yellow. They will try to capitalize on the winning momentum by their side. It is never easy to chase down a huge target. Bangalore started out with a strategy of keeping the wickets in hand which would come in handy deep into the innings. The opening pair failed to find boundaries in the opening overs but did rack up runs at a good rate by running the hard yards. Although the plan took a U-turn, once Faf du Plessis perished. There was a mini collapse for Bangalore as they were four wickets down within 7 overs. The middle-order put up a solid counterpunch, which got hopes high for Bangalore but it wasn't enough. Suyash Prabhudessai and Shahbaz Ahmed did trouble the yellow army but Maheesh Theekshana got the better of the pair. In the end, it was a huge ask from Dinesh Karthik, he put a good cameo but could not provide his side with another match-winning knock. What an enthralling match. The South Indian derby always delivers an entertaining contest. Nevertheless, Chennai continue their domination over Bangalore in the Indian T20 League. They also get their first win of the season. 19.6 overs (4 Runs) FOUR! Mohammed Siraj ends the innings in fine fashion. Full length, on off. Mohammed Siraj drills it down the ground for a boundary. Chennai win by 23 runs! 19.5 overs (0 Run) Shorter ball, outside off, slower delivery. Mohammed Siraj looks to pull this but he misses. 19.4 overs (4 Runs) FOUR! Good shot by Siraj! Very full, around middle and off. Mohammed Siraj lifts it over the bowler's head dor a boundary. 19.3 overs (0 Run) Yoker, wide of off. Mohammed Siraj swings his bat at it but he misses. 19.2 overs (1 Run) Slower ball, on a length, outside off. Josh Hazlewood taps it towards point and takes a single. 19.2 overs (1 Run) Wide! Fuller ball, wide of off. Josh Hazlewood leaves it alone. Wide called! 19.1 overs (2 Runs) Fuller ball, outside off. Josh Hazlewood lifts it just over Ambati Rayudu at mid off, who backtracks but fails to get to the ball. Two taken! 18.6 overs (4 Runs) FOUR! Outside off, on a length. Mohammed Siraj slashes it over cover for a boundary. 18.5 overs (1 Run) Another yorker, outside off. Josh Hazlewood pushes it toward long off for a single. 18.4 overs (0 Run) Wide of off, yorker-length delivery. Josh Hazlewood swings his bat at it but he misses. 18.3 overs (1 Run) Fuller ball, outside off. Mohammed Siraj drives it towards long off for a single. 18.2 overs (0 Run) Mohammed Siraj tries to be innovative here! A low full toss, outside off. Mohammed Siraj shuffles across and tries to go scoop this, but he ends up chipping it on the off side. It lands safely. 18.1 overs (1 Run) On a length, angling in on the pads. Josh Hazlewood looks to flick this but the ball goes off the outside edge towards point for a single. 17.6 overs (1 Run) Fuller delivery, outside off. Josh Hazlewood knocks it towards long off for a single. 43 needed off 12 balls now. 17.5 overs (1 Run) Another yorker, around off. Mohammed Siraj pushes it towards cover and takes a single. 17.4 overs (0 Run) Yorker-length delivery, wide of off. Mohammed Siraj digs it out towards short third man. 17.3 overs (1 Run) A low full toss, outside off. Josh Hazlewood pushes it towards deep point for a single. Josh Hazlewood is the last man in. 17.2 overs (0 Run) OUT! TAKEN! Dinesh Karthik perishes! This should be the game for Chennai now. Ravindra Jadeja is relieved! A low full toss, around off. Dinesh Karthik heaves it with th bottom half of his bat towards deep mid-wicket. Ravindra Jadeja keeps his eye on the bat and takes a good catch. 17.1 overs (0 Run) Fuller ball, around middle. Dinesh Karthik knocks it to long on. No run taken! 17.1 overs (1 Run) Wide! Slower delivery, down the leg side once again. Dinesh Karthik looks to heave this but he misses. Another wide called! 17.1 overs (1 Run) Wide! Full in length, down the leg side. Dinesh Karthik misses his flick. Wide given! 16.6 overs (1 Run) Pitches it up, outside off. Dinesh Karthik drives it uppishly over cover. Just a single. He retains the strike. 48 needed off 18 balls! 16.6 overs (1 Run) Wide! A yorker-length delivery, wide of off. Dinesh Karthik leaves it alone. Another wide in the over! 16.5 overs (2 Runs) A low full toss, outside off. Dinesh Karthik slices it aerially over cover once again. A couple of runs taken! 16.4 overs (2 Runs) Fuller ball, outside off. Dinesh Karthik lifts it over cover. Two taken! 16.4 overs (1 Run) Wide! Wide of off, fuller ball. Dinesh Karthik leaves it alone. Wide given! 16.3 overs (4 Runs) FOUR! Innovation at its best! A length ball, outside off. Dinesh Karthik shuffles across, and flicks it towards fine leg for a boundary. MS Dhoni quick to run across to the other side. He passes on some advice to Mukesh Choudhary, who seems to be a bit under pressure. 16.2 overs (6 Runs) SIX! Poor delivery and punished! A fuller ball, around the pads. Dinesh Karthik uses his wrists and flicks it over deep square leg for another maximum! Back-to-back sixes for Dinesh Karthik! 16.1 overs (6 Runs) SIX! Till Dinesh Karthik is here, Bangalore's hopes are still alive! A shorter ball, around middle. Dinesh Karthik pulls it over deep square leg for a biggie. 15.6 overs (0 Run) Firing it in on middle, shorter ball. Mohammed Siraj misses his flick and gets hit on the pads. 15.5 overs (0 Run) Shorter ball, drifting in on middle. Mohammed Siraj defends it out. Mohammed Siraj comes in at number 10. 15.4 overs (0 Run) OUT! CAUGHT! WHAT A STUNNING CATCH! Unbelievable stuff from Ambati Rayudu! A fuller ball slower through the air, around middle. Akash Deep looks to flick this away, but the ball goes off the leading edge towards cover. Ambati Rayudu keeps his eyes on the ball, dives full-stretch to his right and takes a spectacular one-handed catch there! Bangalore are now 8 down! 15.3 overs (0 Run) Quicker, outside off, shorter ball. Akash Deep taps it towards point. Strategic break! Dinesh Karthik holds the key for Bangalore but the task is too big for him to do alone and with the lower-order batters walking in, chances of any support from the other end are slim. But cricket is a funny game, so we can't rule anything out. Chennai have the game by the scruff of the neck and would hope to grab their first win of the season. Akash Deep is the new batter in for Bangalore. 15.2 overs (0 Run) OUT! CAUGHT! Ravindra Jadeja brings himself into the attack and strikes and he grabs his second wicket of the match. A shorter ball again, around middle. Wanindu Hasaranga makes room and looks to go over long on this time. But he lifts this one with no timing and the ball goes to Chris Jordan at long on who pouches it safely. Wanindu Hasaranga walks back shaking his head, he feels he has missed out on this one! 15.1 overs (6 Runs) SIX! Wanindu Hasaranga has made that look so easy! A shorter ball, around middle. Wanindu Hasaranga swivels and pulls it over deep mid-wicket for a biggie!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637854018982145719.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-11-15-updates-2883114","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 17:03:50","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, Royal Challengers Bangalore, chasing a target of 217, are 146/7. The live updates of Chennai Super Kings vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Royal Challengers Bangalore, Chennai Super Kings vs Royal Challengers Bangalore live score, Chennai Super Kings vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (0 Run) Full and on off. Dinesh Karthik blocks it out solidly. 14.5 overs (6 Runs) SIX! DK goes chasing the asking rate! It is floated, full and on leg. Dinesh Karthik gets low and slog-sweeps it over the square leg fence for a biggie. 14.4 overs (1 Run) Tossed up, outside off. Wanindu Hasaranga pushes it to point for a single. Wanindu Hasaranga walks out to bat. 14.3 overs (0 Run) OUT! TIMBER! Maheesh Theekshana does the job himself and gets his fourth wicket of the innings. It is quicker, full and on off. This one hurries onto the batter. Shahbaz Ahmed stays back, fails to defend it out and gets beaten completely. The ball goes through to rattle the stumps. 14.2 overs (1 Run) DROPPED! Mukesh Choudhary is having a bad evening in the field. He drops a sitter for the second time here. It is tossed up, full and outside off. Dinesh Karthik slashes hard at it. The ball flies high in the air off the outer half. Mukesh Choudhary settles under it but fails to grab it. They take one. 14.1 overs (1 Run) Length ball, on the pads, Shahbaz Ahmed flicks it to mid-wicket for one. 13.6 overs (1 Run) Full toss, on off. Shahbaz Ahmed hits it to long off for a single. A good over for Bangalore, 15 runs off it. 13.5 overs (2 Runs) Length ball, outside off, again a slower delivery. Shahbaz Ahmed punches it hard to sweeper cover for two runs. 13.4 overs (2 Runs) Slower and fuller, on off. Shahbaz Ahmed drives it through covers for two runs. 13.4 overs (2 Runs) NO BALL! Length ball, on off, angled across. Dinesh Karthik pushes it to cover for a single. The umpire signals a no ball, as Chennai had an extra fielder outside the 30-yard circle on the leg side. This is really poor from Chennai. The players crowd the umpire but in the end, it stays as a no ball. 13.3 overs (1 Run) Full length, outside off. Shahbaz Ahmed taps it to point for one. 13.2 overs (2 Runs) Length ball, outside off. Ahmed punches it through covers for a brace. 13.1 overs (4 Runs) FOUR! Full length, wide outside off. An off-pace delivery yet again. Shahbaz Ahmed slashes hard and it flies off the outside edge towards backward point. Maheesh Theekshana puts in a desperate dive but gets no where near the ball. It races away to the fence. 13.1 overs (1 Run) WIDE! Slow and full, wide outside off. Dwayne Bravo gets it all wrong this time. Shahbaz Ahmed does not bother. Wide called. 12.6 overs (1 Run) Full, on middle and leg. Ahmed sweeps it to deep square leg for a single. Bangalore need 101 runs in 42 balls. 12.5 overs (0 Run) Fuller, on off. Shahbaz Ahmed pushes it to mid off. 12.4 overs (1 Run) Flatter, on off, Dinesh Karthik flicks it through mid-wicket for one run. 12.3 overs (4 Runs) FOUR! Dinesh Karthik off the mark in a fine fashion. It is full, angled down leg. Dinesh Karthik gets low and sweeps it to fine leg for four. Dinesh Karthik walks out to bat now. 12.2 overs (0 Run) OUT! TIMBER! Maheesh Theekshana bags his third wicket of the innings. He breaks a crucial stand here which was starting to hurt Chennai. It is full and on the stumps. Suyash Prabhudessai comes down the track and tries to heave it across the line but misses it completely. The ball goes through to rattle the stumps. 12.1 overs (0 Run) Length ball, on off. Suyash Prabhudessai blocks it back to the bowler. Maheesh Theekshana (2-0-18-2) comes back to bowl. 11.6 overs (1 Run) Full length, on off. Suyash Prabhudessai eases it to long on for a single. Should've been a wicket-taking over for Bravo but not to be. 11.5 overs (1 Run) Touch short, outside off. Shahbaz Ahmed cuts it hard to cover for a single. 11.4 overs (1 Run) DROPPED! Mukesh Choudhary drops a dolly this time. A short ball, angled into the batter. Suyash Prabhudessai pulls it to deep mid-wicket. Mukesh Choudhary comes forward to grab the catch but it spills out of his hands in the end. 11.3 overs (1 Run) A length ball, outside off. Shahbaz Ahmed guides it to third man for a single. 11.2 overs (4 Runs) FOUR! Shahbaz Ahmed is taking the charge now. Short ball, outside off. Shahbaz Ahmed cuts it through covers for a boundary. 11.2 overs (1 Run) WIDE! Is Bravo under pressure? This is a slower delivery, wide outside off. The ball is outside the tramline. Shahbaz Ahmed leaves it alone. Wide called. 11.1 overs (0 Run) Good length, outside off. This one flies off the deck. Shahbaz Ahmed tries to chase it but misses. 11.1 overs (1 Run) WIDE! Full length, wide outside off. Shahbaz Ahmed slashes but misses. Wide called. Dwayne Bravo comes into the attack. 10.6 overs (0 Run) Nearly finds the gap this time. Short ball, outside off. Suyash Prabhudessai cuts it to point but straight to the fielder. 10.5 overs (6 Runs) SIX! KABOOM! Suyash Prabhudessai is on a roll here! Quicker, full and on off. Suyash Prabhudessai gets low and slogs it over the square leg fence for a maximum. 100 up for Bangalore. 10.4 overs (4 Runs) FOUR! Suyash Prabhudessai is not shying away from anything here. It is full and on off. Suyash Prabhudessai changes his stance quickly and reverse-hits it over backward point for a boundary. 10.3 overs (1 Run) Tossed up, on off. Shahbaz Ahmed tucks it to the leg side for a single this time. 10.2 overs (2 Runs) Fuller, on middle and leg. Ahmed flicks it to square leg and the batters pick two with ease. 10.1 overs (1 Run) Short ball, on off. Suyash Prabhudessai flicks it past mid on for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853996225400828.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-6-10-updates-2883028","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 16:47:47","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.2 overs, Royal Challengers Bangalore, chasing a target of 217, are 89/4. The live updates of Chennai Super Kings vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Royal Challengers Bangalore, Chennai Super Kings vs Royal Challengers Bangalore live score, Chennai Super Kings vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (2 Runs) Very full on this occasion, outside off. Shahbaz Ahmed gets down on his knee and drives it towards deep point for a brace. 13 runs off Chris Jordan's first over! 9.5 overs (1 Run) Slower ball, angling in, on the pads. Suyash Prabhudessai tucks it towards square leg for a single. 9.4 overs (4 Runs) FOUR! WOW! What a shot! A fuller ball, around middle. Suyash Prabhudessai gets down on his knee and paddle and scoops it towards fine leg for a boundary. 9.3 overs (1 Run) Fuller, taking the pace off now, outside off. Shahbaz Ahmed leans and pushes it towards point. Single taken! 9.2 overs (1 Run) On a length, outside off. Suyash Prabhudessai dabs it towards point and takes a quick single. 9.1 overs (4 Runs) FOUR! Welcome to the attack, Chris Jordan! A shorter ball, outside off. Suyash Prabhudessai stands tall and slaps that past cover for a boundary. Strategic break! A much-needed one for Bangalore. They have lost four wickets in quick succession and that is not a good sign at all while chase a huge target, Chennai are clearly on top in this match. They will be hoping to restrict the batters from building a solid stand. An enticing passage of play awaits. Chris Jordan comes into the attack for Chennai. 8.6 overs (4 Runs) FOUR! Nicely played. Full and outside off. Shahbaz Ahmed gets low and slog-sweeps it towards fine leg. The ball bounces over the ropes. 8.5 overs (0 Run) Shorter ball, turning in, around middle. Shahbaz Ahmed looks to pull this, but he misses and gets hit on the pads. 8.4 overs (0 Run) A dot now! Flatter, on the pads. Shahbaz Ahmed fails to pick it up and gets hit high on the pads. 8.3 overs (2 Runs) Another shorter ball, around middle. Shahbaz Ahmed flicks it towards deep mid-wicket. Two taken! 8.2 overs (1 Run) Shorter ball now, around middle. Suyash Prabhudessai works it away towards deep square leg for a single. 8.1 overs (4 Runs) FOUR! Top shot! full, outside off. Suyash Prabhudessai makes room, and goes inside-out over cover for a boundary. 7.6 overs (1 Run) Shortish ball again, around middle. Suyash Prabhudessai works it away towards mid-wicket for a single. 7.5 overs (4 Runs) FOUR! Slower through the air, full, around middle. Suyash Prabhudessai sweeps it towards deep mid-wicket. The fielder there dives forward and but fails to reach the ball. The ball goes behind towards the ropes for a boundary. 7.4 overs (1 Run) Shorter ball, around middle. Shahbaz Ahmed flicks it towards deep square leg for a single. 7.3 overs (1 Run) Fuller ball, around middle. Suyash Prabhudessai drives it aerially towards long on. The fielder there collects it on the bounce. Single taken! 7.2 overs (1 Run) Tad shorter, around middle. Shahbaz Ahmed stays in his crease and flicks it towards deep square leg for a single. 7.1 overs (4 Runs) FOUR! Swept away! A fuller ball, slower through the air, around middle. Shahbaz Ahmed gets down on his knee and sweeps it towards deep square leg for a boundary. 6.6 overs (0 Run) Fuller ball, quicker, around middle. Suyash Prabhudessai pushes it back to the bowler. Suyash Prabhudessai comes out to bat at number 6. 6.5 overs (0 Run) OUT! CLEANED HIM UP! Ravindra Jadeja strikes in his first over! He gets the big fish, Glenn Maxwell. Spinners are doing the trick here for Chennai. An arm ball, much straighter, around off. Glenn Maxwell rocks back and tries to pull this but he misses and the ball goes on to hit the top of off. Bangalore are now 4 down! 6.4 overs (1 Run) Shortish again, outside off. Shahbaz Ahmed pushes it towards point and takes a single. 6.3 overs (2 Runs) Width on offer, shorter ball. Shahbaz Ahmed cuts it towards deep backward point for a brace. 6.2 overs (1 Run) On the pads, Maxwell flicks it to long on for a single. 6.1 overs (4 Runs) FOUR! Lovely shot! Shorter ball, outside off. Glenn Maxwell slaps it past cover for a boundary. Shahbaz Ahmed is the new batter in. Also, Ravindra Jadeja takes the ball now. 5.6 overs (0 Run) OUT! LBW! The umpire thinks it is plumb but Anuj Rawat thinks otherwise and opts for a review. Bangalore though lose another wicket! Maheesh Theekshana strikes once again. Bangalore are in a spot of bother now. A fuller ball, this one comes back in, around middle. Anuj Rawat looks to whip this and but he misses and gets hit on his back pad. Anuj Rawat reviews the decision. Ball Tracking shows three reds. He has to walk back! 5.5 overs (1 Run) In the air....but safe! A fuller ball, outside off. Glenn Maxwell lifts it over the fielder at mid off. Single taken! 5.4 overs (6 Runs) SIX! Back-to-back sixes! Glenn Maxwell is on the charge already! A shorter ball, around middle. Glenn Maxwell swivels and pulls it over deep mid-wicket for a biggie. 5.3 overs (6 Runs) SIX! Up and over! A fuller ball, around off. Glenn Maxwell tonks it way over mid off for a biggie. 5.2 overs (0 Run) Fuller ball, much straighter, around middle. Glenn Maxwell gets down and tries to reverse-sweep this but he gets an inside edge back onto his pads. 5.1 overs (2 Runs) A shorter ball, around middle and leg. Glenn Maxwell tucks it towards deep square leg. Dwayne Bravo fumbles there and allows the batters to take two tuns.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853986595958482.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-1-5-updates-2882937","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 16:23:59","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Royal Challengers Bangalore, chasing a target of 217, are 29/2. The live updates of Chennai Super Kings vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Royal Challengers Bangalore, Chennai Super Kings vs Royal Challengers Bangalore live score, Chennai Super Kings vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (1 Run) Direct hit and it could've been curtains for Glenn Maxwell. Full length, outside off. Glenn Maxwell drives it aerially to the left of mid off. The ball meets Ravindra Jadeja on a bounce. The batters scamper across for a single. Jadeja misses his throw at the non-striker's end. 4.5 overs (4 Runs) FOUR! Glenn Maxwell not wasting any time here. A short ball, on off. Glenn Maxwell pulls it through mid-wicket for a boundary. 4.4 overs (1 Run) In the air but safe! A short ball, outside off. Anuj Rawat tries to pull it away. The ball goes to mid off off the top-edge but lands safely. They take one. 4.3 overs (0 Run) What a beauty! Mukesh Choudhary making the ball talk now. A length ball, on the fouth stump. Anuj Rawat tries to flirt away from his body but gets beaten on the outside edge. 4.2 overs (1 Run) A length ball, outside off. Glenn Maxwell guides it to third man for one. Glenn Maxwell comes to the crease. 4.1 overs (0 Run) OUT! CAUGHT! Mukesh Choudhary gets the dream wicket of Virat Kohli. He is elated. Chennai right on top here. A short ball, on the bodyline. Virat Kohli pulls it to deep square leg. Shivam Dube moves to right and takes a solid catch. Virat Kohli walks back on just a single. This is huge for Chennai. They couldn't have asked for a better start. Mukesh Choudhary comes back into the attack. He went for 10 runs in his first over! 3.6 overs (0 Run) Fuller, on off. Rawat defends it to the left of the slip fielder. 3.5 overs (1 Run) Full and outside off. Virat Kohli defends it to cover on the front foot. The batters cross for a quick single. 3.4 overs (1 Run) A quick single as this is worked to mid on. 3.3 overs (0 Run) Fuller, on off. Anuj Rawat reverse-sweeps it to backward point, not in the gap though. 3.2 overs (4 Runs) FOUR! Nicely played. A short ball, outside off. Anuj Rawat goes back and pulls it through the gap at mid-wicket for a single. 3.1 overs (0 Run) Length, angled into the off stump. Rawat taps it to backward point. 2.6 overs (0 Run) Fuller, on the pads. Virat Kohli clips it to the leg side. A wicket-taking over of Maheesh Theekshana comes to an end. Virat Kohli walks out to bat now. 2.5 overs (0 Run) OUT! CAUGHT! Maheesh Theekshana strikes in his very first over. He gets an early wicket for his side. Faf du Plessis fails to hurt his ex-franchise and walks back on 8. It is full and on the stumps. Faf du Plessis decides to free his arms this time and lofts it towards long on. He does not get the desired distance on it. Chris Jordan takes a solid catch there. 2.4 overs (0 Run) Touch short, on leg. Faf du Plessis goes back and pulls it to mid-wicket. Not in the gap though. 2.3 overs (1 Run) Tossed up, full and outside off. Anuj Rawat drives it down to long off for a single. 2.2 overs (1 Run) Fuller, on the pads, Faf du Plessis flicks it through mid-wicket for one. 2.1 overs (1 Run) Flatter and outside off. Anuj Rawat gets it to short third man off the outside edge. They take a single. Maheesh Theekshana comes into the attack now. 1.6 overs (0 Run) Length ball, on middle. Faf du Plessis bunts it to the off side. No boundary off the over but Bangalore get 10 runs off it. The batters are running some hard yards out here. 1.5 overs (3 Runs) Three again! This is solid running. Full length, angled into the pads. Anuj Rawat comes down the track and flicks it through the gap at mid-wicket. Chris Jordan stops it with his foot. They take three. 1.4 overs (3 Runs) Full length, straight on the pads. Faf du Plessis flicks it through mid-wicket. Ravindra Jadeja pulls it back in time before the ropes. The batters take three runs again. 1.3 overs (1 Run) On a length, outside off, some swing this time. Anuj Rawat gets it to third man off the outer half. 1.2 overs (3 Runs) Full length, on middle and leg. Faf du Plessis comes down the track and flicks it through mid-wicket. The batters take three comfortably. 1.1 overs (0 Run) Length ball, on off. Faf du Plessis drives it to cover. Mukesh Choudhary will bowl from the other end. 0.6 over (0 Run) On off, defended out solidly. Just one run off the over. A great over by Moeen Ali to start with. 0.5 over (0 Run) Tossed up, full and angled down leg. Anuj Rawat tries to go for the reverse-sweep but fails to get any blade on it. 0.4 over (0 Run) Two on the trot now! This is flighted and outside off, turning away. Anuj Rawat leaves it alone. 0.3 over (0 Run) Second dot in the over! Angled into the pads. Rawat clips it to mid-wicket. 0.2 over (1 Run) Tossed up, full and on off. Faf du Plessis flicks it to mid-wicket for a single. Faf du Plessis and Bangalore are off the mark. 0.1 over (0 Run) Floated and on off. Faf du Plessis prods and flicks it to mid-wicket off the inner half.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853972310032477.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa highest score in IPL: Twitter reactions on Robin Uthappa’s career-best IPL innings in CSK vs RCB IPL 2022 match","link":"https://thesportsrush.com/cricket-news-robin-uthappa-highest-score-in-ipl-twitter-reactions-on-robin-uthappas-career-best-ipl-innings-in-csk-vs-rcb-ipl-2022-match/","keywords":["Cricket","CSK","IPL 2022","RCB","chennai super kings","csk","Indian Premier League","Robin Uthappa","Royal Challengers Bangalore","Shivam Dube"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Robin Uthappa highest score in IPL: The veteran batter from Chennai Super Kings played a career-best knock tonight. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Chennai Super Kings opening batter Robin Uthappa put together a 165-run partnership… The post Robin Uthappa highest score in IPL: Twitter reactions on Robin Uthappa’s career-best IPL innings in CSK vs RCB IPL 2022 match appeared first on The SportsRush.","content":"Robin Uthappa highest score in IPL: The veteran batter from Chennai Super Kings played a career-best knock tonight. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Chennai Super Kings opening batter Robin Uthappa put together a 165-run partnership for the third wicket alongside all-rounder Shivam Dube (95*) to power his team to 216/4 in 20 overs. Opening the batting with Ruturaj Gaikwad (17), it wasn’t until the last ball of the fifth over when Uthappa hit his first boundary of the match. Not faced much of the strike not just in the powerplay but the first 10 overs as well, Uthappa made it for the same to make the most of time spent in the middle. Having scored 27 (25) until then, it was in the 13th over that Uthappa hit as many as three sixes off Royal Challengers Bangalore all-rounder Glenn Maxwell to turn the tables with respect to his strike rate. In the 15th over, Uthappa hit a four and a six off pacer Akash Deep to bring up a 33-ball half-century. Uthappa, who hit a six off Josh Hazlewood in the following over, followed it with two sixes and a four against Mohammed Siraj. It was on the first delivery of the penultimate over when Uthappa hit Wanindu Hasaranga for a dominating six down the ground to surpass his previous best IPL score. In what is Uthappa’s 27th IPL half-century, it is his third for Super Kings and second this season. While Uthappa appeared to be registering a maiden IPL century at one point in time, it wasn’t to be as he departed against Hasaranga after scoring a stroke-filled 89 (50) with the help of four fours and nine sixes. Twitter reactions on Robin Uthappa highest score in IPL: Robin Uthappa you Beauty. Showing class and experience! — Irfan Pathan (@IrfanPathan) April 12, 2022 Dial-in 8⃣8⃣ for Robin!#CSKvRCB #WhistlePodu #Yellove pic.twitter.com/64F6j77GvH — Chennai Super Kings (@ChennaiIPL) April 12, 2022 Robin uthappa & shivam dubey to RCB bowlers:#CSKvsRCB pic.twitter.com/eE3G2YsNr7 — Prayag (@theprayagtiwari) April 12, 2022 Floodlight ROBbery !!! Reminded of Q1 last season.. Just has a knack of stepping up on the big night .. What a knock this batman @robbieuthappa #CSKvsRCB — Jatin Sapru (@jatinsapru) April 12, 2022 ROBIN UTHAPPA has gone NUCLEAR #CSKvsRCB #CSKVRCB #RCBvCSK @robbieuthappa — Sushant Mehta (@SushantNMehta) April 12, 2022 Wow, @robbieuthappa has turned the clock back. He makes batting look so pleasant. — Harsha Bhogle (@bhogleharsha) April 12, 2022 For more cricket-related news, click here. The post Robin Uthappa highest score in IPL: Twitter reactions on Robin Uthappa’s career-best IPL innings in CSK vs RCB IPL 2022 match appeared first on The SportsRush.","pubDate":"2022-04-12 16:02:25","full_description":"Robin Uthappa highest score in IPL: The veteran batter from Chennai Super Kings played a career-best knock tonight. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Chennai Super Kings opening batter Robin Uthappa put together a 165-run partnership for the third wicket alongside all-rounder Shivam Dube (95*) to power his team to 216/4 in 20 overs. Opening the batting with Ruturaj Gaikwad (17), it wasn’t until the last ball of the fifth over when Uthappa hit his first boundary of the match. Not faced much of the strike not just in the powerplay but the first 10 overs as well, Uthappa made it for the same to make the most of time spent in the middle. Having scored 27 (25) until then, it was in the 13th over that Uthappa hit as many as three sixes off Royal Challengers Bangalore all-rounder Glenn Maxwell to turn the tables with respect to his strike rate. In the 15th over, Uthappa hit a four and a six off pacer Akash Deep to bring up a 33-ball half-century. Uthappa, who hit a six off Josh Hazlewood in the following over, followed it with two sixes and a four against Mohammed Siraj. It was on the first delivery of the penultimate over when Uthappa hit Wanindu Hasaranga for a dominating six down the ground to surpass his previous best IPL score. In what is Uthappa’s 27th IPL half-century, it is his third for Super Kings and second this season. While Uthappa appeared to be registering a maiden IPL century at one point in time, it wasn’t to be as he departed against Hasaranga after scoring a stroke-filled 89 (50) with the help of four fours and nine sixes. Robin Uthappa you Beauty. Showing class and experience! — Irfan Pathan (@IrfanPathan) April 12, 2022 ☎️Dial-in 8️⃣8️⃣ for Robin! #CSKvRCB #WhistlePodu #Yellove 🦁💛 pic.twitter.com/64F6j77GvH — Chennai Super Kings (@ChennaiIPL) April 12, 2022 Robin uthappa & shivam dubey to RCB bowlers: #CSKvsRCB pic.twitter.com/eE3G2YsNr7 — Prayag (@theprayagtiwari) April 12, 2022 Floodlight ROBbery !!! Reminded of Q1 last season.. Just has a knack of stepping up on the big night .. What a knock this batman @robbieuthappa #CSKvsRCB — Jatin Sapru (@jatinsapru) April 12, 2022 ROBIN UTHAPPA has gone NUCLEAR 💥😱 #CSKvsRCB #CSKVRCB #RCBvCSK @robbieuthappa — Sushant Mehta (@SushantNMehta) April 12, 2022 Wow, @robbieuthappa has turned the clock back. He makes batting look so pleasant. — Harsha Bhogle (@bhogleharsha) April 12, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hyderabad: Sarojini Cricket and Fitness Academy felicitates blind cricketers","link":"https://telanganatoday.com/hyderabad-sarojini-cricket-and-fitness-academy-felicitates-blind-cricketers","keywords":["Cricket","News","Sport","blind cricketers","Hyderabad Strikers","Sarojini Cricket and Fitness Academy","Shravan"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: The Sarojini Cricket and Fitness Academy felicitated visually impaired cricketers Shravan, Bhargav, Shekhar and Vijay for their performances, at their academy on Tuesday. The members of the Hyderabad Strikers team had a training session at the academy. They are going to participate in the Telangana Blind Cricket League, scheduled to be held at the […]","content":"Hyderabad: The Sarojini Cricket and Fitness Academy felicitated visually impaired cricketers Shravan, Bhargav, Shekhar and Vijay for their performances, at their academy on Tuesday. The members of the Hyderabad Strikers team had a training session at the academy. They are going to participate in the Telangana Blind Cricket League, scheduled to be held at the Water Works Ground from April 14. Dr Ashok, IAS, GR Kiran, former national volleyball player lauded the cricketers. They said these cricketers are a great inspiration to youngsters who want to achieve greater things in life.   Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-12 15:50:47","full_description":"Home | Cricket | Hyderabad Sarojini Cricket And Fitness Academy Felicitates Blind Cricketers Hyderabad: Sarojini Cricket and Fitness Academy felicitates blind cricketers By Telangana Today Published: Published Date - 09:20 PM, Tue - 12 April 22 Hyderabad: The Sarojini Cricket and Fitness Academy felicitated visually impaired cricketers Shravan, Bhargav, Shekhar and Vijay for their performances, at their academy on Tuesday. The members of the Hyderabad Strikers team had a training session at the academy. They are going to participate in the Telangana Blind Cricket League, scheduled to be held at the Water Works Ground from April 14. Dr Ashok, IAS, GR Kiran, former national volleyball player lauded the cricketers. They said these cricketers are a great inspiration to youngsters who want to achieve greater things in life. Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter . Follow Us : Tags blind cricketers Hyderabad Strikers Sarojini Cricket and Fitness Academy Shravan Related News Two persons die in road mishap in Nizamabad Arnav, Humera win, to play for Hyderabad Strikers Hyderabad: Four attacked with knives in a row over wedding card Koppula Eshwar provides financial aid to accident victim Shravan, Naveen shine in A3 one-day league","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-16-20-updates-2882787","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 15:26:03","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Chennai Super Kings are 216/4. The live updates of Chennai Super Kings vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Royal Challengers Bangalore, Chennai Super Kings vs Royal Challengers Bangalore live score, Chennai Super Kings vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Shivam Dube is down for a chat. He says that he was keeping things simple, and he is used to this ground and he was disciplined in his batting. Mentions that MS Dhoni told him to keep calm and watch the last delivery and play accordingly. Says that it's been dry today, not much dew and that is good for them. Adds that Robin Uthappa and he were trying to attack the shorter side of grounds and were picking the right bowlers to hit. Not the best day on the field for Bangalore! They were on top at the end of the Powerplay. But post that, it's been only Chennai. All the bowlers were taken to the cleaners tonight. It's been tough for them. Josh Hazlewood was exceptional in his first two overs, but coming back for his second spell even he was hit all over. Wanindu Hasaranga did manage to grab two wickets but it was all too late for them. They have a mountain to climb from here now. A clinical performance from Chennai! After losing Moeen Ali and Ruturaj Gaikwad early in the innings. Chennai were in a spot of bother. Shivam Dub came in and started firing from the word go, he scored 95 runs off just 46 balls. Robin Uthappa took his time to settle in, but when once he was set, there was no stopping him and he went on to score 88 off just 50 deliveries. The duo put together 165 runs and guided Chennai to a score of over 200 runs. They have given the bowlers a lot to fight with now. Chennai have a golden opportunity now to clinch their first victory. Carnage, absolute carnage! It was raining boundaries! This is exactly what they needed! After a disappointing start, they have put a mammoth total of 216 on the board. Bangalore needs something special now to chase this down. 19.6 overs (1 Run) It is in the air but Shivam Dube does not connect it cleanly this time. He looks at the heaven in agony but nonetheless he gets a single off it. It is full and outside off. Shivam Dube lofts it towards long off. He could not clear the fence this time. Faf du Plessis though drops the catch in the deep and the batters take single. Chennai end with 216/4 on the scoreboard. 19.5 overs (2 Runs) A low full toss, on leg. Shivam Dube chips it to deep mid-wicket, although it lands safely. The batters take two. Shivam Dube on 94. Can he get a six off one delivery to rack his first ever Indian T20 League ton. 19.4 overs (6 Runs) SIX! ALL THE WAY! Shivam Dube moves to 92. Can he make his ton with two balls remaining. It is a short ball, on off. Shivam Dube swivels and pulls it over the square leg fence for a biggie. Beautifully picked up. 19.3 overs (0 Run) A sharp bouncer, on leg stump. Shivam Dube swivels and tries to heave it away but misses. 19.2 overs (0 Run) Length ball, down leg. Shivam Dube looks to flick it away but misses. This one hits his pad strap which rules out the wide. 19.1 overs (6 Runs) SIX! This is so effortless from Dube! Full length, on off. Shivam Dube stands tall and lofts it over the bowler's head for a biggie. He moves to 86. The crowd now chanting his name aloud. What an incredible moment for Dube. MS Dhoni comes to the crease now. Also, Josh Hazlewood will bowl the final over of the innings. 18.6 overs (0 Run) OUT! CAUGHT! Two wickets in two deliveries for Wanindu Hasaranga. Ravindra Jadeja walks back on a golden duck. With limited balls in hand counter-attack was the only way but Jadeja perishes. Tossed up, full and on off. Ravindra Jadeja gets low and slog-sweeps it to deep mid-wicket. Anuj Rawat runs to his right in the deep and takes a good flying catch. Ravindra Jadeja comes to the crease now. 18.5 overs (0 Run) OUT! CAUGHT! A valiant knock of Robin Uthappa comes to an end. A short ball, on the pads. Robin Uthappa moves back and pulls it to deep mid-wicket. Virat Kohli runs forward and takes a solid catch in the deep. 18.4 overs (1 Run) Low full toss, on off. Shivam Dube hits it hard down the ground to long off for a single. 18.3 overs (6 Runs) SIX! All the way! Shivam Dube in the form of his life. A short ball, on off. Shivam Dube rocks back and smokes it over the long on fence for a maximum. 200 up for Chennai. 18.2 overs (1 Run) LEG BYE! Flatter and on off. Robin Uthappa tries to reverse-hit it but misses. The ball goes to point off the pads. They cross for a leg bye. 18.1 overs (6 Runs) SIX! Ruthless Robin! This is incredible hitting. Tossed up, full and on off. Robin Uthappa comes down the track and lofts it over the bowler's head for a maximum. 17.6 overs (1 Run) A full toss, on off. Robin Uthappa heaves it through mid-wicket for one. The agony finally comes to an end for Akash Deep. He ends his spell of 4 overs by giving away 58 runs. A night to forget for him. 17.6 overs (1 Run) WIDE! This is some stretching exercise for the umpire. Third umpire on the trot. Akash Deep is unable to end this over. This is full and outside the tramline. 17.6 overs (1 Run) WIDE! Full length, outside the tramline. Robin Uthappa does not bother this time. The umpire signals a wide. 17.6 overs (1 Run) WIDE! This is way, way wide. Not even on the cut strip. Robin Uthappa moves till the tramline only to leave this delivery. Wide called by the umpire. Deep under a lot of pressure. 17.5 overs (1 Run) Touch short, on the bodyline. Shivam Dube tries to heave it across the line but gets it to square leg off his gloves. Just a single. 17.5 overs (1 Run) WIDE! Fuller, down leg. Shivam Dube fails to flick it away. Wide called. 17.4 overs (6 Runs) SIX! Everything he touches is turning in gold at the moment. A full toss, outside off. Shivam Dube latches onto it and muscles it over the cover fence for a maximum. Shivam Dube moves to 72 this is his best ever score in the Indian T20 League. 17.3 overs (2 Runs) Length ball, on off. Shivam Dube tries to heave across the line. The ball goes to third man off the top-edge. It lands safely and the batters cross for two runs. 17.2 overs (4 Runs) FOUR! Cheeky! Shivam Dube playing with the field setup now. Deep bangs it short, on off. Shivam Dube waits for it and ramps it over the keeper's head for a boundary. 17.1 overs (6 Runs) SIX! What a shot! This is massive! Full length, angled into the pads. Shivam Dube shuffles to the leg side, clears his front leg and tonks it over the long on fence for a maximum. Akash Deep (3-0-34-0) comes into the attack. 16.6 overs (1 Run) Full length, wide outside off. Shivam Dube punches it through the off side for a single. 16.6 overs (1 Run) NO BALL! Drama continues. Robin Uthappa was on his way to the pavilion until the siren went on. The umpire signals a no ball and the Bangalore celebration had to be cut-short. Full ball, on middle and leg. Robin Uthappa whips it aerially towards deep mid-wicket. The fielder grabs a stunning catch by running to his left but Robin Uthappa survives. They take one and a Free Hit to follow. 16.5 overs (0 Run) A short ball, on off. Robin Uthappa tries to heave it across the line but misses. 16.4 overs (4 Runs) NOT OUT! FOUR! A very simple decision for the third umpire. A length ball, on off. Robin Uthappa shuffles across the off stump and glances it down to fine leg for a boundary. Mohammed Siraj thinks it comes off his pads. Bangalore take a review and the replays are enough to confirm it comes off the bat. Review! Bangalore have reviewed an LBW decision! The replay shows that it was clearly off the bat. The on-field decision stands. 16.3 overs (6 Runs) SIX! Robin Uthappa only dealing in sixes now! A good-length ball, on off. Robin Uthappa dances down the track and slams it over the bowler's head for a biggie. 16.2 overs (6 Runs) SIX! BANG! This flies off the top-edge but the luck goes Robin Uthappa's way. A full-length ball, on off. Robin Uthappa looks to heave it hard across the line. The ball takes the top-edge and flies over the third man fence. 16.1 overs (0 Run) A length ball, angled down leg. Robin Uthappa heaves across the line but misses. The ball lobs to short fine leg off the pads. There is some noise but from the crowd. 15.6 overs (2 Runs) Full-length ball, on off. Shivam Dube flicks it through mid-wicket. The batters pick two before the fielder cuts it out. Mohammed Siraj (3-0-19-0) comes back into the attack. 15.6 overs (1 Run) WIDE! Full ball, down leg. Dube fails to clip it away. Wide called. 15.5 overs (1 Run) Very full, outside off. Robin Uthappa drives it to sweeper cover for a single. 15.4 overs (0 Run) Short ball again, on off. Robin Uthappa tries to pull it away but fails to connect this time. 15.3 overs (6 Runs) SIX! ALL THE WAY! Robin Uthappa has picked up the pace of his innings as well as this ball. It is short, on off. Robin Uthappa stands tall and smokes it over the mid-wicket fence for a biggie. 15.2 overs (1 Run) Length ball, on off. Dube whips it through mid-wicket for one. 15.1 overs (1 Run) Great effort by Suyash Prabhudessai but this one just falls short. It is a length ball, angled into the pads. Robin Uthappa comes down the track and heaves it across the line to deep mid-wicket. Suyash Prabhudessai puts his body on the line by diving forward. It lands short but he does well enough to stop it from going through. Just a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853937551949901.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-11-15-updates-2882694","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 14:55:42","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Chennai Super Kings are 134/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Royal Challengers Bangalore. Everything related to Chennai Super Kings and Royal Challengers Bangalore match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Royal Challengers Bangalore live score. Do check for Chennai Super Kings vs Royal Challengers Bangalore scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (4 Runs) FOUR! And fifty for Shivam Dube as well! What an important knock this has been from him! A fuller delivery, outside off. Shivam Dube slices it over the point fielder for a boundary. 14.5 overs (1 Run) On a length, outside off. Robin Uthappa pushes it uppishly towards mid off for a single. 14.4 overs (0 Run) very full this time, outside off. Robin Uthappa looks to drive this but the goes off the inner half back onto the deck. 14.3 overs (6 Runs) SIX! Robin Uthappa is on the charge! A shorter ball, around middle. Robin Uthappa pulls it over fine leg for a biggie! 14.2 overs (4 Runs) FOUR! Robin Uthappa brings up his fifty in style! A fuller delivery, around middle. Robin Uthappa flicks it towards deep mid-wicket for a boundary. Top knock from him so far! 14.1 overs (0 Run) Yorker-length delivery, outside off. Robin Uthappa looks to drive but he misses. 13.6 overs (1 Run) Floated, around off. Robin Uthappa works it to long on for another single. A probing but yet an expensive over by Wanindu Hasaranga comes to an end. 13.5 overs (1 Run) Tossed up, on the pads, Shivam Dube tucks it to mid-wicket for a quick single. 13.5 overs (1 Run) WIDE! Full, angled down leg. Dube fails to chase it. Dinesh Karthik does well to not let it slip by this time. 13.4 overs (4 Runs) FOUR BYES! A googly, around middle. Shivam Dube once again goes smash this but he misses. Dinesh Karthik behind the stumps misses it as well. The ball races away towards fine leg for a boundary. 13.3 overs (2 Runs) DROPPED! A tough chance goes down! Great effort from Mohammed Siraj though! Another googly, full, around middle. Shivam Dube sweeps it towards deep square leg. Mohammed Siraj runs forward, dives, and gets his hands to it but fails to hold on to it. Two taken! 13.2 overs (4 Runs) FOUR! Top effort from Glenn Maxwell in the deep! A fuller ball, around middle. Shivam Dube sweeps it wide of long on. Glenn Maxwell runs to his left, and keeps the ball away from the boundary with his left hand, but he has made contact with the boundary ropes in the process. Boundary given! 13.1 overs (0 Run) Beaten! A googly, tad quicker, around middle. Shivam Dube hangs back and looks to cut this but he misses. Strategic break! Oh boy! It looks like Robin Uthappa is back in his peak. He is tearing apart the Bangalore bowlers along with Shivam Dube. The two batters have made sure Chennai do not lose the momentum in the middle overs. Bangalore though have a strong bowling pack and will look to make inroads in the match. An enticing passage of play awaits. 12.6 overs (6 Runs) SIX! Wow, make that three sixes in the over! Another fuller ball, outside off. Robin Uthappa gets down on his knee and once again smashes it over deep mid-wicket. 18 runs off the over! 12.5 overs (0 Run) Flatter ball, outside off. Robin Uthappa pushes it towards cover. 12.4 overs (0 Run) Quicker through the air, full, outside off. Robin Uthappa taps it towards short third man. 12.3 overs (6 Runs) SIX! Back-to-back sixes! Fuller delivery, outside off. Robin Uthappa gets down on his knee and slog-sweeps this over deep mid-wicket for another maximum. 12.2 overs (6 Runs) SIX! Robin Uthappa joins the party now! A shorter ball, around middle. Robin Uthappa swivels and pulls it over deep mid-wicket for a biggie! 12.1 overs (1 Run) Loopy ball, slower through the air, full, around middle. Shivam Dube drives it uppishly towards long on for a single. 11.6 overs (1 Run) Full again, outside off. Shivam Dube presses forward and taps it towards cover for a single. That brings up the 50-run partnership between these two! 11.5 overs (6 Runs) SIX! KABOOM! Loopy delivery, outside off, fuller ball. Shivam Dube gets down on his knee and sweeps it over deep mid-wicket for a biggie! 11.4 overs (2 Runs) Good fielder! Once again it's Suyash Prabhudessai! Outside off, fuller ball. Shivam Dube guides it past point. Suyash Prabhudessai runs across to his right, dives, and makes a good stop. Two taken! 11.3 overs (1 Run) Short once again, outside off. Robin Uthappa pushes it off the back foot towards long off for a single. 11.2 overs (2 Runs) Spinning away, outside off, shorter ball again. Robin Uthappa rocks back and cuts it past point. Two taken! 11.1 overs (1 Run) Back of a length, spinning in, around middle. Shivam Dube knocks it towards square leg for a single. 10.6 overs (1 Run) Fuller ball, around middle. Shivam Dube flicks it towards mid-wicket for a single. 13 runs off the over! 10.5 overs (4 Runs) FOUR! Nicely done! This is good batting from Shivam Dube! A shorter ball, around middle. Shivam Dube uses the depth of his crease and pulls it towards deep mid-wicket for a boundary. 10.4 overs (1 Run) Fuller delivery, another googly, around middle. Robin Uthappa leans and taps it towards square leg for a single. 10.3 overs (1 Run) Shorter ball, spinning away, outside off. Shivam Dube pushes it towards deep cover for single. 10.2 overs (6 Runs) SIX! BOOM! Tosses it up, full, around middle. Shivam Dube tonks it high over long on for a biggie! 10.1 overs (0 Run) Starts off with a googly, outside off, full. Shivam Dube looks to sweep but he misses.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853919341618443.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs RCB Live Score: Moeen Ali Departs, Chennai Super Kings 2 Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1jc2stdnMtcmNiLWxpdmUtc2NvcmUtdXBkYXRlcy1jaGVubmFpLXN1cGVyLWtpbmdzLXZzLXJveWFsLWNoYWxsZW5nZXJzLWJhbmdhbG9yZS1saXZlLXNjb3JlLTI4ODIwODjSAZMBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItY3NrLXZzLXJjYi1saXZlLXNjb3JlLXVwZGF0ZXMtY2hlbm5haS1zdXBlci1raW5ncy12cy1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtbGl2ZS1zY29yZS0yODgyMDg4L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs RCB Live Score: Moeen Ali Departs, Chennai Super Kings 2 Down  NDTV SportsCSK v RCB: Game Day Preview | IPL 2022  Royal Challengers BangaloreCSK vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Super Kings vs RCB, Indian Premier League 2022, 22nd Match  ESPNcricinfoVirat Kohli and Faf Du Plessis at practice before CSK v RCB | IPL 2022  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-04-12 14:46:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-6-10-updates-2882596","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 14:35:52","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.2 overs, Chennai Super Kings are 66/2. The live updates of Chennai Super Kings vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Royal Challengers Bangalore, Chennai Super Kings vs Royal Challengers Bangalore live score, Chennai Super Kings vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) Fuller, down leg, Dube clips it to square leg for a quick single. A tidy start by Shahbaz Ahmed. He goes only for five runs in his first over. 9.5 overs (1 Run) Another single! Both the batters making sure to keep the runs ticking. It is short and wide outside off. This one turns away. Robin Uthappa cuts it hard to deep point for one. 9.4 overs (1 Run) Tossed up, full and outside off. Shivam Dube clips it to the leg side for one more. 9.3 overs (1 Run) Short ball, outside off. Robin Uthappa cuts it through point for a single. 9.2 overs (1 Run) Darted on the pads. Dube flicks it to square leg for a single. 9.1 overs (0 Run) Floated and full, outside off. Dube steps across and flicks it to mid-wicket. Not in the gap though. Strategic break! Chennai have lost two wickets till now, but Robin Uthappa and Shivam Dube have looked solid till now. They have done well to steady the ship, and can probably carry on the same way for a few more overs. Bangalore will be looking to grab a few quick wickets and put some pressure back on the opposition. Also, Shahbaz Ahmed comes into the attack. 8.6 overs (1 Run) Shorter, outside off. Shivam Dube cuts it to sweeper cover for a single. Another good over for Chennai, 8 runs off it. 8.5 overs (0 Run) This is angled into the pads. Dube plays it back to the bowler. 8.4 overs (6 Runs) SIX! BOOM! Shivam Dube continues on his merry way with Chennai. It is full and on off. Shivam Dube gets under it and slams it over the long on fence for a maxmimum. 8.3 overs (0 Run) Quicker, on the stumps. Dube taps it to backward point. 8.2 overs (1 Run) Full, on middle and leg. Robin Uthappa eases it to long on for a single. 8.1 overs (0 Run) Tossed up, on the pads. Robin Uthappa fails to pick it up. He gets pinged on his pads. Maxwell appeals but the umpire shows no interest. 7.6 overs (0 Run) Good length, on off. Dube dabs it to point. A good end to the over, but still the most expensive of the innings. Chennai get 10 runs off it. 7.5 overs (0 Run) Full length, on off. Dube drives it to cover but straight to the fielder. 7.4 overs (4 Runs) FOUR! Easy pickings! Shivam Dube gets his first boundary of the innings. A short ball, angled down leg. Shivam Dube helps it around the corner for a boundary. 7.3 overs (1 Run) Good length, just outside off. Robin Uthappa shuffles across and flicks it to mid on for one. 7.2 overs (4 Runs) FOUR! Perfectly placed! It is a short ball, on the fourth-stump line. Robin Uthappa plays it late and steers it down to third man for a boundary. 7.1 overs (1 Run) Length ball, outside off. Shivam Dube punches it to point for a single. 6.6 overs (1 Run) Outside off, Dube drives it through covers for a single. He gets off the mark. 6.5 overs (0 Run) Fuller, on off. Dube pushes it back to the bowler. Shivam Dube walks out to bat now. 6.4 overs (0 Run) OUT! RUN OUT! This is sensational fielding. This will surely ease down some nerves of the debutant, Suyash Prabhudessai. He wastes no time in introducing himself. Coming to the delivery - It is short and outside off. Moeen Ali cuts it to the right of backward point. Suyash Prabhudessai makes a full-stretched dive to that side. Meanwhile, Ali thought he surely deserves a single for that shot and ventures out looking for a single. Robin Uthappa sends him back but is a little too late. Suyash Prabhudessai throws it to Dinesh Karthik, who flies into the stumps with the ball. 6.3 overs (0 Run) On off, blocked back to the bowler. 6.2 overs (1 Run) Length, on off. Robin Uthappa flicks it to mid-wicket for one. 6.1 overs (0 Run) Flatter and short, outside off. Robin Uthappa tries to cut it away but gets an inside edge on his pads. Glenn Maxwell comes into the attack. 5.6 overs (1 Run) A nice delivery to end the over! Deep hits the hard length, outside off. Robin Uthappa shuffles across but fails to flick it away. The ball goes to short third man off his thigh pads. They cross for a leg bye. Chennai are 35/1 at the end of the Powerplay! 5.5 overs (6 Runs) SIX! BANG! Robin Uthappa takes the aerial route now. It is overpitched, and on off. Robin Uthappa stands tall, lofts it over the bowler's head and sends it over the long off fence. 5.4 overs (0 Run) A loud appeal for lbw but turned down! Full length, outside off. Robin Uthappa walks across and tries to flick it away but misses. He gets struck on the pads. Clearly outside the line. 5.3 overs (1 Run) Good length, on middle and leg. Ali gets an inside edge onto his pads. The ball rolls to the off side. They cross for a single. 5.2 overs (1 Run) Good length, on the pads. Robin Uthappa flicks it aerially towards deep square leg for one. 5.1 overs (1 Run) A length ball, outside off. Moeen Ali pushes it to mid off and takes on Faf du Plessis stationed there. The Bangalore skipper fumbles and the batters take an easy single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853907437359391.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Suyash Prabhudessai RCB stats: Why are Harshal Patel and David Willey not playing today’s IPL 2022 match between Chennai Super Kings and Royal Challengers Bangalore?","link":"https://thesportsrush.com/cricket-news-suyash-prabhudessai-rcb-stats-why-are-harshal-patel-and-david-willey-not-playing-todays-ipl-2022-match-between-chennai-super-kings-and-royal-challengers-bangalore/","keywords":["Cricket","CSK","IPL 2022","RCB","chennai super kings","csk","Indian Premier League","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Harshal Patel and David Willey: Royal Challengers Bangalore have made a couple of changes to their Playing XI for this match. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Royal Challengers Bangalore captain Faf du Plessis has won… The post Suyash Prabhudessai RCB stats: Why are Harshal Patel and David Willey not playing today’s IPL 2022 match between Chennai Super Kings and Royal Challengers Bangalore? appeared first on The SportsRush.","content":"Harshal Patel and David Willey: Royal Challengers Bangalore have made a couple of changes to their Playing XI for this match. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Royal Challengers Bangalore captain Faf du Plessis has won the toss and chose to bowl yet again. “We are going to have a bowl. Going with the trend of the tournament, win the toss and bowl. We have been good with the ball. We need to improve with the last two overs,” du Plessis told Star Sports at the toss. Much like du Plessis, Chennai Super Kings captain Ravindra Jadeja also wanted to follow the trend of fielding first in IPL 2022. Searching for an elusive victory this season, Jadeja hoped for his team to “fight it out” at the Dr DY Patil Sports Academy tonight. Brothers in arms! #WhistlePodu #Yellove #CSKvRCB pic.twitter.com/Pb1ybql4na — Chennai Super Kings (@ChennaiIPL) April 12, 2022 “We would have bowled first as well, looking at the wicket. We’ll look to come here and play competitive cricket. The toss is not going our way, something that’s not going out way. As a team every game is important. We’ll try to fight it out and clinch our first win hopefully,” Jadeja told Star Sports at the toss. Why are Harshal Patel and David Willey not playing vs CSK today? With Australia fast bowler Josh Hazlewood available to play now, Royal Challengers made the obvious change of playing him ahead of England all-rounder David Willey. In four matches this season, Willey’s solitary wicket has come at an economy and strike rate of 6.54 and 66 respectively. Furthermore, pacer Harshal Patel is also missing this match after leaving the bio-bubble following his sister’s death. Goa all-rounder Suyash Prabhudessai, who has been handed an IPL debut, has replaced Patel in the Playing XI. Prabhudessai, 24, has scored 443 runs in 20 T20 innings at an average and strike rate of 31.64 and 148.16 respectively including a half-century. “Josh Hazlewood is back. Excited to see what he will do with the new ball. We also have an exciting youngster [Suyash Prabhudessai] coming in,” du Plessis added. Super Kings, on the other hand, will be taking the field without making any change to their Playing XI. The post Suyash Prabhudessai RCB stats: Why are Harshal Patel and David Willey not playing today’s IPL 2022 match between Chennai Super Kings and Royal Challengers Bangalore? appeared first on The SportsRush.","pubDate":"2022-04-12 13:57:22","full_description":"Harshal Patel and David Willey: Royal Challengers Bangalore have made a couple of changes to their Playing XI for this match. During the 22nd match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Royal Challengers Bangalore in Navi Mumbai, Royal Challengers Bangalore captain Faf du Plessis has won the toss and chose to bowl yet again. “We are going to have a bowl. Going with the trend of the tournament, win the toss and bowl. We have been good with the ball. We need to improve with the last two overs,” du Plessis told Star Sports at the toss. Much like du Plessis, Chennai Super Kings captain Ravindra Jadeja also wanted to follow the trend of fielding first in IPL 2022. Searching for an elusive victory this season, Jadeja hoped for his team to “fight it out” at the Dr DY Patil Sports Academy tonight. Brothers in arms! 🫂 #WhistlePodu #Yellove #CSKvRCB 💛🦁 pic.twitter.com/Pb1ybql4na — Chennai Super Kings (@ChennaiIPL) April 12, 2022 “We would have bowled first as well, looking at the wicket. We’ll look to come here and play competitive cricket. The toss is not going our way, something that’s not going out way. As a team every game is important. We’ll try to fight it out and clinch our first win hopefully,” Jadeja told Star Sports at the toss. With Australia fast bowler Josh Hazlewood available to play now, Royal Challengers made the obvious change of playing him ahead of England all-rounder David Willey. In four matches this season, Willey’s solitary wicket has come at an economy and strike rate of 6.54 and 66 respectively. Furthermore, pacer Harshal Patel is also missing this match after leaving the bio-bubble following his sister’s death . Goa all-rounder Suyash Prabhudessai, who has been handed an IPL debut, has replaced Patel in the Playing XI. Prabhudessai, 24, has scored 443 runs in 20 T20 innings at an average and strike rate of 31.64 and 148.16 respectively including a half-century. “Josh Hazlewood is back. Excited to see what he will do with the new ball. We also have an exciting youngster [Suyash Prabhudessai] coming in,” du Plessis added. Super Kings, on the other hand, will be taking the field without making any change to their Playing XI.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Ashwin’s retired out not out of the blue, says Samson","link":"https://telanganatoday.com/ipl-2022-ashwins-retired-out-not-out-of-the-blue-says-samson","keywords":["Cricket","IPL","News","Sport","IPL 2022","Rajasthan Royals","Ravichandran Ashwin","Sanju Samson"],"creator":["IANS"],"video_url":null,"description":"Mumbai: Rajasthan Royals skipper Sanju Samson has said that Ravichandran Ashwin”s decision to ”retire out” – which caught everyone, including some of his teammates, by surprise – was not something out of the blue, and that it had been under discussion in the side before the start of IPL 2022. Whether it had been planned […]","content":"Mumbai: Rajasthan Royals skipper Sanju Samson has said that Ravichandran Ashwin”s decision to ”retire out” – which caught everyone, including some of his teammates, by surprise – was not something out of the blue, and that it had been under discussion in the side before the start of IPL 2022. Whether it had been planned by Ashwin or not, but after pushing Lucknow Super Giants” (LSG) Avesh Khan to cover for a single, he kept running after completing the run and stopped only after reaching the dressing room. The fact that Riyan Parag walked out to bat straightaway meant the team was expecting such a move from Ashwin. Ashwin”s batting partner at that time, Shimron Hetmyer struck Khan for sixes of successive deliveries and Parag too struck a big six before getting out, going for another big one off the penultimate delivery of the match to boost RR”s score to 165 for six. The winners of the inaugural IPL edition then restricted LSG to 162/8 for a narrow three-run win. Samson conceded that RR were trying out different strategies in the current edition of the IPL. “It”s about being Rajasthan Royals. We keep trying different things. We have talked about it before the start season. We thought that if some situation occurs, we can use it. Was a team decision,” Samson said. However, West Indies” Shimron Hetmyer had said after the match that he had no idea about the ”retired out” strategy. “I had no idea about it! He (Ashwin) was also a bit tired. It was a good decision, as the kid (Parag) hit a six for us.” Rajasthan”s director of cricket, Kumar Sangakkara too has praised Ashwin”s decision to sacrifice his wicket. “It was the right time to do that. Ashwin himself was asking from the field as well and we had discussed just before that as to what we would do. As the coach I got one call wrong not sending Riyan Parag ahead of Rassie van der Dussen and holding Rassie back. So we couldn”t get the full benefit of Riyan, but how Ashwin handled that situation, walking in under pressure, he batted, supported the team and then finally sacrificed himself in terms of retiring himself out and then backed it up with a magnificent bowling effort,” said Sangakkara.     Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-12 13:46:27","full_description":"Home | Cricket | Ipl 2022 Ashwins Retired Out Not Out Of The Blue Says Samson IPL 2022: Ashwin’s retired out not out of the blue, says Samson By IANS Published: Published Date - 07:16 PM, Tue - 12 April 22 Source: IANS Mumbai: Rajasthan Royals skipper Sanju Samson has said that Ravichandran Ashwin”s decision to ”retire out” – which caught everyone, including some of his teammates, by surprise – was not something out of the blue, and that it had been under discussion in the side before the start of IPL 2022. Whether it had been planned by Ashwin or not, but after pushing Lucknow Super Giants” (LSG) Avesh Khan to cover for a single, he kept running after completing the run and stopped only after reaching the dressing room. The fact that Riyan Parag walked out to bat straightaway meant the team was expecting such a move from Ashwin. Ashwin”s batting partner at that time, Shimron Hetmyer struck Khan for sixes of successive deliveries and Parag too struck a big six before getting out, going for another big one off the penultimate delivery of the match to boost RR”s score to 165 for six. The winners of the inaugural IPL edition then restricted LSG to 162/8 for a narrow three-run win. Samson conceded that RR were trying out different strategies in the current edition of the IPL. “It”s about being Rajasthan Royals. We keep trying different things. We have talked about it before the start season. We thought that if some situation occurs, we can use it. Was a team decision,” Samson said. However, West Indies” Shimron Hetmyer had said after the match that he had no idea about the ”retired out” strategy. “I had no idea about it! He (Ashwin) was also a bit tired. It was a good decision, as the kid (Parag) hit a six for us.” Rajasthan”s director of cricket, Kumar Sangakkara too has praised Ashwin”s decision to sacrifice his wicket. “It was the right time to do that. Ashwin himself was asking from the field as well and we had discussed just before that as to what we would do. As the coach I got one call wrong not sending Riyan Parag ahead of Rassie van der Dussen and holding Rassie back. So we couldn”t get the full benefit of Riyan, but how Ashwin handled that situation, walking in under pressure, he batted, supported the team and then finally sacrificed himself in terms of retiring himself out and then backed it up with a magnificent bowling effort,” said Sangakkara. Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter . Follow Us : Tags IPL 2022 Rajasthan Royals Ravichandran Ashwin Sanju Samson Related News IPL 2022: Williamson’s measured fifty seals 8-wicket win for SRH over Gujarat IPL: RR beat LSG by 3 runs IPL 2022: Inconsistent Sunrisers Hyderabad take on unbeaten Titans IPL 2022: RCB takes dig after Kohli’s contentious LBW dismissal against MI IPL 2022: RCB march on as MI lose four on trot IPL 2022: Super Giants, Royals set up intriguing clash","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-royal-challengers-bangalore-live-score-over-match-22-t20-1-5-updates-2882364","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-12 13:44:07","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 0.0 overs, Chennai Super Kings are 0/0. The live updates of Chennai Super Kings vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Royal Challengers Bangalore, Chennai Super Kings vs Royal Challengers Bangalore live score, Chennai Super Kings vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. The game is set to begin. Ravindra Jadeja, the skipper of Chennai says that he would have bowled first as well, and further says that the pitch looks a bit dry today. Mentions that the toss is something that has not been going their way. But they are here to play competitive cricket and they will fight and hopefully clinch their first victory. Informs that they are playing with the same team. Faf du Plessis, the Bangalore captain says they will bowl first. They are unsure how the dew will impact the game. Mentions, there is some knowledge shared but Chennai knows his game really well. Further says that it looks like playing against his brothers. Mentions a youngster is set to make his debut. Chennai (Unchanged Playing XI) - Robin Uthappa, Ruturaj Gaikwad, Moeen Ali, Shivam Dube, Ambati Rayudu, MS Dhoni (WK), Ravindra Jadeja (C), Dwayne Bravo, Chris Jordan, Maheesh Theekshana, Mukesh Choudhary. Bangalore (Playing XI) - Faf du Plessis (C), Anuj Rawat, Virat Kohli, Glenn Maxwell, Dinesh Karthik (WK), Shahbaz Ahmed, Wanindu Hasaranga, Suyash Prabhudessai (In for Harshal Patel), Josh Hazlewood (In for David Willey), Mohammed Siraj, Akash Deep. TOSS - Bangalore have won the toss and they have elected to BOWL first. PITCH REPORT - Graeme Swann is near the pitch. He says that this is the same pitch that was used last night, and it is very very dry. Adds that the pitch will support spin and while it's not the best for seamers. Mentions that around 170-180 should be a good score. Toss has also played an important factor in this edition. Ravindra Jadeja has not had the best of lucks with toss as well. We have witnessed the teams bowling first come out on top on most of the occasions at this venue and we could see the team winning the toss chase a target here. Stay tuned for the all important toss and other updates as well. Chennai have some great quality in their ranks, but they have not clicked just yet. They are surely missing out on the services of their ace bowler Deepak Chahar and they will be hoping he returns to the side as soon as possible. But for now, they will want players like Ruturaj Gaikwad to step up. He has not displayed his true magic yet and it is time for him to provide Chennai with the desired start. After losing their opening game, Bangalore have fought back well and have managed to win 3 back-to-back games. They are performing as a unit and will want to carry on the momentum. It will be interesting to see how Faf du Plessis plays against his former team. Also, Bangalore could be without their bowler Harshal Patel. Who would replace him? We will know soon! Hello and a warm welcome folks to match number 22 of the Indian T20 League where Bangalore will lock horns with Chennai. Bangalore are coming into this game at the back of a victory and will be heading into this game high on confidence. While Chennai are yet to win a game in this tournament, nothing seems to be working for them right but they need to turn things around before it gets too late for them. Get ready for the battle of the south! Like every other game, this too promises to be a cracker. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853876379167018.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - Mumbai vs Punjab Kings, Indian Premier League 2022, 23rd Match - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi0xMjk4NDIzL211bWJhaS1pbmRpYW5zLXZzLXB1bmphYi1raW5ncy0yM3JkLW1hdGNoLTEzMDQwNjkvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - Mumbai vs Punjab Kings, Indian Premier League 2022, 23rd Match  ESPNcricinfoIPL 2022: 3 Changes MI need to make for their game against PBKS  CricTrackerMumbai Indians vs Punjab Kings Match Prediction: Who Will Win Today's IPL Match Between MI And PBKS? IPL 20222, Match 23, MI vs PBKS  Cricket AddictorMumbai Indians vs Punjab Kings Live Streaming: When and Where to Watch IPL 2022 Live Coverage on Live TV On  News18IPL 2022: Match 23, MI vs PBKS Match Prediction – Who will win today’s IPL match between MI and PBKS?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-12 13:23:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“It’s an absolute treat”: Aaron Finch picks better cover driver between Babar Azam and Virat Kohli","link":"https://thesportsrush.com/cricket-news-its-an-absolute-treat-aaron-finch-picks-better-cover-driver-between-babar-azam-and-virat-kohli/","keywords":["Cricket","IPL 2022","KKR"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Aaron Finch selected Virat Kohli and Babar Azam as the best cover drivers in a recent interaction on Twitter. Kolkata Knight Riders have won three of their five games in IPL 2020, and they are in the top half of the table. The KKR side received a major boost by the return of Australian captain… The post “It’s an absolute treat”: Aaron Finch picks better cover driver between Babar Azam and Virat Kohli appeared first on The SportsRush.","content":"Aaron Finch selected Virat Kohli and Babar Azam as the best cover drivers in a recent interaction on Twitter. Kolkata Knight Riders have won three of their five games in IPL 2020, and they are in the top half of the table. The KKR side received a major boost by the return of Australian captain Aaron Finch in their ranks. Finch went unsold in the mega-auction, but he came in as a replacement of English batter Alex Hales. Alex Hales decided to opt out of the IPL due to bio-bubble fatigue. To adjust Finch in the playing eleven, KKR will have to manage their overseas players. Aaron Finch picks Babar Azam and Virat Kohli as best cover drivers Australian white-ball skipper Finch has joined the Kolkata Knight Riders camp after completing his international duties. He has completed his quarantine and will be available for the game against Sunrisers Hyderabad at the Brabourne Stadium in Mumbai on 15 April 2022. Aaron Finch took over the Kolkata Knight Riders’ Twitter handle and answered some fan questions. One user asked Aaron Finch about who has the best cover drive in cricket. “Aaron who do you think plays the best cover drive #AskKKR,” a fan asked on Twitter. Aaron Finch responded with two stars of the world cricket in Virat Kohli and Babar Azam. He said that it is a treat to watch both Babar and Virat play the cover drive. “Virat Kohli and Babar Azam – it’s an absolute treat watching the two of these guys play that shot,” Aaron Finch said. Virat Kohli and Babar Azam – it’s an absolute treat watching the two of these guys play that shot : ICC https://t.co/cvqWUfisZp pic.twitter.com/qbGdSoym46 — KolkataKnightRiders (@KKRiders) April 12, 2022 Kolkata Knight Riders will be Aaron Finch’s 9th IPL franchise, the most for any player in the history of the competition. Finch has played for Rajasthan Royals, Delhi Daredevils (now Delhi Capitals), Pune Warriors India, Sunrisers Hyderabad, Mumbai Indians, Gujarat Lions, Kings XI Punjab (now Punjab Kings) and Royal Challengers Bangalore in the past. The post “It’s an absolute treat”: Aaron Finch picks better cover driver between Babar Azam and Virat Kohli appeared first on The SportsRush.","pubDate":"2022-04-12 12:58:40","full_description":"Aaron Finch selected Virat Kohli and Babar Azam as the best cover drivers in a recent interaction on Twitter. Kolkata Knight Riders have won three of their five games in IPL 2020, and they are in the top half of the table. The KKR side received a major boost by the return of Australian captain Aaron Finch in their ranks. Finch went unsold in the mega-auction, but he came in as a replacement of English batter Alex Hales. Alex Hales decided to opt out of the IPL due to bio-bubble fatigue. To adjust Finch in the playing eleven, KKR will have to manage their overseas players. Australian white-ball skipper Finch has joined the Kolkata Knight Riders camp after completing his international duties. He has completed his quarantine and will be available for the game against Sunrisers Hyderabad at the Brabourne Stadium in Mumbai on 15 April 2022. Aaron Finch took over the Kolkata Knight Riders’ Twitter handle and answered some fan questions. One user asked Aaron Finch about who has the best cover drive in cricket. “Aaron who do you think plays the best cover drive #AskKKR,” a fan asked on Twitter. Aaron Finch responded with two stars of the world cricket in Virat Kohli and Babar Azam. He said that it is a treat to watch both Babar and Virat play the cover drive. “Virat Kohli and Babar Azam – it’s an absolute treat watching the two of these guys play that shot,” Aaron Finch said. Virat Kohli and Babar Azam – it’s an absolute treat watching the two of these guys play that shot 👌 📷: ICC https://t.co/cvqWUfisZp pic.twitter.com/qbGdSoym46 — KolkataKnightRiders (@KKRiders) April 12, 2022 Kolkata Knight Riders will be Aaron Finch’s 9th IPL franchise , the most for any player in the history of the competition. Finch has played for Rajasthan Royals, Delhi Daredevils (now Delhi Capitals), Pune Warriors India, Sunrisers Hyderabad, Mumbai Indians, Gujarat Lions, Kings XI Punjab (now Punjab Kings) and Royal Challengers Bangalore in the past.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"LIVE IPL 2022, CSK vs RCB Live Score Match Updates, Chennai vs Bangalore Live Cricket Score, Latest Scorecard","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-csk-vs-rcb-live-score-online-updates-chennai-super-kings-royal-challengers-bangalore-dhoni-kohli-toss-updates-match-highlights-2022-04-12-769275","keywords":null,"creator":null,"video_url":null,"description":"LIVE IPL 2022, CSK vs RCB Live Score Match Updates, Chennai vs Bangalore Live Cricket Score, Latest Scorecard","content":null,"pubDate":"2022-04-12 12:34:17","full_description":null,"image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: We are in transition phase every team goes through: Bumrah","link":"https://www.tribuneindia.com/news/sports/ipl-2022-we-are-in-transition-phase-every-team-goes-through-bumrah-385755","keywords":null,"creator":null,"video_url":null,"description":"Pune, April 12Mumbai Indians vice-captain Jasprit Bumrah understands and accepts the hard truth that Mumbai Indians is indeed going through a \"transition phase\" and the new kids in the block need to understand how to react to pressure situations in a high intensity tournament like IPL. MI have already lost four games on trot and lack of bowling options is hurting the five-time champions badly.\"It's a transition phase that every cricketer understands, and every team goes through that. We are in that phase; we have got a new group,\" Bumrah said.\"So understanding the format of the IPL, how you have to handle pressure and achieve success in this league.\"We are going through that. We are looking forward that we go through this transition, and then we have all the players we had and the quality will come back again,\" he said.For Bumrah, it is important that MI lives in the present rather than stressing on the past \"Right now, we live in the present. Yes, things have not gone according to plan so far, but we keep on fighting and we keep on finding a way,\" Bumrah was quoted as saying in media release issued by the franchise.\"That is the way the game of cricket works. Whenever a challenge comes, you try to find solutions to the challenge and we are trying to do that,\" he added.Bumrah feels that the tracks have been heavily loaded in favour of batters this time and the toss has proved to be crucial so far.\"This year when the wickets are helping the batters and it's difficult to take wickets, you have to find your ways. We are no different. We are trying to find new ways. We've come up with a few plans,\" the right-arm speedster said, without divulging the plans.Toss indeed has become a crucial factor.\"If it was up to me, I would say win the toss. That really helps. But yes, whenever you come into this scenario, there is a little bit of help with the new ball, so maintaining a good line, trying to swing the ball upfront, I think will help you,\" he quipped.\"As soon as you come to the later stages, be it the first innings or the second innings, the wicket settles down (due to dew). So then maybe you have to start your death bowling a little early.\"All of these pointers might help the other bowlers as well, so we're looking to address that as soon as possible and then use it to our advantage,\" he added.","content":null,"pubDate":"2022-04-12 11:34:08","full_description":"PTI Pune, April 12 Mumbai Indians vice-captain Jasprit Bumrah understands and accepts the hard truth that Mumbai Indians is indeed going through a \"transition phase\" and the new kids in the block need to understand how to react to pressure situations in a high intensity tournament like IPL. MI have already lost four games on trot and lack of bowling options is hurting the five-time champions badly. \"It's a transition phase that every cricketer understands, and every team goes through that. We are in that phase; we have got a new group,\" Bumrah said. \"So understanding the format of the IPL, how you have to handle pressure and achieve success in this league. \"We are going through that. We are looking forward that we go through this transition, and then we have all the players we had and the quality will come back again,\" he said. For Bumrah, it is important that MI lives in the present rather than stressing on the past \"Right now, we live in the present. Yes, things have not gone according to plan so far, but we keep on fighting and we keep on finding a way,\" Bumrah was quoted as saying in media release issued by the franchise. \"That is the way the game of cricket works. Whenever a challenge comes, you try to find solutions to the challenge and we are trying to do that,\" he added. Bumrah feels that the tracks have been heavily loaded in favour of batters this time and the toss has proved to be crucial so far. \"This year when the wickets are helping the batters and it's difficult to take wickets, you have to find your ways. We are no different. We are trying to find new ways. We've come up with a few plans,\" the right-arm speedster said, without divulging the plans. Toss indeed has become a crucial factor. \"If it was up to me, I would say win the toss. That really helps. But yes, whenever you come into this scenario, there is a little bit of help with the new ball, so maintaining a good line, trying to swing the ball upfront, I think will help you,\" he quipped. \"As soon as you come to the later stages, be it the first innings or the second innings, the wicket settles down (due to dew). So then maybe you have to start your death bowling a little early. \"All of these pointers might help the other bowlers as well, so we're looking to address that as soon as possible and then use it to our advantage,\" he added. #IPL2022","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_343429680.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Prithvi Shaw, Quinton de Kock share top spot among boundary hitters after second week","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-prithvi-shaw-quinton-de-kock-share-top-spot-among-boundary-hitters-after-second-week-10547821.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Prithvi Shaw, Quinton de Kock share top spot among boundary hitters after second week","content":"The IPL has been a riveting watch so far and one of the main reasons behind the same is the pitches on offer across the four venues in Maharashtra. Since summer has arrived in India, there has been a concerted effort to leave an honest covering of grass on each of the four venues and this has resulted in seam bowlers getting plenty of assistance in the form of pace and bounce.While this has made for enthralling viewing, the batters – especially the stroke-makers have also enjoyed themselves. Openers tend to dominate white-ball cricket and the trend is no different in the IPL as well. Prithvi Shaw leads the charts when it comes to smashing the most number of fours. The young batter from Delhi Capitals is playing this season with a point to prove and has made a solid start.In 4 innings so far, he has scored 160 runs and as has always been the case with Prithvi, he takes off in the powerplay overs. So far, he has creamed 21 fours in 4 innings and is the joint leader in this metric along with Quinton de Kock – the Lucknow Super Giants opener.Ishan Kishan has been the lone bright spot in an otherwise miserable start to the campaign for the Mumbai Indians and he comes in at the third spot with 20 fours in 4 innings. Gujarat Titans have made a brilliant start to their campaign in their debut season and have won 3 games. Their retention before the mega auctions, Shubman Gill and Hardik Pandya, both of whom have been consistent for Gujarat Titans, have hit 18 fours in 4 innings each.If the first 2 weeks of the IPL is anything to go by, dew has played a part, but in the recent few matches, spinners too have come into their own and this next phase could be an interesting watch.Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022, and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-12 11:00:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/04/Prithvi-Shaw-640-Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Jos Buttler, Shimron Hetmyer highlight top six-hitters list after Week 2","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-jos-buttler-shimron-hetmyer-highlight-top-six-hitters-list-after-week-2-10547691.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Jos Buttler, Shimron Hetmyer highlight top six-hitters list after Week 2","content":"Rajasthan Royals ended Week 2 with a thrilling win over the Lucknow Super Giants. And, now, RR is sitting on top of the points table with a net run rate of +0.951.Kolkata Knight Riders, courtesy their heavy defeat at the hands of Delhi Capitals, have now slipped to the second spot with three wins in five matches, but their net run rate stands at 0.446.If we take a look at the composition of different sides, Rajasthan Royals look like the most settled unit. Their batting is powered by Jos Buttler at the top of the order. The England wicket-keeper batter has already notched up a century this season and he also tops the charts as far as the six hitters are concerned. In four matches so far, Buttler has scored 218 runs and this includes 15 fours and 15 sixes.He is then followed by Shimron Hetmyer, another Rajasthan Royals player who made the difference in the last match against the Lucknow Super Giants. Coming in the middle order, Hetmyer has taken up the responsibility of finishing the innings. He played a superb hand in taking Rajasthan to a decent total against Lucknow.In four matches so far, Hetmyer has already smacked 14 sixes and has scored 168 runs at an amazing strike-rate of around 179. This batting power has made Rajasthan an advantage in this season.Liam Livingstone is finally justifying his tag as an explosive batter in the IPL. Punjab Kings has adopted an aggressive brand of cricket this season and the form of Livingstone should really gladden their hearts. The Englishman has hit 12 sixes in 4 matches and is striking at an amazing rate of 190.58.Andre Russell with 12 sixes and Rajasthan Royals skipper Sanju Samson with 9 sixes round off the top 5 six-hitters in the tournament at the end of the second week.Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-12 10:49:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Jos-Buttler640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Like Wagah, an Indo-Pak border viewing point in Gujarat: Here’s what visitors can expect","link":"https://www.firstpost.com/sports/like-wagah-an-indo-pak-border-viewing-point-in-gujarat-heres-what-visitors-can-expect-10547951.html","keywords":["Sports"],"creator":["FP Explainers"],"video_url":null,"description":"Like Wagah, an Indo-Pak border viewing point in Gujarat: Here’s what visitors can expect","content":"Gujarat gets its version of the Wagah — an Indo-Pakistan border viewing point in Nadabet, around 188 kilometres from Ahmedabad.Union Home Minister Amit Shah inaugurated the viewing point on Sunday in Gujarat’s Banaskantha district as part of the Seema Darshan project.\"मौका देश से जुड़ने का, मौका सीमा दर्शन का\"Union Home Minister Shri @AmitShah will inaugurate Gujarat's first Indo-Pak border viewing point at #Nadabet in the #Banaskantha district today @ 9 AM#Gujarat #IndoPakBorder@HMOIndia @BSF_India @BSF_Gujarat @CMOGuj @sanghaviharsh pic.twitter.com/JJcxDCumpD— Gujarat Information (@InfoGujarat) April 10, 2022Beating Retreat ceremony and moreLocated in the Rann of Kutch, this attraction is connected by a narrow bitumen road cutting across mudflats that get inundated during high tide, according to a report in The Indian Express. Civilians will be able to view the fenced international border with Pakistan at “Zero Point”, which is guarded 24X7 by the Border Security Force (BSF). There will be a “Beating Retreat” ceremony like the one held at the Wagah-Attari border. However, there’s a difference. Unlike the border in Punjab, there won’t be soldiers present on the Pakistani side in Nadabet, ML Garg, deputy inspector general of BSF, told The Indian Express. Secondly, the parade held on the Indian side will be in the evening in an open-air auditorium that will have the capacity to seat 5,000 persons, the report says.Home Minister @AmitShah inaugurates ‘Seema Darshan Project’ at #Nadabet located on Indo-Pak border in Banaskantha District, Gujarat. This project was initiated with the aim to provide an opportunity to people so that they can visualize life and work of BSF personnel on our border pic.twitter.com/7CMDeYr5K4 — All India Radio News (@airnewsalerts) April 10, 2022// // ]]>There are other attractions for tourists to look forward to. A 30-feet high T-Junction Pillar, adorned with murals depicting the border protectors in action, is the centrepiece of the Seema Darshan Complex. Other special attractions include a “Sarhad Gatha” exhibition centre and museum. A monument, titled “Ajay Prahari” has also been erected at the site in the memory of fallen soldiers.Tourists will also be able to view weapons of the Indian Army and BSF like surface-to-surface and surface-to-air missiles, T-55 tanks, artillery guns, torpedoes, wing drop tanks, and MiG-27 aircraft.A sneak peek into the BSF lifeThe Rs 125-crore tourism project aims to offer citizens a sneak peek into the life of BSF personnel deployed at the border. “The people would get to observe their living conditions, their duties, and patriotism,” a government statement said.An interpretation centre has been set up to familiarise visitors with the life of a BSF jawan as well as the daily struggles of those living in border villages through a composition of state-of-the-art visual settings. High-tech interactive installations such as virtual patrolling, experiential technologies, and simulators are expected to be a big draw for visitors, reports The Hindustan Times.“Only when you visit Nadabet and go to the border, you will know under what difficult conditions our security force works. It will instill a feeling of patriotism among children,” Shah had said during the inauguration.Adventure sports The complex also has an arena that offers adventure sports like rock climbing, rappelling, rifle shooting, and zipline.To make the attraction tourist-friendly, there are arrival plazas, a lounge, parking facilities, an auditorium with a seating capacity of 500 people, a changing room, shops and more than 20 restaurants.Solar panels have been set up at the centre, which will take care of 30 per cent of the electricity consumed at the project.‘Boosting border tourism’The Seema Darshan project is a joint initiative by the Gujarat tourism department and the BSF Gujarat Frontier to provide an impetus to border tourism in the region.At the inauguration, Shah said that “border tourism” will help boost border security and connect citizens to BSF personnel. “The border tourism will help boost border security, increase people’s respect towards the Border Security Force (BSF) personnel and help connect people with the security forces. I am sure this project will achieve all these three goals,” Shah said.Prime Minister Narendra Modi has taken several initiatives to develop border infrastructure to enhance border security and the Seema Darshan project is one of them, he added.Shah said that apart from boosting local tourism, the project will also help “resolve the issue of migration from border villages in search of work”. Pakistan is around 150 metres from the border pillar 960 at Nadabet, reports The Indian Express.The tourism project will help provide jobs to locals. “I see a vision that after 10 years, will give employment to at least five lakh youth in Banaskantha,” Shah added.The home minister hailed the paramilitary forces. “The BSF holds several medals and carries with it stories of supreme sacrifice. The entire country takes pride in the bravery shown by the BSF,” he said.With inputs from agenciesRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-12 10:48:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/nadabetlead.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK vs RCB, Live IPL Score: Commentary, Match Preview, Full Squads, Where to watch","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/csk-vs-rcb-ipl-live-score-chennai-super-kings-royal-challengers-bangalore-today-match-dhoni-kohli/article38471924.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"RCB vs CSK, Tata IPL 2022: Get the live cricket score, updates, highlights and commentary from match between Royal Challengers Bangalore and Chennai Super Kings at the DY Patil Stadium.","content":null,"pubDate":"2022-04-12 10:45:33","full_description":"Welcome to Sportstar 's LIVE coverage of the IPL 2022 match between CSK and RCB at the DY Patil Stadium in Navi Mumbai. This is Santadeep Dey , bringing you all the action as it unfolds at the venue. CSK vs RCB LIVE COMMENTARY Stay tuned! The live coverage begins at 7:30PM IST. CSK vs RCB MATCH PREVIEW The clash between Royal Challengers and Chennai Super Kings is one of the marquee matches in the Indian Premier League. While expectations are always high, the records are lopsided in favour of the Super Kings. However, when the two sides meet here at the DY Patil Stadium on Tuesday, the Royal Challengers, led by ex CSK star Faf du Plessis, will start as firm favourites. After failing to defend a high score in the first match against Punjab Kings, RCB has done well to bounce back with a hat-trick of wins. In the last match against Mumbai Indians, the bowlers did well to take six wickets after the PowerPlay for just 29 runs, thus restricting the opponent to a modest total before Anuj Rawat and Virat Kohli chased down the target comfortably. While the team will miss the services of pacer Harshal Patel who left the bubble after the game on Saturday due to a bereavement in the family, it received a boost with pacers Josh Hazlewood and Jason Behrendorff starting training on Monday. The Super Kings, under new skipper Ravindra Jadeja, had a disastrous start to its title defence campaign with four straight losses. Their concern is the absence of effective wicket-taking bowlers, especially with the new ball, while dew has blunted its spin attack. The men in yellow also will need the likes of Ruturaj Gaikwad and Ambati Rayudu to step up sooner than later to give themselves a chance in the tournament. - S. Dipak Ragav CSK vs RCB SQUADS Chennai Super Kings: Ravindra Jadeja (c), MS Dhoni (wk), Moeen Ali, Ruturaj Gaikwad, Dwayne Bravo, Ambati Rayudu, Robin Uthappa, Deepak Chahar, KM Asif, Tushar Deshpande, KM Asif, Shivam Dube, Maheesh Theekshana, Rajvardhan Hangargekar, Samarjeet Singh, Devon Conway, Dwaine Pretorius, Mitchell Santner, Subhranshu Senapati, Adam Milne, Mukesh Choudhary, Prashant Solanki, C Hari Nishaanth, N Jagadeesan, Chris Jordan, K Bhagath Varma Royal Challengers Bangalore: Faf du Plessis (c), Anuj Rawat, Virat Kohli, Dinesh Karthik (wk), Sherfane Rutherford, Shahbaz Ahmed, David Willey, Wanindu Hasaranga, Harshal Patel, Akash Deep, Mohammed Siraj, Siddarth Kaul, Karn Sharma, Chama V Milind, Rajat Patidar, Mahipal Lomror, Finn Allen, Suyash Prabhudessai, Aneeshwar Gautam WHERE TO WATCH CSK vs RCB, IPL 2022 LIVE? All IPL 2022 matches will be broadcast on Star Sports 1 , Star Sports 1 HD , Star Sports 3 , and Star Sports 3 HD channels in India. Disney+ Hotstar is the official live streaming partner.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Deepak Chahar Ruled Out; CSK Fans Close In On Replacement: Ishant Sharma - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaXBsLTIwMjItZGVlcGFrLWNoYWhhci1ydWxlZC1vdXQtY3NrLWZhbnMtY2xvc2UtaW4tb24tcmVwbGFjZW1lbnQtaXNoYW50LXNoYXJtYS00OTY4ODE3Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Deepak Chahar Ruled Out; CSK Fans Close In On Replacement: Ishant Sharma  News18Back injury puts further question mark over Deepak Chahar's IPL return  ESPNcricinfoChennai Super Kings' Rs 14-crore signee Deepak Chahar ruled out of IPL 2022  Times of IndiaIPL 2022: Here’s The Latest Update On Deepak Chahar  The Cricket LoungeChennai Super Kings' 14 Cr Buy, Deepak Chahar Out of IPL After Back Injury  News18View Full coverage on Google News","content":null,"pubDate":"2022-04-12 10:39:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}