{"newsArray":[{"title":"‘Whichever era or format, key is to be consistent and be better player’: Former Indian cricket Syed Kirmani","link":"https://indianexpress.com/article/sports/cricket/indian-cricketer-syed-kirmani-test-matches-wicket-keeper-odi-world-cup-1983-7905009/","keywords":["Cricket","Sports"],"creator":["Nitin Sharma"],"video_url":null,"description":null,"content":null,"pubDate":"2022-05-07 00:48:19","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS vs RR Head to Head IPL record: Punjab vs RR head to head stats and records 2022 IPL","link":"https://thesportsrush.com/cricket-news-pbks-vs-rr-head-to-head-ipl-record-punjab-vs-rr-head-to-head-stats-and-records-2022-ipl/","keywords":["Cricket","IPL 2022","Punjab Kings","Rajasthan Royals","Indian Premier League","PBKS","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"PBKS vs RR Head to Head IPL record: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 52. The 52nd match of the ongoing 15th season of the Indian Premier League will be played between Punjab Kings and Rajasthan Royals at the Wankhede Stadium today. An afternoon match which holds… The post PBKS vs RR Head to Head IPL record: Punjab vs RR head to head stats and records 2022 IPL appeared first on The SportsRush.","content":"PBKS vs RR Head to Head IPL record: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 52. The 52nd match of the ongoing 15th season of the Indian Premier League will be played between Punjab Kings and Rajasthan Royals at the Wankhede Stadium today. An afternoon match which holds importance for both the teams, it will be played in the scorching heat of Mumbai on the 11th double-header day of the season. In the 10 matches that they’ve played this season thus far, Punjab are at the seventh position on the points table on the back of winning and losing five matches each. Rajasthan, on the other hand, have done quite well at winning six and losing four out of their 10 matches this season. While the only previous contest between these two teams at the Wankhede Stadium had been won by PBKS, RR would be banking on their overall head-to-head record against this opposition. An underrated rivalry which has produced a lot of riveting contest in the recent past, fans can expect another such match towards the business end of IPL 2022 league phase. Ready. Refreshed. Riyan. 🔥 #RoyalsFamily | #HallaBol | @ParagRiyan | @DettolIndia pic.twitter.com/hutajUNJTP — Rajasthan Royals (@rajasthanroyals) May 6, 2022 Speaking exclusively about this venue, Kings have won seven and lost nine out of their 16 matches here over the years. Royals, who have played 17 matches at the Wankhede Stadium, have won nine and lost on eight occasions. Total number of matches played: 23 Matches won by PBKS: 10 Matches won by RR: 13 Matches played in April: 11 (PBKS 6, RR 5) Matches played in India: 17 (PBKS 8, RR 9) Matches played at Wankhede Stadium: 1 (PBKS 1, RR 0) PBKS average score against RR: 169 RR average score against PBKS: 173 Most runs for PBKS: 237 (Mayank Agarwal) Most runs for RR: 529 (Sanju Samson) Most wickets for PBKS: 10 (Arshdeep Singh) Most wickets for RR: NA Most catches for PBKS: 5 (Mayank Agarwal) Most catches for RR: 11 (Sanju Samson) The last Punjab vs Rajasthan match is remembered for the then Rajasthan pacer Kartik Tyagi defending four runs in the last over to stage an emphatic victory at the Dubai International Cricket Stadium last year. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-05-06 19:25:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes hits FIVE sixes in a row to bring up a glorious 64-ball century for Durham","link":"https://www.dailymail.co.uk/sport/cricket/article-10789537/Ben-Stokes-hits-FIVE-sixes-row-bring-glorious-64-ball-century-Durham.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"If Ben Stokes return to cricket on Friday is a taste of things to come now he is England captain then they will soon be putting their run of Test misery behind them.","content":null,"pubDate":"2022-05-06 19:06:07","image_url":"https://i.dailymail.co.uk/1s/2022/05/06/13/57488791-0-image-a-47_1651841333086.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"CP3, Larry Fitzgerald Invest in $1 Billion Cricket Team","link":"https://www.si.com/cricket/2022/05/06/chris-paul-larry-fitzgerald-investing-in-1-billion-cricket-team-rajasthan-royals","keywords":["NBA","Breaking","Cricket","Wire","NFL"],"creator":["Wilton Jackson"],"video_url":null,"description":"The two, along with Kelvin Beachum, are taking a swing into investing with the Rajasthan Royals.","content":"Chris Paul, Larry Fitzgerald and Kelvin Beachum are investing into the Rajasthan Royals, a cricket team in the Indian Premier League. As minority investors of the franchise, which worth more than $1 billion, the trio invested through Emerging Media Ventures, which owns the Royals and is by venture capitalist Manoj Badale. The newest investments into the league’s ownership comes after a New York-based private investment firm, RedBird Capital Partners, bought a 15% stake in the Royals for nearly $37.5 million in June 2020. That addition of the firm bumped Badale’s group’s stake in the club from 51% to 65%. The trio of NBA and NFL stars are among the first American athletes to contribute to the world’s most popular cricket league. “I am excited to have become one of the first US athletes to see the value and scope for growth in the IPL,” said Paul in the team’s release. “…I see myself contributing world-class experience through this strategic investment.” Fitzgerald echoed Paul’s excitement. “India has a passionate sports culture and I’m excited to invest in one of the most sought-after teams in the country,” Fitzgerald said. Paul is no stranger to having an impact beyond the basketball court . The 12-time All-Star created an eight episode docuseries, Why Not Us , and partnered with Harvard Business School to bring an entertainment, media and sports program to North Carolina A&T and more HBCUs in the future. Rest assured that Paul, Fitzgerald and Beachum will likely not be the last group of athletes to invest in a cricket team. More Cricket Coverage:","pubDate":"2022-05-06 18:56:04","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTg5MjkxMDQ5NjkxMTI5MTg2/chris-paul-suns-nba-playoffs-lead.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Dynamos Cricket Intros returns for a second year","link":"https://www.skysports.com/cricket/news/12040/12607046/sky-sports-and-ecb-join-forces-as-dynamos-cricket-intros-returns-for-a-second-year","keywords":null,"creator":null,"video_url":null,"description":"Sky Sports and England and Wales Cricket Board (ECB) are joining forces to deliver another year of Dynamos Cricket Intros; a multi-year initiative that champions inclusion, encouraging children from more communities to take up the game of cricket.","content":"Last Updated: 06/05/22 8:19pm Sky Sports and England and Wales Cricket Board (ECB) are joining forces to deliver another year of Dynamos Cricket Intros; a multi-year initiative that champions inclusion, encouraging children from more communities to take up the game of cricket. This year, 10,000 children will be offered the chance to access the eight-week Dynamos Course for free, with sessions delivered all over the country in schools and community facilities. The Dynamos Cricket Intros scheme will also offer training to 500 new coaches with the objective of finding new inspiring role models from different communities, providing them with coaching experience and mentoring support. \"Over 100,000 kids took part in our national programmes in 2021, a record-breaking year for participation, and this was possible because of the dedicated support and investment through our Sky Sports partnership, said Nick Pryde, ECB Director of Participation and Growth. \"Through the Dynamos Cricket Intros programme, we want to inspire more children to play cricket this year and continue our commitment to make the game more inclusive and diverse.\" \"With national programmes starting this week, I'd like to thank those across the game supporting our efforts to bring cricket to more children across England and Wales. It will be an exciting summer ahead,\" he added. Jack Eatherley, Participation Lead at Sky Sports, added: \"We learnt early on in our partnership with ECB if we are to inspire more children from more communities, we need to work harder to offer access to cricket where they are living, learning and playing. \"Today is an exciting day in the calendar with Dynamos courses kicking off across the country for another year. We can't wait to see more children, regardless of gender, ability, or background picking up a bat and ball and having fun.\"","pubDate":"2022-05-06 18:46:00","image_url":"https://e1.365dm.com/22/05/1920x1080/skysports-dynamos-cricket-dynamos-cricket-intros_5762984.jpg?20220506200350","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: GT stay on top despite 2nd defeat in a row","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-points-table-orange-cap-and-purple-cap-latest-table-today-rcb-move-to-4th-with-win-over-csk-10447751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: GT stay on top despite 2nd defeat in a row","content":"IPL 2022 has in store new teams, changed squad line-ups and a different format. But that will not necessarily impact the point system.This year the format is going to be a little different, wherein the 10 teams will be split into two groups - Group A and B.Group A - Mumbai Indians, Kolkata Knight Riders, Rajasthan Royals, Delhi Capitals, Lucknow Super GiantsGroup B - Chennai Super Kings, Sunrisers Hyderabad, Royal Challengers Bangalore, Punjab Kings, Gujarat TitansNow, within the groups, each team will play each other twice, as well as twice against the team in the same row from the other group. Then each team from every group will play against all the other teams in the other group once. That brings it to a total of 14 (8 + 5 + 1) matches for all teams.On Wednesday, RCB got back to winning ways by beating CSK by 13 runs to go fourth on the points table.Here's the list of current Orange and Purple Cap holders:Orange Cap holder: Jos Buttler (RR) - 588 runsPurple Cap holder: Yuzvendra Chahal (RR) - 19 wicketsHere's the latest updated IPL 2022 league table: PositionTeamMatchesWonLostNRNet RRPoints1GT11830 +0.120162LSG10730+0.397143RR10640+0.340124RCB11650-0.444125DC10550+0.671106SRH10550+0.325107PBKS10550-0.229108KKR10460+0.06089CSK10370-0.431610MI10280-0.7254Click here to view the full Orange Cap standingsClick here to view the full Purple Cap standings Click here to read Factboxes of all teamsClick here to follow comprehensive coverage of IPL 2022Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-06 18:21:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/02/IPL-Trophy-640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights, Tata IPL 2022 GT vs MI, Full Cricket Score and Update: Daniel Sams' last-over heroics guide MI to thrilling five-run win","link":"https://www.firstpost.com/firstcricket/sports-news/highlights-tata-ipl-2022-gt-vs-mi-full-cricket-score-and-update-daniel-sams-last-over-heroics-guide-mi-to-thrilling-five-run-win-10636031.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Highlights, Tata IPL 2022 GT vs MI, Full Cricket Score and Update: Daniel Sams' last-over heroics guide MI to thrilling five-run win","content":"23:45 (IST)That brings us to the end of our coverage of the 51st match of Indian Premier League 2022, and what a thriller fans both at the Brabourne Stadium as well as those glued in front of their television sets were treated to. Mumbai Indians have now won two in two and the remaining teams will be wary of them in the remainder of the league stage. Gujarat Titans, on the other hand, are suddenly stuttering in the business end, and will hope to pick themselves up and start afresh in their next outing.That's it from us though. This is Amit signing off, wishing you all a good night, and a happy weekend ahead!23:44 (IST)Tim David is the Player of the Match for his unbeaten 44 off just 21 balls! 23:35 (IST)A familiar sight for MI fans  Celebration from Mumbai Indians was wholesome. pic.twitter.com/lNWv1cKyWN— Mufaddal Vohra (@mufaddal_vohra) May 6, 202223:33 (IST)Achievement unlockedMumbai Indians becomes the first team to defend the total against Gujarat in IPL 2022.— Johns. (@CricCrazyJohns) May 6, 202223:32 (IST)What a comeback from the Aussie! Daniel Sams conceded 35 in an over against KKR then he was out of the team. Made his comeback and played a vital role in both of MI's victories. Took 1/32 and hit 6 (1) against RR and tonight defended 8 runs against Gujarat Titans. A return to mark for him. pic.twitter.com/JrM2y3bVja— Mufaddal Vohra (@mufaddal_vohra) May 6, 202223:29 (IST)After 20 overs,Gujarat Titans 172/5 ( David Miller 19 , Rashid Khan 1)Gujarat needed nine to win off the last six balls with proven finishers David Miller and Rahul Tewatia at the crease. And yet they ended up five runs short. That's how good Daniel Sams was. Mumbai pull off a second win in a row. this one reminiscent of some of the thrilling finishes back in their glory days. And a turnaround for the Aussie left-arm seamer, who redeems himself after getting smashed all over the park by fellow Aussie Pat Cummins in the shock defeat to KKR earlier this season.23:20 (IST)IPL 2022, GT vs MI Live Score: 19.6: DOT! WHAT A FINAL OVER THAT TURNED OUT TO BE FROM DANIEL SAMS! Mumbai Indians pull off an absolute heist, and hand leaders Gujarat Titans a five-run loss to collect their second win in a row! This was a low full toss that Miller fails to connect in the end, leading to emphatic celebrations both from the MI players as well as those present at the Brabourne!23:18 (IST)IPL 2022, GT vs MI Live Score: 19.5: DOT! Swing and a miss for Miller as Sams bowls another full and wide delivery, marginally within the tramline! GT 172/5; need 6 off 123:17 (IST)IPL 2022, GT vs MI Live Score: 19.4: ONE! New batter Rashid gets a thick top-edge, with the ball falling just out of Sam’s reach! GT 172/5; need 6 off 223:16 (IST)IPL 2022, GT vs MI Live Score: 19.3: ONE, RUN OUT! Tewatia is run out while attempting to make his way back for a second, thanks to an accurate throw from wide mid on. GT 171/5; need 7 off 3Tewatia run out (Varma/Kishan) 3(4)23:13 (IST)IPL 2022, GT vs MI Live Score: 19.2: DOT! Full and wide from Sams, Tewatia fails to connect despite stretching his arms. GT 170/4; need 8 off 423:13 (IST)IPL 2022, GT vs MI Live Score: 19.1: One. Miller slashes hard, but straight to the man at deep square leg, collecting just one. GT 170/4; need 8 off 523:12 (IST)Daniel Sams to bowl the final over. We'll go ball-by-ball from here.23:11 (IST)After 19 overs,Gujarat Titans 169/4 ( David Miller 18 , Rahul Tewatia 2)IPL 2022, GT vs MI Live Score: Bumrah to bowl the crucial penultimate over. Miller drives a low full toss down the ground, dashing back for a second. Bumrah follows it up with an off-cutter, foxing Miller completely. Another slower ball in the third delivery, with Miller getting just one. Tewatia steals a quick single off the fourth, steering the ball towards backward point. SIX! Miller picks the slower ball from Bumrah and deposits it in the stands beyond midwicket! Follows it up with a single, leaving GT needing 9 to win from 6! We’re in for a thrilling finish!23:05 (IST)After 18 overs,Gujarat Titans 158/4 ( David Miller 8 , Rahul Tewatia 1)IPL 2022, GT vs MI Live Score: Meredith into his final over. FOUR! Pandya pulls hard in front of square at the start of the over to bring the equation down to 25 off 17. Leg bye off the second followed by a brace to Miller off the third. Brilliant bit of work by Kishan to run Pandya out with a direct hit at the striker’s end in the fourth. Tried-and-tested finisher Rahul Tewatia joins Miller at the centre. A single off the last two balls. GT need 20 off the last 12 with six wickets in hand. Will they cruise to a ninth win today? Or will MI steal an unlikely win from here?23:02 (IST)IPL 2022, GT vs MI Live Score: OUT! Superb work by Kishan as Hardik Pandya is run out at the striker's end while pushing for a quick single, departing after an entertaining cameo in which he collected 24 off 14. His bat is marginally on the line, but nothing beyond it as the bail is dislodged. GT 156/4Pandya run out (Kishan) 24(14)22:56 (IST)After 17 overs,Gujarat Titans 149/3 ( Hardik Pandya (C) 20 , David Miller 5)IPL 2022, GT vs MI Live Score: Bumrah returns in the slog overs. FOUR! Pandya sends the ball racing down the ground with a solid punch. Follows it up with single, bringing David Miller — playing his 100th IPL game — on strike. He gets off the mark with a streaky boundary, off an inside edge that misses the stumps. Single off each of the last two. Gujarat need 29 off 18. 22:52 (IST)After 16 overs,Gujarat Titans 138/3 ( Hardik Pandya (C) 14 , David Miller 0)IPL 2022, GT vs MI Live Score: SIX! Sai Sudharsan takes a couple of steps down the track and clobbers the ball over long on to collect his first six of the evening! Single off the fourth and fifth deliveries before Sai Sudharsan’s innings comes to a bizarre end, as he is dismissed hit wicket off Pollard’s bowling. Eight runs and a wicket from the over, leaving Gujarat needing another 40 off 24. 22:49 (IST)IPL 2022, GT vs MI Live Score: OUT! Bizarre end to Sai Sudharsan's innings as he ends up hitting the stumps with his own bat while looking to hook a short ball from Pollard — resulting in the first hit-wicket dismissal this season! Timely wicket for MI that keeps their chances in this match alive, and it comes at the stroke of the second timeout. GT 138/3Sai Sudharsan hit wicket b Pollard 14(11)22:43 (IST)After 15 overs,Gujarat Titans 130/2 ( Hardik Pandya (C) 13 , Sai Sudharsan 7)IPL 2022, GT vs MI Live Score: Kartikeya brought back. Three singles conceded in the first four balls. Hardik then pulls firmly in front of square, picking out the vacant cow corner region to collect his second boundary. Collects a brace off the last ball. Nine off the over. GT need 48 off 30 with eight wickets in hand. 22:39 (IST)After 14 overs,Gujarat Titans 121/2 ( Hardik Pandya (C) 6 , Sai Sudharsan 5)IPL 2022, GT vs MI Live Score: Meredith returns with the pressure suddenly on the Titans after the double strike by Ashwin in the previous over. Both Sai Sudharsan and skipper Hardik collect a boundary each off the Aussie, with 10 runs coming being added to the GT total. Gujarat need another 57 off 36.22:29 (IST)After 12 overs,Gujarat Titans 106/0 ( Wriddhiman Saha (W) 52 , Shubman Gill 52)IPL 2022, GT vs MI Live Score: Gill brings up his half-century not too long after his opening partner, collecting a single off the second ball to bring up the milestone for the third time this season. Tidy start for Kieron Pollard, who replaces Murugan Ashwin, with six coming off the over. GT need 72 off 48. 22:27 (IST)IPL 2022, GT vs MI Live Score: And now Shubman Gill also brings up his half-century with a single — his third of the season and his 13th overall in the league! Brings up the milestone in 33 deliveries. GT 102/022:25 (IST)After 11 overs,Gujarat Titans 100/0 ( Wriddhiman Saha (W) 50 , Shubman Gill 49)IPL 2022, GT vs MI Live Score: Tidy over from Meredith, with Gill and Saha content in collecting singles at this stage. Saha brings up his second half-century of the season and also brings up the century stand with a single off the last ball, taking 34 balls to reach the milestone. Gill, meanwhile, is one short of his half-century at the end of this over.22:23 (IST)IPL 2022, GT vs MI Live Score: FIFTY FOR WRIDDHIMAN SAHA! The GT keeper-batter brings up the milestone in 34 balls for the second time this season, and the 10th time overall in the IPL! Also brings up the century opening stand in the process, collecting a single off the last ball of the 11th over. GT 100/022:19 (IST)After 10 overs,Gujarat Titans 95/0 ( Wriddhiman Saha (W) 47 , Shubman Gill 47)IPL 2022, GT vs MI Live Score: Single to Saha at the start of Ashwin’s third over. Ashwin then bowls one short and wide two balls later, which Gill ends up crunching in front of square as the ball beats the diving extra cover and runs away for a boundary. Single off each of the next two followed by a dot. GT 95/0 at the 10-over mark, two less than what MI had managed at the same stage. They need another 83 off 60. 22:15 (IST)After 9 overs,Gujarat Titans 88/0 ( Wriddhiman Saha (W) 45 , Shubman Gill 42)IPL 2022, GT vs MI Live Score: A fourth boundary in as many deliveries for Gujarat as Saha drives the ball through the cover region at the start of Kartikeya’s second over, and gets off strike with a single off the second. Gill piles further misery on the left-arm spinner with a six and a four in the last three balls. 15 off the over. GT need 90 off 66.22:12 (IST)After 8 overs,Gujarat Titans 73/0 ( Wriddhiman Saha (W) 40 , Shubman Gill 32)IPL 2022, GT vs MI Live Score: Sams returns. Gill nearly perishes in the first delivery, attempting to go big towards the midwicket fence only for the ball to land just short of the diving substitute fielder Ramandeep. Sams gives away just two singles in the first three balls, but ends up conceding a hat-trick of fours off the next three, one of which is the result of a misfield at cow corner. 14 off the over, with Gujarat running away with the game at the moment. They need 105 more to win off 72. 22:08 (IST)After 7 overs,Gujarat Titans 59/0 ( Wriddhiman Saha (W) 39 , Shubman Gill 19)IPL 2022, GT vs MI Live Score: Kumar Kartikeya introduced on the other side of the timeout, and he starts off on a tidy note, conceding just five singles. GT collect 59 in seven overs, 15 less than what Mumbai managed at the same stage.22:05 (IST)After 6 overs,Gujarat Titans 54/0 ( Wriddhiman Saha (W) 37 , Shubman Gill 16)IPL 2022, GT vs MI Live Score: Ashwin from a different end now. SIX! Gill decides he’s waited enough, and brings out the slog sweep in the first ball of the over. Drills the ball past mid off two balls later to bring up the fifty stand with Saha. Single off each of the last three balls, with 13 coming off the over. Umpire signals timeout. Gujarat, meanwhile, need another 124 to win off 84. 22:00 (IST)IPL 2022, GT vs MI Live Score: FOUR! Shubman Gill shuffles down the track and drills the ball past mid off to bring up the fifty opening stand with Saha! GT 51/021:58 (IST)After 5 overs,Gujarat Titans 41/0 ( Wriddhiman Saha (W) 36 , Shubman Gill 4)IPL 2022, GT vs MI Live Score: Bumrah returns. Keeps things tight in the first four balls, giving away just two runs before Saha brings out a short-arm pull to a bouncer that sends the ball flying over the backward square leg fence. Bumrah responds with a yorker, which deflects off Saha’s bat and runs away to fine leg for a four. Bumrah thinks that hit Saha’s pad first, and convinces Rohit to take this upstairs, only for MI to burn a review. 12 off the over. It’s been a Saha show all the way so far!21:52 (IST)After 4 overs,Gujarat Titans 29/0 ( Wriddhiman Saha (W) 25 , Shubman Gill 3)IPL 2022, GT vs MI Live Score: A fourth bowler introduced in as many overs in the Gujarat innings with Riley Meredith replacing Jasprit Bumrah. The Aussie seamer starts off with a wide down the leg side to Saha, and follows it up with back-to-back dots. Boundary to Saha in the fourth, a streaky one at that as the ball flies off the toe end and lands just short of the boundary rope at third man. Saha though, is in firm control two balls later as he heaves a length ball from Meredith towards the midwicket fence to collect two fours in three balls. He keeps the strike with a single off the last ball, with 10 off the over.21:46 (IST)After 3 overs,Gujarat Titans 19/0 ( Wriddhiman Saha (W) 16 , Shubman Gill 3)IPL 2022, GT vs MI Live Score: Spin introduced as early as the third over as Murugan Ashwin, replacing Sams, concedes just two singles and a brace, getting off to a tidy start. Shubman Gill is off the mark in this over.21:45 (IST)After 2 overs,Gujarat Titans 15/0 ( Wriddhiman Saha (W) 15 , Shubman Gill 0)IPL 2022, GT vs MI Live Score: Jasprit Bumrah bowls from the other end, and unlike Sams, he’s off to an expensive start as Saha collects a four off the first and last balls of the over, while tonking the ball over the midwicket fence in the fourth delivery to collect the first maximum of the innings.21:42 (IST)After 1 over,Gujarat Titans 1/0 ( Wriddhiman Saha (W) 1 , Shubman Gill 0)IPL 2022, GT vs MI Live Score: Excellent start from Daniel Sams as he gives away just one off the first over, mixing his length well early on. Saha collects a single off the penultimate delivery to open his team’s account.21:41 (IST)Wriddhiman Saha and Shubman Gill walk out to begin Gujarat Titans' chase of the 178-run target, with Daniel Sams set to bowl the first over of the innings.21:24 (IST)Given their contrasting runs this season, makes absolute sense  Stunning innings by Tim David. If he hadn't already done enough, I think it's now time for him to come above Kieron Pollard in the batting order. #MIvGT— Saurabh Somani (@saurabh_42) May 6, 202221:22 (IST)After 20 overs,Mumbai Indians 177/6 ( Tim David 44 , Murugan Ashwin 0)IPL 2022, GT vs MI Live Score: Shami bowls out the final over. David turns down a single in each of the first two deliveries, and shows why as he lofts a full delivery outside off over the wide long off fence for a maximum. A couple of dots and a wide follow before David signs off with a maximum, clobbering the ball over midwicket. 13 off the final over, with David finishing unbeaten on 44 off just 21. Mumbai Indians finish on 177/6 after being put in to bat by the Gujarat Titans. Don't go anywhere, we'll be back with Gujarat's chase in just a few minutes.21:17 (IST)After 19 overs,Mumbai Indians 164/6 ( Tim David 32 , Murugan Ashwin 0)IPL 2022, GT vs MI Live Score: Ferguson bowls the penultimate over. Deceives Varma with a slower ball that nearly gets him caught-behind. Varma then responds with a fine straight drive as the Kiwi pacer decides to ramp up the pace. Varma though, is caught short of the non-striker’s end while pushing for a risky thanks to a direct hit by Pandya from mid off. It was however a full toss above waist that was delivered to Varma, and thus the umpire signals a no-ball, with David smacking the ball over long for a six in the free-hit. Takes a single off the fourth. Ferguson dismisses Sams off his last ball of the evening, with Rashid collecting his third catch of the evening. 12 runs and two wickets from the over. One more over to go.21:16 (IST)IPL 2022, GT vs MI Live Score: OUT! Third catch of the evening for Rashid in addition to the two wickets against his name as Daniel Sams perishes for a golden duck! Ferguson signs off with a wicket off his last ball of the evening. MI 164/6Sams c Khan b Ferguson 0(1)21:11 (IST)IPL 2022, GT vs MI Live Score: OUT! Varma's run out at the non-striker's end while attempting to collect a risky single. Terrific throw by Pandya from mid off. MI 156/5Tilak Varma run out (Pandya) 21(16)21:08 (IST)After 18 overs,Mumbai Indians 152/4 ( Tilak Varma 17 , Tim David 25)IPL 2022, GT vs MI Live Score: SIX! In the slot for David in the second delivery, and he absolutely smokes this over the bowler’s head, almost hitting one of the glass panes at the Pavilion End. David and Varma rotate the strike between themselves with a single coming off each of the remaining four balls. Two overs to go.21:03 (IST)After 17 overs,Mumbai Indians 142/4 ( Tilak Varma 15 , Tim David 17)IPL 2022, GT vs MI Live Score: Tilak Varma and David see out Rashid Khan’s final over, collecting the ones and twos to keep the scoreboard ticking, with eight coming off it. Rashid signs off with 2/24 from his quota, also contributing on the field with two catches so far. Another three overs to go. Can Mumbai get past 180 from here?20:59 (IST)After 16 overs,Mumbai Indians 134/4 ( Tilak Varma 9 , Tim David 15)IPL 2022, GT vs MI Live Score: Shami returns. David, meanwhile, wastes little time bringing out the attacking shots as he collects back-to-back boundaries in the second and third deliveries, before collecting a hat-trick of doubles. 14 off the over, a much-needed one from Mumbai’s perspective after the slowdown in the middle overs.20:55 (IST)After 15 overs,Mumbai Indians 120/4 ( Tilak Varma 9 , Tim David 1)IPL 2022, GT vs MI Live Score: Pollard’s struggles continue as Rashid continues to build pressure on the West Indian with four consecutive dots, before foxing him with a ripper of a delivery in the fifth that brings his innings to an end. New batter Tim David collects a single off the last ball to prevent the over from going as a wicket-maiden.20:51 (IST)IPL 2022, GT vs MI Live Score: BOWLED! A poor innings from Pollard comes to an end as the veteran all-rounder gets foxed by a ripper from Rashid, who collects his second wicket of the evening! He departs after scoring just four runs at a strike rate less than 30. MI 119/4Pollard b Khan 4(14)20:45 (IST)After 14 overs,Mumbai Indians 119/3 ( Tilak Varma 9 , Kieron Pollard 4)IPL 2022, GT vs MI Live Score: Ferguson replaces Joseph. Another LBW appeal against Pollard, this time the ball hitting Pollard below the knee roll though the umpire still shakes his head — looked to be going down leg anyway. Superb over from Ferguson with just three coming off it. Pollard simply isn’t able to accelerate at the moment and is adding to the pressure on Mumbai, who were looking set for a total in the range of 200, but will only make it past 170 at this rate.20:41 (IST)After 13 overs,Mumbai Indians 116/3 ( Tilak Varma 9 , Kieron Pollard 1)IPL 2022, GT vs MI Live Score: Good over from Sangwan with just five coming off it, including a leg bye in the second ball after an LBW appeal against new batter Pollard that is turned down by the umpire for height, as well as a wide in the fourth ball.20:38 (IST)After 12 overs,Mumbai Indians 111/3 ( Tilak Varma 7 , Kieron Pollard 0)IPL 2022, GT vs MI Live Score: Joseph returns after an expensive spell in the powerplay. And Ishan welcomes him back into the attack with a lovely cover drive that fetches him his fifth four. The West Indian though, keeps things tight in the remainder of the over before removing Kishan in the final ball. Six runs and a wicket of Joseph’s third over.Gujarat Titans vs Mumbai Indians Live update - Tata IPL 2022 GT vs MI cricket score, 51st IPL Match Live Coverage: WHAT A FINAL OVER FROM DANIEL SAMS! Mumbai Indians pull off a heist, and hand leaders Gujarat Titans a five-run loss to collect their second win in a row!Gujarat Titans will take on the Mumbai Indians in Match 51 of IPL 2022 at the Brabourne Stadium in Mumbai. The Hardik Pandya-led Gujarat lost their second game of the season when they went down Punjab Kings in the last match, but they are still topping the points table with 8 wins in 10 matches.Mumbai Indians, on the other hand, notched up their first win of the season against the Rajasthan Royals and they could now be looking to give a longer rope to a few of the young players tried out in the playing XI. They will also be looking at making Tim David the finisher – a role Kieron Pollard was carrying out for the last 10-11 years. Hrithik Shokeen and Kumar Karthikeya were good inclusions as well.When will the Gujarat Titans and Mumbai Indians match be played?The GT vs MI IPL 2022 match will take place on 6 May.Where will the Gujarat Titans and Mumbai Indians match be held?The GT vs MI IPL 2022 match will be held at Brabourne Stadium in Mumbai.What time will the Gujarat Titans and Mumbai Indians match start?The GT vs MI IPL 2022 match will begin from 7.30 pm onwards. The toss will be held at 7 pm on the same day.Where can you watch GT vs MI IPL 2022 match on TV and online?The GT vs MI IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the GT vs MI IPL 2022 match.Complete SquadsGujarat Titans: Rashid Khan, Hardik Pandya (captain), Shubman Gill, Lockie Ferguson, Mohammed Shami, Abhinav Manohar, Rahul Tewatia, Noor Ahmed, Sai Kishore, Vijay Shankar, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Pradeep Sangwan, Alzarri Joseph, David Miller, Matthew Wade, Wriddhiman Saha, Varun Aaron, B Sai SudharshanMumbai Indians: Ishan Kishan, Rohit Sharma (captain), Kieron Pollard, Jasprit Bumrah, Suryakumar Yadav, Tim David, Jaydev Unadkat, Tymal Mills, Jofra Archer (injured), Riley Meredith, Daniel Sams, Fabian Allen, Mayank Markande, Murugan Ashwin, Basil Thampi, Anmolpreet Singh, Dewald Brevis, Tilak Varma, Aryan Juyal, Arjun Tendulkar, Ramandeep Singh, Rahul Buddhi, Hrithik Shokeen, Sanjay Yadav, Arshad KhanRead all the Latest News, Trending News, Cricket News, IPL Live Score Update, Latest IPL Schedule 2022 and IPL 2022 Points table, Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-06 18:18:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Hardik-Pandya-Rohit-Sharma-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Hit wicket in cricket meaning: Sai Sudharsan gets out hit wicket to Kieron Pollard during GT vs MI IPL 2022 match","link":"https://thesportsrush.com/cricket-news-hit-wicket-in-cricket-meaning-sai-sudharsan-gets-out-hit-wicket-to-kieron-pollard-during-gt-vs-mi-ipl-2022-match/","keywords":["Cricket","Gujarat Titans","IPL 2022","Mumbai Indians","GT","Hit wicket","Indian Premier League","IPL","MI","Sai Sudharsan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hit wicket in cricket meaning: The Gujarat Titans batter Sai Sudharsan was victim to one of the most cruel mode of dismissal in the game. During the 51st match of the ongoing 15th season of the Indian Premier League at the Brabourne Stadium in Mumbai, Gujarat Titans (GT) Southpaw batter Sai Sudharsan had to head… The post Hit wicket in cricket meaning: Sai Sudharsan gets out hit wicket to Kieron Pollard during GT vs MI IPL 2022 match appeared first on The SportsRush.","content":"Hit wicket in cricket meaning: The Gujarat Titans batter Sai Sudharsan was victim to one of the most cruel mode of dismissal in the game. During the 51st match of the ongoing 15th season of the Indian Premier League at the Brabourne Stadium in Mumbai, Gujarat Titans (GT) Southpaw batter Sai Sudharsan had to head back towards the pavilion courtesy of him getting Out Hit Wicket against the Mumbai Indians (MI). It all happened on the last delivery of the 16th Over being bowled by Kieron Pollard, while GT were en route to the target of 178 runs handed by the MI. Known for taking the pace off his deliveries via the off-cutters, Pollard, while bowling one, banged the ball short outside the off-stump of the left-handed Sudharsan. In his bid to pull the delivery with all his might, the 20-year-old went through with his short too early, as all he could manage was to swing his bat into thin air. However, in the process he got one of his hand off the grip with his body going off-balance and the bat ultimately hitting the stumps. pic.twitter.com/bNYJDcY10q — Jemi_forlife (@jemi_forlife) May 6, 2022 The aforementioned mode of dismissal in Cricket is known as the Hit Wicket. While it was Sai’s bat that had caused the dismissal, a batter is Out in a similar manner even if any other part of his body had broken the stumps while the ball was in play. There are in fact, many unfortunate ways with which a batter can be ruled Out as Hit Wicket. As per the MCC’s law 35.1.1, the striker is out Hit wicket if, after the bowler has entered the delivery stride and while the ball is in play, his/her wicket is put down by either the striker’s bat or person as described in Laws 29.1.1.2 to 29.1.1.4 (Wicket put down) in any of the following circumstances: 35.1.1.1 in the course of any action taken by him/her in preparing to receive or in receiving a delivery, 35.1.1.2 in setting off for the first run immediately after playing or playing at the ball, 35.1.1.3 if no attempt is made to play the ball, in setting off for the first run, providing that in the opinion of the umpire this is immediately after the striker has had the opportunity of playing the ball, 35.1.1.4 in lawfully making a second or further stroke for the purpose of guarding his/her wicket within the provisions of Law 34.3 (Ball lawfully struck more than once).","pubDate":"2022-05-06 17:52:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Figc, ecco le licenze UEFA per 17 club di Serie A per il 2022/23: c’è il Milan","link":"https://www.milannews24.com/figc-ecco-le-licenze-uefa-per-17-club-di-serie-a-per-il-2022-23-ce-il-milan/","keywords":["News","ZOnefootball"],"creator":["Davide Lusinga"],"video_url":null,"description":"FIGC, sono state rilasciate le licenze UEFA per 17 club di Serie A per la stagione sportiva 2022/23: c’è il Milan La Commissione di primo grado delle Licenze UEFA, in data 6 maggio 2022, esaminata la documentazione pervenuta nell’ambito del processo per il rilascio della Licenza UEFA per la stagione sportiva 2022/2023, visto il Manuale delle […] The post Figc, ecco le licenze UEFA per 17 club di Serie A per il 2022/23: c’è il Milan appeared first on Milan News 24.","content":"FIGC, sono state rilasciate le licenze UEFA per 17 club di Serie A per la stagione sportiva 2022/23: c’è il Milan La Commissione di primo grado delle Licenze UEFA, in data 6 maggio 2022, esaminata la documentazione pervenuta nell’ambito del processo per il rilascio della Licenza UEFA per la stagione sportiva 2022/2023, visto il Manuale delle Licenze UEFA – Edizione 2020, preso atto delle relazioni degli esperti, ha deliberato di rilasciare la Licenza UEFA alle seguenti società: CLUB MASCHILI: SERIE A Atalanta Bergamasca Calcio S.p.A. (Gewiss Stadium di Bergamo)Bologna F.C. 1909 S.p.A. (Stadio Renato Dall’Ara di Bologna)Cagliari Calcio S.p.A. (Stadio Friuli/Dacia Arena di Udine)A.C.F. Fiorentina S.r.l. (Stadio Artemio Franchi di Firenze)Genoa Cricket and F.C. S.p.A. ((Stadio Luigi Ferraris di GenovaF.C. Internazionale Milano S.p.A. (Stadio Giuseppe Meazza di Milano)Juventus F.C. S.p.A. (Allianz Stadium di Torino)S.S. Lazio S.p.A. (Stadio Olimpico di Roma)A.C. Milan S.p.A. (Stadio Giuseppe Meazza di Milano)S.S.C. Napoli S.p.A. (Stadio Diego Armando Maradona di Napoli)A.S. Roma S.p.A. (Stadio Olimpico di Roma)U.C. Sampdoria S.p.A. (Stadio Luigi Ferraris di Genova)U.S. Sassuolo Calcio S.r.l. (Mapei Stadium di Reggio Emilia)Spezia Calcio S.r.l. ((Stadio Friuli/Dacia Arena di Udine)Torino F.C. S.p.A. (Stadio Olimpico Grande Torino di Torino)Udinese Calcio S.p.A. (Stadio Friuli / Dacia Arena di Udine)Hellas Verona F.C. S.p.A. (Stadio Marcantonio Bentegodi di Verona) SERIE B Parma Calcio 1913 S.r.l. (Stadio Ennio Tardini di Parma) CLUB FEMMINILI  A.C.F. Fiorentina S.r.l. (Stadio Artemio Franchi di Firenze)F.C. Internazionale Milano S.p.A. (Stadio Giuseppe Meazza di Milano)Juventus F.C. S.p.A. (Allianz Stadium di Torino)S.S. Lazio Women 2015 a R.L. (Stadio Mirko Fersini di Formello)A.C. Milan S.p.A. (Stadio Giuseppe Meazza di Milano)A.S. Roma S.p.A. (Stadio Olimpico di Roma)U.C. Sampdoria S.p.A. (Stadio Luigi Ferraris di Genova)U.S. Sassuolo Calcio S.r.l. (Mapei Stadium di Reggio Emilia) The post Figc, ecco le licenze UEFA per 17 club di Serie A per il 2022/23: c’è il Milan appeared first on Milan News 24.","pubDate":"2022-05-06 17:00:00","image_url":null,"source_id":"milannews24","country":["italy"],"category":["sports"],"language":"italian"},{"title":"WATCH: Ben Stokes smashes 5 sixes, 1 four in single over, finishes with 161 off 88 on return to County cricket","link":"https://zeenews.india.com/cricket/watch-ben-stokes-smashes-5-sixes-1-four-in-single-over-finishes-with-161-off-88-on-return-to-county-cricket-2460903.html","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes smashed spinner Josh Baker for a whopping 6,6,6,6,6,4 in a single over","content":"England's new Test Captain and Durham all-rounder Ben Stokes on Friday (May 6), smashed an innings 161 off just 88 balls with a record-breaking 17 sixes in a single county cricket innings. By doing so, Stokes crossed Australia's Andrew Symonds's record, who representated Gloucestershire and smacked Glamorgan for 16 sixes back in the year 1995. Other than Symonds, Graham Napier of Essex county had hit Surrey for 16 sixes in a single county cricket innings in 2011. He accomplished this feat during his side's match against Worcestershire in the County Championship Division Two 2022 at New Road in Worcester. This memorable knock by the Englishman also included an onslaught in the 117th over of the game, in which he smashed spinner Josh Baker for a whopping 6,6,6,6,6,4 in a single over. Checkout the 34 runs over here... Ben Stokes has just hit a 64 ball 100 including a 34 over. Ridiculous batting @DurhamCricket pic.twitter.com/p0zQnXAasu — Oddschanger (@Oddschanger) May 6, 2022 This fast-tracked Stokes from 70 (59) to 100 (64). The all-rounder was finally dismissed by Worcestershire captain and spinner Brett D`Oliveira. His 88-ball 161 at the end included 8 fours and 17 sixes. At the innings break, Durham stands at 580/6 declared in 128 overs, with Ned Eckersley and Liam Trevaskis unbeaten at 0. For Durham, Sean Dickson (104), Keegan Petersen (50), captain Scott Borthwick (89), David Bedingham (135) also played some brilliant knocks. Pacer Ben Gibbon was the pick of the bowlers for Worcestershire, getting 2/94 in 25 overs, with four of them maidens. Notably, England Cricket Board in April announced the appointment of all-rounder Ben Stokes as the men's Test team captain. Stokes succeeded Joe Root in becoming the 81st captain of the England men's Test team. Brief Scores: Durham 580/6 declared (Ben Stokes 161, David Bedingham, Ben Gibbon 2/94) vs Worcestershire. With ANI inputs","pubDate":"2022-05-06 17:00:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Once Again, Churchill Downs Will Ignore The Racist Ties To ‘My Old Kentucky Home’","link":"https://www.si.com/horse-racing/2022/05/06/once-again-churchill-downs-will-ignore-the-racist-ties-to-my-old-kentucky-home","keywords":["Horse Racing","HP Feature","News And Analysis"],"creator":["Pat Forde"],"video_url":null,"description":"The controversy behind Kentucky’s state song is again being brought to light, this time from a member of one of the most prominent families in Louisville history.","content":"LOUISVILLE, Ky.—Emily Bingham picked the lunch spot for our interview, and let’s just say the choice of restaurant was smart and shrewd on her part. We slid into a booth at Wagner’s Pharmacy, a century-old place in Louisville’s South End that has transitioned over the years into a no-frills diner and gift shop. It is located across the street from Churchill Downs, feeding horsemen and racing fans soup and sandwiches and eggs and bacon. The place is a shrine to the sport, and to the Kentucky Derby specifically. This was the perfect—and perfectly cheeky—location to discuss Bingham’s new book, My Old Kentucky Home: The Astonishing Life and Reckoning of an Iconic American Song . It is an unflinching, brilliantly written study of the song that is synonymous with the Derby—the one that will bring as many as 150,000 horse racing fans to their feet at Churchill on Saturday, many with tears in their eyes, as they boozily sing along to Stephen Foster’s 1853 tune. How many of those 150,000 know that “My Old Kentucky Home” is steeped in racism? Whitewashed and inauthentically presented as Southern sentimentalism? Packaged as a paean to soft-edged nostalgia, when in reality its lyrics tell a tale of a slave being taken from his family and sold downriver to die on a sugarcane plantation? It's not just that racist terms for Black people had to be changed to “people” in the latter half of the 20th century, in varying stages by various institutions, to make the singing more palatable. It’s not just the second and third verses, rarely sung, that paint an increasingly bleak picture of a displaced slave’s existence. It’s more than that. It’s everything else that the song became: a mainstay of minstrel shows produced and performed by white people in blackface, a symbol of the romanticized “Lost Cause” version of the Confederacy, a one-size-fits-all prop for patriotism, and the underpinning of a Kentucky state park and tourist attraction based almost entirely on fraudulent narrative. Despite the song’s controversial lyrics, Churchill Downs continues to have it be part of its Kentucky Derby pageantry. Jamie Rhodes/USA TODAY Sports Read Bingham’s book, and some Derby goers may never stand and sing “My Old Kentucky Home” again. The 58-year-old Louisville native, historian, author and lecturer at Bellarmine University certainly won’t. “I don’t believe it can be wrong to love a song, but I do believe we commit wrongs when we do not understand what we claim to love,” she wrote. “Refusing to look closely at uncomfortable aspects of history has hurt this nation and may be its undoing. … Nearly 170 years ago, Foster copyrighted Black loss for white pleasure, comfort, and distraction. Over time, American society erected ‘My Old Kentucky Home’ as a sonic monument—impressive, opaque, and also contested—to white feeling and white forgetting, to a nation’s own segregated memory.” That is the largely ignored baggage weighing upon the official Kentucky state song, and its inextricable tie to the state’s signature cultural/sporting event. The fact that is being brought to our attention by a woman with the last name “Bingham” adds another layer of resonance. “I don’t believe it can be wrong to love a song, but I do believe we commit wrongs when we do not understand what we claim to love.” — Emily Bingham The Binghams are one of the most prominent families in Louisville history. Three generations of Binghams ran a local media empire, with controlling ownership of The Courier-Journal and The Louisville Times newspapers, two radio stations and a TV station. The quality of the journalism and the civic pride in those media outlets were both high. (Disclosure: I worked for The Courier-Journal for 17 years, but did not start there until after the Binghams sold the paper to Gannett.) The media empire was dissolved in the 1980s, but the family name still carries cachet locally. For a scion of one Louisville institution to take on another Louisville institution (Churchill Downs and the Derby) is an eyebrow raiser. But it’s in line with the Bingham family’s progressive newspapering, and with a years-long inability to reconcile Kentucky’s continued embrace of a song about a terrible period in U.S. history. “In South Africa they don’t sing songs about apartheid before a cricket game,” Bingham says. “In Germany they don’t sing songs about the Holocaust before a soccer match. How did it come to have this kind of weight in our sport and our state?” The answer is a progressive layering of falsehoods, sidesteps, rationalizations and capitulations to capitalism. Foster, considered by many to be the father of American pop music but struggling badly to make a living at the time, produced a catchy melody and wrote lyrics derived from the novel, Uncle Tom’s Cabin . The song became a fixture of traveling minstrel shows, wherein white actors performed demeaning Black stereotypes that somehow were hailed as “authentic” depictions. After the Civil War, part of the false interpretation and marketing of the song was the notion that slaves were happy in their station and grateful to their benevolent white owners. Thus, in the repurposing of Foster’s song, the slave sold downriver missed his carefree existence in Kentucky. This was an element of the post-Reconstruction softening of what the Confederacy was and what it stood for, part of redirecting memory toward the “Lost Cause” and away from the reality of America’s Original Sin. Later in the country’s history, the song was expropriated altogether as white Old South experience. Idyllic plantation life was the presumptive backdrop, which gained traction in part thanks to the extraordinary creative license taken with My Old Kentucky Home State Park in Bardstown, Ky. The tourist attraction once sold the demonstrably false story line that Foster wrote “My Old Kentucky Home” there at the restored Federal Hill mansion, where it’s more likely the Pittsburgh native spent no more than a few hours of his adult life in the state, and that stopover was 50 miles away in Louisville. Amid all the misunderstanding and misrepresentation, Bingham’s goal is to put a light of truth on what the song was. She wants readers to understand how it is part of a cultural patchwork that has deeply troubled Blacks—and Black Kentuckians, specifically. “What I would love this book to do is to take something that is in so many people’s hearts, that they have positive feelings about, and understand that those feelings are just the tip of a systemic iceberg of things we don’t realize that have been contributing—over years, over generations—to a continuation of inequity,” she says. “This is a microcosmic example of one song being systematized and put on a pedestal in a way we enshrine something that’s hurtful and a story that doesn’t tell us who we are. We have to keep peeling those layers back. We have to acknowledge things that have happened.” Emily Bingham’s book studies the song that is synonymous with the Kentucky Derby: ‘My Old Kentucky Home.’ Courtesy of Emily Bingham Circling back to the Kentucky Derby: Matt Winn, the irrepressible marketer who helped turn Churchill into a cathedral of American sport, first linked the Derby and “My Old Kentucky Home” in a powerful partnership in 1931. The song was nearly 80 years old then, but it gained fresh currency as the Derby became one of the signature sporting events of spring. Since then, the bonds between horse race and song have deepened. In 2020 in the immediate aftermath of the murder of George Floyd and in a city torn asunder after the death of Breonna Taylor, the Kentucky Derby was postponed to Labor Day weekend by the coronavirus pandemic. Given the context of the time, Bingham was hopeful Churchill Downs would choose that moment to not play “My Old Kentucky Home” before the Derby. The racetrack chose a different path—keeping the song but having it played by a bugler in front of a near-empty grandstand, with virtually no one there to sing the troubling lyrics. Churchill has made several public efforts to promote greater diversity and inclusion in horse racing. It wasn’t always in need of improvement in that area—the sport was dominated by Black jockeys in the late 1800s, when the Derby was in its early years. But today, Black participation is scant. Among the initiatives was an announcement this week that Churchill and the Kentucky government are partnering with the Ed Brown Society, which promotes opportunities for people of color to participate in the racing industry through jobs and internships. The financial commitment is a tangible step, but don’t expect it to be accompanied by a symbolic disassociation with “My Old Kentucky Home.” “It’s the state song,” Churchill Downs Incorporated CEO Bill Carstanjen says. “It has been for over 100 years. It’s overwhelmingly supported by our fans. It’s part of the tradition, part of the fabric of the event. We plan to continue playing it with our signature event.” Emily Bingham isn’t attending this year’s race in person, opting instead to watch at home with her 10-year-old niece. She will not be standing when “My Old Kentucky Home” is played.","pubDate":"2022-05-06 16:33:33","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTg5MjkyMzM1NzY1Mzk4ODgy/usatsi_10045158.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"IPL 2022: 'Pollard ka replacement tayyar hai', Twitter lauds Tim David's blistering knock against GT","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-pollard-ka-replacement-tayyar-hai-twitter-lauds-tim-davids-blistering-knock-against-gt-10641401.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: 'Pollard ka replacement tayyar hai', Twitter lauds Tim David's blistering knock against GT","content":"Mumbai Indians' Tim David set the Brabourne Stadium on fire as he hammered a 21-ball 44 to propel MI to 177/6 in the 51st match of IPL 2022 between MI and Gujarat Titans.Striding in at 119/4 after Kieron Pollard's dismissal, David got Mumbai back on track with a blistering knock. Mumbai had got off to a solid start as openers Rohit Sharma and Ishan Kishan added 74 from 7.3 over for the opening wicket. MI, however, lost their way as they lost regular wickets. They were struggling a bit at 119/4 in the 15th over.However, David launched a scathing attack and clobbered four sixes and two fours as he raced to 44 off 21 balls. In the process, he completed 2,000 T20 runs. He helped MI score 57 runs from the last five overs.MI had dropped David after just two matches in which he scored 12 and one. He was brought back against RR in their last match where he scored 20 not out off 9 balls.Twitter was full of praise for the big hitter as he set the stage on fire in Mumbai.Tim David got solid power and big reach.— Irfan Pathan (@IrfanPathan) May 6, 2022Early jitters but post that @timdavid8 contributed nicely- has the final laugh vs Md Shami big credit to @rashidkhan_19 with all going for runs he held back MI’s flow#GTvMI #IPL2022 — Reema Malhotra (@ReemaMalhotra8) May 6, 2022Stunning innings by Tim David.If he hadn't already done enough, I think it's now time for him to come above Kieron Pollard in the batting order. #MIvGT— Saurabh Somani (@saurabh_42) May 6, 2022Australia should pick Tim David soon in T20 team ahead of the World Cup. — Johns. (@CricCrazyJohns) May 6, 2022Tim David doesn't hit sixes, he clobbers them.Pollard ka replacement taiyaar hai MI ke pass#MIvGT— Cricket Geek (@CricketGeek007) May 6, 2022Tim David in last 2 matches: 20*(9) and 44*(21) - the new finisher of Mumbai has arrived. — Johns. (@CricCrazyJohns) May 6, 2022Terrific finish by Tim David - 44* from just 21 balls with 4 sixes. Playing to the potential, he was brilliant tonight. A gun striker of the ball. pic.twitter.com/Oa6CMgP0BF— Mufaddal Vohra (@mufaddal_vohra) May 6, 2022 Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-06 16:22:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Tim-David-vs-GT-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Stokes smashes County Championship record 17 sixes in an innings","link":"https://www.thestar.com.my/sport/cricket/2022/05/06/cricket-stokes-smashes-county-championship-record-17-sixes-in-an-innings","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Ben Stokes livened up the County Championship a week after being appointed England's new test captain when he smashed 161 off 88 balls for Durham against Worcestershire on Friday in an innings that included a record 17 sixes. Read full story","content":null,"pubDate":"2022-05-06 15:51:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/06/1576457.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-mumbai-indians-live-score-over-match-51-t20-16-20-updates-2952823","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Mumbai Indians from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-06 15:34:04","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637874678331996537.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: 6 6 6 6 6 4 — Ben Stokes goes berserk, hits 34 in an over in County Championship","link":"https://www.firstpost.com/firstcricket/sports-news/watch-6-6-6-6-6-4-ben-stokes-goes-berserk-hits-34-in-an-over-in-county-championship-10642561.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: 6 6 6 6 6 4 — Ben Stokes goes berserk, hits 34 in an over in County Championship","content":"Ben Stokes struck an impressive 60-ball ton for county side Durham against Worcestershire on Friday in his first innings since being appointed England's Test captain. Stokes was at his aggressive best as he hammered 34 runs off one over on his way to a blistering hundred.Stokes recently took over as England's new Test captain after Joe Root stepped down following a five-year reign that culminated in a string of painful defeats.Stokes deposited the first five deliveries of Josh Baker's 20th over over the boundary ropes as he raised his bat after the fifth to celebrate his century, having thumped 10 sixes in total.Stokes was one blow away from emulating West Indies great Garfield Sobers, the only batsman in Championship history to hit six sixes in an over, having done so for Nottinghamshire in 1968.But he was ultimately left thumping his pads with his bat in frustration after merely hitting a four, sparing Baker from joining ex-Glamorgan seamer Malcolm Nash in an undesirable club.Check out the video here:6️⃣ 6️⃣ 6️⃣ 6️⃣ 6️⃣ 4️⃣What. An. Over.34 from six balls for @benstokes38 as he reaches a 64 ball century 👏#LVCountyChamp pic.twitter.com/yqPod8Pchm— LV= Insurance County Championship (@CountyChamp) May 6, 2022Stokes strode out to the crease at 360/2 on Day 2 with Durham on 360-4 and launched a scathing attack. His brought up his fifty off just 47 balls and then hit the accelerator button, bringing up his second fifty off just 17. He was finally dismissed by Brett D'Oliveira for 161 off 88 balls. His innings was laced with eight fours and 17 sixes.Alex Lees (104), David Bedingham (135) and Stokes (161) hit tons as Durham posted a humongous 580/6 before declaring their first innings.With AFP inputsRead all the Latest News, Trending News, Cricket News, IPL Live Score Update, Latest IPL Schedule 2022 and IPL 2022 Points table, Entertainment News here. Follow us on Facebook, Twitter and Instagram. ","pubDate":"2022-05-06 15:25:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/ben-stokes-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"MCA Stadium pitch report LSG vs KKR IPL 2022: Lucknow vs Kolkata Maharashtra Cricket Association Stadium Pune pitch report today match","link":"https://thesportsrush.com/cricket-news-mca-stadium-pitch-report-lsg-vs-kkr-ipl-2022-lucknow-vs-kolkata-maharashtra-cricket-association-stadium-pune-pitch-report-today-match/","keywords":["Cricket","IPL 2022","KKR","Lucknow Super Giants","Indian Premier League","IPL","Kolkata Knight riders","LSG"],"creator":["Gurpreet Singh"],"video_url":null,"description":"MCA Stadium pitch report LSG vs KKR IPL 2022: The venue will host its thirteenth match of the ongoing 15th season of the league. The 53rd match of the ongoing 15th season of the Indian Premier League (IPL) will be played between the Lucknow Super Giants (LSG) and the Kolkata Knight Riders (KKR) at the… The post MCA Stadium pitch report LSG vs KKR IPL 2022: Lucknow vs Kolkata Maharashtra Cricket Association Stadium Pune pitch report today match appeared first on The SportsRush.","content":"MCA Stadium pitch report LSG vs KKR IPL 2022: The venue will host its thirteenth match of the ongoing 15th season of the league. The 53rd match of the ongoing 15th season of the Indian Premier League (IPL) will be played between the Lucknow Super Giants (LSG) and the Kolkata Knight Riders (KKR) at the MCA Stadium in Pune. With three consecutive wins in the previous matches, and a total of 7 wins across 10 matches, LSG are comfortably placed on the second spot in the points table. The KL Rahul-led side is just a couple of wins away from securing their playoffs berth in their maiden IPL season. KKR, on the other hand, having won their previous match against the Rajasthan Royals (RR) after five successive losses, just manage to stick their neck out for claiming at least the 4 th spot in the table at the end of the league stage. With 4 wins from 10 matches, they are presently placed at the 8 th spot in the table. Both LSG and KKR would play their second match at the MCA Stadium on Saturday. , … @LucknowIPL #KKRHaiTaiyaar #IPL2022 pic.twitter.com/CGAab4P5jv — KolkataKnightRiders (@KKRiders) May 6, 2022 Along expected lines, the MCA Stadium turf, courtesy of its Black soil, and with the matches being played on the used pitches from the previous encounters will yet again remain dry and abrasive. This means that the spinners would ample assistance throughout the duration of the match. Even during the previous match between CSK and RCB at this venue, MS Dhoni operated with three spinners right away after from the fifth Over itself, after bowling out his seamers within the Powerplay itself. Even the pacers have now started to bowl a lot of off-cutters, while taking the pace off their deliveries. All in all, the pitch would provide that spongy bounce which one generally observes on a pitch that grips and turns due to its slowness. Expect a total around the 160-run mark to be a defendable one post batting first.","pubDate":"2022-05-06 15:16:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ranveer Singh IPL team: Rohit Sharma cheered by Ranveer Singh cricket match Gujarat Titans vs Mumbai Indians at Brabourne Stadium","link":"https://thesportsrush.com/cricket-news-ranveer-singh-ipl-team-rohit-sharma-cheered-by-ranveer-singh-cricket-match-gujarat-titans-vs-mumbai-indians-at-brabourne-stadium/","keywords":["Cricket","Gujarat Titans","IPL 2022","Mumbai Indians","GT","Indian Premier League","MI","ranveer singh","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ranveer Singh IPL team: The ace Bollywood actor is present in the stands at the Cricket Club of India tonight. Mumbai Indians captain Rohit Sharma appears to have found some form after an elongated rough patch in the ongoing 15th season of the Indian Premier League. Sharma, 35, had scored 155 runs in nine innings… The post Ranveer Singh IPL team: Rohit Sharma cheered by Ranveer Singh cricket match Gujarat Titans vs Mumbai Indians at Brabourne Stadium appeared first on The SportsRush.","content":"Ranveer Singh IPL team: The ace Bollywood actor is present in the stands at the Cricket Club of India tonight. Mumbai Indians captain Rohit Sharma appears to have found some form after an elongated rough patch in the ongoing 15th season of the Indian Premier League. Sharma, 35, had scored 155 runs in nine innings at an average and strike rate of 17.22 and 123.01 respectively in this season before frequently hitting boundaries in their 10th IPL 2022 match against Gujarat Titans at the Brabourne Stadium. A contest between the top and bottom-ranked team at the points table was started by Gujarat captain Hardik Pandya inviting Mumbai in to bat first after winning the toss. In spite of losing nine matches this season, MI stuck with their opening pair yet again to witness Sharma calling the shots against the likes of Mohammed Shami and Alzarri Joseph. It was on the first two deliveries off the second over that Sharma hit consecutive boundaries off Joseph to become an instant source of amazement for the fans. Sharma, who hit a six on the last delivery of the same over, ramped Shami in the following over for another eye-catching six. Joseph, who had made his IPL debut for Indians back in the day, continued to leak boundaries against his former captain as Sharma hit two more fours in the fourth over. Ranveer Singh IPL team Sharma putting up a show at the Cricket Club of India earned him applause from ace actor Ranveer Singh, who is present at the venue for this match. on the pitch & ℝ in the stand! फुल मचा रहे है! #OneFamily #DilKholKe #MumbaiIndians #GTvMI @RanveerOfficial pic.twitter.com/Ug9ZCZFxY2 — Mumbai Indians (@mipaltan) May 6, 2022 , ? #GTvMI | #AavaDe pic.twitter.com/S0ceEZwSYA — Gujarat Titans (@gujarat_titans) May 6, 2022 Ranveer Singh is celebrating all Rohit shot like us, he is a big Mumbai Indians and Rohit fan pic.twitter.com/CPtvp5zfZY — Jyran (@Jyran45) May 6, 2022   The post Ranveer Singh IPL team: Rohit Sharma cheered by Ranveer Singh cricket match Gujarat Titans vs Mumbai Indians at Brabourne Stadium appeared first on The SportsRush.","pubDate":"2022-05-06 14:46:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Explained: What is Boris Becker guilty of and where will he be jailed?","link":"https://www.firstpost.com/sports/explained-what-is-boris-becker-guilty-of-and-where-will-he-be-jailed-10641841.html","keywords":["Sports"],"creator":["FP Explainers"],"video_url":null,"description":"Explained: What is Boris Becker guilty of and where will he be jailed?","content":"Boris Becker was one of the finest finds of tennis back in the 80s when he shook the tennis world by winning the coveted Wimbledon trophy at just 17. However, after over 35 years – in which he won six Grand Slams, then coached Novak Djokovic after a famous commentary stint with BBC – the retired German star will be mostly and infamously be remembered for how he messed it up off the court as he is sentenced to jail after being found guilty in his bankruptcy case in 2017.How a young Boris Becker rose to prominence Becker's meteoric rise in the tennis world dates back to 1985 when he won the Wimbledon only to retain it the next year. His exploits soon earned him the nickname ‘Boom Boom’ at the All England Club due to his fast serve and the young German only grew stronger by winning the Major on the grass for the third time in 1989. Continuing with his great form while rubbing shoulders with greats such as Ivan Lendl, and John McEnroe among others, Becker later won the US Open that year as well.French Open was the only court where he didn’t taste success (three semi-final appearances) but he did win the Australian Open twice in 1991 and 1996. His 1991 triumph in Melbourne also took him to the top of the rankings for the first time in his career.By 1996 Becker struggled to maintain his form at the top and preferred playing Australian Open and Wimbledon for the rest of his tennis career but didn’t see much success except for his last Major title in Melbourne that year. He finally called time on his career in 1999 after winning 49 singles titles and amassing a career-saving of a whopping $50 million (Rs 384 crore).Post-retirement, he became a decorated commentator with BBC before returning to the court in 2013 as World No.1 Djokovic’s coach. The duo won six Grand Slams together before parting ways in 2016.He also made headlines for his tangled private life since he retired from playing -- including a daughter conceived in a brief but now famous encounter with a Russian model at a London restaurant.When did he go bankrupt and what caused it? The German filed for bankruptcy in 2017 as he owed private bank Arbuthnot Latham around $4.6 million (Rs 35.37 crore approximately) for buying a property in Spain and defaulted on the repayment by over two years. He also urged the bank to give him a grace period of four weeks before filing a lawsuit against him as he intended to sell the property for repayment. His request, however, was denied by the bank. The failure of repayment to Arbuthnot Latham wasn’t an isolated incident of his downfall.His autobiography, released in 2003 by the title 'The Player', gave the public a peek into Becker's extravagant lifestyle that involved a string of female conquests.In fact, in 2002 a Munich court sentenced Becker to a two-year suspended prison sentence and fined him for tax evasion for an amount estimated up to £10 million (Rs 90.95 crore). This came right after the divorce with his first wife Barbara in 2001 after he was accused of infidelity following his infamous encounter with a Russian woman which made headlines in 1999 as she conceived a daughter. The divorce, and his costly lifestyle, took a serious toll on his career savings.Becker then went on to marry his long-time girlfriend and Dutch model Sharlely 'Lilly' Kerssenberg in 2010 before the marriage hit rock bottom followed by separation in 2018.What was he accused of by the prosecution?After being declared bankrupt in 2017, the prosecution alleged that Becker has been dishonest in giving details of his assets, including a failure to reveal a declaration of debt worth $866,500 (Rs 6.66 crore) and shares in a tech firm. He was also accused of concealing details of properties worth $2.3 million (Rs 17.68 crore) and the trophies he won during his tennis career.“It is the prosecution case ... that in various ways he effectively hid from, or made unavailable to, those responsible for identifying the assets,\" said prosecutor Rebecca Chalkley. “The prosecution say Mr. Becker did this both before and after the date of his bankruptcy agreement by not disclosing, not providing, or delivering up, or removing assets or things of value.”What efforts did Becker make for repayment of the huge debt? Becker made an attempt to gather funds by holding an auction that sold his trophies and kits from the playing days. The memorabilia included his 1989 US Open trophy, which was the most expensive purchase at $185,735. In all, he put 82 items for sale and it fetched him $920,000 (Rs 7.07 crore approx.). The amount was deemed futile in comparison to the debt of $4.6 million.What was he finally convicted for?Becker was convicted on four charges under the Insolvency act by the court as he was found guilty of illicitly transferring large amounts of money to other accounts and hiding assets after he was declared bankrupt. This included a transfer of a large amount from his business accounts to other accounts, including that of his ex-wife Barbara and estranged wife Lily. The jury did acquit him on 20 other counts, including concealment of trophies he won during his playing days.What will be the quantum of his incarceration and where will Becker serve it? Judge Deborah Taylor handed down a sentence of two and a half years of jail term for Becker and the German will serve half the sentence before he is eligible for parole. Becker is serving the quantum of his punishment at HMP Wandsworth Prison, which is an overcrowed category B prison in the UK and goes by the name Wanno. It is ironically located just 3.2 km from the All England Club.What awaits Becker after serving his sentence?There's no end to agony for the German tennis star as reports have emerged that he could be deported from the UK after serving his sentence as he doesn't have British citizenship.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-06 14:05:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/boris-becker-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-mumbai-indians-live-score-over-match-51-t20-1-5-updates-2952348","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Mumbai Indians from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 3.0 overs, Mumbai Indians are 29/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Mumbai Indians. Everything related to Gujarat Titans and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Mumbai Indians live score. Do check for Gujarat Titans vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 2.6 overs (1 Run) 1 run. 2.5 overs (1 Run) Outside off, on a length. Ishan opens the face of the bat and guides it to third man for a run. 2.4 overs (1 Run) Full ball on middle, it is pushed to the left of mid on for a quick single. 2.3 overs (6 Runs) SIX! Just uses the pace of the bowler! A length ball, outside off. Sharma steps across and down as he laps this over fine leg for the second maximum of the innings. 2.2 overs (0 Run) Short in length and outside off. Rohit gets on his toes as he punches this to point. 2.1 overs (1 Run) A full ball, on middle. Kishan looks to flick but gets an inside edge to deep square leg for a single. 1.6 overs (6 Runs) SIX! Rohit Sharma is already in the 5th gear mood! Tad full and slanting around off. Sharma heaves it across and small boundaries at Brabourne which means it goes all the way over deep mid-wicket for a biggie. 14 runs off the over. 1.5 overs (0 Run) A length ball from wide of the crease and around off. Rohit blocks it out. 1.4 overs (0 Run) A good shot but for no run there! Fuller ball around off. Sharma drives it hard but straight to the mid off fielder. 1.3 overs (0 Run) A length ball, on middle. Sharma nudges it to mid-wicket. 1.2 overs (4 Runs) FOUR! Edged away! A length ball, outside off, it nips back in slightly! Rohit tries to work it towards point but gets a thick outside edge to third man for a boundary. 1.1 overs (4 Runs) FOUR! First off the innings and it comes off the blade from Rohit Sharma! Good followthrough from the Hitman! A half-volley, around off. Rohit Sharma lofts it over mid off for a boundary. Who will bowl from the other end? Alzarri Joseph it is! 0.6 over (1 Run) Single to end the over! Sprays it around middle and leg. Rohit tucks it in front of square on the leg side for a single. 0.5 over (0 Run) Dot ball! A length ball, around off. Sharma defends it off the inner half and to mid-wicket. Tight lines from Mohammad Shami. 0.4 over (0 Run) Tight onto the stumps, on a length. Rohit hops and keeps it out. 0.3 over (1 Run) On a length and way outside off. Kishan knocks it to point where a slight misfield allows the batters to cross ends. A single. 0.2 over (1 Run) A length ball, just outside off. Sharma is off the mark as well as he taps this to third man for a single. 0.1 over (1 Run) On a length and on middle. Kishan pulls it to deep square leg to get off the mark. 0.1 over (1 Run) WIDE! Shami errs with the line as he starts from around the wicket and angles it down the leg side. Kishan misses his flick. We are ready for action! The players are out in the middle. Rohit Sharma and Ishan Kishan will open the batting for Mumbai. Mohammad Shami will begin the proceedings with the ball. Here we go... The captain of Mumbai, Rohit Sharma informs, there is one change, says Murugan Ashwin comes in for Hrithik Shokeen, it is a tactical change. Adds that it has been a tough road but they want to finish on a high and enjoy the game rather than taking pressure. Mentions they had a good game last time and want to carry the momentum. Mentions they have done well in patches but they want consistency. Hardik Pandya, the captain of Gujarat, says that they will bowl first, to be honest, they feel something will happen with the new ball. Adds that they spoke about forgetting their previous game, they have been consistent throughout and there was one game which they had to lose cause they were beating all the odds. Informs that they are playing with the same XI. Mumbai (Playing XI) - Rohit Sharma (C), Ishan Kishan (WK), Suryakumar Yadav, Tilak Varma, Kieron Pollard, Tim David, Daniel Sams, Murugan Ashwin (In for Hrithik Shokeen), Kumar Kartikeya, Jasprit Bumrah, Riley Meredith. Gujarat (Unchanged playing XI) - Wriddhiman Saha (WK), Shubman Gill, Sai Sudharsan, Hardik Pandya (C), David Miller, Rahul Tewatia, Rashid Khan, Pradeep Sangwan, Lockie Ferguson, Alzarri Joseph, Mohammad Shami. TOSS - Up goes the coin and it lands in the favour of Gujarat. They will BOWL first! PITCH REPORT - Kevin Pietersen is down near the pitch. He says it is a beautiful wicket, just like it was last night and the pitch curator treats this wicket as his baby. Adds that we are going to see a great surface, a vacuum of an outfield and what we want to see is more sixes as there were 23 sixes hit on this ground last night. Mumbai finally grabbed two points against Rajasthan last time around. They will hope to play each game like five-time champions and try to win all of their remaining games. Gujarat had an off-day against Punjab but they will fancy getting back to winning ways as they meet a side who are not in top form and remain four points clear on top. Stay tuned for the toss and other updates. Few familiar faces will return today as we gear up to match number 51. Hello and welcome to the coverage of yet another matchday where Mumbai will take on Gujarat. Hardik Pandya will return to Mumbai but this time against them. One team is sitting on top of the hill while the other is under a dark tunnel trying to escape and find a few rays of hope. ... MATCH DAY...","pubDate":"2022-05-06 13:35:57","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637874607467764150.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 LSG vs KKR Live Streaming: Lucknow Super Giants vs Kolkata Knight Riders Live Coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/lucknow-super-giants-vs-kolkata-knight-riders-indian-premier-league-live-streaming-today-check-lsg-vs-kkr-live-coverage-venue-date-streaming-channel-date-time-10642001.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Tata IPL 2022 LSG vs KKR Live Streaming: Lucknow Super Giants vs Kolkata Knight Riders Live Coverage, venue, date, timing","content":"Kolkata Knight Riders ended their 5-game losing streak when they beat Rajasthan Royals in their last encounter. This should give them a lot of confidence when they take on a formidable Lucknow Super Giants. This crucial fixture, especially for Shreyas Iyer’s KKR will take place at the MCA Stadium in Pune on 7 May.A red-hot Lucknow Super Giants come into this game on the back of three consecutive wins. The match has some extra motivation for KL Rahul’s LSG – a win here will help them take a huge step towards sealing their spot in the playoffs. They would be looking to carry on with their momentum and get the job done in this encounter.When will the Lucknow Super Giants and Kolkata Knight Riders match be played?The LSG vs KKR IPL 2022 match will take place on 7 May.Where will the Lucknow Super Giants and Kolkata Knight Riders match be held?The LSG vs KKR IPL 2022 match will be held at MCA Stadium in Pune.What time will the Lucknow Super Giants and Kolkata Knight Riders match start?The LSG vs KKR IPL 2022 match will begin from 7:30 pm onwards. The toss will be held at 7 pm on the same day.Where can you watch LSG vs KKR IPL 2022 match on TV and online?The LSG vs KKR IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The LSG vs KKR match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the LSG vs KKR IPL 2022 match.Complete Squads:Lucknow Super Giants: KL Rahul (Captain), Manan Vohra, Evin Lewis, Manish Pandey, Quinton De Kock, Ravi Bishnoi, Dushmantha Chameera, Shahbaz Nadeem, Mohsin Khan, Mayank Yadav, Marcus Stoinis, Ankit Rajpoot, Avesh Khan, Andrew Tye, Kyle Mayers, Karan Sharma, Krishnappa Gowtham, Ayush Badoni, Deepak Hooda, Krunal Pandya. Jason HolderKolkata Knight Riders: Aaron Finch, Abhijeet Tomar, Ajinkya Rahane, Nitish Rana, Pratham Singh, Baba Indrajith, Rinku Singh, Shreyas Iyer, Ashok Sharma, Pat Cummins, Rasikh Dar, Shivam Mavi, Tim Southee, Umesh Yadav, Varun Chakravarthy, Aman Khan, Andre Russell, Anukul Roy, Chamika Karunaratne, Sunil Narine, Mohammed Nabi, Ramesh Kumar, Venkatesh Iyer, Sam Billings, Sheldon JacksonRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-06 13:27:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/LSG-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes County Team: Ben Stokes plays for which team in County Championship","link":"https://thesportsrush.com/cricket-news-ben-stokes-county-team-ben-stokes-plays-for-which-team-in-county-championship/","keywords":["Cricket","Ben Stokes","County Cricket","durham"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ben Stokes County Team: New English test captain Ben Stokes smashed a brilliant century in his first game of the 2022 County Championship season. Ben Stokes started his English cricket summer on a brilliant note by playing a brilliant knock of 161 runs in just 88 balls against Worcestershire in the County Championship Division-2 match.… The post Ben Stokes County Team: Ben Stokes plays for which team in County Championship appeared first on The SportsRush.","content":"Ben Stokes County Team: New English test captain Ben Stokes smashed a brilliant century in his first game of the 2022 County Championship season. Ben Stokes started his English cricket summer on a brilliant note by playing a brilliant knock of 161 runs in just 88 balls against Worcestershire in the County Championship Division-2 match. Stokes smashed 17 sixes and eight boundaries in his excellent knock. Stokes smashed 34 runs in an over against young left-arm spinner Josh Baker, where he smashed five sixes on the first five balls and a boundary on the last one. In the same over, Ben Stokes completed his century in just 64 balls. This was Ben Stokes’ first game after becoming the new test captain of England. Ben Stokes replaced Joe Root as the new test captain of England. Ben Stokes once led the English cricket team in 2020 against West Indies, when Joe Root was on paternity leave. England lost that game against West Indies. Ben Stokes County Team Ben Stokes plays for Durham in the County Cricket and he has been a part of the side since his debut. Stokes has played for a variety of T20 sides around in multiple leagues, but Durham has been his only club in the County Cricket. Stokes made his debut for Durham in 2009 in a One Day game at the Oval in England. He made his County Championship debut for Durham in the 2010 season against Essex. He made his maiden first-class century for Durham in 2010 at the Trent Bridge stadium against Nottinghamshire. Meanwhile, in the County Championship… Ben Stokes has just hit his 17th six on his way to 160 A new English record for the highest number of sixes in an innings Outrageous. pic.twitter.com/5nbDZFNngs — Cricket on BT Sport (@btsportcricket) May 6, 2022 Durham won the County Championship in 2013, and Ben Stokes played an important part in that campaign. Durham also won the title of Royal One Day Cup in 2014, where Ben Stokes won the Player of the Match in the final against Warwickshire. Ben Stokes has scored 8854 FC runs at an average of 34.85, courtesy of 45 half-centuries and 19 centuries. The post Ben Stokes County Team: Ben Stokes plays for which team in County Championship appeared first on The SportsRush.","pubDate":"2022-05-06 13:26:20","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BLS vs DSRS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for St. Lucia T10 Blast 2022, Match 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/bls-vs-dsrs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-st-lucia-t10-blast-2022-match-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":"The Babonneau Leatherbacks will take on the Dennery Segment Rising Stars in the first match of the St. Lucia T10 Blast 2022 at the Darren Sammy Cricket Ground in St. Lucia on Friday. The Babonneau Leatherbacks have been playing in this tournament for a while but their performances have mostly been average. The likes of Shervon Joseph, Alvin Lafeuille, and Caleb Thomas are expected to lead the side. Meanwhile, this will be Dennery Segment Rising Stars' very first season in the competition. Cricketers like Bradley Giddings and Lennice Modestec could prove crucial for them. BLS XI Caleb Thomas, Alex Joseph, Qwaine Henry, Shervon Joseph (c), Zayee Antoine, Nehemiah Wilfred, Alvin Lafeuille, Steven Abraham (wicket-keeper), Tristan Pierre, Devon Eugene, Stuart Calderon DSRS XI Alex Regis (wk), Deylan James, Bradley Giddings, Vernon Emmanuel, Rudel Mathurin, Ishmael Clement, Gunyelle Cherubin, Azad Faucher, Gervanni Clement, Lennice Modeste, Ligorius Alexander BLS vs DSRS, St. Lucia T10 Blast 2022, Match 1 Date and Time: May 6, 2022, 9:15 PM IST Venue: Darren Sammy Cricket Ground, Sharjah The wicket has more pace and bounce and batters are expected to excel. The side winning the toss should look to bat first in order to get enough runs on the board. A score of 140 is expected to be par here. Wicketkeeper A Regis is a decent choice for the wicketkeeper slot. He is a reliable presence in the middle-order for his side. Batters A Joseph will be hoping to lead his side's batting unit from the front. He has scored 27 runs in four matches. All-rounders B Giddings is one of the finest youngsters in St. Lucia's domestic cricket circles. He will be hoping for a strong campaign here. S Joseph was pretty decent in the St. Lucia Blast in 2021. He had amassed 83 runs and had also taken four wickets. Bowlers L Modeste is a great bowler who has previous experience in this competition. He had scalped 10 wickets in five matches last season. B Giddings (DSRS) S Joseph (BLS) Z Antoine (BLS) A Joseph (BLS) D James (DSRS) S Joseph: 83 runs and 4 wickets last season A Lafeuille: 83 runs last season L Modeste: 10 wickets last season Fantasy Suggestion #1: A Regis, A Lafeuille, A Joseph, D James, G John, B Giddings, S Joseph, Z Antoine, A Faucher, L Modeste, S Hayle Captain: B Giddings , Vice-Captain: S Joseph Fantasy Suggestion #2: A Regis, A Lafeuille, A Joseph, D James, G John, B Giddings, S Joseph, Z Antoine, A Faucher, D Eugene, S Hayle Captain: A Joseph , Vice-Captain: A Lafeuille.","pubDate":"2022-05-06 13:09:33","image_url":"https://static.sportskeeda.com/editor/2022/05/36889-16518402108452-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes hits 64-ball hundred in County cricket after taking over as England Test captain","link":"https://www.indiatoday.in/sports/cricket/story/ben-stokes-shatters-records-for-durham-after-becoming-england-s-test-captain-1946341-2022-05-06?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes hits 64-ball hundred in County cricket after taking over as England Test captain","content":"Ben Stokes, on Friday, May 6, smashed his way to a 64-ball century in Durham’s County Championship match against Worcestershire at the County Ground, New Road in Worcester. En route to his knock, the southpaw also broke Paul Collingwood’s record of the fastest century by a Durham batter in first-class cricket. Back in 2005, former England batter Collingwood scored a 75-ball century against Somerset. Stokes came to bat after Ben Gibbon got rid of skipper Scott Borthwick with Durham’s score at 360/4. From there on, the left-hander showed his class and notched a half-century off 47 balls. After reaching the milestone, Stokes went absolutely berserk, and was severe on 18-year-old Josh Baker. In the 117th over, Stokes smashed the off-spinner for 34 runs, including five sixes off the first five balls. That 100 from @benstokes38 is the fastest in FC cricket for @DurhamCricket It came in 64 balls, 10x6s and 6x4s. @Colly622 previously held the record with 75 ball 100 v Somerset in 2005. #bbccricket — Martin Emmerson (@Martycricket) May 6, 2022 STOKES WREAKS HAVOC In the fifth ball of the over, Stokes cleared the ropes to rack up yet another first-class century. Thereafter, he took the attack to Jack Leach and carted him for four sixes. At the time of writing the article, Stokes scored 161 off 88 balls with eight fours and as many as 17 sixes. On the back of his knock, Durham had comfortably crossed the 550-run mark. 6 6 6 6 6 4 What. An. Over. 34 from six balls for @benstokes38 as he reaches a 64 ball century #LVCountyChamp pic.twitter.com/yqPod8Pchm — LV= Insurance County Championship (@CountyChamp) May 6, 2022 Stokes has recently been appointed as the skipper of the England Test team after Joe Root stepped down from the helm. His first assignment for the Brits will be the upcoming Test series against New Zealand. The Three Lions have had a tough time of late, winning only one out of their last 17 Test matches. They recently lost overseas Test series to Australia and West Indies. Live TV --- ENDS --- Also Read | My ultimate goal is to win the World Cup for South Africa: Marizanne Kapp","pubDate":"2022-05-06 12:57:07","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Brendon McCullum next England cricket coach: Will Brendon McCullum become the new head coach of England?","link":"https://thesportsrush.com/cricket-news-brendon-mccullum-next-england-cricket-coach-will-brendon-mccullum-become-the-new-head-coach-of-england/","keywords":["Cricket","Brendon McCullum","ECB","england cricket","Rob Key"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Brendon McCullum next England cricket coach: Former Kiwi captain is the front runner to take England’s white-ball coach role. The English cricket team is under a transition phase and a lot of changes are being made in the setup. All-rounder Ben Stokes has been made the new test captain of the side. Ben Stokes replaced… The post Brendon McCullum next England cricket coach: Will Brendon McCullum become the new head coach of England? appeared first on The SportsRush.","content":"Brendon McCullum next England cricket coach: Former Kiwi captain is the front runner to take England’s white-ball coach role. The English cricket team is under a transition phase and a lot of changes are being made in the setup. All-rounder Ben Stokes has been made the new test captain of the side. Ben Stokes replaced Joe Root, who resigned after a forgettable Ashes 2021-22 and West Indies series. Apart from Joe Root, head coach Chris Silverwood was also sacked by the management. Silverwood is now the head coach of the Sri Lankan national team. Ben Stokes is the test captain of the side, whereas Eoin Morgan will continue to lead with the white ball. Just like the captains, ECB is now ready to name different coaches for different formats of the games. England’s white-ball team revolutionized the way to play the white-ball format, and they even won the World Cup in 2019. Brendon McCullum next England cricket coach According to reports, Gary Kirsten is set to become the new test coach of the English side. Daily Mail has now reported that former New Zealand captain Brendon McCullum is the front-runner to become the new white-ball coach of the side. If the reports are true, this will be Brendon McCullum’s first assignment as an international coach. McCullum is currently the head coach of IPL side Kolkata Knight Riders, whereas he has also won the title of Caribbean Premier League with Trinbago Knight Riders. #CWC19-winning captain Eoin Morgan has taken over as the skipper of the Kolkata Knight Riders in #IPL2020 What do you expect from the combination of Morgan and Brendon McCullum? pic.twitter.com/OaN3bYDIHn — ICC (@ICC) October 16, 2020 England’s new director of cricket, Rob Key has said that English captain Eoin Morgan will play an important part in the discussion of the new coach for the side. “Eoin is someone I would speak to about so many different things, and in terms of white-ball cricket he’s on top of all that”, Rob Key said as quoted by the Mirror. “He knows what he wants and he knows a lot of the coaches around, so he is one of the first ports of call for that.” Brendon McCullum and Eoin Morgan worked together last year for the Kolkata Knight Riders in IPL 2021, where KKR reached the finals of the tournament. McCullum is famous for his aggressive approach, and the style of England certainly suits him.       The post Brendon McCullum next England cricket coach: Will Brendon McCullum become the new head coach of England? appeared first on The SportsRush.","pubDate":"2022-05-06 12:41:37","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Too Early To Talk\": Star Pakistan Pacer On Return To Test Cricket","link":"https://sports.ndtv.com/cricket/too-early-to-talk-star-pakistan-pacer-on-return-to-test-cricket-2952097","keywords":null,"creator":null,"video_url":null,"description":"Former Pakistan pacer said that he is enjoying his stint with Gloucestershire in County cricket, and also said that it is too early to talk about a Test return.","content":null,"pubDate":"2022-05-06 12:32:39","image_url":"https://c.ndtvimg.com/2022-03/ckp6gn7_pakistan-afp_625x300_05_March_22.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Stokes Hits 5 Sixes And A Four In An Over En Route 64-Ball Ton","link":"https://sports.ndtv.com/cricket/county-championships-ben-stokes-hits-5-back-to-back-sixes-in-a-single-over-to-reach-64-ball-century-for-durham-in-county-cricket-watch-2952072","keywords":null,"creator":null,"video_url":null,"description":"County Championships: Newly appointed England Test captain Ben Stokes hit five back-to-back sixes to reach a brilliant century off 64 balls for Durham in County Cricket","content":"In his first innings in county cricket after being appointed as the England Test skipper, Ben Stokes blasted his way to a 64-ball century for his county side Durham against Worcestershire at New Road on Friday. Stokes reached his hundred in scintillating fashion as he hit five back-to-back sixes off Josh Baker in a single over to reach the three-figure mark. Stokes took on the bowlers and suddenly switched gears after reaching his half-century in 47 balls and needed just 17 deliveries more to score the next 50 runs. Stokes came in at number six and batted with complete positive intent right from the word go. Here are the clips of hitting hitting sixes and reaching his ton in style: FOUR SIXES IN A ROW Ben Stokes & Bedingham 100 partnership #ForTheNorth pic.twitter.com/llcMEC5i2g OMG!!! WHAT IS THIS BEN STOKES 100 & our fastest century in FC cricket. #ForTheNorth pic.twitter.com/RkqOwuRy6N Ben Stokes reaches It only took him 47 balls 👀 #LVCountyChamp pic.twitter.com/PiYMsxuM8i Recently, Stokes was appointed as the Test skipper of the England men's cricket team after Joe Root had decided to step down following series losses vs West Indies and Australia. Stokes' appointment could mean a fresh start for England who have struggled in this cycle (2021-2023) of the World Test Championship (WTC). England are currently at the bottom of the table with only one win in 13 games so far. The table is led by Australia with 5 wins from 8 matches followed by South Africa and India in the 2nd and 3rd places respectively.","pubDate":"2022-05-06 12:25:35","image_url":"https://c.ndtvimg.com/2022-05/ucl3v6lc_ben-stokes_120x90_06_May_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes 5 sixes Durham cricket: Ben Stokes hits 34 runs in one over in County Championship 2022","link":"https://thesportsrush.com/cricket-news-ben-stokes-5-sixes-durham-cricket-ben-stokes-hits-34-runs-in-one-over-in-county-championship-2022/","keywords":["Cricket","Ben Stokes","County Cricket","durham"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ben Stokes 5 sixes Durham cricket: Ben Stokes smashed Josh Baker for 34 runs in one over to complete a 64-ball century in County Cricket. New England test captain Ben Stokes has made a brilliant start to the English cricket summer. Stokes, who missed the Indian Premier League to focus on red-ball cricket is representing… The post Ben Stokes 5 sixes Durham cricket: Ben Stokes hits 34 runs in one over in County Championship 2022 appeared first on The SportsRush.","content":"Ben Stokes 5 sixes Durham cricket: Ben Stokes smashed Josh Baker for 34 runs in one over to complete a 64-ball century in County Cricket. New England test captain Ben Stokes has made a brilliant start to the English cricket summer. Stokes, who missed the Indian Premier League to focus on red-ball cricket is representing Durham in the County Championship. Durham are up against Worcestershire in their third game of the County Championship Division Two at the New Road Stadium in Worcestershire. Durham won the toss and opted to bat first on a flat surface, and the batters of the side took full advantage of the same. Stokes, who missed the initial two games of the tournament made a brilliant return in the third game and scored an unbeaten century. Ben Stokes 5 sixes Durham cricket Ben Stokes smashed his century against Worcestershire in just 64 balls. He smashed the young English spinner Josh Baker for 34 runs in one over, where Ben Stokes smashed five sixes on the first five balls and ended the over with a boundary. Stokes smashed the first six over the long-on boundary, whereas the second, third and fourth six were towards mid-wicket, long-off and long-on, respectively. Ben Stokes smashed the fifth ball towards the long-on boundary again, by which he completed his century in just 64 balls. 6⃣ 6⃣ 6⃣ 6⃣ 6⃣ 4⃣ What. An. Over. 34 from six balls for @benstokes38 as he reaches a 64 ball century #LVCountyChamp pic.twitter.com/yqPod8Pchm — LV= Insurance County Championship (@CountyChamp) May 6, 2022 This was Ben Stokes’ first game after becoming the new test captain of England. Ben Stokes replaced Joe Root as the new test captain of England, where Root stepped down after an abysmal Ashes and a struggling West Indian tour. Stokes was appointed the vice-captain of the side in 2017. Ben Stokes once led the English cricket team in 2020 against West Indies, when Joe Root was on paternity leave. England lost that game against West Indies. Ben Stokes possesses some incredible numbers in the test format. Ben Stokes has scored 5061 test runs at 35.89, courtesy of 11 centuries and 26 half-centuries. He also has 174 wickets under his belt with the red ball. The post Ben Stokes 5 sixes Durham cricket: Ben Stokes hits 34 runs in one over in County Championship 2022 appeared first on The SportsRush.","pubDate":"2022-05-06 12:20:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 PBKS vs RR Live Streaming: Punjab Kings vs Rajasthan Royals live coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/punjab-kings-vs-rajasthan-royals-indian-premier-league-live-streaming-today-check-pbks-vs-rr-live-coverage-venue-date-streaming-channel-date-time-10640711.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022 PBKS vs RR Live Streaming: Punjab Kings vs Rajasthan Royals live coverage, venue, date, timing","content":"Mayank Agarwal-led Punjab Kings will take on Sanju Samson's Rajasthan Royals in the first match of Saturday's doubleheader on 7 May.Punjab Kings come into this game high on confidence after their last encounter against Gujarat Titans. The team has five victories in ten fixtures so far. On the other hand, Rajasthan Royals have six victories and four defeats to their name. Both these sides are part of the mid-table muddle. This makes this clash a crucial fixture for their playoffs hopes.Interestingly, both these sides are dependent on their top order. While Jos Buttler has been superb for Rajasthan, Shikhar Dhawan has been consistent for Punjab Kings. However, both these teams would need their middle order to be far more consistent if they have to make it to the playoffs.When will the Punjab Kings and Rajasthan Royals match be played?The PBKS vs RR IPL 2022 match will take place on 7 May.Where will the Punjab Kings and Rajasthan Royals match be held?The PBKS vs RR IPL 2022 match will be held at Wankhede Stadium in Mumbai.What time will the Punjab Kings and Rajasthan Royals match start?The PBKS vs RR IPL 2022 match will begin from 3:30 pm onwards. The toss will be held at 3 pm on the same day.Where can you watch PBKS vs RR IPL 2022 match on TV and online?The PBKS vs RR IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The PBKS vs RR match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the PBKS vs RR IPL 2022 match.Complete Squads:Punjab Kings: Mayank Agarwal, Arshdeep Singh, Shikhar Dhawan, Kagiso Rabada, Jonny Bairstow, Rahul Chahar, Shahrukh Khan, Harpreet Brar, Jitesh Sharma, Ishan Porel, Liam Livingstone, Odean Smith, Sandeep Sharma, Raj Angad Bawa, Rishi Dhawan, Prerak Mankad, Vaibhav Arora, Writtick Chatterjee, Prabhsimran Singh, Baltej Dhanda, Ansh Patel, Nathan Ellis, Atharva Taide, Bhanuka Rajapaksa, Benny HowellRajasthan Royals: Sanju Samson, Jos Buttler, Ravichandran Ashwin, Trent Boult, Shimron Hetmyer, Devdutt Padikkal, Prasidh Krishna, Yuzvendra Chahal, KC Cariappa, Navdeep Saini, Riyan Parag, Yashasvi Jaiswal, Obed McCoy, Arunay Singh, Kuldeep Sen, Karun Nair, Dhruv Jurel, Tejas Baroka, Kuldip Yadav, Nathan Coulter-Nile, Shubham Garhwal, Daryl Mitchell, Rassie Van Der Dussen, James NeeshamRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-06 12:05:54","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/PBKS-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Tristan Stubbs IPL 2022 price: Tristan Stubbs T20 stats and record","link":"https://thesportsrush.com/cricket-news-tristan-stubbs-ipl-2022-price-tristan-stubbs-t20-stats-and-record/","keywords":["Cricket","IPL 2022","Mumbai Indians","Tristan Stubbs"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Tristan Stubbs IPL 2022 price: Mumbai Indians have signed young South African Tristan Stubbs to replace Tymal Mills. Mumbai Indians have struggled in the Indian Premier League, as they are the only team who have absolutely no chance to qualify for the playoffs of the tournament. Nothing has gone right for the record IPL champions… The post Tristan Stubbs IPL 2022 price: Tristan Stubbs T20 stats and record appeared first on The SportsRush.","content":"Tristan Stubbs IPL 2022 price: Mumbai Indians have signed young South African Tristan Stubbs to replace Tymal Mills. Mumbai Indians have struggled in the Indian Premier League, as they are the only team who have absolutely no chance to qualify for the playoffs of the tournament. Nothing has gone right for the record IPL champions this season around. In the latest setback, Mumbai’s left-arm pacer Tymal Mills has been ruled out of the tournament due to an ankle injury. Mills has been through a lot of injuries throughout his career, and this is yet another setback for him. However, it is being said that the injury is not serious, and he will available to play in the T20 Blast. Mills was picked by Mumbai Indians for a price of INR 1.5 crores in the auction. He managed to scalp just six wickets in five games, and he had a terrible economy of 11.17. Despite being knocked out, Mumbai Indians have decided to bring in a replacement for the tournament. Interestingly, they have signed young South African batter Tristan Stubbs to replace Tymal Mills. Mumbai Indians have roped in 21-years old South African batter Tristan Stubbs for a price of INR 20 lakhs. The talented middle-order batter has reached India and will now serve a mandatory period of quarantine before joining the bio bubble of the team. 🇿🇦 ✈️ 🇮🇳 Welcome to #OneFamily , Tristan Stubbs 💙 #DilKholKe #MumbaiIndians pic.twitter.com/091dNcwx2g — Mumbai Indians (@mipaltan) May 6, 2022 Stubbs plays for Warriors in the South African domestic circuit, and he has some brilliant numbers in T20 cricket. Tristan Stubbs has scored 506 T20 runs at an average of 38.92, courtesy of three half-centuries. He has an impressive strike-rate of 157.14 in the shortest format of the game. With both Dewald Brevis and Tristan Stubbs in their ranks, Mumbai Indians have two of the most talented South African batters. The batting of Mumbai Indians looks future-ready with the likes of Tristan Stubbs, Dewald Brevis, Tilak Varma and Ishan Kishan.","pubDate":"2022-05-06 11:56:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shahid Afridi slams Danish Kaneria for inciting religious sentiments, giving interview to 'enemy country'","link":"https://zeenews.india.com/cricket/shahid-afridi-slams-danish-kaneria-for-inciting-religious-sentiments-says-he-is-giving-interview-to-enemy-country-2460822.html","keywords":null,"creator":null,"video_url":null,"description":"Kanera is among the few hindu players who have represented Pakistan in international cricket","content":null,"pubDate":"2022-05-06 11:51:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}