{"newsArray":[{"title":"ICC World Cup 2023: 5 अक्टूबर से शुरू होगा वनडे विश्वकप का महाकुंभ, 19 नवंबर को खेला जायेगा फाइनल - रिपोर्ट","link":"https://sports.ndtv.com/hindi/cricket/icc-world-cup-2023-odi-world-cup-will-start-from-october-5-the-final-will-be-played-on-november-19-report-odi-world-cup-2023-schedule-3882045#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ICC ODI World Cup 2023: रिपोर्ट में आगे कहा गया है कि भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) ने टूर्नामेंट (ODI World Cup 2023 Venue) के लिए लगभग 12 स्थानों को शॉर्टलिस्ट किया है.","content":"ICC ODI WC 2023 साल 2023 का वनडे विश्व कप भारत में होना है ऐसे में ईएसपीएन क्रिकइंफो के रिपोर्ट के अनुसार 2023 ODI विश्व कप 5 अक्टूबर से शुरू होगा और फाइनल 19 नवंबर को खेला जाएगा. रिपोर्ट में आगे कहा गया है कि भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) ने टूर्नामेंट के लिए लगभग 12 स्थानों को (ODI World Cup 2023 Venue) शॉर्टलिस्ट किया है और फाइनल अहमदाबाद के नरेंद्र मोदी स्टेडियम में होगा. इनमें अन्य स्थान हैं - बेंगलुरु, चेन्नई, दिल्ली, धर्मशाला, गुवाहाटी, हैदराबाद, कोलकाता, लखनऊ, इंदौर, राजकोट और मुंबई. टूर्नामेंट में 46 दिनों में 48 मैच होंगे, जिसमें 10 टीमें ट्रॉफी के लिए आपस में भिड़ेंगी. The 2023 ODI World Cup is likely to start on October 5, with the final scheduled to be in Ahmedabad जबकि रिपोर्ट में मुख्य स्थानों के लिए सूची दी गई है, बोर्ड से टूर्नामेंट से पहले वार्म-अप मैचों के लिए 2-3 और स्थानों की घोषणा करने की उम्मीद है. विकल्पों के पीछे मुख्य कारक बारिश की संभावना और मैदान को समय पर तैयार करने के लिए आवश्यक बुनियादी ढांचे की जरुरत होगी. विश्व कप के कार्यक्रमों की घोषणा आम तौर पर एक साल पहले की जाती है, अंतर्राष्ट्रीय क्रिकेट परिषद (ICC) अभी भी पाकिस्तान के क्रिकेटरों की वीजा स्थिति और भारत सरकार की पेशकश पर टैक्स छूट की स्थिति को समझने का इंतजार कर रही है. BCCI और ICC द्वारा हस्ताक्षरित एक समझौते के हिस्से के रूप में, 2016 से 2023 तक तीन टूर्नामेंटों के लिए टैक्स छूट का वादा किया गया था. रिपोर्ट में दावा किया गया कि BCCI ICC (टूर्नामेंट में शामिल अन्य व्यावसायिक संस्थाओं के साथ) कर छूट के साथ मदद करने के लिए \"बाध्य\" था. दूसरी ओर, पाकिस्तानी क्रिकेटरों ने किसी भी टूर्नामेंट के लिए 2013 के बाद से भारत की यात्रा नहीं की है, लेकिन बीसीसीआई (BCCI on Pakistan Team Visa) ने स्पष्ट कर दिया है कि उनके वीजा को भारत सरकार द्वारा मंजूरी दी जाएगी. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 19:02:03","image_url":"https://c.ndtvimg.com/2019-05/8i441bb8_icc-world-cup-trophy_625x300_29_May_19.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rohan Luthra reveals aim to keep inspiring people after his historic appearance in the Championship","link":"https://www.dailymail.co.uk/sport/football/article-11886437/Rohan-Luthra-reveals-aim-inspiring-people-historic-appearance-Championship.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"At Preston last weekend, the moment Cardiff goalkeeper Rohan Luthra had worked years for finally arrived. It was genuinely happening. And all of a sudden, things turned very surreal.","content":"EXCLUSIVE: Cardiff's Rohan Luthra reveals desire to 'keep inspiring people' after becoming the first British goalkeeper from the South Asian community to play in Championship Rohan Luthra came off the bench to make his professional debut for Cardiff Luthra became the first by British South Asian goalkeeper in the second tier The England youth international hopes to have broken a barrier for others By Adrian Kajumba For Mailonline Published: 17:20, 21 March 2023 | Updated: 18:46, 21 March 2023 e-mail View comments At Preston last weekend, the moment Cardiff goalkeeper Rohan Luthra had worked years for finally arrived. It was genuinely happening. And all of a sudden, things turned very surreal. ‘It felt like one of those old school Nike adverts where the geezer has got the GoPro on their chest or their head,’ he laughed. ‘They’re looking around, looking down doing skills, they’re looking around the stadium. ‘I remember running on trying to fix my gloves, and as I was running, I was like “oh my god, it feels exactly like that. I'm actually here. I've actually managed to get on the pitch”.’ Jak Alnwick’s 90th minute dismissal paved the way for Luthra to make his professional debut in the closing stages and he added: ‘It was weird. Rohan Luthra became the first South Asian goalkeeper to appear in the Championship 90+3 - Rohan Luthra comes on. Sparky makes way. (1-0) #CityAsOne pic.twitter.com/9eg3W0Xr8O — Cardiff City FC (@CardiffCityFC) March 11, 2023 ‘I've always thought when the day came I'd be nervous but I guess it all happened quickly. I didn't have any time to be nervous. It was great.’ Luthra’s appearance was not just a huge moment and source of pride for him and his family but their wider community too. By appearing at Preston, Luthra, of Indian descent, became the first goalkeeper from Britain’s South Asian community to play in the Championship. He said: ‘It's nice to hold something like that, a piece of history. I hope now I can continue doing it and hopefully keep inspiring people to want to do the same. ‘Help impact someone's life maybe by this giving them an extra push and deciding “this is what I want to do”.’ Though Luthra also hopes that eventually occasions like last Saturday will not be so notable. Luthra, who speaks with a maturity beyond his 20 years, said: ‘It shouldn't be first South Asian, first this, first that for anyone. ‘I guess that's the way it is now and hopefully in the future, towards the back end of my career I can be perceived as just a goalkeeper and not just a South Asian goalkeeper.’ The England youth international fulfilled a childhood dream by making his professional debut Luthra hails from a family of professionals and, while the importance of education was stressed, he was always encouraged to pursue his passions and his football dreams were well-supported by his family, including father Sunny and mother Zuby. ‘Without them, I’d be nowhere,’ he said of his parents. Luthra is breaking barriers and smashing stereotypes – about both his chosen position as well as profession – on his way to trying to achieve his dreams. And reflecting on how things have evolved regarding representation he said: ‘There is a slight shift happening. ‘I can see younger kids starting out from the south Asian community, getting involved and wanting to make a career in football. It is nice to see because when I was growing up I remember playing however many years of youth football and I never ever, ever saw someone who looked like me. ‘When I was really younger, there was never really that thing that clicked in my head like “there’s nobody like me.” ‘The older I got, the more I started to notice it especially going to school in Croydon were there are loads of different people with different backgrounds and I'm thinking, “right the majority of the people don't look like me.” ‘First time I actually saw someone I was shocked, taken aback. I could not believe there was someone from a South Asian background playing football and that’s horrible for me to even think that. ‘Since I’ve come to Cardiff it’s been brilliant. I’ve never thought once “I look different to everyone else” or “nobody is like me.” Everyone has taken me in and been really good with me.’ Luthra was never deterred by the lack of likeness around him in his younger days. Luthra, a national champion with Surrey, believes there has been a shift in representation Luthra said he never saw someone who looked like him when playing youth football in Croydon And along with his parents, Colin Barnes, Palace’s head of academy recruitment, a mentor he first met while at Reading’s pre-academy and was later reunited with at the Selhurst Park club, was also a pivotal figure. ‘He made me see that it doesn't matter what I look like,’ 6ft 5in stopper Luthra said. ‘As long as I worked hard anything can happen. I think he could tell that with a bit of work I could make something out of a career. I still speak to him every week now. Such an important part in my career and life really. I don’t just talk about football, I talk about life with him. Straight after [Preston] I gave him a call and he was so happy for me.’ Luthra was also a talented wicket-keeper-batsman as well as footballer when younger, playing for Surrey from the ages of nine to 16. In one summer he was just one cricket final win away from winning national titles for his county in both sports. Arsenal were among the clubs he spent time at in his early academy years where Luthra played with Bukayo Saka. ‘I was about seven but still everybody knew then that wow, this this guy could be something special. Obviously now he is something special.’ England star Saka was the first of a number of notable names Luthra has played alongside. Palace’s reputation for producing young talent such as Victor Moses, Nathaniel Clyne and Wilfried Zaha made it a ‘no brainer’ for Luthra to join them officially as an under-9. While there Luthra made his under-18s debut at 15 and now Chelsea winger Noni Madueke was among his academy teammates. Luthra also went to the renowned Whitgift School, Croydon, playing alongside Bayern Munich wonderkid Jamal Musiala, Chelsea’s Callum Hudson-Odoi and Manchester United youngster Di’Shon Bernard. ‘It was good having Callum and Di’Shon in the same school, the same teams as me,’ he smiled. Bukayo Saka is among the England players Luthra has played alongside at youth level Luthra played in the same England youth team as Noni Madueke, Tino Livramento, Jude Bellingham, Jamal Musiala and Cole Palmer ‘If Callum is there you’re always going to be second fiddle but when you have someone that good you don’t really mind. You let them do their work and bring the magic.’ Luthra, one of only two goalkeepers to feature in England’s top two divisions this season who will be eligible for England’s under-21s next term, has also worn the Three Lions at under-15s level alongside the likes of Jude Bellingham, Musiala and Madueke, another indication of his potential. Now at Cardiff, who he picked ahead of Brentford after leaving Palace in 2021, and closer to being able to show that more often on the senior stage, Luthra said: ‘Ultimately, I want to look back at my career in maybe 30 years’ time and be proud of it. I want to know that I've pushed myself to the highest level I can go and reach my potential. The potential that everybody is telling me that I've got. ‘I think I'm lucky in the respect that I don't let things get to my head ever. I'm quite a level headed person, really calm. ‘So if I continue to work how I am and have the mind-set I’ve got nothing can stop me from getting were I should be going.’ Share or comment on this article: Rohan Luthra reveals aim to keep inspiring people after his historic appearance in the Championship e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-21 18:46:55","image_url":"https://i.dailymail.co.uk/1s/2023/03/21/17/68950487-0-image-a-17_1679418400026.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"WPL: यूपी को हराकर दिल्‍ली कैपिटल्‍स का फाइनल में प्रवेश, मुंबई इंडियंस को लगा ‘करंट’, एलिमिनेटर खेलने को मजबूर","link":"https://hindi.news18.com/news/sports/cricket-womens-premier-league-playoffs-delhi-capitals-reach-in-final-after-beating-up-warriors-mumbai-indians-to-play-eliminator-5612685.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वूमेंस प्रीमियर लीग (Women's Premier League Playoffs) में दिल्‍ली कैपिटल्‍स (Delhi Capitals Final) ने सीधे फाइनल में प्रवेश कर लिया है. वहीं, मुंबई इंडियंस अब यूपी वॉरियर्स के खिलाफ एलिमिनेटर मैच खेलने को मजबूर हो गई है. खासबात यह है कि दिल्‍ली और मुंबई ने बराबर आठ में से छह मुकाबले जीते हैं.","content":"वूमेंस प्रीमियर लीग में दिल्‍ली कैपिटल्‍स ने फाइनल में प्रवेश कर लिया है. (Twitter/WPL) नई दिल्‍ली. वूमेंस प्रीमियर लीग (Women’s Premier League 2023) के आखिरी लीग मैच में यूपी वॉरियर्स पर दिल्‍ली कैपिटल्‍स पर पांच विकेट से जीत दर्ज की. इसके साथ ही दिल्‍ली कैपिटल्‍स ने मुंबई के बराबर ही आठ मैचों में छह जीत दर्ज कर ली है. हालांकि बेहतर रन रेट के आधार पर दिल्‍ली की टीम ने सीधे फाइनल में प्रवेश कर लिया है. मुंबई को एलिमिनेटर के माध्‍यम से खिताबी मैच में अपनी जगह बनानी होगी. मुंबई को अब यूपी वॉरियर के खिलाफ 24 मार्च को एलिमिनेटर मैच खेलना होगा. इस मुकाबले को जीतने वाली टीम फाइनल में प्रवेश करेगी. जिसके बाद एलिमिनेटर की विजेता का मैच 26 मार्च को मुंबई के ब्रेबोर्न स्‍टेडियम में दिल्‍ली कैपिटल्‍स के खिलाफ खेला जाएगा. मामूली अंतर से फाइनल से चूकी मुंबई इंडियंस डब्‍यूपीएल 2023 में आज यूपी और दिल्‍ली के बीच आखिरी लीग मैच खेला गया. हरमनप्रीत कौर की मुंबई इंडियंस यह उम्‍मीद कर रही थी कि यूपी इस मुकाबले को जीत जाए ताकि उन्‍हें सीधे फाइनल में जगह मिले. हालांकि ऐसा नहीं हो सका. नेट रन रेट के मामले में दिल्‍ला कैपिटल्‍स और मुंबई इंडियंस के बीच कड़ी टक्‍कर थी. अंतिम मैच के बाद दिल्‍ली का नेट रन रेट 1.856 का है. वहीं, मुंबई 1.711 के साथ दूसरे स्‍थान पर रह गई. इस मामूली अंतर के चलते मुंबई को एलिमिनेटर मैच खेलने को मजबूर होना पड़ रहा है. रोहित शर्मा की टीम का बैटर! बनना चाहता था बॉलर, बन गया भरोसेमंद बल्लेबाज, भारत को बनाएगा टेस्‍ट चैंपियन! 10वीं में 2 बार फेल, सरकारी नौकरी का कॉल लेटर फाड़ा, क्रिकेट में चमके, धोनी जैसी है ऑलराउंडर की स्‍टोरी यूपी वॉरियर्स ने आठ मैचों में से चार मुकाबलों में जीत दर्ज की है. आठ अंकों के साथ वो प्‍वाइंट्स टेबल पर तीसरे स्‍थान पर हैं. चौथे नंबर की टीम रॉयल चैलेंजर्स बैंगलोर ने आठ में से दो मैच ही जीते हैं. आखिरी स्‍थान पर मौजूद गुजरात जायंट्स ने भी आठ में से दो मुकाबले ही जीते हैं. आखिरी दो टीमों ने टूर्नामेंट के दौरान कोई संघर्ष नहीं दिखाया. जिसका फायदा मुंबई और दिल्‍ली की टीम को प्‍वाइंट्स टेबल में मिला. आज के मैच की बात की जाए तो ताहिला मैक्‍ग्रा की 32 गेंदों पर 58 रन की पारी के दम पर यूपी वॉरियर की टीम ने निर्धारित 20 ओवरों में छह विकेट के नुकसान पर 138 रन बनाए. लक्ष्‍य का पीछा करने उतरी दिल्‍ली कैपिटल्‍स की टीम ने 18वें ओवर में ही इस मुकाबले को पांच विकेट से अपने नाम कर लिया. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Cricket news , Delhi Capitals , Mumbai indians , Women's Premier League , WPL 2023 आईसीसी वर्ल्ड कप के लिए 17 खिलाड़ियों ने बनाई जगह, कोच द्रविड़ ने तैयार की लिस्ट, सूर्यकुमार यादव बाहर या अंदर? रोहित शर्मा की टीम का बैटर! बनना चाहता था बॉलर, बन गया भरोसेमंद बल्लेबाज, भारत को बनाएगा टेस्‍ट चैंपियन! फिल्मों में हुए फ्लॉप, पत्नी ने भी दिया तलाक, फिर पलटा एक्टर का नसीब, होने लगी पैसों की बारिश","pubDate":"2023-03-21 17:53:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/DC-vs-UPW-Twitter-WPL-16794206603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WI vs SA: दक्षिण अफ्रीका ने बनाया विश्व रिकॉर्ड, वनडे क्रिकेट में ऐसा करने वाली इकलौती टीम बनी","link":"https://sports.ndtv.com/hindi/cricket/wi-vs-sa-south-africa-made-world-record-became-the-only-team-to-do-so-in-odi-cricket-3881702#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WI vs SA 3rd ODI: साउथ अफ्रीका (SA) की टीम ने वेस्टइंडीज (WI) को आखिरी मुकाबले में 4 विकेट से मात देकर सीरीज बराबर कर लिया.","content":"WI vs A वेस्टइंडीज की टीम साउथ अफ्रीका दौरे पर है. जहां दो टेस्ट मुकाबलों में साउथ अफ्रीका ने दोनों ही टेस्ट मुकाबले जीत लिए. उसके बाद दोनों ही टीमों के बीच तीन वनडे मुकाबलों की सीरीज खेली जा रही है. पहला वनडे मुकाबला बारिश की भेट चढ़ गई थी और टॉस भी नहीं मुमकिन हो पाया था. दूसरे वनडे मुकाबले को वेस्टइंडीज ने 48 रनों से जीत लिया था, लेकिन वनडे मुकाबले में वापसी करते हुए साउथ अफ्रीका की टीम ने वेस्टइंडीज को आखिरी मुकाबले में 4 विकेट से मात देकर सीरीज बराबर कर लिया और ऐसा कर दक्षिण अफ्रीका ने साल 2006 में जोहान्सबर्ग के वांडरर्स में ऑस्ट्रेलिया के खिलाफ विश्व-रिकॉर्ड (South Africa World Record vs Australia) 435-रन (49.5 ओवर में 438/9) से अपने 8.78 को बेहतर बनाया. South Africa win the third and final ODI to level the series after Heinrich Klaasen's outstanding knock 👌 | 📝 तीसरे मुकाबले में धमाकेदार जीत दर्ज कर दक्षिण अफ्रीका (South Africa New Odi World Record vs WI) एकलौती ऐसी टीम बन गई जिसने 30 ओवर से कम में 250 या इससे ज्यादा के लक्ष्य का पीछा किया हो, अब ये रिकॉर्ड दक्षिण अफ्रीका टीम के साथ दर्ज हो चुकी है. दक्षिण अफ्रीका ने आज 8.95 के रन-रेट से 200 या उससे अधिक का सफल एकदिवसीय रन-चेज़ में उनका अब तक का सर्वश्रेष्ठ था. Fastest 250+ chase in ODIs : 29.3 overs - SA vs WI, today* 32.3 overs - IND vs WI, 2019 34.1 overs - ENG vs SL, 2016 35.1 overs - ENG vs WI, 2017 साउथ अफ्रीका ने टॉस जीतकर पहले गेंदबाज़ी का फैसला किया और पहले बल्लेबाज़ी करने आई वेस्टइंडीज की टीम ने 48.2 ओवर में 10 विकेट के नुकसान पर 260 रन बनाकर अफ्रीका को 50 ओवर में 261 रनों का लक्ष्य दिया, जिसे हेनरिक क्लासेन (Heinrich Klaasen Century vs West Indies) के शानदार शतक की बदौलत 29.3 ओवर में 6 विकेट के नुकसान पर हासिल कर लिया. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 17:34:39","image_url":"https://c.ndtvimg.com/2023-03/jvq8c2ig_wi-vs-sa_625x300_21_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Major League Cricket: Finch, Hasaranga, Stoinis among international signings in inaugural player draft","link":"https://thenewsmill.com/2023/03/major-league-cricket-finch-hasaranga-stoinis-among-international-signings-in-inaugural-player-draft/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The draft for the inaugural season of the Major Cricket League (MLC) saw international cricket stars like former Australian skipper Aaron Finch, star Sri Lankan all-rounder Wanindu Hasaranga, Australian all-rounder Marcus Stoinis, South African wicketkeeper-batter Quinton de Kock and former England pacer Liam Plunkett. Harmeet Singh made history on Sunday night in Houston by being named the first pick of the Major League Cricket (MLC) draft when the six MLC franchises converged at Space Center Houston to make their domestic picks and announced big international signings as the historic 2023 season prepares to take flight. Singh was selected by the Seattle Orcas, who unveiled their name and logo earlier this week. Singh, a 30-year-old all-rounder who bowls left-arm off spin, has played in the Indian Premier League (IPL) and was on the India U-19 squad that won the 2012 World Cup, along with leading the Seattle Thunderbolts to the 2022 Minor League Cricket championship. “I am really excited to be here,” Singh said as per a press release from MLC. “And also nervous at the same time. I played in Seattle in the Minor League. Now Major League Cricket. It cannot get better for me,” added Singh. The Seattle Orcas, Washington Freedom, San Francisco Unicorns, Los Angeles Knight Riders and Texas (team name still to be announced) each made nine picks with some teams announcing major international signings during the two-hour event. Former Australia one-day international captain Aaron Finch and Australia all-rounder Marcus Stoinis will join San Francisco, South Africa fast bowler Anrich Nortje and Sri Lanka legbreak bowler Wanindu Hasaranga will play for Washington and former South Africa captain and wicketkeeper Quinton de Kock as well as hard-hitting Australian all-arounder Mitchell Marsh signed for Seattle. The domestic draft Sunday night consisted of nine rounds of selections from players who are in the domestic player pool, including 16 past or present USA National Team players. Washington selected wicketkeeper Andries Gous with the second pick. Gous recently played in Abu Dhabi’s T10 league. MI New York selected USA international batter Steven Taylor with the third pick, San Francisco selected former New Zealand international and batsman Corey Anderson fourth, Los Angeles Knight Riders selected star USA Cricket bowler Ali Khan and Texas picked fast bowler Rusty Theron, who has played for multiple IPL teams, with its first pick in the first round. Several other big names were selected in the Major League Cricket draft: Unmukt Chand, who captained the India U-19 team to the 2012 World Cup, joined Los Angeles in the second round; Liam Plunkett, a star bowler for the England team that won the 2019 World Cup, joins San Francisco, and former Pakistan international Hammed Azam was taken by MI New York. In addition to USA-capped players Theron, Khan and Taylor selected in the first round, a further 13 national team players were amongst the draft selections. Current USA captain Monank Patel was drafted by MI New York, along with Nosthush Kenjige, Shayan Jahangir, Kyle Phillip and Saideep Ganesh. The Seattle Orcas selected national teamers Aaron Jones and Cameron Gannon, while Jaskaran Malhotra and 20-year-old Ali Sheikh are headed to the Los Angeles Knight Riders. The Washington Freedom picked up past USA captain Saurabh Netravalkar and Cameron Stevenson is headed to Texas along with teenager Sai Mukkamalla. Fellow teenager Sanjay Krishnamurthi stays close to his home in the Bay Area, drafted by the San Francisco Unicorns. The final ninth round — dedicated to Under-23 selections — also saw more young domestic talent offered the opportunity to play alongside some of the best players in the world this summer, with Bhaskar Yadram (LA), Matthew Tromp (Seattle) and Akhilesh Bodugum (Washington) all picked up. The 2023 MLC season starts July 13 in a brand-new cricket-specific venue – Grand Prairie Stadium – in Grand Prairie, Texas. Teams will play the explosive Twenty20 (T20) format of the game, with matches typically lasting three hours. The regular season will consist of five games, with each team playing each other once, followed by a playoff round and the championship on July 30. Teams will announce more big-name international signings as they become official, and each squad has a chance to pick another domestic player in early July based on performances in the Minor League Cricket season. (ANI)","pubDate":"2023-03-21 17:31:36","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL 2023 UPW vs DC: यूपी वारियर्स को 5 विकेट से हराकर, WPL 2023 की पहली फाइनलिस्ट टीम बनी दिल्ली कैपिटल्स","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-up-warriorz-vs-delhi-capitals-live-update-upw-vs-dc-score-3880945#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"UPW Women vs DC Women, WPL 2023: यूपी वारियर्स की टीम अब तक खेले गए 7 मुकाबलों में से 4 मुकाबले जीतकर पॉइंट्स टेबल में नंबर 3 पर बरकरार है.","content":"WPL 2023 Live: UPW-W vs DC-W दिल्ली कैपिटल्स ने महिला प्रीमियर लीग (WPL 2023) टी20 मैच में मंगलवार को यहां यूपी वॉरियर्स को पांच विकेट से शिकस्त देकर फाइनल में अपनी जगह पक्की की, दिल्ली कैपिटल्स ने यूपी वारियर्स को छह विकेट पर 138 रन पर रोकने के बाद 17.5 ओवर में पांच विकेट के नुकसान पर लक्ष्य हासिल कर लिया. उसके लिए कप्तान मेग लानिंग (Meg Lanning) ने सबसे ज्यादा 37 रन बनाये. यूपी वारियर्स ने महिला प्रीमियर लीग (WPL 2023) टी20 मैच में मंगलवार को यहां दिल्ली कैपिटल्स के खिलाफ पहले बल्लेबाजी करते हुए छह विकेट पर 138 रन बनाये. वारियर्स के लिए तहलिया मैकग्रा ने सबसे ज्यादा नाबाद 58 रन का योगदान दिया. उन्होंने 32 गेंद की पारी में आठ चौके और दो छक्के जड़े. कैपिटल्स के लिए एलिसे कैप्सी ने तीन विकेट झटके. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 17:31:25","image_url":"https://c.ndtvimg.com/2023-03/clnei5bg_dc-vs-upw_625x300_07_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL: All-round Capsey powers Delhi Capitals into final, UP Warriorz to take on MI in eliminator after five-wicket loss","link":"https://thenewsmill.com/2023/03/wpl-all-round-capsey-powers-delhi-capitals-into-final-up-warriorz-to-take-on-mi-in-eliminator-after-five-wicket-loss/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"An all-round show by Alice Capsey and quick knocks from skipper Meg Lanning and Shafali Verma helped Delhi Capitals earn a direct qualification into the final of the Women’s Premier League (WPL) after a five-wicket win over UP Warriorz in the final league stage match at Brabourne Stadium on Tuesday. DC finishes at the top spot with six wins and two losses and 12 points in total. MI has similar statistics, but has been pushed to the second due to an inferior net-run-rate. MI will take on UP Warriorz in the eliminator on March 24 to determine the second finalist. In the chase of 139 runs, Delhi Capitals continued with their template of aggressive cricket. Openers Shafali Verma and Meg Lanning went after UPW bowlers from the start. Shabnim Ismail, the veteran medium pacer from South Africa was smashed for three fours and a six by Lanning in the very first over of the inning itself. Delhi Capitals reached the 50-run mark in just 4.1 overs. This time it was Lanning’s aggression driving the chase. Soppadhandi Yashasri earned UPW their first wicket after she dismissed Shafali for a 16-ball 21, consisting of four boundaries. Sophie Ecclestone took a good catch at long-on to reduce DC to 56/1. At the end of six overs of the powerplay, DC was at 67/1, with Lanning (37*) and Jemimah Rodrigues (3*) unbeaten. Shabnim put some restrictions on DC’s run flow, dismissing Rodrigues (3) by trapping her lbw and skipper Lanning for 39 off 23 balls, consisting of five fours and two sixes. Simran Shaikh took a brilliant catch at deep midwicket. DC was at 70/3 in 6.5 overs. Alice Capsey was next up on the crease and announced her arrival by smashing Ecclestone for three fours in the ninth over and Parshavi Chopra for a six in the 10th over. At the end of 10 overs, DC was at 92/3, with Marizanne Kapp (2*) and Capsey (21*) unbeaten. At the end of 15 overs, DC was at 117/3, with Capsey (31*) and Kapp (16*) unbeaten at the crease. Kapp and Capsey reached the 50-run stand in 50 balls. Ecclestone got better of Alice, who was stumped by Healy for 34 off 31 balls. DC was at 130/4 in 16.2 overs and need nine runs to win. Jess Jonassen was next up on the crease. DC finished the chase successfully. They finished at 142/5 in 17.5 overs. Kapp hit the winning boundary to send DC into the finals. Kapp finished at 34* off 31 balls, consisting of four boundaries and a six. Arundhati Reddy was unbeaten at zero. Shabnim was the pick of the bowlers for UPW, taking 2/29 in three overs. Yashasri and Ecclestone took a wicket each. Earlier, a top bowling spell from all-rounder Alice Capsey helped Delhi Capitals reduce UP Warriorz to 138/6 in their 20 overs of the final league stage game of the Women’s Premier League (WPL) at the Brabourne Stadium in Mumbai on Tuesday. After being put to bowl first by Delhi Capitals, UP Warriorz was off to a solid start. Openers Alyssa Healy and Shweta Sehrawat added 30 runs for the first wicket. Sehrawat looked really good, finding gaps at will to hit four boundaries. But Sehrawat’s 12-ball stay at the crease was ended by Radha Yadav for 19 runs, with Jess Jonassen taking a good catch at point. UPW was 30/1 in 4.1 overs. Following this, Simran Shaikh joined skipper Healy on the crease. The duo helped UPW navigate through the remainder of the powerplay without any further damage. At the end of six overs, UPW was at 38/1, with Alyssa Healy (16*) unbeaten with Simran Shaikh (1*). UPW crossed the 50-run mark in 7.5 overs thanks to a huge six from Alyssa Healy. At the end of 10 overs, UPW was at 63/2. Alice Capsey dismissed Healy for 36 off 34 balls on the final ball of the 10th over. Taniya Bhatia stumped the batter. DC bowlers continued to create pressure on UPW batters. Radha got her second wicket, dismissing a struggling Simran for 11 off 23 balls. UPW was 71/3 in 12 overs. Following these two quick wickets, Tahlia McGrath and Kiran Navgire were the fresh pair on the crease. They attempted to rebuild innings but their efforts were disrupted as Jonassen picked the wicket of Navgire for 2 runs. Taniya delivered yet another great stumping to reduce UPW to 91/4 in 14.5 overs. At the end of 15 overs, UPW was at 92/4 with Deepti Sharma (1*) and Tahlia (19*) at the crease. The onus was on them to finish well for their sides. Capsey got her second wicket, castling Deepti Sharma for just three off eight balls. UPW was 104/5 in 17.1 overs. In the same over, she dismissed Sophie Ecclestone for a duck, reducing UPW to 105/6. Tahlia continued her fightback, bringing up her fourth WPL fifty in 30 balls. UPW finished at a modest score of 138/6, with Tahlia (58* off 32 balls, eight fours and two sixes) and Anjali Sarvani (3*) unbeaten. Capsey was the pick of the bowlers for DC, taking 3/26 in four overs. Radha Yadav ended with figures of 2/28 and Jonassen also got a wicket. Brief Scores: UPW: 138/6 (Tahlia McGrath 58*, Alyssa Healy 36, Alice Capsey 3/26) vs DC: 142/5 in 17.5 overs (Meg Lanning 39, Alice Capsey 31, Shabnim Ismail 2/29). (ANI)","pubDate":"2023-03-21 17:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"आईसीसी वर्ल्ड कप के लिए 17 खिलाड़ियों ने बनाई जगह, कोच द्रविड़ ने तैयार की लिस्ट, सूर्यकुमार यादव बाहर या अंदर?","link":"https://hindi.news18.com/photogallery/sports/cricket-rahul-dravid-says-icc-world-cup-core-team-of-18-already-prepared-few-more-to-add-reply-on-suryakumar-yadav-5612505.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम के कोच राहुल द्रविड़ ने भारत में इस साल होने वाले आईसीसी विश्व कप की कोर टीम तैयार कर ली है. ऑस्ट्रेलिया के खिलाफ चेन्नई में होने वाले 3 मैचों की वनडे सीरीज के आखिरी मैच से पहले उन्होंने मीडिया से बात करते हुए बताया कि विश्व कप के लिए 17-18 खिलाड़ियों को चुना है. सबकी नजरें सिर्फ इसी बात पर टिकी है कि जब लिस्ट सामने आएगा तो उसमें सूर्यकुमार यादव का नाम होगा या नहीं.","content":"Loading... Loading... Loading... Loading... कोच द्रविड़ ने कहा, \"मेरे ख्याल से अगर जो हम भविष्य के बारे में सोचें तो हमें जैसी टीम और जो खिलाड़ी चाहिए उसको लेकर सबकुछ साफ हैं। भारत में होने वाले वनडे वर्ल्ड कप के लिए हमने अब तक तकरीबन 17-18 खिलाड़‍ियों को चुन लिया है। कुछ खिलाड़ी ऐसे हैं जो चोट से अभी रिकवर कर रहे हैं तो उनको लेकर भी नजर बनाए हुए हैं कि वो वापसी करने में कितना वक्त लेंगे.-AP वर्ल्ड कप की टीम को लेकर कोचिंग स्टाफ और मैनेजमेंट की राय एकमत है. हम सभी काफी बेहतर तरीके से इसकी योजना बना रहे हैं और सारे बेहतर स्‍पेस में हैं. टूर्नामेंट के लिए हम किस तरह की टीम लेकर उतरने वाले हैं इसको लेकर किसी तरह से कोई भी संशय नहीं है. टीम के बारे में सबकुछ बिल्कुल साफ है.-AP हमारी कोशिश यही है कि जिन खिलाड़ियों को हमने चुना है और वो अब तक उम्मीद के मुताबिक अपना खेल नहीं दिखा पाए हैं उनको और ज्यादा से ज्यादा मौके दे पाएं. हमारे लिए ये अच्छी बात है कि इस बार का विश्व कप भारत में आयोजित हो रहा है. अगर भारत के बाहर भी यह टूर्नामेंट हो रहा होता फिर भी हम सबको ज्यादा से ज्यादा मौके देने की कोशिश करते.-AP द्रविड़ ने कहा कि हमारे पास 15 से 16 खिलाड़ियों का कॉम्बिनेशन है जिसका हम इस्तेमाल करना चाहते हैं और इसी को लेकर काम भी कर रहे हैं. वर्ल्ड कप का टूर्नामेंट काफी बड़ा है और भारत में ही इसे आयोजित किया जाना है. इसे कई शहरों में खेला जाएगा और हर जगह की परिस्थिति अलग होगी. हमारा लक्ष्य है कि टीम अलग अलग परिस्थिति में ढलने के लिए तैयार हो. जहां तेज गेंदबाजी वाली परिस्थिति मिले वहां 4 तेज गेंदबाज के साथ उतरें और जहां जरूरत हो 3 स्पिनर लेकर भी उतर सकें.-AFP सूर्यकुमार यादव के बारे में द्रव‍िड़ ने कहा, सूर्यकुमार को लेकर ज्यादा चिंता करने जैसी कोई बात है ही नहीं. ऑस्ट्रेलिया के खिलाफ पहले दो वनडे में जिन दो गेंद पर वो आउट हुए वो बहुत ही शानदार गेंद थी. यह बात हम सबको ध्यान में रखनी चाहिए कि सूर्या अभी 50 ओवर क्रिकेट सीख रहे हैं और ये जो फॉर्मेट है वो टी20 मैच अलग होता है।-AP","pubDate":"2023-03-21 17:12:43","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/shubman-gil-and-rahul-dravid-1-1-16794183863x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"I think Chennai's pitch will favour team India\" - Wasim Jaffer on venue for 3rd ODI against Australia","link":"https://www.sportskeeda.com/cricket/news-i-think-chennai-s-pitch-will-favour-team-india-wasim-jaffer-venue-3rd-odi-australia?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-03-21 16:46:13","image_url":"https://staticc.sportskeeda.com/editor/2023/03/ce9e2-16794006496043-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"“That’s a controversial one” – Virat Kohli picks Cheteshwar Pujara as the worst runner between wickets","link":"https://www.sportskeeda.com/cricket/news-that-s-controversial-one-virat-kohli-picks-cheteshwar-pujara-worst-runner-wickets?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-03-21 16:46:13","image_url":"https://staticc.sportskeeda.com/editor/2023/03/ebd75-16794012207131-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC World Cup 2023: 5 अक्टूबर से शुरू होगा वनडे विश्वकप का महाकुंभ, 19 नवंबर को खेला जायेगा फाइनल - रिपोर्ट","link":"https://sports.ndtv.com/hindi/cricket/icc-world-cup-2023-odi-world-cup-will-start-from-october-5-the-final-will-be-played-on-november-19-report-odi-world-cup-2023-schedule-3882045#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ICC ODI World Cup 2023: रिपोर्ट में आगे कहा गया है कि भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) ने टूर्नामेंट (ODI World Cup 2023 Venue) के लिए लगभग 12 स्थानों को शॉर्टलिस्ट किया है.","content":"ICC ODI WC 2023 साल 2023 का वनडे विश्व कप भारत में होना है ऐसे में ईएसपीएन क्रिकइंफो के रिपोर्ट के अनुसार 2023 ODI विश्व कप 5 अक्टूबर से शुरू होगा और फाइनल 19 नवंबर को खेला जाएगा. रिपोर्ट में आगे कहा गया है कि भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) ने टूर्नामेंट के लिए लगभग 12 स्थानों को (ODI World Cup 2023 Venue) शॉर्टलिस्ट किया है और फाइनल अहमदाबाद के नरेंद्र मोदी स्टेडियम में होगा. इनमें अन्य स्थान हैं - बेंगलुरु, चेन्नई, दिल्ली, धर्मशाला, गुवाहाटी, हैदराबाद, कोलकाता, लखनऊ, इंदौर, राजकोट और मुंबई. टूर्नामेंट में 46 दिनों में 48 मैच होंगे, जिसमें 10 टीमें ट्रॉफी के लिए आपस में भिड़ेंगी. The 2023 ODI World Cup is likely to start on October 5, with the final scheduled to be in Ahmedabad जबकि रिपोर्ट में मुख्य स्थानों के लिए सूची दी गई है, बोर्ड से टूर्नामेंट से पहले वार्म-अप मैचों के लिए 2-3 और स्थानों की घोषणा करने की उम्मीद है. विकल्पों के पीछे मुख्य कारक बारिश की संभावना और मैदान को समय पर तैयार करने के लिए आवश्यक बुनियादी ढांचे की जरुरत होगी. विश्व कप के कार्यक्रमों की घोषणा आम तौर पर एक साल पहले की जाती है, अंतर्राष्ट्रीय क्रिकेट परिषद (ICC) अभी भी पाकिस्तान के क्रिकेटरों की वीजा स्थिति और भारत सरकार की पेशकश पर टैक्स छूट की स्थिति को समझने का इंतजार कर रही है. BCCI और ICC द्वारा हस्ताक्षरित एक समझौते के हिस्से के रूप में, 2016 से 2023 तक तीन टूर्नामेंटों के लिए टैक्स छूट का वादा किया गया था. रिपोर्ट में दावा किया गया कि BCCI ICC (टूर्नामेंट में शामिल अन्य व्यावसायिक संस्थाओं के साथ) कर छूट के साथ मदद करने के लिए \"बाध्य\" था. दूसरी ओर, पाकिस्तानी क्रिकेटरों ने किसी भी टूर्नामेंट के लिए 2013 के बाद से भारत की यात्रा नहीं की है, लेकिन बीसीसीआई (BCCI on Pakistan Team Visa) ने स्पष्ट कर दिया है कि उनके वीजा को भारत सरकार द्वारा मंजूरी दी जाएगी. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 19:02:03","image_url":"https://c.ndtvimg.com/2019-05/8i441bb8_icc-world-cup-trophy_625x300_29_May_19.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rohan Luthra reveals aim to keep inspiring people after his historic appearance in the Championship","link":"https://www.dailymail.co.uk/sport/football/article-11886437/Rohan-Luthra-reveals-aim-inspiring-people-historic-appearance-Championship.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"At Preston last weekend, the moment Cardiff goalkeeper Rohan Luthra had worked years for finally arrived. It was genuinely happening. And all of a sudden, things turned very surreal.","content":"EXCLUSIVE: Cardiff's Rohan Luthra reveals desire to 'keep inspiring people' after becoming the first British goalkeeper from the South Asian community to play in Championship Rohan Luthra came off the bench to make his professional debut for Cardiff Luthra became the first by British South Asian goalkeeper in the second tier The England youth international hopes to have broken a barrier for others By Adrian Kajumba For Mailonline Published: 17:20, 21 March 2023 | Updated: 18:46, 21 March 2023 e-mail View comments At Preston last weekend, the moment Cardiff goalkeeper Rohan Luthra had worked years for finally arrived. It was genuinely happening. And all of a sudden, things turned very surreal. ‘It felt like one of those old school Nike adverts where the geezer has got the GoPro on their chest or their head,’ he laughed. ‘They’re looking around, looking down doing skills, they’re looking around the stadium. ‘I remember running on trying to fix my gloves, and as I was running, I was like “oh my god, it feels exactly like that. I'm actually here. I've actually managed to get on the pitch”.’ Jak Alnwick’s 90th minute dismissal paved the way for Luthra to make his professional debut in the closing stages and he added: ‘It was weird. Rohan Luthra became the first South Asian goalkeeper to appear in the Championship 90+3 - Rohan Luthra comes on. Sparky makes way. (1-0) #CityAsOne pic.twitter.com/9eg3W0Xr8O — Cardiff City FC (@CardiffCityFC) March 11, 2023 ‘I've always thought when the day came I'd be nervous but I guess it all happened quickly. I didn't have any time to be nervous. It was great.’ Luthra’s appearance was not just a huge moment and source of pride for him and his family but their wider community too. By appearing at Preston, Luthra, of Indian descent, became the first goalkeeper from Britain’s South Asian community to play in the Championship. He said: ‘It's nice to hold something like that, a piece of history. I hope now I can continue doing it and hopefully keep inspiring people to want to do the same. ‘Help impact someone's life maybe by this giving them an extra push and deciding “this is what I want to do”.’ Though Luthra also hopes that eventually occasions like last Saturday will not be so notable. Luthra, who speaks with a maturity beyond his 20 years, said: ‘It shouldn't be first South Asian, first this, first that for anyone. ‘I guess that's the way it is now and hopefully in the future, towards the back end of my career I can be perceived as just a goalkeeper and not just a South Asian goalkeeper.’ The England youth international fulfilled a childhood dream by making his professional debut Luthra hails from a family of professionals and, while the importance of education was stressed, he was always encouraged to pursue his passions and his football dreams were well-supported by his family, including father Sunny and mother Zuby. ‘Without them, I’d be nowhere,’ he said of his parents. Luthra is breaking barriers and smashing stereotypes – about both his chosen position as well as profession – on his way to trying to achieve his dreams. And reflecting on how things have evolved regarding representation he said: ‘There is a slight shift happening. ‘I can see younger kids starting out from the south Asian community, getting involved and wanting to make a career in football. It is nice to see because when I was growing up I remember playing however many years of youth football and I never ever, ever saw someone who looked like me. ‘When I was really younger, there was never really that thing that clicked in my head like “there’s nobody like me.” ‘The older I got, the more I started to notice it especially going to school in Croydon were there are loads of different people with different backgrounds and I'm thinking, “right the majority of the people don't look like me.” ‘First time I actually saw someone I was shocked, taken aback. I could not believe there was someone from a South Asian background playing football and that’s horrible for me to even think that. ‘Since I’ve come to Cardiff it’s been brilliant. I’ve never thought once “I look different to everyone else” or “nobody is like me.” Everyone has taken me in and been really good with me.’ Luthra was never deterred by the lack of likeness around him in his younger days. Luthra, a national champion with Surrey, believes there has been a shift in representation Luthra said he never saw someone who looked like him when playing youth football in Croydon And along with his parents, Colin Barnes, Palace’s head of academy recruitment, a mentor he first met while at Reading’s pre-academy and was later reunited with at the Selhurst Park club, was also a pivotal figure. ‘He made me see that it doesn't matter what I look like,’ 6ft 5in stopper Luthra said. ‘As long as I worked hard anything can happen. I think he could tell that with a bit of work I could make something out of a career. I still speak to him every week now. Such an important part in my career and life really. I don’t just talk about football, I talk about life with him. Straight after [Preston] I gave him a call and he was so happy for me.’ Luthra was also a talented wicket-keeper-batsman as well as footballer when younger, playing for Surrey from the ages of nine to 16. In one summer he was just one cricket final win away from winning national titles for his county in both sports. Arsenal were among the clubs he spent time at in his early academy years where Luthra played with Bukayo Saka. ‘I was about seven but still everybody knew then that wow, this this guy could be something special. Obviously now he is something special.’ England star Saka was the first of a number of notable names Luthra has played alongside. Palace’s reputation for producing young talent such as Victor Moses, Nathaniel Clyne and Wilfried Zaha made it a ‘no brainer’ for Luthra to join them officially as an under-9. While there Luthra made his under-18s debut at 15 and now Chelsea winger Noni Madueke was among his academy teammates. Luthra also went to the renowned Whitgift School, Croydon, playing alongside Bayern Munich wonderkid Jamal Musiala, Chelsea’s Callum Hudson-Odoi and Manchester United youngster Di’Shon Bernard. ‘It was good having Callum and Di’Shon in the same school, the same teams as me,’ he smiled. Bukayo Saka is among the England players Luthra has played alongside at youth level Luthra played in the same England youth team as Noni Madueke, Tino Livramento, Jude Bellingham, Jamal Musiala and Cole Palmer ‘If Callum is there you’re always going to be second fiddle but when you have someone that good you don’t really mind. You let them do their work and bring the magic.’ Luthra, one of only two goalkeepers to feature in England’s top two divisions this season who will be eligible for England’s under-21s next term, has also worn the Three Lions at under-15s level alongside the likes of Jude Bellingham, Musiala and Madueke, another indication of his potential. Now at Cardiff, who he picked ahead of Brentford after leaving Palace in 2021, and closer to being able to show that more often on the senior stage, Luthra said: ‘Ultimately, I want to look back at my career in maybe 30 years’ time and be proud of it. I want to know that I've pushed myself to the highest level I can go and reach my potential. The potential that everybody is telling me that I've got. ‘I think I'm lucky in the respect that I don't let things get to my head ever. I'm quite a level headed person, really calm. ‘So if I continue to work how I am and have the mind-set I’ve got nothing can stop me from getting were I should be going.’ Share or comment on this article: Rohan Luthra reveals aim to keep inspiring people after his historic appearance in the Championship e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-21 18:46:55","image_url":"https://i.dailymail.co.uk/1s/2023/03/21/17/68950487-0-image-a-17_1679418400026.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"WPL: यूपी को हराकर दिल्‍ली कैपिटल्‍स का फाइनल में प्रवेश, मुंबई इंडियंस को लगा ‘करंट’, एलिमिनेटर खेलने को मजबूर","link":"https://hindi.news18.com/news/sports/cricket-womens-premier-league-playoffs-delhi-capitals-reach-in-final-after-beating-up-warriors-mumbai-indians-to-play-eliminator-5612685.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वूमेंस प्रीमियर लीग (Women's Premier League Playoffs) में दिल्‍ली कैपिटल्‍स (Delhi Capitals Final) ने सीधे फाइनल में प्रवेश कर लिया है. वहीं, मुंबई इंडियंस अब यूपी वॉरियर्स के खिलाफ एलिमिनेटर मैच खेलने को मजबूर हो गई है. खासबात यह है कि दिल्‍ली और मुंबई ने बराबर आठ में से छह मुकाबले जीते हैं.","content":"वूमेंस प्रीमियर लीग में दिल्‍ली कैपिटल्‍स ने फाइनल में प्रवेश कर लिया है. (Twitter/WPL) नई दिल्‍ली. वूमेंस प्रीमियर लीग (Women’s Premier League 2023) के आखिरी लीग मैच में यूपी वॉरियर्स पर दिल्‍ली कैपिटल्‍स पर पांच विकेट से जीत दर्ज की. इसके साथ ही दिल्‍ली कैपिटल्‍स ने मुंबई के बराबर ही आठ मैचों में छह जीत दर्ज कर ली है. हालांकि बेहतर रन रेट के आधार पर दिल्‍ली की टीम ने सीधे फाइनल में प्रवेश कर लिया है. मुंबई को एलिमिनेटर के माध्‍यम से खिताबी मैच में अपनी जगह बनानी होगी. मुंबई को अब यूपी वॉरियर के खिलाफ 24 मार्च को एलिमिनेटर मैच खेलना होगा. इस मुकाबले को जीतने वाली टीम फाइनल में प्रवेश करेगी. जिसके बाद एलिमिनेटर की विजेता का मैच 26 मार्च को मुंबई के ब्रेबोर्न स्‍टेडियम में दिल्‍ली कैपिटल्‍स के खिलाफ खेला जाएगा. मामूली अंतर से फाइनल से चूकी मुंबई इंडियंस डब्‍यूपीएल 2023 में आज यूपी और दिल्‍ली के बीच आखिरी लीग मैच खेला गया. हरमनप्रीत कौर की मुंबई इंडियंस यह उम्‍मीद कर रही थी कि यूपी इस मुकाबले को जीत जाए ताकि उन्‍हें सीधे फाइनल में जगह मिले. हालांकि ऐसा नहीं हो सका. नेट रन रेट के मामले में दिल्‍ला कैपिटल्‍स और मुंबई इंडियंस के बीच कड़ी टक्‍कर थी. अंतिम मैच के बाद दिल्‍ली का नेट रन रेट 1.856 का है. वहीं, मुंबई 1.711 के साथ दूसरे स्‍थान पर रह गई. इस मामूली अंतर के चलते मुंबई को एलिमिनेटर मैच खेलने को मजबूर होना पड़ रहा है. रोहित शर्मा की टीम का बैटर! बनना चाहता था बॉलर, बन गया भरोसेमंद बल्लेबाज, भारत को बनाएगा टेस्‍ट चैंपियन! 10वीं में 2 बार फेल, सरकारी नौकरी का कॉल लेटर फाड़ा, क्रिकेट में चमके, धोनी जैसी है ऑलराउंडर की स्‍टोरी यूपी वॉरियर्स ने आठ मैचों में से चार मुकाबलों में जीत दर्ज की है. आठ अंकों के साथ वो प्‍वाइंट्स टेबल पर तीसरे स्‍थान पर हैं. चौथे नंबर की टीम रॉयल चैलेंजर्स बैंगलोर ने आठ में से दो मैच ही जीते हैं. आखिरी स्‍थान पर मौजूद गुजरात जायंट्स ने भी आठ में से दो मुकाबले ही जीते हैं. आखिरी दो टीमों ने टूर्नामेंट के दौरान कोई संघर्ष नहीं दिखाया. जिसका फायदा मुंबई और दिल्‍ली की टीम को प्‍वाइंट्स टेबल में मिला. आज के मैच की बात की जाए तो ताहिला मैक्‍ग्रा की 32 गेंदों पर 58 रन की पारी के दम पर यूपी वॉरियर की टीम ने निर्धारित 20 ओवरों में छह विकेट के नुकसान पर 138 रन बनाए. लक्ष्‍य का पीछा करने उतरी दिल्‍ली कैपिटल्‍स की टीम ने 18वें ओवर में ही इस मुकाबले को पांच विकेट से अपने नाम कर लिया. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Cricket news , Delhi Capitals , Mumbai indians , Women's Premier League , WPL 2023 आईसीसी वर्ल्ड कप के लिए 17 खिलाड़ियों ने बनाई जगह, कोच द्रविड़ ने तैयार की लिस्ट, सूर्यकुमार यादव बाहर या अंदर? रोहित शर्मा की टीम का बैटर! बनना चाहता था बॉलर, बन गया भरोसेमंद बल्लेबाज, भारत को बनाएगा टेस्‍ट चैंपियन! फिल्मों में हुए फ्लॉप, पत्नी ने भी दिया तलाक, फिर पलटा एक्टर का नसीब, होने लगी पैसों की बारिश","pubDate":"2023-03-21 17:53:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/DC-vs-UPW-Twitter-WPL-16794206603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WI vs SA: दक्षिण अफ्रीका ने बनाया विश्व रिकॉर्ड, वनडे क्रिकेट में ऐसा करने वाली इकलौती टीम बनी","link":"https://sports.ndtv.com/hindi/cricket/wi-vs-sa-south-africa-made-world-record-became-the-only-team-to-do-so-in-odi-cricket-3881702#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WI vs SA 3rd ODI: साउथ अफ्रीका (SA) की टीम ने वेस्टइंडीज (WI) को आखिरी मुकाबले में 4 विकेट से मात देकर सीरीज बराबर कर लिया.","content":"WI vs A वेस्टइंडीज की टीम साउथ अफ्रीका दौरे पर है. जहां दो टेस्ट मुकाबलों में साउथ अफ्रीका ने दोनों ही टेस्ट मुकाबले जीत लिए. उसके बाद दोनों ही टीमों के बीच तीन वनडे मुकाबलों की सीरीज खेली जा रही है. पहला वनडे मुकाबला बारिश की भेट चढ़ गई थी और टॉस भी नहीं मुमकिन हो पाया था. दूसरे वनडे मुकाबले को वेस्टइंडीज ने 48 रनों से जीत लिया था, लेकिन वनडे मुकाबले में वापसी करते हुए साउथ अफ्रीका की टीम ने वेस्टइंडीज को आखिरी मुकाबले में 4 विकेट से मात देकर सीरीज बराबर कर लिया और ऐसा कर दक्षिण अफ्रीका ने साल 2006 में जोहान्सबर्ग के वांडरर्स में ऑस्ट्रेलिया के खिलाफ विश्व-रिकॉर्ड (South Africa World Record vs Australia) 435-रन (49.5 ओवर में 438/9) से अपने 8.78 को बेहतर बनाया. South Africa win the third and final ODI to level the series after Heinrich Klaasen's outstanding knock 👌 | 📝 तीसरे मुकाबले में धमाकेदार जीत दर्ज कर दक्षिण अफ्रीका (South Africa New Odi World Record vs WI) एकलौती ऐसी टीम बन गई जिसने 30 ओवर से कम में 250 या इससे ज्यादा के लक्ष्य का पीछा किया हो, अब ये रिकॉर्ड दक्षिण अफ्रीका टीम के साथ दर्ज हो चुकी है. दक्षिण अफ्रीका ने आज 8.95 के रन-रेट से 200 या उससे अधिक का सफल एकदिवसीय रन-चेज़ में उनका अब तक का सर्वश्रेष्ठ था. Fastest 250+ chase in ODIs : 29.3 overs - SA vs WI, today* 32.3 overs - IND vs WI, 2019 34.1 overs - ENG vs SL, 2016 35.1 overs - ENG vs WI, 2017 साउथ अफ्रीका ने टॉस जीतकर पहले गेंदबाज़ी का फैसला किया और पहले बल्लेबाज़ी करने आई वेस्टइंडीज की टीम ने 48.2 ओवर में 10 विकेट के नुकसान पर 260 रन बनाकर अफ्रीका को 50 ओवर में 261 रनों का लक्ष्य दिया, जिसे हेनरिक क्लासेन (Heinrich Klaasen Century vs West Indies) के शानदार शतक की बदौलत 29.3 ओवर में 6 विकेट के नुकसान पर हासिल कर लिया. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 17:34:39","image_url":"https://c.ndtvimg.com/2023-03/jvq8c2ig_wi-vs-sa_625x300_21_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Major League Cricket: Finch, Hasaranga, Stoinis among international signings in inaugural player draft","link":"https://thenewsmill.com/2023/03/major-league-cricket-finch-hasaranga-stoinis-among-international-signings-in-inaugural-player-draft/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The draft for the inaugural season of the Major Cricket League (MLC) saw international cricket stars like former Australian skipper Aaron Finch, star Sri Lankan all-rounder Wanindu Hasaranga, Australian all-rounder Marcus Stoinis, South African wicketkeeper-batter Quinton de Kock and former England pacer Liam Plunkett. Harmeet Singh made history on Sunday night in Houston by being named the first pick of the Major League Cricket (MLC) draft when the six MLC franchises converged at Space Center Houston to make their domestic picks and announced big international signings as the historic 2023 season prepares to take flight. Singh was selected by the Seattle Orcas, who unveiled their name and logo earlier this week. Singh, a 30-year-old all-rounder who bowls left-arm off spin, has played in the Indian Premier League (IPL) and was on the India U-19 squad that won the 2012 World Cup, along with leading the Seattle Thunderbolts to the 2022 Minor League Cricket championship. “I am really excited to be here,” Singh said as per a press release from MLC. “And also nervous at the same time. I played in Seattle in the Minor League. Now Major League Cricket. It cannot get better for me,” added Singh. The Seattle Orcas, Washington Freedom, San Francisco Unicorns, Los Angeles Knight Riders and Texas (team name still to be announced) each made nine picks with some teams announcing major international signings during the two-hour event. Former Australia one-day international captain Aaron Finch and Australia all-rounder Marcus Stoinis will join San Francisco, South Africa fast bowler Anrich Nortje and Sri Lanka legbreak bowler Wanindu Hasaranga will play for Washington and former South Africa captain and wicketkeeper Quinton de Kock as well as hard-hitting Australian all-arounder Mitchell Marsh signed for Seattle. The domestic draft Sunday night consisted of nine rounds of selections from players who are in the domestic player pool, including 16 past or present USA National Team players. Washington selected wicketkeeper Andries Gous with the second pick. Gous recently played in Abu Dhabi’s T10 league. MI New York selected USA international batter Steven Taylor with the third pick, San Francisco selected former New Zealand international and batsman Corey Anderson fourth, Los Angeles Knight Riders selected star USA Cricket bowler Ali Khan and Texas picked fast bowler Rusty Theron, who has played for multiple IPL teams, with its first pick in the first round. Several other big names were selected in the Major League Cricket draft: Unmukt Chand, who captained the India U-19 team to the 2012 World Cup, joined Los Angeles in the second round; Liam Plunkett, a star bowler for the England team that won the 2019 World Cup, joins San Francisco, and former Pakistan international Hammed Azam was taken by MI New York. In addition to USA-capped players Theron, Khan and Taylor selected in the first round, a further 13 national team players were amongst the draft selections. Current USA captain Monank Patel was drafted by MI New York, along with Nosthush Kenjige, Shayan Jahangir, Kyle Phillip and Saideep Ganesh. The Seattle Orcas selected national teamers Aaron Jones and Cameron Gannon, while Jaskaran Malhotra and 20-year-old Ali Sheikh are headed to the Los Angeles Knight Riders. The Washington Freedom picked up past USA captain Saurabh Netravalkar and Cameron Stevenson is headed to Texas along with teenager Sai Mukkamalla. Fellow teenager Sanjay Krishnamurthi stays close to his home in the Bay Area, drafted by the San Francisco Unicorns. The final ninth round — dedicated to Under-23 selections — also saw more young domestic talent offered the opportunity to play alongside some of the best players in the world this summer, with Bhaskar Yadram (LA), Matthew Tromp (Seattle) and Akhilesh Bodugum (Washington) all picked up. The 2023 MLC season starts July 13 in a brand-new cricket-specific venue – Grand Prairie Stadium – in Grand Prairie, Texas. Teams will play the explosive Twenty20 (T20) format of the game, with matches typically lasting three hours. The regular season will consist of five games, with each team playing each other once, followed by a playoff round and the championship on July 30. Teams will announce more big-name international signings as they become official, and each squad has a chance to pick another domestic player in early July based on performances in the Minor League Cricket season. (ANI)","pubDate":"2023-03-21 17:31:36","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL 2023 UPW vs DC: यूपी वारियर्स को 5 विकेट से हराकर, WPL 2023 की पहली फाइनलिस्ट टीम बनी दिल्ली कैपिटल्स","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-up-warriorz-vs-delhi-capitals-live-update-upw-vs-dc-score-3880945#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"UPW Women vs DC Women, WPL 2023: यूपी वारियर्स की टीम अब तक खेले गए 7 मुकाबलों में से 4 मुकाबले जीतकर पॉइंट्स टेबल में नंबर 3 पर बरकरार है.","content":"WPL 2023 Live: UPW-W vs DC-W दिल्ली कैपिटल्स ने महिला प्रीमियर लीग (WPL 2023) टी20 मैच में मंगलवार को यहां यूपी वॉरियर्स को पांच विकेट से शिकस्त देकर फाइनल में अपनी जगह पक्की की, दिल्ली कैपिटल्स ने यूपी वारियर्स को छह विकेट पर 138 रन पर रोकने के बाद 17.5 ओवर में पांच विकेट के नुकसान पर लक्ष्य हासिल कर लिया. उसके लिए कप्तान मेग लानिंग (Meg Lanning) ने सबसे ज्यादा 37 रन बनाये. यूपी वारियर्स ने महिला प्रीमियर लीग (WPL 2023) टी20 मैच में मंगलवार को यहां दिल्ली कैपिटल्स के खिलाफ पहले बल्लेबाजी करते हुए छह विकेट पर 138 रन बनाये. वारियर्स के लिए तहलिया मैकग्रा ने सबसे ज्यादा नाबाद 58 रन का योगदान दिया. उन्होंने 32 गेंद की पारी में आठ चौके और दो छक्के जड़े. कैपिटल्स के लिए एलिसे कैप्सी ने तीन विकेट झटके. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 17:31:25","image_url":"https://c.ndtvimg.com/2023-03/clnei5bg_dc-vs-upw_625x300_07_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL: All-round Capsey powers Delhi Capitals into final, UP Warriorz to take on MI in eliminator after five-wicket loss","link":"https://thenewsmill.com/2023/03/wpl-all-round-capsey-powers-delhi-capitals-into-final-up-warriorz-to-take-on-mi-in-eliminator-after-five-wicket-loss/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"An all-round show by Alice Capsey and quick knocks from skipper Meg Lanning and Shafali Verma helped Delhi Capitals earn a direct qualification into the final of the Women’s Premier League (WPL) after a five-wicket win over UP Warriorz in the final league stage match at Brabourne Stadium on Tuesday. DC finishes at the top spot with six wins and two losses and 12 points in total. MI has similar statistics, but has been pushed to the second due to an inferior net-run-rate. MI will take on UP Warriorz in the eliminator on March 24 to determine the second finalist. In the chase of 139 runs, Delhi Capitals continued with their template of aggressive cricket. Openers Shafali Verma and Meg Lanning went after UPW bowlers from the start. Shabnim Ismail, the veteran medium pacer from South Africa was smashed for three fours and a six by Lanning in the very first over of the inning itself. Delhi Capitals reached the 50-run mark in just 4.1 overs. This time it was Lanning’s aggression driving the chase. Soppadhandi Yashasri earned UPW their first wicket after she dismissed Shafali for a 16-ball 21, consisting of four boundaries. Sophie Ecclestone took a good catch at long-on to reduce DC to 56/1. At the end of six overs of the powerplay, DC was at 67/1, with Lanning (37*) and Jemimah Rodrigues (3*) unbeaten. Shabnim put some restrictions on DC’s run flow, dismissing Rodrigues (3) by trapping her lbw and skipper Lanning for 39 off 23 balls, consisting of five fours and two sixes. Simran Shaikh took a brilliant catch at deep midwicket. DC was at 70/3 in 6.5 overs. Alice Capsey was next up on the crease and announced her arrival by smashing Ecclestone for three fours in the ninth over and Parshavi Chopra for a six in the 10th over. At the end of 10 overs, DC was at 92/3, with Marizanne Kapp (2*) and Capsey (21*) unbeaten. At the end of 15 overs, DC was at 117/3, with Capsey (31*) and Kapp (16*) unbeaten at the crease. Kapp and Capsey reached the 50-run stand in 50 balls. Ecclestone got better of Alice, who was stumped by Healy for 34 off 31 balls. DC was at 130/4 in 16.2 overs and need nine runs to win. Jess Jonassen was next up on the crease. DC finished the chase successfully. They finished at 142/5 in 17.5 overs. Kapp hit the winning boundary to send DC into the finals. Kapp finished at 34* off 31 balls, consisting of four boundaries and a six. Arundhati Reddy was unbeaten at zero. Shabnim was the pick of the bowlers for UPW, taking 2/29 in three overs. Yashasri and Ecclestone took a wicket each. Earlier, a top bowling spell from all-rounder Alice Capsey helped Delhi Capitals reduce UP Warriorz to 138/6 in their 20 overs of the final league stage game of the Women’s Premier League (WPL) at the Brabourne Stadium in Mumbai on Tuesday. After being put to bowl first by Delhi Capitals, UP Warriorz was off to a solid start. Openers Alyssa Healy and Shweta Sehrawat added 30 runs for the first wicket. Sehrawat looked really good, finding gaps at will to hit four boundaries. But Sehrawat’s 12-ball stay at the crease was ended by Radha Yadav for 19 runs, with Jess Jonassen taking a good catch at point. UPW was 30/1 in 4.1 overs. Following this, Simran Shaikh joined skipper Healy on the crease. The duo helped UPW navigate through the remainder of the powerplay without any further damage. At the end of six overs, UPW was at 38/1, with Alyssa Healy (16*) unbeaten with Simran Shaikh (1*). UPW crossed the 50-run mark in 7.5 overs thanks to a huge six from Alyssa Healy. At the end of 10 overs, UPW was at 63/2. Alice Capsey dismissed Healy for 36 off 34 balls on the final ball of the 10th over. Taniya Bhatia stumped the batter. DC bowlers continued to create pressure on UPW batters. Radha got her second wicket, dismissing a struggling Simran for 11 off 23 balls. UPW was 71/3 in 12 overs. Following these two quick wickets, Tahlia McGrath and Kiran Navgire were the fresh pair on the crease. They attempted to rebuild innings but their efforts were disrupted as Jonassen picked the wicket of Navgire for 2 runs. Taniya delivered yet another great stumping to reduce UPW to 91/4 in 14.5 overs. At the end of 15 overs, UPW was at 92/4 with Deepti Sharma (1*) and Tahlia (19*) at the crease. The onus was on them to finish well for their sides. Capsey got her second wicket, castling Deepti Sharma for just three off eight balls. UPW was 104/5 in 17.1 overs. In the same over, she dismissed Sophie Ecclestone for a duck, reducing UPW to 105/6. Tahlia continued her fightback, bringing up her fourth WPL fifty in 30 balls. UPW finished at a modest score of 138/6, with Tahlia (58* off 32 balls, eight fours and two sixes) and Anjali Sarvani (3*) unbeaten. Capsey was the pick of the bowlers for DC, taking 3/26 in four overs. Radha Yadav ended with figures of 2/28 and Jonassen also got a wicket. Brief Scores: UPW: 138/6 (Tahlia McGrath 58*, Alyssa Healy 36, Alice Capsey 3/26) vs DC: 142/5 in 17.5 overs (Meg Lanning 39, Alice Capsey 31, Shabnim Ismail 2/29). (ANI)","pubDate":"2023-03-21 17:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"आईसीसी वर्ल्ड कप के लिए 17 खिलाड़ियों ने बनाई जगह, कोच द्रविड़ ने तैयार की लिस्ट, सूर्यकुमार यादव बाहर या अंदर?","link":"https://hindi.news18.com/photogallery/sports/cricket-rahul-dravid-says-icc-world-cup-core-team-of-18-already-prepared-few-more-to-add-reply-on-suryakumar-yadav-5612505.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम के कोच राहुल द्रविड़ ने भारत में इस साल होने वाले आईसीसी विश्व कप की कोर टीम तैयार कर ली है. ऑस्ट्रेलिया के खिलाफ चेन्नई में होने वाले 3 मैचों की वनडे सीरीज के आखिरी मैच से पहले उन्होंने मीडिया से बात करते हुए बताया कि विश्व कप के लिए 17-18 खिलाड़ियों को चुना है. सबकी नजरें सिर्फ इसी बात पर टिकी है कि जब लिस्ट सामने आएगा तो उसमें सूर्यकुमार यादव का नाम होगा या नहीं.","content":"Loading... Loading... Loading... Loading... कोच द्रविड़ ने कहा, \"मेरे ख्याल से अगर जो हम भविष्य के बारे में सोचें तो हमें जैसी टीम और जो खिलाड़ी चाहिए उसको लेकर सबकुछ साफ हैं। भारत में होने वाले वनडे वर्ल्ड कप के लिए हमने अब तक तकरीबन 17-18 खिलाड़‍ियों को चुन लिया है। कुछ खिलाड़ी ऐसे हैं जो चोट से अभी रिकवर कर रहे हैं तो उनको लेकर भी नजर बनाए हुए हैं कि वो वापसी करने में कितना वक्त लेंगे.-AP वर्ल्ड कप की टीम को लेकर कोचिंग स्टाफ और मैनेजमेंट की राय एकमत है. हम सभी काफी बेहतर तरीके से इसकी योजना बना रहे हैं और सारे बेहतर स्‍पेस में हैं. टूर्नामेंट के लिए हम किस तरह की टीम लेकर उतरने वाले हैं इसको लेकर किसी तरह से कोई भी संशय नहीं है. टीम के बारे में सबकुछ बिल्कुल साफ है.-AP हमारी कोशिश यही है कि जिन खिलाड़ियों को हमने चुना है और वो अब तक उम्मीद के मुताबिक अपना खेल नहीं दिखा पाए हैं उनको और ज्यादा से ज्यादा मौके दे पाएं. हमारे लिए ये अच्छी बात है कि इस बार का विश्व कप भारत में आयोजित हो रहा है. अगर भारत के बाहर भी यह टूर्नामेंट हो रहा होता फिर भी हम सबको ज्यादा से ज्यादा मौके देने की कोशिश करते.-AP द्रविड़ ने कहा कि हमारे पास 15 से 16 खिलाड़ियों का कॉम्बिनेशन है जिसका हम इस्तेमाल करना चाहते हैं और इसी को लेकर काम भी कर रहे हैं. वर्ल्ड कप का टूर्नामेंट काफी बड़ा है और भारत में ही इसे आयोजित किया जाना है. इसे कई शहरों में खेला जाएगा और हर जगह की परिस्थिति अलग होगी. हमारा लक्ष्य है कि टीम अलग अलग परिस्थिति में ढलने के लिए तैयार हो. जहां तेज गेंदबाजी वाली परिस्थिति मिले वहां 4 तेज गेंदबाज के साथ उतरें और जहां जरूरत हो 3 स्पिनर लेकर भी उतर सकें.-AFP सूर्यकुमार यादव के बारे में द्रव‍िड़ ने कहा, सूर्यकुमार को लेकर ज्यादा चिंता करने जैसी कोई बात है ही नहीं. ऑस्ट्रेलिया के खिलाफ पहले दो वनडे में जिन दो गेंद पर वो आउट हुए वो बहुत ही शानदार गेंद थी. यह बात हम सबको ध्यान में रखनी चाहिए कि सूर्या अभी 50 ओवर क्रिकेट सीख रहे हैं और ये जो फॉर्मेट है वो टी20 मैच अलग होता है।-AP","pubDate":"2023-03-21 17:12:43","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/shubman-gil-and-rahul-dravid-1-1-16794183863x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"I think Chennai's pitch will favour team India\" - Wasim Jaffer on venue for 3rd ODI against Australia","link":"https://www.sportskeeda.com/cricket/news-i-think-chennai-s-pitch-will-favour-team-india-wasim-jaffer-venue-3rd-odi-australia?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-03-21 16:46:13","image_url":"https://staticc.sportskeeda.com/editor/2023/03/ce9e2-16794006496043-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"“That’s a controversial one” – Virat Kohli picks Cheteshwar Pujara as the worst runner between wickets","link":"https://www.sportskeeda.com/cricket/news-that-s-controversial-one-virat-kohli-picks-cheteshwar-pujara-worst-runner-wickets?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-03-21 16:46:13","image_url":"https://staticc.sportskeeda.com/editor/2023/03/ebd75-16794012207131-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC World Cup 2023: 5 अक्टूबर से शुरू होगा वनडे विश्वकप का महाकुंभ, 19 नवंबर को खेला जायेगा फाइनल - रिपोर्ट","link":"https://sports.ndtv.com/hindi/cricket/icc-world-cup-2023-odi-world-cup-will-start-from-october-5-the-final-will-be-played-on-november-19-report-odi-world-cup-2023-schedule-3882045#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ICC ODI World Cup 2023: रिपोर्ट में आगे कहा गया है कि भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) ने टूर्नामेंट (ODI World Cup 2023 Venue) के लिए लगभग 12 स्थानों को शॉर्टलिस्ट किया है.","content":"ICC ODI WC 2023 साल 2023 का वनडे विश्व कप भारत में होना है ऐसे में ईएसपीएन क्रिकइंफो के रिपोर्ट के अनुसार 2023 ODI विश्व कप 5 अक्टूबर से शुरू होगा और फाइनल 19 नवंबर को खेला जाएगा. रिपोर्ट में आगे कहा गया है कि भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) ने टूर्नामेंट के लिए लगभग 12 स्थानों को (ODI World Cup 2023 Venue) शॉर्टलिस्ट किया है और फाइनल अहमदाबाद के नरेंद्र मोदी स्टेडियम में होगा. इनमें अन्य स्थान हैं - बेंगलुरु, चेन्नई, दिल्ली, धर्मशाला, गुवाहाटी, हैदराबाद, कोलकाता, लखनऊ, इंदौर, राजकोट और मुंबई. टूर्नामेंट में 46 दिनों में 48 मैच होंगे, जिसमें 10 टीमें ट्रॉफी के लिए आपस में भिड़ेंगी. The 2023 ODI World Cup is likely to start on October 5, with the final scheduled to be in Ahmedabad जबकि रिपोर्ट में मुख्य स्थानों के लिए सूची दी गई है, बोर्ड से टूर्नामेंट से पहले वार्म-अप मैचों के लिए 2-3 और स्थानों की घोषणा करने की उम्मीद है. विकल्पों के पीछे मुख्य कारक बारिश की संभावना और मैदान को समय पर तैयार करने के लिए आवश्यक बुनियादी ढांचे की जरुरत होगी. विश्व कप के कार्यक्रमों की घोषणा आम तौर पर एक साल पहले की जाती है, अंतर्राष्ट्रीय क्रिकेट परिषद (ICC) अभी भी पाकिस्तान के क्रिकेटरों की वीजा स्थिति और भारत सरकार की पेशकश पर टैक्स छूट की स्थिति को समझने का इंतजार कर रही है. BCCI और ICC द्वारा हस्ताक्षरित एक समझौते के हिस्से के रूप में, 2016 से 2023 तक तीन टूर्नामेंटों के लिए टैक्स छूट का वादा किया गया था. रिपोर्ट में दावा किया गया कि BCCI ICC (टूर्नामेंट में शामिल अन्य व्यावसायिक संस्थाओं के साथ) कर छूट के साथ मदद करने के लिए \"बाध्य\" था. दूसरी ओर, पाकिस्तानी क्रिकेटरों ने किसी भी टूर्नामेंट के लिए 2013 के बाद से भारत की यात्रा नहीं की है, लेकिन बीसीसीआई (BCCI on Pakistan Team Visa) ने स्पष्ट कर दिया है कि उनके वीजा को भारत सरकार द्वारा मंजूरी दी जाएगी. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 19:02:03","image_url":"https://c.ndtvimg.com/2019-05/8i441bb8_icc-world-cup-trophy_625x300_29_May_19.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rohan Luthra reveals aim to keep inspiring people after his historic appearance in the Championship","link":"https://www.dailymail.co.uk/sport/football/article-11886437/Rohan-Luthra-reveals-aim-inspiring-people-historic-appearance-Championship.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"At Preston last weekend, the moment Cardiff goalkeeper Rohan Luthra had worked years for finally arrived. It was genuinely happening. And all of a sudden, things turned very surreal.","content":"EXCLUSIVE: Cardiff's Rohan Luthra reveals desire to 'keep inspiring people' after becoming the first British goalkeeper from the South Asian community to play in Championship Rohan Luthra came off the bench to make his professional debut for Cardiff Luthra became the first by British South Asian goalkeeper in the second tier The England youth international hopes to have broken a barrier for others By Adrian Kajumba For Mailonline Published: 17:20, 21 March 2023 | Updated: 18:46, 21 March 2023 e-mail View comments At Preston last weekend, the moment Cardiff goalkeeper Rohan Luthra had worked years for finally arrived. It was genuinely happening. And all of a sudden, things turned very surreal. ‘It felt like one of those old school Nike adverts where the geezer has got the GoPro on their chest or their head,’ he laughed. ‘They’re looking around, looking down doing skills, they’re looking around the stadium. ‘I remember running on trying to fix my gloves, and as I was running, I was like “oh my god, it feels exactly like that. I'm actually here. I've actually managed to get on the pitch”.’ Jak Alnwick’s 90th minute dismissal paved the way for Luthra to make his professional debut in the closing stages and he added: ‘It was weird. Rohan Luthra became the first South Asian goalkeeper to appear in the Championship 90+3 - Rohan Luthra comes on. Sparky makes way. (1-0) #CityAsOne pic.twitter.com/9eg3W0Xr8O — Cardiff City FC (@CardiffCityFC) March 11, 2023 ‘I've always thought when the day came I'd be nervous but I guess it all happened quickly. I didn't have any time to be nervous. It was great.’ Luthra’s appearance was not just a huge moment and source of pride for him and his family but their wider community too. By appearing at Preston, Luthra, of Indian descent, became the first goalkeeper from Britain’s South Asian community to play in the Championship. He said: ‘It's nice to hold something like that, a piece of history. I hope now I can continue doing it and hopefully keep inspiring people to want to do the same. ‘Help impact someone's life maybe by this giving them an extra push and deciding “this is what I want to do”.’ Though Luthra also hopes that eventually occasions like last Saturday will not be so notable. Luthra, who speaks with a maturity beyond his 20 years, said: ‘It shouldn't be first South Asian, first this, first that for anyone. ‘I guess that's the way it is now and hopefully in the future, towards the back end of my career I can be perceived as just a goalkeeper and not just a South Asian goalkeeper.’ The England youth international fulfilled a childhood dream by making his professional debut Luthra hails from a family of professionals and, while the importance of education was stressed, he was always encouraged to pursue his passions and his football dreams were well-supported by his family, including father Sunny and mother Zuby. ‘Without them, I’d be nowhere,’ he said of his parents. Luthra is breaking barriers and smashing stereotypes – about both his chosen position as well as profession – on his way to trying to achieve his dreams. And reflecting on how things have evolved regarding representation he said: ‘There is a slight shift happening. ‘I can see younger kids starting out from the south Asian community, getting involved and wanting to make a career in football. It is nice to see because when I was growing up I remember playing however many years of youth football and I never ever, ever saw someone who looked like me. ‘When I was really younger, there was never really that thing that clicked in my head like “there’s nobody like me.” ‘The older I got, the more I started to notice it especially going to school in Croydon were there are loads of different people with different backgrounds and I'm thinking, “right the majority of the people don't look like me.” ‘First time I actually saw someone I was shocked, taken aback. I could not believe there was someone from a South Asian background playing football and that’s horrible for me to even think that. ‘Since I’ve come to Cardiff it’s been brilliant. I’ve never thought once “I look different to everyone else” or “nobody is like me.” Everyone has taken me in and been really good with me.’ Luthra was never deterred by the lack of likeness around him in his younger days. Luthra, a national champion with Surrey, believes there has been a shift in representation Luthra said he never saw someone who looked like him when playing youth football in Croydon And along with his parents, Colin Barnes, Palace’s head of academy recruitment, a mentor he first met while at Reading’s pre-academy and was later reunited with at the Selhurst Park club, was also a pivotal figure. ‘He made me see that it doesn't matter what I look like,’ 6ft 5in stopper Luthra said. ‘As long as I worked hard anything can happen. I think he could tell that with a bit of work I could make something out of a career. I still speak to him every week now. Such an important part in my career and life really. I don’t just talk about football, I talk about life with him. Straight after [Preston] I gave him a call and he was so happy for me.’ Luthra was also a talented wicket-keeper-batsman as well as footballer when younger, playing for Surrey from the ages of nine to 16. In one summer he was just one cricket final win away from winning national titles for his county in both sports. Arsenal were among the clubs he spent time at in his early academy years where Luthra played with Bukayo Saka. ‘I was about seven but still everybody knew then that wow, this this guy could be something special. Obviously now he is something special.’ England star Saka was the first of a number of notable names Luthra has played alongside. Palace’s reputation for producing young talent such as Victor Moses, Nathaniel Clyne and Wilfried Zaha made it a ‘no brainer’ for Luthra to join them officially as an under-9. While there Luthra made his under-18s debut at 15 and now Chelsea winger Noni Madueke was among his academy teammates. Luthra also went to the renowned Whitgift School, Croydon, playing alongside Bayern Munich wonderkid Jamal Musiala, Chelsea’s Callum Hudson-Odoi and Manchester United youngster Di’Shon Bernard. ‘It was good having Callum and Di’Shon in the same school, the same teams as me,’ he smiled. Bukayo Saka is among the England players Luthra has played alongside at youth level Luthra played in the same England youth team as Noni Madueke, Tino Livramento, Jude Bellingham, Jamal Musiala and Cole Palmer ‘If Callum is there you’re always going to be second fiddle but when you have someone that good you don’t really mind. You let them do their work and bring the magic.’ Luthra, one of only two goalkeepers to feature in England’s top two divisions this season who will be eligible for England’s under-21s next term, has also worn the Three Lions at under-15s level alongside the likes of Jude Bellingham, Musiala and Madueke, another indication of his potential. Now at Cardiff, who he picked ahead of Brentford after leaving Palace in 2021, and closer to being able to show that more often on the senior stage, Luthra said: ‘Ultimately, I want to look back at my career in maybe 30 years’ time and be proud of it. I want to know that I've pushed myself to the highest level I can go and reach my potential. The potential that everybody is telling me that I've got. ‘I think I'm lucky in the respect that I don't let things get to my head ever. I'm quite a level headed person, really calm. ‘So if I continue to work how I am and have the mind-set I’ve got nothing can stop me from getting were I should be going.’ Share or comment on this article: Rohan Luthra reveals aim to keep inspiring people after his historic appearance in the Championship e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-21 18:46:55","image_url":"https://i.dailymail.co.uk/1s/2023/03/21/17/68950487-0-image-a-17_1679418400026.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"WPL: यूपी को हराकर दिल्‍ली कैपिटल्‍स का फाइनल में प्रवेश, मुंबई इंडियंस को लगा ‘करंट’, एलिमिनेटर खेलने को मजबूर","link":"https://hindi.news18.com/news/sports/cricket-womens-premier-league-playoffs-delhi-capitals-reach-in-final-after-beating-up-warriors-mumbai-indians-to-play-eliminator-5612685.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वूमेंस प्रीमियर लीग (Women's Premier League Playoffs) में दिल्‍ली कैपिटल्‍स (Delhi Capitals Final) ने सीधे फाइनल में प्रवेश कर लिया है. वहीं, मुंबई इंडियंस अब यूपी वॉरियर्स के खिलाफ एलिमिनेटर मैच खेलने को मजबूर हो गई है. खासबात यह है कि दिल्‍ली और मुंबई ने बराबर आठ में से छह मुकाबले जीते हैं.","content":"वूमेंस प्रीमियर लीग में दिल्‍ली कैपिटल्‍स ने फाइनल में प्रवेश कर लिया है. (Twitter/WPL) नई दिल्‍ली. वूमेंस प्रीमियर लीग (Women’s Premier League 2023) के आखिरी लीग मैच में यूपी वॉरियर्स पर दिल्‍ली कैपिटल्‍स पर पांच विकेट से जीत दर्ज की. इसके साथ ही दिल्‍ली कैपिटल्‍स ने मुंबई के बराबर ही आठ मैचों में छह जीत दर्ज कर ली है. हालांकि बेहतर रन रेट के आधार पर दिल्‍ली की टीम ने सीधे फाइनल में प्रवेश कर लिया है. मुंबई को एलिमिनेटर के माध्‍यम से खिताबी मैच में अपनी जगह बनानी होगी. मुंबई को अब यूपी वॉरियर के खिलाफ 24 मार्च को एलिमिनेटर मैच खेलना होगा. इस मुकाबले को जीतने वाली टीम फाइनल में प्रवेश करेगी. जिसके बाद एलिमिनेटर की विजेता का मैच 26 मार्च को मुंबई के ब्रेबोर्न स्‍टेडियम में दिल्‍ली कैपिटल्‍स के खिलाफ खेला जाएगा. मामूली अंतर से फाइनल से चूकी मुंबई इंडियंस डब्‍यूपीएल 2023 में आज यूपी और दिल्‍ली के बीच आखिरी लीग मैच खेला गया. हरमनप्रीत कौर की मुंबई इंडियंस यह उम्‍मीद कर रही थी कि यूपी इस मुकाबले को जीत जाए ताकि उन्‍हें सीधे फाइनल में जगह मिले. हालांकि ऐसा नहीं हो सका. नेट रन रेट के मामले में दिल्‍ला कैपिटल्‍स और मुंबई इंडियंस के बीच कड़ी टक्‍कर थी. अंतिम मैच के बाद दिल्‍ली का नेट रन रेट 1.856 का है. वहीं, मुंबई 1.711 के साथ दूसरे स्‍थान पर रह गई. इस मामूली अंतर के चलते मुंबई को एलिमिनेटर मैच खेलने को मजबूर होना पड़ रहा है. रोहित शर्मा की टीम का बैटर! बनना चाहता था बॉलर, बन गया भरोसेमंद बल्लेबाज, भारत को बनाएगा टेस्‍ट चैंपियन! 10वीं में 2 बार फेल, सरकारी नौकरी का कॉल लेटर फाड़ा, क्रिकेट में चमके, धोनी जैसी है ऑलराउंडर की स्‍टोरी यूपी वॉरियर्स ने आठ मैचों में से चार मुकाबलों में जीत दर्ज की है. आठ अंकों के साथ वो प्‍वाइंट्स टेबल पर तीसरे स्‍थान पर हैं. चौथे नंबर की टीम रॉयल चैलेंजर्स बैंगलोर ने आठ में से दो मैच ही जीते हैं. आखिरी स्‍थान पर मौजूद गुजरात जायंट्स ने भी आठ में से दो मुकाबले ही जीते हैं. आखिरी दो टीमों ने टूर्नामेंट के दौरान कोई संघर्ष नहीं दिखाया. जिसका फायदा मुंबई और दिल्‍ली की टीम को प्‍वाइंट्स टेबल में मिला. आज के मैच की बात की जाए तो ताहिला मैक्‍ग्रा की 32 गेंदों पर 58 रन की पारी के दम पर यूपी वॉरियर की टीम ने निर्धारित 20 ओवरों में छह विकेट के नुकसान पर 138 रन बनाए. लक्ष्‍य का पीछा करने उतरी दिल्‍ली कैपिटल्‍स की टीम ने 18वें ओवर में ही इस मुकाबले को पांच विकेट से अपने नाम कर लिया. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Cricket news , Delhi Capitals , Mumbai indians , Women's Premier League , WPL 2023 आईसीसी वर्ल्ड कप के लिए 17 खिलाड़ियों ने बनाई जगह, कोच द्रविड़ ने तैयार की लिस्ट, सूर्यकुमार यादव बाहर या अंदर? रोहित शर्मा की टीम का बैटर! बनना चाहता था बॉलर, बन गया भरोसेमंद बल्लेबाज, भारत को बनाएगा टेस्‍ट चैंपियन! फिल्मों में हुए फ्लॉप, पत्नी ने भी दिया तलाक, फिर पलटा एक्टर का नसीब, होने लगी पैसों की बारिश","pubDate":"2023-03-21 17:53:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/DC-vs-UPW-Twitter-WPL-16794206603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WI vs SA: दक्षिण अफ्रीका ने बनाया विश्व रिकॉर्ड, वनडे क्रिकेट में ऐसा करने वाली इकलौती टीम बनी","link":"https://sports.ndtv.com/hindi/cricket/wi-vs-sa-south-africa-made-world-record-became-the-only-team-to-do-so-in-odi-cricket-3881702#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WI vs SA 3rd ODI: साउथ अफ्रीका (SA) की टीम ने वेस्टइंडीज (WI) को आखिरी मुकाबले में 4 विकेट से मात देकर सीरीज बराबर कर लिया.","content":"WI vs A वेस्टइंडीज की टीम साउथ अफ्रीका दौरे पर है. जहां दो टेस्ट मुकाबलों में साउथ अफ्रीका ने दोनों ही टेस्ट मुकाबले जीत लिए. उसके बाद दोनों ही टीमों के बीच तीन वनडे मुकाबलों की सीरीज खेली जा रही है. पहला वनडे मुकाबला बारिश की भेट चढ़ गई थी और टॉस भी नहीं मुमकिन हो पाया था. दूसरे वनडे मुकाबले को वेस्टइंडीज ने 48 रनों से जीत लिया था, लेकिन वनडे मुकाबले में वापसी करते हुए साउथ अफ्रीका की टीम ने वेस्टइंडीज को आखिरी मुकाबले में 4 विकेट से मात देकर सीरीज बराबर कर लिया और ऐसा कर दक्षिण अफ्रीका ने साल 2006 में जोहान्सबर्ग के वांडरर्स में ऑस्ट्रेलिया के खिलाफ विश्व-रिकॉर्ड (South Africa World Record vs Australia) 435-रन (49.5 ओवर में 438/9) से अपने 8.78 को बेहतर बनाया. South Africa win the third and final ODI to level the series after Heinrich Klaasen's outstanding knock 👌 | 📝 तीसरे मुकाबले में धमाकेदार जीत दर्ज कर दक्षिण अफ्रीका (South Africa New Odi World Record vs WI) एकलौती ऐसी टीम बन गई जिसने 30 ओवर से कम में 250 या इससे ज्यादा के लक्ष्य का पीछा किया हो, अब ये रिकॉर्ड दक्षिण अफ्रीका टीम के साथ दर्ज हो चुकी है. दक्षिण अफ्रीका ने आज 8.95 के रन-रेट से 200 या उससे अधिक का सफल एकदिवसीय रन-चेज़ में उनका अब तक का सर्वश्रेष्ठ था. Fastest 250+ chase in ODIs : 29.3 overs - SA vs WI, today* 32.3 overs - IND vs WI, 2019 34.1 overs - ENG vs SL, 2016 35.1 overs - ENG vs WI, 2017 साउथ अफ्रीका ने टॉस जीतकर पहले गेंदबाज़ी का फैसला किया और पहले बल्लेबाज़ी करने आई वेस्टइंडीज की टीम ने 48.2 ओवर में 10 विकेट के नुकसान पर 260 रन बनाकर अफ्रीका को 50 ओवर में 261 रनों का लक्ष्य दिया, जिसे हेनरिक क्लासेन (Heinrich Klaasen Century vs West Indies) के शानदार शतक की बदौलत 29.3 ओवर में 6 विकेट के नुकसान पर हासिल कर लिया. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 17:34:39","image_url":"https://c.ndtvimg.com/2023-03/jvq8c2ig_wi-vs-sa_625x300_21_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Major League Cricket: Finch, Hasaranga, Stoinis among international signings in inaugural player draft","link":"https://thenewsmill.com/2023/03/major-league-cricket-finch-hasaranga-stoinis-among-international-signings-in-inaugural-player-draft/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The draft for the inaugural season of the Major Cricket League (MLC) saw international cricket stars like former Australian skipper Aaron Finch, star Sri Lankan all-rounder Wanindu Hasaranga, Australian all-rounder Marcus Stoinis, South African wicketkeeper-batter Quinton de Kock and former England pacer Liam Plunkett. Harmeet Singh made history on Sunday night in Houston by being named the first pick of the Major League Cricket (MLC) draft when the six MLC franchises converged at Space Center Houston to make their domestic picks and announced big international signings as the historic 2023 season prepares to take flight. Singh was selected by the Seattle Orcas, who unveiled their name and logo earlier this week. Singh, a 30-year-old all-rounder who bowls left-arm off spin, has played in the Indian Premier League (IPL) and was on the India U-19 squad that won the 2012 World Cup, along with leading the Seattle Thunderbolts to the 2022 Minor League Cricket championship. “I am really excited to be here,” Singh said as per a press release from MLC. “And also nervous at the same time. I played in Seattle in the Minor League. Now Major League Cricket. It cannot get better for me,” added Singh. The Seattle Orcas, Washington Freedom, San Francisco Unicorns, Los Angeles Knight Riders and Texas (team name still to be announced) each made nine picks with some teams announcing major international signings during the two-hour event. Former Australia one-day international captain Aaron Finch and Australia all-rounder Marcus Stoinis will join San Francisco, South Africa fast bowler Anrich Nortje and Sri Lanka legbreak bowler Wanindu Hasaranga will play for Washington and former South Africa captain and wicketkeeper Quinton de Kock as well as hard-hitting Australian all-arounder Mitchell Marsh signed for Seattle. The domestic draft Sunday night consisted of nine rounds of selections from players who are in the domestic player pool, including 16 past or present USA National Team players. Washington selected wicketkeeper Andries Gous with the second pick. Gous recently played in Abu Dhabi’s T10 league. MI New York selected USA international batter Steven Taylor with the third pick, San Francisco selected former New Zealand international and batsman Corey Anderson fourth, Los Angeles Knight Riders selected star USA Cricket bowler Ali Khan and Texas picked fast bowler Rusty Theron, who has played for multiple IPL teams, with its first pick in the first round. Several other big names were selected in the Major League Cricket draft: Unmukt Chand, who captained the India U-19 team to the 2012 World Cup, joined Los Angeles in the second round; Liam Plunkett, a star bowler for the England team that won the 2019 World Cup, joins San Francisco, and former Pakistan international Hammed Azam was taken by MI New York. In addition to USA-capped players Theron, Khan and Taylor selected in the first round, a further 13 national team players were amongst the draft selections. Current USA captain Monank Patel was drafted by MI New York, along with Nosthush Kenjige, Shayan Jahangir, Kyle Phillip and Saideep Ganesh. The Seattle Orcas selected national teamers Aaron Jones and Cameron Gannon, while Jaskaran Malhotra and 20-year-old Ali Sheikh are headed to the Los Angeles Knight Riders. The Washington Freedom picked up past USA captain Saurabh Netravalkar and Cameron Stevenson is headed to Texas along with teenager Sai Mukkamalla. Fellow teenager Sanjay Krishnamurthi stays close to his home in the Bay Area, drafted by the San Francisco Unicorns. The final ninth round — dedicated to Under-23 selections — also saw more young domestic talent offered the opportunity to play alongside some of the best players in the world this summer, with Bhaskar Yadram (LA), Matthew Tromp (Seattle) and Akhilesh Bodugum (Washington) all picked up. The 2023 MLC season starts July 13 in a brand-new cricket-specific venue – Grand Prairie Stadium – in Grand Prairie, Texas. Teams will play the explosive Twenty20 (T20) format of the game, with matches typically lasting three hours. The regular season will consist of five games, with each team playing each other once, followed by a playoff round and the championship on July 30. Teams will announce more big-name international signings as they become official, and each squad has a chance to pick another domestic player in early July based on performances in the Minor League Cricket season. (ANI)","pubDate":"2023-03-21 17:31:36","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL 2023 UPW vs DC: यूपी वारियर्स को 5 विकेट से हराकर, WPL 2023 की पहली फाइनलिस्ट टीम बनी दिल्ली कैपिटल्स","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-up-warriorz-vs-delhi-capitals-live-update-upw-vs-dc-score-3880945#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"UPW Women vs DC Women, WPL 2023: यूपी वारियर्स की टीम अब तक खेले गए 7 मुकाबलों में से 4 मुकाबले जीतकर पॉइंट्स टेबल में नंबर 3 पर बरकरार है.","content":"WPL 2023 Live: UPW-W vs DC-W दिल्ली कैपिटल्स ने महिला प्रीमियर लीग (WPL 2023) टी20 मैच में मंगलवार को यहां यूपी वॉरियर्स को पांच विकेट से शिकस्त देकर फाइनल में अपनी जगह पक्की की, दिल्ली कैपिटल्स ने यूपी वारियर्स को छह विकेट पर 138 रन पर रोकने के बाद 17.5 ओवर में पांच विकेट के नुकसान पर लक्ष्य हासिल कर लिया. उसके लिए कप्तान मेग लानिंग (Meg Lanning) ने सबसे ज्यादा 37 रन बनाये. यूपी वारियर्स ने महिला प्रीमियर लीग (WPL 2023) टी20 मैच में मंगलवार को यहां दिल्ली कैपिटल्स के खिलाफ पहले बल्लेबाजी करते हुए छह विकेट पर 138 रन बनाये. वारियर्स के लिए तहलिया मैकग्रा ने सबसे ज्यादा नाबाद 58 रन का योगदान दिया. उन्होंने 32 गेंद की पारी में आठ चौके और दो छक्के जड़े. कैपिटल्स के लिए एलिसे कैप्सी ने तीन विकेट झटके. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-21 17:31:25","image_url":"https://c.ndtvimg.com/2023-03/clnei5bg_dc-vs-upw_625x300_07_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL: All-round Capsey powers Delhi Capitals into final, UP Warriorz to take on MI in eliminator after five-wicket loss","link":"https://thenewsmill.com/2023/03/wpl-all-round-capsey-powers-delhi-capitals-into-final-up-warriorz-to-take-on-mi-in-eliminator-after-five-wicket-loss/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"An all-round show by Alice Capsey and quick knocks from skipper Meg Lanning and Shafali Verma helped Delhi Capitals earn a direct qualification into the final of the Women’s Premier League (WPL) after a five-wicket win over UP Warriorz in the final league stage match at Brabourne Stadium on Tuesday. DC finishes at the top spot with six wins and two losses and 12 points in total. MI has similar statistics, but has been pushed to the second due to an inferior net-run-rate. MI will take on UP Warriorz in the eliminator on March 24 to determine the second finalist. In the chase of 139 runs, Delhi Capitals continued with their template of aggressive cricket. Openers Shafali Verma and Meg Lanning went after UPW bowlers from the start. Shabnim Ismail, the veteran medium pacer from South Africa was smashed for three fours and a six by Lanning in the very first over of the inning itself. Delhi Capitals reached the 50-run mark in just 4.1 overs. This time it was Lanning’s aggression driving the chase. Soppadhandi Yashasri earned UPW their first wicket after she dismissed Shafali for a 16-ball 21, consisting of four boundaries. Sophie Ecclestone took a good catch at long-on to reduce DC to 56/1. At the end of six overs of the powerplay, DC was at 67/1, with Lanning (37*) and Jemimah Rodrigues (3*) unbeaten. Shabnim put some restrictions on DC’s run flow, dismissing Rodrigues (3) by trapping her lbw and skipper Lanning for 39 off 23 balls, consisting of five fours and two sixes. Simran Shaikh took a brilliant catch at deep midwicket. DC was at 70/3 in 6.5 overs. Alice Capsey was next up on the crease and announced her arrival by smashing Ecclestone for three fours in the ninth over and Parshavi Chopra for a six in the 10th over. At the end of 10 overs, DC was at 92/3, with Marizanne Kapp (2*) and Capsey (21*) unbeaten. At the end of 15 overs, DC was at 117/3, with Capsey (31*) and Kapp (16*) unbeaten at the crease. Kapp and Capsey reached the 50-run stand in 50 balls. Ecclestone got better of Alice, who was stumped by Healy for 34 off 31 balls. DC was at 130/4 in 16.2 overs and need nine runs to win. Jess Jonassen was next up on the crease. DC finished the chase successfully. They finished at 142/5 in 17.5 overs. Kapp hit the winning boundary to send DC into the finals. Kapp finished at 34* off 31 balls, consisting of four boundaries and a six. Arundhati Reddy was unbeaten at zero. Shabnim was the pick of the bowlers for UPW, taking 2/29 in three overs. Yashasri and Ecclestone took a wicket each. Earlier, a top bowling spell from all-rounder Alice Capsey helped Delhi Capitals reduce UP Warriorz to 138/6 in their 20 overs of the final league stage game of the Women’s Premier League (WPL) at the Brabourne Stadium in Mumbai on Tuesday. After being put to bowl first by Delhi Capitals, UP Warriorz was off to a solid start. Openers Alyssa Healy and Shweta Sehrawat added 30 runs for the first wicket. Sehrawat looked really good, finding gaps at will to hit four boundaries. But Sehrawat’s 12-ball stay at the crease was ended by Radha Yadav for 19 runs, with Jess Jonassen taking a good catch at point. UPW was 30/1 in 4.1 overs. Following this, Simran Shaikh joined skipper Healy on the crease. The duo helped UPW navigate through the remainder of the powerplay without any further damage. At the end of six overs, UPW was at 38/1, with Alyssa Healy (16*) unbeaten with Simran Shaikh (1*). UPW crossed the 50-run mark in 7.5 overs thanks to a huge six from Alyssa Healy. At the end of 10 overs, UPW was at 63/2. Alice Capsey dismissed Healy for 36 off 34 balls on the final ball of the 10th over. Taniya Bhatia stumped the batter. DC bowlers continued to create pressure on UPW batters. Radha got her second wicket, dismissing a struggling Simran for 11 off 23 balls. UPW was 71/3 in 12 overs. Following these two quick wickets, Tahlia McGrath and Kiran Navgire were the fresh pair on the crease. They attempted to rebuild innings but their efforts were disrupted as Jonassen picked the wicket of Navgire for 2 runs. Taniya delivered yet another great stumping to reduce UPW to 91/4 in 14.5 overs. At the end of 15 overs, UPW was at 92/4 with Deepti Sharma (1*) and Tahlia (19*) at the crease. The onus was on them to finish well for their sides. Capsey got her second wicket, castling Deepti Sharma for just three off eight balls. UPW was 104/5 in 17.1 overs. In the same over, she dismissed Sophie Ecclestone for a duck, reducing UPW to 105/6. Tahlia continued her fightback, bringing up her fourth WPL fifty in 30 balls. UPW finished at a modest score of 138/6, with Tahlia (58* off 32 balls, eight fours and two sixes) and Anjali Sarvani (3*) unbeaten. Capsey was the pick of the bowlers for DC, taking 3/26 in four overs. Radha Yadav ended with figures of 2/28 and Jonassen also got a wicket. Brief Scores: UPW: 138/6 (Tahlia McGrath 58*, Alyssa Healy 36, Alice Capsey 3/26) vs DC: 142/5 in 17.5 overs (Meg Lanning 39, Alice Capsey 31, Shabnim Ismail 2/29). (ANI)","pubDate":"2023-03-21 17:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"आईसीसी वर्ल्ड कप के लिए 17 खिलाड़ियों ने बनाई जगह, कोच द्रविड़ ने तैयार की लिस्ट, सूर्यकुमार यादव बाहर या अंदर?","link":"https://hindi.news18.com/photogallery/sports/cricket-rahul-dravid-says-icc-world-cup-core-team-of-18-already-prepared-few-more-to-add-reply-on-suryakumar-yadav-5612505.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम के कोच राहुल द्रविड़ ने भारत में इस साल होने वाले आईसीसी विश्व कप की कोर टीम तैयार कर ली है. ऑस्ट्रेलिया के खिलाफ चेन्नई में होने वाले 3 मैचों की वनडे सीरीज के आखिरी मैच से पहले उन्होंने मीडिया से बात करते हुए बताया कि विश्व कप के लिए 17-18 खिलाड़ियों को चुना है. सबकी नजरें सिर्फ इसी बात पर टिकी है कि जब लिस्ट सामने आएगा तो उसमें सूर्यकुमार यादव का नाम होगा या नहीं.","content":"Loading... Loading... Loading... Loading... कोच द्रविड़ ने कहा, \"मेरे ख्याल से अगर जो हम भविष्य के बारे में सोचें तो हमें जैसी टीम और जो खिलाड़ी चाहिए उसको लेकर सबकुछ साफ हैं। भारत में होने वाले वनडे वर्ल्ड कप के लिए हमने अब तक तकरीबन 17-18 खिलाड़‍ियों को चुन लिया है। कुछ खिलाड़ी ऐसे हैं जो चोट से अभी रिकवर कर रहे हैं तो उनको लेकर भी नजर बनाए हुए हैं कि वो वापसी करने में कितना वक्त लेंगे.-AP वर्ल्ड कप की टीम को लेकर कोचिंग स्टाफ और मैनेजमेंट की राय एकमत है. हम सभी काफी बेहतर तरीके से इसकी योजना बना रहे हैं और सारे बेहतर स्‍पेस में हैं. टूर्नामेंट के लिए हम किस तरह की टीम लेकर उतरने वाले हैं इसको लेकर किसी तरह से कोई भी संशय नहीं है. टीम के बारे में सबकुछ बिल्कुल साफ है.-AP हमारी कोशिश यही है कि जिन खिलाड़ियों को हमने चुना है और वो अब तक उम्मीद के मुताबिक अपना खेल नहीं दिखा पाए हैं उनको और ज्यादा से ज्यादा मौके दे पाएं. हमारे लिए ये अच्छी बात है कि इस बार का विश्व कप भारत में आयोजित हो रहा है. अगर भारत के बाहर भी यह टूर्नामेंट हो रहा होता फिर भी हम सबको ज्यादा से ज्यादा मौके देने की कोशिश करते.-AP द्रविड़ ने कहा कि हमारे पास 15 से 16 खिलाड़ियों का कॉम्बिनेशन है जिसका हम इस्तेमाल करना चाहते हैं और इसी को लेकर काम भी कर रहे हैं. वर्ल्ड कप का टूर्नामेंट काफी बड़ा है और भारत में ही इसे आयोजित किया जाना है. इसे कई शहरों में खेला जाएगा और हर जगह की परिस्थिति अलग होगी. हमारा लक्ष्य है कि टीम अलग अलग परिस्थिति में ढलने के लिए तैयार हो. जहां तेज गेंदबाजी वाली परिस्थिति मिले वहां 4 तेज गेंदबाज के साथ उतरें और जहां जरूरत हो 3 स्पिनर लेकर भी उतर सकें.-AFP सूर्यकुमार यादव के बारे में द्रव‍िड़ ने कहा, सूर्यकुमार को लेकर ज्यादा चिंता करने जैसी कोई बात है ही नहीं. ऑस्ट्रेलिया के खिलाफ पहले दो वनडे में जिन दो गेंद पर वो आउट हुए वो बहुत ही शानदार गेंद थी. यह बात हम सबको ध्यान में रखनी चाहिए कि सूर्या अभी 50 ओवर क्रिकेट सीख रहे हैं और ये जो फॉर्मेट है वो टी20 मैच अलग होता है।-AP","pubDate":"2023-03-21 17:12:43","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/shubman-gil-and-rahul-dravid-1-1-16794183863x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"I think Chennai's pitch will favour team India\" - Wasim Jaffer on venue for 3rd ODI against Australia","link":"https://www.sportskeeda.com/cricket/news-i-think-chennai-s-pitch-will-favour-team-india-wasim-jaffer-venue-3rd-odi-australia?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-03-21 16:46:13","image_url":"https://staticc.sportskeeda.com/editor/2023/03/ce9e2-16794006496043-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"“That’s a controversial one” – Virat Kohli picks Cheteshwar Pujara as the worst runner between wickets","link":"https://www.sportskeeda.com/cricket/news-that-s-controversial-one-virat-kohli-picks-cheteshwar-pujara-worst-runner-wickets?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-03-21 16:46:13","image_url":"https://staticc.sportskeeda.com/editor/2023/03/ebd75-16794012207131-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"}]}