{"newsArray":[{"title":"WWE News: Rey Mysterio Replaced By Dominik At Advertised Appearance, Smackdown Lowdown Highlights, Smackdown In Three Minutes","link":"https://411mania.com/wrestling/wwe-news-rey-mysterio-replaced-by-dominik-at-advertised-appearance-smackdown-lowdown-highlights-smackdown-in-three-minutes/","keywords":["Rey Mysterio","Smackdown","WWE"],"creator":["Joseph Lee"],"video_url":null,"description":"– PWInsider reports that Rey Mysterio has been pulled from an advertised appearance at the Cricket Wireless store in Oklahoma City on Monday. He was[.........] The post WWE News: Rey Mysterio Replaced By Dominik At Advertised Appearance, Smackdown Lowdown Highlights, Smackdown In Three Minutes appeared first on 411MANIA.","content":"– PWInsider reports that Rey Mysterio has been pulled from an advertised appearance at the Cricket Wireless store in Oklahoma City on Monday. He was replaced by his son Dominik. This is due to Rey being moved to the Smackdown roster. Dominik bragged about it on Twitter. Now that I’ve run my dad off of RAW, looks like you’ll need a real man to show up. I’ll see you there. https://t.co/LsRrVHOjpU pic.twitter.com/mLXFKdSy5R — Dominik (@DomMysterio35) October 15, 2022 – Here are highlights from the latest episode of The Smackdown Lowdown. – WWE has also shared a clip looking at last night’s Smackdown in three minutes.","pubDate":"2022-10-15 22:57:08","image_url":null,"source_id":"411mania","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"AMR vs QUT Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Oman D10 2022, Match 4","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/amr-vs-qut-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-oman-d10-2022-match-4?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-15 22:19:36","image_url":"https://static.sportskeeda.com/editor/2022/10/8c688-16658537825431-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"John Beaton welcomes 'safety net' of VAR in Premiership","link":"https://www.glasgowtimes.co.uk/sport/23051956.john-beaton-welcomes-safety-net-var-premiership/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"IN the early days of video review systems being used in cricket and tennis, it was impossible not to field a pang of sympathy for those line judges and umpires who for the first time found their judgement under intense scrutiny.","content":"IN the early days of video review systems being used in cricket and tennis , it was impossible not to field a pang of sympathy for those line judges and umpires who for the first time found their judgement under intense scrutiny. Before Hawk-Eye, they would bark their calls or raise their index fingers with an unshakeable air of conviction. Granted, anyone watching on television at home would soon know that they weren’t getting all their calls correct but those inside Wimbledon or Lord’s remained none the wiser. The officials’ word was always the final say. Then in came the technology and soon it became apparent to all that they were as vulnerable to human imperfection like the rest of us. Those long lingering camera shots of a line judge moments after they’ve had one of their calls reversed felt like an intrusion into personal turmoil. There was no hiding place at that point. Now it is the turn of Scotland’s football officials to be placed under the video microscope when VAR makes its belated bow on Friday night. Unlike their English counterparts in the early days, our referees will follow FIFA protocol by being called over to the monitor every time a decision needs to be reviewed. It is a system that some feel undermines a referee and leaves them vulnerable but John Beaton insists a bruised ego is far better than the current way of doing this when officials find out they’ve made a match-altering mistake only after the match rather than during it. “We need to be strong and be big personalities to do this job and that’s why we’re refereeing at the top of the game in this country,” said the FIFA official. “It will be a challenge [to their self-esteem] when it comes along in big matches that you’ve not got something right. But the overriding feeling will be just glad that you got to the right decision eventually. “We need to be open-minded when looking at the screen. You can get attached to a decision and feel you have made the right decision. You want people to agree with you but you have to go to the screen and look at it fresh. What you saw on the park might not be the reality. “If we are in this for our egos we are in the wrong game. Refereeing is not the place to be if you have an ego. You make a mistake then it is highlighted on Sportscene, you read about it, all your pals tell you about it and then you need to referee the next weekend. Now that process all just gets done a bit quicker. “We don’t want to be the story. We don’t want fans, managers or players talking about us. We want to do it with the minimum of fuss. “The strapline we’re using is Minimum Interference, Maximum Benefit. It’s not about us and VAR doesn’t make it more about us. It’s about getting the decision right, allowing football to run its course and for people to be talking and writing about players and great goals and not us.” Everyone can look back with regret at a moment in the workplace that they would revisit if they could, the only difference with referees being that their mistakes are played out in public. Beaton still cringes at some of the calls he got horribly wrong in the early days and is relieved rather than worried about future errors being called back by VAR. “I remember early in my career in just my sixth or seventh Premiership game, I sent off Jamie Hamill for Hearts against Inverness,” he recalled. “The ball hit his face but I thought it hit his hand. It was a terrible decision. At that stage of my career it was a crushing blow when I was trying to establish myself. “Everyone has a catalogue of decisions where if we had VAR we would have been able to correct. It will be great that will be taken away going forward. I had a game between Andorra and Poland and sent off a player after 13 seconds for violent conduct. You can imagine how I would have felt for 89 minutes thinking ‘did I get it right?’ if we didn’t have VAR. “But we did, it was checked and I knew I could relax and focus on the rest of the game. In big games in this country – our semi-finals, finals and big league matches - it will be a massive reassurance to know when we make a big call it will be right.” Beaton believes the pressure of having to go over to visit the monitor is nothing compared to the current situation where a referee has to rely on their own judgement, their stomach turning at the possibility that they’ve got it wrong. “It is such a safety net having VAR,” he confirmed. “It takes away the feeling on the park where you aren’t sure you are 100 percent right, which is human nature. “Will it undermine us? I don’t think of it that way. I communicate during the match and shout to the VAR what I have given and they will then look at it. “I will still be in charge of the game but if I make a mistake someone has to tell me. I don’t see it as a loss of power. I see it as more power on the pitch.”","pubDate":"2022-10-15 21:30:00","image_url":"https://www.glasgowtimes.co.uk/resources/images/16050396/","source_id":"glasgowtimes","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India romp to seventh Women’s Asia Cup title with easy win over Sri Lanka","link":"https://kashmirreader.com/2022/10/16/india-romp-to-seventh-womens-asia-cup-title-with-easy-win-over-sri-lanka/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Sylhet: India maintained their dominance in the Women’s Asia Cup with an eight-wicket demolition of a self-destructing Sri Lanka in the final here on Saturday for their seventh title in eight editions. Sri Lanka, who were playing their first tournament final in 14 years, imploded after opting to bat on a slow and turning pitch. […]","content":"Sylhet: India maintained their dominance in the Women’s Asia Cup with an eight-wicket demolition of a self-destructing Sri Lanka in the final here on Saturday for their seventh title in eight editions. Sri Lanka, who were playing their first tournament final in 14 years, imploded after opting to bat on a slow and turning pitch. They could only manage 65 for nine which India knocked off in 8.3 overs. Smriti Mandhana struck a sublime 51 not out off 25 balls. It was a procession after Sri Lankan skipper Chamari Athapaththu got run out in the third over following a mix up with Anushka Sanjeewani who too got run out six balls later. Renuka, who has been in top form since the Commonwealth Games in August, sent back Hasini Perera on the very first ball she faced. The left-hander checked her shot only to be caught at cover, leaving Sri Lanka at nine for four. The Sri Lankans were in dire need of a partnership but Kavisha Dilhari’s fall made it 16 for five as she was bowled while trying to play an incoming delivery from Renuka across the line. Rajeshwari Gayakwad got her first wicket after Nilakshi de Silva played on to her stumps while trying to cut a ball close to her body. At 32 for eight, being bowled out for a sub-50 total was very much on the cards, but Ranaweera saved them from that ignominy with an unbeaten 18 off 22 balls. The Indians bowled with discipline but poor shot selection contributed more to Sri Lanka’s steep slide. After a memorable win over Pakistan in the semifinals, it seemed the occasion got the better of Sri Lanka. India lost Shafali Verma and Jemimah Rodrigues cheaply in the run chase. However, both the batters did well in the tournament, with Shafali getting back to form and Jemimah making a successful comeback from injury. The elegant Mandhana played some exquisite strokes on way to completing the formality alongside skipper Harmanpreet Kaur (11 not out off 14). Smriti’s effort included three sixes and six boundaries. Fittingly, she sealed the win with a maximum off Oshadi Ranasinghe. The win is a shot in the arm for India’s preparations for the T20 World Cup next year. They were able to test players for different roles during the competition, though that also contributed to their only loss in the tournament, against Pakistan in the league stage. The Indians took a lap of the Sylhet International Cricket Stadium and, in a fine gesture, got clicked with the entire groundstaff after their triumph, which was witnessed by a sizeable turnout. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-10-15 18:53:32","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Small talks to defuse big pressure around India-Pakistan game","link":"https://kashmirreader.com/2022/10/16/t20-world-cup-small-talks-to-defuse-big-pressure-around-india-pakistan-game/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"MELBOURNE: General chit-chats about families and cars are how players from India and Pakistan defuse the hype that surrounds a contest between the bitter neighbours, rival captains Rohit Sharma and Babar Azam said on Saturday. Bilateral cricket between the arch-rivals remains suspended, thanks to their soured political relation, and emotions run high on both sides […]","content":"MELBOURNE: General chit-chats about families and cars are how players from India and Pakistan defuse the hype that surrounds a contest between the bitter neighbours, rival captains Rohit Sharma and Babar Azam said on Saturday. Bilateral cricket between the arch-rivals remains suspended, thanks to their soured political relation, and emotions run high on both sides of the border whenever they clash in multi-team tournaments. Excitement is already building for the October 23 blockbuster between the former champions in Melbourne but India captain Rohit sought to downplay the hype around one of cricket’s greatest rivalries. “We understand the importance of the game but there’s no point talking about it every time and creating that pressure within yourself,” the batsman said at the pre-tournament captains’ interaction with the media. While fans treat every India-Pakistan contest as a battle for one-upmanship, the camaraderie between the sides was evident at the recent Asia Cup in the United Arab Emirates. Rohit and his team mates were seen wishing Shaheen Afridi a quick recovery from a knee injury while the Pakistan speedster wished for Virat Kohli’s return to form. “At the Asia Cup, and now here, whenever we meet, we talk about how things are back home, how the families are,” Rohit said. “The previous generation of cricketers told us they too used to chat about these things — ‘how’s life? Which car are you buying, or planning to buy?'”. Babar confirmed the bonhomie between the sides off the field despite the fierce rivalry on it. “We don’t even talk cricket when we meet,” the stylish opener said. “He (Rohit) is senior to me. Whenever we come across, I try to tap into his experience since he has served India for such a long time. “It’s always good to learn from someone’s experience.” The feel-good mood notwithstanding, Babar was fully aware of the importance of the match. “Any match against India is always a high-intensity contest,” said the 28-year-old. “Fans also wait for them. On the field, we enjoy it a lot and give our 100 percent.” —Agencies     KR Desk","pubDate":"2022-10-15 18:53:25","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Shaheen Afridi is fully fit, dedicated to give his 100 percent: Babar Azam","link":"https://kashmirreader.com/2022/10/16/shaheen-afridi-is-fully-fit-dedicated-to-give-his-100-percent-babar-azam/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"MELBOURNE: As Pakistan gear up to begin their T20 World Cup campaign with the highly-anticipated clash against India on Sunday at the Melbourne Cricket Ground, skipper Babar Azam said that star pacer Shaheen Shah Afridi is fully fit. Shaheen had missed the Asia Cup and the seven-match T20I series due to an injury. It would […]","content":"MELBOURNE: As Pakistan gear up to begin their T20 World Cup campaign with the highly-anticipated clash against India on Sunday at the Melbourne Cricket Ground, skipper Babar Azam said that star pacer Shaheen Shah Afridi is fully fit. Shaheen had missed the Asia Cup and the seven-match T20I series due to an injury. It would be interesting to see if the pacer, who received treatment in London, participates in the warm-up games before the encounter against India. The India-Pakistan clash in the 2022 T20 World Cup is among the most awaited sporting events of the year. “Definitely. Shaheen and Fakhar (Zaman) have come back. We have six days for the first match, so we will utilise these warm-up matches. Shaheen is fully fit and dedicated to giving his 100 per cent. So, we are looking forward to seeing him play,” Babar said when he was asked about Afridi in a press conference. “Pakistan have always come up with quality pace bowlers. Our fast-bowling lineup is also very strong. With Shaheen coming back, it will become stronger. We played with different combinations in our previous games. —Agencies Haris Rauf has improved his bowling with the new ball and at the death. We can go with different combinations,” said Babar. Talking about the high-pressure match against India, Babar said: “Whenever you play against India, it is always a high-intensity game. Fans also wait for this match, we enjoy the contest on the field. We try to play good cricket and we look to give our best.”   KR Desk","pubDate":"2022-10-15 18:52:54","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"T 20 World Cup 2022 venue list: How many venues will host 2022 ICC T20 World Cup?","link":"https://thesportsrush.com/cricket-news-t-20-world-cup-2022-venue-list-how-many-venues-will-host-2022-icc-t20-world-cup/","keywords":["Cricket","ICC T20 World Cup 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"T 20 World Cup 2022 venue list: A total of seven venues will host the matches of the imminent T20 World Cup 2022 in Australia. 16 top teams from across the world have gathered in the continent of Australia to partake in the ICC T20 World Cup 2022, which will commence with its qualifying round… The post T 20 World Cup 2022 venue list: How many venues will host 2022 ICC T20 World Cup? appeared first on The SportsRush.","content":"16 top teams from across the world have gathered in the continent of Australia to partake in the which will commence with its from October 16 onwards, with Namibia to lock horns against the Asian champions Sri Lanka in the tournament opener, at the in Geelong. The initial stage will see eight teams vying for the final four spots in the next stage – ‘ Super 12’, where two top teams from each of ‘Group A’ and Group ‘B’, will join the top eight teams as per the ICC T20I rankings. The ‘Super 12’ stage will commence from October 22 onwards, just a day after the end of the qualifying round, with Australia scheduled to take on New Zealand at what would be a full-house Sydney Cricket Ground (SCG). The grand finale of the eighth edition of the World Cup will take place on November 13, at the iconic Melbourne Cricket Ground (MCG). A total of seven venues across the whole of Australia will host a total of 16 teams, which will collectively play 45 T20I matches. The 12 matches of the qualifying round featuring eight teams, will be played across two venues in – Simonds Stadium in Geelong, and the Bellerive Oval in Hobart. The ‘Super 12’ matches will take place across a total of six venues in – Melbourne Cricket Ground (MCG), The Gabba in Brisbane, Sydney Cricket Ground (SCG), Perth Stadium, the Adelaide Oval, and the Bellerive Oval in Hobart. The first semi-final (October 9) will take place at the Adelaide Oval, while the MCG will host the second semi-final (November 10) and the grand finale (November 13). Simonds Stadium (Geelong) Bellerive Oval (Hobart) Sydney Cricket Ground (Sydney) The Gabba (Brisbane) Adelaide Oval (Adelaide) Melbourne Cricket Ground (Melbourne) Perth Stadium (Perth).","pubDate":"2022-10-15 18:52:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Australia-New Zealand T20 World Cup Super 12 opener sold out","link":"https://www.sentinelassam.com/sports/cricket/australia-new-zealand-t20-world-cup-super-12-opener-sold-out-618377","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Australia-New Zealand match at the Sydney Cricket Ground, which will open the Men's T20 World Cup Super 12 round","content":"SYDNEY: The Australia-New Zealand match at the Sydney Cricket Ground, which will open the Men's T20 World Cup Super 12 round, on Friday was officially declared a sell-out by the International Cricket Council (ICC). Hosts Australia, led by Aaron Finch, will begin their title defence of the T20 World Cup in front of a capacity crowd at the Sydney Cricket Ground in a re-match of the 2021 final against Kane Williamson-led New Zealand on Saturday. ICC also said that over 600,000 tickets have already been snapped up by fans to watch the first ever Men's T20 World Cup played in Australia. Apart from this, the India-Pakistan fixture, to be played the following night at the Melbourne Cricket Ground (MCG) on October 23, will also be played in front of a full house after additional standing room tickets released two months ago were sold within 10 minutes. \"An official T20 World Cup re-sale platform has been launched (at t20worldcup.com), providing a safe and secure way for fans to buy and sell tickets at face value and ensure as many tickets as possible are used,\" said the ICC. IANS Also Read: T20 World Cup: Warmup Series finale washed out, England beat Australia 2-0 Also watch:","pubDate":"2022-10-15 18:50:44","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402240-t.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Prithvi hits ton, Assam lose to Mumbai in Syed Mushtaq Ali Cricket","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/prithvi-hits-ton-assam-lose-to-mumbai-in-syed-mushtaq-ali-cricket-618373","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Assam suffered 61 runs defeat against Mumbai in the Syed Mushtaq Ali Cricket at Rajkot today.","content":"Our Sports Reporter GUWAHATI: Assam suffered 61 runs defeat against Mumbai in the Syed Mushtaq Ali Cricket at Rajkot today. The star of the day was Prithvi Shaw who scored his maiden T20 century on Friday. Chasing 231 to win, Assam were bowled out 169 in 19.3 overs. While Rajjakuddin (39) was the top scorer, Rahul Hazarika (26), Riyan Parag (28) and Mukhtar Hussain (25 no) were the other major contributors. Tushar Deshpande was in top form, claiming three scalps. Earlier former Team India member Prithvi Shaw played a terrific knock toying with Assam bowlers and guided Mumbai 230-3 in 20 overs. Mumbai's skipper, scored his maiden hundred in T20s, took just 61 balls to score 134 with the help of 13 boundaries and nine over boundaries. He found ideal support from Yashasvi Jaiswal, who contributed with 42 runs in a 114-run second-wicket stand. Also Read: Vidarbha beat Assam by 6 wickets in Syed Mushtaq Ali Cricket Also watch:","pubDate":"2022-10-15 18:32:05","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402236-cricke.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Men's T20 World Cup: Namibia To Face Asian Champions Sri Lanka","link":"https://sports.ndtv.com/cricket/icc-mens-t20-world-cup-namibia-to-face-asian-champions-sri-lanka-3435274","keywords":["Cricket"],"creator":["ANI"],"video_url":null,"description":"Namibia will look to extend their meteoric rise in the world of cricket when they come across Sri Lanka, who will be brimming with confidence after their Asia Cup victory last month","content":"Namibia will look to extend their meteoric rise in the world of cricket when they come across Sri Lanka, who will be brimming with confidence after their Asia Cup victory last month. Round one will begin with a bang as the first of 45 games will pit Group A favourites, Sri Lanka, against Namibia, a team with solid ambitions of making it to the Super 12 stage. The two teams are set to compete on Sunday against one another at a significant competition for second time. In the previous T20 World Cup, Namibia and Sri Lanka were drawn into the same group and faced off in their first game. Gerhard Erasmus and his team won't be remembering this match with fondness because Sri Lanka comprehensively overpowered them; Namibia was bowled out for 96, and the Lankans finished off the chase with seven wickets and more than six overs to spare. Namibia, however, put on a courageous performance in their remaining games, defeating Ireland and the Netherlands to get to the Super 12, where they also defeated Scotland. Since then, the team has gained confidence and experience, which was evident when they put on a polished performance to defeat Ireland in the mega-event warm-up game earlier this week. Namibia will be hoping for an even stronger performance this time, and they'd like to beat the Lankans to kick off their trip. On the other side, Sri Lanka, who just emerged as the Champions of Asia by defeating teams like India, Pakistan, Afghanistan, and Bangladesh on their road to the Asia Cup title, has a strong reputation to uphold going into this competition. That victory, which included five straight triumphs, put an end to a concerning run of performance since the last T20 World Cup campaign. Before winning the Asia Cup, Sri Lanka had dropped nine of their first 10 Twenty20 international matches this year. The Lankans have also brought their excellent form to Australia, as evidenced by their outstanding performance against Zimbabwe in the exhibition game. With the help of batsmen like Kusal Mendis and Wanindu Hasaranga, Dasun Shanaka's team won the game by 33 runs. When they play Namibia, they will now try to continue this momentum. Namibia squad: Gerhard Erasmus (c), JJ Smit, Divan la Cock, Stephen Baard, Nicol Loftie Eaton, Jan Frylinck, David Wiese, Ruben Trumpelmann, Zane Green, Bernard Scholtz, Tangeni Lungameni, Michael van Lingen, Ben Shikongo, Karl Birkenstock, Lohan Louwrens, Helao Ya France. Sri Lanka: Dasun Shanaka (c), Danushka Gunathilaka, Pathum Nissanka, Kusal Mendis, Charith Asalanka, Bhanuka Rajapaksa, Dhananjaya de Silva, Wanindu Hasaranga, Maheesh Theekshana, Jeffrey Vandersay, Chamika Karunaratne, Dushmantha Chameera (subject to fitness), Lahiru Kumara (subject to fitness), Dilshan Madushanka, Pramod Madushan. Promoted Standby Players: Ashen Bandara, Praveen Jayawickrema, Dinesh Chandimal, Binura Fernando, Nuwanidu Fernando.","pubDate":"2022-10-15 18:25:41","image_url":"https://c.ndtvimg.com/2021-11/oc0vedg8_namibia-afp_650x400_05_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Assam win against Delhi in Senior Women T20 Cricket at Surat","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/assam-win-against-delhi-in-senior-women-t20-cricket-at-surat-618372","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Assam defeated Delhi by six runs in the Senior Women T20 Cricket held at Surat today.","content":"Our Sports Reporter GUWAHATI: Assam defeated Delhi by six runs in the Senior Women T20 Cricket held at Surat today. Elected to bat, Assam rode on a nice batting from Uma Chetry, scored 129-4 in their 20 overs. Uma took 42 balls to score 49 with the help of 7 boundaries. Later they bowled out Delhi 123 on the last ball of the innings. Shanti Rai (3-18) was the most successful bowler for Assam. Also Read: Tinsukia defeated Dhubri, President XI win in JK Barua Cricket Also Watch:","pubDate":"2022-10-15 18:24:25","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402235-cri.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"SL vs NAM Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s Sri Lanka vs Namibia ICC T20 World Cup 2022, Simonds Stadium, Geelong, October 16","link":"https://zeenews.india.com/cricket/sl-vs-nam-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-sri-lanka-vs-namibia-icc-t20-world-cup-2022-simonds-stadium-geelong-october-16-2522393.html","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka vs Namibia Dream11 Team Prediction SL vs NAM, ICC T20 World Cup 2022 Match Preview - Check My Dream11 Team, Best players list of SL vs NAM, Sri Lanka Dream11 Team Player List, Namibia women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"The ICC Men's T20 World Cup finally kicks off from Sunday when 2014 champions Sri Lanka face Namibia at Geelong's Kardinia Park Stadium in Group A of the First Round. It will be followed by the United Arab Emirates facing off against the Netherlands later in the evening at the same venue. Sri Lanka will be in the battle for a Super 12 place alongside Namibia, UAE and the Netherlands. But the mood in the camp is buoyant after a landmark Asia Cup victory in the UAE, which is the reason behind the upbeat attitude of skipper Dasun Shanaka. Geelong is an hour's drive away from Melbourne and with the area being home to a majority of the Sri Lankan community, Shanaka hopes to see huge support for his team during first round matches. Also Read: SL vs NAM ICC T20 World Cup 2022 Preview, LIVE Streaming details: When and where to watch Sri Lanka vs Namibia online and on TV? _ Story behind Sri Lanka's jersey _ Mahela Jayawardena behind the scenes _ Who's the most handsome player in the team? The __ stars look ready for the #T20WorldCup _ — ICC (@ICC) October 15, 2022 Match Details Sri Lanka vs Namibia ICC T20 World Cup 2022 October 16, 9:30 AM Simonds Stadium, Geelong SL vs NAM, Fantasy Dream11 Team Prediction Wicket-keeper: Kusal Mendis Batsmen: Gerhard Erasmus, JJ Smit, Pathum Nissanka, Bhanuka Rajapaksa All-rounder: David Wiese, Wanindu Hassaranga, Chamika Karunaratne Bowlers: Dushmantha Chameera, Maheesh Theekshana, Ruben Trumplemann SL vs NAM, Dream11 Team Prediction: Kusal Mendis (c), JJ Smit, Gerhard Merwe Erasmus, Bhanuka Rajapaksa, David Wiese, Wanindu Hasaranga (vc), Bernard Scholtz, Ruben Trumplemann, Dushmantha Chameera, Maheesh Theekshana, Dilshan Madushanka Squads: Sri Lanka Squad: Pathum Nissanka, Kusal Mendis(w), Dhananjaya de Silva, Danushka Gunathilaka, Bhanuka Rajapaksa, Dasun Shanaka(c), Wanindu Hasaranga, Chamika Karunaratne, Pramod Madushan, Maheesh Theekshana, Dilshan Madushanka, Dushmantha Chameera, Jeffrey Vandersay, Lahiru Kumara, Charith Asalanka Namibia Squad: Stephan Baard, David Wiese, Gerhard Erasmus(c), Jan Nicol Loftie-Eaton, JJ Smit, Jan Frylinck, Pikky Ya France, Zane Green(w), Ruben Trumpelmann, Bernard Scholtz, Tangeni Lungameni, Ben Shikongo, Michael van Lingen, Lohandre Louwrens, Karl Birkenstock, Divan la Cock","pubDate":"2022-10-15 17:47:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's Asia Cup: Solid India start favourites against Sri Lanka","link":"https://www.sentinelassam.com/sports/cricket/womens-asia-cup-solid-india-start-favourites-against-sri-lanka-618370","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"A solid Indian team start as favourites to win their seventh Women's Asia Cup title when they face a confident Sri Lanka in the final of the ongoing tournament","content":"SYLHET: A solid Indian team start as favourites to win their seventh Women's Asia Cup title when they face a confident Sri Lanka in the final of the ongoing tournament at the Sylhet International Cricket Stadium on Saturday. With the Women's T20 World Cup set to be held in South Africa next year, India have been on an experimenting spree in the Asia Cup . After winning their opening match co-incidentally against Sri Lanka, India have had experiments in their subsequent matches, though it didn't work out against Pakistan. Harmanpreet's words about giving middle-order the game time, an aspect which cost them winning big knockout games in pressure situations, has been the major theme of India in the ongoing Asia Cup. With Harmanpreet and Smriti Mandhana getting runs on their good days with the bat, Jemimah Rodrigues has stood up to be a consistent performer for India. Currently sitting on top of the run-getters list with 215 runs in seven matches at an average of 71.66 and strike-rate of 137.82, Jemimah is turning out to be a force to reckon with in the T20I side. Sabbhineni Meghana has also performed well whenever she got chances, but India would be mighty pleased with how opener Shafali Verma has got back among the runs after going through a lean patch during 2022 Commonwealth Games and tour of England. Her getting runs gives India more confidence in their batting ahead of the title clash. With the ball, Deepti Sharma has thrived with the bat and ball, especially with her miserly spell of 3/7 in the semi-final against Thailand to be the leading wicket-taker in the competition with 13 scalps. Apart from her, Rajeshwari Gayakwad (seven wickets) and Sneh Rana (five wickets) have been chipping in well in a tournament where spinners have called the shots due to slow nature of the pitches. Sri Lanka, on the other hand, are in a Women's Asia Cup final after 14 years, thanks to a thrilling one-run win over Pakistan in the second semi-final. The Chamari Athapaththu-led side successfully defended 12 runs off the last two overs to enter the Asia Cup final. IANS Also Read: Women's Asia Cup: Spinners help India crush Thailand by nine wickets Also Watch:","pubDate":"2022-10-15 17:41:43","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402233-wome.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Will Be Contesting Cricket Association Of Bengal Polls, Says Sourav Ganguly - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvd2lsbC1iZS1jb250ZXN0aW5nLWNyaWNrZXQtYXNzb2NpYXRpb24tb2YtYmVuZ2FsLXBvbGxzLXNheXMtc291cmF2LWdhbmd1bHktMzQzNDg4MdIBeGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvd2lsbC1iZS1jb250ZXN0aW5nLWNyaWNrZXQtYXNzb2NpYXRpb24tb2YtYmVuZ2FsLXBvbGxzLXNheXMtc291cmF2LWdhbmd1bHktMzQzNDg4MS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Will Be Contesting Cricket Association Of Bengal Polls, Says Sourav Ganguly  NDTV SportsOutgoing BCCI president Ganguly set to contest for post of CAB president  ESPNcricinfoBCCI official's ‘no one spoke a word against Ganguly’ bombshell amid rift report  Hindustan TimesWill Be Contesting Cricket Association Of Bengal Polls: Sourav Ganguly  NDTVPost BCCI stint, Sourav Ganguly to contest CAB president election to be held on Oct 31  Republic World","content":null,"pubDate":"2022-10-15 17:40:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"International Cricket Council launches global partnership with UNICEF to empower women & girls","link":"https://www.sentinelassam.com/sports/cricket/international-cricket-council-launches-global-partnership-with-unicef-to-empower-women-girls-618366","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The International Cricket Council (ICC) and UNICEF have launched a global partnership to empower women and girls and promote inclusion and gender equality through cricket.","content":"DUBAI: The International Cricket Council (ICC) and UNICEF have launched a global partnership to empower women and girls and promote inclusion and gender equality through cricket. An ICC statement said the initiatives to drive greater gender equity along with advocacy campaigns involving some of the world's best players will form the basis of the partnership, which aims to mobilise the \"power of cricket to drive positive social change\". UNICEF and ICC will also launch 'Criiio 4 Good', a cricket for development curriculum giving girls and boys the opportunity to have a fun first experience of the game whilst learning gender-based life-skills essential for gender equity. The Criiio 4 Good programme will be an eight-week lesson plan on the fundamentals of batting, bowling and fielding. Each lesson plan has a life-skill module attached to teach participants core life skills that will promote greater gender equity. These skills include leadership, problem-solving, self-esteem, negotiation, empathy, decision-making, teamwork and goal setting. The ICC will also use its global platform to drive greater awareness of the importance of empowering women and girls and gender equity, giving some of the world's best players the opportunity to get involved in driving greater social change. IANS Also Read: ICC warns teams to be aware of new 'playing conditions' rules during T20 World Cup Also Watch:","pubDate":"2022-10-15 17:27:46","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402229-icc1.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Warmup Series finale washed out, England beat Australia 2-0","link":"https://www.sentinelassam.com/sports/cricket/t20-world-cup-warmup-series-finale-washed-out-england-beat-australia-2-0-618365","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England settled for a 2-0 series win over Australia in a warmup series for the Twenty20 Cricket World Cup after the third match was washed out on Friday following several delays for rain.","content":"CANBERRA: England settled for a 2-0 series win over Australia in a warmup series for the Twenty20 Cricket World Cup after the third match was washed out on Friday following several delays for rain. England tallied 112 for two in 12 overs after being sent in to bat in the rain-interrupted innings. Australia was 30 for three in reply when time ran out and the match was declared a no-result. Skipper Jos Buttler top-scored for England with an unbeaten 65 off 41 deliveries and shared partnerships of 56 for the second wicket with Dawid Malan (23) and 49 for the unbroken third wicket with Ben Stokes, who finished 17 not out. Australia's target was revised up to 130 in 12 overs under the Duckworth-Lewis method and the chase started badly for the host when England pacer Chris Woakes dismissed skipper Aaron Finch and No. 3 Mitchell Marsh for ducks on the first two balls of the innings. Woakes also removed Glenn Maxwell (8) in the third over and returned figures of three for four from two overs. Rain stopped play again after 3.5 overs and time ran out to resume the match. Steve Smith finished unbeaten on seven and Marcus Stoinis was not out on eight after hitting the last ball of the game for a six. Australia and England will play unofficial warmup games in Brisbane next week before the Super 12 phase of the T20 World Cup begins on October 22. Australia opens the Super 12 phase in a rematch of the 2021 final against New Zealand. England's opening game is against Afghanistan. Agencies Also Read: England skipper Jos Buttler defends call to not appeal Also watch:","pubDate":"2022-10-15 17:24:11","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402228-aust.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Geelong Cricket Stadium T20 records: Simonds Stadium T20I records and highest innings total","link":"https://thesportsrush.com/cricket-news-geelong-cricket-stadium-t20-records-simonds-stadium-t20i-records-and-highest-innings-total/","keywords":["Cricket","ICC T20 World Cup 2022","Namibia","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Geelong Cricket Stadium T20 records: Geelong will be hosting ICC T20 World Cup 2022 tournament opener tomorrow. Only a night’s sleep is left for the commencement of ICC T20 World Cup 2022. The eighth edition of the T20 World Cup will begin with the first match between Sri Lanka and Namibia to be played in… The post Geelong Cricket Stadium T20 records: Simonds Stadium T20I records and highest innings total appeared first on The SportsRush.","content":"Only a night’s sleep is left for the commencement of ICC T20 World Cup 2022. The eighth edition of the T20 World Cup will begin with the first match between Sri Lanka and Namibia to be played in Geelong in several hours from now. In what is going to be only the second international match between Sri Lanka and Namibia, it will also be the second international match at the Simonds Stadium. In fact, the stadium will be welcoming back international cricket after more than half-a-decade. The inaugural T20I here was played between Australia and Sri Lanka resulting in a nail-biting 2-wicket victory for the visitors. Barring wicket-keeper batter Kusal Mendis, no other current Sri Lankan player was part of their Playing XI back in the day. Namibia, on the other hand, will be playing their first-ever cricket match in Australia on Sunday. Considering how only a solitary international match has been played at this stadium, it should be understandable that there are a limited number of records with respect to the GMHBA Stadium. Batters Asela Gunaratne (84), Moises Henriques (56), Michael Klinger (43) and Chamara Kapugedara (32) had emerged as the best batters in the inaugural T20I here. Nuwan Kulasekara (4), Andrew Tye (3), Lasith Malinga (2), James Faulkner (2) and Vikum Sanjaya (2) had picked more than one wicket at this stadium then. Having hosted three Big Bash League 2021-22 matches earlier this year, Geelong has been venue to a total of nine Men’s T20s till date. That being said, no player taking part in the first round of this tournament (barring the above mentioned) has played here in the past. Chasing a 174-run target against the home team, Sri Lanka had scored 176/8 in 20 overs which continues to remain the highest T20I innings total, highest successful T20I run-chase and third-highest T20 innings total at the Simonds Stadium. The wait is over ⌛ Just 12 hours left for the BIG TIME ⏲️ Sri Lanka, Sri Lanka: 🎶 — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) BBL franchise Perth Scorchers has the two highest T20 innings total at this venue. While no team has ever crossed the 200-run mark here in the shortest format, Scorchers had scored 196/3 and 178/4 against Melbourne Stars and Melbourne Renegades respectively. Perth scoring 178/4 in 19 overs also remains the highest successful run-chase in Geelong T20s.","pubDate":"2022-10-15 16:58:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Brisbane Cricket Ground pitch report: The Gabba Brisbane pitch report India vs Australia warm-up match","link":"https://thesportsrush.com/cricket-news-brisbane-cricket-ground-pitch-report-the-gabba-brisbane-pitch-report-india-vs-australia-warm-up-match/","keywords":["Cricket","ICC T20 World Cup 2022","ICC T20 World Cup 2022 Warm-up match","The Gabba"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Brisbane Cricket Ground pitch report: India and Australia had faced each other during a three-match T20I series a few days ago as well. India and Australia will lock horns yet again, during their first warm-up match ahead of the ICC Men’s T20 World Cup 2022, at The Gabba, in Brisbane on October 17 (Monday). Both… The post Brisbane Cricket Ground pitch report: The Gabba Brisbane pitch report India vs Australia warm-up match appeared first on The SportsRush.","content":"India and Australia will lock horns yet again, during their first warm-up match ahead of the ICC Men’s T20 World Cup 2022, at The Gabba, in Brisbane on October 17 (Monday). Both these sides had, just three weeks ago, faced each other during a three-match T20I series in India, which the hosts had won by a margin of 2-1. Both these sides have played enough T20 matches since the previous edition of the cup, and Monday’s encounter will be a dress rehearsal of sorts for them, where they’ll look to fine tune a few aspects of their game, ahead of the mega event. : As for India, fans will have their eyes on Mohammed Shami, who was the last minute addition into the 15-member squad, as the replacement of injured Jasprit Bumrah. Shami has not played even a single T20I since the 2021 World Cup, and the two warm-up games would be crucial for him to find his groove. As for Australia, it will be more about gelling along well with each other, and get themselves focused, after having lost the recently concluded T20I series against England at home 0-2. The Brisbane Cricket Ground or The Gabba last hosted a T20I the previous week itself, when the hosts defeated West Indies by 31 runs, after posting 178/7 on the board. Known to offer decent enough bounce and carry through to the wicket-keepers, the Gabba once again, will assist the pacers especially upfront with the new ball. As for the batters, the pitch at this venue has been a high-scoring one where they have had the assistance of consistent bounce. The average score across the six T20Is at this venue is 168.8 runs. Across the total of 68 T20 matches at this venue since 2006, the average score has been 165.6 runs so far. All in all, expect the pacers to dictate terms during the aforementioned warm-up match on Monday.","pubDate":"2022-10-15 16:35:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly to contest for Cricket Association of Bengal president","link":"https://indianexpress.com/article/sports/cricket/sourav-ganguly-to-contest-for-cricket-association-of-bengal-president-8210962/","keywords":["Cricket","Sports"],"creator":["Devendra Pandey"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-15 15:50:58","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka vs Namibia head to head record in T20: SL vs NAM T20 records and stats","link":"https://thesportsrush.com/cricket-news-sri-lanka-vs-namibia-head-to-head-record-in-t20-sl-vs-nam-t20-records-and-stats/","keywords":["Cricket","ICC T20 World Cup 2022","Namibia","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sri Lanka vs Namibia head to head: The SportsRush presents for you the Head to Head statistics for SL vs NAM T20 World Cup match. The first match of ICC T20 World Cup 2022 will be played between Sri Lanka and Namibia in Geelong in about 12 hours from now. A First Round Group A… The post Sri Lanka vs Namibia head to head record in T20: SL vs NAM T20 records and stats appeared first on The SportsRush.","content":"The first match of ICC T20 World Cup 2022 will be played between Sri Lanka and Namibia in Geelong in about 12 hours from now. A will be the first of the six matches to be played at the GMHBA Stadium in this tournament. Going to be only the second T20I between these two teams, it will also be the second international match between them. The only instance of a Sri Lanka-Namibia international match was registered in Abu Dhabi just over a year ago. In what was also an ICC T20 World Cup match, it had been won comprehensively by Sri Lanka after they sealed a 97-run target with seven wickets and 39 balls remaining in the match. Sri Lanka spinner Maheesh Theekshana was awarded with a match award for picking match-winning bowling figures of 4-0-25-3. Other than Theekshana, Sri Lanka pacer Lahiru Kumara and all-rounder Wanindu Hasaranga had also picked a couple of wickets each before batter Bhanu Rajapaksa scored 42* (27) with the help of four fours and two sixes at the Sheikh Zayed Cricket Stadium. The wait is over ⌛ Just a few hours left ⏲️ Your guide to Day 1 of on The Big Time preview 📽️ — ICC (@ICC) Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-10-15 15:44:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Meet world's only blind cricket commentator: I rely on the stump microphones","link":"https://ewn.co.za/2022/10/15/meet-world-s-only-blind-cricket-commentator-i-rely-on-the-stump-microphones","keywords":null,"creator":null,"video_url":null,"description":"Dean du Plessis was born blind but has become one of Zimbabwe's best-loved cricket commentators. He attended the Pioneer School for the visually impaired in Worcester.","content":null,"pubDate":"2022-10-15 15:43:17","image_url":null,"source_id":"ewn","country":["south africa"],"category":["sports"],"language":"english"},{"title":"They have shown outstanding skill and teamwork...: PM Modi reacts as Indian women's cricket team win Asia Cup 2022","link":"https://zeenews.india.com/cricket/they-have-shown-outstanding-skill-and-teamwork-pm-modi-reacts-as-indian-womens-cricket-team-win-asia-cup-2022-2522364.html","keywords":null,"creator":null,"video_url":null,"description":"Renuka was named 'Player of the Match' for her lethal powerplay spell.","content":"Prime Minister Narendra Modi and BCCI secretary Jay Shah congratulated the Indian women's cricket team on their victory in the final of the Asia Cup on Saturday. India crushed Sri Lanka by eight wickets in the final match of the Women's Asia Cup 2022, clinching their seventh title. PM Modi applauded the team for their outstanding display of skill and teamwork to win the Women's Asia Cup. Our women cricket team makes us proud with their grit and dexterity! Congratulations to the team for winning the Women's Asia Cup. They have shown outstanding skill and teamwork. Best wishes to the players for their upcoming endeavours. https://t.co/6hq5V08Cy9 — Narendra Modi (@narendramodi) October 15, 2022 We __ are CHAMPIONS! What an amazing run by @BCCIWomen at the #AsiaCup2022 . Congratulations to @ImHarmanpreet & her team for raising the bar in women's cricket. The convincing win in the final is a testimony to #TeamIndia 's consistency and class _ pic.twitter.com/M7PJyqq0Xl — Jay Shah (@JayShah) October 15, 2022 Also Read: Happy Birthday Babar Azam: Top 5 records of Virat Kohli can be broken by Pakistan captain - In Pics The Prime Minister tweeted, \"Our women cricket team makes us proud with their grit and dexterity! Congratulations to the team for winning the Women's Asia Cup. They have shown outstanding skill and teamwork. Best wishes to the players for their upcoming endeavours.\" BCCI's secretary Jay Shah also shared a message for the women's cricket team on the victory and said that the team has elevated the game in women's cricket. Shah wrote, \"We are CHAMPIONS! What an amazing run by @BCCIWomen at the #AsiaCup2022. Congratulations to @ImHarmanpreet & her team for raising the bar in women's cricket. The convincing win in the final is a testimony to #TeamIndia 's consistency and class.\" Electing to bat first, Sri Lanka could only score 65/9 in their 20 overs. A brilliant bowling spell from pacer Renuka Singh (3/5) in the powerplay reduced Sri Lanka to 16/5 in the powerplay. Inoka Ranaweera (18*) and Oshadi Ranasinghe (13) were the only players who could touch double-digit scores. Besides Renuka, spinners Rajeshwari Gayakwad (16/2) and Sneh Rana (13/2) also bowled really well for Women in Blue. India chased down the target of 66 comfortably, finishing at 8.3 overs in 71/2, with Smriti Mandhana unbeaten at 51 off 25 balls with six fours and three sixes. Harmanpreet Kaur was unbeaten at 11 at the other end. Inoka Ranaweera (1/17) and Kavisha Dilhari (1/17) were the wicket-takers for Sri Lanka, but they did not have enough runs to defend. Renuka was named 'Player of the Match' for her lethal powerplay spell. Brief Scores: Sri Lanka: 65/9 (Inoka Ranaweera 18*, Oshadi Ranasinghe 13, Renuka Singh 3/5) lost to India: 71/2 (Smriti Mandhana 51*, Harmanpreet Kaur 11*, Inoka Ranaweera 1/17).","pubDate":"2022-10-15 15:42:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly set to become CAB president, again","link":"https://www.tribuneindia.com/news/sports/sourav-ganguly-set-to-become-cab-president-again-441628","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, October 15Outgoing BCCI chief Sourav Ganguly will be back as the president of his state unit, the Cricket Association of Bengal (CAB), the former India captain said on Saturday.Ganguly, who had to step down from the BCCI president's post as there is no precedence of anyone continuing in the top job for more than three years, had been the CAB president for four years between 2015 to 2019 before coming to the BCCI.\"Yes, I will be contesting the CAB polls. I plan to file my nomination on October 22. I have been in CAB for five years and as per Lodha Rules, I can continue for another four years,\" Ganguly told PTI.There was a strong buzz that Ganguly's elder brother Snehasish would contest in place of Avishek Dalmiya for the top post, but the former India player's nomination changes a lot of equations.\"I will finalise my panel on October 20. Let's see,\" Ganguly said.","content":"PTI New Delhi, October 15 Outgoing BCCI chief Sourav Ganguly will be back as the president of his state unit, the Cricket Association of Bengal (CAB), the former India captain said on Saturday. Ganguly, who had to step down from the BCCI president’s post as there is no precedence of anyone continuing in the top job for more than three years, had been the CAB president for four years between 2015 to 2019 before coming to the BCCI. “Yes, I will be contesting the CAB polls. I plan to file my nomination on October 22. I have been in CAB for five years and as per Lodha Rules, I can continue for another four years,” Ganguly told PTI. There was a strong buzz that Ganguly’s elder brother Snehasish would contest in place of Avishek Dalmiya for the top post, but the former India player’s nomination changes a lot of equations. “I will finalise my panel on October 20. Let’s see,” Ganguly said. #BCCI #Cricket #Sourav Ganguly","pubDate":"2022-10-15 15:40:53","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1254328704.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Will Be Contesting Cricket Association Of Bengal Polls: Sourav Ganguly","link":"https://sports.ndtv.com/cricket/will-be-contesting-cricket-association-of-bengal-polls-says-sourav-ganguly-3434881","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"Outgoing BCCI chief Sourav Ganguly could be back as the president of his state unit, the Cricket Association of Bengal (CAB), the former India captain said on Saturday","content":"Outgoing BCCI chief Sourav Ganguly could be back as the president of his state unit, the Cricket Association of Bengal (CAB), the former India captain said on Saturday. Ganguly, who had to step down from the BCCI president's post as there is no precedence of anyone continuing in the top job for more than three years, had been the CAB president for four years between 2015 to 2019 before coming to the apex body. \"Yes, I will be contesting the CAB polls. I plan to file my nomination on October 22. I have been in CAB for five years and as per Lodha rules, I can continue for another four years,\" Ganguly told PTI. There was a strong buzz that Ganguly's elder brother Snehasish would contest in place of Avishek Dalmiya for the top post, but the former India player's nomination changes a lot of equations. \"I will finalise my panel on October 20. Let's see,\" Ganguly said. Those who are tracking the developments feel that a lot will depend on what kind of decisions the powers that be in the BCCI take on the ICC chairmanship. \"With Sourav, there will always be an element of drama involved. In 2019, he beat Brijesh (Patel) for BCCI president's post in a literal photo finish with power equations changing at last moment,\" a senior BCCI official and a close witness to the events then told PTI on the condition of anonymity. \"Don't forget that there is an ICC chairman's nomination to be filed on October 20. Whether the powerful people in the BCCI have a change of heart, is the question,\" he said. As of now, Ganguly's chances of becoming the BCCI nominee for the ICC chairmanship is less than 10 percent, if one goes by the mood in the Board. If there is no change in heart among the BCCI mandarins, then Ganguly as CAB president would mean that he would remain relevant in the Board's administrative corridors in some capacity, being their representative at the various board meetings. Promoted But there are a lot of equations that are always at play, and the picture will only be clear post the BCCI's Annual General Meeting (AGM) on October 18 in Mumbai. There were rumours that Ganguly stepped down in acrimonious circumstances, but the soon-to-be IPL chairman Arun Dhumal in an interview to PTI rubbished them.","pubDate":"2022-10-15 15:19:44","image_url":"https://c.ndtvimg.com/2021-11/vbfu35eg_sourav-ganguly-afp_625x300_17_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly to contest for Cricket Association of Bengal’s president post","link":"https://sportstar.thehindu.com/cricket/sourav-ganguly-cricket-association-of-bengal-cab-president-elections-bcci-administration/article66014913.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Ganguly had earlier served as the secretary of the CAB and after the demise of Jagmohan Dalmiya, Ganguly took charge as the president of the state unit in 2015.","content":"Sourav Ganguly has confirmed that he will contest for the position of the Cricket Association of Bengal (CAB) president. Earlier this week, the members of the BCCI decided to nominate former India international and member of the 1983 World Cup-winning team Roger Binny as the new president of the Board. With the Board members not willing to give the BCCI outgoing president Ganguly another term, there were speculations about the future of Ganguly in cricket administration. While there were initial speculations that the Board could nominate Ganguly for the position of ICC chairman, the BCCI insiders indicated that it may not be the case. And with October 22 being the deadline for filing the nominations for the CAB elections, Ganguly has decided to contest for the position. “I will file the nominations on October 22 and we will decide on the panel around October 20,” Ganguly said from Kolkata. With Avishek Dalmiya moving on to the IPL (Indian Premier League) Governing Council, there was a strong buzz that Ganguly’s elder brother Snehasis could contest for the top post. However, with Ganguly entering the fray, the equations will change. Over the last few days, the rival faction was busy finalising its candidates for the CAB elections, but now with Ganguly around, it’s a huge boost for the current disposition of the CAB. When contacted, members of the other group, however, did not comment on Ganguly’s decision and took a ‘wait and watch’ approach. Ganguly had earlier served as the secretary of the CAB and after the demise of Jagmohan Dalmiya, Ganguly took charge as the president of the state unit in 2015. In 2019, he moved on to the BCCI to take charge as the president. But, according to the amended constitution, Ganguly can complete another term at the CAB before heading into cooling off period. Read more stories on Cricket.","pubDate":"2022-10-15 15:11:41","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Expecting something special from the West Indies: Daren Sammy","link":"https://www.sentinelassam.com/sports/cricket/expecting-something-special-from-the-west-indies-daren-sammy-618364","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former West Indies captain Daren Sammy feels that one can expect “something special” from the Nicholas Pooran-led side in the upcoming T20 World Cup in Australia.","content":"DUBAI: Former West Indies captain Daren Sammy feels that one can expect \"something special\" from the Nicholas Pooran-led side in the upcoming T20 World Cup in Australia. West Indies, the two-time T20 World Cup winners, have to go through the first round of the tournament in order to make it to the Super 12 stage. \"I just spoke to Nicholas Pooran and he reckons the guys are shaping up well. I have a really good feeling about this squad because we have so much talent. The batters are there as always. Kyle Mayers is such a talent and times the ball brilliantly and we know Nicholas is a match-winner. \"The good thing this time round is we have bowlers who can take wickets. We didn't know where our wickets would come from last time but this time we do. You can rely on Akeal Hosein, he's in the top 10 in the world and Odean Smith keeps improving, so it's about fine-tuning and getting the right combinations. \"I would never write off the West Indies and I have a funny feeling that something special is going to happen in Australia,\" wrote Sammy in his column for the International Cricket Council (ICC) ahead of West Indies' first match against Scotland on October 17 in Hobart. In the run-up to the T20 World Cup, West Indies have been far away from their dominating self in the shortest format of the game. They suffered losses in home series to India and New Zealand, before losing 2-0 to Australia. Moreover, in the warm-up match, they somehow managed to get the better of the UAE by 17 runs, before their warm-up match against the Netherlands was abandoned due to rain. Sammy, the captain of West Indies T20 World Cup wins in 2012 and 2016, recalled how he and former all-rounder Dwayne Bravo talked about creating a legacy for the side in T20Is. \"After the opening game of the inaugural T20 World Cup in 2007, we thought 'wow, this game is tailor-made for us West Indians'. Dwayne Bravo and I would talk about creating a legacy. We had the opportunity to do that in the T20 format and we grabbed that with both hands. \"Clive Lloyd, Sir Viv and the greats started it by winning two World Cups in the 70s, and the teams of the 80s and 90s set the standard in the Test arena. We made T20 our own for a decade and our players went on to become some of the greatest and most sought-after in the world.\" Sammy signed off by rueing that separating the T20I side after their dramatic 2016 triumph resulted in the West Indies losing a chance to give exposure to young cricketers. \"It's the last memory I have in a West Indies shirt, that was my last game, and it's a good one to remember. We created history that day, it was amazing. \"The sad thing is that after 2016 that team was dismantled. They brought the guys back in 2021 but they were way past their best. We had a chance to mix the young players in with the experienced guys and we lost a massive opportunity to become stronger.\" IANS Also Read: Sammy appointed as head coach of Saint Lucia Kings Also watch:","pubDate":"2022-10-15 15:09:09","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402227-sammg.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Women's cricket team lifts Asia Cup","link":"https://www.livemint.com/sports/cricket-news/indian-women-s-cricket-team-lifts-asia-cup-11665844215670.html","keywords":null,"creator":["Shweta Birendra Shukla"],"video_url":null,"description":"Indian Women's cricket team lifts Asia Cup","content":null,"pubDate":"2022-10-15 15:01:41","image_url":"https://images.livemint.com/img/2022/10/15/1600x900/FfHHKqVacAAbQnt_1665846149886_1665846156861_1665846156861.jpg","source_id":"livemint","country":["india"],"category":["sports"],"language":"english"},{"title":"Fakhar Zaman replaces Usman Qadir in Men's T20 World Cup","link":"https://www.sentinelassam.com/sports/cricket/fakhar-zaman-replaces-usman-qadir-in-mens-t20-world-cup-618360","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"PCB announced that left-handed batter Fakhar Zaman is included in Pakistan's squad for the Men's T20 World Cup, replacing leg-spinner Usman Qadir, who has been moved to the traveling reserves.","content":"LAHORE: The Pakistan Cricket Board (PCB) announced on Friday that left-handed batter Fakhar Zaman is included in Pakistan's squad for the Men's T20 World Cup, replacing leg-spinner Usman Qadir, who has been moved to the traveling reserves. The change, as PCB said in an official statement, was necessary as Qadir is yet to recover from a hairline fracture on his right thumb that he suffered during the September 25 T20I against England in Karachi. The leg-spinner will not be available for selection before October 22. Fakhar , earlier enlisted as a reserve player, will arrive in Brisbane from London on Saturday along with left-arm pacer Shaheen Shah Afridi, who had been undergoing rehabilitation for a right-knee injury. IANS Also Read: Fakhar Zaman climbs seven places in ICC rankings Also watch:","pubDate":"2022-10-15 14:38:59","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/15/402223-fakhar.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Meet the world's only blind cricket commentator: I rely on the stump microphones","link":"https://ewn.co.za/2022/10/15/meet-the-world-s-only-blind-cricket-commentator-i-rely-on-the-stump-microphones","keywords":null,"creator":null,"video_url":null,"description":"Dean du Plessis was born blind but has become one of Zimbabwe's best-loved cricket commentators. He attended the Pioneer School for the visually impaired in Worcester.","content":"Meet world's only blind cricket commentator: I rely on the stump microphones Dean du Plessis was born blind but has become one of Zimbabwe's best-loved cricket commentators. He attended the Pioneer School for the visually impaired in Worcester. Image of Dean du Plessis, the world's first blind cricket commentator, posted on Facebook Zimbabwe Cricket Cricket commentator Neil Manthorp Dean du Plessis Cricket commentary Blind cricket commentator Stump microphone Email Print Tweet Share Paula Luckhoff | 15 October 2022 16:13 Sara-Jayne Makwala King hears about Dean du Plessis' remarkable career and life story. - Dean du Plessis' love for cricket began in the Cape where he boarded at the Pioneer School for the visually impaired in Worcester. - The exceptional cricket commentator tells Sara-Jayne Makwala King his story. Dean du Plessis was born blind but has become one of Zimbabwe's best-loved cricket commentators. He is, in fact, the world's only visually impaired cricket commentator. Du Plessis' love for cricket began not in Zimbabwe where he grew up, but in the Cape where he boarded at the Pioneer School for the visually impaired in Worcester - formerly the School for the Blind. He tells Sara-Jane King his passion for broadcasting preceded his interest in cricket. I knew from about four or five years old, with all certainty, that I wanted to be on radio but [at that stage] I didn't understand or like the game of cricket at all. Dean du Plessis, Zimbabwean cricket commentator Down at the Pioneer School in Worcester I was just browsing through the radio stations as a very shy 14-year-old, pimpled little teenager... It was South Africa back in India after they'd been re-admitted to the international scene and all my schoolmates were talking about this... Dean du Plessis, Zimbabwean cricket commentator At this point he had a \"vague\" understanding of the game as his brother was a very good cricketer. Hearing the clamour of 80 000 fans at the SA-India match though, he finally understood what all the hype was about, du Plessis says. Although the commentary didn't mean anything to me then, I really started to really appreciate this... And the deal was sealed with the 1992 World Cup. We were all at boarding school lying in our beds at night listening to South Africa's first World Cup, played Down Under... Dean du Plessis, Zimbabwean cricket commentator That's when I became completely addicted to cricket and then I knew that, somehow, I also wanted to play a part in terms of broadcasting the game as well. Dean du Plessis, Zimbabwean cricket commentator Du Plessis' remarkable career has been going strong for over two decades now. Of course he often gets asked how he manages to do what he does. It's nothing as special as people make it out to be, he insists. \"It's just appreciating what you have around you.\" Du Plessis explains that he makes use of today's stump microphones, as all the commentators do. When the bowler comes in to bowl and gets to the crease, and as he delivers the ball... certain bowlers have a different grunt as they bowl, with others their foot drags as they get to the crease and deliver... [depending on whether they're a leg spinner or an off spinner] Dean du Plessis, Zimbabwean cricket commentator So I have my own little idiosyncrasies of identifying players just by what they do... When I'm in the commentary box I don't get any special or preferential treatment, the only time obviously when someone may help me out is when there's a graphic that appears on the screen - obviously I can't read that. Dean du Plessis, Zimbabwean cricket commentator The exceptional cricket commentator credits South African cricket writer Neil Manthorp with helping him to break into the business. Du Plessis says he still encounters the doubters, but that it's simply a case of standing tall and saying \"bring it on\". You can follow du Plessis on Twitter and also catch his podcast Dean at Stumps . Scroll up to listen to the fascinating interview with du Plessis This article first appeared on CapeTalk : Meet world's only blind cricket commentator: I rely on the stump microphones","pubDate":"2022-10-15 14:26:15","image_url":null,"source_id":"ewn","country":["south africa"],"category":["sports"],"language":"english"},{"title":"20-20 World Cup schedule: India schedule for T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-20-20-world-cup-schedule-india-schedule-for-t20-world-cup-2022/","keywords":["Cricket","India Cricket Team","ICC T20 World Cup 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India schedule for T20 World Cup 2022: India are placed in Super 12 Group 2 alongside Pakistan, South Africa and Bangladesh. Currently No. 1 ranked team in MRF Tyres ICC Men’s Rankings, India will be kicking-off their ICC T20 World Cup 2022 campaign with a high-profile clash against arch-rivals Pakistan at the Melbourne Cricket Ground.… The post 20-20 World Cup schedule: India schedule for T20 World Cup 2022 appeared first on The SportsRush.","content":"Currently No. 1 ranked team in MRF Tyres ICC Men’s Rankings, India will be kicking-off their ICC T20 World Cup 2022 campaign with a high-profile clash against arch-rivals Pakistan at the Melbourne Cricket Ground. It is noteworthy that the inaugural champions of the T20 World Cup are placed alongside South Africa and Bangladesh other than Pakistan in Super 12 Group 2. Set to be joined by two more qualifying teams, these six teams will lock horns against each other once before the Top Two qualifying for the semi-finals. As far as the ICC Rankings are concerned, India are the only team to have played more than 50 T20Is in the given period. Having also played and won the maximum number of matches in the shortest format in the last 12 months, India aren’t short on practice ahead of what is going to be the eighth T20 World Cup. It is true that a couple of key players getting injured ahead of this world event have jolted India’s preparations. Although captain Rohit Sharma with respect to their Playing XI for the first match on October 23, there is no hiding from the fact that their comprise of as many as three last-minute decisions. That being said, whatever had to happen has happened and cannot be changed. If Sharma and his men play according to their potential, which they had failed to do during ICC T20 World Cup 2021, they will still be a force to reckon with in the next one month. Having played a couple of warm-up matches against Western Australia in Perth, India have now traveled to Brisbane for . Touchdown Brisbane 📍 — BCCI (@BCCI) – India vs Pakistan in Melbourne – India vs TBA in Sydney – India vs South Africa in Perth – Bangladesh vs India in Adelaide – India vs TBA in Melbourne Click to go through full ICC T20 World Cup 2022 fixtures.","pubDate":"2022-10-15 13:59:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}