{"newsArray":[{"title":"SA20: Pretoria Capitals aiming to build on Centurion legacy","link":"https://www.thesouthafrican.com/sport/cricket/sa20-pretoria-capitals-centurion-legacy-breaking-8-january-2023/","keywords":["Cricket","Featured","Pretoria Capitals","SA20","SA20 League","South Africa","Wayne Parnell"],"creator":["James Richardson"],"video_url":null,"description":"Star allrounder Wayne Parnell says that the Pretoria Capitals are out to add to the rich legacy of cricket in Centurion.","content":"Star allrounder Wayne Parnell says that the Pretoria Capitals are out to add to the rich legacy of cricket in Centurion. Parnell has been drafted into the Pretoria Capitals group that is yet to fully assemble. Pretoria Capitals out to add to rich legacy Parnell says that the Capitals will bring their own distinct brand of cricket to the SA20. “Obviously everyone wants to win that beautiful trophy but there is a process that needs to be put in place first and what we’ve done over the last couple of days with guys flying in every other day and we will eventually have a full quota with us. We will try to play our own brand of cricket that separates us from everyone else,” Parnell said according to IOL. “Centurion is a place where there has been a lot of success. There’s pressure from the people of Pretoria to do well and we want to stay on that path.” ALSO READ: Lance Klusener tipped to coach the Proteas Ford at the head Parnell believes that the clear instruction from Graham Ford will foster success. “I think the nice thing about when Graham Ford addressed the team, he basically said everything I wanted to say,” he said. “From that point of view having management speak the same language is really important and makes leading easy because everyone is geared towards the same end goal.” Pretoria Capitals SA20 squad 1 Anrich Nortje South Africa 2 Migael Pretorius South Africa 3 Rilee Rossouw South Africa 4 Phil Salt England 5 Wayne Parnell South Africa 6 Josh Little Ireland 7 Shaun von Berg South Africa 8 Adil Rashid England 9 Cameron Delport South Africa 10 Will Jacks England 11 Theunis de Bruyn South Africa 12 Marco Marais South Africa 13 Jimmy Neesham New Zealand 14 Kusal Mendis Sri Lanka 15 Daryn Dupavillon South Africa 16 Eathan Bosch South Africa 17 Shane Dadswell South Africa","pubDate":"2023-01-08 20:06:58","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","country":["south africa"],"category":["sports"],"language":"english"},{"title":"SA20 is going to be an important moment for South African cricket: Jos Buttler","link":"https://www.sentinelassam.com/sports/cricket/sa20-is-going-to-be-an-important-moment-for-south-african-cricket-jos-buttler-632135","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Paarl Royals will be kickstarting their SA20 campaign on Tuesday","content":"NEWLANDS: Paarl Royals will be kickstarting their SA20 campaign on Tuesday, and their star wicketkeeper-batter, T20 World Cup winning captain Jos Buttler believes the team is \"capable of winning the tournament\".\"If you look through the team, there's some fantastic players in there, but then it's very much down to how we play and get the best out of ourselves and click as a unit. I'm really excited to play under David Miller's leadership and I've played with him a fair bit — the Royals also know him well and we're looking forward to him leading us,\" he said. \"There's JP Duminy as head coach, he's someone who I've played against a few times and I'm really looking forward to working alongside him. I think we have some great experience and some fantastic young players as well, so it's a nice blend,\" added Buttler who has played at Boland Park twice before with his national team. Sharing his thoughts on what South Africa's new explosive T20 league can bring to the home nation, Buttler said, \"I think leagues like the SA20 are very much at the forefront of cricket and are also paving way for the future of cricket. In my opinion, the IPL is the biggest and the best cricket tournament in the world, because of the kind of eyeballs it brings to the game. And similarly, it's really important for South African cricket to have so many IPL teams being associated with the SA20.\" He continued, \"I think franchise cricket brings the best players from the international teams and the best local talent together, and gives the domestic players an environment to thrive and flourish in. With the youngsters getting that opportunity to rub shoulders with the best in the world, it'll leave a really positive impact on the development of South African cricket and help pave a stronger environment where there is accelerated learning. So, I see the SA20 as a really important moment in South African cricket's history.\" Summing up the last year which consisted of some incredible hitting, memorable tons and some valuable titles, Buttler said, \"I was really happy with the way things obviously went in 2022. I had my best IPL season by far with the Royals, and we were disappointed not to lift the trophy, but we had a fantastic season. As a group, I think we had a really experienced and balanced team. Personally, I found some fantastic formulas and a really good mindset, and I was really pleased to contribute with the runs.\" IANS Also Read:   England captain Jos Buttler voted ICC Men's Player Also Watch:","pubDate":"2023-01-08 18:55:01","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/08/428609-josbu.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Sensational Suryakumar Yadav powers India to series win","link":"https://www.sentinelassam.com/sports/cricket/sensational-suryakumar-yadav-powers-india-to-series-win-632132","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Suryakumar Yadav's blistering unbeaten century (112 not out off 51 balls) and dominating performance by bowlers helped India thrash Sri Lanka by 91 runs in the third and final T20I and clinch three-match series 2-1","content":"RAJKOT: Suryakumar Yadav's blistering unbeaten century (112 not out off 51 balls) and dominating performance by bowlers helped India thrash Sri Lanka by 91 runs in the third and final T20I and clinch three-match series 2-1 at the Saurashtra Cricket Association Stadium, here on Saturday.With his beautiful wristy shots, Suryakumar made the opponent team feel like he isn't from the same planet, treating every bowler with disdain to power India to a mammoth total of 228/5 in 20 overs. Apart from Suryakumar, Shubman Gill played a decent knock (46 off 36) while Rahul Tripathi gave India some quickfire runs in the Power-play with his 35 off 16. In reply, openers Pathum Nissanka (15) and Kusal Mendis (23) gave Sri Lanka a solid start but they failed to build on it and kept losing wickets at regular intervals. The likes of Dasun Shanaka (23), Dhananjaya de Silva (22) and Charith Asalanka (19) got starts but couldn't score big as Sri Lanka were bowled out for 137 in 16.4 overs, losing by a huge margin of 91 runs. Arshdeep Singh was the most successful bowler for India with 3-20, while Yuzvendra Chahal (2-30), Hardik Pandya (2-30) and Umran Malik (2-31) picked two wickets each with Axar Patel also getting one wicket. Earlier, India, who won the toss and opted to bat first, lost the first wicket early as Ishan Kishan poked outside off and edged behind a swinging bouncing delivery from Madushanka in the very first over of the innings. Kishan's opening partner Shubman Gill also struggled to open his account for the first nine balls before he smashed Madushanka for six and four in back-to-back deliveries to get things going. Rahul Tripathi, who walked in to bat at No 3 again, showed his attacking intent by hitting Theekshana for three fours in an over. He smashed five fours and two sixes in his blistering innings of 35 off 16 balls to give the much-needed impetus to Indian innings. He got out, cutely steer the ball to third man and found the fielder in the 6th over. Nonetheless, Tripathi's innings meant that India finished the Power-play at 53/2, which was good after they lost Ishan in the first over as Shubman Gill was batting steadily at the other. But, it was Suryakumar Yadav, who wasted little time to get off the block and toyed with Sri Lankan bowlers by hitting them all around the park. The stylish batter got going with a four and a six off Karunaratne, driving over mid-off and executing the whip-pull. He also cracks a short ball from Hasaranga past point for a four. Theekshana sneaked in a quiet over but the visitors couldn't keep Surya quiet for too long. A four coming down the track to Karunaratne followed by a typical scoop over fine leg for a six for Suryakumar helped India past 100 in the 11th over, and also brought up his half-century stand of 29 deliveries with Gill, who was watching the ball sail over the boundary line from the other end. A boundary over extra cover brought the 14th T20I half-century for Suryakumar in just 26-balls. It was also Surya's ninth fifty-plus score (including a century) in his last 15 innings as India were 131/2 after 13 overs. After watching the Suryakumar carnage from the other end, Shubman Gill too decided to free his arms and hit Hasaranga for an 84m six over mid-wicket. However, the spinner had the last laugh as he deceived Gill by the length and bowled him, leaving India at 163-3 after 14.4 overs. Once Gill got out, the stage was set for finisher Hardik Pandya but the skipper couldn't capitalise on it and got out for just 4 runs. The next batter Deepak Hooda started his innings with a four but got out soon on a cutter from Madushanka. But, there was no stopping Suryakumar, who slammed his third T20I century in 45 balls, which was the second fastest half-century by an Indian in the shortest format of the game after Rohit Sharma, who got the milestone in just 35 deliveries against Sri Lanka as well in 2017. On the other hand, Axar Patel (21 not out off 9) continued from where he left in the previous game and played a little cameo towards the end. With both Suryakumar and Axar hitting, India scored 28 runs in the last two overs and posted a total of 228/5 in 20 overs. Brief scores: India 228/5 in 20 overs (Suryakumar Yadav 112 not out, Shubman Gill 46, Rahul Tripathi 35; Dilshan Madushanka 2-55) beat Sri Lanka 137 all out in 16.4 overs (Kusal Mendis 23, Dasun Shanaka 23; Arshdeep Singh 3/20) by 91 runs. IANS Also Read:  Patel, Suryakumar half-centuries in vain as India lose to Sri Lanka by 16 runs in T20I seriesAlso Watch:","pubDate":"2023-01-08 18:42:53","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/08/428606-surya-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant operated for ligament tear on right knee in Mumbai","link":"https://www.sentinelassam.com/sports/cricket/rishabh-pant-operated-for-ligament-tear-on-right-knee-in-mumbai-632131","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India wicketkeeper-batter Rishabh Pant, who miraculously survived a horrific car accident on December 30, was operated for a ligament tear on his right knee.","content":"MUMBAI: India wicketkeeper-batter Rishabh Pant, who miraculously survived a horrific car accident on December 30, was operated for a ligament tear on his right knee.A report by mid-day newspaper states that Pant was operated by Dr Dinshaw Pardiwala, the head of the Centre for Sports Medicine, and Director of Arthroscopy & Shoulder Service at the Kokilaben Dhirubhai Ambani hospital in Andheri West, here on Friday. \"On Friday morning at around 10.30 am Dr Pardiwala and his team conducted ligament tear surgery on his right knee, the surgery was performed for around 2 to 3 hours. The surgery went smoothly,\" said the report. The report added that the hospital didn't confirm the development, saying they would not comment on the matter due to the privacy of the patient and that the Board of Control for Cricket in India (BCCI) would release the statement. It also said after Pant was airlifted to Mumbai from Dehradun on Wednesday, doctors have been evaluating his health condition and did some basic health checks on him before the surgery happened on Friday, while adding that it will take some months for the left-handed batter to recover completely. On December 30, around 5:30am, Pant, 25, suffered multiple injuries when his car collided with a road divider and caught fire on the Delhi-Dehradun highway. The horrific car accident happened between Manglaur and Narsan in the Haridwar district in the state of Uttarakhand. Pant was initially taken to Saksham Hospital Multispecialty and Trauma Centre, before being admitted to Max Hospital, Dehradun. He was on his way to his hometown Roorkee from New Delhi and was driving his Mercedes car. The first medical update from the BCCI said Pant suffered two cuts on his forehead, a ligament tear in his right knee and has also hurt his right wrist, ankle, and toe apart from abrasion injuries on his back after the car accident. Later that evening, a medical bulletin said the results of Pant's MRI of the brain and spine came out as normal. It added that Pant also underwent plastic surgery to manage his facial injuries, lacerated wounds and abrasions. IANS Also Read:  Bollywood actress Urvashi tagged as 'stalker' as she posts pic of hospital where Rishabh Pant is admittedAlso Watch:","pubDate":"2023-01-08 18:39:03","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/08/428605-rishab.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"I don’t have to justify myself to anyone: Babar on questions over his captaincy","link":"https://kashmirreader.com/2023/01/09/i-dont-have-to-justify-myself-to-anyone-babar-on-questions-over-his-captaincy/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Karachi: Pakistan captain Babar Azam was bombarded with questions over his captaincy future following a winless Test season at home. Speaking to media ahead of the ODI series against New Zealand, Babar shut down a journalist when asked if he was thinking about stepping down as Test captain because of his poor record at home […]","content":"Karachi: Pakistan captain Babar Azam was bombarded with questions over his captaincy future following a winless Test season at home. Speaking to media ahead of the ODI series against New Zealand, Babar shut down a journalist when asked if he was thinking about stepping down as Test captain because of his poor record at home since last year. “I think we are having a white ball series now and the Test matches are over. So if you have any questions about this white ball series ask about that,” Babar shot back on Sunday. When Babar was asked again about his captaincy and whether it was affecting his batting, he retorted: “I don’t have to justify myself to anyone. I know how I am doing. My focus is on performing well for Pakistan” Babar also said the players were excited about the One-Day series beginning at the National Stadium on Monday. “In white ball formats we have performed well and we want to continue with that momentum against New Zealand although we know they are a very good side and it will be a tough series for both teams,” he added. Babar also made it clear he had no issues with the interim chief selector Shahid Afridi on selection of players and said he and the head coach were giving their input and outlining their plans to the selectors regularly and in meetings. “I think we are on the same page that is important. We have our best bowlers back and hopefully we can do well against New Zealand.” New Zealand Kane Williamson said it was not decided with what approach his team would play with in the three match series as it would all depend on conditions. “We have followed a particular pattern in white ball cricket and we will want to do that but it is a new experience for some of our players to be playing in the subcontinent conditions and they will have to adapt accordingly during the match.” Williamson, who last scored a ODI hundred in 2019, said he was not pushed by that as what was important was everyone getting runs at the right time for the team. All three ODI games will be played in the week in Karachi and Williamson said they had not decided on any replacement for fast bowler Matt Henry who was ruled out of the white ball series in Pakistan and India due to an injury. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2023-01-08 18:39:00","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket fever: Youth in Tral’s Nargistan village play in snow","link":"https://kashmirreader.com/2023/01/09/cricket-fever-youth-in-trals-nargistan-village-play-in-snow/","keywords":["SPORTS"],"creator":["BILAL HABIB"],"video_url":null,"description":"Demand the ground be maintained for sports activities TRAL: Cricket fever in Gujjjjar Basti Nargistan, a remote village in south Kashmir’s Sub Division Tral, is high despite the chilling cold and presence of snow in the field. The youth in the surrounding villages defy extreme weather conditions and let their leisure time not to go […]","content":"Demand the ground be maintained for sports activities TRAL: Cricket fever in Gujjjjar Basti Nargistan, a remote village in south Kashmir’s Sub Division Tral, is high despite the chilling cold and presence of snow in the field. The youth in the surrounding villages defy extreme weather conditions and let their leisure time not to go waste. They, however, feel ditched by the administration as the ground that has been notified is very small and a major part of it is covered under large stones as it is adjoining a nallah. “Every time we play in this ground we lose the ball in the stones or find the ball in the rushing waters of the nallah,” Talib Hussain, a youth from Gujjar Basti told Rising Kashmir. He said that teams from surrounding villages play tournaments even in the bone-chilling cold of winters. The locals said that the government had provided them the ground but it serves no purpose as it does not groom the talent from these villages. “The field either should be maintained and the vast area which is in under stones must be cleared or it should be relocated so that youth in the village can prove their cricketing talent and play at an advanced level,” said Abdul Rashid, another resident from the Nargistan village. Irshad Ahmad Dar, a social activist from Pulwama, has appealed to the authorities to provide a ground that would suffice the needs of local youth so that they too can bring excellence to their sporting activities.     BILAL HABIBkashmirreader.com/","pubDate":"2023-01-08 18:38:45","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"All-rounder Noble sparks Norths’ win over Hannans","link":"https://thewest.com.au/news/kalgoorlie-miner/all-rounder-noble-sparks-norths-win-over-hannans-c-9381315","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"North Kalgoorlie marked the resumption of Eastern Goldfields Cricket Association A-grade fixtures with victory over defending premiers Hannans.","content":null,"pubDate":"2023-01-08 18:00:00","image_url":"https://images.thewest.com.au/publication/C-9381315/dce4c7fcff855d811cf53e38a62de0d89a61b79e-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"New Zealand were one ball away from a series victory: Tim Southee","link":"https://www.sentinelassam.com/sports/cricket/new-zealand-were-one-ball-away-from-a-series-victory-tim-southee-632125","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Zealand captain Tim Southee rued the drawn finish in the second Test against Pakistan at Karachi, saying the visitors' were just one ball away from getting a series win.","content":" KARACHI: New Zealand captain Tim Southee rued the drawn finish in the second Test against Pakistan at Karachi, saying the visitors' were just one ball away from getting a series win.On Friday, New Zealand were countered by Sarfaraz Ahmed's counter attacking 118, but bounced back to be a wicket away from victory while Pakistan needed 15 runs for the same, before bad light forced a draw. \"You play to win Test matches and we got ourselves in, probably, positions to win both of them. It was pretty tough going but the guys toiled away and we were one ball away from a series victory.\" \"So yeah, disappointing to walk away (without a win) and I'm sure Pakistan are the same. You walk away, you toil away for 10 days and a drawn series. So yeah. A lot of good cricket was played in and amongst those 10 days,\" said Southee in the post-match press conference. Clearly, Sarfaraz was the difference between a series victory and a thrilling draw, as eventually the latter happened in Karachi. In the fourth innings, he made 118 runs in a chase of 319. In the series, making a comeback after four years of absence in Test cricket, Sarfaraz registered scores of 86, 53 and 78 in the series before making 118. He also stitched useful partnerships for Pakistan:- a 123-run partnership with Saud Shakeel was followed by a 70-run stand with Agha Salman. Sarfaraz's efforts meant that New Zealand had to delay taking the second new ball, something which was duly acknowledged by Southee. \"With the two batters still in, Sarfaraz and (Agha) Salman, we felt that runs could have come quickly. And I think that's a build-up of the way Sarfaraz played through the day, which delayed us taking the new ball.\" \"If he hadn't played as positively as he did through the day, then we would've been able to take the new ball when it became available and had a lot more runs to play with. So again it was a bit of a balancing act.\" \"If you take the new ball, it may come on a bit easier and we were just trying to manage how to get through that partnership, which we did. We were able to take that new ball and get another couple of wickets. So yeah, its a fine line and you go on a bit of a gut feel what you feel is right at the time along with the other leaders in the group.\" IANS Also Read:  Tim Southee, Trent Boult devastate West Indies battingAlso Watch:","pubDate":"2023-01-08 17:39:31","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/08/428587-tim-southee.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's IPL auction likely to be held in February","link":"https://www.sentinelassam.com/sports/cricket/womens-ipl-auction-likely-to-be-held-in-february-632123","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"BCCI's T20 franchise competition for women is expected to be named the Women's T20 League and is likely to comprise of five teams.","content":"MUMBAI: BCCI's T20 franchise competition for women is expected to be named the Women's T20 League and is likely to comprise of five teams. The players' auction for the inaugural women's IPL could be held in February. The women's T20 league will be similar to the men's IPL and the deadline for Indian players to register for the auction is January 26, said a report in ESPNCricinfo. The women's T20 Challenge, which began as a two-team one-off game in 2018 before expanding to a three-team exhibition tournament in 2019 and two further editions in 2020 and 2022, will be replaced by this competition. IANSAlso Read:  Women's cricket set for a surge with inaugural IPL, U19 T20 World CupAlso Watch:","pubDate":"2023-01-08 17:10:55","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/08/428585-070120231504210642281.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli remembers Irrfan Khan, shares his quote: 'Wanting fame is a disease'","link":"https://www.tribuneindia.com/news/sports/virat-kohli-remembers-irrfan-khan-shares-his-quote-wanting-fame-is-a-disease-468635","keywords":null,"creator":null,"video_url":null,"description":"IANS New Delhi, January 8 Star Indian cricketer Virat Kohli, who was given a break from the just-concluded T20I series against Sri Lanka, on Sunday shared a famous quote of Irrfan Khan, a day after the late Bollywood actor's birth anniversary. The 34-year-old might have been away from the cricket field after the Bangladesh Test series, but he is quite active on social media and has been sharing plenty of posts over the last few days. From sharing pictures of his vacation with his actress-wife Anushka Sharma, who will soon be seen playing Jhulan Goswami in the woman cricketer's biopic, to praising Suryakumar Yadav's blitz of a knock against Sri Lanka in the third T20I, the cricketer is on a roll on social media. On Saturday, the cinema world celebrated the birth anniversary of the versatile actor, who lost his battle against a neuroendocrine tumour on April 29, 2020. \"Wanting fame is a disease and one day I will want to be free from this disease, from this desire. Where fame doesn't matter. Where just experiencing life and being okay is enough,\" Kohli shared on his Instagram story quoting Irrfan. Not only did he share Irrfan quotes, the former India captain also ran a video featuring Hollywood actor Tom Hanks in his Insta story. \"I wish I had known 'this too shall pass'. You feel bad right now? You feel pissed off? Do you feel angry? This too shall pass. You feel great. You feel like you know all the answers. You feel like everybody finally gets you,\" Tom Hanks can be heard saying in the video shared by Kohli. The right-handed batter recently visited Vrindavan along with Anushka and daughter Vamika to seek blessings at the Neem Karoli Baba's ashram. The Baba, incidentally, was the guru of America's rich and famous before they became so, notably Steve Jobs, Larry Brilliant, Julia Roberts, Mark Zuckerberg and Jeffrey Skoll. Kohli, meanwhile, is set to return to the field during the home ODI series against Sri Lanka, beginning on January 10. Not only Virat, but even skipper Rohit Sharma and the likes of K.L. Rahul, Mohammed Shami and Jasprit Bumrah will be back for the assignment, after missing the T20Is.","content":null,"pubDate":"2023-01-08 16:31:47","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_658615249.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC 2023: क्रिकेट के मैदान पर फिर चढ़ने वाला है पारा, होगी गौतम गंभीर और शाहिद अफरीदी की टक्कर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/afridi-misbah-ul-haq-muralitharan-sreesanth-simmons-to-play-legends-league-cricket/articleshow/96835594.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket 2023: भारतीय टीम के पूर्व सलामी बल्लेबाज गौतम गंभीर और पाकिस्तान के पूर्व कप्तान शाहिद अफरीदी एक बार फिर मैदान पर टकराएंगे। लीजेंड्स लीग क्रिकेट के नए सीजन में दोनों खिलाड़ी खेलते हुए नजर आने वाले हैं।","content":"लीजेंड्स क्रिकेट लीग (LLC) का नया सीजन इसी साल फरवरी-मार्च में खेला जाएगा। टूर्नामेंट का पिछला सीजन भारत में हुआ था। लेकिन इस बार मुकाबला कतर में खेले जाएंगे। इरफान पठान, शेन वॉटसन, गौतम गंभीर (Gautam Gambhir) और हरभजन सिंह जैसे दिग्गज खिलाड़ियों ने पिछले सीजन में हिस्सा लिया था। अब नए सीजन में कुछ और पूर्व दिग्गज खिलाड़ी लीग में जुड़े हैं। इसमें भारत के साथ ही पाकिस्तान के भी नाम शामिल हैं। लीजेंड्स लीग क्रिकेट से जुड़ने वाले खिलाड़ियों में पाकिस्तान के शाहिद अफरीदी और मिस्बाह उल हक के अलावा वेस्टइंडीज के लिंडेल सिमंस और श्रीलंका के मुथैया मुरलीधरन का नाम शामिल हो गया है। भारतीय टीम के पूर्व बल्लेबाज रोबिन उथप्पा और वर्ल्ड चैंपियन तेज गेंदबाज एस श्रीसंत भी लीग के अगले सीजन में हिस्सा लेंगे। पाकिस्तान के पूर्व कप्तान और अंतरिम सेलेक्टर शाहिद अफरीदी ने कहा, 'पुराने साथियों और प्रतिद्वंद्वियों के साथ खेलने में मजा आएगा। मैं प्रतिस्पर्धी सीजन का इंतजार कर रहा हूं।' लीजेंड्स लीग क्रिकेट के नए सीजन में तीन टीमों के बीच 8 मुकाबले खेले जाएंगे। इसमें वर्ल्ड जायंट्स, एशिया लायंस और इंडिया महाराज शामिल हैं। टूर्नामेंट का पहला मैच 27 फरवरी को खेला जाएगा। फाइनल 8 मार्च को होगा। इस टूर्नामेंट में भारतीय टीम के पूर्व सलामी बल्लेबाज गौतम गंभीर और ऑलराउंडर इरफान पठान भी दिखेंगे। यानी एक बार फिर क्रिकेट के मैदान पर गंभीर और अफरीदी आमने सामने होंगे। मैदान पर दोनों खिलाड़ियों की भिड़ंत काफी मशहूर रही है। संन्यास के बाद सोशल मीडिया पर भी दोनों एक-दूसरे पर हमला बोलते रहते हैं। लीजेंड्स लीग क्रिकेट के सह-संस्थापक और सीईओ, रमन रहेजा ने कहा, 'हम एक मजेदार सीजन की उम्मीद कर रहे हैं, क्योंकि इस सीजन में खेलने के लिए काफी दिग्गज क्रिकेटरों सहमति दे दी है। हम जल्द ही इस साल के सीजन के लिए लगभग 60-70 खिलाड़ियों के एक समग्र पूल की घोषणा करेंगे।'","pubDate":"2023-01-08 15:07:23","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Guwahati ODI: Crowds can carry four items to enter ACA Stadium","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/guwahati-odi-crowds-can-carry-four-items-to-enter-aca-stadium-632111","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Crowds will be allowed to enter into the ACA Stadium to watch the first match of the ODI series between India and Sri Lanka three hours before the start of the game.","content":"City ready to welcome cricketers Our Sports ReporterGUWAHATI: Crowds will be allowed to enter into the ACA Stadium to watch the first match of the ODI series between India and Sri Lanka three hours before the start of the game. They can also carry a wallet, mobile phone, flag without stick and key of the vehicle inside the stadium. A media conference, jointly organized by Assam Cricket Association, Assam Police and District Administration, was held at the ACA stadium here today, Addressing the gathering Diganta Barah, Commissioner of Police, Guwahati said that adequate measures were taken to conduct the match peacefully. \"Gates at the stadium will be opened 3 hours before the match to avoid any possibility of rush. We also requested the public to drop the idea of bringing private cars to avoid traffic snarls,\" said Barah. It may be mentioned here that first game of the series will kick off at 1-30 PM at the ACA Stadium, Deputy Commissioner of Kamrup Metro Pallav Gopal Jha, also attending the conference, informed that the spectators would be allowed to bring only wallets, mobile phones, car keys and the national flag without stick into the stadium. Meanwhile the joint secretary of the BCCI Devajit Saikia and president of the Assam Cricket Association Taranga Gogoi also addressed the media today. Saikia said, this match was very crucial considering the fact that the ICC World Cup was fast approaching. He added that the match would be closely monitored, and if things went well, Assam Cricket Association could stand a chance to host a World Cup match. He, on behalf of Assam Cricket Association, also expressed his gratitude to Roger Binny, President, BCCI and Jay Shah, Secretary, BCCI for allotting two international matches to Assam Cricket Association within a short period of time. Commenting on the preparation Taranga Gogoi said, \"All the necessary preparations were being made and all arrangements done in order to host the match in a successful manner.\" Responding to complaints regarding overcharged food items and packaged drinking water during earlier international matches, the president said, \"Assam Cricket Association would take punitive measures against any vendor who violated the norms. In relation to that, I also requested the spectators to video record any such violation, so that, if found guilty, those vendors could be blacklisted.\" Meanwhile city is ready to welcome both the teams. While several members of Team India are expected to arrive in the city late at night, the other members of the team, who are the part of the ongoing T20 series, and Sri Lanka will land tomorrow. Several banners were already installed across the city to welcome. Also Read: ODI series: First batch of Indian team to arrive on Saturday Also Watch:","pubDate":"2023-01-08 14:22:01","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/08/428573-aca.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"World Test Championship: India get big boost after SCG Test between Australia and South Africa ends in a draw","link":"https://www.firstpost.com/firstcricket/sports-news/world-test-championship-india-get-big-boost-after-scg-test-between-australia-and-south-africa-ends-in-a-draw-11949912.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"World Test Championship: India get big boost after SCG Test between Australia and South Africa ends in a draw","content":"India got a huge boost apropos the qualification of the ICC World Test Championship final courtesy of the third and final Test between Australia and South Africa ending in a draw in Sydney on Sunday.The Proteas’ batters finally showed some fight at the SCG and Australia’s imposing bowling attack failed to take advantage as the rain-affected match ended without a whimper.It meant Australia must wait until their upcoming series against India away from home to book their place in the World Test Championship final, with the current leaders missing the chance to cement their spot.While Australia maintain their lead at the top of the standings and look all but certain to play in the final, Pat Cummins’ team drops closer to the chasing pack courtesy of the draw in Sydney.Also Read: Australia vs South Africa: Proteas show resilience on final day of Sydney Test to deny hosts series sweepAustralia did win the series 2-0, but their failure to capitalise on yet another dominant performance with the bat – and Sydney’s fickle weather – saw their point-percentage drop to 75.56% following the Test.India’s chances of reaching a second consecutive final are boosted as Rohit Sharma’s side remains in second place on the standings with a 58.93 point percentage, while Sri Lanka are also in the mix in third with 53.33%.Here’s what India need to qualify for WTC final:India, whose PCT currently reads 58.93, will host Australia in the four-Test series starting in February. If the Rohit-led team win one out of four matches, their PCT will be 51.39, 56.9 if they win two, and 62.5 if they win three. Hence, Team India will have to ensure that they win at least a couple of matches against Australia in order to confirm their berth in the WTC final for the second consecutive time.Meanwhile, just like Australia, South Africa too drop a valuable percentage with the Proteas (48.72%) remaining in fourth and their hopes of reaching the final resting on their upcoming series at home against the West Indies.But South Africa’s chances will also be dependent on other teams, with victories in both those Tests against the Caribbean side required and a host of other results going their way the only hope for Dean Elgar’s side following a disappointing tour of Australia.(With ANI inputs)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-08 11:31:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/WTC-trophy.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BPL 2023: Shakib Al Hasan loses his cool at square-leg umpire over bouncer not being called wide; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/bpl-2023-shakib-al-hasan-loses-his-cool-at-square-leg-umpire-over-bouncer-not-being-called-wide-watch-video-11950132.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"BPL 2023: Shakib Al Hasan loses his cool at square-leg umpire over bouncer not being called wide; watch video","content":"Star Bangladesh all-rounder Shakib Al Hasan is known for not holding his emotions back on the cricketing field and the same was evident during a Bangladesh Premier League (BPL) match on Saturday.Shakib, who was picked by KKR in the IPL auction last month, was batting for the Fortune Barishal against Sylhet Strikers in the fourth match of BPL 2023. Seamer Rejaul Rahman Raja bowled a steep bouncer to the southpaw, who opted to let the ball sail over his head after initially shaping for a hook.Shakib instinctively looked towards square leg umpire Mahfuzur Rahman, expecting him to stretch his arms, but let out an exasperated cry after not getting the decision that he was hoping for.While Mahfuzur’s colleague Tanvir Ahmed, standing at the non-striker’s end, signalled one for the over, he was busy dealing with the irate national hero, who had walked right up to him for an animated conversation.Watch the incident unfold in a video posted on Twitter:Shakib and umpires. A love story that keeps giving.pic.twitter.com/15YqtZjsV0— Nikhil 🏏 (@CricCrazyNIKS) January 7, 2023This certainly isn’t the first time Shakib, who has 65 Test and over 300 limited-overs international appearances to his credit, has had a run-in with the on-field umpires at the domestic level.He had similarly lost his cool during a Dhaka Premier League match in June 2021, where he was representing Mohammedan Sporting. In a match against Abahani Limited, Shakib had an on-field meltdown after an LBW appeal off his bowling was turned down by the umpire.Shakib responded by angrily kicking the stumps at the non-striker’s end, which led to a commotion on the field. He would have another run-in later in the same match, this time walking to the non-striker’s end, uprooting the stumps with his hands and smashing them on the ground.Shakib would later apologise for his act, describing it as a “human error”.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-08 10:52:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Shakib-Al-Hasan-Bangladesh-training-AFP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Wanting Fame Is A Disease\": Virat Kohli Shares Cryptic Insta Stories","link":"https://sports.ndtv.com/cricket/wanting-fame-is-a-disease-virat-kohli-shares-cryptic-insta-stories-leave-fans-wondering-3674071","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket superstar Virat Kohli shared a couple of cryptic Instagram stories that have left fans wondering.","content":null,"pubDate":"2023-01-08 10:49:18","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL: If I was bowling to Surya, I'd be disheartened, says India captain Hardik Pandya","link":"https://www.thehansindia.com/sports/cricket/ind-vs-sl-if-i-was-bowling-to-surya-id-be-disheartened-says-india-captain-hardik-pandya-776787","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Surya scored 112 off 51 in the 3rd T20IIndia defeated Sri Lanka by 91 runs in RajkotTeam India clinched the series 2-1","content":"India's stand-in captain Hardik Pandya has said if he were bowling to Suryakumar Yadav , he would be \"disheartened.\" Surya registered his third T20I hundred on Saturday during India's third T20I against Sri Lanka at Saurashtra Cricket Association Stadium, Rajkot. Surya was named the Player of the Match as his knock of 112 not out off 51 helped India beat the tourists by 91 runs and clinch the three-match T20I series 2-1. The 32-year-old batsman, who made his debut in 2021, became only the second Indian batter to score three T20I centuries, with only Rohit Sharma (4) ahead of the former in the list of most T20I hundreds for India. During the post-match presentation, Hardik, who is leading India in Rohit's absence, heaped praise on Surya, saying he makes batting look \"so easy.\" \"I think he (SKY) has been surprising everyone every innings that he is batting. He is just telling us that batting is so easy. If I were bowling to him, I'd be disheartened on seeing his batting. Special mention to Rahul Tripathi - the ball was doing something but he showed great intent. Then SKY did his thing. You don't need to tell him anything, he knows what to do. If there is any situation where he is unsure, we have our chats but more often than not, he knows what to do,\" said Hardik after India's victory in Rajkot. Meanwhile, Surya credited head coach Rahul Dravid for his recent innings, saying the former captain just asks him to express himself and enjoy his batting. \"It's really important to put pressure on yourself when you are preparing for a game. If you do that in practice, it gets a little easier while playing the game. There is a lot of hard work involved but it's about doing quality practice sessions. \"You should know what your game is and prepare accordingly. Boundaries behind are like 50-60 meters, so I was targeting them. There are some shots that are pre-determined but you need to have other shots too so that if the bowler changes his plan, you can have an answer. He (Dravid) just lets me enjoy myself. He tells me to just enjoy and express myself,\" said Surya. Hardik also made a special mention about bowling all-rounder Axar Patel for his recent contributions with the bat. In the second game, Axar scored a quick-fire 65 before scoring a nine-ball 21 in the third T20I. \"I'm really proud of him (Axar), the way he is batting down the order and hitting. This will give a lot of confidence to him and the team as well. My motto in life as captain has been that I'll back my players. These are the best T20 cricketers in India and that's why they are here. There is no space for doubting in this format and we're backing the players properly. The way we played in the series is pleasing, we didn't even play 50 percent of our game in the second game but we still fought well,\" added Hardik. 'Hardik gives me confidence, protects me,' says Axar Patel Axar was named the Player of the Series for finishing as the third leading scorer with 117 runs in three T20Is at an average of 117 and strike-rate of 195. He credited his skipper Hardik for giving him confidence and for backing him. \"Feel happier when the team benefits from my batting (when compared to bowling). Didn't do anything different for this series, just that the captain gave me a lot of confidence in the dugout. He tells me to play freely and that he is there to protect me. We do a lot of planning during team meetings but sometimes things do go wrong and I just focus on doing my plans properly,\" added Axar. Picture perfect! 📷 #TeamIndia pic.twitter.com/N68FerBHOk India and Sri Lanka will next face off against each other in the One-Day Internationals (ODIs), starting from Tuesday (Jan. 10) in Guwahati. The next two ODIs will be played on Jan. 12 in Kolkata and Jan. 15 in Thiruvananthapuram.","pubDate":"2023-01-08 09:01:35","image_url":"https://assets.thehansindia.com/h-upload/2023/01/08/500x300_1328912-hardik.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa dig in to hold Australia to draw and avoid series sweep","link":"https://www.skysports.com/cricket/news/12040/12782211/south-africa-hold-australia-to-draw-and-avoid-series-sweep-as-sarel-erwee-and-temba-bavuma-dig-in","keywords":null,"creator":null,"video_url":null,"description":"South Africa dug deep to deny Australia a 3-0 series sweep with a battling draw in the rain-disrupted third Test at the Sydney Cricket Ground on Sunday, finally finding some fight on the final day of a miserable tour.","content":null,"pubDate":"2023-01-08 08:58:00","image_url":"https://e0.365dm.com/23/01/1920x1080/skysports-cummins-bavuma-cricket_6017431.jpg?20230108080555","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Cricket fans left fuming after Aussies dudded in 'ridiculous' farce","link":"https://au.sports.yahoo.com/cricket-fans-left-fuming-after-aussies-dudded-ridiculous-farce-031921234.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-08 08:46:10","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2023-01/ed5a97f0-8f01-11ed-bfff-632be5e8cde9","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Gautam Gambhir lauds Suryakumar Yadav, wants the India batter to play Test cricket","link":"https://www.firstpost.com/firstcricket/sports-news/gautam-gambhir-lauds-suryakumar-yadav-wants-the-india-batter-to-play-test-cricket-11949742.html","keywords":["First Cricket News"],"creator":["Rachit Kanaujia"],"video_url":null,"description":"Gautam Gambhir lauds Suryakumar Yadav, wants the India batter to play Test cricket","content":"Former Indian opener Gautam Gambhir lauded star Indian batter Suryakumar Yadav for his explosive century in the third and final T20I against Sri Lanka and said that the time has arrived to put him in the Test cricket squad.Suryakumar Yadav’s blistering knock of 112 combined with a clinical performance of bowlers helped India register a thumping 91-run win over Sri Lanka in the third and final T20I to clinch the three-match series 2-1 at the Saurashtra Cricket Association Stadium on Saturday.“What a knock @surya_14kumar! Time to put him in test cricket! #SKYscraper,” tweeted Gambhir.What a knock @surya_14kumar! Time to put him in test cricket! #SKYscraper pic.twitter.com/tvvoRTXEwp— Gautam Gambhir (@GautamGambhir) January 7, 2023 Suryakumar notably has a fantastic first-class cricket record playing for Mumbai. In 79 matches and 132 innings, he has scored 5,549 runs at an average of 44.75. He has scored 14 centuries and 28 half-centuries, with the best score of 200.With his unbeaten third T20I century, star Indian batter Suryakumar Yadav rewrote the history books during the third and final T20I of the series against Sri Lanka and became the fastest player to reach 1,500 runs in the shortest format in terms of balls taken.Suryakumar Yadav took only 843 balls to reach this landmark in T20I cricket, the fastest among all players.He is the third-fastest to reach the 1,500-run mark in T20Is in terms of innings. The fastest batters to reach the landmark are Indian batter Virat Kohli, KL Rahul, Australian veteran Aaron Finch and Pakistan skipper Babar Azam, who all took 39 innings to score 1,500 runs in T20Is.Pakistan wicketkeeper-batter Mohammed Rizwan reached the milestone in 42 innings and Suryakumar did so in 43 innings.Suryakumar Yadav is also the first-ever player to reach the landmark with a strike rate of 150 or more.In 45 matches and 43 innings, he has scored 1,578 runs at an average of 46.41. He has three centuries and 13 half-centuries in the format, with the best individual score of 117 and a strike rate of 180.34.Suryakumar also smashed the second-fastest century by an Indian batter in T20Is, taking just 45 balls to bring up his third century in the shortest format.The fastest T20I century by an Indian is by skipper Rohit Sharma, who nailed a 35-ball ton against Sri Lanka in 2017.This batting star now also has joint second-highest centuries in T20Is. Indian skipper Rohit Sharma has four T20I centuries, a record. He is followed by Suryakumar Yadav, Glenn Maxwell of Australia, and New Zealand’s Colin Munro, who have three centuries each.With this win, India has captured the three-match T20I series by 2-1.India won the toss and elected to bat first. After Men in Blue lost Ishan Kishan (1) early, a quick cameo from Rahul Tripathi brought back some momentum to the innings. He scored 35 off just 16 balls, with five boundaries and two sixes. Shubman Gill was the anchor throughout.Following Rahul’s dismissal, India was already beyond the 50-run mark in their powerplay.Suryakumar Yadav continued his red-hot form, smashing Lankan bowlers left and right. Gill was dismissed for 46 off 36 balls, ending a quickfire 111-run stand in just 53 balls.Suryakumar brought up his third T20I ton in just 45 balls and ended the innings at 112* off 51 balls, with seven fours and nine sixes. Axar Patel (21*) also provided a nice cameo to power India to 228/5 in their 20 overs.Dilshan Madushanka (2/55) was the pick of bowlers for visitors. Chamika Karunaratne, Wanindu Hasaranga, Kasun Rajitha got a wicket each.Chasing 229, openers Kusal Mendis (23) and Pathum Nissanka (15) provided a good start to the visitors and they scored 44 in 4.5 overs before Axar trapped Kusal.Following this dismissal, Lanka could not bounce back into the game and lost wickets consistently. Only Dhananjay de Silva (22) and skipper Dasun Shanaka (23) crossed the 20-run mark.Lanka was bundled out for just 137 runs in 16.4 overs. Arshdeep Singh (3/20) impressed with the ball after an off-day at work in the 2nd T20I. Pandya, Yuzvendra Chahal and Umran Malik took two wickets each while Axar got one.Suryakumar was adjudged as ‘Man of the Match’ for his match-winning ton.The three-match ODI series between both sides will start from January 10.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-08 07:56:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Gautam-Gambhir.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Time to put him in Test cricket: Gautam Gambhir lauds Suryakumar Yadav","link":"https://thenewsmill.com/2023/01/time-to-put-him-in-test-cricket-gautam-gambhir-lauds-suryakumar-yadav/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-08 07:31:19","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"Much to lose as light fades on Test cricket","link":"https://www.theage.com.au/sport/cricket/much-to-lose-as-light-fades-on-test-cricket-20230106-p5caw4.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["The Age's View"],"video_url":null,"description":"In an accelerating world, there’s still good reason to love the slower, longer game, but that doesn’t mean everything is as it should be.","content":null,"pubDate":"2023-01-08 07:05:54","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"SCG draw gives Australia 2-0 series victory amid fresh umpire drama","link":"https://www.watoday.com.au/sport/cricket/scg-draw-gives-australia-2-0-series-victory-amid-fresh-umpire-drama-20230108-p5cb3i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"The spirit of cricket continues to confuse after another controversial catch was disallowed by technology as the third Test against South Africa ended in stalemate.","content":null,"pubDate":"2023-01-08 06:50:59","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"News24.com | Proteas show steel to earn gritty draw, avoid series whitewash against Aussies","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-show-steel-to-earn-gritty-draw-avoid-series-whitewash-against-aussies-20230108","keywords":null,"creator":null,"video_url":null,"description":"The Proteas snapped a four-match losing streak when they drew the third Test against Australia at the Sydney Cricket Ground on Sunday.","content":null,"pubDate":"2023-01-08 06:48:44","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Aussies frustrated but unbeaten amid ‘sad’ cricket controversy as Proteas cling on to draw SCG Test","link":"https://www.foxsports.com.au/cricket/australia/cricket-2023-australia-vs-south-africa-day-5-live-blog-live-stream-scores-teams-weather-pat-cummins-dean-elgar/news-story/62cee6b0cf1717e80cf9d72c6e36f9d5","keywords":null,"creator":null,"video_url":null,"description":"After three weeks of frustration and torment, South Africa’s batters finally showed some fight on day five of the New Year’s Test, avoiding a series whitewash against Australia and restoring some national pride.","content":null,"pubDate":"2023-01-08 06:48:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"RESULT: Proteas hang on to salvage draw in Sydney","link":"https://www.thesouthafrican.com/sport/cricket/proteas/proteas-salvage-draw-australia-result-sydney-breaking-8-january-2023/","keywords":["Proteas","Featured","latest cricket news","Proteas in Australia","result","SCG"],"creator":["Garrin Lambley"],"video_url":null,"description":"The third and final Test between Australia and South Africa ended in a draw at the Sydney Cricket Ground (SCG) on Sunday.","content":"The third and final Test between Australia and South Africa ended in a draw at the Sydney Cricket Ground (SCG) on Sunday. AS IT HAPPENED | AUSTRALIA V SOUTH AFRICA, 3RD TEST The Proteas were able to bat out for a draw on the final day to deny Australia a series sweep in the three-Test series. ALSO READ | FARHAAN BEHARDIEN CALLS STUMPS ON PLAYING CAREER The Proteas were 105 for two in their second innings when Australia captain Pat Cummins settled for a draw with five overs left. Australia had begun the final day needing 14 wickets to pull off an improbable victory. ALSO READ | RUSSELL DOMINGO QUITS AS BANGLADESH COACH","pubDate":"2023-01-08 06:41:56","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Australia vs South Africa, 3rd Test Day 5 in Sydney, Highlights: Erwee, Bavuma secure draw for Proteas","link":"https://www.firstpost.com/firstcricket/sports-news/australia-vs-south-africa-3rd-test-day-5-in-sydney-highlights-erwee-bavuma-secure-draw-for-proteas-11948702.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Australia vs South Africa, 3rd Test Day 5 in Sydney, Highlights: Erwee, Bavuma secure draw for Proteas","content":"Day 4 report: Australia had a glimpse of what appeared an unlikely victory and a series clean sweep as it took six of the 20 South African wickets it needs after captain Pat Cummins declared the host’s first innings at 475-4 on the fourth day of the rain-affected third test.Cummins took three wickets in a fearsome display of pace bowling under grey skies at the Sydney Crcket Ground, while Josh Hazlewood picked up two and Nathan Lyon claimed another, amongst a clutch of several near misses, as the Proteas finished Saturday at 149-6, trailing Australia by 327 runs.To win, Australia needs to capture the four remaining South African first-innings wickets and then enforce the follow-on in a bid to bowl the Proteas out a second time — all within three sessions on Sunday’s final day.“Yeah, I think so,” said Hazlewood on Australia’s prospects of engineering an unlikely final-day victory. “From what we saw today we bowled 50-odd overs and took six wickets.“And the wicket, I think, after a bit of foot traffic at both ends looked quite nice with Gazza (Lyon) bowling into that rough so I think Ashton (Agar) and Gazza big day tomorrow for them.”A win for Australia in this third test would confirm its place in the world test championship final to be played at Lord’s in England in June.After no play on Friday, further rain on Saturday morning meant play could not resume before lunch, effectively forcing Cummins’ hand into declaring.That was despite leaving Usman Khawaja stranded on 195 not out to give his bowling attack any hope of bowling South Africa out twice to win the match in only five remaining sessions of play.“He was fine, all the batters would be fine with a call like that,” said Hazlewood of Khawaja’s reaction to not having the chance to complete his first double century. “We’re obviously running out of overs as it is and it was sort of being talked about already, so he’s fine with it.”Australia thought it had made the breakthrough in Hazlewood’s third over when Steve Smith took a spectacular, low one-handed catch at slip from Dean Elgar.Like the catch claimed by South Africa’s Simon Harmer off Marnus Labuschagne on the first day, the television umpire found that there was inconclusive evidence that a clean catch had been taken and gave Elgar a reprieve.Hazlewood — back in the team after recovering from a side strain that kept him out for the first two tests of the series — didn’t have to wait much longer to get his man and had Elgar edging to wicketkeeper Alex Carey when on 13 four overs later.It continues a lean series for South Africa’s skipper who has averaged 8.8 runs for the series after scores of 3, 2, 26 and 0 in his four previous innings this series.Sarel Erwee was then bowled by Nathan Lyon (1-65) after leaving a ball that was too straight and Heinrich Klaasen fell four balls later when he gloved behind to Carey off Cummins to reduce South Africa to 37-3.Temba Bavuma became Hazlewood’s second victim when he was teased into playing a false shot and edged through to Carey for 35 with South Africa wobbling at 85-4.Khaya Zondo shared a 45-run partnership with Kyle Verreyne before he was trapped leg before by a searing Cummins’ yorker for 39.Cummins (3-29) showed why he is ranked the world’s top test bowler with a near unplayable delivery which Kyle Verreynne (19) edged through to Steve Smith and South Africa was in trouble at 137-6.Marco Jansen was 10 not out and Simon Harmer was unbeaten on six at stumps.“Yes it is, we’ve got the day to bat,” middle-order batter Khaya Zondo said when asked if there was still belief within the beleaguered South Africa team they can save the game. “I’m sure we’ve done that before and I’m sure we’ll be able to do that tomorrow.”Earlier in the match, Khawaja scored his third straight SCG ton and passed his previous highest test score of 174 — against New Zealand at Brisbane in 2015 — and shared a 209-run partnership with Steve Smith (104) to lift Australia to 475-4 when rain stopped play on Thursday’s second day. Wet weather wrecked the chance of any play on Friday.The forecast appears more favorable for the final day Sunday.Australia has already won the series after two crushing defeats in the first two tests at Brisbane and Melbourne.With inputs from The Associated PressRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-08 06:39:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Dean-Elgar-Pat-Cummins-Cricket-Australia-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Wenger to help ‘sleeping giant’ India develop football talent","link":"https://www.capitalfm.co.ke/sports/2023/01/08/wenger-to-help-sleeping-giant-india-develop-football-talent/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"NEW DELHI, India, Jan 8 – Former Arsenal manager Arsene Wenger will work with India to develop football talent as the sport’s national federation attempts to overhaul its “identity and philosophy”, the organisation revealed on Saturday. India, once called a “sleeping giant” of football by former FIFA president Sepp Blatter, are 106th in world rankings […] The post Wenger to help ‘sleeping giant’ India develop football talent appeared first on Capital Sports.","content":"India, once called a “sleeping giant” of football by former FIFA president Sepp Blatter, are 106th in world rankings and struggle to grab public attention in the cricket-obsessed country. The All India Football Federation (AIFF) has struggled with governance issues and was temporarily suspended by football world governing body FIFA last year. Fresh elections followed in September and the AIFF is now eyeing big changes with the help of 73-year-old Frenchman Wenger. “We will have a data driven scouting system in place for the national team,” secretary general Shaji Prabhakaran told reporters on Saturday. “We are going to work on this project with FIFA and Arsene Wenger is personally going to devote his time.” Wenger is currently working for FIFA as its head of global football development. AIFF president Kalyan Chaubey did not specify Wenger’s exact role in the talent development programme but said the excercise would be key to making India a football powerhouse by 2047 — the country’s centenary of independence. “We are not going to sell dreams,” he said. “We have to build the foundations of a strong structure and build our own identity and philosophy.” Croatian Igor Stimac has been India’s head coach since 2019. India hosted the Under-17 World Cup in 2017 and the women’s edition last year.","pubDate":"2023-01-08 05:26:14","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Proteas have mended some of the holes in their leaky batting bucket","link":"https://www.citizen.co.za/sport/cricket/proteas-mended-some-holes-in-their-leaky-batting-bucket/","keywords":["Cricket","Australia cricket","proteas cricket","third test"],"creator":["Ken Borland"],"video_url":null,"description":"That they came so close was largely thanks to Simon Harmer and Keshav Maharaj in the lower-order, who showed tremendous resistance as they added 85 for the eighth wicket.","content":"The Proteas have managed to mend some of the holes in their leaky batting bucket and will go into the final session of the third Test against Australia with nine wickets in hand at the Sydney Cricket Ground. Sarel Erwee (44 balls) and Heinrich Klaasen (21 deliveries) are both on 18 not out at tea as they took South Africa to 46/1 at tea. A minimum of 32 overs are scheduled to be bowled after the break, with the deficit still 174 runs. Captain Dean Elgar was once again caught sparring down the leg-side, off opposite number Pat Cummins, for 10, bringing an end to another struggle at the crease. Earlier, South Africa had narrowly failed to avoid the follow-on as they were bowled out for 255, 21 short, at 2pm in Sydney. That they came so close was largely thanks to Simon Harmer and Keshav Maharaj in the lower-order, who showed tremendous resistance as they added 85 for the eighth wicket. Glimpse Their stout effort provided a glimpse of what was possible on a reasonably good pitch if the top-order played with application and positivity, trusting their own games. Harmer was well-equipped for a long stay at the crease, deserving great praise for his defiant 47 off 165 deliveries in three-and-a-half hours, while Maharaj did his utmost to see South Africa past the follow-on score with his 53 off 81 balls. He got himself in first, and then backed his attacking game as he struck six fours and a six, pulling especially well. Although they ultimately failed to get to 276 to avoid the follow-on, it was just as important that Harmer and Maharaj took time out of the game, leaving Australia with just a small window of opportunity to bowl the Proteas out in their second innings. Read more: Law of averages suggests Proteas draw is due, rain makes it more likely South Africa had begun the final day on 149/6 and Marco Jansen extended his tenacious stay at the crease, batting for more than an hour-and-a-half in scoring 11 off 78 balls before edging part-time off-spinner Travis Head to the wicketkeeper. Read more: SA reeling as Australia call into service all the ruthlessness of their ace attack The impressive Josh Hazlewood eventually broke South Africa’s resistance in an impressive spell after lunch. Using a hint of reverse-swing, he trapped Maharaj lbw and then bowled Harmer off the inside-edge, to finish with 4/48 in 23 overs, a superb comeback from injury. Off-spinner Nathan Lyon then caught-and-bowled Kagiso Rabada (3) to end the innings.","pubDate":"2023-01-08 05:21:40","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/01/Keshav-Maharaj-Simon-Harmer.jpg","source_id":"citizen","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Time to put Suryakumar Yadav in Test cricket: Gautam Gambhir makes bold claim","link":"https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-gautam-gambhir-indian-cricket-team-test-cricket-2318757-2023-01-08?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Time to put Suryakumar Yadav in Test cricket: Gautam Gambhir makes bold claim","content":null,"pubDate":"2023-01-08 04:54:48","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Important to put pressure on yourself during practice says centurion Suryakumar on his T20I success","link":"https://www.orissapost.com/important-to-put-pressure-on-yourself-during-practice-says-centurion-suryakumar-on-his-t20i-success/","keywords":["Sports","suryakumar yadav","T20I"],"creator":["Post News Network"],"video_url":null,"description":"Rajkot: After scoring a match and series-winning century in the third T20I, Suryakumar Yadav on Saturday revealed his success mantra in the shortest format of the game, saying that it’s important to put pressure on yourself during the practice session, which makes situation a bit easy during the game time. Suryakumar blistering unbeaten century (112 […]","content":"Rajkot: After scoring a match and series-winning century in the third T20I, Suryakumar Yadav on Saturday revealed his success mantra in the shortest format of the game, saying that it’s important to put pressure on yourself during the practice session, which makes situation a bit easy during the game time. Suryakumar blistering unbeaten century (112 not out off 51 balls) and a collective dominating performance by bowlers powered India to an impressive 2-1 series win over Sri Lanka with a convincing 91 run-win over in the third and final T20I at the Saurashtra Cricket Association Stadium, here. With his beautiful wristy shots, the right-hander made the opponent team feel like he isn’t from the same planet, treating every bowler with disdain. However, it’s not easy and a lot of hard work goes on in the preparation for a game, according to the star cricketer. “It’s really important to put pressure on yourself when you are preparing for a game. If you do that in practice, it gets a little easier while playing the game. There is a lot of hard work involved but it’s about doing quality practice sessions. You should know what your game is and prepare accordingly,” said Suryakumar in the post-match presentation. The stylish batter also spoke about his shot selections during a game. “Boundaries behind are like 50-60 meters, so I was targeting them. There are some shots that are pre-determined but you need to have other shots too so that if the bowler changes his plan, you can have an answer,” he said. Asked about the head coach Rahul Dravid’s advice for him, Suryakumar said,” He (Dravid) just lets me enjoy and tells me to express myself. Skipper Hardik Pandya also praised Surya, saying that the batter has been surprising everyone with his every innings. “I think he (SKY) has been surprising everyone every innings that he is batting. He is just telling us that batting is so easy. If I were bowling to him, I’d be disheartened on seeing his batting,” said Pandya. “You don’t need to tell him anything, he knows what to do. If there is any situation where he is unsure, we have our chats but more often than not, he knows what to do,” he added. IANS","pubDate":"2023-01-08 03:45:40","image_url":"https://www.orissapost.com/wp-content/uploads/2021/07/Suryakumar-Yadav-300x170.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"}]}