{"newsArray":[{"title":"England Cricket Board makes an audacious call, offers to host India and Pakistan for Test series","link":"https://www.indiatvnews.com/sports/cricket/england-cricket-board-makes-an-audacious-call-offers-to-host-india-and-pakistan-for-test-series-2022-09-28-811963","keywords":null,"creator":null,"video_url":null,"description":"The ECB (English Board), in a very brave move, has made an offer to the BCCI (Board of Control for Cricket in India) and the PCB (Pakistan Cricket Board) for a Test series between India and Pakistan to put an end to the long wait for a  bilateral series between the two sides. As far as the history between these two teams goes, India and Pakistan have not played any kind of Test series since December 2007. Owing to the political differences between these countries, the only time India plays Pakistan is at any ICC event.","content":null,"pubDate":"2022-09-28 03:46:13","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- South Africa Tour of India, 1st T20I - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiwwFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2luZGlhLXZzLXNvdXRoLWFmcmljYS1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtc291dGgtYWZyaWNhLXRvdXItb2YtaW5kaWEtMXN0LXQyMGktMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- South Africa Tour of India, 1st T20I  Cricket AddictorMatch Preview - India vs South Africa, South Africa in India 2022/23, 1st T20I  ESPNcricinfoIndia, South Africa arrive at the last leg of World Cup preparation | Cricbuzz.com - Cricbuzz  CricbuzzIND vs SA T20, ODI, 2022 Schedule, Squad, ODI Squad, Live, Schedule T20 2022, Tickets Delhi, Venue, Live Score, Live Telecast Channel In India, Live Streaming In India  Cricket AddictorVirat Kohli set to go past Rohit's batting records in South Africa series  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-09-28 03:07:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022: Virender Sehwag and Chris Gayle fail to fire as Bhilwara Kings THRASH Gujarat Giants","link":"https://zeenews.india.com/cricket/legends-league-cricket-2022-virender-sehwag-and-chris-gayle-fail-to-fire-as-bhilwara-kings-thrash-gujarat-giants-2515176.html","keywords":null,"creator":null,"video_url":null,"description":"The in-form Kevin O’Brien was out in the second over, which saw captain Virender Sehwag join ‘Universe Boss’ Gayle at the crease. Playing his first game of the League, Gayle could not really unleash his monstrous hits and was out for 15.","content":"Gujarat Giants had stalwarts Virender Sehwag and Chris Gayle in their batting arsenal, yet Bhilwara Kings outshone them with a royal batting display in the 9th game of the Legends League Cricket (LLC) 2022 at the Barabati Stadium in Cuttack on Tuesday (September 27). A collective effort with the bat saw the Kings tear apart the Giants’ bowling attack to post 222/4. Then their bowlers backed up the batters’ effort by keeping a tight leash on the Giants’ powerful batting line-up. The Giants were all out for 165 to give the Kings a 57-run victory. With this win, the Kings, who lost narrowly to Manipal Tigers on Monday, now have five points, the same as the Giants and India Capitals. The tough chase never took off for the Giants as they kept losing key wickets. The in-form Kevin O’Brien was out in the second over, which saw captain Sehwag join ‘Universe Boss’ Gayle at the crease. Playing his first game of the League, Gayle could not really unleash his monstrous hits and was out for 15. Special moments from @GujaratGiants innings! #BossLogonKaGame #LLCT20 #LegendsLeagueCricket pic.twitter.com/WQi2ZLkQg8 — Legends League Cricket (@llct20) September 27, 2022 Sehwag started to find his form and hit three fours and a six but was out for 27 off 20 balls. Thereafter, none of the Giants’ batters managed to get a foothold in the middle. Yashpal Singh, coming in at No.9, finished with a flourish, making 57 of 29 balls, but that was not enough for his team. Former India speedster S. Sreesanth turned the clock back, picking up 3/36, while off-break bowler Jesal Karia (2/22) and Caribbean pacer Fidel Edwards (2/30) too were successful with the ball. Earlier, Giants’ skipper Sehwag won the toss and opted to field, but thereafter almost nothing went in his team's favour as fours and sixes rained from the Kings' bats. Kings’ openers William Porterfield and Morne van Wyk went on the offensive from the word go as they plundered a mind-blowing 76 without loss from the six Powerplay overs. Nothing seemed to work for the Giants bowlers as the Kings raced to 100 in the ninth over. Irishman Porterfield was the first to get out, but only after he had played a whirlwind knock of 64 off 33 balls with 10 boundaries and two sixes. South African Van Wyk (50 off 28 balls) was out soon after. Then, Kings captain Irfan Pathan, who promoted himself up the order, clobbered three sixes and a four to make a 23-ball 34. Following Irfan’s dismissal, brother Yusuf Pathan took over, smashing the first two balls he faced for two huge maximums. Karia too played an important knock of 43 off 29 balls. The Kings took 24 runs from the last over of their innings. Brief Scores: Bhilwara Kings 222/4 in 20 overs (Morne van Wyk 50, William Porterfield 64, Irfan Pathan 34, Jesal Karia 43) bt Gujarat Giants 165 in 19.4 ovs (Yashpal Singh 57, Virender Sehwag 27; S. Sreesanth 3/36, Jesal Karia 2/22)","pubDate":"2022-09-28 02:40:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Green retained in Australia squad for Windies warm-ups","link":"https://www.thestar.com.my/sport/cricket/2022/09/28/cricket-green-retained-in-australia-squad-for-windies-warm-ups","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - All-rounder Cameron Green has been rewarded for his performances in India with a spot in the Australia Twenty20 squad for two World Cup warm-ups against West Indies in Queensland next week. Read full story","content":"SYDNEY (Reuters) - All-rounder Cameron Green has been rewarded for his performances in India with a spot in the Australia Twenty20 squad for two World Cup warm-ups against West Indies in Queensland next week. Opener David Warner, all-rounders Mitchell Marsh and Marcus Stoinis as well as paceman Mitchell Starc all return to the squad after missing the trip to India, where Green was a standout as Australia lost the series 2-1. Green, who stood in for the rested Warner as skipper Aaron Finch's opening partner in India and scored two half centuries, was not included in the squad for Australia's World Cup title defence. Marsh, who had an ankle problem, and Stoinis, who had a side issue, are both returning from injury and chief selector George Bailey said Australia were taking a \"cautious approach\" to any niggles as the tournament approaches. \"To have four key players return gives us the ability to take a conservative path with any minor issues and resolve those well in time for the World Cup,\" he said in a news release. World Cup squad members Kane Richardson and Ashton Agar are being rested for the West Indies matches but Bailey expected them to be back for a three-match warm-up series against England the following week. Australia play West Indies on the Gold Coast next Wednesday and at the Gabba in Brisbane two days later. Their World Cup campaign begins against New Zealand in Sydney on Oct. 22. Squad: Aaron Finch (captain), Sean Abbott, Pat Cummins, Tim David, Cameron Green, Josh Hazlewood, Josh Inglis, Mitchell Marsh, Glenn Maxwell, Daniel Sams, Steve Smith, Mitchell Starc, Marcus Stoinis, Matthew Wade, David Warner, Adam Zampa (Reporting by Nick Mulvenney; Editing by Peter Rutherford)","pubDate":"2022-09-28 01:57:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/28/1754479.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Glamorgan vs Sussex: Sensational Shubman hits maiden County ton, displays oozing elegance","link":"https://www.indiatvnews.com/sports/cricket/glamorgan-vs-sussex-sensational-shubman-hits-maiden-county-ton-displays-oozing-elegance-2022-09-28-811935","keywords":null,"creator":null,"video_url":null,"description":"Glamorgan vs Sussex: Taking giant strides in his career at the moment, Shubman Gill has achieved a landmark feat in his short County cricket stint. It was all class and elegance when Shubman resumed the proceedings on the second day of play. Shubman was 91 at the end of the first day's play. Gill just started from where he left off and made sure that he powers his side Glamorgan to a stronger position in the match.","content":null,"pubDate":"2022-09-28 01:49:35","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Burnaby players swing into action in world's widest-reaching amateur cricket league","link":"https://www.burnabynow.com/local-sports/burnaby-players-swing-into-action-in-worlds-widest-reaching-amateur-cricket-league-5879050","keywords":null,"creator":null,"video_url":null,"description":"Burnaby hosts the final match of the debut season of amateur cricket league, Last Man Stands.","content":"When was the last time you witnessed a family come together for a sport as a single team? This is the beauty of cricket. The sport brings people together — friends, family and community — in true sportsmanship. Cricket is well-known as a commonwealth sport; it’s popular in countries like India, England, Australia and South Africa. What’s not so well known among Canadians is that cricket was Canada’s Canada's first official sport , having been declared as such by prime minister John A. MacDonald in 1867. (It was replaced by Lacrosse not long after.) For many immigrants, especially from South Asian communities, where the sport attracts a religious-like devotion, cricket is invested with cultural identity that helps many newcomers stay in touch with their roots. The international league Last Man Stands (LMS) brings an opportunity for amateur cricketers to hone their skills. LMS is the world’s widest-reaching amateur cricket league, gaining popularity worldwide with a global ambassador like AB de Villiers, former South African captain. The league, meant for those aspiring to play cricket but whose busy schedules and life get in the way, has its own quirky rules. As opposed to the conventional ‘playing XI,’ LMS has an eight-side team for short-format cricket, with a game lasting just two hours. Unlike traditional nailbiting last overs, the LMS games are thrilling in a different way. Like the name suggests, the last man stands, meaning that the last wicket/person on the crease leads the team to victory (or loss). The league was started in 2005, in England by lifetime cricketers Wayne Greve and Bjorn Briggs, and has found players and fans in different corners of the world — including for the first time in history, Canada. After University of British Columbia professor Emrul Hasan was introduced to the league by his business partner, Redowan Chowdary, he took an interest in bringing the LMS to British Columbia. He recognized the gap in cricketing leagues available for British Columbians and applied for a B.C. franchise in August 2021. As participation and support for the league grew locally in the initial stages, the business partners decided to franchise across the country. The league has since expanded to different provinces, with B.C. matches held in Vancouver, Surrey, and Burnaby. With the motto “It’s anybody’s game,” the organizers are encouraging members of the local community to register for the next season after a scintillating end to the debut season. On Sept. 24, the Vancouver Vikings defeated the Okanagan Hawks cricket club in a nailbiting final, with the Vikings qualifying for the LMS World championships in South Africa from Dec. 11 to Dec. 18. The Hawks, who drove seven hours for a two-hour game, lost the match, but won over fans for their sheer determination, and qualified to the world championships along with the winners. Go local, grow global The intent is to help grow the sport at a grassroots level, said Hasan, director of strategy with LMS Canada. Through affordable registrations and flexible schedules for busy participants, LMS seeks players from all backgrounds. “We have a team — Rajput Royals,” said Hasan. “It is a whole family. The dad, three sons, two cousins and friends all come together as a single team to play, which is heartwarming to see.” National NDP leader and Burnaby South MP Jagmeet Singh was among the fans watching the Vikings’ victory. In a statement to Glacier Media, Singh said. “To grow any sort of sport or grow any community, we need space. So making sure there’s good grounds, making sure there’s good spaces, and supporting initiatives and community groups that are setting up the games; it’s good. I know, kabaddi is another sport that people love to play. And we see in different communities, grounds are made for that. We also want to make sure that young people can get exposed to different games.” He said that fostering opportunities for young people to play those sports here in Canada creates opportunities in the future. “We have to look at what the community wants to play, what they enjoy playing, and make sure we create the space for them to play,” he said. Last Man Stands will return for the next season as Canada's cricket season is nearing an end. Registration is open on the league's website .","pubDate":"2022-09-28 01:30:00","image_url":"https://www.vmcdn.ca/f/files/burnabynow/images/burnabynow/bby_cricket10.jpg;w=960","source_id":"burnabynow","country":["canada"],"category":["sports"],"language":"english"},{"title":"Arshdeep showed temperament, composure to handle pressure: Vikram Rathour","link":"https://www.business-standard.com/article/sports/arshdeep-showed-temperament-composure-to-handle-pressure-vikram-rathour-122092800027_1.html","keywords":null,"creator":null,"video_url":null,"description":"India batting coach has praised young pacer Arshdeep Singh for showing the hunger and ability to perform in pressure situations despite being new to international cricket","content":"India batting coach has praised young pacer Arshdeep Singh for showing the hunger and ability to perform in pressure situations despite being new to international cricket . Talking to reporters, the batting coach said Singh has been impressive in his short career and has shown promise bowling in the death overs. \"At this level, we are not really telling them anything. Arsh has been doing pretty well in IPL in the last 2-3 years and he has done well bowling in the death overs. We just support them to follow their plans, and strengths and they know where to bowl to each batter. They have their own plans, their own way of bowling to batters. \"As team management, we just have discussions to back their strengths and whatever the team plans are. No specific areas but for a young kid who has just come into international cricket, so far he has shown the temperament and composure to handle pressure and bowl well in difficult conditions. So as far we are concerned, we are pretty happy with the way he is progressing,\" said the batting coach. The batting coach shared the details of players who will be joining the team for the South Africa series. \"Already three replacements that are coming through. Arsh has joined the team. Shahbaz has joined the team and I think we are expecting Shreyas here till the evening. These are the replacements. Who plays in the eleven, that will be a decision taken before the game,\" shared Rathour. Asked about possible playing combinations for world cup in Australia, he said: \"That will depend on that day. We will try and give as much opportunity to everyone who will be involved with the World Cup. We are looking to do that, but how and when that will depend on the game and surfaces we are playing.\" The first T20I match between India and South Africa will be played at the Greenfield International Stadium in Thiruvananthapuram on Wednesday. The home series against South Africa comprises three T20Is and an equal number of ODIs and will be played from September 28 to October 11. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-09-28 01:21:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220928/thumb-122092800027.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"NSW Premier Cricket: Every grade’s team of the week announced","link":"https://www.cairnspost.com.au/sport/nsw-premier-cricket-saint-tees-off-and-pawson-grabs-six-in-hectic-season-opening/news-story/6d7c74049bdf15187745f383bd4f3ec9","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"EVERY week NewsLocal will rate our teams of the week from every grade of the NSW Premier Cricket season.","content":null,"pubDate":"2022-09-28 01:21:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Former cricketer Manprit Juneja bats in favour of contract system in domestic cricket","link":"https://sportstar.thehindu.com/sportstar-conclave/ahmedabad-2022/manpreet-juneja-ranji-vijay-hazare-delhi-daredevils-bcci-contract-system-domestic-cricket/article65944727.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"At a time when the cricketing fraternity appears divided on whether there should be a player contract for the domestic cricketers, Juneja bats in favour of a contract system.","content":"Manprit Juneja retired from all forms of cricket in March this year. In his long career, the batter was a key figure of the Gujarat team that won its maiden Ranji Trophy title in 2016-17 and was also a part of the sides that won the Vijay Hazare Trophy in 2015-16 and the Syed Mushtaq Ali Trophy in 2012-13 and 2013-2014 seasons respectively. It’s been six months since he has moved on from the game and the Ahmedabad-based Juneja is currently busy in the world of finance, managing his family wealth. “Not a lot of people know this but I am into the finance market. I am into equities and stuff like that and I manage most of my family wealth. That’s what is keeping me busy,” he tells Sportstar on the sidelines of the Sportstar West Sports Conclave. Aware of the uncertainty that a sportsperson goes through, especially after retirement, Juneja wants to create awareness in the sporting community about how to plan things better. “I want to create awareness among sports people so that they can understand that when they play for a span of 10-15 years, it is enough time to build enough wealth. Most players fail to do that and that’s one kind of awareness I would want to put forward,” he says. After playing domestic cricket and IPL for about a decade, Juneja got interested in the finance market about five years ago. “Sometime in 2017, I became more educated about the finance market and the potential they have to build wealth for yourself. I want to pass on this knowledge to the cricketers so that they know that if they start saving early, they can have enough corpus to take care of things for the first one or two years after retirement,” Juneja says. “While they try and figure out what to do next, this early planning can give the players that cushion. I have seen when the best of players - who have even played the IPL - retire, they feel worried as to what they would do next. But planning things in advance certainly helps…” While Juneja learnt things by himself, he believes that one should consult the experts and plan their finances accordingly, keeping the future aspect in mind. “When you played the sport, you trusted the expert - the coach, the physio. Since it is not your field, it is important that you trust an expert here as well. If you are interested in doing it yourself, then learn about the companies, learn about the returns, but you need to realise that it is something that requires equal importance and that’s something that can help you grow wealth for generations…” At a time when the cricketing fraternity appears divided on whether there should be a player contract for the domestic cricketers, Juneja bats in favour of a contract system. “Having a contract system always works. Since we are the richest cricket board, then our players also need to be the richest as well. That makes a lot of sense when the domestic players have a contract. That would also help the players build a decent corpus even though he or she is just a domestic cricketer and is not playing the IPL or the Women’s T20 league. They can still live a comfortable life and that’s most important,” he says. Since we are the richest cricket board, then our players also need to be the richest as well. — Manprit Juneja “The BCCI will eventually figure out a way on how to go about it just like the way it found a way to have a pension scheme for the retired players. I am sure the Board will figure out a way where at least the players will be paid fairly if not handsomely…” The 31-year-old Juneja played for India A and India Under-23 and represented Gujarat in 63 Ranji Trophy matches. He also played seven matches for Delhi Daredevils in the 2013 edition of the IPL. And now that he has moved on, he wants to mentor youngsters and guide them on how to be a ‘complete cricketer’ - both on and off the field. “I would like to mentor cricketers and provide them with the best platform and pass on the knowledge as to how you can be one up than your competitor. What are those things that can make you a complete cricketer and in today’s world, a complete cricketer is someone who manages things well both on and off the field,” he says. “How does a cricketer manage his life so that the family benefits from it is also important. So, mentoring is something I will be interested in, going forward…” Read more stories on Ahmedabad 2022.","pubDate":"2022-09-28 01:12:07","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB firm on hosting series against India","link":"https://www.thenews.com.pk/print/995228-pcb-firm-on-hosting-series-against-india","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pakistan Cricket Board will not surrender its rights to host India for Test or one-day series as it is the Indian team’s turn to visit Pakistan for bilateral series.A well-placed source in the PCB said that Pakistan toured India twice, first for a Test series in 2006-2007 and...","content":null,"pubDate":"2022-09-28 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB firm on hosting series against India","link":"https://www.thenews.com.pk/print/995228-pcb-firm-on-hosting-series-against-india","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pakistan Cricket Board will not surrender its rights to host India for Test or one-day series as it is the Indian team’s turn to visit Pakistan for bilateral series.A well-placed source in the PCB said that Pakistan toured India twice, first for a Test series in 2006-2007 and...","content":null,"pubDate":"2022-09-28 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘Something has to give’: Top Aussie women face new problem, ‘next frontier’","link":"https://www.foxsports.com.au/cricket/meg-lanning-withdraws-from-domestic-season-rachel-haynes-says-she-wont-be-last/news-story/f0e90e8f7cb74159bcd66b977499e297","keywords":null,"creator":null,"video_url":null,"description":"World Cup-winning skipper Meg Lanning is one of the first Aussie internationals to make herself unavailable for the domestic cricket season and former Southern Stars teammate Rachael Haynes has predicted she won’t be the last.","content":"World Cup-winning skipper Meg Lanning is one of the first Aussie internationals to make herself unavailable for the domestic cricket season and former Southern Stars teammate Rachael Haynes has predicted she won’t be the last. The Melbourne Stars icon will miss the upcoming WBBL season as the Australian captain continues her indefinite leave from the game after leading the national side to Commonwealth Games gold in Birmingham. In comparison, Lanning’s vice-captain Haynes has called time on her own 13-year international career that included 167 games across all formats but will lead Sydney Thunder in WBBL08 before calling stumps. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > But as the popularity and professionalism of women’s sport grows, and the Aussie women take centre against a touring schedule that includes tours of India, a T20 World Cup in South Africa and an Ashes series in England in the next 10 months, Haynes has a simple warning: “Something has to give.” “Meg has her own reasons for taking a break but for the first time our athletes are asking themselves what does finding balance look like,” Haynes said. “We are experiencing all these amazing opportunities and now we are at the point that individuals need to work out what are the good opportunities to take. “Playing for your country is one of those. “But you do have to ask yourself, where do domestic tournaments now sit? Do you make yourself available or is taking a break more beneficial to your performance at an international level. Aussie cricket star Rachel Haynes (right). Source: Getty Images “Balancing your time in amongst the excitement and growth of women’s cricket is something we are thinking more deeply about because it’s easy to get caught up. “There’s a level of performance and pressure expected from internationally contracted players and I think finding the balance for individuals, is our next frontier. “It’s about taking a look at the next 12 months and seeing where international and domestic cricket sits amongst that. “Anticipating that you’ll be part of everything is a lofty goal for the best players in the world. “And I think you’ll see more international players sitting out domestic competitions.” Haynes scored nearly 4000 runs across all three formats, including 98 on Test debut against England in 2009, two ODI centuries and 19 half-centuries. She played pivotal roles in Australia’s Women’s T20 World Cup victories in 2018 and 2020, Women’s World Cup win in 2022 and Australia’s historic Commonwealth Games gold medal run in July. Haynes, who currently serves as a director for the Australian Cricketers Association, won’t be drawn on the future of Lanning but has endorsed the sport for Brisbane Olympics 2032. “I think there’s a mutually beneficial goal for both the IOC - in regards to the Olympics and its standing in Asia and I know cricket would love to leverage the American market. “Whether cricket is included or not, what I do know is that the growth of cricket - and women’s sport will continue to grow.” COVERAGE of this year’s WBBL is part of Kayo’s commitment to women’s sport which features a record number of broadcast hours throughout September and October. The WBBL starts on October 13 and only KAYO Sports will have every WBBL match live and on demand.","pubDate":"2022-09-27 23:28:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Brighton's Adam Webster used to prefer playing cricket","link":"https://www.theargus.co.uk/sport/22756161.brightons-adam-webster-used-prefer-playing-cricket/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Adam Webster has revealed he wanted to take a break from football – to concentrate on cricket.","content":null,"pubDate":"2022-09-27 23:04:05","image_url":"https://www.theargus.co.uk/resources/images/15918866/?type=app&htype=0","source_id":"theargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Saint Lucia Kings vs Jamaica Tallawahs, Eliminator, Caribbean Premier League 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1jb21tZW50YXJ5LzQ5Nzg5L2p0LXZzLXNsay1lbGltaW5hdG9yLWNhcmliYmVhbi1wcmVtaWVyLWxlYWd1ZS0yMDIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Saint Lucia Kings vs Jamaica Tallawahs, Eliminator, Caribbean Premier League 2022  CricbuzzHighlights | Guyana Amazon Warriors vs Barbados Royals | CPL 2022  CPL T20Barbados Royals seal spot in Final | Hero CPL  Cricket WorldSLK vs JAM Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs  News18Caribbean Premier League Tips Game 31: Tallawahs well-equipped for final run  Betting.betfairView Full coverage on Google News","content":null,"pubDate":"2022-09-27 23:03:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Don’t think I’ll ever do it unless…”: Moeen Ali exclaims he’s open to Mankading only under one specific condition","link":"https://thesportsrush.com/cricket-news-dont-think-ill-ever-do-it-unless-moeen-ali-exclaims-hes-open-to-mankading-only-under-one-specific-condition/","keywords":["Cricket","Mankad run out","Mankading","Moeen Ali"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Moeen Ali exclaims he’s open to Mankading only under one condition, as debates and discussions on the issue continue unabated. Ever since India allrounder Deepti Sharma ‘Mankaded‘ or effected a run out at the non-striker’s end to dismiss England’s Charlotte Dean and their hopes to avoid a home series clean sweep, fans, experts, former and… The post “Don’t think I’ll ever do it unless…”: Moeen Ali exclaims he’s open to Mankading only under one specific condition appeared first on The SportsRush.","content":"Ever since India allrounder Deepti Sharma ‘ ‘ or effected a run out at the non-striker’s end and their hopes to avoid a home series clean sweep, fans, experts, and current cricketers have opined on the ‘for and against’ the genuineness of the dismissal, despite it being well-within the laws of the game. While some agree with the law, the same lot strangely, also have a problem with it being used to determine a match outcome. While the others bring in the ‘spirit of the game’ to the fold, the others go as far as terming the act itself as ‘cheating’, which involves no skill on the bowler’s part. Dean is already out of her crease while Deepti still has to bring her right arm over. Unless Dean ‘expected’ Deepti to bowl underarm, there was still plenty more action left before the delivery was completed. — Derek Alberts (@derekalberts1) England’s interim skipper Moeen Ali, who is set to lead his side in today’s fifth T20I versus Pakistan at the Gaddafi Stadium in Lahore, also came up with his opinions on the law ahead of the match eve. With a number of serious debates on the issue having already taken place, Moeen Ali has now exclaimed that he would only consider ‘Mankading’ a batter in case he is very angry on that particular player. Stating this form of dismissal as ‘not his thing’, Ali further added that despite players having the right to do it with the law’s backing, he hopes it doesn’t become a routine thing. “No it’s not my thing,” said Moeen. “I don’t think I’ll ever do it unless I was really angry with someone. “It’s the laws and there’s nothing illegal so people that do it have the right, but I just hope it doesn’t become a common thing, or something that’s regularly done. You’re not really working to get a wicket. At least with a run-out, there’s a bit of work that has to be done, and with all the other dismissals. This is just waiting for the guy and taking the bails off. Even when I played cricket as a kid in the garden, it’s not my thing to do.” The 35-year-old further goes on to suggest that the umpires can hand out warning(s) in case the non-striker is found dangling outside the crease before the bowler’s release point. However, he perhaps did not find it necessary to speak/demonstrate on how easy it is for the non-striker to just stay inside the crease before the bowler performs his basic act!","pubDate":"2022-09-27 19:59:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022 Points Table: Updated standings after Bhilwara Kings vs Gujarat Giants Match 9","link":"https://www.sportskeeda.com/cricket-news/news-legends-league-cricket-2022-points-table-updated-standings-bhilwara-kings-vs-gujarat-giants-match-9?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"Match nine of the Legends League Cricket 2022 saw the Bhilwara Kings take on Gujarat Giants at the Barabati Stadium in Cuttack on Tuesday (September 27). A solid all-round performance saw the Bhilwara Kings beat the Gujarat Giants convincingly to move up the table. After being asked to bat first, contributions from Morne van Wyk (50), William Porterfield (54), and Jesal Karia (43) helped the Kings post a mammoth 222 on the board. The Giants faltered in the chase. Yashpal Singh came lower down the order and scored 57 but it wasn’t enough as they were knocked over on 165, losing the game by 57 runs. With this big win over the Giants, the Bhilwara Kings have moved into the second spot. They have boosted their net run-rate to -0.227. They pip the Giants, who sit below the Kings due to a poor net run-rate of -0.418. Both sides have won two games each and will look to move ahead the next time they take the field. India Capitals continue to top the Legends League Cricket 2022 table. They also have five points under their belt but have a healthy net run-rate of 1.304. They will be hoping to stay at the top of the table and seal a berth in the knockout stages of the competition. The Manipal Tigers are placed at the bottom of the table. They have managed to win just one game out of four and have three points to their name after one fixture was washed out due to rain. They will have to bring their A-game as they have a net run-rate of -0.411 and will need something special to make it to the playoffs. The 10th match of the Legends League Cricket 2022 will see India Capitals take on the Manipal Tigers at the Barabati Stadium in Cuttack. The Capitals are the table-toppers whereas the Tigers are placed at the bottom of the table. The Capitals will look to retain their top spot whereas the Tigers will be hoping to grab a crucial two points going ahead in the competition. The Tigers will hope to fire in unison and challenge the upbeat Capitals on Thursday. Q. 0 votes so far","pubDate":"2022-09-27 19:43:20","image_url":"https://static.sportskeeda.com/editor/2022/09/6da9b-16643036346025-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: India look to address death bowling concerns in final tune up ahead of T20 WC","link":"https://kashmirreader.com/2022/09/28/india-vs-south-africa-india-look-to-address-death-bowling-concerns-in-final-tune-up-ahead-of-t20-wc/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"THIRUVANANTHAPURAM: India will be looking to round off their T20 World Cup preparation with a marked improvement in their death bowling besides providing crucial game time to its untested players in the three-match series against South Africa, beginning here on Wednesday. India skipper Rohit Sharma, expectedly, singled out death bowling as an area that requires […]","content":"THIRUVANANTHAPURAM: India will be looking to round off their T20 World Cup preparation with a marked improvement in their death bowling besides providing crucial game time to its untested players in the three-match series against South Africa, beginning here on Wednesday. India skipper Rohit Sharma, expectedly, singled out death bowling as an area that requires improvement following the series win over Australia. The hosts will be without two of their key bowlers, Hardik Pandya and Bhuvneshwar Kumar, who have been rested ahead of the ICC event next month. Mohammed Shami, who is one of the World Cup reserves, is yet to recover from Covid-19 and will be missing the three games against the Proteas after being unavailable for the rubber against Australia. Harshal Patel did not have the best of times in his comeback series against Australia but he will be expected to get back to his best in the final three games before the World Cup. His career economy rate stands at 9.05 but he conceded more than 12 runs per overs against the Aussies. Deepak Chahar, who is also on standby for the Word Cup, did not get a game in the previous series and he could get a chance if the team decides to rotate its pacers over the three games. Arshdeep Singh will return to bolster the team’s resources in the slog overs, making an effective combination alongside Jasprit Bumrah, who will be aiming to regain his full rhythm after coming back from injury. In the series decider against Australia, Yuzvendra Chahal showed what he can do if the ball is gripping and turning after looking flat in the first two games. Keeping the Australian conditions in mind, the wily leg-spinner will be looking to up his game on docile pitches. As Rohit spoke about the importance of giving all the players game time ahead of the World Cup, R Ashwin could get a look in. In the batting department, KL Rahul would like to make the most of these three games after missing out in the last two games against Australia. Dinesh Karthik got to play all of eight balls against Australia and Rohit has already said the designated finisher in the squad needs more time in the middle. World Cup bound Deepak Hooda will end up missing all the six games before the mega event as he has been ruled out of the South Africa T20s with a back injury. Shreyas Iyer is expected to take Hooda’s place in the squad. Over the next week, India will be competing against a team they are yet to beat at home in a bilateral series. South Africa and India will face each other in a group game in Australia and though conditions are totally different here, both teams can pick out areas to target in the coming three games. “The pitches in Australia will be different and ground size will be a lot bigger, but as a bowler there is always something you can work on. It is a great opportunity to be bowling at these Indian batters and pick up on a few things and use them against them in the World Cup,” said Tabraiz Shamsi. All eyes will also be on the young Tristian Stubbs who has made the World Cup squad on the back of his good show in franchise cricket. Match starts 7 PM IST. — PTI India vs South Africa: India look to address death bowling concerns in final tune up ahead of T20 WC added by Press Trust of India on 12:54 am September 28, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-09-27 19:24:08","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket: Bhilwara Kings thrash Gujarat Giants by 57 runs to return to winning ways","link":"https://www.indiatoday.in/sports/cricket/story/legends-league-cricket-bhilwara-kings-thrash-gujarat-giants-by-57-runs-to-return-to-winning-ways-2005584-2022-09-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket: Bhilwara Kings thrash Gujarat Giants by 57 runs","content":null,"pubDate":"2022-09-27 18:19:34","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Sports Journalists Federation of India honours Gavaskar, Shastri","link":"https://telanganatoday.com/sports-journalists-federation-of-india-honours-gavaskar-shastri","keywords":["News","Sport","Ravi Shastri","Sports Journalists Federation of India","Sunil Gavaskar"],"creator":["Telangana Today"],"video_url":null,"description":"Sports Journalists Federation of India (SJFI) honoured Indian cricketer great Sunil Gavaskar with SJFI Medal and Ravi Shastri with honourary life membership,","content":"Hyderabad: Sports Journalists Federation of India (SJFI) honoured Indian cricket legend Sunil Gavaskar with SJFI Medal and Ravi Shastri with honourary life membership, at a felicitation function in Thiruvananthapuram, on Tuesday. Speaking at the function, both Gavaskar and Ravi Shastri lauded the Print media and its contribution to the field of sports. “When I hit six sixes (off Tilak Raj in the Ranji Trophy), it was The Hindu that carried photos of all six sixes, there was no television. That’s how important print media was. Having been part of the media since I finished the game, I realised that it is a very responsible profession where you can actually brainwash people, you can actually make them believe what you say is gospel, which shouldn’t be the case. You got to respect that professional, you got to respect the individual you are talking about and take the game forward. Where I see a sea change in the media is competition, and with competition comes hard acts, tactics, one-upmanship, jealousy,” he Ravi Shastri.","pubDate":"2022-09-27 17:46:12","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Tributes pour in as Jhulan Goswami retires from international cricket","link":"https://sportstar.thehindu.com/videos/tributes-pour-in-as-jhulan-goswami-retires-from-international-cricket/article65943588.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-27 17:22:26","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"England Cricket Board offers to host India vs Pakistan Test series","link":"https://www.indiatoday.in/sports/cricket/story/england-cricket-board-offers-to-host-india-vs-pakistan-test-series-2005555-2022-09-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"ECB offers to host India vs Pakistan Test series","content":null,"pubDate":"2022-09-27 17:17:14","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"England offers to host Indo-Pak Test series, BCCI 'not interested': Report","link":"https://www.business-standard.com/article/sports/england-offers-to-host-indo-pak-test-series-bcci-not-interested-report-122092701328_1.html","keywords":null,"creator":null,"video_url":null,"description":"England and Wales Cricket Board has informally offered to be the hosts if India and Pakistan plan to play a bilateral Test series but BCCI sources said chances of that happening in near future is \"next to nil\". The UK daily 'Telegraph' reported that \"Martin Darlow, the deputy chairman of the England and Wales Cricket Board, has held talks with the Pakistan Cricket Board during the current Twenty20 series and offered England's grounds as venues for ideally a three-match Test series in future.\" While the ECB has made the offer for its own commercial gains, the powers that be in the BCCI laughed off the suggestions and said that no such possibilities might arise at least in next few years. \"Firstly, ECB spoke to PCB about an Indo-Pak series and that's a bit weird. In any case, a series against Pakistan is not something that the BCCI will decide but it is the decision of the government. As of now, the stance remains the same. We only play Pakistan at multi-team events,\" a senior BCCI ..","content":"England and Wales Cricket Board has informally offered to be the hosts if India and Pakistan plan to play a bilateral Test series but BCCI sources said chances of that happening in near future is \"next to nil\". The UK daily 'Telegraph' reported that \"Martin Darlow, the deputy chairman of the England and Wales Cricket Board, has held talks with the Pakistan Cricket Board during the current Twenty20 series and offered England's grounds as venues for ideally a three-match Test series in future.\" While the ECB has made the offer for its own commercial gains, the powers that be in the BCCI laughed off the suggestions and said that no such possibilities might arise at least in next few years. \"Firstly, ECB spoke to PCB about an Indo-Pak series and that's a bit weird. In any case, a series against Pakistan is not something that the BCCI will decide but it is the decision of the government. As of now, the stance remains the same. We only play Pakistan at multi-team events,\" a senior BCCI official privy to India's position told PTI on Tuesday. India and Pakistan last played a short bilateral white-ball series back in 2012 in India and the last Test series dates back to 2007. With the tense political relations between the neighbours, it is a big 'No' from BCCI irrespective of whether it is played at home, away or a neutral venue. The newspaper states precisely the reason why ECB made the \"generous offer\". \"The matches would attract big crowds in the UK, which has a large ex-pat south Asian population,\" it said. \"The matches attract huge sponsorship revenue and television audiences.\" However, the paper made it clear that even \"PCB is not keen on playing India at neutral venue but are grateful for the ECB's offer, which shows the growing relationship between the two boards.\" It stated that with the big nations again starting to tour Pakistan, it will be a \"retrograde step in their eyes\" if they happen to play on a neutral venue. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-09-27 17:10:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220927/thumb-122092701328.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IND A vs NZ A | Sanju Samson hits half-century: India win series 3-0","link":"https://thenewsglory.com/ind-a-vs-nz-a-sanju-samson-hits-half-century-india-win-series-3-0/","keywords":["Sports","Cricket","game","India","Sanju Samson"],"creator":["The News Glory"],"video_url":null,"description":"Chennai: India-A won the ODI series against New Zealand-A by 3-0. Sanju Samson had scored a half-century in the third match. New Zealand-A toured India and played 3 Tests and 3 ODIs. The entire ODI series was held at the Chennai-Chepakkam Cricket Ground. India-A team was led by Sanju Samson as the captain in this […]","content":"Chennai: India-A won the ODI series against New Zealand-A by 3-0. Sanju Samson had scored a half-century in the third match. New Zealand-A toured India and played 3 Tests and 3 ODIs. The entire ODI series was held at the Chennai-Chepakkam Cricket Ground. India-A team was led by Sanju Samson as the captain in this series. India batted first and scored 284 runs in the third and final ODI today. Captain Sanju Samson and Thilak Verma put on a partnership of 99 runs. Tilak Verma was out after scoring 50 runs. Samson was out for 54 runs and Shardul Thakur was out for 51 runs. New Zealand chased down the target of 285 runs to win. But the team scored only 178 runs and lost all the wickets. With that, the Indian team won by 106 runs. clinched the series 3-0. India won the first match by 7 wickets and the second match by 4 wickets.","pubDate":"2022-09-27 16:36:16","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Facing The New Ball Bowlers In India Is Quite Challenging – Temba Bavuma","link":"https://thetimesofbengal.com/sports/facing-the-new-ball-bowlers-in-india-is-quite-challenging-temba-bavuma/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"South Africa National Cricket Team white-ball captain Temba Bavuma has stated that facing the new ball bowlers in the Indian conditions is going to be challenging for the Proteas batters in the upcoming limited-overs series against the Men In Blue. The South Africa tour of India 2022 consists of a three-match ODI series and a […]","content":"South Africa National Cricket Team white-ball captain Temba Bavuma has stated that facing the new ball bowlers in the Indian conditions is going to be challenging for the Proteas batters in the upcoming limited-overs series against the Men In Blue. The South Africa tour of India 2022 consists of a three-match ODI series and a three-match T20I series. The T20I games will be played on September 28, October 2 and October 4 in Thiruvananthapuram, Guwahati and Indore. The ODI games are scheduled to be played in Ranchi, Lucknow and Delhi on October 6, October 9 and October 11. ICC Teams Rankings | ICC Players Rankings Temba Bavuma PC- Getty Images At a pre-match press conference, Temba Bavuma said that not losing wickets in the powerplay overs is going to be crucial for the Proteas. “Facing the new ball bowlers (in India) is quite challenging, they make the ball to swing and move in quite a bit, a bit more than what we are accustomed to in South Africa. That’s obviously a challenge you have to manoeuvre around,” the South African white-ball skipper said on the eve of the opening T20I. “The key is to limit the damage and not allow the wickets to fall and try and get the momentum going. But yeah, Bhuvi and Bumrah they always challenge you with the new ball up front,” he added. Rohit and Virat are big names with big pedigree behind them – Temba Bavuma Virat Kohli Rohit Sharma. Image Credits: BCCI Proteas captain further talked about the star India batters Rohit Sharma and Virat Kohli and asserted: “Obviously, those — Rohit and Virat — are big names with big pedigree behind them, and obviously as you saw in their last while their performances have boosted the confidence of the team. “We expect to come leading from the front, and good for us to come up against the best. You expect those guys to bring a lot of confidence and X-factor into the team.” Temba Bavuma asserted that they were tested and challenged when they locked horns with the Men In Blue in the 5-match T20I series in June. “The last time we were here we were tested, we were challenged, but I think we answered it quite well. We expect this to be a good series, a competitive one as well. This is the last series before the World Cup, we will be looking to fill up the gaps whatever they are,” he added. Temba Bavuma and Rishabh Pant, IND vs SA (Credits: BCCI) Bavuma also said that his role in the team is to make sure that everyone is in the “best space possible” heading into the ICC Men’s T20 World Cup 2022. “I’m here to make sure the guys are in the best space possible going into that big World Cup tournament. All the other distractions, side-shows as I would call it, I will deal with on a personal level. “But being here within the team, as long as I am still wearing the shirt, it will be to serve and lead the team as best as I can,” the 32-year-old said. Also Read: IND vs SA: One Of The Main Reasons Why Bhuvneshwar Kumar Seems To Be Off The Boil Is Playing Too Much Cricket – Sanjay Manjrekar Get All Cricket match prediction and fantasy Tips – CLICK HERE Cricket Match Prediction | T20 World Cup Match Prediction | Today Match Fantasy Prediction | Fantasy Cricket Tips | Cricket News and Updates | Cricket Live Score !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-09-27 15:44:23","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"ECB developing proposal to host Tests between India and Pakistan","link":"https://www.theguardian.com/sport/2022/sep/27/ecb-developing-proposal-to-host-tests-between-india-and-pakistan","keywords":["Cricket","Pakistan cricket team","India cricket team","ECB","Sport politics","Sport"],"creator":["Andy Bull in Lahore"],"video_url":null,"description":"Negotiations described as ‘work in progress’PCB looking to push back against new franchise leaguesThe England and Wales Cricket Board is developing a proposal to host Test cricket between Pakistan and India on neutral ground in England.It has been 15 years since the two countries last played a Test match against each other, and 10 since they last played a white-ball series. Since then, the fixture, which has the highest profile in world cricket, has taken place only when they have been drawn against each other in International Cricket Council tournaments. Continue reading...","content":"The England and Wales Cricket Board is developing a proposal to host Test cricket between Pakistan and India on neutral ground in England. It has been 15 years since the two countries last played a Test match against each other, and 10 since they last played a white-ball series. Since then, the fixture, which has the highest profile in world cricket, has taken place only when they have been drawn against each other in International Cricket Council tournaments. The negotiations are described as a “work in progress” but the ECB board member Martin Darlow has made it clear to both the Pakistan Cricket Board and the Board of Control for Cricket in India that England are keen to host the matches if the opportunity arises. Strauss off key as he seeks to strike the right chord for English cricket | Jonathan Liew Read more There is a possibility that it may happen anyway if the two teams reach the World Test Championship final in 2023, which will be played at the Oval. But that is unlikely since India are fourth in the standings, and Pakistan fifth. There is also the 2025 WTC final at Lord’s. But the idea has also been discussed of arranging a one-off Test between the sides at Edgbaston, and, beyond that, even a three-Test series. The ECB’s offer is motivated by the belief it is important for the popularity of Test cricket around the world to get the two teams playing each other again. England previously hosted Pakistan in both Test and T20 series against Australia in 2010, when they were unable to play in their own country after the terrorist attack on the Sri Lanka team in 2009 . The idea of reprising the arrangement fell away when relations between the ECB and PCB soured after the spot-fixing scandal that broke later that summer. After years of hard work to repair their reputation as an international venue, the PCB’s preference is for any potential India v Pakistan series to be played in one of the two countries involved. But political relations between their governments may make that unlikely in the near future. India and Pakistan went 18 years without a Test in the 1960s and late 1970s, but the teams played against each other regularly in the decades afterwards. The last was a three‑Test series in India in 2007, which the hosts won 1-0. It has now been 15 years, and, unless plans change, this latest interregnum will end up as the longest gap between their fixtures since Pakistan won Test match status in 1952. The series is bigger than the Ashes, bigger, in fact, than almost any other bilateral event in world sport, and its resumption would be a fillip for Test cricket at a time when it is under more pressure than ever. Virat Kohli against Australia, but he could face Pakistan in Test cricket in England. Photograph: Pankaj Nangia/Getty Images England’s Moeen Ali is a supporter of the idea. “That would be awesome, brilliant,” he said. “It’s a shame that they don’t play each other unless it’s a World Cup or an ICC event because they’re two great teams and two massive playing nations. With the viewing figures involved, it would be one of the biggest games, and it’s not been done for a very long time. It would be a great game because Pakistan have a really good bowling attack, and India have a great Test side. It would be really good.” His home city of Birmingham, which hosted fixtures between the teams during the Champions Trophy in 2013 and 2017, is seen as the obvious neutral venue. The PCB is also looking to cooperate with other boards as it seeks to push back against new franchise cricket leagues, in particular the UAE’s ILT20, which launches in January. Several ICC member nations are alarmed by the league’s rules on overseas players, which allow as many as nine per team. Before the next ICC meeting in November, moves are under way to arrange a joint response in which several full member nations adopt a blanket position of denying their contracted players permission to take part in the competition.","pubDate":"2022-09-27 15:36:49","image_url":"https://i.guim.co.uk/img/media/56fba1632d90284c8d3d35073034616ce8d111dd/0_62_3613_2167/master/3613.jpg?width=460&quality=85&auto=format&fit=max&s=ba05863fde21e9566458a1935451a4ea","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Sanju Samson To Be Shikhar Dhawan’s Deputy In South Africa ODIs – Reports","link":"https://thetimesofbengal.com/sports/sanju-samson-to-be-shikhar-dhawans-deputy-in-south-africa-odis-reports/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Star India National Cricket Team wicketkeeper-batter Sanju Samson is most likely to be appointed as the vice-captain of the team for the forthcoming three-match ODI series against the South Africa National Cricket Team, according to an ANI report. India are set to lock horns with South Africa in a three-match ODI series and a three-match […]","content":"Star India National Cricket Team wicketkeeper-batter Sanju Samson is most likely to be appointed as the vice-captain of the team for the forthcoming three-match ODI series against the South Africa National Cricket Team, according to an ANI report. India are set to lock horns with South Africa in a three-match ODI series and a three-match T20I series. The T20I games will be played on September 28, October 2 and October 4 in Thiruvananthapuram, Guwahati and Indore. The ODI games are scheduled to be played in Ranchi, Lucknow and Delhi on October 6, October 9 and October 11. ICC Teams Rankings | ICC Players Rankings Sanju Samson, Rishabh Pant. (Photo: Twitter) Several key players of the Indian team are most likely to be rested for the South Africa ODIs, which will be the last international assignment of the Men In Blue ahead of the ICC Men’s T20 World Cup 2022. The ICC Men’s T20 World Cup 2022 is the eighth edition of the multi-nation tournament. The marquee tournament is scheduled to commence on October 16 with the group stage round. The Super 12 round will commence on October 22 and the summit clash is set to take place on November 13 at the Melbourne Cricket Ground. Shikhar Dhawan To Lead, Sanju Samson To Be Vice-captain In South Africa ODIs: Reports Sanju Samson. (Photo: Twitter) The ODI squad of the India National Cricket Team for the three-match series will reportedly be announced in the next few days. Ahead of the official squad announcement, BCCI sources told ANI that Sanju Samson could be named Shikhar Dhawan’s deputy for the three-match ODI series in the absence of several seniors. The 27-year-old Sanju Samson, who is not a part of India’s ICC Men’s T20 World Cup 2022 squad, is currently captaining India A at home in the series against New Zealand A. Also, Madhya Pradesh batter Rajat Patidar, who plays for the Royal Challengers Bangalore (RCB) in the Indian Premier League (IPL) is likely to make his ODI debut in the series against South Africa. So far, he has played 12 IPL games and has scored 404 runs at an average of 40.4 and a strike rate of 144.3, reported ANI. Virat Kohli and Rajat Patidar (Image Credits: IPL) Also Read: IND vs SA: One Of The Main Reasons Why Bhuvneshwar Kumar Seems To Be Off The Boil Is Playing Too Much Cricket – Sanjay Manjrekar Get All Cricket match prediction and fantasy Tips – CLICK HERE Cricket Match Prediction | T20 World Cup Match Prediction | Today Match Fantasy Prediction | Fantasy Cricket Tips | Cricket News and Updates | Cricket Live Score !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-09-27 15:28:22","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Sanju Samson set to be named vice-captain of Indian cricket team for THIS series - Check Details","link":"https://zeenews.india.com/cricket/ind-vs-sa-2022-sanju-samson-to-be-named-vice-captain-rajat-patidar-likely-to-make-debut-2515080.html","keywords":null,"creator":null,"video_url":null,"description":"The first T20I will be held in Thiruvananthapuram on September 28. The second T20I will be played on October 2 at Guwahati, followed by the last T20I at Indore on October 4.","content":"Wicket-keeper batter Sanju Samson is likely to be named vice-captain of the Indian team for the three-match ODI series against South Africa with many senior players expected to be rested ahead of next month's ICC T20 World Cup. India will take on South Africa in the three-match T20I series followed by the three-match ODI series from September 28 to October 11. The Indian squad for the T20I series has already been announced and the Indian selectors are likely to finalize the squad for the ODI series in the next few days. All set for the #INDvSA T20I series. #TeamIndia | @mastercardindia pic.twitter.com/UR4erC0zP4 — BCCI (@BCCI) September 27, 2022 BCCI sources told ANI that Sanju Samson could be named the vice-captain of the Indian team for the three-match ODI series as most of the senior players are likely to be rested for ICC T20 World Cup. Shikhar Dhawan is likely to lead the team. Sanju Samson, 27, who hails from Kerala, was part of the ODI series against Zimbabwe which India won 3-0. He has represented India in seven ODIs and 16 T20Is so far. Samson is currently captaining India A side at home against New Zealand A. The source said that batter Rajat Patidar is likely to make his ODI debut against South Africa. The first T20I will be held in Thiruvananthapuram on September 28. The second T20I will be played on October 2 at Guwahati, followed by the last T20I at Indore on October 4. The first ODI will be played in Lucknow on October 6. Ranchi and Delhi will host the second and third ODI respectively, on October 9 and 11. India squad for South Africa T20Is: Rohit Sharma (C), KL Rahul (VC), Virat Kohli, Suryakumar Yadav, Rishabh Pant (WK), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar and Jasprit Bumrah. South Africa T20 squad: Temba Bavuma (C), Quinton de Kock (WK), Reeza Hendricks, Heinrich Klaasen, Keshav Maharaj, Aiden Markram , David Miller , Lungi Ngidi, Anrich Nortje, Wayne Parnell, Dwaine Pretorius, Kagiso Rabada, Rilee Rossouw, Tabraiz Shamsi and Tristan Stubbs. South Africa ODI squad: Temba Bavuma (C), Quinton de Kock (WK), Reeza Hendricks, Heinrich Klaasen, Keshav Maharaj, Janneman Malan, Aiden Markram, David Miller, Lungi Ngidi, Anrich Nortje, Wayne Parnell, Andile Phehlukwayo, Dwaine Pretorius, Kagiso Rabada and Tabraiz Shamsi.","pubDate":"2022-09-27 15:03:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"How Legends League Cricket Aims To Help Women Empowerment","link":"https://sports.ndtv.com/cricket/how-legends-league-cricket-aims-to-help-women-empowerment-3382706","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Ahead of the Legends League match between Bhilwara Kings and Gujarat Giants, the League's co-founder and CEO, Raman Raheja spoke to NDTV on how he sees the success and what is the roadmap ahead.","content":"The second edition of Legends League Cricket is currently being played in India. After hosting matches in Kolkata, Lucknow, and Delhi, the action has now shifted to Cuttack. The crowd turnout has been really good at all the centres and it is safe to say that just like the first edition, the second is also destined for success. Ahead of the Legends League match between Bhilwara Kings and Gujarat Giants, the League's co-founder and CEO, Raman Raheja spoke to NDTV on how he sees the success of the tournament and what is the roadmap ahead. \"More than me enjoying, the fans are loving it. The idea of you know, bringing it to India -- which is the home of world cricket now, most of the audience comes from India and the sub-continent. The idea was to make it big and India obviously, helps bring that up. The audience loves it and when the audience loves it, the story of the product's success really starts to show up. It is quality cricket happening so it is really good,\" said Raheja. It is important to note that in all the Legends League games so far, women umpires have held a key role and they continue to be the on-field officials. The League Co-founder explained why having women umpires was a conscious decision. \"In fact, this idea was used by us in the first edition as well where women empowerment has been one of our key initiatives. We want to bring unique ways of involving women in sports. It is about the match officials as well, they are equally good as men's umpires. It is a good success that we have seen because one of the umpires who was working with us last season, she was from Hong Kong and when she went back home, she literally had a celebrity status where girls are coming up and asking how they can become umpires and host international matches, which is a very good story,\" said Raheja. The first edition of the tournament was played in Oman and it was a raging success. So, what made the organisers come to India? \"I would be lying if I said so (plans on hosting the second edition in India right from the very start). We had great success in Oman but we had a lot of fans for this event to be hosted in India. This is the 75th year of Indian independence and we felt as a league, we could support the celebrations by bringing the league to India. In the month of July we decided, if everything permits, we should be hosting it in India. And that's exactly how the plan changed from Oman to India,\" said Raheja. Barkatullah Khan Stadium in Jodhpur would also be hosting the matches of the tournament after the Cuttack leg. The ground had last hosted an international match way back in 2002 -- India vs West Indies. So, what made the organisers choose a stadium which has not hosted an international game for more than 20 years? \"We started from Kolkata, Lucknow, Delhi, Cuttack and now we would go to Jodhpur. Jodhpur has not hosted any international match for the last 20 years. That is the one objective that we want to promote the game, especially in the regions, where there are huge followers but there is limited cricket happening there. International cricket may not be possible to take into smaller centres regularly so we decided to support and compliment the active cricket, and that is how Jodhpur was selected,\" said Raheja. Promoted Lastly, the League Co-Founder and CEO also spoke about how the league will just focus on bringing more legends on board, and how he does not wish to hamper the current cricket eco-system. \"Our business model is about players who have retired, we want to build an eco-system of those cricketers who do not get assignments like commentary or coaching but have done so much for the country or club cricket, those are the ones we want to rope in. Our business model revolves around that. It is about the entire ecosystem of the legends -- be it umpires as well. We do not want to interfere with the current cricket system,\" said Raheja.","pubDate":"2022-09-27 14:46:26","image_url":"https://c.ndtvimg.com/2022-09/kefp5lh_cuttack-legends-league-final-_625x300_23_September_22.jpeg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"We Don’t Have A Finisher Like Hardik Pandya – Ex-Pakistan Captain Shahid Afridi","link":"https://thetimesofbengal.com/sports/we-dont-have-a-finisher-like-hardik-pandya-ex-pakistan-captain-shahid-afridi/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Former Pakistan National Cricket Team captain Shahid Afridi has said that the Men In Green don’t have a player like India’s Hardik Pandya in the T20I team, who is capable of bowling crucial overs and has the ability to finish off the games with the bat. Hardik is one of the most valuable players of […]","content":"Former Pakistan National Cricket Team captain Shahid Afridi has said that the Men In Green don’t have a player like India’s Hardik Pandya in the T20I team, who is capable of bowling crucial overs and has the ability to finish off the games with the bat. Hardik is one of the most valuable players of the India National Cricket Team in limited-overs cricket. He has played 73 T20Is and has scored 989 runs at an average of 25.4 and a strike rate of 148.5. With the ball, he has been very impactful as he has picked up 54 wickets. ICC Teams Rankings | ICC Players Rankings Shahid Afridi. Pic Credits: Twitter Meanwhile, Sports presenter Sawera Pasha asked Afridi whether Pakistan require a player like Hardik Pandya in the T20I side. “We require a player like Hardik Pandya. A player who is reliable, who comes down the order, bowls crucial overs and finishes the match with the bat. Do you think there is any player in the Pakistan team who is taking responsibility for finishing the matches with the bat?” Sawera asked Afridi in a Samaa TV show. Afridi replied that Pakistan don’t have a finisher like Hardik, who can consistently do the job. “You are right. This kind of a finisher (like Pandya) we don’t have. We thought Asif Ali, and Khushdil will do the job but they haven’t. Nawaz is also not that consistent, and neither is Shadab. Among these four players, at least two need to be consistent. The period in which Shadab bowls is very crucial. The day he does a good job with the ball, Pakistan wins,” Afridi said. If Pakistan are dreaming to win the World Cup then they need to work a lot on their bowling and batting – Shahid Afridi Shahid Afridi. Image Credits: Twitter Afridi further said that the Men In Green will have to make massive improvements in both the batting and bowling departments if they want to win the ICC Men’s T20 World Cup 2022 in Australia. “In the kind of pitches on which we are playing now, you need two genuine fast bowlers and one all-rounder. The new guy Jamal that we have picked, why don’t you play him? Play him as an all-rounder, make him bowl and then ask him to bat. You will get to know what type of cricketer he is. “If Pakistan is dreaming to win the World Cup then they need to work a lot on their bowling and batting and minimize the mistakes that they have been committing in the last few matches,” he added. Hardik Pandya (Image Credits: Getty Images) Also Read: PAK vs ENG: “Asif Ali Has To Face More Balls” – Mickey Arthur Gives A Valuable Advice To Pakistan Ahead Of ICC T20 World Cup 2022 Get All Cricket match prediction and fantasy Tips – CLICK HERE Cricket Match Prediction | T20 World Cup Match Prediction | Today Match Fantasy Prediction | Fantasy Cricket Tips | Cricket News and Updates | Cricket Live Score !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-09-27 14:08:23","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: 'Cricket is loading'- MCG prepares for IND vs PAK clash","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-cricket-is-loading-mcg-prepares-for-ind-vs-pak-clash-india-will-face-pakistan-in-the-t20-world-cup-2022-09-27-811870","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The T20 World Cup is nearly around the corner with 19 days left for the action to begin in Australia. The World Cup in Australia will be played across seven venues, and Melbourne Cricket Ground (MCG) will be one of them. The MCG stadium, which can host more than 1 lakh people at one time, will be a witness to one of the biggest rivalries in Cricket- India vs Pakistan in the tournament. The two Asian Giants, the cricketing powerhouses, India and Pakistan are set to lock horns against each other for the third time this year, and this time it would be a World Cup match on October 23.","content":"The T20 World Cup is nearly around the corner with 19 days left for the action to begin in Australia. The World Cup in Australia will be played across seven venues, and Melbourne Cricket Ground (MCG) will be one of them. The MCG stadium, which can host more than 1 lakh people at one time, will be a witness to one of the biggest rivalries in Cricket- India vs Pakistan in the tournament. The two Asian Giants, the cricketing powerhouses, India and Pakistan are set to lock horns against each other for the third time this year, and this time it would be a World Cup match on October 23. Ahead of the much-awaited World Cup and the Indo-Pak clash, the Melbourne Cricket Stadium has shared the preparation updates on its social media. Sharing images of the pitch preparation, Melbourne Cricket Ground wrote, \"And just like that...Cricket is loading.\" Reacting to the Post, Cricket Australia wrote, \"You love to see it.\" Fans are also excited about seeing the preparations for the fabled T20 World Cup and replied to the post. Along with the iconic MCG, six other cities will be hosts to the T20 World Cup namely- Geelong, Hobart, Sydney, Perth, Brisbane and Adelaide. The first match hosted by Melbourne will be a blockbuster between India vs Pakistan on October 23. The Stadium will also host the final on November 13. In total, MCG will host 7 matches. India and Pakistan men have met each other twice this year, both in the Asia Cup 2022. India got the better of Pakistan in the first contest in the Group stage, while Pakistan edged past the men in blue in the second outing in Super 4. Also, the women's sides of both nations have played against each other once this year. The match between them took place in the Birmingham Commonwealth Games 2022 when India outclassed their arch-rivals in the group stage.","pubDate":"2022-09-27 13:37:13","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}