{"newsArray":[{"title":"NSD vs GBM Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Inter District T20 2021, Match 22","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nsd-vs-gbm-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-inter-district-t20-2021-match-22?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 07:18:15","full_description":"Nadia Super Dazzlers (NSD) will take on Gour Badsha Malda (GBM) in the 22nd match of the Bengal Inter District T20 2021 at the Bengal Cricket Academy Ground in Kalyani on Friday. Nadia Super Dazzlers made a winning start to their Bengal Inter District T20 2021 campaign, beating the Manbhum Warriors. Gour Badsha Malda, on the other hand, have lost their first two Bengal Inter District T20 2021 matches against Hooghly River and Uttar Dinajpur Kulik Bird. They will be eager to get off the mark at the earliest. NSD XI Rakesh Dutta (wk), Ayan Gupta, Amit Santra, Arnab Sikdar, Soumyajit Roy, Sanjoy Sadhukhan, Soumodip Bagchi, Raj Kumar Pal (c), Arupkumar Saha, Tanmoy Pramanick, Susanta Das GBM XI Pratik Das, Manas Roy Choudhury (wk), Md Nizamuddin (c), Ananta Pramanik, Md Firoz Hossain, Mrityunjoy Mandal, Jhantu Sanyal, Asit Gupta, Bakul Das, Rajdeep Chowdhury, Mintu Saha NSD vs GBM, Bengal Inter District T20 2021, Match 22 Date and Time: 3rd December, 2021, 12:45 PM IST Venue: Bengal Cricket Academy Ground, Kalyani The surface at the Bengal Cricket Academy Ground in Kalyani is expected to favor the batters, as seen in previous Bengal Inter District T20 2021 matches. Bowlers will look to make the most of the conditions upfront and pick up a few wickets in the powerplay overs. Wicketkeeper M Roy-Choudhury is a decent wicketkeeper-batter choice for your Dream11 fantasy side. He’s safe behind the stumps and can also score important runs. Batter A Gupta is an important batter for Nadia Super Dazzlers. He is also capable of doing well with the ball, with Gupta picking up two wickets in the previous game. All-rounders T Pramanick, an experienced campaigner and an excellent all-rounder, took two wickets in the last match. He will be looking to add more scalps to his name today. M Mandal is another player you must have in your Dream11 fantasy side. Although he failed to make much of an impact in the previous game, Mandal is expected to fare better on Friday. Bowler S Bagchi found success with the ball in the first game against the Manbhum Warriors, picking up two wickets in that fixture. M Roy Choudhury (GBM) – 78 points T Pramanick (NSD) – 76 points M Mandal (GBM) – 72 points S Bagchi (NSD) – 68 points S Roy (NSD) – 64 points M Roy Choudhury: 62 runs T Pramanick: 2 wickets M Mandal: 10 runs and 2 wickets S Bagchi: 2 wickets S Roy: 47 runs Fantasy Suggestion #1: M Roy Choudhury, A Gupta, M Nizamuddin, A Santra, T Pramanick, M Mandal, S Roy, M Firoz Hossain, S Bagchi, R Kumar Pal, B Das Captain: T Pramanick. Vice-Captain: M Mandal Fantasy Suggestion #2: M Roy Choudhury, A Gupta, M Nizamuddin, A Santra, T Pramanick, M Mandal, A Sikdar, M Firoz Hossain, S Bagchi, R Kumar Pal, B Das Captain: M Firoz Hossain. Vice-captain: M Roy Choudhury","image_url":"https://static.sportskeeda.com/editor/2021/12/c6c35-16385103398306-1920.jpg","source_id":"sportskeeda"},{"title":"\"It's definitely realistic\" - Glenn Maxwell aspires to represent Australia in Test cricket again","link":"https://www.sportskeeda.com/cricket/news-australia-s-glenn-maxwell-hopes-play-test-cricket-again-last-played-2017?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 07:18:15","full_description":"Australia's limited-overs specialist Glenn Maxwell hasn't given up on playing Test cricket and wants to reclaim his spot in the side. Maxwell revealed that he has been in conversation with selectors over his return to the format. Maxwell hasn't featured in the format since 2017 when Australia toured Bangladesh for a couple of Tests. Since then, selectors have resorted to deploying the 33-year old as a white-ball cricketer. However, Maxwell asserted that he has the ability to adapt for Test cricket. Glenn Maxwell claimed that representing Australia again in Tests is still realistic and is confident about re-establishing himself in the side. Maintaining that his game has undergone continuous improvement, the 33-year old said: The veteran cricketer has 339 runs in seven Tests so far, with a single hundred to his name. Maxwell's numbers in first-class cricket are also hugely encouraging— an average of 39.81 in 67 games with 4061 runs in total, including a best of 278. The 33-year old underlined that he plans to keep himself ready for Australia's sub-continental sojourn in 2022 and grab any available opportunities: The Aussies have visits scheduled to Sri Lanka, Pakistan and India— all of which will include Test matches. They will be keen to improve the underwhelming record they have accumulated in the sub-continent over the years.","image_url":"https://static.sportskeeda.com/editor/2021/12/34edb-16385106601393-1920.jpg","source_id":"sportskeeda"},{"title":"Cricket: India win toss and bat against New Zealand in Mumbai","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-india-win-toss-and-bat-against-new-zealand-in-mumbai","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - India captain Virat Kohli won the toss and opted to bat against New Zealand in the second and final test at the Wankhede Stadium on Friday. Read full story","content":null,"pubDate":"2021-12-03 06:36:00","full_description":"MUMBAI (Reuters) - India captain Virat Kohli won the toss and opted to bat against New Zealand in the second and final test at the Wankhede Stadium on Friday. The first session was wiped out due to a wet outfield after Mumbai received unseasonal rain during the last two days. Both sides were dealt injury blows before the start with the tourists losing captain Kane Williamson to an elbow problem while the hosts lost Ajinkya Rahane, who led the side in Kanpur in Kohli's absence, Ravindra Jadeja and Ishant Sharma. New Zealand are being led by opening batter Tom Latham. Kohli has returned to lead India with fast bowler Mohammed Siraj and spin-bowling all-rounder Jayant Yadav the other forced changes. \"Looks like a really nice wicket, nice and hard early on and not much grass on it,\" Kohli said at the toss. \"Today with the sun out, we presume the first innings is going to be the best time to bat.\" Batter Daryl Mitchell was the only change for the touring side with Latham confirming New Zealand would also have opted to bat first if he won the toss. \"But it has been under covers for a few days so maybe we'll get something out of it,\" Latham said. \"The way we got the ball to swing in Kanpur was good, hopefully it swings here as well.\" The opening test ended in a thrilling draw, with New Zealand's last batting pair hanging on in the final session to deny the hosts a victory. Teams: India: Shubman Gill, Mayank Agarwal, Cheteshwar Pujara, Virat Kohli (captain), Shreyas Iyer, Wriddhiman Saha, Ravichandran Ashwin, Jayant Yadav, Axar Patel, Umesh Yadav, Mohammed Siraj New Zealand: Will Young, Tom Latham (captain), Daryl Mitchell, Ross Taylor, Henry Nicholls, Tom Blundell, Rachin Ravindra, Kyle Jamieson, Tim Southee, Ajaz Patel, Will Somerville (Reporting by Sudipto Ganguly; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1391269.jpg","source_id":"thestar_my"},{"title":"Cricket: India win toss and bat against New Zealand in Mumbai","link":"https://www.channelnewsasia.com/sport/cricket-india-win-toss-and-bat-against-new-zealand-mumbai-2356036","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 06:34:51","full_description":"MUMBAI : India captain Virat Kohli won the toss and opted to bat against New Zealand in the second and final test at the Wankhede Stadium on Friday. The first session was wiped out due to a wet outfield after Mumbai received unseasonal rain during the last two days. Both sides were dealt injury blows before the start with the tourists losing captain Kane Williamson to an elbow problem while the hosts lost Ajinkya Rahane, who led the side in Kanpur in Kohli's absence, Ravindra Jadeja and Ishant Sharma. New Zealand are being led by opening batter Tom Latham. Kohli has returned to lead India with fast bowler Mohammed Siraj and spin-bowling all-rounder Jayant Yadav the other forced changes. \"Looks like a really nice wicket, nice and hard early on and not much grass on it,\" Kohli said at the toss. \"Today with the sun out, we presume the first innings is going to be the best time to bat.\" Batter Daryl Mitchell was the only change for the touring side with Latham confirming New Zealand would also have opted to bat first if he won the toss. \"But it has been under covers for a few days so maybe we'll get something out of it,\" Latham said. \"The way we got the ball to swing in Kanpur was good, hopefully it swings here as well.\" The opening test ended in a thrilling draw, with New Zealand's last batting pair hanging on in the final session to deny the hosts a victory. Teams: India: Shubman Gill, Mayank Agarwal, Cheteshwar Pujara, Virat Kohli (captain), Shreyas Iyer, Wriddhiman Saha, Ravichandran Ashwin, Jayant Yadav, Axar Patel, Umesh Yadav, Mohammed Siraj New Zealand: Will Young, Tom Latham (captain), Daryl Mitchell, Ross Taylor, Henry Nicholls, Tom Blundell, Rachin Ravindra, Kyle Jamieson, Tim Southee, Ajaz Patel, Will Somerville (Reporting by Sudipto Ganguly; Editing by Peter Rutherford)","image_url":"https://onecms-res.cloudinary.com/image/upload/s--PA3znfhh--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-03t063124z_1_lynxmpehb206q_rtroptp_3_cricket-test-ind-nzl.jpg?itok=HSGt8LG0","source_id":"channelnewsasia"},{"title":"Jayant Yadav stats: Why is Kane Williamson not playing today’s 2nd Test between India and New Zealand in Mumbai?","link":"https://thesportsrush.com/cricket-news-jayant-yadav-stats-why-is-kane-williamson-not-playing-todays-2nd-test-between-india-and-new-zealand-in-mumbai/","keywords":["Cricket","Daryl Mitchell","India","Jayant Yadav","Kane Williamson","New Zealand","New Zealand tour of India 2021"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Kane Williamson not playing: New Zealand have had to make a forced change to their Playing XI in this match at the Wankhede Stadium. During the first day of the second Test of the ongoing New Zealand’s tour of India in Mumbai, India captain Virat Kohli has won the toss and chose to bat. “We’re… The post Jayant Yadav stats: Why is Kane Williamson not playing today’s 2nd Test between India and New Zealand in Mumbai? appeared first on The SportsRush.","content":"Kane Williamson not playing: New Zealand have had to make a forced change to their Playing XI in this match at the Wankhede Stadium. During the first day of the second Test of the ongoing New Zealand’s tour of India in Mumbai, India captain Virat Kohli has won the toss and chose to bat. “We’re batting first. Looks like a hard wicket and not a lot of grass. With the sun out, it should be the best time to bat. We just have to do the basics right like in Kanpur. New Zealand must be given credit for batting out the overs on Day 5. We can be in positions to capitalize at home if we play well,” Kohli told Star Sports at the toss. India, who were expected to make at least one change to accommodate Kohli in the Playing XI, have had to make three to replace the injured trio of vice-captain Ajinkya Rahane, all-rounder Ravindra Jadeja and pacer Ishant Sharma. Virat Kohli entering the dressing room after winning the toss #INDvNZ pic.twitter.com/mShJxEfxy9 — Wasim Jaffer (@WasimJaffer14) December 3, 2021 “[Ajinkya] Rahane had a hammie niggle on Day 5. [Ravindra] Jadeja has a swollen right forearm and Ishant [Sharma] has an [finger] injury too,” Kohli said. As far as the replacements are concerned, Kohli, all-rounder Jayant Yadav and fast bowler Mohammed Siraj have been included into the XI. Yadav, who had last played international cricket in 2017, is making a comeback after almost half-a-decade. In four Tests during the 2016-17 home season, Yadav had picked 11 wickets at an average of 33.36 and scored 228 runs including a century and half-century each. Why is Kane Williamson not playing vs New Zealand? Much like Kohli, New Zealand stand-in captain Tom Latham also wanted to bat first at the Wankhede Stadium. Another similarity is that the visitors have also lost a senior player in captain Kane Williamson to an injury on the morning of the match. It is worth mentioning that Latham is leading New Zealand in Williamson’s absence. “We would’ve had a bat too. It’s been under covers for a few days, and so it might do a bit early. Unfortunate for Kane [Williamson], his elbow is acting up again, but good chance for [Daryl] Mitchell. “It might swing with the humidity here, and we will get assistance and given the pitch it will spin too. We did well after losing the toss in Kanpur and hopefully we can make use of the conditions here and pick up some early wickets,” Latham told Star Sports at the toss. Mitchell, 30, has played five Tests for New Zealand scoring 232 runs at an average of 58 including a century and half-century each. Readers must note that the first session of Day 1 has been lost due to a wet outfield. A total of 78 overs are to be bowled across two sessions today. The post Jayant Yadav stats: Why is Kane Williamson not playing today’s 2nd Test between India and New Zealand in Mumbai? appeared first on The SportsRush.","pubDate":"2021-12-03 06:25:51","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Afghanistan will face pressure from ICC over women's cricket: Ramiz","link":"https://sportstar.thehindu.com/cricket/afghanistan-will-face-pressure-from-icc-over-women-cricket-ramiz-raja/article37818369.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"PCB chairman Ramiz Raja has said that the ICC will put pressure on Afghanistan to clarify its position on the ban of women's cricket after the Taliban took control of the government in Kabul.","content":null,"pubDate":"2021-12-03 06:16:45","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Afghanistan will face pressure from ICC over women’s cricket: Ramiz Raja","link":"https://indianexpress.com/article/sports/cricket/afghanistan-will-face-pressure-from-icc-over-womens-cricket-ramiz-raja-7653813/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 06:12:07","full_description":"Pakistan Cricket Board chairman Ramiz Raja has said that the ICC will put pressure on Afghanistan to clarify its position on the ban of women’s cricket after the Taliban took control of the government in Kabul. Raja is part of an International Cricket Council working group reviewing the state of the game in Afghanistan. “Pressure will be put on Afghanistan. I’m sure they will have to decide in the next six months how they deal with the ICC,” Raja told Stumped on the BBC World Service. https://images.indianexpress.com/2020/08/1x1.png It is an ICC requirement for full members to also have a national women’s team, besides the men’s side. But the return to Taliban rule has led to the prospect of women being forbidden to play cricket in Afghanistan. “Like everybody else, we are giving them time. They are in a difficult situation,” said Raja. Afghanistan is one of 12 full members of the ICC. Afghanistan’s men took part in the T20 World Cup that was played in the United Arab Emirates and Oman in October and November. A few months back, Australia called off a men’s Test against Afghanistan that was scheduled for the end of November because of the uncertainty surrounding women’s cricket in the country. “It’s a tough one for Afghanistan to answer right now. Things are still in a state of flux in Afghanistan,” said Raja, who played 57 Tests and 198 one-day internationals for Pakistan. Top Sports News Now India vs New Zealand 2nd Test, Day 1 Live Score and Updates: Toss delayed Cheteshwar Pujara & Ajinkya Rahane likely to be included for South Africa tour despite run slump Junior Hockey WC: Germany's half-court press could get tricky; but India have the surprise up their sleeve Click here for more “Wait and watch is the policy of the world and that is the policy of the ICC.” Raja said that for now Afghanistan will continue to receive its allotted funding from the ICC. “It was decided that Afghanistan cricket talent shouldn’t be hurt at all because they have some fabulous players, so all of their funding will continue,” he said. “Albeit there will be more eyes watching how they spend that money.” Raja also said that the PCB intends to start a women’s version of the Pakistan Super League.","image_url":null,"source_id":"indianexpress"},{"title":"‘Act surprised’: How Shane Warne ‘wrecked’ Lee’s debut moment","link":"https://www.foxsports.com.au/cricket/australia/act-surprised-how-shane-warne-wrecked-lees-debut-moment/news-story/a248fab5a0816e5061f0b61572ae7e7a","keywords":null,"creator":null,"video_url":null,"description":"Brett Lee has revealed Shane Warne dropped one of cricket’s worst spoiler alerts on the morning he made his Test debut.","content":null,"pubDate":"2021-12-03 06:05:00","full_description":"Brett Lee has revealed Shane Warne dropped one of cricket’s worst spoiler alerts on the morning he made his Test debut. The fiery quick’s revelation about the start of his test career is one of many dramatic comments made in the debut episode of The Brett Lee Podcast , first published on Friday afternoon. The 45-year-old, who amassed 310 test wickets and 380 ODI scalps, has given an expert view into the dynamics that will impact the make-up of the Australian team during this summer’s Ashes series — but it is his self revelations that stand out the most. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Lee famously debuted on the morning of the Boxing Day Test in 1999 and has now revealed it got off to a strange start. “And as I’m walking down to find out who is in the team, it was either me or Michael Kasprowicz,” he said of the final selection dilemma selectors faced before the first day of play. “I’m the second last to walk down and Warnie is behind me and he goes, ‘Hey Binga, just found out you’re playing, right, so congratulations, but when Tugger (captain Steve Waugh) tells you act surprised’. “So as I was walking down to the field I knew I was going to get picked. I’m smiling from ear to ear. I reckon Tugger sussed it out that Warnie was behind me and wrecked the whole thing. It was a very special moment.” Australia celebrates the iconic 5-0 Ashes whitewash in 2007. Source: News Limited Lee and Podcast co-host Brad McNamara, a former Aussie Test cricketer, speculate in the episode about Aussie debutant Alex Carey’s debut — and who will have the honour of presenting the South Australian with his baggy green cap. Lee believes it would be fitting for Carey to be presented with his cap by legendary Aussie keeper Adam Gilchrist, who will be at the Gabba when the First Test begins from December 8 as part of his commentary commitments with Fox Cricket. Lee has also backed under-pressure Aussie quick Mitchell Starc to respond to his critics this summer with a haul of wickets after Warne this week called for Starc to be overlooked for the First Test in favour of Jhye Richardson. Brett Lee and Shane Warne. Picture: Richard Dobson Source: News Corp Australia “I agree with Brett if Starc was bowling fast and swinging the ball he’s a match winner,” Warne posted on Twitter in response to Lee’s support of Starc. “But he’s bowling mid 130’s & not swinging it. He averaged 70 per wicket last summer to the top 6. Plus his recent WC form was horrible. He went for 60 runs in 4 overs. Richardson must play” Lee said: “There’s so much media around (saying) ‘Mitchell Starc’s not good enough, he sprays the ball around’,” Lee said. “When Mitchell Starc gets it right he’s one of Australia’s best bowlers. “Lock in Mitchell Starc.” Lee has also called for selectors to make the tough call and give Usman Khawaja one final chance to cement his spot in the Aussie batting order — a move that would see Travis Head overlooked. McNamara, meanwhile, has revealed there is one big question mark about Head as he steps in to replace former captain Tim Paine behind the stumps. “I was talking with Brad Haddin and the one thing he raised was maybe his (Carey’s) ability up to the stumps,” he said of Carey’s ability to keep in test match conditions. “He flagged that his keeping to the spinners was an area that Alex may have to work on, keeping to Nathan Lyon, especially late in test matches when the pitch plays up. “The hardest thing is going to be keeping to Nathan Lyon on days four and days 5 and that’s what he’s got to remember. That’s his job.”","image_url":null,"source_id":"foxsports"},{"title":"Lee reveals Warnie ‘wrecked the whole thing’","link":"https://www.news.com.au/sport/cricket/brett-lee-reveals-warnie-wrecked-the-whole-thing-of-his-test-debut/news-story/035ed05e9fda8b915515e456de611566","keywords":null,"creator":null,"video_url":null,"description":"Brett Lee has revealed Shane Warne dropped one of cricket’s worst spoiler alerts on the morning he made his Test debut.","content":null,"pubDate":"2021-12-03 05:53:00","full_description":"Brett Lee has revealed Shane Warne dropped one of cricket’s worst spoiler alerts on the morning he made his Test debut. The fiery quick’s revelation about the start of his test career is one of many dramatic comments made in the debut episode of The Brett Leee Podcast , first published on Friday afternoon. The 45-year-old, who amassed 310 test wickets and 380 ODI scalps, has given an expert view into the dynamics that will impact the make-up of the Australian team during this summer’s Ashes series — but it is his self revelations that stand out the most. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Lee famously debuted on the morning of the Boxing Day Test in 1999 and has now revealed it got off to a strange start. “And as I’m walking down to find out who is in the team, it was either me or Michael Kasprowicz,” he said of the final selection dilemma selectors faced before the first day of play. “I’m the second last to walk down and Warnie is behind me and he goes, ‘Hey Binga, just found out you’re playing, right, so congratulations, but when Tugger (captain Steve Waugh) tells you act surprised’. “So as I was walking down to the field I knew I was going to get picked. I’m smiling from ear to ear. I reckon Tugger sussed it out that Warnie was behind me and wrecked the whole thing. It was a very special moment.” Lee and Podcast co-host Brad McNamara, a former Aussie Test cricketer, speculate in the episode about Aussie debutant Alex Carey’s debut — and who will have the honour of presenting the South Australian with his baggy green cap. Lee believes it would be fitting for Carey to be presented with his cap by legendary Aussie keeper Adam Gilchrist, who will be at the Gabba when the First Test begins from December 8 as part of his commentary commitments with Fox Cricket. Lee has also backed under-pressure Aussie quick Mitchell Starc to respond to his critics this summer with a haul of wickets after Warne this week called for Starc to be overlooked for the First Test in favour of Jhye Richardson. “I agree with Brett if Starc was bowling fast and swinging the ball he’s a match winner,” Warne posted on Twitter in response to Lee’s support of Starc. “But he’s bowling mid 130’s & not swinging it. He averaged 70 per wicket last summer to the top 6. Plus his recent WC form was horrible. He went for 60 runs in 4 overs. Richardson must play” Lee said: “There’s so much media around (saying) ‘Mitchell Starc’s not good enough, he sprays the ball around’,” Lee said. “When Mitchell Starc gets it right he’s one of Australia’s best bowlers. “Lock in Mitchell Starc.” Lee has also called for selectors to make the tough call and give Usman Khawaja one final chance to cement his spot in the Aussie batting order — a move that would see Travis Head overlooked. McNamara, meanwhile, has revealed there is one big question mark about Head as he steps in to replace former captain Tim Paine behind the stumps. “I was talking with Brad Haddin and the one thing he raised was maybe his (Carey’s) ability up to the stumps,” he said of Carey’s ability to keep in test match conditions. “He flagged that his keeping to the spinners was an area that Alex may have to work on, keeping to Nathan Lyon, especially late in test matches when the pitch plays up. “The hardest thing is going to be keeping to Nathan Lyon on days four and days 5 and that’s what he’s got to remember. That’s his job.” The Ashes have not even started yet, but England’s cricketers are already copping sledges from the hostile Australian cricket fanbase. Australia’s cricket stars celebrated hard after winning the T20 World Cup last month and the trophy went on a journey of its own. Marnus Labuschagne is focused on his Ashes battle with Jimmy Anderson rather than on missing out on a leadership role in Australia’s Test team.","image_url":null,"source_id":"news"},{"title":"IND vs NZ 2021, 2nd Test, Day 1 Live Score: Rahane, Ishant and Jadeja Ruled Out; Toss at 11.30 IST - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtbmV3LXplYWxhbmQtbGl2ZS1jcmlja2V0LXNjb3JlLXVwZGF0ZXMtaW5kLXZzLW56LTIwMjEtbGl2ZS0ybmQtdGVzdC1tYXRjaC1kYXktMS1tdW1iYWktbGl2ZW5ld3MtNDUxMzEwMC5odG1s0gGhAWh0dHBzOi8vd3d3Lm5ld3MxOC5jb20vY3JpY2tldG5leHQvYW1wL25ld3MvaW5kaWEtdnMtbmV3LXplYWxhbmQtbGl2ZS1jcmlja2V0LXNjb3JlLXVwZGF0ZXMtaW5kLXZzLW56LTIwMjEtbGl2ZS0ybmQtdGVzdC1tYXRjaC1kYXktMS1tdW1iYWktbGl2ZW5ld3MtNDUxMzEwMC5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ 2021, 2nd Test, Day 1 Live Score: Rahane, Ishant and Jadeja Ruled Out; Toss at 11.30 IST  News18Match Preview - India vs New Zealand, New Zealand in India 2021/22, 2nd Test  ESPNcricinfoIndia vs New Zealand 2nd Test Live Score Updates, Day 1: Toss at 11:30 am; Williamson, Ishant, Rahane, Jadeja out with injuries  Times of IndiaTop players to miss out of the Mumbai Test  International Cricket Council'Selecting playing XI with Virat back': Jaffer shares hilarious 'Hera Pheri' clip to describe selection dilemma  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2021-12-03 05:36:55","image_url":null,"source_id":"google"},{"title":"Jadeja injury: What happened to Ravindra Jadeja? Why is R Jadeja not playing today’s 2nd Test between India and New Zealand in Mumbai?","link":"https://thesportsrush.com/cricket-news-jadeja-injury-what-happened-to-ravindra-jadeja-why-is-r-jadeja-not-playing-todays-2nd-test-between-india-and-new-zealand-in-mumbai/","keywords":["Cricket","India Cricket Team","Ajinkya Rahane","India","Ishant Sharma","New Zealand","New Zealand tour of India 2021","Ravindra Jadeja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"R Jadeja injury: The Indian all-rounder is among the three senior players who have been ruled out of the Mumbai Test. Wet outfield at the Wankhede Stadium has resulted in the loss of morning session of the first day of the second Test of the ongoing New Zealand’s tour of India. An interruption to the… The post Jadeja injury: What happened to Ravindra Jadeja? Why is R Jadeja not playing today’s 2nd Test between India and New Zealand in Mumbai? appeared first on The SportsRush.","content":"R Jadeja injury: The Indian all-rounder is among the three senior players who have been ruled out of the Mumbai Test. Wet outfield at the Wankhede Stadium has resulted in the loss of morning session of the first day of the second Test of the ongoing New Zealand’s tour of India. An interruption to the morning session was on the cards due to inclement weather in Mumbai in the recent days. While there wasn’t any rain this morning, wet outfield resulted in the umpires delaying the start time by two and a half hours. As per the latest inspection held at 10:30 AM, toss will happen at 11:30 AM followed by the start at 12:00 PM. A total of 78 overs will be bowled across two sessions on Day 1. UPDATE – Toss will take place at 11.30 AM. Match starts at 12 PM. 78 overs to be bowled.#INDvNZ @Paytm pic.twitter.com/c324ZF03ge — BCCI (@BCCI) December 3, 2021 Ravindra Jadeja injury If the weather in Mumbai wasn’t enough a concern for the Indian team and its fans, they dealt with an even bigger blow on the morning of the match in terms of three senior players getting ruled out due to injuries. Test vice-captain Ajinkya Rahane (minor hamstring strain), all-rounder Ravindra Jadeja and fast bowler Ishant Sharma (dislocated finger) will all be missing this match at the Wankhede Stadium. “All-rounder Ravindra Jadeja suffered a right forearm injury during the 1st Test match in Kanpur. After undergoing scans, he was diagnosed with a swelling on his forearm. He has been advised rest and is thus ruled out of the 2nd Test in Mumbai,” BCCI (Board of Control for Cricket in India) said in an official release. In addition to scoring a vital 17th Test half-century in the first Test at the Green Park, Jadeja had also registered economical match bowling figures of 61-20-97-5. In his only Test in Mumbai back in 2016, the 32-year old player had picked six wickets. The post Jadeja injury: What happened to Ravindra Jadeja? Why is R Jadeja not playing today’s 2nd Test between India and New Zealand in Mumbai? appeared first on The SportsRush.","pubDate":"2021-12-03 05:36:00","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“We are trying to replicate the culture from the T20 World Cup”: Glenn Maxwell and David Hussey aims title for Melbourne Stars in the BBL 2021-22","link":"https://thesportsrush.com/cricket-news-we-are-trying-to-replicate-the-culture-from-the-t20-world-cup-glenn-maxwell-and-david-hussey-aims-title-for-melbourne-stars-in-the-bbl-2021-22/","keywords":["Cricket","BBL","BBL 2021-22","Big Bash League","Glenn Maxwell"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"BBL 2021-22: Glenn Maxwell and David Hussey are aiming for the first BBL title for Melbourne Stars by replicating Australia’s T20 WC culture. 2021 has been a great year for Glenn Maxwell so far. He finished as the top run-scorer of RCB in IPL, whereas he won the T20 World Cup with Australia. Maxwell is… The post “We are trying to replicate the culture from the T20 World Cup”: Glenn Maxwell and David Hussey aims title for Melbourne Stars in the BBL 2021-22 appeared first on The SportsRush.","content":"BBL 2021-22: Glenn Maxwell and David Hussey are aiming for the first BBL title for Melbourne Stars by replicating Australia’s T20 WC culture. 2021 has been a great year for Glenn Maxwell so far. He finished as the top run-scorer of RCB in IPL, whereas he won the T20 World Cup with Australia. Maxwell is set to lead Melbourne Stars in the BBL 11, starting from 5th December 2021. Despite having some superstars in their ranks, the Stars have never won the BBL title. Head Coach David Hussey and Glenn Maxwell want to replicate Australia’s T20 World Cup culture in their team. The Stars are set to take on Sydney Sixers in the opening BBL 11 game. Before the tournament, both of them performed their media duties. BBL 2021-22: Glenn Maxwell and David Hussey aim for the Title with Melbourne Stars “We are trying to replicate the culture from the T20 World Cup. Everyone had good vibes and that’s what we are trying to bring here,” Maxwell said. “We’ve worked hard at the Stars to make it a place people want to come and play and feel comfortable.” Hussey insists that they want to keep the Stars culture intact as well. He wishes to bring the best out of everyone both as people and players in the tournament. “It’s my job to get the boys playing consistent and be authentic, playing an entertaining brand so we can win games too,” Hussey said. “They’re an eclectic bunch and they’re really enjoyable to be around.” 3⃣ SLEEPS TO GO THE COUNTDOWN IS ON!!! Who are you looking forward to seeing back in GREEN? #TeamGreen #WeWillShine pic.twitter.com/Ld7pafVaJI — Melbourne Stars (@StarsBBL) December 2, 2021 Joe Burns has completed his move from Brisbane Heat to Melbourne Stars this summer. Hussey has echoed the importance of having Burns in the middle-order. “It will be good to have an internationally experienced player around, learn how the (Brisbane) Heat played their cricket and how he will gel into our team,” Hussey said. The T20 format has been ruled by the leg-spinners, and the Stars have a world-class spinner in Adam Zampa. Maxwell hails the importance of Zampa and believes he is a game-changer. “We see (Adam Zampa) Zamp’s value as the best in the world. Tactically he always gets better, he’s also become a leader in the changerooms,” Maxwell said. “His spin plays a big part of winning BBL games.” The Stars will take on the Sixers in the opening BBL 11 game on 5th December 2021 at the Sydney Cricket Ground. The post “We are trying to replicate the culture from the T20 World Cup”: Glenn Maxwell and David Hussey aims title for Melbourne Stars in the BBL 2021-22 appeared first on The SportsRush.","pubDate":"2021-12-03 05:30:59","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"England’s cricketers already copping sledges","link":"https://www.news.com.au/sport/cricket/the-ashes/youre-playing-the-whole-country-england-cricketers-already-exposed-to-australias-customary-hostility/news-story/e058189fac2f97e8a85b975d0e76a47d","keywords":null,"creator":null,"video_url":null,"description":"Queensland’s persistent weather has already proven a nuisance for the England cricket team, but the relentless rain may not be their most vexing aggravator ahead of the highly-anticipated Ashes series.","content":null,"pubDate":"2021-12-03 05:11:00","full_description":"Queensland’s persistent weather has already proven a nuisance for the England cricket team, but the relentless rain may not be their most vexing aggravator ahead of the highly-anticipated Ashes series. The squad’s first warm-up fixture in Brisbane was a washout, and the opening two days of their final practice match before the Gabba Test were also scrapped due to perpetual rain. On past tours Down Under, England’s cricketers prepared for the sport’s marquee series with a whole month of fixtures against the Australian state sides and Australia A. But due to hotel quarantine mandates and the recent T20 World Cup, the tourists have been forced to make do with a glorified centre wicket practice at Ian Healy Oval. Sport‘s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > England finally got some red-ball cricket under their belts on Thursday – all-rounder Ben Stokes claimed two wickets, while Zak Crawley batted commendably against England veterans James Anderson and Stuart Broad. But despite the frustrating limitations of La Nina , the customary Ashes hostility that England’s cricketers have come to expect over the years remains. As recounted by cricket reporter Bharat Sundaresan, a couple of local spectators with beers in hand perched themselves near the England team bus after stumps at Ian Healy Oval on Thursday. “No f***ing runs for you this tour mate,” they yelled at every member of the England camp, including assistant coach Paul Collingwood, who played his last Test match more than a decade ago. He quipped back: “Well I certainly hope not.” A couple of blokes sat near the England team bus, sipping beer & yelling, âno farkin runs for you this tour mateâ at every member of the English camp getting into the bus, including at Paul Collingwood who goes, âwell I certainly hope notâ. Welcome to the #Ashes I guess It’s become almost a tradition for Australian cricket fans to torment England’s players at every opportunity that presents itself. Whether on the street or at the fine leg boundary, the Poms can anticipate a tsunami of abuse from the locals. England spinner Jack Leach, playing in his first Ashes tour, has already been warned about the Australian fanbase. “I’ve heard the Aussie fans are really nice,” he told reporters on Wednesday, with tongue firmly in cheek. A player who knows more about Australia’s uncivil hospitality is two-time Ashes winner Steve Harmison, infamous for opening the 2006/07 Ashes series with a wide ball that England captain Andrew Flintoff caught at second slip. The Aussie spectators ensured that delivery plagued Harmison for the rest of his career. “After bowling that first ball in Brisbane in 2006, there was a lot of comments coming my way at fine leg and third man for the next six weeks – and I got through it,” Harmison told news.com.au , speaking on behalf of IndiaBetting.co.in . “In the Ashes, you do play Australia as a whole. You’re not just playing them eleven, you’re playing the whole country, because when you walked down the street, you got it. It was Ashes talk. “Even to the point of getting off the plane, first and foremost – bang, there you go. When your bags are getting checked, things are getting searched, the baggage-handlers are telling us, ‘You’re going to get beat 5-0’. “That is the beauty of Ashes cricket, and that’s what you have to put up with.” 11am, November 23, 2006: At this very moment, 15 years ago, Steve Harmison delivered the first ball of that summer's #Ashes to second slip pic.twitter.com/3I852beT9r In fairness, England’s cricket fans aren’t exactly saints when the Aussies are in town. The taunts hurled at Steve Smith and David Warner during the 2019 Ashes following their return from the ball-tampering bans drew heavy criticism. In September 2019, footage emerged on social media of a spectator calling Warner a “f***ing cheat” at Old Trafford — the opener’s response was a playful thumbs up and high-pitched yelp of approval. Similarly, when the Barmy Army started chanting “he’s got sandpaper in his hands” at Edgbaston that year, Warner simply smiled and turned out his pockets, proving his innocence. The crowd roared with delight, applauding the Aussie’s response. It was a glorious moment. “Sometimes if you go back at them and have a little bit of a joke, you get a bit more respected for it,” Harmison explained. “It’s about being able to take them on the chin, have a laugh. “In Adelaide, somebody shouted at me the only good thing about me was my missus. And I pointed to one of the rooms over the far side and said, ‘Well, she’s over there, you go and try and live with her’. “In 2002, Nasser (Hussain) had an idea to go right up to Bay 13 and start doing some calf stretches, which wasn’t the best idea. “Obviously in 2002, the world was a lot different. We had lost the Ashes by then, and somebody shouted out at Nasser that Saddam Hussain was more popular in England than what Nasser Hussain was. “I must admit, there were a few English lads chuckling at Nasser’s expense.” Fan: 'Warner you f***ing cheat!' Warner: ð pic.twitter.com/w9tOwa4OH2 Times have changed, of course. The mental welfare of professional cricketers has taken precedence over their performance, whereas administrators from past generations would have laughed off any suggestion of emotional fatigue. Even last week, the ruthless Barmy Army pleaded for its fanbase to respect Tim Paine’s mental wellbeing after the former Australian Test captain stepped away from cricket. Last summer, the tiresome “banter vs abuse” debate resurfaced when Indian seamer Mohammed Siraj stopped play on day four of the SCG New Year’s Test to call attention to a group of spectators in the crowd. The incident came after India had already lodged a complaint to the ICC about alleged racial abuse from the Sydney crowd. Indian captain Virat Kohli called the situation “absolutely unacceptable”. “Having gone through many incidents of really pathetic things said on the boundary lines, this is the absolute peak of rowdy behaviour,” he tweeted. “It’s sad to see this happen on the field.” Indian spinner Ravichandran Ashwin later claimed he had been subjected to abuse from Australian crowds for almost a decade. “My first tour in 2011/12, I had no clue about what racial abuse is and how you can be made to feel small in front of so many people,” he told reporters at the time. “People actually laugh at you when you get abused, and other people laugh along when these things are happening. “It is definitely not acceptable in this day and age.” Ravi Ashwin speaking tonight about abuse - including racial slurs - aimed at Indian players at the SCG. #AUSvIND pic.twitter.com/89hGA8aoek Sledging is an indispensable part of Test cricket – it’s embedded in Ashes culture – but hopefully the Australian public understands where to draw the line this summer. “When guys get together at a cricket match, it’s a game of one-upmanship in the stands — who can come up with the most stinging one-liner? It’s boorish,” former Australian spinner Kerry O’Keeffe told Fox Sports News earlier this year. “Ninety-five per cent of sledging is unfunny. A huge percentage of it is personal abuse dressed up. Get over it. “We are more mature than that. We are better than that, and we’ve got to start now.” The first Ashes Test gets underway at the Gabba on Wednesday, with the first ball scheduled for 11am AEDT. Marnus Labuschagne is focused on his Ashes battle with Jimmy Anderson rather than on missing out on a leadership role in Australia’s Test team. Shane Warne has torched a veteran cricket journalist over their “ridiculous and disappointing” comment over the spin king’s opinion of Mitchell Starc. Shane Warne is certain one Aussie star shouldn’t play in the first Ashes Test, despite the protests of several Australian cricket greats.","image_url":null,"source_id":"news"},{"title":"Sri Lanka vs West Indies, 2nd Test, Day 5 Live Cricket Score","link":"https://sports.ndtv.com/cricket/sri-lanka-vs-west-indies-2021-2nd-test-match-day-5-live-score-updates-sl-vs-wi-galle-test-2635238","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka vs West Indies 2nd Test, Day 5 Live Updates: West Indies need 297 runs on Day 5 at Galle International Stadium to win the second Test and level the two-match series against Sri Lanka.","content":null,"pubDate":"2021-12-03 05:02:20","full_description":"Sri Lanka vs West Indies 2nd Test, Day 5 Live: Sri Lanka have declared their second innings of the first Test match at 345/9 and set the target of 297 runs in front of visitors West Indies at the Galle International Stadium. Dhananjaya de Silva top-scored for Sri Lanka in the second innings with his brilliant knock of 155 runs. Dhananjaya remained not out and was dominating the West Indies bowlers. He added 124 runs with Lasith Embuldeniya for the 9th wicket -- the highest for Sri Lanka in Test cricket. West Indies, who scored 253 runs in the first innings, will now have a tough job ahead of them on the final day of play. ( SL VS WI, 2nd Test, Day 5 LIVE SCORECARD )","image_url":"https://c.ndtvimg.com/2021-12/85oh6u6g_dhananjaya-de-silva_625x300_03_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Cricket: Labuschagne happy to lead without a title in Ashes","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-labuschagne-happy-to-lead-without-a-title-in-ashes","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - Marnus Labuschagne was overlooked as a leadership candidate following Tim Paine's resignation as Australia's test captain but the batsman said he is happy to focus on scoring big runs against Ashes foes England. Read full story","content":null,"pubDate":"2021-12-03 05:01:00","full_description":"MELBOURNE (Reuters) - Marnus Labuschagne was overlooked as a leadership candidate following Tim Paine's resignation as Australia's test captain but the batsman said he is happy to focus on scoring big runs against Ashes foes England. Though only 18 tests into his career, Labuschagne was floated as a future captain by former players and pundits but not offered an interview by a Cricket Australia panel, which named Pat Cummins skipper and Steve Smith vice-captain last week. If Labuschagne's pride was wounded, the 27-year-old hid it well when asked about the snub in Brisbane on Friday. \"No, I wasn’t disappointed,\" Labuschagne told reporters. \"I think there are two very good leaders and very good candidates. \"(Cummins) is going to do a fabulous job and he’s got plenty of support with Steve as his vice-captain and all the senior players of the group. \"My job right now is to concentrate on scoring runs consistently for Australia and I’m happy for that to be my role for now. \"You don’t need the title to still be a leader in the group.\" A little more than two years on from the 2019 Ashes, Labuschagne has cemented himself as Australia's number three and one of the world's best batsman with a stratospheric average of more than 60. He has come a long way since his first Ashes appearance, when he became test cricket's first concussion substitute at Lord's after Smith was taken out by a Jofra Archer bouncer. Labuschagne was struck on the grill of his helmet second ball by Archer but dusted himself off and scored an impressive 59 in Australia's second innings, helping the tourists draw the match and preserve a vital 1-0 lead in the series. While Smith dominated the drawn series with 774 runs, Labuschagne played an outstanding support act, notching four half-centuries to help Australia retain the urn in England for the first time in nearly two decades. He has since racked up five hundreds, including a 215 against New Zealand, and looms as a major problem for England to solve in the series starting at the Gabba next week. \"The target is on your back now that you’re scoring runs and that you’re a main part of that team,\" said Labuschagne. (Reporting by Ian Ransom; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1391159.jpg","source_id":"thestar_my"},{"title":"Scarborough sensation Cooper Connolly eyeing off second consecutive Under-19 World Cup berth","link":"https://thewest.com.au/sport/scarborough-sensation-cooper-connolly-eyeing-off-second-consecutive-under-19-world-cup-berth-c-4757587","keywords":null,"creator":["Ben Smith"],"video_url":null,"description":"Despite talk he might lead the team at the Under-19 World Cup, young cricket star Cooper Connolly is just focused on making the squad.","content":null,"pubDate":"2021-12-03 05:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4757587/8335b38d877f0a1c063b861a2cc885ba47a94038-16x9-x0y108w4607h2591.jpg","source_id":"thewest"},{"title":"Star spills beans on World Cup celebrations","link":"https://www.news.com.au/sport/cricket/glenn-maxwell-lifts-lid-on-australias-rowdy-t20-world-cup-celebrations/news-story/cbac6bffb71398cca4adf5ea0bf4979c","keywords":null,"creator":null,"video_url":null,"description":"Cricket star Glenn Maxwell has lifted the lid on Australia’s rowdy T20 World Cup celebrations, revealing he had the World Cup trophy in his home without the team realising.","content":null,"pubDate":"2021-12-03 04:59:00","full_description":"Cricket star Glenn Maxwell has lifted the lid on Australia’s rowdy T20 World Cup celebrations, revealing he had the World Cup trophy in his home without the team realising. Australia achieved an unlikely victory at the T20 World Cup in the UAE last month, with a sensational campaign culminating in a triumphant win over New Zealand in the final . Watch every game of the KFC Big Bash League Live & On-Demand on Kayo or catch up for FREE with minis on Kayo Freebies. Join Kayo Now > Maxwell said it was a thrilling experience to hit the winning runs in the final but he was worried teammates Adam Zampa and Marcus Stoinis had jumped the gun by running on to the field to celebrate while his shot was still travelling to the boundary rope. “I’m willing it over the boundary line and all I can see as the ball’s rolling is Zampa and Stoinis overtaking the ball as they’re running past and it was only half way out of the circle,” Maxwell told Kayo’s new Summer Rundown podcast, hosted by Gogglebox’s Adam Densten and Symon Lovett. “It was an amazing feeling. To get Mitch Marsh jumping in to you and crushing your bones was a nice one.” The Aussies celebrated in style after winning the final and Maxwell said the festivities were as fun as they looked on social media. “The celebrations were pretty awesome,” he said. “We had a great time over the next few days. We were fortunate we didn’t have to get on the charter in the morning with the Test guys and we had an extra day to chill out by the pool and wear our medals. “We had a great time. To be able to wind down with a few of the guys and the public over there was awesome.” The Aussies were seen singing the popular song Freed from Desire after the final, which Maxwell said had become a tradition after every victory and when the good times were rolling during the tournament. “We finished our golf day, had a few team drinks,” he recalled of a team-bonding experience midway through the World Cup. “On the team bus, the boys were up and about, had a few cocktails in us, having a good day. “We knew we had a long break in between games and all of a sudden it just turned in to a party bus, Freed from Desire , blokes are banging the roof. It was carnage. “Every win we had from there on in it came out, it became a theme song. “I supposed the vibe was so good in the change rooms it just carried us on. No one batted an eyelid and that’s the way we went about it.” Maxwell also revealed the celebrations were so loose that after arriving back in Australia he ended up bringing the World Cup trophy to his home in Melbourne, where it stayed for a couple of days. “I actually brought the World Cup back from the World Cup,” he said. “I’m not sure if it was a mistake or a logistical error, but I had the World Cup sitting on my dining table for about a day or two. “And I got a phone call from Finchy (Australian captain Aaron Finch). He goes, ‘You still got it?’, and I was like, ‘Yeah, I’ll drop it around’. He was like, ‘I’ve got to do a photo shoot with it, perfect good timing!’ “I was thinking about just leaving it on the mantelpiece and seeing what they would have done if they didn’t have it.” Maxwell said the positive and supportive atmosphere among the whole squad was crucial to Australia’s success at the T20 World Cup. “That energy from those guys really helps lift the change room,” he said. “And Mitch Marsh was exactly the same. We had a whole host of them throughout the squad that were just happy to have a good time and really heavily celebrate each other’s success. “And that was a big part of the reasoning I think that we had continued success throughout the last few games. “Everyone was just so happy for each other. Didn’t matter if you were not performing or not scoring runs or not taking wickets, everyone was just happy for each other and those vibes got us through.” Maxwell, Stoinis and Zampa will join forces again for the Melbourne Stars as they look to claim the franchise’s first Big Bash title this summer. The Stars play their first game against defending champions the Sydney Sixers on Sunday night at the SCG in the season opener. Every game of the Big Bash will be broadcast on Fox Cricket and Kayo, with 25-minute Kayo ‘Minis’ and five-minute Kayo ‘Bites’ also available for fans who want to catch up on the highlights of each match. The first episode of the Summer Rundown is now available to watch on Kayo or you can listen to the podcast on Spotify , while the rest of the episodes will drop every Wednesday at 3pm (AEDT) throughout the summer. Adam and Symon will also be hosting Kayo Clubhouse for some BBL games, delivering their lighthearted style of commentary alongside coverage of the BBL match itself. The first game featuring Clubhouse will be when the Melbourne Stars take on the Sydney Sixers on December 15, with viewers able to watch both the game and Adam and Symon’s commentary side-by-side using Kayo’s split screen function. The Clubhouse will be available to stream on Kayo, Kayo Freebies and YouTube. Cricket great Brett Lee has opened up on the biggest moments in his career, including the time Shane Warne let slip a life-changing rumour. The Ashes have not even started yet, but England’s cricketers are already copping sledges from the hostile Australian cricket fanbase. Marnus Labuschagne is focused on his Ashes battle with Jimmy Anderson rather than on missing out on a leadership role in Australia’s Test team.","image_url":null,"source_id":"news"},{"title":"Cricket: Labuschagne happy to lead without a title in Ashes ","link":"https://www.channelnewsasia.com/sport/cricket-labuschagne-happy-lead-without-title-ashes-2355846","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 04:54:21","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--nEuaemhE--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-03t045008z_1_lynxmpehb204f_rtroptp_3_cricket-ashes-preview.jpg?itok=FbnBH2n5","source_id":"channelnewsasia"},{"title":"Why is Ajinkya Rahane not playing today’s 2nd Test between India and New Zealand in Mumbai?","link":"https://thesportsrush.com/cricket-news-why-is-ajinkya-rahane-not-playing-todays-2nd-test-between-india-and-new-zealand-in-mumbai/","keywords":["Cricket","India Cricket Team","Ajinkya Rahane","India","Ishant Sharma","New Zealand","New Zealand tour of India 2021","Ravindra Jadeja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ajinkya Rahane not playing: The Indian Test vice-captain continues to be devoid of playing a home Test at the Wankhede Stadium. The start of the first day of the second Test of the ongoing New Zealand’s tour of India in Mumbai has been delayed by a wet outfield. As was expected to happen according to… The post Why is Ajinkya Rahane not playing today’s 2nd Test between India and New Zealand in Mumbai? appeared first on The SportsRush.","content":"Ajinkya Rahane not playing: The Indian Test vice-captain continues to be devoid of playing a home Test at the Wankhede Stadium. The start of the first day of the second Test of the ongoing New Zealand’s tour of India in Mumbai has been delayed by a wet outfield. As was expected to happen according to the weather forecast for today, early morning rain has played spoilsport at the Wankhede Stadium. Originally scheduled to commence at 09:30 AM (IST), toss getting delayed due to inclement weather conditions resulted in the umpires scheduling an inspection at the same time. The presence of several wet patches on the ground during the first inspection meant that the umpires had to further postpone the start. As a result, they will now make an inspection at 10:30 AM before confirming a start time. Next inspection in just under half an hour at 10-30am in Mumbai. #INDvNZ pic.twitter.com/xM7Sznrw9c — BLACKCAPS (@BLACKCAPS) December 3, 2021 Why is Ajinkya Rahane not playing vs New Zealand? In what has come as a major blow to the Indian team, vice-captain Ajinkya Rahane, all-rounder Ravindra Jadeja and fast bowler Ishant Sharma have all been ruled out of this match due to respective injuries. Rahane, who was battling for his spot in the Playing XI on the back of poor form, missing this match due to an injury means that he still will be without a Test match at his home ground. “Ajinkya Rahane sustained a minor left hamstring strain while fielding on the final day of the 1st Test match in Kanpur. Since he has not recovered completely, he has been ruled out of the 2nd Test in Mumbai. His progress will be closely monitored by the BCCI Medical team,” BCCI (Board of Control for Cricket in India) said in an official release. While the Indian team management’s puzzle with respect to accommodating regular captain Virat Kohli has been solved, they now have to make arrangements to replace Jadeja (right forearm injury) and Sharma (dislocated finger). If India don’t recall all-rounder Jayant Yadav into the XI, one out of Prasidh Krishna, Suryakumar Yadav or Srikar Bharat might be handed a Test debut today. The post Why is Ajinkya Rahane not playing today’s 2nd Test between India and New Zealand in Mumbai? appeared first on The SportsRush.","pubDate":"2021-12-03 04:44:32","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket: Start delayed due to wet outfield, India suffer injury blows","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-start-delayed-due-to-wet-outfield-india-suffer-injury-blows","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - The start of play was delayed on the opening day of the second test between India and New Zealand on Friday due to a wet outfield at the Wankhede Stadium. Read full story","content":null,"pubDate":"2021-12-03 04:34:00","full_description":"MUMBAI (Reuters) -India and New Zealand were both dealt big injury blows before the start of the second and final test at the Wankhede Stadium on Friday with the touring side losing captain Kane Williamson to an elbow problem. The hosts have lost Ajinkya Rahane, who led the side in Kanpur in the absence of regular captain Virat Kohli, all-rounder Ravindra Jadeja and fast bowler Ishant Sharma. \"Ajinkya Rahane sustained a minor left hamstring strain while fielding on the final day of the first test match in Kanpur,\" the Indian cricket board (BCCI) said in a statement. Ishant had dislocated his left little finger while Jadeja suffered a right forearm injury in Kanpur, the BCCI added. Kohli will return to lead the hosts. New Zealand will be led by opening batter Tom Latham after Williamson was forced to sit out due to the left-elbow injury which has troubled him for much of 2021. \"It's been a really tough time for Kane having to deal with such a persistent injury,\" New Zealand coach Gary Stead said. \"While we've been able to manage the injury through the year and the T20 World Cup, the shift to test cricket and the increased batting loading has re-aggravated his elbow.\" Stead said Williamson would need a \"sustained period of rest followed by rehabilitation, strengthening and gradual batting loading\". The start of play was delayed due to a wet outfield after Mumbai received unseasonal rain during the last two days, forcing the players to skip outdoor practice ahead of the match. While the sun was out there were still wet patches on the outfield, forcing the toss to be delayed. The BCCI said the umpires would inspect conditions at 10:30 local time (0500 GMT). The opening test ended in a thrilling draw, with New Zealand's last batting pair hanging on in the final session to deny the hosts a victory. (Reporting by Sudipto Ganguly; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1391127.jpg","source_id":"thestar_my"},{"title":"Sri Lanka vs West Indies, 2nd Test Day 5: Dhananjaya and Embuldeniya on crease, SL lead close to 300","link":"https://sportstar.thehindu.com/cricket/sri-lanka-vs-west-indies-2nd-test-day-5-live-sl-vs-wi-live-score/article37817746.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Sri Lanka vs West Indies 2nd Test, Day 5: Get the cricket score and commentary of the Sri Lanka vs West Indies second Test match being played at the Galle International Stadium.","content":null,"pubDate":"2021-12-03 04:17:50","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Scorecard: India vs New Zealand, second Test","link":"https://www.skysports.com/live-scores/cricket/india-v-new-zealand/37018/scorecard","keywords":null,"creator":null,"video_url":null,"description":"The latest score from Mumbai as India take on New Zealand in the crucial second Test of the two-match series. Watch live on Sky Sports Cricket.","content":null,"pubDate":"2021-12-03 03:55:00","full_description":null,"image_url":"https://e0.365dm.com/21/11/1920x1080/skysports-ravichandran-ashwin_5599137.jpg?20211129083224","source_id":"skysports"},{"title":"“I am ready for the red ball”: Glenn Maxwell reveals he is hopeful to play test cricket again for Australia","link":"https://thesportsrush.com/cricket-news-i-am-ready-for-the-red-ball-glenn-maxwell-reveals-he-is-hopeful-to-play-test-cricket-again-for-australia/","keywords":["Cricket","Glenn Maxwell","Maxi","Test cricket"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian all-rounder Glenn Maxwell is still hopeful of playing test cricket for Australia and believes he can play it next season. Australia’s white-ball superstar Glenn Maxwell has still not given up on his red-ball career. Maxi has played some enthralling cricket in the 2021 season. He finished as the highest run-scorer of RCB in IPL… The post “I am ready for the red ball”: Glenn Maxwell reveals he is hopeful to play test cricket again for Australia appeared first on The SportsRush.","content":"Australian all-rounder Glenn Maxwell is still hopeful of playing test cricket for Australia and believes he can play it next season. Australia’s white-ball superstar Glenn Maxwell has still not given up on his red-ball career. Maxi has played some enthralling cricket in the 2021 season. He finished as the highest run-scorer of RCB in IPL 2021, whereas he also won the T20 World Cup with Australia. Maxwell last played a test game in 2017 against Bangladesh. Australia have used up to 17 batters since Maxi’s last test game. Maxwell has been considered a white-ball specialist, but he still wants to play the longest format of the game. “It’s definitely realistic,” Maxwell said. “I think I am probably playing as well as ever have at the moment.” “I feel really good about my game. I have been able to work on different techniques for different formats, which has really helped going forward. “I have been in constant contact with selectors and they have been really clear about if opportunities do pop up then I am ready for red ball.” Glenn Maxwell is hopeful of playing test cricket next season It is interesting to note that Maxwell has played all of his 7 test games in Asia. He was dropped from the test side just before the 2017-18 home Ashes. Since his last test, Maxi has just played 16 FC games and he will now play in BBL without any Shield game. Although, Maxwell averages 41.20 in those 16 Shield games. A maiden Test century for Glenn Maxwell! It comes in just his fourth Test #IndvAus pic.twitter.com/8yso7XeqmP — ICC (@ICC) March 17, 2017 Australia will tour Pakistan, Sri Lanka, and India next season, and Maxi believes he has a chance. “Next year is obviously a heavy sub-continent tour year. There could be opportunities with guys coming in and out,” Maxi said. “There is a lot of cricket next year, you don’t want to burn guys out through the season so there could be a host of changes.” “So I have to make sure I am playing well when they pick those squads in any format.” The post “I am ready for the red ball”: Glenn Maxwell reveals he is hopeful to play test cricket again for Australia appeared first on The SportsRush.","pubDate":"2021-12-03 03:45:08","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IND vs NZ 2nd Test Day 1 Live Score Updates: Toss Delayed Due To Wet Outfield In Mumbai - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZGlhLXZzLW5ldy16ZWFsYW5kLTJuZC10ZXN0LW1hdGNoLWRheS0xLWxpdmUtc2NvcmUtdXBkYXRlcy1pbmQtdnMtbnotbXVtYmFpLXRlc3QtMjYzNTExMtIBkgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZGlhLXZzLW5ldy16ZWFsYW5kLTJuZC10ZXN0LW1hdGNoLWRheS0xLWxpdmUtc2NvcmUtdXBkYXRlcy1pbmQtdnMtbnotbXVtYmFpLXRlc3QtMjYzNTExMi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ 2nd Test Day 1 Live Score Updates: Toss Delayed Due To Wet Outfield In Mumbai  NDTVSports.comIndia vs New Zealand, 2nd Test: Weather, combination worry for Captain Virat Kohli as series on the line  Times of IndiaLive Cricket Score - India vs New Zealand, 2nd Test, Day 1, Mumbai | Cricbuzz.com - Cricbuzz  CricbuzzMatch Preview - India vs New Zealand, New Zealand in India 2021/22, 2nd Test  ESPNcricinfoWith covers on, it may offer more swing: Tim Southee  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-03 03:38:33","image_url":null,"source_id":"google"},{"title":"Warne vents fury over ‘ridiculous’ comment","link":"https://www.news.com.au/sport/cricket/shane-warne-vents-fury-over-cricket-journalists-ridiculous-comment/news-story/8a7a3256b694917cdc76e477e48b7299","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne has unleashed on a veteran cricket journalist’s “ridiculous and disappointing” comment as debate surrounding the battle between Mitchell Starc and Jhye Richardson heats up.","content":null,"pubDate":"2021-12-03 02:59:00","full_description":"Shane Warne has unleashed on a veteran cricket journalist’s “ridiculous and disappointing” comment as debate surrounding the battle between Mitchell Starc and Jhye Richardson heats up. Warne has been an outspoken advocate for Richardson to take Starc’s place in Australia’s bowling attack for the first Ashes Test, declaring the veteran seamer is “just not bowling well enough” in recent times. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > But it was not his take on the bowling debate that saw cricket journalist Malcolm Conn bear the brunt of Warne’s fury, rather it was the spin king’s comments about Michael Vaughan. Vaughan was caught up in the explosive allegations of racism embedded in English cricket by former Yorkshire cricketer Azeem Rafiq, but the Englishman has denied the allegations directed his way. He is set to commentate the Ashes in Australia, but is yet to enter the country due to recently testing positive for Covid. Warne’s empathy for Vaughan was picked up by Conn, who used the cricket great’s comments to flip the script. “It’s a shame Warne didn’t feel for Starc, who bowled his guts out for Australia last summer while his father was dying,” Conn wrote on Twitter. Warne’s frustration was visible in his response and reiterated his desire for a bowling change in the first Test at the Gabba on December 8. “No need for this silly comment on any level,” Warne tweeted. “Just ridiculous and disappointing to say the least. “Wish we could say, look out England. Starc has found his mojo, bowling fast/swinging it. But sadly he’s not. “Evidence plus stats back it up. “Richardson on fire, must play at the Gabba.” Things took a nasty turn from there, as the 52-year-old turned up the heat. “Ps ‘Excuse me’,” Warne wrote. “How inappropriate and irresponsible is this from Malcolm. “I hope he gets a proper please explain from his boss as this is venting 30 years of dislike towards me for whatever reason! “Just a ridiculous statement and not on!!” While the duo’s supposed disdain plays out, Warne also had former cricketers disagreeing with his take on the bowling debate. Starc enjoyed less-than-ideal outings for Australia at the T20 World Cup, most notably in the final where he conceded a whopping 60 runs off his four overs. His underwhelming form also stretches back as far as last summer’s Test series against India, in which he snared just 11 wickets in four matches and conceded an average of 40.72 runs. It is that type of form that Warne, despite his wish for Starc to come good, believes is simply not good enough for the Aussies ahead of the Ashes. But former Australian fast bowlers Brett Lee and Ryan Harris leapt to the defence of Starc amid Warne’s criticism. “A lot of people are calling for (Starc’s) head on the chopping block,” Lee told SEN on Thursday. “I’m not going down that road. “I’m going to say Mitchell Starc can produce an incredible Ashes series if he can get the ball to swing back at 150km/h, which he’s very, very capable of.” Harris was puzzled as to why Warne was taking pot shots at Starc in the public arena. “I don’t know what ‘Starcy’ (Starc) has done to ‘Warnie’ (Warne), I’m backing him in,” Harris told SEN. “I thought he bowled okay at the World Cup, he did what he needed to do, he did his job. “But the thing for me is if Mitchell Starc is swinging the ball, albeit a white one, it’s a good sign, and he did that in just about every game in Dubai and Abu Dhabi. “I’m keeping him in … he adds a bit of variation as well.” Aussie white-ball superstar Glenn Maxwell believes he’s in career-best form and says a return to the Test side is ‘definitely realistic’. Shane Warne is certain one Aussie star shouldn’t play in the first Ashes Test, despite the protests of several Australian cricket greats. We thought our teams were settled. But a host of replacement players have been aded to BBL franchises — and some of them have major value.","image_url":null,"source_id":"news"},{"title":"“He’s got a really good understanding of his craft”: Brad Haddin backs Alex Carey’s selection in the Ashes 2021-22 squad","link":"https://thesportsrush.com/cricket-news-hes-got-a-really-good-understanding-of-his-craft-brad-haddin-has-backed-alex-careys-selection-in-the-ashes-2021-22-squad/","keywords":["Cricket","Alex Carey","Brad Haddin","The Ashes 2021"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"The Ashes 2021-22: Former Aussie keeper Brad Haddin has backed the selection of Alex Carey in Australia’s squad. Cricket Australia have confirmed that Alex Carey will make his test debut in the first Ashes 2021 test at the Gabba. Carey is set to be the new long-term successor of Tim Paine. Carey leapfrogged Josh Inglis… The post “He’s got a really good understanding of his craft”: Brad Haddin backs Alex Carey’s selection in the Ashes 2021-22 squad appeared first on The SportsRush.","content":"The Ashes 2021-22: Former Aussie keeper Brad Haddin has backed the selection of Alex Carey in Australia’s squad. Cricket Australia have confirmed that Alex Carey will make his test debut in the first Ashes 2021 test at the Gabba. Carey is set to be the new long-term successor of Tim Paine. Carey leapfrogged Josh Inglis to be the next Aussie keeper. However, the recent form of Carey has been not been great with the red-ball. He has managed to score just a single half-century in the last eight Sheffield Shield innings. Josh Inglis, on the other hand, dominated the Shield last season, whereas he had impressive outings in England as well with the white-ball. Although, Alex Carey scored a timely century for South Australia in the Marsh One Day Cup game recently. Inglis has moved to Perth, and he will now spend his time with the family. Brad Haddin backs Alex Carey’s selection in the Ashes 2021-22 Former Aussie keeper Brad Haddin has backed the selection of Alex Carey in the team. He has worked closely with Carey and also revealed the changes Carey has made to his technique. “He’s simplified his technique,” Haddin said. “He has a really simple technique and if something does go wrong, he can bring it back to those basics and it won’t ruin his whole day. That’s the one thing I’ve seen over time. He’s got a really good understanding of his craft and what works for him.” Although, in terms of red-ball batting, Carey has struggled. Haddin also praised the likes of Josh Inglis, Matthew Wade, and Jimmy Pirerson. “Josh Inglis over the past 6-12 months has been outstanding with the bat and the gloves,” Haddin said. “Jimmy Pierson has been an interesting one. Since Wade Seccombe has taken over at Queensland, his game has gone to a new level. ” Alex Carey is feeling the love after being named in Australia’s Test squad #Ashes | @AlintaEnergy pic.twitter.com/fYindb4N5J — cricket.com.au (@cricketcomau) December 2, 2021 Haddin has praised the batting of Tim Paine. Despite not scoring a ton, Haddin believes that Paine has played some outstanding innings, and he will sorely will be missed by the Australian team. “Tim Paine will be sorely missed. He was scoring some runs under pressure,” Haddin said. “That’s one trait Alex Carey has also. He’s an aggressive player by nature. He can change the momentum.” The first Ashes 2021-22 test will be played at the Gabba in Brisbane from 8th December 2021. The post “He’s got a really good understanding of his craft”: Brad Haddin backs Alex Carey’s selection in the Ashes 2021-22 squad appeared first on The SportsRush.","pubDate":"2021-12-03 02:45:09","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"COVID-19 Omicron threat: Ahead of India tour, Cricket South Africa postpones domestic games due to THIS reason","link":"https://zeenews.india.com/cricket/covid-19-omicron-threat-ahead-of-india-tour-cricket-south-africa-postpones-domestic-games-due-to-this-reason-2415674.html","keywords":null,"creator":null,"video_url":null,"description":"CSA is monitoring the situation closely and a decision regarding the remainder of the fixtures this year will be made in due course as it develops.","content":null,"pubDate":"2021-12-03 02:33:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"India vs New Zealand LIVE SCORE, 2nd Test Day 1: Toss at 9:00 AM IST; Predicted XI, Dream11 Fantasy Picks","link":"https://sportstar.thehindu.com/cricket/ind-vs-nz-india-v-new-zealand-2nd-test-day-1-live-score/article37814442.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"India vs New Zealand Live: Get the live cricket score updates between NZ vs IND 2nd test Day 1 and live streaming updates from Wankhede Stadium Mumbai.","content":null,"pubDate":"2021-12-03 02:15:15","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Cricket-Jury out on captaincy but Root&#039;s runs key to England&#039;s Ashes chances","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-jury-out-on-captaincy-but-root039s-runs-key-to-england039s-ashes-chances","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Joe Root has always been a key component in England's test lineup but, such is the current fragility of their top order, it is probably no exaggeration to suggest that their Ashes hopes will stand or fall on their captain's batting form. Read full story","content":null,"pubDate":"2021-12-03 02:11:00","full_description":"LONDON (Reuters) - Joe Root has always been a key component in England's test lineup but, such is the current fragility of their top order, it is probably no exaggeration to suggest that their Ashes hopes will stand or fall on their captain's batting form. Since the departure of the ever-dependable Alastair Cook, England have tried umpteen top-three combinations without ever finding anything of substance, a situation that has piled even more pressure and responsibility on Root. After a dip from 2018-20, he has risen to that challenge this year, chalking up 1,455 runs at an average of 66.1 to reclaim his position at the top of the world rankings. England have scored seven centuries in 2021 - Root making six of them. Even more impressive is that as well as operating amid the fallout of an inconsistent top three, he has also been largely without the middle-order bulwark of Ben Stokes behind him. Already carrying the extra strain of captaincy, it must be draining for Root knowing he probably needs to be padded up and ready almost from the off in every innings, rather than joining the fray with the contest well under way and the shine taken off the new ball and the opposition's main strike bowlers. Despite those repeated top three fails, he has resisted calls to move up the order. Root averages 53.4 batting at four and a remarkable 67.8 at five but that dips to 38.7 at three and 41.7 from his 11 innings as an opener. In his personal case, it's very much a case of \"if it ain't broke, don't fix it.\" Root's tally of 9,278 runs from 200 test innings leaves him second behind Cook (12,472) in England's all-time list while he is level with Kevin Pietersen in second place on the centuries list with 23 - 10 behind Cook. In Australia, however, Root still has something to prove. He has yet to score a century there and in his two previous away Ashes series averages 38 from nine tests. Trying to explain that relative dip, Root said recently: \"It's the one place where I feel like I have underperformed and not got the best out of myself, so it's a great driver for me to go and do it this time round. \"I think I probably wanted it too much. I was too desperate, and it had probably a negative impact on the way I played and I think one of the things that has really helped me this year is stripping a little of that back, really going and enjoying my cricket.\" While Root's batting has been spectacularly successful this year, his captaincy in the field has attracted a fair amount of criticism and, of course, it will face the ultimate examination over the next few weeks. With the bat he has played a big part in two home Ashes series wins but as a captain the \"big one\" remains a glaring hole in his otherwise glittering CV, losing badly on England's last visit then seeing Australia retain the urn via the drawn series two years ago. \"It's something you’re desperate to do in your career,\" he said this summer after becoming England's most successful captain in terms of test victories. \"I think as England captain you are always judged slightly on how you do in Ashes cricket.\" (Reporting by Mitch Phillips, Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1390995.jpg","source_id":"thestar_my"},{"title":"Cricket-England&#039;s Anderson has unfinished business against Australia","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-england039s-anderson-has-unfinished-business-against-australia","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - England's prime strike bowler James Anderson has nothing left to prove as he prepares for what will surely be his last Ashes series Down Under starting next month but he may feel there is some unfinished business to attend to against Australia. Read full story","content":null,"pubDate":"2021-12-03 01:27:00","full_description":"LONDON (Reuters) - England's prime strike bowler James Anderson has nothing left to prove as he prepares for what will surely be his last Ashes series Down Under starting next month but he may feel there is some unfinished business to attend to against Australia. The 39-year-old Lancastrian is already the most prolific fast bowler in Test history with 632 wickets to his name and there are few better sights in world cricket than Anderson tormenting batsmen with his trademark swinging deliveries. In eight previous Ashes campaigns he has bagged 104 wickets, more than against any other country apart from India, and when England were thumped 4-0 by Australia in 2017-18 Anderson was still his side's leading wicket-taker with 17. England's hopes of snatching back the Ashes in 2019, however, were dealt a crushing blow when Anderson limped out of the first Test at Edgbaston and played no further part in a series which ended 2-2 with Australia retaining the urn. Australian opener Steve Smith went on to dominate that series, scoring a total of 774 runs at an average of 110. So it is no surprise that the duel between Anderson and Smith could have a crucial bearing on the outcome. \"As a bowler you always look at the best player and for me over the last three, four or five years Steve Smith's been Australia's best player,\" Anderson told Fox Cricket's Road to the Ashes podcast. \"He's been their go-to in the last few years, so he'll be the one that we will be keen to get out early.\" CLASSIC STYLE Anderson's classic side-on style and control of a Dukes cricket ball -- his weapon of choice -- has made him deadly on seamer-friendly English grounds on which he has taken 402 wickets at an average of 24. By comparison his Test record on tour is 208 at an average of 31 while his wickets in Australia cost on average 35 runs. But the Aussies will not see Anderson as any less of a threat on hard and bouncy home wickets, as he proved in 2010-11 when his series-leading 24 wickets went a long way to sealing England's first series win Down Under since 1986-87. Anderson has come a long way since his early Test career when on his day he was sensational, but when things were not quite in sync he could be terrible. These days England captain Joe Root knows that whatever the conditions he can throw the ball to Anderson who will make something happen. Crucially, Anderson has developed the patience of a polar bear waiting for a seal to appear in a hole in the ice. \"Bowling in Australia is not necessarily more difficult, it's just different,\" Anderson said. \"You're not going to get much swing with a Kookaburra, so it's just about trying to hit good areas. You've just got to be relentless and so accurate.\" As the first test at the Gabba looms on Dec. 8, England might want to wrap Anderson in cotton wool, because without him firing on all cylinders it might be a long Tour. (Reporting by Martyn Herman; Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1390975.jpg","source_id":"thestar_my"}]}