{"newsArray":[{"title":"News24.com | Another blow for Proteas as De Bruyn ruled out of Sydney Test due to family reasons","link":"https://www.news24.com/sport/Cricket/Proteas/another-blow-for-proteas-as-de-bruyn-ruled-out-of-sydney-test-due-to-family-reasons-20221231","keywords":null,"creator":null,"video_url":null,"description":"Proteas batter Theunis de Bruyn will return to South Africa and will miss next week's third and final Test against Australia at the Sydney Cricket Ground.","content":"Proteas batter Theunis de Bruyn will return to South Africa and miss next week's third and final Test against Australia at the Sydney Cricket Ground.","pubDate":"2022-12-31 06:39:01","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"How good samaritans, who don’t watch cricket and had no idea who Rishabh Pant was, rescued him from a burning car","link":"https://www.opindia.com/2022/12/good-samaritans-rescue-injured-rishabh-pant-accident/","keywords":["News Reports","Sports","accident","driver","good samaritan","Rescue","Rishabh Pant"],"creator":["OpIndia Staff"],"video_url":null,"description":"The duo was later felicitated with a memento and an appreciation certificate for saving the life of Rishabh Pant.","content":"Hours after Indian cricketer Rishabh Pant met with an accident on the Delhi-Roorkee highway, it came to light that two good samaritans helped rescue him from the burning vehicle. As per reports, the two men were identified as Sushil Mann and Paramjit Singh. While Mann is a Haryana roadways bus driver, Singh is a bus conductor by occupation. The duo was returning from Haridwar and saw a damaged vehicle on the road. Sushil Mann immediately stopped his bus and helped Rishabh Pant get out his damaged SUV. Also special mention to the bus conductor, Paramjit who along with Driver Sushil helped Rishabh. Very grateful to these selfless guys who had great presence of mind and a big heart. Gratitude to them and all who helped. pic.twitter.com/FtNnoLKowg— VVS Laxman (@VVSLaxman281) December 30, 2022 While speaking about the matter to The Times of India, Sushil Mann informed, “We were returning from Haridwar to Panipat with around 30 passengers in the bus. I saw the damaged vehicle and immediately stopped the bus. I noticed a man stuck in the car. We pushed him out of the SUV.” He and Paramjit Singh then wrapped the cricketer in a shawl in a bid to keep him warm. Thereafter, they dialled the police and the ambulance. Given that the two men do not watch cricket, they had no idea that the injured man in the damaged SUV was Rishabh Pant. “After rescuing him, we immediately informed the police and called the ambulance. Until the ambulance reached us, we covered him with a shawl to keep him warm. I didn’t know that he was cricketer Rishabh Pant as I don’t watch cricket. We served our duty as human beings,” Sushil Mann told TOI. The duo was later felicitated by the General Manager of Panipat Depot, Kuldeep Jhangra, with a memento and an appreciation certificate for saving the life of an injured Rishabh Pant. It was earlier reported how Pant managed to break the glass of the car and free himself of the burning car on his own, however, with these new revelations, it appears that good samaritans did help me survive the brutal car crash. Rishabh Pant’s belongings were not stolen after the accident Contrary to initial media reports about locals stealing money from Rishabh Pant, the Uttarakhand police refuted all such claims and said that all his belongings were collected by people who had rescued him and the same was given to the cricketer’s mother. Uttarakhand’s Director General of Police Ashok Kumar tweeted, “The information about people stealing cricketer Rishabh Pant Ji’s belongings after the road accident is untrue. Those who are spreading this misleading news, please do not do so. Share the video of SSP Haridwar Ajay Singh with such people.” सड़क दुर्घटना के बाद क्रिकेटर #RishabhPant जी के सामान को लोगों द्वारा चोरी किये जाने की सूचना असत्य है। जो यह भ्रामक खबरें फैला रहे हैं, कृपया ऐसा न करें।ऐसे लोगों के साथ SSP हरिद्वार अजय सिंह का वीडियो शेयर करें। pic.twitter.com/xmSBttaCUh— Ashok Kumar IPS (@AshokKumar_IPS) December 30, 2022 The DGP also shared a video of SSP Ajay Singh. While talking to Sports Tak, driver Sushil Mann and conductor Paramjit Singh said that they collected the belongings of Rishabh Pant, including a bag from the car, which was handed over to the police. They collected around Rs 7000 in cash from the accident spot and handed over the same to the police. The duo also said that only 3-4 people came down from the bus to the crash site.","pubDate":"2022-12-31 04:12:04","image_url":null,"source_id":"opindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant Latest Health Update: Are things getting serious? wicketkeeper-batsman likely to be airlifted","link":"https://www.indiatvnews.com/sports/cricket/rishabh-pant-latest-health-update-are-things-getting-serious-wicketkeeper-batsman-likely-to-be-airlifted-car-crash-news-ddca-max-hospital-delhi-2022-12-31-835469","keywords":null,"creator":null,"video_url":null,"description":"Rishabh Pant Latest Health Update: As per several reports that emerged on December 30, 2022, the 25-year-old wicketkeeper-batsman was in stable condition after his plastic surgery. Rishabh Pant also went through some brain and MRI scans and their reports came out to be normal. A few more scans were in line for December 31, 2022. According to the latest developments, as reported by ANI, it is now being said that the DDCA (Delhi & District Cricket Association) might take some extreme measures to ensure Pant's well-being.","content":null,"pubDate":"2022-12-31 03:47:26","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s Lionesses lead way in Britain’s Honours List","link":"https://www.malaymail.com/news/sports/2022/12/31/englands-lionesses-lead-way-in-britains-honours-list/47789","keywords":["England’s","Lionesses","lead","way","in","Britain’s","Honours","List"],"creator":null,"video_url":null,"description":"LONDON, Dec 31 — Players from the England women’s football team that became European champions in July were among the sp...","content":"LONDON, Dec 31 — Players from the England women’s football team that became European champions in July were among the sports figures recognised in Britain’s New Year public Honours List published Friday. Team captain Leah Williamson, who lifted the Women’s Euro trophy after a 2-1 victory over Germany at Wembley, has been made an OBE (Officer of the Order of the British Empire). Her team-mates Lucy Bronze, Beth Mead and Ellen White all received an MBE (Member of the Order of the British Empire), which is a level below an OBE on an honours ‘ladder’ designed mainly to recognise the contributions to public life across a variety of fields by British and Commonwealth nationals. The England women’s team’s Dutch head coach Sarina Wiegman received the higher-ranking CBE (Commander of the Order of the British Empire) on the overseas list. Mead was the tournament’s top scorer and was voted its best player. White had been a key figure in England’s attack for more than a decade until her retirement in August, while Barcelona defender Bronze is arguably most highest-profile England women’s footballer, having been voted the best player in the world in 2020. Britain’s Denise Lewis, the heptathlon champion at the 2000 Sydney Olympics, was awarded a damehood, the female equivalent of a knighthood. The European Championship victory was the first major tournament success for a senior England football team since the men’s side won the 1966 World Cup. There had been calls for all the England players involved to receive honours. That approach, however, led to controversy when all the players in the England 2005 men’s Ashes cricket victory received honours, with Paul Collingwood, who made a mere 17 runs in his lone appearance of the series success against Australia, awarded an MBE. Hugh Robertson, the chairman of the honours sport committee and a former UK sports minister, said: “The approach that we’ve tried to take with this is when we have these events there is a danger in sort of carpet bombing the entire squad because then you get people who’ve done five minutes on the pitch and get an award.” — AFP","pubDate":"2022-12-30 23:20:42","image_url":null,"source_id":"malaymail","country":["singapore","malaysia"],"category":["sports"],"language":"english"},{"title":"‘Horrible feeling’: Inside Warner’s MCG epic","link":"https://www.couriermail.com.au/sport/cricket/david-warner-reveals-the-physical-and-emotional-toll-of-his-200-in-melbourne/news-story/2c77e0371af8114b4ce59b0b1e8a651a","keywords":["Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"Text messages from lawyers the morning of a match regarding things he “didn’t want to think about” were clouding David Warner’s mind as he fought to prove he could still cut it at test level.","content":"In the aftermath of his unforgettable MCG double-hundred, one scored after enduring the “horrible” feeling of full body cramps, Warner revealed the full extent of not just his enduring battle in Melbourne, but of the off-field battle he has now declared is over, finally, having pushed him to breaking point during a home summer which had always been his happy place. Warner was beaming after taking out man-of-the-match honours in his 100th test, an effort which came with a special team presentation in the changerooms after the day four finish, and a not-so-special presentation from Marnus Labuschagne, a reminder of his day two run-out. The epic nature of his innings in the baking Melbourne heat silenced so many doubters, served as a reminder of his run-scoring prowess, and set up a test win for his team. But getting to that place, that joyous place after a big personal achievement had taken some effort, emotional and physical, an effort Warner laid bare. The push, started by others on his behalf, to have a lifetime leadership ban for his role in the sandpaper scandal in 2018, became a fight Warner didn’t think he’d have to have, complicated by Cricket Australia’s inability to make a decision, to farm it out to an independent panel, a panel which turned the whole thing into a circus.He was in the headlines, not for making runs, so was his wife, Candice, who also wore public criticism in an ugly encounter with some spectators in Adelaide. It was less than ideal preparation for Warner, who had struggled for runs in test matches in 2022, who hadn’t made a test hundred for nearly three years, and it made things harder than they should have been. “I think it just takes its toll mentally I think like when we play big series ... the whole build up and suspense and we’ve gone through a (T20) World Cup and then we’re going into a test series without playing any red ball cricket as well,” Warner said on Thursday. “And then I’ve got all that other stuff in the background happening. You know, I get a message the night before a Test, like these are things that you don’t want in the back of your mind, day two waking up, your lawyer texts you about something that has to be spoken about.“These are things that you don’t want in your mind when you’re going to training or you’re going to the game so, for me it was just trying to get in the right frame of mind and I just couldn’t. It was it was difficult.“And then when you’re out in the middle you’re trying to be as positive as you can. And as I said I was hitting them as well as I thought I could but I just getting no luck and you make your own luck in this game.” His MCG innings, however, was less about luck and more about the sort of determination which has been a hallmark of the boy from Matraville’s career. Not only was it stinking hot, South African quick Anrich Nortje delivered what Warner called the fastest spell of bowling he’s ever faced, a full over of deliveries exceeding 150kmh, including a 154kmh rocket which smashed in to his thumb, hard for eyes impacted by waterfalls of sweat to handle.Warner went down more than once with cramp, and declared he had “absolutely nothing” when he reached 200, his trademark leap in to the air bringing about even more damage, which lingered even after he stopped batting. “I only did the (celebration) on my knees because I knew I couldn’t jump and then I said stuff that I’m going to try and jump and lo and behold my calf went on me that was the last thing to go on me and that was it,” Warner said. He walked from the field not long after, unable to bat on. “I had absolutely nothing. It started in my adductor early on, I had some pickle juice and then my forearm went first and I took my arm guard off that I normally wear and it just started going through the whole entire body.“I think I swept one and my hamstring went and then from there like it was yeah, it was horrible. It was a horrible feeling. I’ve never experienced those kind of cramps before and if you could have a camera in the change room for the next hour after I was off it was comical.”Warner broke out in a laugh as the image of him, covered in icepacks, cramping uncontrollably, came to mind, able then to smile about his own suffering. It’s that sort of mood, smiling, that Warner wants to live in now too as he enters the twilight of his test career.He’s shelved any notion of “picking fights” with Cricket Australia any more, preferring to move past the battles, to focus on conquering mountains in India and England, with the bat, knowing he still does have what it takes to batter the world’s best bowling. “I‘m not looking to pick fights with CA, that’s for sure. You know, I’m just glad that whatever has happened has been dealt with,” he said.“I don‘t have to worry about that. Not even thinking about it.“I still haven’t sat down with (CA boss Nick Hockley) to talk about it after what happened. That can happen in due course. “I’m in a happy place.“The game owes you nothing. And you know, as I said, fortunate enough this game actually paid off, which I’‘m really happy about.”","pubDate":"2022-12-30 22:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"New Zealand draw with Pakistan","link":"https://www.couriermail.com.au/sport/cricket/new-zealand-draw-with-pakistan/video/9f4122021d5b1eb18d1e4a735637779b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: New Zealand have not been able to land a victory in their Test series with Pakistan despite taking a commanding lead.","content":"Cricket: New Zealand have not been able to land a victory in their Test series with Pakistan despite taking a commanding lead.","pubDate":"2022-12-30 21:36:20","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Ish Sodhi’s star rises as Black Caps end mediocre year of tests","link":"https://www.nzherald.co.nz/sport/cricket-ish-sodhis-star-rises-as-black-caps-end-mediocre-year-of-tests/CTQFBFU4T5AGJNBEX4BJWZE7LU/","keywords":null,"creator":null,"video_url":null,"description":"The record-breaker may be playing his last test series for the Black Caps.","content":null,"pubDate":"2022-12-30 21:31:05","image_url":"https://www.nzherald.co.nz/resizer/1p3GotyWiblNr0V0_E20T3iiEc4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/WOVVZS2U35AIRMRA3B72VR6GA4.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Rishabh injured in car crash","link":"https://www.couriermail.com.au/sport/cricket/rishabh-injured-in-car-crash/video/b4441e2b0c792ce5564aa1734b0c8bf8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Indian wicket keeper Rishabh Pant has been injured in a car crash just a few days out from their test with Australia.","content":"Cricket: Indian wicket keeper Rishabh Pant has been injured in a car crash just a few days out from their test with Australia.","pubDate":"2022-12-30 21:18:17","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"News24.com | Elgar praises talismanic Rabada despite tough MCG outing: 'He's 100 percent or nothing cricketer'","link":"https://www.news24.com/sport/Cricket/Proteas/elgar-praises-talismanic-rabada-despite-tough-mcg-outing-hes-100-percent-or-nothing-cricketer-20221230","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Dean Elgar had nothing but good words for his lead fast bowler Kagiso Rabada, who finished the year as the joint lead wicket-taker in Test cricket.","content":"Proteas captain Dean Elgar had nothing but good words for his lead fast bowler Kagiso Rabada, who finished the year as the joint lead wicket-taker in Test cricket. Rabada had an indifferent outing during South Africa's innings and 182-run loss against Australia at the Melbourne Cricket Ground, but Elgar said Rabada always pushes himself to the edge. Rabada may have taken 47 wickets this year at an average of 22.25 and strike rate of 34.1, but during the Boxing Day Test, his 28 overs cost him as he ended on 1 for 144. READ | Elgar bemoans lack of Proteas batting character: 'It's a tough one to digest' Elgar admitted that the heat of the second day, which saw David Warner record a Test double 100, took a lot out of Rabada and their pace attack. \"KG is a 100 percent or nothing cricketer with the ball in hand,\" Elgar said. \"He pushes his body to the ultimate extremes that a fast bowler can and maybe, he's had a long summer, but that's something we need to discuss. \"Knowing him and the character that he is, he wants to push himself until he breaks, and hopefully, that doesn't happen. \"He's had a tough summer and has been carrying the brunt of our bowling, so that may play into a few niggles here and there. \"He's a three-format cricketer, so when there are niggles, we can understand, but he lives for and loves Test cricket. He was tired and most of us were tired after fielding on day two.\" READ | Skipper Elgar left gutted by 'weak' Proteas in Melbourne: 'There weren't a lot of positives' The Proteas have to avoid the first whitewash in Australia since the infamous 2001/02 tour by winning the third Test at the Sydney Cricket Ground next week. However, that'll require them to win at the Moore Park-based oval for the first time since 1994, when Fanie de Villiers's 10-wicket haul inspired a legendary five-run win. Elgar said they're in a position where some of the things they try will fail, but they'll continue to persevere. \"You know where the generic message is, and you may have to tinker here or there. However, we know where we're falling short,\" Elgar said. \"Sometimes, the harder you try, the more you fail, but I'm not going to change my messaging going forward.\"","pubDate":"2022-12-30 18:37:34","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant accident: Uttarakhand Police to reward ‘Good Samaritan’ to driver who helped cricketer","link":"https://www.firstpost.com/firstcricket/sports-news/rishabh-pant-accident-uttarakhand-police-to-reward-good-samaritan-to-driver-who-helped-cricketer-11906411.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Rishabh Pant accident: Uttarakhand Police to reward ‘Good Samaritan’ to driver who helped cricketer","content":"The Haryana Roadways bus driver who helped Rishabh Pant after the accident in the wee hours on Friday will be rewarded with the Good Samaritan award under the central government’s scheme.The Uttarakhand Police announced the award on Twitter stating, “Shri Ashok Kumar, IPS, DGP Sir has announced to honor and reward the person Good Samaritan who came forward to help Indian cricketer Rishabh Pant after the road accident.”Rishabh Pant accident: Everything we know so farSushil Mann, the driver, helped Rishabh Pant after he witnessed the accident. The driver first helped him to get away from the car, subsequently wrapped him in a blanket, and also called in an ambulance.श्री @AshokKumar_IPS, DGP Sir ने सड़क दुर्घटना के उपरांत भारतीय क्रिकेटर #RishabhPant की मदद करने को आगे आये #GoodSamaritan को सम्मानित व पुरस्कृत करने की घोषणा की है। pic.twitter.com/wntDtIRJ9U— Uttarakhand Police (@uttarakhandcops) December 30, 2022 Besides the driver Mann, other locals who helped during the incident will also be rewarded.“The first hour after an accident, that is the golden hour, is very important for the victim. He shall be treated within the first hour. The Good Samaritan award is to encourage citizens to take immediate steps in such a situation,” the Uttarakhand Police statement further read.The driver saw Pant’s car being rammed into the divider on the Delhi-Haridwar Highway and rushed to help him. Reportedly, he did not recognise the cricketer as he does not watch cricket.Former Indian batter and current NCA Chief VVS Laxman also expressed gratitude to Mann for his selfless help to Pant.“A Haryana Roadways driver who took Rishabh Pant away from the burning car wrapped him with a bedsheet and called the ambulance. We are very indebted to you for your selfless service, Sushil ji,” Laxman’s Instagram post read. View this post on Instagram A post shared by VVS Laxman (@vvslaxman281) Rishabh Pant’s brain and spinal MRI scans were normal and his ankle and knees are to be scanned on Saturday according to the latest updates.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-30 17:54:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Rishabh-Pant-driver-Sushil-Mann.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI to take over Rishabh Pant’s ligament treatment","link":"https://timesofindia.indiatimes.com/sports/cricket/news/bcci-to-take-over-rishabh-pants-ligament-treatment/articleshow/96629842.cms","keywords":null,"creator":null,"video_url":null,"description":"Friday morning’s accident has left Rishabh Pant’s return to play for India in doubt. While he has survived major injuries, the Indian cricket board (BCCI) is worried about the ligament tear on his right knee. TOI has learnt that BCCI’s panel of doctors have had a meeting with doctors treating Pant in Dehradun and it has been decided that the treatment on his ligament will only be treated by BCCI’s medical team.","content":null,"pubDate":"2022-12-30 17:21:29","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Don't watch cricket, didn't recognise him’: Bus Driver who rescued Rishabh Pant","link":"https://www.firstpost.com/firstcricket/sports-news/dont-watch-cricket-didnt-recognise-him-bus-driver-who-rescued-rishabh-pant-11904911.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"‘Don't watch cricket, didn't recognise him’: Bus Driver who rescued Rishabh Pant","content":"Haryana Roadways bus driver was among the witnesses to see Rishabh Pant’s accident and help him out of the car as his Mercedes rammed into the divider on Delhi-Haridwar Highway in the wee hours of Friday.The driver, Sushil Mann, however, said that he did not know who the injured man was and acted swiftly to call an ambulance.Mann saw the car coming in at serious speed from the opposite direction. “I put my bus on the side and quickly ran towards the divider,” Mann was quoted by NDTV.Rishabh Pant accident: Everything we know so far“I thought the car would flip under the bus as it was turning over and over before it stopped,” he added.“The driver was half out of the window. He told me he’s a cricketer,” Mann said, adding the cricketer asked him to call his mother, but his phone was switched off. View this post on Instagram A post shared by VVS Laxman (@vvslaxman281) The driver further said that he didn’t know this was Rishabh Pant. “I don’t watch cricket and I didn’t know this was Rishabh Pant. But others on my bus recognised him.“After removing Rishabh, I quickly searched the car to check if anyone else was there. I took out his blue bag and ₹ 7,000-Rs 8,000 rupees from the car and gave it to him in the ambulance,” the driver was further quoted.NCA Chief VVS Laxman later shared a post on Instagram to express gratitude to the driver who selflessly helped Pant – wrapped him in a bedsheet and called an ambulance.Pant was rushed to Max Hospital in Dehradun after the accident and the Indian wicketkeeper has suffered multiple injuries as BCCI confirmed in a statement. However, he is in stable condition.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-30 17:19:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Rishabh-Pant-car-crash.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI to review India's T20 World Cup performance ahead of Sri Lanka series","link":"https://www.indiatvnews.com/sports/cricket/bcci-to-review-indias-t20-world-cup-performance-ahead-of-sri-lanka-series-india-vs-sri-lanka-ind-vs-sl-india-in-t20-world-cup-2022-2022-12-30-835400","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) will reportedly review the Indian team's performance in the T20 World Cup 2022. The review will be done ahead of the T20I series against Sri Lanka on January 1. The Indian team will take on Sri Lanka in a multi-format limited-overs series starting on January 3.","content":null,"pubDate":"2022-12-30 16:10:25","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Love never changes borders: Shaheen Afridi prays for Rishabh Pant’s recovery","link":"https://thenewsglory.com/love-never-changes-borders-shaheen-afridi-prays-for-rishabh-pants-recovery/","keywords":["Sports","game","Humanity","India","Pakistan","Rishabh Pant","Shaheen Shah Afridi"],"creator":["The News Glory"],"video_url":null,"description":"New Delhi: Indian cricket team’s wicketkeeper batsman Rishabh Pant was traveling in a car involved in an accident. Pakistan cricket team fast bowler Shaheen Shah Afridi has said that he is praying for him as he is currently undergoing treatment in the hospital. Rishabh Pant was traveling in a car on the Delhi-Deradun National Highway […]","content":"New Delhi: Indian cricket team’s wicketkeeper batsman Rishabh Pant was traveling in a car involved in an accident. Pakistan cricket team fast bowler Shaheen Shah Afridi has said that he is praying for him as he is currently undergoing treatment in the hospital. Rishabh Pant was traveling in a car on the Delhi-Deradun National Highway when he hit a barricade on the road and met with an accident. The accident took place near Roorkee around 5.30 am. As the car caught fire, passers-by immediately rescued him from the car. He was later admitted to the hospital for treatment. It is reported that he has injuries on his forehead, knees, back, wrists and ankles. Many people like fellow athletes, coaches and political figures are praying for his speedy recovery. Prime Minister Modi also shared his grief. Shaheen Afridi’s tweet is an expression of humanity even though India and Pakistan are separated by borders. “Praying Rishabh Banda,” he tweeted. Although both are players for different countries in the world of cricket, it is love that unites them in a single point.","pubDate":"2022-12-30 15:58:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant's MRI results of brain and spine normal; undergoes facial surgery","link":"https://www.firstpost.com/firstcricket/sports-news/rishabh-pants-mri-results-of-brain-and-spine-normal-undergoes-facial-surgery-11906221.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Rishabh Pant's MRI results of brain and spine normal; undergoes facial surgery","content":"Indian cricketer Rishabh Pant’s MRI results of the brain and spine have reportedly returned normal after the 25-year-old wicket-keeper suffered multiple injuries in a horrific car crash in Roorkee on Friday morningPant has also undergone plastic surgery on his facial injuries, lacerated wounds and abrasion on the back, reported ESPN Cricinfo. The Team India star, however, will undergo further MRI scan on his ankle and knee tomorrow as it was postponed earlier today due to pain and swelling at the Max Hospital in Dehradun.Watch: CCTV footage shows Rishabh Pant’s car going up in flames after accidentThe doctors have also administered him “above knee splintage … for suspected right knee ligament injury, and suspected right ankle ligament injury”.The latest medical bulletin by the hospital also added that the cricketer is “stable, conscious and oriented”.Giving further update on his injuries, the hospital noted that “prima facie, he had sustained multiple abrasions on right-hand forearm and leg, and lacerated wounds over forehead and near eyebrow, and multiple graze abrasions on the back”.Also read: BCCI issues statement, provides details of Rishabh Pant injuriesRishabh Pant crashed his car into the divider near Roorkee in Uttarakhand around 5:30 am on Friday. He was going to visit his family. The 25-year-old cricketer was alone in his car, which caught fire after the accident. Pant broke the windscreen to escape the burning vehicle. The car was badly mangled and charred after the impact. Pant injured his leg, forehead, and back during the mishap as police said he was lucky to survive.Pant reportedly dozed off while driving while a CCTV footage of the accident, which surfaced online later, suggested it was a high-speed crash.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-30 15:54:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Rishabh-pant-icc.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant accident: Everything we know so far as India cricketer suffers serious injuries","link":"https://www.firstpost.com/firstcricket/sports-news/rishabh-pants-accident-events-in-chronological-order-health-update-police-statements-what-do-we-know-so-far-11901691.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Rishabh Pant accident: Everything we know so far as India cricketer suffers serious injuries","content":"India’s star wicketkeeper-batter Rishabh Pant was involved in a major car accident on Friday morning when his car hit a divider and caught fire while on his way to home in Roorkee from Delhi. Pant told police he dozed off at the vehicle and has been shifted to a private hospital in Dehradun.Here are all the important information available about Rishabh Pant’s accident.1. Rishabh Pant crashed his car into the divider near Roorkee in Uttarakhand around 5:30 am on Friday. He was going to visit his family. According to TOI, a policemen rushed to the spot after the car hit the railing of the Delhi-Haridwar highway.“Hearing a loud sound of the accident, nearby villagers along with the local cops, rushed to the spot and pulled him out of the car. He was then rushed to a nearby hospital from where he was referred to a major hospital in Dehradun,” said Swapn Kishor Singh, superintendent of police, Haridwar (rural), who was among the cops who rushed to the spot.A further official police statement confirmed that the incident happened early in the morning.“The incident took place between 5:30 and 6 AM. Rishabh Pant’s car met with an accident in which he sustained some injuries. He was taken to Saksham Hospital where a team of doctors looked after him,” a statement from the police read.Watch: CCTV footage shows Rishabh Pant’s car going up in flames after accident2. The 25-year-old cricketer was alone in his car, which caught fire after the accident. Pant broke the windscreen to escape the burning vehicle. The car was badly mangled and charred after the impact. Pant injured his leg, forehead, and back during the mishap as police said he was lucky to survive.“Pant sustained injuries on his forehead, a hand and right knee. However, he is conscious and able to talk. The car he was driving was completely burnt. He is lucky to survive the severe accident,” Singh said.3. Pant reportedly dozed off while driving while a CCTV footage of the accident, which surfaced online later, suggested it was a high-speed crash.“It is likely that Pant fell asleep while driving because there was no fog on the road which could have affected the visibility. He has a cut on his left eyebrow and a ligament injury on his right knee apart from having bruises on his back,” another official told TOI.4. A Haryana roadways bus driver came to Pant’s rescue as he witnessed the accident while driving his bus on the other lane.“I thought the car would flip under the bus as it was turning over and over before it stopped,” driver Sushil Mann said. “The driver (Mr Pant) was half out of the window. He told me he’s a cricketer,” Mr Mann said, adding the cricketer asked him to call his mother, whose phone was, however, switched off.”5. The cricketer was then shifted to Max Hospital in Dehradun for further treatment. A senior official of the hospital said a medical bulletin on Pant’s health will be out soon.“Once the evaluation is over, we would be able to inform about the gravity of the injuries and the treatments required. Having said that, he is in a stable condition. A detailed medical bulletin would soon be issued after the evaluation is completed,” said Dr Ashish Yagnik, medical superintendent of Max Hospital, Dehradun.6. Pant’s mangled car was taken into police custody and has been sent for further investigation to determine the cause of the accident.“The charred car has been taken away for further investigation. It is not known whether the airbags had opened or not because nothing is left inside to verify that. A probe is on,” said an officer.7. Uttarakhand CM Pushkar Singh Dhami has said that all costs of Pant’s treatment will be borne by the state government.“Uttarakhand CM Pushkar Singh Dhami instructed officials to ensure all possible arrangements for the treatment of the injured cricketer Rishabh Pant and to provide an air ambulance if required,” as per the CMO statement.8. Max hospital later updated that Pant is out of danger and his condition is stable. A detailed medical bulletin is expected soon.“Cricketer Rishabh Pant is under the observation of Orthopedics & plastic surgeons. His condition is stable. His detailed medical bulletin will be released once he’s examined. Thereafter, we’ll take the next steps,” said Dr. Yagnik.9. BCCI later came out with an official statement that they are in constant touch with Pant’s family. The cricket body also said they were in touch with the medical team, revealing he had two cuts on his forehead and a ligament tear on his right knee. Also read: Wishes pour in for Rishabh Pant from the Indian and global cricket fraternity “The BCCI is in constant touch with Rishabh’s family while the Medical Team is in close contact with the doctors currently treating Rishabh. The Board will see to it that Rishabh receives the best possible medical care and gets all the support he needs to come out of this traumatic phase,” wrote BCCI.“Rishabh has two cuts on his forehead, a ligament tear in his right knee, and has also hurt his right wrist, ankle, and toe, and has suffered abrasion injuries on his back. Rishabh’s condition remains stable, and he has now been shifted to Max Hospital, Dehradun, where he will undergo MRI scans to ascertain the extent of his injuries and formulate his further course of treatment.”10. Rishabh Pant went through MRI scans for his brain and spine and the results were normal. The Indian wicketkeeper also underwent plastic surgery to manage facial injuries, according to ESPN Cricinfo.Further, the report also mentioned that an MRI scan of his knees and ankles was postponed until tomorrow morning because of pain and swelling.The hospital in their medical bulletin also suspected a knee ligament and ankle ligament injury.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-30 15:42:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Rishabh-Pant-accident1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Cricket Team LIVE: 2023 में भी भारत के लिए होम ऑफ स्पोर्ट रहेगा स्टार स्पोर्ट्स, लाइव दिखाएगा भारत के 80 प्रतिशत मैच","link":"https://www.abplive.com/sports/cricket/star-sports-will-broadcast-80-percent-of-indian-cricket-team-matches-in-2023-2295733","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Indian Cricket Team LIVE: भारत और श्रीलंका के बीच 03 जनवरी से शुरू हो रही टी20 सीरीज के साथ भारतीय टीम के लिए 2023 की शुरुआत हो जाएगी. अगले साल भारतीय टीम काफी व्यस्त रहने वाली है और कुछ बड़े टूर्नामेंट्स भी खेले जाने हैं. अगले साल एशिया कप और वनडे विश्व कप का आयोजन होना है. इसके अलावा भारत को न्यूजीलैंड तथा ऑस्ट्रेलिया जैसी टीमों के खिलाफ सीरीज खेलनी है. क्रिकेट के टीवी प्रसारण को लेकर काफी बदलाव हो रहे हैं, लेकिन भारतीय फैंस के लिए राहत भरी खबर है. भारत के अधिकतर मैच स्टार स्पोर्ट्स नेटवर्क पर आएंगे अगले साल जिन मैचों में भारतीय टीम शामिल रहने वाली है उसका 80 प्रतिशत स्टार स्पोर्ट्स नेटवर्क पर दिखाया जाएगा. आसान शब्दों में कहें तो भारतीय टीम के सभी घरेलू मैच स्टार स्पोर्ट्स और हॉटस्टार पर लाइव देखे जा सकेंगे. इसके अलावा वनडे विश्व कप और एशिया कप का आयोजन भी इसी चैनल पर होना है. भारतीय टीम के दक्षिण अफ्रीका दौरे का अधिकार स्टार के पास नहीं होगा और इसका आयोजन किसी अन्य चैनल पर किया जाएगा. अगले साल इन सीरीजों में व्यस्त रहेगी भारतीय टीम श्रीलंका के खिलाफ छह लिमिटेड ओवर्स मैचों की सीरीज के बाद भारतीय टीम छह लिमिटेड ओवर्स मैचों की सीरीज के लिए न्यूजीलैंड को होस्ट करेगी. इसके बाद फरवरी में चार मैचों की टेस्ट सीरीज और फिर तीन मैचों की वनडे सीरीज के लिए ऑस्ट्रेलिया को भी भारतीय टीम होस्ट करेगी. सितंबर में ऑस्ट्रेलिया की टीम फिर से वनडे सीरीज के लिए भारत दौरे पर आएगी. इसके बाद एशिया कप और फिर वनडे विश्व कप का आयोजन होना है. वनडे विश्व कप भारत में ही खेला जाएगा तो वहीं एशिया कप की होस्टिंग पाकिस्तान क्रिकेट बोर्ड के पास है. साल के अंत में पांच टी20 मैचों की सीरीज के लिए ऑस्ट्रेलिया की टीम भारत दौरे पर आएगी. यह भी पढ़ें: PAK vs NZ: न्यूजीलैंड के खिलाफ पहला टेस्ट ड्रॉ रहने के बाद क्या बोले पाकिस्तानी कप्तान बाबर आजम?","content":null,"pubDate":"2022-12-30 15:01:26","image_url":"https://static.abplive.com/wp-content/uploads/2020/12/07032442/FotoJet-47.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Pakistan Cricket In 2022: पाकिस्तान क्रिकेट के लिए घर में ही शर्मनाक रहा ये साल, 7 में से एक टेस्ट में भी नहीं मिली जीत","link":"https://www.abplive.com/sports/cricket/pakistan-cricket-team-did-not-win-a-single-test-match-in-the-year-2022-on-home-ground-here-read-complete-story-2295703","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Pakistan Cricket Team: पाकिस्तान क्रिकेट के लिए साल 2022 अच्छा नहीं रहा. दरअसल, बाबर आजम की टीम को अपने घरेलू मैदान पर इस साल एक भी जीत नसीब नहीं हुई. पाकिस्तान ने साल 2022 में अपनी घरेलू सरजमीं पर 7 टेस्ट मैच खेले. पाकिस्तान को 4 टेस्ट मैचों में हार का सामना करना पड़ा. जबकि 3 टेस्ट मैच ड्रॉ रहे. इस तरह पाकिस्तानी टीम के अपनी घरेलू सरजमीं पर इस साल टेस्ट मैचों में जीत से महरूम रहना पड़ा. बाबर आजम की टीम के लिए शर्मनाक रहा साल इसके अलावा पिछले दिनों इंग्लैंड के खिलाफ टेस्ट सीरीज में बाबर आजम की टीम को शर्मनाक हार का सामना करना पड़ा. इंग्लैंड ने 3 टेस्ट मैचों की सीरीज में मेजबान पाकिस्तान का सूपड़ा साफ कर दिया. बाबर आजम की अगुवाई वाली पाकिस्तानी टीम को सीरीज में 3-0 से हार का सामना करना पड़ा. वहीं, इससे पहले ऑस्ट्रेलिया के खिलाफ घरेलू मैदान पर पाकिस्तान क्रिकेट टीम को हार का मुंह देखना पड़ा था. इस तरह आंकड़े बताते हैं कि साल 2022 में पाकिस्तानी क्रिकेट के लिए नतीजे अच्छे नहीं रहे. खासकर, घरेलू मैदान पर टेस्ट फॉर्मेट में टीम ने फैंस को निराश किया. पाकिस्तान और न्यूजीलैंड के बीच ड्रॉ पर छूटा कराची टेस्ट फिलहाल, पाकिस्तानी टीम न्यूजीलैंड के खिलाफ 3 टेस्ट मैचों की सीरीज की सीरीज खेल रही हैं. दोनों टीमों के बीच सीरीज का पहला टेस्ट ड्रॉ रहा. वहीं, इस मैच की बात करें तो पाकिस्तान की पहली पारी 438 रनों पर सिमटी. पाकिस्तान के लिए कप्तान बाबर आजम ने सबसे ज्यादा 161 रनों की पारी खेली. पाकिस्तानी कप्तान ने 280 गेंदों पर 161 रन बनाए. बाबर आजम के अलावा आगा सलमान ने शतक बनाया. आगा सलमान ने 155 गेंदों पर 103 रनों का योगदान दिया. न्यूजीलैंड की टीम ने चौथे दिन 9 विकेट पर 612 रन बनाकर पारी घोषित कर दी. न्यूजीलैंड के लिए पूर्व कप्तान केन विलियमसन ने नाबाद दोहरा शतक बनाया. केन विलियमसन 395 गेंदों पर 200 रन बनाकर नाबाद लौटे. पाकिस्तान ने दूसरी पारी 8 विकेट पर 338 रनों पर घोषित की. जिसके बाद न्यूजीलैंड को मैच जीतने के लिए दूसरी पारी में तकरीबन 15 ओवर में 138 रन बनाने थे. अंपायर ने खराब रौशनी के कारण जिस वक्त खेल रोका, उस वक्त न्यूीजलैंड की टीम 7.3 ओवर में 1 विकेट पर 61 रन बना चुकी थी. ये भी पढ़ें- PAK vs NZ 1st: पाकिस्तान और न्यूजीलैंड के बीच ड्रॉ पर छूटा कराची टेस्ट, कीवी टीम को जीत के लिए मिला था 138 रनों का टार्गेट Watch: बिग बैश लीग में मेलबर्न स्टार्स के खिलाफ कुछ इस तरह आउट हुए एडम लिथ, अपनी ही गलती का हुए शिकार","content":null,"pubDate":"2022-12-30 14:38:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/30/97c19dc2b635cf2b408eda11ad4b667c1672409721712428_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"PAK vs NZ: A great game of cricket, says Williamson after match ends in draw","link":"https://www.indiatoday.in/sports/cricket/story/pak-vs-nz-a-great-game-of-cricket-says-new-zealands-kane-williamson-after-match-ends-in-draw-2315568-2022-12-30?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: A great game of cricket, says Williamson after match ends in draw","content":null,"pubDate":"2022-12-30 14:28:51","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs NZ 1st Test: Despite Kiwis' late strike, Karachi Test between Pakistan and New Zealand ends as draw","link":"https://www.indiatvnews.com/sports/cricket/pak-vs-nz-1st-test-despite-kiwis-late-strike-karachi-test-between-pakistan-and-new-zealand-ends-as-draw-pakistan-new-zealand-test-series-williamson-2022-12-30-835373","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ 1st Test: Despite the Kiwis' late strike on the final day of the Karachi Test, the opening contest between the two sides ended in a draw. The match witnessed tough competition between two Cricket Giants. But with the time running out, New Zealand finished the final day at 61/1 in their pursuit of 138 runs. Despite overs remaining, umpires decided to call it a day due to bad light in the final hour on Day 5.","content":null,"pubDate":"2022-12-30 13:33:00","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Daivik stars in Chirec win at Col CK Nayudu children’s cricket tournament","link":"https://telanganatoday.com/daivik-stars-in-chirec-win-at-col-ck-nayudu-childrens-cricket-tournament","keywords":["News","Sport","children's cricket tournament","cricket","Hyderabad"],"creator":["Telangana Today"],"video_url":null,"description":"Daivik scored half-century while Hashwanth picked-up three for 19 to guide Chirec School to thumping 33-run victory SCF Blues","content":"Hyderabad: Daivik (50) scored half-century while Hashwanth picked-up three for 19 to guide Chirec School to thumping 33-run victory SCF Blues at the 27th Col CK Nayudu Children Day-Night Tournament held in Hyderabad on Thursday. Brief Scores: U-12: Glendale Academy 91/6 in 10 overs (Khalfan 3/22) bt Redhills Cricket Club 83/6 in 10 overs (Ilhan 3/19); U-14: Redhills Cricket Club 86/7 in 10 overs (Yahya 43; Hamza 3/18) bt Owaisipura Juniors 83/6 in 10 overs (Yahya 3/23); U-15: Chirec School 124/9 in 10 overs (Daivik 50, Noor 4/16) bt SCF Blues 91/8 in 10 overs (Navdeep 32; Hashwanth 3/19) ; U-16: Redhills Cricket Club 79/5 in 10 overs lost to SCF Red 84/6 in 10 overs (3/11).  ","pubDate":"2022-12-30 13:07:27","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"MCC chief reveals about initiating inquiry on hosting India-Pakistan Test at MCG","link":"https://www.sentinelassam.com/sports/cricket/mcc-chief-reveals-about-initiating-inquiry-on-hosting-india-pakistan-test-at-mcg-630747","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"On seeing the unprecedented success of the India-Pakistan Super 12 match in the T20 World Cup","content":"MELBOURNE: On seeing the unprecedented success of the India-Pakistan Super 12 match in the T20 World Cup, the Melbourne Cricket Club (MCC) chief Stuart Fox revealed that he has initiated conversations about hosting a Test match between the two nations at the MCG.India and Pakistan have not played a Test match against each other since 2007 when the former won by 1-0 at home. The two countries have not played against each other in bilateral international cricket outside of the ODI, T20 World Cups, Champions Trophy and Asia Cup since 2013. Speaking to the SEN Test cricket show during day four of the Australia-South Africa Test at the MCG, Fox expressed interest in hosting a Test match between India and Pakistan after 90,293 fans packed the MCG on October 23 and got their money's worth as the match was decided in a last-ball thriller in India's favour, with Virat Kohli playing an unbeaten knock for ages. \"Absolutely (I asked). Three in a row would be lovely at the MCG, you'd fill it every time. We have asked, we've taken that up with Cricket Australia and I know the government have as well.\" \"But again, it's enormously complicated amongst - as I understand it - a really busy world schedule, so I think that's probably the greater challenge. But wouldn't it be great that it wasn't just Australia-centric and Victoria-centric, that we're catering for all the countries and filling the stadium all the time, so we have asked,\" elaborated Fox. As of now, no bilateral cricket is scheduled between India and Pakistan on the ICC's Future Tours Program from 2023 to 2027. Asked if the concept has some scope to translate into reality, Fox sounded upbeat. \"I think it's complicated, but hopefully Cricket Australia keep taking it up with the ICC and keep pushing for it. I think when you do see some of the stadiums around the world unoccupied, I think it would be much better to have a full house at that atmosphere and celebrating the game.\" Earlier, in September, the England and Wales Cricket Board (ECB) had offered to be the hosts for the India-Pakistan Test matches. But at that time, the Indian and Pakistani cricket boards didn't show any interest in the offer. Pakistan is also scheduled to play a Test match at the MCG in 2023 against Australia on Boxing Day, which comes under the next cycle of the World Test Championship (WTC). Fox hopes that fans turn out in large numbers for the Boxing Day Test match between Australia and Pakistan in 2023. \"I've never seen anything like it at the MCG, that India-Pakistan game was something else. The atmosphere, I've never felt it like that. The noise after every ball was just phenomenal and the families and children and everyone enjoying it.\" \"I think if we can be more inclusive and make sure that we cater for all cultures, we've got to tap into that Pakistan community next year. We want them here and that would be fantastic to have a full house on day one.\" IANS Also Read:  Men's ICC T20 World Cup: Immortality at Melbourne Cricket GroundAlso Watch:","pubDate":"2022-12-30 12:53:35","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/30/426188-mcg1.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Tanmay’s ton in vain as Hyderabad lose to Assam by 18 runs","link":"https://telanganatoday.com/ranji-trophy-tanmays-ton-in-vain-as-hyderabad-lose-to-assam-by-18-runs","keywords":["News","Sport","assam","Hyderabad","Rajiv Gandhi International Cricket Stadium","Ranji Trophy","Tanmay Agarwal"],"creator":["Telangana Today"],"video_url":null,"description":"Assam defeated Hyderabad by 18 runs on the fourth day of the Elite Group B Ranji Trophy match","content":"Hyderabad: Assam defeated Hyderabad by 18 runs on the fourth day of the Elite Group B Ranji Trophy match at the Rajiv Gandhi International Cricket Stadium, at Uppal on Friday. Resuming the day at 228/9 requiring 22 runs for the victory with just a wicket in hand, Hyderabad were bowled out for 231 in 61.5 overs after adding just three in the day. Skipper Tanmay Agarwal with his unbeaten ton was the highest scorer 126 not out (158 balls, 12×4, 1×6) for his side. Assam’s Riyan Parag, who snared eight wickets in the match – four wickets in each innings – dismissed Kartikeya Kak (1) for his overnight score to take his side to the victory. Earlier, riding on Riyan Parag’s impressive 28-ball 78, Assam had given a target of 250 to Hyderabad on Day 3. Hyderabad managed to score 228 on the same day but lost nine wickets. Though Tanmay carries his bat with an unbeaten century, his efforts proved insufficient with other batters failing to contribute.  ","pubDate":"2022-12-30 12:51:31","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Alyssa Healy, Sciver among nominees for Women's ODI Cricketer of the Year award","link":"https://www.sentinelassam.com/sports/cricket/alyssa-healy-sciver-among-nominees-for-womens-odi-cricketer-of-the-year-award-630741","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Australia wicketkeeper Alyssa Healy and England all-rounder Nat Sciver, the centurions of this year's ODI World Cup final","content":"NEW DELHI: Australia wicketkeeper Alyssa Healy and England all-rounder Nat Sciver, the centurions of this year's ODI World Cup final, on Thursday were announced as nominees of the ICC Women's ODI Cricketer of the Year 2022 award. Apart from the duo, tearaway South Africa pacer Shabnim Ismail and New Zealand's leg-spin all-rounder Amelia Kerr have also been nominated for the honour.Alyssa's year of 50-over cricket started in Canberra during Australia's successful Ashes campaign against England, but 2022 was all about the Women's ODI World Cup in New Zealand which commenced at the start of March. The Australia opener started with a decent 28 against England in Hamilton and then followed it up with a superb 72 against Pakistan in Mount Maunganui. A pair of low scores followed for her — 15 against New Zealand and three against the West Indies — before the 32-year-old struck an important 72 from just 65 deliveries during Australia's crucial group match against India in Auckland. But it was during the cut-throat knockout matches that Alyssa really stood out, with the right-hander scoring back-to-back centuries in the semi-final and final, where she hit a career-best 170 from just 138 balls, to help Australia clinch a seventh World Cup title. In the end, she finished the tournament with a whopping 509 runs at an imposing average of 56 and it was no surprise that she was named Player of the Series in the ODI World Cup. IANS Also Read:  India vice-captain Smriti Mandhana nominated for ICC Women's T20I Cricketer 2022Also Watch:","pubDate":"2022-12-30 12:41:48","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/30/426177-oif.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs NZ: शतक से चार रन दूर इमाम उल हक ने इस तरह गंवाया अपना विकेट, हुए निराश, देखें VIDEO","link":"https://www.abplive.com/sports/cricket/pak-vs-nz-pakistan-opener-imam-ul-haq-get-out-before-his-century-see-video-2295594","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"PAK vs NZ: पाकिस्तान और न्यूज़ीलैंड के बीच खेला जा रहा पहला टेस्ट मैच काफी रोमांच मोड़ पर आ गया है. मैच के आखिरी दिन पाकिस्तान ने अपनी दूसरी पारी घोषित कर न्यूज़ीलैंड को 138 रनों का टारगेट दिया है. न्यूज़ीलैंड को यह टारगेट बहुत की कम ओवरों में चेज करना होगा. पाकिस्तान ने अपनी दूसरी पारी में 8 विकेट के नुकसान पर 311 रन बनाए. इसमें ओपनिंग आए बल्लेबाज़ इमाम उल हक ने 96 रनों की पारी खेली. उनकी इस पारी में 10 चौके और एक छक्का शामिल रहा. चार रनों से शतक से चूकने वाले इमाम स्टंपिंग का शिकार हुए. इस तरह इमाम उल हक ने गंवाया विकेट 96 रनों पर खेल रहे इमाम उल हक को न्यूज़ीलैंड के स्पिनर ईश सोढ़ी ने अपना शिकार बनाया. इमाम के आउट होने का वीडियो पीसीबी की तरफ से ट्विटर पर सांझा किया गया. इस वीडियो में आप देख सकते हैं कि इमाम सोढ़ी की गेंद को खेलने के लिए चहलकदमी करते हुए आगे निकलते हैं, लेकिन गेंद पिच होने के बाद ऑफ स्पिन होकर बाहर निकल जाती है. गेंद विकेटकीपर टॉम ब्लंडेल के हाथों में पहुंचती है और वो स्टंप्स बिखेर इमाम उल हक को चलता करते हैं.  इस वीडियो में आप देख सकते हैं कि इमाम अपनी विकेट गंवाने के बाद काफी निराश दिखाई दिए. इसी निराशा के साथ वो धीरे-धीरे पवेलियन की ओर लौट गए. इमाम ने महज़ चार रनों से अपने शतक से चूक गए. पीसीबी की तरफ से इस वीडियो को शेयर कर कैप्शन में लिखा गया, “इमाम उल हक द्वारा एक शानदार पारी का समापन हुआ. ईश सोढ़ी ने टेस्ट में पहली बार 5 विकेट लिए.  End of a fine innings by Imam-ul-Haq 💔Ish Sodhi takes his maiden Test five-wicket haul.#PAKvNZ | #TayyariKiwiHai pic.twitter.com/9U86iNLYNX — Pakistan Cricket (@TheRealPCB) December 30, 2022   गौरतलब है कि इमाम उल हक के अलावा पाकिस्तान की तरफ से दूसरी पारी में विकेटकीपर बल्लेबाज़ सरफराज़ अहमद और सऊद शकील ने अर्धशतकीय पारी खेली. सरफराज़ अहमद ने 7 चौकों की मदद से 53 रन बनाए. वहीं सऊद शकील ने 7 चौके और एक छक्का लगाकर 55 रन बनाए.     ये भी पढ़ें... Pele Demise: कोलकाता में 'ब्लैक पर्ल' का जादू देख जब सभी रह गए हैरान, उनके प्यार में पागल लोग पहुंचे थे हवाई अड्डे","content":null,"pubDate":"2022-12-30 12:40:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/30/ae291f89d45633a3fb8bc2abf787d0981672403778222582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Rishabh Pant should focus on red-ball cricket: Gautam Gambhir","link":"https://www.sentinelassam.com/sports/cricket/rishabh-pant-should-focus-on-red-ball-cricket-gautam-gambhir-630738","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"One of the most significant developments from India’s squads for the upcoming white-ball series has been the exclusion of Rishabh Pant from ODIs and T20Is.","content":"NEW DELHI: One of the most significant developments from India's squads for the upcoming white-ball series has been the exclusion of Rishabh Pant from ODIs and T20Is. Though reports came of him being asked to report to the NCA for a strength and conditioning programme, the future of Pant in India's white-ball scheme of things is under dark clouds.In 2022, Pant scored 364 runs in 25 T20Is, averaging 21.41 at a strike-rate of 132.84. In 12 ODIs this year, he made 336 runs, averaging 37.33 and strike-rate of 96.55. But in Tests, Pant has been at his best, making 680 runs in 12 innings at an average of 61.81 and strike-rate of 90.90. Former India opener Gautam Gambhir thinks that Pant needs to focus on red-ball cricket while he waits to have a chance at making the cut for white-ball cricket. \"That's why he's not part of both squads. His white-ball numbers are not that great as compared to his Test numbers.\" \"That's why people like Ishan Kishan, Sanju Samson, KL Rahul, who's kept wickets in the ODIs, they are now ahead of Rishabh Pant. Look at Ishan Kishan, when he got that opportunity, he scored a double hundred in ODIs, so how can you ignore someone like him?\" \"Probably Rishabh will have to wait for his opportunity if he gets that chance in white-ball cricket. At the moment, he should focus on red-ball cricket. We know he's got the talent, but he has got enough opportunities in white-ball cricket, where he was asked to open the batting or be in the middle-order. The management has tried every possible way for him to succeed or given him the platform to be so in white-ball cricket, but unfortunately that didn't happen,\" said Gambhir during an interaction organised by Star Sports, the official broadcaster of the upcoming Sri Lanka tour of India. IANS Also Read:   Rishabh Pant Hospitalised After Massive Car Accident, Major Injuries ReceivedAlso Watch:","pubDate":"2022-12-30 12:32:39","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/30/426169-rishab.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Rashid Khan named as captain of Afghanistan for T20I format","link":"https://www.sentinelassam.com/sports/cricket/rashid-khan-named-as-captain-of-afghanistan-for-t20i-format-630718","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Leg-spin all-rounder Rashid Khan on Thursday has been appointed as the new captain of Afghanistan for the T20I format.","content":"NEW DELHI: Leg-spin all-rounder Rashid Khan on Thursday has been appointed as the new captain of Afghanistan for the T20I format. Rashid replaces senior off-spin all-rounder Mohammad Nabi, who stepped down from the role post the ICC Men's T20 World Cup 2022 in Australia.\"Captaincy is a huge responsibility. I have the experience of leading my country before, there is a great bunch of guys with whom I have a good understanding and feel pretty comfortable. We will try to stick together, will work hard to put things on the right track and bring pride and joy to our country and nation,\" said Rashid in an official statement by the Afghanistan Cricket Board (ACB). This will be Rashid's second stint as Afghanistan's T20I captain after he had quit as captain of the side shortly after the squad for T20 World Cup 2021 was announced, being at the helm for only two months. IANS Also Read:  Rabada, Brevis, Rashid , Curran, Livingstone signed up by MI Cape Town Also Watch:","pubDate":"2022-12-30 11:55:20","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/30/426125-rashid.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian cricket star Rishabh Pant 'dozed off' before fireball car crash, local police say - Sky News","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vbmV3cy5za3kuY29tL3N0b3J5L2luZGlhbi1jcmlja2V0LXN0YXItcmlzaGFiaC1wYW50LWRvemVkLW9mZi1iZWZvcmUtZmlyZWJhbGwtY2FyLWNyYXNoLWxvY2FsLXBvbGljZS1zYXktMTI3NzY4MDfSAX1odHRwczovL25ld3Muc2t5LmNvbS9zdG9yeS9hbXAvaW5kaWFuLWNyaWNrZXQtc3Rhci1yaXNoYWJoLXBhbnQtZG96ZWQtb2ZmLWJlZm9yZS1maXJlYmFsbC1jYXItY3Jhc2gtbG9jYWwtcG9saWNlLXNheS0xMjc3NjgwNw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket star Rishabh Pant 'dozed off' before fireball car crash, local police say  Sky NewsIndian cricket star Rishabh Pant badly injured in horrific car accident  Daily MailIndia wicketkeeper Rishabh Pant ‘lucky to survive’ after serious car accident  The GuardianRishabh Pant breaks windscreen & escapes in the nick of time, BMW completely wrecked | CCTV footage  Hindustan TimesRishabh Pant: India wicketkeeper undergoes plastic surgery after serious car crash  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2022-12-30 11:52:15","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"ICC unveil complete list of players nominated for annual awards 2022, know full list including Indian stars","link":"https://www.indiatvnews.com/sports/cricket/icc-unveil-complete-list-of-players-nominated-for-annual-awards-2022-know-full-list-including-indians-suryakumar-yadav-smriti-mandhana-ben-stokes-2022-12-30-835351","keywords":null,"creator":null,"video_url":null,"description":"The International Cricket Council on Friday released the complete list of players nominated for the ICC Awards 2022. The ICC Awards 2022 will be given in 13 different categories and numerous stars from different countries are selected to be voted. Interestingly, the fans will be yet again allowed to take a part in voting for their favourite cricketers. The voting will be commenced next week and cricket fans can submit their votes alongside a specialist ICC Voting Academy including prominent cricket media representatives to determine the 2022 winners.","content":null,"pubDate":"2022-12-30 11:48:28","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"How many sessions in Test cricket day: How many overs per session in Test cricket?","link":"https://thesportsrush.com/cricket-news-how-many-sessions-in-test-cricket-day-how-many-overs-per-session-in-test-cricket/","keywords":["Cricket","New Zealand","New Zealand tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The first Test match of New Zealand’s tour of Pakistan 2022 at the National Stadium has successfully drawn eyeballs of the cricketing fraternity primarily due to an enrapturing final session which is in action at the moment. Pakistan batter Saud Shakeel has once again displayed his impressive batting skills in this format to be amid… The post How many sessions in Test cricket day: How many overs per session in Test cricket? appeared first on The SportsRush.","content":"The first Test match of New Zealand’s tour of Pakistan 2022 at the National Stadium has successfully drawn eyeballs of the cricketing fraternity primarily due to an enrapturing final session which is in action at the moment. Pakistan batter Saud Shakeel has once again displayed his impressive batting skills in this format to be amid a potentially match-saving knock. Shakeel, 27, has scored a fifth Test half-century to keep the opposition bowlers at bay. Not allowing them to pick the last three wickets in the evening session of Day 5, Shakeel killing time is vital for his team’s cause of preventing a fifth consecutive Test defeat at home. How many sessions in Test cricket? Although a massive part of this match can be easily categorized as “boring” due to the absence of enticing action, the last session is trying its best to compensate for the lack of entertainment on the first four days. As a result, a lot of inquires are being made with respect to the number of sessions in a Test match. It is worth a mention that a Test match comprises of a total of 15 sessions, i.e., three per day. Irrespective of the number of interruptions due to any reason(s), there is no increase or decrease in the number of sessions in a Test match. How many overs per session in Test cricket? Readers must note that a maximum of 35 overs can be bowled in the ongoing session of the Karachi Test. However, there is no limit per se with respect to the number of overs in a session of Test cricket. In spite of each uninterrupted Test match session lasting for a couple of hours, number of overs per session can vary due to several reasons. In the general run of things, morning sessions generally consist of around 25-28 overs. The number keeps on increasing with the subsequent sessions. A primary reason why evening sessions are made of up overs in vicinity of 35 is because of the additional 30 minutes which are added to complete the 90-over mark. It is noteworthy that stipulated time for play period can’t exceed after these additional 30 minutes even if 90 overs aren’t bowled in a day. The post How many sessions in Test cricket day: How many overs per session in Test cricket? appeared first on The SportsRush.","pubDate":"2022-12-30 11:45:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}