{"newsArray":[{"title":"England cricket legend 'seriously ill' in hospital","link":"https://wwos.nine.com.au/cricket/england-cricket-legend-graham-thorpe-seriously-ill-in-hospital/36368fd6-3abc-41cb-a323-4f8c38f59eaf","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former England batter and coach Graham Thorpe has been hospitalised with a serious illness.","content":"Former England batter and coach Graham Thorpe has been hospitalised with a serious illness, the country’s players’ union said on Tuesday. The 52-year-old Thorpe left his role in England’s coaching staff after The Ashes in January and has since accepted the job as head coach of Afghanistan. READ MORE: Paul Gallen vs Kris Terzievski Ultimate Guide READ MORE: Gallen rival makes mockery of pre-fight storm-off READ MORE: Gus rips 'stupid' rule as Rabbitohs roster drama rages “Graham Thorpe has recently fallen seriously ill and is currently in hospital receiving treatment,” read a statement issued by the Professional Cricketers’ Association at the request of his family. “His prognosis is unclear at this stage and we ask for privacy for him and his family at this time. Our thoughts are with Graham and his family.” Thorpe played 100 tests for England, scoring 16 centuries, before retiring in 2005. He started his coaching career in Australia before joining the England and Wales Cricket Board as a batting coach. He was an assistant coach for the men’s team under Trevor Bayliss and Chris Silverwood. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-05-10 20:19:19","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/05/427999/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"England cricket great ‘seriously ill’ in hospital","link":"https://www.foxsports.com.au/cricket/cricket-news-2022-england-great-graham-thorpe-seriously-ill-in-hospital-condition-updates/news-story/e8eff876d58cee909f1e61ecfb81c8a7","keywords":null,"creator":null,"video_url":null,"description":"Former England batsman and assistant coach Graham Thorpe is “seriously ill” in hospital, the Professional Cricketers’ Association said on Tuesday.","content":null,"pubDate":"2022-05-10 20:08:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya watch price: Who is elder Hardik or Krunal?","link":"https://thesportsrush.com/cricket-news-hardik-pandya-watch-price-who-is-elder-hardik-or-krunal/","keywords":["Cricket","IPL 2022","Hardik Pandya","Krunal Pandya"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hardik Pandya watch price: The Gujarat Titans skipper has a decent collection of luxury watches which he has often flaunted on social media. Team India all-rounder and currently the skipper of the debutant IPL franchise Gujarat Titans (GT), Hardik Pandya, has managed to take his side through to the playoffs, by defeating another debutant side… The post Hardik Pandya watch price: Who is elder Hardik or Krunal? appeared first on The SportsRush.","content":"Hardik Pandya watch price: The Gujarat Titans skipper has a decent collection of luxury watches which he has often flaunted on social media. Team India all-rounder and currently the skipper of the debutant IPL franchise Gujarat Titans (GT), Hardik Pandya, has managed to take his side through to the playoffs, by defeating another debutant side in Lucknow Super Giants (LSG) by 62 runs in the ongoing 15th season of the marquee league. Marred by injury since the 2021 T20 World Cup which was held in UAE, Pandya has not only marked his return back in the capacity of an able leader, but has also come up with some notable performances with both bat and the ball in the ongoing season as well. With the bat, the 28-year-old has so far scored 344 runs across 11 innings at an average of 38.22, with the help of three fifties. With the ball, he has scalped a total of 4 wickets across 6 innings, at an economy rate of 7.58 rpo. Hardik was up against his brother Krunal Pandya, who himself has performed decently well in the ongoing season, especially with the ball in hand. The Southpaw all-rounder has picked up 9 wickets across 10 innings, at a commendable Economy rate of 6.56 runs per Over for LSG, as his side too, is just one win away from securing a place in the playoffs. ALSO READ: Hardik Pandya house, family details, and net worth Hardik Pandya watch price Apart from his flamboyant all-round abilities on the Cricket field, Hardik Pandya is also quite a hipster, with a rich collection of apparels, accessories, footwear et al, as has been observed via his social media handles. The 28-year-old had dominated the headlines last year, when the Mumbai airport customs department had the possession of one of Pandya’s luxury watches worth INR 1.5 Crore (as mentioned by Pandya) which he had purchased from Dubai, for proper valuation and documentation. As per reports, Pandya has a watch collection worth almost INR 11 Crore. He has been spotted flaunting the ultra luxury watch brand from the house of Patek Philippe, the ‘Patek Philippe Nautilus Platinum 5711’ to be specific, which is worth INR 5 Crore. From the same aforementioned brand, he also is in possession of the Patek Philippe Nautilus 5712R, which is reportedly worth INR 1.65 Crore. Moreover, in June 2020, Pandya had also uploaded a couple of photos after taking, what he called it the ‘chef duties at the Pandya household’, of the Rolex Oyster Perpetual Daytona Cosmograph which can be purchased for INR 1 Crore.   View this post on Instagram   A post shared by Hardik Himanshu Pandya (@hardikpandya93) Who is elder Hardik or Krunal? Krunal Pandya, 31, is the elder brother to Hardik Pandya, 28, with both having played for Baroda in the domestic circuit. However, it is the younger sibling Hardik, who had first made his team India debut in the year 2016 against Australia. Krunal, on the other hand, had his maiden India call up in the year 2018, against the West Indies. The post Hardik Pandya watch price: Who is elder Hardik or Krunal? appeared first on The SportsRush.","pubDate":"2022-05-10 18:54:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, IPL 2022 LSG vs GT, Full cricket score: Gujarat Titans qualify for playoffs - Firstcricket News - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLWlwbC0yMDIyLWxzZy12cy1ndC1mdWxsLWNyaWNrZXQtc2NvcmUtZ3VqYXJhdC10aXRhbnMtcXVhbGlmeS1mb3ItcGxheW9mZnMtMTA2NTA4MjEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, IPL 2022 LSG vs GT, Full cricket score: Gujarat Titans qualify for playoffs - Firstcricket News  FirstpostIPL 2022: LSG vs GT Predicted XI, Key players, Stats  SportstarIPL 2022, LSG vs GT, Highlights Cricket Scorecard: Rashid Fuels Lucknow's Collapse As Gujarat Won By 62 Runs  India.comIPL 2022 LIVE: GT vs LSG LIVE | Preview LIVE | | KL Rahul | Hardik Pandya | Rashid Khan  NEWS9 liveLSG vs GT Highlights, IPL 2022: Gujarat beat Lucknow by 62 runs, become first team to seal play-off berth  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-05-10 17:53:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"LSG vs GT Man of the Match today IPL: Who won Man of the Match in Lucknow vs Gujarat IPL 2022 match?","link":"https://thesportsrush.com/cricket-news-lsg-vs-gt-man-of-the-match-today-ipl-who-won-man-of-the-match-in-lucknow-vs-gujarat-ipl-2022-match/","keywords":["Cricket","Gujarat Titans","IPL 2022","Lucknow Super Giants","GT","Indian Premier League","LSG","Shubman Gill"],"creator":["Dixit Bhargav"],"video_url":null,"description":"LSG vs GT Man of the Match: The opening batter from Gujarat Titans won his fifth Indian Premier League match award. During the 57th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Gujarat Titans in Pune, Gujarat Titans beat Lucknow Super Giants by 62 runs. Having registered… The post LSG vs GT Man of the Match today IPL: Who won Man of the Match in Lucknow vs Gujarat IPL 2022 match? appeared first on The SportsRush.","content":"LSG vs GT Man of the Match: The opening batter from Gujarat Titans won his fifth Indian Premier League match award. During the 57th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Gujarat Titans in Pune, Gujarat Titans beat Lucknow Super Giants by 62 runs. Having registered their ninth victory of the season, table-toppers Titans have become the first team to seal a playoffs berth. Coming on the back of four consecutive victories, Super Giants were expected to seal a 145-run target in spite of the surface being a trickier one to bat on. A total batting collapse witnessed them getting bundled out for 82 in 13.5 overs. An innings which never really got going, captain KL Rahul (8) and his batters struggled out and out to miss an opportunity of qualifying before the opposition. With bowling figures of 3.5-0-24-4, Gujarat spinner Rashid Khan was the pick of their bowlers dismissed the likes of Krunal Pandya (5), Jason Holder (1), Deepak Hooda (27) and Avesh Khan (12). While debutant spinner Ravisrinivasan Sai Kishore picked a couple of wickets in as many overs, pacer Yash Dayal also contributed with two wickets. Playoffs, #AavaDe 💙 #SeasonOfFirsts #AavaDe #LSGvGT pic.twitter.com/DLgXCjgB63 — Gujarat Titans (@gujarat_titans) May 10, 2022 Gujarat captain Hardik Pandya’s (11) decision of opting to bat first after winning the toss resulted in his team scoring 144/4 in 20 overs. In what wasn’t the best of batting efforts, Gujarat thrived on the back of opening batter Shubman Gill scoring 63* (49) with the help of seven fours. While all-rounder Rahul Tewatia scored 22* (16) in a 24-ball 41-run fifth-wicket partnership, it was quite evident that GT failed to finish as well as they would’ve liked at the Maharashtra Cricket Association Stadium tonight. It was only in the hindsight that one realized the importance of Gill’s knock on a surface where all others batters failed to adjust. Hence, the 22-year old player was rightly awarded with the match award. “Always pleasing when you’re there till the end and finish the game for your team. I didn’t expect the ball to seam as much at the start. It was nipping around, and then I expected the spinners to get some turn. I think they didn’t bowl up much. Had Krunal [Pandya] pitched it up, it would have been tougher,” Gill told Star Sports during the post-match presentation ceremony.","pubDate":"2022-05-10 17:43:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Idolised Sachin Tendulkar as a kid, fan of Virat Kohli since I started playing: Shubman Gill","link":"https://www.indiatoday.in/sports/ipl-2022/story/idolised-sachin-tendulkar-as-a-kid-fan-of-virat-kohli-since-i-started-playing-shubman-gill-1947861-2022-05-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Have been a fan of Virat Kohli since I started playing cricket: Shubman Gill","content":null,"pubDate":"2022-05-10 17:25:58","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE SCORE, LSG vs GT IPL 2022 Updates: Gujarat Titans become the first team to qualify for the playoffs after bowling LSG out for 82 - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9pcGwtMjAyMi9zdG9yeS9sc2ctdnMtZ3QtbGl2ZS1zY29yZS1pcGwtdG9kYXktbWF0Y2gtdXBkYXRlcy1sdWNrbm93LXZzLWd1amFyYXQtcHVuZS0xOTQ3Nzc3LTIwMjItMDUtMTDSAYsBaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvc3BvcnRzL2lwbC0yMDIyL3N0b3J5L2xzZy12cy1ndC1saXZlLXNjb3JlLWlwbC10b2RheS1tYXRjaC11cGRhdGVzLWx1Y2tub3ctdnMtZ3VqYXJhdC1wdW5lLTE5NDc3NzctMjAyMi0wNS0xMA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE SCORE, LSG vs GT IPL 2022 Updates: Gujarat Titans become the first team to qualify for the playoffs after bowling LSG out for 82  India TodayIPL 2022: LSG vs GT Predicted XI, Key players, Stats  SportstarIPL 2022, LSG vs GT, Highlights Cricket Scorecard: Rashid Fuels Lucknow's Collapse As Gujarat Won By 62 Runs  India.comIPL 2022 LIVE: GT vs LSG LIVE | Preview LIVE | | KL Rahul | Hardik Pandya | Rashid Khan  NEWS9 liveMatch Preview - Titans vs Super Giants, Indian Premier League 2022, 57th Match  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-05-10 17:22:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs GT Live Score Updates: Lucknow three down chasing 145 - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiU2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWxzZy12cy1ndC1saXZlLXNjb3JlLTc5MDk5Mzkv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs GT Live Score Updates: Lucknow three down chasing 145  The Indian ExpressIPL 2022: LSG vs GT Predicted XI, Key players, Stats  SportstarMatch Preview - Titans vs Super Giants, Indian Premier League 2022, 57th Match  ESPNcricinfoIPL 2022 LIVE: GT vs LSG LIVE | Preview LIVE | | KL Rahul | Hardik Pandya | Rashid Khan  NEWS9 liveIPL 2022, LSG vs GT, LIVE Cricket Score: Sharma Departs, Hooda-Krunal Key For Chase  India.comView Full coverage on Google News","content":null,"pubDate":"2022-05-10 16:24:24","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"It will be hard for Mark Boucher tor trust CSA again, but the SJN still provided much value","link":"https://www.iol.co.za/sport/cricket/opinion/it-will-be-hard-for-mark-boucher-tor-trust-csa-again-but-the-sjn-still-provided-much-value-edae9c3b-9a22-480f-90ef-983c79bc0214","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"It will be hard for Proteas coach Mark Boucher to trust Cricket South Africa again after his charge for ‘gross misconduct’, which was dropped on Tuesday, writes IOL Sport’s Stuart Hess.","content":null,"pubDate":"2022-05-10 15:38:12","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/13a438d4-ff4f-54cd-af00-379a6890fd01&operation=CROP&offset=0x40&resize=3600x2024","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-gujarat-titans-live-score-over-match-57-t20-16-20-updates-2963726","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Gujarat Titans from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-10 15:26:04","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637878129536886787.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sai Kishore cricketer stats: Why is Lockie Ferguson not playing today’s IPL 2022 match between Lucknow Super Giants and Gujarat Titans?","link":"https://thesportsrush.com/cricket-news-sai-kishore-cricketer-stats-why-is-lockie-ferguson-not-playing-todays-ipl-2022-match-between-lucknow-super-giants-and-gujarat-titans/","keywords":["Cricket","Gujarat Titans","IPL 2022","Lucknow Super Giants","GT","Indian Premier League","Lockie Ferguson","LSG","matthew wade","Pradeep Sangwan","R Sai Kishore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Lockie Ferguson not playing today: Gujarat Titans have made as many as three tactical changes at the MCA Stadium tonight. During the 57th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Gujarat Titans in Pune, Gujarat Titans captain Hardik Pandya has won the toss and chose… The post Sai Kishore cricketer stats: Why is Lockie Ferguson not playing today’s IPL 2022 match between Lucknow Super Giants and Gujarat Titans? appeared first on The SportsRush.","content":"Why Lockie Ferguson not playing today: Gujarat Titans have made as many as three tactical changes at the MCA Stadium tonight. During the 57th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Gujarat Titans in Pune, Gujarat Titans captain Hardik Pandya has won the toss and chose to bat. “We will bat first. Want to put up some runs, the wicket looks alright for the entire duration of the game. The wicket has played some role, batting first here – teams have won plenty of games,” Pandya told Star Sports at the toss. Whatever the results, Gujarat Titans have kept things so easy. Good percentage calls, simple approach .. Hardik’s interviews have been so enjoyable and clear – Stick to the basics, don’t overthink, back your players and most importantly- Enjoy the game ! #GTvsLSG — Jatin Sapru (@jatinsapru) May 10, 2022 Looking to bowl first tonight, Lucknow Super Giants captain KL Rahul got he was looking for at the Maharashtra Cricket Association Stadium. Readers must note that table-toppers in LSG ans GT are yet to lose a match at this venue. “We would have wanted to bowl first. Not sure about how this wicket will play, so want to give our bowlers the best shot at using it first. We are playing a top team, a competitive unit, so we’ll have to hold our pressure, assess the conditions quickly and get our tactics and strategies right,” Rahul told Star Sports at the toss. Coming on the back of back-to-back losses, Titans have made as many as three changes to their Playing XI for this match. Batter Sai Sudharsan and fast bowlers Pradeep Sangwan and Lockie Ferguson have been left out for wicket-keeper batter Matthew Wade, spinner R Sai Kishore and pacer Yash Dayal. All that Pandya mentioned about the changes were all of them being “tactical” ones. The most surprising of them all is Ferguson being benched after picking 12 wickets at an average of 32, an economy rate of 8.93 and a strike rate of 21.5. While Wade and Dayal have played five and four IPL 2022 matches respectively previously, Sai Kishore has finally been handed an IPL debut after spending multiple seasons warming the bench at Chennai Super Kings. Sai Kishore, 25, had registered himself for IPL 2022 mega auction in the minimum price category of INR 20 lakh. Despite facing stiff competition from Rajasthan Royals, Delhi Capitals, Super Kings, Punjab Kings and Sunrisers Hyderabad at the auction table, Titans managed to emerge as the winner by buying the left-arm spinner for INR 3 crore. In 38-match T20 career, Tamil Nadu’s Sai Kishore has picked 43 wickets at an average of 17.39, an economy rate of 5.46 and a strike rate of 19.","pubDate":"2022-05-10 14:25:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya baby name and family details: Hardik Pandya Vadodara house and net worth","link":"https://thesportsrush.com/cricket-news-hardik-pandya-baby-name-and-family-details-hardik-pandya-vadodara-house-and-net-worth/","keywords":["Cricket","Hardik net worth","Hardik Pandya","IPL"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Hardik Pandya baby name and family details: The SportsRush brings you the details of Hardik Pandya’s net worth. Hardik Pandya has been India’s one of the most demanding cricketers. India has been searching for a pace-bowling all-rounder since Kapil Dev, and Hardik Pandya has been seen as the solution for a long time now. However,… The post Hardik Pandya baby name and family details: Hardik Pandya Vadodara house and net worth appeared first on The SportsRush.","content":"Hardik Pandya baby name and family details: The SportsRush brings you the details of Hardik Pandya’s net worth. Hardik Pandya has been India’s one of the most demanding cricketers. India has been searching for a pace-bowling all-rounder since Kapil Dev, and Hardik Pandya has been seen as the solution for a long time now. However, Hardik Pandya has always struggled with injuries. After the ICC T20 World Cup, Hardik Pandya was dropped from the Indian side as well. Ahead of the IPL 2022 auction,, Gujarat Titans signed Hardik Pandya for 15 crores, and he even was named the captain of the side. Hardik Pandya happily surprised everyone when he came to bowl for the Titans in the IPL. Under Hardik’s captaincy, Gujarat Titans have almost put their feet in the playoffs of the tournament. Hardik Pandya baby name and family details Hardik Pandya is married to Indian-Serbian dancer Natasa Stankovic, and both of them got married in January 2020. They announced in May 2020 that Natasa is expecting a baby. Hardik and Natasa’s baby boy Agastya Pandya was born on 30th July 2020. Hardik went on Instagram to share the news with all. Hardik Pandya’s brother Krunal Pandya is also an international cricketer, who is currently playing for Lucknow Super Giants in the IPL 2022. Krunal Pandya is married to Pankhuri Sharma. Himanshu Pandya, Hardik’s father was a businessman, but he passed away in 2021. Nalini Pandya is Hardik Pandya’s mother. Got my lucky charm on my side for tomorrow’s game @hardikpandya7 pic.twitter.com/OiDfEMHeHJ — Krunal Pandya (@krunalpandya24) May 9, 2022 Hardik Pandya Vadodara house and net worth As per many reports, Hardik Pandya’s net worth in 2022 is around INR 67 crores. The net worth of Hardik Pandya has grown despite his irregularities in the Indian cricket team due to injuries. Hardik Pandya has been doing quite a few endorsements with multiple brands. Hardik Pandya was signed by Gujarat Titans ahead of the IPL 2022 auction for a price of INR 15 crores and was appointed the captain of the side as well. It is said that Hardik’s car collection is worth over INR 15.5 crores with cars like Audi, Mercedes and Range Rover. Hardik Pandya also bought a luxury house in Vadodara last year which is worth over INR 2 crores. It is a 6000 Sq. Ft. Penthouse with so many luxurious amenities. The post Hardik Pandya baby name and family details: Hardik Pandya Vadodara house and net worth appeared first on The SportsRush.","pubDate":"2022-05-10 14:06:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Osmania University Annual Sports Day: CSC, ECE emerge champions","link":"https://telanganatoday.com/osmania-university-annual-sports-day-csc-ece-emerge-champions","keywords":["News","Sport","Computer Science Engineering","ECE","Hyderabad","Osmania University"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: Computer Science Engineering (CSC) clinched overall championship in the boys category while Electronics and Communications Engineering (ECE) emerged champions in the girls category of the Osmania University College of Engineering Annual Sports Day held in the Osmania University, Hyderabad on Tuesday. Results: Overall Championship: Winners: Boys: CSC; Girls: ECE; Cricket: Boys: Winners: CSC; Runner-up: […]","content":"Hyderabad: Computer Science Engineering (CSC) clinched overall championship in the boys category while Electronics and Communications Engineering (ECE) emerged champions in the girls category of the Osmania University College of Engineering Annual Sports Day held in the Osmania University, Hyderabad on Tuesday. Electronics and Communications Engineering (ECE) girls receiving their overall championship trophy. Results: Overall Championship: Winners: Boys: CSC; Girls: ECE; Cricket: Boys: Winners: CSC; Runner-up: Civil; Girls: Winners: ECE; Runner-up: CSC; Carroms: Boys: Winners: Mechanical; Runner-up: BME; Girls: Winners: Mechanical; Runner-up: CSC; Chess: Boys: Winners: Mechanical; Runner-up: CSC; Girls: Winners: Civil; Runner-up: ECE; Throwball: Girls: Winners: ECE; Runner-up: EEE; Tennikoit: Boys: Winners: MCA; Runner-up: CSE; Girls: Winners: EEE; Runner-up: BME; Volleyball: Boys: Winners: M Tech; Runner-up: BME; Table Tennis: Boys: Winner: ECE; Runner-up: EEE; Girls: Winner: EEE; Runner-up: CSE; Badminton: Boys: Winner: Mechanical; Runner-up: MCA; Girls: Winner: ECE; Runner-up: CSE; Football: Boys: Winner: Civil; Runner-up: CSE; Basketball: Boys: Winner: CSE; Runner-up: BME.     Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-05-10 13:57:11","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Karan Sharma cricketer IPL 2022 price: Why is Ravi Bishnoi not playing today’s IPL 2022 match between Lucknow Super Giants and Gujarat Titans?","link":"https://thesportsrush.com/cricket-news-karan-sharma-cricketer-ipl-2022-price-why-is-ravi-bishnoi-not-playing-todays-ipl-2022-match-between-lucknow-super-giants-and-gujarat-titans/","keywords":["Cricket","Gujarat Titans","IPL 2022","Lucknow Super Giants","GT","Indian Premier League","LSG"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Ravi Bishnoi not playing today: Lucknow Super Giants have made a solitary change to their Playing XI for this match. During the 57th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Gujarat Titans in Pune, Gujarat Titans captain Hardik Pandya has won the toss and chose… The post Karan Sharma cricketer IPL 2022 price: Why is Ravi Bishnoi not playing today’s IPL 2022 match between Lucknow Super Giants and Gujarat Titans? appeared first on The SportsRush.","content":"Why Ravi Bishnoi not playing today: Lucknow Super Giants have made a solitary change to their Playing XI for this match. During the 57th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Gujarat Titans in Pune, Gujarat Titans captain Hardik Pandya has won the toss and chose to bat. “We will bat first. Want to put up some runs, the wicket looks alright for the entire duration of the game. The wicket has played some role, batting first here – teams have won plenty of games,” Pandya told Star Sports at the toss. “We have won some five games we were looking like losing, we need to forget the last couple of losses, learn from those things, the tournament isn’t over as yet.” ! #LSGvGT | #AavaDe | #TATAIPL | #SeasonOfFirsts pic.twitter.com/W54Jl2K97S — Gujarat Titans (@gujarat_titans) May 10, 2022 Pandya announced three “tactical” changes in the form of wicket-keeper batter Matthew Wade, spinner R Sai Kishore and pacer Yash Dayal replacing batter Sai Sudharsan and fast bowlers Pradeep Sangwan and Lockie Ferguson. Why is Ravi Bishnoi not playing vs Gujarat Titans today? Lucknow Super Giants captain KL Rahul, who wanted to bowl first at the Maharashtra Cricket Association Stadium tonight, was contended with the result of coin toss. Rahul, 30, admitted that he wasn’t sure about how the wicket would behave for this match. “We would have wanted to bowl first. Not sure about how this wicket will play, so want to give our bowlers the best shot at using it first. We are playing a top team, a competitive unit, so we’ll have to hold our pressure, assess the conditions quickly and get our tactics and strategies right,” Rahul told Star Sports at the toss. The only change for Super Giants has come in the form of debutant batter Karan Sharma coming in for spinner Ravi Bishnoi. One of LSG’s three acquired players before the auction, Rahul didn’t provide any rationale behind leaving out Bishnoi. Readers must note that the 21-year old spinner has picked nine wickets at an average of 38.44, an economy rate of 8.23 and a strike rate of 28 this season. Sharma, who leads Uttar Pradesh in domestic cricket, was bought by Super Giants for his base price of INR 20 lakh. In his 10-match T20 career, 23-year old Sharma has scored 301 runs at an average of 33.44 and a strike rate of 136.19 and picked a couple of wickets in as many outings at an economy rate of 5.50. The post Karan Sharma cricketer IPL 2022 price: Why is Ravi Bishnoi not playing today’s IPL 2022 match between Lucknow Super Giants and Gujarat Titans? appeared first on The SportsRush.","pubDate":"2022-05-10 13:52:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-gujarat-titans-live-score-over-match-57-t20-1-5-updates-2963286","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Gujarat Titans from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 4.1 overs, Gujarat Titans are 24/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Gujarat Titans. Everything related to Lucknow Super Giants and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Gujarat Titans live score. Do check for Lucknow Super Giants vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.1 overs (1 Run) 1 run. 3.6 overs (0 Run) Dushmantha Chameera finishes with a slower one! Shorter ball, outside off. Matthew Wade looks to pull but he gets beaten due to lack of pace. 3.5 overs (1 Run) Back of a length, down the leg side. Shubman Gill pulls it along the ground towards fine leg for a single. 3.4 overs (1 Run) A full-length delivery, outside off, a tad slower this time, at around 125 clicks. Matthew Wade knocks it towards mid off and takes a quick single. 3.3 overs (0 Run) Lovely fielding! Much fuller this time, outside off. Matthew Wade drives it firmly towards cover. Marcus Stoinis does well to stop the ball. 3.2 overs (4 Runs) FOUR! Pulled away! Shorter this time, around middle, Matthew Wade smashes this over mid-wicket for a cracking boundary. Back-to-back boundaries for Wade and three in a row for Gujarat! 3.1 overs (4 Runs) FOUR! Crunched! Lovely shot by Wade! Good-length delivery, outside off. Matthew Wade gets on top of the bounce and forces it powerfully through covers for a boundary. 2.6 overs (4 Runs) FOUR! A boundary to spoil a fantastic over. Short in length, around off, Shubman Gill rocks back and slaps it past the point fielder for a boundary. 2.5 overs (1 Run) Short in length and outside off, a bit of extra bounce, Wade guides it down to third man and opens his account with a run. Matthew Wade comes in at number 3. 2.4 overs (0 Run) OUT! CAUGHT! A deserving wicket for Mohsin Khan and Lucknow, and Mohsin Khan continues to shine! An early breakthrough for Lucknow, just what they wanted. Another length ball, around middle and leg. Wriddhiman Saha once again looks to flick, but the ball goes off the top half of the bat and lobs up towards mid on. Avesh Khan there takes an easy catch. Wriddhiman Saha departs for a timid score! 2.3 overs (0 Run) Oh, dear! Another missed opportunity! A length ball, around middle and leg. Wriddhiman Saha flicks this but the ball goes off the leading edge towards the bowler. Mohsin Khan goes for the ball, but he slips while running and fails to reach the chance. 2.2 overs (1 Run) Length ball, around middle and leg. Shubman Gill works it away towards mid-wicket for a single. 2.1 overs (0 Run) A length ball, nipping back in, around middle and leg. Shubman Gill looks to flick this away but he misses and gets rapped on his pads. 1.6 overs (0 Run) Swing a miss! A length ball, outside off. Wriddhiman Saha looks to go downtown but he fails to get any bat on it once again. 1.5 overs (0 Run) Dushmantha Chameera goes short now, outside off, at around 139 clicks. Wriddhiman Saha looks to pull but he misses. 1.4 overs (4 Runs) FOUR! First boundary of the innings! Not from the middle of the bat, but the ball races away! Marginally short, around middle and off. Wriddhiman Saha drags it with the inner half of his bat past mid-wicket for a boundary. 1.3 overs (0 Run) Tad fuller, around middle. Wriddhiman Saha blocks it out. 1.2 overs (1 Run) Missed opportunity again, this time KL Rahul misses out on a run out chance. Around off, Gill pushes it towards mid off and scampers across. Rahul attacks the ball but fails to pick it up cleanly otherwise there was a run out chance at the bowler's end. 1.1 overs (0 Run) A length ball, width on offer. Shubman Gill slashes it towards cover-point. Deepak Hooda there does well to stop the ball. That had four written all over it! It will be Dushmantha Chameera to share the new ball. 0.6 over (1 Run) JUST SHORT! Mohsin goes short and outside off, Shubman Gill tries to cut from the back foot but it flies off the top edge towards third man. Karan Sharma, in the deep, perhaps picks it late and then puts in a forward dive. The ball though lands just short of him and sneaks behind. He gets back and retrieves the ball. A single taken. Had Sharma put in a little bit of run, it would have been an easy catch. 0.5 over (1 Run) Back of a length, outside off. Wriddhiman Saha opens the face of the bat and guides it to third man for a single. Wriddhiman Saha and Gujarat are up and running! 0.4 over (0 Run) A length ball, tailing back in a tad, darting it on the pads. Wriddhiman Saha looks to flick but he misses and gets hit on his pads. 0.3 over (0 Run) Marginally short again, outside off. Wriddhiman Saha dabs it towards point off the back foot. 0.2 over (0 Run) Back of a length, shaping away, outside off. There is some extra bounce and Wriddhiman Saha gets beaten after feeling for it inside the line. 0.1 over (0 Run) EDGED AND JUST SHORT! Mohsin Khan is right on the money straightaway! A fuller ball, around middle and leg. Wriddhiman Saha looks to flick this but the ball goes off the outside edge and lands just short of second slip. The clash is set to begin. The Lucknow players stride out to the middle, followed by Shubman Gill and Wriddhiman Saha who walk out to open for Gujarat. Mohsin Khan to start with the new ball for Lucknow. Here we go... Shubman Gill is in for a chat. He says that he started off well, but he had some unfortunate dismissals, but he has found his form in the last few games and he wants to carry his momentum. Adds that the next few games are important for them if they have to stay in the top two in the points table. Talking about his inspiration, Gill replies that while growing up, it was Sachin sir but once he retired and once he started to understand the game a bit more, he was always a fan of Virat Kohli. KL Rahul, the skipper of Lucknow, says they wanted to bowl first anyway. Adds that he was not aware of the stats here that the team batting first has won 8 out of the 11 times. Mentions that batting first could be tricky and it gives their bowlers the opportunity to see what the pitch has to offer. States that they are not chasing the perfect game and they have been finding ways to win. Further says that the challenges will be different this evening and it's important to hold their composure. Feels that it's important to assess the conditions quickly and get their tactics and strategies right. Informs that they have one change - Karan Sharma comes in for Ravid Bishnoi. Hardik Pandya, the captain of Gujarat says that they are batting as they want to put runs on the board and the pitch looks fine, won't change much. Tells that the pitches have played a role here but it's more important for them to see how many runs they can put and how they defend it. Says that they have won 5 games which they could have lost so the odds have caught up and it is important as a team for them to be positive. Adds that it's important for them to forget the defeats, learn from them and move on. States that as a team they need to be positive. Informs that they have made three changes - Matthew Wade, Ravisrinivasan Sai Kishore and Yash Dayal come in for Lockie Ferguson, Sai Sudharsan and Pradeep Sangwan. Mentions that all the changes are tactical. Lucknow (Playing XI) - Quinton de Kock (WK), KL Rahul (C), Deepak Hooda, Marcus Stoinis, Krunal Pandya, Ayush Badoni, Jason Holder, Dushmantha Chameera, Mohsin Khan, Karan Sharma (In for Ravi Bishnoi), Avesh Khan. Gujarat (Playing XI) - Wriddhiman Saha (WK), Shubman Gill, Matthew Wade (In for Lockie Ferguson), Ravisrinivasan Sai Kishore (In for Sai Sudharsan), Hardik Pandya (C), David Miller, Rahul Tewatia, Rashid Khan, Yash Dayal (In for Pradeep Sangwan), Alzarri Joseph, Mohammad Shami. TOSS - The coin goes up and lands in favour of Hardik Pandya. GUJARAT ELECT TO BAT! Pitch report - It's a breezy evening here in Pune. The surface to be used is number 8, right at the centre and it has been used twice before. Most of the wickets here have been picked by the fast bowlers, i.e. 21 out of 25. The pitch doesn't have much grass and it wears a dry look. The seamers will get a lot of help from it and the breeze will also help. The last time these two sides met was at the start of the tournament and it was Gujarat who came out on top. Lucknow will like to settle a score here and become the first team to get into the playoffs. Whatever be the result, we are in for an intriguing contest. Stay tuned for the toss and other updates. Lucknow, on the flip side, are coming into this game after winning four games on the trot. They have the winning momentum by their side and will be coming into this contest high on confidence. They have been clinical in all the departments of the game and Hooda batting at number 3 has done wonders for them. A solid and in-form batting line-up backed by an exemplary bowling attack, Lucknow look like the favourite to take this match. Gujarat have had a great tournament so far, but they seem to have lost their rhythm. They are coming into this game after suffering consecutive losses. Their batting which has helped them win matches in crunch situations has not clicked in the last few games. That remains to be a slight issue. But, they are filled with match-winners and will have to step up in this important clash. Hello and a warm welcome folks to match number 57 between the newbies of the tournament, Lucknow and Gujarat. The way they have been performing they do not really seem like the newbies. Both these sides are sitting pretty in the top half of the table with only being separated by the net run rate. The winner of this contest will get stationed at the top of the table and will also cement its spot in the playoffs. Plenty riding on this top-of-the-table clash. Stay tuned for more updates... ... MATCH DAY ...","pubDate":"2022-05-10 13:36:13","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637878063645118004.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa cricket body drops all charges against Boucher","link":"https://www.thestar.com/sports/cricket/2022/05/10/south-africa-cricket-body-drops-all-charges-against-boucher.html","keywords":null,"creator":["Gerald Imray - The Associated Press"],"video_url":null,"description":null,"content":null,"pubDate":"2022-05-10 13:21:45","image_url":null,"source_id":"thestar","country":["canada"],"category":["sports"],"language":"english"},{"title":"Bumrah takes 5/10 for Mumbai!","link":"https://www.cairnspost.com.au/sport/cricket/bumrah-takes-510-for-mumbai/video/c1a017505016f2e1ffd37dd368951c65","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Jasprit Bumrah proved he is one of the best seam bowlers in the world, bowling an impressive 5/10 for the Mumbai Indians against the Kolkata Night Riders.","content":null,"pubDate":"2022-05-10 13:09:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ranveer Singh, AR Rahman roped in for IPL 2022 closing ceremony","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/ranveer-singh-ar-rahman-roped-in-for-ipl-2022-closing-ceremony/article38487189.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"BCCI president Ganguly said that to celebrate 75 years of India's independence, the Board will also put on a show, chronicling the journey of Indian cricket.","content":null,"pubDate":"2022-05-10 13:00:18","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Nepal Bowler Does 'Pushpa' Celebration, ICC Says \"It's Gone So Far\"","link":"https://sports.ndtv.com/cricket/nepal-bowler-does-pushpa-celebration-icc-says-its-gone-so-far-on-social-media-watch-2963047","keywords":null,"creator":null,"video_url":null,"description":"The FairBreak Invitational Tournament is an innovative women's cricket tournament grouping established stars with emerging-nation players.","content":"The 'Pushpa' fever has hit women's cricket too now. After Ravindra Jadeja and Obed McCoy did the now-famous mode of celebration in the Indian Premier League (IPL) 2022, the FairBreak Invitational Tournament in Dubai has now seen an instance of a player doing the 'Pushpa' celebration. In a match between Tornadoes Women and Sapphires Women on May 5, Nepal's Sita Rana Magar can be seen moving her hand under the chin, mimicking Allu arjun's style in the superhit movie 'Pushpa', after picking a wicket for the former. \"It's gone so far on social media. Nepal's Sita Rana Magar with the most popular celebration currently,\" wrote the ICC with a video of the post. A post shared by ICC (@icc) The FairBreak Invitational Tournament is an innovative women's cricket tournament grouping established stars with emerging-nation players starts this week as the sport looks to expand globally and outgrow its reliance on the men's game. The FairBreak Invitational, featuring England captain Heather Knight , West Indies skipper Stafanie Taylor and Pakistan's Sana Mir , opened last Wednesday accompanied by calls for better funding for the sport. Women's cricket has emerged as a marketing hit in recent years with international finals played at sold-out stadiums, including a record 86,000-plus at the Melbourne Cricket Ground for the T20 World Cup decider in March 2020. Progress was halted by the pandemic but the sport bounced back with a successful World Cup in New Zealand, Australia beating Knight's England at a sold-out Hagley Oval last month. Knight, whose Barmy Army-sponsored FairBreak team includes players from Vanuatu and Rwanda, said it was time that women's cricket ended its financial reliance on the men's game. Promoted \"I think there are discrepancies and certain things in the women's game,\" she told journalists at Dubai International Cricket Stadium earlier.","pubDate":"2022-05-10 12:42:46","image_url":"https://c.ndtvimg.com/2022-05/ginal5no_nepal-bowler-pushpa-celeb_120x90_10_May_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"MCA Stadium Pune Shubman Gill record: Total runs of Shubman Gill IPL 2022","link":"https://thesportsrush.com/cricket-news-mca-stadium-pune-shubman-gill-record-total-runs-of-shubman-gill-ipl-2022/","keywords":["Cricket","Gujarat Titans","IPL 2022","Lucknow Super Giants","GT","Indian Premier League","LSG"],"creator":["Dixit Bhargav"],"video_url":null,"description":"MCA Stadium Pune Shubman Gill record: The opening batter from Gujarat Titans has only played a couple of Pune T20s. Lucknow Super Giants and Gujarat Titans locking horns in the 57th Indian Premier League 2022 match at the Maharashtra Cricket Association Stadium will seal the first playoffs berth of this season tonight. A clash of… The post MCA Stadium Pune Shubman Gill record: Total runs of Shubman Gill IPL 2022 appeared first on The SportsRush.","content":"MCA Stadium Pune Shubman Gill record: The opening batter from Gujarat Titans has only played a couple of Pune T20s. Lucknow Super Giants and Gujarat Titans locking horns in the 57th Indian Premier League 2022 match at the Maharashtra Cricket Association Stadium will seal the first playoffs berth of this season tonight. A clash of the table-toppers, both Lucknow and Gujarat have 16 points under their belt on the back of winning eight and losing three out of their 11 league matches so far. With this match having it in it to power one of these two teams to 18 points , the same would be enough for confirmed a place in the Top Four. While Super Giants will take the field as a more confident unit by virtue of winning their last four matches, Titans will have to return to winning ways after two consecutive losses. Due for an impact-generating performance, GT opening batter Shubman Gill will be expected to stand tall on his potential in order for his team to bounce back. Second-highest run-scorer for Gujarat in their inaugural IPL season thus far, Gill has scored 321 runs at an average and strike rate of 29.18 and 138.96 respectively. Gill, who had kick-started his fifth IPL season with a couple of half-centuries, did score 52 (36) in the last match against Mumbai Indians but will now have to continue playing in a similar manner at this crucial stage of the tournament. Hard one to take but we learn and move on @gujarat_titans pic.twitter.com/VwKNP5jRlB — Shubman Gill (@ShubmanGill) May 7, 2022 Having played just a couple of T20s in Pune, the 22-year old player has returned with contrasting returns. While he had scored 84 (46) against Delhi Capitals in their season opener at this venue, he followed it with 0 (1) against defending champions Chennai Super Kings here. Gill, who has played 13 matches across formats for India, has never played an international match at the MCA Stadium.","pubDate":"2022-05-10 12:38:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL Live: Lucknow Super Giants Face Gujarat In Top-Of-The-Table Clash","link":"https://sports.ndtv.com/cricket/live-ipl-score-lsg-vs-gt-live-cricket-score-lucknow-super-giants-vs-gujarat-titans-live-scoreboard-and-updates-2963018","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, Lucknow Super Giants vs Gujarat Titans Live IPL Score Updates: LSG face GT in their Indian Premier League match, at the Maharashtra Cricket Association Stadium in Pune.","content":null,"pubDate":"2022-05-10 12:32:37","image_url":"https://c.ndtvimg.com/2022-05/g3hepeb_hardik-pandya-bcci-ipl_625x300_10_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Thorpe hospitalised after falling &quot;seriously ill&quot;","link":"https://www.thestar.com.my/sport/cricket/2022/05/10/cricket-thorpe-hospitalised-after-falling-seriously-ill","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former England batsman and coach Graham Thorpe has fallen \"seriously ill\" and has been admitted to a hospital to receive treatment, the Professional Cricketers' Association (PCA) said on Tuesday. Read full story","content":null,"pubDate":"2022-05-10 12:23:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/10/1580455.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"LSG vs GT Live Score, IPL 2022 Latest Match Updates: It's KL Rahul vs Hardik Pandya; Toss at 7:00 PM","link":"https://www.indiatvnews.com/sports/cricket/lsg-vs-gt-live-score-lucknow-super-giants-vs-gujarat-titans-ipl-2022-latest-match-updates-highlights-live-streaming-full-scorecard-ipl-news-2022-05-10-775524","keywords":null,"creator":null,"video_url":null,"description":"LSG vs GT Live Score, IPL 2022 Latest Match Updates: It's KL Rahul vs Hardik Pandya; Toss at 7:00 PM LSG vs GT Dream11 Prediction IPL 2022, Fantasy Cricket Playing Tips, Dream11 Team, Predicted Playing XI {twitter:twitter.com/gujarat_titans/status/1523696380552019968}","content":null,"pubDate":"2022-05-10 12:14:26","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Just stay like this”: LSG mentor Gautam Gambhir shares batting tips with Krunal Pandya ahead of 2022 IPL match vs Gujarat Titans","link":"https://thesportsrush.com/cricket-news-just-stay-like-this-lsg-mentor-gautam-gambhir-shares-batting-tips-with-krunal-pandya-ahead-of-2022-ipl-match-vs-gujarat-titans/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","Gautam Gambhir","Krunal Pandya"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Gautam Gambhir was seen giving some batting tips to Lucknow’s all-rounder Krunal Pandya during the training session. Lucknow Super Giants have played some brilliant cricket in the Indian Premier League, and they have won eight of their 11 games in the tournament so far. The all-new franchise started the tournament with a defeat, but they… The post “Just stay like this”: LSG mentor Gautam Gambhir shares batting tips with Krunal Pandya ahead of 2022 IPL match vs Gujarat Titans appeared first on The SportsRush.","content":"Gautam Gambhir was seen giving some batting tips to Lucknow’s all-rounder Krunal Pandya during the training session. Lucknow Super Giants have played some brilliant cricket in the Indian Premier League, and they have won eight of their 11 games in the tournament so far. The all-new franchise started the tournament with a defeat, but they have been rock solid in the tournament so far with both bat and the ball. The best thing about the team has been that this side does not rely on any single individual for their victories. KL Rahul has been the best batter of the side with 451 runs at an average of 50.11, courtesy of two centuries and two half-centuries. Avesh Khan has been the best bowler of the side with 14 wickets. The biggest strength of the side has been the plethora of the all-rounders. With options like Krunal Pandya, Marcu Stoinis, Deepak Hooda, Jason Holder, Krishnappa Gowtham and Ayush Badoni, the side is filled with bowling and batting options. Gautam Gambhir shares batting tips with Krunal Pandya Lucknow Super Giants have released a video on their social media handle, where all-rounder Krunal Pandya has been seen taking some batting tips from the club’s mentor Gautam Gambhir. Krunal Pandya has scored 153 runs this season with the bat, and he has played some good knocks for the side. During the practice session, Pandya was seen changing his batting position just ahead of the bowler delivering the ball, Gautam Gambhir asked him to stay at this normal position only, and the results were visible in the next shots as well. “Jab bowler ball daal ra hai tu positon change kar ra hai, stay like this,” Gautam Gambhir was seen saying in the video. EXCLUSIVE! Krunal Pandya spends time with mentor Gautam Gambhir as #LucknowSuperGiants are ready for the clash vs #GujaratTitans in IPL! Get behind the scenes access with #InsideLSG exclusively on Editorji #IPL2022 #LSG @IPL #LSGvsGT @LucknowIPL pic.twitter.com/tqzTSNvggv — Editorji (@editorji) May 10, 2022 Gautam Gambhir was also seen saying to Krunal Pandya about batting with an open stance so that it will automatically set his head position as well. Krunal Pandya was bought by Lucknow Super Giants for a price of INR 8.25 crores in the auction. The post “Just stay like this”: LSG mentor Gautam Gambhir shares batting tips with Krunal Pandya ahead of 2022 IPL match vs Gujarat Titans appeared first on The SportsRush.","pubDate":"2022-05-10 12:00:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Quinton de Kock vs Mohammed Shami IPL record: Q de Kock at MCA Stadium Pune IPL stats","link":"https://thesportsrush.com/cricket-news-quinton-de-kock-vs-mohammed-shami-ipl-record-q-de-kock-at-mca-stadium-pune-ipl-stats/","keywords":["Cricket","Gujarat Titans","IPL 2022","Lucknow Super Giants","GT","Indian Premier League","LSG","Mohammed Shami","Quinton De Kock"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Quinton de Kock vs Mohammed Shami: The two cricketers have played against each other on five occasions in the Indian Premier League. The 57th match of the ongoing 15th season of the Indian Premier League will be played between newbies but table-toppers Lucknow Super Giants and Gujarat Titans in Pune tonight. In what will be… The post Quinton de Kock vs Mohammed Shami IPL record: Q de Kock at MCA Stadium Pune IPL stats appeared first on The SportsRush.","content":"Quinton de Kock vs Mohammed Shami: The two cricketers have played against each other on five occasions in the Indian Premier League. The 57th match of the ongoing 15th season of the Indian Premier League will be played between newbies but table-toppers Lucknow Super Giants and Gujarat Titans in Pune tonight. In what will be the 12th IPL 2022 match at the Maharashtra Cricket Association Stadium, it will be the penultimate one of this season. As for Super Giants and Titans, both the teams will be playing their third match of the season at this venue. Readers must note that both Lucknow and Gujarat are yet to lose an IPL 2022 match here. The Bhai-Valry that kickstarted our #SeasonOfFirsts , is back!! 🔥 The excitement is palpable with all 👀 on the top spot 🙌 #LSGvGT #AavaDe pic.twitter.com/fDacYmHckO — Gujarat Titans (@gujarat_titans) May 10, 2022 LSG wicket-keeper batter Quinton de Kock and GT fast bowler Mohammed Shami playing against each other will be among the many contests worth-watching on Tuesday. Having faced each other in the IPL on five occasions in the past, de Kock and Shami have managed to call the shots against each other on different occasions. It is noteworthy that de Kock has scored 42 (26) with the help of three fours and two sixes at a strike rate of 161.53 against Shami across five innings. In return, the right-arm bowler has dismissed the left-handed batter thrice in the IPL. As far as de Kock’s Pune T20 stats are concerned, the 29-year old batter has played only three T20s here scoring 98 runs at an average and strike rate of 32.67 and 132.43 respectively. de Kock had scored 50 (29) against Kolkata Knight Riders in his latest T20 at the MCA Stadium. ALSO READ: KL Rahul vs Mohammed Shami IPL record de Kock’s solitary international match at this venue was a Test match against India in 2019. Batting in the middle-order, de Kock had scored 31 (48) and 5 (9) in an innings and 137-run South African loss.","pubDate":"2022-05-10 11:54:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rishabh Pant should bat in 'Andre Russell mode' - Ravi Shastri's advice to DC skipper","link":"https://www.dnaindia.com/cricket/report-ipl-2022-rishabh-pant-should-bat-in-andre-russell-mode-ravi-shastri-advice-to-dc-skipper-2951997","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Former Indian head coach Ravi Shastri has given golden advice to Rishabh Pant. Shastri feels Pant should bat in 'Andre Russell mode' in T20 cricket.","content":null,"pubDate":"2022-05-10 11:49:18","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/05/10/1791887-fotojet-1.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“If you’ve got a great captain, which Eoin Morgan is, that’s like playing with 12”: Rob Key backs Eoin Morgan to remain England’s white-ball captain, ye rakhe","link":"https://thesportsrush.com/cricket-news-if-youve-got-a-great-captain-which-eoin-morgan-is-thats-like-playing-with-12-rob-key-backs-eoin-morgan-to-remain-englands-white-ball-captain-ye-rakhe/","keywords":["Cricket","Eoin Morgan","RCB","Rob Key"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Rob Key has backed Eoin Morgan to remain England’s white-ball captain despite all the talks about sacking him from the side. England’s cricket is going through a transformation phase, and they have made some vital changes in their system. Ben Stokes has been named the new test captain of the side after the sacking of… The post “If you’ve got a great captain, which Eoin Morgan is, that’s like playing with 12”: Rob Key backs Eoin Morgan to remain England’s white-ball captain, ye rakhe appeared first on The SportsRush.","content":"Rob Key has backed Eoin Morgan to remain England’s white-ball captain despite all the talks about sacking him from the side. England’s cricket is going through a transformation phase, and they have made some vital changes in their system. Ben Stokes has been named the new test captain of the side after the sacking of Joe Root. It is being said that Gary Kirsten is the favourite to become the new red ball coach of the side, whereas Brendon McCullum is leading the race to be the next white-ball captain. England is trying to experiment with different coaches for different formats of the games. Rob Key backs Eoin Morgan to be England’s white-ball captain After the disappointing ICC World Cup 2015 campaign, the England cricket team decided to change their approach to playing the format. They changed their whole team, and Eoin Morgan was given the free hand to lead the side according to his way of playing. Under the captaincy of Eoin Morgan, England revolutionized the way to play the white-ball format of the game. England also won the ICC 2019 World Cup at their home. However, Eoin Morgan has been in a lean phase with the bat, and there have been a lot of talks about sacking him from the team. However, Rob Key, the new director of English cricket has confirmed that Eoin Morgan’s captaincy is in his own hands, and he will play a part in England’s white-ball plans. “I’ve spoken to Eoin quite a bit,” Key said. “He’ll always do what’s right for English cricket. He’s pretty clear on that himself, if you’ve got a great captain, which Eoin Morgan is, that’s like playing with 12.” Sir Clive Lloyd received his knighthood and Eoin Morgan received his CBE for services to cricket in a ceremony at Windsor Castle today pic.twitter.com/0ovwds8jbc — ESPNcricinfo (@ESPNcricinfo) January 12, 2022 Rob Key insists that a captain impacts the game by his every decision on the field and not just by his batting. Key said that Morgan is one of the best in the business. “As a captain, you [make an] impact with your decision-making: every decision you make, within a ball, you will know if that’s been the right decision or not and Eoin Morgan is the best in the world at that,” Key added. “I’m sure at some point, as Eoin will probably tell you himself, if he feels he’s not that then I’m sure he’ll do the best thing for English cricket. He always has done.” The post “If you’ve got a great captain, which Eoin Morgan is, that’s like playing with 12”: Rob Key backs Eoin Morgan to remain England’s white-ball captain, ye rakhe appeared first on The SportsRush.","pubDate":"2022-05-10 11:15:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CSA drops all charges of misconduct against Boucher","link":"https://www.indiatvnews.com/sports/cricket/cricket-south-africa-drops-all-disciplinary-charges-including-racism-against-mark-boucher-2022-05-10-775492","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa (CSA) on Tuesday gave a clean chit to current national coach Mark Boucher and dropped all charges of gross misconduct, including racism. The move comes less than a week before he was to defend himself in a disciplinary hearing.","content":null,"pubDate":"2022-05-10 10:37:53","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Cricket Australia monitor situation in Sri Lanka ahead of tour","link":"https://www.thestar.com.my/sport/cricket/2022/05/10/cricket-cricket-australia-monitor-situation-in-sri-lanka-ahead-of-tour","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Cricket Australia is monitoring the unrest in Sri Lanka but is confident the national team's seven-week tour of the island will go ahead as scheduled in June and July, the governing body said on Tuesday. Read full story","content":null,"pubDate":"2022-05-10 10:31:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/10/1580337.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket Australia monitors situation in Sri Lanka ahead of tour","link":"https://sportstar.thehindu.com/cricket/cricket-australia-tour-of-sri-lanka-schedule-economy-crisis/article38487031.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Seven people died and more than 200 were injured on Monday as thousands defied a curfew to protest against the Sri Lankan government, which is battling the worst economic crisis in its history.","content":null,"pubDate":"2022-05-10 10:28:32","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}