{"newsArray":[{"article_id":"2c155f9a11e8404a86e8ed735956b9fe","title":"د کرکټ نړیوالې شورا د سري لانکا غړیتوب وځنډاوه","link":"https://www.pashtovoa.com/a/icc-suspends-cricket-sri-lanka-over-political-meddling/7350245.html","keywords":["لوبې","نور خبرونه","د کرکټ ۲۰۲۳ نړیوال جام"],"creator":null,"video_url":null,"description":"د کرکټ نړیوالې شورا (ای سي سي)د جمعې په ورځ نومبر ۱۰ (لړم ۱۹) وویل چې د سري لانکا د کرکټ بورډ په چارو کې د حکومت د مداخلې له کبله یې په شورا کې ددغه هېواد شمولیت ځنډولی دی.","content":"د کرکټ نړیوالې شورا (ای سي سي)د جمعې په ورځ نومبر ۱۰ (لړم ۱۹) وویل چې د سري لانکا د کرکټ بورډ په چارو کې د حکومت د مداخلې له کبله یې په شورا کې ددغه هېواد شمولیت ځنډولی دی. د کرکټ دغې نړیوالې انتظامي ادارې ویلي چې د سري لانکا کرکټ د دې شورا \"د غړي په توګه له خپلو مکلفیتونو څخه په جدي توګه سرغړونه کړې، په ځانګړې توګه د دې اړتیا چې په خپلواکه توګه خپلې چارې اداره کړي او ډاډ ترلاسه کړي چې حکومت یې په چارو کې مداخله نه کوي.\" په ای سي سي کې د سري لانکا غړیتوب یوه ورځ وروسته له هغه وځنډول شو چې د سري لانکا پارلمان د مالي فساد د تورونو له امله د سري لانکا کرکټ بورډ له غړو څخه د استعفا غوښتنه وکړه. د ای سي سي په اعلامیه کې ویل شوي چې شورا به د سري لانکا د غړیتوب د ځنډولو د شرایطو او جزیاتو په اړه وروسته پرېکړه وکړي. ټاکل شوې ده چې د ۱۹ کلنو د کرکټ نړیوال جام راتلونکې جنوري په سري لانکا کې ترسره شي. په سمدستي توګه نه ده معلومه چې په ای سي سي کې تر نامعلوم وخت پورې د سري لانکا د غړیتوب ځنډېدل به پر دغو لوبو څه اغېزه وکړي. د مالي او سیاسي کړکیچ سره د لاس او ګریوال سري لانکا حکومت له وړاندې دیوالي شوی او کرکټ بورډ په دغه جزیره يي هېواد کې تر ټولو شتمنه اداره ګڼل کیږي. په نړیوال جام کې د سري لانکا د سختو ماتو وروستو، د حکومت او کرکټ بورډ تر منځ کړکیچ لا پراخ شو. د سري لانکا پارلمان د پنجشنبې په ورځ د سريلانکا د کرکټ بورډ له منتخبو غړو د استعفا غوښتنه وکړه او هغوی یې د میلیونونو ډالرو په فساد تورن کړل. ددغه هېواد کرکټ بورډ تر اوسه د پارلمان دغې غوښتنې ته ځواب نه دی ویلی. د سري لانکا د حکومت د اپوزیسیون مشر ساجیت پریماداسا وویل دا اقدام یې \"یوه تاریخي پریکړه وه او نړۍ ته دا پیغام ورکوي چې د سري لانکا قانون جوړونکي د کرکټ د دفاع او د لوبې د بشپړتیا دپاره متحده شوي دي.\" د سري لانکا د سپورت وزیر د دوشنبې په ورځ د دغه هېواد کرکټ بورډ لغوه اعلان کړ خو یوه ورځ وروسته د استیناف محکمې د بورډ د دوباره فعالیت پرېکړه وکړه او ټاکل شوې ده چې په راتلونکو دوو اونیو کې د موضوع په اړه محکمه بله استماعیه غونډه وکړي. د ای سي سي قوانین د کرکټ بورډ په چارو کې د حکومت د لاس وهنې مخنیوی کوي او له دې وړاندې یې هم د سري لانکا غړیتوب ځنډولی دی.","pubDate":"2023-11-10 20:21:51","image_url":"https://gdb.voanews.com/6153ccba-8c10-46cb-a91d-ac781c0b2421_cx0_cy10_cw0_w800_h450.jpg","source_id":"pashtovoa","source_priority":601967,"country":["afghanistan"],"category":["sports"],"language":"pashto"},{"article_id":"7ab51f87056cf0ba3d34fe02c5533889","title":"श्रीलंका क्रिकेट को बड़ा झटका, ICC ने तत्काल प्रभाव से सदस्यता भंग की, इस बड़ी वजह से मिली सजा","link":"https://sports.ndtv.com/hindi/cricket/icc-has-suspended-sri-lanka-cricket-s-membership-with-immediate-effect-4565151#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"World Cup 2023 में खराब प्रदर्शन के बीच श्रीलंका क्रिकेट को लगातार झटके पर झटके लग रहे हैं","content":"श्रीलंका क्रिकेट के लिए एक के बाद एक बुरी खबर आ रही है मानो जारी में खराब प्रदर्शन अपने आप में काफी था. इस प्रदर्शन के बाद क्रिकेट में मची हलचल के बाद उसे एक और बड़ा झटका लगा है. अंतरराष्ट्रीय क्रिकेट काउंसिल (ICC) ने तत्काल प्रभाव से उसकी सदस्यता को निलंबित कर दिया है. ICC बोर्ड की आज बैठक हुई और इसी मीटिंग में क्रिकेट श्रीलंका को आईसीसी की सदस्यता से निलंबित करने का फैसला लिया गया. बतौर सदस्य श्रीलंका पर नियमों के उल्लंघन के गंभीर आरोप लगाए गए हैं. इसमें बोर्ड के मामलों को स्वायत्तापूर्ण तरीकों से चलाना और यह सुनिश्चित करना है कि बोर्ड की कार्यप्रणाली, संचालन या क्रिकेट प्रशासन में सरकार की दखलअंदाजी न हो. श्रीलंका की संसद ने दरअसल वीरवार को को देश की क्रिकेट संचालन संस्था को बर्खास्त करने के लिए सर्वसम्मति से एक प्रस्ताव पारित किया किया था. और इसे सत्ता पक्ष और विपक्षी दलों का पूरा समर्थन मिला था. मुख्य विपक्ष पार्टी के नेता साजिथ प्रेमदासा ने संसद में ‘भ्रष्ट श्रीलंका क्रिकेट (एसएलसी) प्रबंधन को हटाने' के शीर्षक का प्रस्ताव पेश किया जिसका सरकार के सीनियर मंत्री निमल सिरिपाला डिसिल्वा ने पूरा समर्थन किया. वहीं दो दिन पहले अपील अदालत ने मंगलवार को शम्मी सिल्वा की अध्यक्षता वाले श्रीलंका क्रिकेट प्रबंधन को बहाल किया था, लेकिन इसके बावजूद श्रीलंका सरकार ने क्रिकेट बोर्ड को बर्खास्त कर दिया. और आईसीसी को सरकार का यह फैसला पसंद नहीं आया, जो कि पैतृक संस्था के नियमों के खिलाफ है. आईसीसी बोर्ड द्वारा निलंबन की शर्तों पर आने वाले समय पर फैसला किया जाएगा. इसी बीच मुख्य चयनकर्ता प्रमोदया विक्रमसिंघे ने शुक्रवार को आरोप लगाया कि विश्व कप में श्रीलंका के खराब प्रदर्शन के पीछे बाहरी साजिश है. श्रीलंकाई क्रिकेट टीम शुक्रवार की सुबह भारत से लौट आईय उसे बेंगलुरू में आखिरी ग्रुप मैच में न्यूजीलैंड ने पांच विकेट से हराया. खराब प्रदर्शन के कारणों के बारे में पूछे जाने पर विक्रमसिंघा ने कहा, ‘मुझे दो दिन का समय दीजिये. फिर सब कुछ बता दूंगा. यह बाहरी साजिश का परिणाम है.' उन्होंने कहा ,‘मैं बहुत दुखी हूं. मैं इसकी जिम्मेदारी लेता हूं' पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. और जानें इलेक्शन शेड्यूल NDTV India पर. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-11-10 18:10:14","image_url":"https://c.ndtvimg.com/2023-07/e23q1mko_srilanka_120x90_02_July_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"82f1b8db72fe81a7bc890d08063d2efa","title":"Left-Arm Spin, Short-Pitched Bowling: How Kohli Practiced Ahead Of WC Game","link":"https://sports.ndtv.com/cricket/left-arm-spin-short-pitched-bowling-how-virat-kohli-practiced-ahead-of-cricket-world-cup-2023-game-4565195","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli's net sessions are often an intense, well-calculated drill, a compressed version of his real-game batting.","content":"Virat Kohli's net sessions are often an intense, well-calculated drill, a compressed version of his real-game batting. India's optional nets in Bengaluru on Friday was an encore as Kohli meticulously went about polishing his skills against short-pitched bowling and left-arm spin that he will need to negate potentially against New Zealand in the World Cup semifinals. The Kiwis are primed for a last four match against India at Mumbai on November 15 on the back of 10 points and a superior run-rate than their closest contender Pakistan. The immediate goal in front of Kohli might be disposing of Netherlands, but with due respect the Dutch are not yet in the New Zealand class. One of the challenges the Black Caps will pose to Kohli will be through Lockie Ferguson. The express pacer is yet to fire like he did in the 2019 World Cup, partially because of a right Achilles niggle. But Ferguson showed signs of hitting the peak against Sri Lanka at the Chinnaswamy Stadium rattling the Lankan middle and late order with a barrage of short-pitched balls. He even pinged Maheesh Theekshana on his hands, leaving the batsman writhing in pain for a few minutes. Ferguson is quite certain to repeat the tactics against India too if the meeting materializes. Kohli owns one of the better pulls in contemporary cricket and rarely get rattled by the body line but true to his character, the former Indian captain did not leave anything to chance. Pacer Shardul Thakur and the side-arm specialists bowled an array of bouncers at Kohli and he had little difficulty in smoking several of them away, some shots travelling as far as the second tier. The 35-year-old also attempted a couple of ramp shots, which might prove handy against a bowler like Ferguson who can hit north of 150 kmph. The second testing point for Kohli might come in the form of Mitchell Santner's left-arm spin. It is no secret that the Indian star does not boast of a fine record against that type, often getting in tangles. Advertisement In the past, left-armers like Keshav Maharaj, Shakib Al Hasan and Dunith Wellalage had success against Kohli. Santner has been New Zealand's best bowler on view here, consistently hitting the right length to keep the batters' largely silent. It has reflected in his numbers too in the event – 16 wickets from nine matches with a fine economy of 4.6 to boot. It is highly likely that Kohli will face Santner in the middle-overs against whom he averages just 9.33 across 17 matches while getting dismissed three times. Even if one takes recent numbers, Kohli's struggle against left-arm spinners is quite evident. Since January 2021, Kohli averages just over 13 against them and strike-rate dwindles to 66. So, it was no real surprise to see Kohli perfecting his craft against left-arm spin while facing Ravindra Jadeja at nets, who also managed to elicit a couple of false shots from the Delhiite. However, it was clear that Kohli has already measured in his mind the possible danger areas that he might have to traverse on the big day. Ishan Kishan stays away It was an optional session but all the Indian players except Ishan Kishan attended the nets. In a novelty, pacer Jasprit Bumrah tried his hand in a bit of spin while head coach Rahul Dravid doubled up as a side-arm thrower.","pubDate":"2023-11-10 17:44:28","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"09e233bc7ee7d2ee761ad8b6a92ac0e1","title":"ICC suspends Sri Lanka over gov’t interference","link":"https://thefrontierpost.com/icc-suspends-sri-lanka-over-govt-interference/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"NEW DELHI (Agencies): The International Cricket Council (ICC) has suspended Sri Lanka with immediate effect after “government interference” in the running of the sport in the country. On Monday, the country’s sports minister announced the that the entire that the entirety of the cricket board had been sacked. The minister installed an interim committee led […]","content":"NEW DELHI (Agencies): The International Cricket Council (ICC) has suspended Sri Lanka with immediate effect after “government interference” in the running of the sport in the country. On Monday, the country’s sports minister announced the that the entire that the entirety of the cricket board had been sacked. The minister installed an interim committee led by former captain Arjuna Ranatunga but otherwise lacking in cricketing experience that included the sons of two politicians. However that inteim committee was subsequently struck down by the courts, with the old Sri Lanka Cricket (SLC) board reinstated. The changes came after a difficult Cricket World Cup that leaves Sri Lanka likely to miss out on qualification for the 2025 Champions Trophy. And while the conditions of their suspension are still to be decided, the news from the ICC comes as another significant blow to cricket in the country. “The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership of the ICC with immediate effect,” the ICC said in a statement. “The ICC Board met today and determined that Sri Lanka Cricket is in serious breach of its obligations as a Member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka. “The conditions of the suspension will be decided by the ICC Board in due course.” Sri Lanka, who are led by former England seamer and coach Chris Silverwood, won just two of their nine World Cup group games. They had reached the final of the 2023 Asia Cup ahead of the tournament, but were thrashed by India after being bowled out for 50. Silverwood’s side fared little better against the hosts during the World Cup, registering 55 all out in response to India’s total of 357-8. Sri Lanka are currently ninth in the standings, with only the top eight finishers qualifying for the Champions Trophy in two years’ time. They are level on points with England, Bangladesh and the Netherlands, who all have one more match to play. The city of Colombo, meanwhile, is due to host the men’s U19 Cricket World Cup in January and February of next year.","pubDate":"2023-11-10 17:29:41","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"f46a37be6466accb3af2c475219f4e7b","title":"ICC suspends Sri Lanka’s membership with immediate effect due to government interference","link":"https://sambadenglish.com/icc-suspends-sri-lankas-membership-with-immediate-effect-due-to-government-interference/","keywords":["SPORTS"],"creator":["Sambad English Bureau"],"video_url":null,"description":"NEW DELHI: The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership with immediate effect due to government interference in administration, which had been in tumultuous waters for the last week. It added that the conditions of the suspension will be decided by the ICC Board in due course. The huge development comes just […] The post ICC suspends Sri Lanka’s membership with immediate effect due to government interference first appeared on Sambad English.","content":"The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership with immediate effect due to government interference in administration, which had been in tumultuous waters for the last week. It added that the conditions of the suspension will be decided by the ICC Board in due course. The huge development comes just a day after Sri Lanka’s campaign in the 2023 Men’s ODI World Cup in India came to an end with a five-wicket defeat to New Zealand in Bengaluru. In the tournament, Sri Lanka won two while losing seven games to end their campaign in ninth place, with its qualification for the 2025 Champions Trophy in jeopardy as they are out of the top eight teams in the points table. In the meeting held on Friday, the ICC said in a statement its Board “determined that Sri Lanka Cricket is in serious breach of its obligations as a Member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka.” Incidentally, on the day Sri Lanka’s campaign in the Men’s ODI World Cup came to an end, its parliament unanimously passed a resolution, calling for the sacking of the SLC Board. The resolution in the parliament was supported by both the ruling and opposition parties. The parliament resolution came two days after the Court of Appeal restored the SLC management headed by Shammi Silva on Tuesday, which had been sacked by Sports Minister Roshan Ranasinghe. Ranasinghe had appointed former Sri Lanka cricketer and 1996 World Cup-winning captain Arjuna Ranatunga as head of a seven-member interim committee to govern the cricketing affairs in the country in place of the SLC management. There had been a public outcry in the country after Sri Lanka suffered a mammoth 302-run loss to India at the Wankhede Stadium in Mumbai on November 2, with many demanding the sacking of the SLC board led by Silva, who was elected to the chairman post in May this year. SLC is the second full member to have its membership suspended by ICC in the last few years after Zimbabwe Cricket was suspended in 2019 for government interference. It remains to be seen what conditions ICC imposes in terms of SLC suspension and the effect it can have on cricketing activities in the country, considering that Sri Lanka are also the host of the 2024 Men’s U19 Cricket World Cup to be held in January next year.","pubDate":"2023-11-10 17:28:12","image_url":null,"source_id":"sambadenglish","source_priority":332200,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"e27acb0bdae41443b1064e04462a0304","title":"South Africa complete nervy win over Afghanistan","link":"https://www.bbc.co.uk/sport/av/cricket/67379686","keywords":null,"creator":null,"video_url":null,"description":"Watch highlights as Rassie van der Dussen hits an unbeaten 76 to seal South Africa's nervy five-wicket win over Afghanistan to secure them a place in the semi-finals of the Cricket World Cup.","content":null,"pubDate":"2023-11-10 17:08:21","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"3ae51770782b956b24c6d1c5ef017778","title":"Van der Dussen guides South Africa past Afghanistan","link":"https://www.bbc.co.uk/sport/cricket/67377932","keywords":null,"creator":null,"video_url":null,"description":"Rassie van der Dussen hits an unbeaten 76 to take South Africa to a nervy five-wicket win over Afghanistan.","content":"ICC Cricket World Cup: Rassie van der Dussen leads South Africa's victory over Afghanistan ICC Men's World Cup, Ahmedabad Afghanistan 244 (50 overs): Azmatullah 97* (107); Coetzee 4-44, Maharaj 2-25 South Africa 247-5 (47.3 overs): Van der Dussen 76* (95), De Kock 41 (47); Nabi 2-35 South Africa won by five wickets Scorecard . Table . Rassie van der Dussen hit an unbeaten 76 to take South Africa to a tense five-wicket win over Afghanistan in their final World Cup group game. Gerald Coetzee took 4-44 as the Proteas bowled Afghanistan out for 244 after Azmatullah Omarzai made an unbeaten 97 to rescue the innings from 116-6. South Africa made hard work of the chase but held their nerve to get over the line in the 48th over. Defeat officially ended Afghanistan's chances of making the top four. World Cup 2023: Table, run-scorers & wicket-takers Jonathan Trott's side needed to win by a highly improbable 438 runs to overhaul New Zealand on net run rate and stay in contention to reach the knockout stages but, after opting to bat first, lost wickets in clusters. After a steady start, they lost three wickets for four runs to slip from 41-0 to 45-3 and then another mini collapse saw them lose three wickets in four overs midway through the innings. However, Azmatullah held Afghanistan together with a well-paced knock, biding his time before accelerating late on, but three dot balls to end the innings left him three shy of a maiden international century. In reply, South Africa, who have dominated sides when batting first but struggled chasing, started well with openers Quinton de Kock and Temba Bavuma putting on 61. They fell in quick succession but Van der Dussen and Aiden Markram continued the momentum with a 60-run stand. But every time the Proteas appeared to be cruising, Afghanistan took a wicket to drag them back and when David Miller was dismissed with 62 still needed, the game was in the balance. Van der Dussen and Andile Phehlukwayo remained composed, though, and having whittled down the runs required, they finished it in a hurry with the latter going six, four, six to seal the win. With a number of players struggling with slight injuries - most notably Bavuma and Lungi Ngidi -throughout the game, South Africa now have a few days to rest and recover before their semi-final against Australia. Afghanistan out after tournament to remember After losing to Bangladesh in their first game, not much was expected of Afghanistan at this World Cup. For all the talent in their team and the way they had shown themselves capable of competing with the top sides in white-ball cricket, they had yet to do it on the big stage with their only 50-over World Cup win coming against Scotland in 2015. A month later and they have beaten three former champions in England, Pakistan and Sri Lanka - all in convincing fashion - and comfortably seen off the Netherlands as well. But for one of the great one-day innings of all-time , they would surely have added Australia to that list and come into this match knowing a win would put them into the semi-finals. That dream has eluded them this time but any notion of Afghanistan being minnows of world cricket has long since been banished. The confidence gained from their accomplishments in India should serve them well and with an ICC tournament each year for the foreseeable future, they will have plenty more chances to make history. 'Part of me is dreaming' - what they said South Africa captain Temba Bavuma: \"My leg is sore. I don't know the extent of it yet but I'll have to be fine. I am stubborn, it will have to be fine. \"Part of me is dreaming. We want to be back here [in the final]. But Australia are a big hurdle for us to overcome. We will enjoy today, take the learnings and then get our minds set on that game.\" Afghanistan captain Hashmatullah Shahidi: \"We gave a good message to the world in this tournament. We played big teams and we fought. The Australia game was in our hands, it was a shock that defeat. There was a lot of learning.\" Player of the Match, South Africa's Rassie van der Dussen: \"Someone always has to play the anchor role in a chase and I was happy to do that. The platform I had from Temba and Quinton made my job a lot easier, too. \"We do so well batting first and that makes people think we chase badly. We would like to improve our chasing, yes, and I think being in that situation tonight will hold us in good stead.\"","pubDate":"2023-11-10 16:58:48","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"aec6eed00a783c4eb1db0df3fbf512c1","title":"Sri Lanka Cricket suspended over government interference","link":"https://www.bbc.co.uk/sport/cricket/67384199","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket are suspended by the International Cricket Council (ICC) because of government interference.","content":"Sri Lanka were beaten by New Zealand in their final World Cup match on Thursday Sri Lanka have been suspended by the International Cricket Council (ICC) because of government interference. Sri Lanka's ministry of sport sacked the national board (SLC) amid the team's poor World Cup, although the decision was reversed by a court. The ICC board determined \"Sri Lanka is in serious breach of its obligations as a member\". The terms of the suspension, including any potential ramifications, will be decided at the next ICC board meeting. The ICC said Sri Lanka had broken \"the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration\". Sri Lanka have won just two of their nine games at the World Cup so far, leaving them ninth in the table. They are coached by former England coach Chris Silverwood. Last week sports minister Roshan Ranasinghe described the SLC as \"traitorous and corrupt\" in a statement to parliament and called for board members to resign. Secretary Mohan de Silva quit and the board was sacked. Ranasinghe replaced them with an interim committee chaired by World Cup-winning captain Arjuna Ranatunga, although a petition against the dismissal was granted a two-week stay order by a court this week. SLC also issued a statement on allegations made by Ranasinghe about supposed financial irregularities. The ICC suspension comes a day after Sri Lanka's last game at the World Cup in India - a defeat by New Zealand on Thursday. England are due to host Sri Lanka for a three-Test series next summer while Sri Lanka are also due to host the Under-19 men's World Cup in January and February next year. Afghanistan have not been banned by the ICC despite the Taliban banning women from playing sports, resulting in their women's team being unable to compete. BBC Sport understands this is because the ICC sees there to be no government interference in Afghanistan. Speaking to the BBC's Stumped podcast on Thursday, ICC chief executive Geoff Allardice said: \"We have spoken with the Afghanistan Cricket Board and the position is that they have to operate within the laws of the country and the rules are set by the government. \"Really the question for the ICC board is, do we support our member in their ability to promote cricket within the rules set by the government of the country? And the view is yes.\" Listen to full Stumped interview with Geoff Allardice","pubDate":"2023-11-10 16:50:33","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"45302ac3069bdfa715dccd2ed0975fe1","title":"Rassie van der Dussen stars as Proteas knock Afghanistan out of Cricket World Cup","link":"https://www.iol.co.za/sport/cricket/proteas/rassie-van-der-dussen-stars-as-proteas-knock-afghanistan-out-of-cricket-world-cup-d6471885-d7b7-4092-a47a-b291bfc01abd","keywords":null,"creator":["AFP"],"video_url":null,"description":"South Africa beat Afghanistan by five wickets to win their last World Cup group game on Friday as the Asian side were eliminated from the semi-final race.","content":"Ok, well not in quite that macho tone, for South Africa may have completed a rare successful run-chase to close off their Cricket World Cup league phase on a positive note, but they will certainly have to play much better in next Thursday’s semi-final against their arch-rivals at Eden Gardens if they are to progress to a first-ever final. With the comfort of already having secured a semi-final place, the Proteas lacked intensity from the outset. They were also comfortable enough to give Marco Jansen a much-needed break that afforded Andile Phehlukwayo his first run out at this World Cup. Ultimately, it proved to work out just fine with Phehlukwayo (39 not out) carving out a match-winning 65-run partnership with anchorman Rassie van der Dussen (76 not out off 95 balls) to take South Africa home by five wickets with 15 balls to spare. The margin of victory may seem comfortable, but it certainly was not for large chunks of the run-chase with South Africa’s ability to put themselves under pressure rising to the surface once again. Quinton de Kock and captain Temba Bavuma , who was hampered by a hamstring injury throughout the game and is now a potential doubtful starter for the Australian semi-final, seemed to get everything underway with relative ease in their 64-run opening partnership. But once Bavuma (23) and De Kock (41) fell in quick succession, it opened the door for Afghanistan superstar Rashid Khan (2/37) to create his customary chaos in the middle-order. And when Rashid removed arguably South Africa’s best players of spin in Aiden Markram and Heinrich Klaasen within a few overs of each other, the cat was well and truly among the pigeons. All the bad memories of failed chases resurfaced, with former England and Australian captains Nasser Hussein and Aaron Finch turning up the intensity on commentary and fueling the drama, which only intensified when David Miller meekly surrendered to a Mohammed Nabi (2/35) caught and bowled chance. Throughout all this histrionics, Van der Dussen remained ice cool at the non-striker’s end, staying in his bubble, and content to do the hard graft before breaking the shackles with the odd boundary in between. He played a visible role in comforting Phehlukwayo, who had not batted out in the middle since the last ODI against Australia back in South Africa at the Wanderers prior to the World Cup almost two months ago. Phehlukwayo’s rustiness was visible, but settled the longer he stayed at the crease, before finishing the game in a flourish with a six, four and six off Naveen-ul-Haq to end unbeaten on 39. Proteas coach Rob Walter will certainly be pleased that his team eventually crossed the line with the bat, but the inability to close out the opposition’s innings remains a cause for concern. South Africa had once again reduced the Afghans to 160/7, but then allowed them to score a further 84 runs for the three remaining wickets with Azmatullah Omarzai striking a defiant 97 not out. It did seem that South Africa had shifted their attention to the semi-final already at that stage with the seamers, and Lungi Ngidi in particular, adopting a strategy of trying to bowl wide yorkers. If that was indeed the case, then plenty of work still needs to be done in the nets this week too leading up the semi-final, with South Africa conceding 10 wides in the process and Ngidi delivering three in succession in the penultimate over. Only Gerald Coetzee seemed to have brought any energy and passion with him to the Narendra Modi Stadium yesterday as he finished with 4/44 to surpass Jansen as South Africa’s leading wicket-taker in the tournament. “Today we did a few things differently. We batted second today. To get over the line in that manner, that is going to give us a lot of confidence. Fantastic knock by Rassie, he took ownership and the guys batted around him,” Bavuma said. “Not really (concerned about the opposition’s lower order runs). The wicket got better. When Keshav came back for his second spell, it was not gripping and spinning as much. Gerald also came in and took wickets, always a huge plus. We can always pick on the different phases and we can think of things to improve, but we will take the win. The skipper also provided an update on his injury. “Obviously my leg is sore. Don't know to what extent but it is going to have to be fine, at least in my eyes. I obviously had that option of coming off but it was our last group stage game, and I wanted to be out there with the guys. Was an opportunity to spend some time in the middle and I did not want to let it go. Wanted to keep marshalling the guys, and keep strengthening the relationship with our bowlers. It was a risk but I felt it was the right move (to stay on). Winning is a habit, so we want to take that momentum through,” he said. Scorecard Afghanistan: 244 all out (Azmatullah Omarzai 97*, Coetzee 4/44, Maharaj 2/25) South Africa: 247/5 (Van der Dussen 76*, De Kock 41, Phehlukwayo 39*, Rashid Khan 2/37, Nabi 2/35) South Africa won by five wickets IOL Sport","pubDate":"2023-11-10 16:50:14","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/e9e81872-e80b-55d5-9ab3-ac18c83ea028&operation=CROP&offset=0x59&resize=2507x1409","source_id":"iol","source_priority":32046,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"24a95c869def2c216897c2f319f5452b","title":"World Cup: Van der Dussen guides South Africa to five-wicket win over Afghanistan","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/10/world-cup-van-der-dussen-guides-south-africa-to-five-wicket-win-over-afghanistan-2631892.html","keywords":null,"creator":null,"video_url":null,"description":"Chasing 245 for victory, the Proteas, who had already qualified for the semifinals, completed the task in 47.3 overs. AHMEDABAD: The calmness of Rassie van der Dussen and fire of Gerald Coetzee helped experienced South Africa overcame spirited resistance from Afghanistan to carve out a five-wicket win in their last league game of the World Cup here on Friday. Set a target of 245, South Africa, who are already assured of a place in semifinals, completed the task with Van der Dussen remaining unbeaten on 76 off 95 balls. Andile Phehlukwayo was unbeaten on a 37-ball 39 after a match-winning partnership of 65 runs with Van der Dussen. Earlier, pacer Coetzee took four wickets as Afghanistan were limited to 244 despite Azmatullah Omarzai's impressive 97. Omarzai's knock, however, helped the Afghans to recover from 116 for six. The defeat notwithstanding, Afghanistan, who shocked defending champions England and Pakistan during a very promising campaign, would go home with their heads held high. Continuing his good run in the tournament, Omarzai faced 107 balls while hitting seven fours and three sixes. However, he could not record his maiden ODI hundred after failing to score off the last three balls of the final over bowled by Kagiso Rabada. On a pitch without any demons, South Africa started their chase confidently. But, as the match progressed, things didn't pan out the way South Africa would have liked them to. In the end, they achieved it with 15 balls remaining after a mighty scrap. The in-form Quinton de Kock (41 off 47 balls) made his intentions clear quite early with a four and a six off Mujeeb Ur Rahman, dancing down the track to pummel the seasoned bowler over mid-off. The dashing left-handed batter, who went past Rachin Ravindra to become the leading scorer of this tournament, then pulled a Naveen-ul-Haq half-tracker over deep square leg for a maximum. De Kock, however, could not go on to make a big one as he was adjudged trapped in front of the wicket by Mohammad Nabi, who chose to review after failing to convince the on-field umpire. Looking to play a reverse sweep, De Kock missed and the ball hit the pads, prompting Nabi to go for a loud appeal. Afghanistan's move to review the decision was vindicated when the ball tracking showed that it was going to hit the leg stump. De Kock, who had earlier in the day joined the likes of Adam Gilchrist and Sarfaraz Khan by taking six catches, struck two fours and three sixes. Meanwhile, skipper Temba Bavuma's (23 off 28) poor run continued as he was shown the door by Mujeeb, who had the batter in all sorts of trouble with a back of a length delivery that hurried onto him. Bavuma, who looked like he was struggling while fielding, seemed to battle cramps after he had come out to bat with an intention to spend some time in the middle following an underwhelming sequence of scores. Aiden Markram (25 off 32) also gave his wicket away after getting a start while Heinrich Klaasen was dismissed by the wily Rashid Khan, a well-deserved reward for some excellent bowling, as South Africa slipped to 139 for four in the 28th over. A 43-run partnership ensued before Nabi had David Miller (24 off 33) in a rather soft dismissal, leaving Van der Dussen to complete the job. Earlier, Afghanistan were off to a steady start after their skipper Hashmatullah Shahidi opted to bat first, but South Africa meant business as they snared three wickets for four runs to leave their opponents in a spot of bother at 45 for three in the 11th over. At that point, it seemed like the decision to bat first was backfiring even as Bavuma marshalled his resources well to keep South Africa ahead in the game. But even before the Proteas could celebrate the first breakthrough they faced an anxious moment when pacer Lungi Ngidi went off the field after suffering what looked like an ankle or achilles issue. Ngidi, however, returned to pick the wickets of Rahmat Shah and Nabi, who nicked one to De Kock after facing just three balls, leaving his team at 116 for six in the 28th over. Having smoked lead pacer Rabada's length ball outside off for a six over long-on, Rahmanullah Gurbaz (25) found the fence again when he produced a lovely cover driver against the same bowler. Desperately looking for a breakthrough, Bavuma introduced Keshav Maharaj into the attack and the left-arm spinner straightaway responded with the big wicket of Gurbaz, who edged a turning delivery to Klaasen at first slip. Not only did Maharaj strike with his first ball he also enjoyed a wicket-maiden, giving South Africa a bit of a momentum which they used to their advantage by quickly grabbing two more wickets. Much was expected of Ibrahim Zadran, who scored a brilliant hundred against Australia in their last game, but the opener was done in by a short ball from Coetzee. Omarzai, however, continued to fight it out.","content":"AHMEDABAD: The calmness of Rassie van der Dussen and fire of Gerald Coetzee helped experienced South Africa overcame spirited resistance from Afghanistan to carve out a five-wicket win in their last league game of the World Cup here on Friday. Set a target of 245, South Africa, who are already assured of a place in semifinals, completed the task with Van der Dussen remaining unbeaten on 76 off 95 balls. Andile Phehlukwayo was unbeaten on a 37-ball 39 after a match-winning partnership of 65 runs with Van der Dussen. Earlier, pacer Coetzee took four wickets as Afghanistan were limited to 244 despite Azmatullah Omarzai's impressive 97. Omarzai's knock, however, helped the Afghans to recover from 116 for six. The defeat notwithstanding, Afghanistan, who shocked defending champions England and Pakistan during a very promising campaign, would go home with their heads held high. Continuing his good run in the tournament, Omarzai faced 107 balls while hitting seven fours and three sixes. However, he could not record his maiden ODI hundred after failing to score off the last three balls of the final over bowled by Kagiso Rabada. On a pitch without any demons, South Africa started their chase confidently. But, as the match progressed, things didn't pan out the way South Africa would have liked them to. In the end, they achieved it with 15 balls remaining after a mighty scrap. The in-form Quinton de Kock (41 off 47 balls) made his intentions clear quite early with a four and a six off Mujeeb Ur Rahman, dancing down the track to pummel the seasoned bowler over mid-off. The dashing left-handed batter, who went past Rachin Ravindra to become the leading scorer of this tournament, then pulled a Naveen-ul-Haq half-tracker over deep square leg for a maximum. De Kock, however, could not go on to make a big one as he was adjudged trapped in front of the wicket by Mohammad Nabi, who chose to review after failing to convince the on-field umpire. Looking to play a reverse sweep, De Kock missed and the ball hit the pads, prompting Nabi to go for a loud appeal. Afghanistan's move to review the decision was vindicated when the ball tracking showed that it was going to hit the leg stump. De Kock, who had earlier in the day joined the likes of Adam Gilchrist and Sarfaraz Khan by taking six catches, struck two fours and three sixes. Meanwhile, skipper Temba Bavuma's (23 off 28) poor run continued as he was shown the door by Mujeeb, who had the batter in all sorts of trouble with a back of a length delivery that hurried onto him. Bavuma, who looked like he was struggling while fielding, seemed to battle cramps after he had come out to bat with an intention to spend some time in the middle following an underwhelming sequence of scores. Aiden Markram (25 off 32) also gave his wicket away after getting a start while Heinrich Klaasen was dismissed by the wily Rashid Khan, a well-deserved reward for some excellent bowling, as South Africa slipped to 139 for four in the 28th over. A 43-run partnership ensued before Nabi had David Miller (24 off 33) in a rather soft dismissal, leaving Van der Dussen to complete the job. Earlier, Afghanistan were off to a steady start after their skipper Hashmatullah Shahidi opted to bat first, but South Africa meant business as they snared three wickets for four runs to leave their opponents in a spot of bother at 45 for three in the 11th over. At that point, it seemed like the decision to bat first was backfiring even as Bavuma marshalled his resources well to keep South Africa ahead in the game. But even before the Proteas could celebrate the first breakthrough they faced an anxious moment when pacer Lungi Ngidi went off the field after suffering what looked like an ankle or achilles issue. Ngidi, however, returned to pick the wickets of Rahmat Shah and Nabi, who nicked one to De Kock after facing just three balls, leaving his team at 116 for six in the 28th over. Having smoked lead pacer Rabada's length ball outside off for a six over long-on, Rahmanullah Gurbaz (25) found the fence again when he produced a lovely cover driver against the same bowler. Desperately looking for a breakthrough, Bavuma introduced Keshav Maharaj into the attack and the left-arm spinner straightaway responded with the big wicket of Gurbaz, who edged a turning delivery to Klaasen at first slip. Not only did Maharaj strike with his first ball he also enjoyed a wicket-maiden, giving South Africa a bit of a momentum which they used to their advantage by quickly grabbing two more wickets. Much was expected of Ibrahim Zadran, who scored a brilliant hundred against Australia in their last game, but the opener was done in by a short ball from Coetzee. Omarzai, however, continued to fight it out.","pubDate":"2023-11-10 16:42:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2c155f9a11e8404a86e8ed735956b9fe","title":"د کرکټ نړیوالې شورا د سري لانکا غړیتوب وځنډاوه","link":"https://www.pashtovoa.com/a/icc-suspends-cricket-sri-lanka-over-political-meddling/7350245.html","keywords":["لوبې","نور خبرونه","د کرکټ ۲۰۲۳ نړیوال جام"],"creator":null,"video_url":null,"description":"د کرکټ نړیوالې شورا (ای سي سي)د جمعې په ورځ نومبر ۱۰ (لړم ۱۹) وویل چې د سري لانکا د کرکټ بورډ په چارو کې د حکومت د مداخلې له کبله یې په شورا کې ددغه هېواد شمولیت ځنډولی دی.","content":"د کرکټ نړیوالې شورا (ای سي سي)د جمعې په ورځ نومبر ۱۰ (لړم ۱۹) وویل چې د سري لانکا د کرکټ بورډ په چارو کې د حکومت د مداخلې له کبله یې په شورا کې ددغه هېواد شمولیت ځنډولی دی. د کرکټ دغې نړیوالې انتظامي ادارې ویلي چې د سري لانکا کرکټ د دې شورا \"د غړي په توګه له خپلو مکلفیتونو څخه په جدي توګه سرغړونه کړې، په ځانګړې توګه د دې اړتیا چې په خپلواکه توګه خپلې چارې اداره کړي او ډاډ ترلاسه کړي چې حکومت یې په چارو کې مداخله نه کوي.\" په ای سي سي کې د سري لانکا غړیتوب یوه ورځ وروسته له هغه وځنډول شو چې د سري لانکا پارلمان د مالي فساد د تورونو له امله د سري لانکا کرکټ بورډ له غړو څخه د استعفا غوښتنه وکړه. د ای سي سي په اعلامیه کې ویل شوي چې شورا به د سري لانکا د غړیتوب د ځنډولو د شرایطو او جزیاتو په اړه وروسته پرېکړه وکړي. ټاکل شوې ده چې د ۱۹ کلنو د کرکټ نړیوال جام راتلونکې جنوري په سري لانکا کې ترسره شي. په سمدستي توګه نه ده معلومه چې په ای سي سي کې تر نامعلوم وخت پورې د سري لانکا د غړیتوب ځنډېدل به پر دغو لوبو څه اغېزه وکړي. د مالي او سیاسي کړکیچ سره د لاس او ګریوال سري لانکا حکومت له وړاندې دیوالي شوی او کرکټ بورډ په دغه جزیره يي هېواد کې تر ټولو شتمنه اداره ګڼل کیږي. په نړیوال جام کې د سري لانکا د سختو ماتو وروستو، د حکومت او کرکټ بورډ تر منځ کړکیچ لا پراخ شو. د سري لانکا پارلمان د پنجشنبې په ورځ د سريلانکا د کرکټ بورډ له منتخبو غړو د استعفا غوښتنه وکړه او هغوی یې د میلیونونو ډالرو په فساد تورن کړل. ددغه هېواد کرکټ بورډ تر اوسه د پارلمان دغې غوښتنې ته ځواب نه دی ویلی. د سري لانکا د حکومت د اپوزیسیون مشر ساجیت پریماداسا وویل دا اقدام یې \"یوه تاریخي پریکړه وه او نړۍ ته دا پیغام ورکوي چې د سري لانکا قانون جوړونکي د کرکټ د دفاع او د لوبې د بشپړتیا دپاره متحده شوي دي.\" د سري لانکا د سپورت وزیر د دوشنبې په ورځ د دغه هېواد کرکټ بورډ لغوه اعلان کړ خو یوه ورځ وروسته د استیناف محکمې د بورډ د دوباره فعالیت پرېکړه وکړه او ټاکل شوې ده چې په راتلونکو دوو اونیو کې د موضوع په اړه محکمه بله استماعیه غونډه وکړي. د ای سي سي قوانین د کرکټ بورډ په چارو کې د حکومت د لاس وهنې مخنیوی کوي او له دې وړاندې یې هم د سري لانکا غړیتوب ځنډولی دی.","pubDate":"2023-11-10 20:21:51","image_url":"https://gdb.voanews.com/6153ccba-8c10-46cb-a91d-ac781c0b2421_cx0_cy10_cw0_w800_h450.jpg","source_id":"pashtovoa","source_priority":601967,"country":["afghanistan"],"category":["sports"],"language":"pashto"},{"article_id":"7ab51f87056cf0ba3d34fe02c5533889","title":"श्रीलंका क्रिकेट को बड़ा झटका, ICC ने तत्काल प्रभाव से सदस्यता भंग की, इस बड़ी वजह से मिली सजा","link":"https://sports.ndtv.com/hindi/cricket/icc-has-suspended-sri-lanka-cricket-s-membership-with-immediate-effect-4565151#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"World Cup 2023 में खराब प्रदर्शन के बीच श्रीलंका क्रिकेट को लगातार झटके पर झटके लग रहे हैं","content":"श्रीलंका क्रिकेट के लिए एक के बाद एक बुरी खबर आ रही है मानो जारी में खराब प्रदर्शन अपने आप में काफी था. इस प्रदर्शन के बाद क्रिकेट में मची हलचल के बाद उसे एक और बड़ा झटका लगा है. अंतरराष्ट्रीय क्रिकेट काउंसिल (ICC) ने तत्काल प्रभाव से उसकी सदस्यता को निलंबित कर दिया है. ICC बोर्ड की आज बैठक हुई और इसी मीटिंग में क्रिकेट श्रीलंका को आईसीसी की सदस्यता से निलंबित करने का फैसला लिया गया. बतौर सदस्य श्रीलंका पर नियमों के उल्लंघन के गंभीर आरोप लगाए गए हैं. इसमें बोर्ड के मामलों को स्वायत्तापूर्ण तरीकों से चलाना और यह सुनिश्चित करना है कि बोर्ड की कार्यप्रणाली, संचालन या क्रिकेट प्रशासन में सरकार की दखलअंदाजी न हो. श्रीलंका की संसद ने दरअसल वीरवार को को देश की क्रिकेट संचालन संस्था को बर्खास्त करने के लिए सर्वसम्मति से एक प्रस्ताव पारित किया किया था. और इसे सत्ता पक्ष और विपक्षी दलों का पूरा समर्थन मिला था. मुख्य विपक्ष पार्टी के नेता साजिथ प्रेमदासा ने संसद में ‘भ्रष्ट श्रीलंका क्रिकेट (एसएलसी) प्रबंधन को हटाने' के शीर्षक का प्रस्ताव पेश किया जिसका सरकार के सीनियर मंत्री निमल सिरिपाला डिसिल्वा ने पूरा समर्थन किया. वहीं दो दिन पहले अपील अदालत ने मंगलवार को शम्मी सिल्वा की अध्यक्षता वाले श्रीलंका क्रिकेट प्रबंधन को बहाल किया था, लेकिन इसके बावजूद श्रीलंका सरकार ने क्रिकेट बोर्ड को बर्खास्त कर दिया. और आईसीसी को सरकार का यह फैसला पसंद नहीं आया, जो कि पैतृक संस्था के नियमों के खिलाफ है. आईसीसी बोर्ड द्वारा निलंबन की शर्तों पर आने वाले समय पर फैसला किया जाएगा. इसी बीच मुख्य चयनकर्ता प्रमोदया विक्रमसिंघे ने शुक्रवार को आरोप लगाया कि विश्व कप में श्रीलंका के खराब प्रदर्शन के पीछे बाहरी साजिश है. श्रीलंकाई क्रिकेट टीम शुक्रवार की सुबह भारत से लौट आईय उसे बेंगलुरू में आखिरी ग्रुप मैच में न्यूजीलैंड ने पांच विकेट से हराया. खराब प्रदर्शन के कारणों के बारे में पूछे जाने पर विक्रमसिंघा ने कहा, ‘मुझे दो दिन का समय दीजिये. फिर सब कुछ बता दूंगा. यह बाहरी साजिश का परिणाम है.' उन्होंने कहा ,‘मैं बहुत दुखी हूं. मैं इसकी जिम्मेदारी लेता हूं' पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. और जानें इलेक्शन शेड्यूल NDTV India पर. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-11-10 18:10:14","image_url":"https://c.ndtvimg.com/2023-07/e23q1mko_srilanka_120x90_02_July_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"82f1b8db72fe81a7bc890d08063d2efa","title":"Left-Arm Spin, Short-Pitched Bowling: How Kohli Practiced Ahead Of WC Game","link":"https://sports.ndtv.com/cricket/left-arm-spin-short-pitched-bowling-how-virat-kohli-practiced-ahead-of-cricket-world-cup-2023-game-4565195","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli's net sessions are often an intense, well-calculated drill, a compressed version of his real-game batting.","content":"Virat Kohli's net sessions are often an intense, well-calculated drill, a compressed version of his real-game batting. India's optional nets in Bengaluru on Friday was an encore as Kohli meticulously went about polishing his skills against short-pitched bowling and left-arm spin that he will need to negate potentially against New Zealand in the World Cup semifinals. The Kiwis are primed for a last four match against India at Mumbai on November 15 on the back of 10 points and a superior run-rate than their closest contender Pakistan. The immediate goal in front of Kohli might be disposing of Netherlands, but with due respect the Dutch are not yet in the New Zealand class. One of the challenges the Black Caps will pose to Kohli will be through Lockie Ferguson. The express pacer is yet to fire like he did in the 2019 World Cup, partially because of a right Achilles niggle. But Ferguson showed signs of hitting the peak against Sri Lanka at the Chinnaswamy Stadium rattling the Lankan middle and late order with a barrage of short-pitched balls. He even pinged Maheesh Theekshana on his hands, leaving the batsman writhing in pain for a few minutes. Ferguson is quite certain to repeat the tactics against India too if the meeting materializes. Kohli owns one of the better pulls in contemporary cricket and rarely get rattled by the body line but true to his character, the former Indian captain did not leave anything to chance. Pacer Shardul Thakur and the side-arm specialists bowled an array of bouncers at Kohli and he had little difficulty in smoking several of them away, some shots travelling as far as the second tier. The 35-year-old also attempted a couple of ramp shots, which might prove handy against a bowler like Ferguson who can hit north of 150 kmph. The second testing point for Kohli might come in the form of Mitchell Santner's left-arm spin. It is no secret that the Indian star does not boast of a fine record against that type, often getting in tangles. Advertisement In the past, left-armers like Keshav Maharaj, Shakib Al Hasan and Dunith Wellalage had success against Kohli. Santner has been New Zealand's best bowler on view here, consistently hitting the right length to keep the batters' largely silent. It has reflected in his numbers too in the event – 16 wickets from nine matches with a fine economy of 4.6 to boot. It is highly likely that Kohli will face Santner in the middle-overs against whom he averages just 9.33 across 17 matches while getting dismissed three times. Even if one takes recent numbers, Kohli's struggle against left-arm spinners is quite evident. Since January 2021, Kohli averages just over 13 against them and strike-rate dwindles to 66. So, it was no real surprise to see Kohli perfecting his craft against left-arm spin while facing Ravindra Jadeja at nets, who also managed to elicit a couple of false shots from the Delhiite. However, it was clear that Kohli has already measured in his mind the possible danger areas that he might have to traverse on the big day. Ishan Kishan stays away It was an optional session but all the Indian players except Ishan Kishan attended the nets. In a novelty, pacer Jasprit Bumrah tried his hand in a bit of spin while head coach Rahul Dravid doubled up as a side-arm thrower.","pubDate":"2023-11-10 17:44:28","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"09e233bc7ee7d2ee761ad8b6a92ac0e1","title":"ICC suspends Sri Lanka over gov’t interference","link":"https://thefrontierpost.com/icc-suspends-sri-lanka-over-govt-interference/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"NEW DELHI (Agencies): The International Cricket Council (ICC) has suspended Sri Lanka with immediate effect after “government interference” in the running of the sport in the country. On Monday, the country’s sports minister announced the that the entire that the entirety of the cricket board had been sacked. The minister installed an interim committee led […]","content":"NEW DELHI (Agencies): The International Cricket Council (ICC) has suspended Sri Lanka with immediate effect after “government interference” in the running of the sport in the country. On Monday, the country’s sports minister announced the that the entire that the entirety of the cricket board had been sacked. The minister installed an interim committee led by former captain Arjuna Ranatunga but otherwise lacking in cricketing experience that included the sons of two politicians. However that inteim committee was subsequently struck down by the courts, with the old Sri Lanka Cricket (SLC) board reinstated. The changes came after a difficult Cricket World Cup that leaves Sri Lanka likely to miss out on qualification for the 2025 Champions Trophy. And while the conditions of their suspension are still to be decided, the news from the ICC comes as another significant blow to cricket in the country. “The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership of the ICC with immediate effect,” the ICC said in a statement. “The ICC Board met today and determined that Sri Lanka Cricket is in serious breach of its obligations as a Member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka. “The conditions of the suspension will be decided by the ICC Board in due course.” Sri Lanka, who are led by former England seamer and coach Chris Silverwood, won just two of their nine World Cup group games. They had reached the final of the 2023 Asia Cup ahead of the tournament, but were thrashed by India after being bowled out for 50. Silverwood’s side fared little better against the hosts during the World Cup, registering 55 all out in response to India’s total of 357-8. Sri Lanka are currently ninth in the standings, with only the top eight finishers qualifying for the Champions Trophy in two years’ time. They are level on points with England, Bangladesh and the Netherlands, who all have one more match to play. The city of Colombo, meanwhile, is due to host the men’s U19 Cricket World Cup in January and February of next year.","pubDate":"2023-11-10 17:29:41","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"f46a37be6466accb3af2c475219f4e7b","title":"ICC suspends Sri Lanka’s membership with immediate effect due to government interference","link":"https://sambadenglish.com/icc-suspends-sri-lankas-membership-with-immediate-effect-due-to-government-interference/","keywords":["SPORTS"],"creator":["Sambad English Bureau"],"video_url":null,"description":"NEW DELHI: The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership with immediate effect due to government interference in administration, which had been in tumultuous waters for the last week. It added that the conditions of the suspension will be decided by the ICC Board in due course. The huge development comes just […] The post ICC suspends Sri Lanka’s membership with immediate effect due to government interference first appeared on Sambad English.","content":"The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership with immediate effect due to government interference in administration, which had been in tumultuous waters for the last week. It added that the conditions of the suspension will be decided by the ICC Board in due course. The huge development comes just a day after Sri Lanka’s campaign in the 2023 Men’s ODI World Cup in India came to an end with a five-wicket defeat to New Zealand in Bengaluru. In the tournament, Sri Lanka won two while losing seven games to end their campaign in ninth place, with its qualification for the 2025 Champions Trophy in jeopardy as they are out of the top eight teams in the points table. In the meeting held on Friday, the ICC said in a statement its Board “determined that Sri Lanka Cricket is in serious breach of its obligations as a Member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka.” Incidentally, on the day Sri Lanka’s campaign in the Men’s ODI World Cup came to an end, its parliament unanimously passed a resolution, calling for the sacking of the SLC Board. The resolution in the parliament was supported by both the ruling and opposition parties. The parliament resolution came two days after the Court of Appeal restored the SLC management headed by Shammi Silva on Tuesday, which had been sacked by Sports Minister Roshan Ranasinghe. Ranasinghe had appointed former Sri Lanka cricketer and 1996 World Cup-winning captain Arjuna Ranatunga as head of a seven-member interim committee to govern the cricketing affairs in the country in place of the SLC management. There had been a public outcry in the country after Sri Lanka suffered a mammoth 302-run loss to India at the Wankhede Stadium in Mumbai on November 2, with many demanding the sacking of the SLC board led by Silva, who was elected to the chairman post in May this year. SLC is the second full member to have its membership suspended by ICC in the last few years after Zimbabwe Cricket was suspended in 2019 for government interference. It remains to be seen what conditions ICC imposes in terms of SLC suspension and the effect it can have on cricketing activities in the country, considering that Sri Lanka are also the host of the 2024 Men’s U19 Cricket World Cup to be held in January next year.","pubDate":"2023-11-10 17:28:12","image_url":null,"source_id":"sambadenglish","source_priority":332200,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"e27acb0bdae41443b1064e04462a0304","title":"South Africa complete nervy win over Afghanistan","link":"https://www.bbc.co.uk/sport/av/cricket/67379686","keywords":null,"creator":null,"video_url":null,"description":"Watch highlights as Rassie van der Dussen hits an unbeaten 76 to seal South Africa's nervy five-wicket win over Afghanistan to secure them a place in the semi-finals of the Cricket World Cup.","content":null,"pubDate":"2023-11-10 17:08:21","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"3ae51770782b956b24c6d1c5ef017778","title":"Van der Dussen guides South Africa past Afghanistan","link":"https://www.bbc.co.uk/sport/cricket/67377932","keywords":null,"creator":null,"video_url":null,"description":"Rassie van der Dussen hits an unbeaten 76 to take South Africa to a nervy five-wicket win over Afghanistan.","content":"ICC Cricket World Cup: Rassie van der Dussen leads South Africa's victory over Afghanistan ICC Men's World Cup, Ahmedabad Afghanistan 244 (50 overs): Azmatullah 97* (107); Coetzee 4-44, Maharaj 2-25 South Africa 247-5 (47.3 overs): Van der Dussen 76* (95), De Kock 41 (47); Nabi 2-35 South Africa won by five wickets Scorecard . Table . Rassie van der Dussen hit an unbeaten 76 to take South Africa to a tense five-wicket win over Afghanistan in their final World Cup group game. Gerald Coetzee took 4-44 as the Proteas bowled Afghanistan out for 244 after Azmatullah Omarzai made an unbeaten 97 to rescue the innings from 116-6. South Africa made hard work of the chase but held their nerve to get over the line in the 48th over. Defeat officially ended Afghanistan's chances of making the top four. World Cup 2023: Table, run-scorers & wicket-takers Jonathan Trott's side needed to win by a highly improbable 438 runs to overhaul New Zealand on net run rate and stay in contention to reach the knockout stages but, after opting to bat first, lost wickets in clusters. After a steady start, they lost three wickets for four runs to slip from 41-0 to 45-3 and then another mini collapse saw them lose three wickets in four overs midway through the innings. However, Azmatullah held Afghanistan together with a well-paced knock, biding his time before accelerating late on, but three dot balls to end the innings left him three shy of a maiden international century. In reply, South Africa, who have dominated sides when batting first but struggled chasing, started well with openers Quinton de Kock and Temba Bavuma putting on 61. They fell in quick succession but Van der Dussen and Aiden Markram continued the momentum with a 60-run stand. But every time the Proteas appeared to be cruising, Afghanistan took a wicket to drag them back and when David Miller was dismissed with 62 still needed, the game was in the balance. Van der Dussen and Andile Phehlukwayo remained composed, though, and having whittled down the runs required, they finished it in a hurry with the latter going six, four, six to seal the win. With a number of players struggling with slight injuries - most notably Bavuma and Lungi Ngidi -throughout the game, South Africa now have a few days to rest and recover before their semi-final against Australia. Afghanistan out after tournament to remember After losing to Bangladesh in their first game, not much was expected of Afghanistan at this World Cup. For all the talent in their team and the way they had shown themselves capable of competing with the top sides in white-ball cricket, they had yet to do it on the big stage with their only 50-over World Cup win coming against Scotland in 2015. A month later and they have beaten three former champions in England, Pakistan and Sri Lanka - all in convincing fashion - and comfortably seen off the Netherlands as well. But for one of the great one-day innings of all-time , they would surely have added Australia to that list and come into this match knowing a win would put them into the semi-finals. That dream has eluded them this time but any notion of Afghanistan being minnows of world cricket has long since been banished. The confidence gained from their accomplishments in India should serve them well and with an ICC tournament each year for the foreseeable future, they will have plenty more chances to make history. 'Part of me is dreaming' - what they said South Africa captain Temba Bavuma: \"My leg is sore. I don't know the extent of it yet but I'll have to be fine. I am stubborn, it will have to be fine. \"Part of me is dreaming. We want to be back here [in the final]. But Australia are a big hurdle for us to overcome. We will enjoy today, take the learnings and then get our minds set on that game.\" Afghanistan captain Hashmatullah Shahidi: \"We gave a good message to the world in this tournament. We played big teams and we fought. The Australia game was in our hands, it was a shock that defeat. There was a lot of learning.\" Player of the Match, South Africa's Rassie van der Dussen: \"Someone always has to play the anchor role in a chase and I was happy to do that. The platform I had from Temba and Quinton made my job a lot easier, too. \"We do so well batting first and that makes people think we chase badly. We would like to improve our chasing, yes, and I think being in that situation tonight will hold us in good stead.\"","pubDate":"2023-11-10 16:58:48","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"aec6eed00a783c4eb1db0df3fbf512c1","title":"Sri Lanka Cricket suspended over government interference","link":"https://www.bbc.co.uk/sport/cricket/67384199","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket are suspended by the International Cricket Council (ICC) because of government interference.","content":"Sri Lanka were beaten by New Zealand in their final World Cup match on Thursday Sri Lanka have been suspended by the International Cricket Council (ICC) because of government interference. Sri Lanka's ministry of sport sacked the national board (SLC) amid the team's poor World Cup, although the decision was reversed by a court. The ICC board determined \"Sri Lanka is in serious breach of its obligations as a member\". The terms of the suspension, including any potential ramifications, will be decided at the next ICC board meeting. The ICC said Sri Lanka had broken \"the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration\". Sri Lanka have won just two of their nine games at the World Cup so far, leaving them ninth in the table. They are coached by former England coach Chris Silverwood. Last week sports minister Roshan Ranasinghe described the SLC as \"traitorous and corrupt\" in a statement to parliament and called for board members to resign. Secretary Mohan de Silva quit and the board was sacked. Ranasinghe replaced them with an interim committee chaired by World Cup-winning captain Arjuna Ranatunga, although a petition against the dismissal was granted a two-week stay order by a court this week. SLC also issued a statement on allegations made by Ranasinghe about supposed financial irregularities. The ICC suspension comes a day after Sri Lanka's last game at the World Cup in India - a defeat by New Zealand on Thursday. England are due to host Sri Lanka for a three-Test series next summer while Sri Lanka are also due to host the Under-19 men's World Cup in January and February next year. Afghanistan have not been banned by the ICC despite the Taliban banning women from playing sports, resulting in their women's team being unable to compete. BBC Sport understands this is because the ICC sees there to be no government interference in Afghanistan. Speaking to the BBC's Stumped podcast on Thursday, ICC chief executive Geoff Allardice said: \"We have spoken with the Afghanistan Cricket Board and the position is that they have to operate within the laws of the country and the rules are set by the government. \"Really the question for the ICC board is, do we support our member in their ability to promote cricket within the rules set by the government of the country? And the view is yes.\" Listen to full Stumped interview with Geoff Allardice","pubDate":"2023-11-10 16:50:33","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"45302ac3069bdfa715dccd2ed0975fe1","title":"Rassie van der Dussen stars as Proteas knock Afghanistan out of Cricket World Cup","link":"https://www.iol.co.za/sport/cricket/proteas/rassie-van-der-dussen-stars-as-proteas-knock-afghanistan-out-of-cricket-world-cup-d6471885-d7b7-4092-a47a-b291bfc01abd","keywords":null,"creator":["AFP"],"video_url":null,"description":"South Africa beat Afghanistan by five wickets to win their last World Cup group game on Friday as the Asian side were eliminated from the semi-final race.","content":"Ok, well not in quite that macho tone, for South Africa may have completed a rare successful run-chase to close off their Cricket World Cup league phase on a positive note, but they will certainly have to play much better in next Thursday’s semi-final against their arch-rivals at Eden Gardens if they are to progress to a first-ever final. With the comfort of already having secured a semi-final place, the Proteas lacked intensity from the outset. They were also comfortable enough to give Marco Jansen a much-needed break that afforded Andile Phehlukwayo his first run out at this World Cup. Ultimately, it proved to work out just fine with Phehlukwayo (39 not out) carving out a match-winning 65-run partnership with anchorman Rassie van der Dussen (76 not out off 95 balls) to take South Africa home by five wickets with 15 balls to spare. The margin of victory may seem comfortable, but it certainly was not for large chunks of the run-chase with South Africa’s ability to put themselves under pressure rising to the surface once again. Quinton de Kock and captain Temba Bavuma , who was hampered by a hamstring injury throughout the game and is now a potential doubtful starter for the Australian semi-final, seemed to get everything underway with relative ease in their 64-run opening partnership. But once Bavuma (23) and De Kock (41) fell in quick succession, it opened the door for Afghanistan superstar Rashid Khan (2/37) to create his customary chaos in the middle-order. And when Rashid removed arguably South Africa’s best players of spin in Aiden Markram and Heinrich Klaasen within a few overs of each other, the cat was well and truly among the pigeons. All the bad memories of failed chases resurfaced, with former England and Australian captains Nasser Hussein and Aaron Finch turning up the intensity on commentary and fueling the drama, which only intensified when David Miller meekly surrendered to a Mohammed Nabi (2/35) caught and bowled chance. Throughout all this histrionics, Van der Dussen remained ice cool at the non-striker’s end, staying in his bubble, and content to do the hard graft before breaking the shackles with the odd boundary in between. He played a visible role in comforting Phehlukwayo, who had not batted out in the middle since the last ODI against Australia back in South Africa at the Wanderers prior to the World Cup almost two months ago. Phehlukwayo’s rustiness was visible, but settled the longer he stayed at the crease, before finishing the game in a flourish with a six, four and six off Naveen-ul-Haq to end unbeaten on 39. Proteas coach Rob Walter will certainly be pleased that his team eventually crossed the line with the bat, but the inability to close out the opposition’s innings remains a cause for concern. South Africa had once again reduced the Afghans to 160/7, but then allowed them to score a further 84 runs for the three remaining wickets with Azmatullah Omarzai striking a defiant 97 not out. It did seem that South Africa had shifted their attention to the semi-final already at that stage with the seamers, and Lungi Ngidi in particular, adopting a strategy of trying to bowl wide yorkers. If that was indeed the case, then plenty of work still needs to be done in the nets this week too leading up the semi-final, with South Africa conceding 10 wides in the process and Ngidi delivering three in succession in the penultimate over. Only Gerald Coetzee seemed to have brought any energy and passion with him to the Narendra Modi Stadium yesterday as he finished with 4/44 to surpass Jansen as South Africa’s leading wicket-taker in the tournament. “Today we did a few things differently. We batted second today. To get over the line in that manner, that is going to give us a lot of confidence. Fantastic knock by Rassie, he took ownership and the guys batted around him,” Bavuma said. “Not really (concerned about the opposition’s lower order runs). The wicket got better. When Keshav came back for his second spell, it was not gripping and spinning as much. Gerald also came in and took wickets, always a huge plus. We can always pick on the different phases and we can think of things to improve, but we will take the win. The skipper also provided an update on his injury. “Obviously my leg is sore. Don't know to what extent but it is going to have to be fine, at least in my eyes. I obviously had that option of coming off but it was our last group stage game, and I wanted to be out there with the guys. Was an opportunity to spend some time in the middle and I did not want to let it go. Wanted to keep marshalling the guys, and keep strengthening the relationship with our bowlers. It was a risk but I felt it was the right move (to stay on). Winning is a habit, so we want to take that momentum through,” he said. Scorecard Afghanistan: 244 all out (Azmatullah Omarzai 97*, Coetzee 4/44, Maharaj 2/25) South Africa: 247/5 (Van der Dussen 76*, De Kock 41, Phehlukwayo 39*, Rashid Khan 2/37, Nabi 2/35) South Africa won by five wickets IOL Sport","pubDate":"2023-11-10 16:50:14","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/e9e81872-e80b-55d5-9ab3-ac18c83ea028&operation=CROP&offset=0x59&resize=2507x1409","source_id":"iol","source_priority":32046,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"24a95c869def2c216897c2f319f5452b","title":"World Cup: Van der Dussen guides South Africa to five-wicket win over Afghanistan","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/10/world-cup-van-der-dussen-guides-south-africa-to-five-wicket-win-over-afghanistan-2631892.html","keywords":null,"creator":null,"video_url":null,"description":"Chasing 245 for victory, the Proteas, who had already qualified for the semifinals, completed the task in 47.3 overs. AHMEDABAD: The calmness of Rassie van der Dussen and fire of Gerald Coetzee helped experienced South Africa overcame spirited resistance from Afghanistan to carve out a five-wicket win in their last league game of the World Cup here on Friday. Set a target of 245, South Africa, who are already assured of a place in semifinals, completed the task with Van der Dussen remaining unbeaten on 76 off 95 balls. Andile Phehlukwayo was unbeaten on a 37-ball 39 after a match-winning partnership of 65 runs with Van der Dussen. Earlier, pacer Coetzee took four wickets as Afghanistan were limited to 244 despite Azmatullah Omarzai's impressive 97. Omarzai's knock, however, helped the Afghans to recover from 116 for six. The defeat notwithstanding, Afghanistan, who shocked defending champions England and Pakistan during a very promising campaign, would go home with their heads held high. Continuing his good run in the tournament, Omarzai faced 107 balls while hitting seven fours and three sixes. However, he could not record his maiden ODI hundred after failing to score off the last three balls of the final over bowled by Kagiso Rabada. On a pitch without any demons, South Africa started their chase confidently. But, as the match progressed, things didn't pan out the way South Africa would have liked them to. In the end, they achieved it with 15 balls remaining after a mighty scrap. The in-form Quinton de Kock (41 off 47 balls) made his intentions clear quite early with a four and a six off Mujeeb Ur Rahman, dancing down the track to pummel the seasoned bowler over mid-off. The dashing left-handed batter, who went past Rachin Ravindra to become the leading scorer of this tournament, then pulled a Naveen-ul-Haq half-tracker over deep square leg for a maximum. De Kock, however, could not go on to make a big one as he was adjudged trapped in front of the wicket by Mohammad Nabi, who chose to review after failing to convince the on-field umpire. Looking to play a reverse sweep, De Kock missed and the ball hit the pads, prompting Nabi to go for a loud appeal. Afghanistan's move to review the decision was vindicated when the ball tracking showed that it was going to hit the leg stump. De Kock, who had earlier in the day joined the likes of Adam Gilchrist and Sarfaraz Khan by taking six catches, struck two fours and three sixes. Meanwhile, skipper Temba Bavuma's (23 off 28) poor run continued as he was shown the door by Mujeeb, who had the batter in all sorts of trouble with a back of a length delivery that hurried onto him. Bavuma, who looked like he was struggling while fielding, seemed to battle cramps after he had come out to bat with an intention to spend some time in the middle following an underwhelming sequence of scores. Aiden Markram (25 off 32) also gave his wicket away after getting a start while Heinrich Klaasen was dismissed by the wily Rashid Khan, a well-deserved reward for some excellent bowling, as South Africa slipped to 139 for four in the 28th over. A 43-run partnership ensued before Nabi had David Miller (24 off 33) in a rather soft dismissal, leaving Van der Dussen to complete the job. Earlier, Afghanistan were off to a steady start after their skipper Hashmatullah Shahidi opted to bat first, but South Africa meant business as they snared three wickets for four runs to leave their opponents in a spot of bother at 45 for three in the 11th over. At that point, it seemed like the decision to bat first was backfiring even as Bavuma marshalled his resources well to keep South Africa ahead in the game. But even before the Proteas could celebrate the first breakthrough they faced an anxious moment when pacer Lungi Ngidi went off the field after suffering what looked like an ankle or achilles issue. Ngidi, however, returned to pick the wickets of Rahmat Shah and Nabi, who nicked one to De Kock after facing just three balls, leaving his team at 116 for six in the 28th over. Having smoked lead pacer Rabada's length ball outside off for a six over long-on, Rahmanullah Gurbaz (25) found the fence again when he produced a lovely cover driver against the same bowler. Desperately looking for a breakthrough, Bavuma introduced Keshav Maharaj into the attack and the left-arm spinner straightaway responded with the big wicket of Gurbaz, who edged a turning delivery to Klaasen at first slip. Not only did Maharaj strike with his first ball he also enjoyed a wicket-maiden, giving South Africa a bit of a momentum which they used to their advantage by quickly grabbing two more wickets. Much was expected of Ibrahim Zadran, who scored a brilliant hundred against Australia in their last game, but the opener was done in by a short ball from Coetzee. Omarzai, however, continued to fight it out.","content":"AHMEDABAD: The calmness of Rassie van der Dussen and fire of Gerald Coetzee helped experienced South Africa overcame spirited resistance from Afghanistan to carve out a five-wicket win in their last league game of the World Cup here on Friday. Set a target of 245, South Africa, who are already assured of a place in semifinals, completed the task with Van der Dussen remaining unbeaten on 76 off 95 balls. Andile Phehlukwayo was unbeaten on a 37-ball 39 after a match-winning partnership of 65 runs with Van der Dussen. Earlier, pacer Coetzee took four wickets as Afghanistan were limited to 244 despite Azmatullah Omarzai's impressive 97. Omarzai's knock, however, helped the Afghans to recover from 116 for six. The defeat notwithstanding, Afghanistan, who shocked defending champions England and Pakistan during a very promising campaign, would go home with their heads held high. Continuing his good run in the tournament, Omarzai faced 107 balls while hitting seven fours and three sixes. However, he could not record his maiden ODI hundred after failing to score off the last three balls of the final over bowled by Kagiso Rabada. On a pitch without any demons, South Africa started their chase confidently. But, as the match progressed, things didn't pan out the way South Africa would have liked them to. In the end, they achieved it with 15 balls remaining after a mighty scrap. The in-form Quinton de Kock (41 off 47 balls) made his intentions clear quite early with a four and a six off Mujeeb Ur Rahman, dancing down the track to pummel the seasoned bowler over mid-off. The dashing left-handed batter, who went past Rachin Ravindra to become the leading scorer of this tournament, then pulled a Naveen-ul-Haq half-tracker over deep square leg for a maximum. De Kock, however, could not go on to make a big one as he was adjudged trapped in front of the wicket by Mohammad Nabi, who chose to review after failing to convince the on-field umpire. Looking to play a reverse sweep, De Kock missed and the ball hit the pads, prompting Nabi to go for a loud appeal. Afghanistan's move to review the decision was vindicated when the ball tracking showed that it was going to hit the leg stump. De Kock, who had earlier in the day joined the likes of Adam Gilchrist and Sarfaraz Khan by taking six catches, struck two fours and three sixes. Meanwhile, skipper Temba Bavuma's (23 off 28) poor run continued as he was shown the door by Mujeeb, who had the batter in all sorts of trouble with a back of a length delivery that hurried onto him. Bavuma, who looked like he was struggling while fielding, seemed to battle cramps after he had come out to bat with an intention to spend some time in the middle following an underwhelming sequence of scores. Aiden Markram (25 off 32) also gave his wicket away after getting a start while Heinrich Klaasen was dismissed by the wily Rashid Khan, a well-deserved reward for some excellent bowling, as South Africa slipped to 139 for four in the 28th over. A 43-run partnership ensued before Nabi had David Miller (24 off 33) in a rather soft dismissal, leaving Van der Dussen to complete the job. Earlier, Afghanistan were off to a steady start after their skipper Hashmatullah Shahidi opted to bat first, but South Africa meant business as they snared three wickets for four runs to leave their opponents in a spot of bother at 45 for three in the 11th over. At that point, it seemed like the decision to bat first was backfiring even as Bavuma marshalled his resources well to keep South Africa ahead in the game. But even before the Proteas could celebrate the first breakthrough they faced an anxious moment when pacer Lungi Ngidi went off the field after suffering what looked like an ankle or achilles issue. Ngidi, however, returned to pick the wickets of Rahmat Shah and Nabi, who nicked one to De Kock after facing just three balls, leaving his team at 116 for six in the 28th over. Having smoked lead pacer Rabada's length ball outside off for a six over long-on, Rahmanullah Gurbaz (25) found the fence again when he produced a lovely cover driver against the same bowler. Desperately looking for a breakthrough, Bavuma introduced Keshav Maharaj into the attack and the left-arm spinner straightaway responded with the big wicket of Gurbaz, who edged a turning delivery to Klaasen at first slip. Not only did Maharaj strike with his first ball he also enjoyed a wicket-maiden, giving South Africa a bit of a momentum which they used to their advantage by quickly grabbing two more wickets. Much was expected of Ibrahim Zadran, who scored a brilliant hundred against Australia in their last game, but the opener was done in by a short ball from Coetzee. Omarzai, however, continued to fight it out.","pubDate":"2023-11-10 16:42:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2c155f9a11e8404a86e8ed735956b9fe","title":"د کرکټ نړیوالې شورا د سري لانکا غړیتوب وځنډاوه","link":"https://www.pashtovoa.com/a/icc-suspends-cricket-sri-lanka-over-political-meddling/7350245.html","keywords":["لوبې","نور خبرونه","د کرکټ ۲۰۲۳ نړیوال جام"],"creator":null,"video_url":null,"description":"د کرکټ نړیوالې شورا (ای سي سي)د جمعې په ورځ نومبر ۱۰ (لړم ۱۹) وویل چې د سري لانکا د کرکټ بورډ په چارو کې د حکومت د مداخلې له کبله یې په شورا کې ددغه هېواد شمولیت ځنډولی دی.","content":"د کرکټ نړیوالې شورا (ای سي سي)د جمعې په ورځ نومبر ۱۰ (لړم ۱۹) وویل چې د سري لانکا د کرکټ بورډ په چارو کې د حکومت د مداخلې له کبله یې په شورا کې ددغه هېواد شمولیت ځنډولی دی. د کرکټ دغې نړیوالې انتظامي ادارې ویلي چې د سري لانکا کرکټ د دې شورا \"د غړي په توګه له خپلو مکلفیتونو څخه په جدي توګه سرغړونه کړې، په ځانګړې توګه د دې اړتیا چې په خپلواکه توګه خپلې چارې اداره کړي او ډاډ ترلاسه کړي چې حکومت یې په چارو کې مداخله نه کوي.\" په ای سي سي کې د سري لانکا غړیتوب یوه ورځ وروسته له هغه وځنډول شو چې د سري لانکا پارلمان د مالي فساد د تورونو له امله د سري لانکا کرکټ بورډ له غړو څخه د استعفا غوښتنه وکړه. د ای سي سي په اعلامیه کې ویل شوي چې شورا به د سري لانکا د غړیتوب د ځنډولو د شرایطو او جزیاتو په اړه وروسته پرېکړه وکړي. ټاکل شوې ده چې د ۱۹ کلنو د کرکټ نړیوال جام راتلونکې جنوري په سري لانکا کې ترسره شي. په سمدستي توګه نه ده معلومه چې په ای سي سي کې تر نامعلوم وخت پورې د سري لانکا د غړیتوب ځنډېدل به پر دغو لوبو څه اغېزه وکړي. د مالي او سیاسي کړکیچ سره د لاس او ګریوال سري لانکا حکومت له وړاندې دیوالي شوی او کرکټ بورډ په دغه جزیره يي هېواد کې تر ټولو شتمنه اداره ګڼل کیږي. په نړیوال جام کې د سري لانکا د سختو ماتو وروستو، د حکومت او کرکټ بورډ تر منځ کړکیچ لا پراخ شو. د سري لانکا پارلمان د پنجشنبې په ورځ د سريلانکا د کرکټ بورډ له منتخبو غړو د استعفا غوښتنه وکړه او هغوی یې د میلیونونو ډالرو په فساد تورن کړل. ددغه هېواد کرکټ بورډ تر اوسه د پارلمان دغې غوښتنې ته ځواب نه دی ویلی. د سري لانکا د حکومت د اپوزیسیون مشر ساجیت پریماداسا وویل دا اقدام یې \"یوه تاریخي پریکړه وه او نړۍ ته دا پیغام ورکوي چې د سري لانکا قانون جوړونکي د کرکټ د دفاع او د لوبې د بشپړتیا دپاره متحده شوي دي.\" د سري لانکا د سپورت وزیر د دوشنبې په ورځ د دغه هېواد کرکټ بورډ لغوه اعلان کړ خو یوه ورځ وروسته د استیناف محکمې د بورډ د دوباره فعالیت پرېکړه وکړه او ټاکل شوې ده چې په راتلونکو دوو اونیو کې د موضوع په اړه محکمه بله استماعیه غونډه وکړي. د ای سي سي قوانین د کرکټ بورډ په چارو کې د حکومت د لاس وهنې مخنیوی کوي او له دې وړاندې یې هم د سري لانکا غړیتوب ځنډولی دی.","pubDate":"2023-11-10 20:21:51","image_url":"https://gdb.voanews.com/6153ccba-8c10-46cb-a91d-ac781c0b2421_cx0_cy10_cw0_w800_h450.jpg","source_id":"pashtovoa","source_priority":601967,"country":["afghanistan"],"category":["sports"],"language":"pashto"},{"article_id":"7ab51f87056cf0ba3d34fe02c5533889","title":"श्रीलंका क्रिकेट को बड़ा झटका, ICC ने तत्काल प्रभाव से सदस्यता भंग की, इस बड़ी वजह से मिली सजा","link":"https://sports.ndtv.com/hindi/cricket/icc-has-suspended-sri-lanka-cricket-s-membership-with-immediate-effect-4565151#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"World Cup 2023 में खराब प्रदर्शन के बीच श्रीलंका क्रिकेट को लगातार झटके पर झटके लग रहे हैं","content":"श्रीलंका क्रिकेट के लिए एक के बाद एक बुरी खबर आ रही है मानो जारी में खराब प्रदर्शन अपने आप में काफी था. इस प्रदर्शन के बाद क्रिकेट में मची हलचल के बाद उसे एक और बड़ा झटका लगा है. अंतरराष्ट्रीय क्रिकेट काउंसिल (ICC) ने तत्काल प्रभाव से उसकी सदस्यता को निलंबित कर दिया है. ICC बोर्ड की आज बैठक हुई और इसी मीटिंग में क्रिकेट श्रीलंका को आईसीसी की सदस्यता से निलंबित करने का फैसला लिया गया. बतौर सदस्य श्रीलंका पर नियमों के उल्लंघन के गंभीर आरोप लगाए गए हैं. इसमें बोर्ड के मामलों को स्वायत्तापूर्ण तरीकों से चलाना और यह सुनिश्चित करना है कि बोर्ड की कार्यप्रणाली, संचालन या क्रिकेट प्रशासन में सरकार की दखलअंदाजी न हो. श्रीलंका की संसद ने दरअसल वीरवार को को देश की क्रिकेट संचालन संस्था को बर्खास्त करने के लिए सर्वसम्मति से एक प्रस्ताव पारित किया किया था. और इसे सत्ता पक्ष और विपक्षी दलों का पूरा समर्थन मिला था. मुख्य विपक्ष पार्टी के नेता साजिथ प्रेमदासा ने संसद में ‘भ्रष्ट श्रीलंका क्रिकेट (एसएलसी) प्रबंधन को हटाने' के शीर्षक का प्रस्ताव पेश किया जिसका सरकार के सीनियर मंत्री निमल सिरिपाला डिसिल्वा ने पूरा समर्थन किया. वहीं दो दिन पहले अपील अदालत ने मंगलवार को शम्मी सिल्वा की अध्यक्षता वाले श्रीलंका क्रिकेट प्रबंधन को बहाल किया था, लेकिन इसके बावजूद श्रीलंका सरकार ने क्रिकेट बोर्ड को बर्खास्त कर दिया. और आईसीसी को सरकार का यह फैसला पसंद नहीं आया, जो कि पैतृक संस्था के नियमों के खिलाफ है. आईसीसी बोर्ड द्वारा निलंबन की शर्तों पर आने वाले समय पर फैसला किया जाएगा. इसी बीच मुख्य चयनकर्ता प्रमोदया विक्रमसिंघे ने शुक्रवार को आरोप लगाया कि विश्व कप में श्रीलंका के खराब प्रदर्शन के पीछे बाहरी साजिश है. श्रीलंकाई क्रिकेट टीम शुक्रवार की सुबह भारत से लौट आईय उसे बेंगलुरू में आखिरी ग्रुप मैच में न्यूजीलैंड ने पांच विकेट से हराया. खराब प्रदर्शन के कारणों के बारे में पूछे जाने पर विक्रमसिंघा ने कहा, ‘मुझे दो दिन का समय दीजिये. फिर सब कुछ बता दूंगा. यह बाहरी साजिश का परिणाम है.' उन्होंने कहा ,‘मैं बहुत दुखी हूं. मैं इसकी जिम्मेदारी लेता हूं' पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. और जानें इलेक्शन शेड्यूल NDTV India पर. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-11-10 18:10:14","image_url":"https://c.ndtvimg.com/2023-07/e23q1mko_srilanka_120x90_02_July_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"82f1b8db72fe81a7bc890d08063d2efa","title":"Left-Arm Spin, Short-Pitched Bowling: How Kohli Practiced Ahead Of WC Game","link":"https://sports.ndtv.com/cricket/left-arm-spin-short-pitched-bowling-how-virat-kohli-practiced-ahead-of-cricket-world-cup-2023-game-4565195","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli's net sessions are often an intense, well-calculated drill, a compressed version of his real-game batting.","content":"Virat Kohli's net sessions are often an intense, well-calculated drill, a compressed version of his real-game batting. India's optional nets in Bengaluru on Friday was an encore as Kohli meticulously went about polishing his skills against short-pitched bowling and left-arm spin that he will need to negate potentially against New Zealand in the World Cup semifinals. The Kiwis are primed for a last four match against India at Mumbai on November 15 on the back of 10 points and a superior run-rate than their closest contender Pakistan. The immediate goal in front of Kohli might be disposing of Netherlands, but with due respect the Dutch are not yet in the New Zealand class. One of the challenges the Black Caps will pose to Kohli will be through Lockie Ferguson. The express pacer is yet to fire like he did in the 2019 World Cup, partially because of a right Achilles niggle. But Ferguson showed signs of hitting the peak against Sri Lanka at the Chinnaswamy Stadium rattling the Lankan middle and late order with a barrage of short-pitched balls. He even pinged Maheesh Theekshana on his hands, leaving the batsman writhing in pain for a few minutes. Ferguson is quite certain to repeat the tactics against India too if the meeting materializes. Kohli owns one of the better pulls in contemporary cricket and rarely get rattled by the body line but true to his character, the former Indian captain did not leave anything to chance. Pacer Shardul Thakur and the side-arm specialists bowled an array of bouncers at Kohli and he had little difficulty in smoking several of them away, some shots travelling as far as the second tier. The 35-year-old also attempted a couple of ramp shots, which might prove handy against a bowler like Ferguson who can hit north of 150 kmph. The second testing point for Kohli might come in the form of Mitchell Santner's left-arm spin. It is no secret that the Indian star does not boast of a fine record against that type, often getting in tangles. Advertisement In the past, left-armers like Keshav Maharaj, Shakib Al Hasan and Dunith Wellalage had success against Kohli. Santner has been New Zealand's best bowler on view here, consistently hitting the right length to keep the batters' largely silent. It has reflected in his numbers too in the event – 16 wickets from nine matches with a fine economy of 4.6 to boot. It is highly likely that Kohli will face Santner in the middle-overs against whom he averages just 9.33 across 17 matches while getting dismissed three times. Even if one takes recent numbers, Kohli's struggle against left-arm spinners is quite evident. Since January 2021, Kohli averages just over 13 against them and strike-rate dwindles to 66. So, it was no real surprise to see Kohli perfecting his craft against left-arm spin while facing Ravindra Jadeja at nets, who also managed to elicit a couple of false shots from the Delhiite. However, it was clear that Kohli has already measured in his mind the possible danger areas that he might have to traverse on the big day. Ishan Kishan stays away It was an optional session but all the Indian players except Ishan Kishan attended the nets. In a novelty, pacer Jasprit Bumrah tried his hand in a bit of spin while head coach Rahul Dravid doubled up as a side-arm thrower.","pubDate":"2023-11-10 17:44:28","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"09e233bc7ee7d2ee761ad8b6a92ac0e1","title":"ICC suspends Sri Lanka over gov’t interference","link":"https://thefrontierpost.com/icc-suspends-sri-lanka-over-govt-interference/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"NEW DELHI (Agencies): The International Cricket Council (ICC) has suspended Sri Lanka with immediate effect after “government interference” in the running of the sport in the country. On Monday, the country’s sports minister announced the that the entire that the entirety of the cricket board had been sacked. The minister installed an interim committee led […]","content":"NEW DELHI (Agencies): The International Cricket Council (ICC) has suspended Sri Lanka with immediate effect after “government interference” in the running of the sport in the country. On Monday, the country’s sports minister announced the that the entire that the entirety of the cricket board had been sacked. The minister installed an interim committee led by former captain Arjuna Ranatunga but otherwise lacking in cricketing experience that included the sons of two politicians. However that inteim committee was subsequently struck down by the courts, with the old Sri Lanka Cricket (SLC) board reinstated. The changes came after a difficult Cricket World Cup that leaves Sri Lanka likely to miss out on qualification for the 2025 Champions Trophy. And while the conditions of their suspension are still to be decided, the news from the ICC comes as another significant blow to cricket in the country. “The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership of the ICC with immediate effect,” the ICC said in a statement. “The ICC Board met today and determined that Sri Lanka Cricket is in serious breach of its obligations as a Member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka. “The conditions of the suspension will be decided by the ICC Board in due course.” Sri Lanka, who are led by former England seamer and coach Chris Silverwood, won just two of their nine World Cup group games. They had reached the final of the 2023 Asia Cup ahead of the tournament, but were thrashed by India after being bowled out for 50. Silverwood’s side fared little better against the hosts during the World Cup, registering 55 all out in response to India’s total of 357-8. Sri Lanka are currently ninth in the standings, with only the top eight finishers qualifying for the Champions Trophy in two years’ time. They are level on points with England, Bangladesh and the Netherlands, who all have one more match to play. The city of Colombo, meanwhile, is due to host the men’s U19 Cricket World Cup in January and February of next year.","pubDate":"2023-11-10 17:29:41","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"f46a37be6466accb3af2c475219f4e7b","title":"ICC suspends Sri Lanka’s membership with immediate effect due to government interference","link":"https://sambadenglish.com/icc-suspends-sri-lankas-membership-with-immediate-effect-due-to-government-interference/","keywords":["SPORTS"],"creator":["Sambad English Bureau"],"video_url":null,"description":"NEW DELHI: The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership with immediate effect due to government interference in administration, which had been in tumultuous waters for the last week. It added that the conditions of the suspension will be decided by the ICC Board in due course. The huge development comes just […] The post ICC suspends Sri Lanka’s membership with immediate effect due to government interference first appeared on Sambad English.","content":"The International Cricket Council (ICC) Board has suspended Sri Lanka Cricket’s membership with immediate effect due to government interference in administration, which had been in tumultuous waters for the last week. It added that the conditions of the suspension will be decided by the ICC Board in due course. The huge development comes just a day after Sri Lanka’s campaign in the 2023 Men’s ODI World Cup in India came to an end with a five-wicket defeat to New Zealand in Bengaluru. In the tournament, Sri Lanka won two while losing seven games to end their campaign in ninth place, with its qualification for the 2025 Champions Trophy in jeopardy as they are out of the top eight teams in the points table. In the meeting held on Friday, the ICC said in a statement its Board “determined that Sri Lanka Cricket is in serious breach of its obligations as a Member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka.” Incidentally, on the day Sri Lanka’s campaign in the Men’s ODI World Cup came to an end, its parliament unanimously passed a resolution, calling for the sacking of the SLC Board. The resolution in the parliament was supported by both the ruling and opposition parties. The parliament resolution came two days after the Court of Appeal restored the SLC management headed by Shammi Silva on Tuesday, which had been sacked by Sports Minister Roshan Ranasinghe. Ranasinghe had appointed former Sri Lanka cricketer and 1996 World Cup-winning captain Arjuna Ranatunga as head of a seven-member interim committee to govern the cricketing affairs in the country in place of the SLC management. There had been a public outcry in the country after Sri Lanka suffered a mammoth 302-run loss to India at the Wankhede Stadium in Mumbai on November 2, with many demanding the sacking of the SLC board led by Silva, who was elected to the chairman post in May this year. SLC is the second full member to have its membership suspended by ICC in the last few years after Zimbabwe Cricket was suspended in 2019 for government interference. It remains to be seen what conditions ICC imposes in terms of SLC suspension and the effect it can have on cricketing activities in the country, considering that Sri Lanka are also the host of the 2024 Men’s U19 Cricket World Cup to be held in January next year.","pubDate":"2023-11-10 17:28:12","image_url":null,"source_id":"sambadenglish","source_priority":332200,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"e27acb0bdae41443b1064e04462a0304","title":"South Africa complete nervy win over Afghanistan","link":"https://www.bbc.co.uk/sport/av/cricket/67379686","keywords":null,"creator":null,"video_url":null,"description":"Watch highlights as Rassie van der Dussen hits an unbeaten 76 to seal South Africa's nervy five-wicket win over Afghanistan to secure them a place in the semi-finals of the Cricket World Cup.","content":null,"pubDate":"2023-11-10 17:08:21","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"3ae51770782b956b24c6d1c5ef017778","title":"Van der Dussen guides South Africa past Afghanistan","link":"https://www.bbc.co.uk/sport/cricket/67377932","keywords":null,"creator":null,"video_url":null,"description":"Rassie van der Dussen hits an unbeaten 76 to take South Africa to a nervy five-wicket win over Afghanistan.","content":"ICC Cricket World Cup: Rassie van der Dussen leads South Africa's victory over Afghanistan ICC Men's World Cup, Ahmedabad Afghanistan 244 (50 overs): Azmatullah 97* (107); Coetzee 4-44, Maharaj 2-25 South Africa 247-5 (47.3 overs): Van der Dussen 76* (95), De Kock 41 (47); Nabi 2-35 South Africa won by five wickets Scorecard . Table . Rassie van der Dussen hit an unbeaten 76 to take South Africa to a tense five-wicket win over Afghanistan in their final World Cup group game. Gerald Coetzee took 4-44 as the Proteas bowled Afghanistan out for 244 after Azmatullah Omarzai made an unbeaten 97 to rescue the innings from 116-6. South Africa made hard work of the chase but held their nerve to get over the line in the 48th over. Defeat officially ended Afghanistan's chances of making the top four. World Cup 2023: Table, run-scorers & wicket-takers Jonathan Trott's side needed to win by a highly improbable 438 runs to overhaul New Zealand on net run rate and stay in contention to reach the knockout stages but, after opting to bat first, lost wickets in clusters. After a steady start, they lost three wickets for four runs to slip from 41-0 to 45-3 and then another mini collapse saw them lose three wickets in four overs midway through the innings. However, Azmatullah held Afghanistan together with a well-paced knock, biding his time before accelerating late on, but three dot balls to end the innings left him three shy of a maiden international century. In reply, South Africa, who have dominated sides when batting first but struggled chasing, started well with openers Quinton de Kock and Temba Bavuma putting on 61. They fell in quick succession but Van der Dussen and Aiden Markram continued the momentum with a 60-run stand. But every time the Proteas appeared to be cruising, Afghanistan took a wicket to drag them back and when David Miller was dismissed with 62 still needed, the game was in the balance. Van der Dussen and Andile Phehlukwayo remained composed, though, and having whittled down the runs required, they finished it in a hurry with the latter going six, four, six to seal the win. With a number of players struggling with slight injuries - most notably Bavuma and Lungi Ngidi -throughout the game, South Africa now have a few days to rest and recover before their semi-final against Australia. Afghanistan out after tournament to remember After losing to Bangladesh in their first game, not much was expected of Afghanistan at this World Cup. For all the talent in their team and the way they had shown themselves capable of competing with the top sides in white-ball cricket, they had yet to do it on the big stage with their only 50-over World Cup win coming against Scotland in 2015. A month later and they have beaten three former champions in England, Pakistan and Sri Lanka - all in convincing fashion - and comfortably seen off the Netherlands as well. But for one of the great one-day innings of all-time , they would surely have added Australia to that list and come into this match knowing a win would put them into the semi-finals. That dream has eluded them this time but any notion of Afghanistan being minnows of world cricket has long since been banished. The confidence gained from their accomplishments in India should serve them well and with an ICC tournament each year for the foreseeable future, they will have plenty more chances to make history. 'Part of me is dreaming' - what they said South Africa captain Temba Bavuma: \"My leg is sore. I don't know the extent of it yet but I'll have to be fine. I am stubborn, it will have to be fine. \"Part of me is dreaming. We want to be back here [in the final]. But Australia are a big hurdle for us to overcome. We will enjoy today, take the learnings and then get our minds set on that game.\" Afghanistan captain Hashmatullah Shahidi: \"We gave a good message to the world in this tournament. We played big teams and we fought. The Australia game was in our hands, it was a shock that defeat. There was a lot of learning.\" Player of the Match, South Africa's Rassie van der Dussen: \"Someone always has to play the anchor role in a chase and I was happy to do that. The platform I had from Temba and Quinton made my job a lot easier, too. \"We do so well batting first and that makes people think we chase badly. We would like to improve our chasing, yes, and I think being in that situation tonight will hold us in good stead.\"","pubDate":"2023-11-10 16:58:48","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"aec6eed00a783c4eb1db0df3fbf512c1","title":"Sri Lanka Cricket suspended over government interference","link":"https://www.bbc.co.uk/sport/cricket/67384199","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket are suspended by the International Cricket Council (ICC) because of government interference.","content":"Sri Lanka were beaten by New Zealand in their final World Cup match on Thursday Sri Lanka have been suspended by the International Cricket Council (ICC) because of government interference. Sri Lanka's ministry of sport sacked the national board (SLC) amid the team's poor World Cup, although the decision was reversed by a court. The ICC board determined \"Sri Lanka is in serious breach of its obligations as a member\". The terms of the suspension, including any potential ramifications, will be decided at the next ICC board meeting. The ICC said Sri Lanka had broken \"the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration\". Sri Lanka have won just two of their nine games at the World Cup so far, leaving them ninth in the table. They are coached by former England coach Chris Silverwood. Last week sports minister Roshan Ranasinghe described the SLC as \"traitorous and corrupt\" in a statement to parliament and called for board members to resign. Secretary Mohan de Silva quit and the board was sacked. Ranasinghe replaced them with an interim committee chaired by World Cup-winning captain Arjuna Ranatunga, although a petition against the dismissal was granted a two-week stay order by a court this week. SLC also issued a statement on allegations made by Ranasinghe about supposed financial irregularities. The ICC suspension comes a day after Sri Lanka's last game at the World Cup in India - a defeat by New Zealand on Thursday. England are due to host Sri Lanka for a three-Test series next summer while Sri Lanka are also due to host the Under-19 men's World Cup in January and February next year. Afghanistan have not been banned by the ICC despite the Taliban banning women from playing sports, resulting in their women's team being unable to compete. BBC Sport understands this is because the ICC sees there to be no government interference in Afghanistan. Speaking to the BBC's Stumped podcast on Thursday, ICC chief executive Geoff Allardice said: \"We have spoken with the Afghanistan Cricket Board and the position is that they have to operate within the laws of the country and the rules are set by the government. \"Really the question for the ICC board is, do we support our member in their ability to promote cricket within the rules set by the government of the country? And the view is yes.\" Listen to full Stumped interview with Geoff Allardice","pubDate":"2023-11-10 16:50:33","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"45302ac3069bdfa715dccd2ed0975fe1","title":"Rassie van der Dussen stars as Proteas knock Afghanistan out of Cricket World Cup","link":"https://www.iol.co.za/sport/cricket/proteas/rassie-van-der-dussen-stars-as-proteas-knock-afghanistan-out-of-cricket-world-cup-d6471885-d7b7-4092-a47a-b291bfc01abd","keywords":null,"creator":["AFP"],"video_url":null,"description":"South Africa beat Afghanistan by five wickets to win their last World Cup group game on Friday as the Asian side were eliminated from the semi-final race.","content":"Ok, well not in quite that macho tone, for South Africa may have completed a rare successful run-chase to close off their Cricket World Cup league phase on a positive note, but they will certainly have to play much better in next Thursday’s semi-final against their arch-rivals at Eden Gardens if they are to progress to a first-ever final. With the comfort of already having secured a semi-final place, the Proteas lacked intensity from the outset. They were also comfortable enough to give Marco Jansen a much-needed break that afforded Andile Phehlukwayo his first run out at this World Cup. Ultimately, it proved to work out just fine with Phehlukwayo (39 not out) carving out a match-winning 65-run partnership with anchorman Rassie van der Dussen (76 not out off 95 balls) to take South Africa home by five wickets with 15 balls to spare. The margin of victory may seem comfortable, but it certainly was not for large chunks of the run-chase with South Africa’s ability to put themselves under pressure rising to the surface once again. Quinton de Kock and captain Temba Bavuma , who was hampered by a hamstring injury throughout the game and is now a potential doubtful starter for the Australian semi-final, seemed to get everything underway with relative ease in their 64-run opening partnership. But once Bavuma (23) and De Kock (41) fell in quick succession, it opened the door for Afghanistan superstar Rashid Khan (2/37) to create his customary chaos in the middle-order. And when Rashid removed arguably South Africa’s best players of spin in Aiden Markram and Heinrich Klaasen within a few overs of each other, the cat was well and truly among the pigeons. All the bad memories of failed chases resurfaced, with former England and Australian captains Nasser Hussein and Aaron Finch turning up the intensity on commentary and fueling the drama, which only intensified when David Miller meekly surrendered to a Mohammed Nabi (2/35) caught and bowled chance. Throughout all this histrionics, Van der Dussen remained ice cool at the non-striker’s end, staying in his bubble, and content to do the hard graft before breaking the shackles with the odd boundary in between. He played a visible role in comforting Phehlukwayo, who had not batted out in the middle since the last ODI against Australia back in South Africa at the Wanderers prior to the World Cup almost two months ago. Phehlukwayo’s rustiness was visible, but settled the longer he stayed at the crease, before finishing the game in a flourish with a six, four and six off Naveen-ul-Haq to end unbeaten on 39. Proteas coach Rob Walter will certainly be pleased that his team eventually crossed the line with the bat, but the inability to close out the opposition’s innings remains a cause for concern. South Africa had once again reduced the Afghans to 160/7, but then allowed them to score a further 84 runs for the three remaining wickets with Azmatullah Omarzai striking a defiant 97 not out. It did seem that South Africa had shifted their attention to the semi-final already at that stage with the seamers, and Lungi Ngidi in particular, adopting a strategy of trying to bowl wide yorkers. If that was indeed the case, then plenty of work still needs to be done in the nets this week too leading up the semi-final, with South Africa conceding 10 wides in the process and Ngidi delivering three in succession in the penultimate over. Only Gerald Coetzee seemed to have brought any energy and passion with him to the Narendra Modi Stadium yesterday as he finished with 4/44 to surpass Jansen as South Africa’s leading wicket-taker in the tournament. “Today we did a few things differently. We batted second today. To get over the line in that manner, that is going to give us a lot of confidence. Fantastic knock by Rassie, he took ownership and the guys batted around him,” Bavuma said. “Not really (concerned about the opposition’s lower order runs). The wicket got better. When Keshav came back for his second spell, it was not gripping and spinning as much. Gerald also came in and took wickets, always a huge plus. We can always pick on the different phases and we can think of things to improve, but we will take the win. The skipper also provided an update on his injury. “Obviously my leg is sore. Don't know to what extent but it is going to have to be fine, at least in my eyes. I obviously had that option of coming off but it was our last group stage game, and I wanted to be out there with the guys. Was an opportunity to spend some time in the middle and I did not want to let it go. Wanted to keep marshalling the guys, and keep strengthening the relationship with our bowlers. It was a risk but I felt it was the right move (to stay on). Winning is a habit, so we want to take that momentum through,” he said. Scorecard Afghanistan: 244 all out (Azmatullah Omarzai 97*, Coetzee 4/44, Maharaj 2/25) South Africa: 247/5 (Van der Dussen 76*, De Kock 41, Phehlukwayo 39*, Rashid Khan 2/37, Nabi 2/35) South Africa won by five wickets IOL Sport","pubDate":"2023-11-10 16:50:14","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/e9e81872-e80b-55d5-9ab3-ac18c83ea028&operation=CROP&offset=0x59&resize=2507x1409","source_id":"iol","source_priority":32046,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"24a95c869def2c216897c2f319f5452b","title":"World Cup: Van der Dussen guides South Africa to five-wicket win over Afghanistan","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/10/world-cup-van-der-dussen-guides-south-africa-to-five-wicket-win-over-afghanistan-2631892.html","keywords":null,"creator":null,"video_url":null,"description":"Chasing 245 for victory, the Proteas, who had already qualified for the semifinals, completed the task in 47.3 overs. AHMEDABAD: The calmness of Rassie van der Dussen and fire of Gerald Coetzee helped experienced South Africa overcame spirited resistance from Afghanistan to carve out a five-wicket win in their last league game of the World Cup here on Friday. Set a target of 245, South Africa, who are already assured of a place in semifinals, completed the task with Van der Dussen remaining unbeaten on 76 off 95 balls. Andile Phehlukwayo was unbeaten on a 37-ball 39 after a match-winning partnership of 65 runs with Van der Dussen. Earlier, pacer Coetzee took four wickets as Afghanistan were limited to 244 despite Azmatullah Omarzai's impressive 97. Omarzai's knock, however, helped the Afghans to recover from 116 for six. The defeat notwithstanding, Afghanistan, who shocked defending champions England and Pakistan during a very promising campaign, would go home with their heads held high. Continuing his good run in the tournament, Omarzai faced 107 balls while hitting seven fours and three sixes. However, he could not record his maiden ODI hundred after failing to score off the last three balls of the final over bowled by Kagiso Rabada. On a pitch without any demons, South Africa started their chase confidently. But, as the match progressed, things didn't pan out the way South Africa would have liked them to. In the end, they achieved it with 15 balls remaining after a mighty scrap. The in-form Quinton de Kock (41 off 47 balls) made his intentions clear quite early with a four and a six off Mujeeb Ur Rahman, dancing down the track to pummel the seasoned bowler over mid-off. The dashing left-handed batter, who went past Rachin Ravindra to become the leading scorer of this tournament, then pulled a Naveen-ul-Haq half-tracker over deep square leg for a maximum. De Kock, however, could not go on to make a big one as he was adjudged trapped in front of the wicket by Mohammad Nabi, who chose to review after failing to convince the on-field umpire. Looking to play a reverse sweep, De Kock missed and the ball hit the pads, prompting Nabi to go for a loud appeal. Afghanistan's move to review the decision was vindicated when the ball tracking showed that it was going to hit the leg stump. De Kock, who had earlier in the day joined the likes of Adam Gilchrist and Sarfaraz Khan by taking six catches, struck two fours and three sixes. Meanwhile, skipper Temba Bavuma's (23 off 28) poor run continued as he was shown the door by Mujeeb, who had the batter in all sorts of trouble with a back of a length delivery that hurried onto him. Bavuma, who looked like he was struggling while fielding, seemed to battle cramps after he had come out to bat with an intention to spend some time in the middle following an underwhelming sequence of scores. Aiden Markram (25 off 32) also gave his wicket away after getting a start while Heinrich Klaasen was dismissed by the wily Rashid Khan, a well-deserved reward for some excellent bowling, as South Africa slipped to 139 for four in the 28th over. A 43-run partnership ensued before Nabi had David Miller (24 off 33) in a rather soft dismissal, leaving Van der Dussen to complete the job. Earlier, Afghanistan were off to a steady start after their skipper Hashmatullah Shahidi opted to bat first, but South Africa meant business as they snared three wickets for four runs to leave their opponents in a spot of bother at 45 for three in the 11th over. At that point, it seemed like the decision to bat first was backfiring even as Bavuma marshalled his resources well to keep South Africa ahead in the game. But even before the Proteas could celebrate the first breakthrough they faced an anxious moment when pacer Lungi Ngidi went off the field after suffering what looked like an ankle or achilles issue. Ngidi, however, returned to pick the wickets of Rahmat Shah and Nabi, who nicked one to De Kock after facing just three balls, leaving his team at 116 for six in the 28th over. Having smoked lead pacer Rabada's length ball outside off for a six over long-on, Rahmanullah Gurbaz (25) found the fence again when he produced a lovely cover driver against the same bowler. Desperately looking for a breakthrough, Bavuma introduced Keshav Maharaj into the attack and the left-arm spinner straightaway responded with the big wicket of Gurbaz, who edged a turning delivery to Klaasen at first slip. Not only did Maharaj strike with his first ball he also enjoyed a wicket-maiden, giving South Africa a bit of a momentum which they used to their advantage by quickly grabbing two more wickets. Much was expected of Ibrahim Zadran, who scored a brilliant hundred against Australia in their last game, but the opener was done in by a short ball from Coetzee. Omarzai, however, continued to fight it out.","content":"AHMEDABAD: The calmness of Rassie van der Dussen and fire of Gerald Coetzee helped experienced South Africa overcame spirited resistance from Afghanistan to carve out a five-wicket win in their last league game of the World Cup here on Friday. Set a target of 245, South Africa, who are already assured of a place in semifinals, completed the task with Van der Dussen remaining unbeaten on 76 off 95 balls. Andile Phehlukwayo was unbeaten on a 37-ball 39 after a match-winning partnership of 65 runs with Van der Dussen. Earlier, pacer Coetzee took four wickets as Afghanistan were limited to 244 despite Azmatullah Omarzai's impressive 97. Omarzai's knock, however, helped the Afghans to recover from 116 for six. The defeat notwithstanding, Afghanistan, who shocked defending champions England and Pakistan during a very promising campaign, would go home with their heads held high. Continuing his good run in the tournament, Omarzai faced 107 balls while hitting seven fours and three sixes. However, he could not record his maiden ODI hundred after failing to score off the last three balls of the final over bowled by Kagiso Rabada. On a pitch without any demons, South Africa started their chase confidently. But, as the match progressed, things didn't pan out the way South Africa would have liked them to. In the end, they achieved it with 15 balls remaining after a mighty scrap. The in-form Quinton de Kock (41 off 47 balls) made his intentions clear quite early with a four and a six off Mujeeb Ur Rahman, dancing down the track to pummel the seasoned bowler over mid-off. The dashing left-handed batter, who went past Rachin Ravindra to become the leading scorer of this tournament, then pulled a Naveen-ul-Haq half-tracker over deep square leg for a maximum. De Kock, however, could not go on to make a big one as he was adjudged trapped in front of the wicket by Mohammad Nabi, who chose to review after failing to convince the on-field umpire. Looking to play a reverse sweep, De Kock missed and the ball hit the pads, prompting Nabi to go for a loud appeal. Afghanistan's move to review the decision was vindicated when the ball tracking showed that it was going to hit the leg stump. De Kock, who had earlier in the day joined the likes of Adam Gilchrist and Sarfaraz Khan by taking six catches, struck two fours and three sixes. Meanwhile, skipper Temba Bavuma's (23 off 28) poor run continued as he was shown the door by Mujeeb, who had the batter in all sorts of trouble with a back of a length delivery that hurried onto him. Bavuma, who looked like he was struggling while fielding, seemed to battle cramps after he had come out to bat with an intention to spend some time in the middle following an underwhelming sequence of scores. Aiden Markram (25 off 32) also gave his wicket away after getting a start while Heinrich Klaasen was dismissed by the wily Rashid Khan, a well-deserved reward for some excellent bowling, as South Africa slipped to 139 for four in the 28th over. A 43-run partnership ensued before Nabi had David Miller (24 off 33) in a rather soft dismissal, leaving Van der Dussen to complete the job. Earlier, Afghanistan were off to a steady start after their skipper Hashmatullah Shahidi opted to bat first, but South Africa meant business as they snared three wickets for four runs to leave their opponents in a spot of bother at 45 for three in the 11th over. At that point, it seemed like the decision to bat first was backfiring even as Bavuma marshalled his resources well to keep South Africa ahead in the game. But even before the Proteas could celebrate the first breakthrough they faced an anxious moment when pacer Lungi Ngidi went off the field after suffering what looked like an ankle or achilles issue. Ngidi, however, returned to pick the wickets of Rahmat Shah and Nabi, who nicked one to De Kock after facing just three balls, leaving his team at 116 for six in the 28th over. Having smoked lead pacer Rabada's length ball outside off for a six over long-on, Rahmanullah Gurbaz (25) found the fence again when he produced a lovely cover driver against the same bowler. Desperately looking for a breakthrough, Bavuma introduced Keshav Maharaj into the attack and the left-arm spinner straightaway responded with the big wicket of Gurbaz, who edged a turning delivery to Klaasen at first slip. Not only did Maharaj strike with his first ball he also enjoyed a wicket-maiden, giving South Africa a bit of a momentum which they used to their advantage by quickly grabbing two more wickets. Much was expected of Ibrahim Zadran, who scored a brilliant hundred against Australia in their last game, but the opener was done in by a short ball from Coetzee. Omarzai, however, continued to fight it out.","pubDate":"2023-11-10 16:42:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"}]}