{"newsArray":[{"title":"ICC ODI Rankings: सीरीज हारने के साथ ही भारत को हुआ बड़ा नुकसान, गंवा दिया नंबर-1 का ये ताज","link":"https://www.indiatv.in/sports/cricket/icc-odi-rankings-australia-become-number-1-team-india-on-2nd-position-loss-3rd-odi-cricket-team-2023-03-23-944263","keywords":null,"creator":null,"video_url":null,"description":"ICC ODI Rankings: भारतीय टीम को ऑस्ट्रेलिया के खिलाफ तीसरे वनडे मैच में 21 रनों से हार का सामना करना पड़ा। इसी के साथ भारत ने आईसीसी वनडे रैंकिंग में पहला स्थान गंवा दिया।","content":"तीसरे वनडे मैच में टीम इंडिया को ऑस्ट्रेलिया के खिलाफ 21 रनों से हार झेलनी पड़ी। इसी के साथ ऑस्ट्रेलिया ने वनडे सीरीज भी 2-1 से अपने नाम कर ली। भारत ने पहले वनडे में 5 विकेट से जीत हासिल की थी, लेकिन इसके बाद ऑस्ट्रेलियाई टीम ने सीरीज में धमाकेदार वापसी करते हुए दूसरा वनडे 10 विकेट और तीसरा वनडे 21 रनों से जीतकर सीरीज पर कब्जा कर लिया। तीसरे वनडे में भारतीय बल्लेबाज बुरी तरह से फ्लॉप रहे और बड़ी पारियां नहीं खेल पाए। तीसरा वनडे हारने के साथ ही भारत को ICC ODI रैंकिंग में तगड़ा झटका लगा है। ऑस्ट्रेलिया ने भारत के खिलाफ वनडे सीरीज 2-1 से जीतते ही आईसीसी वनडे रैंकिंग में पहला स्थान हासिल कर लिया है और भारतीय टीम दूसरे नंबर पर पहुंच गई है। तीसरे वनडे में 21 रनों की जीत के साथ ही ऑस्ट्रेलिया को फायदा हुआ है। उसके अब 113.286 रेटिंग अंक हैं। वहीं, भारत के 112.638 रेटिंग अंक हैं। तीसरे वनडे मैच से पहले भारत के 114 रेटिंग अंक थे। वहीं, ऑस्ट्रेलियाई टीम के 112 रेटिंग अंक थे। तीसरे वनडे मैच में ऑस्ट्रेलिया के कप्तान स्टीव स्मिथ ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया। भारत को जीतने के लिए ऑस्ट्रेलिया ने 269 रनों का टारगेट दिया, जिसे टीम इंडिया हासिल नहीं कर पाई और मुकाबला 21 रनों से गंवा दिया। भारत के लिए हार्दिक पांड्या और कुलदीप यादव ने 3-3 विकेट चटकाए। ऑस्ट्रेलिया के लिए सबसे ज्यादा मिचेल मार्श ने बनाए। उन्होंने 47 रनों की पारी खेली। भारत के लिए शुभमन गिल और रोहित शर्मा ने शानदार शुरुआत की, लेकिन वह इसे बड़ी पारी में तब्दील नहीं कर पाए। रोहित शर्मा ने 30 रन बनाए। वहीं, शुभमन गिल ने 37 रन जड़े। इसके बाद विराट कोहली और केएल राहुल ने टीम इंडिया को जीत की तरफ ले जाने की कोशिश की, लेकिन कोहली के आउट होते ही मैच ऑस्ट्रेलिया की तरफ झुक गया। कोहली ने 54 रन बनाए। वहीं, सूर्यकुमार यादव सीरीज के तीनों ही मैच में अपना खाता तक नहीं खोल पाए। हार्दिक पांड्या ने 40 रन बनाए, लेकिन वह भी टीम इंडिया को जीत नहीं दिला पाए। 2-1 बनाम ऑस्ट्रेलिया, 2023 3-2 बनाम ऑस्ट्रेलिया, 2019 3-2 बनाम दक्षिण अफ्रीका, 2015 2-1 बनाम पाकिस्तान, 2012/13 4-2 बनाम ऑस्ट्रेलिया, 2009","pubDate":"2023-03-23 01:38:37","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shadab says Saim is a player of Babar’s category","link":"https://www.nation.com.pk/23-Mar-2023/shadab-says-saim-is-a-player-of-babar-s-category","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan T20I captain Shadab Khan has backed young and talented Saim Ayub, saying he is excited to play alongside the youngster during the upcoming T20I series against Afghanistan.","content":"LAHORE - Pakistan T20I captain Shadab Khan has backed young and talented Saim Ayub, saying he is excited to play alongside the youngster during the upcoming T20I series against Afghanistan. Speaking on the Pakistan Cricket Board (PCB) podcast, Shadab said that the players like Saim, Babar, and Abdullah Shafique always look special when they play. “I think Saim is an exceptional talent. After a very long time, we have got a player like him who we can say is as stylish and good as Babar and Abdullah,” said Shadab and added: “The way Saim plays, he is a player of Babar’s category. Players like them are too good to watch even when they score runs against your team. They are too stylish batters.” Saim opened innings alongside skipper Babar for Peshawar Zalmi in recently-concluded Pakistan Super League (PSL) 2023. His stylish batting and consistency made him a solid candidate for the Pakistan team’s call-up. The left-handed batter, who scored 341 runs in 12 matches in PSL 8, was named in Pakistan’s squad against Afghanistan in threematch T20I series. The T20 skipper also urged the fans to support youngsters during the Afghanistan series. Shadab said he is excited to lead a young and energetic squad. “A dream for any Pakistani to captain the national cricket team. Can’t thank Allah enough. Really excited to lead this young team, loads of talent. We will try to play aggressive and progressive cricket. Remember to back the youngsters, they are our future,” he tweeted. The PCB has given rest to its main players including captain Babar, Shaheen Shah Afridi, Haris Rauf, Muhammad Rizwan, and Fakhar Zaman. Shadab, the team’s vice-captain in whiteball format, will lead the squad in the absence of Babar Azam. The youngsters including Saim Ayub, Azam Khan, Ihsanullah and Zaman Khan, who performed well in the PSL 8, have made it into the national squad for Afghanistan series. PAKISTAN T20I SQUAD: Shadab Khan (c), Abdullah Shafique, Azam Khan, Faheem Ashraf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Wasim Jr, Naseem Shah, Saim Ayub, Shan Masood, Tayyab Tahir, Zaman Khan.","pubDate":"2023-03-22 23:52:47","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/shadab-says-saim-is-a-player-of-babar-s-category-1679529163-3487.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Lahore Qalandars pace up preparations for hockey league","link":"https://www.nation.com.pk/23-Mar-2023/lahore-qalandars-pace-up-preparations-for-hockey-league","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - The PSL 8 champions Lahore Qalandars are now focused to promote hockey in Pakistan as they have paced up the preparations to host the first-ever Professional Hockey League.","content":"LAHORE - The PSL 8 champions Lahore Qalandars are now focused to promote hockey in Pakistan as they have paced up the preparations to host the first-ever Professional Hockey League. Qalandars’ owners Atif Rana and Sameen Rana alongside Director Aqib Javed met Pakistan Hockey Federation (PHF) Secretary Haider Hussain and former Olympian Shahbaz Senior at their office. During the meeting, the hockey league was on top of the discussion. Qalandars’ high-ups shared their plan of introducing a players’ development program in hockey. The Qalandars owners want to work for hockey in the way they did for cricket. After seven years of hard work, Qalandars bagged back-to-back PSL titles. They became the first-ever team in PSL’s history to defend their title. Shahbaz Senior praised Qalandars’ initiative to lift hockey. “It’s heartening to see someone taking an initiative for hockey,” he said. “They can do it because they have built their reputation in cricket. People know them and trust them. I think if they work with honesty, they will be able to grow hockey just like they did in cricket,” he said and added: “Hockey is not famous among our youth. We need to promote it in a way that attracts our youngsters as this is the only way to revive the national game.” Qalandars took an initiative to hold open trials in Karachi and Lahore. During the PSL 8, Shaheen Afridi and the company reached Karachi Hockey Association (KHA) ground to watch the trials. Hundreds of kids appeared in the trials at KHA. Trials in Lahore will take place later on. After the trials, Qalandars will host a hockey series between the teams of Karachi and Lahore. Shaheen will be the ambassador of Karachi whereas Haris Rauf will be in the camp of Lahore.","pubDate":"2023-03-22 23:49:39","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/lahore-qalandars-pace-up-preparations-for-hockey-league-1679528964-5946.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Sindh Bank crowned champions","link":"https://www.nation.com.pk/23-Mar-2023/sindh-bank-crowned-championsv","keywords":["Sports, Newspaper"],"creator":["PR"],"video_url":null,"description":"KARACHI - Sindh Bank was crowned champions after beating State Bank of Pakistan (SBP) by 5 wickets in the finals of the 19th Governor Cup 2023 Inter-Bank Regional Cricket Tournament of Karachi Region held at the SBP Sports Complex.","content":"KARACHI - Sindh Bank was crowned champions after beating State Bank of Pakistan (SBP) by 5 wickets in the finals of the 19th Governor Cup 2023 Inter-Bank Regional Cricket Tournament of Karachi Region held at the SBP Sports Complex. The event was organized by SBP where 16 teams took part. Sindh Bank won all the three league matches and qualified for the quarterfinals and won from HBL by 7 wickets. Sindh Bank won by 5 wickets from Bank Al Habib in the semifinals and then qualified for the final, where they outplayed SBP to win the title. Syed Samar Husnain, Executive Director SBP, Development Finance Group, was the chief guest at prize distribution ceremony and gave away prizes to the winners. Other notables present there were Test cricketer Sarfaraz Ahmad, Sindh Bank President &CEO Imran Samad and Head of HR Baqir Hussain.","pubDate":"2023-03-22 23:47:19","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/sindh-bank-crowned-championsv-1679528824-3869.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Cricket: Matt Rowe bowls the perfect over in Palmerston North v Rotorua schoolboy cricket match","link":"https://www.nzherald.co.nz/bay-of-plenty-times/news/cricket-matt-rowe-bowls-the-perfect-over-in-palmerston-north-v-rotorua-schoolboy-cricket-match/X5EUQL4WZNEWNCZGNB2IXVN2ZE/","keywords":null,"creator":null,"video_url":null,"description":"'It was a bit crazy to be honest'.","content":"By RNZ A perfect over in cricket is almost unheard of - a holy grail bowlers don’t even think about searching for, it’s so unlikely to happen. And yet Palmerston North Boys’ High School 1st XI bowler Matt Rowe has achieved the feat, taking all six wickets in the fifth over against Rotorua Boys High School yesterday. The Year 13 student, who has been invited to camp with the New Zealand Under-19 side, ended with match figures of 9-12 from his six overs, including his incredible fifth over in which a wicket fell for every ball. Advertisement Advertise with NZME. “It was a bit crazy to be honest,” Rowe said. “Total disbelief.” The moment Palmerston North Boys’ Matt Rowe got 6 wickets in an over vs Rotorua Boys 🔥 @mattrowe_7 🎥 Tim Clarke Posted by The Legend of Marty Banks on Tuesday, March 21, 2023 Needing a thumping win to make the Super 8 tournament final in Tauranga, Rowe wasted no time giving his team a good start. He had his first wicket in his first over, but had to wait until the match’s ninth over, his fifth, for the fireworks to happen. “I can remember the first couple well,” he said. “First ball he snicked off to a fairly regulation catch at second slip. Advertisement Advertise with NZME. “And then, I hit the poles for the rest of them. Four clean bowled, and the last one was an LBW.” Having had a hat-trick before - three wickets in three balls - Rowe wasn’t too fazed when that milestone approached. “The umpire - I was talking to him a bit - said ‘I haven’t seen many hat-tricks in my time’. “I thought, oh I’ll see if I can make it happen for the umpire. That was just the start.” So how did Rowe feel after his fourth wicket? “I was sort of like, oh, this is getting a bit serious actually.” After five? “Surprise. I was really surprised. I didn’t expect it to happen.” Not a bad spell… Posted by The Alternative Commentary Collective on Tuesday, March 21, 2023 And the sixth? “Total disbelief. The boys were all getting around me, it was crazy, to be honest. They were going mental, they were more amazed than I was.” Advertisement Advertise with NZME. After bowling six overs in his spell of 9-12, the game ended on a run-out. Rowe said it was a good way to finish, despite being agonisingly close to a 10-wicket haul. “I was being too greedy anyway,” he said. “It was good for the boys to get a run-out.” Rotorua Boys were bowled out for 26, and Palmerston North Boys chased the total in just 2.1 overs. Coach Scott Davidson said it was an unbelievable display. “When he knocked the first couple over I was thinking this is great for the team that we’re not going to have to chase too many,” Davidson said. Advertisement Advertise with NZME. “I’ve played a lot of cricket, and my manager has been around cricket for a long time, and we just couldn’t believe what we were seeing. “With every wicket that came the boys were getting more excited, but thankfully Rowey was pretty concentrated on what he had to do and he executed.” Palmerston North Boys’ High School play Tauranga Boys’ High School today in the final of the Super 8 tournament in Tauranga. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-03-22 20:38:42","image_url":"https://www.nzherald.co.nz/resizer/dVuT888af6xAgMQKELd56NgKO1s=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/5QLEXPZBHRESNLO6YT2X7C6CMQ.png","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"India’s Suryakumar Yadav out for three golden ducks in three games as Australia ends India’s four-year streak","link":"https://www.nzherald.co.nz/sport/embarrassing-act-as-aussies-stun-cricket-world-end-indias-four-year-streak/RGDERLCEDJHIFP4X7KVMKUEJTQ/","keywords":null,"creator":null,"video_url":null,"description":"An Indian star claimed an unwanted piece of history.","content":"Australia has finished its tour of India in stunning fashion, reclaiming the world No. 1 ranking with a 21-run win in the third ODI. Spinners Adam Zampa and Ashton Agar turned the decider in Chennai to hand India their first series defeat at home since an Usman Khawaja-led Aussie victory in 2019. After bowling the visitors out for 269 in 49 overs, the hosts had the match in hand with Virat Kohli and Hardik Pandya at the crease at 4/185, needing less than a run a ball to claim victory. But a double strike from Agar turned the match. First he removed in-form Kohli (54) before the world’s top-rated Twenty20 batter Suryakumar Yadav strolled to the crease with huge pressure on his place in the side. Advertisement Advertise with NZME. Yadav had been trabbed LBW by Mitchell Starc with the first balls he faced in the first and second ODIs — and in embarrassing scenes was unable to avoid the same fate as Agar struck immediately. Suryakumar Yadav didn’t put bat on the ball in the entire series. Three Golden Ducks in three games - LBW twice and bowled once. #IndvAus — Mazher Arshad (@MazherArshad) March 22, 2023 Mitchell Marsh’s 47 runs and Alex Carey’s 38 runs had carried Australia to a par score of 269 runs (49 overs). In reply, India was bowled out for 248 runs (49.1 overs) with Virat Kohli’s half-century going in vain. The visitors won the series 2-1 after dropping the first match. Marsh was named player of the series for scoring 194 runs in three innings. “It is just natural aggression when I am batting. I have thoroughly enjoyed it,” Marsh said, “I was really glad to come in and perform, as I am coming off an extended break.” Advertisement Advertise with NZME. After winning the toss and opting to bat, Australia sped off to a good start with Marsh and Travis Head (33) putting on 68 runs off 65 balls. Indian pacers Mohammed Shami and Mohammed Siraj struggled with the new ball, but Hardik Pandya took 3-44 in eight overs to bring India back into the game. First, Pandya had Head caught at square leg and three balls later Steve Smith was caught behind for duck. Australia was down to 85-3 within 3.4 overs when Pandya also trapped Marsh lbw. Wrist spinner Kuldeep Yadav picked up 3-56, dismissing both David Warner (23) and Marnus Labuschagne (28) as Australia was reduced to 138-5 in 28.1 overs. Warner, who came in at number four, added 40 runs with Labuschagne for the fourth wicket before the duo fell in the space of four overs. Carey held the lower order together as he stitched a 58-run partnership with Marcus Stoinis (25). While the latter was out caught off Axar Patel (2-57) in the 37th over, Yadav bowled Carey to make it 203-7 in the 39th. Australia’s tail wagged hard enough to add 66 runs for the final three wickets, which proved vital. Sean Abbott scored 26 off 23 balls, with Ashton Agar scoring 17 runs. Mitchell Starc and Zampa added 10 runs each to push Australia to a challenging total. India’s chase began on a positive note with openers Rohit Sharma and Shubman Gill adding 65 runs off 55 balls. But the duo fell within a space of 19 balls to leave India at 77-2. Sharma was caught off Abbott after scoring 30 off 17 balls, while Zampa picked his first of the night, trapping Gill lbw for 37 off 49 balls. Advertisement Advertise with NZME. Kohli spearheaded the chase thereafter scoring a sedate 54 off 72 balls, including two fours and a six. He added 69 runs for the third wicket with Lockesh Rahul (32), before the latter holed out off Zampa, who has his best figures on Indian soil. India went from 146-3 to 151-4, as Patel (2) was run-out after a mix-up with Kohli, who had reached his 64th ODI half-century off 61 balls. He added 34 runs with Pandya but the turning point came in the 36th over when Kohli was caught at long off. Zampa returned to dismiss Pandya, who scored 40 off 40 balls, and Ravindra Jadeja (18) as India lost its first bilateral home ODI series since 2019. The leg spinner was named player of the match. “I have had some success in India,” Zampa said. “It is a tough place to come and always a huge challenge to play here. I don’t think I deserve this tonight, kudos to the guys who bowled before me. We had trust in our process and in our game plan.” Advertisement Advertise with NZME. Australia was also the last team to win an ODI series here, and in this duration, India had won seven consecutive bilateral contests at home. India had won the first ODI by five wickets, and Australia had bounced back with a 10-wicket win. “I don’t think it was too many runs,” said Sharma, the Indian skipper. “The wicket was challenging in the second innings but we didn’t bat well enough. We failed to put up partnerships today. We will play a World Cup in these conditions in six months’ time and we need to improve.” News.com.au/AP Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-03-22 20:02:09","image_url":"https://www.nzherald.co.nz/resizer/vAPowk5LuB5Q0gTopKJpuThQT6g=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/3ZR2ZSFZIRD7ZPFNBPOU3U2Q3E.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Si Ferry to depart Open Goal Broomhill at end of season","link":"https://www.heraldscotland.com/sport/23405929.si-ferry-depart-open-goal-broomhill-end-season/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The partnership between the Lowland League club and the podcast will conclude at the end of the season.","content":"Open Goal and Broomhill are set to bring their partnership to an end with head coach Si Ferry preparing to depart the club at the end of the season. The Scottish football podcast, presented by Ferry, struck a deal with the Lowland League club that saw the former Celtic, Dundee and Swindon Town midfielder take charge of the first team, while a fly-on-the-wall documentary was shot that would chart the team’s progression. The club changed its name to Open Goal Broomhill FC as part of the project but it will conclude after one season with Ferry set to leave at the end of the current campaign. Ferry was joined at the club, who play their home matches at Broadwood Stadium, by podcast co-host Paul Slane as well as a host of recently professional players such as Kirk Broadfoot, Gary Fraser, Derek Lyle and Ryan Conroy. READ MORE: From podcast to pitchside: Si Ferry on leading Open Goal Broomhill into Scottish Cup Herald and Times Sport understands that the players were informed of the decision on Tuesday at a team meeting. Open Goal Broomhill currently occupy 13th place in the 19-team Lowland League with five games left to play this season. New episodes of the behind-the-scenes documentary, ‘Crossing The Line’, are published weekly on YouTube. At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football, golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this exclusive bespoke piece sent directly to your email inbox for free every day at 5pm, simply take a few seconds to type in your email here . It's that simple!","pubDate":"2023-03-22 19:40:49","image_url":"https://www.heraldscotland.com/resources/images/16587359/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Rohit Sharma double century list: Rohit Sharma century list in ODI cricket","link":"https://thesportsrush.com/cricket-news-rohit-sharma-double-century-list-rohit-sharma-century-list-in-odi-cricket/","keywords":["Cricket","Rohit Sharma"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Despite considering how batters have been playing some outrageous innings these days with the help of some jaw-dropping shots, no score (individual or team) is considered insurmountable in White Ball Cricket. Having said that, Rohit Sharma‘s double century innings – 264 off 173 deliveries against Sri Lanka at Eden Gardens in November 2014, is one… The post Rohit Sharma double century list: Rohit Sharma century list in ODI cricket appeared first on The SportsRush.","content":"Despite considering how batters have been playing some outrageous innings these days with the help of some jaw-dropping shots, no score (individual or team) is considered insurmountable in White Ball Cricket. Having said that, Rohit Sharma‘s double century innings – 264 off 173 deliveries against Sri Lanka at Eden Gardens in November 2014, is one such knock for the ages which certainly seems nearly impossible to breach in ODI Cricket. Rohit’s illustrious ODI career so far has been garlanded with 30 centuries, which places him at the third spot in the list of players with most hundreds in the format. In front of him are the other two batting legends in Virat Kohli (46) and Sachin Tendulkar (49). Rohit Sharma double century list Rohit Sharma had become only the third batter in men’s ODI Cricket, behind Sachin Tendulkar and Virender Sehwag to smash a double hundred in the format, in 2013. He achieved the milestone in November 2013 against the Aussies, at the M Chinnaswamy Stadium in Bengaluru, where he scored 209 runs off mere 158 deliveries, with the help of 12 Fours and 16 Sixes. He then created history by smashing the highest individual score in ODIs, when he played the aforementioned innings at Eden Gardens in 2014. However, three years later in December 2017, he became the first and only player till date to smash three ODI double hundreds when he yet again hammered Sri Lanka, in Mohali this time around. With the help of 13 Fours and 12 Sixes, he remained unbeaten on 208* off mere 153 deliveries. In fact, no player has managed to hit more than one ODI double century till date. Apart from Rohit, Sachin Tendulkar, Virender Sehwag, Ishan Kishan, Shubman Gill, Martin Guptill, Chris Gayle, and Fakhar Zaman have hit a double century each in the format. Rohit Sharma century list in ODI cricket Runs Balls faced Opposition Venue Match date 264 173 v Sri Lanka Eden Gardens 13-Nov-14 209 158 v Australia Bengaluru 02-Nov-13 208* 153 v Sri Lanka Mohali 13-Dec-17 171* 163 v Australia Perth 12-Jan-16 162 137 v West Indies Brabourne 29-Oct-18 159 138 v West Indies Visakhapatnam 18-Dec-19 152* 117 v West Indies Guwahati 21-Oct-18 150 133 v South Africa Kanpur 11-Oct-15 147 138 v New Zealand Kanpur 29-Oct-17 141* 123 v Australia Jaipur 16-Oct-13 140 113 v Pakistan Manchester 16-Jun-19 138 139 v Australia Melbourne 18-Jan-15 137* 114 v England Nottingham 12-Jul-18 137 126 v Bangladesh Melbourne 19-Mar-15 133 129 v Australia Sydney 12-Jan-19 125 109 v Australia Nagpur 01-Oct-17 124* 145 v Sri Lanka Pallekele 27-Aug-17 124 127 v Australia Brisbane 15-Jan-16 123* 129 v Bangladesh Birmingham 15-Jun-17 122* 144 v South Africa Southampton 05-Jun-19 119 128 v Australia Bengaluru 19-Jan-20 115 126 v South Africa Gqeberha 13-Feb-18 114 119 v Zimbabwe Bulawayo 28-May-10 111* 119 v Pakistan Dubai (DSC) 23-Sep-18 104 88 v Sri Lanka Colombo (RPS) 31-Aug-17 104 92 v Bangladesh Birmingham 02-Jul-19 103 94 v Sri Lanka Leeds 06-Jul-19 102 109 v England Birmingham 30-Jun-19 101* 100 v Sri Lanka Bulawayo 30-May-10 101 85 v New Zealand Indore 24-Jan-23   The post Rohit Sharma double century list: Rohit Sharma century list in ODI cricket appeared first on The SportsRush.","pubDate":"2023-03-22 19:25:28","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"IND vs AUS: गया नंबर वन का ताज भारत, बड़े-बड़े नाम नहीं आए काम, ODI रैंकिंग में फिसला भारत","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-slips-from-number-one-odi-spot-ausrtalia-tops-ranking/articleshow/98922858.cms","keywords":null,"creator":null,"video_url":null,"description":"Australia beat India: स्टीव स्मिथ की ऑस्ट्रेलिया से तीन मैच की श्रृंखला 1-2 से हारने के बाद भारतीय टीम वनडे रैंकिंग में अपना नंबर-1 स्थान खो दिया है। चेन्नई के एमए चिदंबरम स्टेडियम में भारतीय टीम ने तीसरा और आखिरी मैच 21 रन से गंवाया।","content":"पिछले चार साल में घरेलू मैदान पर सारे फॉर्मेट्स में 26 सीरीज जीतने के बाद भारतीय टीम को पहली बार हार का सामना करना पड़ा है। ऑस्ट्रेलिया ने तीन मैच की वनडे सीरीज में बीती रात भारत को 2-1 से हरा दिया। एमए चिदंबरम स्टेडियम में 270 रन के लक्ष्य के जवाब में भारतीय शेर 248 रन पर ही सिमट गए। शुरुआती दो मैच में मिचेल स्टार्क की रफ्तार और स्विंग से पस्त होने के बाद निर्णायक मुकाबले में एश्टन एगर (चार विकेट) और एडम जाम्पा (दो विकेट) ने घरेलू सरजमीं पर भारत की लगातार सीरीज जीत के अभियान पर ब्रेक लगा दिया। भारत पर 21 रन की जीत के साथ ऑस्ट्रेलिया ने वनडे इंटरनेशनल रैंकिंग्स में पहला स्थान भी हासिल कर लिया। भारतीय टीम दूसरे स्थान पर खिसक गई। भारतीय टीम इसी साल जनवरी में न्यूजीलैंड को घर पर 3-0 से हराकर नंबर 1 बनी थी, इसके बाद, दबदबा जारी रखने के लिए श्रीलंका को 3-0 से हराया था। भारत ने लगातार आठवां वनडे भी जीता और इस साल के अंत में खेले जाने वाले विश्व कप से पहले अच्छी स्थिति में दिख रहा था। हालांकि, ऑस्ट्रेलियाई टीम ने वाइजैग और चेन्नई में लगातार दूसरे और तीसरे वनडे को जीतकर नंबर वन पोजिशन से हमें बेदखल कर दिया। भारत-ऑस्ट्रेलिया दोनों ओर के ओपनर्स ने तेज शुरुआत दी। ऑस्ट्रेलिया ने टॉस जीतकर बल्लेबाजी का फैसला किया जिसके बाद मिचेल मार्श (47 गेंद में 47 रन) और ट्रेविस हेड (31 गेंद में 33 रन) ने पहले विकेट के लिए 10.5 ओवर्स में 68 रन जोड़कर इसे सही साबित किया। टारगेट का पीछा करने उतरी भारतीय टीम को कप्तान रोहित शर्मा (30 रन, 17 गेंद) और शुभमान गिल (37 रन, 49 गेंद) ने भी तेज शुरुआत दी। दोनों ने पहले विकेट के लिए 9.1 ओवर में 65 रन जोड़े। हालांकि, इसके बाद विराट कोहली (54 रन, 72 गेंद), केएल राहुल (32 गेंद, 50 गेंद) और हार्दिक पंड्या (40 रन, 40 गेंद) ही क्रीज पर डट सके। वैसे इनमें से कोई दबदबे वाला खेल नहीं दिखा सका। हार्दिक पंड्या के शानदार शुरुआती स्पेल और कुलदीप यादव की फिरकी ने ऑस्ट्रेलियाई बल्लेबाजों पर लगाम कसी, लेकिन उसके पुछल्ले बल्लेबाजों ने 49 ओवर में सिमटने से पहले 269 रन का चुनौतीपूर्ण स्कोर खड़ा करने में मदद की। हार्दिक ने टॉप ऑर्डर के बल्लेबाजों को आउट किया तो कुलदीप ने चेन्नई की मददगार पिच पर ऐसी शानदार गेंद पर एलेक्स कैरी को आउट किया जो ‘बॉल ऑफ द सीरीज’ रही। बाएं हाथ के कलाई के स्पिनर कुलदीप की लेग ब्रेक गेंद पर कैरी चकमा खाकर बोल्ड हुए और इस भारतीय गेंदबाज की खुशी का ठिकाना नहीं रहा। ऑस्ट्रेलिया का स्कोर पांच विकेट पर 138 रन था, लेकिन कैरी और मार्क स्टोइनिस (25) के बीच छठे विकेट के लिए 58 रन की साझेदारी तथा शॉन एबॉट (26) और एश्टन एगर (17) के बीच आठवें विकेट के लिए 42 रन की साझेदारी से मेहमान टीम ने दबदबा बनाया। फिर मिचेल स्टार्क और एडम जाम्पा ने अंतिम विकेट के लिए महत्वपूर्ण 22 रन जोड़े।","pubDate":"2023-03-22 18:29:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: सीरीज हार के बाद क्या बोले कप्तान रोहित, लगा दी सभी की क्लास!","link":"https://www.indiatv.in/sports/cricket/ind-vs-aus-3rd-odi-rohit-sharma-was-unhappy-with-batting-performance-of-team-india-against-australia-2023-03-22-944239","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: ऑस्ट्रेलिया के खिलाफ वनडे सीरीज के अंतिम मुकाबले में मिली हार के बाद कप्तान रोहित शर्मा टीम के इन खिलाड़ियों के प्रदर्शन से निराश नजर आए।","content":"भारत और ऑस्ट्रेलिया के बीच खेले गए तीन मैचों की वनडे सीरीज में टीम इंडिया को 2-1 से हार का सामना करना पड़ा है। भारतीय टीम को इस सीरीज के तीसरे मुकाबले में ऑस्ट्रेलिया ने 21 रनों से हार दिया। इसी के साथ घर में भारतीय टीम ने 4 साल के बाद कोई सीरीज गंवाई। सीरीज के अंतिम मुकाबले में मिली हार के बाद टीम इंडिया के कप्तान रोहित शर्मा ने अपनी बल्लेबाजी को जिम्मेदार ठहराया। मैच के बाद रोहित ने साफ कहा कि उनकी टीम ने अच्छी बल्लेबाजी नहीं की। ऑस्ट्रेलिया के खिलाफ मिली हार के बाद कप्तान रोहित ने कहा कि ‘‘मुझे नहीं लगता कि लक्ष्य बड़ा था। विकेट दूसरी पारी में हालांकि थोड़ी चुनौतीपूर्ण हो गई थी। पर मुझे नहीं लगता कि हमने अच्छी बल्लेबाजी की। साझेदारियां महत्वपूर्ण होती हैं और आज हम इन्हें बनाने में असफल रहे।’’ उन्होंने कहा, ‘‘हम जिस तरह से आउट हुए, वह निराशाजनक रहा। हम इसी तरह के विकेट पर खेलते हुए बड़े हुए हैं। कभी कभार आपको खुद को मौका देना होता है।’’ रोहित ने कहा, ‘‘महत्वपूर्ण था कि एक बल्लेबाज अंत तक खेलता रहे। लेकिन हम सभी अपना सर्वश्रेष्ठ करने की कोशिश कर रहे थे। पर ऐसा हुआ नहीं। हमने जनवरी से नौ वनडे खेले हैं, हम उनसे काफी सकारात्मक चीजें ले सकते हैं। यह पूरी टीम की हार है।’’ कप्तान रोहित के इन बयानों से यह साफ लग रहा कि वह टीम इंडिया के बल्लेबाजी से खुश नहीं है। इसी साल भारत में वनडे वर्ल्ड कप खेला जाना है। ऐसे में टीम इंडिया का वनडे में ये हाल होना उनकी कमियों को दर्शाता है। एडम जम्पा ने 45 रन पर चार विकेट लेकर भारत के खिलाफ अपना सर्वश्रेष्ठ गेंदबाजी प्रदर्शन किया, उन्हें इस मैच में प्लेयर आफ द मैच चुना गया। जम्पा ने मैच के बाद कहा कि ‘‘मुझे यहां सफलता मिली है। यहां आकर खेलना बड़ी चुनौती है। एशटन एगर ने मैच का रूख बदल दिया।’’ वहीं मिचेल मार्श को ‘प्लेयर ऑफ द सीरीज’ चुना गया जिन्होंने तीन मैचों में 194 रन बनाए।","pubDate":"2023-03-22 18:25:09","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ICC ODI Rankings: सीरीज हारने के साथ ही भारत को हुआ बड़ा नुकसान, गंवा दिया नंबर-1 का ये ताज","link":"https://www.indiatv.in/sports/cricket/icc-odi-rankings-australia-become-number-1-team-india-on-2nd-position-loss-3rd-odi-cricket-team-2023-03-23-944263","keywords":null,"creator":null,"video_url":null,"description":"ICC ODI Rankings: भारतीय टीम को ऑस्ट्रेलिया के खिलाफ तीसरे वनडे मैच में 21 रनों से हार का सामना करना पड़ा। इसी के साथ भारत ने आईसीसी वनडे रैंकिंग में पहला स्थान गंवा दिया।","content":"तीसरे वनडे मैच में टीम इंडिया को ऑस्ट्रेलिया के खिलाफ 21 रनों से हार झेलनी पड़ी। इसी के साथ ऑस्ट्रेलिया ने वनडे सीरीज भी 2-1 से अपने नाम कर ली। भारत ने पहले वनडे में 5 विकेट से जीत हासिल की थी, लेकिन इसके बाद ऑस्ट्रेलियाई टीम ने सीरीज में धमाकेदार वापसी करते हुए दूसरा वनडे 10 विकेट और तीसरा वनडे 21 रनों से जीतकर सीरीज पर कब्जा कर लिया। तीसरे वनडे में भारतीय बल्लेबाज बुरी तरह से फ्लॉप रहे और बड़ी पारियां नहीं खेल पाए। तीसरा वनडे हारने के साथ ही भारत को ICC ODI रैंकिंग में तगड़ा झटका लगा है। ऑस्ट्रेलिया ने भारत के खिलाफ वनडे सीरीज 2-1 से जीतते ही आईसीसी वनडे रैंकिंग में पहला स्थान हासिल कर लिया है और भारतीय टीम दूसरे नंबर पर पहुंच गई है। तीसरे वनडे में 21 रनों की जीत के साथ ही ऑस्ट्रेलिया को फायदा हुआ है। उसके अब 113.286 रेटिंग अंक हैं। वहीं, भारत के 112.638 रेटिंग अंक हैं। तीसरे वनडे मैच से पहले भारत के 114 रेटिंग अंक थे। वहीं, ऑस्ट्रेलियाई टीम के 112 रेटिंग अंक थे। तीसरे वनडे मैच में ऑस्ट्रेलिया के कप्तान स्टीव स्मिथ ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया। भारत को जीतने के लिए ऑस्ट्रेलिया ने 269 रनों का टारगेट दिया, जिसे टीम इंडिया हासिल नहीं कर पाई और मुकाबला 21 रनों से गंवा दिया। भारत के लिए हार्दिक पांड्या और कुलदीप यादव ने 3-3 विकेट चटकाए। ऑस्ट्रेलिया के लिए सबसे ज्यादा मिचेल मार्श ने बनाए। उन्होंने 47 रनों की पारी खेली। भारत के लिए शुभमन गिल और रोहित शर्मा ने शानदार शुरुआत की, लेकिन वह इसे बड़ी पारी में तब्दील नहीं कर पाए। रोहित शर्मा ने 30 रन बनाए। वहीं, शुभमन गिल ने 37 रन जड़े। इसके बाद विराट कोहली और केएल राहुल ने टीम इंडिया को जीत की तरफ ले जाने की कोशिश की, लेकिन कोहली के आउट होते ही मैच ऑस्ट्रेलिया की तरफ झुक गया। कोहली ने 54 रन बनाए। वहीं, सूर्यकुमार यादव सीरीज के तीनों ही मैच में अपना खाता तक नहीं खोल पाए। हार्दिक पांड्या ने 40 रन बनाए, लेकिन वह भी टीम इंडिया को जीत नहीं दिला पाए। 2-1 बनाम ऑस्ट्रेलिया, 2023 3-2 बनाम ऑस्ट्रेलिया, 2019 3-2 बनाम दक्षिण अफ्रीका, 2015 2-1 बनाम पाकिस्तान, 2012/13 4-2 बनाम ऑस्ट्रेलिया, 2009","pubDate":"2023-03-23 01:38:37","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shadab says Saim is a player of Babar’s category","link":"https://www.nation.com.pk/23-Mar-2023/shadab-says-saim-is-a-player-of-babar-s-category","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan T20I captain Shadab Khan has backed young and talented Saim Ayub, saying he is excited to play alongside the youngster during the upcoming T20I series against Afghanistan.","content":"LAHORE - Pakistan T20I captain Shadab Khan has backed young and talented Saim Ayub, saying he is excited to play alongside the youngster during the upcoming T20I series against Afghanistan. Speaking on the Pakistan Cricket Board (PCB) podcast, Shadab said that the players like Saim, Babar, and Abdullah Shafique always look special when they play. “I think Saim is an exceptional talent. After a very long time, we have got a player like him who we can say is as stylish and good as Babar and Abdullah,” said Shadab and added: “The way Saim plays, he is a player of Babar’s category. Players like them are too good to watch even when they score runs against your team. They are too stylish batters.” Saim opened innings alongside skipper Babar for Peshawar Zalmi in recently-concluded Pakistan Super League (PSL) 2023. His stylish batting and consistency made him a solid candidate for the Pakistan team’s call-up. The left-handed batter, who scored 341 runs in 12 matches in PSL 8, was named in Pakistan’s squad against Afghanistan in threematch T20I series. The T20 skipper also urged the fans to support youngsters during the Afghanistan series. Shadab said he is excited to lead a young and energetic squad. “A dream for any Pakistani to captain the national cricket team. Can’t thank Allah enough. Really excited to lead this young team, loads of talent. We will try to play aggressive and progressive cricket. Remember to back the youngsters, they are our future,” he tweeted. The PCB has given rest to its main players including captain Babar, Shaheen Shah Afridi, Haris Rauf, Muhammad Rizwan, and Fakhar Zaman. Shadab, the team’s vice-captain in whiteball format, will lead the squad in the absence of Babar Azam. The youngsters including Saim Ayub, Azam Khan, Ihsanullah and Zaman Khan, who performed well in the PSL 8, have made it into the national squad for Afghanistan series. PAKISTAN T20I SQUAD: Shadab Khan (c), Abdullah Shafique, Azam Khan, Faheem Ashraf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Wasim Jr, Naseem Shah, Saim Ayub, Shan Masood, Tayyab Tahir, Zaman Khan.","pubDate":"2023-03-22 23:52:47","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/shadab-says-saim-is-a-player-of-babar-s-category-1679529163-3487.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Lahore Qalandars pace up preparations for hockey league","link":"https://www.nation.com.pk/23-Mar-2023/lahore-qalandars-pace-up-preparations-for-hockey-league","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - The PSL 8 champions Lahore Qalandars are now focused to promote hockey in Pakistan as they have paced up the preparations to host the first-ever Professional Hockey League.","content":"LAHORE - The PSL 8 champions Lahore Qalandars are now focused to promote hockey in Pakistan as they have paced up the preparations to host the first-ever Professional Hockey League. Qalandars’ owners Atif Rana and Sameen Rana alongside Director Aqib Javed met Pakistan Hockey Federation (PHF) Secretary Haider Hussain and former Olympian Shahbaz Senior at their office. During the meeting, the hockey league was on top of the discussion. Qalandars’ high-ups shared their plan of introducing a players’ development program in hockey. The Qalandars owners want to work for hockey in the way they did for cricket. After seven years of hard work, Qalandars bagged back-to-back PSL titles. They became the first-ever team in PSL’s history to defend their title. Shahbaz Senior praised Qalandars’ initiative to lift hockey. “It’s heartening to see someone taking an initiative for hockey,” he said. “They can do it because they have built their reputation in cricket. People know them and trust them. I think if they work with honesty, they will be able to grow hockey just like they did in cricket,” he said and added: “Hockey is not famous among our youth. We need to promote it in a way that attracts our youngsters as this is the only way to revive the national game.” Qalandars took an initiative to hold open trials in Karachi and Lahore. During the PSL 8, Shaheen Afridi and the company reached Karachi Hockey Association (KHA) ground to watch the trials. Hundreds of kids appeared in the trials at KHA. Trials in Lahore will take place later on. After the trials, Qalandars will host a hockey series between the teams of Karachi and Lahore. Shaheen will be the ambassador of Karachi whereas Haris Rauf will be in the camp of Lahore.","pubDate":"2023-03-22 23:49:39","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/lahore-qalandars-pace-up-preparations-for-hockey-league-1679528964-5946.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Sindh Bank crowned champions","link":"https://www.nation.com.pk/23-Mar-2023/sindh-bank-crowned-championsv","keywords":["Sports, Newspaper"],"creator":["PR"],"video_url":null,"description":"KARACHI - Sindh Bank was crowned champions after beating State Bank of Pakistan (SBP) by 5 wickets in the finals of the 19th Governor Cup 2023 Inter-Bank Regional Cricket Tournament of Karachi Region held at the SBP Sports Complex.","content":"KARACHI - Sindh Bank was crowned champions after beating State Bank of Pakistan (SBP) by 5 wickets in the finals of the 19th Governor Cup 2023 Inter-Bank Regional Cricket Tournament of Karachi Region held at the SBP Sports Complex. The event was organized by SBP where 16 teams took part. Sindh Bank won all the three league matches and qualified for the quarterfinals and won from HBL by 7 wickets. Sindh Bank won by 5 wickets from Bank Al Habib in the semifinals and then qualified for the final, where they outplayed SBP to win the title. Syed Samar Husnain, Executive Director SBP, Development Finance Group, was the chief guest at prize distribution ceremony and gave away prizes to the winners. Other notables present there were Test cricketer Sarfaraz Ahmad, Sindh Bank President &CEO Imran Samad and Head of HR Baqir Hussain.","pubDate":"2023-03-22 23:47:19","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/sindh-bank-crowned-championsv-1679528824-3869.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Cricket: Matt Rowe bowls the perfect over in Palmerston North v Rotorua schoolboy cricket match","link":"https://www.nzherald.co.nz/bay-of-plenty-times/news/cricket-matt-rowe-bowls-the-perfect-over-in-palmerston-north-v-rotorua-schoolboy-cricket-match/X5EUQL4WZNEWNCZGNB2IXVN2ZE/","keywords":null,"creator":null,"video_url":null,"description":"'It was a bit crazy to be honest'.","content":"By RNZ A perfect over in cricket is almost unheard of - a holy grail bowlers don’t even think about searching for, it’s so unlikely to happen. And yet Palmerston North Boys’ High School 1st XI bowler Matt Rowe has achieved the feat, taking all six wickets in the fifth over against Rotorua Boys High School yesterday. The Year 13 student, who has been invited to camp with the New Zealand Under-19 side, ended with match figures of 9-12 from his six overs, including his incredible fifth over in which a wicket fell for every ball. Advertisement Advertise with NZME. “It was a bit crazy to be honest,” Rowe said. “Total disbelief.” The moment Palmerston North Boys’ Matt Rowe got 6 wickets in an over vs Rotorua Boys 🔥 @mattrowe_7 🎥 Tim Clarke Posted by The Legend of Marty Banks on Tuesday, March 21, 2023 Needing a thumping win to make the Super 8 tournament final in Tauranga, Rowe wasted no time giving his team a good start. He had his first wicket in his first over, but had to wait until the match’s ninth over, his fifth, for the fireworks to happen. “I can remember the first couple well,” he said. “First ball he snicked off to a fairly regulation catch at second slip. Advertisement Advertise with NZME. “And then, I hit the poles for the rest of them. Four clean bowled, and the last one was an LBW.” Having had a hat-trick before - three wickets in three balls - Rowe wasn’t too fazed when that milestone approached. “The umpire - I was talking to him a bit - said ‘I haven’t seen many hat-tricks in my time’. “I thought, oh I’ll see if I can make it happen for the umpire. That was just the start.” So how did Rowe feel after his fourth wicket? “I was sort of like, oh, this is getting a bit serious actually.” After five? “Surprise. I was really surprised. I didn’t expect it to happen.” Not a bad spell… Posted by The Alternative Commentary Collective on Tuesday, March 21, 2023 And the sixth? “Total disbelief. The boys were all getting around me, it was crazy, to be honest. They were going mental, they were more amazed than I was.” Advertisement Advertise with NZME. After bowling six overs in his spell of 9-12, the game ended on a run-out. Rowe said it was a good way to finish, despite being agonisingly close to a 10-wicket haul. “I was being too greedy anyway,” he said. “It was good for the boys to get a run-out.” Rotorua Boys were bowled out for 26, and Palmerston North Boys chased the total in just 2.1 overs. Coach Scott Davidson said it was an unbelievable display. “When he knocked the first couple over I was thinking this is great for the team that we’re not going to have to chase too many,” Davidson said. Advertisement Advertise with NZME. “I’ve played a lot of cricket, and my manager has been around cricket for a long time, and we just couldn’t believe what we were seeing. “With every wicket that came the boys were getting more excited, but thankfully Rowey was pretty concentrated on what he had to do and he executed.” Palmerston North Boys’ High School play Tauranga Boys’ High School today in the final of the Super 8 tournament in Tauranga. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-03-22 20:38:42","image_url":"https://www.nzherald.co.nz/resizer/dVuT888af6xAgMQKELd56NgKO1s=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/5QLEXPZBHRESNLO6YT2X7C6CMQ.png","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"India’s Suryakumar Yadav out for three golden ducks in three games as Australia ends India’s four-year streak","link":"https://www.nzherald.co.nz/sport/embarrassing-act-as-aussies-stun-cricket-world-end-indias-four-year-streak/RGDERLCEDJHIFP4X7KVMKUEJTQ/","keywords":null,"creator":null,"video_url":null,"description":"An Indian star claimed an unwanted piece of history.","content":"Australia has finished its tour of India in stunning fashion, reclaiming the world No. 1 ranking with a 21-run win in the third ODI. Spinners Adam Zampa and Ashton Agar turned the decider in Chennai to hand India their first series defeat at home since an Usman Khawaja-led Aussie victory in 2019. After bowling the visitors out for 269 in 49 overs, the hosts had the match in hand with Virat Kohli and Hardik Pandya at the crease at 4/185, needing less than a run a ball to claim victory. But a double strike from Agar turned the match. First he removed in-form Kohli (54) before the world’s top-rated Twenty20 batter Suryakumar Yadav strolled to the crease with huge pressure on his place in the side. Advertisement Advertise with NZME. Yadav had been trabbed LBW by Mitchell Starc with the first balls he faced in the first and second ODIs — and in embarrassing scenes was unable to avoid the same fate as Agar struck immediately. Suryakumar Yadav didn’t put bat on the ball in the entire series. Three Golden Ducks in three games - LBW twice and bowled once. #IndvAus — Mazher Arshad (@MazherArshad) March 22, 2023 Mitchell Marsh’s 47 runs and Alex Carey’s 38 runs had carried Australia to a par score of 269 runs (49 overs). In reply, India was bowled out for 248 runs (49.1 overs) with Virat Kohli’s half-century going in vain. The visitors won the series 2-1 after dropping the first match. Marsh was named player of the series for scoring 194 runs in three innings. “It is just natural aggression when I am batting. I have thoroughly enjoyed it,” Marsh said, “I was really glad to come in and perform, as I am coming off an extended break.” Advertisement Advertise with NZME. After winning the toss and opting to bat, Australia sped off to a good start with Marsh and Travis Head (33) putting on 68 runs off 65 balls. Indian pacers Mohammed Shami and Mohammed Siraj struggled with the new ball, but Hardik Pandya took 3-44 in eight overs to bring India back into the game. First, Pandya had Head caught at square leg and three balls later Steve Smith was caught behind for duck. Australia was down to 85-3 within 3.4 overs when Pandya also trapped Marsh lbw. Wrist spinner Kuldeep Yadav picked up 3-56, dismissing both David Warner (23) and Marnus Labuschagne (28) as Australia was reduced to 138-5 in 28.1 overs. Warner, who came in at number four, added 40 runs with Labuschagne for the fourth wicket before the duo fell in the space of four overs. Carey held the lower order together as he stitched a 58-run partnership with Marcus Stoinis (25). While the latter was out caught off Axar Patel (2-57) in the 37th over, Yadav bowled Carey to make it 203-7 in the 39th. Australia’s tail wagged hard enough to add 66 runs for the final three wickets, which proved vital. Sean Abbott scored 26 off 23 balls, with Ashton Agar scoring 17 runs. Mitchell Starc and Zampa added 10 runs each to push Australia to a challenging total. India’s chase began on a positive note with openers Rohit Sharma and Shubman Gill adding 65 runs off 55 balls. But the duo fell within a space of 19 balls to leave India at 77-2. Sharma was caught off Abbott after scoring 30 off 17 balls, while Zampa picked his first of the night, trapping Gill lbw for 37 off 49 balls. Advertisement Advertise with NZME. Kohli spearheaded the chase thereafter scoring a sedate 54 off 72 balls, including two fours and a six. He added 69 runs for the third wicket with Lockesh Rahul (32), before the latter holed out off Zampa, who has his best figures on Indian soil. India went from 146-3 to 151-4, as Patel (2) was run-out after a mix-up with Kohli, who had reached his 64th ODI half-century off 61 balls. He added 34 runs with Pandya but the turning point came in the 36th over when Kohli was caught at long off. Zampa returned to dismiss Pandya, who scored 40 off 40 balls, and Ravindra Jadeja (18) as India lost its first bilateral home ODI series since 2019. The leg spinner was named player of the match. “I have had some success in India,” Zampa said. “It is a tough place to come and always a huge challenge to play here. I don’t think I deserve this tonight, kudos to the guys who bowled before me. We had trust in our process and in our game plan.” Advertisement Advertise with NZME. Australia was also the last team to win an ODI series here, and in this duration, India had won seven consecutive bilateral contests at home. India had won the first ODI by five wickets, and Australia had bounced back with a 10-wicket win. “I don’t think it was too many runs,” said Sharma, the Indian skipper. “The wicket was challenging in the second innings but we didn’t bat well enough. We failed to put up partnerships today. We will play a World Cup in these conditions in six months’ time and we need to improve.” News.com.au/AP Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-03-22 20:02:09","image_url":"https://www.nzherald.co.nz/resizer/vAPowk5LuB5Q0gTopKJpuThQT6g=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/3ZR2ZSFZIRD7ZPFNBPOU3U2Q3E.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Si Ferry to depart Open Goal Broomhill at end of season","link":"https://www.heraldscotland.com/sport/23405929.si-ferry-depart-open-goal-broomhill-end-season/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The partnership between the Lowland League club and the podcast will conclude at the end of the season.","content":"Open Goal and Broomhill are set to bring their partnership to an end with head coach Si Ferry preparing to depart the club at the end of the season. The Scottish football podcast, presented by Ferry, struck a deal with the Lowland League club that saw the former Celtic, Dundee and Swindon Town midfielder take charge of the first team, while a fly-on-the-wall documentary was shot that would chart the team’s progression. The club changed its name to Open Goal Broomhill FC as part of the project but it will conclude after one season with Ferry set to leave at the end of the current campaign. Ferry was joined at the club, who play their home matches at Broadwood Stadium, by podcast co-host Paul Slane as well as a host of recently professional players such as Kirk Broadfoot, Gary Fraser, Derek Lyle and Ryan Conroy. READ MORE: From podcast to pitchside: Si Ferry on leading Open Goal Broomhill into Scottish Cup Herald and Times Sport understands that the players were informed of the decision on Tuesday at a team meeting. Open Goal Broomhill currently occupy 13th place in the 19-team Lowland League with five games left to play this season. New episodes of the behind-the-scenes documentary, ‘Crossing The Line’, are published weekly on YouTube. At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football, golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this exclusive bespoke piece sent directly to your email inbox for free every day at 5pm, simply take a few seconds to type in your email here . It's that simple!","pubDate":"2023-03-22 19:40:49","image_url":"https://www.heraldscotland.com/resources/images/16587359/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Rohit Sharma double century list: Rohit Sharma century list in ODI cricket","link":"https://thesportsrush.com/cricket-news-rohit-sharma-double-century-list-rohit-sharma-century-list-in-odi-cricket/","keywords":["Cricket","Rohit Sharma"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Despite considering how batters have been playing some outrageous innings these days with the help of some jaw-dropping shots, no score (individual or team) is considered insurmountable in White Ball Cricket. Having said that, Rohit Sharma‘s double century innings – 264 off 173 deliveries against Sri Lanka at Eden Gardens in November 2014, is one… The post Rohit Sharma double century list: Rohit Sharma century list in ODI cricket appeared first on The SportsRush.","content":"Despite considering how batters have been playing some outrageous innings these days with the help of some jaw-dropping shots, no score (individual or team) is considered insurmountable in White Ball Cricket. Having said that, Rohit Sharma‘s double century innings – 264 off 173 deliveries against Sri Lanka at Eden Gardens in November 2014, is one such knock for the ages which certainly seems nearly impossible to breach in ODI Cricket. Rohit’s illustrious ODI career so far has been garlanded with 30 centuries, which places him at the third spot in the list of players with most hundreds in the format. In front of him are the other two batting legends in Virat Kohli (46) and Sachin Tendulkar (49). Rohit Sharma double century list Rohit Sharma had become only the third batter in men’s ODI Cricket, behind Sachin Tendulkar and Virender Sehwag to smash a double hundred in the format, in 2013. He achieved the milestone in November 2013 against the Aussies, at the M Chinnaswamy Stadium in Bengaluru, where he scored 209 runs off mere 158 deliveries, with the help of 12 Fours and 16 Sixes. He then created history by smashing the highest individual score in ODIs, when he played the aforementioned innings at Eden Gardens in 2014. However, three years later in December 2017, he became the first and only player till date to smash three ODI double hundreds when he yet again hammered Sri Lanka, in Mohali this time around. With the help of 13 Fours and 12 Sixes, he remained unbeaten on 208* off mere 153 deliveries. In fact, no player has managed to hit more than one ODI double century till date. Apart from Rohit, Sachin Tendulkar, Virender Sehwag, Ishan Kishan, Shubman Gill, Martin Guptill, Chris Gayle, and Fakhar Zaman have hit a double century each in the format. Rohit Sharma century list in ODI cricket Runs Balls faced Opposition Venue Match date 264 173 v Sri Lanka Eden Gardens 13-Nov-14 209 158 v Australia Bengaluru 02-Nov-13 208* 153 v Sri Lanka Mohali 13-Dec-17 171* 163 v Australia Perth 12-Jan-16 162 137 v West Indies Brabourne 29-Oct-18 159 138 v West Indies Visakhapatnam 18-Dec-19 152* 117 v West Indies Guwahati 21-Oct-18 150 133 v South Africa Kanpur 11-Oct-15 147 138 v New Zealand Kanpur 29-Oct-17 141* 123 v Australia Jaipur 16-Oct-13 140 113 v Pakistan Manchester 16-Jun-19 138 139 v Australia Melbourne 18-Jan-15 137* 114 v England Nottingham 12-Jul-18 137 126 v Bangladesh Melbourne 19-Mar-15 133 129 v Australia Sydney 12-Jan-19 125 109 v Australia Nagpur 01-Oct-17 124* 145 v Sri Lanka Pallekele 27-Aug-17 124 127 v Australia Brisbane 15-Jan-16 123* 129 v Bangladesh Birmingham 15-Jun-17 122* 144 v South Africa Southampton 05-Jun-19 119 128 v Australia Bengaluru 19-Jan-20 115 126 v South Africa Gqeberha 13-Feb-18 114 119 v Zimbabwe Bulawayo 28-May-10 111* 119 v Pakistan Dubai (DSC) 23-Sep-18 104 88 v Sri Lanka Colombo (RPS) 31-Aug-17 104 92 v Bangladesh Birmingham 02-Jul-19 103 94 v Sri Lanka Leeds 06-Jul-19 102 109 v England Birmingham 30-Jun-19 101* 100 v Sri Lanka Bulawayo 30-May-10 101 85 v New Zealand Indore 24-Jan-23   The post Rohit Sharma double century list: Rohit Sharma century list in ODI cricket appeared first on The SportsRush.","pubDate":"2023-03-22 19:25:28","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"IND vs AUS: गया नंबर वन का ताज भारत, बड़े-बड़े नाम नहीं आए काम, ODI रैंकिंग में फिसला भारत","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-slips-from-number-one-odi-spot-ausrtalia-tops-ranking/articleshow/98922858.cms","keywords":null,"creator":null,"video_url":null,"description":"Australia beat India: स्टीव स्मिथ की ऑस्ट्रेलिया से तीन मैच की श्रृंखला 1-2 से हारने के बाद भारतीय टीम वनडे रैंकिंग में अपना नंबर-1 स्थान खो दिया है। चेन्नई के एमए चिदंबरम स्टेडियम में भारतीय टीम ने तीसरा और आखिरी मैच 21 रन से गंवाया।","content":"पिछले चार साल में घरेलू मैदान पर सारे फॉर्मेट्स में 26 सीरीज जीतने के बाद भारतीय टीम को पहली बार हार का सामना करना पड़ा है। ऑस्ट्रेलिया ने तीन मैच की वनडे सीरीज में बीती रात भारत को 2-1 से हरा दिया। एमए चिदंबरम स्टेडियम में 270 रन के लक्ष्य के जवाब में भारतीय शेर 248 रन पर ही सिमट गए। शुरुआती दो मैच में मिचेल स्टार्क की रफ्तार और स्विंग से पस्त होने के बाद निर्णायक मुकाबले में एश्टन एगर (चार विकेट) और एडम जाम्पा (दो विकेट) ने घरेलू सरजमीं पर भारत की लगातार सीरीज जीत के अभियान पर ब्रेक लगा दिया। भारत पर 21 रन की जीत के साथ ऑस्ट्रेलिया ने वनडे इंटरनेशनल रैंकिंग्स में पहला स्थान भी हासिल कर लिया। भारतीय टीम दूसरे स्थान पर खिसक गई। भारतीय टीम इसी साल जनवरी में न्यूजीलैंड को घर पर 3-0 से हराकर नंबर 1 बनी थी, इसके बाद, दबदबा जारी रखने के लिए श्रीलंका को 3-0 से हराया था। भारत ने लगातार आठवां वनडे भी जीता और इस साल के अंत में खेले जाने वाले विश्व कप से पहले अच्छी स्थिति में दिख रहा था। हालांकि, ऑस्ट्रेलियाई टीम ने वाइजैग और चेन्नई में लगातार दूसरे और तीसरे वनडे को जीतकर नंबर वन पोजिशन से हमें बेदखल कर दिया। भारत-ऑस्ट्रेलिया दोनों ओर के ओपनर्स ने तेज शुरुआत दी। ऑस्ट्रेलिया ने टॉस जीतकर बल्लेबाजी का फैसला किया जिसके बाद मिचेल मार्श (47 गेंद में 47 रन) और ट्रेविस हेड (31 गेंद में 33 रन) ने पहले विकेट के लिए 10.5 ओवर्स में 68 रन जोड़कर इसे सही साबित किया। टारगेट का पीछा करने उतरी भारतीय टीम को कप्तान रोहित शर्मा (30 रन, 17 गेंद) और शुभमान गिल (37 रन, 49 गेंद) ने भी तेज शुरुआत दी। दोनों ने पहले विकेट के लिए 9.1 ओवर में 65 रन जोड़े। हालांकि, इसके बाद विराट कोहली (54 रन, 72 गेंद), केएल राहुल (32 गेंद, 50 गेंद) और हार्दिक पंड्या (40 रन, 40 गेंद) ही क्रीज पर डट सके। वैसे इनमें से कोई दबदबे वाला खेल नहीं दिखा सका। हार्दिक पंड्या के शानदार शुरुआती स्पेल और कुलदीप यादव की फिरकी ने ऑस्ट्रेलियाई बल्लेबाजों पर लगाम कसी, लेकिन उसके पुछल्ले बल्लेबाजों ने 49 ओवर में सिमटने से पहले 269 रन का चुनौतीपूर्ण स्कोर खड़ा करने में मदद की। हार्दिक ने टॉप ऑर्डर के बल्लेबाजों को आउट किया तो कुलदीप ने चेन्नई की मददगार पिच पर ऐसी शानदार गेंद पर एलेक्स कैरी को आउट किया जो ‘बॉल ऑफ द सीरीज’ रही। बाएं हाथ के कलाई के स्पिनर कुलदीप की लेग ब्रेक गेंद पर कैरी चकमा खाकर बोल्ड हुए और इस भारतीय गेंदबाज की खुशी का ठिकाना नहीं रहा। ऑस्ट्रेलिया का स्कोर पांच विकेट पर 138 रन था, लेकिन कैरी और मार्क स्टोइनिस (25) के बीच छठे विकेट के लिए 58 रन की साझेदारी तथा शॉन एबॉट (26) और एश्टन एगर (17) के बीच आठवें विकेट के लिए 42 रन की साझेदारी से मेहमान टीम ने दबदबा बनाया। फिर मिचेल स्टार्क और एडम जाम्पा ने अंतिम विकेट के लिए महत्वपूर्ण 22 रन जोड़े।","pubDate":"2023-03-22 18:29:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: सीरीज हार के बाद क्या बोले कप्तान रोहित, लगा दी सभी की क्लास!","link":"https://www.indiatv.in/sports/cricket/ind-vs-aus-3rd-odi-rohit-sharma-was-unhappy-with-batting-performance-of-team-india-against-australia-2023-03-22-944239","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: ऑस्ट्रेलिया के खिलाफ वनडे सीरीज के अंतिम मुकाबले में मिली हार के बाद कप्तान रोहित शर्मा टीम के इन खिलाड़ियों के प्रदर्शन से निराश नजर आए।","content":"भारत और ऑस्ट्रेलिया के बीच खेले गए तीन मैचों की वनडे सीरीज में टीम इंडिया को 2-1 से हार का सामना करना पड़ा है। भारतीय टीम को इस सीरीज के तीसरे मुकाबले में ऑस्ट्रेलिया ने 21 रनों से हार दिया। इसी के साथ घर में भारतीय टीम ने 4 साल के बाद कोई सीरीज गंवाई। सीरीज के अंतिम मुकाबले में मिली हार के बाद टीम इंडिया के कप्तान रोहित शर्मा ने अपनी बल्लेबाजी को जिम्मेदार ठहराया। मैच के बाद रोहित ने साफ कहा कि उनकी टीम ने अच्छी बल्लेबाजी नहीं की। ऑस्ट्रेलिया के खिलाफ मिली हार के बाद कप्तान रोहित ने कहा कि ‘‘मुझे नहीं लगता कि लक्ष्य बड़ा था। विकेट दूसरी पारी में हालांकि थोड़ी चुनौतीपूर्ण हो गई थी। पर मुझे नहीं लगता कि हमने अच्छी बल्लेबाजी की। साझेदारियां महत्वपूर्ण होती हैं और आज हम इन्हें बनाने में असफल रहे।’’ उन्होंने कहा, ‘‘हम जिस तरह से आउट हुए, वह निराशाजनक रहा। हम इसी तरह के विकेट पर खेलते हुए बड़े हुए हैं। कभी कभार आपको खुद को मौका देना होता है।’’ रोहित ने कहा, ‘‘महत्वपूर्ण था कि एक बल्लेबाज अंत तक खेलता रहे। लेकिन हम सभी अपना सर्वश्रेष्ठ करने की कोशिश कर रहे थे। पर ऐसा हुआ नहीं। हमने जनवरी से नौ वनडे खेले हैं, हम उनसे काफी सकारात्मक चीजें ले सकते हैं। यह पूरी टीम की हार है।’’ कप्तान रोहित के इन बयानों से यह साफ लग रहा कि वह टीम इंडिया के बल्लेबाजी से खुश नहीं है। इसी साल भारत में वनडे वर्ल्ड कप खेला जाना है। ऐसे में टीम इंडिया का वनडे में ये हाल होना उनकी कमियों को दर्शाता है। एडम जम्पा ने 45 रन पर चार विकेट लेकर भारत के खिलाफ अपना सर्वश्रेष्ठ गेंदबाजी प्रदर्शन किया, उन्हें इस मैच में प्लेयर आफ द मैच चुना गया। जम्पा ने मैच के बाद कहा कि ‘‘मुझे यहां सफलता मिली है। यहां आकर खेलना बड़ी चुनौती है। एशटन एगर ने मैच का रूख बदल दिया।’’ वहीं मिचेल मार्श को ‘प्लेयर ऑफ द सीरीज’ चुना गया जिन्होंने तीन मैचों में 194 रन बनाए।","pubDate":"2023-03-22 18:25:09","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ICC ODI Rankings: सीरीज हारने के साथ ही भारत को हुआ बड़ा नुकसान, गंवा दिया नंबर-1 का ये ताज","link":"https://www.indiatv.in/sports/cricket/icc-odi-rankings-australia-become-number-1-team-india-on-2nd-position-loss-3rd-odi-cricket-team-2023-03-23-944263","keywords":null,"creator":null,"video_url":null,"description":"ICC ODI Rankings: भारतीय टीम को ऑस्ट्रेलिया के खिलाफ तीसरे वनडे मैच में 21 रनों से हार का सामना करना पड़ा। इसी के साथ भारत ने आईसीसी वनडे रैंकिंग में पहला स्थान गंवा दिया।","content":"तीसरे वनडे मैच में टीम इंडिया को ऑस्ट्रेलिया के खिलाफ 21 रनों से हार झेलनी पड़ी। इसी के साथ ऑस्ट्रेलिया ने वनडे सीरीज भी 2-1 से अपने नाम कर ली। भारत ने पहले वनडे में 5 विकेट से जीत हासिल की थी, लेकिन इसके बाद ऑस्ट्रेलियाई टीम ने सीरीज में धमाकेदार वापसी करते हुए दूसरा वनडे 10 विकेट और तीसरा वनडे 21 रनों से जीतकर सीरीज पर कब्जा कर लिया। तीसरे वनडे में भारतीय बल्लेबाज बुरी तरह से फ्लॉप रहे और बड़ी पारियां नहीं खेल पाए। तीसरा वनडे हारने के साथ ही भारत को ICC ODI रैंकिंग में तगड़ा झटका लगा है। ऑस्ट्रेलिया ने भारत के खिलाफ वनडे सीरीज 2-1 से जीतते ही आईसीसी वनडे रैंकिंग में पहला स्थान हासिल कर लिया है और भारतीय टीम दूसरे नंबर पर पहुंच गई है। तीसरे वनडे में 21 रनों की जीत के साथ ही ऑस्ट्रेलिया को फायदा हुआ है। उसके अब 113.286 रेटिंग अंक हैं। वहीं, भारत के 112.638 रेटिंग अंक हैं। तीसरे वनडे मैच से पहले भारत के 114 रेटिंग अंक थे। वहीं, ऑस्ट्रेलियाई टीम के 112 रेटिंग अंक थे। तीसरे वनडे मैच में ऑस्ट्रेलिया के कप्तान स्टीव स्मिथ ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया। भारत को जीतने के लिए ऑस्ट्रेलिया ने 269 रनों का टारगेट दिया, जिसे टीम इंडिया हासिल नहीं कर पाई और मुकाबला 21 रनों से गंवा दिया। भारत के लिए हार्दिक पांड्या और कुलदीप यादव ने 3-3 विकेट चटकाए। ऑस्ट्रेलिया के लिए सबसे ज्यादा मिचेल मार्श ने बनाए। उन्होंने 47 रनों की पारी खेली। भारत के लिए शुभमन गिल और रोहित शर्मा ने शानदार शुरुआत की, लेकिन वह इसे बड़ी पारी में तब्दील नहीं कर पाए। रोहित शर्मा ने 30 रन बनाए। वहीं, शुभमन गिल ने 37 रन जड़े। इसके बाद विराट कोहली और केएल राहुल ने टीम इंडिया को जीत की तरफ ले जाने की कोशिश की, लेकिन कोहली के आउट होते ही मैच ऑस्ट्रेलिया की तरफ झुक गया। कोहली ने 54 रन बनाए। वहीं, सूर्यकुमार यादव सीरीज के तीनों ही मैच में अपना खाता तक नहीं खोल पाए। हार्दिक पांड्या ने 40 रन बनाए, लेकिन वह भी टीम इंडिया को जीत नहीं दिला पाए। 2-1 बनाम ऑस्ट्रेलिया, 2023 3-2 बनाम ऑस्ट्रेलिया, 2019 3-2 बनाम दक्षिण अफ्रीका, 2015 2-1 बनाम पाकिस्तान, 2012/13 4-2 बनाम ऑस्ट्रेलिया, 2009","pubDate":"2023-03-23 01:38:37","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shadab says Saim is a player of Babar’s category","link":"https://www.nation.com.pk/23-Mar-2023/shadab-says-saim-is-a-player-of-babar-s-category","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan T20I captain Shadab Khan has backed young and talented Saim Ayub, saying he is excited to play alongside the youngster during the upcoming T20I series against Afghanistan.","content":"LAHORE - Pakistan T20I captain Shadab Khan has backed young and talented Saim Ayub, saying he is excited to play alongside the youngster during the upcoming T20I series against Afghanistan. Speaking on the Pakistan Cricket Board (PCB) podcast, Shadab said that the players like Saim, Babar, and Abdullah Shafique always look special when they play. “I think Saim is an exceptional talent. After a very long time, we have got a player like him who we can say is as stylish and good as Babar and Abdullah,” said Shadab and added: “The way Saim plays, he is a player of Babar’s category. Players like them are too good to watch even when they score runs against your team. They are too stylish batters.” Saim opened innings alongside skipper Babar for Peshawar Zalmi in recently-concluded Pakistan Super League (PSL) 2023. His stylish batting and consistency made him a solid candidate for the Pakistan team’s call-up. The left-handed batter, who scored 341 runs in 12 matches in PSL 8, was named in Pakistan’s squad against Afghanistan in threematch T20I series. The T20 skipper also urged the fans to support youngsters during the Afghanistan series. Shadab said he is excited to lead a young and energetic squad. “A dream for any Pakistani to captain the national cricket team. Can’t thank Allah enough. Really excited to lead this young team, loads of talent. We will try to play aggressive and progressive cricket. Remember to back the youngsters, they are our future,” he tweeted. The PCB has given rest to its main players including captain Babar, Shaheen Shah Afridi, Haris Rauf, Muhammad Rizwan, and Fakhar Zaman. Shadab, the team’s vice-captain in whiteball format, will lead the squad in the absence of Babar Azam. The youngsters including Saim Ayub, Azam Khan, Ihsanullah and Zaman Khan, who performed well in the PSL 8, have made it into the national squad for Afghanistan series. PAKISTAN T20I SQUAD: Shadab Khan (c), Abdullah Shafique, Azam Khan, Faheem Ashraf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Wasim Jr, Naseem Shah, Saim Ayub, Shan Masood, Tayyab Tahir, Zaman Khan.","pubDate":"2023-03-22 23:52:47","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/shadab-says-saim-is-a-player-of-babar-s-category-1679529163-3487.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Lahore Qalandars pace up preparations for hockey league","link":"https://www.nation.com.pk/23-Mar-2023/lahore-qalandars-pace-up-preparations-for-hockey-league","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - The PSL 8 champions Lahore Qalandars are now focused to promote hockey in Pakistan as they have paced up the preparations to host the first-ever Professional Hockey League.","content":"LAHORE - The PSL 8 champions Lahore Qalandars are now focused to promote hockey in Pakistan as they have paced up the preparations to host the first-ever Professional Hockey League. Qalandars’ owners Atif Rana and Sameen Rana alongside Director Aqib Javed met Pakistan Hockey Federation (PHF) Secretary Haider Hussain and former Olympian Shahbaz Senior at their office. During the meeting, the hockey league was on top of the discussion. Qalandars’ high-ups shared their plan of introducing a players’ development program in hockey. The Qalandars owners want to work for hockey in the way they did for cricket. After seven years of hard work, Qalandars bagged back-to-back PSL titles. They became the first-ever team in PSL’s history to defend their title. Shahbaz Senior praised Qalandars’ initiative to lift hockey. “It’s heartening to see someone taking an initiative for hockey,” he said. “They can do it because they have built their reputation in cricket. People know them and trust them. I think if they work with honesty, they will be able to grow hockey just like they did in cricket,” he said and added: “Hockey is not famous among our youth. We need to promote it in a way that attracts our youngsters as this is the only way to revive the national game.” Qalandars took an initiative to hold open trials in Karachi and Lahore. During the PSL 8, Shaheen Afridi and the company reached Karachi Hockey Association (KHA) ground to watch the trials. Hundreds of kids appeared in the trials at KHA. Trials in Lahore will take place later on. After the trials, Qalandars will host a hockey series between the teams of Karachi and Lahore. Shaheen will be the ambassador of Karachi whereas Haris Rauf will be in the camp of Lahore.","pubDate":"2023-03-22 23:49:39","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/lahore-qalandars-pace-up-preparations-for-hockey-league-1679528964-5946.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Sindh Bank crowned champions","link":"https://www.nation.com.pk/23-Mar-2023/sindh-bank-crowned-championsv","keywords":["Sports, Newspaper"],"creator":["PR"],"video_url":null,"description":"KARACHI - Sindh Bank was crowned champions after beating State Bank of Pakistan (SBP) by 5 wickets in the finals of the 19th Governor Cup 2023 Inter-Bank Regional Cricket Tournament of Karachi Region held at the SBP Sports Complex.","content":"KARACHI - Sindh Bank was crowned champions after beating State Bank of Pakistan (SBP) by 5 wickets in the finals of the 19th Governor Cup 2023 Inter-Bank Regional Cricket Tournament of Karachi Region held at the SBP Sports Complex. The event was organized by SBP where 16 teams took part. Sindh Bank won all the three league matches and qualified for the quarterfinals and won from HBL by 7 wickets. Sindh Bank won by 5 wickets from Bank Al Habib in the semifinals and then qualified for the final, where they outplayed SBP to win the title. Syed Samar Husnain, Executive Director SBP, Development Finance Group, was the chief guest at prize distribution ceremony and gave away prizes to the winners. Other notables present there were Test cricketer Sarfaraz Ahmad, Sindh Bank President &CEO Imran Samad and Head of HR Baqir Hussain.","pubDate":"2023-03-22 23:47:19","image_url":"https://www.nation.com.pk/print_images/large/2023-03-23/sindh-bank-crowned-championsv-1679528824-3869.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Cricket: Matt Rowe bowls the perfect over in Palmerston North v Rotorua schoolboy cricket match","link":"https://www.nzherald.co.nz/bay-of-plenty-times/news/cricket-matt-rowe-bowls-the-perfect-over-in-palmerston-north-v-rotorua-schoolboy-cricket-match/X5EUQL4WZNEWNCZGNB2IXVN2ZE/","keywords":null,"creator":null,"video_url":null,"description":"'It was a bit crazy to be honest'.","content":"By RNZ A perfect over in cricket is almost unheard of - a holy grail bowlers don’t even think about searching for, it’s so unlikely to happen. And yet Palmerston North Boys’ High School 1st XI bowler Matt Rowe has achieved the feat, taking all six wickets in the fifth over against Rotorua Boys High School yesterday. The Year 13 student, who has been invited to camp with the New Zealand Under-19 side, ended with match figures of 9-12 from his six overs, including his incredible fifth over in which a wicket fell for every ball. Advertisement Advertise with NZME. “It was a bit crazy to be honest,” Rowe said. “Total disbelief.” The moment Palmerston North Boys’ Matt Rowe got 6 wickets in an over vs Rotorua Boys 🔥 @mattrowe_7 🎥 Tim Clarke Posted by The Legend of Marty Banks on Tuesday, March 21, 2023 Needing a thumping win to make the Super 8 tournament final in Tauranga, Rowe wasted no time giving his team a good start. He had his first wicket in his first over, but had to wait until the match’s ninth over, his fifth, for the fireworks to happen. “I can remember the first couple well,” he said. “First ball he snicked off to a fairly regulation catch at second slip. Advertisement Advertise with NZME. “And then, I hit the poles for the rest of them. Four clean bowled, and the last one was an LBW.” Having had a hat-trick before - three wickets in three balls - Rowe wasn’t too fazed when that milestone approached. “The umpire - I was talking to him a bit - said ‘I haven’t seen many hat-tricks in my time’. “I thought, oh I’ll see if I can make it happen for the umpire. That was just the start.” So how did Rowe feel after his fourth wicket? “I was sort of like, oh, this is getting a bit serious actually.” After five? “Surprise. I was really surprised. I didn’t expect it to happen.” Not a bad spell… Posted by The Alternative Commentary Collective on Tuesday, March 21, 2023 And the sixth? “Total disbelief. The boys were all getting around me, it was crazy, to be honest. They were going mental, they were more amazed than I was.” Advertisement Advertise with NZME. After bowling six overs in his spell of 9-12, the game ended on a run-out. Rowe said it was a good way to finish, despite being agonisingly close to a 10-wicket haul. “I was being too greedy anyway,” he said. “It was good for the boys to get a run-out.” Rotorua Boys were bowled out for 26, and Palmerston North Boys chased the total in just 2.1 overs. Coach Scott Davidson said it was an unbelievable display. “When he knocked the first couple over I was thinking this is great for the team that we’re not going to have to chase too many,” Davidson said. Advertisement Advertise with NZME. “I’ve played a lot of cricket, and my manager has been around cricket for a long time, and we just couldn’t believe what we were seeing. “With every wicket that came the boys were getting more excited, but thankfully Rowey was pretty concentrated on what he had to do and he executed.” Palmerston North Boys’ High School play Tauranga Boys’ High School today in the final of the Super 8 tournament in Tauranga. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-03-22 20:38:42","image_url":"https://www.nzherald.co.nz/resizer/dVuT888af6xAgMQKELd56NgKO1s=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/5QLEXPZBHRESNLO6YT2X7C6CMQ.png","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"India’s Suryakumar Yadav out for three golden ducks in three games as Australia ends India’s four-year streak","link":"https://www.nzherald.co.nz/sport/embarrassing-act-as-aussies-stun-cricket-world-end-indias-four-year-streak/RGDERLCEDJHIFP4X7KVMKUEJTQ/","keywords":null,"creator":null,"video_url":null,"description":"An Indian star claimed an unwanted piece of history.","content":"Australia has finished its tour of India in stunning fashion, reclaiming the world No. 1 ranking with a 21-run win in the third ODI. Spinners Adam Zampa and Ashton Agar turned the decider in Chennai to hand India their first series defeat at home since an Usman Khawaja-led Aussie victory in 2019. After bowling the visitors out for 269 in 49 overs, the hosts had the match in hand with Virat Kohli and Hardik Pandya at the crease at 4/185, needing less than a run a ball to claim victory. But a double strike from Agar turned the match. First he removed in-form Kohli (54) before the world’s top-rated Twenty20 batter Suryakumar Yadav strolled to the crease with huge pressure on his place in the side. Advertisement Advertise with NZME. Yadav had been trabbed LBW by Mitchell Starc with the first balls he faced in the first and second ODIs — and in embarrassing scenes was unable to avoid the same fate as Agar struck immediately. Suryakumar Yadav didn’t put bat on the ball in the entire series. Three Golden Ducks in three games - LBW twice and bowled once. #IndvAus — Mazher Arshad (@MazherArshad) March 22, 2023 Mitchell Marsh’s 47 runs and Alex Carey’s 38 runs had carried Australia to a par score of 269 runs (49 overs). In reply, India was bowled out for 248 runs (49.1 overs) with Virat Kohli’s half-century going in vain. The visitors won the series 2-1 after dropping the first match. Marsh was named player of the series for scoring 194 runs in three innings. “It is just natural aggression when I am batting. I have thoroughly enjoyed it,” Marsh said, “I was really glad to come in and perform, as I am coming off an extended break.” Advertisement Advertise with NZME. After winning the toss and opting to bat, Australia sped off to a good start with Marsh and Travis Head (33) putting on 68 runs off 65 balls. Indian pacers Mohammed Shami and Mohammed Siraj struggled with the new ball, but Hardik Pandya took 3-44 in eight overs to bring India back into the game. First, Pandya had Head caught at square leg and three balls later Steve Smith was caught behind for duck. Australia was down to 85-3 within 3.4 overs when Pandya also trapped Marsh lbw. Wrist spinner Kuldeep Yadav picked up 3-56, dismissing both David Warner (23) and Marnus Labuschagne (28) as Australia was reduced to 138-5 in 28.1 overs. Warner, who came in at number four, added 40 runs with Labuschagne for the fourth wicket before the duo fell in the space of four overs. Carey held the lower order together as he stitched a 58-run partnership with Marcus Stoinis (25). While the latter was out caught off Axar Patel (2-57) in the 37th over, Yadav bowled Carey to make it 203-7 in the 39th. Australia’s tail wagged hard enough to add 66 runs for the final three wickets, which proved vital. Sean Abbott scored 26 off 23 balls, with Ashton Agar scoring 17 runs. Mitchell Starc and Zampa added 10 runs each to push Australia to a challenging total. India’s chase began on a positive note with openers Rohit Sharma and Shubman Gill adding 65 runs off 55 balls. But the duo fell within a space of 19 balls to leave India at 77-2. Sharma was caught off Abbott after scoring 30 off 17 balls, while Zampa picked his first of the night, trapping Gill lbw for 37 off 49 balls. Advertisement Advertise with NZME. Kohli spearheaded the chase thereafter scoring a sedate 54 off 72 balls, including two fours and a six. He added 69 runs for the third wicket with Lockesh Rahul (32), before the latter holed out off Zampa, who has his best figures on Indian soil. India went from 146-3 to 151-4, as Patel (2) was run-out after a mix-up with Kohli, who had reached his 64th ODI half-century off 61 balls. He added 34 runs with Pandya but the turning point came in the 36th over when Kohli was caught at long off. Zampa returned to dismiss Pandya, who scored 40 off 40 balls, and Ravindra Jadeja (18) as India lost its first bilateral home ODI series since 2019. The leg spinner was named player of the match. “I have had some success in India,” Zampa said. “It is a tough place to come and always a huge challenge to play here. I don’t think I deserve this tonight, kudos to the guys who bowled before me. We had trust in our process and in our game plan.” Advertisement Advertise with NZME. Australia was also the last team to win an ODI series here, and in this duration, India had won seven consecutive bilateral contests at home. India had won the first ODI by five wickets, and Australia had bounced back with a 10-wicket win. “I don’t think it was too many runs,” said Sharma, the Indian skipper. “The wicket was challenging in the second innings but we didn’t bat well enough. We failed to put up partnerships today. We will play a World Cup in these conditions in six months’ time and we need to improve.” News.com.au/AP Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-03-22 20:02:09","image_url":"https://www.nzherald.co.nz/resizer/vAPowk5LuB5Q0gTopKJpuThQT6g=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/3ZR2ZSFZIRD7ZPFNBPOU3U2Q3E.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Si Ferry to depart Open Goal Broomhill at end of season","link":"https://www.heraldscotland.com/sport/23405929.si-ferry-depart-open-goal-broomhill-end-season/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The partnership between the Lowland League club and the podcast will conclude at the end of the season.","content":"Open Goal and Broomhill are set to bring their partnership to an end with head coach Si Ferry preparing to depart the club at the end of the season. The Scottish football podcast, presented by Ferry, struck a deal with the Lowland League club that saw the former Celtic, Dundee and Swindon Town midfielder take charge of the first team, while a fly-on-the-wall documentary was shot that would chart the team’s progression. The club changed its name to Open Goal Broomhill FC as part of the project but it will conclude after one season with Ferry set to leave at the end of the current campaign. Ferry was joined at the club, who play their home matches at Broadwood Stadium, by podcast co-host Paul Slane as well as a host of recently professional players such as Kirk Broadfoot, Gary Fraser, Derek Lyle and Ryan Conroy. READ MORE: From podcast to pitchside: Si Ferry on leading Open Goal Broomhill into Scottish Cup Herald and Times Sport understands that the players were informed of the decision on Tuesday at a team meeting. Open Goal Broomhill currently occupy 13th place in the 19-team Lowland League with five games left to play this season. New episodes of the behind-the-scenes documentary, ‘Crossing The Line’, are published weekly on YouTube. At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football, golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this exclusive bespoke piece sent directly to your email inbox for free every day at 5pm, simply take a few seconds to type in your email here . It's that simple!","pubDate":"2023-03-22 19:40:49","image_url":"https://www.heraldscotland.com/resources/images/16587359/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Rohit Sharma double century list: Rohit Sharma century list in ODI cricket","link":"https://thesportsrush.com/cricket-news-rohit-sharma-double-century-list-rohit-sharma-century-list-in-odi-cricket/","keywords":["Cricket","Rohit Sharma"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Despite considering how batters have been playing some outrageous innings these days with the help of some jaw-dropping shots, no score (individual or team) is considered insurmountable in White Ball Cricket. Having said that, Rohit Sharma‘s double century innings – 264 off 173 deliveries against Sri Lanka at Eden Gardens in November 2014, is one… The post Rohit Sharma double century list: Rohit Sharma century list in ODI cricket appeared first on The SportsRush.","content":"Despite considering how batters have been playing some outrageous innings these days with the help of some jaw-dropping shots, no score (individual or team) is considered insurmountable in White Ball Cricket. Having said that, Rohit Sharma‘s double century innings – 264 off 173 deliveries against Sri Lanka at Eden Gardens in November 2014, is one such knock for the ages which certainly seems nearly impossible to breach in ODI Cricket. Rohit’s illustrious ODI career so far has been garlanded with 30 centuries, which places him at the third spot in the list of players with most hundreds in the format. In front of him are the other two batting legends in Virat Kohli (46) and Sachin Tendulkar (49). Rohit Sharma double century list Rohit Sharma had become only the third batter in men’s ODI Cricket, behind Sachin Tendulkar and Virender Sehwag to smash a double hundred in the format, in 2013. He achieved the milestone in November 2013 against the Aussies, at the M Chinnaswamy Stadium in Bengaluru, where he scored 209 runs off mere 158 deliveries, with the help of 12 Fours and 16 Sixes. He then created history by smashing the highest individual score in ODIs, when he played the aforementioned innings at Eden Gardens in 2014. However, three years later in December 2017, he became the first and only player till date to smash three ODI double hundreds when he yet again hammered Sri Lanka, in Mohali this time around. With the help of 13 Fours and 12 Sixes, he remained unbeaten on 208* off mere 153 deliveries. In fact, no player has managed to hit more than one ODI double century till date. Apart from Rohit, Sachin Tendulkar, Virender Sehwag, Ishan Kishan, Shubman Gill, Martin Guptill, Chris Gayle, and Fakhar Zaman have hit a double century each in the format. Rohit Sharma century list in ODI cricket Runs Balls faced Opposition Venue Match date 264 173 v Sri Lanka Eden Gardens 13-Nov-14 209 158 v Australia Bengaluru 02-Nov-13 208* 153 v Sri Lanka Mohali 13-Dec-17 171* 163 v Australia Perth 12-Jan-16 162 137 v West Indies Brabourne 29-Oct-18 159 138 v West Indies Visakhapatnam 18-Dec-19 152* 117 v West Indies Guwahati 21-Oct-18 150 133 v South Africa Kanpur 11-Oct-15 147 138 v New Zealand Kanpur 29-Oct-17 141* 123 v Australia Jaipur 16-Oct-13 140 113 v Pakistan Manchester 16-Jun-19 138 139 v Australia Melbourne 18-Jan-15 137* 114 v England Nottingham 12-Jul-18 137 126 v Bangladesh Melbourne 19-Mar-15 133 129 v Australia Sydney 12-Jan-19 125 109 v Australia Nagpur 01-Oct-17 124* 145 v Sri Lanka Pallekele 27-Aug-17 124 127 v Australia Brisbane 15-Jan-16 123* 129 v Bangladesh Birmingham 15-Jun-17 122* 144 v South Africa Southampton 05-Jun-19 119 128 v Australia Bengaluru 19-Jan-20 115 126 v South Africa Gqeberha 13-Feb-18 114 119 v Zimbabwe Bulawayo 28-May-10 111* 119 v Pakistan Dubai (DSC) 23-Sep-18 104 88 v Sri Lanka Colombo (RPS) 31-Aug-17 104 92 v Bangladesh Birmingham 02-Jul-19 103 94 v Sri Lanka Leeds 06-Jul-19 102 109 v England Birmingham 30-Jun-19 101* 100 v Sri Lanka Bulawayo 30-May-10 101 85 v New Zealand Indore 24-Jan-23   The post Rohit Sharma double century list: Rohit Sharma century list in ODI cricket appeared first on The SportsRush.","pubDate":"2023-03-22 19:25:28","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"IND vs AUS: गया नंबर वन का ताज भारत, बड़े-बड़े नाम नहीं आए काम, ODI रैंकिंग में फिसला भारत","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-slips-from-number-one-odi-spot-ausrtalia-tops-ranking/articleshow/98922858.cms","keywords":null,"creator":null,"video_url":null,"description":"Australia beat India: स्टीव स्मिथ की ऑस्ट्रेलिया से तीन मैच की श्रृंखला 1-2 से हारने के बाद भारतीय टीम वनडे रैंकिंग में अपना नंबर-1 स्थान खो दिया है। चेन्नई के एमए चिदंबरम स्टेडियम में भारतीय टीम ने तीसरा और आखिरी मैच 21 रन से गंवाया।","content":"पिछले चार साल में घरेलू मैदान पर सारे फॉर्मेट्स में 26 सीरीज जीतने के बाद भारतीय टीम को पहली बार हार का सामना करना पड़ा है। ऑस्ट्रेलिया ने तीन मैच की वनडे सीरीज में बीती रात भारत को 2-1 से हरा दिया। एमए चिदंबरम स्टेडियम में 270 रन के लक्ष्य के जवाब में भारतीय शेर 248 रन पर ही सिमट गए। शुरुआती दो मैच में मिचेल स्टार्क की रफ्तार और स्विंग से पस्त होने के बाद निर्णायक मुकाबले में एश्टन एगर (चार विकेट) और एडम जाम्पा (दो विकेट) ने घरेलू सरजमीं पर भारत की लगातार सीरीज जीत के अभियान पर ब्रेक लगा दिया। भारत पर 21 रन की जीत के साथ ऑस्ट्रेलिया ने वनडे इंटरनेशनल रैंकिंग्स में पहला स्थान भी हासिल कर लिया। भारतीय टीम दूसरे स्थान पर खिसक गई। भारतीय टीम इसी साल जनवरी में न्यूजीलैंड को घर पर 3-0 से हराकर नंबर 1 बनी थी, इसके बाद, दबदबा जारी रखने के लिए श्रीलंका को 3-0 से हराया था। भारत ने लगातार आठवां वनडे भी जीता और इस साल के अंत में खेले जाने वाले विश्व कप से पहले अच्छी स्थिति में दिख रहा था। हालांकि, ऑस्ट्रेलियाई टीम ने वाइजैग और चेन्नई में लगातार दूसरे और तीसरे वनडे को जीतकर नंबर वन पोजिशन से हमें बेदखल कर दिया। भारत-ऑस्ट्रेलिया दोनों ओर के ओपनर्स ने तेज शुरुआत दी। ऑस्ट्रेलिया ने टॉस जीतकर बल्लेबाजी का फैसला किया जिसके बाद मिचेल मार्श (47 गेंद में 47 रन) और ट्रेविस हेड (31 गेंद में 33 रन) ने पहले विकेट के लिए 10.5 ओवर्स में 68 रन जोड़कर इसे सही साबित किया। टारगेट का पीछा करने उतरी भारतीय टीम को कप्तान रोहित शर्मा (30 रन, 17 गेंद) और शुभमान गिल (37 रन, 49 गेंद) ने भी तेज शुरुआत दी। दोनों ने पहले विकेट के लिए 9.1 ओवर में 65 रन जोड़े। हालांकि, इसके बाद विराट कोहली (54 रन, 72 गेंद), केएल राहुल (32 गेंद, 50 गेंद) और हार्दिक पंड्या (40 रन, 40 गेंद) ही क्रीज पर डट सके। वैसे इनमें से कोई दबदबे वाला खेल नहीं दिखा सका। हार्दिक पंड्या के शानदार शुरुआती स्पेल और कुलदीप यादव की फिरकी ने ऑस्ट्रेलियाई बल्लेबाजों पर लगाम कसी, लेकिन उसके पुछल्ले बल्लेबाजों ने 49 ओवर में सिमटने से पहले 269 रन का चुनौतीपूर्ण स्कोर खड़ा करने में मदद की। हार्दिक ने टॉप ऑर्डर के बल्लेबाजों को आउट किया तो कुलदीप ने चेन्नई की मददगार पिच पर ऐसी शानदार गेंद पर एलेक्स कैरी को आउट किया जो ‘बॉल ऑफ द सीरीज’ रही। बाएं हाथ के कलाई के स्पिनर कुलदीप की लेग ब्रेक गेंद पर कैरी चकमा खाकर बोल्ड हुए और इस भारतीय गेंदबाज की खुशी का ठिकाना नहीं रहा। ऑस्ट्रेलिया का स्कोर पांच विकेट पर 138 रन था, लेकिन कैरी और मार्क स्टोइनिस (25) के बीच छठे विकेट के लिए 58 रन की साझेदारी तथा शॉन एबॉट (26) और एश्टन एगर (17) के बीच आठवें विकेट के लिए 42 रन की साझेदारी से मेहमान टीम ने दबदबा बनाया। फिर मिचेल स्टार्क और एडम जाम्पा ने अंतिम विकेट के लिए महत्वपूर्ण 22 रन जोड़े।","pubDate":"2023-03-22 18:29:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: सीरीज हार के बाद क्या बोले कप्तान रोहित, लगा दी सभी की क्लास!","link":"https://www.indiatv.in/sports/cricket/ind-vs-aus-3rd-odi-rohit-sharma-was-unhappy-with-batting-performance-of-team-india-against-australia-2023-03-22-944239","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: ऑस्ट्रेलिया के खिलाफ वनडे सीरीज के अंतिम मुकाबले में मिली हार के बाद कप्तान रोहित शर्मा टीम के इन खिलाड़ियों के प्रदर्शन से निराश नजर आए।","content":"भारत और ऑस्ट्रेलिया के बीच खेले गए तीन मैचों की वनडे सीरीज में टीम इंडिया को 2-1 से हार का सामना करना पड़ा है। भारतीय टीम को इस सीरीज के तीसरे मुकाबले में ऑस्ट्रेलिया ने 21 रनों से हार दिया। इसी के साथ घर में भारतीय टीम ने 4 साल के बाद कोई सीरीज गंवाई। सीरीज के अंतिम मुकाबले में मिली हार के बाद टीम इंडिया के कप्तान रोहित शर्मा ने अपनी बल्लेबाजी को जिम्मेदार ठहराया। मैच के बाद रोहित ने साफ कहा कि उनकी टीम ने अच्छी बल्लेबाजी नहीं की। ऑस्ट्रेलिया के खिलाफ मिली हार के बाद कप्तान रोहित ने कहा कि ‘‘मुझे नहीं लगता कि लक्ष्य बड़ा था। विकेट दूसरी पारी में हालांकि थोड़ी चुनौतीपूर्ण हो गई थी। पर मुझे नहीं लगता कि हमने अच्छी बल्लेबाजी की। साझेदारियां महत्वपूर्ण होती हैं और आज हम इन्हें बनाने में असफल रहे।’’ उन्होंने कहा, ‘‘हम जिस तरह से आउट हुए, वह निराशाजनक रहा। हम इसी तरह के विकेट पर खेलते हुए बड़े हुए हैं। कभी कभार आपको खुद को मौका देना होता है।’’ रोहित ने कहा, ‘‘महत्वपूर्ण था कि एक बल्लेबाज अंत तक खेलता रहे। लेकिन हम सभी अपना सर्वश्रेष्ठ करने की कोशिश कर रहे थे। पर ऐसा हुआ नहीं। हमने जनवरी से नौ वनडे खेले हैं, हम उनसे काफी सकारात्मक चीजें ले सकते हैं। यह पूरी टीम की हार है।’’ कप्तान रोहित के इन बयानों से यह साफ लग रहा कि वह टीम इंडिया के बल्लेबाजी से खुश नहीं है। इसी साल भारत में वनडे वर्ल्ड कप खेला जाना है। ऐसे में टीम इंडिया का वनडे में ये हाल होना उनकी कमियों को दर्शाता है। एडम जम्पा ने 45 रन पर चार विकेट लेकर भारत के खिलाफ अपना सर्वश्रेष्ठ गेंदबाजी प्रदर्शन किया, उन्हें इस मैच में प्लेयर आफ द मैच चुना गया। जम्पा ने मैच के बाद कहा कि ‘‘मुझे यहां सफलता मिली है। यहां आकर खेलना बड़ी चुनौती है। एशटन एगर ने मैच का रूख बदल दिया।’’ वहीं मिचेल मार्श को ‘प्लेयर ऑफ द सीरीज’ चुना गया जिन्होंने तीन मैचों में 194 रन बनाए।","pubDate":"2023-03-22 18:25:09","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"}]}