{"newsArray":[{"title":"Temba Bavuma clinches SA20 contract to continue feel-good summer of SA cricket","link":"https://www.dailymaverick.co.za/article/2023-02-02-temba-bavuma-clinches-sa20-contract-to-continue-feel-good-summer-of-sa-cricket/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Sunrisers Eastern Cape on Thursday announced the signing of national white-ball skipper Temba Bavuma which, along with the Proteas’ turn in form, continues the upward trajectory of cricket in South Africa this summer. The post Temba Bavuma clinches SA20 contract to continue feel-good summer of SA cricket appeared first on Daily Maverick.","content":"After a two-year cricket hiatus for spectators at stadiums — due to the Covid-19 pandemic — South Africa has been saturated with cricket since the start of the year. The inaugural season of the country’s premier T20 competition, the SA20, has made a superb start with almost every match sold out. Smack-bang in the middle of the SA20, the Proteas played a vital three-match 50-over series against England — which they won 2-1. After having been snubbed at the SA20 auction, national white-ball captain Temba Bavuma came back rejuvenated in the series and top-scored for South Africa. He made a total of 180 runs with a highest score of 109, as he led from the front, batting at a strike rate of more than a run a ball in all three innings. Bavuma’s incredible form in the series against England helped him secure a contract with the Sunrisers Eastern Cape for the back end of the SA20 — a little late, but rather that than never. The SA20 has been well received for its quality of cricket and staunch support around the country, from the band at St George’s Park in Gqeberha to the loud stadium announcers at Newlands, Cape Town. “There are new voices, new faces. It gives an opportunity to some of our domestic cricketers that have never been exposed to that stage to rub shoulders with some of the best players internationally but also within [the country],” said Cricket South Africa (CSA) Director of Cricket Enoch Nkwe. “So far, it’s been exciting. It’s good to see different cricketers stepping up at different times. Hopefully, it grows from strength to strength and it continues to have that positive impact on South African cricket.” A few days after the SA20 kicked off, the Women’s Under-19 World Cup started in Potchefstroom. And a day before the final of the SA20 final, the Women’s T20 World Cup kicks off in Cape Town. To say the South African cricket schedule is filled would be an understatement. But Nkwe would have wanted even more cricket. “Some of the supporters would have wanted it to start over the festive season in December with a couple of Test matches, going into the shorter formats,” said Nkwe. “It’s a fantastic opportunity for us to continue to promote the game — both men and women. “It’s a dream to have our country host the Under-19 World Cup and the senior World Cup in the same season.” South Africa’s Under-19 women’s team was unlucky to not make the semifinals of the World Cup after missing out on net run rate despite only losing one match all tournament. “Hopefully, the [senior] ladies can build on that women’s cricket momentum, following the way the Under-19s have started,” Nkwe said. The Proteas Women are in the best position they have yet been in to win a World Cup. They have made the semifinals of the past two editions of the shortest tournament format and playing at home with large crowd support will only help their cause. Head coach Hilton Moreeng has now been in charge of the side for 11 years. He has overseen the team’s golden generation and despite the positive strides he has made with the squad, he is yet to capture gold of any kind with the team. Moreeng’s contract finishes at the end of this season and Nkwe said a decision on his future would be made after the World Cup, with an eye on the next two global tournaments. Whether he succeeds or fails at the home tournament, questions remain on whether he has achieved as much as he could with the star-studded group of players. “His contract finishes at the end of the season. Our focus currently is on the World Cup. After the tournament, we’ll do a full review and then see how we plan forward with the coaching staff,” said Nkwe. “We’re going to be sitting down with the players individually to plan forward. Post-World Cup, we need to plan for the next two years because there’s a T20 World Cup next year and there’s a 50-over World Cup in 2025. “There’s not really a lot of time and there’s still a lot of work to be done. We need to continue to build on the work that has been done and plan for the next two years.” The focus, according to Nkwe, is to incorporate younger players in the team gradually to ensure the retirement of players from the golden generation does not have too great an impact on the performance of the national team. Visit Daily Maverick’s home page for more news, analysis and investigations Mignon du Preez and Lizelle Lee retired last year, and opening bowlers Marizanne Kapp and Shabnim Ismail are both closer to 35 than 30. The 21-year-old all-rounder Annerie Dercksen made her debut in the recent tri-series against West Indies and India, while 22-year-old wicketkeeper batter Tebogo Macheke spent some time around the national team recently. “There’s a good mix of young and experienced players at the moment, but we don’t want to be caught on the back foot if some of the experienced players decide to retire soon,” said Nkwe. “We need to ensure these younger players transition well into the senior team.” Nkwe said the SA20 has plans to include a women’s edition of the tournament in the near future which would further help reduce the gap between provincial and national cricket — one of the major problems in South African women’s cricket at the moment. Australia’s premier T20 competition, the Big Bash League, has the Women’s Big Bash League, which has proven to be extremely successful. India recently announced the Women’s Premier League, the women’s version of the most popular T20 league in the world, the Indian Premier League. On 25 January, multiple investors bought franchise rights to the five teams in a closed bidding process which raised a total of close to R10-billion. Even though Nkwe said he could not confirm when the women’s edition of the SA20 would be announced, the fact that it is in the works enhances the feel-good factor currently prevalent in South African cricket. DM","pubDate":"2023-02-02 21:24:50","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Proteas hoping home advantage will help break ICC tournament duck","link":"https://www.thesouthafrican.com/sport/cricket/proteas/home-advantage-breaking-icc-tournament-duck-2-february-2023/","keywords":["Proteas","Featured","Important","South Africa","Sune Luus"],"creator":["James Richardson"],"video_url":null,"description":"Proteas skipper Sune Luus says that the team are determined to put past heartaches behind them and secure a first ICC trophy.","content":"Proteas skipper Sune Luus says that the team are determined to put past heartaches behind them and secure a first ICC trophy in the upcoming Women’s T20 World Cup. Luus feels that playing at home will give the Proteas an edge. Proteas out to end ICC tournament heartache Luus told the ICC : “With it being a home World Cup, we’re very excited. We’re going to have all our family and friends at every game, so that’s also very exciting. “The aim for every team in the World Cup is obviously to win that trophy. In the past we’ve come so close every time; we’ve made the semi-finals and then having to go through that loss. So hopefully this year is our year, where we can actually get through the semi-finals, get into that final and hopefully keep the trophy in South Africa. That would be amazing. “The preparations have been very good. We’ve played our league games in the Tri-Series against India and the West Indies, and that’s been going very well. “We are used to the conditions, obviously being a home World Cup as well, we know what to expect from every ground we’re going to be playing on. Hopefully we can use that to our advantage.” Stars abound Luus is delighted to be able to call on so many stars to boost the Proteas bid. “We’re a very well-balanced team. This year we have a good balance of experienced players as well as new youngsters coming through. That makes it very exciting for us. “Our bowling attack has always been our strong suit, but I think we have a very powerful batting lineup as well. That’s something I look forward to seeing come to the fore in this World Cup. “We have our standouts. We have Marizanne Kapp in the team, she’s always a very good T20 player. Laura Wolvaardt up the order as well. Chloe Tryon is very powerful as well, and also Shabnim Ismail, our pocket rocket. “And then we have some youngsters coming through. Nadine de Clark, someone I think is a very underrated cricketer, but is very good, and Nonkululeko Mlaba, she’s a very good bowler and also someone that I think is very underrated.” ALSO READ: Proteas dealt World Cup blow with over-rate penalty Luus hopes Proteas can make magic Luus believes that the stage is set for a magic moment for the Proteas. “It’s really exciting to see where we are going to be this year in the World Cup. “South Africa is a great venue. We have a great crowd coming in. We have a good vibe as well around the country. “Playing at two coastal venues, it’s going to be low and slow. but the groundsmen might surprise us, you never know what they will give us. Paarl is going to be very hot, and it might also be slow. With the SA20 on all the pitches at the moment, they are a bit worn and torn, so it’s going to be interesting to see how they play. “A successful tournament at this year’s World Cup would be massive. I don’t think I can explain the magnitude of what a tournament victory could do for our country and women’s cricket, and just women’s sport in general. “The only way to do that is by winning a trophy, but if that’s what it takes, then we’re up for the challenge to inspire the next generation to pick up the bat and the ball and for people to take women’s sport and women’s cricket seriously. “The women’s game has transformed a lot over the years. It has grown so much and it’s very exciting with all the leagues coming up and the Women’s IPL (Women’s Premier League) starting soon. “T20 International cricket is also always fun, it brings in the crowd and I’m hoping for this World Cup the crowds will be coming in their numbers. I know our PE (Gqeberha) game is already sold out, so that’s very exciting.” CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-02 20:44:10","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Betway SA20: Quinton de Kock lauds breath of fresh air","link":"https://www.thesouthafrican.com/sport/cricket/sa-cricket/betway-sa20-quinton-de-kock-breaking-thursday-2-february-2023/","keywords":["SA Cricket","Featured","Quinton de Kock","SA20 League","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"Durban's Super Giants skipper Quinton de Kock believes that the Betway SA20 is set to breathe new life into the T20 franchise scene.","content":"Durban’s Super Giants skipper Quinton de Kock believes that the Betway SA20 is set to breathe new life into the T20 franchise scene. SA20 is something South African cricket needed De Kock feels that the South African tournament could become one mentioned in the same light as the Indian Premier League and Big Bash. “It’s exciting. I think this is something that South African cricket has needed for a while now,” De Kock told Betway . “This is in the same bracket as some big competitions, such as the IPL, PSL and Big Bash. “A lot of IPL investors are involved in this competition so it’s obviously a big thing for us.” Quinton de Kock feels bowlers will stand out De Kock says that the SA20 offers something different and shows off just how strong the bowling stocks are in South Africa. “Some of the world-class talent arriving in South Africa will help the younger guys, too. “I’m lucky to have Lance Klusener as coach, who I’ve worked with before and some of the players passed to us from within the franchise as well, too, so I’m excited.” SA20 learning experience De Kock is delighted with the strong group of overseas players who have turned out and feels it will be a big boost to the Proteas white-ball aspirations to have local players test themselves against the best. “We’re playing against world-class players who have won World Cups and multiple franchise competitions. A previous IPL winner, De Kock believes consistency and confidence are the keys to winning franchise trophies. ALSO READ: What needs to happen for Proteas to qualify for Cricket World Cup “The key is to be consistent in the way that you do things as a team. Teams that win trophies know what their brand of cricket is and they stick to it. CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-02 18:52:12","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"South Australia in audacious bid to pinch Sydney’s New Year’s Test","link":"https://www.watoday.com.au/sport/cricket/south-australia-in-audacious-bid-to-pinch-sydney-s-new-year-s-test-20230202-p5chj7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"South Australia, its premier and state cricket association have made a bold bid to take the New Year’s Test from the SCG to the Adelaide Oval.","content":"South Australia, its ambitious premier and state association have made a bid to take the New Year’s Test match from Sydney to Adelaide Oval. Senior cricket sources have told The Age and The Sydney Morning Herald that Premier Peter Malinauskas and the South Australian Cricket Association (SACA) have approached Cricket Australia about trying to pinch the New Year’s Test, customarily played at the Sydney Cricket Ground. Premier Peter Malinauskas wants the New Year’s Test to be played at Adelaide Oval. Credit: Getty Malinauskas made a splash last year by overseeing a winning bid for the AFL’s “gather round” where all matches in an individual round will be played in Adelaide later this year. In the same breath, the SACA’s leadership is angered by the fact the stadium has been pencilled in for another West Indies Test match next season, to be played around the contentious January 26 Australia Day weekend . That frustration has led to fresh debate about whether the Cricket Australia board structure needs to be altered to allow the six state association owners to have their own direct representatives on the top table of decision-making. Loading CA’s chair, Lachlan Henderson, is in his final days in the role before handing over to the former New South Wales premier, Mike Baird , at the end of next week for a board meeting where next summer’s Test venues will be discussed The argument for the request for the New Year’s Test is based largely on Adelaide Oval’s consistent drawing and revenue-raising power for red or pink ball matches, regardless of the timing of the fixture or who Australia’s opponent may be. In early December, no fewer than 86,617 spectators filed into the oval to see Australia hand out a comprehensive defeat to the West Indies - in marked contrast to the 42,723 who attended the Perth Test a week before.","pubDate":"2023-02-02 18:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"IND vs AUS: टेस्ट सीरीज से पहले ऑस्ट्रेलियाई कोच के छूटने लगे हैं पसीने, सताने लगा है यह डर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-aus-spin-will-play-a-key-role-in-australias-success-in-india-mcdonald/articleshow/97560490.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: बॉर्डर-गावस्कर टेस्ट सीरीज से पहले ऑस्ट्रेलिया के मुख्य कोच एंड्रयू मैकडोनाल्ड का मानना है कि भारत के खिलाफ उसके घर में स्पिन गेंदबाजी का सामना करना सबसे बड़ी चुनौती होगी। इसे लेकर टीम के कोच ने अभी से अपने खिलाड़ियों को स्पिन गेंदबाजी के प्रैक्टिस में लगा दिया है।","content":"ऑस्ट्रेलिया के मुख्य कोच एंड्रयू मैकडोनाल्ड का मानना है कि आगामी बोर्डर-गावस्कर ट्रॉफी के चार टेस्ट मैचों में उनकी टीम के लिए सबसे बड़ी चुनौती भारतीय स्पिनरों से निबटना होगी। ऑस्ट्रेलियाई टीम अभी नौ फरवरी से नागपुर में होने वाले पहले टेस्ट मैच की तैयारियों में लगी है। मैकडोनाल्ड ने इससे पहले अपने बल्लेबाजों को आगाह करते हुए कहा कि उन्हें ‘स्लाइड स्पिन’ से निबटने के लिए अपने खुद के तरीके ढूंढने होंगे। ऑस्ट्रेलिया ने अभ्यास मैच खेलने के बजाय खुद ही अभ्यास करने को प्राथमिकता दी है। मैकडोनाल्ड ने बुधवार को टीम के बेंगलुरू रवाना होने से पहले कहा, 'मेरा मानना है की नई गेंद अधिक स्लाइड होती है। हम इसके लिए तैयारी कर रहे हैं।' उन्होंने कहा, 'यह ‘स्लाइड स्पिन’ है। पूरी संभावना है कि हमारे सलामी बल्लेबाजों को शुरू में स्पिन गेंदबाजों का सामना करना पड़ेगा, इसलिए अभ्यास के दौरान इस पर विशेष गौर किया जा रहा है तथा बल्लेबाजी कोच डिवा (माइकल डि वेंटो) इसमें अहम भूमिका निभा रहे हैं।' मैकडोनाल्ड ने कहा, 'सफलता की कुंजी इस तरह की गेंदबाजी को खेलने के लिए स्पष्टता होना है। यह व्यक्तिगत और परिस्थितियों पर निर्भर करेगी।' ऑस्ट्रेलिया की टीम अभी यहां अलूर में अभ्यास कर रही है। मैकडोनाल्ड ने कहा, 'हम यह सुनिश्चित करने की कोशिश कर रहे हैं कि बल्लेबाजों की अपने तरीके को लेकर स्पष्ट राय हो। आपको वैसी ही परिस्थितियां नहीं मिलेंगी जैसी मैच में होती हैं और किसी क्रिकेट दौरे से इस तरह की जटिलताएं जुड़ी होती हैं।' भारत और ऑस्ट्रेलिया के बीच चार टेस्ट मैचों की सीरीज का पहला मुकाबला नागपुर में 9 फरवरी से 13 फरवरी के बीच खेला जाना है।","pubDate":"2023-02-02 17:54:50","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Kyle Jamieson returns to New Zealand Test squad after a year following injury","link":"https://indianexpress.com/article/sports/cricket/kyle-jamieson-returns-to-the-new-zealand-test-squad-after-an-injury-layoff-8420730/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"New Zealand pacer Kyle Jamieson has been recalled into the Test squad after a one year hiatus following an injury against England for the two-match series at home. The 28-year-old had sustained a back injury in June last year while playing against England away from home. “Kyle is a very determined character with a strong desire to play international cricket for New Zealand,” said the Kiwis coach Gary Stead “Since he was forced from the field in Nottingham he’s been very clear that he wants to get his body right to return,” he added. Our Test Squad to face @englandcricket this month at Bay Oval and the Cello @BasinReserve . More | https://t.co/U8xFo3L7uO #NZvENG pic.twitter.com/mjSLShVDjq — BLACKCAPS (@BLACKCAPS) February 2, 2023 On Jamieson’s progress Stead added, “He’s reported good progress since his return to professional cricket with Auckland and he will get the opportunity to play some long-form cricket as part of the New Zealand XI Squad to face England in their warm-up match next week at Seddon Park.” Having made his debut against India during the two-match Test series in February 2020, Jamieson has picked up 72 wickets in 16 Test matches, averaging 19.4. Apart from Jamieson, leg-spinner Ish Sodhi retained his spot in the squad after an impressive outing in Pakistan with the ball. The 30-year-old was the leading wicket-taker of the series with 13 scalps. “Ish really impressed us with his approach with bat and ball. He’s worked very hard on both in recent years and it was great to see that on the international Test stage.” Stead said. Advertisement The first Test, a day night affair, will be played at the Bay Oval in Tauranga from February 16-20. Subscriber Only Stories View All UPSC Key- February 2, 2023: Know about Union Budget 2023-24 Adani contagion spreads as Indian benchmark nears correction Japanese literary giant Haruki Murakami to publish new novel after six years Union Budget 2023 | After targeting rural and urban poor, a 2024 signal: ... Monthly plan to access Budget Top Sports News Now How Kohli and Pujara’s issues against spin can be exploited by Australia in the Border-Gavaskar Trophy With newly-acquired boundary-clearing skill, classy Shubman is more dangerous than ever before Before Border-Gavaskar Trophy, Aussies skip practice games, use RCB connections to train on rank turners outside Bangalore Click here for more Squad: Tim Southee (c), Michael Bracewell, Tom Blundell (wk), Devon Conway, Matt Henry, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ish Sodhi, Blair Tickner, Neil Wagner, Kane Williamson , Will Young","pubDate":"2023-02-02 17:27:42","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"'India hosting its 1st ever Formula E race has huge significance for the sport'","link":"https://www.hindustantimes.com/sports/others/india-hosting-its-first-ever-formula-e-race-has-huge-significance-for-the-sport-101675357739444.html","keywords":null,"creator":null,"video_url":null,"description":"India will embark on a new motorsport journey next week, 10 years after the unceremonious exit of Formula 1","content":"India will embark on a new motorsport journey next week, 10 years after the unceremonious exit of Formula 1. Formula E – an all-electric racing series – will descend upon Telangana on February 10-11 for the first ever Indian race – the Hyderabad E-Prix. Now in its ninth season, Formula E is a traditional single-seater championship that was conceived in 2011 and debuted in 2014 with one major difference – everything from the brakes to the engine is powered by an electric battery and zero fuel. Rules, regulations, points, drivers, teams – most aspects are designed and styled on Formula 1, which is the pinnacle of motorsport. But the series looks towards a sustainable future while reducing carbon footprint. Only one driver has seen the sport evolve from the first ever Formula E race – the 2014 Beijing E-Prix – to the Hyderabad E-Prix that will be held on the banks of Hussain Sagar Lake on February 11 – Lucas di Grassi. The Brazilian is the most experienced and also the most successful driver on the Formula E grid with 103 races and 13 victories, also clinching the 2016-17 drivers’ championship. The Hyderabad E-Prix will not just be any other race for the 38-year-old as he will be one of the two drivers for Mahindra Racing – along with Oliver Rowland – the only Indian team on the grid. \"Having countries as big and important as India hosting its first ever Formula E race has huge significance for the sport. It opens up new markets for manufacturers. So, having an Indian race is incredible for the whole series,\" the former Formula 1 driver said on a video call from the Mahindra Racing base in Banbury. Teams like Mahindra, Nissan, Porsche, Jaguar, Maserati are currently racing in Formula E with the idea of promoting their electric vehicles in newer markets. After eight seasons with Audi and Venturi, di Grassi had a brilliant start with Mahindra, taking pole in the Mexico City E-Prix – the first race of the season – on January 14. He eventually finished third but the next two races in Diriyah did not deliver expected results as the former champion finished 13th and 15th. But the 38-year-old hopes to turn things around in Mahindra’s home race that will be held at the 2.8km, 18-turn Hyderabad Street Circuit which will host the fourth of the 16-race calendar. “My understanding is that it is a very fast track with a lot of overtaking opportunities. It is very technical and will be very difficult which will present the teams with a huge challenge,\" said di Grassi, who is also known as ‘Mr Formula E’. “You need to be very aggressive as a driver but also very efficient. It is going to be extremely hot which presents a different kind of challenge.\" Mahindra also signed up Formula 2 racer Jehan Daruvala as a reserve driver in December 2022. While Daruvala will continue to drive in F2, he will keep learning about Formula E, working on the simulator, helping in car development and race support to the team. “Jehan is a great kid. He is a talented driver, coming along and developing in Formula E right now. He is learning with every race in the simulator. If he has a future or not in Formula E... time will tell but we definitely need Indian racers as India is a very important market,\" said di Grassi, who will be flying into India on Wednesday for his third visit to the country. This Republic Day, unlock premium articles at 74% discount Enjoy Unlimited Digital Access with HT Premium Start 14 Days Free Trial Already Subscribed? Sign In SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics motor racing motor racing Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-02-02 17:19:44","image_url":"https://images.hindustantimes.com/img/2023/02/02/1600x900/PTI01-12-2023-000453B-0_1675360820760_1675360820760_1675360832664_1675360832664.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket-Pacer Jamieson returns to New Zealand squad for England tests","link":"https://www.thestar.com.my/sport/cricket/2023/02/03/cricket-pacer-jamieson-returns-to-new-zealand-squad-for-england-tests","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Kyle Jamieson has been named in New Zealand's squad for the two-test series against England later this month as the fast bowler makes his return to the side for the first time since pulling out of the England tour last year due to injury. Read full story","content":"(Reuters) - Kyle Jamieson has been named in New Zealand's squad for the two-test series against England later this month as the fast bowler makes his return to the side for the first time since pulling out of the England tour last year due to injury. The towering 28-year-old has been one of New Zealand's best pace bowlers in recent years, picking up 72 wickets in 16 matches since making his debut in 2020. He missed the final test against England in June last year and returned home after picking up a back injury during the second match at Trent Bridge, playing no part in their run chase. \"Kyle is a very determined character with a strong desire to play international cricket for New Zealand,\" coach Gary Stead said. \"Since he was forced from the field in Nottingham he's been very clear that he wants to get his body right to return. \"He's reported good progress since his return to professional cricket with Auckland and he will get the opportunity to play some long form cricket... (against) England in their warm-up match next week at Seddon Park.\" Wicketkeeper-batsman Tom Blundell and fast bowler Matt Henry both finished the tour of Pakistan with injuries but are expected to be fully fit for the home series which begins with a pink-ball day-night test in Tauranga from Feb. 16-20. Spinner Ish Sodhi also retains his place after finishing the Pakistan tour as the leading wicket-taker with 13 wickets but Ajaz Patel and Glenn Phillips miss out in the 14-man squad. NEW ZEALAND SQUAD Tim Southee (captain), Michael Bracewell, Tom Blundell (wicketkeeper), Devon Conway, Matt Henry, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ish Sodhi, Blair Tickner, Neil Wagner, Kane Williamson, Will Young (Reporting by Rohith Nair in Bengaluru; Editing by Toby Davis)","pubDate":"2023-02-02 16:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/02/03/1926273.jpg","source_id":"thestar_my","category":["sports"],"country":["malaysia"],"language":"english"},{"title":"News24.com | Belligerent Tryon blasts Proteas to Tri-Series win over India","link":"https://www.news24.com/sport/Cricket/Proteas/belligerent-tryon-blasts-proteas-to-tri-series-win-over-india-20230202","keywords":null,"creator":null,"video_url":null,"description":"A brilliant half-century by all-rounder Chloe Tryon guided the Proteas to a 5-wicket win over India in the Tri-Series final at Buffalo Park in East London on Thursday.","content":"A brilliant half-century by all-rounder Chloe Tryon guided the Proteas to a 5-wicket win over India in the Tri-Series final at Buffalo Park in East London on Thursday. After India won the toss and opted to make first use of the wicket, they were in immediate trouble when left-arm spinner Nonkululeko Mlaba bowled Smriti Mandhana for an eight-ball duck. From that point, India struggled to find their way into the contest, and after the powerplay, the Proteas were well on top after restricting the visitors to 18 for 1 at a run rate of just 3 per over. That slow rate led to the dismissal of Jemimah Rodrigues (11) as she was brilliantly stumped by Sinalo Jafta as the impressive Mlaba (2/16) snared her second wicket to leave India on 21 for 2 at the end of the second over. India desperately needed a partnership, which came from captain Harmanpreet Kaur and Harleen Deol, who put on 48 for the third wicket. Kaur led the way, scoring 21 at a run-a-ball, but she was out in the 15th over, trying to launch Sune Luus (1/22) over extra cover only to be stumped by Jafta to leave India at 69-3 with five overs left in their innings. Deol (46) continued in the anchor role for India, losing her wicket in the final over when she was bowled by Ayabonga Khaka (1/17). Together with Deepti Sharma, Deol helped India to 109 for 4 after their 20 overs. That total, while not substantial, was still a difficult target considering the slowness of the Buffalo Park pitch and the Indian attack, which included several spinners. That was obvious from the first over from off-spinner Deepti Sharma bowled a maiden to Laura Wolvaardt. India then opted for the left-arm spin of Rajeshwari Gayakwad for the second over, but Tazmin Brits showed some positive intent by launching her over mid-wicket for a massive 6. Wolvaardt, who looked troubled for most of her brief innings, was out in the third over, bowled by Sharma for 0. Lara Goodall joined Britz at the wicket, and she was soon off the mark as the Proteas moved to 8-1 after three overs. Britz (8) fell in the sixth over, caught behind off Sneh Rana to leave the Proteas on 19 for 2 after the powerplay. That became 21/3 just three balls later as Goodall (7) was bowled by Gayakwad, trying to up the run rate. With Chloe Tryon and Sune Luus at the crease, the Proteas needed a big partnership to claw their way back into the match. Tryon was quickly onto the attack, hitting two boundaries off Devika Vaidya in her opening over. Luus and Tryon seemed in control until Luus (12) was out, caught at short third man off the bowling of Renuka Singh to leave the Proteas on 47 for 4 after 10.2 overs. A partnership of 19 runs between Tryon and Annerie Dercksen (8) saw South Africa move to 67 for 5 before the latter was caught off a leading edge. Needing 44 off 41 balls, Nadine de Klerk came to the wicket to join Tryon. Tryon stood strong and blasted the Proteas to victory as she ended on 51* off just 31 balls (with six fours and two sixes), putting on 47 for the 7th wicket with De Klerk (17*) in just 4.5 overs as the Proteas got home with 12 balls to spare. Scores in brief: India 109/4 in 20 overs (Deol 46, Kaur 21, Mlaba 2/16) South Africa 113/5 in 18 overs (Tryon 51*, De Klerk 17*, Rana 2/21)","pubDate":"2023-02-02 16:28:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas lose vital Super League point after slow over-rate in 3rd England ODI","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-lose-vital-super-league-point-after-slow-over-rate-in-3rd-england-odi-20230202","keywords":null,"creator":null,"video_url":null,"description":"While they have improved their position in trying to qualify for the World Cup later this year in India by winning the ODI series against England 2-1, there was bad news for the Proteas following the third ODI.","content":"While they have improved their position in trying to qualify for the World Cup later this year in India by winning the ODI series against England 2-1, there was bad news for the Proteas on Thursday following the third ODI in Kimberley. READ | Proteas skipper Bavuma lands SA20 gig after impressive ODI form A statement from the International Cricket Council (ICC) confirmed that Temba Bavuma's charges were not only docked 20% of their match fee but also lost a Super League point for their tardiness during the first innings of the clash while bowling to England. The latter is certainly more of a concern for South Africa as they look to India and the World Cup later this year. \"Referees imposed the sanction after South Africa were ruled to be one over short of the target after time allowances were taken into consideration,\" the statement read. \"In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel , which relates to minimum over-rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time. \"In addition, as per Article 16.12.2 of the ICC Men’s Cricket World Cup Super League Playing Conditions, a side is penalised one point for each over short. Consequently, South Africa will lose one point from their points tally in the Super League standings.\" A formal hearing wasn't necessary for the offence as Bavuma had pleaded guilty and accepted the sanctions proposed by the ICC. South Africa are currently in ninth position on the Super League table with 78 points, with the West Indies in 8th position with 88 points.","pubDate":"2023-02-02 16:28:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Temba Bavuma clinches SA20 contract to continue feel-good summer of SA cricket","link":"https://www.dailymaverick.co.za/article/2023-02-02-temba-bavuma-clinches-sa20-contract-to-continue-feel-good-summer-of-sa-cricket/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Sunrisers Eastern Cape on Thursday announced the signing of national white-ball skipper Temba Bavuma which, along with the Proteas’ turn in form, continues the upward trajectory of cricket in South Africa this summer. The post Temba Bavuma clinches SA20 contract to continue feel-good summer of SA cricket appeared first on Daily Maverick.","content":"After a two-year cricket hiatus for spectators at stadiums — due to the Covid-19 pandemic — South Africa has been saturated with cricket since the start of the year. The inaugural season of the country’s premier T20 competition, the SA20, has made a superb start with almost every match sold out. Smack-bang in the middle of the SA20, the Proteas played a vital three-match 50-over series against England — which they won 2-1. After having been snubbed at the SA20 auction, national white-ball captain Temba Bavuma came back rejuvenated in the series and top-scored for South Africa. He made a total of 180 runs with a highest score of 109, as he led from the front, batting at a strike rate of more than a run a ball in all three innings. Bavuma’s incredible form in the series against England helped him secure a contract with the Sunrisers Eastern Cape for the back end of the SA20 — a little late, but rather that than never. The SA20 has been well received for its quality of cricket and staunch support around the country, from the band at St George’s Park in Gqeberha to the loud stadium announcers at Newlands, Cape Town. “There are new voices, new faces. It gives an opportunity to some of our domestic cricketers that have never been exposed to that stage to rub shoulders with some of the best players internationally but also within [the country],” said Cricket South Africa (CSA) Director of Cricket Enoch Nkwe. “So far, it’s been exciting. It’s good to see different cricketers stepping up at different times. Hopefully, it grows from strength to strength and it continues to have that positive impact on South African cricket.” A few days after the SA20 kicked off, the Women’s Under-19 World Cup started in Potchefstroom. And a day before the final of the SA20 final, the Women’s T20 World Cup kicks off in Cape Town. To say the South African cricket schedule is filled would be an understatement. But Nkwe would have wanted even more cricket. “Some of the supporters would have wanted it to start over the festive season in December with a couple of Test matches, going into the shorter formats,” said Nkwe. “It’s a fantastic opportunity for us to continue to promote the game — both men and women. “It’s a dream to have our country host the Under-19 World Cup and the senior World Cup in the same season.” South Africa’s Under-19 women’s team was unlucky to not make the semifinals of the World Cup after missing out on net run rate despite only losing one match all tournament. “Hopefully, the [senior] ladies can build on that women’s cricket momentum, following the way the Under-19s have started,” Nkwe said. The Proteas Women are in the best position they have yet been in to win a World Cup. They have made the semifinals of the past two editions of the shortest tournament format and playing at home with large crowd support will only help their cause. Head coach Hilton Moreeng has now been in charge of the side for 11 years. He has overseen the team’s golden generation and despite the positive strides he has made with the squad, he is yet to capture gold of any kind with the team. Moreeng’s contract finishes at the end of this season and Nkwe said a decision on his future would be made after the World Cup, with an eye on the next two global tournaments. Whether he succeeds or fails at the home tournament, questions remain on whether he has achieved as much as he could with the star-studded group of players. “His contract finishes at the end of the season. Our focus currently is on the World Cup. After the tournament, we’ll do a full review and then see how we plan forward with the coaching staff,” said Nkwe. “We’re going to be sitting down with the players individually to plan forward. Post-World Cup, we need to plan for the next two years because there’s a T20 World Cup next year and there’s a 50-over World Cup in 2025. “There’s not really a lot of time and there’s still a lot of work to be done. We need to continue to build on the work that has been done and plan for the next two years.” The focus, according to Nkwe, is to incorporate younger players in the team gradually to ensure the retirement of players from the golden generation does not have too great an impact on the performance of the national team. Visit Daily Maverick’s home page for more news, analysis and investigations Mignon du Preez and Lizelle Lee retired last year, and opening bowlers Marizanne Kapp and Shabnim Ismail are both closer to 35 than 30. The 21-year-old all-rounder Annerie Dercksen made her debut in the recent tri-series against West Indies and India, while 22-year-old wicketkeeper batter Tebogo Macheke spent some time around the national team recently. “There’s a good mix of young and experienced players at the moment, but we don’t want to be caught on the back foot if some of the experienced players decide to retire soon,” said Nkwe. “We need to ensure these younger players transition well into the senior team.” Nkwe said the SA20 has plans to include a women’s edition of the tournament in the near future which would further help reduce the gap between provincial and national cricket — one of the major problems in South African women’s cricket at the moment. Australia’s premier T20 competition, the Big Bash League, has the Women’s Big Bash League, which has proven to be extremely successful. India recently announced the Women’s Premier League, the women’s version of the most popular T20 league in the world, the Indian Premier League. On 25 January, multiple investors bought franchise rights to the five teams in a closed bidding process which raised a total of close to R10-billion. Even though Nkwe said he could not confirm when the women’s edition of the SA20 would be announced, the fact that it is in the works enhances the feel-good factor currently prevalent in South African cricket. DM","pubDate":"2023-02-02 21:24:50","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Proteas hoping home advantage will help break ICC tournament duck","link":"https://www.thesouthafrican.com/sport/cricket/proteas/home-advantage-breaking-icc-tournament-duck-2-february-2023/","keywords":["Proteas","Featured","Important","South Africa","Sune Luus"],"creator":["James Richardson"],"video_url":null,"description":"Proteas skipper Sune Luus says that the team are determined to put past heartaches behind them and secure a first ICC trophy.","content":"Proteas skipper Sune Luus says that the team are determined to put past heartaches behind them and secure a first ICC trophy in the upcoming Women’s T20 World Cup. Luus feels that playing at home will give the Proteas an edge. Proteas out to end ICC tournament heartache Luus told the ICC : “With it being a home World Cup, we’re very excited. We’re going to have all our family and friends at every game, so that’s also very exciting. “The aim for every team in the World Cup is obviously to win that trophy. In the past we’ve come so close every time; we’ve made the semi-finals and then having to go through that loss. So hopefully this year is our year, where we can actually get through the semi-finals, get into that final and hopefully keep the trophy in South Africa. That would be amazing. “The preparations have been very good. We’ve played our league games in the Tri-Series against India and the West Indies, and that’s been going very well. “We are used to the conditions, obviously being a home World Cup as well, we know what to expect from every ground we’re going to be playing on. Hopefully we can use that to our advantage.” Stars abound Luus is delighted to be able to call on so many stars to boost the Proteas bid. “We’re a very well-balanced team. This year we have a good balance of experienced players as well as new youngsters coming through. That makes it very exciting for us. “Our bowling attack has always been our strong suit, but I think we have a very powerful batting lineup as well. That’s something I look forward to seeing come to the fore in this World Cup. “We have our standouts. We have Marizanne Kapp in the team, she’s always a very good T20 player. Laura Wolvaardt up the order as well. Chloe Tryon is very powerful as well, and also Shabnim Ismail, our pocket rocket. “And then we have some youngsters coming through. Nadine de Clark, someone I think is a very underrated cricketer, but is very good, and Nonkululeko Mlaba, she’s a very good bowler and also someone that I think is very underrated.” ALSO READ: Proteas dealt World Cup blow with over-rate penalty Luus hopes Proteas can make magic Luus believes that the stage is set for a magic moment for the Proteas. “It’s really exciting to see where we are going to be this year in the World Cup. “South Africa is a great venue. We have a great crowd coming in. We have a good vibe as well around the country. “Playing at two coastal venues, it’s going to be low and slow. but the groundsmen might surprise us, you never know what they will give us. Paarl is going to be very hot, and it might also be slow. With the SA20 on all the pitches at the moment, they are a bit worn and torn, so it’s going to be interesting to see how they play. “A successful tournament at this year’s World Cup would be massive. I don’t think I can explain the magnitude of what a tournament victory could do for our country and women’s cricket, and just women’s sport in general. “The only way to do that is by winning a trophy, but if that’s what it takes, then we’re up for the challenge to inspire the next generation to pick up the bat and the ball and for people to take women’s sport and women’s cricket seriously. “The women’s game has transformed a lot over the years. It has grown so much and it’s very exciting with all the leagues coming up and the Women’s IPL (Women’s Premier League) starting soon. “T20 International cricket is also always fun, it brings in the crowd and I’m hoping for this World Cup the crowds will be coming in their numbers. I know our PE (Gqeberha) game is already sold out, so that’s very exciting.” CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-02 20:44:10","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Betway SA20: Quinton de Kock lauds breath of fresh air","link":"https://www.thesouthafrican.com/sport/cricket/sa-cricket/betway-sa20-quinton-de-kock-breaking-thursday-2-february-2023/","keywords":["SA Cricket","Featured","Quinton de Kock","SA20 League","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"Durban's Super Giants skipper Quinton de Kock believes that the Betway SA20 is set to breathe new life into the T20 franchise scene.","content":"Durban’s Super Giants skipper Quinton de Kock believes that the Betway SA20 is set to breathe new life into the T20 franchise scene. SA20 is something South African cricket needed De Kock feels that the South African tournament could become one mentioned in the same light as the Indian Premier League and Big Bash. “It’s exciting. I think this is something that South African cricket has needed for a while now,” De Kock told Betway . “This is in the same bracket as some big competitions, such as the IPL, PSL and Big Bash. “A lot of IPL investors are involved in this competition so it’s obviously a big thing for us.” Quinton de Kock feels bowlers will stand out De Kock says that the SA20 offers something different and shows off just how strong the bowling stocks are in South Africa. “Some of the world-class talent arriving in South Africa will help the younger guys, too. “I’m lucky to have Lance Klusener as coach, who I’ve worked with before and some of the players passed to us from within the franchise as well, too, so I’m excited.” SA20 learning experience De Kock is delighted with the strong group of overseas players who have turned out and feels it will be a big boost to the Proteas white-ball aspirations to have local players test themselves against the best. “We’re playing against world-class players who have won World Cups and multiple franchise competitions. A previous IPL winner, De Kock believes consistency and confidence are the keys to winning franchise trophies. ALSO READ: What needs to happen for Proteas to qualify for Cricket World Cup “The key is to be consistent in the way that you do things as a team. Teams that win trophies know what their brand of cricket is and they stick to it. CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-02 18:52:12","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"South Australia in audacious bid to pinch Sydney’s New Year’s Test","link":"https://www.watoday.com.au/sport/cricket/south-australia-in-audacious-bid-to-pinch-sydney-s-new-year-s-test-20230202-p5chj7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"South Australia, its premier and state cricket association have made a bold bid to take the New Year’s Test from the SCG to the Adelaide Oval.","content":"South Australia, its ambitious premier and state association have made a bid to take the New Year’s Test match from Sydney to Adelaide Oval. Senior cricket sources have told The Age and The Sydney Morning Herald that Premier Peter Malinauskas and the South Australian Cricket Association (SACA) have approached Cricket Australia about trying to pinch the New Year’s Test, customarily played at the Sydney Cricket Ground. Premier Peter Malinauskas wants the New Year’s Test to be played at Adelaide Oval. Credit: Getty Malinauskas made a splash last year by overseeing a winning bid for the AFL’s “gather round” where all matches in an individual round will be played in Adelaide later this year. In the same breath, the SACA’s leadership is angered by the fact the stadium has been pencilled in for another West Indies Test match next season, to be played around the contentious January 26 Australia Day weekend . That frustration has led to fresh debate about whether the Cricket Australia board structure needs to be altered to allow the six state association owners to have their own direct representatives on the top table of decision-making. Loading CA’s chair, Lachlan Henderson, is in his final days in the role before handing over to the former New South Wales premier, Mike Baird , at the end of next week for a board meeting where next summer’s Test venues will be discussed The argument for the request for the New Year’s Test is based largely on Adelaide Oval’s consistent drawing and revenue-raising power for red or pink ball matches, regardless of the timing of the fixture or who Australia’s opponent may be. In early December, no fewer than 86,617 spectators filed into the oval to see Australia hand out a comprehensive defeat to the West Indies - in marked contrast to the 42,723 who attended the Perth Test a week before.","pubDate":"2023-02-02 18:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"IND vs AUS: टेस्ट सीरीज से पहले ऑस्ट्रेलियाई कोच के छूटने लगे हैं पसीने, सताने लगा है यह डर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-aus-spin-will-play-a-key-role-in-australias-success-in-india-mcdonald/articleshow/97560490.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: बॉर्डर-गावस्कर टेस्ट सीरीज से पहले ऑस्ट्रेलिया के मुख्य कोच एंड्रयू मैकडोनाल्ड का मानना है कि भारत के खिलाफ उसके घर में स्पिन गेंदबाजी का सामना करना सबसे बड़ी चुनौती होगी। इसे लेकर टीम के कोच ने अभी से अपने खिलाड़ियों को स्पिन गेंदबाजी के प्रैक्टिस में लगा दिया है।","content":"ऑस्ट्रेलिया के मुख्य कोच एंड्रयू मैकडोनाल्ड का मानना है कि आगामी बोर्डर-गावस्कर ट्रॉफी के चार टेस्ट मैचों में उनकी टीम के लिए सबसे बड़ी चुनौती भारतीय स्पिनरों से निबटना होगी। ऑस्ट्रेलियाई टीम अभी नौ फरवरी से नागपुर में होने वाले पहले टेस्ट मैच की तैयारियों में लगी है। मैकडोनाल्ड ने इससे पहले अपने बल्लेबाजों को आगाह करते हुए कहा कि उन्हें ‘स्लाइड स्पिन’ से निबटने के लिए अपने खुद के तरीके ढूंढने होंगे। ऑस्ट्रेलिया ने अभ्यास मैच खेलने के बजाय खुद ही अभ्यास करने को प्राथमिकता दी है। मैकडोनाल्ड ने बुधवार को टीम के बेंगलुरू रवाना होने से पहले कहा, 'मेरा मानना है की नई गेंद अधिक स्लाइड होती है। हम इसके लिए तैयारी कर रहे हैं।' उन्होंने कहा, 'यह ‘स्लाइड स्पिन’ है। पूरी संभावना है कि हमारे सलामी बल्लेबाजों को शुरू में स्पिन गेंदबाजों का सामना करना पड़ेगा, इसलिए अभ्यास के दौरान इस पर विशेष गौर किया जा रहा है तथा बल्लेबाजी कोच डिवा (माइकल डि वेंटो) इसमें अहम भूमिका निभा रहे हैं।' मैकडोनाल्ड ने कहा, 'सफलता की कुंजी इस तरह की गेंदबाजी को खेलने के लिए स्पष्टता होना है। यह व्यक्तिगत और परिस्थितियों पर निर्भर करेगी।' ऑस्ट्रेलिया की टीम अभी यहां अलूर में अभ्यास कर रही है। मैकडोनाल्ड ने कहा, 'हम यह सुनिश्चित करने की कोशिश कर रहे हैं कि बल्लेबाजों की अपने तरीके को लेकर स्पष्ट राय हो। आपको वैसी ही परिस्थितियां नहीं मिलेंगी जैसी मैच में होती हैं और किसी क्रिकेट दौरे से इस तरह की जटिलताएं जुड़ी होती हैं।' भारत और ऑस्ट्रेलिया के बीच चार टेस्ट मैचों की सीरीज का पहला मुकाबला नागपुर में 9 फरवरी से 13 फरवरी के बीच खेला जाना है।","pubDate":"2023-02-02 17:54:50","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Kyle Jamieson returns to New Zealand Test squad after a year following injury","link":"https://indianexpress.com/article/sports/cricket/kyle-jamieson-returns-to-the-new-zealand-test-squad-after-an-injury-layoff-8420730/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"New Zealand pacer Kyle Jamieson has been recalled into the Test squad after a one year hiatus following an injury against England for the two-match series at home. The 28-year-old had sustained a back injury in June last year while playing against England away from home. “Kyle is a very determined character with a strong desire to play international cricket for New Zealand,” said the Kiwis coach Gary Stead “Since he was forced from the field in Nottingham he’s been very clear that he wants to get his body right to return,” he added. Our Test Squad to face @englandcricket this month at Bay Oval and the Cello @BasinReserve . More | https://t.co/U8xFo3L7uO #NZvENG pic.twitter.com/mjSLShVDjq — BLACKCAPS (@BLACKCAPS) February 2, 2023 On Jamieson’s progress Stead added, “He’s reported good progress since his return to professional cricket with Auckland and he will get the opportunity to play some long-form cricket as part of the New Zealand XI Squad to face England in their warm-up match next week at Seddon Park.” Having made his debut against India during the two-match Test series in February 2020, Jamieson has picked up 72 wickets in 16 Test matches, averaging 19.4. Apart from Jamieson, leg-spinner Ish Sodhi retained his spot in the squad after an impressive outing in Pakistan with the ball. The 30-year-old was the leading wicket-taker of the series with 13 scalps. “Ish really impressed us with his approach with bat and ball. He’s worked very hard on both in recent years and it was great to see that on the international Test stage.” Stead said. Advertisement The first Test, a day night affair, will be played at the Bay Oval in Tauranga from February 16-20. Subscriber Only Stories View All UPSC Key- February 2, 2023: Know about Union Budget 2023-24 Adani contagion spreads as Indian benchmark nears correction Japanese literary giant Haruki Murakami to publish new novel after six years Union Budget 2023 | After targeting rural and urban poor, a 2024 signal: ... Monthly plan to access Budget Top Sports News Now How Kohli and Pujara’s issues against spin can be exploited by Australia in the Border-Gavaskar Trophy With newly-acquired boundary-clearing skill, classy Shubman is more dangerous than ever before Before Border-Gavaskar Trophy, Aussies skip practice games, use RCB connections to train on rank turners outside Bangalore Click here for more Squad: Tim Southee (c), Michael Bracewell, Tom Blundell (wk), Devon Conway, Matt Henry, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ish Sodhi, Blair Tickner, Neil Wagner, Kane Williamson , Will Young","pubDate":"2023-02-02 17:27:42","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"'India hosting its 1st ever Formula E race has huge significance for the sport'","link":"https://www.hindustantimes.com/sports/others/india-hosting-its-first-ever-formula-e-race-has-huge-significance-for-the-sport-101675357739444.html","keywords":null,"creator":null,"video_url":null,"description":"India will embark on a new motorsport journey next week, 10 years after the unceremonious exit of Formula 1","content":"India will embark on a new motorsport journey next week, 10 years after the unceremonious exit of Formula 1. Formula E – an all-electric racing series – will descend upon Telangana on February 10-11 for the first ever Indian race – the Hyderabad E-Prix. Now in its ninth season, Formula E is a traditional single-seater championship that was conceived in 2011 and debuted in 2014 with one major difference – everything from the brakes to the engine is powered by an electric battery and zero fuel. Rules, regulations, points, drivers, teams – most aspects are designed and styled on Formula 1, which is the pinnacle of motorsport. But the series looks towards a sustainable future while reducing carbon footprint. Only one driver has seen the sport evolve from the first ever Formula E race – the 2014 Beijing E-Prix – to the Hyderabad E-Prix that will be held on the banks of Hussain Sagar Lake on February 11 – Lucas di Grassi. The Brazilian is the most experienced and also the most successful driver on the Formula E grid with 103 races and 13 victories, also clinching the 2016-17 drivers’ championship. The Hyderabad E-Prix will not just be any other race for the 38-year-old as he will be one of the two drivers for Mahindra Racing – along with Oliver Rowland – the only Indian team on the grid. \"Having countries as big and important as India hosting its first ever Formula E race has huge significance for the sport. It opens up new markets for manufacturers. So, having an Indian race is incredible for the whole series,\" the former Formula 1 driver said on a video call from the Mahindra Racing base in Banbury. Teams like Mahindra, Nissan, Porsche, Jaguar, Maserati are currently racing in Formula E with the idea of promoting their electric vehicles in newer markets. After eight seasons with Audi and Venturi, di Grassi had a brilliant start with Mahindra, taking pole in the Mexico City E-Prix – the first race of the season – on January 14. He eventually finished third but the next two races in Diriyah did not deliver expected results as the former champion finished 13th and 15th. But the 38-year-old hopes to turn things around in Mahindra’s home race that will be held at the 2.8km, 18-turn Hyderabad Street Circuit which will host the fourth of the 16-race calendar. “My understanding is that it is a very fast track with a lot of overtaking opportunities. It is very technical and will be very difficult which will present the teams with a huge challenge,\" said di Grassi, who is also known as ‘Mr Formula E’. “You need to be very aggressive as a driver but also very efficient. It is going to be extremely hot which presents a different kind of challenge.\" Mahindra also signed up Formula 2 racer Jehan Daruvala as a reserve driver in December 2022. While Daruvala will continue to drive in F2, he will keep learning about Formula E, working on the simulator, helping in car development and race support to the team. “Jehan is a great kid. He is a talented driver, coming along and developing in Formula E right now. He is learning with every race in the simulator. If he has a future or not in Formula E... time will tell but we definitely need Indian racers as India is a very important market,\" said di Grassi, who will be flying into India on Wednesday for his third visit to the country. This Republic Day, unlock premium articles at 74% discount Enjoy Unlimited Digital Access with HT Premium Start 14 Days Free Trial Already Subscribed? Sign In SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics motor racing motor racing Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-02-02 17:19:44","image_url":"https://images.hindustantimes.com/img/2023/02/02/1600x900/PTI01-12-2023-000453B-0_1675360820760_1675360820760_1675360832664_1675360832664.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket-Pacer Jamieson returns to New Zealand squad for England tests","link":"https://www.thestar.com.my/sport/cricket/2023/02/03/cricket-pacer-jamieson-returns-to-new-zealand-squad-for-england-tests","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Kyle Jamieson has been named in New Zealand's squad for the two-test series against England later this month as the fast bowler makes his return to the side for the first time since pulling out of the England tour last year due to injury. Read full story","content":"(Reuters) - Kyle Jamieson has been named in New Zealand's squad for the two-test series against England later this month as the fast bowler makes his return to the side for the first time since pulling out of the England tour last year due to injury. The towering 28-year-old has been one of New Zealand's best pace bowlers in recent years, picking up 72 wickets in 16 matches since making his debut in 2020. He missed the final test against England in June last year and returned home after picking up a back injury during the second match at Trent Bridge, playing no part in their run chase. \"Kyle is a very determined character with a strong desire to play international cricket for New Zealand,\" coach Gary Stead said. \"Since he was forced from the field in Nottingham he's been very clear that he wants to get his body right to return. \"He's reported good progress since his return to professional cricket with Auckland and he will get the opportunity to play some long form cricket... (against) England in their warm-up match next week at Seddon Park.\" Wicketkeeper-batsman Tom Blundell and fast bowler Matt Henry both finished the tour of Pakistan with injuries but are expected to be fully fit for the home series which begins with a pink-ball day-night test in Tauranga from Feb. 16-20. Spinner Ish Sodhi also retains his place after finishing the Pakistan tour as the leading wicket-taker with 13 wickets but Ajaz Patel and Glenn Phillips miss out in the 14-man squad. NEW ZEALAND SQUAD Tim Southee (captain), Michael Bracewell, Tom Blundell (wicketkeeper), Devon Conway, Matt Henry, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ish Sodhi, Blair Tickner, Neil Wagner, Kane Williamson, Will Young (Reporting by Rohith Nair in Bengaluru; Editing by Toby Davis)","pubDate":"2023-02-02 16:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/02/03/1926273.jpg","source_id":"thestar_my","category":["sports"],"country":["malaysia"],"language":"english"},{"title":"News24.com | Belligerent Tryon blasts Proteas to Tri-Series win over India","link":"https://www.news24.com/sport/Cricket/Proteas/belligerent-tryon-blasts-proteas-to-tri-series-win-over-india-20230202","keywords":null,"creator":null,"video_url":null,"description":"A brilliant half-century by all-rounder Chloe Tryon guided the Proteas to a 5-wicket win over India in the Tri-Series final at Buffalo Park in East London on Thursday.","content":"A brilliant half-century by all-rounder Chloe Tryon guided the Proteas to a 5-wicket win over India in the Tri-Series final at Buffalo Park in East London on Thursday. After India won the toss and opted to make first use of the wicket, they were in immediate trouble when left-arm spinner Nonkululeko Mlaba bowled Smriti Mandhana for an eight-ball duck. From that point, India struggled to find their way into the contest, and after the powerplay, the Proteas were well on top after restricting the visitors to 18 for 1 at a run rate of just 3 per over. That slow rate led to the dismissal of Jemimah Rodrigues (11) as she was brilliantly stumped by Sinalo Jafta as the impressive Mlaba (2/16) snared her second wicket to leave India on 21 for 2 at the end of the second over. India desperately needed a partnership, which came from captain Harmanpreet Kaur and Harleen Deol, who put on 48 for the third wicket. Kaur led the way, scoring 21 at a run-a-ball, but she was out in the 15th over, trying to launch Sune Luus (1/22) over extra cover only to be stumped by Jafta to leave India at 69-3 with five overs left in their innings. Deol (46) continued in the anchor role for India, losing her wicket in the final over when she was bowled by Ayabonga Khaka (1/17). Together with Deepti Sharma, Deol helped India to 109 for 4 after their 20 overs. That total, while not substantial, was still a difficult target considering the slowness of the Buffalo Park pitch and the Indian attack, which included several spinners. That was obvious from the first over from off-spinner Deepti Sharma bowled a maiden to Laura Wolvaardt. India then opted for the left-arm spin of Rajeshwari Gayakwad for the second over, but Tazmin Brits showed some positive intent by launching her over mid-wicket for a massive 6. Wolvaardt, who looked troubled for most of her brief innings, was out in the third over, bowled by Sharma for 0. Lara Goodall joined Britz at the wicket, and she was soon off the mark as the Proteas moved to 8-1 after three overs. Britz (8) fell in the sixth over, caught behind off Sneh Rana to leave the Proteas on 19 for 2 after the powerplay. That became 21/3 just three balls later as Goodall (7) was bowled by Gayakwad, trying to up the run rate. With Chloe Tryon and Sune Luus at the crease, the Proteas needed a big partnership to claw their way back into the match. Tryon was quickly onto the attack, hitting two boundaries off Devika Vaidya in her opening over. Luus and Tryon seemed in control until Luus (12) was out, caught at short third man off the bowling of Renuka Singh to leave the Proteas on 47 for 4 after 10.2 overs. A partnership of 19 runs between Tryon and Annerie Dercksen (8) saw South Africa move to 67 for 5 before the latter was caught off a leading edge. Needing 44 off 41 balls, Nadine de Klerk came to the wicket to join Tryon. Tryon stood strong and blasted the Proteas to victory as she ended on 51* off just 31 balls (with six fours and two sixes), putting on 47 for the 7th wicket with De Klerk (17*) in just 4.5 overs as the Proteas got home with 12 balls to spare. Scores in brief: India 109/4 in 20 overs (Deol 46, Kaur 21, Mlaba 2/16) South Africa 113/5 in 18 overs (Tryon 51*, De Klerk 17*, Rana 2/21)","pubDate":"2023-02-02 16:28:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas lose vital Super League point after slow over-rate in 3rd England ODI","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-lose-vital-super-league-point-after-slow-over-rate-in-3rd-england-odi-20230202","keywords":null,"creator":null,"video_url":null,"description":"While they have improved their position in trying to qualify for the World Cup later this year in India by winning the ODI series against England 2-1, there was bad news for the Proteas following the third ODI.","content":"While they have improved their position in trying to qualify for the World Cup later this year in India by winning the ODI series against England 2-1, there was bad news for the Proteas on Thursday following the third ODI in Kimberley. READ | Proteas skipper Bavuma lands SA20 gig after impressive ODI form A statement from the International Cricket Council (ICC) confirmed that Temba Bavuma's charges were not only docked 20% of their match fee but also lost a Super League point for their tardiness during the first innings of the clash while bowling to England. The latter is certainly more of a concern for South Africa as they look to India and the World Cup later this year. \"Referees imposed the sanction after South Africa were ruled to be one over short of the target after time allowances were taken into consideration,\" the statement read. \"In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel , which relates to minimum over-rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time. \"In addition, as per Article 16.12.2 of the ICC Men’s Cricket World Cup Super League Playing Conditions, a side is penalised one point for each over short. Consequently, South Africa will lose one point from their points tally in the Super League standings.\" A formal hearing wasn't necessary for the offence as Bavuma had pleaded guilty and accepted the sanctions proposed by the ICC. South Africa are currently in ninth position on the Super League table with 78 points, with the West Indies in 8th position with 88 points.","pubDate":"2023-02-02 16:28:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Temba Bavuma clinches SA20 contract to continue feel-good summer of SA cricket","link":"https://www.dailymaverick.co.za/article/2023-02-02-temba-bavuma-clinches-sa20-contract-to-continue-feel-good-summer-of-sa-cricket/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Sunrisers Eastern Cape on Thursday announced the signing of national white-ball skipper Temba Bavuma which, along with the Proteas’ turn in form, continues the upward trajectory of cricket in South Africa this summer. The post Temba Bavuma clinches SA20 contract to continue feel-good summer of SA cricket appeared first on Daily Maverick.","content":"After a two-year cricket hiatus for spectators at stadiums — due to the Covid-19 pandemic — South Africa has been saturated with cricket since the start of the year. The inaugural season of the country’s premier T20 competition, the SA20, has made a superb start with almost every match sold out. Smack-bang in the middle of the SA20, the Proteas played a vital three-match 50-over series against England — which they won 2-1. After having been snubbed at the SA20 auction, national white-ball captain Temba Bavuma came back rejuvenated in the series and top-scored for South Africa. He made a total of 180 runs with a highest score of 109, as he led from the front, batting at a strike rate of more than a run a ball in all three innings. Bavuma’s incredible form in the series against England helped him secure a contract with the Sunrisers Eastern Cape for the back end of the SA20 — a little late, but rather that than never. The SA20 has been well received for its quality of cricket and staunch support around the country, from the band at St George’s Park in Gqeberha to the loud stadium announcers at Newlands, Cape Town. “There are new voices, new faces. It gives an opportunity to some of our domestic cricketers that have never been exposed to that stage to rub shoulders with some of the best players internationally but also within [the country],” said Cricket South Africa (CSA) Director of Cricket Enoch Nkwe. “So far, it’s been exciting. It’s good to see different cricketers stepping up at different times. Hopefully, it grows from strength to strength and it continues to have that positive impact on South African cricket.” A few days after the SA20 kicked off, the Women’s Under-19 World Cup started in Potchefstroom. And a day before the final of the SA20 final, the Women’s T20 World Cup kicks off in Cape Town. To say the South African cricket schedule is filled would be an understatement. But Nkwe would have wanted even more cricket. “Some of the supporters would have wanted it to start over the festive season in December with a couple of Test matches, going into the shorter formats,” said Nkwe. “It’s a fantastic opportunity for us to continue to promote the game — both men and women. “It’s a dream to have our country host the Under-19 World Cup and the senior World Cup in the same season.” South Africa’s Under-19 women’s team was unlucky to not make the semifinals of the World Cup after missing out on net run rate despite only losing one match all tournament. “Hopefully, the [senior] ladies can build on that women’s cricket momentum, following the way the Under-19s have started,” Nkwe said. The Proteas Women are in the best position they have yet been in to win a World Cup. They have made the semifinals of the past two editions of the shortest tournament format and playing at home with large crowd support will only help their cause. Head coach Hilton Moreeng has now been in charge of the side for 11 years. He has overseen the team’s golden generation and despite the positive strides he has made with the squad, he is yet to capture gold of any kind with the team. Moreeng’s contract finishes at the end of this season and Nkwe said a decision on his future would be made after the World Cup, with an eye on the next two global tournaments. Whether he succeeds or fails at the home tournament, questions remain on whether he has achieved as much as he could with the star-studded group of players. “His contract finishes at the end of the season. Our focus currently is on the World Cup. After the tournament, we’ll do a full review and then see how we plan forward with the coaching staff,” said Nkwe. “We’re going to be sitting down with the players individually to plan forward. Post-World Cup, we need to plan for the next two years because there’s a T20 World Cup next year and there’s a 50-over World Cup in 2025. “There’s not really a lot of time and there’s still a lot of work to be done. We need to continue to build on the work that has been done and plan for the next two years.” The focus, according to Nkwe, is to incorporate younger players in the team gradually to ensure the retirement of players from the golden generation does not have too great an impact on the performance of the national team. Visit Daily Maverick’s home page for more news, analysis and investigations Mignon du Preez and Lizelle Lee retired last year, and opening bowlers Marizanne Kapp and Shabnim Ismail are both closer to 35 than 30. The 21-year-old all-rounder Annerie Dercksen made her debut in the recent tri-series against West Indies and India, while 22-year-old wicketkeeper batter Tebogo Macheke spent some time around the national team recently. “There’s a good mix of young and experienced players at the moment, but we don’t want to be caught on the back foot if some of the experienced players decide to retire soon,” said Nkwe. “We need to ensure these younger players transition well into the senior team.” Nkwe said the SA20 has plans to include a women’s edition of the tournament in the near future which would further help reduce the gap between provincial and national cricket — one of the major problems in South African women’s cricket at the moment. Australia’s premier T20 competition, the Big Bash League, has the Women’s Big Bash League, which has proven to be extremely successful. India recently announced the Women’s Premier League, the women’s version of the most popular T20 league in the world, the Indian Premier League. On 25 January, multiple investors bought franchise rights to the five teams in a closed bidding process which raised a total of close to R10-billion. Even though Nkwe said he could not confirm when the women’s edition of the SA20 would be announced, the fact that it is in the works enhances the feel-good factor currently prevalent in South African cricket. DM","pubDate":"2023-02-02 21:24:50","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Proteas hoping home advantage will help break ICC tournament duck","link":"https://www.thesouthafrican.com/sport/cricket/proteas/home-advantage-breaking-icc-tournament-duck-2-february-2023/","keywords":["Proteas","Featured","Important","South Africa","Sune Luus"],"creator":["James Richardson"],"video_url":null,"description":"Proteas skipper Sune Luus says that the team are determined to put past heartaches behind them and secure a first ICC trophy.","content":"Proteas skipper Sune Luus says that the team are determined to put past heartaches behind them and secure a first ICC trophy in the upcoming Women’s T20 World Cup. Luus feels that playing at home will give the Proteas an edge. Proteas out to end ICC tournament heartache Luus told the ICC : “With it being a home World Cup, we’re very excited. We’re going to have all our family and friends at every game, so that’s also very exciting. “The aim for every team in the World Cup is obviously to win that trophy. In the past we’ve come so close every time; we’ve made the semi-finals and then having to go through that loss. So hopefully this year is our year, where we can actually get through the semi-finals, get into that final and hopefully keep the trophy in South Africa. That would be amazing. “The preparations have been very good. We’ve played our league games in the Tri-Series against India and the West Indies, and that’s been going very well. “We are used to the conditions, obviously being a home World Cup as well, we know what to expect from every ground we’re going to be playing on. Hopefully we can use that to our advantage.” Stars abound Luus is delighted to be able to call on so many stars to boost the Proteas bid. “We’re a very well-balanced team. This year we have a good balance of experienced players as well as new youngsters coming through. That makes it very exciting for us. “Our bowling attack has always been our strong suit, but I think we have a very powerful batting lineup as well. That’s something I look forward to seeing come to the fore in this World Cup. “We have our standouts. We have Marizanne Kapp in the team, she’s always a very good T20 player. Laura Wolvaardt up the order as well. Chloe Tryon is very powerful as well, and also Shabnim Ismail, our pocket rocket. “And then we have some youngsters coming through. Nadine de Clark, someone I think is a very underrated cricketer, but is very good, and Nonkululeko Mlaba, she’s a very good bowler and also someone that I think is very underrated.” ALSO READ: Proteas dealt World Cup blow with over-rate penalty Luus hopes Proteas can make magic Luus believes that the stage is set for a magic moment for the Proteas. “It’s really exciting to see where we are going to be this year in the World Cup. “South Africa is a great venue. We have a great crowd coming in. We have a good vibe as well around the country. “Playing at two coastal venues, it’s going to be low and slow. but the groundsmen might surprise us, you never know what they will give us. Paarl is going to be very hot, and it might also be slow. With the SA20 on all the pitches at the moment, they are a bit worn and torn, so it’s going to be interesting to see how they play. “A successful tournament at this year’s World Cup would be massive. I don’t think I can explain the magnitude of what a tournament victory could do for our country and women’s cricket, and just women’s sport in general. “The only way to do that is by winning a trophy, but if that’s what it takes, then we’re up for the challenge to inspire the next generation to pick up the bat and the ball and for people to take women’s sport and women’s cricket seriously. “The women’s game has transformed a lot over the years. It has grown so much and it’s very exciting with all the leagues coming up and the Women’s IPL (Women’s Premier League) starting soon. “T20 International cricket is also always fun, it brings in the crowd and I’m hoping for this World Cup the crowds will be coming in their numbers. I know our PE (Gqeberha) game is already sold out, so that’s very exciting.” CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-02 20:44:10","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Betway SA20: Quinton de Kock lauds breath of fresh air","link":"https://www.thesouthafrican.com/sport/cricket/sa-cricket/betway-sa20-quinton-de-kock-breaking-thursday-2-february-2023/","keywords":["SA Cricket","Featured","Quinton de Kock","SA20 League","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"Durban's Super Giants skipper Quinton de Kock believes that the Betway SA20 is set to breathe new life into the T20 franchise scene.","content":"Durban’s Super Giants skipper Quinton de Kock believes that the Betway SA20 is set to breathe new life into the T20 franchise scene. SA20 is something South African cricket needed De Kock feels that the South African tournament could become one mentioned in the same light as the Indian Premier League and Big Bash. “It’s exciting. I think this is something that South African cricket has needed for a while now,” De Kock told Betway . “This is in the same bracket as some big competitions, such as the IPL, PSL and Big Bash. “A lot of IPL investors are involved in this competition so it’s obviously a big thing for us.” Quinton de Kock feels bowlers will stand out De Kock says that the SA20 offers something different and shows off just how strong the bowling stocks are in South Africa. “Some of the world-class talent arriving in South Africa will help the younger guys, too. “I’m lucky to have Lance Klusener as coach, who I’ve worked with before and some of the players passed to us from within the franchise as well, too, so I’m excited.” SA20 learning experience De Kock is delighted with the strong group of overseas players who have turned out and feels it will be a big boost to the Proteas white-ball aspirations to have local players test themselves against the best. “We’re playing against world-class players who have won World Cups and multiple franchise competitions. A previous IPL winner, De Kock believes consistency and confidence are the keys to winning franchise trophies. ALSO READ: What needs to happen for Proteas to qualify for Cricket World Cup “The key is to be consistent in the way that you do things as a team. Teams that win trophies know what their brand of cricket is and they stick to it. CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-02 18:52:12","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"South Australia in audacious bid to pinch Sydney’s New Year’s Test","link":"https://www.watoday.com.au/sport/cricket/south-australia-in-audacious-bid-to-pinch-sydney-s-new-year-s-test-20230202-p5chj7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"South Australia, its premier and state cricket association have made a bold bid to take the New Year’s Test from the SCG to the Adelaide Oval.","content":"South Australia, its ambitious premier and state association have made a bid to take the New Year’s Test match from Sydney to Adelaide Oval. Senior cricket sources have told The Age and The Sydney Morning Herald that Premier Peter Malinauskas and the South Australian Cricket Association (SACA) have approached Cricket Australia about trying to pinch the New Year’s Test, customarily played at the Sydney Cricket Ground. Premier Peter Malinauskas wants the New Year’s Test to be played at Adelaide Oval. Credit: Getty Malinauskas made a splash last year by overseeing a winning bid for the AFL’s “gather round” where all matches in an individual round will be played in Adelaide later this year. In the same breath, the SACA’s leadership is angered by the fact the stadium has been pencilled in for another West Indies Test match next season, to be played around the contentious January 26 Australia Day weekend . That frustration has led to fresh debate about whether the Cricket Australia board structure needs to be altered to allow the six state association owners to have their own direct representatives on the top table of decision-making. Loading CA’s chair, Lachlan Henderson, is in his final days in the role before handing over to the former New South Wales premier, Mike Baird , at the end of next week for a board meeting where next summer’s Test venues will be discussed The argument for the request for the New Year’s Test is based largely on Adelaide Oval’s consistent drawing and revenue-raising power for red or pink ball matches, regardless of the timing of the fixture or who Australia’s opponent may be. In early December, no fewer than 86,617 spectators filed into the oval to see Australia hand out a comprehensive defeat to the West Indies - in marked contrast to the 42,723 who attended the Perth Test a week before.","pubDate":"2023-02-02 18:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"IND vs AUS: टेस्ट सीरीज से पहले ऑस्ट्रेलियाई कोच के छूटने लगे हैं पसीने, सताने लगा है यह डर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-aus-spin-will-play-a-key-role-in-australias-success-in-india-mcdonald/articleshow/97560490.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS: बॉर्डर-गावस्कर टेस्ट सीरीज से पहले ऑस्ट्रेलिया के मुख्य कोच एंड्रयू मैकडोनाल्ड का मानना है कि भारत के खिलाफ उसके घर में स्पिन गेंदबाजी का सामना करना सबसे बड़ी चुनौती होगी। इसे लेकर टीम के कोच ने अभी से अपने खिलाड़ियों को स्पिन गेंदबाजी के प्रैक्टिस में लगा दिया है।","content":"ऑस्ट्रेलिया के मुख्य कोच एंड्रयू मैकडोनाल्ड का मानना है कि आगामी बोर्डर-गावस्कर ट्रॉफी के चार टेस्ट मैचों में उनकी टीम के लिए सबसे बड़ी चुनौती भारतीय स्पिनरों से निबटना होगी। ऑस्ट्रेलियाई टीम अभी नौ फरवरी से नागपुर में होने वाले पहले टेस्ट मैच की तैयारियों में लगी है। मैकडोनाल्ड ने इससे पहले अपने बल्लेबाजों को आगाह करते हुए कहा कि उन्हें ‘स्लाइड स्पिन’ से निबटने के लिए अपने खुद के तरीके ढूंढने होंगे। ऑस्ट्रेलिया ने अभ्यास मैच खेलने के बजाय खुद ही अभ्यास करने को प्राथमिकता दी है। मैकडोनाल्ड ने बुधवार को टीम के बेंगलुरू रवाना होने से पहले कहा, 'मेरा मानना है की नई गेंद अधिक स्लाइड होती है। हम इसके लिए तैयारी कर रहे हैं।' उन्होंने कहा, 'यह ‘स्लाइड स्पिन’ है। पूरी संभावना है कि हमारे सलामी बल्लेबाजों को शुरू में स्पिन गेंदबाजों का सामना करना पड़ेगा, इसलिए अभ्यास के दौरान इस पर विशेष गौर किया जा रहा है तथा बल्लेबाजी कोच डिवा (माइकल डि वेंटो) इसमें अहम भूमिका निभा रहे हैं।' मैकडोनाल्ड ने कहा, 'सफलता की कुंजी इस तरह की गेंदबाजी को खेलने के लिए स्पष्टता होना है। यह व्यक्तिगत और परिस्थितियों पर निर्भर करेगी।' ऑस्ट्रेलिया की टीम अभी यहां अलूर में अभ्यास कर रही है। मैकडोनाल्ड ने कहा, 'हम यह सुनिश्चित करने की कोशिश कर रहे हैं कि बल्लेबाजों की अपने तरीके को लेकर स्पष्ट राय हो। आपको वैसी ही परिस्थितियां नहीं मिलेंगी जैसी मैच में होती हैं और किसी क्रिकेट दौरे से इस तरह की जटिलताएं जुड़ी होती हैं।' भारत और ऑस्ट्रेलिया के बीच चार टेस्ट मैचों की सीरीज का पहला मुकाबला नागपुर में 9 फरवरी से 13 फरवरी के बीच खेला जाना है।","pubDate":"2023-02-02 17:54:50","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Kyle Jamieson returns to New Zealand Test squad after a year following injury","link":"https://indianexpress.com/article/sports/cricket/kyle-jamieson-returns-to-the-new-zealand-test-squad-after-an-injury-layoff-8420730/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"New Zealand pacer Kyle Jamieson has been recalled into the Test squad after a one year hiatus following an injury against England for the two-match series at home. The 28-year-old had sustained a back injury in June last year while playing against England away from home. “Kyle is a very determined character with a strong desire to play international cricket for New Zealand,” said the Kiwis coach Gary Stead “Since he was forced from the field in Nottingham he’s been very clear that he wants to get his body right to return,” he added. Our Test Squad to face @englandcricket this month at Bay Oval and the Cello @BasinReserve . More | https://t.co/U8xFo3L7uO #NZvENG pic.twitter.com/mjSLShVDjq — BLACKCAPS (@BLACKCAPS) February 2, 2023 On Jamieson’s progress Stead added, “He’s reported good progress since his return to professional cricket with Auckland and he will get the opportunity to play some long-form cricket as part of the New Zealand XI Squad to face England in their warm-up match next week at Seddon Park.” Having made his debut against India during the two-match Test series in February 2020, Jamieson has picked up 72 wickets in 16 Test matches, averaging 19.4. Apart from Jamieson, leg-spinner Ish Sodhi retained his spot in the squad after an impressive outing in Pakistan with the ball. The 30-year-old was the leading wicket-taker of the series with 13 scalps. “Ish really impressed us with his approach with bat and ball. He’s worked very hard on both in recent years and it was great to see that on the international Test stage.” Stead said. Advertisement The first Test, a day night affair, will be played at the Bay Oval in Tauranga from February 16-20. Subscriber Only Stories View All UPSC Key- February 2, 2023: Know about Union Budget 2023-24 Adani contagion spreads as Indian benchmark nears correction Japanese literary giant Haruki Murakami to publish new novel after six years Union Budget 2023 | After targeting rural and urban poor, a 2024 signal: ... Monthly plan to access Budget Top Sports News Now How Kohli and Pujara’s issues against spin can be exploited by Australia in the Border-Gavaskar Trophy With newly-acquired boundary-clearing skill, classy Shubman is more dangerous than ever before Before Border-Gavaskar Trophy, Aussies skip practice games, use RCB connections to train on rank turners outside Bangalore Click here for more Squad: Tim Southee (c), Michael Bracewell, Tom Blundell (wk), Devon Conway, Matt Henry, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ish Sodhi, Blair Tickner, Neil Wagner, Kane Williamson , Will Young","pubDate":"2023-02-02 17:27:42","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"'India hosting its 1st ever Formula E race has huge significance for the sport'","link":"https://www.hindustantimes.com/sports/others/india-hosting-its-first-ever-formula-e-race-has-huge-significance-for-the-sport-101675357739444.html","keywords":null,"creator":null,"video_url":null,"description":"India will embark on a new motorsport journey next week, 10 years after the unceremonious exit of Formula 1","content":"India will embark on a new motorsport journey next week, 10 years after the unceremonious exit of Formula 1. Formula E – an all-electric racing series – will descend upon Telangana on February 10-11 for the first ever Indian race – the Hyderabad E-Prix. Now in its ninth season, Formula E is a traditional single-seater championship that was conceived in 2011 and debuted in 2014 with one major difference – everything from the brakes to the engine is powered by an electric battery and zero fuel. Rules, regulations, points, drivers, teams – most aspects are designed and styled on Formula 1, which is the pinnacle of motorsport. But the series looks towards a sustainable future while reducing carbon footprint. Only one driver has seen the sport evolve from the first ever Formula E race – the 2014 Beijing E-Prix – to the Hyderabad E-Prix that will be held on the banks of Hussain Sagar Lake on February 11 – Lucas di Grassi. The Brazilian is the most experienced and also the most successful driver on the Formula E grid with 103 races and 13 victories, also clinching the 2016-17 drivers’ championship. The Hyderabad E-Prix will not just be any other race for the 38-year-old as he will be one of the two drivers for Mahindra Racing – along with Oliver Rowland – the only Indian team on the grid. \"Having countries as big and important as India hosting its first ever Formula E race has huge significance for the sport. It opens up new markets for manufacturers. So, having an Indian race is incredible for the whole series,\" the former Formula 1 driver said on a video call from the Mahindra Racing base in Banbury. Teams like Mahindra, Nissan, Porsche, Jaguar, Maserati are currently racing in Formula E with the idea of promoting their electric vehicles in newer markets. After eight seasons with Audi and Venturi, di Grassi had a brilliant start with Mahindra, taking pole in the Mexico City E-Prix – the first race of the season – on January 14. He eventually finished third but the next two races in Diriyah did not deliver expected results as the former champion finished 13th and 15th. But the 38-year-old hopes to turn things around in Mahindra’s home race that will be held at the 2.8km, 18-turn Hyderabad Street Circuit which will host the fourth of the 16-race calendar. “My understanding is that it is a very fast track with a lot of overtaking opportunities. It is very technical and will be very difficult which will present the teams with a huge challenge,\" said di Grassi, who is also known as ‘Mr Formula E’. “You need to be very aggressive as a driver but also very efficient. It is going to be extremely hot which presents a different kind of challenge.\" Mahindra also signed up Formula 2 racer Jehan Daruvala as a reserve driver in December 2022. While Daruvala will continue to drive in F2, he will keep learning about Formula E, working on the simulator, helping in car development and race support to the team. “Jehan is a great kid. He is a talented driver, coming along and developing in Formula E right now. He is learning with every race in the simulator. If he has a future or not in Formula E... time will tell but we definitely need Indian racers as India is a very important market,\" said di Grassi, who will be flying into India on Wednesday for his third visit to the country. This Republic Day, unlock premium articles at 74% discount Enjoy Unlimited Digital Access with HT Premium Start 14 Days Free Trial Already Subscribed? Sign In SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics motor racing motor racing Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-02-02 17:19:44","image_url":"https://images.hindustantimes.com/img/2023/02/02/1600x900/PTI01-12-2023-000453B-0_1675360820760_1675360820760_1675360832664_1675360832664.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket-Pacer Jamieson returns to New Zealand squad for England tests","link":"https://www.thestar.com.my/sport/cricket/2023/02/03/cricket-pacer-jamieson-returns-to-new-zealand-squad-for-england-tests","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Kyle Jamieson has been named in New Zealand's squad for the two-test series against England later this month as the fast bowler makes his return to the side for the first time since pulling out of the England tour last year due to injury. Read full story","content":"(Reuters) - Kyle Jamieson has been named in New Zealand's squad for the two-test series against England later this month as the fast bowler makes his return to the side for the first time since pulling out of the England tour last year due to injury. The towering 28-year-old has been one of New Zealand's best pace bowlers in recent years, picking up 72 wickets in 16 matches since making his debut in 2020. He missed the final test against England in June last year and returned home after picking up a back injury during the second match at Trent Bridge, playing no part in their run chase. \"Kyle is a very determined character with a strong desire to play international cricket for New Zealand,\" coach Gary Stead said. \"Since he was forced from the field in Nottingham he's been very clear that he wants to get his body right to return. \"He's reported good progress since his return to professional cricket with Auckland and he will get the opportunity to play some long form cricket... (against) England in their warm-up match next week at Seddon Park.\" Wicketkeeper-batsman Tom Blundell and fast bowler Matt Henry both finished the tour of Pakistan with injuries but are expected to be fully fit for the home series which begins with a pink-ball day-night test in Tauranga from Feb. 16-20. Spinner Ish Sodhi also retains his place after finishing the Pakistan tour as the leading wicket-taker with 13 wickets but Ajaz Patel and Glenn Phillips miss out in the 14-man squad. NEW ZEALAND SQUAD Tim Southee (captain), Michael Bracewell, Tom Blundell (wicketkeeper), Devon Conway, Matt Henry, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ish Sodhi, Blair Tickner, Neil Wagner, Kane Williamson, Will Young (Reporting by Rohith Nair in Bengaluru; Editing by Toby Davis)","pubDate":"2023-02-02 16:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/02/03/1926273.jpg","source_id":"thestar_my","category":["sports"],"country":["malaysia"],"language":"english"},{"title":"News24.com | Belligerent Tryon blasts Proteas to Tri-Series win over India","link":"https://www.news24.com/sport/Cricket/Proteas/belligerent-tryon-blasts-proteas-to-tri-series-win-over-india-20230202","keywords":null,"creator":null,"video_url":null,"description":"A brilliant half-century by all-rounder Chloe Tryon guided the Proteas to a 5-wicket win over India in the Tri-Series final at Buffalo Park in East London on Thursday.","content":"A brilliant half-century by all-rounder Chloe Tryon guided the Proteas to a 5-wicket win over India in the Tri-Series final at Buffalo Park in East London on Thursday. After India won the toss and opted to make first use of the wicket, they were in immediate trouble when left-arm spinner Nonkululeko Mlaba bowled Smriti Mandhana for an eight-ball duck. From that point, India struggled to find their way into the contest, and after the powerplay, the Proteas were well on top after restricting the visitors to 18 for 1 at a run rate of just 3 per over. That slow rate led to the dismissal of Jemimah Rodrigues (11) as she was brilliantly stumped by Sinalo Jafta as the impressive Mlaba (2/16) snared her second wicket to leave India on 21 for 2 at the end of the second over. India desperately needed a partnership, which came from captain Harmanpreet Kaur and Harleen Deol, who put on 48 for the third wicket. Kaur led the way, scoring 21 at a run-a-ball, but she was out in the 15th over, trying to launch Sune Luus (1/22) over extra cover only to be stumped by Jafta to leave India at 69-3 with five overs left in their innings. Deol (46) continued in the anchor role for India, losing her wicket in the final over when she was bowled by Ayabonga Khaka (1/17). Together with Deepti Sharma, Deol helped India to 109 for 4 after their 20 overs. That total, while not substantial, was still a difficult target considering the slowness of the Buffalo Park pitch and the Indian attack, which included several spinners. That was obvious from the first over from off-spinner Deepti Sharma bowled a maiden to Laura Wolvaardt. India then opted for the left-arm spin of Rajeshwari Gayakwad for the second over, but Tazmin Brits showed some positive intent by launching her over mid-wicket for a massive 6. Wolvaardt, who looked troubled for most of her brief innings, was out in the third over, bowled by Sharma for 0. Lara Goodall joined Britz at the wicket, and she was soon off the mark as the Proteas moved to 8-1 after three overs. Britz (8) fell in the sixth over, caught behind off Sneh Rana to leave the Proteas on 19 for 2 after the powerplay. That became 21/3 just three balls later as Goodall (7) was bowled by Gayakwad, trying to up the run rate. With Chloe Tryon and Sune Luus at the crease, the Proteas needed a big partnership to claw their way back into the match. Tryon was quickly onto the attack, hitting two boundaries off Devika Vaidya in her opening over. Luus and Tryon seemed in control until Luus (12) was out, caught at short third man off the bowling of Renuka Singh to leave the Proteas on 47 for 4 after 10.2 overs. A partnership of 19 runs between Tryon and Annerie Dercksen (8) saw South Africa move to 67 for 5 before the latter was caught off a leading edge. Needing 44 off 41 balls, Nadine de Klerk came to the wicket to join Tryon. Tryon stood strong and blasted the Proteas to victory as she ended on 51* off just 31 balls (with six fours and two sixes), putting on 47 for the 7th wicket with De Klerk (17*) in just 4.5 overs as the Proteas got home with 12 balls to spare. Scores in brief: India 109/4 in 20 overs (Deol 46, Kaur 21, Mlaba 2/16) South Africa 113/5 in 18 overs (Tryon 51*, De Klerk 17*, Rana 2/21)","pubDate":"2023-02-02 16:28:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas lose vital Super League point after slow over-rate in 3rd England ODI","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-lose-vital-super-league-point-after-slow-over-rate-in-3rd-england-odi-20230202","keywords":null,"creator":null,"video_url":null,"description":"While they have improved their position in trying to qualify for the World Cup later this year in India by winning the ODI series against England 2-1, there was bad news for the Proteas following the third ODI.","content":"While they have improved their position in trying to qualify for the World Cup later this year in India by winning the ODI series against England 2-1, there was bad news for the Proteas on Thursday following the third ODI in Kimberley. READ | Proteas skipper Bavuma lands SA20 gig after impressive ODI form A statement from the International Cricket Council (ICC) confirmed that Temba Bavuma's charges were not only docked 20% of their match fee but also lost a Super League point for their tardiness during the first innings of the clash while bowling to England. The latter is certainly more of a concern for South Africa as they look to India and the World Cup later this year. \"Referees imposed the sanction after South Africa were ruled to be one over short of the target after time allowances were taken into consideration,\" the statement read. \"In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel , which relates to minimum over-rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time. \"In addition, as per Article 16.12.2 of the ICC Men’s Cricket World Cup Super League Playing Conditions, a side is penalised one point for each over short. Consequently, South Africa will lose one point from their points tally in the Super League standings.\" A formal hearing wasn't necessary for the offence as Bavuma had pleaded guilty and accepted the sanctions proposed by the ICC. South Africa are currently in ninth position on the Super League table with 78 points, with the West Indies in 8th position with 88 points.","pubDate":"2023-02-02 16:28:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"}]}