{"newsArray":[{"title":"Nick Kyrgios and Roger Federer emerge in French Open’s crying ballkid saga: ‘Now it gets ridiculous’","link":"https://7news.com.au/sport/tennis/nick-kyrgios-and-roger-federer-emerge-in-french-opens-crying-ballkid-saga-now-it-gets-ridiculous-c-10890075","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"‘Roger used to do this all the time .... and it’s a round of applause.’","content":"and Roger Federer have suddenly emerged in the middle of the disqualification saga that unfolded in a doubles match, with the Australian firebrand belatedly reacting to the incident. Miyu Kato was on Sunday when she lobbed a ball towards a ballkid, who was struck and left crying. Watch the latest sport on Channel 7 or stream for free on At first, chair umpire Alexandre Juge only issued a warning to Kato but - after opponents Marie Bouzkova and Sara Sorribes Tormo complained - referee Remy Azemar and Grand Slam supervisor Australian Wayne McKewen stepped in and ruled that Kato and her partner, Aldila Sutjiadi of Indonesia, were indeed disqualified. The tennis world erupted after the unfortunate episode given the gentle nature of the lobbed return that made the ballkid cry. Kato earned significant support in the wake of the incident as Bouzkova and Sorribes Tormo bore the brunt of the heavy criticism. French tennis player Lucas Pouille called their behaviour “shameful” while countryman Gilles Simon hoped “they (would) have a little trouble falling asleep”. Alize Cornet, another local hero, said it was an “insane decision” and sent a pointed message to Kato’s opponents. Kyrgios also had little sympathy for Sorribes Tormo and Bouzkova over fan criticism on their Instagram posts. “Boo hoo,” he wrote. “All around the world, whether it be having people chanting your name, idolising you, getting booed at, it’s always going to be a factor in sport,” Kyrgios added. But Kyrgios noted that rules were rules and the disqualification was just bad luck. “Why are we having so many people complain about it? Also, it’s not about the intent. If you a hit a ball at a kid, it’s a default.” That remark drew the ire of fans who - in the main - believe the disqualification call was extreme. Leading tennis journalist Ben Rothenberg also joined the debate and posted a short clip of retired great Roger Federer. who had a penchant for deliberately testing out ballkids’ catching skills.. “Regardless of if this was the right call or not, and I don’t think it was, players can afford to be more careful with this stuff,” Rothenberg said. “Roger Federer, notably, often played with fire by zipping balls at ball boys in Australia to test their cricket catches. Mixed results.” In the clip, Federer is seen hitting the ball just wide of one ballkid (who takes a ripping catch), while another ballkid is hit after Federer whacked a shot from behind his back. The difference in that incident was that the ballkid was able to laugh it off despite the force of the shot. And ATP tennis commentator Rob Koenig also brought up Federer. “No way this is a default, chair umpire was initially correct. It’s almost like she’s chipping the ball to the ballkid to catch,” he wrote. “Roger (Federer) used to do this all the time. Ballkids catches it, and it’s a round of applause. Disgraceful from the opponents (Bouzkova and Sorribes Tormo) who demanded a default.” Kyrgios, however, took issue with that being on the same level as the French Open incident. “Hahaha. Now it gets ridiculous,” he wote. “The GOAT having some fun and the ballkids are catching it, making their life memory compared to outside doubles match. “Absurd.” The 2022 Wimbledon finalist also defended himself against one fan’s claim that he had struck a child when he threw a racquet. “It was at the end of the match, you potato. Also, didn’t hit anyone,” he wrote.","pubDate":"2023-06-06 03:01:28","image_url":"https://images.7news.com.au/publication/C-10890075/662537bcaf7bae937e9631962335247f186582a3-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Steve Smith in blunt press conference exchange over tricky Test retirement question","link":"https://7news.com.au/sport/cricket/steve-smith-in-blunt-press-conference-exchange-over-tricky-retirement-question-c-10884689","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"The media session could have turned testy - but the cricketer seems to have learned his lesson.","content":"insists he is no clearer about a path to retirement from Test and says taking a lead from fellow veteran David Warner is not an option. Australia face a changing of the guard in the coming years, with . Watch, Stream & Catch Up with Australia's Home of Cricket on In confirming he wants to finish up midway through the next Australian summer, Warner became the first active member of the national Test team to announce his retirement since Mitchell Johnson in 2015. At 34, Smith is two years younger than Warner but they are among a group of celebrated stars in their thirties who have been the backbone of the Australian side for several seasons. Smith indicated in January his retirement could be imminent, admitting in Sydney he may have played his last Test on home soil before later going back on the comments - and he seems to have learned his lesson. When asked if he had any clarity about his future on Monday ahead of the World Test Championship (WTC) showdown with India following Warner’s announcement, Smith smiled and said: “Nah.” Asked if he wanted to elaborate further, Smith again laughed: “Nah.” Warner’s retirement plans have put selectors in a tricky position, with the opener no guarantee to hold his spot through the Ashes series after a lean three-year period with the bat. Smith backed Warner’s decision to make a clear call on when he wanted to bow out, with Warner planning to make the SCG Test against Pakistan in January his last. He did, however, concede even Warner’s grand plans are far from certain. “It’s nice to have an end date, I suppose, if that’s the way you want to go,” Smith said. “But ultimately for all of us we’ve going to be doing our job and for batters that is scoring runs. “In an ideal world, I think Davey said that’s when he’d like to pick it up. But we’ve got to score runs, all of us. So we’ll see what happens.” While retirement is not a topic Smith wants to embrace, he is worried about the future of Test cricket. The WTC final and Ashes series are being played amid fears over the viability of the long-format game against the rise of global franchise contracts across multiple leagues. “I am slightly concerned,” Smith said. “Hopefully Test cricket still stays alive and well. “I think it’s in a good place at the moment in terms of some of the games we’ve seen recently have been pretty amazing. “As a traditionalist and someone that loves Test cricket, I hope it still remains at the front of all the boards’ minds and stays alive and well for some time to come.”","pubDate":"2023-06-06 01:45:48","image_url":"https://images.7news.com.au/publication/C-10884689/e5c020b9b4286ac5140101bfe539b1241b07bfaa-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"England send desperate SOS for retired 35-year-old Moeen Ali to save the Ashes","link":"https://7news.com.au/sport/cricket/england-send-desperate-sos-for-retired-35-year-old-moeen-ali-to-save-the-ashes-c-10887394","keywords":null,"creator":["Rory Dollard"],"video_url":null,"description":"A very familiar face has received a shock call to pull on the pads for the first time in years.","content":"Moeen Ali is considering the possibility of reversing his Test retirement after Jack Leach’s injury left England short of an experienced spinner for the . Moeen, 35, has not played red-ball cricket since September 2021 but has found his name thrust back into the conversation after Leach was ruled out for the summer by a stress fracture in his lower back. The PA news agency understands Moeen is weighing up whether or not to make a dramatic return over the next couple of days. Watch, Stream & Catch Up with Australia's Home of Cricket on England are not without slow bowling options, with Surrey’s Will Jacks, Leicestershire’s rising star Rehan Ahmed and Liam Dawson all offering different skills. However, none can match the experience of a seasoned Test player with 64 caps and 195 wickets under his belt. Head coach Brendon McCullum previously tried to tempt the all-rounder back into the fray for the historic tour of Pakistan but, after initially declaring himself open to the idea, Moeen ultimately decided to stick to limited-overs cricket. Now the same offer is back on the table in the form of one last shot at Australia. With the series getting under way at Moeen’s home ground of Edgbaston on June 16, time is short, but the England and Wales Cricket Board are unlikely to rush for a quick verdict. Announcing his decision not to take up McCullum’s offer of taking part in the Pakistan trip, Moeen said last year: “I want to enjoy my cricket and it wouldn’t be fair to reverse my decision and then struggle to give it my all. It’s time to close the door on that side of my career. To play 64 Tests for England has been a privilege and a dream fulfilled.” He had earlier taken a different tone, hinting that he could be persuaded to re-enter the fray, telling PA and the Guardian last June: “Baz messaged me asking if I was in. Maybe in the future, potential tours or whatever, who knows? I said ‘Call me at the time’. If and when he calls me, we’ll chat.” If he did throw himself into the maelstrom of an Ashes summer, Moeen would need to be certain he had the necessary mental and physical energy to take on a side against whom he has some difficult experiences but, perhaps, unfinished business. The leadership style of McCullum and captain Ben Stokes may prove a real draw in his deliberations. Moeen’s naturally aggressive style, with both ball and bat, chimes perfectly with the current environment and the chance to make his own mark on the ‘Bazball’ era could be persuasive. Stuart Broad, a contemporary of Moeen’s who has been revitalised by the set-up over the last year, can already see a neat fit. “We know Mo is a phenomenal cricketer and someone who would fit into Stokes and Baz’s philosophy beautifully,” he told Sky Sports. “I don’t know if he’s being considered by the selectors or if he would consider red-ball cricket again, but he’s a mighty fine cricketer.” England have held off naming an addition to the squad, having originally expected to make an early call, leaving the ball in Moeen’s court.","pubDate":"2023-06-05 23:27:12","image_url":"https://images.7news.com.au/publication/C-10887394/c56a02e19e732e419e80f523e781e3f39d1ca4b0-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"England wait as Moeen Ali ponders chance to make Test return for Ashes","link":"https://www.theguardian.com/sport/2023/jun/05/england-wait-as-moeen-ali-ponders-chance-to-make-test-return-for-ashes","keywords":["England cricket team","Moeen Ali","Australia cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Moeen retired from Test cricket in September 2021England seeking replacement for injured spinner Jack LeachMoeen Ali will decide over the next 48 hours whether he is ready to end his retirement from Test cricket and answer England’s spin-bowling distress flare in the Ashes.Moeen, 35, called time on his 64-cap Test career in September 2021 and has enjoyed his time as a freewheeling white-ball specialist since, securing two Indian Premier League titles with Chennai Super Kings and helping England seal T20 World Cup glory in Australia last winter. Continue reading...","content":null,"pubDate":"2023-06-05 18:51:12","image_url":"https://i.guim.co.uk/img/media/8396d64c2a47aeed43b45714813b8adccea7fdd6/848_55_3720_2232/master/3720.jpg?width=460&quality=85&auto=format&fit=max&s=4e5b9b19c08d22a742f881aff2fb8f52","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"जल्द ठीक हो जाओ, अगले सीजन में मिलते हैं चैंपियन धोनी, सर्जरी के बाद माही की दिखी पहली झलक","link":"https://hindi.news18.com/news/sports/cricket-mohammad-kaif-share-ms-dhoni-photo-after-surgery-with-family-told-get-well-soon-see-you-next-season-champion-6427283.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"मोहम्मद कैफ ने महेंद्र सिंह धोनी संग तस्वीर शेयर की है. यह तस्वीर धोनी के घुटने की सर्जरी की बाद की है. धोनी दूसरी तस्वीर में कैफ के बेटे कबीर संग नजर आ रहे हैं. दोनों बेहद खुश दिखाई दे रहे हैं.","content":"महेंद्र सिंह धोनी ने हाल में घुटने की सर्जरी कराई है. नई दिल्ली. चेन्नई सुपरकिंग्स के कप्तान महेंद्र सिंह धोनी (MS Dhoni) की हाल में घुटने की सफल सर्जरी हुई है. सर्जरी के बाद माही की पहली तस्वीर सामने आई है. टीम इंडिया के पूर्व क्रिकेटर मोहम्मद कैफ (Mohammad Kaif) ने धोनी की तस्वीर सोशल मीडिया पर शेयर की है जिसपर फैंस अलग अलग कॉमेंट कर रहे हैं. धोनी से मिलकर कैफ का बेटा बेहद खुश हुआ. कैफ ने इसकी जानकारी अपने इंस्टाग्राम हैंडल पर दी है. धोनी ने हाल में चेन्नई सुपरकिंग्स को अपनी कप्तानी में पांचवीं बार चैंपियन बनाया. माही अगले साल भी आईपीएल में खेलते हुए नजर आएंगे. मोहम्मद कैफ ने इंस्टाग्राम पर दो तस्वीर शेयर की है. पहली तस्वीर में धोनी संग उनकी पत्नी साक्षी (Sakshi) बेटी जीवा (Ziva)और मोहम्मद कैफ अपनी पत्नी पूजा और बेटे कबीर के साथ दिखाई दे रहे हैं जबकि दूसरी तस्वीर में धोनी और कबीर एक साथ दिखाई दे रहे हैं. धोनी ने कबीर के कंधें पर हाथ रखा हुआ है. कबीर इस दौरान काफी खुश दिखाई दे रहा है. मोहम्मद कैफ ने कैप्शन लिखा, आज हम एयरपोर्ट पर महान इंसान और उनकी फैमिली से मिले. वह सर्जरी के बाद लौट रहे थे. बेटा कबीर सुपर हैप्पी था. क्योंकि धोनी ने उससे कहा कि जब वह छोटे थे तब वह भी बचपन में फुटबॉल खेला करते थे. जल्द ठीक हो जाओ. अगले सीजन में मिलते हैं चैंपियन धोनी. धोनी से मिले कैफ के बेटे कबीरधोनी को यह चोट आईपीएल के 16वें एडिशन के पहले मैच में लगी थी. गुजरात टाइटंस के खिलाफ मैच में धोनी अपना घुटना चोटिल करा बैठे थे. माही फील्डिंग के दौरान डाइव लगाते हुए चोटिल हुए थे. चोटिल होने के बावजूद धोनी ने पूरा टूर्नामेंट खेला. उन्होंने आईपीएल खत्म होने के बाद घुटने का ऑपरेशन कराया है. . Tags: Mohammad kaif , Ms dhoni टाटा मोटर्स के शेयर ने तोड़ा अपना रिकॉर्ड, क्या है अगला टारगेट, एक्सपर्ट ने बताया- कहां बेचें-खरीदें ये स्टॉक इस गार्डन में लगे हैं 15000 पेड़ और दो लाख सजावटी फूलों के पौधे, तस्वीरों में देखें इस अद्भुद गार्डन को WTC Final: ऑस्‍ट्रेलिया के खिलाफ भारतीय बैटर्स को बनाने होंगे खूब रन, जानें टॉप-6 का प्रदर्शन","pubDate":"2023-06-05 18:30:19","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/ms-dhoni-with-kaif-16859893053x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Giants’ Kayvon Thibodeaux becomes minority owner of New York Warriors T10 pro cricket team","link":"https://www.mercurynews.com/2023/06/05/giants-kayvon-thibodeaux-becomes-minority-owner-of-new-york-warriors-t10-pro-cricket-team-3/","keywords":["NFL","Sports"],"creator":["Tribune News Service"],"video_url":null,"description":"“I watched him build houses, I watched him fix things, and I think for him there was an understanding that nothing is actually broken,” Thibodeaux, 22, the Giants’ pass rusher, told the Daily News on the phone Thursday.“ There’ s a way to fix it.”. But Friday’ s launch of Thibodeaux’ s involvement in this new, six-team, USA Masters T10 cricket league is about the Giants defender...","content":"Kayvon Thibodeaux says he has always thought outside the box. He attributes the origin of his curiosity to his father Angelo’s creativity and unorthodox mindset in the construction business growing up in South Central Los Angeles. “I watched him build houses, I watched him fix things, and I think for him there was an understanding that nothing is actually broken,” Thibodeaux, 22, the Giants’ pass rusher, told the Daily News on the phone Thursday. “There’s a way to fix it.” The story of how Thibodeaux became a minority owner and equity partner in a professional, New York-based cricket team, the New York Warriors, is not about fixing something that’s off. But Friday’s launch of Thibodeaux’s involvement in this new, six-team, USA Masters T10 cricket league is about the Giants defender gravitating towards opportunity, approaching life a bit differently than the next guy and approving of a slight fix, let’s call it, to a world-famous game: Shortening the play time of cricket matches from five days to 90 minutes. “It’s more home runs, more entertainment, faster and shorter games, with a new format that’s possibly being placed in the Olympics in the next two years,” said Cervando Tejeda, founder of Athletes Sports Management Inc. and a minority owner of the USA Masters T10 league. Six seasons of popular and financial success in Abu Dhabi with this new format laid the groundwork for worldwide expansion. The U.S. league will hold its inaugural draft in the second week of July and launch its first season in mid-August. It will be televised internationally, and the plan is to add two more teams in 2024. The first six teams will represent New York, Philadelphia, Dallas, North Carolina (Morrisville), Los Angeles and Houston. Games will be played at stadiums in Florida, North Carolina and Houston. And that’s where Thibodeaux comes in. “We want to cover the entire USA. That’s why we want to involve USA athletes,” said Ritesh Patel, majority owner of the U.S. T10 league alongside billionaire founder Shaji Ul Mulk. “So we started discussing this with Kayvon, and we see it: He’s one of the best in the NFL but he has the best business brain, has lots of good business ideas. He can take this to a different level. So we brought him on as an equity partner.” Thibodeaux attended a Dallas T10 launch event in early May and spoke with Patel and New York Warriors majority owner Muhammad Kamran Awan. And Patel said Thibodeaux “blew me away” with what he had envisioned, from educating people about cricket, to doing cricket commentary, to other ideas that would promote growth. “One big part of my role is obviously the money but, two, it’s storytelling,” Thibodeaux said. “Being an athlete in this new world of media, I understand how storytelling works in the new age, I understand how to connect with people, and marketing is something I majored in. So that’s definitely how I’m going to help market my team and also the league itself.” The Giants and NFL football are still number one for Thibodeaux, but Tejeda said it’s realistic that when he has the time, Thibodeaux will make himself more “present” around this modern cricket league and team. “But I think what he’s doing right now coming in as an owner of a team is just setting the standard for other athletes to say look, you don’t just have to own an NFL team or soccer team or NBA team,” Tejeda said. “There’s other sports that are coming into the States that you guys can get ownership of.” Thibodeaux has never played cricket and only has watched matches online so far. He likes the fast new format, though, and the fact it’s not difficult for the average person to pick up and try. “It’s about opportunity,” Thibodeaux said. “The tough thing about football, for example, is it has to be orchestrated to be really played. With cricket, I love it because it creates an opportunity for a lot of people to be aware of it and start to play it. You don’t really need that much. It’s similar to baseball in a sense where you really just need a ball and a paddle.” Thibodeaux really does seem to be one of a kind, just as he advertised himself before the Giants picked him . Just this offseason, he launched a TikTok cooking series called “KT’s Finger-Lickin’ Kitchen.” “Dinner gets expensive,” he said at Wednesday’s OTA practice. “I’m going to start eating at home, going to the grocery store.” Thibodeaux also revealed “I want to be an analyst” just like the sportswriters who cover him in the NFL, to see and evaluate “what the next moves are for teams.” He started as a rookie by doing analysis for FOX Sports of last year’s Super Bowl between the Kansas City Chiefs and Philadelphia Eagles. On top of that, his social media is covered with examples of appearances, charity work, paid sponsorships and even an inaugural, free, youth football and cheer camp on June 24 in L.A. Of course, that’s where Angelo Kayvon Thibodeaux Jr. grew up. (That’s right: his real first name is Angelo, and he is technically a junior.) The man is full of surprises. Some of that is about learning from his father’s approach. But a lot of it is intrinsic to Thibodeaux’s own curiosities and mindset. In his second year playing a professional sport, he is already part owner of a team in another, and it’s possible he won’t stop there. “Ownership is the goal in anything, whether it’s sports, entertainment, business,” Thibodeaux said. “Definitely in this league and other leagues, I would love to continue that mindset of getting equity and becoming an owner.” He believes in the “vision” of the T10 cricket format that took off in Abu Dhabi. He said there is an unmistakable “power” to the “great ambassadors” and people behind this USA initiative. And he is attracted to pioneering this sport in the U.S., “being in the first wave of the league coming to America” with a game people know of but not about. “Even as a kid I always thought of that next thing,” Thibodeaux said. “You start to see all these billionaires and people who have done well for themselves, and it always stemmed from thinking outside the box. I feel like we all kind of live in a simulation, and once you start to break that code of what’s normal and start to create that for yourself, you’ll be able to accomplish your dreams.” ()","pubDate":"2023-06-05 18:17:18","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/06/202306021414TMS_____MNGTRPUB_SPORTS-GIANTS-KAYVON-THIBODEAUX-BECOMES-MINORITY-OWNER-2-NY5-2.jpg?w=1400px&strip=all","source_id":"mercurynews","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"डब्ल्यूटीसी फाइनल से पहले राहुल द्रविड़ का लंदन से आया बड़ा बयान, बोले- आईसीसी ट्रॉफी जीतने का दबाव...","link":"https://hindi.news18.com/news/sports/cricket-rahul-dravid-said-not-under-pressure-to-win-icc-titles-ahead-of-india-vs-australia-wtc-final-2023-6427115.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के हेड कोच राहुल द्रविड़ ने कहा है कि आईसीसी ट्रॉफी जीतने का दबाव उनपर नहीं है. भारतीय टीम इस समय wtc final 2023 से पहले लंदन में जमकर पसीना बहा रही है.","content":"राहुल द्रविड़ ने वर्ल्ड टेस्ट चैंपियनशिप से पहले दिया बड़ा बयान. (BCCI Twitter) लंदन. भारत और ऑस्ट्रेलिया के बीच 7 जून से आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल (WTC Final 2023) द ओवल में खेला जाएगा. टीम इंडिया को आईसीसी ट्रॉफी जीते हुए 10 साल हो चुके हैं. बावजूद इसके सोमवार को आयोजित प्रेस कॉन्फ्रेंस में टीम इंडिया के हेड कोच राहुल द्रविड़ (Rahul Dravid) का कहना है कि फाइनल को लेकर उनकी टीम पर किसी तरह का कोई दबाव नहीं है. भारतीय टीम लगातार दूसरी बार डब्ल्यूटीसी फाइनल में पहुंची है जहां उसका सामना पहली बार कंगारुओं से होगा. दोनों टीमें ओवल में पहली बार आमने सामने होंगी. राहुल द्रविड़ ने कहा कि ट्रॉफी जीतना अच्छा होगा जिसके लिए टीम पिछले दो वर्षों से कड़ी मेहनत कर रही है. भारत 2021 में डब्ल्यूटीसी फाइनल में न्यूजीलैंड से हार गया था जबकि आईसीसी के अन्य टूर्नामेंट में वह नॉकआउट चरण में हारता रहा है. द्रविड़ ने कहा,‘नहीं हम पर किसी तरह का दबाव नहीं है. मेरे कहने का मतलब है कि आईसीसी ट्रॉफी जीतने का प्रयास करने का हम किसी तरह का दबाव महसूस नहीं कर रहे हैं. निश्चित तौर पर ट्रॉफी जीतना अच्छा होगा. आईसीसी टूर्नामेंट जीतने में सक्षम होना निश्चित तौर पर अच्छा होगा. लेकिन इस संदर्भ में आपको यह भी देखना होगा कि यह दो साल की कड़ी मेहनत का चरम है. कई सफलताएं हासिल करने के बाद ही आप यहां तक पहुंचते हैं.’इसलिए हमारे पास कई सकारात्मक पहलू हैं. ऑस्ट्रेलिया से सीरीज जीतना, यहां सीरीज ड्रॉ कराना, हर जगह कड़ी प्रतिस्पर्धा करना जो इस टीम के पास है.’ हमने सोचा कि एक-दो रणजी मैच खेल लेगा… तो कहीं नौकरी मिल जाएगी, इशान किशन के पिता ने क्यों कहा ऐसा? भारतीय खिलाड़ी आईपीएल खेलकर सीधे लंदन पहुंचे हैं. टीम इंडिया के खिलाड़ियों के लिए टी20 फॉर्मेट से टेस्ट में लौटना बड़ी चुनौती होगी. रोहित शर्मा की कप्तानी में भारतीय टीम के पास इतिहास रचने का मौका है. टीम इंडिया के लिए लंदन की परिस्थितियों से सामंजस्य बिठाना आसाना नहीं होगा. (इनपुट – भाषा) . Tags: Rahul Dravid , Team india , WTC Final टाटा मोटर्स के शेयर ने तोड़ा अपना रिकॉर्ड, क्या है अगला टारगेट, एक्सपर्ट ने बताया- कहां बेचें-खरीदें ये स्टॉक इस गार्डन में लगे हैं 15000 पेड़ और दो लाख सजावटी फूलों के पौधे, तस्वीरों में देखें इस अद्भुद गार्डन को WTC Final: ऑस्‍ट्रेलिया के खिलाफ भारतीय बैटर्स को बनाने होंगे खूब रन, जानें टॉप-6 का प्रदर्शन","pubDate":"2023-06-05 17:47:56","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rahul-dravid-coach-16859469383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Why Gujarat Titans cricketer Yash Dayal had to issue an apology. Details here","link":"https://www.livemint.com/sports/cricket-news/why-gujarat-titans-cricketer-yash-dayal-had-to-issue-an-apology-details-here-11685973949952.html","keywords":null,"creator":null,"video_url":null,"description":"The left-arm pacer Yash Dayal, on Monday, claimed that his official Instagram handle was hacked after a controversial post of religious nature and a subsequent apology went viral.","content":null,"pubDate":"2023-06-05 17:24:03","image_url":"https://www.livemint.com/lm-img/img/2023/06/05/1600x900/Yash_Dayal_1685976219235_1685976219461.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Switching from IPL to Test cricket should be fun challenge: Shubman Gill","link":"https://www.indiatoday.in/sports/cricket/story/wtc-final-australia-vs-india-shubman-gill-2389199-2023-06-05?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Switching from IPL to Test cricket should be fun challenge: Shubman Gill","content":": India opener has said that it should be a fun thing to switch from fast pace T20 cricket to Test cricket in the World Test Championship Final. In an interview with the ICC Gill has said that he comes into the clash with confidence after his exploits in the Indian Premier League but understands that a Test match is a completely different scenario. \"It does give you a bit of confidence (from the IPL), but I feel this is a completely different scenario and a completely different game,\" Gill told the ICC at The Oval. \"But that's the fun about it. Last week we were playing something completely different with a different atmosphere and that is the challenge and that is what is exciting about Test cricket,\" he further added. The Indian opener spoke about the team's maiden WTC Final against New Zealand. Gill said that as a batting group, India had learned their lessons from that game and would look to apply that experience. India were outplayed by New Zealand in last edition's final where Gill scored 28 and 8 across both innings. Gill has matured since and is among the very few Indian players who have centuries in all formats of the game. In fact, in the recently concluded Indian Premier League, Gill took apart teams single-handedly, scoring the most runs in the tournament. Before the IPL, Gill had scored a Test century against Australia in the fourth Test match of the Border-Gavaskar Trophy at Ahmedabad. \"We have been talking about some of the things we have learnt as a team and especially as a batting group from playing that match,\" he said. \"Hopefully we will be able to overcome the mistakes we made last time,\" Gill concluded.","pubDate":"2023-06-05 17:11:20","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC final: If we play good cricket, we can win, says Rahul Dravid","link":"https://telanganatoday.com/wtc-final-if-we-play-good-cricket-we-can-win-says-rahul-dravid","keywords":["News","Sport","Australia","India","Rahul Dravid","WTC final"],"creator":["IANS"],"video_url":null,"description":"Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India's chances in the match","content":"Home | Sport | Wtc Final If We Play Good Cricket We Can Win Says Rahul Dravid WTC final: If we play good cricket, we can win, says Rahul Dravid Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India's chances in the match By IANS Published Date - 10:30 PM, Mon - 5 June 23 Photo: IANS London: With just two days to go before the start of the ICC World Test Championship final , Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India’s chances in the match. Addressing the media here, he said: “The team that plays good cricket over five days will win. I fully believe if we play good cricket – we have the players, we have the ability – if we take 20 wickets and make runs, we can win this match.” That could be construed as stating the obvious. But he went on to say: “That there’s no hype (about India’s prospects) is a good thing.” An encouraging weather forecast for the World Test Championship final at The Oval in south London – England’s oldest international cricketing venue, where the first Test was held in 1880 – has provided a psychological boost to the Indian team, confronted as they are with the challenge of having to compete at the climax of cricket’s most prestigious championship without the benefit of match practice in English conditions. It was a wet spring; so, there is the likelihood of residual moisture on the pitch. On the other hand, the recent and anticipated sunshine could dry the track, without quite hardening it to generate disconcerting bounce. Last week in the England versus Ireland Test at Lord’s, north of the British capital’s River Thames, the wicket eased into a somewhat flat surface from the second day onwards. India are handicapped by the unavailability of Jasprit Bumrah, K.L. Rahul and Rishabh Pant due to injuries. At the same time, it’s clear that five batsmen, an all-rounder, a wicket-keeper and four bowlers will constitute the playing XI. Speculation over who will stand behind the stumps is perhaps fanciful, since K.S. Bharat is not only a better exponent with the gloves than Ishan Kishan, but has played at the highest level, that too, against Australia, whereas his Kishan is yet to make the grade. Noticeably, Kishan batted extensively at the nets at The Oval on Sunday, while the veteran Ajinkya Rahane surprisingly didn’t do so at all. However, the question remains as to whether the line-up will have four fast bowlers or two spinners. If the former, then Ravichandran Ashwin is likely to be dropped. If otherwise, then the tour think-tank will have to choose between Umesh Yadav and Shardul Thakur. Even in an environment unfavourable to him, as in the previous WTC final at Southampton in 2021, Ashwin impressed with his economy and wicket-taking ability. Also, with four left-handers among Australia’s batsmen, an off-spinner like Ashwin should be an asset. In contrast, Yadav only really comes into his own with reverse swing; and while Thakur is more effective when the ball moves in the air and exhibited a fine all-round display against England at The Oval two years ago, his form in the recently-concluded IPL was disappointing. Talking about the Test a couple of years ago, India won the match to take a 2-1 lead in the series, only to lose the re-scheduled final Test at Edgbaston last year, where the visitors’ somewhat one-dimensional attack in the absence of Ashwin failed to close the contest. Australia , the most successful cricket-playing nation, are formidable opponents anywhere and at any time. While the Indians were earlier practising at the idyllic Duke of Norfolk’s estate in Arundel in Sussex, the Aussies were doing likewise at Beckenham in Kent. On Sunday, they announced that paceman Josh Hazelwood has not sufficiently recovered from a side strain. This could mean in-swing bowler Scott Boland, who averages 13.42 with the ball in Tests, will join captain Pat Cummins and Mitchell Starc to form a trio of specialist quick bowlers, with all-rounder Cameron Green as the fourth option. The Indian vice-captain, Cheteshwar Pujara, who has been among the runs for Sussex in the county championship, will be the only Indian with match practice on English pitches leading up to the WTC final. Among the Australians, the same would be true of Steve Smith and Marcus Labuchange. Openers often hold the key to a side’s overall batting stability. In this case, Indian skipper Rohit Sharma, who was dominant during the last tour of England, but was short of runs in the IPL, and the promising Shubhman Gill are not short of talent. But they are likely to be tested in the early overs by the pace of Cummins and Starc operating with the Duke ball with its more pronounced seam; and therein would hinge a critical element of the match. Mohammed Shami and Mohammed Siraj indicated excellent rhythm in the IPL, which, if replicated, could reap the rewards. Besides, Ravindra Jadeja – as he showed in the home series against Australia in February-March – has returned from his injury a rebooted bowler; and should in theory trouble right-handers. Also Read WTC final should be at least a three-game series, feels David Warner Big challenge for India to come out of T20 mould and play WTC final: Gavaskar Follow Us : Tags Australia India Rahul Dravid WTC final Related News India’s 5G sales hit 50 per cent market for 1st time Women’s hockey Junior Asia Cup: India register hard-fought 2-1 victory over Malaysia Junior World Cup Shooting: Telangana’s Srikanth shoots gold Odisha train accident: Railway Ministry ignored warning about serious flaws in interlocking system Prime Video’s comedy series ‘The Office’ is headed Down Under Editorial: Tragedy on tracks","pubDate":"2023-06-05 17:00:27","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Nick Kyrgios and Roger Federer emerge in French Open’s crying ballkid saga: ‘Now it gets ridiculous’","link":"https://7news.com.au/sport/tennis/nick-kyrgios-and-roger-federer-emerge-in-french-opens-crying-ballkid-saga-now-it-gets-ridiculous-c-10890075","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"‘Roger used to do this all the time .... and it’s a round of applause.’","content":"and Roger Federer have suddenly emerged in the middle of the disqualification saga that unfolded in a doubles match, with the Australian firebrand belatedly reacting to the incident. Miyu Kato was on Sunday when she lobbed a ball towards a ballkid, who was struck and left crying. Watch the latest sport on Channel 7 or stream for free on At first, chair umpire Alexandre Juge only issued a warning to Kato but - after opponents Marie Bouzkova and Sara Sorribes Tormo complained - referee Remy Azemar and Grand Slam supervisor Australian Wayne McKewen stepped in and ruled that Kato and her partner, Aldila Sutjiadi of Indonesia, were indeed disqualified. The tennis world erupted after the unfortunate episode given the gentle nature of the lobbed return that made the ballkid cry. Kato earned significant support in the wake of the incident as Bouzkova and Sorribes Tormo bore the brunt of the heavy criticism. French tennis player Lucas Pouille called their behaviour “shameful” while countryman Gilles Simon hoped “they (would) have a little trouble falling asleep”. Alize Cornet, another local hero, said it was an “insane decision” and sent a pointed message to Kato’s opponents. Kyrgios also had little sympathy for Sorribes Tormo and Bouzkova over fan criticism on their Instagram posts. “Boo hoo,” he wrote. “All around the world, whether it be having people chanting your name, idolising you, getting booed at, it’s always going to be a factor in sport,” Kyrgios added. But Kyrgios noted that rules were rules and the disqualification was just bad luck. “Why are we having so many people complain about it? Also, it’s not about the intent. If you a hit a ball at a kid, it’s a default.” That remark drew the ire of fans who - in the main - believe the disqualification call was extreme. Leading tennis journalist Ben Rothenberg also joined the debate and posted a short clip of retired great Roger Federer. who had a penchant for deliberately testing out ballkids’ catching skills.. “Regardless of if this was the right call or not, and I don’t think it was, players can afford to be more careful with this stuff,” Rothenberg said. “Roger Federer, notably, often played with fire by zipping balls at ball boys in Australia to test their cricket catches. Mixed results.” In the clip, Federer is seen hitting the ball just wide of one ballkid (who takes a ripping catch), while another ballkid is hit after Federer whacked a shot from behind his back. The difference in that incident was that the ballkid was able to laugh it off despite the force of the shot. And ATP tennis commentator Rob Koenig also brought up Federer. “No way this is a default, chair umpire was initially correct. It’s almost like she’s chipping the ball to the ballkid to catch,” he wrote. “Roger (Federer) used to do this all the time. Ballkids catches it, and it’s a round of applause. Disgraceful from the opponents (Bouzkova and Sorribes Tormo) who demanded a default.” Kyrgios, however, took issue with that being on the same level as the French Open incident. “Hahaha. Now it gets ridiculous,” he wote. “The GOAT having some fun and the ballkids are catching it, making their life memory compared to outside doubles match. “Absurd.” The 2022 Wimbledon finalist also defended himself against one fan’s claim that he had struck a child when he threw a racquet. “It was at the end of the match, you potato. Also, didn’t hit anyone,” he wrote.","pubDate":"2023-06-06 03:01:28","image_url":"https://images.7news.com.au/publication/C-10890075/662537bcaf7bae937e9631962335247f186582a3-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Steve Smith in blunt press conference exchange over tricky Test retirement question","link":"https://7news.com.au/sport/cricket/steve-smith-in-blunt-press-conference-exchange-over-tricky-retirement-question-c-10884689","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"The media session could have turned testy - but the cricketer seems to have learned his lesson.","content":"insists he is no clearer about a path to retirement from Test and says taking a lead from fellow veteran David Warner is not an option. Australia face a changing of the guard in the coming years, with . Watch, Stream & Catch Up with Australia's Home of Cricket on In confirming he wants to finish up midway through the next Australian summer, Warner became the first active member of the national Test team to announce his retirement since Mitchell Johnson in 2015. At 34, Smith is two years younger than Warner but they are among a group of celebrated stars in their thirties who have been the backbone of the Australian side for several seasons. Smith indicated in January his retirement could be imminent, admitting in Sydney he may have played his last Test on home soil before later going back on the comments - and he seems to have learned his lesson. When asked if he had any clarity about his future on Monday ahead of the World Test Championship (WTC) showdown with India following Warner’s announcement, Smith smiled and said: “Nah.” Asked if he wanted to elaborate further, Smith again laughed: “Nah.” Warner’s retirement plans have put selectors in a tricky position, with the opener no guarantee to hold his spot through the Ashes series after a lean three-year period with the bat. Smith backed Warner’s decision to make a clear call on when he wanted to bow out, with Warner planning to make the SCG Test against Pakistan in January his last. He did, however, concede even Warner’s grand plans are far from certain. “It’s nice to have an end date, I suppose, if that’s the way you want to go,” Smith said. “But ultimately for all of us we’ve going to be doing our job and for batters that is scoring runs. “In an ideal world, I think Davey said that’s when he’d like to pick it up. But we’ve got to score runs, all of us. So we’ll see what happens.” While retirement is not a topic Smith wants to embrace, he is worried about the future of Test cricket. The WTC final and Ashes series are being played amid fears over the viability of the long-format game against the rise of global franchise contracts across multiple leagues. “I am slightly concerned,” Smith said. “Hopefully Test cricket still stays alive and well. “I think it’s in a good place at the moment in terms of some of the games we’ve seen recently have been pretty amazing. “As a traditionalist and someone that loves Test cricket, I hope it still remains at the front of all the boards’ minds and stays alive and well for some time to come.”","pubDate":"2023-06-06 01:45:48","image_url":"https://images.7news.com.au/publication/C-10884689/e5c020b9b4286ac5140101bfe539b1241b07bfaa-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"England send desperate SOS for retired 35-year-old Moeen Ali to save the Ashes","link":"https://7news.com.au/sport/cricket/england-send-desperate-sos-for-retired-35-year-old-moeen-ali-to-save-the-ashes-c-10887394","keywords":null,"creator":["Rory Dollard"],"video_url":null,"description":"A very familiar face has received a shock call to pull on the pads for the first time in years.","content":"Moeen Ali is considering the possibility of reversing his Test retirement after Jack Leach’s injury left England short of an experienced spinner for the . Moeen, 35, has not played red-ball cricket since September 2021 but has found his name thrust back into the conversation after Leach was ruled out for the summer by a stress fracture in his lower back. The PA news agency understands Moeen is weighing up whether or not to make a dramatic return over the next couple of days. Watch, Stream & Catch Up with Australia's Home of Cricket on England are not without slow bowling options, with Surrey’s Will Jacks, Leicestershire’s rising star Rehan Ahmed and Liam Dawson all offering different skills. However, none can match the experience of a seasoned Test player with 64 caps and 195 wickets under his belt. Head coach Brendon McCullum previously tried to tempt the all-rounder back into the fray for the historic tour of Pakistan but, after initially declaring himself open to the idea, Moeen ultimately decided to stick to limited-overs cricket. Now the same offer is back on the table in the form of one last shot at Australia. With the series getting under way at Moeen’s home ground of Edgbaston on June 16, time is short, but the England and Wales Cricket Board are unlikely to rush for a quick verdict. Announcing his decision not to take up McCullum’s offer of taking part in the Pakistan trip, Moeen said last year: “I want to enjoy my cricket and it wouldn’t be fair to reverse my decision and then struggle to give it my all. It’s time to close the door on that side of my career. To play 64 Tests for England has been a privilege and a dream fulfilled.” He had earlier taken a different tone, hinting that he could be persuaded to re-enter the fray, telling PA and the Guardian last June: “Baz messaged me asking if I was in. Maybe in the future, potential tours or whatever, who knows? I said ‘Call me at the time’. If and when he calls me, we’ll chat.” If he did throw himself into the maelstrom of an Ashes summer, Moeen would need to be certain he had the necessary mental and physical energy to take on a side against whom he has some difficult experiences but, perhaps, unfinished business. The leadership style of McCullum and captain Ben Stokes may prove a real draw in his deliberations. Moeen’s naturally aggressive style, with both ball and bat, chimes perfectly with the current environment and the chance to make his own mark on the ‘Bazball’ era could be persuasive. Stuart Broad, a contemporary of Moeen’s who has been revitalised by the set-up over the last year, can already see a neat fit. “We know Mo is a phenomenal cricketer and someone who would fit into Stokes and Baz’s philosophy beautifully,” he told Sky Sports. “I don’t know if he’s being considered by the selectors or if he would consider red-ball cricket again, but he’s a mighty fine cricketer.” England have held off naming an addition to the squad, having originally expected to make an early call, leaving the ball in Moeen’s court.","pubDate":"2023-06-05 23:27:12","image_url":"https://images.7news.com.au/publication/C-10887394/c56a02e19e732e419e80f523e781e3f39d1ca4b0-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"England wait as Moeen Ali ponders chance to make Test return for Ashes","link":"https://www.theguardian.com/sport/2023/jun/05/england-wait-as-moeen-ali-ponders-chance-to-make-test-return-for-ashes","keywords":["England cricket team","Moeen Ali","Australia cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Moeen retired from Test cricket in September 2021England seeking replacement for injured spinner Jack LeachMoeen Ali will decide over the next 48 hours whether he is ready to end his retirement from Test cricket and answer England’s spin-bowling distress flare in the Ashes.Moeen, 35, called time on his 64-cap Test career in September 2021 and has enjoyed his time as a freewheeling white-ball specialist since, securing two Indian Premier League titles with Chennai Super Kings and helping England seal T20 World Cup glory in Australia last winter. Continue reading...","content":null,"pubDate":"2023-06-05 18:51:12","image_url":"https://i.guim.co.uk/img/media/8396d64c2a47aeed43b45714813b8adccea7fdd6/848_55_3720_2232/master/3720.jpg?width=460&quality=85&auto=format&fit=max&s=4e5b9b19c08d22a742f881aff2fb8f52","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"जल्द ठीक हो जाओ, अगले सीजन में मिलते हैं चैंपियन धोनी, सर्जरी के बाद माही की दिखी पहली झलक","link":"https://hindi.news18.com/news/sports/cricket-mohammad-kaif-share-ms-dhoni-photo-after-surgery-with-family-told-get-well-soon-see-you-next-season-champion-6427283.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"मोहम्मद कैफ ने महेंद्र सिंह धोनी संग तस्वीर शेयर की है. यह तस्वीर धोनी के घुटने की सर्जरी की बाद की है. धोनी दूसरी तस्वीर में कैफ के बेटे कबीर संग नजर आ रहे हैं. दोनों बेहद खुश दिखाई दे रहे हैं.","content":"महेंद्र सिंह धोनी ने हाल में घुटने की सर्जरी कराई है. नई दिल्ली. चेन्नई सुपरकिंग्स के कप्तान महेंद्र सिंह धोनी (MS Dhoni) की हाल में घुटने की सफल सर्जरी हुई है. सर्जरी के बाद माही की पहली तस्वीर सामने आई है. टीम इंडिया के पूर्व क्रिकेटर मोहम्मद कैफ (Mohammad Kaif) ने धोनी की तस्वीर सोशल मीडिया पर शेयर की है जिसपर फैंस अलग अलग कॉमेंट कर रहे हैं. धोनी से मिलकर कैफ का बेटा बेहद खुश हुआ. कैफ ने इसकी जानकारी अपने इंस्टाग्राम हैंडल पर दी है. धोनी ने हाल में चेन्नई सुपरकिंग्स को अपनी कप्तानी में पांचवीं बार चैंपियन बनाया. माही अगले साल भी आईपीएल में खेलते हुए नजर आएंगे. मोहम्मद कैफ ने इंस्टाग्राम पर दो तस्वीर शेयर की है. पहली तस्वीर में धोनी संग उनकी पत्नी साक्षी (Sakshi) बेटी जीवा (Ziva)और मोहम्मद कैफ अपनी पत्नी पूजा और बेटे कबीर के साथ दिखाई दे रहे हैं जबकि दूसरी तस्वीर में धोनी और कबीर एक साथ दिखाई दे रहे हैं. धोनी ने कबीर के कंधें पर हाथ रखा हुआ है. कबीर इस दौरान काफी खुश दिखाई दे रहा है. मोहम्मद कैफ ने कैप्शन लिखा, आज हम एयरपोर्ट पर महान इंसान और उनकी फैमिली से मिले. वह सर्जरी के बाद लौट रहे थे. बेटा कबीर सुपर हैप्पी था. क्योंकि धोनी ने उससे कहा कि जब वह छोटे थे तब वह भी बचपन में फुटबॉल खेला करते थे. जल्द ठीक हो जाओ. अगले सीजन में मिलते हैं चैंपियन धोनी. धोनी से मिले कैफ के बेटे कबीरधोनी को यह चोट आईपीएल के 16वें एडिशन के पहले मैच में लगी थी. गुजरात टाइटंस के खिलाफ मैच में धोनी अपना घुटना चोटिल करा बैठे थे. माही फील्डिंग के दौरान डाइव लगाते हुए चोटिल हुए थे. चोटिल होने के बावजूद धोनी ने पूरा टूर्नामेंट खेला. उन्होंने आईपीएल खत्म होने के बाद घुटने का ऑपरेशन कराया है. . Tags: Mohammad kaif , Ms dhoni टाटा मोटर्स के शेयर ने तोड़ा अपना रिकॉर्ड, क्या है अगला टारगेट, एक्सपर्ट ने बताया- कहां बेचें-खरीदें ये स्टॉक इस गार्डन में लगे हैं 15000 पेड़ और दो लाख सजावटी फूलों के पौधे, तस्वीरों में देखें इस अद्भुद गार्डन को WTC Final: ऑस्‍ट्रेलिया के खिलाफ भारतीय बैटर्स को बनाने होंगे खूब रन, जानें टॉप-6 का प्रदर्शन","pubDate":"2023-06-05 18:30:19","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/ms-dhoni-with-kaif-16859893053x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Giants’ Kayvon Thibodeaux becomes minority owner of New York Warriors T10 pro cricket team","link":"https://www.mercurynews.com/2023/06/05/giants-kayvon-thibodeaux-becomes-minority-owner-of-new-york-warriors-t10-pro-cricket-team-3/","keywords":["NFL","Sports"],"creator":["Tribune News Service"],"video_url":null,"description":"“I watched him build houses, I watched him fix things, and I think for him there was an understanding that nothing is actually broken,” Thibodeaux, 22, the Giants’ pass rusher, told the Daily News on the phone Thursday.“ There’ s a way to fix it.”. But Friday’ s launch of Thibodeaux’ s involvement in this new, six-team, USA Masters T10 cricket league is about the Giants defender...","content":"Kayvon Thibodeaux says he has always thought outside the box. He attributes the origin of his curiosity to his father Angelo’s creativity and unorthodox mindset in the construction business growing up in South Central Los Angeles. “I watched him build houses, I watched him fix things, and I think for him there was an understanding that nothing is actually broken,” Thibodeaux, 22, the Giants’ pass rusher, told the Daily News on the phone Thursday. “There’s a way to fix it.” The story of how Thibodeaux became a minority owner and equity partner in a professional, New York-based cricket team, the New York Warriors, is not about fixing something that’s off. But Friday’s launch of Thibodeaux’s involvement in this new, six-team, USA Masters T10 cricket league is about the Giants defender gravitating towards opportunity, approaching life a bit differently than the next guy and approving of a slight fix, let’s call it, to a world-famous game: Shortening the play time of cricket matches from five days to 90 minutes. “It’s more home runs, more entertainment, faster and shorter games, with a new format that’s possibly being placed in the Olympics in the next two years,” said Cervando Tejeda, founder of Athletes Sports Management Inc. and a minority owner of the USA Masters T10 league. Six seasons of popular and financial success in Abu Dhabi with this new format laid the groundwork for worldwide expansion. The U.S. league will hold its inaugural draft in the second week of July and launch its first season in mid-August. It will be televised internationally, and the plan is to add two more teams in 2024. The first six teams will represent New York, Philadelphia, Dallas, North Carolina (Morrisville), Los Angeles and Houston. Games will be played at stadiums in Florida, North Carolina and Houston. And that’s where Thibodeaux comes in. “We want to cover the entire USA. That’s why we want to involve USA athletes,” said Ritesh Patel, majority owner of the U.S. T10 league alongside billionaire founder Shaji Ul Mulk. “So we started discussing this with Kayvon, and we see it: He’s one of the best in the NFL but he has the best business brain, has lots of good business ideas. He can take this to a different level. So we brought him on as an equity partner.” Thibodeaux attended a Dallas T10 launch event in early May and spoke with Patel and New York Warriors majority owner Muhammad Kamran Awan. And Patel said Thibodeaux “blew me away” with what he had envisioned, from educating people about cricket, to doing cricket commentary, to other ideas that would promote growth. “One big part of my role is obviously the money but, two, it’s storytelling,” Thibodeaux said. “Being an athlete in this new world of media, I understand how storytelling works in the new age, I understand how to connect with people, and marketing is something I majored in. So that’s definitely how I’m going to help market my team and also the league itself.” The Giants and NFL football are still number one for Thibodeaux, but Tejeda said it’s realistic that when he has the time, Thibodeaux will make himself more “present” around this modern cricket league and team. “But I think what he’s doing right now coming in as an owner of a team is just setting the standard for other athletes to say look, you don’t just have to own an NFL team or soccer team or NBA team,” Tejeda said. “There’s other sports that are coming into the States that you guys can get ownership of.” Thibodeaux has never played cricket and only has watched matches online so far. He likes the fast new format, though, and the fact it’s not difficult for the average person to pick up and try. “It’s about opportunity,” Thibodeaux said. “The tough thing about football, for example, is it has to be orchestrated to be really played. With cricket, I love it because it creates an opportunity for a lot of people to be aware of it and start to play it. You don’t really need that much. It’s similar to baseball in a sense where you really just need a ball and a paddle.” Thibodeaux really does seem to be one of a kind, just as he advertised himself before the Giants picked him . Just this offseason, he launched a TikTok cooking series called “KT’s Finger-Lickin’ Kitchen.” “Dinner gets expensive,” he said at Wednesday’s OTA practice. “I’m going to start eating at home, going to the grocery store.” Thibodeaux also revealed “I want to be an analyst” just like the sportswriters who cover him in the NFL, to see and evaluate “what the next moves are for teams.” He started as a rookie by doing analysis for FOX Sports of last year’s Super Bowl between the Kansas City Chiefs and Philadelphia Eagles. On top of that, his social media is covered with examples of appearances, charity work, paid sponsorships and even an inaugural, free, youth football and cheer camp on June 24 in L.A. Of course, that’s where Angelo Kayvon Thibodeaux Jr. grew up. (That’s right: his real first name is Angelo, and he is technically a junior.) The man is full of surprises. Some of that is about learning from his father’s approach. But a lot of it is intrinsic to Thibodeaux’s own curiosities and mindset. In his second year playing a professional sport, he is already part owner of a team in another, and it’s possible he won’t stop there. “Ownership is the goal in anything, whether it’s sports, entertainment, business,” Thibodeaux said. “Definitely in this league and other leagues, I would love to continue that mindset of getting equity and becoming an owner.” He believes in the “vision” of the T10 cricket format that took off in Abu Dhabi. He said there is an unmistakable “power” to the “great ambassadors” and people behind this USA initiative. And he is attracted to pioneering this sport in the U.S., “being in the first wave of the league coming to America” with a game people know of but not about. “Even as a kid I always thought of that next thing,” Thibodeaux said. “You start to see all these billionaires and people who have done well for themselves, and it always stemmed from thinking outside the box. I feel like we all kind of live in a simulation, and once you start to break that code of what’s normal and start to create that for yourself, you’ll be able to accomplish your dreams.” ()","pubDate":"2023-06-05 18:17:18","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/06/202306021414TMS_____MNGTRPUB_SPORTS-GIANTS-KAYVON-THIBODEAUX-BECOMES-MINORITY-OWNER-2-NY5-2.jpg?w=1400px&strip=all","source_id":"mercurynews","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"डब्ल्यूटीसी फाइनल से पहले राहुल द्रविड़ का लंदन से आया बड़ा बयान, बोले- आईसीसी ट्रॉफी जीतने का दबाव...","link":"https://hindi.news18.com/news/sports/cricket-rahul-dravid-said-not-under-pressure-to-win-icc-titles-ahead-of-india-vs-australia-wtc-final-2023-6427115.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के हेड कोच राहुल द्रविड़ ने कहा है कि आईसीसी ट्रॉफी जीतने का दबाव उनपर नहीं है. भारतीय टीम इस समय wtc final 2023 से पहले लंदन में जमकर पसीना बहा रही है.","content":"राहुल द्रविड़ ने वर्ल्ड टेस्ट चैंपियनशिप से पहले दिया बड़ा बयान. (BCCI Twitter) लंदन. भारत और ऑस्ट्रेलिया के बीच 7 जून से आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल (WTC Final 2023) द ओवल में खेला जाएगा. टीम इंडिया को आईसीसी ट्रॉफी जीते हुए 10 साल हो चुके हैं. बावजूद इसके सोमवार को आयोजित प्रेस कॉन्फ्रेंस में टीम इंडिया के हेड कोच राहुल द्रविड़ (Rahul Dravid) का कहना है कि फाइनल को लेकर उनकी टीम पर किसी तरह का कोई दबाव नहीं है. भारतीय टीम लगातार दूसरी बार डब्ल्यूटीसी फाइनल में पहुंची है जहां उसका सामना पहली बार कंगारुओं से होगा. दोनों टीमें ओवल में पहली बार आमने सामने होंगी. राहुल द्रविड़ ने कहा कि ट्रॉफी जीतना अच्छा होगा जिसके लिए टीम पिछले दो वर्षों से कड़ी मेहनत कर रही है. भारत 2021 में डब्ल्यूटीसी फाइनल में न्यूजीलैंड से हार गया था जबकि आईसीसी के अन्य टूर्नामेंट में वह नॉकआउट चरण में हारता रहा है. द्रविड़ ने कहा,‘नहीं हम पर किसी तरह का दबाव नहीं है. मेरे कहने का मतलब है कि आईसीसी ट्रॉफी जीतने का प्रयास करने का हम किसी तरह का दबाव महसूस नहीं कर रहे हैं. निश्चित तौर पर ट्रॉफी जीतना अच्छा होगा. आईसीसी टूर्नामेंट जीतने में सक्षम होना निश्चित तौर पर अच्छा होगा. लेकिन इस संदर्भ में आपको यह भी देखना होगा कि यह दो साल की कड़ी मेहनत का चरम है. कई सफलताएं हासिल करने के बाद ही आप यहां तक पहुंचते हैं.’इसलिए हमारे पास कई सकारात्मक पहलू हैं. ऑस्ट्रेलिया से सीरीज जीतना, यहां सीरीज ड्रॉ कराना, हर जगह कड़ी प्रतिस्पर्धा करना जो इस टीम के पास है.’ हमने सोचा कि एक-दो रणजी मैच खेल लेगा… तो कहीं नौकरी मिल जाएगी, इशान किशन के पिता ने क्यों कहा ऐसा? भारतीय खिलाड़ी आईपीएल खेलकर सीधे लंदन पहुंचे हैं. टीम इंडिया के खिलाड़ियों के लिए टी20 फॉर्मेट से टेस्ट में लौटना बड़ी चुनौती होगी. रोहित शर्मा की कप्तानी में भारतीय टीम के पास इतिहास रचने का मौका है. टीम इंडिया के लिए लंदन की परिस्थितियों से सामंजस्य बिठाना आसाना नहीं होगा. (इनपुट – भाषा) . Tags: Rahul Dravid , Team india , WTC Final टाटा मोटर्स के शेयर ने तोड़ा अपना रिकॉर्ड, क्या है अगला टारगेट, एक्सपर्ट ने बताया- कहां बेचें-खरीदें ये स्टॉक इस गार्डन में लगे हैं 15000 पेड़ और दो लाख सजावटी फूलों के पौधे, तस्वीरों में देखें इस अद्भुद गार्डन को WTC Final: ऑस्‍ट्रेलिया के खिलाफ भारतीय बैटर्स को बनाने होंगे खूब रन, जानें टॉप-6 का प्रदर्शन","pubDate":"2023-06-05 17:47:56","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rahul-dravid-coach-16859469383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Why Gujarat Titans cricketer Yash Dayal had to issue an apology. Details here","link":"https://www.livemint.com/sports/cricket-news/why-gujarat-titans-cricketer-yash-dayal-had-to-issue-an-apology-details-here-11685973949952.html","keywords":null,"creator":null,"video_url":null,"description":"The left-arm pacer Yash Dayal, on Monday, claimed that his official Instagram handle was hacked after a controversial post of religious nature and a subsequent apology went viral.","content":null,"pubDate":"2023-06-05 17:24:03","image_url":"https://www.livemint.com/lm-img/img/2023/06/05/1600x900/Yash_Dayal_1685976219235_1685976219461.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Switching from IPL to Test cricket should be fun challenge: Shubman Gill","link":"https://www.indiatoday.in/sports/cricket/story/wtc-final-australia-vs-india-shubman-gill-2389199-2023-06-05?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Switching from IPL to Test cricket should be fun challenge: Shubman Gill","content":": India opener has said that it should be a fun thing to switch from fast pace T20 cricket to Test cricket in the World Test Championship Final. In an interview with the ICC Gill has said that he comes into the clash with confidence after his exploits in the Indian Premier League but understands that a Test match is a completely different scenario. \"It does give you a bit of confidence (from the IPL), but I feel this is a completely different scenario and a completely different game,\" Gill told the ICC at The Oval. \"But that's the fun about it. Last week we were playing something completely different with a different atmosphere and that is the challenge and that is what is exciting about Test cricket,\" he further added. The Indian opener spoke about the team's maiden WTC Final against New Zealand. Gill said that as a batting group, India had learned their lessons from that game and would look to apply that experience. India were outplayed by New Zealand in last edition's final where Gill scored 28 and 8 across both innings. Gill has matured since and is among the very few Indian players who have centuries in all formats of the game. In fact, in the recently concluded Indian Premier League, Gill took apart teams single-handedly, scoring the most runs in the tournament. Before the IPL, Gill had scored a Test century against Australia in the fourth Test match of the Border-Gavaskar Trophy at Ahmedabad. \"We have been talking about some of the things we have learnt as a team and especially as a batting group from playing that match,\" he said. \"Hopefully we will be able to overcome the mistakes we made last time,\" Gill concluded.","pubDate":"2023-06-05 17:11:20","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC final: If we play good cricket, we can win, says Rahul Dravid","link":"https://telanganatoday.com/wtc-final-if-we-play-good-cricket-we-can-win-says-rahul-dravid","keywords":["News","Sport","Australia","India","Rahul Dravid","WTC final"],"creator":["IANS"],"video_url":null,"description":"Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India's chances in the match","content":"Home | Sport | Wtc Final If We Play Good Cricket We Can Win Says Rahul Dravid WTC final: If we play good cricket, we can win, says Rahul Dravid Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India's chances in the match By IANS Published Date - 10:30 PM, Mon - 5 June 23 Photo: IANS London: With just two days to go before the start of the ICC World Test Championship final , Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India’s chances in the match. Addressing the media here, he said: “The team that plays good cricket over five days will win. I fully believe if we play good cricket – we have the players, we have the ability – if we take 20 wickets and make runs, we can win this match.” That could be construed as stating the obvious. But he went on to say: “That there’s no hype (about India’s prospects) is a good thing.” An encouraging weather forecast for the World Test Championship final at The Oval in south London – England’s oldest international cricketing venue, where the first Test was held in 1880 – has provided a psychological boost to the Indian team, confronted as they are with the challenge of having to compete at the climax of cricket’s most prestigious championship without the benefit of match practice in English conditions. It was a wet spring; so, there is the likelihood of residual moisture on the pitch. On the other hand, the recent and anticipated sunshine could dry the track, without quite hardening it to generate disconcerting bounce. Last week in the England versus Ireland Test at Lord’s, north of the British capital’s River Thames, the wicket eased into a somewhat flat surface from the second day onwards. India are handicapped by the unavailability of Jasprit Bumrah, K.L. Rahul and Rishabh Pant due to injuries. At the same time, it’s clear that five batsmen, an all-rounder, a wicket-keeper and four bowlers will constitute the playing XI. Speculation over who will stand behind the stumps is perhaps fanciful, since K.S. Bharat is not only a better exponent with the gloves than Ishan Kishan, but has played at the highest level, that too, against Australia, whereas his Kishan is yet to make the grade. Noticeably, Kishan batted extensively at the nets at The Oval on Sunday, while the veteran Ajinkya Rahane surprisingly didn’t do so at all. However, the question remains as to whether the line-up will have four fast bowlers or two spinners. If the former, then Ravichandran Ashwin is likely to be dropped. If otherwise, then the tour think-tank will have to choose between Umesh Yadav and Shardul Thakur. Even in an environment unfavourable to him, as in the previous WTC final at Southampton in 2021, Ashwin impressed with his economy and wicket-taking ability. Also, with four left-handers among Australia’s batsmen, an off-spinner like Ashwin should be an asset. In contrast, Yadav only really comes into his own with reverse swing; and while Thakur is more effective when the ball moves in the air and exhibited a fine all-round display against England at The Oval two years ago, his form in the recently-concluded IPL was disappointing. Talking about the Test a couple of years ago, India won the match to take a 2-1 lead in the series, only to lose the re-scheduled final Test at Edgbaston last year, where the visitors’ somewhat one-dimensional attack in the absence of Ashwin failed to close the contest. Australia , the most successful cricket-playing nation, are formidable opponents anywhere and at any time. While the Indians were earlier practising at the idyllic Duke of Norfolk’s estate in Arundel in Sussex, the Aussies were doing likewise at Beckenham in Kent. On Sunday, they announced that paceman Josh Hazelwood has not sufficiently recovered from a side strain. This could mean in-swing bowler Scott Boland, who averages 13.42 with the ball in Tests, will join captain Pat Cummins and Mitchell Starc to form a trio of specialist quick bowlers, with all-rounder Cameron Green as the fourth option. The Indian vice-captain, Cheteshwar Pujara, who has been among the runs for Sussex in the county championship, will be the only Indian with match practice on English pitches leading up to the WTC final. Among the Australians, the same would be true of Steve Smith and Marcus Labuchange. Openers often hold the key to a side’s overall batting stability. In this case, Indian skipper Rohit Sharma, who was dominant during the last tour of England, but was short of runs in the IPL, and the promising Shubhman Gill are not short of talent. But they are likely to be tested in the early overs by the pace of Cummins and Starc operating with the Duke ball with its more pronounced seam; and therein would hinge a critical element of the match. Mohammed Shami and Mohammed Siraj indicated excellent rhythm in the IPL, which, if replicated, could reap the rewards. Besides, Ravindra Jadeja – as he showed in the home series against Australia in February-March – has returned from his injury a rebooted bowler; and should in theory trouble right-handers. Also Read WTC final should be at least a three-game series, feels David Warner Big challenge for India to come out of T20 mould and play WTC final: Gavaskar Follow Us : Tags Australia India Rahul Dravid WTC final Related News India’s 5G sales hit 50 per cent market for 1st time Women’s hockey Junior Asia Cup: India register hard-fought 2-1 victory over Malaysia Junior World Cup Shooting: Telangana’s Srikanth shoots gold Odisha train accident: Railway Ministry ignored warning about serious flaws in interlocking system Prime Video’s comedy series ‘The Office’ is headed Down Under Editorial: Tragedy on tracks","pubDate":"2023-06-05 17:00:27","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Nick Kyrgios and Roger Federer emerge in French Open’s crying ballkid saga: ‘Now it gets ridiculous’","link":"https://7news.com.au/sport/tennis/nick-kyrgios-and-roger-federer-emerge-in-french-opens-crying-ballkid-saga-now-it-gets-ridiculous-c-10890075","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"‘Roger used to do this all the time .... and it’s a round of applause.’","content":"and Roger Federer have suddenly emerged in the middle of the disqualification saga that unfolded in a doubles match, with the Australian firebrand belatedly reacting to the incident. Miyu Kato was on Sunday when she lobbed a ball towards a ballkid, who was struck and left crying. Watch the latest sport on Channel 7 or stream for free on At first, chair umpire Alexandre Juge only issued a warning to Kato but - after opponents Marie Bouzkova and Sara Sorribes Tormo complained - referee Remy Azemar and Grand Slam supervisor Australian Wayne McKewen stepped in and ruled that Kato and her partner, Aldila Sutjiadi of Indonesia, were indeed disqualified. The tennis world erupted after the unfortunate episode given the gentle nature of the lobbed return that made the ballkid cry. Kato earned significant support in the wake of the incident as Bouzkova and Sorribes Tormo bore the brunt of the heavy criticism. French tennis player Lucas Pouille called their behaviour “shameful” while countryman Gilles Simon hoped “they (would) have a little trouble falling asleep”. Alize Cornet, another local hero, said it was an “insane decision” and sent a pointed message to Kato’s opponents. Kyrgios also had little sympathy for Sorribes Tormo and Bouzkova over fan criticism on their Instagram posts. “Boo hoo,” he wrote. “All around the world, whether it be having people chanting your name, idolising you, getting booed at, it’s always going to be a factor in sport,” Kyrgios added. But Kyrgios noted that rules were rules and the disqualification was just bad luck. “Why are we having so many people complain about it? Also, it’s not about the intent. If you a hit a ball at a kid, it’s a default.” That remark drew the ire of fans who - in the main - believe the disqualification call was extreme. Leading tennis journalist Ben Rothenberg also joined the debate and posted a short clip of retired great Roger Federer. who had a penchant for deliberately testing out ballkids’ catching skills.. “Regardless of if this was the right call or not, and I don’t think it was, players can afford to be more careful with this stuff,” Rothenberg said. “Roger Federer, notably, often played with fire by zipping balls at ball boys in Australia to test their cricket catches. Mixed results.” In the clip, Federer is seen hitting the ball just wide of one ballkid (who takes a ripping catch), while another ballkid is hit after Federer whacked a shot from behind his back. The difference in that incident was that the ballkid was able to laugh it off despite the force of the shot. And ATP tennis commentator Rob Koenig also brought up Federer. “No way this is a default, chair umpire was initially correct. It’s almost like she’s chipping the ball to the ballkid to catch,” he wrote. “Roger (Federer) used to do this all the time. Ballkids catches it, and it’s a round of applause. Disgraceful from the opponents (Bouzkova and Sorribes Tormo) who demanded a default.” Kyrgios, however, took issue with that being on the same level as the French Open incident. “Hahaha. Now it gets ridiculous,” he wote. “The GOAT having some fun and the ballkids are catching it, making their life memory compared to outside doubles match. “Absurd.” The 2022 Wimbledon finalist also defended himself against one fan’s claim that he had struck a child when he threw a racquet. “It was at the end of the match, you potato. Also, didn’t hit anyone,” he wrote.","pubDate":"2023-06-06 03:01:28","image_url":"https://images.7news.com.au/publication/C-10890075/662537bcaf7bae937e9631962335247f186582a3-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Steve Smith in blunt press conference exchange over tricky Test retirement question","link":"https://7news.com.au/sport/cricket/steve-smith-in-blunt-press-conference-exchange-over-tricky-retirement-question-c-10884689","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"The media session could have turned testy - but the cricketer seems to have learned his lesson.","content":"insists he is no clearer about a path to retirement from Test and says taking a lead from fellow veteran David Warner is not an option. Australia face a changing of the guard in the coming years, with . Watch, Stream & Catch Up with Australia's Home of Cricket on In confirming he wants to finish up midway through the next Australian summer, Warner became the first active member of the national Test team to announce his retirement since Mitchell Johnson in 2015. At 34, Smith is two years younger than Warner but they are among a group of celebrated stars in their thirties who have been the backbone of the Australian side for several seasons. Smith indicated in January his retirement could be imminent, admitting in Sydney he may have played his last Test on home soil before later going back on the comments - and he seems to have learned his lesson. When asked if he had any clarity about his future on Monday ahead of the World Test Championship (WTC) showdown with India following Warner’s announcement, Smith smiled and said: “Nah.” Asked if he wanted to elaborate further, Smith again laughed: “Nah.” Warner’s retirement plans have put selectors in a tricky position, with the opener no guarantee to hold his spot through the Ashes series after a lean three-year period with the bat. Smith backed Warner’s decision to make a clear call on when he wanted to bow out, with Warner planning to make the SCG Test against Pakistan in January his last. He did, however, concede even Warner’s grand plans are far from certain. “It’s nice to have an end date, I suppose, if that’s the way you want to go,” Smith said. “But ultimately for all of us we’ve going to be doing our job and for batters that is scoring runs. “In an ideal world, I think Davey said that’s when he’d like to pick it up. But we’ve got to score runs, all of us. So we’ll see what happens.” While retirement is not a topic Smith wants to embrace, he is worried about the future of Test cricket. The WTC final and Ashes series are being played amid fears over the viability of the long-format game against the rise of global franchise contracts across multiple leagues. “I am slightly concerned,” Smith said. “Hopefully Test cricket still stays alive and well. “I think it’s in a good place at the moment in terms of some of the games we’ve seen recently have been pretty amazing. “As a traditionalist and someone that loves Test cricket, I hope it still remains at the front of all the boards’ minds and stays alive and well for some time to come.”","pubDate":"2023-06-06 01:45:48","image_url":"https://images.7news.com.au/publication/C-10884689/e5c020b9b4286ac5140101bfe539b1241b07bfaa-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"England send desperate SOS for retired 35-year-old Moeen Ali to save the Ashes","link":"https://7news.com.au/sport/cricket/england-send-desperate-sos-for-retired-35-year-old-moeen-ali-to-save-the-ashes-c-10887394","keywords":null,"creator":["Rory Dollard"],"video_url":null,"description":"A very familiar face has received a shock call to pull on the pads for the first time in years.","content":"Moeen Ali is considering the possibility of reversing his Test retirement after Jack Leach’s injury left England short of an experienced spinner for the . Moeen, 35, has not played red-ball cricket since September 2021 but has found his name thrust back into the conversation after Leach was ruled out for the summer by a stress fracture in his lower back. The PA news agency understands Moeen is weighing up whether or not to make a dramatic return over the next couple of days. Watch, Stream & Catch Up with Australia's Home of Cricket on England are not without slow bowling options, with Surrey’s Will Jacks, Leicestershire’s rising star Rehan Ahmed and Liam Dawson all offering different skills. However, none can match the experience of a seasoned Test player with 64 caps and 195 wickets under his belt. Head coach Brendon McCullum previously tried to tempt the all-rounder back into the fray for the historic tour of Pakistan but, after initially declaring himself open to the idea, Moeen ultimately decided to stick to limited-overs cricket. Now the same offer is back on the table in the form of one last shot at Australia. With the series getting under way at Moeen’s home ground of Edgbaston on June 16, time is short, but the England and Wales Cricket Board are unlikely to rush for a quick verdict. Announcing his decision not to take up McCullum’s offer of taking part in the Pakistan trip, Moeen said last year: “I want to enjoy my cricket and it wouldn’t be fair to reverse my decision and then struggle to give it my all. It’s time to close the door on that side of my career. To play 64 Tests for England has been a privilege and a dream fulfilled.” He had earlier taken a different tone, hinting that he could be persuaded to re-enter the fray, telling PA and the Guardian last June: “Baz messaged me asking if I was in. Maybe in the future, potential tours or whatever, who knows? I said ‘Call me at the time’. If and when he calls me, we’ll chat.” If he did throw himself into the maelstrom of an Ashes summer, Moeen would need to be certain he had the necessary mental and physical energy to take on a side against whom he has some difficult experiences but, perhaps, unfinished business. The leadership style of McCullum and captain Ben Stokes may prove a real draw in his deliberations. Moeen’s naturally aggressive style, with both ball and bat, chimes perfectly with the current environment and the chance to make his own mark on the ‘Bazball’ era could be persuasive. Stuart Broad, a contemporary of Moeen’s who has been revitalised by the set-up over the last year, can already see a neat fit. “We know Mo is a phenomenal cricketer and someone who would fit into Stokes and Baz’s philosophy beautifully,” he told Sky Sports. “I don’t know if he’s being considered by the selectors or if he would consider red-ball cricket again, but he’s a mighty fine cricketer.” England have held off naming an addition to the squad, having originally expected to make an early call, leaving the ball in Moeen’s court.","pubDate":"2023-06-05 23:27:12","image_url":"https://images.7news.com.au/publication/C-10887394/c56a02e19e732e419e80f523e781e3f39d1ca4b0-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"England wait as Moeen Ali ponders chance to make Test return for Ashes","link":"https://www.theguardian.com/sport/2023/jun/05/england-wait-as-moeen-ali-ponders-chance-to-make-test-return-for-ashes","keywords":["England cricket team","Moeen Ali","Australia cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Moeen retired from Test cricket in September 2021England seeking replacement for injured spinner Jack LeachMoeen Ali will decide over the next 48 hours whether he is ready to end his retirement from Test cricket and answer England’s spin-bowling distress flare in the Ashes.Moeen, 35, called time on his 64-cap Test career in September 2021 and has enjoyed his time as a freewheeling white-ball specialist since, securing two Indian Premier League titles with Chennai Super Kings and helping England seal T20 World Cup glory in Australia last winter. Continue reading...","content":null,"pubDate":"2023-06-05 18:51:12","image_url":"https://i.guim.co.uk/img/media/8396d64c2a47aeed43b45714813b8adccea7fdd6/848_55_3720_2232/master/3720.jpg?width=460&quality=85&auto=format&fit=max&s=4e5b9b19c08d22a742f881aff2fb8f52","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"जल्द ठीक हो जाओ, अगले सीजन में मिलते हैं चैंपियन धोनी, सर्जरी के बाद माही की दिखी पहली झलक","link":"https://hindi.news18.com/news/sports/cricket-mohammad-kaif-share-ms-dhoni-photo-after-surgery-with-family-told-get-well-soon-see-you-next-season-champion-6427283.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"मोहम्मद कैफ ने महेंद्र सिंह धोनी संग तस्वीर शेयर की है. यह तस्वीर धोनी के घुटने की सर्जरी की बाद की है. धोनी दूसरी तस्वीर में कैफ के बेटे कबीर संग नजर आ रहे हैं. दोनों बेहद खुश दिखाई दे रहे हैं.","content":"महेंद्र सिंह धोनी ने हाल में घुटने की सर्जरी कराई है. नई दिल्ली. चेन्नई सुपरकिंग्स के कप्तान महेंद्र सिंह धोनी (MS Dhoni) की हाल में घुटने की सफल सर्जरी हुई है. सर्जरी के बाद माही की पहली तस्वीर सामने आई है. टीम इंडिया के पूर्व क्रिकेटर मोहम्मद कैफ (Mohammad Kaif) ने धोनी की तस्वीर सोशल मीडिया पर शेयर की है जिसपर फैंस अलग अलग कॉमेंट कर रहे हैं. धोनी से मिलकर कैफ का बेटा बेहद खुश हुआ. कैफ ने इसकी जानकारी अपने इंस्टाग्राम हैंडल पर दी है. धोनी ने हाल में चेन्नई सुपरकिंग्स को अपनी कप्तानी में पांचवीं बार चैंपियन बनाया. माही अगले साल भी आईपीएल में खेलते हुए नजर आएंगे. मोहम्मद कैफ ने इंस्टाग्राम पर दो तस्वीर शेयर की है. पहली तस्वीर में धोनी संग उनकी पत्नी साक्षी (Sakshi) बेटी जीवा (Ziva)और मोहम्मद कैफ अपनी पत्नी पूजा और बेटे कबीर के साथ दिखाई दे रहे हैं जबकि दूसरी तस्वीर में धोनी और कबीर एक साथ दिखाई दे रहे हैं. धोनी ने कबीर के कंधें पर हाथ रखा हुआ है. कबीर इस दौरान काफी खुश दिखाई दे रहा है. मोहम्मद कैफ ने कैप्शन लिखा, आज हम एयरपोर्ट पर महान इंसान और उनकी फैमिली से मिले. वह सर्जरी के बाद लौट रहे थे. बेटा कबीर सुपर हैप्पी था. क्योंकि धोनी ने उससे कहा कि जब वह छोटे थे तब वह भी बचपन में फुटबॉल खेला करते थे. जल्द ठीक हो जाओ. अगले सीजन में मिलते हैं चैंपियन धोनी. धोनी से मिले कैफ के बेटे कबीरधोनी को यह चोट आईपीएल के 16वें एडिशन के पहले मैच में लगी थी. गुजरात टाइटंस के खिलाफ मैच में धोनी अपना घुटना चोटिल करा बैठे थे. माही फील्डिंग के दौरान डाइव लगाते हुए चोटिल हुए थे. चोटिल होने के बावजूद धोनी ने पूरा टूर्नामेंट खेला. उन्होंने आईपीएल खत्म होने के बाद घुटने का ऑपरेशन कराया है. . Tags: Mohammad kaif , Ms dhoni टाटा मोटर्स के शेयर ने तोड़ा अपना रिकॉर्ड, क्या है अगला टारगेट, एक्सपर्ट ने बताया- कहां बेचें-खरीदें ये स्टॉक इस गार्डन में लगे हैं 15000 पेड़ और दो लाख सजावटी फूलों के पौधे, तस्वीरों में देखें इस अद्भुद गार्डन को WTC Final: ऑस्‍ट्रेलिया के खिलाफ भारतीय बैटर्स को बनाने होंगे खूब रन, जानें टॉप-6 का प्रदर्शन","pubDate":"2023-06-05 18:30:19","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/ms-dhoni-with-kaif-16859893053x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Giants’ Kayvon Thibodeaux becomes minority owner of New York Warriors T10 pro cricket team","link":"https://www.mercurynews.com/2023/06/05/giants-kayvon-thibodeaux-becomes-minority-owner-of-new-york-warriors-t10-pro-cricket-team-3/","keywords":["NFL","Sports"],"creator":["Tribune News Service"],"video_url":null,"description":"“I watched him build houses, I watched him fix things, and I think for him there was an understanding that nothing is actually broken,” Thibodeaux, 22, the Giants’ pass rusher, told the Daily News on the phone Thursday.“ There’ s a way to fix it.”. But Friday’ s launch of Thibodeaux’ s involvement in this new, six-team, USA Masters T10 cricket league is about the Giants defender...","content":"Kayvon Thibodeaux says he has always thought outside the box. He attributes the origin of his curiosity to his father Angelo’s creativity and unorthodox mindset in the construction business growing up in South Central Los Angeles. “I watched him build houses, I watched him fix things, and I think for him there was an understanding that nothing is actually broken,” Thibodeaux, 22, the Giants’ pass rusher, told the Daily News on the phone Thursday. “There’s a way to fix it.” The story of how Thibodeaux became a minority owner and equity partner in a professional, New York-based cricket team, the New York Warriors, is not about fixing something that’s off. But Friday’s launch of Thibodeaux’s involvement in this new, six-team, USA Masters T10 cricket league is about the Giants defender gravitating towards opportunity, approaching life a bit differently than the next guy and approving of a slight fix, let’s call it, to a world-famous game: Shortening the play time of cricket matches from five days to 90 minutes. “It’s more home runs, more entertainment, faster and shorter games, with a new format that’s possibly being placed in the Olympics in the next two years,” said Cervando Tejeda, founder of Athletes Sports Management Inc. and a minority owner of the USA Masters T10 league. Six seasons of popular and financial success in Abu Dhabi with this new format laid the groundwork for worldwide expansion. The U.S. league will hold its inaugural draft in the second week of July and launch its first season in mid-August. It will be televised internationally, and the plan is to add two more teams in 2024. The first six teams will represent New York, Philadelphia, Dallas, North Carolina (Morrisville), Los Angeles and Houston. Games will be played at stadiums in Florida, North Carolina and Houston. And that’s where Thibodeaux comes in. “We want to cover the entire USA. That’s why we want to involve USA athletes,” said Ritesh Patel, majority owner of the U.S. T10 league alongside billionaire founder Shaji Ul Mulk. “So we started discussing this with Kayvon, and we see it: He’s one of the best in the NFL but he has the best business brain, has lots of good business ideas. He can take this to a different level. So we brought him on as an equity partner.” Thibodeaux attended a Dallas T10 launch event in early May and spoke with Patel and New York Warriors majority owner Muhammad Kamran Awan. And Patel said Thibodeaux “blew me away” with what he had envisioned, from educating people about cricket, to doing cricket commentary, to other ideas that would promote growth. “One big part of my role is obviously the money but, two, it’s storytelling,” Thibodeaux said. “Being an athlete in this new world of media, I understand how storytelling works in the new age, I understand how to connect with people, and marketing is something I majored in. So that’s definitely how I’m going to help market my team and also the league itself.” The Giants and NFL football are still number one for Thibodeaux, but Tejeda said it’s realistic that when he has the time, Thibodeaux will make himself more “present” around this modern cricket league and team. “But I think what he’s doing right now coming in as an owner of a team is just setting the standard for other athletes to say look, you don’t just have to own an NFL team or soccer team or NBA team,” Tejeda said. “There’s other sports that are coming into the States that you guys can get ownership of.” Thibodeaux has never played cricket and only has watched matches online so far. He likes the fast new format, though, and the fact it’s not difficult for the average person to pick up and try. “It’s about opportunity,” Thibodeaux said. “The tough thing about football, for example, is it has to be orchestrated to be really played. With cricket, I love it because it creates an opportunity for a lot of people to be aware of it and start to play it. You don’t really need that much. It’s similar to baseball in a sense where you really just need a ball and a paddle.” Thibodeaux really does seem to be one of a kind, just as he advertised himself before the Giants picked him . Just this offseason, he launched a TikTok cooking series called “KT’s Finger-Lickin’ Kitchen.” “Dinner gets expensive,” he said at Wednesday’s OTA practice. “I’m going to start eating at home, going to the grocery store.” Thibodeaux also revealed “I want to be an analyst” just like the sportswriters who cover him in the NFL, to see and evaluate “what the next moves are for teams.” He started as a rookie by doing analysis for FOX Sports of last year’s Super Bowl between the Kansas City Chiefs and Philadelphia Eagles. On top of that, his social media is covered with examples of appearances, charity work, paid sponsorships and even an inaugural, free, youth football and cheer camp on June 24 in L.A. Of course, that’s where Angelo Kayvon Thibodeaux Jr. grew up. (That’s right: his real first name is Angelo, and he is technically a junior.) The man is full of surprises. Some of that is about learning from his father’s approach. But a lot of it is intrinsic to Thibodeaux’s own curiosities and mindset. In his second year playing a professional sport, he is already part owner of a team in another, and it’s possible he won’t stop there. “Ownership is the goal in anything, whether it’s sports, entertainment, business,” Thibodeaux said. “Definitely in this league and other leagues, I would love to continue that mindset of getting equity and becoming an owner.” He believes in the “vision” of the T10 cricket format that took off in Abu Dhabi. He said there is an unmistakable “power” to the “great ambassadors” and people behind this USA initiative. And he is attracted to pioneering this sport in the U.S., “being in the first wave of the league coming to America” with a game people know of but not about. “Even as a kid I always thought of that next thing,” Thibodeaux said. “You start to see all these billionaires and people who have done well for themselves, and it always stemmed from thinking outside the box. I feel like we all kind of live in a simulation, and once you start to break that code of what’s normal and start to create that for yourself, you’ll be able to accomplish your dreams.” ()","pubDate":"2023-06-05 18:17:18","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/06/202306021414TMS_____MNGTRPUB_SPORTS-GIANTS-KAYVON-THIBODEAUX-BECOMES-MINORITY-OWNER-2-NY5-2.jpg?w=1400px&strip=all","source_id":"mercurynews","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"डब्ल्यूटीसी फाइनल से पहले राहुल द्रविड़ का लंदन से आया बड़ा बयान, बोले- आईसीसी ट्रॉफी जीतने का दबाव...","link":"https://hindi.news18.com/news/sports/cricket-rahul-dravid-said-not-under-pressure-to-win-icc-titles-ahead-of-india-vs-australia-wtc-final-2023-6427115.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के हेड कोच राहुल द्रविड़ ने कहा है कि आईसीसी ट्रॉफी जीतने का दबाव उनपर नहीं है. भारतीय टीम इस समय wtc final 2023 से पहले लंदन में जमकर पसीना बहा रही है.","content":"राहुल द्रविड़ ने वर्ल्ड टेस्ट चैंपियनशिप से पहले दिया बड़ा बयान. (BCCI Twitter) लंदन. भारत और ऑस्ट्रेलिया के बीच 7 जून से आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल (WTC Final 2023) द ओवल में खेला जाएगा. टीम इंडिया को आईसीसी ट्रॉफी जीते हुए 10 साल हो चुके हैं. बावजूद इसके सोमवार को आयोजित प्रेस कॉन्फ्रेंस में टीम इंडिया के हेड कोच राहुल द्रविड़ (Rahul Dravid) का कहना है कि फाइनल को लेकर उनकी टीम पर किसी तरह का कोई दबाव नहीं है. भारतीय टीम लगातार दूसरी बार डब्ल्यूटीसी फाइनल में पहुंची है जहां उसका सामना पहली बार कंगारुओं से होगा. दोनों टीमें ओवल में पहली बार आमने सामने होंगी. राहुल द्रविड़ ने कहा कि ट्रॉफी जीतना अच्छा होगा जिसके लिए टीम पिछले दो वर्षों से कड़ी मेहनत कर रही है. भारत 2021 में डब्ल्यूटीसी फाइनल में न्यूजीलैंड से हार गया था जबकि आईसीसी के अन्य टूर्नामेंट में वह नॉकआउट चरण में हारता रहा है. द्रविड़ ने कहा,‘नहीं हम पर किसी तरह का दबाव नहीं है. मेरे कहने का मतलब है कि आईसीसी ट्रॉफी जीतने का प्रयास करने का हम किसी तरह का दबाव महसूस नहीं कर रहे हैं. निश्चित तौर पर ट्रॉफी जीतना अच्छा होगा. आईसीसी टूर्नामेंट जीतने में सक्षम होना निश्चित तौर पर अच्छा होगा. लेकिन इस संदर्भ में आपको यह भी देखना होगा कि यह दो साल की कड़ी मेहनत का चरम है. कई सफलताएं हासिल करने के बाद ही आप यहां तक पहुंचते हैं.’इसलिए हमारे पास कई सकारात्मक पहलू हैं. ऑस्ट्रेलिया से सीरीज जीतना, यहां सीरीज ड्रॉ कराना, हर जगह कड़ी प्रतिस्पर्धा करना जो इस टीम के पास है.’ हमने सोचा कि एक-दो रणजी मैच खेल लेगा… तो कहीं नौकरी मिल जाएगी, इशान किशन के पिता ने क्यों कहा ऐसा? भारतीय खिलाड़ी आईपीएल खेलकर सीधे लंदन पहुंचे हैं. टीम इंडिया के खिलाड़ियों के लिए टी20 फॉर्मेट से टेस्ट में लौटना बड़ी चुनौती होगी. रोहित शर्मा की कप्तानी में भारतीय टीम के पास इतिहास रचने का मौका है. टीम इंडिया के लिए लंदन की परिस्थितियों से सामंजस्य बिठाना आसाना नहीं होगा. (इनपुट – भाषा) . Tags: Rahul Dravid , Team india , WTC Final टाटा मोटर्स के शेयर ने तोड़ा अपना रिकॉर्ड, क्या है अगला टारगेट, एक्सपर्ट ने बताया- कहां बेचें-खरीदें ये स्टॉक इस गार्डन में लगे हैं 15000 पेड़ और दो लाख सजावटी फूलों के पौधे, तस्वीरों में देखें इस अद्भुद गार्डन को WTC Final: ऑस्‍ट्रेलिया के खिलाफ भारतीय बैटर्स को बनाने होंगे खूब रन, जानें टॉप-6 का प्रदर्शन","pubDate":"2023-06-05 17:47:56","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rahul-dravid-coach-16859469383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Why Gujarat Titans cricketer Yash Dayal had to issue an apology. Details here","link":"https://www.livemint.com/sports/cricket-news/why-gujarat-titans-cricketer-yash-dayal-had-to-issue-an-apology-details-here-11685973949952.html","keywords":null,"creator":null,"video_url":null,"description":"The left-arm pacer Yash Dayal, on Monday, claimed that his official Instagram handle was hacked after a controversial post of religious nature and a subsequent apology went viral.","content":null,"pubDate":"2023-06-05 17:24:03","image_url":"https://www.livemint.com/lm-img/img/2023/06/05/1600x900/Yash_Dayal_1685976219235_1685976219461.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Switching from IPL to Test cricket should be fun challenge: Shubman Gill","link":"https://www.indiatoday.in/sports/cricket/story/wtc-final-australia-vs-india-shubman-gill-2389199-2023-06-05?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Switching from IPL to Test cricket should be fun challenge: Shubman Gill","content":": India opener has said that it should be a fun thing to switch from fast pace T20 cricket to Test cricket in the World Test Championship Final. In an interview with the ICC Gill has said that he comes into the clash with confidence after his exploits in the Indian Premier League but understands that a Test match is a completely different scenario. \"It does give you a bit of confidence (from the IPL), but I feel this is a completely different scenario and a completely different game,\" Gill told the ICC at The Oval. \"But that's the fun about it. Last week we were playing something completely different with a different atmosphere and that is the challenge and that is what is exciting about Test cricket,\" he further added. The Indian opener spoke about the team's maiden WTC Final against New Zealand. Gill said that as a batting group, India had learned their lessons from that game and would look to apply that experience. India were outplayed by New Zealand in last edition's final where Gill scored 28 and 8 across both innings. Gill has matured since and is among the very few Indian players who have centuries in all formats of the game. In fact, in the recently concluded Indian Premier League, Gill took apart teams single-handedly, scoring the most runs in the tournament. Before the IPL, Gill had scored a Test century against Australia in the fourth Test match of the Border-Gavaskar Trophy at Ahmedabad. \"We have been talking about some of the things we have learnt as a team and especially as a batting group from playing that match,\" he said. \"Hopefully we will be able to overcome the mistakes we made last time,\" Gill concluded.","pubDate":"2023-06-05 17:11:20","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC final: If we play good cricket, we can win, says Rahul Dravid","link":"https://telanganatoday.com/wtc-final-if-we-play-good-cricket-we-can-win-says-rahul-dravid","keywords":["News","Sport","Australia","India","Rahul Dravid","WTC final"],"creator":["IANS"],"video_url":null,"description":"Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India's chances in the match","content":"Home | Sport | Wtc Final If We Play Good Cricket We Can Win Says Rahul Dravid WTC final: If we play good cricket, we can win, says Rahul Dravid Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India's chances in the match By IANS Published Date - 10:30 PM, Mon - 5 June 23 Photo: IANS London: With just two days to go before the start of the ICC World Test Championship final , Rahul Dravid, head coach of the Indian cricket team, exuded cautious confidence about India’s chances in the match. Addressing the media here, he said: “The team that plays good cricket over five days will win. I fully believe if we play good cricket – we have the players, we have the ability – if we take 20 wickets and make runs, we can win this match.” That could be construed as stating the obvious. But he went on to say: “That there’s no hype (about India’s prospects) is a good thing.” An encouraging weather forecast for the World Test Championship final at The Oval in south London – England’s oldest international cricketing venue, where the first Test was held in 1880 – has provided a psychological boost to the Indian team, confronted as they are with the challenge of having to compete at the climax of cricket’s most prestigious championship without the benefit of match practice in English conditions. It was a wet spring; so, there is the likelihood of residual moisture on the pitch. On the other hand, the recent and anticipated sunshine could dry the track, without quite hardening it to generate disconcerting bounce. Last week in the England versus Ireland Test at Lord’s, north of the British capital’s River Thames, the wicket eased into a somewhat flat surface from the second day onwards. India are handicapped by the unavailability of Jasprit Bumrah, K.L. Rahul and Rishabh Pant due to injuries. At the same time, it’s clear that five batsmen, an all-rounder, a wicket-keeper and four bowlers will constitute the playing XI. Speculation over who will stand behind the stumps is perhaps fanciful, since K.S. Bharat is not only a better exponent with the gloves than Ishan Kishan, but has played at the highest level, that too, against Australia, whereas his Kishan is yet to make the grade. Noticeably, Kishan batted extensively at the nets at The Oval on Sunday, while the veteran Ajinkya Rahane surprisingly didn’t do so at all. However, the question remains as to whether the line-up will have four fast bowlers or two spinners. If the former, then Ravichandran Ashwin is likely to be dropped. If otherwise, then the tour think-tank will have to choose between Umesh Yadav and Shardul Thakur. Even in an environment unfavourable to him, as in the previous WTC final at Southampton in 2021, Ashwin impressed with his economy and wicket-taking ability. Also, with four left-handers among Australia’s batsmen, an off-spinner like Ashwin should be an asset. In contrast, Yadav only really comes into his own with reverse swing; and while Thakur is more effective when the ball moves in the air and exhibited a fine all-round display against England at The Oval two years ago, his form in the recently-concluded IPL was disappointing. Talking about the Test a couple of years ago, India won the match to take a 2-1 lead in the series, only to lose the re-scheduled final Test at Edgbaston last year, where the visitors’ somewhat one-dimensional attack in the absence of Ashwin failed to close the contest. Australia , the most successful cricket-playing nation, are formidable opponents anywhere and at any time. While the Indians were earlier practising at the idyllic Duke of Norfolk’s estate in Arundel in Sussex, the Aussies were doing likewise at Beckenham in Kent. On Sunday, they announced that paceman Josh Hazelwood has not sufficiently recovered from a side strain. This could mean in-swing bowler Scott Boland, who averages 13.42 with the ball in Tests, will join captain Pat Cummins and Mitchell Starc to form a trio of specialist quick bowlers, with all-rounder Cameron Green as the fourth option. The Indian vice-captain, Cheteshwar Pujara, who has been among the runs for Sussex in the county championship, will be the only Indian with match practice on English pitches leading up to the WTC final. Among the Australians, the same would be true of Steve Smith and Marcus Labuchange. Openers often hold the key to a side’s overall batting stability. In this case, Indian skipper Rohit Sharma, who was dominant during the last tour of England, but was short of runs in the IPL, and the promising Shubhman Gill are not short of talent. But they are likely to be tested in the early overs by the pace of Cummins and Starc operating with the Duke ball with its more pronounced seam; and therein would hinge a critical element of the match. Mohammed Shami and Mohammed Siraj indicated excellent rhythm in the IPL, which, if replicated, could reap the rewards. Besides, Ravindra Jadeja – as he showed in the home series against Australia in February-March – has returned from his injury a rebooted bowler; and should in theory trouble right-handers. Also Read WTC final should be at least a three-game series, feels David Warner Big challenge for India to come out of T20 mould and play WTC final: Gavaskar Follow Us : Tags Australia India Rahul Dravid WTC final Related News India’s 5G sales hit 50 per cent market for 1st time Women’s hockey Junior Asia Cup: India register hard-fought 2-1 victory over Malaysia Junior World Cup Shooting: Telangana’s Srikanth shoots gold Odisha train accident: Railway Ministry ignored warning about serious flaws in interlocking system Prime Video’s comedy series ‘The Office’ is headed Down Under Editorial: Tragedy on tracks","pubDate":"2023-06-05 17:00:27","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"}]}