{"newsArray":[{"title":"Lord's cricket row EXPLAINED: England and Australia lock horns following controversial dismissal","link":"https://www.dailymail.co.uk/sport/cricket/article-12260743/Lords-cricket-row-EXPLAINED-England-Australia-lock-horns-following-controversial-dismissal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Jonny Bairstow's controversial dismissal has lit the touch paper for much debate around the cricket community. Many have suggested that it wasn't 'in the spirit of the game'.","content":"Lord's cricket row EXPLAINED: England and Australia lock horns following Jonny Bairstow's controversial dismissal at Lord's Australia took a 2-0 lead in the Ashes on Sunday in controversial circumstances Jonny Bairstow was dismissed after he was stumped by wicketkeeper Alex Carey The England batsman thought the ball had gone dead but was instead given out By Ed Carruthers For Mailonline Published: 00:19 BST, 4 July 2023 | Updated: 00:36 BST, 4 July 2023 e-mail View comments Whatever side of the fence you sit on, it's safe to say that it's been an explosive 24 hours following England's defeat by Australia at Lord's in the second Ashes Test. Jonny Bairstow 's controversial dismissal has lit the touch paper for much debate around the cricket community. Many have weighed in on the argument, with some claiming Australia's dismissal was 'just not cricket' while others, including Stuart Broad , who wrote today for Mail Sport, saying he was 'amazed' that not one Australian stood up to say Bairstow's dismissal was wrong. In any event, the decision stood and Ben Stokes ' side succumbed to a 43-run loss and are now 2-0 down in the Ashes series. They must-win in the third Test which starts on Thursday at Headingley in Leeds if they have any hope of winning the urn back off Australia this summer. But perhaps the events of Sunday afternoon might provide Brendon McCullum's side with the fire they may have been lacking to turn things around. But what actually happened to spark such a furious reaction among the England Cricket camp and their fans, that has also seen a war of words arise between both British and Australian media agencies. Mail Sport takes a deep dive into the controversial dismissal, the Series as it stands and all the reaction from the second test at Lord's. So what actually happened? England came into the final day of the Lord's test needing 257 to win with six wickets remaining. Two of those wickets included Stokes and Bairstow. Saturday had a few extraordinary moments of its own, with Mitchell Starc appearing to take a tumbling catch that would have dismissed Ben Duckett, had he not placed the ball on the ground with an open palm to cushion his landing. Still, Australia attacked England and dismissed Duckett, with their wicketkeeper-batmsan Bairstow arriving to partner up with his captain. He would face just 22 balls, scoring 10 runs, before he was shockingly dismissed by Alex Carey. Opting to leave a bouncing ball launched at him by Cameron Green from down the wicket, Bairstow scratched his crease with his foot, assuming that the ball was dead and walked seamlessly out into the middle of the wicket. He was largely oblivious to what was going on behind him, with Australia's wicketkeeper, Carey, realising that Bairstow was about to leave his crease, and in a moment of quick thinking, chucked the ball at the stumps with an under arm throw, catching the Englishman, who had departed his crease, off guard. Was Bairstow out? That is one of the big questions and is perhaps why live sport is so great. This decision will provide debates for years, decades perhaps, to come. Following a review, the umpires decided that Bairstow was in fact out and he was dismissed from the field. While the umpires have already made their decision and there's no way we can change it now, the key point of controversy was whether the ball was still live after Bairstow had left his crease. It was the end of the over and the replays show the 33-year-old walking down the wicket to talk to his partner, seeming to assume that the ball was no longer in play. Many have questioned whether the ball was actually still live, and it seemed that way, with both umpires taking strides forward, while even Bairstow had scratched his crease with his foot to 'regain his ground', as Mail Sport's Ian Ladyman put it, indicating that he thought the ball was now dead. Bairstow had neither, as Mail Sport columnist Stuart Broad said , tried to take an advantage by making a run after he left the ball, meaning that he thought play would not continue. Conversely, both Stokes and McCullum have admitted that it was out , and all things considered, the correct decision does seem to have been given. Ironically, even after the MCC members were so incensed in the Long Room (more on that in a moment) following the session, under the MCC's Laws of Cricket, the ball was perhaps still in play. Rule 20.1.2 states : 'The ball shall be considered to be dead when it is clear to the bowler’s end umpire that the fielding side and both batters at the wicket have ceased to regard it as in play.' Why are England so upset about it? The problem, perhaps for a lot of commentators around England though was not so much that Bairstow was in or out, it was more about the fairness of the game, with Stokes and McCullum both stating that while Australia dismissed Bairstow within the laws, it was perhaps not done in the 'spirit of the game'. The England captain in fact said that Australia had forgotten the values of the sport and should have maybe re-thought their decision to appeal the wicket. 'I am not disputing the fact it is out because it is out,' said Stokes. 'If the shoe was on the other foot, I would have put more pressure on the umpires and asked whether they had called over and had a deep think about the whole spirit of the game and whether I would want to do something like that. 'For Australia, it was the match-winning moment. Would I want to win a game in that manner? The answer is no,' Stokes added. McCullum echoed his comments saying: 'In the end, they made a play, they’ve got to live with that. We would have made a different play, but that’s life.' Should pat cummins have rescinded his appeal? Some have even criticised Pat Cummins claiming that the Australian captain should have rescinded his appeal to get Bairstow out and called him back onto the field to bat again . That would have certainly been a display of sportsmanship, for sure. But Cummins was unapologetic, claiming he thought the dismissal was reasonable. 'I thought it was fair,' the Australian captain said. 'You see Jonny do it all the time. He did it on Day One to Warner. He did it in 2019 to Steve [Smith]. It's a really common thing for keepers to do if they see a batter keep on leaving their crease,' said the Australia captain. 'Caz [Carey] - full credit to him. He saw the opportunity a few balls beforehand and rolled at the stumps. Jonny left his crease and we'll leave the rest to the umpires.' What is the MCC? Things took an unsavoury turn as Australia walked back into the changing rooms following the session. Lord's is one of the most historic sporting venues in the world and is home to the MCC - the Marleybone Cricket Club. It is said to be the home of cricket and houses 18,000 members, who queue outside the ground each morning of the Test match to get access to the stadium. And what is the Long Room? Members convene in what's known as the Long Room, a dining hall built in the pavilion end of the stadium which is surrounded by paintings of players of years gone by. The players of both sides must walk through the long room to get to and from the dressing rooms and it is here where much controversy emerged on Sunday after several MCC members heckled the Australian players heading back into the dressing rooms. They were branded 'cheats' by the members, with some confronting Australia's Usman Khawaja, who seemed to become incensed by some comments that were made towards him by the members . Three members have subsequently been suspended by the club, pending investigations , following the ugly scenes. The explosive reaction In the past 24 hours there has been plenty of reaction both online and from some of the biggest names in cricket, with Sir Geoffrey Boycott, a legend of the sport, calling for Australia to apologise to England . Broad, who came in to replace Bairstow, sarcastically jested with the Australian's following his dismissal, while also told Carey that the stumping was: 'All he'd be remembered for.' He has also had his say, writing in a column for Mail Sport today saying that he was 'stunned' none of the Australians had admitted that the appeal 'was wrong' while also claiming that Cummins will regret not rescinding Australia's appeal . Even the British Prime Minister, Rishi Sunak, who has been spotted at Lords this week, weighed in on the row, slamming Australia for the dismissal . Media outlets down under and in the UK have been having their own war of words, with some Australian outlets hitting out at the uproar from the English. Some outlets down under have dubbed the English as 'hypocrites', 'whingers' and 'miserable poms'. A page of the Western Australian paper was also posted on Twitter earlier on Monday and depicted a photoshopped image of Ben Stokes wearing a nappy while sucking on a dummy. The image showed him reaching for an unblemished looking cricket ball with the caption 'Cry babies' underneath. And Stokes has hit back at the image , tweeting in response: 'That’s definitely not me, since when did I bowl with the new ball.' In any event, Thursday's test match at Headingley is set to have plenty added edge to it, with England coming in to the game looking to rescue the series, while Australia are just one step away from retaining the urn. Share or comment on this article: Lord's cricket row EXPLAINED: England and Australia lock horns following controversial dismissal e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 23:19:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/00/72804581-0-image-a-103_1688426324104.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Stuart Broad thinks Pat Cummins will regret handling of Jonny Bairstow dismissal","link":"https://www.watfordobserver.co.uk/sport/national/23631113.stuart-broad-thinks-pat-cummins-will-regret-handling-jonny-bairstow-dismissal/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Broad replaced Bairstow in the middle following the incident before Australia went on to win the second Ashes Test and take a 2-0 lead.","content":"Alex Carey’s opportunistic stumping of his fellow wicketkeeper during the dramatic conclusion to the second Ashes Test sparked fury from fans and members at the home of cricket and the row has shown no signs of abating. Broad replaced Bairstow in the middle following the incident, before Australia went on to win and take a 2-0 lead. Broad insists “zero advantage” came from Bairstow straying from his crease and, after making his point to the Australian players throughout the duration of his stay, the England seamer feels Cummins will eventually think upholding the appeal was the wrong play. “What amazed me, and what I told the Australians I could not believe as we left the field at lunch, was that not one senior player among them — and I very much understand in the emotion of the game that the bowler and wicketkeeper would have thought ‘that’s out’ — questioned what they had done,” Broad wrote in the Daily Mail. “Especially given what their team has been through over recent years, with all their cultural change. Not one of them said ‘Hang on, lads. I’m not really sure about this’. Not one of them thought ‘He’s gaining no advantage. He’s not trying to get a run. It’s the end of the over. It’s a bit of a random dismissal. We should cancel that appeal’. “Ultimately, Pat Cummins is a really great guy and I would be amazed, once the emotion settles, if he does not sit back and think ‘I got that one wrong’, even though his bottom line at the time was winning a Test match.” Ex-players, pundits and even Prime Minister Rishi Sunak weighed in on the debate, while anger in the crowd at the manner of Bairstow’s exit spilled over in the usually restrained Long Room at Lord’s, where Australian players Usman Khawaja and David Warner were involved in heated exchanges with jeering members – three of whom were later suspended by Marylebone Cricket Club. Broad, too, admits the moment got the better of him as he joined captain Ben Stokes, watching from the other end as the skipper hit a remarkable 155 in a forlorn effort to level the series. “The red mist came over me, too, when I arrived at the crease to replace Jonny, and some of what I said was picked up on the stump mics — which naively, given my experience, I didn’t really think about. I just said to Pat on repeat ‘All these boos are for you, for your decision’. And ‘What a great opportunity you had to think clearly’,” he added. “Also, I needed to support Ben Stokes in any way, shape or form I could, and I am always better when I’m in a bit of a battle. I normally try and pick a fight with someone on the opposition but on this occasion I picked a fight with the whole team. “To Alex Carey, I said ‘This is what you’ll be remembered for, and that’s such a shame’. It may have been a bit silly, but I also shouted ‘in’ every time I crossed the line. It annoyed the Australians for maybe half-an-hour, although after two-and-a-half hours, they were probably a bit bored of it.”","pubDate":"2023-07-03 22:53:16","image_url":"https://www.watfordobserver.co.uk/resources/images/16958763/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"It’s just cricket: Why the Bairstow furore has me absolutely stumped","link":"https://www.theage.com.au/sport/cricket/it-s-just-cricket-why-the-bairstow-furore-has-me-absolutely-stumped-20230703-p5dlhd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Mark Taylor"],"video_url":null,"description":"People want to invoke the spirit of cricket, but I’ve seen throws at the stumps to catch an unsuspecting batsman out for as long as I’ve known the game.","content":"I’ve got no issue at all with what Pat Cummins and the Australian team did during the last day of the Lord’s Test when they stumped Jonny Bairstow. It’s a legitimate form of dismissal and has been as long as I’ve known the game of cricket. I’ve seen many wicketkeepers throwing the ball towards the stumps to try and claim an unsuspecting batsman’s wicket. I can remember Rod Marsh throwing the ball towards the stumps off Dennis Lillee’s bowling, Ian Healy did the same thing when a batsman was out of his crease, we’ve seen Jonny Bairstow do it in the latest Test, I’ve seen footage of England coach Brendon McCullum doing it back in 2009. This sort of stuff has been going on for a long time. People want to invoke the spirit of cricket, but I really don’t see it as that sort of issue. Batsmen are now batting out of their crease and wandering out of their crease trying to put bowlers off their length, which is fair enough. But the batsmen have to remember there are 10 ways to get out in Test cricket. One of them is by being stumped, and it doesn’t say in the laws it has to be off a slow bowler. If you’re going to wander out of your crease doing whatever you want to do, be mindful that you can be stumped. So, your job as a batsman is to get back in your crease until the ball is dead. And that’s according to the umpires and the fielding side, not just because you think it might be dead. Bairstow was caught wandering out of his crease when the ball wasn’t dead. Alex Carey was quite entitled to throw the ball at the stumps and Cummins and the Australians were quite entitled to appeal. As far as I’m concerned, that’s the end of the story. Australia celebrate the contentious dismissal of Jonny Bairstow on day five of the second Test at Lord’s. Credit: Reuters I’m disappointed with the way the Australian players were treated after completing this entirely legitimate dismissal, particularly in the Long Room . I will congratulate Guy Lavender, CEO of the MCC, for getting onto it reasonably quickly, calming down the MCC members and suspending three of them. However, I think that’s the minimum amount they need to do at this stage. All in all, the behaviour of the members towards the Australian players was poor to say the least, and inappropriate for anyone, particularly the members. I love the fact that they have that access to get so close to the players. Walking through the Long Room is something I recall as a player. It’s unique to the game of cricket. In my day they didn’t have ropes separating players and members. Back in the 1980s and 90s you just made your way out through the Long Room and excused yourself around members who were sometimes smoking cigars and pipes. If that tradition, which I really enjoy, is going to continue, this type of poor behaviour needs to be stamped out. If not, it would mean the access will have to be changed, and that will not be great for the game of Test cricket. The game would be poorer if the bad behaviour of some members was to bring an end to the tradition of players walking through the Long Room. Credit: Nine England captain Ben Stokes has hedged his bets a little. Obviously, he’s got to go in and bat for his teammate Bairstow, who would be embarrassed by his dismissal during a tight last day in front of a Lord’s crowd. That was an embarrassing dismissal because he’s the one at fault. He’s the one who’s created the opportunity for Australia to stump him. There’s been a lot said and written from all sides about what is really a straightforward dismissal and some of it hasn’t been particularly helpful. I hope both sides will take stock, have a breather and work out that it was, in fact, just a dismissal. It was an unusual one, yes, but it is part of the game. I hope that when the third Test starts on Thursday we see the same tough contest we saw during the first two Tests in what I think has been an enthralling, high intensity series played in great spirit. I hope people look back on this Test they will remember a great game, not a crucial final-day stumping because that’s all it was. Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-07-03 22:40:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"STUART BROAD: It amazes me that NOT ONE Aussie thought the appeal was wrong","link":"https://www.dailymail.co.uk/sport/cricket/article-12260263/STUART-BROAD-amazes-NOT-ONE-Aussie-thought-appeal-wrong.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"STUART BROAD: We saw it with Mitchell Starc's catch on Saturday evening: all of Australia thought it was out, all of England, me included, thought it was not out.","content":"It amazes me that NOT ONE Aussie thought the appeal was wrong… Pat Cummins will regret his mistake: STUART BROAD takes us into the middle of a controversial day at Lord's Jonny Bairstow was controversially stumped by Alex Carey at Lord's on Sunday The incident sparked controversy over whether it was in the spirit of cricket Australia subsequently went on to win and extend their lead in the Ashes to 2-0 By Stuart Broad For The Daily Mail Published: 22:00 BST, 3 July 2023 | Updated: 23:37 BST, 3 July 2023 e-mail 22 shares 11 View comments The amazing thing about sport, and this seems to apply to cricket more than most, is how it divides opinion . We saw it with Mitchell Starc’s catch on Saturday evening: all of Australia thought it was out, all of England, me included, thought it was not out . But the crux of the matter for Jonny Bairstow ’s dismissal at Lord’s on Sunday was whether he was looking to gain an advantage . Yes, I have seen a clip from earlier in the match when in his guise as wicketkeeper, Jonny himself threw the ball at the stumps. But that was because Marnus Labuschagne was batting outside of his crease — in doing so, attempting to take the lbw out of the game. In other words, seeking an advantage. Clips of Colin de Grandhomme being run out in the Lord’s Test last year have done the rounds, too, and that is just the most ludicrous comparison ever, because he got hit on the pad coming down the pitch, was searching for a run and Ollie Pope threw down the stumps from gully. Again, trying to gain an advantage . Jonny Bairstow (right) was controversially run out by Alex Carey at Lord's on Friday, with Australia going on to win the match and go 2-0 up in the Ashes Pat Cummins (left) chose not to rescind his side's appeal after Bairstow's controversial wicket Controversy has subsequently shrouded the Test match with many claiming the dismissal was not in the spirit of the game England's Stuart Broad has opened up on a combustible and controversial day at Lord’s With regards to the Jonny incident, zero advantage was being taken there: he let the ball go, scratched his mark within the crease, and acknowledging it as the end of the over, went to speak to Ben Stokes. And if you look at the footage of when the stumps were broken, one umpire has got the bowler’s cap in his hand, the other is head down, walking in from square leg — actions that suggest they too thought the over had finished. So, within the laws of the game, is the ball still live because Alex Carey catches it and throws it? Probably. Is there any advantage being taken by England? No. Does a full stadium of people think that ball has been and gone? Yes. On BBC radio commentary, Jonathan Agnew has already moved on from the calling of the ball. What amazed me, and what I told the Australians I could not believe as we left the field at lunch, was that not one senior player among them — and I very much understand in the emotion of the game that the bowler and wicketkeeper would have thought ‘that’s out’ — questioned what they had done. Especially given what their team has been through over recent years, with all their cultural change. Not one of them said: ‘Hang on, lads. I’m not really sure about this.’ Not one of them thought: ‘He’s gaining no advantage. He’s not trying to get a run. It’s the end of the over. It’s a bit of a random dismissal. We should cancel that appeal.’ Ultimately, Pat Cummins is a really great guy and I would be amazed, once the emotion settles, if he does not sit back and think, ‘I got that one wrong’, even though his bottom line at the time was winning a Test match. The Lord’s crowd are obviously huge cricket lovers and never before have I seen a reaction from them like that. They were so angry. Bairstow seemingly stepped out of his crease following the over to talk to Ben Stokes at the non-strikers end. He had also scratched the crease before crossing the line Alex Carey (pictured) saw Bairstow leaving and threw the ball at the stumps, dismissing him At the time England were mounting a run chase, but Australia would go on to win by 43 runs Following the controversy, Sir Geoffrey Boycott told Cummins (pictured) and Australia that they must apologise to England Broad (right) arrived in Bairstow's wake and proceeded to wind-up the Australians by sarcastically letting them know he was in his crease on several occasions At the end of that first session, the change from the roar the Long Room gave to Ben Stokes to the boos they reserved for the Australians walking in was stark . They knew way before that point how controversial a decision they had made. I am not saying that the MCC members shouting at players was right but having toured Australia four times, I certainly do not think hostile behaviour towards away teams is unusual. The red mist came over me, too, when I arrived at the crease to replace Jonny, and some of what I said was picked up on the stump mics — which naively, given my experience, I didn’t really think about. I was angered by Australia’s decision, particularly having heard their lines about creating a new legacy as a team, and how they have changed since the tour of South Africa in 2018. I just said to Pat on repeat: ‘All these boos are for you, for your decision.’ And: ‘What a great opportunity you had to think clearly.’ Also, I needed to support Ben Stokes in any way, shape or form I could, and I am always better when I’m in a bit of a battle. I normally try and pick a fight with someone on the opposition but on this occasion I picked a fight with the whole team. To Alex Carey, I said: ‘This is what you’ll be remembered for, and that’s such a shame.’ It may have been a bit silly, but I also shouted ‘in’ every time I crossed the line. It annoyed the Australians for maybe half-an-hour, although after two-and-a-half hours, they were probably a bit bored of it. To be honest, it was a pleasure to be out there with Stokesy when he was in one of those moods. We were both in our zones. He wanted me to react to him. So if he was going to run, go with him, if he wasn’t, don’t move. In those situations, he chooses what balls he wants to face and what he wants to do, and the cleanliness of his striking towards the leg side, both hitting sixes over the fielders and placing fours between them, is extraordinary. There was only really one way you could hit out as a left-hander on that slow pitch — with the wind, towards Father Time. I actually felt for Mitchell Starc and Josh Hazlewood having to bowl from the Nursery End because Stokesy was cleverly targeting deliveries from there and just sort of surviving at the other end. That brilliant 155 gave us a fighting chance and when you finish a Test match, and lose by 43 runs, you look at everything and think: where could we have got those 43 from? To be four down for 45 early and get so close to a target of 371 was very impressive, especially losing Jonny in that manner. To repeat, it was not the act that annoyed me, it was the fact they upheld the appeal. Headingley is not the quietest place at the best of times but this week we will have to use the atmosphere to our advantage. Tempers flared inside the Long Room at Lord's as members heckled the Australian players heading for the dressing room Stokes mounted a late run chase for England but despite scoring an admirable 155, helping to cut the deficit, his side fell short of the mark Stokes and Cummins were seen sharing a word after play had concluded on Day Five at Lord's Yes, we are 2-0 down after two pretty theatrical Test matches that have lived up to what Ashes cricket is about but when I look at our changing room, most of us have got a bit more ‘performance’ in us, and we will bring that to Leeds. I said at the start of the summer that I would be happy playing one Test but my job now is to rest, recuperate and get myself available for Thursday. Selection is not my call, but although I have bowled more balls than anyone else in the series I will be ready for another five days. And I believe that whoever we put out on the field, we will do the business . Three matches left, we will now be faced with three result pitches. This series has turned into a shootout and we are very confident we can still do this. Share or comment on this article: STUART BROAD: It amazes me that NOT ONE Aussie thought the appeal was wrong e-mail 22 shares Add comment Comments 11 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 22:37:22","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/20/72806479-0-image-a-12_1688412522699.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PAUL NEWMAN: Pat Cummins' decision to not rescind dismissal put Aussie cricket back in the gutter","link":"https://www.dailymail.co.uk/sport/cricket/article-12260515/PAUL-NEWMAN-Pat-Cummins-decision-not-rescind-dismissal-Aussie-cricket-gutter.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"If anyone could see the wider picture among an experienced Australian team who should have known better and withdrawn Australia's appeal against Bairstow at a key stage of the Test.","content":"PAUL NEWMAN: Captain conscience's cock-up dumps Aussie cricket back in the GUTTER… all the good work put in by Pat Cummins since he succeeded his disgraced predecessors lies in ruins Australia defeated England at Lord's in controversial circumstances on Sunday Jonny Bairstow was stumped by Alex Carey after he thought the ball went dead It has divided opinions with some even demanding an apology from Australia By Paul Newman for the Daily Mail Published: 22:30, 3 July 2023 | Updated: 23:14, 3 July 2023 e-mail 12 View comments The biggest shame of the whole affair is that it was Pat Cummins who refused the chance to do the right thing when Jonny Bairstow was dismissed to send Lord's into a frenzy . If anyone could see the wider picture among an experienced Australian team who should have known better and withdrawn Australia 's appeal against Bairstow at a key stage of the second Test , then it would surely have been their captain. Cummins was, at least before the extraordinary scenes on Sunday, regarded as one of the nicest guys in cricket, a captain with a conscience and exactly the right man to restore Australia's tarnished image after the ravages of Sandpapergate . Now all the good work put in by Cummins since he succeeded the disgraced Tim Paine, who succeeded the disgraced Steve Smith, lies in ruins. Australia's 43-run victory to take a 2-0 lead in the Ashes will forever be tainted. It's not as if the 'crime' is anything like as bad as the ball-tampering scandal in Cape Town five years ago that engulfed Australian cricket and led to long bans for Smith and David Warner and the departure of Darren Lehmann as coach. Pat Cummins' Australia have now gone 2-0 in the Ashes series, after Sunday's win at Lord's Ben Stokes' (left) England side were left in uproar on Sunday afternoon, after Jonny Bairstow was controversially dismissed by Australia, who have since been heavily criticised for it Bairstow (right) was stumped by Alex Carey after he left his crease thinking the ball was dead Nor were the actions of Alex 'Pariah' Carey in running out Bairstow — there is no way it should have been considered a stumping — when every indication was that the over was complete and the ball was dead as bad as the resurgence of 'Mankading .' It is just the opportunity that was wasted. The chance for Cummins to prove that Australian cricket really has climbed out of the gutter it found itself in when the behaviour of a truly toxic Australian team reached its nadir in South Africa. There was plenty of time for Cummins to realise the implications of what he was doing when inexperienced umpire Ahsan Raza, wrongly, immediately sent the decision to the TV official rather than taking the sting out of the incident himself . Raza and his fellow standing umpire Chris Gaffaney should have gone to Cummins and England captain Ben Stokes . He could have told them they had begun to move into position for the next over and asked Cummins if he really wanted to go ahead with Carey's appeal. When they did not Cummins should have gone to his many senior players for advice before making a call that will haunt him and Carey for the rest of their careers, however much they believe they were acting within the letter of cricket's laws . The one thing that is clear is Bairstow was not trying to take a run nor seeking any advantage. So to dismiss him in the manner Australia did was underhand. Steve Smith broke down in tears back in 2018 during his live apology after 'Sandpaper-Gate' Cameron Bancroft (pictured) was caught rubbing sandpaper on a cricket ball during a test match against South Africa back in 2018 Remember, India captain MS Dhoni called Ian Bell back when he did something similar at Trent Bridge in 2011 and there was a much stronger case to say that Bell had been dozier than Bairstow. Have Smith and Warner not learned anything from the scandal that will forever stain their own records? Smith tries to still captain Australia in the field anyway. Why could he not show true leadership when the official captain of Australia needed him most? What was Cummins scared of? England still needed 178 runs at that stage for the most unlikely of series-levelling victories. Did Australia lack the belief that they could take the remaining five England wickets on a fifth day pitch without skulduggery? Cummins's monosyllabic response to questioning afterwards and a refusal to explain his actions and acknowledge the extent of feeling among a febrile full house at the home of cricket suggests that deep down he knew he had made a huge mistake. Maybe he will fully realise it by the time the teams get back to business on Thursday in Leeds but there has been no suggestion of any about-turn yet, certainly no sign of the public apology that Geoffrey Boycott called for from Australia on Monday. Instead Australians who, remember, somehow get themselves in a pickle when an England batsman fails to walk after nicking a ball or an England bowler gives one of their batsman a mild send-off, cricketing practices they invented, prefer to get indignant about the behaviour of some MCC members in the Lord's Long Room . That in itself should have made Cummins and company realise they were wrong. If members in the hallowed Long Room, one of the most traditional and mild-mannered places in cricket, should become hostile then surely Australia had to look at themselves. Carey (left) who thought on his feet, ran to celebrate with his team-mates after the dismissal Much controversy has shrouded Saturday's test, but there were unsavoury scenes in the Long Room at Lord's as MCC members heckled Australia's team as they left the pitch Stokes (left) and England head coach Brendon McCullum (right) have both spoken out on the incident, with Stokes insisting that 'it was not how he would want to win a Test match' And was what those members did really so bad? Yes they shouted angrily at the Australians but it appears certain there was no offensive language used and none of the physical contact Cricket Australia intimated when they made their complaint to MCC. This was no Gabba. No Bay 13 at Melbourne. Hostility to opposing teams, like non-walking and sledging, is an Australian speciality so it is amusing they are so offended by it when the shoe is on the other foot. Again, we have seen a lot worse than what Carey did. But Cummins had the chance to provide the game with one of its great sporting moments while only running a small risk of damaging his side's chances of winning. That the Australian captain didn't take it is a crying shame for the game and his own reputation. Share or comment on this article: PAUL NEWMAN: Pat Cummins' decision to not rescind dismissal put Aussie cricket back in the gutter e-mail Add comment Comments 13 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 22:14:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/22/72810055-0-image-a-51_1688419708496.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | UK's PM accuses Australian cricketers over Bairstow dismissal","link":"https://www.news24.com/sport/Cricket/uks-pm-accuses-australian-cricketers-over-bairstow-dismissal-20230703","keywords":null,"creator":null,"video_url":null,"description":"British Prime Minister Rishi Sunak on Monday aimed a verbal bouncer at Australia's cricketers after the Lord's Ashes match -- but ruled out turning it into a Bodyline-style diplomatic incident.","content":"British Prime Minister Rishi Sunak on Monday aimed a verbal bouncer at Australia's cricketers after the Lord's Ashes match -- but ruled out turning it into a Bodyline-style diplomatic incident. Jonny Bairstow's controversial dismissal was not in keeping with the spirit of the game, Sunak's spokesperson told reporters. \"The prime minister agrees with (England captain) Ben Stokes who said he simply wouldn't want to win a game in the manner that Australia did,\" the spokesman said. But Sunak, a keen cricket fan who watched with Prince William from the Lord's pavilion on Saturday, also deplored the Long Room abuse directed at the Australians by Marylebone Cricket Club members. \"He thinks it was right that the MCC have taken swift action to suspend any members accused of poor behaviour,\" the spokesman said. Sunak believed that the standing ovation given by MCC members to Australia's hobbling spinner Nathan Lyon, as he came out to bat on Saturday, was \"much more in keeping with the spirit of the game\". But Sunak has no intention of lodging an official protest with Australian Prime Minister Anthony Albanese, to reprise the serious diplomatic strains created by England's \"Bodyline\" tactics in the 1932-33 Ashes Down Under. While there is a \"friendly rivalry\" over sport between the two leaders, Sunak does not view cricket as a core diplomatic issue, the spokesman remarked. \"The game did provide an opportunity to see Ben Stokes at his best and it was an incredible Test match -- he has confidence that England will bounce back at Headingley,\" he added, after Stokes hit a blazing 155.","pubDate":"2023-07-03 21:40:21","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Silverstone to warn off Just Stop Oil group as they deploy 12,000 'spies' at British Grand Prix","link":"https://www.dailymail.co.uk/sport/formulaone/article-12260327/Silverstone-warn-Just-Stop-Oil-group-deploy-12-000-spies-British-Grand-Prix.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The circuit's managing director Stuart Pringle has warned campaigners they are risking their lives if they trespass on to the 3.66-mile track, as they did last year.","content":"Silverstone plan to halt Just Stop Oil group as they deploy 12,000 'spies' at this weekend's British Grand Prix to stop protestors from sabotaging race Campaigners have been warned they will be risking their lives by protesting Silverstone chiefs have spies in place to thwart any Just Oil protests on the track Meanwhile, the British GP is set to remain at Silverstone for most of the decade By Jonathan McEvoy for the Daily Mail Published: 17:30 EDT, 3 July 2023 | Updated: 17:30 EDT, 3 July 2023 e-mail 1 View comments Silverstone will deploy 12,000 'spies' in an attempt to protect this weekend's British Grand Prix from Just Stop Oil saboteurs. The circuit's managing director Stuart Pringle has warned campaigners they are risking their lives if they trespass on to the 3.66-mile track, as they did last year. He told Mail Sport: 'It's one thing protesting at a flower show or cricket match, but quite another when cars are travelling at 200mph. My message is clear, 'Don't risk your life'. Silverstone are putting plans in place to prevent Just Stop Oil from sabotaging the Grand Prix 'There are 12,000 working personnel in all, and they will be briefed to be super vigilant. I urge fans, as well as staff, to act as our eyes and ears.' Meanwhile, the British Grand Prix looks set to remain at Silverstone for most of, if not all, the decade. F1 boss Stefano Domenicali and the circuit's owners, the British Racing Drivers' Club, are both committed to agreeing an extension. Share or comment on this article: Silverstone to warn off Just Stop Oil group as they deploy 12,000 'spies' at British Grand Prix e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 21:30:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/20/72807339-0-image-a-3_1688414282759.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MaChevrons anotofanirwa kukunda Scotland","link":"https://www.kwayedza.co.zw/machevrons-anotofanirwa-kukunda-scotland/","keywords":["NHAU DZEMITAMBO"],"creator":["abelndooka"],"video_url":null,"description":"Abel Ndooka CHIKWATA chenyika checricket chemaChevrons chiri kusangana necheScotland mangwana kuQueens Sports Club, kuBulawayo, mumutambo uyo chinofanirwa kuhwina kuti chiwane tikiti rekuenda kuICC Men’s Cricket World Cup iyo ichatambirwa kuIndia. Musi weSvondo wadarika maChevrons akakundwa neSri Lanka nemawickets mapfumbamwe mumutambo weSuper Six uyo wakabva waona Sri Lanka ichienda pamusoro pemaChevrons palog reSuper Six. Kukundwa kwakaita […]","content":"Kwayedza CHIKWATA chenyika checricket chemaChevrons chiri kusangana necheScotland mangwana kuQueens Sports Club, kuBulawayo, mumutambo uyo chinofanirwa kuhwina kuti chiwane tikiti rekuenda kuICC Men’s Cricket World Cup iyo ichatambirwa kuIndia. Musi weSvondo wadarika maChevrons akakundwa neSri Lanka nemawickets mapfumbamwe mumutambo weSuper Six uyo wakabva waona Sri Lanka ichienda pamusoro pemaChevrons palog reSuper Six. Kukundwa kwakaita chikwata chaDave Houghton neSri Lanka kunoreva kuti maChevrons anotofanirwa kuhwina mutambo wavo wekupedzisira wemuSuper Six neScotland uye kana vakahwina mutambo uyu, vanobva ahwina tikiti rekuenda kuIndia uye vopinda mufainari yekurwira mukombe weICC Men’s Cricket World Cup Qualifiers uyo uri kutambirwa muno. Fainari yeICC Men’s Cricket World Cup Qualifiers ichatambwa nezvikwata zviviri zvichapedza zviri pamusoro pezvimwe zvese palog reSuper Six musi weSvondo.","pubDate":"2023-07-03 21:00:12","image_url":null,"source_id":"kwayedza","category":["sports"],"country":["Zimbabwe"],"language":"shona"},{"title":"‘More than a sport’: Sault cricket winning on and off the field","link":"https://www.sootoday.com/local-news/more-than-a-sport-sault-cricket-winning-on-and-off-the-field-7229545","keywords":null,"creator":["Alex Flood"],"video_url":null,"description":"‘Cricket in the north is growing strong,’ says chair of the Sault Ste. Marie Cricket Club, who witnessed his team go undefeated at the Thunder Bay Provincial Cup to earn the championship trophy on Sunday","content":"Since he moved from Pakistan to Sault Ste. Marie in 2016, Haroon Naseer has witnessed his favourite sport take off on Canadian soil. “Cricket in the north is growing strong,” he says. Celebrating their 10th anniversary season this summer, the Sault Ste. Marie Cricket Club has grown to 60 active members and expanded from one team to several since its inception. Since 2013, the club chair explains that the internationally popular bat-and-ball sport has provided newcomers with the familiar atmosphere of home. “Cricket is more than just a sport,” Naseer says. “It’s what keeps me connected and what made me want to stay in Sault Ste. Marie, and that’s the case for a lot of our players.” “They come here as new immigrants, and the sport connects that community of people from all over like India, Pakistan, Nepal, and Sri Lanka. All those countries play cricket – it’s huge back home for them, so when they come here, it’s something for us to do together.” Carrying out practices and playing their matches at the Queen Elizabeth field each summer, the local club recently gathered its best players and spent the Canada Day weekend in Thunder Bay for a chance to hoist the Provincial Cup. The Sault Stormers went undefeated and topped teams from Sudbury, Thunder Bay, and Winnipeg to earn the trophy on Sunday. They even received special congratulations from Thunder Bay Mayor Ken Boshcoff and MP Marcus Powlowski following their victory, and Sault Mayor Matthew Shoemaker and MP Terry Sheehan congratulated the team on social media as well. “I think our team combination is really good,” Naseer says. “We have a lot of young guns who come out and practice a lot. When I moved here, it was hard to make a cricket team. But now, so many people are joining. Their skillset is amazing.” Naseer is hoping his team can carry that momentum back home when the Sault hosts the Northern Ontario Cricket League on July 22-23. The tournament will invite clubs and their families from Sudbury, Timmins, North Bay, and Thunder Bay. “We want to promote tourism in Sault Ste. Marie,” Naseer says. “For northern communities here in Canada, it’s a great way to keep new immigrants in town as it’s growing so fast.” Naseer admits that the fees to run the cricket club each year can be expensive, and he’d like to see local businesses and organizations get interested in the sport and provide sponsorship opportunities for their team and the events they host. “Our club is mainly funded by our players, so we’re looking for community sponsors at our events,” he says. “Our summer league costs around $10,000 to run, and it’s very hard to come up with every year. But even with the little resources we have, we’re doing our best to make our name and our presence in the north.” It’s good from a tourism aspect as well, he said. \"We try to promote our city and invite these cities so they can not only play cricket and get involved but get the tourism part of it as well and show off how great the Sault is.” The Sault Ste. Marie Cricket Club chair encourages anyone who may be interested in signing up or learning more about the sport to visit their website for information. “It’s for everybody,” Naseer says. “We’re going to launch our student camps soon. With the help of sponsorship from the Kiwanis Club of Lakeshore, we’re buying equipment for young kids and will hopefully introduce the sport in schools so they can develop that interest early on.”","pubDate":"2023-07-03 20:59:04","image_url":"https://www.vmcdn.ca/f/files/sootoday/images/07-03-2023-morethanasportsaultcricketwinningonandoffthefield-af-01.jpg;w=960","source_id":"sootoday","category":["sports"],"country":["canada"],"language":"english"},{"title":"Djokovic, Swiatek shine in the rain as Wimbledon gets rolling","link":"https://www.rappler.com/sports/tennis-results-novak-djokovic-iga-swiatek-wimbledon-july-3-2023/","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Novak Djokovic picks up a dominant win to open his bid for a record-extending 24th Grand Slam, while Iga Swiatek kicks off her quest for a maiden Wimbledon title in style","content":"LONDON, UK – Defending men’s champion Novak Djokovic and women’s top seed Iga Swiatek started their Wimbledon campaigns with routine victories on Monday, July 3, as rain temporarily halted play on the outside courts and the threat of climate protests lingered in the air. Djokovic, 36, has only lost twice at Wimbledon in a decade and began the Centre Court program with a 6-3, 6-3, 7-6 (4) win over Argentine Pedro Cachin after a 70-minute delay despite the roof being closed as ground staff labored to get the turf dry. The Serbian jokingly wiped the turf with a towel during the break in play to draw cheers from the crowd before ground staff deployed leaf blowers to get the job done and allow Djokovic to finally close out the victory. Swiatek continued her quest to solve the grass court puzzle that has frustrated her by powering past China’s Zhu Lin 6-1, 6-3 with the contest finishing under the Court One roof due to rain. World No. 1 Swiatek, who last month claimed her third French Open crown and is eyeing a fifth Grand Slam title, meets Spain’s Sara Sorribes Tormo next. Fourth seed Jessica Pegula also advanced to the second round but was made to work hard for a 6-2, 6-7 (8), 6-3 victory by fellow American Lauren Davis, while twice Grand Slam champion Victoria Azarenka beat China’s Yuan Yue, 6-4, 5-7, 6-4. Familiar face Earlier, the All England Club gates swung open for the start of the grass court major with some notable absentees but one very familiar face in Djokovic fixing his eyes on more records. Wimbledon’s favorite son Roger Federer, now retired, the injured Rafa Nadal, and Serena Williams, also retired, are hard acts to follow and fans will lament their absence. Australian maverick Nick Kyrgios, who pushed Djokovic hard in last year’s men’s final and can be relied upon for antics that make the front and back pages, is also missing having pulled out with a wrist injury on the eve of the slam. But Wimbledon remains rich in plots, not least Djokovic’s quest to win a men’s record-extending 24th Grand Slam title, match Federer’s eight Wimbledon crowns, and equal the Swiss and Bjorn Borg’s record of five successive titles. Excited crowds There was the usual buzz of anticipation around the grounds as queues began building ahead of the start time on the outside courts while many fans were forced to wait longer than usual to enter. Organizers said on Twitter the grounds are expected to be at capacity, adding that fans intending to queue should not travel to the All England Club. Sun cream was not in demand, though, with cloudy skies and a cool blustery wind ushering in the first day of 14. Rain is expected throughout the opening days, although that will not affect those with tickets for Centre Court and Court One, both of which boast retractable roofs. Security was on high alert for any sign of protests after several high-profile sporting events in Britain this year were disrupted, including last week’s Ashes cricket test at Lord’s, where climate change protestors ran onto the field and attempted to spread orange powder on the turf. Political slogans of any sort have been banned around the grounds with Wimbledon organizers determined the focus should remain firmly on the tennis. Monday also marked the return of players from Russia and Belarus after they were excluded from Wimbledon last year following Moscow’s invasion of its neighbor Ukraine. Russia, which used Belarus as a staging post, calls its actions in Ukraine a “special military operation.” Russian players have to sign a “nationality waiver” pledging they do not support President Vladimir Putin’s regime. All 17 players from the two countries, including men’s third seed Daniil Medvedev, are competing as neutrals. Medvedev’s compatriot and seventh seed Andrey Rublev moved into the second round with a 6-3, 7-5, 6-4 win over Australia’s Max Purcell, while fellow Russian Veronika Kudermetova beat Estonia’s Kaia Kanepi, 7-6 (4), 6-4. – Rappler.com","pubDate":"2023-07-03 20:39:26","image_url":null,"source_id":"rappler","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Lord's cricket row EXPLAINED: England and Australia lock horns following controversial dismissal","link":"https://www.dailymail.co.uk/sport/cricket/article-12260743/Lords-cricket-row-EXPLAINED-England-Australia-lock-horns-following-controversial-dismissal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Jonny Bairstow's controversial dismissal has lit the touch paper for much debate around the cricket community. Many have suggested that it wasn't 'in the spirit of the game'.","content":"Lord's cricket row EXPLAINED: England and Australia lock horns following Jonny Bairstow's controversial dismissal at Lord's Australia took a 2-0 lead in the Ashes on Sunday in controversial circumstances Jonny Bairstow was dismissed after he was stumped by wicketkeeper Alex Carey The England batsman thought the ball had gone dead but was instead given out By Ed Carruthers For Mailonline Published: 00:19 BST, 4 July 2023 | Updated: 00:36 BST, 4 July 2023 e-mail View comments Whatever side of the fence you sit on, it's safe to say that it's been an explosive 24 hours following England's defeat by Australia at Lord's in the second Ashes Test. Jonny Bairstow 's controversial dismissal has lit the touch paper for much debate around the cricket community. Many have weighed in on the argument, with some claiming Australia's dismissal was 'just not cricket' while others, including Stuart Broad , who wrote today for Mail Sport, saying he was 'amazed' that not one Australian stood up to say Bairstow's dismissal was wrong. In any event, the decision stood and Ben Stokes ' side succumbed to a 43-run loss and are now 2-0 down in the Ashes series. They must-win in the third Test which starts on Thursday at Headingley in Leeds if they have any hope of winning the urn back off Australia this summer. But perhaps the events of Sunday afternoon might provide Brendon McCullum's side with the fire they may have been lacking to turn things around. But what actually happened to spark such a furious reaction among the England Cricket camp and their fans, that has also seen a war of words arise between both British and Australian media agencies. Mail Sport takes a deep dive into the controversial dismissal, the Series as it stands and all the reaction from the second test at Lord's. So what actually happened? England came into the final day of the Lord's test needing 257 to win with six wickets remaining. Two of those wickets included Stokes and Bairstow. Saturday had a few extraordinary moments of its own, with Mitchell Starc appearing to take a tumbling catch that would have dismissed Ben Duckett, had he not placed the ball on the ground with an open palm to cushion his landing. Still, Australia attacked England and dismissed Duckett, with their wicketkeeper-batmsan Bairstow arriving to partner up with his captain. He would face just 22 balls, scoring 10 runs, before he was shockingly dismissed by Alex Carey. Opting to leave a bouncing ball launched at him by Cameron Green from down the wicket, Bairstow scratched his crease with his foot, assuming that the ball was dead and walked seamlessly out into the middle of the wicket. He was largely oblivious to what was going on behind him, with Australia's wicketkeeper, Carey, realising that Bairstow was about to leave his crease, and in a moment of quick thinking, chucked the ball at the stumps with an under arm throw, catching the Englishman, who had departed his crease, off guard. Was Bairstow out? That is one of the big questions and is perhaps why live sport is so great. This decision will provide debates for years, decades perhaps, to come. Following a review, the umpires decided that Bairstow was in fact out and he was dismissed from the field. While the umpires have already made their decision and there's no way we can change it now, the key point of controversy was whether the ball was still live after Bairstow had left his crease. It was the end of the over and the replays show the 33-year-old walking down the wicket to talk to his partner, seeming to assume that the ball was no longer in play. Many have questioned whether the ball was actually still live, and it seemed that way, with both umpires taking strides forward, while even Bairstow had scratched his crease with his foot to 'regain his ground', as Mail Sport's Ian Ladyman put it, indicating that he thought the ball was now dead. Bairstow had neither, as Mail Sport columnist Stuart Broad said , tried to take an advantage by making a run after he left the ball, meaning that he thought play would not continue. Conversely, both Stokes and McCullum have admitted that it was out , and all things considered, the correct decision does seem to have been given. Ironically, even after the MCC members were so incensed in the Long Room (more on that in a moment) following the session, under the MCC's Laws of Cricket, the ball was perhaps still in play. Rule 20.1.2 states : 'The ball shall be considered to be dead when it is clear to the bowler’s end umpire that the fielding side and both batters at the wicket have ceased to regard it as in play.' Why are England so upset about it? The problem, perhaps for a lot of commentators around England though was not so much that Bairstow was in or out, it was more about the fairness of the game, with Stokes and McCullum both stating that while Australia dismissed Bairstow within the laws, it was perhaps not done in the 'spirit of the game'. The England captain in fact said that Australia had forgotten the values of the sport and should have maybe re-thought their decision to appeal the wicket. 'I am not disputing the fact it is out because it is out,' said Stokes. 'If the shoe was on the other foot, I would have put more pressure on the umpires and asked whether they had called over and had a deep think about the whole spirit of the game and whether I would want to do something like that. 'For Australia, it was the match-winning moment. Would I want to win a game in that manner? The answer is no,' Stokes added. McCullum echoed his comments saying: 'In the end, they made a play, they’ve got to live with that. We would have made a different play, but that’s life.' Should pat cummins have rescinded his appeal? Some have even criticised Pat Cummins claiming that the Australian captain should have rescinded his appeal to get Bairstow out and called him back onto the field to bat again . That would have certainly been a display of sportsmanship, for sure. But Cummins was unapologetic, claiming he thought the dismissal was reasonable. 'I thought it was fair,' the Australian captain said. 'You see Jonny do it all the time. He did it on Day One to Warner. He did it in 2019 to Steve [Smith]. It's a really common thing for keepers to do if they see a batter keep on leaving their crease,' said the Australia captain. 'Caz [Carey] - full credit to him. He saw the opportunity a few balls beforehand and rolled at the stumps. Jonny left his crease and we'll leave the rest to the umpires.' What is the MCC? Things took an unsavoury turn as Australia walked back into the changing rooms following the session. Lord's is one of the most historic sporting venues in the world and is home to the MCC - the Marleybone Cricket Club. It is said to be the home of cricket and houses 18,000 members, who queue outside the ground each morning of the Test match to get access to the stadium. And what is the Long Room? Members convene in what's known as the Long Room, a dining hall built in the pavilion end of the stadium which is surrounded by paintings of players of years gone by. The players of both sides must walk through the long room to get to and from the dressing rooms and it is here where much controversy emerged on Sunday after several MCC members heckled the Australian players heading back into the dressing rooms. They were branded 'cheats' by the members, with some confronting Australia's Usman Khawaja, who seemed to become incensed by some comments that were made towards him by the members . Three members have subsequently been suspended by the club, pending investigations , following the ugly scenes. The explosive reaction In the past 24 hours there has been plenty of reaction both online and from some of the biggest names in cricket, with Sir Geoffrey Boycott, a legend of the sport, calling for Australia to apologise to England . Broad, who came in to replace Bairstow, sarcastically jested with the Australian's following his dismissal, while also told Carey that the stumping was: 'All he'd be remembered for.' He has also had his say, writing in a column for Mail Sport today saying that he was 'stunned' none of the Australians had admitted that the appeal 'was wrong' while also claiming that Cummins will regret not rescinding Australia's appeal . Even the British Prime Minister, Rishi Sunak, who has been spotted at Lords this week, weighed in on the row, slamming Australia for the dismissal . Media outlets down under and in the UK have been having their own war of words, with some Australian outlets hitting out at the uproar from the English. Some outlets down under have dubbed the English as 'hypocrites', 'whingers' and 'miserable poms'. A page of the Western Australian paper was also posted on Twitter earlier on Monday and depicted a photoshopped image of Ben Stokes wearing a nappy while sucking on a dummy. The image showed him reaching for an unblemished looking cricket ball with the caption 'Cry babies' underneath. And Stokes has hit back at the image , tweeting in response: 'That’s definitely not me, since when did I bowl with the new ball.' In any event, Thursday's test match at Headingley is set to have plenty added edge to it, with England coming in to the game looking to rescue the series, while Australia are just one step away from retaining the urn. Share or comment on this article: Lord's cricket row EXPLAINED: England and Australia lock horns following controversial dismissal e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 23:19:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/00/72804581-0-image-a-103_1688426324104.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Stuart Broad thinks Pat Cummins will regret handling of Jonny Bairstow dismissal","link":"https://www.watfordobserver.co.uk/sport/national/23631113.stuart-broad-thinks-pat-cummins-will-regret-handling-jonny-bairstow-dismissal/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Broad replaced Bairstow in the middle following the incident before Australia went on to win the second Ashes Test and take a 2-0 lead.","content":"Alex Carey’s opportunistic stumping of his fellow wicketkeeper during the dramatic conclusion to the second Ashes Test sparked fury from fans and members at the home of cricket and the row has shown no signs of abating. Broad replaced Bairstow in the middle following the incident, before Australia went on to win and take a 2-0 lead. Broad insists “zero advantage” came from Bairstow straying from his crease and, after making his point to the Australian players throughout the duration of his stay, the England seamer feels Cummins will eventually think upholding the appeal was the wrong play. “What amazed me, and what I told the Australians I could not believe as we left the field at lunch, was that not one senior player among them — and I very much understand in the emotion of the game that the bowler and wicketkeeper would have thought ‘that’s out’ — questioned what they had done,” Broad wrote in the Daily Mail. “Especially given what their team has been through over recent years, with all their cultural change. Not one of them said ‘Hang on, lads. I’m not really sure about this’. Not one of them thought ‘He’s gaining no advantage. He’s not trying to get a run. It’s the end of the over. It’s a bit of a random dismissal. We should cancel that appeal’. “Ultimately, Pat Cummins is a really great guy and I would be amazed, once the emotion settles, if he does not sit back and think ‘I got that one wrong’, even though his bottom line at the time was winning a Test match.” Ex-players, pundits and even Prime Minister Rishi Sunak weighed in on the debate, while anger in the crowd at the manner of Bairstow’s exit spilled over in the usually restrained Long Room at Lord’s, where Australian players Usman Khawaja and David Warner were involved in heated exchanges with jeering members – three of whom were later suspended by Marylebone Cricket Club. Broad, too, admits the moment got the better of him as he joined captain Ben Stokes, watching from the other end as the skipper hit a remarkable 155 in a forlorn effort to level the series. “The red mist came over me, too, when I arrived at the crease to replace Jonny, and some of what I said was picked up on the stump mics — which naively, given my experience, I didn’t really think about. I just said to Pat on repeat ‘All these boos are for you, for your decision’. And ‘What a great opportunity you had to think clearly’,” he added. “Also, I needed to support Ben Stokes in any way, shape or form I could, and I am always better when I’m in a bit of a battle. I normally try and pick a fight with someone on the opposition but on this occasion I picked a fight with the whole team. “To Alex Carey, I said ‘This is what you’ll be remembered for, and that’s such a shame’. It may have been a bit silly, but I also shouted ‘in’ every time I crossed the line. It annoyed the Australians for maybe half-an-hour, although after two-and-a-half hours, they were probably a bit bored of it.”","pubDate":"2023-07-03 22:53:16","image_url":"https://www.watfordobserver.co.uk/resources/images/16958763/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"It’s just cricket: Why the Bairstow furore has me absolutely stumped","link":"https://www.theage.com.au/sport/cricket/it-s-just-cricket-why-the-bairstow-furore-has-me-absolutely-stumped-20230703-p5dlhd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Mark Taylor"],"video_url":null,"description":"People want to invoke the spirit of cricket, but I’ve seen throws at the stumps to catch an unsuspecting batsman out for as long as I’ve known the game.","content":"I’ve got no issue at all with what Pat Cummins and the Australian team did during the last day of the Lord’s Test when they stumped Jonny Bairstow. It’s a legitimate form of dismissal and has been as long as I’ve known the game of cricket. I’ve seen many wicketkeepers throwing the ball towards the stumps to try and claim an unsuspecting batsman’s wicket. I can remember Rod Marsh throwing the ball towards the stumps off Dennis Lillee’s bowling, Ian Healy did the same thing when a batsman was out of his crease, we’ve seen Jonny Bairstow do it in the latest Test, I’ve seen footage of England coach Brendon McCullum doing it back in 2009. This sort of stuff has been going on for a long time. People want to invoke the spirit of cricket, but I really don’t see it as that sort of issue. Batsmen are now batting out of their crease and wandering out of their crease trying to put bowlers off their length, which is fair enough. But the batsmen have to remember there are 10 ways to get out in Test cricket. One of them is by being stumped, and it doesn’t say in the laws it has to be off a slow bowler. If you’re going to wander out of your crease doing whatever you want to do, be mindful that you can be stumped. So, your job as a batsman is to get back in your crease until the ball is dead. And that’s according to the umpires and the fielding side, not just because you think it might be dead. Bairstow was caught wandering out of his crease when the ball wasn’t dead. Alex Carey was quite entitled to throw the ball at the stumps and Cummins and the Australians were quite entitled to appeal. As far as I’m concerned, that’s the end of the story. Australia celebrate the contentious dismissal of Jonny Bairstow on day five of the second Test at Lord’s. Credit: Reuters I’m disappointed with the way the Australian players were treated after completing this entirely legitimate dismissal, particularly in the Long Room . I will congratulate Guy Lavender, CEO of the MCC, for getting onto it reasonably quickly, calming down the MCC members and suspending three of them. However, I think that’s the minimum amount they need to do at this stage. All in all, the behaviour of the members towards the Australian players was poor to say the least, and inappropriate for anyone, particularly the members. I love the fact that they have that access to get so close to the players. Walking through the Long Room is something I recall as a player. It’s unique to the game of cricket. In my day they didn’t have ropes separating players and members. Back in the 1980s and 90s you just made your way out through the Long Room and excused yourself around members who were sometimes smoking cigars and pipes. If that tradition, which I really enjoy, is going to continue, this type of poor behaviour needs to be stamped out. If not, it would mean the access will have to be changed, and that will not be great for the game of Test cricket. The game would be poorer if the bad behaviour of some members was to bring an end to the tradition of players walking through the Long Room. Credit: Nine England captain Ben Stokes has hedged his bets a little. Obviously, he’s got to go in and bat for his teammate Bairstow, who would be embarrassed by his dismissal during a tight last day in front of a Lord’s crowd. That was an embarrassing dismissal because he’s the one at fault. He’s the one who’s created the opportunity for Australia to stump him. There’s been a lot said and written from all sides about what is really a straightforward dismissal and some of it hasn’t been particularly helpful. I hope both sides will take stock, have a breather and work out that it was, in fact, just a dismissal. It was an unusual one, yes, but it is part of the game. I hope that when the third Test starts on Thursday we see the same tough contest we saw during the first two Tests in what I think has been an enthralling, high intensity series played in great spirit. I hope people look back on this Test they will remember a great game, not a crucial final-day stumping because that’s all it was. Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-07-03 22:40:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"STUART BROAD: It amazes me that NOT ONE Aussie thought the appeal was wrong","link":"https://www.dailymail.co.uk/sport/cricket/article-12260263/STUART-BROAD-amazes-NOT-ONE-Aussie-thought-appeal-wrong.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"STUART BROAD: We saw it with Mitchell Starc's catch on Saturday evening: all of Australia thought it was out, all of England, me included, thought it was not out.","content":"It amazes me that NOT ONE Aussie thought the appeal was wrong… Pat Cummins will regret his mistake: STUART BROAD takes us into the middle of a controversial day at Lord's Jonny Bairstow was controversially stumped by Alex Carey at Lord's on Sunday The incident sparked controversy over whether it was in the spirit of cricket Australia subsequently went on to win and extend their lead in the Ashes to 2-0 By Stuart Broad For The Daily Mail Published: 22:00 BST, 3 July 2023 | Updated: 23:37 BST, 3 July 2023 e-mail 22 shares 11 View comments The amazing thing about sport, and this seems to apply to cricket more than most, is how it divides opinion . We saw it with Mitchell Starc’s catch on Saturday evening: all of Australia thought it was out, all of England, me included, thought it was not out . But the crux of the matter for Jonny Bairstow ’s dismissal at Lord’s on Sunday was whether he was looking to gain an advantage . Yes, I have seen a clip from earlier in the match when in his guise as wicketkeeper, Jonny himself threw the ball at the stumps. But that was because Marnus Labuschagne was batting outside of his crease — in doing so, attempting to take the lbw out of the game. In other words, seeking an advantage. Clips of Colin de Grandhomme being run out in the Lord’s Test last year have done the rounds, too, and that is just the most ludicrous comparison ever, because he got hit on the pad coming down the pitch, was searching for a run and Ollie Pope threw down the stumps from gully. Again, trying to gain an advantage . Jonny Bairstow (right) was controversially run out by Alex Carey at Lord's on Friday, with Australia going on to win the match and go 2-0 up in the Ashes Pat Cummins (left) chose not to rescind his side's appeal after Bairstow's controversial wicket Controversy has subsequently shrouded the Test match with many claiming the dismissal was not in the spirit of the game England's Stuart Broad has opened up on a combustible and controversial day at Lord’s With regards to the Jonny incident, zero advantage was being taken there: he let the ball go, scratched his mark within the crease, and acknowledging it as the end of the over, went to speak to Ben Stokes. And if you look at the footage of when the stumps were broken, one umpire has got the bowler’s cap in his hand, the other is head down, walking in from square leg — actions that suggest they too thought the over had finished. So, within the laws of the game, is the ball still live because Alex Carey catches it and throws it? Probably. Is there any advantage being taken by England? No. Does a full stadium of people think that ball has been and gone? Yes. On BBC radio commentary, Jonathan Agnew has already moved on from the calling of the ball. What amazed me, and what I told the Australians I could not believe as we left the field at lunch, was that not one senior player among them — and I very much understand in the emotion of the game that the bowler and wicketkeeper would have thought ‘that’s out’ — questioned what they had done. Especially given what their team has been through over recent years, with all their cultural change. Not one of them said: ‘Hang on, lads. I’m not really sure about this.’ Not one of them thought: ‘He’s gaining no advantage. He’s not trying to get a run. It’s the end of the over. It’s a bit of a random dismissal. We should cancel that appeal.’ Ultimately, Pat Cummins is a really great guy and I would be amazed, once the emotion settles, if he does not sit back and think, ‘I got that one wrong’, even though his bottom line at the time was winning a Test match. The Lord’s crowd are obviously huge cricket lovers and never before have I seen a reaction from them like that. They were so angry. Bairstow seemingly stepped out of his crease following the over to talk to Ben Stokes at the non-strikers end. He had also scratched the crease before crossing the line Alex Carey (pictured) saw Bairstow leaving and threw the ball at the stumps, dismissing him At the time England were mounting a run chase, but Australia would go on to win by 43 runs Following the controversy, Sir Geoffrey Boycott told Cummins (pictured) and Australia that they must apologise to England Broad (right) arrived in Bairstow's wake and proceeded to wind-up the Australians by sarcastically letting them know he was in his crease on several occasions At the end of that first session, the change from the roar the Long Room gave to Ben Stokes to the boos they reserved for the Australians walking in was stark . They knew way before that point how controversial a decision they had made. I am not saying that the MCC members shouting at players was right but having toured Australia four times, I certainly do not think hostile behaviour towards away teams is unusual. The red mist came over me, too, when I arrived at the crease to replace Jonny, and some of what I said was picked up on the stump mics — which naively, given my experience, I didn’t really think about. I was angered by Australia’s decision, particularly having heard their lines about creating a new legacy as a team, and how they have changed since the tour of South Africa in 2018. I just said to Pat on repeat: ‘All these boos are for you, for your decision.’ And: ‘What a great opportunity you had to think clearly.’ Also, I needed to support Ben Stokes in any way, shape or form I could, and I am always better when I’m in a bit of a battle. I normally try and pick a fight with someone on the opposition but on this occasion I picked a fight with the whole team. To Alex Carey, I said: ‘This is what you’ll be remembered for, and that’s such a shame.’ It may have been a bit silly, but I also shouted ‘in’ every time I crossed the line. It annoyed the Australians for maybe half-an-hour, although after two-and-a-half hours, they were probably a bit bored of it. To be honest, it was a pleasure to be out there with Stokesy when he was in one of those moods. We were both in our zones. He wanted me to react to him. So if he was going to run, go with him, if he wasn’t, don’t move. In those situations, he chooses what balls he wants to face and what he wants to do, and the cleanliness of his striking towards the leg side, both hitting sixes over the fielders and placing fours between them, is extraordinary. There was only really one way you could hit out as a left-hander on that slow pitch — with the wind, towards Father Time. I actually felt for Mitchell Starc and Josh Hazlewood having to bowl from the Nursery End because Stokesy was cleverly targeting deliveries from there and just sort of surviving at the other end. That brilliant 155 gave us a fighting chance and when you finish a Test match, and lose by 43 runs, you look at everything and think: where could we have got those 43 from? To be four down for 45 early and get so close to a target of 371 was very impressive, especially losing Jonny in that manner. To repeat, it was not the act that annoyed me, it was the fact they upheld the appeal. Headingley is not the quietest place at the best of times but this week we will have to use the atmosphere to our advantage. Tempers flared inside the Long Room at Lord's as members heckled the Australian players heading for the dressing room Stokes mounted a late run chase for England but despite scoring an admirable 155, helping to cut the deficit, his side fell short of the mark Stokes and Cummins were seen sharing a word after play had concluded on Day Five at Lord's Yes, we are 2-0 down after two pretty theatrical Test matches that have lived up to what Ashes cricket is about but when I look at our changing room, most of us have got a bit more ‘performance’ in us, and we will bring that to Leeds. I said at the start of the summer that I would be happy playing one Test but my job now is to rest, recuperate and get myself available for Thursday. Selection is not my call, but although I have bowled more balls than anyone else in the series I will be ready for another five days. And I believe that whoever we put out on the field, we will do the business . Three matches left, we will now be faced with three result pitches. This series has turned into a shootout and we are very confident we can still do this. Share or comment on this article: STUART BROAD: It amazes me that NOT ONE Aussie thought the appeal was wrong e-mail 22 shares Add comment Comments 11 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 22:37:22","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/20/72806479-0-image-a-12_1688412522699.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PAUL NEWMAN: Pat Cummins' decision to not rescind dismissal put Aussie cricket back in the gutter","link":"https://www.dailymail.co.uk/sport/cricket/article-12260515/PAUL-NEWMAN-Pat-Cummins-decision-not-rescind-dismissal-Aussie-cricket-gutter.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"If anyone could see the wider picture among an experienced Australian team who should have known better and withdrawn Australia's appeal against Bairstow at a key stage of the Test.","content":"PAUL NEWMAN: Captain conscience's cock-up dumps Aussie cricket back in the GUTTER… all the good work put in by Pat Cummins since he succeeded his disgraced predecessors lies in ruins Australia defeated England at Lord's in controversial circumstances on Sunday Jonny Bairstow was stumped by Alex Carey after he thought the ball went dead It has divided opinions with some even demanding an apology from Australia By Paul Newman for the Daily Mail Published: 22:30, 3 July 2023 | Updated: 23:14, 3 July 2023 e-mail 12 View comments The biggest shame of the whole affair is that it was Pat Cummins who refused the chance to do the right thing when Jonny Bairstow was dismissed to send Lord's into a frenzy . If anyone could see the wider picture among an experienced Australian team who should have known better and withdrawn Australia 's appeal against Bairstow at a key stage of the second Test , then it would surely have been their captain. Cummins was, at least before the extraordinary scenes on Sunday, regarded as one of the nicest guys in cricket, a captain with a conscience and exactly the right man to restore Australia's tarnished image after the ravages of Sandpapergate . Now all the good work put in by Cummins since he succeeded the disgraced Tim Paine, who succeeded the disgraced Steve Smith, lies in ruins. Australia's 43-run victory to take a 2-0 lead in the Ashes will forever be tainted. It's not as if the 'crime' is anything like as bad as the ball-tampering scandal in Cape Town five years ago that engulfed Australian cricket and led to long bans for Smith and David Warner and the departure of Darren Lehmann as coach. Pat Cummins' Australia have now gone 2-0 in the Ashes series, after Sunday's win at Lord's Ben Stokes' (left) England side were left in uproar on Sunday afternoon, after Jonny Bairstow was controversially dismissed by Australia, who have since been heavily criticised for it Bairstow (right) was stumped by Alex Carey after he left his crease thinking the ball was dead Nor were the actions of Alex 'Pariah' Carey in running out Bairstow — there is no way it should have been considered a stumping — when every indication was that the over was complete and the ball was dead as bad as the resurgence of 'Mankading .' It is just the opportunity that was wasted. The chance for Cummins to prove that Australian cricket really has climbed out of the gutter it found itself in when the behaviour of a truly toxic Australian team reached its nadir in South Africa. There was plenty of time for Cummins to realise the implications of what he was doing when inexperienced umpire Ahsan Raza, wrongly, immediately sent the decision to the TV official rather than taking the sting out of the incident himself . Raza and his fellow standing umpire Chris Gaffaney should have gone to Cummins and England captain Ben Stokes . He could have told them they had begun to move into position for the next over and asked Cummins if he really wanted to go ahead with Carey's appeal. When they did not Cummins should have gone to his many senior players for advice before making a call that will haunt him and Carey for the rest of their careers, however much they believe they were acting within the letter of cricket's laws . The one thing that is clear is Bairstow was not trying to take a run nor seeking any advantage. So to dismiss him in the manner Australia did was underhand. Steve Smith broke down in tears back in 2018 during his live apology after 'Sandpaper-Gate' Cameron Bancroft (pictured) was caught rubbing sandpaper on a cricket ball during a test match against South Africa back in 2018 Remember, India captain MS Dhoni called Ian Bell back when he did something similar at Trent Bridge in 2011 and there was a much stronger case to say that Bell had been dozier than Bairstow. Have Smith and Warner not learned anything from the scandal that will forever stain their own records? Smith tries to still captain Australia in the field anyway. Why could he not show true leadership when the official captain of Australia needed him most? What was Cummins scared of? England still needed 178 runs at that stage for the most unlikely of series-levelling victories. Did Australia lack the belief that they could take the remaining five England wickets on a fifth day pitch without skulduggery? Cummins's monosyllabic response to questioning afterwards and a refusal to explain his actions and acknowledge the extent of feeling among a febrile full house at the home of cricket suggests that deep down he knew he had made a huge mistake. Maybe he will fully realise it by the time the teams get back to business on Thursday in Leeds but there has been no suggestion of any about-turn yet, certainly no sign of the public apology that Geoffrey Boycott called for from Australia on Monday. Instead Australians who, remember, somehow get themselves in a pickle when an England batsman fails to walk after nicking a ball or an England bowler gives one of their batsman a mild send-off, cricketing practices they invented, prefer to get indignant about the behaviour of some MCC members in the Lord's Long Room . That in itself should have made Cummins and company realise they were wrong. If members in the hallowed Long Room, one of the most traditional and mild-mannered places in cricket, should become hostile then surely Australia had to look at themselves. Carey (left) who thought on his feet, ran to celebrate with his team-mates after the dismissal Much controversy has shrouded Saturday's test, but there were unsavoury scenes in the Long Room at Lord's as MCC members heckled Australia's team as they left the pitch Stokes (left) and England head coach Brendon McCullum (right) have both spoken out on the incident, with Stokes insisting that 'it was not how he would want to win a Test match' And was what those members did really so bad? Yes they shouted angrily at the Australians but it appears certain there was no offensive language used and none of the physical contact Cricket Australia intimated when they made their complaint to MCC. This was no Gabba. No Bay 13 at Melbourne. Hostility to opposing teams, like non-walking and sledging, is an Australian speciality so it is amusing they are so offended by it when the shoe is on the other foot. Again, we have seen a lot worse than what Carey did. But Cummins had the chance to provide the game with one of its great sporting moments while only running a small risk of damaging his side's chances of winning. That the Australian captain didn't take it is a crying shame for the game and his own reputation. Share or comment on this article: PAUL NEWMAN: Pat Cummins' decision to not rescind dismissal put Aussie cricket back in the gutter e-mail Add comment Comments 13 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 22:14:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/22/72810055-0-image-a-51_1688419708496.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | UK's PM accuses Australian cricketers over Bairstow dismissal","link":"https://www.news24.com/sport/Cricket/uks-pm-accuses-australian-cricketers-over-bairstow-dismissal-20230703","keywords":null,"creator":null,"video_url":null,"description":"British Prime Minister Rishi Sunak on Monday aimed a verbal bouncer at Australia's cricketers after the Lord's Ashes match -- but ruled out turning it into a Bodyline-style diplomatic incident.","content":"British Prime Minister Rishi Sunak on Monday aimed a verbal bouncer at Australia's cricketers after the Lord's Ashes match -- but ruled out turning it into a Bodyline-style diplomatic incident. Jonny Bairstow's controversial dismissal was not in keeping with the spirit of the game, Sunak's spokesperson told reporters. \"The prime minister agrees with (England captain) Ben Stokes who said he simply wouldn't want to win a game in the manner that Australia did,\" the spokesman said. But Sunak, a keen cricket fan who watched with Prince William from the Lord's pavilion on Saturday, also deplored the Long Room abuse directed at the Australians by Marylebone Cricket Club members. \"He thinks it was right that the MCC have taken swift action to suspend any members accused of poor behaviour,\" the spokesman said. Sunak believed that the standing ovation given by MCC members to Australia's hobbling spinner Nathan Lyon, as he came out to bat on Saturday, was \"much more in keeping with the spirit of the game\". But Sunak has no intention of lodging an official protest with Australian Prime Minister Anthony Albanese, to reprise the serious diplomatic strains created by England's \"Bodyline\" tactics in the 1932-33 Ashes Down Under. While there is a \"friendly rivalry\" over sport between the two leaders, Sunak does not view cricket as a core diplomatic issue, the spokesman remarked. \"The game did provide an opportunity to see Ben Stokes at his best and it was an incredible Test match -- he has confidence that England will bounce back at Headingley,\" he added, after Stokes hit a blazing 155.","pubDate":"2023-07-03 21:40:21","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Silverstone to warn off Just Stop Oil group as they deploy 12,000 'spies' at British Grand Prix","link":"https://www.dailymail.co.uk/sport/formulaone/article-12260327/Silverstone-warn-Just-Stop-Oil-group-deploy-12-000-spies-British-Grand-Prix.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The circuit's managing director Stuart Pringle has warned campaigners they are risking their lives if they trespass on to the 3.66-mile track, as they did last year.","content":"Silverstone plan to halt Just Stop Oil group as they deploy 12,000 'spies' at this weekend's British Grand Prix to stop protestors from sabotaging race Campaigners have been warned they will be risking their lives by protesting Silverstone chiefs have spies in place to thwart any Just Oil protests on the track Meanwhile, the British GP is set to remain at Silverstone for most of the decade By Jonathan McEvoy for the Daily Mail Published: 17:30 EDT, 3 July 2023 | Updated: 17:30 EDT, 3 July 2023 e-mail 1 View comments Silverstone will deploy 12,000 'spies' in an attempt to protect this weekend's British Grand Prix from Just Stop Oil saboteurs. The circuit's managing director Stuart Pringle has warned campaigners they are risking their lives if they trespass on to the 3.66-mile track, as they did last year. He told Mail Sport: 'It's one thing protesting at a flower show or cricket match, but quite another when cars are travelling at 200mph. My message is clear, 'Don't risk your life'. Silverstone are putting plans in place to prevent Just Stop Oil from sabotaging the Grand Prix 'There are 12,000 working personnel in all, and they will be briefed to be super vigilant. I urge fans, as well as staff, to act as our eyes and ears.' Meanwhile, the British Grand Prix looks set to remain at Silverstone for most of, if not all, the decade. F1 boss Stefano Domenicali and the circuit's owners, the British Racing Drivers' Club, are both committed to agreeing an extension. Share or comment on this article: Silverstone to warn off Just Stop Oil group as they deploy 12,000 'spies' at British Grand Prix e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 21:30:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/20/72807339-0-image-a-3_1688414282759.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MaChevrons anotofanirwa kukunda Scotland","link":"https://www.kwayedza.co.zw/machevrons-anotofanirwa-kukunda-scotland/","keywords":["NHAU DZEMITAMBO"],"creator":["abelndooka"],"video_url":null,"description":"Abel Ndooka CHIKWATA chenyika checricket chemaChevrons chiri kusangana necheScotland mangwana kuQueens Sports Club, kuBulawayo, mumutambo uyo chinofanirwa kuhwina kuti chiwane tikiti rekuenda kuICC Men’s Cricket World Cup iyo ichatambirwa kuIndia. Musi weSvondo wadarika maChevrons akakundwa neSri Lanka nemawickets mapfumbamwe mumutambo weSuper Six uyo wakabva waona Sri Lanka ichienda pamusoro pemaChevrons palog reSuper Six. Kukundwa kwakaita […]","content":"Kwayedza CHIKWATA chenyika checricket chemaChevrons chiri kusangana necheScotland mangwana kuQueens Sports Club, kuBulawayo, mumutambo uyo chinofanirwa kuhwina kuti chiwane tikiti rekuenda kuICC Men’s Cricket World Cup iyo ichatambirwa kuIndia. Musi weSvondo wadarika maChevrons akakundwa neSri Lanka nemawickets mapfumbamwe mumutambo weSuper Six uyo wakabva waona Sri Lanka ichienda pamusoro pemaChevrons palog reSuper Six. Kukundwa kwakaita chikwata chaDave Houghton neSri Lanka kunoreva kuti maChevrons anotofanirwa kuhwina mutambo wavo wekupedzisira wemuSuper Six neScotland uye kana vakahwina mutambo uyu, vanobva ahwina tikiti rekuenda kuIndia uye vopinda mufainari yekurwira mukombe weICC Men’s Cricket World Cup Qualifiers uyo uri kutambirwa muno. Fainari yeICC Men’s Cricket World Cup Qualifiers ichatambwa nezvikwata zviviri zvichapedza zviri pamusoro pezvimwe zvese palog reSuper Six musi weSvondo.","pubDate":"2023-07-03 21:00:12","image_url":null,"source_id":"kwayedza","category":["sports"],"country":["Zimbabwe"],"language":"shona"},{"title":"‘More than a sport’: Sault cricket winning on and off the field","link":"https://www.sootoday.com/local-news/more-than-a-sport-sault-cricket-winning-on-and-off-the-field-7229545","keywords":null,"creator":["Alex Flood"],"video_url":null,"description":"‘Cricket in the north is growing strong,’ says chair of the Sault Ste. Marie Cricket Club, who witnessed his team go undefeated at the Thunder Bay Provincial Cup to earn the championship trophy on Sunday","content":"Since he moved from Pakistan to Sault Ste. Marie in 2016, Haroon Naseer has witnessed his favourite sport take off on Canadian soil. “Cricket in the north is growing strong,” he says. Celebrating their 10th anniversary season this summer, the Sault Ste. Marie Cricket Club has grown to 60 active members and expanded from one team to several since its inception. Since 2013, the club chair explains that the internationally popular bat-and-ball sport has provided newcomers with the familiar atmosphere of home. “Cricket is more than just a sport,” Naseer says. “It’s what keeps me connected and what made me want to stay in Sault Ste. Marie, and that’s the case for a lot of our players.” “They come here as new immigrants, and the sport connects that community of people from all over like India, Pakistan, Nepal, and Sri Lanka. All those countries play cricket – it’s huge back home for them, so when they come here, it’s something for us to do together.” Carrying out practices and playing their matches at the Queen Elizabeth field each summer, the local club recently gathered its best players and spent the Canada Day weekend in Thunder Bay for a chance to hoist the Provincial Cup. The Sault Stormers went undefeated and topped teams from Sudbury, Thunder Bay, and Winnipeg to earn the trophy on Sunday. They even received special congratulations from Thunder Bay Mayor Ken Boshcoff and MP Marcus Powlowski following their victory, and Sault Mayor Matthew Shoemaker and MP Terry Sheehan congratulated the team on social media as well. “I think our team combination is really good,” Naseer says. “We have a lot of young guns who come out and practice a lot. When I moved here, it was hard to make a cricket team. But now, so many people are joining. Their skillset is amazing.” Naseer is hoping his team can carry that momentum back home when the Sault hosts the Northern Ontario Cricket League on July 22-23. The tournament will invite clubs and their families from Sudbury, Timmins, North Bay, and Thunder Bay. “We want to promote tourism in Sault Ste. Marie,” Naseer says. “For northern communities here in Canada, it’s a great way to keep new immigrants in town as it’s growing so fast.” Naseer admits that the fees to run the cricket club each year can be expensive, and he’d like to see local businesses and organizations get interested in the sport and provide sponsorship opportunities for their team and the events they host. “Our club is mainly funded by our players, so we’re looking for community sponsors at our events,” he says. “Our summer league costs around $10,000 to run, and it’s very hard to come up with every year. But even with the little resources we have, we’re doing our best to make our name and our presence in the north.” It’s good from a tourism aspect as well, he said. \"We try to promote our city and invite these cities so they can not only play cricket and get involved but get the tourism part of it as well and show off how great the Sault is.” The Sault Ste. Marie Cricket Club chair encourages anyone who may be interested in signing up or learning more about the sport to visit their website for information. “It’s for everybody,” Naseer says. “We’re going to launch our student camps soon. With the help of sponsorship from the Kiwanis Club of Lakeshore, we’re buying equipment for young kids and will hopefully introduce the sport in schools so they can develop that interest early on.”","pubDate":"2023-07-03 20:59:04","image_url":"https://www.vmcdn.ca/f/files/sootoday/images/07-03-2023-morethanasportsaultcricketwinningonandoffthefield-af-01.jpg;w=960","source_id":"sootoday","category":["sports"],"country":["canada"],"language":"english"},{"title":"Djokovic, Swiatek shine in the rain as Wimbledon gets rolling","link":"https://www.rappler.com/sports/tennis-results-novak-djokovic-iga-swiatek-wimbledon-july-3-2023/","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Novak Djokovic picks up a dominant win to open his bid for a record-extending 24th Grand Slam, while Iga Swiatek kicks off her quest for a maiden Wimbledon title in style","content":"LONDON, UK – Defending men’s champion Novak Djokovic and women’s top seed Iga Swiatek started their Wimbledon campaigns with routine victories on Monday, July 3, as rain temporarily halted play on the outside courts and the threat of climate protests lingered in the air. Djokovic, 36, has only lost twice at Wimbledon in a decade and began the Centre Court program with a 6-3, 6-3, 7-6 (4) win over Argentine Pedro Cachin after a 70-minute delay despite the roof being closed as ground staff labored to get the turf dry. The Serbian jokingly wiped the turf with a towel during the break in play to draw cheers from the crowd before ground staff deployed leaf blowers to get the job done and allow Djokovic to finally close out the victory. Swiatek continued her quest to solve the grass court puzzle that has frustrated her by powering past China’s Zhu Lin 6-1, 6-3 with the contest finishing under the Court One roof due to rain. World No. 1 Swiatek, who last month claimed her third French Open crown and is eyeing a fifth Grand Slam title, meets Spain’s Sara Sorribes Tormo next. Fourth seed Jessica Pegula also advanced to the second round but was made to work hard for a 6-2, 6-7 (8), 6-3 victory by fellow American Lauren Davis, while twice Grand Slam champion Victoria Azarenka beat China’s Yuan Yue, 6-4, 5-7, 6-4. Familiar face Earlier, the All England Club gates swung open for the start of the grass court major with some notable absentees but one very familiar face in Djokovic fixing his eyes on more records. Wimbledon’s favorite son Roger Federer, now retired, the injured Rafa Nadal, and Serena Williams, also retired, are hard acts to follow and fans will lament their absence. Australian maverick Nick Kyrgios, who pushed Djokovic hard in last year’s men’s final and can be relied upon for antics that make the front and back pages, is also missing having pulled out with a wrist injury on the eve of the slam. But Wimbledon remains rich in plots, not least Djokovic’s quest to win a men’s record-extending 24th Grand Slam title, match Federer’s eight Wimbledon crowns, and equal the Swiss and Bjorn Borg’s record of five successive titles. Excited crowds There was the usual buzz of anticipation around the grounds as queues began building ahead of the start time on the outside courts while many fans were forced to wait longer than usual to enter. Organizers said on Twitter the grounds are expected to be at capacity, adding that fans intending to queue should not travel to the All England Club. Sun cream was not in demand, though, with cloudy skies and a cool blustery wind ushering in the first day of 14. Rain is expected throughout the opening days, although that will not affect those with tickets for Centre Court and Court One, both of which boast retractable roofs. Security was on high alert for any sign of protests after several high-profile sporting events in Britain this year were disrupted, including last week’s Ashes cricket test at Lord’s, where climate change protestors ran onto the field and attempted to spread orange powder on the turf. Political slogans of any sort have been banned around the grounds with Wimbledon organizers determined the focus should remain firmly on the tennis. Monday also marked the return of players from Russia and Belarus after they were excluded from Wimbledon last year following Moscow’s invasion of its neighbor Ukraine. Russia, which used Belarus as a staging post, calls its actions in Ukraine a “special military operation.” Russian players have to sign a “nationality waiver” pledging they do not support President Vladimir Putin’s regime. All 17 players from the two countries, including men’s third seed Daniil Medvedev, are competing as neutrals. Medvedev’s compatriot and seventh seed Andrey Rublev moved into the second round with a 6-3, 7-5, 6-4 win over Australia’s Max Purcell, while fellow Russian Veronika Kudermetova beat Estonia’s Kaia Kanepi, 7-6 (4), 6-4. – Rappler.com","pubDate":"2023-07-03 20:39:26","image_url":null,"source_id":"rappler","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Lord's cricket row EXPLAINED: England and Australia lock horns following controversial dismissal","link":"https://www.dailymail.co.uk/sport/cricket/article-12260743/Lords-cricket-row-EXPLAINED-England-Australia-lock-horns-following-controversial-dismissal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Jonny Bairstow's controversial dismissal has lit the touch paper for much debate around the cricket community. Many have suggested that it wasn't 'in the spirit of the game'.","content":"Lord's cricket row EXPLAINED: England and Australia lock horns following Jonny Bairstow's controversial dismissal at Lord's Australia took a 2-0 lead in the Ashes on Sunday in controversial circumstances Jonny Bairstow was dismissed after he was stumped by wicketkeeper Alex Carey The England batsman thought the ball had gone dead but was instead given out By Ed Carruthers For Mailonline Published: 00:19 BST, 4 July 2023 | Updated: 00:36 BST, 4 July 2023 e-mail View comments Whatever side of the fence you sit on, it's safe to say that it's been an explosive 24 hours following England's defeat by Australia at Lord's in the second Ashes Test. Jonny Bairstow 's controversial dismissal has lit the touch paper for much debate around the cricket community. Many have weighed in on the argument, with some claiming Australia's dismissal was 'just not cricket' while others, including Stuart Broad , who wrote today for Mail Sport, saying he was 'amazed' that not one Australian stood up to say Bairstow's dismissal was wrong. In any event, the decision stood and Ben Stokes ' side succumbed to a 43-run loss and are now 2-0 down in the Ashes series. They must-win in the third Test which starts on Thursday at Headingley in Leeds if they have any hope of winning the urn back off Australia this summer. But perhaps the events of Sunday afternoon might provide Brendon McCullum's side with the fire they may have been lacking to turn things around. But what actually happened to spark such a furious reaction among the England Cricket camp and their fans, that has also seen a war of words arise between both British and Australian media agencies. Mail Sport takes a deep dive into the controversial dismissal, the Series as it stands and all the reaction from the second test at Lord's. So what actually happened? England came into the final day of the Lord's test needing 257 to win with six wickets remaining. Two of those wickets included Stokes and Bairstow. Saturday had a few extraordinary moments of its own, with Mitchell Starc appearing to take a tumbling catch that would have dismissed Ben Duckett, had he not placed the ball on the ground with an open palm to cushion his landing. Still, Australia attacked England and dismissed Duckett, with their wicketkeeper-batmsan Bairstow arriving to partner up with his captain. He would face just 22 balls, scoring 10 runs, before he was shockingly dismissed by Alex Carey. Opting to leave a bouncing ball launched at him by Cameron Green from down the wicket, Bairstow scratched his crease with his foot, assuming that the ball was dead and walked seamlessly out into the middle of the wicket. He was largely oblivious to what was going on behind him, with Australia's wicketkeeper, Carey, realising that Bairstow was about to leave his crease, and in a moment of quick thinking, chucked the ball at the stumps with an under arm throw, catching the Englishman, who had departed his crease, off guard. Was Bairstow out? That is one of the big questions and is perhaps why live sport is so great. This decision will provide debates for years, decades perhaps, to come. Following a review, the umpires decided that Bairstow was in fact out and he was dismissed from the field. While the umpires have already made their decision and there's no way we can change it now, the key point of controversy was whether the ball was still live after Bairstow had left his crease. It was the end of the over and the replays show the 33-year-old walking down the wicket to talk to his partner, seeming to assume that the ball was no longer in play. Many have questioned whether the ball was actually still live, and it seemed that way, with both umpires taking strides forward, while even Bairstow had scratched his crease with his foot to 'regain his ground', as Mail Sport's Ian Ladyman put it, indicating that he thought the ball was now dead. Bairstow had neither, as Mail Sport columnist Stuart Broad said , tried to take an advantage by making a run after he left the ball, meaning that he thought play would not continue. Conversely, both Stokes and McCullum have admitted that it was out , and all things considered, the correct decision does seem to have been given. Ironically, even after the MCC members were so incensed in the Long Room (more on that in a moment) following the session, under the MCC's Laws of Cricket, the ball was perhaps still in play. Rule 20.1.2 states : 'The ball shall be considered to be dead when it is clear to the bowler’s end umpire that the fielding side and both batters at the wicket have ceased to regard it as in play.' Why are England so upset about it? The problem, perhaps for a lot of commentators around England though was not so much that Bairstow was in or out, it was more about the fairness of the game, with Stokes and McCullum both stating that while Australia dismissed Bairstow within the laws, it was perhaps not done in the 'spirit of the game'. The England captain in fact said that Australia had forgotten the values of the sport and should have maybe re-thought their decision to appeal the wicket. 'I am not disputing the fact it is out because it is out,' said Stokes. 'If the shoe was on the other foot, I would have put more pressure on the umpires and asked whether they had called over and had a deep think about the whole spirit of the game and whether I would want to do something like that. 'For Australia, it was the match-winning moment. Would I want to win a game in that manner? The answer is no,' Stokes added. McCullum echoed his comments saying: 'In the end, they made a play, they’ve got to live with that. We would have made a different play, but that’s life.' Should pat cummins have rescinded his appeal? Some have even criticised Pat Cummins claiming that the Australian captain should have rescinded his appeal to get Bairstow out and called him back onto the field to bat again . That would have certainly been a display of sportsmanship, for sure. But Cummins was unapologetic, claiming he thought the dismissal was reasonable. 'I thought it was fair,' the Australian captain said. 'You see Jonny do it all the time. He did it on Day One to Warner. He did it in 2019 to Steve [Smith]. It's a really common thing for keepers to do if they see a batter keep on leaving their crease,' said the Australia captain. 'Caz [Carey] - full credit to him. He saw the opportunity a few balls beforehand and rolled at the stumps. Jonny left his crease and we'll leave the rest to the umpires.' What is the MCC? Things took an unsavoury turn as Australia walked back into the changing rooms following the session. Lord's is one of the most historic sporting venues in the world and is home to the MCC - the Marleybone Cricket Club. It is said to be the home of cricket and houses 18,000 members, who queue outside the ground each morning of the Test match to get access to the stadium. And what is the Long Room? Members convene in what's known as the Long Room, a dining hall built in the pavilion end of the stadium which is surrounded by paintings of players of years gone by. The players of both sides must walk through the long room to get to and from the dressing rooms and it is here where much controversy emerged on Sunday after several MCC members heckled the Australian players heading back into the dressing rooms. They were branded 'cheats' by the members, with some confronting Australia's Usman Khawaja, who seemed to become incensed by some comments that were made towards him by the members . Three members have subsequently been suspended by the club, pending investigations , following the ugly scenes. The explosive reaction In the past 24 hours there has been plenty of reaction both online and from some of the biggest names in cricket, with Sir Geoffrey Boycott, a legend of the sport, calling for Australia to apologise to England . Broad, who came in to replace Bairstow, sarcastically jested with the Australian's following his dismissal, while also told Carey that the stumping was: 'All he'd be remembered for.' He has also had his say, writing in a column for Mail Sport today saying that he was 'stunned' none of the Australians had admitted that the appeal 'was wrong' while also claiming that Cummins will regret not rescinding Australia's appeal . Even the British Prime Minister, Rishi Sunak, who has been spotted at Lords this week, weighed in on the row, slamming Australia for the dismissal . Media outlets down under and in the UK have been having their own war of words, with some Australian outlets hitting out at the uproar from the English. Some outlets down under have dubbed the English as 'hypocrites', 'whingers' and 'miserable poms'. A page of the Western Australian paper was also posted on Twitter earlier on Monday and depicted a photoshopped image of Ben Stokes wearing a nappy while sucking on a dummy. The image showed him reaching for an unblemished looking cricket ball with the caption 'Cry babies' underneath. And Stokes has hit back at the image , tweeting in response: 'That’s definitely not me, since when did I bowl with the new ball.' In any event, Thursday's test match at Headingley is set to have plenty added edge to it, with England coming in to the game looking to rescue the series, while Australia are just one step away from retaining the urn. Share or comment on this article: Lord's cricket row EXPLAINED: England and Australia lock horns following controversial dismissal e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 23:19:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/00/72804581-0-image-a-103_1688426324104.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Stuart Broad thinks Pat Cummins will regret handling of Jonny Bairstow dismissal","link":"https://www.watfordobserver.co.uk/sport/national/23631113.stuart-broad-thinks-pat-cummins-will-regret-handling-jonny-bairstow-dismissal/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Broad replaced Bairstow in the middle following the incident before Australia went on to win the second Ashes Test and take a 2-0 lead.","content":"Alex Carey’s opportunistic stumping of his fellow wicketkeeper during the dramatic conclusion to the second Ashes Test sparked fury from fans and members at the home of cricket and the row has shown no signs of abating. Broad replaced Bairstow in the middle following the incident, before Australia went on to win and take a 2-0 lead. Broad insists “zero advantage” came from Bairstow straying from his crease and, after making his point to the Australian players throughout the duration of his stay, the England seamer feels Cummins will eventually think upholding the appeal was the wrong play. “What amazed me, and what I told the Australians I could not believe as we left the field at lunch, was that not one senior player among them — and I very much understand in the emotion of the game that the bowler and wicketkeeper would have thought ‘that’s out’ — questioned what they had done,” Broad wrote in the Daily Mail. “Especially given what their team has been through over recent years, with all their cultural change. Not one of them said ‘Hang on, lads. I’m not really sure about this’. Not one of them thought ‘He’s gaining no advantage. He’s not trying to get a run. It’s the end of the over. It’s a bit of a random dismissal. We should cancel that appeal’. “Ultimately, Pat Cummins is a really great guy and I would be amazed, once the emotion settles, if he does not sit back and think ‘I got that one wrong’, even though his bottom line at the time was winning a Test match.” Ex-players, pundits and even Prime Minister Rishi Sunak weighed in on the debate, while anger in the crowd at the manner of Bairstow’s exit spilled over in the usually restrained Long Room at Lord’s, where Australian players Usman Khawaja and David Warner were involved in heated exchanges with jeering members – three of whom were later suspended by Marylebone Cricket Club. Broad, too, admits the moment got the better of him as he joined captain Ben Stokes, watching from the other end as the skipper hit a remarkable 155 in a forlorn effort to level the series. “The red mist came over me, too, when I arrived at the crease to replace Jonny, and some of what I said was picked up on the stump mics — which naively, given my experience, I didn’t really think about. I just said to Pat on repeat ‘All these boos are for you, for your decision’. And ‘What a great opportunity you had to think clearly’,” he added. “Also, I needed to support Ben Stokes in any way, shape or form I could, and I am always better when I’m in a bit of a battle. I normally try and pick a fight with someone on the opposition but on this occasion I picked a fight with the whole team. “To Alex Carey, I said ‘This is what you’ll be remembered for, and that’s such a shame’. It may have been a bit silly, but I also shouted ‘in’ every time I crossed the line. It annoyed the Australians for maybe half-an-hour, although after two-and-a-half hours, they were probably a bit bored of it.”","pubDate":"2023-07-03 22:53:16","image_url":"https://www.watfordobserver.co.uk/resources/images/16958763/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"It’s just cricket: Why the Bairstow furore has me absolutely stumped","link":"https://www.theage.com.au/sport/cricket/it-s-just-cricket-why-the-bairstow-furore-has-me-absolutely-stumped-20230703-p5dlhd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Mark Taylor"],"video_url":null,"description":"People want to invoke the spirit of cricket, but I’ve seen throws at the stumps to catch an unsuspecting batsman out for as long as I’ve known the game.","content":"I’ve got no issue at all with what Pat Cummins and the Australian team did during the last day of the Lord’s Test when they stumped Jonny Bairstow. It’s a legitimate form of dismissal and has been as long as I’ve known the game of cricket. I’ve seen many wicketkeepers throwing the ball towards the stumps to try and claim an unsuspecting batsman’s wicket. I can remember Rod Marsh throwing the ball towards the stumps off Dennis Lillee’s bowling, Ian Healy did the same thing when a batsman was out of his crease, we’ve seen Jonny Bairstow do it in the latest Test, I’ve seen footage of England coach Brendon McCullum doing it back in 2009. This sort of stuff has been going on for a long time. People want to invoke the spirit of cricket, but I really don’t see it as that sort of issue. Batsmen are now batting out of their crease and wandering out of their crease trying to put bowlers off their length, which is fair enough. But the batsmen have to remember there are 10 ways to get out in Test cricket. One of them is by being stumped, and it doesn’t say in the laws it has to be off a slow bowler. If you’re going to wander out of your crease doing whatever you want to do, be mindful that you can be stumped. So, your job as a batsman is to get back in your crease until the ball is dead. And that’s according to the umpires and the fielding side, not just because you think it might be dead. Bairstow was caught wandering out of his crease when the ball wasn’t dead. Alex Carey was quite entitled to throw the ball at the stumps and Cummins and the Australians were quite entitled to appeal. As far as I’m concerned, that’s the end of the story. Australia celebrate the contentious dismissal of Jonny Bairstow on day five of the second Test at Lord’s. Credit: Reuters I’m disappointed with the way the Australian players were treated after completing this entirely legitimate dismissal, particularly in the Long Room . I will congratulate Guy Lavender, CEO of the MCC, for getting onto it reasonably quickly, calming down the MCC members and suspending three of them. However, I think that’s the minimum amount they need to do at this stage. All in all, the behaviour of the members towards the Australian players was poor to say the least, and inappropriate for anyone, particularly the members. I love the fact that they have that access to get so close to the players. Walking through the Long Room is something I recall as a player. It’s unique to the game of cricket. In my day they didn’t have ropes separating players and members. Back in the 1980s and 90s you just made your way out through the Long Room and excused yourself around members who were sometimes smoking cigars and pipes. If that tradition, which I really enjoy, is going to continue, this type of poor behaviour needs to be stamped out. If not, it would mean the access will have to be changed, and that will not be great for the game of Test cricket. The game would be poorer if the bad behaviour of some members was to bring an end to the tradition of players walking through the Long Room. Credit: Nine England captain Ben Stokes has hedged his bets a little. Obviously, he’s got to go in and bat for his teammate Bairstow, who would be embarrassed by his dismissal during a tight last day in front of a Lord’s crowd. That was an embarrassing dismissal because he’s the one at fault. He’s the one who’s created the opportunity for Australia to stump him. There’s been a lot said and written from all sides about what is really a straightforward dismissal and some of it hasn’t been particularly helpful. I hope both sides will take stock, have a breather and work out that it was, in fact, just a dismissal. It was an unusual one, yes, but it is part of the game. I hope that when the third Test starts on Thursday we see the same tough contest we saw during the first two Tests in what I think has been an enthralling, high intensity series played in great spirit. I hope people look back on this Test they will remember a great game, not a crucial final-day stumping because that’s all it was. Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-07-03 22:40:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"STUART BROAD: It amazes me that NOT ONE Aussie thought the appeal was wrong","link":"https://www.dailymail.co.uk/sport/cricket/article-12260263/STUART-BROAD-amazes-NOT-ONE-Aussie-thought-appeal-wrong.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"STUART BROAD: We saw it with Mitchell Starc's catch on Saturday evening: all of Australia thought it was out, all of England, me included, thought it was not out.","content":"It amazes me that NOT ONE Aussie thought the appeal was wrong… Pat Cummins will regret his mistake: STUART BROAD takes us into the middle of a controversial day at Lord's Jonny Bairstow was controversially stumped by Alex Carey at Lord's on Sunday The incident sparked controversy over whether it was in the spirit of cricket Australia subsequently went on to win and extend their lead in the Ashes to 2-0 By Stuart Broad For The Daily Mail Published: 22:00 BST, 3 July 2023 | Updated: 23:37 BST, 3 July 2023 e-mail 22 shares 11 View comments The amazing thing about sport, and this seems to apply to cricket more than most, is how it divides opinion . We saw it with Mitchell Starc’s catch on Saturday evening: all of Australia thought it was out, all of England, me included, thought it was not out . But the crux of the matter for Jonny Bairstow ’s dismissal at Lord’s on Sunday was whether he was looking to gain an advantage . Yes, I have seen a clip from earlier in the match when in his guise as wicketkeeper, Jonny himself threw the ball at the stumps. But that was because Marnus Labuschagne was batting outside of his crease — in doing so, attempting to take the lbw out of the game. In other words, seeking an advantage. Clips of Colin de Grandhomme being run out in the Lord’s Test last year have done the rounds, too, and that is just the most ludicrous comparison ever, because he got hit on the pad coming down the pitch, was searching for a run and Ollie Pope threw down the stumps from gully. Again, trying to gain an advantage . Jonny Bairstow (right) was controversially run out by Alex Carey at Lord's on Friday, with Australia going on to win the match and go 2-0 up in the Ashes Pat Cummins (left) chose not to rescind his side's appeal after Bairstow's controversial wicket Controversy has subsequently shrouded the Test match with many claiming the dismissal was not in the spirit of the game England's Stuart Broad has opened up on a combustible and controversial day at Lord’s With regards to the Jonny incident, zero advantage was being taken there: he let the ball go, scratched his mark within the crease, and acknowledging it as the end of the over, went to speak to Ben Stokes. And if you look at the footage of when the stumps were broken, one umpire has got the bowler’s cap in his hand, the other is head down, walking in from square leg — actions that suggest they too thought the over had finished. So, within the laws of the game, is the ball still live because Alex Carey catches it and throws it? Probably. Is there any advantage being taken by England? No. Does a full stadium of people think that ball has been and gone? Yes. On BBC radio commentary, Jonathan Agnew has already moved on from the calling of the ball. What amazed me, and what I told the Australians I could not believe as we left the field at lunch, was that not one senior player among them — and I very much understand in the emotion of the game that the bowler and wicketkeeper would have thought ‘that’s out’ — questioned what they had done. Especially given what their team has been through over recent years, with all their cultural change. Not one of them said: ‘Hang on, lads. I’m not really sure about this.’ Not one of them thought: ‘He’s gaining no advantage. He’s not trying to get a run. It’s the end of the over. It’s a bit of a random dismissal. We should cancel that appeal.’ Ultimately, Pat Cummins is a really great guy and I would be amazed, once the emotion settles, if he does not sit back and think, ‘I got that one wrong’, even though his bottom line at the time was winning a Test match. The Lord’s crowd are obviously huge cricket lovers and never before have I seen a reaction from them like that. They were so angry. Bairstow seemingly stepped out of his crease following the over to talk to Ben Stokes at the non-strikers end. He had also scratched the crease before crossing the line Alex Carey (pictured) saw Bairstow leaving and threw the ball at the stumps, dismissing him At the time England were mounting a run chase, but Australia would go on to win by 43 runs Following the controversy, Sir Geoffrey Boycott told Cummins (pictured) and Australia that they must apologise to England Broad (right) arrived in Bairstow's wake and proceeded to wind-up the Australians by sarcastically letting them know he was in his crease on several occasions At the end of that first session, the change from the roar the Long Room gave to Ben Stokes to the boos they reserved for the Australians walking in was stark . They knew way before that point how controversial a decision they had made. I am not saying that the MCC members shouting at players was right but having toured Australia four times, I certainly do not think hostile behaviour towards away teams is unusual. The red mist came over me, too, when I arrived at the crease to replace Jonny, and some of what I said was picked up on the stump mics — which naively, given my experience, I didn’t really think about. I was angered by Australia’s decision, particularly having heard their lines about creating a new legacy as a team, and how they have changed since the tour of South Africa in 2018. I just said to Pat on repeat: ‘All these boos are for you, for your decision.’ And: ‘What a great opportunity you had to think clearly.’ Also, I needed to support Ben Stokes in any way, shape or form I could, and I am always better when I’m in a bit of a battle. I normally try and pick a fight with someone on the opposition but on this occasion I picked a fight with the whole team. To Alex Carey, I said: ‘This is what you’ll be remembered for, and that’s such a shame.’ It may have been a bit silly, but I also shouted ‘in’ every time I crossed the line. It annoyed the Australians for maybe half-an-hour, although after two-and-a-half hours, they were probably a bit bored of it. To be honest, it was a pleasure to be out there with Stokesy when he was in one of those moods. We were both in our zones. He wanted me to react to him. So if he was going to run, go with him, if he wasn’t, don’t move. In those situations, he chooses what balls he wants to face and what he wants to do, and the cleanliness of his striking towards the leg side, both hitting sixes over the fielders and placing fours between them, is extraordinary. There was only really one way you could hit out as a left-hander on that slow pitch — with the wind, towards Father Time. I actually felt for Mitchell Starc and Josh Hazlewood having to bowl from the Nursery End because Stokesy was cleverly targeting deliveries from there and just sort of surviving at the other end. That brilliant 155 gave us a fighting chance and when you finish a Test match, and lose by 43 runs, you look at everything and think: where could we have got those 43 from? To be four down for 45 early and get so close to a target of 371 was very impressive, especially losing Jonny in that manner. To repeat, it was not the act that annoyed me, it was the fact they upheld the appeal. Headingley is not the quietest place at the best of times but this week we will have to use the atmosphere to our advantage. Tempers flared inside the Long Room at Lord's as members heckled the Australian players heading for the dressing room Stokes mounted a late run chase for England but despite scoring an admirable 155, helping to cut the deficit, his side fell short of the mark Stokes and Cummins were seen sharing a word after play had concluded on Day Five at Lord's Yes, we are 2-0 down after two pretty theatrical Test matches that have lived up to what Ashes cricket is about but when I look at our changing room, most of us have got a bit more ‘performance’ in us, and we will bring that to Leeds. I said at the start of the summer that I would be happy playing one Test but my job now is to rest, recuperate and get myself available for Thursday. Selection is not my call, but although I have bowled more balls than anyone else in the series I will be ready for another five days. And I believe that whoever we put out on the field, we will do the business . Three matches left, we will now be faced with three result pitches. This series has turned into a shootout and we are very confident we can still do this. Share or comment on this article: STUART BROAD: It amazes me that NOT ONE Aussie thought the appeal was wrong e-mail 22 shares Add comment Comments 11 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 22:37:22","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/20/72806479-0-image-a-12_1688412522699.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PAUL NEWMAN: Pat Cummins' decision to not rescind dismissal put Aussie cricket back in the gutter","link":"https://www.dailymail.co.uk/sport/cricket/article-12260515/PAUL-NEWMAN-Pat-Cummins-decision-not-rescind-dismissal-Aussie-cricket-gutter.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"If anyone could see the wider picture among an experienced Australian team who should have known better and withdrawn Australia's appeal against Bairstow at a key stage of the Test.","content":"PAUL NEWMAN: Captain conscience's cock-up dumps Aussie cricket back in the GUTTER… all the good work put in by Pat Cummins since he succeeded his disgraced predecessors lies in ruins Australia defeated England at Lord's in controversial circumstances on Sunday Jonny Bairstow was stumped by Alex Carey after he thought the ball went dead It has divided opinions with some even demanding an apology from Australia By Paul Newman for the Daily Mail Published: 22:30, 3 July 2023 | Updated: 23:14, 3 July 2023 e-mail 12 View comments The biggest shame of the whole affair is that it was Pat Cummins who refused the chance to do the right thing when Jonny Bairstow was dismissed to send Lord's into a frenzy . If anyone could see the wider picture among an experienced Australian team who should have known better and withdrawn Australia 's appeal against Bairstow at a key stage of the second Test , then it would surely have been their captain. Cummins was, at least before the extraordinary scenes on Sunday, regarded as one of the nicest guys in cricket, a captain with a conscience and exactly the right man to restore Australia's tarnished image after the ravages of Sandpapergate . Now all the good work put in by Cummins since he succeeded the disgraced Tim Paine, who succeeded the disgraced Steve Smith, lies in ruins. Australia's 43-run victory to take a 2-0 lead in the Ashes will forever be tainted. It's not as if the 'crime' is anything like as bad as the ball-tampering scandal in Cape Town five years ago that engulfed Australian cricket and led to long bans for Smith and David Warner and the departure of Darren Lehmann as coach. Pat Cummins' Australia have now gone 2-0 in the Ashes series, after Sunday's win at Lord's Ben Stokes' (left) England side were left in uproar on Sunday afternoon, after Jonny Bairstow was controversially dismissed by Australia, who have since been heavily criticised for it Bairstow (right) was stumped by Alex Carey after he left his crease thinking the ball was dead Nor were the actions of Alex 'Pariah' Carey in running out Bairstow — there is no way it should have been considered a stumping — when every indication was that the over was complete and the ball was dead as bad as the resurgence of 'Mankading .' It is just the opportunity that was wasted. The chance for Cummins to prove that Australian cricket really has climbed out of the gutter it found itself in when the behaviour of a truly toxic Australian team reached its nadir in South Africa. There was plenty of time for Cummins to realise the implications of what he was doing when inexperienced umpire Ahsan Raza, wrongly, immediately sent the decision to the TV official rather than taking the sting out of the incident himself . Raza and his fellow standing umpire Chris Gaffaney should have gone to Cummins and England captain Ben Stokes . He could have told them they had begun to move into position for the next over and asked Cummins if he really wanted to go ahead with Carey's appeal. When they did not Cummins should have gone to his many senior players for advice before making a call that will haunt him and Carey for the rest of their careers, however much they believe they were acting within the letter of cricket's laws . The one thing that is clear is Bairstow was not trying to take a run nor seeking any advantage. So to dismiss him in the manner Australia did was underhand. Steve Smith broke down in tears back in 2018 during his live apology after 'Sandpaper-Gate' Cameron Bancroft (pictured) was caught rubbing sandpaper on a cricket ball during a test match against South Africa back in 2018 Remember, India captain MS Dhoni called Ian Bell back when he did something similar at Trent Bridge in 2011 and there was a much stronger case to say that Bell had been dozier than Bairstow. Have Smith and Warner not learned anything from the scandal that will forever stain their own records? Smith tries to still captain Australia in the field anyway. Why could he not show true leadership when the official captain of Australia needed him most? What was Cummins scared of? England still needed 178 runs at that stage for the most unlikely of series-levelling victories. Did Australia lack the belief that they could take the remaining five England wickets on a fifth day pitch without skulduggery? Cummins's monosyllabic response to questioning afterwards and a refusal to explain his actions and acknowledge the extent of feeling among a febrile full house at the home of cricket suggests that deep down he knew he had made a huge mistake. Maybe he will fully realise it by the time the teams get back to business on Thursday in Leeds but there has been no suggestion of any about-turn yet, certainly no sign of the public apology that Geoffrey Boycott called for from Australia on Monday. Instead Australians who, remember, somehow get themselves in a pickle when an England batsman fails to walk after nicking a ball or an England bowler gives one of their batsman a mild send-off, cricketing practices they invented, prefer to get indignant about the behaviour of some MCC members in the Lord's Long Room . That in itself should have made Cummins and company realise they were wrong. If members in the hallowed Long Room, one of the most traditional and mild-mannered places in cricket, should become hostile then surely Australia had to look at themselves. Carey (left) who thought on his feet, ran to celebrate with his team-mates after the dismissal Much controversy has shrouded Saturday's test, but there were unsavoury scenes in the Long Room at Lord's as MCC members heckled Australia's team as they left the pitch Stokes (left) and England head coach Brendon McCullum (right) have both spoken out on the incident, with Stokes insisting that 'it was not how he would want to win a Test match' And was what those members did really so bad? Yes they shouted angrily at the Australians but it appears certain there was no offensive language used and none of the physical contact Cricket Australia intimated when they made their complaint to MCC. This was no Gabba. No Bay 13 at Melbourne. Hostility to opposing teams, like non-walking and sledging, is an Australian speciality so it is amusing they are so offended by it when the shoe is on the other foot. Again, we have seen a lot worse than what Carey did. But Cummins had the chance to provide the game with one of its great sporting moments while only running a small risk of damaging his side's chances of winning. That the Australian captain didn't take it is a crying shame for the game and his own reputation. Share or comment on this article: PAUL NEWMAN: Pat Cummins' decision to not rescind dismissal put Aussie cricket back in the gutter e-mail Add comment Comments 13 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 22:14:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/22/72810055-0-image-a-51_1688419708496.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | UK's PM accuses Australian cricketers over Bairstow dismissal","link":"https://www.news24.com/sport/Cricket/uks-pm-accuses-australian-cricketers-over-bairstow-dismissal-20230703","keywords":null,"creator":null,"video_url":null,"description":"British Prime Minister Rishi Sunak on Monday aimed a verbal bouncer at Australia's cricketers after the Lord's Ashes match -- but ruled out turning it into a Bodyline-style diplomatic incident.","content":"British Prime Minister Rishi Sunak on Monday aimed a verbal bouncer at Australia's cricketers after the Lord's Ashes match -- but ruled out turning it into a Bodyline-style diplomatic incident. Jonny Bairstow's controversial dismissal was not in keeping with the spirit of the game, Sunak's spokesperson told reporters. \"The prime minister agrees with (England captain) Ben Stokes who said he simply wouldn't want to win a game in the manner that Australia did,\" the spokesman said. But Sunak, a keen cricket fan who watched with Prince William from the Lord's pavilion on Saturday, also deplored the Long Room abuse directed at the Australians by Marylebone Cricket Club members. \"He thinks it was right that the MCC have taken swift action to suspend any members accused of poor behaviour,\" the spokesman said. Sunak believed that the standing ovation given by MCC members to Australia's hobbling spinner Nathan Lyon, as he came out to bat on Saturday, was \"much more in keeping with the spirit of the game\". But Sunak has no intention of lodging an official protest with Australian Prime Minister Anthony Albanese, to reprise the serious diplomatic strains created by England's \"Bodyline\" tactics in the 1932-33 Ashes Down Under. While there is a \"friendly rivalry\" over sport between the two leaders, Sunak does not view cricket as a core diplomatic issue, the spokesman remarked. \"The game did provide an opportunity to see Ben Stokes at his best and it was an incredible Test match -- he has confidence that England will bounce back at Headingley,\" he added, after Stokes hit a blazing 155.","pubDate":"2023-07-03 21:40:21","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Silverstone to warn off Just Stop Oil group as they deploy 12,000 'spies' at British Grand Prix","link":"https://www.dailymail.co.uk/sport/formulaone/article-12260327/Silverstone-warn-Just-Stop-Oil-group-deploy-12-000-spies-British-Grand-Prix.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The circuit's managing director Stuart Pringle has warned campaigners they are risking their lives if they trespass on to the 3.66-mile track, as they did last year.","content":"Silverstone plan to halt Just Stop Oil group as they deploy 12,000 'spies' at this weekend's British Grand Prix to stop protestors from sabotaging race Campaigners have been warned they will be risking their lives by protesting Silverstone chiefs have spies in place to thwart any Just Oil protests on the track Meanwhile, the British GP is set to remain at Silverstone for most of the decade By Jonathan McEvoy for the Daily Mail Published: 17:30 EDT, 3 July 2023 | Updated: 17:30 EDT, 3 July 2023 e-mail 1 View comments Silverstone will deploy 12,000 'spies' in an attempt to protect this weekend's British Grand Prix from Just Stop Oil saboteurs. The circuit's managing director Stuart Pringle has warned campaigners they are risking their lives if they trespass on to the 3.66-mile track, as they did last year. He told Mail Sport: 'It's one thing protesting at a flower show or cricket match, but quite another when cars are travelling at 200mph. My message is clear, 'Don't risk your life'. Silverstone are putting plans in place to prevent Just Stop Oil from sabotaging the Grand Prix 'There are 12,000 working personnel in all, and they will be briefed to be super vigilant. I urge fans, as well as staff, to act as our eyes and ears.' Meanwhile, the British Grand Prix looks set to remain at Silverstone for most of, if not all, the decade. F1 boss Stefano Domenicali and the circuit's owners, the British Racing Drivers' Club, are both committed to agreeing an extension. Share or comment on this article: Silverstone to warn off Just Stop Oil group as they deploy 12,000 'spies' at British Grand Prix e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-03 21:30:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/03/20/72807339-0-image-a-3_1688414282759.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MaChevrons anotofanirwa kukunda Scotland","link":"https://www.kwayedza.co.zw/machevrons-anotofanirwa-kukunda-scotland/","keywords":["NHAU DZEMITAMBO"],"creator":["abelndooka"],"video_url":null,"description":"Abel Ndooka CHIKWATA chenyika checricket chemaChevrons chiri kusangana necheScotland mangwana kuQueens Sports Club, kuBulawayo, mumutambo uyo chinofanirwa kuhwina kuti chiwane tikiti rekuenda kuICC Men’s Cricket World Cup iyo ichatambirwa kuIndia. Musi weSvondo wadarika maChevrons akakundwa neSri Lanka nemawickets mapfumbamwe mumutambo weSuper Six uyo wakabva waona Sri Lanka ichienda pamusoro pemaChevrons palog reSuper Six. Kukundwa kwakaita […]","content":"Kwayedza CHIKWATA chenyika checricket chemaChevrons chiri kusangana necheScotland mangwana kuQueens Sports Club, kuBulawayo, mumutambo uyo chinofanirwa kuhwina kuti chiwane tikiti rekuenda kuICC Men’s Cricket World Cup iyo ichatambirwa kuIndia. Musi weSvondo wadarika maChevrons akakundwa neSri Lanka nemawickets mapfumbamwe mumutambo weSuper Six uyo wakabva waona Sri Lanka ichienda pamusoro pemaChevrons palog reSuper Six. Kukundwa kwakaita chikwata chaDave Houghton neSri Lanka kunoreva kuti maChevrons anotofanirwa kuhwina mutambo wavo wekupedzisira wemuSuper Six neScotland uye kana vakahwina mutambo uyu, vanobva ahwina tikiti rekuenda kuIndia uye vopinda mufainari yekurwira mukombe weICC Men’s Cricket World Cup Qualifiers uyo uri kutambirwa muno. Fainari yeICC Men’s Cricket World Cup Qualifiers ichatambwa nezvikwata zviviri zvichapedza zviri pamusoro pezvimwe zvese palog reSuper Six musi weSvondo.","pubDate":"2023-07-03 21:00:12","image_url":null,"source_id":"kwayedza","category":["sports"],"country":["Zimbabwe"],"language":"shona"},{"title":"‘More than a sport’: Sault cricket winning on and off the field","link":"https://www.sootoday.com/local-news/more-than-a-sport-sault-cricket-winning-on-and-off-the-field-7229545","keywords":null,"creator":["Alex Flood"],"video_url":null,"description":"‘Cricket in the north is growing strong,’ says chair of the Sault Ste. Marie Cricket Club, who witnessed his team go undefeated at the Thunder Bay Provincial Cup to earn the championship trophy on Sunday","content":"Since he moved from Pakistan to Sault Ste. Marie in 2016, Haroon Naseer has witnessed his favourite sport take off on Canadian soil. “Cricket in the north is growing strong,” he says. Celebrating their 10th anniversary season this summer, the Sault Ste. Marie Cricket Club has grown to 60 active members and expanded from one team to several since its inception. Since 2013, the club chair explains that the internationally popular bat-and-ball sport has provided newcomers with the familiar atmosphere of home. “Cricket is more than just a sport,” Naseer says. “It’s what keeps me connected and what made me want to stay in Sault Ste. Marie, and that’s the case for a lot of our players.” “They come here as new immigrants, and the sport connects that community of people from all over like India, Pakistan, Nepal, and Sri Lanka. All those countries play cricket – it’s huge back home for them, so when they come here, it’s something for us to do together.” Carrying out practices and playing their matches at the Queen Elizabeth field each summer, the local club recently gathered its best players and spent the Canada Day weekend in Thunder Bay for a chance to hoist the Provincial Cup. The Sault Stormers went undefeated and topped teams from Sudbury, Thunder Bay, and Winnipeg to earn the trophy on Sunday. They even received special congratulations from Thunder Bay Mayor Ken Boshcoff and MP Marcus Powlowski following their victory, and Sault Mayor Matthew Shoemaker and MP Terry Sheehan congratulated the team on social media as well. “I think our team combination is really good,” Naseer says. “We have a lot of young guns who come out and practice a lot. When I moved here, it was hard to make a cricket team. But now, so many people are joining. Their skillset is amazing.” Naseer is hoping his team can carry that momentum back home when the Sault hosts the Northern Ontario Cricket League on July 22-23. The tournament will invite clubs and their families from Sudbury, Timmins, North Bay, and Thunder Bay. “We want to promote tourism in Sault Ste. Marie,” Naseer says. “For northern communities here in Canada, it’s a great way to keep new immigrants in town as it’s growing so fast.” Naseer admits that the fees to run the cricket club each year can be expensive, and he’d like to see local businesses and organizations get interested in the sport and provide sponsorship opportunities for their team and the events they host. “Our club is mainly funded by our players, so we’re looking for community sponsors at our events,” he says. “Our summer league costs around $10,000 to run, and it’s very hard to come up with every year. But even with the little resources we have, we’re doing our best to make our name and our presence in the north.” It’s good from a tourism aspect as well, he said. \"We try to promote our city and invite these cities so they can not only play cricket and get involved but get the tourism part of it as well and show off how great the Sault is.” The Sault Ste. Marie Cricket Club chair encourages anyone who may be interested in signing up or learning more about the sport to visit their website for information. “It’s for everybody,” Naseer says. “We’re going to launch our student camps soon. With the help of sponsorship from the Kiwanis Club of Lakeshore, we’re buying equipment for young kids and will hopefully introduce the sport in schools so they can develop that interest early on.”","pubDate":"2023-07-03 20:59:04","image_url":"https://www.vmcdn.ca/f/files/sootoday/images/07-03-2023-morethanasportsaultcricketwinningonandoffthefield-af-01.jpg;w=960","source_id":"sootoday","category":["sports"],"country":["canada"],"language":"english"},{"title":"Djokovic, Swiatek shine in the rain as Wimbledon gets rolling","link":"https://www.rappler.com/sports/tennis-results-novak-djokovic-iga-swiatek-wimbledon-july-3-2023/","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Novak Djokovic picks up a dominant win to open his bid for a record-extending 24th Grand Slam, while Iga Swiatek kicks off her quest for a maiden Wimbledon title in style","content":"LONDON, UK – Defending men’s champion Novak Djokovic and women’s top seed Iga Swiatek started their Wimbledon campaigns with routine victories on Monday, July 3, as rain temporarily halted play on the outside courts and the threat of climate protests lingered in the air. Djokovic, 36, has only lost twice at Wimbledon in a decade and began the Centre Court program with a 6-3, 6-3, 7-6 (4) win over Argentine Pedro Cachin after a 70-minute delay despite the roof being closed as ground staff labored to get the turf dry. The Serbian jokingly wiped the turf with a towel during the break in play to draw cheers from the crowd before ground staff deployed leaf blowers to get the job done and allow Djokovic to finally close out the victory. Swiatek continued her quest to solve the grass court puzzle that has frustrated her by powering past China’s Zhu Lin 6-1, 6-3 with the contest finishing under the Court One roof due to rain. World No. 1 Swiatek, who last month claimed her third French Open crown and is eyeing a fifth Grand Slam title, meets Spain’s Sara Sorribes Tormo next. Fourth seed Jessica Pegula also advanced to the second round but was made to work hard for a 6-2, 6-7 (8), 6-3 victory by fellow American Lauren Davis, while twice Grand Slam champion Victoria Azarenka beat China’s Yuan Yue, 6-4, 5-7, 6-4. Familiar face Earlier, the All England Club gates swung open for the start of the grass court major with some notable absentees but one very familiar face in Djokovic fixing his eyes on more records. Wimbledon’s favorite son Roger Federer, now retired, the injured Rafa Nadal, and Serena Williams, also retired, are hard acts to follow and fans will lament their absence. Australian maverick Nick Kyrgios, who pushed Djokovic hard in last year’s men’s final and can be relied upon for antics that make the front and back pages, is also missing having pulled out with a wrist injury on the eve of the slam. But Wimbledon remains rich in plots, not least Djokovic’s quest to win a men’s record-extending 24th Grand Slam title, match Federer’s eight Wimbledon crowns, and equal the Swiss and Bjorn Borg’s record of five successive titles. Excited crowds There was the usual buzz of anticipation around the grounds as queues began building ahead of the start time on the outside courts while many fans were forced to wait longer than usual to enter. Organizers said on Twitter the grounds are expected to be at capacity, adding that fans intending to queue should not travel to the All England Club. Sun cream was not in demand, though, with cloudy skies and a cool blustery wind ushering in the first day of 14. Rain is expected throughout the opening days, although that will not affect those with tickets for Centre Court and Court One, both of which boast retractable roofs. Security was on high alert for any sign of protests after several high-profile sporting events in Britain this year were disrupted, including last week’s Ashes cricket test at Lord’s, where climate change protestors ran onto the field and attempted to spread orange powder on the turf. Political slogans of any sort have been banned around the grounds with Wimbledon organizers determined the focus should remain firmly on the tennis. Monday also marked the return of players from Russia and Belarus after they were excluded from Wimbledon last year following Moscow’s invasion of its neighbor Ukraine. Russia, which used Belarus as a staging post, calls its actions in Ukraine a “special military operation.” Russian players have to sign a “nationality waiver” pledging they do not support President Vladimir Putin’s regime. All 17 players from the two countries, including men’s third seed Daniil Medvedev, are competing as neutrals. Medvedev’s compatriot and seventh seed Andrey Rublev moved into the second round with a 6-3, 7-5, 6-4 win over Australia’s Max Purcell, while fellow Russian Veronika Kudermetova beat Estonia’s Kaia Kanepi, 7-6 (4), 6-4. – Rappler.com","pubDate":"2023-07-03 20:39:26","image_url":null,"source_id":"rappler","category":["sports"],"country":["philippines"],"language":"english"}]}