{"newsArray":[{"title":"5 young Indian IPL 2023 players with the highest fan following on social media","link":"https://www.sportskeeda.com/cricket/5-young-indian-ipl-2023-players-highest-fan-following-social-media","keywords":["Cricket"],"creator":["Vikram Bhattacharya"],"video_url":null,"description":null,"content":"Social Media has become the yardstick for measuring the popularity of a luminary in this generation. It has brought closure between fans and their favorite cricketers while enabling players to keep fans updated on different aspects of their daily life. In today's digital world, it has become imperative for cricketers to remain active on social media and wow fans with regular updates, be it posts, photos, or videos. This includes posting pictures of their workouts to the different hairstyles they sport and posting pictures and videos with their loved ones. The most renowned Indian cricketers have millions of followers on social media and provide toing moments to their fans with regular updates. Most of them have stepped up to keep fans fulfilled with regular updates on their social media handles through quotes, videos, photos, memes, etc. The IPL has been one of the most Macho tournaments in all sports, with breathtaking action on the field and plenty off the field on various social media forums like Twitter and Instagram. The players have used social media to build their brands, achieve popularity and become icons. This allows them to #StayToing amongst fans to achieve cult status in the cricketing world. While Virat Kohli is the most popular Indian cricketer with 55.6 Million Twitter followers and 264 Million Instagram followers, plenty of young Indian players have also taken to social media and increased their popularity in addition to the numerous toing moments on the field. Let's look at five young Indian IPL 2023 players with the highest fan following on social media. Shubman Gill has been the most impressive batsman among the young brigade of exciting batters from India, thereby becoming a fan favorite in quick time. Gill has been red hot form in the ongoing IPL season, scoring 469 runs at an average of 46.90 and a strike rate of 143.43. He has been instrumental in the Gujarat Titans (GT) sitting atop the points table with eight wins from eleven games. Gill has also been in scintillating form in Indian colors since the start of the year, with a combined average of 61.25 across formats, with five centuries. Indian fans hope Gill will #StayToing as they look to win the World Cup title at home later this year. Gill's batting style and charming personality have made the 23-year-old opening batter the most popular Indian cricketer among the next generation of young players, having 4.5 Million Instagram followers and 1 Million Twitter followers. Gill's macho swag combined with his lazy elegance in stroke play has made fans go #YehTohBadaToingHai . Earlier in the year, Gill smashed an ODI double-century and a T20I century against New Zealand at home, giving fans across the country plenty of toing moments. He also stroked an elegant century in the final test of the recently concluded Border Gavaskar Trophy against Australia in Ahmedabad. Instagram followers: 4.5 Million Twitter followers: 1 Million Mumbai Indians (MI) wicket-keeper batsman Ishan Kishan has been one of the most destructive young batters in Indian cricket. The left-hander has had a relatively quiet season thus far in the IPL, scoring 335 runs at an average of 30.18 and a strike rate of 142.55. Kishan was instrumental in MI's title run in 2020, scoring 516 runs at an average of 57.33 and a strike rate of 145.76. Nicknamed Pocket Dynamo, the 24-year-old made his white-ball debut for India in 2021. Boasting an excellent ODI average of 42.50 in 14 matches, Kishan provided fans with one of the #YehTohBadaToingHai moments over the past 12 months when he smashed the fastest ODI double century against Bangladesh in the final ODI of the three-match series. The left-hander scored 210 off 131 deliveries and reached his double-century in just 126 balls to break Chris Gayle's record and become only the fourth Indian to score a double-century. Kishan's diminutive look and aggressive stroke play at the top of the order have increased his popularity among fans, evidenced by 3.7 Million Instagram followers and 900K Twitter followers. Fans will hope Kishan regains his best form again and provides plenty of toing moments in the coming years. Instagram followers: 3.7 Million Twitter followers: 900.4 K Delhi Capitals (DC) opener Prithvi Shaw burst onto the national stage after leading India to the Under 19 World Cup title in 2018. Touted to be an heir apparent to former Indian opener Virender Sehwag, Shaw has been weighed down by the high expectations, leading him to be inconsistent for the Indian team and his franchise. The talented stroke maker has struggled for form in the ongoing IPL, scoring just 47 runs in six innings before eventually being dropped from the DC playing XI. Shaw had a spectacular start to his International career, with a century on debut against the West Indies in 2018, making him the youngest Indian to score a test century in a #YehTohBadaToingHai moment. However, the 23-year-old has struggled for consistency and has not featured for India since 2021. Despite that, Prithvi Shaw remains among the most popular young cricketers, thanks to his classy and attacking strokeplay. Shaw also has provided fans with plenty of toing moments with regular updates in his social media forum, making him among the most followed young Indian players, with 1.6 Million Instagram followers and 592.4 K Twitter followers. Fans will hope Shaw regains his macho and swag back to provide more wow moments with the bat and storm his way back into the Indian team. Instagram followers: 1.6 Million Twitter followers: 592.4 K Sunrisers Hyderabad (SRH) all-rounder Washington Sundar is the next in line of a long list of Indian spin-bowling all-rounders after Ravichandran Ashwin, Ravindra Jadeja, and Axar Patel. Sundar is one of the most soft-spoken youngsters who has made his mark already at different stages across formats for India. Despite being just 23 years of age, Sundar has picked up over 50 wickets for India and scored five half-centuries. Unfortunately, the young off-spinner has been ruled out of the remainder of the IPL with an injury. Indian fans will hope that Sundar recovers in time for the ODI World Cup at home in October. Instagram followers: 1.6 Million Twitter followers: 784 K Devdutt Padikkal has been among the most likable up-and-coming youngsters in the IPL. The 22-year-old started his IPL career with one of the most popular franchises, Royal Challengers Bangalore, before moving to the Rajasthan Royals in 2022. In his young IPL career, Padikkal has shown himself to be someone with a solid defensive technique and displayed great consistency from 2020 to 2022, with 350+ runs in all three years. Despite not being one of the wow players on the circuit, the left-hander has been touted as one of the upcoming young Indian batters, particularly in the longer format. Padikkal has been among the most likable young players thanks to his calm demeanor and easy-going personality. Instagram followers: 1.6 Million Twitter followers: 257.5 K Which IPL 2023 player do you think is a social media king? Let us know what you think. #StayToing #SportoMacho Come #StayToing and get the best Athleisure wear at www.sporto.in . Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 18:26:20","image_url":"https://staticc.sportskeeda.com/editor/2023/05/5f4d3-16850196276633-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Top moments where fans showcased their fandom for cricket","link":"https://www.sportskeeda.com/cricket/top-moments-fans-showcased-fandom-cricket","keywords":["Cricket"],"creator":["Vikram Bhattacharya"],"video_url":null,"description":null,"content":"Cricket is one of the most-followed sports in the world. With the introduction of T20 leagues, the fan following of cricket has increased significantly in recent years. T20 tournaments like the Indian Premier League attract a lot of viewership, with new TV and digital streaming records being created every now and then. Fans also show up in large numbers to cheer for their favorite teams at the stadiums. Whenever a cricket fan visits a stadium to watch a match live, he or she try their best to showcase their fandom in a Toing way. Here’s a list of five such moments where fans showcased their fandom for cricketers in a #StayToing way. IPL franchise Royal Challengers Bangalore have created many Toing Moments in the league’s history. Ever since their debut in IPL 2008, RCB have been one of the most popular franchises. However, the Bangalore-based team has never been able to win a championship. RCB qualified for the finals in 2009, 2011 and 2016 but lost the summit clash in all three editions. Still, they continue to have a large and loyal fanbase. During an IPL match last season, a woman was spotted at the stadium with a toing poster that read, “Not gettin’ married till RCB wins IPL.” Quite a few foreign players have earned a massive fan following by performing well in the Indian Premier League. One of them is England’s star opener Jos Buttler, who plays for the Rajasthan Royals. Before RR’s away game against Gujarat Titans in IPL 2023, a young female fan got a chance to meet Buttler at the Narendra Modi Stadium. She became very emotional as she interacted with the English star, got his autograph and also clicked a picture with him. Back in IPL 2019, Deepika Ghose become an overnight social media sensation after she appeared on camera, cheering for the Royal Challengers Bangalore at the M Chinnaswamy Stadium. Ghose earns thousands of Instagram followers after the cameramen showed her on the big screen. She became famous as #TheRCBGirl, and four years later, she continues to #StayToing when it comes to supporting RCB at home. During the IPL 2019 season, Chennai Super Kings captain MS Dhoni met one of his oldest fans at the Wankhede Stadium. After the match between CSK and MI ended, Dhoni saw an elderly woman waiting outside. A young girl accompanied her. They had a poster which said that they were there only for MS Dhoni. The CSK captain did not disappoint them as he had a five-minute chat with them and also gave them a Toing autograph. As mentioned ahead, Royal Challengers Bangalore have a massive fan following in the league. During a match between RCB and Lucknow Super Giants at the M Chinnaswamy Stadium, a heartbroken RCB fan’s reactions went viral on the internet. LSG beat RCB by one wicket in a nail-biting thriller that night. The cameramen captured an emotional fan’s disappointment, and the images went viral on social media. Which franchise do you think has the biggest fanbase in IPL 2023? Let us know what you think. #StayToing #SportoMacho Come #StayToing and get the best Athleisure wear at www.sporto.in . Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 18:13:37","image_url":"https://staticc.sportskeeda.com/editor/2023/05/d72af-16850190528152-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Decision on Asia Cup venue after IPL final: Jay Shah","link":"https://telanganatoday.com/decision-on-asia-cup-venue-after-ipl-final-jay-shah","keywords":["News","Sport","Asia Cup","BCCI","Jay Shah"],"creator":["PTI"],"video_url":null,"description":"It has been learnt from ACC sources that Sethi's proposed hybrid model looks like a feasible solution although ACC had made no formal statements","content":"Home | Sport | Decision On Asia Cup Venue After Ipl Final Jay Shah Decision on Asia Cup venue after IPL final: Jay Shah It has been learnt from ACC sources that Sethi's proposed hybrid model looks like a feasible solution although ACC had made no formal statements By PTI Published Date - 11:30 PM, Thu - 25 May 23 File Photo New Delhi: A decision on Asia Cup’s fate will be taken on the sidelines of the IPL final, which will be attended by a host of top Asian Cricket Council (ACC) dignitaries, BCCI secretary Jay Shah said on Thursday. Pakistan have the hosting rights for this year’s Asia Cup but with BCCI deciding against sending its team to the neighbouring country without government permission, PCB chairman Najam Sethi had proposed a ‘hybrid model’ where they will organise at least four games on home soil and India will play their matches at a neutral venue. It couldn’t be confirmed whether Sethi has been formally invited for the IPL final. “As of now, the decision with regards to hosting of Asia Cup hasn’t yet been finalised. We are busy with IPL but the top dignitaries of Sri Lanka Cricket (SLC), Bangladesh and Afghanistan Cricket Board are coming to watch the IPL final. We will have a discussion and take a final decision in due course,” Jay Shah said. It has been learnt from ACC sources that Sethi’s proposed hybrid model looks like a feasible solution although ACC had made no formal statements. According to the model, Sri Lanka, Bangladesh, Nepal and Afghanistan play four preliminary matches in Pakistan and India would play all their games at neutral venues. The two India-Pakistan games will also be held in Sri Lanka although the PCB wants them in Dubai. The weather in UAE in September is not at all conducive for 50-over games although to make the ‘hybrid model’ work logistically, UAE is a far better option for the Asian Cricket Council. “ACC head Jay Shah will summon an executive body meeting where a formal announcement will take place. The PCB doesn’t mind playing India at a neutral venue. “PCB would prefer Dubai because it would lead to more gate receipts but it is open to playing in another country (read Sri Lanka) provided the ACC matches the gate receipts amount ($5 million) that Sri Lanka Cricket (SLC) received in 2022 from the Indo-Pak games in Dubai,” an ACC source privy to development said on conditions of anonymity. The six teams in the Asia Cup are India, Pakistan, Sri Lanka, Bangladesh, Afghanistan and Nepal. One group will have India, Pakistan and Nepal while the other group will comprise Sri Lanka, Bangladesh and Afghanistan. Also Read Jay Shah trends on Twitter after being elected as head of ICC’s F&CA Committee BCCI hikes cash prize for domestic tournaments Follow Us : Tags Asia Cup BCCI Jay Shah Related News ICC charges umpire Jatin Kashyap for breaching anti-corruption code BCCI to form World Cup Working Group at SGM Ishan Kishan replaces injured KL Rahul in WTC Final squad Rishabh Pant walks on his own, declares he is crutches-free in major recovery milestone BCCI starts search for India women’s team head coach Harmanpreet, Smriti in top grade of BCCI central contracts; Shikha, Poonam miss out","pubDate":"2023-05-25 18:00:21","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"EXPLAINED: Did MS Dhoni Intentionally Waste Time To Let Matheesha Pathirana Bowl During Qualifier 1 vs GT?","link":"https://zeenews.india.com/cricket/explained-was-ms-dhoni-at-fault-for-wasting-time-to-let-matheesha-pathirana-bowl-during-qualifier-1-vs-gt-2613509.html","keywords":null,"creator":null,"video_url":null,"description":"Dhoni has been criticised and praised equally for his delaying tactic to ensure his death overs' specialist Pathirana bowled the 16th over of the chase vs Gujarat Titans.","content":"From the time Chennai Super Kings (CSK) beat Gujarat Titans (GT) in IPL 2023 Qualifier 1 on Tuesday, fans are divided over MS Dhoni's tactics of delaying the resumption of the game to let his death over specialist bowl a crucial over in the tense chase. One still does not know whether it was a tactic from Dhoni or not. The social media however sees it that way. While one section of fans and experts called it a tactic, praising Dhoni's genius to ensure his team went past the finish line. On the other hand, critics are slamming him for using unjust methods to win games. Also Read | MS Dhoni's CSK Probable Playing 11 For IPL 2023 Final What's the matter really? Needing 71 runs to win off the last 30 balls, Dhoni called Pathirana, who was out of the field for some time, to bowl the 16th over of the innings. Pathirana had left the field some time after bowling 12th over and it had been little more than four minutes since his return to the ground when Dhoni asked him to bowl the 16th. While going to the run-up, umpire Anil Chaudhary, who was at the non-striker's end, stopped Pathirana to discuss something. A confused Dhoni walked up to the square leg umpire to understand the matter. Umpires told Dhoni that they cannot allow Pathirana to bowl as he needed to spend four more minutes on the field to do the same. IPL playing conditions say that when a player leaves the field because of an injury or any other reason for more than eight minutes, they need to on the field for a similar duration before being allowed to bowl. The commentators also spoke of the same rule on air. Pathirana was out of the field for 4 minutes and according to the Rule if you are a bowler n you are out for 4 minutes, you have to be on field for 4 minutes before you bowl. Guess what Ms dhoni did for the next 4 minutes__ pic.twitter.com/n6KUfRhpjv — _________ (@SergioCSKK) May 24, 2023 What Dhoni told umpires? Dhoni argued that he was helpless as he had no other option to bowl the 16th over other than Pathirana. As per ESPNcricinfo, Dhoni told umpires that his other best options - Ravindra Jadeja, Maheesh Theekshana, Deepak Chahar - had completed their quota of overs and he could not afford giving the ball to off-spinner Moeen Ali against two right-handers of GT in the middle. Moeen had not bowled a single over by this point. The argument went on and on and eventually the remaining four minutes that was required to be spent on the field by Pathirana were completed. The CSK pacer eventually bowled the 16th over. Chennai won the match by 15 runs. Umpires could have penalised CSK The umpires could have considered penalising CSK, as per the law. While the umpires did not allow CSK to keep five players outside the 30-yard-circle for the 20th over, CSK were not hurt by a financial penalty. As per Law 41.9, umpires can issue a warning to fielding captain if his side is deliberately spotted wasting time. If the same side repeats the offence, umpires can award five runs to the batting side. CSK escaped this penalty as well.","pubDate":"2023-05-25 17:54:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Jason Roy set to terminate his incremental contract with ECB to play in MLC - Reports","link":"https://www.sportskeeda.com/cricket/rumour-jason-roy-set-terminate-incremental-contract-ecb-play-mlc-reports","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"England's swashbuckling opener Jason Roy could terminate his incremental contract with England and Wales Cricket Board (ECB). According to the Daily Mail, the right-handed batter has got a lucrative offer to play in the inaugural season of the United States-based Major League Cricket. The six-team tournament will be played from July 13 to 30 at Grand Prairie Stadium in Texas. MLC will clash with the semifinal and finals of the T20 Blast on July 15. Meanwhile, there are County Championship fixtures between July 15 and 30. Moreover, The Hundred is slated to start on August 1. So, ECB is unlikely to give a no-objection certificate to Roy to play in the US. For the unversed, England's contracts run from October to September. A release from an incremental deal at this stage would cost £20,000 as against the £66,000 deal signed by Roy. Amid growing reports of England's white-ball players linked to overseas T20 leagues , the ECB is in the process of revamping their central contract. England Increment Contracts (2022-23): Harry Brook, Dawid Malan, Matthew Potts, Jason Roy, Reece Topley, David Willey England Annual Central Contracts: Moeen Ali, James Anderson, Jofra Archer, Jonathan Bairstow, Stuart Broad, Jos Buttler, Zak Crawley, Sam Curran, Ben Foakes, Jack Leach, Liam Livingstone, Ollie Pope, Adil Rashid, Ollie Robinson, Joe Root, Ben Stokes, Chris Woakes, Mark Wood As per ESPNCricinfo, Jason Roy might play for LA Knight Riders in MLC between the end of the T20 Blast and the start of The Hundred. The 32-year-old will bring the experience of playing in T20 leagues like the Pakistan Super League , Big Bash League , Bangladesh Premier League and The Hundred. The Surrey batter is one of the leading run-scorers in T20 cricket, amassing 8395 runs in 321 games at a strike rate of 27.98, including six centuries and 55 fifties. Jason Roy recently played for Kolkata Knight Riders in IPL 2023 after being bought as a replacement for Bangladesh all-rounder Shakib Al Hasan, who didn’t participate in the T20 tournament due to international commitments. He amassed 285 runs in eight games at a decent strike rate of 151.59, including a couple of half-centuries. Apart from Roy, Topley has not signed a deal in MLC but might consider his options. He recently underwent surgery and undergoing rehabilitation after a shoulder injury during IPL 2023. Meanwhile, star T20 players Marcus Stoinis, Quinton de Kock, Anrich Nortje, Wanindu Hasaranga, Glenn Phillips and Unmukt Chand have signed deals in MLC. Trent Boult and Adam Zampa are also likely to join MLC ahead of the tournament. Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 17:40:52","image_url":"https://staticc.sportskeeda.com/editor/2023/05/5bcd0-16850175791889-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Akash Madhwal - tennis-ball cricketer who entered IPL record books","link":"https://www.dailymirror.lk/sports/Akash-Madhwal---tennis-ball-cricketer-who-entered-IPL-record-books/322-259858","keywords":null,"creator":null,"video_url":null,"description":"Akash Madhwal was working as an engineer and playing tennis-ball cricket just a few years ago -- now he is in the Indian Premier League record books.","content":"Akash Madhwal was working as an engineer and playing tennis-ball cricket just a few years ago -- now he is in the Indian Premier League record books. The 29-year-old fast bowler returned stunning figures of 5-5 in the playoffs to lead five-time champions Mumbai Indians to victory over Lucknow Super Giants on Wednesday. Mumbai will face Gujarat Titans on Friday for a place in Sunday's final against Chennai Super Kings. With Jasprit Bumrah and Jofra Archer both out injured, the previously unheralded Madhwal has grabbed his chance to shine. He joined Mumbai last year as an injury replacement but remained confined to playing practice matches, before skipper Rohit Sharma introduced him to the big stage this season. “The team has given me the responsibility so I am trying to do it,” Madhwal told reporters after his man-of-the-match performance. “It's not that I can take his (Bumrah's) place, but whatever I can do in my capacity, I am doing.” Madhwal's route into IPL folklore -- the first to take a five-wicket haul in the playoffs -- came by way of an unusual path. He was working as a civil engineer when he quit a steady job and joined his state team, before the IPL came calling. “Cricket is my passion and not a burden,” he said. “So I am enjoying cricket after leaving engineering and a job to follow my passion without having much at home.” Madhwal is also a product of tennis-ball cricket, a variant of the sport using tennis balls. It is popular among budding cricketers across India and Madhwal said it played a part in his breakout display. “I have learnt to bowl yorkers in tennis-ball cricket and I try to implement that (here) because that's the only ball to save yourself (from getting hit for runs),” said Madhwal, who hails from the north Indian state of Uttarakhand. “My strength is my yorker and bhaiyya ( “brother” Rohit) used me where my strength lies and where the team needs me.” His feat on Wednesday came on the back of 4-37 against Sunrisers Hyderabad -- eclipsed only by Mumbai big-buy Cameron Green's match-winning 100 not out. 'Grab your opportunity' - Standing at 1.75 metres (five feet and nine inches), Madhwal is not your usual tall and burly fast bowler, but his accuracy and grit more than makes up for the lack of size. “We knew what he had, and we needed somebody to bowl at the back end,” said Rohit. “Having seen him, I was confident he could get the job done for us.” The bearded and often-smiling Madhwal struck twice in two balls, including getting the dangerous Nicholas Pooran out, caught behind for a duck to break Lucknow's back. Former India quick Zaheer Khan tweeted: “Looking forward to a lot more from the young lad.” Opportunity has not come easy for Madhwal. He played as a net bowler for Royal Challengers Bangalore in 2019 before joining Mumbai in the same capacity. But Madhwal, who has led his state team in the 50-overs format, said he never lost hope. “When a scouting team picks you as a net bowler, they give you a chance as well as one has to showcase your skills in the practice matches and show your potential,” he said. “It's just about grabbing your opportunity. “ (AFP)","pubDate":"2023-05-25 17:26:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_52fcf3f829.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"IPL 2023 Final Tickets: Chaos At Narendra Modi Stadium Amid Rush To Collect Print Tickets","link":"https://zeenews.india.com/cricket/ipl-2023-final-tickets-chaos-at-narendra-modi-stadium-amid-rush-to-collect-print-tickets-to-watch-ms-dhonis-chennai-super-kings-2613522.html","keywords":null,"creator":null,"video_url":null,"description":"MS Dhoni's Chennai Supr Kings will be playing thir tenth final on May 28 at Ahmedabad. It is likely to be the last final Dhoni plays and fans are leaving no stone unturned to watch him play for the one last time.","content":"With MS Dhoni set to play another Indian Premier League final, there is a huge demand among the fans for the summit clash of the sixteenth edition of the tournament. The excitement led to a big chaos taking place at the Narendra Modi stadium as fans struggled to collect their tickets. BCCI has partnered with PayTm to sell the online tickets. However, even afer booking their seats, the spectators need to collect the physical copy from the stadium. Thanks to this rule, there were big queues in front of the ticket office at the stadium as fans stood under the sun, waiting for their turn. A video went viral on the internet in which one can see a chaos taking pace at the venue. Also Read | EXPLAINED: Was MS Dhoni At Fault For Wasting Time To Let Matheesha Pathirana Bowl During Qualifier 1 vs GT Fans angry at board for mismanagement The biggest stakeholders in Indian cricket, the fans, felt cheated on knowing that they are required to collect physical copies of their tickets. A fan, in a video posted on Twitter, was heard saying that he paid the connvenience fee to the ticket-booking website and yet he was at the stadium, standing in a long queue, to collect a physical copy, without which he would not be allowed inside the stadium to watch the final. There were other tweets, which we have mentioned below, in which fans are upset with the ticket booking process. A fan alleged that tickets went missing seconds after they were open for sale. Also Read | MS Dhoni's CSK Probable Playing 11 For IPL 2023 Final Take a look at fans' frustration on buying IPL 2023 final tickets. Look at the scenarios personal experience of ticket buying problems created by paytm final tickets after buying tickets and taking payment these are the problems we are facing @IPL @JayShah @GCAMotera . pic.twitter.com/H8G3LvxcWi — Rahul Modi (@rahulm0902) May 25, 2023 Hey @paytminsider in the ipl final booking ticket page it is showing coming soon, will the ticket window again open? pic.twitter.com/1Xmj7Ypsl7 — Himanshu jain (@himanshu_jain7) May 25, 2023 View this post on Instagram A post shared by Viral Bhayani (@viralbhayani) CSK await the winner of Qualifier 2 in the final Chennai booked their place in the final by beating Gujarat Titans in the Qualifier 1. Titans will play Mumbai Indians in Qualifier 2 and the winner of this match will meet CSK at Narendra Modi stadium in Ahmedabad. Earlier, MI had beaten Lucknow Super Giants in Eliminator to earn a spot in the next round of the playoffs.","pubDate":"2023-05-25 17:22:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"World Cup 2023 में खेलने पर इंग्लैंड के क्रिकेटर का दो टूक जवाब, सेंट्रल कॉन्ट्रैक्ट से हटने का लिया फैसला","link":"https://www.indiatv.in/sports/cricket/jason-roy-confirms-on-leaving-england-central-contract-answers-on-playing-odi-world-cup-2023-2023-05-25-963652","keywords":null,"creator":null,"video_url":null,"description":"इंग्लैंड के एक स्टार क्रिकेटर ने सेंट्रल कॉन्ट्रैक्ट से हटने का फैसला किया है। ठीक ट्रेंट बोल्ट की राह पर ही यह क्रिकेटर है। वनडे वर्ल्ड कप खेलने को लेकर भी उन्होंने जवाब दिया है।","content":"दुनियाभर में फ्रेंचाइजी क्रिकेट के बढ़ते स्कोप के कारण पिछले कुछ सालों में कई बड़े क्रिकेटर ने अपने देश का कॉन्ट्रैक्ट छोड़कर लीग क्रिकेट को तवज्जो दी है। न्यूजीलैंड के स्टार पेसर ट्रेंट बोल्ट ने पिछले साल यह बड़ा फैसला लिया था लेकिन हाल ही में वर्ल्ड कप के लिए उन्होंने खुद को मौजूद बताया था। इसी राह पर अब इंग्लैंड को 2019 वर्ल्ड कप में चैंपियन बनाने में अहम भूमिका निभाने वाला एक क्रिकेटर चल पड़ा है। उन्होंने भी ऐसा ही कुछ फैसला किया है और देश के सेंट्रल कॉन्ट्रैक्ट से हटते हुए खुद को फ्रेंचाइजी क्रिकेट के लिए उपलब्ध करार दिया है। अभी तक यह रिपोर्ट थी लेकिन अब इंग्लिश क्रिकेटर ने यह खुद साफ कर दिया है। दरअसल हम बात कर रहे हैं इंग्लैंड के जेसन रॉय की जिनके बारे में हमने पहले एक रिपोर्ट के आधार पर बताया था कि वह इंग्लैंड क्रिकेट बोर्ड (ECB) का सेंट्रल कॉन्ट्रैक्ट छोड़ सकते हैं। अब इस क्रिकेटर ने ऐसा ही किया है और सेंट्रल कॉन्ट्रैक्ट से हटने का मन बना लिया है। वहीं इस साल भारत में होने वाले वनडे वर्ल्ड कप 2023 को लेकर भी इस स्टार ओपनर ने अपना जवाब दिया है। उन्होंने इंस्टाग्राम स्टोरी पर एक लंबा-चौड़ा नोट लिखा और इस बारे में विस्तार से पूरी जानकारी दी। उन्होंने बताया कि, वह इंग्लैंड क्रिकेट से दूर नहीं जा रहे हैं। उन्होंने ईसीबी के साथ मेजर लीग क्रिकेट में खेलने पर चर्चा की और बचे हुए साल के लिए बोर्ड उन्हें वेतन नहीं देगा यानी वह कॉन्ट्रैक्ट से हट रहे हैं। इसके अलावा उन्होंने यह भी कहा कि वह एक फॉर्मेट के खिलाड़ी हैं तो वह अन्य लीग में खेलेंगे और इंग्लैंड क्रिकेट इसके लिए उन्हें पे नहीं करेगा। इस पर बोर्ड की भी रजामंदी है। साल 2019 में इंग्लैंड वर्ल्ड चैंपियन बनी थी और उसमें रॉय का बहुमूल्य योगदान रहा था। उन्होंने इस साल होने वाले वर्ल्ड कप को लेकर कहा है कि, वह इंग्लैंड क्रिकेट को ही प्राथमिकता देंगे। इस साल वर्ल्ड कप होना है तो उनका ध्यान पूरी तरह से उस पर है। यह मेरे ही नहीं किसी भी खिलाड़ी के लिए गर्व की बात है उसे किसी देश के लिए खेलने का मौका मिले और इंटरनेशनल कैप मिले। अपने देश का प्रतिनिधित्व करना मेरे लिए गर्व की बात है। मैं जितने साल तक खेल सकता हूं इंग्लैंड के लिए ही खेलना चाहता हूं। मैं बतौर एक फॉर्मेट खिलाड़ी बिना कॉन्ट्रैक्ट के मौजूद रहूंगा। मैं बाकी प्रतियोगिताओं (लीग क्रिकेट) में खेलूंगा पर ध्यान रहेगा कि यह इंग्लैंड क्रिकेट के शेड्यूल के साथ भिड़े ना। विभिन्न प्रतियोगिताओं में खेलने से मुझे इंग्लैंड के क्रिकेटर के तौर पर भी मदद मिलेगी। गौरतलब है कि डेली मेल ने एक रिपोर्ट शेयर की थी जिसमें बताया गया था कि जेसन रॉय को मेजर लीग क्रिकेट (यूएसए टी20 लीग) की फ्रेंचाइजी लॉस एंजेलेस नाइट राइडर्स ने 3 लाख पाउंड (3.6 करोड़) का कॉन्ट्रैक्ट दिया है। इसको रॉय ने स्वीकार भी कर लिया है। इस लीग का पहला एडीशन इस साल गर्मियों में खेला जाएगा। इसमें भारत की मशहूर टी20 लीग आईपीएल की चार फ्रेंचाइजीज की टीमें होने की भी खबर है। एलए नाइटराइडर्स आईपीएल टीम कोलकाता नाइट राइडर्स की ही फ्रेंचाइजी है जिसके मालिक शाहरुख खान और जूही चावला हैं। जेसन रॉय आईपीएल में भी इसी टीम का हिस्सा हैं। आईपीएल 2023 के कुछ मैचों में उनका प्रदर्शन भी शानदार रहा था।","pubDate":"2023-05-25 16:16:54","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pramodya to continue in SLC Ex-Co until minister appoints new selection committee","link":"https://www.dailymirror.lk/breaking_news/Pramodya-to-continue-in-SLC-Ex-Co-until-minister-appoints-new-selection-committee/108-259854","keywords":null,"creator":null,"video_url":null,"description":"The Sri Lanka Cricket (SLC) Executive Committee has appointed Lasantha Wickremesinghe to the vacant Assistant Treasurer position, which was unfilled at the SLC Annual General Meeting last Saturday.","content":"The Sri Lanka Cricket (SLC) Executive Committee has appointed Lasantha Wickremesinghe to the vacant Assistant Treasurer position, which was unfilled at the SLC Annual General Meeting last Saturday. Wickremesinghe is understood to have withdrawn his name for the post of Treasurer at the AGM, with Sujeewa Godaliyadda taking over that position, but has now been appointed as the Assistant Treasurer. Pramodya Wickramasinghe will continue to represent the national selection committee in the SLC Ex-Co, until a fresh selection committee is appointed by the Minister. Mr. Shammi Silva - President Mr. Ravin Wickramaratne - Vice President Dr. Jayantha Dharmadasa- Vice President Mr. Thilak Waththuhewa Vice President - School Cricket Mr. Mohan de Silva Honorary Secretary Mr. Chryshantha Kapuwatte Honorary Assistant Secretary Mr. Sujeeva Godaliyadda Treasurer Mr. Lasantha Wickramasinghe Assistant Treasurer Mr. Pramodya Wickramasinghe Chairman – Selection Committee of Sri Lanka Cricket Mr. Bandula Dissanayake Chairman – Umpires Committee of Sri Lanka Cricket Mr. Samantha Dodanwela Chairman – Tournament Committee of Sri Lanka Cricket Mr. Janaka Pathirana Member- (Representative – District and Provincial Cricket Associations) Mr. Nalin Aponso Member (Representative- Nationalised Services Cricket Association) Mr. Nalin Wickremasinghe Member (Representative- Mercantile Cricket Association) Mr. Kithsiri de Silva Member (Representative – Controlling Clubs) Mr. Marlon Ranasinghe Member (Representative – Controlling Clubs) Mr. Priyantha Algama Member (Representative –Affiliated Clubs) Mr. Sudath Chandrasekara Member (Representative - Ministry of Sports and Youth Affairs)","pubDate":"2023-05-25 15:59:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_cf32824343.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Watch: Suryakumar's 'Lemon' Prank On MI Teammate Will Leave You In Splits","link":"https://sports.ndtv.com/cricket/suryakumar-yadavs-lemon-prank-on-mi-teammate-will-leave-you-in-splits-watch-4065859","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Indians kept the search for their sixth IPL title alive with an 81-run victory over Lucknow Super Giants on Wednesday","content":null,"pubDate":"2023-05-25 15:55:36","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"5 young Indian IPL 2023 players with the highest fan following on social media","link":"https://www.sportskeeda.com/cricket/5-young-indian-ipl-2023-players-highest-fan-following-social-media","keywords":["Cricket"],"creator":["Vikram Bhattacharya"],"video_url":null,"description":null,"content":"Social Media has become the yardstick for measuring the popularity of a luminary in this generation. It has brought closure between fans and their favorite cricketers while enabling players to keep fans updated on different aspects of their daily life. In today's digital world, it has become imperative for cricketers to remain active on social media and wow fans with regular updates, be it posts, photos, or videos. This includes posting pictures of their workouts to the different hairstyles they sport and posting pictures and videos with their loved ones. The most renowned Indian cricketers have millions of followers on social media and provide toing moments to their fans with regular updates. Most of them have stepped up to keep fans fulfilled with regular updates on their social media handles through quotes, videos, photos, memes, etc. The IPL has been one of the most Macho tournaments in all sports, with breathtaking action on the field and plenty off the field on various social media forums like Twitter and Instagram. The players have used social media to build their brands, achieve popularity and become icons. This allows them to #StayToing amongst fans to achieve cult status in the cricketing world. While Virat Kohli is the most popular Indian cricketer with 55.6 Million Twitter followers and 264 Million Instagram followers, plenty of young Indian players have also taken to social media and increased their popularity in addition to the numerous toing moments on the field. Let's look at five young Indian IPL 2023 players with the highest fan following on social media. Shubman Gill has been the most impressive batsman among the young brigade of exciting batters from India, thereby becoming a fan favorite in quick time. Gill has been red hot form in the ongoing IPL season, scoring 469 runs at an average of 46.90 and a strike rate of 143.43. He has been instrumental in the Gujarat Titans (GT) sitting atop the points table with eight wins from eleven games. Gill has also been in scintillating form in Indian colors since the start of the year, with a combined average of 61.25 across formats, with five centuries. Indian fans hope Gill will #StayToing as they look to win the World Cup title at home later this year. Gill's batting style and charming personality have made the 23-year-old opening batter the most popular Indian cricketer among the next generation of young players, having 4.5 Million Instagram followers and 1 Million Twitter followers. Gill's macho swag combined with his lazy elegance in stroke play has made fans go #YehTohBadaToingHai . Earlier in the year, Gill smashed an ODI double-century and a T20I century against New Zealand at home, giving fans across the country plenty of toing moments. He also stroked an elegant century in the final test of the recently concluded Border Gavaskar Trophy against Australia in Ahmedabad. Instagram followers: 4.5 Million Twitter followers: 1 Million Mumbai Indians (MI) wicket-keeper batsman Ishan Kishan has been one of the most destructive young batters in Indian cricket. The left-hander has had a relatively quiet season thus far in the IPL, scoring 335 runs at an average of 30.18 and a strike rate of 142.55. Kishan was instrumental in MI's title run in 2020, scoring 516 runs at an average of 57.33 and a strike rate of 145.76. Nicknamed Pocket Dynamo, the 24-year-old made his white-ball debut for India in 2021. Boasting an excellent ODI average of 42.50 in 14 matches, Kishan provided fans with one of the #YehTohBadaToingHai moments over the past 12 months when he smashed the fastest ODI double century against Bangladesh in the final ODI of the three-match series. The left-hander scored 210 off 131 deliveries and reached his double-century in just 126 balls to break Chris Gayle's record and become only the fourth Indian to score a double-century. Kishan's diminutive look and aggressive stroke play at the top of the order have increased his popularity among fans, evidenced by 3.7 Million Instagram followers and 900K Twitter followers. Fans will hope Kishan regains his best form again and provides plenty of toing moments in the coming years. Instagram followers: 3.7 Million Twitter followers: 900.4 K Delhi Capitals (DC) opener Prithvi Shaw burst onto the national stage after leading India to the Under 19 World Cup title in 2018. Touted to be an heir apparent to former Indian opener Virender Sehwag, Shaw has been weighed down by the high expectations, leading him to be inconsistent for the Indian team and his franchise. The talented stroke maker has struggled for form in the ongoing IPL, scoring just 47 runs in six innings before eventually being dropped from the DC playing XI. Shaw had a spectacular start to his International career, with a century on debut against the West Indies in 2018, making him the youngest Indian to score a test century in a #YehTohBadaToingHai moment. However, the 23-year-old has struggled for consistency and has not featured for India since 2021. Despite that, Prithvi Shaw remains among the most popular young cricketers, thanks to his classy and attacking strokeplay. Shaw also has provided fans with plenty of toing moments with regular updates in his social media forum, making him among the most followed young Indian players, with 1.6 Million Instagram followers and 592.4 K Twitter followers. Fans will hope Shaw regains his macho and swag back to provide more wow moments with the bat and storm his way back into the Indian team. Instagram followers: 1.6 Million Twitter followers: 592.4 K Sunrisers Hyderabad (SRH) all-rounder Washington Sundar is the next in line of a long list of Indian spin-bowling all-rounders after Ravichandran Ashwin, Ravindra Jadeja, and Axar Patel. Sundar is one of the most soft-spoken youngsters who has made his mark already at different stages across formats for India. Despite being just 23 years of age, Sundar has picked up over 50 wickets for India and scored five half-centuries. Unfortunately, the young off-spinner has been ruled out of the remainder of the IPL with an injury. Indian fans will hope that Sundar recovers in time for the ODI World Cup at home in October. Instagram followers: 1.6 Million Twitter followers: 784 K Devdutt Padikkal has been among the most likable up-and-coming youngsters in the IPL. The 22-year-old started his IPL career with one of the most popular franchises, Royal Challengers Bangalore, before moving to the Rajasthan Royals in 2022. In his young IPL career, Padikkal has shown himself to be someone with a solid defensive technique and displayed great consistency from 2020 to 2022, with 350+ runs in all three years. Despite not being one of the wow players on the circuit, the left-hander has been touted as one of the upcoming young Indian batters, particularly in the longer format. Padikkal has been among the most likable young players thanks to his calm demeanor and easy-going personality. Instagram followers: 1.6 Million Twitter followers: 257.5 K Which IPL 2023 player do you think is a social media king? Let us know what you think. #StayToing #SportoMacho Come #StayToing and get the best Athleisure wear at www.sporto.in . Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 18:26:20","image_url":"https://staticc.sportskeeda.com/editor/2023/05/5f4d3-16850196276633-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Top moments where fans showcased their fandom for cricket","link":"https://www.sportskeeda.com/cricket/top-moments-fans-showcased-fandom-cricket","keywords":["Cricket"],"creator":["Vikram Bhattacharya"],"video_url":null,"description":null,"content":"Cricket is one of the most-followed sports in the world. With the introduction of T20 leagues, the fan following of cricket has increased significantly in recent years. T20 tournaments like the Indian Premier League attract a lot of viewership, with new TV and digital streaming records being created every now and then. Fans also show up in large numbers to cheer for their favorite teams at the stadiums. Whenever a cricket fan visits a stadium to watch a match live, he or she try their best to showcase their fandom in a Toing way. Here’s a list of five such moments where fans showcased their fandom for cricketers in a #StayToing way. IPL franchise Royal Challengers Bangalore have created many Toing Moments in the league’s history. Ever since their debut in IPL 2008, RCB have been one of the most popular franchises. However, the Bangalore-based team has never been able to win a championship. RCB qualified for the finals in 2009, 2011 and 2016 but lost the summit clash in all three editions. Still, they continue to have a large and loyal fanbase. During an IPL match last season, a woman was spotted at the stadium with a toing poster that read, “Not gettin’ married till RCB wins IPL.” Quite a few foreign players have earned a massive fan following by performing well in the Indian Premier League. One of them is England’s star opener Jos Buttler, who plays for the Rajasthan Royals. Before RR’s away game against Gujarat Titans in IPL 2023, a young female fan got a chance to meet Buttler at the Narendra Modi Stadium. She became very emotional as she interacted with the English star, got his autograph and also clicked a picture with him. Back in IPL 2019, Deepika Ghose become an overnight social media sensation after she appeared on camera, cheering for the Royal Challengers Bangalore at the M Chinnaswamy Stadium. Ghose earns thousands of Instagram followers after the cameramen showed her on the big screen. She became famous as #TheRCBGirl, and four years later, she continues to #StayToing when it comes to supporting RCB at home. During the IPL 2019 season, Chennai Super Kings captain MS Dhoni met one of his oldest fans at the Wankhede Stadium. After the match between CSK and MI ended, Dhoni saw an elderly woman waiting outside. A young girl accompanied her. They had a poster which said that they were there only for MS Dhoni. The CSK captain did not disappoint them as he had a five-minute chat with them and also gave them a Toing autograph. As mentioned ahead, Royal Challengers Bangalore have a massive fan following in the league. During a match between RCB and Lucknow Super Giants at the M Chinnaswamy Stadium, a heartbroken RCB fan’s reactions went viral on the internet. LSG beat RCB by one wicket in a nail-biting thriller that night. The cameramen captured an emotional fan’s disappointment, and the images went viral on social media. Which franchise do you think has the biggest fanbase in IPL 2023? Let us know what you think. #StayToing #SportoMacho Come #StayToing and get the best Athleisure wear at www.sporto.in . Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 18:13:37","image_url":"https://staticc.sportskeeda.com/editor/2023/05/d72af-16850190528152-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Decision on Asia Cup venue after IPL final: Jay Shah","link":"https://telanganatoday.com/decision-on-asia-cup-venue-after-ipl-final-jay-shah","keywords":["News","Sport","Asia Cup","BCCI","Jay Shah"],"creator":["PTI"],"video_url":null,"description":"It has been learnt from ACC sources that Sethi's proposed hybrid model looks like a feasible solution although ACC had made no formal statements","content":"Home | Sport | Decision On Asia Cup Venue After Ipl Final Jay Shah Decision on Asia Cup venue after IPL final: Jay Shah It has been learnt from ACC sources that Sethi's proposed hybrid model looks like a feasible solution although ACC had made no formal statements By PTI Published Date - 11:30 PM, Thu - 25 May 23 File Photo New Delhi: A decision on Asia Cup’s fate will be taken on the sidelines of the IPL final, which will be attended by a host of top Asian Cricket Council (ACC) dignitaries, BCCI secretary Jay Shah said on Thursday. Pakistan have the hosting rights for this year’s Asia Cup but with BCCI deciding against sending its team to the neighbouring country without government permission, PCB chairman Najam Sethi had proposed a ‘hybrid model’ where they will organise at least four games on home soil and India will play their matches at a neutral venue. It couldn’t be confirmed whether Sethi has been formally invited for the IPL final. “As of now, the decision with regards to hosting of Asia Cup hasn’t yet been finalised. We are busy with IPL but the top dignitaries of Sri Lanka Cricket (SLC), Bangladesh and Afghanistan Cricket Board are coming to watch the IPL final. We will have a discussion and take a final decision in due course,” Jay Shah said. It has been learnt from ACC sources that Sethi’s proposed hybrid model looks like a feasible solution although ACC had made no formal statements. According to the model, Sri Lanka, Bangladesh, Nepal and Afghanistan play four preliminary matches in Pakistan and India would play all their games at neutral venues. The two India-Pakistan games will also be held in Sri Lanka although the PCB wants them in Dubai. The weather in UAE in September is not at all conducive for 50-over games although to make the ‘hybrid model’ work logistically, UAE is a far better option for the Asian Cricket Council. “ACC head Jay Shah will summon an executive body meeting where a formal announcement will take place. The PCB doesn’t mind playing India at a neutral venue. “PCB would prefer Dubai because it would lead to more gate receipts but it is open to playing in another country (read Sri Lanka) provided the ACC matches the gate receipts amount ($5 million) that Sri Lanka Cricket (SLC) received in 2022 from the Indo-Pak games in Dubai,” an ACC source privy to development said on conditions of anonymity. The six teams in the Asia Cup are India, Pakistan, Sri Lanka, Bangladesh, Afghanistan and Nepal. One group will have India, Pakistan and Nepal while the other group will comprise Sri Lanka, Bangladesh and Afghanistan. Also Read Jay Shah trends on Twitter after being elected as head of ICC’s F&CA Committee BCCI hikes cash prize for domestic tournaments Follow Us : Tags Asia Cup BCCI Jay Shah Related News ICC charges umpire Jatin Kashyap for breaching anti-corruption code BCCI to form World Cup Working Group at SGM Ishan Kishan replaces injured KL Rahul in WTC Final squad Rishabh Pant walks on his own, declares he is crutches-free in major recovery milestone BCCI starts search for India women’s team head coach Harmanpreet, Smriti in top grade of BCCI central contracts; Shikha, Poonam miss out","pubDate":"2023-05-25 18:00:21","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"EXPLAINED: Did MS Dhoni Intentionally Waste Time To Let Matheesha Pathirana Bowl During Qualifier 1 vs GT?","link":"https://zeenews.india.com/cricket/explained-was-ms-dhoni-at-fault-for-wasting-time-to-let-matheesha-pathirana-bowl-during-qualifier-1-vs-gt-2613509.html","keywords":null,"creator":null,"video_url":null,"description":"Dhoni has been criticised and praised equally for his delaying tactic to ensure his death overs' specialist Pathirana bowled the 16th over of the chase vs Gujarat Titans.","content":"From the time Chennai Super Kings (CSK) beat Gujarat Titans (GT) in IPL 2023 Qualifier 1 on Tuesday, fans are divided over MS Dhoni's tactics of delaying the resumption of the game to let his death over specialist bowl a crucial over in the tense chase. One still does not know whether it was a tactic from Dhoni or not. The social media however sees it that way. While one section of fans and experts called it a tactic, praising Dhoni's genius to ensure his team went past the finish line. On the other hand, critics are slamming him for using unjust methods to win games. Also Read | MS Dhoni's CSK Probable Playing 11 For IPL 2023 Final What's the matter really? Needing 71 runs to win off the last 30 balls, Dhoni called Pathirana, who was out of the field for some time, to bowl the 16th over of the innings. Pathirana had left the field some time after bowling 12th over and it had been little more than four minutes since his return to the ground when Dhoni asked him to bowl the 16th. While going to the run-up, umpire Anil Chaudhary, who was at the non-striker's end, stopped Pathirana to discuss something. A confused Dhoni walked up to the square leg umpire to understand the matter. Umpires told Dhoni that they cannot allow Pathirana to bowl as he needed to spend four more minutes on the field to do the same. IPL playing conditions say that when a player leaves the field because of an injury or any other reason for more than eight minutes, they need to on the field for a similar duration before being allowed to bowl. The commentators also spoke of the same rule on air. Pathirana was out of the field for 4 minutes and according to the Rule if you are a bowler n you are out for 4 minutes, you have to be on field for 4 minutes before you bowl. Guess what Ms dhoni did for the next 4 minutes__ pic.twitter.com/n6KUfRhpjv — _________ (@SergioCSKK) May 24, 2023 What Dhoni told umpires? Dhoni argued that he was helpless as he had no other option to bowl the 16th over other than Pathirana. As per ESPNcricinfo, Dhoni told umpires that his other best options - Ravindra Jadeja, Maheesh Theekshana, Deepak Chahar - had completed their quota of overs and he could not afford giving the ball to off-spinner Moeen Ali against two right-handers of GT in the middle. Moeen had not bowled a single over by this point. The argument went on and on and eventually the remaining four minutes that was required to be spent on the field by Pathirana were completed. The CSK pacer eventually bowled the 16th over. Chennai won the match by 15 runs. Umpires could have penalised CSK The umpires could have considered penalising CSK, as per the law. While the umpires did not allow CSK to keep five players outside the 30-yard-circle for the 20th over, CSK were not hurt by a financial penalty. As per Law 41.9, umpires can issue a warning to fielding captain if his side is deliberately spotted wasting time. If the same side repeats the offence, umpires can award five runs to the batting side. CSK escaped this penalty as well.","pubDate":"2023-05-25 17:54:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Jason Roy set to terminate his incremental contract with ECB to play in MLC - Reports","link":"https://www.sportskeeda.com/cricket/rumour-jason-roy-set-terminate-incremental-contract-ecb-play-mlc-reports","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"England's swashbuckling opener Jason Roy could terminate his incremental contract with England and Wales Cricket Board (ECB). According to the Daily Mail, the right-handed batter has got a lucrative offer to play in the inaugural season of the United States-based Major League Cricket. The six-team tournament will be played from July 13 to 30 at Grand Prairie Stadium in Texas. MLC will clash with the semifinal and finals of the T20 Blast on July 15. Meanwhile, there are County Championship fixtures between July 15 and 30. Moreover, The Hundred is slated to start on August 1. So, ECB is unlikely to give a no-objection certificate to Roy to play in the US. For the unversed, England's contracts run from October to September. A release from an incremental deal at this stage would cost £20,000 as against the £66,000 deal signed by Roy. Amid growing reports of England's white-ball players linked to overseas T20 leagues , the ECB is in the process of revamping their central contract. England Increment Contracts (2022-23): Harry Brook, Dawid Malan, Matthew Potts, Jason Roy, Reece Topley, David Willey England Annual Central Contracts: Moeen Ali, James Anderson, Jofra Archer, Jonathan Bairstow, Stuart Broad, Jos Buttler, Zak Crawley, Sam Curran, Ben Foakes, Jack Leach, Liam Livingstone, Ollie Pope, Adil Rashid, Ollie Robinson, Joe Root, Ben Stokes, Chris Woakes, Mark Wood As per ESPNCricinfo, Jason Roy might play for LA Knight Riders in MLC between the end of the T20 Blast and the start of The Hundred. The 32-year-old will bring the experience of playing in T20 leagues like the Pakistan Super League , Big Bash League , Bangladesh Premier League and The Hundred. The Surrey batter is one of the leading run-scorers in T20 cricket, amassing 8395 runs in 321 games at a strike rate of 27.98, including six centuries and 55 fifties. Jason Roy recently played for Kolkata Knight Riders in IPL 2023 after being bought as a replacement for Bangladesh all-rounder Shakib Al Hasan, who didn’t participate in the T20 tournament due to international commitments. He amassed 285 runs in eight games at a decent strike rate of 151.59, including a couple of half-centuries. Apart from Roy, Topley has not signed a deal in MLC but might consider his options. He recently underwent surgery and undergoing rehabilitation after a shoulder injury during IPL 2023. Meanwhile, star T20 players Marcus Stoinis, Quinton de Kock, Anrich Nortje, Wanindu Hasaranga, Glenn Phillips and Unmukt Chand have signed deals in MLC. Trent Boult and Adam Zampa are also likely to join MLC ahead of the tournament. Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 17:40:52","image_url":"https://staticc.sportskeeda.com/editor/2023/05/5bcd0-16850175791889-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Akash Madhwal - tennis-ball cricketer who entered IPL record books","link":"https://www.dailymirror.lk/sports/Akash-Madhwal---tennis-ball-cricketer-who-entered-IPL-record-books/322-259858","keywords":null,"creator":null,"video_url":null,"description":"Akash Madhwal was working as an engineer and playing tennis-ball cricket just a few years ago -- now he is in the Indian Premier League record books.","content":"Akash Madhwal was working as an engineer and playing tennis-ball cricket just a few years ago -- now he is in the Indian Premier League record books. The 29-year-old fast bowler returned stunning figures of 5-5 in the playoffs to lead five-time champions Mumbai Indians to victory over Lucknow Super Giants on Wednesday. Mumbai will face Gujarat Titans on Friday for a place in Sunday's final against Chennai Super Kings. With Jasprit Bumrah and Jofra Archer both out injured, the previously unheralded Madhwal has grabbed his chance to shine. He joined Mumbai last year as an injury replacement but remained confined to playing practice matches, before skipper Rohit Sharma introduced him to the big stage this season. “The team has given me the responsibility so I am trying to do it,” Madhwal told reporters after his man-of-the-match performance. “It's not that I can take his (Bumrah's) place, but whatever I can do in my capacity, I am doing.” Madhwal's route into IPL folklore -- the first to take a five-wicket haul in the playoffs -- came by way of an unusual path. He was working as a civil engineer when he quit a steady job and joined his state team, before the IPL came calling. “Cricket is my passion and not a burden,” he said. “So I am enjoying cricket after leaving engineering and a job to follow my passion without having much at home.” Madhwal is also a product of tennis-ball cricket, a variant of the sport using tennis balls. It is popular among budding cricketers across India and Madhwal said it played a part in his breakout display. “I have learnt to bowl yorkers in tennis-ball cricket and I try to implement that (here) because that's the only ball to save yourself (from getting hit for runs),” said Madhwal, who hails from the north Indian state of Uttarakhand. “My strength is my yorker and bhaiyya ( “brother” Rohit) used me where my strength lies and where the team needs me.” His feat on Wednesday came on the back of 4-37 against Sunrisers Hyderabad -- eclipsed only by Mumbai big-buy Cameron Green's match-winning 100 not out. 'Grab your opportunity' - Standing at 1.75 metres (five feet and nine inches), Madhwal is not your usual tall and burly fast bowler, but his accuracy and grit more than makes up for the lack of size. “We knew what he had, and we needed somebody to bowl at the back end,” said Rohit. “Having seen him, I was confident he could get the job done for us.” The bearded and often-smiling Madhwal struck twice in two balls, including getting the dangerous Nicholas Pooran out, caught behind for a duck to break Lucknow's back. Former India quick Zaheer Khan tweeted: “Looking forward to a lot more from the young lad.” Opportunity has not come easy for Madhwal. He played as a net bowler for Royal Challengers Bangalore in 2019 before joining Mumbai in the same capacity. But Madhwal, who has led his state team in the 50-overs format, said he never lost hope. “When a scouting team picks you as a net bowler, they give you a chance as well as one has to showcase your skills in the practice matches and show your potential,” he said. “It's just about grabbing your opportunity. “ (AFP)","pubDate":"2023-05-25 17:26:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_52fcf3f829.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"IPL 2023 Final Tickets: Chaos At Narendra Modi Stadium Amid Rush To Collect Print Tickets","link":"https://zeenews.india.com/cricket/ipl-2023-final-tickets-chaos-at-narendra-modi-stadium-amid-rush-to-collect-print-tickets-to-watch-ms-dhonis-chennai-super-kings-2613522.html","keywords":null,"creator":null,"video_url":null,"description":"MS Dhoni's Chennai Supr Kings will be playing thir tenth final on May 28 at Ahmedabad. It is likely to be the last final Dhoni plays and fans are leaving no stone unturned to watch him play for the one last time.","content":"With MS Dhoni set to play another Indian Premier League final, there is a huge demand among the fans for the summit clash of the sixteenth edition of the tournament. The excitement led to a big chaos taking place at the Narendra Modi stadium as fans struggled to collect their tickets. BCCI has partnered with PayTm to sell the online tickets. However, even afer booking their seats, the spectators need to collect the physical copy from the stadium. Thanks to this rule, there were big queues in front of the ticket office at the stadium as fans stood under the sun, waiting for their turn. A video went viral on the internet in which one can see a chaos taking pace at the venue. Also Read | EXPLAINED: Was MS Dhoni At Fault For Wasting Time To Let Matheesha Pathirana Bowl During Qualifier 1 vs GT Fans angry at board for mismanagement The biggest stakeholders in Indian cricket, the fans, felt cheated on knowing that they are required to collect physical copies of their tickets. A fan, in a video posted on Twitter, was heard saying that he paid the connvenience fee to the ticket-booking website and yet he was at the stadium, standing in a long queue, to collect a physical copy, without which he would not be allowed inside the stadium to watch the final. There were other tweets, which we have mentioned below, in which fans are upset with the ticket booking process. A fan alleged that tickets went missing seconds after they were open for sale. Also Read | MS Dhoni's CSK Probable Playing 11 For IPL 2023 Final Take a look at fans' frustration on buying IPL 2023 final tickets. Look at the scenarios personal experience of ticket buying problems created by paytm final tickets after buying tickets and taking payment these are the problems we are facing @IPL @JayShah @GCAMotera . pic.twitter.com/H8G3LvxcWi — Rahul Modi (@rahulm0902) May 25, 2023 Hey @paytminsider in the ipl final booking ticket page it is showing coming soon, will the ticket window again open? pic.twitter.com/1Xmj7Ypsl7 — Himanshu jain (@himanshu_jain7) May 25, 2023 View this post on Instagram A post shared by Viral Bhayani (@viralbhayani) CSK await the winner of Qualifier 2 in the final Chennai booked their place in the final by beating Gujarat Titans in the Qualifier 1. Titans will play Mumbai Indians in Qualifier 2 and the winner of this match will meet CSK at Narendra Modi stadium in Ahmedabad. Earlier, MI had beaten Lucknow Super Giants in Eliminator to earn a spot in the next round of the playoffs.","pubDate":"2023-05-25 17:22:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"World Cup 2023 में खेलने पर इंग्लैंड के क्रिकेटर का दो टूक जवाब, सेंट्रल कॉन्ट्रैक्ट से हटने का लिया फैसला","link":"https://www.indiatv.in/sports/cricket/jason-roy-confirms-on-leaving-england-central-contract-answers-on-playing-odi-world-cup-2023-2023-05-25-963652","keywords":null,"creator":null,"video_url":null,"description":"इंग्लैंड के एक स्टार क्रिकेटर ने सेंट्रल कॉन्ट्रैक्ट से हटने का फैसला किया है। ठीक ट्रेंट बोल्ट की राह पर ही यह क्रिकेटर है। वनडे वर्ल्ड कप खेलने को लेकर भी उन्होंने जवाब दिया है।","content":"दुनियाभर में फ्रेंचाइजी क्रिकेट के बढ़ते स्कोप के कारण पिछले कुछ सालों में कई बड़े क्रिकेटर ने अपने देश का कॉन्ट्रैक्ट छोड़कर लीग क्रिकेट को तवज्जो दी है। न्यूजीलैंड के स्टार पेसर ट्रेंट बोल्ट ने पिछले साल यह बड़ा फैसला लिया था लेकिन हाल ही में वर्ल्ड कप के लिए उन्होंने खुद को मौजूद बताया था। इसी राह पर अब इंग्लैंड को 2019 वर्ल्ड कप में चैंपियन बनाने में अहम भूमिका निभाने वाला एक क्रिकेटर चल पड़ा है। उन्होंने भी ऐसा ही कुछ फैसला किया है और देश के सेंट्रल कॉन्ट्रैक्ट से हटते हुए खुद को फ्रेंचाइजी क्रिकेट के लिए उपलब्ध करार दिया है। अभी तक यह रिपोर्ट थी लेकिन अब इंग्लिश क्रिकेटर ने यह खुद साफ कर दिया है। दरअसल हम बात कर रहे हैं इंग्लैंड के जेसन रॉय की जिनके बारे में हमने पहले एक रिपोर्ट के आधार पर बताया था कि वह इंग्लैंड क्रिकेट बोर्ड (ECB) का सेंट्रल कॉन्ट्रैक्ट छोड़ सकते हैं। अब इस क्रिकेटर ने ऐसा ही किया है और सेंट्रल कॉन्ट्रैक्ट से हटने का मन बना लिया है। वहीं इस साल भारत में होने वाले वनडे वर्ल्ड कप 2023 को लेकर भी इस स्टार ओपनर ने अपना जवाब दिया है। उन्होंने इंस्टाग्राम स्टोरी पर एक लंबा-चौड़ा नोट लिखा और इस बारे में विस्तार से पूरी जानकारी दी। उन्होंने बताया कि, वह इंग्लैंड क्रिकेट से दूर नहीं जा रहे हैं। उन्होंने ईसीबी के साथ मेजर लीग क्रिकेट में खेलने पर चर्चा की और बचे हुए साल के लिए बोर्ड उन्हें वेतन नहीं देगा यानी वह कॉन्ट्रैक्ट से हट रहे हैं। इसके अलावा उन्होंने यह भी कहा कि वह एक फॉर्मेट के खिलाड़ी हैं तो वह अन्य लीग में खेलेंगे और इंग्लैंड क्रिकेट इसके लिए उन्हें पे नहीं करेगा। इस पर बोर्ड की भी रजामंदी है। साल 2019 में इंग्लैंड वर्ल्ड चैंपियन बनी थी और उसमें रॉय का बहुमूल्य योगदान रहा था। उन्होंने इस साल होने वाले वर्ल्ड कप को लेकर कहा है कि, वह इंग्लैंड क्रिकेट को ही प्राथमिकता देंगे। इस साल वर्ल्ड कप होना है तो उनका ध्यान पूरी तरह से उस पर है। यह मेरे ही नहीं किसी भी खिलाड़ी के लिए गर्व की बात है उसे किसी देश के लिए खेलने का मौका मिले और इंटरनेशनल कैप मिले। अपने देश का प्रतिनिधित्व करना मेरे लिए गर्व की बात है। मैं जितने साल तक खेल सकता हूं इंग्लैंड के लिए ही खेलना चाहता हूं। मैं बतौर एक फॉर्मेट खिलाड़ी बिना कॉन्ट्रैक्ट के मौजूद रहूंगा। मैं बाकी प्रतियोगिताओं (लीग क्रिकेट) में खेलूंगा पर ध्यान रहेगा कि यह इंग्लैंड क्रिकेट के शेड्यूल के साथ भिड़े ना। विभिन्न प्रतियोगिताओं में खेलने से मुझे इंग्लैंड के क्रिकेटर के तौर पर भी मदद मिलेगी। गौरतलब है कि डेली मेल ने एक रिपोर्ट शेयर की थी जिसमें बताया गया था कि जेसन रॉय को मेजर लीग क्रिकेट (यूएसए टी20 लीग) की फ्रेंचाइजी लॉस एंजेलेस नाइट राइडर्स ने 3 लाख पाउंड (3.6 करोड़) का कॉन्ट्रैक्ट दिया है। इसको रॉय ने स्वीकार भी कर लिया है। इस लीग का पहला एडीशन इस साल गर्मियों में खेला जाएगा। इसमें भारत की मशहूर टी20 लीग आईपीएल की चार फ्रेंचाइजीज की टीमें होने की भी खबर है। एलए नाइटराइडर्स आईपीएल टीम कोलकाता नाइट राइडर्स की ही फ्रेंचाइजी है जिसके मालिक शाहरुख खान और जूही चावला हैं। जेसन रॉय आईपीएल में भी इसी टीम का हिस्सा हैं। आईपीएल 2023 के कुछ मैचों में उनका प्रदर्शन भी शानदार रहा था।","pubDate":"2023-05-25 16:16:54","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pramodya to continue in SLC Ex-Co until minister appoints new selection committee","link":"https://www.dailymirror.lk/breaking_news/Pramodya-to-continue-in-SLC-Ex-Co-until-minister-appoints-new-selection-committee/108-259854","keywords":null,"creator":null,"video_url":null,"description":"The Sri Lanka Cricket (SLC) Executive Committee has appointed Lasantha Wickremesinghe to the vacant Assistant Treasurer position, which was unfilled at the SLC Annual General Meeting last Saturday.","content":"The Sri Lanka Cricket (SLC) Executive Committee has appointed Lasantha Wickremesinghe to the vacant Assistant Treasurer position, which was unfilled at the SLC Annual General Meeting last Saturday. Wickremesinghe is understood to have withdrawn his name for the post of Treasurer at the AGM, with Sujeewa Godaliyadda taking over that position, but has now been appointed as the Assistant Treasurer. Pramodya Wickramasinghe will continue to represent the national selection committee in the SLC Ex-Co, until a fresh selection committee is appointed by the Minister. Mr. Shammi Silva - President Mr. Ravin Wickramaratne - Vice President Dr. Jayantha Dharmadasa- Vice President Mr. Thilak Waththuhewa Vice President - School Cricket Mr. Mohan de Silva Honorary Secretary Mr. Chryshantha Kapuwatte Honorary Assistant Secretary Mr. Sujeeva Godaliyadda Treasurer Mr. Lasantha Wickramasinghe Assistant Treasurer Mr. Pramodya Wickramasinghe Chairman – Selection Committee of Sri Lanka Cricket Mr. Bandula Dissanayake Chairman – Umpires Committee of Sri Lanka Cricket Mr. Samantha Dodanwela Chairman – Tournament Committee of Sri Lanka Cricket Mr. Janaka Pathirana Member- (Representative – District and Provincial Cricket Associations) Mr. Nalin Aponso Member (Representative- Nationalised Services Cricket Association) Mr. Nalin Wickremasinghe Member (Representative- Mercantile Cricket Association) Mr. Kithsiri de Silva Member (Representative – Controlling Clubs) Mr. Marlon Ranasinghe Member (Representative – Controlling Clubs) Mr. Priyantha Algama Member (Representative –Affiliated Clubs) Mr. Sudath Chandrasekara Member (Representative - Ministry of Sports and Youth Affairs)","pubDate":"2023-05-25 15:59:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_cf32824343.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Watch: Suryakumar's 'Lemon' Prank On MI Teammate Will Leave You In Splits","link":"https://sports.ndtv.com/cricket/suryakumar-yadavs-lemon-prank-on-mi-teammate-will-leave-you-in-splits-watch-4065859","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Indians kept the search for their sixth IPL title alive with an 81-run victory over Lucknow Super Giants on Wednesday","content":null,"pubDate":"2023-05-25 15:55:36","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"5 young Indian IPL 2023 players with the highest fan following on social media","link":"https://www.sportskeeda.com/cricket/5-young-indian-ipl-2023-players-highest-fan-following-social-media","keywords":["Cricket"],"creator":["Vikram Bhattacharya"],"video_url":null,"description":null,"content":"Social Media has become the yardstick for measuring the popularity of a luminary in this generation. It has brought closure between fans and their favorite cricketers while enabling players to keep fans updated on different aspects of their daily life. In today's digital world, it has become imperative for cricketers to remain active on social media and wow fans with regular updates, be it posts, photos, or videos. This includes posting pictures of their workouts to the different hairstyles they sport and posting pictures and videos with their loved ones. The most renowned Indian cricketers have millions of followers on social media and provide toing moments to their fans with regular updates. Most of them have stepped up to keep fans fulfilled with regular updates on their social media handles through quotes, videos, photos, memes, etc. The IPL has been one of the most Macho tournaments in all sports, with breathtaking action on the field and plenty off the field on various social media forums like Twitter and Instagram. The players have used social media to build their brands, achieve popularity and become icons. This allows them to #StayToing amongst fans to achieve cult status in the cricketing world. While Virat Kohli is the most popular Indian cricketer with 55.6 Million Twitter followers and 264 Million Instagram followers, plenty of young Indian players have also taken to social media and increased their popularity in addition to the numerous toing moments on the field. Let's look at five young Indian IPL 2023 players with the highest fan following on social media. Shubman Gill has been the most impressive batsman among the young brigade of exciting batters from India, thereby becoming a fan favorite in quick time. Gill has been red hot form in the ongoing IPL season, scoring 469 runs at an average of 46.90 and a strike rate of 143.43. He has been instrumental in the Gujarat Titans (GT) sitting atop the points table with eight wins from eleven games. Gill has also been in scintillating form in Indian colors since the start of the year, with a combined average of 61.25 across formats, with five centuries. Indian fans hope Gill will #StayToing as they look to win the World Cup title at home later this year. Gill's batting style and charming personality have made the 23-year-old opening batter the most popular Indian cricketer among the next generation of young players, having 4.5 Million Instagram followers and 1 Million Twitter followers. Gill's macho swag combined with his lazy elegance in stroke play has made fans go #YehTohBadaToingHai . Earlier in the year, Gill smashed an ODI double-century and a T20I century against New Zealand at home, giving fans across the country plenty of toing moments. He also stroked an elegant century in the final test of the recently concluded Border Gavaskar Trophy against Australia in Ahmedabad. Instagram followers: 4.5 Million Twitter followers: 1 Million Mumbai Indians (MI) wicket-keeper batsman Ishan Kishan has been one of the most destructive young batters in Indian cricket. The left-hander has had a relatively quiet season thus far in the IPL, scoring 335 runs at an average of 30.18 and a strike rate of 142.55. Kishan was instrumental in MI's title run in 2020, scoring 516 runs at an average of 57.33 and a strike rate of 145.76. Nicknamed Pocket Dynamo, the 24-year-old made his white-ball debut for India in 2021. Boasting an excellent ODI average of 42.50 in 14 matches, Kishan provided fans with one of the #YehTohBadaToingHai moments over the past 12 months when he smashed the fastest ODI double century against Bangladesh in the final ODI of the three-match series. The left-hander scored 210 off 131 deliveries and reached his double-century in just 126 balls to break Chris Gayle's record and become only the fourth Indian to score a double-century. Kishan's diminutive look and aggressive stroke play at the top of the order have increased his popularity among fans, evidenced by 3.7 Million Instagram followers and 900K Twitter followers. Fans will hope Kishan regains his best form again and provides plenty of toing moments in the coming years. Instagram followers: 3.7 Million Twitter followers: 900.4 K Delhi Capitals (DC) opener Prithvi Shaw burst onto the national stage after leading India to the Under 19 World Cup title in 2018. Touted to be an heir apparent to former Indian opener Virender Sehwag, Shaw has been weighed down by the high expectations, leading him to be inconsistent for the Indian team and his franchise. The talented stroke maker has struggled for form in the ongoing IPL, scoring just 47 runs in six innings before eventually being dropped from the DC playing XI. Shaw had a spectacular start to his International career, with a century on debut against the West Indies in 2018, making him the youngest Indian to score a test century in a #YehTohBadaToingHai moment. However, the 23-year-old has struggled for consistency and has not featured for India since 2021. Despite that, Prithvi Shaw remains among the most popular young cricketers, thanks to his classy and attacking strokeplay. Shaw also has provided fans with plenty of toing moments with regular updates in his social media forum, making him among the most followed young Indian players, with 1.6 Million Instagram followers and 592.4 K Twitter followers. Fans will hope Shaw regains his macho and swag back to provide more wow moments with the bat and storm his way back into the Indian team. Instagram followers: 1.6 Million Twitter followers: 592.4 K Sunrisers Hyderabad (SRH) all-rounder Washington Sundar is the next in line of a long list of Indian spin-bowling all-rounders after Ravichandran Ashwin, Ravindra Jadeja, and Axar Patel. Sundar is one of the most soft-spoken youngsters who has made his mark already at different stages across formats for India. Despite being just 23 years of age, Sundar has picked up over 50 wickets for India and scored five half-centuries. Unfortunately, the young off-spinner has been ruled out of the remainder of the IPL with an injury. Indian fans will hope that Sundar recovers in time for the ODI World Cup at home in October. Instagram followers: 1.6 Million Twitter followers: 784 K Devdutt Padikkal has been among the most likable up-and-coming youngsters in the IPL. The 22-year-old started his IPL career with one of the most popular franchises, Royal Challengers Bangalore, before moving to the Rajasthan Royals in 2022. In his young IPL career, Padikkal has shown himself to be someone with a solid defensive technique and displayed great consistency from 2020 to 2022, with 350+ runs in all three years. Despite not being one of the wow players on the circuit, the left-hander has been touted as one of the upcoming young Indian batters, particularly in the longer format. Padikkal has been among the most likable young players thanks to his calm demeanor and easy-going personality. Instagram followers: 1.6 Million Twitter followers: 257.5 K Which IPL 2023 player do you think is a social media king? Let us know what you think. #StayToing #SportoMacho Come #StayToing and get the best Athleisure wear at www.sporto.in . Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 18:26:20","image_url":"https://staticc.sportskeeda.com/editor/2023/05/5f4d3-16850196276633-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Top moments where fans showcased their fandom for cricket","link":"https://www.sportskeeda.com/cricket/top-moments-fans-showcased-fandom-cricket","keywords":["Cricket"],"creator":["Vikram Bhattacharya"],"video_url":null,"description":null,"content":"Cricket is one of the most-followed sports in the world. With the introduction of T20 leagues, the fan following of cricket has increased significantly in recent years. T20 tournaments like the Indian Premier League attract a lot of viewership, with new TV and digital streaming records being created every now and then. Fans also show up in large numbers to cheer for their favorite teams at the stadiums. Whenever a cricket fan visits a stadium to watch a match live, he or she try their best to showcase their fandom in a Toing way. Here’s a list of five such moments where fans showcased their fandom for cricketers in a #StayToing way. IPL franchise Royal Challengers Bangalore have created many Toing Moments in the league’s history. Ever since their debut in IPL 2008, RCB have been one of the most popular franchises. However, the Bangalore-based team has never been able to win a championship. RCB qualified for the finals in 2009, 2011 and 2016 but lost the summit clash in all three editions. Still, they continue to have a large and loyal fanbase. During an IPL match last season, a woman was spotted at the stadium with a toing poster that read, “Not gettin’ married till RCB wins IPL.” Quite a few foreign players have earned a massive fan following by performing well in the Indian Premier League. One of them is England’s star opener Jos Buttler, who plays for the Rajasthan Royals. Before RR’s away game against Gujarat Titans in IPL 2023, a young female fan got a chance to meet Buttler at the Narendra Modi Stadium. She became very emotional as she interacted with the English star, got his autograph and also clicked a picture with him. Back in IPL 2019, Deepika Ghose become an overnight social media sensation after she appeared on camera, cheering for the Royal Challengers Bangalore at the M Chinnaswamy Stadium. Ghose earns thousands of Instagram followers after the cameramen showed her on the big screen. She became famous as #TheRCBGirl, and four years later, she continues to #StayToing when it comes to supporting RCB at home. During the IPL 2019 season, Chennai Super Kings captain MS Dhoni met one of his oldest fans at the Wankhede Stadium. After the match between CSK and MI ended, Dhoni saw an elderly woman waiting outside. A young girl accompanied her. They had a poster which said that they were there only for MS Dhoni. The CSK captain did not disappoint them as he had a five-minute chat with them and also gave them a Toing autograph. As mentioned ahead, Royal Challengers Bangalore have a massive fan following in the league. During a match between RCB and Lucknow Super Giants at the M Chinnaswamy Stadium, a heartbroken RCB fan’s reactions went viral on the internet. LSG beat RCB by one wicket in a nail-biting thriller that night. The cameramen captured an emotional fan’s disappointment, and the images went viral on social media. Which franchise do you think has the biggest fanbase in IPL 2023? Let us know what you think. #StayToing #SportoMacho Come #StayToing and get the best Athleisure wear at www.sporto.in . Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 18:13:37","image_url":"https://staticc.sportskeeda.com/editor/2023/05/d72af-16850190528152-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Decision on Asia Cup venue after IPL final: Jay Shah","link":"https://telanganatoday.com/decision-on-asia-cup-venue-after-ipl-final-jay-shah","keywords":["News","Sport","Asia Cup","BCCI","Jay Shah"],"creator":["PTI"],"video_url":null,"description":"It has been learnt from ACC sources that Sethi's proposed hybrid model looks like a feasible solution although ACC had made no formal statements","content":"Home | Sport | Decision On Asia Cup Venue After Ipl Final Jay Shah Decision on Asia Cup venue after IPL final: Jay Shah It has been learnt from ACC sources that Sethi's proposed hybrid model looks like a feasible solution although ACC had made no formal statements By PTI Published Date - 11:30 PM, Thu - 25 May 23 File Photo New Delhi: A decision on Asia Cup’s fate will be taken on the sidelines of the IPL final, which will be attended by a host of top Asian Cricket Council (ACC) dignitaries, BCCI secretary Jay Shah said on Thursday. Pakistan have the hosting rights for this year’s Asia Cup but with BCCI deciding against sending its team to the neighbouring country without government permission, PCB chairman Najam Sethi had proposed a ‘hybrid model’ where they will organise at least four games on home soil and India will play their matches at a neutral venue. It couldn’t be confirmed whether Sethi has been formally invited for the IPL final. “As of now, the decision with regards to hosting of Asia Cup hasn’t yet been finalised. We are busy with IPL but the top dignitaries of Sri Lanka Cricket (SLC), Bangladesh and Afghanistan Cricket Board are coming to watch the IPL final. We will have a discussion and take a final decision in due course,” Jay Shah said. It has been learnt from ACC sources that Sethi’s proposed hybrid model looks like a feasible solution although ACC had made no formal statements. According to the model, Sri Lanka, Bangladesh, Nepal and Afghanistan play four preliminary matches in Pakistan and India would play all their games at neutral venues. The two India-Pakistan games will also be held in Sri Lanka although the PCB wants them in Dubai. The weather in UAE in September is not at all conducive for 50-over games although to make the ‘hybrid model’ work logistically, UAE is a far better option for the Asian Cricket Council. “ACC head Jay Shah will summon an executive body meeting where a formal announcement will take place. The PCB doesn’t mind playing India at a neutral venue. “PCB would prefer Dubai because it would lead to more gate receipts but it is open to playing in another country (read Sri Lanka) provided the ACC matches the gate receipts amount ($5 million) that Sri Lanka Cricket (SLC) received in 2022 from the Indo-Pak games in Dubai,” an ACC source privy to development said on conditions of anonymity. The six teams in the Asia Cup are India, Pakistan, Sri Lanka, Bangladesh, Afghanistan and Nepal. One group will have India, Pakistan and Nepal while the other group will comprise Sri Lanka, Bangladesh and Afghanistan. Also Read Jay Shah trends on Twitter after being elected as head of ICC’s F&CA Committee BCCI hikes cash prize for domestic tournaments Follow Us : Tags Asia Cup BCCI Jay Shah Related News ICC charges umpire Jatin Kashyap for breaching anti-corruption code BCCI to form World Cup Working Group at SGM Ishan Kishan replaces injured KL Rahul in WTC Final squad Rishabh Pant walks on his own, declares he is crutches-free in major recovery milestone BCCI starts search for India women’s team head coach Harmanpreet, Smriti in top grade of BCCI central contracts; Shikha, Poonam miss out","pubDate":"2023-05-25 18:00:21","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"EXPLAINED: Did MS Dhoni Intentionally Waste Time To Let Matheesha Pathirana Bowl During Qualifier 1 vs GT?","link":"https://zeenews.india.com/cricket/explained-was-ms-dhoni-at-fault-for-wasting-time-to-let-matheesha-pathirana-bowl-during-qualifier-1-vs-gt-2613509.html","keywords":null,"creator":null,"video_url":null,"description":"Dhoni has been criticised and praised equally for his delaying tactic to ensure his death overs' specialist Pathirana bowled the 16th over of the chase vs Gujarat Titans.","content":"From the time Chennai Super Kings (CSK) beat Gujarat Titans (GT) in IPL 2023 Qualifier 1 on Tuesday, fans are divided over MS Dhoni's tactics of delaying the resumption of the game to let his death over specialist bowl a crucial over in the tense chase. One still does not know whether it was a tactic from Dhoni or not. The social media however sees it that way. While one section of fans and experts called it a tactic, praising Dhoni's genius to ensure his team went past the finish line. On the other hand, critics are slamming him for using unjust methods to win games. Also Read | MS Dhoni's CSK Probable Playing 11 For IPL 2023 Final What's the matter really? Needing 71 runs to win off the last 30 balls, Dhoni called Pathirana, who was out of the field for some time, to bowl the 16th over of the innings. Pathirana had left the field some time after bowling 12th over and it had been little more than four minutes since his return to the ground when Dhoni asked him to bowl the 16th. While going to the run-up, umpire Anil Chaudhary, who was at the non-striker's end, stopped Pathirana to discuss something. A confused Dhoni walked up to the square leg umpire to understand the matter. Umpires told Dhoni that they cannot allow Pathirana to bowl as he needed to spend four more minutes on the field to do the same. IPL playing conditions say that when a player leaves the field because of an injury or any other reason for more than eight minutes, they need to on the field for a similar duration before being allowed to bowl. The commentators also spoke of the same rule on air. Pathirana was out of the field for 4 minutes and according to the Rule if you are a bowler n you are out for 4 minutes, you have to be on field for 4 minutes before you bowl. Guess what Ms dhoni did for the next 4 minutes__ pic.twitter.com/n6KUfRhpjv — _________ (@SergioCSKK) May 24, 2023 What Dhoni told umpires? Dhoni argued that he was helpless as he had no other option to bowl the 16th over other than Pathirana. As per ESPNcricinfo, Dhoni told umpires that his other best options - Ravindra Jadeja, Maheesh Theekshana, Deepak Chahar - had completed their quota of overs and he could not afford giving the ball to off-spinner Moeen Ali against two right-handers of GT in the middle. Moeen had not bowled a single over by this point. The argument went on and on and eventually the remaining four minutes that was required to be spent on the field by Pathirana were completed. The CSK pacer eventually bowled the 16th over. Chennai won the match by 15 runs. Umpires could have penalised CSK The umpires could have considered penalising CSK, as per the law. While the umpires did not allow CSK to keep five players outside the 30-yard-circle for the 20th over, CSK were not hurt by a financial penalty. As per Law 41.9, umpires can issue a warning to fielding captain if his side is deliberately spotted wasting time. If the same side repeats the offence, umpires can award five runs to the batting side. CSK escaped this penalty as well.","pubDate":"2023-05-25 17:54:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Jason Roy set to terminate his incremental contract with ECB to play in MLC - Reports","link":"https://www.sportskeeda.com/cricket/rumour-jason-roy-set-terminate-incremental-contract-ecb-play-mlc-reports","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"England's swashbuckling opener Jason Roy could terminate his incremental contract with England and Wales Cricket Board (ECB). According to the Daily Mail, the right-handed batter has got a lucrative offer to play in the inaugural season of the United States-based Major League Cricket. The six-team tournament will be played from July 13 to 30 at Grand Prairie Stadium in Texas. MLC will clash with the semifinal and finals of the T20 Blast on July 15. Meanwhile, there are County Championship fixtures between July 15 and 30. Moreover, The Hundred is slated to start on August 1. So, ECB is unlikely to give a no-objection certificate to Roy to play in the US. For the unversed, England's contracts run from October to September. A release from an incremental deal at this stage would cost £20,000 as against the £66,000 deal signed by Roy. Amid growing reports of England's white-ball players linked to overseas T20 leagues , the ECB is in the process of revamping their central contract. England Increment Contracts (2022-23): Harry Brook, Dawid Malan, Matthew Potts, Jason Roy, Reece Topley, David Willey England Annual Central Contracts: Moeen Ali, James Anderson, Jofra Archer, Jonathan Bairstow, Stuart Broad, Jos Buttler, Zak Crawley, Sam Curran, Ben Foakes, Jack Leach, Liam Livingstone, Ollie Pope, Adil Rashid, Ollie Robinson, Joe Root, Ben Stokes, Chris Woakes, Mark Wood As per ESPNCricinfo, Jason Roy might play for LA Knight Riders in MLC between the end of the T20 Blast and the start of The Hundred. The 32-year-old will bring the experience of playing in T20 leagues like the Pakistan Super League , Big Bash League , Bangladesh Premier League and The Hundred. The Surrey batter is one of the leading run-scorers in T20 cricket, amassing 8395 runs in 321 games at a strike rate of 27.98, including six centuries and 55 fifties. Jason Roy recently played for Kolkata Knight Riders in IPL 2023 after being bought as a replacement for Bangladesh all-rounder Shakib Al Hasan, who didn’t participate in the T20 tournament due to international commitments. He amassed 285 runs in eight games at a decent strike rate of 151.59, including a couple of half-centuries. Apart from Roy, Topley has not signed a deal in MLC but might consider his options. He recently underwent surgery and undergoing rehabilitation after a shoulder injury during IPL 2023. Meanwhile, star T20 players Marcus Stoinis, Quinton de Kock, Anrich Nortje, Wanindu Hasaranga, Glenn Phillips and Unmukt Chand have signed deals in MLC. Trent Boult and Adam Zampa are also likely to join MLC ahead of the tournament. Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-05-25 17:40:52","image_url":"https://staticc.sportskeeda.com/editor/2023/05/5bcd0-16850175791889-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Akash Madhwal - tennis-ball cricketer who entered IPL record books","link":"https://www.dailymirror.lk/sports/Akash-Madhwal---tennis-ball-cricketer-who-entered-IPL-record-books/322-259858","keywords":null,"creator":null,"video_url":null,"description":"Akash Madhwal was working as an engineer and playing tennis-ball cricket just a few years ago -- now he is in the Indian Premier League record books.","content":"Akash Madhwal was working as an engineer and playing tennis-ball cricket just a few years ago -- now he is in the Indian Premier League record books. The 29-year-old fast bowler returned stunning figures of 5-5 in the playoffs to lead five-time champions Mumbai Indians to victory over Lucknow Super Giants on Wednesday. Mumbai will face Gujarat Titans on Friday for a place in Sunday's final against Chennai Super Kings. With Jasprit Bumrah and Jofra Archer both out injured, the previously unheralded Madhwal has grabbed his chance to shine. He joined Mumbai last year as an injury replacement but remained confined to playing practice matches, before skipper Rohit Sharma introduced him to the big stage this season. “The team has given me the responsibility so I am trying to do it,” Madhwal told reporters after his man-of-the-match performance. “It's not that I can take his (Bumrah's) place, but whatever I can do in my capacity, I am doing.” Madhwal's route into IPL folklore -- the first to take a five-wicket haul in the playoffs -- came by way of an unusual path. He was working as a civil engineer when he quit a steady job and joined his state team, before the IPL came calling. “Cricket is my passion and not a burden,” he said. “So I am enjoying cricket after leaving engineering and a job to follow my passion without having much at home.” Madhwal is also a product of tennis-ball cricket, a variant of the sport using tennis balls. It is popular among budding cricketers across India and Madhwal said it played a part in his breakout display. “I have learnt to bowl yorkers in tennis-ball cricket and I try to implement that (here) because that's the only ball to save yourself (from getting hit for runs),” said Madhwal, who hails from the north Indian state of Uttarakhand. “My strength is my yorker and bhaiyya ( “brother” Rohit) used me where my strength lies and where the team needs me.” His feat on Wednesday came on the back of 4-37 against Sunrisers Hyderabad -- eclipsed only by Mumbai big-buy Cameron Green's match-winning 100 not out. 'Grab your opportunity' - Standing at 1.75 metres (five feet and nine inches), Madhwal is not your usual tall and burly fast bowler, but his accuracy and grit more than makes up for the lack of size. “We knew what he had, and we needed somebody to bowl at the back end,” said Rohit. “Having seen him, I was confident he could get the job done for us.” The bearded and often-smiling Madhwal struck twice in two balls, including getting the dangerous Nicholas Pooran out, caught behind for a duck to break Lucknow's back. Former India quick Zaheer Khan tweeted: “Looking forward to a lot more from the young lad.” Opportunity has not come easy for Madhwal. He played as a net bowler for Royal Challengers Bangalore in 2019 before joining Mumbai in the same capacity. But Madhwal, who has led his state team in the 50-overs format, said he never lost hope. “When a scouting team picks you as a net bowler, they give you a chance as well as one has to showcase your skills in the practice matches and show your potential,” he said. “It's just about grabbing your opportunity. “ (AFP)","pubDate":"2023-05-25 17:26:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_52fcf3f829.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"IPL 2023 Final Tickets: Chaos At Narendra Modi Stadium Amid Rush To Collect Print Tickets","link":"https://zeenews.india.com/cricket/ipl-2023-final-tickets-chaos-at-narendra-modi-stadium-amid-rush-to-collect-print-tickets-to-watch-ms-dhonis-chennai-super-kings-2613522.html","keywords":null,"creator":null,"video_url":null,"description":"MS Dhoni's Chennai Supr Kings will be playing thir tenth final on May 28 at Ahmedabad. It is likely to be the last final Dhoni plays and fans are leaving no stone unturned to watch him play for the one last time.","content":"With MS Dhoni set to play another Indian Premier League final, there is a huge demand among the fans for the summit clash of the sixteenth edition of the tournament. The excitement led to a big chaos taking place at the Narendra Modi stadium as fans struggled to collect their tickets. BCCI has partnered with PayTm to sell the online tickets. However, even afer booking their seats, the spectators need to collect the physical copy from the stadium. Thanks to this rule, there were big queues in front of the ticket office at the stadium as fans stood under the sun, waiting for their turn. A video went viral on the internet in which one can see a chaos taking pace at the venue. Also Read | EXPLAINED: Was MS Dhoni At Fault For Wasting Time To Let Matheesha Pathirana Bowl During Qualifier 1 vs GT Fans angry at board for mismanagement The biggest stakeholders in Indian cricket, the fans, felt cheated on knowing that they are required to collect physical copies of their tickets. A fan, in a video posted on Twitter, was heard saying that he paid the connvenience fee to the ticket-booking website and yet he was at the stadium, standing in a long queue, to collect a physical copy, without which he would not be allowed inside the stadium to watch the final. There were other tweets, which we have mentioned below, in which fans are upset with the ticket booking process. A fan alleged that tickets went missing seconds after they were open for sale. Also Read | MS Dhoni's CSK Probable Playing 11 For IPL 2023 Final Take a look at fans' frustration on buying IPL 2023 final tickets. Look at the scenarios personal experience of ticket buying problems created by paytm final tickets after buying tickets and taking payment these are the problems we are facing @IPL @JayShah @GCAMotera . pic.twitter.com/H8G3LvxcWi — Rahul Modi (@rahulm0902) May 25, 2023 Hey @paytminsider in the ipl final booking ticket page it is showing coming soon, will the ticket window again open? pic.twitter.com/1Xmj7Ypsl7 — Himanshu jain (@himanshu_jain7) May 25, 2023 View this post on Instagram A post shared by Viral Bhayani (@viralbhayani) CSK await the winner of Qualifier 2 in the final Chennai booked their place in the final by beating Gujarat Titans in the Qualifier 1. Titans will play Mumbai Indians in Qualifier 2 and the winner of this match will meet CSK at Narendra Modi stadium in Ahmedabad. Earlier, MI had beaten Lucknow Super Giants in Eliminator to earn a spot in the next round of the playoffs.","pubDate":"2023-05-25 17:22:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"World Cup 2023 में खेलने पर इंग्लैंड के क्रिकेटर का दो टूक जवाब, सेंट्रल कॉन्ट्रैक्ट से हटने का लिया फैसला","link":"https://www.indiatv.in/sports/cricket/jason-roy-confirms-on-leaving-england-central-contract-answers-on-playing-odi-world-cup-2023-2023-05-25-963652","keywords":null,"creator":null,"video_url":null,"description":"इंग्लैंड के एक स्टार क्रिकेटर ने सेंट्रल कॉन्ट्रैक्ट से हटने का फैसला किया है। ठीक ट्रेंट बोल्ट की राह पर ही यह क्रिकेटर है। वनडे वर्ल्ड कप खेलने को लेकर भी उन्होंने जवाब दिया है।","content":"दुनियाभर में फ्रेंचाइजी क्रिकेट के बढ़ते स्कोप के कारण पिछले कुछ सालों में कई बड़े क्रिकेटर ने अपने देश का कॉन्ट्रैक्ट छोड़कर लीग क्रिकेट को तवज्जो दी है। न्यूजीलैंड के स्टार पेसर ट्रेंट बोल्ट ने पिछले साल यह बड़ा फैसला लिया था लेकिन हाल ही में वर्ल्ड कप के लिए उन्होंने खुद को मौजूद बताया था। इसी राह पर अब इंग्लैंड को 2019 वर्ल्ड कप में चैंपियन बनाने में अहम भूमिका निभाने वाला एक क्रिकेटर चल पड़ा है। उन्होंने भी ऐसा ही कुछ फैसला किया है और देश के सेंट्रल कॉन्ट्रैक्ट से हटते हुए खुद को फ्रेंचाइजी क्रिकेट के लिए उपलब्ध करार दिया है। अभी तक यह रिपोर्ट थी लेकिन अब इंग्लिश क्रिकेटर ने यह खुद साफ कर दिया है। दरअसल हम बात कर रहे हैं इंग्लैंड के जेसन रॉय की जिनके बारे में हमने पहले एक रिपोर्ट के आधार पर बताया था कि वह इंग्लैंड क्रिकेट बोर्ड (ECB) का सेंट्रल कॉन्ट्रैक्ट छोड़ सकते हैं। अब इस क्रिकेटर ने ऐसा ही किया है और सेंट्रल कॉन्ट्रैक्ट से हटने का मन बना लिया है। वहीं इस साल भारत में होने वाले वनडे वर्ल्ड कप 2023 को लेकर भी इस स्टार ओपनर ने अपना जवाब दिया है। उन्होंने इंस्टाग्राम स्टोरी पर एक लंबा-चौड़ा नोट लिखा और इस बारे में विस्तार से पूरी जानकारी दी। उन्होंने बताया कि, वह इंग्लैंड क्रिकेट से दूर नहीं जा रहे हैं। उन्होंने ईसीबी के साथ मेजर लीग क्रिकेट में खेलने पर चर्चा की और बचे हुए साल के लिए बोर्ड उन्हें वेतन नहीं देगा यानी वह कॉन्ट्रैक्ट से हट रहे हैं। इसके अलावा उन्होंने यह भी कहा कि वह एक फॉर्मेट के खिलाड़ी हैं तो वह अन्य लीग में खेलेंगे और इंग्लैंड क्रिकेट इसके लिए उन्हें पे नहीं करेगा। इस पर बोर्ड की भी रजामंदी है। साल 2019 में इंग्लैंड वर्ल्ड चैंपियन बनी थी और उसमें रॉय का बहुमूल्य योगदान रहा था। उन्होंने इस साल होने वाले वर्ल्ड कप को लेकर कहा है कि, वह इंग्लैंड क्रिकेट को ही प्राथमिकता देंगे। इस साल वर्ल्ड कप होना है तो उनका ध्यान पूरी तरह से उस पर है। यह मेरे ही नहीं किसी भी खिलाड़ी के लिए गर्व की बात है उसे किसी देश के लिए खेलने का मौका मिले और इंटरनेशनल कैप मिले। अपने देश का प्रतिनिधित्व करना मेरे लिए गर्व की बात है। मैं जितने साल तक खेल सकता हूं इंग्लैंड के लिए ही खेलना चाहता हूं। मैं बतौर एक फॉर्मेट खिलाड़ी बिना कॉन्ट्रैक्ट के मौजूद रहूंगा। मैं बाकी प्रतियोगिताओं (लीग क्रिकेट) में खेलूंगा पर ध्यान रहेगा कि यह इंग्लैंड क्रिकेट के शेड्यूल के साथ भिड़े ना। विभिन्न प्रतियोगिताओं में खेलने से मुझे इंग्लैंड के क्रिकेटर के तौर पर भी मदद मिलेगी। गौरतलब है कि डेली मेल ने एक रिपोर्ट शेयर की थी जिसमें बताया गया था कि जेसन रॉय को मेजर लीग क्रिकेट (यूएसए टी20 लीग) की फ्रेंचाइजी लॉस एंजेलेस नाइट राइडर्स ने 3 लाख पाउंड (3.6 करोड़) का कॉन्ट्रैक्ट दिया है। इसको रॉय ने स्वीकार भी कर लिया है। इस लीग का पहला एडीशन इस साल गर्मियों में खेला जाएगा। इसमें भारत की मशहूर टी20 लीग आईपीएल की चार फ्रेंचाइजीज की टीमें होने की भी खबर है। एलए नाइटराइडर्स आईपीएल टीम कोलकाता नाइट राइडर्स की ही फ्रेंचाइजी है जिसके मालिक शाहरुख खान और जूही चावला हैं। जेसन रॉय आईपीएल में भी इसी टीम का हिस्सा हैं। आईपीएल 2023 के कुछ मैचों में उनका प्रदर्शन भी शानदार रहा था।","pubDate":"2023-05-25 16:16:54","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pramodya to continue in SLC Ex-Co until minister appoints new selection committee","link":"https://www.dailymirror.lk/breaking_news/Pramodya-to-continue-in-SLC-Ex-Co-until-minister-appoints-new-selection-committee/108-259854","keywords":null,"creator":null,"video_url":null,"description":"The Sri Lanka Cricket (SLC) Executive Committee has appointed Lasantha Wickremesinghe to the vacant Assistant Treasurer position, which was unfilled at the SLC Annual General Meeting last Saturday.","content":"The Sri Lanka Cricket (SLC) Executive Committee has appointed Lasantha Wickremesinghe to the vacant Assistant Treasurer position, which was unfilled at the SLC Annual General Meeting last Saturday. Wickremesinghe is understood to have withdrawn his name for the post of Treasurer at the AGM, with Sujeewa Godaliyadda taking over that position, but has now been appointed as the Assistant Treasurer. Pramodya Wickramasinghe will continue to represent the national selection committee in the SLC Ex-Co, until a fresh selection committee is appointed by the Minister. Mr. Shammi Silva - President Mr. Ravin Wickramaratne - Vice President Dr. Jayantha Dharmadasa- Vice President Mr. Thilak Waththuhewa Vice President - School Cricket Mr. Mohan de Silva Honorary Secretary Mr. Chryshantha Kapuwatte Honorary Assistant Secretary Mr. Sujeeva Godaliyadda Treasurer Mr. Lasantha Wickramasinghe Assistant Treasurer Mr. Pramodya Wickramasinghe Chairman – Selection Committee of Sri Lanka Cricket Mr. Bandula Dissanayake Chairman – Umpires Committee of Sri Lanka Cricket Mr. Samantha Dodanwela Chairman – Tournament Committee of Sri Lanka Cricket Mr. Janaka Pathirana Member- (Representative – District and Provincial Cricket Associations) Mr. Nalin Aponso Member (Representative- Nationalised Services Cricket Association) Mr. Nalin Wickremasinghe Member (Representative- Mercantile Cricket Association) Mr. Kithsiri de Silva Member (Representative – Controlling Clubs) Mr. Marlon Ranasinghe Member (Representative – Controlling Clubs) Mr. Priyantha Algama Member (Representative –Affiliated Clubs) Mr. Sudath Chandrasekara Member (Representative - Ministry of Sports and Youth Affairs)","pubDate":"2023-05-25 15:59:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_cf32824343.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Watch: Suryakumar's 'Lemon' Prank On MI Teammate Will Leave You In Splits","link":"https://sports.ndtv.com/cricket/suryakumar-yadavs-lemon-prank-on-mi-teammate-will-leave-you-in-splits-watch-4065859","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Indians kept the search for their sixth IPL title alive with an 81-run victory over Lucknow Super Giants on Wednesday","content":null,"pubDate":"2023-05-25 15:55:36","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"}]}