{"newsArray":[{"article_id":"610c51ecdda77c1738550de95d2abec8","title":"The Emperor at 60!","link":"http://island.lk/the-emperor-at-60/","keywords":["Sports","Arjuna Ranatunga","BCCI","Featured","SLC"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Rex Clementine Arjuna Ranatunga hasn’t spared any sacred cow. All those years ago, he targeted Shane Warne calling him an ordinary cricketer and there was no love lost between the two of them. Yet, when there was a ceremony remembering Warne in Galle last year ahead of the Australia – Sri Lanka Test […]","content":"Arjuna Ranatunga hasn’t spared any sacred cow. All those years ago, he targeted Shane Warne calling him an ordinary cricketer and there was no love lost between the two of them. Yet, when there was a ceremony remembering Warne in Galle last year ahead of the Australia – Sri Lanka Test match, he not only showed up but urged a few of his team mates to come along. Exterior is rough and tough but interior is soft and kind. Sportsmen rewrite record books. But Arjuna more often rewrote the rule books. He also upset the apple cart, told the Board Chairman once to get out of the Sri Lankan dressing room, broke a few glass ceilings and was a pain for successive administrations of the sport both here and overseas. He turns 60 today. As India cements owner N. Srinivasan made a regal entry into cricket governance, everyone was careful not even to talk anything out of turn. The business tycoon was known for his ruthlessness. Influential figures in cricket who knew inside out of the devout Brahmin warned that never to cross Srinivasan’s path. But Arjuna took on Srinivasan. He was the only one. The rest of them, including the founding members of the ICC – England and Australia fell in line with him and agreed for the Big Three takeover of the ICC and a larger portion of ICC revenue to India. Only Arjuna spoke out. This is an unfair world and cricket is an unfair sport. It’s not supposed to be that way. Forget the world. At least cricket is supposed to be a fair playing field. Srinivasan taught Arjuna a bitter lesson. He contacted Sports Minister Gamini Lokuge and promised a tour of India that would bring US$ 10 million to SLC. But only on one condition. The government had to get rid of Arjuna as the Board Chairman. Lokuge said deal. Arjuna was out. That Lokuge went and signed a television deal with a backlisted company and plundered millions of dollars is a different story. The rule of the day seems that in cricket everyone should make money. Ministers, Presidential Advisors, Lawyers, Law Enforcement Officers and even us reporters. To hell with cricket. Even if the national cricket team’s performance has hit an all time low it doesn’t matter as long as the board is making profits. It is fine if we don’t play international cricket for nearly three months when the IPL is on. The important thing is not to antagonize India. You thought the Srinivasan episode would have taught Arjuna a few lessons. No. He has not learned a single thing. Srinivasan though only had clout being the big boss of BCCI. His successor Jay Shah not only has clout, but he has even political power being the son of India’s Interior Minister and number two of the ruling BJP after the Prime Minister. You knew what was in store for Arjuna when he ridiculed Shah. It was stupid. It was politically incorrect. The most sensible thing to do these days is to go with the flow. That is what Australian boss Mike Barid is doing. That is what Richard Thomson, the Chairman of England and Wales Cricket Board is doing, That is what right right is doing. Why go and take on of all people Jay Shah? But that is Arjuna for you. He calls a spade a spade. Diplomacy is not his best trait. We all agreed that during the Asia Cup having a reserve day for just the India – Pakistan game was insane. But no body said a word. No one wants to antagonize the BCCI. Arjuna did. He called it ridiculous. An Indian reporter asked him what he would have done if he were Sri Lanka’s captain. “I would have walked out with my team without playing the tournament. It’s not fair. Let them play an India – Pakistan final. This is not how I play cricket,” he said. How we long for those days. It would have been a nightmare for the ICC to deal with this guy. At a time when our captains are happy to stand and take selfies with Virat Kohli, here’s one man who could have given Kohli as much as the Indian captain dishes out to others. At the age of 60 and being the grandfather of two, at least now you hope that Arjuna plays it safe. But that is not what he is. He has been always that combative kind of guy. Playing his first game against his idol Sunil Gavaskar, Arjuna had goosebumps. It was a surreal moment. But the competitive nature in him compelled him to take on the Indian captain and get under his skin. Gavaskar wasn’t upset but was impressed by what he saw in the teenager. He quietly went up to Board Charmian Gamini Dissanayake and told him, ‘Look after that boy. He will change Sri Lankan cricket one day.’ At times you tend to think that Arjuna is old school, but his observations on the game are quite sharp. India had come to Colombo for the Under-19 World Cup in 2006. One Rohit Sharma impressed him. In subsequent years when the Indian senior team visited Sri Lanka and reporters interviewed him he kept on asking why Rohit Sharma is not part of the senior side. The Indians wondered why he is so obsessed with Rohit Sharma. The proof was there soon in what Rohit has gone onto achieve in the game. Arjuna’s humour is quite unique too. For all these guys who have gone onto play the game at the highest level they have their humorous side. Once he was captaining a World XI team against an Australian XI in Adelaide in an exhibition game. Ashwin Ferro, a reporter from Mid-Day newspaper from Bombay had gone to Adelaide for reporting. A few World XI players were having niggles and the reporter had to play the game. Arjuna looked at him and said, ‘Hey you. You are bowling the first over.’ The poor reporter asked, ‘Why me.’ Arjuna replied. ‘You are from Bombay right. Most Ranji Trophy wins and all. Yes, you are bowling the first over.’ It’s been a glorious 60 for the captain cool. There are many wishes on his birthday and one of them is that he doesn’t change. You need that one voice to tell the powers that be to where to get lost.","pubDate":"2023-12-01 00:01:48","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ce1480d672245b12b82b6776d1157e1f","title":"Himaru sparks bright to win Under 15 Youth League Best Bowler award","link":"http://island.lk/himaru-sparks-bright-to-win-under-15-youth-league-best-bowler-award/","keywords":["Sports","Himaru Deshan","Holy Cross Colleg"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Reemus Fernando Holy Cross College, Kalutara spinner Himaru Deshan emerged the best bowler of the tournament as his team Colombo South Under 15s beat Colombo North in the final of the Sri Lanka Cricket conducted Under 15 Youth League tournament at MCA ground on Wednesday. After missing the Best Bowler title by a […]","content":"Holy Cross College, Kalutara spinner Himaru Deshan emerged the best bowler of the tournament as his team Colombo South Under 15s beat Colombo North in the final of the Sri Lanka Cricket conducted Under 15 Youth League tournament at MCA ground on Wednesday. After missing the Best Bowler title by a small margin at the last edition, Deshan made sure that he would be the bowler to watch in the final as he topped the list of highest wicket takers of the tournament by the time the league matches were concluded. He had 14 wickets against his name before the final and produced controlled spells to restrict Colombo North to 170 runs in the decisive encounter. His ten overs in the final which included three maidens cost just 27 runs. He was responsible for removing open batsman Kavith de Silva in the final. The left-arm-spinner commenced the tournament with a bang taking five wickets against Galle U15s. He gave away just 22 runs in his seven overs which included three maidens. When Colombo South met Colombo North in the league match, he took two wickets. In that match he shared the new ball and gave away just 14 runs in his nine overs. In the match against Dambulla, Deshan grabbed three wickets for 14 runs in ten overs as the opponents were dismissed for a mere 65 runs. Kandy too were dismissed for a similar number of runs with Deshan taking four wickets for 11 runs in 5.3 overs (three maidens). A frontline bowler in the Holy Cross First XI team, Deshan has reaped the benefit of playing Under 19 cricket. He has been identified by his school as a future captain of the first XI and has captained the school’s Under 13 and Under 15 teams.","pubDate":"2023-11-30 23:40:44","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c72d15b4b1b7806b38353bba2380896f","title":"Akpata hails Nigeria’s progress despite W’Cup ticket loss","link":"https://dailytrust.com/akpata-hails-nigerias-progress-despite-wcup-ticket-loss/","keywords":["Sports"],"creator":[". ."],"video_url":null,"description":"President of the Nigeria Cricket Federation Uyi Akpta says the country has made tremendous progress at the ongoing ICC T20 World Cup African qualifiers in Namibia despite missing out on the tickets to play in the USA and West Indies next year. The Yellow Greens, who batted first, posted 110 for the loss of eight […]","content":"President of the Nigeria Cricket Federation Uyi Akpta says the country has made tremendous progress at the ongoing ICC T20 World Cup African qualifiers in Namibia despite missing out on the tickets to play in the USA and West Indies next year. The Yellow Greens, who batted first, posted 110 for the loss of eight wickets in 20 overs while Zimbabwe made the required 111 runs for the loss of four wickets with 36 balls remaining. With only pride left to play for, Nigeria look set to finish off the event in fifth place despite a Namibian encounter left on the cards","pubDate":"2023-11-30 23:33:16","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"d48f8c467c3287c770851f0860f87e04","title":"ODI Cricket: ২০২৩ বিশ্বকাপেই সম্ভবত নিজেদের শেষ ওয়ান ডে ম্য়াচ খেলে ফেলেছেন এই তারকারা","link":"https://bengali.abplive.com/photo-gallery/sports/cricket-list-of-players-from-10-team-in-cwc-2023-who-might-have-played-last-odi-match-in-pics-1028044","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"ODI Cricket: ২০২৩ বিশ্বকাপেই সম্ভবত নিজেদের শেষ ওয়ান ডে ম্য়াচ খেলে ফেলেছেন এই তারকারা","content":"প্রাক্তন শ্রীলঙ্কান অধিনায়ক অ্যাঞ্জেলো ম্যাথিউজ়ের রেকর্ড সব ফর্ম্যাটেই অনবদ্য। তিনি প্রাথমিক দলে না থাকলেও, চোট আঘাতের জেরে দলে সুযোগ পান। তাঁকে এর পরবর্তীতে আর আন্তর্জাতিক আঙিনায় দেখা যাবে কি না, সেই নিয়ে সন্দেহ রয়েইছে। নেদারল্যান্ডসের হয়ে ২০১১ সালের বিশ্বকাপ দলে থাকা একমাত্র সদস্য ওয়েসলি বারেসি যিনি এই বিশ্বকাপেও খেলেছেন। এ বারের বিশ্বকাপে ডাচ দল বেশ ভালই পারফর্ম করেছে। তবে ব্যক্তিগতভাবে বারেসি পারফরম্যান্স তেমন আহামরি ছিল না। তিনি টুর্নামেন্টে মাত্র ৮৩ রান করেছেন। তাঁর বয়স এবং তরুণ প্রজন্মের উত্থানের জেরে বারেসিকে জাতীয় দলে জায়গা হারাতে হতে পারে। নিউজ়িল্যান্ডের সর্বকালের সেরা বোলারদের নাম উঠলে টিম সাউদির নাম আসবেই। তবে ২২১টি ওয়ান ডে উইকেট নেওয়া সাউদি হালে বারংবার চোট আঘাতে ভুগেছেন। তিনি কিউয়ি টেস্ট দলের অধিনায়কও বটে। তাই হয়তো সীমিত ওভারের বদলে তাঁকে আরও বেশি করে লাল বলে ক্রিকেটে মনোনিবেশ করতে দেখা যেতেই পারে। বেন স্টোকস আগেই ওয়ান ডে ফর্ম্যাট থেকে অবসর নিয়েছিলেন। তবে বিশ্বকাপের আগে তাঁকে ফেরানো। বিশ্বকাপের পরেই আবার হাঁটুর অস্ত্রোপ্রচার সেরেছেন স্টোকস। ইংল্যান্ডের টেস্ট অধিনায়কের ক্ষেত্রে তিন ফর্ম্যাটে খেলা চালিয়ে যাওয়াটা কিন্তু ভীষণ চ্যালেঞ্জিং হতে চলেছে। ডেভিড মিলার লোয়ার অর্ডারে দক্ষিণ আফ্রিকার হয়ে একাধিক ম্যাচ জিতিয়েছেন। এই বিশ্বকাপের সেমিফাইনালে গোটা দলের ব্যর্থ হলেও, মিলার শতরান হাঁকান। তিনি সম্পূর্ণভাবে আর ওয়ান ডেতে সুযোগ পাবেন না, এমনটা বলা না গেলেও, তাঁর বয়স বাঁধা হয়ে দাঁড়াতে পারে। আফগানিস্তান ক্রিকেটের উত্থানের পিছনে তাঁর অবদান অনস্বীকার্য। আন্তর্জাতিক ক্রিকেটে আফগানদের একেবারে শুরুর সময় থেকে দলের অংশ মহম্মদ নবি। তবে ৩৯-র নবির আর কতদিন আন্তর্জাতিক ক্রিকেট খেলবেন, সেই নিয়ে সংশয় তো আছেই। ৩৭-র ডেভিড ওয়ার্নার বিশ্বচ্যাম্পিয়ন অস্ট্রেলিয়ার হয়ে টুর্নামেন্টের সর্বাধিক রানসংগ্রাহক হয়েছিলেন। তবে তিনি যে নিজের কেরিয়ারের শেষ পর্যায়ে পৌঁছে গিয়েছেন, তার পূর্বাভাস বারংবার মিলেছে। বাংলাদেশের ওয়ান ডে দলের পরিকল্পনা থেকে মাহমুদ্দুলাহকে বাইরেই রাখা হয়েছিল। তবে শেষ মুহূর্তে তিনি দলে সুযোগ পান। বিশ্বকাপে শতরানও হাঁকান। তবে বিশ্বকাপে বাংলাদেশের হতশ্রী পারফরম্যান্সের পর বেশ কিছু রদবদল হতে পারে। ৩৭-র মাহমুদ্দুলাহর ওয়ান ডে কেরিয়ারে এর জেরে ইতি টানতে হতে পারে। বিশ্বকাপে পাকিস্তানের খারাপ পারফরম্যান্সের অন্যতম বড় কারণ মিডল অর্ডারের ব্যর্থতা। সেই মিডল অর্ডারেরই অংশ ছিলেন ইফতিকার আমেদ। তিনি নয় ম্যাচে মাত্র ১৪২ রান করেছিলেন। পাকিস্তান ক্রিকেটে বিশ্বকাপের পর ইতিমধ্যেই বেশ বদল হয়েছে। রয়েছে আরও বদলের সম্ভাবনা। তাই ইফতিকারের ভবিষ্যৎ নিয়ে প্রশ্নচিহ্ন রয়েইছে। আর অশ্বিন এমনিতেই বহুদিন ধরে ভারতীয় ওয়ান ডে দলের অংশ ছিলেন না। তবে অক্ষর পটেলের চোট তাঁকে বিশ্বকাপ দলে জায়গা করে দেয়। ভারতীয় দলে স্পিনারের অভাব নেই। তাই ৩৭ বছর বয়সি অশ্বিনকে আর ওয়ান ডে ফর্ম্যাটে খেলতে দেখা যাবে কি না, সেই নিয়ে সন্দেহ রয়েছে। South Bengal Weather: উধাও শীতের আমেজ, ডিসেম্বরের শুরুতে কেমন আবহাওয়া? কবে ফিরবে ঠান্ডা?","pubDate":"2023-11-30 22:38:36","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/01/64f5b6afaf6e80f2b915efef556decbf1701383810941507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"b2f4f458df9c8eaac591629cd95ee0ea","title":"RAZA DISLODGES MASAKADZA . . . Chevrons out of T20 World Cup","link":"https://www.herald.co.zw/raza-dislodges-masakadza-chevrons-out-of-t20-world-cup/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Lawrence Moyo-Head Zimpapers Sports NATIONAL cricket captain Sikandar Raza became the highest T20 international run scorer for the Chevrons as Zimbabwe beat Kenya by 110 runs in their final 2024 World Cup qualifier in Windhoek yesterday. Despite the huge win, the Chevrons missed out on a Top Two position for the remaining slots at the […]","content":"Kenya 6 3 3 0 0 6 -0.911 Nigeria 6 1 4 0 1 3 -1.026 Tanzania 6 1 5 0 0 2 -1.507 Rwanda 6 0 5 0 1 1 -4.303 Gerald Sibanda ZIMBABWEANS Daniel Msendami and Cleopas Dube’s Botswana-based side Jwaneng Galaxy will be playing another important CAF Champions League match this weekend when they take on Tanzanian giants Simba SC at Oberd Itani Chilume Stadium in Francistown tomorrow. Msendami, who has been a revelation for Galaxy, said he is just enjoying himself and is […] Collin Matiza-Sports Editor HE just couldn’t resist it! Ace motor racing driver Mano Zevgolis has come out of semi-retirement and will this weekend be part of the country’s top drivers who will burn the track during the Fuchs Lubricants 3-Hour Endurance Race in Bulawayo. Zevgolis, who was a dominant force in the local drag racing […] Eddie Chikamhi-Senior Sports Reporter THE Castle Lager Premier Soccer League strikers come under the spotlight tonight as young Takunda Benhura walks to the podium to collect the Golden Boot award. Benhura, who featured in his first full season with newly-crowned champions Ngezi Platinum Stars, emerged the best of the lot after scoring 13 goals this […]","pubDate":"2023-11-30 22:02:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"54daa4be9285486212c6a5e482b7c975","title":"Ngezi schoolboy targets Chibuku Trophy glory","link":"https://www.herald.co.zw/ngezi-schoolboy-targets-chibuku-trophy-glory/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Bruce Chikuni THE long wait for Ngezi Platinum Stars to be crowned Castle Lager Premiership champions ended last weekend at Barbourfields when they were handed their title. It was double celebration for midfielder, Nisbert Muzenda, who finished writing his A Level exams at Wanganui in Mhondoro last week. The 17-year-old joined a very small group […]","content":"Lawrence Moyo-Head Zimpapers Sports NATIONAL cricket captain Sikandar Raza became the highest T20 international run scorer for the Chevrons as Zimbabwe beat Kenya by 110 runs in their final 2024 World Cup qualifier in Windhoek yesterday. Despite the huge win, the Chevrons missed out on a Top Two position for the remaining slots at the […] Tadious Manyepo-Sports Reporter ZIMBABWE female boxer Kudakwashe “Take Money” Chiwandire has roped in highly-rated South Africa-based pugilist Tarisai Mutsau to help her out in sparring sessions as she intensifies preparations ahead of her World Boxing Council (WBC) international bout to be staged in Australia in a fortnight. Chiwandire is challenging for the belt against Indian […] Ray Bande in Mutare EASTERN Region Division One side Tenax FC are not happy with the boardroom decision to promote Bikita Minerals into the Premiership after the correctional services side had seemingly won the championship on the final day. Tenax have since reached out to the Zifa Normalisation Committee as well as the Sports and […]","pubDate":"2023-11-30 22:02:24","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7916f1cf0b2bb3d0f7e7530e9d2e1940","title":"Uganda qualify for Men’s T20 World Cup for first time","link":"https://blueprint.ng/uganda-qualify-for-mens-t20-world-cup-for-first-time/","keywords":["Sports"],"creator":["Content Administrator I"],"video_url":null,"description":"Uganda qualified for the Men’s T20 World Cup for the first time with a nine-wicket victory over Rwanda in African qualifying.The win meant the Cricket Cranes, ranked 23rd in the world, clinched second place in the six-team tournament in Windhoek, Namibia. Uganda will join Namibia at the 20-team finals in the United States and the West Indies next year after Read More The post Uganda qualify for Men’s T20 World Cup for first time appeared first on Blueprint Newspapers Limited.","content":"Uganda qualified for the Men’s T20 World Cup for the first time with a nine-wicket victory over Rwanda in African qualifying. The win meant the Cricket Cranes, ranked 23rd in the world, clinched second place in the six-team tournament in Windhoek, Namibia. Uganda will join Namibia at the 20-team finals in the United States and the West Indies next year after the Eagles qualified with a game to spare on Tuesday. “It is pretty surreal,” captain Brian Masaba said. “I can’t put words to the emotions we are feeling now as a team. It’s massive for Ugandan cricket and huge for African cricket, especially, for a country like Uganda to make it to the World Cup.” Having opened with a win over Tanzania and then a defeat by Namibia, Uganda upset Zimbabwe in their third game on Sunday, winning by five wickets in their first T20 International against a full ICC member. The East Africans subsequently cruised to a nine-wicket triumph over Nigeria and beat neighbours Kenya by 33 runs on Wednesday to move to the brink of qualification. They won the toss against Rwanda and decided to field, bowling out their opponents for 65 inside 19 overs. Uganda reached their target of 66 runs, for the loss of one wicket, in just 8.1 overs. The team celebrated with a small band of travelling fans after opener Simon Ssesazi hit the winning run to clinch victory and qualification. “A lot of work has gone on behind the scenes to get us where we are today,” Masaba said. “It has been years of toil and hard work, four or five years of sacrifice. The fans joining in the celebrations was pretty special.” Masaba believes the chance to face the likes of T20 World Cup holders England and established Test nations such as India and Australia next June could “open a lot of doors” for Ugandan cricket. “I think the whole world realises there is a lot of potential outside the big nations,” the 32-year-old added. “Hopefully this is something the government and sponsors can get behind.” Zimbabwe’s men were the top-ranked side in the African qualifiers at 11th in the world, one place ahead of Namibia. The Chevrons have played at six of the eight previous editions of the T20 World Cup and reached the Super 12 stage in Australia last year, but will miss out on next year’s tournament.","pubDate":"2023-11-30 20:39:00","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"ab04797e1c78e48f5c5c30913d9e8543","title":"Suryakumar to lead T20I side, KL Rahul to captain in ODIs in SA","link":"https://kashmirreader.com/2023/12/01/suryakumar-to-lead-t20i-side-kl-rahul-to-captain-in-odis-in-sa/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Suryakumar Yadav, who is captaining the Indian team in the ongoing five-match T20I series against Australia, will continue in the role in the shortest format during the three-match series against South Africa beginning on December 10 in Durban, while KL Rahul will be the skipper for the three-match ODI series against the Proteas. […]","content":"New Delhi: Suryakumar Yadav, who is captaining the Indian team in the ongoing five-match T20I series against Australia, will continue in the role in the shortest format during the three-match series against South Africa beginning on December 10 in Durban, while KL Rahul will be the skipper for the three-match ODI series against the Proteas. The BCCI selection committee, which met here on Thursday, also decided to make pace spearhead Jasprit Bumrah as Rohit Sharma’s deputy in the two-Test series beginning on December 26 in Centurion. Rahul will keep wickets in the Test series. Both Rohit and Virat Kohli requested the Indian cricket board for a break from the white-ball leg of the tour. B Sai Sudharshan and Rinku Singh have received maiden call-ups in the Indian ODI squad. The selection committee meeting was held in the presence of head coach Rahul Dravid. The three-match T20I series will begin on December 10, which will be followed by three ODIs starting December 17 in Johannesburg. PTI Suryakumar to lead T20I side, KL Rahul to captain in ODIs in SA added by Press Trust of India on 1:52 am December 1, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-11-30 20:22:38","image_url":"https://secure.gravatar.com/avatar/1c87210d7bdbbe5456221da94b25d939?s=100&d=mm&r=g","source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4b41a1a9099ead85d450b18f12805fd6","title":"Shan Masood promoted to B category in PCB’s central contract list","link":"https://www.nation.com.pk/01-Dec-2023/shan-masood-promoted-to-b-category-in-pcb-s-central-contract-list","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE- The Pakistan Cricket Board (PCB) has upgraded Pakistan Test captain Shan Masood’s category in the central con­tract list from D to B.","content":null,"pubDate":"2023-11-30 20:17:15","image_url":null,"source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"c8530edace777087c5424c92fa0df214","title":"Najmul’s century puts Bangladesh in control in Sylhet","link":"https://www.gulf-times.com/article/672744/sports/najmuls-century-puts-bangladesh-in-control-in-sylhet","keywords":null,"creator":["info@gulf-times.com (Gulf Times)"],"video_url":null,"description":"Skipper Najmul Hossain Shanto hit his third Test century in four innings to put Bangladesh on course for a strong total in the second innings of the first Test against New Zealand in Sylhet yesterday....","content":"Skipper Najmul Hossain Shanto hit his third Test century in four innings to put Bangladesh on course for a strong total in the second innings of the first Test against New Zealand in Sylhet yesterday. The hosts reached 212-3 at stumps on the third day, leading New Zealand by 205 runs, with Najmul unbeaten on 104. Former captain Mushfiqur Rahim made an unbeaten 43 and put on 96 runs in the unbroken fourth-wicket stand with Najmul. Najmul, who scored a century in both innings of Bangladesh’s previous Test against Afghanistan in June, also shared 90 runs with Mominul Haque for the third wicket. The left-hander has now become the first Bangladeshi cricketer to score a hundred on his debut as Test captain. He took his hundred, his fourth in Tests, with a single off Ajaz Patel in 191 balls before signing off the day in style with a boundary in the last ball. The 25-year-old has struck 10 fours so far in his innings. He was however involved in two runouts on the day, with the last being Mominul, who made 40. Najmul and Mominul helped Bangladesh recover from 26-2 after New Zealand made 317 in their first innings to take a slender seven-run lead. Mominul praised Najmul for his “outstanding” batting. “He knows very well about his game and has a clear mind,” Mominul said. Patel, the only New Zealand bowler with some success on the day, trapped opener Zakir Hasan leg-before for 17. Tim Southee directed a straight drive by Najmul onto the stumps at the non-striking end to run out Mahmudul Hasan for eight next over. Mominul, who joined Najmul in the rescue act, was also the hero for Bangladesh with the ball, having taken the last two New Zealand wickets in the morning. The tourists, replying to Bangladesh’s first-innings 310, resumed on 266-8, still 44 runs behind. Southee and Kyle Jamieson frustrated Bangladesh for more than an hour to share 52 runs for the ninth wicket, until left-arm spinner Mominul removed them both in the same over. Mominul trapped Jamieson leg-before for 23 to leave New Zealand 316-9, and then bowled Southee four balls later for 35 to finish with career-best figures of 3-4. “We definitely didn’t think it was going to be easy to rock up in the second innings and knock them over,” Jamieson said. “We’ve still got some work to do tomorrow and try and chip out a few more.” Southee hit three boundaries in his 62-ball stay. The two-match series is the beginning of a new cycle in the World Test Championship for both teams. SCOREBOARDBangladesh I innings 310 all out New Zealand I innings (266-8 overnight) T. Latham c Nayeem b Taijul 21 D. Conway c Shahadat b Mehidy 12 K. Williamson b Taijul 104 H. Nicholls c Nurul b Shoriful 19 D. Mitchell st Nurul b Taijul 41 T. Blundell c Nurul b Nayeem 6 G. Phillips c Najmul b Mominul 42 K. Jamieson lbw b Mominul 23 I. Sodhi c Shahadat b Taijul 0 T. Southee b Mominul 35 A. Patel not out 1 Extras (b8, lb5) 13 Total (all out; 101.5 overs) 317 Fall of wickets: 1-36 (Latham), 2-44 (Conway), 3-98 (Nicholls), 4-164 (Mitchell), 5-175 (Blundell), 6-253 (Phillips), 7-262 (Williamson), 8-264 (Sodhi), 9-316 (Jamieson), 10-317 (Southee) Bowling: Shoriful 13-2-54-1, Mehidy 22-3-64-1, Taijul 39-9-109-4, Nayeem 24-3-73-1, Mominul 3.5-1-4-3 Bangladesh II inningsM. Hasan run out 8 Z. Hasan lbw b Patel 17 N. Hossain not out 104 M. Haque run out 40 M. Rahim not out 43 Extras 0 Total (three wickets; 68 overs) 212To bat: Shahadat Hossain, Nurul Hasan, Mehidy Hasan Miraz, Taijul Islam, Shoriful Islam, Nayeem Hasan Fall of wickets: 1-23 (Zakir), 2-26 (Mahmudul), 3-116 (Mominul) Bowling: Southee 12-3-22-0, Jamieson 9-3-19-0, Patel 23-1-94-1, Phillips 12-4-36-0, Sodhi 12-1-41-0 Toss: Bangladesh Umpires: Ahsan Raza (PAK), Paul Reiffel (AUS)","pubDate":"2023-11-30 20:17:00","image_url":"https://www.gulf-times.com/gulftimes/uploads/images/2023/11/30/108537.jpg","source_id":"gulftimes","source_priority":433545,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"article_id":"610c51ecdda77c1738550de95d2abec8","title":"The Emperor at 60!","link":"http://island.lk/the-emperor-at-60/","keywords":["Sports","Arjuna Ranatunga","BCCI","Featured","SLC"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Rex Clementine Arjuna Ranatunga hasn’t spared any sacred cow. All those years ago, he targeted Shane Warne calling him an ordinary cricketer and there was no love lost between the two of them. Yet, when there was a ceremony remembering Warne in Galle last year ahead of the Australia – Sri Lanka Test […]","content":"Arjuna Ranatunga hasn’t spared any sacred cow. All those years ago, he targeted Shane Warne calling him an ordinary cricketer and there was no love lost between the two of them. Yet, when there was a ceremony remembering Warne in Galle last year ahead of the Australia – Sri Lanka Test match, he not only showed up but urged a few of his team mates to come along. Exterior is rough and tough but interior is soft and kind. Sportsmen rewrite record books. But Arjuna more often rewrote the rule books. He also upset the apple cart, told the Board Chairman once to get out of the Sri Lankan dressing room, broke a few glass ceilings and was a pain for successive administrations of the sport both here and overseas. He turns 60 today. As India cements owner N. Srinivasan made a regal entry into cricket governance, everyone was careful not even to talk anything out of turn. The business tycoon was known for his ruthlessness. Influential figures in cricket who knew inside out of the devout Brahmin warned that never to cross Srinivasan’s path. But Arjuna took on Srinivasan. He was the only one. The rest of them, including the founding members of the ICC – England and Australia fell in line with him and agreed for the Big Three takeover of the ICC and a larger portion of ICC revenue to India. Only Arjuna spoke out. This is an unfair world and cricket is an unfair sport. It’s not supposed to be that way. Forget the world. At least cricket is supposed to be a fair playing field. Srinivasan taught Arjuna a bitter lesson. He contacted Sports Minister Gamini Lokuge and promised a tour of India that would bring US$ 10 million to SLC. But only on one condition. The government had to get rid of Arjuna as the Board Chairman. Lokuge said deal. Arjuna was out. That Lokuge went and signed a television deal with a backlisted company and plundered millions of dollars is a different story. The rule of the day seems that in cricket everyone should make money. Ministers, Presidential Advisors, Lawyers, Law Enforcement Officers and even us reporters. To hell with cricket. Even if the national cricket team’s performance has hit an all time low it doesn’t matter as long as the board is making profits. It is fine if we don’t play international cricket for nearly three months when the IPL is on. The important thing is not to antagonize India. You thought the Srinivasan episode would have taught Arjuna a few lessons. No. He has not learned a single thing. Srinivasan though only had clout being the big boss of BCCI. His successor Jay Shah not only has clout, but he has even political power being the son of India’s Interior Minister and number two of the ruling BJP after the Prime Minister. You knew what was in store for Arjuna when he ridiculed Shah. It was stupid. It was politically incorrect. The most sensible thing to do these days is to go with the flow. That is what Australian boss Mike Barid is doing. That is what Richard Thomson, the Chairman of England and Wales Cricket Board is doing, That is what right right is doing. Why go and take on of all people Jay Shah? But that is Arjuna for you. He calls a spade a spade. Diplomacy is not his best trait. We all agreed that during the Asia Cup having a reserve day for just the India – Pakistan game was insane. But no body said a word. No one wants to antagonize the BCCI. Arjuna did. He called it ridiculous. An Indian reporter asked him what he would have done if he were Sri Lanka’s captain. “I would have walked out with my team without playing the tournament. It’s not fair. Let them play an India – Pakistan final. This is not how I play cricket,” he said. How we long for those days. It would have been a nightmare for the ICC to deal with this guy. At a time when our captains are happy to stand and take selfies with Virat Kohli, here’s one man who could have given Kohli as much as the Indian captain dishes out to others. At the age of 60 and being the grandfather of two, at least now you hope that Arjuna plays it safe. But that is not what he is. He has been always that combative kind of guy. Playing his first game against his idol Sunil Gavaskar, Arjuna had goosebumps. It was a surreal moment. But the competitive nature in him compelled him to take on the Indian captain and get under his skin. Gavaskar wasn’t upset but was impressed by what he saw in the teenager. He quietly went up to Board Charmian Gamini Dissanayake and told him, ‘Look after that boy. He will change Sri Lankan cricket one day.’ At times you tend to think that Arjuna is old school, but his observations on the game are quite sharp. India had come to Colombo for the Under-19 World Cup in 2006. One Rohit Sharma impressed him. In subsequent years when the Indian senior team visited Sri Lanka and reporters interviewed him he kept on asking why Rohit Sharma is not part of the senior side. The Indians wondered why he is so obsessed with Rohit Sharma. The proof was there soon in what Rohit has gone onto achieve in the game. Arjuna’s humour is quite unique too. For all these guys who have gone onto play the game at the highest level they have their humorous side. Once he was captaining a World XI team against an Australian XI in Adelaide in an exhibition game. Ashwin Ferro, a reporter from Mid-Day newspaper from Bombay had gone to Adelaide for reporting. A few World XI players were having niggles and the reporter had to play the game. Arjuna looked at him and said, ‘Hey you. You are bowling the first over.’ The poor reporter asked, ‘Why me.’ Arjuna replied. ‘You are from Bombay right. Most Ranji Trophy wins and all. Yes, you are bowling the first over.’ It’s been a glorious 60 for the captain cool. There are many wishes on his birthday and one of them is that he doesn’t change. You need that one voice to tell the powers that be to where to get lost.","pubDate":"2023-12-01 00:01:48","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ce1480d672245b12b82b6776d1157e1f","title":"Himaru sparks bright to win Under 15 Youth League Best Bowler award","link":"http://island.lk/himaru-sparks-bright-to-win-under-15-youth-league-best-bowler-award/","keywords":["Sports","Himaru Deshan","Holy Cross Colleg"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Reemus Fernando Holy Cross College, Kalutara spinner Himaru Deshan emerged the best bowler of the tournament as his team Colombo South Under 15s beat Colombo North in the final of the Sri Lanka Cricket conducted Under 15 Youth League tournament at MCA ground on Wednesday. After missing the Best Bowler title by a […]","content":"Holy Cross College, Kalutara spinner Himaru Deshan emerged the best bowler of the tournament as his team Colombo South Under 15s beat Colombo North in the final of the Sri Lanka Cricket conducted Under 15 Youth League tournament at MCA ground on Wednesday. After missing the Best Bowler title by a small margin at the last edition, Deshan made sure that he would be the bowler to watch in the final as he topped the list of highest wicket takers of the tournament by the time the league matches were concluded. He had 14 wickets against his name before the final and produced controlled spells to restrict Colombo North to 170 runs in the decisive encounter. His ten overs in the final which included three maidens cost just 27 runs. He was responsible for removing open batsman Kavith de Silva in the final. The left-arm-spinner commenced the tournament with a bang taking five wickets against Galle U15s. He gave away just 22 runs in his seven overs which included three maidens. When Colombo South met Colombo North in the league match, he took two wickets. In that match he shared the new ball and gave away just 14 runs in his nine overs. In the match against Dambulla, Deshan grabbed three wickets for 14 runs in ten overs as the opponents were dismissed for a mere 65 runs. Kandy too were dismissed for a similar number of runs with Deshan taking four wickets for 11 runs in 5.3 overs (three maidens). A frontline bowler in the Holy Cross First XI team, Deshan has reaped the benefit of playing Under 19 cricket. He has been identified by his school as a future captain of the first XI and has captained the school’s Under 13 and Under 15 teams.","pubDate":"2023-11-30 23:40:44","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c72d15b4b1b7806b38353bba2380896f","title":"Akpata hails Nigeria’s progress despite W’Cup ticket loss","link":"https://dailytrust.com/akpata-hails-nigerias-progress-despite-wcup-ticket-loss/","keywords":["Sports"],"creator":[". ."],"video_url":null,"description":"President of the Nigeria Cricket Federation Uyi Akpta says the country has made tremendous progress at the ongoing ICC T20 World Cup African qualifiers in Namibia despite missing out on the tickets to play in the USA and West Indies next year. The Yellow Greens, who batted first, posted 110 for the loss of eight […]","content":"President of the Nigeria Cricket Federation Uyi Akpta says the country has made tremendous progress at the ongoing ICC T20 World Cup African qualifiers in Namibia despite missing out on the tickets to play in the USA and West Indies next year. The Yellow Greens, who batted first, posted 110 for the loss of eight wickets in 20 overs while Zimbabwe made the required 111 runs for the loss of four wickets with 36 balls remaining. With only pride left to play for, Nigeria look set to finish off the event in fifth place despite a Namibian encounter left on the cards","pubDate":"2023-11-30 23:33:16","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"d48f8c467c3287c770851f0860f87e04","title":"ODI Cricket: ২০২৩ বিশ্বকাপেই সম্ভবত নিজেদের শেষ ওয়ান ডে ম্য়াচ খেলে ফেলেছেন এই তারকারা","link":"https://bengali.abplive.com/photo-gallery/sports/cricket-list-of-players-from-10-team-in-cwc-2023-who-might-have-played-last-odi-match-in-pics-1028044","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"ODI Cricket: ২০২৩ বিশ্বকাপেই সম্ভবত নিজেদের শেষ ওয়ান ডে ম্য়াচ খেলে ফেলেছেন এই তারকারা","content":"প্রাক্তন শ্রীলঙ্কান অধিনায়ক অ্যাঞ্জেলো ম্যাথিউজ়ের রেকর্ড সব ফর্ম্যাটেই অনবদ্য। তিনি প্রাথমিক দলে না থাকলেও, চোট আঘাতের জেরে দলে সুযোগ পান। তাঁকে এর পরবর্তীতে আর আন্তর্জাতিক আঙিনায় দেখা যাবে কি না, সেই নিয়ে সন্দেহ রয়েইছে। নেদারল্যান্ডসের হয়ে ২০১১ সালের বিশ্বকাপ দলে থাকা একমাত্র সদস্য ওয়েসলি বারেসি যিনি এই বিশ্বকাপেও খেলেছেন। এ বারের বিশ্বকাপে ডাচ দল বেশ ভালই পারফর্ম করেছে। তবে ব্যক্তিগতভাবে বারেসি পারফরম্যান্স তেমন আহামরি ছিল না। তিনি টুর্নামেন্টে মাত্র ৮৩ রান করেছেন। তাঁর বয়স এবং তরুণ প্রজন্মের উত্থানের জেরে বারেসিকে জাতীয় দলে জায়গা হারাতে হতে পারে। নিউজ়িল্যান্ডের সর্বকালের সেরা বোলারদের নাম উঠলে টিম সাউদির নাম আসবেই। তবে ২২১টি ওয়ান ডে উইকেট নেওয়া সাউদি হালে বারংবার চোট আঘাতে ভুগেছেন। তিনি কিউয়ি টেস্ট দলের অধিনায়কও বটে। তাই হয়তো সীমিত ওভারের বদলে তাঁকে আরও বেশি করে লাল বলে ক্রিকেটে মনোনিবেশ করতে দেখা যেতেই পারে। বেন স্টোকস আগেই ওয়ান ডে ফর্ম্যাট থেকে অবসর নিয়েছিলেন। তবে বিশ্বকাপের আগে তাঁকে ফেরানো। বিশ্বকাপের পরেই আবার হাঁটুর অস্ত্রোপ্রচার সেরেছেন স্টোকস। ইংল্যান্ডের টেস্ট অধিনায়কের ক্ষেত্রে তিন ফর্ম্যাটে খেলা চালিয়ে যাওয়াটা কিন্তু ভীষণ চ্যালেঞ্জিং হতে চলেছে। ডেভিড মিলার লোয়ার অর্ডারে দক্ষিণ আফ্রিকার হয়ে একাধিক ম্যাচ জিতিয়েছেন। এই বিশ্বকাপের সেমিফাইনালে গোটা দলের ব্যর্থ হলেও, মিলার শতরান হাঁকান। তিনি সম্পূর্ণভাবে আর ওয়ান ডেতে সুযোগ পাবেন না, এমনটা বলা না গেলেও, তাঁর বয়স বাঁধা হয়ে দাঁড়াতে পারে। আফগানিস্তান ক্রিকেটের উত্থানের পিছনে তাঁর অবদান অনস্বীকার্য। আন্তর্জাতিক ক্রিকেটে আফগানদের একেবারে শুরুর সময় থেকে দলের অংশ মহম্মদ নবি। তবে ৩৯-র নবির আর কতদিন আন্তর্জাতিক ক্রিকেট খেলবেন, সেই নিয়ে সংশয় তো আছেই। ৩৭-র ডেভিড ওয়ার্নার বিশ্বচ্যাম্পিয়ন অস্ট্রেলিয়ার হয়ে টুর্নামেন্টের সর্বাধিক রানসংগ্রাহক হয়েছিলেন। তবে তিনি যে নিজের কেরিয়ারের শেষ পর্যায়ে পৌঁছে গিয়েছেন, তার পূর্বাভাস বারংবার মিলেছে। বাংলাদেশের ওয়ান ডে দলের পরিকল্পনা থেকে মাহমুদ্দুলাহকে বাইরেই রাখা হয়েছিল। তবে শেষ মুহূর্তে তিনি দলে সুযোগ পান। বিশ্বকাপে শতরানও হাঁকান। তবে বিশ্বকাপে বাংলাদেশের হতশ্রী পারফরম্যান্সের পর বেশ কিছু রদবদল হতে পারে। ৩৭-র মাহমুদ্দুলাহর ওয়ান ডে কেরিয়ারে এর জেরে ইতি টানতে হতে পারে। বিশ্বকাপে পাকিস্তানের খারাপ পারফরম্যান্সের অন্যতম বড় কারণ মিডল অর্ডারের ব্যর্থতা। সেই মিডল অর্ডারেরই অংশ ছিলেন ইফতিকার আমেদ। তিনি নয় ম্যাচে মাত্র ১৪২ রান করেছিলেন। পাকিস্তান ক্রিকেটে বিশ্বকাপের পর ইতিমধ্যেই বেশ বদল হয়েছে। রয়েছে আরও বদলের সম্ভাবনা। তাই ইফতিকারের ভবিষ্যৎ নিয়ে প্রশ্নচিহ্ন রয়েইছে। আর অশ্বিন এমনিতেই বহুদিন ধরে ভারতীয় ওয়ান ডে দলের অংশ ছিলেন না। তবে অক্ষর পটেলের চোট তাঁকে বিশ্বকাপ দলে জায়গা করে দেয়। ভারতীয় দলে স্পিনারের অভাব নেই। তাই ৩৭ বছর বয়সি অশ্বিনকে আর ওয়ান ডে ফর্ম্যাটে খেলতে দেখা যাবে কি না, সেই নিয়ে সন্দেহ রয়েছে। South Bengal Weather: উধাও শীতের আমেজ, ডিসেম্বরের শুরুতে কেমন আবহাওয়া? কবে ফিরবে ঠান্ডা?","pubDate":"2023-11-30 22:38:36","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/01/64f5b6afaf6e80f2b915efef556decbf1701383810941507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"b2f4f458df9c8eaac591629cd95ee0ea","title":"RAZA DISLODGES MASAKADZA . . . Chevrons out of T20 World Cup","link":"https://www.herald.co.zw/raza-dislodges-masakadza-chevrons-out-of-t20-world-cup/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Lawrence Moyo-Head Zimpapers Sports NATIONAL cricket captain Sikandar Raza became the highest T20 international run scorer for the Chevrons as Zimbabwe beat Kenya by 110 runs in their final 2024 World Cup qualifier in Windhoek yesterday. Despite the huge win, the Chevrons missed out on a Top Two position for the remaining slots at the […]","content":"Kenya 6 3 3 0 0 6 -0.911 Nigeria 6 1 4 0 1 3 -1.026 Tanzania 6 1 5 0 0 2 -1.507 Rwanda 6 0 5 0 1 1 -4.303 Gerald Sibanda ZIMBABWEANS Daniel Msendami and Cleopas Dube’s Botswana-based side Jwaneng Galaxy will be playing another important CAF Champions League match this weekend when they take on Tanzanian giants Simba SC at Oberd Itani Chilume Stadium in Francistown tomorrow. Msendami, who has been a revelation for Galaxy, said he is just enjoying himself and is […] Collin Matiza-Sports Editor HE just couldn’t resist it! Ace motor racing driver Mano Zevgolis has come out of semi-retirement and will this weekend be part of the country’s top drivers who will burn the track during the Fuchs Lubricants 3-Hour Endurance Race in Bulawayo. Zevgolis, who was a dominant force in the local drag racing […] Eddie Chikamhi-Senior Sports Reporter THE Castle Lager Premier Soccer League strikers come under the spotlight tonight as young Takunda Benhura walks to the podium to collect the Golden Boot award. Benhura, who featured in his first full season with newly-crowned champions Ngezi Platinum Stars, emerged the best of the lot after scoring 13 goals this […]","pubDate":"2023-11-30 22:02:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"54daa4be9285486212c6a5e482b7c975","title":"Ngezi schoolboy targets Chibuku Trophy glory","link":"https://www.herald.co.zw/ngezi-schoolboy-targets-chibuku-trophy-glory/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Bruce Chikuni THE long wait for Ngezi Platinum Stars to be crowned Castle Lager Premiership champions ended last weekend at Barbourfields when they were handed their title. It was double celebration for midfielder, Nisbert Muzenda, who finished writing his A Level exams at Wanganui in Mhondoro last week. The 17-year-old joined a very small group […]","content":"Lawrence Moyo-Head Zimpapers Sports NATIONAL cricket captain Sikandar Raza became the highest T20 international run scorer for the Chevrons as Zimbabwe beat Kenya by 110 runs in their final 2024 World Cup qualifier in Windhoek yesterday. Despite the huge win, the Chevrons missed out on a Top Two position for the remaining slots at the […] Tadious Manyepo-Sports Reporter ZIMBABWE female boxer Kudakwashe “Take Money” Chiwandire has roped in highly-rated South Africa-based pugilist Tarisai Mutsau to help her out in sparring sessions as she intensifies preparations ahead of her World Boxing Council (WBC) international bout to be staged in Australia in a fortnight. Chiwandire is challenging for the belt against Indian […] Ray Bande in Mutare EASTERN Region Division One side Tenax FC are not happy with the boardroom decision to promote Bikita Minerals into the Premiership after the correctional services side had seemingly won the championship on the final day. Tenax have since reached out to the Zifa Normalisation Committee as well as the Sports and […]","pubDate":"2023-11-30 22:02:24","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7916f1cf0b2bb3d0f7e7530e9d2e1940","title":"Uganda qualify for Men’s T20 World Cup for first time","link":"https://blueprint.ng/uganda-qualify-for-mens-t20-world-cup-for-first-time/","keywords":["Sports"],"creator":["Content Administrator I"],"video_url":null,"description":"Uganda qualified for the Men’s T20 World Cup for the first time with a nine-wicket victory over Rwanda in African qualifying.The win meant the Cricket Cranes, ranked 23rd in the world, clinched second place in the six-team tournament in Windhoek, Namibia. Uganda will join Namibia at the 20-team finals in the United States and the West Indies next year after Read More The post Uganda qualify for Men’s T20 World Cup for first time appeared first on Blueprint Newspapers Limited.","content":"Uganda qualified for the Men’s T20 World Cup for the first time with a nine-wicket victory over Rwanda in African qualifying. The win meant the Cricket Cranes, ranked 23rd in the world, clinched second place in the six-team tournament in Windhoek, Namibia. Uganda will join Namibia at the 20-team finals in the United States and the West Indies next year after the Eagles qualified with a game to spare on Tuesday. “It is pretty surreal,” captain Brian Masaba said. “I can’t put words to the emotions we are feeling now as a team. It’s massive for Ugandan cricket and huge for African cricket, especially, for a country like Uganda to make it to the World Cup.” Having opened with a win over Tanzania and then a defeat by Namibia, Uganda upset Zimbabwe in their third game on Sunday, winning by five wickets in their first T20 International against a full ICC member. The East Africans subsequently cruised to a nine-wicket triumph over Nigeria and beat neighbours Kenya by 33 runs on Wednesday to move to the brink of qualification. They won the toss against Rwanda and decided to field, bowling out their opponents for 65 inside 19 overs. Uganda reached their target of 66 runs, for the loss of one wicket, in just 8.1 overs. The team celebrated with a small band of travelling fans after opener Simon Ssesazi hit the winning run to clinch victory and qualification. “A lot of work has gone on behind the scenes to get us where we are today,” Masaba said. “It has been years of toil and hard work, four or five years of sacrifice. The fans joining in the celebrations was pretty special.” Masaba believes the chance to face the likes of T20 World Cup holders England and established Test nations such as India and Australia next June could “open a lot of doors” for Ugandan cricket. “I think the whole world realises there is a lot of potential outside the big nations,” the 32-year-old added. “Hopefully this is something the government and sponsors can get behind.” Zimbabwe’s men were the top-ranked side in the African qualifiers at 11th in the world, one place ahead of Namibia. The Chevrons have played at six of the eight previous editions of the T20 World Cup and reached the Super 12 stage in Australia last year, but will miss out on next year’s tournament.","pubDate":"2023-11-30 20:39:00","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"ab04797e1c78e48f5c5c30913d9e8543","title":"Suryakumar to lead T20I side, KL Rahul to captain in ODIs in SA","link":"https://kashmirreader.com/2023/12/01/suryakumar-to-lead-t20i-side-kl-rahul-to-captain-in-odis-in-sa/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Suryakumar Yadav, who is captaining the Indian team in the ongoing five-match T20I series against Australia, will continue in the role in the shortest format during the three-match series against South Africa beginning on December 10 in Durban, while KL Rahul will be the skipper for the three-match ODI series against the Proteas. […]","content":"New Delhi: Suryakumar Yadav, who is captaining the Indian team in the ongoing five-match T20I series against Australia, will continue in the role in the shortest format during the three-match series against South Africa beginning on December 10 in Durban, while KL Rahul will be the skipper for the three-match ODI series against the Proteas. The BCCI selection committee, which met here on Thursday, also decided to make pace spearhead Jasprit Bumrah as Rohit Sharma’s deputy in the two-Test series beginning on December 26 in Centurion. Rahul will keep wickets in the Test series. Both Rohit and Virat Kohli requested the Indian cricket board for a break from the white-ball leg of the tour. B Sai Sudharshan and Rinku Singh have received maiden call-ups in the Indian ODI squad. The selection committee meeting was held in the presence of head coach Rahul Dravid. The three-match T20I series will begin on December 10, which will be followed by three ODIs starting December 17 in Johannesburg. PTI Suryakumar to lead T20I side, KL Rahul to captain in ODIs in SA added by Press Trust of India on 1:52 am December 1, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-11-30 20:22:38","image_url":"https://secure.gravatar.com/avatar/1c87210d7bdbbe5456221da94b25d939?s=100&d=mm&r=g","source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4b41a1a9099ead85d450b18f12805fd6","title":"Shan Masood promoted to B category in PCB’s central contract list","link":"https://www.nation.com.pk/01-Dec-2023/shan-masood-promoted-to-b-category-in-pcb-s-central-contract-list","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE- The Pakistan Cricket Board (PCB) has upgraded Pakistan Test captain Shan Masood’s category in the central con­tract list from D to B.","content":null,"pubDate":"2023-11-30 20:17:15","image_url":null,"source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"c8530edace777087c5424c92fa0df214","title":"Najmul’s century puts Bangladesh in control in Sylhet","link":"https://www.gulf-times.com/article/672744/sports/najmuls-century-puts-bangladesh-in-control-in-sylhet","keywords":null,"creator":["info@gulf-times.com (Gulf Times)"],"video_url":null,"description":"Skipper Najmul Hossain Shanto hit his third Test century in four innings to put Bangladesh on course for a strong total in the second innings of the first Test against New Zealand in Sylhet yesterday....","content":"Skipper Najmul Hossain Shanto hit his third Test century in four innings to put Bangladesh on course for a strong total in the second innings of the first Test against New Zealand in Sylhet yesterday. The hosts reached 212-3 at stumps on the third day, leading New Zealand by 205 runs, with Najmul unbeaten on 104. Former captain Mushfiqur Rahim made an unbeaten 43 and put on 96 runs in the unbroken fourth-wicket stand with Najmul. Najmul, who scored a century in both innings of Bangladesh’s previous Test against Afghanistan in June, also shared 90 runs with Mominul Haque for the third wicket. The left-hander has now become the first Bangladeshi cricketer to score a hundred on his debut as Test captain. He took his hundred, his fourth in Tests, with a single off Ajaz Patel in 191 balls before signing off the day in style with a boundary in the last ball. The 25-year-old has struck 10 fours so far in his innings. He was however involved in two runouts on the day, with the last being Mominul, who made 40. Najmul and Mominul helped Bangladesh recover from 26-2 after New Zealand made 317 in their first innings to take a slender seven-run lead. Mominul praised Najmul for his “outstanding” batting. “He knows very well about his game and has a clear mind,” Mominul said. Patel, the only New Zealand bowler with some success on the day, trapped opener Zakir Hasan leg-before for 17. Tim Southee directed a straight drive by Najmul onto the stumps at the non-striking end to run out Mahmudul Hasan for eight next over. Mominul, who joined Najmul in the rescue act, was also the hero for Bangladesh with the ball, having taken the last two New Zealand wickets in the morning. The tourists, replying to Bangladesh’s first-innings 310, resumed on 266-8, still 44 runs behind. Southee and Kyle Jamieson frustrated Bangladesh for more than an hour to share 52 runs for the ninth wicket, until left-arm spinner Mominul removed them both in the same over. Mominul trapped Jamieson leg-before for 23 to leave New Zealand 316-9, and then bowled Southee four balls later for 35 to finish with career-best figures of 3-4. “We definitely didn’t think it was going to be easy to rock up in the second innings and knock them over,” Jamieson said. “We’ve still got some work to do tomorrow and try and chip out a few more.” Southee hit three boundaries in his 62-ball stay. The two-match series is the beginning of a new cycle in the World Test Championship for both teams. SCOREBOARDBangladesh I innings 310 all out New Zealand I innings (266-8 overnight) T. Latham c Nayeem b Taijul 21 D. Conway c Shahadat b Mehidy 12 K. Williamson b Taijul 104 H. Nicholls c Nurul b Shoriful 19 D. Mitchell st Nurul b Taijul 41 T. Blundell c Nurul b Nayeem 6 G. Phillips c Najmul b Mominul 42 K. Jamieson lbw b Mominul 23 I. Sodhi c Shahadat b Taijul 0 T. Southee b Mominul 35 A. Patel not out 1 Extras (b8, lb5) 13 Total (all out; 101.5 overs) 317 Fall of wickets: 1-36 (Latham), 2-44 (Conway), 3-98 (Nicholls), 4-164 (Mitchell), 5-175 (Blundell), 6-253 (Phillips), 7-262 (Williamson), 8-264 (Sodhi), 9-316 (Jamieson), 10-317 (Southee) Bowling: Shoriful 13-2-54-1, Mehidy 22-3-64-1, Taijul 39-9-109-4, Nayeem 24-3-73-1, Mominul 3.5-1-4-3 Bangladesh II inningsM. Hasan run out 8 Z. Hasan lbw b Patel 17 N. Hossain not out 104 M. Haque run out 40 M. Rahim not out 43 Extras 0 Total (three wickets; 68 overs) 212To bat: Shahadat Hossain, Nurul Hasan, Mehidy Hasan Miraz, Taijul Islam, Shoriful Islam, Nayeem Hasan Fall of wickets: 1-23 (Zakir), 2-26 (Mahmudul), 3-116 (Mominul) Bowling: Southee 12-3-22-0, Jamieson 9-3-19-0, Patel 23-1-94-1, Phillips 12-4-36-0, Sodhi 12-1-41-0 Toss: Bangladesh Umpires: Ahsan Raza (PAK), Paul Reiffel (AUS)","pubDate":"2023-11-30 20:17:00","image_url":"https://www.gulf-times.com/gulftimes/uploads/images/2023/11/30/108537.jpg","source_id":"gulftimes","source_priority":433545,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"article_id":"610c51ecdda77c1738550de95d2abec8","title":"The Emperor at 60!","link":"http://island.lk/the-emperor-at-60/","keywords":["Sports","Arjuna Ranatunga","BCCI","Featured","SLC"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Rex Clementine Arjuna Ranatunga hasn’t spared any sacred cow. All those years ago, he targeted Shane Warne calling him an ordinary cricketer and there was no love lost between the two of them. Yet, when there was a ceremony remembering Warne in Galle last year ahead of the Australia – Sri Lanka Test […]","content":"Arjuna Ranatunga hasn’t spared any sacred cow. All those years ago, he targeted Shane Warne calling him an ordinary cricketer and there was no love lost between the two of them. Yet, when there was a ceremony remembering Warne in Galle last year ahead of the Australia – Sri Lanka Test match, he not only showed up but urged a few of his team mates to come along. Exterior is rough and tough but interior is soft and kind. Sportsmen rewrite record books. But Arjuna more often rewrote the rule books. He also upset the apple cart, told the Board Chairman once to get out of the Sri Lankan dressing room, broke a few glass ceilings and was a pain for successive administrations of the sport both here and overseas. He turns 60 today. As India cements owner N. Srinivasan made a regal entry into cricket governance, everyone was careful not even to talk anything out of turn. The business tycoon was known for his ruthlessness. Influential figures in cricket who knew inside out of the devout Brahmin warned that never to cross Srinivasan’s path. But Arjuna took on Srinivasan. He was the only one. The rest of them, including the founding members of the ICC – England and Australia fell in line with him and agreed for the Big Three takeover of the ICC and a larger portion of ICC revenue to India. Only Arjuna spoke out. This is an unfair world and cricket is an unfair sport. It’s not supposed to be that way. Forget the world. At least cricket is supposed to be a fair playing field. Srinivasan taught Arjuna a bitter lesson. He contacted Sports Minister Gamini Lokuge and promised a tour of India that would bring US$ 10 million to SLC. But only on one condition. The government had to get rid of Arjuna as the Board Chairman. Lokuge said deal. Arjuna was out. That Lokuge went and signed a television deal with a backlisted company and plundered millions of dollars is a different story. The rule of the day seems that in cricket everyone should make money. Ministers, Presidential Advisors, Lawyers, Law Enforcement Officers and even us reporters. To hell with cricket. Even if the national cricket team’s performance has hit an all time low it doesn’t matter as long as the board is making profits. It is fine if we don’t play international cricket for nearly three months when the IPL is on. The important thing is not to antagonize India. You thought the Srinivasan episode would have taught Arjuna a few lessons. No. He has not learned a single thing. Srinivasan though only had clout being the big boss of BCCI. His successor Jay Shah not only has clout, but he has even political power being the son of India’s Interior Minister and number two of the ruling BJP after the Prime Minister. You knew what was in store for Arjuna when he ridiculed Shah. It was stupid. It was politically incorrect. The most sensible thing to do these days is to go with the flow. That is what Australian boss Mike Barid is doing. That is what Richard Thomson, the Chairman of England and Wales Cricket Board is doing, That is what right right is doing. Why go and take on of all people Jay Shah? But that is Arjuna for you. He calls a spade a spade. Diplomacy is not his best trait. We all agreed that during the Asia Cup having a reserve day for just the India – Pakistan game was insane. But no body said a word. No one wants to antagonize the BCCI. Arjuna did. He called it ridiculous. An Indian reporter asked him what he would have done if he were Sri Lanka’s captain. “I would have walked out with my team without playing the tournament. It’s not fair. Let them play an India – Pakistan final. This is not how I play cricket,” he said. How we long for those days. It would have been a nightmare for the ICC to deal with this guy. At a time when our captains are happy to stand and take selfies with Virat Kohli, here’s one man who could have given Kohli as much as the Indian captain dishes out to others. At the age of 60 and being the grandfather of two, at least now you hope that Arjuna plays it safe. But that is not what he is. He has been always that combative kind of guy. Playing his first game against his idol Sunil Gavaskar, Arjuna had goosebumps. It was a surreal moment. But the competitive nature in him compelled him to take on the Indian captain and get under his skin. Gavaskar wasn’t upset but was impressed by what he saw in the teenager. He quietly went up to Board Charmian Gamini Dissanayake and told him, ‘Look after that boy. He will change Sri Lankan cricket one day.’ At times you tend to think that Arjuna is old school, but his observations on the game are quite sharp. India had come to Colombo for the Under-19 World Cup in 2006. One Rohit Sharma impressed him. In subsequent years when the Indian senior team visited Sri Lanka and reporters interviewed him he kept on asking why Rohit Sharma is not part of the senior side. The Indians wondered why he is so obsessed with Rohit Sharma. The proof was there soon in what Rohit has gone onto achieve in the game. Arjuna’s humour is quite unique too. For all these guys who have gone onto play the game at the highest level they have their humorous side. Once he was captaining a World XI team against an Australian XI in Adelaide in an exhibition game. Ashwin Ferro, a reporter from Mid-Day newspaper from Bombay had gone to Adelaide for reporting. A few World XI players were having niggles and the reporter had to play the game. Arjuna looked at him and said, ‘Hey you. You are bowling the first over.’ The poor reporter asked, ‘Why me.’ Arjuna replied. ‘You are from Bombay right. Most Ranji Trophy wins and all. Yes, you are bowling the first over.’ It’s been a glorious 60 for the captain cool. There are many wishes on his birthday and one of them is that he doesn’t change. You need that one voice to tell the powers that be to where to get lost.","pubDate":"2023-12-01 00:01:48","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ce1480d672245b12b82b6776d1157e1f","title":"Himaru sparks bright to win Under 15 Youth League Best Bowler award","link":"http://island.lk/himaru-sparks-bright-to-win-under-15-youth-league-best-bowler-award/","keywords":["Sports","Himaru Deshan","Holy Cross Colleg"],"creator":["Thilina Walpola"],"video_url":null,"description":"by Reemus Fernando Holy Cross College, Kalutara spinner Himaru Deshan emerged the best bowler of the tournament as his team Colombo South Under 15s beat Colombo North in the final of the Sri Lanka Cricket conducted Under 15 Youth League tournament at MCA ground on Wednesday. After missing the Best Bowler title by a […]","content":"Holy Cross College, Kalutara spinner Himaru Deshan emerged the best bowler of the tournament as his team Colombo South Under 15s beat Colombo North in the final of the Sri Lanka Cricket conducted Under 15 Youth League tournament at MCA ground on Wednesday. After missing the Best Bowler title by a small margin at the last edition, Deshan made sure that he would be the bowler to watch in the final as he topped the list of highest wicket takers of the tournament by the time the league matches were concluded. He had 14 wickets against his name before the final and produced controlled spells to restrict Colombo North to 170 runs in the decisive encounter. His ten overs in the final which included three maidens cost just 27 runs. He was responsible for removing open batsman Kavith de Silva in the final. The left-arm-spinner commenced the tournament with a bang taking five wickets against Galle U15s. He gave away just 22 runs in his seven overs which included three maidens. When Colombo South met Colombo North in the league match, he took two wickets. In that match he shared the new ball and gave away just 14 runs in his nine overs. In the match against Dambulla, Deshan grabbed three wickets for 14 runs in ten overs as the opponents were dismissed for a mere 65 runs. Kandy too were dismissed for a similar number of runs with Deshan taking four wickets for 11 runs in 5.3 overs (three maidens). A frontline bowler in the Holy Cross First XI team, Deshan has reaped the benefit of playing Under 19 cricket. He has been identified by his school as a future captain of the first XI and has captained the school’s Under 13 and Under 15 teams.","pubDate":"2023-11-30 23:40:44","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c72d15b4b1b7806b38353bba2380896f","title":"Akpata hails Nigeria’s progress despite W’Cup ticket loss","link":"https://dailytrust.com/akpata-hails-nigerias-progress-despite-wcup-ticket-loss/","keywords":["Sports"],"creator":[". ."],"video_url":null,"description":"President of the Nigeria Cricket Federation Uyi Akpta says the country has made tremendous progress at the ongoing ICC T20 World Cup African qualifiers in Namibia despite missing out on the tickets to play in the USA and West Indies next year. The Yellow Greens, who batted first, posted 110 for the loss of eight […]","content":"President of the Nigeria Cricket Federation Uyi Akpta says the country has made tremendous progress at the ongoing ICC T20 World Cup African qualifiers in Namibia despite missing out on the tickets to play in the USA and West Indies next year. The Yellow Greens, who batted first, posted 110 for the loss of eight wickets in 20 overs while Zimbabwe made the required 111 runs for the loss of four wickets with 36 balls remaining. With only pride left to play for, Nigeria look set to finish off the event in fifth place despite a Namibian encounter left on the cards","pubDate":"2023-11-30 23:33:16","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"d48f8c467c3287c770851f0860f87e04","title":"ODI Cricket: ২০২৩ বিশ্বকাপেই সম্ভবত নিজেদের শেষ ওয়ান ডে ম্য়াচ খেলে ফেলেছেন এই তারকারা","link":"https://bengali.abplive.com/photo-gallery/sports/cricket-list-of-players-from-10-team-in-cwc-2023-who-might-have-played-last-odi-match-in-pics-1028044","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"ODI Cricket: ২০২৩ বিশ্বকাপেই সম্ভবত নিজেদের শেষ ওয়ান ডে ম্য়াচ খেলে ফেলেছেন এই তারকারা","content":"প্রাক্তন শ্রীলঙ্কান অধিনায়ক অ্যাঞ্জেলো ম্যাথিউজ়ের রেকর্ড সব ফর্ম্যাটেই অনবদ্য। তিনি প্রাথমিক দলে না থাকলেও, চোট আঘাতের জেরে দলে সুযোগ পান। তাঁকে এর পরবর্তীতে আর আন্তর্জাতিক আঙিনায় দেখা যাবে কি না, সেই নিয়ে সন্দেহ রয়েইছে। নেদারল্যান্ডসের হয়ে ২০১১ সালের বিশ্বকাপ দলে থাকা একমাত্র সদস্য ওয়েসলি বারেসি যিনি এই বিশ্বকাপেও খেলেছেন। এ বারের বিশ্বকাপে ডাচ দল বেশ ভালই পারফর্ম করেছে। তবে ব্যক্তিগতভাবে বারেসি পারফরম্যান্স তেমন আহামরি ছিল না। তিনি টুর্নামেন্টে মাত্র ৮৩ রান করেছেন। তাঁর বয়স এবং তরুণ প্রজন্মের উত্থানের জেরে বারেসিকে জাতীয় দলে জায়গা হারাতে হতে পারে। নিউজ়িল্যান্ডের সর্বকালের সেরা বোলারদের নাম উঠলে টিম সাউদির নাম আসবেই। তবে ২২১টি ওয়ান ডে উইকেট নেওয়া সাউদি হালে বারংবার চোট আঘাতে ভুগেছেন। তিনি কিউয়ি টেস্ট দলের অধিনায়কও বটে। তাই হয়তো সীমিত ওভারের বদলে তাঁকে আরও বেশি করে লাল বলে ক্রিকেটে মনোনিবেশ করতে দেখা যেতেই পারে। বেন স্টোকস আগেই ওয়ান ডে ফর্ম্যাট থেকে অবসর নিয়েছিলেন। তবে বিশ্বকাপের আগে তাঁকে ফেরানো। বিশ্বকাপের পরেই আবার হাঁটুর অস্ত্রোপ্রচার সেরেছেন স্টোকস। ইংল্যান্ডের টেস্ট অধিনায়কের ক্ষেত্রে তিন ফর্ম্যাটে খেলা চালিয়ে যাওয়াটা কিন্তু ভীষণ চ্যালেঞ্জিং হতে চলেছে। ডেভিড মিলার লোয়ার অর্ডারে দক্ষিণ আফ্রিকার হয়ে একাধিক ম্যাচ জিতিয়েছেন। এই বিশ্বকাপের সেমিফাইনালে গোটা দলের ব্যর্থ হলেও, মিলার শতরান হাঁকান। তিনি সম্পূর্ণভাবে আর ওয়ান ডেতে সুযোগ পাবেন না, এমনটা বলা না গেলেও, তাঁর বয়স বাঁধা হয়ে দাঁড়াতে পারে। আফগানিস্তান ক্রিকেটের উত্থানের পিছনে তাঁর অবদান অনস্বীকার্য। আন্তর্জাতিক ক্রিকেটে আফগানদের একেবারে শুরুর সময় থেকে দলের অংশ মহম্মদ নবি। তবে ৩৯-র নবির আর কতদিন আন্তর্জাতিক ক্রিকেট খেলবেন, সেই নিয়ে সংশয় তো আছেই। ৩৭-র ডেভিড ওয়ার্নার বিশ্বচ্যাম্পিয়ন অস্ট্রেলিয়ার হয়ে টুর্নামেন্টের সর্বাধিক রানসংগ্রাহক হয়েছিলেন। তবে তিনি যে নিজের কেরিয়ারের শেষ পর্যায়ে পৌঁছে গিয়েছেন, তার পূর্বাভাস বারংবার মিলেছে। বাংলাদেশের ওয়ান ডে দলের পরিকল্পনা থেকে মাহমুদ্দুলাহকে বাইরেই রাখা হয়েছিল। তবে শেষ মুহূর্তে তিনি দলে সুযোগ পান। বিশ্বকাপে শতরানও হাঁকান। তবে বিশ্বকাপে বাংলাদেশের হতশ্রী পারফরম্যান্সের পর বেশ কিছু রদবদল হতে পারে। ৩৭-র মাহমুদ্দুলাহর ওয়ান ডে কেরিয়ারে এর জেরে ইতি টানতে হতে পারে। বিশ্বকাপে পাকিস্তানের খারাপ পারফরম্যান্সের অন্যতম বড় কারণ মিডল অর্ডারের ব্যর্থতা। সেই মিডল অর্ডারেরই অংশ ছিলেন ইফতিকার আমেদ। তিনি নয় ম্যাচে মাত্র ১৪২ রান করেছিলেন। পাকিস্তান ক্রিকেটে বিশ্বকাপের পর ইতিমধ্যেই বেশ বদল হয়েছে। রয়েছে আরও বদলের সম্ভাবনা। তাই ইফতিকারের ভবিষ্যৎ নিয়ে প্রশ্নচিহ্ন রয়েইছে। আর অশ্বিন এমনিতেই বহুদিন ধরে ভারতীয় ওয়ান ডে দলের অংশ ছিলেন না। তবে অক্ষর পটেলের চোট তাঁকে বিশ্বকাপ দলে জায়গা করে দেয়। ভারতীয় দলে স্পিনারের অভাব নেই। তাই ৩৭ বছর বয়সি অশ্বিনকে আর ওয়ান ডে ফর্ম্যাটে খেলতে দেখা যাবে কি না, সেই নিয়ে সন্দেহ রয়েছে। South Bengal Weather: উধাও শীতের আমেজ, ডিসেম্বরের শুরুতে কেমন আবহাওয়া? কবে ফিরবে ঠান্ডা?","pubDate":"2023-11-30 22:38:36","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/01/64f5b6afaf6e80f2b915efef556decbf1701383810941507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"b2f4f458df9c8eaac591629cd95ee0ea","title":"RAZA DISLODGES MASAKADZA . . . Chevrons out of T20 World Cup","link":"https://www.herald.co.zw/raza-dislodges-masakadza-chevrons-out-of-t20-world-cup/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Lawrence Moyo-Head Zimpapers Sports NATIONAL cricket captain Sikandar Raza became the highest T20 international run scorer for the Chevrons as Zimbabwe beat Kenya by 110 runs in their final 2024 World Cup qualifier in Windhoek yesterday. Despite the huge win, the Chevrons missed out on a Top Two position for the remaining slots at the […]","content":"Kenya 6 3 3 0 0 6 -0.911 Nigeria 6 1 4 0 1 3 -1.026 Tanzania 6 1 5 0 0 2 -1.507 Rwanda 6 0 5 0 1 1 -4.303 Gerald Sibanda ZIMBABWEANS Daniel Msendami and Cleopas Dube’s Botswana-based side Jwaneng Galaxy will be playing another important CAF Champions League match this weekend when they take on Tanzanian giants Simba SC at Oberd Itani Chilume Stadium in Francistown tomorrow. Msendami, who has been a revelation for Galaxy, said he is just enjoying himself and is […] Collin Matiza-Sports Editor HE just couldn’t resist it! Ace motor racing driver Mano Zevgolis has come out of semi-retirement and will this weekend be part of the country’s top drivers who will burn the track during the Fuchs Lubricants 3-Hour Endurance Race in Bulawayo. Zevgolis, who was a dominant force in the local drag racing […] Eddie Chikamhi-Senior Sports Reporter THE Castle Lager Premier Soccer League strikers come under the spotlight tonight as young Takunda Benhura walks to the podium to collect the Golden Boot award. Benhura, who featured in his first full season with newly-crowned champions Ngezi Platinum Stars, emerged the best of the lot after scoring 13 goals this […]","pubDate":"2023-11-30 22:02:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"54daa4be9285486212c6a5e482b7c975","title":"Ngezi schoolboy targets Chibuku Trophy glory","link":"https://www.herald.co.zw/ngezi-schoolboy-targets-chibuku-trophy-glory/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Bruce Chikuni THE long wait for Ngezi Platinum Stars to be crowned Castle Lager Premiership champions ended last weekend at Barbourfields when they were handed their title. It was double celebration for midfielder, Nisbert Muzenda, who finished writing his A Level exams at Wanganui in Mhondoro last week. The 17-year-old joined a very small group […]","content":"Lawrence Moyo-Head Zimpapers Sports NATIONAL cricket captain Sikandar Raza became the highest T20 international run scorer for the Chevrons as Zimbabwe beat Kenya by 110 runs in their final 2024 World Cup qualifier in Windhoek yesterday. Despite the huge win, the Chevrons missed out on a Top Two position for the remaining slots at the […] Tadious Manyepo-Sports Reporter ZIMBABWE female boxer Kudakwashe “Take Money” Chiwandire has roped in highly-rated South Africa-based pugilist Tarisai Mutsau to help her out in sparring sessions as she intensifies preparations ahead of her World Boxing Council (WBC) international bout to be staged in Australia in a fortnight. Chiwandire is challenging for the belt against Indian […] Ray Bande in Mutare EASTERN Region Division One side Tenax FC are not happy with the boardroom decision to promote Bikita Minerals into the Premiership after the correctional services side had seemingly won the championship on the final day. Tenax have since reached out to the Zifa Normalisation Committee as well as the Sports and […]","pubDate":"2023-11-30 22:02:24","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7916f1cf0b2bb3d0f7e7530e9d2e1940","title":"Uganda qualify for Men’s T20 World Cup for first time","link":"https://blueprint.ng/uganda-qualify-for-mens-t20-world-cup-for-first-time/","keywords":["Sports"],"creator":["Content Administrator I"],"video_url":null,"description":"Uganda qualified for the Men’s T20 World Cup for the first time with a nine-wicket victory over Rwanda in African qualifying.The win meant the Cricket Cranes, ranked 23rd in the world, clinched second place in the six-team tournament in Windhoek, Namibia. Uganda will join Namibia at the 20-team finals in the United States and the West Indies next year after Read More The post Uganda qualify for Men’s T20 World Cup for first time appeared first on Blueprint Newspapers Limited.","content":"Uganda qualified for the Men’s T20 World Cup for the first time with a nine-wicket victory over Rwanda in African qualifying. The win meant the Cricket Cranes, ranked 23rd in the world, clinched second place in the six-team tournament in Windhoek, Namibia. Uganda will join Namibia at the 20-team finals in the United States and the West Indies next year after the Eagles qualified with a game to spare on Tuesday. “It is pretty surreal,” captain Brian Masaba said. “I can’t put words to the emotions we are feeling now as a team. It’s massive for Ugandan cricket and huge for African cricket, especially, for a country like Uganda to make it to the World Cup.” Having opened with a win over Tanzania and then a defeat by Namibia, Uganda upset Zimbabwe in their third game on Sunday, winning by five wickets in their first T20 International against a full ICC member. The East Africans subsequently cruised to a nine-wicket triumph over Nigeria and beat neighbours Kenya by 33 runs on Wednesday to move to the brink of qualification. They won the toss against Rwanda and decided to field, bowling out their opponents for 65 inside 19 overs. Uganda reached their target of 66 runs, for the loss of one wicket, in just 8.1 overs. The team celebrated with a small band of travelling fans after opener Simon Ssesazi hit the winning run to clinch victory and qualification. “A lot of work has gone on behind the scenes to get us where we are today,” Masaba said. “It has been years of toil and hard work, four or five years of sacrifice. The fans joining in the celebrations was pretty special.” Masaba believes the chance to face the likes of T20 World Cup holders England and established Test nations such as India and Australia next June could “open a lot of doors” for Ugandan cricket. “I think the whole world realises there is a lot of potential outside the big nations,” the 32-year-old added. “Hopefully this is something the government and sponsors can get behind.” Zimbabwe’s men were the top-ranked side in the African qualifiers at 11th in the world, one place ahead of Namibia. The Chevrons have played at six of the eight previous editions of the T20 World Cup and reached the Super 12 stage in Australia last year, but will miss out on next year’s tournament.","pubDate":"2023-11-30 20:39:00","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"ab04797e1c78e48f5c5c30913d9e8543","title":"Suryakumar to lead T20I side, KL Rahul to captain in ODIs in SA","link":"https://kashmirreader.com/2023/12/01/suryakumar-to-lead-t20i-side-kl-rahul-to-captain-in-odis-in-sa/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Suryakumar Yadav, who is captaining the Indian team in the ongoing five-match T20I series against Australia, will continue in the role in the shortest format during the three-match series against South Africa beginning on December 10 in Durban, while KL Rahul will be the skipper for the three-match ODI series against the Proteas. […]","content":"New Delhi: Suryakumar Yadav, who is captaining the Indian team in the ongoing five-match T20I series against Australia, will continue in the role in the shortest format during the three-match series against South Africa beginning on December 10 in Durban, while KL Rahul will be the skipper for the three-match ODI series against the Proteas. The BCCI selection committee, which met here on Thursday, also decided to make pace spearhead Jasprit Bumrah as Rohit Sharma’s deputy in the two-Test series beginning on December 26 in Centurion. Rahul will keep wickets in the Test series. Both Rohit and Virat Kohli requested the Indian cricket board for a break from the white-ball leg of the tour. B Sai Sudharshan and Rinku Singh have received maiden call-ups in the Indian ODI squad. The selection committee meeting was held in the presence of head coach Rahul Dravid. The three-match T20I series will begin on December 10, which will be followed by three ODIs starting December 17 in Johannesburg. PTI Suryakumar to lead T20I side, KL Rahul to captain in ODIs in SA added by Press Trust of India on 1:52 am December 1, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-11-30 20:22:38","image_url":"https://secure.gravatar.com/avatar/1c87210d7bdbbe5456221da94b25d939?s=100&d=mm&r=g","source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4b41a1a9099ead85d450b18f12805fd6","title":"Shan Masood promoted to B category in PCB’s central contract list","link":"https://www.nation.com.pk/01-Dec-2023/shan-masood-promoted-to-b-category-in-pcb-s-central-contract-list","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE- The Pakistan Cricket Board (PCB) has upgraded Pakistan Test captain Shan Masood’s category in the central con­tract list from D to B.","content":null,"pubDate":"2023-11-30 20:17:15","image_url":null,"source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"c8530edace777087c5424c92fa0df214","title":"Najmul’s century puts Bangladesh in control in Sylhet","link":"https://www.gulf-times.com/article/672744/sports/najmuls-century-puts-bangladesh-in-control-in-sylhet","keywords":null,"creator":["info@gulf-times.com (Gulf Times)"],"video_url":null,"description":"Skipper Najmul Hossain Shanto hit his third Test century in four innings to put Bangladesh on course for a strong total in the second innings of the first Test against New Zealand in Sylhet yesterday....","content":"Skipper Najmul Hossain Shanto hit his third Test century in four innings to put Bangladesh on course for a strong total in the second innings of the first Test against New Zealand in Sylhet yesterday. The hosts reached 212-3 at stumps on the third day, leading New Zealand by 205 runs, with Najmul unbeaten on 104. Former captain Mushfiqur Rahim made an unbeaten 43 and put on 96 runs in the unbroken fourth-wicket stand with Najmul. Najmul, who scored a century in both innings of Bangladesh’s previous Test against Afghanistan in June, also shared 90 runs with Mominul Haque for the third wicket. The left-hander has now become the first Bangladeshi cricketer to score a hundred on his debut as Test captain. He took his hundred, his fourth in Tests, with a single off Ajaz Patel in 191 balls before signing off the day in style with a boundary in the last ball. The 25-year-old has struck 10 fours so far in his innings. He was however involved in two runouts on the day, with the last being Mominul, who made 40. Najmul and Mominul helped Bangladesh recover from 26-2 after New Zealand made 317 in their first innings to take a slender seven-run lead. Mominul praised Najmul for his “outstanding” batting. “He knows very well about his game and has a clear mind,” Mominul said. Patel, the only New Zealand bowler with some success on the day, trapped opener Zakir Hasan leg-before for 17. Tim Southee directed a straight drive by Najmul onto the stumps at the non-striking end to run out Mahmudul Hasan for eight next over. Mominul, who joined Najmul in the rescue act, was also the hero for Bangladesh with the ball, having taken the last two New Zealand wickets in the morning. The tourists, replying to Bangladesh’s first-innings 310, resumed on 266-8, still 44 runs behind. Southee and Kyle Jamieson frustrated Bangladesh for more than an hour to share 52 runs for the ninth wicket, until left-arm spinner Mominul removed them both in the same over. Mominul trapped Jamieson leg-before for 23 to leave New Zealand 316-9, and then bowled Southee four balls later for 35 to finish with career-best figures of 3-4. “We definitely didn’t think it was going to be easy to rock up in the second innings and knock them over,” Jamieson said. “We’ve still got some work to do tomorrow and try and chip out a few more.” Southee hit three boundaries in his 62-ball stay. The two-match series is the beginning of a new cycle in the World Test Championship for both teams. SCOREBOARDBangladesh I innings 310 all out New Zealand I innings (266-8 overnight) T. Latham c Nayeem b Taijul 21 D. Conway c Shahadat b Mehidy 12 K. Williamson b Taijul 104 H. Nicholls c Nurul b Shoriful 19 D. Mitchell st Nurul b Taijul 41 T. Blundell c Nurul b Nayeem 6 G. Phillips c Najmul b Mominul 42 K. Jamieson lbw b Mominul 23 I. Sodhi c Shahadat b Taijul 0 T. Southee b Mominul 35 A. Patel not out 1 Extras (b8, lb5) 13 Total (all out; 101.5 overs) 317 Fall of wickets: 1-36 (Latham), 2-44 (Conway), 3-98 (Nicholls), 4-164 (Mitchell), 5-175 (Blundell), 6-253 (Phillips), 7-262 (Williamson), 8-264 (Sodhi), 9-316 (Jamieson), 10-317 (Southee) Bowling: Shoriful 13-2-54-1, Mehidy 22-3-64-1, Taijul 39-9-109-4, Nayeem 24-3-73-1, Mominul 3.5-1-4-3 Bangladesh II inningsM. Hasan run out 8 Z. Hasan lbw b Patel 17 N. Hossain not out 104 M. Haque run out 40 M. Rahim not out 43 Extras 0 Total (three wickets; 68 overs) 212To bat: Shahadat Hossain, Nurul Hasan, Mehidy Hasan Miraz, Taijul Islam, Shoriful Islam, Nayeem Hasan Fall of wickets: 1-23 (Zakir), 2-26 (Mahmudul), 3-116 (Mominul) Bowling: Southee 12-3-22-0, Jamieson 9-3-19-0, Patel 23-1-94-1, Phillips 12-4-36-0, Sodhi 12-1-41-0 Toss: Bangladesh Umpires: Ahsan Raza (PAK), Paul Reiffel (AUS)","pubDate":"2023-11-30 20:17:00","image_url":"https://www.gulf-times.com/gulftimes/uploads/images/2023/11/30/108537.jpg","source_id":"gulftimes","source_priority":433545,"country":["united arab emirates"],"category":["sports"],"language":"english"}]}