{"newsArray":[{"title":"“Passion for the game is infectious”: Michael Vaughan expresses hope for more international cricket in Pakistan","link":"https://thesportsrush.com/cricket-news-passion-for-the-game-is-infectious-michael-vaughan-expresses-hope-for-more-international-cricket-in-pakistan/","keywords":["Cricket","England tour of Pakistan 2022","Michael vaughan","Pakistan","pcb"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Michael Vaughan expresses hope in the teams to keep supporting international Cricket in Pakistan, as England’s tour comes to an end. Suffering a couple of one-sided losses in the sixth, and then the seventh T20I tonight at the Gaddafi Stadium in Lahore has meant that Pakistan have lost the historic seven-match T20I series against England… The post “Passion for the game is infectious”: Michael Vaughan expresses hope for more international cricket in Pakistan appeared first on The SportsRush.","content":"Suffering a couple of one-sided losses in the sixth, and then the seventh T20I tonight at the Gaddafi Stadium in Lahore has meant that Pakistan have lost the historic seven-match T20I series against England 3-4. En route the stiff target of 210 runs, Pakistan lost their star opening batting pair of Babar Azam (4 off 4) and Mohammad Rizwan (1 off 4) within the first two Overs, to uplift the spirits of the English bowlers. The much critiqued Pakistan middle-order was exposed once again, and they yet again handed nothing but disappointment to their fans, as none of their batters displayed the required intent to chase down a total in excess of the 200-run mark. While Shan Masood (56 off 43) and Khushdil Shah (27 off 25) did manage to get their scores registered on the board, their contributions were of very little worth to the team’s cause, as Pakistan were bundled out for mere 142/8 in their 20 Overs, thereby falling short of the target by 67 runs. Dawid Malan, for his unbeaten 78-run knock off 47 deliveries, was adjudged the ‘Player of the match’. After Australia’s successful tour of Pakistan after 24 long years, and now with England completing the tour comprising an unprecedented seven-match T20I series, things are slowly, but surely returning back to normalcy as far as Cricketing action in the country is concerned. Former England skipper Michael Vaughan, post the final match of the series and the England’s successful tour after 17 years, took to his social media handle, to hail the ‘fantastic’ T20I series between the two nations. Further hailing the the passion for the sport in the country as infectious, Vaughan could have not stressed enough on the importance of World Cricket to keep supporting Pakistan, by continuing to tour the country. Fantastic T20 series .. Great atmosphere has come through the screens .. So important the World game supports playing in Pakistan .. The passion for the game is infectious .. 👍 — Michael Vaughan (@MichaelVaughan) For more Cricket-related news, click .","pubDate":"2022-10-02 20:49:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England Man of the Series today match: PAK vs ENG T20 Man of the Series","link":"https://thesportsrush.com/cricket-news-pakistan-vs-england-man-of-the-series-today-match-pak-vs-eng-t20-man-of-the-series/","keywords":["Cricket","England","England tour of Pakistan 2022","Harry Brook","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Pakistan vs England Man of the Series: The rookie English batter won his first series award in his fourth international series across formats. England’s first tour of Pakistan in the last 17 years has turned out to be a fruitful exercise on the back of a 4-3 series victory in the first-ever seven-match series between… The post Pakistan vs England Man of the Series today match: PAK vs ENG T20 Man of the Series appeared first on The SportsRush.","content":"England’s first tour of Pakistan in the last 17 years has turned out to be a fruitful exercise on the back of a 4-3 series victory in the first-ever seven-match series between ICC (International Cricket Council) Full Member Nations. From leading the series 2-1 at a point to trailing by 3-2, England have managed to defeat Pakistan on the back of consecutive victories at the Gaddafi Stadium. Asked to bat first by Pakistan captain Babar Azam (4), England scored a match-winning 209/3 in 20 overs primarily due to a 61-ball 108-run fourth-wicket partnership. While batter Dawid Malan (78*) hit eight fours and three sixes at a strike rate of 165.95, Harry Brook (46*) hit a four and five sixes at a strike rate of 158.62. Chasing a 210-run target, Pakistan biggest flaw was highlighted yet again as their batters failed to even put on a fight after opening batters Babar Azam (4) and Mohammad Rizwan (1) failed to generate any sort of impact. With bowling figures of 4-0-26-3, England pacer Chris Woakes was the pick of their bowlers. Woakes was well-assisted by David Willey as he picked a couple of wickets for just 22 runs in his over four-over spell. While Malan was awarded with a match award for scoring his 13th T20I half-century, Brook was awarded a series award for being the highest run-scorer among visiting batters. Third-highest run-scorer of the series, Brook scored 238 runs across six innings at an average and strike rate of 79.33 and 163.01 respectively including a half-century. A big series win to start a massive winter for our T20 team 🙌 🇵🇰 🏴󠁧󠁢󠁥󠁮󠁧󠁿 — England Cricket (@englandcricket) “I just try to hit straight and play the ball on its merit. All the lads are looking forward to getting out there and get going against Australia in the three-match series and obviously then to the [ICC T20] World Cup. It has been good fun. We have been in the hotel for quite a bit, but we are ready to get to Australia now,” Brook told during the post-match presentation ceremony.","pubDate":"2022-10-02 19:51:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dawid Malan punishes Pakistan with big knock as England ease to series decider win ahead of T20 World Cup","link":"https://www.thesun.co.uk/sport/19984784/england-pakistan-australia-t20-world-cup/","keywords":["Cricket","Sport","Men's Cricket World Cup"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"ENGLAND powered to a crushing victory in the series-decider and next stop is Australia for the Twenty20 World Cup. Dawid Malan top-scored with 78 not out in Lahore as England piled up 209-3 in their 20 overs and Pakistan never looked like getting close. The margin was 67 runs and England took the series 4-3 after winning the last two matches. Malan and Harry Brook put on 108 in 10.1 overs for the fourth wicket after Phil Salt, Alex Hales and Ben Duckett all batted with typical aggression. England were helped by Pakistan dropping three catches and two of their three wickets fell to run outs. Pakistan’s remote hopes of a successful run chase evaporated when prolific openers Babar Azam and Mohammad Rizwan were dismissed inside the first two overs. After that, the home team’s batsmen hardly played a stroke in anger, seemingly happy to have middle practice rather than make a token attempt to win the game. Player of the Match Malan said: “We saw this as a final so to put up a big score under pressure was fantastic for us.” Even though he did not play any of the seven matches because of a calf problem, captain Jos Buttler and coach Matthew Mott will be delighted with England’s progress and performances on this historic trip – their first visit to Pakistan since 2005. Apart from a couple of poor run chases, England scored plenty of runs with Brook contributing 237 in the series at an average of 79 and strike-rate of 163. Brook will surely feature in England’s World Cup starting XI but Duckett, another success with 233 runs against Pakistan, is not even in the party flying Down Under. Hales has almost certainly done enough to be inked in as Buttler’s opener partner after more than three years in the international wilderness. And Mark Wood as well as Chris Woakes, who took three wickets yesterday, are playing again following long-term injuries. The resting Ben Stokes and injured Liam Livingstone and Chris Jordan are due to link up with the squad in Australia. JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) England play four build-up matches – starting with three against Australia – before their World Cup opener against Afghanistan on October 22. Buttler says he expects to be fit to face the Aussies next Sunday. Mott added: “We came here with a clear plan to rotate our squad and we couldn’t have asked for much more. Moeen [Ali] has captained really well and put his faith in the younger players. It gives us a lot of confidence going to the World Cup. “Harry Brook has done really well and looked composed. He seems to know the exact time when to hit boundaries and Ben Duckett has shown he plays spin superbly. “But this has been more than a cricket trip. The people of Pakistan have done it tough and have really embraced us.”","pubDate":"2022-10-02 19:17:57","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-India beat South Africa by 16 runs to clinch T20 series","link":"https://www.thestar.com.my/sport/cricket/2022/10/03/cricket-india-beat-south-africa-by-16-runs-to-clinch-t20-series","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India beat South Africa by 16 runs in a high-scoring Twenty20 international in Guwahati on Sunday to take an unassailable 2-0 lead in the three-match series as David Miller and Quinton de Kock's unbeaten 174-run stand was in vain. Read full story","content":"(Reuters) - India beat South Africa by 16 runs in a high-scoring Twenty20 international in Guwahati on Sunday to take an unassailable 2-0 lead in the three-match series as David Miller and Quinton de Kock's unbeaten 174-run stand was in vain. Chasing an imposing 237, the visitors fell short as India's imperious batting performance helped them clinch victory as well as their first home T20 series win over South Africa. Miller struck a fine 106 off 47 balls and his unbeaten stand for the fourth wicket with opener De Kock threatened to take the game away from India but the task ultimately proved too much. South Africa were reeling at 5-2 at the end of the second over after Temba Bavuma and Rilee Rossouw fell for ducks to Arshdeep Singh. Aiden Markram then hit 33 from 19 in a valiant effort but De Kock struggled to a 48-ball 69. Play was stopped in the third over of the chase after one of the four floodlight towers in the stadium went out. It was the second interruption of the match after a snake slithered onto the field in a bizarre turn of events early in India's innings. India were put in to bat and smashed over 150 runs in boundaries to reach a commanding 237-3, thanks to Suryakumar Yadav's blazing 22-ball 61 after opener KL Rahul had got off the blocks in a flash to make 57 from 28. Keshav Maharaj provided the visitors with a breakthrough by ending the 96-run opening stand, dismissing skipper Rohit Sharma (43) in the 10th over before trapping Rahul leg before wicket in the 12th to finish with an excellent 2-23. Yadav joined Virat Kohli on the crease with the momentum seemingly shifting towards South Africa but did not take long to settle in, continuing his sparkling form to bring up a half century in only 18 balls. Kohli finished unbeaten on a 28-ball 49 and Dinesh Karthik smacked 17 in his seven-ball cameo as India reached their fourth-highest total in T20s. The final match of the series will be played in Indore on Tuesday. (Reporting by Hritika Sharma in Bengaluru; Editing by Ken Ferris)","pubDate":"2022-10-02 18:55:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Most expensive T20 spell: Most expensive spell in T20 international full list","link":"https://thesportsrush.com/cricket-news-most-expensive-t20-spell-most-expensive-spell-in-t20-international-full-list/","keywords":["Cricket","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Most expensive T20 spell: Batters from both the sides had the bowlers on the haunches right till the end of second T20I in Guwahati. Team India have defeated South Africa by 16 runs in the second T20I at the Barsapara Cricket Stadium in Guwahati, to take an unassailable lead of 2-0 in the three-match series.… The post Most expensive T20 spell: Most expensive spell in T20 international full list appeared first on The SportsRush.","content":"Most expensive T20 spell: Batters from both the sides had the bowlers on the haunches right till the end of second T20I in Guwahati. Team India have defeated South Africa by 16 runs in the second T20I at the Barsapara Cricket Stadium in Guwahati, to take an unassailable lead of 2-0 in the three-match series. The win has also meant that India have, for the first time ever, won a T20I series against the Proteas at home, while on the flip side, it is the first bilateral series defeat for the visitors after as many as seven series. Having said it all, there was very little to separate between the two sides tonight, as bowlers from both the sides were beaten black and blue by the batters, with over 450 runs being scored by both the sides combined in the 40 Overs. En route the stiff target of 238 handed by Rohit Sharma’s men, the South Africans had to pay the price for the way they batted during the first ten Overs, having posted mere 70 runs on the board, with three wickets down. However, the pair of Quinton de Kock (69* off 48) and David Miller (106* off 47) left the Indian bowlers shell-shocked with almost 14 Overs of brutal hitting, to stitch together the highest fourth wicket partnership in T20Is worth 174 runs (off mere 82 deliveries), to ultimately take the team total to 221/3, smashing 151 runs off the final 10 Overs. Death bowling, even with so many in the bank, remains a problem. — Harsha Bhogle (@bhogleharsha) October 2, 2022 Most expensive T20 spell Both India and South Africa bowlers leaked a total of 160 combined runs during the death Overs (16-20) in tonight’s contest, which is the highest ever conceded by bowlers in a single T20I. While the Indian bowlers gave away 82 runs during this period, the South Africans leaked 78 runs. India’s left-arm pacer Arshdeep Singh leaked as many as 62 runs in his four-Over spell tonight, which is the second-most expensive spell by an Indian bowler in the format, behind Yuzvendra Chahal’s 64 runs (in 2018). However, the infamous record for the most expensive spell in combined T20 history is held by the English spinner Matthew Harry McKiernan, who gave away 82 runs in his four-Over spell, while playing for Derbyshire against Somerset at Taunton this July. Most expensive spell in T20 international full list Player Runs Wkts Econ Team Opposition Ground Year Kasun Rajitha 75 0 18.75 Sri Lanka v Australia Adelaide 2019 Chris Sole 72 1 18 Scotland v New Zealand Edinburgh 2022 Tunahan Turan 70 1 17.5 Turkey v Czech Rep. Ilfov County 2019 Barry McCarthy 69 0 17.25 Ireland v Afghanistan Greater Noida 2017 Kyle Abbott 68 1 17 South Africa v West Indies Johannesburg 2015   The post Most expensive T20 spell: Most expensive spell in T20 international full list appeared first on The SportsRush.","pubDate":"2022-10-02 18:47:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Man of the Match India vs South Africa today 2nd T20I: Who won today Match of the Match IND vs SA Guwahati T20?","link":"https://thesportsrush.com/cricket-news-man-of-the-match-india-vs-south-africa-today-2nd-t20i-who-won-today-match-of-the-match-ind-vs-sa-guwahati-t20/","keywords":["Cricket","India","KL Rahul","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Man of the Match India vs South Africa: The Indian vice-captain won a T20I match award after as many as 33 months tonight. During the second T20I of South Africa’s second tour of India 2022 in Guwahati, India beat South Africa by 16 runs to gain an unassailable 2-0 lead in a three-match series. Chasing… The post Man of the Match India vs South Africa today 2nd T20I: Who won today Match of the Match IND vs SA Guwahati T20? appeared first on The SportsRush.","content":"Man of the Match India vs South Africa: The Indian vice-captain won a T20I match award after as many as 33 months tonight. During the second T20I of South Africa’s second tour of India 2022 in Guwahati, India beat South Africa by 16 runs to gain an unassailable 2-0 lead in a three-match series. Chasing a mammoth 238-run target, South Africa struggled throughout the powerplay to only score 45/2. The visitors’ speed of scoring runs didn’t change a lot even after the fielding restrictions were lifted as all they managed at the halfway mark was 70/3. Having said that, a quick turnaround primarily due to batter David Miller’s second T20I century witnessed them scoring 151/0 in the second half of their innings. Wicket-keeper batter Quinton de Kock (69*) and Miller (106*) couldn’t steer South Africa past the victory line but managed to register the highest T20I fourth-wicket partnership on the back of a 82-ball 174-run stand. Some knock Davey @DavidMillerSA12 #INDvsSA — Graeme Smith (@GraemeSmith49) October 2, 2022 Man of the Match India vs South Africa today 2nd T20I India captain Rohit Sharma finally lost a toss after winning three in a row lately. Asked to bat first by South Africa captain Temba Bavuma, India registered their fourth-highest innings total of 237/3 in 20 overs. A 59-ball 96-run opening partnership between vice-captain KL Rahul (57) and Sharma (43) was followed by an even better 40-ball 102-run third-wicket partnership between former captain Virat Kohli (49*) and batter Suryakumar Yadav (61). While Yadav hit five fours and as many sixes at an incredible strike rate of 277.27 tonight, Rahul was declared the Player of the Match for hitting five fours and four sixes at a strike rate of 203.57.   In what was Rahul’s 20th T20I half-century, it was his 19th as an opening batter, 16th in Asia, 12th at home, seventh under Sharma, fourth in 2022 and second in as many matches against this opposition in his first-ever match at the Barsapara Cricket Stadium. The post Man of the Match India vs South Africa today 2nd T20I: Who won today Match of the Match IND vs SA Guwahati T20? appeared first on The SportsRush.","pubDate":"2022-10-02 18:14:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA 2nd T20I, Cricket Score: Miller's Scintillating Ton in Vain; Rohit & Co. Create History - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi4AFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2hpZ2hsaWdodHMtaW5kLXZzLXNhLTJuZC10MjBpLXNjb3JlLXVwZGF0ZXMtZ3V3YWhhdGktYmFyYXNwb3JhLTJuZC1vY3QtcmFpbi1iYWxsLWNvbW1lbnRhcnktaW5kaWEtdnMtc291dGgtYWZyaWNhLWxpdmUtc3RyZWFtaW5nLWhvdHN0YXItbWlsbGVyLXJvaGl0LXN1cnlha3VtYXItYXJzaGRlZXAtdmlyYXQta29obGktbmV3cy01NjY0Mzc3L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA 2nd T20I, Cricket Score: Miller's Scintillating Ton in Vain; Rohit & Co. Create History  India.comIndia vs South Africa Highlights, 2nd T20I 2022: India beat South Africa by 16 runs to seal the series 2-0  Times of IndiaIndia vs South Africa Highlights 2nd T20I: David Miller Hits Century in High-scoring Contest But IND Clinch  News18LIVE IND vs SA 2nd T20, Cricket Score: Miller' 50 Keep Hope For SA; IND Hold Advantage  India.comGuwahati: ACA Barsapara Stadium Infrastructure Still Questionable  Guwahati PlusView Full coverage on Google News","content":null,"pubDate":"2022-10-02 18:02:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA 2nd T20I: India beat SA by 16 runs to seal series 2-0","link":"https://telanganatoday.com/ind-vs-sa-2nd-t20i-india-beat-sa-by-16-runs-to-seal-series-2-0","keywords":["News","Sport","India","South Africa","T20i"],"creator":["PTI"],"video_url":null,"description":"India defeated South Africa by 16 runs in a high-scoring second T20I to take an unassailable 2-0 lead in the three-match series here on Sunday.","content":"Guwahati: India defeated South Africa by 16 runs in a high-scoring second T20I to take an unassailable 2-0 lead in the three-match series here on Sunday. Sent in to bat, India posted a massive 237 for three, riding on a solid batting display by the top four and then returned to restrict the visitors to 221 for 3 in the stipulated 20 overs. Quinton de Kock (69 not out) and David Miller (106 not out) did the bulk of scoring for the visitors. KL Rahul (57) and Rohit Sharma (43) put on a 96-run opening stand to set the foundation for India at the Barsapara cricket stadium here. Suryakumar Yadav (61) then took centre stage as he smashed five boundaries and as many sixes en route to his 102-run stand off just 40 balls with Virat Kohli (49 not out). Dinesh Karthik then made some lusty blows in his seven-ball 17 not out. Keshav Maharaj (2/23) was the most successful bowler for South Africa but it turned out to be a disastrous day for the rest of his bowling colleagues. For India, Arshdeep Singh (2/62) and Axar Patel (1/53) were the wicket-takers. Brief Score: India: 237 for 3 in 20 overs (Suryakumar Yadav 61, KL Rahul 57, Virat Kohli 49 not out; Keshav Maharaj 2/23). South Africa: 221 for 3 in 20 overs (David Miller 106 not out, Quinton de Kock 69 not out; Arshdeep Singh 2/62).","pubDate":"2022-10-02 18:01:34","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India beat South Africa by 16 runs in 2nd T20I","link":"https://economictimes.indiatimes.com/news/sports/india-beat-south-africa-by-16-runs-in-2nd-t20i/articleshow/94606010.cms","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul (57) and Rohit Sharma (43) put on a 96-run opening stand to set the foundation for India at the Barsapara cricket stadium here.","content":null,"pubDate":"2022-10-02 18:00:46","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-87886,resizemode-4,msid-94606010/india-beat-south-africa-by-16-runs-in-2nd-t20i.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Daniel Smith: WACA’s efforts to promote diversity will have a great impact","link":"https://thewest.com.au/opinion/daniel-smith-wacas-efforts-to-promote-diversity-will-have-a-great-impact-c-8420885","keywords":null,"creator":["Daniel Smith "],"video_url":null,"description":"If there is a better run sporting body than the West Australian Cricket Association, I am not aware of it.","content":"If there is a better run sporting body than the West Australian Cricket Association, I am not aware of it. The men’s and women’s teams hold four titles between them, including our first Sheffield Shield in 23 years. The Association is financially sound, despite losing two seasons of international cricket to border closures. And is currently delivering on the long-aspired redevelopment of the WACA ground, with $100 million in hard-won state and federal government funding. Peter Law But, it’s the WACA’s efforts to promote diversity and inclusion within cricket that may have the biggest impact on the future health of the game. As the demographic composition of Australia has changed over the decades, so has our sporting landscape. While cricket and footy are still prominent, there is much greater competition from other codes. Encouraging and facilitating participation from a diverse range of ethnic and socio-economic backgrounds is not only the right thing to do, it’s also the smart thing to do if cricket wants access to the full range of talent available, and to grow the number of people buying tickets and watching on TV. Daniel Smith Engaging women not only drives the ongoing success of our women’s teams, it also supports the introduction of children, both boys and girls, to the game. If we get the diversity piece right, WA cricket will have both sporting and commercial success for a long time to come. Daniel Smith is executive chair of ReGen Strategic and a WACA member. Sign up for our emails","pubDate":"2022-10-02 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8420885/fbaa5f516100b3644eb809878dcad025e48300cb-16x9-x2y0w2996h1685.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia women's team consolidate top position in ODIs, T20Is","link":"https://www.sentinelassam.com/sports/cricket/australia-womens-team-consolidate-top-position-in-odis-t20is-616134","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"In the annual International Cricket Council (ICC) update carried out on Saturday","content":"DUBAI: In the annual International Cricket Council (ICC) update carried out on Saturday, Australia women's team have established a record margin at the top of the ODI Team Rankings while also increasing their lead in the T20I Team Rankings. ICC also said there is no change of positions in the ODI rankings in the latest update, which expunges results from the 2018-19 season, weights the 2019-20 and 2020-2021 seasons at 50 per cent and the 2021-22 season matches at 100 per cent. Australia have stretched their lead over second spot holders South Africa from 48 to 51 rating points in the ODI rankings, which is the biggest lead ever by any international men's or women's side in any form of the game, while their lead over second-placed T20I team England has increased from 14 to 18 rating points. Australia have gained three rating points and sit comfortably at 170 in ODIs, with South Africa (119), England (116), India (104) and New Zealand (101) other teams holding three-figure rating points. In T20Is, Australia are on 299 rating points, stretching their lead over second-placed England (281) from 14 to 18 rating points. New Zealand (271) and India (266) maintain their third and fourth positions, while South Africa have overtaken the West Indies to fifth position with 246 rating points. In the T20I matches played in last one year, Australia are undefeated in 14 matches, with ten wins against their name and four ending without a result. Also, they have swept aside India, England, Pakistan and Ireland in a tri-series and ended on a high by bagging gold in the women's T20 cricket event of the Commonwealth Games 2022 in Birmingham. In ODIs too, Australia have enjoyed an unbeaten record in the last 12 months. Their 100% win record in 12 games in that period includes a dominating Women's ODI World Cup win in New Zealand earlier this year. The gap between the top two might be massive but the fight for the second and third spot is heating up with only three points separating South Africa in second place from England, who are in third. In other notable movements, Tanzania and Nepal have progressed two slots each to reach 15th and 16th positions, respectively, Namibia have moved up from 21st to 17th and Hong Kong from 24th to 20th. Jersey (up from 28th to 22nd in a 14-point increase), Italy (up from 38th to 28th) and Mozambique (up from 45th to 33rd) are some of the other big movers in the update. Meanwhile, the number of ranked teams has fallen from 60 to 48 with eight teams not having played at all over the past three years and four others not meeting the requirement of six matches. China, Fiji, Japan, Mali, Myanmar, Samoa, South Korea and Vanuatu have not played during this period while Indonesia, Mexico, Norway and Papua New Guinea (PNG) have played less than six matches. IANS Also Read: Can use big boundaries in Australia to your advantage: Hazlewood on T20 World Cup Also Watch:","pubDate":"2022-10-02 17:56:58","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/02/397307-t20-aus.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Waiting for official confirmation on Jasprit Bumrah's availability: Rahul Dravid","link":"https://www.sentinelassam.com/sports/cricket/waiting-for-official-confirmation-on-jasprit-bumrahs-availability-rahul-dravid-616133","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Head coach of Indian cricket team Rahul Dravid said he would wait for an official confirmation regarding the availability of Jasprit Bumrah for the forthcoming T20 World Cup in Australia.","content":"Our Sports Reporter GUWAHATI: Head coach of Indian cricket team Rahul Dravid on Saturday said he would wait for an official confirmation regarding the availability of Jasprit Bumrah for the forthcoming T20 World Cup in Australia. The pacer is out of the ongoing T20I Series against South Africa due to stress fracture in his lower back and is likely to miss the World Cup also. Talking to the media on the eve of the second match of the series here today Dravid said, \"We are awaiting for the official confirmation on the next steps. As of now, he's officially ruled out of this series. But we will see what happens over the next few days.\" The ongoing series against South Africa was supposed to fine-tune India's plans for the T20 World Cup. But with uncertainty over Bumrah's fitness Indian selectors were forced to call Mohammed Siraj for the remaining part of the series and the pacer already joined the team yesterday. The ACA stadium, Barsapara will host the second match of the series on Sunday and the match will be held under flood light. A win in this game will be enough for Team India to take an inaccessible lead in the series. Meanwhile Dravid today affirmed that the team clearly understands what it has been trying to do and is very much confident of what it is trying to achieve. He was replying to a question about the criticism received over the number of players that have been used in the past few matches and constant changing of playing XI. The head coach said, \"It is a bit unrealistic to expect to keep playing the same players over and over again. We have to give people a workload break.\" He also talked about how people from the outside are always not aware of the things going on inside the team. \"It doesn't seem apparent from the outside but there are a lot of things that people from outside don't know. In the team, the communication has been very good, \" said Dravid. Dravid during the brief interaction with the media also shared his views on Assam cricket . He said, \" I have seen Riyan Parag and a few other cricketers from this state and they have made me believe that there is good potential in cricket in the state.\" Also Read: Young cricketers gets tips from Rahul Dravid's replacement Siraj joins team Also Watch:","pubDate":"2022-10-02 17:52:42","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/02/397306-rahul2.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Mismanagement galore during India vs South Africa 2nd T20I","link":"https://timesofindia.indiatimes.com/sports/cricket/south-africa-in-india/mismanagement-galore-during-india-vs-south-africa-2nd-t20i/articleshow/94605253.cms","keywords":null,"creator":null,"video_url":null,"description":"Trust Assam Cricket Association (ACA) to mess it up every time. Chaos once again reigned supreme at the ACA Barsapara Stadium here during the India-South Africa second T20I on Sunday.","content":"GUWAHATI: Trust Assam Cricket Association (ACA) to mess it up every time. Chaos once again reigned supreme at the ACA Barsapara Stadium here during the India-South Africa second T20I on Sunday. If a snake slithering onto the field during India's innings was not enough, the worst was in store when the stadium went into partial darkness during South Africa's chase of the massive target of 238, causing a second interruption in the match. Just after the first ball of Deepak Chahhar in the third over when South Africa were reeling at 5/2, play came to halt after one of the four floodlight towers went off, halting play for 18 minutes. All the players went back to the dressing room and it took about six minutes for the lights to slowly turn on one by one before play resumed. Blaming it on a \"technical glitch\", Assam Cricket Association secretary Devajit Saikia told PTI: \"We have three parties handling the power aspect – our own 25-member team, a third (outsourced) party and the state power department. It was perhaps a voltage problem, some technical glitch.\" Saikia said the ACA has used generator sets to power the match and not depended on electricity supply from the power department. The media contingent also faced a similar problem before the match as there were no lights till a few overs into the match as the officials took hours to find out the fault. Earlier during India's innings, it was the turn of a snake to stop the play for about five minutes in a rare sight during an international match. Snake also reached to watch the cricket match of India and South Africa at the stadium in Guwahati.#Guwahati… https://t.co/OyVES0Qlub — Prateek Pratap Singh (@PrateekPratap5) 1664720200000 The snake came out of nowhere from a small unnoticed pit to scare Wayne Parnell at the extra cover region. It then slithered into the square region. The groundsmen then came and captured it in a bucket. It was during the last International match here, the venue's mismanagement made headlines when India-Sri Lanka first T20I in January 2020 was abandoned after water seeped onto the pitch despite being given a three-layer cover. ACA had then cut a sorry figure when they brought a hair dryer, steam iron, battery operated fans among other tools to dry up the pitch but in vain.","pubDate":"2022-10-02 16:44:10","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket: Blazing knocks by Taylor, Nurse power India Capitals into final","link":"https://telanganatoday.com/legends-league-cricket-blazing-knocks-by-taylor-nurse-power-india-capitals-into-final","keywords":["News","Sport","India Capitals","Legends League Cricket","Ross Taylor"],"creator":["IANS"],"video_url":null,"description":"former New Zealand skipper Ross Taylor and West Indies star Ashley Nurse smashed blazing half-centuries to help India Capitals enter the final of Legends League Cricket","content":"Jodhpur: The former New Zealand skipper Ross Taylor and West Indies star Ashley Nurse smashed blazing half-centuries to help India Capitals enter the final of Legends League Cricket, beating Bhilwara Kings by four wickets in a thrilling qualifier at the Barkatullah Khan Stadium here on Sunday. Taylor struck a quick-fire 84 off 39 which included nine fours and five massive sixes while Nurse hit an unbeaten 60. His 28-ball brilliant knock was laced with five fours and four sixes as India Capitals chased down the highest target of the season comfortably in the end with three balls to spare. In a battle between the Top-2 teams of the league, table-toppers India Capitals responded well while chasing Bhilwara Kings’ total of 226-5. Scoring at a brisk rate, Ross Taylor kept them in the hunt by smashing the quickest fifty of the league in just 20 balls before Sudeep Tyagi dismissed him on 84 with the team still needing 59 runs from 29 balls. After Taylor’s departure, Ashley Nurse kept the challenge alive for India Capitals along with Liam Plunkett as the duo kept the required run rate under control. With eight runs needed off five deliveries, Nurse not only took his side over the line with back-to-back huge sixes but also completed his half-century in style. Earlier, after electing to bat, the former Australia skipper Shane Watson and William Porterfield provided a quick start for Bhilwara Kings. Watson raced to his fifty in just 27 deliveries and stitched a 116-run partnership for the second wicket along with the opener Porterfield before he was caught by Johnson off Pankaj Singh at the long on boundary. Watson hit 10 fours and two sixes during his splendid 65-run knock off 39 balls. Porterfield, on the other hand, struck seven fours and three sixes in his 37-ball 59. The in-form Yusuf Pathan (48 off 28) and Rajesh Bishnoi’s (36 not out off 11) assault in death overs saw Bhilwara Kings adding 56 runs in the last three overs to post a challenging total. Despite Sunday’s loss, Irfan Pathan-led Bhilwara Kings will get another shot at securing their berth in the final when they take on third-placed Gujarat Giants in the eliminator match at the same venue on Monday. The final will be played at the Sawai Mansingh Stadium in Jaipur on Wednesday.","pubDate":"2022-10-02 16:43:02","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022: India Capitals beat Bhilwara Kings by 4 wickets to enter final","link":"https://zeenews.india.com/cricket/legends-league-cricket-2022-india-capitals-beat-bhilwara-kings-by-4-wickets-to-enter-final-2517253.html","keywords":null,"creator":null,"video_url":null,"description":"Watson hit 10 fours and two sixes during his splendid 65-run knock off 39 balls. Porterfield, on the other hand, struck seven fours and three sixes in his 37-ball 59.","content":"The former New Zealand skipper Ross Taylor and West Indies star Ashley Nurse smashed blazing half-centuries to help India Capitals enter the final of Legends League Cricket after beating Bhilwara Kings by four wickets in a thrilling qualifier at the Barkatullah Khan Stadium in Jodhpur on Sunday. Taylor struck a quick-fire 84 off 39 which included nine fours and five massive sixes while Nurse hit an unbeaten 60. His 28-ball brilliant knock was laced with five fours and four sixes as India Capitals chased down the highest target of the season comfortably in the end with three balls to spare. Snippets of @CapitalsIndia from the game! #BossLogonKaGame #LLCT20 #LegendsLeagueCricket pic.twitter.com/VrbTc7SN7R — Legends League Cricket (@llct20) October 2, 2022 In a battle between Top-2 teams of the league, table-toppers India Capitals responded well while chasing Bhilwara Kings’ total of 226-5. Scoring at a brisk rate, Ross Taylor kept them in the hunt by smashing the quickest fifty of the league in just 20 balls before Sudeep Tyagi dismissed him on 84 with the team still needing 59 runs from 29 balls. After Taylor’s departure, Ashley Nurse kept the challenge alive for India Capitals along with Liam Plunkett as the duo kept the required run-rate under control. When eight runs needed off five deliveries, Nurse not only took his side over the line with back-to-back huge sixes but also completed his half-century in style. Earlier, after electing to bat, the former Australia skipper Shane Watson and William Porterfield provided a quick start for Bhilwara Kings. Watson raced to his fifty in just 27 deliveries and stitched 116-run partnership for the second wicket along with the opener Porterfield before he was caught by Johnson off Pankaj Singh at the long on boundary. Watson hit 10 fours and two sixes during his splendid 65-run knock off 39 balls. Porterfield, on the other hand, struck seven fours and three sixes in his 37-ball 59. In-form Yusuf Pathan (48 off 28) and Rajesh Bishnoi’s (36 not out off 11) assault in death overs saw Bhilwara Kings adding 56 runs in the last three overs to post a challenging total. Despite today’s loss, Irfan Pathan-led Bhilwara Kings will get another shot at securing their berth in the final when they take on third-placed Gujarat Giants in the eliminator match at the same venue on Monday. Final will be played at the Sawai Mansingh Stadium in Jaipur on Wednesday.","pubDate":"2022-10-02 16:43:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Unwelcome visitor’ to floodlight failure: Mismanagement galore during India versus S Africa T20I at Guwahati","link":"https://www.tribuneindia.com/news/sports/unwelcome-visitor-to-floodlight-failure-mismanagement-galore-during-india-versus-s-africa-t20i-at-guwahati-437532","keywords":null,"creator":null,"video_url":null,"description":"Guwahati, October 1Trust Assam Cricket Association (ACA) to mess it up every time.Chaos once again reigned supreme at the ACA Barsapara Stadium here during the India-South Africa second T20I on Sunday.If a snake slithering onto the field during India's innings was not enough, the worst was in store when the stadium went into partial darkness during South Africa's chase of the massive target of 238, causing a second interruption in the match.Just after the first ball of Deepak Chahhar in the third over when South Africa were reeling at 5/2, play came to halt after one of the four floodlight towers went off, halting play for 18 minutes.All the players went back to the dressing room and it took about six minutes for the lights to slowly turn on one by one before play resumed.Blaming it on a \"technical glitch\", Assam Cricket Association secretary Devajit Saikia told PTI: \"We have three parties handling the power aspect ndash; our own 25-member team, a third (outsourced) party and the state power department. It was perhaps a voltage problem, some technical glitch.\"Saikia said the ACA has used generator sets to power the match and not depended on electricity supply from the power department.The media contingent also faced similar problem before the match as there were no lights till a few overs into the match as the officials took hours to find out the fault.Earlier during India's innings, it was the turn of a snake to stop the play for about five minutes in a rare sight during an international match.The snake came out of nowhere from a small unnoticed pit to scare Wayne Parnell at the extra cover region. It then slithered into the square region.The groundsmen then came and captured it in a bucket.It was during the last International match here, the venue's mismanagement made headlines when India-Sri Lanka first T20I in January 2020 was abandoned after water seeped onto the pitch despite being given a three-layer cover.ACA had then cut a sorry figure when they brought hair dryer, steam iron, battery operated fans among other tools to dry up the pitch but in vain.","content":null,"pubDate":"2022-10-02 16:40:58","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_725499550.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa, 2nd T20I Live Updates: Arshdeep Singh, Axar Patel Dent South Africa's 238-Run Chase vs India - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1zb3V0aC1hZnJpY2EtMjAyMi0yMy9pbmQtdnMtc2EtbGl2ZS1jcmlja2V0LXNjb3JlLTJuZC10MjAtbWF0Y2gtaW5kaWEtdnMtc291dGgtYWZyaWNhLWxpdmUtc2NvcmUtdXBkYXRlcy0zMzk3MTUx0gGXAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXNvdXRoLWFmcmljYS0yMDIyLTIzL2luZC12cy1zYS1saXZlLWNyaWNrZXQtc2NvcmUtMm5kLXQyMC1tYXRjaC1pbmRpYS12cy1zb3V0aC1hZnJpY2EtbGl2ZS1zY29yZS11cGRhdGVzLTMzOTcxNTEvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa, 2nd T20I Live Updates: Arshdeep Singh, Axar Patel Dent South Africa's 238-Run Chase vs India  NDTV SportsIndia vs South Africa Live Score, 2nd T20I 2022: Keshav Maharaj removes Rohit Sharma; KL Rahul slams fifty to lead India run charge  Times of IndiaRecent Match Report - India vs South Africa 2nd T20I 2022/23  ESPNcricinfoIND vs SA Dream11 Prediction 2nd T20I, Fantasy Cricket Tips, Playing XI, Pitch Report & Updates  CricTrackerIND vs SA 2nd T20 Live Score Updates: Toss coming up in Guwahati  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-10-02 16:22:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest T20I score by India: Highest score for India in T20 international history","link":"https://thesportsrush.com/cricket-news-highest-t20i-score-by-india-highest-score-for-india-in-t20-international-history/","keywords":["Cricket","South Africa tour of India 2022","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Highest T20I score by India: Team India were all over the South African bowlers like a rash during the second T20I in Guwahati tonight. The crowd at the Barsapara Cricket Stadium in Guwahati was witness to an onslaught of the highest order from the bat of each of the five Indian batters tonight during the… The post Highest T20I score by India: Highest score for India in T20 international history appeared first on The SportsRush.","content":"The crowd at the Barsapara Cricket Stadium in Guwahati was witness to an onslaught of the highest order from the bat of each of the five Indian batters tonight during the second T20I against South Africa. Asked to bat first, it all began with some of delightful strokes upfront, as he alongside skipper Rohit Sharma (43 off 37) stitched together a quick fire 96-run stand off mere 9.5 Overs, to lay a perfect platform for a huge total. Post Rahul departing for a scintillating 28-ball 57 at a strike rate of 203.57, it was yet again time for Suryakumar Yadav (61 off 22) to take the centre stage, and mesmerize the fans with some of his breathtaking shots all around the park, comprising 5 Fours and as many Sixes. With former India skipper Virat Kohli (49* off 28) too coming of his own, the duo stitched together a scintillating 102-run stand for the third wicket off mere 42 deliveries, to help India comfortably go past the 200-run mark. With wicket-keeper batter Dinesh Karthik (17* off 7) too playing a lovely cameo in the end, they eventually ended up posting a mammoth 237/3 after 20 Overs, which is also their highest total versus South Africa in T20Is. , one word to describe batters’ performance tonight? ⤵️ | | | — Lucknow Super Giants (@LucknowIPL) Tonight’s total of 237/3 is now team India’s fourth-highest total in T20Is, with the highest ever total coming against Sri Lanka back in the year 2017, when they had managed to post . India also smashed a total of 38 boundaries – their second-highest ever in the format tonight, with the highest (42) coming off against Sri Lanka in the above mentioned contest.","pubDate":"2022-10-02 15:59:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Anyone have issues with KL Rahul strike rate now”: Robin Uthappa takes KL Rahul critics to the cleaners","link":"https://thesportsrush.com/cricket-news-anyone-have-issues-with-kl-rahul-strike-rate-now-robin-uthappa-takes-kl-rahul-critics-to-the-cleaners/","keywords":["Cricket","India","KL Rahul","Robin Uthappa","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Robin Uthappa takes KL Rahul critics to the cleaners: The former Indian batter hasn’t shied away from praising the current vice-captain. India vice-captain KL Rahul finally managed to find his groove post facing criticism around his strike rate across nine innings since returning to the shortest format after more than nine months. Opening the batting… The post “Anyone have issues with KL Rahul strike rate now”: Robin Uthappa takes KL Rahul critics to the cleaners appeared first on The SportsRush.","content":"India vice-captain KL Rahul finally managed to find his groove post facing criticism around his strike rate across nine innings since returning to the shortest format after more than nine months. Opening the batting with captain Rohit Sharma (43) in the ongoing second T20I against South Africa, Rahul scored his 20th T20I half-century, 19th as an opening batter, 16th in Asia, 12th at home, seventh under Sharma, fourth in 2022 and second in as many matches against this opposition in his first-ever match at the Barsapara Cricket Stadium. Facing South Africa fast bowler Kagiso Rabada, Rahul hit his first ball of the innings for a boundary to not waste any time. Three more fours and a six in the powerplay saw Rahul racing to 25 (11) in the powerplay. In what was a role-reversal of sorts, Rahul was the attacker with Sharma playing the anchor role. Not looking to slow down even after the powerplay, Rahul continued to play his shots successfully. It was on the fourth delivery of the 11th over when Rahul hit South Africa part-time spinner Aiden Markram for a boundary to complete a 24-ball half-century. Rahul, who hit five fours and four sixes at a strike rate of 203.57 tonight, earned applause from former India batter Robin Uthappa. The recently cricketer took to social media platform Twitter to slam Rahul’s critics. Anyone have issues with ‘s strike rate now? — Robin Aiyuda Uthappa (@robbieuthappa) There is no denying to the fact that Rahul has faced quite a lot of criticism for his T20I strike rate of late. While Rahul’s latest innings is praiseworthy, him scoring 249 runs at a strike rate of 119.13 since his T20I return in August aren’t numbers which justify his potential. A strike rate of less than 120 for a modern-day opening batter isn’t up to the mark taking into consideration how Rahul’s contemporaries bat in this format. Readers must note that these nine Rahul innings comprise of him scoring a on a at the Greenfield International Stadium on Wednesday.","pubDate":"2022-10-02 15:53:53","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Second IND-SA T20I: Snake interrupts play; match resumes after few minutes","link":"https://www.business-standard.com/article/sports/second-ind-sa-t20i-snake-interrupts-play-match-resumes-after-few-minutes-122100200754_1.html","keywords":null,"creator":null,"video_url":null,"description":"The second T20I between India and South Africa had to be stopped after a snake invaded the cricket field, however, the match was resumed after a couple of minutes","content":"The second T20I between India and South Africa had to be stopped after a snake invaded the cricket field, however, the match was resumed after a couple of minutes. While there were expectations of rain during the match, it was the snake who took the all highlights in the seventh over of India's innings as the match was put on hold temporarily. During the match, a couple of South African players pointed it out to KL Rahul and the on-field umpires. The ground staff then rushed in with the necessary equipment and sorted the problem in a couple of minutes. The players, meanwhile, took unofficial drinks to break. The incident took place during the starting of the seventh over of the innings. Talking about the match, South Africa skipper Temba Bavuma won the toss and opted to field against India in the second game of the three-match T20I series here at Barsapara Cricket Stadium, Guwahati on Sunday. South Africa (Playing XI): Quinton de Kock(w), Temba Bavuma(c), Rilee Rossouw, Aiden Markram, David Miller, Tristan Stubbs, Wayne Parnell, Keshav Maharaj, Kagiso Rabada, Anrich Nortje and Lungi Ngidi. India (Playing XI): KL Rahul, Rohit Sharma(c), Virat Kohli, Suryakumar Yadav, Rishabh Pant(w), Dinesh Karthik, Axar Patel, Ravichandran Ashwin, Harshal Patel, Deepak Chahar and Arshdeep Singh. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-10-02 15:41:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221002/thumb-122100200754.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli becomes first Indian to complete 11,000 runs in T20 history","link":"https://www.tribuneindia.com/news/sports/virat-kohli-becomes-first-indian-to-complete-11-000-runs-in-t20-history-437526","keywords":null,"creator":null,"video_url":null,"description":"Guwahati, October 2Star batter Virat Kohli on Sunday became the first India to complete 11,000 runs in T20 history. Kohli achieved this feat during the second T20I against South Africa here at Barsapara Cricket Stadium, Guwahati on Sunday. In the match after scoring 19 runs, Virat became the fastest to reach 11,000 T20 runs in just 354 matches.Kohli slammed a stunning six over the long-off in the Wayne Parnell's over to reach this milestone. With that six in Parnell's over Kohli registered his name in the history book to become the first India to complete 11,000 runs in T20 history.During the match, Kohli displayed his class. For a moment, everything was mesmerized by the beautiful shots that Suryakumar was playing but Kohli made his presence count with some quality shots around the park.In the match, India batter Suryakumar Yadav also entered the elite list as he completed 1000 runs in T20I and became the third fastest Indian batter to achieve this feat.","content":"ANI Guwahati, October 2 Star batter Virat Kohli on Sunday became the first India to complete 11,000 runs in T20 history. Kohli achieved this feat during the second T20I against South Africa here at Barsapara Cricket Stadium, Guwahati on Sunday. In the match after scoring 19 runs, Virat became the fastest to reach 11,000 T20 runs in just 354 matches. Kohli slammed a stunning six over the long-off in the Wayne Parnell’s over to reach this milestone. With that six in Parnell’s over Kohli registered his name in the history book to become the first India to complete 11,000 runs in T20 history. During the match, Kohli displayed his class. For a moment, everything was mesmerized by the beautiful shots that Suryakumar was playing but Kohli made his presence count with some quality shots around the park. In the match, India batter Suryakumar Yadav also entered the elite list as he completed 1000 runs in T20I and became the third fastest Indian batter to achieve this feat. #virat kohli","pubDate":"2022-10-02 15:40:47","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_2087131994.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"विराट कोहली ने फटाफट क्रिकेट में हासिल किया नया मुकाम... निशाने पर शोएब मलिक और पोलार्ड का रिकॉर्ड","link":"https://hindi.news18.com/news/sports/cricket-virat-kohli-becomes-1st-indian-cricketer-to-completes-11000-runs-in-t20-cricket-4682847.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Virat Kohli Completes 11000 runs in T20 Cricket: विराट कोहली ने साउथ अफ्रीका के खिलाफ गुवाहाटी टी20 मैच में नाबाद 49 रन बनाए.","content":null,"pubDate":"2022-10-02 15:35:11","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/09/virat-kohli-16641249423x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"बिहार का लाल मुकेश अब दक्षिण अफ्रीका के खिलाफ ODI में दिखाएगा कमाल, पिता चलाते हैं ऑटो","link":"https://hindi.news18.com/news/bihar/gopalganj-gopalganj-mukesh-kumar-selected-in-india-cricket-team-play-first-match-with-south-africa-nodelsp-4682763.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India Cricket Team: बिहार के गोपालगंज के एक छोटे से गांव काकड़कुंड के रहने वाले मुकेश कुमार का इंडिया क्रिकेट टीम में चयन हो गया. गोपालगंज के 50वां स्थापना दिवस के दिन ही बीसीसीआई ने इसकी अधिकारिक रूप से घोषणा की है. मुकेश कुमार इंडिया के लिए पहला मैच साउथ अफ्रीका से छह अक्टूबर को खेलेंगे. वनडे मैच भारत में ही खेला जायेगा, जिसके लिए छह, आठ और 11 अक्टूबर की तिथि निर्धारित की गई है.","content":null,"pubDate":"2022-10-02 15:33:16","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/10/mukesh-kumar-criketer-16647229543x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Jemimah Rodrigues shines in India's convincing win over Sri Lanka","link":"https://www.sentinelassam.com/sports/cricket/jemimah-rodrigues-shines-in-indias-convincing-win-over-sri-lanka-616128","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Right-handed batter Jemimah Rodrigues marked a glorious return to the national team with her T20I career-best knock of 76","content":"SYLHET: Right-handed batter Jemimah Rodrigues marked a glorious return to the national team with her T20I career-best knock of 76, and the bowlers picked up wickets at regular intervals as India registered a convincing 41-run win over Sri Lanka in their opening match of Women's Asia Cup at the Sylhet International Cricket Stadium on Saturday. Apart from her knock of 76 coming off 53 balls, laced with 11 fours and a six at a strike rate of 143.40, Jemimah looked rock-solid in her drives and was also involved in a 92-run partnership for the third wicket with captain Harmanpreet Kaur (33) in a match-defining stand after losing openers Smriti Mandhana and Shafali Verma cheaply. But after Jemimah fell, things slowed down a bit for India as they scored only 16 off the next 14 balls to be at 150/6 in 20 overs. In reply, Dayalan Hemalatha (3/15), Deepti Sharma (2/15) and Pooja Vastrakar (2/12) were instrumental in bowling out Sri Lanka for 109 in 18.2 overs. Electing to bowl first, Sri Lanka had early success as Smriti and Shafali holed out in the deep in the first four overs. Jemimah took time before driving Sugandika Kumari for a brace of fours in the final over of powerplay. She then dished out similar treatment in successive overs to Achini Kulasuriya and Malsha Shehani. On the other hand, Harmanpreet started her boundary flow by sweeping Inoka Ranaweera twice in two overs on the leg-side. But the scorching heat meant she needed attention from the physiotherapist and was soon stumped off Oshadi Ranasinghe a ball after long-off palmed the ball over for six. Jemimah continued to manufacture a few shots after reaching her eight fifty in T20Is, like hitting Inoka for back-to-back fours — smacking over long-on was followed by a cheeky reverse sweep through the off-side. It took an attempted swing across the line which was missed to shatter her stumps off captain Chamari Athapaththu, ending a sublime stay at the crease. After that, In'ia couldn't do much but managed to reach the 150-mark. In the chase, Harshitha Madavi had a blistering start, taking three fours through cover, fine leg and off the outer edge in the opening over off Renuka Thakur. But the standout shot from her early burst was dancing down the pitch to loft Sneh Rana down the ground. Though Deepti Sharma took out Chamari, Harshitha found an ally in Malsha to take Sri Lanka to 39/1 in five overs. In the final over of power-play, Malsha tried to steal a quick single by pushing the ball to a backward point, only for Deepti to gather it quickly and fire a direct hit after a 360-degree turn'at the bowler's end to catch her short of the crease. Two overs later, a horrible mix-up led to Harshitha's dismissal. From there, it was one-way traffic as Pooja Vastrakar struck twice before Radha Yadav trapped Anushka Sanjeewani lbw and Deepti took another scalp. Dayalan Hemalatha then picked three tail wickets to draw early curtains on the match. Brief Scores: India 150/6 in 20 overs (Rodrigues 76, Harmanpreet Kaur 33; Ranasinghe 3/32, Athapaththu 1/8) beat Sri Lanka 109 all out in 18.2 overs (Perera 30, Madavi 26; Dayalan Hemalatha 3/15, Pooja Vastrakar 2/12) by 41 runs. IANS Also Read: Melbourne Stars Rope In India Batter Jemimah Rodrigues Also Watch:","pubDate":"2022-10-02 15:25:22","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/02/397301-jema.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA 2nd T20I: After dogs and bees, now snake halts a cricket match - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvaW5kLXZzLXNhLTJuZC10MjBpLWFmdGVyLWRvZ3MtYW5kLWJlZXMtbm93LXNuYWtlLWhhbHRzLWEtY3JpY2tldC1tYXRjaC04MTg2MzQ3L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA 2nd T20I: After dogs and bees, now snake halts a cricket match  The Indian ExpressIND vs SA 2nd T20I, Cricket Score: Miller's Scintillating Ton in Vain; Rohit & Co. Create History  India.comIndia vs South Africa Highlights, 2nd T20I 2022: India beat South Africa by 16 runs to seal the series 2-0  Times of IndiaGuwahati: ACA Barsapara Stadium Infrastructure Still Questionable  Guwahati PlusIndia vs South Africa Highlights 2nd T20I: David Miller Hits Century in High-scoring Contest But IND Clinch  News18View Full coverage on Google News","content":null,"pubDate":"2022-10-02 14:58:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA 2nd T20I: After dogs and bees, now snake halts a cricket match","link":"https://indianexpress.com/article/sports/cricket/ind-vs-sa-2nd-t20i-after-dogs-and-bees-now-snake-halts-a-cricket-match-8186347/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-02 14:58:55","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Jos Buttler not playing today’s 7th T20I between Pakistan and England in Lahore?","link":"https://thesportsrush.com/cricket-news-why-is-jos-buttler-not-playing-todays-7th-t20i-between-pakistan-and-england-in-lahore/","keywords":["Cricket","England tour of Pakistan 2022","Jos Buttler"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Jos Buttler not playing today’s 7th T20I versus Pakistan despite having travelled along with the entire squad ahead of the historic tour. England White ball skipper Jos Buttler will yet again remain out of action during the ongoing seventh and final T20I between England and Pakistan, at the Gaddafi Stadium in Lahore. In what is… The post Why is Jos Buttler not playing today’s 7th T20I between Pakistan and England in Lahore? appeared first on The SportsRush.","content":"England White ball skipper Jos Buttler will yet again remain out of action during the ongoing seventh and final T20I between England and Pakistan, at the Gaddafi Stadium in Lahore. In what is expected to be a cracker of a final match tonight with the series evenly poised at 3-3, Pakistan skipper Babar Azam has won the Toss and elected to field first. Having rested their in-form players in wicket-keeper batter Mohammad Rizwan, and pacer Haris Rauf during the previous T20I, Pakistan have made sure to include both of them in the series decider tonight, replacing Mohammad Haris and Shahnawaz Dahani respectively. Also, bowling allrounder Aamer Jamal has made way for Mohammad Hasnain as the other change in the pace bowling department. As for England, allrounder Chris Woakes is in for Richard Gleeson, as their only change in the playing XI. One final pep talk 🗣 🇵🇰 🏴󠁧󠁢󠁥󠁮󠁧󠁿 — England Cricket (@englandcricket) Jos Buttler, who was in the playing XI during the last two T20Is, will leave the Pakistan shores without a single game under his belt. For those unaware, Buttler had suffered a calf injury during ‘The Hundred’ a few weeks ago, and had decided to not partake during the Karachi leg (first four T20Is) of the ongoing tour, despite well on path to his recovery. Post winning the sixth T20I, England’s skipper for the tour Moeen Ali, after being questioned on Buttler’s availability for the ongoing seventh T20I had remarked, “He’s feeling good, been training a bit more. Whether or not we risk him for one game, we’ll see.” Thus, with mere one game remaining, the team management is clearly not willing to take any chances with the T20 World Cup only a couple of weeks due, while also having coped a big blow earlier, when Jonny Bairstow too, of the same a few weeks ago.","pubDate":"2022-10-02 14:58:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Watch: Snake interrupts play during second India-South Africa T20I","link":"https://timesofindia.indiatimes.com/sports/cricket/south-africa-in-india/watch-snake-interrupts-play-during-second-india-south-africa-t20i-match-resumes-after-few-minutes/articleshow/94603993.cms","keywords":null,"creator":null,"video_url":null,"description":"The second T20I between India and South Africa had to be stopped after a snake invaded the cricket field, however, the match was resumed after a couple of minutes.","content":"GUWAHATI: The second T20I between India and South Africa had to be stopped after a snake invaded the cricket field, however, the match was resumed after a couple of minutes. While there were expectations of rain during the match, it was the snake who took the all highlights in the seventh over of India's innings as the match was put on hold temporarily. Snake also reached to watch the cricket match of India and South Africa at the stadium in Guwahati.#Guwahati… https://t.co/OyVES0Qlub — Prateek Pratap Singh (@PrateekPratap5) 1664720200000 During the match, a couple of South African players pointed it out to KL Rahul and the on-field umpires. The ground staff then rushed in with the necessary equipment and sorted the problem in a couple of minutes. The players, meanwhile, took unofficial drinks to break. The incident took place during the starting of the seventh over of the innings.","pubDate":"2022-10-02 14:55:03","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Snake interrupts play during second IND-SA T20I","link":"https://telanganatoday.com/snake-interrupts-play-during-second-ind-sa-t20i","keywords":["India","News","Sport","IND-SA","KL Rahul","snake"],"creator":["ANI"],"video_url":null,"description":"Guwahati: The second T20I between India and South Africa had to be stopped after a snake invaded the cricket field, however, the match was resumed after a couple of minutes. While there were expectations of rain during the match, it was the snake who took the all highlights in the seventh over of India’s innings […]","content":"Guwahati: The second T20I between India and South Africa had to be stopped after a snake invaded the cricket field, however, the match was resumed after a couple of minutes. While there were expectations of rain during the match, it was the snake who took the all highlights in the seventh over of India’s innings as the match was put on hold temporarily. During the match, a couple of South African players pointed it out to KL Rahul and the on-field umpires. The ground staff then rushed in with the necessary equipment and sorted the problem in a couple of minutes. The players, meanwhile, took unofficial drinks to break. The incident took place during the starting of the seventh over of the innings. Talking about the match, South Africa skipper Temba Bavuma won the toss and opted to field against India in the second game of the three-match T20I series here at Barsapara Cricket Stadium, Guwahati on Sunday. South Africa (Playing XI): Quinton de Kock(w), Temba Bavuma(c), Rilee Rossouw, Aiden Markram, David Miller, Tristan Stubbs, Wayne Parnell, Keshav Maharaj, Kagiso Rabada, Anrich Nortje and Lungi Ngidi. India (Playing XI): KL Rahul, Rohit Sharma(c), Virat Kohli, Suryakumar Yadav, Rishabh Pant(w), Dinesh Karthik, Axar Patel, Ravichandran Ashwin, Harshal Patel, Deepak Chahar and Arshdeep Singh.","pubDate":"2022-10-02 14:52:20","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Snake in cricket ground: Watch snake stops play in India vs South Africa 2nd T20I in Guwahati","link":"https://thesportsrush.com/cricket-news-snake-in-cricket-ground-watch-snake-stops-play-in-india-vs-south-africa-2nd-t20i-in-guwahati/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Snake in cricket ground: An unwanted visitor managed to stop the play at the Barsapara Cricket Ground tonight. During the second T20I of South Africa’s second tour of India 2022 in Guwahati, an unwanted visitor not only managed to find its way on the ground but was also successful in halting play for a brief… The post Snake in cricket ground: Watch snake stops play in India vs South Africa 2nd T20I in Guwahati appeared first on The SportsRush.","content":"During the second T20I of South Africa’s second tour of India 2022 in Guwahati, an unwanted visitor not only managed to find its way on the ground but was also successful in halting play for a brief period. It all happened after the seventh over of the Indian innings when a snake was seen crawling on the ground at the Barsapara Cricket Stadium. What followed were groundsmen active and prepared enough with the right kind of equipment to tackle the situation by catching hold of the snake. Successful in doing so, groundsmen’s swift work resulted in players resuming play without a lot of time being wasted. Put in to bat first by South Africa captain Temba Bavuma, India vice-captain KL Rahul (57) and captain Rohit Sharma (43) got going from the word go to score as many as 57 runs in the powerplay. The two right-handed batters eventually ended up putting together a 59-ball 96-run opening partnership before South Africa spinner Keshav Maharaj dismissed both of them around the halfway mark. Giving a thumping response to critics with respect to his strike rate, Rahul’s 20th T20I half-century saw him hitting five fours and four sixes at a strike rate of 203.57. Sharma, on the other hand, seemed to be wanting to take his time to register a change in approach tonight. Sharma, who hit seven fours and a six, batted at a strike rate of 116.21 before becoming the first Indian batter to get out. Snake 🐍 in the House — Ashwani JP Singh (@ashwanijpsingh) That is a first for me. A second snake on the ground. But the staff seemed prepared! Quick pick-up and off! — Harsha Bhogle (@bhogleharsha) Game halted for a snake 🐍 It is just like Australian suburb grounds 👍🏽 — Lisa Sthalekar (@sthalekar93) South Africa’s 12th man… — Snijith Roop (@SnijithRoop) For more cricket-related news, click .","pubDate":"2022-10-02 14:48:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}