{"newsArray":[{"title":"Pacer Hasnain replaces Shaheen in Asia Cup squad","link":"https://www.thenews.com.pk/print/984615-pacer-hasnain-replaces-shaheen-in-asia-cup-squad","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Pakistan Cricket Board’s selectors have put their faith in speedster Mohammad Hasnain, who will replace Shaheen Shah Afridi in the Pakistan squad for the ACC T20 Asia Cup starting in United Arab Emirates from August 27.Hasnain returned to the international scene just...","content":null,"pubDate":"2022-08-23 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"BD strip Domingo of T20 role days before Asia Cup","link":"https://www.thenews.com.pk/print/984620-bd-strip-domingo-of-t20-role-days-before-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"DHAKA: Bangladesh stripped head coach Russell Domingo of his role overseeing the Twenty20 side and told him to focus on Test and one-day international cricket, just days before the Asia Cup.Bangladesh Cricket Board president Nazmul Hassan said that former Indian cricketer Sridharan Sriram, named...","content":null,"pubDate":"2022-08-23 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pre-season camp for domestic season begins today","link":"https://www.thenews.com.pk/print/984626-pre-season-camp-for-domestic-season-begins-today","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The 2022-23 domestic men’s pre-season camp will commence on Tuesday at the respective cricket centres of the six Cricket Associations.The preliminary squads of Balochistan, Central Punjab, Khyber Pakhtunkhwa, Northern, Sindh and Southern Punjab will train at Bugti Stadium, Quetta,...","content":null,"pubDate":"2022-08-23 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Stokes opens up on facing mental breakdown","link":"https://www.perthnow.com.au/sport/cricket/stokes-opens-up-on-facing-mental-breakdown-c-7972093","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"England Test skipper Ben Stokes has opened up about experiencing panic attacks, coping with grief and wanting to walk away from cricket in a new documentary.","content":null,"pubDate":"2022-08-23 00:40:49","image_url":"https://images.perthnow.com.au/publication/C-7972093/2128e74fc2abfee245305de49f5cab647374a87a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hammering ton: Shubman Gill’s maiden ton propels India to ODI series sweep","link":"https://www.tribuneindia.com/news/sports/hammering-ton-shubman-gills-maiden-ton-propels-india-to-odi-series-sweep-424385","keywords":null,"creator":null,"video_url":null,"description":"HARARE, August 22 Shubman Gill struck a maiden One-day International century to steer India to a nervy 13-run victory over hosts Zimbabwe today and complete a clean sweep of their three-match series at the Harare Sports Club. My heart was beating when I got into the 90s. I had got out in the 90s thrice before and never got a hundred in international cricket. It's always special to get a hundred... This one is for my dad Shubman Gill, Man of the series Gill hammered 130 runs off 97 balls as India recovered from a slow start to score an imposing 289/8 after winning the toss and electing to bat first, before bowling Zimbabwe out for 276 in the last over of the home side's innings. Zimbabwe were in the hunt all the way thanks to Sikandar Raza's sixth ODI century as he scored 115 from 95 balls, but when he fell in the penultimate over, their chances of a first victory over India since 2010 faded. It was the closest outcome of the series after India won by 10 wickets in the opening clash on Thursday, followed by a five-wicket triumph in Saturday's second game. Gill showed expert timing as he drove the home attack to all corners and quickly lifted the run rate after India were 84/2 in the 21st over. He put on a 140-run partnership for the second wicket with Ishan Kishan, who scored 50, but after that watched a succession of partners depart cheaply as Brad Evans completed his first five-wicket haul in international cricket with figures of 5/54 in his 10 overs. Brief scores: India: 289/8 (Gill 130, Kishan 50; Evans 5/54); Zimbabwe: 276 all out (Raza 115, Williams 45; Avesh 3/66, Axar 2/30). — PTI 130 Gill's 130 is the highest individual score by an Indian against Zimbabwe in ODIs. Sachin Tendulkar's 127 in 1998 was the previous record.","content":null,"pubDate":"2022-08-23 00:38:48","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_1033872095.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-England&#039;s Stokes opens up about anxiety medication","link":"https://www.thestar.com.my/sport/cricket/2022/08/23/cricket-england039s-stokes-opens-up-about-anxiety-medication","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England test captain Ben Stokes kept the dialogue on mental health going as the all-rounder revealed he was still on anxiety medication after returning from a six-month break to focus on his wellbeing. Read full story","content":"(Reuters) - England test captain Ben Stokes kept the dialogue on mental health going as the all-rounder revealed he was still on anxiety medication after returning from a six-month break to focus on his wellbeing. The 31-year-old took a rest from the sport last year to focus on his mental health as he was suffering from a series of panic attacks following the loss of his father to brain cancer almost two years ago. He announced in July he would retire from one-day cricket citing the \"unsustainable\" rigour of playing all three formats of the game. \"I never thought I would be on medication to help me for that kind of stuff. I am not embarrassed or ashamed to say it because I needed the help at the time,\" Stokes said in an Amazon documentary, which will be released on Friday. \"But it's not done just because I'm back playing. I still speak to the doc, not as regularly, and I'm still taking medication every day. It's an ongoing process.\" Stokes said he felt deep resentment towards cricket when he took the break because he had been unable to visit his dying father as much as he wanted. \"So I had a real thing with cricket at the time I took a break. I was really angry at the sport because it was dictating when I could see my dad,\" he told the Telegraph in an interview. He stressed the importance of opening up about mental health, adding it was not human nature to pretend to be fine. \"I find sometimes people are a bit nervous to go into the detail about that kind of stuff with me. It's perceived you can't feel a certain way - that's a sign of weakness to show that you are not mentally feeling great,\" he said. \"People think they can't ask people who have struggled. No. It's fine. I'll happily tell you as much as I possibly can.\" (Reporting by Silvia Recchimuzzi in Gdansk; Editing by Sam Holmes)","pubDate":"2022-08-23 00:22:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/23/1707680.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Michael Slater’s ex reveals disturbing texts from Aussie cricket great amid claims of abuse","link":"https://www.foxsports.com.au/cricket/michael-slaters-ex-reveals-disturbing-texts-from-aussie-cricket-great-amid-claims-of-abuse/news-story/fe2bd3a1df6f6ab6d79fc76ca0aad70f","keywords":null,"creator":null,"video_url":null,"description":"An ex-partner of Michael Slater has come forward with disturbing text messages she claims the former cricketer sent to her.","content":"An ex-partner of Michael Slater has come forward with disturbing text messages she claims the former cricketer sent to her. A Victorian mother of three has told The Herald Sun Slater allegedly threatened to release personal photos and videos he took of her without her knowledge or consent and threatened to send them to her children. You can read the full series of text messages in The Herald Sun The woman, who has described Slater as a “narcissist”, says she asked Slater to sign a legal deed agreeing not to publish the intimate images. The text messages he is accused of sending include claims the woman, who has not been identified, was “heartless” for not resuming their relationship, which began in 2016, after she cut ties with the 52-year-old. Watch The Hundred. Every Match Live & Exclusive to Fox Sports on Kayo. New to Kayo? Start your free trial now > “I am going to do my best to make you feel my pain,” he allegedly sent in one of the messages. “I’m now completely over you and going to bring you down. No one deserves the treatment I’ve received. Michael Slater in his television commentary role. Source: Supplied “You’ve (sic) f***ed and a piece of dog s**t,” he allegedly sent in a third. He also allegedly sent “I feel like a worthless piece of s***” as a result of the woman’s refusal to engage with him. The woman alleges Slater threatened self harm if she did not consent to resuming their relationship. She also alleges she was physically assaulted by Slater and was thrown to the ground in one incident. The Herald Sun reports Slater is currently in a Sydney mental health facility. Slater is banned from contacting a number of complainants who have apprehended violence orders against him. Australian cricketer Michael Slater leaves Manly Police Station in October. Picture: Richard Dobson. Source: News Corp Australia Slater again fronted court last month after police rushed to his Sydney home on July 14 over a concern for his welfare before he was transported in an ambulance to Northern Beaches Hospital. He was charged with breaching his bail. He was granted strict conditional bail, meaning he must stay away from alcohol and drugs, and be of good behaviour. Charges relating to a separate incident in 2021 were dismissed on mental health grounds earlier this year. Slater will return to court to fight the charges in January next year. He began his career in 1993 and played 74 tests for Australia through to 2001.","pubDate":"2022-08-22 23:37:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Michael Slater: Former girlfriends accuse ex-cricket great of violent and abusive behaviour","link":"https://thewest.com.au/news/michael-slater-former-girlfriends-accuse-ex-cricket-great-of-violent-and-abusive-behaviour--c-7971106","keywords":null,"creator":["Troy de Ruyter"],"video_url":null,"description":"Two former girlfriends of ex-Australian cricketer Michael Slater have accused him of violent and abusive behaviour.","content":null,"pubDate":"2022-08-22 22:55:49","image_url":"https://images.thewest.com.au/publication/C-7971106/a63892ba5cc0d861e9ae4de7402fbce03908790a-16x9-x0y169w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stuart Broad set to miss England Test tour of Pakistan with fiancee Mollie King due to give birth to first child","link":"https://www.thesun.co.uk/sport/cricket/19587345/stuart-broad-moss-england-tour-mollie-king-baby/","keywords":["Cricket"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"STUART BROAD could miss the first three Tests of the winter as England’s top players face more schedule madness. The vastly-experienced bowler is ready to opt out of the tour of Pakistan in December to be with his fiancee, singer and Radio One presenter Mollie King, as she prepares to give birth to their first child. Stuart Broad might decide to be with pregnant fiancee Mollie King rather than tour AFPVeteran speedster Stuart Broad could be a victim of England’s hectic schedule[/caption] Several other players chosen for England’s first Test matches in Pakistan since 2005 face a hectic itinerary with just a few days between the end of the Twenty20 World Cup in Australia and a pre-tour training camp in Abu Dhabi. Those impacted could include captain Ben Stokes, Jonny Bairstow, Chris Woakes, Mark Wood and, if he overturns his retirement from Test cricket, Moeen Ali. Top players are being forced to miss more and more cricket to try to avoid burn-out and possible injury. Stokes and Bairstow both pulled out of The Hundred this summer and Stokes has quit 50-over cricket altogether. READ MORE IN SPORT 'WE'LL BE BACK' Stokes suffers first loss as England captain as South Africa win 1st Test PRIZE TIME Enter for chance to win a Lamborghini + £5,000 from just 89p with The Sun's code JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) The strain has told on bowlers Jofra Archer, Wood and Woakes, all absent with long-term injuries. Even yesterday, England white-ball captain Jos Buttler, who plays for Manchester Originals, withdrew from the remainder of The Hundred with a calf injury. England leave for Pakistan for seven T20 matches on September 14, just two days after the final Test against South Africa at The Oval is due to finish. The T20 squad then flies to Australia for World Cup warm-up matches before their tournament opener against Afghanistan on October 22. The T20 World Cup final is in Melbourne on November 13 and England begin their Test match training camp in Abu Dhabi on November 18, followed by their only warm-up match against England Lions on November 23. Most read in Cricket 'WE'LL BE BACK' Stokes suffers first loss as England captain as South Africa win 1st Test MOR WOE Morgan flies 5,500 miles for nothing as SA ease to First Test win on Day Three STU BEAUTY Watch Stuart Broad take outrageous diving catch leaving England fans stunned ROOTING FOR YA Who is England cricket star Joe Root's wife Carrie? RIP RUDI Tributes paid to late cricket umpire Rudi Koertzen after car crash HIT FOR SIX Chaos at England Test match vs New Zealand as fight breaks out in stands Captain Stokes, coach Brendon McCullum and the squad will then fly to Pakistan for the First Test in Rawalpindi on December 1 followed by further Tests in Multan on December 9 and Karachi on December 17. The dates and venues were confirmed yesterday. Some players not involved in the Pakistan Test series will remain in Australia for three 50-over matches following the T20 World Cup. Others will be flown out to bolster the squad. In early 2023, England have a Test series in New Zealand and white-ball matches in South Africa and Bangladesh. Pakistan switched their home matches to the UAE following an attack on a coach carrying the Sri Lankan team and match officials outside the stadium in Lahore in 2009. Broad’s father, Chris, working as match referee, was caught up in the terror but was uninjured. Two civilians and six policemen were killed. Cricket has been returning to Pakistan, with several English players appearing in the Pakistan Super League T20 event and Australia touring this year. England were due to return to the country last year for limited-overs matches but caused outrage when they refused to travel claiming the mental and physical well- being of the players could be harmed. ECB’s interim chief executive Clare Connor said: “The return of our men’s Test team to Pakistan for the first time since 2005 will be an historic occasion. “The opportunity to play Test cricket in front of passionate cricket-lovers in Pakistan after such a long time is something to be cherished. “We have been working closely with the PCB over recent months and I am grateful for everything they have done.”","pubDate":"2022-08-22 20:52:52","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“He reminds me so much of Mohammed Amir”: Twitter reactions on George Garton dismissing three Welsh Fire batters on a Duck during The Hundred 2022 match in Cardiff","link":"https://thesportsrush.com/cricket-news-he-reminds-me-so-much-of-mohammed-amir-twitter-reactions-on-george-garton-dismissing-three-welsh-fire-batters-on-a-duck-during-the-hundred-2022-match-in-cardiff/","keywords":["Cricket","George Garton","Southern Brave","The Hundred 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"George Garton dismissing the Welsh Fire top-3 batters for a Duck at the start of the innings, was applauded by fans on social media. During the 22nd match of the ongoing The Hundred 2022 men’s competition between the Welsh Fire and Southern Brave at the Sophia Gardens in Cardiff, Brave’s left-arm seamer George Garton has… The post “He reminds me so much of Mohammed Amir”: Twitter reactions on George Garton dismissing three Welsh Fire batters on a Duck during The Hundred 2022 match in Cardiff appeared first on The SportsRush.","content":"George Garton dismissing the Welsh Fire top-3 batters for a Duck at the start of the innings, was applauded by fans on social media. During the 22nd match of the ongoing The Hundred 2022 men’s competition between the Welsh Fire and Southern Brave at the Sophia Gardens in Cardiff, Brave’s left-arm seamer George Garton has already delivered a match-winning display of seam and swing bowling during his initial set of 10 deliveries. Ever since Brave’s skipper James Vince opted to bowl first after calling it correctly at the Toss, it has been all about the 25-year-old medium pacer, who dismissed the 18-year-old debutant Jacob Bethall for a Golden Duck on only his second delivery of the match. A delivery later, he dismissed the Welsh Fire skipper Josh Cobb for a two-ball Duck, as he went right through his defence, to rattle his leg-stump off a brute of an inswinging Yorker. Having picked the desired rhythm, Garton decided to bowl a ten-ball set, which yet again reaped dividend as he managed to get the experienced Ben Duckett’s outside edge, who flashed at the short and wide delivery outside the off-stump, only to edge the ball through to the wicket-keeper Quinton de Kock. Garton finished his devastating opening set of 10 deliveries, by conceding mere one run (on the first delivery), followed by nine consecutive dots, including three wickets, to place the hosts on the back foot early on, as they search for their maiden victory in the ongoing season. At the time of writing, Welsh Fire were reeling at the score of 69/5 after 70 deliveries, with the experienced David Miller (15 off 18) too back in the hut, after a rather uncomfortable stay at the crease. Leus du Plooy (28*) and Matthew Critchley (6*) were the ones occupying the crease, with 30 deliveries yet to be bowled. Simon Doull constantly referring to “Gorgeous George Garton” like a proud mum. You love to see it. — Mark Puttick (@GryllidaeC) August 22, 2022 All of George Garton’s Hundred wickets this year have been batters dismissed for ducks & have followed a bowled-caught de Kock-bowled-caught de Kock pattern 0 J Roy b G Garton 0 J Bethell c de Kock b G Garton 0 J Cobb b Garton 0 B Duckett c de Kock b G Garton — Mark Puttick (@GryllidaeC) August 22, 2022 George. Garton. 😱 #TheHundred pic.twitter.com/5DeFOe9Vz0 — The Hundred (@thehundred) August 22, 2022 10 balls bowled. 1 run conceded. 3 wickets. 🌟 @george_garton — The Hundred (@thehundred) August 22, 2022 Exceptional new ball bowling from George Garton, picking up three wickets in his opening set of ten deliveries – he’s averaged 2.18° of swing, the highest for any opening spell so far in the Men’s Hundred this season. #TheHundred @SageUK pic.twitter.com/n0Rztj12dj — The CricViz Analyst (@cricvizanalyst) August 22, 2022 Blimey, George Garton is exciting.. #TheHundred — Jack Mendel 🗞️ (@Mendelpol) August 22, 2022 He reminds me soooo much of Mohammed Amir — Jack Mendel 🗞️ (@Mendelpol) August 22, 2022 Hi confidence is shot and in a spiral of decline. JR feels it more than most. But it doesn’t help when bowlers know it or when ‘Gorgeous George’ Garton bowls a peach like he can on occasion. — Charlie 🏴󠁧󠁢󠁥󠁮󠁧󠁿🇪🇺 (@charlie_strange) August 14, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-22 18:48:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Subman Gill won the man of the series award in 2 consecutive ODI series","link":"https://thenewsglory.com/subman-gill-won-the-man-of-the-series-award-in-2-consecutive-odi-series/","keywords":["Sports","Cricket","game","India","Shubman Gill","Subman Gill"],"creator":["The News Glory"],"video_url":null,"description":"Subman Gill, the young batsman of the Indian cricket team, has won the Man of the Series award in two successive ODI series. Through this, he has adapted himself as an indispensable batsman in Indian ODI cricket. The 22-year-old Gill made his international debut in 2019. So far he has played 9 ODIs and 11 […]","content":"Subman Gill, the young batsman of the Indian cricket team, has won the Man of the Series award in two successive ODI series. Through this, he has adapted himself as an indispensable batsman in Indian ODI cricket. The 22-year-old Gill made his international debut in 2019. So far he has played 9 ODIs and 11 Tests. He had an outstanding performance in the series against West Indies and Zimbabwe. Both the countries have different environment. He adjusted himself accordingly and played. His last 6 ODIs included 64, 43, 98*, 82*, 33 and 130 runs. (*not out) He scored 205 runs in three ODIs against the West Indies. His batting average in that series was 102.5. With that he won the Man of the Series award. He scored 245 runs in three ODIs in the series against Zimbabwe. His batting average was 122.5. He won the Man of the Series award in this series as well. With this, he has shown his dominance in the arena of ODI cricket. It is expected that he will definitely be given a chance in the Indian team for the upcoming 2023 ODI World Cup series. \r","pubDate":"2022-08-22 18:43:08","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM 3rd ODI Highlights: India survive Sikandar Raza scare to win a thriller by 13 runs - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtemltLTNyZC1vZGktbGl2ZS1zY29yZS11cGRhdGVzLTgxMDQyMTYv0gFkaHR0cHM6Ly9pbmRpYW5leHByZXNzLmNvbS9hcnRpY2xlL3Nwb3J0cy9jcmlja2V0L2luZC12cy16aW0tM3JkLW9kaS1saXZlLXNjb3JlLXVwZGF0ZXMtODEwNDIxNi9saXRlLw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ZIM 3rd ODI Highlights: India survive Sikandar Raza scare to win a thriller by 13 runs  The Indian ExpressIndia vs Zimbabwe 2022 Highlights, 3rd ODI: IND Hold on For a 13-run Win And Complete 3-0 Series Sweep  News18India News Live Updates: India beats Zimbabwe by 13 runs in the 3rd ODI, win the 3-match series 3-0  Economic TimesRecent Match Report - India vs Zimbabwe 3rd ODI 2022  ESPNcricinfoHighlights India vs Zimbabwe 3rd ODI, Harare: IND Beat ZIM By 13 Runs To Complete Clean Sweep After Sikandar  Cricket Country News","content":null,"pubDate":"2022-08-22 17:33:11","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Babar Azam is the only player…”: Inzamam-ul-Haq reckons over-dependence on Babar Azam might hurt Pakistan during Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-babar-azam-is-the-only-player-inzamam-ul-haq-reckons-over-dependence-on-babar-azam-might-hurt-pakistan-during-asia-cup-2022/","keywords":["Cricket","Asia Cup 2022","babar azam","Inzamam-ul-Haq"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Inzamam-ul-Haq reckons relying heavily on Pakistan skipper Babar Azam might not be good signs for the team during their Asia Cup campaign. Not even a week away now from the commencement date, the build-up to the Asia Cup 2022 has so far has managed to successfully spice things up, especially amongst the fans of the… The post “Babar Azam is the only player…”: Inzamam-ul-Haq reckons over-dependence on Babar Azam might hurt Pakistan during Asia Cup 2022 appeared first on The SportsRush.","content":"Inzamam-ul-Haq reckons relying heavily on Pakistan skipper Babar Azam might not be good signs for the team during their Asia Cup campaign. Not even a week away now from the commencement date, the build-up to the Asia Cup 2022 has so far has managed to successfully spice things up, especially amongst the fans of the arch-rivals India and Pakistan. With the star pacers from both these sides – Jasprit Bumrah and Shaheen Shah Afridi ruled out due to injury, fans are yet to decide which of the two teams will start in a position of strength, with the former cricketers too, coming up with their verdicts on the same in their respective bids to not lose the off-field battle. In the batting department, while team India will be in a bit of a concern regarding their star batter Virat Kohli’s poor run-of-form across formats off-late, the Pakistan side dread of an over-reliance on their star batter cum skipper Babar Azam, who has been one of the very few players in the side to have performed consistently across formats. ALSO READ: Babar Azam vs Virat Kohli centuries comparison Inzamam-ul-Haq reckons over-reliance on Babar Azam might hurt Pakistan big time Echoing similar such sentiments mentioned above is Pakistan’s legendary batter Inzaman-ul-Haq, who is of the view that Babar Azam is the only player to have consistently scored runs in the build-up to the imminent Asia Cup. He cited the examples of Babar’s fellow batters in Fakhar Zaman and wicket-keeper batter Mohammad Rizwan, who have scored runs in one match or the other, but have not been able to maintain that required consistency. A look at the numbers of the Pakistan batting line-up in their recently concluded tour of the Netherlands, no other batter apart of Babar, who smashed consecutive fifties in each of the three ODIs, could deliver consistently in successive matches. This over-reliance on just one batter, might hurt the team during the all-important Asia Cup. “I am tensed about one particular aspect of Pakistan cricket. For example, Fakhar Zaman scored a century against the Netherlands but got quiet in the next couple of innings. Other players like Muhammad Rizwan also hit a century but didn’t continue their form. Babar Azam is the only player who is scoring runs consistently, “remarked Inzamam. The post “Babar Azam is the only player…”: Inzamam-ul-Haq reckons over-dependence on Babar Azam might hurt Pakistan during Asia Cup 2022 appeared first on The SportsRush.","pubDate":"2022-08-22 17:29:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Pleasing to the eye”: KL Rahul wax lyrical about Shubman Gill as India thrash Zimbabwe 3-0 in Harare","link":"https://thesportsrush.com/cricket-news-pleasing-to-the-eye-kl-rahul-wax-lyrical-about-shubman-gill-as-india-thrash-zimbabwe-3-0-in-harare/","keywords":["Cricket","India","India tour of Zimbabwe 2022","KL Rahul","Shubman Gill","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KL Rahul wax lyrical about Shubman Gill: The Indian captain praised an in-form batter for extending a run-scoring spree. A clinical 3-0 series victory against Zimbabwe in Harare has achieved multiple motives for India according to captain KL Rahul. Labeling India’s performance as “professional”, Rahul expressed satisfaction at leading the team to his first series… The post “Pleasing to the eye”: KL Rahul wax lyrical about Shubman Gill as India thrash Zimbabwe 3-0 in Harare appeared first on The SportsRush.","content":"KL Rahul wax lyrical about Shubman Gill: The Indian captain praised an in-form batter for extending a run-scoring spree. A clinical 3-0 series victory against Zimbabwe in Harare has achieved multiple motives for India according to captain KL Rahul. Labeling India’s performance as “professional”, Rahul expressed satisfaction at leading the team to his first series victory as captain. “Feels good. We came here with a few ideas and wanted to use these games. A few of us haven’t got a game for some time and wanted to use the time. We were very professional with how we played. Very happy with the result,” Rahul told host broadcaster after the third ODI today. While the first two matches of the series were more of one-sided encounters, Zimbabwe really put forward their A-game in a 290-run chase. A 73-ball 104-run eighth wicket partnership between all-rounder Sikandar Raza (115) and pacer Brad Evans (28) had almost won the match for them but it wasn’t to be after Shardul Thakur dismissed Raza in the penultimate over. In spite of Indian players committing on-field errors especially in the last 15 overs or so, Rahul opined that he wasn’t nervous even when Zimbabwe were within touching distance of winning an ODI against India after 12 years. “I wouldn’t say nervous but [Sikandar] Raza and [Brad] Evans took it deep. But it is good that we were challenged and the bowlers were tested,” Rahul added. Readers must note that Raza and Evans’ stand was the joint fifth-highest (joint third-highest for Zimbabwe) ODI eighth wicket partnership. India’s tour of Zimbabwe 2022 has been added as another chapter in the book elaborating batter Shubman Gill’s talent. Yet to justify his potential in Test cricket, Gill has accepted ODI opportunities with both hands scoring 450 runs in six innings at an average and strike rate of 112.50 and 111.66 respectively in the last one month. CHAMPIONS 🇮🇳 #TeamIndia pic.twitter.com/nVxqZ9A7v4 — BCCI (@BCCI) August 22, 2022 Winner of both the match and series award at the Harare Sports Club on Monday, Gill has already started to establish himself as the third opening batter in ODIs behind Rohit Sharma and Shikhar Dhawan. Asked about the 22-year old player, Rahul didn’t shy away from appreciating Gill across multiple positives. “He has batted well throughout the series and did well in West Indies and the IPL. Pleasing to the eye when he bats and good to see him use his form and score runs and good to see his composure and to show the temperament despite not having played a lot of internationals,” Rahul mentioned.","pubDate":"2022-08-22 16:49:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM 3rd ODI | Zimbabwe fought till the end: India won the series 3-0","link":"https://thenewsglory.com/ind-vs-zim-3rd-odi-zimbabwe-fought-till-the-end-india-won-the-series-3-0/","keywords":["Sports","Cricket","game","India","Sikandar Raza","Zimbabwe"],"creator":["The News Glory"],"video_url":null,"description":"Harare: Zimbabwe fought till the end to beat India in the third and final ODI. Sikandar Raza was the batsman of that team. However, the team that was close to the victory line could not cross it. So India won the match by 13 runs. The Indian cricket team led by KL Rahul toured Zimbabwe […]","content":"Harare: Zimbabwe fought till the end to beat India in the third and final ODI. Sikandar Raza was the batsman of that team. However, the team that was close to the victory line could not cross it. So India won the match by 13 runs. The Indian cricket team led by KL Rahul toured Zimbabwe and played a three-match ODI series. India won the first two matches of the series and won the series by 2-0. In this case, the third match was held today (August 22) at the Harare Cricket Ground. Batting first in this match, the Indian team scored 289 runs at the end of 50 overs. Zimbabwe chased down the target of 290 runs. Innocent Gaya got out for 6 runs. However Sean Williams steadied the innings. He put on a partnership of 34 runs with Kaitano and 41 runs with Munyonga. However, he lost his wicket for 45 runs. Sikandar Raza, who came in to bat next, took care of the task he left behind. One side lost wickets at regular intervals to Zimbabwe. Raza then put on a 104-run partnership with Brad Evans for the eighth wicket. He scored a century in 88 balls. Then Evans got out after scoring 28 runs. Raza was out after scoring 115 runs. In 49.3 overs, the team lost all wickets and scored just 276 runs. By this the Indian team has won. Earlier, the Indian team won the toss and elected to bat in this match. Captain KL Rahul and Shikhar Dhawan entered the field as openers. Both added 63 runs for the first wicket. Rahul was out for 30 runs. Dhawan also lost his wicket after scoring 40 runs. Gill and Ishan Kishan then put on a partnership of 140 runs. It turned out to be a very important partnership for the Indian team. Kishan got out after scoring 50 runs. Hooda also returned to the pavilion as fast as he had come. Playing responsibly at the other end, Gill scored his maiden ODI century. He was not out until the first ball of the final over. He had scored 130 runs off 97 balls. It included 15 fours and 1 six. Players like Sanju Samson, Axar Patel, Thakur lost their wickets very soon. At the end of 50 overs, the Indian team scored 289 runs for the loss of 8 wickets. Brad Evans bowled well for Zimbabwe. He bowled 10 overs and took 5 wickets.","pubDate":"2022-08-22 16:40:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan, New Zealand boost World Cup qualification hopes","link":"https://www.business-standard.com/article/sports/pakistan-new-zealand-boost-world-cup-qualification-hopes-122082200377_1.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan and New Zealand strengthened their chances of direct qualification for the ICC Men's Cricket World Cup 2023 on Sunday, but the West Indies will have to rely on other results.","content":null,"pubDate":"2022-08-22 16:35:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220822/thumb-122082200377.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights Ind vs Zim 3rd ODI Score & Updates: KL Rahul and Co Whitewash Zimbabwe 3-0 - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LmluZGlhLmNvbS9zcG9ydHMvaGlnaGxpZ2h0cy1pbmQtdnMtemltLTNyZC1vZGktc2NvcmUtdXBkYXRlcy1rbC1yYWh1bC1hbmQtY28td2hpdGV3YXNoLXppbWJhYndlLTMtMC01NTg2MzA5L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights Ind vs Zim 3rd ODI Score & Updates: KL Rahul and Co Whitewash Zimbabwe 3-0  India.comHighlights India vs Zimbabwe 3rd ODI, Harare: IND Beat ZIM By 13 Runs To Complete Clean Sweep After Sikandar  Cricket Country NewsIndia News Live Updates: India beats Zimbabwe by 13 runs in the 3rd ODI, win the 3-match series 3-0  Economic TimesRecent Match Report - India vs Zimbabwe 3rd ODI 2022  ESPNcricinfoIndia vs Zimbabwe 2022 Highlights, 3rd ODI: IND Hold on For a 13-run Win And Complete 3-0 Series Sweep  News18View Full coverage on Google News","content":null,"pubDate":"2022-08-22 16:14:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"3rd ODI: India survive Sikandar Raza scare to win by 13 runs, secure 3-0 series sweep","link":"https://telanganatoday.com/3rd-odi-india-survive-sikandar-raza-scare-to-win-by-13-runs-secure-3-0-series-sweep","keywords":["News","Sport","India","Shubman Gill","Sikandar Raza","Zimbabwe"],"creator":["IANS"],"video_url":null,"description":"Harare: All-rounder Sikandar Raza fought hard with his incredible sixth ODI century but India survived the scare to win the third and final ODI by 13 runs and complete a 3-0 series sweep of Zimbabwe. After Shubman Gill’s top-class 130 took India to 289-8, Zimbabwe were down and out in the run chase at 169-7. […]","content":"Harare: All-rounder Sikandar Raza fought hard with his incredible sixth ODI century but India survived the scare to win the third and final ODI by 13 runs and complete a 3-0 series sweep of Zimbabwe. After Shubman Gill’s top-class 130 took India to 289-8, Zimbabwe were down and out in the run chase at 169-7. In came Raza and he slammed 115 off 95 balls, including nine fours and three sixes, to bring Zimbabwe to the verge of a huge victory. He also shared a 104-run partnership off 79 balls with Brad Evans (28), who had earlier taken his maiden five-for in ODI cricket (5-54) as a boisterous home crowd cheered them on. With 33 needed off the last three overs, India took out the last three wickets, including Evans and Raza in successive overs to complete a narrow victory as Zimbabwe just fell short of crossing the line. For the visitors, Avesh Khan took 3-66 while Kuldeep Yadav, Axar Patel and Deepak Chahar took two wickets each and Shardul Thakur had a scalp against his name. Chahar got India the first breakthrough by trapping Innocent Kaia lbw after getting to change the decision on review. Takudzwanashe Kaitano and Sean Williams slammed fours off Chahar and Avesh. But immediately after getting a top-edge for six off Avesh, Kaitano walked off the field due to a left leg issue. Williams, the senior pro, and Tony Munyonga stitched a stand of 46 runs for the second wicket to get Zimbabwe on track. While Williams feasted on the pace from Chahar and Thakur, Munyonga lofted down the ground and steered late through the third man to hit consecutive fours off Deepak Hooda’s lone over. After hitting another four off Thakur, Williams was trapped lbw off a ball from Patel which was quick on stumps and kept low, departing for 45. In the next over, Munyonga miscued to mid-off off Avesh as Zimbabwe lost two wickets in as many balls. The two wickets in two overs incident repeated when Patel took a sharp catch off his own bowling to dismiss captain Regis Chakabva while Kaitano was stumped easily off Kuldeep Yadav. At the end of the 33rd over, when Ryan Burl fell after heaving straight to mid-on off Chahar, Zimbabwe needed 141 runs off 17 overs. From the other end, Raza took his time to settle in before taking two fours off Patel. He had luck on his side, surviving an lbw appeal and later on, a stumping chance off Kuldeep. Raza welcomed Chahar into the attack by smacking him over deep mid-wicket for a huge six. From there, he relied on strike rotation till getting three fours, including on a no-ball and free-hit, to take 20 runs off Thakur in the 39th over. He then hammered crisp fours off Avesh and dispatched Chahar for a flat inside-out six over extra-cover. With a single through cover off Thakur, Raza got his third century in the last six matches to keep Zimbabwe alive in the run-chase. He went on to take Avesh for four and six more as a famous victory loomed for Zimbabwe. Avesh made a comeback by trapping Evans lbw with a slower ball. In the next over, Thakur delivered the killer punch by having Raza caught for 115, as Gill timed his forward dive at long-on to perfection for completing a low catch. Avesh then sealed the win for India with a yorker to rattle Nyauchi’s stumps. Brief scores: India 289-8 in 50 overs (Shubman Gill 130, Ishan Kishan 50; Brad Evans 5-54, Victory Nyauchi 1-48) beat Zimbabwe 276 all out in 49.3 overs (Sikandar Raza 115, Sean Williams 45; Avesh Khan 3-66, Axar Patel 2-30) by 13 runs","pubDate":"2022-08-22 16:14:00","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"“This one is for my dad”: Shubman Gill dedicates IND vs ZIM Man of the Series award to father Lakhwinder Singh","link":"https://thesportsrush.com/cricket-news-this-one-is-for-my-dad-shubman-gill-dedicates-ind-vs-zim-man-of-the-series-award-to-father-lakhwinder-singh/","keywords":["Cricket","India","India tour of Zimbabwe 2022","Shubman Gill","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs ZIM Man of the Series: The Indian batter has won his second consecutive series award in international cricket. A cliffhanger third ODI between India and Zimbabwe in Harare has resulted in India registering a 13-run victory. Holding their nerves in tense situations, the visitors have managed to whitewash the hosts 3-0 in this… The post “This one is for my dad”: Shubman Gill dedicates IND vs ZIM Man of the Series award to father Lakhwinder Singh appeared first on The SportsRush.","content":"IND vs ZIM Man of the Series: The Indian batter has won his second consecutive series award in international cricket. A cliffhanger third ODI between India and Zimbabwe in Harare has resulted in India registering a 13-run victory. Holding their nerves in tense situations, the visitors have managed to whitewash the hosts 3-0 in this series. India’s seventh consecutive bilateral ODI series victory against Zimbabwe means that they haven’t lost a bilateral series against them since 1997. In what remains Zimbabwe’s solitary series win against India, India have now won a total of nine series against this opposition. Captain KL Rahul, who hadn’t won a match as captain before this tour, has won three in a row to also put on display a thumping series victory at the Harare Sports Club. IND vs ZIM Man of the Series Having won the Player of the Match award for scoring his maiden ODI century today, India batter Shubman Gill also bagged the Player of the Series award for being the highest run-scorer across three matches. Readers must note that Gill’s 245 runs have come at an average and strike rate of 122.50 and 120.68 respectively in this series. It is noteworthy that Gill had also won the series award during the tour of West Indies last month. Special feeling. Going to cherish this one pic.twitter.com/AjWPq8RZwn — Shubman Gill (@ShubmanGill) August 22, 2022 From not playing a List A match in over 18 months before the West Indies tour to winning two series awards within a month, Gill has displayed staggering progress in this format. The 22-year old player dedicated his series award to father Lakhwinder Singh who has had a major role in shaping his career. “This one is for my dad as he has been my primary coach. I got a bit of schooling day before yesterday when I was out on 33 [in the second ODI]. So, this is for him,” Gill told the host broadcaster during the post-match presentation ceremony. The post “This one is for my dad”: Shubman Gill dedicates IND vs ZIM Man of the Series award to father Lakhwinder Singh appeared first on The SportsRush.","pubDate":"2022-08-22 16:13:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket - Gill&#039;s maiden ton propels India to ODI series clean sweep","link":"https://www.thestar.com.my/sport/cricket/2022/08/22/cricket---gill039s-maiden-ton-propels-india-to-odi-series-clean-sweep","keywords":null,"creator":null,"video_url":null,"description":"HARARE (Reuters) - Shubman Gill struck a maiden One Day International century to steer India to a nervy 13-run victory over hosts Zimbabwe on Monday and complete a clean sweep of their three-match series at the Harare Sports Club. Read full story","content":"HARARE (Reuters) - Shubman Gill struck a maiden One Day International century to steer India to a nervy 13-run victory over hosts Zimbabwe on Monday and complete a clean sweep of their three-match series at the Harare Sports Club. Gill hammered 130 runs off 97 balls as India recovered from a slow start to score an imposing 289 for eight after winning the toss and electing to bat first, before bowling Zimbabwe out for 276 in the last over of the home side's innings. Zimbabwe were in the hunt all the way thanks to Sikandar Raza’s sixth ODI century as he scored 115 from 95 balls, but when he fell in the penultimate over, their chances of a first victory over India since 2010 faded. It was the closest outcome of the series after India won by 10 wickets in the opening clash on Thursday, followed by a five-wicket triumph with 146 balls remaining in Saturday’s second game. Gill showed expert timing as he drove the home attack to all corners and quickly lifted the run rate after India were 84-2 in the 21st over. He put on a 140-run partnership for the second wicket with Ishan Kishan, who scored 50, but after that watched a succession of partners depart cheaply as Brad Evans completed his first five-wicket haul in international cricket with figures of 5-54 in his 10 overs. Zimbabwe’s Sean Williams showed aggressive intent in the home’s team reply, scoring 45 runs off 46 balls, but at 169-7 they looked out of the contest. That was until Raza and Evans (28) put on 104 for the eighth wicket to drag them back into it, but when they were out within five balls of each other with the victory line in sight, India were able to grab the win. Seamer Avesh Khan, playing his second ODI, took the last wicket and was the pick of the visitors’ attack with 3-66. (Reporting by Nick Said; Editing by Matthew Lewis)","pubDate":"2022-08-22 15:54:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/22/1707425.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Shivam Dube reveals how MS Dhoni helped him improve his cricket, says THIS","link":"https://zeenews.india.com/cricket/shivam-dube-reveals-how-ms-dhoni-helped-him-improve-his-cricket-says-this-2500361.html","keywords":null,"creator":null,"video_url":null,"description":"During the IPL mega auction in February this year, Dube was bought by the Super Kings for Rs 4 crore. The 29-year-old cricketer had a mixed outing in the tournament.","content":null,"pubDate":"2022-08-22 15:51:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe Man of the Match: Who won Man of the Match today in IND vs ZIM 3rd ODI in Harare?","link":"https://thesportsrush.com/cricket-news-india-vs-zimbabwe-man-of-the-match-who-won-man-of-the-match-today-in-ind-vs-zim-3rd-odi-in-harare/","keywords":["Cricket","India","India tour of Zimbabwe 2022","Shubman Gill","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Zimbabwe Man of the Match: The Indian batter won the match award for the second time in international cricket. During the third ODI of India’s tour of Zimbabwe 2022 in Harare, India beat Zimbabwe by 13 runs post a nervous finish. A match which could’ve won by either of the two teams was… The post India vs Zimbabwe Man of the Match: Who won Man of the Match today in IND vs ZIM 3rd ODI in Harare? appeared first on The SportsRush.","content":"India vs Zimbabwe Man of the Match: The Indian batter won the match award for the second time in international cricket. During the third ODI of India’s tour of Zimbabwe 2022 in Harare, India beat Zimbabwe by 13 runs post a nervous finish. A match which could’ve won by either of the two teams was won by the visitors as they managed to keep their nerves when it mattered the most. Chasing a 290-run target, Zimbabwe were reduced to 169/7 in the 36th over. With another quick finish on the cards, Zimbabwe all-rounder Sikandar Raza (115) and pacer Brad Evans (28) turned the tables by joining hands for a 73-ball 104-run eighth wicket partnership. Raza, who hit nine fours and three sixes at a strike rate of 121.05, scored his sixth ODI century, fifth at home, fourth at No. 5, third this month and first against India. However, a mind-blowing knock couldn’t steer Zimbabwe to victory as India pacer Shardul Thakur dismissed Raza in the penultimate over to continue his knack of picking wickets at crucial times. A job well done. Congratulations team India on the clinical series win 👏🏽 🇮🇳 Also @SRazaB24 is a special player, gave the passionate Harare crowd lots to cheer @ZimCricketv 👌🏽🇿🇼 #ZIMvIND pic.twitter.com/3AXaxoLzc1 — Wasim Jaffer (@WasimJaffer14) August 22, 2022 Other than Thakur, spinners Axar Patel and Kuldeep Yadav and fast bowler Deepak Chahar picked a couple of wickets at each. However, it was Avesh Khan who emerged as the pick of the Indian bowlers with figures of 9.3-1-66-3. Captain KL Rahul winning the toss and opting to bat first had resulted in India scoring 289/8 in 50 overs earlier in the day. A comparatively slower 63-run opening partnership between vice-captain Shikhar Dhawan (40) and Rahul (30) wasn’t an ideal start for the visitors but Shubman Gill (130) and Ishan Kishan (50) put together a match-winning 127-ball 140-run third-wicket partnership. Coming in to bat at No. 3 in the 16th over, Gill scored his maiden international century comprising of 15 fours and a six at a strike rate of 134.02. As a result, the 22-year old player was awarded with the Player of the Match award for the second time at the highest level. “I was just trying to minimize my dot-ball percentage. I just tried to time the ball and not hit it hard. The bat was pretty good and that’s why I changed it after my fifty as I wanted to save it. Always special to get a hundred, I had made three nineties but wanted to get a century,” Gill told the host broadcaster during the post-match presentation ceremony.","pubDate":"2022-08-22 15:43:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket Association of Bengal to help cricket development in China","link":"https://sportstar.thehindu.com/cricket/cricket-association-of-bengal-help-china-cricket-development-chongqing-city-kolkata/article65798627.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"The Chinese delegation has sought cooperation to improve the game in Chongqing City - one of four municipalities which are under direct administration by the central Chinese government.","content":"The Cricket Association of Bengal (CAB) on Monday received a proposal from the Chinese Consul General for supporting cricket development in China. A three-member Chinese delegation led by Zha Liyou, Consul General, the People's Republic of China in Kolkata, met CAB President Avishek Dalmiya with a proposal to establish cricketing relations with the association. The delegation has sought cooperation to improve the game in Chongqing City - one of four municipalities which are under direct administration by the central Chinese government. \"We have assured our cooperation as we believe in the philosophy of spreading cricket globally and it is encouraging to see China taking the initiative to play the game,\" said Dalmiya. The delegation has proposed to sign an MOU with CAB which will enable them to send players to Kolkata for training and friendly matches. Read more stories on Cricket.","pubDate":"2022-08-22 15:34:12","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Baichung Bhutia, CoA favours reforms, Praful Patel says no interest in holding post in AIFF","link":"https://www.hindustantimes.com/sports/football/baichung-bhutia-coa-favours-reforms-praful-patel-says-no-interest-in-holding-post-in-aiff-101661180785824.html","keywords":null,"creator":null,"video_url":null,"description":"The Centre told the top court that Bhutia is a legend in football like Tendulkar or Gavaskar is in cricket and it is considering a bigger role for him and the government would request him that what he is aiming for in AIFF (post of President) may not be appropriate to his stature.","content":null,"pubDate":"2022-08-22 15:14:21","image_url":"https://images.hindustantimes.com/img/2022/08/22/1600x900/7fb810ba-21c4-11ed-95b4-abd850c77aa6_1661181055635_1661181055635_1661181066305_1661181066305.jpg","source_id":"hindustantimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Phoebe Graham's The Hundred blog I 'Time for the Originals' luck to turn'","link":"https://www.skysports.com/cricket/news/12040/12679202/phoebe-grahams-the-hundred-blog-manchester-originals-star-reflects-on-superchargers-loss-and-busy-schedule","keywords":null,"creator":null,"video_url":null,"description":"I need a minute to catch my breath. We have had four games in eight days. Two at Emirates Old Trafford, a trip down to Southampton and then straight to Leeds. It's been a whirlwind week of travel, highs, lows and despite playing some unbelievable cricket, we have been on the wrong end of the results.","content":null,"pubDate":"2022-08-22 14:20:00","image_url":"https://e2.365dm.com/22/08/1920x1080/skysports-phoebe-graham-the-hundred_5859237.jpg?20220809105903","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 | Head coach Russell Domingo won't be part of T20 set-up: Bangladesh Cricket Board President","link":"https://www.indiatoday.in/sports/cricket/story/asia-cup-2022-head-coach-russell-domingo-won-t-be-part-of-t20-set-up-bangladesh-cricket-board-president-1991202-2022-08-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh to head into Asia Cup without head coach Russell Domingo","content":null,"pubDate":"2022-08-22 14:16:59","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Who are Man Utd and Tampa Bay Buccaneers owners the Glazer family?","link":"https://www.thesun.ie/sport/football/4661941/man-utd-owners-glazer-family/","keywords":["Football","Sport","Explainers","NFL"],"creator":["Jim Sheridan"],"video_url":null,"description":null,"content":"THE Glazer family own two of the most coveted prizes in world sport - Manchester United and the Tampa Bay Buccaneers. United are one of the biggest money makers in world football, but the Glazers' leveraged takeover of the club has been mired on controversy - mainly because they bought the club with borrowed money then leveraged it against the team. The Buccaneers - owned by the Glazer family - thumped the Kansas City Chiefs 31-9 to win the Super Bowl on February 7, 2021. Tom Brady threw three touchdowns, giving the evergreen 43-year-old quarterback a record-extending seventh championship ring. The only team to play a Super Bowl on their home field, the Buccaneers made the most of the opportunity as they were crowned champions for the first time since January, 2003. They beat the Kansas City Chiefs 31-9. Co-owner Joel Glazer accepted the Vince Lombardi Trophy as confetti showered the on-field stage. The Glazer family has owned the Tampa Bay Buccaneers since 1995, when American tycoon Malcolm Glazer paid a then-record $192million for the franchise. He also acquired Manchester United as he looked to expand his business empire on both sides of the Atlantic. Glazer acquired ownership of United in a £790m takeover by gradually buying out shareholders between 2003 and 2005. He had a net worth of £3.19bn when he died in 2014. The family's ownership of United has been a point of controversy for almost two decades. Ever since the American family took charge of the Red Devils there have been fan protests , with many supporters fearing that the club has moved away from its traditional local values. Despite a public offering of United on the New York Stock Exchange in 2012, the Glazers remain in control approaching the 16th anniversary of their takeover. After the success of the Buccaneers, United is mounting its best title challenge since winning its record 20th English league trophy in 2013. Here's a profile of the Glazer family and their various business ventures: Known as Avie, the eldest child of Malcolm and Linda Glazer has been co-chairman of United, with brother Joel, since 2005. His earlier business career included being chairman and chief executive of the Zapata Corporation, which was founded by George W Bush. He is co-owner of The Tampa Bay Buccaneers with his siblings but is not listed as a chairman. In December 2021, Glazer purchased a franchise from the brand-new T20 league in the United Arab Emirates. \"I am very excited to be a part of UAE T20 at its formation. UAE T20 promises to be a world-class event that will be transformative to the growth of cricket in the Emirates,\" he said. The UAE T20 league is a six-team competition and will run for the first time between February and March 2022. As well as his involvement with United, Joel is co-chairman, with brothers Bryan and Edward, of the Tampa Bay Buccaneers, the NFL franchise the family bought in 1995. The Buccaneers website states he oversees the day-to-day operations of the franchise. Under their tenure, the Buccaneers won their first Super Bowl in 2003 and opened a new stadium where home team touchdowns are marked by cannons firing from a 103-foot replica pirate ship. The team also won in 2021 on their home field against the Kansas City Chiefs. Bryan is co-chairman and a former Zapata executive. He takes control of a lot of the day-to-day running of the NFL team and had a big role in the design and construction of the Raymond James Stadium. The team's website states he is \"working tirelessly to support the Buccaneers franchise and brand\". In 2015, he made a $4million contribution to setting up the Bryan Glazer Jewish Community Center in Tampa. Kevin is co-chairman of First Allied Corporation, the real estate company which is the foundation of the family’s fortune. He is also the director of a banking firm, a commercial refrigeration business and the Houlihan’s restaurant chain. Darcie is the executive vice-present of First Allied Corporation. She is co-president and main driving force of the Glazer Family Foundation which established a Children’s Museum in Tampa and does a lot of philanthropic work in the city, much of it linked to the Bucs. The team's website states she is the \"driving force behind many of the Tampa Bay Buccaneers' innovative, forward-thinking fan engagement and community outreach initiatives, retail activation, and facility design\". Edward is the co-president of the Glazer Family Foundation. The Glazers are known as supporters of Donald Trump, but although Ed hosted a fundraiser for Trump and donated $250,000 to his inaugural committee, but also gave $5,400 to Hillary Clinton’s 2016 presidential campaign. He cashed in £30m of United shares in December 2014, barely six months after his father Malcolm’s death. He is owner and co-chairman of the Buccaneers.","pubDate":"2022-08-22 13:43:54","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"WEF vs SOB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- The Hundred - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMingFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3dlZi12cy1zb2ItZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLWRyZWFtMTEtdGVhbS1wbGF5aW5nLXhpLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlLXRoZS1odW5kcmVkL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"WEF vs SOB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- The Hundred  Cricket AddictorWEF vs SOB Dream11 Team Prediction: Welsh Fire vs Southern Brave Check Captain, Vice-Captain, and Probable  News18WEF vs SOB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for Men's Hundred 2022, Match 22  SportskeedaThe Hundred Tips Game 19: Fire can turn up the heat on Brave  Betting.betfairWEF-W vs SOB-W Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- The Hundred Women  Cricket Addictor","content":null,"pubDate":"2022-08-22 13:29:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England's Barmy Army shares video of little boy's bowling skills; internet impressed","link":"https://www.firstpost.com/firstcricket/sports-news/englands-barmy-army-shares-video-of-little-boys-bowling-skills-internet-impressed-11095231.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"England's Barmy Army shares video of little boy's bowling skills; internet impressed","content":"England’s Barmy Army has long been famous for their enthusiastic posts regarding their cricket team. However, their recent video is sure to give you a boost of serotonin. The footage shared by the Barmy Army will leave you nostalgic about your childhood, especially if you played gully cricket. The clip praises the bowling skills of a young boy. The clip shows the boy bowling to a statue. The statue, which has a bat in its hand, is placed on the street in such a way that it looks like it is batting.In the video, the boy throws the ball at the statue. The delivery bounces off the bat and goes straight into the hands of a man standing in as the fielder. The video ends as the little one celebrates his ‘wicket’.England’s Barmy Army shared the video with the caption, “No footwork…” followed by a laughing emoji. The clip has garnered over 600,000 views. Watch:No footwork… pic.twitter.com/slk6PUWPwl— England's Barmy Army (@TheBarmyArmy) August 20, 2022Several users posted hilarious responses on the video, with many taking a dig at England’s current batting order.Like Every English batsman now — Vikram karuppusamy (@naan_karuppu) August 20, 2022Others praised the kid’s bowling skills.Well bowled young’n.— WG RumblePants (@WG_RumblePants) August 20, 2022Some stated that they had seen many videos of kids bowling spin in England and wondered if the nation was going to produce “a generation of Shane Warnes”.Have to say I've seen a lot of Twitter videos of English kids bowling leg spin, and they seem to have great actions and get lots of turn. Are we quietly breeding a generation of Shane Warnes? Maybe its part of climate change mitigation because the Jimmy Andersons will be obsolete — Byronic Enigma (@ByronicEnigma) August 20, 2022 A few people implied that equal attention should be given to the great catch as well.Think people have seemed to have missed by (even tho it's a great bowl), that its caught at short leg too by hopefully a family member(probably dad)— Alan Morgan (@saladmate) August 20, 2022One user even remarked that the kid should be inducted into the Test team.That is a genius bit of bowling! And catching! How many times attempted before nailing the perfect delivery? Get him in the side now for the next test match! — Steve (@BearlyAwakeLion) August 20, 2022 England’s famed ‘bazball’ approach in Test cricket came under fire after the Ben Stokes-led unit lost to South Africa by an innings and 12 runs in the first game. The Three Lions put up a dismal performance with the bat in both innings, with only Ollie Pope going past 50 runs. The Proteas completely dominated the encounter, thanks to their fierce bowling attack. Kagiso Rabada and Anrich Nortje starred with the ball for the visitors.England will be looking to reverse their fortunes when the two teams face off for the second Test at Manchester’s Old Trafford. The match will be held from 25 August.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-22 13:27:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/barmy-army.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh sacks head coach Domingo of T20 role ahead of Asia Cup 2022","link":"https://sportstar.thehindu.com/cricket/bangladesh-sacks-russell-domingo-t20-head-coach-sridharan-sreeram-asia-cup-2022/article65797850.ece","keywords":null,"creator":["\n        AFP  \n    "],"video_url":null,"description":"Bangladesh Cricket Board president Nazmul Hassan said that former India cricketer Sridharan Sriram, named last week as the technical consultant, will look after the T20 side.","content":null,"pubDate":"2022-08-22 13:20:25","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}