{"newsArray":[{"title":"Ashes 2021-22 third Test, day two: Australia v England – live! - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMitQFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIxL2RlYy8yNy9hc2hlcy0yMDIxLTIyLWF1c3RyYWxpYS12cy1lbmdsYW5kLWRheS10d28tMi1jcmlja2V0LTNyZC10aGlyZC1ib3hpbmctZGF5LXRlc3QtbGl2ZS1zY29yZS1jYXJkLWF1cy12LWVuZy1zdGFydC10aW1lLWxhdGVzdC11cGRhdGVz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2021-22 third Test, day two: Australia v England – live!  The GuardianAshes Third Test day one: England bowled out for 185  Evening StandardDeja vu again as England's collapse puts Australia in complete control  The Irish TimesPat Cummins toasts strong start for Australia – Boxing Day sporting social  Glasgow TimesEngland cricket capitulations have gone from car-crash to commonplace  The GuardianView Full coverage on Google News","content":null,"pubDate":"2021-12-26 23:43:20","image_url":null,"source_id":"google"},{"title":"Australia vs England, 3rd Test, The Ashes, 2021-22 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiVWh0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1jb21tZW50YXJ5LzM2MzM3L2F1cy12cy1lbmctM3JkLXRlc3QtdGhlLWFzaGVzLTIwMjEtMjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Australia vs England, 3rd Test, The Ashes, 2021-22  CricbuzzThe Ashes 3rd Test, Day 1: When do England lose their Test status? | #PoliteEnquiries | ESPNcricinfo  ESPN UKAshes, Australia vs England, Boxing Day Test Test Day 2: Live Cricket Score and Updates from Adelaide  India TodayAshes 2021-22: England Rue Losing Toss After Another Batting Collapse  News18Ashes 2021-22, 3rd Test, Day 2, Australia vs England Live Score Updates  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-26 22:59:02","image_url":null,"source_id":"google"},{"title":"Cricket-England cleared to resume third test after COVID scare","link":"https://www.thestar.com.my/sport/cricket/2021/12/27/cricket-england-waiting-on-covid-test-results-after-positive-case-in-family","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) -England's cricket team were cleared to play day two of the third Ashes test in Melbourne after getting COVID-19 tests in the wake of a team family member testing positive. Read full story","content":null,"pubDate":"2021-12-26 22:59:00","full_description":"MELBOURNE (Reuters) -England's cricket team were cleared to play day two of the third Ashes test in Melbourne after getting COVID-19 tests in the wake of a team family member testing positive. Just over an hour before the 10:30 a.m. local time (2330 GMT) start of play at the Melbourne Cricket Ground, the team issued a statement saying players and management were waiting for test results at the hotel. Some 20 minutes later, the team were given the green light to head to the MCG. \"The England team have been given the all clear to travel to the MCG and we are about to set off from the team hotel,\" the team said in a statement. Australia will resume on 61 for one in reply to England's first innings 185. It was unclear whether the start would be delayed. Australia lead the series 2-0 and can retain the Ashes with a draw in Melbourne. Australia captain Pat Cummins was forced to miss the second test in Adelaide and isolate for a week after being identified as a close contact of a COVID-19 case. Australian authorities are battling a surge in COVID-19 cases driven by the Omicron variant. (Reporting by Ian Ransom; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/27/1421190.jpg","source_id":"thestar_my"},{"title":"English cricket team COVID scare delays day two of MCG Ashes Test after family member tests positive - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiaWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIxLTEyLTI3L2VuZ2xpc2gtY3JpY2tldC10ZWFtLWlzb2xhdGluZy1hZnRlci1wb3NpdGl2ZS1jb3ZpZC10ZXN0LzEwMDcyNjYxNNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"English cricket team COVID scare delays day two of MCG Ashes Test after family member tests positive  ABC NewsFresh Covid crisis rocks Boxing Day Test  NEWS.com.auReturn of heaven-sent Cummins is perfect late gift for Australia’s attack  The GuardianEngland get all clear after family case  Port Macquarie NewsCrisis averted: England resume Test after positive COVID case in family group  Sydney Morning HeraldView Full coverage on Google News","content":null,"pubDate":"2021-12-26 22:52:23","image_url":null,"source_id":"google"},{"title":"Covid scare rocks the England cricket team after positive test during third Ashes test - Daily Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9zcG9ydC9jcmlja2V0L2FydGljbGUtMTAzNDYyMjUvQ292aWQtc2NhcmUtcm9ja3MtRW5nbGFuZC1jcmlja2V0LXRlYW0tcG9zaXRpdmUtdGVzdC1Bc2hlcy10ZXN0Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Covid scare rocks the England cricket team after positive test during third Ashes test  Daily MailThe Ashes: England team await results of Covid tests after member of family group tests positive  Sky SportsReturn of heaven-sent Cummins is perfect late gift for Australia’s attack  The GuardianEngland cricket team kept in hotel awaiting Covid results after positive test  The MirrorThe Ashes: Third Test to continue after England Covid scare  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-26 22:38:12","image_url":null,"source_id":"google"},{"title":"Ashes 2021-22 third Test, day two: Australia v England – live!","link":"https://www.theguardian.com/sport/live/2021/dec/27/ashes-2021-22-australia-vs-england-day-two-2-cricket-3rd-third-boxing-day-test-live-score-card-aus-v-eng-start-time-latest-updates","keywords":["The Ashes","Ashes 2021-22","Cricket","Australia cricket team","England cricket team","Australia sport","Sport","Over by over reports"],"creator":["Jonathan Howcroft (now) and Tanya Aldred (later)"],"video_url":null,"description":"Start time for the Boxing Day Test is 10:30am local, 11:30pm GMTThe Spin: subscribe to our weekly cricket newsletterAny thoughts? Email or tweet @JPHowcroftSo, Channel 7 has just come on air in Australia and the frontline broadcasters (Ponting, Botham etc) are off having PCR tests. They have been replaced by the crew normally on BBL duty - Alister Nicholson, Brad Hodge, and Lisa Sthalekar.Further, the ECB has just released the following statement about a touring family member also testing positive. Once again the precarious nature of this series reveals itself. Continue reading...","content":null,"pubDate":"2021-12-26 22:36:23","full_description":"Latest: England players have passed their lateral flow tests and are heading to the MCG There may still be a delay to the scheduled 10.30am start, but we’re on course for action. While we wait for more news to filter through about if and when England take the field, let’s recap yesterday’s action, starting with Ali Martin’s report from the close of play. Shortly after tea on the opening day at the MCG – not even halfway through the series as a whole – the Barmy Army trumpeter could already be heard pootling the theme from the Great Escape. A rejigged England side featuring four changes were eight down during what became an eventual 185 all out in 65.1 overs. And that was a total swelled by Ollie Robinson, the No 9, throwing the bat to the tune of 22 runs. Things will look a little different today... #Ashes pic.twitter.com/zigGm1HjUJ So, Channel 7 has just come on air in Australia and the frontline broadcasters (Ponting, Botham etc) are off having PCR tests. They have been replaced by the crew normally on BBL duty - Alister Nicholson, Brad Hodge, and Lisa Sthalekar. Our @7Cricket Ashes broadcast will sound a little different this morning as most of us wait results of regulatory PCR tests, but no less good, in very capable hands! Such is the world we’re in… Stay safe all. Further, the ECB has just released the following statement about a touring family member also testing positive. Once again the precarious nature of this series reveals itself. The England team and management are currently at the team hotel awaiting results of RFT COVID tests following a positive test in the team’s family group. We will provide more information in due course. Some early reports coming through on Channel 7, the host broadcaster, that the MCG press box has a confirmed case of Covid-19. I’ll bring you more as it comes, but it wouldn’t surprise me if there was some disruption to how this match is broadcast. Hello everybody and welcome to live over-by-over coverage of day two of the Boxing Day Ashes Test. We’re underway at the Melbourne Cricket Ground at 10.30am local time (11.30pm UK). History doesn’t repeat, but it often rhymes, or so the saying goes. If that’s the case, then England’s Ashes series is turning into something from the Dr Seuss canon. On day one at the MCG all the familiar failings materialised. Both openers fell cheaply, set batters got out to poor shots, no pressure was applied to Australia’s attack, and (although this is minor in comparison) England’s one true hope, Joe Root, could not convert a half-century into a Test-defining score. There was plenty of noise after Adelaide that England had talked frankly about their performances. This set the tone for the topic of conversation throughout a miserable day’s play: that of England not backing up their words with deeds. I think we’ve all been willingly, or unwittingly, overthinking things. Put simply, England are not very good. They are especially not very good in Australian conditions. They are very extremely especially not very good in Australian conditions against a well-drilled bowling attack, led by the magnificent Pat Cummins. What happened yesterday was normal. Sometimes it’s that straightforward. From England’s perspective, the remainder of this series has to focus on how such a well-funded cricket board can deliver an outcome like this with such consistency. Something very significant is wrong that cannot be addressed by interrogating a heated dressing room debate or the angle of an opener’s blade. This Test is not over, yet, but England’s first-innings dismissal just 65.1 overs after the toss means it is moving on apace. The next two days promise the best batting conditions at the MCG. Further ignominy for the tourists awaits. I’ll be back with more shortly, but if you would like to join in, you can reach me by email or Twitter ( @JPHowcroft ).","image_url":"https://i.guim.co.uk/img/media/81bdc866be8a89f881c5bf9b9898e5a2030276bf/0_158_5472_3283/master/5472.jpg?width=460&quality=85&auto=format&fit=max&s=7054ceff2adc84e7ca190f74c6f296f9","source_id":"theguardian"},{"title":"\"He was caught up with the way to play Test cricket\" - Dinesh Karthik explains how KL Rahul transitioned into an improved Test opener","link":"https://www.sportskeeda.com/cricket/news-ind-vs-sa-2021-dinesh-karthik-explains-kl-rahul-transitioned-improved-test-opener?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Rudransh Khurana"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-26 19:34:05","full_description":"Cricketer and analyst Dinesh Karthik has explained the reasons behind Indian opener KL Rahul 's newfound success in red-ball cricket. Karthik said Rahul used to be too aggressive in domestic cricket which made his transition to Test level difficult. The wicketkeeper-batter asserted that Rahul has burnished his technique and temperament to suit the needs of the longest format and, after gaining some confidence, has become a much-improved player. Karthik's observations came in an interaction with Cricbuzz after Rahul led India's charge on Day 1 of the first Test against South Africa in pacy conditions in Centurion. The vice-captain notched a masterful, unbeaten 248-ball 122, becoming only the second Indian opener to score a century in the Rainbow nation. Karthik said: Karthik added: Despite being a sure starter in white-ball cricket, Rahul wasn't a big part of India's Test plans until the tour of England earlier this year. Both Shubman Gill and Mayank Agarwal were injured in that series, allowing Rahul a wildcard entry as an opener. He impressed one and all, with his rise culminating on Sunday. Rahul and Mayank (60 off 123) gave India a brilliant 117-run foundation, which the rest of the batters built upon to end the first day at 272-3. Karthik further expressed his delight at Rahul and Mayank's emergence from a \"musical chairs\" game and the glut of opening batters now available in Indian cricket. Karthik said: He added: If Rahul, alongside an ominous-looking Ajinkya Rahane (40 off 81), can get through the first hour of play against the new ball unblemished, India might be able to set a 500-plus first-innings total. Live-action will resume at 1:30 PM IST.","image_url":"https://static.sportskeeda.com/editor/2021/12/82a3c-16405434678254-1920.jpg","source_id":"sportskeeda"},{"title":"PK-U19 vs UAE-U19 Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for ACC U19 Asia Cup 2021 Group A Match","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/pakistan-u19-vs-united-arab-emirates-u19-dream11-prediction-acc-u19-asia-cup-2021?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-26 19:34:05","full_description":"Pakistan U19 will take on United Arab Emirates U19 in a Group A game of the ACC U19 Asia Cup 2021 at the ICC Academy Ground in Dubai on Monday. Pakistan U19 are sitting pretty at the top of the points table in Group A. They have won both their games thus far, so another win will ensure them a top-spot finish. Meanwhile, United Arab Emirates U19 have suffered massive losses in their two matches thus far. Abdul Wahid, Maaz Sadaqat, Muhammad Shehzad, Haseebullah (wk), Qasim Akram (c), Irfan Khan, Rizwan Mehmood, Ahmed Khan, Ali Asfand, Zeeshan Zameer, Awais Ali, Kai Smith, Aryansh Sharma (wk), Dhruv Parashar, Alishan Sharafu (c), Punya Mehra, Ali Naseer, Soorya Sathish, Nilansh Keswani, Aayan Afzal Khan, Adhitya Shetty, Sailles Jaishankar. Match: PK-U19 vs UAE-U19. Date & Time: December 27th 2021; 11 AM IST. Venue: ICC Academy Ground, Dubai. The pitch at the ICC Academy Ground in Dubai has been a good one to bat on. Afghanistan U19 defended 194, while India U19 racked up 282 batting first. Another good batting surface is likely to be in store for this game. Kai Smith has been the best batter for UAE U19 in this tournament, scoring 54 runs in two games. Alishan Sharafu hasn't fired with the bat yet, but he has picked up four wickets in the tournament. Ahmed Khan has had an impact with both bat and ball in the tournament. He has scored 29 runs while striking at 126.08. He has also taken three wickets. Zeeshan Zameer has been superb with the ball. The 19-year-old seamer has registered seven scalps at an average of 10.28. Zeeshan Zameer (PK-U19): 213 points. Ahmed Khan (PK-U19): 163 points. Alishan Sharafu (UAE-U19): 150 points. Awais Ali (PK-U19): 122 points. Nilansh Keswani (UAE-U19): 122 points. Zeeshan Zameer: 7 wickets. Ahmed Khan: 29 runs & 3 wickets. Awais Ali: 4 wickets. Alishan Sharafu: 16 runs & 4 wickets. Nilansh Keswani: 3 wickets. Fantasy Suggestion #1: Kai Smith, Alishan Sharafu, Muhammad Shehzad, Irfan Khan, Qasim Akram, Aayan Afzal Khan, Maaz Sadaqat, Ahmed Khan, Nilansh Keswani, Zeeshan Zameer, Awais Ali. Captain: Zeeshan Zameer. Vice-captain: Ahmed Khan. Fantasy Suggestion #2: Kai Smith, Alishan Sharafu, Muhammad Shehzad, Irfan Khan, Qasim Akram, Aayan Afzal Khan, Ahmed Khan, Nilansh Keswani, Zeeshan Zameer, Awais Ali, Sailles Jaishankar. Captain: Muhammad Shehzad. Vice-captain: Awais Ali.","image_url":"https://staticg.sportskeeda.com/editor/2021/12/0a2f7-16401945952545-1920.jpg","source_id":"sportskeeda"},{"title":"Critics lash 'out of depth' England once again","link":"https://wwos.nine.com.au/cricket/ashes-2021-mark-ramprakash-says-england-have-a-lack-of-depth-in-test-cricketing-stocks/4ebe57ff-31af-4117-80cb-5341fcadfc8e","keywords":null,"creator":["wwos"],"video_url":null,"description":"England legend Mark Ramprakash says his nation lacks a clear plan to cultivate the next generation of Test cricketing talent.","content":"In the wake of another horror Ashes day, England legend Mark Ramprakash says his nation lacks a clear plan in regards to cultivating the next generation of Test cricketing talent.\"England's thinking has clearly been muddled,\" he said on BT Sport's daily podcast, regarding the touring side's preparation between the 2019 Ashes and now.\"In a broader context, the vision, the lack of vision and strategy over this period in Test match cricket.\"ASHES BLOG: Root reaches dismal Australian record as Aussies roll onREAD MORE: Bowling gamble pays off for rampant AussiesREAD MORE: Key Englishmen blasted for 'utterly horrendous' battingThe 52-Test veteran noted that promising talents like Zak Crawley, Haseeb Hameed and Ollie Pope were the best options England had in terms of young talent, but didn't look the part right now.\"They're looking a little bit out their depth,\" he said, comparing the situation to the country's young but experienced crop of T20 players\"The England one-day team have an oversupply of players, we are searching in Test match cricket for players to come in and do a job,\" he said.journalist Jonathan Liew said England had \"forgotten how to win\", comparing the side to New Zealand in the '90s.\"Every new play that comes in is essentially trying to sure up failure - they're not coming in in a position of strength,\" he said.\"If you don't have a plan, and you don't have a formula, then you're essentially kind of adrift.\"Speaking to reporters after day one, English middle order batter Jonny Bairstow said his team was still searching for a big score but winning the toss could have made a difference.\"When you look at the toss as well, that obviously didn't go our way,\" he said.\"We'd have also looked to bowl in that first session.\"Bairstow said the team as a whole needed to be \"stronger and tougher\" with themselves in regards to their dismissals — his own, Ben Stokes' and Jos Buttler's were judged as particularly heinous by fans.\"It's one of those that they and we will look back on and reassess next time, and potentially take a different option,\" He said.Former Test captain Michael Atherton was less neutral, calling Buttler's dismissal \"egregious\".\"Lyon is a hard bowler to hit over the top with accuracy, because of the overspin he imparts — resulting in dip that makes it hard to get to the pitch of the ball — and no sooner had the shot been played, than Buttler hung his head in the knowledge of the outcome,\" he wrote in the The Times.\"Trying to hit over long-on, he succeeding (sic) only in dragging the ball to deep mid-wicket instead.\"It was yet another innings where Joe Root carried the fortunes of the team on his back almost entirely, the retired ex-skipper acknowledged.\"The similarities to the opening two Tests were readily apparent, with early wickets falling to the new ball, key wickets going at crucial moments in the overs immediately before lunch and tea and a vital one in second session to a build-up of immense pressure,\" Atherton said.\"Once again it was Root or bust, so when England's captain departed within the first hour after lunch for a perky half-century, but no more, the chances of a competitive score went with him.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-26 19:13:43","full_description":"In the wake of another horror Ashes day, England legend Mark Ramprakash says his nation lacks a clear plan in regards to cultivating the next generation of Test cricketing talent. \"England's thinking has clearly been muddled,\" he said on BT Sport's daily podcast, regarding the touring side's preparation between the 2019 Ashes and now. \"In a broader context, the vision, the lack of vision and strategy over this period in Test match cricket.\" ASHES BLOG: Root reaches dismal Australian record as Aussies roll on READ MORE: Bowling gamble pays off for rampant Aussies READ MORE: Key Englishmen blasted for 'utterly horrendous' batting The 52-Test veteran noted that promising talents like Zak Crawley, Haseeb Hameed and Ollie Pope were the best options England had in terms of young talent, but didn't look the part right now. \"They're looking a little bit out their depth,\" he said, comparing the situation to the country's young but experienced crop of T20 players \"The England one-day team have an oversupply of players, we are searching in Test match cricket for players to come in and do a job,\" he said. journalist Jonathan Liew said England had \"forgotten how to win\", comparing the side to New Zealand in the '90s. \"Every new play that comes in is essentially trying to sure up failure - they're not coming in in a position of strength,\" he said. \"If you don't have a plan, and you don't have a formula, then you're essentially kind of adrift.\" Speaking to reporters after day one, English middle order batter Jonny Bairstow said his team was still searching for a big score but winning the toss could have made a difference. \"When you look at the toss as well, that obviously didn't go our way,\" he said. \"We'd have also looked to bowl in that first session.\" Bairstow said the team as a whole needed to be \"stronger and tougher\" with themselves in regards to their dismissals — his own, Ben Stokes' and Jos Buttler's were judged as particularly heinous by fans. \"It's one of those that they and we will look back on and reassess next time, and potentially take a different option,\" He said. Former Test captain Michael Atherton was less neutral, calling Buttler's dismissal \"egregious\". \"Lyon is a hard bowler to hit over the top with accuracy, because of the overspin he imparts — resulting in dip that makes it hard to get to the pitch of the ball — and no sooner had the shot been played, than Buttler hung his head in the knowledge of the outcome,\" he wrote in the The Times . \"Trying to hit over long-on, he succeeding (sic) only in dragging the ball to deep mid-wicket instead.\" It was yet another innings where Joe Root carried the fortunes of the team on his back almost entirely, the retired ex-skipper acknowledged. \"The similarities to the opening two Tests were readily apparent, with early wickets falling to the new ball, key wickets going at crucial moments in the overs immediately before lunch and tea and a vital one in second session to a build-up of immense pressure,\" Atherton said. \"Once again it was Root or bust, so when England's captain departed within the first hour after lunch for a perky half-century, but no more, the chances of a competitive score went with him.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400676/raw-capture-sequence.00_03_38_05.still303.jpg","source_id":"nine"},{"title":"Ashes cricket 2021: Michael Vaughan’s Verdict, England vs Australia, problem, analysis, county system broken, reaction","link":"https://www.foxsports.com.au/cricket/countries/england/ashes-cricket-2021-michael-vaughans-verdict-england-vs-australia-problem-analysis-county-system-broken-reaction/news-story/9fb33bf64f9f9f95078d4474be44d894","keywords":null,"creator":null,"video_url":null,"description":"Michael Vaughan says England are making Australia look like world beaters and will continue to falter unless they overhaul their County system.","content":null,"pubDate":"2021-12-26 19:00:00","full_description":"Michael Vaughan says England are making Australia look like world beaters and will continue to falter unless they overhaul their County system. For the third time in five innings England failed to score more than 200. Crucially, too, for the second time in three Tests they failed to pass the 200 mark after batting first and thereby put the pressure on the opposition. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now Once again England were on the backfoot early after Haseed Hameed departed for his fourth duck in 10 innings since being recalled to face India in August. It was England’s 50th duck of the year. The early exit of recalled Zak Crawley for 12 left England reeling at 2-13. Neither player averages above 32 in first-class cricket and their Test averages are less than that marker. It is a situation that has become more than a trend but a pattern, with no England opener averaging more than 31 since Andrew Strauss and Alastair Cook formed a formidable duo at the top of the order. DRS makes Boland wait for his 1st wicket | 01:07 TALKING POINTS: Cummins gamble exposes Root flaw; Harris’ Test moment of truth arrives UK VIEW: England has ‘forgotten how to win’ and ‘doesn’t have the patience for Test cricket’ Vaughan, who helped inspire their drought-breaking Ashes success in his sole series as captain in 2005 and averaged 63.30 in his one series in Australia, believes fundamental changes in England must be made or risk continuing their great slide as a fallen Test powerhouse. “I keep saying it, until we do something about it in our own system nothing will change,” Vaughan told Foxsports.com.au . “You look at the last six years of debutant batters there’s not one player who has averaged over 31 in Test cricket. If it was happening for two or three players you’d just go, that’s a run of poor displays, but when you’ve got a list of names of 15 players over six years, it tells you there’s something not right with either the system we’ve got back home or the coaching hasn’t been good enough. “We’ve got to be open and honest, we haven’t produced a batter since Joe Root really. Why? English cricket has the finance, it has the materials to pretty much prepare anything ... so why is it that we’re not producing? Those averages of 31 and below, they’re not even near 35 or 40.” Vaughan has long advocated for a change in the Duke’s ball, which has often been regarded as a weapon but is now likely hurting their own chances, and says the seam must be sorted to help batsmen stay longer at the crease. Root IRATE after wasting ANOTHER start | 01:06 “I think that’s a key area that English cricket has to accept that many things in our system need to change,” Vaughan said. “I love County Cricket but I think County Cricket will be a lot better when it becomes a game that’s played with a ball that doesn’t do as much and it means that batters will go and get big scores and then it gets to a stage that batters are coming into Test cricket full of confidence because they’ve got double centuries in County Cricket consistently and then you’re giving them a better chance.” Vaughan, who averaged 41.44 and scored 18 centuries, says his former teammate Ashley Giles must address the problem as England’s director of cricket. “Ashley Giles is in charge of English cricket, the director, it’s not easy to change things in the game of cricket because there’s 18 Counties and I’m sure there’s lots of committees and votes, but I think fundamentally everyone in the game would love a ball that doesn’t do as much,” he said. “I don’t think it’s always the pitches, I think it’s just the ball and the conditions that we have in the UK and I think we need to play our four day cricket at better times unless we’re just giving up on the longer format of the game and saying it’s all about the white ball, and I hope that’s not the case.” Vaughan fears for England. Only once in the past three decades have England won a series in Australia, with their sole victory coming in 2010-11. Since then Australia has dominated England. He's back! Pat dominates 1st session | 01:18 Vaughan said it was vital England stuck together and showed more fight on the field, but feared Australia were being made to look better than the results are showing. “It’s very difficult. Somehow they’ve got to find that togetherness which is almost impossible to find when you’re getting hammered,” Vaughan said. “Individuals start to look inwardly at their own game, their own situations in the team. “It’s one of those scenarios where you just hope one individual does something ridiculous to get you back into a contest and that’ll be the difficulty for these players because they are tough cricketers, we’ve seen that, but they’re not competing. “Australia at the minute are looking an incredible team and I think they’re good but they’re not incredible. I think they’re a good Test match team but I think this England team are making them look incredible.” Vaughan urged Root to attack, believing the only way England could get back in the game is if they took wickets. 'This is what Vaughany doesn't like' | 00:24 “The one thing I’d say tactically when you’ve got a scenario when you’ve only got 185 on the board (they must attack),” he said. “Mark Wood comes into the attack and you’ve only got two slips and a gully and an orthodox field for Mark Wood, that can’t be right. Mark Wood can’t have the same field as Jimmy Anderson and Ollie Robinson, he just can’t. He’s a different type of bowler trying to create impact for four overs, so you’ve got to be aggressive with your fields, but these are just minor details, there’s a bigger issue with a team over a course of quite a while now against better teams.”","image_url":null,"source_id":"foxsports"},{"title":"Sreesanth set to play Ranji Trophy for Kerala, again","link":"https://www.thehansindia.com/sports/cricket/sreesanth-set-to-play-ranji-trophy-for-kerala-again-721760","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former India fast bowler S Sreesanth has been included in the 24-member preliminary squad of Kerala for the upcoming Ranji season.","content":" Former India fast bowler S Sreesanth Former India fast bowler S SreesanthNew Delhi: Former India fast bowler S Sreesanth has been included in the 24-member preliminary squad of Kerala for the upcoming Ranji season. The 38-year-old is making a return to red-ball cricket after a gap of nearly nine years. Sreesanth last played a first-class match in 2013 when he was featured in the Irani Cup for the Rest of India against Mumbai.After serving a seven-year suspension for his alleged involvement in the 2013 IPL spot-fixing scam, the veteran pacer was elated after getting a place in the preliminary squad for Kerala. Sreesanth shared the news on Twitter on Sunday, saying, \"Feels great to be back after 9 years playing Ranji trophy for my lovely state really grateful to each and every one of u, lots of love and respect.\" In 2013, Sreesanth was allegedly involved in the IPL spot-fixing scandal where he was arrested by Delhi Police along with Ajit Chandila and Ankit Chavan. Sreesanth was accused of spot-fixing during the seventh season of the IPL but he was relieved of all the charges due to lack of evidence and his ban was ended on September 13, 2020. Meanwhile, Sachin Baby will lead the Kerala side in Ranji Trophy this season while wicketkeeper-batter Vishnu Vinod will be Sachin's deputy. Sanju Samson had captained Kerala in the Syed Mushtaq Ali and Vijay Hazare Trophy one-day competition, but Kerala fell in the quarter-finals. Robin Uthappa, who is yet to regain his fitness, has not been included in the probable list. Varun Nayanar is the second stumper, while Mohammad Azharuddeen has been overlooked. The preliminary camp will be held in Wayanad from December 30. Kerala are included in Elite Group B along with Bengal, Vidarbha, Rajasthan, Haryana, and Tripura. (IANS)","pubDate":"2021-12-26 18:46:33","full_description":"Former India fast bowler S Sreesanth New Delhi : Former India fast bowler S Sreesanth has been included in the 24-member preliminary squad of Kerala for the upcoming Ranji season. The 38-year-old is making a return to red-ball cricket after a gap of nearly nine years. Sreesanth last played a first-class match in 2013 when he was featured in the Irani Cup for the Rest of India against Mumbai. After serving a seven-year suspension for his alleged involvement in the 2013 IPL spot-fixing scam, the veteran pacer was elated after getting a place in the preliminary squad for Kerala. Sreesanth shared the news on Twitter on Sunday, saying, \"Feels great to be back after 9 years playing Ranji trophy for my lovely state really grateful to each and every one of u, lots of love and respect.\" In 2013, Sreesanth was allegedly involved in the IPL spot-fixing scandal where he was arrested by Delhi Police along with Ajit Chandila and Ankit Chavan. Sreesanth was accused of spot-fixing during the seventh season of the IPL but he was relieved of all the charges due to lack of evidence and his ban was ended on September 13, 2020. Meanwhile, Sachin Baby will lead the Kerala side in Ranji Trophy this season while wicketkeeper-batter Vishnu Vinod will be Sachin's deputy. Sanju Samson had captained Kerala in the Syed Mushtaq Ali and Vijay Hazare Trophy one-day competition, but Kerala fell in the quarter-finals. Robin Uthappa, who is yet to regain his fitness, has not been included in the probable list. Varun Nayanar is the second stumper, while Mohammad Azharuddeen has been overlooked. The preliminary camp will be held in Wayanad from December 30. Kerala are included in Elite Group B along with Bengal, Vidarbha, Rajasthan, Haryana, and Tripura. (IANS)","image_url":"https://assets.thehansindia.com/h-upload/2021/12/26/500x300_1137858-srishanth.jpg","source_id":"thehansindia"},{"title":"Australia dominate England on Day 1 of third Ashes Test","link":"https://www.thehansindia.com/sports/cricket/australia-dominate-england-on-day-1-of-third-ashes-test-721758","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"England's earnest dressing-room discussions about improving shot selection failed to bear fruit on Sunday's opening day of the third Ashes cricket Test, as shambolic batting delivered a Boxing Day feast of wickets for Australia at Melbourne Cricket Ground.","content":"Melbourne: England's earnest dressing-room discussions about improving shot selection failed to bear fruit on Sunday's opening day of the third Ashes cricket Test, as shambolic batting delivered a Boxing Day feast of wickets for Australia at Melbourne Cricket Ground.England was bowled out for 185, before Australia reached 61-1 at stumps. Admittedly England, humiliated in a 275-run defeat in Adelaide, faced a tough task to bounce back on Sunday. Australia captain Pat Cummins won the toss and invited under-siege England to bat first on a green-tinged, seaming MCG pitch. England was 61-3 at lunch. By tea, the tourists were in serious trouble at 128-6, having lost the key wicket of skipper Joe Root for 50. England's resistance with the bat lasted just 65.1 overs. World No.1-ranked bowler Cummins (3-36), spinner Nathan Lyon (3-36) and left-arm quick Mitchell Starc (2-54) combined to keep the pressure on England's batters. A loose shot outside off stump by Root, a questionable cut by Ben Stokes, and a wild heave by Jos Buttler will attract heavy attention from England's press after another difficult day for the tourists, who trail two-nil in the five-match series. Cummins ripped through England's top order. The skipper took three wickets in the opening session after winning the toss and bowling. Rain delayed the start of play for 30 minutes before Cummins removed Haseeb Hameed without scoring and Zak Crawley for 12. Dawid Malan added 48 for third wicket with Root, before Cummins was rewarded in the final over before lunch, as Malan was caught at first slip for 14. Australia claimed another three wickets in the middle session, dismissing the dangerous duo of Root and Stokes (25). The departure of Buttler for three, after aiming a wild slog to deep mid-wicket off the bowling of Lyon in the last over before tea, summed up England's struggles against Australia's disciplined bowling. \\ World No.2-ranked batsman Root added to his side's woes outside off stump by offering a catch to wicketkeeper Alex Carey off the bowling of Mitchell Starc at 82-4. Root needs a second-innings score of 109 to claim a new record for most test runs in a calendar year, passing the tally of 1788 recorded by Pakistan's Mohammad Yousuf in 2006. Stokes tried to lift England's scoring rate by launching into an aggressive cut shot off the bowling of Cameron Green, but the left-hander was caught at gully at 115-5. Dubutant Scott Boland, playing at his home state ground, got his first test wicket by trapping Mark Wood leg before to the delight of the majority 57,100 fans at the MCG. Jonny Bairstow hit 35 before falling over as he edged a bouncer from Starc to gully at 159-8. Lyon removed tailenders Jack Leach (13) and Ollie Robinson (22). David Warner and Marcus Harris (20 not out) shared an opening stand of 57 for Australia. Warner was caught at gully off the bowling of Jimmy Anderson for 38. Harris required medical attention during the following over after being struck on the hand by a bouncer from Stokes, but survived to the end of play with nightwatchman Nathan Lyon to leave the hosts in the ascendancy again this series. (AP) Brief scores: England 1st innings 185 in 65.1 overs (Joe Root 50, Jonny Bairstow 35; Pat Cummins 3/36, Nathan Lyon 3/36) lead Australia 1st innings 61/1 (David Warner 38, Marcus Harris 20 not out; James Anderson 1/14) by 124 runs.","pubDate":"2021-12-26 18:43:51","full_description":"Melbourne: England's earnest dressing-room discussions about improving shot selection failed to bear fruit on Sunday's opening day of the third Ashes cricket Test, as shambolic batting delivered a Boxing Day feast of wickets for Australia at Melbourne Cricket Ground. England was bowled out for 185, before Australia reached 61-1 at stumps. Admittedly England, humiliated in a 275-run defeat in Adelaide, faced a tough task to bounce back on Sunday. Australia captain Pat Cummins won the toss and invited under-siege England to bat first on a green-tinged, seaming MCG pitch. England was 61-3 at lunch. By tea, the tourists were in serious trouble at 128-6, having lost the key wicket of skipper Joe Root for 50. England's resistance with the bat lasted just 65.1 overs. World No.1-ranked bowler Cummins (3-36), spinner Nathan Lyon (3-36) and left-arm quick Mitchell Starc (2-54) combined to keep the pressure on England's batters. A loose shot outside off stump by Root, a questionable cut by Ben Stokes, and a wild heave by Jos Buttler will attract heavy attention from England's press after another difficult day for the tourists, who trail two-nil in the five-match series. Cummins ripped through England's top order. The skipper took three wickets in the opening session after winning the toss and bowling. Rain delayed the start of play for 30 minutes before Cummins removed Haseeb Hameed without scoring and Zak Crawley for 12. Dawid Malan added 48 for third wicket with Root, before Cummins was rewarded in the final over before lunch, as Malan was caught at first slip for 14. Australia claimed another three wickets in the middle session, dismissing the dangerous duo of Root and Stokes (25). The departure of Buttler for three, after aiming a wild slog to deep mid-wicket off the bowling of Lyon in the last over before tea, summed up England's struggles against Australia's disciplined bowling. - World No.2-ranked batsman Root added to his side's woes outside off stump by offering a catch to wicketkeeper Alex Carey off the bowling of Mitchell Starc at 82-4. Root needs a second-innings score of 109 to claim a new record for most test runs in a calendar year, passing the tally of 1788 recorded by Pakistan's Mohammad Yousuf in 2006. Stokes tried to lift England's scoring rate by launching into an aggressive cut shot off the bowling of Cameron Green, but the left-hander was caught at gully at 115-5. Dubutant Scott Boland, playing at his home state ground, got his first test wicket by trapping Mark Wood leg before to the delight of the majority 57,100 fans at the MCG. Jonny Bairstow hit 35 before falling over as he edged a bouncer from Starc to gully at 159-8. Lyon removed tailenders Jack Leach (13) and Ollie Robinson (22). David Warner and Marcus Harris (20 not out) shared an opening stand of 57 for Australia. Warner was caught at gully off the bowling of Jimmy Anderson for 38. Harris required medical attention during the following over after being struck on the hand by a bouncer from Stokes, but survived to the end of play with nightwatchman Nathan Lyon to leave the hosts in the ascendancy again this series. (AP) Brief scores: England 1st innings 185 in 65.1 overs (Joe Root 50, Jonny Bairstow 35; Pat Cummins 3/36, Nathan Lyon 3/36) lead Australia 1st innings 61/1 (David Warner 38, Marcus Harris 20 not out; James Anderson 1/14) by 124 runs.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/26/500x300_1137857-cricket.jpg","source_id":"thehansindia"},{"title":"Ngidi strikes twice but India unshaken","link":"https://www.thehansindia.com/sports/cricket/ngidi-strikes-twice-but-india-unshaken-721755","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"South Africa fought back with a couple of wickets in the afternoon session via Lungi Ngidi but India still controlled the proceedings by reaching 272 for 3 at stumps on the first day of the opening Test against South Africa here on Sunday.","content":"Centurion: South Africa fought back with a couple of wickets in the afternoon session via Lungi Ngidi but India still controlled the proceedings by reaching 272 for 3 at stumps on the first day of the opening Test against South Africa here on Sunday.KL Rahul was going strong on 122 and Ajinkya Rahane was giving him company on 40 at close of play. Opener Mayank Agarwal made 60 while Cheteshwar Pujara was out for a duck. Captain Virat Kohli contributed 35.. India scored 74 runs in the second session while Ngidi removed Mayank Agarwal (60 off 123) and Cheteshwar Pujara (0) off successive balls to provide the hosts much needed breakthroughs. After struggling to hit the fuller lengths in the morning, South African pacers bowled with more consistency and attacked the stumps. Agarwal, who got to his half century after lunch, was dismissed against the run of play. The ball appeared to bounce over the wicket apart from missing the leg stump but the on-field decision was reversed when DRS revealed that it was hitting the wickets, leaving Agarwal in disbelief. His fall also ended a memorable 117-run partnership, making Rahul and Agarwal only the third Indian opening pair to stitch a century stand in 21 games in South Africa. With sun coming out, Pujara walked in and was dismissed first ball, inside edging a defensive shot to Keegan Petersen at short leg. Soon after, Rahul brought up his fifty with a delightful cover drive off Ngidi. Kohli, who has not scored a hundred in more than two years, began with an unconvincing drive off Marco Jansen before clipping spinner Keshav Maharaj wide of mid-on for his second boundary. Rahul survived a close LBW call off medium pacer Wiaan Mulder late into the session before flicking a half-volley in his following over for his 11th boundary. In the morning session, Agarwal and Rahul played with the required discipline in testing conditions to take India to 83 for no loss. Kohli made a brave call to bat first on a greenish surface which is expected to get quicker as the game progresses. Both Rahul and Agarwal, who are close friends and play for the same domestic team, left the ball well against a pace attack which did not bowl well enough in favourable conditions. Agarwal carried his good from the home series against New Zealand to SuperSport Park while Rahul stuck to the approach that brought him a lot of success in England earlier this year when he opened the batting alongside the now injured Rohit Sharma. Rahul was more watchful to start with, showing absolute clarity in leaving the ball while Agarwal was quick to cash in on freebies offered by the opposition pacers. Agarwal drove Ngidi through point for the first four of the innings. Rahul, who took 21 balls to get off the mark, played an exquisite straight drive off Kagiso Rabada to get going. Debutant left-arm pacer Jansen made a nervy start to his career with Agarwal dispatching him for three fours in his opening over. The 6 feet 8 inch bowler's first ball in Test cricket was a gentle full toss which Agarwal duly dispatched through cover point. Then the lanky pacer bowled a couple into the pads which were crisply flicked away. The South African pacers bowled a tad too short in the first hour of play. The Dean Elgar-led side also wasted a review early in the session. The only chance that came South Africa's way went begging with a diving Quinton de Kock dropping Agarwal off Jansen. He was batting on 36 at that time. (PTI)","pubDate":"2021-12-26 18:41:14","full_description":"Centurion: South Africa fought back with a couple of wickets in the afternoon session via Lungi Ngidi but India still controlled the proceedings by reaching 272 for 3 at stumps on the first day of the opening Test against South Africa here on Sunday. KL Rahul was going strong on 122 and Ajinkya Rahane was giving him company on 40 at close of play. Opener Mayank Agarwal made 60 while Cheteshwar Pujara was out for a duck. Captain Virat Kohli contributed 35.. India scored 74 runs in the second session while Ngidi removed Mayank Agarwal (60 off 123) and Cheteshwar Pujara (0) off successive balls to provide the hosts much needed breakthroughs. After struggling to hit the fuller lengths in the morning, South African pacers bowled with more consistency and attacked the stumps. Agarwal, who got to his half century after lunch, was dismissed against the run of play. The ball appeared to bounce over the wicket apart from missing the leg stump but the on-field decision was reversed when DRS revealed that it was hitting the wickets, leaving Agarwal in disbelief. His fall also ended a memorable 117-run partnership, making Rahul and Agarwal only the third Indian opening pair to stitch a century stand in 21 games in South Africa. With sun coming out, Pujara walked in and was dismissed first ball, inside edging a defensive shot to Keegan Petersen at short leg. Soon after, Rahul brought up his fifty with a delightful cover drive off Ngidi. Kohli, who has not scored a hundred in more than two years, began with an unconvincing drive off Marco Jansen before clipping spinner Keshav Maharaj wide of mid-on for his second boundary. Rahul survived a close LBW call off medium pacer Wiaan Mulder late into the session before flicking a half-volley in his following over for his 11th boundary. In the morning session, Agarwal and Rahul played with the required discipline in testing conditions to take India to 83 for no loss. Kohli made a brave call to bat first on a greenish surface which is expected to get quicker as the game progresses. Both Rahul and Agarwal, who are close friends and play for the same domestic team, left the ball well against a pace attack which did not bowl well enough in favourable conditions. Agarwal carried his good from the home series against New Zealand to SuperSport Park while Rahul stuck to the approach that brought him a lot of success in England earlier this year when he opened the batting alongside the now injured Rohit Sharma. Rahul was more watchful to start with, showing absolute clarity in leaving the ball while Agarwal was quick to cash in on freebies offered by the opposition pacers. Agarwal drove Ngidi through point for the first four of the innings. Rahul, who took 21 balls to get off the mark, played an exquisite straight drive off Kagiso Rabada to get going. Debutant left-arm pacer Jansen made a nervy start to his career with Agarwal dispatching him for three fours in his opening over. The 6 feet 8 inch bowler's first ball in Test cricket was a gentle full toss which Agarwal duly dispatched through cover point. Then the lanky pacer bowled a couple into the pads which were crisply flicked away. The South African pacers bowled a tad too short in the first hour of play. The Dean Elgar-led side also wasted a review early in the session. The only chance that came South Africa's way went begging with a diving Quinton de Kock dropping Agarwal off Jansen. He was batting on 36 at that time. (PTI)","image_url":"https://assets.thehansindia.com/h-upload/2021/12/26/500x300_1137854-n-gidi.jpg","source_id":"thehansindia"},{"title":"Raymond Illingworth obituary","link":"https://www.theguardian.com/sport/2021/dec/26/raymond-illingworth-obituary","keywords":["Cricket","England cricket team","Sport","The Ashes","Australia sport","Australia news","Yorkshire","Leicestershire"],"creator":["Peter Mason"],"video_url":null,"description":"Off-spinning all-rounder whose flair for captaincy enabled England to win and retain the Ashes against AustraliaRaymond Illingworth, who has died aged 89, was one of England’s most successful cricket captains, leading his side to a series victory in Australia, in 1970-71, and then retaining the Ashes at home, in 1972. A tough Yorkshireman and an all-rounder who gave nothing away with either bat or ball, as a skipper Illingworth was a master of the meaningful bowling change or disconcerting field adjustment, and could often affect the course of a match just by ratcheting up the psychological pressure on the opposition.He was also a superb man-manager who could get the best out of even the most difficult characters by applying equal measures of empathy, common sense and firmhandedness. While he undoubtedly benefited from having a strong team to nurture – with players including Geoffrey Boycott, John Edrich, Basil D’Oliveira, Derek Underwood and John Snow at his disposal – he also ensured that his players displayed tremendous spirit. Continue reading...","content":null,"pubDate":"2021-12-26 16:36:39","full_description":"Raymond Illingworth, who has died aged 89, was one of England’s most successful cricket captains, leading his side to a series victory in Australia , in 1970-71, and then retaining the Ashes at home, in 1972. A tough Yorkshireman and an all-rounder who gave nothing away with either bat or ball, as a skipper Illingworth was a master of the meaningful bowling change or disconcerting field adjustment, and could often affect the course of a match just by ratcheting up the psychological pressure on the opposition. He was also a superb man-manager who could get the best out of even the most difficult characters by applying equal measures of empathy, common sense and firmhandedness. While he undoubtedly benefited from having a strong team to nurture – with players including Geoffrey Boycott, John Edrich , Basil D’Oliveira , Derek Underwood and John Snow at his disposal – he also ensured that his players displayed tremendous spirit. Success came not only with England but, in exile from Yorkshire, in county cricket with Leicestershire , where as captain in the early 70s he turned an over-relaxed, unambitious side into a trophy-winning outfit. Later he returned to Yorkshire as their cricket manager and had a spell as England manager, although in both roles he had noticeably less success than on the pitch. Born in Pudsey, West Yorkshire , Raymond was the only child of Ida and Fred Illingworth. When he was four the family moved down the road to Farsley and his father, a cabinet maker, fashioned Raymond’s first cricket bat in his workshop. Determined to be a sportsman, at 11 he refused even to sit exams for grammar school and at 14 was apprenticed to his father, allowing him days off to play cricket for Farsley in the Bradford League. Much of his national service in the RAF was spent on the cricket field, including for the Combined Services, and he made his Yorkshire debut aged 19 in 1951, scoring 56 in his first innings. The county side of the era was a collection of hard, self-serving Yorkshiremen with acid tongues and zero sympathy for any new boy – “no word of encouragement, no helpful tips, no pat on the back … and heaven help you if things went wrong,” he recalled. It toughened him up quickly, but was a dispiriting experience that informed the nature of his later captaincy, which he aimed to make more inclusive. He was especially influenced by the appointment in 1958 of a more soft-focused but strong-minded captain, Ronnie Burnet , who promoted camaraderie rather than internal strife – and as a result won Yorkshire the County Championship in 1959 for the first time in a decade. That season was one of Illingworth’s best, and in the previous year he had made a quiet England debut in the fourth Test against New Zealand at Old Trafford. He had to wait a year for his next match, against India, and was then picked for the 1959-60 tour to the West Indies. For a number of years, however, he rarely felt secure of selection, and from mid-1963 to the summer of 1967 was hardly in the team at all. Yet by 1969, in his 31st Test, he had become England captain. That first match as skipper arrived at the age of 37 after the incumbent, Colin Cowdrey , snapped an achilles tendon. Illingworth stepped in for the three-Test home series against West Indies and provided a dynamic counterpoint to Cowdrey’s diffident style. England won the first match at Old Trafford and he scored his first Test hundred in the second drawn game at Lord’s, while in victory in the third at Headingley, where every decision he made seemed to reap rewards, he had one of his finest hours as captain. As a consequence he was reappointed for a second series that summer, against New Zealand, which England won 2-0. In 1970 Illingworth was at the helm for an unofficial five-match home series against a strong Rest of the World side, which England lost 4-1. He continued as captain for the 1970-71 Ashes tour, and thanks in great part to his shrewd, combative leadership, England won the Ashes for the first time in more than a decade. Much of that exhausting seven-match series was played under intense pressure, particularly during the decisive last Test at Sydney, which England managed to win without Boycott and, for the latter half of the match, minus Snow, who had broken a finger. In Australia’s first innings Illingworth had shown his mettle by marching his players off the pitch when spectators bombarded Snow with bottles. Despite England’s tour manager, David Clark, trying to order Illingworth back on to the field, he stood firm and refused to resume until order had been restored. He completed that winter tour with a 1-0 win against New Zealand, followed with victory by the same margin at home to Pakistan in 1971 and, after a shock 1-0 defeat to India in the same summer, retained the Ashes at home the next year with a 2-2 series draw , a feat that earned him appointment as CBE. By then aged 40 and thoroughly drained by two combative Ashes series, he made himself unavailable for the 1972-73 tour to Pakistan and India, but was back in charge for two home series against New Zealand and West Indies in 1973. England won comfortably against New Zealand but found themselves in unexpected trouble against West Indies, and during the last game of the three-match series at Lord’s, Illingworth was told he would not be captain for the forthcoming winter tour to the Caribbean. His side lost that Lord’s match – and with it the series, 2-0. But as the decision had been taken before its outcome, he felt the move had been “political” a result perhaps of a feeling among the selectors that he was too much in the players’ camp and not enough in theirs. Illingworth had led his country 31 times between 1969 and 1973 and had lost just five Tests over the period, winning 12 and drawing 14. Of the nine series in which he was captain he was victorious in six, winning his first five series in a row without conceding a match against any opposition. Moreover, in 61 Tests he had made a significant contribution as an all-rounder, averaging 23.24 with the bat and 31.20 with the ball. A tight, thoughtful off-spinner, he was also a solid, orthodox batsman who could block or swing as the state of the game required, and while he could hardly be termed a “great” in any one department, he arguably deserved that tag when his complete package of bowling, batting, fielding and captaincy was taken into account. After he lost his England place with the captaincy, Illingworth returned to focus on county cricket. He had expected to see his days out with Yorkshire, but in 1968, after 17 years in which he had been a key member of seven County Championship-winning sides, his request for a three-year contract was refused and so he left for Leicestershire , who had asked him to be their skipper. His new county had never won anything when he joined them in 1969, but Illingworth engineered a dramatic transformation. Within three years they had taken their first title – the Benson & Hedges Cup in 1972 – and under his captaincy they also won the John Player League in 1974, the County Championship and Benson Hedges Cup in 1975, and the John Player League again in 1977. After 10 happy years at Leicestershire, in 1979 he accepted an offer from Yorkshire to become their cricket manager, allowing him to retire as a player. But it was a backroom position dogged by internal disputes, and after a poor start to the 1982 season Illingworth felt compelled to come out of retirement to captain the side at the age of 50. The following year Yorkshire won the John Player League under his command, but they also finished bottom of the County Championship, and he resigned all his roles in 1984, having played 787 first class matches, the ninth highest tally of all time. He took 2,072 wickets at 20.27 in his first class career with a best of nine for 42, and scored 24,134 runs at 28.06 with a highest score of 162. After a decade of freelance media work, Illingworth became England’s chairman of selectors in 1994, a year later also taking on the job of manager. He inherited a weak team captained by Michael Atherton , but did not forge an easy relationship with a new generation of players, and found there was little he could do to make a difference. He left the job after three years and settled down to a modest life of quiet retirement, which included regular golf and family holidays in Spain. In 1958 he married Shirley Milnes. Following her death from cancer in March 2021, and suffering from cancer himself, he backed calls for the right to assisted dying. He is survived by their two daughters, Diane and Vicky. Raymond Illingworth, cricketer, born 8 June 1932; died 25 December 2021","image_url":"https://i.guim.co.uk/img/media/eeb4d47c5a096e4aff2b263df77324ab03a08fc1/0_648_2334_1400/master/2334.jpg?width=460&quality=85&auto=format&fit=max&s=a3426badbd7f93af49fc0747a7996d54","source_id":"theguardian"},{"title":"England cricket capitulations have gone from car-crash to commonplace | Jonathan Liew","link":"https://www.theguardian.com/sport/blog/2021/dec/26/england-capitulations-have-gone-from-car-crash-to-commonplace","keywords":["England cricket team","Australia cricket team","The Ashes","Cricket","Australia sport","Sport","Jos Buttler","Ben Stokes","Ashes 2021-22","Jonny Bairstow"],"creator":["Jonathan Liew"],"video_url":null,"description":"Latest Ashes collapse is overly familiar and a backdrop to the beginning of the end for Stokes-Bairstow-Buttler middle orderTypical: Christmas evening, you turn on the television and it’s another bloody repeat. Although in fairness to England, pick through the dental records of their latest Ashes capitulation and you might just be able to identify a few distinguishing features. And above all the defining quality of their Boxing Day fiasco in Melbourne was the sense of hopelessness and predestination: of a team and a generation whose narrative arc has finally run dry.There was a time when England collapses had a kind of fascinating car-crash quality. These days, by contrast, they feel strangely banal: tedious, overfamiliar, predictable, like a recurring anxiety dream. The openers disappear early. Joe Root does something pointless and defiant. All of a sudden you’re back at your old school. Someone in the middle order plays a stupid shot. You turn over the exam paper, but there’s nothing on it. Continue reading...","content":null,"pubDate":"2021-12-26 16:26:23","full_description":"T ypical: Christmas evening, you turn on the television and it’s another bloody repeat. Although in fairness to England, pick through the dental records of their latest Ashes capitulation and you might just be able to identify a few distinguishing features. And above all the defining quality of their Boxing Day fiasco in Melbourne was the sense of hopelessness and predestination: of a team and a generation whose narrative arc has finally run dry. There was a time when England collapses had a kind of fascinating car-crash quality. These days, by contrast, they feel strangely banal: tedious, overfamiliar, predictable, like a recurring anxiety dream. The openers disappear early. Joe Root does something pointless and defiant. All of a sudden you’re back at your old school. Someone in the middle order plays a stupid shot. You turn over the exam paper, but there’s nothing on it. The No 9 hits an insolent 25. Suddenly you realise you’re totally naked. James Anderson walks off the field, nought not out. You wake, breathless and more tired than when you went to bed. It takes some effort to make your biggest encounter of all feel like a trite inconsequence, but somehow this England have managed it. Has a live series ever felt more dead? Have two theoretically well-matched teams (just look at the world rankings; Australia and England are separated by just a single point) ever produced such a calamitous mismatch? Has an England middle order ever played three worse shots than those Ben Stokes, Jos Buttler and Jonny Bairstow produced on the first afternoon of the third Test? Perhaps. Perhaps not. Certainly there were few expectations when Root departed shortly after lunch to leave England 82 for four, a familiar quandary. Yet as Stokes and Bairstow launched a squally counterattack, other futures briefly presented themselves. Twenty-eight runs came in the seven overs before drinks, including a huge six by Stokes off Nathan Lyon. All of a sudden, an opening. The ball was ageing. England were one good, solid hour from rebalancing the game. At which point Cameron Green returned to the attack, hanging the ball outside off stump, accumulating dots, daring Stokes to play the big shot. Lyon bowled very straight with a tight leg-side field, accumulating dots, daring Bairstow to play the big shot. Six overs cost just five runs. Has a plan ever been simpler or more transparent? In a way, those next few overs were England’s last few years in microcosm. You hit a rough patch, and you either endure or you flip out and do the bad thing. And over the last four or five years England have essentially turned doing the bad thing into a sort of performance art. Stokes had already tried to upper-cut Green over the slips a few overs earlier and narrowly escaped. Hey, why not try it again? After he had steered the ball meekly to gully, Buttler arrived and immediately seemed to lose heart. His second ball jagged back and bounced over his stumps. Mitchell Starc got one to leap off a length. Pat Cummins got one to die a little. And so, in the last over before tea, with the score 128 for five and Mark Wood the next man in, Buttler hit the ejector seat. It was a terrible shot. It would have been a terrible shot even if he had nailed Lyon into the crowd for six. It was the shot you play when your conscious brain is too tired to compute the knotted logistics of staying in, and the id simply takes over. It was the shot of a man out of form and out of rhythm, who in fatigue and desperation had convinced himself that he could regain his form and rhythm with one sweet contact. Bairstow at least had the excuse of batting with the tail, but in trying to cut a ball from Starc that was on about leg stump, he too deserves his share of ignominy. There is a theory out there that these are simply bad players, who have proved it again and again over time. But talent is a dynamic thing. Success is not a straight line. Players improve and learn and founder and regress and there is nothing inevitable about any of it. On talent alone, Stokes‑Bairstow-Buttler could have been one of the all-time great England middle orders. An axis upon which an entire era could have been built. Given defined roles in a confident team, they won a World Cup final pretty much on their own. Instead, this series feels like the end of the road for them as a trio. Haunted in the field and hounded with the bat, Buttler looks in desperate need of a break, perhaps even a permanent break. Stokes looks physically and mentally undercooked. Bairstow is surely on the last of his last chances. All three are over 30 and nearer the end than the beginning. And for all they have achieved together with a white ball, with a red ball the feeling of loss is inescapable: a promise not fulfilled, three pristine talents misused, mismanaged and forsaken.","image_url":"https://i.guim.co.uk/img/media/50885747350b42c850a85806aa4c791bf50f6aa1/0_103_3858_2315/master/3858.jpg?width=460&quality=85&auto=format&fit=max&s=9e5b676b9d931be1935fd7f4e77ba261","source_id":"theguardian"},{"title":"IND vs SA commentators Test series: Full list of Star Sports commentators for India’s tour of South Africa 2021-22","link":"https://thesportsrush.com/cricket-news-ind-vs-sa-commentators-test-series-full-list-of-star-sports-commentators-for-indias-tour-of-south-africa-2021-22/","keywords":["Cricket","India","India tour of South Africa 2021-22","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs SA commentators: The SportsRush present before you a list of Star Sports commentators for South Africa vs India Tests. The first day of the first Test of the ongoing India’s tour of South Africa in Centurion belonged to India as they scored 272/3 in 90 overs after captain Virat Kohli (35) won the… The post IND vs SA commentators Test series: Full list of Star Sports commentators for India’s tour of South Africa 2021-22 appeared first on The SportsRush.","content":"IND vs SA commentators: The SportsRush present before you a list of Star Sports commentators for South Africa vs India Tests. The first day of the first Test of the ongoing India’s tour of South Africa in Centurion belonged to India as they scored 272/3 in 90 overs after captain Virat Kohli (35) won the toss and chose to bat. Vice-captain Lokesh Rahul’s seventh Test century was the highlight of the day. Opening the batting with Mayank Agarwal (60), Rahul played second fiddle in a 117-run opening partnership. However, the right-hand batter took the mantle upon himself after India lost Agarwal and Cheteshwar Pujara (0) on successive deliveries. India’s most versatile batter—K L Rahul. Seven Test centuries. Has scored Test century in every country that he’s played in. Top top player. #SAvInd — Aakash Chopra (@cricketaakash) December 26, 2021 Kohli, who played quite an ordinary shot by his standard to get out to South Africa fast bowler Lungi Ngidi, continued to distance himself from an elusive 71st international century. Former vice-captain Ajinkya Rahane, on the other hand, hit as many as eight eye-catching boundaries in his 40* (81) as he will resume the Indian innings alongside Rahul on Day 2. Having looked way better than what his numbers suggest in the last one year, Rahane wouldn’t want to waste this opportunity of scoring a career-saving century. IND vs SA commentators As far as the Indian fans are concerned, Star Sports Network is televising this three-match Test series for them. Known for covering cricket across languages, Star has arranged commentary teams in as many as five languages namely English, Hindi, Tamil, Telugu and Kannada. The nine-member English commentary panel comprises of only one Indian in former captain Sunil Gavaskar. As far as the Hindi commentators for this series are concerned, five former Indian cricketers call the game from Star’s studio in Mumbai. While Star hasn’t named former South Africa spinner Imran Tahir among its Hindi commentators, Tahir was commentating with the Hindi commentary team on Day 1. English – Mark Nicholas, Pommie Mbangwa, Hashim Amla, Sunil Gavaskar, Shaun Pollock, Mike Haysman, Makhaya Ntini, Vernon Philander, Robin Peterson. Anchors – Suren Sundaram, Sanjana Ganesan. Star Sports Hindi commentators – Nikhil Chopra, Sanjay Bangar, Aakash Chopra, Ajit Agarkar, Irfan Pathan. Tamil – Nanee, S Ramesh, Yo Mahesh, S Sriram. The post IND vs SA commentators Test series: Full list of Star Sports commentators for India’s tour of South Africa 2021-22 appeared first on The SportsRush.","pubDate":"2021-12-26 16:08:38","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Wasim Jaffer Posts A Hilarious Meme After KL Rahul Becomes 2nd Indian Opener To Score A Test Century In South Africa After The Former - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiwgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaW5kaWEtdG91ci1vZi1zb3V0aC1hZnJpY2EtMjAyMS93YXNpbS1qYWZmZXItcG9zdHMtYS1oaWxhcmlvdXMtbWVtZS1hZnRlci1rbC1yYWh1bC1iZWNvbWVzLTJuZC1pbmRpYW4tb3BlbmVyLXRvLXNjb3JlLWEtdGVzdC1jZW50dXJ5LWluLXNvdXRoLWFmcmljYS1hZnRlci10aGUtZm9ybWVyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Wasim Jaffer Posts A Hilarious Meme After KL Rahul Becomes 2nd Indian Opener To Score A Test Century In South Africa After The Former  Cricket AddictorRecent Match Report - India vs South Africa 1st Test 2021/22  ESPNcricinfoIndia Tour of South Africa: Virat Kohli Breaks Mohammed Azharuddin's Record of Most Toss Wins as Test Skipper  India.comIndia’s Lokesh Rahul frustrates Proteas on day one  CitizenRahul ton headlines India's dominant start in Centurion Test, South Africa vs India Test cricket | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-26 15:54:07","image_url":null,"source_id":"google"},{"title":"Vijay Hazare Trophy winner list all season: Full list of all Vijay Hazare Trophy winners","link":"https://thesportsrush.com/cricket-news-vijay-hazare-trophy-winner-list-all-season-full-list-of-all-vijay-hazare-trophy-winners/","keywords":["Cricket","Vijay Hazare Trophy 2021-22"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Vijay Hazare Trophy winner list all season: Himachal Pradesh have won their maiden Vijay Hazare Trophy title by defeating Tamil Nadu. The Himachal Pradesh domestic Cricket side have done the unprecedented. Not only have they bagged their maiden domestic title in history, but they have won it by defeating arguably the strongest side in the… The post Vijay Hazare Trophy winner list all season: Full list of all Vijay Hazare Trophy winners appeared first on The SportsRush.","content":"Vijay Hazare Trophy winner list all season: Himachal Pradesh have won their maiden Vijay Hazare Trophy title by defeating Tamil Nadu. The Himachal Pradesh domestic Cricket side have done the unprecedented. Not only have they bagged their maiden domestic title in history, but they have won it by defeating arguably the strongest side in the Indian domestic circuit currently- Tamil Nadu by 11 runs (VJD method) in the final of the Vijay Hazare Trophy 2021-22 at the Sawai Mansingh stadium, Jaipur. Chasing a stiff total of 314 posted by Tamil Nadu, Himachal Pradesh’s wicketkeeper-batter Shubham Arora set the tone right from the get go and remained unbeaten at an individual score of 136* (131) till the fading natural light made sure no further play was possible. He was assisted remarkably well by Amit Kumar (74 off 79) and later by his skipper Rishi Dhawan (42* off 23) during the coarse of a record chase. While a 148-run partnership for the fourth wicket between Arora and Kumar was imperative, Himachal Pradesh still needed to score 71 runs of 53 deliveries, when the former was dismissed. It was at this point that Dhawan, with the assistance of 5 fours and a maximum, while striking at 182.61 per 100 deliveries steered the ship through to the ultimate frontier. Rishi Dhawan: In #SyedMushtaqAliTrophy 2020/21- 5 INNS, 140 R, 126.12 SR, 9 W, 6.85 ER 2021/22- 6 INNS, 117 R, 127.17 SR, 14 W, 7.14 ER In #VijayHazareTrophy 2020/21- 5 INNS, 150 R, 92.02 SR, 16 W, 5.45 ER 2021/22- 8 INNS, 458 R, 127.22 SR, 17 W, 6 ER#CricketTwitter — Krithika (@krithika0808) December 26, 2021 Dhawan in fact, ended the season as the second-higest run-getter (458 runs) as well as the second-highest wicket-taker (17 wickets). Vijay Hazare Trophy winner list all season While this was Himachal Pradesh’s maiden Vijay Hazare title (2021), they denied Tamil Nadu their record sixth, which highly boasts of the dominance they have had over the years in the domestic circuit. Earlier this year in March, Mumbai had lifted their fourth Vijay Hazare Trophy title by defeating Uttar Pradesh by 6 wickets. Karnatake fall next in the list by winning a total of three titles of BCCI’s premier 50-Over tournament.   Year Winner Runner-up 2020-21 Mumbai Uttar Pradesh 2019 Karnataka Tamil Nadu 2018 Mumbai Delhi 2017-18 Karnataka Saurashtra 2016-17 Tamil Nadu Bengal 2015-16 Gujarat Delhi 2014-15 Karnataka Punjab 2013-14 Karnataka Railways 2012-13 Delhi Assam 2011-12 Bengal Mumbai 2010-11 Jharkhand Gujarat 2009-10 Tamil Nadu Bengal 2008-09 Tamil Nadu Bengal 2007-08 Saurashtra Bengal 2006-07 Mumbai Rajasthan 2005-06 Railways Uttar Pradesh 2004-05 Tamil Nadu and Uttar Pradesh NA 2003-04 Mumbai Bengal 2002-03 Tamil Nadu Punjab   N.B.- Before 2002, there were multiple winners from each zone.   The post Vijay Hazare Trophy winner list all season: Full list of all Vijay Hazare Trophy winners appeared first on The SportsRush.","pubDate":"2021-12-26 14:52:21","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"KL Rahul total centuries in all formats: Twitter reactions on KL Rahul hundred in Test at SuperSport Park","link":"https://thesportsrush.com/cricket-news-kl-rahul-total-centuries-in-all-formats-twitter-reactions-on-kl-rahuls-7th-test-century-in-centurion-test/","keywords":["Cricket","India Cricket Team","India","India tour of South Africa 2021-22","KL Rahul","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KL Rahul total centuries: The Indian vice-captain scored his 14th international century on Day 1 of India’s tour of South Africa 2021-22. During the first day of the first Test of the ongoing India’s tour of South Africa in Centurion, India vice-captain Lokesh Rahul has scored his seventh Test century. In what is Rahul’s second… The post KL Rahul total centuries in all formats: Twitter reactions on KL Rahul hundred in Test at SuperSport Park appeared first on The SportsRush.","content":"KL Rahul total centuries: The Indian vice-captain scored his 14th international century on Day 1 of India’s tour of South Africa 2021-22. During the first day of the first Test of the ongoing India’s tour of South Africa in Centurion, India vice-captain Lokesh Rahul has scored his seventh Test century. In what is Rahul’s second Test century of this year, it is his sixth away from home, first against and in South Africa. Rahul, who has grabbed the opportunity of opening the batting in Test cricket with both hands, is bettering his reputation as a batter on the back of these overseas centuries. Rahul, who played second-fiddle in a 117-run opening partnership alongside Mayank Agarwal (60), took the mantle upon himself after India lost Agarwal and Cheteshwar Pujara (0) on successive deliveries. It was in the 43rd over in the afternoon session when Rahul had scored a boundary off South Africa fast bowler Kagiso Rabada to complete his half-century. The 29-year old batter reached to the three-figure mark after hitting a boundary off spinner Keshav Maharaj in the 78th over. Twitter reactions on KL Rahul hundred in Test at SuperSport Park Welcome to the exclusive club of Indian openers with a Test hundred in SA @klrahul11 very well played #SAvIND pic.twitter.com/Fjz2RRA4aA — Wasim Jaffer (@WasimJaffer14) December 26, 2021 Respect conditions, play late, stride forward, weight transfer, dot balls, drives … kl rahul is holding online batting class please watch… what a Fantastic knock @klrahul11 #INDvsSA — Mohammad Kaif (@MohammadKaif) December 26, 2021 As a colleague of mine would say: “Always a pleasure, never a chore” watching a K L Rahul century. #Secure — Ian Raphael Bishop (@irbishi) December 26, 2021 quite something to end a two year test hiatus with a hundred at lords and then on boxing day! #SAvsIND — Gaurav Kalra (@gauravkalra75) December 26, 2021 KL Rahul total centuries in all formats In addition to seven Test centuries, Rahul also has five ODI and two T20I centuries to his name. Rahul, who has 14 international centuries under his belt now, has surpassed former India batter Mohinder Amarnath (13) and equaled another former batter in Gundappa Viswanath (14). Another international century will witness Rahul equaling the likes of MS Dhoni, Ajinkya Rahane, Ravi Shastri and Navjot Singh Sidhu, all of whom have scored 15 centuries across formats. The post KL Rahul total centuries in all formats: Twitter reactions on KL Rahul hundred in Test at SuperSport Park appeared first on The SportsRush.","pubDate":"2021-12-26 14:46:13","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cummins leads charge as Aussies dominate Boxing Day | Men's Ashes 2021-22 -","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9LWFJTGNuTWo5czTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cummins leads charge as Aussies dominate Boxing Day | Men's Ashes 2021-22  The Ashes 3rd Test, Day 1: When do England lose their Test status? | #PoliteEnquiries | ESPNcricinfo  ESPN UKWatch: Joe Root's Furious Reaction After Being Dismissed By Mitchell Starc On Day 1 Of 3rd Ashes Tes..  NDTVSports.comAshes 2021-22: Live Cricket Score - The Ashes, 2021-22, 3rd Test, Day 1, Melbourne | Cricbuzz.com  CricbuzzBoxing Day Test: Day 1 | 10 News First  10 News FirstView Full coverage on Google News","content":null,"pubDate":"2021-12-26 13:30:00","image_url":null,"source_id":"google"},{"title":"Watch: Sreesanth Announces Return, In Kerala's Preliminary Ranji Squad","link":"https://sports.ndtv.com/cricket/s-sreesanth-announces-return-to-domestic-cricket-included-in-keralas-preliminary-ranji-trophy-squad-watch-2672601","keywords":null,"creator":null,"video_url":null,"description":"S Sreesanth took to Twitter to announce his return to domestic cricket after getting selected in Kerala's preliminary Ranji Trophy squad.","content":null,"pubDate":"2021-12-26 13:21:08","full_description":"Former India pacer S Sreesanth took to Twitter to make a big announcement that he would be making his return to domestic cricket and has been included in Kerala's preliminary squad for the Ranji Trophy. Speaking via video, the 38-year-old thanked fans for their support and stated that it was great to \"be back in the whites again\". \"Hi! Good afternoon and thank you very much for the love and support. Its great to be back in the whites again, bowling red ball, that too for my state where it all started\", he said. \"I'm really excited just like the U19 boy who got the red ball for the first time\", he concluded. Here is the video: Feels great to be back after 9 years playing Ranji trophy for my lovely state really grateful to each and everyone of u,lots of love and respect. #grateful #cricket #love #kerala #cricketer #ranjitrophy #redball #neverevergiveup #comeback #time #phoenix pic.twitter.com/huiNsFgC83 The announcement was well-received by fans with many congratulating him. Sreesanth will be making a return to red-ball cricket after nearly nine years. He last played a first-class match in 2013 and also served a seven-year suspension for his alleged involvement in the 2013 IPL spot-fixing scandal. His ban ended on September 13, 2020. Sachin Baby will be captaining the Kerala squad for the Ranji Trophy and the preliminary squad also includes the likes of Basil Thampi, Anand Joseph. Promoted Kerala's Ranji Trophy fixtures start on January 13 against Vidarbha, followed by Bengal (January 20), Rajasthan (January 27), Tripura (February 3) and Haryana (February 10). Kerala Ranji Trophy probables: Sachin Baby (capt), Vishnu Vinod (vice-capt & wk), Anand Krishnan, Rohan Kunnumal, Vatsal Govind, Rahul P, Salman Nizar, Sanju Samson, Jalaj Saxena, Sijomon Joseph, Akshay K C, Mithun S, Basil N P, Nideesh M D, Manu Krishnan, Basil Thampi, Fanoos F, S Sreesanth, Akshay Chandran, Varun Nayanar (wk), Anand Joseph, Vinoop Manoharan, Arun M, Vaishak Chandran.","image_url":"https://c.ndtvimg.com/2021-12/ts2o1gt8_s-sreesanth_120x90_26_December_21.jpg","source_id":"ndtv"},{"title":"“Want to be a role model to encourage Indigenous kids to play cricket” - Scott Boland after Australia debut in 3rd Ashes Test","link":"https://www.sportskeeda.com/cricket/news-ashes-2021-want-role-model-encourage-indigenous-kids-to-play-cricket-scott-boland-boxing-day-debut?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-26 13:11:00","full_description":"Australian pacer Scott Boland has admitted that becoming only the second Indigenous man to play Test cricket for the country \"means a lot\". Boland asserted that he wants to be a role model who can encourage Indigenous kids to play cricket. 32-year-old Boland made his Test debut in the third Ashes encounter against England on Boxing Day. The pacer had earlier featured in 14 ODIs and three T20Is, the last of which was in 2016. While Pat Cummins (3/36) and Nathan Lyon (3/36) dominated proceedings for Australia with the ball, Boland had a decent Test debut, claiming 1 for 48 as England were skittled out for 185. Speaking after the opening day’s play in Melbourne, Boland said he is hopeful of the Aboriginals in cricket becoming big one day. The debutant stated: Boland added: The pace bowler was named as injury cover in the Australian squad after the second Test. However, the hosts picked him in the playing XI while confirming the squad for the Boxing Day Test. Boland hails from the Gulidjan tribe in western Victoria state. He is the first Indigenous male cricketer to play for Australia since Jason Gillespie, who played his last Test in 2006. Two female Indigenous cricketers, Faith Thomas and Ashleigh Gardner, have also represented Australia in Test matches. Boland claimed his maiden Test wicket on Day 1 of the Boxing Day encounter when he trapped Mark Wood lbw for 6 in the 56th over of England’s first innings. Wood went for a review but the on-field decision stood. Asked to share his emotions on getting his first Test wicket, Boland said: After England were bowled out for 185, Australia reached 61 for 1 at stumps. Although David Warner (38 off 42) perished to James Anderson, the hosts only trail by 124 runs with nine wickets in hand.","image_url":"https://static.sportskeeda.com/editor/2021/12/35442-16405177448996-1920.jpg","source_id":"sportskeeda"},{"title":"Tyson Fury invites Deontay Wilder and family around to spend Christmas holiday with Paris and kids after brutal trilogy","link":"https://www.thesun.co.uk/sport/17146295/tyson-fury-deontay-wilder-boxing-christmas/","keywords":["Sport","Heavyweight boxing"],"creator":["John Hutchinson"],"video_url":null,"description":"TYSON FURY has invited old foe Deontay Wilder round to his house in Florida for the Christmas holidays. The two heavyweights are enjoying some family time over the festive season, months after their epic trilogy fight. Fury made it two wins in three, the other was a draw, when he knocked Wilder out in the […]","content":"TYSON FURY has invited old foe Deontay Wilder round to his house in Florida for the Christmas holidays. The two heavyweights are enjoying some family time over the festive season, months after their epic trilogy fight. Tyson Fury is spending the Christmas holidays in Florida with wife Paris and their six children Fury made it two wins in three, the other was a draw, when he knocked Wilder out in the 11th round in Las Vegas. The Gypsy King is expected to be back in action in March, while Wilder is reportedly considering retiring from the sport. But Fury has invited the deposed WBC champ to his sprawling mansion in the US. The 33-year-old told MailOnline: “It’s a huge place. With an enormous swimming pool. Room for all and I’ve told Deontay we’re right handy for Disney World.” If Wilder takes up the offer, it could be a busy time at chez Fury. The Morecambe mauler has six children with wife Paris. Wilder has eight children of his own. Most read in Sport ALGERIA MOURNS Footballer dies on pitch during match after heart attack on Christmas Day GAME OVER Spurs-Palace set to be next Boxing Day game postponed after Eagles Covid outbreak JOSE WELL SET Mourinho launches Roma transfer raid on Man Utd for whizkid Charlie Wellens LEGEND LOST Former Ashes-winning England cricket captain Ray Illingworth dies at 89 THE NARCISSIST WWE icon is unrecognisable 14 years after retiring & losing hulking physique NEW LOOK Man Utd legend looks like a new man with bushy beard and grey hair FREE BETS: GET OVER £2,000 IN NEW CUSTOMER DEALS Promoter Frank Warren has revealed FOUR names are being discussed to fight Fury in March. But WBC mandatory challenger Dillian Whyte is NOT one of those shortlisted as the Londoner continues his legal wrangles with the organisation. It is likely that Fury, 33, will not lay his belt on the line because of the ongoing Whyte situation. Warren revealed that Whyte’s arbitration case with the WBC ‘is not set until March’ – effectively ruling him out of being in the frame to fight that month. Fury secured a stunning 11th-round KO of Wilder in October","pubDate":"2021-12-26 13:05:41","full_description":"TYSON FURY has invited old foe Deontay Wilder round to his house in Florida for the Christmas holidays. The two heavyweights are enjoying some family time over the festive season, months after their epic trilogy fight. Fury made it two wins in three, the other was a draw, when he knocked Wilder out in the 11th round in Las Vegas. The Gypsy King is expected to be back in action in March, while Wilder is reportedly considering retiring from the sport. But Fury has invited the deposed WBC champ to his sprawling mansion in the US. The 33-year-old told MailOnline : \"It's a huge place. With an enormous swimming pool. Room for all and I've told Deontay we're right handy for Disney World.\" If Wilder takes up the offer, it could be a busy time at chez Fury. The Morecambe mauler has six children with wife Paris. Wilder has eight children of his own. FREE BETS: GET OVER £2,000 IN NEW CUSTOMER DEALS Promoter Frank Warren has revealed FOUR names are being discussed to fight Fury in March. But WBC mandatory challenger Dillian Whyte is NOT one of those shortlisted as the Londoner continues his legal wrangles with the organisation. It is likely that Fury, 33, will not lay his belt on the line because of the ongoing Whyte situation. Warren revealed that Whyte's arbitration case with the WBC 'is not set until March' - effectively ruling him out of being in the frame to fight that month.","image_url":null,"source_id":"thesun"},{"title":"Vijay Hazare Trophy | Himachal stuns mighty Tamil Nadu for maiden title","link":"https://www.thehindu.com/sport/cricket/vijay-hazare-trophy-himachal-stuns-mighty-tamil-nadu-for-maiden-title/article38042621.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"Tamil Nadu have been the best domestic side in the country in white-ball cricket since the 2019-20 season.","content":null,"pubDate":"2021-12-26 12:55:28","full_description":null,"image_url":null,"source_id":"thehindu"},{"title":"Himachal stun Tamil Nadu in Vijay Hazare Trophy final for maiden title","link":"https://www.business-standard.com/article/sports/himachal-stun-tamil-nadu-in-vijay-hazare-trophy-final-for-maiden-title-121122600613_1.html","keywords":null,"creator":null,"video_url":null,"description":"The hill state of Himachal Pradesh on Sunday reached its zenith in cricket, with a stunning 11-run victory over mighty Tamil Nadu in the final of the Vijay Hazare Trophy","content":null,"pubDate":"2021-12-26 12:43:00","full_description":"The hill state of Himachal Pradesh on Sunday reached its zenith in cricket, with a stunning 11-run victory over mighty Tamil Nadu in the final of the Vijay Hazare Trophy here. Youngster Shubham Arora came out all guns blazing with his maiden List A century as Himachal downed five-time champions Tamil Nadu under the VJD method to win their first ever domestic one-day championship. Chasing a stiff 315, Himachal Pradesh, who were playing their maiden Vijay Hazare final, responded in style with the 24-year-old wicketkeeper-batter making a fine 136 not out with 13 fours and one six. With Himachal 299/4 in 47.3 overs, and needing 16 off 15 balls, bad light suspended play at 5pm, before Himachal were declared winners under the VJD Method. Tamil Nadu have been the best domestic side in the country in white-ball cricket since the 2019-20 season. After losing the finals of the one-day and T20 competitions in 2019, the team has won back-to-back titles in the Syed Mushtaq Ali Trophy T20s (2020-21 and 2021-22), but underdogs Himachal outplayed the favourites on this occasion. On a day when veteran wicketkeeper-batter and former captain Dinesh Karthik smashed an entertaining 103-ball 116, the young Himachal glovesman outshone the seasoned pro with his well-calculated, unbeaten century under pressure. After opting to field on a flat Sawai Mansingh Stadium, Rishi Dhawan took another fine call in sending Amit Kumar ahead of him, as the skipper chose to play the role of a finisher. The move paid dividends as the the left-right combination of Arora and Amit (74 from 79 balls; 6x4) added 148 for the fourth wicket in a match-winning partnership. After Baba Aparajith gave TN the much-needed breakthrough by dismissing Amit, Himachal needed 71 from 54 deliveries, but Rishi played his role to perfection, hammering the rival bowling attack to make it look easy in the end. Eyeing a record sixth title in the tournament and a limited-overs double this season, Tamil Nadu, who recently won the Syed Mushtaq Ali T20, were lacklustre on the field. Skipper Vijay Shankar made a blunder as he fumbled when he was presented a crucial run-out opportunity when Arora was on 113. Arora was also grassed by Jagdishan when he was on 135, with Himachal needing 18 in as many balls. \"The team has backed me throughout the tournament. I just wanted to play my natural game and built on my innings after I got set,\" said Man of the Match Arora. An elated Dhawan said: \"Finally we have won a title, it's the result of our hard work over the years. We knew the conditions well here and so we just to stay on there.\" Eyeing a maiden Vijay Hazare Trophy title, Himachal started strongly with a 60-run opening stand between Arora and Prashant Chopra (21 off 26 balls). But Tamil Nadu effected a double blow, dismissing Chopra, Digvijay Rangi (0) in a space of five balls to leave them at 61/2 in 9.3 overs. HP were then reduced to 96/3 in 16.1 overs with Murugan Ashwin dismissing Nikhil Gangta off his very first delivery. But the left-handed Arora remained calm, while Amit Kumar, coming ahead of skipper Rishi, played a perfect second fiddle. The left-right combination kept rotating the strike and snatched quick singles. Arora and Kumar slowly pulled the game out of Tamil Nadu's hands as they struggled to break the partnership. Arora was very strong square of the wicket and fine leg. Even fortune favoured Arora as he raced to 99 after getting a big outside edge off Sadeep Warrier, but an outstretched Karthik could hardly reach the ball. Earlier, Karthik's century and Shahrukh Khan's fantastic finishing -- 42 off 21 balls with three fours and three sixes -- propelled Tamil Nadu after they were 40 for four at one stage. Karthik struck eight fours and seven sixes. Baba Indrajith smashed 80 in 71 balls. Brief scores: Tamil Nadu: 314 all out in 49.4 overs (Dinesh Karthik 116, Baba Indrajith 80, Shahrukh Khan 42; Pankaj Jaswal 4/59, Rishi Dhawan 3/62) lost to Himachal Pradesh 299/4; 47.3 overs (Shubham Arora 136 not out, Amit Kumar 74, Rishi Dhawan 42 not out) by 11 runs (VJD Method after bad light suspended play). (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":null,"source_id":"business-standard"},{"title":"Here's How Fans Reacted After Pujara Was Dismissed For Golden Duck vs SA","link":"https://sports.ndtv.com/cricket/india-vs-south-africa-1st-test-cheteshwar-pujara-dismissed-for-golden-duck-heres-how-fans-reacted-2672535","keywords":null,"creator":null,"video_url":null,"description":"Ind vs SA 1st Test Day 1: Pujara hasn't scored a century in Test cricket since January 2019 and the pressure has been mounting on him as he hasn't been able to make big contributions with the bat off...","content":null,"pubDate":"2021-12-26 12:39:05","full_description":"Cheteshwar Pujara got off to the worst possible start in the Test series against South Africa as he was dismissed for a first-ball duck by Lungi Ngidi on day 1 of the first Test in Centurion. Coming in to bat after the fall of the first wicket of Mayank Agarwal (60), the stage was set for Pujara to consolidate the great start provided by Mayank and opening partner KL Rahul. The India number 3 though was not able to get going. Ngidi bowled a delivery outside the off stump line which came back a little bit after pitching and that movement got the inside edge of Pujara's bat, hit his thigh guard and lobbed up in the air. The catch was comfortable taken by Keegan Petersen placed at forward short leg and that brought an early end to Pujara's stay in the middle. Pujara hasn't scored a century in Test cricket since January 2019 and the pressure has been mounting on him as he hasn't been able to make big contributions with the bat off late. Known for his impeccable patience and consistency over the years, Pujara has managed to stay at the wicket for long but that hasn't translated into runs and this has been a big cause of concern for the Indian team management. Virat Kohli has kept faith in him for now but it won't be long before Pujara's place in the playing XI, just like that of Ajinkya Rahane, will start getting questioned. Promoted The dismissal left many Indian cricket fans disappointed and they expressed their feelings on Twitter. Here are a few reactions after Pujara's dismissal. Golden Duck for Cheteshwar Pujara Wasted a fine start gvien by openers in Grand Style #SAvIND pic.twitter.com/LsePmB7CTA Ohh pujara....he is occupying place nothing else as a senior player he need to understand that either you work on skills or leave the place Cheteshwar Pujara gets out for a golden duck for the second time in Test cricket - both times against South Africa at Centurion. The earlier one was a runout by Ngidi & today the bowler was Ngidi. #SAvIND cheteshwar pujara is finished in my book finished player It is time to say goodbye to Cheteshwar Pujara. He has been a gladiator for the Indian team but sadly he needs to make way for younger talents like Vihari and Iyer. That should be the end of Cheteshwar Pujara #Pujara #INDvsSA Man what is this ????‍♂️ Cheteshwar Pujara out for a golden duck and here begins our hectic part. India need to think about Cheteshwar Pujara's Test career now. #INDvsSA #Pujara #BCCI #IndiaSquad This was the 11th time Pujara was dismissed for a duck in Test cricket, the second time in three innings and first ever golden duck.","image_url":"https://c.ndtvimg.com/2021-12/bj960r98_pujara-afp-dismissal-vs-sa-_625x300_26_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Vijay Hazare Trophy Final: Himachal Pradesh beat Tamil Nadu to win maiden domestic title | Cricket News - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9uZXdzL3ZpamF5LWhhemFyZS10cm9waHktZmluYWwtaGltYWNoYWwtcHJhZGVzaC1iZWF0LXRhbWlsLW5hZHUtdG8td2luLW1haWRlbi1kb21lc3RpYy10aXRsZS9hcnRpY2xlc2hvdy84ODUwNjg0My5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Vijay Hazare Trophy Final: Himachal Pradesh beat Tamil Nadu to win maiden domestic title | Cricket News  Times of IndiaVijay Hazare Trophy 2021-22 Final Highlights, Himachal Pradesh vs Tamil Nadu: Shubham, Amit And Dhawan Fire  News18HP stun TN to clinch maiden Vijay Hazare title | Cricbuzz.com  CricbuzzRecent Match Report - Tamil Nadu vs H. Pradesh Final 2021/22  ESPNcricinfo.comVijay Hazare Trophy 2021 Final Highlights: Himachal Pradesh beat Tamil Nadu by 11 runs  India TV NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-26 12:34:00","image_url":null,"source_id":"google"},{"title":"Ashes 2021-2022: Joe Root surpasses Graeme Smith's record of Test runs in a calendar year","link":"https://www.indiatvnews.com/sports/cricket/ashes-2021-2022-joe-root-surpasses-graeme-smith-s-record-of-test-runs-in-a-calendar-year-751288","keywords":null,"creator":null,"video_url":null,"description":"England skipper Joe Root achieves another milestone by scoring most Test runs as captain in a calendar year, during Day 1 of the ongoing third Ashes Test against Australia at the Melbourne Cricket Ground as he surpasses former South Africa skipper Graeme Smith's record, here on Sunday.","content":null,"pubDate":"2021-12-26 12:29:53","full_description":"England skipper achieves another milestone by scoring most Test runs as captain in a calendar year, during Day 1 of the ongoing third Ashes Test against Australia at the Melbourne Cricket Ground as he surpasses former South Africa skipper Graeme Smith's record, here on Sunday. Root, with 1,680 runs, moved ahead of Smith, who had scored 1,656 runs as the captain of the Proteas in 2008. England captain's tally is also the third-highest by a player in a calendar year behind Pakistan's Mohammad Yousuf (1,788 runs in 2006) and former West Indies skipper Sir Vivian Richards (1,710 runs in 1976). The 30-year-old hit another half-century, but he fell soon after reaching the landmark. The right-hander wasn't pleased with the way he lost his wicket. Root needlessly hung the bat out to a ball from Mitchell Starc and opened up the face before edging it to wicketkeeper . After throwing his wicket, the skipper was livid and disappointed and his reaction summed up England's day so far. ' decision to bowl first on Boxing Day paid dividends as Australia bowled out England for just 185 in the third session on the opening day of the Boxing Day Test at the Melbourne Cricket Ground. After defeats in Brisbane and Adelaide, England trail the best-of-five series 2-0 and must win the Boxing Day Test to keep alive.","image_url":null,"source_id":"indiatvnews"},{"title":"Ashes 2021-22 Live Streaming: When and where to watch Australia vs England 3rd Test Day 2 Live Online","link":"https://www.indiatvnews.com/sports/cricket/ashes-2021-22-live-streaming-when-and-where-to-watch-australia-vs-england-3rd-test-day-2-live-online-751286","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2021-22 Live Streaming: When and where to watch Australia vs England 3rd Test Day 2 Live Online AUS vs ENG 3rd Test Live Australia showed their dominance with both bat and ball and were in a commanding position against England at the end of the opening day of the Boxing Day Test at the Melbourne Cricket Ground, here on Sunday. Marcus Harris (20 off 51) and Nathan Lyon (0 off 5) were unbeaten at the crease as Australia finished Day 1 of the third Test at 61/1, trailing by 124 runs. After bowling out England for 185 in their first innings, Australia began confidently and were cruising for the most part. With the pitch easing out, opener David Warner and Harris negotiated the initial overs expertly. The 35-year old Warner, in particular, was the aggressor of the two and hit some cracking boundaries as the pair soon brought up their fifty partnership.","content":null,"pubDate":"2021-12-26 12:28:53","full_description":null,"image_url":null,"source_id":"indiatvnews"},{"title":"ICC and David Gower pay tribute to ‘giant of English cricket’ Ray Illingworth","link":"https://uk.sports.yahoo.com/news/icc-david-gower-pay-tribute-121452971.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-26 12:14:52","image_url":null,"source_id":"yahoo"}]}