{"newsArray":[{"title":"Conway’s hilarious post game interveiw","link":"https://www.cairnspost.com.au/sport/cricket/conways-hilarious-post-game-interveiw/video/03bf04b9d6a916a13bc057b90a70ee02","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Adelaide Strikers star man Harry Conway have provided an all time great post game interveiw as his Strikers picked up a huge win over the Thunder.","content":null,"pubDate":"2022-01-23 20:32:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Conway’s hilarious post game interveiw","link":"https://www.news.com.au/sport/cricket/conways-hilarious-post-game-interveiw/video/03bf04b9d6a916a13bc057b90a70ee02","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Adelaide Strikers star man Harry Conway have provided an all time great post game interveiw as his Strikers picked up a huge win over the Thunder.","content":null,"pubDate":"2022-01-23 20:32:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"'What a joke': Cricket world erupts over BBL catch controversy","link":"https://au.sports.yahoo.com/bbl-2022-cricket-world-erupts-catch-controversy-202904754.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-23 20:29:04","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-01/9fae63e0-7c8a-11ec-b6ff-8fccfa18b741","source_id":"yahoo"},{"title":"WI vs ENG Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for England's tour of West Indies, Second T20I","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wi-vs-eng-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-england-s-tour-west-indies-second-t20i?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-23 19:14:44","full_description":"West Indies will take on England in the second T20I of the Three Lions' tour of the Caribbean at Kensington Oval in Bridgetown on Monday. There’s no end in sight to England’s miseries. Following the Ashes debacle in Australia where they lost 4-0, the English team suffered another defeat in the first T20I against West Indies. They came up against a fierce bowling performance and got bowled out for just 104 runs. England lost their first four wickets inside the powerplay itself and were never able to recover. West Indies will be high on confidence going into the second T20I with a 1-0 lead in the series. Their bowling unit was ruthless and Brandon King’s half-century sealed the win for them. They are always a difficult opposition to negotiate with on home soil. WI XI Brandon King, Shai Hope (wk), Nicholas Pooran, Darren Bravo, Kieron Pollard (c), Jason Holder, Fabian Allen, Odean Smith, Romario Shepherd, Akeal Hosein, Sheldon Cottrell ENG XI Jason Roy, Tom Banton, James Vince, Moeen Ali, Eoin Morgan (c), Sam Billings (wk), Liam Dawson / Liam Livingstone, Chris Jordan, Adil Rashid, Saqib Mahmood, Tymal Mills WI vs ENG, England’s Tour of West Indies, Second T20I Date and Time: January 24, 2022, 1:30 AM IST Venue: Kensington Oval, Bridgetown The track is known for assisting the seamers. Batters will need to be patient and pick the right shots. Although the boundaries are short here, it can be difficult negotiating with the bowlers. A score of 150 looks to be par on this wicket. Wicketkeeper Nicholas Pooran is a destructive white-ball batter who can take the game away from the opposition at a moment’s notice. Pooran has scored 873 runs in 50 T20Is at a strike rate of 126.71. Batters Brandon King played a responsible knock in the last game and led West Indies to victory. He remained unbeaten on 52 runs. Jason Roy got dismissed while playing a poor shot in the last game. There can be no doubts regarding his ability and he will be hoping for a measured knock here. All-rounders Jason Holder was the star of the show in the first game. He got the ball to swing well and ended up picking up four wickets for just seven runs in his 3.4 overs. Holder was chosen as the Player of the Match and will be a wise multiplier pick for this game as well. Moeen Ali was dismissed for a golden duck but his prowess in T20 cricket needs little introduction. It’s difficult to stop him once he gets going. Bowlers Sheldon Cottrell is a wicket-taking bowler who can get crucial breakthroughs. He got rid of Jason Roy and James Vince in the last game. Jason Holder (WI) – 138 points Sheldon Cottrell (WI) – 82 points Brandon King (WI) – 70 points Adil Rashid (END) – 58 points Shai Hope (WI) – 44 points Jason Holder: 4 wickets Brandon King: 52 runs Nicholas Pooran: 27 runs James Vince: 14 runs Jason Roy: 6 runs Fantasy Suggestion #1: Shai Hope, Nicholas Pooran, Sam Billings, Brandon King, James Vince, Jason Roy, Jason Holder, Moeen Ali, Adil Rashid, Sheldon Cottrell, Chris Jordan Captain: Jason Holder , Vice-Captain: Moeen Ali Fantasy Suggestion #2: Shai Hope, Nicholas Pooran, Brandon King, James Vince, Jason Roy, Jason Holder, Moeen Ali, Romario Shepherd, Adil Rashid, Sheldon Cottrell, Chris Jordan Captain: Brandon King , Vice-Captain: Jason Roy.","image_url":"https://static.sportskeeda.com/editor/2022/01/e097f-16429595126235-1920.jpg","source_id":"sportskeeda"},{"title":"\"He Did A Good Job\": Dravid Defends Rahul's Captaincy In ODI Series Loss","link":"https://sports.ndtv.com/cricket/ind-vs-sa-kl-rahul-did-a-good-job-as-india-captain-says-rahul-dravid-after-odi-series-loss-to-south-africa-2725718","keywords":null,"creator":null,"video_url":null,"description":"India's head coach Rahul Dravid on Sunday admitted that his team didn't play \"smart cricket at crucial times\" but backed the beleaguered KL Rahul to get better as a leader in coming days.","content":null,"pubDate":"2022-01-23 18:30:12","full_description":"India's head coach Rahul Dravid on Sunday admitted that his team didn't play \"smart cricket at crucial times\" but backed the beleaguered KL Rahul to get better as a leader in coming days. India lost both the Test and ODI series in what turned out to be a disastrous tour of South Africa despite a bright start in the opening Test at Centurion, which the team won comprehensively. \"He did a good job. It's not easy to end on wrong side of the result,\" Dravid said when asked how he found Rahul as a leader, having lost all four games that he captained on tour. \"He is just starting out and I think he did a very decent job. He will constantly get better as he captains,\" the head coach batted for the young skipper. Dravid felt that \"execution of skills\" was lacking in all the three ODIs that India lost. The series, according to Dravid, is a \"good eye opener\" but there is still a lot of time before the 2023 ODI World Cup, and India should be getting better in the near future. \"This is a good eye opener but we haven't played a lot of ODI cricket. We last played against England in March (after that second string side played against Lanka under Dravid's coaching). We will play a lot of white ball cricket before next year's World Cup.\" Dravid accepted that the Indian ODI team for the series didn't have the kind of balance required although he agreed that one can try and start looking at the template. \"The guys who play at 6, 7, and 8 weren't available for selection and when they come back, the side will have a slightly different look,\" he said. Promoted He agreed that till the 30th over in both the chases, they were in the game before some of the batters played poor shots. \"We didn't play smart cricket at crucial times,\" he added.","image_url":"https://c.ndtvimg.com/2022-01/pf7s8a4_kl-rahul-afp_625x300_24_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Weekly Digest (January 17-23): COVID mars India's Women's Asian Cup campaign, India men's cricket team humbled in South Africa","link":"https://sportstar.thehindu.com/other-sports/weekly-sports-digest-news-indian-womens-football-team-covid-cases-india-loses-to-south-africa-aus-open-nadal-djokovic-subhash-bhowmick-sindhu-ipl-ashes-sports-news/article38314844.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"From the Indian women's football team withdrawing its game against Chinese Taipei in the AFC Women's Asian Cup due to a COVID cluster in the team to the Indian men's cricket team's 3-0 loss to South Africa in the ODI series, here are the top sporting headlines from the week gone by.","content":null,"pubDate":"2022-01-23 17:45:36","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"“Disastrous tour for India”: Twitter reactions on South Africa whitewashing India 3-0 in ODI series","link":"https://thesportsrush.com/cricket-news-disastrous-tour-for-india-twitter-reactions-on-south-africa-whitewashing-india-3-0-in-odi-series/","keywords":["Cricket","deepak chahar","India","India tour of South Africa 2021-22","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"South Africa whitewashing India: India have been undone for the third time in a row in the recently concluded ODI series. During the third ODI of the ongoing India’s tour of South Africa in Cape Town, South Africa beat India by 4 runs to win the series 3-0 in an emphatic manner. The development has… The post “Disastrous tour for India”: Twitter reactions on South Africa whitewashing India 3-0 in ODI series appeared first on The SportsRush.","content":"South Africa whitewashing India: India have been undone for the third time in a row in the recently concluded ODI series. During the third ODI of the ongoing India’s tour of South Africa in Cape Town, South Africa beat India by 4 runs to win the series 3-0 in an emphatic manner. The development has resulted in India losing five matches in a row after starting this tour with a historic Test victory in Centurion. Chasing a 288-run target, India were provided a solid foundation by veteran batter Shikhar Dhawan (61) and former captain Virat Kohli (65) who put together a 98-run partnership for the second wicket. Staring with South Africa all-rounder Andile Phehlukwayo dismissing Dhawan and wicket-keeper batter Rishabh Pant (0) in the same over, India started to lose wickets frequently to nullify all progress made by Dhawan and Kohli. Playing his first match of the tour, batter Suryakumar Yadav scored an eye-catching 39 (32) with the help of four fours and a six to keep his team in the match. Having said that, it was pacer Deepak Chahar’s second ODI half-century which gave India high chances of sealing a tense chase. Coming in to bat at No. 7 in the 38th over with the team needing 93 off 77 balls, Chahar single-handedly turned the tables by scoring a stroke-filled 54 (34) with the help of five fours and two sixes. It was on the first delivery of the 48th over when Chahar mis-timed an aerial shot to get out at a crunch situation. Lack of batting depth among their last three batters was highlighted when the visitors failed to score 10 runs off 17 deliveries today. Asked to bat first by India captain Lokesh Rahul (9), South Africa had posted 287/10 in 49.5 overs this morning. It was a 144-run partnership for the fourth wicket between wicket-keeper batter Quinton de Kock (124) and batter Rassie van der Dussen (52) which played a crucial role behind the hosts’ success at the Newlands on Sunday. Twitter reactions on South Africa whitewashing India: Disastrous tour for India. After winning first Test handsomely, team went into a massive slump, losing 5 matches on the trot across two formats. There hasn’t been a poorer performance in years. Hard introspection and harsh decisions needed — Cricketwallah (@cricketwallah) January 23, 2022 Always remember, South Africa defeated this Indian team without their frontline pace attack. Incredible achievement. Cleansweep 3-0.#SAvIND — Subhayan Chakraborty (@CricSubhayan) January 23, 2022 Despite all that pre-tour and during-tour captaincy drama, if someone had said India would lose 5 out of 6 matches in South Africa, you would have probably laughed at them. But, hey! #SAvInd — Chetan Narula (@chetannarula) January 23, 2022 — Official Lucknow IPL Team (@TeamLucknowIPL) January 23, 2022 India’s ODI record since the start of 2020: P 15, W 5, L 10. This sorry run includes series defeats in NZ, AUS, SA. Desperately need to change their ODI template, even in a year that is not that important for them since they’ve automatically qualified for the 2023 CWC. #INDvSA — Jamie Alter (@alter_jamie) January 23, 2022 For more cricket-related news, click here. The post “Disastrous tour for India”: Twitter reactions on South Africa whitewashing India 3-0 in ODI series appeared first on The SportsRush.","pubDate":"2022-01-23 17:09:59","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“Waiting for King Kohli hundred”: Mohammad Amir twitter reaction on Virat Kohli’s 71st International century anticipation","link":"https://thesportsrush.com/cricket-news-waiting-for-king-kohli-hundred-mohammad-amir-twitter-reaction-on-virat-kohlis-71st-international-century-anticipation/","keywords":["Cricket","Mohammad Amir","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Mohammad Amir twitter reaction came after Virat Kohli brought up his 64th ODI half-century during the 3rd ODI against South Africa. During the 3rd One-Day International between India and South Africa at the Newlands Cricket Stadium in Cape Town, star Indian batter Virat Kohli notched up his 64th ODI half-century. This was Kohli’s 6th ODI score of fifty… The post “Waiting for King Kohli hundred”: Mohammad Amir twitter reaction on Virat Kohli’s 71st International century anticipation appeared first on The SportsRush.","content":"Mohammad Amir twitter reaction came after Virat Kohli brought up his 64th ODI half-century during the 3rd ODI against South Africa. During the 3rd One-Day International between India and South Africa at the Newlands Cricket Stadium in Cape Town, star Indian batter Virat Kohli notched up his 64th ODI half-century. This was Kohli’s 6th ODI score of fifty runs and above in the last 8 One-Day Internationals. Such has been the yardstick that the 33-year-old former India skipper has set for himself, that any score less than a century is viewed as his lean patch of form. Having said that, Kohli and his fans have been desperately waiting for his much elusive 71st International century; with the last one coming back in November 2019. Pakistani pacer Mohammad Amir too, has time and again expressed respect for his rival cum fan on social media, and he yet again took to his Twitter handle to type out a similar sentiment while waiting in anticipation for his International hundred. Mohammad Amir twitter reaction The 29-year-old took to his Twitter handle a few minutes post Kohli brought up his 64th ODI hundred, and his second in the ongoing 3-match ODI series against South Africa. The left-arm pacer took a snap when Kohli was batting on 60 off 74 deliveries, and posted it with the caption- “Waiting for King Kohli hundred”. Kohli, however, a few minutes later, was dismissed by the Proteas left-arm spinner Keshav Mahraj for the second consecutive time in the series at the score of 65 off 84 deliveries. waiting for king @imVkohli hundred pic.twitter.com/6KjBegDvrQ — Mohammad Amir (@iamamirofficial) January 23, 2022 Post Kohli’s dismissal, India lost the wickets of Shreyas Iyer and Suryakumar Yadav within a span of two Overs to again lost the plot in what was appearing to be a clinical chase with India playing an extra batter at the cost of two all-rounders. The post “Waiting for King Kohli hundred”: Mohammad Amir twitter reaction on Virat Kohli’s 71st International century anticipation appeared first on The SportsRush.","pubDate":"2022-01-23 17:00:58","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Raj Angad Bawa, the southpaw from Yuvraj style of cricket","link":"https://sportstar.thehindu.com/cricket/icc-u19-world-cup-raj-angad-bawa-record-shikhar-dhawan-cricket-yuvraj-singh-news/article38315183.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Youngster Raj, who registered the highest score by an Indian in the ICC U-19 World Cup game against Uganda, had no clue about the record.","content":null,"pubDate":"2022-01-23 16:58:36","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"'Unbelievable' - Tahir hails young South Africa's success over India","link":"https://sportstar.thehindu.com/cricket/unbelievable-tahir-hails-young-south-africas-success-over-india/article38314946.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Tahir scored an unbeaten 52 off 19 balls in Asian Lions' win over India Maharajas in the ongoing Legends League Cricket.","content":null,"pubDate":"2022-01-23 16:11:43","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Anushka Sharma daughter face: Daughter of Virat Kohli and Anushka Sharma celebrates father’s half-century at Newlands","link":"https://thesportsrush.com/cricket-news-anushka-sharma-daughter-face-daughter-of-virat-kohli-and-anushka-sharma-celebrates-fathers-half-century-at-newlands/","keywords":["Cricket","anushka sharma","India","south africa vs india","Vamika Kohli","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Anushka Sharma daughter face: Virat Kohli’s 64th half-century was accompanied by the shutterbugs capturing his wife and daughter together. During the 3rd One-Day International between India and South Africa at the Newlands Cricket Stadium in Cape Town, star Indian batter Virat Kohli notched up his 64th ODI half-century to place India in a position of… The post Anushka Sharma daughter face: Daughter of Virat Kohli and Anushka Sharma celebrates father’s half-century at Newlands appeared first on The SportsRush.","content":"Anushka Sharma daughter face: Virat Kohli’s 64th half-century was accompanied by the shutterbugs capturing his wife and daughter together. During the 3rd One-Day International between India and South Africa at the Newlands Cricket Stadium in Cape Town, star Indian batter Virat Kohli notched up his 64th ODI half-century to place India in a position of strength en route the score of 287/10 posted by South Africa. The half-century moment came off the 5th delivery of the 25th Over bowled by Proteas all-rounder Andile Phehlukwayo, after Kohli drove a full delivery outside the off-stump towards the sweeper cover for a single. What followed post the single was a beautiful moment to savour for every Virat Kohli fan, as their former skipper brought out a cradle celebration, while looking at his wife-cum-actor Anushka Sharma and their daughter Vamika Kohli. The star husband-wife duo have up till now shied away from revealing their daughter’s face before the media and public gaze; but Anushka finally decided to bring herself with her baby girl in her arms to applaud what was a fine knock from Kohli yet again. However, the 33-year-old’s knock could not last much longer, as a leading edge off a quicker delivery bowled by Proteas spinner Keshav Maharaj was pouched comfortable by skipper Temba Bavuma at the Cover region. Anushka Sharma daughter face 5⃣0⃣ for Virat Kohli #SAvIND pic.twitter.com/kQUx0Ae0OK — Doordarshan Sports (@ddsportschannel) January 23, 2022 Beautiful moment for Virat Kohli as a father.pic.twitter.com/2DeNNm0Xjc — Johns. (@CricCrazyJohns) January 23, 2022 How Twitterati reacted on Vamika Kohli cheering for Virat Kohli OMG Cutest picture on the internet today #VamikaKohli Her face is exactly the Xerox copy of his dad @imVkohli pic.twitter.com/FkLrI3douo — Tamil Viratians (@Tamil_Viratians) January 23, 2022 OMG Virat-Anushka’s daughter’s first TV appearance is it? She looks like a carbon copy of her father! #INDvSA — Sohini M. (@Mittermaniac) January 23, 2022 Genes! https://t.co/NMrHota9KC — Sohini M. (@Mittermaniac) January 23, 2022 Finally face reveal of Vamika #Vamika #Kohli #Anushka pic.twitter.com/CfwH5FpRG5 — Aryaveer Sharma (@AryaveerSharma3) January 23, 2022 Gimpleses of #vamika #ViratKohli #vamikakohli#INDvsSA pic.twitter.com/rgL5YUwtAi — श्रेया राजपूत (@Kshtrani__) January 23, 2022 Daughter clapping for your success , best thing one can experience , Happy for Kohli pic.twitter.com/XbeQNn2RTK — “ (@KohlifiedGal) January 23, 2022 For more Cricket related news, click here. The post Anushka Sharma daughter face: Daughter of Virat Kohli and Anushka Sharma celebrates father’s half-century at Newlands appeared first on The SportsRush.","pubDate":"2022-01-23 15:48:37","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"SA vs IND LIVE Score, 3rd ODI Updates: SKY, Iyer rebuild after Kohli dismissal - Sportstar","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vc3BvcnRzdGFyLnRoZWhpbmR1LmNvbS9jcmlja2V0L2luZC12cy1zYS1pbmRpYS12cy1zb3V0aC1hZnJpY2EtM3JkLW9kaS1saXZlLXNjb3JlL2FydGljbGUzODMxMzAzNi5lY2XSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SA vs IND LIVE Score, 3rd ODI Updates: SKY, Iyer rebuild after Kohli dismissal  SportstarIndia vs South Africa 3rd ODI Live Score Updates: Maharaj removes set Kohli as India wobble in 288 chase  Times of IndiaRecent Match Report - South Africa vs India 3rd ODI 2021/22  ESPNcricinfoIND vs SA Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of South Africa, 3rd ODI  Cricket AddictorLIVE IND vs SA 3rd ODI Score: Kohli-Dhawan Bring Up 50 Partnership, India Need 218 Runs More  India.comView Full coverage on Google News","content":null,"pubDate":"2022-01-23 15:20:39","image_url":null,"source_id":"google"},{"title":"Anushka Sharma daughter video: Virat Kohli’s 64th ODI half-century gets cheered by Anushka Sharma and daughter Vamika","link":"https://thesportsrush.com/anushka-sharma-daughter-video-virat-kohlis-64th-odi-half-century-gets-cheered-by-anushka-sharma-and-daughter-vamika/","keywords":["Cricket","Videos","anushka sharma","India","India tour of South Africa 2021-22","South Africa","Vamika Kohli","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Anushka Sharma daughter video: The former Indian captain was cheered by his wife and daughter at the Newlands today. During the third ODI of the ongoing India’s tour of South Africa in Cape Town, former India captain Virat Kohli has scored his 64th ODI half-century. Coming in to bat at his usual batting position of… The post Anushka Sharma daughter video: Virat Kohli’s 64th ODI half-century gets cheered by Anushka Sharma and daughter Vamika appeared first on The SportsRush.","content":"Anushka Sharma daughter video: The former Indian captain was cheered by his wife and daughter at the Newlands today. During the third ODI of the ongoing India’s tour of South Africa in Cape Town, former India captain Virat Kohli has scored his 64th ODI half-century. Coming in to bat at his usual batting position of No. 3 in the fifth over, Kohli shuffled across towards his off-stump to play a glorious flick off the first delivery he faced by Lungi Ngidi for a boundary. Kohli, who has both been beaten and has played and miss at Newlands today, is still looking in sublime touch en route to an elusive 71st international century. If the right-hand batter manages to reach the three-figure mark, it will be for the first time since November 2019 at the highest level. Kohli, who played a second fiddle in a 98-run partnership for the second wicket alongside veteran opening batter Shikhar Dhawan (61), will have to do heavy lifting for the rest of the innings especially after India have lost Dhawan and wicket-keeper batter Rishabh Pant (0) in the same over. It was on the penultimate delivery of the 25th over that Kohli ran a single South Africa all-rounder Andile Phehlukwayo to complete his half-century. Kohli’s innings was celebrated by wife and actor Anushka Sharma and daughter Vamika Kohli from the stands which ended up becoming a source of amazement for fans. Anushka Sharma daughter video Looking so cute.. #Vamika #Anushka pic.twitter.com/1JmeoWqyJK — Abitha YN (@AbithaYn) January 23, 2022 Baby #Vamika pic.twitter.com/jAkBAL6oGs — Denish (@turu_tweets) January 23, 2022 Twitter reactions on Virat Kohli daughter cheering for him: Virat Kohli’s daughter Vamika Kohli spotted. She looks like her father #vamika #INDvSA #ViratKohli #daughter #Anushka pic.twitter.com/vL8D5MTRkf — Ananya (@ananya___d) January 23, 2022 Vamika is Happy as his daddy reached to fifty pic.twitter.com/YiNURXiuaz — A N K I T (@Ankitaker) January 23, 2022 % Kings daughter #vamika #INDvsSAF pic.twitter.com/YB5PDSu5kq — Nishant (@Nishant1404) January 23, 2022 Ok, She’s here 50 up for Kohli.#Vamika#SAvIND pic.twitter.com/zay7uTqZd2 — Royal Challengers Bangalore FC (@rcbFCtweets) January 23, 2022 For more cricket-related news, click here. The post Anushka Sharma daughter video: Virat Kohli’s 64th ODI half-century gets cheered by Anushka Sharma and daughter Vamika appeared first on The SportsRush.","pubDate":"2022-01-23 15:15:10","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“I would have not even married”: Shoaib Akhtar reckons Virat Kohli’s marriage as the reason for downfall in batting form","link":"https://thesportsrush.com/cricket-news-i-would-have-not-even-married-shoaib-akhtar-reckons-virat-kohlis-marriage-as-the-reason-for-downfall-in-batting-form/","keywords":["Cricket","Shoaib Akhtar","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shoaib Akhtar reckons Virat Kohli’s marriage has led to latter’s lapse of concentration and thereby has resulted in his dip of batting form. Team India’s star batter Virat Kolhi has become a hot topic point in the Cricketing fraternity. While his decision to quit Test captaincy had raised quite a many eyebrows, his elusive 71st… The post “I would have not even married”: Shoaib Akhtar reckons Virat Kohli’s marriage as the reason for downfall in batting form appeared first on The SportsRush.","content":"Shoaib Akhtar reckons Virat Kohli’s marriage has led to latter’s lapse of concentration and thereby has resulted in his dip of batting form. Team India’s star batter Virat Kolhi has become a hot topic point in the Cricketing fraternity. While his decision to quit Test captaincy had raised quite a many eyebrows, his elusive 71st International century have led to people debating and discussing around the reasons for the same. However, former Pakistani pacer Shoaib Akhtar has come up with a strange reason altogether for Kohli’s rough patch of form. As per Akhtar, it is the pressure of marriage and the responsibilities that come with it, that has had a detrimental effect on the star batter’s game. Moreover, the 46-year-old was also of the view that it had been better of if Kolhi was not made the captain of the Indian Cricket team at all, and that he would have just liked him to keep piling on runs for himself, his team, and his countless fans without any additional pressure. Ravi Shastri tells me Virat Kohli could have carried on for at least two more years as Test captain but India would have won a lot of Tests at home and a lot of people would have not been able to digest his success. #ViratKohli — Rahul Rawat (@rawatrahul9) January 23, 2022 Shoaib Akhtar reckons Virat Kohli’s marriage could have waited During an interaction with Dainik Jagran, Akhtar remarked “I would have not even married if I were in his place. I had just scored runs and enjoyed cricket; these 10-12 years of cricket are different time and doesn’t come again. I am not saying getting married is wrong but If you are playing for India, you would have enjoyed a time a little. Fans are crazy about Kohli and he had to maintain that love he is getting for the last 20 years.” The Pakistani legend also admitted and maintained that the pressure of marriage does affect a player’s game. “There is pressure from the children, of the family. As the responsibility increases, so does the pressure. Cricketers have a short career span of 14-15 years in which you stay at the peak for five-six years. Those years of Virat have passed, now he has to struggle. “As a captain, you have to think a lot. I am not against marriage but I believe play while playing, there shouldn’t be much pressure, play freely, pick up your things and play fiercely. I got married when I retired from the captain. As a captain, you have to face the media, the brand, all the things which come with it,” he further added. The post “I would have not even married”: Shoaib Akhtar reckons Virat Kohli’s marriage as the reason for downfall in batting form appeared first on The SportsRush.","pubDate":"2022-01-23 15:03:02","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"The early years and origins of baseball","link":"https://www.pinstripealley.com/2022/1/23/22896471/mlb-yankees-baseball-origins-abner-doubleday-myth-town-ball-stoolball-rounders-england","keywords":null,"creator":["John Griffin"],"video_url":null,"description":null,"content":"Photo by © CORBIS/Corbis via Getty Images The modern game of baseball can trace its ancestry back into Medieval England, but not Abner Doubleday. The story of baseball’s origins is pretty simple. In 1839 in the city of Cooperstown, New York, Abner Doubleday developed the game of baseball, with the first game being held there according to the rules and regulations set down by the future Union general. From there, the game spread throughout the country, and when the Major League Baseball Hall of Fame was established in the 1930s, the sport’s birthplace was the natural location for it. It’s a nice story, but it’s just that — a story. There’s actually no real evidence that Abner Doubleday invented the game of baseball at all. For starters, he wasn’t even in Cooperstown in 1839, but rather was at West Point. No records, written or otherwise, from in or around Cooperstown have even a passing mention of “base ball,” nor is there any significant record of the sport in Doubleday’s own personal writings. When the Civil War general died in 1893, his obituary did not mention the sport at all. So how did a random general end up being credited as the inventor of America’s national pastime? Based on the testimony of one man — Abner Graves, who was five years old in 1839 — a National League commission declared Doubleday to be the sport’s inventor in 1908; the reason for this seems to be a desire to reject other proposed origins that would give baseball an English origin in favor of one that made it entirely American. If Abner Doubleday is not responsible for the creation of baseball, where did it truly begin? Well, answering that question is a bit complicated. Very little documentation exists for early bat and ball games, the predecessors to baseball and cricket, for the twofold reasons that they were primarily games of the lower classes and they were often banned by overbearing Puritan governments attempting to legislate the leisure activities of these lower classes. From what little references we do have, these sports were united by the concept of a “pitcher” throwing something that the “hitter” attempted to hit with something vaguely resembling a bat, although regional variations differed in what the pitcher threw, what happened after the batter hit it, how points were scored, and what everything was called in the first place. Many of them, at one time or another, was referred to as “base ball,” even if they had absolutely no relation to the modern sport that bears its name. The first major bat and ball game, which has become known as stoolball, dates back to at least the 15th century (and possibly as early as the 11th), and has its origins in Sussex, England. In stoolball, one player attempts to hit an object (typically either a tree stump or church pew, but whatever was handy could suffice) with a ball, while another player attempted to defend the object, originally with a bare hand, then with a bat-like object. If the ball hit the object, the batter was out. If not, then, depending on regional variation, he either immediately scored a point or had to run to another object to score (like in cricket) or around a series of objects (like in baseball). Associated in literature with churches and the Easter season, stoolball spread throughout the British isles, eventually coming to North America during the colonial era. Within England, stoolball evolved in some capacity into a game known as rounders. Called “base-ball” in 1744’s children book A Little Pretty Pocket-Book —the first reference we have to the name in print — rounders appears to be the first documented case of a bat and ball sport played on a diamond with four bases, and has been played in England since the latter half of the 15th century. The sport has many similarities to baseball, with nine players including a “bowler”. The batter would attempt to hit a “good ball” with a bat and circle the bases, which were arranged in the shape of a square. Unlike in baseball, however, batters had to run whether they hit the ball or not, and there is no foul territory (although the batter cannot advance past the first base if he hits the ball into foul territory). It appears likely that stoolball and rounders evolved into what appears to be baseball’s immediate predecessor, town ball. Even within the loosely-defined early bat and ball games, town ball is a bit of an enigma, for although it developed in cities in the Northeastern United States during the latter third of the 1700s and first half of the 1800s, most records that we have about the game are personal recollections of the game decades later. The one that appears to be baseball’s predecessor involved the general layout of the baseball diamond that we have today, with the exception that the batter did not stand at home plate, but halfway between home plate and first base. Additionally, depending on regional variation, you retired a runner either by striking him with the ball (e.g., in modern schoolyard kickball) or by throwing the ball through the basepath in front of him. Innings took on the form of either one-out-all-out or all-out-all-out, the former requiring one batter retired to end the end, while the latter needed every batter to be. From 1830 to 1860, we have records of the Olympic Ball Club based in Philadelphia, Pennsylvania, that appeared to have played their own version of town ball for thirty years. In Philadelphia town ball, every single plate appearance was either a home run or an out, with the bases not being the safe havens that they were in other variants of the sport. In 1860, however, they adopted the “New York rules,” as part of town ball becoming subsumed into the variant that became the modern game of baseball.","pubDate":"2022-01-23 15:00:00","full_description":"The story of baseball’s origins is pretty simple. In 1839 in the city of Cooperstown, New York, Abner Doubleday developed the game of baseball, with the first game being held there according to the rules and regulations set down by the future Union general. From there, the game spread throughout the country, and when the Major League Baseball Hall of Fame was established in the 1930s, the sport’s birthplace was the natural location for it. It’s a nice story, but it’s just that — a story. There’s actually no real evidence that Abner Doubleday invented the game of baseball at all. For starters, he wasn’t even in Cooperstown in 1839, but rather was at West Point. No records, written or otherwise, from in or around Cooperstown have even a passing mention of “base ball,” nor is there any significant record of the sport in Doubleday’s own personal writings. When the Civil War general died in 1893, his obituary did not mention the sport at all. So how did a random general end up being credited as the inventor of America’s national pastime? Based on the testimony of one man — Abner Graves, who was five years old in 1839 — a National League commission declared Doubleday to be the sport’s inventor in 1908; the reason for this seems to be a desire to reject other proposed origins that would give baseball an English origin in favor of one that made it entirely American. If Abner Doubleday is not responsible for the creation of baseball, where did it truly begin? Well, answering that question is a bit complicated. Very little documentation exists for early bat and ball games, the predecessors to baseball and cricket, for the twofold reasons that they were primarily games of the lower classes and they were often banned by overbearing Puritan governments attempting to legislate the leisure activities of these lower classes. From what little references we do have, these sports were united by the concept of a “pitcher” throwing something that the “hitter” attempted to hit with something vaguely resembling a bat, although regional variations differed in what the pitcher threw, what happened after the batter hit it, how points were scored, and what everything was called in the first place. Many of them, at one time or another, was referred to as “base ball,” even if they had absolutely no relation to the modern sport that bears its name. The first major bat and ball game, which has become known as stoolball, dates back to at least the 15th century (and possibly as early as the 11th), and has its origins in Sussex, England. In stoolball, one player attempts to hit an object (typically either a tree stump or church pew, but whatever was handy could suffice) with a ball, while another player attempted to defend the object, originally with a bare hand, then with a bat-like object. If the ball hit the object, the batter was out. If not, then, depending on regional variation, he either immediately scored a point or had to run to another object to score (like in cricket) or around a series of objects (like in baseball). Associated in literature with churches and the Easter season, stoolball spread throughout the British isles, eventually coming to North America during the colonial era. Within England, stoolball evolved in some capacity into a game known as rounders. Called “base-ball” in 1744’s children book A Little Pretty Pocket-Book —the first reference we have to the name in print — rounders appears to be the first documented case of a bat and ball sport played on a diamond with four bases, and has been played in England since the latter half of the 15th century. The sport has many similarities to baseball, with nine players including a “bowler”. The batter would attempt to hit a “good ball” with a bat and circle the bases, which were arranged in the shape of a square. Unlike in baseball, however, batters had to run whether they hit the ball or not, and there is no foul territory (although the batter cannot advance past the first base if he hits the ball into foul territory). It appears likely that stoolball and rounders evolved into what appears to be baseball’s immediate predecessor, town ball. Even within the loosely-defined early bat and ball games, town ball is a bit of an enigma, for although it developed in cities in the Northeastern United States during the latter third of the 1700s and first half of the 1800s, most records that we have about the game are personal recollections of the game decades later. The one that appears to be baseball’s predecessor involved the general layout of the baseball diamond that we have today, with the exception that the batter did not stand at home plate, but halfway between home plate and first base. Additionally, depending on regional variation, you retired a runner either by striking him with the ball (e.g., in modern schoolyard kickball) or by throwing the ball through the basepath in front of him. Innings took on the form of either one-out-all-out or all-out-all-out , the former requiring one batter retired to end the end, while the latter needed every batter to be. From 1830 to 1860, we have records of the Olympic Ball Club based in Philadelphia, Pennsylvania, that appeared to have played their own version of town ball for thirty years. In Philadelphia town ball, every single plate appearance was either a home run or an out, with the bases not being the safe havens that they were in other variants of the sport. In 1860, however, they adopted the “New York rules,” as part of town ball becoming subsumed into the variant that became the modern game of baseball.","image_url":null,"source_id":"pinstripealley"},{"title":"India vs South Africa Live Score, 3rd ODI Updates: Dhawan, Kohli Build For India After Early Wicket - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiyQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtc291dGgtYWZyaWNhLTIwMjItM3JkLW9kaS1saXZlLWNyaWNrZXQtc2NvcmUtY2FwZS10b3duLWluZC12cy1zYS1saXZlLXN0cmVhbWluZy1tYXRjaC11cGRhdGVzLXdhdGNoLW9ubGluZS1sYXRlc3QtbWF0Y2gtY29tbWVudGFyeS1saXZlbmV3cy00Njg5MTczLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa Live Score, 3rd ODI Updates: Dhawan, Kohli Build For India After Early Wicket  News18India vs South Africa 3rd ODI Live Score Updates: Shikhar Dhawan, Virat Kohli steady India in 288 chase  Times of IndiaIND vs SA Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of South Africa, 3rd ODI  Cricket AddictorLIVE IND vs SA 3rd ODI Score: Kohli-Dhawan Bring Up 50 Partnership, India Need 218 Runs More  India.comIndia vs South Africa: Visitors convoluted batting approach is the reason for shock series loss  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-01-23 14:27:12","image_url":null,"source_id":"google"},{"title":"Most catches in international cricket: Full list of players with most ODI catches","link":"https://thesportsrush.com/cricket-news-most-catches-in-international-cricket-full-list-of-players-with-most-odi-catches/","keywords":["Cricket","adam gilchrist","Kumar Sangakkara","Mahela Jayawardene","Mark Boucher","MS Dhoni","Ricky Ponting","Ross Taylor"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Most catches in international cricket: Some of the great batters in cricket have also secured their positions in fielding records. For some strange reason, fielding records aren’t celebrated as much as batting and bowling records in cricket. A large majority of passionate cricket fans, who are mostly up to date about batting and bowling records,… The post Most catches in international cricket: Full list of players with most ODI catches appeared first on The SportsRush.","content":"Most catches in international cricket: Some of the great batters in cricket have also secured their positions in fielding records. For some strange reason, fielding records aren’t celebrated as much as batting and bowling records in cricket. A large majority of passionate cricket fans, who are mostly up to date about batting and bowling records, are found wanting when it comes to fielding records in the sport. Fielding, a job in cricket which each player has to perform irrespective of primary skill (batting or bowling), more often than not falls in the category of a thankless task. Having said that, the skill has it in it to turn the tables on a cricket field for a match situation can easily be affected if a fielder grabs a breathtaking catch or drops a sitter. While batters don’t have to depend on anyone for scoring runs on a cricket field, the nature of the sport is such that bowlers are always depending on fielders expecting them to grab all the catches that come their way. Hence, increasing the role and importance of a fielder in cricket. Most catches in international cricket Former Sri Lanka captain Mahela Jayawardene, former Australia captain Ricky Ponting and former New Zealand captain Ross Taylor are present in the lists of most catches in both international cricket in ODIs. As far as wicket-keepers are concerned, former South Africa wicket-keeper Mark Boucher, former Australia wicket-keeper Adam Gilchrist, former India captain Mahendra Singh Dhoni and former Sri Lanka captain Kumar Sangakkara are the common names in both the lists. As a fielder Player Matches Innings Catches Max Mahela Jayawardene (SL/Asia) 652 768 440 4 Ricky Ponting (AUS/ICC) 560 717 364 3 Ross Taylor (NZ) 447 543 348 4 Jacques Kallis (SA/Afr/ICC) 519 664 338 4 Rahul Dravid (IND/Asia/ICC) 509 571 334 4 As a wicket-keeper Player Matches Innings Catches Max Mark Boucher (SA/Afr/ICC) 467 596 952 6 Adam Gilchrist (AUS/ICC) 396 485 813 6 MS Dhoni (IND/Asia) 538 608 634 6 Ian Healy (AUS) 287 392 560 6 Kumar Sangakkara (SL/Asia/ICC) 594 499 539 5 Most ODI catches As a fielder Player Matches Innings Catches Max Mahela Jayawardene (Asia/SL) 448 443 218 4 Ricky Ponting (AUS/ICC) 375 372 160 3 Mohammed Azharuddin (IND) 334 332 156 4 Sachin Tendulkar (IND) 463 456 140 4 Ross Taylor (NZ) 233 229 139 4 As a wicket-keeper Player Matches Innings Catches Max Adam Gilchrist (AUS/ICC) 287 281 417 6 Mark Boucher (SA/Afr/ICC) 295 290 402 6 Kumar Sangakkara (SL/Asia/ICC) 404 353 383 4 MS Dhoni (IND/Asia) 350 345 321 5 Brendon McCullum (NZ) 260 183 227 5 The post Most catches in international cricket: Full list of players with most ODI catches appeared first on The SportsRush.","pubDate":"2022-01-23 14:25:01","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Watch: Bowler Imran Tahir Stuns Fans With Explosive Batting Knock Against India Maharajas In Legends.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2Jvd2xlci1pbXJhbi10YWhpci1zdHVucy1mYW5zLXdpdGgtZXhwbG9zaXZlLWJhdHRpbmcta25vY2stYWdhaW5zdC1pbmRpYS1tYWhhcmFqYXMtaW4tbGVnZW5kcy1sZWFndWUtY3JpY2tldC13YXRjaC0yNzI1MzIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Bowler Imran Tahir Stuns Fans With Explosive Batting Knock Against India Maharajas In Legends..  NDTV SportsWATCH: Imran Tahir smokes 5 sixes, smashes 19-ball 52; Jonty Rhodes, Daren Sammy celebrate epic win over India Maharajas  Hindustan TimesLegends League Cricket 2022: Imran Tahir runs the show as he leads Giants to win over Maharajas  The twelfth Man TimesTwitter Reactions: Naman Ojha’s 140 goes in drain as finisher Imran Tahir wins it for World Giants  CricTrackerIndia Maharajas vs World Giants HIGHLIGHTS, Legends League Cricket: Imran Tahir fifty powers Giants to sensational win over India  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-01-23 13:47:01","image_url":null,"source_id":"google"},{"title":"Ramesh Powar defends Women's World Cup 2022 squad selection","link":"https://sportstar.thehindu.com/cricket/mithali-raj-ramesh-powar-womens-world-cup-squad-2022-shikha-pandey-jemimah-cricket/article38314152.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Asked about the omission of experienced fast bowler Shikha Pandey and batter Jemimah Rodrigues, India women's cricket team head coach Powar stated that players were picked based on their current performances and consistency.","content":null,"pubDate":"2022-01-23 13:24:04","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"\"Let's See\": Mithali Raj On Playing International Cricket After ODI WC","link":"https://sports.ndtv.com/cricket/lets-see-mithali-raj-on-her-playing-international-cricket-after-odi-womens-cricket-world-cup-2725243","keywords":null,"creator":null,"video_url":null,"description":"Mithali Raj will be captaining India in the upcoming ODI Women's Cricket World Cup.","content":null,"pubDate":"2022-01-23 13:04:22","full_description":"Indian women's cricket stalwart Mithali Raj on Sunday said that she is currently focusing on the series against New Zealand and the ICC Women's World Cup. In 2019, when Mithali had announced her retirement from T20Is, she had said that the 50-over World Cup would be her swansong. \"Well, let's see how things go there. Right now, my focus is on these two months, that is something I am looking to put all my focus and energy into the series and World Cup,\" said Mithali in a virtual press conference. India will depart for New Zealand to lock horns with the White Ferns in one T20I and five ODIs, beginning February 9 in Napier. And then the Mithali-led side would compete in the 50-over World Cup. After the game against Pakistan (March 6) in the Women's World Cup, India will square off against New Zealand (March 10), West Indies (March 12), England (March 16), Australia (March 19), Bangladesh (March 22), and South Africa (March 27) in the group stage. Team India for 5 ODIs against NZ and ICC Women's World Cup, 2022: Mithali Raj (captain), Harmanpreet Kaur (vice-captain), Smriti Mandhana, Shafali Verma, Yastika Bhatia, Deepti Sharma, Richa Ghosh (wicket-keeper), Sneh Rana, Jhulan Goswami, Pooja Vastrakar, Meghna Singh, Renuka Singh Thakur, Taniya Bhatia (wicket-keeper), Rajeshwari Gayakwad, Poonam Yadav.","image_url":"https://c.ndtvimg.com/2021-09/fmerq3c8_mithali-raj-afp_625x300_21_September_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"'Whoever's plan this was, it backfired': Rashid Latif feels Indian cricket has reached 'dead end' after Kohli-BCCI saga - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMirAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93aG9ldmVycy1wbGFuLXRoaXMtd2FzLWl0LWJhY2tmaXJlZC1yYXNoaWQtbGF0aWYtZmVlbHMtaW5kaWFuLWNyaWNrZXQtaGFzLXJlYWNoZWQtZGVhZC1lbmQtYWZ0ZXIta29obGktYmNjaS1zYWdhLTEwMTY0MjkzODUxMDA3MC5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Whoever's plan this was, it backfired': Rashid Latif feels Indian cricket has reached 'dead end' after Kohli-BCCI saga  Hindustan TimesDid Sourav Ganguly plan to send `show-cause notice` to Virat Kohli? BCCI president breaks silence  WION\"Not True\": Sourav Ganguly On Reports Of Him Wanting To Send Showcause Notice To Virat Kohli  NDTVSports.comSourav Ganguly reacts to report of him wanting to send show-cause notice to Virat Kohli: 'Not true'  Hindustan TimesReports of me wanting to issue a show-cause notice to Virat Kohli are not true: Sourav Ganguly  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-01-23 12:31:29","image_url":null,"source_id":"google"},{"title":"Virat Kohli Slammed for Chewing Gum During National Anthem Ahead of India vs SA Match - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5uZXdzMTguY29tL25ld3MvYnV6ei92aXJhdC1rb2hsaS1zbGFtbWVkLWZvci1jaGV3aW5nLWd1bS1kdXJpbmctbmF0aW9uYWwtYW50aGVtLWFoZWFkLW9mLWluZGlhLXZzLXNhLW1hdGNoLTQ2ODk5NDEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli Slammed for Chewing Gum During National Anthem Ahead of India vs SA Match  News18India vs South Africa: Have 'clueless' India lacked spark without captain Virat Kohli?  Times of IndiaHalke Me Le Raha Tha Behenc***d:- Watch Virat Kohli And Company Give An Abusive Send Off To Temba Bavuma After His Run Out  Cricket AddictorVirat Kohli Faces Backlash For Chewing Gum During National Anthem Ahead of 3rd ODI vs South Africa; Video Goe  India.comVirat Kohli Goes Past Rahul Dravid, Rohit Sharma In Unwanted List  NDTVSports.comView Full coverage on Google News","content":null,"pubDate":"2022-01-23 12:26:00","image_url":null,"source_id":"google"},{"title":"“Don’t agree with it but have to accept it”: Usman Khawaja calls out soft signal post Fawad Ahmed’s debatable catch in BBL 11 Knockout","link":"https://thesportsrush.com/cricket-news-dont-agree-with-it-but-have-to-accept-it-usman-khawaja-calls-out-soft-signal-post-fawad-ahmeds-debatable-catch-in-bbl-11-knockout/","keywords":["Cricket","Videos","Adelaide Strikers","BBL 11","Big Bash League","Fawad Ahmed","Sydney Thunder","usman khawaja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Usman Khawaja calls out soft signal: The captain of Sydney Thunder was involved in a controversial dismissal in BBL 11 Knockout. During the Knockout of the ongoing 11th season of the Big Bash League between Sydney Thunder and Adelaide Strikers in Melbourne, Sydney Thunder captain Usman Khawaja (23) was involved in a controversial dismissal. It… The post “Don’t agree with it but have to accept it”: Usman Khawaja calls out soft signal post Fawad Ahmed’s debatable catch in BBL 11 Knockout appeared first on The SportsRush.","content":"Usman Khawaja calls out soft signal: The captain of Sydney Thunder was involved in a controversial dismissal in BBL 11 Knockout. During the Knockout of the ongoing 11th season of the Big Bash League between Sydney Thunder and Adelaide Strikers in Melbourne, Sydney Thunder captain Usman Khawaja (23) was involved in a controversial dismissal. It all happened on the third delivery of the seventh over when Khawaja had hit a shot towards short third man which led to the fall of his wicket. Adelaide Strikers spinner Fawad Ahmed, who was fielding at short third man, dived and tumbled at the same time to claim a catch. Khawaja, who was given out on the field as a soft signal, had to walk back to the pavilion despite initial replays almost confirming the ball touching the grass before being caught by Ahmed. However, the absence of conclusive evidence for third umpire Ben Treolar resulted in him not overturning the decision at the Melbourne Cricket Ground. Usman Khawaja calls out soft signal post Fawad Ahmed’s debatable catch at MCG Speaking to host broadcaster Fox Cricket after getting out, Khawaja vocally disagreed with the umpire’s decision but also accepted it at the same time due to no other option. Khawaja, 35, also complaint about the umpires not being able to give him a “direct answer”. “No. I didn’t [think I was out]. I thought, at the end of the day, soft signal cost me. Never been a big fan of soft signal. Look, when they give it out on the field. It makes it hard to overturn that. I accept the umpire’s decision,” Khawaja told Fox Cricket. “I don’t agree with it, but I have to accept it” Classy stuff from Usman Khawaja on his controversial dismissal at the MCG tonight #BBL11 pic.twitter.com/BP3AWmWDDn — cricket.com.au (@cricketcomau) January 23, 2022 Chasing a 185-run target, Thunder fell short by 6 runs despite a 90-run partnership for the third wicket between Jason Sangha (61) and Alex Ross (56). Strikers pacer Harry Conway, who defended 14 runs in the final over, was the pick of their bowlers with figures of 4-0-33-2. Apart from Conway, Adelaide captain Peter Siddle also contributed with a couple of wickets. The post “Don’t agree with it but have to accept it”: Usman Khawaja calls out soft signal post Fawad Ahmed’s debatable catch in BBL 11 Knockout appeared first on The SportsRush.","pubDate":"2022-01-23 12:22:25","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-3rd-odi-odi-46-50-updates-2725164","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Newlands, Cape Town. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-23 12:12:03","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 49.1 overs, South Africa are 287/8. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 49.1 overs (4 Runs) Four! 48.6 overs (1 Run) Full and straight, flicked through mid-wicket for one. Miller will have the strike for the last over. Sisanda Magala is the new man in. 48.5 overs (0 Run) OUT! TAKEN! Jasprit Bumrah is just too good at the death and we can see why. Bumrah goes full and wide but takes the pace off the ball. The ball is taken away from Keshav Maharaj's hitting arc and he is forced to fetch it. And fetch it he does. Maharaj drags this one and lifts it straight back over the bowler's head. Virat Kohli moves to his left from long on and takes an assured catch. 48.4 overs (1 Run) Brilliant bowling! Miller tries to unsettle Bumrah as he moves inside the crease. Bumrah though fires in a yorker at the toes, at 141 kph. Miller just about jams it out on the leg side and picks up a single. 48.3 overs (1 Run) Slower one, pushed wider. Maharaj drags it from outside off and heaves it towards wide long on for a single. 48.2 overs (0 Run) Swing and a miss! Full and wide, it was in the slot a bit. Maharaj moves leg side and throws his hands at it but isn't able to make a connection. 48.1 overs (1 Run) Bumrah bowls ths cutter, on middle. Miller adjusts well to the extra bounce and guides it towards short third man. They take one. 47.6 overs (1 Run) Miller wants two but Maharaj says no. Slower one, angled at the pads. Miller bunts it into the vacant square leg region for a single. He will keep strike for the next over. 47.5 overs (1 Run) Full and wide, Maharaj steps out and creams it through cover but will get just one for it. 47.4 overs (4 Runs) FOUR! Not sure what Keshav Maharaj was looking to go that fine but it has brought him a boundary. Good-length ball, outside off and there's pace behind this one. Maharaj just waits for it and the last moment opens the face off the bat. The ball races away into the third man fence. 47.3 overs (1 Run) Krishna sees Miller advancing and bowls it short, at the body. Miller manages to pull it towards deep square leg and collects a run. Keshav Maharaj is the next batter. 47.2 overs (0 Run) OUT! CAUGHT! The change of pace has worked for Prasidh Krishna. Slower one, fuller in length and on the stumps. Dwaine Pretorius doesn't pick it up and looks to heave it on the leg side. He is way too early in his shot and ends up just lifting it towards deep mid-wicket. Suryakumar Yadav takes an easy catch over there but Pretorius will feel he has done his job. 47.1 overs (1 Run) Krishna hurls across a full toss, on the body. Miller gets cramped for room and only manages to work it away towards deep square leg. They get a single. 46.6 overs (1 Run) Length again, on off. Miller edges it down towards the third man region for a single. With just 3 overs remaining, can Miller power his side to a score beyond 300? 46.5 overs (1 Run) Back of a length, outside off. Pretorius taps it towards cover for one. 46.4 overs (0 Run) Pretorius had no idea about that one though. Another slower one, into the pitch and outside off. Pretorius hops and looks to pull but the ball goes well beneath his bat. 46.3 overs (4 Runs) FOUR! Crunched! Slower one, on a length and bowled wider. Dwaine Pretorius stands back and just slaps it through extra cover for a boundary. 46.2 overs (0 Run) That could have been catastrophic! Full and straight, Pretorius bunts it out towards short mid on. Miller is backing up well outside the crease but manages to get back. 46.1 overs (1 Run) Banged in short, around off. Miller plays a controlled pull shot towards deep mid-wicket for a single. 45.6 overs (0 Run) Another good short ball, over leg stump. Pretorius looks to pull but misses. 45.5 overs (1 Run) A dipping full toss, outside off. Miller is unable to take advantage as he slaps it towards sweeper cover for a run. 45.4 overs (4 Runs) FOUR! This is angled onto the pads and David Miller whips it powerfully into the backward square leg fence. 45.3 overs (1 Run) Around the top of middle, Pretorius works it through mid-wicket for a single. 45.2 overs (0 Run) A well-directed short ball, over middle. Pretorius is well beaten. 45.1 overs (1 Run) A length ball, on the pads. Miller flicks it away to deep backward square leg for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637785565121421873.png","source_id":"ndtv"},{"title":"IND vs SA: Rassie van der Dussen joins AB de Villiers, Javed Miandad in incredible series record against India - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmQtdnMtc2EtcmFzc2llLXZhbi1kZXItZHVzc2VuLWpvaW5zLWFiLWRlLXZpbGxpZXJzLWphdmVkLW1pYW5kYWQtaW4taW5jcmVkaWJsZS1zZXJpZXMtcmVjb3JkLWFnYWluc3QtaW5kaWEtMTAxNjQyOTM3ODg4NDc1Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: Rassie van der Dussen joins AB de Villiers, Javed Miandad in incredible series record against India  Hindustan TimesIND vs SA: Watch - Shreyas Iyer Takes A Well-Judged Catch In The Deep To Dismiss Rassie van der Dussen  Cricket AddictorIND vs SA: Shreyas Iyer pulls off brilliant diving catch to remove Van der Dussen - WATCH video  DNA India'Not the Iyer India wanted to see': Shreyas rolls his arms instead of Venkatesh against SA, leaves fans confused  Hindustan TimesIndia vs South Africa: Focus On In-Form Rassie Van Der Dussen Ahead Of Second ODI  NDTVSports.comView Full coverage on Google News","content":null,"pubDate":"2022-01-23 12:04:06","image_url":null,"source_id":"google"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-3rd-odi-odi-41-45-updates-2725112","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Newlands, Cape Town. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-23 11:54:02","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 44.0 overs, South Africa are 253/6. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 43.5 overs (0 Run) Length ball, on off. Pushed to short cover. 43.4 overs (4 Runs) FOUR! Brilliant timing! A wide yorker by Prasidh Krishna and Dwaine Pretorius digs it out brilliantly. It beats the man at point. Deepak Chahar gets around from third man but cannot get there. 250 up! 43.3 overs (0 Run) On a length, on off. Blocked out. 43.3 overs (1 Run) Banged in short, on middle. It goes way over the batter's head and is called a wide. 43.2 overs (0 Run) Back of a length, outside off. Dwaine Pretorius misses the drive. 43.1 overs (1 Run) Full and on the pads. Flicked to deep square leg for one. Prasidh Krishna (6-0-33-0) comes back into the attack. 42.6 overs (0 Run) Loopy ball, lands outside off and comes back in. Dwaine Pretorius gets forward to block but gets hit on the pads. There is a big appeal for LBW but turned down. Rahul decides not to review it too. Maybe, there was some bat on it. Yup, UltraEdge confirms that there was an inside edge there. 42.5 overs (4 Runs) FOUR! Dwaine Pretorius gets one away now! Flatter, on middle. He heaves it to the mid-wicket fence. 42.4 overs (1 Run) Shorter, around off. Miller works it to short third man. Dwaine Pretorius wants the single and sets off. They get one in the end. 42.3 overs (6 Runs) SIX! In the arc and out of the park! Miller gets low to this ball outside off and then slog-sweeps it way over the mid-wicket fence. 42.2 overs (0 Run) Shorter, on off. Blocked out. 42.1 overs (1 Run) Shorter, on off. Dwaine Pretorius goes back and works it to deep cover for one. 41.6 overs (0 Run) Dot ball! Tossed up, on middle. Miller blocks it off the front foot. Just 5 from the over. 41.5 overs (0 Run) Another dot as Miller works it to short cover. 41.4 overs (0 Run) Shorter, around off. Pushed to point. 41.3 overs (0 Run) Loopy ball, on off. Blocked out. 41.2 overs (4 Runs) FOUR! Thrashed away! Iyer drops it short and wide outside off. Miller rocks back and cuts it to the cover fence. 41.1 overs (1 Run) A single as this is pushed to long on. Shreyas Iyer (2-0-16-0) is back on. 40.6 overs (1 Run) Loopy ball, on the pads. Swept to fine leg for one. Just a single from that over! 40.5 overs (0 Run) Fuller, around off. Dwaine Pretorius looks to push it away but gets the inside edge to mid-wicket. 40.4 overs (0 Run) Tossed up, on off. Worked to cover. 40.3 overs (0 Run) Googly! Tossed up, lands outside off and turns in. Dwaine Pretorius misses his drive. 40.2 overs (0 Run) Loopy ball, on off. Worked to mid on. Dwaine Pretorius is in at number 8. 40.1 overs (0 Run) OUT! RUN OUT! India get another one and Andile Phehlukwayo has to walk back! Flatter, on the body. Miller turns it towards mid-wicket. Andile Phehlukwayo is a bit hesitant at first but goes for the single. Shreyas Iyer though is not late in getting to the ball. He pounces on it and throws it to Rishabh Pant, who whips the bails off. Andile Phehlukwayo puts in a dive and the TV umpire is called but he feels that he is out. Yup, the replay confirms that despite the dive, Andile Phehlukwayo is well short.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637785554325027712.png","source_id":"ndtv"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-3rd-odi-odi-36-40-updates-2725068","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Newlands, Cape Town. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-23 11:47:00","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 40.1 overs, South Africa are 228/6. The live updates of South Africa vs India scorecard is also available. It is the perfect platform to follow your favourite teams in South Africa vs India 2021/22. Keep a track on your favourite batsmen and bowlers through South Africa vs India 2021/22 today match, ball by ball commentary, South Africa vs India, South Africa vs India live score, South Africa vs India scorecard. Follow the excitement of the South Africa vs India 2021/22 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 39.6 overs (0 Run) Quicker delivery, on middle. Phehlukwayo presents a dead bat at it. 39.5 overs (0 Run) On middle. Blocked. 39.4 overs (1 Run) This is drifted into leg stump. Miller looks to work it away leg side but gets a leading edge towards cover. They take a single. 39.3 overs (1 Run) Full, on off. Phehlukwayo pushes it down to long off for a single. 39.2 overs (0 Run) Around middle and leg, pushed to the left of the bowler. Yadav dives and makes a good stop. There is still a slip in place. If India can get another wicket here, they will have a firm grip on the game. 39.1 overs (0 Run) Peach! Phehlukwayo has no idea what happened here! On a length, drifted into middle. The ball just grips and turns away sharply. There is a bit of extra bounce as well. Phehlukwayo is well beaten and Yadav thinks there's an edge on it. Pant though doesn't seem excited and the review isn't taken. 38.6 overs (1 Run) Drifted onto the pads, Phehlukwayo clips it past leg slip and picks up a single. 38.5 overs (0 Run) Chahal switches to over the wicket. He tosses it up on middle and Phehlukwayo keeps it out on the leg side. 38.4 overs (1 Run) Well outside off, Miller fetches it and sweeps it towards deep square leg for another one. 38.3 overs (1 Run) Full again, outside off. Phehlukwayo works it through cover-point for one. 38.2 overs (0 Run) Chahal comes from 'round the wicket and tosses it full and wide. Phehlukwayo drives it towards cover. 38.1 overs (1 Run) Around leg and spinning in. Miller tucks it behind square for a single. 37.6 overs (1 Run) Shorter, on off. Miller rocks back and eases it through cover-point for one. It is important for the hosts that Miller bats as long as possible. 37.5 overs (1 Run) Tossed up, around off. Andile Phehlukwayo pushes it through covers for a run. 37.4 overs (0 Run) Beaten! Flatter, around off and just turns away ever so slightly, zipping past the outside edge. 37.3 overs (1 Run) On off, stroked through cover for one. 37.2 overs (0 Run) Flatter this time, angled into middle and leg. Miller manages to keep it out off the back foot. 37.1 overs (0 Run) Drifted into middle. Miller blocks it out. 36.6 overs (1 Run) Full, on middle. Miller flicks it towards mid-wicket for one. Andile Phehlukwayo makes his way out to the middle. 36.5 overs (0 Run) OUT! TAKEN! What a catch! South Africa lose both their set batters and India have a real opportunity now to get things tightened up. Tossed up, on middle. Rassie van der Dussen takes on the slog sweep and hits it square, towards deep mid-wicket. The ball goes flat and there's not much timing on it. Shreyas Iyer races in from the fence and dives down to his right to take a peach of a catch. Yuzvendra Chahal does get the wicket and he is elated. 36.4 overs (0 Run) Tossed up, around off and driven towards cover. 36.3 overs (1 Run) NOT OUT! Geez, that was so, so close! Yuzvendra Chahal bowls a gem of a leg spinner this time. He tosses it outside off, looking to take it away from Miller but the ball dips and turns back a long way. David Miller looks to defend off the front foot but gets pinged on the pads. The visitors seem convinced and it is reviewed. No bat was involved and Ball Tracker shows that the ball was just about clipping the top of leg stump. Miller survives on umpire's call and they get a leg bye. Review time! Height was a matter of discussion but Virat Kohli thinks that it doesn't too high. No bat on that but wickets hitting has umpire's call after getting hit in line. 36.2 overs (0 Run) Nicely flighted, full again and on off. Miller flicks it straight to mid-wicket. 36.1 overs (1 Run) Tossed up, full and on middle. Van der Dussen heaves it towards deep mid-wicket for a single. Yuzvendra Chahal (5-0-28-0) is back on. 35.6 overs (1 Run) Short again, outside off. Rassie van der Dussen pulls it firmly along the ground towards deep mid-wicket for a single. 35.5 overs (1 Run) On the pads, flicked away to fine leg for one. Miller is up and running. David Miller is the new batter. The stage is set for him to flex his muscles. 35.4 overs (0 Run) OUT! TAKEN! Jasprit Bumrah is brought back into the attack and he does strike right away! This could make a huge difference in the final total. Banged in short by Bumrah, around middle. It is there to hit and Quinton de Kock hangs back and looks to smoke it over the mid-wicket fence. It is a tired pull shot from him and he doesn't get enough on it. The ball goes flat and straight down the throat of Shikhar Dhawan on the mid-wicket fence, who makes no mistake. Brilliant innings from de Kock and he gets a pat on the back from Bumrah as well. 35.3 overs (0 Run) Around the top of off. Blocked out. 35.2 overs (2 Runs) Length again, angled across the off stump. Quinton de Kock makes a bit of room and caresses it through the cover region for a couple. 35.1 overs (0 Run) Ouch, that must have been painful! On a good length but slower in pace and around leg. De Kock looks to work it away leg side but misses and gets hit in the box.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637785550103543919.png","source_id":"ndtv"},{"title":"IND vs SA: Quinton de Kock surpasses Sachin Tendulkar, breaks Sehwag's world record to equal De Villiers' huge ODI feat - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMivAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmQtdnMtc2EtcXVpbnRvbi1kZS1rb2NrLXN1cnBhc3Nlcy1zYWNoaW4tdGVuZHVsa2FyLWJyZWFrcy12aXJlbmRlci1zZWh3YWctcy13b3JsZC1yZWNvcmQtdG8tZXF1YWwtYWItZGUtdmlsbGllcnMtaHVnZS1vZGktZmVhdC0xMDE2NDI5MzQ5MjE2ODguaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: Quinton de Kock surpasses Sachin Tendulkar, breaks Sehwag's world record to equal De Villiers' huge ODI feat  Hindustan TimesRecent Match Report - South Africa vs India 3rd ODI 2021/22  ESPNcricinfoTwitter Reacts As Quinton de Kock Scores A Century In The Cape Town ODI vs India  Cricket AddictorQuinton De Kock Surpasses Adam Gilchrist To Reach 2nd Spot In Elite List  NDTV Sports`Never cross the line`: Tabraiz Shamsi shares heartwarming post after dismissing Rishabh Pant in 2nd ODI  WIONView Full coverage on Google News","content":null,"pubDate":"2022-01-23 11:19:15","image_url":null,"source_id":"google"},{"title":"“Superman”: Adam Gilchrist exults as Daniel Sams grabs breathtaking catch to dismiss Alex Carey in BBL 11 Knockout","link":"https://thesportsrush.com/cricket-news-superman-adam-gilchrist-exults-as-daniel-sams-grabs-breathtaking-catch-to-dismiss-alex-carey-in-bbl-11-knockout/","keywords":["Cricket","Videos","adam gilchrist","Adelaide Strikers","Alex Carey","BBL 11","Big Bash League","Daniel Sams","Sydney Thunder"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Daniel Sams grabs breathtaking catch: The all-rounder from Sydney Thunder put on display an exemplary fielding effort. During the Knockout match of the ongoing 11th season of the Big Bash League between Sydney Thunder and Adelaide Strikers in Melbourne, Sydney Thunder all-rounder Daniel Sams made amends for a drop catch by putting on display an… The post “Superman”: Adam Gilchrist exults as Daniel Sams grabs breathtaking catch to dismiss Alex Carey in BBL 11 Knockout appeared first on The SportsRush.","content":"Daniel Sams grabs breathtaking catch: The all-rounder from Sydney Thunder put on display an exemplary fielding effort. During the Knockout match of the ongoing 11th season of the Big Bash League between Sydney Thunder and Adelaide Strikers in Melbourne, Sydney Thunder all-rounder Daniel Sams made amends for a drop catch by putting on display an exemplary fielding effort. Sams, who had dropped Matthew Short (39) in the fourth over, ensured to complete quite a difficult catch at deep mid-wicket in the following over. It all happened when Adelaide Strikers opening batter Alex Carey (23) slogged Thunder spinner Tanveer Sangha only to become a victim of one of the best catches of the tournament. Running behind sideways from his fielding position, Sams was completely airborne when he grabbed a catch to surprise one and all. “Look at that completely air-born. Superman. And they needed that too,” former Australia wicket-keeper batter Adam Gilchrist said while calling the game on Fox Cricket. Strikers captain Peter Siddle’s decision of winning the toss and electing to bat first was followed by his batter scoring a formidable 184/6 in 20 overs on the back of batter Ian Cockbain top-scoring with his 65 (38) comprising of six fours and three sixes. With bowling figures of 4-0-15-2, Sangha was the pick of the bowlers for the Sydney today. While Thunder pacer Gurinder Sandhu also picked a couple of wickets, Nathan McAndrew and Jason Sangha picked a wicket apiece. Daniel Sams grabs breathtaking catch vs Adelaide Strikers Don’t let his subdued reaction fool you. Daniel Sams makes up for his earlier drop with a hanger in the deep! A BKT Golden Moment | #BBL11 pic.twitter.com/7hCV5VxxK0 — cricket.com.au (@cricketcomau) January 23, 2022 How Twitterati reacted: That is some catch Mr Sams! #BBL11 pic.twitter.com/r8TOrapHlm — Chloe-Amanda Bailey (@ChloeAmandaB) January 23, 2022 SCREAMER #BBL11 #ThunderNation pic.twitter.com/KOMF61waWf — Sydney Thunder (@ThunderBBL) January 23, 2022 Daniel Sams airborne. That makes up for the drop a little while ago. Carey gone — Rick Eyre on cricket (@rickeyrecricket) January 23, 2022 For more cricket-related news, click here. The post “Superman”: Adam Gilchrist exults as Daniel Sams grabs breathtaking catch to dismiss Alex Carey in BBL 11 Knockout appeared first on The SportsRush.","pubDate":"2022-01-23 11:06:53","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-3rd-odi-odi-31-35-updates-2725031","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Newlands, Cape Town. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-23 11:04:19","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 35.2 overs, South Africa are 214/3. The live updates of South Africa vs India scorecard is also available. It is the perfect platform to follow your favourite teams in South Africa vs India 2021/22. Keep a track on your favourite batsmen and bowlers through South Africa vs India 2021/22 today match, ball by ball commentary, South Africa vs India, South Africa vs India live score, South Africa vs India scorecard. Follow the excitement of the South Africa vs India 2021/22 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 34.6 overs (0 Run) Shorter ball, on off. Pushed to cover. 15 came from that over! 34.5 overs (0 Run) Length ball, slower too, on off. Rassie van der Dussen taps it out well. 34.4 overs (1 Run) Short, on the body. Pulled to deep square leg for just a single. 34.3 overs (2 Runs) Just two! Full and on the pads. Flicked past deep mid-wicket for a couple by Quinton de Kock. 34.3 overs (1 Run) Free Hit continues! Too short and way outside off. Wide called as Quinton de Kock leaves it. 34.3 overs (5 Runs) NO BALL AND FOUR! Short and on the body. De Kock swivels and pulls it hard to the square leg fence. To make things worse for India, next ball will be a Free Hit as Deepak Chahar has overstepped! 34.2 overs (4 Runs) FOUR! Pre-meditated and well executed! Slower ball, on a length, outside off. De Kock shuffles across and then slaps it down to the fine leg fence. 200 up for South Africa. 34.2 overs (1 Run) Short and outside off. De Kock leaves it. Wide called. 34.1 overs (1 Run) 50 for Rassie van der Dussen! He has been in sensational form in the series against India! He would look to get a big one too given that there is plenty of time left. Shoter, on the body. Pulled to deep square leg for one. Deepak Chahar (7-0-38-0) is back into the attack. 33.6 overs (0 Run) Loopy ball, on middle and leg. De Kock goes for the switch it but misses. It hits the pads and drops near him after looping up. 33.5 overs (0 Run) Shorter, around off. Punched to cover. 33.4 overs (1 Run) Rassie van der Dussen brings out the reverse sweep to deep cover for one. 33.3 overs (0 Run) Loopy ball, on off. Blocked out. 33.2 overs (0 Run) DROPPED! Loopy ball, outside off. Rassie van der Dussen looks to reverse sweep. It comes off the gloves but Pant drops it again! Another drop for him today. 33.1 overs (1 Run) Shorter, on the body. Pulled to deep square leg for one. 1000 runs for Quinton de Kock against India in ODIs now at an average of almost 67! 32.6 overs (1 Run) Just a single as this is pushed past cover. 12 from the over. 32.5 overs (2 Runs) Tossed up, wide outside off. Quinton de Kock looks to carve it over covers but gets it off the outer half. It goes over cover but is cut off by the man at sweeper cover. Two taken. 32.4 overs (1 Run) Flatter, around off. Punched to deep cover for one. 32.3 overs (6 Runs) SIX! That is out of here! Rassie van der Dussen makes up his mind and dances down the track. He converts it in a full toss and heaves it over the long on fence. All the way. 32.2 overs (1 Run) Flatter and outside off. Quinton de Kock slaps it wide of long off. Rassie van der Dussen wants the second but de Kock is not interested. 32.1 overs (1 Run) Loopy ball, on the pads. Rassie van der Dussen sweeps it past square leg for one. 31.6 overs (0 Run) Shorter, on off. De Kock gets the inside edge on the pads. 31.5 overs (0 Run) Flatter, around off. Quinton de Kock is beaten as he looks to block. 31.4 overs (0 Run) Flatter, on off. Blocked out. 31.3 overs (4 Runs) FOUR! Up and over! Loopy ball, on off. De Kock lifts it over mid off for a boundary. 31.3 overs (5 Runs) FIVE WIDES! Free runs for South Africa! Tossed up down the leg side. De Kock misses the sweep and the ball runs to the fine leg fence. 31.2 overs (0 Run) Beaten! Flatter, just outside off. De Kock looks to block it but it goes past the outside edge. 31.1 overs (0 Run) Full, on off. Pushed to covers. Jayant Yadav (6-0-37-0) is back on. 30.6 overs (0 Run) Shorter, on off. Blocked out. 30.5 overs (1 Run) A single as this is pushed past cover. 30.4 overs (0 Run) Tossed up, on off. Blocked out. 30.3 overs (2 Runs) THERE IT IS! Quinton de Kock gets to his ton! His 6th ODI ton against India and he loves playing against them! Fuller, around off. Pushed past the diving cover fielder for a couple and Quinton de Kock soaks in the applause. 30.2 overs (0 Run) Full, on off. Blocked out. 30.1 overs (1 Run) Full, on off. Worked to mid on for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637785524498269186.png","source_id":"ndtv"}]}