{"newsArray":[{"title":"Former Aussie cricket star’s sad fall from grace revealed","link":"https://www.cairnspost.com.au/news/nsw/michael-slater-rise-and-fall-of-former-test-cricket-and-tv-star/news-story/554bff82312813496730c779e5c7596f","keywords":["CM QLD News and Photos","News","NSW News and Photos","Sport news and galleries"],"creator":null,"video_url":null,"description":"He was once known as one of the most destructive batters in world cricket and a popular TV personality.","content":null,"pubDate":"2022-10-09 21:28:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"CLT vs GRA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for ECT10 Spain, Final","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/clt-vs-gra-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-ect10-spain-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-09 20:17:21","image_url":"https://static.sportskeeda.com/editor/2022/10/641cb-16653358001143-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Cricket World Cup Super League points table (Updated) as on October 9 after IND vs SA 2022 2nd ODI","link":"https://www.sportskeeda.com/cricket-news/news-ind-vs-sa-2022-icc-cricket-world-cup-super-league-points-table-updated-october-9?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-09 20:17:21","image_url":"https://static.sportskeeda.com/editor/2022/10/b5e54-16653358519400-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket world erupts after Aussie star’s act","link":"https://www.cairnspost.com.au/sport/cricket/australian-wicketkeeper-matthew-wade-accused-of-obstructing-the-field/news-story/7a120380d512de5e91afdf6152eb1ad0","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"England captain Jos Buttler has seemingly gifted Australian wicketkeeper Matthew Wade a reprieve after withdrawing an appeal for obstructing the field during the first T20 at Perth Stadium on Sunday evening.","content":null,"pubDate":"2022-10-09 19:17:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"India Deaf Cricket Team beat South Africa in Qualifier 1","link":"https://www.sentinelassam.com/sports/cricket/india-deaf-cricket-team-beat-south-africa-in-qualifier-1-617163","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India Deaf Cricket Team entered the final of the DICC T20 Champions Trophy 2022 after beating South Africa by seven wickets in the Qualifier 1 match here on Saturday.","content":"AJMAN: India Deaf Cricket Team entered the final of the DICC T20 Champions Trophy 2022 after beating South Africa by seven wickets in the Qualifier 1 match here on Saturday.India, the only undefeated team in the tournament, won all their matches so far against Bangladesh, Australia and South Africa. On Saturday, India came up with a spirited show with both ball and bat as India successfully chased the target of 101 runs. Earlier, put into bat, India knocked out South Africa in 100 runs. India player Sai Akash was the top scorer with 36 runs. On the other hand, Kuldeep Singh does well bowling for his team as he took three wickets with one maiden over of South Africa in 4 overs. Kuldeep Singh holds the Man of the Match award. IANS Also Read: India seek to correct mistakes in must-win second ODI against South Africa Also Watch:","pubDate":"2022-10-09 18:49:30","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/09/399583-crick.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"SWAN GOLD SUMMERS: Shaun Marsh on Western Australia’s drought-breaking 2021-22 Sheffield Shield victory","link":"https://thewest.com.au/sport/cricket/swan-gold-summers-shaun-marsh-on-western-australias-drought-breaking-2021-22-sheffield-shield-victory-c-8486248","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"It took Teague Wyllie two games to win a Sheffield Shield title. It took Shaun Marsh 20 years. The WA cricket legend looks back on last year’s drought-breaking triumph in Glen Quartermain’s series.","content":null,"pubDate":"2022-10-09 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8486248/b9528e6b7e130476b013e2a5e35d05b0d74fcdf6-16x9-x827y296w5510h3099.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Bennell, Charlesworth to bolster Two Blues","link":"https://thewest.com.au/news/kalgoorlie-miner/bennell-charlesworth-to-bolster-two-blues-c-8492589","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"O’Shaughnessy medallist Bevan Bennell joins UK recruit in Two Blues’ squad for Eastern Goldfields Cricket Association’s 2022-23 season.","content":"Great Boulder’s efforts to go one better this summer in the Eastern Goldfields Cricket Association’s A-grade competition have been boosted by the return of star batsman Bevan Bennell and the acquisition of UK recruit Aaron Charlesworth. The Two Blues dominated last season’s qualifying series with 10 wins to be crowned minor premiers, but lost to Hannans in the grand final by four wickets. It foiled the squad’s bid for back-to-back A-grade flags. Player-coach Dylan Hinchliffe, however, said he looked forward to complementing an already-talented squad in 2022-23 with the batting and bowling skills of Bennell and Charlesworth, respectively. Bennell starred in the Two Blues’ grand final win two summers ago when he also claimed the O’Shaughnessy Medal as the EGCA’s best player. He returned from a stint in the South West earlier this year and Charlesworth, a right-arm seamer, joins Great Boulder from English club Balderton. “Having Bevan return is terrific and he steps straight back in as captain,” Hinchliffe said. “He only missed one (EGCA) season and is someone who is just so well respected, not only by everyone at our club but throughout the entire competition. “Bevan was the one who led us to that premiership only 18 months ago and will resume in that (captain’s) job seamlessly I’d imagine. “Aaron arrived here on Kalgoorlie Cup night (October 1) and is doing all the right things at the moment for sure. “I’m not saying he’s going to win the O’Shaughnessy Medal, but no doubt he’s going to be a very handy player for us.” At just 26 and gearing up for a second year at the helm, Hinchliffe said he had learned greatly from last season. “I reckon I’ve probably learned more over the past six months since the season’s ended (because) I’ve had some time to reflect,” he said. “On face value, last season was disappointing because we didn’t get the result in the end that we wanted. “But upon reflection, there was a realisation that the average age of our group was 24. “it means we have a group there that can really take the club forward for the next four or five years.” Hinchliffe said he was grateful to have built solid relationships with each of his players, who blend youth and experience. “I’m fortunate in that with our older guys like Josh Rushmore and Danny Tebble, I’ve played probably 120 games of cricket with them already and we have great relationships that extends to how we ultimately play our cricket,” he said. “Among the younger guys, they’ve come through the junior ranks which means I’ve known them a long time, too. “There’s a lot of people generally around the club with a lot of knowledge and experience and I’d be stupid not to draw on it at times.” Great Boulder, who will be missing top-order batsman Jebb Swallow this summer, open the new campaign this Saturday against Lake View. Sign up for our emails","pubDate":"2022-10-09 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8492589/cebba44051e07b349ca1ddd979a475dca82bcf67-16x9-x899y652w2948h1658.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND W vs THI W pitch report: Pitch report of Sylhet International Cricket Stadium for India vs Thailand Women’s Asia Cup 2022 match","link":"https://thesportsrush.com/cricket-news-ind-w-vs-thi-w-pitch-report-pitch-report-of-sylhet-international-cricket-stadium-for-india-vs-thailand-womens-asia-cup-2022-match/","keywords":["Cricket","Asia Cup 2022","India","Malaysia","Sylhet International Cricket Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND W vs THI W pitch report: Team India will play the last match of the round robin stage of Asia Cup 2022 against Malaysia on Monday. Post being humbled at the hands of Pakistan by 13 runs on Friday, team India registered a clinical 59-run victory against Bangladesh the next day, to book their… The post IND W vs THI W pitch report: Pitch report of Sylhet International Cricket Stadium for India vs Thailand Women’s Asia Cup 2022 match appeared first on The SportsRush.","content":"IND W vs THI W pitch report: Team India will play the last match of the round robin stage of Asia Cup 2022 against Malaysia on Monday. Post being humbled at the hands of Pakistan by 13 runs on Friday, team India registered a clinical 59-run victory against Bangladesh the next day, to book their berth in the semi-final of Women’s Asia Cup 2022. With 8 points after five matches, the Harmanpreet Kaur-led side now sit at the top of the points table with four wins, and a Net Run Rate of +2.590. Thailand, on the other hand, have also impressed one and all so far, especially since their first-ever win against Pakistan in the format by 4 wickets, during the 10th match of the championship on Thursday. ALSO READ: Why did Harmanpreet Kaur not play Asia Cup 2022 match against Bangladesh? A win against India on Monday, would all but assure them a place in the final-4 teams as well. At present, they are placed at the fourth place in the points table, with six points under their belt after three wins off five matches. The Syhlet International Cricket Stadium will host the 19th match of the Asia Cup between these two sides on Monday. IND W vs THI W pitch report The tournament has, so far assisted the spinners who have made full use of the turn they are generating off the surface. In fact, four of the top-5 leading wicket takers of Women’s Asia Cup 2022 so far are spinners. The pitch, despite staying a touch on the slower side, has been decent enough for the batters who have been willing to take the aggressive route. Having said that, teams have struggled to post huge totals on the board so far, which has had a lot to do with the relatively slow outfield at the venue. All in all, if the batters manage to tackle the opposition spinners, the pitch has in it to help teams post totals at least in the vicinity of the 160-run mark. The post IND W vs THI W pitch report: Pitch report of Sylhet International Cricket Stadium for India vs Thailand Women’s Asia Cup 2022 match appeared first on The SportsRush.","pubDate":"2022-10-09 17:59:53","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Sports Minister commends ICC, NCF for excellent organisation of World Cup qualifier","link":"https://www.premiumtimesng.com/sports/nigeria-sports-news/558758-cricket-sports-minister-commends-icc-ncf-for-excellent-organisation-of-world-cup-qualifier.html","keywords":["More Sports News","Abuja","International Cricket Council (ICC)","Minister of Youth and Sports Development","Moshood Abiola National Stadium","Nigeria Cricket Federation","Nigeria Cricket Federation(NCF)","Sunday Dare"],"creator":["Press Release"],"video_url":null,"description":"The minister said the pace and the dedication of the NCF to youth development and facility upgrade are commendable. The post Cricket: Sports Minister commends ICC, NCF for excellent organisation of World Cup qualifier appeared first on Premium Times Nigeria.","content":null,"pubDate":"2022-10-09 17:46:36","image_url":null,"source_id":"premiumtimesng","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"AUS vs ENG: हार से बचने के लिए मैथ्यू वेड ने की शर्मनाक हरकत, कैच ले रहे खिलाड़ी को दिया धक्का, Video","link":"https://www.abplive.com/sports/cricket/australian-player-matthew-wade-deliberately-pushed-england-bowler-mark-wood-so-that-mark-wood-could-not-catch-2234345","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Matthew Wade Viral Video: इंग्लैंड ने पहले T20 मैच में ऑस्ट्रेलिया को 8 रन से हरा दिया. इस तरह इंग्लैंड टीम ने 3 T20 मैचों की सीरीज में 1-0 की बढ़त ले ली है. इस सीरीज का दूसरा T20 मैच 12 अक्टूबर को कैनबरा में खेला जाएगा. बहरहाल, पहले T20 मैच का एक वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है. यह वायरल वीडियो ऑस्ट्रेलियाई पारी के 17वें ओवर का है. दरअसल, इस वीडियो में साफ देखा जा सकता है कि ऑस्ट्रेलियाई खिलाड़ी मैथ्यू वेड ने इंग्लैंड के गेंदबाज मार्क वुड को जानबूझकर धक्का दिया. ताकि, मार्क वुड कैच नहीं पकड़ सके और आउट होने से बचा जाए. मैथ्यू वेड ने आउट से बचने के लिए की शर्मनाक हरकत आस्ट्रेलियाई पारी के 17वें ओवर में इंग्लैंड के तेज गेंदबाज मार्क वुड गेंदबाजी कर रहे थे. इस ओवर की तीसरी गेंद पर मैथ्यू वेड ने बड़ा शॉट लगाना चाहा, लेकिन टाइमिंग ठीक नहीं होने के कारण गेंद हवा में खड़ी हो गई. इस बीच कंगारू बल्लेबाज मैथ्यू वेड ने शर्मनाक हरकत की. दरअसल, उन्होंने क्रीज के अंदर जाने की आंड़ में मार्क वुड को धक्का दे दिया. ताकि, मार्क वुड कैच नहीं पकड़ सके और आउट होने से बचा जा सके. मैथ्यू वेड की इस शर्मनाक हरकत के बाद मार्क वुड कैच नहीं पकड़ सके. pic.twitter.com/PcvsNT2UHA — Out Of Context Cricket (@GemsOfCricket) October 9, 2022 इंग्लैंड टीम ने नहीं की 'ऑब्सट्रक्टिंग द फील्ड' की अपील दरअसल, इंग्लैंड टीम मैथ्यू वेड के खिलाफ 'ऑब्सट्रक्टिंग द फील्ड' की अपील कर सकती थी, लेकिन अंग्रेज टीम ने ऐसा नहीं किया. इस वजह से मैदानी अंपायर ने इस मसले को थर्ड अंपायर के पास नहीं भेजा. बताते चलें कि अगर इंग्लैंड टीम मैथ्यू वेड के खिलाफ 'ऑब्सट्रक्टिंग द फील्ड' की अपील करती तो थर्ड अंपायर कंगारू बल्लेबाज को आउट करार देते, क्योंकि मैथ्यू वेड जानबूझकर ऐसा किया था. हालांकि, मैथ्यू वेड इसके बावजूद फायदा नहीं उठा सके और 15 गेंदों पर 21 रन बनाकर चलते बने. वहीं, ऑस्ट्रेलियाई टीम को 8 रनों से हार का सामना करना पड़ा. ये भी पढ़ें- Watch: T20 वर्ल्ड कप के लिए तैयार हैं सूर्यकुमार यादव, वीडियो में बताया क्या है 'स्पेशल प्लान' AUS vs ENG: डेविड वॉर्नर की विस्फोटक पारी पर फिरा पानी, पहले टी20 में इंग्लैंड ने ऑस्ट्रेलिया को चटाई धूल","content":null,"pubDate":"2022-10-09 17:28:04","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"GPCL can be a nursery for global T20 tournaments such as IPL: Bobby Narasimha Rao","link":"https://www.sentinelassam.com/sports/cricket/gpcl-can-be-a-nursery-for-global-t20-tournaments-such-as-ipl-bobby-narasimha-rao-617146","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former India Test cricketer Bobby Narasimha Rao lavished praise on Global Power Cricket League (GPCL) T20, saying it can be a nursery for major tournaments like IPL.","content":"NEW DELHI: Former India Test cricketer Bobby Narasimha Rao lavished praise on Global Power Cricket League (GPCL) T20, saying it can be a nursery for major tournaments like IPL. Several marquee international cricketers from different parts of the world are featuring in the inaugural edition of the GPCL T20. And the tournament has also managed to attract netizens, as the league is trending on social media as well. Speaking with IANS, Bobby Narasimha Rao, who is a commentator in the GPCL T20, said, \"the quality of cricket has surprised me with some former Test cricketers like Ian Bell and Narsingh Deonarine and few budding youngsters from different countries.\" \"They have executed high level skills in all three departments of the game. The tournament is at a very exciting stage. The organising capabilities and facilities are second to none,\" he added. Bobby Narasimha Rao, who represented India in 4 Tests, also believes that the GPCL is developing a new breed of stars and it should become a regular feature. \"Also, GPCL can be a nursery for global T20 tournaments such as IPL with the level of abundant talent shown by foreign first-class players and young cricketers.\" The league has ensured that each team has Indian diaspora youth participation along with other players of that particular country. India, Australia, England, USA, Ireland, Scotland, South Africa, and Sri Lanka are competing with each other for the coveted trophy. So far, Indian Sapphires and English Reds have qualified for the semi-final from Pool A whereas Australian Golds and South African Emeralds have made it from Pool B. Both the semifinals will take place in Yamuna Sports Complex Cricket Ground on October 8 here. The final is on October 9. IANS Also Read: Cameron Green is 'gold dust'; Cricket Australia should not stop him from playing in IPL: Hayden Also watch:","pubDate":"2022-10-09 17:12:36","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/09/399566-gpcl.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Shaheen Shah Afridi feels he will be ready for World Cup match against India: Ramiz Raja","link":"https://www.sentinelassam.com/sports/cricket/shaheen-shah-afridi-feels-he-will-be-ready-for-world-cup-match-against-india-ramiz-raja-617145","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Ramiz Raja, the chairman of the Pakistan Cricket Board (PCB), gave a huge update on the availability of pace spearhead Shaheen Shah Afridi","content":"LAHORE: Ramiz Raja, the chairman of the Pakistan Cricket Board (PCB), gave a huge update on the availability of pace spearhead Shaheen Shah Afridi, saying that the left-arm fast bowler feels he will be ready to play in Pakistan's opening match of T20 World Cup against India on October 23. Afridi had sustained a right knee ligament injury during Pakistan's first Test against Sri Lanka at Galle and has been out of action ever since, missing the Asia Cup, seven T20Is at home against England and the ongoing tri-series in New Zealand, which also features Bangladesh. \"I had spoken to Shaheen. He said, 'I haven't felt this fit in a while'. So, the progress is very good. His doctor has sent me videos of him, where he is 90 per cent fit. He feels he will play against India and will be battle ready,\" said Raja in a chat with DawnNews. IANS Also Read: Pakistan Name Squad For T20 World Cup, Shaheen Returns; Fakhar Misses Out Also watch:","pubDate":"2022-10-09 17:07:22","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/09/399565-shah.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka register comfortable win over Malaysia in Women's Asia Cup","link":"https://www.sentinelassam.com/sports/cricket/sri-lanka-register-comfortable-win-over-malaysia-in-womens-asia-cup-617143","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"A clinical performance from the bowling department saw Sri Lanka register a comfortable 72-run win over Malaysia in the Women’s Asia Cup at the Sylhet International Cricket Stadium","content":"SYLHET: A clinical performance from the bowling department saw Sri Lanka register a comfortable 72-run win over Malaysia in the Women's Asia Cup at the Sylhet International Cricket Stadium on Saturday. After a disappointing batting performance saw them post 105/7 in 20 overs, Sri Lanka's bowlers, led by pacer Malsha Shehani's 4/2 in 1.5 overs, were virtually unplayable and bowled out Malaysia for just 33 in 9.5 overs. Electing to bat first, Sri Lanka didn't have a good start as they lost three wickets in the powerplay. Skipper Chamari Athapaththu (21) and all-rounder Nilakshi de Silva (21) steadied the innings after early troubles, but neither of the two were unable to convert their start into a big knock for Sri Lanka. The crucial knock for Sri Lanka came from veteran Oshadi Ranasinghe, who kept the scoreboard ticking in the last five overs with 23 not out off just 18 balls, hitting two fours. Supported by a run-a-ball 14 from Malsha, Oshadi ensured Sri Lanka crossed the 100-run mark as last five overs of the Sri Lankan innings yielded 39 runs. Malaysia had never chased down anything above 100 in their T20I history and were pushed on the backfoot in the third over when Sri Lanka picked three wickets, two of them picked by Sugandika Kumari apart from a run-out. Apart from Elsa Hunter, none of the Malaysian batter could get into double digits. Brief Scores: Sri Lanka 105/7 in 20 overs (Oshadi Ranasinghe 23 not out, Nilakshi de Silva 21; Sasha Azmi 2/10, Ainna Hamizah Hasim 2/23) beat Malaysia 33 all out in 9.5 overs (Elsa Hunter 18; Malsha Shehani 4/2, Inoka Ranaweera 2/8) by 72 runs. IANS Also Read: Pakistan secure upset win over India in Women's Asia Cup Also watch:","pubDate":"2022-10-09 17:00:27","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/09/399563-srilanka.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"David Miller child: Is David Miller daughter cancer news true? Has David Miller daughter died?","link":"https://thesportsrush.com/cricket-news-david-miller-child-is-david-miller-daughter-cancer-news-true-has-david-miller-daughter-died/","keywords":["Cricket","David Miller","South Africa"],"creator":["Gurpreet Singh"],"video_url":null,"description":"David Miller child: The South African batter took to his social media handle last night to post his picture alongside her ‘little rockstar’. Courtesy of Shreyas Iyer’s second ODI century, and his scintillating 161-run stand alongside Ishan Kishan (93 off 84), team India defeated South Africa by 7 wickets to win the second ODI at… The post David Miller child: Is David Miller daughter cancer news true? Has David Miller daughter died? appeared first on The SportsRush.","content":"David Miller child: The South African batter took to his social media handle last night to post his picture alongside her ‘little rockstar’. Courtesy of Shreyas Iyer’s second ODI century, and his scintillating 161-run stand alongside Ishan Kishan (93 off 84), team India defeated South Africa by 7 wickets to win the second ODI at Ranchi, and with it draw level the three-match series 1-1. Iyer finished the match with a boundary and 25 deliveries to spare, and fittingly received the ‘Player of the Match’ award for his stellar knock of 113* off 111 deliveries, with the help of 15 Fours. Earlier, a 129-run stand between Reeza Hendricks (74 off 76) and Aiden Markram (79 off 89) helped South Africa comfortably surpass the 200-run mark. However, lack of a final flourish particularly off the bat of the in-form David Miller (35* off 34), and some fine death bowling by the Indian bowlers, meant that the Proteas total was restricted to 278/7 in 50 Overs. The night before the 2nd ODI, however, was marked with a saddening piece of information, when Miller posted a picture of ‘her little rockstar’ on Instagram, while confirming that she passed away while battling with cancer. David Miller child: Has David Miller daughter died? Miller’s Instagram post soon became viral across social media platforms, claiming that the Southpaw batter had lost his daughter due to cancer, after he posted a picture of her sitting on his lap while posing for the lens. The report was even carried by some websites and local newspapers in the city of Ranchi, claiming that the heartbreaking incident might mean that Miller would not play the second ODI in the city on Sunday. However, while the girl in the picture was indeed diagnosed with cancer, and did succumb to it yesterday, she was in fact a huge David Miller fan, and not his biological daughter.   View this post on Instagram   A post shared by Dave Miller (@davidmillersa12) The little girl’s name is Ane, and Miller had in March 2017 as well, posted a picture of her on Instagram while praising her passion for life, despite being just a five-year old.   View this post on Instagram   A post shared by Dave Miller (@davidmillersa12) For more Cricket-related news, click here. The post David Miller child: Is David Miller daughter cancer news true? Has David Miller daughter died? appeared first on The SportsRush.","pubDate":"2022-10-09 16:50:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“I will go back to the top next game”: Aaron Finch will open the batting with David Warner in Canberra T20Is vs England","link":"https://thesportsrush.com/cricket-news-i-will-go-back-to-the-top-next-game-aaron-finch-will-open-the-batting-with-david-warner-in-canberra-t20is-vs-england/","keywords":["Cricket","Aaron Finch","Australia","Cameron Green","David Warner","England","England tour of Australia 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Aaron Finch will open the batting: The Australian batter will return to his usual batting position from the next match onward. Positives were bound to be found by Australia after losing a close first T20I against England in Perth earlier in the day. In what wasn’t a one-sided thrashing by any means, captain Aaron Finch… The post “I will go back to the top next game”: Aaron Finch will open the batting with David Warner in Canberra T20Is vs England appeared first on The SportsRush.","content":"Positives were bound to be found by Australia after losing a close first T20I against England in Perth earlier in the day. In what wasn’t a one-sided thrashing by any means, captain Aaron Finch chose to name pacer Nathan Ellis’ performance as their biggest positive from an 8-run loss. Playing only his eighth international match, Ellis was the pick of the Australian bowlers with bowling figures of 4-0-20-3. Ellis, who bowled a couple of powerplay overs, gave away only 13 runs in his first two overs. Been hit for a boundary on the first delivery of his third over, Ellis made instant amends by sending England captain Jos Buttler back to the pavilion on the following delivery. Given responsibility of bowling the penultimate over, Ellis not only picked a couple of wickets but, more importantly, also gave away only one run to not let England thrive in the slog overs. “Nathan Ellis was outstanding on a good batting surface. He bowled two really good overs in the powerplay, one in the middle when they were going strong and one at the death,” Finch told at the toss. Bringing an end to all the speculation regarding their opening combination during ICC T20 World Cup 2022, Finch confirmed that he and batter David Warner will be opening the batting from the second T20I onward. With all-rounder Glenn Maxwell set to return on Wednesday, normalcy will be practiced by the defending champions with only a couple of matches remaining before the World Cup. “I will go back to the top next game, that was always the plan. The games against the West Indies and this game was an experiment but I’ll go back in preparation for the upcoming World Cup,” Finch told during the post-match presentation ceremony at the Perth Stadium today. The development, in all likeliness, would bring an end to Australia experimenting with rookie all-rounder Cameron Green at the top of the order. For the unversed, Finch and Warner are sixth on the list of highest partnership runs in T20Is. Joint third-highest century partnerships to their name, the senior duo also has fifth-highest runs for T20I opening pairs.","pubDate":"2022-10-09 16:43:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England clinch tight win despite Warner, Ellis heroics | Australia v England 2022 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9WUtsWE5IRUhUam_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England clinch tight win despite Warner, Ellis heroics | Australia v England 2022  cricket.com.auWatch: Matthew Wade Blocks England Bowler From Taking Catch, Sparks Controversy  NDTV SportsRecent Match Report - England vs Australia 1st T20I 2022/23  ESPNcricinfoWatch: Wade escapes 'obstructing the field' dismissal during AUS vs ENG 1st T20I  Hindustan TimesLIVE AUS vs ENG 1st T20I Score, Perth: Warner-Finch Key in Run-Chase For Australia  India.comView Full coverage on Google News","content":null,"pubDate":"2022-10-09 16:00:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"KL Rahul and Intent: In-depth analysis of his T20 numbers before T20 World Cup 2022","link":"https://www.indiatvnews.com/sports/cricket/kl-rahul-and-intent-in-depth-analysis-of-his-t20-numbers-before-t20-world-cup-2022-2022-10-09-814959","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul will open the innings for India along with Rohit Sharma at the upcoming T20 World Cup. Since the last couple of editions of IPL, Rahul has been heavily criticised for his 'Intent' in the middle overs. The flak also spilt over into international cricket. ","content":null,"pubDate":"2022-10-09 15:59:28","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Iyer joins Kohli in unique ODI list after sensational century vs South Africa - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMinAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zaHJleWFzLWl5ZXItam9pbnMtdmlyYXQta29obGktaW4tdW5pcXVlLW9kaS1saXN0LWFmdGVyLXNlbnNhdGlvbmFsLWNlbnR1cnktYWdhaW5zdC1zb3V0aC1hZnJpY2EtMTAxNjY1MzI4OTQ3OTY5Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Iyer joins Kohli in unique ODI list after sensational century vs South Africa  Hindustan TimesRecent Match Report - South Africa vs India 2nd ODI 2022/23  ESPNcricinfoIndia vs South Africa Highlights, 2nd ODI 2022: Shreyas Iyer ton, Ishan Kishan help India level series  Times of IndiaShreyas Iyer, Ishan Kishan deliver series-levelling win | Cricbuzz.com - Cricbuzz  CricbuzzIyer ton powers India to win over Proteas  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-10-09 15:40:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Bharat Army troll Barmy Army on 'spirit of cricket' issue after England refuse to appeal against Matthew Wade - Times Now","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3d3dy50aW1lc25vd25ld3MuY29tL3Nwb3J0cy9jcmlja2V0L2JoYXJhdC1hcm15LXRyb2xsLWJhcm15LWFybXktb24tc3Bpcml0LW9mLWNyaWNrZXQtaXNzdWUtYWZ0ZXItZW5nbGFuZC1yZWZ1c2UtdG8tYXBwZWFsLWFnYWluc3QtbWF0dGhldy13YWRlLWFydGljbGUtOTQ3NDQzODPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bharat Army troll Barmy Army on 'spirit of cricket' issue after England refuse to appeal against Matthew Wade  Times NowEngland clinch tight win despite Warner, Ellis heroics | Australia v England 2022  cricket.com.auWatch: Matthew Wade Blocks England Bowler From Taking Catch, Sparks Controversy  NDTV SportsRecent Match Report - England vs Australia 1st T20I 2022/23  ESPNcricinfoJos Buttler shines on return as England edge high-scoring opener in Perth | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-10-09 15:04:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Alex has a fantastic record in Australia”: Jos Buttler confirms preferring Alex Hales over Phil Salt for T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-alex-has-a-fantastic-record-in-australia-jos-buttler-confirms-preferring-alex-hales-over-phil-salt-for-t20-world-cup-2022/","keywords":["Cricket","Alex Hales","Australia","England","England tour of Australia 2022","ICC T20 World Cup 2022","Jos Buttler","Phil Salt"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jos Buttler confirms preferring Alex Hales: The English captain is impressed with his opening partner’s credentials down under. Opening the batting with each other for the first time in a T20I, England captain Jos Buttler and batter Alex Hales scored individual half-centuries to power the team to 208/6 in 20 overs against Australia in Perth… The post “Alex has a fantastic record in Australia”: Jos Buttler confirms preferring Alex Hales over Phil Salt for T20 World Cup 2022 appeared first on The SportsRush.","content":"Jos Buttler confirms preferring Alex Hales: The English captain is impressed with his opening partner’s credentials down under. Opening the batting with each other for the first time in a T20I, England captain Jos Buttler and batter Alex Hales scored individual half-centuries to power the team to 208/6 in 20 overs against Australia in Perth today. Having scored 58 runs in the powerplay, the duo had amassed 118 runs by the halfway mark. A match-winning 68-ball 132-run partnership provided enough signs to the fans with respect to what they should expect from Hales and Buttler in the next one month or so. While Buttler scored 68 (32) with the help of eight fours and four sixes at a strike rate of 212.50, Hales won the Player of the Match award after more than four years for his 84 (51) comprising of 12 fours and three sixes. In what was the eighth-highest T20I partnership among English batters, it was their second-best opening partnership. Readers must note that Hales is part of England’s four highest opening stands in this format. Jos Buttler confirms preferring Alex Hales over Phil Salt for T20 World Cup 2022 Admitting that picking one out of Hales and Phil Salt as his opening partner for the first T20I on Sunday was “difficult”, Buttler explained why the senior batter was preferred over Salt. ALSO READ: Jos Buttler responds hilariously on why he didn’t appeal for Matthew Wade obstructing the field “Alex [Hales] has a fantastic record in Australia. [Phil] Salt did well in his chances, but we felt that Alex was the man at the top in Australia and for the upcoming World Cup,” Buttler told Fox Cricket during the post-match presentation ceremony. Alex Hales grateful for chances at the top of the order Second-highest run-scorer for Sydney Thunder in the Big Bash League, Hales has amassed 1,502 runs in 45 innings at an average and strike rate of 36.63 and 152.33 respectively including one century and 11 half-centuries for his current club. Before a super successful stint at Thunder, Hales had also represented Melbourne Renegades, Adelaide Strikers and Hobart Hurricanes in the BBL. A total of 2,010 T20 runs in Australia have come at a strike rate of 151.24 for the 33-year old player. “Grateful for the chance at the top of the order, the experience of playing for the Sydney Thunder in the Big Bash has helped me while playing on these surfaces,” Hales told Fox Cricket. Alex Hales loves batting in Australia #AUSvENG pic.twitter.com/yvSbbg6iHg — ESPNcricinfo (@ESPNcricinfo) October 9, 2022 As mentioned by Buttler, Salt has scored his 235 T20I runs at a strike rate of 164.33. Salt, who has spent a couple of seasons at Adelaide Strikers, has scored 671 runs in 30 innings in Australia at a strike rate of 146.51. With no shortage of explosive batters in their squad, England have an in-form Salt on the bench waiting to create instant impact whenever an opportunity comes his way. The post “Alex has a fantastic record in Australia”: Jos Buttler confirms preferring Alex Hales over Phil Salt for T20 World Cup 2022 appeared first on The SportsRush.","pubDate":"2022-10-09 14:29:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli vs Dinesh Karthik - Who's better in Death Overs?","link":"https://www.indiatvnews.com/sports/cricket/virat-kohli-vs-dinesh-karthik-who-s-better-in-death-overs-a-look-ahead-of-t20-world-cup-2022-2022-10-09-814941","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli is often regarded as one of the best batters in T20 cricket. His role is associated with that of an anchor - one around whom other players play. Amidst all this, his ball-striking abilities in the death overs go unnoticed.","content":null,"pubDate":"2022-10-09 14:21:54","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"'Blatant obstructing': Bizarre Matthew Wade move against England quick sparks controversy - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9hdXN0cmFsaWEtdi1lbmdsYW5kLWZpcnN0LXQyMC1tYXR0aGV3LXdhZGUtbWFyay13b29kLW9ic3RydWN0aW9uLXZpZGVvLzMyMTFiZDIzLWI3YWMtNGYyYS1hZWI2LTM2ZGJjZWU5MTQ0YtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Blatant obstructing': Bizarre Matthew Wade move against England quick sparks controversy  Wide World of SportsStoinis and Buttler weigh in on Wade, Wood collision | Alinta News Wrap  cricket.com.au‘Cheaters’: Cricket world fumes at Aussie’s act  news.com.au‘Not like the Aussies to behave unfairly’: World blows up after star’s sneaky move  Fox SportsEngland sneak home despite David Warner’s heroics in Perth  PerthNowView Full coverage on Google News","content":null,"pubDate":"2022-10-09 13:32:22","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"“We’re here for a long time in Australia”: Jos Buttler responds hilariously on why he didn’t appeal for Matthew Wade obstructing the field","link":"https://thesportsrush.com/cricket-news-were-here-for-a-long-time-in-australia-jos-buttler-responds-hilariously-on-why-he-didnt-appeal-for-matthew-wade-obstructing-the-field/","keywords":["Cricket","Australia","England","England tour of Australia 2022","Jos Buttler","Mark Wood","matthew wade"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jos Buttler: The English captain opted to not appeal for a potential obstructing the field dismissal at the Perth Stadium today. England captain Jos Buttler has expressed delight at kick-starting their tour of Australia with an 8-run victory in a high-scoring match at the Perth Stadium today. Returning to action after more than seven weeks,… The post “We’re here for a long time in Australia”: Jos Buttler responds hilariously on why he didn’t appeal for Matthew Wade obstructing the field appeared first on The SportsRush.","content":"England captain Jos Buttler has expressed delight at kick-starting their tour of Australia with an 8-run victory in a high-scoring match at the Perth Stadium today. Returning to action after more than seven weeks, Buttler was particularly pleased with the manner in which he scored a 16th T20I half-century in a match-winning 132-run opening partnership alongside Alex Hales. Australia opening batter David Warner’s 24th T20I half-century had provided hints of sealing a chase especially after a 24-ball 53-run fourth-wicket partnership alongside all-rounder Marcus Stoinis. However, England fast bowler Mark Wood emerging as the pick of their bowlers with figures of 4-0-34-3 to be assisted by left-arm pacers Sam Curran and Reece Topley on the back of their couple of wickets each restricted the hosts to 200/9 in 20 overs in a 209-run chase. “It was a great game of cricket and I was delighted to go over the line. They played outstandingly and put us under pressure. It was important for us to take wickets, which is what [Mark] Wood and [Sam] Curran did,” Buttler told during the post-match presentation ceremony. Australia vs England first T20I, however, ended up gaining limelight for a completely different reason than the 400+ runs scored across two innings. It all happened on the third delivery of the 16th over when Australia wicket-keeper batter Matthew Wade appeared to be deliberately putting his hand in front of Wood to stop him from completing a caught and bowled. Yet to get off the mark at that point, Wade had played three dot balls with his team needing 39 runs off 21 balls. Wade, who gave an initial impression of not being aware about the ball, was found wanting when in replays. A potential obstructing the field dismissal didn’t come into effect because Buttler opted to not appeal for the same. That being said, social media platform Twitter has already passed a verdict against Wade for doing what he did on purpose. Matthew Wade did wrong thing, it’s not spirit of the game but he did against England so i am with him — Nimitt (@sarcasticnimitt) “I was looking at the ball the whole time. So, wasn’t sure what happened. They [umpires] asked if I wanted to appeal but I thought ‘We are here for a long time in Australia’ [smiles]. Risky one to go for so early in the trip,” Buttler added stating that he might have appealed had it been a World Cup match. In addition to the ongoing three-match series and ICC T20 World Cup 2022, England are also scheduled to play a three-match ODI series in Australia post the world event next month. England, whose cricketers and fans generally bring to light the “Spirit of Cricket” debate, should’ve ideally lodged an appeal against Wade irrespective of the duration of their stay in the country.","pubDate":"2022-10-09 13:23:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Difficult to say”: Jonny Bairstow unsure of time frame to recover from golf injury","link":"https://thesportsrush.com/cricket-news-difficult-to-say-jonny-bairstow-unsure-of-time-frame-to-recover-from-golf-injury/","keywords":["Cricket","England","ICC T20 World Cup 2022","Jonny Bairstow"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jonny Bairstow unsure of time frame: The English batter is highly disappointed at missing ICC T20 World Cup 2022. At the cost of sounding repetitive, England batter Jonny Bairstow admitted to be gutted for missing the ongoing tour of Australia and the imminent ICC T20 World Cup 2022 down under. One of the batters to… The post “Difficult to say”: Jonny Bairstow unsure of time frame to recover from golf injury appeared first on The SportsRush.","content":"At the cost of sounding repetitive, England batter Jonny Bairstow admitted to be gutted for missing the ongoing tour of Australia and the imminent ICC T20 World Cup 2022 down under. One of the batters to watch out for in the World Cup in the general run of things, Bairstow suffered a to do unwanted but immense damage to his left leg. “I’m absolutely gutted. To have been on a phone call with Motty [Matthew Mott, head coach] and Jos [Buttler, captain] around the World Cup [and] potentially open the batting [with Buttler]. Unfortunately, to have an injury to the leg is really disappointing,” Bairstow told in a posted by their Twitter handle. While all of Bairstow’s T20Is in 2022 had come in the middle-order, his had motivated the English team management to promote him as an opening batter in Australia. Had Bairstow not suffered an injury, he would’ve opened in the shortest format for the first time since ICC T20 World Cup 2021. Bairstow, whose scary and unreal swollen leg images had gone viral back then, divulged technical details about what all he managed to hurt on a golf course. Asked about a particular time frame with respect to a return to the cricket field, Bairstow acknowledged to be unsure of the same for now. “Broken my fibula in three places. Got a plate in that. Dislocated my ankle at the same time. Done something called as syndesmosis as well with a couple of more little bits to add to it. “Time frame [to recover] is difficult to say at this point in time. It is not going to be this year. We’ll be on to the next year. And look we’ll set some targets further down the line,” Bairstow mentioned. England should consider themselves lucky that they still have an explosive opening pair of Buttler and Alex Hales in the absence of Bairstow and . Opening the batting together for the first time at the highest level, Buttler and Hales put together a match-winning 68-ball 132-run opening stand in the recently concluded first T20I in Perth.","pubDate":"2022-10-09 12:45:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Hales, Buttler lead England to win over Australia in T20 run-fest","link":"https://www.channelnewsasia.com/sport/cricket-hales-buttler-lead-england-win-over-australia-t20-run-fest-2998186","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-09 12:40:45","image_url":"https://onecms-res.cloudinary.com/image/upload/s--zljNDjDe--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-10-09t124045z_1_lynxmpei9804p_rtroptp_3_cricket-t20-eng-zaf-report.jpg?itok=JACtD2-D","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"England let Matthew Wade get away with obstructing the field in victory over Australia - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMibGh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjIvMTAvMDkvZW5nbGFuZC12cy1hdXN0cmFsaWEtbGl2ZS1zY29yZS0xc3QtdDIwLWludGVybmF0aW9uYWwtbGF0ZXN0L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England let Matthew Wade get away with obstructing the field in victory over Australia  The TelegraphEngland in Australia: Alex Hales & Mark Wood star in first T20  bbc.co.ukEngland clinch tight win despite Warner, Ellis heroics | Australia v England 2022  cricket.com.auEngland beat Australia by eight runs in first men’s T20 – as it happened  The GuardianEngland beat T20 World Cup favourites Australia by eight runs in gripping first T20 international in Perth  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2022-10-09 12:37:44","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Wood’s speed kills Australia on batters’ night in Perth - Sydney Morning Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LnNtaC5jb20uYXUvc3BvcnQvY3JpY2tldC93b29kLXMtc3BlZWQta2lsbHMtYXVzdHJhbGlhLW9uLWJhdHRlcnMtbmlnaHQtaW4tcGVydGgtMjAyMjEwMDktcDVib2RiLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Wood’s speed kills Australia on batters’ night in Perth  Sydney Morning HeraldEngland clinch tight win despite Warner, Ellis heroics | Australia v England 2022-23  cricket.com.auAussies fall agonisingly short in 11-year first  news.com.auEngland posts eight-run win over Australia in T20 international series opener despite Warner master class  ABC NewsButtler's and Hales's exhilarating start helps England to T20 win in Australia  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-10-09 12:33:17","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia fall eight runs short of victory after Jos Buttler, Alex Hales blast England to 6-208 in Perth","link":"https://thewest.com.au/sport/australian-cricket-team/australia-fall-eight-runs-short-of-victory-after-jos-buttler-alex-hales-blast-england-to-6-208-in-perth-c-8492849","keywords":null,"creator":["Aaron Kirby"],"video_url":null,"description":"A vintage David Warner knock wasn’t enough for Australia to overcome a Jos Buttler and Alex Hales blitz as international cricket made a thrilling return to Perth for the first time in three years.","content":null,"pubDate":"2022-10-09 12:29:51","image_url":"https://images.thewest.com.au/publication/C-8492849/c2624ba11b112c3fd017f7a5498332097f5dbb1c-16x9-x264y202w1502h845.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shahbaz Ahmed’s strict father still can’t believe the Team India debutant dropped out of engineering to play cricket","link":"https://indianexpress.com/article/sports/cricket/shahbaz-ahmed-team-india-family-bio-story-8199138/","keywords":["Cricket","Sports"],"creator":["Pratyush Raj"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-09 12:16:22","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"England in Australia: Alex Hales & Mark Wood star in first T20 - bbc.co.uk","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzYzMTkxMzc30gEuaHR0cHM6Ly93d3cuYmJjLmNvbS9zcG9ydC9jcmlja2V0LzYzMTkxMzc3LmFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England in Australia: Alex Hales & Mark Wood star in first T20  bbc.co.ukEngland clinch tight win despite Warner, Ellis heroics | Australia v England 2022  cricket.com.auEngland beat Australia by eight runs in first men’s T20 – as it happened  The GuardianEngland beat T20 World Cup favourites Australia by eight runs in gripping first T20 international in Perth  Sky SportsEngland get World Cup tour off to perfect start with eight-run win against Australia in first T20  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-10-09 12:04:07","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"}]}