{"newsArray":[{"title":"Ashes 2021-22 fifth Test, day three: Australia v England – live!","link":"https://www.theguardian.com/sport/live/2022/jan/16/ashes-2021-22-australia-vs-england-day-three-3-cricket-5th-fifth-test-live-score-card-aus-v-eng-start-time-latest-updates","keywords":["Ashes 2021-22","The Ashes","Australia cricket team","England cricket team","Cricket","Australia sport","Sport","Over by over reports"],"creator":["Sam Perry (now) and Daniel Harris (later)"],"video_url":null,"description":"Play in the day-night Test starts at 2.30pm in Hobart, 3.30am GMTThe Spin: subscribe to our weekly cricket newsletterAny thoughts? Email Sam or tweet @sjjperryHere’s a deeper, better account of yesterday’s cricket from The Guardian’s chief cricket correspondent, Ali Martin ... Hello again! Continue reading...","content":null,"pubDate":"2022-01-16 03:08:31","full_description":"Geoff Lemon is out there in Hobart. The weather looks excellent right now. Gorgeous day in Hobart for the closing stages of the Ashes. pic.twitter.com/Cez0rDoAJj With the series in its final throes, we’re finally seeing some public advocacy for Justin Langer. Last night, Steve Waugh “took” to Instagram to back JL, and now his brother, Mark, seems to have done the same... Mark Waugh has thrown his support behind incumbent Aussie coach Justin Langer. #Ashes pic.twitter.com/48HjuzaRN0 Here’s a deeper, better account of yesterday’s cricket from The Guardian’s chief cricket correspondent, Ali Martin ... Hello again! Here we all are, this 23rd day on the Ashes calendar (give or take a few early finishes), gathered again for another round of story-making because we can’t get enough. If you’re doing this from the earliest of hours in the UK, more and all power to you. Though they bookended it with a bit of success, it was another reasonably rough day for the visitors yesterday. 17 wickets fell, 10 of them England’s, as another 2-out-all-out performance resulted in 188 runs on the board, 115 short of Australia’s total. Root briefly threatened. Cummins took 4. You know how it goes by now. There were some fireworks in the last hour as Broad continued his dominance over Warner, Marnus exited and Khawaja succumbed to Wood, and now England will be hoping the steamrolling can continue this afternoon. That England had yet to post in excess of 300 was the prevailing statistic yesterday, and with Australia 150 ahead, they’ll need to mobilise some wickets quickly to give themselves any sniff of an unlikely victory. The wicket is tough and Australia will look to build that lead however possible, but whatever the case, we can probably expect some explosive cricket because not only is the pitch willing, it may be that both teams are equally willing to finish things off soon, whatever the result.","image_url":"https://i.guim.co.uk/img/media/afa8569636a86ff4aa220cdc95ff0388c37ff11e/0_146_4437_2662/master/4437.jpg?width=460&quality=85&auto=format&fit=max&s=1a6f1c75d45e24239cbe747516fec615","source_id":"theguardian"},{"title":"5th Test, Day 3 Live: Australia Seek Stability After England's Fightback","link":"https://sports.ndtv.com/cricket/ashes-5th-test-australia-vs-england-day-3-live-cricket-updates-2710610","keywords":null,"creator":null,"video_url":null,"description":"Ashes, 5th Test, Day 3 Live Cricket Updates: Australia will look to increase their lead over England in the second innings of the fifth and final Ashes Test at the Blundstone Arena in Hobart on...","content":null,"pubDate":"2022-01-16 02:45:13","full_description":"Ashes, 5th Test, Day 3 Live Cricket Updates: Australia will look to increase their lead over England in the second innings of the fifth and final Ashes Test at the Blundstone Arena in Hobart on Sunday. After bowling out England for a below-par total of 188, the hosts were reduced to 37 for three by the visitors, leading by 152 runs at stumps on Day 2 . Steve Smith was batting on 17 while nigh watchman Scott Boland was also unbeaten on 3 after Australia had lost their top-three batters. Earlier, Australia had posted 303 on the back of Travis Head's century on Day 1. Initially, England had won the toss and elected to bat in the second Day-Night Test of the ongoing five-match series. (LIVE SCORECARD) In some big news coming out of India, Virat Kohli has decided to step down as the Test skipper of the side after an illustrious phase at the helm. He led India in 68 Tests out of which the team won 50 games with a win percentage of just under 60. This makes Kohli the most successful Test skipper for India to date and this includes taking the team to number 1 ranking and to the final of the inaugural WTC. Now that Kohli has decided to hang his boots and focus on his batting more, it will be interesting to see who takes over as the skipper of the side. It was the same old story for the visitors on Day 2 as all the early inroads made by them just slipped away and they ended up conceding more runs than they should have. The batting, well it was as poor as it has been throughout the series and in about two sessions of play, England were bundled out. Their pacers though bowled their heart out late in the day and have managed to put their team in a position from which they can at least allow themselves a chance in this match. So, will the English bowlers get those early breakthroughs and make a contest out of this one? Or will the hosts manage to consolidate a decent lead and put the visitors out of their misery yet again? We'll find out soon. Australia lead by 152 runs and just like the first innings, have lost 3 early wickets. The pair of Steven Smith and Scott Boland did tremendously well to fend off an on-song English attack late in the day and they will now look to utilize the afternoon to get that lead past at least 250. We have already seen what the pink ball can do late in the evening and the Aussies will want to take advantage while conditions are better for batting. Hello and a warm welcome to Day 3 of the fifth and final Ashes Test at the Bellerive Oval. Day 2 had no rain but there was cloud cover and it certainly was a day dominated by bowlers. As many as 17 wickets fell and if that is anything to go by then we can expect a lot of action today as well. The weather looks to be perfect throughout the day and it should be better for batting early in the afternoon. Let's see which side can come out of the blocks quickly and seize their opportunities. ... Day 3, Session 1 ... Right then! Day 3 is known as the moving day in Test cricket but it might just be the final day of the 2021-22 Ashes series as well. With the English bowlers keeping their team in the match, it is set up really nicely and whichever team makes an early start on Day 3, will hold the advantage. Do join us on the 16th for Day 3's live action. The first ball will be bowled at 9:00 am IST (3:30 am GMT). But as you all know, the buildup will begin well in advance. So make sure you join us for the same. Till then, take care and goodbye! England did not have the best of days with the bat, which has been the case for them for the entire series but they their bowlers have bent their backs and made sure that they are still in the game. They managed to bowl out Australia for 303 in the first innings but their batters failed to put on a show at Hobart. Their openers, Crawley and Burns fell cheaply and it was once again the pair of Root and Malan who had to do the repair work. They did manage to steady the ship but both of them perished in quick succession and the English side was sent on the back foot. If not for the tailenders contribution at the fag end, England would have failed to go past even the 150-run mark. However, the tourists needed to get early breakthroughs with the ball, and boy have they delivered! Broad set the tone upfront and got rid of the dangerous David Warner for a pair. Woakes also made the pink ball talk and he got the prized wicket of Marnus Labuschagne, although it wasn't the best of deliveries. Wood bowled his heart out and got the wicket of Usman Khawaja with an unplayable bumper. The English bowlers have done a good job on Day 2 and they must ensure that they restrict the hosts to a chaseable target on Day 3. The Aussies started the day at 241/6 and the GOAT, Nathan Lyon played a crucial cameo to take his team past the 300-run mark. The Aussies followed it up with a brilliant bowling peformance and bundled out the tourists for just 188. Their skipper, Pat Cummins, led from the front and finished with 4 wickets to his name. All the Aussie bowlers executed their plans to perfection and they were so accurate that Cummins did not even bowl his spinner, Nathan Lyon for one over. Starc, the pink-ball specialist, wasn't at his very best but he managed to grab 3 wickets in the end. The Aussies had a tricky period of play to negotiate and the English bowlers made things hard for them. David Warner was sent back for a pair and Labuschagne also followed suit after scoring just 5 runs. Khawaja and Smith tried to steady the innings but Khawaja got an unplayable delivery from Wood and his resistance came to an end. Scott Boland joined Steven Smith as a night watchman and he ensured that the Aussies do not lose any more wickets. Wow! What a riveting day's play we have witnessed at the Bellerive Oval. As many as 17 wickets fell in the day and this Test is tantalizingly poised now. The English bowlers have done well to get wickets under the floodlights after the tourists were bundled out for just 188 in the first innings. Boland survives! Well bowled and well played! Mark Wood puts everything in this last delivery and gets in the yorker on middle at 145 kph. Scott Boland just about manages to get his bat down in time to jam it out towards short leg. A brilliant end to the day as Australia finish the day on 36/3 and they lead by 152 runs. Just short! A fiery bumper, around middle and leg. The ball hurries onto Boland as he looks to keep it at bay. The ball hits the gloves and loops up but falls well short of leg gully. Well played by Boland. On a good length, angled at the body and Boland manages to keep it down. A length ball, on middle and Boland gets bat on it yet again. Back of a length, around middle and leg. Boland manages to keep it down. That is a sore one! A spicy short ball, on the body. Boland tries his best to fend it away but gets hit flush on the index finger. He seems to be in some pain but the physio isn't out on the field. The physio does eventually come out but the umpire sends him back as he feels the batter is trying to make the most of it. On off and angling back in sharply. Smith keeps it out on the leg side. Back of a length, around middle and leg. This is worked through square leg for a single by Boland. Fuller in length, angled at the pads. Boland looks to flick but the ball skids through and gets hit on the pads. Length again, around middle and Boland keeps it out. Ooh! Sam Billings has the ball up in the air and looks like he's certain. The ball is pitched up and is angled into off stump. The ball straightens after pitching and whizzes past the outside edge of Boland's bat. Joe Root has a think about it but decides against it. The replay shows that the ball missed the bat.","image_url":"https://c.ndtvimg.com/2022-01/ktp9seug_england-afp_625x300_16_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Virat Kohli quits Test captaincy: Netizens accuse BCCI and Sourav Ganguly for shocking decision, check reactions","link":"https://zeenews.india.com/cricket/virat-kohli-quits-test-captaincy-netizens-accuse-bcci-and-sourav-ganguly-for-shocking-decision-check-reactions-2428221.html","keywords":null,"creator":null,"video_url":null,"description":"Despite such a good record, Kohli has stunned everyone with his announcement and now netizens are blaming the Board of Control for Cricket in India (BCCI) and its president Sourav Ganguly for 'politics' in the Indian cricket board which forced the batter to make the shocking decision.","content":null,"pubDate":"2022-01-16 01:37:00","full_description":"Within months after he opted to step down as India's T20I skipper and was sacked from a leadership role in ODIs, Virat Kohli has now relinquished the captaincy of the Test side as well. The shocking announcement came a day after India's 1-2 Test series defeat to South Africa in Cape Town. Kohli, who first captained India at the Adelaide Test in 2014 against Australia, was appointed to the full-time role after M.S. Dhoni announced his retirement from the format following the drawn third Test against Australia in Melbourne in December 2014. \"It's been seven years of hard work, toil, and relentless perseverance everyday to take the team in the right direction. I've done the job with absolute honesty and left nothing out there. Everything has to come to a halt at some stage and for me as Test Captain of India, it's now. There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief,\" Kohli posted on social media on Saturday. pic.twitter.com/huBL6zZ7fZ — Virat Kohli (@imVkohli) January 15, 2022 Despite such a good record, Kohli has stunned everyone with his announcement and now netizens are blaming the Board of Control for Cricket in India (BCCI) and its president Sourav Ganguly for 'politics' in the Indian cricket board which forced the batter to make the shocking decision. Check out some of the reactions: Indian cricket fans to bcci, ganguly after Virat Kohli sudden retirement from test cricket captaincy too.... #viratkholi #ViratKohli pic.twitter.com/o6W9oFFiZ2 — Bella Ciao (Chai) (@punjabiii_munda) January 15, 2022 Kohli stepping down from test captaincy proves there's something really weird going on the inside. No way i thought we would have a different test captain before he retires from the format. BCCI behaving like a soap opera now. — Heisenberg (@internetumpire) January 15, 2022 I challenge my life @BCCI you will never find a captain or a player who is passionated and dedicated towards test cricket like #ViratKohli pic.twitter.com/IraU9imbF5 — ARVIND DEVILLIERS (@arvind_17_) January 15, 2022 @SGanguly99 , you are doing politics in Indian cricket. I had respect for you but I think I was wrong. @GautamGambhir who follows cricket will follow @imVkohli not you. https://t.co/IXNT05P3mn — Shailendra Sharma (@SKS_Indore) January 16, 2022 Go to hell Ganguli Script ke sath chlne bale Indian cricket killer You are the wrost person that we have ever faced — Omkar (@Omkar43653876) January 16, 2022 India has lost one finest quality Captain and player too due to poltices of sah and Ganguly ... Thanks #BCCI #BCCIPolitics @SGanguly99 @imVkohli #ViratKohli Virat you will always be our #captaincy #CaptainKohli — Emon Mukherjee (@EmonMukherjee21) January 16, 2022 As per the numbers, Kohli steps down from Test captaincy as the most successful skipper in the longest format of the game for India and fourth overall. Under his time as captain, India played 68 Tests, winning 40, losing 17, and drawing 11 matches, with a win percentage of 58.82 while registering memorable wins in overseas and home conditions.","image_url":null,"source_id":"zeenews"},{"title":"Bolt from the man in blue","link":"https://www.tribuneindia.com/news/sports/bolt-from-the-man-in-blue-361697","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI, January 15Virat Kohli shocked Indian cricket today by abruptly resigning as the national side's Test captain, after leading the team to several memorable victories in his seven years in charge.The 33-year-old, India's most successful test captain, took to Twitter to announce his decision a day after India's 2-1 series defeat in South Africa.\"It's been seven years of hard work, toil and relentless perseverance every day to take the team in the right direction. I've done the job with absolute honesty and left nothing out there,\" Kohli said in his statement. \"Everything has come to a halt at some stage and for me as Test captain of India, it's now. There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief.\"The feisty top-order batsman has had a difficult relationship with the Indian cricket board (BCCI) since stepping down as the T20 captain after last year's World Cup. That cost him the One-day captaincy as well, with the BCCI installing Rohit Sharma as captain in both the short formats.Kohli the greatKnown as well for his passionate leadership as for his glorious cover drives, Kohli led India in a record 68 Test matches, winning 40 and losing 17 to be fourth in the list of captains with most Test victories. Under Kohli, India became the top Test nation and made it to the final of the inaugural World Test Championship last year, where New Zealand beat them to the title.With him at the helm, India ended a 71-year drought when they registered their maiden series victory in Australia in early 2019.His team also held a 2-1 lead in England last year before the final Test in Manchester was postponed following a Covid-19 outbreak in the Indian camp. Kohli led by example to change India's fitness culture and also oversaw the development of a formidable pace attack. \"BCCI congratulates #TeamIndia captain @imVkohli for his admirable leadership qualities that took the Test team to unprecedented heights,\" the Indian board Twitted. — ReutersShocked by decisionAlthough I also am shocked by @imVkohli sudden decision, I respect his call. I can only applaud him for what he has done for world cricket amp; India. Easily one of the most aggressive and fittest players India has had. Hope he'd continue to shine for India as a player. —Suresh Raina, former teammateWhen Virat took over as Test captain, India winning a test overseas was an achievement, now if India lose an overseas Test series it is an upset. And that's how far he has taken Indian cricket forward, and that will be his legacy. —Wasim Jaffer, former india openerMany Congratulations #ViratKohli on an outstanding career as India's Test Captain. Stats don't lie amp; he was not only the most successful Indian Test Captain. —Virender Sehwag, former india batsman4 Kohli is the only Indian captain to achieve four overseas Test victories in a calendar year twice.1 Kohli became the first Indian captain to lead India to a win in Centurion.1 Virat is the first Asian cricketer to lead his team to two wins in Boxing Day Test matches.40 Going by numbers, he was India's best captain by a distance. Dhoni (27 wins from 60 matches) and Ganguly (21 wins out of 49) are next on the list.","content":null,"pubDate":"2022-01-16 01:31:11","full_description":"NEW DELHI, January 15 Virat Kohli shocked Indian cricket today by abruptly resigning as the national side’s Test captain, after leading the team to several memorable victories in his seven years in charge. The 33-year-old, India’s most successful test captain, took to Twitter to announce his decision a day after India’s 2-1 series defeat in South Africa. “It’s been seven years of hard work, toil and relentless perseverance every day to take the team in the right direction. I’ve done the job with absolute honesty and left nothing out there,” Kohli said in his statement. “Everything has come to a halt at some stage and for me as Test captain of India, it’s now. There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief.” The feisty top-order batsman has had a difficult relationship with the Indian cricket board (BCCI) since stepping down as the T20 captain after last year’s World Cup. That cost him the One-day captaincy as well, with the BCCI installing Rohit Sharma as captain in both the short formats. Kohli the great Known as well for his passionate leadership as for his glorious cover drives, Kohli led India in a record 68 Test matches, winning 40 and losing 17 to be fourth in the list of captains with most Test victories. Under Kohli, India became the top Test nation and made it to the final of the inaugural World Test Championship last year, where New Zealand beat them to the title. With him at the helm, India ended a 71-year drought when they registered their maiden series victory in Australia in early 2019. His team also held a 2-1 lead in England last year before the final Test in Manchester was postponed following a Covid-19 outbreak in the Indian camp. Kohli led by example to change India’s fitness culture and also oversaw the development of a formidable pace attack. “BCCI congratulates #TeamIndia captain @imVkohli for his admirable leadership qualities that took the Test team to unprecedented heights,” the Indian board Twitted. — Reuters Shocked by decision Although I also am shocked by @imVkohli sudden decision, I respect his call. I can only applaud him for what he has done for world cricket & India. Easily one of the most aggressive and fittest players India has had. Hope he’d continue to shine for India as a player. —Suresh Raina, former teammate When Virat took over as Test captain, India winning a test overseas was an achievement, now if India lose an overseas Test series it is an upset. And that’s how far he has taken Indian cricket forward, and that will be his legacy. — Wasim Jaffer, former india opener Many Congratulations #ViratKohli on an outstanding career as India’s Test Captain. Stats don’t lie & he was not only the most successful Indian Test Captain. — Virender Sehwag, former india batsman 4 Kohli is the only Indian captain to achieve four overseas Test victories in a calendar year twice. 1 Kohli became the first Indian captain to lead India to a win in Centurion. 1 Virat is the first Asian cricketer to lead his team to two wins in Boxing Day Test matches. 40 Going by numbers, he was India’s best captain by a distance. Dhoni (27 wins from 60 matches) and Ganguly (21 wins out of 49) are next on the list.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_1865669903.JPG","source_id":"tribuneindia"},{"title":"KP Blues, CP Blues, Balochistan Blues win matches","link":"https://www.thenews.com.pk/print/925540-kp-blues-cp-blues-balochistan-blues-win-matches","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: KP Blues, Central Punjab Blues and Balochistan Blues won their matches in the National U16 One-Day Tournament on Saturday.At the Multan Cricket Stadium, Khyber Pakhtunkhwa U16 Blues batted first and scored 213 for six in a match reduced to 36 overs. Usman Khan top-scored with 69 runs....","content":null,"pubDate":"2022-01-16 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Who will win today Big Bash match: Who is expected to win Melbourne Stars vs Brisbane Heat BBL 11 match?","link":"https://thesportsrush.com/cricket-news-who-will-win-today-big-bash-match-who-is-expected-to-win-brisbane-heat-vs-adelaide-strikers-bbl-11-match/","keywords":["Cricket","BBL 11","Big Bash Match Prediction","Stars vs Heat"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Melbourne Stars vs Brisbane Heat: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Melbourne Stars will lock horns against Brisbane Heat in the league game of the ongoing BBL11. The match will be played at the Melbourne Cricket Ground in Melbourne. Melbourne Stars have won five of their 12… The post Who will win today Big Bash match: Who is expected to win Melbourne Stars vs Brisbane Heat BBL 11 match? appeared first on The SportsRush.","content":"Melbourne Stars vs Brisbane Heat: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Melbourne Stars will lock horns against Brisbane Heat in the league game of the ongoing BBL11. The match will be played at the Melbourne Cricket Ground in Melbourne. Melbourne Stars have won five of their 12 games, whereas the Heat have won three of their eleven. The game will be live on Sony Six from 1:45 PM IST. Who will win today Big Bash match: Melbourne Stars vs Brisbane Heat Pitch Report The pitch at the MCG has always been good for batting, but the boundaries are very big on this ground. This pitch has an even bounce and the batters can play their shots. The average 1st innings score in T20s at this ground is 159 runs. Melbourne Stars preview The Stars have won five of their 12 games in the tournament so far, and Adelaide Strikers defeated them in the last game. Joe Clarke and Glenn Maxwell are the impact players of the side, whereas Hilton Cartwright has been the most consistent one. Marcus Stoinis has been a failure this season, and he needs to step up. Adam Zampa will lead the spin bowling, whereas Brody Couch and Sam Rainbird will take care of pace. Nathan Coulter-Nile is set to make his return in this game. Probable XI: Marcus Stoinis, Joe Clarke, Glenn Maxwell, Beau Webster, Joe Burns, Hilton Cartwright, Nathan Coulter-Nile, Clint Hinchcliff, Brody Couch, Adam Zampa, Sam Rainbird. Tough day in Adelaide. See you tomorrow, as we take on the Heat at the @MCG #TeamGreen pic.twitter.com/Pe6o5W7pIP — Melbourne Stars (@StarsBBL) January 15, 2022 Brisbane Heat preview Brisbane Heat have just won three of their games, and all the remaining games are Do or Die for them. Sam Heazlett has been the highest run-scorer of the side, whereas Chris Lynn and Ben Duckett need to be consistent. The team will be boosted by the return of Fakhar Zaman, Michael Neser, Jimmy Peirson, James Bazley, Mitchell Swepson, and Mark Steketee. Mujeeb ur Rahman will now miss the rest of the tournament. Probable XI: Chris Lynn, Fakhar Zaman, Ben Duckett, Sam Heazlett, Jimmy Peirson, Michael Neser, Xavier Bartlett, James Bazley, Mitchell Swepson, Mark Steketee, Matthew Kuhnemann. Match Prediction Brisbane Heat will be the favourites to win this game. The post Who will win today Big Bash match: Who is expected to win Melbourne Stars vs Brisbane Heat BBL 11 match? appeared first on The SportsRush.","pubDate":"2022-01-16 00:30:34","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Australia 3/37 at stumps on Day Two","link":"https://www.cairnspost.com.au/sport/cricket/australia-337-at-stumps-on-day-two/video/39de859a26377a2d7ddabd7d554e12a7","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia have remained in control of the fifth Ashes test in Hobart, enjoying a 152 run lead despite sitting at 3/37.","content":null,"pubDate":"2022-01-15 21:16:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Sixers do the smashing in Sydney Smash","link":"https://www.news.com.au/sport/cricket/sixers-do-the-smashing-in-sydney-smash/video/7111fa1f0de89c6f555fe52361dd9651","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The Sydney Sixers are up to second on the BBL ladder with a game in hand after thrashing the Sydney Thunder in a Sydney Smash at the SCG.","content":null,"pubDate":"2022-01-15 20:56:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"Sixers do the smashing in Sydney Smash","link":"https://www.cairnspost.com.au/sport/cricket/sixers-do-the-smashing-in-sydney-smash/video/7111fa1f0de89c6f555fe52361dd9651","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Sydney Sixers are up to second on the BBL ladder with a game in hand after thrashing the Sydney Thunder in a Sydney Smash at the SCG.","content":null,"pubDate":"2022-01-15 20:56:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Kohli shocks cricket world by quitting as captain","link":"https://wwos.nine.com.au/cricket/virat-kohli-steps-down-as-indias-test-captain-after-seven-years-in-role/1306c41c-4670-41e4-b9fd-7c238b3f4565","keywords":null,"creator":["wwos"],"video_url":null,"description":"Virat Kohli has stepped down as captain of India's Test team after seven years in the position.","content":"Virat Kohli has stepped down as captain of India's Test team after seven years in the position.Kohli led the team for 68 matches and won 40 of them, making him India's most successful Test captain.He made his decision in the wake of India losing a Test series in South Africa 2-1.AS IT HAPPENED: England torment Aussies under lightsAS IT HAPPENED: Kokkinakis' incredible reaction to triumphREAD MORE: Djokovic domino effect sparks $30m 'problem'https://twitter.com/imVkohli/status/1482340422987169794?s=20\"I have always believed in giving my 120 percent in everything I do, and if I can't do that, I know it's not the right thing to do,\" Kohli said in a post on Twitter.\"I have absolute clarity in my heart and I cannot be dishonest to my team.\"The Indian cricket board thanked Kohli for his \"admirable leadership qualities that took the Test team to unprecedented heights.\"Watch every game, set and match of the Australian Open streaming ad-free, live and on demand on Stan SportThe feisty top order batsman has had a difficult relationship with the BCCI since stepping down as the Twenty20 captain after last year's World Cup.That cost him the one-day captaincy as well, with the BCCI installing Rohit Sharma as captain in both the short formats.\"It's been seven years of hard work, toil and relentless perseverance every day to take the team in the right direction. I've done the job with absolute honesty and left nothing out there,\" Kohli said in his statement.\"Everything has come to a halt at some stage and for me as Test captain of India, it's now. There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief.\"BCCI officials were not immediately available to confirm who would take over as India's next Test captain, although opener KL Rahul's name has already started doing the rounds.The board's secretary Jay Shah wrote on Twitter after Kohli's surprise announcement: \"Virat turned the team into a ruthless fit unit that performed admirably both in India and away. The Test wins in Australia & England have been special.\"And tributes flowed from around the cricketing world.https://twitter.com/RaviShastriOfc/status/1482365980827594753?s=20https://twitter.com/ivivianrichards/status/1482363332761841670?s=20https://twitter.com/klrahul11/status/1482406495891628033?s=20https://twitter.com/sachin_rt/status/1482402116572696577?s=20https://twitter.com/WasimJaffer14/status/1482347022976167940?s=20https://twitter.com/ImRaina/status/1482354646689906690?s=20https://twitter.com/SGanguly99/status/1482431871099174914?s=20https://twitter.com/bhogleharsha/status/1482362370949545986?s=20For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-15 20:45:35","full_description":"Virat Kohli has stepped down as captain of India's Test team after seven years in the position. Kohli led the team for 68 matches and won 40 of them, making him India's most successful Test captain. He made his decision in the wake of India losing a Test series in South Africa 2-1. AS IT HAPPENED: England torment Aussies under lights AS IT HAPPENED: Kokkinakis' incredible reaction to triumph READ MORE: Djokovic domino effect sparks $30m 'problem' \"I have always believed in giving my 120 percent in everything I do, and if I can't do that, I know it's not the right thing to do,\" Kohli said in a post on Twitter. \"I have absolute clarity in my heart and I cannot be dishonest to my team.\" The Indian cricket board thanked Kohli for his \"admirable leadership qualities that took the Test team to unprecedented heights.\" Watch every game, set and match of the Australian Open streaming ad-free, live and on demand on Stan Sport The feisty top order batsman has had a difficult relationship with the BCCI since stepping down as the Twenty20 captain after last year's World Cup. That cost him the one-day captaincy as well, with the BCCI installing Rohit Sharma as captain in both the short formats. \"It's been seven years of hard work, toil and relentless perseverance every day to take the team in the right direction. I've done the job with absolute honesty and left nothing out there,\" Kohli said in his statement. \"Everything has come to a halt at some stage and for me as Test captain of India, it's now. There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief.\" BCCI officials were not immediately available to confirm who would take over as India's next Test captain, although opener KL Rahul's name has already started doing the rounds. The board's secretary Jay Shah wrote on Twitter after Kohli's surprise announcement: \"Virat turned the team into a ruthless fit unit that performed admirably both in India and away. The Test wins in Australia & England have been special.\" And tributes flowed from around the cricketing world. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/404148/pickerimage.jpg","source_id":"nine"},{"title":"Canada captain Mihir Patel scores 96 in losing cause at ICC Under-19 World Cup","link":"https://www.princegeorgecitizen.com/national-sports/canada-captain-mihir-patel-scores-96-in-losing-cause-at-icc-under-19-world-cup-4959549","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup.","content":null,"pubDate":"2022-01-15 20:31:08","full_description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup. The Emirates won the toss and elected to bat first at the Conaree Sports Club, scoring 284 runs at the expense of seven wickets in their 50 overs. Ali Naseer led the attack with 73 runs including five fours and four sixes in his 50-ball innings. Canadian bowlers Parmveer Kharoud and Gurnek Johal Singh each took two wickets. Patel hit eight fours and added two sixes in his 115-ball knock. But the Canadian men could not score runs quickly enough and lost their four wickets for 34 runs as they went down swinging. Patek, a second-year finance student at York University, was eventually caught off an Alishan Sharafu delivery — the last Canadian wicket to fall. Anoop Chima added 46 for Canada while Kaifrav Sharma contributed 43 as Canada was all out for 235 in 46.4 overs. Canada is making its fifth straight appearance -- eighth overall -- at the tournament. It has yet to make it past the first round with an 11th-place finish in 2010 its best showing. Canada was beaten by the Emirates in the group stage at the 2020 tournament in South Africa but avenged that defeat in the 13th-place playoff. Patel scored 90 runs off 105 balls in the eight-wicket loss to the Emirates. The 16 teams have been split into four groups with the top two in each advancing to the Super League and the remaining sides moving on to the Plate playoffs. The competition runs through Feb. 5 across four Caribbean countries. The Canadians, who beat out Argentina, Bermuda and the U.S. to get to the tournament, face England on Tuesday before taking on defending champion Bangladesh next Thursday in Group A play. --- This report by The Canadian Press was first published Jan. 15, 2022 The Canadian Press","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2022/01/20220115150128-61e32e5bfe4c80b2086898f3jpeg.jpg;w=960","source_id":"princegeorgecitizen"},{"title":"Canada captain Mihir Patel scores 96 in losing cause at ICC Under-19 World Cup","link":"https://www.burnabynow.com/national-sports/canada-captain-mihir-patel-scores-96-in-losing-cause-at-icc-under-19-world-cup-4959549","keywords":null,"creator":null,"video_url":null,"description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup.","content":null,"pubDate":"2022-01-15 20:31:08","full_description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup. The Emirates won the toss and elected to bat first at the Conaree Sports Club, scoring 284 runs at the expense of seven wickets in their 50 overs. Ali Naseer led the attack with 73 runs including five fours and four sixes in his 50-ball innings. Canadian bowlers Parmveer Kharoud and Gurnek Johal Singh each took two wickets. Patel hit eight fours and added two sixes in his 115-ball knock. But the Canadian men could not score runs quickly enough and lost their four wickets for 34 runs as they went down swinging. Patek, a second-year finance student at York University, was eventually caught off an Alishan Sharafu delivery — the last Canadian wicket to fall. Anoop Chima added 46 for Canada while Kaifrav Sharma contributed 43 as Canada was all out for 235 in 46.4 overs. Canada is making its fifth straight appearance -- eighth overall -- at the tournament. It has yet to make it past the first round with an 11th-place finish in 2010 its best showing. Canada was beaten by the Emirates in the group stage at the 2020 tournament in South Africa but avenged that defeat in the 13th-place playoff. Patel scored 90 runs off 105 balls in the eight-wicket loss to the Emirates. The 16 teams have been split into four groups with the top two in each advancing to the Super League and the remaining sides moving on to the Plate playoffs. The competition runs through Feb. 5 across four Caribbean countries. The Canadians, who beat out Argentina, Bermuda and the U.S. to get to the tournament, face England on Tuesday before taking on defending champion Bangladesh next Thursday in Group A play. --- This report by The Canadian Press was first published Jan. 15, 2022 The Canadian Press","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2022/01/20220115150128-61e32e5bfe4c80b2086898f3jpeg.jpg;w=960","source_id":"burnabynow"},{"title":"Canada captain Mihir Patel scores 96 in losing cause at ICC Under-19 World Cup","link":"https://www.nsnews.com/national-sports/canada-captain-mihir-patel-scores-96-in-losing-cause-at-icc-under-19-world-cup-4959549","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup.","content":null,"pubDate":"2022-01-15 20:31:08","full_description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup. The Emirates won the toss and elected to bat first at the Conaree Sports Club, scoring 284 runs at the expense of seven wickets in their 50 overs. Ali Naseer led the attack with 73 runs including five fours and four sixes in his 50-ball innings. Canadian bowlers Parmveer Kharoud and Gurnek Johal Singh each took two wickets. Patel hit eight fours and added two sixes in his 115-ball knock. But the Canadian men could not score runs quickly enough and lost their four wickets for 34 runs as they went down swinging. Patek, a second-year finance student at York University, was eventually caught off an Alishan Sharafu delivery — the last Canadian wicket to fall. Anoop Chima added 46 for Canada while Kaifrav Sharma contributed 43 as Canada was all out for 235 in 46.4 overs. Canada is making its fifth straight appearance -- eighth overall -- at the tournament. It has yet to make it past the first round with an 11th-place finish in 2010 its best showing. Canada was beaten by the Emirates in the group stage at the 2020 tournament in South Africa but avenged that defeat in the 13th-place playoff. Patel scored 90 runs off 105 balls in the eight-wicket loss to the Emirates. The 16 teams have been split into four groups with the top two in each advancing to the Super League and the remaining sides moving on to the Plate playoffs. The competition runs through Feb. 5 across four Caribbean countries. The Canadians, who beat out Argentina, Bermuda and the U.S. to get to the tournament, face England on Tuesday before taking on defending champion Bangladesh next Thursday in Group A play. --- This report by The Canadian Press was first published Jan. 15, 2022 The Canadian Press","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2022/01/20220115150128-61e32e5bfe4c80b2086898f3jpeg.jpg;w=960","source_id":"nsnews"},{"title":"Canada captain Mihir Patel scores 96 in losing cause at ICC Under-19 World Cup","link":"https://www.richmond-news.com/national-sports/canada-captain-mihir-patel-scores-96-in-losing-cause-at-icc-under-19-world-cup-4959549","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup.","content":null,"pubDate":"2022-01-15 20:31:08","full_description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup. The Emirates won the toss and elected to bat first at the Conaree Sports Club, scoring 284 runs at the expense of seven wickets in their 50 overs. Ali Naseer led the attack with 73 runs including five fours and four sixes in his 50-ball innings. Canadian bowlers Parmveer Kharoud and Gurnek Johal Singh each took two wickets. Patel hit eight fours and added two sixes in his 115-ball knock. But the Canadian men could not score runs quickly enough and lost their four wickets for 34 runs as they went down swinging. Patek, a second-year finance student at York University, was eventually caught off an Alishan Sharafu delivery — the last Canadian wicket to fall. Anoop Chima added 46 for Canada while Kaifrav Sharma contributed 43 as Canada was all out for 235 in 46.4 overs. Canada is making its fifth straight appearance -- eighth overall -- at the tournament. It has yet to make it past the first round with an 11th-place finish in 2010 its best showing. Canada was beaten by the Emirates in the group stage at the 2020 tournament in South Africa but avenged that defeat in the 13th-place playoff. Patel scored 90 runs off 105 balls in the eight-wicket loss to the Emirates. The 16 teams have been split into four groups with the top two in each advancing to the Super League and the remaining sides moving on to the Plate playoffs. The competition runs through Feb. 5 across four Caribbean countries. The Canadians, who beat out Argentina, Bermuda and the U.S. to get to the tournament, face England on Tuesday before taking on defending champion Bangladesh next Thursday in Group A play. --- This report by The Canadian Press was first published Jan. 15, 2022 The Canadian Press","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2022/01/20220115150128-61e32e5bfe4c80b2086898f3jpeg.jpg;w=960","source_id":"richmond-news"},{"title":"Canada captain Mihir Patel scores 96 in losing cause at ICC Under-19 World Cup","link":"https://www.sootoday.com/national-sports/canada-captain-mihir-patel-scores-96-in-losing-cause-at-icc-under-19-world-cup-4959549","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup.","content":null,"pubDate":"2022-01-15 20:31:08","full_description":"BASSETERRE, Saint Kitts And Nevis — Captain Mihir Patel scored 96 in a losing cause Saturday as Canada was beaten by 49 runs by the United Arab Emirates in their opening match at the ICC Under 19 Men’s Cricket World Cup. The Emirates won the toss and elected to bat first at the Conaree Sports Club, scoring 284 runs at the expense of seven wickets in their 50 overs. Ali Naseer led the attack with 73 runs including five fours and four sixes in his 50-ball innings. Canadian bowlers Parmveer Kharoud and Gurnek Johal Singh each took two wickets. Patel hit eight fours and added two sixes in his 115-ball knock. But the Canadian men could not score runs quickly enough and lost their four wickets for 34 runs as they went down swinging. Patek, a second-year finance student at York University, was eventually caught off an Alishan Sharafu delivery — the last Canadian wicket to fall. Anoop Chima added 46 for Canada while Kaifrav Sharma contributed 43 as Canada was all out for 235 in 46.4 overs. Canada is making its fifth straight appearance -- eighth overall -- at the tournament. It has yet to make it past the first round with an 11th-place finish in 2010 its best showing. Canada was beaten by the Emirates in the group stage at the 2020 tournament in South Africa but avenged that defeat in the 13th-place playoff. Patel scored 90 runs off 105 balls in the eight-wicket loss to the Emirates. The 16 teams have been split into four groups with the top two in each advancing to the Super League and the remaining sides moving on to the Plate playoffs. The competition runs through Feb. 5 across four Caribbean countries. The Canadians, who beat out Argentina, Bermuda and the U.S. to get to the tournament, face England on Tuesday before taking on defending champion Bangladesh next Thursday in Group A play. --- This report by The Canadian Press was first published Jan. 15, 2022 The Canadian Press","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2022/01/20220115150128-61e32e5bfe4c80b2086898f3jpeg.jpg;w=960","source_id":"sootoday"},{"title":"Cricket shocked as Kohli quits after outburst","link":"https://www.news.com.au/sport/cricket/cricket-world-shocked-as-virat-kohli-quits-after-angry-outburst/news-story/e11fca567912cbb3456ce8bd35382740","keywords":null,"creator":null,"video_url":null,"description":"India’s Virat Kohli quit as Test captain on Sunday morning, bringing to an end a controversy-laden stint in one of the highest-profile, highest-pressure positions in sport.","content":null,"pubDate":"2022-01-15 20:25:00","full_description":"India’s Virat Kohli quit as Test captain on Sunday morning, bringing to an end a controversy-laden stint in one of the highest-profile, highest-pressure positions in sport. “Everything has to come to a halt at some stage and for me as Test captain of India, it’s now,” he posted on Twitter, a day after his side lost a three-match Test series to South Africa. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . The 33-year-old Kohli, who stepped down as T20 skipper after a debacle at the World Cup and then lost the one-day job , took over the India leadership across all formats from MS Dhoni in 2017. “There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief,” Kohli said. “I have always believed in giving my 120 per cent in everything I do, and if I can’t do that, I know it’s not the right thing to do. “I have absolute clarity in my heart and I cannot be dishonest to my team,” he added. India lost the final Test in Cape Town by seven wickets to go down 2-1, with Kohli blaming the team’s poor batting for the defeat. He was involved in a DRS controversy in his final Test as captain when he and some of his players in South Africa reacted angrily to an LBW decision that was turned down by the third umpire. Several Indian players, including Kohli, were heard complaining about the decision on the stump microphone and there appeared to be suggestions the host broadcaster was manipulating the technology . Plenty were shocked by Kohli’s decision to step down. Ex-Indian star turned broadcaster and analyst Aakash Chopra tweeted: “Whoaaa … didn’t see that coming. #Kohli.” Respected Indian commentator Harsh Bhogle wrote: “I thought giving up the white ball captaincy was a good idea but I am not as convinced about this move. But now we must accept and wish a great player a fantastic second wind as a batsman. My only wish for him is that he is happy with his decision. “Virat says in his statement that he gave it his all and nobody can ever contest that statement. I have little doubt that he will continue to do that. But this will take some time to digest.” Indian batter Suresh Raina said: “Although I also am shocked by Kohli’s sudden decision, I respect his all. I can only applaud him for what he has done for world cricket and India.” Tributes also poured in for the batting star. “Many Congratulations #ViratKohli on an outstanding career as India’s Test Captain,” former opener Virender Sehwag tweeted. “Stats don’t lie & he was not only the most successful Indian Test Captain but one of the most successful in the world. Can be very proud @imVkohli & looking forward to watch u dominate with the bat.” Kohli took over the Test captaincy in 2014, when India were ranked a lowly seventh in the five-day format, and he took them to number one, a position they held for nearly three years. But in a nation of more than 1.3 billion people and obsessed by cricket, the actions of the national captain are probably scrutinised more closely than anyone’s except the prime minister. And critics always pointed to his failure to land a World Cup triumph in either T20 or ODI cricket. Never afraid of speaking his mind, Kohli recently courted controversy when he said he was informed of his ODI sacking 90 minutes before the team announcement for the South Africa series and was never encouraged to stay on as T20 skipper, as claimed by the Board of Control for Cricket in India president Sourav Ganguly. “I’ve done the job with absolute honesty and left nothing out there,” Kohli said in his statement. Kohli has also quit as captain of Indian Premier League side Royal Challengers Bangalore and many have welcomed his decision to concentrate more on his batting — his form has dipped and has not scored a century in the past two seasons. Kohli thanked former head coach Ravi Shastri, who stepped down after the World Cup, when a much-fancied India exited at the group stage after defeats including going down to arch-rivals Pakistan. Last year India were also beaten by New Zealand in the first ever World Test Championship final. “I want to thank the BCCI for giving me the opportunity to lead my country for such a long period of time and more importantly to all the teammates who bought into the vision I had for the team from day one and never gave up in any situation,” said Kohli. “You guys have made this journey so memorable and beautiful.” Kohli has played 99 Tests for India since his debut in 2011, scoring 7962 runs at an average of over 50. He remains part of the ODI team, led by KL Rahul in the absence of injured Rohit Sharma, that will play three matches in South Africa starting January 19. Cricket great Chris Cairns has shared an encouraging update on his recovery after he had a life-threatening medical episode last year. Indian superstar Virat Kohli has come under scrutiny for his “disgraceful” behaviour during the third Test against South Africa. The Aussies are on top in the fifth Ashes Test but fans were up in arms when they missed chances to enhance their cult hero’s status.","image_url":null,"source_id":"news"},{"title":"Cricket shocked as Kohli quits after outburst","link":"https://www.cairnspost.com.au/sport/cricket/cricket-world-shocked-as-virat-kohli-quits-after-angry-outburst/news-story/e11fca567912cbb3456ce8bd35382740","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"India’s Virat Kohli quit as Test captain on Sunday morning, bringing to an end a controversy-laden stint in one of the highest-profile, highest-pressure positions in sport.","content":null,"pubDate":"2022-01-15 20:25:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"India Under 19 vs South Africa Under 19 Live Score: Dewald Brevis Departs, South Africa U19 Need 91 More Runs To Win - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaWNjLXUxOS13b3JsZC1jdXAtMjAyMi1pbmRpYS11bmRlci0xOS12cy1zb3V0aC1hZnJpY2EtdW5kZXItMTktbGl2ZS1zY29yZS11cGRhdGVzLTI3MDk5MDjSAX9odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2ljYy11MTktd29ybGQtY3VwLTIwMjItaW5kaWEtdW5kZXItMTktdnMtc291dGgtYWZyaWNhLXVuZGVyLTE5LWxpdmUtc2NvcmUtdXBkYXRlcy0yNzA5OTA4L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Under 19 vs South Africa Under 19 Live Score: Dewald Brevis Departs, South Africa U19 Need 91 More Runs To Win  NDTVSports.comIndia Under 19 vs South Africa Under 19 Live Streaming Details- ICC U19 World Cup 2022  Cricket AddictorDon’t lose focus, follow the process, never compromise on your ethics: Priyam Garg  The Indian ExpressIndia vs South Africa Live Score, U19 World Cup 2022: Bawa castles Simelane; SA lose fifth wicket in 233-chase  Hindustan TimesSouth Africa ask India to bat in U-19 World Cup  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-01-15 20:07:44","image_url":null,"source_id":"google"},{"title":"“Would make Rishabh Pant the next Test captain”: Suresh Raina seconds Sunil Gavaskar’s suggestion to elect Rishabh Pant as India’s Test captain","link":"https://thesportsrush.com/cricket-news-would-make-rishabh-pant-the-next-test-captain-suresh-raina-seconds-sunil-gavaskars-suggestion-to-elect-rishabh-pant-as-indias-test-captain/","keywords":["Cricket","rishabh pant","Sunil gavaskar","Suresh Raina"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Suresh Raina seconds Sunil Gavaskar’s suggestion to appoint India wicket-keeper batter Rishabh Pant as India’s next red-ball skipper. It was MS Dhoni post his 90th Test match. It is now Virat Kohli post his 99th. Two Indian greats, two most successful Indian captains, and two sudden, ‘out of the Blue’ decisions to quit Test captaincy… The post “Would make Rishabh Pant the next Test captain”: Suresh Raina seconds Sunil Gavaskar’s suggestion to elect Rishabh Pant as India’s Test captain appeared first on The SportsRush.","content":"Suresh Raina seconds Sunil Gavaskar’s suggestion to appoint India wicket-keeper batter Rishabh Pant as India’s next red-ball skipper. It was MS Dhoni post his 90th Test match. It is now Virat Kohli post his 99th. Two Indian greats, two most successful Indian captains, and two sudden, ‘out of the Blue’ decisions to quit Test captaincy of the Indian Cricket Team. Unceremonious exits on a sour note indeed, but two captaincy careers every Indian fan can be proud of. Kohli relinquishes from his post, thanks MS Dhoni for believing in him, and ends his career with the accolade of being India’s most successful Test captain ever. Having commenced his Test captaincy stint in 2015, Kohli ends his brilliant run with 40 Test wins (including 16 Overseas Tests) across 68 Tests; India’s best captain by a distance. Dhoni (27 wins from 60 matches) and Ganguly (21 wins out of 49) are next on the list. KL Rahul, has been elected as India’s next Test skipper, with Rohit Sharma having already been elected as White Ball skipper earlier last year. However, legendary Indian batter Sunil Gavaskar, has reiterated that Rishabh Pant could have been the new prospect for the role of Test skipper. Suresh Raina seconds Sunil Gavaskar’s suggestion Interacting with India Today post Kohli’s sudden announcement, Sunil Gavaskar was once again of the view that had he been handed the authority, his choice for Team India’s next Test captain would certainly be India’s wicketkeeper-batter Rishabh Pant. Sunny Gavaskar tells me on @IndiaToday : “if it were up to me, I would make Rishabh Pant the next test captain” — Nikhil Naz (@NikhilNaz) January 15, 2022 Former India middle-order batter Suresh Raina has also agreed with Gavaskar’s suggestion, while terming it as a good idea for the team moving forward. Very good idea @NikhilNaz bhai ! He will be good captain agree with sunny bhai — Suresh Raina (@ImRaina) January 15, 2022 Raina has, in the past as well, consistently heaped praises for India’s current Southpaw wicketkeeper in Tests. Well played @RishabhPant17 best ever you beauty pic.twitter.com/MJZomGY2Zq — Suresh Raina (@ImRaina) January 13, 2022 Gavaskar had, earlier as well, advocated for Pant as India’s future captain, after he was impressed by his captaincy stint with the Delhi Capitals in the IPL previous year. “He showed in the few games in the IPL that he is clever enough to learn and his usual street-smart savvy meant he was on top of most situations and was finding his own method to get out of sticky ones. He is one for the future, no doubt about it,” Gavaskar had remarked in May last year.       The post “Would make Rishabh Pant the next Test captain”: Suresh Raina seconds Sunil Gavaskar’s suggestion to elect Rishabh Pant as India’s Test captain appeared first on The SportsRush.","pubDate":"2022-01-15 17:39:31","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"BAN vs ENG ICC U19 World Cup Dream11 prediction: Fantasy cricket tips Bangladesh U19 vs England U19","link":"https://www.indiatvnews.com/sports/cricket/ban-vs-eng-icc-u19-world-cup-dream11-prediction-fantasy-cricket-tips-bangladesh-u19-vs-england-u19-playing-xi-2022-01-15-754611","keywords":null,"creator":null,"video_url":null,"description":"BAN vs ENG ICC U19 World Cup Dream11 prediction: Fantasy cricket tips Bangladesh U19 vs England U19 Match Details","content":null,"pubDate":"2022-01-15 17:16:54","full_description":"Bangladesh U19 vs England U19 7th Match, Group A Warner Park, Basseterre, St Kitts Alex Horton, Prantik Nawrose Nabil, James Sales, George Thomas, George Bell, Ariful Islam, Rehan Ahmed, Jacob Bethell, Rakibul Hasan, Nathan Barnwell, M Hasan. Ariful Islam, Iftakher Hossain Ifti, Prantik Nawrose Nabil, Aich Mollah, Md Fahim, SM Meherob, Rakibul Hasan (C), M Hasan, Abdullah Al Mamum, Ripon Mondol, Naimur Rohman. George Thomas, Jacob Bethell, Tom Prest (C), William Luxton, George Bell, James Coles, Alex Horton, James Sales, Nathan Barnwell, Rehan Ahmed, Joshua Boyden Rakibul Hasan (c), Abdullah Al Mamun, Ariful Islam, Md Fahim, Mahfijul Islam, Ripon Mondol, Naimur Rohman, Tanzim Hasan Sakib, Prantik Nawrose Nabil, Aich Mollah, Ashiqur Zaman, Iftakher Hossain Ifti, SM Meherob, Musfik Hasan, Tahjibul Islam Tom Prest (c), Sonny Baker, George Bell, Joshua Boyden, Alex Horton, Rehan Ahmed, James Sales, George Thomas, Thomas Aspinwall, Nathan Barnwell, Jacob Bethell, James Coles, William Luxton, James Rew, Fateh Singh Star Sports will telecast the ICC U-19 World Cup. You can watch Live Streaming on Disney+ Hotstar In the Caribbean the U-19 World Cup 2022 matches will be available on ESPN Network. The live streaming will be available on the ESPN+ app. In Bangladesh, Gazi TV, T Sports, and BTV will present the live streaming of U-19 World Cup 2022 Star Sports and Siyatha TV will provide the live telecast of the U-19 World Cup 2022 In Australia, Kayo TV and Foxtel Network will telecast the live streaming of U-19 World Cup 2022 In New Zealand, Sky Sports Network will live stream the U-19 World Cup 2022. In the United States, Willow TV will present the live telecast of U19 World Cup 2022. In the United Kingdom, Sky Sports Cricket will telecast the live streaming of U-19 World Cup 2022 matches In South Africa, SuperSport will Live telecast the U-19 World Cup 2022 matches","image_url":null,"source_id":"indiatvnews"},{"title":"Alone and cornered, Kohli had no option but to quit Test captaincy; Rohit Sharma set to be Test skipper","link":"https://www.indiatvnews.com/sports/cricket/alone-and-cornered-virat-kohli-had-no-option-but-to-quit-test-captaincy-rohit-sharma-set-to-be-test-skipper-2022-01-15-754607","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli wasn't pushed but he decided to jump. It was a Twitter message on September 16 when he informed the world about his decision to quit T20 captaincy, keen to focus all his energies on Test cricket and ODI format keeping the 2023 World Cup in mind.","content":null,"pubDate":"2022-01-15 16:52:37","full_description":"wasn't pushed but he decided to jump. It was a Twitter message on September 16 when he informed the world about his decision to quit T20 captaincy, keen to focus all his energies on Test cricket and ODI format keeping the 2023 World Cup in mind. Exactly, one day short of four months, the 33-year-old has now joined the list of former India captains, having announced his decision of stepping down for the second time, this time from the traditional format. In between, he was sacked from the 50-over format, much to his dismay and from there started his \"Journey to the Centre of Earth\" from the \"Top of the World\", where he spent at least six and a half years of his seven-year captaincy tenure. Rohit Sharma was the designated Test vice-captain for the tour of South Africa and there won't be any change to that hierarchy that BCCI has set in place. By natural progression, if all goes well and he is fit, Rohit Sharma will be leading India in Test match cricket with being his deputy. The home series against Sri Lanka will be the first assignment for Rohit. However, with two World Cups in two years and so much of cricket, Rahul could be seen leading the team from time to time as and when Rohit takes a break as a part of workload management. His relations with the BCCI having reached its lowest ebb, it can be safely concluded that Kohli has \"retired hurt\", the decision only accentuated by a shock defeat against the weakest South African Test side in recent times. If BCCI sources are to be believed, there has been no prior discussions with any of the top brass as he had burnt his bridges in the pre-departure press conference that became his undoing. It was his and his decision alone. The establishment for once had no inclination to stop him from stepping down. However before putting out a formal statement, he had informed the BCCI biggies that he is tired. Rahul Dravid is creating a succession plan and the roadmap ahead. This team has moved beyond Virat Kohli - The Leader. It will now only be about Virat Kohli-The Batter. So it wasn't surprising at all when BCCI secretary Jay Shah congratulated Kohli on his decision, which was in one way, an immediate acceptance of his resignation. \"Congratulations to imVkohli on a tremendous tenure as TeamIndia captain. Virat turned the team into a ruthless fit unit that performed admirably both in India and away. The Test wins in Australia & England have been special,\" Shah tweeted. The series defeat and lack of runs have also pushed him to a corner and with all his support system in and outside the team gone, one of the world's finest batters had lost the zeal. But how did it happen? Here's the back story. When Kohli had decided to quit T20 captaincy, just prior to that, he had a meeting with BCCI president Sourav Ganguly, secretary Jay Shah, five selectors. Even Rohit Sharma was present in that meeting. Kohli referred to this \"very meeting\" where he had expressed his desire to quit T20 captaincy and which he said was accepted well by everyone. And this is the same meeting which Ganguly had referred to when he said that he had requested Kohli to stay back as captain. In between what no one spoke about was how Kohli had come with a proposal of having KL Rahul as his deputy in ODIs while Rohit remained captain in only T20 format. That proposal was immediately shot down as it would have meant Rohit would have missed the ODI captaincy despite being a deserving candidate for the job. In this back-drop, Kohli had miscalculated one aspect. He never expected that the BCCI would sack him from ODI captaincy on the pretext of \"too much leadership\". Someone who has played all his cricket under , a man who has lived and left on his own terms, Kohli found the sacking difficult to digest. Not known to pull his punches, he made a calculated insinuation at BCCI president Ganguly, accusing the former stalwart of lying (without naming) that the fomer skipper had asked to him stay back as T20 captain till the World Cup. That was his first brush with the establishment. Having ended with a bloody nose, BCCI waited and then unleashed its chairman of selectors Chetan Sharma to defend the establishment. The former pacer on his part completely contradicted Kohli, making it a case of \"your word versus mine\". Kohli wasn't a fool not to read the writing on the wall when he would have learnt that BCCI has thrown a counter-punch on a 31st night when the team was celebrating. He knew that he needed to win the Test series in order to hold his ground. Ask any of his teammates, Virat Kohli the batter has the highest respect for his heady achievements and the manic consistency but there was a point between 2017-19 when Committee of Administrators was in power and the Indian skipper with coach Ravi Shastri by his side had the carte blanche as far as his team building was concerned. Yes, there were whsipers of \"lack of communication,\" players at times \"didn't feel secure enough\" and those who were struggling for form weren't given \"an arm of assurance\". Somehow, the batter Kohli earned a lot of respect but leader Kohli stood in a 'Lonely Planet' and unlike an Imran Khan, who had complete devotion from his team, Kohli perhaps found himself in a tight corner. When on the second day's end was asked how much has been captain Virat Kohli's hand in his development, the pacer had replied: \"A bowler's development also depends on his own hard work\". A simple line but said a lot. Virat Kohli won't be seen in a press meet for the Indian team in near future. That's a certainty. He looked jaded, tired and spent on Friday when he came for the media interaction. The answer to a very valid and pointed question on losing focus due to unnecessary stump-mic chatter was a more a gibberish one where he only knew what he was trying to explain. In his farewell note, there wasn't any thank you note for Rahul Dravid, which he had reserved for Ravi Shastri. Perhaps, he hadn't struck that chord yet. All captains have a shelf life and better placed are those who judge earlier that it's time to leave. Kohli judged it but only after damage was done.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket-Unexpected test debut like a &#039;free hit&#039;, says England&#039;s Billings","link":"https://www.thestar.com.my/sport/cricket/2022/01/16/cricket-unexpected-test-debut-like-a-039free-hit039-says-england039s-billings","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England wicketkeeper-batsman Sam Billings said on Saturday that his test debut at Hobart against Australia was like a \"free hit\" after being drafted in as a late replacement for the injured Jos Buttler and Jonny Bairstow ahead of the fifth match. Read full story","content":null,"pubDate":"2022-01-15 16:43:00","full_description":"(Reuters) - England wicketkeeper-batsman Sam Billings said on Saturday that his test debut at Hobart against Australia was like a \"free hit\" after being drafted in as a late replacement for the injured Jos Buttler and Jonny Bairstow ahead of the fifth match. Billings, who looked fluent during his brief knock of 29 on Saturday, had been set to leave Australia after a spell with the Sydney Thunder in the Big Bash League Twenty20 competition before being included in the England squad as emergency cover. \"I felt able to enjoy it a lot more than some previous times I've played for England when I've felt under so much pressure to perform or to take an opportunity,\" the 30-year-old said after the second day's play. \"In the past... (I've wondered) if I'll be picked for the next game or squad. This was a free hit and a great opportunity to make a statement.\" Billings has been part of England's white-ball setup since 2015 but has had little opportunity to play in the longest format. He was twice named in the test squad last summer but failed to make his debut. \"My one-day debut at the age of 24-25 was all a blur and I didn't really soak that up. Often as cricketers we don't appreciate things until it's far gone, so I have loved every minute out there,\" Billings added. \"It's a great challenge against the best seam attack in the world, but it's far better than sitting on the sofa at home watching it.\" Australia, who lead the five-match Ashes series 3-0, finished the day on 37-3 in their second innings after bowling England out for 188, giving them a lead of 152 runs. (Reporting by Dhruv Munjal in Bengaluru; Editing by Hugh Lawson)","image_url":null,"source_id":"thestar_my"},{"title":"\"Sad Day For Me\": Ravi Shastri Reacts To Kohli Quitting Test Captaincy","link":"https://sports.ndtv.com/cricket/virat-kohli-steps-down-as-indias-test-captain-ravi-shastri-says-sad-day-for-me-personally-2710331","keywords":null,"creator":null,"video_url":null,"description":"Kohli and Shastri's association in Test cricket dates back to the time when Kohli was appointed full time captain in the longest format in 2015. At that time Shastri was in his stint as Team Director.","content":null,"pubDate":"2022-01-15 16:20:48","full_description":"Former Team India head coach Ravi Shastri reacted to Virat Kohli's decision to step down as captain of the Indian Test team on Saturday. Shastri took to Twitter to post a photo of him with Kohli from the time when the duo were at the helm of affairs of the Indian men's cricket team. In his post Shastri wrote that it is a \"sad day\" for him. Shastri's stint as head coach came to an end after the culmination of India's campaign in the ICC T20 World Cup in November last year. Kohli steps down as the most successful Indian Test captain ever with 40 victories under his belt, the last of which came in the first Test against South Africa in Centurion. \"Virat, you can go with your head held high. Few have achieved what you have as captain. Definitely India's most aggressive and successful. Sad day for me personally as this is the team we built together - @imVkohli ,: Shastri wrote in his tweet. Virat, you can go with your head held high. Few have achieved what you have as captain. Definitely India's most aggressive and successful. Sad day for me personally as this is the team 🇮🇳 we built together - @imVkohli pic.twitter.com/lQC3LvekOf Kohli and Shastri's association in Test cricket dates back to the time when Kohli was appointed full time captain in the longest format in 2015. At that time Shastri was in his stint as Team Director. India won an away series in Sri Lanka and then drubbed then world number 1 Test team South Africa 3-0 at home. Shastri's tenure as Team Director ended thereafter but Kohli continued his dream run as captain in Test cricket with comprehensive home series wins against New Zealand, England, Bangladesh and Australia. Shatri was brought back as head coach of the team in July 2017. He and Kohli then teamed up to continue the winning run at home and also won two historic Test series in Australia. The duo though faced setbacks against South Africa and England away from home in 2018 and against New Zealand in 2020. Shastri and Kohli's desire to win an ICC trophy together suffered a major jolt as India lost in the semi-final of the 2019 ICC World Cup and the ICC World Test Championship final last year. Promoted Their association ended with India's dismal campaign in the ICC T20 World Cup. Kohli and Shastri though were in charge of the team that leads 2-1 in an away Test series against England, the last match of which will be played later this year.","image_url":"https://c.ndtvimg.com/2022-01/pe2ge6mg_ravi-shastri-virat-kohli_120x90_15_January_22.jpg","source_id":"ndtv"},{"title":"Most successful captain in Cricket: Who is the most successful captain in Cricket?","link":"https://thesportsrush.com/cricket-news-most-successful-captain-in-cricket-who-is-the-most-successful-captain-in-cricket/","keywords":["Cricket","Most successful captain"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Most successful captain in Cricket: Virat Kohli currently finishes at 8th spot on the list of most successful captains in Cricket history. A captaincy career which commenced in the year 2015 with twin centuries in Australia, has finally come to an end as team India’s (now) former skipper Virat Kohli, 33, decides to absolve himself… The post Most successful captain in Cricket: Who is the most successful captain in Cricket? appeared first on The SportsRush.","content":"Most successful captain in Cricket: Virat Kohli currently finishes at 8th spot on the list of most successful captains in Cricket history. A captaincy career which commenced in the year 2015 with twin centuries in Australia, has finally come to an end as team India’s (now) former skipper Virat Kohli, 33, decides to absolve himself of India’s Test captaincy duty, and thereby completely as skipper in all formats of the game on Saturday. Kohli’s shocking decision came post a day after India lost its third Test match against South Africa in Cape Town, and with it a wonderful opportunity to win a maiden Test series on South African soil. KL Rahul has thus been named as India’s new Test skipper, just a month after Rohit Sharma was handed the ODI and T20I captaincy responsibility. Kohli led team India in a total of 213 matches across all formats. He prevailed in 135 of those, lost 60, tied 3, while drew 11 with a remarkable win percentage of 63.38. Ravi Shastri and MS Dhoni – two individuals get mentioned by name. https://t.co/Oov6ZdvFLG — Murali Krishnan (@legaljournalist) January 15, 2022 Most successful captain in Cricket (all formats) Kohli currently stands at the 8th spot in the list of most successful Cricket captain across all formats of the game. At the top is Kohli’s captain (in his own words), the legendary Mahendra Singh Dhoni who leads the list with 178 wins across 332 matches as captain of the Indian Cricket team. Placed below him are Australia’s Ricky Ponting (324 matches, 220 wins) and New Zealand’s Stephen Fleming (303 matches, 128 wins). Player Span Mat Won Lost Tied Draw MS Dhoni (INDIA) 2007-2018 332 178 120 6 15 RT Ponting (AUS/ICC) 2002-2012 324 220 77 2 13 SP Fleming (NZ) 1997-2007 303 128 135 2 25 GC Smith (Afr/ICC/SA) 2003-2014 286 163 89 1 27 AR Border (AUS) 1984-1994 271 139 89 2 38 A Ranatunga (SL) 1988-1999 249 101 114 1 25 M Azharuddin (INDIA) 1990-1999 221 104 90 2 19 V Kohli (INDIA) 2013-2022 213 135 60 3 11 SC Ganguly (Asia/INDIA) 1999-2005 196 97 79 0 15 EJG Morgan (ENG) 2011-2021 194 115 66 4 0   Most successful captain in Cricket (Test matches) As far as solely the Test format is concerned, South Africa’s Graeme Smith leads the chart with 53 Test wins in a total of 109 matches as captain. Placed below him are Australia’s Allan Border (93 matches, 32 wins) and New Zealand’s Stephen Fleming (80 matches, 28 wins). Virat Kohli, with 40 wins in 68 Tests, is India’s most successful Test captain and 6th overall in the world. Player Span Mat Won Lost Tied Draw GC Smith (ICC/SA) 2003-2014 109 53 29 0 27 AR Border (AUS) 1984-1994 93 32 22 1 38 SP Fleming (NZ) 1997-2006 80 28 27 0 25 RT Ponting (AUS) 2004-2010 77 48 16 0 13 CH Lloyd (WI) 1974-1985 74 36 12 0 26 V Kohli (INDIA) 2014-2022 68 40 17 0 11 JE Root (ENG) 2017-2022 61* 27 24 0 9 MS Dhoni (INDIA) 2008-2014 60 27 18 0 15 AN Cook (ENG) 2010-2016 59 24 22 0 13 SR Waugh (AUS) 1999-2004 57 41 9 0 7 The post Most successful captain in Cricket: Who is the most successful captain in Cricket? appeared first on The SportsRush.","pubDate":"2022-01-15 16:17:31","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket Fraternity Reacts To Kohli Stepping Down As India Test Captain","link":"https://sports.ndtv.com/cricket/cricket-fraternity-reacts-to-virat-kohli-stepping-down-as-india-test-captain-2710295","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli stepped down as India Test captain on Saturday and many took to Twitter to praise the 33-year-old's achievements as a leader, among them were some of the most famous names in world...","content":null,"pubDate":"2022-01-15 16:03:20","full_description":"Virat Kohli dropped a bombshell on Saturday, announcing on social media that he is stepping down as captain of the Indian Test cricket team. His statememt sent shockwaves across the world. Many took to Twitter to hail the 33-year-old, among them were some of the most famous names in world cricket. With 40 wins in 68 Tests, Kohli ends his tenure as India's most succesful Test captain. West Indian legend Sir Vivian Richards lavished praised on batting star, saying his \"name will be up there among the best leaders in world cricket\". \"Congratulations @imVkohli on a stunning run as the Indian captain. You can be very proud of what you have achieved so far, and for sure, your name will be up there among the best leaders in world cricket,\" tweeted the West Indian great. Congratulations @imVkohli on a stunning run as the Indian captain. You can be very proud of what you have achieved so far, and for sure, your name will be up there among the best leaders in world cricket https://t.co/DieCKL4bhE Former India coach Ravi Shastri too was effusive in his praise for Virat Kohli had achieved as captain. \"Virat, you can go with your head held high. Few have achieved what you have as captain. Definitely India's most aggressive and successful. Sad day for me personally as this is the team Flag of India we built together - @imVkohli,\" he wrote on Twitter. Virat, you can go with your head held high. Few have achieved what you have as captain. Definitely India's most aggressive and successful. Sad day for me personally as this is the team we built together - @imVkohli pic.twitter.com/lQC3LvekOf The likes of Yuvraj Singh, Virender Sehwag, former India captain Mohammed Azharuddin and many others also took to Twitter to hail Kohli's captaincy tenure. Many Congratulations #ViratKohli on an outstanding career as India's Test Captain. Stats don't lie & he was not only the most successful Indian Test Captain but one of the most successful in the world. Can be very proud @imVkohli & looking forward to watch u dominate with the bat It's been a remarkable journey King Kohli @imVkohli ! Very few have been able to achieve what you have. Gave your all and played like a true champion each time. May you grow from strength to strength! Onwards and upwards It's always an honour to lead the dynamic Indian team. And the decision to step down is an emotional heavy moment. A journey well travelled #ViratKohli #captain @imVkohli When Virat took over as Test captain, India winning a test overseas was an achievement, now if India lose an overseas test series it is an upset. And that's how far he has taken Indian cricket forward, and that will be his legacy. Congratulations on successful reign @imVkohli pic.twitter.com/My2MOXNwMc Although I also am shocked by @imVkohli sudden decision, I respect his call. I can only applaud him for what he has done for world cricket & India. Easily one of the most aggressive and fittest players India has had. Hope he'd continue to shine for India as a player. pic.twitter.com/W9hJGAYqhv Virat Kohli can be very proud of what he achieved as a test match captain. The numbers will tell a story but they won't tell you of his fierce desire to play and win at test cricket. Whenever the talk of Indian cricket captains will arise in test cricket @imVkohli 's name will be up there,not only for results but the kind of impact he had as a captain. Thank you #ViratKohli Captain of 1.4 billion Indians. Thank you, @imVkohli ???????? #TeamIndia pic.twitter.com/jZMfMILucO \"It's been 7 years of hard work, toil, and relentless perseverance every day to take the team in the right direction. I've done the job with absolute honesty and left nothing out there. Everything has to come to a halt at some stage and for me as Test Captain of India, it's now. There have been many ups and also some downs along the journey, but never has there been a lack of effort or lack of belief. I have always believed in giving my 120 percent in everything I do, and if I can't do that, I know it's not the right thing to do. I have absolute clarity in my heart and I cannot be dishonest to my team,\" Kohli said in a statement. Virat Kohli took over as Test captain from MS Dhoni and made India an absolute force both at home and overseas. In the 68 Test matches he captained, he lost just 17 times with 11 draws.","image_url":"https://c.ndtvimg.com/2021-11/k3ni67eg_virat-kohli-test-afp_625x300_12_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Virat Kohli steps down as India's cricket Test captain","link":"https://www.cnn.com/2022/01/15/sport/virat-kohli-cricket-india-test-captain-spt-intl/index.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricketer Virat Kohli has announced he will step down as the country's Test captain, following a series defeat against South Africa.","content":null,"pubDate":"2022-01-15 15:46:02","full_description":"Virat Kohli looks on as the India team warms up ahead of the fourth day of the second Test cricket match between South Africa and India in Johannesburg on January 6, 2022. (CNN) Indian cricketer Virat Kohli has announced he will step down as the country's Test captain , following a series defeat against South Africa. In a statement posted to social media on Saturday, the batsman said his seven-year tenure had been comprised of \"hard work, toil and relentless perseverance to take the team in the right direction.\" Australia wins first T20 World Cup title with emphatic victory over New Zealand \"I've done the job with absolute honesty and left nothing out there,\" Kohli said. \"Every thing has to come to a halt at some stage and for me as Test Captain of India, it's now.\" The 33-year-old -- who first deputized for then-Test captain Mahendra Singh Dhoni in 2014 and later began his official tenure as Test captain in June 2015 in Bangladesh -- has led India in a total of 68 test match series, with 40 wins and 17 losses. On Friday, the Indian cricket team suffered a 2-1 defeat against South Africa in Cape Town, with Kohli acknowledging on social media that it was \"a tough one to take.\" Virat Kohli plays a shot during the second day of the third Test cricket match between South Africa and India in Cape Town on January 12, 2022. Read More \"I have always believed in giving my 120 percent in everything I do, and if I can't do that, I know it's not the right thing to do,\" Kohli said. \"I have absolute clarity in my heart and I cannot be dishonest to my team.\" Kohli, who is regarded as one of the greatest cricketers of all time, previously served as India's captain in both Twenty20 (T20) and One-Day International (ODI) matches. Virat Kohli put the birth of his first child before cricket. That sends a strong message to Indian men about fatherhood In November 2021, he stepped down as T20 captain , saying he had an \"immense workload\" and needed to be \"fully ready to lead the Indian Team in Test and ODI Cricket.\" The following month, he was then removed as India's ODI captain by the team's selection committee and replaced by Rohit Sharma, who also took on India's T20 captaincy. During his time as captain, Kohli was praised for taking paternity leave halfway through a Test series to be present for the birth of his first child with his actress wife Anushka Sharma, and for defending bowler Mohammed Shami from Islamophobic trolls. Kohli will continue to play for India as a batsman, with a series of ODI matches against South Africa scheduled for next week.","image_url":"https://cdn.cnn.com/cnnnext/dam/assets/220115095104-01-virat-kohli-cricket-super-169.jpg","source_id":"cnn"},{"title":"India’s Virat Kohli quits as Test cricket captain – ‘I cannot be dishonest to my team’","link":"https://www.scmp.com/sport/cricket/article/3163547/indias-virat-kohli-quits-test-cricket-captain-i-cannot-be-dishonest?utm_source=rss_feed","keywords":null,"creator":["Agence France-Presse"],"video_url":null,"description":"Virat Kohli quit as India’s Test cricket captain on Saturday, bringing to an end a controversy-laden seven-year stint in one of the highest-profile, highest-pressure positions in sport.“Everything has to come to a halt at some stage and for me as Test captain of India, it’s now,” he posted on Twitter, a day after his side lost a three-match series to South Africa.The 33-year-old Kohli, who stepped down as Twenty20 skipper after a debacle at the World Cup and then lost the one-day job, took over…","content":null,"pubDate":"2022-01-15 15:40:52","image_url":"https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/01/15/ef92b355-b466-4365-a987-4117cbe66b9d_9b01ecb1.jpg?itok=IIh3moqV","source_id":"scmp"},{"title":"Ollie Pope’s repeated mistakes show England cricket’s state of confusion","link":"https://ca.sports.yahoo.com/news/ollie-pope-repeated-mistakes-shows-152455382.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-15 15:24:55","image_url":null,"source_id":"yahoo"},{"title":"Stunned cricketing fraternity lauds India's most successful Test captain","link":"https://www.business-standard.com/article/sports/stunned-cricketing-fraternity-lauds-india-s-most-successful-test-captain-122011500914_1.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli's unexpected decision to quit Test captaincy stunned the cricketing world, which lauded the Indian star batter for taking his team to new heights. Kohli ended his seven-year reign as India's most successful Test captain with memorable series wins in England and Australia being the highlight. \"Although I also am shocked by @imVkohli sudden decision, I respect his call. I can only applaud him for what he has done for world cricket & India. Easily one of the most aggressive and fittest players India has had. Hope he'd continue to shine for India as a player,\" tweeted former teammate Suresh Raina. Kohli took India to the top of world rankings and made them a formidable force in all conditions. \"When Virat took over as Test captain, India winning a test overseas was an achievement, now if India lose an overseas test series it is an upset. And that's how far he has taken Indian cricket forward, and that will be his legacy. Congratulations on successful reign,\" wrote former ..","content":null,"pubDate":"2022-01-15 15:24:00","full_description":"Virat Kohli's unexpected decision to quit Test captaincy stunned the cricketing world, which lauded the Indian star batter for taking his team to new heights. Kohli ended his seven-year reign as India's most successful Test captain with memorable series wins in England and Australia being the highlight. \"Although I also am shocked by @imVkohli sudden decision, I respect his call. I can only applaud him for what he has done for world cricket & India. Easily one of the most aggressive and fittest players India has had. Hope he'd continue to shine for India as a player,\" tweeted former teammate Suresh Raina. Kohli took India to the top of world rankings and made them a formidable force in all conditions. \"When Virat took over as Test captain, India winning a test overseas was an achievement, now if India lose an overseas test series it is an upset. And that's how far he has taken Indian cricket forward, and that will be his legacy. Congratulations on successful reign,\" wrote former India opener Wasim Jaffer. The great Virender Sehwag wrote: Many Congratulations #ViratKohli on an outstanding career as India's Test Captain. Stats don't lie & he was not only the most successful Indian Test Captain but one of the most successful in the world. Can be very proud @imVkohli & looking forward to watch u dominate with the bat.\" \"It's always an honour to lead the dynamic Indian team. And the decision to step down is an emotional heavy moment. A journey well travelled,\" added former India skipper Mohamad Azharuddin. Former India pacer Irfan Pathan wrote: \"Whenever the talk of Indian cricket captains will arise in test cricket @imVkohli's name will be up there,not only for results but the kind of impact he had as a captain. Thank you #ViratKohli. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220115/thumb-122011500914.jpg","source_id":"business-standard"},{"title":"Indian women's cricket team to quarantine in Mumbai ahead of WC departure","link":"https://www.indiatvnews.com/sports/cricket/indian-women-s-cricket-team-to-quarantine-in-mumbai-ahead-of-wc-departure-2022-01-15-754591","keywords":null,"creator":null,"video_url":null,"description":"The World Cup-bound Indian women's cricket team will assemble in Mumbai on Sunday for a week of quarantine before its travel to New Zealand.","content":null,"pubDate":"2022-01-15 15:22:04","full_description":"The World Cup-bound Indian women's cricket team will assemble in Mumbai on Sunday for a week of quarantine before its travel to New Zealand. The players had gathered in Dehradun recently for team bonding and youngsters in the team were also assigned tasks to develop leadership skills. The 15-squad members and three reserves have now been asked to report to Mumbai where they will isolate for a week. The team is expected to depart for New Zealand on January 24 and the players will have to undergo another quarantine upon arrival. India play a five-match series and one off T20 against hosts New Zealand beginning February 11 before the ODI World Cup in March-April. The team management wanted a week long training camp before departure but it could not be arrange due to rising COVID-19 cases across the country. India reached the final of the 2017 edition giving a massive boost to women's cricket in the country. The -led squad is expected to go all the way this time. Seasoned names like Shikha Pandey, and Punam Raut were dropped from the World Cup squad, triggering a controversy.","image_url":null,"source_id":"indiatvnews"}]}