{"newsArray":[{"title":"Ndhlovu, Sibanda for Fairbreak Invitational","link":"https://www.bmetro.co.zw/ndhlovu-sibanda-for-fairbreak-invitational/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Fungai Muderere LADY Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from 14 to 30 September. It will be debut appearances for Ndhlovu and Sibanda where they will join Lady Chevrons […]","content":"Fungai Muderere LADY Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from 14 to 30 September. It will be debut appearances for Ndhlovu and Sibanda where they will join Lady Chevrons captain Mary Anne Musonda at the global cricket showcase that undertakes to deliver equal opportunities for female cricketers from all corners of the globe. Thus, FairBreak and USA Cricket are supporting gender equity and the advancement of women’s and girl’s cricket globally. Musonda has played in all the two previous editions of the Fairbreak Invitational. Ndhlovu’s abilities cannot be doubted as she emerged as the best player in both domestic tournaments played this year. She was voted Player of the Tournament in the Fifty50 Challenge and Women’s T20 Cup. Earlier this year, she captained Zimbabwe in the inaugural ICC Under-19 Women’s World Cup. She made her debut for Zimbabwe as a 16-year-old in 2022 in Namibia. In that debut series, she and Sharne Mayers hit an unbeaten 158 first wicket partnership. The inaugural FairBreak Invitational T20 took place in partnership with Cricket Hong Kong in Dubai in May 2022. Following on from the success of FairBreak Invitational, and with the continued support and backing of Cricket Hong Kong, the other contest was held in April this year at Kowloon Cricket Club in Hong Kong. With a follow-up tournament scheduled for September in the USA, FairBreak Global will now be reportedly conducting two tournaments per year. Six teams comprising some of the biggest names in women’s first-class cricket and outstanding players from associate member nations around the globe, will play each other in both two-week tournaments. All matches will be broadcast internationally.","pubDate":"2023-06-01 22:05:04","image_url":null,"source_id":"bmetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ICC Cricket World Cup Qualifiers enter home stretch","link":"https://www.bmetro.co.zw/icc-cricket-world-cup-qualifiers-enter-home-stretch/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo THE countdown to the start of the eagerly awaited Men’s Cricket World Cup Qualifiers is gaining momentum with only 16 days left. The global showpiece will be staged in Zimbabwe from 18 June to 9 July and matches will be played in four venues across Bulawayo and Harare. The crunch World Cup Qualifiers […]","content":"Brandon Moyo THE countdown to the start of the eagerly awaited Men’s Cricket World Cup Qualifiers is gaining momentum with only 16 days left. The global showpiece will be staged in Zimbabwe from 18 June to 9 July and matches will be played in four venues across Bulawayo and Harare. The crunch World Cup Qualifiers will be used to determine the two remaining spots to the World Cup later this year in India. A total of 10 teams will battle it out for the two remaining spots and Zimbabwe Cricket (ZC) promised yet another memorable tournament after playing host to the last edition of the qualifiers in 2018. Stadium preparations are under way at both the two cities and all is expected to be in order at the time the tournament commences. The 10 teams that will battle it out for the tournament will include the five bottom teams in the ICC Men’s Cricket World Cup Super League table, the top three teams from the ICC Men’s Cricket World Cup League 2 and the top two teams from the 2023 World Cup Qualifier Playoff. From the 10 teams that will be coming down to Zimbabwe, seven have named their trusted lieutenants who are expected to get the job done. The seven teams who have named their final squads are Nepal, Ireland, Netherlands, Oman, Scotland, United States of America (USA) and the West Indies. The three remaining teams are United Arab Emirates (UAE), Sri Lanka and Zimbabwe. Last week, the International Cricket Council (ICC) released the fixtures schedule with the headlining match being a Group A encounter between West Indies and the hosts, Zimbabwe. The other teams in Group A are Netherlands, USA and Nepal and the group’s matches will be played in Harare. Group B has Ireland, Scotland, Sri Lanka, Oman and UAE and the matches will be played in Bulawayo.","pubDate":"2023-06-01 22:03:22","image_url":null,"source_id":"bmetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ICC Chairman, Chief Executive conclude two-day Lahore visit","link":"https://www.nation.com.pk/02-Jun-2023/icc-chairman-chief-executive-conclude-two-day-lahore-visit","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The Chair of the International Cricket Council, Greg Barclay, and Geoff Allardice, the ICC Chief Executive, visited the Pakistan cricket headquarters in Lahore on Tuesday and Wednesday.","content":"LAHORE-The Chair of the International Cricket Council, Greg Barclay, and Geoff Allardice, the ICC Chief Executive, visited the Pakistan cricket headquarters in Lahore on Tuesday and Wednesday. This was Barclay’s first tour of Pakistan. During the pre-arranged two-day visit, Mr Barclay and Mr Allardice met with the Chair of the PCB Management Committee, Najam Sethi, and other PCB officials, and discussed wide-ranging matters of mutual interest around cricket, including promotion, growth and development. Outside the PCB headquarters, Mr Barclay and Mr Allardice visited the National Cricket Academy, Lahore Fort, Lahore Museum, Safe City Project and Minar-e-Pakistan. Sharing his views, Greg Barclay said: “It has been great to be here. My approach has been to visit all the Member countries and see how cricket and cricket administration operates in their respective jurisdiction as every country and Member is different in terms of size, scale, economy and where they might sit in the cricketing hierarchy. “The cricket facilities in Pakistan and the cricket programmes are great and now, that international cricket has returned to Pakistan and the PCB is able to successfully deliver bilateral arrangements at home, I think we’ll see Pakistan cricket reach another level for both men and women, and that will also have a positive impact in terms of commercial upside. “I enjoyed the briefing on the men’s and women’s cricket development plans and programmes at an administrative level and the progress that is being made. I think the future for Pakistan in terms of female participation and international successes is going to be huge in terms of potential. “From the ICC’s view, given that we have a strategy to grow the game globally, to see where the PCB fits in is also very pleasing. I am going to leave here well impressed with what I have seen,” he added. Najam Sethi, who is also an ICC Director, said: “I want to thank Greg and Geoff for undertaking this tour to Lahore, which provided both the ICC and the PCB with an opportunity to exchange views and ideas on the globally cricket ecosystem. “The PCB looks forward to continuing our discussions and working closely with the ICC to put together global strategies and plans that are not only in the best interest of all its members but also achieve the common objective of growing and developing the game by attracting new audiences,” Sethi added.","pubDate":"2023-06-01 20:32:16","image_url":"https://www.nation.com.pk/print_images/large/2023-06-02/icc-chairman-chief-executive-conclude-two-day-lahore-visit-1685651520-9169.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"‘He’s got to get selected first’: Warner fires back at Broad","link":"https://www.watoday.com.au/sport/cricket/he-s-got-to-get-selected-first-warner-fires-back-at-broad-20230601-p5dd2q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"David Warner has turned the heat back on his Ashes antagonist and insists no one in the Australian team hierarchy has spoken to him about his recent inconsistent performances.","content":"David Warner has taken aim at his Ashes nemesis Stuart Broad , suggesting he won’t be the force who ruined the opening batsman’s 2019 tour this time around. “He’s got to get selected first,” Warner told this masthead as the Australians continued their preparations for the World Test Championship final in London on Wednesday. Broad has not been shy in firing public potshots at the Australians, but the expectation is that the veteran quick and his new ball partner Jimmy Anderson, 41 next month, will struggle to play in all five Ashes Tests, to be played over six weeks. Broad is set to lead a depleted England attack in a Test against Ireland at Lord’s, beginning on Thursday, while Anderson (groin) and Ollie Robinson (ankle) are hopeful of being fit for opening Ashes Test. Australia’s tour of England kicks off with the WTC final against India at the Oval from Wednesday, before the first Test against England at Edgbaston from June 16. Warner, 36, readily gives credit to Broad for the way he was able to regularly move the ball off the seam at a full length, and concedes he was too defensive against the clever England seamer in 2019. But despite Broad’s domination, Warner is taking a relaxed approach to their next encounter. David Warner celebrates after reaching 200 against South Africa. Credit: Getty “I don’t really have any plans, to be honest, so if he gets selected, then I’ll adjust when I’m out there,” Warner said. “Hopefully, this time around I can come out and look to score and play in a positive way.” Warner, 36, managed just 95 runs in five Tests at 9.5 during the 2019 Ashes tour and has struggled at times over the past two years, scoring just one century - his epic 200 in the Boxing Day Test last summer - amid 18 scores of 15 or less in 32 innings.","pubDate":"2023-06-01 19:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Dhoni’s knee surgery in Mumbai goes smoothly","link":"https://thenorthlines.com/dhonis-knee-surgery-in-mumbai-goes-smoothly/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Former India captain Mahendra Singh Dhoni successfully underwent a left knee surgery in a Mumbai hospital on Thursday, raising hopes of playing in the 17th edition of Indian Premier League next year. Dhoni, who led Chennai Super Kings to their fifth IPL title, had flown to Mumbai from Ahmedabad after the final on […] The post Dhoni’s knee surgery in Mumbai goes smoothly appeared first on Northlines.","content":"Agencies Former India captain Mahendra Singh Dhoni successfully underwent a left knee surgery in a Mumbai hospital on Thursday, raising hopes of playing in the 17th edition of Indian Premier League next year. Dhoni, who led Chennai Super Kings to their fifth IPL title, had flown to Mumbai from Ahmedabad after the final on Monday and consulted renowned sports orthopaedic surgeon Dr Dinshaw Pardiwala, who is also on the BCCI medical panel and had performed surgeries on a number of top Indian cricketers, including Rishabh Pant. “Yes, Dhoni has had a successful knee surgery at the Kokilaben Hospital in Mumbai on Thursday. He is doing fine and the surgery happened in the morning. I don't have details. I am yet to get all the details about the nature of surgery and other things,” CSK CEO Kasi Viswanathan confirmed to PTI. It's learnt that Dhoni has already been discharged from the hospital after a keyhole surgery was performed for “arthroscopic repair”. “He has already been discharged from hospital and he has gone back to Ranchi. He would be resting for a few days at home before his extensive rehabilitation starts. It is now expected that he would have enough time to get fit to play in the next IPL,” another source close to CSK management told PTI on conditions of anonymity. Dhoni had played the entire season with heavy strapping on his left knee and while he looked absolutely fine during wicket-keeping, he came into bat as low as No. 8 at times and didn't look in his element while running between the wickets. On Wednesday, Viswanathan had said that whether Dhoni wants to undergo surgery will be completely the iconic captain's call. After the IPL final, Dhoni had said: “If you circumstantially see, it's the best time to announce retirement. The easy thing for me to say is thank you and retire. But the hard thing to do is to work hard for nine months and try to play one more IPL season. The body has to hold up. But the amount of love I have received from CSK fans, it would be a gift for them to play one more season. “The way they've shown their love and emotion, it's something I need to do for them. It's the last part of my career. It started over here and full house was chanting my name. It was same thing in Chennai, but it will be good to come back and play whatever I can. The kind of cricket I play, they feel they can play that cricket. There's nothing orthodox about it and I like to keep it simple.”","pubDate":"2023-06-01 18:41:54","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Hardik could have been the X-factor in the WTC Final’","link":"https://thenorthlines.com/hardik-could-have-been-the-x-factor-in-the-wtc-final/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"agencies Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. In 11 Tests Hardik Pandya has scored 532 runs at an average of […] The post ‘Hardik could have been the X-factor in the WTC Final’ appeared first on Northlines.","content":"agencies Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. In 11 Tests Hardik Pandya has scored 532 runs at an average of 31.29 and has taken 17 wickets ormer Australian cricket icon Ricky Ponting feels that India should have picked Hardik Pandya in their squad for the World Test Championship 2023 against Australia in London from June 7. In the latest episode of ICC Review, Ponting stated that Pandya's all-around capabilities could have helped India in the title decider. “…I thought about the other day for India in this game is how valuable someone like Hardik Pandya could be in a one-off Test match. I know he is on record saying that the Test match game is probably a little bit hard on his body. But for a one-off game… he's been bowling every game through this IPL and he's bowling quick,” Ponting said in the latest episode of ICC Review. “He (Pandya) could be that X-factor there just to pick in a one-off game, come in and see what he can do with bat and ball. He could be the difference between the two teams,” he added. Pandya has played in 11 Tests since making his debut in 2017. He has scored 532 runs at an average of 31.29. The 29-year-old has one hundred and four half centuries to his name. Pandya has taken 17 wickets in 11 Test matches at an average of 31.05. Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. India's Test batting mainstay Pujara could provide valuable insights to his teammates, having played extensively at Sussex in the English County Championship, while Kohli is at his absolute best having cracked two centuries and six half-tons for Royal Challengers Bangalore in the recently-concluded Indian Premier League. “The Australian team will be talking about Virat, no doubt about it, and they'll be talking about Pujara. They're the two,” Ponting said. Cheteshwar Pujara, who bats at No. 3, has 2,033 runs and five centuries in 24 Tests against Australia Pujara is known to relish the challenges thrown at him by Australian bowlers, having scored more Test runs and centuries against them than any other side, and his contribution would be crucial to India's chances of lifting the WTC trophy in their second attempt. “Pujara has been a thorn in their side a lot in the past, and in Australia, and this wicket will potentially be a lot more like an Australian pitch. They know that they'll have to get him early,” opined the former Australian captain. Pujara, who bats at No. 3, has 2,033 runs and five centuries in 24 Tests against Australia, and skipper Rohit Sharma will hope he makes a couple of more vital contributions for the side in the WTC final. Kohli, apart from his sparkling form in the IPL, had smashed 186 in the fourth Test against Australia in March during the Border-Gavaskar Trophy and would be itching to have a go at the Pat Cummins-led side. “They also know that Virat over the last few weeks is probably just about back to his absolute best, albeit in T20 cricket. He told me that the feeling he's getting right now is that he's almost back to his best, and that's an ominous warning for the Australians going into a one-off game,” said Ponting. Ponting is also mightily impressed with young Shubman Gill's performance in the IPL and the 23-year-old's exploits in the last two Tests of the Border-Gavaskar series. Gill hit three centuries for Gujarat Titans in IPL. “He looks like a terrific young guy. He's got that bit of attitude about him as well. He's got a bit of swagger. He has some serious class. That sort of front-foot pull shot that he plays against the fast bowlers will be a shot that he'll probably need against this Australian attack,” said Ponting. With the pace bowlers likely to do a lot of heavy lifting during the one-off Test, Ponting believes veteran Mohammed Shami will have to be at his absolute best against the strong Australian batting lineup, given that Jasprit Bumrah is not in the frame owing to injury. “I think he has to step up or try and take his game to another level if India are going to win this game. When you talk to the Australian batters as well, they understand how good Shami is whether it's new ball or old ball, whether it's in Australia or India. “They know the skillset he's got and how dangerous he can be. It's going to have to be him,” added Ponting.","pubDate":"2023-06-01 18:40:28","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"England openers shine as Ireland struggle on first day at Lord's","link":"https://www.the42.ie/england-ireland-cricket-6083191-Jun2023/","keywords":["Lords"],"creator":null,"video_url":null,"description":"Stuart Broad claimed five for 51 to dismiss Ireland for 172 before England closed on 152 for one.","content":"BEN DUCKETT AND Zak Crawley wasted little time getting back into the groove for England with a century stand against Ireland at Lord’s in what proved to be a near-perfect first day to an eagerly anticipated Test summer for the hosts. Both openers scored fifties and played true to the aggressive ‘Bazball’ style that has taken the nation by storm since Ben Stokes and Brendon McCullum took over the red-ball team last summer. England finished the opening day of this one-off Test on 151 for one and only 20 runs behind Ireland, who were dismissed for 172 at the start of the evening session thanks to Stuart Broad’s first five-wicket haul at Lord’s in 10 years. Broad ripped through Ireland’s top order during the first hour with a trio of scalps to reduce the tourists to 19 for three before Paul Stirling played fire with fire in an entertaining knock of 30. Ireland opener James McCollum backed him up with 36 and all-rounder Curtis Campher chipped in with 33, but Broad would not be denied his chance to go on the Lord’s honours board and finished with five for 51 off 17 overs after good support by Jack Leach and Matthew Potts. All eyes were then on Crawley, who kicked off an enormous two months for England with a punch through cover for four off his second ball. It was a sign of things to come with the fifty partnership brought up after 7.2 overs and Duckett happy to cut away to the boundary on his first Test innings on home soil. After a slight lull of 28 balls without a boundary, Crawley produced four fours from his next six balls but three were via the inside edge with the heavily scrutinised Kent batter not as fluent as his fellow opener. Duckett beat his partner to a half-century off 53 balls with two runs down to third man during a milestone 16th over that also saw Crawley reach fifty, from 39 deliveries, with a sumptuous cover drive. The hundred partnership was also brought up in that Mark Adair over but, in the next, the opening stand was ended when Ireland Test debutant Fionn Hand produced a stunning caught and bowled to see off Crawley for 56. Nottinghamshire’s Duckett remained undeterred and finished the day 60 not out after England’s new vice-captain Ollie Pope helped himself to a breezy 29 not out at a sun-soaked Lord’s. England’s start to the day had not been smooth sailing with their arrival from the team’s Kensington hotel delayed by five minutes due to Just Stop Oil protesters but once Stokes had put Ireland into bat, Broad quickly set about trying to get his name on the honours board. In the absence of rested duo James Anderson and Ollie Robinson, the Nottinghamshire seamer relished the chance to lead the attack and produced a fine opening spell of three for 14 from five overs. Broad had to wait until his 14th delivery to make the breakthrough but Peter Moor was pinned in front lbw for 10 and his next over produced even more drama. Ireland captain Andrew Balbirnie edged to second slip, where Crawley took an excellent low catch diving to his left and Harry Tector followed his skipper back to the pavilion two balls later. Tector inexplicably flicked straight to Potts at leg slip, which saw Broad produce his trademark shocked face in celebration but he was denied a hat-trick opportunity when an lbw decision against Stirling was overturned on review after ball-tracker showed it was missing leg stump. It enabled Stirling to lead a mini-recovery and he put on 45 with opener McCollum, but Leach ended the fun of the former Middlesex batter for 30 after another attempted sweep flicked off his glove and gave Jonny Bairstow a simple first catch behind the stumps since replacing Ben Foakes. After making it to lunch on 78 for four, Broad ended McCollum’s hard-fought 36 off 108 deliveries when he edged to Joe Root at first slip before Campher took the fight to England despite being hit on the helmet by England debutant Josh Tongue. It saw Ireland make it through a second session but Broad claimed his 20th Test five-wicket haul after tea when he hit the top of Adair’s off-stump. Leach had provided able support and finished with three for 35 after the dismissals of Lorcan Tucker and Campher before Potts brought the tourists’ first innings to an end when Hand edged behind to Bairstow in the 57th over.","pubDate":"2023-06-01 18:33:00","image_url":"https://c0.thejournal.ie/media/2023/06/englands-stuart-broad-celebrates-taking-the-wicket-of-irelands-peter-moor-not-pictured-during-day-one-of-the-first-lv-insurance-test-match-at-lords-london-picture-date-thursday-june-1-2023-630x420.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Stuart Broad and Ben Duckett dominate Ireland as England kick-start Ashes summer in style","link":"https://metro.co.uk/2023/06/01/cricket-england-kick-start-ashes-summer-dominating-ireland-lords-18883535/","keywords":["Cricket","Sport","Australia cricket","England cricket","Stuart Broad","The Ashes"],"creator":["Louis Sealey"],"video_url":null,"description":"An impressive start to a huge summer for England.","content":"Stuart Broad took his 20th Test five-wicket haul as England dominated Ireland (Picture: Getty) England kick-started the Ashes summer by bowling out Ireland cheaply at Lord’s and then showcasing the aggressive batting they hope will stun Australia. Stuart Broad marshalled an inexperienced bowling attack which included debutant Josh Tongue, claiming his 20th Test five-wicket haul in Ireland’s 172. The visitors threatened to emulate England’s 85 all out from this fixture four years ago when they slipped to 19-3, but contributions from James McCollum, Curtis Campher and Paul Stirling – all dismissed in the 30s – took Ireland to a below-par but respectable total. Rapid fifties from Ben Duckett and Zak Crawley in an opening stand of 109 saw England take complete control and show they have no plans of altering an approach under Ben Stokes and Brendon McCullum that is proving as successful as it is thrilling. In the absence of his long-time opening partner James Anderson – rested ahead of the Ashes – Broad quickly began a match-defining spell when England won the toss in overcast and chilly conditions. Ireland opener Peter Moor clipped Matthew Potts away for the first boundary of the Test but was unable to repeat the trick against Broad, who found just enough movement to claim wicket No. 577. Broad – playing his 162nd Test – struck again in his next over, Crawley alert in the slips to send Ireland captain Andrew Balbirnie back for a duck. Broad’s five wickets helped England bowled out Ireland for 172 (Picture: Getty) Ireland were three down and reeling two balls later as Harry Tector was caught at leg-slip, Broad celebrating his third wicket in eight deliveries. It almost got even worse for Ireland as Stirling survived a DRS review from his first ball to deny Broad the chance to take a third Test hat-trick. Stirling began to take advantage of his reprieve, cutting and sweeping his way to 30, though England still looked dangerous through Tongue, whose first two overs in Test cricket were both maidens. McCollum also frustrated England with a patient rearguard but he needed another partner when Jack Leech took his first wicket of the match, forcing an error from Stirling that left Ireland 78-4 at lunch. More: TrendingPub landlord wins £50,000 after placing bet on 11-year-old to play for EnglandBen Stokes responds to fears he won't be able to bowl during Ashes series for EnglandMichael Vaughan tips England to make Ashes statement against Ireland The wickets continued to tumble in the afternoon session – Ireland’s top-scorer McCollom nicking off for 36 and Lorcan Tucker trapped LBW – as England pressed home their advantage. Potts, making his sixth Test appearance, got in on the act when he found the edge of Andy McBrine – but Ireland at least passed 150 when Campher hit boundaries off Tongue and Broad. Despite the pitch flattening out, Ireland’s hopes of reaching 200 were soon over as they lost their final three wickets for three runs in the space of 16 balls. Broad once again made the breakthrough, getting the ball to nip back and beat Mark Adair for his 20th Test five-wicket haul – a milestone bettered by only 22 players in history. James McCollum top-scored for Ireland in just their seventh Test (Picture: Getty) Leech finished with three wickets after deceiving the charging Campher and Potts wrapped up an impressive bowling performance with his second scalp of the day. Needing early wickets, Ireland could do little to halt an onslaught from Crawley and Duckett, who found the boundary ropes at will in a thrilling opening stand. Crawley, in need of a score after a mixed start to the County Championship season, survived three inside edges but also produced several brilliant strokes on his way to a 39-ball half-century. Duckett was not far behind his opening partner, his first home Test fifty coming from 53 balls. Fionn Hand’s superb catch of his own bowling brought an end to Crawley’s innings but the runs kept coming from Duckett and Ollie Pope as England reached 152-1 at the close, trailing by just 20. England openers Zak Crawley and Ben Duckett put on 109 (Picture: Getty) BROAD MAKES STATEMENT AND TONGUE’S DELIGHT Stuart Broad has been doing his best to rattle the Aussies ahead of the Ashes but on this evidence he can probably let his bowling do the talking. Mitchell Starc did not take too kindly to Broad’s suggestion that the last Ashes series was ‘void’ due to coronavirus restrictions, while his revelation that he has been working on a new deliver – an outswinger – raised plenty of eyebrows Down Under. Broad’s pre-Ashes antics were temporarily put on hold at Lord’s, where he was at his leg-pumping best and may have made himself undroppable for the first Test against Australia. England are hopeful James Anderson, Ollie Robinson and Mark Wood will be fit for Edgbaston on June 16 but it would take a brave man to drop Broad after yet another five-wicket haul. With his mum, dad, partner and son all watching on…Jimmy Anderson presents Josh Tongue with his very first England cap â¤ï¸ðŸ§¢A special moment for the whole family ðŸ‘¨â€ðŸ‘©â€ðŸ‘¦Congratulations, Josh ðŸ‘ pic.twitter.com/FTew4m8y1o— England Cricket (@englandcricket) June 1, 2023 Before Broad ripped through Ireland, Josh Tongue completed a remarkable turnaround as he was presented with his Test cap in an England huddle attended by his family. The Worcestershire seamer considered retiring last year as he battled a persistent shoulder injury, but those fears are hopefully a thing of the past after he represented England for the first time and bowled 14 wicketless but tidy overs. And his inclusion at Lord’s was particularly good news for a pub landlord in Redditch, who wagered £100 at odds of 500/1 that Tongue would play for England at the age of 11. Tim Piper, who played cricket with Tongue’s father in the 1990s, said: ‘I’ve kept the bet slip in a cupboard all these years. I just thought to myself “it must be worth £100”. If he doesn’t make it, he’d make us proud anyway. This is just a bonus for him to get in the Test team.’ MORE : Ben Stokes responds to fears he won’t be able to bowl in the Ashes MORE : Hardik Pandya pays tribute to MS Dhoni after Chennai Super Kings win IPL For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2023-06-01 17:33:40","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Debuts for Hemantha and Pathirana on the cards as Sri Lanka build up to key World Cup qualifiers","link":"https://www.dailymirror.lk/breaking_news/Debuts-for-Hemantha-and-Pathirana-on-the-cards-as-Sri-Lanka-build-up-to-key-World-Cup-qualifiers/108-260281","keywords":null,"creator":null,"video_url":null,"description":"Leg spinner Dushan Hemantha and sling-armed fast bowler Matheesha Pathirana are in line for One Day International debuts when Sri Lanka take on Afghanistan in the first ODI in Hambantota tomorrow.","content":"Leg spinner Dushan Hemantha and sling-armed fast bowler Matheesha Pathirana are in line for One Day International debuts when Sri Lanka take on Afghanistan in the first ODI in Hambantota tomorrow. Sri Lanka will be without their main bowling weapon Wanindu Hasaranga, who has been ruled out of the first two ODIs in the three-match series, which opens the door for Hemantha to make his international cricket debut. “It's because of Wanindu's injury that Dushan has been called up to the squad and there is a good chance he will play tomorrow,” Sri Lanka captain Dasun Shanaka said. Hemantha impressed in the recent National Super League Limited Over, taking 13 wickets in 8 innings – the third leading wicket taker in the tournament – put him on the radar for the national team. He also averages 24.21 with the bat in List A cricket, potentially providing the all-round skills that Hasaranga brings to the team. With Hambantota not having hosted an international match since 2020, Shanaka believes that a new wicket could favour fast bowlers, with Sri Lanka contemplating a bowling attack with three front line fast bowlers. One of those spots could be handed to Pathirana, the right-arm fast bowler who proved a crucial part of the Chennai Super Kings team that won the Indian Premier League on Tuesday morning, though Shanaka was non-committal in naming a first XI. While Pathirana had seen his stock rise through his contributions at the tournament, Shanaka believes that he would not have been discovered by IPL teams had he not been given his early opportunities by Sri Lanka Cricket (SLC). “If you talk about Matheesha's achievements (at the IPL), he has represented Sri Lanka since the under 17 team, and it’s because of the performances with Sri Lankan cricket that he got the chance to play in the IPL. The IPL gives value to unorthodox skills and even though Matheesha hasn't been highlighted with the national, the opportunity for him to be highlighted in the IPL are higher. Matheesha has been with the national team for a while now, but unfortunately, he got Covid-19 during the tour of New Zealand and was unable to play the T20,” Shanaka said. Sri Lanka could also be buoyed by the return of Dushmantha Chameera, who was Sri Lanka’s best fast bowler before picking up an injury during the early stages of the T20 World Cup last year, returning to the national team after a long injury layoff. With Dimuth Karunaratne also returning after a long exile from ODI cricket, this series will provide Sri Lanka the last opportunity to identify its best XI, before the Cricket World Cup Qualifiers later this month. Meanwhile, Afghanistan, who have already directly qualified for the Cricket World Cup, will be without ace spinner Rashid Khan for the first two ODIs, having arrived to join the Afghanistan from the IPL with a back injury. While it is a significant absence, Shanaka believes that it would not be so pronounced given the other spin bowling option up Afghan captain Hashmatullah Shahidi has up his sleeve. “Even though Rashid Khan isn’t available, they have Noor Ahmed who has played in Sri Lanka and has experience playing in the IPL, and he has played international cricket. They also have Mujeeb ur-Rahman and Mohammad Nabi, so in terms of spinners they have some good, experienced options. We can't take them lightly,” Shanaka said. (Shehan Daniel)","pubDate":"2023-06-01 17:17:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_8757364e21.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australian Coach Daniel Vettori “impressed” with England team ahead of Ashes series","link":"https://thenewsmill.com/2023/06/australian-coach-daniel-vettori-impressed-with-england-team-ahead-of-ashes-series/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former New Zealand all-rounder and Australian Coach Daniel Vettori has praised the England cricket team for playing excellent cricket over a period of time which has impressed him a lot. One of the most competitive Series Ashes will start on June 16 which will be played between England and Australia in England. It comprises five test matches. Ahead of the match, the Australian coach said as quoted by skysports.com, “The fact that they’ve played so well over an extended period of time is what’s been so impressive.” “Irrespective of the style, they (England) are playing winning cricket, and I think that’s the thing that everyone gravitates towards,” he added Vettori also praised England’s head coach Brendon Mccullum and said that his addition to the England team has a “positive” impact. “Probably like Andrew [McDonald, Australia’s head coach], Brendon is the same in that he wouldn’t want to make the attention about himself. It’s just he’s got this moniker go for him now. But I think that’s Brendon since he came out of the womb – he’s pretty positive.” Ben Stokes’ knee problem developed during the series draw in New Zealand in February, and he hasn’t bowled since However, he had bowled just one over on April 3 for Chennai Super Kings in the Indian Premier League (IPL). Addressing Stokes’ injury issue, Vettori said, “I don’t think it will affect how we (Australia) prepare, but we will be preparing for him (Ben Stokes) to be at his normal (fitness), one of the top all-rounders in world cricket.” He said that all-rounders make things smooth and easy. “I think we know how much he brings to the table as an all-rounder. It’s like Cameron Green for us, offering that balance, the ability to come in and be an aggressive weapon along with his batting, which has been exceptional. “I think any team wants their all-rounder up and running because it makes everything else run so smoothly,” Vettori added. While Australia will play against India in the ICC World Test Championship final at the Oval in London. England is currently playing against Ireland in a one-off Test in preparation for the Ashes. “Ask me again on the back of these four days of prep! But there’s a real excitement that we have the ability to play one of the best teams in the world in such a crucial game and that should set us up well for the Ashes. It’s six Tests of high intensity and you couldn’t ask for anything more,” He concluded. (ANI)","pubDate":"2023-06-01 16:34:20","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Ndhlovu, Sibanda for Fairbreak Invitational","link":"https://www.bmetro.co.zw/ndhlovu-sibanda-for-fairbreak-invitational/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Fungai Muderere LADY Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from 14 to 30 September. It will be debut appearances for Ndhlovu and Sibanda where they will join Lady Chevrons […]","content":"Fungai Muderere LADY Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from 14 to 30 September. It will be debut appearances for Ndhlovu and Sibanda where they will join Lady Chevrons captain Mary Anne Musonda at the global cricket showcase that undertakes to deliver equal opportunities for female cricketers from all corners of the globe. Thus, FairBreak and USA Cricket are supporting gender equity and the advancement of women’s and girl’s cricket globally. Musonda has played in all the two previous editions of the Fairbreak Invitational. Ndhlovu’s abilities cannot be doubted as she emerged as the best player in both domestic tournaments played this year. She was voted Player of the Tournament in the Fifty50 Challenge and Women’s T20 Cup. Earlier this year, she captained Zimbabwe in the inaugural ICC Under-19 Women’s World Cup. She made her debut for Zimbabwe as a 16-year-old in 2022 in Namibia. In that debut series, she and Sharne Mayers hit an unbeaten 158 first wicket partnership. The inaugural FairBreak Invitational T20 took place in partnership with Cricket Hong Kong in Dubai in May 2022. Following on from the success of FairBreak Invitational, and with the continued support and backing of Cricket Hong Kong, the other contest was held in April this year at Kowloon Cricket Club in Hong Kong. With a follow-up tournament scheduled for September in the USA, FairBreak Global will now be reportedly conducting two tournaments per year. Six teams comprising some of the biggest names in women’s first-class cricket and outstanding players from associate member nations around the globe, will play each other in both two-week tournaments. All matches will be broadcast internationally.","pubDate":"2023-06-01 22:05:04","image_url":null,"source_id":"bmetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ICC Cricket World Cup Qualifiers enter home stretch","link":"https://www.bmetro.co.zw/icc-cricket-world-cup-qualifiers-enter-home-stretch/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo THE countdown to the start of the eagerly awaited Men’s Cricket World Cup Qualifiers is gaining momentum with only 16 days left. The global showpiece will be staged in Zimbabwe from 18 June to 9 July and matches will be played in four venues across Bulawayo and Harare. The crunch World Cup Qualifiers […]","content":"Brandon Moyo THE countdown to the start of the eagerly awaited Men’s Cricket World Cup Qualifiers is gaining momentum with only 16 days left. The global showpiece will be staged in Zimbabwe from 18 June to 9 July and matches will be played in four venues across Bulawayo and Harare. The crunch World Cup Qualifiers will be used to determine the two remaining spots to the World Cup later this year in India. A total of 10 teams will battle it out for the two remaining spots and Zimbabwe Cricket (ZC) promised yet another memorable tournament after playing host to the last edition of the qualifiers in 2018. Stadium preparations are under way at both the two cities and all is expected to be in order at the time the tournament commences. The 10 teams that will battle it out for the tournament will include the five bottom teams in the ICC Men’s Cricket World Cup Super League table, the top three teams from the ICC Men’s Cricket World Cup League 2 and the top two teams from the 2023 World Cup Qualifier Playoff. From the 10 teams that will be coming down to Zimbabwe, seven have named their trusted lieutenants who are expected to get the job done. The seven teams who have named their final squads are Nepal, Ireland, Netherlands, Oman, Scotland, United States of America (USA) and the West Indies. The three remaining teams are United Arab Emirates (UAE), Sri Lanka and Zimbabwe. Last week, the International Cricket Council (ICC) released the fixtures schedule with the headlining match being a Group A encounter between West Indies and the hosts, Zimbabwe. The other teams in Group A are Netherlands, USA and Nepal and the group’s matches will be played in Harare. Group B has Ireland, Scotland, Sri Lanka, Oman and UAE and the matches will be played in Bulawayo.","pubDate":"2023-06-01 22:03:22","image_url":null,"source_id":"bmetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ICC Chairman, Chief Executive conclude two-day Lahore visit","link":"https://www.nation.com.pk/02-Jun-2023/icc-chairman-chief-executive-conclude-two-day-lahore-visit","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The Chair of the International Cricket Council, Greg Barclay, and Geoff Allardice, the ICC Chief Executive, visited the Pakistan cricket headquarters in Lahore on Tuesday and Wednesday.","content":"LAHORE-The Chair of the International Cricket Council, Greg Barclay, and Geoff Allardice, the ICC Chief Executive, visited the Pakistan cricket headquarters in Lahore on Tuesday and Wednesday. This was Barclay’s first tour of Pakistan. During the pre-arranged two-day visit, Mr Barclay and Mr Allardice met with the Chair of the PCB Management Committee, Najam Sethi, and other PCB officials, and discussed wide-ranging matters of mutual interest around cricket, including promotion, growth and development. Outside the PCB headquarters, Mr Barclay and Mr Allardice visited the National Cricket Academy, Lahore Fort, Lahore Museum, Safe City Project and Minar-e-Pakistan. Sharing his views, Greg Barclay said: “It has been great to be here. My approach has been to visit all the Member countries and see how cricket and cricket administration operates in their respective jurisdiction as every country and Member is different in terms of size, scale, economy and where they might sit in the cricketing hierarchy. “The cricket facilities in Pakistan and the cricket programmes are great and now, that international cricket has returned to Pakistan and the PCB is able to successfully deliver bilateral arrangements at home, I think we’ll see Pakistan cricket reach another level for both men and women, and that will also have a positive impact in terms of commercial upside. “I enjoyed the briefing on the men’s and women’s cricket development plans and programmes at an administrative level and the progress that is being made. I think the future for Pakistan in terms of female participation and international successes is going to be huge in terms of potential. “From the ICC’s view, given that we have a strategy to grow the game globally, to see where the PCB fits in is also very pleasing. I am going to leave here well impressed with what I have seen,” he added. Najam Sethi, who is also an ICC Director, said: “I want to thank Greg and Geoff for undertaking this tour to Lahore, which provided both the ICC and the PCB with an opportunity to exchange views and ideas on the globally cricket ecosystem. “The PCB looks forward to continuing our discussions and working closely with the ICC to put together global strategies and plans that are not only in the best interest of all its members but also achieve the common objective of growing and developing the game by attracting new audiences,” Sethi added.","pubDate":"2023-06-01 20:32:16","image_url":"https://www.nation.com.pk/print_images/large/2023-06-02/icc-chairman-chief-executive-conclude-two-day-lahore-visit-1685651520-9169.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"‘He’s got to get selected first’: Warner fires back at Broad","link":"https://www.watoday.com.au/sport/cricket/he-s-got-to-get-selected-first-warner-fires-back-at-broad-20230601-p5dd2q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"David Warner has turned the heat back on his Ashes antagonist and insists no one in the Australian team hierarchy has spoken to him about his recent inconsistent performances.","content":"David Warner has taken aim at his Ashes nemesis Stuart Broad , suggesting he won’t be the force who ruined the opening batsman’s 2019 tour this time around. “He’s got to get selected first,” Warner told this masthead as the Australians continued their preparations for the World Test Championship final in London on Wednesday. Broad has not been shy in firing public potshots at the Australians, but the expectation is that the veteran quick and his new ball partner Jimmy Anderson, 41 next month, will struggle to play in all five Ashes Tests, to be played over six weeks. Broad is set to lead a depleted England attack in a Test against Ireland at Lord’s, beginning on Thursday, while Anderson (groin) and Ollie Robinson (ankle) are hopeful of being fit for opening Ashes Test. Australia’s tour of England kicks off with the WTC final against India at the Oval from Wednesday, before the first Test against England at Edgbaston from June 16. Warner, 36, readily gives credit to Broad for the way he was able to regularly move the ball off the seam at a full length, and concedes he was too defensive against the clever England seamer in 2019. But despite Broad’s domination, Warner is taking a relaxed approach to their next encounter. David Warner celebrates after reaching 200 against South Africa. Credit: Getty “I don’t really have any plans, to be honest, so if he gets selected, then I’ll adjust when I’m out there,” Warner said. “Hopefully, this time around I can come out and look to score and play in a positive way.” Warner, 36, managed just 95 runs in five Tests at 9.5 during the 2019 Ashes tour and has struggled at times over the past two years, scoring just one century - his epic 200 in the Boxing Day Test last summer - amid 18 scores of 15 or less in 32 innings.","pubDate":"2023-06-01 19:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Dhoni’s knee surgery in Mumbai goes smoothly","link":"https://thenorthlines.com/dhonis-knee-surgery-in-mumbai-goes-smoothly/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Former India captain Mahendra Singh Dhoni successfully underwent a left knee surgery in a Mumbai hospital on Thursday, raising hopes of playing in the 17th edition of Indian Premier League next year. Dhoni, who led Chennai Super Kings to their fifth IPL title, had flown to Mumbai from Ahmedabad after the final on […] The post Dhoni’s knee surgery in Mumbai goes smoothly appeared first on Northlines.","content":"Agencies Former India captain Mahendra Singh Dhoni successfully underwent a left knee surgery in a Mumbai hospital on Thursday, raising hopes of playing in the 17th edition of Indian Premier League next year. Dhoni, who led Chennai Super Kings to their fifth IPL title, had flown to Mumbai from Ahmedabad after the final on Monday and consulted renowned sports orthopaedic surgeon Dr Dinshaw Pardiwala, who is also on the BCCI medical panel and had performed surgeries on a number of top Indian cricketers, including Rishabh Pant. “Yes, Dhoni has had a successful knee surgery at the Kokilaben Hospital in Mumbai on Thursday. He is doing fine and the surgery happened in the morning. I don't have details. I am yet to get all the details about the nature of surgery and other things,” CSK CEO Kasi Viswanathan confirmed to PTI. It's learnt that Dhoni has already been discharged from the hospital after a keyhole surgery was performed for “arthroscopic repair”. “He has already been discharged from hospital and he has gone back to Ranchi. He would be resting for a few days at home before his extensive rehabilitation starts. It is now expected that he would have enough time to get fit to play in the next IPL,” another source close to CSK management told PTI on conditions of anonymity. Dhoni had played the entire season with heavy strapping on his left knee and while he looked absolutely fine during wicket-keeping, he came into bat as low as No. 8 at times and didn't look in his element while running between the wickets. On Wednesday, Viswanathan had said that whether Dhoni wants to undergo surgery will be completely the iconic captain's call. After the IPL final, Dhoni had said: “If you circumstantially see, it's the best time to announce retirement. The easy thing for me to say is thank you and retire. But the hard thing to do is to work hard for nine months and try to play one more IPL season. The body has to hold up. But the amount of love I have received from CSK fans, it would be a gift for them to play one more season. “The way they've shown their love and emotion, it's something I need to do for them. It's the last part of my career. It started over here and full house was chanting my name. It was same thing in Chennai, but it will be good to come back and play whatever I can. The kind of cricket I play, they feel they can play that cricket. There's nothing orthodox about it and I like to keep it simple.”","pubDate":"2023-06-01 18:41:54","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Hardik could have been the X-factor in the WTC Final’","link":"https://thenorthlines.com/hardik-could-have-been-the-x-factor-in-the-wtc-final/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"agencies Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. In 11 Tests Hardik Pandya has scored 532 runs at an average of […] The post ‘Hardik could have been the X-factor in the WTC Final’ appeared first on Northlines.","content":"agencies Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. In 11 Tests Hardik Pandya has scored 532 runs at an average of 31.29 and has taken 17 wickets ormer Australian cricket icon Ricky Ponting feels that India should have picked Hardik Pandya in their squad for the World Test Championship 2023 against Australia in London from June 7. In the latest episode of ICC Review, Ponting stated that Pandya's all-around capabilities could have helped India in the title decider. “…I thought about the other day for India in this game is how valuable someone like Hardik Pandya could be in a one-off Test match. I know he is on record saying that the Test match game is probably a little bit hard on his body. But for a one-off game… he's been bowling every game through this IPL and he's bowling quick,” Ponting said in the latest episode of ICC Review. “He (Pandya) could be that X-factor there just to pick in a one-off game, come in and see what he can do with bat and ball. He could be the difference between the two teams,” he added. Pandya has played in 11 Tests since making his debut in 2017. He has scored 532 runs at an average of 31.29. The 29-year-old has one hundred and four half centuries to his name. Pandya has taken 17 wickets in 11 Test matches at an average of 31.05. Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. India's Test batting mainstay Pujara could provide valuable insights to his teammates, having played extensively at Sussex in the English County Championship, while Kohli is at his absolute best having cracked two centuries and six half-tons for Royal Challengers Bangalore in the recently-concluded Indian Premier League. “The Australian team will be talking about Virat, no doubt about it, and they'll be talking about Pujara. They're the two,” Ponting said. Cheteshwar Pujara, who bats at No. 3, has 2,033 runs and five centuries in 24 Tests against Australia Pujara is known to relish the challenges thrown at him by Australian bowlers, having scored more Test runs and centuries against them than any other side, and his contribution would be crucial to India's chances of lifting the WTC trophy in their second attempt. “Pujara has been a thorn in their side a lot in the past, and in Australia, and this wicket will potentially be a lot more like an Australian pitch. They know that they'll have to get him early,” opined the former Australian captain. Pujara, who bats at No. 3, has 2,033 runs and five centuries in 24 Tests against Australia, and skipper Rohit Sharma will hope he makes a couple of more vital contributions for the side in the WTC final. Kohli, apart from his sparkling form in the IPL, had smashed 186 in the fourth Test against Australia in March during the Border-Gavaskar Trophy and would be itching to have a go at the Pat Cummins-led side. “They also know that Virat over the last few weeks is probably just about back to his absolute best, albeit in T20 cricket. He told me that the feeling he's getting right now is that he's almost back to his best, and that's an ominous warning for the Australians going into a one-off game,” said Ponting. Ponting is also mightily impressed with young Shubman Gill's performance in the IPL and the 23-year-old's exploits in the last two Tests of the Border-Gavaskar series. Gill hit three centuries for Gujarat Titans in IPL. “He looks like a terrific young guy. He's got that bit of attitude about him as well. He's got a bit of swagger. He has some serious class. That sort of front-foot pull shot that he plays against the fast bowlers will be a shot that he'll probably need against this Australian attack,” said Ponting. With the pace bowlers likely to do a lot of heavy lifting during the one-off Test, Ponting believes veteran Mohammed Shami will have to be at his absolute best against the strong Australian batting lineup, given that Jasprit Bumrah is not in the frame owing to injury. “I think he has to step up or try and take his game to another level if India are going to win this game. When you talk to the Australian batters as well, they understand how good Shami is whether it's new ball or old ball, whether it's in Australia or India. “They know the skillset he's got and how dangerous he can be. It's going to have to be him,” added Ponting.","pubDate":"2023-06-01 18:40:28","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"England openers shine as Ireland struggle on first day at Lord's","link":"https://www.the42.ie/england-ireland-cricket-6083191-Jun2023/","keywords":["Lords"],"creator":null,"video_url":null,"description":"Stuart Broad claimed five for 51 to dismiss Ireland for 172 before England closed on 152 for one.","content":"BEN DUCKETT AND Zak Crawley wasted little time getting back into the groove for England with a century stand against Ireland at Lord’s in what proved to be a near-perfect first day to an eagerly anticipated Test summer for the hosts. Both openers scored fifties and played true to the aggressive ‘Bazball’ style that has taken the nation by storm since Ben Stokes and Brendon McCullum took over the red-ball team last summer. England finished the opening day of this one-off Test on 151 for one and only 20 runs behind Ireland, who were dismissed for 172 at the start of the evening session thanks to Stuart Broad’s first five-wicket haul at Lord’s in 10 years. Broad ripped through Ireland’s top order during the first hour with a trio of scalps to reduce the tourists to 19 for three before Paul Stirling played fire with fire in an entertaining knock of 30. Ireland opener James McCollum backed him up with 36 and all-rounder Curtis Campher chipped in with 33, but Broad would not be denied his chance to go on the Lord’s honours board and finished with five for 51 off 17 overs after good support by Jack Leach and Matthew Potts. All eyes were then on Crawley, who kicked off an enormous two months for England with a punch through cover for four off his second ball. It was a sign of things to come with the fifty partnership brought up after 7.2 overs and Duckett happy to cut away to the boundary on his first Test innings on home soil. After a slight lull of 28 balls without a boundary, Crawley produced four fours from his next six balls but three were via the inside edge with the heavily scrutinised Kent batter not as fluent as his fellow opener. Duckett beat his partner to a half-century off 53 balls with two runs down to third man during a milestone 16th over that also saw Crawley reach fifty, from 39 deliveries, with a sumptuous cover drive. The hundred partnership was also brought up in that Mark Adair over but, in the next, the opening stand was ended when Ireland Test debutant Fionn Hand produced a stunning caught and bowled to see off Crawley for 56. Nottinghamshire’s Duckett remained undeterred and finished the day 60 not out after England’s new vice-captain Ollie Pope helped himself to a breezy 29 not out at a sun-soaked Lord’s. England’s start to the day had not been smooth sailing with their arrival from the team’s Kensington hotel delayed by five minutes due to Just Stop Oil protesters but once Stokes had put Ireland into bat, Broad quickly set about trying to get his name on the honours board. In the absence of rested duo James Anderson and Ollie Robinson, the Nottinghamshire seamer relished the chance to lead the attack and produced a fine opening spell of three for 14 from five overs. Broad had to wait until his 14th delivery to make the breakthrough but Peter Moor was pinned in front lbw for 10 and his next over produced even more drama. Ireland captain Andrew Balbirnie edged to second slip, where Crawley took an excellent low catch diving to his left and Harry Tector followed his skipper back to the pavilion two balls later. Tector inexplicably flicked straight to Potts at leg slip, which saw Broad produce his trademark shocked face in celebration but he was denied a hat-trick opportunity when an lbw decision against Stirling was overturned on review after ball-tracker showed it was missing leg stump. It enabled Stirling to lead a mini-recovery and he put on 45 with opener McCollum, but Leach ended the fun of the former Middlesex batter for 30 after another attempted sweep flicked off his glove and gave Jonny Bairstow a simple first catch behind the stumps since replacing Ben Foakes. After making it to lunch on 78 for four, Broad ended McCollum’s hard-fought 36 off 108 deliveries when he edged to Joe Root at first slip before Campher took the fight to England despite being hit on the helmet by England debutant Josh Tongue. It saw Ireland make it through a second session but Broad claimed his 20th Test five-wicket haul after tea when he hit the top of Adair’s off-stump. Leach had provided able support and finished with three for 35 after the dismissals of Lorcan Tucker and Campher before Potts brought the tourists’ first innings to an end when Hand edged behind to Bairstow in the 57th over.","pubDate":"2023-06-01 18:33:00","image_url":"https://c0.thejournal.ie/media/2023/06/englands-stuart-broad-celebrates-taking-the-wicket-of-irelands-peter-moor-not-pictured-during-day-one-of-the-first-lv-insurance-test-match-at-lords-london-picture-date-thursday-june-1-2023-630x420.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Stuart Broad and Ben Duckett dominate Ireland as England kick-start Ashes summer in style","link":"https://metro.co.uk/2023/06/01/cricket-england-kick-start-ashes-summer-dominating-ireland-lords-18883535/","keywords":["Cricket","Sport","Australia cricket","England cricket","Stuart Broad","The Ashes"],"creator":["Louis Sealey"],"video_url":null,"description":"An impressive start to a huge summer for England.","content":"Stuart Broad took his 20th Test five-wicket haul as England dominated Ireland (Picture: Getty) England kick-started the Ashes summer by bowling out Ireland cheaply at Lord’s and then showcasing the aggressive batting they hope will stun Australia. Stuart Broad marshalled an inexperienced bowling attack which included debutant Josh Tongue, claiming his 20th Test five-wicket haul in Ireland’s 172. The visitors threatened to emulate England’s 85 all out from this fixture four years ago when they slipped to 19-3, but contributions from James McCollum, Curtis Campher and Paul Stirling – all dismissed in the 30s – took Ireland to a below-par but respectable total. Rapid fifties from Ben Duckett and Zak Crawley in an opening stand of 109 saw England take complete control and show they have no plans of altering an approach under Ben Stokes and Brendon McCullum that is proving as successful as it is thrilling. In the absence of his long-time opening partner James Anderson – rested ahead of the Ashes – Broad quickly began a match-defining spell when England won the toss in overcast and chilly conditions. Ireland opener Peter Moor clipped Matthew Potts away for the first boundary of the Test but was unable to repeat the trick against Broad, who found just enough movement to claim wicket No. 577. Broad – playing his 162nd Test – struck again in his next over, Crawley alert in the slips to send Ireland captain Andrew Balbirnie back for a duck. Broad’s five wickets helped England bowled out Ireland for 172 (Picture: Getty) Ireland were three down and reeling two balls later as Harry Tector was caught at leg-slip, Broad celebrating his third wicket in eight deliveries. It almost got even worse for Ireland as Stirling survived a DRS review from his first ball to deny Broad the chance to take a third Test hat-trick. Stirling began to take advantage of his reprieve, cutting and sweeping his way to 30, though England still looked dangerous through Tongue, whose first two overs in Test cricket were both maidens. McCollum also frustrated England with a patient rearguard but he needed another partner when Jack Leech took his first wicket of the match, forcing an error from Stirling that left Ireland 78-4 at lunch. More: TrendingPub landlord wins £50,000 after placing bet on 11-year-old to play for EnglandBen Stokes responds to fears he won't be able to bowl during Ashes series for EnglandMichael Vaughan tips England to make Ashes statement against Ireland The wickets continued to tumble in the afternoon session – Ireland’s top-scorer McCollom nicking off for 36 and Lorcan Tucker trapped LBW – as England pressed home their advantage. Potts, making his sixth Test appearance, got in on the act when he found the edge of Andy McBrine – but Ireland at least passed 150 when Campher hit boundaries off Tongue and Broad. Despite the pitch flattening out, Ireland’s hopes of reaching 200 were soon over as they lost their final three wickets for three runs in the space of 16 balls. Broad once again made the breakthrough, getting the ball to nip back and beat Mark Adair for his 20th Test five-wicket haul – a milestone bettered by only 22 players in history. James McCollum top-scored for Ireland in just their seventh Test (Picture: Getty) Leech finished with three wickets after deceiving the charging Campher and Potts wrapped up an impressive bowling performance with his second scalp of the day. Needing early wickets, Ireland could do little to halt an onslaught from Crawley and Duckett, who found the boundary ropes at will in a thrilling opening stand. Crawley, in need of a score after a mixed start to the County Championship season, survived three inside edges but also produced several brilliant strokes on his way to a 39-ball half-century. Duckett was not far behind his opening partner, his first home Test fifty coming from 53 balls. Fionn Hand’s superb catch of his own bowling brought an end to Crawley’s innings but the runs kept coming from Duckett and Ollie Pope as England reached 152-1 at the close, trailing by just 20. England openers Zak Crawley and Ben Duckett put on 109 (Picture: Getty) BROAD MAKES STATEMENT AND TONGUE’S DELIGHT Stuart Broad has been doing his best to rattle the Aussies ahead of the Ashes but on this evidence he can probably let his bowling do the talking. Mitchell Starc did not take too kindly to Broad’s suggestion that the last Ashes series was ‘void’ due to coronavirus restrictions, while his revelation that he has been working on a new deliver – an outswinger – raised plenty of eyebrows Down Under. Broad’s pre-Ashes antics were temporarily put on hold at Lord’s, where he was at his leg-pumping best and may have made himself undroppable for the first Test against Australia. England are hopeful James Anderson, Ollie Robinson and Mark Wood will be fit for Edgbaston on June 16 but it would take a brave man to drop Broad after yet another five-wicket haul. With his mum, dad, partner and son all watching on…Jimmy Anderson presents Josh Tongue with his very first England cap â¤ï¸ðŸ§¢A special moment for the whole family ðŸ‘¨â€ðŸ‘©â€ðŸ‘¦Congratulations, Josh ðŸ‘ pic.twitter.com/FTew4m8y1o— England Cricket (@englandcricket) June 1, 2023 Before Broad ripped through Ireland, Josh Tongue completed a remarkable turnaround as he was presented with his Test cap in an England huddle attended by his family. The Worcestershire seamer considered retiring last year as he battled a persistent shoulder injury, but those fears are hopefully a thing of the past after he represented England for the first time and bowled 14 wicketless but tidy overs. And his inclusion at Lord’s was particularly good news for a pub landlord in Redditch, who wagered £100 at odds of 500/1 that Tongue would play for England at the age of 11. Tim Piper, who played cricket with Tongue’s father in the 1990s, said: ‘I’ve kept the bet slip in a cupboard all these years. I just thought to myself “it must be worth £100”. If he doesn’t make it, he’d make us proud anyway. This is just a bonus for him to get in the Test team.’ MORE : Ben Stokes responds to fears he won’t be able to bowl in the Ashes MORE : Hardik Pandya pays tribute to MS Dhoni after Chennai Super Kings win IPL For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2023-06-01 17:33:40","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Debuts for Hemantha and Pathirana on the cards as Sri Lanka build up to key World Cup qualifiers","link":"https://www.dailymirror.lk/breaking_news/Debuts-for-Hemantha-and-Pathirana-on-the-cards-as-Sri-Lanka-build-up-to-key-World-Cup-qualifiers/108-260281","keywords":null,"creator":null,"video_url":null,"description":"Leg spinner Dushan Hemantha and sling-armed fast bowler Matheesha Pathirana are in line for One Day International debuts when Sri Lanka take on Afghanistan in the first ODI in Hambantota tomorrow.","content":"Leg spinner Dushan Hemantha and sling-armed fast bowler Matheesha Pathirana are in line for One Day International debuts when Sri Lanka take on Afghanistan in the first ODI in Hambantota tomorrow. Sri Lanka will be without their main bowling weapon Wanindu Hasaranga, who has been ruled out of the first two ODIs in the three-match series, which opens the door for Hemantha to make his international cricket debut. “It's because of Wanindu's injury that Dushan has been called up to the squad and there is a good chance he will play tomorrow,” Sri Lanka captain Dasun Shanaka said. Hemantha impressed in the recent National Super League Limited Over, taking 13 wickets in 8 innings – the third leading wicket taker in the tournament – put him on the radar for the national team. He also averages 24.21 with the bat in List A cricket, potentially providing the all-round skills that Hasaranga brings to the team. With Hambantota not having hosted an international match since 2020, Shanaka believes that a new wicket could favour fast bowlers, with Sri Lanka contemplating a bowling attack with three front line fast bowlers. One of those spots could be handed to Pathirana, the right-arm fast bowler who proved a crucial part of the Chennai Super Kings team that won the Indian Premier League on Tuesday morning, though Shanaka was non-committal in naming a first XI. While Pathirana had seen his stock rise through his contributions at the tournament, Shanaka believes that he would not have been discovered by IPL teams had he not been given his early opportunities by Sri Lanka Cricket (SLC). “If you talk about Matheesha's achievements (at the IPL), he has represented Sri Lanka since the under 17 team, and it’s because of the performances with Sri Lankan cricket that he got the chance to play in the IPL. The IPL gives value to unorthodox skills and even though Matheesha hasn't been highlighted with the national, the opportunity for him to be highlighted in the IPL are higher. Matheesha has been with the national team for a while now, but unfortunately, he got Covid-19 during the tour of New Zealand and was unable to play the T20,” Shanaka said. Sri Lanka could also be buoyed by the return of Dushmantha Chameera, who was Sri Lanka’s best fast bowler before picking up an injury during the early stages of the T20 World Cup last year, returning to the national team after a long injury layoff. With Dimuth Karunaratne also returning after a long exile from ODI cricket, this series will provide Sri Lanka the last opportunity to identify its best XI, before the Cricket World Cup Qualifiers later this month. Meanwhile, Afghanistan, who have already directly qualified for the Cricket World Cup, will be without ace spinner Rashid Khan for the first two ODIs, having arrived to join the Afghanistan from the IPL with a back injury. While it is a significant absence, Shanaka believes that it would not be so pronounced given the other spin bowling option up Afghan captain Hashmatullah Shahidi has up his sleeve. “Even though Rashid Khan isn’t available, they have Noor Ahmed who has played in Sri Lanka and has experience playing in the IPL, and he has played international cricket. They also have Mujeeb ur-Rahman and Mohammad Nabi, so in terms of spinners they have some good, experienced options. We can't take them lightly,” Shanaka said. (Shehan Daniel)","pubDate":"2023-06-01 17:17:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_8757364e21.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australian Coach Daniel Vettori “impressed” with England team ahead of Ashes series","link":"https://thenewsmill.com/2023/06/australian-coach-daniel-vettori-impressed-with-england-team-ahead-of-ashes-series/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former New Zealand all-rounder and Australian Coach Daniel Vettori has praised the England cricket team for playing excellent cricket over a period of time which has impressed him a lot. One of the most competitive Series Ashes will start on June 16 which will be played between England and Australia in England. It comprises five test matches. Ahead of the match, the Australian coach said as quoted by skysports.com, “The fact that they’ve played so well over an extended period of time is what’s been so impressive.” “Irrespective of the style, they (England) are playing winning cricket, and I think that’s the thing that everyone gravitates towards,” he added Vettori also praised England’s head coach Brendon Mccullum and said that his addition to the England team has a “positive” impact. “Probably like Andrew [McDonald, Australia’s head coach], Brendon is the same in that he wouldn’t want to make the attention about himself. It’s just he’s got this moniker go for him now. But I think that’s Brendon since he came out of the womb – he’s pretty positive.” Ben Stokes’ knee problem developed during the series draw in New Zealand in February, and he hasn’t bowled since However, he had bowled just one over on April 3 for Chennai Super Kings in the Indian Premier League (IPL). Addressing Stokes’ injury issue, Vettori said, “I don’t think it will affect how we (Australia) prepare, but we will be preparing for him (Ben Stokes) to be at his normal (fitness), one of the top all-rounders in world cricket.” He said that all-rounders make things smooth and easy. “I think we know how much he brings to the table as an all-rounder. It’s like Cameron Green for us, offering that balance, the ability to come in and be an aggressive weapon along with his batting, which has been exceptional. “I think any team wants their all-rounder up and running because it makes everything else run so smoothly,” Vettori added. While Australia will play against India in the ICC World Test Championship final at the Oval in London. England is currently playing against Ireland in a one-off Test in preparation for the Ashes. “Ask me again on the back of these four days of prep! But there’s a real excitement that we have the ability to play one of the best teams in the world in such a crucial game and that should set us up well for the Ashes. It’s six Tests of high intensity and you couldn’t ask for anything more,” He concluded. (ANI)","pubDate":"2023-06-01 16:34:20","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Ndhlovu, Sibanda for Fairbreak Invitational","link":"https://www.bmetro.co.zw/ndhlovu-sibanda-for-fairbreak-invitational/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Fungai Muderere LADY Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from 14 to 30 September. It will be debut appearances for Ndhlovu and Sibanda where they will join Lady Chevrons […]","content":"Fungai Muderere LADY Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from 14 to 30 September. It will be debut appearances for Ndhlovu and Sibanda where they will join Lady Chevrons captain Mary Anne Musonda at the global cricket showcase that undertakes to deliver equal opportunities for female cricketers from all corners of the globe. Thus, FairBreak and USA Cricket are supporting gender equity and the advancement of women’s and girl’s cricket globally. Musonda has played in all the two previous editions of the Fairbreak Invitational. Ndhlovu’s abilities cannot be doubted as she emerged as the best player in both domestic tournaments played this year. She was voted Player of the Tournament in the Fifty50 Challenge and Women’s T20 Cup. Earlier this year, she captained Zimbabwe in the inaugural ICC Under-19 Women’s World Cup. She made her debut for Zimbabwe as a 16-year-old in 2022 in Namibia. In that debut series, she and Sharne Mayers hit an unbeaten 158 first wicket partnership. The inaugural FairBreak Invitational T20 took place in partnership with Cricket Hong Kong in Dubai in May 2022. Following on from the success of FairBreak Invitational, and with the continued support and backing of Cricket Hong Kong, the other contest was held in April this year at Kowloon Cricket Club in Hong Kong. With a follow-up tournament scheduled for September in the USA, FairBreak Global will now be reportedly conducting two tournaments per year. Six teams comprising some of the biggest names in women’s first-class cricket and outstanding players from associate member nations around the globe, will play each other in both two-week tournaments. All matches will be broadcast internationally.","pubDate":"2023-06-01 22:05:04","image_url":null,"source_id":"bmetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ICC Cricket World Cup Qualifiers enter home stretch","link":"https://www.bmetro.co.zw/icc-cricket-world-cup-qualifiers-enter-home-stretch/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo THE countdown to the start of the eagerly awaited Men’s Cricket World Cup Qualifiers is gaining momentum with only 16 days left. The global showpiece will be staged in Zimbabwe from 18 June to 9 July and matches will be played in four venues across Bulawayo and Harare. The crunch World Cup Qualifiers […]","content":"Brandon Moyo THE countdown to the start of the eagerly awaited Men’s Cricket World Cup Qualifiers is gaining momentum with only 16 days left. The global showpiece will be staged in Zimbabwe from 18 June to 9 July and matches will be played in four venues across Bulawayo and Harare. The crunch World Cup Qualifiers will be used to determine the two remaining spots to the World Cup later this year in India. A total of 10 teams will battle it out for the two remaining spots and Zimbabwe Cricket (ZC) promised yet another memorable tournament after playing host to the last edition of the qualifiers in 2018. Stadium preparations are under way at both the two cities and all is expected to be in order at the time the tournament commences. The 10 teams that will battle it out for the tournament will include the five bottom teams in the ICC Men’s Cricket World Cup Super League table, the top three teams from the ICC Men’s Cricket World Cup League 2 and the top two teams from the 2023 World Cup Qualifier Playoff. From the 10 teams that will be coming down to Zimbabwe, seven have named their trusted lieutenants who are expected to get the job done. The seven teams who have named their final squads are Nepal, Ireland, Netherlands, Oman, Scotland, United States of America (USA) and the West Indies. The three remaining teams are United Arab Emirates (UAE), Sri Lanka and Zimbabwe. Last week, the International Cricket Council (ICC) released the fixtures schedule with the headlining match being a Group A encounter between West Indies and the hosts, Zimbabwe. The other teams in Group A are Netherlands, USA and Nepal and the group’s matches will be played in Harare. Group B has Ireland, Scotland, Sri Lanka, Oman and UAE and the matches will be played in Bulawayo.","pubDate":"2023-06-01 22:03:22","image_url":null,"source_id":"bmetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ICC Chairman, Chief Executive conclude two-day Lahore visit","link":"https://www.nation.com.pk/02-Jun-2023/icc-chairman-chief-executive-conclude-two-day-lahore-visit","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The Chair of the International Cricket Council, Greg Barclay, and Geoff Allardice, the ICC Chief Executive, visited the Pakistan cricket headquarters in Lahore on Tuesday and Wednesday.","content":"LAHORE-The Chair of the International Cricket Council, Greg Barclay, and Geoff Allardice, the ICC Chief Executive, visited the Pakistan cricket headquarters in Lahore on Tuesday and Wednesday. This was Barclay’s first tour of Pakistan. During the pre-arranged two-day visit, Mr Barclay and Mr Allardice met with the Chair of the PCB Management Committee, Najam Sethi, and other PCB officials, and discussed wide-ranging matters of mutual interest around cricket, including promotion, growth and development. Outside the PCB headquarters, Mr Barclay and Mr Allardice visited the National Cricket Academy, Lahore Fort, Lahore Museum, Safe City Project and Minar-e-Pakistan. Sharing his views, Greg Barclay said: “It has been great to be here. My approach has been to visit all the Member countries and see how cricket and cricket administration operates in their respective jurisdiction as every country and Member is different in terms of size, scale, economy and where they might sit in the cricketing hierarchy. “The cricket facilities in Pakistan and the cricket programmes are great and now, that international cricket has returned to Pakistan and the PCB is able to successfully deliver bilateral arrangements at home, I think we’ll see Pakistan cricket reach another level for both men and women, and that will also have a positive impact in terms of commercial upside. “I enjoyed the briefing on the men’s and women’s cricket development plans and programmes at an administrative level and the progress that is being made. I think the future for Pakistan in terms of female participation and international successes is going to be huge in terms of potential. “From the ICC’s view, given that we have a strategy to grow the game globally, to see where the PCB fits in is also very pleasing. I am going to leave here well impressed with what I have seen,” he added. Najam Sethi, who is also an ICC Director, said: “I want to thank Greg and Geoff for undertaking this tour to Lahore, which provided both the ICC and the PCB with an opportunity to exchange views and ideas on the globally cricket ecosystem. “The PCB looks forward to continuing our discussions and working closely with the ICC to put together global strategies and plans that are not only in the best interest of all its members but also achieve the common objective of growing and developing the game by attracting new audiences,” Sethi added.","pubDate":"2023-06-01 20:32:16","image_url":"https://www.nation.com.pk/print_images/large/2023-06-02/icc-chairman-chief-executive-conclude-two-day-lahore-visit-1685651520-9169.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"‘He’s got to get selected first’: Warner fires back at Broad","link":"https://www.watoday.com.au/sport/cricket/he-s-got-to-get-selected-first-warner-fires-back-at-broad-20230601-p5dd2q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"David Warner has turned the heat back on his Ashes antagonist and insists no one in the Australian team hierarchy has spoken to him about his recent inconsistent performances.","content":"David Warner has taken aim at his Ashes nemesis Stuart Broad , suggesting he won’t be the force who ruined the opening batsman’s 2019 tour this time around. “He’s got to get selected first,” Warner told this masthead as the Australians continued their preparations for the World Test Championship final in London on Wednesday. Broad has not been shy in firing public potshots at the Australians, but the expectation is that the veteran quick and his new ball partner Jimmy Anderson, 41 next month, will struggle to play in all five Ashes Tests, to be played over six weeks. Broad is set to lead a depleted England attack in a Test against Ireland at Lord’s, beginning on Thursday, while Anderson (groin) and Ollie Robinson (ankle) are hopeful of being fit for opening Ashes Test. Australia’s tour of England kicks off with the WTC final against India at the Oval from Wednesday, before the first Test against England at Edgbaston from June 16. Warner, 36, readily gives credit to Broad for the way he was able to regularly move the ball off the seam at a full length, and concedes he was too defensive against the clever England seamer in 2019. But despite Broad’s domination, Warner is taking a relaxed approach to their next encounter. David Warner celebrates after reaching 200 against South Africa. Credit: Getty “I don’t really have any plans, to be honest, so if he gets selected, then I’ll adjust when I’m out there,” Warner said. “Hopefully, this time around I can come out and look to score and play in a positive way.” Warner, 36, managed just 95 runs in five Tests at 9.5 during the 2019 Ashes tour and has struggled at times over the past two years, scoring just one century - his epic 200 in the Boxing Day Test last summer - amid 18 scores of 15 or less in 32 innings.","pubDate":"2023-06-01 19:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Dhoni’s knee surgery in Mumbai goes smoothly","link":"https://thenorthlines.com/dhonis-knee-surgery-in-mumbai-goes-smoothly/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Former India captain Mahendra Singh Dhoni successfully underwent a left knee surgery in a Mumbai hospital on Thursday, raising hopes of playing in the 17th edition of Indian Premier League next year. Dhoni, who led Chennai Super Kings to their fifth IPL title, had flown to Mumbai from Ahmedabad after the final on […] The post Dhoni’s knee surgery in Mumbai goes smoothly appeared first on Northlines.","content":"Agencies Former India captain Mahendra Singh Dhoni successfully underwent a left knee surgery in a Mumbai hospital on Thursday, raising hopes of playing in the 17th edition of Indian Premier League next year. Dhoni, who led Chennai Super Kings to their fifth IPL title, had flown to Mumbai from Ahmedabad after the final on Monday and consulted renowned sports orthopaedic surgeon Dr Dinshaw Pardiwala, who is also on the BCCI medical panel and had performed surgeries on a number of top Indian cricketers, including Rishabh Pant. “Yes, Dhoni has had a successful knee surgery at the Kokilaben Hospital in Mumbai on Thursday. He is doing fine and the surgery happened in the morning. I don't have details. I am yet to get all the details about the nature of surgery and other things,” CSK CEO Kasi Viswanathan confirmed to PTI. It's learnt that Dhoni has already been discharged from the hospital after a keyhole surgery was performed for “arthroscopic repair”. “He has already been discharged from hospital and he has gone back to Ranchi. He would be resting for a few days at home before his extensive rehabilitation starts. It is now expected that he would have enough time to get fit to play in the next IPL,” another source close to CSK management told PTI on conditions of anonymity. Dhoni had played the entire season with heavy strapping on his left knee and while he looked absolutely fine during wicket-keeping, he came into bat as low as No. 8 at times and didn't look in his element while running between the wickets. On Wednesday, Viswanathan had said that whether Dhoni wants to undergo surgery will be completely the iconic captain's call. After the IPL final, Dhoni had said: “If you circumstantially see, it's the best time to announce retirement. The easy thing for me to say is thank you and retire. But the hard thing to do is to work hard for nine months and try to play one more IPL season. The body has to hold up. But the amount of love I have received from CSK fans, it would be a gift for them to play one more season. “The way they've shown their love and emotion, it's something I need to do for them. It's the last part of my career. It started over here and full house was chanting my name. It was same thing in Chennai, but it will be good to come back and play whatever I can. The kind of cricket I play, they feel they can play that cricket. There's nothing orthodox about it and I like to keep it simple.”","pubDate":"2023-06-01 18:41:54","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Hardik could have been the X-factor in the WTC Final’","link":"https://thenorthlines.com/hardik-could-have-been-the-x-factor-in-the-wtc-final/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"agencies Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. In 11 Tests Hardik Pandya has scored 532 runs at an average of […] The post ‘Hardik could have been the X-factor in the WTC Final’ appeared first on Northlines.","content":"agencies Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. In 11 Tests Hardik Pandya has scored 532 runs at an average of 31.29 and has taken 17 wickets ormer Australian cricket icon Ricky Ponting feels that India should have picked Hardik Pandya in their squad for the World Test Championship 2023 against Australia in London from June 7. In the latest episode of ICC Review, Ponting stated that Pandya's all-around capabilities could have helped India in the title decider. “…I thought about the other day for India in this game is how valuable someone like Hardik Pandya could be in a one-off Test match. I know he is on record saying that the Test match game is probably a little bit hard on his body. But for a one-off game… he's been bowling every game through this IPL and he's bowling quick,” Ponting said in the latest episode of ICC Review. “He (Pandya) could be that X-factor there just to pick in a one-off game, come in and see what he can do with bat and ball. He could be the difference between the two teams,” he added. Pandya has played in 11 Tests since making his debut in 2017. He has scored 532 runs at an average of 31.29. The 29-year-old has one hundred and four half centuries to his name. Pandya has taken 17 wickets in 11 Test matches at an average of 31.05. Australia will have to guard against the “thorn in their side” Cheteshwar Pujara and a “back at his best” Virat Kohli if they are to counter India in the World Test Championship final at The Oval next week, Ponting added. India's Test batting mainstay Pujara could provide valuable insights to his teammates, having played extensively at Sussex in the English County Championship, while Kohli is at his absolute best having cracked two centuries and six half-tons for Royal Challengers Bangalore in the recently-concluded Indian Premier League. “The Australian team will be talking about Virat, no doubt about it, and they'll be talking about Pujara. They're the two,” Ponting said. Cheteshwar Pujara, who bats at No. 3, has 2,033 runs and five centuries in 24 Tests against Australia Pujara is known to relish the challenges thrown at him by Australian bowlers, having scored more Test runs and centuries against them than any other side, and his contribution would be crucial to India's chances of lifting the WTC trophy in their second attempt. “Pujara has been a thorn in their side a lot in the past, and in Australia, and this wicket will potentially be a lot more like an Australian pitch. They know that they'll have to get him early,” opined the former Australian captain. Pujara, who bats at No. 3, has 2,033 runs and five centuries in 24 Tests against Australia, and skipper Rohit Sharma will hope he makes a couple of more vital contributions for the side in the WTC final. Kohli, apart from his sparkling form in the IPL, had smashed 186 in the fourth Test against Australia in March during the Border-Gavaskar Trophy and would be itching to have a go at the Pat Cummins-led side. “They also know that Virat over the last few weeks is probably just about back to his absolute best, albeit in T20 cricket. He told me that the feeling he's getting right now is that he's almost back to his best, and that's an ominous warning for the Australians going into a one-off game,” said Ponting. Ponting is also mightily impressed with young Shubman Gill's performance in the IPL and the 23-year-old's exploits in the last two Tests of the Border-Gavaskar series. Gill hit three centuries for Gujarat Titans in IPL. “He looks like a terrific young guy. He's got that bit of attitude about him as well. He's got a bit of swagger. He has some serious class. That sort of front-foot pull shot that he plays against the fast bowlers will be a shot that he'll probably need against this Australian attack,” said Ponting. With the pace bowlers likely to do a lot of heavy lifting during the one-off Test, Ponting believes veteran Mohammed Shami will have to be at his absolute best against the strong Australian batting lineup, given that Jasprit Bumrah is not in the frame owing to injury. “I think he has to step up or try and take his game to another level if India are going to win this game. When you talk to the Australian batters as well, they understand how good Shami is whether it's new ball or old ball, whether it's in Australia or India. “They know the skillset he's got and how dangerous he can be. It's going to have to be him,” added Ponting.","pubDate":"2023-06-01 18:40:28","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"England openers shine as Ireland struggle on first day at Lord's","link":"https://www.the42.ie/england-ireland-cricket-6083191-Jun2023/","keywords":["Lords"],"creator":null,"video_url":null,"description":"Stuart Broad claimed five for 51 to dismiss Ireland for 172 before England closed on 152 for one.","content":"BEN DUCKETT AND Zak Crawley wasted little time getting back into the groove for England with a century stand against Ireland at Lord’s in what proved to be a near-perfect first day to an eagerly anticipated Test summer for the hosts. Both openers scored fifties and played true to the aggressive ‘Bazball’ style that has taken the nation by storm since Ben Stokes and Brendon McCullum took over the red-ball team last summer. England finished the opening day of this one-off Test on 151 for one and only 20 runs behind Ireland, who were dismissed for 172 at the start of the evening session thanks to Stuart Broad’s first five-wicket haul at Lord’s in 10 years. Broad ripped through Ireland’s top order during the first hour with a trio of scalps to reduce the tourists to 19 for three before Paul Stirling played fire with fire in an entertaining knock of 30. Ireland opener James McCollum backed him up with 36 and all-rounder Curtis Campher chipped in with 33, but Broad would not be denied his chance to go on the Lord’s honours board and finished with five for 51 off 17 overs after good support by Jack Leach and Matthew Potts. All eyes were then on Crawley, who kicked off an enormous two months for England with a punch through cover for four off his second ball. It was a sign of things to come with the fifty partnership brought up after 7.2 overs and Duckett happy to cut away to the boundary on his first Test innings on home soil. After a slight lull of 28 balls without a boundary, Crawley produced four fours from his next six balls but three were via the inside edge with the heavily scrutinised Kent batter not as fluent as his fellow opener. Duckett beat his partner to a half-century off 53 balls with two runs down to third man during a milestone 16th over that also saw Crawley reach fifty, from 39 deliveries, with a sumptuous cover drive. The hundred partnership was also brought up in that Mark Adair over but, in the next, the opening stand was ended when Ireland Test debutant Fionn Hand produced a stunning caught and bowled to see off Crawley for 56. Nottinghamshire’s Duckett remained undeterred and finished the day 60 not out after England’s new vice-captain Ollie Pope helped himself to a breezy 29 not out at a sun-soaked Lord’s. England’s start to the day had not been smooth sailing with their arrival from the team’s Kensington hotel delayed by five minutes due to Just Stop Oil protesters but once Stokes had put Ireland into bat, Broad quickly set about trying to get his name on the honours board. In the absence of rested duo James Anderson and Ollie Robinson, the Nottinghamshire seamer relished the chance to lead the attack and produced a fine opening spell of three for 14 from five overs. Broad had to wait until his 14th delivery to make the breakthrough but Peter Moor was pinned in front lbw for 10 and his next over produced even more drama. Ireland captain Andrew Balbirnie edged to second slip, where Crawley took an excellent low catch diving to his left and Harry Tector followed his skipper back to the pavilion two balls later. Tector inexplicably flicked straight to Potts at leg slip, which saw Broad produce his trademark shocked face in celebration but he was denied a hat-trick opportunity when an lbw decision against Stirling was overturned on review after ball-tracker showed it was missing leg stump. It enabled Stirling to lead a mini-recovery and he put on 45 with opener McCollum, but Leach ended the fun of the former Middlesex batter for 30 after another attempted sweep flicked off his glove and gave Jonny Bairstow a simple first catch behind the stumps since replacing Ben Foakes. After making it to lunch on 78 for four, Broad ended McCollum’s hard-fought 36 off 108 deliveries when he edged to Joe Root at first slip before Campher took the fight to England despite being hit on the helmet by England debutant Josh Tongue. It saw Ireland make it through a second session but Broad claimed his 20th Test five-wicket haul after tea when he hit the top of Adair’s off-stump. Leach had provided able support and finished with three for 35 after the dismissals of Lorcan Tucker and Campher before Potts brought the tourists’ first innings to an end when Hand edged behind to Bairstow in the 57th over.","pubDate":"2023-06-01 18:33:00","image_url":"https://c0.thejournal.ie/media/2023/06/englands-stuart-broad-celebrates-taking-the-wicket-of-irelands-peter-moor-not-pictured-during-day-one-of-the-first-lv-insurance-test-match-at-lords-london-picture-date-thursday-june-1-2023-630x420.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Stuart Broad and Ben Duckett dominate Ireland as England kick-start Ashes summer in style","link":"https://metro.co.uk/2023/06/01/cricket-england-kick-start-ashes-summer-dominating-ireland-lords-18883535/","keywords":["Cricket","Sport","Australia cricket","England cricket","Stuart Broad","The Ashes"],"creator":["Louis Sealey"],"video_url":null,"description":"An impressive start to a huge summer for England.","content":"Stuart Broad took his 20th Test five-wicket haul as England dominated Ireland (Picture: Getty) England kick-started the Ashes summer by bowling out Ireland cheaply at Lord’s and then showcasing the aggressive batting they hope will stun Australia. Stuart Broad marshalled an inexperienced bowling attack which included debutant Josh Tongue, claiming his 20th Test five-wicket haul in Ireland’s 172. The visitors threatened to emulate England’s 85 all out from this fixture four years ago when they slipped to 19-3, but contributions from James McCollum, Curtis Campher and Paul Stirling – all dismissed in the 30s – took Ireland to a below-par but respectable total. Rapid fifties from Ben Duckett and Zak Crawley in an opening stand of 109 saw England take complete control and show they have no plans of altering an approach under Ben Stokes and Brendon McCullum that is proving as successful as it is thrilling. In the absence of his long-time opening partner James Anderson – rested ahead of the Ashes – Broad quickly began a match-defining spell when England won the toss in overcast and chilly conditions. Ireland opener Peter Moor clipped Matthew Potts away for the first boundary of the Test but was unable to repeat the trick against Broad, who found just enough movement to claim wicket No. 577. Broad – playing his 162nd Test – struck again in his next over, Crawley alert in the slips to send Ireland captain Andrew Balbirnie back for a duck. Broad’s five wickets helped England bowled out Ireland for 172 (Picture: Getty) Ireland were three down and reeling two balls later as Harry Tector was caught at leg-slip, Broad celebrating his third wicket in eight deliveries. It almost got even worse for Ireland as Stirling survived a DRS review from his first ball to deny Broad the chance to take a third Test hat-trick. Stirling began to take advantage of his reprieve, cutting and sweeping his way to 30, though England still looked dangerous through Tongue, whose first two overs in Test cricket were both maidens. McCollum also frustrated England with a patient rearguard but he needed another partner when Jack Leech took his first wicket of the match, forcing an error from Stirling that left Ireland 78-4 at lunch. More: TrendingPub landlord wins £50,000 after placing bet on 11-year-old to play for EnglandBen Stokes responds to fears he won't be able to bowl during Ashes series for EnglandMichael Vaughan tips England to make Ashes statement against Ireland The wickets continued to tumble in the afternoon session – Ireland’s top-scorer McCollom nicking off for 36 and Lorcan Tucker trapped LBW – as England pressed home their advantage. Potts, making his sixth Test appearance, got in on the act when he found the edge of Andy McBrine – but Ireland at least passed 150 when Campher hit boundaries off Tongue and Broad. Despite the pitch flattening out, Ireland’s hopes of reaching 200 were soon over as they lost their final three wickets for three runs in the space of 16 balls. Broad once again made the breakthrough, getting the ball to nip back and beat Mark Adair for his 20th Test five-wicket haul – a milestone bettered by only 22 players in history. James McCollum top-scored for Ireland in just their seventh Test (Picture: Getty) Leech finished with three wickets after deceiving the charging Campher and Potts wrapped up an impressive bowling performance with his second scalp of the day. Needing early wickets, Ireland could do little to halt an onslaught from Crawley and Duckett, who found the boundary ropes at will in a thrilling opening stand. Crawley, in need of a score after a mixed start to the County Championship season, survived three inside edges but also produced several brilliant strokes on his way to a 39-ball half-century. Duckett was not far behind his opening partner, his first home Test fifty coming from 53 balls. Fionn Hand’s superb catch of his own bowling brought an end to Crawley’s innings but the runs kept coming from Duckett and Ollie Pope as England reached 152-1 at the close, trailing by just 20. England openers Zak Crawley and Ben Duckett put on 109 (Picture: Getty) BROAD MAKES STATEMENT AND TONGUE’S DELIGHT Stuart Broad has been doing his best to rattle the Aussies ahead of the Ashes but on this evidence he can probably let his bowling do the talking. Mitchell Starc did not take too kindly to Broad’s suggestion that the last Ashes series was ‘void’ due to coronavirus restrictions, while his revelation that he has been working on a new deliver – an outswinger – raised plenty of eyebrows Down Under. Broad’s pre-Ashes antics were temporarily put on hold at Lord’s, where he was at his leg-pumping best and may have made himself undroppable for the first Test against Australia. England are hopeful James Anderson, Ollie Robinson and Mark Wood will be fit for Edgbaston on June 16 but it would take a brave man to drop Broad after yet another five-wicket haul. With his mum, dad, partner and son all watching on…Jimmy Anderson presents Josh Tongue with his very first England cap â¤ï¸ðŸ§¢A special moment for the whole family ðŸ‘¨â€ðŸ‘©â€ðŸ‘¦Congratulations, Josh ðŸ‘ pic.twitter.com/FTew4m8y1o— England Cricket (@englandcricket) June 1, 2023 Before Broad ripped through Ireland, Josh Tongue completed a remarkable turnaround as he was presented with his Test cap in an England huddle attended by his family. The Worcestershire seamer considered retiring last year as he battled a persistent shoulder injury, but those fears are hopefully a thing of the past after he represented England for the first time and bowled 14 wicketless but tidy overs. And his inclusion at Lord’s was particularly good news for a pub landlord in Redditch, who wagered £100 at odds of 500/1 that Tongue would play for England at the age of 11. Tim Piper, who played cricket with Tongue’s father in the 1990s, said: ‘I’ve kept the bet slip in a cupboard all these years. I just thought to myself “it must be worth £100”. If he doesn’t make it, he’d make us proud anyway. This is just a bonus for him to get in the Test team.’ MORE : Ben Stokes responds to fears he won’t be able to bowl in the Ashes MORE : Hardik Pandya pays tribute to MS Dhoni after Chennai Super Kings win IPL For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2023-06-01 17:33:40","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Debuts for Hemantha and Pathirana on the cards as Sri Lanka build up to key World Cup qualifiers","link":"https://www.dailymirror.lk/breaking_news/Debuts-for-Hemantha-and-Pathirana-on-the-cards-as-Sri-Lanka-build-up-to-key-World-Cup-qualifiers/108-260281","keywords":null,"creator":null,"video_url":null,"description":"Leg spinner Dushan Hemantha and sling-armed fast bowler Matheesha Pathirana are in line for One Day International debuts when Sri Lanka take on Afghanistan in the first ODI in Hambantota tomorrow.","content":"Leg spinner Dushan Hemantha and sling-armed fast bowler Matheesha Pathirana are in line for One Day International debuts when Sri Lanka take on Afghanistan in the first ODI in Hambantota tomorrow. Sri Lanka will be without their main bowling weapon Wanindu Hasaranga, who has been ruled out of the first two ODIs in the three-match series, which opens the door for Hemantha to make his international cricket debut. “It's because of Wanindu's injury that Dushan has been called up to the squad and there is a good chance he will play tomorrow,” Sri Lanka captain Dasun Shanaka said. Hemantha impressed in the recent National Super League Limited Over, taking 13 wickets in 8 innings – the third leading wicket taker in the tournament – put him on the radar for the national team. He also averages 24.21 with the bat in List A cricket, potentially providing the all-round skills that Hasaranga brings to the team. With Hambantota not having hosted an international match since 2020, Shanaka believes that a new wicket could favour fast bowlers, with Sri Lanka contemplating a bowling attack with three front line fast bowlers. One of those spots could be handed to Pathirana, the right-arm fast bowler who proved a crucial part of the Chennai Super Kings team that won the Indian Premier League on Tuesday morning, though Shanaka was non-committal in naming a first XI. While Pathirana had seen his stock rise through his contributions at the tournament, Shanaka believes that he would not have been discovered by IPL teams had he not been given his early opportunities by Sri Lanka Cricket (SLC). “If you talk about Matheesha's achievements (at the IPL), he has represented Sri Lanka since the under 17 team, and it’s because of the performances with Sri Lankan cricket that he got the chance to play in the IPL. The IPL gives value to unorthodox skills and even though Matheesha hasn't been highlighted with the national, the opportunity for him to be highlighted in the IPL are higher. Matheesha has been with the national team for a while now, but unfortunately, he got Covid-19 during the tour of New Zealand and was unable to play the T20,” Shanaka said. Sri Lanka could also be buoyed by the return of Dushmantha Chameera, who was Sri Lanka’s best fast bowler before picking up an injury during the early stages of the T20 World Cup last year, returning to the national team after a long injury layoff. With Dimuth Karunaratne also returning after a long exile from ODI cricket, this series will provide Sri Lanka the last opportunity to identify its best XI, before the Cricket World Cup Qualifiers later this month. Meanwhile, Afghanistan, who have already directly qualified for the Cricket World Cup, will be without ace spinner Rashid Khan for the first two ODIs, having arrived to join the Afghanistan from the IPL with a back injury. While it is a significant absence, Shanaka believes that it would not be so pronounced given the other spin bowling option up Afghan captain Hashmatullah Shahidi has up his sleeve. “Even though Rashid Khan isn’t available, they have Noor Ahmed who has played in Sri Lanka and has experience playing in the IPL, and he has played international cricket. They also have Mujeeb ur-Rahman and Mohammad Nabi, so in terms of spinners they have some good, experienced options. We can't take them lightly,” Shanaka said. (Shehan Daniel)","pubDate":"2023-06-01 17:17:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_8757364e21.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australian Coach Daniel Vettori “impressed” with England team ahead of Ashes series","link":"https://thenewsmill.com/2023/06/australian-coach-daniel-vettori-impressed-with-england-team-ahead-of-ashes-series/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former New Zealand all-rounder and Australian Coach Daniel Vettori has praised the England cricket team for playing excellent cricket over a period of time which has impressed him a lot. One of the most competitive Series Ashes will start on June 16 which will be played between England and Australia in England. It comprises five test matches. Ahead of the match, the Australian coach said as quoted by skysports.com, “The fact that they’ve played so well over an extended period of time is what’s been so impressive.” “Irrespective of the style, they (England) are playing winning cricket, and I think that’s the thing that everyone gravitates towards,” he added Vettori also praised England’s head coach Brendon Mccullum and said that his addition to the England team has a “positive” impact. “Probably like Andrew [McDonald, Australia’s head coach], Brendon is the same in that he wouldn’t want to make the attention about himself. It’s just he’s got this moniker go for him now. But I think that’s Brendon since he came out of the womb – he’s pretty positive.” Ben Stokes’ knee problem developed during the series draw in New Zealand in February, and he hasn’t bowled since However, he had bowled just one over on April 3 for Chennai Super Kings in the Indian Premier League (IPL). Addressing Stokes’ injury issue, Vettori said, “I don’t think it will affect how we (Australia) prepare, but we will be preparing for him (Ben Stokes) to be at his normal (fitness), one of the top all-rounders in world cricket.” He said that all-rounders make things smooth and easy. “I think we know how much he brings to the table as an all-rounder. It’s like Cameron Green for us, offering that balance, the ability to come in and be an aggressive weapon along with his batting, which has been exceptional. “I think any team wants their all-rounder up and running because it makes everything else run so smoothly,” Vettori added. While Australia will play against India in the ICC World Test Championship final at the Oval in London. England is currently playing against Ireland in a one-off Test in preparation for the Ashes. “Ask me again on the back of these four days of prep! But there’s a real excitement that we have the ability to play one of the best teams in the world in such a crucial game and that should set us up well for the Ashes. It’s six Tests of high intensity and you couldn’t ask for anything more,” He concluded. (ANI)","pubDate":"2023-06-01 16:34:20","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}