{"newsArray":[{"title":"T20 cricket World Cup 2022: Australia vs England team, drop Aaron Finch, Pat Cummins, analysis, video","link":"https://www.foxsports.com.au/cricket/australia/t20-cricket-world-cup-2022-australia-vs-england-team-drop-aaron-finch-pat-cummins-analysis-video/news-story/ae66385eeb365e4011a71ffc480d1ee6","keywords":null,"creator":null,"video_url":null,"description":"Two matches into Australia’s World Cup defence and their tournament likely goes on the line against England on Friday night.","content":null,"pubDate":"2022-10-27 23:00:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Will Pucovski announcement leaves cricket world gutted: 'Sad story'","link":"https://au.sports.yahoo.com/cricket-2022-will-pucovski-announcement-leaves-fans-gutted-203131286.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-27 20:31:31","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-10/0d0721a0-5635-11ed-a3f7-ab356b981c71","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"The Loop live: Several injured in stabbing at Italian shopping centre, Zimbabwe orchestrates another T20 World Cup upset over Pakistan - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTEwLTI4L3RoZS1sb29wLW1vcm5pbmctbmV3cy1jdXJyZW50LWFmZmFpcnMtc3BvcnQtd29ybGQtZW50ZXJ0YWlubWVudC8xMDE1ODc4NTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The Loop live: Several injured in stabbing at Italian shopping centre, Zimbabwe orchestrates another T20 World Cup upset over Pakistan  ABC NewsZimbabwe furious about Mr Bean betrayal  news.com.auT20 World Cup 2022 LIVE cricket scores: South Africa vs Bangladesh highlights, results, Netherlands v India latest updates; Pakistan v Zimbabwe | Matthew Wade becomes second positive Covid case  Wide World of SportsZimbabwe stun Pakistan in epic one-run upset – and Asian giant’s title dream could be over  Fox SportsHow Ricky Ponting's tear-inducing ICC clip inspired Zimbabwe's Sikandar Raza to beat Pakistan  T20 World CupView Full coverage on Google News","content":null,"pubDate":"2022-10-27 20:08:43","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket world erupts over Mr Bean betrayal - news.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2Fic29sdXRlLW1hZG5lc3MtYXQtY3JpY2tldC13b3JsZC1jdXAtYXMtbXItYmVhbi1yaXZhbHJ5LWV4cGxvZGVzL25ld3Mtc3RvcnkvZjUyM2NmYmQyNWZmMTRmMmU2NWQ4NjQ0ZmRkMDc1ZTjSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cricket world erupts over Mr Bean betrayal  news.com.auT20 World Cup 2022 LIVE cricket scores: South Africa vs Bangladesh highlights, results, Netherlands v India latest updates; Pakistan v Zimbabwe | Matthew Wade becomes second positive Covid case  Wide World of SportsPakistan stunned in epic one-run boilover as World Cup contenders on brink of collapse  Fox SportsT20 World Cup rocked by 'insane' scenes as Zimbabwe shock Pakistan  Yahoo Sport AustraliaPakistan suffers second straight heartbreaking loss at World Cup, going down to Zimbabwe by 1 run.  Wide World of SportsView Full coverage on Google News","content":null,"pubDate":"2022-10-27 20:03:16","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Zimbabwe produce stunning upset over Pakistan at T20 World Cup - New Zealand Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5uemhlcmFsZC5jby5uei9zcG9ydC9jcmlja2V0LXppbWJhYndlLXByb2R1Y2Utc3R1bm5pbmctdXBzZXQtb3Zlci1wYWtpc3Rhbi1hdC10MjAtd29ybGQtY3VwL0dCTjZZTE1ISlpCN1BBTUFORk5NT1RTR1pZL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Zimbabwe produce stunning upset over Pakistan at T20 World Cup  New Zealand HeraldT20 World Cup 2022 LIVE cricket scores: South Africa vs Bangladesh highlights, results, Netherlands v India latest updates; Pakistan v Zimbabwe | Matthew Wade becomes second positive Covid case  Wide World of SportsThe Loop live: Several injured in stabbing at Italian shopping centre, Zimbabwe orchestrates another T20 World Cup upset over Pakistan  ABC NewsZimbabwe stun Pakistan in epic one-run upset – and Asian giant’s title dream could be over  Fox SportsHow Ricky Ponting's tear-inducing ICC clip inspired Zimbabwe's Sikandar Raza to beat Pakistan  T20 World CupView Full coverage on Google News","content":null,"pubDate":"2022-10-27 18:29:56","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Next time, send the real Mr. Bean: Zimbabwe President congratulates cricket team over Pak victory","link":"https://www.indiatoday.in/sports/cricket/story/next-time-send-the-real-mr-bean-zimbabwe-president-congratulates-cricket-team-over-pakistan-victory-2290297-2022-10-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Next time, send the real Mr. Bean: Zimbabwe President congratulates cricket team over Pak victory","content":null,"pubDate":"2022-10-27 18:22:13","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"AFG vs IRE Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s AFG vs IRE T20 World Cup 2022 match No. 25 at MCG, 930 PM IST, October 28","link":"https://zeenews.india.com/cricket/afg-vs-ire-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-afg-vs-ire-t20-world-cup-2022-match-no-25-at-mcg-930-pm-ist-october-28-2527486.html","keywords":null,"creator":null,"video_url":null,"description":"Afghanistan vs Ireland Dream11 Team Prediction Afghanistan vs Ireland T20 World Cup 20522 Match No.25 Preview - Check My Dream11 Team, Best players list of AFG vs IRE, Afghanistan Dream11 Team Player List, Ireland Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Afghanistan are set to take on Ireland in their T20 World Cup 2022 Super 12 fixture on Friday (October 28) at the Melbourne Cricket Ground (MCG). The World Cup in Australia has already produced some thrillers and some very interesting results like the West Indies getting knocked out, Pakistan getting thumped by Zimbabwe and more. Every contest is not to miss if you are a cricket fan. Afghanistan and Ireland both have had a shaky start to their campaign and a win in this fixture will hand them a good boost for the remaining tournament. AFG vs IRE Dream11 Team Prediction Captain: Andrew Balbirnie Vice-Captain: Curtis Campher Suggested Playing XI for AFG vs IRE Dream11 Fantasy Cricket: Wicketkeepers: Rahmanullah Gurbaz, Lorcan Tucker Batsmen: Paul Stirling, Ibrahim Zadran, Andrew Balbirnie All-rounders: Mohammad Nabi, Gareth Delany, Curtis Campher Bowlers: Joshua Little, Rashid Khan, Mujeeb Ur Rahman AFG vs IRE Probable Playing XI Afghanistan Probable Playing XI: Hazratullah Zazai, Rahmanullah Gurbaz (wk), Ibrahim Zadran, Usman Ghani, Najibullah Zadran, Mohammad Nabi (c), Azmatullah Omarzai, Rashid Khan, Mujeeb Ur Rahman, Fareed Ahmad, Fazalhaq Farooqi Ireland Probable Playing XI: Paul Stirling, Andrew Balbirnie (c), Lorcan Tucker (wk), Harry Tector, Curtis Campher, George Dockrell, Gareth Delany, Mark Adair, Simi Singh, Barry McCarthy, Joshua Little","pubDate":"2022-10-27 18:10:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Great Boulder too good for Norths in B-grade cricket","link":"https://thewest.com.au/news/kalgoorlie-miner/great-boulder-too-good-for-norths-in-b-grade-cricket-c-8664517","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Great Boulder have opened the new Eastern Goldfields Cricket Association’ season with back-to-back B-grade victories.","content":null,"pubDate":"2022-10-27 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8664517/e44ca6d36200ced99141d2acb98f2173ac08ebb8-16x9-x578y746w2593h1458.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"HISTORIC! BCCI announces equal pay for men and women","link":"https://www.thenorthlines.com/historic-bcci-announces-equal-pay-for-men-and-women/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies In a historic move by the Board of Control for Cricket in India (BCCI), India’s cricket governing body on Thursday announced an equal match fee for both men’s and women’s cricketers of India. In a landmark decision, the BCCI on Thursday announced equal match fee for its centrally-contracted female and male players in a […] The post HISTORIC! BCCI announces equal pay for men and women appeared first on Northlines.","content":"Agencies In a historic move by the Board of Control for Cricket in India (BCCI), India’s cricket governing body on Thursday announced an equal match fee for both men’s and women’s cricketers of India. In a landmark decision, the BCCI on Thursday announced equal match fee for its centrally-contracted female and male players in a bid to promote gender equality in the country’s most popular sport. BCCI secretary Jay Shah took to Twitter to announce the significant development. “I’m pleased to announce @BCCI’s first step towards tackling discrimination. We are implementing pay equity policy for our contracted @BCCIWomen cricketers.” “The match fee for both Men and Women Cricketers will be same as we move into a new era of gender equality in Cricket,” Shah tweeted. As per the newly introduced system, the Indian women’s cricketers will now receive Rs 15 lakh per Test, Rs 6 lakh per ODI, and Rs 3 lakh per T20I, the same as their male counterparts. “The @BCCIWomen cricketers will be paid the same match fee as their male counterparts. Test (Rs 15 lakhs), ODI (Rs 6 lakhs), T20I (Rs 3 lakhs). “Pay equity was my commitment to our women cricketers and I thank the Apex Council for their support,” Shah added. Earlier this year, New Zealand Cricket (NZC) had struck a deal with the country’s players’ association, which enabled the women cricketers to earn as much as the male players, while Cricket Australia (CA) is also working to do away with gender disparity. On expected lines, the decision was welcomed by the cricket fraternity. “It’s a historic move. It’s a new dawn for women’s cricket. Things were already moving ahead. WIPL together with pay equity policy are steps to get women’s cricket to where men’s cricket is today,” the legendary Mithali Raj told PTI when called for her reaction. “As a member of the women’s cricket fraternity I thank the BCCI and honorary secretary Jay Shah for this announcement. We are already witnessing the growth and popularity of women’s cricket from 2017 till now. It’s a great move in the right direction.” This decision was taken at the BCCI Apex Council emergent meeting on Thursday. Outgoing Apex Council member and former India player Shantha Rangaswamy, who attended the meeting, said, “This is a revolutionary decision by the BCCI. The decision shows that India treats its women equally and there is no gender discrimination. Would like to thank Jay Shah, Roger Binny and Rajeev Shukla for taking this momentous decision.” Former India player Harbhajan Singh also hailed the BCCI’s decision to bring parity in the match fee. “BCCI has set a standard for other sports bodies. It will encourage greater participation of women in the game. A historic milestone indeed!,” the spin great wrote on Twitter. Recently, the Indian women’s cricket team triumphed in the Asia Cup in Bangladesh, beating Sri Lanka by eight wickets. The team also won the country’s first-ever silver medal in cricket at the Commonwealth Games in Birmingham earlier this year. In the last Annual General Meeting (AGM) of BCCI, the cricket board also announced the first-ever women’s IPL that is scheduled to take place next year.The post HISTORIC! BCCI announces equal pay for men and women appeared first on Northlines.","pubDate":"2022-10-27 17:35:50","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Holloway hates cricket and Socceroos speak out – Thursday’s sporting social","link":"https://uk.sports.yahoo.com/news/holloway-hates-cricket-socceroos-speak-172356736.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-27 17:23:56","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“Khud nahi hota, kerna parta hai”: Shoaib Akhtar downhearted by Pakistan’s embarrassing loss to Zimbabwe in T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-khud-nahi-hota-kerna-parta-hai-shoaib-akhtar-downhearted-by-pakistans-embarrassing-loss-to-zimbabwe-in-t20-world-cup-2022/","keywords":["Cricket","ICC T20 World Cup 2022","Pakistan","Shoaib Akhtar","Zimbabwe"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shoaib Akhtar downhearted by Pakistan’s shambolic show against Zimbabwe during their second match of the T20 World Cup 2022. Just when almost whole of Pakistan were assured that Thursday it will be, when their team would register their maiden T20I victory on Australia soil, they have been handed the most unlikeliest of disappointment, as a… The post “Khud nahi hota, kerna parta hai”: Shoaib Akhtar downhearted by Pakistan’s embarrassing loss to Zimbabwe in T20 World Cup 2022 appeared first on The SportsRush.","content":"Shoaib Akhtar downhearted by Pakistan’s shambolic show against Zimbabwe during their second match of the T20 World Cup 2022. Just when almost whole of Pakistan were assured that Thursday it will be, when their team would register their maiden T20I victory on Australia soil, they have been handed the most unlikeliest of disappointment, as a lower-ranked, yet high-in-spirit Zimbabwean side have defeated Babar Azam’s men by 1 run, to cause yet another major upset in the ongoing T20 World Cup 2022. Pakistan, for the second time in a row, found themselves on the wrong side of the result off the final delivery of the contest, as they lost only their second T20I ever against the African nation in history. After a commendable effort with the ball which restricted Zimbabwe to a modest total of 130/8 in their 20 Overs, the score was perfect for the successful Pakistani opening pair of skipper Babar Azam (4 off 9) and Mohammed Rizwan (14 off 16). But, despite spending significant time at the crease as per T20 format standards, they yet again headed back towards the dug-out within the Powerplay, to hand the task to the middle-order batters, who anyway would be blamed in case the team loses. However, the pair of Shan Masood (44 off 38) and Shadab Khan (17 off 14) did manage to hold the innings together and steadily march towards the Zimbabwean total. But, the experienced Pakistan-origin Zimbabwean star allrounder Sikandar Raza (4-0-25-3), had some other plans with the ball in hand tonight. Raza, not only dismissed Khan, and then Haider Ali (0 off 1) off consecutive deliveries during the 14th Over, but then as if poured the entire bucket of water on the remaining Pakistani hopes by getting rid of Masood as well in the next Over. Mohammad Nawaz yet again fails to finish things off Mohammad Nawaz (22 off 18), who had a perfect opportunity to even things out tonight after failing to defend 16 runs off the final Over against India last Sunday, failed to take his side home yet again, getting caught at mid-off with 3 runs required off the last two deliveries. With Shaheen Afridi managing to score a single off the final delivery, Pakistan agonizingly fell short by 1 run, to leave the camp and the fans at the stadium shell-shocked with despair. Shoaib Akhtar downhearted by Pakistan’s loss versus Zimbabwe in T20 World Cup 2022 Former Pakistan fast bowler Shoaib Akhtar, stated Pakistan’s loss tonight as ’embarrassing, to be most polite’, resulting due to a flop show by the batters at the Perth Stadium. He also posted a short video on his social media handle, slamming the average players in the squad, the average team management, and the Pakistan Cricket Board (PCB) in general. Akhtar had, a month ago slammed the PCB pertaining some of the Pakistan squad selections for the ongoing World Cup, and had predicted that the team will be badly exposed in Australia during the tournament. The 47-year-old made sure that that he did bring back this particular remark after the team’s embarrassing show tonight. Expressing his disappointment further, Akhtar slammed team Pakistan by exclaiming that just because its Zimbabwe who are up against them, doesn’t mean that the win is all but guaranteed. Agar Zimbabwe hai toh khud he ho jaaye ga sab kuch? Nahi, khud nahi hota, kerna parta hai. — Shoaib Akhtar (@shoaib100mph) October 27, 2022 For more Cricket-related news, click here. The post “Khud nahi hota, kerna parta hai”: Shoaib Akhtar downhearted by Pakistan’s embarrassing loss to Zimbabwe in T20 World Cup 2022 appeared first on The SportsRush.","pubDate":"2022-10-27 16:46:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - India vs Netherlands 23rd Match, Group 2 2022/23 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiiAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pY2MtbWVuLXMtdDIwLXdvcmxkLWN1cC0yMDIyLTIzLTEyOTgxMzQvaW5kaWEtdnMtbmV0aGVybGFuZHMtMjNyZC1tYXRjaC1ncm91cC0yLTEyOTgxNTcvbWF0Y2gtcmVwb3J00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - India vs Netherlands 23rd Match, Group 2 2022/23  ESPNcricinfoFans celebrate India's victory against The Netherlands at the SCG  DD INDIAWatch: Suryakumar Yadav's viral 'Lao bhaiya do' reaction while collecting award  Hindustan TimesLive match blog - India vs Netherlands 23rd Match, Group 2 2022/23 - Cricket Insights  ESPNcricinfoIndia Now Muster Up For Netherlands, After Historic Win | Special World Cup Show, Mission Downunder  NewsXView Full coverage on Google News","content":null,"pubDate":"2022-10-27 16:29:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Shoaib Akhtar fumes at Pakistan Cricket Board after defeat to Zimbabwe","link":"https://www.indiatoday.in/sports/cricket/story/pakistan-vs-zimbabwe-t20-world-cup-shoaib-akhtar-disappointed-2290256-2022-10-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Shoaib Akhtar fumes at Pakistan Cricket Board after defeat to Zimbabwe","content":null,"pubDate":"2022-10-27 16:17:26","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Zimbabwe T20 World Cup: Babar Azam and men suffer shock 1-run defeat in Perth","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-zimbabwe-t20-world-cup-babar-azam-and-men-suffer-shock-1-run-defeat-in-perth-11524751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Zimbabwe T20 World Cup: Babar Azam and men suffer shock 1-run defeat in Perth","content":"Pakistan suffered their second straight defeat at the T20 World Cup and this time it was embarrassing as it came minnows Zimbabwe in a one-run defeat during the Super 12 stages in Perth on Thursday.T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | PhotosIn a match that was a roller-coaster rider for both sides, Pakistan suffered a late middle-order collapse at a time when victory seemed imminent as Zimbabwe’s Sikandar Raza turned around the game with three wickets in five balls. His 25/3 spell made all the difference as Pakistan’s scoring rate fell significantly while looking to recover from the collapse.Earlier batting first, Zimbabwe could only manage a 130/8 after they suffer a similar middle-order collapse to Pakistan in the Group 2 match. In reply, Pakistan could come up with 129/8 in 20 overs.With the defeat, Pakistan are now fifth in six-team Group 2 with two losses in two games and are only ahead of bottom-placed Netherlands on NRR. India, who on Sunday defeated Pakistan in a thriller, are sitting atop with a comfortable win over the Dutch.Zimbabwe, who came through the first round in Australia to reach the Super 12, are third in Group 2 behind South Africa.Only the top two reach the semi-finals.“It’s so special, especially for the work that we did to get into the Super 12s and we didn’t want our tournament to end there,” said Zimbabwe skipper Craig Ervine.“We wanted to come in and play some really good cricket against some top teams, and I thought we did that exceptionally well today.”Pakistan’s chase looked on course when Shan Masood, who made 44, put on a 52-run fourth-wicket partnership with Shadab Khan.But Sikandar Raza broke the stand with Shadab’s wicket and was to be Pakistan’s tormentor-in-chief, returning figures of 3-25.Raza, a finger spinner, then trapped Haider Ali lbw on the next ball for nought to be on a hat-trick that was averted by Mohammad Nawaz.Raza soon took down Masood (44 off 38 balls) and Nawaz attempted to get the remaining runs, 11 off the final over, but was run out on the penultimate ball of the 20th over.Needing three on the final ball, new batsman Shaheen Shah Afridi ran one but got run out when running for the second as Zimbabwe’s players erupted in celebration.“Very disappointing performance by my team,” said Pakistan skipper Babar Azam.“We were not up to the mark in the batting.”In Pakistan’s reply, Azam got off the mark with a boundary after seven dots, but soon got out to Brad Evans to extend his bad run in the tournament. He fell for a duck against India.Mohammad Rizwan hit a four and a six but followed his partner back to the dugout after chopping an in-coming delivery from pace bowler Blessing Muzarabani on to his stumps.Pakistan were in trouble at 36-3 when Luke Jongwe sent back Iftikhar Ahmed for five with his medium-pace bowling, before Masood and Shadab pulled things back for a while.Zimbabwe’s openers Wesley Madhevere and Ervine had used the pace of Pakistan’s seamers to good effect with a string of boundaries in a 42-run stand.But all-rounder Shadab’s 3-23 with his wrist spin and pace bowler Mohammad Wasim’s 4-24 held Zimbabwe — whose opening match in the Super 12 in Hobart was a washout — to what seemed a below par total.Zimbabwe lost four wickets on 95 — Sean Williams, Regis Chakabva, Raza and Jongwe — before Brad Evans took his team past the 120-run mark.Williams was Zimbabwe’s top scorer with 31 off 28 balls.With inputs from AFPRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-27 16:09:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/PAK-vs-ZIM.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"David Hussey: ‘IPL is still the best T20 competition in the world’","link":"https://sportstar.thehindu.com/cricket/t20-world-cup-2022-david-hussey-cricket-evolution-kolkata-knight-riders-indian-premier-league/article66061784.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Hussey, now the head of men’s cricket at Cricket Victoria, shares his thoughts with Sportstar about the changes in T20 cricket","content":null,"pubDate":"2022-10-27 16:03:11","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"“Won’t call the result an upset”: Shahid Afridi admits Zimbabwe played top cricket from Ball 1 vs Pakistan in Perth","link":"https://thesportsrush.com/cricket-news-wont-call-the-result-an-upset-shahid-afridi-admits-zimbabwe-played-top-cricket-from-ball-1-vs-pakistan-in-perth/","keywords":["Cricket","ICC T20 World Cup 2022","Pakistan","Shahid Afridi","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Zimbabwe played top cricket: The former captain reckons the opposition outplayed Pakistan at the Perth Stadium tonight. Zimbabwe have stunned the global cricketing fraternity after defeating Pakistan by 1 run in ICC T20 World Cup 2022 Match 24 in Perth tonight. While both Zimbabwean T20I victories against Pakistan have come in the last three matches… The post “Won’t call the result an upset”: Shahid Afridi admits Zimbabwe played top cricket from Ball 1 vs Pakistan in Perth appeared first on The SportsRush.","content":"Zimbabwe played top cricket: The former captain reckons the opposition outplayed Pakistan at the Perth Stadium tonight. Zimbabwe have stunned the global cricketing fraternity after defeating Pakistan by 1 run in ICC T20 World Cup 2022 Match 24 in Perth tonight. While both Zimbabwean T20I victories against Pakistan have come in the last three matches between these two teams, the latest one is all the more special due to its presence in a World Cup Super 12 match. A stunning victory for Zimbabwe has it in it to have a direct impact on Pakistan’s qualification for the semi-finals. In spite of Pakistan not having the best of T20I records in Australia, no one would’ve expected them to lose their first two matches in this World Cup. Although their current 15-member squad was looking much better on paper, these cricketers not converting their potential into performance has left plentiful Pakistan fans in shock. Shahid Afridi admits Zimbabwe played top cricket from Ball 1 vs Pakistan in Perth Chasing a 131-run target, Pakistan lost wickets from the word go. Babar Azam (4) and Mohammad Rizwan (14), Pakistan’s most-reliable batters in this format, were the first two batters to be dismissed. Despite his superior T20I record in this country, Iftikhar Ahmed (5) couldn’t make it count on Thursday becoming the third Pakistani batter to get out in the first half of their innings. Batter Shan Masood (44) and all-rounder Mohammad Nawaz (22) showed some resistance but their respective strike rates of 115.78 and 122.22 weren’t enough for a team victory. Frankly speaking, failing to seal a low-scoring run-chase against a comparatively weaker opposition isn’t worthy of any sort of justifications. It is due to all these reasons that former Pakistan captain Shahid Afridi has refused to term this loss as an “upset”. Afridi took to social media platform Twitter to bring to light Zimbabwe’s “top cricket” from the first ball. Congratulating Zimbabwe, Afridi admitted that their performance was a tutorial on how to defend a low innings score on a batting wicket. Won’t call the result an upset, if you watched the match you know Zimbabwe played top cricket from ball #1 and showed how to defend a low total on a batting pitch. Congratulations @ZimCricketv on the win, your passion and hard work shows #PAKvsZIM — Shahid Afridi (@SAfridiOfficial) October 27, 2022 A dejected Pakistani cricket team will next face Netherlands at the same venue on Sunday. The post “Won’t call the result an upset”: Shahid Afridi admits Zimbabwe played top cricket from Ball 1 vs Pakistan in Perth appeared first on The SportsRush.","pubDate":"2022-10-27 15:58:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Zimbabwe win hearts on Twitter with thrilling win as ex-Pakistan cricketers slam Men in Green","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-zimbabwe-win-hearts-on-twitter-with-thrilling-win-as-ex-pakistan-cricketers-slam-men-in-green-11524581.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup: Zimbabwe win hearts on Twitter with thrilling win as ex-Pakistan cricketers slam Men in Green","content":"Cricket T20 World Cup: Zimbabwe win hearts on Twitter with thrilling win as ex-Pakistan cricketers slam Men in Green Zimbabwe held their nerve to pull off a thrilling one-run win as Pakistan suffered a second consecutive defeat in the T20 World Cup. FirstCricket Staff October 27th, 2022 21:12:40 IST The Zimbabwean players celebrate their one-run victory over Pakistan in their T20 World Cup Group 2 encounter in Perth. AFP Pakistan found themselves suffering back-to-back heartbreaks in the T20 World Cup as Zimbabwe held on to their nerves to pull off a thrilling one-run win in Perth on Thursday. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos The Zimbabwean bowlers staged a superb comeback in the business end of the match after the fourth-wicket stand between Shan Masood and Shadab Khan had put the former T20 world champions in the driver’s seat. All-rounder Sikandar Raza was responsible for bringing the Chevrons back in the game, dismissing the set Shadab and Haider Ali off successive deliveries in the 14th over before getting the all-important wicket of Masood in his final over of the evening to suddenly put the Men in Green under pressure. Brad Evans, drafted into the Zimbabwean XI in place of Tendai Chatara, bowled a superb final over to get his team over the line after Pakistan were left needing 11 to win from the final over. Evans started off on an expensive note, conceding three and four off the first two balls, but kept his calm and bowled tight lines to concede just one off the next three, getting rid of Nawaz off the penultimate ball. Shaheen Shah Afridi was the last man to walk out to bat, and was run out while charging back for a second as Zimbabwe, who had pulled off an upset victory over Australia in the inaugural edition of the T20 World Cup, pulled off one of their most memorable wins ever. Social media was abuzz after the thriller at Perth; while Pakistani ex-cricketers and fans moaned their team’s inability to win tight games, a majority of Cricket Twitter was all praise for the spirited Zimbabweans, who now sit at the third spot in Group 2 behind India and South Africa and suddenly look like contenders for a spot in the knockouts. We take a look at some of the most interesting reactions here: @ZimCricketv Epic win Zimbabwe!!!Incredible performance guys — Henry Olonga (@henryolonga) October 27, 2022 What a shocker 😱 — Wasim Akram (@wasimakramlive) October 27, 2022 Thats embarrassing, to be most polite! — Shoaib Akhtar (@shoaib100mph) October 27, 2022 Terrific win for Zimbabwe👏🏻👏🏻👏🏻. They just never give up. Outstanding #ICCT20WorldCup — Ian Raphael Bishop (@irbishi) October 27, 2022 from day one I said poor selection ub is cheez ki responsibility kon le ga I think it’s time to get rid of so called chairman jo pcb ka khuda bana hwa hai and so called chief selector. — Mohammad Amir (@iamamirofficial) October 27, 2022 Zimbabwe Cricket! The never-say-die team of the world! — Adam Theo🇿🇼🏏 #RegisterToVote (@AdamTheofilatos) October 27, 2022 Yeah this hurts, maybe recency bias but hurts more than Ireland 2007, more than Bangladesh 1999, more than most matches I can think of. — Rehan Ulhaq (@Rehan_ulhaq) October 27, 2022 We are officially the biggest chokers in world cricket. — Haroon (@hazharoon) October 27, 2022 What a victory for Zimbabwe – they completely deserve this win! Pakistan were poor with the bat & all the shortcomings that were highlighted during the England series showing up. — zainab abbas (@ZAbbasOfficial) October 27, 2022 What a moment for Zimbabwean cricket. From suspension, corruption, and irrelevance, to this. What a win. What a moment. — Jarrod Kimber (@ajarrodkimber) October 27, 2022 Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: October 27, 2022 21:12:40 IST Tags: Cricket Pakistan Vs Zimbabwe T20 World Cup T20 World Cup Pakistan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-10-27 15:42:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Zimbabwe-celebrate-Pakistan-T20-World-Cup-AFP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Zimbabwe celebrate Pakistan victory in style at Optus Stadium","link":"https://www.perthnow.com.au/sport/cricket-world-cup/t20-world-cup-zimbabwe-celebrate-pakistan-victory-in-style-at-optus-stadium-c-8681319","keywords":null,"creator":["Aaron Kirby"],"video_url":null,"description":"Zimbabwe won the hearts of cricket fans everywhere in a nail-biting final-ball victory over the world’s fourth-best team Pakistan in Perth, but the way they celebrated showed just what it meant.","content":"Zimbabwe won the hearts of cricket fans everywhere in a nail-biting final-ball victory over the world’s fourth-best team Pakistan in Perth, but the way they celebrated showed just what it meant. After thanking a section of dedicated Zimbabwe faithful who beat the drums of hope throughout the night, the team got into a tight huddle on the boundary. They began to sing and jump before every player entered the ring to dance with his teammates as their joy echoed around the Optus Stadium arena. The passion dripped off the Zimbabwe players during the 15-minute celebration after fighting out an incredible and miraculous victory over Pakistan, led by the golden man of the tournament Sikandar Raza who claimed 3-25. Raza was on the verge of tears post-game after being handed his third Man-of-the-Match award. “I just can’t tell you how proud I am of this bunch of boys... we just kept believing,” Raza said. Pakistan looked home and hosed after taking seven runs off the first two balls of the last over. But the fall of Muhammad Nawaz on the penultimate delivery left Pakistan needing three runs with one ball remaining. Shaheen Shah Afridi bunted the ball straight but not far enough. Not even a wicketkeeper fumble could prevent him from being run out coming back for two to try and force a super over, leaving his side one short of victory and their World Cup dreams in tatters.","pubDate":"2022-10-27 15:37:05","image_url":"https://images.perthnow.com.au/publication/C-8681319/61955af890b6b71775531a9b817acb6575638145-16x9-x0y0w480h270.gif","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Zimbabwe T20 World Cup: 'That's 3 wickets in 5 balls!' - Sikandar Raza turns the game around as Pak panic","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-zimbabwe-t20-world-cup-thats-3-wickets-in-5-balls-sikandar-raza-turns-the-game-around-as-pak-panic-11524521.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Zimbabwe T20 World Cup: 'That's 3 wickets in 5 balls!' - Sikandar Raza turns the game around as Pak panic","content":"Cricket Pakistan vs Zimbabwe T20 World Cup: 'That's 3 wickets in 5 balls!' - Sikandar Raza turns the game around as Pak panic Pakistan press the panic button as Zimbabwe spinner Sikandar Raza puts them in trouble with a match-winning spell. FirstCricket Staff October 27th, 2022 20:59:01 IST Sikandar Raza of Zimbabwe celebrates after taking the wicket of Pakistan's Haider Ali during T20 World Cup Super 12 Group 2 match in Perth on Thursday. AFP In a match that turned out to be a roller coaster ride, Zimbabwe shocked former champions Pakistan by a run in Group 2 of the Super 12 stage at the T20 World Cup on Wednesday. Pakistan have themselves to blame for pressing the panic button while chasing a modest target of 131 as Sikandar Raza sent them into a shock mode with three wickets in space of five deliveries he bowled across two overs. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos The incident happened when Pakistan looked favourite to take the game with Shan Masood and Shadab Khan stitching a nice partnership for the fourth wicket. At 88/3 in 13.3 overs, Pakistan needed 43 runs in 39 balls and were looking comfortable with Shadab Khan dispatched the prior delivery by Raza for a huge 85m six. However, things changed quickly from there on as we take you through the highlights 13.4 OUT Shabab Khan (17) came charging down the track and looked to loft the off-break straight but could miscue it to Sean Williams for a catching practice at long-off. 88/4 13.5 OUT Haider Ali is out of the first ball as he is caught plum lbw of a fuller right in front of the stumps while trying to flick the ball to the leg side. Umpire didn’t hesitate to raise his finger but Masood and Haider still opted for a review and was duly wasted. 88/5 View this post on Instagram A post shared by ICC (@icc) 13.6 CLOSE Raza shortened his length and bowled it quick closer to the off to newly-in southpaw Mohammad Nawaz, who somehow managed an inside edge before the ball hits the pad. 88/5 15.1 NO RUN Raza bowled it short which Masood hit straight through the ground straight at backward point fielder. 93/5 15.2 STUMPED Raza bowled it wide while Masood walked out to nudge the delivery for a single but missed it completely. Wicket-keeper Regis Chakabva was lightening quick in effecting his second T20 stumping. Masood buried his head on the ground in embarrassment for getting out in that fashion when his team needed him to finish off the game. 93/6 View this post on Instagram A post shared by ICC (@icc) Pakistan did bring themselves back in the game from there on as Mohammad Nawaz and Mohammad Wasim brought down the equation from 23 runs off 12 balls to 3 off 3 but pacer Brad Evans hold on to his nerve for the final three deliveries to clinch the game for Zimbabwe by a solitary run. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: October 27, 2022 20:59:01 IST Tags: Cricket Sikandar Raza T20 World Cup T20 World Cup Pakistan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-10-27 15:29:01","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Sikandar-Raza-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Zimbabwe celebrate epic World Cup victory over Pakistan with heartfelt dancing","link":"https://thewest.com.au/sport/cricket-world-cup/t20-world-cup-zimbabwe-celebrate-epic-world-cup-victory-over-pakistan-with-heartfelt-dancing-c-8681198","keywords":null,"creator":["Aaron Kirby"],"video_url":null,"description":"Zimbabwe won the hearts of cricket fans everywhere in a nail-biting final-ball victory over the world’s fourth-best team Pakistan in Perth, but the way they celebrated showed just what it meant.","content":"Zimbabwe won the hearts of cricket fans everywhere in a nail-biting final-ball victory over the world’s fourth-best team Pakistan in Perth, but the way they celebrated showed just what it meant. After thanking a section of dedicated Zimbabwe faithful who beat the drums of hope throughout the night, the team got into a tight huddle on the boundary. They began to sing and jump before every player entered the ring to dance with his teammates as their joy echoed around the Optus Stadium arena. Jordan McArdle Aaron Kirby The passion dripped off the Zimbabwe players during the 15-minute celebration after fighting out an incredible and miraculous victory over Pakistan, led by the golden man of the tournament Sikandar Raza who claimed 3-25. Raza was on the verge of tears post-game after being handed his third Man-of-the-Match award. “I just can’t tell you how proud I am of this bunch of boys... we just kept believing,” Raza said. Pakistan looked home and hosed after taking seven runs off the first two balls of the last over. But the fall of Muhammad Nawaz on the penultimate delivery left Pakistan needing three runs with one ball remaining. Shaheen Shah Afridi bunted the ball straight but not far enough. Not even a wicketkeeper fumble could prevent him from being run out coming back for two to try and force a super over, leaving his side one short of victory and their World Cup dreams in tatters. Sign up for our emails","pubDate":"2022-10-27 15:27:22","image_url":"https://images.thewest.com.au/publication/C-8681198/61955af890b6b71775531a9b817acb6575638145-16x9-x0y0w480h270.gif","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia vs England T20 World Cup: Date, toss time, TV channel, live streaming for Aus vs ENG","link":"https://www.firstpost.com/firstcricket/sports-news/australia-vs-england-t20-world-cup-date-toss-time-tv-channel-live-streaming-for-aus-vs-eng-11524551.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Australia vs England T20 World Cup: Date, toss time, TV channel, live streaming for Aus vs ENG","content":"An enthralling contest is on the cards when hosts Australia take on arch-rivals England in a Super 12 contest of the 2022 T20 World Cup at the Melbourne Cricket Ground on Friday.Both Australia and England have played two games in Group 2 of the Super 12 stage so far, with both having won and lost a game each.While Australia began with a defeat to New Zealand on the opening day of the Super 12 stage, the defending champions bounced back to beat Sri Lanka by seven wickets in their second match.England, meanwhile, kickstarted their campaign with a five-wicket win over Afghanistan, but that was followed by a five-run defeat to Ireland in a rain-marred contest in Melbourne.For Australia, it will be paramount that David Warner gets back to his best. To put to context, Warner has endured scores of 5 and 11 against New Zealand and Sri Lanka respectively, and while Aaron Finch did score an unbeaten 31 against Sri Lanka, much more will be expected from the duo as well as rest of the Australian top and middle-order.England will have to be wary of Marcus Stoinis, who was in top form against Sri Lanka with a quickfire 59* off 18 balls.England’s Sam Curran ran riot against Afghanistan in the first match, scalping a five-wicket haul, and he followed it up with a couple of more wickets in the Ireland game. Curran is fourth in the top wicket-takers list this edition, with seven scalps, just two behind leader, Sri Lanka’s Wanindu Hasaranga.Australia, meanwhile, have suffered setbacks this tournament. While Adam Zampa had missed out on the opener after testing positive for COVID-19, Matthew Wade too was infected with the disease just a day before the England clash, but he is still likely to take part in the contest.Ahead of Australia vs England, here’s everything you need to know:When will the ICC T20 World Cup 2022 Group 1 match between Australia and England take place?The ICC T20 World Cup 2022 Group 1 match between Australia and England will be played on Friday, 28 October.Where will the ICC T20 World Cup 2022 Group 1 match between Australia and England be played?The ICC T20 World Cup 2022 Group 1 match between Australia and England will be played at the Melbourne Cricket Ground.What time will the ICC T20 World Cup 2022 Group 1 match between Australia and England begin?The ICC T20 World Cup 2022 Group 1 match between Australia and England will start at 1:30 pm IST (7 pm local time).How can I watch the ICC T20 World Cup 2022 Group 1 match between Australia and England?You can watch ICC T20 World Cup 2022 Group 1 match between Australia and England Live on Star Sports Network.How can I watch the Live stream of the ICC T20 World Cup 2022 Group 1 match between Australia and England?The ICC T20 World Cup 2022 Group 1 match between Australia and England will be live-streamed on Disney+ Hotstar. You can also follow LIVE updates on Firstpost.com.Squads: Australia: Aaron Finch (c), Ashton Agar, Pat Cummins, Tim David, Cameron Green, Josh Hazlewood, Mitchell Marsh, Glenn Maxwell, Kane Richardson, Steven Smith, Mitchell Starc, Marcus Stoinis, Matthew Wade, David Warner, Adam Zampa.England: Jos Buttler(w/c), Alex Hales, Dawid Malan, Ben Stokes, Liam Livingstone, Harry Brook, Moeen Ali, Sam Curran, Chris Woakes, Adil Rashid, Mark Wood, Philip Salt, Chris Jordan, David Willey, Tymal Mills ","pubDate":"2022-10-27 15:11:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/England-celebrate-Ireland-AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Zimbabwe edge Pakistan by one run in Perth thriller","link":"https://www.thestar.com.my/sport/cricket/2022/10/27/cricket-zimbabwe-edge-pakistan-by-one-run-in-perth-thriller","keywords":null,"creator":null,"video_url":null,"description":"PERTH (Reuters) - All-rounder Sikandar Raza sensationally picked up 3-25 against Pakistan on Thursday as Zimbabwe prevailed by one run in a final-ball thriller to register their first Super 12 win at the Twenty20 World Cup. Read full story","content":"PERTH (Reuters) - All-rounder Sikandar Raza sensationally picked up 3-25 against Pakistan on Thursday as Zimbabwe prevailed by one run in a final-ball thriller to register their first Super 12 win at the Twenty20 World Cup. Floored by an extraordinary last-ball defeat to arch-rivals India in their opening match on Sunday, Pakistan find their tournament in tatters after, having restricted Zimbabwe to a modest 130-8 at Perth Stadium, reaching just 129-8 in reply. Fresh off a horror last over against India that cost his side the match, Mohammed Nawaz's nightmare tournament continued when he was caught for 22 off the penultimate ball of the match off the bowling of Brad Evans (2-25), who had an 11-run cushion in the last over. Pakistan's chase got off to a rocky start, squeezed at 36-3 in the eighth over with the world's top-ranked T20 batsman, Mohammed Rizwan, back in the dugout for 14 having chopped a delivery from two-metre tall Blessing Muzarabani (1-18) on to his stumps. It was left to Shaan Masood to steady the ship with a composed 44, regularly exploiting the large outfield to run twos. But Raza further pegged back the Asian side with his off-spin, having Masood stumped off a wide. After losing the toss earlier, Pakistan's much-vaunted pace attack bowled too full in the powerplay overs, conceding 47 runs, although quick wickets to dismiss the Zimbabwe openers kept the rate in check. Signalling a return to form after scoring one in his side's washout against South Africa on Monday, all-rounder Sean Williams (31) found the boundary three times and looked set to accelerate with the score at 95-3 and six overs remaining. Spinner Shadab Khan (3-23) clean-bowled the left-hander before he had the chance though, triggering a collapse in which four wickets fell in six deliveries with no runs added. Late runs from Evans (19 off 15 balls) gave the African side the lift they ultimately needed to move to third position in Group Two. (Reporting by Joel Dubber in Perth)","pubDate":"2022-10-27 15:08:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Zimbabwe Live, T20 World Cup 2022: ZIM stun PAK at Perth, beat them by 1 run - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMidGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9wYWtpc3Rhbi12cy16aW1iYWJ3ZS1saXZlLWNyaWNrZXQtc2NvcmUtdDIwLXdvcmxkLWN1cC0yMDIyLTgyMzIwODgv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs Zimbabwe Live, T20 World Cup 2022: ZIM stun PAK at Perth, beat them by 1 run  The Indian ExpressPakistan Zimbabwe T20 World Cup News Live | Pakistan loses to Zimbabwe Live | Live World T20 News  CNN-News18Live Cricket Score: Pakistan vs Zimbabwe, Match 24, T20 WC 2022 | Cricbuzz.com  CricbuzzAalia Rasheed's Analysis of Pakistan's Upset Defeat - ICC T-20 World Cup 2022 | Geo Super  GEO SUPERPakistan vs Zimbabwe Highlights, T20 World Cup 2022: 'Want to thank Ricky Ponting for motivation': Sikandar Raza after thrilling 1 run win vs Pakistan  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-10-27 14:59:07","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan (PAK) vs Zimbabwe (ZIM) T20 World Cup HIGHLIGHTS: ZIM stun PAK by 1 run in a thriller","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-zimbabwe-live-score-t20-world-cup-updates-perth-11521411.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan (PAK) vs Zimbabwe (ZIM) T20 World Cup HIGHLIGHTS: ZIM stun PAK by 1 run in a thriller","content":"20:31 (IST)That's it from our end for this game. Hope you enjoyed our coverage. Stay with us for all the LIVE UPDATES from the tournament20:25 (IST)🇿🇼 beat Pakistan 🇵🇰 by one run! 🔥#PAKvZIM | #T20WorldCup pic.twitter.com/jTgHlwzC9r— Zimbabwe Cricket (@ZimCricketv) October 27, 202220:22 (IST)\" I am lost for words, my mouth's dry probably because of the emotions I am going through at the moment. I can't tell you how proud I'm of this bunch of boys. The way our seamers started at the top, was just unbelievable and the way we backed it up in the field and the way we kept believing, really lost for words. When we were coming to Australia, I said to my captain (Ervine), If you become Man of the Match, pick any watch from the catalogue and I'll buy you that. But if I win Man of the Match (award), you're going to buy me one. I was reminding him that he owes me three watches now,\" says an emotional Sikandar Raza who was adjudged Player of the match20:10 (IST)Pakistan needed three on the final three balls. Evans first bowled a dot, then scalped Nawaz's wicket bringing equation down to 3 off 1. Shaheen hit one towards the mid on area, ran the first one hard but couldn't complete the second and was run out at the batting end. WHAT A WIN this is!20:05 (IST)Pakistan vs Zimbabwe LIVE SCORE That was a bit of a fumble but the wicket-keeper has dislodged the bails in time and that's another upset in the tournament. ZIMBABWE HAVE DEFEATED PAKISTAN by 1 run20:03 (IST)Pakistan vs Zimbabwe LIVE SCORE Nawaz has been caught. What a timely wicket that is. Pakistan need 3 from the final ball. Wasim won't be on strike either19:55 (IST)Pakistan vs Zimbabwe LIVE SCORE Nawaz has hammered that full toss for a maximum over deep fine leg. What a shot and what a timing on that19:47 (IST)Crucial wicket for Zimbabwe as Shan Masood departs!The match is going down to the wire 👀#T20WorldCup | #PAKvZIM | 📝: https://t.co/6tQg6o0EVy pic.twitter.com/YLG0hp3NGv— T20 World Cup (@T20WorldCup) October 27, 202219:40 (IST)Pakistan vs Zimbabwe LIVE Zimbabwe had a massive wicket in that over as Shan Masood was undone by Raza. Pakistan are in some trouble now19:25 (IST)Pakistan vs Zimbabwe  Not this time. Shadab once again takes the aerial route but miscues it this time and is caught at long off for 17 off 1419:24 (IST)Pakistan vs Zimbabwe LIVE A much-needed maximum for Pakistan. For a moment, it felt as if it will go into long-on's hands but NO! That has sailed over the fielder's head19:16 (IST)At the half-way mark, 🇵🇰 are 54-3(Masood 24*, Khan 4*), need 77 runs in 60 balls📸 ICC/Getty #PAKvZIM | #T20WorldCup pic.twitter.com/l3qDKfjOdM— Zimbabwe Cricket (@ZimCricketv) October 27, 202218:59 (IST)Pakistan vs Zimbabwe LIVE Back of the length from Jongwe, going down the leg and Iftikhar feathers that to the wicket-keeper behind. He has been caught for 5 off 1018:58 (IST)Powerplay done! 🇵🇰 are 28-2(Ahmed 4*, Masood 3*), need 103 runs in 84 balls.📸 ICC/Getty #PAKvZIM | #T20WorldCup pic.twitter.com/c5rVq8TfF0— Zimbabwe Cricket (@ZimCricketv) October 27, 202218:44 (IST)Pakistan vs Zimbabwe LIVE Rizwan has played one on to his stumps. That's a huge wicket. Pakistan have lost both Babar Azam and Rizwan18:37 (IST)Pakistan vs Zimbabwe That's a massive wicket. Babar Azam is gone for 4 off 9. Evnas bowls that touch fuller, on to the stumps as Babar tries to negate that to the on side but closes the face of the bat early. The ball takes the leading edge and he is caught by Burl at point18:31 (IST)Pakistan vs Zimbabwe Rizwan and Babar Azam have started the proceedings for Pakistan. They need to chase 131 to get two points. Zimbabwe pacers would seek early wickets18:09 (IST)After winning the toss, Zimbabwe were off to a flying start before Pakistan got wickets at regular intervals restricted them to 130/8 in 20 overs18:03 (IST)After 19 overs,Zimbabwe 120/7 ( Ryan Burl 9 , Brad Evans 13)PAK vs ZIM LIVE  Another dropped catch from Pakistan but Haris Rauf will still finish with figures of 1/12 in 4 overs17:54 (IST)Your reaction to @babarazam258's stunning catch❓ 👇#WeHaveWeWill | #T20WorldCup | #PAKvZIM pic.twitter.com/LuXDZLNeWO— Pakistan Cricket (@TheRealPCB) October 27, 202217:43 (IST)PAK vs ZIM LIVE  Zimbabwe have lost four wickets in 6 deliveries. Two in the last over and now Wasim sends Raza and Jongwe back in the hut on the trot. Raza was caught in the deep by Haris Rauf for 9 off 16 and Jongwe has chopped one on to his stumps. They are seven down now17:41 (IST)After 14 overs,Zimbabwe 95/5 ( Sikandar Raza 9 , Ryan Burl 0)PAK vs ZIM LIVE SCORE Shadab Khan gets two in two at the end of his fourth over. He first cleaned up Williams who went for the reverse sweep and missed the ball and completely and then dismissed Chakabva for a first-ball zero, courtesy a stunner from Babar Azam at first slip who grabbed a one-handed catch17:33 (IST)After 13 overs,Zimbabwe 87/3 ( Sean Williams 24 , Sikandar Raza 8)PAK vs ZIM LIVE SCORE Zimbabwe get a couple of boundaries in that over and they have now started to push the paddle. Rightly so, they need to score runs aggressively to put up a good total 17:31 (IST)1️⃣0️⃣ overs done! 🎯Zimbabwe are 67-3 with Haris, Wasim and Shadab picking up a wicket each 🏏#WeHaveWeWill | #T20WorldCup | #PAKvZIM pic.twitter.com/7Ifso020Rl— Pakistan Cricket (@TheRealPCB) October 27, 202217:23 (IST)PAK vs ZIM LIVE Shadab Khan got a breakthrough after he caught Milton Shumba off his bowling, diving to his right. This has been a good comeback from Pakistan after that kind of a start from Zimbabwe17:13 (IST)ZIM vs PAK LIVE Another back of the length delivery from Shaheen Afridi and Milton Shumba pulls it over mid on for a boundary17:09 (IST)End of the Powerplay! 🇿🇼 are 47-2(Williams 4*, Shumba 0*)📸 ICC/Getty #PAKvZIM | #T20WorldCup pic.twitter.com/TwGr7Mr5H1— Zimbabwe Cricket (@ZimCricketv) October 27, 202216:57 (IST)After 5 overs,Zimbabwe 42/1 ( Wesley Madhevere 17 , )PAK vs ZIM LIVE  Pakistan and Haris Rauf finally have the breakthrough. The extra bounce has done the trick. Rauf bangs that one short and it hurries on to Ervine who goes for the pull. But the ball takes the top edge and goes behind. Mohammad Wasim Jr stationed at short fine leg takes a good catch16:46 (IST)PAK vs ZIM LIVE SCORE Another boundary. Wasim bowls that short, offers width on it and Madhevere throws his bat on it to get a boundary around deep point region. What a start from the Zimbabwe openers16:42 (IST)After 2 overs, 🇿🇼 are 23 without loss( Ervine 12*, Madhevere 11*)📸 ICC/Getty #PAKvZIM | #T20WorldCup pic.twitter.com/GKb1KjNPtj— Zimbabwe Cricket (@ZimCricketv) October 27, 202216:42 (IST)Zimbabwe won the toss and chose to bat first against Pakistan in Perth 🏏#PAKvZIM | 📝: https://t.co/6tQg6oigk8 pic.twitter.com/QkFfUxgEzb— T20 World Cup (@T20WorldCup) October 27, 202216:35 (IST)PAK vs ZIM LIVE A couple of fours in a row for Wesley Madhevere. He first pushes one straight down the ground and now drives one through the off side for a four16:32 (IST)This is an important game for Pakistan. They need to get off the mark in the T20 World Cup to not make things tricky for themselves later on. Moreover, Babar Azam and Rizwan didn't have a good time in the middle against India and they would also look to get backn into the groove. Well, that would be later as Zimbabwe have opted to bat first and have started the proceedings16:12 (IST)PAK vs ZIM LIVE Playing XI  Pakistan: Mohammad Rizwan(w), Babar Azam(c), Shan Masood, Iftikhar Ahmed, Shadab Khan, Haider Ali, Mohammad Nawaz, Shaheen Afridi, Haris Rauf, Mohammad Wasim Jr, Naseem Shah16:11 (IST)PAK vs ZIM LIVE Playing XI  Zimbabwe: Regis Chakabva(w), Craig Ervine(c), Sean Williams, Sikandar Raza, Wesley Madhevere, Milton Shumba, Brad Evans, Ryan Burl, Luke Jongwe, Blessing Muzarabani, Richard Ngarava16:09 (IST)Zimbabwe have won the toss and opted to bat first against Pakistan15:23 (IST)Hello and welcome to our live coverage of the T20 World Cup Super 12 fixture between Pakistan and Zimbabwe at the Perth Stadium on Thursday, with former champions Pakistan eyeing the first win of their campaign after losing to India on Sunday.Preview: Pakistan will hope to bounce back from their narrow defeat to India in their opening game in Melbourne when they take on Zimbabwe in their second outing of the T20 World Cup in Perth on Thursday.T20 World Cup: Full coverage | Schedule | Results | Points Table | News | PhotosPakistan had recovered from a shaky start after being invited to bat by India and managed to post a competitive 159 on the board thanks to fifties from Shan Masood and Iftikhar Ahmed, before their pace attack ran through the Indian top-order yet again, reducing them to 31/4 in the chase.The Men in Green were clear favourites to collect a second T20 World Cup win against their arch-rivals, only to be undone by Virat Kohli’s brilliance as the star Indian batter produced an unbeaten 82, forging a 113-run fifth-wicket stand with Hardik Pandya and in the end, guiding his team over the line.Skipper Babar Azam and wicketkeeper-batter Mohammad Rizwan, Pakistan’s white-ball opening pair, will hope to bounce back to form against the Zimbabweans after getting dismissed cheaply by Arshdeep Singh on Sunday.As for the bowling department, Shaheen Shah Afridi’s figures of 0/34 against India prompted discussions on whether he was rushed back into the squad and whether he is bowling at a hundred per cent at the moment, and the team think-tank might just consider resting him and bringing someone like a Mohammad Wasim Jr or a Mohammad Hasnain into the XI.Zimbabwe progressed from the First Round of the ongoing competition with victories over Ireland and Scotland, their only defeat coming against the already-eliminated West Indies. The Craig Ervine-led side then started off on a shaky note against neighbours South Africa in their opening Super 12 game, the Proteas racing to 51/0 in three overs chasing 64 in a curtailed game before a heavy shower forced the game to be called off and the points to be split evenly.Squads:Pakistan: Mohammad Rizwan(w), Babar Azam(c), Shan Masood, Iftikhar Ahmed, Shadab Khan, Haider Ali, Mohammad Nawaz, Asif Ali, Shaheen Afridi, Haris Rauf, Naseem Shah, Khushdil Shah, Fakhar Zaman, Mohammad Hasnain, Mohammad Wasim Jr.Zimbabwe: Regis Chakabva(w), Craig Ervine(c), Sean Williams, Sikandar Raza, Wesley Madhevere, Milton Shumba, Ryan Burl, Luke Jongwe, Tendai Chatara, Blessing Muzarabani, Tony Munyonga, Wellington Masakadza, Brad Evans, Clive Madande, Richard Ngarava.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-27 14:45:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/PAK-ZIM.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ZIM, T20 World Cup 2022: Zimbabwe stun Pakistan, defeat them by 1 run","link":"https://www.indiatvnews.com/sports/cricket/pak-vs-zim-t20-world-cup-2022-zimbabwe-stun-pakistan-defeat-them-by-1-run-2022-10-27-819292","keywords":null,"creator":null,"video_url":null,"description":"PAK vs ZIM, T20 World Cup 2022: The World Cup of upsets, this is how it has panned out to be so far. The teams that were not even considered favorites have risen to the occasion and have surprised the big boys. Pakistan were still recovering from the treatment that India dished out to them on October 24, 2022, at the Melbourne Cricket Ground (MCG), but this is something that will play on their minds for a very long time now.","content":null,"pubDate":"2022-10-27 14:39:07","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Zimbabwe T20 World Cup: From 95-3 to 95-7, Pak bowlers trigger batting collapse","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-zimbabwe-t20-world-cup-from-95-3-to-95-7-pak-bowlers-trigger-batting-collapse-11524011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Zimbabwe T20 World Cup: From 95-3 to 95-7, Pak bowlers trigger batting collapse","content":"During entertaining Pakistan vs Zimbabwe Group 2 clash of the Super 12 stages at the T20 World Cup, Pak bowlers Shadab Khan and Mohammad Wasim combined to take four wickets in space of six deliveries without giving a single run.T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | PhotosThe string of dismissals turned the game upside down in a space of five minutes as Zimbabwe looked in control of their innings at 95/3 at the stage of 13.4 overs. Before the collapse, Sean Williams and in-form Sikandar Raza were scoring at a brisk pace for Zimbabwe and a 150-up total looked a possibility.The beginning of the 14th over by Shadab couldn’t have any better for the African side as Williams shot him for the boundary and then took three runs off the next delivery but things were soon to change as we bring you the highlight below:13.5 OUT Shadab clean bowled Williams (31) as the right-hander missed the line while attempting a reverse sweep. It was a straighter one from the spinner that rattled the stumps. 95/4 View this post on Instagram A post shared by ICC (@icc)13.6 OUT Regis Chakabva was out of the first delivery as Babar Azam took a fantastic catch at first slip and was certainly a contender for the catch of the tournament as he took a one-handed blinder. Chakabva was trying to be cautious of his first delivery as he went for the defence but the leg break took an outside edge for Azam to grab. 95/5 View this post on Instagram A post shared by ICC (@icc)14.1 and 14.2 NO RUNS Mohammad Wasim pace allowed no room to Raza to work as he struggled to touch the ball. 95/5 14.3 OUT Wasim bowled it short and Raza’a pull shot off it went straight to Haris Rauf standing a square leg for a comfortable catch. 95/614.5 OUT Wasim banged it in short and newly-in Luke Jongwe was left confused by the pace and bounce and ended up playing himself down while looking to guide the ball towards the third man. View this post on Instagram A post shared by ICC (@icc)Zimbabwe ultimately managed a 130/8 in 20 overs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-27 14:30:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Pakistan-vs-Zimbabwe.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: ‘Good things come in pairs’, Fans obsess over Kohli-SKY bromance as India defeat Netherlands","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-good-things-come-in-pairs-fans-obsess-over-kohli-sky-bromance-as-india-defeat-netherlands-11524191.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"T20 World Cup: ‘Good things come in pairs’, Fans obsess over Kohli-SKY bromance as India defeat Netherlands","content":"Team India continued its winning streak in the ICC Men’s T20 World Cup. The Men in Blue defeated Netherlands in their second Super 12 stage match of the tournament by 56 runs.T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | PhotosVirat Kohli, Suryakumar and skipper Rohit Sharma struck half-centuries as the Men in Blue posted a challenging 179/2 in 20 overs. It was followed by a solid bowling display that restricted Netherlands to 123/9 in 20 overs. With the triumph, India sit at top of the Group 2 table with 4 points.Indian fans were all praise for the Men in Blue, but special mentions were reserved for Kohli and Suryakumar and their partnership. Indian Premier League (IPL) team Punjab Kings said for all of us when they said, “Good things come in pairs.” The Punjab franchise wrote, “2 points, 2 wins, too many reasons to be happy.”✌️ points ✅ ✌️ wins ✅ Too many reasons to be happy! 😄#INDvNED #T20WorldCup #ViratKohli #SuryakumarYadav pic.twitter.com/4XYJjcWLx9— Punjab Kings (@PunjabKingsIPL) October 27, 2022The bromance is real ❤️💯#India #netherlands #indvsned #t20worldcup pic.twitter.com/x2lyckgSB4— Sportskeeda (@Sportskeeda) October 27, 2022What a scene 👏❤️ #INDvsND pic.twitter.com/Ru1sux72xc— Pranoy Das (@pranoy_das0) October 27, 2022 Fans are clearly not tired of Suryakumar and Virat Kohli’s bromance. One of them said, “SKY (Suryakumar)- VK (Virat Kohli): A love story we never imagined but always needed.”SKY-VK: A love story we never imagined but always needed !!#T20WC2022 #INDvsND #ViratKohli #SKY @T20WorldCup— Dhaval (@Dhavalistic) October 27, 2022 One of the Indian cricket fans went on to predict that India will play the finals, and probably win the tournament. “My prediction? India will play in the final. (And probably win!),” the tweet read.My prediction? India will play in the final. (And probably win!)— @LionoftheSavannah (@Lion_For_Truth) October 27, 2022 While Rohit scored 53 runs, Kohli and Yadav remained unbeaten on 62 and 51 respectively. The Player of the Match award was bagged by Suryakumar for his impressive innings. The batter brought up his half century in just 25 balls and a strike rate of 204, courtesy seven 4s and one 6.The Indian bowlers had also put up an all-round performance. Bhuvneshwar Kumar, Axar Patel, Arshdeep Singh and Ravichandran Ashwin picked two wickets each. Mohammad Shami scalped one wicket.Moving forward, in their third match of the World Cup tournament, India will take on South Africa on 30 October in Perth.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-27 14:14:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Virat-Kohli-Suryakumar-Yadav-India-Netherlands-T20-World-Cup-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli inspires India again; Zimbabwe ‘stun’ Pakistan","link":"https://www.arabtimesonline.com/news/kohli-inspires-india-again-zimbabwe-stun-pakistan/","keywords":["Sports","T20"],"creator":["Arab Times"],"video_url":null,"description":"SA crush Bangladesh by 104 runs India’s Virat Kohli bats during the T20 World Cup cricket match between India and the Netherlands in Sydney, Australia. (AP) SYDNEY, Oct 27, (AP): Virat Kohli scored his second straight half-century as India beat the Netherlands by 56 runs, and Zimbabwe held their nerve for a 1-run victory over … The post Kohli inspires India again; Zimbabwe ‘stun’ Pakistan appeared first on ARAB TIMES - KUWAIT NEWS.","content":"SA crush Bangladesh by 104 runs India’s Virat Kohli bats during the T20 World Cup cricket match between India and the Netherlands in Sydney, Australia. (AP) SYDNEY, Oct 27, (AP): Virat Kohli scored his second straight half-century as India beat the Netherlands by 56 runs, and Zimbabwe held their nerve for a 1-run victory over Pakistan in the latest upset at the Twenty20 World Cup. Three games in Group 2 took place Thursday with South Africa crushing Bangladesh by 104 runs. Rilee Rossouw posted the first century of the tournament. Kohli scored 62 not out off 44 balls as India kept their perfect record to top Group 2 with four points, one more than South Africa. Third-place Zimbabwe, whose opening group game was abandoned against South Africa, have three points, one more than Bangladesh. Pakistan are in trouble with zero points. It was Pakistan’s second successive defeat after a nerve-wracking loss against arch-rivals India. Ireland enjoyed a stunning upset in the Super 12s by beating England in a rain-hit game in Group 1 on Wednesday. Kohli guided his team to 179-2 after India chose to bat first. India captain Rohit Sharma scored 53 while Suryakumar Yadav hit 51 not out off 25 balls and shared an important partnership with Kohli which accelerated the innings. In reply, the Netherlands couldn’t last against a quality Indian attack and finished at 123-9. Earlier, Lokesh Rahul (9) fell cheaply for the second game running. Kohli and Sharma then put on 73 runs off 56 balls for the second wicket. Sharma hit four fours and three sixes, bringing up his half-century off 35 balls. He was caught in the 12th over. India were at 84-2 and still only scoring at seven per over. Kohli and Yadav then put on 95 runs off 48 balls. Yadav hit seven fours and a six, the latter bringing up his halfcentury off the last ball of the Indian innings. Kohli’s half-century had come off 37 balls, including three fours and two sixes. India’s final acceleration put the game beyond their opponents’ reach. Indian spinners strangled the Netherlands’ chase. Axar Patel recovered from a mauling against Pakistan and took 2-18 in four overs. It was in that game that Kohli scored a match-winning 82 not out off 53 balls. Ravichandran Ashwin had 2-21 against the Netherlands. He dismissed Colin Ackermann (17) and Tom Cooper (9) in the same over. Tim Pringle was the top Dutch scorer with 20 off 15 but the result was never in doubt against an impressive display by the Indian bowlers. Bhuvneshwar Kumar had economical figures of 2-9 in three overs. Arshdeep Singh took 2-37 while Mohammed Shami finished with 1-27. Pakistan’s brittle middle-order batters were restricted at 129-8 in a thrilling game at Perth after Zimbabwe chose to bat first and struggled against pace on a bouncy wicket to make 130-8. It just proved enough for Zimbabwe, helped by 14 extras. Unorthodox spinner Sikandar Raza bagged 3-25 and brought Zimbabwe back in the hunt in the 14th over with the wickets of Shadab Khan and Haider Ali off successive deliveries. Raza then dealt a major blow by having top-scorer Shan Masood (44) stumped off a wide ball down the leg side in the next over. Mohammad Nawaz, who made 22, brought the target down to 11 off the last over and Mohammad Wasim narrowed it to three off the last three deliveries before Brad Evans had Nawaz caught at long off and then Shaheen Afridi was run out off the final ball with Pakistan falling short of the target. Earlier, Pakistan’s tactics of going with four fast bowlers worked out well with Wasim picking up 4-24 and Shadab bowling a tidy spell of 3-23 in the middle overs. Zimbabwe got off to a flying start of 42 in five overs before slipping to 95-7, losing four wickets for no runs. Sean Williams top-scored with 31 before Shadab ignited the collapse by clean bowling Williams and Babar Azam grabbed a superb one-handed catch offered by Regis Chakabva over his head in the lone slip. Rossouw plundered 109 from 56 deliveries for South Africa against Bangladesh. After brief concerns about rain, South Africa batted first and posted 205-5. Rossouw and Quinton de Kock put on 163 runs off 81 balls for the second wicket for the highest South African partnership ever at the tournament. De Kock scored 50 off 33 balls and was eventually out for 63 off 38 balls, including seven fours and three sixes. The Proteas then skittled Bangladesh for 101 with Anrich Nortje picking up four wickets. The post Kohli inspires India again; Zimbabwe ‘stun’ Pakistan appeared first on ARAB TIMES - KUWAIT NEWS.","pubDate":"2022-10-27 14:00:00","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"Taapsee, Anushka Praise BCCI's Decision Of Equal Match Fee For Men, Women","link":"https://sports.ndtv.com/cricket/taapsee-pannu-anushka-sharma-laud-bccis-decision-of-equal-match-fee-for-men-and-women-3467138","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Taapsee, who played former Indian captain Mithali Raj in the 2022 film \"Shaabash Mithu\", expressed her gratitude towards the Board of Control for Cricket in India (BCCI).","content":"Bollywood stars Taapsee Pannu and Anushka Sharma on Thursday welcomed the BCCI's landmark decision of equal match fee for its centrally-contracted female and male players in a bid to promote gender equality in cricket. As per the newly introduced system, the Indian women cricketers will now receive Rs 15 lakh per Test, Rs 6 lakh per ODI, and Rs 3 lakh per T20I, the same as their male counterparts. Earlier, the women players received Rs 1 lakh each for ODIs and T20Is while the match fee for a Test match was Rs 4 lakh. Taapsee, who played former Indian captain Mithali Raj in the 2022 film \"Shaabash Mithu\", expressed her gratitude towards the Board of Control for Cricket in India (BCCI). \"A huge step towards equal pay for equal work. Thank you BCCI for leading with example,\" the actor wrote on Twitter. A huge step towards equal pay for equal work. Thank you BCCI for leading with example Taking to Instagram Stories, Anushka shared the screenshot of BCCI secretary Jay Shah's tweet and reacted to the post with three clapping emojis. The actor is set to play former pacer Jhulan Goswami in the upcoming film \"Chakda Xpress\". Filmmaker Onir shared a link of a news report about the announcement on Twitter and urged the India film fraternity to follow suit. \"Fantastic.... Now hope the Indian film Industry takes a cue and learns (sic),\" he wrote. Recently, the Indian women's cricket team triumphed in the Asia Cup in Bangladesh, beating Sri Lanka by eight wickets. The team also won the country's first-ever silver medal in cricket at the Commonwealth Games in Birmingham earlier this year. In the last Annual General Meeting (AGM) of the BCCI, the cricket board also announced the first-ever women's IPL that is scheduled to take place next year. Promoted Earlier this year, New Zealand Cricket (NZC) had struck a deal with the country's players' association, which enabled the women cricketers to earn as much as the male players, while Cricket Australia (CA) is also working to do away with gender disparity. India thus became only the second country in international cricket to implement equal pay.","pubDate":"2022-10-27 13:57:31","image_url":"https://c.ndtvimg.com/2022-08/uohdn22_taapsee-pannu_625x300_11_August_22.jpeg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian skipper Harmanpreet Kaur reacts on equity pay policy; other cricketers join in","link":"https://www.indiatvnews.com/sports/cricket/indian-skipper-harmanpreet-kaur-reacts-on-equity-pay-policy-other-cricketers-join-in-sachin-tendulkar-vvs-laxman-smriti-mandhana-2022-10-27-819285","keywords":null,"creator":null,"video_url":null,"description":"In a landmark decision on Thursday, BCCI's Secretary Jay Shah announced that the Indian men and women players will get equal match fees. The announcement has come as a big move in women's cricket and many cricket stars are reacting to the historic decision. Indian skipper Harmanpreet Kaur was among the ones to share their thoughts on this decision. ","content":null,"pubDate":"2022-10-27 13:48:07","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}