{"newsArray":[{"title":"Smriti bats away Oz challenge","link":"https://www.tribuneindia.com/news/sports/smriti-bats-away-oz-challenge-414850","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru, July 22The Indian women's cricket team's nemesis Australia await them in their first match at the Birmingham Commonwealth Games, but senior batter Smriti Mandhana is unfazed.Days before women's cricket makes its debut at the multi-sport event, Mandhana refused to call the five-time T20I world champions a 'big team'.The Harmanpreet Kaur-led Indians will open their campaign against Australia on July 29, and Mandhana said they have drawn out their plans for each opposition.\"We have played them (Australia) in the openers in quite a lot of tournaments. In a T20I tournament, any team can beat any team. I wouldn't term Australia as a big team and make them feel good about that. Definitely in our heads, Australia, Pakistan and Barbados matches are important. We will go as they come and will look to win all of them,\" Mandhana said.For the record, India lost to Australia in their last T20I World Cup game earlier this year. But the recent T20I and ODI series victories in Sri Lanka should give India a boost going into the Birmingham event. \"Our preparations have been really good and I hope it will lead us to the medal,\" Mandhana said.","content":null,"pubDate":"2022-07-23 00:37:55","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_1049108681.JPEG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sam Curran's small steps prove a giant leap as England seek to fill the Ben Stokes void - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2VuZy12cy1zYS0ybmQtb2RpLXNhbS1jdXJyYW4tcy1zbWFsbC1zdGVwcy1wcm92ZS1hLWdpYW50LWxlYXAtYXMtZW5nbGFuZC1zZWVrLXRvLWZpbGwtdGhlLWJlbi1zdG9rZXMtdm9pZC0xMzI1ODc20gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sam Curran's small steps prove a giant leap as England seek to fill the Ben Stokes void  ESPNcricinfo'I'll be going ALL OUT for as long as I can' | Jonny Bairstow speaks to Michael Atherton  Sky Sports CricketODI cricket 'dying' says Aussie opener  Western AdvocatePhil Salt eager to fill void left by Ben Stokes in England ODI batting lineup  The GuardianSalt to get first chance to replace Stokes  The StandardView Full coverage on Google News","content":null,"pubDate":"2022-07-22 23:27:21","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"England romp to 118-run win over South Africa in second ODI for first victory of the post-Ben Stokes era","link":"https://www.thesun.co.uk/sport/football/19291553/england-south-africa-odi-stokes/","keywords":["Football","Cricket"],"creator":["John Etheridge"],"video_url":null,"description":"ENGLAND’S collection of left-armers combined to hammer South Africa in the first match of the post-Ben Stokes era. Reece Topley took two wickets and David Willey and Sam Curran one each as the Proteas were crushed by 118 runs at Old Trafford. It levelled the 50-over series at 1-1 ahead of the decider at Headingley […]","content":"ENGLAND’S collection of left-armers combined to hammer South Africa in the first match of the post-Ben Stokes era. Reece Topley took two wickets and David Willey and Sam Curran one each as the Proteas were crushed by 118 runs at Old Trafford. ReutersAdil Rashid led the way with three wickets[/caption] PASouth Africa batsman Heinrich Klaasen wound up the England team with his time-wasting tactics[/caption] England picked up their first win since Ben Stokes’ retirementGetty It levelled the 50-over series at 1-1 ahead of the decider at Headingley on Sunday. As England still get to grips with Stokes’ decision to quit one-day internationals, this performance will increase the belief that they can manage without him. Incredibly, the Proteas lost their first four wickets with the total on just six and, after that, they never had any realistic chance of surpassing England’s 201 all out. England’s players became fired up, too, when South African batsman Heinrich Klaasen tried to use delaying tactics as drizzle began to fall. READ MORE IN SPORT LIVING THE DREAM Dream Team's BACK! All you need to know before you go for £100k prize pot LONDON CALLING London making plans to host Olympics for record 4th time after 2012 success Klaasen hoped the rain would become heavier before England had bowled the minimum 20-over requirement. If play was called off before then, it would have been a no result. England skipper Jos Buttler made his feelings known but, with spinners Moeen Ali and Adil Rashid operating in tandem, the overs were bowled in time. Klaasen admitted: “It was old-school tricks to see if I could slow down the game a bit. The English boys didn’t like it. Most read in Football WAT A DUD I've never shared a worse dressing room - Watford star lifts lid on horror season GAYLE FORCE Stoke sign Newcastle striker Dwight Gayle to two-year deal on free transfer HOMECOMING Suarez set for return to first club Nacional as fans celebrate with face masks JACK ATTACK Watch moment Grealish clashes with keeper in friendly as Man City star is booed ALL IN Halifax's Jamie Allen quits pre-season for Love Island DAYS after signing new deal MADD MOVE Leicester 'to be forced into transfer exits with fears Maddison could go' “We weren’t in a great position, so I tried to upset the rhythm or change the momentum. But it didn’t come off. “The words from the opposition didn’t bother me at all, it’s all fun and games on the field. “Hopefully, we can have a beer after the game. I have no problems with anything they say as long as it’s only on the field.” Willey said: “It was frustrating, to be polite. It was clear what he was trying to do with the rain falling — he hoped the rain would get worse and we would be off.” Topley has emerged as England’s main wicket-taking bowler in white-ball cricket in recent weeks and he struck twice in his second over. Opener Janneman Malan chipped a catch to mid-on and then Rassie van der Dussan, who scored a century in South Africa’s victory at Chester-le-Street on Tuesday, tickled a catch behind down the legside. The dangerous Quinton de Kock drove Willey to cover and then Aiden Markram was brilliantly run out by Buttler’s backhanded flick at the stumps. Markram had not even faced a ball. Next, Curran struck when he nipped a ball through left-hander David Miller’s defences and on to the stumps. Curran is perhaps the closest England have to another Stokes — an aggressive left-handed batsman and a fast-medium swing bowler. And the Surrey man contributed usefully with the bat. He struck three straight sixes in an innings of 35, one of which was a massive blow that finished in the Old Trafford press box three floors up. The match finally started at 4.45pm because of rain — almost four hours late — but England lost wickets regularly. Their batting has flourished only occasionally in this batch of white-ball matches and they were in trouble again at 101-6. Liam Livingstone, who top-scored with 38, exploded with three legside sixes from the first three balls of an over from Anrich Nortje. Then he edged a four but, attempting another big hit, the Lancashire ace was caught at mid-wicket.","pubDate":"2022-07-22 22:20:24","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND vs WI 1st ODI Man of the Match: Who won Man of the Match India vs West Indies ODI Port of Spain?","link":"https://thesportsrush.com/cricket-news-ind-vs-wi-1st-odi-man-of-the-match-who-won-man-of-the-match-india-vs-west-indies-odi-port-of-spain/","keywords":["Cricket","India","India tour of West Indies 2022","Shikhar Dhawan","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs WI 1st ODI Man of the Match: The Indian captain was adjudged the Player of the Match at the Queen’s Park Oval on Friday. During the first ODI of India’s tour of West Indies 2022 in Port of Spain, India beat West Indies by 3 runs in a thrilling contest to lead this… The post IND vs WI 1st ODI Man of the Match: Who won Man of the Match India vs West Indies ODI Port of Spain? appeared first on The SportsRush.","content":"IND vs WI 1st ODI Man of the Match: The Indian captain was adjudged the Player of the Match at the Queen’s Park Oval on Friday. During the first ODI of India’s tour of West Indies 2022 in Port of Spain, India beat West Indies by 3 runs in a thrilling contest to lead this three-match series 1-0. Chasing a 309-run target, West Indies never looked out of competition from sealing their third-highest run-chase in this format. A 117-run second-wicket partnership between all-rounder Kyle Mayers (75) and batter Shamarh Brooks (46) laid the foundation for their second biggest ODI run-chase at home. While Brandon King (54) held one end when the hosts were losing wickets at regular intervals, the onus eventually fell on Akeal Hosein (32*) and Romario Shepherd (38*) to score 54 runs in the last five overs in order to win the match. Needing five runs to win off the last ball, Shepherd failed to make contact with a Mohammed Siraj yorker as West Indies ended up losing their sixth consecutive ODI against India. ODI Cricket well and truly alive💙 That last over from Siraj and that boundary save from Sanju 🙌 #WIvIND pic.twitter.com/Zgp7xpCNht — Doordarshan Sports (@ddsportschannel) July 22, 2022 Having bowled three out of the last five overs, Siraj kept his calm while bowling the death overs. For India, Shardul Thakur, Siraj and Yuzvendra Chahal picked a couple of wickets each tonight. Put in to bat first by Nicholas Pooran (25), India put on board 308/7 in 50 overs on the back of individual half-centuries by top-order batters namely Shikhar Dhawan (97), Shubman Gill (64) and Shreyas Iyer (54). His third 90+ score since his last international century denied Dhawan of an 18th ODI century but him hitting 10 fours and three sixes at a strike rate of 97.97 in an assured innings earned him a Player of the Match award. Dhawan, 36, registered his 36th ODI half-century, 18th away from home, sixth against West Indies, fifth in West Indies, third in 2022 and second as captain to win 11th ODI match award. “It was disappointing but grateful for 97. I enjoyed it. It was difficult as it was holding a bit and turned. When Shubman [Gill], Shreyas [Iyer] and I were batting, we wanted to go big and make it easy for the youngsters,” Dhawan told ESPN Caribbean during the post-match presentation ceremony.","pubDate":"2022-07-22 22:19:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shikhar Dhawan, Mohammed Siraj help India beat West Indies by 3 runs in thriller in 1st ODI - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMiggFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L3dlc3QtaW5kaWVzLXZzLWluZGlhLTFzdC1vZGktMy1ydW4td2luLXNjb3JlLWRoYXdhbi1zaXJhai1jaGFoYWwtMTk3ODk1MS0yMDIyLTA3LTIz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shikhar Dhawan, Mohammed Siraj help India beat West Indies by 3 runs in thriller in 1st ODI  India TodayIndia vs West Indies 1st ODI HIGHLIGHTS: India win by 3 runs  FirstpostLIVE India vs West Indies 1st ODI 2022, Cricket Score: Men in Blue on Top; Windies Reeling  India.comIndia beat West Indies by 3 runs in first ODI  WIONWI v India 1st ODI: Dhawan stars as India hold nerves to claim narrow win  Cricket WorldView Full coverage on Google News","content":null,"pubDate":"2022-07-22 21:56:45","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"David Willey claims ‘Mother Cricket’ scuppered South Africa time-wasting ploy","link":"https://uk.sports.yahoo.com/news/david-willey-claims-mother-cricket-211941978.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-22 21:19:41","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket DLS Calculator: What does DLS mean in Cricket?","link":"https://thesportsrush.com/cricket-news-cricket-dls-calculator-what-does-dls-mean-in-cricket/","keywords":["Cricket","DLS method"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Cricket DLS Calculator: The method is used to arrive at match results during One-Day international and T20 International matches. During the ongoing second ODI of South Africa’s all-format tour of England at the Emirates Old Trafford in Manchester, a clinical bowling performance from England helped them defeat the Proteas by 118 runs, in a match… The post Cricket DLS Calculator: What does DLS mean in Cricket? appeared first on The SportsRush.","content":"Cricket DLS Calculator: The method is used to arrive at match results during One-Day international and T20 International matches. During the ongoing second ODI of South Africa’s all-format tour of England at the Emirates Old Trafford in Manchester, a clinical bowling performance from England helped them defeat the Proteas by 118 runs, in a match that was reduced to 29 Overs-a-side due to heavy rain early on. The DLS score kept cropping up on the giant screen after every couple of Overs, and since South Africa lost wickets in cluster early on, they were way behind the DLS target, and would have lost the match even if further play would not have been possible due to a thunderstorm or a heavy spell of rain. On that note, let us look at what exactly the DLS method is, and why it is the generally accepted way or calculation for arriving at results in case the second innings of a match is interrupted by rain or any other unavoidable circumstance. The DLS or Duckworth Lewis Stern method is a mathematical formula when applied to a particular scorecard at a particular time, provides the chasing team a target to aim at within a certain number of Overs, in order to win that particular match. It is generally accepted to be the most accurate method of setting a target score. The method takes into consideration the two most most important aspects in the game – number of Overs and the number of wickets remaining. The target to be set, is arrived after proportional adjustment to the change in the combination of these two resources/aspects. If a team, for example in an ODI match scored 200/3 in 40 Overs, after which the match got reduced to 20 Overs for the opposition due to rain, simply adjusting the opposition target in proportion to the loss in Overs would be unfair, as the team batting first had approached the innings like a 50-Over match, and were looking to score big in the final ten Overs with the luxury of wickets in hand. Thus the chasing team would be handed a more than proportional target to achieve in 20 Overs in this case. A hat-trick of World Cup wins for Australia! #OnThisDay in 2007, Ricky Ponting’s side beat Sri Lanka in the CWC final by 53 runs on DLS method. This was Australia’s third straight CWC title and fourth overall 🙌 Player of the Match Adam Gilchrist smashed a 🔥 104-ball 149. pic.twitter.com/n6K6ABtQCm — ICC (@ICC) April 28, 2020 Target score, as in the above case, is the revised target handed to the chasing team after a rain delay in the match which has resulted in the loss of Overs. Par target refers to the one which the chasing team is supposed to keep achieving after the end of each over. A wicket at any point in the chase increases the par target. The target is one fixed number, while the par score changes according to the number of wickets lost. If a team is above the par target during a point in the chase, and no further play is possible from that point in the game, the chasing team is declared the match winner, and vice-versa.","pubDate":"2022-07-22 21:05:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Usman Khawaja voices his opinion on irrelevance of ODI cricket; says it's dying slow death","link":"https://www.indiatvnews.com/sports/cricket/usman-khawaja-voices-his-opinion-on-irrelevance-of-odi-cricket-says-it-s-dying-slow-death-2022-07-23-794211","keywords":null,"creator":null,"video_url":null,"description":"Usman Khawaja believes ODI cricket is dying a slow death due to a packed international schedule and the rise of T20 leagues around the world.","content":"believes ODI cricket is dying a slow death due to a packed international schedule and the rise of T20 leagues around the world. Khawaja is the latest cricketer to join the debate over the existence of 50-over cricket after England superstar Ben Stokes on Monday stunned the cricketing world by announcing his sudden retirement from ODI cricket at the age of 31. Calling playing three formats as \"unsustainable\" for him, Stokes, who is also England's Test captain, said cricketers \"are not like cars\" and there is \"too much cricket rammed in\". \"I think personally one-day cricket is dying a slow death,\" Khawaja, who has represented Australia in 40 ODIs since making his debut in the format in 2013, told reporters in Brisbane on Friday. \"There's still the World Cup, which I think is really fun and it's enjoyable to watch, but other than that, even myself personally, I'm probably not into one-day cricket as much either.\" Khawaja argued that the 50-over format has lost its relevance, of late, as the T20 World Cup is knocking on the doors. \"Right now it feels like it's not really that important because of the T20 World Cup,\" Khawaja said. \"Something has to give, because you can't have all three formats all together playing all the games; you're going to have to decide and choose.\" However, the 35-year-old was of the opinion that despite a choc-a-bloc international calendar, Test cricket will continue to remain the pinnacle of the sport. \"You've got Test cricket, which is the pinnacle, you've got T20 cricket which obviously has leagues around the world, great entertainment, everyone loves it, and then there's one-day cricket, and I feel like that’s probably the third-ranked out of all of them,\" he said. Khawaja feels while it is not impossible for any cricketer to be a three-format player, it is gradually becoming quite exhausting for all and sundry. \"Not impossible, very tough. So much travelling. If you're playing all three forms of the game, you're not at home at all really,\" he said. \"There's a lot of cricket going on. Yes, you get to pick and choose, I guess, in certain respects what you want to play but look it can be very tough at the moment.\" Pakistan pace bowling legend Wasim Akram had also voiced his concerns and wanted the administrators of the game to scrap the ODI format for good. Former England skipper Nasser Hussain had also slammed the crammed cricket calendar. With a lot of present and former cricketers voicing their opinions on the irrelevance of ODI cricket, it remains to be seen how the men in charge go about the format in the future.","pubDate":"2022-07-22 20:59:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa lowest score in ODI: South Africa lowest ODI score innings total","link":"https://thesportsrush.com/cricket-news-south-africa-lowest-score-in-odi-south-africa-lowest-odi-score-innings-total/","keywords":["Cricket","England","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"South Africa lowest score in ODI history: The South African cricket team couldn’t live up to its performance from the first ODI. During the second ODI of the ongoing South Africa’s tour of England in Manchester, South Africa succumbed to an English bowling attack to register their joint second-lowest innings total in this format. Chasing… The post South Africa lowest score in ODI: South Africa lowest ODI score innings total appeared first on The SportsRush.","content":"South Africa lowest score in ODI history: The South African cricket team couldn’t live up to its performance from the first ODI. During the second ODI of the ongoing South Africa’s tour of England in Manchester, South Africa succumbed to an English bowling attack to register their joint second-lowest innings total in this format. Chasing a 202-run target in a 29-over contest, South Africa got bundled out for 83 in 20.4 overs in a dismal batting response. Not living up to the potential after a 62-run victory in the first ODI in Chester-le-Street, the visitors losing this match has made things interesting with respect to a three-match ODI series. Needing to score at almost seven runs per over to gain an unassailable lead, South Africa were reduced to 6/4 in the fourth over. It was in his second over that England pacer Reece Topley dismissed Janneman Malan (0) and Rassie van der Dussen (0) to make early inroads into their lineup. While Malan chipped an ordinary delivery to mid-on, van der Dussen edged a leg-side delivery behind the wickets to England captain Jos Buttler. Wicket-keeper batter Quinton de Kock (5) hit a David Willey delivery straight to Liam Livingstone only to be followed by Buttler running out Aiden Markram (0) as the Proteas found themselves in deep trouble. Lack of a magical innings from their middle-order batters resulted in an 118-run English victory in a one-sided rain-affected contest. While the top-order struggled against the pacers, the remaining batters failed to cope up with the spin of Adil Rashid and Moeen Ali. Bowling figures of 6-1-29-3 made Rashid the pick of the English bowlers. Apart from the leg-spinner, Topley and Ali picked a couple of wickets apiece at Old Trafford on Friday. ENGLAND WIN!!! 🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvSA pic.twitter.com/r9EtKkaCiR — England’s Barmy Army (@TheBarmyArmy) July 22, 2022","pubDate":"2022-07-22 20:30:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Six women cricketers still to receive their visas; Flight in less than 48 hours","link":"https://www.indiatvnews.com/sports/other/cwg-2022-six-women-cricketers-still-to-receive-their-visas-flight-in-less-than-48-hours-indian-women-to-face-australian-women-in-first-game-2022-07-23-794210","keywords":null,"creator":null,"video_url":null,"description":"With Women's cricket set to debut at the Commonwealth Games, six members of the Indian women's squad are yet to receive their Visas. The Indian squad is currently training in Bengaluru and is scheduled to leave for Birmingham on Sunday.","content":"With Women's cricket set to debut at the Commonwealth Games, six members of the Indian women's squad are yet to receive their Visas. The Indian squad is currently training in Bengaluru and is scheduled to leave for Birmingham on Sunday. The BCCI is in touch with the Indian Olympic Association on the issue. \"Few of the visas came in today but they are still six left for processing including three players and three players' support staff,\" an IOA source told PTI. \"The remaining should come by tomorrow. We have very little control over the process anyway. There is a summer rush and UK visas are taking time.\" The kits have not reached Bengaluru as well but the IOA official assured us that it will be delivered by Saturday. The BCCI had announced a 15-member squad for the Games, beginning July 28. India open their campaign against mighty Australia on July 29 before facing Pakistan on July 31. Eight-member support staff was also named with three reserve players. India's Chef de Mission Rajesh Bhandari finally got his visa on Friday and he will soon be flying out to join his colleagues in Birmingham. The IOA has named three Deputy Chef de Mission for the Games. Anil Dhupar and Maninder Singh, who too had to wait for their visa till the last minute, took the flight on Friday morning. Deputy Chef de Mission Prashant Kushwaha is the one left waiting for his visa. \"His visa should also come soon,\" the IOA source added. Earlier this month, star wrestler Bajrang Punia also had to change his training plans for a training stint in the US as he stayed back in India to get his UK visa. He is now in the US and will travel straight to Birmingham from there. BCCI President Sourav Ganguly had on Thursday informed that one of the squad members has tested positive for COVID-19 and is in isolation. It has been learnt that the cricketer is \"recovering fast\". The Commonwealth Games are set to kick off on Thursday, July 28 and will go on till 8 August. The Women's team will start their campaign against Australia on July 29. (Inputs PTI)","pubDate":"2022-07-22 19:59:30","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket takes center stage in Houston, a hot spot for growth of sport in the US","link":"https://abc13.com/cricket-for-community-festival-pearland-moosa-stadium-sport-things-to-do-this-weekend/12067091/","keywords":["cricket for community festival pearland","pearland cricket festival","moosa stadium","cricket sport","things to do this weekend pearland","Minor League Cricket","Cricket World Cup","Nitish Kumar"],"creator":["Jonathan Bruce"],"video_url":"https://vcl.abcotv.net/video/ktrk/EWN-9AM-JBR-AWI-CRICKET-FESTIVAL-vid.mp4","description":"Organizers with the Minor League Cricket said the festival will provide an immersive experience for fans to this exciting international sport sweeping across the United States.","content":"PEARLAND, Texas (KTRK) -- Call it cricket's \"H-Town Takeover.\" This Sunday in Pearland, the Houston \"Cricket for the Community Festival\" will take place at the Moosa Stadium, which will soon be a venue for the 2024 Cricket World Cup. Organizers with the Minor League Cricket said it will provide an immersive experience for fans to this exciting international sport sweeping across the United States. A doubleheader of matches will feature star-powered international rosters, including the Houston-based Lone Star Athletics. Admission is free and fans will have the opportunity to meet and greet with international star cricketers throughout the day, enjoy food from local food trucks, music, giveaways and other entertainment, including fan activations from Toyota and Sunoco. Young fans will have the opportunity to take part in a cricket clinic from 1:30 p.m. to 2 p.m. ABC13 spoke with Nitish Kumar, a Canadian cricketer now playing for the Lone Star Athletics, about the event and why Houston is a hot spot for the growth of cricket in the U.S.A.","pubDate":"2022-07-22 19:18:51","image_url":"https://cdn.abcotvs.com/dip/images/12067515_cricket-img.png","source_id":"abc13","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"RCC vs RC Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for ECS Rome T10 2022 Eliminator","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/rcc-vs-rc-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-ecs-rome-t10-2022-eliminator?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-22 19:14:30","image_url":"https://staticg.sportskeeda.com/editor/2021/07/c71fa-16252409236673-800.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Former England batter Jonathan Trott appointed as head coach of Afghanistan's men's cricket team","link":"https://www.sportskeeda.com/cricket/news-former-england-batter-jonathan-trott-appointed-head-coach-afghanistan-s-men-s-cricket-team?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-22 19:14:30","image_url":"https://static.sportskeeda.com/editor/2022/07/72bc3-16585138668360-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Ravi Shastri makes BIG statement on Test cricket, says 'respect quality over quantity...'","link":"https://zeenews.india.com/cricket/ravi-shastri-makes-big-statement-on-test-cricket-says-respect-quality-over-quantity-2488643.html","keywords":null,"creator":null,"video_url":null,"description":"Ravi Shastri is currently in England workoing with Sky Sports","content":null,"pubDate":"2022-07-22 18:42:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games: 6 members of India women’s cricket team yet to get UK visa","link":"https://www.indiatoday.in/sports/commonwealth-games-2022/story/commonwealth-games-6-members-of-india-women-s-cricket-team-yet-to-get-uk-visa-1978923-2022-07-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"CWG 2022: 6 members of India women’s cricket team yet to get UK visa","content":null,"pubDate":"2022-07-22 17:56:59","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI introduces A+ category for umpires; Nitin Menon, Anil Chaudhary part of group","link":"https://www.indiatvnews.com/sports/cricket/bcci-introduces-a-category-for-umpires-nitin-menon-anil-chaudhary-part-of-group-2022-07-22-794189","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India has introduced a new A+ category for its umpires. Nitin Menon, along with ten other officials have been grouped in the category.","content":"The Board of Control for Cricket in India has introduced a new A+ category for its umpires. Nitin Menon, along with ten other officials have been grouped in the category. The others in the A+ category include four international umpires -- Anil Chaudhary, Madangopal Jayaraman, Virender Kumar Sharma and K N Ananthapadmabhanan. Rohan Pandit, Nikhil Patwardhan, Sadashiv Iyer, Ulhas Gandhe and Navdeep Singh Sidhu are also part of the A+ category. Twenty umpires including C Shamshuddin form the A group, 60 are in Group B, 46 in Group C and 11 in Group D which falls in the 60-65 age bracket. The complete list was tabled at the Apex Council meeting on Thursday following the work done by former international umpires K Hariharan, Sudhir Asnani and Amiesh Saheba, and members of the BCCI umpires' sub-committee. Umpires in A+ and A categories are paid Rs 40,000 a day for a first-class game while Rs 30,000 a day are paid in the B and C category. \"It is not grading. There are groups with A+ being the new category. A+ and A, one can say form the cream of Indian umpires. Umpires in the B and C category are also good.\" \"When it comes to assigning duties across domestic events starting at the top with Ranji Trophy, preference will be given group-wise. The grouping has been done after reviewing the performances of the 2021-2022 season,\" said the official. The board has not added to its umpires' list since 2018. With the threat of COVID-19 reducing, the BCCI has decided to conduct a full-fledged domestic season after two years. Asked about more umpires graduating to the highest level, the BCCI official added: \"We put too much emphasis on the elite panel. Only England has three umpires in the elite panel, Australia has two and the rest only one. You can only have so much there. \"The focus should be on improving the standard of umpiring at all levels,\" the official added. Going forward, the board plans to organise as many as 1832 games across age groups in men's and women's cricket. (Inputs PTI)","pubDate":"2022-07-22 17:30:17","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"New Road Worcester pitch report 2nd T20I: England Women vs South Africa Women pitch today match Worcester","link":"https://thesportsrush.com/cricket-news-new-road-worcester-pitch-report-2nd-t20i-england-women-vs-south-africa-women-pitch-today-match-worcester/","keywords":["Cricket","England W","South Africa W"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"New Road Worcester pitch report 2nd T20I: The SportsRush brings you the pitch report for the 2nd T20I between England W vs South Africa W England Women will take on South Africa Women in the 2nd match of the 3-match T20I series at the New Road Stadium in Worcester. The hosts would want to win… The post New Road Worcester pitch report 2nd T20I: England Women vs South Africa Women pitch today match Worcester appeared first on The SportsRush.","content":"New Road Worcester pitch report 2nd T20I: The SportsRush brings you the pitch report for the 2nd T20I between England W vs South Africa W England Women will take on South Africa Women in the 2nd match of the 3-match T20I series at the New Road Stadium in Worcester. The hosts would want to win the series by winning this match, whereas South Africa would want to level it by winning this game. The English team has dominated on this tour, they won all the ODIs, whereas they easily won the 1st T20I match as well. Sophia Dunkley is in brilliant form with the bat, whereas the bowlers are doing their job as well. The South African team is full of some T20 stars, but they need to perform accordingly. The New Road stadium in Worcester is the home ground of the county side Worcestershire. This track is a batting beauty, and the batters of both sides will enjoy batting at this very venue. A total of 3 Men’s ODIs have been played here, and the last one was in 1999, so these records won’t matter much. There is an even bounce on the surface, so the batters can easily trust the bounce of the pitch and play their shots accordingly. The outfield of this stadium is quite fast, once placed in the gap, it will be very difficult for the fielders to stop the ball. Even the boundaries are quite small, making life difficult for the bowlers. An assured first innings at the top of the order from @dunkleysophia ! Every run from her 39-ball 59 👇 pic.twitter.com/SGt8JMf3G8 — England Cricket (@englandcricket) July 22, 2022 This ground has not hosted a single Men’s T20I so far, but the domestic T20 records prove that this ground is a batting surface. The average 1st innings T20 score at this ground is 170 runs. In the last three matches, the average score has been 162 runs, where the chasing teams have won a couple of games. This track provides no assistance to any kind of bowlers, so we can expect a high-scoring encounter in this one. Looking at the overcast conditions, the teams would want to bowl first upon winning the toss.","pubDate":"2022-07-22 17:30:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Keep Test cricket to top six teams; respect quality over quantity: Shastri","link":"https://www.business-standard.com/article/sports/keep-test-cricket-to-top-six-teams-respect-quality-over-quantity-shastri-122072201225_1.html","keywords":null,"creator":null,"video_url":null,"description":"Former India head coach Ravi Shastri stated that Test cricket should be restricted to only the top six teams in the format.","content":"Former India head coach Ravi Shastri stated that Test cricket should be restricted to only the top six teams in the format. Shastri, who is currently working in the United Kingdom for Sky Sports as a member of their commentary team, further said that emphasis has to be put on white-ball cricket and that it can be used to spread the game all over the world, citing the football model. \"You cannot have 12 teams or ten teams. You keep the top six, keep the quality and respect quality over quantity. That's the only way you open a window for other cricket to be played. Expand teams in one-day cricket and T20 cricket if you want the game to spread. But Test cricket will have to reduce the number of teams that play.\" \"The bottom line, it's the football model. You've got the EPL, La Liga, the German league, the South America Copa America. In the future it's going to be like that, you'll have one World Cup, the big one and then the rest of it will be all different leagues happening around the world,\" said Shastri. Adding to the way he wants the Test format, Shastri insisted that the format wouldn't be limited to only six sides, but teams will have to qualify for being part of the top six to be able to play the format. As per current rankings, the top six ranked teams in Test cricket are Australia, India, South Africa, England, New Zealand and Pakistan. As per Shastri's proposal, teams such as West Indies, Bangladesh, Zimbabwe and Sri Lanka would miss out on playing Tests, so as do Afghanistan and Ireland, which aren't on the Test rankings yet. \"Whether it's India, Australia, or England you have to qualify for red-ball series if you want to be around to play Test match cricket. Then it doesn't matter if England doesn't go to the West Indies, or West Indies come to England. If they're in the top six, they play, but if they're not in the top six they don't play.\" In complete contrast to Shastri's views, West Indies beat England 1-0 in a three-match series in March while Sri Lanka recently drew their two-match Test series against Australia 1-1. When asked if he would be pleased with keeping Test cricket to just six teams, Shastri, the former India all-rounder, replied in the affirmative. \"Absolutely. Because what is Test cricket? It tests you and for that you need quality. If there's no quality then who's going to watch it? You're going to have three-day games, two-day games if the opposition is not right.\" \"If you have countries who have never played Test cricket and then you say 'come to India' or 'come to England', in bowler-friendly conditions the game over in two days, two-and-a-half days. And you've taken money from the broadcaster for five days.\" \"So he's going to be unhappy, the fans are going to be unhappy and the standard is going to go down. Quality is important and in that format of the game extremely important for cricket to survive in the future.\" --IANS nr/bsk (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-22 16:40:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220722/thumb-122072201225.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Shikhar Dhawan last ODI century: Shikhar Dhawan last century in ODI cricket","link":"https://thesportsrush.com/cricket-news-shikhar-dhawan-last-odi-century-shikhar-dhawan-last-century-in-odi-cricket/","keywords":["Cricket","India's tour of West Indies 2022","Shikhar Dhawan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shikhar Dhawan last ODI century: Team India’s skipper for the ongoing West Indies tour, Dhawan was at his fluent best in Trinidad today. During the first ODI of India’s tour of West Indies at the Queen’s Park Oval in Port of Spain, team India’s stand-in skipper Shikhar Dhawan missed out on an excellent 18th ODI… The post Shikhar Dhawan last ODI century: Shikhar Dhawan last century in ODI cricket appeared first on The SportsRush.","content":"Shikhar Dhawan last ODI century: Team India’s skipper for the ongoing West Indies tour, Dhawan was at his fluent best in Trinidad today. During the first ODI of India’s tour of West Indies at the Queen’s Park Oval in Port of Spain, team India’s stand-in skipper Shikhar Dhawan missed out on an excellent 18th ODI century by a whisker, as he headed back towards the dressing room at the score of 97 off 99 deliveries. After being invited to bat first post losing the Toss, Dhawan was involved in a stellar 119-run opening stand alongside Shubman Gill (64 off 53), with the latter getting run-out due to some clumsy, careless bit of running between the wickets during the 18th Over of the innings. Dhawan, on the other end kept batting with his usual finesse in the format, scoring at a run-a-ball, while taking the aggressive route every now and then. He found an able ally after Gill’s departure in Shreyas Iyer, as the duo then stitched together a 94-run stand off 97 deliveries for the second wicket, while taking the team total past the 200-run mark during the 32nd Over. With mere three runs shy of what would have been his first ODI ton versus West Indies, Dhawan hit a short and wide delivery off left-arm spinner Gutakesh Motie straight to Shamarh Brooks at backward point, with the latter completing an excellent catch while diving air-borne towards his right. 9⃣7⃣(99) A captain’s knock from Shikhar Dhawan. Well played, Skip. Image courtesy: AFP#PlayBold #WIvIND #TeamIndia pic.twitter.com/WE7mAXyHzU — Royal Challengers Bangalore (@RCBTweets) July 22, 2022 Shikhar Dhawan last ODI century Dhawan’s last ODI century came during the 2019 ICC World Cup match against Australia at the Kennington Oval in London. The Southpaw batter had played a match-winning knock of 117 (109), as team India went on to post a humongous 352/5 on the scoreboard, and ultimately winning the match by 36 runs. In the 21 ODIs he has played since then, the 36-year-old has scored nine half-centuries, which also includes three scores in the 90s, but has unfortunately failed to reach the three-figure mark. As for today’s innings, his 97 runs comprised 10 Fours and 3 Sixes, with them being scored at a strike rate of 97.98. The post Shikhar Dhawan last ODI century: Shikhar Dhawan last century in ODI cricket appeared first on The SportsRush.","pubDate":"2022-07-22 16:39:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shikhar Dhawan answers critics in style; proves he has lot left in tank vs West Indies","link":"https://www.indiatvnews.com/sports/cricket/shikhar-dhawan-scores-97-in-the-first-odi-vs-wi-answers-critics-in-style-in-trinidad-2022-07-22-794181","keywords":null,"creator":null,"video_url":null,"description":"Shikhar Dhawan answered all his detractors in style as the 'Gabbar' of Indian cricket made his way to a magnificent 97 in the first ODI vs West Indies.","content":null,"pubDate":"2022-07-22 16:34:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI, 1st ODI: Shikhar Dhawan claims THIS huge record with 97-run knock, joins Rohit Sharma and Sachin Tendulkar in elite list","link":"https://zeenews.india.com/cricket/ind-vs-wi-1st-odi-shikhar-dhawan-claims-this-huge-record-with-97-run-knock-joins-rohit-sharma-and-sachin-tendulkar-in-elite-list-2488599.html","keywords":null,"creator":null,"video_url":null,"description":"Dhawan now has the third most runs after 150 innings in ODI cricket. Dhawan now has 6280 runs while the list is topped by South Africa's Hashim Amla. Virat Kohli is second on the list with 6422 runs to his name.","content":null,"pubDate":"2022-07-22 16:32:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI 1st ODI Live Score Updates: Surya departs as India are four down - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtd2ktMXN0LW9kaS1saXZlLXNjb3JlLXVwZGF0ZXMtODA0NTgzOS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI 1st ODI Live Score Updates: Surya departs as India are four down  The Indian ExpressIND vs WI Live Streaming Details- When And Where To Watch India vs West Indies Live In Your Country? India Tour Of West Indies 2022, 1st ODI  Cricket Addictor'Every other side is doing a little dance if...': Styris singles out India star  Hindustan TimesIndia vs West Indies 1st ODI Live Score Updates: Quick wickets hurt India's run charge  Times of IndiaIndia vs West Indies Live Streaming Details: When And Where To Watch India vs West Indies Match Live In Your Country? 1st ODI, India Tour Of West Indies 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-07-22 16:20:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs India, 1st ODI Live score and Updates: Shreyas Iyer out for 54 after Shikhar Dhawan's unfortunate exit - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMixgFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L3dlc3QtaW5kaWVzLXZzLWluZGlhLTFzdC1vZGktbGl2ZS1zY29yZS11cGRhdGVzLXdpLWluZC1xdWVlbi1zLXBhcmstb3ZhbC1zaGlraGFyLWRoYXdhbi1yYXZpbmRyYS1qYWRlamEtbmljaG9sYXMtcG9vcmFuLWphc29uLWhvbGRlci0xOTc4NzkxLTIwMjItMDctMjLSAcoBaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvc3BvcnRzL2NyaWNrZXQvc3Rvcnkvd2VzdC1pbmRpZXMtdnMtaW5kaWEtMXN0LW9kaS1saXZlLXNjb3JlLXVwZGF0ZXMtd2ktaW5kLXF1ZWVuLXMtcGFyay1vdmFsLXNoaWtoYXItZGhhd2FuLXJhdmluZHJhLWphZGVqYS1uaWNob2xhcy1wb29yYW4tamFzb24taG9sZGVyLTE5Nzg3OTEtMjAyMi0wNy0yMg?oc=5","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs India, 1st ODI Live score and Updates: Shreyas Iyer out for 54 after Shikhar Dhawan's unfortunate exit  India TodayIND vs WI Live Streaming Details- When And Where To Watch India vs West Indies Live In Your Country? India Tour Of West Indies 2022, 1st ODI  Cricket Addictor'Weather Will be Challenging but Boys are Prepared': Shikhar Dhawan Looking Foward to a Great Windies Tour  News18IND vs WI 1st ODI Live Score Updates: Samson departs as India are five down  The Indian ExpressIndia vs West Indies Live Streaming Details: When And Where To Watch India vs West Indies Match Live In Your Country? 1st ODI, India Tour Of West Indies 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-07-22 16:12:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Shikhar Dhawan century in ODI full list: Shikhar Dhawan ODI centuries in cricket","link":"https://thesportsrush.com/cricket-news-shikhar-dhawan-century-in-odi-full-list-shikhar-dhawan-odi-centuries-in-cricket/","keywords":["Cricket","India","India tour of West Indies 2022","Shikhar Dhawan","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Shikhar Dhawan century in ODI: The stand-in Indian captain has all the time in the world to end a century drought today. During the first ODI of India’s tour of West Indies 2022 in Port of Spain, India captain Shikhar Dhawan looks set to be on his way to an international century. Assuming that he… The post Shikhar Dhawan century in ODI full list: Shikhar Dhawan ODI centuries in cricket appeared first on The SportsRush.","content":"Shikhar Dhawan century in ODI: The stand-in Indian captain has all the time in the world to end a century drought today. During the first ODI of India’s tour of West Indies 2022 in Port of Spain, India captain Shikhar Dhawan looks set to be on his way to an international century. Assuming that he reaches the three-figure mark, it would have come after more than three years. Readers must note that Dhawan hasn’t scored an ODI century since the ICC Cricket World Cup 2019. Opening the batting only for the second with Shubman Gill (64), Dhawan hit a couple of boundaries in the first over of the match against Alzarri Joseph. In spite of acting as a second-fiddle to Gill, Dhawan remained assured from one end not looking to be in any sort of hurry. Perhaps aware of a century drought at this level, Dhawan didn’t take unnecessary risks to attack the West Indian bowlers. Dhawan, who hit consecutive fours off Romario Shepherd for the second time in the first powerplay, remained among the boundaries throughout a 119-run opening stand. It was on the second delivery of the 18th over that Dhawan ran a single off Joseph to complete a 36th ODI half-century at the Queen’s Park Oval. #CaptainGabbar into the NINETIES!!! 😍 Keep cheering for Shikhar Paaji, #SherSquad ! #WIvIND #SaddaPunjab #PunjabKings pic.twitter.com/jTCYHbVXr7 — Punjab Kings (@PunjabKingsIPL) July 22, 2022 UPDATE: Dhawan missed out on an 18th ODI century after getting out for 97 (99) in the 34th over. While Dhawan has scored three and two ODI centuries at The Oval and Dubai International Cricket Stadium respectively, he has scored five and four against Australia and Sri Lanka respectively.","pubDate":"2022-07-22 15:58:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shubman Gill surpasses Sachin Tendulkar to create unique record vs West Indies","link":"https://www.indiatvnews.com/sports/cricket/shubman-gill-surpasses-sachin-tendulkar-to-create-unique-record-vs-west-indies-in-the-ind-vs-wi-1st-odi-at-trinidad-2022-07-22-794173","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill made a thumping return to white-ball cricket with a magnificent half-century vs West Indies in the first ODI of the 3-match series at Trinidad. ","content":"Shubman Gill made a thumping return to white-ball cricket with a magnificent half-century vs West Indies in the first ODI of the 3-match series at Trinidad. The 22-year-old finished with a sublime 64 off 53 deliveries before getting out in an unfortunate fashion, falling victim to a run-out. After the innings, Gill became the 2nd youngest Indian after to score a half-century in West Indies in the fifty-over format of the game. He also surpassed in the process, who before this innings, held the record. As far as the match is concerned, India have started pretty strong and look well on their way to a mammoth score. Skipper Dhawan looked in sublime touch as he also raced away to his fifty. Earlier, Westi Indies won the toss and put India to bat first. Nicholas Pooran, at the toss, announced that Holder, who was drafted into the ODI side, was out with COVID. \"The boys got a lot of exposure, it's a great opportunity for everyone to showcase their talent. A Lots of fans come from overseas to support us, we always like playing here in the Caribbean, the guys are really looking forward to it,\" said Dhawan. We spoke about batting in partnerships. It's been tough for us, but we are up for the challenge. Every game we will try to improve,\" said the West Indies Skipper (c), Sanju Samson(w), Shubman Gill, Shreyas Iyer, Suryakumar Yadav, Deepak Hooda, Axar Patel, Shardul Thakur, Mohammed Siraj, , Prasidh Krishna Nicholas Pooran(c), (w), Brandon King, Shamarh Brooks, Kyle Mayers, Rovman Powell, Akeal Hosein, Romario Shepherd, Alzarri Joseph, Gudakesh Motie, Jayden Seales","pubDate":"2022-07-22 15:52:17","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Less than 48 hours left for departure, six cricketers await visa","link":"https://www.business-standard.com/article/sports/cwg-2022-less-than-48-hours-left-for-departure-six-cricketers-await-visa-122072200991_1.html","keywords":null,"creator":null,"video_url":null,"description":"Six members of the Indian women's cricket contingent are yet to get visa, less than 48 hours before their departure for the Commonwealth Games in Birmingham.","content":"Six members of the Indian women's cricket contingent are yet to get visa, less than 48 hours before their departure for the Commonwealth Games in Birmingham. Women's cricket is making its debut at the Commonwealth Games . The Indian squad is currently training in Bengaluru and is scheduled to leave for Birmingham on Sunday. The BCCI is in touch with the Indian Olympic Association on the issue. \"Few of the visas came in today but they are still six left for processing including three players and three players support staff,\" an IOA source told PTI. \"The remaining should come by tomorrow. We have very little over control over the process anyway. There is summer rush and UK visas are taking time.\" The kits have not reached Bengaluru as well but the IOA official assured that it will be delivered by Saturday. The BCCI had announced a 15-member squad for the Games, beginning July 28. India open their campaign against the mighty Australia on July 29 before facing Pakistan on July 31. An eight member support staff was also named with three reserve players. Chef de Mission gets visa, his deputy awaiting ============================= India's Chef de Mission Rajesh Bhandari finally got his visa on Friday and he will soon be flying out to join his colleagues in Birmingham. The IOA has named three Deputy Chef de Mission for the Games. Anil Dhupar and Maninder Singh, who too had to wait for his visa till the last minute, took the flight on Friday morning. Deputy Chef de Mission Prashant Kushwaha is the one left waiting for his visa. \"His visa should also come soon,\" the IOA source added. Earlier this month, star wrestler Bajrang Punia also had to change his training plans for a training stint in US as he stayed back in India to get his UK visa. He is now in the US and will travel straight to Birmingham from there. BCCI President Sourav Ganguly had on Thursday informed that one of the squad members has tested positive for COVID-19 and is in isolation. It has been learnt that the cricketer is \"recovering fast\". (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-22 15:26:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220722/thumb-122072200991.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Will women's cricket successful debut help ICC's Olympic pitch?","link":"https://www.business-standard.com/article/sports/cwg-2022-will-women-s-cricket-successful-debut-help-icc-s-olympic-pitch-122072200396_1.html","keywords":null,"creator":null,"video_url":null,"description":"Women cricketers will get to experience the vibe of a multi-sporting event for the very first time as the sport hopes to generate global eyeballs on its Commonwealth Games return after 24 long years","content":"Women cricketers will get to experience the vibe of a multi-sporting event for the very first time as the sport hopes to generate global eyeballs when it returns to the Commonwealth Games after 24 long years. With all top cricketing nations part of the Commonwealth, cricket's inclusion in the Birmingham Games appears natural but it still took more than two decades for the sport to make a comeback. The only other time cricket featured in the Commonwealth Games was in Kuala Lumpur in 1998 when the men's competition was staged. The International Cricket Council (ICC), which is pushing for the game's inclusion in the 2028 Olympics, will be hoping that the women's cricket event is a roaring success in Birmingham so that it has a stronger pitch to make for the Summer Games in Los Angeles. With the Indian and Pakistan diaspora forming a large part of Birmingham's population, one can expect a sell out crowd at the Edgbaston for the marquee clashes, including the Indo-Pak contest on July 31. \"The India-Pakistan game will be one of the highlights of the Commonwealth Games,\" reckons Birmingham Games CEO Ian Reid. Though England and Australia are not in the same group, the fans are expecting them to meet in the knock-out stages with the tickets already sold out for the semifinals and final. The players, including the Indians, who are usually confined to their hotels during their bilateral contests, are looking forward to interacting with athletes of other sports. The cricketers will not be housed in the Games Village along with the rest of the international athletes during their stay due to logistical reasons, but they will certainly be part of the opening ceremony and watch a sport of their choice in their downtime. \"I am really excited about the Commonwealth Games . For me it is like competing in a World Cup. I have been preparing it for a long time now,\" top India all-rounder Deepti Sharma told PTI in a recent chat. The eight participating teams are divided into groups of four. Group A includes India, Pakistan, Australia and Barbados while Group B comprises England, New Zealand, South Africa and Sri Lanka. The competition will also give a strong indication on where all teams stand ahead of the T20 World Cup next year. As the reigning world champions in T20 and ODI cricket, Australia have been the benchmark for a while now. England are a tad behind their arch-rivals while the likes of India, New Zealand and South Africa are very much a work in progress. Over the last couple of years, India lost four series in a row before winning one against an under-prepared Sri Lanka last month. Under the leadership of the new all-format captain Harmanpreet Kaur, India were expected to run through an opponent that had hardly played in the last two years, but Sri Lanka still managed to win a game in the series. Like the men's game, women's cricket too is evolving at a rapid pace and India clearly need to catch up. \"India need to look at CWG as another tournament. The vibe will be different as it is not an ICC event. The players will be part of the entire Indian contingent. They would surely want to win a medal for the country but you have to be realistic as well,\" former India captain Anjum Chopra said. \"There are better teams which are part of the competition. Also, India have not had a great run of late in playing away T20 games. It is a progressive team, it is still trying to find its best combination. \"They have to find their style of play and they are far from it at the moment. You don't have the same depth that you have in the men's team. The set up we have at the moment -- somebody is running, somebody is walking and somebody is leaping, you can't have a mixed bag like that,\" she said. The event begins with the India-Australia clash on July 29 while later in the day Pakistan open their campaign against Barbados. All games including the final on August 7 will be played at Edgbaston. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-22 15:26:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220722/thumb-122072200396.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Cut number of Test teams? Axe the 50-over game? Cricket's schedule conundrum","link":"https://www.skysports.com/cricket/news/12040/12656986/cut-the-number-of-test-teams-axe-the-50-over-game-how-to-solve-crickets-unabating-schedule","keywords":null,"creator":null,"video_url":null,"description":"\"I think the huge line in the sand is Ben retiring at the tender age of 31.\"","content":"Last Updated: 22/07/22 5:32pm Please use Chrome browser for a more accessible video player \"I think the huge line in the sand is Ben retiring at the tender age of 31.\" Those the words of former England white-ball captain Eoin Morgan after the side's current Test skipper Ben Stokes called time on his ODI career. The congested cricketing calendar has come into laser-sharp focus since Stokes' announcement with the man himself saying the \"unsustainable\" schedule was a major factor in his decision to depart the 50-over game. So, what can be done about the number of matches players now face, with the international programme swelling and franchise competitions popping up all over the globe? Sky Sports' Michael Atherton \"We have to look at reality. If you don't see reality it is going to give you the biggest knockout punch you've ever got. You have to look at the demand and go with the economics of the sport. \"Franchise cricket is ruling the roost and will rule the roost, so how are you going to still have international cricket going? You have to cut the volume of bilateral cricket if you want all three formats to survive. \"I feel the emphasis will be on Test and T20 cricket - 50-over cricket might be pushed back but it can still survive if you focus just on the World Cup. \"Paramount importance should be given to the World Cups in 50-over and T20. The bucks have to increase for players to still want to be part of those. Please use Chrome browser for a more accessible video player \"Test cricket will always remain. In India, franchise cricket brings in the coffers but all players want to play Test cricket because you play it for 10 years and you are remembered. \"But if you want Test cricket to survive you cannot have 10, 12 teams playing. Keep the top six, keep the quality of cricket going and respect quality over quantity. \"Expand teams in T20 or one-day cricket if you want to spread the game, but reduce the teams in Test cricket so you have to qualify for the top six if you want to be playing Tests matches. \"Test cricket tests you, you need quality. So if there is no quality then who is going to watch it? ''You are going to have two or three-day games. It is also expensive to host Test cricket so spread the game with white-ball cricket.\" Please use Chrome browser for a more accessible video player \"I think the future of 50-over cricket in this country looks pretty bleak for lots of reasons. \"The obvious one is that the Royal London Cup is now a second-rate competition with all of the better players either playing for England or in The Hundred. \"The ones that are playing 50-over cricket are looking over the fence and thinking, 'I'd rather be doing something else. It's great for my development, I guess, but given the choice, I would rather be playing in a competition with more eyes on it'. \"You are kind of signing the death warrant of the 50-over format by virtue of the way it is being played. We have four formats in England so something has to give and if that ends up being 50-over cricket that might be okay. \"It would be sad as it is a terrific, high-skilled format but if it came down to it then I would rather Test and T20 cricket stayed. Eoin Morgan, speaking to Sky Sports \"How does 50-over cricket survive in this country. It's basically being written off before our very eyes while we pretend we're still interested in it. \"We are world champions so talk about cutting off your nose while your face is still smiling away. It is quite extraordinary to witness what is happening at the minute. \"So, 50-over cricket might go in England but it might be different elsewhere. Nobody's circumstances are the same Some countries would be happy to see the end of Test cricket. although they won't say it out loud. \"Too often it seems the ones that have the riches and the power have looked after what is good for them thinking that that is good for the game in general but the game, in general, has been scrapping around.\" Please use Chrome browser for a more accessible video player \"I think the game is at a tipping point which has long been coming probably since the advent of the IPL. \"You could argue the tipping point has come now with South Africa taking the decision to abandon three ODIs in Australia as they want their best players available for a franchise tournament they are setting up. \"They are prepared to slightly imperil their participation in the next World Cup to do that. That tells you all you need to know about the balance of power between international and franchise cricket. \"There is going to be an ICC event virtually every year and there are going to be windows for franchise T20 tournaments so something will have to give. What will have to give is bilateral international cricket. \"However, England, India and Australia have to be enlightened in helping other countries to be as strong as they can for the good of the game. If there are only two or three strong teams people will switch off. The beauty of the international game is the competition between the teams. \"If you think back to Covid 2020, all the rhetoric when West Indies came to England was 'thanks for coming, we owe you, we will pay you back,' but it doesn't look like England will play another Test series in the Caribbean for another five years. Eoin Morgan, speaking to Sky Sports \"I actually think the biggest issue in the English and world game is getting a simple structure for the fans. Things change from year to year and you are taking people's enthusiasm and preparedness to pay for it for granted \"You can't do that. You need a schedule that can hold for the next few years, whatever that might be. Something simple in blocks. \"If I could make just one plea, it would be to rebalance the thinking from 'how do we make the most money?' to 'what is the best thing for cricket and the cricketers?' \"We have covered first-class cricket in England in October freezing our backsides off. If you are doing that, you know something has gone wrong somewhere down the line.\"","pubDate":"2022-07-22 15:25:00","image_url":"https://e0.365dm.com/22/07/1920x1080/odi-cricket-test-cricket-sky-sports-cricket_5842631.jpg?20220722160850","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"England rugby chief to ban trans women from playing against female in major U-turn after lengthy review ahead of season","link":"https://www.thesun.co.uk/uncategorized/19287670/england-rugby-trans-women-womens-sports/","keywords":["Rugby League","Rugby Union","Sport","Uncategorized","World Rugby"],"creator":["Martin Lipton"],"video_url":null,"description":"TWICKENHAM is set to ban trans women from playing against female athletes in a major U-turn. RFU chiefs had cleared trans women to continue to play women’s rugby in 2020, arguing that more evidence was required before imposing a ban. But the English game will now move into line with World Rugby policies by implementing […]","content":"TWICKENHAM is set to ban trans women from playing against female athletes in a major U-turn. RFU chiefs had cleared trans women to continue to play women’s rugby in 2020, arguing that more evidence was required before imposing a ban. RFU chiefs cleared trans women to continue playing women’s rugby in 2020Getty But the English game will now move into line with World Rugby policies by implementing the blanket ban on trans women playing full contact women’s rugby before the new season starts. The decision follows a lengthy review since the original decision, with a survey receiving more than 11,000 responses. An RFU spokesperson explained: “The review and consultation concluded there are physical differences between those people whose sex was assigned as male and those as female at birth. “Advantages in strength, stamina and physique brought about by male puberty are significant and retained even after testosterone suppression. Read More on Rugby Australia 17 England 21 Jones' side make history after coming from behind to beat rivals LIVING THE DREAM Dream Team's BACK! All you need to know before you go for £100k prize pot “This science provides the basis of the recommendation that the inclusion of trans people assigned male at birth in female contact rugby cannot be balanced against considerations of safety and fairness. “Until such time as new science is available, a precautionary approach is appropriate to ensure fair competition and safety of all competitors.” The new policy has been recommended for the RFU’s ruling Council to approve imminently following the “medical, scientific and social information”. Twickenham added: “Given the difficulties in identifying a credible test to assess physiological variables, it is recommended that operating on a case by case basis is no longer a viable option at this time. Most read in Rugby Union RUGBY SHOCK Rugby star diagnosed with motor neurone disease aged 33 and forced to retire FAN BAN Rugby fan banned for life after URINATING on top of Sydney Cricket Ground stand ED'S GONE Watch raging Eddie Jones explode at Australian 'clown' who called him a 'traitor' 'My world falling apart' Ex-Wales rugby captain Ryan Jones reveals he has dementia aged 41 ALL BLACKS 22 IRELAND 32 Irish with performance for the ages to win test series 2-1 AUSTRALIA 17 ENGLAND 21 Marcus Smith with stellar breakaway try to give Red Rose big lead “Therefore, the RFU Council will vote on a recommendation for a policy change for contact rugby to only permit players in the female category whose sex recorded at birth was female.  “In the male category it is proposed that players whose sex recorded at birth is female may play if they provide their written consent and a risk assessment is carried out. “This is a complex and difficult decision and the recommendation has not been made lightly or without thorough and full research and consultation.” England Rugby has made a U-turn and will ban trans women from playing women’s rugbyReuters FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS The RFU insisted it was “committed to supporting and encouraging opportunities for everyone to participate in rugby including non-contact formats of the game and through coaching, refereeing or volunteering roles”.  Its decision follows recent global bans on trans women competing against other women in both rugby league and swimming. RFU bosses say they have already contacted registered trans female players who will be immediately impacted “to offer support in continuing to encourage them to participate in the sport”.","pubDate":"2022-07-22 15:17:11","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-1st-odi-odi-21-25-updates-3184736","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Queen's Park Oval, Port of Spain, Trinidad. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-07-22 15:15:48","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637941195393509946.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}