{"newsArray":[{"title":"Olympic leaders in Brisbane promote policies to keep 2032 Games safe from financial wrongdoing","link":"https://japantoday.com/category/sports/olympic-leaders-in-brisbane-promote-policies-to-keep-2032-games-safe-from-financial-wrongdoing","keywords":null,"creator":null,"video_url":null,"description":"Olympic organizers from Australia said Wednesday they have safeguards in place to stop the 2032 Brisbane Games ever joining Paris, Tokyo and Rio de Janeiro under investigation for…","content":"Olympic organizers from Australia said Wednesday they have safeguards in place to stop the 2032 Brisbane Games ever joining Paris, Tokyo and Rio de Janeiro under investigation for financial wrongdoing. One week after Paris authorities raided offices and homes linked to organizing the 2024 Olympics, Brisbane officials were at the IOC in Switzerland for a first detailed progress meeting on their own project. Brisbane would be “standing tall in the highest standards,” organizing committee president Andrew Liveris told reporters in an online briefing. “We have to. In fact, if we don’t do that then we should not be there,” he said, pointing to “a robust fraud and code of conduct policy” already in place with compliance training for senior management. In Paris, Olympic officials are under scrutiny for suspected favoritism in how contracts were awarded rather than the kind of bribery that tainted Rio de Janeiro in 2016 and Tokyo held in 2021. A Summer Games typically involves hundreds of contracts linked to the multi-billion dollar operations for organizers, plus billions more in construction and security costs mostly met by taxpayers. “We’re subject to Queensland government procurement standards,” Liveris said of Brisbane’s home state. Brisbane organizers’ operating budget is set at 5 billion Australian dollars ($3.3 billion). The IOC contributes cash and services that amounted to nearly $1.9 billion for Tokyo. Organizers’ revenue including ticket, sponsorship and merchandise sales has a target set at $1.7 billion (2.5 billion Australian dollars), Brisbane 2032 chief executive Cindy Hook said. Liveris acknowledged that by global standards Australia is a “small commercial market” while Brisbane and Queensland have to build their reputation for a high standard of living. “We have a wonderful part of the world but not as well-known as maybe it needs to be,” he said. “So that means we have to find innovative ways to bring sponsors to the table.” Big-ticket projects for 2032 include the federally backed Brisbane Arena that will later stage swimming and a state-funded rebuild of the storied cricket ground known as the Gabba. It will host track and field and potentially the opening and closing ceremonies. “There is no commitment there to make that cost neutral to the taxpayer because that’s for the taxpayers’ benefit,” Liveris said. Brisbane also seeks inspiration from the 2000 Sydney Olympics that was a stage for Cathy Freeman, who lit the cauldron and then ran to 400-meter gold, who has Indigenous Australian family roots. Liveris set a target of “the most inclusive games ever, with great equal access with all, with a strong and special emphasis on First Nations and celebrating the world’s oldest living culture.”","pubDate":"2023-06-28 21:32:41","image_url":null,"source_id":"japantoday","category":["sports"],"country":["japan"],"language":"english"},{"title":"News24.com | Smith stars for Australia before Root double revives England in 2nd Test","link":"https://www.news24.com/sport/Cricket/smith-stars-for-australia-before-root-double-revives-england-in-2nd-test-20230628","keywords":null,"creator":null,"video_url":null,"description":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday.","content":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday. STUMPS | England v Australia - 2nd Test, Day 1 But off-spinner Joe Root, better known as the number one-ranked batsman in Test cricket, took two wickets in four balls late in the day. His double strike ensured Ashes-holders Australia, 1-0 up in the five-match series after a thrilling two-wicket win at Edgbaston last week, did not have things all their own way at the 'Home of Cricket'. Australia were in a commanding position at 316-3, despite being sent into bat by England captain Ben Stokes in overcast conditions and on a green tinged-pitch that promised to aid his five-strong pace attack. But dashing left-hander Travis Head, scoring at better than a run-a-ball, then charged down the pitch only to be beaten by a sharply turning Root delivery with Jonny Bairstow, whose wicketkeeping had proved fallible in Birmingham, completing an excellent stumping. Head was out for 77 following a stand of 118 with Smith where England were given a taste of their own 'Bazball' medicine. But three balls later, Australia's 316-4 became 316-5 when Cameron Green fell for a duck, slicing Root to James Anderson at mid-off. At stumps Root, the only spinner in the attack after England dropped Moeen Ali, had figures of 2-19 from eight overs. Fast bowler Josh Tongue, recalled in place of Moeen, removed Australia left-handed openers Usman Khawaja and David Warner, who made a valuable 66, in a return of 2-88 in 18 overs. The match was briefly halted before the second over when two Just Stop Oil protesters ran out of the Grandstand and onto the outfield, sprinkling the environmental pressure group's trademark orange powder on the square but not on the pitch. Bairstow grabbed one of the demonstrators and carried them off the playing surface, with the other apprehended by stewards. A third demonstrator was tackled before making it onto the outfield, with the police making three arrests. England's aggressive 'Bazball' approach had come under scrutiny in Birmingham, but missing several chances was a bigger factor in their defeat. On Wednesday, Stuart Broad, who has long troubled Warner in Ashes contests, had him edging into the cordon on 20, only for fourth slip Ollie Pope, who later went off injured with a shoulder injury, to drop a two-handed catch. Warner cashed in with a 66-ball fifty completed when he pulled Tongue, in just his second Test, for six. But off what became the last ball before lunch Tongue bowled Khawaja fresh from his hundred at Edgbaston, playing no shot. Warner also fell to Tongue, bowled between bat and pad by a ball that cut back sharply off the pitch. England for all Australia's playing and missing, did not help themselves by giving away 36 runs in extras, including 12 no-balls. Smith stuck Stuart Broad through the covers for two fours off successive balls then successfully overturned a caught-behind decision off the next delivery on his way to a 102-ball fifty. Broad also had Marnus Labuschagne lbw, playing no shot, before another successful Australian review indicated the ball would have cleared the top of the stumps. Stokes brought himself on in the hope of a breakthrough but it was not long before Smith confidently flicked him through midwicket for four to go to 9,000 runs in Test cricket. Smith and Labuschagne, until recently the world's two top-ranked Test batsmen, had managed just 35 runs between them across four innings at Edgbaston. But on Wednesday their century partnership was ended when Labuschagne was caught behind for 47 off an excellent full-length delivery from Ollie Robinson to leave Australia 198-3.","pubDate":"2023-06-28 19:32:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Absolutely shambolic – Kevin Pietersen rips into England after day one at Lord’s","link":"https://www.watfordobserver.co.uk/sport/national/23621180.absolutely-shambolic---kevin-pietersen-rips-england-day-one-lords/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Pietersen offered a stinging assessment of England’s efforts with the ball.","content":"Pietersen, who was given the honour of ringing the bell before the start of play, offered a stinging assessment of England’s efforts with the ball after the tourists reached the close on 339 for five. Only two late wickets in four balls from part-time spinner Joe Root prevented the end-of-play scorecard looking even worse, Travis Head and Cameron Green both falling to unforced errors. A scattering of live green grass and overhead clouds that were gloomy enough to warrant floodlights throughout the day appeared to hint at ideal conditions for England’s five-strong seam attack, but it was the tourists who dictated the tone as half-centuries from David Warner (66), Travis Head (77) and Steve Smith (85no) left them well placed. “Not a lot’s caught my eye from an English perspective, it’s been shambolic. Absolutely shambolic,” the 104-cap veteran told Sky Sports. “You have overhead conditions, you have wickets that suit your bowlers and you’ve got bowlers running in at 78, 79, 80 miles an hour. “Now it’s one thing walking here, swanning around, saying ‘this is a wonderful team to play in, we’re creating the best environment’. But this is not Ashes cricket.” Pietersen also took issue with an apparent lack of edge on the field – just a week on from Australian criticism over Ollie Robinson’s expletive-filled send-off of Usman Khawaja at Edgbaston. “It’s all too easy, too nice. Are you telling me Ricky Ponting in 2005 is going to be talking to Geraint Jones? You think Michael Vaughan is going to be stood next to Justin Langer saying ‘hey mate, what a cool day, it’s overcast, it’s beautiful, what an awesome day, environment here at Lord’s – what do you think of the wicket’? “Are you joking? Are you absolutely joking? I just hope they’re in their dressing room now and the England coach is giving them the biggest hammering and saying it’s absolutely not good enough.” Josh Tongue was the pick of the five English quicks on his first Ashes outing, topping the pace charts and snapping up the wickets of Khawaja and David Warner either side of the lunch break. The 25-year-old saw his first three overs smacked for 24 but revealed a word of advice from Ollie Robinson about utilising the famous Lord’s slope helped him open his account against Australia. “I spoke to Robbo just before lunch about trying to use the slope a bit more,” said Tongue. “I was trying to wobble it away from the bat and he said ‘why don’t you try and get the ball coming back into him’. Getting Khawaja just before lunch was crucial and then, obviously, I was trying to do the same to David. “He’s a very hard batter to bowl at. If you miss your length you’re going to the boundary, that’s how I felt, so the wicket came at a very good time for the team.” Invited to rate the Warner dismissal, which skidded between bat and pad and lifted the bails with precision to cap an outstanding over, Tongue added: “I haven’t properly looked back yet, but listening to the lads it was a very good ball.” Warner opted to shine a light on Head’s performance after the latter hit 14 boundaries to pile the pressure on England in the evening session. “Trav is Trav, that’s the way he plays,” he said. “It’s exciting and we’re just lucky he’s on our team. He can take it away from you. Striking at over a hundred is exceptional. He just finds a way.”","pubDate":"2023-06-28 19:31:54","image_url":"https://www.watfordobserver.co.uk/resources/images/16941422/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ashes, 2nd Test: Steve Smith remains unbeaten on 85, Australia post 339/5 at stumps on Day 1","link":"https://telanganatoday.com/ashes-2nd-test-steve-smith-remains-unbeaten-on-85-australia-post-339-5-at-stumps-on-day-1","keywords":["News","Sport","ashes","Australia","England","Steve Smith"],"creator":["AP"],"video_url":null,"description":"Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia's charge with an unbeaten 85","content":"Home | Sport | Ashes 2nd Test Steve Smith Remains Unbeaten On 85 Australia Post 339 5 At Stumps On Day 1 Ashes, 2nd Test: Steve Smith remains unbeaten on 85, Australia post 339/5 at stumps on Day 1 Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia's charge with an unbeaten 85 By AP Updated On - 12:44 AM, Thu - 29 June 23 Australia's Steven Smith plays a shot on day one of the second Ashes cricket Test match between England and Australia at Lords cricket ground in London, on June 28, 2023. (Photo: AFP) London: Forced to bat, Australia punished fading England bowling in ideal conditions at Lord’s to post 339-5 by stumps on the first day on Wednesday of the second Ashes test. Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia’s charge with an unbeaten 85. Alex Carey was with him on 11. Smith anchored century stands with Marnus Labuschagne and Travis Head after opening batters David Warner and Usman Khawaja set them up by surviving a tough morning and disruption from Just Stop Oil protesters. Josh Tongue, in his Ashes debut, became the first England bowler to bowl out Australia’s opening batsmen since 1968, and the first at Lord’s since 1884. Another lingering concern for England was No. 3 batter Ollie Pope, who injured his right shoulder making a stop after lunch and didn’t return to the field. England said he was receiving ice treatment. When Ben Stokes won the toss and chose to send in Australia, he would have expected to have a minimum of three wickets by lunch and be batting by the end of the day in England’s bid to level the series. Conditions for the bowlers were that good. The strip was grassy, clouds covered Lord’s all day, and the covers were removed only just before play began after a light drizzle left the air humid and perfect for England’s all-pace attack to swing the ball. England was without a specialist spinner or spin-bowling all-rounder for only the second time in 20 years. The two highest test wicket-takers at Lord’s, James Anderson and Stuart Broad, got plenty of movement on a pitch that was deceptively slow, but couldn’t get a wicket, and wouldn’t all day. Anderson should have had Khawaja out on 1 to a catch at first slip but Joe Root grassed the laces-high chance. Broad should have had Warner — whom he has dismissed 15 times — on 20 but Pope at fourth slip dropped a two-handed catch in front of him. Warner’s mood was lightened just five minutes after the match began when two climate activists ran onto the field to try and spread orange powder on the pitch. Neither got close. England wicketkeeper Jonny Bairstow carried one man on his hip 50 metres back to the boundary, and the other was corralled away from the pitch by Stokes and Warner and captured by stewards. What little orange powder fell in the outfield was quickly vacuumed. Bairstow changed clothes and play resumed five minutes later. But the tension was gone and Warner was playful, drawing grins from his long-time nemesis Broad. Warner had his eighth fifty in England by lunch. Khawaja was watchful. His bat was beaten by Anderson, Broad and Ollie Robinson and he’d made 17 in the stand of 73 when Tongue, on the stroke of lunch, hit Khawaja’s off stump while the Australian shouldered arms. Khawaja was stunned, and so was Warner when his leg stump was bowled by Tongue after lunch on 66. Warner slashed eight boundaries to sit on 1,999 runs in Ashes history. Both opening batters were beaten by pace and swing. Tongue was at least 5 mph (8 kph) quicker than his fellow pacers. Labuschagne and Smith combined for a stand of 102 in stark response to sharing a total of 35 runs at Edgbaston last week. Australia captain Pat Cummins expected a big comeback from his two best batters and they delivered at almost 5 an over. Both batters overturned leg before decisions against them but after their ninth century stand in tests, Labuschagne was out to a good ball by Robinson for 47. In the last 10 tests at Lord’s, the side which batted first was bowled out for under 200. Australia reached 200 only three down. Head joined Smith and needed only 64 balls and 14 boundaries to surpass Smith on 72. Head is vulnerable to the short ball at the start of his innings but England didn’t challenge him, and his fifty off 48 balls was the third fastest by an Australian at Lord’s. Head was out for 77 from 73 balls when he had a swish at Root and was stumped. Cameron Green was the only Australian to give away his wicket when he sliced Root in the same over and was out for a duck. Carey joined Smith, who passed 9,000 runs, the fourth Australian after Allan Border, Steve Waugh and Ricky Ponting. But Smith was grinding towards his 32nd century. Also Read Bumrah bowling seven overs a day at NCA nets, no timeline yet on comeback Officials ‘disappointed’ as major cricket centres miss out on staging WC games Follow Us : Tags ashes Australia England Steve Smith Related News Ashes, 1st Test: Khawaja, Cummins help Australia win thrilling opener, beat England by 2 wickets Ashes, 1st Test: Australia sets up thrilling final day, reach 107/3 at stumps on Day 4 Ashes, 1st Test: Rain brings early halt to play, England 28/2 at stumps on Day 3 Ashes, 1st Test: Khawaja’s first test hundred in England leads Australia fightback on Day 2 EURO 2024 qualifiers: Kane extends scoring record as England rout Malta 4-0 Ashes, 1st Test: Root’s masterclass put hosts in driver’s seat on Day 1","pubDate":"2023-06-28 19:12:38","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Lancashire waste little time finishing off County Championship leaders Surrey","link":"https://www.watfordobserver.co.uk/sport/national/23621166.lancashire-waste-little-time-finishing-off-county-championship-leaders-surrey/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The visitors needed just 45 minutes of the final day to finish off a 123-run victory at the Oval.","content":"Will Williams picked up four for 13 in just 4.3 overs on the final morning as Surrey were routed for 84, while Tom Bailey finished with five for 48. The pair took only 9.3 overs to claim Surrey’s last five second-innings wickets to end a run of first-class games at the Oval in which the Division One leaders have won 12 and drawn the other six. 𝑻𝒉𝒆𝒔𝒆 𝒕𝒘𝒐. 😍 Where do you want your statues, and Will Williams? 🌹 — Lancashire Cricket (@lancscricket) Kent’s spinners finally overcame a late flourish from the Northamptonshire tail to wrap up an innings victory at Wantage Road and climb to eighth in the table. Joe Denly claimed four wickets and Hamid Qadri three as the home side were bowled out for 369 despite an entertaining ninth-wicket stand of 70 between Ben Sanderson and Jack White. In Division Two, a magnificent unbeaten century by Peter Handscomb led a successful rearguard action as Leicestershire secured a draw with leaders Durham. The Australian wicketkeeper-batter finished on 136 not out before bad light ended the contest with the visitors two wickets away from victory with 10 overs left in the match. 𝐌𝐀𝐓𝐂𝐇 𝐃𝐑𝐀𝐖𝐍 A heroic effort by Peter Handscomb, ably supported by Ed Barnes, helps us earn a hard-fought draw on the final day. 👊 Great fight, Foxes. 💚 🦊 — Leicestershire Foxes 🦊 (@leicsccc) Leicestershire, who moved up to second, ended the match on 259 for eight chasing 439, with Durham having earlier declared at 343 for four after Alex Lees (145) and David Bedingham (145 not out) had shared a 243-run stand for the third wicket. Sussex’s last-wicket pairing of Oli Carter and Henry Shipley survived over 20 overs to frustrate Glamorgan and eke out a draw in Cardiff. The visitors finished on 273 for nine, 85 runs behind, with Carter on 55 not out after being dropped from two difficult chances, and number 11 Shipley unbeaten on eight. A very well made fifty for Oli Carter. 🌟 Then a very composed knock to help see the game out. 👏 — Sussex Cricket (@SussexCCC) Worcestershire centurion Gareth Roderick and Ed Pollock batted through sizeable chunks of the final day to thwart Derbyshire’s push for their first victory of the campaign. Roderick battled away for five-and-a-quarter hours to make 123, while Pollock played a knock based on determined defence to register 56 off 189 balls spanning nearly four hours. Their efforts were largely responsible for defying the Derbyshire attack as only four wickets fell in the entire day, which started with the hosts resuming on 70 for two needing another 271 just to make their opponents bat again. A crucial innings full of discipline and determination from 💪 🍐 — Worcestershire County Cricket Club (@WorcsCCC) Gloucestershire all-rounder Ollie Price completed an excellent maiden first-team century during an otherwise low-key final day at Headingley as their clash with Yorkshire finished in a draw. Price moved from 97 not out overnight to reach three figures in the day’s first over as the visitors were bowled out for 464 in reply to a first-innings 550 for nine. He was last man out for 113 off 162 balls to loanee left-arm spinner Dan Moriarty, who finished with five for 139 on his Yorkshire debut. The home side started their second innings with a lead of 86 and reached 200 for six in the 48th over when rain stopped play at 4.30pm.","pubDate":"2023-06-28 19:11:21","image_url":"https://www.watfordobserver.co.uk/resources/images/16941407/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cricket-Australia take firm grip on Lord's test","link":"https://economictimes.indiatimes.com/news/sports/cricket-australia-take-firm-grip-on-lords-test/articleshow/101348278.cms","keywords":null,"creator":null,"video_url":null,"description":"England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series.","content":"Synopsis England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series. Getty Images David Warner and Usman Khawaja (right) LONDON -Steve Smith scored an unbeaten 85 to guide Australia to 339-5 as England wasted favourable bowling conditions on the first day of the second Ashes test at Lord's on Wednesday. England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series. But David Warner and Usman Khawaja rode their luck to share a gritty opening partnership of 73 and although Josh Tongue removed them both, Marnus Labuschagne made 47 and Travis Head a rapid 77 to put Australia in a commanding position. Joe Root dismissed Head and Cameron Green in the same over to give England late hope but the day firmly belonged to Australia. \"Obviously, an amazing day for us, could've been three down and made it an unbelievable day,\" Labuschagne told Sky Sports. \"But still, you're going to take that when you get sent in on a wicket that we thought had a fair bit in it.\" The game was disrupted after one over when two Just Stop Oil protesters ran on to the pitch and sprayed orange powder on to the outfield but Warner and Khawaja were not distracted. They negotiated probing spells from James Anderson and Stuart Broad and, after a short rain delay, Warner reached his fifty by hooking Tongue for six before Khawaja was bowled by the same bowler for 17 just before lunch. Each batsman was dropped in the slips, Khawaja offering a very difficult chance to Root and Warner a sharp one to Ollie Pope. Warner lived dangerously after lunch too, particularly against Tongue who continued his impressive spell by bowling the left-hander through the gate for 66 with a fine swinging delivery to reduce Australia to 96-2. Smith emerged from the pavilion to a chorus of boos but he settled down quickly and silenced the crowd with two sumptuous drives off Broad to the cover boundary. SWIFT REVENGE Broad almost exacted swift revenge when Smith was given out caught by wicketkeeper Jonny Bairstow in the same over for 24 but the batsman reviewed and the decision was overturned. Labuschagne started slowly before finding his rhythm with three fours off one Broad over and when Stokes brought himself on to bowl the Australian right-hander stroked him to the boundary three times. Broad thought he had trapped Labuschagne lbw, the umpire raising his finger before the batsman was reprieved, but the Australian departed shortly after tea, feathering a catch to Bairstow off Ollie Robinson. Head joined Smith and accelerated the scoring rate as the England bowlers tired in the final session. Smith passed fifty and Head reached his half-century off only 48 balls, the pair peppering the boundary rope all around the ground. Head was stumped off Root by Bairstow after scoring 77 off 73 balls and three deliveries later Green aimed an ugly swipe at the spinner to give Anderson a simple catch at mid-off. It was a positive end to a poor day for England in which Stokes looked short of ideas and used few of the innovative field settings which have been a feature of his captaincy. He bowled only three overs and England's hopes of winning back the Ashes are fading after six days of the series. \"Turning up to the game today, green top, overcast conditions, I thought we bowled really well in the first hour. We could've got four or five before lunch,\" Tongue told the BBC. \"I think the new ball is crucial, the first 30 minutes, just hitting that line and length, just try and stay patient and we'll get those wickets when we can.\" Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Wednesday, 28 Jun, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics ET Markets Smart Investing More People See Opportunity When They Look at India Wall Street giant Goldman Sachs' Solomon, 61, said he's not bothered about all the noise, his focus remains on serving clients and the Goldman share price performance. HDFC-HDFC Bank Merger Likely to be Effective July 1 The merger of HDFC Corp with the country's largest private lender HDFC Bank will likely take effect July 1, chairman of India’s mortgage-lending pioneer Deepak Parekh said Tuesday. The combined entity will have an asset base of around ₹18 lakh crore, or in excess of $200 billion. Vested Interests Exploited Hindenburg Report to Manipulate Stocks: Adani Gautam Adani said the Hindenburg Research report on the Adani Group was a “combination of targeted misinformation and outdated, discredited allegations”. Vested interests used the report to manipulate Adani Group stocks, he said in the annual report of flagship Adani Enterprises released on Tuesday. Read More News on warner Ashes Test Steve Smith Marnus Labuschagne Australia control khawaja stuart broad (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Under the lens The number games: from cash-flow cons to misleading metrics, spotting jugglery in financial data 5 mins read Markets Indians are borrowing for SUVs instead of homes. Lure of bigger cars, lower EMIs fuelling it. 6 mins read 3 insights to kick-start your day: featuring the continuing Google-NCLAT battle 3 mins read Subscribe to ETPrime","pubDate":"2023-06-28 18:50:53","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-44006,resizemode-4,msid-101348278/cricket-australia-take-firm-grip-on-lords-test.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"2nd Test, Day 1: Smith Stars For Australia Before Root Revives England","link":"https://sports.ndtv.com/cricket/england-vs-australia-2nd-ashes-test-steve-smith-stars-for-australia-before-joe-root-double-revives-england-on-day-1-4161522","keywords":null,"creator":null,"video_url":null,"description":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday.","content":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday. But off-spinner Joe Root, better known as the number one-ranked batsman in Test cricket, took two wickets in four balls late in the day. His double strike ensured Ashes-holders Australia, 1-0 up in the five-match series after a thrilling two-wicket win at Edgbaston last week, did not have things all their own way at the 'Home of Cricket'. Australia were in a commanding position at 316-3, despite being sent into bat by England captain Ben Stokes in overcast conditions and on a green tinged-pitch that promised to aid his five-strong pace attack. But dashing left-hander Travis Head, scoring at better than a run-a-ball, then charged down the pitch only to be beaten by a sharply turning Root delivery with Jonny Bairstow, whose wicketkeeping had proved fallible in Birmingham, completing an excellent stumping. Head was out for 77 following a stand of 118 with Smith where England were given a taste of their own 'Bazball' medicine. But three balls later, Australia's 316-4 became 316-5 when Cameron Green fell for a duck, slicing Root to James Anderson at mid-off. At stumps Root, the only spinner in the attack after England dropped Moeen Ali, had figures of 2-19 from eight overs. Fast bowler Josh Tongue, recalled in place of Moeen, removed Australia left-handed openers Usman Khawaja and David Warner, who made a valuable 66, in a return of 2-88 in 18 overs. The match was briefly halted before the second over when two Just Stop Oil protesters ran out of the Grandstand and onto the outfield, sprinkling the environmental pressure group's trademark orange powder on the square but not on the pitch. Bairstow grabbed one of the demonstrators and carried them off the playing surface, with the other apprehended by stewards. Advertisement A third demonstrator was tackled before making it onto the outfield, with the police making three arrests. Pope injury scare England's aggressive 'Bazball' approach had come under scrutiny in Birmingham, but missing several chances was a bigger factor in their defeat. On Wednesday, Stuart Broad, who has long troubled Warner in Ashes contests, had him edging into the cordon on 20, only for fourth slip Ollie Pope, who later went off injured with a shoulder injury, to drop a two-handed catch. Warner cashed in with a 66-ball fifty completed when he pulled Tongue, in just his second Test, for six. But off what became the last ball before lunch Tongue bowled Khawaja fresh from his hundred at Edgbaston, playing no shot. Warner also fell to Tongue, bowled between bat and pad by a ball that cut back sharply off the pitch. England for all Australia's playing and missing, did not help themselves by giving away 36 runs in extras, including 12 no-balls. Smith stuck Stuart Broad through the covers for two fours off successive balls then successfully overturned a caught-behind decision off the next delivery on his way to a 102-ball fifty. Broad also had Marnus Labuschagne lbw, playing no shot, before another successful Australian review indicated the ball would have cleared the top of the stumps. Stokes brought himself on in the hope of a breakthrough but it was not long before Smith confidently flicked him through midwicket for four to go to 9,000 runs in Test cricket. Smith and Labuschagne, until recently the world's two top-ranked Test batsmen, had managed just 35 runs between them across four innings at Edgbaston. But on Wednesday their century partnership was ended when Labuschagne was caught behind for 47 off an excellent full-length delivery from Ollie Robinson to leave Australia 198-3. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-28 18:26:35","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Women's Head Coach to Be Picked on June 30, Ajit Agarkar Frontrunner for Men's Team Chief Selector's Post","link":"https://www.latestly.com/agency-news/sports-news-indian-womens-head-coach-to-be-picked-on-june-30-agarkar-frontrunner-for-chief-selectors-post-5232345.html","keywords":null,"creator":null,"video_url":null,"description":"The shortlist for the Indian women team's head coach job includes Amol Muzumdar and Tushar Arothe, who are among those to be interviewed on June 30. After picking the head coach for the women's team on Friday, the CAC is likely to appoint the chief selector for the Indian men's team","content":"The shortlist for the Indian women team's head coach job includes Amol Muzumdar and Tushar Arothe, who are among those to be interviewed on June 30. While Arothe has coached the Indian team in the past, Muzumdar, who is also in talks to become Baroda coach, has had stints with IPL franchise Rajasthan Royals and the South African national team. It has also been learnt that Englishman and ex-Durham head coach, Jon Lewis has also applied for the job. The Cricket Advisory Committee comprising Ashok Malhotra, Jatin Paranjpe and Sulakshana Naik will conduct the interviews in Mumbai. \"The interviews will be conducted on Friday,\" a BCCI official told PTI. The Harmanpreet Kaur-led India, guilty of throwing away knock out games from winning positions in multi-team events over the past five years, has been without a head coach since Ramesh Powar was sacked in December. Batting coach Hrishikesh Kanitkar was in charge of the team in the T20 World Cup in South Africa earlier this year. India have a tour of Bangladesh scheduled next month and the announcement on the head coach's front will be made before that. \"I don't think bringing back Tushar will be a good choice. The team needs someone with fresh ideas. Someone like Amol is the right person to take the team forward. \"The management needs to build a big pool of players before the T20 World Cup next year which will also be held in Bangladesh,\" said a former India player. After picking the head coach for the women's team on Friday, the CAC is likely to appoint the chief selector for the Indian men's team — a post that has been vacant since Chetan Sharma's unceremonious exit in February. The last date of application is June 30 and the interviews are likely to be held on July 1. \"The CAC has the mandate to pick a selector who can stand up to the high-profile team management in case there are differences,\" added the BCCI official. Agarkar was linked to the chief selector's post in the past as well, but this time, he is likely to get the high-pressure job. If Agarkar is appointed, there will be two selectors from the West Zone, with Salil Ankola being the other. The 45-year-old played 26 Tests, 191 ODIs and 4 T20s for India. He was a part of the Delhi Capitals' support staff in the recently held IPL. PTI","pubDate":"2023-06-28 18:18:09","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023, Eng vs Aus 2nd Test Day 1 Stumps: पहले दिन का खेल हुआ खत्म, शतक के करीब स्टीव स्मिथ; ऑस्ट्रेलिया का स्कोर 339/5","link":"https://hindi.latestly.com/socially/sports/cricket/ashes-2023-eng-vs-aus-2nd-test-day-1-stumps-first-days-play-over-steve-smith-close-to-century-australias-score-3395-1849157.html","keywords":null,"creator":null,"video_url":null,"description":"एशेज सीरीज के दूसरे टेस्ट मैच में इंग्लैंड की भिड़ंत ऑस्ट्रेलिया के साथ हो रही है. दोनों टीमों के बीच यह मुकाबला लॉर्ड्स के मैदान पर खेला जा रहा है. पहले टेस्ट ऑस्ट्रेलिया ने दो विकेट से जीतकर सीरीज में 1-0 की बढ़त बना ली हैं.दूसरे टेस्ट में इंग्लैंड के कप्तान बेन स्टोक्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया.","content":"एशेज सीरीज के दूसरे टेस्ट मैच में इंग्लैंड की भिड़ंत ऑस्ट्रेलिया के साथ हो रही है. दोनों टीमों के बीच यह मुकाबला लॉर्ड्स के मैदान पर खेला जा रहा है. पहले टेस्ट ऑस्ट्रेलिया ने दो विकेट से जीतकर सीरीज में 1-0 की बढ़त बना ली हैं.दूसरे टेस्ट में इंग्लैंड के कप्तान बेन स्टोक्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. दूसरे टेस्ट के पहले दिन का खेल खत्म हो गया हैं. दूसरे दिन का खेल खत्म होने तक ऑस्ट्रेलिया ने 88 ओवर में पांच विकेट खोकर 339 रन बना लिए हैं. स्टीव स्मिथ 85 रन और एलेक्स कैरी 11 रन बनाकर खेल रहे हैं. - Australia 339 for 5. - 4.08 Run-rate. - Steve Smith stands tall with 85*. Lost the toss, batting first and Australia has taken Day 1 at Lord's. — Johns. (@CricCrazyJohns)","pubDate":"2023-06-28 18:15:32","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia punish lacklustre England seamers before Joe Root produces late boost","link":"https://www.watfordobserver.co.uk/sport/national/23621132.australia-punish-lacklustre-england-seamers-joe-root-produces-late-boost/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The hosts failed to make the most of Ben Stokes winning the toss in helpful conditions.","content":"Desperate to produce a statement of intent after their tense two-wicket defeat at Edgbaston, the hosts failed to make the most of Ben Stokes winning the toss in helpful conditions as Australia reached the close on 339 for five. It could have been much worse for the hosts but Root, asked to carry the spin burden alone due to concerns over Moeen Ali’s injured index finger, halted the tide just as it threatened to carry England away. Travis Head had clattered 77 at better than a run-a-ball when he was stumped racing down the track at a delivery that started wide and turned even further from the bat, then all-rounder Cameron Green threw his wicket away for a duck in a vain attempt to slog Root down the ground. Joe Root strikes twice in an over and Australia are 5️⃣ down! | — England Cricket (@englandcricket) Two cheap wickets in four balls did not completely mitigate two-and-a-half sessions of deeply uninspired work from a lethargic seam attack, but it did halt a 122-run stand between Head and Steve Smith that was quickly heading towards game-changing territory. Smith remains at large on 85 not out and with the chance to bat England out of the match on day two. Prior to Root’s unexpected intervention, England had relied on rookie seamer Josh Tongue for two of their three wickets as James Anderson, Stuart Broad, Ollie Robinson and Stokes himself all toiled without success. Tongue produced two fine deliveries to clean bowl both openers, Usman Khawaja offering no stroke on the cusp of lunch and David Warner (66) cut in two by a gem, but even he was not exempt from the travails which swamped his team-mates. The 25-year-old went at 4.88 over the course of the day, with Broad wicketless and Robinson visibly down on pace as he returned one for 86. England make late inroads, but Australia are on top at stumps on day one 💪 | 📝: — ICC (@ICC) Stokes’ three-over cameo cost him 21 and although Anderson kept a lid on the scoring, he was worrying subdued for the third innings in a row. Stokes could hardly disguise his grin when Pat Cummins called incorrectly at the toss, eagerly sending the tourists in under cloudy skies on a green-tinged pitch. When the floodlights came on just before the start of play, the scene seemed set for the home attack to have some fun, but the anticipated clatter of wickets failed to materialise. The game was interrupted after a solitary Anderson over when two Just Stop Oil protesters invaded the pitch brandishing orange paint powder, an incursion that ended with wicketkeeper Jonny Bairstow lifting one of the activists off his feet and carrying him off the pitch while Stokes shepherded the other into the arms of security. Warner and Khawaja did not allow the break to disrupt their concentration, although the latter offered a low half-chance off Broad that Root would have done outstandingly to hold. The bowling looked laboured at times, with Robinson struggling to crack 80mph, but Broad should have picked up Warner on 20 when Ollie Pope put down a regulation edge at fourth slip, an echo of missed opportunities in the first Test. Pope spent the latter half of the day off the field receiving ice treatment for a shoulder injury and England will hope their vice-captain’s batting is not affected by the issue. Warner sought to impose himself, bending the knee to sweep Broad and Robinson and hooking Tongue for six as his first three overs leaked 24 runs. But he showed plenty of character to get his side up and running either side of lunch. He dismissed Khawaja moments before the break, nipping one down the slope and into the off stump, and saved something even better for Warner after the restart. He put together a deliciously difficult over to the left-hander and capped it in style with one that speared between bat and pad as it flicked the bails. That brought Smith and Marnus Labuschagne together, fresh from the pair’s double failure at Lord’s. Smith was busy immediately but Labuschagne was shaky until a sequence of five boundaries from eight legal deliveries warmed him up. Both were well settled as they took tea at 190 for two, but Robinson finally got himself into the contest in the evening session when he got one to stand up off the seam and take Labuschagne’s outside edge for 47. England briefly had an opening, but a whirlwind knock from Head closed it emphatically. He laid into a tiring attack with gusto, hitting 14 boundaries as weariness and sloppy fielding began to take a toll. With Smith showing signs of tunnel vision and a couple of DRS decisions correctly going against England, it took unforced error to lift Stokes’ side. Root was apparently biding time until the second new ball but found a some bite from the rough and tempted Head into a rash charge. Bairstow did the rest with a smart take and stumping, before Green hacked his third ball high to mid-off to take some of the shine off a strong day for Australia.","pubDate":"2023-06-28 18:11:32","image_url":"https://www.watfordobserver.co.uk/resources/images/16941343/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Olympic leaders in Brisbane promote policies to keep 2032 Games safe from financial wrongdoing","link":"https://japantoday.com/category/sports/olympic-leaders-in-brisbane-promote-policies-to-keep-2032-games-safe-from-financial-wrongdoing","keywords":null,"creator":null,"video_url":null,"description":"Olympic organizers from Australia said Wednesday they have safeguards in place to stop the 2032 Brisbane Games ever joining Paris, Tokyo and Rio de Janeiro under investigation for…","content":"Olympic organizers from Australia said Wednesday they have safeguards in place to stop the 2032 Brisbane Games ever joining Paris, Tokyo and Rio de Janeiro under investigation for financial wrongdoing. One week after Paris authorities raided offices and homes linked to organizing the 2024 Olympics, Brisbane officials were at the IOC in Switzerland for a first detailed progress meeting on their own project. Brisbane would be “standing tall in the highest standards,” organizing committee president Andrew Liveris told reporters in an online briefing. “We have to. In fact, if we don’t do that then we should not be there,” he said, pointing to “a robust fraud and code of conduct policy” already in place with compliance training for senior management. In Paris, Olympic officials are under scrutiny for suspected favoritism in how contracts were awarded rather than the kind of bribery that tainted Rio de Janeiro in 2016 and Tokyo held in 2021. A Summer Games typically involves hundreds of contracts linked to the multi-billion dollar operations for organizers, plus billions more in construction and security costs mostly met by taxpayers. “We’re subject to Queensland government procurement standards,” Liveris said of Brisbane’s home state. Brisbane organizers’ operating budget is set at 5 billion Australian dollars ($3.3 billion). The IOC contributes cash and services that amounted to nearly $1.9 billion for Tokyo. Organizers’ revenue including ticket, sponsorship and merchandise sales has a target set at $1.7 billion (2.5 billion Australian dollars), Brisbane 2032 chief executive Cindy Hook said. Liveris acknowledged that by global standards Australia is a “small commercial market” while Brisbane and Queensland have to build their reputation for a high standard of living. “We have a wonderful part of the world but not as well-known as maybe it needs to be,” he said. “So that means we have to find innovative ways to bring sponsors to the table.” Big-ticket projects for 2032 include the federally backed Brisbane Arena that will later stage swimming and a state-funded rebuild of the storied cricket ground known as the Gabba. It will host track and field and potentially the opening and closing ceremonies. “There is no commitment there to make that cost neutral to the taxpayer because that’s for the taxpayers’ benefit,” Liveris said. Brisbane also seeks inspiration from the 2000 Sydney Olympics that was a stage for Cathy Freeman, who lit the cauldron and then ran to 400-meter gold, who has Indigenous Australian family roots. Liveris set a target of “the most inclusive games ever, with great equal access with all, with a strong and special emphasis on First Nations and celebrating the world’s oldest living culture.”","pubDate":"2023-06-28 21:32:41","image_url":null,"source_id":"japantoday","category":["sports"],"country":["japan"],"language":"english"},{"title":"News24.com | Smith stars for Australia before Root double revives England in 2nd Test","link":"https://www.news24.com/sport/Cricket/smith-stars-for-australia-before-root-double-revives-england-in-2nd-test-20230628","keywords":null,"creator":null,"video_url":null,"description":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday.","content":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday. STUMPS | England v Australia - 2nd Test, Day 1 But off-spinner Joe Root, better known as the number one-ranked batsman in Test cricket, took two wickets in four balls late in the day. His double strike ensured Ashes-holders Australia, 1-0 up in the five-match series after a thrilling two-wicket win at Edgbaston last week, did not have things all their own way at the 'Home of Cricket'. Australia were in a commanding position at 316-3, despite being sent into bat by England captain Ben Stokes in overcast conditions and on a green tinged-pitch that promised to aid his five-strong pace attack. But dashing left-hander Travis Head, scoring at better than a run-a-ball, then charged down the pitch only to be beaten by a sharply turning Root delivery with Jonny Bairstow, whose wicketkeeping had proved fallible in Birmingham, completing an excellent stumping. Head was out for 77 following a stand of 118 with Smith where England were given a taste of their own 'Bazball' medicine. But three balls later, Australia's 316-4 became 316-5 when Cameron Green fell for a duck, slicing Root to James Anderson at mid-off. At stumps Root, the only spinner in the attack after England dropped Moeen Ali, had figures of 2-19 from eight overs. Fast bowler Josh Tongue, recalled in place of Moeen, removed Australia left-handed openers Usman Khawaja and David Warner, who made a valuable 66, in a return of 2-88 in 18 overs. The match was briefly halted before the second over when two Just Stop Oil protesters ran out of the Grandstand and onto the outfield, sprinkling the environmental pressure group's trademark orange powder on the square but not on the pitch. Bairstow grabbed one of the demonstrators and carried them off the playing surface, with the other apprehended by stewards. A third demonstrator was tackled before making it onto the outfield, with the police making three arrests. England's aggressive 'Bazball' approach had come under scrutiny in Birmingham, but missing several chances was a bigger factor in their defeat. On Wednesday, Stuart Broad, who has long troubled Warner in Ashes contests, had him edging into the cordon on 20, only for fourth slip Ollie Pope, who later went off injured with a shoulder injury, to drop a two-handed catch. Warner cashed in with a 66-ball fifty completed when he pulled Tongue, in just his second Test, for six. But off what became the last ball before lunch Tongue bowled Khawaja fresh from his hundred at Edgbaston, playing no shot. Warner also fell to Tongue, bowled between bat and pad by a ball that cut back sharply off the pitch. England for all Australia's playing and missing, did not help themselves by giving away 36 runs in extras, including 12 no-balls. Smith stuck Stuart Broad through the covers for two fours off successive balls then successfully overturned a caught-behind decision off the next delivery on his way to a 102-ball fifty. Broad also had Marnus Labuschagne lbw, playing no shot, before another successful Australian review indicated the ball would have cleared the top of the stumps. Stokes brought himself on in the hope of a breakthrough but it was not long before Smith confidently flicked him through midwicket for four to go to 9,000 runs in Test cricket. Smith and Labuschagne, until recently the world's two top-ranked Test batsmen, had managed just 35 runs between them across four innings at Edgbaston. But on Wednesday their century partnership was ended when Labuschagne was caught behind for 47 off an excellent full-length delivery from Ollie Robinson to leave Australia 198-3.","pubDate":"2023-06-28 19:32:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Absolutely shambolic – Kevin Pietersen rips into England after day one at Lord’s","link":"https://www.watfordobserver.co.uk/sport/national/23621180.absolutely-shambolic---kevin-pietersen-rips-england-day-one-lords/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Pietersen offered a stinging assessment of England’s efforts with the ball.","content":"Pietersen, who was given the honour of ringing the bell before the start of play, offered a stinging assessment of England’s efforts with the ball after the tourists reached the close on 339 for five. Only two late wickets in four balls from part-time spinner Joe Root prevented the end-of-play scorecard looking even worse, Travis Head and Cameron Green both falling to unforced errors. A scattering of live green grass and overhead clouds that were gloomy enough to warrant floodlights throughout the day appeared to hint at ideal conditions for England’s five-strong seam attack, but it was the tourists who dictated the tone as half-centuries from David Warner (66), Travis Head (77) and Steve Smith (85no) left them well placed. “Not a lot’s caught my eye from an English perspective, it’s been shambolic. Absolutely shambolic,” the 104-cap veteran told Sky Sports. “You have overhead conditions, you have wickets that suit your bowlers and you’ve got bowlers running in at 78, 79, 80 miles an hour. “Now it’s one thing walking here, swanning around, saying ‘this is a wonderful team to play in, we’re creating the best environment’. But this is not Ashes cricket.” Pietersen also took issue with an apparent lack of edge on the field – just a week on from Australian criticism over Ollie Robinson’s expletive-filled send-off of Usman Khawaja at Edgbaston. “It’s all too easy, too nice. Are you telling me Ricky Ponting in 2005 is going to be talking to Geraint Jones? You think Michael Vaughan is going to be stood next to Justin Langer saying ‘hey mate, what a cool day, it’s overcast, it’s beautiful, what an awesome day, environment here at Lord’s – what do you think of the wicket’? “Are you joking? Are you absolutely joking? I just hope they’re in their dressing room now and the England coach is giving them the biggest hammering and saying it’s absolutely not good enough.” Josh Tongue was the pick of the five English quicks on his first Ashes outing, topping the pace charts and snapping up the wickets of Khawaja and David Warner either side of the lunch break. The 25-year-old saw his first three overs smacked for 24 but revealed a word of advice from Ollie Robinson about utilising the famous Lord’s slope helped him open his account against Australia. “I spoke to Robbo just before lunch about trying to use the slope a bit more,” said Tongue. “I was trying to wobble it away from the bat and he said ‘why don’t you try and get the ball coming back into him’. Getting Khawaja just before lunch was crucial and then, obviously, I was trying to do the same to David. “He’s a very hard batter to bowl at. If you miss your length you’re going to the boundary, that’s how I felt, so the wicket came at a very good time for the team.” Invited to rate the Warner dismissal, which skidded between bat and pad and lifted the bails with precision to cap an outstanding over, Tongue added: “I haven’t properly looked back yet, but listening to the lads it was a very good ball.” Warner opted to shine a light on Head’s performance after the latter hit 14 boundaries to pile the pressure on England in the evening session. “Trav is Trav, that’s the way he plays,” he said. “It’s exciting and we’re just lucky he’s on our team. He can take it away from you. Striking at over a hundred is exceptional. He just finds a way.”","pubDate":"2023-06-28 19:31:54","image_url":"https://www.watfordobserver.co.uk/resources/images/16941422/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ashes, 2nd Test: Steve Smith remains unbeaten on 85, Australia post 339/5 at stumps on Day 1","link":"https://telanganatoday.com/ashes-2nd-test-steve-smith-remains-unbeaten-on-85-australia-post-339-5-at-stumps-on-day-1","keywords":["News","Sport","ashes","Australia","England","Steve Smith"],"creator":["AP"],"video_url":null,"description":"Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia's charge with an unbeaten 85","content":"Home | Sport | Ashes 2nd Test Steve Smith Remains Unbeaten On 85 Australia Post 339 5 At Stumps On Day 1 Ashes, 2nd Test: Steve Smith remains unbeaten on 85, Australia post 339/5 at stumps on Day 1 Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia's charge with an unbeaten 85 By AP Updated On - 12:44 AM, Thu - 29 June 23 Australia's Steven Smith plays a shot on day one of the second Ashes cricket Test match between England and Australia at Lords cricket ground in London, on June 28, 2023. (Photo: AFP) London: Forced to bat, Australia punished fading England bowling in ideal conditions at Lord’s to post 339-5 by stumps on the first day on Wednesday of the second Ashes test. Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia’s charge with an unbeaten 85. Alex Carey was with him on 11. Smith anchored century stands with Marnus Labuschagne and Travis Head after opening batters David Warner and Usman Khawaja set them up by surviving a tough morning and disruption from Just Stop Oil protesters. Josh Tongue, in his Ashes debut, became the first England bowler to bowl out Australia’s opening batsmen since 1968, and the first at Lord’s since 1884. Another lingering concern for England was No. 3 batter Ollie Pope, who injured his right shoulder making a stop after lunch and didn’t return to the field. England said he was receiving ice treatment. When Ben Stokes won the toss and chose to send in Australia, he would have expected to have a minimum of three wickets by lunch and be batting by the end of the day in England’s bid to level the series. Conditions for the bowlers were that good. The strip was grassy, clouds covered Lord’s all day, and the covers were removed only just before play began after a light drizzle left the air humid and perfect for England’s all-pace attack to swing the ball. England was without a specialist spinner or spin-bowling all-rounder for only the second time in 20 years. The two highest test wicket-takers at Lord’s, James Anderson and Stuart Broad, got plenty of movement on a pitch that was deceptively slow, but couldn’t get a wicket, and wouldn’t all day. Anderson should have had Khawaja out on 1 to a catch at first slip but Joe Root grassed the laces-high chance. Broad should have had Warner — whom he has dismissed 15 times — on 20 but Pope at fourth slip dropped a two-handed catch in front of him. Warner’s mood was lightened just five minutes after the match began when two climate activists ran onto the field to try and spread orange powder on the pitch. Neither got close. England wicketkeeper Jonny Bairstow carried one man on his hip 50 metres back to the boundary, and the other was corralled away from the pitch by Stokes and Warner and captured by stewards. What little orange powder fell in the outfield was quickly vacuumed. Bairstow changed clothes and play resumed five minutes later. But the tension was gone and Warner was playful, drawing grins from his long-time nemesis Broad. Warner had his eighth fifty in England by lunch. Khawaja was watchful. His bat was beaten by Anderson, Broad and Ollie Robinson and he’d made 17 in the stand of 73 when Tongue, on the stroke of lunch, hit Khawaja’s off stump while the Australian shouldered arms. Khawaja was stunned, and so was Warner when his leg stump was bowled by Tongue after lunch on 66. Warner slashed eight boundaries to sit on 1,999 runs in Ashes history. Both opening batters were beaten by pace and swing. Tongue was at least 5 mph (8 kph) quicker than his fellow pacers. Labuschagne and Smith combined for a stand of 102 in stark response to sharing a total of 35 runs at Edgbaston last week. Australia captain Pat Cummins expected a big comeback from his two best batters and they delivered at almost 5 an over. Both batters overturned leg before decisions against them but after their ninth century stand in tests, Labuschagne was out to a good ball by Robinson for 47. In the last 10 tests at Lord’s, the side which batted first was bowled out for under 200. Australia reached 200 only three down. Head joined Smith and needed only 64 balls and 14 boundaries to surpass Smith on 72. Head is vulnerable to the short ball at the start of his innings but England didn’t challenge him, and his fifty off 48 balls was the third fastest by an Australian at Lord’s. Head was out for 77 from 73 balls when he had a swish at Root and was stumped. Cameron Green was the only Australian to give away his wicket when he sliced Root in the same over and was out for a duck. Carey joined Smith, who passed 9,000 runs, the fourth Australian after Allan Border, Steve Waugh and Ricky Ponting. But Smith was grinding towards his 32nd century. Also Read Bumrah bowling seven overs a day at NCA nets, no timeline yet on comeback Officials ‘disappointed’ as major cricket centres miss out on staging WC games Follow Us : Tags ashes Australia England Steve Smith Related News Ashes, 1st Test: Khawaja, Cummins help Australia win thrilling opener, beat England by 2 wickets Ashes, 1st Test: Australia sets up thrilling final day, reach 107/3 at stumps on Day 4 Ashes, 1st Test: Rain brings early halt to play, England 28/2 at stumps on Day 3 Ashes, 1st Test: Khawaja’s first test hundred in England leads Australia fightback on Day 2 EURO 2024 qualifiers: Kane extends scoring record as England rout Malta 4-0 Ashes, 1st Test: Root’s masterclass put hosts in driver’s seat on Day 1","pubDate":"2023-06-28 19:12:38","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Lancashire waste little time finishing off County Championship leaders Surrey","link":"https://www.watfordobserver.co.uk/sport/national/23621166.lancashire-waste-little-time-finishing-off-county-championship-leaders-surrey/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The visitors needed just 45 minutes of the final day to finish off a 123-run victory at the Oval.","content":"Will Williams picked up four for 13 in just 4.3 overs on the final morning as Surrey were routed for 84, while Tom Bailey finished with five for 48. The pair took only 9.3 overs to claim Surrey’s last five second-innings wickets to end a run of first-class games at the Oval in which the Division One leaders have won 12 and drawn the other six. 𝑻𝒉𝒆𝒔𝒆 𝒕𝒘𝒐. 😍 Where do you want your statues, and Will Williams? 🌹 — Lancashire Cricket (@lancscricket) Kent’s spinners finally overcame a late flourish from the Northamptonshire tail to wrap up an innings victory at Wantage Road and climb to eighth in the table. Joe Denly claimed four wickets and Hamid Qadri three as the home side were bowled out for 369 despite an entertaining ninth-wicket stand of 70 between Ben Sanderson and Jack White. In Division Two, a magnificent unbeaten century by Peter Handscomb led a successful rearguard action as Leicestershire secured a draw with leaders Durham. The Australian wicketkeeper-batter finished on 136 not out before bad light ended the contest with the visitors two wickets away from victory with 10 overs left in the match. 𝐌𝐀𝐓𝐂𝐇 𝐃𝐑𝐀𝐖𝐍 A heroic effort by Peter Handscomb, ably supported by Ed Barnes, helps us earn a hard-fought draw on the final day. 👊 Great fight, Foxes. 💚 🦊 — Leicestershire Foxes 🦊 (@leicsccc) Leicestershire, who moved up to second, ended the match on 259 for eight chasing 439, with Durham having earlier declared at 343 for four after Alex Lees (145) and David Bedingham (145 not out) had shared a 243-run stand for the third wicket. Sussex’s last-wicket pairing of Oli Carter and Henry Shipley survived over 20 overs to frustrate Glamorgan and eke out a draw in Cardiff. The visitors finished on 273 for nine, 85 runs behind, with Carter on 55 not out after being dropped from two difficult chances, and number 11 Shipley unbeaten on eight. A very well made fifty for Oli Carter. 🌟 Then a very composed knock to help see the game out. 👏 — Sussex Cricket (@SussexCCC) Worcestershire centurion Gareth Roderick and Ed Pollock batted through sizeable chunks of the final day to thwart Derbyshire’s push for their first victory of the campaign. Roderick battled away for five-and-a-quarter hours to make 123, while Pollock played a knock based on determined defence to register 56 off 189 balls spanning nearly four hours. Their efforts were largely responsible for defying the Derbyshire attack as only four wickets fell in the entire day, which started with the hosts resuming on 70 for two needing another 271 just to make their opponents bat again. A crucial innings full of discipline and determination from 💪 🍐 — Worcestershire County Cricket Club (@WorcsCCC) Gloucestershire all-rounder Ollie Price completed an excellent maiden first-team century during an otherwise low-key final day at Headingley as their clash with Yorkshire finished in a draw. Price moved from 97 not out overnight to reach three figures in the day’s first over as the visitors were bowled out for 464 in reply to a first-innings 550 for nine. He was last man out for 113 off 162 balls to loanee left-arm spinner Dan Moriarty, who finished with five for 139 on his Yorkshire debut. The home side started their second innings with a lead of 86 and reached 200 for six in the 48th over when rain stopped play at 4.30pm.","pubDate":"2023-06-28 19:11:21","image_url":"https://www.watfordobserver.co.uk/resources/images/16941407/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cricket-Australia take firm grip on Lord's test","link":"https://economictimes.indiatimes.com/news/sports/cricket-australia-take-firm-grip-on-lords-test/articleshow/101348278.cms","keywords":null,"creator":null,"video_url":null,"description":"England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series.","content":"Synopsis England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series. Getty Images David Warner and Usman Khawaja (right) LONDON -Steve Smith scored an unbeaten 85 to guide Australia to 339-5 as England wasted favourable bowling conditions on the first day of the second Ashes test at Lord's on Wednesday. England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series. But David Warner and Usman Khawaja rode their luck to share a gritty opening partnership of 73 and although Josh Tongue removed them both, Marnus Labuschagne made 47 and Travis Head a rapid 77 to put Australia in a commanding position. Joe Root dismissed Head and Cameron Green in the same over to give England late hope but the day firmly belonged to Australia. \"Obviously, an amazing day for us, could've been three down and made it an unbelievable day,\" Labuschagne told Sky Sports. \"But still, you're going to take that when you get sent in on a wicket that we thought had a fair bit in it.\" The game was disrupted after one over when two Just Stop Oil protesters ran on to the pitch and sprayed orange powder on to the outfield but Warner and Khawaja were not distracted. They negotiated probing spells from James Anderson and Stuart Broad and, after a short rain delay, Warner reached his fifty by hooking Tongue for six before Khawaja was bowled by the same bowler for 17 just before lunch. Each batsman was dropped in the slips, Khawaja offering a very difficult chance to Root and Warner a sharp one to Ollie Pope. Warner lived dangerously after lunch too, particularly against Tongue who continued his impressive spell by bowling the left-hander through the gate for 66 with a fine swinging delivery to reduce Australia to 96-2. Smith emerged from the pavilion to a chorus of boos but he settled down quickly and silenced the crowd with two sumptuous drives off Broad to the cover boundary. SWIFT REVENGE Broad almost exacted swift revenge when Smith was given out caught by wicketkeeper Jonny Bairstow in the same over for 24 but the batsman reviewed and the decision was overturned. Labuschagne started slowly before finding his rhythm with three fours off one Broad over and when Stokes brought himself on to bowl the Australian right-hander stroked him to the boundary three times. Broad thought he had trapped Labuschagne lbw, the umpire raising his finger before the batsman was reprieved, but the Australian departed shortly after tea, feathering a catch to Bairstow off Ollie Robinson. Head joined Smith and accelerated the scoring rate as the England bowlers tired in the final session. Smith passed fifty and Head reached his half-century off only 48 balls, the pair peppering the boundary rope all around the ground. Head was stumped off Root by Bairstow after scoring 77 off 73 balls and three deliveries later Green aimed an ugly swipe at the spinner to give Anderson a simple catch at mid-off. It was a positive end to a poor day for England in which Stokes looked short of ideas and used few of the innovative field settings which have been a feature of his captaincy. He bowled only three overs and England's hopes of winning back the Ashes are fading after six days of the series. \"Turning up to the game today, green top, overcast conditions, I thought we bowled really well in the first hour. We could've got four or five before lunch,\" Tongue told the BBC. \"I think the new ball is crucial, the first 30 minutes, just hitting that line and length, just try and stay patient and we'll get those wickets when we can.\" Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Wednesday, 28 Jun, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics ET Markets Smart Investing More People See Opportunity When They Look at India Wall Street giant Goldman Sachs' Solomon, 61, said he's not bothered about all the noise, his focus remains on serving clients and the Goldman share price performance. HDFC-HDFC Bank Merger Likely to be Effective July 1 The merger of HDFC Corp with the country's largest private lender HDFC Bank will likely take effect July 1, chairman of India’s mortgage-lending pioneer Deepak Parekh said Tuesday. The combined entity will have an asset base of around ₹18 lakh crore, or in excess of $200 billion. Vested Interests Exploited Hindenburg Report to Manipulate Stocks: Adani Gautam Adani said the Hindenburg Research report on the Adani Group was a “combination of targeted misinformation and outdated, discredited allegations”. Vested interests used the report to manipulate Adani Group stocks, he said in the annual report of flagship Adani Enterprises released on Tuesday. Read More News on warner Ashes Test Steve Smith Marnus Labuschagne Australia control khawaja stuart broad (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Under the lens The number games: from cash-flow cons to misleading metrics, spotting jugglery in financial data 5 mins read Markets Indians are borrowing for SUVs instead of homes. Lure of bigger cars, lower EMIs fuelling it. 6 mins read 3 insights to kick-start your day: featuring the continuing Google-NCLAT battle 3 mins read Subscribe to ETPrime","pubDate":"2023-06-28 18:50:53","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-44006,resizemode-4,msid-101348278/cricket-australia-take-firm-grip-on-lords-test.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"2nd Test, Day 1: Smith Stars For Australia Before Root Revives England","link":"https://sports.ndtv.com/cricket/england-vs-australia-2nd-ashes-test-steve-smith-stars-for-australia-before-joe-root-double-revives-england-on-day-1-4161522","keywords":null,"creator":null,"video_url":null,"description":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday.","content":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday. But off-spinner Joe Root, better known as the number one-ranked batsman in Test cricket, took two wickets in four balls late in the day. His double strike ensured Ashes-holders Australia, 1-0 up in the five-match series after a thrilling two-wicket win at Edgbaston last week, did not have things all their own way at the 'Home of Cricket'. Australia were in a commanding position at 316-3, despite being sent into bat by England captain Ben Stokes in overcast conditions and on a green tinged-pitch that promised to aid his five-strong pace attack. But dashing left-hander Travis Head, scoring at better than a run-a-ball, then charged down the pitch only to be beaten by a sharply turning Root delivery with Jonny Bairstow, whose wicketkeeping had proved fallible in Birmingham, completing an excellent stumping. Head was out for 77 following a stand of 118 with Smith where England were given a taste of their own 'Bazball' medicine. But three balls later, Australia's 316-4 became 316-5 when Cameron Green fell for a duck, slicing Root to James Anderson at mid-off. At stumps Root, the only spinner in the attack after England dropped Moeen Ali, had figures of 2-19 from eight overs. Fast bowler Josh Tongue, recalled in place of Moeen, removed Australia left-handed openers Usman Khawaja and David Warner, who made a valuable 66, in a return of 2-88 in 18 overs. The match was briefly halted before the second over when two Just Stop Oil protesters ran out of the Grandstand and onto the outfield, sprinkling the environmental pressure group's trademark orange powder on the square but not on the pitch. Bairstow grabbed one of the demonstrators and carried them off the playing surface, with the other apprehended by stewards. Advertisement A third demonstrator was tackled before making it onto the outfield, with the police making three arrests. Pope injury scare England's aggressive 'Bazball' approach had come under scrutiny in Birmingham, but missing several chances was a bigger factor in their defeat. On Wednesday, Stuart Broad, who has long troubled Warner in Ashes contests, had him edging into the cordon on 20, only for fourth slip Ollie Pope, who later went off injured with a shoulder injury, to drop a two-handed catch. Warner cashed in with a 66-ball fifty completed when he pulled Tongue, in just his second Test, for six. But off what became the last ball before lunch Tongue bowled Khawaja fresh from his hundred at Edgbaston, playing no shot. Warner also fell to Tongue, bowled between bat and pad by a ball that cut back sharply off the pitch. England for all Australia's playing and missing, did not help themselves by giving away 36 runs in extras, including 12 no-balls. Smith stuck Stuart Broad through the covers for two fours off successive balls then successfully overturned a caught-behind decision off the next delivery on his way to a 102-ball fifty. Broad also had Marnus Labuschagne lbw, playing no shot, before another successful Australian review indicated the ball would have cleared the top of the stumps. Stokes brought himself on in the hope of a breakthrough but it was not long before Smith confidently flicked him through midwicket for four to go to 9,000 runs in Test cricket. Smith and Labuschagne, until recently the world's two top-ranked Test batsmen, had managed just 35 runs between them across four innings at Edgbaston. But on Wednesday their century partnership was ended when Labuschagne was caught behind for 47 off an excellent full-length delivery from Ollie Robinson to leave Australia 198-3. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-28 18:26:35","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Women's Head Coach to Be Picked on June 30, Ajit Agarkar Frontrunner for Men's Team Chief Selector's Post","link":"https://www.latestly.com/agency-news/sports-news-indian-womens-head-coach-to-be-picked-on-june-30-agarkar-frontrunner-for-chief-selectors-post-5232345.html","keywords":null,"creator":null,"video_url":null,"description":"The shortlist for the Indian women team's head coach job includes Amol Muzumdar and Tushar Arothe, who are among those to be interviewed on June 30. After picking the head coach for the women's team on Friday, the CAC is likely to appoint the chief selector for the Indian men's team","content":"The shortlist for the Indian women team's head coach job includes Amol Muzumdar and Tushar Arothe, who are among those to be interviewed on June 30. While Arothe has coached the Indian team in the past, Muzumdar, who is also in talks to become Baroda coach, has had stints with IPL franchise Rajasthan Royals and the South African national team. It has also been learnt that Englishman and ex-Durham head coach, Jon Lewis has also applied for the job. The Cricket Advisory Committee comprising Ashok Malhotra, Jatin Paranjpe and Sulakshana Naik will conduct the interviews in Mumbai. \"The interviews will be conducted on Friday,\" a BCCI official told PTI. The Harmanpreet Kaur-led India, guilty of throwing away knock out games from winning positions in multi-team events over the past five years, has been without a head coach since Ramesh Powar was sacked in December. Batting coach Hrishikesh Kanitkar was in charge of the team in the T20 World Cup in South Africa earlier this year. India have a tour of Bangladesh scheduled next month and the announcement on the head coach's front will be made before that. \"I don't think bringing back Tushar will be a good choice. The team needs someone with fresh ideas. Someone like Amol is the right person to take the team forward. \"The management needs to build a big pool of players before the T20 World Cup next year which will also be held in Bangladesh,\" said a former India player. After picking the head coach for the women's team on Friday, the CAC is likely to appoint the chief selector for the Indian men's team — a post that has been vacant since Chetan Sharma's unceremonious exit in February. The last date of application is June 30 and the interviews are likely to be held on July 1. \"The CAC has the mandate to pick a selector who can stand up to the high-profile team management in case there are differences,\" added the BCCI official. Agarkar was linked to the chief selector's post in the past as well, but this time, he is likely to get the high-pressure job. If Agarkar is appointed, there will be two selectors from the West Zone, with Salil Ankola being the other. The 45-year-old played 26 Tests, 191 ODIs and 4 T20s for India. He was a part of the Delhi Capitals' support staff in the recently held IPL. PTI","pubDate":"2023-06-28 18:18:09","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023, Eng vs Aus 2nd Test Day 1 Stumps: पहले दिन का खेल हुआ खत्म, शतक के करीब स्टीव स्मिथ; ऑस्ट्रेलिया का स्कोर 339/5","link":"https://hindi.latestly.com/socially/sports/cricket/ashes-2023-eng-vs-aus-2nd-test-day-1-stumps-first-days-play-over-steve-smith-close-to-century-australias-score-3395-1849157.html","keywords":null,"creator":null,"video_url":null,"description":"एशेज सीरीज के दूसरे टेस्ट मैच में इंग्लैंड की भिड़ंत ऑस्ट्रेलिया के साथ हो रही है. दोनों टीमों के बीच यह मुकाबला लॉर्ड्स के मैदान पर खेला जा रहा है. पहले टेस्ट ऑस्ट्रेलिया ने दो विकेट से जीतकर सीरीज में 1-0 की बढ़त बना ली हैं.दूसरे टेस्ट में इंग्लैंड के कप्तान बेन स्टोक्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया.","content":"एशेज सीरीज के दूसरे टेस्ट मैच में इंग्लैंड की भिड़ंत ऑस्ट्रेलिया के साथ हो रही है. दोनों टीमों के बीच यह मुकाबला लॉर्ड्स के मैदान पर खेला जा रहा है. पहले टेस्ट ऑस्ट्रेलिया ने दो विकेट से जीतकर सीरीज में 1-0 की बढ़त बना ली हैं.दूसरे टेस्ट में इंग्लैंड के कप्तान बेन स्टोक्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. दूसरे टेस्ट के पहले दिन का खेल खत्म हो गया हैं. दूसरे दिन का खेल खत्म होने तक ऑस्ट्रेलिया ने 88 ओवर में पांच विकेट खोकर 339 रन बना लिए हैं. स्टीव स्मिथ 85 रन और एलेक्स कैरी 11 रन बनाकर खेल रहे हैं. - Australia 339 for 5. - 4.08 Run-rate. - Steve Smith stands tall with 85*. Lost the toss, batting first and Australia has taken Day 1 at Lord's. — Johns. (@CricCrazyJohns)","pubDate":"2023-06-28 18:15:32","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia punish lacklustre England seamers before Joe Root produces late boost","link":"https://www.watfordobserver.co.uk/sport/national/23621132.australia-punish-lacklustre-england-seamers-joe-root-produces-late-boost/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The hosts failed to make the most of Ben Stokes winning the toss in helpful conditions.","content":"Desperate to produce a statement of intent after their tense two-wicket defeat at Edgbaston, the hosts failed to make the most of Ben Stokes winning the toss in helpful conditions as Australia reached the close on 339 for five. It could have been much worse for the hosts but Root, asked to carry the spin burden alone due to concerns over Moeen Ali’s injured index finger, halted the tide just as it threatened to carry England away. Travis Head had clattered 77 at better than a run-a-ball when he was stumped racing down the track at a delivery that started wide and turned even further from the bat, then all-rounder Cameron Green threw his wicket away for a duck in a vain attempt to slog Root down the ground. Joe Root strikes twice in an over and Australia are 5️⃣ down! | — England Cricket (@englandcricket) Two cheap wickets in four balls did not completely mitigate two-and-a-half sessions of deeply uninspired work from a lethargic seam attack, but it did halt a 122-run stand between Head and Steve Smith that was quickly heading towards game-changing territory. Smith remains at large on 85 not out and with the chance to bat England out of the match on day two. Prior to Root’s unexpected intervention, England had relied on rookie seamer Josh Tongue for two of their three wickets as James Anderson, Stuart Broad, Ollie Robinson and Stokes himself all toiled without success. Tongue produced two fine deliveries to clean bowl both openers, Usman Khawaja offering no stroke on the cusp of lunch and David Warner (66) cut in two by a gem, but even he was not exempt from the travails which swamped his team-mates. The 25-year-old went at 4.88 over the course of the day, with Broad wicketless and Robinson visibly down on pace as he returned one for 86. England make late inroads, but Australia are on top at stumps on day one 💪 | 📝: — ICC (@ICC) Stokes’ three-over cameo cost him 21 and although Anderson kept a lid on the scoring, he was worrying subdued for the third innings in a row. Stokes could hardly disguise his grin when Pat Cummins called incorrectly at the toss, eagerly sending the tourists in under cloudy skies on a green-tinged pitch. When the floodlights came on just before the start of play, the scene seemed set for the home attack to have some fun, but the anticipated clatter of wickets failed to materialise. The game was interrupted after a solitary Anderson over when two Just Stop Oil protesters invaded the pitch brandishing orange paint powder, an incursion that ended with wicketkeeper Jonny Bairstow lifting one of the activists off his feet and carrying him off the pitch while Stokes shepherded the other into the arms of security. Warner and Khawaja did not allow the break to disrupt their concentration, although the latter offered a low half-chance off Broad that Root would have done outstandingly to hold. The bowling looked laboured at times, with Robinson struggling to crack 80mph, but Broad should have picked up Warner on 20 when Ollie Pope put down a regulation edge at fourth slip, an echo of missed opportunities in the first Test. Pope spent the latter half of the day off the field receiving ice treatment for a shoulder injury and England will hope their vice-captain’s batting is not affected by the issue. Warner sought to impose himself, bending the knee to sweep Broad and Robinson and hooking Tongue for six as his first three overs leaked 24 runs. But he showed plenty of character to get his side up and running either side of lunch. He dismissed Khawaja moments before the break, nipping one down the slope and into the off stump, and saved something even better for Warner after the restart. He put together a deliciously difficult over to the left-hander and capped it in style with one that speared between bat and pad as it flicked the bails. That brought Smith and Marnus Labuschagne together, fresh from the pair’s double failure at Lord’s. Smith was busy immediately but Labuschagne was shaky until a sequence of five boundaries from eight legal deliveries warmed him up. Both were well settled as they took tea at 190 for two, but Robinson finally got himself into the contest in the evening session when he got one to stand up off the seam and take Labuschagne’s outside edge for 47. England briefly had an opening, but a whirlwind knock from Head closed it emphatically. He laid into a tiring attack with gusto, hitting 14 boundaries as weariness and sloppy fielding began to take a toll. With Smith showing signs of tunnel vision and a couple of DRS decisions correctly going against England, it took unforced error to lift Stokes’ side. Root was apparently biding time until the second new ball but found a some bite from the rough and tempted Head into a rash charge. Bairstow did the rest with a smart take and stumping, before Green hacked his third ball high to mid-off to take some of the shine off a strong day for Australia.","pubDate":"2023-06-28 18:11:32","image_url":"https://www.watfordobserver.co.uk/resources/images/16941343/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Olympic leaders in Brisbane promote policies to keep 2032 Games safe from financial wrongdoing","link":"https://japantoday.com/category/sports/olympic-leaders-in-brisbane-promote-policies-to-keep-2032-games-safe-from-financial-wrongdoing","keywords":null,"creator":null,"video_url":null,"description":"Olympic organizers from Australia said Wednesday they have safeguards in place to stop the 2032 Brisbane Games ever joining Paris, Tokyo and Rio de Janeiro under investigation for…","content":"Olympic organizers from Australia said Wednesday they have safeguards in place to stop the 2032 Brisbane Games ever joining Paris, Tokyo and Rio de Janeiro under investigation for financial wrongdoing. One week after Paris authorities raided offices and homes linked to organizing the 2024 Olympics, Brisbane officials were at the IOC in Switzerland for a first detailed progress meeting on their own project. Brisbane would be “standing tall in the highest standards,” organizing committee president Andrew Liveris told reporters in an online briefing. “We have to. In fact, if we don’t do that then we should not be there,” he said, pointing to “a robust fraud and code of conduct policy” already in place with compliance training for senior management. In Paris, Olympic officials are under scrutiny for suspected favoritism in how contracts were awarded rather than the kind of bribery that tainted Rio de Janeiro in 2016 and Tokyo held in 2021. A Summer Games typically involves hundreds of contracts linked to the multi-billion dollar operations for organizers, plus billions more in construction and security costs mostly met by taxpayers. “We’re subject to Queensland government procurement standards,” Liveris said of Brisbane’s home state. Brisbane organizers’ operating budget is set at 5 billion Australian dollars ($3.3 billion). The IOC contributes cash and services that amounted to nearly $1.9 billion for Tokyo. Organizers’ revenue including ticket, sponsorship and merchandise sales has a target set at $1.7 billion (2.5 billion Australian dollars), Brisbane 2032 chief executive Cindy Hook said. Liveris acknowledged that by global standards Australia is a “small commercial market” while Brisbane and Queensland have to build their reputation for a high standard of living. “We have a wonderful part of the world but not as well-known as maybe it needs to be,” he said. “So that means we have to find innovative ways to bring sponsors to the table.” Big-ticket projects for 2032 include the federally backed Brisbane Arena that will later stage swimming and a state-funded rebuild of the storied cricket ground known as the Gabba. It will host track and field and potentially the opening and closing ceremonies. “There is no commitment there to make that cost neutral to the taxpayer because that’s for the taxpayers’ benefit,” Liveris said. Brisbane also seeks inspiration from the 2000 Sydney Olympics that was a stage for Cathy Freeman, who lit the cauldron and then ran to 400-meter gold, who has Indigenous Australian family roots. Liveris set a target of “the most inclusive games ever, with great equal access with all, with a strong and special emphasis on First Nations and celebrating the world’s oldest living culture.”","pubDate":"2023-06-28 21:32:41","image_url":null,"source_id":"japantoday","category":["sports"],"country":["japan"],"language":"english"},{"title":"News24.com | Smith stars for Australia before Root double revives England in 2nd Test","link":"https://www.news24.com/sport/Cricket/smith-stars-for-australia-before-root-double-revives-england-in-2nd-test-20230628","keywords":null,"creator":null,"video_url":null,"description":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday.","content":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday. STUMPS | England v Australia - 2nd Test, Day 1 But off-spinner Joe Root, better known as the number one-ranked batsman in Test cricket, took two wickets in four balls late in the day. His double strike ensured Ashes-holders Australia, 1-0 up in the five-match series after a thrilling two-wicket win at Edgbaston last week, did not have things all their own way at the 'Home of Cricket'. Australia were in a commanding position at 316-3, despite being sent into bat by England captain Ben Stokes in overcast conditions and on a green tinged-pitch that promised to aid his five-strong pace attack. But dashing left-hander Travis Head, scoring at better than a run-a-ball, then charged down the pitch only to be beaten by a sharply turning Root delivery with Jonny Bairstow, whose wicketkeeping had proved fallible in Birmingham, completing an excellent stumping. Head was out for 77 following a stand of 118 with Smith where England were given a taste of their own 'Bazball' medicine. But three balls later, Australia's 316-4 became 316-5 when Cameron Green fell for a duck, slicing Root to James Anderson at mid-off. At stumps Root, the only spinner in the attack after England dropped Moeen Ali, had figures of 2-19 from eight overs. Fast bowler Josh Tongue, recalled in place of Moeen, removed Australia left-handed openers Usman Khawaja and David Warner, who made a valuable 66, in a return of 2-88 in 18 overs. The match was briefly halted before the second over when two Just Stop Oil protesters ran out of the Grandstand and onto the outfield, sprinkling the environmental pressure group's trademark orange powder on the square but not on the pitch. Bairstow grabbed one of the demonstrators and carried them off the playing surface, with the other apprehended by stewards. A third demonstrator was tackled before making it onto the outfield, with the police making three arrests. England's aggressive 'Bazball' approach had come under scrutiny in Birmingham, but missing several chances was a bigger factor in their defeat. On Wednesday, Stuart Broad, who has long troubled Warner in Ashes contests, had him edging into the cordon on 20, only for fourth slip Ollie Pope, who later went off injured with a shoulder injury, to drop a two-handed catch. Warner cashed in with a 66-ball fifty completed when he pulled Tongue, in just his second Test, for six. But off what became the last ball before lunch Tongue bowled Khawaja fresh from his hundred at Edgbaston, playing no shot. Warner also fell to Tongue, bowled between bat and pad by a ball that cut back sharply off the pitch. England for all Australia's playing and missing, did not help themselves by giving away 36 runs in extras, including 12 no-balls. Smith stuck Stuart Broad through the covers for two fours off successive balls then successfully overturned a caught-behind decision off the next delivery on his way to a 102-ball fifty. Broad also had Marnus Labuschagne lbw, playing no shot, before another successful Australian review indicated the ball would have cleared the top of the stumps. Stokes brought himself on in the hope of a breakthrough but it was not long before Smith confidently flicked him through midwicket for four to go to 9,000 runs in Test cricket. Smith and Labuschagne, until recently the world's two top-ranked Test batsmen, had managed just 35 runs between them across four innings at Edgbaston. But on Wednesday their century partnership was ended when Labuschagne was caught behind for 47 off an excellent full-length delivery from Ollie Robinson to leave Australia 198-3.","pubDate":"2023-06-28 19:32:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Absolutely shambolic – Kevin Pietersen rips into England after day one at Lord’s","link":"https://www.watfordobserver.co.uk/sport/national/23621180.absolutely-shambolic---kevin-pietersen-rips-england-day-one-lords/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Pietersen offered a stinging assessment of England’s efforts with the ball.","content":"Pietersen, who was given the honour of ringing the bell before the start of play, offered a stinging assessment of England’s efforts with the ball after the tourists reached the close on 339 for five. Only two late wickets in four balls from part-time spinner Joe Root prevented the end-of-play scorecard looking even worse, Travis Head and Cameron Green both falling to unforced errors. A scattering of live green grass and overhead clouds that were gloomy enough to warrant floodlights throughout the day appeared to hint at ideal conditions for England’s five-strong seam attack, but it was the tourists who dictated the tone as half-centuries from David Warner (66), Travis Head (77) and Steve Smith (85no) left them well placed. “Not a lot’s caught my eye from an English perspective, it’s been shambolic. Absolutely shambolic,” the 104-cap veteran told Sky Sports. “You have overhead conditions, you have wickets that suit your bowlers and you’ve got bowlers running in at 78, 79, 80 miles an hour. “Now it’s one thing walking here, swanning around, saying ‘this is a wonderful team to play in, we’re creating the best environment’. But this is not Ashes cricket.” Pietersen also took issue with an apparent lack of edge on the field – just a week on from Australian criticism over Ollie Robinson’s expletive-filled send-off of Usman Khawaja at Edgbaston. “It’s all too easy, too nice. Are you telling me Ricky Ponting in 2005 is going to be talking to Geraint Jones? You think Michael Vaughan is going to be stood next to Justin Langer saying ‘hey mate, what a cool day, it’s overcast, it’s beautiful, what an awesome day, environment here at Lord’s – what do you think of the wicket’? “Are you joking? Are you absolutely joking? I just hope they’re in their dressing room now and the England coach is giving them the biggest hammering and saying it’s absolutely not good enough.” Josh Tongue was the pick of the five English quicks on his first Ashes outing, topping the pace charts and snapping up the wickets of Khawaja and David Warner either side of the lunch break. The 25-year-old saw his first three overs smacked for 24 but revealed a word of advice from Ollie Robinson about utilising the famous Lord’s slope helped him open his account against Australia. “I spoke to Robbo just before lunch about trying to use the slope a bit more,” said Tongue. “I was trying to wobble it away from the bat and he said ‘why don’t you try and get the ball coming back into him’. Getting Khawaja just before lunch was crucial and then, obviously, I was trying to do the same to David. “He’s a very hard batter to bowl at. If you miss your length you’re going to the boundary, that’s how I felt, so the wicket came at a very good time for the team.” Invited to rate the Warner dismissal, which skidded between bat and pad and lifted the bails with precision to cap an outstanding over, Tongue added: “I haven’t properly looked back yet, but listening to the lads it was a very good ball.” Warner opted to shine a light on Head’s performance after the latter hit 14 boundaries to pile the pressure on England in the evening session. “Trav is Trav, that’s the way he plays,” he said. “It’s exciting and we’re just lucky he’s on our team. He can take it away from you. Striking at over a hundred is exceptional. He just finds a way.”","pubDate":"2023-06-28 19:31:54","image_url":"https://www.watfordobserver.co.uk/resources/images/16941422/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ashes, 2nd Test: Steve Smith remains unbeaten on 85, Australia post 339/5 at stumps on Day 1","link":"https://telanganatoday.com/ashes-2nd-test-steve-smith-remains-unbeaten-on-85-australia-post-339-5-at-stumps-on-day-1","keywords":["News","Sport","ashes","Australia","England","Steve Smith"],"creator":["AP"],"video_url":null,"description":"Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia's charge with an unbeaten 85","content":"Home | Sport | Ashes 2nd Test Steve Smith Remains Unbeaten On 85 Australia Post 339 5 At Stumps On Day 1 Ashes, 2nd Test: Steve Smith remains unbeaten on 85, Australia post 339/5 at stumps on Day 1 Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia's charge with an unbeaten 85 By AP Updated On - 12:44 AM, Thu - 29 June 23 Australia's Steven Smith plays a shot on day one of the second Ashes cricket Test match between England and Australia at Lords cricket ground in London, on June 28, 2023. (Photo: AFP) London: Forced to bat, Australia punished fading England bowling in ideal conditions at Lord’s to post 339-5 by stumps on the first day on Wednesday of the second Ashes test. Steve Smith, booed when he walked in and politely clapped when he walked off at stumps, led Australia’s charge with an unbeaten 85. Alex Carey was with him on 11. Smith anchored century stands with Marnus Labuschagne and Travis Head after opening batters David Warner and Usman Khawaja set them up by surviving a tough morning and disruption from Just Stop Oil protesters. Josh Tongue, in his Ashes debut, became the first England bowler to bowl out Australia’s opening batsmen since 1968, and the first at Lord’s since 1884. Another lingering concern for England was No. 3 batter Ollie Pope, who injured his right shoulder making a stop after lunch and didn’t return to the field. England said he was receiving ice treatment. When Ben Stokes won the toss and chose to send in Australia, he would have expected to have a minimum of three wickets by lunch and be batting by the end of the day in England’s bid to level the series. Conditions for the bowlers were that good. The strip was grassy, clouds covered Lord’s all day, and the covers were removed only just before play began after a light drizzle left the air humid and perfect for England’s all-pace attack to swing the ball. England was without a specialist spinner or spin-bowling all-rounder for only the second time in 20 years. The two highest test wicket-takers at Lord’s, James Anderson and Stuart Broad, got plenty of movement on a pitch that was deceptively slow, but couldn’t get a wicket, and wouldn’t all day. Anderson should have had Khawaja out on 1 to a catch at first slip but Joe Root grassed the laces-high chance. Broad should have had Warner — whom he has dismissed 15 times — on 20 but Pope at fourth slip dropped a two-handed catch in front of him. Warner’s mood was lightened just five minutes after the match began when two climate activists ran onto the field to try and spread orange powder on the pitch. Neither got close. England wicketkeeper Jonny Bairstow carried one man on his hip 50 metres back to the boundary, and the other was corralled away from the pitch by Stokes and Warner and captured by stewards. What little orange powder fell in the outfield was quickly vacuumed. Bairstow changed clothes and play resumed five minutes later. But the tension was gone and Warner was playful, drawing grins from his long-time nemesis Broad. Warner had his eighth fifty in England by lunch. Khawaja was watchful. His bat was beaten by Anderson, Broad and Ollie Robinson and he’d made 17 in the stand of 73 when Tongue, on the stroke of lunch, hit Khawaja’s off stump while the Australian shouldered arms. Khawaja was stunned, and so was Warner when his leg stump was bowled by Tongue after lunch on 66. Warner slashed eight boundaries to sit on 1,999 runs in Ashes history. Both opening batters were beaten by pace and swing. Tongue was at least 5 mph (8 kph) quicker than his fellow pacers. Labuschagne and Smith combined for a stand of 102 in stark response to sharing a total of 35 runs at Edgbaston last week. Australia captain Pat Cummins expected a big comeback from his two best batters and they delivered at almost 5 an over. Both batters overturned leg before decisions against them but after their ninth century stand in tests, Labuschagne was out to a good ball by Robinson for 47. In the last 10 tests at Lord’s, the side which batted first was bowled out for under 200. Australia reached 200 only three down. Head joined Smith and needed only 64 balls and 14 boundaries to surpass Smith on 72. Head is vulnerable to the short ball at the start of his innings but England didn’t challenge him, and his fifty off 48 balls was the third fastest by an Australian at Lord’s. Head was out for 77 from 73 balls when he had a swish at Root and was stumped. Cameron Green was the only Australian to give away his wicket when he sliced Root in the same over and was out for a duck. Carey joined Smith, who passed 9,000 runs, the fourth Australian after Allan Border, Steve Waugh and Ricky Ponting. But Smith was grinding towards his 32nd century. Also Read Bumrah bowling seven overs a day at NCA nets, no timeline yet on comeback Officials ‘disappointed’ as major cricket centres miss out on staging WC games Follow Us : Tags ashes Australia England Steve Smith Related News Ashes, 1st Test: Khawaja, Cummins help Australia win thrilling opener, beat England by 2 wickets Ashes, 1st Test: Australia sets up thrilling final day, reach 107/3 at stumps on Day 4 Ashes, 1st Test: Rain brings early halt to play, England 28/2 at stumps on Day 3 Ashes, 1st Test: Khawaja’s first test hundred in England leads Australia fightback on Day 2 EURO 2024 qualifiers: Kane extends scoring record as England rout Malta 4-0 Ashes, 1st Test: Root’s masterclass put hosts in driver’s seat on Day 1","pubDate":"2023-06-28 19:12:38","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Lancashire waste little time finishing off County Championship leaders Surrey","link":"https://www.watfordobserver.co.uk/sport/national/23621166.lancashire-waste-little-time-finishing-off-county-championship-leaders-surrey/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The visitors needed just 45 minutes of the final day to finish off a 123-run victory at the Oval.","content":"Will Williams picked up four for 13 in just 4.3 overs on the final morning as Surrey were routed for 84, while Tom Bailey finished with five for 48. The pair took only 9.3 overs to claim Surrey’s last five second-innings wickets to end a run of first-class games at the Oval in which the Division One leaders have won 12 and drawn the other six. 𝑻𝒉𝒆𝒔𝒆 𝒕𝒘𝒐. 😍 Where do you want your statues, and Will Williams? 🌹 — Lancashire Cricket (@lancscricket) Kent’s spinners finally overcame a late flourish from the Northamptonshire tail to wrap up an innings victory at Wantage Road and climb to eighth in the table. Joe Denly claimed four wickets and Hamid Qadri three as the home side were bowled out for 369 despite an entertaining ninth-wicket stand of 70 between Ben Sanderson and Jack White. In Division Two, a magnificent unbeaten century by Peter Handscomb led a successful rearguard action as Leicestershire secured a draw with leaders Durham. The Australian wicketkeeper-batter finished on 136 not out before bad light ended the contest with the visitors two wickets away from victory with 10 overs left in the match. 𝐌𝐀𝐓𝐂𝐇 𝐃𝐑𝐀𝐖𝐍 A heroic effort by Peter Handscomb, ably supported by Ed Barnes, helps us earn a hard-fought draw on the final day. 👊 Great fight, Foxes. 💚 🦊 — Leicestershire Foxes 🦊 (@leicsccc) Leicestershire, who moved up to second, ended the match on 259 for eight chasing 439, with Durham having earlier declared at 343 for four after Alex Lees (145) and David Bedingham (145 not out) had shared a 243-run stand for the third wicket. Sussex’s last-wicket pairing of Oli Carter and Henry Shipley survived over 20 overs to frustrate Glamorgan and eke out a draw in Cardiff. The visitors finished on 273 for nine, 85 runs behind, with Carter on 55 not out after being dropped from two difficult chances, and number 11 Shipley unbeaten on eight. A very well made fifty for Oli Carter. 🌟 Then a very composed knock to help see the game out. 👏 — Sussex Cricket (@SussexCCC) Worcestershire centurion Gareth Roderick and Ed Pollock batted through sizeable chunks of the final day to thwart Derbyshire’s push for their first victory of the campaign. Roderick battled away for five-and-a-quarter hours to make 123, while Pollock played a knock based on determined defence to register 56 off 189 balls spanning nearly four hours. Their efforts were largely responsible for defying the Derbyshire attack as only four wickets fell in the entire day, which started with the hosts resuming on 70 for two needing another 271 just to make their opponents bat again. A crucial innings full of discipline and determination from 💪 🍐 — Worcestershire County Cricket Club (@WorcsCCC) Gloucestershire all-rounder Ollie Price completed an excellent maiden first-team century during an otherwise low-key final day at Headingley as their clash with Yorkshire finished in a draw. Price moved from 97 not out overnight to reach three figures in the day’s first over as the visitors were bowled out for 464 in reply to a first-innings 550 for nine. He was last man out for 113 off 162 balls to loanee left-arm spinner Dan Moriarty, who finished with five for 139 on his Yorkshire debut. The home side started their second innings with a lead of 86 and reached 200 for six in the 48th over when rain stopped play at 4.30pm.","pubDate":"2023-06-28 19:11:21","image_url":"https://www.watfordobserver.co.uk/resources/images/16941407/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cricket-Australia take firm grip on Lord's test","link":"https://economictimes.indiatimes.com/news/sports/cricket-australia-take-firm-grip-on-lords-test/articleshow/101348278.cms","keywords":null,"creator":null,"video_url":null,"description":"England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series.","content":"Synopsis England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series. Getty Images David Warner and Usman Khawaja (right) LONDON -Steve Smith scored an unbeaten 85 to guide Australia to 339-5 as England wasted favourable bowling conditions on the first day of the second Ashes test at Lord's on Wednesday. England captain Ben Stokes won the toss under grey skies and floodlights at the home of cricket, sending Australia into bat with high hopes of taking early wickets in his team's bid to level the series. But David Warner and Usman Khawaja rode their luck to share a gritty opening partnership of 73 and although Josh Tongue removed them both, Marnus Labuschagne made 47 and Travis Head a rapid 77 to put Australia in a commanding position. Joe Root dismissed Head and Cameron Green in the same over to give England late hope but the day firmly belonged to Australia. \"Obviously, an amazing day for us, could've been three down and made it an unbelievable day,\" Labuschagne told Sky Sports. \"But still, you're going to take that when you get sent in on a wicket that we thought had a fair bit in it.\" The game was disrupted after one over when two Just Stop Oil protesters ran on to the pitch and sprayed orange powder on to the outfield but Warner and Khawaja were not distracted. They negotiated probing spells from James Anderson and Stuart Broad and, after a short rain delay, Warner reached his fifty by hooking Tongue for six before Khawaja was bowled by the same bowler for 17 just before lunch. Each batsman was dropped in the slips, Khawaja offering a very difficult chance to Root and Warner a sharp one to Ollie Pope. Warner lived dangerously after lunch too, particularly against Tongue who continued his impressive spell by bowling the left-hander through the gate for 66 with a fine swinging delivery to reduce Australia to 96-2. Smith emerged from the pavilion to a chorus of boos but he settled down quickly and silenced the crowd with two sumptuous drives off Broad to the cover boundary. SWIFT REVENGE Broad almost exacted swift revenge when Smith was given out caught by wicketkeeper Jonny Bairstow in the same over for 24 but the batsman reviewed and the decision was overturned. Labuschagne started slowly before finding his rhythm with three fours off one Broad over and when Stokes brought himself on to bowl the Australian right-hander stroked him to the boundary three times. Broad thought he had trapped Labuschagne lbw, the umpire raising his finger before the batsman was reprieved, but the Australian departed shortly after tea, feathering a catch to Bairstow off Ollie Robinson. Head joined Smith and accelerated the scoring rate as the England bowlers tired in the final session. Smith passed fifty and Head reached his half-century off only 48 balls, the pair peppering the boundary rope all around the ground. Head was stumped off Root by Bairstow after scoring 77 off 73 balls and three deliveries later Green aimed an ugly swipe at the spinner to give Anderson a simple catch at mid-off. It was a positive end to a poor day for England in which Stokes looked short of ideas and used few of the innovative field settings which have been a feature of his captaincy. He bowled only three overs and England's hopes of winning back the Ashes are fading after six days of the series. \"Turning up to the game today, green top, overcast conditions, I thought we bowled really well in the first hour. We could've got four or five before lunch,\" Tongue told the BBC. \"I think the new ball is crucial, the first 30 minutes, just hitting that line and length, just try and stay patient and we'll get those wickets when we can.\" Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Wednesday, 28 Jun, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics ET Markets Smart Investing More People See Opportunity When They Look at India Wall Street giant Goldman Sachs' Solomon, 61, said he's not bothered about all the noise, his focus remains on serving clients and the Goldman share price performance. HDFC-HDFC Bank Merger Likely to be Effective July 1 The merger of HDFC Corp with the country's largest private lender HDFC Bank will likely take effect July 1, chairman of India’s mortgage-lending pioneer Deepak Parekh said Tuesday. The combined entity will have an asset base of around ₹18 lakh crore, or in excess of $200 billion. Vested Interests Exploited Hindenburg Report to Manipulate Stocks: Adani Gautam Adani said the Hindenburg Research report on the Adani Group was a “combination of targeted misinformation and outdated, discredited allegations”. Vested interests used the report to manipulate Adani Group stocks, he said in the annual report of flagship Adani Enterprises released on Tuesday. Read More News on warner Ashes Test Steve Smith Marnus Labuschagne Australia control khawaja stuart broad (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Under the lens The number games: from cash-flow cons to misleading metrics, spotting jugglery in financial data 5 mins read Markets Indians are borrowing for SUVs instead of homes. Lure of bigger cars, lower EMIs fuelling it. 6 mins read 3 insights to kick-start your day: featuring the continuing Google-NCLAT battle 3 mins read Subscribe to ETPrime","pubDate":"2023-06-28 18:50:53","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-44006,resizemode-4,msid-101348278/cricket-australia-take-firm-grip-on-lords-test.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"2nd Test, Day 1: Smith Stars For Australia Before Root Revives England","link":"https://sports.ndtv.com/cricket/england-vs-australia-2nd-ashes-test-steve-smith-stars-for-australia-before-joe-root-double-revives-england-on-day-1-4161522","keywords":null,"creator":null,"video_url":null,"description":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday.","content":"Star batsman Steve Smith's unbeaten 85 was the centrepiece of Australia's impressive 339-5 on the opening day of the second Test against England at Lord's on Wednesday. But off-spinner Joe Root, better known as the number one-ranked batsman in Test cricket, took two wickets in four balls late in the day. His double strike ensured Ashes-holders Australia, 1-0 up in the five-match series after a thrilling two-wicket win at Edgbaston last week, did not have things all their own way at the 'Home of Cricket'. Australia were in a commanding position at 316-3, despite being sent into bat by England captain Ben Stokes in overcast conditions and on a green tinged-pitch that promised to aid his five-strong pace attack. But dashing left-hander Travis Head, scoring at better than a run-a-ball, then charged down the pitch only to be beaten by a sharply turning Root delivery with Jonny Bairstow, whose wicketkeeping had proved fallible in Birmingham, completing an excellent stumping. Head was out for 77 following a stand of 118 with Smith where England were given a taste of their own 'Bazball' medicine. But three balls later, Australia's 316-4 became 316-5 when Cameron Green fell for a duck, slicing Root to James Anderson at mid-off. At stumps Root, the only spinner in the attack after England dropped Moeen Ali, had figures of 2-19 from eight overs. Fast bowler Josh Tongue, recalled in place of Moeen, removed Australia left-handed openers Usman Khawaja and David Warner, who made a valuable 66, in a return of 2-88 in 18 overs. The match was briefly halted before the second over when two Just Stop Oil protesters ran out of the Grandstand and onto the outfield, sprinkling the environmental pressure group's trademark orange powder on the square but not on the pitch. Bairstow grabbed one of the demonstrators and carried them off the playing surface, with the other apprehended by stewards. Advertisement A third demonstrator was tackled before making it onto the outfield, with the police making three arrests. Pope injury scare England's aggressive 'Bazball' approach had come under scrutiny in Birmingham, but missing several chances was a bigger factor in their defeat. On Wednesday, Stuart Broad, who has long troubled Warner in Ashes contests, had him edging into the cordon on 20, only for fourth slip Ollie Pope, who later went off injured with a shoulder injury, to drop a two-handed catch. Warner cashed in with a 66-ball fifty completed when he pulled Tongue, in just his second Test, for six. But off what became the last ball before lunch Tongue bowled Khawaja fresh from his hundred at Edgbaston, playing no shot. Warner also fell to Tongue, bowled between bat and pad by a ball that cut back sharply off the pitch. England for all Australia's playing and missing, did not help themselves by giving away 36 runs in extras, including 12 no-balls. Smith stuck Stuart Broad through the covers for two fours off successive balls then successfully overturned a caught-behind decision off the next delivery on his way to a 102-ball fifty. Broad also had Marnus Labuschagne lbw, playing no shot, before another successful Australian review indicated the ball would have cleared the top of the stumps. Stokes brought himself on in the hope of a breakthrough but it was not long before Smith confidently flicked him through midwicket for four to go to 9,000 runs in Test cricket. Smith and Labuschagne, until recently the world's two top-ranked Test batsmen, had managed just 35 runs between them across four innings at Edgbaston. But on Wednesday their century partnership was ended when Labuschagne was caught behind for 47 off an excellent full-length delivery from Ollie Robinson to leave Australia 198-3. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-28 18:26:35","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Women's Head Coach to Be Picked on June 30, Ajit Agarkar Frontrunner for Men's Team Chief Selector's Post","link":"https://www.latestly.com/agency-news/sports-news-indian-womens-head-coach-to-be-picked-on-june-30-agarkar-frontrunner-for-chief-selectors-post-5232345.html","keywords":null,"creator":null,"video_url":null,"description":"The shortlist for the Indian women team's head coach job includes Amol Muzumdar and Tushar Arothe, who are among those to be interviewed on June 30. After picking the head coach for the women's team on Friday, the CAC is likely to appoint the chief selector for the Indian men's team","content":"The shortlist for the Indian women team's head coach job includes Amol Muzumdar and Tushar Arothe, who are among those to be interviewed on June 30. While Arothe has coached the Indian team in the past, Muzumdar, who is also in talks to become Baroda coach, has had stints with IPL franchise Rajasthan Royals and the South African national team. It has also been learnt that Englishman and ex-Durham head coach, Jon Lewis has also applied for the job. The Cricket Advisory Committee comprising Ashok Malhotra, Jatin Paranjpe and Sulakshana Naik will conduct the interviews in Mumbai. \"The interviews will be conducted on Friday,\" a BCCI official told PTI. The Harmanpreet Kaur-led India, guilty of throwing away knock out games from winning positions in multi-team events over the past five years, has been without a head coach since Ramesh Powar was sacked in December. Batting coach Hrishikesh Kanitkar was in charge of the team in the T20 World Cup in South Africa earlier this year. India have a tour of Bangladesh scheduled next month and the announcement on the head coach's front will be made before that. \"I don't think bringing back Tushar will be a good choice. The team needs someone with fresh ideas. Someone like Amol is the right person to take the team forward. \"The management needs to build a big pool of players before the T20 World Cup next year which will also be held in Bangladesh,\" said a former India player. After picking the head coach for the women's team on Friday, the CAC is likely to appoint the chief selector for the Indian men's team — a post that has been vacant since Chetan Sharma's unceremonious exit in February. The last date of application is June 30 and the interviews are likely to be held on July 1. \"The CAC has the mandate to pick a selector who can stand up to the high-profile team management in case there are differences,\" added the BCCI official. Agarkar was linked to the chief selector's post in the past as well, but this time, he is likely to get the high-pressure job. If Agarkar is appointed, there will be two selectors from the West Zone, with Salil Ankola being the other. The 45-year-old played 26 Tests, 191 ODIs and 4 T20s for India. He was a part of the Delhi Capitals' support staff in the recently held IPL. PTI","pubDate":"2023-06-28 18:18:09","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023, Eng vs Aus 2nd Test Day 1 Stumps: पहले दिन का खेल हुआ खत्म, शतक के करीब स्टीव स्मिथ; ऑस्ट्रेलिया का स्कोर 339/5","link":"https://hindi.latestly.com/socially/sports/cricket/ashes-2023-eng-vs-aus-2nd-test-day-1-stumps-first-days-play-over-steve-smith-close-to-century-australias-score-3395-1849157.html","keywords":null,"creator":null,"video_url":null,"description":"एशेज सीरीज के दूसरे टेस्ट मैच में इंग्लैंड की भिड़ंत ऑस्ट्रेलिया के साथ हो रही है. दोनों टीमों के बीच यह मुकाबला लॉर्ड्स के मैदान पर खेला जा रहा है. पहले टेस्ट ऑस्ट्रेलिया ने दो विकेट से जीतकर सीरीज में 1-0 की बढ़त बना ली हैं.दूसरे टेस्ट में इंग्लैंड के कप्तान बेन स्टोक्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया.","content":"एशेज सीरीज के दूसरे टेस्ट मैच में इंग्लैंड की भिड़ंत ऑस्ट्रेलिया के साथ हो रही है. दोनों टीमों के बीच यह मुकाबला लॉर्ड्स के मैदान पर खेला जा रहा है. पहले टेस्ट ऑस्ट्रेलिया ने दो विकेट से जीतकर सीरीज में 1-0 की बढ़त बना ली हैं.दूसरे टेस्ट में इंग्लैंड के कप्तान बेन स्टोक्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. दूसरे टेस्ट के पहले दिन का खेल खत्म हो गया हैं. दूसरे दिन का खेल खत्म होने तक ऑस्ट्रेलिया ने 88 ओवर में पांच विकेट खोकर 339 रन बना लिए हैं. स्टीव स्मिथ 85 रन और एलेक्स कैरी 11 रन बनाकर खेल रहे हैं. - Australia 339 for 5. - 4.08 Run-rate. - Steve Smith stands tall with 85*. Lost the toss, batting first and Australia has taken Day 1 at Lord's. — Johns. (@CricCrazyJohns)","pubDate":"2023-06-28 18:15:32","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia punish lacklustre England seamers before Joe Root produces late boost","link":"https://www.watfordobserver.co.uk/sport/national/23621132.australia-punish-lacklustre-england-seamers-joe-root-produces-late-boost/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The hosts failed to make the most of Ben Stokes winning the toss in helpful conditions.","content":"Desperate to produce a statement of intent after their tense two-wicket defeat at Edgbaston, the hosts failed to make the most of Ben Stokes winning the toss in helpful conditions as Australia reached the close on 339 for five. It could have been much worse for the hosts but Root, asked to carry the spin burden alone due to concerns over Moeen Ali’s injured index finger, halted the tide just as it threatened to carry England away. Travis Head had clattered 77 at better than a run-a-ball when he was stumped racing down the track at a delivery that started wide and turned even further from the bat, then all-rounder Cameron Green threw his wicket away for a duck in a vain attempt to slog Root down the ground. Joe Root strikes twice in an over and Australia are 5️⃣ down! | — England Cricket (@englandcricket) Two cheap wickets in four balls did not completely mitigate two-and-a-half sessions of deeply uninspired work from a lethargic seam attack, but it did halt a 122-run stand between Head and Steve Smith that was quickly heading towards game-changing territory. Smith remains at large on 85 not out and with the chance to bat England out of the match on day two. Prior to Root’s unexpected intervention, England had relied on rookie seamer Josh Tongue for two of their three wickets as James Anderson, Stuart Broad, Ollie Robinson and Stokes himself all toiled without success. Tongue produced two fine deliveries to clean bowl both openers, Usman Khawaja offering no stroke on the cusp of lunch and David Warner (66) cut in two by a gem, but even he was not exempt from the travails which swamped his team-mates. The 25-year-old went at 4.88 over the course of the day, with Broad wicketless and Robinson visibly down on pace as he returned one for 86. England make late inroads, but Australia are on top at stumps on day one 💪 | 📝: — ICC (@ICC) Stokes’ three-over cameo cost him 21 and although Anderson kept a lid on the scoring, he was worrying subdued for the third innings in a row. Stokes could hardly disguise his grin when Pat Cummins called incorrectly at the toss, eagerly sending the tourists in under cloudy skies on a green-tinged pitch. When the floodlights came on just before the start of play, the scene seemed set for the home attack to have some fun, but the anticipated clatter of wickets failed to materialise. The game was interrupted after a solitary Anderson over when two Just Stop Oil protesters invaded the pitch brandishing orange paint powder, an incursion that ended with wicketkeeper Jonny Bairstow lifting one of the activists off his feet and carrying him off the pitch while Stokes shepherded the other into the arms of security. Warner and Khawaja did not allow the break to disrupt their concentration, although the latter offered a low half-chance off Broad that Root would have done outstandingly to hold. The bowling looked laboured at times, with Robinson struggling to crack 80mph, but Broad should have picked up Warner on 20 when Ollie Pope put down a regulation edge at fourth slip, an echo of missed opportunities in the first Test. Pope spent the latter half of the day off the field receiving ice treatment for a shoulder injury and England will hope their vice-captain’s batting is not affected by the issue. Warner sought to impose himself, bending the knee to sweep Broad and Robinson and hooking Tongue for six as his first three overs leaked 24 runs. But he showed plenty of character to get his side up and running either side of lunch. He dismissed Khawaja moments before the break, nipping one down the slope and into the off stump, and saved something even better for Warner after the restart. He put together a deliciously difficult over to the left-hander and capped it in style with one that speared between bat and pad as it flicked the bails. That brought Smith and Marnus Labuschagne together, fresh from the pair’s double failure at Lord’s. Smith was busy immediately but Labuschagne was shaky until a sequence of five boundaries from eight legal deliveries warmed him up. Both were well settled as they took tea at 190 for two, but Robinson finally got himself into the contest in the evening session when he got one to stand up off the seam and take Labuschagne’s outside edge for 47. England briefly had an opening, but a whirlwind knock from Head closed it emphatically. He laid into a tiring attack with gusto, hitting 14 boundaries as weariness and sloppy fielding began to take a toll. With Smith showing signs of tunnel vision and a couple of DRS decisions correctly going against England, it took unforced error to lift Stokes’ side. Root was apparently biding time until the second new ball but found a some bite from the rough and tempted Head into a rash charge. Bairstow did the rest with a smart take and stumping, before Green hacked his third ball high to mid-off to take some of the shine off a strong day for Australia.","pubDate":"2023-06-28 18:11:32","image_url":"https://www.watfordobserver.co.uk/resources/images/16941343/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"}]}