{"newsArray":[{"title":"India vs Pakistan Asia Cup 2022 Super 4 Live Streaming Details: When and where to watch IND vs PAK online, cricket schedule, TV timing, channel in India","link":"https://zeenews.india.com/cricket/india-vs-pakistan-asia-cup-2022-super-4-live-streaming-details-when-and-where-to-watch-ind-vs-pak-online-cricket-schedule-tv-timing-channel-in-india-2505486.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma-led Team India will take on Babar Azam’s Hong Kong in their first Super 4 match of Asia Cup 2022 on Sunday (September 4) in Dubai. Check Online Live Streaming Details HERE.","content":"The famed top-order would be desperate for a course correction while the bowling attack could be rejigged as India aim for a Sunday encore against Pakistan in an Asia Cup 2022 Super 4 clash. If the top-order’s powerplay philosophy is a problem, the inexperience of Avesh Khan at the death was no less a worry and the team management may need to revamp the bowling attack against a strong Pakistan side, which is coming into the game after demolishing Hong Kong by more than 150 runs. “Avesh Khan is a little unwell and hopefully, we will get him for the later matches of the tournament,” head coach Rahul Dravid said on the eve of the match. With Ravindra Jadeja not available in this game, Axar Patel looks like a straightforward replacement, but the team combination does take a hit in the absence of the Saurashtra all-rounder. In the last game against Pakistan, Dravid promoted Jadeja to number four to keep the left-right combination going in the top six, as Rishabh Pant was dropped from the playing XI. It remains to be seen if skipper Rohit Sharma and Dravid take the gamble again on Sunday. But it won’t be an exaggeration to say that when it comes to the requirement of having a pure left-hand batter in the top six, only the man from Roorkee can provide the solution. Team India's Head Coach, Rahul Dravid talks about the process of building a versatile squad that is ready to excel in any situation of the match. 0 #INDvPAK #ACC #AsiaCup2022 #GetReadyForEpic pic.twitter.com/X7Q1ZcvqEm — AsianCricketCouncil (@ACCMedia1) September 3, 2022 Last Sunday, it was Hardik Pandya’s one-man show that got India over the line in a thrilling final-over finish, and Rohit would expect that the intensity is maintained in this game too. However, the Indian team, despite being a minefield of talent, does have a soft underbelly, and the top-order’s cautious approach in powerplay overs is one of them. Neither Virat Kohli nor Rohit looked comfortable against the Babar Azam’s Pakistani bowling attack and as the pitch got slower, their problems seemed to have compounded. It was Suryakumar Yadav’s sheer brilliance that saved India from what was turning out to be an embarrassing batting display against minnows Hong Kong, with an out-of- sync KL Rahul playing his slowest ever (36 off 39 balls) innings. Match Details When will the India vs Pakistan Asia Cup 2022 Super 4 match be played? The India vs Pakistan Asia Cup 2022 Super 4 match will held on Sunday (September 4). Where will the India vs Pakistan Asia Cup 2022 Super 4 match be played? The India vs Pakistan Asia Cup 2022 Super 4 match will be played in Dubai. What time will the India vs Pakistan Asia Cup 2022 Super 4 match start? The India vs Pakistan Asia Cup 2022 Super 4 match will start at 730 PM IST and the toss will take place at 7pm. How can I watch India vs Pakistan Asia Cup 2022 Super 4 match on TV in India? The India vs Pakistan Asia Cup 2022 Super 4 match will be live on Star Sports Network in India. How can I follow the live streaming of the India vs Pakistan Asia Cup 2022 Super 4 match? The India vs Pakistan Asia Cup 2022 Super 4 match will be streamed live on Disney+ Hotstar website and app.","pubDate":"2022-09-04 01:11:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Flawed’ star in worrying fail hat-trick; batting big guns fire: Aussie series ratings","link":"https://www.foxsports.com.au/cricket/australia/australia-vs-zimbabwe-2022-cricket-series-ratings-aaron-finch-fails-david-warner-analysis-highlights-video/news-story/ac3ac7077ca7763f1b16a9f0f536ac5d","keywords":null,"creator":null,"video_url":null,"description":"The prospect of a series whitewash has turned into a reality check for Australia, after Zimbabwe shocked the world by defeating the cricket powerhouse for the first time in their own backyard.","content":"The prospect of a series whitewash has turned into a reality check for Australia, after Zimbabwe shocked the world by defeating the cricket powerhouse for the first time in their own backyard. The three-wicket defeat will undoubtedly heap more pressure on Aaron Finch, whose form ahead of next month’s T20 World Cup is the elephant in the room. Nor did the three One-Day Internationals against Zimbabwe help Finch’s cause, with the veteran opening batter managing just 21 runs across the series. Yet there were some positives coming out of the series in Townsville, with Cameron Green’s rise continuing while quicks Mitchell Starc and Josh Hazlewood showed some form with the ball. Here are our player ratings from the 2-1 series win over Zimbabwe. Aaron Finch walks from the field after another fail against Zimbabwe at Riverway Stadium on September 03, 2022 in Townsville. Photo: Getty Images Source: Getty Images AARON FINCH — 2 21 runs at 7 Three innings, three fails. Finch’s form continues to be the main talking point regarding the make-up of the Australian team. Against Zimbabwe he fell three times to left-arm quick Richard Ngarava, whose angling delivery kept Finch caught on the crease. Fox Cricket expert Kerry O’Keeffe urged Finch to release the shackles and get back to playing with an attacking mind-set. “He’s an attacker who’s been out three times defending, so against (Trent) Bolt and (Tim) Southee just around the corner, he’s got to attack them,” O’Keeffe said. “They bowl balls you have to defend and his defence is flawed at the moment. I think he’s got to throw caution to the wind; don’t fear failure and go out there and play his trademark shots down the ground.” DAVID WARNER — 8.5 164 runs at 54.66 Fresh from inking a new BBL deal, the Australian opener scored a half-century and finished the series with a dashing 94 as his teammates crumbled around him. The feature to Warner’s batting was his crisp timing, where he waited for the ball on tricky wickets. Warner’s form heading into the T20 World Cup is particularly important given Finch’s struggles. STEVE SMITH — 8 96 runs at 96 He missed out on Saturday in the third ODI, but Smith was outstanding during the opening two ODIs where he made unbeaten contributions of 48 and 47. Has the prolific run-scorer tweaked his batting style? It appears that he’s fidgeting less at the crease. ALEX CAREY — 5.5 40 runs at 30 Once again Carey didn’t quite nail his opportunities with the bat, where he failed twice including in the third ODI. His unbeaten 26 after the loss of two early wickets did help. Carey was clean behind the wickets with the gloves. GLENN MAXWELL — 7 51 runs at 51 With limited opportunities, Maxwell showed glimpses of his best. He smashed Australia home in the opening ODI with a rapid-fire 32*, was not required in the second match before falling for 19 during the home side’s shocking batting collapse in the third match. MARCUS STOINIS — 5 Two runs at 11; one wicket at 15 Another with limited opportunities throughout the series, but Stoinis departure for three in the third ODI meant the batting all-rounder lost a point or two. He did, however, chime in with a wicket in the third match. MITCH MARSH — 4 One wicket at 22; two runs at 2 Withdrew from the series after playing in the opening match. The all-rounder took one wicket but missed out the bat. CAMERON GREEN — 8 Eight wickets at 7.12; three runs at 3 The rising all-rounder’s 5-33 during the second ODI was one of the highlights of the series. He backed it up with wickets in both the first and third ODI, but missed out with the bat with a very soft dismissal on Saturday. ASHTON AGAR — 5.5 Two wickets at 15.50; zero runs at 0 The bowling all-rounder won’t want to see replays of his lazy shot on Saturday but the left-arm spinner continues to do the job with the ball. He took a wicket in both the games he played. MITCHELL STARC — 7.5 Five wickets at 16.80; two runs at 2 Fast and accurate, Starc set the tone for the series by taking wickets at the top of the order. He took one in the opening match and grabbed three in the second match. The left-arm quick also took his 200th ODI wicket on Saturday. ADAM ZAMPA — 7 Six wickets at 18.33; one run Took wickets regularly and once again proved hard to get away. JOSH HAZLEWOOD — 7 Four wickets 20.50; zero runs at 0 Almost brought Australia back from the dead on Saturday. Hazlewood got bounce out of the Townsville wicket and took 3-30 in the final ODI.","pubDate":"2022-09-03 23:15:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Waiter to the stars celebrated for passion and commitment","link":"https://www.cairnspost.com.au/news/victoria/waiter-to-the-stars-thomas-portelli-celebrated-for-passion-and-commitment/news-story/80d70145c8f6767456a535bd60a40fc9","keywords":["Cricket news and galleries","Victoria"],"creator":null,"video_url":null,"description":"Waiter to the stars Thomas Portelli has been remembered for five decades of service in the exclusive Melbourne Cricket Club Committee Room.","content":null,"pubDate":"2022-09-03 22:00:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“What a final…What a win!!”: Trent Rockets defeat Manchester Originals to lift The Hundred 2022 men’s title","link":"https://thesportsrush.com/cricket-news-what-a-final-what-a-win-trent-rockets-defeat-manchester-originals-to-lift-the-hundred-2022-mens-title/","keywords":["Cricket","Lord's Cricket Ground","Manchester Originals","The Hundred","The Hundred 2022","Trent Rockets"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Trent Rockets defeat Manchester Originals in what was a perfect see-saw battle to lift their maiden ‘The Hundred’ title at Lord’s. With very little to separate between the table toppers, it is the Trent Rockets who have ultimately managed to hold on to their nerves to defeat the Manchester Originals by 2 wickets and lift… The post “What a final…What a win!!”: Trent Rockets defeat Manchester Originals to lift The Hundred 2022 men’s title appeared first on The SportsRush.","content":"Trent Rockets defeat Manchester Originals in what was a perfect see-saw battle to lift their maiden ‘The Hundred’ title at Lord’s. With very little to separate between the table toppers, it is the Trent Rockets who have ultimately managed to hold on to their nerves to defeat the Manchester Originals by 2 wickets and lift ‘The Hundred 2022’ title at the iconic Lord’s Cricket Ground. En route a rather modest target of 121 in the 100 designated deliveries, the Rockets nearly crumbled under the pressure of the finale tag, as despite easier said than done, it was a matter of a couple of hits to ace the chase. While they needed mere 46 runs off the final 40 deliveries, and six wickets in hand, it boiled down to 11 needed off the final set of five deliveries to win the title. However, back-to-back handsome boundaries off the bat of their skipper Lewis Gregory (17* off 6), saw them home with a couple of deliveries to spare. A comparatively better batting side on paper, none of the Trent batters however managed to get along with their innings, with Dawid Malan (19 off 18) ending up as their highest scorer on the night. Having said that, almost all of them did chip in with invaluable under twenties, to somehow huff and puff towards their destination. Four of the Originals’ six bowlers in the night managed to scalp two wicket apiece, with an overall good enough performance. However, a couple of ordinary deliveries bowled by Richard Gleeson (18-7-28-0) during the final set of five deliveries of the match meant that they had to ultimately settle as runner-ups. Earlier, on the back of exceptional spells from pacer Sam Cook (20-11-18-4) and left-arm spinner Samit Patel (15-5-23-3) helped the Rockets restrict the Originals to 120/9 after 100 deliveries. Cook was adjudged the ‘Hero of the match’ for his match-winning performance with the ball. Your 2022 men’s champions, Trent Rockets! 🙌 #TheHundred pic.twitter.com/acGkcr56gg — The Hundred (@thehundred) September 3, 2022 Wow what a game! Congratulations Trent Rockets🏏 🏏🏏 https://t.co/rnfCbegQHf — Allison Davies (@AllieDVies) September 3, 2022 What a final… What a win!! #trentrockets @thehundred 🚀🚀🚀🚀🚀 — Kirsty (@kayess1) September 3, 2022 A fantastic finish! 😱 Congratulations, Trent Rockets! 🌟 #TheHundred pic.twitter.com/TNw17GIEKU — The Hundred (@thehundred) September 3, 2022 Hundred final – not a great match but an exciting end. Trent Rockets chased their target despite nobody reaching 20. — John Etheridge (@JohnSunCricket) September 3, 2022 Trent Rockets are men’s Hundred champions! 🏆 What a way to do it! A simply incredible final! #BBCCricket #TheHundred pic.twitter.com/5PfsgEm9Pl — Test Match Special (@bbctms) September 3, 2022 Absolute SCENES at Lords as the Trent Rockets seal their maiden @thehundred title in a thrilling final. Brilliant from them as it was from the Oval Invincible’s women’s team who sealed their second consecutive title in the 💯. pic.twitter.com/4XocjttYRs — Aatif Nawaz (@AatifNawaz) September 3, 2022 🏆 TRENT ROCKETS WIN! TWO balls left and captain Lewis Gregory guides his team home. What.A.Finish. #LoveLords | #TheHundred pic.twitter.com/1gQLeM3iKe — Lord’s Cricket Ground (@HomeOfCricket) September 3, 2022 For more Cricket-related news, click here.","pubDate":"2022-09-03 21:52:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs PAK pitch report: Dubai International Cricket Stadium pitch report India vs Pakistan Asia Cup Super 4 match","link":"https://thesportsrush.com/cricket-news-ind-vs-pak-pitch-report-dubai-international-cricket-stadium-pitch-report-india-vs-pakistan-asia-cup-super-4-match/","keywords":["Cricket","Asia Cup 2022","Dubai International Stadium","India","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs PAK pitch report: The arch-rivals will lock horns yet again today as the battle of continental supremacy continues in Dubai. It is time yet again. Perhaps a bit too early as far as an India-Pakistan Cricket contest is concerned, but the arch-rivals will take on each other in their first match of the… The post IND vs PAK pitch report: Dubai International Cricket Stadium pitch report India vs Pakistan Asia Cup Super 4 match appeared first on The SportsRush.","content":"IND vs PAK pitch report: The arch-rivals will lock horns yet again today as the battle of continental supremacy continues in Dubai. It is time yet again. Perhaps a bit too early as far as an India-Pakistan Cricket contest is concerned, but the arch-rivals will take on each other in their first match of the Asia Cup 2022 ‘Super 4’ stage at the Dubai International Stadium today. After decimating India by 10 wickets in last year’s ICC T20 World Cup at this very venue, Pakistan were pipped to the post by India a few days ago, in their opening match of the ongoing competition by 5 wickets at this very venue again. With the venue set to host these old rivals for the third time in a row, both the teams have been handed with some injury scares ahead of the contest. While team India will be without the services of their all-rounder Ravindra Jadeja, and most likely of their pacer Avesh Khan as well, a suspected side-strain has ruled Pakistani pacer Shahnawaz Dahani out of today’s clash as well. While India are yet to be defeated in the tournament so far, the Babar Azam-led side are brimming with confidence as well, after registering their biggest victory ever in terms of runs in the T20 format against Hong Kong a couple of days ago. A night out for our stars ⭐ Pakistan team dinner in Dubai #AsiaCup2022 | #BackTheBoysInGreen pic.twitter.com/HlcOcwRyjE — Pakistan Cricket (@TheRealPCB) September 3, 2022 “This is a proper turf pitch where there’s a lot of grass. It’s going to be more about bowling rather than batting. All the grass is in clusters, that means the ball will definitely seam around,” remarked Sanjay Manjrekar and Wasim Akram ahead of the first match of Asia Cup 2022 between these two sides. The prediction did turn out to be true as the Indian fast bowlers literally bounced out a host of their batters, while also managing to scalp all the 10 wickets for the first time in a T20I match. Today’s encounter is highly likely to take place on a fresh Dubai pitch, with the venue set to host a game after a three-day gap. Thus, expect a similar sort of track with decent purchase on offer for the seamers especially with the new ball. The conditions are again expected to be as hot and humid as ever, with the temperature expected to hit 40°C in the afternoon. Overall, the Dubai pitch will provide an even contest between bat and the ball, with batting likely to get a tad easier during the latter half of the match.","pubDate":"2022-09-03 19:59:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Once again a scintillating run chase”: Angelo Mathews commends Sri Lanka as they accomplish record run-chase vs Afghanistan at Sharjah","link":"https://thesportsrush.com/cricket-news-once-again-a-scintillating-run-chase-angelo-mathews-commends-sri-lanka-as-they-accomplish-record-run-chase-vs-afghanistan-at-sharjah/","keywords":["Cricket","Afghanistan","Angelo Mathews","Asia Cup 2022","Sri Lanka"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Angelo Mathews commends Sri Lanka as they nail yet another challenging run-chase in the Asia Cup, against Afghanistan this time around. During the first match of Asia Cup 2022 ‘Super 4’ stage between Afghanistan and Sri Lanka at the Sharjah Cricket Stadium, Sri Lanka have had the sweetest of redemption against the Mohammad Nabi-led side,… The post “Once again a scintillating run chase”: Angelo Mathews commends Sri Lanka as they accomplish record run-chase vs Afghanistan at Sharjah appeared first on The SportsRush.","content":"Angelo Mathews commends Sri Lanka as they nail yet another challenging run-chase in the Asia Cup, against Afghanistan this time around. During the first match of Asia Cup 2022 ‘Super 4’ stage between Afghanistan and Sri Lanka at the Sharjah Cricket Stadium, Sri Lanka have had the sweetest of redemption against the Mohammad Nabi-led side, as they prevail by 4 wickets to reinvigorate their continental championship campaign. After registering their second-highest run-chase ever in T20Is against Bangladesh a couple of days ago, Sri Lanka have now accomplished their highest T20I run-chase in Sharjah, achieving the challenging target of 176 runs with five deliveries to spare. It was a far from an ideal day at the office for the Afghanistan bowling attack, especially for their experienced spinners in skipper Mohammad Nabi (4-0-34-1) and Rashid Khan (4-0-39-1), as the Sri Lankan batters had their foot on the accelerating pedal right from the get-go. The opening batting pair of Pathum Nissanka (35 off 28) and the in-form Kusal Mendis (36 off 19) provided their side an ideal platform yet again, by stitching together a 62-run partnership off mere 6.3 Overs. While not a single Sri Lankan batter managed to surpass the 50-run mark, the likes of Bhanuka Rajapaksa (31 off 14), Danushka Gunathilaka (33 off 20), and Wanindu Hasaranga (16* off 9), did manage to get their individual runs at a brisk rate to keep the run-chase a float. After admiring the Sri Lanka run-chase during their match versus Bangladesh , the Dasun Shanaka-led side managed to bring the smile back on the face of their former skipper Angelo Mathews, as he took to his social media handle to applaud the effort put in by the batters for the second consecutive time in Asia Cup 2022. Once again a scintillating run chase by the boys 👏👏 @BhanukaRajapak3 @KusalMendis13 @pathuwa18 @danushka_70 👏👏👏 young bowlers were brilliant too . Keep going boys — Angelo Mathews (@Angelo69Mathews) September 3, 2022 Earlier, on the back of a scintillating knock by the Afghan opener Rahmanullah Gurbaz (84* off 45), and his 93-run stand for the second wicket alongside Ibrahim Zadran (40 off 38), helped Afghanistan get to the total of 175/6 in their 20 Overs. Gurbaz, in fact was adjudged the ‘Player of the match’ for his superb display of batsmanship.","pubDate":"2022-09-03 18:57:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: शारजाह क्रिकेट ग्राउंड के नाम हुआ महा रिकॉर्ड, ऑस्ट्रेलिया के सिडनी को पछाड़ हासिल किया बड़ा मुकाम","link":"https://www.abplive.com/sports/cricket/281-international-matches-have-been-played-at-sharjah-ground-which-is-more-than-any-other-ground-asia-cup-2022-latest-news-2207424","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Asia Cup 2022 Super-4 Round: एशिया कप 2022 (Asia Cup 20220 के सुपर-4 लीग राउंड (Super-4 Round) का पहला मैच श्रीलंका और अफगानिस्तान (SL vs AFG 2022) के बीच शारजाह में खला गया. यह शारजाह क्रिकेट ग्राउंड (Sharjah Cricket Ground) पर 281वां इंटरनेशनल मैच था. इस तरह शारजाह क्रिकेट ग्राउंड के नाम सबसे ज्यादा इंटरनेशनल मैच का रिकार्ड दर्ज हो गया है. इस मामले में शारजाह क्रिकेट ग्राउंड ने ऑस्ट्रेलिया के सिडनी को पीछे छोड़ दिया है. सिडनी में अब तक 280 इंटरनेशनल मैच खेले जा चुके हैं. ऑस्ट्रेलिया का सिडनी क्रिकेट ग्राउंड दूसरे नंबर पर अब सबसे ज्यादा इंटरनेशनल मैच के मामले में शारजाह क्रिकेट ग्राउंड 281 मैचों के साथ पहले नंबर पर है. वहीं, इस फेहरिस्त में ऑस्ट्रेलिया का सिडनी क्रिकेट ग्राउंड दूसरे नंबर पर है. सिडनी क्रिकेट ग्राउंड पर अब तक 280 इंटरनेशनल मुकाबले खेले जा चुके हैं. ऑस्ट्रेलिया का मेलबर्न क्रिकेट ग्राउंड 278 मैचों के साथ तीसरे नंबर पर है. गौरतलब है कि एशिया कप 2022 का आयोजन यूएई में किया जा रहा है. एशिया कप 2022 का आयोजन श्रीलंका में होना था, लेकिन राजनीतिक संकट के कारण वहीं नहीं हो पाया. इस वजह से एशिया कप 2022 यूएई में खेला जा रहा है. रविवार को सुपर-4 राउंड में भारत के सामने होगा पाकिस्तान एशिया कप 2022 में भारत की बात करें तो टीम इंडिया सुपर-4 राउंड में पहुंच चुकी है. भारतीय टीम ने अपने पहले मैच में पाकिस्तान को 5 विकेट से हराया, जबकि दूसरे मैच में हांगकाग को 40 रनों से शिकस्त दी. वहीं, भारत और पाकिस्तान के अलावा श्रीलंका और अफगानिस्तान की टीम एशिया कप 2022 के सुपर-4 राउंड में पहुंची है. पाकिस्तान को पहले मैच में भारत के खिलाफ हार का सामना करना पड़ा था, लेकिन हांगकांग को हराकर पाकिस्तानी टीम ने सुपर-4 राउंड में अपनी जगह पक्की की. अब रविवार को भारत और पाकिस्तान की टीमें सुपर-4 राउंड में आमने-सामने होगी. ये भी पढ़ें- IND vs PAK Super 4: 'अक्षर पटेल की जगह दीपक हुड्डा को मिले मौका', भारत-पाक मैच से पहले बोले वसीम जाफर SL vs AFG: रोमांचक मुकाबले में श्रीलंका ने मारी बाज़ी, अफगानिस्तान को 4 विकेट से हराया; राजपक्षे ने पलटा मैच","content":"Asia Cup 2022 Super-4 Round: एशिया कप 2022 (Asia Cup 20220 के सुपर-4 लीग राउंड (Super-4 Round) का पहला मैच श्रीलंका और अफगानिस्तान (SL vs AFG 2022) के बीच शारजाह में खला गया. यह शारजाह क्रिकेट ग्राउंड (Sharjah Cricket Ground) पर 281वां इंटरनेशनल मैच था. इस तरह शारजाह क्रिकेट ग्राउंड के नाम सबसे ज्यादा इंटरनेशनल मैच का रिकार्ड दर्ज हो गया है. इस मामले में शारजाह क्रिकेट ग्राउंड ने ऑस्ट्रेलिया के सिडनी को पीछे छोड़ दिया है. सिडनी में अब तक 280 इंटरनेशनल मैच खेले जा चुके हैं. ऑस्ट्रेलिया का सिडनी क्रिकेट ग्राउंड दूसरे नंबर पर अब सबसे ज्यादा इंटरनेशनल मैच के मामले में शारजाह क्रिकेट ग्राउंड 281 मैचों के साथ पहले नंबर पर है. वहीं, इस फेहरिस्त में ऑस्ट्रेलिया का सिडनी क्रिकेट ग्राउंड दूसरे नंबर पर है. सिडनी क्रिकेट ग्राउंड पर अब तक 280 इंटरनेशनल मुकाबले खेले जा चुके हैं. ऑस्ट्रेलिया का मेलबर्न क्रिकेट ग्राउंड 278 मैचों के साथ तीसरे नंबर पर है. गौरतलब है कि एशिया कप 2022 का आयोजन यूएई में किया जा रहा है. एशिया कप 2022 का आयोजन श्रीलंका में होना था, लेकिन राजनीतिक संकट के कारण वहीं नहीं हो पाया. इस वजह से एशिया कप 2022 यूएई में खेला जा रहा है. रविवार को सुपर-4 राउंड में भारत के सामने होगा पाकिस्तान googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); एशिया कप 2022 में भारत की बात करें तो टीम इंडिया सुपर-4 राउंड में पहुंच चुकी है. भारतीय टीम ने अपने पहले मैच में पाकिस्तान को 5 विकेट से हराया, जबकि दूसरे मैच में हांगकाग को 40 रनों से शिकस्त दी. वहीं, भारत और पाकिस्तान के अलावा श्रीलंका और अफगानिस्तान की टीम एशिया कप 2022 के सुपर-4 राउंड में पहुंची है. पाकिस्तान को पहले मैच में भारत के खिलाफ हार का सामना करना पड़ा था, लेकिन हांगकांग को हराकर पाकिस्तानी टीम ने सुपर-4 राउंड में अपनी जगह पक्की की. अब रविवार को भारत और पाकिस्तान की टीमें सुपर-4 राउंड में आमने-सामने होगी. ये भी पढ़ें- IND vs PAK Super 4: 'अक्षर पटेल की जगह दीपक हुड्डा को मिले मौका', भारत-पाक मैच से पहले बोले वसीम जाफर SL vs AFG: रोमांचक मुकाबले में श्रीलंका ने मारी बाज़ी, अफगानिस्तान को 4 विकेट से हराया; राजपक्षे ने पलटा मैच","pubDate":"2022-09-03 18:08:59","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ravindra Jadeja's knee injury 'pretty serious,' could miss T20 World Cup: Reports","link":"https://www.thehansindia.com/sports/cricket/ravindra-jadejas-knee-injury-pretty-serious-could-miss-t20-world-cup-reports-760287","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Jadeja was ruled out of the Asia Cup 2022India named Axar his replacement for the remainder of the tournamentT20 World Cup will take place in Oct-Nov in Australia","content":"Ravindra Jadeja’s knee injury ‘pretty serious,’ could miss T20 World Cup: Reports Ravindra Jadeja's knee injury is \"pretty serious\" and the Indian all-rounder could miss the upcoming T20 World Cup. Jadeja, who picked up a knee injury during the ongoing Asia Cup, is expected to be out of action for an \"indefinite period of time,\" according to an official of the Board of Control for Cricket in India (BCCI). The 33-year-old Saurashtra cricketer will undergo surgery on his right knee. \"Jadeja's right knee injury is pretty serious. He is supposed to undergo a major knee surgery and will be out of action for an indefinite period of time. At this point, if one goes by the assessment of the NCA's medical team, one can't put a timeline on his imminent international comeback,\" a senior BCCI official told PTI on the condition of anonymity. Axar Patel was earlier named Jadeja's replacement for the remainder of the Asia Cup 2022. Jadeja is under the care of our medical team, says Rahul Dravid Speaking ahead of India's game against Pakistan, head coach Rahul Dravid said that while Jadeja was surely out of Asia Cup, it was too early to say if the all-rounder would return in time for the T20 World Cup, which is scheduled to be played in Australia in October-November. \"Jadeja has injured his knee; he is obviously ruled out of the Asia Cup. He is under the care of the medical team, he is going to see the doctors, see the experts. The World Cup is still a fair bit away, and we don't want to jump to any conclusions and rule him out or rule him in. We'll see how it goes. \"Injuries are a part of the sport; it is part of our job to try to manage them. A lot will depend on rehab and the severity of the injury. I don't want to rule him out or don't want to make too many comments until we have a much clearer picture and a better idea, especially because the World Cup is six or seven weeks away from now,\" added Dravid. India and Pakistan are set to face off in a Super Four fixture on Sunday (Sept. 4) at the Dubai International Cricket Stadium. The two sides earlier locked horns in a group game, where it was India who had sealed the match by five wickets. While it is still not known if Jadeja has sustained an Anterior Cruciate Ligament (ACL), he could be out for at least three months, according to news reports. It is understood that Jadeja's knee issue has been there for a long time, and the Indian cricketer may having been trying to convert into more of a batting all-rounder across formats in the last year or so. It is believed that the thumping that his right knee takes while landing on his front foot while bowling has had its impact. If Jadeja does miss the T20 World Cup, it could be a huge blow for Rohit Sharma and Co as he brings in a balance with his all-around abilities. In 64 T20Is for India, Jadeja has scored 457 runs at a strike rate of 124.52 and has picked up 51 wickets as well.","pubDate":"2022-09-03 18:04:04","image_url":"https://assets.thehansindia.com/h-upload/2022/09/03/500x300_1310683-rahul.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Sri Lanka hunt down Afghanistan with superb all-round effort in slog overs","link":"https://www.tribuneindia.com/news/sports/asia-cup-sri-lanka-hunt-down-afghanistan-with-superb-all-round-effort-in-slog-overs-428297","keywords":null,"creator":null,"video_url":null,"description":"Sharjah, September 3Sri Lankan batters showed enormous tactical acumen in yet another tricky run-chase as they defeated Afghanistan by four wickets in the opening Super 4 game of the Asia Cup here on Saturday.It was fantastic bowling effort at the death that saw Sri Lanka restrict the Afghans to 175 for 6 with only 37 runs coming in the last five overs despite a brilliant 84 off 45 balls by Rahamanullah Gurbaz.In reply, Sri Lanka chased down the target in 19.1 overs with several small but impactful contributions that sealed the issue for them. This was the highest run-chase in a T20I at Sharjah.Just like great bowing at the death, the overs between 15-18 yielded 51 runs for the Lankans and that proved to be a game-changer.Kusal Mendis (36 off 19 balls) started from where he had left against Bangladesh the other day as he launched into opposition's best bowler Rashid Khan, depositing him for two successive sixes as 17 runs came in that over inside the Powerplay.And before that, Mendis had a maximum of Mujeeb ur Rahaman.All three sixes were in the arc between deep mid-wicket and deep square leg.His opening partner Pathum Nissanka (35 off 28 balls) also gave solid support as 62 were added for the opening stand.However, it was Danuska Gunathilaka (33 off 20 balls) and Bhanuka Rajapaksa (31 off 14 balls), whose 32 runs stand of just 2.3 overs changed the complexion of the game.Their daredevilry had enormous impact in the final outcome of the game as they hit sixes and found the gaps with ease. In the 34 balls that they played, there were six fours and three sixes.The Afghan bowlers, who are not always used to handling pressure situations, did falter in the end and Rashid's poor day (1/39 in 4 overs) at the office did have its effect.Put into bat young opener Rahmanullah Gurbaz gave a brilliant exhibition of his dashing strokeplay as his innings was the cornerstone of Afghanistan's competitive total of 175 for 6.However, Afghanistan will be a bit disappointed as the last five overs yielded only 37 runs and lost five wickets in a jiffy with Gurbaz's dismissal putting some sort of a brake on the run flow.Gurbaz, the 20-year-old right-hander, who was a part of IPL champion team Gujarat Titans, smashed half a dozen sixes and added 93 in just 10.4 overs with Ibrahim Zadran (40) to take Afghanistan to a more than respectable total at the Sharjah Cricket ground.The evening belonged to Gurbaz, who did get a slice of luck as Danushka Gunathilaka's foot touched the rope when he went for a successive second six off mystery spinner Mahesh Theekshana, having slog-swept him for his first six.However, there was no looking back after that even though the right hander didn't use his feet much against the spinner.The slog sweep off Wanindu Hasaranga over cow corner was a treat to watch and so was the two down-the-ground sixes off Chamika Karunaratne which was all about maximum power with hand-eye co-ordination and minimal feet movement.There was pull shot off pacer Asitha Fernando among the half dozen of sixes that he hit and once he was out, Sri Lanka bowlers did get a sense of reprieve on a ground where the side boundaries are really short.Zadran though got a few lusty blows and so did Rashid Khan (9) towards the fag end of the Afghanistan innings to take the score close to 180.While spinners Theekshana (1/29) and Hasaranga (0/23 in 4 overs) gave away only 52 in their eight overs, it was skipper Dasun Shanaka (0/22 in 2 overs) and Karunaratne (0/29 in 2 overs), who leaked 51 runs in four overs for the \"fifth bowler's quota\".","content":"PTI Sharjah, September 3 Sri Lankan batters showed enormous tactical acumen in yet another tricky run-chase as they defeated Afghanistan by four wickets in the opening Super 4 game of the Asia Cup here on Saturday. It was fantastic bowling effort at the death that saw Sri Lanka restrict the Afghans to 175 for 6 with only 37 runs coming in the last five overs despite a brilliant 84 off 45 balls by Rahamanullah Gurbaz. In reply, Sri Lanka chased down the target in 19.1 overs with several small but impactful contributions that sealed the issue for them. This was the highest run-chase in a T20I at Sharjah. Just like great bowing at the death, the overs between 15-18 yielded 51 runs for the Lankans and that proved to be a game-changer. Kusal Mendis (36 off 19 balls) started from where he had left against Bangladesh the other day as he launched into opposition’s best bowler Rashid Khan, depositing him for two successive sixes as 17 runs came in that over inside the Powerplay. And before that, Mendis had a maximum of Mujeeb ur Rahaman. All three sixes were in the arc between deep mid-wicket and deep square leg. His opening partner Pathum Nissanka (35 off 28 balls) also gave solid support as 62 were added for the opening stand. However, it was Danuska Gunathilaka (33 off 20 balls) and Bhanuka Rajapaksa (31 off 14 balls), whose 32 runs stand of just 2.3 overs changed the complexion of the game. Their daredevilry had enormous impact in the final outcome of the game as they hit sixes and found the gaps with ease. In the 34 balls that they played, there were six fours and three sixes. The Afghan bowlers, who are not always used to handling pressure situations, did falter in the end and Rashid’s poor day (1/39 in 4 overs) at the office did have its effect. Put into bat young opener Rahmanullah Gurbaz gave a brilliant exhibition of his dashing strokeplay as his innings was the cornerstone of Afghanistan’s competitive total of 175 for 6. However, Afghanistan will be a bit disappointed as the last five overs yielded only 37 runs and lost five wickets in a jiffy with Gurbaz’s dismissal putting some sort of a brake on the run flow. Gurbaz, the 20-year-old right-hander, who was a part of IPL champion team Gujarat Titans, smashed half a dozen sixes and added 93 in just 10.4 overs with Ibrahim Zadran (40) to take Afghanistan to a more than respectable total at the Sharjah Cricket ground. The evening belonged to Gurbaz, who did get a slice of luck as Danushka Gunathilaka’s foot touched the rope when he went for a successive second six off mystery spinner Mahesh Theekshana, having slog-swept him for his first six. However, there was no looking back after that even though the right hander didn’t use his feet much against the spinner. The slog sweep off Wanindu Hasaranga over cow corner was a treat to watch and so was the two down-the-ground sixes off Chamika Karunaratne which was all about maximum power with hand-eye co-ordination and minimal feet movement. There was pull shot off pacer Asitha Fernando among the half dozen of sixes that he hit and once he was out, Sri Lanka bowlers did get a sense of reprieve on a ground where the side boundaries are really short. Zadran though got a few lusty blows and so did Rashid Khan (9) towards the fag end of the Afghanistan innings to take the score close to 180. While spinners Theekshana (1/29) and Hasaranga (0/23 in 4 overs) gave away only 52 in their eight overs, it was skipper Dasun Shanaka (0/22 in 2 overs) and Karunaratne (0/29 in 2 overs), who leaked 51 runs in four overs for the “fifth bowler’s quota”.","pubDate":"2022-09-03 17:39:21","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_204692586.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"'We felt Dinesh Karthik was right choice for us,' says Coach Rahul Dravid on Rishabh Pant's exclusion","link":"https://www.indiatvnews.com/sports/cricket/we-felt-dinesh-karthik-was-right-choice-for-us-says-coach-rahul-dravid-on-rishabh-pant-s-exclusion-2022-09-03-805240","keywords":null,"creator":null,"video_url":null,"description":"Rishabh Pant's omission from the game against Pakistan came as a shocker to fans and many cricket pundits. Some believed that this may as well be the sign of things to come for the T20 World Cup. Now, Rahul Dravid, while speaking to the media before the 2nd India-Pakistan match, said that there is no first-choice wicketkeeper in the team or a starting eleven for every single condition. ","content":null,"pubDate":"2022-09-03 17:34:32","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs PAK Asia Cup 2022, Super 4 Dream11 prediction: Fantasy cricket tips for India vs Pakistan match in Dubai","link":"https://www.dnaindia.com/cricket/report-ind-vs-pak-dream11-prediction-fantasy-cricket-tips-for-india-vs-pakistan-asia-cup-2022-super-4-dubai-hotstar-2982104","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"IND vs PAK Asia Cup 2022 Dream 11 Team - Check My Dream11 Team, Best Player's list for India vs Pakistan, Super 4 match in Asia Cup in Dubai.","content":"India and Pakistan are gearing up to write yet another chapter in their historic rivalry on Sunday. The last time, it was Rohit Sharma's men who edged out their arch-rivals by five wickets, with just two balls to spare. Hardik Pandya delivered a Man of the Match performance with his all-round show and the responsibility will only increase on him since Ravindra Jadeja has been ruled out of the Asia Cup 2022 through injury. Virat Kohli's form has been a huge talking point since his comeback, he looked good against Pakistan too, only to gift his wicket away in a brain-fade moment. Rohit and Co will be looking to take another step towards the trophy with another clinical display, while Babar Azam's men will be eyeing revenge for the defeat they faced recently. READ| 'Virat Kohli tells me which restaurant to go to': Rahul Dravid's hilarious reply to journalist Dream11 Prediction – India vs Pakistan - Match 8, Super 4 of Asia Cup IND vs PAK Dream11 Team: Fantasy cricket predictions and tips for India vs Pakistan, Asia Cup India vs Pakistan My Dream11 Team Wicket keepers: Mohammad Rizwan (vc) Batters: Suryakumar Yadav, Virat Kohli, Fakhar Zaman, Babar Azam All-Rounders: Hardik Pandya (c), Mohammad Nawaz, Shadab Khan Bowlers: Bhuvneshwar Kumar, Naseem Shah, Arshdeep Singh READ| Watch: Irfan Pathan shares video of Virat Kohli's goofy laughter, check hilarious replies from fans IND vs PAK Probable Playing XIs India: Rohit Sharma (c), KL Rahul, Virat Kohli, Suryakumar Yadav, Rishabh Pant (wk), Dinesh Karthik, Axar Patel, Bhuvneshwar Kumar, Avesh Khan, Yuzvendra Chahal, Arshdeep Singh Pakistan: Mohammad Rizwan (wk), Babar Azam (c), Fakhar Zaman, Iftikhar Ahmed, Khushdil Shah, Shadab Khan, Asif Ali, Mohammad Nawaz, Haris Rauf, Shahnawaz Dahani, Naseem Shah IND vs PAK My Dream11 team Mohammad Rizwan (vc), Suryakumar Yadav, Virat Kohli, Fakhar Zaman, Babar Azam, Hardik Pandya (c), Mohammad Nawaz, Shadab Khan, Bhuvneshwar Kumar, Naseem Shah, Arshdeep Singh READ| IND vs PAK: Huge blow for Babar Azam's side, another pacer ruled out through injury India vs Pakistan Asia Cup 2022, Super Four match details India vs Pakistan Asia Cup 2022, Super Four match begins at 07:30 PM IST and will take place at Dubai International Stadium in Dubai, on September 4. The match will be telecasted live on Star Sports Network channels in India. The live streaming of Asia Cup 2022 will be available on the Disney+Hotstar app and website.","pubDate":"2022-09-03 17:31:57","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Asia Cup 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2luZGlhLXZzLXBha2lzdGFuLWRyZWFtMTEtcHJlZGljdGlvbi1mYW50YXN5LWNyaWNrZXQtdGlwcy1kcmVhbTExLXRlYW0tcGxheWluZy14aS1waXRjaC1yZXBvcnQtaW5qdXJ5LXVwZGF0ZS1hc2lhLWN1cC0yMDIyLTIv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Asia Cup 2022  Cricket Addictor'I was very shocked when Ramiz said that. What point was he making?'  Hindustan TimesCricbuzz Live: Match 6, Pakistan vs Hong Kong, Mid-innings show  CricbuzzAsia Cup 2022 Schedule, Points Table, Live Score, Today Match, Match List, Match Schedule, Today Match Team List, Venues, Teams, Squads, Live Streaming And Live Telecast Details in India  Cricket AddictorIndia vs Pakistan: Shahnawaz Dahani Ruled Out As Pakistan Suffer Big Injury Blow Before Asia Cup Sup..  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-03 15:50:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Let’s not jump and say he is out”: Rahul Dravid refuses to rule out Ravindra Jadeja from Indian squad for T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-lets-not-jump-and-say-he-is-out-rahul-dravid-refuses-to-rule-out-ravindra-jadeja-from-indian-squad-for-t20-world-cup-2022/","keywords":["Cricket","ICC T20 World Cup 2022","India","Rahul Dravid","Ravichandran Ashwin","Ravindra Jadeja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rahul Dravid refuses to rule out Ravindra Jadeja: The Indian head coach is positive about the availability of the injured all-rounder. Not surprisingly, India all-rounder Ravindra Jadeja appearing set to be ruled out of ICC T20 World Cup 2022 in Australia has immediately initiated conversations around his replacement. Going by recent form, all-rounder Axar Patel… The post “Let’s not jump and say he is out”: Rahul Dravid refuses to rule out Ravindra Jadeja from Indian squad for T20 World Cup 2022 appeared first on The SportsRush.","content":"Rahul Dravid refuses to rule out Ravindra Jadeja: The Indian head coach is positive about the availability of the injured all-rounder. Not surprisingly, India all-rounder Ravindra Jadeja appearing set to be ruled out of ICC T20 World Cup 2022 in Australia has immediately initiated conversations around his replacement. Going by recent form, all-rounder Axar Patel seems to be the likeliest of players to replace Jadeja in the world event. Having successfully replaced Jadeja across formats in the recent year or so, Patel could be playing international cricket down under after seven years next month. One of the three standby players in India’s 15-member squad for Asia Cup 2022, Patel has already replaced Jadeja in the Indian squad for Asia Cup. As a result, the 28-year old player could be seen in action in the matches to come in the UAE. It was around 24 hours after Jadeja getting ruled out of Asia Cup that there was a development around him being in likeliness of missing action for 3-6 months due to a major surgery. Sharing a contrasting opinion from all the news reports doing rounds since evening, former India captain and current head coach Rahul Dravid has refused to accept just yet that Jadeja has been ruled out of the world event. Speaking during a press conference before India’s first Asia Cup 2022 Super 4 match against Pakistan in Dubai tomorrow, Dravid hinted at waiting and watching with respect to Jadeja as the World Cup is a “fair time away” from now. “[Ravindra] Jadeja has injured his [right] knee. He is under the care of medical team. World Cup is fair time away. Let’s not jump and say he is out. I don’t want to rule him out [just yet],” Dravid told the reporters. ICC T20 World Cup 2022 will be played between October 16 – November 13.","pubDate":"2022-09-03 15:27:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ryan Burl, who once had to tweet asking for decent shoes to play in international cricket, stuns Australia with a five-for in a historic victory","link":"https://indianexpress.com/article/sports/cricket/ryan-burl-who-once-had-to-tweet-asking-for-decent-shoes-to-play-in-international-cricket-stuns-australia-with-a-five-for-in-a-historic-victory-8129195/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":"David Warner and Glenn Maxwell were threatening to pull Australia from the depths of 72 for 5, counter attacking their way out of trouble, when Zimbabwe brought on their part-time legspinner Ryan Burl. Until now, for most Indian fans, Burl might be a name associated with a viral tweet. We shall come to that later, but first a recap of the knock-out punch he delivered. Australia had recovered to 129 when Burl struck in his first over. For a part-timer, it was a gorgeous leg break, loopy, dipping, and all the jazz. Maxwell was dragged out by his aggression but at one point, must have known he was had. Done in. Sold. Stranded. And he was. He attempted to swing his bat through the line but the ball not only dipped but spun, taking the leading edge for Burl to settle under it. 1️⃣8⃣ balls 👉 5️⃣ wickets 👉 1️⃣ Ryan Burl! 🤩 📹 | Watch and rate this match-winning performance out of 1️⃣0️⃣, in the comments below 🙌 #AUSvZIM #SonySportsNetwork #RyanBurl @ryanburl3 pic.twitter.com/NHoJT7MwQJ — Sony Sports Network (@SonySportsNetwk) September 3, 2022 Next man Ashton Agar was surprised by a full toss from Burl that he tamely tapped to short midwicket for a duck. Warner was still at it, swinging away, when Burl removed him. Much of the focus might be on the catch – it was a rebound catch that had threatened to spill out Brad Evans’ hands running in from deep midwicket but it was a pretty fine delivery. It started from outside leg, outside Warner’ front leg, well clear of it actually, and drifted right across him to land outside off, and skid away. Warner had understandably chosen the slog sweep, looking at where the ball had started but was done in by the drift and the away skid, and couldn’t connect well. A moment I’ll cherish forever! https://t.co/de4He3uvP0 — Ryan Burl (@ryanburl3) September 3, 2022 When Mitch Starc tried a feeble attempt at a heave-ho, Burl’s really full delivery had landed almost near the base of stumps. And Josh Hazlewood was done in by the drifter that took the edge to the ‘keeper. Ryan Burl’s figures read a mind-boggling 5 for 10 from 3 overs. The Shoe Viral moment Time to put the glue away, I got you covered @ryanburl3 💁🏽 https://t.co/FUd7U0w3U7 — PUMA Cricket (@pumacricket) May 23, 2021 In May 2021, Burl had had enough tinkering with his shoe. The soles had come off again. He put out a tweet, with a pic of his shoe, tagging a sports manufacturer and asked a question: ‘“Any chance we can get a sponsor so we don’t have to glue our shoes back after every series?” 31.7k Likes, 1007 Quote Tweets, 5408 Retweets followed. The tagged sports manufacturer didn’t respond but sportswear giant Puma did. Advertisement “Time to put the glue away, I got you covered,” Puma replied to the tweet. Soon, Burl was tweeting happily that he was happy to be sponsored by Puma. Fish Allergy hospitalisation GET WELL SOON! @ryanburl3 missed today’s ODI in Hambantota after he was hospitalised last night for an allergic reaction to fish #SLvZIM pic.twitter.com/SO96Y4jFfb — Zimbabwe Cricket (@ZimCricketv) July 6, 2017 In 2017, Burl, who was in Sri Lanka for a series, was hospitalised due to an allergic reaction to fish. Zimbabwe cricket put up a picture, with tubes sprawling all over Burl from the hospital. Later, Burl also shared a picture of the hospital staff with him on his Twitter account, thanking them for helping him recover. He also said that it was a ‘terribly frightening experience’. “Thank you very much to the doctors and staff at Hambantota hospital for helping me recover! A terribly frightening experience,” he wrote. Country over county Burl was studying in England , and was probably about to plunge into a life of cricket in county circuit but he was in double minds. When a call came from his home country to play first-class cricket, he jumped at it. “I was really young. I was studying at a university in Southampton at that time (in 2013-14). I wasn’t totally sure where my career or my life was going. You are quite naive when you are 19 or 20. I couldn’t turn down the opportunity to play for my country. That pride and passion to play for my country obviously led to my decision,” Burl told Hindustan Times. “ I moved back to Zimbabwe. I stopped university, stopped any pursuit of county cricket and just wanted to give Zimbabwe Cricket my everything,” The Ban Advertisement But there were to be more setbacks. The ICC banned Zimbabwe for government interference in administration and financial instability, and though they would revoke the suspension, it effectively ruled them out of the 2019 T20 world qualifiers held in India. They also didn’t make it for the 2019 ODI world cup in England. “It’s kind of hard to explain those emotions,” Burl said then. “At that time, there was so much uncertainty. You don’t know what was going on and then obviously, after that there came Covid… There was a feeling, am I ever gonna play? In the 2019 ODI World Cup, we missed out (qualification) by a couple of runs. We were not eligible to take part in the T20 World Cup. It was very difficult. I was honestly unsure and uncertain (about the future). We shed a lot of tears and kind of somehow wanted to get past that period.” Luckily, for Burl and Zimbabwe, things have begun to progress well this year. Under the coach Dave Houghton, former Zimbabwean captain, they have beaten Bangladesh and now won their first ODI in Australia. Subscriber Only Stories View All Premium UPSC Essentials: Weekly news express with MCQs— World’s fifth bigge... Premium The beauty of Hardik Pandya: When bold and bizarre is actually brilliant Premium Delhi Confidential: Rajeev Chandrasekhar, son of IAF officer, has persona... Premium Kochi to Bokaro, Kolkata to Pune: INS Vikrant an all-India effort Subscribe Now to get 64% OFF For a teenager who chose country over county, cried when they were banned, pleaded for a decent shoe, Ryan Burl’s greatest moment under the sun Down Under would be his five-for: the day he got David Warner and Glenn Maxwell and shook Australia.","pubDate":"2022-09-03 15:05:04","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly withdraws name from Legends League Cricket opener, here's why","link":"https://www.indiatvnews.com/sports/cricket/sourav-ganguly-withdraws-name-from-legends-league-cricket-opener-here-s-why-2022-09-03-805204","keywords":null,"creator":null,"video_url":null,"description":"BCCI President Sourav Ganguly has declared his withdrawal from the Legends League Cricket match for the Indian Maharajas against Eoin Morgan-led World Giants. The match is scheduled for September 16 at the Eden Gardens in Kolkata.","content":"BCCI President Sourav Ganguly has declared his withdrawal from the Legends League Cricket match for the Indian Maharajas against -led World Giants. The match is scheduled for September 16 at the Eden Gardens in Kolkata. In a letter addressed to the League, Sourav said, “I would like to convey my best wishes for your Legends League initiative. It's a wonderful idea of bringing retired cricketers back on the cricket field and engaging with fans across generations. I am thankful to you for offering me an opportunity to play in the one-off Legends League game at the Eden Gardens stadium in Kolkata on September 16, 2022,\" he wrote. “However due to my professional commitments and continuous work with cricket administration, I will not be able to take part in this game. I am sure the fans are eagerly looking forward to this league and there will be large crowds at the stadium. The league is bringing together the stalwarts of the game and I am sure there will be exciting cricket on display. I will be there at the Eden Gardens Stadium watching the match,” he added. The second edition of Legends League Cricket will open with a match between India Maharajas and World Giants to celebrate the 75th year of India's independence. The tournament will commence a day after the special match, i.e. from September 17 till October 8, which will feature four teams taking part in a franchise-based format. LLC will be played over the course of 22 days, with a total of 15 matches scheduled this season.","pubDate":"2022-09-03 14:26:52","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Who replaced Jadeja: Who will replace Jadeja in India squad for ICC T20 World Cup 2022?","link":"https://thesportsrush.com/cricket-news-who-replaced-jadeja-who-will-replace-jadeja-in-india-squad-for-icc-t20-world-cup-2022/","keywords":["Cricket","asia cup","Asia Cup 2022","ICC T20 World Cup 2022","India","Ravindra Jadeja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Who will replace Jadeja: The Indian all-rounder has been shockingly ruled out of ICC T20 World Cup 2022 in Australia. It was only around 24 hours ago that India all-rounder Ravindra Jadeja had been ruled out of Asia Cup 2022 due to a right knee injury. An official release from the BCCI (Board of Control… The post Who replaced Jadeja: Who will replace Jadeja in India squad for ICC T20 World Cup 2022? appeared first on The SportsRush.","content":"Who will replace Jadeja: The Indian all-rounder has been shockingly ruled out of ICC T20 World Cup 2022 in Australia. It was only around 24 hours ago that India all-rounder Ravindra Jadeja had been ruled out of Asia Cup 2022 due to a right knee injury. An official release from the BCCI (Board of Control for Cricket in India) had provided a major setback to an Indian team which had just begun to make more use of Jadeja’s batting in the shortest format. It is now being learnt that the extent of Jadeja’s injury is so severe that he will have to undergo a major knee injury. As a result, the 33-year old player will remain out of action for an indefinite period of time. The development means that Jadeja has been ruled out of the ICC T20 World Cup 2022 in Australia next month. Jadeja, who has been facing a knee issue for almost a year now, is expected to remain away from the sport for a good 3-6 months. The exact time period will only be confirmed after appropriate diagnosis of the injury. “[Ravindra] Jadeja’s right knee injury is pretty serious,” a senior BCCI official told PTI . “He is supposed to undergo a major knee surgery and will be out of action for indefinite period of time. At this point, if one goes by the assessment of the NCA’s medical team, one can’t put a timeline on his imminent international comeback.” While all-rounder Axar Patel was named Jadeja’s replacement for the ongoing Asia Cup, the senior selection committee is yet to name a 15-member Indian squad for the World Cup. Patel, who was among the three reserves for Asia Cup 2022 , appears to be the likeliest of options to take Jadeja’s spot in the World Cup squad. A like-for-like replacement, Patel’s recent drastic improvement with the bat in hand has it in it to shush doubters, if any. Jadeja’s absence could also present more opportunities in the Playing XI for all-rounder Deepak Hooda. Not as proficient a bowler as Jadeja or Patel, Hooda does comprise an ability of bowling a couple of overs in a T20I. With all-rounder Hardik Pandya also in the XI, India haven’t really used Jadeja for a full four-over quota in the recent times.","pubDate":"2022-09-03 14:05:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan LIVE: Cricket score and updates from Asia Cup","link":"https://ca.sports.yahoo.com/news/india-vs-pakistan-live-cricket-140023092.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-09-03 14:00:23","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Ravindra Jadeja set to miss T20 World Cup; will undergo knee surgery","link":"https://www.thehindu.com/sport/cricket/ravindra-jadeja-set-to-miss-t20-world-cup-will-undergo-knee-surgery/article65845659.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"It will take a considerable amount of time and a thorough rehabilitation programme before Jadeja can make a comeback to international cricket.","content":null,"pubDate":"2022-09-03 13:45:01","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Pakistan pacer Shahnawaz Dahani ruled out of India game with side strain","link":"https://www.tribuneindia.com/news/sports/asia-cup-pakistan-pacer-shahnawaz-dahani-ruled-out-of-india-game-with-side-strain-428272","keywords":null,"creator":null,"video_url":null,"description":"Dubai, September 3Pakistan pacer Shahnawaz Dahani has been ruled out of Sunday's marquee Super Fours clash against arch-rivals India in the Asia Cup here due to a suspected side strain.According to ESPN Cricinfo, the speedster, who played a cameo against India in their tournament opener last Sunday, will be monitored for the next 48-72 hours by the Pakistan Cricket Board's (PCB) medical team.Dahani took one wicket in the two matches that he has played in the tournament, at an economy rate of 6.Pakistan have two pacers—Mohammad Hasnain and Hasan Ali—and a spinner in Usman Qadir on the bench as potential replacements for Dahani.Babar Azam's side crushed Hong Kong by 155 runs on Friday to seal its spot in the final four of the tournament, days after losing their opener to India by five wickets.","content":null,"pubDate":"2022-09-03 13:39:18","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1060056775.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022, Live Cricket Score, Sri Lanka vs Afghanistan","link":"https://timesofindia.indiatimes.com/sports/cricket/asia-cup/sl-vs-afg-t20-live-cricket-score-updates-asia-cup-3-sep/liveblog/93972288.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-09-03 13:32:17","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"“Well played, Champ”: RCB extol Rajat Patidar for scoring century in India A vs New Zealand A Test at Chinnaswamy Stadium","link":"https://thesportsrush.com/cricket-news-well-played-champ-rcb-extol-rajat-patidar-for-scoring-century-in-india-a-vs-new-zealand-a-test-at-chinnaswamy-stadium/","keywords":["Cricket","India A","Indian Premier League","New Zealand A","Rajat Patidar","RCB","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"RCB extol Rajat Patidar: The India A batter is on the verge of playing a career-best knock in first-class cricket. During the third day of the first Test of the ongoing New Zealand A’s tour of India in Bengaluru, India A batter Rajat Patidar became the third centurion of the match to cash in on… The post “Well played, Champ”: RCB extol Rajat Patidar for scoring century in India A vs New Zealand A Test at Chinnaswamy Stadium appeared first on The SportsRush.","content":"RCB extol Rajat Patidar: The India A batter is on the verge of playing a career-best knock in first-class cricket. During the third day of the first Test of the ongoing New Zealand A’s tour of India in Bengaluru, India A batter Rajat Patidar became the third centurion of the match to cash in on the batting-friendly conditions. Coming in to bat at No. 4 in the second over of the day, Patidar remained unbeaten to walk back after scoring 170* (241) with the help of 14 fours and four sixes. Patidar, who shared a 104-run partnership for the third wicket with fellow centurion Abhimanyu Easwaran (132), is in the middle of a 167-run fifth-wicket partnership alongside Tilak Varma (82*). In what is Patidar’s ninth first-class century, the 29-year old player has a chance of going past his career-best score of 196 and register a maiden first-class double century tomorrow. RCB extol Rajat Patidar for scoring century in India A vs New Zealand A Test at Chinnaswamy Stadium With this India A vs New Zealand A series not available for viewing on any television or streaming platform, details about the kind of shots Patidar played aren’t available. That being said, having brought up a century at the M. Chinnaswamy Stadium, Patidar couldn’t help but allure the attention of his Indian Premier League franchise Royal Challengers Bangalore. Readers must note that the right-handed batter had scored a maiden IPL century in IPL 2022 Eliminator between Lucknow Super Giants and Bangalore at the same venue in May this year. A month later, Patidar scored a century in Ranji Trophy final to follow it with today’s knock. With Patidar’s last three centuries in representative cricket coming here, RCB were quite pinpoint in observing his Bengaluru connection. – First IPL for RCB against LSG in the Ranji Trophy final at the Chinnaswamy Stadium First for India A at the Chinnaswamy Stadium 1⃣7⃣0⃣* (241) v NZ A Well played, Champ!#PlayBold pic.twitter.com/3ssVPiBiBB — Royal Challengers Bangalore (@RCBTweets) September 3, 2022 Having made his IPL debut only last year, Patidar has scored 404 runs in 11 innings at an average and strike rate of 40.40 and 144.29 respectively. The post “Well played, Champ”: RCB extol Rajat Patidar for scoring century in India A vs New Zealand A Test at Chinnaswamy Stadium appeared first on The SportsRush.","pubDate":"2022-09-03 13:27:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kala Jaadu: Pakistan cricket fans troll Hasan Ali as Shahnawaz Dahani gets injured ahead of IND vs PAK clash","link":"https://zeenews.india.com/cricket/shahnawaz-dahani-ruled-out-hasan-ali-trends-on-twitter-as-shahnawaz-dahani-gets-injured-ahead-of-ind-vs-pak-clash-in-asia-cup-2022-super-4s-2505395.html","keywords":null,"creator":null,"video_url":null,"description":"As soon as the news of the injury broke, Pakistan cricket fans started trolling Hasan Ali as he is most likely to replace Dahani in the playing XI against India on Sunday.","content":"Pakistan cricket team received a major blow ahead of their Super 4 clash against Team India in the ongoing Asia Cup 2022 on Sunday as their pacer Shahnawaz Dahani has been ruled out of the match due to a suspected side strain. The injury happened while bowling in the match against Hong Kong in Sharjah on Friday. As is the case with any suspected side strain injury, the medical team will monitor him for the next 48-72 hours, following which they will make decisions, including carrying out a scan and further participation in the tournament. As soon as the news of the injury broke, Pakistan cricket fans started trolling Hasan Ali as he is most likely to replace Dahani in the playing XI against India on Sunday. Here's how Pakistan fans reacted to the news - Hasan Ali after listening Dahani's Injury news #pakvsindia pic.twitter.com/NppWFIfyrI — Abdul Wahab (@Awahabo_o) September 3, 2022 @Rizzvi73 @wwasay Yeh Hasan Ali kaunsa kala jaadu karta hai abb Dahani bhe injure...aapka show dekhta hai lagta hai jiski aap tareef karte ho uska patta saaf kardeta hai — Hemang bhabhra (@BhabhraHemang) September 3, 2022 Kismat ho tou Hasan Ali jasi__ — Farah7 (@Farah_JinMin) September 3, 2022 Meanwhile hasan ali after he heared the news of injury: #AsiaCup2022 #Dahani https://t.co/qm091BsXdH pic.twitter.com/xgSnbLkD7T — Muhammad zeeshan (@zeshanmohmnd) September 3, 2022 Another blow for Pakistan as Shahnawaz dahani is ruled out from Asia Cup. Hasan Ali or Hasnain will play Tommorow aganist India #AsiaCupT20 pic.twitter.com/IVAc8LSnW2 — ____ (@wani_sahil_) September 3, 2022 pic.twitter.com/C2D4vMHeff — ZulQarNain Aftab__ (@zulqarnain7777) September 3, 2022 Guess who's back_.back again _ pic.twitter.com/3jliWP0vwR — KSal (@ksal786) September 3, 2022 Dahani is the third pacer from Pakistan to be down with an injury in the recent times after Shaheen Shah Afridi (right knee ligament injury) and Mohammad Wasim Jr. (side strain). \"Shahnawaz Dahani will not be available for Sunday's ACC T20 Asia Cup Super-4 match against India due to a suspected side strain. The injury happened while bowling in the match against Hong Kong in Sharjah on Friday,\" said the PCB in an official update. In Pakistan's 155-run thrashing of Hong Kong on Friday, Dahani had figures of 1/7 in two overs. In an earlier match against India in Group A held last Sunday, Dahani had hit 16 runs apart from figures of 0/29 in four overs. \"As is the case with any suspected side strain injury, the medical team will monitor him for the next 48-72 hours, following which they will make decisions, including carrying out a scan and further participation in the tournament,\" added the PCB. In four T20Is, right-arm pacer Dahani had picked three wickets while in two ODIs, he has one scalp. Pakistan's other pace bowling options ahead of their Super Four match against India at the Dubai International Stadium on Sunday include Naseem Shah, Haris Rauf, Hasan Ali and Mohammad Hasnain.","pubDate":"2022-09-03 13:25:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Burl leads Zimbabwe to massive upset against Aussies","link":"https://www.cairnspost.com.au/sport/cricket/burl-leads-zimbabwe-to-massive-upset-against-aussies/video/fcc350b5ffee802e955cb7a718ab4bc9","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: An incredible five wicket haul from Ryan Burl has led Zimbabwe to their first ever win against Australia on their home soil.","content":null,"pubDate":"2022-09-03 13:09:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka vs Afghanistan, Asia Cup Super 4, LIVE SCORE Ball by Ball commentary: SL face AFG","link":"http://www.firstpost.com/firstcricket/sports-news/sri-lanka-vs-afghanistan-live-cricket-score-asia-cup-updates-commentary-streaming-11176921.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Sri Lanka vs Afghanistan, Asia Cup Super 4, LIVE SCORE Ball by Ball commentary: SL face AFG","content":"18:28 (IST)Afghanistan have been in some good form having won both their group matches against Sri Lanka and Bangladesh respectively. Sri Lanka on the other hand, marched into the Super 4s with a win against Bangladesh in a close finish18:06 (IST)Hello and welcome to the LIVE COVERAGE of the Super 4 match between Sri Lanka and Afghanistan Sri Lanka vs Afghanistan, Asia Cup Super 4, LIVE CRICKET SCORE and UPDATES, Ball by Ball updates: Hello and welcome to the LIVE COVERAGE of the Super 4 match between Sri Lanka and AfghanistanPREVIEW: The Super 4 stage of the Asia Cup 2022 is set to begin with Sri Lanka taking on Afghanistan in Sharjah. Afghanistan had topped their group with wins against the Lankan Lions as well Bangladesh. Sri Lanka registered a place in the Super 4s with a stunning win against Bangladesh in a close encounter.The last time when these two sides locked horns with each, Afghanistan had rattled the Sri Lankan batting line up and bowled them out for 105 in the opening clash of the tournaments. Later, the openers gave the final touch as the Afghan side clinched a win by 8 wickets in that particular game.SQUADS:Afghanistan: Hazratullah Zazai, Rahmanullah Gurbaz(w), Ibrahim Zadran, Mohammad Nabi(c), Najibullah Zadran, Karim Janat, Rashid Khan, Azmatullah Omarzai, Naveen-ul-Haq, Mujeeb Ur Rahman, Fazalhaq Farooqi, Samiullah Shinwari, Hashmatullah Shahidi, Afsar Zazai, Fareed Ahmad Malik, Usman Ghani, Noor AhmadSri Lanka: Pathum Nissanka, Kusal Mendis(w), Charith Asalanka, Danushka Gunathilaka, Bhanuka Rajapaksa, Dasun Shanaka(c), Wanindu Hasaranga, Chamika Karunaratne, Maheesh Theekshana, Asitha Fernando, Dilshan Madushanka, Dinesh Chandimal, Dhananjaya de Silva, Jeffrey Vandersay, Ashen Bandara, Praveen Jayawickrama, Nuwanidu Fernando, Pramod Madushan, Matheesha Pathirana, Nuwan ThusharaRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-03 13:00:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/SL-vs-AFG-LIVE-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India 'A' vs New Zealand 'A': Rajat Patidar continues form, notches up ton to put hosts in commanding position","link":"https://www.firstpost.com/firstcricket/sports-news/india-a-vs-new-zealand-a-rajat-patidar-continues-form-notches-up-ton-to-put-hosts-in-commanding-position-11176561.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India 'A' vs New Zealand 'A': Rajat Patidar continues form, notches up ton to put hosts in commanding position","content":"Rajat Patidar continued his stunning form with the bat as he struck a ton against New Zealand ‘A’ while playing for India ‘A’ in the first unofficial Test in Bengaluru. The right-handed batter remained unbeaten at 170 at stumps on Day 3 as the home side took a 92-run lead before the end of day’s proceedings.The visiting side had earlier posted 400, riding on a 197 from Joe Carter but India ‘A’ responded well as openers Priyank Panchal and Abhimanyu Easwaran provided a brilliant start. The two batters put up a partnership of 123 runs before captain Pancha was sent back for 47. Easwaran, on the other side, notched up a century.India ‘A’ had lost a couple of wickets at regular intervals and were 157/2 when Easwaran was joined by Patidar. They stitched a stand of 104 runs for the third wicket before Easwaran eventually departed for 132. Patidar was then joined by in-form Sarfaraz Khan who scored 36 before getting out. He was replaced by Tilak Varma.Varma and Patidar then dominated the Kiwis thoroughly and added 167 before stumps were called. Varma is not out on 82 as India ‘A’ have already put 492/4 in the first innings.Patidar has been in sublime touch for quite some time now and has been scoring runs consistently. While he struck a century in the IPL earlier this year, he followed it with some fine performance in the Ranji Trophy for Madhya Pradesh as well and helped the side lift the trophy. He in fact scored a century in the Ranji Trophy final as well.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-03 12:42:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Rajat-Patidar-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Weather at Lords today: Lord’s Cricket Ground weather London for The Hundred final 2022","link":"https://thesportsrush.com/cricket-news-weather-at-lords-today-lords-cricket-ground-weather-london-for-the-hundred-final-2022/","keywords":["Cricket","Lord's stadium","Manchester Originals","The Hundred","The Hundred 2022","Trent Rockets"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Weather at Lords today: The SportsRush presents before you the weather prediction for The Hundred 2022 Final matches. The second season of The Hundred will come to an end with both the men’s and women’s finals to be played at Lord’s today. The final matches will bring an end to a 32-day entertainment-filled The Hundred… The post Weather at Lords today: Lord’s Cricket Ground weather London for The Hundred final 2022 appeared first on The SportsRush.","content":"Weather at Lords today: The SportsRush presents before you the weather prediction for The Hundred 2022 Final matches. The second season of The Hundred will come to an end with both the men’s and women’s finals to be played at Lord’s today. The final matches will bring an end to a 32-day entertainment-filled The Hundred 2022 tournament. Barring a few rounds of County Championship 2022, only an England vs South Africa will remain in this English summer post Saturday. Scheduled to begin in around a couple of hours from now, The Hundred 2022 Women’s final will be played between table-toppers Oval Invincibles and Southern Brave. The match will be followed by men’s table-toppers in Trent Rockets and Manchester Originals. While the women’s match will be a rematch of The Hundred 2021 final as the same two teams had qualified for the final last year as well, both The Hundred 2022 Men’s finalists will be playing their first-ever final later in the day. Having said that, last season’s men’s and women’s finals were also played the same venue. Game day… ‼️ catch our final live on Supersport 16:00 CAT #thehundred #ovalinvincibles pic.twitter.com/E0fBCrNViZ — Marizanne Kapp (@kappie777) September 3, 2022 While weather has been conducive for uninterrupted play to happen for most part of The Hundred 2022, there’s a chance of it playing spoilsport in the afternoon and evening of the final today. A pleasant day in London will comprise of a cloud cover as high as 100% throughout the day. As far as the rain probability according to AccuWeather is concerned, there’s a 51% probability of rain to pour down at the start time of the Women’s match at Lord’s. ALSO READ: Marizanne Kapp believes Nat Sciver deserves to play The Hundred 2022 final A favourable update for all the stakeholders is that this number is expected to decrease as the day progresses. While one would want rain to stay away from the venue to let players participate in a full-fledged match, fans are suggested to be prepared to play the waiting game assuming that the weather prediction holds true. 03:00 PM – 23 degree (Rain Probability – 51%). 04:00 PM – 23 degree (Rain Probability – 47%). 05:00 PM – 23 degree (Rain Probability – 32%). 06:00 PM – 22 degree (Rain Probability – 32%). 07:00 PM – 21 degree (Rain Probability – 26%). 08:00 PM – 20 degree (Rain Probability – 15%). 09:00 PM – 19 degree (Rain Probability – 15%). 10:00 PM – 19 degree (Rain Probability – 15%).","pubDate":"2022-09-03 12:21:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"SL vs AFG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Asia Cup 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3NsLXZzLWFmZy1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtYXNpYS1jdXAtMjAyMi0yL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SL vs AFG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Asia Cup 2022  Cricket AddictorSri Lanka vs Afghanistan, Super Four, Match 1: Preview  CricbuzzMatch Preview - Sri Lanka vs Afghanistan, Asia Cup 2022, Super 4  ESPNcricinfoStory of 'Naagin dance': The mocking jibe during Bangladesh vs Sri Lanka match  Hindustan TimesRevitalised Sri Lanka get another crack at high-flying Afghanistan | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-09-03 12:09:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"सौरव गांगुली ने लीजेंड्स लीग क्रिकेट से क्यों लिया अपना नाम वापस? जानिए BCCI अध्यक्ष की जुबानी","link":"https://hindi.news18.com/news/sports/cricket-sourav-ganguly-pulls-out-of-legends-league-cricket-due-to-professional-commitments-charity-match-on-16-september-4541139.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Sourav Ganguly Legends League Cricket: भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष सौरव गांगुली ने लीजेंड्स लीग क्रिकेट से अपना नाम वापस ले लिया है. गांगुली निजी और व्यस्त कार्यक्रमों का हवाला देते हुए इस लीग से हटने का फैसला लिया है. टीम इंडिया के पूर्व कप्तान गांगुली को वर्ल्ड जायंट्स के खिलाफ मुकाबले में इंडिया महाराज टीम की कप्तानी करनी थी.","content":null,"pubDate":"2022-09-03 11:59:43","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/09/Ravindra-Jadeja-4-16622060003x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Babar Azam reveals GAME PLAN ahead of India clash, Pakistan to relay on THESE two players in Super 4 of Asia Cup 2022","link":"https://zeenews.india.com/cricket/ind-vs-pak-asia-cup-2022-super-4s-babar-azam-reveals-game-plan-ahead-of-india-clash-counting-on-naseem-shah-and-shahnawaz-dahani-2505352.html","keywords":null,"creator":null,"video_url":null,"description":"Mohammad Rizwan's unbeaten 78 followed by Shadab Khan's four-wicket haul guided Pakistan to a massive 155 runs victory over Hong Kong in the ongoing Asia Cup 2022 here at the Sharjah Cricket Stadium on Friday.","content":null,"pubDate":"2022-09-03 11:54:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Asia Cup: IND vs PAK Head-to-Head Records and Stats","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-pakistan-asia-cup-ind-vs-pak-head-to-head-records-and-stats-11173871.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"India vs Pakistan Asia Cup: IND vs PAK Head-to-Head Records and Stats","content":"Less than a week has passed since India and Pakistan faced each other in the Asia Cup group stage. Now global cricket fans have got another chance to witness the marquee clash. Pakistan’s massive 155-run victory against Hong Kong paved the way for the mega clash. India and Pakistan will lock horns for the Asia Cup Super 4 match at the Dubai International Stadium at 7:30 PM IST. After a breathtaking group league encounter, fans are eagerly waiting for another thriller.In the previous match, India outclassed their arch-rivals in each department and registered a 5-wicket win. Pakistan batted first but could not put up their desired total, thanks to Bhuvneshwar Kumar and Hardik Pandya’s exceptional spells. Skipper Babar Azam looked pale. He needs to take more responsibility and lead the Pakistan batting lineup to put up strong competition in front of this high-flying Indian side. On the other side, India have been in outstanding form. Every member of the unit is capable of taking the charge when the team needs it. All eyes will be on Hardik Pandya, who stole the show in the previous encounter.Pakistan did not face much resistance in making their way to the Super Four. Yesterday, at Sharjah, they demolished the Hong Kong batting unit powered by the spells of Shadab Khan, Naseem Shah and Mohammad Nawaz. Hong Kong were bundled out for just 38 runs, while the target was a mammoth 194 runs. This can be a huge confident booster for Pakistan.India vs Pakistan T20I Head-to-Head:Match Played: 10India: 8Pakistan: 2Tied: 0No Result: 0India vs Pakistan Previous T20 International:In the last clash between these two sides, India beat Pakistan by 5 wickets at the Dubai International Stadium on 28 August 2022.Last 5 T20I Results:India won by 5 wickets.Pakistan won by 10 wickets.India won by 6 wickets.India won by 5 wickets.India won by 7 wickets.Probable Playing 11s:India: Rohit Sharma (c), KL Rahul, Virat Kohli, Suryakumar Yadav, Rishabh Pant (wk), Hardik Pandya, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Yuzvendra Chahal.Pakistan: Mohammad Rizwan, Babar Azam (c), Fakhar Zaman, Iftikhar Ahmed, Khushdil Shah, Shadab Khan, Haider Ali, Mohammad Nawaz, Naseem Shah, Haris Rauf, Shahnawaz Dahani.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-03 11:50:35","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/India-vs-Pakistan-10.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}