{"newsArray":[{"title":"T10 Franchise comes to Zimbabwe","link":"https://www.hmetro.co.zw/t10-franchise-comes-to-zimbabwe/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Curtworth Masango Zimbabwe Cricket (ZC) launched the inaugural edition of the Zim Afro T10 cricket tournament that will be played in August. The franchise is expected to bring cricket stars from around the world, with six privately-owned teams set to take part. ZC managing director, Givemore Makoni, said they had done all due diligence to […]","content":"H-Metro Curtworth Masango Zimbabwe Cricket (ZC) launched the inaugural edition of the Zim Afro T10 cricket tournament that will be played in August. The franchise is expected to bring cricket stars from around the world, with six privately-owned teams set to take part. ZC managing director, Givemore Makoni, said they had done all due diligence to ensure the tournament was clean. “There are a lot of leagues around the world and Zimbabwe doesn’t have one. “We are one of the 12 Test-playing nations so we need to have our own, but just as everyone is saying, we needed to do due diligence that whatever league we are going to be involved in is clean. “That is why it took us some time to come up with this,” he said. “We are busy as we want to be known for cricket. We have increased our tournaments as we want to keep our players busy. It’s one of the things that once contributed to our downfall as we didn’t have enough game time. “So, adding tournaments like this will create much-needed game time. We will not only focus on national team players, but also the fringe players and talented youngsters. “In terms of exposure, I think it will go a long way in growing our game.” Global T10 and Zim City founder, Shaji Ul Mulk, said he dreams of seeing cricket being introduced at the Olympics games. He said negotiating with the local board was a long process. “We have been negotiating with the board for about a year and the board had its own terms and conditions it had to approve and all that stuff. “So we are planning to do this in August. My personal dream is for cricket to be in the Olympic Games using this format because it is the perfect format that can be played at the Olympics,” he said.","pubDate":"2023-04-16 22:06:46","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raza makes IPL history","link":"https://www.chronicle.co.zw/raza-makes-ipl-history/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo SIKANDAR Raza made history in the Indian Premier League (IPL) after a brilliant all-round display saw him help his team, Punjab Kings to victory by two wickets over Lucknow Super Giants on Saturday. Raza, named Player of the Match, became the first Zimbabwean to pick up the accolade in the IPL. His 57 […]","content":"The Chronicle SIKANDAR Raza made history in the Indian Premier League (IPL) after a brilliant all-round display saw him help his team, Punjab Kings to victory by two wickets over Lucknow Super Giants on Saturday. Raza, named Player of the Match, became the first Zimbabwean to pick up the accolade in the IPL. His 57 runs off 42 deliveries was also the first half century by a Zimbabwean batsman in the world’s most lucrative T20 league. Tatenda Taibu and Raymond Price, the only other Zimbabweans to play in the IPL never scored half centuries to win the Player of the Match award. Taibu’s highest score in three IPL matches for the Kolkata Knight Riders in 2008 was 15 runs while Prince never batted in the only match he played for the Mumbai Indians in the 2011 season. Coming back to the playing 11 after being a substitute in their previous match, Raza took one wicket in two overs for 19 runs as they restricted Super Giants to 158/8 in 20 overs and went on to top score with 57 runs to help his team finish on 161/8 to win it with three balls remaining in the match. Sam Curran, son of the late former Zimbabwe captain and coach Kevin Curran starred with the ball for the Kings, picking up three wickets for 31 runs in his four over spell while South African Kagiso Rabada, returning to the team took two scalps for 34 runs in four overs as well. Arshdeep Singh, and Harpreet Brar had one wicket each. Super Giants captain Lokesh Rahul top scored with 74 runs off 56 balls. Coming in to bat at number five, Raza had a lot on his hands as the Kings were struggling on 45/3, missing the services of their in-form captain Shikhar Dhawan and the Zimbabwean managed to deliver a knock for the history books. His innings consisted of four fours and three sixes before he was caught with his team needing 21 runs to win from 13 balls with the game looking poised for a late twist. It was Shahrukh Khan saw the team through with an unbeaten 23 runs off 10 balls. Matthew Short was the second leading run getter for the Kings with 34 runs from 22 deliveries. Apart from being named Player of the Match, Raza was also named Commander of the Match by his team for his brilliant all-round performance. Leading cricket website ESPN CricInfo also had Raza as their Most Valuable Player for the match. It was the third win of the season for the Kings, which saw them move to six points. Their next match is on Thursday against Royal Challengers Bangalore. — @brandon_malvin","pubDate":"2023-04-16 22:04:57","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"BMCA development tourney a step in the right direction","link":"https://www.chronicle.co.zw/bmca-development-tourney-a-step-in-the-right-direction/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo THE two-day Under-16 development cricket tournament that was hosted by the Bulawayo Metropolitan Cricket Association (BMCA) on Friday and Saturday at Bulawayo Athletic Club (BAC) was a good show for the growth of grassroots cricket in the city and country as whole. The tournament saw four teams taking part with one coming from […]","content":"The Chronicle THE two-day Under-16 development cricket tournament that was hosted by the Bulawayo Metropolitan Cricket Association (BMCA) on Friday and Saturday at Bulawayo Athletic Club (BAC) was a good show for the growth of grassroots cricket in the city and country as whole. The tournament saw four teams taking part with one coming from Kwekwe while three were Bulawayo sides. The four teams were BAC High Performance Centre, Kwekwe Development, Emakhandeni High Performance Centre and the Elton Chigumbura Academy. Renowned development coach and one of the organisers of the tournament, Pollock Mubobo said the festival was good for the youngsters and was impressed with what he saw throughout the two days. “The good thing is that these are mainly Form Twos and Threes and they learnt a lot from the four games that they played and there was a good final at the end with good scores. When we talk about Zimbabwe Cricket we talk about these tournaments, grassroots, when you get the basics right and we get our base right in terms of grassroots then we will not have any problem. This is why we are trying to groom players from a young age,” said Mubobo. He added that moving from the first day to the final there was a lot of improvement and believes they are doing well and going further with grassroots cricket. As part of their development strategy, Mubobo said more similar tournaments are on the cards with the latest scheduled for later in the month where two teams from Mutare are also expected to grace the fiesta. The visiting coach from Kwekwe Development, Washington Nzira shared similar sentiments with Mubobo, stating that the tournament was good for his team who have been putting in the work. “I think it was important because we always want to improve and we have been practicing so just to get time to also test our skills. It was really good for the boys but above all, just to have fun and give the kids a sporting chance. Such a tournament is very important because it gives the kids the opportunity to work on their skills at grassroots level and when they go up, they will become top cricketers, this is a foundation,” said Nzira. In the final match played BAC emerged 57 runs winners over Kwekwe Development. BAC, batting first, scored 146/4 in 20 overs courtesy of a Nathan Mtuke 47 runs off 56 balls. The young Mtuke was run out with the last ball of their innings. Lwandle Moyo scored 26 runs from 31 balls while Pilate Ndlovu remained undefeated on 13 runs from 12 deliveries. Arnold Manhire and Dale Mlangeni took one wicket each for Kwekwe. In their defence, BAC managed to take early wickets to restrict their opponents. Mtuke, once again put up a good performance with the ball, taking two wickets for eleven runs in two overs. Christine Mutasa and the skipper, Pollock Mubobo (Junior) also put-up match winning performances with the ball, taking two wickets apiece for 13 and 21 runs respectively in two and three overs. Ndlovu and Barrack Hakufiwi each took one scalp. Emmanuel Magumise almost single handedly took the match away from BAC with a brilliant knock before Mutasa took a sublime catch to dismiss him on 41 runs from 23 balls as he top scored for Kwekwe. Tinotenda Rwauya scored 12 runs off nine deliveries as they were the only two batters to cross double figures for the visitors. — @brandon_malvin","pubDate":"2023-04-16 22:01:53","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Tendulkar Jnr makes IPL debut","link":"https://www.herald.co.zw/tendulkar-jnr-makes-ipl-debut/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"MUMBAI. — Arjun Tendulkar made his Indian Premier League debut yesterday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar.","content":"Arjun Tendulkar made his Indian Premier League debut yesterday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar. Standing at over six feet (1.83 metres) tall, the 23-year-old left-hander was given the new ball in the match against Kolkata Knight Riders at Mumbai’s Wankhede Stadium. Arjun went wicketless in his two overs, giving away 17 runs, in a match that Mumbai won and his proud father wrote an emotional note on social media. “Arjun, today you have taken another important step in your journey as a cricketer,” Tendulkar tweeted. “As your father, someone who loves you and is passionate about the game, I know you will continue to give the game the respect it deserves and the game will love you back.” Tendulkar added: “You have worked very hard to reach here, and I am sure you will continue to do so. This is the start of a beautiful journey. All the best!” The youngster joined five-time IPL winners Mumbai in 2021 — making his T20 debut for the state team the same year — but this was the first time he had been picked for the franchise. The paceman has played seven first-class matches for Goa, after shifting bases to the western state last year. CAPS United.. .................(1)1 IT was a big day for Zimbabwean long distance runner Givemore Mudzinganyama on Saturday as he emerged winner of the 2023 Totalsports Two Oceans Marathon on debut in Cape Town, South Africa. THE Zimbabwe National Soccer Supporters Association have described the impending visit by FIFA for a fact-finding mission on issues bedevilling the administration of local football as a huge leap in the right direction.","pubDate":"2023-04-16 22:00:39","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Moose Clothing Official National Team Sponsor of Sri Lanka Cricket series with Ireland and Pakistan","link":"https://www.ft.lk/sports/Moose-Clothing-Official-National-Team-Sponsor-of-Sri-Lanka-Cricket-series-with-Ireland-and-Pakistan/23-747354","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Moose Clothing Company has once again reaffirmed its commitment to the sport of Cricket by pledging to support Sri Lanka Cricket as the Official National Team Sponsor at the upcoming Ireland tour of Sri Lanka in April. The tour will include two test matches, with the first taking place from 16 April to 20 April, and the second taking place from 24 to 28 April, at the Galle International Stadium. Furthermore, the sponsorship will be extended and remain effective for the Sri Lanka vs Pakistan tour that is also set to take place shortly. Moose Clothing has maintained its long-standing collaboration with Sri Lanka Cricket supporting the National team with various sponsorships throughout the past couple of years. As a home grown brand, Moose Clothing is committed to empowering the National team at national and international levels. Moose Clothing CEO Hasib Omar said: “Cricket has always been a much-loved sport in Sri Lanka. We are delighted to partner with Sri Lanka Cricket as the official National Team Sponsor for the upcoming series. Hope this will be a thrilling series for the cricketing fans who will be expecting an exciting encounter. As a brand we are committed to support Sri Lanka Cricket and are hopeful that it will help bring added joy to the people.” The Sri Lankan team will be looking to continue to improve on their form and will be keen to use their home advantage to secure a win against Ireland in preparation for the upcoming Pakistan series. The Irish team on the other hand, can be expected to put up a good performance against the Sri Lankan national team. “I am certain that this partnership of Moose Clothing with Sri Lanka Cricket will support the firm gain vital exposure for its brand across continents, as the game of cricket is adored by millions of Sri Lankan fans spread around the world,” said Sri Lanka Cricket CEO Ashley De Silva. The Sri Lanka vs Ireland test series is set to be an exciting encounter which will commence right after the Sri Lankan Sinhala and Tamil New Year celebrations where cricketing fans would be eagerly awaiting the sporting spectacle to continue their celebrations. Moose Clothing said it is proud to support the national team of Sri Lanka Cricket and is looking forward to the team’s success in the upcoming Ireland tour anticipating outstanding performances from both teams and some memorable moments in the world of cricket.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Karunaratne, Mendis plunder centuries","link":"https://www.ft.lk/sports/Karunaratne--Mendis-plunder-centuries/23-747358","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Test minnows Ireland found out the hard way what Test cricket is all about when their bowlers were put to the sword by two of the best batsmen in the Sri Lanka Test side skipper Dimuth Karunaratne and Kusal Mendis who scored centuries on the opening day of the first cricket Test played at the Galle International Cricket Stadium yesterday. By the end of an arduous hot and humid day the Irish team trudged wearily back to their dressing room as Sri Lanka winning the toss and batting first on a belter of a pitch cruised to an imposing 386-4. Ireland’s only success of the first session came in the 15th over when Nishan Madushka opening the innings for the first time in his second Test edged a catch behind the wicket to Lorcan Tucker off Curtis Camphor for 29 ending an opening stand of 64 with Karunaratne. From there onwards it was the Karunaratne-Mendis show as they took full control of the hapless Irish attack and hit them to all parts of the ground putting on a second wicket partnership of 281 off 355 balls that was not broken until the 74th over. Ireland who had persevered all day under steaming conditions finally had some success in the final session when they snapped up the wickets of the two centurions Mendis for 144 and Karunaratne for 179 and also Angelo Mathews for a duck. Left-arm spinner George Dockrell trapped Mendis lbw on the sweep, Mathews edged a catch behind the wicket off a wide delivery from leg-spinner Ben White, and Karunaratne’s 371 minutes of patience was ended when he threw his bat at a delivery from seamer Mark Adair and edged a catch to Tucker for his third dismissal of the innings, shortly before the close. Mendis, a well-organised player is a difficult customer to bowl to once he gets in. He was good to watch in the 260 minutes he spent at the wicket displaying an array of strokes that brought him 18 fours and a six. He reached his ninth Test century with a four and a one-handed hit for six off Andy McBrine which broke the shackles the Ireland bowlers had imposed on him and Karunaratne in the first hour of the afternoon where the first nine overs of spin produced only 23 runs. Karunaratne made it very difficult for the Irish bowlers manoeuvring the ball around and holding up one end, which enabled Mendis to play risk free cricket. The Lankan skipper was determined to make this innings a big one reaching the boundary on 15 occasions in the 235 balls he faced. Starved of Test cricket for the year with Sri Lanka scheduled to play only six matches, Karunaratne made use of the opportunity to reach his 15th Test century off 139 balls inclusive of seven fours and brought up his 150 off 190 balls (13 fours). He looked assured in his stroke play working the ball around nicely in a chanceless innings to make his fifth score of over 50 in his last six Test innings. His last Test hundred was scored in March 2022 against India at Bangalore and since then he had made eight fifties. After experiencing tough conditions in New Zealand where the ball swung and bounced a lot, the Irish bowling to the Lankan batters was like a breath of fresh air. On a perfect batting strip, they made merry. Unfortunately for the Irish they lost the toss which meant that they had to spend the first day of the Test in sweltering heat. Ireland was tested physically and mentally in these hot and humid conditions with temperatures reaching 31 degrees Celsius and high humidity of 75%. For a country that experiences summer temperatures not higher than 15-20 degrees Celsius it was asking a lot and it was a real test for the Irish bowlers to try and contain the run flow in conditions and a pitch they are not familiar with. The heat affected their bowlers’ lines and lengths which were inconsistent. Sri Lanka included two seamers in their bowling attack and Sadeera Samarawickrama made his way back to the Test side for the first time in five years. He will keep wickets in a Test for the first time. The first four Tests he played was purely as a batsman. Ireland made one change from the Test against Bangladesh with evergreen left-arm spinner George Dockrell coming in for Graham Hume. Sri Lanka Cricket’s decision to allow free entry for the public to witness the Test series against Ireland brought in a fair number of spectators who braved the hot and humid conditions. Fans can enter the stadium via Gate Number 4 of the stadium on match days.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Top Indian cricketers won’t be allowed to play in Saudi Arabia bankrolled richest cricket league: BCCI official","link":"https://www.ft.lk/sports/Top-Indian-cricketers-won-t-be-allowed-to-play-in-Saudi-Arabia-bankrolled-richest-cricket-league--BCCI-official/23-747355","keywords":null,"creator":null,"video_url":null,"description":null,"content":"After staging Formula One races, owning Newcastle United, bringing Cristiano Ronaldo to play in the domestic league, and promoting the rival LIV golf circuit, cricket could be the next sport Saudi Arabia is venturing into. Officials from the kingdom have reportedly held discussions with those at the helm of the Indian Premier League with the intention of starting the world’s richest cricket tournament in the gulf nation. The two sides have been testing the waters with the relationship recently with ‘Visit Saudi’ being a major sponsor for the ongoing Indian Premier League. Saudi oil giant Aramco has had sponsorship deals with the International Cricket Council (ICC) and BCCI. The kingdom has set the strategic goal of becoming the No. 1 tourist destination for India by 2030. IPL franchises – such as Mumbai Indians, Chennai Super Kings, Kolkata Knight Riders, Delhi Capitals, Sunrisers Hyderabad, Rajasthan Royals, and Lucknow Super Giants – are already involved in overseas T20 leagues from UAE, South Africa, USA and Caribbean – but BCCI doesn’t allow Indian players to feature in any other domestic competition in the format fearing it will diminish the IPL’s brand value. Getting top Indian stars to play in an overseas domestic league could be the real game-changer in this regard and will definitely put the cat among the pigeons. But if the BCCI is to be believed, that’s not going to happen any time soon, even though IPL franchises can put their money wherever they want. “No current Indian players will be taking part in any of the leagues, but as far as franchise participation is concerned, we can’t stop them, a top BCCI official told The Indian Express. “It’s their individual decision. We have seen IPL franchises going to South Africa or Dubai and we can’t say no. It’s their choice to have their team in any of the leagues around the world.” The BCCI providing technical knowhow in organising a T20 league could be a start, with IPL franchises getting another market to invest. As of now, the UAE is the major cricketing destination in the gulf region and has hosted the T20 World Cup, IPL, Asia Cup and even bilateral series involving Full Member Nations. It also houses the ICC headquarters and has impressive cricket infrastructure and stadia in venues such as Dubai, Abu Dhabi and Sharjah. Saudi Arabia doesn’t have such infrastructure, but plans to set the ball rolling in this regard. “Our aim is to create a sustainable industry for locals and expats living in the Kingdom and make Saudi Arabia a global cricketing destination,” Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal Al-Saud has been quoted as saying by Arab News. “One of our biggest objectives is to bring better quality of life for expatriates working here. We have about eight million people from Asian countries where cricket is the most popular game, places such as India, Pakistan, Afghanistan, Bangladesh and Sri Lanka,” he added. The kingdom has extremely deep pockets and its interest in investing in the sport has the ICC enthused. “If you look at other sports they’ve been involved in, cricket is something I imagine would be attractive to them,” ICC Chair Greg Barclay was quoted as saying. (Source: )","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Saudi Arabia set to launch lucrative Twenty20 tournament","link":"https://www.ft.lk/sports/Saudi-Arabia-set-to-launch-lucrative-Twenty20-tournament/23-747356","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Saudi Arabia is reportedly investigating the possibility of launching what is likely to be the world’s most lucrative Twenty20 tournament after their cricket board chairman, Prince Saud bin Mishal al-Saud, declared his intention to make the nation “a global cricketing destination”. The Melbourne Age and Sydney Morning Herald said discussions have taken place between Saudi government representatives and owners of Indian Premier League teams, including about the possibility of Indian players – who have so far been banned from participating in overseas T20 competitions – being allowed to participate. Having made significant and controversial investments in football – including the purchase of Newcastle United – and golf, with the launch of the LIV Golf tour, Saudi Arabia has also started to build commercial relationships in cricket over recent years. Last October, the International Cricket Council agreed a global partnership with Saudi Aramco, the national petrol company, which includes involvement in the World Test Championship final between India and Australia at the Oval in June, and at the ODI World Cup in the autumn. In February, Saudi tourism authority joined Aramco among the IPL’s key sponsors. “If you look at other sports they’ve been involved in, cricket is something I imagine would be attractive to them,” the ICC chair Greg Barclay said. “Given their advance into sport more generally, cricket would work quite well for Saudi Arabia. They’re pretty keen to invest in sport and given their regional presence, cricket would seem a pretty obvious one to pursue.” Prince Saud was asked by Arab News last month if he was hoping to launch a professional cricket league in the country. “There will be leagues on all levels, not just one league,” he said. “We’ve developed great relationships with the ICC and the Asian Cricket Council, as well as some successful international cricket boards and big cricketers globally. And then we hired experts to help us develop a model of a league. Of course, a lot of infrastructure and development are required, but we’ll announce when it’s time.” Any new competition would be pitched into an overcrowded schedule and follow the launch of high-profile new leagues in South Africa and the UAE this year. With March and April dominated by the IPL, searing temperatures presenting a potentially insurmountable obstacle through the summer months and cold ruling out midwinter, a new tournament’s most likely home would be October and November. This year’s ODI World Cup, like the T20 events of 2021 and 2022, will be held in that period but there would then be no further clashes with global competitions until the ODI World Cup in South Africa and Zimbabwe in 2027. (Source:","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Tendulkar junior makes IPL debut","link":"https://www.ft.lk/sports/Tendulkar-junior-makes-IPL-debut/23-747353","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Arjun Tendulkar made his Indian Premier League debut on Sunday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar. Standing at over six feet (1.83 metres) tall, the 23-year-old left-hander was given the new ball in the match against Kolkata Knight Riders at Mumbai’s Wankhede Stadium. He joined five-time IPL winners Mumbai in 2021 – making his T20 debut for the state team the same year – but this was the first time he had been picked for the franchise. The paceman has played seven first-class matches for Goa, after shifting bases to the western state last year. His father, who has almost god-like status in cricket-mad India, began his career with Mumbai state’s junior team before being picked for the senior side at the age of 15. He won his first cap for India in 1989 before going on to become the highest Test scorer of all time as well as the first player to score 100 international centuries. He retired in 2013.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ollie Pope hits rapid century as Surrey claim crushing win over Hampshire","link":"https://www.independent.co.uk/sport/cricket/ollie-pope-hampshire-surrey-stuart-broad-tom-westley-b2320837.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Pope made 122 off 102 balls while Dom Sibley contributed 79 as the defending champions earned a nine-wicket win.","content":"Ollie Pope brought ‘Bazball’ to the LV= Insurance County Championship as he blazed an unbeaten 122 from 102 balls to lead Surrey to a crushing nine-wicket win over fellow title hopefuls Hampshire at the Kia Oval. Dom Sibley’s unbeaten 79 played the perfect anchor role for England batter Pope, who struck three sixes and 14 fours, as the second-wicket pair put on 193 in 30 overs to help Surrey chase down a target of 243 with the minimum of fuss. The comprehensive victory sent a powerful message to the rest of the division as the defending champions pulled away in destructive fashion in the final session of the game, with Pope finishing things off with back-to-back sixes. Surrey’s first victory of the campaign leaves them second in the table, three points behind Warwickshire after the Bears finally ended Kent’s stubborn resistance with just six overs to spare at Edgbaston. The hosts won by an innings and 14 runs when Kent all-rounder Joey Evison edged Hassan Ali behind to agonisingly fall for 99, having taken his side so close to salvaging an unlikely draw Defeat was on the horizon for the visitors as they stumbled to 99 for seven after following on 295 runs behind, but opener Ben Compton (88) and 21-year-old Evison added 100 in 25 overs to give Kent hope. Compton fell in the first over after tea but Evison and Conor McKerr then added 74 in 27 overs and Kent were within touching distance of a great escape when Will Rhodes caught McKerr at fourth slip before Evison fell victim to Ali’s outswinger. Essex are third in the top flight, four points behind Surrey, after their captain Tom Westley stood strong for nearly three hours to deny Lancashire victory at Chelmsford. Lancashire plundered 184 runs in a 28-over morning session, with 137 coming in the final 15 overs, as they declared on 351 for seven to set Essex a target of 340 off 68 overs. Lower-order trio Tom Hartley (73 not out), Colin de Grandhomme (38) and Tom Bailey (25 not out) clubbed 10 sixes and 10 fours between them as they laid siege to the Essex bowling attack in pursuit of victory. James Anderson then dismissed his former England captain Sir Alastair Cook for a duck as Essex’s reply started in dismal fashion, but Westley, with 43 off 120 balls, ensured that was just a minor setback as the hosts edged their way to 128 for four from 58 overs when the teams shook hands on the draw. Nottinghamshire’s home return to Division One got off to the ideal start with a 165-run victory over Somerset. Despite a two-day washout, Nottinghamshire claimed a convincing win as Somerset were bowled out for 129 midway through the afternoon session on Sunday after being set a target of 295 to win. Dane Paterson passed 500 first-class wickets with figures of five for 46, Brett Hutton finished with nine wickets in the match and England seamer Stuart Broad claimed his first wickets of the season as Nottinghamshire bounced back from their opening-round defeat at Hampshire in style. Also in Division One, Sam Whiteman hit a maiden half-century to help Northamptonshire pick up their first victory with a seven-wicket triumph over Middlesex. Fresh from his Sheffield Shield win last month, the Western Australia captain struck seven fours and a six in an unbeaten 60 as Northamptonshire reached their target of 119 just before lunch. Leicestershire went top of Division Two after securing valuable bonus points in their rain-affected draw with Derbyshire. No play was possible on the two previous days but centuries from captain Lewis Hill (162 not out) Colin Ackermann (114), followed by a fine spell of seam bowling by Chris Wright (four for 38), ensured Leicestershire maximised bonus points. The hosts declared on 451 for nine before Derbyshire finished on 253 for seven in their first innings, with Brooke Guest (92) and Wayne Madsen (75) leading the way. Durham moved up second in the table, level on 27 points with Worcestershire, after beating the Pears by 121 runs at the Riverside thanks to a five-wicket haul from Matthew Kuhnemann. Durham captain Scott Borthwick (108 not out) scored his first first-class century in two years as he and David Bedingham (86) put on a 196-run partnership to leave the hosts in prime position for victory. Worcestershire needed 314 to win from 70 overs after Durham declared on 254 for four but after losing two early wickets, the visitors only had a draw on their mind. Adam Finch and Dillon Pennington’s late partnership almost denied the home side but Australia spinner Kuhnemann (five for 53) removed the latter to secure Durham’s first win of the campaign.","pubDate":"2023-04-16 19:37:28","image_url":"https://static.independent.co.uk/2023/04/16/20/6e3c7b304e9248d4187eb7a7c87a87d9Y29udGVudHNlYXJjaGFwaSwxNjgxNzU0NTc3-2.68954295.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"T10 Franchise comes to Zimbabwe","link":"https://www.hmetro.co.zw/t10-franchise-comes-to-zimbabwe/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Curtworth Masango Zimbabwe Cricket (ZC) launched the inaugural edition of the Zim Afro T10 cricket tournament that will be played in August. The franchise is expected to bring cricket stars from around the world, with six privately-owned teams set to take part. ZC managing director, Givemore Makoni, said they had done all due diligence to […]","content":"H-Metro Curtworth Masango Zimbabwe Cricket (ZC) launched the inaugural edition of the Zim Afro T10 cricket tournament that will be played in August. The franchise is expected to bring cricket stars from around the world, with six privately-owned teams set to take part. ZC managing director, Givemore Makoni, said they had done all due diligence to ensure the tournament was clean. “There are a lot of leagues around the world and Zimbabwe doesn’t have one. “We are one of the 12 Test-playing nations so we need to have our own, but just as everyone is saying, we needed to do due diligence that whatever league we are going to be involved in is clean. “That is why it took us some time to come up with this,” he said. “We are busy as we want to be known for cricket. We have increased our tournaments as we want to keep our players busy. It’s one of the things that once contributed to our downfall as we didn’t have enough game time. “So, adding tournaments like this will create much-needed game time. We will not only focus on national team players, but also the fringe players and talented youngsters. “In terms of exposure, I think it will go a long way in growing our game.” Global T10 and Zim City founder, Shaji Ul Mulk, said he dreams of seeing cricket being introduced at the Olympics games. He said negotiating with the local board was a long process. “We have been negotiating with the board for about a year and the board had its own terms and conditions it had to approve and all that stuff. “So we are planning to do this in August. My personal dream is for cricket to be in the Olympic Games using this format because it is the perfect format that can be played at the Olympics,” he said.","pubDate":"2023-04-16 22:06:46","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raza makes IPL history","link":"https://www.chronicle.co.zw/raza-makes-ipl-history/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo SIKANDAR Raza made history in the Indian Premier League (IPL) after a brilliant all-round display saw him help his team, Punjab Kings to victory by two wickets over Lucknow Super Giants on Saturday. Raza, named Player of the Match, became the first Zimbabwean to pick up the accolade in the IPL. His 57 […]","content":"The Chronicle SIKANDAR Raza made history in the Indian Premier League (IPL) after a brilliant all-round display saw him help his team, Punjab Kings to victory by two wickets over Lucknow Super Giants on Saturday. Raza, named Player of the Match, became the first Zimbabwean to pick up the accolade in the IPL. His 57 runs off 42 deliveries was also the first half century by a Zimbabwean batsman in the world’s most lucrative T20 league. Tatenda Taibu and Raymond Price, the only other Zimbabweans to play in the IPL never scored half centuries to win the Player of the Match award. Taibu’s highest score in three IPL matches for the Kolkata Knight Riders in 2008 was 15 runs while Prince never batted in the only match he played for the Mumbai Indians in the 2011 season. Coming back to the playing 11 after being a substitute in their previous match, Raza took one wicket in two overs for 19 runs as they restricted Super Giants to 158/8 in 20 overs and went on to top score with 57 runs to help his team finish on 161/8 to win it with three balls remaining in the match. Sam Curran, son of the late former Zimbabwe captain and coach Kevin Curran starred with the ball for the Kings, picking up three wickets for 31 runs in his four over spell while South African Kagiso Rabada, returning to the team took two scalps for 34 runs in four overs as well. Arshdeep Singh, and Harpreet Brar had one wicket each. Super Giants captain Lokesh Rahul top scored with 74 runs off 56 balls. Coming in to bat at number five, Raza had a lot on his hands as the Kings were struggling on 45/3, missing the services of their in-form captain Shikhar Dhawan and the Zimbabwean managed to deliver a knock for the history books. His innings consisted of four fours and three sixes before he was caught with his team needing 21 runs to win from 13 balls with the game looking poised for a late twist. It was Shahrukh Khan saw the team through with an unbeaten 23 runs off 10 balls. Matthew Short was the second leading run getter for the Kings with 34 runs from 22 deliveries. Apart from being named Player of the Match, Raza was also named Commander of the Match by his team for his brilliant all-round performance. Leading cricket website ESPN CricInfo also had Raza as their Most Valuable Player for the match. It was the third win of the season for the Kings, which saw them move to six points. Their next match is on Thursday against Royal Challengers Bangalore. — @brandon_malvin","pubDate":"2023-04-16 22:04:57","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"BMCA development tourney a step in the right direction","link":"https://www.chronicle.co.zw/bmca-development-tourney-a-step-in-the-right-direction/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo THE two-day Under-16 development cricket tournament that was hosted by the Bulawayo Metropolitan Cricket Association (BMCA) on Friday and Saturday at Bulawayo Athletic Club (BAC) was a good show for the growth of grassroots cricket in the city and country as whole. The tournament saw four teams taking part with one coming from […]","content":"The Chronicle THE two-day Under-16 development cricket tournament that was hosted by the Bulawayo Metropolitan Cricket Association (BMCA) on Friday and Saturday at Bulawayo Athletic Club (BAC) was a good show for the growth of grassroots cricket in the city and country as whole. The tournament saw four teams taking part with one coming from Kwekwe while three were Bulawayo sides. The four teams were BAC High Performance Centre, Kwekwe Development, Emakhandeni High Performance Centre and the Elton Chigumbura Academy. Renowned development coach and one of the organisers of the tournament, Pollock Mubobo said the festival was good for the youngsters and was impressed with what he saw throughout the two days. “The good thing is that these are mainly Form Twos and Threes and they learnt a lot from the four games that they played and there was a good final at the end with good scores. When we talk about Zimbabwe Cricket we talk about these tournaments, grassroots, when you get the basics right and we get our base right in terms of grassroots then we will not have any problem. This is why we are trying to groom players from a young age,” said Mubobo. He added that moving from the first day to the final there was a lot of improvement and believes they are doing well and going further with grassroots cricket. As part of their development strategy, Mubobo said more similar tournaments are on the cards with the latest scheduled for later in the month where two teams from Mutare are also expected to grace the fiesta. The visiting coach from Kwekwe Development, Washington Nzira shared similar sentiments with Mubobo, stating that the tournament was good for his team who have been putting in the work. “I think it was important because we always want to improve and we have been practicing so just to get time to also test our skills. It was really good for the boys but above all, just to have fun and give the kids a sporting chance. Such a tournament is very important because it gives the kids the opportunity to work on their skills at grassroots level and when they go up, they will become top cricketers, this is a foundation,” said Nzira. In the final match played BAC emerged 57 runs winners over Kwekwe Development. BAC, batting first, scored 146/4 in 20 overs courtesy of a Nathan Mtuke 47 runs off 56 balls. The young Mtuke was run out with the last ball of their innings. Lwandle Moyo scored 26 runs from 31 balls while Pilate Ndlovu remained undefeated on 13 runs from 12 deliveries. Arnold Manhire and Dale Mlangeni took one wicket each for Kwekwe. In their defence, BAC managed to take early wickets to restrict their opponents. Mtuke, once again put up a good performance with the ball, taking two wickets for eleven runs in two overs. Christine Mutasa and the skipper, Pollock Mubobo (Junior) also put-up match winning performances with the ball, taking two wickets apiece for 13 and 21 runs respectively in two and three overs. Ndlovu and Barrack Hakufiwi each took one scalp. Emmanuel Magumise almost single handedly took the match away from BAC with a brilliant knock before Mutasa took a sublime catch to dismiss him on 41 runs from 23 balls as he top scored for Kwekwe. Tinotenda Rwauya scored 12 runs off nine deliveries as they were the only two batters to cross double figures for the visitors. — @brandon_malvin","pubDate":"2023-04-16 22:01:53","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Tendulkar Jnr makes IPL debut","link":"https://www.herald.co.zw/tendulkar-jnr-makes-ipl-debut/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"MUMBAI. — Arjun Tendulkar made his Indian Premier League debut yesterday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar.","content":"Arjun Tendulkar made his Indian Premier League debut yesterday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar. Standing at over six feet (1.83 metres) tall, the 23-year-old left-hander was given the new ball in the match against Kolkata Knight Riders at Mumbai’s Wankhede Stadium. Arjun went wicketless in his two overs, giving away 17 runs, in a match that Mumbai won and his proud father wrote an emotional note on social media. “Arjun, today you have taken another important step in your journey as a cricketer,” Tendulkar tweeted. “As your father, someone who loves you and is passionate about the game, I know you will continue to give the game the respect it deserves and the game will love you back.” Tendulkar added: “You have worked very hard to reach here, and I am sure you will continue to do so. This is the start of a beautiful journey. All the best!” The youngster joined five-time IPL winners Mumbai in 2021 — making his T20 debut for the state team the same year — but this was the first time he had been picked for the franchise. The paceman has played seven first-class matches for Goa, after shifting bases to the western state last year. CAPS United.. .................(1)1 IT was a big day for Zimbabwean long distance runner Givemore Mudzinganyama on Saturday as he emerged winner of the 2023 Totalsports Two Oceans Marathon on debut in Cape Town, South Africa. THE Zimbabwe National Soccer Supporters Association have described the impending visit by FIFA for a fact-finding mission on issues bedevilling the administration of local football as a huge leap in the right direction.","pubDate":"2023-04-16 22:00:39","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Moose Clothing Official National Team Sponsor of Sri Lanka Cricket series with Ireland and Pakistan","link":"https://www.ft.lk/sports/Moose-Clothing-Official-National-Team-Sponsor-of-Sri-Lanka-Cricket-series-with-Ireland-and-Pakistan/23-747354","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Moose Clothing Company has once again reaffirmed its commitment to the sport of Cricket by pledging to support Sri Lanka Cricket as the Official National Team Sponsor at the upcoming Ireland tour of Sri Lanka in April. The tour will include two test matches, with the first taking place from 16 April to 20 April, and the second taking place from 24 to 28 April, at the Galle International Stadium. Furthermore, the sponsorship will be extended and remain effective for the Sri Lanka vs Pakistan tour that is also set to take place shortly. Moose Clothing has maintained its long-standing collaboration with Sri Lanka Cricket supporting the National team with various sponsorships throughout the past couple of years. As a home grown brand, Moose Clothing is committed to empowering the National team at national and international levels. Moose Clothing CEO Hasib Omar said: “Cricket has always been a much-loved sport in Sri Lanka. We are delighted to partner with Sri Lanka Cricket as the official National Team Sponsor for the upcoming series. Hope this will be a thrilling series for the cricketing fans who will be expecting an exciting encounter. As a brand we are committed to support Sri Lanka Cricket and are hopeful that it will help bring added joy to the people.” The Sri Lankan team will be looking to continue to improve on their form and will be keen to use their home advantage to secure a win against Ireland in preparation for the upcoming Pakistan series. The Irish team on the other hand, can be expected to put up a good performance against the Sri Lankan national team. “I am certain that this partnership of Moose Clothing with Sri Lanka Cricket will support the firm gain vital exposure for its brand across continents, as the game of cricket is adored by millions of Sri Lankan fans spread around the world,” said Sri Lanka Cricket CEO Ashley De Silva. The Sri Lanka vs Ireland test series is set to be an exciting encounter which will commence right after the Sri Lankan Sinhala and Tamil New Year celebrations where cricketing fans would be eagerly awaiting the sporting spectacle to continue their celebrations. Moose Clothing said it is proud to support the national team of Sri Lanka Cricket and is looking forward to the team’s success in the upcoming Ireland tour anticipating outstanding performances from both teams and some memorable moments in the world of cricket.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Karunaratne, Mendis plunder centuries","link":"https://www.ft.lk/sports/Karunaratne--Mendis-plunder-centuries/23-747358","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Test minnows Ireland found out the hard way what Test cricket is all about when their bowlers were put to the sword by two of the best batsmen in the Sri Lanka Test side skipper Dimuth Karunaratne and Kusal Mendis who scored centuries on the opening day of the first cricket Test played at the Galle International Cricket Stadium yesterday. By the end of an arduous hot and humid day the Irish team trudged wearily back to their dressing room as Sri Lanka winning the toss and batting first on a belter of a pitch cruised to an imposing 386-4. Ireland’s only success of the first session came in the 15th over when Nishan Madushka opening the innings for the first time in his second Test edged a catch behind the wicket to Lorcan Tucker off Curtis Camphor for 29 ending an opening stand of 64 with Karunaratne. From there onwards it was the Karunaratne-Mendis show as they took full control of the hapless Irish attack and hit them to all parts of the ground putting on a second wicket partnership of 281 off 355 balls that was not broken until the 74th over. Ireland who had persevered all day under steaming conditions finally had some success in the final session when they snapped up the wickets of the two centurions Mendis for 144 and Karunaratne for 179 and also Angelo Mathews for a duck. Left-arm spinner George Dockrell trapped Mendis lbw on the sweep, Mathews edged a catch behind the wicket off a wide delivery from leg-spinner Ben White, and Karunaratne’s 371 minutes of patience was ended when he threw his bat at a delivery from seamer Mark Adair and edged a catch to Tucker for his third dismissal of the innings, shortly before the close. Mendis, a well-organised player is a difficult customer to bowl to once he gets in. He was good to watch in the 260 minutes he spent at the wicket displaying an array of strokes that brought him 18 fours and a six. He reached his ninth Test century with a four and a one-handed hit for six off Andy McBrine which broke the shackles the Ireland bowlers had imposed on him and Karunaratne in the first hour of the afternoon where the first nine overs of spin produced only 23 runs. Karunaratne made it very difficult for the Irish bowlers manoeuvring the ball around and holding up one end, which enabled Mendis to play risk free cricket. The Lankan skipper was determined to make this innings a big one reaching the boundary on 15 occasions in the 235 balls he faced. Starved of Test cricket for the year with Sri Lanka scheduled to play only six matches, Karunaratne made use of the opportunity to reach his 15th Test century off 139 balls inclusive of seven fours and brought up his 150 off 190 balls (13 fours). He looked assured in his stroke play working the ball around nicely in a chanceless innings to make his fifth score of over 50 in his last six Test innings. His last Test hundred was scored in March 2022 against India at Bangalore and since then he had made eight fifties. After experiencing tough conditions in New Zealand where the ball swung and bounced a lot, the Irish bowling to the Lankan batters was like a breath of fresh air. On a perfect batting strip, they made merry. Unfortunately for the Irish they lost the toss which meant that they had to spend the first day of the Test in sweltering heat. Ireland was tested physically and mentally in these hot and humid conditions with temperatures reaching 31 degrees Celsius and high humidity of 75%. For a country that experiences summer temperatures not higher than 15-20 degrees Celsius it was asking a lot and it was a real test for the Irish bowlers to try and contain the run flow in conditions and a pitch they are not familiar with. The heat affected their bowlers’ lines and lengths which were inconsistent. Sri Lanka included two seamers in their bowling attack and Sadeera Samarawickrama made his way back to the Test side for the first time in five years. He will keep wickets in a Test for the first time. The first four Tests he played was purely as a batsman. Ireland made one change from the Test against Bangladesh with evergreen left-arm spinner George Dockrell coming in for Graham Hume. Sri Lanka Cricket’s decision to allow free entry for the public to witness the Test series against Ireland brought in a fair number of spectators who braved the hot and humid conditions. Fans can enter the stadium via Gate Number 4 of the stadium on match days.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Top Indian cricketers won’t be allowed to play in Saudi Arabia bankrolled richest cricket league: BCCI official","link":"https://www.ft.lk/sports/Top-Indian-cricketers-won-t-be-allowed-to-play-in-Saudi-Arabia-bankrolled-richest-cricket-league--BCCI-official/23-747355","keywords":null,"creator":null,"video_url":null,"description":null,"content":"After staging Formula One races, owning Newcastle United, bringing Cristiano Ronaldo to play in the domestic league, and promoting the rival LIV golf circuit, cricket could be the next sport Saudi Arabia is venturing into. Officials from the kingdom have reportedly held discussions with those at the helm of the Indian Premier League with the intention of starting the world’s richest cricket tournament in the gulf nation. The two sides have been testing the waters with the relationship recently with ‘Visit Saudi’ being a major sponsor for the ongoing Indian Premier League. Saudi oil giant Aramco has had sponsorship deals with the International Cricket Council (ICC) and BCCI. The kingdom has set the strategic goal of becoming the No. 1 tourist destination for India by 2030. IPL franchises – such as Mumbai Indians, Chennai Super Kings, Kolkata Knight Riders, Delhi Capitals, Sunrisers Hyderabad, Rajasthan Royals, and Lucknow Super Giants – are already involved in overseas T20 leagues from UAE, South Africa, USA and Caribbean – but BCCI doesn’t allow Indian players to feature in any other domestic competition in the format fearing it will diminish the IPL’s brand value. Getting top Indian stars to play in an overseas domestic league could be the real game-changer in this regard and will definitely put the cat among the pigeons. But if the BCCI is to be believed, that’s not going to happen any time soon, even though IPL franchises can put their money wherever they want. “No current Indian players will be taking part in any of the leagues, but as far as franchise participation is concerned, we can’t stop them, a top BCCI official told The Indian Express. “It’s their individual decision. We have seen IPL franchises going to South Africa or Dubai and we can’t say no. It’s their choice to have their team in any of the leagues around the world.” The BCCI providing technical knowhow in organising a T20 league could be a start, with IPL franchises getting another market to invest. As of now, the UAE is the major cricketing destination in the gulf region and has hosted the T20 World Cup, IPL, Asia Cup and even bilateral series involving Full Member Nations. It also houses the ICC headquarters and has impressive cricket infrastructure and stadia in venues such as Dubai, Abu Dhabi and Sharjah. Saudi Arabia doesn’t have such infrastructure, but plans to set the ball rolling in this regard. “Our aim is to create a sustainable industry for locals and expats living in the Kingdom and make Saudi Arabia a global cricketing destination,” Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal Al-Saud has been quoted as saying by Arab News. “One of our biggest objectives is to bring better quality of life for expatriates working here. We have about eight million people from Asian countries where cricket is the most popular game, places such as India, Pakistan, Afghanistan, Bangladesh and Sri Lanka,” he added. The kingdom has extremely deep pockets and its interest in investing in the sport has the ICC enthused. “If you look at other sports they’ve been involved in, cricket is something I imagine would be attractive to them,” ICC Chair Greg Barclay was quoted as saying. (Source: )","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Saudi Arabia set to launch lucrative Twenty20 tournament","link":"https://www.ft.lk/sports/Saudi-Arabia-set-to-launch-lucrative-Twenty20-tournament/23-747356","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Saudi Arabia is reportedly investigating the possibility of launching what is likely to be the world’s most lucrative Twenty20 tournament after their cricket board chairman, Prince Saud bin Mishal al-Saud, declared his intention to make the nation “a global cricketing destination”. The Melbourne Age and Sydney Morning Herald said discussions have taken place between Saudi government representatives and owners of Indian Premier League teams, including about the possibility of Indian players – who have so far been banned from participating in overseas T20 competitions – being allowed to participate. Having made significant and controversial investments in football – including the purchase of Newcastle United – and golf, with the launch of the LIV Golf tour, Saudi Arabia has also started to build commercial relationships in cricket over recent years. Last October, the International Cricket Council agreed a global partnership with Saudi Aramco, the national petrol company, which includes involvement in the World Test Championship final between India and Australia at the Oval in June, and at the ODI World Cup in the autumn. In February, Saudi tourism authority joined Aramco among the IPL’s key sponsors. “If you look at other sports they’ve been involved in, cricket is something I imagine would be attractive to them,” the ICC chair Greg Barclay said. “Given their advance into sport more generally, cricket would work quite well for Saudi Arabia. They’re pretty keen to invest in sport and given their regional presence, cricket would seem a pretty obvious one to pursue.” Prince Saud was asked by Arab News last month if he was hoping to launch a professional cricket league in the country. “There will be leagues on all levels, not just one league,” he said. “We’ve developed great relationships with the ICC and the Asian Cricket Council, as well as some successful international cricket boards and big cricketers globally. And then we hired experts to help us develop a model of a league. Of course, a lot of infrastructure and development are required, but we’ll announce when it’s time.” Any new competition would be pitched into an overcrowded schedule and follow the launch of high-profile new leagues in South Africa and the UAE this year. With March and April dominated by the IPL, searing temperatures presenting a potentially insurmountable obstacle through the summer months and cold ruling out midwinter, a new tournament’s most likely home would be October and November. This year’s ODI World Cup, like the T20 events of 2021 and 2022, will be held in that period but there would then be no further clashes with global competitions until the ODI World Cup in South Africa and Zimbabwe in 2027. (Source:","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Tendulkar junior makes IPL debut","link":"https://www.ft.lk/sports/Tendulkar-junior-makes-IPL-debut/23-747353","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Arjun Tendulkar made his Indian Premier League debut on Sunday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar. Standing at over six feet (1.83 metres) tall, the 23-year-old left-hander was given the new ball in the match against Kolkata Knight Riders at Mumbai’s Wankhede Stadium. He joined five-time IPL winners Mumbai in 2021 – making his T20 debut for the state team the same year – but this was the first time he had been picked for the franchise. The paceman has played seven first-class matches for Goa, after shifting bases to the western state last year. His father, who has almost god-like status in cricket-mad India, began his career with Mumbai state’s junior team before being picked for the senior side at the age of 15. He won his first cap for India in 1989 before going on to become the highest Test scorer of all time as well as the first player to score 100 international centuries. He retired in 2013.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ollie Pope hits rapid century as Surrey claim crushing win over Hampshire","link":"https://www.independent.co.uk/sport/cricket/ollie-pope-hampshire-surrey-stuart-broad-tom-westley-b2320837.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Pope made 122 off 102 balls while Dom Sibley contributed 79 as the defending champions earned a nine-wicket win.","content":"Ollie Pope brought ‘Bazball’ to the LV= Insurance County Championship as he blazed an unbeaten 122 from 102 balls to lead Surrey to a crushing nine-wicket win over fellow title hopefuls Hampshire at the Kia Oval. Dom Sibley’s unbeaten 79 played the perfect anchor role for England batter Pope, who struck three sixes and 14 fours, as the second-wicket pair put on 193 in 30 overs to help Surrey chase down a target of 243 with the minimum of fuss. The comprehensive victory sent a powerful message to the rest of the division as the defending champions pulled away in destructive fashion in the final session of the game, with Pope finishing things off with back-to-back sixes. Surrey’s first victory of the campaign leaves them second in the table, three points behind Warwickshire after the Bears finally ended Kent’s stubborn resistance with just six overs to spare at Edgbaston. The hosts won by an innings and 14 runs when Kent all-rounder Joey Evison edged Hassan Ali behind to agonisingly fall for 99, having taken his side so close to salvaging an unlikely draw Defeat was on the horizon for the visitors as they stumbled to 99 for seven after following on 295 runs behind, but opener Ben Compton (88) and 21-year-old Evison added 100 in 25 overs to give Kent hope. Compton fell in the first over after tea but Evison and Conor McKerr then added 74 in 27 overs and Kent were within touching distance of a great escape when Will Rhodes caught McKerr at fourth slip before Evison fell victim to Ali’s outswinger. Essex are third in the top flight, four points behind Surrey, after their captain Tom Westley stood strong for nearly three hours to deny Lancashire victory at Chelmsford. Lancashire plundered 184 runs in a 28-over morning session, with 137 coming in the final 15 overs, as they declared on 351 for seven to set Essex a target of 340 off 68 overs. Lower-order trio Tom Hartley (73 not out), Colin de Grandhomme (38) and Tom Bailey (25 not out) clubbed 10 sixes and 10 fours between them as they laid siege to the Essex bowling attack in pursuit of victory. James Anderson then dismissed his former England captain Sir Alastair Cook for a duck as Essex’s reply started in dismal fashion, but Westley, with 43 off 120 balls, ensured that was just a minor setback as the hosts edged their way to 128 for four from 58 overs when the teams shook hands on the draw. Nottinghamshire’s home return to Division One got off to the ideal start with a 165-run victory over Somerset. Despite a two-day washout, Nottinghamshire claimed a convincing win as Somerset were bowled out for 129 midway through the afternoon session on Sunday after being set a target of 295 to win. Dane Paterson passed 500 first-class wickets with figures of five for 46, Brett Hutton finished with nine wickets in the match and England seamer Stuart Broad claimed his first wickets of the season as Nottinghamshire bounced back from their opening-round defeat at Hampshire in style. Also in Division One, Sam Whiteman hit a maiden half-century to help Northamptonshire pick up their first victory with a seven-wicket triumph over Middlesex. Fresh from his Sheffield Shield win last month, the Western Australia captain struck seven fours and a six in an unbeaten 60 as Northamptonshire reached their target of 119 just before lunch. Leicestershire went top of Division Two after securing valuable bonus points in their rain-affected draw with Derbyshire. No play was possible on the two previous days but centuries from captain Lewis Hill (162 not out) Colin Ackermann (114), followed by a fine spell of seam bowling by Chris Wright (four for 38), ensured Leicestershire maximised bonus points. The hosts declared on 451 for nine before Derbyshire finished on 253 for seven in their first innings, with Brooke Guest (92) and Wayne Madsen (75) leading the way. Durham moved up second in the table, level on 27 points with Worcestershire, after beating the Pears by 121 runs at the Riverside thanks to a five-wicket haul from Matthew Kuhnemann. Durham captain Scott Borthwick (108 not out) scored his first first-class century in two years as he and David Bedingham (86) put on a 196-run partnership to leave the hosts in prime position for victory. Worcestershire needed 314 to win from 70 overs after Durham declared on 254 for four but after losing two early wickets, the visitors only had a draw on their mind. Adam Finch and Dillon Pennington’s late partnership almost denied the home side but Australia spinner Kuhnemann (five for 53) removed the latter to secure Durham’s first win of the campaign.","pubDate":"2023-04-16 19:37:28","image_url":"https://static.independent.co.uk/2023/04/16/20/6e3c7b304e9248d4187eb7a7c87a87d9Y29udGVudHNlYXJjaGFwaSwxNjgxNzU0NTc3-2.68954295.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"T10 Franchise comes to Zimbabwe","link":"https://www.hmetro.co.zw/t10-franchise-comes-to-zimbabwe/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Curtworth Masango Zimbabwe Cricket (ZC) launched the inaugural edition of the Zim Afro T10 cricket tournament that will be played in August. The franchise is expected to bring cricket stars from around the world, with six privately-owned teams set to take part. ZC managing director, Givemore Makoni, said they had done all due diligence to […]","content":"H-Metro Curtworth Masango Zimbabwe Cricket (ZC) launched the inaugural edition of the Zim Afro T10 cricket tournament that will be played in August. The franchise is expected to bring cricket stars from around the world, with six privately-owned teams set to take part. ZC managing director, Givemore Makoni, said they had done all due diligence to ensure the tournament was clean. “There are a lot of leagues around the world and Zimbabwe doesn’t have one. “We are one of the 12 Test-playing nations so we need to have our own, but just as everyone is saying, we needed to do due diligence that whatever league we are going to be involved in is clean. “That is why it took us some time to come up with this,” he said. “We are busy as we want to be known for cricket. We have increased our tournaments as we want to keep our players busy. It’s one of the things that once contributed to our downfall as we didn’t have enough game time. “So, adding tournaments like this will create much-needed game time. We will not only focus on national team players, but also the fringe players and talented youngsters. “In terms of exposure, I think it will go a long way in growing our game.” Global T10 and Zim City founder, Shaji Ul Mulk, said he dreams of seeing cricket being introduced at the Olympics games. He said negotiating with the local board was a long process. “We have been negotiating with the board for about a year and the board had its own terms and conditions it had to approve and all that stuff. “So we are planning to do this in August. My personal dream is for cricket to be in the Olympic Games using this format because it is the perfect format that can be played at the Olympics,” he said.","pubDate":"2023-04-16 22:06:46","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raza makes IPL history","link":"https://www.chronicle.co.zw/raza-makes-ipl-history/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo SIKANDAR Raza made history in the Indian Premier League (IPL) after a brilliant all-round display saw him help his team, Punjab Kings to victory by two wickets over Lucknow Super Giants on Saturday. Raza, named Player of the Match, became the first Zimbabwean to pick up the accolade in the IPL. His 57 […]","content":"The Chronicle SIKANDAR Raza made history in the Indian Premier League (IPL) after a brilliant all-round display saw him help his team, Punjab Kings to victory by two wickets over Lucknow Super Giants on Saturday. Raza, named Player of the Match, became the first Zimbabwean to pick up the accolade in the IPL. His 57 runs off 42 deliveries was also the first half century by a Zimbabwean batsman in the world’s most lucrative T20 league. Tatenda Taibu and Raymond Price, the only other Zimbabweans to play in the IPL never scored half centuries to win the Player of the Match award. Taibu’s highest score in three IPL matches for the Kolkata Knight Riders in 2008 was 15 runs while Prince never batted in the only match he played for the Mumbai Indians in the 2011 season. Coming back to the playing 11 after being a substitute in their previous match, Raza took one wicket in two overs for 19 runs as they restricted Super Giants to 158/8 in 20 overs and went on to top score with 57 runs to help his team finish on 161/8 to win it with three balls remaining in the match. Sam Curran, son of the late former Zimbabwe captain and coach Kevin Curran starred with the ball for the Kings, picking up three wickets for 31 runs in his four over spell while South African Kagiso Rabada, returning to the team took two scalps for 34 runs in four overs as well. Arshdeep Singh, and Harpreet Brar had one wicket each. Super Giants captain Lokesh Rahul top scored with 74 runs off 56 balls. Coming in to bat at number five, Raza had a lot on his hands as the Kings were struggling on 45/3, missing the services of their in-form captain Shikhar Dhawan and the Zimbabwean managed to deliver a knock for the history books. His innings consisted of four fours and three sixes before he was caught with his team needing 21 runs to win from 13 balls with the game looking poised for a late twist. It was Shahrukh Khan saw the team through with an unbeaten 23 runs off 10 balls. Matthew Short was the second leading run getter for the Kings with 34 runs from 22 deliveries. Apart from being named Player of the Match, Raza was also named Commander of the Match by his team for his brilliant all-round performance. Leading cricket website ESPN CricInfo also had Raza as their Most Valuable Player for the match. It was the third win of the season for the Kings, which saw them move to six points. Their next match is on Thursday against Royal Challengers Bangalore. — @brandon_malvin","pubDate":"2023-04-16 22:04:57","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"BMCA development tourney a step in the right direction","link":"https://www.chronicle.co.zw/bmca-development-tourney-a-step-in-the-right-direction/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo THE two-day Under-16 development cricket tournament that was hosted by the Bulawayo Metropolitan Cricket Association (BMCA) on Friday and Saturday at Bulawayo Athletic Club (BAC) was a good show for the growth of grassroots cricket in the city and country as whole. The tournament saw four teams taking part with one coming from […]","content":"The Chronicle THE two-day Under-16 development cricket tournament that was hosted by the Bulawayo Metropolitan Cricket Association (BMCA) on Friday and Saturday at Bulawayo Athletic Club (BAC) was a good show for the growth of grassroots cricket in the city and country as whole. The tournament saw four teams taking part with one coming from Kwekwe while three were Bulawayo sides. The four teams were BAC High Performance Centre, Kwekwe Development, Emakhandeni High Performance Centre and the Elton Chigumbura Academy. Renowned development coach and one of the organisers of the tournament, Pollock Mubobo said the festival was good for the youngsters and was impressed with what he saw throughout the two days. “The good thing is that these are mainly Form Twos and Threes and they learnt a lot from the four games that they played and there was a good final at the end with good scores. When we talk about Zimbabwe Cricket we talk about these tournaments, grassroots, when you get the basics right and we get our base right in terms of grassroots then we will not have any problem. This is why we are trying to groom players from a young age,” said Mubobo. He added that moving from the first day to the final there was a lot of improvement and believes they are doing well and going further with grassroots cricket. As part of their development strategy, Mubobo said more similar tournaments are on the cards with the latest scheduled for later in the month where two teams from Mutare are also expected to grace the fiesta. The visiting coach from Kwekwe Development, Washington Nzira shared similar sentiments with Mubobo, stating that the tournament was good for his team who have been putting in the work. “I think it was important because we always want to improve and we have been practicing so just to get time to also test our skills. It was really good for the boys but above all, just to have fun and give the kids a sporting chance. Such a tournament is very important because it gives the kids the opportunity to work on their skills at grassroots level and when they go up, they will become top cricketers, this is a foundation,” said Nzira. In the final match played BAC emerged 57 runs winners over Kwekwe Development. BAC, batting first, scored 146/4 in 20 overs courtesy of a Nathan Mtuke 47 runs off 56 balls. The young Mtuke was run out with the last ball of their innings. Lwandle Moyo scored 26 runs from 31 balls while Pilate Ndlovu remained undefeated on 13 runs from 12 deliveries. Arnold Manhire and Dale Mlangeni took one wicket each for Kwekwe. In their defence, BAC managed to take early wickets to restrict their opponents. Mtuke, once again put up a good performance with the ball, taking two wickets for eleven runs in two overs. Christine Mutasa and the skipper, Pollock Mubobo (Junior) also put-up match winning performances with the ball, taking two wickets apiece for 13 and 21 runs respectively in two and three overs. Ndlovu and Barrack Hakufiwi each took one scalp. Emmanuel Magumise almost single handedly took the match away from BAC with a brilliant knock before Mutasa took a sublime catch to dismiss him on 41 runs from 23 balls as he top scored for Kwekwe. Tinotenda Rwauya scored 12 runs off nine deliveries as they were the only two batters to cross double figures for the visitors. — @brandon_malvin","pubDate":"2023-04-16 22:01:53","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Tendulkar Jnr makes IPL debut","link":"https://www.herald.co.zw/tendulkar-jnr-makes-ipl-debut/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"MUMBAI. — Arjun Tendulkar made his Indian Premier League debut yesterday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar.","content":"Arjun Tendulkar made his Indian Premier League debut yesterday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar. Standing at over six feet (1.83 metres) tall, the 23-year-old left-hander was given the new ball in the match against Kolkata Knight Riders at Mumbai’s Wankhede Stadium. Arjun went wicketless in his two overs, giving away 17 runs, in a match that Mumbai won and his proud father wrote an emotional note on social media. “Arjun, today you have taken another important step in your journey as a cricketer,” Tendulkar tweeted. “As your father, someone who loves you and is passionate about the game, I know you will continue to give the game the respect it deserves and the game will love you back.” Tendulkar added: “You have worked very hard to reach here, and I am sure you will continue to do so. This is the start of a beautiful journey. All the best!” The youngster joined five-time IPL winners Mumbai in 2021 — making his T20 debut for the state team the same year — but this was the first time he had been picked for the franchise. The paceman has played seven first-class matches for Goa, after shifting bases to the western state last year. CAPS United.. .................(1)1 IT was a big day for Zimbabwean long distance runner Givemore Mudzinganyama on Saturday as he emerged winner of the 2023 Totalsports Two Oceans Marathon on debut in Cape Town, South Africa. THE Zimbabwe National Soccer Supporters Association have described the impending visit by FIFA for a fact-finding mission on issues bedevilling the administration of local football as a huge leap in the right direction.","pubDate":"2023-04-16 22:00:39","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Moose Clothing Official National Team Sponsor of Sri Lanka Cricket series with Ireland and Pakistan","link":"https://www.ft.lk/sports/Moose-Clothing-Official-National-Team-Sponsor-of-Sri-Lanka-Cricket-series-with-Ireland-and-Pakistan/23-747354","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Moose Clothing Company has once again reaffirmed its commitment to the sport of Cricket by pledging to support Sri Lanka Cricket as the Official National Team Sponsor at the upcoming Ireland tour of Sri Lanka in April. The tour will include two test matches, with the first taking place from 16 April to 20 April, and the second taking place from 24 to 28 April, at the Galle International Stadium. Furthermore, the sponsorship will be extended and remain effective for the Sri Lanka vs Pakistan tour that is also set to take place shortly. Moose Clothing has maintained its long-standing collaboration with Sri Lanka Cricket supporting the National team with various sponsorships throughout the past couple of years. As a home grown brand, Moose Clothing is committed to empowering the National team at national and international levels. Moose Clothing CEO Hasib Omar said: “Cricket has always been a much-loved sport in Sri Lanka. We are delighted to partner with Sri Lanka Cricket as the official National Team Sponsor for the upcoming series. Hope this will be a thrilling series for the cricketing fans who will be expecting an exciting encounter. As a brand we are committed to support Sri Lanka Cricket and are hopeful that it will help bring added joy to the people.” The Sri Lankan team will be looking to continue to improve on their form and will be keen to use their home advantage to secure a win against Ireland in preparation for the upcoming Pakistan series. The Irish team on the other hand, can be expected to put up a good performance against the Sri Lankan national team. “I am certain that this partnership of Moose Clothing with Sri Lanka Cricket will support the firm gain vital exposure for its brand across continents, as the game of cricket is adored by millions of Sri Lankan fans spread around the world,” said Sri Lanka Cricket CEO Ashley De Silva. The Sri Lanka vs Ireland test series is set to be an exciting encounter which will commence right after the Sri Lankan Sinhala and Tamil New Year celebrations where cricketing fans would be eagerly awaiting the sporting spectacle to continue their celebrations. Moose Clothing said it is proud to support the national team of Sri Lanka Cricket and is looking forward to the team’s success in the upcoming Ireland tour anticipating outstanding performances from both teams and some memorable moments in the world of cricket.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Karunaratne, Mendis plunder centuries","link":"https://www.ft.lk/sports/Karunaratne--Mendis-plunder-centuries/23-747358","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Test minnows Ireland found out the hard way what Test cricket is all about when their bowlers were put to the sword by two of the best batsmen in the Sri Lanka Test side skipper Dimuth Karunaratne and Kusal Mendis who scored centuries on the opening day of the first cricket Test played at the Galle International Cricket Stadium yesterday. By the end of an arduous hot and humid day the Irish team trudged wearily back to their dressing room as Sri Lanka winning the toss and batting first on a belter of a pitch cruised to an imposing 386-4. Ireland’s only success of the first session came in the 15th over when Nishan Madushka opening the innings for the first time in his second Test edged a catch behind the wicket to Lorcan Tucker off Curtis Camphor for 29 ending an opening stand of 64 with Karunaratne. From there onwards it was the Karunaratne-Mendis show as they took full control of the hapless Irish attack and hit them to all parts of the ground putting on a second wicket partnership of 281 off 355 balls that was not broken until the 74th over. Ireland who had persevered all day under steaming conditions finally had some success in the final session when they snapped up the wickets of the two centurions Mendis for 144 and Karunaratne for 179 and also Angelo Mathews for a duck. Left-arm spinner George Dockrell trapped Mendis lbw on the sweep, Mathews edged a catch behind the wicket off a wide delivery from leg-spinner Ben White, and Karunaratne’s 371 minutes of patience was ended when he threw his bat at a delivery from seamer Mark Adair and edged a catch to Tucker for his third dismissal of the innings, shortly before the close. Mendis, a well-organised player is a difficult customer to bowl to once he gets in. He was good to watch in the 260 minutes he spent at the wicket displaying an array of strokes that brought him 18 fours and a six. He reached his ninth Test century with a four and a one-handed hit for six off Andy McBrine which broke the shackles the Ireland bowlers had imposed on him and Karunaratne in the first hour of the afternoon where the first nine overs of spin produced only 23 runs. Karunaratne made it very difficult for the Irish bowlers manoeuvring the ball around and holding up one end, which enabled Mendis to play risk free cricket. The Lankan skipper was determined to make this innings a big one reaching the boundary on 15 occasions in the 235 balls he faced. Starved of Test cricket for the year with Sri Lanka scheduled to play only six matches, Karunaratne made use of the opportunity to reach his 15th Test century off 139 balls inclusive of seven fours and brought up his 150 off 190 balls (13 fours). He looked assured in his stroke play working the ball around nicely in a chanceless innings to make his fifth score of over 50 in his last six Test innings. His last Test hundred was scored in March 2022 against India at Bangalore and since then he had made eight fifties. After experiencing tough conditions in New Zealand where the ball swung and bounced a lot, the Irish bowling to the Lankan batters was like a breath of fresh air. On a perfect batting strip, they made merry. Unfortunately for the Irish they lost the toss which meant that they had to spend the first day of the Test in sweltering heat. Ireland was tested physically and mentally in these hot and humid conditions with temperatures reaching 31 degrees Celsius and high humidity of 75%. For a country that experiences summer temperatures not higher than 15-20 degrees Celsius it was asking a lot and it was a real test for the Irish bowlers to try and contain the run flow in conditions and a pitch they are not familiar with. The heat affected their bowlers’ lines and lengths which were inconsistent. Sri Lanka included two seamers in their bowling attack and Sadeera Samarawickrama made his way back to the Test side for the first time in five years. He will keep wickets in a Test for the first time. The first four Tests he played was purely as a batsman. Ireland made one change from the Test against Bangladesh with evergreen left-arm spinner George Dockrell coming in for Graham Hume. Sri Lanka Cricket’s decision to allow free entry for the public to witness the Test series against Ireland brought in a fair number of spectators who braved the hot and humid conditions. Fans can enter the stadium via Gate Number 4 of the stadium on match days.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Top Indian cricketers won’t be allowed to play in Saudi Arabia bankrolled richest cricket league: BCCI official","link":"https://www.ft.lk/sports/Top-Indian-cricketers-won-t-be-allowed-to-play-in-Saudi-Arabia-bankrolled-richest-cricket-league--BCCI-official/23-747355","keywords":null,"creator":null,"video_url":null,"description":null,"content":"After staging Formula One races, owning Newcastle United, bringing Cristiano Ronaldo to play in the domestic league, and promoting the rival LIV golf circuit, cricket could be the next sport Saudi Arabia is venturing into. Officials from the kingdom have reportedly held discussions with those at the helm of the Indian Premier League with the intention of starting the world’s richest cricket tournament in the gulf nation. The two sides have been testing the waters with the relationship recently with ‘Visit Saudi’ being a major sponsor for the ongoing Indian Premier League. Saudi oil giant Aramco has had sponsorship deals with the International Cricket Council (ICC) and BCCI. The kingdom has set the strategic goal of becoming the No. 1 tourist destination for India by 2030. IPL franchises – such as Mumbai Indians, Chennai Super Kings, Kolkata Knight Riders, Delhi Capitals, Sunrisers Hyderabad, Rajasthan Royals, and Lucknow Super Giants – are already involved in overseas T20 leagues from UAE, South Africa, USA and Caribbean – but BCCI doesn’t allow Indian players to feature in any other domestic competition in the format fearing it will diminish the IPL’s brand value. Getting top Indian stars to play in an overseas domestic league could be the real game-changer in this regard and will definitely put the cat among the pigeons. But if the BCCI is to be believed, that’s not going to happen any time soon, even though IPL franchises can put their money wherever they want. “No current Indian players will be taking part in any of the leagues, but as far as franchise participation is concerned, we can’t stop them, a top BCCI official told The Indian Express. “It’s their individual decision. We have seen IPL franchises going to South Africa or Dubai and we can’t say no. It’s their choice to have their team in any of the leagues around the world.” The BCCI providing technical knowhow in organising a T20 league could be a start, with IPL franchises getting another market to invest. As of now, the UAE is the major cricketing destination in the gulf region and has hosted the T20 World Cup, IPL, Asia Cup and even bilateral series involving Full Member Nations. It also houses the ICC headquarters and has impressive cricket infrastructure and stadia in venues such as Dubai, Abu Dhabi and Sharjah. Saudi Arabia doesn’t have such infrastructure, but plans to set the ball rolling in this regard. “Our aim is to create a sustainable industry for locals and expats living in the Kingdom and make Saudi Arabia a global cricketing destination,” Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal Al-Saud has been quoted as saying by Arab News. “One of our biggest objectives is to bring better quality of life for expatriates working here. We have about eight million people from Asian countries where cricket is the most popular game, places such as India, Pakistan, Afghanistan, Bangladesh and Sri Lanka,” he added. The kingdom has extremely deep pockets and its interest in investing in the sport has the ICC enthused. “If you look at other sports they’ve been involved in, cricket is something I imagine would be attractive to them,” ICC Chair Greg Barclay was quoted as saying. (Source: )","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Saudi Arabia set to launch lucrative Twenty20 tournament","link":"https://www.ft.lk/sports/Saudi-Arabia-set-to-launch-lucrative-Twenty20-tournament/23-747356","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Saudi Arabia is reportedly investigating the possibility of launching what is likely to be the world’s most lucrative Twenty20 tournament after their cricket board chairman, Prince Saud bin Mishal al-Saud, declared his intention to make the nation “a global cricketing destination”. The Melbourne Age and Sydney Morning Herald said discussions have taken place between Saudi government representatives and owners of Indian Premier League teams, including about the possibility of Indian players – who have so far been banned from participating in overseas T20 competitions – being allowed to participate. Having made significant and controversial investments in football – including the purchase of Newcastle United – and golf, with the launch of the LIV Golf tour, Saudi Arabia has also started to build commercial relationships in cricket over recent years. Last October, the International Cricket Council agreed a global partnership with Saudi Aramco, the national petrol company, which includes involvement in the World Test Championship final between India and Australia at the Oval in June, and at the ODI World Cup in the autumn. In February, Saudi tourism authority joined Aramco among the IPL’s key sponsors. “If you look at other sports they’ve been involved in, cricket is something I imagine would be attractive to them,” the ICC chair Greg Barclay said. “Given their advance into sport more generally, cricket would work quite well for Saudi Arabia. They’re pretty keen to invest in sport and given their regional presence, cricket would seem a pretty obvious one to pursue.” Prince Saud was asked by Arab News last month if he was hoping to launch a professional cricket league in the country. “There will be leagues on all levels, not just one league,” he said. “We’ve developed great relationships with the ICC and the Asian Cricket Council, as well as some successful international cricket boards and big cricketers globally. And then we hired experts to help us develop a model of a league. Of course, a lot of infrastructure and development are required, but we’ll announce when it’s time.” Any new competition would be pitched into an overcrowded schedule and follow the launch of high-profile new leagues in South Africa and the UAE this year. With March and April dominated by the IPL, searing temperatures presenting a potentially insurmountable obstacle through the summer months and cold ruling out midwinter, a new tournament’s most likely home would be October and November. This year’s ODI World Cup, like the T20 events of 2021 and 2022, will be held in that period but there would then be no further clashes with global competitions until the ODI World Cup in South Africa and Zimbabwe in 2027. (Source:","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Tendulkar junior makes IPL debut","link":"https://www.ft.lk/sports/Tendulkar-junior-makes-IPL-debut/23-747353","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Arjun Tendulkar made his Indian Premier League debut on Sunday bowling for Mumbai Indians, the team once captained by his illustrious batsman father Sachin Tendulkar. Standing at over six feet (1.83 metres) tall, the 23-year-old left-hander was given the new ball in the match against Kolkata Knight Riders at Mumbai’s Wankhede Stadium. He joined five-time IPL winners Mumbai in 2021 – making his T20 debut for the state team the same year – but this was the first time he had been picked for the franchise. The paceman has played seven first-class matches for Goa, after shifting bases to the western state last year. His father, who has almost god-like status in cricket-mad India, began his career with Mumbai state’s junior team before being picked for the senior side at the age of 15. He won his first cap for India in 1989 before going on to become the highest Test scorer of all time as well as the first player to score 100 international centuries. He retired in 2013.","pubDate":"2023-04-16 20:23:17","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ollie Pope hits rapid century as Surrey claim crushing win over Hampshire","link":"https://www.independent.co.uk/sport/cricket/ollie-pope-hampshire-surrey-stuart-broad-tom-westley-b2320837.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Pope made 122 off 102 balls while Dom Sibley contributed 79 as the defending champions earned a nine-wicket win.","content":"Ollie Pope brought ‘Bazball’ to the LV= Insurance County Championship as he blazed an unbeaten 122 from 102 balls to lead Surrey to a crushing nine-wicket win over fellow title hopefuls Hampshire at the Kia Oval. Dom Sibley’s unbeaten 79 played the perfect anchor role for England batter Pope, who struck three sixes and 14 fours, as the second-wicket pair put on 193 in 30 overs to help Surrey chase down a target of 243 with the minimum of fuss. The comprehensive victory sent a powerful message to the rest of the division as the defending champions pulled away in destructive fashion in the final session of the game, with Pope finishing things off with back-to-back sixes. Surrey’s first victory of the campaign leaves them second in the table, three points behind Warwickshire after the Bears finally ended Kent’s stubborn resistance with just six overs to spare at Edgbaston. The hosts won by an innings and 14 runs when Kent all-rounder Joey Evison edged Hassan Ali behind to agonisingly fall for 99, having taken his side so close to salvaging an unlikely draw Defeat was on the horizon for the visitors as they stumbled to 99 for seven after following on 295 runs behind, but opener Ben Compton (88) and 21-year-old Evison added 100 in 25 overs to give Kent hope. Compton fell in the first over after tea but Evison and Conor McKerr then added 74 in 27 overs and Kent were within touching distance of a great escape when Will Rhodes caught McKerr at fourth slip before Evison fell victim to Ali’s outswinger. Essex are third in the top flight, four points behind Surrey, after their captain Tom Westley stood strong for nearly three hours to deny Lancashire victory at Chelmsford. Lancashire plundered 184 runs in a 28-over morning session, with 137 coming in the final 15 overs, as they declared on 351 for seven to set Essex a target of 340 off 68 overs. Lower-order trio Tom Hartley (73 not out), Colin de Grandhomme (38) and Tom Bailey (25 not out) clubbed 10 sixes and 10 fours between them as they laid siege to the Essex bowling attack in pursuit of victory. James Anderson then dismissed his former England captain Sir Alastair Cook for a duck as Essex’s reply started in dismal fashion, but Westley, with 43 off 120 balls, ensured that was just a minor setback as the hosts edged their way to 128 for four from 58 overs when the teams shook hands on the draw. Nottinghamshire’s home return to Division One got off to the ideal start with a 165-run victory over Somerset. Despite a two-day washout, Nottinghamshire claimed a convincing win as Somerset were bowled out for 129 midway through the afternoon session on Sunday after being set a target of 295 to win. Dane Paterson passed 500 first-class wickets with figures of five for 46, Brett Hutton finished with nine wickets in the match and England seamer Stuart Broad claimed his first wickets of the season as Nottinghamshire bounced back from their opening-round defeat at Hampshire in style. Also in Division One, Sam Whiteman hit a maiden half-century to help Northamptonshire pick up their first victory with a seven-wicket triumph over Middlesex. Fresh from his Sheffield Shield win last month, the Western Australia captain struck seven fours and a six in an unbeaten 60 as Northamptonshire reached their target of 119 just before lunch. Leicestershire went top of Division Two after securing valuable bonus points in their rain-affected draw with Derbyshire. No play was possible on the two previous days but centuries from captain Lewis Hill (162 not out) Colin Ackermann (114), followed by a fine spell of seam bowling by Chris Wright (four for 38), ensured Leicestershire maximised bonus points. The hosts declared on 451 for nine before Derbyshire finished on 253 for seven in their first innings, with Brooke Guest (92) and Wayne Madsen (75) leading the way. Durham moved up second in the table, level on 27 points with Worcestershire, after beating the Pears by 121 runs at the Riverside thanks to a five-wicket haul from Matthew Kuhnemann. Durham captain Scott Borthwick (108 not out) scored his first first-class century in two years as he and David Bedingham (86) put on a 196-run partnership to leave the hosts in prime position for victory. Worcestershire needed 314 to win from 70 overs after Durham declared on 254 for four but after losing two early wickets, the visitors only had a draw on their mind. Adam Finch and Dillon Pennington’s late partnership almost denied the home side but Australia spinner Kuhnemann (five for 53) removed the latter to secure Durham’s first win of the campaign.","pubDate":"2023-04-16 19:37:28","image_url":"https://static.independent.co.uk/2023/04/16/20/6e3c7b304e9248d4187eb7a7c87a87d9Y29udGVudHNlYXJjaGFwaSwxNjgxNzU0NTc3-2.68954295.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}