{"newsArray":[{"title":"India vs Australia Live Score Commonwealth Games 2022: Women’s cricket makes its debut as IND-W face AUS-W in opener","link":"https://www.hindustantimes.com/sports/commonwealth-games/india-vs-australia-live-score-commonwealth-games-2022-cricket-scorecard-ind-w-vs-aus-w-latest-match-updates-101659084808057.html","keywords":null,"creator":null,"video_url":null,"description":"Commonwealth Games 2022 Live Score India Women vs Australia Women: With women's cricket making its debut, India face Australia in their campaign opener at Edgbaston. Follow IND-W vs AUS-W CWG 2022 Live Cricket Score and Updates.","content":null,"pubDate":"2022-07-29 08:59:50","image_url":"https://images.hindustantimes.com/img/2022/07/29/1600x900/CRICKET-WC-2022-WOMEN-IND-WIS-49_1647070849560_1659085918442_1659085918442.jpg","source_id":"hindustantimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka beat Pakistan in 2nd Test, level series 1-1","link":"https://www.sentinelassam.com/sports/cricket/sri-lanka-beat-pakistan-in-2nd-test-level-series-1-1-604917","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Babar Azam’s 81 went in vain as Sri Lanka registered a resounding 246-run win over Pakistan on the final day of the second Test to draw level the two-match series 1-1.","content":"Galle: Babar Azam's 81 went in vain as Sri Lanka registered a resounding 246-run win over Pakistan on the final day of the second Test to draw level the two-match series 1-1, at the Galle International Stadium, here on Thursday.The architect of Sri Lanka's crucial win was left-arm spinner Prabath Jayasuriya, who has been making waves in Test cricket since his debut earlier this month. In just six Test innings, he has accumulated 29 wickets, including four five-wicket hauls and a 10-wicket match-haul. The wily spinner picked up 3/80 in the first innings, which included the wickets of the dangerous Babar Azam (16) and Agha Salman (62), who top-scored in the first innings. Along with Ramesh Mendis' five-for, Sri Lanka were able to restrict Pakistan to just 231, securing a 147-run first-innings lead. The hosts then put up a commanding batting performance led by centurion Dhananjaya de Silva (109) to set Pakistan a daunting target of 508. The visitors had put on a confident 89/1 at the end of day four. Resuming the final day's play with the threat of rain looming large, Pakistan had their task cut out to save the Test - given that victory was a distant possibility with 419 runs needed. After losing Imam ul Haq early in the day for 49, Babar and Mohammad Rizwan had kept the visitors steady. The duo put on a terrific partnership of 78 runs between them and helped Pakistan see off the first hour of the day with ease. Prabath Jayasuriya finished with a match haul of 8/197, while Ramesh Mendis registered a match haul of 9/148. Brief Scores: Sri Lanka 378 (Dinesh Chandimal 80, Niroshan Dickwella 51; Naseem Shah 3-58, Yasir Shah 3-83) & 360/8 (Dhananjaya de Silva 109, Angelo Mathews 35, Karunaratne 61; Naseem Shah 2-44, Mohammad Nawaz 2-75) beat Pakistan 231 (Agha Salman 62, Imam ul Haq 32; Ramesh Mendis 5-47, Prabath Jayasuriya 3-80) & 261 (Babar Azam 81, Imam ul Haq 49; Prabath Jayasuriya 5-117, Ramesh Mendis 4-101) by 246 runs.Also read: India cruise to ODI series sweep against West IndiesAlso watch: ","pubDate":"2022-07-29 08:56:47","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369273-pak-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup officially shifted from Sri Lanka to UAE","link":"https://www.sentinelassam.com/sports/cricket/asia-cup-officially-shifted-from-sri-lanka-to-uae-604915","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Sri Lanka Cricket (SLC) will remain the hosts of the marquee multi-nation tournament, which will be played in middle-east Asia between August 27 and September 11.","content":"Dubai: The 2022 edition of the Asia Cup was on Wednesday officially shifted from Sri Lanka to the UAE. However, Sri Lanka Cricket (SLC) will remain the hosts of the marquee multi-nation tournament, which will be played in middle-east Asia between August 27 and September 11. The decision to move the tournament out of Sri Lanka was taken due to the ongoing political turmoil in the island nation.\"The Asian Cricket Council (ACC) is eagerly looking forward to conducting its much-awaited Asia Cup tournament from August 27to September 11, 2022, as scheduled,\" a Asian Cricket Council statement said. \"However, considering the prevailing situation in Sri Lanka, the ACC after extensive deliberation has unanimously concluded that it would be appropriate to relocate the tournament from Sri Lanka to the UAE,\" it added. Sri Lanka is going through one of its worst crisis with supplies of food and fuel drying up. The country has still been able to host bilateral cricket, with Australia and Pakistan making the trip over, but with the Asia Cup being a multi-team tournament, the challenges of hosting it in the midst of economic turmoil were considered a tough task. Also read: India cruise to ODI series sweep against West IndiesAlso watch: ","pubDate":"2022-07-29 08:47:28","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369271-asia-cup-trophy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Brian Lara Stadium Tarouba Trinidad T20 records: Brian Lara Cricket Academy highest innings total full list","link":"https://thesportsrush.com/cricket-news-brian-lara-stadium-tarouba-trinidad-t20-records-brian-lara-cricket-academy-highest-innings-total-full-list/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Brian Lara Stadium Tarouba Trinidad T20 records: Trinidad will be hosting the fourth consecutive match of India’s tour of West Indies 2022. Although remaining in Trinidad, India’s tour of West Indies 2022 will proceed to a five-match T20I series beginning with the first T20I tonight. While a three-match ODI series was played in Port of… The post Brian Lara Stadium Tarouba Trinidad T20 records: Brian Lara Cricket Academy highest innings total full list appeared first on The SportsRush.","content":"Brian Lara Stadium Tarouba Trinidad T20 records: Trinidad will be hosting the fourth consecutive match of India’s tour of West Indies 2022. Although remaining in Trinidad, India’s tour of West Indies 2022 will proceed to a five-match T20I series beginning with the first T20I tonight. While a three-match ODI series was played in Port of Spain, the first T20I will be played in Tarouba. Interestingly, it will be the first-ever men’s international match at the Brian Lara Stadium. Readers must note that this venue has hosted three Women’s ODIs and T20Is each in the past. Set to play at a novel international cricket stadium, third in Trinidad and 15th in the Caribbean, the hosts would be hoping for a drastic change in fortune both with respect to their most recent form and their white-ball record against India in the last few years. Here’s what captain @ImRo45 said as #TeamIndia gear up for the #WIvIND T20I series. pic.twitter.com/eVZeUpNe4Y — BCCI (@BCCI) July 29, 2022 Brian Lara Stadium Tarouba Trinidad T20 records Lack of international cricket at the Brian Lara Stadium calls for no past records for Men’s cricket. Additionally, adding records from Women’s cricket wouldn’t serve the purpose. Having said that, it is noteworthy that this stadium has hosted 31 Caribbean Premier League matches across four seasons between 2017-2020 with an average innings total of 148. Home ground to Trinbago Knight Riders, they hosts have posted the highest innings total here not once but on four separate occasions (185/3, 184/4, 175/5 and 174/4). ALSO READ: Brian Lara Cricket Stadium pitch report for 1st WI vs IND T20I As far as the highest successful T20 run-chase at this stadium is concerned, Guyana Amazon Warriors hold that record for chasing a 169-run target against Jamaica Tallawahs in CPL 2017 Eliminator. While Knight Riders batter Colin Munro (394 runs at a strike rate of 125.87) is the highest T20 run-scorer at this venue, batters taking part in this series namely Shimron Hetmyer (259 runs at a strike rate of 140) and Brandon King (221 runs at a strike rate of 112.18) have also done well here. Another New Zealand cricketer in St Lucia Zouks fast bowler Scott Kuggeljein (16) is the highest T20 wicket-taker at the Brian Lara Stadium. Playing this series, pacer Keemo Paul is among the best bowlers here on the back of his nine wickets at an average of 19.66, an economy rate of 7.37 and a strike rate of 16. The post Brian Lara Stadium Tarouba Trinidad T20 records: Brian Lara Cricket Academy highest innings total full list appeared first on The SportsRush.","pubDate":"2022-07-29 08:45:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Brian Lara Cricket Academy weather: Brian Lara Stadium Tarouba Trinidad weather report IND vs WI 1st T20I","link":"https://thesportsrush.com/cricket-news-brian-lara-cricket-academy-weather-brian-lara-stadium-tarouba-trinidad-weather-report-ind-vs-wi-1st-t20i/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Brian Lara Cricket Academy weather: The SportsRush brings you the pitch report of the 1st T20I between West Indies and India. West Indies and India will be up against each other in the 1st T20I of the 5-match T20I series at the Brian Lara Cricket Academy in Trinidad. Both sides would want to start the… The post Brian Lara Cricket Academy weather: Brian Lara Stadium Tarouba Trinidad weather report IND vs WI 1st T20I appeared first on The SportsRush.","content":"Brian Lara Cricket Academy weather: The SportsRush brings you the pitch report of the 1st T20I between West Indies and India. West Indies and India will be up against each other in the 1st T20I of the 5-match T20I series at the Brian Lara Cricket Academy in Trinidad. Both sides would want to start the series with a win. Team India will welcome their star players like Rohit Sharma, Rishabh Pant and Hardik Pandya in the series, whereas Shimron Hetmyer is making his return to the West Indies side after a brilliant IPL season with Rajasthan Royals. The tour has been dominated by the Indian team, but the T20 format is quite unpredictable. Brian Lara Cricket Academy weather The Brian Lara Academy is set to host its first T20I match after hosting a lot of Caribbean Premier League games in the past. However, the rain is a likely threat to the encounter. This time of the year is common for rains in the Caribbean, and the same can be expected in this match as well. According to Accuweather, the rain is predicted for every hour of the match, and we can certainly expect some rain delays in the game. The chances of rain vary from 30 to 51% during the game hours, with the temperature ranging from 25-31 degrees Celcius. The humidity will go as high as 70%, so hot and humid conditions are waiting for the players. We are back! Hustle continues T20I prep begins #TeamIndia | #WIvIND pic.twitter.com/snuX3tEvfa — BCCI (@BCCI) July 28, 2022 There will be overcast conditions throughout the match, and this can encourage the captains to bowl first after winning the toss. Hourly weather at Brian Lara Stadium today The match will start at 8:00 pm IST, which is 10:30 am local time. A T20 match lasts for 3.5 hours approx, but it can certainly be extended as rain is predicted for this match. Let’s have a look at an hour-to-hour rain percentage of the 1st T20I match (local timings are mentioned). 11:00 am: 47% 12:00 pm: 51% 1:00 pm: 43% 2:00 pm: 51% 3:00 pm: 47% 4:00 pm: 30%   The post Brian Lara Cricket Academy weather: Brian Lara Stadium Tarouba Trinidad weather report IND vs WI 1st T20I appeared first on The SportsRush.","pubDate":"2022-07-29 08:43:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs AUS Live Score, Commonwealth Games 2022: India Women face Australia Women as T20I cricket makes CWG debut","link":"https://sportstar.thehindu.com/commonwealth-games/news/ind-vs-aus-live-score-commonwealth-games-2022-india-australia-cricket-cwg-updates/article65697664.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Commonwealth Games 2022: Get the live score updates, commentary and highlights as India takes on Australia in the first-ever women’s cricket match at CWG in Birmingham on Friday.","content":null,"pubDate":"2022-07-29 08:41:28","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India cruise to ODI series sweep against West Indies","link":"https://www.sentinelassam.com/sports/cricket/india-cruise-to-odi-series-sweep-against-west-indies-604912","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Openers Shubman Gill and Shikhar Dhawan hit half centuries as India completed a series sweep over West Indies with an emphatic 119-run victory in a rain-affected clash in Port of Spain.","content":"Port of Spain: Openers Shubman Gill and Shikhar Dhawan hit half centuries as India completed a series sweep over West Indies with an emphatic 119-run victory in a rain-affected clash in Port of Spain.There were plenty of delays during India's innings, with the visitors forced to hit out late after a weather break saw the match initially reduced to 40 overs per side. Another rain delay at the end of the 36th over saw India's innings completed even earlier, with the visitors posting a decent total of 225/3 from their allotted overs. Opener Shubman Gill was the standout with a career best 98*, while stand-in skipper Shikhar Dhawan (58) hit his second half-century for the series. Gill was deservedly named Player of the Match and Player of the Series for his heroics during the tour, with the young right-hander scoring two half centuries and a total of 205 runs from three hits. It goes to show that India are compiling some good depth in their white-ball squads, with Shreyas Iyer, Axar Patel, Shardul Thakur and Yuzvendra Chahal also showing good signs during the three-match series. Experienced pacer Mohammed Siraj chipped in with two wickets early in West Indies' run chase on Wednesday, while Chahal finished the job by picking up four scalps of his own during an impressive spell. West Indies' form in 50-over cricket has been surprisingly poor of late, with the Caribbean side now sitting on a nine-match losing streak after consecutive series losses against Pakistan, Bangladesh and now India. While there were plenty of positive signs in the first two matches of the series against India, the third and final game was completely one-sided as the hosts struggled to match it with their opponents. Spinner Hayden Walsh picked up two wickets - but conceded 57 runs from his 10 overs - while West Indies' top-order failed to come to grips with India's new-ball bowling attack. Skipper Nicholas Pooran and right-hander Brandon King each scored 42 in this match, but there were plenty of failures as a disappointing series came to an end for Phil Simmons' side. Brief Scores: India 225/3 in 36 overs (Gill 98 not out, Dhawan 58; Walsh 2-57) beat West Indies 137 in 26 overs (Pooran 42, King 42; Chahal 4-17, Siraj 2-14) by 119 runs (DLS). Also read: Ireland women to play ODIs vs NetherlandsAlso watch: ","pubDate":"2022-07-29 08:37:43","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369265-india-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Bishop on India's new batting approach...'The way T20 cricket is going now, you want a lot more intent'","link":"https://www.sentinelassam.com/sports/cricket/bishop-on-indias-new-batting-approachthe-way-t20-cricket-is-going-now-you-want-a-lot-more-intent-604910","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India have embraced a new, attacking batting approach, a big departure from their safety-first path which caused an early exit from the Men’s T20 World Cup last year.","content":"Port of Spain: Since the Delhi T20I against South Africa in June this year, India have embraced a new, attacking batting approach, a big departure from their safety-first path which caused an early exit from the Men's T20 World Cup last year. Going hard on the ball from the word go by the Indian batters irrespective of how the final result has come out has impressed former West Indies pacer-turned-commentator Ian Bishop. \"What was pleasing to see in that England (T20I) series was the high level of intent from the top-order. It didn't always come off, even in ODI cricket. But I think that's the way game has been heading ever since England held the charge in 50-over cricket in the last World Cup. \"The way T20 cricket is going now, you want a lot more intent. India would probably reflect on the T20 World Cup last year and say, 'We were a little over-cautious. We can't win tournaments playing like that; we got to be brave',\" said Bishop in an exclusive interview with IANS. In the second and third T20I matches against England, India got Rishabh Pant to open the batting alongside Rohit Sharma. With the Men's T20 World Cup less three months away, Bishop liked the intent shown by India till now and feels they have got options to decide the make-up of their top-order. \"So, trying Pant at the top is not a bad thing. You got to find out does he fit because he definitely has the intent. But if that doesn't work out after a few games, you got other options like the Ishan Kishans of this world. He can come in and slot in there.\" \"You have got KL Rahul and Rohit Sharma as well; so, there are a number of options India can use. I like the intent; that's heading in the right direction and they will find out who fits better as they go through next month or so.\" In deciding the top-order for the T20 World Cup, India also need to see where their talismanic batter Virat Kohli fits in. Kohli has been in a prolonged lean patch and hasn't scored an international century since November 2019. In the tour of England, Kohli couldn't score a half-century and is not a part of the trip to the Caribbean. Bishop reckons Kohli should get a longer rein to rediscover form. Also read: Ireland women to play ODIs vs Netherlands Also watch:","pubDate":"2022-07-29 08:31:35","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369260-ian-bishop.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussies THRASH SA in rugby sevens; India fire warning shot to cricket stars — LIVE","link":"https://www.foxsports.com.au/commonwealth-games/commonwealth-games-2022-australians-in-action-events-schedule-day-1-live-updates-blog-medal-tally-swimming-t20-cricket/news-story/fd1d5e8c161912f18263b16b342cef2c","keywords":null,"creator":null,"video_url":null,"description":"The Australian women’s rugby sevens team has opened its Commonwealth Games account in style, thrashing South Africa 38-0.","content":"The Australian women’s rugby sevens team has opened its Commonwealth Games account in style, thrashing South Africa 38-0. It was as dominant a performance as it comes, with the Aussies scoring within the first minute of action. Charlotte Caslick bagged a double and so too did Maddison Levi, while Madison Ashby also got in on the act with the last play of the game to wrap up the resounding win. Cricket is making its return to the Commonwealth Games for the first time since 1998 and a T20 match between Australia and India is just one highlight on the opening day of action. The Men’s Rugby Sevens team is in action soon after at 7.26pm while the swimming first kicks off at 7.35pm with Australian Mack Horton in a freestyle heat. 10 AUSSIES TO WATCH: Swim star to smash record; new wave to set track alight MORE: Full 2022 sport-by-sport Comm Games schedule with Australian start times Barber tests positive ahead of Com Games | 00:47 Elijah Winnington , Sam Short , Jenna Forrester and Kiah Melverton will also hop in the pool within the following 20 minutes for their heats before attention turns to the Australian Women’s T20 cricket team . Indian captain Harmanpreet Kaur warned her side would bring a “killing attitude” to Friday’s game at Edgbaston. “Australia is a good team, but I can only talk about my team,” she told reporters. “The killing attitude is something we all are working on.” That is not the only challenge Australia will have to contend with though. The surface, which is a mix of artificial material and turf, will present another variable for the Aussies to take into account. “Playing the first game on it might be the hardest in some ways and then we’re playing the last (on that pitch too),” allrounder Ashleigh Gardner said, per cricket.com.au . “There was a little bit of purchase (for spin bowlers at Thursday’s training). It’ll be interesting to see how different it is compared to the first and last game. Our team’s so great at adapting, no matter what conditions are thrown up at us, on the run. “Whether that’s with bat or ball in hand, our team sums those conditions up pretty quickly.” OPENING CEREMONY: Music legends, giant bull steal the show Australia name Comm Games flag bearers | 00:22 More big names will be taking to the pool later in the evening, with Ariarne Titmus , Cody Simpson and Kyle Chalmers all in action in their heats between 8 and 9pm. Australia’s first medal chance though comes in the Triathlon, with Jacob Birtwhistle , Brandon Copeland and Matthew Hauser competing in the Men’s Sprint Distance Final at 8.01pm. All eyes will be on the pool later in the evening too as Tokyo Olympic medallists Emma McKeon and Zac Stubblety -Cook take part in their heats at 9.10pm and 9.25pm respectively. Australians will also get their first taste of netball action at 11pm when the Diamonds face Barbados in their first pool match. The night comes to a close with another shot at a medal, this time it is Sophie Linn , Charlotte McShane and Natalie von Coevorden in the Women’s Sprint Distance Final. DAY 1 — SCHEDULE Opening Ceremony, 4.00am Lawn Bowls and Para Lawn Bowls, 5.30pm Badminton, 6.00pm Artistic gymnastics, 6.00pm Hockey, 6.00pm Rugby Sevens, 6.00pm Table Tennis and Para Table Tennis, 6.30pm Track and Para Track Cycling, 7.00pm Swimming and Para Swimming, 7.30pm Cricket T20, 8.00pm Triathlon and Para Triathlon, 8.00pm Boxing, 9.00pm Netball, 9.00pm Squash, 9.00pm Badminton, 11.00pm Hockey, 11.00pm Follow all the action below! Can’t see the live blog? Click here!","pubDate":"2022-07-29 08:25:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ricky Ponting extends his support to out-of-form Steven Smith, advises Smith to plan better","link":"https://www.indiatvnews.com/sports/cricket/ricky-ponting-extends-his-support-to-out-of-form-steven-smith-advises-smith-to-plan-better-2022-07-29-795814","keywords":null,"creator":null,"video_url":null,"description":"The game of cricket is filled with uncertainty and that seems to be the case with modern-day Aussie great Steven Smith. Steven Smith who was once considered an heir to the all-time great Don Bradman has been in a tough patch lately. The technique that made Smith, the invincible batsman he once was now seems to be working against him. It is not just the case with Steven Smith. The other three apart from Joe Root which includes the likes of Virat Kohli, Kane Williamson, and Steven Smith have been consistently failing and the situation just doesn't seem to improve.","content":"The game of cricket is filled with uncertainty and that seems to be the case with modern-day Aussie great Steven Smith. Steven Smith who was once considered an heir to the all-time great Don Bradman has been in a tough patch lately. The technique that made Smith, the invincible batsman he once was now seems to be working against him. It is not just the case with Steven Smith. The other three apart from which includes the likes of , , and Steven Smith have been consistently failing and the situation just doesn't seem to improve. Smith who was not picked by any side this year around has been dipping in form with every single game he has played. When Australia toured Sri Lanka and Pakistan earlier this year, Smith looked uncomfortable in spinning conditions. This is the same Steven Smith who batted like a dream and encountered the genius of Ravichandran Ashwin and on turning Indian pitches back in 2016. Recently in a documentary, Ravi Ashwin opened up on how he had planned against Smith when the Indian team toured Australia for the 2021-22 Border Gavaskar Trophy Test matches. Ashwin in detail spoke about how he had figured out Smith's trigger movements. Agreeing on the same thing with Ravi Ashwin, former Australia captain and the winner of three 50 over World Cups, Ricky Ponting has said that the opposition has somehow understood how Steven Smith plays his game, and hence that has impacted his performance a lot lately. \" \", said Pointing. Smith who has 28 Test centuries to his name will travel to the Indian subcontinent later this year to play three-match T20I series and will be back again in 2023 to play 4 Test matches which will be a part of the famous Border-Gavaskar Test series.","pubDate":"2022-07-29 08:19:24","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India faceoff against Australia as new dawn heralds for women's cricket","link":"https://www.sentinelassam.com/sports/cricket/india-faceoff-against-australia-as-new-dawn-heralds-for-womens-cricket-604899","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India face off against T20 World Cup champions Australia in the first-ever match of the women's T20 event at 2022 Commonwealth Games.","content":"Birmingham: As the sun for Friday rises in the United Kingdom, the Edgbaston Cricket Ground will witness a new dawn for women's cricket when India face off against T20 World Cup champions Australia in the first-ever match of the women's T20 event at 2022 Commonwealth Games. As Meg Lanning and Harmanpreet Kaur lead their teams at Edgbaston, it will also mark the comeback of cricket in the Commonwealth Games fold after 24 years, when the 1998 edition had men's List A matches at Kuala Lumpur. But, in 2022, Birmingham will see the debut of women's cricket and T20 format together. The inclusion of women's T20 cricket in the 2022 Commonwealth Games is seen as a crucial moment to spread its visibility towards a much broader multi-sport watching audience and at the same time, prove to be a vital example for cricket pushing to be included in 2028 Los Angeles Olympics. \"Because as a cricketer we are always wishing to play more cricket and this year, we are getting participation in a multi-sport event. I think that whenever you go for an event, it becomes very important to perform well and to show the capabilities in your team. In future, if we get to participate in tournaments like this, definitely it is going to be very good for women's cricket,\" said Harmanpreet in a virtual interaction before leaving for Birmingham. Whenever India and Australia have met previously in group stages of Women's T20 World Cup, the ladies in blue jersey end up on the winning side. In the 2018 edition in West Indies, India had beaten Australia by 48 runs. In the 2020 edition, India again defeated Australia by 17 runs, leaving them on the brink of an early exit from the tournament at home. Though Australia won the tournament by defeating India in the final in front of 86,174 fans at the Melbourne Cricket Ground, fans from both sides will be itching to see how an India-Australia clash in the Commonwealth Games 2022 pans out. Also read: Sri Lanka break into top five of WTC standings Also watch:","pubDate":"2022-07-29 08:08:19","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369242-guogu.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Scotland vs New Zealand 2nd T20I Live Streaming: When and where to watch SCO vs NZ 2nd T20I in India?","link":"https://zeenews.india.com/cricket/scotland-vs-new-zealand-2nd-t20i-live-streaming-when-and-where-to-watch-sco-vs-nz-2nd-t20i-in-india-2490722.html","keywords":null,"creator":null,"video_url":null,"description":"SCO vs NZ 2nd T20 LIVE Streaming Details: Check When and Where to watch Scotland vs New Zealand Cricket Match LIVE.","content":"After thrashing Scotland in the first T20I, New Zealand will look to claim the series in the second game of the three-match series on Friday. Finn Allen scored a fine century and Ish Sodhi followed it up with a fine four-wicket haul as New Zealand clinched a comfortable 68-run win on Wednesday. Allen scored his maiden T20I century to power the Kiwis to 225. Ish Sodhi in response took four wickets as the hosts could only manage 157 in their innings. Match Details Scotland vs New Zealand, 2nd T20I Grange Cricket Club Ground in Edinburgh July 29, Friday 7:00 pm IST Live Streaming Details What date 2nd T20I match between Scotland (SCO) and New Zealand (NZ) will be played? The 2nd T20I match between Scotland and New Zealand will take place on July 29, Friday. Where will the 2nd T20I match Scotland (SCO) vs New Zealand (NZ) be played? The 2nd T20I match between Scotland and New Zealand will be played at the Grange Cricket Club Ground in Edinburgh. What time will the 2nd T20I match Scotland (SCO) vs New Zealand (NZ) begin? The 2nd T20I match between Scotland and New Zealand will begin at 7:00 pm IST. Which TV channels will broadcast Scotland (SCO) vs New Zealand (NZ) 2nd T20I match? Scotland vs New Zealand 2nd T20I match will not be televised in India. How do I watch the live streaming of the Scotland (SCO) vs New Zealand (NZ) 2nd T20I match? Scotland vs New Zealand 2nd T20I match is available to be streamed live on the FanCode app in India. Full Squads Scotland Squad: George Munsey, Calum MacLeod, Ollie Hairs, Richie Berrington(c), Matthew Cross(w), Chris Greaves, Michael Leask, Mark Watt, Safyaan Sharif, Chris Sole, Hamza Tahir, Alasdair Evans, Craig Wallace, Gavin Main, Michael Jones, Adrian Neill, Christopher McBride New Zealand Squad: Martin Guptill, Finn Allen, Glenn Phillips, Daryl Mitchell, James Neesham, Michael Bracewell, Dane Cleaver(w), Mitchell Santner(c), Ish Sodhi, Lockie Ferguson, Ben Sears, Blair Tickner, Mark Chapman, Jacob Duffy, Michael Rippon","pubDate":"2022-07-29 08:01:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Edgbaston Birmingham T20 records: Edgbaston stadium T20 records and highest innings total in Women’s Cricket","link":"https://thesportsrush.com/cricket-news-edgbaston-birmingham-t20-records-edgbaston-stadium-t20-records-and-highest-innings-total-in-womens-cricket/","keywords":["Cricket","Commonwealth games","Edgbaston"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Edgbaston Birmingham T20 records: The SportsRush brings you the T20 records at the Edgbaston stadium in Birmingham. Australia Women will take on India Women in the inaugural match of the 2022 Commonwealth Games. The match will be played at the Edgbaston Stadium in Birmingham. All the matches of the tournament will be played at the… The post Edgbaston Birmingham T20 records: Edgbaston stadium T20 records and highest innings total in Women’s Cricket appeared first on The SportsRush.","content":"Edgbaston Birmingham T20 records: The SportsRush brings you the T20 records at the Edgbaston stadium in Birmingham. Australia Women will take on India Women in the inaugural match of the 2022 Commonwealth Games. The match will be played at the Edgbaston Stadium in Birmingham. All the matches of the tournament will be played at the very same venue. The Australian team won the world cup this year, and they are the favourites to clinch the gold medal. India Women could not do that well in the world cup, but a medal is expected from them as well. This can be a brilliant match between two fan-favourite teams. Birmingham’s Edgbaston stadium is generally a brilliant track to bat on. There is an even bounce on the wicket, and the outfield is pretty quick as well. The smaller boundaries make the job even easier for the batters. This ground has just hosted a single Women’s T20I so far, and it was a low-scoring encounter. England managed to score just 126 runs in the first innings, and the South African side could just manage to score 118 runs. Although, this match was played in 2014, and the surface has certainly changed. Edgbaston hosted four matches of the Hundred Women’s competition last year, where three games were won by the chasing teams. The average 1st innings score was 132 runs, and Ovan Incvincibles recorded the highest chase of 133 runs against Birmingham Phoenix Women. ! Love our city. Let’s show the world how amazing we are. #Edgbaston | #B2022 pic.twitter.com/mB4ECF3oTp — Edgbaston (@Edgbaston) July 28, 2022 A total of 6 Men’s T20Is have been played here, and the teams batting first emerged victorious in all the matches. The average 1st innings score in Men’s T20Is has been 170 runs, which states that it is a really good batting track. England have recorded the highest total at this ground (221-5), whereas South Africa have recorded the lowest (90-5). Aaron Finch has recorded the highest T20I individual score here, where he scored 84 runs in 41 balls against England. In Domestic T20s, Warwickshire scored 242/2 at this ground, where Brendon McCullum played a blinder of 158 runs in just 68 balls.","pubDate":"2022-07-29 07:57:27","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Morgan hails Jordan's 'expertise, skill and calm nature' in England's win","link":"https://www.sentinelassam.com/sports/cricket/morgan-hails-jordans-expertise-skill-and-calm-nature-in-englands-win-604887","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former England skipper Eoin Morgan hailed pacer Chris Jordan's \"expertise, skill and calm nature\" in propelling the hosts to a 41-run victory over South Africa in the first T20I.","content":"Bristol: Former England skipper Eoin Morgan hailed pacer Chris Jordan's \"expertise, skill and calm nature\" in propelling the hosts to a 41-run victory over South Africa in the first T20I at Bristol. \"It was hugely important and I think when guys like that come and produce, yes, it can be overlooked a lot of the time but in a high-scoring game like tonight you need that expertise, that skill, that calm nature in which he goes about his business.\" \"He's England's most experienced campaigner, he bowls all the tough overs that are unrewarding majority of the time. T20 is a game of cricket that attracts powerful batsmen, high-scoring games, and that is the glitzy, glamourous side of it,\" said Morgan after the match. Morgan also pointed out that Jordan executed his plans very well and used his variations a lot more than in previous matches for England. \"If you have a side that can produce bowling like this when you need it is absolutely priceless. I thought he was extremely clear. He worked well with his skipper Jos Buttler and his plans worked to perfection no matter how simple they were and he obviously used his variation a little bit more today than we have probably seen him do in the past.\" Former South Africa all-rounder Shaun Pollock described Jordan's bowling in his last two overs as \"one of the best death overs\" he had ever seen. \"The game is on the line and you're head of where South Africa needed to be so maybe things are in your favour, but you have to now land it in the right area. You stick to the same game-plan, you don't change up because often you get bowlers going for different variations because they feel as if they have to.\" \"You've got left-hander and right-hander combinations which adds a little different dilemma to the issue and you go up and you nail it. Not only do you nail it in the first three of four, you back yourself to stay with that even when they change their options and those last three balls are dot deliveries. That sums up the game. Also read: Finn Allen's maiden T20I century helps NZ defeat Scotland by 68 runs Also watch:","pubDate":"2022-07-29 07:33:29","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369211-eoin-morgan.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Australia lose spin coach Sriram","link":"https://www.thestar.com.my/sport/cricket/2022/07/29/cricket-australia-lose-spin-coach-sriram","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Sridharan Sriram will end his six-year tenure as an assistant coach with Australia to focus on his coaching role with Indian Premier League side Royal Challengers Bangalore. Read full story","content":"(Reuters) - Sridharan Sriram will end his six-year tenure as an assistant coach with Australia to focus on his coaching role with Indian Premier League side Royal Challengers Bangalore. The former India all-rounder has been an important part of Australia's set-up, helping turn Adam Zampa and Ashton Agar into world class spinners in the short formats. \"After being on the road for six years it's with a heavy heart I have decided to move on from my current role as an assistant coach of the Australian men's team,\" Sriram said in a statement on Friday. \"I feel this is an opportune moment keeping in mind the team, giving them enough time to prepare for two World Cups and the World Test Championship.\" Cricket Australia did not clarify whether Sriram's departure would mean new personnel but former New Zealand all-rounder Daniel Vettori recently joined Andrew McDonald's staff as a full-time bowling coach. (Reporting by Ian Ransom in Melbourne; Editing by Neil Fullick)","pubDate":"2022-07-29 07:29:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“I have decided to move on”: Sridharan Sriram leaves Australian coaching role to focus on RCB in the IPL","link":"https://thesportsrush.com/cricket-news-i-have-decided-to-move-on-sridharan-sriram-leaves-australian-coaching-role-to-focus-on-rcb-in-the-ipl/","keywords":["Cricket","RCB","Sridharan Sriram"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Sridharan Sriram has left the Australian coaching role to focus on his coaching role with Royal Challengers Bangalore in the IPL. Australia’s coaching staff took an overhaul after the departure of Justin Langer, and they will now need to focus on one more recruitment. Spin-bowling Assistant coach Sridharan Sriram has confirmed his departure from the… The post “I have decided to move on”: Sridharan Sriram leaves Australian coaching role to focus on RCB in the IPL appeared first on The SportsRush.","content":"Sridharan Sriram has left the Australian coaching role to focus on his coaching role with Royal Challengers Bangalore in the IPL. Australia’s coaching staff took an overhaul after the departure of Justin Langer , and they will now need to focus on one more recruitment. Spin-bowling Assistant coach Sridharan Sriram has confirmed his departure from the coaching role. The Indian-born spinner joined the Australian team in 2016 during their Sri Lanka tour. Sriram’s reputation increased when the Australian team won a brilliant against India in Pune under challenging conditions. He has been an important part of the Australian team for the last six years. Sriram has played 8 ODIs for India, where he has scalped 9 wickets at an economy of 5.07. The slow left-arm spinner was born in Tamil Nadu, and he started his coaching stint in 2008, and he has coached teams in India, England and New Zealand as well. Sridharan Sriram released a statement about his decision to move on from his role as Australia’s assistant coach. He said that it is a tough moment for him to move on after spending six years with the Australian side. He insists that he wants the Australian team to give adequate time for the upcoming big tournaments. “After being on the road for six years it’s with a heavy heart I have decided to move on from my current role as an assistant coach of the Australian men’s team,” Sriram said in a statement. “I feel this is an opportune moment keeping in mind the team, giving them enough time to prepare for two World Cups and the World Test Championship.” “It has been a great experience for me working across formats, World Cups and Ashes and I have come out incredibly richer in knowledge.” “I am extremely grateful to Cricket Australia for all their support in the years that I have been involved with them.” Sridharan Sriram will leave Australian cricket team as spin bowling consultant to focus on his coaching career in India. #CricketTwitter @CricketAus — Vishesh Roy (@vroy38) July 29, 2022 Sriram will now focus on his job with the Royal Challengers Bangalore in the IPL and will move to live in his hometown Tamil Nadu with his family.","pubDate":"2022-07-29 07:21:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Working on killing attitude in Indian team ahead of CWG 2022 opener: Harmanpreet Kaur","link":"https://www.sentinelassam.com/sports/cricket/working-on-killing-attitude-in-indian-team-ahead-of-cwg-2022-opener-harmanpreet-kaur-604882","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India captain Harmanpreet Kaur revealed that everyone in the team is speaking and working about the need for a 'killing' attitude within the members of the side.","content":"Birmingham: Ahead of their first Group A match against Australia in the women's T20 event opener of 2022 Commonwealth Games, India captain Harmanpreet Kaur revealed that everyone in the team is speaking and working about the need for a 'killing' attitude within the members of the side. On Friday, as India and Australia take the field for the first-ever women's T20 match in the history of the Commonwealth Games at Edgbaston Cricket Ground, all eyes will be on how Harmanpreet & Co. fare against the Meg Lanning-led side, along with their newly-suggested 'killing attitude' originally coming from all-rounder Pooja Vastrakar during Sri Lanka tour in June-July. \"When we toured Sri Lanka, there was a meeting where only players were present. I asked all girls that what is the thing we want to set for our team? So, Pooja gave a very good answer: killing attitude. From there, we are still working on that while doing something during playing and training.\" \"We are trying to create that mauhaal (environment) where everyone in the team is talking about this killing attitude. I don't know what things Australia follow, but I can talk about my team. So, killing attitude is something we all are working on,\" said Harmanpreet in a pre-match virtual press conference. Friday's match will also be the first time India women's cricket team will be playing a T20 match at Edgbaston, a venue which has short straight and side boundaries on the square standing at approximately 59-60 metres. Harmanpreet remarked that the team had done its planning about tacking the short boundaries and felt the pitch at Edgbaston will be great for both batters as well as bowlers. \"We have tried for these things in the nets. We have never played at this venue before, but in England there are wickets which are very similar in nature. Yesterday when we got to bat in nets, we didn't face any difficulty and that was the plus point for us.\" \"We went to the stadium yesterday (Wednesday). We weren't able to look at the pitch, but we did get some time in the nets and I think nets as well as pitch will be quite similar. It was looking like a very nice batting track and you get some help for the bowlers also due to weather and grass on the wicket .\" \"It will be great for both batters and bowlers. It's time to other than thinking about what is going to happen on the pitch, just look at the ball and execute our plans, those things are going to help us. If we talk about team combination, we still have a balanced side. We need to just shuffle our batting order and bowl reasonably well, then we can make it big in the competition.\" Also read: Finn Allen's maiden T20I century helps NZ defeat Scotland by 68 runs Also watch:","pubDate":"2022-07-29 07:19:50","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369200-kaur.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"JIB vs RCC Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECS T10 Italy Super Series 2022, Matches 17 and 18","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/jib-vs-rcc-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ecs-t10-italy-super-series-2022-matches-17-18?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-29 07:07:37","image_url":"https://static.sportskeeda.com/editor/2022/07/73578-16590717346506-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"BAR-W vs PK-W Prediction: Who will win today's Commonwealth Games cricket match?","link":"https://www.sportskeeda.com/cricket/bar-w-vs-pk-w-prediction-who-will-win-today-s-commonwealth-games-cricket-match?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sports4All Cricket"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-29 07:07:37","image_url":"https://static.sportskeeda.com/editor/2022/07/001c5-16590762658400-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's Big Bash League: Pooja Vastrakar signs with Brisbane Heat","link":"https://www.sentinelassam.com/sports/cricket/womens-big-bash-league-pooja-vastrakar-signs-with-brisbane-heat-604876","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India all-rounder Pooja Vastrakar on Thursday signed up with Brisbane Heat for the upcoming season of the Women's Big Bash League (WBBL).","content":"Brisbane: India all-rounder Pooja Vastrakar on Thursday signed up with Brisbane Heat for the upcoming season of the Women's Big Bash League (WBBL). Pooja, 22, joins New Zealand leg-spin all-rounder Amelia Kerr as the Heat's international recruits till date ahead of the eighth season of the WBBL. Pooja caught the eye of the Heat team management during India's tour of Australia last year and in the ICC Women's Cricket World Cup in New Zealand earlier this year. In the ODI World Cup, Pooja was India's second leading wicket-taker with ten scalps and produced an impressive 67 off 59 balls with the bat in the tournament opener against Pakistan at Bay Oval. Pooja will be the third Indian player to turn out for Heat in the WBBL after leg-spinner Poonam Yadav played for them last season and opener Smriti Mandhana turned out for the side previously in 2016-17. Head coach Ashley Noffke was impressed Pooja's all-round impact in India's recent performances and is delighted to have her on board for the upcoming season of WBBL . Pooja, who has played 23 ODIs, 27 T20Is and two Tests, is in India's squad for the women's T20 event at the 2022 Commonwealth Games in Birmingham. But she is all set to miss India's first Group A match against Australia at Edgbaston on Friday after contracting Covid-19 before leaving for the United Kingdom and is serving her isolation period in India. Also read: Dhananjaya's ton puts Sri Lanka in unassailable position vs Pakistan Also watch:","pubDate":"2022-07-29 07:07:15","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369192-pooja-vastrakar.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Pooran after series loss vs India...'Still figuring out how to play ODI cricket'","link":"https://www.sentinelassam.com/sports/cricket/pooran-after-series-loss-vs-indiastill-figuring-out-how-to-play-odi-cricket-604874","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"In the three-match ODI series against India, West Indies put up a fight in the first two matches despite being on the losing side.","content":"Port of Spain: In the three-match ODI series against India, West Indies put up a fight in the first two matches despite being on the losing side. But the hosts were bereft of any fightback in the third ODI at Queen's Park Oval, losing by 119 runs in a truncated match as they were bowled out for 137 in 26 overs. It means that West Indies have lost ODI series against Bangladesh and now India back-to-back by the same margin. Skipper Nicholas Pooran admitted that the side is still trying to figure out their gameplan in ODI cricket. \"It was a tough one for us. We did a lot of right things in the first two games. I think we tried our best, the boys performed well. But there were a lot of games in a short span of time.\" \"As a batting group, it was going to be a challenge with DLS coming into play. We did get some partnerships, but not as many as we wanted, that cost us the game. There are a few inexperienced players, still figuring out how to play ODI cricket,\" said Pooran in the post-match presentation ceremony. West Indies will next play ODIs against New Zealand, but for now they have five T20Is against India coming up from Friday in Trinidad. \"Everyone has a good idea now, looking forward to the upcoming New Zealand series. We gained a lot in this series after coming from Guyana.\" \"The bowlers bowled well in the powerplay, they didn't get wickets, but that's fine. The guys are getting more confident with every game. Very excited with our T20 team, looking forward to the game on Friday. Hope that we come out and entertain the crowd,\" added Pooran. In the post-match press conference, head coach Phil Simmons saw the West Indies batting using their full quota of 50 overs in the first two matches, where they registered scores of 305 and 311 batting second and first respectively, as a positive point which they need to carry forward in future. \"The fact that we batted and we continue to bat the 50 overs (is) something we have not been doing for awhile...the first two games we batted the 50 overs and we looked like we understand what batting 50 overs is about, so I think that is a step forward and I think we have to keep moving forward with that.\" Simmons further picked opener Shubman Gill and pacers Mohammed Siraj as the crucial factors in India winning the third ODI. \"One thing? there are two. Batting of Shubman Gill and the bowling of Mohammed Siraj. Siraj was excellent in closing out the first game in the last over. He was good with the new ball today. Shardul Thakur was also good. I think their bowling stood out more than ours.\" Simmons signed off by refusing to use rain interruption as an explanation for heavy loss in third ODI. \"It (rain interruption) did play a part but it was the same for both the teams. We can't use that as an excuse that the rain disturbed us. I think we lost too many wickets in the chase. We were on target there with 10 overs left but we just lost too many wickets.\" Also read: Dhananjaya's ton puts Sri Lanka in unassailable position vs Pakistan Also watch:","pubDate":"2022-07-29 07:03:36","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/29/369188-pooran.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 1st T20I Live Telecast Channel name in India and US: When and where to watch IND vs WI Tarouba T20I?","link":"https://thesportsrush.com/cricket-news-india-vs-west-indies-1st-t20i-live-telecast-channel-name-in-india-and-us-when-and-where-to-watch-ind-vs-wi-tarouba-t20i/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs West Indies 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st WI vs IND T20I. India’s tour of West Indies 2022 will enter its second leg in the form of a five-match T20I series beginning with the first T20I in Tarouba tonight. The match… The post India vs West Indies 1st T20I Live Telecast Channel name in India and US: When and where to watch IND vs WI Tarouba T20I? appeared first on The SportsRush.","content":"India vs West Indies 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st WI vs IND T20I. India’s tour of West Indies 2022 will enter its second leg in the form of a five-match T20I series beginning with the first T20I in Tarouba tonight. The match will be remembered in history as the first international match to be played at the Brian Lara Stadium. In what is going to be only the eighth bilateral T20I series between West Indies and India, India have a 5-2 series lead to their name. As far as playing in West Indies is concerned, it will be for the first time when these two teams will be playing more than one match of their bilateral T20I series in the Caribbean. West Indies, who haven’t won a match against India across formats in over 30 months (losing 11 in a row), have won only two out of their last 28 matches across formats against this opposition. Wanting to end this victory drought, the home team would want to get the ball rolling in the best possible manner on Friday. Sound 🔛 🔊 #TeamIndia captain @ImRo45 warming up in the nets ahead of the 1st #WIvIND T20I. 👌 👌 pic.twitter.com/0V5A70l2EY — BCCI (@BCCI) July 29, 2022 As far as India are concerned, they would want be eyeing to further fine-tune their T20 skills under captain Rohit Sharma. While several first-choice players have been rested for this series, India would still be playing for clarity of thought with respect to their squad for the ICC T20 World Cup in Australia later this year. The unwanted trend of international cricket in West Indies and some other countries not available for the television audiences in India has taken a minor halt as Doordarshan Sports has the television rights for India’s tour of West Indies 2022. Click here to know about the exact channel number for various platforms like Dish TV, Airtel DTH etc. ALSO READ: West Indies vs India all match T20I result list Streaming platform FanCode, which has been streaming international cricket in West Indies for the Indian audiences in the recent years, will live stream the T20I series as well. Fans, who wish to buy a pass for the remainder of this tour (five T20Is), will have to pay a nominal price of INR 99 on the website or mobile application of FanCode. Interestingly, a novel development will allow fans to watch the whole tour without any ads by spending a total of INR 169. I am watching India play an international match. An over got completed. No ad. I am watching the cricketers. Now a close-up of the pitch. The scorecard. I saw the bowler take the ball. He has not yet started his run up. In 2022. Unbelievable. — Abhishek Mukherjee (@ovshake42) July 22, 2022 As far as local fans in the Caribbean are concerned, they will be able to follow this series on ESPN Caribbean. Meanwhile, fans living in USA and UK will be able to watch Tarouba T20I on ESPN+ and BT Sport respectively. Date – 29/07/2022 (Friday). Match start Time – 10:30 AM (local) and 08:00 PM (India). TV Channel – Doordarshan Sports (India), ESPN Caribbean (Caribbean), ESPN+ (USA) and BT Sport (UK). Online platform – FanCode (India).","pubDate":"2022-07-29 06:55:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"WATCH: Skipper Rohit Sharma hit the nets ahead of first T20 against West Indies","link":"https://zeenews.india.com/cricket/watch-skipper-rohit-sharma-hit-the-nets-ahead-of-first-t20-against-west-indies-2490673.html","keywords":null,"creator":null,"video_url":null,"description":"Team India skipper Rohit Sharma was seen timing the ball beautifully in the nets in Tarouba in a video shared by the Board of Control for Cricket in India (BCCI) on Friday.","content":"Rohit Sharma will be back in charge of the Indian cricket team when they take on hosts West Indies in the first of five-match T20 series beginning in Tarouba, Trinidad on Friday (July 29). After taking a break for the three-match ODI series, which India won 3-0 under Shikhar Dhawan, Rohit hit the nets at the Brian Lara Stadium ahead of the first T20 match. The Mumbai Indians skipper was seen timing the ball beautifully in the nets in Tarouba in a video shared by the Board of Control for Cricket in India (BCCI) on Friday. Watch the video of Rohit Sharma batting in the nets in Tarouba here… Sound #TeamIndia captain @ImRo45 warming up in the nets ahead of the 1st #WIvIND T20I. pic.twitter.com/0V5A70l2EY — BCCI (@BCCI) July 29, 2022 Captain Rohit Sharma believes the new fearless approach adopted by India in the shortest format will result in occasional failures but disagrees that they were playing \"conservative\" cricket during last year’s T20 World Cup in UAE. Rohit said the new approach provides more freedom to players, which has yielded success after the disappointing World Cup campaign, where India were eliminated in the league stage. “We didn’t get the result from the last World Cup but that doesn't mean we played bad cricket all these years and I don't agree we were playing conservative cricket,” Rohit said ahead of the five-match T20 series against the West Indies . “If you lose one or two matches in the World Cup, it feels like we were doing this and that, we were not taking our chances. It’s not like that. If you look at the overall games that we have played leading into the World Cup, we won 80 per cent of our games. If we were conservative, how can we win so many matches? That’s fine that we lost in the World Cup, didn’t qualify but that happens. That doesn’t mean we are playing with fear, not playing openly. “Lately, we haven’t made any changes, we are doing the same things but the players have been given some freedom to go out and play their own game. Play openly, no need to take any undue pressure, if you play freely, performances will show.” Rohit said change is the only constant and the Indian team and its fans too have to move on with time. “There are bound to be occasional failures in the way we are playing cricket now, results will not be in our favour but there is no problem in it because we are trying to learn something and trying something different. So, there are scope for mistakes but that doesn't mean the boys are bad, the team is bad. It’s just that we are trying to do something new. Everyone has to change with time, we are changing so I think people sitting outside also need to change their thinking.” The India skipper said the team for the upcoming T20 World Cup 2022 in Australia is more or less settled with only a few spots up for grabs. “There are a few spots in the team which we need to fill and we know what we need to do fill those spots. We are trying to address these things in all these matches we are playing now. “Every series that you play is crucial. Of course there are World Cups to look after but every series you play for India is crucial because there is something to look forward to all the time. What we achieved in England was special but that's done and we just want to look forward now.” (with PTI inputs)","pubDate":"2022-07-29 06:52:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022, Day 1 Live: India's Campaign Begins With Lawn Bowls Event","link":"https://sports.ndtv.com/othersports/commonwealth-games-2022-day-1-live-updates-3204753","keywords":null,"creator":null,"video_url":null,"description":"CWG 2022 Day 1 Live Updates: Focus would be on how Indian women's cricket and hockey team perform.","content":null,"pubDate":"2022-07-29 06:30:37","image_url":"https://c.ndtvimg.com/2022-07/q1mcnkf8_india-hockey_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India were not playing conservative cricket in T20Is earlier, says Rohit Sharma","link":"https://indianexpress.com/article/sports/cricket/india-were-not-playing-conservative-cricket-in-t20is-earlier-says-rohit-sharma-8058439/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Rohit Sharma does not agree to the widespread notion that India were playing conservative cricket in T20Is earlier. The India captain pointed to the team’s record leading into the 2021 T20 World Cup as proof that they had been performing well. In the period between the 2016 and 2021 editions of the T20 World Cup, India were marginally behind only Pakistan in terms of win-loss ratio among the ten legacy ICC Full Member nations. India had won 45 out of 72 T20Is in this five-year period, while Pakistan won 46 out of 71 games. Sound 🔛 🔊 #TeamIndia captain @ImRo45 warming up in the nets ahead of the 1st #WIvIND T20I. 👌 👌 pic.twitter.com/0V5A70l2EY — BCCI (@BCCI) July 29, 2022 However, Rohit added that the current team management under him and head coach Rahul Dravid is trying to get the team to play with a bit more freedom. “We have not got the results in the World Cup, that does not mean we have been playing poor cricket all these years. I do not agree that we were playing conservative cricket,” Rohit said in Trinidad ahead of the five-match T20I series against West Indies. We take all the vibes to the Brian Lara Cricket Stadium for the 1st T20I tomorrow!🇹🇹 Get your tickets⬇️ https://t.co/J6lTYXHYtX pic.twitter.com/JMTGyqzgfl — Windies Cricket (@windiescricket) July 28, 2022 “If you lose the odd game in the World Cup, it starts feeling as if we did not take our chances but it is not like that. If you look at the overall games we have played leading into the World Cup, we won probably 80 per cent of our games. I cannot understand how you can win so many matches if you are playing conservatively. Yes we could not qualify (out of our group) in the (2021 T20) World Cup but it happens. It does not mean we were playing with fear or with inhibition.” Rohit said that India have attempted to create a team environment wherein players can perform without taking too much pressure. “Even of late, we have not made any change, we are playing in the same way. Just that people have been given a bit of freedom to play their game and not take pressure. You do not take as much pressure when you play for your state or franchise, so you do not need to take it when you play here as well. There is a different pressure in international cricket but it is our job to reduce it or even completely eliminate it. And we are trying to create that kind of environment, and will keep trying. Our focus is also on keeping the environment light.” Top Sports News Now Commonwealth Games 2022, Day 1 Live Updates: Tania Choudhary to face Dee Hoggan in lawn bowls India were not playing conservative cricket in T20Is earlier, says Rohit Sharma From Charlie Chaplin to Duran Duran, Birmingham parades it's best at Commonwealth Games opening ceremony Click here for more The skipper called for “people on the outside” to keep their patience with the team as the players were attempting to learn and results could go against them at times. “If you play without inhibition, the performances will come. That is why I’ll say that people on the outside should remain calm. The kind of cricket we are playing, there will be failures, results will go against us, but it is okay, there is no problem in that, as we are trying to learn something, and trying to do something different. So it is possible that we will make mistakes. It does not mean that the players or the team are bad. We all have to change with time. We are changing, so I think people on the outside will also have to change their thinking a bit.” Subscriber Only Stories View All Premium With tea, talk and idlis, protesting MPs brave rain, mosquitoes, ‘indiffe... Premium Suspension of MPs: the rules, and the powers of presiding officers Premium Board examination results: We need criteria that give a fair assessment o... Premium Adhir Ranjan Chowdhury: ‘I felt I am not an orphan…I have a guardia... Subscribe Now to get 66% OFF Rohit said that there were only a few spots remaining to be filled in the squad for the upcoming T20 World Cup in Australia. “We know what we need to do in order to fill those spots. We are trying to address those things in these matches.” The first T20I against West Indies will be played on Friday. TWO IS ALWAYS BETTER | Our two-year subscription package offers you more at less Buy now","pubDate":"2022-07-29 06:17:05","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Kohli Wishes Indian Cricket Team Luck Ahead Of Game vs AUS","link":"https://sports.ndtv.com/cricket/cwg-2022-virat-kohli-wishes-indian-cricket-team-luck-ahead-of-match-vs-australia-3204667","keywords":null,"creator":null,"video_url":null,"description":"The Indian women's cricket team will begin its campaign at the Commonwealth Games on Friday against Australia at Edgbaston","content":"The Indian women's cricket team will begin its campaign at the Commonwealth Games on Friday against Australia at Edgbaston, Birmingham. The Indian team is grouped alongside Australia, Pakistan and Barbados in Group A. Ahead of the fixture against Australia, Virat Kohli wished the Harmanpreet Kaur-led side luck for the entire event. Taking to Twitter, Kohli wrote: \"My best wishes to the Indian women's cricket team and all our athletes participating in the Commonwealth Games.\" My best wishes to the Indian women's cricket team and all our athletes participating in the Commonwealth Games. Wicketkeeper-batter Rishabh Pant also wished good luck to the Indian cricket team for the Commonwealth Games. \"Wishing @BCCIWomen and all our athletes the best for the CWG, rooting for each and every one of you. Jai Hind,\" tweeted Pant. Wishing @BCCIWomen and all our athletes the best for the CWG, rooting for each and every one of you. Jai Hind. ???????? On the eve of the start of the event, captain Harmanpreet Kaur had addressed a virtual press conference where she talked about the preparation of the team. \"I think we have always done better whenever we have gotten a chance to play against them (Australia), this time the things are looking really positive, we will try to do our best,\" said Harmanpreet while replying to an NDTV question regarding playing against Australia during a virtual press conference on Thursday. Promoted Further talking about facing Australia, Harmanpreet said: \"See, for us all the teams are important. Winning all the games is important when you are playing a tournament like this. The first game is always important because you have to set the tone for the team. We have made plans for all teams, it is about taking one game at a time.\" Talking about staying in the Games Village, the Indian skipper said: \"Staying in the village is different from other tournaments we play. We are enjoying the experience, wherever you go, you have to carry your card, otherwise, nobody is going to recognise you without your card. Yeah, we are getting used to these conditions, opening ceremony, we are still thinking about that because the next day we have an early game so we are working on that, if things go as per planning, then we will definitely go for the opening ceremony.\"","pubDate":"2022-07-29 06:07:33","image_url":"https://c.ndtvimg.com/2022-07/4ivi008_india-women-cricketers-cwg-plane_625x300_27_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022 Live Day 1: India women's cricket, hockey teams headline gripping first day at Birmingham CWG","link":"https://www.hindustantimes.com/sports/commonwealth-games/commonwealth-games-2022-live-day-1-focus-on-india-vs-australia-t20-women-s-hockey-team-shiva-thapa-ind-vs-pak-badminton-mixed-doubles-and-table-tennis-team-events-101659070070628.html","keywords":null,"creator":null,"video_url":null,"description":"CWG 2022 Live Day 1: An action-packed Day 1 awaits Indian fans in the Commonwealth Games in Birmingham, as India women's cricket team meets Australia while the women's hockey side meets Ghana. India and Pakistan also meet in the Badminton mixed doubles event while Table Tennis men's and women's sides will begin their campaign today as well.","content":"CWG 2022 Live Day 1: After a glitzy start to the Commonwealth Games in the opening ceremony at the Alexander Stadium on Thursday, the action begins on July 29 with Indian athletes featuring in multiple events on the opening day. While India women's cricket team meets favourites Australia in their first match at the Games, the women's hockey team will also open its campaign against Ghana later in the day. Table Tennis and Badminton also sees team events with the men's and women's team taking part in the former, while Indian shuttlers meeting Pakistan in the mixed doubles event. In individual events, Shiva Thapa remains a big name as he looks to make a strong comeback after missing the Olympics last year; Thapa will meet Pakistan's Suleman Baloch in the Over 60-63kg Round of 32 match. Follow all the updates here: Jul 29, 2022 12:23 PM IST CWG 2022: Other medal events on Day 1 (India specific) Gymnastics, Cycling and Swimming will all have medal events on Day 1; however, they will also include qualifying rounds. Jul 29, 2022 12:18 PM IST CWG 2022 Live Updates: 8 gold medals in line for India on Day 1 Indian athletes will take part in as many as 8 gold medal events on Day 1. One of them is a straight final (Men's and Women's Triathlon), that includes 4 Indians -- Adarsh M.S. and Vishwanath Yadav (men's; 3:30 PM) and Pragnya Mohan and Sanjana Sunil Joshi (women's 7 PM). Jul 29, 2022 12:12 PM IST Commonwealth Games 2022 Live: India women's hockey team placed in Group A It is a tricky group for India in the CWG 2022, as they are placed alongside hosts England, Canada, Wales and Ghana. The side opens the campaign against the African side at 6:30 PM IST today. Jul 29, 2022 12:08 PM IST CWG 2022 Live: Women's Hockey team looks to move past WC disappointment India had finished a dismal 9th in the Women's Hockey World Cup earlier this month, winning only 1 match in six. In their do-or-die match against co-hosts Spain, India had conceded the winning goal in the final minute of the fourth quarter. But the side -- still without Rani Rampal -- will be aiming to move past the disappointment as it kickstarts the CWG campaign today. Jul 29, 2022 12:05 PM IST Commonwealth Games 2022: India eye repeat of 2018 Games in Table Tennis Indian paddlers stunned everyone with a brilliant outing in the 2018 edition of CWG, winning 3 gold, 2 silver and 3 bronze medals to finish at the top of the tally in the event. Manika Batra had won the women's singles event, while both, Men's and Women's team won gold medals as well. Jul 29, 2022 12:00 PM IST India at Commonwealth Games: Paddlers in action on Day 1 The Indian women's team -- comprising of Manika Batra, Sreeja Akula, Reeth Rishya, and Diya Chitale, will meet South Africa in the first group game on Day 1. The match is scheduled at 2 PM IST. Six hours later, they will take on Fiji in their second group game. The Indian men's team -- Sharath Kamal, Gnanasekaran Sathiyan, Harmeet Desai, and Sanil Shetty -- will face Barbados at 4:30 PM IST, followed by second group game against Singapore at 11 PM IST. Jul 29, 2022 11:55 AM IST CWG 2022 Live, Day 1: Neeraj Chopra also misses the Games India's Olympic champion and World Championships silver-medallist javelin thrower Neeraj Chopra was forced to withdraw from the Commonwealth Games last week, owing to a groin injury. He faced the injury during the Worlds final on Sunday, where he became India's first silver medallist in the tournament's history. Chopra had won the gold medal in the previous edition of the CWG, and was undoubtedly one of the top contenders to defend the title. Jul 29, 2022 11:53 AM IST CWG 2022 India: How much does absence of Shooting hurt India? India had won 60 medals in the 2018 edition, out of which 16 came in Shooting. Seven of them were gold medals! Jul 29, 2022 11:47 AM IST India at CWG 2022: A look at the previous edition's tally India had finished an impressive third in the medal tally at the CWG 2018 in Gold Coast, winning 26 gold medals, 20 silver and as many bronze. However, India faces a setback this year as Shooting -- where India boasted of multiple medal contenders at the Games -- has not been included in the final roster. Jul 29, 2022 11:44 AM IST Commonwealth Games 2022 Day 1 Live Updates: India included in Group A in Women's T20 The Harmanpreet Kaur-led Indian team faces a tough test in its opener on Day 1, as it takes on favourites Australia. India are placed in Group A with the other two teams being Barbados and Pakistan. India face arch-rivals Pakistan on July 31. Jul 29, 2022 11:39 AM IST CWG 2022 Live Updates: Cricket returns to Commonwealth Games Cricket makes only its second appearance at the Commonwealth Games in Birmingham, with women's event featuring for the first time. The only time cricket was included in the CWG roster was in 1998, when South Africa men's team won the gold medal, beating Australia in the final. The Indian women's team will be in action on the opening day. Jul 29, 2022 11:35 AM IST CWG 2022 Live: India's first event on Day 1 The Lawn Bowls event will kickstart India's campaign at the 2022 Commonwealth Games on Day 1, as India men's team takes on New Zealand in the Men's Triples Sectional Play - Section A, Round 1. Tania Choudhury will also feature at the same time in the Women's Singles Sectional Play Round 1 event. Jul 29, 2022 11:30 AM IST Commonwealth Games 2022 Live, Day 1: Hello and welcome! Hello and welcome to the live coverage of the Commonwealth Games 2022! It's an action-packed opening day for India with Indian women's cricket and hockey teams beginning their campaigns against Australia and Ghana respectively. The paddlers will also be in action in the men's and women's events, while India meet Pakistan in the badminton mixed doubles. Will India have a positive start on Day 1 at the CWG? Stay tuned to find out! SHARE THIS ARTICLE ON Topics commonwealth games india women's hockey team team india + 1 more Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter. Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story Close Story","pubDate":"2022-07-29 06:00:58","image_url":"https://images.hindustantimes.com/img/2022/07/29/1600x900/Collage_Maker-29-Jul-2022-10.30-AM_1659070821877_1659070828294_1659070828294.jpg","source_id":"hindustantimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Sridharan Sriram leaves Cricket Australia staffs to focus on RCB role","link":"https://sportstar.thehindu.com/cricket/assistant-coach-sridharan-sriram-parts-ways-with-cricket-australia-after-six-years/article65697208.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Sriram has been with the squad as a spin coach while also playing a key role in the batting, fielding and strategy for the side across multiple campaigns.","content":"Long-time Australian men’s assistant coach Sridharan Sriram will depart the squad to focus on his coaching career in India. Sriram has been with the squad for six years as predominately a spin coach while also playing a key role in the batting, fielding and strategy for the side across multiple campaigns. He has chosen to move his focus to his coaching career with the Royal Challengers Bangalore (RCB) and other roles while spending more time with his rising cricketer son Rishab and wife Pavi. The former Indian allrounder has been most closely linked to the rise of Adam Zampa and Ashton Agar while also forming close bonds with Glenn Maxwell, Marnus Labuschagne and Mitchell Swepson. With his tutelage Zampa is ranked the fifth best bowler in T20 cricket and Agar 11, having been in the top ten in the past. He has also nurtured Maxwell’s spin bowling on the journey. “After being on the road for six years it’s with a heavy heart I have decided to move on from my current role as an assistant coach of the Australian men’s team,” he said. “I feel this is an opportune moment keeping in mind the team, giving them enough time to prepare for two World Cups and the World Test Championship. It has been a great experience for me working across formats, World Cups and Ashes and I have come out incredibly richer in knowledge.” added Sridharan. Adam Zampa said: “I love working with Sri, he’s someone I have a lot of respect for and his work ethic and knowledge of the game have been invaluable to my career in recent years.” Read more stories on Cricket.","pubDate":"2022-07-29 05:53:17","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs SA, 2nd T20I: South Africa emerges victorious, series decider to be played on Sunday","link":"https://www.indiatvnews.com/sports/cricket/eng-vs-sa-2nd-t20i-south-africa-emerges-victorious-series-decider-to-be-played-on-sunday-cardiff-match-highlights-match-updates-2022-07-29-795770","keywords":null,"creator":null,"video_url":null,"description":"Cardiff| South Africa on Thursday bamboozled hosts England as they registered a 58-run win in the second T20I match in the three-match series. England, who are having loads of issues in the white ball format lately are still not able to recover from the sudden retirement of Eoin Morgan and Ben Stokes. The England all-rounder Ben Stokes who has just retired from ODI cricket citing issues related to England's white-ball schedule is somehow being left out of the T20I side as well.","content":null,"pubDate":"2022-07-29 05:53:04","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"INDW vs AUSW T20I, CWG 2022 Cricket: भारत जीत से करना चाहेगा आगाज, ऑस्ट्रेलिया से भिड़ंत, कब, कहां और कैसे देखें लाइव मैच","link":"https://www.indiatv.in/sports/cricket/indw-vs-ausw-t20i-cwg-2022-cricket-when-where-and-how-to-watch-live-streaming-of-match-between-india-women-vs-australia-women-2022-07-29-869194","keywords":null,"creator":null,"video_url":null,"description":"INDW vs AUSW T20I, CWG 2022 Cricket: कॉमनवेल्थ गेम्स में भारत और ऑस्ट्रेलिया के बीच आज पहला टी20 मैच।","content":null,"pubDate":"2022-07-29 05:50:23","image_url":null,"source_id":"indiatv","country":["india"],"category":["sports"],"language":"hindi"}]}