{"newsArray":[{"title":"IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-srh-pull-off-stunning-heist-against-rr-as-sandeep-sharmas-last-over-no-ball-proves-costly-12560672.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly","content":"Cricket IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly By all means, SRH’s win over RR was a complete heist. In fact, a perfect example of it. An all-time IPL classic. FirstCricket Staff May 8th, 2023 2:33:55 IST Abdul Samad's 7-ball 17 was a defining knock in SRH's chase against RR. Sportzpics The Indian Premier League (IPL) was witness to a stunning Sunrisers Hyderabad (SRH) victory over Rajasthan Royals (RR) in Jaipur on Sunday, thanks to vital contributions from Abhishek Sharma (55) and Rahul Tripathi (47). IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Chasing a total of 215 in just 20 overs is no easy task, but especially in this edition of the IPL, teams have chased down totals of 200-plus. Thanks for that roller-coaster of a game @rajasthanroyals . Tough luck on the result, but you should be proud. Related Articles IPL 2023: SRH pull off stunning victory against RR in Jaipur IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH — SunRisers Hyderabad (@SunRisers) May 7, 2023 And yet, Sunday was the first time this season that SRH chased down a target in excess of 200. Yes, it was by no means an easy task. Both teams had productive powerplays with the bat, and both teams had the top-order batters producing the runs. WHAT. A. GAME Abdul Samad wins it for the @SunRisers as he hits a maximum off the final delivery. #SRH win by 4 wickets. Scorecard – https://t.co/1EMWKvcgh9 #TATAIPL #RRvSRH #IPL2023 pic.twitter.com/yh0WVMEbOz — IndianPremierLeague (@IPL) May 7, 2023 But, where did RR go wrong on Sunday? One costly no-ball from Sandeep Sharma in the very last over of the chase meant that RR had to lose a game which otherwise they supposedly could have won quite comfortably. By all means, SRH’s win over RR was a complete heist. In fact, a perfect example of it. An all-time IPL classic. Even Yuzvendra Chahal’s 4/29 could not save RR’s day. In fact, he has been one of the most impressive bowlers this IPL. Chahal went for just three runs in the 18 th over of the chase, and with SRH being five down, pressure was certainly on Aiden Markram and Co. Yuzvendra Chahal strikes twice in an over. Rahul Tripathi and Aiden Markram depart in quick succession. Live – https://t.co/aI1qKW8eVW #TATAIPL #RRvSRH #IPL2023 pic.twitter.com/FE4vHpOzMv — IndianPremierLeague (@IPL) May 7, 2023 They were 174/5 after 18 overs, needing 31 off 12 balls. On paper, the target might seem far away, but in realty, especially in a format like T20, it’s not over until it’s over. In the 19 th over, RR stuck with spin, bringing back Kuldip Yadav for his final over. But, for RR, from being in a defendable position at one stage, things went worse, with Kuldip conceding 24 runs from an over. That was far from acceptable from an RR perspective, and they needed a potential game-changer to defend 17 runs off the final over. Given his prior experience of having defended 21 runs off the final over against CSK, Sandeep Sharma was given the duty to defend those runs. It was like one of those ‘been there, done that’ moments for Sandeep. Abdul Samad was on strike to face Sandeep in the first ball of the 20 th over, and he dealt with the RR pacer in valiant fashion. Sandeep, coming from round the wicket, began with a wide yorker to Abdul Samad, who shuffled to slog over the sightscreen. Obed McCoy had a chance for a catch, but eventually put down the chance, a chance that RR would regret following the match. Abdul Samad collected a couple of runs from that over. The match was far from over. In the second ball, Sandeep Sharma yet again unleashed a wide yorker. This time, Samad connected it even better, and drilled straight down the ground, over IPL debutant Joe Root, who got a hand on it but could not keep that momentum. Abul Samad and Jansen kept the scoreboard ticking, and the equation was down to five off one ball. RR, in a precarious in the points team that is already jam-packed with teams like RCB and PBKS, could not avoid any further slip-up. And yet, here they were, in a match where victory was somewhat in sight, but towards the end, nothing was certain. In the last ball of the match, Sandeep goes full and nearly its another yorker. Samad had holed this one towards long-off, but Sandeep had overstepped. Alas! It was a no-ball. SRH now had a psychological advantage over RR. Four to win from one ball. Abdul Samad the batter. It was yet again an attempted yorker from Sandeep, on the slot, and Sandeep stayed at the crease and launched one over the bowler’s head for maximum. The game was done and dusted. More importantly, for SRH it was a win that kept them mathematically alive in the competition. Earlier, Abhishek Sharma (55) and Rahul Tripathi (47) had set the platform for a record chase for SRH. The two had forged a 65-run stand for the second wicket. For SRH, this victory would mean historically relevant, with the chase being their highest-ever in the IPL. And the highest in Jaipur as well. While there will be celebrations of sorts in the SRH camp, one has got to feel for Chahal (4/29), whose regular strikes could not prevent from avoiding defeat for RR. After the match, Samson stressed on the harsh reality of T20 cricket. “Matches like this make IPL special. You can never never feel you have won the game until you have won it. I was confident in Sandeep, but that no-ball… They batted sensibly, and credit has to go to them the way they batted. Life is never easy playing this format in this tournament. You have to be at your best each and every game. We will come back and do it all over again,” said the RR skipper. RR finish off their IPL league stage with matches against the bottom five teams (vs KKR, RCB and PBKS). Anything can happen in these games, and not just physical, but mental preparation will be needed for RR ahead of the remaining matches as they continue their bid to qualify for the playoffs. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 02:33:55 IST Tags: Ipl 2023 Ipl 2023 Rr Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 21:03:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Abdul-Samad-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Narendra Modi Stadium: A happy hunting ground for Shubman Gill","link":"https://thenewsmill.com/2023/05/narendra-modi-stadium-a-happy-hunting-ground-for-shubman-gill/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Another day, another batting masterclass from India and Gujarat Titans (GT) batter Shubman Gill. For this 23-year-old batter from Punjab, who is often hailed as the successor of legendary Virat Kohli, there is a venue that has been a happy hunting ground, just like Adelaide Oval has been for Virat and many stadiums worldwide have been for the ‘God of Cricket’ Sachin Tendulkar. That ground is the Narendra Modi Stadium in Ahmedabad, Gujarat. Gill’s love affair with the ground started during the Indian Premier League (IPL) 2022 final against Rajasthan Royals. Playing for Gujarat Titans in their maiden season, Gill was having his best season of his career after being released by Kolkata Knight Riders. Gill concluded the season perfectly with a match-winning six on an Obed McCoy delivery in the 19th over, finishing off the 131-run chase. The batter finished the season with 483 runs in 16 matches and a total of four half-centuries at an average of over 132.32. After that match, Gill started to get more chances as an opener with Team India in Tests and ODIs, especially the latter. The Punjab batter made the most of these chances, scoring centuries and half-centuries consistently. With every picture-perfect drive, with every short arm jab or lofted hit, Gill’s class started to stand out in every match in which he turned up with big numbers. During the Border-Gavaskar Trophy against Australia this year, Gill smashed his first-ever Test century in the home conditions of India. He toyed with the likes of Nathan Lyon, Matthew Kuhnemann, Cameron Green, Mitchell Starc etc to smash 128 off 235 balls, which consisted of 12 fours and a six. This was also his second Test century. The match ended in a draw. Before IPL 2023, Gill was also handed his T20I debut during a series against Sri Lanka earlier this year. After a disappointing string of scores, fans called for him to be given more matches in ODIs and Tests and for someone better to be called into the T20I side. It seemed that Indian colours were not meant to be worn by Gill for too long in the game’s shorter format, where he played mostly as an anchor, accumulating runs while letting others express themselves with freedom. Then came a T20I match against New Zealand. Right from the ball one of the final T20I, Gill was on a mission. He tore a NZ line-up consisting of Daryl Mitchell, Mitchell Santner, Lockie Ferguson and Ish Sodhi into a thousand pieces, smashing a match-winning 126* in 63 balls. His knock consisted of 12 fours and seven sixes. His knock pushed India to a match-winning total of 234, which NZ fell short of by a long margin, bundled out for just 66. Ahead of IPL 2023, much was expected from Shubman Gill, who had smashed 980 runs in 17 international matches of 2023 with five tons and a fifty, including a double century against New Zealand in an ODI. Gill carried his form forward into Gujarati colours, smashing a match-winning 63 off 36 balls against four-time champions Chennai Super Kings (CSK). Gill continued his form in subsequent matches and with an explosive 94* in 51 balls against Lucknow Super Giants consisting of two fours and seven sixes at a strike rate of over 184, Gill gave yet another statement of what he can offer as an all-format batter. With this knock, Shubman raced to the third spot in the race for the Orange Cap. In 11 matches, he has scored 469 runs at an average of 46.90 and a strike rate of over 143. He has four half-centuries in the IPL 2023. In his total of 10 T20 matches at the venue, Gill has slammed 526 runs at an average of 75.14 and a strike rate of over 152. He has scored three fifties and a century, with best score of 126*. Only time will tell if the stadium becomes synonymous with Gill’s name as much as Adelaide Oval, Delhi’s Arun Jaitley Stadium are with Virat Kohli. (ANI)","pubDate":"2023-05-07 20:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-sandeep-sharmas-no-ball-ruined-our-result-says-sanju-samson-after-rrs-loss-to-srh-12560562.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH","content":"Cricket IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH SRH needed 17 runs from the final over to win the game, but a costly no-ball from Sandeep Sharma cost RR the match. FirstCricket Staff May 8th, 2023 0:53:53 IST Sanju Samson of Rajasthan Royals reacts during match 52 of the Tata Indian Premier League between the Rajasthan Royals and the Sunrisers Hyderabad held at the Sawai Mansingh Stadium, Jaipur on the 7th May 2023 Photo by: Deepak Malik / SPORTZPICS for IPL Rajasthan Royals (RR) skipper Sanju Samson on Sunday admitted that Sandeep Sharma’s costly no-ball in the final over of SRH’s run-chase ‘ruined’ their result after they failed to defend a total of 214/3 in Jaipur. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ SRH needed 17 runs off the final over, and while Sandeep had defended 21 against CSK earlier in the tournament, this was going to be even tougher for him. Sandeep had conceded a six off the second ball of the final over, and by now SRH’s deficit was down to nine from four balls. Related Articles IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly IPL 2023: SRH pull off stunning victory against RR in Jaipur Abdul Samad and Marco Jansen, the SRH batters in the middle at the time, managed to keep the scoreboard ticking and the deficit was even down to five runs from the final ball. Sandeep, however, overstepped in what would have been the last ball of the match, and a free-hit followed. SRH now needed four runs off one better, and Samad did even better, hitting over the bowlers’ head for a flat six, to eventually seal the deal for SRH. “This is what IPL gives you, matches like these makes the IPL special. You can never, never, never feel like you have won the game. I knew any opponent can win it and they were batting well too, but I was confident with Sandeep (defending the final over). He has won us a game from a similar situation (against CSK). He did it again today but that no-ball ruined our result,” said Samson after the match. “To be honest life is never easy playing this format, especially this tournament. Each and every game we have to play our best standard of cricket. We will come back and try to do it again,” added Samson. SRH skipper Aiden Markram felt it was nice for them to get over the finish line. “Emotions turned quite quickly, nice for us to get over the line. Chasing 215 isn’t easy, and guys contributed all along to chase a big target. We knew in a quick outfield like this we’ll score more than expected, but we had to be aggressive. Abhishek started up off, and then Tripathi gave him company. Then those cameos from Phillips and Klaasy,” said the South African. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 00:53:53 IST Tags: Ipl 2023 Ipl 2023 Rr Ipl 2023 Srh Sanju Samson Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 19:23:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Samson-640_Sportzpics-2.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"PAKvNZ: New Zealand beat Pakistan by 47 runs in fifth ODI","link":"https://en.dailypakistan.com.pk/07-May-2023/pakvnz-new-zealand-beat-pakistan-by-47-runs-in-fifth-odi","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"KARACHI – New Zealand defeated Pakistan by 47 runs in the final One Day International (ODI) match at the National Bank Cricket Arena in Karachi on Sunday.","content":"KARACHI – New Zealand defeated Pakistan by 47 runs in the final One Day International (ODI) match at the National Bank Cricket Arena in Karachi on Sunday. Chasing down the target of 300 runs, Pakistan bowled out for 252 runs in the 47th over. During the first innings, Pakistani bowlers were able to limit the flow of runs and ultimately dismissed New Zealand for 299. Despite the Kiwis' initial efforts to surpass 300 runs, the Pakistani bowlers made a strong comeback and prevented them from reaching the milestone. Will Young scored 87 runs while captain Tom Latham made 59 runs. Shaheen Afridi took three wickets, Usama Mir, Shadab Khan bagged two wickets each whereas Haris and Mohammad Wasim Jr shared a wicket apiece. <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A brilliant death overs bowling performance as New Zealand lose their last five wickets for 32 runs ????<a href=\"https://twitter.com/hashtag/PAKvNZ?src=hash&ref_src=twsrc%5Etfw\">#PAKvNZ</a> | <a href=\"https://twitter.com/hashtag/CricketMubarak?src=hash&ref_src=twsrc%5Etfw\">#CricketMubarak</a> <a href=\"https://t.co/zJ0uElyQeG\">pic.twitter.com/zJ0uElyQeG</a></p>— Pakistan Cricket (@TheRealPCB) <a href=\"https://twitter.com/TheRealPCB/status/1655214633438027777?ref_src=twsrc%5Etfw\">May 7, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> Earlier, New Zealand won the toss on elected to bat first in the fifth ODI match against Pakistan. <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">???? T O S S A L E R T ????<br><br>New Zealand win the toss and elect to bat first ????<a href=\"https://twitter.com/hashtag/PAKvNZ?src=hash&ref_src=twsrc%5Etfw\">#PAKvNZ</a> | <a href=\"https://twitter.com/hashtag/CricketMubarak?src=hash&ref_src=twsrc%5Etfw\">#CricketMubarak</a> <a href=\"https://t.co/PK6YFF3m9a\">pic.twitter.com/PK6YFF3m9a</a></p>— Pakistan Cricket (@TheRealPCB) <a href=\"https://twitter.com/TheRealPCB/status/1655153290068492288?ref_src=twsrc%5Etfw\">May 7, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> After clinching the fourth ODI against Black Caps, Men in Green climbed to the top spot in the ODI team rankings for the first time, however, to remain at the number 1, the hosts will have to ensure a clean sweep. Pakistani skipper and flamboyant batter Babar Azam shattered Hashim Amla’s record and became the fastest batter to score 5000 runs in ODIs. : Fakhar Zaman, Shan Masood, Babar Azam (c), Mohammad Rizwan (wk), Iftikhar Ahmed, Mohammad Haris, Agha Salman, Usama Mir, Shaheen Afridi, Haris Rauf, Mohammad Wasim Jr : Will Young, Tom Blundell (wk), Daryl Mitchell, Tom Latham (c), Mark Chapman, James Neesham, Cole McConchie, Ish Sodhi, Matt Henry, Blair Tickner, Ben Lister","pubDate":"2023-05-07 19:14:31","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-07/pakvnz-pakistan-eye-whitewash-against-new-zealand-today-to-maintain-top-odi-ranking-1683438117-8829.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: All-round GT underline title credentials with lopsided win against LSG","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-all-round-gt-underline-title-credentials-with-lopsided-win-against-lsg-12560462.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: All-round GT underline title credentials with lopsided win against LSG","content":"Cricket IPL 2023: All-round GT underline title credentials with lopsided win against LSG Defending champions Gujarat Titans remained on top of the points table and put themselves on the verge of sealing their playoffs berth after hammering Lucknow Super Giants by 56 runs in Ahmedabad on Sunday. FirstCricket Staff May 8th, 2023 0:42:25 IST Gujarat Titans openers Wriddhiman Saha and Shubman Gill set the tone early against Lucknow Super Giants with a 142-run opening stand. Sportzpics Gujarat Titans once again underlined their credentials as title favourites in the 2023 Indian Premier League (IPL) with a comprehensive victory over Lucknow Super Giants (LSG) in Ahmedabad on Sunday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ The defending champions produced a solid all-round performance at their home turf of the Narendra Modi Stadium to collect their eighth win of the season and are currently on the verge of confirming themselves as the first team in the playoffs that begin later this month. The victory also solidifies their bid for a second consecutive title — a feat that has only been achieved by Chennai Super Kings (CSK) and Mumbai Indians (MI) in the past. Related Articles IPL 2023: LSG bring Quinton de Kock in place of Naveen-ul-Haq for GT clash in Ahmedabad IPL 2023: GT complete season double against LSG with 56-run win Gujarat were on top from ball one after Lucknow invited them to bat in the battle of the Pandya brothers — with Hardik and Krunal leading GT and LSG respectively. And though they did get a scare at one point during the second innings, Gujarat would not relinquish control at any given point and would end up collecting another two points with a canter. Gujarat openers Shubman Gill and Wriddhiman Saha have been quite the force at the top of the order this season and the two were at it again on Sunday, with Saha assuming the role of the aggressor after smashing consecutive boundaries off Mohsin Khan in the first over. The veteran wicketkeeper-batter would then collect a six and a four off Avesh Khan the following over, and from thereon, there was no looking back. GT would end up racing to 78 for no loss at the end of the powerplay, with 22 runs coming in Mohsin’s second over. Saha, meanwhile, was in a league of his own during the carnage, bringing up his first half-century of the season with a six off the last ball of the powerplay, taking 23 deliveries to reach the milestone. The expansion of the field would not halt Gujarat’s charge as they raced to 121/0 at the halfway mark, with the possibility of breaching Royal Challengers Bangalore’s all-time record for the highest total appearing quite likely at that point. Lucknow, however, would break the marathon stand not long after, with Saha falling for 81 after an excellent catch at deep midwicket. LSG had the chance to turn things around, especially since the aggressor was gone and they had the opportunity to dictate terms and try and restrict GT to around 200. Instead, Gill, carried on from where his opening partner left off, forging valuable partnerships with Hardik Pandya (25) and David Miller (21 not out), narrowly missing out on his maiden IPL hundred (94 not out) in the end. Gujarat, meanwhile, had half the battle won by posting 227/2 on the board. All they had to do was ensure they did not offer too many gifts on what was a beautiful surface for batters for them to walk away with two points at the end of the contest. Lucknow too possessed firepower at the top of their order; Kyle Mayers had been getting them off to sensational starts for the most part this season, and now the West Indian was joined by Quinton de Kock, who made his first appearance of IPL 2023 and remaining on the sidelines for so long, thanks in part to regular skipper KL Rahul’s injury. And the Mayers-de Kock pair would send out a warning to other bowling lineups in the tournament of the kind of damage that they could inflict with a sensational opening partnership that would have had Gujarat skipper Hardik a little worried at one point despite the massive total on the board. After an excellent first over from Mohammed Shami that yielded just four runs, Mayers and de Kock would collect 68 off the next five to ensure LSG went neck-and-neck with GT in the first six over. LSG could have had a real shot at pulling off a record chase had the opening partnership gone beyond the 10-over mark. Instead, it took a moment of brilliance from Rashid Khan, who pulled off a blinder near deep backward square leg off Mohit Sharma, bowling, for the momentum to swing back in Gujarat’s favour again. Exceptional grab 😎 The @gujarat_titans needed a special effort to break the opening partnership & @rashidkhan_19 does exactly that 🙌 #TATAIPL | #GTvLSG pic.twitter.com/ldRQ5OUae8 — IndianPremierLeague (@IPL) May 7, 2023 “The way the game changed after that, at one point I thought the game was even stevens and that catch was match-changing. We were both driving at 100kph as a team but that catch caused a bump in their chase,” Hardik said after the game, referring to Rashid’s catch to dismiss Mayers. It would indeed turn out to be game-changing moment as de Kock simply would not find the kind of support that he got from Mayers from any other batter, and though he fought on for a while to bring up a half-century in his first appearance of IPL 2023, the pressure got the better of him in the end as he was dismissed for a 41-ball 70 — with Rashid also involved in this dismissal. QdK’s dismissal left LSG needing 87 to win off 24 deliveries with six wickets in hand and two new batters at the crease — simply too much, even for the most complete of teams. With the game virtually sealed in their favour after de Kock’s exit, the cherry on the cake was veteran pacer Mohit finishing with a four-fer (4/29) — his second in the IPL — striking in each of his last two deliveries of the day. GT have a few days off after this commanding victory, with Hardik squaring up against his old team Mumbai Indians at his old stomping grounds of the Wankhede Stadium on Friday, with a victory in that encounter all but sealing GT’s entry into the playoffs. LSG too have a breather, facing Sunrisers Hyderabad on Saturday in their next assignment, hoping to put this defeat behind by then. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 00:42:25 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Lsg Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 19:12:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Wriddhiman-Saha-Shubman-Gill-GT-LSG-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Black Caps v Pakistan recap: New Zealand win fifth ODI","link":"https://www.nzherald.co.nz/sport/black-caps-v-pakistan-live-cricket-updates-fifth-odi/2CQM5A7GQFEYLPP5IEUCPSLIBE/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs.","content":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-05-07 18:41:36","image_url":"https://www.nzherald.co.nz/resizer/eWM9ViC47zhSdsSkYyocwDlGXV0=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/O7DFDWN4WZEOTMWQM2X3TCG3MY.png","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Black Caps v Pakistan: New Zealand win fifth ODI to avoid sweep","link":"https://www.nzherald.co.nz/sport/black-caps-v-pakistan-new-zealand-win-fifth-odi-to-avoid-sweep/JNOZYWRX3RHINEAZK6CPFCXOKM/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs.","content":"The Black Caps enjoyed a consolation 47-run win in the fifth and final one-day cricket international to deny Pakistan a clean sweep of the series today. Pakistan slipped to No. 3 in the ODI rankings behind Australia and India after it was bowled out for 252 in 46.1 overs — its lowest total in the series — as run-machine Babar Azam went for just one run in his 100th ODI in the final game. Pakistan rose to the top of the ODI rankings after it won the fourth game of the series on Friday, but needed a 5-0 sweep to retain its No. 1 spot. Half centuries by Will Young (87) and captain Tom Latham (59) formed the backbone of New Zealand’s total of 299 in 49.3 overs after Latham won his third successive toss in the Karachi-leg of the series, but decided to bat first for the first time. Advertisement Advertise with NZME. Middle-order batter Iftikhar Ahmed missed out on his first ODI century and made a fighting unbeaten 94 off 72 balls after Pakistan’s top-order stuttered for the first time in the series. Fakhar Zaman (33) and Shan Masood (7) both struggled against Matt Henry and Adam Milne’s impeccable lengths with the new ball before Masood played Henry back onto his stumps after struggling for 20 balls. Babar had a dream series which saw him become the fastest player to complete 5,000 runs in ODI cricket — reaching the landmark in 97 innings — but on Sunday the Pakistan skipper was caught at backward point off Henry Shipley (3-34), one of the four changes New Zealand made for the final game. Iftikhar and Salman Ali Agha put Pakistan’s chase back on track with a 97-run fifth-wicket stand before Shipley returned and broke the partnership by having Agha caught at mid-off in the 35th over. Advertisement Advertise with NZME. Iftikhar ran out of partners in the death overs with left-arm spinner Rachin Ravindra finishing with 3-65 as No. 11 Haris Rauf was run out at the non-striker’s end while attempting a second run. Earlier, Young missed out on the second opportunity in the series to score a hundred as Pakistan’s ploy to go with two specialist leg-spinners worked well in the middle overs. Leg-spinners Usama Mir (2-53) and Shadab Khan (2-67) shared four of the five top-order wickets. Shadab got two key wickets when he found a thin outside edge of Young’s bat. Mark Chapman (43) looked to accelerate with Latham but Shadab had him caught well by Mohammad Rizwan down the leg side. Mir accounted for the wickets of Henry Nicholls, who replaced Daryl Mitchell at No. 3, and Latham holed out in the deep while going for a big shot before Pakistan’s pacers took charge in the death overs. Rachin Ravindra (28) and Cole McConchie (26) played little cameos but Pakistan came back strong in the last five overs and claimed five wickets for 32 runs with Shaheen Shah Afridi (3-46) and Haris Rauf (1-45) drying up the runs. New Zealand’s white-ball tour to Pakistan was without eight of its regular players because of their commitments in the Indian Premier League. New Zealand drew the T20 series 2-2 after trailing 2-0 in the series. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-05-07 18:26:15","image_url":"https://www.nzherald.co.nz/resizer/gjVHA-g2XE2MVpWNQ3gMV_5Xs-4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/FOP7OPTC5ZG4RNOET6ZNWUBTLA.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"PAK vs NZ: Iftikhar blitz in vain as New Zealand down Pakistan in fifth ODI","link":"https://a-sports.tv/pak-vs-nz-iftikhar-blitz-vain-new-zealand-down-pakistan/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Determined New Zealand came out roaring in the fifth PAK vs NZ ODI of the five-match series to thrash Pakistan and avoided the clean sweep. Watch PAK vs NZ Live Match in HD Streaming The fifth PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on […] The post PAK vs NZ: Iftikhar blitz in vain as New Zealand down Pakistan in fifth ODI appeared first on ASports.tv.","content":"The fifth PAK vs NZ ODI of the five-match series was played here at the here on Sunday. New Zealand captain Tom Latham opted to bowl first for the first time after the coin flipped in his favour in the ongoing series. His men justified his decision as they piled up a massive total on the scoreboard on the back of brilliant half-centuries by their captain Tom Latham and Will Young. Will Young smashed eight boundaries and two sixes on his way to top score for New Zealand with a 91-ball 87. Latham, on the other hand, played a brisk 59-run knock in just 58 deliveries with the help of five boundaries. The target set by the Kiwis turned out to be too much for as they succumbed to their first defeat in the ongoing five-match series despite a brilliant half-century by Iftikhar Ahmed. A defeat in the fifth PAK vs NZ ODI also deprived Pakistan of the top spot in the ODI team rankings as they slipped back to the third position.","pubDate":"2023-05-07 18:18:36","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"'Perform And Leave': Virender Sehwag's Scathing Reply To Harry Brook's 'Shut Up Indian Fans' Comment After SRH Snub","link":"https://zeenews.india.com/cricket/perform-and-leave-virender-sehwags-scathing-reply-to-harry-brooks-shut-up-indian-fans-comment-after-srh-snub-2604349.html","keywords":null,"creator":null,"video_url":null,"description":"Brook had received criticism from some \"Indian fans\" after his initial poor performance, and after his century, he stated that he was pleased to \"shut them up.\"","content":"Sunrisers Hyderabad (SRH) made a significant call by dropping Harry Brook from their line-up for the must-win game against Rajasthan Royals (RR) at the Sawai Mansingh Stadium in Jaipur on Sunday (May 7). Brook had an unusual season as he was the first centurion of the season, scoring an excellent knock against Kolkata Knight Riders (KKR) at Eden Gardens. However, other than that game, Brook struggled, amassing just 63 runs in eight innings, with a low average of 7.88. He had an extended run as an opener and a middle-order batter. Reacting to the news, Virender Sehwag recalled Brook's past comment after his century against KKR and criticized him for engaging with trolls. Sehwag advised Brook not to pay attention to trolls and to avoid reading comments on social media, which could affect his mindset. Also Read: Watch: Wriddhiman Saha's Trousers Take Center Stage In Hilarious IPL Moment, Hardik Pandya And Mohammed Shami In Stitches - Video Goes Viral \"Why would you mess with trollers? Why should you even look at who are trolling you or criticising you or praising you? Your work is to come, work hard, perform and leave. If you want to put something on social media, then post it. After posting it don't look at the comments because that will definitely affect your mind. For that your need to be in your space - watch movies, listen to music, hangout with friends. Social media is not for watching anything, it is only a place for posting updates. Don't be afraid of them. And if you perform, even those you had trolled or criticised you, will now praise you,\" Sehwag told Cricbuzz. Brook had received criticism from some \"Indian fans\" after his initial poor performance, and after his century, he stated that he was pleased to \"shut them up.\" Dropped Harry brook and chased a target of 217 runs. Liability for the team Let's all gather and laugh at Harry brook ________________________________________________________________________________ pic.twitter.com/RkGQOI9UxW — A_ (@Kohlifier) May 7, 2023 \"I was putting pressure on myself a little bit after the first few games. You go on social media and people are calling you rubbish. You start to doubt yourself a little bit. I just went out there with an 'I don't care' mentality tonight and thankfully it came off. There are a lot of Indian fans out there who'll say 'well done' tonight. But they were slagging me off a few days ago. Glad I could shut them up, to be honest,\" Brook had said.","pubDate":"2023-05-07 17:50:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"How Can RCB Qualify For Playoffs In IPL 2023? - Check","link":"https://zeenews.india.com/cricket/how-can-rcb-qualify-for-playoffs-in-ipl-2023-check-2604329.html","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023 playoffs will see the top four teams compete in four matches - Qualifier 1, Eliminator, Qualifier 2, and the Final - to determine the winner of the tournament.","content":"As the 16th season of the Indian Premier League (IPL) heats up, all teams are vying for a spot in the playoffs, with only the top four teams earning a chance to compete in the next phase of the tournament. With nine other teams competing for the coveted spots, Royal Challengers Bangalore (RCB) will need to be at the top of their game to see off their challengers and secure their place in the top four. The IPL 2023 playoffs will see the top four teams compete in four matches - Qualifier 1, Eliminator, Qualifier 2, and the Final - to determine the winner of the tournament. The top two teams will earn a second chance at making the final. The top two will face each other in the Qualifier 1, with the winner of that match earning a direct entry into the final, while the loser will get a second shot at making the final via Qualifier 2, where they will face the winner of the Eliminator. In the Eliminator, the third and fourth placed teams will face off in a knockout match. Stay the course + Trust the process = Results will follow _ #PlayBold #____RCB #IPL2023 pic.twitter.com/kaorbvi9G2 — Royal Challengers Bangalore (@RCBTweets) May 7, 2023 Also Read: Pandya vs Pandya: Brotherly Showdown In IPL 2023, 7 Famous Brother Duos Who Played With And Against Each Other In IPL's History - In Pics As it stands, RCB are tied with four other teams - Rajasthan Royals, Mumbai Indians, and Punjab Kings - on 10 points after 10 matches. Only RR has a positive Net Run Rate and hence occupies the fourth spot. The top three spots are currently occupied by GT (14 points), CSK (13 points), and LSG (11 points). KKR (8 points), DC (8 points), and SRH (6 points) make up the rest of the table. Although RCB has a negative NRR, they have a better NRR compared to MI and PBKS. To improve their chances of moving up the table, RCB will have to win their remaining matches and also have an eye on NRR. RCB has won matches against Delhi Capitals, MI, PBKS, RR, and LSG, while they suffered defeats to Kolkata Knight Riders (twice), Chennai Super Kings, and DC and LSG (reverse fixtures). They have also played 6 of their 7 home matches already. Therefore, to make it to the playoffs, RCB will need to remain unbeaten on the road. But, with five losses in nine matches, can the Bangalore-based side, who are heavily dependent on their top three batsmen, still make it to the playoffs? In scenario one, after losing to DC, RCB will need to win their remaining four matches, including doing the double over MI and RR, and beating Sunrisers Hyderabad and Gujarat Giants in their final two matches. If they manage to do that, RCB will finish with 18 points and possibly make it to the top four, depending on the results of other teams in the points table. However, NRR will be key, and RCB will need to work on that as well. In scenario two, if RCB wins only three of their remaining matches, they will need other teams on 10 points to drop points, as 16 points may be enough for a playoff spot. However, RCB will need to keep an eye on their NRR because the current top four teams all have a superior NRR compared to theirs and could finish above them if they all end up on the same points. If RCB ends up on 16 points, they will need RR, MI, PBKS, and LSG to lose at least two of their remaining matches, which will ensure they all finish on 15 or fewer points. They will also want KKR to beat PBKS, RR, and LSG. Additionally, they will want CSK to beat KKR.","pubDate":"2023-05-07 16:32:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-srh-pull-off-stunning-heist-against-rr-as-sandeep-sharmas-last-over-no-ball-proves-costly-12560672.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly","content":"Cricket IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly By all means, SRH’s win over RR was a complete heist. In fact, a perfect example of it. An all-time IPL classic. FirstCricket Staff May 8th, 2023 2:33:55 IST Abdul Samad's 7-ball 17 was a defining knock in SRH's chase against RR. Sportzpics The Indian Premier League (IPL) was witness to a stunning Sunrisers Hyderabad (SRH) victory over Rajasthan Royals (RR) in Jaipur on Sunday, thanks to vital contributions from Abhishek Sharma (55) and Rahul Tripathi (47). IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Chasing a total of 215 in just 20 overs is no easy task, but especially in this edition of the IPL, teams have chased down totals of 200-plus. Thanks for that roller-coaster of a game @rajasthanroyals . Tough luck on the result, but you should be proud. Related Articles IPL 2023: SRH pull off stunning victory against RR in Jaipur IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH — SunRisers Hyderabad (@SunRisers) May 7, 2023 And yet, Sunday was the first time this season that SRH chased down a target in excess of 200. Yes, it was by no means an easy task. Both teams had productive powerplays with the bat, and both teams had the top-order batters producing the runs. WHAT. A. GAME Abdul Samad wins it for the @SunRisers as he hits a maximum off the final delivery. #SRH win by 4 wickets. Scorecard – https://t.co/1EMWKvcgh9 #TATAIPL #RRvSRH #IPL2023 pic.twitter.com/yh0WVMEbOz — IndianPremierLeague (@IPL) May 7, 2023 But, where did RR go wrong on Sunday? One costly no-ball from Sandeep Sharma in the very last over of the chase meant that RR had to lose a game which otherwise they supposedly could have won quite comfortably. By all means, SRH’s win over RR was a complete heist. In fact, a perfect example of it. An all-time IPL classic. Even Yuzvendra Chahal’s 4/29 could not save RR’s day. In fact, he has been one of the most impressive bowlers this IPL. Chahal went for just three runs in the 18 th over of the chase, and with SRH being five down, pressure was certainly on Aiden Markram and Co. Yuzvendra Chahal strikes twice in an over. Rahul Tripathi and Aiden Markram depart in quick succession. Live – https://t.co/aI1qKW8eVW #TATAIPL #RRvSRH #IPL2023 pic.twitter.com/FE4vHpOzMv — IndianPremierLeague (@IPL) May 7, 2023 They were 174/5 after 18 overs, needing 31 off 12 balls. On paper, the target might seem far away, but in realty, especially in a format like T20, it’s not over until it’s over. In the 19 th over, RR stuck with spin, bringing back Kuldip Yadav for his final over. But, for RR, from being in a defendable position at one stage, things went worse, with Kuldip conceding 24 runs from an over. That was far from acceptable from an RR perspective, and they needed a potential game-changer to defend 17 runs off the final over. Given his prior experience of having defended 21 runs off the final over against CSK, Sandeep Sharma was given the duty to defend those runs. It was like one of those ‘been there, done that’ moments for Sandeep. Abdul Samad was on strike to face Sandeep in the first ball of the 20 th over, and he dealt with the RR pacer in valiant fashion. Sandeep, coming from round the wicket, began with a wide yorker to Abdul Samad, who shuffled to slog over the sightscreen. Obed McCoy had a chance for a catch, but eventually put down the chance, a chance that RR would regret following the match. Abdul Samad collected a couple of runs from that over. The match was far from over. In the second ball, Sandeep Sharma yet again unleashed a wide yorker. This time, Samad connected it even better, and drilled straight down the ground, over IPL debutant Joe Root, who got a hand on it but could not keep that momentum. Abul Samad and Jansen kept the scoreboard ticking, and the equation was down to five off one ball. RR, in a precarious in the points team that is already jam-packed with teams like RCB and PBKS, could not avoid any further slip-up. And yet, here they were, in a match where victory was somewhat in sight, but towards the end, nothing was certain. In the last ball of the match, Sandeep goes full and nearly its another yorker. Samad had holed this one towards long-off, but Sandeep had overstepped. Alas! It was a no-ball. SRH now had a psychological advantage over RR. Four to win from one ball. Abdul Samad the batter. It was yet again an attempted yorker from Sandeep, on the slot, and Sandeep stayed at the crease and launched one over the bowler’s head for maximum. The game was done and dusted. More importantly, for SRH it was a win that kept them mathematically alive in the competition. Earlier, Abhishek Sharma (55) and Rahul Tripathi (47) had set the platform for a record chase for SRH. The two had forged a 65-run stand for the second wicket. For SRH, this victory would mean historically relevant, with the chase being their highest-ever in the IPL. And the highest in Jaipur as well. While there will be celebrations of sorts in the SRH camp, one has got to feel for Chahal (4/29), whose regular strikes could not prevent from avoiding defeat for RR. After the match, Samson stressed on the harsh reality of T20 cricket. “Matches like this make IPL special. You can never never feel you have won the game until you have won it. I was confident in Sandeep, but that no-ball… They batted sensibly, and credit has to go to them the way they batted. Life is never easy playing this format in this tournament. You have to be at your best each and every game. We will come back and do it all over again,” said the RR skipper. RR finish off their IPL league stage with matches against the bottom five teams (vs KKR, RCB and PBKS). Anything can happen in these games, and not just physical, but mental preparation will be needed for RR ahead of the remaining matches as they continue their bid to qualify for the playoffs. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 02:33:55 IST Tags: Ipl 2023 Ipl 2023 Rr Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 21:03:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Abdul-Samad-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Narendra Modi Stadium: A happy hunting ground for Shubman Gill","link":"https://thenewsmill.com/2023/05/narendra-modi-stadium-a-happy-hunting-ground-for-shubman-gill/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Another day, another batting masterclass from India and Gujarat Titans (GT) batter Shubman Gill. For this 23-year-old batter from Punjab, who is often hailed as the successor of legendary Virat Kohli, there is a venue that has been a happy hunting ground, just like Adelaide Oval has been for Virat and many stadiums worldwide have been for the ‘God of Cricket’ Sachin Tendulkar. That ground is the Narendra Modi Stadium in Ahmedabad, Gujarat. Gill’s love affair with the ground started during the Indian Premier League (IPL) 2022 final against Rajasthan Royals. Playing for Gujarat Titans in their maiden season, Gill was having his best season of his career after being released by Kolkata Knight Riders. Gill concluded the season perfectly with a match-winning six on an Obed McCoy delivery in the 19th over, finishing off the 131-run chase. The batter finished the season with 483 runs in 16 matches and a total of four half-centuries at an average of over 132.32. After that match, Gill started to get more chances as an opener with Team India in Tests and ODIs, especially the latter. The Punjab batter made the most of these chances, scoring centuries and half-centuries consistently. With every picture-perfect drive, with every short arm jab or lofted hit, Gill’s class started to stand out in every match in which he turned up with big numbers. During the Border-Gavaskar Trophy against Australia this year, Gill smashed his first-ever Test century in the home conditions of India. He toyed with the likes of Nathan Lyon, Matthew Kuhnemann, Cameron Green, Mitchell Starc etc to smash 128 off 235 balls, which consisted of 12 fours and a six. This was also his second Test century. The match ended in a draw. Before IPL 2023, Gill was also handed his T20I debut during a series against Sri Lanka earlier this year. After a disappointing string of scores, fans called for him to be given more matches in ODIs and Tests and for someone better to be called into the T20I side. It seemed that Indian colours were not meant to be worn by Gill for too long in the game’s shorter format, where he played mostly as an anchor, accumulating runs while letting others express themselves with freedom. Then came a T20I match against New Zealand. Right from the ball one of the final T20I, Gill was on a mission. He tore a NZ line-up consisting of Daryl Mitchell, Mitchell Santner, Lockie Ferguson and Ish Sodhi into a thousand pieces, smashing a match-winning 126* in 63 balls. His knock consisted of 12 fours and seven sixes. His knock pushed India to a match-winning total of 234, which NZ fell short of by a long margin, bundled out for just 66. Ahead of IPL 2023, much was expected from Shubman Gill, who had smashed 980 runs in 17 international matches of 2023 with five tons and a fifty, including a double century against New Zealand in an ODI. Gill carried his form forward into Gujarati colours, smashing a match-winning 63 off 36 balls against four-time champions Chennai Super Kings (CSK). Gill continued his form in subsequent matches and with an explosive 94* in 51 balls against Lucknow Super Giants consisting of two fours and seven sixes at a strike rate of over 184, Gill gave yet another statement of what he can offer as an all-format batter. With this knock, Shubman raced to the third spot in the race for the Orange Cap. In 11 matches, he has scored 469 runs at an average of 46.90 and a strike rate of over 143. He has four half-centuries in the IPL 2023. In his total of 10 T20 matches at the venue, Gill has slammed 526 runs at an average of 75.14 and a strike rate of over 152. He has scored three fifties and a century, with best score of 126*. Only time will tell if the stadium becomes synonymous with Gill’s name as much as Adelaide Oval, Delhi’s Arun Jaitley Stadium are with Virat Kohli. (ANI)","pubDate":"2023-05-07 20:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-sandeep-sharmas-no-ball-ruined-our-result-says-sanju-samson-after-rrs-loss-to-srh-12560562.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH","content":"Cricket IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH SRH needed 17 runs from the final over to win the game, but a costly no-ball from Sandeep Sharma cost RR the match. FirstCricket Staff May 8th, 2023 0:53:53 IST Sanju Samson of Rajasthan Royals reacts during match 52 of the Tata Indian Premier League between the Rajasthan Royals and the Sunrisers Hyderabad held at the Sawai Mansingh Stadium, Jaipur on the 7th May 2023 Photo by: Deepak Malik / SPORTZPICS for IPL Rajasthan Royals (RR) skipper Sanju Samson on Sunday admitted that Sandeep Sharma’s costly no-ball in the final over of SRH’s run-chase ‘ruined’ their result after they failed to defend a total of 214/3 in Jaipur. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ SRH needed 17 runs off the final over, and while Sandeep had defended 21 against CSK earlier in the tournament, this was going to be even tougher for him. Sandeep had conceded a six off the second ball of the final over, and by now SRH’s deficit was down to nine from four balls. Related Articles IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly IPL 2023: SRH pull off stunning victory against RR in Jaipur Abdul Samad and Marco Jansen, the SRH batters in the middle at the time, managed to keep the scoreboard ticking and the deficit was even down to five runs from the final ball. Sandeep, however, overstepped in what would have been the last ball of the match, and a free-hit followed. SRH now needed four runs off one better, and Samad did even better, hitting over the bowlers’ head for a flat six, to eventually seal the deal for SRH. “This is what IPL gives you, matches like these makes the IPL special. You can never, never, never feel like you have won the game. I knew any opponent can win it and they were batting well too, but I was confident with Sandeep (defending the final over). He has won us a game from a similar situation (against CSK). He did it again today but that no-ball ruined our result,” said Samson after the match. “To be honest life is never easy playing this format, especially this tournament. Each and every game we have to play our best standard of cricket. We will come back and try to do it again,” added Samson. SRH skipper Aiden Markram felt it was nice for them to get over the finish line. “Emotions turned quite quickly, nice for us to get over the line. Chasing 215 isn’t easy, and guys contributed all along to chase a big target. We knew in a quick outfield like this we’ll score more than expected, but we had to be aggressive. Abhishek started up off, and then Tripathi gave him company. Then those cameos from Phillips and Klaasy,” said the South African. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 00:53:53 IST Tags: Ipl 2023 Ipl 2023 Rr Ipl 2023 Srh Sanju Samson Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 19:23:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Samson-640_Sportzpics-2.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"PAKvNZ: New Zealand beat Pakistan by 47 runs in fifth ODI","link":"https://en.dailypakistan.com.pk/07-May-2023/pakvnz-new-zealand-beat-pakistan-by-47-runs-in-fifth-odi","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"KARACHI – New Zealand defeated Pakistan by 47 runs in the final One Day International (ODI) match at the National Bank Cricket Arena in Karachi on Sunday.","content":"KARACHI – New Zealand defeated Pakistan by 47 runs in the final One Day International (ODI) match at the National Bank Cricket Arena in Karachi on Sunday. Chasing down the target of 300 runs, Pakistan bowled out for 252 runs in the 47th over. During the first innings, Pakistani bowlers were able to limit the flow of runs and ultimately dismissed New Zealand for 299. Despite the Kiwis' initial efforts to surpass 300 runs, the Pakistani bowlers made a strong comeback and prevented them from reaching the milestone. Will Young scored 87 runs while captain Tom Latham made 59 runs. Shaheen Afridi took three wickets, Usama Mir, Shadab Khan bagged two wickets each whereas Haris and Mohammad Wasim Jr shared a wicket apiece. <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A brilliant death overs bowling performance as New Zealand lose their last five wickets for 32 runs ????<a href=\"https://twitter.com/hashtag/PAKvNZ?src=hash&ref_src=twsrc%5Etfw\">#PAKvNZ</a> | <a href=\"https://twitter.com/hashtag/CricketMubarak?src=hash&ref_src=twsrc%5Etfw\">#CricketMubarak</a> <a href=\"https://t.co/zJ0uElyQeG\">pic.twitter.com/zJ0uElyQeG</a></p>— Pakistan Cricket (@TheRealPCB) <a href=\"https://twitter.com/TheRealPCB/status/1655214633438027777?ref_src=twsrc%5Etfw\">May 7, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> Earlier, New Zealand won the toss on elected to bat first in the fifth ODI match against Pakistan. <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">???? T O S S A L E R T ????<br><br>New Zealand win the toss and elect to bat first ????<a href=\"https://twitter.com/hashtag/PAKvNZ?src=hash&ref_src=twsrc%5Etfw\">#PAKvNZ</a> | <a href=\"https://twitter.com/hashtag/CricketMubarak?src=hash&ref_src=twsrc%5Etfw\">#CricketMubarak</a> <a href=\"https://t.co/PK6YFF3m9a\">pic.twitter.com/PK6YFF3m9a</a></p>— Pakistan Cricket (@TheRealPCB) <a href=\"https://twitter.com/TheRealPCB/status/1655153290068492288?ref_src=twsrc%5Etfw\">May 7, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> After clinching the fourth ODI against Black Caps, Men in Green climbed to the top spot in the ODI team rankings for the first time, however, to remain at the number 1, the hosts will have to ensure a clean sweep. Pakistani skipper and flamboyant batter Babar Azam shattered Hashim Amla’s record and became the fastest batter to score 5000 runs in ODIs. : Fakhar Zaman, Shan Masood, Babar Azam (c), Mohammad Rizwan (wk), Iftikhar Ahmed, Mohammad Haris, Agha Salman, Usama Mir, Shaheen Afridi, Haris Rauf, Mohammad Wasim Jr : Will Young, Tom Blundell (wk), Daryl Mitchell, Tom Latham (c), Mark Chapman, James Neesham, Cole McConchie, Ish Sodhi, Matt Henry, Blair Tickner, Ben Lister","pubDate":"2023-05-07 19:14:31","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-07/pakvnz-pakistan-eye-whitewash-against-new-zealand-today-to-maintain-top-odi-ranking-1683438117-8829.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: All-round GT underline title credentials with lopsided win against LSG","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-all-round-gt-underline-title-credentials-with-lopsided-win-against-lsg-12560462.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: All-round GT underline title credentials with lopsided win against LSG","content":"Cricket IPL 2023: All-round GT underline title credentials with lopsided win against LSG Defending champions Gujarat Titans remained on top of the points table and put themselves on the verge of sealing their playoffs berth after hammering Lucknow Super Giants by 56 runs in Ahmedabad on Sunday. FirstCricket Staff May 8th, 2023 0:42:25 IST Gujarat Titans openers Wriddhiman Saha and Shubman Gill set the tone early against Lucknow Super Giants with a 142-run opening stand. Sportzpics Gujarat Titans once again underlined their credentials as title favourites in the 2023 Indian Premier League (IPL) with a comprehensive victory over Lucknow Super Giants (LSG) in Ahmedabad on Sunday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ The defending champions produced a solid all-round performance at their home turf of the Narendra Modi Stadium to collect their eighth win of the season and are currently on the verge of confirming themselves as the first team in the playoffs that begin later this month. The victory also solidifies their bid for a second consecutive title — a feat that has only been achieved by Chennai Super Kings (CSK) and Mumbai Indians (MI) in the past. Related Articles IPL 2023: LSG bring Quinton de Kock in place of Naveen-ul-Haq for GT clash in Ahmedabad IPL 2023: GT complete season double against LSG with 56-run win Gujarat were on top from ball one after Lucknow invited them to bat in the battle of the Pandya brothers — with Hardik and Krunal leading GT and LSG respectively. And though they did get a scare at one point during the second innings, Gujarat would not relinquish control at any given point and would end up collecting another two points with a canter. Gujarat openers Shubman Gill and Wriddhiman Saha have been quite the force at the top of the order this season and the two were at it again on Sunday, with Saha assuming the role of the aggressor after smashing consecutive boundaries off Mohsin Khan in the first over. The veteran wicketkeeper-batter would then collect a six and a four off Avesh Khan the following over, and from thereon, there was no looking back. GT would end up racing to 78 for no loss at the end of the powerplay, with 22 runs coming in Mohsin’s second over. Saha, meanwhile, was in a league of his own during the carnage, bringing up his first half-century of the season with a six off the last ball of the powerplay, taking 23 deliveries to reach the milestone. The expansion of the field would not halt Gujarat’s charge as they raced to 121/0 at the halfway mark, with the possibility of breaching Royal Challengers Bangalore’s all-time record for the highest total appearing quite likely at that point. Lucknow, however, would break the marathon stand not long after, with Saha falling for 81 after an excellent catch at deep midwicket. LSG had the chance to turn things around, especially since the aggressor was gone and they had the opportunity to dictate terms and try and restrict GT to around 200. Instead, Gill, carried on from where his opening partner left off, forging valuable partnerships with Hardik Pandya (25) and David Miller (21 not out), narrowly missing out on his maiden IPL hundred (94 not out) in the end. Gujarat, meanwhile, had half the battle won by posting 227/2 on the board. All they had to do was ensure they did not offer too many gifts on what was a beautiful surface for batters for them to walk away with two points at the end of the contest. Lucknow too possessed firepower at the top of their order; Kyle Mayers had been getting them off to sensational starts for the most part this season, and now the West Indian was joined by Quinton de Kock, who made his first appearance of IPL 2023 and remaining on the sidelines for so long, thanks in part to regular skipper KL Rahul’s injury. And the Mayers-de Kock pair would send out a warning to other bowling lineups in the tournament of the kind of damage that they could inflict with a sensational opening partnership that would have had Gujarat skipper Hardik a little worried at one point despite the massive total on the board. After an excellent first over from Mohammed Shami that yielded just four runs, Mayers and de Kock would collect 68 off the next five to ensure LSG went neck-and-neck with GT in the first six over. LSG could have had a real shot at pulling off a record chase had the opening partnership gone beyond the 10-over mark. Instead, it took a moment of brilliance from Rashid Khan, who pulled off a blinder near deep backward square leg off Mohit Sharma, bowling, for the momentum to swing back in Gujarat’s favour again. Exceptional grab 😎 The @gujarat_titans needed a special effort to break the opening partnership & @rashidkhan_19 does exactly that 🙌 #TATAIPL | #GTvLSG pic.twitter.com/ldRQ5OUae8 — IndianPremierLeague (@IPL) May 7, 2023 “The way the game changed after that, at one point I thought the game was even stevens and that catch was match-changing. We were both driving at 100kph as a team but that catch caused a bump in their chase,” Hardik said after the game, referring to Rashid’s catch to dismiss Mayers. It would indeed turn out to be game-changing moment as de Kock simply would not find the kind of support that he got from Mayers from any other batter, and though he fought on for a while to bring up a half-century in his first appearance of IPL 2023, the pressure got the better of him in the end as he was dismissed for a 41-ball 70 — with Rashid also involved in this dismissal. QdK’s dismissal left LSG needing 87 to win off 24 deliveries with six wickets in hand and two new batters at the crease — simply too much, even for the most complete of teams. With the game virtually sealed in their favour after de Kock’s exit, the cherry on the cake was veteran pacer Mohit finishing with a four-fer (4/29) — his second in the IPL — striking in each of his last two deliveries of the day. GT have a few days off after this commanding victory, with Hardik squaring up against his old team Mumbai Indians at his old stomping grounds of the Wankhede Stadium on Friday, with a victory in that encounter all but sealing GT’s entry into the playoffs. LSG too have a breather, facing Sunrisers Hyderabad on Saturday in their next assignment, hoping to put this defeat behind by then. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 00:42:25 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Lsg Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 19:12:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Wriddhiman-Saha-Shubman-Gill-GT-LSG-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Black Caps v Pakistan recap: New Zealand win fifth ODI","link":"https://www.nzherald.co.nz/sport/black-caps-v-pakistan-live-cricket-updates-fifth-odi/2CQM5A7GQFEYLPP5IEUCPSLIBE/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs.","content":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-05-07 18:41:36","image_url":"https://www.nzherald.co.nz/resizer/eWM9ViC47zhSdsSkYyocwDlGXV0=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/O7DFDWN4WZEOTMWQM2X3TCG3MY.png","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Black Caps v Pakistan: New Zealand win fifth ODI to avoid sweep","link":"https://www.nzherald.co.nz/sport/black-caps-v-pakistan-new-zealand-win-fifth-odi-to-avoid-sweep/JNOZYWRX3RHINEAZK6CPFCXOKM/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs.","content":"The Black Caps enjoyed a consolation 47-run win in the fifth and final one-day cricket international to deny Pakistan a clean sweep of the series today. Pakistan slipped to No. 3 in the ODI rankings behind Australia and India after it was bowled out for 252 in 46.1 overs — its lowest total in the series — as run-machine Babar Azam went for just one run in his 100th ODI in the final game. Pakistan rose to the top of the ODI rankings after it won the fourth game of the series on Friday, but needed a 5-0 sweep to retain its No. 1 spot. Half centuries by Will Young (87) and captain Tom Latham (59) formed the backbone of New Zealand’s total of 299 in 49.3 overs after Latham won his third successive toss in the Karachi-leg of the series, but decided to bat first for the first time. Advertisement Advertise with NZME. Middle-order batter Iftikhar Ahmed missed out on his first ODI century and made a fighting unbeaten 94 off 72 balls after Pakistan’s top-order stuttered for the first time in the series. Fakhar Zaman (33) and Shan Masood (7) both struggled against Matt Henry and Adam Milne’s impeccable lengths with the new ball before Masood played Henry back onto his stumps after struggling for 20 balls. Babar had a dream series which saw him become the fastest player to complete 5,000 runs in ODI cricket — reaching the landmark in 97 innings — but on Sunday the Pakistan skipper was caught at backward point off Henry Shipley (3-34), one of the four changes New Zealand made for the final game. Iftikhar and Salman Ali Agha put Pakistan’s chase back on track with a 97-run fifth-wicket stand before Shipley returned and broke the partnership by having Agha caught at mid-off in the 35th over. Advertisement Advertise with NZME. Iftikhar ran out of partners in the death overs with left-arm spinner Rachin Ravindra finishing with 3-65 as No. 11 Haris Rauf was run out at the non-striker’s end while attempting a second run. Earlier, Young missed out on the second opportunity in the series to score a hundred as Pakistan’s ploy to go with two specialist leg-spinners worked well in the middle overs. Leg-spinners Usama Mir (2-53) and Shadab Khan (2-67) shared four of the five top-order wickets. Shadab got two key wickets when he found a thin outside edge of Young’s bat. Mark Chapman (43) looked to accelerate with Latham but Shadab had him caught well by Mohammad Rizwan down the leg side. Mir accounted for the wickets of Henry Nicholls, who replaced Daryl Mitchell at No. 3, and Latham holed out in the deep while going for a big shot before Pakistan’s pacers took charge in the death overs. Rachin Ravindra (28) and Cole McConchie (26) played little cameos but Pakistan came back strong in the last five overs and claimed five wickets for 32 runs with Shaheen Shah Afridi (3-46) and Haris Rauf (1-45) drying up the runs. New Zealand’s white-ball tour to Pakistan was without eight of its regular players because of their commitments in the Indian Premier League. New Zealand drew the T20 series 2-2 after trailing 2-0 in the series. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-05-07 18:26:15","image_url":"https://www.nzherald.co.nz/resizer/gjVHA-g2XE2MVpWNQ3gMV_5Xs-4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/FOP7OPTC5ZG4RNOET6ZNWUBTLA.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"PAK vs NZ: Iftikhar blitz in vain as New Zealand down Pakistan in fifth ODI","link":"https://a-sports.tv/pak-vs-nz-iftikhar-blitz-vain-new-zealand-down-pakistan/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Determined New Zealand came out roaring in the fifth PAK vs NZ ODI of the five-match series to thrash Pakistan and avoided the clean sweep. Watch PAK vs NZ Live Match in HD Streaming The fifth PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on […] The post PAK vs NZ: Iftikhar blitz in vain as New Zealand down Pakistan in fifth ODI appeared first on ASports.tv.","content":"The fifth PAK vs NZ ODI of the five-match series was played here at the here on Sunday. New Zealand captain Tom Latham opted to bowl first for the first time after the coin flipped in his favour in the ongoing series. His men justified his decision as they piled up a massive total on the scoreboard on the back of brilliant half-centuries by their captain Tom Latham and Will Young. Will Young smashed eight boundaries and two sixes on his way to top score for New Zealand with a 91-ball 87. Latham, on the other hand, played a brisk 59-run knock in just 58 deliveries with the help of five boundaries. The target set by the Kiwis turned out to be too much for as they succumbed to their first defeat in the ongoing five-match series despite a brilliant half-century by Iftikhar Ahmed. A defeat in the fifth PAK vs NZ ODI also deprived Pakistan of the top spot in the ODI team rankings as they slipped back to the third position.","pubDate":"2023-05-07 18:18:36","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"'Perform And Leave': Virender Sehwag's Scathing Reply To Harry Brook's 'Shut Up Indian Fans' Comment After SRH Snub","link":"https://zeenews.india.com/cricket/perform-and-leave-virender-sehwags-scathing-reply-to-harry-brooks-shut-up-indian-fans-comment-after-srh-snub-2604349.html","keywords":null,"creator":null,"video_url":null,"description":"Brook had received criticism from some \"Indian fans\" after his initial poor performance, and after his century, he stated that he was pleased to \"shut them up.\"","content":"Sunrisers Hyderabad (SRH) made a significant call by dropping Harry Brook from their line-up for the must-win game against Rajasthan Royals (RR) at the Sawai Mansingh Stadium in Jaipur on Sunday (May 7). Brook had an unusual season as he was the first centurion of the season, scoring an excellent knock against Kolkata Knight Riders (KKR) at Eden Gardens. However, other than that game, Brook struggled, amassing just 63 runs in eight innings, with a low average of 7.88. He had an extended run as an opener and a middle-order batter. Reacting to the news, Virender Sehwag recalled Brook's past comment after his century against KKR and criticized him for engaging with trolls. Sehwag advised Brook not to pay attention to trolls and to avoid reading comments on social media, which could affect his mindset. Also Read: Watch: Wriddhiman Saha's Trousers Take Center Stage In Hilarious IPL Moment, Hardik Pandya And Mohammed Shami In Stitches - Video Goes Viral \"Why would you mess with trollers? Why should you even look at who are trolling you or criticising you or praising you? Your work is to come, work hard, perform and leave. If you want to put something on social media, then post it. After posting it don't look at the comments because that will definitely affect your mind. For that your need to be in your space - watch movies, listen to music, hangout with friends. Social media is not for watching anything, it is only a place for posting updates. Don't be afraid of them. And if you perform, even those you had trolled or criticised you, will now praise you,\" Sehwag told Cricbuzz. Brook had received criticism from some \"Indian fans\" after his initial poor performance, and after his century, he stated that he was pleased to \"shut them up.\" Dropped Harry brook and chased a target of 217 runs. Liability for the team Let's all gather and laugh at Harry brook ________________________________________________________________________________ pic.twitter.com/RkGQOI9UxW — A_ (@Kohlifier) May 7, 2023 \"I was putting pressure on myself a little bit after the first few games. You go on social media and people are calling you rubbish. You start to doubt yourself a little bit. I just went out there with an 'I don't care' mentality tonight and thankfully it came off. There are a lot of Indian fans out there who'll say 'well done' tonight. But they were slagging me off a few days ago. Glad I could shut them up, to be honest,\" Brook had said.","pubDate":"2023-05-07 17:50:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"How Can RCB Qualify For Playoffs In IPL 2023? - Check","link":"https://zeenews.india.com/cricket/how-can-rcb-qualify-for-playoffs-in-ipl-2023-check-2604329.html","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023 playoffs will see the top four teams compete in four matches - Qualifier 1, Eliminator, Qualifier 2, and the Final - to determine the winner of the tournament.","content":"As the 16th season of the Indian Premier League (IPL) heats up, all teams are vying for a spot in the playoffs, with only the top four teams earning a chance to compete in the next phase of the tournament. With nine other teams competing for the coveted spots, Royal Challengers Bangalore (RCB) will need to be at the top of their game to see off their challengers and secure their place in the top four. The IPL 2023 playoffs will see the top four teams compete in four matches - Qualifier 1, Eliminator, Qualifier 2, and the Final - to determine the winner of the tournament. The top two teams will earn a second chance at making the final. The top two will face each other in the Qualifier 1, with the winner of that match earning a direct entry into the final, while the loser will get a second shot at making the final via Qualifier 2, where they will face the winner of the Eliminator. In the Eliminator, the third and fourth placed teams will face off in a knockout match. Stay the course + Trust the process = Results will follow _ #PlayBold #____RCB #IPL2023 pic.twitter.com/kaorbvi9G2 — Royal Challengers Bangalore (@RCBTweets) May 7, 2023 Also Read: Pandya vs Pandya: Brotherly Showdown In IPL 2023, 7 Famous Brother Duos Who Played With And Against Each Other In IPL's History - In Pics As it stands, RCB are tied with four other teams - Rajasthan Royals, Mumbai Indians, and Punjab Kings - on 10 points after 10 matches. Only RR has a positive Net Run Rate and hence occupies the fourth spot. The top three spots are currently occupied by GT (14 points), CSK (13 points), and LSG (11 points). KKR (8 points), DC (8 points), and SRH (6 points) make up the rest of the table. Although RCB has a negative NRR, they have a better NRR compared to MI and PBKS. To improve their chances of moving up the table, RCB will have to win their remaining matches and also have an eye on NRR. RCB has won matches against Delhi Capitals, MI, PBKS, RR, and LSG, while they suffered defeats to Kolkata Knight Riders (twice), Chennai Super Kings, and DC and LSG (reverse fixtures). They have also played 6 of their 7 home matches already. Therefore, to make it to the playoffs, RCB will need to remain unbeaten on the road. But, with five losses in nine matches, can the Bangalore-based side, who are heavily dependent on their top three batsmen, still make it to the playoffs? In scenario one, after losing to DC, RCB will need to win their remaining four matches, including doing the double over MI and RR, and beating Sunrisers Hyderabad and Gujarat Giants in their final two matches. If they manage to do that, RCB will finish with 18 points and possibly make it to the top four, depending on the results of other teams in the points table. However, NRR will be key, and RCB will need to work on that as well. In scenario two, if RCB wins only three of their remaining matches, they will need other teams on 10 points to drop points, as 16 points may be enough for a playoff spot. However, RCB will need to keep an eye on their NRR because the current top four teams all have a superior NRR compared to theirs and could finish above them if they all end up on the same points. If RCB ends up on 16 points, they will need RR, MI, PBKS, and LSG to lose at least two of their remaining matches, which will ensure they all finish on 15 or fewer points. They will also want KKR to beat PBKS, RR, and LSG. Additionally, they will want CSK to beat KKR.","pubDate":"2023-05-07 16:32:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-srh-pull-off-stunning-heist-against-rr-as-sandeep-sharmas-last-over-no-ball-proves-costly-12560672.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly","content":"Cricket IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly By all means, SRH’s win over RR was a complete heist. In fact, a perfect example of it. An all-time IPL classic. FirstCricket Staff May 8th, 2023 2:33:55 IST Abdul Samad's 7-ball 17 was a defining knock in SRH's chase against RR. Sportzpics The Indian Premier League (IPL) was witness to a stunning Sunrisers Hyderabad (SRH) victory over Rajasthan Royals (RR) in Jaipur on Sunday, thanks to vital contributions from Abhishek Sharma (55) and Rahul Tripathi (47). IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Chasing a total of 215 in just 20 overs is no easy task, but especially in this edition of the IPL, teams have chased down totals of 200-plus. Thanks for that roller-coaster of a game @rajasthanroyals . Tough luck on the result, but you should be proud. Related Articles IPL 2023: SRH pull off stunning victory against RR in Jaipur IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH — SunRisers Hyderabad (@SunRisers) May 7, 2023 And yet, Sunday was the first time this season that SRH chased down a target in excess of 200. Yes, it was by no means an easy task. Both teams had productive powerplays with the bat, and both teams had the top-order batters producing the runs. WHAT. A. GAME Abdul Samad wins it for the @SunRisers as he hits a maximum off the final delivery. #SRH win by 4 wickets. Scorecard – https://t.co/1EMWKvcgh9 #TATAIPL #RRvSRH #IPL2023 pic.twitter.com/yh0WVMEbOz — IndianPremierLeague (@IPL) May 7, 2023 But, where did RR go wrong on Sunday? One costly no-ball from Sandeep Sharma in the very last over of the chase meant that RR had to lose a game which otherwise they supposedly could have won quite comfortably. By all means, SRH’s win over RR was a complete heist. In fact, a perfect example of it. An all-time IPL classic. Even Yuzvendra Chahal’s 4/29 could not save RR’s day. In fact, he has been one of the most impressive bowlers this IPL. Chahal went for just three runs in the 18 th over of the chase, and with SRH being five down, pressure was certainly on Aiden Markram and Co. Yuzvendra Chahal strikes twice in an over. Rahul Tripathi and Aiden Markram depart in quick succession. Live – https://t.co/aI1qKW8eVW #TATAIPL #RRvSRH #IPL2023 pic.twitter.com/FE4vHpOzMv — IndianPremierLeague (@IPL) May 7, 2023 They were 174/5 after 18 overs, needing 31 off 12 balls. On paper, the target might seem far away, but in realty, especially in a format like T20, it’s not over until it’s over. In the 19 th over, RR stuck with spin, bringing back Kuldip Yadav for his final over. But, for RR, from being in a defendable position at one stage, things went worse, with Kuldip conceding 24 runs from an over. That was far from acceptable from an RR perspective, and they needed a potential game-changer to defend 17 runs off the final over. Given his prior experience of having defended 21 runs off the final over against CSK, Sandeep Sharma was given the duty to defend those runs. It was like one of those ‘been there, done that’ moments for Sandeep. Abdul Samad was on strike to face Sandeep in the first ball of the 20 th over, and he dealt with the RR pacer in valiant fashion. Sandeep, coming from round the wicket, began with a wide yorker to Abdul Samad, who shuffled to slog over the sightscreen. Obed McCoy had a chance for a catch, but eventually put down the chance, a chance that RR would regret following the match. Abdul Samad collected a couple of runs from that over. The match was far from over. In the second ball, Sandeep Sharma yet again unleashed a wide yorker. This time, Samad connected it even better, and drilled straight down the ground, over IPL debutant Joe Root, who got a hand on it but could not keep that momentum. Abul Samad and Jansen kept the scoreboard ticking, and the equation was down to five off one ball. RR, in a precarious in the points team that is already jam-packed with teams like RCB and PBKS, could not avoid any further slip-up. And yet, here they were, in a match where victory was somewhat in sight, but towards the end, nothing was certain. In the last ball of the match, Sandeep goes full and nearly its another yorker. Samad had holed this one towards long-off, but Sandeep had overstepped. Alas! It was a no-ball. SRH now had a psychological advantage over RR. Four to win from one ball. Abdul Samad the batter. It was yet again an attempted yorker from Sandeep, on the slot, and Sandeep stayed at the crease and launched one over the bowler’s head for maximum. The game was done and dusted. More importantly, for SRH it was a win that kept them mathematically alive in the competition. Earlier, Abhishek Sharma (55) and Rahul Tripathi (47) had set the platform for a record chase for SRH. The two had forged a 65-run stand for the second wicket. For SRH, this victory would mean historically relevant, with the chase being their highest-ever in the IPL. And the highest in Jaipur as well. While there will be celebrations of sorts in the SRH camp, one has got to feel for Chahal (4/29), whose regular strikes could not prevent from avoiding defeat for RR. After the match, Samson stressed on the harsh reality of T20 cricket. “Matches like this make IPL special. You can never never feel you have won the game until you have won it. I was confident in Sandeep, but that no-ball… They batted sensibly, and credit has to go to them the way they batted. Life is never easy playing this format in this tournament. You have to be at your best each and every game. We will come back and do it all over again,” said the RR skipper. RR finish off their IPL league stage with matches against the bottom five teams (vs KKR, RCB and PBKS). Anything can happen in these games, and not just physical, but mental preparation will be needed for RR ahead of the remaining matches as they continue their bid to qualify for the playoffs. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 02:33:55 IST Tags: Ipl 2023 Ipl 2023 Rr Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 21:03:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Abdul-Samad-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Narendra Modi Stadium: A happy hunting ground for Shubman Gill","link":"https://thenewsmill.com/2023/05/narendra-modi-stadium-a-happy-hunting-ground-for-shubman-gill/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Another day, another batting masterclass from India and Gujarat Titans (GT) batter Shubman Gill. For this 23-year-old batter from Punjab, who is often hailed as the successor of legendary Virat Kohli, there is a venue that has been a happy hunting ground, just like Adelaide Oval has been for Virat and many stadiums worldwide have been for the ‘God of Cricket’ Sachin Tendulkar. That ground is the Narendra Modi Stadium in Ahmedabad, Gujarat. Gill’s love affair with the ground started during the Indian Premier League (IPL) 2022 final against Rajasthan Royals. Playing for Gujarat Titans in their maiden season, Gill was having his best season of his career after being released by Kolkata Knight Riders. Gill concluded the season perfectly with a match-winning six on an Obed McCoy delivery in the 19th over, finishing off the 131-run chase. The batter finished the season with 483 runs in 16 matches and a total of four half-centuries at an average of over 132.32. After that match, Gill started to get more chances as an opener with Team India in Tests and ODIs, especially the latter. The Punjab batter made the most of these chances, scoring centuries and half-centuries consistently. With every picture-perfect drive, with every short arm jab or lofted hit, Gill’s class started to stand out in every match in which he turned up with big numbers. During the Border-Gavaskar Trophy against Australia this year, Gill smashed his first-ever Test century in the home conditions of India. He toyed with the likes of Nathan Lyon, Matthew Kuhnemann, Cameron Green, Mitchell Starc etc to smash 128 off 235 balls, which consisted of 12 fours and a six. This was also his second Test century. The match ended in a draw. Before IPL 2023, Gill was also handed his T20I debut during a series against Sri Lanka earlier this year. After a disappointing string of scores, fans called for him to be given more matches in ODIs and Tests and for someone better to be called into the T20I side. It seemed that Indian colours were not meant to be worn by Gill for too long in the game’s shorter format, where he played mostly as an anchor, accumulating runs while letting others express themselves with freedom. Then came a T20I match against New Zealand. Right from the ball one of the final T20I, Gill was on a mission. He tore a NZ line-up consisting of Daryl Mitchell, Mitchell Santner, Lockie Ferguson and Ish Sodhi into a thousand pieces, smashing a match-winning 126* in 63 balls. His knock consisted of 12 fours and seven sixes. His knock pushed India to a match-winning total of 234, which NZ fell short of by a long margin, bundled out for just 66. Ahead of IPL 2023, much was expected from Shubman Gill, who had smashed 980 runs in 17 international matches of 2023 with five tons and a fifty, including a double century against New Zealand in an ODI. Gill carried his form forward into Gujarati colours, smashing a match-winning 63 off 36 balls against four-time champions Chennai Super Kings (CSK). Gill continued his form in subsequent matches and with an explosive 94* in 51 balls against Lucknow Super Giants consisting of two fours and seven sixes at a strike rate of over 184, Gill gave yet another statement of what he can offer as an all-format batter. With this knock, Shubman raced to the third spot in the race for the Orange Cap. In 11 matches, he has scored 469 runs at an average of 46.90 and a strike rate of over 143. He has four half-centuries in the IPL 2023. In his total of 10 T20 matches at the venue, Gill has slammed 526 runs at an average of 75.14 and a strike rate of over 152. He has scored three fifties and a century, with best score of 126*. Only time will tell if the stadium becomes synonymous with Gill’s name as much as Adelaide Oval, Delhi’s Arun Jaitley Stadium are with Virat Kohli. (ANI)","pubDate":"2023-05-07 20:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-sandeep-sharmas-no-ball-ruined-our-result-says-sanju-samson-after-rrs-loss-to-srh-12560562.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH","content":"Cricket IPL 2023: 'Sandeep Sharma's no-ball ruined our result,' says Sanju Samson after RR's loss to SRH SRH needed 17 runs from the final over to win the game, but a costly no-ball from Sandeep Sharma cost RR the match. FirstCricket Staff May 8th, 2023 0:53:53 IST Sanju Samson of Rajasthan Royals reacts during match 52 of the Tata Indian Premier League between the Rajasthan Royals and the Sunrisers Hyderabad held at the Sawai Mansingh Stadium, Jaipur on the 7th May 2023 Photo by: Deepak Malik / SPORTZPICS for IPL Rajasthan Royals (RR) skipper Sanju Samson on Sunday admitted that Sandeep Sharma’s costly no-ball in the final over of SRH’s run-chase ‘ruined’ their result after they failed to defend a total of 214/3 in Jaipur. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ SRH needed 17 runs off the final over, and while Sandeep had defended 21 against CSK earlier in the tournament, this was going to be even tougher for him. Sandeep had conceded a six off the second ball of the final over, and by now SRH’s deficit was down to nine from four balls. Related Articles IPL 2023: SRH pull off stunning heist against RR as Sandeep Sharma's last-over no-ball proves costly IPL 2023: SRH pull off stunning victory against RR in Jaipur Abdul Samad and Marco Jansen, the SRH batters in the middle at the time, managed to keep the scoreboard ticking and the deficit was even down to five runs from the final ball. Sandeep, however, overstepped in what would have been the last ball of the match, and a free-hit followed. SRH now needed four runs off one better, and Samad did even better, hitting over the bowlers’ head for a flat six, to eventually seal the deal for SRH. “This is what IPL gives you, matches like these makes the IPL special. You can never, never, never feel like you have won the game. I knew any opponent can win it and they were batting well too, but I was confident with Sandeep (defending the final over). He has won us a game from a similar situation (against CSK). He did it again today but that no-ball ruined our result,” said Samson after the match. “To be honest life is never easy playing this format, especially this tournament. Each and every game we have to play our best standard of cricket. We will come back and try to do it again,” added Samson. SRH skipper Aiden Markram felt it was nice for them to get over the finish line. “Emotions turned quite quickly, nice for us to get over the line. Chasing 215 isn’t easy, and guys contributed all along to chase a big target. We knew in a quick outfield like this we’ll score more than expected, but we had to be aggressive. Abhishek started up off, and then Tripathi gave him company. Then those cameos from Phillips and Klaasy,” said the South African. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 00:53:53 IST Tags: Ipl 2023 Ipl 2023 Rr Ipl 2023 Srh Sanju Samson Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 19:23:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Samson-640_Sportzpics-2.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"PAKvNZ: New Zealand beat Pakistan by 47 runs in fifth ODI","link":"https://en.dailypakistan.com.pk/07-May-2023/pakvnz-new-zealand-beat-pakistan-by-47-runs-in-fifth-odi","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"KARACHI – New Zealand defeated Pakistan by 47 runs in the final One Day International (ODI) match at the National Bank Cricket Arena in Karachi on Sunday.","content":"KARACHI – New Zealand defeated Pakistan by 47 runs in the final One Day International (ODI) match at the National Bank Cricket Arena in Karachi on Sunday. Chasing down the target of 300 runs, Pakistan bowled out for 252 runs in the 47th over. During the first innings, Pakistani bowlers were able to limit the flow of runs and ultimately dismissed New Zealand for 299. Despite the Kiwis' initial efforts to surpass 300 runs, the Pakistani bowlers made a strong comeback and prevented them from reaching the milestone. Will Young scored 87 runs while captain Tom Latham made 59 runs. Shaheen Afridi took three wickets, Usama Mir, Shadab Khan bagged two wickets each whereas Haris and Mohammad Wasim Jr shared a wicket apiece. <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A brilliant death overs bowling performance as New Zealand lose their last five wickets for 32 runs ????<a href=\"https://twitter.com/hashtag/PAKvNZ?src=hash&ref_src=twsrc%5Etfw\">#PAKvNZ</a> | <a href=\"https://twitter.com/hashtag/CricketMubarak?src=hash&ref_src=twsrc%5Etfw\">#CricketMubarak</a> <a href=\"https://t.co/zJ0uElyQeG\">pic.twitter.com/zJ0uElyQeG</a></p>— Pakistan Cricket (@TheRealPCB) <a href=\"https://twitter.com/TheRealPCB/status/1655214633438027777?ref_src=twsrc%5Etfw\">May 7, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> Earlier, New Zealand won the toss on elected to bat first in the fifth ODI match against Pakistan. <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">???? T O S S A L E R T ????<br><br>New Zealand win the toss and elect to bat first ????<a href=\"https://twitter.com/hashtag/PAKvNZ?src=hash&ref_src=twsrc%5Etfw\">#PAKvNZ</a> | <a href=\"https://twitter.com/hashtag/CricketMubarak?src=hash&ref_src=twsrc%5Etfw\">#CricketMubarak</a> <a href=\"https://t.co/PK6YFF3m9a\">pic.twitter.com/PK6YFF3m9a</a></p>— Pakistan Cricket (@TheRealPCB) <a href=\"https://twitter.com/TheRealPCB/status/1655153290068492288?ref_src=twsrc%5Etfw\">May 7, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> After clinching the fourth ODI against Black Caps, Men in Green climbed to the top spot in the ODI team rankings for the first time, however, to remain at the number 1, the hosts will have to ensure a clean sweep. Pakistani skipper and flamboyant batter Babar Azam shattered Hashim Amla’s record and became the fastest batter to score 5000 runs in ODIs. : Fakhar Zaman, Shan Masood, Babar Azam (c), Mohammad Rizwan (wk), Iftikhar Ahmed, Mohammad Haris, Agha Salman, Usama Mir, Shaheen Afridi, Haris Rauf, Mohammad Wasim Jr : Will Young, Tom Blundell (wk), Daryl Mitchell, Tom Latham (c), Mark Chapman, James Neesham, Cole McConchie, Ish Sodhi, Matt Henry, Blair Tickner, Ben Lister","pubDate":"2023-05-07 19:14:31","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-07/pakvnz-pakistan-eye-whitewash-against-new-zealand-today-to-maintain-top-odi-ranking-1683438117-8829.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: All-round GT underline title credentials with lopsided win against LSG","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-all-round-gt-underline-title-credentials-with-lopsided-win-against-lsg-12560462.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: All-round GT underline title credentials with lopsided win against LSG","content":"Cricket IPL 2023: All-round GT underline title credentials with lopsided win against LSG Defending champions Gujarat Titans remained on top of the points table and put themselves on the verge of sealing their playoffs berth after hammering Lucknow Super Giants by 56 runs in Ahmedabad on Sunday. FirstCricket Staff May 8th, 2023 0:42:25 IST Gujarat Titans openers Wriddhiman Saha and Shubman Gill set the tone early against Lucknow Super Giants with a 142-run opening stand. Sportzpics Gujarat Titans once again underlined their credentials as title favourites in the 2023 Indian Premier League (IPL) with a comprehensive victory over Lucknow Super Giants (LSG) in Ahmedabad on Sunday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ The defending champions produced a solid all-round performance at their home turf of the Narendra Modi Stadium to collect their eighth win of the season and are currently on the verge of confirming themselves as the first team in the playoffs that begin later this month. The victory also solidifies their bid for a second consecutive title — a feat that has only been achieved by Chennai Super Kings (CSK) and Mumbai Indians (MI) in the past. Related Articles IPL 2023: LSG bring Quinton de Kock in place of Naveen-ul-Haq for GT clash in Ahmedabad IPL 2023: GT complete season double against LSG with 56-run win Gujarat were on top from ball one after Lucknow invited them to bat in the battle of the Pandya brothers — with Hardik and Krunal leading GT and LSG respectively. And though they did get a scare at one point during the second innings, Gujarat would not relinquish control at any given point and would end up collecting another two points with a canter. Gujarat openers Shubman Gill and Wriddhiman Saha have been quite the force at the top of the order this season and the two were at it again on Sunday, with Saha assuming the role of the aggressor after smashing consecutive boundaries off Mohsin Khan in the first over. The veteran wicketkeeper-batter would then collect a six and a four off Avesh Khan the following over, and from thereon, there was no looking back. GT would end up racing to 78 for no loss at the end of the powerplay, with 22 runs coming in Mohsin’s second over. Saha, meanwhile, was in a league of his own during the carnage, bringing up his first half-century of the season with a six off the last ball of the powerplay, taking 23 deliveries to reach the milestone. The expansion of the field would not halt Gujarat’s charge as they raced to 121/0 at the halfway mark, with the possibility of breaching Royal Challengers Bangalore’s all-time record for the highest total appearing quite likely at that point. Lucknow, however, would break the marathon stand not long after, with Saha falling for 81 after an excellent catch at deep midwicket. LSG had the chance to turn things around, especially since the aggressor was gone and they had the opportunity to dictate terms and try and restrict GT to around 200. Instead, Gill, carried on from where his opening partner left off, forging valuable partnerships with Hardik Pandya (25) and David Miller (21 not out), narrowly missing out on his maiden IPL hundred (94 not out) in the end. Gujarat, meanwhile, had half the battle won by posting 227/2 on the board. All they had to do was ensure they did not offer too many gifts on what was a beautiful surface for batters for them to walk away with two points at the end of the contest. Lucknow too possessed firepower at the top of their order; Kyle Mayers had been getting them off to sensational starts for the most part this season, and now the West Indian was joined by Quinton de Kock, who made his first appearance of IPL 2023 and remaining on the sidelines for so long, thanks in part to regular skipper KL Rahul’s injury. And the Mayers-de Kock pair would send out a warning to other bowling lineups in the tournament of the kind of damage that they could inflict with a sensational opening partnership that would have had Gujarat skipper Hardik a little worried at one point despite the massive total on the board. After an excellent first over from Mohammed Shami that yielded just four runs, Mayers and de Kock would collect 68 off the next five to ensure LSG went neck-and-neck with GT in the first six over. LSG could have had a real shot at pulling off a record chase had the opening partnership gone beyond the 10-over mark. Instead, it took a moment of brilliance from Rashid Khan, who pulled off a blinder near deep backward square leg off Mohit Sharma, bowling, for the momentum to swing back in Gujarat’s favour again. Exceptional grab 😎 The @gujarat_titans needed a special effort to break the opening partnership & @rashidkhan_19 does exactly that 🙌 #TATAIPL | #GTvLSG pic.twitter.com/ldRQ5OUae8 — IndianPremierLeague (@IPL) May 7, 2023 “The way the game changed after that, at one point I thought the game was even stevens and that catch was match-changing. We were both driving at 100kph as a team but that catch caused a bump in their chase,” Hardik said after the game, referring to Rashid’s catch to dismiss Mayers. It would indeed turn out to be game-changing moment as de Kock simply would not find the kind of support that he got from Mayers from any other batter, and though he fought on for a while to bring up a half-century in his first appearance of IPL 2023, the pressure got the better of him in the end as he was dismissed for a 41-ball 70 — with Rashid also involved in this dismissal. QdK’s dismissal left LSG needing 87 to win off 24 deliveries with six wickets in hand and two new batters at the crease — simply too much, even for the most complete of teams. With the game virtually sealed in their favour after de Kock’s exit, the cherry on the cake was veteran pacer Mohit finishing with a four-fer (4/29) — his second in the IPL — striking in each of his last two deliveries of the day. GT have a few days off after this commanding victory, with Hardik squaring up against his old team Mumbai Indians at his old stomping grounds of the Wankhede Stadium on Friday, with a victory in that encounter all but sealing GT’s entry into the playoffs. LSG too have a breather, facing Sunrisers Hyderabad on Saturday in their next assignment, hoping to put this defeat behind by then. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 08, 2023 00:42:25 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Lsg Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-07 19:12:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Wriddhiman-Saha-Shubman-Gill-GT-LSG-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Black Caps v Pakistan recap: New Zealand win fifth ODI","link":"https://www.nzherald.co.nz/sport/black-caps-v-pakistan-live-cricket-updates-fifth-odi/2CQM5A7GQFEYLPP5IEUCPSLIBE/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs.","content":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-05-07 18:41:36","image_url":"https://www.nzherald.co.nz/resizer/eWM9ViC47zhSdsSkYyocwDlGXV0=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/O7DFDWN4WZEOTMWQM2X3TCG3MY.png","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Black Caps v Pakistan: New Zealand win fifth ODI to avoid sweep","link":"https://www.nzherald.co.nz/sport/black-caps-v-pakistan-new-zealand-win-fifth-odi-to-avoid-sweep/JNOZYWRX3RHINEAZK6CPFCXOKM/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps avoided a sweep by winning the final ODI in Karachi by 47 runs.","content":"The Black Caps enjoyed a consolation 47-run win in the fifth and final one-day cricket international to deny Pakistan a clean sweep of the series today. Pakistan slipped to No. 3 in the ODI rankings behind Australia and India after it was bowled out for 252 in 46.1 overs — its lowest total in the series — as run-machine Babar Azam went for just one run in his 100th ODI in the final game. Pakistan rose to the top of the ODI rankings after it won the fourth game of the series on Friday, but needed a 5-0 sweep to retain its No. 1 spot. Half centuries by Will Young (87) and captain Tom Latham (59) formed the backbone of New Zealand’s total of 299 in 49.3 overs after Latham won his third successive toss in the Karachi-leg of the series, but decided to bat first for the first time. Advertisement Advertise with NZME. Middle-order batter Iftikhar Ahmed missed out on his first ODI century and made a fighting unbeaten 94 off 72 balls after Pakistan’s top-order stuttered for the first time in the series. Fakhar Zaman (33) and Shan Masood (7) both struggled against Matt Henry and Adam Milne’s impeccable lengths with the new ball before Masood played Henry back onto his stumps after struggling for 20 balls. Babar had a dream series which saw him become the fastest player to complete 5,000 runs in ODI cricket — reaching the landmark in 97 innings — but on Sunday the Pakistan skipper was caught at backward point off Henry Shipley (3-34), one of the four changes New Zealand made for the final game. Iftikhar and Salman Ali Agha put Pakistan’s chase back on track with a 97-run fifth-wicket stand before Shipley returned and broke the partnership by having Agha caught at mid-off in the 35th over. Advertisement Advertise with NZME. Iftikhar ran out of partners in the death overs with left-arm spinner Rachin Ravindra finishing with 3-65 as No. 11 Haris Rauf was run out at the non-striker’s end while attempting a second run. Earlier, Young missed out on the second opportunity in the series to score a hundred as Pakistan’s ploy to go with two specialist leg-spinners worked well in the middle overs. Leg-spinners Usama Mir (2-53) and Shadab Khan (2-67) shared four of the five top-order wickets. Shadab got two key wickets when he found a thin outside edge of Young’s bat. Mark Chapman (43) looked to accelerate with Latham but Shadab had him caught well by Mohammad Rizwan down the leg side. Mir accounted for the wickets of Henry Nicholls, who replaced Daryl Mitchell at No. 3, and Latham holed out in the deep while going for a big shot before Pakistan’s pacers took charge in the death overs. Rachin Ravindra (28) and Cole McConchie (26) played little cameos but Pakistan came back strong in the last five overs and claimed five wickets for 32 runs with Shaheen Shah Afridi (3-46) and Haris Rauf (1-45) drying up the runs. New Zealand’s white-ball tour to Pakistan was without eight of its regular players because of their commitments in the Indian Premier League. New Zealand drew the T20 series 2-2 after trailing 2-0 in the series. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-05-07 18:26:15","image_url":"https://www.nzherald.co.nz/resizer/gjVHA-g2XE2MVpWNQ3gMV_5Xs-4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/FOP7OPTC5ZG4RNOET6ZNWUBTLA.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"PAK vs NZ: Iftikhar blitz in vain as New Zealand down Pakistan in fifth ODI","link":"https://a-sports.tv/pak-vs-nz-iftikhar-blitz-vain-new-zealand-down-pakistan/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Determined New Zealand came out roaring in the fifth PAK vs NZ ODI of the five-match series to thrash Pakistan and avoided the clean sweep. Watch PAK vs NZ Live Match in HD Streaming The fifth PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on […] The post PAK vs NZ: Iftikhar blitz in vain as New Zealand down Pakistan in fifth ODI appeared first on ASports.tv.","content":"The fifth PAK vs NZ ODI of the five-match series was played here at the here on Sunday. New Zealand captain Tom Latham opted to bowl first for the first time after the coin flipped in his favour in the ongoing series. His men justified his decision as they piled up a massive total on the scoreboard on the back of brilliant half-centuries by their captain Tom Latham and Will Young. Will Young smashed eight boundaries and two sixes on his way to top score for New Zealand with a 91-ball 87. Latham, on the other hand, played a brisk 59-run knock in just 58 deliveries with the help of five boundaries. The target set by the Kiwis turned out to be too much for as they succumbed to their first defeat in the ongoing five-match series despite a brilliant half-century by Iftikhar Ahmed. A defeat in the fifth PAK vs NZ ODI also deprived Pakistan of the top spot in the ODI team rankings as they slipped back to the third position.","pubDate":"2023-05-07 18:18:36","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"'Perform And Leave': Virender Sehwag's Scathing Reply To Harry Brook's 'Shut Up Indian Fans' Comment After SRH Snub","link":"https://zeenews.india.com/cricket/perform-and-leave-virender-sehwags-scathing-reply-to-harry-brooks-shut-up-indian-fans-comment-after-srh-snub-2604349.html","keywords":null,"creator":null,"video_url":null,"description":"Brook had received criticism from some \"Indian fans\" after his initial poor performance, and after his century, he stated that he was pleased to \"shut them up.\"","content":"Sunrisers Hyderabad (SRH) made a significant call by dropping Harry Brook from their line-up for the must-win game against Rajasthan Royals (RR) at the Sawai Mansingh Stadium in Jaipur on Sunday (May 7). Brook had an unusual season as he was the first centurion of the season, scoring an excellent knock against Kolkata Knight Riders (KKR) at Eden Gardens. However, other than that game, Brook struggled, amassing just 63 runs in eight innings, with a low average of 7.88. He had an extended run as an opener and a middle-order batter. Reacting to the news, Virender Sehwag recalled Brook's past comment after his century against KKR and criticized him for engaging with trolls. Sehwag advised Brook not to pay attention to trolls and to avoid reading comments on social media, which could affect his mindset. Also Read: Watch: Wriddhiman Saha's Trousers Take Center Stage In Hilarious IPL Moment, Hardik Pandya And Mohammed Shami In Stitches - Video Goes Viral \"Why would you mess with trollers? Why should you even look at who are trolling you or criticising you or praising you? Your work is to come, work hard, perform and leave. If you want to put something on social media, then post it. After posting it don't look at the comments because that will definitely affect your mind. For that your need to be in your space - watch movies, listen to music, hangout with friends. Social media is not for watching anything, it is only a place for posting updates. Don't be afraid of them. And if you perform, even those you had trolled or criticised you, will now praise you,\" Sehwag told Cricbuzz. Brook had received criticism from some \"Indian fans\" after his initial poor performance, and after his century, he stated that he was pleased to \"shut them up.\" Dropped Harry brook and chased a target of 217 runs. Liability for the team Let's all gather and laugh at Harry brook ________________________________________________________________________________ pic.twitter.com/RkGQOI9UxW — A_ (@Kohlifier) May 7, 2023 \"I was putting pressure on myself a little bit after the first few games. You go on social media and people are calling you rubbish. You start to doubt yourself a little bit. I just went out there with an 'I don't care' mentality tonight and thankfully it came off. There are a lot of Indian fans out there who'll say 'well done' tonight. But they were slagging me off a few days ago. Glad I could shut them up, to be honest,\" Brook had said.","pubDate":"2023-05-07 17:50:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"How Can RCB Qualify For Playoffs In IPL 2023? - Check","link":"https://zeenews.india.com/cricket/how-can-rcb-qualify-for-playoffs-in-ipl-2023-check-2604329.html","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023 playoffs will see the top four teams compete in four matches - Qualifier 1, Eliminator, Qualifier 2, and the Final - to determine the winner of the tournament.","content":"As the 16th season of the Indian Premier League (IPL) heats up, all teams are vying for a spot in the playoffs, with only the top four teams earning a chance to compete in the next phase of the tournament. With nine other teams competing for the coveted spots, Royal Challengers Bangalore (RCB) will need to be at the top of their game to see off their challengers and secure their place in the top four. The IPL 2023 playoffs will see the top four teams compete in four matches - Qualifier 1, Eliminator, Qualifier 2, and the Final - to determine the winner of the tournament. The top two teams will earn a second chance at making the final. The top two will face each other in the Qualifier 1, with the winner of that match earning a direct entry into the final, while the loser will get a second shot at making the final via Qualifier 2, where they will face the winner of the Eliminator. In the Eliminator, the third and fourth placed teams will face off in a knockout match. Stay the course + Trust the process = Results will follow _ #PlayBold #____RCB #IPL2023 pic.twitter.com/kaorbvi9G2 — Royal Challengers Bangalore (@RCBTweets) May 7, 2023 Also Read: Pandya vs Pandya: Brotherly Showdown In IPL 2023, 7 Famous Brother Duos Who Played With And Against Each Other In IPL's History - In Pics As it stands, RCB are tied with four other teams - Rajasthan Royals, Mumbai Indians, and Punjab Kings - on 10 points after 10 matches. Only RR has a positive Net Run Rate and hence occupies the fourth spot. The top three spots are currently occupied by GT (14 points), CSK (13 points), and LSG (11 points). KKR (8 points), DC (8 points), and SRH (6 points) make up the rest of the table. Although RCB has a negative NRR, they have a better NRR compared to MI and PBKS. To improve their chances of moving up the table, RCB will have to win their remaining matches and also have an eye on NRR. RCB has won matches against Delhi Capitals, MI, PBKS, RR, and LSG, while they suffered defeats to Kolkata Knight Riders (twice), Chennai Super Kings, and DC and LSG (reverse fixtures). They have also played 6 of their 7 home matches already. Therefore, to make it to the playoffs, RCB will need to remain unbeaten on the road. But, with five losses in nine matches, can the Bangalore-based side, who are heavily dependent on their top three batsmen, still make it to the playoffs? In scenario one, after losing to DC, RCB will need to win their remaining four matches, including doing the double over MI and RR, and beating Sunrisers Hyderabad and Gujarat Giants in their final two matches. If they manage to do that, RCB will finish with 18 points and possibly make it to the top four, depending on the results of other teams in the points table. However, NRR will be key, and RCB will need to work on that as well. In scenario two, if RCB wins only three of their remaining matches, they will need other teams on 10 points to drop points, as 16 points may be enough for a playoff spot. However, RCB will need to keep an eye on their NRR because the current top four teams all have a superior NRR compared to theirs and could finish above them if they all end up on the same points. If RCB ends up on 16 points, they will need RR, MI, PBKS, and LSG to lose at least two of their remaining matches, which will ensure they all finish on 15 or fewer points. They will also want KKR to beat PBKS, RR, and LSG. Additionally, they will want CSK to beat KKR.","pubDate":"2023-05-07 16:32:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"}]}