{"newsArray":[{"title":"Sydney Premier Cricket 2021: Rob Aitken plays 500th first grade game, North Sydney, Australian cricket, Greg Davidson","link":"https://www.foxsports.com.au/cricket/australia/sydney-premier-cricket-2021-rob-aitken-plays-500th-first-grade-game-north-sydney-australian-cricket-greg-davidson/news-story/c55c25ef865d01466d188f6b4d9f2af8","keywords":null,"creator":null,"video_url":null,"description":"Rob Aitken would have been a “multi-millionaire” had the dawn of Twenty20 cricket arrived a decade earlier, according to Cricket Australia umpire and former first grade captain Greg Davidson.","content":null,"pubDate":"2021-12-03 22:30:00","full_description":"Rob Aitken would have been a “multi-millionaire” had the dawn of Twenty20 cricket arrived a decade earlier, according to Cricket Australia umpire and former first grade captain Greg Davidson. But in a format often considered a “young man’s game”, Aitken never stood a chance. “T20 cricket wasn’t a big thing back in our day, but if T20 cricket had come 10 years earlier, and this is not a bold statement, he would be a multi-millionaire,” Davidson tells foxsports.com.au. “He would be the perfect T20 cricketer. “Robbie was the type of bloke who could bat in the top six and win you a match or bowl and win you a match. He was a matchwinner. “He had deliveries that even the best, Phil Emery, couldn’t pick. “I know he knocked over Phil Emery a couple of times in a grade game and Phil Emery, who is one of the best wicket-keepers to have played for NSW, just couldn’t pick is wrong’un. His bowling was a mystery really.” Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Cricket Australia umpire and former Parramatta first grade captain Greg Davidson says Rob Aitken would have been a “multi-millionaire” had the T20 age come a decade earlier. Source: News Limited On Saturday, the 46-year-old, who made his first grade debut for Fairfield in 1992, will play his 500th first grade match against St George at North Sydney Oval in the illustrious NSW Premier Cricket competition. It is an extraordinary feat for a humble, though fiercely competitive man, who in another day, or era, or perhaps come from another family, represented New South Wales. “The name Aitken was well respected in cricket, but there was a bit of baggage that came with it,” Davidson, who played at Parramatta when senior Aitken, Bob, was playing and later played with and umpired Rob. “I do know the father was a very aggressive cricketer. Both he and his father should have played first class cricket.” If Australian cricket is indebted to anyone, it is the likes of Rob and brothers James and Glenn, both of whom have spent decades playing first grade, to thank for the foundations they, and club cricketers across the country, have set in stone by preparing NSW players for higher honours. David Warner, Steve Smith, Pat Cummins and co. have benefited from playing the Aitkens. As Aitken prepares for his milestone match, the bowling all-rounder sits 10th with the most first grade runs (11,386 at 29.34) and has 618 wickets to boot, with his slow, right-arm finger-spinning deliveries fooling players for decades. Only one player, former NSW all-rounder Greg Lambert, has more runs (11,413) and wickets (626) but both records will likely be beaten by season's end. John Aitken and Rob Guest at the launch of the Centenary of Federation celebrations. Picture: Ned Kelly Source: News Corp Australia His father, who played his final first grade match at the age of 48, sits sixth on the wicket-takers list with 816 scalps at 23.26. Yet neither Aitken came close to pulling on the baggy blue despite Rob winning the Bill O’Reilly Medal in 2000-01. “I don’t know. It’s not my place to say why I didn’t play first-class cricket,” Aitken says. “I just did my thing. “I was told when I won the O’Reilly Medal, ‘Mate, you’re going to have to leave states, you’re not going to have an opportunity in New South Wales.’ “But I didn’t want to leave. I said, I was happy to play my game and you guys can do whatever you like. Sledging doesn’t have an effect. I’m here to do my own thing.” Aitken has Australian cricketer John Dyson as one of his 600 plus scalps, while he has also removed Warner in recent years but admits the T20 version of the game helped in his quest to rid the powerful left-hander. You can catch up on No. 20-6 in our countdown of the best Australian Ashes performances of the past 20 years via the links below: 20-16 GREATEST: Lyon tears down the ‘fortress’; McGrath’s brutal assault 15-11 GREATEST: Shock admission in 59-ball blitz; Waugh’s miracle on one leg 10-6 GREATEST: Teen’s debut stunner; Waugh moment that stopped the nation Rob Aitken in action. Only nine players in first grade history have scored more runs. Photo: North Sydney Cricket Source: Supplied He also shared a dressing room with former Pakistan captain Waqar Younis and recalls Steve Waugh bumping brother, James, on six consecutive occasions without a helmet on. Bob Aitken, whose brother John was also a fine first-grade cricketer, was a big turning off-spinner who played alongside the great Richie Benaud and was respected by Doug Walters and Bob Simpson. “His old man was one of the biggest turners of the ball for an off-spinner,” Davidson says. “A lot of people I’ve spoken to say he should have played first-class cricket. He’s one of the best not to play first-class cricket. “Having played with Robbie, I would say the same thing about him. “You speak to some of the greats like Doug Walters and Bob Simpson and they rate senior RA very highly. “They talk about Nathan Lyon being a big turner of the ball, I believe his father was an even bigger turner. “He wasn’t everybody’s cuppa tea and I think that worked against him.” Veteran first grade cricketers James, Rob and Glenn Aitken with their children. Photo: North Sydney Cricket Source: Supplied That sentiment is not lost on anyone who has played Sydney Grade Cricket, nor Rob either. “I batted against (Greg) Matthews when he was still playing state cricket and he had nothing compared to my old man bowling to me at the nets down at the park when he had retired for five years,” Aitken says. “He was the best off-spinner I’ve seen and he was never afforded an opportunity. “He didn’t make friends easily, let’s just say amongst the people in the corridors of power, he said it as it was, he played the game hard and, as a consequence of that, when I started playing cricket there were a lot of people running around Sydney Grade Cricket with very deep, I won’t say emotional scars, but they had been mentally beaten up by him pretty much by playing against him. “You might say, the sins of the father were revisited upon the son in a certain sense with regards to the initiation I got to grade cricket. “It was an absolute bombardment by some of the other blokes. “In a sense that was really good because you’ve got to be tough to survive.” Rob Aitken bowls against Manly at Manly Oval. Photo: North Sydney Cricket Source: Supplied Having played across four decades, only one teammate from last week’s loss to Manly, James Campbell, was born when the spinning all-rounder made his first-grade debut. For Aitken though, age and relating to the modern, young cricket does not register. “Honestly, I actually don’t even notice it,” he says. “I don’t look at them being any different. I don’t see myself being my age. “I thought I was 25 for about 15 years. Mentally I’ve clicked over to my thirties now. “People are people. I’m very much used to diversity, I work in south-west Sydney. You end up being blind to it all because you realise everyone’s a person.”","image_url":null,"source_id":"foxsports"},{"title":"Moxon, Gale depart after racism fall out","link":"https://www.perthnow.com.au/sport/cricket/moxon-gale-depart-after-racism-fall-out-c-4811778","keywords":null,"creator":["Ian Laybourn"],"video_url":null,"description":"Yorkshire's director of cricket Martyn Moxon and head coach Andrew Gale are the latest high-profile departures after the Azeem Rafiq racism investigation.","content":null,"pubDate":"2021-12-03 22:29:00","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4811778/123ca89d3d7c356612f87c6991f5bb05089d2378-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Moxon, Gale depart after racism fall out","link":"https://thewest.com.au/sport/cricket/moxon-gale-depart-after-racism-fall-out-c-4811777","keywords":null,"creator":["Ian Laybourn"],"video_url":null,"description":"Yorkshire's director of cricket Martyn Moxon and head coach Andrew Gale are the latest high-profile departures after the Azeem Rafiq racism investigation.","content":null,"pubDate":"2021-12-03 22:29:00","full_description":"Yorkshire's long-serving director of cricket Martyn Moxon and head coach Andrew Gale have become the latest high-profile departures following the Azeem Rafiq racism investigation. The county announced a clear-out on Friday which includes the entire coaching team and made a pledge to appoint successors \"imminently\". But Gale says he will take legal action over his dismissal, saying in a statement to BBC Sport: \"The decision has come as a surprise to me. \"The players knew about it before I did and I will be fighting the decision legally.\" Moxon had been signed off from work due to a stress-related illness since November 9 when Gale was suspended pending a disciplinary hearing into a historical social media post. Their departures follow those of club president Roger Hutton, who stepped down on November 5, and chief executive Mark Arthur, who resigned a week later following widespread condemnation of Yorkshire over its handling of a racism investigation and the treatment of former player Rafiq. Moxon, 61, was an opening batter for Yorkshire from 1980-97 and returned to become director of cricket in 2007. Gale, 38, was also a batter and captained the team until his retirement at the end of the 2016 season when he was appointed coach. Both Moxon and Gale were heavily criticised at the Department for Culture, Media and Sport (DCMS) hearing at Westminster while Rafiq repeated his call for Arthur and Moxon to step down from their roles at the club. \"I don't think Martyn and Andrew can (continue),\" Rafiq said a month ago. \"I don't think it's possible for Yorkshire to move forward with them in there, with them knowing full well what role they played in that institution.\" Yorkshire say the total number of departures is 16, including six members of the backroom medical team, and that an interim medical team is in the process of being appointed. Kamlesh Patel, Yorkshire chair, said: \"Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust. \"The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive. \"We want to make Yorkshire County Cricket Club a place for everyone, from all backgrounds. To do this, we need to rebuild our culture and instil positive values in everyone associated with Yorkshire. \"We are determined to learn from the mistakes of the past to become a club which people can trust. We are hoping to announce a new director of cricket in the coming days. We have a huge rebuilding job to do but we are confident that this heralds a step forward towards a brighter future.\"","image_url":"https://images.thewest.com.au/publication/C-4811777/123ca89d3d7c356612f87c6991f5bb05089d2378-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Australia v England: Mitchell Starc, Travis Head to be selected for first Ashes Test - The Australian","link":"https://news.google.com/__i/rss/rd/articles/CBMirQFodHRwczovL3d3dy50aGVhdXN0cmFsaWFuLmNvbS5hdS9zcG9ydC9jcmlja2V0L2F1c3RyYWxpYS12LWVuZ2xhbmQtbWl0Y2hlbGwtc3RhcmMtdHJhdmlzLWhlYWQtdG8tYmUtc2VsZWN0ZWQtZm9yLWZpcnN0LWFzaGVzLXRlc3QvbmV3cy1zdG9yeS9mMjVkNWE1MDg2NWZhZTAyNGE5NTVhZWI1ODRlMDVjM9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Australia v England: Mitchell Starc, Travis Head to be selected for first Ashes Test  The AustralianShane Warne vents fury over cricket journalist’s ‘ridiculous’ comment  NEWS.com.auShane Warne says Nathan Lyon could face Test axe if India struggles are repeated during the Ashes  Wide World of SportsStarc poised to get first crack at Gabba  The Sydney Morning HeraldAshes 2021-22: Australian selectors decide on team for first Test against England at Gabba  The West AustralianView Full coverage on Google News","content":null,"pubDate":"2021-12-03 21:05:02","image_url":null,"source_id":"google"},{"title":"Yorkshire stars threaten to boycott club as entire coaching staff sacked over racism scandal","link":"https://www.foxsports.com.au/cricket/countries/england/cricket-news-2021-yorkshire-cc-entire-coaching-staff-sacked-racism-scandal-player-boycott-latest-news-azeem-rafiq/news-story/350c3c476ad1257fbaa2097b79701493","keywords":null,"creator":null,"video_url":null,"description":"Yorkshire’s director of cricket Martyn Moxon and head coach Andrew Gale have left the troubled county side along with the entire coaching staff in the latest fallout from a damaging racism scandal.","content":null,"pubDate":"2021-12-03 20:17:00","full_description":"Yorkshire’s director of cricket Martyn Moxon and head coach Andrew Gale have left the troubled county side along with the entire coaching staff in the latest fallout from a damaging racism scandal. Former Yorkshire off-spinner Azeem Rafiq gave harrowing testimony to British lawmakers last month in which he said his career had been ended by the abuse he received at the club. Rafiq had previously called for Moxon and Gale to step down, claiming the club could not move forward until they left Headingley. Moxon, a 61-year-old former Yorkshire and England opening batsman, had been signed off from work due to a stress-related illness since the scandal erupted, while Gale, 38, who previously captained the club, had been suspended pending a disciplinary hearing over a historical tweet. Their departures follow those of club chairman Roger Hutton and chief executive Mark Arthur, who resigned following widespread condemnation of Yorkshire over their treatment of Rafiq. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Kohli FUMES as tight call means duck | 01:28 Moxon and Gale were heavily criticised at the Digital, Culture, Media and Sport select committee hearing in London. “We can confirm that Martyn Moxon, director of cricket, and Andrew Gale, first XI coach, have left the club today in addition to all members of the coaching team,” a Yorkshire statement said on Friday. “A new director of cricket will be appointed imminently, alongside a new coaching team which is being recruited.” The club said the total number of departures was 16, including six members of the backroom medical team provided by Pavilion Physiotherapy Clinic. “Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust,” said new chairman Kamlesh Patel. “The decisions announced today were difficult to make but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive.” But British media reports on Friday said several Yorkshire players could leave the club in protest at the sackings, with concerns that staff have lost their jobs unfairly. Marnus happy to wait for leadership role | 02:10 An independent report found Pakistan-born Rafiq, 30, was a victim of “racial harassment and bullying” but although Yorkshire apologised, they said they would take no disciplinary action against any staff. The fallout for Yorkshire - one of England’s most successful and historic sides - was swift and devastating, with sponsors pulling out and the club suspended from hosting lucrative international matches. Subsequent allegations of racism have been made by other players, setting in motion additional investigations at Yorkshire and other clubs as the scandal spreads. English cricket’s top administrator announced an anti-racism action plan last week, admitting an “earthquake” had hit the sport.","image_url":null,"source_id":"foxsports"},{"title":"QWC vs SPE Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for MCA All Star T10 Bash, Match 13","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/qwc-vs-spe-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-for-mca-all-star-t10-bash?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 19:14:29","full_description":"Qwik Cricket Club will be up against the SFI Panters Euro in the 13th match of the MCA All Star T10 Bash on December 4th at Kinrara Academy Oval, Kuala Lumpur, Malaysia. Qwik Cricket Club haven’t got off to an ideal start to their All-Star T10 Bash campaign as they see themselves at the foot of the points table having lost both of their games. In their most recent encounter, they suffered a 48-run defeat against Rising Smashers and will now look to grab their first win of the season. On the other hand, SFI Panters Euro are also winless so far this season having lost one game while the other got abandoned, placing them in fourth spot in the points table. They will now aim to up their game and climb up the charts with their maiden victory. Qwik Cricket Club Shaukat Ali (C), Mohamed Ridzwan, Raj Sabeek Ali, Noor Mohamed (WK), Ipthikar Haja Mydeen, Satham Mohamed, Muhamad Ashiq, Mohamed Noorul Ameen, H Sheik Ismail, Shaik Raj Mohammed, Ansar Ali Bin Yakoob SFI Panters Euro Ariff Ullah, Akbar Ali, Rizwan Haider, Atiq Ur Rehman, Rajkumar Rajendran, Shakti Singh, Sheraz Farrukh (C), Naeem Khalid Khan, Asad Ali (WK), Muhammad Irfan, Muhammad Imran Ali Match : Qwik Cricket Club vs SFI Panters Euro, MCA All-Star T10 Bash Date and Time: 4th December, 6:30 AM IST Venue : Kinrara Academy Oval The surface at the Kinrara Academy Oval offers ideal assistance to the bowlers. The pacers will play a crucial role throughout the match with their variations. Teams will look to bowl first on this pitch and try to get the upper hand in the game. Wicketkeeper Asad Ali: Asad Ali is a reliable performer with the bat who can also be effective behind the stumps. He is a safe pick in the wicketkeeper department for today’s game. Batters Farrukh Sheraz: Sheraz failed to leave an impression in the previous game with the bat but picked up a crucial wicket with the ball. He can prove to be a key player for his side. Muhammad Irfan: Irfan played a quickfire knock of 23 runs in the previous game at a strike rate of over 160. He is expected to deliver once again in this game. All-rounders Raj Mohamed: Raj Mohamed is a top captain/vice-captain pick for today’s game. In the previous match, he scored 19 runs as well as grabbed two vital wickets. Rizwan Haider: Haider is an excellent bowling all-rounder who can pick up wickets at regular intervals as well as score at a quick pace. He took two wickets in the previous game and is expected to add a few more to his tally. Bowlers Muhamad Ashiq: Ashiq is a top pick from the bowling department in today’s game. He can prove to be handy with his subtle variations and play a match-winning role. Shakti Singh: Shakti is another bowler who can prove to be a wise choice in your D11 team. He can chip in wickets at regular intervals and help his side get over the line. Raj Mohamed: 91 points Rizwan Haider: 84 points Shaukat Ali: 52 points Farrukh Sheraz: 41 points Muhammad Irfan: 39 points Raj Mohamed: 1 match,19 runs and 2 wickets Rizwan Haider: 1 match, 2 wickets Shaukat Ali: 1 match, 27 runs Farrukh Sheraz: 1 match, 1 wicket Muhammad Irfan: 1 match, 23 runs Fantasy Suggestion #1 : Asad Ali, Farrukh Sheraz, Muhammad Irfan, Shaukat Ali, Raj Mohamed, Rizwan Haider, Muhamad Ashiq, Sheikh Ismail, Shakti Singh, Ansar Ali, Mohamed Ridzwan Captain: Raj Mohamed Vice-Captain: Rizwan Haider Fantasy Suggestion #2 : Asad Ali, Farrukh Sheraz, Muhammad Irfan, Shaukat Ali, Raj Mohamed, Rizwan Haider, Muhamad Ashiq, Mohamed Noorul, Shakti Singh, Althaf Basha, Atiq Rehman Captain: Farrukh Sheraz Vice-Captain: Muhammad Irfan","image_url":"https://static.sportskeeda.com/editor/2021/12/a9c0e-16385567723059-1920.jpg","source_id":"sportskeeda"},{"title":"Ashes 2021, Cricket Australia vs England, first Test, preview: Steve Smith, Old Trafford 2019, greatest performances, No.5","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-cricket-australia-vs-england-first-test-preview-steve-smith-old-trafford-2019-greatest-performances-no5/news-story/fe0aa598d2fe8b0e915a1a8817dfa43a","keywords":null,"creator":null,"video_url":null,"description":"On Saturday, we enter the top five in our countdown of the best Australian Ashes performances of the past 20 years, starting with...","content":null,"pubDate":"2021-12-03 19:00:00","full_description":"On Saturday, we enter the top five in our countdown of the best Australian Ashes performances of the past 20 years, starting with... 5. STEVE SMITH, OLD TRAFFORD 2019 To truly appreciate the brilliance of this performance, we need to go back a month before it even began. Steve Smith, in his first Test back from his suspension after the Cape Town ball-tampering scandal, had just sent the strongest possible statement to England. That statement wasn’t simply that he was back. It was that he was back better than ever. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Twin tons at Edgbaston saw Smith tear England’s supposed fortress down, giving Australia the belief that it could – finally - win the Ashes overseas again. “England were struggling with ideas - I think Stuart Broad admitted it - on how to get Steve Smith out,” Nathan Lyon remembers. “They had to try and come up with a way to try and rattle Smithy’s feathers, I guess, and try to make him feel as uncomfortable as they possibly could.” You can catch up on No. 20-6 in our cotundown of the best Australian Ashes performances of the past 20 years via the links below: 20-16 GREATEST: Lyon tears down the ‘fortress’; McGrath’s brutal assault 15-11 GREATEST: Shock admission in 59-ball blitz; Waugh’s miracle on one leg 10-6 GREATEST: Teen’s debut stunner; Waugh moment that stopped the nation No.5 is Steve Smith’s Old Trafford domination in 2019. Source: Getty Images At Lord’s, England’s bowlers hoped to have found the solution. Jofra Archer was promptly handed his Test debut and assigned the task of doing what his teammates couldn’t: Stop Steve Smith. And when he couldn’t do so by wicket, he did so by force. Smith was struck on the left forearm by a thunderbolt and complained that he was unable to lift his bat properly due to a dead arm. What followed was far more frightening. Smith was felled by a 148km/h bouncer that struck him at the base of his skull and left him sprawled out on the ground. Hearts were in mouths inside the Australian dressing room and, indeed, across the cricket world. “Boys, we need someone out there. We need someone out there big time,” Steve Waugh said in the changeroom at the time, as captured by Amazon Prime Video documentary, The Test . Also in the rooms was Peter Siddle, who told the documentary: “I think we were all in shock. “I think the worst was when he was laying there. That was probably the scariest moment for us all.” Waiting to bat was Lyon, who told Fox Theatre this week: “It was pretty hard viewing to be honest with you. It definitely put a big silent wave through the changeroom. “It is pretty nerve-racking and sickening.” Smith was felled by a Jofra Archer bouncer at Lord’s. Source: AFP A dazed Smith eventually returned to his feet, and to the crease where he was eventually dismissed for 92. He didn’t bat again until two Tests later at Old Trafford. In between, Ben Stokes powered England to a narrow one-wicket victory at Headingley in one of the greatest Test matches of all-time. Suddenly, the series was 1-1, England had the momentum – and had supposedly found Smith’s kryptonite. To make matters worse, Smith then walked out to the middle of Old Trafford, after missing the third Test due to a concussion, with Australia once again in trouble at 2-28. To this point, Archer had taken 13 wickets in two matches at a measly average of 13.53, while many suggested that after Lord’s, he had Smith’s number. Smith had already beaten the odds at Edgbaston, but there was a feeling that this was asking for one miracle too many. NEW PODCAST - Brad Haddin: Wicket-keeping state of play and Ashes preview - Listen here or subscribe in iTunes or Spotify “A question was, ‘how’s he going to go?’ He’s taken a knock. He’s coming up against Archer again. Is he going to be back to the powers that he was in the first two Tests?” Pat Cummins said on Fox Theatre this week. “I think pretty quickly you learn that not only (was he back), if anything, he’s even better than he was.” What followed was not just an innings of tremendous resilience, but one that truly raised Smith’s series to one of Bradman-like proportions. The bottom line is that Smith scored just the 26th double century by an Australian at the Ashes, making 211 runs off 319 balls. Australians have scored just four double centuries at the Ashes since 1993 – and Smith is responsible for three of those. His Manchester miracle was worth nearly half of Australia’s runs in a declared first innings of 8-497 that effectively batted England out of the game, and series. The numbers alone are astonishing, but not nearly as much as Smith’s ability to single-handedly turn English exuberance into complete and utter despair in the course of a day’s play. The weight of the occasion and apparent trauma suffered at Lord’s seemingly equated to nothing for Smith. Nor did the fact that the Australian top-order was flagging again with Smith and Marnus Labuschagne the only batters from inside the top six to pass 20 runs. All adversities were laughed off with a confronting ease. Ashes top 20: Warnie's final day heroics | 02:01 Like at Edgbaston, England’s bowlers, including Archer, threw the kitchen sink at Smith and came up empty-handed despite everything working in their favour. “He was the one batter in the side who really just took the fight to them,” Cummins remembered. “And how demoralising it is… I’ve never seen another batter do this to a team where time after time you see the bowlers and Joe Root have aged ten years, because they just don’t have any answers.” That despair grew tenfold when Smith was on 118 and was caught at first slip to leave Australia at 6-273. The only problem was that Jack Leach bowled a no-ball, and Smith returned to score another 93 runs. Eventually, when he was good and ready, Smith was out for 211 playing an adventurous reverse sweep. Ironically, it took a batter – Joe Root – to finally take his wicket. “A quite brilliant innings,” former England Test captain Nasser Hussain said in commentary at the time. “England had no idea how to get him out. “In the end, he had to get himself out.” Smith’s 293 runs at Old Trafford is the sixth-most ever scored by an Australian in a single Ashes test Source: Getty Images It’s easily forgotten that Smith needed to bat a second time at Old Trafford and made a lazy 82 off just 92 balls to set-up another declaration for Cummins and co. to go to work. At that point, 82 was Smith’s lowest score in five innings for the series. Smith’s 293 runs at Old Trafford is the sixth-most ever scored by an Australian in a single Ashes Test, just 41 less than Sir Donald Bradman’s record of 334. “For him to come out the way he did … was absolutely exceptional. It just shows the importance of Steve Smith, I guess, doesn’t it?” Lyon said. Despite the doubt being spread on the outer before the Test, Smith said it was something that he never experienced within. “For me it was just about going about my business, nothing’s changed,” Smith said on Fox Theatre . “That was pretty special after missing the last (Headingley) Test. I wanted this one (century) pretty bad. So it was nice to contribute in the way that I did.” The bowlers delivered on days four and five and Australia won the Test, thus securing the Ashes urn for the first time in England in nearly 20 years. Ashes top 20: Waugh's fairytale ending | 01:45 COUNTDOWN 20. Matthew Wade, Edgbaston 2019 19. Mitchell Johnson, WACA 2010 18. Glenn McGrath, Gabba 2006 17. Nathan Lyon, Edgbaston, 2019 16. Matthew Hayden, Gabba 2002 15. Peter Siddle, Gabba 2010 14. Ricky Ponting, Gabba, 2006 13. Mitch Johnson, Gabba, 2013 12. Steve Waugh, the Oval 2001 11. Adam Gilchrist, WACA, 2006 10. Ashton Agar, Trent Bridge 2013 9. Pat Cummins, Old Trafford 2019 8. Steve Waugh, SCG 2003 7. Glenn McGrath, Lord’s 2005 6. Shane Warne, Adelaide Oval 2006 5. Steve Smith, Old Trafford 2019","image_url":null,"source_id":"foxsports"},{"title":"From high-school ‘sporty-geek’ to Test captain: the rise of Pat Cummins","link":"https://www.theage.com.au/sport/cricket/from-high-school-sporty-geek-to-test-captain-the-rise-of-pat-cummins-20211109-p5977v.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Life has never been all about cricket for Australia’s new men’s Test captain. And given the job Pat Cummins has walked into, that could be his saving grace.","content":null,"pubDate":"2021-12-03 19:00:00","full_description":null,"image_url":null,"source_id":"theage"},{"title":"From high-school ‘sporty-geek’ to Test captain: the rise of Pat Cummins","link":"https://www.smh.com.au/sport/cricket/from-high-school-sporty-geek-to-test-captain-the-rise-of-pat-cummins-20211109-p5977v.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Life has never been all about cricket for Australia’s new men’s Test captain. And given the job Pat Cummins has walked into, that could be his saving grace.","content":null,"pubDate":"2021-12-03 19:00:00","full_description":"Kings Cross, October 2013. Sydney’s nightlife district is entering its final summer before the introduction of the 1.30am lockout laws. Late on this Sunday evening, there’s not a whole lot going on. In the bar of Kit and Kaboodle, a club upstairs from what was then known as The Sugarmill, a smattering of 20-somethings are trying to keep the weekend going. Two are bar staff who work in the CBD, making the most of their “hospo night” before shifts resume. One of the other two is a 20-year-old fast bowler named Patrick Cummins. As he explains to Good Weekend , it wasn’t just youth and spare time that had him out on the town that night. “I’d just been told I had stress fractures again, so I was pretty dirty,” he says. “I’ve been to Kings Cross just a couple of times in my life, and I happened to go on that Sunday night, and it was dead quiet.” Quiet enough for Cummins and his friend to get talking to the only other two people in the bar. “It was people who really should have been going to bed. Becky got dragged there, that’s the only time she’s ever been to the Cross basically, and I went, too, and yeah …” Becky was Rebecca Boston, a 22-year-old from Harrogate in England who was in Australia on a working holiday visa. The conversation continued over a shared meal at McDonald’s on Darlinghurst Road, and resumed the next day with an invitation from Pat to Becky to come to a barbecue. Eight years later, Pat and Becky are engaged. They welcomed their first child, Albie, into the world in October, only days before Cummins flew to the UAE to begin a summer that climaxes with a home Ashes series kicking off next week. This is an important story in the life of Pat Cummins, who at 28 is the first fast bowler in more than half a century to be named captain of the Australian men’s cricket team . (The last was Ray Lindwall, who captained for a single Test in 1956.) Cummins was considered the man most likely for most of 2021, with Tim Paine expected to retire when the Ashes ends in January. That plan was rushed forward mid-last month, however, when a 2018 sexual harassment complaint against Paine hit the headlines, forcing the wicketkeeper’s resignation as Australia’s 46th Test captain. But what’s the connection between a night out in the old Kings Cross and the leadership machinations of Australian cricket in 2021? It comes through in the context in which Cummins framed his early conversations with Becky, and the way he sees himself. “The first couple of times I met Becky I told her I was a uni student because, technically, I was [at the University of Technology, Sydney],” he says. “I left out the cricket part. Then one day, a few weeks after we started dating, she walked past a KFC in the city, and on the front was me wearing a bucket hat. She reckons she did a double take and was like, ‘Hang on, that’s Pat.’ ” Becky takes up the story. “I knew straight away it was Pat and related to some kind of sport, and when I got to my shift at work, I asked the girls, and they had to explain to me that he played cricket. I thought it was pretty cool, but I was very confused, and I had a lot of questions after that! I didn’t know anything about cricket, so it was an eye-opener …” Cummins, then, is a cricketer. But that is far from the only thing he wants to be. And after nearly 25 years of a fully professional system in Australian cricket – where the ball-tampering and Paine scandals suggest perspective from beyond the sport is sorely needed – this can only be good for the national men’s captaincy. “Some parts of it are daunting, but you can’t stay in bed all day worrying about some of these things,” Cummins says of his new responsibilities. “There’s so much positive to this role, there’s so much I could bring to it. I’ll try not to overthink it. I’ll be myself and hopefully that’s enough.” Cummins doesn’t like problems festering. “I don’t want to spend 70 per cent of my life on tour in an environment I’m not comfortable with.” Credit: Getty Images I first met Cummins at the SCG shortly after his return from South Africa in 2011, where his Test debut marked only his fourth first-class match. He’s always been sunny and friendly, if a little mannered in his modesty, conscious he’s being interviewed. Take him away from the here and now, however, and you find the man behind the cricketer. Today we’re talking via Zoom, Cummins from quarantine in Abu Dhabi, ahead of the Australian team’s victorious T20 World Cup campaign last month. He’s let a few days’ stubble grow, even if he is sticking to a rigorous personal training regimen to stay limber. His face lights up when I tell him we’re going back to his childhood – as far as it is possible to be from a hotel room. “No balls in the house” was the instruction that echoed through the family home in NSW’s Blue Mountains, west of Sydney. Cummins’ father, Peter, was an accountant who later ran a sand quarry and remains obsessed with Bruce Springsteen. His mother, Maria, was a maths teacher who endured breast cancer while Cummins was at primary school. As one of five children, Cummins was never short of sporting partners, either competitive footy and cricket with his older brothers Matt and Tim, or netball with Maria and his sisters Laura and Kara. Aged 14, he was invited to a state representative soccer tryout, but missed a Monday night episode of Malcolm in the Middle to do so. “I remember just thinking, ‘That wasn’t worth it, I won’t do that again.’ ” Cricket was Peter Cummins’ favourite sport, the background noise of family summers. Since they did not have Foxtel, news that SBS had free-to-air rights to the 2005 Ashes series caused a momentary panic due to its spotty reception in the Blue Mountains. Until, that is, Peter came through with a solution – a new, SBS-friendly antenna. Other overseas tours were followed via the Cricinfo website: “One of the brothers or Dad would shout out the score every half an hour.” At the co-ed St Paul’s Grammar in Cranebrook, Cummins was sporty but not a jock. “The sporty, geeky-type group,” he says when asked to describe his high school crowd. “St Paul’s wasn’t really sporty at all. The running joke was if you owned a cricket bat you could be in the school team.” To his mates, Cummins was a gifted cricketer, but not excessively so. Nor did he spend every waking moment bowling or hitting balls. So when he let them know he was to make his debut for NSW in January 2011, still aged 17, there was genuine surprise. “They all came to the first couple of NSW games and they were like, ‘We didn’t know you were even close to this a month ago’, and I said, ‘Well, neither did I, really.’ ” Here it’s worth recalling the early days of Australia’s recent men’s Test captains. Ricky Ponting signed a bat contract with Kookaburra aged 14. Michael Clarke’s parents owned an indoor cricket centre, where he spent countless hours playing and training before his first-grade debut at 16. Steve Smith, accompanied by his under-age coach and a Cricket NSW welfare officer, fronted the principal of Menai High School to quit his studies early in year 12. And Tim Paine was barely 16 when contracted by Tasmania. The perspective for which Paine has been lauded only came years later, when a serious finger fracture forced him to the fringes of the professional game and to ponder getting a real job. Even then, his unexpected recall to the Test team contributed to ego-driven trouble of its own. For Cummins, though he made his Test debut earlier than any of the above quartet, cricket was never his idea of a career path until well after it became one. “I knew I needed a proper job, and honestly never did I think that cricket was a career,” he says. “It was only when I got a Cricket Australia contract [in June 2011, less than a month after his 18th birthday] that I thought, ‘Oh my god, I’m actually a professional cricketer here.’ ” Big difference. Geoff Lawson, a visionary former fast bowler who qualified as an optometrist before serving as NSW captain, has seen Cummins’ outlook up close. From behind the state dressing room door, he knew a stand-out captain in the making – reminiscent of the semi-professional era – when he saw one. “It’s a bit of a catch-22,” Lawson says. “The smarter ones know they need a broader outlook on life, so they get it. The not-so-smart ones don’t, so all they do is hit balls as per Ponting, Clarke and Smith. ‘I hit a thousand balls today’ – that’s their big thing. Too many of the next-level and younger players think that’s what they’ve got to do, and don’t worry about the rest of their lives, until cricket might not actually turn out for them.” As well-adjusted as Cummins may be, he will face myriad challenges in a role where, judging by his two predecessors, the better his image, the further he has to fall. Is he durable enough? Does he galvanise the team? Can he lead from the balcony if injured or rested? Will he want to do it for long once he finds out what it’s like? Cummins, and Australia, are about to find out. Pat (at right) with his brothers Matt and Tim in 2010. Credit: Courtesy of the Cummins Family Intelligence , a breadth of thinking and a good education were all going to help Cummins become a cricketer of substance, but they were not the defining characteristics to make it so. Sheer pace, at a very young age, was, however. When did he first realise he was fast? “There was this one guy in junior cricket, every time I played him I hit him, and he retired hurt three times in three years. His mum came up to me, pleading, ‘Please stop hurting my little boy,’ and I was like, ‘I’m sorry, I’m not meaning to hit him,’ but in the back of my mind I’m thinking, ‘Well, he’s allowed to retire, kick his stumps over, this is serious stuff.’ So I didn’t have a lot of sympathy!” Peter Cummins, still without Foxtel, took his sons to a nearby pub to watch a T20 Big Bash game in December 2010. “As a cocky little 17-year-old, I was thinking, ‘I reckon I could play this,’ ” Pat Cummins recalls. “I don’t know where that came from. But within a couple of weeks I got the chance to debut because there were a few injuries. Stuart Clark captained us that season and he really looked after me. I remember feeling like I didn’t belong there.” The speed of Cummins’ rise must have given him something like imposter syndrome – except for when he actually had the ball. “That’s a great way to put it,” he says. “Once I got the ball in my hand, it’s the little brother in me that’s always been trying to compete against my older brothers no matter what, and there are no handicaps.” Pat bats during a muddy game in the Cummins family’s backyard. Credit: Courtesy of the Cummins Family Two images of Cummins stand out from an early Sheffield Shield game at the Sydney Cricket Ground against Western Australia. The first is of how terrifyingly fast he can bowl – at about 150 kilometres per hour – epitomised by the fact he “badged” the Test batter Marcus North (hit him on his helmet’s insignia). This was a feat so rare that a West Australian teammate brought North’s helmet into the NSW rooms for Cummins to impishly sign. He wrote, “Keep your eye on the ball youngster!” North still has the helmet. During his first Sheffield Shield game at the SCG, Cummins drove mum Maria’s car into the ground each morning, with her in the passenger seat, before she drove it home through the day and then returned after play. Before commencing the two-hour return journey with Maria, Cummins reattached his P plates to the front and rear. He recalls being offered a dressing-room beer and thinking, “I’m 17, and I’ve got to drive home …” Cummins winning the man of the match award on his Test debut, against South Africa in 2011. Credit: Getty Images Cummins’ Test debut in South Africa in 2011 remains legendary, not least because he hit the winning runs. As an 18-year-old overseas without his parents for the first time, he had the month of his life. A close friendship was formed with Mitch Marsh, the other young member of the touring squad, while nightly dinners with the likes of Shane Watson and Mike Hussey left him asking more questions than he ever had at school. The first Test in Cape Town famously twisted about six ways in a couple of hours, bewildering everyone. But on debut in the second Test of the series, in Johannesburg in November 2011, Cummins retained the calm and confidence he’d displayed for his state. “This might sound disrespectful, but I remember looking from afar and thinking, ‘Wow, these guys are super-heroes,’ then when I played alongside them I thought, ‘Well, they’re not doing anything I can’t do.’ I felt that really quickly.” How, then, did the 18-year-old get to understand the Australian team dressing room, with all its personalities, histories and pressures? “Chris Hadfield, in his book An Astronaut’s Guide to Life on Earth , had the idea that if you go into a new environment, you don’t have to be a ‘plus one’ addition to start with, just be a zero. So even if you’re at the top of your game and have been brought into a new role, you just have to do no damage, get the lie of the land, and be passive for a while because you and everyone else will learn the right rhythm. That’s always been me.” Initially, the foot stress injury Cummins brought home from South Africa did not seem a huge issue. He was still part of the build-up to the home summer, and promotions for the first season of the Big Bash League. On opening night at the SCG, he was a jovial presence at the Cricket Australia function in the Victor Trumper Stand, and by mid-next year he was back in the white-ball team in the UK. “This might sound disrespectful, but I remember looking from afar and thinking, ‘Wow, these guys are super-heroes,’ then when I played alongside them I thought, ‘Well, they’re not doing anything I can’t do.’” But then problems mounted: a side strain, followed by a second back stress fracture, then a third – the one he was dealing with when he met Becky. There was, as recounted by some Cricket Australia and Cricket NSW fitness and medical staff, a constant tension between Cummins’ prodigious ability and the need for him to be patient with his body, termed a “Ferrari engine in a Corolla chassis” by one physio. What helped Cummins was his enrolment at the University of Technology Sydney, to study business and marketing. Not just for the subjects, but for the maintenance of normality, the continuation of friendships, and the navigation of young adult tasks like figuring out which trains to catch, how to enrol in subjects, where to go for beers after lectures: North Sydney’s Greenwood on a Thursday night. “Uni was a place of comfort with people who had known me for a long time and didn’t really care if I did well in cricket,” he says. “I’d signed up [at 17] before I knew cricket was going to take off, and part of it was an insecurity of still feeling unproven. As stupid as it sounds, I remember the ACA [Australian Cricketers’ Association] helping to chip in and pay for uni, and I thought, ‘What a deal, they’re saving me a couple of grand here, I’d be an idiot not to.’ ” Justine Whipper, formerly the personal development manager at Cricket NSW and now in an overarching role for the ACA, says the way Cummins built wider interests is now a much greater part of player education than a decade ago. “If you’re not doing anything outside of cricket, well your future is completely up to everybody else,” she says. “But if you start to develop yourself and explore, then that becomes under your control.” One physio termed Cummins’ injury-prone body a “Ferrari engine in a Corolla chassis”. Once Becky arrived on the scene, it was she who spent more time away, back with her family in the UK. The relationship grew more organically than most in international cricket: picture an early-20s montage of house renovations, beach time at Sydney’s Clovelly, barbecues and beer gardens. Whenever possible, the couple escape to a farm they own in the NSW Southern Highlands: it was there in February 2020 that Cummins proposed. “More than anything, just the normality of routine together is what I loved the most and still love the most,” he says. “What’s the quote, ‘You don’t miss doing something with someone, you miss doing nothing with someone’? That rings true. “In some ways I had hoped that it might be the calm before the storm. These might be the quiet years – and if everything goes well and I’m away, we might not experience this for a long time.” Cummins, fiancée Becky Boston and Norman the dog at the couple’s NSW Southern Highlands farm, to which they escape whenever possible. Credit: Getty Images Ever since he first picked up Harry Potter as a child, Cummins has been a voracious reader. He balances fiction and non-fiction, science, business and philosophy, downloading tomes to his Kindle whenever he sees something that catches his eye – through his reading glasses. Occasionally, he will keep a hard copy on his travels. At the moment, that book is Awareness by Anthony de Mello. Others have included Sapiens: A Brief History of Humankind by Yuval Noah Harari, and Skin in the Game by Nassim Nicholas Taleb. Cummins has also indulged in deep conversation with teammate Usman Khawaja, who recalls a bracing debate about science, faith and evolution. “Because I’m very religious and he’s not religious at all, we’ve had really good conversations around religion and life, and it’s actually been really in-depth,” Khawaja says. “I think he finds it hard that I’ve always loved science and I’m religious.” Reading – and listening – were hallmarks of how Cummins reflected on the Australian team’s “sandpapergate” ball-tampering scandal in South Africa in 2018. He took a week off with Becky upon his return to Australia, phone off to keep out the noise, then got thinking. “There were a few things you’d never thought about in terms of the bigger context,” he recalls. “It’s moments like that when you remember you’re an Australian cricketer and you’ve got a huge responsibility.” “I know I’ve got a certain amount of energy and I want to spend that on bowling, not waste it getting caught up in other things.” After dominant teams led by Steve Waugh and Ricky Ponting, subsequent Australian sides have seemed at times to be trying to play the roles they once saw on TV, rather than simply being themselves. “You try to be aggressive and in the face of the other team as a 12-year-old because that’s how you think Australian cricket is. There’s something to that, there’s been a lot of success and that is part of it,” says Cummins. “But the more I play, the more I’ve mellowed, purely for performance reasons. I know I’ve got a certain amount of energy and I want to spend that on bowling, not waste it getting caught up in other things.“ Then turning 25, he also realised he could no longer see himself as the youngest guy in a dressing room dictated by older men around him. “Okay, now I’m a full-time Australian cricketer playing all three formats, time to grow up a bit,” he says. “Even in South Africa in 2018 I was the youngest player in that Test match, and from that moment on … there was a shift from one of the younger, inexperienced half of the team to the experienced and senior half of the side.” Cummins and teammate Usman Khawaja have had deep chats about religion. “He’s a very humble character,” says Khawaja. “He treats people nicely.” Credit: Getty Images When he returned from a back injury to the Test team against India in Adelaide in December 2018, other players and staff noticed Cummins now had the capacity to call things out he didn’t like. Some boorish dressing-room language, for instance. “I’ve got a little bit stronger on a few things,” he concedes. “I love the guys who I play alongside; it isn’t just a hobby or even a job. We spend more time with this group than we do with our partners at home. So I don’t like problems festering. I don’t want to spend 70 per cent of my life on tour in an environment I’m not totally comfortable with. “The non-negotiable for teams is that we want to bring a range of diverse thinking and people together. At times that’s been squandered, or you’ve got 30 alpha males on a tour, so there’s going to be times when someone doesn’t fit that kind of mould, and they might feel ostracised.” There is some crossover with Cummins’ other interests. Driven by his parents’ involvement in charitable activities – to this day, they are part of a local feed-the-homeless program every Wednesday night – Cummins has built relationships with UNICEF, climate change initiatives and the anti-racism campaign Reflect Forward. He’s also taken by how “doing things the right way” can now be a competitive advantage. “It’s been a real inflection point in the past couple of years, where if you try to do the right thing, it’s been great to see companies that are rewarded,” he says. “I love seeing the socially conscious companies win. It all comes from consumers and new generations demanding that things are done right.” “Those couple of per cent gains in performance don’t come from skill acquisition or technique.” Two leaders Cummins regards highly are England’s Eoin Morgan and the former New Zealand skipper Brendon McCullum. He’s worked with both for the Kolkata Knight Riders franchise in the Indian Premier League. What the trio share is a belief that, at the top, improvements come from relieving pressure: something that did not take place to a great-enough extent in South Africa in 2018, nor in performances in some more recent series, such as last summer’s home matches against India. “Those couple of per cent gains in performance don’t come from skill acquisition or technique,” Cummins says. “If we’ve got a young guy who’s come into the side, I don’t think senior players or coaches changing his technique and telling him exactly how to bowl or bat are going to have as much of a positive impact as if he feels welcome, and he’s encouraged to do all the things that got him there. If we can relieve a little bit of that pressure everyone feels playing professional sport in front of millions of people, that’s where the biggest value is to be had.” These were some of the themes tackled in the unprecedented recent meeting between Cummins, the then Test captain Tim Paine and white-ball captain Aaron Finch with CA’s chief executive Nick Hockley and the then chair Earl Eddings, to discuss the team environment. On the evidence of the recent T20 World Cup, at which victory was accompanied by coach Justin Langer declaring the squad “embraced fun”, the environment is now being moulded in a more relaxed, player-driven manner than during the past three years. “The most important part of my role is to look after our players and listen to them, make sure they’re heard, so I tried to do that as best as I could,” Cummins says of that meeting. “Everyone likes everything out there, and no secrets, and I thought it was really important that we got together and put it all on the table.” With Tim Paine, whom Cummins replaced as captain. Credit: Getty Images The question of whether a fast bowler could be Australian Test captain was answered partly by the way Tim Paine ended conservatism about giving the same role to a wicketkeeper. Certainly, the former selection chair Trevor Hohns thinks so. “Over the last 12 to 18 months we’ve shown our hand a little bit with Pat,” Hohns says. “As a fast bowler, who knows whether he’s going to be able to play every game. The way to get around that, of course, is to have a good deputy to step up if Pat were to get injured. That deputy would have to be somebody who could take over as captain, not just somebody who is a good second-in-command.” That deputy is Steve Smith, who as a former captain will be able to do exactly that. Cummins got his first glimpse of captaincy with NSW in one-day cricket last summer. “It’s amazing how you’re there doing your shoelaces up and you’ve got 10 different people there: the bowling coach coming to give you a little tip, or the physio comes to say someone is going to be right to play. You’re just in demand.” Having lived through the ball-tampering scandal and a cultural review of the Australian men’s team, Cummins appreciates the wider significance of captaincy, but also counsels consideration of the relative ages of athletes; similar, he says, to those of young musicians or actors, as opposed to corporate CEOs. “A captain does have a lot of responsibility. You’re going to have 10 different personalities, ages, backgrounds; you’ve got to have some kind of range to be able to get the best out of all those players. You’re also looking after a wider support crew of maybe 15 to 20 people on tour, all older than you, more life experience, experts in different fields. So you do need to have a bit more breadth than purely cricket.” Khawaja believes Cummins’ humility will make him a strong leader. “Patty has always been really good at that, he’s been open and welcoming to different people,” he says. “His parents are lovely, too; you can tell he’s come from a good upbringing. I’ve seen the way he treats other people, you can just see it straight away. He’s a very humble character, he treats people nicely.” One of the hardest things for any bowler-captain is the need to think outside themselves even when exhausted. Cummins spoke gracefully to the travelling media about half an hour after Ben Stokes’ 2019 Headingley heist in Leeds, in which Australia lost a supposedly unlosable Test match, even as the dressing room remained in a state of shock. But I remind him of how exasperated he appeared on the final evening of the Old Trafford Test in Manchester a few days later, when his last involvement in the match consisted of a volley of bouncers at the England tail. “I was super-frustrated,” he concedes. “I felt like Headingley got away from us. I thought we should’ve won at Lord’s, too, so I remember thinking, ‘Surely, we can’t have another one that slips away.’ It was an amazing feeling when we finally reclaimed the Ashes by winning at Old Trafford, but from the time that match finished until the fifth and final Test at the Oval, I was spent. I put everything into that Test. “You see people win premierships in AFL or NRL and they go on a two-week bender. Whereas in cricket you come to the end of a Test series and everyone’s ready to go home and sleep for a few days.” Those moments are the biggest question about whether you could be a good Test captain, I say, because that’s how tiring fast bowling can be. “That is one of them, and the other question is just about bowling myself,” he replies. “Do you have a good enough feel for how much you need to bowl or not bowl? But they’re problems that can be solved. [As captain], I won’t be out there alone. If I was exhausted and knew I wasn’t going to be thinking clearly enough and someone else had more to offer, I’d be very comfortable just hand-balling to them at times.” “If we can relieve a little bit of that pressure everyone feels playing professional sport in front of millions of people, that’s where the biggest value is to be had.” Credit: Damian Bennett As we speak , Cummins has one eye on our chat window and one on the baby monitor of his son, Albie. Albie was born on October 8 , only a day later than the couple and Cricket Australia had mapped out in their summer schedule six months beforehand. Well-planned as this was, the new parents then still had the wrenching experience of Cummins’ rapid departure overseas to the United Arab Emirates for the T20 World Cup. “I’m really glad he was there for the birth because I don’t think I could’ve done it without him,” Becky enthuses. “However looking back, him leaving the day after we got home from hospital was the most ridiculous, hardest thing … it was terrible timing. But I wouldn’t have had it any other way; he got to be there, of course, and you’ve got to do what you’ve got to do.” “I’m really glad he was there for the birth … [But] him leaving the day after we got home from hospital was the most ridiculous, hardest thing.” Parenthood is the most fundamental way in which Cummins defines himself, apart from cricket. As Australia’s next Test captain, he knows he’ll be missing a lot of treasured private moments to create many more public ones. When Becky explains she’s been “holding up” Albie to mimic the opening scene in The Lion King while listening to the soundtrack, all of us laugh, as Cummins exclaims, “I didn’t know that.” Then his tone changes to something softer, and more fatherly. “I think I need to get home,” he says. To read more from Good Weekend magazine, visit our page at The Sydney Morning Herald , The Age and Brisbane Times . The best of Good Weekend delivered to your inbox every Saturday morning. Sign up here .","image_url":null,"source_id":"smh"},{"title":"'The Ashes are no time for rest and rotation'","link":"https://www.skysports.com/cricket/news/12040/12485515/the-ashes-englands-need-to-score-big-david-warners-form-rest-and-rotation-pundits-assess-where-the-urn-will-be-won-and-lost","keywords":null,"creator":null,"video_url":null,"description":"“There is Test cricket. Then there is Ashes cricket.”","content":null,"pubDate":"2021-12-03 18:00:00","full_description":"Last Updated: 03/12/21 6:07pm “There is Test cricket. Then there is Ashes cricket.” It is that time again. The Ashes is almost upon us and those words from Joe Root can be added to a long list of quotes that tell us that when England take on Australia, there is just something extra special about it. For an England Test cricketer, an Ashes series in Australia is seen as the greatest challenge you can face. Sky Sports pundits Mike Atherton, Nasser Hussain and Rob Key know all about that having taken on the great Aussie side containing the likes of Ricky Ponting, Shane Warne and Glenn McGrath on their own patch during their playing days. In the Sky Cricket Ashes preview podcast, the trio look ahead to another eagerly anticipated series and highlight some of the areas where the urn could be won and lost… I think David Warner is so important. If I look at their team, the axis of their batting is Steve Smith and Marnus Labuschagne and I'd say they're both kind of bankers for getting runs and having good series. Of course, you never know, there is uncertainty in the game and you never quite know but they're top, top players. Warner has been a top player, and has just had an excellent T20 World Cup, but he had that issue with Broad in England - very different conditions, obviously. [The] Kookaburra [ball], Australian pitches are very different from [the UK] but he's been on the wane a little bit. I think he holds such an important position because if he struggles early on and you can get into Labuschagne and Smith early, then Australia's batting doesn't look fantastic if Warner has an iffy time of it. If, suddenly, he comes good and shows that he's still a world class player in Test cricket and you put that alongside Smith and Labuschagne, it starts to look a very different Australia team. I do think that mouth-watering battle between Warner and Stuart Broad, if he plays at the start, is going to be significant. All the talk of who opens with Warner, I know they've made their decision now, but they're kind of banking on Warner to get back to his best. At the start of the series, England will be desperate to just unpick a few uncertainties that might be there from the last series that he had against them. If they do then Australia's batting doesn't look absolutely fantastic. They've got some top-class players in there, but I think Warner is key. We all know Broady well, he's worked with us, and we always go on about Australia: the bowling attack, the Kookaburra ball and having a point of difference, playing Mark Wood and having that extra pace, and Broad always says 'yeah, that's a good point, excellent but, actually, you need runs.' You need big, big first-innings runs. I always go back to when I woke up on the first morning at Brisbane on the last tour out there - and England were going really well, they were 145-2, James Vince was batting beautifully, Ian Chappell was waxing lyrical about him, and then Vince is run out and England are bowled out for 300. England lose and they go on to lose the series heavily. In England, if you get 300 in your first innings, against the Dukes ball, you will win most of your games with Broad, Anderson, Woakes, Robinson and the conditions we have seen in the last decade. Now there is a weather pattern going on in Australia, but, in your normal Australian conditions, if you get 300 in your first innings, you will lose more games than you win because the opposition will go on and get 400 or 450 and then you're chasing it. Then it starts to spin and get a little bit uneven. December 4, 2021, 3:50am Live on The way to attack Australia is big first-innings runs and you go back to 2010-11 and the likes of Strauss, Cook, Trott, Pietersen, Bell and Prior, they got massive runs in the first innings and then you've got a bowling attack that can compete. That, for me, is the mindset of big runs and it cannot just be Joe Root. You don't get 450-500 with just Root. The last thing I want to hear about after last winter and the summer is rest and rotation. For this Ashes series, surely you don't want to try and be too clever and think already 'we're not going to play Jimmy Anderson in the third Test'. Do it as you go. So, if you turn up to the next Test and, say, Stuart Broad feels that he's struggling a bit then you leave them out. You don't have this pre-emptive plan to rest and rotate players. You just turn up to every Ashes Test match and say 'what is our best team? What is our best attack for the conditions to win this game of cricket?' Forget about that stuff we had all last winter. I know we're not going to be flying people home and giving them a Test match off. This is The Ashes, surely, we don't want to be hearing about rest and rotation?","image_url":"https://e2.365dm.com/21/12/1920x1080/skysports-ap-newsroom-stuart-broad_5603434.jpg?20211203174308","source_id":"skysports"},{"title":"Jay Shah 11 vs Ganguly 11 match result: Who won President XI vs Secretary XI BCCI AGM Festival match?","link":"https://thesportsrush.com/jay-shah-11-vs-ganguly-11-match-result-who-won-president-xi-vs-secretary-xi-bcci-agm-festival-match/","keywords":["Cricket","BCCI","Jay Shah","Sourav Ganguly"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Jay Shah 11 vs Ganguly 11 match result: Sourav Ganguly and Jay Shah were up against each other at the Eden Gardens in Kolkata The ‘Prince of Kolkata’ Sourav Ganguly stepped on yet again at the iconic Eden Gardens to lead the ‘President’s XI’ side against the team led by the BCCI Secretary Jay Shah… The post Jay Shah 11 vs Ganguly 11 match result: Who won President XI vs Secretary XI BCCI AGM Festival match? appeared first on The SportsRush.","content":"Jay Shah 11 vs Ganguly 11 match result: Sourav Ganguly and Jay Shah were up against each other at the Eden Gardens in Kolkata The ‘Prince of Kolkata’ Sourav Ganguly stepped on yet again at the iconic Eden Gardens to lead the ‘President’s XI’ side against the team led by the BCCI Secretary Jay Shah during an exhibition match on Friday. Both the teams played an exhibition match on the eve of the Annual General Meeting (AGM) of BCCI set to take place on December 4. Playing a 15-Over match at the Eden Gardens, Sourav Ganguly, representing the President’s XI was on song right from the get go playing his sumptuous trademark strokes through the off-side. Chasing the total of 128 posted by Jay Shah’s ‘President’s XI, Ganguly (35 off 20 deliveries) smashed four boundaries and a couple of handsome sixes en route his innings before retiring himself. And finally, @SGanguly99 walks in to bat replacing @CabCricket President Avishek Dalmia pic.twitter.com/TCsuRvnHoK — Yash Chawla (@chawla_yash) December 3, 2021 Jay Shah 11 vs Ganguly 11 match result: Who won the BCCI AGM Festival match? It was Jay Shah’s ‘Secretary XI’ who prevailed in the end by 1 run, in what was a cliffhanger of a match between the two sides. It was the leg-spin bowling of BCCI secretary Jay Shah who bowled a total of 7 Overs in the 15 Over game which proved instrumental in his team’s win. Giving away 58 runs in his 42 deliveries, Shah picked up three crucial wickets to win it for his side by the barest of margins. His wickets included that of Mohammad Azharuddin, one of Eden’s favourites, who was trapped lbw for 2. Shah also dismissed Suraj Lotlikar of Goa Cricket Association. Jaydev Shah got Secretary XI off to a flier Earlier, after winning the Toss, Jay Shah’s team opted to bat first. Secretary’s XI rode on a 92-run partnership between Arun Dhumal (36) and Jaydev Shah (40) to post 128/3 in 15 Overs. Jaydev Shah- president of the Saurashtra Cricket Association was the accelator-in-chief during the innings. Ganguly (3-0-19-1) and Mohammad Azharuddin (2-0-8-0) were the pick of the bowlers for the President’s XI side. During the chase, Ganguly’s side began well with 50 for no loss with Avishek Dalmiya (13) and Vijay Patil (21) playing handy knocks at the top. Later, Devajit Saikia and Ganguly stitched a partnership during the middle Overs as well. But, Jay Shah’s 3 wickets rampaged through their middle order. With Ganguly too having to retire as per the rule of the match, his side ended up on the losing side failing to score 14 runs off the last 2 Overs with 5 wickets still in hand. Sanjoy Verma (8*) and Riyaz Razak (5*) could manage only 13 runs in the final two Overs.         The post Jay Shah 11 vs Ganguly 11 match result: Who won President XI vs Secretary XI BCCI AGM Festival match? appeared first on The SportsRush.","pubDate":"2021-12-03 17:47:56","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Yorkshire cricket club cleans house amid racism probe","link":"https://www.thestar.com/sports/cricket/2021/12/03/yorkshire-cricket-club-cleans-house-amid-racism-probe.html","keywords":null,"creator":["The Associated Press"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-03 15:20:49","full_description":"LEEDS, England (AP) — The English cricket club at the center of a racism investigation announced the departure of its entire coaching staff and director of cricket on Friday. Martyn Moxon, Yorkshire’s director of cricket since 2007, and head coach Andrew Gale have left along with “all members of the coaching team,” the club said in a statement, which didn’t specify if they had been fired. Their departures follow the resignations of club chairman Roger Hutton, who stepped down on Nov. 5, and chief executive Mark Arthur, who resigned a week later following criticism of Yorkshire over its handling of a racism allegations made by former player Azeem Rafiq. “Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust,” said Kamlesh Patel, who had replaced Hutton as club chairman. “The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive.” Rafiq’s complaints eventually reached the British Parliament, which heard his testimony about the Islamophobia and bullying he suffered during his two spells playing for the club from 2008-18. Yorkshire — England’s most successful cricket club — came under fire after dismissing some of the abuse as “friendly banter” and leaving the club’s hierarchy intact. Moxon had been absent from work because of a stress-related illness since Nov. 9 when Gale was suspended pending a disciplinary hearing into a Twitter post sent in 2010. Moxon played for Yorkshire from 1980-97. Gale captained the team until the end of the 2016 season, when he retired and became coach. Rafiq, a former England under-19 captain, had testified that Yorkshire teammates used an offensive term referencing his Pakistani heritage and that the leadership at the 33-time winners of the English county championship failed to act. The club said in total there were 16 departures, including six members of the backroom medical team. “We want to make Yorkshire County Cricket Club a place for everyone, from all backgrounds,” Patel said. “To do this, we need to rebuild our culture and instill positive values in everyone associated with Yorkshire. We are determined to learn from the mistakes of the past to become a club which people can trust.” Last week, the England and Wales Cricket Board announced it will create an anti-discrimination unit and conduct a review of dressing-room culture as part of a comprehensive plan formed in response to recent revelations about racism in the sport. ___ More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports Anyone can read Conversations, but to contribute, you should be registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free) Sign In Register","image_url":null,"source_id":"thestar"},{"title":"Yorkshire exodus continues as Martyn Moxon and Andrew Gale become the latest high-profile departures in wake of Azeem Rafiq racism investigation","link":"https://talksport.com/sport/cricket/995239/yorkshire-exile-martyn-moxon-gale-rafiq-racism/","keywords":["Cricket","Sport","Yorkshire"],"creator":["Oliver Dawnay"],"video_url":null,"description":"Two more high-profile members of Yorkshire County Cricket Club have departed in the wake of the Azeem Rafiq racism investigation. Long-serving director of cricket Martyn Moxon and head coach Andrew Gale have left their posts On Friday, the YCCC announced a clear-out which includes the entire coaching team and made a pledge to appoint successors […]","content":"Two more high-profile members of Yorkshire County Cricket Club have departed in the wake of the Azeem Rafiq racism investigation. Long-serving director of cricket Martyn Moxon and head coach Andrew Gale have left their posts Moxon has left role as the director of cricket at YorkshireGETTY Gale has also left the club in the wake of the Rafiq racism scandalGETTY On Friday, the YCCC announced a clear-out which includes the entire coaching team and made a pledge to appoint successors ‘imminently’. Moxon had been signed off from work due to a stress-related illness since November 9, while Gale was suspended pending a disciplinary hearing into a historical social media post. Their departures follow those of club president Roger Hutton, who stepped down on November 5, and chief executive Mark Arthur, who resigned a week later following widespread condemnation of Yorkshire over its handling of a racism investigation and the treatment of former player Rafiq. Moxon, 61, was an opening batsman for Yorkshire from 1980-97 and returned to become director of cricket in 2007. Gale, 37, was also an opening batsman and captained the team until his retirement at the end of the 2016 season when he was appointed as coach. Rafiq had to fight back tears as he was giving evidence at the select committee last monthAFP Both were heavily criticised at the Department for Culture, Media and Sport hearing at Westminster while Rafiq repeated his call for Arthur and Moxon to step down from their roles at the club. “I don’t think Martyn and Andrew can (continue),” Rafiq said a month ago. “I don’t think it’s possible for Yorkshire to move forward with them in there, with them knowing full well what role they played in that institution.” Yorkshire say the total number of departures is 16, including six members of the backroom medical team provided by Pavilion Physiotherapy Clinic, and that an interim medical team is in the process of being appointed. Lord Patel, Yorkshire chair, said: “Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust. Former England captain Michael Vaughan denied the claims made against him by RafiqGetty - Contributor “The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive. “We want to make Yorkshire County Cricket Club a place for everyone, from all backgrounds. To do this, we need to rebuild our culture and instil positive values in everyone associated with Yorkshire. “We are determined to learn from the mistakes of the past to become a club which people can trust. “We are hoping to announce a new director of cricket in the coming days. We have a huge rebuilding job to do but we are confident that this heralds a step forward towards a brighter future.”","pubDate":"2021-12-03 14:59:26","full_description":"Two more high-profile members of Yorkshire County Cricket Club have departed in the wake of the Azeem Rafiq racism investigation. Long-serving director of cricket Martyn Moxon and head coach Andrew Gale have left their posts On Friday, the YCCC announced a clear-out which includes the entire coaching team and made a pledge to appoint successors ‘imminently’. Moxon had been signed off from work due to a stress-related illness since November 9, while Gale was suspended pending a disciplinary hearing into a historical social media post. Their departures follow those of club president Roger Hutton, who stepped down on November 5, and chief executive Mark Arthur, who resigned a week later following widespread condemnation of Yorkshire over its handling of a racism investigation and the treatment of former player Rafiq. Moxon, 61, was an opening batsman for Yorkshire from 1980-97 and returned to become director of cricket in 2007. Gale, 37, was also an opening batsman and captained the team until his retirement at the end of the 2016 season when he was appointed as coach. Both were heavily criticised at the Department for Culture, Media and Sport hearing at Westminster while Rafiq repeated his call for Arthur and Moxon to step down from their roles at the club. “I don’t think Martyn and Andrew can (continue),” Rafiq said a month ago. “I don’t think it’s possible for Yorkshire to move forward with them in there, with them knowing full well what role they played in that institution.” Yorkshire say the total number of departures is 16, including six members of the backroom medical team provided by Pavilion Physiotherapy Clinic, and that an interim medical team is in the process of being appointed. Lord Patel, Yorkshire chair, said: “Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust. “The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive. “We want to make Yorkshire County Cricket Club a place for everyone, from all backgrounds. To do this, we need to rebuild our culture and instil positive values in everyone associated with Yorkshire. “We are determined to learn from the mistakes of the past to become a club which people can trust. “We are hoping to announce a new director of cricket in the coming days. We have a huge rebuilding job to do but we are confident that this heralds a step forward towards a brighter future.”","image_url":null,"source_id":"talksport"},{"title":"Martyn Moxon, Andrew Gale removed as Yorkshire replace entire coaching staff - ESPNcricinfo.com","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvbWFydHluLW1veG9uLWFuZHJldy1nYWxlLXJlbW92ZWQtYXMteW9ya3NoaXJlLXJlcGxhY2UtZW50aXJlLWNvYWNoaW5nLXN0YWZmLTEyOTIxMjPSAYMBaHR0cHM6Ly93d3cuZXNwbmNyaWNpbmZvLmNvbS9zdG9yeS9tYXJ0eW4tbW94b24tYW5kcmV3LWdhbGUtcmVtb3ZlZC1hcy15b3Jrc2hpcmUtcmVwbGFjZS1lbnRpcmUtY29hY2hpbmctc3RhZmYtMTI5MjEyMz9wbGF0Zm9ybT1hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Martyn Moxon, Andrew Gale removed as Yorkshire replace entire coaching staff  ESPNcricinfo.comYorkshire Coaching Staff Leaves Club Amidst Azeem Rafiq's Racism Allegations  Republic WorldYorkshire County Cricket Club announce entire coaching team to leave in wake of Azeem Rafiq racism scandal  Sky NewsYorkshire clear-out begins as director of cricket Martyn Moxon and head coach Andrew Gale are axed  Daily MailChair wants Yorkshire to learn from mistakes as Moxon and Gale go  Bradford Telegraph and ArgusView Full coverage on Google News","content":null,"pubDate":"2021-12-03 14:35:00","image_url":null,"source_id":"google"},{"title":"Centurion Agarwal reveals Gavaskar tip to make adjustment","link":"https://sportstar.thehindu.com/cricket/centurion-agarwal-reveals-gavaskar-tip-to-make-adjustment/article37826017.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Agarwal who scored an unbeaten century at the Wankhede Stadium, had a chat with Sunil Gavaskar recently, when the Indian cricket legend gave him a couple of tips, which eventually helped him.","content":null,"pubDate":"2021-12-03 14:13:44","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Australia vs England: When is the first Ashes test? UK date and start time, the confirmed squads and what Joe Root has had to say ahead of opener at The Gabba","link":"https://talksport.com/sport/cricket/995130/australia-vs-england-first-ashes-test-uk-date-start-time/","keywords":["Cricket","Australia Cricket","England Cricket","The Ashes"],"creator":["Phil Spencer"],"video_url":null,"description":"It’s felt like a long wait but the 2021-22 Ashes Test series is just around the corner. England’s trip to Australia was only confirmed in October due to safety concerns around the COVID-19 pandemic but the illustrious series will now go ahead. It’s on Joe Root’s side to come away with the prize with Australia […]","content":"It’s felt like a long wait but the 2021-22 Ashes Test series is just around the corner. England’s trip to Australia was only confirmed in October due to safety concerns around the COVID-19 pandemic but the illustrious series will now go ahead. The Ashes is set to take place in December and January It’s on Joe Root’s side to come away with the prize with Australia currently holding the urn after retaining the Ashes back in 2019 with a 2-2 draw in England. This time, however, Root’s side will be determined to come out on top. Australia vs England: Date and time The first Test of the Ashes between Australia and England will get underway on Wednesday, December 8 in Brisbane, Australia and run until Sunday, December 12. The opening ball is scheduled to go down at 12am UK time. The event will then head to Adelaide, Melbourne Sydney and finally Perth where the Fifth and final Test will take place between Friday, January 14 and Tuesday, January 18 with play in the final test starting at 2.30am UK time. Here’s the Ashes schedule in full. First Test: 8-12 December – Gabba, Brisbane, play starts 12amSecond Test: 16-20 December – Adelaide Oval, Adelaide, play starts 4amThird Test: 26-30 December – MCG, Melbourne, play starts 11.30pm on 25 DecemberFourth Test: 5-9 January – SCG, Sydney, play starts 11.30pm on 4 JanuaryFifth Test: 14-18 January – Optus Stadium, Perth, play starts 2.30am Joe Root has selected his squad for the upcoming AshesGetty Australia vs England: How to follow BT Sport will be broadcasting The Ashes in full in the United Kingdom after renewing their deal with Cricket Australia. Subscribers will be able to follow all the action on TV, the BT Sport app and online, with full broadcast information to be announced soon. talkSPORT will also keep you updated with all the main talking points throughout December and January. To tune in to talkSPORT or talkSPORT 2, click  HERE for the live stream. App iPhone – Download from the Apple storeAndroid – Download from Google PlayRadio – talkSPORT is available across the United Kingdom via DAB digital radio and on 1089 or 1053 AMTV – Listen to talkSPORT through your TV on the following channels: Sky: Channel 0108 Virgin Media: Channel 927 Freeview: Channel 723 Freesat: Channel 731 Australia vs England: The squads Australia: Pat Cummins (c), Steve Smith (vc), Alex Carey (wk), Cameron Green, Josh Hazlewood, Marcus Harris, Travis Head, Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Michael Neser, Jhye Richardson, Mitchell Starc, Mitchell Swepson, David Warner. England: Joe Root (c), Jos Buttler (vc, wk), James Anderson, Jonny Bairstow, Dom Bess, Stuart Broad, Rory Burns, Zak Crawley, Haseeb Hameed, Dan Lawrence, Jack Leach, Dawid Malan, Craig Overton, Ollie Pope, Ollie Robinson, Ben Stokes, Chris Woakes, Mark Wood. Jos Buttler will be hoping for a big competitionGetty Images - Getty Australia vs England: What has been said? Pat Cummins: “I am honoured to accept this role ahead of what will be a massive Ashes summer. I hope I can provide the same leadership Tim (Paine) has given the group in the past few years. “With Steve and I as captains, a number of very senior players in this squad and some great young talent coming through we are a strong and tightly-knit group. “This is an unexpected privilege which I am very grateful for and am very much looking forward to.” Joe Root: “It’s really important that we have a clear understanding of how they will try to attack us, and counter it. “Not be scared of it or take a backward step, but be brave in our own way. Don’t try to be Australia in Australia, but the best version of ourselves in those conditions. “If we do that, we’ll be absolutely fine. “We’re not going there to be part of a tour, we’re going there to win. That has to be the mentality.”","pubDate":"2021-12-03 14:10:15","full_description":"It’s felt like a long wait but the 2021-22 Ashes Test series is just around the corner. England’s trip to Australia was only confirmed in October due to safety concerns around the COVID-19 pandemic but the illustrious series will now go ahead. It’s on Joe Root’s side to come away with the prize with Australia currently holding the urn after retaining the Ashes back in 2019 with a 2-2 draw in England. This time, however, Root’s side will be determined to come out on top. The first Test of the Ashes between Australia and England will get underway on Wednesday, December 8 in Brisbane, Australia and run until Sunday, December 12. The opening ball is scheduled to go down at 12am UK time. The event will then head to Adelaide, Melbourne Sydney and finally Perth where the Fifth and final Test will take place between Friday, January 14 and Tuesday, January 18 with play in the final test starting at 2.30am UK time. Here’s the Ashes schedule in full. BT Sport will be broadcasting The Ashes in full in the United Kingdom after renewing their deal with Cricket Australia. Subscribers will be able to follow all the action on TV, the BT Sport app and online, with full broadcast information to be announced soon. talkSPORT will also keep you updated with all the main talking points throughout December and January. To tune in to talkSPORT or talkSPORT 2, click HERE for the live stream. Australia : Pat Cummins (c), Steve Smith (vc), Alex Carey (wk), Cameron Green, Josh Hazlewood, Marcus Harris, Travis Head, Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Michael Neser, Jhye Richardson, Mitchell Starc, Mitchell Swepson, David Warner. England: Joe Root (c), Jos Buttler (vc, wk), James Anderson, Jonny Bairstow, Dom Bess, Stuart Broad, Rory Burns, Zak Crawley, Haseeb Hameed, Dan Lawrence, Jack Leach, Dawid Malan, Craig Overton, Ollie Pope, Ollie Robinson, Ben Stokes, Chris Woakes, Mark Wood. Pat Cummins : “I am honoured to accept this role ahead of what will be a massive Ashes summer. I hope I can provide the same leadership Tim (Paine) has given the group in the past few years. “With Steve and I as captains, a number of very senior players in this squad and some great young talent coming through we are a strong and tightly-knit group. “This is an unexpected privilege which I am very grateful for and am very much looking forward to.” Joe Root: “It’s really important that we have a clear understanding of how they will try to attack us, and counter it. “Not be scared of it or take a backward step, but be brave in our own way. Don’t try to be Australia in Australia, but the best version of ourselves in those conditions. “If we do that, we’ll be absolutely fine. “We’re not going there to be part of a tour, we’re going there to win. That has to be the mentality.”","image_url":null,"source_id":"talksport"},{"title":"Yorkshire County Cricket Club: Amid racism scandal fallout, first-team coach and director of cricket among staff to leave","link":"https://www.cnn.com/2021/12/03/sport/andrew-gale-martyn-moxon-yorkshire-cricket-spt-intl/index.html","keywords":null,"creator":null,"video_url":null,"description":"First-team coach Andrew Gale, Director of Cricket Martyn Moxon and all members of Yorkshire County Cricket Club's (YCCC) coaching staff have left, the team announced in a statement on Friday, amid an ongoing racism scandal's fallout.","content":null,"pubDate":"2021-12-03 13:59:36","full_description":"JUST WATCHED Azeem Rafiq: 'The ECB showed ... they just don't get it' Replay More Videos ... MUST WATCH (16 Videos) Azeem Rafiq: 'The ECB showed ... they just don't get it' Monty Panesar on the Azeem Rafiq testimony to UK lawmakers Romelu Lukaku: Football superstar calls for social media CEOs and footballers to meet Muhammad Ali: New documentary shows how legend stayed true to himself in 'hero' journey Gwen Berry: 'I never said that I hated the country,' says US hammer thrower Romelu Lukaku: Racism in football is at an all-time high Why England players taking the knee is proving so divisive Exclusive: Thierry Henry on football's social media boycott Ex-Premier League star: Social media companies are doing 'bare minimum' to protect players John Carlos on IOC ban on protests at Tokyo 2020 The Aboriginal First XI: Australia's first international cricket team Thierry Henry tells CNN why he quit social media: 'It's not a safe place' Jeremy Lin on the rise of anti-Asian violence: 'This has been...boiling up a little bit for me' Thierry Henry on taking the knee in sport Racist social media abuse continues to plague UK football Social media is 'never going to change,' says England coach Eddie Jones (CNN) First-team coach Andrew Gale, Director of Cricket Martyn Moxon and all members of Yorkshire County Cricket Club's (YCCC) coaching staff have left, the team announced in a statement on Friday, amid an ongoing racism scandal's fallout. Last month former cricketer Azeem Rafiq spoke to UK lawmakers about his calls for disciplinary action to be taken by YCCC following an investigation that found he had been subjected to racial harassment and bullying. Throughout the hearing, Rafiq shared his experience at Yorkshire and broke down in tears on more than one occasion. \"From early on there was a lot of \"You lot sit over there near the toilets,\" the word 'P***' was used constantly, no one ever stamped it out,\" said Rafiq. \"All I wanted to do was play cricket. Towards the end of my first spell but constantly throughout I knew there was something wrong. I started taking medication for my mental health. It was really tough.\" Read More Asked to compare his treatment at Yorkshire to his everyday life, Rafiq said: \"My every day life for as long as I've known has been cricket. It's difficult to compare. Cricket is worse than society.\" The club suspended Gale last month \"pending a disciplinary hearing following a historical tweet,\" whilst Moxon has been absent from work since early November \"due to a stress-related illness.\" \"Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust,\" said Kamlesh Patel, the new chair and director of Yorkshire. \"The decisions announced today were difficult to make, but are in the best interests of the Club. Andrew Gale looks on during the Royal London One Day Cup match between Lancashire and Yorkshire at Old Trafford on June 5, 2018. \"Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive. Visit CNN.com/sport for more news, features, and videos \"We are determined to learn from the mistakes of the past to become a Club which people can trust,\" added Patel. The club said a new director of cricket would be appointed in the coming days, alongside a new coaching team which is being recruited. \"We welcome the announcement by Yorkshire County Cricket Club on the departure of its entire coaching staff,\" said Digital, Culture, Media and Sport Committee Chair Julian Knight. \"The experience of Azeem Rafiq at YCCC demanded no less,\" added Knight.","image_url":"https://cdn.cnn.com/cnnnext/dam/assets/211203081555-andrew-gale-yorkshire-cricket-file-super-169.jpg","source_id":"cnn"},{"title":"Entire Yorkshire Coaching Staff Leave Club After Racism Scandal","link":"https://sports.ndtv.com/cricket/entire-yorkshire-coaching-staff-leave-club-after-racism-scandal-2636117","keywords":null,"creator":null,"video_url":null,"description":"\"We can confirm that Martyn Moxon, director of cricket, and Andrew Gale, first XI coach, have left the club today in addition to all members of the coaching team,\" a Yorkshire statement said.","content":null,"pubDate":"2021-12-03 13:53:38","full_description":"Yorkshire's director of cricket Martyn Moxon and head coach Andrew Gale have left the troubled county side along with the entire coaching staff as the fallout from the Azeem Rafiq racism scandal rages on. Moxon had been signed off from work due to a stress-related illness while Gale had been suspended pending a disciplinary hearing since November 9. \"We can confirm that Martyn Moxon, director of cricket, and Andrew Gale, first XI coach, have left the club today in addition to all members of the coaching team,\" a Yorkshire statement said. \"A new director of cricket will be appointed imminently, alongside a new coaching team which is being recruited.\" The club said the total number of departures was 16, including six members of the backroom medical team provided by Pavilion Physiotherapy Clinic. \"Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust,\" said new chairman Kamlesh Patel. Promoted \"The decisions announced today were difficult to make but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2021-09/u79jobg8_yorkshire-county-cricket-club-instagram_625x300_10_September_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"IND v NZ, 2nd Test: Virat Kohli's controversial dismissal sparks debate","link":"https://www.business-standard.com/article/sports/ind-v-nz-2nd-test-virat-kohli-s-controversial-dismissal-sparks-debate-121120301091_1.html","keywords":null,"creator":null,"video_url":null,"description":"India captain Virat Kohli's return to Test cricket wasn't a happy one as he got out for a four-ball duck in the ongoing second Test against New Zealand at the Wankhede Stadium in Mumbai on Friday","content":null,"pubDate":"2021-12-03 13:43:00","full_description":"India captain Virat Kohli's return to Test cricket wasn't a happy one as he got out for a four-ball duck in the ongoing second Test against New Zealand at the Wankhede Stadium in Mumbai on Friday. Kohli failed to open his account and was adjudged lbw while pressing forward to push off left-arm spinner Ajaz Patel's bowling in the 30th over. The Indian skipper decided to take the Decision Review System (DRS) but the third umpire Virender Sharma found no conclusive evidence to overturn the on-field decision with the ball hitting the bat and pad at the same time. Sharma saw the replays from various angles before moving towards the ball-tracking, which showed three reds. After Sharma asked on-field umpire Anil Chaudhary to stick to the original decision, Kohli had a word with umpire Nitin Menon before walking back to the dressing room in disbelief. Kohli was also seen slamming the advertising hoard on the boundary rope with his bat angrily as Patel completed a double-wicket maiden in the over, dismissing both Kohli and Cheteshwar Pujara for ducks. After returning to the dressing room, the camera panned towards a shell-shocked Kohli, who reacted animatedly while watching the replay of his dismissal on the TV screen. He brought out an amused reaction and was seen discussing the same with head coach Rahul Dravid before finally heading inside the room. Kohli's dismissal has sparked a debate on social media on how he was given out on inconclusive evidence. WATCH - Was Virat Kohli OUT or NOT OUT ? You decide. Full video https://t.co/ZhDsQdLdZZ #INDvNZ @Paytm pic.twitter.com/2opNPCVoqU — BCCI (@BCCI) December 3, 2021 India and Tamil Nadu opener Abhinav Mukund wrote, \"Bat first-surely!!! #IndvsNZtest.\" Former India cricketer Wasim Jaffer tweeted that he felt the ball hit the bat first. \"That was bat first in my opinion. And I understand the 'conclusive evidence' part. But I think this was an instance where common sense should have prevailed. But as they say common sense is not so common. Feel for Virat Kohli. #Unlucky #INDvNZ.\" Former India opener Aakash Chopra commented, \"Inconclusive evidence shouldn't mask the quality of the decision or the lack of it. #IndvNZ.\" \"You lose the batter. And also, the review. Double whammy,\" Chopra wrote in another tweet. Former India wicketkeeper-batter Parthiv Patel wrote, \"#Kohli decision was definitely not out. Yes, NZ has made a terrific comeback in this session but they also benefited from 'VIRAT'LBW verdict. #INDvsNZTestSeries #NZvInd.\" Former India pacer RP Singh tweeted, \"Yes, bad decision is part of the game but this one against #Kohli is a Virat blow for Team India.\" Former England cricketer Rob Key tweeted, \"What on earth has just happened with the kohli dismissal. Surely that was an obvious edge onto pad (six shrugging emojis).\" Kohli had returned to lead India in the second Test with fast bowler Mohammed Siraj and spin-bowling all-rounder Jayant Yadav the other forced changes for an injured trio of Ajinkya Rahane, Ishant Sharma and Ravindra Jadeja. --IANS nr/akm (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211203/thumb-121120301091.jpg","source_id":"business-standard"},{"title":"Martyn Moxon, Andrew Gale among 16-strong exodus at Yorkshire","link":"https://www.sportsmole.co.uk/cricket/yorkshire/news/moxon-gale-among-16-strong-exodus-at-yorkshire_471839.html","keywords":["Cricket","Yorkshire","Martyn Moxon","Andrew Gale","Azeem Rafiq","471839"],"creator":null,"video_url":null,"description":"Yorkshire announces that director of cricket Martyn Moxon and head coach Andrew Gale are among 16 people who have left the club amid the racism scandal at Headingley.","content":null,"pubDate":"2021-12-03 13:18:52","full_description":"After former player Azeem Rafiq spoke out about his time at Headingley, a report found that \"racial harassment and bullying\" had occurred at the club. Moxon, who has been on leave due to a stress-related illness, and Gale faced heavy criticism from Rafiq, while the latter had also been suspended as a result of an historical tweet being investigated. However, Yorkshire has now revealed that a total of 16 people have departed the club, a decision made to bring about \"significant change\". New chairman Lord Patel said in an official statement : \"Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust. \"The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive.\" The remainder of the coaching staff are also among the people who have been removed from their positions.","image_url":"https://sm.imgix.net/21/48/yorkshire-cricket-club.JPG","source_id":"sportsmole"},{"title":"IND vs NZ: Virat Kohli returns to dressing room angrily after given out in second Test - WATCH","link":"https://zeenews.india.com/cricket/ind-vs-nz-virat-kohli-returns-to-dressing-room-angrily-after-given-out-in-second-test-watch-2415925.html","keywords":null,"creator":null,"video_url":null,"description":"India captain Virat Kohli`s return to Test cricket wasn`t a happy one as he got out for a four-ball duck in the ongoing second Test against New Zealand at the Wankhede Stadium in Mumbai on Friday.","content":null,"pubDate":"2021-12-03 13:18:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Yorkshire announce entire coaching staff to leave amid Azeem Rafiq racism scandal","link":"https://www.express.co.uk/sport/cricket/1530925/Yorkshire-coaching-staff-leave-racism-scandal-cricket-news","keywords":null,"creator":null,"video_url":null,"description":"Yorkshire have let go of their head coach Andrew Gale and Director of Cricket Martyn Moxon, as well as their full first team coaching quota.","content":null,"pubDate":"2021-12-03 13:09:00","full_description":null,"image_url":null,"source_id":"express"},{"title":"Cricket-Yorkshire say all members of coaching team have left the club","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-yorkshire-say-all-members-of-coaching-team-have-left-the-club","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - All members of Yorkshire's coaching team have left, including director of cricket Martyn Moxon and coach Andrew Gale, the club said on Friday as it vowed to regain trust and rebuild after being rocked by allegations of institutional racism. Read full story","content":null,"pubDate":"2021-12-03 13:01:00","full_description":"LONDON (Reuters) - All members of Yorkshire's coaching team have left, including director of cricket Martyn Moxon and coach Andrew Gale, the club said on Friday as it vowed to regain trust and rebuild after being rocked by allegations of institutional racism. First team coach and former captain Gale was suspended last month as part of a probe into an alleged anti-Semitic tweet he sent in 2010 while Moxon had been absent from work due to a \"stress-related illness\". The departures follow allegations made by former player Azeem Rafiq, who is of Pakistani descent and is a former captain of the England Under-19s. Rafiq said he had received racist abuse and was made to feel like an outsider at Yorkshire and that he had even contemplated suicide. The scandal has shaken English sport, cost Yorkshire sponsors and the right to host England internationals, and embroiled some of the biggest names in English cricket. Yorkshire, whose chief executive Mark Arthur resigned last month, said in a statement a new director of cricket will be appointed imminently and a new coaching team was being recruited. The backroom medical team, provided by an outside clinic, had also left. \"Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust,\" said new chairman Kamlesh Patel. \"The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive.\" Patel said the club had a \"huge rebuilding job to do\" and was determined to learn from the mistakes made. \"We want to make Yorkshire County Cricket Club a place for everyone, from all backgrounds. To do this, we need to rebuild our culture and instil positive values in everyone associated with Yorkshire,\" he added. (Reporting by Alan Baldwin, Editing by Rohith Nair)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1391891.jpg","source_id":"thestar_my"},{"title":"Yorkshire ditch coaches after racism probe","link":"https://www.perthnow.com.au/sport/cricket/yorkshire-ditch-coaches-after-racism-probe-c-4808769","keywords":null,"creator":["Ian Laybourn"],"video_url":null,"description":"Director of cricket Martyn Moxon, as well as Andrew Gale and the entire coaching team, have left Yorkshire in the wake of the Azeem Rafiq racism investigation.","content":null,"pubDate":"2021-12-03 12:58:37","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4808769/9da6ce17a06c1ca3bde23913ec8c4c193705e811-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Yorkshire ditch coaches after racism probe","link":"https://thewest.com.au/sport/cricket/yorkshire-ditch-coaches-after-racism-probe-c-4808760","keywords":null,"creator":["Ian Laybourn"],"video_url":null,"description":"Director of cricket Martyn Moxon, as well as Andrew Gale and the entire coaching team, have left Yorkshire in the wake of the Azeem Rafiq racism investigation.","content":null,"pubDate":"2021-12-03 12:57:54","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4808760/9da6ce17a06c1ca3bde23913ec8c4c193705e811-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Azeem Rafiq racism: Andrew Gale and Martyn Moxon among 16 cricket staff sacked by Yorkshire - The Times","link":"https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL3d3dy50aGV0aW1lcy5jby51ay9hcnRpY2xlL2F6ZWVtLXJhZmlxLXJhY2lzbS1hbmRyZXctZ2FsZS1hbmQtbWFydHluLW1veG9uLWFtb25nLTE2LWNyaWNrZXQtc3RhZmYtc2Fja2VkLWJ5LXlvcmtzaGlyZS16djdsNzZkdGTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Azeem Rafiq racism: Andrew Gale and Martyn Moxon among 16 cricket staff sacked by Yorkshire  The TimesYorkshire Coaching Staff Leaves Club Amidst Azeem Rafiq's Racism Allegations  Republic WorldYorkshire part company with entire coaching staff in wake of racism scandal  The GuardianYorkshire clear-out begins as director of cricket Martyn Moxon and head coach Andrew Gale are axed  Daily MailChair wants Yorkshire to learn from mistakes as Moxon and Gale go  Bradford Telegraph and ArgusView Full coverage on Google News","content":null,"pubDate":"2021-12-03 12:45:00","image_url":null,"source_id":"google"},{"title":"Williamson, Rahane, Ishant, Jadeja join injury list ahead of Mumbai Test - ESPNcricinfo.com","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2luZGlhLXZzLW56LTJuZC10ZXN0LWFqaW5reWEtcmFoYW5lLWthbmUtd2lsbGlhbXNvbi1pc2hhbnQtc2hhcm1hLXJhdmluZHJhLWphZGVqYS1vdXQtb2YtbXVtYmFpLXRlc3QtMTI5MjA2MtIBnAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2luZGlhLXZzLW56LTJuZC10ZXN0LWFqaW5reWEtcmFoYW5lLWthbmUtd2lsbGlhbXNvbi1pc2hhbnQtc2hhcm1hLXJhdmluZHJhLWphZGVqYS1vdXQtb2YtbXVtYmFpLXRlc3QtMTI5MjA2Mj9wbGF0Zm9ybT1hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Williamson, Rahane, Ishant, Jadeja join injury list ahead of Mumbai Test  ESPNcricinfo.comIND vs NZ 2021: Ishant Sharma, Ajinkya Rahane and Ravindra Jadeja Ruled Out Of 2nd Test In Mumbai  Cricket Addictor'The Conditions Won't be 100%': Umpires Give Major Update on Start of Play at Wankhede Stadium  News18Match Preview - India vs New Zealand, New Zealand in India 2021/22, 2nd Test  ESPNcricinfoRahane, Ishant get honourable 'injury' exit route from team management for 2nd Test  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-03 12:38:00","image_url":null,"source_id":"google"},{"title":"Cricket-England&#039;s Broad relishing Gabba experience ahead of Ashes opener","link":"https://www.thestar.com.my/sport/cricket/2021/12/03/cricket-england039s-broad-relishing-gabba-experience-ahead-of-ashes-opener","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England fast bowler Stuart Broad said he is \"buzzing\" to play at the Gabba in the first test of the Ashes series against Australia and is looking forward to the challenge of competing in front of a partisan crowd. Read full story","content":null,"pubDate":"2021-12-03 12:25:00","full_description":"(Reuters) - England fast bowler Stuart Broad said he is \"buzzing\" to play at the Gabba in the first test of the Ashes series against Australia and is looking forward to the challenge of competing in front of a partisan crowd. The Gabba, which hosts the first of five tests between the teams starting Dec. 8, has long been a fortress for Australia with England winning only four times in 21 matches at the venue. The last of those victories came in 1986. \"It's what you train for, it's what you live for. Playing at the Gabba is one of the best cricketing experiences that you can have. It has that same feeling as (playing at) The Wanderers in South Africa,\" Broad told reporters on Friday. \"It's very pro-Australian. It'll be even more so without the Barmy Army (England fans) but you have to enjoy that experience. If you're not walking onto that field buzzing and excited, looking up at the stands... you're playing the wrong game.\" England's preparations for the first test were hampered by COVID-19 quarantine and poor weather, but Broad said he chose to view it as a positive, adding the tourists would head into the series with fresh minds. \"I've been on Ashes tours where we have been extremely well prepared, played three or four first-class games, and we've come out on the losing side,\" the 35-year-old said. \"Arguably, we're going to be the freshest England team going into an Ashes series. We should have a lot of energy and a lot of buzz throughout the next few months.\" Australia retained the Ashes in 2019 after drawing the series 2-2 in England. (Reporting by Aadi Nair in Bengaluru; Editing by Rohith Nair)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/03/1391870.jpg","source_id":"thestar_my"},{"title":"Yorkshire's entire coaching staff leave club after racism scandal","link":"https://timesofindia.indiatimes.com/sports/cricket/news/yorkshires-entire-coaching-staff-leave-club-after-racism-scandal/articleshow/88074439.cms","keywords":null,"creator":null,"video_url":null,"description":"Yorkshire's director of cricket Martyn Moxon and head coach Andrew Gale have left the troubled county side along with the entire coaching staff as the fallout from the Azeem Rafiq racism scandal rages on.","content":null,"pubDate":"2021-12-03 12:16:39","full_description":null,"image_url":null,"source_id":"toi"},{"title":"Yorkshire part company with entire coaching staff in wake of racism scandal","link":"https://www.theguardian.com/sport/2021/dec/03/yorkshire-part-company-with-entire-coaching-staff-in-wake-of-racism-scandal-cricket","keywords":["Yorkshire","Cricket","Sport"],"creator":["PA Media"],"video_url":null,"description":"Director of cricket Martyn Moxon exits clubMove result of fall-out in Rafiq racism investigationLong-serving director of cricket Martyn Moxon and head coach Andrew Gale have left Yorkshire, along with the entire coaching team, the club have announced.Moxon had been signed off from work due to a stress-related illness while Gale had been suspended pending a disciplinary hearing since 9 November as the fall-out continues in the wake of the Azeem Rafiq racism investigation. Continue reading...","content":null,"pubDate":"2021-12-03 12:03:48","full_description":"Martyn Moxon, Yorkshire’s long-serving director of cricket, and the head coach, Andrew Gale, have left the club, along with the entire coaching team, it has been announced. Moxon had been signed off from work due to a stress-related illness while Gale had been suspended pending a disciplinary hearing since 9 November as the fallout continues in the wake of the Azeem Rafiq racism investigation. A statement from Yorkshire read : “We can confirm that Martyn Moxon, Director of Cricket, and Andrew Gale, First XI Coach, have left the Club today (3 December), in addition to all members of the coaching team. “A new Director of Cricket will be appointed imminently, alongside a new coaching team which is being recruited. The backroom medical team, external services provided by Pavilion Physiotherapy Clinic, has also left the Club. An interim medical team is also in the process of being appointed.” Yorkshire say the total number of departures is 16, including six members of the backroom medical team provided by Pavilion physiotherapy clinic, and that an interim medical team is in the process of being appointed. Lord Patel, Yorkshire’s chair, said: “Significant change is required at Yorkshire County Cricket Club and we are committed to taking whatever action is necessary to regain trust. “The decisions announced today were difficult to make, but are in the best interests of the club. Without making important changes to how we are run, we cannot move on from the past to become a culture which is progressive and inclusive.”","image_url":"https://i.guim.co.uk/img/media/42fb9c6b94138f6d39cf8242e798f8efec4078b0/23_140_3462_2078/master/3462.jpg?width=460&quality=85&auto=format&fit=max&s=4c6cdc3f648c69b681f6504a38bbe074","source_id":"theguardian"}]}