{"newsArray":[{"title":"‘More divided than ever’: England cricket chaos as shock resignation leaves ‘load of s**t’ on game’s door","link":"https://www.foxsports.com.au/cricket/cricket-news-2022-england-tom-harrison-quits-as-ecb-chief-the-hundred-county-championship/news-story/8da42114350f4068114420e0e481c4d7","keywords":null,"creator":null,"video_url":null,"description":"The England and Wales Cricket Board has been plunged into fresh turmoil with the sudden stepping down of chief executive Tom Harrison as part of a major overhaul following a slump in Test results.","content":"The England and Wales Cricket Board has been plunged into fresh turmoil with the sudden stepping down of chief executive Tom Harrison as part of a major overhaul following a slump in Test results. Since the turn of the year, managing director of men’s cricket Ashley Giles, head coach Chris Silverwood and Test captain Joe Root have all been replaced, with the ECB chairmanship currently vacant as well. Clare Connor, currently managing director of England women’s cricket, will take over on an interim basis, the ECB announced on Tuesday. Watch The 2022 Indian Premier League on Kayo. Every Match Live & On-Demand. New to Kayo? Try 14-Days Free Now > Harrison’s stepping down came on the eve of the ECB’s AGM at Lord’s. Connor is now left to put out a number of fires with the latest unrest at the ECB heightening anger among counties, who feel there is a governing crisis at the organisation. The counties are threatening to form their own breakaway, while their anger has seen the UK Government threaten the ECB with an independent regulator. “The counties are not happy. The inevitable conclusion is to say to the recreational game that the 18 counties are breaking away,” a senior county source told Telegraph Sport . “Nobody wants that. We should be able to govern our game but the current constitution makes it extremely hard to do that.” The counties are also reportedly concerned about the lack of cricket experience on the ECB board, which they lost two seats on in 2018 when a fully independent board of directors was introduced. Maher opens up on tragic loss of Roy | 01:23 It now features only one person — Lucy Pearson — to have played international cricket. A chief of a first-class county side told the publication: “English cricket is undoubtedly chaotic at the moment – and this will undoubtedly add to the chaos. “There’s a load of s**t any new person would have to deal with.” Harrison was a largely unpopular figure in the English game among purists, not least for neglecting the red ball game while senior executives enjoyed massive bonuses worth £2.1 million for the creation of The Hundred. In a comment piece for the UK Telegraph , Simon Heffer wrote: “There will be a palpable sense of relief among people who love cricket that Tom Harrison ... is leaving sooner than expected. “Harrison’s method of making the game ‘bigger’ was not to bother to attract more people to share in its traditional excellence and values, but to drag in drink-sodden young men to grounds in the early evening to watch The Hundred, the abortion of a version of cricket over whose birth he presided... “... he knocked several nails into the coffin of first-class and Test cricket, lost the confidence of several important county administrators and is in the process of helping inflict (with the active aid of many in the club’s leadership) a moral and strategic disaster on MCC, with which the ECB has grave and unfortunate conflicts of interest.” In a separate opinion piece for inews , Chris Stocks labelled Harrison’s reign as “disastrous”, and said “good riddance”. “There’s no doubt Harrison had the best of intentions for English cricket when he took over his role in 2014. Yet you cannot argue he has left it in a better place,” Stocks wrote. “His legacy will be a sport more divided than ever, with the Hundred, Harrison’s baby, causing the kind of toxic culture war in cricket that has infected so much of daily life in this country. “The Hundred, a competition that alienated existing fans and won’t make a profit for years, is English cricket’s Brexit.” Mott being eyed to become England coach | 00:43 Harrison, who took up his role in 2015, saw England win both the men’s and women’s 50-over World Cups during his tenure, but the nation dipped dramatically in the red ball game. Just last summer, England suffered a limp 4-0 defeat in the men’s Ashes, while the women were also whitewashed. The hammering dealt to the men was the final straw with a number of changes sweeping through the English set-up. Root resigned last month following England’s 1-0 defeat in the West Indies, which left them with a miserable record of just one win in 17 Tests, and has been replaced by all-rounder Ben Stokes. Former New Zealand captain Brendon McCullum was last week appointed as coach while former England batsman Rob Key is the new managing director. Harrison had also faced calls to quit over the ECB’s handling of a racism scandal that came to light last year. The 50-year-old said it had been a “huge honour” to serve as chief executive. “Cricket is an extraordinary force for good in the world and my goal has been to make the game bigger and ensure more people and more communities in England and Wales feel they have a place in this sport,” he said. “The long-term health of cricket depends on its ability to grow and remain relevant and be more inclusive in an ever-changing world.” Martin Darlow, interim chairman of the ECB, said: “When the (coronavirus) pandemic struck, it was Tom’s leadership that brought the game together and saved us from the worst financial crisis the sport has ever faced. “He has always put the interests of the game first and worked to lead important change to make our game more accessible and inclusive, though we all know there is still much more work to do”","pubDate":"2022-05-17 23:19:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers keep IPL Finals hopes alive with win over Mumbai","link":"https://www.cairnspost.com.au/sport/cricket/sunrisers-keep-ipl-finals-hopes-alive-with-win-over-mumbai/video/f935caae8500d8d2e26b8b19c35110eb","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Sunrisers have kept their hopes of an IPL finals berth alive after pulling off a three run win over the Mumbai Indians.","content":null,"pubDate":"2022-05-17 23:00:16","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Andrew Symonds dead: Cricket star split from wife, visited pub before death | news.com.au — Australia's leading news site - news.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2luc2lkZS1hbmRyZXctc3ltb25kcy1maW5hbC1ob3Vycy1iZWZvcmUtZGVhZGx5LWNhci1hY2NpZGVudC9uZXdzLXN0b3J5L2ZkMGJjMmQyYTFjZjRhMzIwNDY4NjBmYjFlNzZkNWEx0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Andrew Symonds dead: Cricket star split from wife, visited pub before death | news.com.au — Australia's leading news site  news.com.auJump in death toll on Queensland roads prompts calls for rethink on government's approach to safety  ABC NewsInside Andrew Symonds' final hours alive, Townsville, Queensland  Daily MailSymonds learnt Warne secret before death  news.com.auView Full coverage on Google News","content":null,"pubDate":"2022-05-17 21:45:42","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Tim David IPL auction price 2022: Tim David national team which country player","link":"https://thesportsrush.com/cricket-news-tim-david-ipl-auction-price-2022-tim-david-national-team-which-country-player/","keywords":["Cricket","IPL 2022","Mumbai Indians","Sunrisers Hyderabad","Indian Premier League","MI","SRH","Tim David"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Tim David IPL auction price: The batter from Mumbai Indians played his career-best Indian Premier League knock tonight. During the 65th match of the ongoing 15th season of the Indian Premier League between Mumbai Indians and Sunrisers Hyderabad at the Wankhede Stadium, Mumbai Indians lost their 10th match of the season despite batter Tim David’s… The post Tim David IPL auction price 2022: Tim David national team which country player appeared first on The SportsRush.","content":"Tim David IPL auction price: The batter from Mumbai Indians played his career-best Indian Premier League knock tonight. During the 65th match of the ongoing 15th season of the Indian Premier League between Mumbai Indians and Sunrisers Hyderabad at the Wankhede Stadium, Mumbai Indians lost their 10th match of the season despite batter Tim David’s career-best innings. Chasing a 194-run target, a 95-run opening partnership between captain Rohit Sharma (48) and wicket-keeper batter Ishan Kishan (43) was an apt foundation laid by their openers. However, them losing four wickets in five overs harmed their progress. Coming in to bat at No. 5 in the 15th over, needing 71 runs from 35 balls was a tailor-made situation for David to excel in. While the 26-year old player did excel on a personal level, he failed to convert an individual performance into a victory for his team. Needing 45 runs in the last three overs, David hit as many as four sixes off Sunrisers Hyderabad fast bowler T. Natarajan to turn the tables. David, who scored 46 (18) with the help of three fours and four sixes at a strike rate of 255.55, was run-out in the same over to hand an advantage to the opposition. MI, who needed 19 runs in two overs, lost by three runs after Bhuvneshwar Kumar bowled an outstanding wicket-maiden in the 19th over. Born in Singapore and having represented them in 14 T20Is since 2019, David is eligible to play for Australia as well. A primary reason why David had to play international cricket for the country of his birth was lack of opportunities at Perth Scorchers a few years ago. David, who had left Singapore to live in Australia in his childhood itself, might well be playing international cricket for them in the near future. Considering the manner in which David has been dominating the T20 circuit lately, it wouldn’t be wrong to say that a national Australian call-up is round the corner for this hard-hitting right-hand batter. There was never any doubt about Tim David’s abilities. He made his way into the IPL after proving himself in other major leagues. But why did the RCB and MI setups initially think that he isn’t good enough? Really interested to know. #MIvSRH — Prasenjit Dey (@CricPrasen) May 17, 2022 In what is his second IPL season, David was bought by Mumbai for a whopping INR 8.25 crore. Having registered himself in the price category of INR 40 lakh, David had invited interest from Delhi Capitals, Kolkata Knight Riders, Punjab Kings, Lucknow Super Giants and Rajasthan Royals before Indians made the successful bid during IPL 2022 mega auction earlier this year.","pubDate":"2022-05-17 18:48:37","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: SRH Keep Slim Playoff Hopes Alive With 3-Run Win vs MI - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiaGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLXNyaC1rZWVwLXNsaW0tcGxheW9mZi1ob3Blcy1hbGl2ZS13aXRoLTMtcnVuLXdpbi12cy1taS0yOTg1MzA10gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: SRH Keep Slim Playoff Hopes Alive With 3-Run Win vs MI  NDTV SportsMI vs SRH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor'Ponting was captaining but realised his batting let the team down'  Hindustan TimesLive Cricket Score - MI vs SRH, Match 65, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzJasprit Bumrah becomes first Indian pacer to take 250 T20 wickets  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-05-17 18:22:28","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"MI vs SRH, IPL 2022 Highlights: Umran Malik, Rahul Tripathi Star as Sunrisers Hyderabad Beat Mumbai Indians by 3 Runs - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiwgFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbWktdnMtc3JoLWxpdmUtY3JpY2tldC1zY29yZS1pcGwtMjAyMi1sYXRlc3QtdXBkYXRlcy1tdW1iYWktaW5kaWFucy1zdW5yaXNlcnMtaHlkZXJhYmFkLXN0cmVhbWluZy1jb21tZW50YXJ5LW1hdGNoLTY1LXRvZGF5LXdhbmtoZWRlLWxpdmVuZXdzLTUxOTIwOTUuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"MI vs SRH, IPL 2022 Highlights: Umran Malik, Rahul Tripathi Star as Sunrisers Hyderabad Beat Mumbai Indians by 3 Runs  News18Live Cricket Score - MI vs SRH, Match 65, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzMI vs SRH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor'Ponting was captaining but realised his batting let the team down'  Hindustan Times`Focus on batting`: Harbhajan Singh urges Kane Williamson to step down as SRH captain amid team`s poor run  WIONView Full coverage on Google News","content":null,"pubDate":"2022-05-17 17:58:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch Jasprit Bumrah's yorker demolish Washington Sundar's stumps during MI vs SRH","link":"https://www.dnaindia.com/cricket/report-ipl-2022-watch-jasprit-bumrah-s-yorker-demolish-washington-sundar-s-stumps-during-mi-vs-srh-2953786","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Jasprit Bumrah's wicket saw him reach the 250-wicket milestone in T20 cricket. He becomes the first Indian pacer to reach this feat.","content":null,"pubDate":"2022-05-17 17:20:15","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/05/17/1878019-washington-sundar-videograb.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Tom Harrison brought in the money but left cricket smaller, poorer and divided | Andy Bull","link":"https://www.theguardian.com/sport/blog/2022/may/17/tom-harrison-brought-in-money-but-left-cricket-smaller-poorer-divided","keywords":["ECB","Cricket","Sport politics","Sport"],"creator":["Andy Bull"],"video_url":null,"description":"ECB chief executive became a defining figure as scandals, failure at Test level and the Hundred left English cricket fighting with itselfNot so long ago someone put a plastic turd in an envelope and posted it to Tom Harrison at the England and Wales Cricket Board. Think of it as a parting gift from the disaffected of English cricket, to go with Harrison’s share of the £2.1m in executive bonuses the ECB paid out this year. Harrison, who has a background in sales and marketing, is someone who imagines he would be able to win anyone over if they would only sit down and listen to him for 15 minutes one-on-one over a coffee. He seemed utterly nonplussed to discover there are people beyond the four walls of ECB headquarters who might feel differently about it.The media release announcing Harrison’s farewell as the ECB chief executive ran to just under 1,000 wordsand you can’t but wonder how much of it was his own work. It was half as long again as the one they issued when Joe Root stepped down as England captain last month after a record number of Tests. If you were being kind you would say that’s a reflection of the outsize role Harrison has taken on in the game in these past seven years. Captains, chairmen and coaches have come and gone, Harrison has clung on and somehow become one of the defining figures of this era of English cricket. He has achieved a prominence entirely beyond that of his predecessor, David Collier. Continue reading...","content":"N ot so long ago someone put a plastic turd in an envelope and posted it to Tom Harrison at the England and Wales Cricket Board. Think of it as a parting gift from the disaffected of English cricket, to go with Harrison’s share of the £2.1m in executive bonuses the ECB paid out this year. Harrison, who has a background in sales and marketing, is someone who imagines he would be able to win anyone over if they would only sit down and listen to him for 15 minutes one-on-one over a coffee. He seemed utterly nonplussed to discover there are people beyond the four walls of ECB headquarters who might feel differently about it. The media release announcing Harrison’s farewell as the ECB chief executive ran to just under 1,000 wordsand you can’t but wonder how much of it was his own work. It was half as long again as the one they issued when Joe Root stepped down as England captain last month after a record number of Tests. If you were being kind you would say that’s a reflection of the outsize role Harrison has taken on in the game in these past seven years. Captains, chairmen and coaches have come and gone, Harrison has clung on and somehow become one of the defining figures of this era of English cricket. He has achieved a prominence entirely beyond that of his predecessor, David Collier. Tom Harrison steps down as ECB chief executive amid England overhaul Read more The statement talks about “Tom’s leadership” during the pandemic. It mentions “Inspiring Generations”, “All Stars” and “Dynamos” and his desire to make the game “an extraordinary force for good”, his commitment to “tackling discrimination” and how he has overseen an era of “record investment in cricket” with “England Men and Women both crowned World Champions”. It would have been an embarrassingly fulsome statement to deliver to a bathroom mirror, let alone send out to the world’s media. Oddly, the statement doesn’t mention the Hundred, even when it touches on “the return of live cricket to free-to-air TV with the BBC”. Strange that a man who would lay claim to so much, including those two World Cups, would forget to mention his signature achievement. It’s almost as if he didn’t want to be associated with it. It was the Hundred, and its cack-handed launch, that caused English cricket’s ongoing culture wars. It split the sport just as neatly as it did the County Championship, which is now played largely in April, May and September. The Hundred compromised English first-class cricket and alienated a lot of people who love the sport, all for the sake, Harrison says, of safeguarding its future by making it less reliant on the TV revenues generated by international cricket. Curiously, it was his ability to make the most of those very same TV revenues that got him the job in 2014. He was considered an outsider for the role when Collier left but was a unanimous pick because the panel believed his background at IMG Media and ESPN Star Sports meant he would be in a good position to negotiate their rights deals. They were right. New balls please: counties receive fresh batch after Dukes cricket balls go soft Read more The ECB made £1.1bn from the last round of negotiations in 2017. That was Harrison’s real achievement. It doesn’t take 1,000 words to sum up his tenure, but nine zeroes. That money benefited everyone involved in the game, from the village groundsman who got a grant for a new mower on up, through the counties who live off what the ECB hands out to them, all the way to the England men’s and women’s players on central contracts, some of them now being paid a retainer not to play for their country. A lot of people got fatter off the back of it. But it still feels as though the sport has somehow grown smaller, poorer and more divided at the same time. Profits grew. Participation slumped. The latest figures show it dropped by 25% in the first five years Harrison was in the job. And that was before the pandemic, when it plummeted again. The interim ECB chair, Martin Darlow, allowed himself to be quoted as saying “when the pandemic struck it was Tom’s leadership that brought the game together and saved us from the worst financial crisis the sport has ever faced”. There you go, between the Yorkshire racism scandal, the DCMS select committee hearings , the aborted tour to Pakistan and the abject form of the men’s Test team the past year of English cricket has felt like one long garbage fire. But the bottom line was fine, so it’s bonuses all round. Harrison oversaw an era when English cricket knew the price of everything and the value of nothing. It wasn’t his fault. That was exactly why they picked him to begin with and he was well suited to it. In 2020, when the ECB laid off 62 people , including 19 development officers, their payroll costs went up because they hired so many new people in the marketing department. As for Inspiring Generations, the 12-point plan for tackling racism in the game and all the rest of the solutions the ECB has half-baked up to try to solve the problems that had grown worse on his watch, he will be long gone by the time it’s finally clear whether any of it made a real difference or not. He’ll be replaced, you hope, by someone with a very different way of thinking and talking about the sport and the radical challenges facing it.","pubDate":"2022-05-17 17:09:08","image_url":"https://i.guim.co.uk/img/media/9f2996f037aaef7e8830620ec481d350a5b7491a/0_159_4370_2622/master/4370.jpg?width=460&quality=85&auto=format&fit=max&s=d341329f89e9ac76d287f462d486e0f9","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"DY Patil Stadium pitch report today KKR vs LSG: Kolkata vs Lucknow DY Patil Sports Academy pitch report 2022","link":"https://thesportsrush.com/cricket-news-dy-patil-stadium-pitch-report-today-kkr-vs-lsg-kolkata-vs-lucknow-dy-patil-sports-academy-pitch-report-2022/","keywords":["Cricket","IPL 2022","KKR","Lucknow Super Giants","Indian Premier League","IPL","Kolkata Knight riders","LSG"],"creator":["Gurpreet Singh"],"video_url":null,"description":"DY Patil Stadium pitch report today KKR vs LSG: The venue will host its last match of the ongoing 15th season of the league. The 66th match of the ongoing 15th season of the Indian Premier League (IPL) will be played between the Kolkata Knight Riders (KKR) and Lucknow Super Giants (LSG) at the DY… The post DY Patil Stadium pitch report today KKR vs LSG: Kolkata vs Lucknow DY Patil Sports Academy pitch report 2022 appeared first on The SportsRush.","content":"DY Patil Stadium pitch report today KKR vs LSG: The venue will host its last match of the ongoing 15th season of the league. The 66th match of the ongoing 15th season of the Indian Premier League (IPL) will be played between the Kolkata Knight Riders (KKR) and Lucknow Super Giants (LSG) at the DY Patil Sports Academy Stadium in Mumbai. With fate no longer entirely in their own hands with respect to the playoffs qualification, all KKR can do is take charge of the controllable, and win their last league match today in the manner they have in the previous two matches. Contrary to KKR, the Super Giants have displayed a rare exhibition of some ordinary Cricket in their previous two matches; which has resultantly hampered their claim to finish amongst the top-2 teams at the end of the league stage. A win today will however, confirm their spot in the playoffs, set to commence from May 24. Both LSG and KKR would play their fourth and final match of the season at the DY Patil Sports Academy Stadium today. Preparations are underway for KKR. No mistakes from here on 👊 #AbApniBaariHai 💪 #IPL2022 🏆 #bhaukaalmachadenge #lsg #LucknowSuperGiants #T20 #TataIPL #Lucknow #UttarPradesh #LSG2022 pic.twitter.com/4f4zFzuQnM — Lucknow Super Giants (@LucknowIPL) May 17, 2022 With the venue set to host its 20 th and the last match of the season today, expect a dry and abrasive pitch yet again above the red soil surface. As witnessed in the previous match between Punjab Kings and Delhi Capitals a couple of days ago at this venue, expect captains to deploy their spinners straight away within the powerplay, and take advantage of the purchase the surface has on offer. Having said that, the best time to bat would be early on during the first innings, as the presence of grass would help the ball reach the batters better and at the anticipated pace. Expect the captain winning the Toss to opt to bat first. Score in the vicinity of the 160-run mark is likely on the cards for the team batting first.","pubDate":"2022-05-17 16:11:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-South Africa batsman Hamza banned for nine months over pill mix-up","link":"https://www.thestar.com.my/sport/cricket/2022/05/18/cricket-south-africa-batsman-hamza-banned-for-nine-months-over-pill-mix-up","keywords":null,"creator":null,"video_url":null,"description":"CAPE TOWN (Reuters) - South Africa test batsman Zubayr Hamza has been suspended for nine months after accidentally taking his father’s heart medication that contained the banned substance Furosemide, ruling him out of the tour of England later this year. Read full story","content":"CAPE TOWN (Reuters) - South Africa test batsman Zubayr Hamza has been suspended for nine months after accidentally taking his father’s heart medication that contained the banned substance Furosemide, ruling him out of the tour of England later this year. Hamza, who has played six tests and a single One-Day International for South Africa, had intended to take his own anti-allergy medication, but ingested the wrong pill according to his submission to the ICC’s Integrity Unit. The International Cricket Council has accepted his explanation and reduced his suspension from the usual two years to nine months, back-dated to March 22 this year. The 26-year-old Hamza will therefore be eligible to resume his career in December this year. He would have been in contention to tour England in August and September having been a mainstay of recent test squads. \"It is a timely reminder to all international cricketers that they remain responsible for anything they put into their bodies, to know exactly what medication they are taking so as to ensure it does not contain a prohibited substance and does not result in an anti-doping rule violation,\" Alex Marshall, General Manager of the ICC's Integrity Unit, said in a statement on Tuesday. Hamza’s performances between Jan. 17 and March 22 this year have been expunged from the records, including his scores of 25 and six in the innings and 276-run first test loss to New Zealand in February. (Reporting by Nick Said; Editing by Ken Ferris)","pubDate":"2022-05-17 16:01:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/18/1588372.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, MI vs SRH LIVE Updates: Rahul Tripathi Bags Half-Century, SunRisers Hyderabad 5 Down vs Mumbai Indians In Must-Win Game - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1taS12cy1zcmgtbGl2ZS1jcmlja2V0LXNjb3JlLW11bWJhaS1pbmRpYW5zLXZzLXN1bnJpc2Vycy1oeWRlcmFiYWQtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5ODQwNjDSAZwBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvbGl2ZS1pcGwtc2NvcmUtbWktdnMtc3JoLWxpdmUtY3JpY2tldC1zY29yZS1tdW1iYWktaW5kaWFucy12cy1zdW5yaXNlcnMtaHlkZXJhYmFkLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTg0MDYwL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, MI vs SRH LIVE Updates: Rahul Tripathi Bags Half-Century, SunRisers Hyderabad 5 Down vs Mumbai Indians In Must-Win Game  NDTV SportsMI vs SRH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorLive match blog - Sunrisers vs Mumbai 65th Match 2022 - Cricket Insights  ESPNcricinfo`Focus on batting`: Harbhajan Singh urges Kane Williamson to step down as SRH captain amid team`s poor run  WIONMumbai Indians vs Sunrisers Hyderabad Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-17 15:44:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: SRH's Umran Malik is 'work in progress,' says Ian Bishop","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-srhs-umran-malik-is-work-in-progress-says-ian-bishop-743291","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Umran Malik has picked up 18 wickets in 12 gamesHe made his IPL debut last season with SRHUmran has been consistently clocking 150kph or more","content":"IPL 2022: SRH’s Umran Malik is 'work in progress,' says Ian BishopIPL 2022: SRH’s Umran Malik is 'work in progress,' says Ian BishopFormer West Indies fast bowler Ian Bishop has heaped praise on Sunrisers Hyderabad (SRH) speedster Umran Malik, saying his \"pace distinguishes him from every other bowler\". Bishop said he has enjoyed watching Umran bowl as the SRH pacer has the ability to clock 150kph consistently. Umran, who has bowled the fastest delivery of Indian Premier League (IPL) 2022 at 157kph, has grabbed everyone's attention in the cricket fraternity. He has emerged as one of the favourites to be picked for the Indian squad. \"Malik's pace distinguishes him from every other bowler around the country and beyond now. It has been heartening watching his control improve as the IPL has gone along. He is adding control and know-how to his skill set without losing velocity. \"He seems to be a quick learner and a very hard worker who is not overawed by the boundary hitting power of the modern batsman. He gets hit for boundaries and keeps running in harder. That is a great attitude to have. It helps to have a short memory in the T20 format as a fast bowler,\" Bishop said in an interview with Sportstar. In 12 matches, Malik has picked up 18 wickets. His big figures this season so far have been 5 for 25, which he claimed against Gujarat Titans (GT).The mindset to get breakthroughs for his team every time the ball is thrown to him is what keeps #UmranMalik ticking. 🗣️🧡#KKRvSRH #OrangeArmy #ReadyToRise #TATAIPL pic.twitter.com/GkTikCEIQC— SunRisers Hyderabad (@SunRisers) May 15, 2022 Umran Malik is a 'work in progress,' says Ian Bishop There have been reports suggesting Umran could soon receive his maiden India call-up ahead of India's upcoming series against England and South Africa. Former Windies pacer Bishop believes that Umran is a 'work-in-progress' and a lot is yet to come from him. \"It helps to have a short memory in the T20 format as a fast bowler. Forget the inevitable bad over or bad games as quickly as possible and keep striving for a good performance with a smile and joy. It is important though to acknowledge that Malik is still a work in progress. He is no where near the finished article,\" Bishop added in the same interview. Umran was among the three players retained by SRH ahead of the IPL 2022 auction, along with skipper Kane Williamson and Abdul Samad. The 22-year-old, who made his competitive debut last year, has played three First-Class matches for Jammu and Kashmir and has picked seven wickets. He has bagged one wicket in one List A game and 29 scalps in 20 T20 games. SRH are currently placed eighth in the IPL 2022 table. After losing their opening two games, SRH went on to win their next five games, but only to lose the subsequent five. The IPL 2022 fixture between Williamson and Co and Mumbai Indians (MI) is currently underway at Wankhede Stadium.","pubDate":"2022-05-17 15:19:16","image_url":"https://assets.thehansindia.com/h-upload/2022/05/17/500x300_1292711-umran-malik.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"James Anderson: I considered quitting cricket after being dropped by England","link":"https://uk.sports.yahoo.com/news/james-anderson-considered-quitting-cricket-151027428.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-05-17 15:10:27","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IPL 2022, MI vs SRH Live Score Updates: Rahul Tripathi brings up his 50 - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiU2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLW1pLXZzLXNyaC1saXZlLXNjb3JlLTc5MjIwMDAv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, MI vs SRH Live Score Updates: Rahul Tripathi brings up his 50  The Indian ExpressMI vs SRH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Mumbai vs Sunrisers, Indian Premier League 2022, 65th Match  ESPNcricinfo'Ponting was captaining but realised his batting let the team down'  Hindustan TimesMumbai Indians vs Sunrisers Hyderabad Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-17 14:59:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Sunrisers Hyderabad: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-sunrisers-hyderabad-live-score-over-match-65-t20-6-10-updates-2984520","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Sunrisers Hyderabad from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Sunrisers Hyderabad are 101/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Mumbai Indians and Sunrisers Hyderabad. Everything related to Mumbai Indians and Sunrisers Hyderabad match will be available on Sports.NDTV.com . Stay updated with Mumbai Indians vs Sunrisers Hyderabad live score. Do check for Mumbai Indians vs Sunrisers Hyderabad scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) Length and outside off, cut away to deep point for a single. Pooran off the mark here. Nicholas Pooran walks out to bat. 9.5 overs (0 Run) OUT! CAUGHT AND BOWLED! Such a soft dismissal and Priyam Garg will be disappointed with himself. Overpitched and around off. Garg pushes it with a straight bat, back to Ramandeep Singh who gets low and takes it cleanly. The ball sticks a bit and Garg ends up playing it back to the bowler. Mumbai finally getting the breakthrough. They will look to build on this now. 9.4 overs (1 Run) Slower again, length and outside off. Tripathi steers it to short third man for another run. 9.3 overs (1 Run) Outside off. Garg opens the face of the bat and plays it to backward point for a single. 9.2 overs (1 Run) On middle. Tripathi puts his skates on and drills it to long on for a single. 9.1 overs (4 Runs) FOUR! Just over! Luck favors the brave! A length ball, outside off. Rahul Tripathi cuts it hard and uppishly to point where Mayank Markande leaps but the ball evades his hands for a boundary. Strategic break! The pair of Priyam Garg and Rahul Tripathi has taken the attack to Mumbai's bowlers and they have laid a solid foundation for the batters to follow. Mumbai will need to break this ominous-looking partnership sooner rather than later, if they are to restrict Hyderabad to a par score. Ramandeep Singh comes into the attack now. 8.6 overs (0 Run) Full and on off, pushed to covers. 8.5 overs (4 Runs) FOUR! Garg is playing so freely here as if there is no pressure on him! Tossed up, on off. Garg slog-sweeps it to deep mid-wicket where the ball bounces just in front of the ropes. 8.4 overs (1 Run) A loopy ball, on off. Tripathi pushes it to covers for another easy single. 8.3 overs (1 Run) Length and on off. Priyam works it to point for a single. 8.2 overs (4 Runs) FOUR! Innovation! Fuller and on middle. Garg presses forward and reverse sweeps it through point as Jasprit Bumrah lets it through his hands for a boundary. 8.1 overs (2 Runs) Both the spinners are failing to hit the line! Floated and on the pads. Garg tickles it past short fine leg for a brace. 7.6 overs (0 Run) Better ball from Yadav! Flatter, at a good pace and around off. Tripathi punches off the back foot to covers. 7.6 overs (1 Run) Wide! Too full but again down the leg side. Tripathi misses his sweep. 7.5 overs (2 Runs) Full and angling on the pads, swept behind square on the leg side for a couple. 7.5 overs (1 Run) Wide! Slants a full ball down the leg side. Tripathi misses his flick. 7.4 overs (4 Runs) FOUR! Beautiful shot! tossed up, touch quicker and around off. Tripathi skips down and goes inside-out over covers and wide of long off for a boundary. Rahul Tripathi looks in really good touch. 7.3 overs (1 Run) Too full and outside off, pushed to deep cover for a run. 7.2 overs (6 Runs) SIX! IN THE AIR AND OVER THE FENCE! Tossed up, full and on off. Garg kneels and slog-sweeps it over the mid-wicket fence for a biggie. 7.1 overs (0 Run) An arm ball, length and outside off, it grips on the surface. Garg looks to push but misses. 6.6 overs (0 Run) NOT OUT! Flighted ball, full and outside off, it turns away a bit. Tripathi steps down to sweep but misses and Kishan, behind the stumps, whips the bails off in a flash. He appeals and the replay shows no bat was involved in the process while Tripathi had his back foot grounded. Stumping-check! Rahul Tripathi has missed his sweep and Ishan Kishan behind the sticks has disturbed the stumps quite quickly. The umpire has sent it upstairs. The replay shows that Tripathi had his back foot grounded. 6.5 overs (1 Run) On middle, pulled away to deep mid-wicket for one more. 6.4 overs (1 Run) Fuller and outside off. Tripathi drops it to point and scampers across for a quick single. 6.3 overs (1 Run) Slightly short and on off. Garg opens his body and pushes it wide of long on for a single. 6.2 overs (1 Run) Slower ball, on middle. Tripathi works it to deep mid-wicket for a single. 6.1 overs (1 Run) Markande starts with a flatter ball, outside off. Garg punches it to deep cover for a single. Mayank Markande comes into the attack. 5.6 overs (1 Run) Too full and on off, it is pushed through covers for a single. Kane Williamson coming down the order has worked for Hyderabad as they finish the Powerplay nicely at 57 for 1. 5.5 overs (6 Runs) SIX! This was a freebie! Short and down the leg side. Garg pulls it, not off the middle but dispatches it to the shorter side at deep backward square leg for a biggie. 5.4 overs (1 Run) Length ball, outside off. Tripathi dabs it to third man for a single. 50 up as well! 5.3 overs (1 Run) On middle, tucked to deep square leg for a single. 5.2 overs (2 Runs) DROPPED! Sanjay Yadav is the culprit! Sams bangs a bouncer, on middle. Garg tries to take him on as he tries to pull but gets a top edge and the ball goes high in the air. Sanjay Yadav at deep square leg, runs across to his right and Jasprit Bumrah from short fine leg converges as well but it was Yadav who called for it and eventually drops it. Two runs taken. 5.1 overs (0 Run) An off-pace delivery, full and outside off. Garg tries to push but misses.","pubDate":"2022-05-17 14:39:48","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637884149772444216.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Priyam Garg stats: Kane Williamson at Number 3 IPL stats","link":"https://thesportsrush.com/cricket-news-priyam-garg-stats-kane-williamson-at-number-3-ipl-stats/","keywords":["Cricket","IPL 2022","Sunrisers Hyderabad","Kane Williamson","Priyam Garg","SRH vs MI"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Priyam Garg stats: Kane Williamson has confirmed that Priyam Garg will open with Abhishek Sharma in the IPL 2022 game against Mumbai. Sunrisers Hyderabad are up against Mumbai Indians in the 65th league game of Indian Premier League 2022. The game is being played at the Wankhede Stadium in Mumbai. This is a do-or-die game… The post Priyam Garg stats: Kane Williamson at Number 3 IPL stats appeared first on The SportsRush.","content":"Priyam Garg stats: Kane Williamson has confirmed that Priyam Garg will open with Abhishek Sharma in the IPL 2022 game against Mumbai. Sunrisers Hyderabad are up against Mumbai Indians in the 65th league game of Indian Premier League 2022. The game is being played at the Wankhede Stadium in Mumbai. This is a do-or-die game for the Sunrisers Hyderabad, whereas Mumbai Indians are already out of the tournament. Mumbai Indians brought in Mayank Markande and Sanjay Yadav in place of Hrithik Shokeen and Kumar Kartikeya in this game. Priyam Garg stats Sunrisers Hyderabad made a couple of changes to their playing eleven for the game against Mumbai Indians. Priyam Garg and Fazal Farooqi came in for Shashankh Singh and Marco Jansen. Williamson also said that Priyam Garg will bat at the top-order with Abhishek Sharma. “Priyam Garg comes in for Shashank and Fazal Farooqi comes in for Marco Jansen. Just tactical changes, things are getting tight and we just need to adjust quickly. Nice opportunity for Priyam to play at the top of the order with Abhishek Sharma,” Kane Williamson said at the toss. We have a new opening partnership tonight. Get us a good start here, Priyam and Abhi! #MIvSRH #OrangeArmy #ReadyToRise #TATAIPL — SunRisers Hyderabad (@SunRisers) May 17, 2022 Priyam Garg was re-signed by Sunrisers Hyderabad in the IPL 2022 auction. He has played 19 IPL games across 2020 and 2021, where he has scored 205 runs at a poor average of 14.64, where 51* has been his highest score. It is clear that Priyam Garg has not been at his best in the IPL. In overall T20s, Priyam Garg has scored 518 runs at 17.86, with the help of three half-centuries. It is clear that Priyam does not possess great T20 numbers. Kane Williamson at Number 3 IPL stats Sunrisers Hyderabad captain Kane Williamson has been struggling to find his feet in the tournament so far. He has just scored 208 runs this season at 18.90, whereas his S/R has been 92.85. Kane Williamson is expected to bat at number three in this game as Priyam is expected to open the innings with Abhishek Sharma. At number three slot, Willamson has played 40 innings in the IPL, where he has scored 1268 runs at 39.63, courtesy of 12 half-centuries. Williamson loves to bat at the number three slot in international cricket as well. The post Priyam Garg stats: Kane Williamson at Number 3 IPL stats appeared first on The SportsRush.","pubDate":"2022-05-17 14:02:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Sunrisers Hyderabad Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-sunrisers-hyderabad-live-score-over-match-65-t20-1-5-updates-2984304","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Sunrisers Hyderabad from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Sunrisers Hyderabad are 46/1. The live updates of Mumbai Indians vs Sunrisers Hyderabad scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Mumbai Indians vs Sunrisers Hyderabad, Mumbai Indians vs Sunrisers Hyderabad live score, Mumbai Indians vs Sunrisers Hyderabad scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (4 Runs) FOUR! Bumrah goes for a yorker but ends up serving a low full toss, around off, Tripathi drives it past the mid off fielder and bags another boundary. 15 runs off the over! 4.5 overs (4 Runs) FOUR! Deft touch! A length ball, around off. Rahul Tripathi hangs back and just guides it past the diving fielder at short third man for a boundary this time. Clever batting from Tripathi. Bumrah under pressure now! 4.4 overs (6 Runs) SIX! BOOM! That is a cracking shot from Rahul Tripathi! Bumrah changes his length and hurls a short ball, angling in from off. Tripathi sits back and swivel-pulls it in front of square on the leg side for a biggie. 4.3 overs (0 Run) Good-length ball, angling in from outside off. Rahul Tripathi prods and defends it towards the backward point fielder. 4.2 overs (0 Run) Bumrah serves a pinpoint yorker, around middle. Rahul Tripathi does well to squeeze it out. 4.1 overs (1 Run) Aerial but safe! Bumrah begins with a length ball, on middle. Priyam Garg chips it towards the on side and the ball falls just short of Mayank Markande at mid on. A single taken. Jasprit Bumrah is into the attack. 3.6 overs (0 Run) Much better length from the debutant! Flatter and quicker, on a length, around off. Tripathi stays back and taps it towards the short third man fielder. 3.5 overs (4 Runs) FOUR! UP AND OVER! Floated, on a length, around off. Rahul Tripathi goes inside-out over extra cover and collects a boundary. Top shot! 3.4 overs (0 Run) An appeal for LBW but the umpire says no! Tossed up, just outside off. Rahul Tripathi looks to sweep by getting forward but he misses and gets hit on his pad. The impact might have been outside off. 3.3 overs (4 Runs) FOUR! Nicely played! Floated, full and on middle and leg. Tripathi kneels and sweeps it behind square on the leg side for a boundary. 3.2 overs (0 Run) Tossed up, on middle. Rahul Tripathi pushes it towards mid on. 3.1 overs (0 Run) Yadav starts with a yorker-length ball, around off. Rahul digs it out towards cover. Sanjay Yadav, on his debut, will bowl now. 2.6 overs (4 Runs) FOUR! Not where Priyam Garg intended it to go, but he will take that! This is full and outside off. Garg skips down the track and looks to smack it over mid off. Although, he gets it from the outer half of the blade, over the extra cover fielder. The ball races away to the fence. 2.5 overs (1 Run) Uppish but safe! On a length, around middle. Rahul Tripathi looks to flick but he gets a bit early into his shot. The ball goes off the shoulder of the bat, towards deep square leg for a single. Rahul Tripathi walks out at number 3. 2.4 overs (0 Run) OUT! CAUGHT! Daniel Sams gets the breakthrough and the in-form Abhishek Sharma has to walk back to the hut! This is a length ball, around off. Abhishek sits back and looks to go over the mid off fielder. However, he mistimes his shot and the ball goes high in the air towards Mayank Markande at mid off who settles under it and pouches it with ease. Hyderabad lose their first wicket. 2.3 overs (1 Run) On a length, around middle. Priyam Garg tucks it around the corner and settles for a run. 2.2 overs (4 Runs) FOUR! GARG IS OFF THE MARK! A short ball, around leg. Garg swivels and pulls it behind square on the leg side to bag a boundary. 2.1 overs (1 Run) A length ball, around off. Abhishek Sharma taps it towards backward point. The fielder there fails to grab the ball and the batters collect a run. 1.6 overs (0 Run) Another ball, just outside off. But this time the ball jags back in late. Garg looks to defend but he misses as the ball sneaks through the gap between his bat and pad. Lovely bowling. 1.5 overs (0 Run) BEATEN! Good-length ball, around the corridor of uncertainty and jagging away just that little bit. Garg has a poke at it but the ball whizzes past his outside edge. 1.4 overs (1 Run) A short ball, around leg. Abhishek Sharma mistimes his pull shot, just wide of the square leg fielder. Tristan Stubbs there collects the ball and has a shy at the bowler's end but he misses by a big margin. A single taken. 1.3 overs (0 Run) Meredith runs in and hits the deck hard, around off. Abhishek Sharma taps it towards backward point. 1.2 overs (2 Runs) A length ball, angling in from middle. Abhishek Sharma flicks it past the mid-wicket fielder for a brace. 1.1 overs (4 Runs) FOUR! Easy pickings! A half-volley from Meredith, just outside off. Abhishek Sharma frees his arms and carves it through the cover region for a boundary. Who will bowl from the other end? It is Riley Meredith. 0.6 over (0 Run) Garg skips down the track, so Sams bangs it into the deck, around middle. Garg ducks underneath watchfully. Good start from the Australian. 0.5 over (4 Runs) FOUR LEG BYES! A full ball, around leg. Priyam Garg misses his flick. The ball ricochets off the pads and races away to the fine leg fence. An appeal from the bowler but the umpire is unmoved. Rohit has a chat with the keeper and Daniel Sams, but they don't opt for a review. 0.4 over (1 Run) This is a length ball, just outside off. Abhishek Sharma taps it behind square on the off side and gets to the other end. Hyderabad are up and running! 0.3 over (0 Run) On a length, around off. Abhishek keeps it out. 0.2 over (0 Run) BEAUTY! Good-length delivery, angling in from outside off and then shaping away late after landing. Sharma prods to block but the ball zips past his outside edge. Excellent delivery. 0.1 over (0 Run) Sams starts with a length ball, around middle. Abhishek Sharma blocks it out towards mid on. We are all set for the action. The Mumbai players are in the huddle while the openers of Hyderabad - Priyam Garg and Abhishek Sharma make their way out in the middle. Daniel Sams is all set to start with the ball. Here we go... Nicholas Pooran is up for a chat. He says they are just focusing on what they have done as a team. They want to finish on a high and there's a possibility that they can qualify as well but have to win the last two games. Shares that he's doing the job, he has been asked to do but the last couple of games were disappointing. He could have done something special but he ran out of partners. Mentions that he tries to learn every time from the likes of Kane Williamson, Brian Lara, Dale Steyn, and Muttiah Muralitharan, they are legends of this game and have a lot of knowledge as well. On being asked about team Mumbai, he says they have been successful in the last couple of games, they are picking up some decent momentum but they are looking forward to the challenge. Kane Williamson, the skipper of Hyderabad, says that they wanted to bat first anyway. Adds that it looks like a dry surface and they want to put up a good total on the board. Informs that they have made a couple of changes to their side - Priyam Garg and Fazalhaq Farooqi come in for Shashank Singh and Marco Jansen respectively. Says that Priyam Garg will be opening the batting for them. Rohit Sharma, the skipper of Mumbai, says they will bowl first, they just want to try different things and bowling first is working for them as well. Informs there are two changes, two spinners are out and Mayank Markande and Sanjay Yadav come in. Admits they have to keep an eye on certain players and for the team's future as well. Mentions that the core group should continue to play and they thought about resting some players but they will try it out in the last game. Hyderabad (Playing XI) - Abhishek Sharma, Priyam Garg (In for Shashank Singh), Kane Williamson (C), Aiden Markram, Rahul Tripathi, Nicholas Pooran (WK), Washington Sundar, Fazalhaq Farooqi (In for Marco Jansen), Bhuvneshwar Kumar, T Natarajan, Umran Malik. Mumbai (Playing XI) - Rohit Sharma (C), Ishan Kishan (WK), Sanjay Yadav (On debut) (In for Hrithik Shokeen), Tilak Varma, Tristan Stubbs, Tim David, Daniel Sams, Mayank Markande (In for Kumar Kartikeya), Ramandeep Singh, Jasprit Bumrah, Riley Meredith. TOSS - Mumbai have won the toss and they have elected to BOWL first. PITCH REPORT - Matthew Hayden is near the pitch. He says the wicket as always looks a very good one. Adds there isn't a lot of grass, and whatever little there is, is dry. Mentions there are some cracks, and the spinners should come into play and pace off the ball, should control the middle overs. Shares the wickets at this stage of the competition look torn and 170-180 should be a par score. Informs runs on the board will be important as dew has not played a big factor. Hyderabad are coming into this clash at the back of five losses in a row and finds themselves in deep trouble. They need to win their remaining two games by a good margin and hope that the other results go their way. They have a solid bowling attack but it is their batters who have been inconsistent throughout the season. Can the Orange Army put on a show at Wankhede, or will Mumbai spoil Hyderabad's party and register yet another win? We shall find that soon. Stay tuned for toss and further updates. Mumbai have been well below-par this season but they have managed to find some form in the latter half of the tournament, having won three out of their last four games. They were the first team to be eliminated from the playoffs race, but having said that, Rohit Sharma and his troops would be itching to end the season on a high with more wins under their belt. Hello and a warm welcome to game number 65 of the Indian T20 League, where Mumbai will take on Hyderabad at the iconic Wankhede Stadium. The 5-time champions will be playing for pride, while the Kane Williamson-led Hyderabad would be looking to get a comprehensive win, as they still have a slim chance of making it to the playoffs. ...MATCH DAY...","pubDate":"2022-05-17 13:56:00","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637884123518032883.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Tilak Varma could be an all-format player for India”: Sunil Gavaskar backs Mumbai Indians batter Tilak Varma to play in all three formats for India","link":"https://thesportsrush.com/cricket-news-tilak-varma-could-be-an-all-format-player-for-india/","keywords":["Cricket","IPL 2022","Mumbai Indians","IPL","MI","Sunil gavaskar","Tilak Varma"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Legendary Indian batter Sunil Gavaskar has backed Mumbai Indians’ batter, Tilak Varma, to soon play for India in all formats. Mumbai Indians have struggled in the Indian Premier League 2020, where they have won just three of their 12 games in the tournament so far. The record champions were the first team to get knocked… The post “Tilak Varma could be an all-format player for India”: Sunil Gavaskar backs Mumbai Indians batter Tilak Varma to play in all three formats for India appeared first on The SportsRush.","content":"Legendary Indian batter Sunil Gavaskar has backed Mumbai Indians’ batter, Tilak Varma, to soon play for India in all formats. Mumbai Indians have struggled in the Indian Premier League 2020, where they have won just three of their 12 games in the tournament so far. The record champions were the first team to get knocked out of the tournament this season. Despite a poor season, the best thing about the side has been the plethora of young batters in their ranks. The rise of Indian batter Tilak Varma has been one of the most promising aspects of the side. Tilak Varma was bought by Mumbai Indians for a price of INR 1.7 crores in the IPL 2022 auction. Tilak Varma has been impressive this season, where he has scored 368 runs at an average of 40.88, whereas his S/R has been 132.85. He has scored a couple of half-centuries and has been the best batter of the side this season. A few days ago Rohit Sharma also said that Tilak Varma has the ability to be an all-format player for the Indian cricket team. Former Indian captain Sunil Gavaskar has also backed Rohit’s statement. Sunil Gavaskar said that the biggest strength of Tilak Varma is that he got his basics right. He added that Tilak plays with the straight bat and his defending is proper as well. Gavaskar insists that Tilak Varma should work a little bit extra to improve upon his fitness. “Rohit Sharma rightly mentioned that he could be an all-format player for India. So now it’s up to him to work that little bit extra, get his fitness going, get a little tighter as far as the technique is concerned and prove Rohit right,” Gavaskar quoted as per Indian Express. Varmaji ka beta shining in Blue and Gold 😏 @mipaltan fans, how many 💙💙 for this #Epic Tilak Varma performance? #TATAIPL #MIvCSK pic.twitter.com/u8mOTgh4T5 — Star Sports (@StarSportsIndia) April 21, 2022 “He’s got the basics right. Technically, he’s right. He gets right behind the line of the ball. He’s got a straight bat, and while defending on the front foot his bat is close to the pad. So, all his basics are right.” Sunil Gavaskar praised the temperament of Tilak Varma in the knock against Chennai Super Kings. Tilak Varma came out to bat in a pressure situation, and the way he rotated the strike impressed Sunil Gavaskar. “He played a wide range of shots and kept rotating the strike. This shows that he has a good cricketing head on his shoulders, and I think that’s important,” Gavaskar said.","pubDate":"2022-05-17 13:13:42","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“From the test team’s point of view, I think that’ll be really good”: James Anderson backs the appointment of Brendon McCullum as new coach of England test team","link":"https://thesportsrush.com/cricket-news-from-the-test-teams-point-of-view-i-think-thatll-be-really-good-james-anderson-backs-the-appointment-of-brendon-mccullum-as-new-coach-of-england-test-team/","keywords":["Cricket","Brendon McCullum","ECB","James Anderson"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"English pacer James Anderson has backed the signing of former New Zealand batter Brendon McCullum as the new test coach of the side. English cricket is set to start a new era under Ben Stokes and Brendon McCullum. Ben Stokes was named the captain of the side after the resignation of Joe Root. Brendon McCullum… The post “From the test team’s point of view, I think that’ll be really good”: James Anderson backs the appointment of Brendon McCullum as new coach of England test team appeared first on The SportsRush.","content":"English pacer James Anderson has backed the signing of former New Zealand batter Brendon McCullum as the new test coach of the side. English cricket is set to start a new era under Ben Stokes and Brendon McCullum . Ben Stokes was named the captain of the side after the resignation of Joe Root. Brendon McCullum was surprisingly named the new test coach of the side, this will be McCullum’s first assignment as an international coach. England dropped James Anderson and Stuart Broad for the West Indies tour, but Ben Stokes has confirmed that both the veterans will remain a vital part of the side . Both the veterans are currently playing their trade in the County Championship. James Anderson has taken 11 wickets in three games this season, and he took the wicket of Joe Root in the last game. Veteran English pacer James Anderson has backed new test head coach Brendon McCullum to do well. Anderson said that he has played against Brendon McCullum, and he will bring some new ideas that will be beneficial for English cricket as well. He called McCullum a forward thinker who thinks out of the box. “Seeing how he (Mccullum) went about playing the game and captaining NZ, he was a real forward thinker, he thought out of the box,” Anderson said at the LV Insurance event in Leicester. “From the test team’s point of view, I think that’ll be really good. He will bring fresh ideas, and energy to that group.” James Anderson bowls Joe Root 👀 Big celebs from Jimmy for that wicket! #LVCountyChamp pic.twitter.com/y4FnvUAJ3u — LV= Insurance County Championship (@CountyChamp) May 15, 2022 James Anderson also appreciated the signing of Ben Stokes as the new captain of the side. He said that the duo of Brendon McCullum and Ben Stokes will definitely help the test team. Anderson also called Ben Stokes a born leader. “Ben will do the same with his captaincy, he’s a very energetic bloke, passionate about English cricket, and he’s just a born leader,” James Anderson said. “I think those two appointments are positive and should help the Test team gets back to where it can be, because we’ve had a few dodgy years, and we are in a sorry position in the Test Championship.”","pubDate":"2022-05-17 12:40:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BCCI announces squads for Women’s T20 Challenge","link":"https://starofmysore.com/bcci-announces-squads-for-womens-t20-challenge/","keywords":["Sports","BCCI","Women's T20 Challenge"],"creator":["Author"],"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) yesterday announced the squads for the upcoming Women’s T20 Challenge. Harmanpreet Kaur, Smriti Mandhana and Deepti Sharma have been named as the Captains of Supernovas, Trailblazers and Velocity, respectively. The three teams will compete in the upcoming Women’s T20 Challenge to be played from May 23-28... The post BCCI announces squads for Women’s T20 Challenge appeared first on Star of Mysore.","content":"The Board of Control for Cricket in India (BCCI) yesterday announced the squads for the upcoming Women’s T20 Challenge. Harmanpreet Kaur, Smriti Mandhana and Deepti Sharma have been named as the Captains of Supernovas, Trailblazers and Velocity, respectively. The three teams will compete in the upcoming Women’s T20 Challenge to be played from May 23-28 at Pune’s MCA Stadium. “The best of Indian women’s cricket will combine with some of the leading stars from South Africa, England, West Indies and Australia. A total of twelve international players will compete in this year’s Women’s T20 Challenge,” the official release stated. The All-India Women’s Selection Committee picked the three squads — each comprising a total of 16 members. The opening match of the Women’s T20 Challenge will be played between Trailblazers and Supernovas on May 23. On May 24, Supernovas will square off against Velocity. On May 26, Velocity will take on Trailblazers. The final of the Tournament will be contested on May 28. SQUADS Supernovas: Harmanpreet Kaur (C), Taniya Bhatia, Alana King, Ayushi Soni, V. Chandu, Deandra Dottin, Harleen Deol, Meghna Singh, Monica Patel, Muskan Malik, Pooja Vastrakar, Priya Punia, Rashi Kanojia, Sophie Ecclestone, Sune Luus and Mansi Joshi. Trailblazers: Smriti Mandhana (C), Poonam Yadav, Arundhati Reddy, Hayley Matthews, Jemimah Rodrigues, Priyanka Priyadarshini, Rajeshwari Gayakwad, Renuka Singh, Richa Ghosh, S. Meghana, Saiqa Ishaque, Salma Khatun, Sharmin Akhter, Sophia Brown, Sujata Mallik and S.B. Pokharkar. Velocity: Deepti Sharma (C), Sneh Rana, Shafali Verma, Ayabonga Khaka, K.P. Navgire, Kathryn Cross, Keerthi James, Laura Wolvaardt, Maya Sonawane, Natthakan Chantam, Radha Yadav, Aarti Kedar, Shivali Shinde, Simran Bahadur, Yastika Bhatia and Pranavi Chandra. The post BCCI announces squads for Women’s T20 Challenge appeared first on Star of Mysore.","pubDate":"2022-05-17 11:30:00","image_url":null,"source_id":"starofmysore","country":["india"],"category":["sports"],"language":"english"},{"title":"KSCA Mysuru presents Annual Awards","link":"https://starofmysore.com/ksca-mysuru-presents-annual-awards/","keywords":["Sports","Karnataka State Cricket Association","KSCA Mysuru"],"creator":["Author"],"video_url":null,"description":"The Annual Award Ceremony of the Karnataka State Cricket Association, (KSCA), Mysore Zone, for 2021-22 was held at Nithyotsava Hall in city on Sunday. The prizes to the cricketers, winning Clubs in the Zonal League, T20 Knock-out Tournament and Sri Gopalaswami Memorial Tournament were given away by KSCA Hon. Vice-President J. Abhiram and City Police... The post KSCA Mysuru presents Annual Awards appeared first on Star of Mysore.","content":"The Annual Award Ceremony of the Karnataka State Cricket Association, (KSCA), Mysore Zone, for 2021-22 was held at Nithyotsava Hall in city on Sunday. The prizes to the cricketers, winning Clubs in the Zonal League, T20 Knock-out Tournament and Sri Gopalaswami Memorial Tournament were given away by KSCA Hon. Vice-President J. Abhiram and City Police Commissioner Dr. Chandragupta. Prize Winners M. Venkatesh (Karnataka State Ranji Trophy, Vijay Hazare and U-25 State), M.B. Darshan (Karnataka State Mushtaq Ali & Vijay Hazare), S.J. Nikin Jose, Kishan S. Bedare, Kruthik Krishna, L.R. Chethan and L.R. Kumar (all Karnataka State U-25), Rakshitha Krishnappa, Shubha Satheesh and P. Saloni (all Karnataka Senior Women’s Team). KSCA Mysuru Zone players, who represented the State during 2021-2022, seen with dignitaries. Tournament Winners KSCA Mysuru Zone U-16 Inter-Club League – Winner: National CC and Runner-up: Friends Union CC. Sri M. Gopalaswsmi Memorial Tournament – Winner: RBNCC and Runner-up: Saraswathipuram SC. KSCA Mysore Zone T20 – Winner: Jo Jo CC and Runner: RBNCC. I Division – Winner: RBNCC and Runner-up: National CC. II Division – Winner: Yuvaraja’s College and Runner-up: Friends Union CC. III Division – Winner: Karavali Cricketers and Runner-up: Mohan’s XI. IV Division – Winner: Kuvempunagar CC and Runner-up: Garner CC. TR Tournament – Winner: Friends Association Cricket Club and Runner-up: Notu Mudrana CC. Special awards U-16 Inter-Club League – Best Batsman: M.D. Ayush (CPC) and Best bowler: Rajashekhar Swamy (Friends Union CC). I Division – Best Batsman: Vishnu Priyan (Jawahar’s) and Best Bowler: N.R. Madhava (National CC). II Division – Best Batsman: Hemanth Kumar (FUCC) and Best Bowler: Sibtain Ali (FUCC). III Division – Best Batsman: S. Rajath and Best Bowler: P.A. Chandru (Rising Star CC). IV Division – Best Batsman: Abid Ali (Kuvempunagar CC) and Best Bowler: Vibodh Ramesh (New National CC). The post KSCA Mysuru presents Annual Awards appeared first on Star of Mysore.","pubDate":"2022-05-17 11:09:00","image_url":null,"source_id":"starofmysore","country":["india"],"category":["sports"],"language":"english"},{"title":"PHOTO FOCUS - 12 photos from Bridlington CC 1sts' win against Cottingham","link":"https://www.thescarboroughnews.co.uk/sport/cricket/photo-focus-12-photos-from-bridlington-cc-1sts-win-against-cottingham-3697133","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"Bridlington Cricket Club's 1st XI earned a home win against Cottingham in the YPLN Championship on Saturday.","content":null,"pubDate":"2022-05-17 11:07:33","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI1NzIyODM1.jpeg?width=1024&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“Mumbai fan base”: Riley Meredith shortlists two takeaways from IPL 2022 season with Mumbai Indians","link":"https://thesportsrush.com/cricket-news-mumbai-fan-base-riley-meredith-shortlists-two-takeaways-from-ipl-2022-season-with-mumbai-indians/","keywords":["Cricket","IPL 2022","Mumbai Indians","MI","Riley Meredith"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Riley Meredith has bowled well in the latter half of the season for Mumbai Indians and he has talked about his takeaways from IPL 2022. IPL 2022 has been a forgettable one for the Mumbai Indians and for the second successive season, they failed to qualify for the playoffs. Mumbai Indians lost their initial eight… The post “Mumbai fan base”: Riley Meredith shortlists two takeaways from IPL 2022 season with Mumbai Indians appeared first on The SportsRush.","content":"Riley Meredith has bowled well in the latter half of the season for Mumbai Indians and he has talked about his takeaways from IPL 2022. IPL 2022 has been a forgettable one for the Mumbai Indians and for the second successive season, they failed to qualify for the playoffs. Mumbai Indians lost their initial eight games, and they were the first team to be knocked out of the tournament. Mumbai Indians are the record champions of the IPL, and they made some really good investments this season. With a very young core in their ranks, they will be confident going into next season. Everybody is waiting for the duo of Jasprit Bumrah and Jofra Archer to bowl together. Mumbai Indians pacer Riley Meredith gave an interview where he talked about the performance of the team this season and how they have played well in the latter half of the tournament. Australian pacer Riley Meredith said that they have played some really good cricket at the backend of the tournament, but he admitted that they were late in finding it. He also said that he is really excited for the next season. “Towards the backend of the tournament, we have played some really good cricket,” Riley Meredith said in a video released by Mumbai Indians. “The competition is there from us, but obviously a bit late finding it. But it’s really exciting going to next season and I’m sure there will be big things to come.” “I am sure there will be big things to come.” 😎 Riley outlines his learnings from this season 💪 #OneFamily #DilKholKe #MumbaiIndians MI TV pic.twitter.com/sxyIj02AMS — Mumbai Indians (@mipaltan) May 17, 2022 Riley Meredith also talked about the two giveaways of the Indian Premier League 2022. He said that the bonding and support from the team were great and the second one was the Mumbai Indians’ fanbase who stuck by them every time. “Two big takeaways are probably just coming back from the team, it’s been really good energy. The team has been great, always support each other,” Riley Meredith said. “Probably the second one is the Mumbai fanbase. They stuck by us really well and the support has been fantastic.” Riley Meredith was bought by Mumbai Indians for a price of INR 1 crores in the auction. This is Riley Meredith’s second IPL season, and he was bought by Punjab Kings for a price of INR 8 crores. Meredith has scalped seven wickets in six games for Mumbai Indians this season.","pubDate":"2022-05-17 10:57:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Harrison to step down as ECB CEO, Clare Connor named interim successor","link":"https://sportstar.thehindu.com/cricket/tom-harrison-steps-down-ecb-ceo-clare-connor-replacement/article38493414.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Clare Connor, who is currently Managing Director of England Women's Cricket, is set to take over when Harrison leaves until a permanent successor has been appointed.","content":"England cricket chief executive Tom Harrison will step down in June after more than seven years in the role, the country's board said in a statement on Tuesday. Clare Connor, who is currently Managing Director of England Women's Cricket, is set to take over when Harrison leaves until a permanent successor has been appointed, the England and Wales Cricket Board (ECB) added. \"It has been a huge honour to be CEO of the ECB for the past seven years,\" Harrison said, adding that the last two years in the role had been challenging. \"But we have pulled together to get through the pandemic, overcome cricket's biggest financial crisis, and committed to tackling discrimination and continuing the journey towards becoming the inclusive, welcoming sport we strive to be. \"I have put everything into this role, but I believe now is the right time to bring in fresh energy to continue this work.\" READ: Nortje, Parnell return for South Africa’s T20 tour of India Harrison, who played for Northamptonshire and Derbyshire, took over as CEO in 2015 following stints at IMG and ESPN Star Sports. He oversaw the introduction of the new-format Hundred, the inaugural season of which took place in 2021. He also helped the ECB navigate the COVID-19 pandemic as well as the racism scandal that rocked English cricket after several players, including former Yorkshire spinner Azeem Rafiq, alleged they were victims of institutional racism at their clubs. \"When the pandemic struck, it was Tom's leadership that brought the game together and saved us from the worst financial crisis the sport has ever faced,\" ECB interim chair Martin Darlow said. ALSO READ: De Villiers, Gayle inducted into the RCB Hall of Fame \"He has always put the interests of the game first and worked to lead important change to make our game more accessible and inclusive, though we all know there is still much more work to do.\" Harrison's decision comes amid plenty of churn in English cricket in the wake of a 5-0 Ashes hammering. All-rounder Ben Stokes has been appointed as the new captain of the Test team, replacing Joe Root, and former New Zealand captain Brendon McCullum was named head coach in the longest format. According to reports in British and Australian media, Matthew Mott, head coach of the Australia women's team, is the front-runner to take charge of the England men's limited-overs side.","pubDate":"2022-05-17 10:52:30","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"‘How sad’: Test veteran’s unwanted record - news.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L3NyaS1sYW5rYXMtYW5nZWxvLW1hdGhld3MtZmFsbHMtYWdvbmlzaW5nbHktc2hvcnQtb2YtdGVzdC1kb3VibGUtY2VudHVyeS1pbi1jaGF0dG9ncmFtL25ld3Mtc3RvcnkvNjc0ZmU1YWFlMGFhMmFjNmM2OWNkMTVkMTA2YjY2YjXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘How sad’: Test veteran’s unwanted record  news.com.auTamim century puts Bangladesh in control  Newcastle HeraldMatthews misses double-ton as Nayeem claims six  cricket.com.auAngelo Mathews upbeat despite falling for 199, Bangladesh firm in reply  DAWN.comBangladesh fight back in Test vs Sri Lanka  Newcastle HeraldView Full coverage on Google News","content":null,"pubDate":"2022-05-17 10:38:50","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"MI vs SRH Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Mumbai vs Hyderabad","link":"https://www.indiatvnews.com/sports/cricket/mi-vs-srh-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-mumbai-indians-vs-sunrisers-hyderabad-2022-05-17-777226","keywords":null,"creator":null,"video_url":null,"description":"MI vs SRH Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Mumbai Indians vs Sunrisers Hyderabad Match Details Mumbai Indians vs Sunrisers Hyderabad","content":"2022, Match No. 65 Monday, 7:30 PM Wankhede Stadium, Mumbai Ishan Kishan, Nicholas Pooran(c) Rahul Tripathi, , Tilak Varma (vc), Daniel Sams , T Natarajan, Umran Malik, Riley Meredith Ishan Kishan, Rohit Sharma, Tilak Varma, Ramandeep Singh, Tristan Stubbs, Tim David, Hrithik Shokeen, Daniel Sams, Kumar Kartikeya, Jasprit Bumrah, Riley Meredith , Abhishek Sharma, Rahul Tripathi, Aiden Markram, Nicholas Pooran, Shashank Singh, Washington Sundar, Marco Jansen, , Umran Malik, T Natarajan Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). The match will be streamed live on Hotstar Tuesday, 17th May 7:30 PM IST Wankhede Stadium, Mumbai Abhishek Sharma, Kane Williamson, Rahul Tripathi, Aiden Markram, Nicholas Pooran, Washington Sundar, Shashank Singh, Marco Jansen, Bhuvneshwar Kumar, Umran Malik, T Natarajan, Sean Abbott, Ravikumar Samarth, Shreyas Gopal, Jagadeesha Suchith, Glenn Phillips, Vishnu Vinod, Priyam Garg, Kartik Tyagi, Romario Shepherd, Fazalhaq Farooqi, Abdul Samad, Sushant Mishra Ishan Kishan, Rohit Sharma, Daniel Sams, Tilak Varma, Tristan Stubbs, Hrithik Shokeen, Tim David, Ramandeep Singh, Kumar Kartikeya, Jasprit Bumrah, Riley Meredith, Kieron Pollard, , Murugan Ashwin, Fabian Allen, Basil Thampi, Anmolpreet Singh, Sanjay Yadav, Mayank Markande, Aryan Juyal, Arjun Tendulkar, Akash Madhwal, Rahul Buddhi, Dewald Brevis","pubDate":"2022-05-17 10:31:38","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"More turbulence in English cricket’s leadership as CEO quits","link":"https://indianexpress.com/article/sports/cricket/more-turbulence-in-english-crickets-leadership-as-ceo-quits-7921962/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"A turbulent period for English cricket saw another high-profile departure among its leadership on Tuesday when chief executive Tom Harrison announced he will be stepping down. Since the turn of the year, the men’s test captain, head coach, director of cricket and now the CEO have all left their roles as the England and Wales Cricket Board launches a so-called “red-ball reset” amid troubling times for the test team. Harrison has faced some of the blame for that, having prioritized the shorter formats of the game in search of greater revenue streams during his more than seven years as chief executive. That included being a key driver behind the introduction of the Hundred, a new competition created to broaden the audience of the sport and placed at the heart of the British summer — perhaps to the detriment of test cricket. https://images.indianexpress.com/2020/08/1x1.png Harrison, who joined the ECB from sports marketing giant IMG in January 2015, had to navigate English cricket through a pandemic that created unprecedented financial challenges and then a racism scandal sparked by complaints by former player Azeem Rafiq. Best of Express Premium Premium Skyfall in Gujarat, expert says likely debris of a Chinese rocket Premium Chaos in Kandla after ban: 4,000 wheat trucks in queue, 4 ships half-full Premium Rural pinches more in high inflation states Premium Explained: What Bilawal Bhutto Zardari’s US visit means for Pakista... More Premium Stories >> The ECB said in a statement announcing Harrison’s departure next month that a “key part” of the role for his replacement will be making cricket “a welcoming and diverse sport, including through the continued implementation of the action plan agreed in November 2021 to drive out discrimination within the game.” Clare Connor, who is currently managing director of women’s cricket in England, will replace Harrison on an interim basis. The ECB said its annual revenue almost tripled during Harrison’s tenure. Chief Executive Officer Tom Harrison will leave the ECB in June after more than seven years in the role. — England and Wales Cricket Board (@ECB_cricket) May 17, 2022 “The past two years have been incredibly challenging,” Harrison said, “but we have pulled together to get through the pandemic, overcome cricket’s biggest financial crisis, and committed to tackling discrimination and continuing the journey towards becoming the inclusive, welcoming sport we strive to be. “I have put everything into this role, but I believe now is the right time to bring in fresh energy to continue this work.”","pubDate":"2022-05-17 10:25:34","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Tom Harrison stepping down as chief executive of the ECB","link":"https://uk.sports.yahoo.com/news/tom-harrison-stepping-down-chief-094449272.html?src=rss","keywords":["Sports"],"creator":["PA Media: Sport"],"video_url":null,"description":"Managing director of women’s cricket Clare Connor will take over on an interim basis in June.","content":"Managing director of women’s cricket Clare Connor will take over on an interim basis in June.","pubDate":"2022-05-17 10:11:01","image_url":null,"source_id":"yahoo_hk","country":["hong kong"],"category":["sports"],"language":"chinese"},{"title":"Tom Harrison To Step Down As ECB CEO","link":"https://sports.ndtv.com/cricket/tom-harrison-to-step-down-as-ecb-ceo-clare-connor-to-hold-post-for-time-being-2983380","keywords":null,"creator":null,"video_url":null,"description":"England and Wales Cricket Board on Tuesday confirmed that Tom Harrison would be stepping down from the position of CEO","content":null,"pubDate":"2022-05-17 10:04:23","image_url":"https://c.ndtvimg.com/2021-11/5c5tq92g_tom-harrison-afp_625x300_19_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Guwahati: Nihad Islam Clinches Rapid Chess Tournament's Title","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/guwahati-nihad-islam-clinches-rapid-chess-tournaments-title-592451","keywords":["Breaking News,Sports,Local Sports,Feature,News Ticker"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Dhanyata Goswami got the first position in the under-7 category by scoring 3 points. Divyansh Deb also scored 3points but he was declared second on the basis of the tie-break score.","content":"Guwahati: Nihad Islam Hazarika on Sunday clinched the title in Rapid Chess Tournament organized by Guwahati Chess Academy on 15th May 2022 at Academy premises at R G Baruah Road, Guwahati. Nihad scored 5.5 points from 6 rounds and remains unbeaten throughout the tournament. In the final rounds, he beat Rishav Barman. Nalinakhya Kashyap got the second position by scoring 5 points. However, Prakash Nath, Jagajit Sinha and Subhangpran Kashyap also scored 5 points each but placed third, fourth, and fifth according to their tie-break score.Dhanyata Goswami got the first position in the under-7 category by scoring 3 points. Divyansh Deb also scored 3points but he was declared second on the basis of the tie-break score. Praharsh Choudhury got the third position in this category with 2 points. In the under-9 category, Agnij Bora scored 4 points and got the first position while Hriyan Kaushik Thakuria and Neehar Das both scored 3 points each and were declared second and third respectively on the basis of their tie-break score. Swapnil Kar got the First Position in the under-11 category as he scored 4 points. Nibhriti Goswami scored 3 points and got the second position in this category. Shaunak Bhowmick also scored 3 points and got the third position on the basis of the tie-break score.Shivam Dutta scored 4 points and got the first position in the under-13 category while Suhan Pati also scored 4 points but he was declared second on the basis of the tie-break score. Pratyush Pathak got the third position by scoring 3.5 points in this category. Chiranjib Goswami got the first position by scoring 4 points in the under-15 category and Jyon Jyotishman Saikia got the second position in this category by scoring 3 points. Altogether, 41 players, including 6 International Fide Rated players participated. The tournament was conducted in the Swiss league system for 6 rounds. The top five players were awarded cash prizes and trophies. Senior National Arbiter Pranab Kumar Nath conducted the tournament as Chief Arbiter and he is ably assisted by Kh Jintu Singha as Deputy Arbiter. Also read: Rain disturbs Nuruddin Inter District Cricket Tournament scheduleAlso watch:","pubDate":"2022-05-17 10:03:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/05/17/346782-whatsapp-image-2022-05-17-at-25343-pm.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}