{"newsArray":[{"article_id":"789d5b182bf992385162915a8e974e2d","title":"ICC suspension of Sri Lanka Cricket stays, funding restricted","link":"https://www.ft.lk/sports/ICC-suspension-of-Sri-Lanka-Cricket-stays--funding-restricted/23-755481","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The International Cricket Council (ICC) Board convened on 21 November 2023 in Ahmedabad where the question of Sri Lanka’s suspension from the ICC was taken up. Participating in the proceedings as an observer, the SLC President Shammi Silva urged the Board to grant additional time for the Sri Lankan Government to rectify the issue of political interference in cricket. However, the ICC Board, taking cognisance of similar suspensions imposed by World Rugby and FIFA in response to political interference, concluded that ample time had already been afforded to the Sri Lankan Government to address and rectify the issue. Consequently, the Board confirmed the suspension of Sri Lanka Cricket. As such, the suspension of Sri Lanka Cricket will persist until the appointment of the Interim Committee to take over the functions of SLC remains in force. Consequently, the ICC Men’s Under-19 World Cup, initially awarded to Sri Lanka and to be held in January and February 2024, will now be awarded to South Africa. Further, the ICC Annual Conference scheduled to be held in Colombo in July 2024 will also be shifted. Funding to SLC during the suspension will also be severely restricted. The Board decided not to recognize any interim committee and will continue to recognise the elected office bearers of SLC, albeit in an observer capacity due to the suspension. However, pursuant to SLC President Shammi Silva’s fervent appeal to the Members, the ICC Board has carved out an exception permitting Sri Lanka to compete internationally in bilateral and ICC events, despite the suspension.","pubDate":"2023-11-22 00:20:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"16e20349b98f01e44c3772bef43ffd74","title":"ICC moves U-19 World Cup from SL to South Africa","link":"https://www.ft.lk/sports/ICC-moves-U-19-World-Cup-from-SL-to-South-Africa/23-755480","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The ICC Men’s U19 Cricket World Cup 2024 in January will be held in South Africa after the ICC Board that met today confirmed Sri Lanka would be replaced as hosts. Sri Lanka Cricket (SLC) was recently suspended by the ICC for breaching its obligations as a Member, namely for failing to manage its affairs autonomously and without government interference. It was revealed after the board meeting that Sri Lanka can continue to compete internationally both in bilateral cricket and ICC events, however funding to SLC will be controlled by the ICC and as a result, the U19 event has been moved to the same country that hosted the Women’s U19 T20 World Cup earlier this year. The upcoming World Cup marks the 15th edition of the U19 men’s event, following the last tournament in the West Indies in 2022 where India clinched the title for the fifth time. India will have to put their best foot forward with 15 other teams vying to get their hands on the coveted trophy. A revised tournament format has been introduced which includes a new Super Six stage after the Group stage to determine the semi-finalists. The 16 participating teams have been divided into four groups of four. Defending Champions India are joined by Bangladesh, Ireland and USA in Group A. Group B features England, South Africa, West Indies and Scotland. Group C consists of Australia, Sri Lanka, Zimbabwe and Namibia while Afghanistan, Pakistan, New Zealand and Nepal make up Group D. The tournament, which starts in January, will consist of 41 matches with the Final to be staged in February.","pubDate":"2023-11-22 00:10:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6c9ea864f8734567e36e159d19024b97","title":"Suryakumar to lead India in T20I series against Australia","link":"https://www.ft.lk/sports/Suryakumar-to-lead-India-in-T20I-series-against-Australia/23-755479","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Suryakumar Yadav The Board of Control for Cricket in India (BCCI) have named an experienced T20 performer as the captain of the team for the five-game T20I series against Australia. Suryakumar Yadav was named as the captain of the side which will take on Australia in the five T20I home series. Fast bowler Prasidh Krishna, who was a late entrant to the World Cup squad, is also a part of the squad. A majority of the members of the ICC Men’s Cricket World Cup 2023 have been rested after the gruelling tournament and the build-up to it. Only three players – Suryakumar, Prasidh and Ishan Kishan – will play in the upcoming T20I series. On the other hand, Hardik Pandya who has led India in recent times, is still in recovery mode after his injury and didn’t make the squad. The all-rounder injured himself during India’s league stage ICC Men’s Cricket World Cup encounter against Bangladesh in Pune. Pacer Jasprit Bumrah, who had led India in his comeback T20I series against Ireland, has been rested after a high-intensity World Cup campaign. Suryakumar has been a prolific performer in the T20I format, having scored 1841 runs at an average of 46.02 and a strike rate of 172.7. He also has three T20I centuries to his name. The series also marks the return of Axar Patel, who was initially named in the World Cup squad but was later ruled out due to injury. India squad: Captain Suryakumar Yadav, Vice-Captain Ruturaj Gaikwad, Ishan Kishan, Yashasvi Jaiswal, Tilak Varma, Rinku Singh, Jitesh Sharma (wk), Washington Sundar, Axar Patel, Shivam Dube, Ravi Bishnoi, Arshdeep Singh, Prasidh Krishna, Avesh Khan, Mukesh Kumar. The series runs from 23 November to 3 December.","pubDate":"2023-11-22 00:08:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"711ac0d754feef41e6f819447f37daf7","title":"Cummins, Warner skip India T20I series","link":"https://www.ft.lk/sports/Cummins--Warner-skip-India-T20I-series/23-755478","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Australia have suffered a blow ahead of their T20I series against India, with news that experienced opener David Warner will return home and miss the five-game series. Warner played a pivotal part in helping Australia to a sixth ICC Men’s Cricket World Cup title earlier this month, with the left-hander scoring 535 runs at an average of 48.63 for Pat Cummins’ side. The veteran was expected to stay in the sub-continent and take part in the T20I series against India, but has instead opted to head home. “Selectors decided Warner would return home on the back of a successful yet demanding World Cup campaign,” Cricket Australia said via a statement. Warner’s place in Australia’s squad will be taken by emerging all-rounder Aaron Hardie, with Matthew Wade stepping up to take the captaincy reins in the absence of Cummins. Seven of Australia’s World Cup winning squad will take part in the T20I series, with Sean Abbott, Travis Head, Josh Inglis, Glenn Maxwell, Steve Smith, Marcus Stoinis and Adam Zampa all staying in India alongside reserve spinner Tanveer Sangha. The first T20I of the five-game series commences in Vishakhapatnam on Thursday. Australia T20 squad: Matthew Wade (c), Aaron Hardie, Jason Behrendorff, Sean Abbott, Tim David, Nathan Ellis, Travis Head, Josh Inglis, Glenn Maxwell, Tanveer Sangha, Matt Short, Steve Smith, Marcus Stoinis, Kane Richardson, Adam Zampa","pubDate":"2023-11-22 00:04:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"7c7468abf9a9c745e9e9ef0fa3d9dd73","title":"West Indies name squad for England as preparations begin for 2027 World Cup","link":"https://www.ft.lk/sports/West-Indies-name-squad-for-England-as-preparations-begin-for-2027-World-Cup/23-755477","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Shai Hope West Indies’ preparations for the next ICC Men’s Cricket World Cup has begun as the Caribbean side named a 15-player squad for next month’s ODI series at home against England. The two-time World Cup winners failed to qualify for the recently concluded 50-over showcase in India and will be keen to atone when the next tournament is held in South Africa and Namibia in 2027. Chief selector and former opener Desmond Haynes indicated the West Indies were focused on rebuilding to make an impact at the next World Cup and their squad selection backs up this premise as they included a handful of surprise choices among their playing group that will take on England. Shai Hope remains as captain with fast bowler Alzarri Joseph promoted to vice-captain, while veteran quick Jason Holder and white-ball specialist Nicholas Pooran are sidelined as they prepare for Test campaigns and next year’s ICC Men’s T20 World Cup respectively. It paves the way for uncapped all-rounders Sherfane Rutherford and Matthew Forde to earn a place in the squad, while Shane Dowrich and Kjorn Ottley are also included. Haynes is looking forward to welcoming England to the Caribbean, with the first of three matches in the series to commence in Antigua on 3 December. “England on tour of the West Indies is always filled with excitement and expectation,” Haynes said. “We expect this to be a hard-fought series, but we also believe this squad will do well in our home conditions. We have a clear vision. We are focused on building a solid team. Our main focus is to rebuild for success at the ICC Cricket World Cup 2027.” The West Indies will prepare for the England series with a camp in Antigua over the coming days and new coach Daren Sammy is hoping the time spent together as teammates will help his side immensely. “Everyone is fully aware of what is required as we prepare to face England on our home soil,” Sammy said. “The camp will be detailed and based on specifics that we have identified will be required if we are to be successful at the international level. We will have high-intensity, purposeful training sessions and everything that we do will be geared towards improving and winning. “I believe in preparation. I believe when you prepare well you give yourself the best chance of winning. When you do the hard work, the right kind of work, when you fine-tune your skills that will add value to your game.” West Indies squad: Shai Hope (c), Alzarri Joseph (vc), Alick Athanaze, Yannic Cariah, Keacy Carty, Roston Chase, Shane Dowrich, Matthew Forde, Shimron Hetmyer, Brandon King, Gudakesh Motie, Kjorn Ottley, Sherfane Rutherford, Romario Shepherd, Oshane Thomas.","pubDate":"2023-11-22 00:02:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"87cef43de7138bfdd2631a369bf0dba2","title":"Record-breaking 1.25 million spectators turn out for ICC Men’s Cricket World Cup 2023","link":"https://www.ft.lk/sports/Record-breaking-1-25-million-spectators-turn-out-for-ICC-Men-s-Cricket-World-Cup-2023/23-755476","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The ICC Men’s Cricket World Cup 2023 has made history by being the most attended ICC event ever, after 1,205,307 fans passed through the turnstiles to witness the biggest Cricket World Cup, culminating in Australia winning a remarkable sixth title. With six games to go the spectator figures had already surpassed the one million marks with the momentum escalating as the World Cup culminated in front of a packed crowd at the Narendra Modi Stadium in Ahmedabad on Sunday. The event which ran from 5 October to 19 November and promised to place fans at the centre of the action recorded the biggest attendance for a Men’s Cricket World Cup opening match when England faced New Zealand in a repeat of the 2019 final, followed by the most attended India against Pakistan fixture in ICC World Cup history when fans flocked through the turnstiles on 14 October. The figure of over 1.25 million fans is a new benchmark in the history of cricket, surpassing the attendance figures of any other ICC event. The ICC Men’s Cricket World Cup 2015, held in Australia and New Zealand, witnessed 1,016,420 spectators, while the 2019 edition in England and Wales saw 752,000 fans come through the turnstiles. The 13th edition of the Men’s Cricket World Cup held in India has eclipsed these figures as well as breaking multiple broadcast and digital viewership records, proving the global reach and ever-growing popularity of the sport. ICC Head of Events Chris Tetley said, “The ICC Men’s Cricket World Cup 2023 has been a great success, showcasing the best aspects of the game and capturing the hearts of hundreds of millions of fans across the world. The staggering attendance demonstrates the enduring appeal of cricket and the excitement the ODI format continues to offer. It has been an event that has not only entertained but also united cricket fans globally in a celebration of the sport.ICC events play an important part in growing our game and inspiring the next generation of fans and players around the world. We would like to thank all the fans who contributed to making the ICC Men’s Cricket World Cup 2023 such a resounding success and look forward to sharing more thrilling experiences for everyone in future ICC events.”","pubDate":"2023-11-22 00:00:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"160dd6ea95b58a7c96446ce7d9a5d459","title":"Papers: Newcastle and Arsenal target Neves has no interest in Jan PL return","link":"https://www.skysports.com/football/news/20876/13013329/newcastle-and-arsenal-target-ruben-neves-has-no-interest-in-a-premier-league-january-return-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"The top stories and transfer rumours from Wednesday's newspapers...","content":"The top stories and transfer rumours from Wednesday's newspapers... DAILY MIRROR Ruben Neves has no interest in returning to the Premier League in the January transfer window despite interest from Arsenal and Newcastle. John Barnes has launched a strong defence of Jordan Henderson's Saudi Arabia move insisting footballers shouldn't be judged any different from other sports stars. Please use Chrome browser for a more accessible video player Wrexham have been urged to sign Billy Sharp - despite the Championship icon's heated row with the Welsh club in February. England have qualified top of their group for Euro 2024, but Gareth Southgate's side could still be handed a difficult draw for next year's tournament. Bernardo Silva has admitted he would \"put a wedge in\" for Manchester City to sign Joao Neves as the latter continues to be linked with a move to Manchester United. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Cristiano Ronaldo has hit back at Fabio Paim after the former Sporting CP academy starlet claimed the multi-time Ballon d'Or winner should give him one of his trophies. THE TIMES The FA has said it is prepared to review evidence of potentially serious breaches of agent rules in a transfer involving Tottenham Hotspur, Portsmouth and Jermain Defoe. Richard Cockerill has been sacked as Montpellier head coach after seven matches in charge. Wayne Barnes, the Rugby World Cup final referee, has suggested introducing a shot clock that would force teams to take a lineout within 20 seconds. The same independent commission that imposed a 10-point deduction on Everton will also decide if other clubs should receive tens of millions of pounds in compensation for financial damages connected to the case. THE SUN Raphael Varane is set to leave Manchester United - but it won't be until the summer. A North Korean star has reappeared three years after making his last appearance. The BBC are in danger of losing the rights to show the Six Nations. An Indian cricket fan has tragically died aged 35 after suffering a heart attack shortly after Sunday's World Cup final. Manchester United and Chelsea have been dealt a blow in their pursuit of Roony Bardghji. Roberto De Zerbi has reportedly been approached to takeover as Real Madrid manager. DAILY EXPRESS David de Gea reportedly has no intention of moving to Saudi Arabia, but would be open to heading to the MLS if an opportunity arose. Fulham have been pegged back in their pursuit of Brazilian midfielder Andre, with Fluminense set to demand at least £30m for his signature. Tottenham are among a host of top teams keeping tabs on Atalanta youngster Giorgio Scalvini. Chelsea have a gentleman's agreement with Romelu Lukaku that he can leave Stamford Bridge for £35m. A quarter of football fans reckon they have an \"encyclopaedic\" knowledge of the game - and can reel off facts about club history, stadiums, and pundits. EVENING STANDARD Christopher Nkunku is closing in on his Chelsea debut after missing the start of the season due to a knee injury. Arsenal have already secured the future of viral sensation Chido Obi-Martin. Kai Havertz says he is \"happy\" at Arsenal following a divisive £65m from Chelsea. Please use Chrome browser for a more accessible video player THE GUARDIAN A section of Manchester United players believe the team's poor start is down to Erik ten Hag overworking the squad in pre-season. DAILY RECORD Anxious Scottish football bosses are to draw up battle plans to boot pyrotechnics out of the game amid growing safety fears for fans and players. Victor Osimhen would probably pick Chelsea over Tottenham if he were to leave Napoli. Rangers youngster Ross McCausland is reportedly garnering interest from Serie A. SCOTTISH SUN Celtic are on the trail of South African wonderkid Luke Baartman. Ridvan Yilmaz is weighing up his future at Rangers, according to a report. Rangers are keen to tie down breakout star Ross McCausland to a new contract. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-21 22:35:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a904a63df77b8ae9cfc8c9175316a5c3","title":"Gareth Southgate up for another Scotland showdown as England boss keen on Euro 2024 clash with 'extra edge'","link":"https://www.dailyrecord.co.uk/sport/football/gareth-southgate-up-another-scotland-31496672","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (John Cross)"],"video_url":null,"description":"The Three Lions boss would be up for a battle again at the Euros after their last tournament showdown.","content":"Gareth Southgate, Head Coach of England (Image: Getty Images) Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Gareth Southgate would relish locking horns again with Scotland in a Euros rerun. Southgate’s England will be in Pot One, while Steve Clarke’s Scots are third seeds for the big draw on December 2. That could see the Auld Enemy clash in Germany – just like they did at Wembley in Euro 2021. And Southgate is licking his lips at the prospect of going toe-to-toe with Clarke’s heroes. He said: “Always for the fans, those games (with Scotland) have that extra edge, don’t they? But from our own perspective, we’re just content with whatever comes out and we just have to deal with it.” While Southgate would enjoy a reunion with the Tartan Army, he knows there are plenty of other threats lurking in the draw, with the likes of the Netherlands alongside Scotland in Pot Three. He said: “There look like being really strong teams in Pot Two and Pot Three looks like it could also be very strong. They’re all different sorts of challenges. Read More Related Articles Euro 2024 pots in full as Scotland handed clear picture with Croatia in Pot 3 and Wales forced in to play-off Read More Related Articles SPFL hatch plan to stop pyro madness as Rangers fans display 'crossed a line' and thrusts issue into urgency mode “In the last Euros we had Croatia in with us, who proved to be one of the best teams in the world over the last few years and we managed to navigate that so we’ve just got to be ready for whatever comes our way.” Next month’s draw will determine where teams are based for games, but Southgate admitted England won’t be heading back to Baden Baden, which was their HQ at the 2006 World Cup and where partying by the WAGs, including the likes of Posh Spice, hit the headlines. Asked about a return, the Three Lions boss smiled: “Well… no! \"Really somewhere where we can be a little bit on our own. You basically want to be somewhere where you can zone out from everything that’s going on around you, but with facilities that are good for working We also want their families to be able to enjoy the tournament.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Scotland football team England football team Euro 2024 Steve Clarke Victoria Beckham Armed forces Tartan Tartan Army England Cricket Team Scotland U19s football team","pubDate":"2023-11-21 22:30:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31496676.ece/ALTERNATES/s615/0_North-Macedonia-v-England-Group-C-UEFA-EURO-2024-European-Qualifiers.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bc8d1d8476fe16f7c6a6561ae5186687","title":"Win over Manawatū tops the list","link":"https://times-age.co.nz/sports/win-over-manawatu-tops-the-list/","keywords":["Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Good cricket and golf, the Breakers at breaking point, and points deductions highlight this week’s eagerly anticipated dose of ‘Good, Bad and Ugly’. GOOD Any win in cricket over our nearest neighbours, Manawatū, is worth celebrating, but the manner in which Post Office Hotel Wairarapa dominated their opponents in the weekend’s Furlong Cup match at […]","content":"Any win in cricket over our nearest neighbours, Manawatū, is worth celebrating, but the manner in which Post Office Hotel Wairarapa dominated their opponents in the weekend’s Furlong Cup match at the Oval was impressive. After dismissing the visitors for 130, Wairarapa built a 97-run lead and had Manawatū battling at 62–3 when rain brought a premature end. Could this be the momentum needed for a big push for a Hawke Cup challenge? Masterton golfer Ben Campbell makes the cut in this column for the second straight week, but making the cut in the Indonesian Masters looked a forlorn hope when he was tied for 93rd on two over after the first 18 holes. Rounds of 65, 63, and 65 saw Campbell rocket up the leaderboard to finish third for another tasty payday following on from his win in the Hong Kong Open. I’m not the biggest fan of Aussie cricketers, mainly due to their Ocker cockiness more than their playing prowess, but one has to admire their ability to continually peak at the right time when the big prizes are on the line. World Cup number six was the result, and how good was Travis Head and his match-winning 137? Very, very good, and to top it, he was remarkably un-Aussie cricketer-like and very humble. Only India could get away with changing pitches at an ICC-controlled tournament, but did they? It worked in Mumbai against the Black Caps in the semifinal. As the saying goes, what goes around comes around and the change to a used pitch for the final at Ahmedabad bit the hosts fair and squarely on the bum. Now, is that a good thing or a bad thing? Indian Prime Minister Narendra Modi’s lack of class in begrudgingly presenting the World Cup to Pat Cummings and then leaving the Aussie skipper stranded on the podium by himself. Modi’s body language said it all about what he thought of the result. Everton being deducted 10 points and dropped into the relegation zone by an independent commission for breaching the English Premier League’s financial rule is bad for the club and bad for the EPL. That’s unless, of course, you’re from the “red side” of town, and you might think it’s a good thing. The Toffees are likely to appeal the decision, while a Liverpool MP Ian Byrne has taken the matter to parliament, saying the punishment is “grossly unfair”. What is likely, though, is that the saga could open a big can of worms, with relegated clubs from the last two seasons [Leicester, Leeds and Burnley] threatening to sue Everton for millions of pounds of damages. There could also be bigger clubs in the firing line, with Chelsea and Manchester City two of the big names being bandied about [now that might not be a bad thing]. Top it off with the countless controversies over the officiating and influence of VAR, and the EPL is quickly turning into an ugly beast. What is going on at the NZ Breakers? Last season’s ANBL runners-up are a shambles and are heading to the depths of despair after going down 69–65 to cellar dwellers the Illawarra Hawks in Auckland and a record of three and seven. It doesn’t get much uglier. The ugly goings on at Australian Rugby were brought to a head with the sacking of chairman Hamish McLennan, which, according to most reports, is a good thing for rugby on both sides of the Tasman.","pubDate":"2023-11-21 21:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/11/RS511564_24_sam_Payne-e1700548172551-1024x647.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"a1af08c1a6df564cee795c632d57c8e4","title":"Under-19 World Cup shifted to South Africa","link":"https://www.dailynews.lk/2023/11/22/sports/247857/under-19-world-cup-shifted-to-south-africa/","keywords":["Sports","2000 ICC under 19 world cup","2006 ICC under 19 world cup","administrative uncertainty","Ahmedabad meeting","Cricket South Africa","CSA","ICC","International Cricket Council","November 10 decision","Oman","SA-20","Shammi Silva","SLC suspension","South Africa","Sri Lanka","UAE","Under 19 World Cup"],"creator":["malinga"],"video_url":null,"description":"The International Cricket Council (ICC) has moved the Under 19 World Cup to South Africa from Sri Lanka. The ICC board also… The post Under-19 World Cup shifted to South Africa appeared first on DailyNews.","content":"The International Cricket Council (ICC) has moved the Under 19 World Cup to South Africa from Sri Lanka. The ICC board also decided that the Sri Lanka team will continue to play international cricket despite the suspension of SLC. The game will be run through the suspended SLC, which will receive controlled funding. SLC Chief Shammi Silva is of the opinion that the confusion could have been avoided but said cricket in the country will remain uninterrupted. This was decided at the discussion at the meeting of ICC Board Directors held in Ahmedabad yesterday. “I have requested the ICC board to allow the game to continue and the members have upheld our request, ” added SLC chief. He also confirmed that Sri Lanka Under-19 team will take part in the U-19 World Cup in South Africa. The decision has been taken by the ICC board in view of the administrative uncertainty in Sri Lanka Cricket. After a detailed deliberations, the board has decided to uphold the November 10 decision to suspend the SLC. The ICC Directors board said that cricket in the island nation will continue uninterrupted, the suspension, however, will not be overturned. “It was a unanimous decision by the board that the suspension cannot be lifted. Cricket in the country will continue as normal. The SLC Chief Sammi Silva, the ousted president of the SLC, has attended the board meeting while SLC CEO Ashley de Silva also was there at ICC invitees. Meanwhile, the Under-19 World Cup was scheduled to take place between January 14 and February 15. The dates will clash with the second edition of SA-20, which runs from January 10 to February 10 but a top Cricket South Africa (CSA) senior official told that both events can be conducted simultaneously as the T20 league is being overseen autonomously by a body independent of CSA. The option of holding the event in Oman and UAE were also considered, but South Africa was preferred because of their infrastructure: the requirement was three grounds, and Oman only has one. Furthermore, moving the teams between UAE and Oman would have been an expensive proposition and the Board finally decided on South Africa. CSA has agreed to spare three venues for the mutli-nation championship which is good platform for under 19 cricketers. Sri Lanka hosted ICC under 19 world cup in year 2000 where Sri Lanka became runners up losing to India in the final and once again Sri Lanka hosted this event in 2006 and this would have been the third time if they got the nod from ICC.","pubDate":"2023-11-21 19:40:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"789d5b182bf992385162915a8e974e2d","title":"ICC suspension of Sri Lanka Cricket stays, funding restricted","link":"https://www.ft.lk/sports/ICC-suspension-of-Sri-Lanka-Cricket-stays--funding-restricted/23-755481","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The International Cricket Council (ICC) Board convened on 21 November 2023 in Ahmedabad where the question of Sri Lanka’s suspension from the ICC was taken up. Participating in the proceedings as an observer, the SLC President Shammi Silva urged the Board to grant additional time for the Sri Lankan Government to rectify the issue of political interference in cricket. However, the ICC Board, taking cognisance of similar suspensions imposed by World Rugby and FIFA in response to political interference, concluded that ample time had already been afforded to the Sri Lankan Government to address and rectify the issue. Consequently, the Board confirmed the suspension of Sri Lanka Cricket. As such, the suspension of Sri Lanka Cricket will persist until the appointment of the Interim Committee to take over the functions of SLC remains in force. Consequently, the ICC Men’s Under-19 World Cup, initially awarded to Sri Lanka and to be held in January and February 2024, will now be awarded to South Africa. Further, the ICC Annual Conference scheduled to be held in Colombo in July 2024 will also be shifted. Funding to SLC during the suspension will also be severely restricted. The Board decided not to recognize any interim committee and will continue to recognise the elected office bearers of SLC, albeit in an observer capacity due to the suspension. However, pursuant to SLC President Shammi Silva’s fervent appeal to the Members, the ICC Board has carved out an exception permitting Sri Lanka to compete internationally in bilateral and ICC events, despite the suspension.","pubDate":"2023-11-22 00:20:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"16e20349b98f01e44c3772bef43ffd74","title":"ICC moves U-19 World Cup from SL to South Africa","link":"https://www.ft.lk/sports/ICC-moves-U-19-World-Cup-from-SL-to-South-Africa/23-755480","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The ICC Men’s U19 Cricket World Cup 2024 in January will be held in South Africa after the ICC Board that met today confirmed Sri Lanka would be replaced as hosts. Sri Lanka Cricket (SLC) was recently suspended by the ICC for breaching its obligations as a Member, namely for failing to manage its affairs autonomously and without government interference. It was revealed after the board meeting that Sri Lanka can continue to compete internationally both in bilateral cricket and ICC events, however funding to SLC will be controlled by the ICC and as a result, the U19 event has been moved to the same country that hosted the Women’s U19 T20 World Cup earlier this year. The upcoming World Cup marks the 15th edition of the U19 men’s event, following the last tournament in the West Indies in 2022 where India clinched the title for the fifth time. India will have to put their best foot forward with 15 other teams vying to get their hands on the coveted trophy. A revised tournament format has been introduced which includes a new Super Six stage after the Group stage to determine the semi-finalists. The 16 participating teams have been divided into four groups of four. Defending Champions India are joined by Bangladesh, Ireland and USA in Group A. Group B features England, South Africa, West Indies and Scotland. Group C consists of Australia, Sri Lanka, Zimbabwe and Namibia while Afghanistan, Pakistan, New Zealand and Nepal make up Group D. The tournament, which starts in January, will consist of 41 matches with the Final to be staged in February.","pubDate":"2023-11-22 00:10:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6c9ea864f8734567e36e159d19024b97","title":"Suryakumar to lead India in T20I series against Australia","link":"https://www.ft.lk/sports/Suryakumar-to-lead-India-in-T20I-series-against-Australia/23-755479","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Suryakumar Yadav The Board of Control for Cricket in India (BCCI) have named an experienced T20 performer as the captain of the team for the five-game T20I series against Australia. Suryakumar Yadav was named as the captain of the side which will take on Australia in the five T20I home series. Fast bowler Prasidh Krishna, who was a late entrant to the World Cup squad, is also a part of the squad. A majority of the members of the ICC Men’s Cricket World Cup 2023 have been rested after the gruelling tournament and the build-up to it. Only three players – Suryakumar, Prasidh and Ishan Kishan – will play in the upcoming T20I series. On the other hand, Hardik Pandya who has led India in recent times, is still in recovery mode after his injury and didn’t make the squad. The all-rounder injured himself during India’s league stage ICC Men’s Cricket World Cup encounter against Bangladesh in Pune. Pacer Jasprit Bumrah, who had led India in his comeback T20I series against Ireland, has been rested after a high-intensity World Cup campaign. Suryakumar has been a prolific performer in the T20I format, having scored 1841 runs at an average of 46.02 and a strike rate of 172.7. He also has three T20I centuries to his name. The series also marks the return of Axar Patel, who was initially named in the World Cup squad but was later ruled out due to injury. India squad: Captain Suryakumar Yadav, Vice-Captain Ruturaj Gaikwad, Ishan Kishan, Yashasvi Jaiswal, Tilak Varma, Rinku Singh, Jitesh Sharma (wk), Washington Sundar, Axar Patel, Shivam Dube, Ravi Bishnoi, Arshdeep Singh, Prasidh Krishna, Avesh Khan, Mukesh Kumar. The series runs from 23 November to 3 December.","pubDate":"2023-11-22 00:08:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"711ac0d754feef41e6f819447f37daf7","title":"Cummins, Warner skip India T20I series","link":"https://www.ft.lk/sports/Cummins--Warner-skip-India-T20I-series/23-755478","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Australia have suffered a blow ahead of their T20I series against India, with news that experienced opener David Warner will return home and miss the five-game series. Warner played a pivotal part in helping Australia to a sixth ICC Men’s Cricket World Cup title earlier this month, with the left-hander scoring 535 runs at an average of 48.63 for Pat Cummins’ side. The veteran was expected to stay in the sub-continent and take part in the T20I series against India, but has instead opted to head home. “Selectors decided Warner would return home on the back of a successful yet demanding World Cup campaign,” Cricket Australia said via a statement. Warner’s place in Australia’s squad will be taken by emerging all-rounder Aaron Hardie, with Matthew Wade stepping up to take the captaincy reins in the absence of Cummins. Seven of Australia’s World Cup winning squad will take part in the T20I series, with Sean Abbott, Travis Head, Josh Inglis, Glenn Maxwell, Steve Smith, Marcus Stoinis and Adam Zampa all staying in India alongside reserve spinner Tanveer Sangha. The first T20I of the five-game series commences in Vishakhapatnam on Thursday. Australia T20 squad: Matthew Wade (c), Aaron Hardie, Jason Behrendorff, Sean Abbott, Tim David, Nathan Ellis, Travis Head, Josh Inglis, Glenn Maxwell, Tanveer Sangha, Matt Short, Steve Smith, Marcus Stoinis, Kane Richardson, Adam Zampa","pubDate":"2023-11-22 00:04:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"7c7468abf9a9c745e9e9ef0fa3d9dd73","title":"West Indies name squad for England as preparations begin for 2027 World Cup","link":"https://www.ft.lk/sports/West-Indies-name-squad-for-England-as-preparations-begin-for-2027-World-Cup/23-755477","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Shai Hope West Indies’ preparations for the next ICC Men’s Cricket World Cup has begun as the Caribbean side named a 15-player squad for next month’s ODI series at home against England. The two-time World Cup winners failed to qualify for the recently concluded 50-over showcase in India and will be keen to atone when the next tournament is held in South Africa and Namibia in 2027. Chief selector and former opener Desmond Haynes indicated the West Indies were focused on rebuilding to make an impact at the next World Cup and their squad selection backs up this premise as they included a handful of surprise choices among their playing group that will take on England. Shai Hope remains as captain with fast bowler Alzarri Joseph promoted to vice-captain, while veteran quick Jason Holder and white-ball specialist Nicholas Pooran are sidelined as they prepare for Test campaigns and next year’s ICC Men’s T20 World Cup respectively. It paves the way for uncapped all-rounders Sherfane Rutherford and Matthew Forde to earn a place in the squad, while Shane Dowrich and Kjorn Ottley are also included. Haynes is looking forward to welcoming England to the Caribbean, with the first of three matches in the series to commence in Antigua on 3 December. “England on tour of the West Indies is always filled with excitement and expectation,” Haynes said. “We expect this to be a hard-fought series, but we also believe this squad will do well in our home conditions. We have a clear vision. We are focused on building a solid team. Our main focus is to rebuild for success at the ICC Cricket World Cup 2027.” The West Indies will prepare for the England series with a camp in Antigua over the coming days and new coach Daren Sammy is hoping the time spent together as teammates will help his side immensely. “Everyone is fully aware of what is required as we prepare to face England on our home soil,” Sammy said. “The camp will be detailed and based on specifics that we have identified will be required if we are to be successful at the international level. We will have high-intensity, purposeful training sessions and everything that we do will be geared towards improving and winning. “I believe in preparation. I believe when you prepare well you give yourself the best chance of winning. When you do the hard work, the right kind of work, when you fine-tune your skills that will add value to your game.” West Indies squad: Shai Hope (c), Alzarri Joseph (vc), Alick Athanaze, Yannic Cariah, Keacy Carty, Roston Chase, Shane Dowrich, Matthew Forde, Shimron Hetmyer, Brandon King, Gudakesh Motie, Kjorn Ottley, Sherfane Rutherford, Romario Shepherd, Oshane Thomas.","pubDate":"2023-11-22 00:02:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"87cef43de7138bfdd2631a369bf0dba2","title":"Record-breaking 1.25 million spectators turn out for ICC Men’s Cricket World Cup 2023","link":"https://www.ft.lk/sports/Record-breaking-1-25-million-spectators-turn-out-for-ICC-Men-s-Cricket-World-Cup-2023/23-755476","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The ICC Men’s Cricket World Cup 2023 has made history by being the most attended ICC event ever, after 1,205,307 fans passed through the turnstiles to witness the biggest Cricket World Cup, culminating in Australia winning a remarkable sixth title. With six games to go the spectator figures had already surpassed the one million marks with the momentum escalating as the World Cup culminated in front of a packed crowd at the Narendra Modi Stadium in Ahmedabad on Sunday. The event which ran from 5 October to 19 November and promised to place fans at the centre of the action recorded the biggest attendance for a Men’s Cricket World Cup opening match when England faced New Zealand in a repeat of the 2019 final, followed by the most attended India against Pakistan fixture in ICC World Cup history when fans flocked through the turnstiles on 14 October. The figure of over 1.25 million fans is a new benchmark in the history of cricket, surpassing the attendance figures of any other ICC event. The ICC Men’s Cricket World Cup 2015, held in Australia and New Zealand, witnessed 1,016,420 spectators, while the 2019 edition in England and Wales saw 752,000 fans come through the turnstiles. The 13th edition of the Men’s Cricket World Cup held in India has eclipsed these figures as well as breaking multiple broadcast and digital viewership records, proving the global reach and ever-growing popularity of the sport. ICC Head of Events Chris Tetley said, “The ICC Men’s Cricket World Cup 2023 has been a great success, showcasing the best aspects of the game and capturing the hearts of hundreds of millions of fans across the world. The staggering attendance demonstrates the enduring appeal of cricket and the excitement the ODI format continues to offer. It has been an event that has not only entertained but also united cricket fans globally in a celebration of the sport.ICC events play an important part in growing our game and inspiring the next generation of fans and players around the world. We would like to thank all the fans who contributed to making the ICC Men’s Cricket World Cup 2023 such a resounding success and look forward to sharing more thrilling experiences for everyone in future ICC events.”","pubDate":"2023-11-22 00:00:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"160dd6ea95b58a7c96446ce7d9a5d459","title":"Papers: Newcastle and Arsenal target Neves has no interest in Jan PL return","link":"https://www.skysports.com/football/news/20876/13013329/newcastle-and-arsenal-target-ruben-neves-has-no-interest-in-a-premier-league-january-return-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"The top stories and transfer rumours from Wednesday's newspapers...","content":"The top stories and transfer rumours from Wednesday's newspapers... DAILY MIRROR Ruben Neves has no interest in returning to the Premier League in the January transfer window despite interest from Arsenal and Newcastle. John Barnes has launched a strong defence of Jordan Henderson's Saudi Arabia move insisting footballers shouldn't be judged any different from other sports stars. Please use Chrome browser for a more accessible video player Wrexham have been urged to sign Billy Sharp - despite the Championship icon's heated row with the Welsh club in February. England have qualified top of their group for Euro 2024, but Gareth Southgate's side could still be handed a difficult draw for next year's tournament. Bernardo Silva has admitted he would \"put a wedge in\" for Manchester City to sign Joao Neves as the latter continues to be linked with a move to Manchester United. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Cristiano Ronaldo has hit back at Fabio Paim after the former Sporting CP academy starlet claimed the multi-time Ballon d'Or winner should give him one of his trophies. THE TIMES The FA has said it is prepared to review evidence of potentially serious breaches of agent rules in a transfer involving Tottenham Hotspur, Portsmouth and Jermain Defoe. Richard Cockerill has been sacked as Montpellier head coach after seven matches in charge. Wayne Barnes, the Rugby World Cup final referee, has suggested introducing a shot clock that would force teams to take a lineout within 20 seconds. The same independent commission that imposed a 10-point deduction on Everton will also decide if other clubs should receive tens of millions of pounds in compensation for financial damages connected to the case. THE SUN Raphael Varane is set to leave Manchester United - but it won't be until the summer. A North Korean star has reappeared three years after making his last appearance. The BBC are in danger of losing the rights to show the Six Nations. An Indian cricket fan has tragically died aged 35 after suffering a heart attack shortly after Sunday's World Cup final. Manchester United and Chelsea have been dealt a blow in their pursuit of Roony Bardghji. Roberto De Zerbi has reportedly been approached to takeover as Real Madrid manager. DAILY EXPRESS David de Gea reportedly has no intention of moving to Saudi Arabia, but would be open to heading to the MLS if an opportunity arose. Fulham have been pegged back in their pursuit of Brazilian midfielder Andre, with Fluminense set to demand at least £30m for his signature. Tottenham are among a host of top teams keeping tabs on Atalanta youngster Giorgio Scalvini. Chelsea have a gentleman's agreement with Romelu Lukaku that he can leave Stamford Bridge for £35m. A quarter of football fans reckon they have an \"encyclopaedic\" knowledge of the game - and can reel off facts about club history, stadiums, and pundits. EVENING STANDARD Christopher Nkunku is closing in on his Chelsea debut after missing the start of the season due to a knee injury. Arsenal have already secured the future of viral sensation Chido Obi-Martin. Kai Havertz says he is \"happy\" at Arsenal following a divisive £65m from Chelsea. Please use Chrome browser for a more accessible video player THE GUARDIAN A section of Manchester United players believe the team's poor start is down to Erik ten Hag overworking the squad in pre-season. DAILY RECORD Anxious Scottish football bosses are to draw up battle plans to boot pyrotechnics out of the game amid growing safety fears for fans and players. Victor Osimhen would probably pick Chelsea over Tottenham if he were to leave Napoli. Rangers youngster Ross McCausland is reportedly garnering interest from Serie A. SCOTTISH SUN Celtic are on the trail of South African wonderkid Luke Baartman. Ridvan Yilmaz is weighing up his future at Rangers, according to a report. Rangers are keen to tie down breakout star Ross McCausland to a new contract. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-21 22:35:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a904a63df77b8ae9cfc8c9175316a5c3","title":"Gareth Southgate up for another Scotland showdown as England boss keen on Euro 2024 clash with 'extra edge'","link":"https://www.dailyrecord.co.uk/sport/football/gareth-southgate-up-another-scotland-31496672","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (John Cross)"],"video_url":null,"description":"The Three Lions boss would be up for a battle again at the Euros after their last tournament showdown.","content":"Gareth Southgate, Head Coach of England (Image: Getty Images) Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Gareth Southgate would relish locking horns again with Scotland in a Euros rerun. Southgate’s England will be in Pot One, while Steve Clarke’s Scots are third seeds for the big draw on December 2. That could see the Auld Enemy clash in Germany – just like they did at Wembley in Euro 2021. And Southgate is licking his lips at the prospect of going toe-to-toe with Clarke’s heroes. He said: “Always for the fans, those games (with Scotland) have that extra edge, don’t they? But from our own perspective, we’re just content with whatever comes out and we just have to deal with it.” While Southgate would enjoy a reunion with the Tartan Army, he knows there are plenty of other threats lurking in the draw, with the likes of the Netherlands alongside Scotland in Pot Three. He said: “There look like being really strong teams in Pot Two and Pot Three looks like it could also be very strong. They’re all different sorts of challenges. Read More Related Articles Euro 2024 pots in full as Scotland handed clear picture with Croatia in Pot 3 and Wales forced in to play-off Read More Related Articles SPFL hatch plan to stop pyro madness as Rangers fans display 'crossed a line' and thrusts issue into urgency mode “In the last Euros we had Croatia in with us, who proved to be one of the best teams in the world over the last few years and we managed to navigate that so we’ve just got to be ready for whatever comes our way.” Next month’s draw will determine where teams are based for games, but Southgate admitted England won’t be heading back to Baden Baden, which was their HQ at the 2006 World Cup and where partying by the WAGs, including the likes of Posh Spice, hit the headlines. Asked about a return, the Three Lions boss smiled: “Well… no! \"Really somewhere where we can be a little bit on our own. You basically want to be somewhere where you can zone out from everything that’s going on around you, but with facilities that are good for working We also want their families to be able to enjoy the tournament.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Scotland football team England football team Euro 2024 Steve Clarke Victoria Beckham Armed forces Tartan Tartan Army England Cricket Team Scotland U19s football team","pubDate":"2023-11-21 22:30:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31496676.ece/ALTERNATES/s615/0_North-Macedonia-v-England-Group-C-UEFA-EURO-2024-European-Qualifiers.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bc8d1d8476fe16f7c6a6561ae5186687","title":"Win over Manawatū tops the list","link":"https://times-age.co.nz/sports/win-over-manawatu-tops-the-list/","keywords":["Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Good cricket and golf, the Breakers at breaking point, and points deductions highlight this week’s eagerly anticipated dose of ‘Good, Bad and Ugly’. GOOD Any win in cricket over our nearest neighbours, Manawatū, is worth celebrating, but the manner in which Post Office Hotel Wairarapa dominated their opponents in the weekend’s Furlong Cup match at […]","content":"Any win in cricket over our nearest neighbours, Manawatū, is worth celebrating, but the manner in which Post Office Hotel Wairarapa dominated their opponents in the weekend’s Furlong Cup match at the Oval was impressive. After dismissing the visitors for 130, Wairarapa built a 97-run lead and had Manawatū battling at 62–3 when rain brought a premature end. Could this be the momentum needed for a big push for a Hawke Cup challenge? Masterton golfer Ben Campbell makes the cut in this column for the second straight week, but making the cut in the Indonesian Masters looked a forlorn hope when he was tied for 93rd on two over after the first 18 holes. Rounds of 65, 63, and 65 saw Campbell rocket up the leaderboard to finish third for another tasty payday following on from his win in the Hong Kong Open. I’m not the biggest fan of Aussie cricketers, mainly due to their Ocker cockiness more than their playing prowess, but one has to admire their ability to continually peak at the right time when the big prizes are on the line. World Cup number six was the result, and how good was Travis Head and his match-winning 137? Very, very good, and to top it, he was remarkably un-Aussie cricketer-like and very humble. Only India could get away with changing pitches at an ICC-controlled tournament, but did they? It worked in Mumbai against the Black Caps in the semifinal. As the saying goes, what goes around comes around and the change to a used pitch for the final at Ahmedabad bit the hosts fair and squarely on the bum. Now, is that a good thing or a bad thing? Indian Prime Minister Narendra Modi’s lack of class in begrudgingly presenting the World Cup to Pat Cummings and then leaving the Aussie skipper stranded on the podium by himself. Modi’s body language said it all about what he thought of the result. Everton being deducted 10 points and dropped into the relegation zone by an independent commission for breaching the English Premier League’s financial rule is bad for the club and bad for the EPL. That’s unless, of course, you’re from the “red side” of town, and you might think it’s a good thing. The Toffees are likely to appeal the decision, while a Liverpool MP Ian Byrne has taken the matter to parliament, saying the punishment is “grossly unfair”. What is likely, though, is that the saga could open a big can of worms, with relegated clubs from the last two seasons [Leicester, Leeds and Burnley] threatening to sue Everton for millions of pounds of damages. There could also be bigger clubs in the firing line, with Chelsea and Manchester City two of the big names being bandied about [now that might not be a bad thing]. Top it off with the countless controversies over the officiating and influence of VAR, and the EPL is quickly turning into an ugly beast. What is going on at the NZ Breakers? Last season’s ANBL runners-up are a shambles and are heading to the depths of despair after going down 69–65 to cellar dwellers the Illawarra Hawks in Auckland and a record of three and seven. It doesn’t get much uglier. The ugly goings on at Australian Rugby were brought to a head with the sacking of chairman Hamish McLennan, which, according to most reports, is a good thing for rugby on both sides of the Tasman.","pubDate":"2023-11-21 21:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/11/RS511564_24_sam_Payne-e1700548172551-1024x647.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"a1af08c1a6df564cee795c632d57c8e4","title":"Under-19 World Cup shifted to South Africa","link":"https://www.dailynews.lk/2023/11/22/sports/247857/under-19-world-cup-shifted-to-south-africa/","keywords":["Sports","2000 ICC under 19 world cup","2006 ICC under 19 world cup","administrative uncertainty","Ahmedabad meeting","Cricket South Africa","CSA","ICC","International Cricket Council","November 10 decision","Oman","SA-20","Shammi Silva","SLC suspension","South Africa","Sri Lanka","UAE","Under 19 World Cup"],"creator":["malinga"],"video_url":null,"description":"The International Cricket Council (ICC) has moved the Under 19 World Cup to South Africa from Sri Lanka. The ICC board also… The post Under-19 World Cup shifted to South Africa appeared first on DailyNews.","content":"The International Cricket Council (ICC) has moved the Under 19 World Cup to South Africa from Sri Lanka. The ICC board also decided that the Sri Lanka team will continue to play international cricket despite the suspension of SLC. The game will be run through the suspended SLC, which will receive controlled funding. SLC Chief Shammi Silva is of the opinion that the confusion could have been avoided but said cricket in the country will remain uninterrupted. This was decided at the discussion at the meeting of ICC Board Directors held in Ahmedabad yesterday. “I have requested the ICC board to allow the game to continue and the members have upheld our request, ” added SLC chief. He also confirmed that Sri Lanka Under-19 team will take part in the U-19 World Cup in South Africa. The decision has been taken by the ICC board in view of the administrative uncertainty in Sri Lanka Cricket. After a detailed deliberations, the board has decided to uphold the November 10 decision to suspend the SLC. The ICC Directors board said that cricket in the island nation will continue uninterrupted, the suspension, however, will not be overturned. “It was a unanimous decision by the board that the suspension cannot be lifted. Cricket in the country will continue as normal. The SLC Chief Sammi Silva, the ousted president of the SLC, has attended the board meeting while SLC CEO Ashley de Silva also was there at ICC invitees. Meanwhile, the Under-19 World Cup was scheduled to take place between January 14 and February 15. The dates will clash with the second edition of SA-20, which runs from January 10 to February 10 but a top Cricket South Africa (CSA) senior official told that both events can be conducted simultaneously as the T20 league is being overseen autonomously by a body independent of CSA. The option of holding the event in Oman and UAE were also considered, but South Africa was preferred because of their infrastructure: the requirement was three grounds, and Oman only has one. Furthermore, moving the teams between UAE and Oman would have been an expensive proposition and the Board finally decided on South Africa. CSA has agreed to spare three venues for the mutli-nation championship which is good platform for under 19 cricketers. Sri Lanka hosted ICC under 19 world cup in year 2000 where Sri Lanka became runners up losing to India in the final and once again Sri Lanka hosted this event in 2006 and this would have been the third time if they got the nod from ICC.","pubDate":"2023-11-21 19:40:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"789d5b182bf992385162915a8e974e2d","title":"ICC suspension of Sri Lanka Cricket stays, funding restricted","link":"https://www.ft.lk/sports/ICC-suspension-of-Sri-Lanka-Cricket-stays--funding-restricted/23-755481","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The International Cricket Council (ICC) Board convened on 21 November 2023 in Ahmedabad where the question of Sri Lanka’s suspension from the ICC was taken up. Participating in the proceedings as an observer, the SLC President Shammi Silva urged the Board to grant additional time for the Sri Lankan Government to rectify the issue of political interference in cricket. However, the ICC Board, taking cognisance of similar suspensions imposed by World Rugby and FIFA in response to political interference, concluded that ample time had already been afforded to the Sri Lankan Government to address and rectify the issue. Consequently, the Board confirmed the suspension of Sri Lanka Cricket. As such, the suspension of Sri Lanka Cricket will persist until the appointment of the Interim Committee to take over the functions of SLC remains in force. Consequently, the ICC Men’s Under-19 World Cup, initially awarded to Sri Lanka and to be held in January and February 2024, will now be awarded to South Africa. Further, the ICC Annual Conference scheduled to be held in Colombo in July 2024 will also be shifted. Funding to SLC during the suspension will also be severely restricted. The Board decided not to recognize any interim committee and will continue to recognise the elected office bearers of SLC, albeit in an observer capacity due to the suspension. However, pursuant to SLC President Shammi Silva’s fervent appeal to the Members, the ICC Board has carved out an exception permitting Sri Lanka to compete internationally in bilateral and ICC events, despite the suspension.","pubDate":"2023-11-22 00:20:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"16e20349b98f01e44c3772bef43ffd74","title":"ICC moves U-19 World Cup from SL to South Africa","link":"https://www.ft.lk/sports/ICC-moves-U-19-World-Cup-from-SL-to-South-Africa/23-755480","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The ICC Men’s U19 Cricket World Cup 2024 in January will be held in South Africa after the ICC Board that met today confirmed Sri Lanka would be replaced as hosts. Sri Lanka Cricket (SLC) was recently suspended by the ICC for breaching its obligations as a Member, namely for failing to manage its affairs autonomously and without government interference. It was revealed after the board meeting that Sri Lanka can continue to compete internationally both in bilateral cricket and ICC events, however funding to SLC will be controlled by the ICC and as a result, the U19 event has been moved to the same country that hosted the Women’s U19 T20 World Cup earlier this year. The upcoming World Cup marks the 15th edition of the U19 men’s event, following the last tournament in the West Indies in 2022 where India clinched the title for the fifth time. India will have to put their best foot forward with 15 other teams vying to get their hands on the coveted trophy. A revised tournament format has been introduced which includes a new Super Six stage after the Group stage to determine the semi-finalists. The 16 participating teams have been divided into four groups of four. Defending Champions India are joined by Bangladesh, Ireland and USA in Group A. Group B features England, South Africa, West Indies and Scotland. Group C consists of Australia, Sri Lanka, Zimbabwe and Namibia while Afghanistan, Pakistan, New Zealand and Nepal make up Group D. The tournament, which starts in January, will consist of 41 matches with the Final to be staged in February.","pubDate":"2023-11-22 00:10:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6c9ea864f8734567e36e159d19024b97","title":"Suryakumar to lead India in T20I series against Australia","link":"https://www.ft.lk/sports/Suryakumar-to-lead-India-in-T20I-series-against-Australia/23-755479","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Suryakumar Yadav The Board of Control for Cricket in India (BCCI) have named an experienced T20 performer as the captain of the team for the five-game T20I series against Australia. Suryakumar Yadav was named as the captain of the side which will take on Australia in the five T20I home series. Fast bowler Prasidh Krishna, who was a late entrant to the World Cup squad, is also a part of the squad. A majority of the members of the ICC Men’s Cricket World Cup 2023 have been rested after the gruelling tournament and the build-up to it. Only three players – Suryakumar, Prasidh and Ishan Kishan – will play in the upcoming T20I series. On the other hand, Hardik Pandya who has led India in recent times, is still in recovery mode after his injury and didn’t make the squad. The all-rounder injured himself during India’s league stage ICC Men’s Cricket World Cup encounter against Bangladesh in Pune. Pacer Jasprit Bumrah, who had led India in his comeback T20I series against Ireland, has been rested after a high-intensity World Cup campaign. Suryakumar has been a prolific performer in the T20I format, having scored 1841 runs at an average of 46.02 and a strike rate of 172.7. He also has three T20I centuries to his name. The series also marks the return of Axar Patel, who was initially named in the World Cup squad but was later ruled out due to injury. India squad: Captain Suryakumar Yadav, Vice-Captain Ruturaj Gaikwad, Ishan Kishan, Yashasvi Jaiswal, Tilak Varma, Rinku Singh, Jitesh Sharma (wk), Washington Sundar, Axar Patel, Shivam Dube, Ravi Bishnoi, Arshdeep Singh, Prasidh Krishna, Avesh Khan, Mukesh Kumar. The series runs from 23 November to 3 December.","pubDate":"2023-11-22 00:08:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"711ac0d754feef41e6f819447f37daf7","title":"Cummins, Warner skip India T20I series","link":"https://www.ft.lk/sports/Cummins--Warner-skip-India-T20I-series/23-755478","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Australia have suffered a blow ahead of their T20I series against India, with news that experienced opener David Warner will return home and miss the five-game series. Warner played a pivotal part in helping Australia to a sixth ICC Men’s Cricket World Cup title earlier this month, with the left-hander scoring 535 runs at an average of 48.63 for Pat Cummins’ side. The veteran was expected to stay in the sub-continent and take part in the T20I series against India, but has instead opted to head home. “Selectors decided Warner would return home on the back of a successful yet demanding World Cup campaign,” Cricket Australia said via a statement. Warner’s place in Australia’s squad will be taken by emerging all-rounder Aaron Hardie, with Matthew Wade stepping up to take the captaincy reins in the absence of Cummins. Seven of Australia’s World Cup winning squad will take part in the T20I series, with Sean Abbott, Travis Head, Josh Inglis, Glenn Maxwell, Steve Smith, Marcus Stoinis and Adam Zampa all staying in India alongside reserve spinner Tanveer Sangha. The first T20I of the five-game series commences in Vishakhapatnam on Thursday. Australia T20 squad: Matthew Wade (c), Aaron Hardie, Jason Behrendorff, Sean Abbott, Tim David, Nathan Ellis, Travis Head, Josh Inglis, Glenn Maxwell, Tanveer Sangha, Matt Short, Steve Smith, Marcus Stoinis, Kane Richardson, Adam Zampa","pubDate":"2023-11-22 00:04:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"7c7468abf9a9c745e9e9ef0fa3d9dd73","title":"West Indies name squad for England as preparations begin for 2027 World Cup","link":"https://www.ft.lk/sports/West-Indies-name-squad-for-England-as-preparations-begin-for-2027-World-Cup/23-755477","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Shai Hope West Indies’ preparations for the next ICC Men’s Cricket World Cup has begun as the Caribbean side named a 15-player squad for next month’s ODI series at home against England. The two-time World Cup winners failed to qualify for the recently concluded 50-over showcase in India and will be keen to atone when the next tournament is held in South Africa and Namibia in 2027. Chief selector and former opener Desmond Haynes indicated the West Indies were focused on rebuilding to make an impact at the next World Cup and their squad selection backs up this premise as they included a handful of surprise choices among their playing group that will take on England. Shai Hope remains as captain with fast bowler Alzarri Joseph promoted to vice-captain, while veteran quick Jason Holder and white-ball specialist Nicholas Pooran are sidelined as they prepare for Test campaigns and next year’s ICC Men’s T20 World Cup respectively. It paves the way for uncapped all-rounders Sherfane Rutherford and Matthew Forde to earn a place in the squad, while Shane Dowrich and Kjorn Ottley are also included. Haynes is looking forward to welcoming England to the Caribbean, with the first of three matches in the series to commence in Antigua on 3 December. “England on tour of the West Indies is always filled with excitement and expectation,” Haynes said. “We expect this to be a hard-fought series, but we also believe this squad will do well in our home conditions. We have a clear vision. We are focused on building a solid team. Our main focus is to rebuild for success at the ICC Cricket World Cup 2027.” The West Indies will prepare for the England series with a camp in Antigua over the coming days and new coach Daren Sammy is hoping the time spent together as teammates will help his side immensely. “Everyone is fully aware of what is required as we prepare to face England on our home soil,” Sammy said. “The camp will be detailed and based on specifics that we have identified will be required if we are to be successful at the international level. We will have high-intensity, purposeful training sessions and everything that we do will be geared towards improving and winning. “I believe in preparation. I believe when you prepare well you give yourself the best chance of winning. When you do the hard work, the right kind of work, when you fine-tune your skills that will add value to your game.” West Indies squad: Shai Hope (c), Alzarri Joseph (vc), Alick Athanaze, Yannic Cariah, Keacy Carty, Roston Chase, Shane Dowrich, Matthew Forde, Shimron Hetmyer, Brandon King, Gudakesh Motie, Kjorn Ottley, Sherfane Rutherford, Romario Shepherd, Oshane Thomas.","pubDate":"2023-11-22 00:02:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"87cef43de7138bfdd2631a369bf0dba2","title":"Record-breaking 1.25 million spectators turn out for ICC Men’s Cricket World Cup 2023","link":"https://www.ft.lk/sports/Record-breaking-1-25-million-spectators-turn-out-for-ICC-Men-s-Cricket-World-Cup-2023/23-755476","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The ICC Men’s Cricket World Cup 2023 has made history by being the most attended ICC event ever, after 1,205,307 fans passed through the turnstiles to witness the biggest Cricket World Cup, culminating in Australia winning a remarkable sixth title. With six games to go the spectator figures had already surpassed the one million marks with the momentum escalating as the World Cup culminated in front of a packed crowd at the Narendra Modi Stadium in Ahmedabad on Sunday. The event which ran from 5 October to 19 November and promised to place fans at the centre of the action recorded the biggest attendance for a Men’s Cricket World Cup opening match when England faced New Zealand in a repeat of the 2019 final, followed by the most attended India against Pakistan fixture in ICC World Cup history when fans flocked through the turnstiles on 14 October. The figure of over 1.25 million fans is a new benchmark in the history of cricket, surpassing the attendance figures of any other ICC event. The ICC Men’s Cricket World Cup 2015, held in Australia and New Zealand, witnessed 1,016,420 spectators, while the 2019 edition in England and Wales saw 752,000 fans come through the turnstiles. The 13th edition of the Men’s Cricket World Cup held in India has eclipsed these figures as well as breaking multiple broadcast and digital viewership records, proving the global reach and ever-growing popularity of the sport. ICC Head of Events Chris Tetley said, “The ICC Men’s Cricket World Cup 2023 has been a great success, showcasing the best aspects of the game and capturing the hearts of hundreds of millions of fans across the world. The staggering attendance demonstrates the enduring appeal of cricket and the excitement the ODI format continues to offer. It has been an event that has not only entertained but also united cricket fans globally in a celebration of the sport.ICC events play an important part in growing our game and inspiring the next generation of fans and players around the world. We would like to thank all the fans who contributed to making the ICC Men’s Cricket World Cup 2023 such a resounding success and look forward to sharing more thrilling experiences for everyone in future ICC events.”","pubDate":"2023-11-22 00:00:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"160dd6ea95b58a7c96446ce7d9a5d459","title":"Papers: Newcastle and Arsenal target Neves has no interest in Jan PL return","link":"https://www.skysports.com/football/news/20876/13013329/newcastle-and-arsenal-target-ruben-neves-has-no-interest-in-a-premier-league-january-return-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"The top stories and transfer rumours from Wednesday's newspapers...","content":"The top stories and transfer rumours from Wednesday's newspapers... DAILY MIRROR Ruben Neves has no interest in returning to the Premier League in the January transfer window despite interest from Arsenal and Newcastle. John Barnes has launched a strong defence of Jordan Henderson's Saudi Arabia move insisting footballers shouldn't be judged any different from other sports stars. Please use Chrome browser for a more accessible video player Wrexham have been urged to sign Billy Sharp - despite the Championship icon's heated row with the Welsh club in February. England have qualified top of their group for Euro 2024, but Gareth Southgate's side could still be handed a difficult draw for next year's tournament. Bernardo Silva has admitted he would \"put a wedge in\" for Manchester City to sign Joao Neves as the latter continues to be linked with a move to Manchester United. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Cristiano Ronaldo has hit back at Fabio Paim after the former Sporting CP academy starlet claimed the multi-time Ballon d'Or winner should give him one of his trophies. THE TIMES The FA has said it is prepared to review evidence of potentially serious breaches of agent rules in a transfer involving Tottenham Hotspur, Portsmouth and Jermain Defoe. Richard Cockerill has been sacked as Montpellier head coach after seven matches in charge. Wayne Barnes, the Rugby World Cup final referee, has suggested introducing a shot clock that would force teams to take a lineout within 20 seconds. The same independent commission that imposed a 10-point deduction on Everton will also decide if other clubs should receive tens of millions of pounds in compensation for financial damages connected to the case. THE SUN Raphael Varane is set to leave Manchester United - but it won't be until the summer. A North Korean star has reappeared three years after making his last appearance. The BBC are in danger of losing the rights to show the Six Nations. An Indian cricket fan has tragically died aged 35 after suffering a heart attack shortly after Sunday's World Cup final. Manchester United and Chelsea have been dealt a blow in their pursuit of Roony Bardghji. Roberto De Zerbi has reportedly been approached to takeover as Real Madrid manager. DAILY EXPRESS David de Gea reportedly has no intention of moving to Saudi Arabia, but would be open to heading to the MLS if an opportunity arose. Fulham have been pegged back in their pursuit of Brazilian midfielder Andre, with Fluminense set to demand at least £30m for his signature. Tottenham are among a host of top teams keeping tabs on Atalanta youngster Giorgio Scalvini. Chelsea have a gentleman's agreement with Romelu Lukaku that he can leave Stamford Bridge for £35m. A quarter of football fans reckon they have an \"encyclopaedic\" knowledge of the game - and can reel off facts about club history, stadiums, and pundits. EVENING STANDARD Christopher Nkunku is closing in on his Chelsea debut after missing the start of the season due to a knee injury. Arsenal have already secured the future of viral sensation Chido Obi-Martin. Kai Havertz says he is \"happy\" at Arsenal following a divisive £65m from Chelsea. Please use Chrome browser for a more accessible video player THE GUARDIAN A section of Manchester United players believe the team's poor start is down to Erik ten Hag overworking the squad in pre-season. DAILY RECORD Anxious Scottish football bosses are to draw up battle plans to boot pyrotechnics out of the game amid growing safety fears for fans and players. Victor Osimhen would probably pick Chelsea over Tottenham if he were to leave Napoli. Rangers youngster Ross McCausland is reportedly garnering interest from Serie A. SCOTTISH SUN Celtic are on the trail of South African wonderkid Luke Baartman. Ridvan Yilmaz is weighing up his future at Rangers, according to a report. Rangers are keen to tie down breakout star Ross McCausland to a new contract. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-21 22:35:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a904a63df77b8ae9cfc8c9175316a5c3","title":"Gareth Southgate up for another Scotland showdown as England boss keen on Euro 2024 clash with 'extra edge'","link":"https://www.dailyrecord.co.uk/sport/football/gareth-southgate-up-another-scotland-31496672","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (John Cross)"],"video_url":null,"description":"The Three Lions boss would be up for a battle again at the Euros after their last tournament showdown.","content":"Gareth Southgate, Head Coach of England (Image: Getty Images) Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Gareth Southgate would relish locking horns again with Scotland in a Euros rerun. Southgate’s England will be in Pot One, while Steve Clarke’s Scots are third seeds for the big draw on December 2. That could see the Auld Enemy clash in Germany – just like they did at Wembley in Euro 2021. And Southgate is licking his lips at the prospect of going toe-to-toe with Clarke’s heroes. He said: “Always for the fans, those games (with Scotland) have that extra edge, don’t they? But from our own perspective, we’re just content with whatever comes out and we just have to deal with it.” While Southgate would enjoy a reunion with the Tartan Army, he knows there are plenty of other threats lurking in the draw, with the likes of the Netherlands alongside Scotland in Pot Three. He said: “There look like being really strong teams in Pot Two and Pot Three looks like it could also be very strong. They’re all different sorts of challenges. Read More Related Articles Euro 2024 pots in full as Scotland handed clear picture with Croatia in Pot 3 and Wales forced in to play-off Read More Related Articles SPFL hatch plan to stop pyro madness as Rangers fans display 'crossed a line' and thrusts issue into urgency mode “In the last Euros we had Croatia in with us, who proved to be one of the best teams in the world over the last few years and we managed to navigate that so we’ve just got to be ready for whatever comes our way.” Next month’s draw will determine where teams are based for games, but Southgate admitted England won’t be heading back to Baden Baden, which was their HQ at the 2006 World Cup and where partying by the WAGs, including the likes of Posh Spice, hit the headlines. Asked about a return, the Three Lions boss smiled: “Well… no! \"Really somewhere where we can be a little bit on our own. You basically want to be somewhere where you can zone out from everything that’s going on around you, but with facilities that are good for working We also want their families to be able to enjoy the tournament.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Scotland football team England football team Euro 2024 Steve Clarke Victoria Beckham Armed forces Tartan Tartan Army England Cricket Team Scotland U19s football team","pubDate":"2023-11-21 22:30:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31496676.ece/ALTERNATES/s615/0_North-Macedonia-v-England-Group-C-UEFA-EURO-2024-European-Qualifiers.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bc8d1d8476fe16f7c6a6561ae5186687","title":"Win over Manawatū tops the list","link":"https://times-age.co.nz/sports/win-over-manawatu-tops-the-list/","keywords":["Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Good cricket and golf, the Breakers at breaking point, and points deductions highlight this week’s eagerly anticipated dose of ‘Good, Bad and Ugly’. GOOD Any win in cricket over our nearest neighbours, Manawatū, is worth celebrating, but the manner in which Post Office Hotel Wairarapa dominated their opponents in the weekend’s Furlong Cup match at […]","content":"Any win in cricket over our nearest neighbours, Manawatū, is worth celebrating, but the manner in which Post Office Hotel Wairarapa dominated their opponents in the weekend’s Furlong Cup match at the Oval was impressive. After dismissing the visitors for 130, Wairarapa built a 97-run lead and had Manawatū battling at 62–3 when rain brought a premature end. Could this be the momentum needed for a big push for a Hawke Cup challenge? Masterton golfer Ben Campbell makes the cut in this column for the second straight week, but making the cut in the Indonesian Masters looked a forlorn hope when he was tied for 93rd on two over after the first 18 holes. Rounds of 65, 63, and 65 saw Campbell rocket up the leaderboard to finish third for another tasty payday following on from his win in the Hong Kong Open. I’m not the biggest fan of Aussie cricketers, mainly due to their Ocker cockiness more than their playing prowess, but one has to admire their ability to continually peak at the right time when the big prizes are on the line. World Cup number six was the result, and how good was Travis Head and his match-winning 137? Very, very good, and to top it, he was remarkably un-Aussie cricketer-like and very humble. Only India could get away with changing pitches at an ICC-controlled tournament, but did they? It worked in Mumbai against the Black Caps in the semifinal. As the saying goes, what goes around comes around and the change to a used pitch for the final at Ahmedabad bit the hosts fair and squarely on the bum. Now, is that a good thing or a bad thing? Indian Prime Minister Narendra Modi’s lack of class in begrudgingly presenting the World Cup to Pat Cummings and then leaving the Aussie skipper stranded on the podium by himself. Modi’s body language said it all about what he thought of the result. Everton being deducted 10 points and dropped into the relegation zone by an independent commission for breaching the English Premier League’s financial rule is bad for the club and bad for the EPL. That’s unless, of course, you’re from the “red side” of town, and you might think it’s a good thing. The Toffees are likely to appeal the decision, while a Liverpool MP Ian Byrne has taken the matter to parliament, saying the punishment is “grossly unfair”. What is likely, though, is that the saga could open a big can of worms, with relegated clubs from the last two seasons [Leicester, Leeds and Burnley] threatening to sue Everton for millions of pounds of damages. There could also be bigger clubs in the firing line, with Chelsea and Manchester City two of the big names being bandied about [now that might not be a bad thing]. Top it off with the countless controversies over the officiating and influence of VAR, and the EPL is quickly turning into an ugly beast. What is going on at the NZ Breakers? Last season’s ANBL runners-up are a shambles and are heading to the depths of despair after going down 69–65 to cellar dwellers the Illawarra Hawks in Auckland and a record of three and seven. It doesn’t get much uglier. The ugly goings on at Australian Rugby were brought to a head with the sacking of chairman Hamish McLennan, which, according to most reports, is a good thing for rugby on both sides of the Tasman.","pubDate":"2023-11-21 21:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/11/RS511564_24_sam_Payne-e1700548172551-1024x647.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"a1af08c1a6df564cee795c632d57c8e4","title":"Under-19 World Cup shifted to South Africa","link":"https://www.dailynews.lk/2023/11/22/sports/247857/under-19-world-cup-shifted-to-south-africa/","keywords":["Sports","2000 ICC under 19 world cup","2006 ICC under 19 world cup","administrative uncertainty","Ahmedabad meeting","Cricket South Africa","CSA","ICC","International Cricket Council","November 10 decision","Oman","SA-20","Shammi Silva","SLC suspension","South Africa","Sri Lanka","UAE","Under 19 World Cup"],"creator":["malinga"],"video_url":null,"description":"The International Cricket Council (ICC) has moved the Under 19 World Cup to South Africa from Sri Lanka. The ICC board also… The post Under-19 World Cup shifted to South Africa appeared first on DailyNews.","content":"The International Cricket Council (ICC) has moved the Under 19 World Cup to South Africa from Sri Lanka. The ICC board also decided that the Sri Lanka team will continue to play international cricket despite the suspension of SLC. The game will be run through the suspended SLC, which will receive controlled funding. SLC Chief Shammi Silva is of the opinion that the confusion could have been avoided but said cricket in the country will remain uninterrupted. This was decided at the discussion at the meeting of ICC Board Directors held in Ahmedabad yesterday. “I have requested the ICC board to allow the game to continue and the members have upheld our request, ” added SLC chief. He also confirmed that Sri Lanka Under-19 team will take part in the U-19 World Cup in South Africa. The decision has been taken by the ICC board in view of the administrative uncertainty in Sri Lanka Cricket. After a detailed deliberations, the board has decided to uphold the November 10 decision to suspend the SLC. The ICC Directors board said that cricket in the island nation will continue uninterrupted, the suspension, however, will not be overturned. “It was a unanimous decision by the board that the suspension cannot be lifted. Cricket in the country will continue as normal. The SLC Chief Sammi Silva, the ousted president of the SLC, has attended the board meeting while SLC CEO Ashley de Silva also was there at ICC invitees. Meanwhile, the Under-19 World Cup was scheduled to take place between January 14 and February 15. The dates will clash with the second edition of SA-20, which runs from January 10 to February 10 but a top Cricket South Africa (CSA) senior official told that both events can be conducted simultaneously as the T20 league is being overseen autonomously by a body independent of CSA. The option of holding the event in Oman and UAE were also considered, but South Africa was preferred because of their infrastructure: the requirement was three grounds, and Oman only has one. Furthermore, moving the teams between UAE and Oman would have been an expensive proposition and the Board finally decided on South Africa. CSA has agreed to spare three venues for the mutli-nation championship which is good platform for under 19 cricketers. Sri Lanka hosted ICC under 19 world cup in year 2000 where Sri Lanka became runners up losing to India in the final and once again Sri Lanka hosted this event in 2006 and this would have been the third time if they got the nod from ICC.","pubDate":"2023-11-21 19:40:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"}]}