{"newsArray":[{"title":"Legend hits out at England cricket's 'disgrace'","link":"https://wwos.nine.com.au/cricket/stuart-broad-james-anderson-england-selection-disgrace-says-kevin-pietersen/54bce48f-dcfc-4b82-b19d-d8ffc18a86ff","keywords":null,"creator":["wwos"],"video_url":null,"description":"Kevin Pietersen has weighed in on the controversial omissions of James Anderson and Stuart Broad from England's team.","content":"Former England captain Kevin Pietersen says it will be \"an absolute disgrace\" if England pair James Anderson and Stuart Broad don't play Test cricket again.The pair - England's top wicket-takers in Test history - were dumped from the squad for the upcoming tour of the West Indies.Anderson is 39 and Broad 35, and there comes a time when England needs to look to the future. However, they're also still two of the country's best bowlers in the long form of the game, with Pietersen comparing them with some of the greats.READ MORE: Australian world champion falls agonisingly shortREAD MORE: US fumes as controversial Russian is cleared to competeREAD MORE: Drugs saga threatens to rock Russia beyond Olympics\"Broad - 152 Tests, Anderson - 169 Tests,\" he wrote.\"On par with Ambrose/Walsh, Younis/Akram, Donald/Pollock etc.\"If they don't get a chance to say goodbye to English cricket ON THE FIELD, then it's an absolute DISGRACE!\"Broad used his column for the Mail on Sunday to make the case for a Test recall, pointing out that he took 11 wickets in the final two Ashes Tests.The article also included a graphic that noted in the last five years Anderson has taken 173 Test wickets and Broad 169 ... well clear of any other English bowler.\"I have been Test match standard for a long time and, for the last eight years, you would say world class,\" Broad wrote.https://twitter.com/KP24/status/1493123281154723842?ref_src=twsrc%5Etfw\"And so, it makes it even more upsetting that they don't see me part of their immediate plans, especially with a view to looking at a way of winning away from home, which was briefly explained to me.\"I am in the top three bowlers in the country and whether I play — or indeed Jimmy plays — when we resume international cricket in June will be a call for new eyes to decide.\"Do I believe I warrant a place in England's best team in Antigua on March 8? Of course, I do. That is why it is so difficult to comprehend.\"Broad wrote that he was informed of the decision in a five minute phone call with Andrew Strauss last week, explaining that he'd had trouble sleeping since receiving the news.\"I can't pretend I am as good as gold, because I am not. It would be wrong to act like everything's OK,\" he said.\"Feeling as though I've performed well and deserve to be in the side makes it hard.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-14 21:46:19","full_description":"Former England captain Kevin Pietersen says it will be \"an absolute disgrace\" if England pair James Anderson and Stuart Broad don't play Test cricket again. The pair - England's top wicket-takers in Test history - were dumped from the squad for the upcoming tour of the West Indies. Anderson is 39 and Broad 35, and there comes a time when England needs to look to the future. However, they're also still two of the country's best bowlers in the long form of the game, with Pietersen comparing them with some of the greats. READ MORE: Australian world champion falls agonisingly short READ MORE: US fumes as controversial Russian is cleared to compete READ MORE: Drugs saga threatens to rock Russia beyond Olympics \"Broad - 152 Tests, Anderson - 169 Tests,\" he wrote. \"On par with Ambrose/Walsh, Younis/Akram, Donald/Pollock etc. \"If they don't get a chance to say goodbye to English cricket ON THE FIELD, then it's an absolute DISGRACE!\" Broad used his column for the Mail on Sunday to make the case for a Test recall, pointing out that he took 11 wickets in the final two Ashes Tests. The article also included a graphic that noted in the last five years Anderson has taken 173 Test wickets and Broad 169 ... well clear of any other English bowler. \"I have been Test match standard for a long time and, for the last eight years, you would say world class,\" Broad wrote. \"And so, it makes it even more upsetting that they don't see me part of their immediate plans, especially with a view to looking at a way of winning away from home, which was briefly explained to me. \"I am in the top three bowlers in the country and whether I play — or indeed Jimmy plays — when we resume international cricket in June will be a call for new eyes to decide. \"Do I believe I warrant a place in England's best team in Antigua on March 8? Of course, I do. That is why it is so difficult to comprehend.\" Broad wrote that he was informed of the decision in a five minute phone call with Andrew Strauss last week, explaining that he'd had trouble sleeping since receiving the news. \"I can't pretend I am as good as gold, because I am not. It would be wrong to act like everything's OK,\" he said. \"Feeling as though I've performed well and deserve to be in the side makes it hard.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/397184/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Josh Inglis expecting run-fest in Canberra","link":"https://www.news.com.au/sport/cricket/josh-inglis-expecting-runfest-in-canberra/video/1af4ffae178cdfb3cf503f499bceae26","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Despite losing Steve Smith to concussion, Josh Inglis is confident Australia will post a strong total in their third T20I clash with Sri Lanka.","content":null,"pubDate":"2022-02-14 20:44:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Meet ‘Narine’ of Punjab: Tennis-ball cricket in village to IPL via YouTube","link":"https://indianexpress.com/article/sports/cricket/meet-narine-of-punjab-tennis-ball-cricket-in-village-to-ipl-via-youtube-7774090/","keywords":["Cricket","Sports"],"creator":["Pratyush Raj"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-14 18:37:13","full_description":"OF ALL the fascinating paths to an IPL team, Ramesh Kumar’s story is a perfect fairytale for the social media age. His father repairs footwear, his mother is a bangle seller. And the 23-year-old was happy with the meagre prize money and small-time buzz of tennis-ball cricket in Punjab when he suddenly went viral on YouTube. The clip of him in action stirred an IPL cricketer who shared it with his coach — and in a blink, Ramesh’s life changed. Today, Ramesh, aka “Narine Jalalabadiya”, finds himself in Kolkata Knight Riders, picked for Rs 20 lakh at the IPL auction on Sunday. Just the climax awaits: a six off the final ball or a Super Over in which he bowls six different deliveries to win the Cup for his team. https://images.indianexpress.com/2020/08/1x1.png While “Narine” refers to West Indian mystery spinner and T20 star Sunil Narine for the skill to conjure up different balls with the same action, the “Jalalabadiya” tag in his Internet moniker tells not only his story but also that of his father’s migrant dreams. Twenty-five years ago, Mangu Ram left his hometown of Hanumangarh in Rajasthan in search of work and a better life for his family, and eventually settled down in Jalalabad in Punjab’s Fazilka district. Now his son will be rubbing shoulders with T20 legends in the world’s biggest cricket league. “I grew up watching the IPL and used to mimic Sunil Narine. I used to play tennis-ball tournaments in Punjab, and my bowling action and batting style became viral. One day (in March-April last year), someone posted a video of me with the caption ‘Narine Jalalabadiya,’ and it got stuck,” Ramesh told The Indian Express . “Honestly, I don’t know what kind of bowler I am, but I can bowl six different deliveries with the same action. This is why I get so many wickets,” he said. Ramesh could have remained a minor star on the tennis-ball circuit if not for KKR and Punjab player Gurkeerat Mann. Last year, impressed by a video that reached his phone, Mann shared it with KKR assistant coach and former Mumbai player Abhishek Nayar. The two were impressed but not sure if the boy in the video could be an effective hard-ball spinner. Mann called Ramesh to the PCA stadium in Mohali during Punjab’s senior team camp. To his pleasant surprise, the boy from Jalalabad could replicate his tennis-ball prowess. More bowling videos were shot — this time by Mann himself — and forwarded to Nayar’s phone. View this post on Instagram A post shared by Narine Jalalabadiya (@ramesh_kumar_narine_) A few days later, Ramesh got a call from an unknown number. “I thought it was a random call for a personal loan from some bank, and why on earth would Abhishek Nayar call me! I got convinced only when Mann paaji told me that it was a call from Abhishek Nayar,” he said. Ramesh’s world was changing. Mann helped the budding spinner with spikes, kits and even had him sign up with Minerva Punjab Cricket Academy. Ramesh represented Minerva in Punjab’s famous JP Atray Cricket Tournament and bagged 12 wickets in three matches. While “Narine” refers to West Indian mystery spinner and T20 star Sunil Narine for the skill to conjure up different balls with the same action, the “Jalalabadiya” tag in his Internet moniker tells not only his story but also that of his father’s migrant dreams. (Express Photo) He was then selected for the district team, but since Fazilka plays in a minor division in Punjab’s local league, Mann helped him to move to Kapurthala. Playing for Kapurthala in the Katoch Shield, Punjab’s inter-district tournament, Ramesh twinkled out 12 wickets in four matches. READ | IPL Mega Auction 2022: Kolkata Knight Riders complete players list, squad “I owe my life to Mann paaji. He has done so much for me. He has been a rock for me over the past year. If not for him, I would have been playing tennis cricket only. He has helped me financially…he shot my videos on his phone and always encourages me,” he said. View this post on Instagram A post shared by Narine Jalalabadiya (@ramesh_kumar_narine_) Once he nailed the transition to a cricket ball, Nayar stepped in and called Ramesh to Mumbai for the KKR trials. Last month, as he took his seat on the plane to Mumbai, his first flight, anxiety gripped him. “I started chanting God’s name, and was desperate for the plane to land somehow,” he said. With the nerves still jangling, “it took five minutes for me to open the door to my hotel room”. The next day, he went for trials and did whatever Nayar asked him to do before taking the flight back. KKR, meanwhile, is not keen to hype their new signing, but the word from their camp is Ramesh has potential although a lot of work needs to be put in before he is ready for the big league. (Express Photo) “Abhishek sir told me to keep working hard. With the help of Mann paaji, I put my name in the auction this time; I had no clue that I would be picked. It was a surprise for me when KKR went for me,” he said. KKR, meanwhile, is not keen to hype their new signing, but the word from their camp is Ramesh has potential although a lot of work needs to be put in before he is ready for the big league. Their new pick dreams of representing Punjab and playing for India one day, but knows there’s a long and tough road ahead. “Cricket is not my passion. It is my occupation. I have been playing cricket since I was 16. My father didn’t like me playing cricket all the time, he wanted me to study. But the player of the match award in tennis ball tournaments used to have cash awards and my focus was always to earn that,” he said. So how will he spend his IPL money? “My mother sells bangles in the villages of Jalalabad. I will open a shop for her, and save the rest for the education of my two younger brothers.”","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia vs Sri Lanka 3rd T20I Live Cricket Score Streaming Online: When and where to watch match live?","link":"https://indianexpress.com/article/sports/cricket/aus-vs-sl-3rd-t20i-live-streaming-tv-channel-time-ist-7774042/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-14 17:54:33","full_description":"LIVE Stream Australia vs Sri Lanka match Online: Australia is all set to lock horns with Sri Lanka for the 3rd T20 in the ongoing 5-match series to seal the title. Australia currently leads 2-0. The 3rd T20 could be the series decider if Sri Lanka fails to make a comeback in the series. In the last match, Australia hung on for a Super Over victory in a dramatic finish but an injury to Steve Smith cast a shadow over the hosts seizing a 2-0 series lead. Million-dollar man Josh Hazlewood (3-22) lived up to his Indian Premier League auction price tag in delivering a clutch Super Over that only went for five runs to save the Aussies’ blushes following a fumbling fielding display. Squads: Australia: https://images.indianexpress.com/2020/08/1x1.png Aaron Finch (c), Ashton Agar, Pat Cummins, Josh Hazlewood, Travis Head, Moises Henriques, Josh Inglis, Ben McDermott, Glenn Maxwell , Jhye Richardson, Kane Richardson, Steve Smith, Mitchell Starc, Marcus Stoinis , Matthew Wade, Adam Zampa . Sri Lanka: Avishka Fernando, Pathum Nissanka, Kusal Mendis, Dasun Shanaka (Captain), Danushka Gunathilaka, Janith Liyanage, Charith Asalanka, Ramesh Mendis, Wanindu Hasaranga, Dinesh Chandimal, Kamil Mishara, Chamika Karunaratne, Lahiru Kumara, Nuwan Thushara, Dushmantha Chameera, Binura Fernando, Maheesh Theekshana, Jeffrey Vandersay, Praveen Jayawickrama, Shiran Fernando. Where is Australia vs Sri Lanka 3rd T20I match being played? The Australia vs Sri Lanka 3rd T20I will take place at the Manuka Oval, Canberra. At what time does Australia vs Sri Lanka 3rd T20I match start? The Australia vs Sri Lanka 3rd T20I begins at 1:40 PM IST on Tuesday (February 15). Where to watch the live coverage of the Australia vs Sri Lanka 3rd T20I match? The Australia vs Sri Lanka 3rd T20I will be aired live on Sony Six & Sony Six HD (English) channels. How to watch Australia vs Sri Lanka 3rd T20I match online? The online streaming of the Australia vs Sri Lanka 3rd T20I will be available on the Sonyliv app and the website.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Canberra cricket ground records: List of Manuka Oval T20I records and batting and bowling stats","link":"https://thesportsrush.com/cricket-news-canberra-cricket-ground-records-list-of-manuka-oval-t20i-records-and-batting-and-bowling-stats/","keywords":["Cricket","Australia","Sri Lanka","Sri Lanka tour of Australia"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Canberra cricket ground records and stats: The Manuka Oval in Canberra will be hosting a T20I for the third time. The third T20I of the ongoing Sri Lanka’s tour of Australia will be played at the Manuka Oval tomorrow. While a victory for Australia will hand them an unassailable 3-0 lead in this five-match series,… The post Canberra cricket ground records: List of Manuka Oval T20I records and batting and bowling stats appeared first on The SportsRush.","content":"Canberra cricket ground records and stats: The Manuka Oval in Canberra will be hosting a T20I for the third time. The third T20I of the ongoing Sri Lanka’s tour of Australia will be played at the Manuka Oval tomorrow. While a victory for Australia will hand them an unassailable 3-0 lead in this five-match series, a Sri Lankan victory will keep them alive in the series. Manuka Oval, which has hosted 13 men’s international matches across formats thus far, will be hosting its third T20I on Tuesday. Australia, who have played both the T20Is at this venue, had won the first one against Pakistan and lost the second one against India. Meanwhile, Sri Lanka have played an ODI against India and a Test against Australia at this venue. However, they will now be playing a T20I for the first time in Canberra. Player Update #AUSvSL : Kusal Mendis who tested positive for Covid-19 has recovered and will be available for selections for the 3rd T20I game against Australia. He has joined the team today, following medical clearance. — Sri Lanka Cricket (@OfficialSLC) February 14, 2022 Canberra cricket ground records A very limited sample size means that there aren’t many stats and record in this format at this venue. Australia batter Steven Smith (92), who has been ruled out of the series due to concussion, has scored the maximum T20I runs at Manuka Oval. Smith is followed by the likes of Iftikhar Ahmed (62), Aaron Finch (52), Lokesh Rahul (51) and Babar Azam (50). Among current members of the Australian squad, Moises Henriques (30), Ben McDermott (21), Matthew Wade (7) and Glenn Maxwell (2) have scored a few runs in Canberra T20Is. Australia all-rounder Henriques (3) is also the joint highest wicket-taker in Manuka Oval T20Is. While the Indian pair of Yuzvendra Chahal (3) and T. Natarajan (3) are next on the list, Australian pair of Ashton Agar and Mitchell Starc have a couple of wickets apiece at this venue. As far as innings totals are concerned, all four T20I innings at the Manuka Oval have resulted in decent scores of 161/7, 151/3, 150/6 and 150/7. An average innings total of 153 has it in it to be both defended and chased in the third match. The post Canberra cricket ground records: List of Manuka Oval T20I records and batting and bowling stats appeared first on The SportsRush.","pubDate":"2022-02-14 17:22:44","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans Will Play Hard And Fair: Coach Ashish Nehra","link":"https://sports.ndtv.com/cricket/ipl-2022-auction-gujarat-titans-will-play-hard-and-fair-says-coach-ashish-nehra-2768258","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Auction: After the mega auction, Ashish Nehra said that Gujarat Titans will be trying their \"level best\" to give \"fans some exciting cricket\".","content":null,"pubDate":"2022-02-14 15:04:49","full_description":"Ashish Nehra, the head coach of the Gujarat Titans has said that he is pleased with the picks the franchise made in the Indian Premier League (IPL) mega auction and the Hardik Pandya-led side will play hard and fair in the tournament. \"Yeah, see it is not about Gujarat Titans, in the IPL, all teams are very close and they are very good. It is about how they stick and gel together. After the auction, some people will say this team is looking strong but that does not mean that team will win the IPL, sports does not work that way. It is a new franchise and we did manage to put up a really good squad,\" Nehra said after the mega auction. \"New franchise, we will try our level best to give our fans some exciting cricket. We can promise that we will play hard and fair, I am looking forward to the tournament,\" he added. Before the mega auction, Gujarat Titans had chosen Hardik Pandya, Rashid Khan, and Shubman Gill as their three draft picks and the side then went on to pick the likes of Mohammed Shami, Jason Roy in the mega auction. Promoted The franchise also acquired Lockie Ferguson, Matthew Wade, David Miller, and Wriddhiman Saha in the mega auction. Gujarat Titans squad: Hardik Pandya, Rashid Khan, Shubman Gill, Mohammed Shami, Jason Roy, Lockie Ferguson, Abhinav Sadarangani, Rahul Tewatia, Noor Ahmed, Sai Kishore, Vijay Shankar, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Alzarri Joseph, Pradeep Sangwan, Ashok Sharma, David Miller, Wriddhiman Saha, Matthew Wade, Varun Aaron, B Sai Sudharshan.","image_url":"https://c.ndtvimg.com/2019-03/bnlkhmio_ashish-nehra-afp_625x300_17_March_19.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Marcus Stoinis reveals life-changing advice he got from MS Dhoni","link":"https://zeenews.india.com/cricket/ipl-2022-marcus-stoinis-reveals-life-changing-advice-he-got-from-ms-dhoni-2436633.html","keywords":null,"creator":null,"video_url":null,"description":"MS Dhoni's finishing skill is famous all over the world. When the former Indian captain was at his oeak, he would single-handedly take his team across the finish line. Whether in international cricket or IPL, he was equally brilliant.","content":null,"pubDate":"2022-02-14 14:43:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"ROT vs INB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for European Cricket League 2022, Match 5","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/rot-vs-inb-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-european-cricket-league-2022-match-5?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-14 13:32:34","full_description":"The Royal Tigers will take on Indo-Bulgarian in Match 5 of Group B at the European Cricket League 2022 on Monday, 14th February 2022. The match will be held at the Cartama Oval in Cartama, Spain. Neither Royal Tigers nor the Indo-Bulgarians have played a game so far in European Cricket League 2022. They have several quality and experienced players on their roster who will be eager to hit the ground running. We can expect an even contest between the two sides. Royal Tigers Abhishek Ahuja (WK), Khaibar Deldar, Marc Ahuja (C), Harsh Mandhyan, Safi Zahir, Zeeshan Khan, Vigneshwaran Jayaraman, Abhitesh Prashar, Akramullah Malikzada, Abhishek Kheterpal, Venkata Narashiman Indo-Bulgarian Chris Webster, Eashan Patel, Gagandeep Singh, Hristo Lakov, Jamie Batten, Lovesh Sharma, Prakash Mishra (C), Rohan Patel, Rohit Dhiman, Rohit Singh, Shafquat Khan (WK) Match: Royal Tigers vs Indo-Bulgarian, Match 5 Date and Time: Monday, 14th February at 9:30 PM IST Venue: Cartama Oval, Cartama The pitch at Cartama Oval is a batters' paradise. The ball comes nicely onto the bat, making it easier for the batters to execute their shots. The team winning the toss would most probably opt to bat first. Wicketkeeper Abhishek Ahuja: Abhishek is an experienced wicket-keeper batter in the Royal Tigers’ lineup. He has amassed over 970 runs so far in his career and is expected to perform well in this game. Batters Marc Ahuja: Marc will be handling the captaincy duties of the Royal Tigers. He is a veteran of the T10 format, having scored 1071 runs in 41 matches. Gagandeep Singh: Gagandeep is a hard-hitting batting all-rounder. He hasn’t featured in many games yet but has displayed his abilities in the limited number of chances he has received so far. All-rounders Zeeshan Khan: Zeeshan is one of the best all-rounders in this competition. He is a dependable player, having grabbed 80 wickets while also scoring over 350 runs in his career. Prakash Mishra: Prakash is an experienced international all-rounder. He has featured in 22 T20Is, scoring 201 runs and taking 21 wickets. Bowlers Hristo Lakov: Lakov is a must-pick from the bowling department. He has scored 499 runs in 18 T20Is while also taking 13 wickets. Abhishek Kheterpal: Kheterpal has been a part of several T10 tournaments. In 29 matches, he has scored around 500 runs and also has 53 wickets under his belt. Both teams are yet to play a match this season. Both teams are yet to play a match this season. Fantasy Suggestion #1: Abhishek Ahuja, Marc Ahuja, Gagandeep Singh, Zeeshan Khan, Prakash Mishra, Hristo Lakov, Abhishek Kheterpal, Harsh Mandhyan, Khaibar Deldar, Rohit Dhiman, Jamie Batten Captain: Prakash Mishra Vice-Captain: Marc Ahuja Fantasy Suggestion #2: Abhishek Ahuja, Marc Ahuja, Gagandeep Singh, Zeeshan Khan, Prakash Mishra, Hristo Lakov, Abhishek Kheterpal, Rohit Singh, Rohan Patel, Vigneshwaran Jayaraman, Akramullah Malikzada Captain: Zeeshan Khan Vice-Captain: Abhishek Kheterpal","image_url":"https://static.sportskeeda.com/editor/2022/02/226a8-16448369814899-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI: No crowd in 1st T20I, CAB requests BCCI to allow spectators for last two matches","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-wi-no-crowd-in-1st-t20i-cab-requests-bcci-to-allow-spectators-for-last-two-matches-2022-02-14-759607","keywords":null,"creator":null,"video_url":null,"description":"The Cricket Association of Bengal (CAB) on Thursday requested the Board of Control for Cricket in India (BCCI) to allow spectators at Eden Gardens for the last two T20Is of the three-match series against West Indies.","content":null,"pubDate":"2022-02-14 13:25:35","full_description":"The Cricket Association of Bengal (CAB) on Thursday requested the Board of Control for Cricket in India (BCCI) to allow spectators at Eden Gardens for the last two T20Is of the three-match series against West Indies. India and West Indies will lock horns in the T20I series at the Eden Gardens Kolkata from February 16. \"The BCCI has allowed only upper tier and hospitality boxes for sponsors and representatives for the first match,\" CAB said in a statement. The CAB has again requested the BCCI to reconsider and allow spectators for the remaining matches. \"CAB will intimate all stakeholders once it receives feedback from the board,\" stated further. India defeated West Indies 3-0 in the three-match ODI series.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Charu Sharma Produces The Blunder Of The Decade In IPL Auction 2022 As He Robs Off Mumbai Indians' Bid For Khaleel Ahmed And Gifts The Player To Delhi Capitals - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMi4AFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaW5kaWFuLXByZW1pZXItbGVhZ3VlLWlwbC0yMDIyL3dhdGNoLWNoYXJ1LXNoYXJtYS1wcm9kdWNlcy10aGUtYmx1bmRlci1vZi10aGUtZGVjYWRlLWluLWlwbC1hdWN0aW9uLTIwMjItYXMtaGUtcm9icy1vZmYtbXVtYmFpLWluZGlhbnMtYmlkLWZvci1raGFsZWVsLWFobWVkLWFuZC1naWZ0cy10aGUtcGxheWVyLXRvLWRlbGhpLWNhcGl0YWxzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Charu Sharma Produces The Blunder Of The Decade In IPL Auction 2022 As He Robs Off Mumbai Indians' Bid For Khaleel Ahmed And Gifts The Player To Delhi Capitals  Cricket AddictorBreakdown: How teams stack up after the IPL mega auction | Cricbuzz.com - Cricbuzz  CricbuzzHugh Edmeades Collapses Due To Postural Hypotension; Why Does It Happen?  News18How the ten teams stack up after the IPL 2022 auction  ESPNcricinfoAuction 2022: Gujarat Review ft. Mohammed Shami, Rahul Tewatia  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-02-14 12:46:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"KKR Playing 11 2022: KKR Probable Playing 11 2022 IPL","link":"https://thesportsrush.com/cricket-news-kkr-playing-11-2022-kkr-probable-playing-11-2022-ipl/","keywords":["Cricket","IPL 2022","KKR","Indian Premier League","Kolkata Knight riders"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KKR Probable Playing 11 2022 IPL: Kolkata Knight Riders are among the four teams who have bought a maximum of 25 players for IPL 2022. Having splurged opulent amount of money in the initial phase of Indian Premier League 2022 mega auction, there was a time when a few franchises had hardly made any transactions… The post KKR Playing 11 2022: KKR Probable Playing 11 2022 IPL appeared first on The SportsRush.","content":"KKR Probable Playing 11 2022 IPL: Kolkata Knight Riders are among the four teams who have bought a maximum of 25 players for IPL 2022. Having splurged opulent amount of money in the initial phase of Indian Premier League 2022 mega auction, there was a time when a few franchises had hardly made any transactions but Kolkata Knight Riders were left with only INR 20 crore. Despite that, KKR were brave enough to bid in excess of INR 10 crore for West Indies wicket-keeper batter Nicholas Pooran. Had Sunrisers Hyderabad not bought Pooran for INR 10.75 crore, Kolkata would’ve received a hard-hitting batter at the cost of compromising on a large part of their squad. Subsequently, Knight Riders made some wise decisions to put together a 25-member squad for a whopping amount of INR 89.55 crore. KKR, who will be sans Shubman Gill, Eoin Morgan and Dinesh Karthik in IPL 2022, have made interesting buys as potential replacements of these players. Having said that, one still feels that they’ve missed out on strengthening their middle-order. However, what seems to be a void on paper can very well be perceived as opportunities for rookie players on a cricket field. With no dearth of Indian batters in their current squad, expect the team management to try out a few of them this season. KKR Probable Playing 11 2022 IPL IPL 2021 was a breakthrough season for Madhya Pradesh all-rounder Venkatesh Iyer. A maiden IPL season soon got converted into white-ball debut for India in both the formats. One of their four retained players before the auction, Kolkata shouldn’t think twice before making Iyer open with England batter Alex Hales. The presence of Ajinkya Rahane, Abhijeet Tomar and Pratham Singh has it in it to fuel up the debate around opening with two Indian batters to accommodate an overseas all-rounder in the middle-order. But benching Hales could hand the team a certain disadvantage especially after considering the kind of form he has been in this format in recent years. Another school of thought for Knight Riders would be to include wicket-keeper batter Sam Billings as their fourth overseas player in place of Hales and open the batting with two Indian batters. Worth brainstorming, the move will still come at an expense of leaving an in-form batter in Hales out. 10th highest run-scorer in T20s, Hales is the second-highest run-scorer in the format since his last international match amassing 3,787 runs at an average and strike rate of 32.93 and 150.40 respectively. Hales, who has played in the Pakistan Super League, T20 Blast, Caribbean Premier League, Mzansi Super League, Big Bash League and The Hundred in this period, has hit two centuries and 22 half-centuries. Known for his aggressive moves both as a player and coach, Knight Riders head coach Brendon McCullum might also be tempted to open with Hales in IPL 2022. India batter Shreyas Iyer, their most expensive IPL 2022 player at INR 12.25 crore, will accompany Nitish Rana to form a strong Top Four. The next two batting positions will be up for grabs among uncapped Indian batters namely Sheldon Jackson, Rinku Singh, Baba Indrajith and Aman Khan. Jackson, who has represented KKR on just four occasions (in 2017) in spite of spending a few seasons should finally get a long run as a wicket-keeper batter. “Rinku [Singh] was part of KKR academy in 2018 and he’s a homegrown boy for us and he’s an amazing fielder. He is fun and a quintessential team-man in a way,” Jhanvi Mehta, daughter of KKR co-owner Jay Mehta, had told Star Sports during one of the breaks on the second day of auction in Bengaluru. Much like Jackson, Rinku also deserves a proper run on the back of being part of the Kolkata franchise for some years now. The least amount of pondering which McCullum, Kolkata’s new captain and the rest of the team management will have to do is with respect to their bowlers. Having retained three of them from last year, Knight Riders did pretty well to buy back the likes of Pat Cummins and Shivam Mavi in the auction. As a result, they now have a replica of their IPL 2021 bowling attack. KKR Playing 11 2022 Special What does your Playing XI look like? #KKR #AmiKKR #GalaxyOfKnights #IPLAuction #TATAIPLAuction pic.twitter.com/qLHDhJZyAI — KolkataKnightRiders (@KKRiders) February 13, 2022 1) Venkatesh Iyer 2) Alex Hales 3) Shreyas Iyer 4) Nitish Rana 5) Sheldon Jackson (wk) 6) Rinku Singh 7) Andre Russell 8) Sunil Narine 9) Pat Cummins 10) Shivam Mavi 11) Varun Chakravarthy The post KKR Playing 11 2022: KKR Probable Playing 11 2022 IPL appeared first on The SportsRush.","pubDate":"2022-02-14 12:17:46","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"NZ-W vs IND-W 2nd ODI Live streaming: When and Where to watch Ind women vs NZ women 2nd ODI Match Live Online","link":"https://www.indiatvnews.com/sports/cricket/india-vs-new-zealand-live-streaming-when-and-where-to-watch-india-women-vs-new-zealand-women-2nd-odi-match-live-on-tv-online-free-2022-02-14-759598","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand Live Streaming: When and Where to watch Ind women vs NZ women 2nd ODI Match Live Online, TV The Indian women's cricket team will get to fine-tune its ODI World Cup preparations in a six-game limited-overs series against hosts New Zealand by playing in the 2nd ODI match in Queenstown on Tuesday.","content":null,"pubDate":"2022-02-14 12:11:12","full_description":"The 2nd ODI match between India women and New Zealand women will take place on 15 February 2022. India women vs New Zealand women's 2nd ODI match will be played at John Davies Oval in Queenstown. The match will start at 3:30 am IST. The toss between India women vs New Zealand women will take place at 3:00 AM IST. There will be no LIVE telecast of the match on TV. The match will be LIVE streamed on Amazon Prime Video. Shafali Verma, Yastika Bhatia, (c), , Sabbhineni Meghana, Richa Ghosh (w), , , Jhulan Goswami, Rajeshwari Gayakwad, . Sophie Devine (c), Suzie Bates, Amelia Kerr, Amy Satterthwaite, Maddy Green, Brooke Halliday, Katey Martin (w), Hayley Jensen, Lea Tahuhu, Jess Kerr, Hannah Rowe. New Zealand Women Squad: Suzie Bates, Sophie Devine (c), Amy Satterthwaite, Maddy Green, Katey Martin (w), Amelia Kerr, Brooke Halliday, Hayley Jensen, Hannah Rowe, Jess Kerr, Lea Tahuhu, Fran Jonas, Rosemary Mair, Lauren Down, Frances Mackay , Shafali Verma, Harmanpreet Kaur (c), Yastika Bhatia, Richa Ghosh (w), Pooja Vastrakar, Deepti Sharma, Rajeshwari Gayakwad, Poonam Yadav, Renuka Singh, , Sneh Rana, Sabbhineni Meghana, Meghna Singh, , Simran Bahadur","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Railway, Dibrugarh, Jorhat win","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/railway-dibrugarh-jorhat-win-578223","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"NF Railway, Dibrugarh and Jorhat won their respective matches in the Kanaklata Women ID Cricket held at various venues in the city today. NF Railway thrashed Karimganj by 10 wickets while Dibrugarh also won by identical margin against Tezpur.","content":"Our Sports ReporterGUWAHATI: NF Railway, Dibrugarh and Jorhat won their respective matches in the Kanaklata Women ID Cricket held at various venues in the city today. NF Railway thrashed Karimganj by 10 wickets while Dibrugarh also won by identical margin against Tezpur. Jorhat beat Mangaldoi by 9 wickets. Also Read: Rape Rate High In India As Women Don't Wear Hijab Says Karnataka Congress MLAAlso Watch:","pubDate":"2022-02-14 12:10:01","full_description":"Our Sports Reporter GUWAHATI: NF Railway, Dibrugarh and Jorhat won their respective matches in the Kanaklata Women ID Cricket held at various venues in the city today. NF Railway thrashed Karimganj by 10 wickets while Dibrugarh also won by identical margin against Tezpur. Jorhat beat Mangaldoi by 9 wickets. Also Read: Rape Rate High In India As Women Don't Wear Hijab Says Karnataka Congress MLA Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/14/312518-download-2.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Nilay Dutta Inter-University Cricket meet begins","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/nilay-dutta-inter-university-cricket-meet-begins-578215","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Tezpur University and Dibrugarh University won their respective matches on the opening day of the Nilay Dutta Inter-University Cricket Tournament held at Tezpur and Jorhat respectively.","content":"Wins for Tezpur, Dibrugarh Our Sports ReporterGUWAHATI: Tezpur University and Dibrugarh University won their respective matches on the opening day of the Nilay Dutta Inter-University Cricket Tournament held at Tezpur and Jorhat respectively. Tezpur defeated Bodoland University and Dibrugarh won against Assam Agricultural University. Earlier Professor Vinod Kumar Jain, Vice-Chancellor, Tezpur University, Bhupesh Chandra Das, Deputy Commissioner, Sonitpur and Devajit Saikia, Secretary, Assam Cricket Association attended the opening function held at Tezpur. At Jorhat, the opening function was graced by Bidyut Chandan Deka, Vice-Chancellor, Assam Agricultural University, MP of Rajya Sabha Kamakhya Prasad Tasa and Vice President of Assam Cricket Association Porikshit Dutta. Altogether nine teams are participating in the tournament. Brief scores: Tezpur University Vs Bodoland University (Venue Tezpur University Ground): Tezpur University 181/4 ( 20 overs), Arindom Paraswar 72, Akash Prasad 40, Rohit Agarwal 2-27, Bodoland University 56 (12.5 overs), Partha Protim Dutta 4-6, Sashankar Sutradhar 2-6. Dibrugarh University Vs Assam Agricultural University (Venue Assam Agricultural University Ground, Jorhat): Dibrugarh University 137/8 (20 overs), Gunjanjyoti Deka 42, Protyush Bora 37, Arpan Buragohain 2-25; Assam Agricultural University 109 ( 20 overs)- Jyotish Gogoi 28, Rupak Jena 25. Gunjanjyoti Deka 2-23, Hemanta Taye 2-18. Also Read: Rape Rate High In India As Women Don't Wear Hijab Says Karnataka Congress MLAAlso Watch:","pubDate":"2022-02-14 11:57:10","full_description":"Wins for Tezpur, Dibrugarh Our Sports Reporter GUWAHATI: Tezpur University and Dibrugarh University won their respective matches on the opening day of the Nilay Dutta Inter-University Cricket Tournament held at Tezpur and Jorhat respectively. Tezpur defeated Bodoland University and Dibrugarh won against Assam Agricultural University. Earlier Professor Vinod Kumar Jain, Vice-Chancellor, Tezpur University, Bhupesh Chandra Das, Deputy Commissioner, Sonitpur and Devajit Saikia, Secretary, Assam Cricket Association attended the opening function held at Tezpur. At Jorhat, the opening function was graced by Bidyut Chandan Deka, Vice-Chancellor, Assam Agricultural University, MP of Rajya Sabha Kamakhya Prasad Tasa and Vice President of Assam Cricket Association Porikshit Dutta. Altogether nine teams are participating in the tournament. Brief scores: Tezpur University Vs Bodoland University (Venue Tezpur University Ground): Tezpur University 181/4 ( 20 overs), Arindom Paraswar 72, Akash Prasad 40, Rohit Agarwal 2-27, Bodoland University 56 (12.5 overs), Partha Protim Dutta 4-6, Sashankar Sutradhar 2-6. Dibrugarh University Vs Assam Agricultural University (Venue Assam Agricultural University Ground, Jorhat): Dibrugarh University 137/8 (20 overs), Gunjanjyoti Deka 42, Protyush Bora 37, Arpan Buragohain 2-25; Assam Agricultural University 109 ( 20 overs)- Jyotish Gogoi 28, Rupak Jena 25. Gunjanjyoti Deka 2-23, Hemanta Taye 2-18. Also Read: Rape Rate High In India As Women Don't Wear Hijab Says Karnataka Congress MLA Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/14/312512-cr.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"ISL vs KAR Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s PSL 2022 Match No.21 at Gaddafi Stadium, Lahore, 8:00 PM IST February 14","link":"https://zeenews.india.com/cricket/isl-vs-kar-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-psl-2022-match-no-21-at-gaddafi-stadium-lahore-800-pm-ist-february-14-2436553.html","keywords":null,"creator":null,"video_url":null,"description":"Islamabad United vs Karachi Kings Dream11 Team Prediction Islamabad United vs Karachi Kings Match No. 21 - Check My Dream11 Team, Best players list of ISL vs KAR, Islamabad United Dream11 Team Player List, Karachi Kings Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Pakistan Super League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-14 11:40:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Exclusive - IPL auction 2022: 'Sachin Tendulkar a childhood hero, excited to play under Rohit Sharma' - M - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMi8gFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvZXhjbHVzaXZlLWlwbC1hdWN0aW9uLTIwMjItc2FjaGluLXRlbmR1bGthci1hLWNoaWxkaG9vZC1oZXJvLWV4Y2l0ZWQtdG8tcGxheS11bmRlci1yb2hpdC1zaGFybWEtbWVldC0xOC15ZWFyLW9sZC1pcGwtbWlsbGlvbmFpcmUtYmFieS1hYi1kZXdhbGQtYnJldmlzL2FydGljbGVzaG93Lzg5NTY3NTcxLmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Exclusive - IPL auction 2022: 'Sachin Tendulkar a childhood hero, excited to play under Rohit Sharma' - M  Times of IndiaIPL auction: KKR picks Kashmir pacer Rasikh Salam  Greater KashmirSachin Tendulkar Is One Of My Childhood Heroes – Dewald Brevis Aka 'Baby AB' Excited To Be Part Of Mumbai Indians In IPL  Cricket AddictorIPL 2022 mega auction: `Baby AB` Dewald Brevis picked up by Mumbai Indians for THIS amount  Zee NewsIPL Auction: Other windfall stories  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-02-14 11:17:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Work begins on new NCA in Bengaluru, foundation stone laid by BCCI brass","link":"https://www.indiatvnews.com/sports/cricket/work-begins-on-new-nca-in-bengaluru-foundation-stone-laid-by-bcci-brass-2022-02-14-759589","keywords":null,"creator":null,"video_url":null,"description":"Work has begun on the country's new National Cricket Academy (NCA) with the BCCI brass, including president Sourav Ganguly and secretary Jay Shah, laying the foundation stone of the complex here on Monday.","content":null,"pubDate":"2022-02-14 11:15:31","full_description":"Work has begun on the country's new National Cricket Academy (NCA) with the BCCI brass, including president Sourav Ganguly and secretary Jay Shah, laying the foundation stone of the complex here on Monday. The BCCI has secured the land on a 99-year lease. \"The new National cricket Academy starts from today ..laid the foundation stone of the new place today in Bengaluru,\" Ganguly tweeted and also shared images of the ceremony. Shah wrote on his Twitter handle, \"Laid the foundation stone for @BCCI's new NCA. It is our collective vision to have a Centre of Excellence which nurtures talent and supports the cricket ecosystem in India.\" The foundation stone was laid in the presence of BCCI vice president Rajeev Shukla, treasurer Arun Dhumal, joint secretary Jayesh George and NCA head VVS Laxman. Since the existing NCA's establishment in 2000, it has been running from the premises of the M. Chinnaswamy Stadium in the heart of the city. The Karnataka State Cricket Association (KSCA), which owns the stadium, had rented out to the BCCI its Ground B for outdoor practice, besides an indoor practice facility, and separate space for a modern gymnasium. The new facility, which is expected to be ready in a year's time, will have three grounds where domestic matches can be held.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"'2005 World Cup was turning point for women's cricket in India,' says India opener Jaya Sharma","link":"https://zeenews.india.com/cricket/2005-world-cup-was-turning-point-for-womens-cricket-in-india-says-india-opener-jaya-sharma-2436510.html","keywords":null,"creator":null,"video_url":null,"description":"India opener Jaya Sharma talks about her experience with India's Women cricket team throughout the years.","content":null,"pubDate":"2022-02-14 10:45:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Work Begins For New NCA, BCCI Brass Lay Foundation Stone","link":"https://sports.ndtv.com/cricket/work-begins-for-new-national-cricket-academy-bcci-brass-lay-foundation-stone-2767591","keywords":null,"creator":null,"video_url":null,"description":"The new National Cricket Academy, which is expected to be ready in a year's time, will have three grounds where domestic matches can be held.","content":null,"pubDate":"2022-02-14 10:43:26","full_description":"Work has begun on the country's new National Cricket Academy (NCA) with the BCCI brass, including president Sourav Ganguly and secretary Jay Shah, laying the foundation stone of the complex on Monday. The BCCI has secured the land on a 99-year lease. \"The new National cricket Academy starts from today ..laid the foundation stone of the new place today in Bengaluru,\" Ganguly tweeted and also shared images of the ceremony. Shah wrote on his Twitter handle, \"Laid the foundation stone for @BCCI's new NCA. It is our collective vision to have a Centre of Excellence which nurtures talent and supports the cricket ecosystem in India.\" The foundation stone was laid in the presence of BCCI vice president Rajeev Shukla, treasurer Arun Dhumal, joint secretary Jayesh George and NCA head VVS Laxman. Since the existing NCA's establishment in 2000, it has been running from the premises of the M. Chinnaswamy Stadium in the heart of the city. Promoted The Karnataka State Cricket Association (KSCA), which owns the stadium, had rented out to the BCCI its Ground B for outdoor practice, besides an indoor practice facility, and separate space for a modern gymnasium. The new facility, which is expected to be ready in a year's time, will have three grounds where domestic matches can be held.","image_url":"https://c.ndtvimg.com/2022-02/les0fdmo_bcci-members-twitter_120x90_14_February_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: cricket ‘fairy tale’ for the Philippines as Indian expats and Filipino-Australian amateurs chase their dreams","link":"https://www.scmp.com/sport/cricket/article/3166994/t20-world-cup-cricket-fairy-tale-philippines-indian-expats-and?utm_source=rss_feed","keywords":null,"creator":["Agence France-Presse"],"video_url":null,"description":"The Philippines is better known for boxers than batters and its cricket team have not played for three years, but the side of amateurs hope to make their mark in T20 World Cup qualifiers.As the lowest-ranked side in the eight-team qualifying tournament taking place this month in Oman featuring the likes of Nepal, Ireland and United Arab Emirates, few are more surprised than the Philippines to be pulling on the pads at global level.“It’s like a fairy tale,” said skipper Jonathan Hill, a high…","content":null,"pubDate":"2022-02-14 10:20:11","image_url":"https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/02/14/1c533080-2c06-46c3-b0ec-dc1c94044770_038deafe.jpg?itok=JLP4kZB8","source_id":"scmp","country":["china"],"category":["sports"],"language":"english"},{"title":"The Deepak Chahar journey: from pillion rides on bike to most expensive Indian bowler at an IPL auction","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-auction/the-deepak-chahar-journey-from-pillion-rides-on-bike-to-most-expensive-indian-bowler-at-an-ipl-auction/article38423975.ece","keywords":null,"creator":["Vijay Lokapally"],"video_url":null,"description":"Those pillion rides on his father’s bike in pursuit of his cricket dreams keep reminding Deepak Chahar that it is just the beginning. His father and coach also work tirelessly to ensure that he stays grounded. Cricket stays the priority.","content":null,"pubDate":"2022-02-14 09:54:29","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Auction: Franchises cautious while going for U-19 stars; uncapped players strike it big","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-auction-franchises-cautious-while-going-for-u-19-stars-uncapped-players-strike-it-big-2022-02-14-759568","keywords":null,"creator":null,"video_url":null,"description":"Cricket is a lot about timing and the Under-19 cricket team got it just right by lifting the World Cup before IPL's mega-auction. But did that translate into big bucks for the stars of that triumph?","content":null,"pubDate":"2022-02-14 09:46:22","full_description":"Cricket is a lot about timing and the Under-19 cricket team got it just right by lifting the World Cup before 's mega-auction. But did that translate into big bucks for the stars of that triumph? At the end of two days of bidding wars, it seems the franchises chose to tread on the side of caution when it came to loosening the purse strings for the newest batch of young talent in Indian cricket. While some uncapped, but proven performers like Avesh Khan, were laughing all their way to the bank with bids as high as Rs 10 crore, only a few of the Under-19 stars, skipper Yash Dhull included, managed to land deals with IPL teams in the two-day mega auction held in Bengaluru. Dhull, a product of the academy run by Delhi Capitals and top-scorer of the U-19 World Cup, was picked up for Rs 50 lakh by the franchise that groomed him. Exciting all-rounder Raj Bawa won a Rs 2 crore bid from Punjab Kings, while Rajvardhan Hangargekar (with a base price Rs 30 lakh) was roped in by four-time IPL champions Chennai Super Kings for Rs 1.50 crore. Dhull's teammate Vicky Ostwal was snapped up by Delhi Capitals later in the auction at his base price of Rs 20 lakh. Hangargekar, the new entrant into the CSK stable, will hope to learn tricks of the trade from the legendary , skipper of the four-time champion franchise. The talented Maharashtra all-rounder is known for the ability to bowl yorkers at will, not so easy at any level, and can only get better by rubbing shoulders with Dhoni and the other big names at Super Kings. It must be said that the various IPL teams seemed to be cautious while bidding for the under-19 players and did not appear ready to splurge. Bawa, who is rated highly for his all-round skills, won the biggest bid among his U-19 teammates. While the teams did not go after Indian under-19 aces in a big way, South African Dewald Brevis, nicknamed 'Baby AB' and tipped to be the country's future cricket superstar, was snapped up by Mumbai Indians for Rs 3 crore where he would line up alongside Indian white-ball captain , Kieron Pollard and others. Unlike in previous years when the under-19 players were in focus and even got lucrative offers, this time the franchises were rather subdued when it came to locking in the junior stars as evidently, it takes for them to be mature enough for top-flight cricket. In previous years, under-19 stars like and , among others, have earned IPL contracts following their exploits at the marquee junior tournament. Shaw, who was roped in by Delhi for Rs 1.2 crore in 2018 and Gill have since graduated to the senior team and established themselves as names to be reckoned with. Like Shaw, Gill was signed up by Kolkata Knight Riders while he was in New Zealand for the under-19 World Cup and has since made a name for himself with some noteworthy performances for the national senior team. While some of the members of the 2018 under-19 World Cup side like Shaw and Gill have made it big, some others like Shivam Mavi, Kamlesh Nagarkoti, Ishan Porel and Riyan Parag have been on the fringes. They are featured in the IPL but not on a regular basis. Mavi, who is rated highly, got lucky and was picked by Kolkata Knight Riders for Rs 7.75 crore (base price Rs 40 lakh) while Kartik Tyagi, a key performer in the under-19 World Cup in 2020, was netted by Sunrisers Hyderabad for Rs 4 crore. Arshdeep Singh, a member of the victorious under-19 WC team in 2018, has struck it rich after being retained ahead of the auctions by Punjab Kings for Rs 4 crore after impressing in IPL 2021. Left-handed batter Yashasvi Jaiswal is another of those from the under-19 teams to have been in the spotlight. The star of India's campaign in 2020, which saw the team lose to Bangladesh in the final, the Mumbaikar was bought by Rajasthan Royals in the 2020 auction at Rs 2.4 crore and was retained by the same franchise ahead of the mega auction for Rs 4 crore. Jaiswal's teammate in the 2020 under-19 WC, Ravi Bishnoi is another name who has hit paydirt already. The leg-spinner, who was the highest wicket-taker in the event in South Africa, was picked by Punjab Kings in 2020 for Rs 2 crore but was released before this season only to be roped in by new team Lucknow Super Giants for Rs 4 crore. While the Indian players from previous under-19 World Cups have been able to get big-ticket deals, the current bunch, which was considered a notch lower when compared to teams of the past, got a lukewarm response at the IPL auction this time. As for the uncapped players, Avesh (base price Rs 20 lakh) got a Rs 10 crore contract with Lucknow Super Giants and became the most expensive uncapped Indian buy at the auction. Avesh's auction price was 50 times his base price and beat K Gowtham's price of Rs 9.25 crore (by CSK) in 2021. That's not all, Tamil Nadu power-hitter Shahrukh Khan earned a Rs 9 crore bid from Punjab Kings after having been purchased by the same team for Rs 5.25 crore last year. One season wonder Rahul Tewatia went for Rs 9 crore to Gujarat Titans and Rahul Tripathi earned a Rs 8.50 crore contract with Sunrisers Hyderabad. Nippy left-arm pacer Yash Dayal from Uttar Pradesh, went to the new team Gujarat Titans for Rs 3.2 crore and Himachal Pradesh bowler Vaibhav Arora bought for Rs 2 crore by Punjab Kings were the other uncapped players who got good deals. Tamil Nadu spinner R Sai Kishore (snapped up by Gujarat Titans for Rs 3 crore) was another big deal grabber among those who haven't yet donned the India colours.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Batter's \"Perfect Reply\" After Teammate Gets A Rude Send-Off","link":"https://sports.ndtv.com/cricket/batters-perfect-reply-after-teammate-gets-a-rude-send-off-in-european-cricket-league-watch-video-2767397","keywords":null,"creator":null,"video_url":null,"description":"Another batter replying on behalf of a send-off given to his teammate is not a common sight in the gentleman's game. Chris Williams did exactly that in a European Cricket League match.","content":null,"pubDate":"2022-02-14 09:14:01","full_description":"Send-offs are not unusual on a cricket field, that includes a bowler taking off his shoes and symbolically using it like a phone. A batters' reply to the same bowler after getting the better of him in the next outing is also something that has happened in the past. But another batter replying to a send-off given to his teammate is not a common sight in the gentleman's game. Chris Williams did exactly that in a European Cricket League match. The Tunbridge Wells captain, after hitting a couple of sixes, decided to copy Dreux bowler Wahid Abdul's celebration which he had used after cleaning up William's teammate Marcus O'Riordan in the previous over. The bowler who was at the receiving end of Williams' sixes and also the celebration was however K Ahmadzai. It all started when Wahid Abdul bowled a perfect yorker in the 8 th over of Tunbridge Wells innings to clean up O'Riordan, who had hit back-to-back boundaries in his first two balls in the same over. Abdul took off his shoe and used to like a phone to celebrate his wicket. This is a common mode of celebration used previously by players like Dave Mohammad and Tabraiz Shamsi after picking up a wicket. Banter you WOULD NOT like to miss ???? C. Williams comes up with a perfect reply to his teammate's dismissal ???? @BET2BALL European Cricket League 2022 | Presented by @KibaInuWorld | @Cricket_Espana pic.twitter.com/Q8H3HMuMO0 In the next over, Williams, who was at the non-striker's end when O'Riordan received the send-off from Abdul, hit Ahmadzai for a six and used his bat to make a symbolic gesture of using a phone. Williams repeated the same act after hitting another six off Ahmadzai in the next delivery. Tunbridge Wells also ended up winning the contest by 50 runs. Batting first, they put together a mammoth 141 for 3 in their allotted 10 overs powered by blistering fifties from captain Chirs Williams (56) and Alex Williams (58). In reply, Dreux were bowled out for 91 in just 7.2 overs as Joe McCaffrey picked up three wickets for 9 runs in his 1.2 overs.","image_url":"https://c.ndtvimg.com/2022-02/3a7rsft8_european-cricket_120x90_14_February_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"FBA vs COV Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BPL 2022 Qualifier 1 at Sher-e-Bangla National Stadium, Dhaka, 5:00 PM IST February 14","link":"https://zeenews.india.com/cricket/fba-vs-cov-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-bpl-2022-qualifier-1-at-sher-e-bangla-national-stadium-dhaka-500-pm-ist-february-14-2436473.html","keywords":null,"creator":null,"video_url":null,"description":"Fortune Barishal vs Comilla Victorians Dream11 Team Prediction Fortune Barishal vs Comilla Victorians, 1st Qualifier - Check My Dream11 Team, Best players list of FBA vs COV, Fortune Barishal Dream11 Team Player List, Comilla Victorians Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Bangaladesh Premier League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-14 09:02:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"MI Probable Playing 11 2022: Mumbai Indians Playing 11 IPL 2022","link":"https://thesportsrush.com/cricket-news-mi-probable-playing-11-2022-mumbai-indians-playing-11-ipl-2022/","keywords":["Cricket","IPL 2022","Mumbai Indians","Indian Premier League","MI"],"creator":["Dixit Bhargav"],"video_url":null,"description":"MI Probable Playing 11 2022: The most successful Indian Premier League franchise have put together an intriguing 25-member squad. Mumbai Indians kept their cards close to the chest for a large part of the mega auction ahead of the 15th season of the Indian Premier League. The recently concluded two-day affair in Bengaluru witnessed Mumbai… The post MI Probable Playing 11 2022: Mumbai Indians Playing 11 IPL 2022 appeared first on The SportsRush.","content":"MI Probable Playing 11 2022: The most successful Indian Premier League franchise have put together an intriguing 25-member squad. Mumbai Indians kept their cards close to the chest for a large part of the mega auction ahead of the 15th season of the Indian Premier League. The recently concluded two-day affair in Bengaluru witnessed Mumbai puzzling one and all with their lack of participation barring buying wicket-keeper batter Ishan Kishan for a record amount with respect to the IPL 2022 auction. It was only in the second half of Day 2 that Indians revealed their cards to surprisingly bid for injured England fast bowler Jofra Archer, who will miss this season. After spending a mammoth INR 23.25 crore on Kishan and Archer, MI built a squad around them and their four high-profile retained players, of course. Having once again spent lavishly on bolstering their fast-bowling arsenal, the Rohit Sharma-led franchise bought a maximum of 25 players after almost exhausting their purse (only INR 10 lakh remaining at the end of the mega auction). Mumbai, who will doubtlessly miss the likes of Quinton de Kock, Hardik Pandya, Krunal Pandya and Rahul Chahar in IPL 2022, should continue to be a force to reckon with this season. MI Probable Playing 11 2022 Not many IPL franchises have the cushion of their top-order comprising of three members of the current Indian white-ball squad. Indians, who should be relishing this well-deserved privilege, don’t have to think much in this department. On the contrary, it is the No. 4 position which will witness a stiff competition among their plethora of uncapped Indian batters. Despite being up the pecking order in terms of seniority, Anmolpreet Singh might still have to wait for an elongated run as MI have bought a fascinating prospect in Hyderabad’s Tilak Varma. Mumbai, who have no option than to groom a rookie batter in the middle-order, could start with 19-year old Varma. Options other than Varma and Anmolpreet Singh include Aryan Juyal, Arshad Khan, Rahul Buddhi and Hrithik Shokeen. Singapore batter Tim David is almost certain of getting the nod to partner vice-captain Kieron Pollard for the finishers’ role. Uncapped South Africa batter Dewald Brevis, who won the Man of the Series award in the recently concluded ICC U-19 Cricket World Cup 2022, might have to wait for his chance. Wow! Let’s gooooo @mipaltan https://t.co/TnvoFo39jv — Tim David (@timdavid8) February 13, 2022 While Indians would look to hand Krunal Pandya’s role to Tamil Nadu all-rounder Sanjay Yadav, one out of Murugan Ashwin or Mayank Markande could replace spinner Chahar. With fast bowler Jasprit Bumrah set to lead the bowling attack, he will continue to enjoy the support of a couple of overseas fast bowlers (two out of Daniel Sams, Tymal Mills, Riley Meredith). Assuming that Australian players’ availability gets affected due to either of national duty or Sheffield Shield, the team management could play another Indian pacer (out of Jaydev Unadkat, Basil Thampi, Arjun Tendulkar) alongside Bumrah and Mills. In such a situation, Mumbai will have the option of including hard-hitting West Indies all-rounder Fabian Allen (like-for-like replacement for Sanjay Yadav) as their fourth overseas player. Mumbai Indians Playing 11 IPL 2022 – 1) Rohit Sharma (c) 2) Ishan Kishan (wk) 3) Suryakumar Yadav 4) Tilak Varma 5) Tim David 6) Kieron Pollard 7) Sanjay Yadav 8) Daniel Sams 9) Murugan Ashwin 10) Jasprit Bumrah 11) Tymal Mills / Riley Meredith The post MI Probable Playing 11 2022: Mumbai Indians Playing 11 IPL 2022 appeared first on The SportsRush.","pubDate":"2022-02-14 07:51:49","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ARC-W vs TOC-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Women’s T20 Blast, Match 16","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/arc-w-vs-toc-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-women-s-t20-blast-match-16?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-14 07:34:39","full_description":"Aryan Club Women (ARC-W) will take on Town Club Women (TOC-W) in the 16th match of the Bengal Women’s T20 Blast on Monday, February 14. The Bengal Cricket Academy Ground in Kalyani will host this contest. Aryan Club have begun the tournament under terrible circumstances, having won only once so far in five matches. They’ve suffered plenty of heavy losses and confidence will be low in the camp. It goes without saying that they are stuck to the bottom of the table. Town Club, meanwhile, have had a decent start to their campaign. They’ve won three of their matches so far and are third in the table behind East Bengal and Mohammedan, who have also won three games each. ARC-W XI Hrishita Nidaldri Basu, Ritika Pal, Prativa Rana , Shahida Khatun , Jhumia Khatun , Chandrima Ghosal , Pragati Prasad, Komal Jaiswal, VR Vanitha, Sasthi Mondal, Megha Ghosh. TOC-W XI Sukanya Parida (c), Sneha Gupta, Parna Paul (wk), Srilekha Roy, Sagarika Sengupta, Priti Choudhary, Rupal Tiwari, Rukmoni Roy, Monika Mal, Kashish Agarwal, Ankita Barman. Match: ARC-W vs TOC-W, Bengal Women’s T20 Blast, Match 16. Date and Time: 14th February, 2022, 1:00 PM IST. Venue: Bengal Cricket Academy Ground, Kalyani. It will be difficult to score runs easily on this track. Batters will need to be patient and drop the anchor before deciding to take on the bowlers. They will also need to time their strokes well in order to get boundaries. A score of 120 is expected to be par here. Wicketkeeper H Basu: Basu could prove to be a decent wicket-keeper choice for your Dream11 Fantasy Side. She has scored runs consistently and will be looking for a big knock. Batters A Barman: Barman was in good nick in the previous match against Kalighat Club Women. She scored only nine runs but picked up three wickets for her side. V Vanitha: Vanitha is a decent player who can take on opposition bowlers at any stage of the game. All-rounders J Khatun: Khatun is a fantastic all-rounder who has been at the top of her game in recent matches. Against Town Club Women, she scored 13 runs and picked up a wicket. She will be an excellent multiplier choice for your Dream11 Fantasy Side for this match. Bowlers M Mal: Mal has bowled brilliantly and has consistently hit the right areas in this tournament. She will be expected to add more wickets to her tally in this game. J Khatun (Aryan Club Women) – 355 points. A Barman (Town Club Women) – 295 points. M Mal (Town Club Women) – 221 points. S Parida (Town Club Women) – 219 points. S Gupta (Town Club Women) – 208 points. J Khatun: 85 runs and 7 wickets. A Barman: 77 runs and 6 wickets. M Mal: 5 wickets. S Parida: 5 wickets. S Gupta: 102 runs. Fantasy Suggestion #1: H Niladri Basu, A Barman, V Vanitha, S Mondal, J Khatun, M Ghosh, S Gupta, P Rana, M Mal, S Parida, R Tiwari. Captain: J Khatun | Vice-Captain: A Barman. Fantasy Suggestion #2: H Niladri Basu, P Paul, A Barman, V Vanitha, S Roy, J Khatun, M Ghosh, S Gupta, M Mal, S Parida, R Tiwari. Captain: S Gupta | Vice-Captain: M Mal.","image_url":"https://static.sportskeeda.com/editor/2022/02/1d648-16448197525740-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - Australia vs Sri Lanka, Sri Lanka in Australia 2021/22, 3rd T20I - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9zcmktbGFua2EtaW4tYXVzdHJhbGlhLTIwMjEtMjItMTI2MzQ1OS9hdXN0cmFsaWEtdnMtc3JpLWxhbmthLTNyZC10MjBpLTEyNjM0NzMvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - Australia vs Sri Lanka, Sri Lanka in Australia 2021/22, 3rd T20I  ESPNcricinfoAussies hold nerve to claim Super Over victory | Australia v Sri Lanka 2021-22  cricket.com.auAustralia vs Sri Lanka – 3rd T20 International Preview & Prediction  The Stats ZoneSri Lanka out to shrug off Super Over heartbreak with series slipping away | Cricbuzz.com - Cricbuzz  CricbuzzAustralia vs. Sri Lanka Prediction, Betting Tips & Odds 15 FEBRUARY, 2022  Telecom AsiaView Full coverage on Google News","content":null,"pubDate":"2022-02-14 07:29:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India seek to sort out batting and fielding woes in 2nd women’s ODI against NZ","link":"https://www.tribuneindia.com/news/sports/india-seek-to-sort-out-batting-and-fielding-woes-in-2nd-womens-odi-against-nz-369797","keywords":null,"creator":null,"video_url":null,"description":"Queenstown, February 14 The crushing defeat in the opening game exposed a lot of chinks in their armour and a depleted India will be eager to address their batting and fielding woes when they face New Zealand in the second women's ODI here on Tuesday. Nothing worked for India in the first ODI on Saturday with the bowlers allowing the hosts to pile on 275 before the batters, except for captain Mithali Raj, flopped to be all out for 213 and lose the match by 62 runs. Raj was virtually the lone hand with a well-crafted 59 while rookie Yastika Bhatia made 41. All the other batters, including vice captain Harmanpreet Kuar (10 off 22 balls), failed to make any significant contribution in the face of a clinical bowling show from New Zealand led by Jesse Kerr (4 for 35). The Indians' cause was not helped by the absence of senior opener Smriti Mandhana who missed the first ODI due to extended quarantine, along with Renuka Singh and Meghana Singh. Mandhana and Meghana are not likely to be available for the second ODI either but pacer Renuka could make the team as she is out of her quarantine. In the first ODI, India collapsed from 105 for 2 to 165 for 6 as New Zealand kept their line and length accurate. With both experienced batters Raj and Harmanpreet dismissed in quick succession by the 33rd over, both by Jess Kerr, India could not chase down the target. Before that, the Indian bowlers let New Zealand score 275. The Indians seemed to have tied down the New Zealand batters till around the halfway mark but the hosts upped the ante in the middle overs to reach a big score. Centurion Suzie Bates was let off early when she was 13 with Rajeshwari Gayakwad dropping her at point and that sloppy fielding cost India dear. Bates went on to score 106 to anchor the New Zealand innings. The return to form of opener Bates, who scored her 11th ODI hundred and first in 19 innings, could be ominous for India. The only positive from the first game was that barring Harmanpreet, all the Indian bowlers were among wickets with Deepti Sharma, Pooja Vastrakar, Jhulan Goswami and Rajeshwari Gayakwad taking two apiece, while Poonam Yadav got one. With the 50-over World Cup less than three weeks away, Raj was a bit concerned, especially on the batting front, though she expected the team to make improvements. \"We should be able to score 270 because that's the standard now in women's cricket,\" she said. She also wanted her bowlers to get used to the New Zealand conditions at a faster pace. \"It's important to get used to the conditions, it's in a way good that we are playing a series before World Cup. We definitely made a comeback in later half of first innings. It took time for the bowlers to get used to windy conditions, because there was a lot of breeze in the middle.\" The Squads: India: Mithali Raj copy;, Harmanpreet Kaur (vc), Shafali Verma, Yastika Bhatia, Deepti Sharma, Richa Ghosh (wk), Sneh Rana, Jhulan Goswami, Pooja Vastrakar, Taniya Bhatia (wk), Rajeshwari Gayakwad, Poonam Yadav, Simran Dil Bahadur. New Zealand: Sophie Devine copy;, Amy Satterthwaite (vc), Suzie Bates, Lauren Down, Maddy Green, Brooke Halliday, Hayley Jensen, Fran Jonas, Jess Kerr, Melie Kerr, Frankie Mackay, Rosemary Mair, Katey Martin, Hannah Rowe, Lea Tahuhu. Match starts at 3:30 am IST.","content":null,"pubDate":"2022-02-14 06:32:07","full_description":"PTI Queenstown, February 14 The crushing defeat in the opening game exposed a lot of chinks in their armour and a depleted India will be eager to address their batting and fielding woes when they face New Zealand in the second women’s ODI here on Tuesday. Nothing worked for India in the first ODI on Saturday with the bowlers allowing the hosts to pile on 275 before the batters, except for captain Mithali Raj, flopped to be all out for 213 and lose the match by 62 runs. Raj was virtually the lone hand with a well-crafted 59 while rookie Yastika Bhatia made 41. All the other batters, including vice captain Harmanpreet Kuar (10 off 22 balls), failed to make any significant contribution in the face of a clinical bowling show from New Zealand led by Jesse Kerr (4 for 35). The Indians’ cause was not helped by the absence of senior opener Smriti Mandhana who missed the first ODI due to extended quarantine, along with Renuka Singh and Meghana Singh. Mandhana and Meghana are not likely to be available for the second ODI either but pacer Renuka could make the team as she is out of her quarantine. In the first ODI, India collapsed from 105 for 2 to 165 for 6 as New Zealand kept their line and length accurate. With both experienced batters Raj and Harmanpreet dismissed in quick succession by the 33rd over, both by Jess Kerr, India could not chase down the target. Before that, the Indian bowlers let New Zealand score 275. The Indians seemed to have tied down the New Zealand batters till around the halfway mark but the hosts upped the ante in the middle overs to reach a big score. Centurion Suzie Bates was let off early when she was 13 with Rajeshwari Gayakwad dropping her at point and that sloppy fielding cost India dear. Bates went on to score 106 to anchor the New Zealand innings. The return to form of opener Bates, who scored her 11th ODI hundred and first in 19 innings, could be ominous for India. The only positive from the first game was that barring Harmanpreet, all the Indian bowlers were among wickets with Deepti Sharma, Pooja Vastrakar, Jhulan Goswami and Rajeshwari Gayakwad taking two apiece, while Poonam Yadav got one. With the 50-over World Cup less than three weeks away, Raj was a bit concerned, especially on the batting front, though she expected the team to make improvements. “We should be able to score 270 because that’s the standard now in women’s cricket,” she said. She also wanted her bowlers to get used to the New Zealand conditions at a faster pace. “It’s important to get used to the conditions, it’s in a way good that we are playing a series before World Cup. We definitely made a comeback in later half of first innings. It took time for the bowlers to get used to windy conditions, because there was a lot of breeze in the middle.” The Squads: India: Mithali Raj ©, Harmanpreet Kaur (vc), Shafali Verma, Yastika Bhatia, Deepti Sharma, Richa Ghosh (wk), Sneh Rana, Jhulan Goswami, Pooja Vastrakar, Taniya Bhatia (wk), Rajeshwari Gayakwad, Poonam Yadav, Simran Dil Bahadur. New Zealand: Sophie Devine ©, Amy Satterthwaite (vc), Suzie Bates, Lauren Down, Maddy Green, Brooke Halliday, Hayley Jensen, Fran Jonas, Jess Kerr, Melie Kerr, Frankie Mackay, Rosemary Mair, Katey Martin, Hannah Rowe, Lea Tahuhu. Match starts at 3:30 am IST.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_79959550.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 mega auction: Jasprit Bumrah, Jofra Archer bowling in tandem for MI will be exciting to watch, says Zaheer Khan","link":"https://zeenews.india.com/cricket/ipl-2022-mega-auction-jasprit-bumrah-jofra-archer-bowling-in-tandem-for-mi-will-be-exciting-to-watch-says-zaheer-khan-2436397.html","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Indians Director of Cricket Zaheer Khan reacts on recruiting new bowler Jofra Archer and already having Jasprit Bumrah in the squad.","content":null,"pubDate":"2022-02-14 05:49:00","full_description":"Mumbai Indians' director of cricket Zaheer Khan has said that he is \"very excited\" to have two of the best fast bowlers in the world -- Jasprit Bumrah and Jofra Archer -- in the side, and it would be great to see the two bowl \"in tandem\" in future. Five-time IPL champions Mumbai Indians spent big money on buying Jofra Archer in the Mega Auction on Sunday (February 13) despite his availability concerns, and the fact that he might not play for the franchise in the upcoming season. Mumbai got Archer for INR eight crore despite the pacer not playing any competitive cricket in the last 10 months due to an elbow injury. Cricket World ain't ready for Jasprit Bumrah and Jofra Archer combo. pic.twitter.com/SxXX1jpd8O — R A T N I S H (@LoyalSachinFan) February 13, 2022 In an email reportedly sent to franchises earlier this month, IPL chief operating officer Hemang Amin had said that Archer would be part of the accelerated set of players. Amin had also reportedly said that the England and Wales Cricket Board (ECB) had made it clear that Archer was \"unlikely\" to play in IPL 2022 and if any franchise picks him up they will not be able to get a replacement. \"The ECB has registered Jofra Archer for the auction with a view to potential participation in 2023 and 2024, as due to his current injury it is unlikely that he can participate in IPL 2022,\" ESPNcricinfo had quoted Amin as saying earlier in February. However, former India pacer Zaheer told the Mumbai Indians website that, \"We're very excited, two of the world's best fast bowlers bowling in tandem together.\" Zaheer when asked about MI going all guns blazing to get wicketkeeper-batter Ishan Kishan, said, \"We all love him, he is a young upcoming kid and has been with us for the last four years so we definitely wanted him back. Him and Rohit (Sharma) are going to be a force to reckon with at the top.\" On South African Dewald Brevis, the pace bowler said, \"We hope that we will grow further and his journey is fast tracked by being around such high impact experienced (SA) players.\" Singapore big-hitting finisher Tim David was a surprise purchase by MI and head coach Mahela Jayawardene said, \"He was on our radar for a while. He has been playing well for the last few months. We knew Jofra (Archer) would come late so we couldn't go hard in the beginning but needed someone to strengthen our batting so we decided to play a different game altogether. David was part of that plan. We had the purse to go get them both.\" On the several uncapped players bough by MI over the weekend, the former Sri Lankan great said, \"Credit to the scouting team of MI, they've worked really hard to help us make the right decisions at the table, they've helped us understand what kind of players will suit our setup. We have our core group ready and we'll have young players around that.\"","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“When your name comes up and then the bidding starts, it happens pretty quickly”: Josh Hazlewood talks about getting a IPL 2022 contract with Royal Challengers Bangalore","link":"https://thesportsrush.com/cricket-news-314017-2/","keywords":["Cricket","IPL Auction","Josh Hazlewood","RCB"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Josh Hazlewood has been terrific in the T20 format in recent times, and he got a heavy IPL contract with RCB as his reward. The rise of Josh Hazlewood with the white-ball has been tremendous so far. Around a couple of years ago, he was the red-ball specialist, but he is now an integral part… The post “When your name comes up and then the bidding starts, it happens pretty quickly”: Josh Hazlewood talks about getting a IPL 2022 contract with Royal Challengers Bangalore appeared first on The SportsRush.","content":"Josh Hazlewood has been terrific in the T20 format in recent times, and he got a heavy IPL contract with RCB as his reward. The rise of Josh Hazlewood with the white-ball has been tremendous so far. Around a couple of years ago, he was the red-ball specialist, but he is now an integral part of all three formats. In the IPL 2022 auction, RCB bought him for a whopping price of 7.75 crores. He was the 2nd most expensive Aussie after Tim David. In the ongoing T20I series against Sri Lanka, he took his career-best figures (4-12) in the first game. In the second game, his figures were 3-22, whereas he also bowled the super over. Hazlewood was one of the best bowlers of Australia in their ICC T20 World Cup 2021 title victory. Josh Hazlewood opens up in IPL 2022 auction Josh Hazlewood was part of the Chennai Super Kings in the 2021 season. RCB had their intentions clear that they want Hazlewood in their team. Hazlewood has revealed that he was on his couch during the auction and everything went quick. He also said that everyone wants to bowl the tough overs in the international format. “I was just sitting at home watching on the couch,” Hazlewood said of the auction. “It’s a strange thing to sit through, when your name comes up and then the bidding starts. It happens pretty quickly.” “Everyone wants to bowl those difficult overs and really nail them.” “That’s when you get put up in lights for things like the IPL. It’s good to be the man.” Our latest signing, Josh Hazlewood, put in a Man of the Match performance tonight against , giving away just 5⃣ runs in the super over, to help win the second T20I. Overs: 4⃣ Wickets: 3⃣ Runs: 2⃣2⃣ Econ: 5⃣.5⃣#PlayBold #WeAreChallengers pic.twitter.com/5wOJYKQmek — Royal Challengers Bangalore (@RCBTweets) February 13, 2022 Matthew Wade also had a lot of praise for Josh Hazlewood after the 2nd T20I against Sri Lanka. Wade said that he has not seen Hazlewood bowling any better in the T20Is. “The way ‘Hoff’ (Hazlewood) bowled that last over was extraordinary,” Wade said. “(It is) the best I’ve seen him bowl in T20 for a long time. His 50-over stuff has always been excellent, his Test cricket (as well).” “This is the one (format) he probably hasn’t mastered until the last two years.” The post “When your name comes up and then the bidding starts, it happens pretty quickly”: Josh Hazlewood talks about getting a IPL 2022 contract with Royal Challengers Bangalore appeared first on The SportsRush.","pubDate":"2022-02-14 05:12:39","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}