{"newsArray":[{"title":"ECB blasted over Essex racism probe following barrister's independent inquiry","link":"https://www.dailymail.co.uk/sport/cricket/article-12232489/ECB-blasted-Essex-racism-probe-following-barristers-independent-inquiry.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY MATT HUGHES: Mail Sport's revelations will lead to further questions about why the Newton report has not been published 18 months after it was commissioned.","content":"EXCLUSIVE: The ECB are blasted over Essex racism probe as barrister's inquiry finds officials failed to interview ex-chairman John Faragher before he was charged with using racist language The ECB have been strongly criticsed by a review into the racism inquiry at Essex Former Essex chairman John Faragher left the club back in November 2021 The r eport alleges the ECB failed to interview him before racist language charge By Matt Hughes For The Daily Mail Published: 22:30 BST, 25 June 2023 | Updated: 01:19 BST, 26 June 2023 e-mail View comments The ECB have been strongly criticised by leading barrister Katharine Newton KC in her independent inquiry into alleged racism at Essex. Mail Sport has seen a copy of Newton’s interim report, commissioned by Essex in November 2021 and completed by the following March, but which has yet to be published 15 months later. In bombshell revelations that will embarrass the ECB ahead of Monday's publication of a separate independent report into discrimination in cricket and Wednesday’s second Ashes Test at Lord’s, Mail Sport can disclose that Newton’s inquiry: Criticises ECB investigators for failing to interview former Essex chairman John Faragher before charging him with using racist language. Concludes the ECB broke its own regulations by pressuring Essex to remove Faragher in November 2021, which included a threat to stop hosting women’s internationals at Chelmsford. A leading barrister has criticised the ECB for failing to interview former Essex chairman John Faragher (left) before charging him with racist language Rejects the ECB’s formal denial of this governance breach, first reported by Mail Sport in April 2022, raising the possibility of an attempted cover-up Highlights the ECB’s failure to investigate Faragher three years earlier, when a complaint that he had made a racist remark was made in person to then ECB chairman Colin Graves. Mail Sport’s revelations will lead to further questions about why the Newton report has not been published 18 months after it was commissioned. Newton’s criticisms relate to a previous regime at Lord’s before the appointments of Richard Thompson and Richard Gould as chairman and chief executive last year. The ECB declined to comment. Newton’s first report focuses on the allegation that then Essex chairman Faragher used the phrase ‘n***** in the woodpile’ at a Board meeting in November 2017, which he has always denied. She also went on to produce a second report last year into allegations of racism made against former Essex players and coaches, which has also been completed but has yet to be published. Following a four-month investigation Newton concluded ‘on the balance of probabilities’ that Faragher did use the offensive remark. After their independent inquiry found against Faragher Essex pleaded guilty to two ECB charges of bringing the game into disrepute and were fined £50,000. Newton's independent inquiry also claimed the ECB broke their own regulations by pressuring Essex to remove Faragher in November 2021 But in her report Newton is scathing about the ECB’s investigation, expressing astonishment that Faragher was never interviewed by the ECB, who she claims only spoke to those who supported the allegations. Newton’s criticisms echo those made by the seven Yorkshire players charged by the ECB with making racist comments to Azeem Rafiq last year, many of whom also complained about not being interviewed during the investigation. ‘It is apparent the ECB has adopted a very different investigatory process to mine,’ Newton writes. ‘First, the ECB has not interviewed John Faragher at any point, even though he is the person accused of making the remark. It is unclear to me why the ECB has adopted this approach in circumstances where there is a dispute of evidence as to whether or not the comment was indeed made. ‘Second, the ECB has only interviewed some, but not all, attendees at the relevant meetings. In particular, in so far as ‘The Comment’ part of the charge is concerned, the ECB appears to have focussed only on interviewing those whose evidence is supportive of the charge.’ Newton also endorses revelations in Mail Sport 14 months ago that the ECB broke their own rules by instructing Essex to sack Faragher in November 2021, before he had even been charged and just two days after he had given a week to respond to queries from the ECB’s then head of investigations James Pyemont. The damning revelations come days before the second Ashes Test gets underway at Lord's The ECB strongly denied Mail Sport’s reporting then but Newton’s conclusion is different. ‘In November 2021, post the revelations about what had occurred at Yorkshire, JF was informed by the ECB that the allegation concerning the “woodpile” comment had been made against him and he needed to respond to the allegation,’ she writes. ‘In the original letter from the ECB, JF was given a period of time to respond. However, on the morning of November 11, 2021, JF received a call from the acting chairman of the ECB, Barry O’Brien, to say that he was going to be dismissed that night. The ECB, via (Essex chief executive) John Stephenson, also threatened the club with the removal of its women’s internationals and other sanctions if JF was not removed as chairman. This was pressure the club felt unable to resist.’ Newton also confirms other reports that the ECB failed to deal with the matter when a complaint was raised over three-and-a-half years earlier. Given Essex were charged and fined by the ECB for failing to investigate the incident properly Newton’s confirmation of the Graves meeting raises the question of whether the governing body’s disciplinary arm should take action against themselves. ‘In March 2018 a member of the (Essex) Board contacted the ECB about JF and met with Colin Graves, then chairman,’ Newton writes. ‘This individual told me that he discussed the woodpile comment, and CG told the individual that “this was not their jurisdiction. This was not something that they could get involved with and it was something the club had to deal with themselves”.’ Share or comment on this article: ECB blasted over Essex racism probe following barrister's independent inquiry e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-25 21:58:46","image_url":"https://i.dailymail.co.uk/1s/2023/06/25/22/72519275-0-image-a-49_1687728437223.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australian cricketers","link":"https://www.dailymail.co.uk/sport/cricket/article-12232295/JASON-GILLESPIE-Playing-Lords-brings-sense-tradition-history-Australian-cricketers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: As I found in 2001, it is a quirky place but it has that richness that really gets you going. It's a wonderful place to play cricket and it was a thrill to get my name on the honours board.","content":"JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australia's cricketers... but they must be wary of the famous slope England and Australia face off in the second Ashes Test at Lord's on Wednesday For Aussie cricketers, playing at the famous ground is a truly unique experience It is a special place to play at but there are lots of things you need to adapt to By Jason Gillespie For The Daily Mail Published: 17:30 EDT, 25 June 2023 | Updated: 17:52 EDT, 25 June 2023 e-mail View comments For Australian cricketers, playing at Lord’s brings a sense of tradition and history and provides a totally different experience to other grounds. From coming through the Long Room, walking down through the members out on to the ground, or sitting in the changing rooms, looking at the honours boards and all the wonderful players from around the world that have played Test matches and been successful, to the paintings on the walls, and even the famous lunches — all these things are special. As I found in 2001, it is a quirky place but it has that richness that really gets you going. It’s a wonderful place to play cricket and it was a thrill to get my name on the board with a five-for in the second innings of my Lord’s Test debut. Australians have tended to soak up that opportunity to play there rather than be intimidated by it, and I think that’s sometimes because players who have been picked on tours think they may never get another opportunity to play at this iconic ground, so they really want to embrace it. Even the quirkiness of the scene can be inspiring — people wearing ties and jackets in the stands, sat on little seat cushions with scorebooks and a Thermos of coffee. England face Australia at Lord's but the Aussies will have to be wary of the famous slope The Lord's slope is iconic in cricket and it often take a little bit of time to get used to it For Australian players like Scott Boland (left) - who have never played a Test at Lord's - it is a truly unique experience and there a lot of factors you need to adapt to Lord’s also has the famous slope for bowlers to contend with, and that takes a little bit to get used to it. You just need to adjust your line ever so slightly. If you’re aiming to hit off stump, you’re probably starting the ball just a fraction outside off stump from the pavilion whereas from the nursery end, if you want to bowl that off stump, fourth stump line, you’re looking at a middle, middle-and-off line. But all cricketers need to adjust to the conditions they are presented with and Lord’s is no different. So the likes of Scott Boland and Cameron Green will need to get out and familiarise themselves with the surroundings. Australia head into the second Test in great spirits after a rare tight win over England. Until Birmingham, any Ashes Test since 1924-25 with a result margin of less than 20 runs or fewer than two wickets had gone against them, so it’s a great sign that this 2023 team has overturned that statistic. The opening game just showed there is more than one way to win in Test cricket. England’s approach of scoring consistently quicker than Australia across both innings was valid, but we saw two captains in Pat Cummins and Ben Stokes using different field settings and employing their bowlers in different ways. There were question marks on day one about the defensive field placings Cummins had. But in their strategy meetings, Australia would have conceded that England play a certain attacking way, so they may as well protect an extra boundary. I feel that as Lord’s offers a little bit more assistance for the ball early in the game, we will see slightly more attacking fields and I don’t expect to see a sweeper out on the off side from the get-go. There were question marks about Pat Cummins's captaincy during the first Test last week Ben Stokes's tactics were different but it showed there is more than one way to win a Test If they have one, it will probably be on the leg-side which allows a quick bowler to bowl a bit straighter and gives them the option of bowling a bouncer as well. Imagine the energy, positivity and confidence the whole Australia dressing room must have got from Cummins, their leader, not only talking the talk but walking the walk. He certainly led from the front, and at the point when you thought Australia might shut up shop with 52 further runs required and two wickets standing, he went bang-bang with two sixes off Joe Root. No doubt Australia will take confidence from that but England won’t be despondent about what was obviously a disappointing loss. It was fascinating to see a Test decided by two wickets but with teams employing completely different strategies.If the first Test is anything to go by, this is going to be an absolute cracker of series that still looks too close to call. Share or comment on this article: JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australian cricketers e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-25 21:52:19","image_url":"https://i.dailymail.co.uk/1s/2023/06/25/22/72520097-0-image-a-22_1687729927609.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ashleigh Gardner spins Australia back into the box seat during chaotic Ashes session","link":"https://7news.com.au/sport/cricket/ashleigh-gardner-spins-australia-back-into-the-box-seat-during-chaotic-ashes-session-c-11086455","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"England are in need of an Ashes miracle after Ashleigh Gardner flipped the script on its head.","content":"Ashleigh Gardner has spun back into the box seat of the after a chaotic fourth day ended with England 5-116 chasing 268 for victory. On a dramatic Sunday at Trent Bridge, Australia fell from 1-149 to all out for 257 in their second innings, after star spinner Sophie Ecclestone fuelled two separate collapses of 6-49 and 3-0. Watch, Stream & Catch Up with Australia's Home of Cricket on England then got away to a flyer in the chase, and looked as if they could pull it off in a canter when they scored 0-55 from their first 10 overs. Then Gardner arrived. After the finger-spinning allrounder took 4-99 in the first innings, she removed the in-form Tammy Beaumont with her first ball in the second innings. Fresh off scores of 201 in a warm-up game and 208 in the first innings at Trent Bridge, Beaumont squeezed Gardner to first slip on 22 where Beth Mooney took the catch. Gardner then got rid of veteran Nat Sciver-Brunt in her next over for a duck on a top-edged sweep, before a sharp-turning delivery trapped Heather Knight lbw for 1. Ecclestone is widely regarded as the world’s best spinner but Gardner must be in the conversation. “I think Ash isn’t too far behind her,” Australia opener Beth Mooney said. “She has been outstanding for us in the past couple of years. “There was a time two or three years ago where Meg tended to not throw the ball to Ash in T20 cricket. “To her credit she changed what she did and changed her variations and things like that.” England opener Emma Lamb also fell in the collapse, lbw to Tahlia McGrath when ball-tracking showed it would have clipped leg stump. Kim Garth then struck in the shadows of stumps to have Sophia Dunkley caught behind for 16, leaving Danni Wyatt (20no) and nightwatcher Kate Cross to fight to the close with 152 more needed. England will need to not only pull off the biggest successful chase in a women’s Test to win, but also eclipse the record for the highest fourth-innings score in any result. “They had the ball on a string in the last 60 minutes,” Mooney said. “It’s pretty tough conditions once the ball gets a bit soft. “The game is teetering ... but we feel like we are probably the happier team walking off.” Australia, for their part, would still feel life could be more comfortable. They were cruising late in the morning session, before England debutante Lauren Filer claimed Ellyse Perry’s wicket for the second time in the match on 25 and also bowled McGrath for one with her pace. Ecclestone then took command, claiming her second five-wicket haul of the Test and making for match figures of 10-192. She bowled Jess Jonassen sweeping on 14, had Mooney chop on to a ball that spun back to her sharply on 73 and got first-innings Annabel Sutherland caught pulling on 15. Alyssa Healy survived a dropped chance first ball that would have marked her fourth straight Test duck, before she posted a counter-attacking 50 to give Australia something to bowl at. But just when she and Alana King looked set to take Australia to a lead of 300 with a 59-run eighth-wicket stand, Australia lost 3-0 with Ecclestone taking the last two wickets to finish with 5-63 for the innings. “We will always believe. We will go into tomorrow ready to win this Test match,” Ecclestone said.","pubDate":"2023-06-25 21:32:16","image_url":"https://images.7news.com.au/publication/C-11086455/ffa9d095b8c563d2da30631fb3a1b9362c6d8e09-16x9-x0y0w1024h576.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Home runs and cricket greats mean happy welcome for MLB in London","link":"https://www.theguardian.com/sport/2023/jun/25/baseball-cricket-mlb-london-st-louis-cardinals-chicago-cubs","keywords":["Baseball","Chicago Cubs","St Louis Cardinals","US sports","Sport","Cricket"],"creator":["Andy Zaltzman at London Stadium"],"video_url":null,"description":"St Louis Cardinals played the Chicago Cubs, enhanced by the guest presence of Jimmy Anderson and Nathan LyonCricket and its long‑lost rogue cousin, baseball, enjoyed an emotional reunion over the weekend. Jimmy Anderson pitched in front of a crowd almost twice as big as any he has bowled in front of in England, and in all more than 100,000 people attended a two‑game series between the Chicago Cubs and St Louis Cardinals at the London Stadium, constituting a mere 0.08% of the Major League Baseball regular season. Indian Premier League franchise owners no doubt cast envious eyes at baseball, dreaming wistfully of a 2,430-game regular season. Cricketers may be tempted by $350m (£275m) 12-year contracts.The weekend offered everything sports watchers in Britain have come to expect from visiting American major‑league events – a large crowd with considerable enthusiasm for the sport, but understandably limited emotional investment in the result, an armageddon’s‑worth of cholesterol and a stadium announcer with the kind of deeply sonorous and unquenchably American voice that could imbue a village-fete cake competition with a sense of fundamental sporting gravity. Continue reading...","content":"C ricket and its long‑lost rogue cousin, baseball, enjoyed an emotional reunion over the weekend. Jimmy Anderson pitched in front of a crowd almost twice as big as any he has bowled in front of in England, and in all more than 100,000 people attended a two‑game series between the Chicago Cubs and St Louis Cardinals at the London Stadium, constituting a mere 0.08% of the Major League Baseball regular season. Indian Premier League franchise owners no doubt cast envious eyes at baseball, dreaming wistfully of a 2,430-game regular season. Cricketers may be tempted by $350m (£275m) 12-year contracts. The weekend offered everything sports watchers in Britain have come to expect from visiting American major‑league events – a large crowd with considerable enthusiasm for the sport, but understandably limited emotional investment in the result, an armageddon’s‑worth of cholesterol and a stadium announcer with the kind of deeply sonorous and unquenchably American voice that could imbue a village-fete cake competition with a sense of fundamental sporting gravity. London calling for devout MLB fans as historic rivalry goes international | Matthew Engel Read more From my admittedly unscientific research, sitting high in the stands over the left-field wall, the crowd seemed to consist of a good-natured cocktail of American tourists, baseball-curious sports fans and British baseball enthusiasts, many of them a legacy of the days when MLB action occupied the late-night hours of the Channel 5 schedule, hosted by Jonny Gould, a much‑loved production which achieved a rare televisual blend of insight, expertise, humour and enthusiasm. Quick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'. If you already have the Guardian app, make sure you’re on the most recent version. In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications. Turn on sport notifications. Was this helpful? Thank you for your feedback. They saw a dominant Chicago victory on Saturday, the Cubs establishing a seven-run lead by the end of the fourth of nine innings, driven by two soaring Ian Happ home runs (it is, admittedly, difficult for a home run to do anything other than soar), and a difficult outing for the veteran Cardinals pitcher Adam Wainwright. The flicker of a St Louis revival came to nothing. The game on Sunday began in a flurry of fielding errors (presumably because of the teams’ lack of red‑ball cricket in the buildup). The Cubs raced to a four-run first‑inning lead before the Cards, one of MLB’s worst-performing teams this season, finally roused from their slumbers to take a 7-5 victory in a game replete with hits but devoid of home runs, finished by the closing pitcher Jordan Hicks in a flurry of 103mph rockets. On both days, there seemed to be a healthy contingent of cricket fans in attendance. If you love one of these two historic sports you can, with the right induction, learn to love the other. (And if, as all correct-thinking humans do, you love cricket statistics, baseball offers more stats than the entire readership of the Guardian has had hot dinners.) Twenty20 cricket has been, often disparagingly, likened to baseball but the latter is – in tone, pacing and structure – much more akin to the rhythms and moods of Test cricket (assuming the current Bazballistic version of England are not batting). Its fundamental state of existence is inaction with the constant possibility of drama, rather than constant action with the occasional outbreak of actual tension. As in cricket, each delivery shifts the story of the game, sometimes imperceptibly, sometimes strikingly, and if the intricacies of the art and deception of pitching are hard to discern from 150 metres or so away, the eruption of timing and power in a home run, the smooth, high-speed precision choreography of a double play, and the sheer velocity of a well‑whanged ball are aesthetic treats for any sport lover. A Chicago Cubs fan with a beer bat before the second game in London. Photograph: Simon Marper/PA Beyond the novelty of seeing high‑level baseball in London, the spectator experience was, as spectator experiences tend to be at such events, largely indistinguishable from anything else. Any gaps in play were filled with something or other from the Anything to Avert The Remote Possibility of Crowd Spontaneity file. The unquestioned highlight was a half-lap mascot race in which a giant Winston Churchill and an even‑more‑than‑usually‑oversized Henry VIII showed the value of top-level leadership experience by streaking away from a showboating Freddie Mercury and a generic bearskin-hatted Grenadier Guard, who seemed overawed by the occasion as much as hindered by his impractical headgear, and failed to mount even a ghost of a challenge. The guardsman’s highly suspicious win in the Sunday race smacked of the kind of dubious fixing that has undermined mascot sporting contests for too long. The game itself was introduced by MLB this season, which have led to a significantly faster, more fluent spectacle. Cricket (not uniquely in sport) has yet to acknowledge that, whatever the quality of the action, dawdling never adds to it. With its slumping over rates in men’s and women’s games, endless interruptions, glacially moving umpires, and four-hour T20 games, if cricket is not feverishly studying this blueprint for product improvement it is even more of an administrative buffoon than its supporters had assumed. skip past newsletter promotion Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion In the event of the much prophesied DeathOfTestCricket™, if and when the five-day game finally succumbs to the ravening myopic maw of the so-called “free” markets, baseball will offer a refuge for those who seek a contest with a similar narrative nature. Chicago Cubs’ Nico Hoerner steals a base at the London Stadium. Photograph: Simon Marper/PA Post-season baseball in particular, in which teams compete over a series of matches with lasting resonance within the history of the sport, in which the impact of each significant play and tactical decision is magnified and scrutinised, which fluctuates and evolves over days and weeks, is the closest (and perhaps only) available alternative to Test matches. The links between the two sports have included a 1932 meeting between baseball’s defining player, Babe Ruth, and cricket’s statistical nonpareil Don Bradman, to which we can now add Anderson and Nathan Lyon, almost 1200 Test wickets between them, side‑by‑side in the impressively metamorphosed former Olympic Stadium, throwing the ceremonial first pitch on Saturday. The England maestro, who, after toiling on the Edgbaston stodgepot, was perhaps enjoying the idea of a sport in which you do not have to make the ball bounce, was in a Cubs shirt. Australia’s premium‑grade off-spinner represented the Cardinals. Regardless of St Louis’s revenge on Sunday, the Cubs’ 9-1 first-game win with Anderson in their corner has surely landed a series-swinging psychological hammer-blow for England before the Lord’s Test. Luis Arráez and the quest for baseball’s elusive .400 barrier Read more","pubDate":"2023-06-25 21:08:41","image_url":"https://i.guim.co.uk/img/media/2d61f05bfc46eeb3ac400fb1097391aa4660cc67/0_78_3500_2099/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=3542c6018e17f31911cd1aabdb280379","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"حسن علی نے ٹی ٹونٹی ورلڈ کپ میں آسٹریلیا کیخلاف کیچ ڈراپ کرنے پر افسوس کا اظہار کر دیا","link":"https://pni.net.pk/sports-news/cricket-news/467677/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"لاہور (پی این آئی ) پاکستانی کرکٹر حسن علی نے آئی سی سی T20I ورلڈ کپ 2021 میں آسٹریلیا کے خلاف سیمی فائنل میچ کے دوران ایک اہم ڈراپ کیچ پر افسوس کا اظہار کیا۔ حال ہی میں حسن علی نے ٹوئٹر پر اپنی ٹیم، [...] The post حسن علی نے ٹی ٹونٹی ورلڈ کپ میں آسٹریلیا کیخلاف کیچ ڈراپ کرنے پر افسوس کا اظہار کر دیا appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"لاہور (پی این آئی ) پاکستانی کرکٹر حسن علی نے آئی سی سی T20I ورلڈ کپ 2021 میں آسٹریلیا کے خلاف سیمی فائنل میچ کے دوران ایک اہم ڈراپ کیچ پر افسوس کا اظہار کیا۔ حال ہی میں حسن علی نے ٹوئٹر پر اپنی ٹیم، برمنگھم بیئرز کی شاندار کارکردگی پر تعریف کا اظہار کیا، کیونکہ انہوں نے جاری وائٹلٹی بلاسٹ ٹورنامنٹ میں لگاتار 5 میچ جیتنے کا شاندار کارنامہ انجام دیا۔ ان کے ٹویٹ کے جواب میں ایک مداح نے حسن کو مذکورہ آئی سی سی ٹورنامنٹ کے سیمی فائنل کے دوران چھوڑا گیا کیچ یاد دلاتے ہوئے کہا کہ “لیکن ہم آسٹریلیا کے خلاف اس کیچ کو پھر بھی نہیں بھولے۔” مداح کے ٹویٹ سے دل کی گہرائیوں سے متاثر ہوئے، 28 سالہ نوجوان پیسر نے اس لمحے کی کشش اور اس کے سیمی فائنل میں ٹیم کے امکانات پر پڑنے والے اثرات کو تسلیم کیا۔ فاسٹ بولر نے چھوٹنے والے کیچ پر دکھ کا اظہار کیا اور افسوس کا اظہار کرتے ہوئے کہا کہ گرائے گئے موقع کی یاد آخری سانس تک کبھی نہیں بھولیں گے۔ انہوں نے کہا کہ “یہاں تک کہ مجھے اب بھی یاد ہے اور آخری سانس تک یا اس کے بعد بھی کبھی نہیں بھولوں گا”۔ یاد رہے کہ پاکستان نے ٹورنامنٹ کے گروپ مرحلے میں ناقابل شکست ریکارڈ برقرار رکھتے ہوئے نہ صرف دوسری ٹیموں کے خلاف فتح حاصل کی بلکہ بھارت کے خلاف بھی شاندار کارکردگی کا مظاہرہ کرتے ہوئے آئی سی سی ایونٹ کی تاریخ میں پہلی بار دس وکٹوں سے شکست دی۔ تاہم، حسن علی نے 19ویں اوور میں میتھیو ویڈ کا کیچ ڈراپ کرنے کے بعد آسٹریلیا نے جیت حاصل کی۔ جب حسن نے کیچ چھوڑا تو آسٹریلیا کو دس گیندوں پر جیت کے لیے 20 رنز درکار تھے۔ اس کے بعد بائیں ہاتھ کے وکٹ کیپر بلے باز کی طرف سے شاندار بیٹنگ نے کینگروز کو کامیابی دلا دی ۔","pubDate":"2023-06-25 19:49:43","image_url":null,"source_id":"pninet","category":["sports"],"country":["pakistan"],"language":"Urdu"},{"title":"Cricket Updates: Australia win first Ashes Test, World Cup Qualifiers…","link":"https://www.samaaenglish.tv/news/40040346/sports-cricket-updates-australia-win-first-ashes-test-world-cup-qualifiers","keywords":["Sports"],"creator":null,"video_url":null,"description":"There were some interesting matches in different formats of Cricket this week, including the Ashes Test Series and ICC World Cup Qualifiers in Zimbabwe. Ashes England and Australia faced off in the first Ashes Test in Edgbaston, where England stunned their opponents by declaring after scoring just 393 runs on Day 1. Australia fought back and scored 386 runs but England gave them a target of 281 runs in the fourth innings. The Kangaroos were struggling at one stage as they lost eight wickets for 227 runs. They needed 54 runs but their skipper Pat Cummins did not give up. Cummins not out on 44 and helped Australia register the historic win in Birmingham. ICC World Cup Qualifiers Zimbabwe and Sri Lanka have become favourites to qualify for the ODI World Cup in India, as they have won three games each. Two-time world champions West Indies suffered an upset loss against Zimbabwe but they could still qualify, if they turn the things around in the super six round. On the other hand Ireland, UAE, Nepal and USA are already out of the race of qualification. Najam Sethi vs Zaka Ashraf Pakistan Cricket Board witnessed some big changes as Najam Sethi had to leave the office and Zaka Ashraf was added to the board of governors. Zaka Ashraf is already opposing some big decisions of Najam Sethi, as he said that the hybrid model is not a victory for Pakistan. It is also expected that he will change the coaching staff, which was appointed by Najam Sethi. But things surely could become more interesting in PCB next week.","content":"England and Australia faced off in the first Ashes Test in Edgbaston, where England stunned their opponents by declaring after scoring just 393 runs on Day 1. Australia fought back and scored 386 runs but England gave them a target of 281 runs in the fourth innings. The Kangaroos were struggling at one stage as they lost eight wickets for 227 runs. They needed 54 runs but their skipper Pat Cummins did not give up. Cummins not out on 44 and helped Australia register the historic win in Birmingham. Zimbabwe and Sri Lanka have become favourites to qualify for the ODI World Cup in India, as they have won three games each. Two-time world champions West Indies suffered an upset loss against Zimbabwe but they could still qualify, if they turn the things around in the super six round. On the other hand Ireland, UAE, Nepal and USA are already out of the race of qualification. Pakistan Cricket Board witnessed some big changes as Najam Sethi had to leave the office and Zaka Ashraf was added to the board of governors. Zaka Ashraf is already opposing some big decisions of Najam Sethi, as he said that the hybrid model is not a victory for Pakistan. It is also expected that he will change the coaching staff, which was appointed by Najam Sethi. But things surely could become more interesting in PCB next week.","pubDate":"2023-06-25 19:22:39","image_url":"https://i.samaaenglish.tv/large/2023/06/2600095475b069b.jpg?r=001038","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ash Gardner strikes to spark England collapse leaving Australia in charge","link":"https://www.theguardian.com/sport/2023/jun/25/the-ashes-england-australia-cricket-ash-gardner","keywords":["Women's Ashes","England women's cricket team","Australia women's cricket team","Women's cricket","Cricket","Australia sport","Sport"],"creator":["Raf Nicholson at Trent Bridge"],"video_url":null,"description":"Only Test, day four: Australia 473 & 257; England 463 & 116-5England lose four wickets for 18 runs to squander initiativeEngland’s chances of a first Test win since January 2014 and a first win against Australia in any format since July 2019 hung in the balance at stumps on the fourth day at Trent Bridge, as they sunk to 116 for five in pursuit of a fourth-innings target of 268.Though Sophie Ecclestone claimed her side would “go away tonight and figure out how we’re going to win this Test match”, Australia are confident that victory is within easy reach. “It is teetering a little bit,” Beth Mooney said. “I back our bowlers to take the five wickets. We feel like we’re the happier team walking off this afternoon, for sure.” Continue reading...","content":"England’s chances of a first Test victory since January 2014 and a first win against Australia in any format since July 2019 hung in the balance at stumps on the fourth day at Trent Bridge, as they sunk to 116 for five in pursuit of a fourth-innings target of 268. Though Sophie Ecclestone claimed her side would “go away tonight and figure out how we’re going to win this Test match”, Australia are confident that victory is within easy reach. “It is teetering a little bit,” Australia’s Beth Mooney said. “I back our bowlers to take the five wickets. We feel like we’re the happier team walking off this afternoon, for sure.” Women’s Ashes Test: Australia set England target of 268 to win on day four – as it happened Read more England had strolled to 55 without loss after 10 overs, but a collapse of four wickets for 18 runs in five overs midway through the evening session tipped momentum in favour of Australia. In desperation, both Emma Lamb and Heather Knight – trapped lbw by Tahlia McGrath and Ash Gardner respectively – sent their decisions upstairs, but DRS showed both as being umpire’s call on impact. Knight became Gardner’s third victim, after the off-spinner had earlier tempted the first-innings double-centurion Tammy Beaumont into slicing a half-volley to slip. In between times, Nat Sciver-Brunt was the agent of her own demise, miscuing a pull to be caught by Kim Garth running round from short leg. Minutes before the close, Garth chipped in with a wicket of her own, her outswinger taking the edge of Sophia Dunkley and landing in the gloves of Alyssa Healy behind the stumps. Though the nightwatcher Kate Cross sent the penultimate ball of the day crashing through mid‑off for four, there are still 152 runs needed to secure victory. With Australia’s spinners licking their lips at the prospect of a fifth day on this pitch, England have a mountain to climb. It was meant to be Ecclestone’s day, after her cumulative match‑haul of 10 for 192 across 77.1 overs (the most bowled by any Englishwoman in a Test since 1987) led what seemed like a routing of Australia for 257. Wickets fell in clusters, including four for 20 in 34 balls immediately after lunch, and – after a 59-run partnership between Healy and Alana King for the eighth wicket – the loss of Australia’s final three batters in the space of seven balls for no runs after tea. Beth Mooney is bowled by Sophie Ecclestone, who took five wickets in each innings. Photograph: James Gill/Danehouse/Getty Images “I knew I was going to bowl a lot of overs, but I didn’t think it would be this many,” Ecclestone said. “You can’t really prepare for that, you’ve just got to go with it and be tough in the mind.” Ecclestone had switched to the Radcliffe Road End at the start of the day, in what seemed to be an attempt to make the most of some scuffed-up footholes at the Pavilion End (from which her previous 50 overs had been delivered). That did the job to see off Mooney, who was finally dismissed halfway through the afternoon session 15 runs short of a maiden Test century, by a ball which spun out of the footmarks on to her stumps. Around her, there were some uncharacteristically tentative shots from the Australians: first-innings centurion Annabel Sutherland pulled Ecclestone straight to square-leg, while Gardner edged Cross to slip. Most strangely of all, the Australia captain Healy, carded at No 6, did not emerge from the dressing room until six wickets had already gone down. That meant a longer wait nursing three quarters of a double‑pair (after three successive ducks in Test cricket). She almost achieved that dubious honour when she was put down by Amy Jones behind the stumps first ball – one of a series of spilled chances across the day, including five by the wicketkeeper-first slip pairing of Jones and Knight. Had they taken those chances, they might yet be celebrating a win. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Quick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'. If you already have the Guardian app, make sure you’re on the most recent version. In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications. Turn on sport notifications. Was this helpful? Thank you for your feedback. Instead, Healy clung on to bring up a 61-ball half-century in the second over after tea – but fell three balls later, limply holing out off a full toss to Lamb at midwicket, to hand Ecclestone her fourth wicket of the day. Darcie Brown, trapped lbw, completed the set; Ecclestone led her team from the pitch holding the ball aloft for the second time in four days. At the close of play Ecclestone said the England head coach, Jon Lewis, had given the team “a bit of a rocket” after a difficult last hour on Saturday evening. Whatever he said, it seemed initially to have worked: they resumed day four with much more of a spring in their steps, especially when Cross – in her third over of the morning – bowled a jaffa which pitched a mile outside off and jagged back in to hit Phoebe Litchfield’s middle stump. England were also buoyed by the return of Sciver-Brunt to the attack, after she was unable to bowl on Saturday due to a knee injury. But it was Lauren Filer who made the morning session fizz, finally living up to her pre-match billing by Lewis as “a key wicket-taking threat”. In back-to-back wicket maidens just before lunch, in which she clocked speeds of 76mph, she removed two of the world’s best batters in quick succession – Ellyse Perry bowled trying to fend off a bouncer, before McGrath was beaten for pace and the ball ricocheted off her pads into the stumps. Perry, dismissed for the second time in the match by England’s debutante pacer, looked rather sheepish. As it turned out, Australia had the last laugh.","pubDate":"2023-06-25 18:59:15","image_url":"https://i.guim.co.uk/img/media/7dd5683fe5c77d821656f966cd8da219a05bd186/0_49_4699_2820/master/4699.jpg?width=460&quality=85&auto=format&fit=max&s=bcf7bd5b775bb8b97dbb5ec5f0573b5f","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"County cricket: Hill and Bean hit centuries for Yorkshire v Gloucestershire","link":"https://www.theguardian.com/sport/live/2023/jun/25/county-cricket-yorkshire-v-gloucestershire-surrey-v-lancashire-and-more-live","keywords":["County Championship","Sport","Cricket"],"creator":["Tanya Aldred"],"video_url":null,"description":"Finlay Bean and George Hill for Yorkshire on the opening day of the match against GloucestershireA wicket at The Oval – Bohannon lbw to Sean Abbot for 10. Lancs 35-2. And Hutton has ticked off another of Somerset’s batters George Bartlett for 13. Somerset 56-3.“Just trying to get my head around how the Kookaburra can be ‘more helpful to the bowlers’ despite apparently offering less seam and swing?! taps Brian Withington. “Certainly seems to be capturing some early wickets today though. Apologies if this has already been dissected BTL but haven’t got there yet.” Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 2h ago Opening day roundup 4h ago Closer of play scores 6h ago A hundred for George Hill! 7h ago Tea-time scores 7h ago Hundreds for Dan Lawrence and Tom Westley! 8h ago A hundred for Alex Lees! 8h ago A hundred for Finlay Bean! 8h ago Somerset 163 all out 12h ago Kookaburra ball 13h ago Preamble 13h ago Fixtures Show key events only Please turn on JavaScript to use this feature 2h ago 20.55 BST Opening day roundup Tanya Aldred This round of Championship cricket, squeezed between the T20 Blast, has the novelty of being the first of two this summer which will use the Kookaburra ball. They were prescribed by the Strauss report, in an attempt to reduce reliance on the swing and seam of the Dukes and encourage fast and spin bowling. One day in, with seven centuries on the board but five teams bowled out in less than a day, it seems too early to make a call. Finlay Bean and George Hill made the most of a good Headingley pitch, a swift outfield, and some wayward Gloucestershire bowling, to rock to sparkling centuries and put Yorkshire in a dominant position. At Chelmsford, Dan Lawrence made his second hundred of the season for Essex , in a partnership of 227 with Tom Westley, who was finally out for a sparkling 114. Dom Bess grabbed two consolation wickets for Warwickshire . A humdinger of a game is developing at The Oval, where Lancashire were dismissed for 274 only to have Surrey 70 for four at stumps. A Brett Hutton five‑fer took the shine off Somerset’s day against Nottinghamshire , dismissed for 163. Hampshire finished the day on 284 for four against Middlesex . Spinner Liam Dawson, overlooked by England, was 111 not out overnight and, along with Nick Gubbins, shimmied Hampshire into a dominant position. At the County Ground, Rob Keogh’s 97 propped up Northamptonshire in the Division One basement battle against Kent . Durham raced along at now familiar lick, with centuries from Alex Lees and Ollie Robinson putting pressure on a Leicestershire side already reeling from the news that Paul Nixon had been put on gardening leave. Nathan McAndrew and Jack Carson kept Glamorgan firmly tethered at Sophia Gardens against Sussex , while Anuj Dal’s five wickets ensured the bottom club Derbyshire had some skin in the game at New Road, Worcestershire all out for 237 after a stonking opening stand. 4h ago 19.37 BST That’s all from us. Thanks for hanging around on a roasting Sunday, congratulations to centurions all: Lawrence, Westley, Dawson, Bean, Hill, Lees and Robinson and five-wicketers Anuj Dal and Brett Hutton. We’ll be back tomorrow – good night! Bean-machine: a second century of the season for Yorkshires's Finlay Bean Photograph: Allan McKenzie/SWpix.com/Shutterstock 4h ago 19.33 BST Closer of play scores DIVISION ONE Chelmsford : Essex 391-7 v Warwickshire Rose Bowl : Hampshire 284-4 v Middlesex County Ground : Northants 237 v Kent 110-1 Taunton : Somerset 163 v Nottinghamshire 145-4 The Oval : Surrey 70-4 v Lancashire 274 DIVISION TWO Sophia Gardens : Glamorgan 242 v Sussex 65-1 Grace Road : Leicestershire v Durham 422-4 New Road : Worcestershire 237 v Derbyshire 32-2 Headingley : Yorkshire 393-6 v Gloucestershire 5h ago 17.52 BST And here comes the promised rain…. with Yorkshire 388-6. 5h ago 17.39 BST Right, time for me to write up. A final polka round the grounds: Dan Lawrence, 147 not out, has guided Essex to 337-5; Dawson and Gubbins are racing each other to a hundred, Hants 256-4; Compton out cheaply, but Kent 49-1; Somerset fighting back against Notts, but Slater (44 not out) is standing in their way 99-3, 63 behind. And Lancashire are all out for 274. In Division Two: Yorks 361-5 Tattersall picking up where Hill and Bean left off, but the clouds are fast approaching. Worcesterstershire have made a horlicks of their innings, from 105-1 to 237-9. Dal 4-45. Four wickets for McAndrew in Glamorgan’s 242 all out. Billy Root the top-scorer with 66. Jack Carson, on people’s lips as an up and coming spinner, 3-45; McAndrew 4-58. Sussex have already lost Haines for six. And Durham are in usual-bish-bang-baz-ball mode: 346-4. I must go off and write my roundup, but do keep chatting BTL. 6h ago 17.21 BST The new ball has been taken at Headingley. The clouds are coming over. Gloucestershire’s best chance. 6h ago 17.19 BST A third wicket for Jordan Clark has reduced Lancs to 274-9, it is left to Williams and Morley to try and scrape towards 300. 6h ago 17.03 BST A hundred for George Hill! A second century of the day for Yorkshire –maybe the prospect of a final resolution on Tuesday is instinctively inspiring some freedom of shot. Or maybe it is the excellent pitch. Or the average bowling. Or the rapid outfield. Helmet off, he shyly raises his the bat. 177 balls, 13 fours. Yorkshire making hay, 343-4. 6h ago 16.57 BST Gubbins and Dawson are pulling Hampshire away from the danger zone with a partnership of 121 – Hants 215-4 at The Rose Bowl As Jonny Tattersall sends the ball shooting through midwicket, beating George Hill in the milestone race, to reach fifty.Very nicely done. 6h ago 16.45 BST While I was looking the other way, Wes Agar (5-63) and Hamidullah Qadri (3-69) rattle through Northants. The immovable object Rob Keogh, was seventh man out for 97. Kent 16-0 in reply already. Runs, runs, more runs at Headingley. Gohar’s over is plonked: four, four, three, six, two. Hill 93, Tattersall 43. 7h ago 16.34 BST Good to see Phil Salt continuing his snappy form from Southport, 56 not out in Lancashire’s 236-7 – which definitely feels not enough against the Ovalnaughts. 7h ago 16.31 BST If you’d asked me in April to guess the Championship’s leading run-scorer at midsummer, I wouldn’t have plumped for Tom Westley. Out for 114, Essex 260-3. Updated at 16.37 BST 7h ago 16.28 BST Sophie Ecclestone’s 5-63 means England need 268 to beat Australia. Follow it all here with the master himself R Smyth (and worry about whether Ecclestone’s arm will fall off later) Women’s Ashes Test: England v Australia, day four – live Read more 7h ago 16.00 BST Tea-time scores DIVISION ONE Chelmsford : Essex 247-2 v Warwickshire Rose Bowl : Hampshire 183-4 v Middlesex County Ground : Northants 218-9 v Kent Taunton : Somerset 163 v Nottinghamshire 23-1 The Oval : Surrey v Lancashire 214-7 DIVISION TWO Sophia Gardens : Glamorgan 212-7 v Sussex Grace Road : Leicestershire v Durham 246-4 New Road : Worcestershire 189-6 v Derbyshire Headingley : Yorkshire 273-4 v Gloucestershire 7h ago 15.40 BST Hundreds for Dan Lawrence and Tom Westley! Put your feet up boys, and enjoy the show. Essex 230-2. Khushi and Cook must be kicking themselves. The century boys: Lawrence and Westley Photograph: Gavin Ellis/TGS Photo/Shutterstock 8h ago 15.36 BST A tale of two England once-weres: At Trent Bridge, Haseeb Hameed has been out for an 18-ball duck. At Chelmsford, Dom Bess has been bowling. 19 overs, 0-77. 8h ago 15.18 BST A hundred for Alex Lees! His first first-class century for 14 months. And out! A second catch for soon-to-be-Riverside bound Ackermann, a first-wicket for soon-to-be-Riverside-bound Parkinson C. Durham 223-4. 8h ago 15.13 BST And there goes Bean, pulling again, but this time straight into the hands of Charlesworth at backward square leg. off Akther, for 114. He slopes off in obvious disappointment, gloves off, helmet half cock. Smashing innings, Yorks 243-4. 8h ago 15.06 BST A hundred for Finlay Bean! Nicely does it! A snappy pull to the rope brings Bean a second hundred in his nascent first-class career. Happy applause waves around Headingley, Yorkshire on top, Gloucestershire lost for ideas. And a single brings the fourth-wicket partnership up to 150 from 211 balls. 8h ago 14.59 BST Somerset 163 all out Is this going to be one of those years when Somerset flirt with relegation? Of course it is! Five for Brett Hutton. Top scorer TKC. Not the best half a day’s batting. 9h ago 14.37 BST Getting spicy in the Test – where England have managed to drop five catches but still have Australia six down – the lead 206. 9h ago 14.35 BST Essex are still strolling through the foothills, the third wicket partnership 145 and counting. Essex 165-2. Is Dan Lawrence (68 not out) now going to have the summer of his life as he says farewell to Chelmsford? 9h ago 14.27 BST George Hill , generally considered one of the best players of spin on the team, has Yorks racing along, an easy afternoon six off Zahar Gohar into the plastic seats. The partnership between him and Finlay Bean now 98. Yorks 188-3 as a fierce win stamps round the ground. 9h ago 14.21 BST In 31 degree heat, Lancashire are starting to melt. Sean Abbott’s Kookaburra skills(3-42) have been complemented by a wicket each for Sam Curran and Tom Lawes. Lancs 123-5. Salt and Balderson don the hard hats and wearily bend to pick up the rubble. Updated at 14.21 BST 9h ago 14.16 BST Apologies for the lack of updates, a work phone call. Updates to follow. Updated at 14.17 BST 9h ago 13.51 BST A onion bhaji wrap in my brown Headingley sandwich bag, makes for a tasty lunch. Just spoke to Tanni Grey Thompson, Yorkshire’s interim chair, who has been out and about meeting and greeting round the ground. I know she would, wouldn’t she, but she was very positive about the expertise on the Yorkshire committee, and the pathway programme in particular. 10h ago 13.25 BST DIVISION ONE Chelmsford : Essex 119-2 v Warwickshire Rose Bowl : Hampshire 92-3 v Middlesex County Ground : Northants 104-4 v Kent Taunton : Somerset 106-4 v Nottinghamshire The Oval : Surrey v Lancashire 98-3 DIVISION TWO Sophia Gardens : Glamorgan 85-4 v Sussex Grace Road : Leicestershire v Durham 150-1 New Road : Worcestershire 105-2 v Derbyshire Headingley : Yorkshire 139-3 v Gloucestershire 10h ago 13.02 BST A frisky morning at Headingley, Yorks 133-3, Finlay Bean leading the way 65 not out. Lunchtime scores round the grounds to follow. 10h ago 12.53 BST Some succour for Somerset fans: SHOT!! Lovely, lovely stroke from James Rew! LIVE STREAM ➡️ https://t.co/aRtGCP7E47 #SOMvNOTTS #WeAreSomerset pic.twitter.com/5Qepo5pEEN — Somerset Cricket 🏏 (@SomersetCCC) June 25, 2023 10h ago 12.52 BST Hampshire lose a third, and its a big one, their maypole, James Vince. Josh de Caires, Atherton’s boy, the wicket-taker. Hants 81-3. Essex are making hay after being 20-2; now 112-2, a half century to Tom Westley. A fourth for Brett Hutton, who is having a very fruitful morning at Taunton, Somerset 103-4. Four before lunch: Brett Hutton. Photograph: Harry Trump/Getty Images 11h ago 12.37 BST TdL with some Ashes thoughts: Ashes to Ashes, rust to bust: England must find groove to remedy sloppy start | Tim de Lisle Read more And Barney off his long run: Bazball: a cult of bruised masculinity where you win even if you lose | Barney Ronay Read more 11h ago 12.31 BST The Trent Bridge pitch’s friendly nature continues to make wicket-taking a trial in the women’s Test. The fabulous Megan Maurice will keep you updated: Women’s Ashes Test: England v Australia, day four – live Read more 11h ago 12.16 BST In Division Two, Yorkshire are racing along – ah but perhaps not so much now – as Ben Charleswoth sends down a complete pie which Dawid Malan pulls round into Bracey’s gloes. Gone for a boundary-laden 28. Bean at the non-striker’s end tips his head back in exasperation/despair. Yorks 90-3. Roderick and Libby continue to enjoy Derbyshire’s profligacy, Worcs 65-0. Durham too racing along, as is their want, 100-0 o ff 17 overs. Parkinson C, getting to know his soon-to-be-teammates, from the bowling crease. Parkinson M, back with Durham on loan, sits in the opposition dressing room. Alone in Division Two, Glamorgan’s batters are struggling, 49-3 against Sussex.Shipley 2-21. 11h ago 12.05 BST A wicket at The Oval – Bohannon lbw to Sean Abbot for 10. Lancs 35-2. And Hutton has ticked off another of Somerset’s batters George Bartlett for 13. Somerset 56-3. 11h ago 12.01 BST “Just trying to get my head around how the Kookaburra can be ‘more helpful to the bowlers’ despite apparently offering less seam and swing?! taps Brian Withington. “Certainly seems to be capturing some early wickets today though. Apologies if this has already been dissected BTL but haven’t got there yet.” Er, yes you’re quite right. I’m writing drivel and have corrected said entry. Ball is LESS helpful to the bowlers as it doesn’t move as much. That said, no real sign of batting dominance yet except for Bazballing Durham and Worcestershire. Updated at 12.02 BST 11h ago 11.47 BST Dancing round the Division One grounds: Warwickshire’s bowlers enjoying the Kookaburra ball – Alastair Cook and Feroze Khushi both out cheaply, Essex 24-2. Dan Lawrence, moving to Surrey at the end of the summer, nine not out. At The Rose Bowl, TRJ has whittled out Fletcha Middleton for four, Hampshire 30-1. Early wickets for Kent too – Wes Agar and Arshdeep Singh taking one each, Northants 32-2. Two wickets for Brett Hutton at Taunton, where Notts have Somerset 39-2; and Lancs, inserted by Surrey, have lost Wells for three. Keaton Jennings, back from his hamstring injury, has hit three fours in his 16 not out. This too, at Taunton. I hope it brings comfort to Barnaby Webber’s family. Signed shirts from both clubs were presented to Barnaby Webber's family prior to play at Taunton today as an expression of condolence and unity. Our thoughts remain with the victims and all those affected by last week's tragic events in Nottingham. #SOMNOT pic.twitter.com/uJObocGgZF — Nottinghamshire CCC (@TrentBridge) June 25, 2023 12h ago 11.24 BST Hang about Yorkshire, the storm clouds aren’t supposed to be coming till after lunch. Shan Masood lbw Taylor for a three ball duck. 33-2. 12h ago 11.22 BST A wicket at Headingley – Lyth tries to leave alone and is snaffled up at second slip for 14. A short and sweet cameo. 12h ago 11.15 BST An early email, hello Will Unwin! “In a week where it was confirmed Matt Parkinson and Danny Lamb will leave Lancs in the summer, I’m intrigued why the club has become pretty poor at A) helping academy graduates reach their potential And B) retaining them. In recent seasons we’ve seen Hameed and Davies go, and now the latest two. We were pretty close to losing Mahmood this winter, too, so seems a big problem. We do have another hotel on the ground though… Why do you think this is the situation at Lancs? We only ever get very vague reasoning from the club.” I can’t pretend to have any special behind the scenes knowledge. In the case of Danny Lamb I think he wanted first-team cricket. With Parky, like Hameed, there seems to have been something of a breakdown in communication between both parties. Best, in such cases, for a clean break and a fresh start – but it doesn’t reflect too well on the club. 12h ago 10.57 BST Kookaburra ball Yes, this is one of the two rounds this summer which will features the Kookaburra ball – as recommended in the Strauss report. They are said to seam and swing less and generally be less helpful to the bowlers. I’m sure they’re very grateful. Bright new thing: the Kookaburra ball Photograph: Michael Dodge/AAP Updated at 11.58 BST 12h ago 10.52 BST So much to keep an eye on this round. Runaway favourites Surrey take on Lancashire – who announced the departure of Matt Parkinson to Kent at the end of the season. Meanwhile brother Callum is moving to Durham, as part of the bin-fire at Grace Road which also involved Paul Nixon being put on gardening leave and the departures of Colin Ackermann and Chris Wright. Leicestershire chief exec Sean Jarvis, quoted on cricinfo said, that there had been “ a mess behind… every door I opened” since he joined in 2020. “A lot of information has come to my attention over the past two months and as chief executive of this club, I’ll be investigating comments, allegations, all those sorts of things that have gone on. “That’s what we’re trying to sort out. All these different fires that seem to be burning, we’re now starting to eradicate and we’re starting to put the proper infrastructure in place within this club. I know members were very upset and very unhappy with what’s gone on. I get that that is sport, but we are striving to develop this club.” 13h ago 10.35 BST Fixtures DIVISION ONE Chelmsford : Essex v Warwickshire Rose Bowl : Hampshire v Middlesex County Ground : Northants v Kent Taunton : Somerset v Nottinghamshire The Oval : Surrey v Lancashire DIVISION TWO Sophia Gardens : Glamorgan v Sussex Grace Road : Leicestershire v Durham New Road : Worcestersire v Derbyshire Headingley : Yorkshire v Gloucestershire 13h ago 10.35 BST Preamble Good Sunday morning! Midsummer cricket is back – for a week. The clouds have arranged themselves prettily above Headingley this morning in preparation for this afternoon’s predicted cloudburst. And there are storm clouds ahead for English cricket generally with the publication on Tuesday of the long awaited ICEC’s Report examining the state of equity in cricket. Yorkshire have won the toss and will bat. Their team includes Dan Moriarty, signed on a loan deal from Surrey, while Dom Bess plays for Warwickshire on a one-game loan. Round and round and round we go. Updated at 10.43 BST Topics County Championship County cricket live blog Cricket Reuse this content","pubDate":"2023-06-25 18:33:19","image_url":"https://i.guim.co.uk/img/media/76e01f467531a2562d7ce589fac5016eebec11e5/0_200_6000_3600/master/6000.jpg?width=460&quality=85&auto=format&fit=max&s=bdd6cbb036c4abef0a936ec58af96de8","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Indian Team: આવનારા સમયમાં આ 3 ફાસ્ટ બોલર બનશે ભારતના સુપરસ્ટાર, ઈશાંત શર્માએ કરી ભવિષ્યવાણી","link":"https://gujarati.abplive.com/sports/cricket/ishant-sharma-named-umran-malik-arshdeep-singh-and-mukesh-kumar-3-fast-bowlers-that-can-be-indians-future-845555","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"Ishant Sharma On Indian Future Bowlers: ભારતીય ટીમનો સ્ટાર ફાસ્ટ બોલર ઈશાંત શર્મા છેલ્લા લગભગ 2 વર્ષથી ટીમની બહાર ચાલી રહ્યો છે. ઇશાંત આ વર્ષે રમાયેલી IPL 16માં રમતા જોવા મળ્યો હતો, જેમાં તેણે શાનદાર પ્રદર્શન કર્યું હતું. બીજી તરફ ટીમ ઈન્ડિયામાં ફાસ્ટ બોલરોની વાત કરીએ તો જુલાઈમાં વેસ્ટ ઈન્ડિઝ પ્રવાસ માટે ઘણા યુવા બોલરોને તક આપવામાં આવી છે. આ દરમિયાન ઈશાંત શર્માએ તે 3 ભારતીય ઝડપી બોલરો વિશે જણાવ્યું, જેમને યોગ્ય માર્ગદર્શન આપવામાં આવે તો ભવિષ્યના સુપરસ્ટાર બની શકે છે. ઇશાંત શર્માએ આ વિશે યુટ્યુબ ચેનલ 'બીયરબાઈસેપ્સ' પર વાત કરી હતી. ભારતીય ફાસ્ટ બોલરે કહ્યું,જો તમે તેની સાથે યોગ્ય રીતે કામ કરો છો તો ઉમરાન મલિકમાં દેશ માટે લાંબા સમય સુધી સારું પ્રદર્શન કરવાની ક્ષમતા છે. આમાં બીજો ફાસ્ટ બોલર અર્શદીપ સિંહ  છે. તે જ સમયે, ઇશાંત શર્માએ ત્રીજા બોલર તરીકે દિલ્હી કેપિટલ્સના મુકેશ કુમારની પસંદગી કરી છે. ઈશાંત શર્મા પણ આઈપીએલ 2023માં દિલ્હી તરફથી રમ્યો હતો. યોગ્ય માર્ગદર્શનની જરૂર છેઃ ઈશાંત શર્મા મુકેશ વિશે વાત કરતા ઈશાંત શર્માએ કહ્યું, ઘણા લોકો તેની કહાની નથી જાણતા, પરંતુ મેં તેના જેવો સરળ વ્યક્તિ ક્યારેય જોયો નથી. જો તમે તેને કોઈ ખાસ બોલ નાખવા માટે કહો છો, તો તે માત્ર તે જ બોલ ફેંકે છે. તેને મેદાન પર યોગ્ય માર્ગદર્શનની જરૂર છે, જેથી તે જાણી શકે કે દબાણની સ્થિતિમાં કયો બોલ ફેંકવો. ઇશાંત શર્માએ જણાવ્યું કે ગત IPLમાં તે કેમ મોંઘો સાબિત થયો હતો. મુકેશ કુમારે IPL 2023ની 10 મેચોમાં માત્ર 7 વિકેટ લીધી, 10થી વધુની ઈકોનોમી સાથે રન આપ્યા હતા. આ અંગે ઈશાંતે કહ્યું, આઈપીએલમાં તેની સામે રન એટલા માટે બનાવ્યા કારણ કે તેણે મુશ્કેલ ઓવરો ફેંકી હતી. તેણે કઈ પરિસ્થિતિમાં બોલિંગ કરી અથવા કયા બેટ્સમેનની સામે બોલિંગ કરી તે કોઈ જોતું નથી. બધાએ જોયું કે તેણે 4 ઓવરમાં 50 રન આપ્યા. રોહિત શર્મા હટાવાશે ને આ અનુભવીને સોંપાશે ટીમની કમાન ? BCCIએ આપ્યા સંકેત  ભારતીય ટીમની રમત અને કેપ્ટનશીપની અત્યારે તમામ ફેન્સ ટીકા કરી રહ્યું છે. સતત બીજીવાર ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપની ફાઇનલમાં હાર મળ્યા બાદ ખરાબ રણનીતિ અને કેપ્ટનને હટાવવાની ચર્ચાએ જોર પકડ્યુ છે. ગયા વર્ષે વિરાટ કોહલી અને આ વખતે રોહિત શર્માની કેપ્ટન્સીમાં ટીમ ઇન્ડિયા ટેસ્ટમાં ચેમ્પીયન બનતા રહી ગઇ છે.હાર બાદથી જ ટેસ્ટ કેપ્ટનને લઈને ચર્ચા ચાલી રહી છે. હવે આ બધાની વચ્ચે સમાચાર સામે આવ્યા છે કે રોહિત શર્મા માટે વેસ્ટ ઈન્ડિઝનો પ્રવાસ મહત્વપૂર્ણ સાબિત થઈ શકે છે. પ્રવાસ માટે ટીમની પસંદગી થઈ ગઈ છે અને તેમાં આગામી કેપ્ટનના સંકેતો છુપાયેલા છે.  બીસીસીઆઈએ શુક્રવારે વેસ્ટ ઈન્ડિઝ સામેની સીરીઝ માટે ટીમની જાહેરાત કરી હતી. 2 મેચોની ટેસ્ટ સીરીઝ માટે પસંદ કરાયેલી ટીમને લઈને કેટલાક કડક નિર્ણયો લેવામાં આવ્યા છે. આમાં એવો નિર્ણય પણ આવ્યો કે જેના વિશે કોઈએ વિચાર્યું પણ ન હતું. ચેતેશ્વર પુજારાને ટીમની બહાર રાખવામાં આવ્યો હતો અને આનીથી એવો સંકેત પણ મળ્યો છે કે, રોહિત શર્મા હવે આગામી કેપ્ટન તરીકે નહીં રહે.   સિલેક્ટરોએ ઇન્ડિયન પ્રીમિયર લીગ પછી ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપ ફાઇનલ માટે ટીમમાં પાછા ફરવા માટે આઉટ ઓફ ફેવર અજિંક્ય રહાણેને તક આપી હતી. માત્ર 1 મેચ બાદ તેને ફરીથી વાઇસ કેપ્ટન બનાવવામાં આવ્યો છે.. બીસીસીઆઈ આ ખેલાડી પર આટલો ભરોસો દર્શાવે છે તે માત્ર એક જ દિશામાં ઈશારો કરી રહ્યું છે કે, આગામી સમયમાં રોહિત શર્માને ટેસ્ટ કેપ્ટન પદેથી હટાવીને અનુભવી સ્ટાર બેટ્સમેન અજિંક્યે રહાણેને કેપ્ટન બનાવવામાં આવી શકે છે. BCCI હવે રોહિત શર્માને ત્રણેય ફોર્મેટમાં કેપ્ટનશિપના બોજમાંથી મુક્ત કરવા માંગે છે. હાર્દિક પંડ્યા પહેલાથી જ ટી-20માં મોટાભાગની મેચોની કેપ્ટનશીપ કરી રહ્યો છે. હવે તેને ટેસ્ટ મેચોમાં પણ સુકાનીપદથી રાહત મળી શકે છે. વેસ્ટ ઈન્ડિઝ પ્રવાસ બાદ અજિંક્ય રહાણેને આ જવાબદારી આપવામાં આવી શકે છે.  ICC ODI વર્લ્ડકપ પર વધુ ધ્યાન આપવા માટે, BCCI નક્કી કરી શકે છે કે રોહિત શર્મા બંને ફોર્મેટની કેપ્ટનશિપમાંથી મુક્ત રહેશે. હાર્દિક પંડ્યા T20ની કેપ્ટનશીપ સંભાળી રહ્યો છે, અજિંક્ય રહાણેને ટેસ્ટ કેપ્ટન બનાવવો જોઈએ. અચાનક ટીમમાં વાપસીની તક આપવી અને પછી તેને ઉપ-કેપ્ટન બનાવવો એ કોઈ સંયોગ નથી. Join Our Official Telegram Channel: https://t.me/abpasmitaofficial  ","content":"Ishant Sharma On Indian Future Bowlers: ભારતીય ટીમનો સ્ટાર ફાસ્ટ બોલર ઈશાંત શર્મા છેલ્લા લગભગ 2 વર્ષથી ટીમની બહાર ચાલી રહ્યો છે. ઇશાંત આ વર્ષે રમાયેલી IPL 16માં રમતા જોવા મળ્યો હતો, જેમાં તેણે શાનદાર પ્રદર્શન કર્યું હતું. બીજી તરફ ટીમ ઈન્ડિયામાં ફાસ્ટ બોલરોની વાત કરીએ તો જુલાઈમાં વેસ્ટ ઈન્ડિઝ પ્રવાસ માટે ઘણા યુવા બોલરોને તક આપવામાં આવી છે. આ દરમિયાન ઈશાંત શર્માએ તે 3 ભારતીય ઝડપી બોલરો વિશે જણાવ્યું, જેમને યોગ્ય માર્ગદર્શન આપવામાં આવે તો ભવિષ્યના સુપરસ્ટાર બની શકે છે. ઇશાંત શર્માએ આ વિશે યુટ્યુબ ચેનલ 'બીયરબાઈસેપ્સ' પર વાત કરી હતી. ભારતીય ફાસ્ટ બોલરે કહ્યું,જો તમે તેની સાથે યોગ્ય રીતે કામ કરો છો તો ઉમરાન મલિકમાં દેશ માટે લાંબા સમય સુધી સારું પ્રદર્શન કરવાની ક્ષમતા છે. આમાં બીજો ફાસ્ટ બોલર અર્શદીપ સિંહ છે. તે જ સમયે, ઇશાંત શર્માએ ત્રીજા બોલર તરીકે દિલ્હી કેપિટલ્સના મુકેશ કુમારની પસંદગી કરી છે. ઈશાંત શર્મા પણ આઈપીએલ 2023માં દિલ્હી તરફથી રમ્યો હતો. યોગ્ય માર્ગદર્શનની જરૂર છેઃ ઈશાંત શર્મા મુકેશ વિશે વાત કરતા ઈશાંત શર્માએ કહ્યું, ઘણા લોકો તેની કહાની નથી જાણતા, પરંતુ મેં તેના જેવો સરળ વ્યક્તિ ક્યારેય જોયો નથી. જો તમે તેને કોઈ ખાસ બોલ નાખવા માટે કહો છો, તો તે માત્ર તે જ બોલ ફેંકે છે. તેને મેદાન પર યોગ્ય માર્ગદર્શનની જરૂર છે, જેથી તે જાણી શકે કે દબાણની સ્થિતિમાં કયો બોલ ફેંકવો. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ઇશાંત શર્માએ જણાવ્યું કે ગત IPLમાં તે કેમ મોંઘો સાબિત થયો હતો. મુકેશ કુમારે IPL 2023ની 10 મેચોમાં માત્ર 7 વિકેટ લીધી, 10થી વધુની ઈકોનોમી સાથે રન આપ્યા હતા. આ અંગે ઈશાંતે કહ્યું, આઈપીએલ માં તેની સામે રન એટલા માટે બનાવ્યા કારણ કે તેણે મુશ્કેલ ઓવરો ફેંકી હતી. તેણે કઈ પરિસ્થિતિમાં બોલિંગ કરી અથવા કયા બેટ્સમેનની સામે બોલિંગ કરી તે કોઈ જોતું નથી. બધાએ જોયું કે તેણે 4 ઓવરમાં 50 રન આપ્યા. રોહિત શર્મા હટાવાશે ને આ અનુભવીને સોંપાશે ટીમની કમાન ? BCCIએ આપ્યા સંકેત ભારતીય ટીમની રમત અને કેપ્ટનશીપની અત્યારે તમામ ફેન્સ ટીકા કરી રહ્યું છે. સતત બીજીવાર ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપની ફાઇનલમાં હાર મળ્યા બાદ ખરાબ રણનીતિ અને કેપ્ટનને હટાવવાની ચર્ચાએ જોર પકડ્યુ છે. ગયા વર્ષે વિરાટ કોહલી અને આ વખતે રોહિત શર્માની કેપ્ટન્સીમાં ટીમ ઇન્ડિયા ટેસ્ટમાં ચેમ્પીયન બનતા રહી ગઇ છે.હાર બાદથી જ ટેસ્ટ કેપ્ટનને લઈને ચર્ચા ચાલી રહી છે. હવે આ બધાની વચ્ચે સમાચાર સામે આવ્યા છે કે રોહિત શર્મા માટે વેસ્ટ ઈન્ડિઝનો પ્રવાસ મહત્વપૂર્ણ સાબિત થઈ શકે છે. પ્રવાસ માટે ટીમની પસંદગી થઈ ગઈ છે અને તેમાં આગામી કેપ્ટનના સંકેતો છુપાયેલા છે. બીસીસીઆઈએ શુક્રવારે વેસ્ટ ઈન્ડિઝ સામેની સીરીઝ માટે ટીમની જાહેરાત કરી હતી. 2 મેચોની ટેસ્ટ સીરીઝ માટે પસંદ કરાયેલી ટીમને લઈને કેટલાક કડક નિર્ણયો લેવામાં આવ્યા છે. આમાં એવો નિર્ણય પણ આવ્યો કે જેના વિશે કોઈએ વિચાર્યું પણ ન હતું. ચેતેશ્વર પુજારાને ટીમની બહાર રાખવામાં આવ્યો હતો અને આનીથી એવો સંકેત પણ મળ્યો છે કે, રોહિત શર્મા હવે આગામી કેપ્ટન તરીકે નહીં રહે. સિલેક્ટરોએ ઇન્ડિયન પ્રીમિયર લીગ પછી ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપ ફાઇનલ માટે ટીમમાં પાછા ફરવા માટે આઉટ ઓફ ફેવર અજિંક્ય રહાણેને તક આપી હતી. માત્ર 1 મેચ બાદ તેને ફરીથી વાઇસ કેપ્ટન બનાવવામાં આવ્યો છે.. બીસીસીઆઈ આ ખેલાડી પર આટલો ભરોસો દર્શાવે છે તે માત્ર એક જ દિશામાં ઈશારો કરી રહ્યું છે કે, આગામી સમયમાં રોહિત શર્માને ટેસ્ટ કેપ્ટન પદેથી હટાવીને અનુભવી સ્ટાર બેટ્સમેન અજિંક્યે રહાણેને કેપ્ટન બનાવવામાં આવી શકે છે. BCCI હવે રોહિત શર્માને ત્રણેય ફોર્મેટમાં કેપ્ટનશિપના બોજમાંથી મુક્ત કરવા માંગે છે. હાર્દિક પંડ્યા પહેલાથી જ ટી-20માં મોટાભાગની મેચોની કેપ્ટનશીપ કરી રહ્યો છે. હવે તેને ટેસ્ટ મેચોમાં પણ સુકાનીપદથી રાહત મળી શકે છે. વેસ્ટ ઈન્ડિઝ પ્રવાસ બાદ અજિંક્ય રહાણેને આ જવાબદારી આપવામાં આવી શકે છે. ICC ODI વર્લ્ડકપ પર વધુ ધ્યાન આપવા માટે, BCCI નક્કી કરી શકે છે કે રોહિત શર્મા બંને ફોર્મેટની કેપ્ટનશિપમાંથી મુક્ત રહેશે. હાર્દિક પંડ્યા T20ની કેપ્ટનશીપ સંભાળી રહ્યો છે, અજિંક્ય રહાણેને ટેસ્ટ કેપ્ટન બનાવવો જોઈએ. અચાનક ટીમમાં વાપસીની તક આપવી અને પછી તેને ઉપ-કેપ્ટન બનાવવો એ કોઈ સંયોગ નથી. Join Our Official Telegram Channel: https://t.me/abpasmitaofficial","pubDate":"2023-06-25 18:21:30","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/04/29/d388e262ecfa463710a22b8f86ffce381682735034756567_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Gujarati"},{"title":"1983 World Cup Win: ... आणि तो त्यादिवशी खऱ्या अर्थाने भारतीय क्रिकेटचा 'देव' ठरला! भारताला विश्वचषक मिळवून देण्यात कपिल देव यांचा मोलाचा वाटा","link":"https://marathi.abplive.com/sports/cricket/40-years-1983-world-cup-win-india-created-history-on-this-day-june-25-1983-beating-west-indies-at-lords-detail-marathi-news-1187235","keywords":["क्रिकेट"],"creator":["एबीपी माझा वेब टीम"],"video_url":null,"description":"1983 World Cup Win:  भारतीय क्रिकेटच्या इतिहासामध्ये सुवर्ण अक्षरांनी लिहून ठेवावा असा क्षण म्हणजे 1983 साली भारताने जिंकलेला विश्वचषक (World Cup ) संपूर्ण भारत (India) आजही ज्या गोष्टींचा अभिमान बाळगतो त्यामधलीच ही एक गोष्ट.  तेव्हा संपूर्ण जगालाच काय भारताला देखील ही आशा नव्हती की त्या विश्वचषकावर भारताचं नाव कोरलं जाईल. पण या सगळ्यामध्ये भारतासाठी खऱ्या अर्थाने तो देव ठरला होता. तो म्हणजे भारतीय संघाचा माजी कर्णधार कपिल देव.  खरंतर कपिल देव यांच्या खेळीचा भारताच्या या यशामध्ये अगदी मोलाचा वाटा आहे असं म्हटलं तरी वावगं ठरणार नाही.  कपिल देव यांनी क्रिकेटच्या इतिहासात विक्रम रचला होता. समोर झिम्बाबेसारखा संघ. खरंतर त्या काळी  झिम्बाबे संघांचं देखील क्रिकेटमध्ये चांगलचं वजन होतं. पण त्यादिवशी कपिल देव यांनी झिम्बाबेच्या खेळाडूंना धू-धू धुतलं आणि भारतीय किक्रेट संघांचं नाव जगाच्या यादीत कोरलं गेलं. भारतीय क्रिकेट संघाचे कर्णधार कपिल देव यांनी 175 धावांचा ऐतिहासिक खेळी केली होती आणि त्यानंतर तो क्षण भारतीय क्रिकेटच्या इतिहासात सुवर्ण अक्षरांनी कोरला गेला.  या दिवशी कपिल देव हे एकदिवसीय सामन्यामध्ये 100 धावांची खेळी खेळणारे पहिले भारतीय क्रिकेटपटू ठरले होते.  झिम्बाबेचा सामना जिंकणं भारतासाठी महत्त्वाचं होतं  खरंतर ती भारतासाठी करो या मरो ची खेळी होती. अगदी 17 धावा करुन भारताचा निम्मा संघ माघारी फिरला होता. त्यामुळे भारतीयाचं विश्वचषक जिंकण्याचं स्वप्न आताही अपूर्णच राहणार असाच सगळ्यांचा समज झाला होता. पण त्यावेळी कर्णधार कपिल देव यांनी अगदी संयमाने खेळी केली आणि त्यांना मोलाची साथ मिळाली ते रॉजर बिन्नी याची. या जोडीने 48 चेंडूमध्ये 22 धावांची भागिदारी केली. त्यावेळी कपील देव यांनी 138 धावांमध्ये 175 धावा केल्या. भारताने झिम्बाबे समोर 267 धावांचं आव्हान ठेवलं आणि 31 धावांनी झिम्बाबेवर विजय मिळवला. त्यामुळे विश्वचषकाच्या दिशेने भारताचा महत्त्वपूर्ण प्रवास सुरु झाला होता.  आणि भारतासमोर इंग्लंडचं आव्हान  भारतानं झिम्बाबेवर मात करून उपांत्य फेरीत प्रवेश मिळवला होता. इंग्लंडसोबत 22 जून रोजी भारतीय संघ उपात्यं फेरीचा सामना खेळत होता. इंग्लंडने नाणेफेक जिंकली आणि फलंदाजी करण्याचा निर्णय घेतला होता. तेव्हा इंग्लंडने चक्क 60 षटकांमध्ये 213 धावा केल्या होत्या. त्यादिवशी देखील कपिल देव यांच्या कामगिरीमुळे भारतीयांच्या हृदयात कोरणार तो दिवस ठरला. कपिल देव यांनी 3 विकेट्स घेत संघाला विजयाच्या दिशेने नेलं. त्यांना संघातील इतर खेळाडूंची देखील तितकीच मोलाची साथ मिळाली. त्या खेळात भारताने अवघ्या काही षटकात विजय मिळवला होता. भारताच्या फलदांनी जोरदार कामगिरी करत अंतिम फेरीत दमदार प्रवेश मिळवला होता.  एक झेल आणि भारताचा ऐतिहासिक क्षण भारतासमोर विडींज आव्हान. खरंतर भारत अंतिम फेरीत पोहचला हिच भारतीयांसाठी खूप महत्त्वाची गोष्ट होती. लॉर्ड्सच्या मैदावर भारताच्या सुपुत्रांनी सुवर्णक्षण घडवला होता. विश्वचषकात तोपर्यंत फक्त वेस्ट इंडिजनेच दोनदा विश्वकप जिंकून क्रिकेटच्या विश्वात आपलं स्थान मजबूत केलं होतं. परंतु त्यानंतर भारताने त्यांचं सलग तिसऱ्यांदा विश्वविजेता होण्याचं स्वप्न मात्र अपूर्णच ठेवलं.  वेस्ट इंडिजच्या  संघाला अवघ्या 183 धावांचं लक्ष दिलं होतं आणि 140 धावांमध्ये  भारताच्या शिलेदारांनी तो डाव गुंडाळला होता. जगातील फलंदाजांच्या यादीमध्ये मानाचं स्थान असलेले विवियन रिचर्ड्स मैदानावर होते. तुफान फटकेबाजी लॉर्ड्सच्या मैदानावर सुरु होती आणि त्या एका झेलाने संपूर्ण डावच पालटला. विवियन रिचर्ड्स यांनी एक जोरदार शॉट मारला आणि कपील देव यांनी दूरचं अंतर गाठत चेंडू झेलला.  त्या दिवसाचं भारतीय क्रिकेटविश्वातच नाही तर प्रत्येक भारतीयाच्या मनात मानाचं आणि आदराचं स्थान आहे. आज त्या ऐतिहासिक दिवसाला 40 वर्ष पूर्ण होत आहेत. पण आजही प्रत्येक भारतीयांच्या मनात तो क्षण जशाच्या तसा आहे.   महत्त्वाच्या इतर बातम्या : 1983 World Cup Win : भारताच्या ऐतिहासिक कामगिरीला 40 वर्ष पूर्ण! आजच्या दिवशी विश्वचषक उंचावून रचला होता इतिहास","content":"1983 World Cup Win: भारतीय क्रिकेटच्या इतिहासामध्ये सुवर्ण अक्षरांनी लिहून ठेवावा असा क्षण म्हणजे 1983 साली भारताने जिंकलेला विश्वचषक (World Cup ) संपूर्ण भारत (India) आजही ज्या गोष्टींचा अभिमान बाळगतो त्यामधलीच ही एक गोष्ट. तेव्हा संपूर्ण जगालाच काय भारताला देखील ही आशा नव्हती की त्या विश्वचषकावर भारताचं नाव कोरलं जाईल. पण या सगळ्यामध्ये भारतासाठी खऱ्या अर्थाने तो देव ठरला होता. तो म्हणजे भारतीय संघाचा माजी कर्णधार कपिल देव. खरंतर कपिल देव यांच्या खेळीचा भारताच्या या यशामध्ये अगदी मोलाचा वाटा आहे असं म्हटलं तरी वावगं ठरणार नाही. कपिल देव यांनी क्रिकेटच्या इतिहासात विक्रम रचला होता. समोर झिम्बाबेसारखा संघ. खरंतर त्या काळी झिम्बाबे संघांचं देखील क्रिकेटमध्ये चांगलचं वजन होतं. पण त्यादिवशी कपिल देव यांनी झिम्बाबेच्या खेळाडूंना धू-धू धुतलं आणि भारतीय किक्रेट संघांचं नाव जगाच्या यादीत कोरलं गेलं. भारतीय क्रिकेट संघाचे कर्णधार कपिल देव यांनी 175 धावांचा ऐतिहासिक खेळी केली होती आणि त्यानंतर तो क्षण भारतीय क्रिकेटच्या इतिहासात सुवर्ण अक्षरांनी कोरला गेला. या दिवशी कपिल देव हे एकदिवसीय सामन्यामध्ये 100 धावांची खेळी खेळणारे पहिले भारतीय क्रिकेटपटू ठरले होते. झिम्बाबेचा सामना जिंकणं भारतासाठी महत्त्वाचं होतं खरंतर ती भारतासाठी करो या मरो ची खेळी होती. अगदी 17 धावा करुन भारताचा निम्मा संघ माघारी फिरला होता. त्यामुळे भारतीयाचं विश्वचषक जिंकण्याचं स्वप्न आताही अपूर्णच राहणार असाच सगळ्यांचा समज झाला होता. पण त्यावेळी कर्णधार कपिल देव यांनी अगदी संयमाने खेळी केली आणि त्यांना मोलाची साथ मिळाली ते रॉजर बिन्नी याची. या जोडीने 48 चेंडूमध्ये 22 धावांची भागिदारी केली. त्यावेळी कपील देव यांनी 138 धावांमध्ये 175 धावा केल्या. भारताने झिम्बाबे समोर 267 धावांचं आव्हान ठेवलं आणि 31 धावांनी झिम्बाबेवर विजय मिळवला. त्यामुळे विश्वचषकाच्या दिशेने भारताचा महत्त्वपूर्ण प्रवास सुरु झाला होता. आणि भारतासमोर इंग्लंडचं आव्हान भारतानं झिम्बाबेवर मात करून उपांत्य फेरीत प्रवेश मिळवला होता. इंग्लंडसोबत 22 जून रोजी भारतीय संघ उपात्यं फेरीचा सामना खेळत होता. इंग्लंडने नाणेफेक जिंकली आणि फलंदाजी करण्याचा निर्णय घेतला होता. तेव्हा इंग्लंडने चक्क 60 षटकांमध्ये 213 धावा केल्या होत्या. त्यादिवशी देखील कपिल देव यांच्या कामगिरीमुळे भारतीयांच्या हृदयात कोरणार तो दिवस ठरला. कपिल देव यांनी 3 विकेट्स घेत संघाला विजयाच्या दिशेने नेलं. त्यांना संघातील इतर खेळाडूंची देखील तितकीच मोलाची साथ मिळाली. त्या खेळात भारताने अवघ्या काही षटकात विजय मिळवला होता. भारताच्या फलदांनी जोरदार कामगिरी करत अंतिम फेरीत दमदार प्रवेश मिळवला होता. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); एक झेल आणि भारताचा ऐतिहासिक क्षण भारतासमोर विडींज आव्हान. खरंतर भारत अंतिम फेरीत पोहचला हिच भारतीयांसाठी खूप महत्त्वाची गोष्ट होती. लॉर्ड्सच्या मैदावर भारताच्या सुपुत्रांनी सुवर्णक्षण घडवला होता. विश्वचषकात तोपर्यंत फक्त वेस्ट इंडिजनेच दोनदा विश्वकप जिंकून क्रिकेटच्या विश्वात आपलं स्थान मजबूत केलं होतं. परंतु त्यानंतर भारताने त्यांचं सलग तिसऱ्यांदा विश्वविजेता होण्याचं स्वप्न मात्र अपूर्णच ठेवलं. वेस्ट इंडिजच्या संघाला अवघ्या 183 धावांचं लक्ष दिलं होतं आणि 140 धावांमध्ये भारताच्या शिलेदारांनी तो डाव गुंडाळला होता. जगातील फलंदाजांच्या यादीमध्ये मानाचं स्थान असलेले विवियन रिचर्ड्स मैदानावर होते. तुफान फटकेबाजी लॉर्ड्सच्या मैदानावर सुरु होती आणि त्या एका झेलाने संपूर्ण डावच पालटला. विवियन रिचर्ड्स यांनी एक जोरदार शॉट मारला आणि कपील देव यांनी दूरचं अंतर गाठत चेंडू झेलला. त्या दिवसाचं भारतीय क्रिकेटविश्वातच नाही तर प्रत्येक भारतीयाच्या मनात मानाचं आणि आदराचं स्थान आहे. आज त्या ऐतिहासिक दिवसाला 40 वर्ष पूर्ण होत आहेत. पण आजही प्रत्येक भारतीयांच्या मनात तो क्षण जशाच्या तसा आहे. महत्त्वाच्या इतर बातम्या : 1983 World Cup Win : भारताच्या ऐतिहासिक कामगिरीला 40 वर्ष पूर्ण! आजच्या दिवशी विश्वचषक उंचावून रचला होता इतिहास","pubDate":"2023-06-25 18:19:34","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/f7597f17f5c0abe6288819f3839376231687671124260689_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"ECB blasted over Essex racism probe following barrister's independent inquiry","link":"https://www.dailymail.co.uk/sport/cricket/article-12232489/ECB-blasted-Essex-racism-probe-following-barristers-independent-inquiry.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY MATT HUGHES: Mail Sport's revelations will lead to further questions about why the Newton report has not been published 18 months after it was commissioned.","content":"EXCLUSIVE: The ECB are blasted over Essex racism probe as barrister's inquiry finds officials failed to interview ex-chairman John Faragher before he was charged with using racist language The ECB have been strongly criticsed by a review into the racism inquiry at Essex Former Essex chairman John Faragher left the club back in November 2021 The r eport alleges the ECB failed to interview him before racist language charge By Matt Hughes For The Daily Mail Published: 22:30 BST, 25 June 2023 | Updated: 01:19 BST, 26 June 2023 e-mail View comments The ECB have been strongly criticised by leading barrister Katharine Newton KC in her independent inquiry into alleged racism at Essex. Mail Sport has seen a copy of Newton’s interim report, commissioned by Essex in November 2021 and completed by the following March, but which has yet to be published 15 months later. In bombshell revelations that will embarrass the ECB ahead of Monday's publication of a separate independent report into discrimination in cricket and Wednesday’s second Ashes Test at Lord’s, Mail Sport can disclose that Newton’s inquiry: Criticises ECB investigators for failing to interview former Essex chairman John Faragher before charging him with using racist language. Concludes the ECB broke its own regulations by pressuring Essex to remove Faragher in November 2021, which included a threat to stop hosting women’s internationals at Chelmsford. A leading barrister has criticised the ECB for failing to interview former Essex chairman John Faragher (left) before charging him with racist language Rejects the ECB’s formal denial of this governance breach, first reported by Mail Sport in April 2022, raising the possibility of an attempted cover-up Highlights the ECB’s failure to investigate Faragher three years earlier, when a complaint that he had made a racist remark was made in person to then ECB chairman Colin Graves. Mail Sport’s revelations will lead to further questions about why the Newton report has not been published 18 months after it was commissioned. Newton’s criticisms relate to a previous regime at Lord’s before the appointments of Richard Thompson and Richard Gould as chairman and chief executive last year. The ECB declined to comment. Newton’s first report focuses on the allegation that then Essex chairman Faragher used the phrase ‘n***** in the woodpile’ at a Board meeting in November 2017, which he has always denied. She also went on to produce a second report last year into allegations of racism made against former Essex players and coaches, which has also been completed but has yet to be published. Following a four-month investigation Newton concluded ‘on the balance of probabilities’ that Faragher did use the offensive remark. After their independent inquiry found against Faragher Essex pleaded guilty to two ECB charges of bringing the game into disrepute and were fined £50,000. Newton's independent inquiry also claimed the ECB broke their own regulations by pressuring Essex to remove Faragher in November 2021 But in her report Newton is scathing about the ECB’s investigation, expressing astonishment that Faragher was never interviewed by the ECB, who she claims only spoke to those who supported the allegations. Newton’s criticisms echo those made by the seven Yorkshire players charged by the ECB with making racist comments to Azeem Rafiq last year, many of whom also complained about not being interviewed during the investigation. ‘It is apparent the ECB has adopted a very different investigatory process to mine,’ Newton writes. ‘First, the ECB has not interviewed John Faragher at any point, even though he is the person accused of making the remark. It is unclear to me why the ECB has adopted this approach in circumstances where there is a dispute of evidence as to whether or not the comment was indeed made. ‘Second, the ECB has only interviewed some, but not all, attendees at the relevant meetings. In particular, in so far as ‘The Comment’ part of the charge is concerned, the ECB appears to have focussed only on interviewing those whose evidence is supportive of the charge.’ Newton also endorses revelations in Mail Sport 14 months ago that the ECB broke their own rules by instructing Essex to sack Faragher in November 2021, before he had even been charged and just two days after he had given a week to respond to queries from the ECB’s then head of investigations James Pyemont. The damning revelations come days before the second Ashes Test gets underway at Lord's The ECB strongly denied Mail Sport’s reporting then but Newton’s conclusion is different. ‘In November 2021, post the revelations about what had occurred at Yorkshire, JF was informed by the ECB that the allegation concerning the “woodpile” comment had been made against him and he needed to respond to the allegation,’ she writes. ‘In the original letter from the ECB, JF was given a period of time to respond. However, on the morning of November 11, 2021, JF received a call from the acting chairman of the ECB, Barry O’Brien, to say that he was going to be dismissed that night. The ECB, via (Essex chief executive) John Stephenson, also threatened the club with the removal of its women’s internationals and other sanctions if JF was not removed as chairman. This was pressure the club felt unable to resist.’ Newton also confirms other reports that the ECB failed to deal with the matter when a complaint was raised over three-and-a-half years earlier. Given Essex were charged and fined by the ECB for failing to investigate the incident properly Newton’s confirmation of the Graves meeting raises the question of whether the governing body’s disciplinary arm should take action against themselves. ‘In March 2018 a member of the (Essex) Board contacted the ECB about JF and met with Colin Graves, then chairman,’ Newton writes. ‘This individual told me that he discussed the woodpile comment, and CG told the individual that “this was not their jurisdiction. This was not something that they could get involved with and it was something the club had to deal with themselves”.’ Share or comment on this article: ECB blasted over Essex racism probe following barrister's independent inquiry e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-25 21:58:46","image_url":"https://i.dailymail.co.uk/1s/2023/06/25/22/72519275-0-image-a-49_1687728437223.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australian cricketers","link":"https://www.dailymail.co.uk/sport/cricket/article-12232295/JASON-GILLESPIE-Playing-Lords-brings-sense-tradition-history-Australian-cricketers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: As I found in 2001, it is a quirky place but it has that richness that really gets you going. It's a wonderful place to play cricket and it was a thrill to get my name on the honours board.","content":"JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australia's cricketers... but they must be wary of the famous slope England and Australia face off in the second Ashes Test at Lord's on Wednesday For Aussie cricketers, playing at the famous ground is a truly unique experience It is a special place to play at but there are lots of things you need to adapt to By Jason Gillespie For The Daily Mail Published: 17:30 EDT, 25 June 2023 | Updated: 17:52 EDT, 25 June 2023 e-mail View comments For Australian cricketers, playing at Lord’s brings a sense of tradition and history and provides a totally different experience to other grounds. From coming through the Long Room, walking down through the members out on to the ground, or sitting in the changing rooms, looking at the honours boards and all the wonderful players from around the world that have played Test matches and been successful, to the paintings on the walls, and even the famous lunches — all these things are special. As I found in 2001, it is a quirky place but it has that richness that really gets you going. It’s a wonderful place to play cricket and it was a thrill to get my name on the board with a five-for in the second innings of my Lord’s Test debut. Australians have tended to soak up that opportunity to play there rather than be intimidated by it, and I think that’s sometimes because players who have been picked on tours think they may never get another opportunity to play at this iconic ground, so they really want to embrace it. Even the quirkiness of the scene can be inspiring — people wearing ties and jackets in the stands, sat on little seat cushions with scorebooks and a Thermos of coffee. England face Australia at Lord's but the Aussies will have to be wary of the famous slope The Lord's slope is iconic in cricket and it often take a little bit of time to get used to it For Australian players like Scott Boland (left) - who have never played a Test at Lord's - it is a truly unique experience and there a lot of factors you need to adapt to Lord’s also has the famous slope for bowlers to contend with, and that takes a little bit to get used to it. You just need to adjust your line ever so slightly. If you’re aiming to hit off stump, you’re probably starting the ball just a fraction outside off stump from the pavilion whereas from the nursery end, if you want to bowl that off stump, fourth stump line, you’re looking at a middle, middle-and-off line. But all cricketers need to adjust to the conditions they are presented with and Lord’s is no different. So the likes of Scott Boland and Cameron Green will need to get out and familiarise themselves with the surroundings. Australia head into the second Test in great spirits after a rare tight win over England. Until Birmingham, any Ashes Test since 1924-25 with a result margin of less than 20 runs or fewer than two wickets had gone against them, so it’s a great sign that this 2023 team has overturned that statistic. The opening game just showed there is more than one way to win in Test cricket. England’s approach of scoring consistently quicker than Australia across both innings was valid, but we saw two captains in Pat Cummins and Ben Stokes using different field settings and employing their bowlers in different ways. There were question marks on day one about the defensive field placings Cummins had. But in their strategy meetings, Australia would have conceded that England play a certain attacking way, so they may as well protect an extra boundary. I feel that as Lord’s offers a little bit more assistance for the ball early in the game, we will see slightly more attacking fields and I don’t expect to see a sweeper out on the off side from the get-go. There were question marks about Pat Cummins's captaincy during the first Test last week Ben Stokes's tactics were different but it showed there is more than one way to win a Test If they have one, it will probably be on the leg-side which allows a quick bowler to bowl a bit straighter and gives them the option of bowling a bouncer as well. Imagine the energy, positivity and confidence the whole Australia dressing room must have got from Cummins, their leader, not only talking the talk but walking the walk. He certainly led from the front, and at the point when you thought Australia might shut up shop with 52 further runs required and two wickets standing, he went bang-bang with two sixes off Joe Root. No doubt Australia will take confidence from that but England won’t be despondent about what was obviously a disappointing loss. It was fascinating to see a Test decided by two wickets but with teams employing completely different strategies.If the first Test is anything to go by, this is going to be an absolute cracker of series that still looks too close to call. Share or comment on this article: JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australian cricketers e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-25 21:52:19","image_url":"https://i.dailymail.co.uk/1s/2023/06/25/22/72520097-0-image-a-22_1687729927609.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ashleigh Gardner spins Australia back into the box seat during chaotic Ashes session","link":"https://7news.com.au/sport/cricket/ashleigh-gardner-spins-australia-back-into-the-box-seat-during-chaotic-ashes-session-c-11086455","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"England are in need of an Ashes miracle after Ashleigh Gardner flipped the script on its head.","content":"Ashleigh Gardner has spun back into the box seat of the after a chaotic fourth day ended with England 5-116 chasing 268 for victory. On a dramatic Sunday at Trent Bridge, Australia fell from 1-149 to all out for 257 in their second innings, after star spinner Sophie Ecclestone fuelled two separate collapses of 6-49 and 3-0. Watch, Stream & Catch Up with Australia's Home of Cricket on England then got away to a flyer in the chase, and looked as if they could pull it off in a canter when they scored 0-55 from their first 10 overs. Then Gardner arrived. After the finger-spinning allrounder took 4-99 in the first innings, she removed the in-form Tammy Beaumont with her first ball in the second innings. Fresh off scores of 201 in a warm-up game and 208 in the first innings at Trent Bridge, Beaumont squeezed Gardner to first slip on 22 where Beth Mooney took the catch. Gardner then got rid of veteran Nat Sciver-Brunt in her next over for a duck on a top-edged sweep, before a sharp-turning delivery trapped Heather Knight lbw for 1. Ecclestone is widely regarded as the world’s best spinner but Gardner must be in the conversation. “I think Ash isn’t too far behind her,” Australia opener Beth Mooney said. “She has been outstanding for us in the past couple of years. “There was a time two or three years ago where Meg tended to not throw the ball to Ash in T20 cricket. “To her credit she changed what she did and changed her variations and things like that.” England opener Emma Lamb also fell in the collapse, lbw to Tahlia McGrath when ball-tracking showed it would have clipped leg stump. Kim Garth then struck in the shadows of stumps to have Sophia Dunkley caught behind for 16, leaving Danni Wyatt (20no) and nightwatcher Kate Cross to fight to the close with 152 more needed. England will need to not only pull off the biggest successful chase in a women’s Test to win, but also eclipse the record for the highest fourth-innings score in any result. “They had the ball on a string in the last 60 minutes,” Mooney said. “It’s pretty tough conditions once the ball gets a bit soft. “The game is teetering ... but we feel like we are probably the happier team walking off.” Australia, for their part, would still feel life could be more comfortable. They were cruising late in the morning session, before England debutante Lauren Filer claimed Ellyse Perry’s wicket for the second time in the match on 25 and also bowled McGrath for one with her pace. Ecclestone then took command, claiming her second five-wicket haul of the Test and making for match figures of 10-192. She bowled Jess Jonassen sweeping on 14, had Mooney chop on to a ball that spun back to her sharply on 73 and got first-innings Annabel Sutherland caught pulling on 15. Alyssa Healy survived a dropped chance first ball that would have marked her fourth straight Test duck, before she posted a counter-attacking 50 to give Australia something to bowl at. But just when she and Alana King looked set to take Australia to a lead of 300 with a 59-run eighth-wicket stand, Australia lost 3-0 with Ecclestone taking the last two wickets to finish with 5-63 for the innings. “We will always believe. We will go into tomorrow ready to win this Test match,” Ecclestone said.","pubDate":"2023-06-25 21:32:16","image_url":"https://images.7news.com.au/publication/C-11086455/ffa9d095b8c563d2da30631fb3a1b9362c6d8e09-16x9-x0y0w1024h576.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Home runs and cricket greats mean happy welcome for MLB in London","link":"https://www.theguardian.com/sport/2023/jun/25/baseball-cricket-mlb-london-st-louis-cardinals-chicago-cubs","keywords":["Baseball","Chicago Cubs","St Louis Cardinals","US sports","Sport","Cricket"],"creator":["Andy Zaltzman at London Stadium"],"video_url":null,"description":"St Louis Cardinals played the Chicago Cubs, enhanced by the guest presence of Jimmy Anderson and Nathan LyonCricket and its long‑lost rogue cousin, baseball, enjoyed an emotional reunion over the weekend. Jimmy Anderson pitched in front of a crowd almost twice as big as any he has bowled in front of in England, and in all more than 100,000 people attended a two‑game series between the Chicago Cubs and St Louis Cardinals at the London Stadium, constituting a mere 0.08% of the Major League Baseball regular season. Indian Premier League franchise owners no doubt cast envious eyes at baseball, dreaming wistfully of a 2,430-game regular season. Cricketers may be tempted by $350m (£275m) 12-year contracts.The weekend offered everything sports watchers in Britain have come to expect from visiting American major‑league events – a large crowd with considerable enthusiasm for the sport, but understandably limited emotional investment in the result, an armageddon’s‑worth of cholesterol and a stadium announcer with the kind of deeply sonorous and unquenchably American voice that could imbue a village-fete cake competition with a sense of fundamental sporting gravity. Continue reading...","content":"C ricket and its long‑lost rogue cousin, baseball, enjoyed an emotional reunion over the weekend. Jimmy Anderson pitched in front of a crowd almost twice as big as any he has bowled in front of in England, and in all more than 100,000 people attended a two‑game series between the Chicago Cubs and St Louis Cardinals at the London Stadium, constituting a mere 0.08% of the Major League Baseball regular season. Indian Premier League franchise owners no doubt cast envious eyes at baseball, dreaming wistfully of a 2,430-game regular season. Cricketers may be tempted by $350m (£275m) 12-year contracts. The weekend offered everything sports watchers in Britain have come to expect from visiting American major‑league events – a large crowd with considerable enthusiasm for the sport, but understandably limited emotional investment in the result, an armageddon’s‑worth of cholesterol and a stadium announcer with the kind of deeply sonorous and unquenchably American voice that could imbue a village-fete cake competition with a sense of fundamental sporting gravity. London calling for devout MLB fans as historic rivalry goes international | Matthew Engel Read more From my admittedly unscientific research, sitting high in the stands over the left-field wall, the crowd seemed to consist of a good-natured cocktail of American tourists, baseball-curious sports fans and British baseball enthusiasts, many of them a legacy of the days when MLB action occupied the late-night hours of the Channel 5 schedule, hosted by Jonny Gould, a much‑loved production which achieved a rare televisual blend of insight, expertise, humour and enthusiasm. Quick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'. If you already have the Guardian app, make sure you’re on the most recent version. In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications. Turn on sport notifications. Was this helpful? Thank you for your feedback. They saw a dominant Chicago victory on Saturday, the Cubs establishing a seven-run lead by the end of the fourth of nine innings, driven by two soaring Ian Happ home runs (it is, admittedly, difficult for a home run to do anything other than soar), and a difficult outing for the veteran Cardinals pitcher Adam Wainwright. The flicker of a St Louis revival came to nothing. The game on Sunday began in a flurry of fielding errors (presumably because of the teams’ lack of red‑ball cricket in the buildup). The Cubs raced to a four-run first‑inning lead before the Cards, one of MLB’s worst-performing teams this season, finally roused from their slumbers to take a 7-5 victory in a game replete with hits but devoid of home runs, finished by the closing pitcher Jordan Hicks in a flurry of 103mph rockets. On both days, there seemed to be a healthy contingent of cricket fans in attendance. If you love one of these two historic sports you can, with the right induction, learn to love the other. (And if, as all correct-thinking humans do, you love cricket statistics, baseball offers more stats than the entire readership of the Guardian has had hot dinners.) Twenty20 cricket has been, often disparagingly, likened to baseball but the latter is – in tone, pacing and structure – much more akin to the rhythms and moods of Test cricket (assuming the current Bazballistic version of England are not batting). Its fundamental state of existence is inaction with the constant possibility of drama, rather than constant action with the occasional outbreak of actual tension. As in cricket, each delivery shifts the story of the game, sometimes imperceptibly, sometimes strikingly, and if the intricacies of the art and deception of pitching are hard to discern from 150 metres or so away, the eruption of timing and power in a home run, the smooth, high-speed precision choreography of a double play, and the sheer velocity of a well‑whanged ball are aesthetic treats for any sport lover. A Chicago Cubs fan with a beer bat before the second game in London. Photograph: Simon Marper/PA Beyond the novelty of seeing high‑level baseball in London, the spectator experience was, as spectator experiences tend to be at such events, largely indistinguishable from anything else. Any gaps in play were filled with something or other from the Anything to Avert The Remote Possibility of Crowd Spontaneity file. The unquestioned highlight was a half-lap mascot race in which a giant Winston Churchill and an even‑more‑than‑usually‑oversized Henry VIII showed the value of top-level leadership experience by streaking away from a showboating Freddie Mercury and a generic bearskin-hatted Grenadier Guard, who seemed overawed by the occasion as much as hindered by his impractical headgear, and failed to mount even a ghost of a challenge. The guardsman’s highly suspicious win in the Sunday race smacked of the kind of dubious fixing that has undermined mascot sporting contests for too long. The game itself was introduced by MLB this season, which have led to a significantly faster, more fluent spectacle. Cricket (not uniquely in sport) has yet to acknowledge that, whatever the quality of the action, dawdling never adds to it. With its slumping over rates in men’s and women’s games, endless interruptions, glacially moving umpires, and four-hour T20 games, if cricket is not feverishly studying this blueprint for product improvement it is even more of an administrative buffoon than its supporters had assumed. skip past newsletter promotion Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion In the event of the much prophesied DeathOfTestCricket™, if and when the five-day game finally succumbs to the ravening myopic maw of the so-called “free” markets, baseball will offer a refuge for those who seek a contest with a similar narrative nature. Chicago Cubs’ Nico Hoerner steals a base at the London Stadium. Photograph: Simon Marper/PA Post-season baseball in particular, in which teams compete over a series of matches with lasting resonance within the history of the sport, in which the impact of each significant play and tactical decision is magnified and scrutinised, which fluctuates and evolves over days and weeks, is the closest (and perhaps only) available alternative to Test matches. The links between the two sports have included a 1932 meeting between baseball’s defining player, Babe Ruth, and cricket’s statistical nonpareil Don Bradman, to which we can now add Anderson and Nathan Lyon, almost 1200 Test wickets between them, side‑by‑side in the impressively metamorphosed former Olympic Stadium, throwing the ceremonial first pitch on Saturday. The England maestro, who, after toiling on the Edgbaston stodgepot, was perhaps enjoying the idea of a sport in which you do not have to make the ball bounce, was in a Cubs shirt. Australia’s premium‑grade off-spinner represented the Cardinals. Regardless of St Louis’s revenge on Sunday, the Cubs’ 9-1 first-game win with Anderson in their corner has surely landed a series-swinging psychological hammer-blow for England before the Lord’s Test. Luis Arráez and the quest for baseball’s elusive .400 barrier Read more","pubDate":"2023-06-25 21:08:41","image_url":"https://i.guim.co.uk/img/media/2d61f05bfc46eeb3ac400fb1097391aa4660cc67/0_78_3500_2099/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=3542c6018e17f31911cd1aabdb280379","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"حسن علی نے ٹی ٹونٹی ورلڈ کپ میں آسٹریلیا کیخلاف کیچ ڈراپ کرنے پر افسوس کا اظہار کر دیا","link":"https://pni.net.pk/sports-news/cricket-news/467677/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"لاہور (پی این آئی ) پاکستانی کرکٹر حسن علی نے آئی سی سی T20I ورلڈ کپ 2021 میں آسٹریلیا کے خلاف سیمی فائنل میچ کے دوران ایک اہم ڈراپ کیچ پر افسوس کا اظہار کیا۔ حال ہی میں حسن علی نے ٹوئٹر پر اپنی ٹیم، [...] The post حسن علی نے ٹی ٹونٹی ورلڈ کپ میں آسٹریلیا کیخلاف کیچ ڈراپ کرنے پر افسوس کا اظہار کر دیا appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"لاہور (پی این آئی ) پاکستانی کرکٹر حسن علی نے آئی سی سی T20I ورلڈ کپ 2021 میں آسٹریلیا کے خلاف سیمی فائنل میچ کے دوران ایک اہم ڈراپ کیچ پر افسوس کا اظہار کیا۔ حال ہی میں حسن علی نے ٹوئٹر پر اپنی ٹیم، برمنگھم بیئرز کی شاندار کارکردگی پر تعریف کا اظہار کیا، کیونکہ انہوں نے جاری وائٹلٹی بلاسٹ ٹورنامنٹ میں لگاتار 5 میچ جیتنے کا شاندار کارنامہ انجام دیا۔ ان کے ٹویٹ کے جواب میں ایک مداح نے حسن کو مذکورہ آئی سی سی ٹورنامنٹ کے سیمی فائنل کے دوران چھوڑا گیا کیچ یاد دلاتے ہوئے کہا کہ “لیکن ہم آسٹریلیا کے خلاف اس کیچ کو پھر بھی نہیں بھولے۔” مداح کے ٹویٹ سے دل کی گہرائیوں سے متاثر ہوئے، 28 سالہ نوجوان پیسر نے اس لمحے کی کشش اور اس کے سیمی فائنل میں ٹیم کے امکانات پر پڑنے والے اثرات کو تسلیم کیا۔ فاسٹ بولر نے چھوٹنے والے کیچ پر دکھ کا اظہار کیا اور افسوس کا اظہار کرتے ہوئے کہا کہ گرائے گئے موقع کی یاد آخری سانس تک کبھی نہیں بھولیں گے۔ انہوں نے کہا کہ “یہاں تک کہ مجھے اب بھی یاد ہے اور آخری سانس تک یا اس کے بعد بھی کبھی نہیں بھولوں گا”۔ یاد رہے کہ پاکستان نے ٹورنامنٹ کے گروپ مرحلے میں ناقابل شکست ریکارڈ برقرار رکھتے ہوئے نہ صرف دوسری ٹیموں کے خلاف فتح حاصل کی بلکہ بھارت کے خلاف بھی شاندار کارکردگی کا مظاہرہ کرتے ہوئے آئی سی سی ایونٹ کی تاریخ میں پہلی بار دس وکٹوں سے شکست دی۔ تاہم، حسن علی نے 19ویں اوور میں میتھیو ویڈ کا کیچ ڈراپ کرنے کے بعد آسٹریلیا نے جیت حاصل کی۔ جب حسن نے کیچ چھوڑا تو آسٹریلیا کو دس گیندوں پر جیت کے لیے 20 رنز درکار تھے۔ اس کے بعد بائیں ہاتھ کے وکٹ کیپر بلے باز کی طرف سے شاندار بیٹنگ نے کینگروز کو کامیابی دلا دی ۔","pubDate":"2023-06-25 19:49:43","image_url":null,"source_id":"pninet","category":["sports"],"country":["pakistan"],"language":"Urdu"},{"title":"Cricket Updates: Australia win first Ashes Test, World Cup Qualifiers…","link":"https://www.samaaenglish.tv/news/40040346/sports-cricket-updates-australia-win-first-ashes-test-world-cup-qualifiers","keywords":["Sports"],"creator":null,"video_url":null,"description":"There were some interesting matches in different formats of Cricket this week, including the Ashes Test Series and ICC World Cup Qualifiers in Zimbabwe. Ashes England and Australia faced off in the first Ashes Test in Edgbaston, where England stunned their opponents by declaring after scoring just 393 runs on Day 1. Australia fought back and scored 386 runs but England gave them a target of 281 runs in the fourth innings. The Kangaroos were struggling at one stage as they lost eight wickets for 227 runs. They needed 54 runs but their skipper Pat Cummins did not give up. Cummins not out on 44 and helped Australia register the historic win in Birmingham. ICC World Cup Qualifiers Zimbabwe and Sri Lanka have become favourites to qualify for the ODI World Cup in India, as they have won three games each. Two-time world champions West Indies suffered an upset loss against Zimbabwe but they could still qualify, if they turn the things around in the super six round. On the other hand Ireland, UAE, Nepal and USA are already out of the race of qualification. Najam Sethi vs Zaka Ashraf Pakistan Cricket Board witnessed some big changes as Najam Sethi had to leave the office and Zaka Ashraf was added to the board of governors. Zaka Ashraf is already opposing some big decisions of Najam Sethi, as he said that the hybrid model is not a victory for Pakistan. It is also expected that he will change the coaching staff, which was appointed by Najam Sethi. But things surely could become more interesting in PCB next week.","content":"England and Australia faced off in the first Ashes Test in Edgbaston, where England stunned their opponents by declaring after scoring just 393 runs on Day 1. Australia fought back and scored 386 runs but England gave them a target of 281 runs in the fourth innings. The Kangaroos were struggling at one stage as they lost eight wickets for 227 runs. They needed 54 runs but their skipper Pat Cummins did not give up. Cummins not out on 44 and helped Australia register the historic win in Birmingham. Zimbabwe and Sri Lanka have become favourites to qualify for the ODI World Cup in India, as they have won three games each. Two-time world champions West Indies suffered an upset loss against Zimbabwe but they could still qualify, if they turn the things around in the super six round. On the other hand Ireland, UAE, Nepal and USA are already out of the race of qualification. Pakistan Cricket Board witnessed some big changes as Najam Sethi had to leave the office and Zaka Ashraf was added to the board of governors. Zaka Ashraf is already opposing some big decisions of Najam Sethi, as he said that the hybrid model is not a victory for Pakistan. It is also expected that he will change the coaching staff, which was appointed by Najam Sethi. But things surely could become more interesting in PCB next week.","pubDate":"2023-06-25 19:22:39","image_url":"https://i.samaaenglish.tv/large/2023/06/2600095475b069b.jpg?r=001038","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ash Gardner strikes to spark England collapse leaving Australia in charge","link":"https://www.theguardian.com/sport/2023/jun/25/the-ashes-england-australia-cricket-ash-gardner","keywords":["Women's Ashes","England women's cricket team","Australia women's cricket team","Women's cricket","Cricket","Australia sport","Sport"],"creator":["Raf Nicholson at Trent Bridge"],"video_url":null,"description":"Only Test, day four: Australia 473 & 257; England 463 & 116-5England lose four wickets for 18 runs to squander initiativeEngland’s chances of a first Test win since January 2014 and a first win against Australia in any format since July 2019 hung in the balance at stumps on the fourth day at Trent Bridge, as they sunk to 116 for five in pursuit of a fourth-innings target of 268.Though Sophie Ecclestone claimed her side would “go away tonight and figure out how we’re going to win this Test match”, Australia are confident that victory is within easy reach. “It is teetering a little bit,” Beth Mooney said. “I back our bowlers to take the five wickets. We feel like we’re the happier team walking off this afternoon, for sure.” Continue reading...","content":"England’s chances of a first Test victory since January 2014 and a first win against Australia in any format since July 2019 hung in the balance at stumps on the fourth day at Trent Bridge, as they sunk to 116 for five in pursuit of a fourth-innings target of 268. Though Sophie Ecclestone claimed her side would “go away tonight and figure out how we’re going to win this Test match”, Australia are confident that victory is within easy reach. “It is teetering a little bit,” Australia’s Beth Mooney said. “I back our bowlers to take the five wickets. We feel like we’re the happier team walking off this afternoon, for sure.” Women’s Ashes Test: Australia set England target of 268 to win on day four – as it happened Read more England had strolled to 55 without loss after 10 overs, but a collapse of four wickets for 18 runs in five overs midway through the evening session tipped momentum in favour of Australia. In desperation, both Emma Lamb and Heather Knight – trapped lbw by Tahlia McGrath and Ash Gardner respectively – sent their decisions upstairs, but DRS showed both as being umpire’s call on impact. Knight became Gardner’s third victim, after the off-spinner had earlier tempted the first-innings double-centurion Tammy Beaumont into slicing a half-volley to slip. In between times, Nat Sciver-Brunt was the agent of her own demise, miscuing a pull to be caught by Kim Garth running round from short leg. Minutes before the close, Garth chipped in with a wicket of her own, her outswinger taking the edge of Sophia Dunkley and landing in the gloves of Alyssa Healy behind the stumps. Though the nightwatcher Kate Cross sent the penultimate ball of the day crashing through mid‑off for four, there are still 152 runs needed to secure victory. With Australia’s spinners licking their lips at the prospect of a fifth day on this pitch, England have a mountain to climb. It was meant to be Ecclestone’s day, after her cumulative match‑haul of 10 for 192 across 77.1 overs (the most bowled by any Englishwoman in a Test since 1987) led what seemed like a routing of Australia for 257. Wickets fell in clusters, including four for 20 in 34 balls immediately after lunch, and – after a 59-run partnership between Healy and Alana King for the eighth wicket – the loss of Australia’s final three batters in the space of seven balls for no runs after tea. Beth Mooney is bowled by Sophie Ecclestone, who took five wickets in each innings. Photograph: James Gill/Danehouse/Getty Images “I knew I was going to bowl a lot of overs, but I didn’t think it would be this many,” Ecclestone said. “You can’t really prepare for that, you’ve just got to go with it and be tough in the mind.” Ecclestone had switched to the Radcliffe Road End at the start of the day, in what seemed to be an attempt to make the most of some scuffed-up footholes at the Pavilion End (from which her previous 50 overs had been delivered). That did the job to see off Mooney, who was finally dismissed halfway through the afternoon session 15 runs short of a maiden Test century, by a ball which spun out of the footmarks on to her stumps. Around her, there were some uncharacteristically tentative shots from the Australians: first-innings centurion Annabel Sutherland pulled Ecclestone straight to square-leg, while Gardner edged Cross to slip. Most strangely of all, the Australia captain Healy, carded at No 6, did not emerge from the dressing room until six wickets had already gone down. That meant a longer wait nursing three quarters of a double‑pair (after three successive ducks in Test cricket). She almost achieved that dubious honour when she was put down by Amy Jones behind the stumps first ball – one of a series of spilled chances across the day, including five by the wicketkeeper-first slip pairing of Jones and Knight. Had they taken those chances, they might yet be celebrating a win. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Quick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'. If you already have the Guardian app, make sure you’re on the most recent version. In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications. Turn on sport notifications. Was this helpful? Thank you for your feedback. Instead, Healy clung on to bring up a 61-ball half-century in the second over after tea – but fell three balls later, limply holing out off a full toss to Lamb at midwicket, to hand Ecclestone her fourth wicket of the day. Darcie Brown, trapped lbw, completed the set; Ecclestone led her team from the pitch holding the ball aloft for the second time in four days. At the close of play Ecclestone said the England head coach, Jon Lewis, had given the team “a bit of a rocket” after a difficult last hour on Saturday evening. Whatever he said, it seemed initially to have worked: they resumed day four with much more of a spring in their steps, especially when Cross – in her third over of the morning – bowled a jaffa which pitched a mile outside off and jagged back in to hit Phoebe Litchfield’s middle stump. England were also buoyed by the return of Sciver-Brunt to the attack, after she was unable to bowl on Saturday due to a knee injury. But it was Lauren Filer who made the morning session fizz, finally living up to her pre-match billing by Lewis as “a key wicket-taking threat”. In back-to-back wicket maidens just before lunch, in which she clocked speeds of 76mph, she removed two of the world’s best batters in quick succession – Ellyse Perry bowled trying to fend off a bouncer, before McGrath was beaten for pace and the ball ricocheted off her pads into the stumps. Perry, dismissed for the second time in the match by England’s debutante pacer, looked rather sheepish. As it turned out, Australia had the last laugh.","pubDate":"2023-06-25 18:59:15","image_url":"https://i.guim.co.uk/img/media/7dd5683fe5c77d821656f966cd8da219a05bd186/0_49_4699_2820/master/4699.jpg?width=460&quality=85&auto=format&fit=max&s=bcf7bd5b775bb8b97dbb5ec5f0573b5f","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"County cricket: Hill and Bean hit centuries for Yorkshire v Gloucestershire","link":"https://www.theguardian.com/sport/live/2023/jun/25/county-cricket-yorkshire-v-gloucestershire-surrey-v-lancashire-and-more-live","keywords":["County Championship","Sport","Cricket"],"creator":["Tanya Aldred"],"video_url":null,"description":"Finlay Bean and George Hill for Yorkshire on the opening day of the match against GloucestershireA wicket at The Oval – Bohannon lbw to Sean Abbot for 10. Lancs 35-2. And Hutton has ticked off another of Somerset’s batters George Bartlett for 13. Somerset 56-3.“Just trying to get my head around how the Kookaburra can be ‘more helpful to the bowlers’ despite apparently offering less seam and swing?! taps Brian Withington. “Certainly seems to be capturing some early wickets today though. Apologies if this has already been dissected BTL but haven’t got there yet.” Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 2h ago Opening day roundup 4h ago Closer of play scores 6h ago A hundred for George Hill! 7h ago Tea-time scores 7h ago Hundreds for Dan Lawrence and Tom Westley! 8h ago A hundred for Alex Lees! 8h ago A hundred for Finlay Bean! 8h ago Somerset 163 all out 12h ago Kookaburra ball 13h ago Preamble 13h ago Fixtures Show key events only Please turn on JavaScript to use this feature 2h ago 20.55 BST Opening day roundup Tanya Aldred This round of Championship cricket, squeezed between the T20 Blast, has the novelty of being the first of two this summer which will use the Kookaburra ball. They were prescribed by the Strauss report, in an attempt to reduce reliance on the swing and seam of the Dukes and encourage fast and spin bowling. One day in, with seven centuries on the board but five teams bowled out in less than a day, it seems too early to make a call. Finlay Bean and George Hill made the most of a good Headingley pitch, a swift outfield, and some wayward Gloucestershire bowling, to rock to sparkling centuries and put Yorkshire in a dominant position. At Chelmsford, Dan Lawrence made his second hundred of the season for Essex , in a partnership of 227 with Tom Westley, who was finally out for a sparkling 114. Dom Bess grabbed two consolation wickets for Warwickshire . A humdinger of a game is developing at The Oval, where Lancashire were dismissed for 274 only to have Surrey 70 for four at stumps. A Brett Hutton five‑fer took the shine off Somerset’s day against Nottinghamshire , dismissed for 163. Hampshire finished the day on 284 for four against Middlesex . Spinner Liam Dawson, overlooked by England, was 111 not out overnight and, along with Nick Gubbins, shimmied Hampshire into a dominant position. At the County Ground, Rob Keogh’s 97 propped up Northamptonshire in the Division One basement battle against Kent . Durham raced along at now familiar lick, with centuries from Alex Lees and Ollie Robinson putting pressure on a Leicestershire side already reeling from the news that Paul Nixon had been put on gardening leave. Nathan McAndrew and Jack Carson kept Glamorgan firmly tethered at Sophia Gardens against Sussex , while Anuj Dal’s five wickets ensured the bottom club Derbyshire had some skin in the game at New Road, Worcestershire all out for 237 after a stonking opening stand. 4h ago 19.37 BST That’s all from us. Thanks for hanging around on a roasting Sunday, congratulations to centurions all: Lawrence, Westley, Dawson, Bean, Hill, Lees and Robinson and five-wicketers Anuj Dal and Brett Hutton. We’ll be back tomorrow – good night! Bean-machine: a second century of the season for Yorkshires's Finlay Bean Photograph: Allan McKenzie/SWpix.com/Shutterstock 4h ago 19.33 BST Closer of play scores DIVISION ONE Chelmsford : Essex 391-7 v Warwickshire Rose Bowl : Hampshire 284-4 v Middlesex County Ground : Northants 237 v Kent 110-1 Taunton : Somerset 163 v Nottinghamshire 145-4 The Oval : Surrey 70-4 v Lancashire 274 DIVISION TWO Sophia Gardens : Glamorgan 242 v Sussex 65-1 Grace Road : Leicestershire v Durham 422-4 New Road : Worcestershire 237 v Derbyshire 32-2 Headingley : Yorkshire 393-6 v Gloucestershire 5h ago 17.52 BST And here comes the promised rain…. with Yorkshire 388-6. 5h ago 17.39 BST Right, time for me to write up. A final polka round the grounds: Dan Lawrence, 147 not out, has guided Essex to 337-5; Dawson and Gubbins are racing each other to a hundred, Hants 256-4; Compton out cheaply, but Kent 49-1; Somerset fighting back against Notts, but Slater (44 not out) is standing in their way 99-3, 63 behind. And Lancashire are all out for 274. In Division Two: Yorks 361-5 Tattersall picking up where Hill and Bean left off, but the clouds are fast approaching. Worcesterstershire have made a horlicks of their innings, from 105-1 to 237-9. Dal 4-45. Four wickets for McAndrew in Glamorgan’s 242 all out. Billy Root the top-scorer with 66. Jack Carson, on people’s lips as an up and coming spinner, 3-45; McAndrew 4-58. Sussex have already lost Haines for six. And Durham are in usual-bish-bang-baz-ball mode: 346-4. I must go off and write my roundup, but do keep chatting BTL. 6h ago 17.21 BST The new ball has been taken at Headingley. The clouds are coming over. Gloucestershire’s best chance. 6h ago 17.19 BST A third wicket for Jordan Clark has reduced Lancs to 274-9, it is left to Williams and Morley to try and scrape towards 300. 6h ago 17.03 BST A hundred for George Hill! A second century of the day for Yorkshire –maybe the prospect of a final resolution on Tuesday is instinctively inspiring some freedom of shot. Or maybe it is the excellent pitch. Or the average bowling. Or the rapid outfield. Helmet off, he shyly raises his the bat. 177 balls, 13 fours. Yorkshire making hay, 343-4. 6h ago 16.57 BST Gubbins and Dawson are pulling Hampshire away from the danger zone with a partnership of 121 – Hants 215-4 at The Rose Bowl As Jonny Tattersall sends the ball shooting through midwicket, beating George Hill in the milestone race, to reach fifty.Very nicely done. 6h ago 16.45 BST While I was looking the other way, Wes Agar (5-63) and Hamidullah Qadri (3-69) rattle through Northants. The immovable object Rob Keogh, was seventh man out for 97. Kent 16-0 in reply already. Runs, runs, more runs at Headingley. Gohar’s over is plonked: four, four, three, six, two. Hill 93, Tattersall 43. 7h ago 16.34 BST Good to see Phil Salt continuing his snappy form from Southport, 56 not out in Lancashire’s 236-7 – which definitely feels not enough against the Ovalnaughts. 7h ago 16.31 BST If you’d asked me in April to guess the Championship’s leading run-scorer at midsummer, I wouldn’t have plumped for Tom Westley. Out for 114, Essex 260-3. Updated at 16.37 BST 7h ago 16.28 BST Sophie Ecclestone’s 5-63 means England need 268 to beat Australia. Follow it all here with the master himself R Smyth (and worry about whether Ecclestone’s arm will fall off later) Women’s Ashes Test: England v Australia, day four – live Read more 7h ago 16.00 BST Tea-time scores DIVISION ONE Chelmsford : Essex 247-2 v Warwickshire Rose Bowl : Hampshire 183-4 v Middlesex County Ground : Northants 218-9 v Kent Taunton : Somerset 163 v Nottinghamshire 23-1 The Oval : Surrey v Lancashire 214-7 DIVISION TWO Sophia Gardens : Glamorgan 212-7 v Sussex Grace Road : Leicestershire v Durham 246-4 New Road : Worcestershire 189-6 v Derbyshire Headingley : Yorkshire 273-4 v Gloucestershire 7h ago 15.40 BST Hundreds for Dan Lawrence and Tom Westley! Put your feet up boys, and enjoy the show. Essex 230-2. Khushi and Cook must be kicking themselves. The century boys: Lawrence and Westley Photograph: Gavin Ellis/TGS Photo/Shutterstock 8h ago 15.36 BST A tale of two England once-weres: At Trent Bridge, Haseeb Hameed has been out for an 18-ball duck. At Chelmsford, Dom Bess has been bowling. 19 overs, 0-77. 8h ago 15.18 BST A hundred for Alex Lees! His first first-class century for 14 months. And out! A second catch for soon-to-be-Riverside bound Ackermann, a first-wicket for soon-to-be-Riverside-bound Parkinson C. Durham 223-4. 8h ago 15.13 BST And there goes Bean, pulling again, but this time straight into the hands of Charlesworth at backward square leg. off Akther, for 114. He slopes off in obvious disappointment, gloves off, helmet half cock. Smashing innings, Yorks 243-4. 8h ago 15.06 BST A hundred for Finlay Bean! Nicely does it! A snappy pull to the rope brings Bean a second hundred in his nascent first-class career. Happy applause waves around Headingley, Yorkshire on top, Gloucestershire lost for ideas. And a single brings the fourth-wicket partnership up to 150 from 211 balls. 8h ago 14.59 BST Somerset 163 all out Is this going to be one of those years when Somerset flirt with relegation? Of course it is! Five for Brett Hutton. Top scorer TKC. Not the best half a day’s batting. 9h ago 14.37 BST Getting spicy in the Test – where England have managed to drop five catches but still have Australia six down – the lead 206. 9h ago 14.35 BST Essex are still strolling through the foothills, the third wicket partnership 145 and counting. Essex 165-2. Is Dan Lawrence (68 not out) now going to have the summer of his life as he says farewell to Chelmsford? 9h ago 14.27 BST George Hill , generally considered one of the best players of spin on the team, has Yorks racing along, an easy afternoon six off Zahar Gohar into the plastic seats. The partnership between him and Finlay Bean now 98. Yorks 188-3 as a fierce win stamps round the ground. 9h ago 14.21 BST In 31 degree heat, Lancashire are starting to melt. Sean Abbott’s Kookaburra skills(3-42) have been complemented by a wicket each for Sam Curran and Tom Lawes. Lancs 123-5. Salt and Balderson don the hard hats and wearily bend to pick up the rubble. Updated at 14.21 BST 9h ago 14.16 BST Apologies for the lack of updates, a work phone call. Updates to follow. Updated at 14.17 BST 9h ago 13.51 BST A onion bhaji wrap in my brown Headingley sandwich bag, makes for a tasty lunch. Just spoke to Tanni Grey Thompson, Yorkshire’s interim chair, who has been out and about meeting and greeting round the ground. I know she would, wouldn’t she, but she was very positive about the expertise on the Yorkshire committee, and the pathway programme in particular. 10h ago 13.25 BST DIVISION ONE Chelmsford : Essex 119-2 v Warwickshire Rose Bowl : Hampshire 92-3 v Middlesex County Ground : Northants 104-4 v Kent Taunton : Somerset 106-4 v Nottinghamshire The Oval : Surrey v Lancashire 98-3 DIVISION TWO Sophia Gardens : Glamorgan 85-4 v Sussex Grace Road : Leicestershire v Durham 150-1 New Road : Worcestershire 105-2 v Derbyshire Headingley : Yorkshire 139-3 v Gloucestershire 10h ago 13.02 BST A frisky morning at Headingley, Yorks 133-3, Finlay Bean leading the way 65 not out. Lunchtime scores round the grounds to follow. 10h ago 12.53 BST Some succour for Somerset fans: SHOT!! Lovely, lovely stroke from James Rew! LIVE STREAM ➡️ https://t.co/aRtGCP7E47 #SOMvNOTTS #WeAreSomerset pic.twitter.com/5Qepo5pEEN — Somerset Cricket 🏏 (@SomersetCCC) June 25, 2023 10h ago 12.52 BST Hampshire lose a third, and its a big one, their maypole, James Vince. Josh de Caires, Atherton’s boy, the wicket-taker. Hants 81-3. Essex are making hay after being 20-2; now 112-2, a half century to Tom Westley. A fourth for Brett Hutton, who is having a very fruitful morning at Taunton, Somerset 103-4. Four before lunch: Brett Hutton. Photograph: Harry Trump/Getty Images 11h ago 12.37 BST TdL with some Ashes thoughts: Ashes to Ashes, rust to bust: England must find groove to remedy sloppy start | Tim de Lisle Read more And Barney off his long run: Bazball: a cult of bruised masculinity where you win even if you lose | Barney Ronay Read more 11h ago 12.31 BST The Trent Bridge pitch’s friendly nature continues to make wicket-taking a trial in the women’s Test. The fabulous Megan Maurice will keep you updated: Women’s Ashes Test: England v Australia, day four – live Read more 11h ago 12.16 BST In Division Two, Yorkshire are racing along – ah but perhaps not so much now – as Ben Charleswoth sends down a complete pie which Dawid Malan pulls round into Bracey’s gloes. Gone for a boundary-laden 28. Bean at the non-striker’s end tips his head back in exasperation/despair. Yorks 90-3. Roderick and Libby continue to enjoy Derbyshire’s profligacy, Worcs 65-0. Durham too racing along, as is their want, 100-0 o ff 17 overs. Parkinson C, getting to know his soon-to-be-teammates, from the bowling crease. Parkinson M, back with Durham on loan, sits in the opposition dressing room. Alone in Division Two, Glamorgan’s batters are struggling, 49-3 against Sussex.Shipley 2-21. 11h ago 12.05 BST A wicket at The Oval – Bohannon lbw to Sean Abbot for 10. Lancs 35-2. And Hutton has ticked off another of Somerset’s batters George Bartlett for 13. Somerset 56-3. 11h ago 12.01 BST “Just trying to get my head around how the Kookaburra can be ‘more helpful to the bowlers’ despite apparently offering less seam and swing?! taps Brian Withington. “Certainly seems to be capturing some early wickets today though. Apologies if this has already been dissected BTL but haven’t got there yet.” Er, yes you’re quite right. I’m writing drivel and have corrected said entry. Ball is LESS helpful to the bowlers as it doesn’t move as much. That said, no real sign of batting dominance yet except for Bazballing Durham and Worcestershire. Updated at 12.02 BST 11h ago 11.47 BST Dancing round the Division One grounds: Warwickshire’s bowlers enjoying the Kookaburra ball – Alastair Cook and Feroze Khushi both out cheaply, Essex 24-2. Dan Lawrence, moving to Surrey at the end of the summer, nine not out. At The Rose Bowl, TRJ has whittled out Fletcha Middleton for four, Hampshire 30-1. Early wickets for Kent too – Wes Agar and Arshdeep Singh taking one each, Northants 32-2. Two wickets for Brett Hutton at Taunton, where Notts have Somerset 39-2; and Lancs, inserted by Surrey, have lost Wells for three. Keaton Jennings, back from his hamstring injury, has hit three fours in his 16 not out. This too, at Taunton. I hope it brings comfort to Barnaby Webber’s family. Signed shirts from both clubs were presented to Barnaby Webber's family prior to play at Taunton today as an expression of condolence and unity. Our thoughts remain with the victims and all those affected by last week's tragic events in Nottingham. #SOMNOT pic.twitter.com/uJObocGgZF — Nottinghamshire CCC (@TrentBridge) June 25, 2023 12h ago 11.24 BST Hang about Yorkshire, the storm clouds aren’t supposed to be coming till after lunch. Shan Masood lbw Taylor for a three ball duck. 33-2. 12h ago 11.22 BST A wicket at Headingley – Lyth tries to leave alone and is snaffled up at second slip for 14. A short and sweet cameo. 12h ago 11.15 BST An early email, hello Will Unwin! “In a week where it was confirmed Matt Parkinson and Danny Lamb will leave Lancs in the summer, I’m intrigued why the club has become pretty poor at A) helping academy graduates reach their potential And B) retaining them. In recent seasons we’ve seen Hameed and Davies go, and now the latest two. We were pretty close to losing Mahmood this winter, too, so seems a big problem. We do have another hotel on the ground though… Why do you think this is the situation at Lancs? We only ever get very vague reasoning from the club.” I can’t pretend to have any special behind the scenes knowledge. In the case of Danny Lamb I think he wanted first-team cricket. With Parky, like Hameed, there seems to have been something of a breakdown in communication between both parties. Best, in such cases, for a clean break and a fresh start – but it doesn’t reflect too well on the club. 12h ago 10.57 BST Kookaburra ball Yes, this is one of the two rounds this summer which will features the Kookaburra ball – as recommended in the Strauss report. They are said to seam and swing less and generally be less helpful to the bowlers. I’m sure they’re very grateful. Bright new thing: the Kookaburra ball Photograph: Michael Dodge/AAP Updated at 11.58 BST 12h ago 10.52 BST So much to keep an eye on this round. Runaway favourites Surrey take on Lancashire – who announced the departure of Matt Parkinson to Kent at the end of the season. Meanwhile brother Callum is moving to Durham, as part of the bin-fire at Grace Road which also involved Paul Nixon being put on gardening leave and the departures of Colin Ackermann and Chris Wright. Leicestershire chief exec Sean Jarvis, quoted on cricinfo said, that there had been “ a mess behind… every door I opened” since he joined in 2020. “A lot of information has come to my attention over the past two months and as chief executive of this club, I’ll be investigating comments, allegations, all those sorts of things that have gone on. “That’s what we’re trying to sort out. All these different fires that seem to be burning, we’re now starting to eradicate and we’re starting to put the proper infrastructure in place within this club. I know members were very upset and very unhappy with what’s gone on. I get that that is sport, but we are striving to develop this club.” 13h ago 10.35 BST Fixtures DIVISION ONE Chelmsford : Essex v Warwickshire Rose Bowl : Hampshire v Middlesex County Ground : Northants v Kent Taunton : Somerset v Nottinghamshire The Oval : Surrey v Lancashire DIVISION TWO Sophia Gardens : Glamorgan v Sussex Grace Road : Leicestershire v Durham New Road : Worcestersire v Derbyshire Headingley : Yorkshire v Gloucestershire 13h ago 10.35 BST Preamble Good Sunday morning! Midsummer cricket is back – for a week. The clouds have arranged themselves prettily above Headingley this morning in preparation for this afternoon’s predicted cloudburst. And there are storm clouds ahead for English cricket generally with the publication on Tuesday of the long awaited ICEC’s Report examining the state of equity in cricket. Yorkshire have won the toss and will bat. Their team includes Dan Moriarty, signed on a loan deal from Surrey, while Dom Bess plays for Warwickshire on a one-game loan. Round and round and round we go. Updated at 10.43 BST Topics County Championship County cricket live blog Cricket Reuse this content","pubDate":"2023-06-25 18:33:19","image_url":"https://i.guim.co.uk/img/media/76e01f467531a2562d7ce589fac5016eebec11e5/0_200_6000_3600/master/6000.jpg?width=460&quality=85&auto=format&fit=max&s=bdd6cbb036c4abef0a936ec58af96de8","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Indian Team: આવનારા સમયમાં આ 3 ફાસ્ટ બોલર બનશે ભારતના સુપરસ્ટાર, ઈશાંત શર્માએ કરી ભવિષ્યવાણી","link":"https://gujarati.abplive.com/sports/cricket/ishant-sharma-named-umran-malik-arshdeep-singh-and-mukesh-kumar-3-fast-bowlers-that-can-be-indians-future-845555","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"Ishant Sharma On Indian Future Bowlers: ભારતીય ટીમનો સ્ટાર ફાસ્ટ બોલર ઈશાંત શર્મા છેલ્લા લગભગ 2 વર્ષથી ટીમની બહાર ચાલી રહ્યો છે. ઇશાંત આ વર્ષે રમાયેલી IPL 16માં રમતા જોવા મળ્યો હતો, જેમાં તેણે શાનદાર પ્રદર્શન કર્યું હતું. બીજી તરફ ટીમ ઈન્ડિયામાં ફાસ્ટ બોલરોની વાત કરીએ તો જુલાઈમાં વેસ્ટ ઈન્ડિઝ પ્રવાસ માટે ઘણા યુવા બોલરોને તક આપવામાં આવી છે. આ દરમિયાન ઈશાંત શર્માએ તે 3 ભારતીય ઝડપી બોલરો વિશે જણાવ્યું, જેમને યોગ્ય માર્ગદર્શન આપવામાં આવે તો ભવિષ્યના સુપરસ્ટાર બની શકે છે. ઇશાંત શર્માએ આ વિશે યુટ્યુબ ચેનલ 'બીયરબાઈસેપ્સ' પર વાત કરી હતી. ભારતીય ફાસ્ટ બોલરે કહ્યું,જો તમે તેની સાથે યોગ્ય રીતે કામ કરો છો તો ઉમરાન મલિકમાં દેશ માટે લાંબા સમય સુધી સારું પ્રદર્શન કરવાની ક્ષમતા છે. આમાં બીજો ફાસ્ટ બોલર અર્શદીપ સિંહ  છે. તે જ સમયે, ઇશાંત શર્માએ ત્રીજા બોલર તરીકે દિલ્હી કેપિટલ્સના મુકેશ કુમારની પસંદગી કરી છે. ઈશાંત શર્મા પણ આઈપીએલ 2023માં દિલ્હી તરફથી રમ્યો હતો. યોગ્ય માર્ગદર્શનની જરૂર છેઃ ઈશાંત શર્મા મુકેશ વિશે વાત કરતા ઈશાંત શર્માએ કહ્યું, ઘણા લોકો તેની કહાની નથી જાણતા, પરંતુ મેં તેના જેવો સરળ વ્યક્તિ ક્યારેય જોયો નથી. જો તમે તેને કોઈ ખાસ બોલ નાખવા માટે કહો છો, તો તે માત્ર તે જ બોલ ફેંકે છે. તેને મેદાન પર યોગ્ય માર્ગદર્શનની જરૂર છે, જેથી તે જાણી શકે કે દબાણની સ્થિતિમાં કયો બોલ ફેંકવો. ઇશાંત શર્માએ જણાવ્યું કે ગત IPLમાં તે કેમ મોંઘો સાબિત થયો હતો. મુકેશ કુમારે IPL 2023ની 10 મેચોમાં માત્ર 7 વિકેટ લીધી, 10થી વધુની ઈકોનોમી સાથે રન આપ્યા હતા. આ અંગે ઈશાંતે કહ્યું, આઈપીએલમાં તેની સામે રન એટલા માટે બનાવ્યા કારણ કે તેણે મુશ્કેલ ઓવરો ફેંકી હતી. તેણે કઈ પરિસ્થિતિમાં બોલિંગ કરી અથવા કયા બેટ્સમેનની સામે બોલિંગ કરી તે કોઈ જોતું નથી. બધાએ જોયું કે તેણે 4 ઓવરમાં 50 રન આપ્યા. રોહિત શર્મા હટાવાશે ને આ અનુભવીને સોંપાશે ટીમની કમાન ? BCCIએ આપ્યા સંકેત  ભારતીય ટીમની રમત અને કેપ્ટનશીપની અત્યારે તમામ ફેન્સ ટીકા કરી રહ્યું છે. સતત બીજીવાર ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપની ફાઇનલમાં હાર મળ્યા બાદ ખરાબ રણનીતિ અને કેપ્ટનને હટાવવાની ચર્ચાએ જોર પકડ્યુ છે. ગયા વર્ષે વિરાટ કોહલી અને આ વખતે રોહિત શર્માની કેપ્ટન્સીમાં ટીમ ઇન્ડિયા ટેસ્ટમાં ચેમ્પીયન બનતા રહી ગઇ છે.હાર બાદથી જ ટેસ્ટ કેપ્ટનને લઈને ચર્ચા ચાલી રહી છે. હવે આ બધાની વચ્ચે સમાચાર સામે આવ્યા છે કે રોહિત શર્મા માટે વેસ્ટ ઈન્ડિઝનો પ્રવાસ મહત્વપૂર્ણ સાબિત થઈ શકે છે. પ્રવાસ માટે ટીમની પસંદગી થઈ ગઈ છે અને તેમાં આગામી કેપ્ટનના સંકેતો છુપાયેલા છે.  બીસીસીઆઈએ શુક્રવારે વેસ્ટ ઈન્ડિઝ સામેની સીરીઝ માટે ટીમની જાહેરાત કરી હતી. 2 મેચોની ટેસ્ટ સીરીઝ માટે પસંદ કરાયેલી ટીમને લઈને કેટલાક કડક નિર્ણયો લેવામાં આવ્યા છે. આમાં એવો નિર્ણય પણ આવ્યો કે જેના વિશે કોઈએ વિચાર્યું પણ ન હતું. ચેતેશ્વર પુજારાને ટીમની બહાર રાખવામાં આવ્યો હતો અને આનીથી એવો સંકેત પણ મળ્યો છે કે, રોહિત શર્મા હવે આગામી કેપ્ટન તરીકે નહીં રહે.   સિલેક્ટરોએ ઇન્ડિયન પ્રીમિયર લીગ પછી ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપ ફાઇનલ માટે ટીમમાં પાછા ફરવા માટે આઉટ ઓફ ફેવર અજિંક્ય રહાણેને તક આપી હતી. માત્ર 1 મેચ બાદ તેને ફરીથી વાઇસ કેપ્ટન બનાવવામાં આવ્યો છે.. બીસીસીઆઈ આ ખેલાડી પર આટલો ભરોસો દર્શાવે છે તે માત્ર એક જ દિશામાં ઈશારો કરી રહ્યું છે કે, આગામી સમયમાં રોહિત શર્માને ટેસ્ટ કેપ્ટન પદેથી હટાવીને અનુભવી સ્ટાર બેટ્સમેન અજિંક્યે રહાણેને કેપ્ટન બનાવવામાં આવી શકે છે. BCCI હવે રોહિત શર્માને ત્રણેય ફોર્મેટમાં કેપ્ટનશિપના બોજમાંથી મુક્ત કરવા માંગે છે. હાર્દિક પંડ્યા પહેલાથી જ ટી-20માં મોટાભાગની મેચોની કેપ્ટનશીપ કરી રહ્યો છે. હવે તેને ટેસ્ટ મેચોમાં પણ સુકાનીપદથી રાહત મળી શકે છે. વેસ્ટ ઈન્ડિઝ પ્રવાસ બાદ અજિંક્ય રહાણેને આ જવાબદારી આપવામાં આવી શકે છે.  ICC ODI વર્લ્ડકપ પર વધુ ધ્યાન આપવા માટે, BCCI નક્કી કરી શકે છે કે રોહિત શર્મા બંને ફોર્મેટની કેપ્ટનશિપમાંથી મુક્ત રહેશે. હાર્દિક પંડ્યા T20ની કેપ્ટનશીપ સંભાળી રહ્યો છે, અજિંક્ય રહાણેને ટેસ્ટ કેપ્ટન બનાવવો જોઈએ. અચાનક ટીમમાં વાપસીની તક આપવી અને પછી તેને ઉપ-કેપ્ટન બનાવવો એ કોઈ સંયોગ નથી. Join Our Official Telegram Channel: https://t.me/abpasmitaofficial  ","content":"Ishant Sharma On Indian Future Bowlers: ભારતીય ટીમનો સ્ટાર ફાસ્ટ બોલર ઈશાંત શર્મા છેલ્લા લગભગ 2 વર્ષથી ટીમની બહાર ચાલી રહ્યો છે. ઇશાંત આ વર્ષે રમાયેલી IPL 16માં રમતા જોવા મળ્યો હતો, જેમાં તેણે શાનદાર પ્રદર્શન કર્યું હતું. બીજી તરફ ટીમ ઈન્ડિયામાં ફાસ્ટ બોલરોની વાત કરીએ તો જુલાઈમાં વેસ્ટ ઈન્ડિઝ પ્રવાસ માટે ઘણા યુવા બોલરોને તક આપવામાં આવી છે. આ દરમિયાન ઈશાંત શર્માએ તે 3 ભારતીય ઝડપી બોલરો વિશે જણાવ્યું, જેમને યોગ્ય માર્ગદર્શન આપવામાં આવે તો ભવિષ્યના સુપરસ્ટાર બની શકે છે. ઇશાંત શર્માએ આ વિશે યુટ્યુબ ચેનલ 'બીયરબાઈસેપ્સ' પર વાત કરી હતી. ભારતીય ફાસ્ટ બોલરે કહ્યું,જો તમે તેની સાથે યોગ્ય રીતે કામ કરો છો તો ઉમરાન મલિકમાં દેશ માટે લાંબા સમય સુધી સારું પ્રદર્શન કરવાની ક્ષમતા છે. આમાં બીજો ફાસ્ટ બોલર અર્શદીપ સિંહ છે. તે જ સમયે, ઇશાંત શર્માએ ત્રીજા બોલર તરીકે દિલ્હી કેપિટલ્સના મુકેશ કુમારની પસંદગી કરી છે. ઈશાંત શર્મા પણ આઈપીએલ 2023માં દિલ્હી તરફથી રમ્યો હતો. યોગ્ય માર્ગદર્શનની જરૂર છેઃ ઈશાંત શર્મા મુકેશ વિશે વાત કરતા ઈશાંત શર્માએ કહ્યું, ઘણા લોકો તેની કહાની નથી જાણતા, પરંતુ મેં તેના જેવો સરળ વ્યક્તિ ક્યારેય જોયો નથી. જો તમે તેને કોઈ ખાસ બોલ નાખવા માટે કહો છો, તો તે માત્ર તે જ બોલ ફેંકે છે. તેને મેદાન પર યોગ્ય માર્ગદર્શનની જરૂર છે, જેથી તે જાણી શકે કે દબાણની સ્થિતિમાં કયો બોલ ફેંકવો. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ઇશાંત શર્માએ જણાવ્યું કે ગત IPLમાં તે કેમ મોંઘો સાબિત થયો હતો. મુકેશ કુમારે IPL 2023ની 10 મેચોમાં માત્ર 7 વિકેટ લીધી, 10થી વધુની ઈકોનોમી સાથે રન આપ્યા હતા. આ અંગે ઈશાંતે કહ્યું, આઈપીએલ માં તેની સામે રન એટલા માટે બનાવ્યા કારણ કે તેણે મુશ્કેલ ઓવરો ફેંકી હતી. તેણે કઈ પરિસ્થિતિમાં બોલિંગ કરી અથવા કયા બેટ્સમેનની સામે બોલિંગ કરી તે કોઈ જોતું નથી. બધાએ જોયું કે તેણે 4 ઓવરમાં 50 રન આપ્યા. રોહિત શર્મા હટાવાશે ને આ અનુભવીને સોંપાશે ટીમની કમાન ? BCCIએ આપ્યા સંકેત ભારતીય ટીમની રમત અને કેપ્ટનશીપની અત્યારે તમામ ફેન્સ ટીકા કરી રહ્યું છે. સતત બીજીવાર ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપની ફાઇનલમાં હાર મળ્યા બાદ ખરાબ રણનીતિ અને કેપ્ટનને હટાવવાની ચર્ચાએ જોર પકડ્યુ છે. ગયા વર્ષે વિરાટ કોહલી અને આ વખતે રોહિત શર્માની કેપ્ટન્સીમાં ટીમ ઇન્ડિયા ટેસ્ટમાં ચેમ્પીયન બનતા રહી ગઇ છે.હાર બાદથી જ ટેસ્ટ કેપ્ટનને લઈને ચર્ચા ચાલી રહી છે. હવે આ બધાની વચ્ચે સમાચાર સામે આવ્યા છે કે રોહિત શર્મા માટે વેસ્ટ ઈન્ડિઝનો પ્રવાસ મહત્વપૂર્ણ સાબિત થઈ શકે છે. પ્રવાસ માટે ટીમની પસંદગી થઈ ગઈ છે અને તેમાં આગામી કેપ્ટનના સંકેતો છુપાયેલા છે. બીસીસીઆઈએ શુક્રવારે વેસ્ટ ઈન્ડિઝ સામેની સીરીઝ માટે ટીમની જાહેરાત કરી હતી. 2 મેચોની ટેસ્ટ સીરીઝ માટે પસંદ કરાયેલી ટીમને લઈને કેટલાક કડક નિર્ણયો લેવામાં આવ્યા છે. આમાં એવો નિર્ણય પણ આવ્યો કે જેના વિશે કોઈએ વિચાર્યું પણ ન હતું. ચેતેશ્વર પુજારાને ટીમની બહાર રાખવામાં આવ્યો હતો અને આનીથી એવો સંકેત પણ મળ્યો છે કે, રોહિત શર્મા હવે આગામી કેપ્ટન તરીકે નહીં રહે. સિલેક્ટરોએ ઇન્ડિયન પ્રીમિયર લીગ પછી ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપ ફાઇનલ માટે ટીમમાં પાછા ફરવા માટે આઉટ ઓફ ફેવર અજિંક્ય રહાણેને તક આપી હતી. માત્ર 1 મેચ બાદ તેને ફરીથી વાઇસ કેપ્ટન બનાવવામાં આવ્યો છે.. બીસીસીઆઈ આ ખેલાડી પર આટલો ભરોસો દર્શાવે છે તે માત્ર એક જ દિશામાં ઈશારો કરી રહ્યું છે કે, આગામી સમયમાં રોહિત શર્માને ટેસ્ટ કેપ્ટન પદેથી હટાવીને અનુભવી સ્ટાર બેટ્સમેન અજિંક્યે રહાણેને કેપ્ટન બનાવવામાં આવી શકે છે. BCCI હવે રોહિત શર્માને ત્રણેય ફોર્મેટમાં કેપ્ટનશિપના બોજમાંથી મુક્ત કરવા માંગે છે. હાર્દિક પંડ્યા પહેલાથી જ ટી-20માં મોટાભાગની મેચોની કેપ્ટનશીપ કરી રહ્યો છે. હવે તેને ટેસ્ટ મેચોમાં પણ સુકાનીપદથી રાહત મળી શકે છે. વેસ્ટ ઈન્ડિઝ પ્રવાસ બાદ અજિંક્ય રહાણેને આ જવાબદારી આપવામાં આવી શકે છે. ICC ODI વર્લ્ડકપ પર વધુ ધ્યાન આપવા માટે, BCCI નક્કી કરી શકે છે કે રોહિત શર્મા બંને ફોર્મેટની કેપ્ટનશિપમાંથી મુક્ત રહેશે. હાર્દિક પંડ્યા T20ની કેપ્ટનશીપ સંભાળી રહ્યો છે, અજિંક્ય રહાણેને ટેસ્ટ કેપ્ટન બનાવવો જોઈએ. અચાનક ટીમમાં વાપસીની તક આપવી અને પછી તેને ઉપ-કેપ્ટન બનાવવો એ કોઈ સંયોગ નથી. Join Our Official Telegram Channel: https://t.me/abpasmitaofficial","pubDate":"2023-06-25 18:21:30","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/04/29/d388e262ecfa463710a22b8f86ffce381682735034756567_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Gujarati"},{"title":"1983 World Cup Win: ... आणि तो त्यादिवशी खऱ्या अर्थाने भारतीय क्रिकेटचा 'देव' ठरला! भारताला विश्वचषक मिळवून देण्यात कपिल देव यांचा मोलाचा वाटा","link":"https://marathi.abplive.com/sports/cricket/40-years-1983-world-cup-win-india-created-history-on-this-day-june-25-1983-beating-west-indies-at-lords-detail-marathi-news-1187235","keywords":["क्रिकेट"],"creator":["एबीपी माझा वेब टीम"],"video_url":null,"description":"1983 World Cup Win:  भारतीय क्रिकेटच्या इतिहासामध्ये सुवर्ण अक्षरांनी लिहून ठेवावा असा क्षण म्हणजे 1983 साली भारताने जिंकलेला विश्वचषक (World Cup ) संपूर्ण भारत (India) आजही ज्या गोष्टींचा अभिमान बाळगतो त्यामधलीच ही एक गोष्ट.  तेव्हा संपूर्ण जगालाच काय भारताला देखील ही आशा नव्हती की त्या विश्वचषकावर भारताचं नाव कोरलं जाईल. पण या सगळ्यामध्ये भारतासाठी खऱ्या अर्थाने तो देव ठरला होता. तो म्हणजे भारतीय संघाचा माजी कर्णधार कपिल देव.  खरंतर कपिल देव यांच्या खेळीचा भारताच्या या यशामध्ये अगदी मोलाचा वाटा आहे असं म्हटलं तरी वावगं ठरणार नाही.  कपिल देव यांनी क्रिकेटच्या इतिहासात विक्रम रचला होता. समोर झिम्बाबेसारखा संघ. खरंतर त्या काळी  झिम्बाबे संघांचं देखील क्रिकेटमध्ये चांगलचं वजन होतं. पण त्यादिवशी कपिल देव यांनी झिम्बाबेच्या खेळाडूंना धू-धू धुतलं आणि भारतीय किक्रेट संघांचं नाव जगाच्या यादीत कोरलं गेलं. भारतीय क्रिकेट संघाचे कर्णधार कपिल देव यांनी 175 धावांचा ऐतिहासिक खेळी केली होती आणि त्यानंतर तो क्षण भारतीय क्रिकेटच्या इतिहासात सुवर्ण अक्षरांनी कोरला गेला.  या दिवशी कपिल देव हे एकदिवसीय सामन्यामध्ये 100 धावांची खेळी खेळणारे पहिले भारतीय क्रिकेटपटू ठरले होते.  झिम्बाबेचा सामना जिंकणं भारतासाठी महत्त्वाचं होतं  खरंतर ती भारतासाठी करो या मरो ची खेळी होती. अगदी 17 धावा करुन भारताचा निम्मा संघ माघारी फिरला होता. त्यामुळे भारतीयाचं विश्वचषक जिंकण्याचं स्वप्न आताही अपूर्णच राहणार असाच सगळ्यांचा समज झाला होता. पण त्यावेळी कर्णधार कपिल देव यांनी अगदी संयमाने खेळी केली आणि त्यांना मोलाची साथ मिळाली ते रॉजर बिन्नी याची. या जोडीने 48 चेंडूमध्ये 22 धावांची भागिदारी केली. त्यावेळी कपील देव यांनी 138 धावांमध्ये 175 धावा केल्या. भारताने झिम्बाबे समोर 267 धावांचं आव्हान ठेवलं आणि 31 धावांनी झिम्बाबेवर विजय मिळवला. त्यामुळे विश्वचषकाच्या दिशेने भारताचा महत्त्वपूर्ण प्रवास सुरु झाला होता.  आणि भारतासमोर इंग्लंडचं आव्हान  भारतानं झिम्बाबेवर मात करून उपांत्य फेरीत प्रवेश मिळवला होता. इंग्लंडसोबत 22 जून रोजी भारतीय संघ उपात्यं फेरीचा सामना खेळत होता. इंग्लंडने नाणेफेक जिंकली आणि फलंदाजी करण्याचा निर्णय घेतला होता. तेव्हा इंग्लंडने चक्क 60 षटकांमध्ये 213 धावा केल्या होत्या. त्यादिवशी देखील कपिल देव यांच्या कामगिरीमुळे भारतीयांच्या हृदयात कोरणार तो दिवस ठरला. कपिल देव यांनी 3 विकेट्स घेत संघाला विजयाच्या दिशेने नेलं. त्यांना संघातील इतर खेळाडूंची देखील तितकीच मोलाची साथ मिळाली. त्या खेळात भारताने अवघ्या काही षटकात विजय मिळवला होता. भारताच्या फलदांनी जोरदार कामगिरी करत अंतिम फेरीत दमदार प्रवेश मिळवला होता.  एक झेल आणि भारताचा ऐतिहासिक क्षण भारतासमोर विडींज आव्हान. खरंतर भारत अंतिम फेरीत पोहचला हिच भारतीयांसाठी खूप महत्त्वाची गोष्ट होती. लॉर्ड्सच्या मैदावर भारताच्या सुपुत्रांनी सुवर्णक्षण घडवला होता. विश्वचषकात तोपर्यंत फक्त वेस्ट इंडिजनेच दोनदा विश्वकप जिंकून क्रिकेटच्या विश्वात आपलं स्थान मजबूत केलं होतं. परंतु त्यानंतर भारताने त्यांचं सलग तिसऱ्यांदा विश्वविजेता होण्याचं स्वप्न मात्र अपूर्णच ठेवलं.  वेस्ट इंडिजच्या  संघाला अवघ्या 183 धावांचं लक्ष दिलं होतं आणि 140 धावांमध्ये  भारताच्या शिलेदारांनी तो डाव गुंडाळला होता. जगातील फलंदाजांच्या यादीमध्ये मानाचं स्थान असलेले विवियन रिचर्ड्स मैदानावर होते. तुफान फटकेबाजी लॉर्ड्सच्या मैदानावर सुरु होती आणि त्या एका झेलाने संपूर्ण डावच पालटला. विवियन रिचर्ड्स यांनी एक जोरदार शॉट मारला आणि कपील देव यांनी दूरचं अंतर गाठत चेंडू झेलला.  त्या दिवसाचं भारतीय क्रिकेटविश्वातच नाही तर प्रत्येक भारतीयाच्या मनात मानाचं आणि आदराचं स्थान आहे. आज त्या ऐतिहासिक दिवसाला 40 वर्ष पूर्ण होत आहेत. पण आजही प्रत्येक भारतीयांच्या मनात तो क्षण जशाच्या तसा आहे.   महत्त्वाच्या इतर बातम्या : 1983 World Cup Win : भारताच्या ऐतिहासिक कामगिरीला 40 वर्ष पूर्ण! आजच्या दिवशी विश्वचषक उंचावून रचला होता इतिहास","content":"1983 World Cup Win: भारतीय क्रिकेटच्या इतिहासामध्ये सुवर्ण अक्षरांनी लिहून ठेवावा असा क्षण म्हणजे 1983 साली भारताने जिंकलेला विश्वचषक (World Cup ) संपूर्ण भारत (India) आजही ज्या गोष्टींचा अभिमान बाळगतो त्यामधलीच ही एक गोष्ट. तेव्हा संपूर्ण जगालाच काय भारताला देखील ही आशा नव्हती की त्या विश्वचषकावर भारताचं नाव कोरलं जाईल. पण या सगळ्यामध्ये भारतासाठी खऱ्या अर्थाने तो देव ठरला होता. तो म्हणजे भारतीय संघाचा माजी कर्णधार कपिल देव. खरंतर कपिल देव यांच्या खेळीचा भारताच्या या यशामध्ये अगदी मोलाचा वाटा आहे असं म्हटलं तरी वावगं ठरणार नाही. कपिल देव यांनी क्रिकेटच्या इतिहासात विक्रम रचला होता. समोर झिम्बाबेसारखा संघ. खरंतर त्या काळी झिम्बाबे संघांचं देखील क्रिकेटमध्ये चांगलचं वजन होतं. पण त्यादिवशी कपिल देव यांनी झिम्बाबेच्या खेळाडूंना धू-धू धुतलं आणि भारतीय किक्रेट संघांचं नाव जगाच्या यादीत कोरलं गेलं. भारतीय क्रिकेट संघाचे कर्णधार कपिल देव यांनी 175 धावांचा ऐतिहासिक खेळी केली होती आणि त्यानंतर तो क्षण भारतीय क्रिकेटच्या इतिहासात सुवर्ण अक्षरांनी कोरला गेला. या दिवशी कपिल देव हे एकदिवसीय सामन्यामध्ये 100 धावांची खेळी खेळणारे पहिले भारतीय क्रिकेटपटू ठरले होते. झिम्बाबेचा सामना जिंकणं भारतासाठी महत्त्वाचं होतं खरंतर ती भारतासाठी करो या मरो ची खेळी होती. अगदी 17 धावा करुन भारताचा निम्मा संघ माघारी फिरला होता. त्यामुळे भारतीयाचं विश्वचषक जिंकण्याचं स्वप्न आताही अपूर्णच राहणार असाच सगळ्यांचा समज झाला होता. पण त्यावेळी कर्णधार कपिल देव यांनी अगदी संयमाने खेळी केली आणि त्यांना मोलाची साथ मिळाली ते रॉजर बिन्नी याची. या जोडीने 48 चेंडूमध्ये 22 धावांची भागिदारी केली. त्यावेळी कपील देव यांनी 138 धावांमध्ये 175 धावा केल्या. भारताने झिम्बाबे समोर 267 धावांचं आव्हान ठेवलं आणि 31 धावांनी झिम्बाबेवर विजय मिळवला. त्यामुळे विश्वचषकाच्या दिशेने भारताचा महत्त्वपूर्ण प्रवास सुरु झाला होता. आणि भारतासमोर इंग्लंडचं आव्हान भारतानं झिम्बाबेवर मात करून उपांत्य फेरीत प्रवेश मिळवला होता. इंग्लंडसोबत 22 जून रोजी भारतीय संघ उपात्यं फेरीचा सामना खेळत होता. इंग्लंडने नाणेफेक जिंकली आणि फलंदाजी करण्याचा निर्णय घेतला होता. तेव्हा इंग्लंडने चक्क 60 षटकांमध्ये 213 धावा केल्या होत्या. त्यादिवशी देखील कपिल देव यांच्या कामगिरीमुळे भारतीयांच्या हृदयात कोरणार तो दिवस ठरला. कपिल देव यांनी 3 विकेट्स घेत संघाला विजयाच्या दिशेने नेलं. त्यांना संघातील इतर खेळाडूंची देखील तितकीच मोलाची साथ मिळाली. त्या खेळात भारताने अवघ्या काही षटकात विजय मिळवला होता. भारताच्या फलदांनी जोरदार कामगिरी करत अंतिम फेरीत दमदार प्रवेश मिळवला होता. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); एक झेल आणि भारताचा ऐतिहासिक क्षण भारतासमोर विडींज आव्हान. खरंतर भारत अंतिम फेरीत पोहचला हिच भारतीयांसाठी खूप महत्त्वाची गोष्ट होती. लॉर्ड्सच्या मैदावर भारताच्या सुपुत्रांनी सुवर्णक्षण घडवला होता. विश्वचषकात तोपर्यंत फक्त वेस्ट इंडिजनेच दोनदा विश्वकप जिंकून क्रिकेटच्या विश्वात आपलं स्थान मजबूत केलं होतं. परंतु त्यानंतर भारताने त्यांचं सलग तिसऱ्यांदा विश्वविजेता होण्याचं स्वप्न मात्र अपूर्णच ठेवलं. वेस्ट इंडिजच्या संघाला अवघ्या 183 धावांचं लक्ष दिलं होतं आणि 140 धावांमध्ये भारताच्या शिलेदारांनी तो डाव गुंडाळला होता. जगातील फलंदाजांच्या यादीमध्ये मानाचं स्थान असलेले विवियन रिचर्ड्स मैदानावर होते. तुफान फटकेबाजी लॉर्ड्सच्या मैदानावर सुरु होती आणि त्या एका झेलाने संपूर्ण डावच पालटला. विवियन रिचर्ड्स यांनी एक जोरदार शॉट मारला आणि कपील देव यांनी दूरचं अंतर गाठत चेंडू झेलला. त्या दिवसाचं भारतीय क्रिकेटविश्वातच नाही तर प्रत्येक भारतीयाच्या मनात मानाचं आणि आदराचं स्थान आहे. आज त्या ऐतिहासिक दिवसाला 40 वर्ष पूर्ण होत आहेत. पण आजही प्रत्येक भारतीयांच्या मनात तो क्षण जशाच्या तसा आहे. महत्त्वाच्या इतर बातम्या : 1983 World Cup Win : भारताच्या ऐतिहासिक कामगिरीला 40 वर्ष पूर्ण! आजच्या दिवशी विश्वचषक उंचावून रचला होता इतिहास","pubDate":"2023-06-25 18:19:34","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/f7597f17f5c0abe6288819f3839376231687671124260689_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"ECB blasted over Essex racism probe following barrister's independent inquiry","link":"https://www.dailymail.co.uk/sport/cricket/article-12232489/ECB-blasted-Essex-racism-probe-following-barristers-independent-inquiry.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY MATT HUGHES: Mail Sport's revelations will lead to further questions about why the Newton report has not been published 18 months after it was commissioned.","content":"EXCLUSIVE: The ECB are blasted over Essex racism probe as barrister's inquiry finds officials failed to interview ex-chairman John Faragher before he was charged with using racist language The ECB have been strongly criticsed by a review into the racism inquiry at Essex Former Essex chairman John Faragher left the club back in November 2021 The r eport alleges the ECB failed to interview him before racist language charge By Matt Hughes For The Daily Mail Published: 22:30 BST, 25 June 2023 | Updated: 01:19 BST, 26 June 2023 e-mail View comments The ECB have been strongly criticised by leading barrister Katharine Newton KC in her independent inquiry into alleged racism at Essex. Mail Sport has seen a copy of Newton’s interim report, commissioned by Essex in November 2021 and completed by the following March, but which has yet to be published 15 months later. In bombshell revelations that will embarrass the ECB ahead of Monday's publication of a separate independent report into discrimination in cricket and Wednesday’s second Ashes Test at Lord’s, Mail Sport can disclose that Newton’s inquiry: Criticises ECB investigators for failing to interview former Essex chairman John Faragher before charging him with using racist language. Concludes the ECB broke its own regulations by pressuring Essex to remove Faragher in November 2021, which included a threat to stop hosting women’s internationals at Chelmsford. A leading barrister has criticised the ECB for failing to interview former Essex chairman John Faragher (left) before charging him with racist language Rejects the ECB’s formal denial of this governance breach, first reported by Mail Sport in April 2022, raising the possibility of an attempted cover-up Highlights the ECB’s failure to investigate Faragher three years earlier, when a complaint that he had made a racist remark was made in person to then ECB chairman Colin Graves. Mail Sport’s revelations will lead to further questions about why the Newton report has not been published 18 months after it was commissioned. Newton’s criticisms relate to a previous regime at Lord’s before the appointments of Richard Thompson and Richard Gould as chairman and chief executive last year. The ECB declined to comment. Newton’s first report focuses on the allegation that then Essex chairman Faragher used the phrase ‘n***** in the woodpile’ at a Board meeting in November 2017, which he has always denied. She also went on to produce a second report last year into allegations of racism made against former Essex players and coaches, which has also been completed but has yet to be published. Following a four-month investigation Newton concluded ‘on the balance of probabilities’ that Faragher did use the offensive remark. After their independent inquiry found against Faragher Essex pleaded guilty to two ECB charges of bringing the game into disrepute and were fined £50,000. Newton's independent inquiry also claimed the ECB broke their own regulations by pressuring Essex to remove Faragher in November 2021 But in her report Newton is scathing about the ECB’s investigation, expressing astonishment that Faragher was never interviewed by the ECB, who she claims only spoke to those who supported the allegations. Newton’s criticisms echo those made by the seven Yorkshire players charged by the ECB with making racist comments to Azeem Rafiq last year, many of whom also complained about not being interviewed during the investigation. ‘It is apparent the ECB has adopted a very different investigatory process to mine,’ Newton writes. ‘First, the ECB has not interviewed John Faragher at any point, even though he is the person accused of making the remark. It is unclear to me why the ECB has adopted this approach in circumstances where there is a dispute of evidence as to whether or not the comment was indeed made. ‘Second, the ECB has only interviewed some, but not all, attendees at the relevant meetings. In particular, in so far as ‘The Comment’ part of the charge is concerned, the ECB appears to have focussed only on interviewing those whose evidence is supportive of the charge.’ Newton also endorses revelations in Mail Sport 14 months ago that the ECB broke their own rules by instructing Essex to sack Faragher in November 2021, before he had even been charged and just two days after he had given a week to respond to queries from the ECB’s then head of investigations James Pyemont. The damning revelations come days before the second Ashes Test gets underway at Lord's The ECB strongly denied Mail Sport’s reporting then but Newton’s conclusion is different. ‘In November 2021, post the revelations about what had occurred at Yorkshire, JF was informed by the ECB that the allegation concerning the “woodpile” comment had been made against him and he needed to respond to the allegation,’ she writes. ‘In the original letter from the ECB, JF was given a period of time to respond. However, on the morning of November 11, 2021, JF received a call from the acting chairman of the ECB, Barry O’Brien, to say that he was going to be dismissed that night. The ECB, via (Essex chief executive) John Stephenson, also threatened the club with the removal of its women’s internationals and other sanctions if JF was not removed as chairman. This was pressure the club felt unable to resist.’ Newton also confirms other reports that the ECB failed to deal with the matter when a complaint was raised over three-and-a-half years earlier. Given Essex were charged and fined by the ECB for failing to investigate the incident properly Newton’s confirmation of the Graves meeting raises the question of whether the governing body’s disciplinary arm should take action against themselves. ‘In March 2018 a member of the (Essex) Board contacted the ECB about JF and met with Colin Graves, then chairman,’ Newton writes. ‘This individual told me that he discussed the woodpile comment, and CG told the individual that “this was not their jurisdiction. This was not something that they could get involved with and it was something the club had to deal with themselves”.’ Share or comment on this article: ECB blasted over Essex racism probe following barrister's independent inquiry e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-25 21:58:46","image_url":"https://i.dailymail.co.uk/1s/2023/06/25/22/72519275-0-image-a-49_1687728437223.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australian cricketers","link":"https://www.dailymail.co.uk/sport/cricket/article-12232295/JASON-GILLESPIE-Playing-Lords-brings-sense-tradition-history-Australian-cricketers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: As I found in 2001, it is a quirky place but it has that richness that really gets you going. It's a wonderful place to play cricket and it was a thrill to get my name on the honours board.","content":"JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australia's cricketers... but they must be wary of the famous slope England and Australia face off in the second Ashes Test at Lord's on Wednesday For Aussie cricketers, playing at the famous ground is a truly unique experience It is a special place to play at but there are lots of things you need to adapt to By Jason Gillespie For The Daily Mail Published: 17:30 EDT, 25 June 2023 | Updated: 17:52 EDT, 25 June 2023 e-mail View comments For Australian cricketers, playing at Lord’s brings a sense of tradition and history and provides a totally different experience to other grounds. From coming through the Long Room, walking down through the members out on to the ground, or sitting in the changing rooms, looking at the honours boards and all the wonderful players from around the world that have played Test matches and been successful, to the paintings on the walls, and even the famous lunches — all these things are special. As I found in 2001, it is a quirky place but it has that richness that really gets you going. It’s a wonderful place to play cricket and it was a thrill to get my name on the board with a five-for in the second innings of my Lord’s Test debut. Australians have tended to soak up that opportunity to play there rather than be intimidated by it, and I think that’s sometimes because players who have been picked on tours think they may never get another opportunity to play at this iconic ground, so they really want to embrace it. Even the quirkiness of the scene can be inspiring — people wearing ties and jackets in the stands, sat on little seat cushions with scorebooks and a Thermos of coffee. England face Australia at Lord's but the Aussies will have to be wary of the famous slope The Lord's slope is iconic in cricket and it often take a little bit of time to get used to it For Australian players like Scott Boland (left) - who have never played a Test at Lord's - it is a truly unique experience and there a lot of factors you need to adapt to Lord’s also has the famous slope for bowlers to contend with, and that takes a little bit to get used to it. You just need to adjust your line ever so slightly. If you’re aiming to hit off stump, you’re probably starting the ball just a fraction outside off stump from the pavilion whereas from the nursery end, if you want to bowl that off stump, fourth stump line, you’re looking at a middle, middle-and-off line. But all cricketers need to adjust to the conditions they are presented with and Lord’s is no different. So the likes of Scott Boland and Cameron Green will need to get out and familiarise themselves with the surroundings. Australia head into the second Test in great spirits after a rare tight win over England. Until Birmingham, any Ashes Test since 1924-25 with a result margin of less than 20 runs or fewer than two wickets had gone against them, so it’s a great sign that this 2023 team has overturned that statistic. The opening game just showed there is more than one way to win in Test cricket. England’s approach of scoring consistently quicker than Australia across both innings was valid, but we saw two captains in Pat Cummins and Ben Stokes using different field settings and employing their bowlers in different ways. There were question marks on day one about the defensive field placings Cummins had. But in their strategy meetings, Australia would have conceded that England play a certain attacking way, so they may as well protect an extra boundary. I feel that as Lord’s offers a little bit more assistance for the ball early in the game, we will see slightly more attacking fields and I don’t expect to see a sweeper out on the off side from the get-go. There were question marks about Pat Cummins's captaincy during the first Test last week Ben Stokes's tactics were different but it showed there is more than one way to win a Test If they have one, it will probably be on the leg-side which allows a quick bowler to bowl a bit straighter and gives them the option of bowling a bouncer as well. Imagine the energy, positivity and confidence the whole Australia dressing room must have got from Cummins, their leader, not only talking the talk but walking the walk. He certainly led from the front, and at the point when you thought Australia might shut up shop with 52 further runs required and two wickets standing, he went bang-bang with two sixes off Joe Root. No doubt Australia will take confidence from that but England won’t be despondent about what was obviously a disappointing loss. It was fascinating to see a Test decided by two wickets but with teams employing completely different strategies.If the first Test is anything to go by, this is going to be an absolute cracker of series that still looks too close to call. Share or comment on this article: JASON GILLESPIE: Playing at Lord's brings a sense of tradition and history for Australian cricketers e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-25 21:52:19","image_url":"https://i.dailymail.co.uk/1s/2023/06/25/22/72520097-0-image-a-22_1687729927609.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ashleigh Gardner spins Australia back into the box seat during chaotic Ashes session","link":"https://7news.com.au/sport/cricket/ashleigh-gardner-spins-australia-back-into-the-box-seat-during-chaotic-ashes-session-c-11086455","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"England are in need of an Ashes miracle after Ashleigh Gardner flipped the script on its head.","content":"Ashleigh Gardner has spun back into the box seat of the after a chaotic fourth day ended with England 5-116 chasing 268 for victory. On a dramatic Sunday at Trent Bridge, Australia fell from 1-149 to all out for 257 in their second innings, after star spinner Sophie Ecclestone fuelled two separate collapses of 6-49 and 3-0. Watch, Stream & Catch Up with Australia's Home of Cricket on England then got away to a flyer in the chase, and looked as if they could pull it off in a canter when they scored 0-55 from their first 10 overs. Then Gardner arrived. After the finger-spinning allrounder took 4-99 in the first innings, she removed the in-form Tammy Beaumont with her first ball in the second innings. Fresh off scores of 201 in a warm-up game and 208 in the first innings at Trent Bridge, Beaumont squeezed Gardner to first slip on 22 where Beth Mooney took the catch. Gardner then got rid of veteran Nat Sciver-Brunt in her next over for a duck on a top-edged sweep, before a sharp-turning delivery trapped Heather Knight lbw for 1. Ecclestone is widely regarded as the world’s best spinner but Gardner must be in the conversation. “I think Ash isn’t too far behind her,” Australia opener Beth Mooney said. “She has been outstanding for us in the past couple of years. “There was a time two or three years ago where Meg tended to not throw the ball to Ash in T20 cricket. “To her credit she changed what she did and changed her variations and things like that.” England opener Emma Lamb also fell in the collapse, lbw to Tahlia McGrath when ball-tracking showed it would have clipped leg stump. Kim Garth then struck in the shadows of stumps to have Sophia Dunkley caught behind for 16, leaving Danni Wyatt (20no) and nightwatcher Kate Cross to fight to the close with 152 more needed. England will need to not only pull off the biggest successful chase in a women’s Test to win, but also eclipse the record for the highest fourth-innings score in any result. “They had the ball on a string in the last 60 minutes,” Mooney said. “It’s pretty tough conditions once the ball gets a bit soft. “The game is teetering ... but we feel like we are probably the happier team walking off.” Australia, for their part, would still feel life could be more comfortable. They were cruising late in the morning session, before England debutante Lauren Filer claimed Ellyse Perry’s wicket for the second time in the match on 25 and also bowled McGrath for one with her pace. Ecclestone then took command, claiming her second five-wicket haul of the Test and making for match figures of 10-192. She bowled Jess Jonassen sweeping on 14, had Mooney chop on to a ball that spun back to her sharply on 73 and got first-innings Annabel Sutherland caught pulling on 15. Alyssa Healy survived a dropped chance first ball that would have marked her fourth straight Test duck, before she posted a counter-attacking 50 to give Australia something to bowl at. But just when she and Alana King looked set to take Australia to a lead of 300 with a 59-run eighth-wicket stand, Australia lost 3-0 with Ecclestone taking the last two wickets to finish with 5-63 for the innings. “We will always believe. We will go into tomorrow ready to win this Test match,” Ecclestone said.","pubDate":"2023-06-25 21:32:16","image_url":"https://images.7news.com.au/publication/C-11086455/ffa9d095b8c563d2da30631fb3a1b9362c6d8e09-16x9-x0y0w1024h576.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Home runs and cricket greats mean happy welcome for MLB in London","link":"https://www.theguardian.com/sport/2023/jun/25/baseball-cricket-mlb-london-st-louis-cardinals-chicago-cubs","keywords":["Baseball","Chicago Cubs","St Louis Cardinals","US sports","Sport","Cricket"],"creator":["Andy Zaltzman at London Stadium"],"video_url":null,"description":"St Louis Cardinals played the Chicago Cubs, enhanced by the guest presence of Jimmy Anderson and Nathan LyonCricket and its long‑lost rogue cousin, baseball, enjoyed an emotional reunion over the weekend. Jimmy Anderson pitched in front of a crowd almost twice as big as any he has bowled in front of in England, and in all more than 100,000 people attended a two‑game series between the Chicago Cubs and St Louis Cardinals at the London Stadium, constituting a mere 0.08% of the Major League Baseball regular season. Indian Premier League franchise owners no doubt cast envious eyes at baseball, dreaming wistfully of a 2,430-game regular season. Cricketers may be tempted by $350m (£275m) 12-year contracts.The weekend offered everything sports watchers in Britain have come to expect from visiting American major‑league events – a large crowd with considerable enthusiasm for the sport, but understandably limited emotional investment in the result, an armageddon’s‑worth of cholesterol and a stadium announcer with the kind of deeply sonorous and unquenchably American voice that could imbue a village-fete cake competition with a sense of fundamental sporting gravity. Continue reading...","content":"C ricket and its long‑lost rogue cousin, baseball, enjoyed an emotional reunion over the weekend. Jimmy Anderson pitched in front of a crowd almost twice as big as any he has bowled in front of in England, and in all more than 100,000 people attended a two‑game series between the Chicago Cubs and St Louis Cardinals at the London Stadium, constituting a mere 0.08% of the Major League Baseball regular season. Indian Premier League franchise owners no doubt cast envious eyes at baseball, dreaming wistfully of a 2,430-game regular season. Cricketers may be tempted by $350m (£275m) 12-year contracts. The weekend offered everything sports watchers in Britain have come to expect from visiting American major‑league events – a large crowd with considerable enthusiasm for the sport, but understandably limited emotional investment in the result, an armageddon’s‑worth of cholesterol and a stadium announcer with the kind of deeply sonorous and unquenchably American voice that could imbue a village-fete cake competition with a sense of fundamental sporting gravity. London calling for devout MLB fans as historic rivalry goes international | Matthew Engel Read more From my admittedly unscientific research, sitting high in the stands over the left-field wall, the crowd seemed to consist of a good-natured cocktail of American tourists, baseball-curious sports fans and British baseball enthusiasts, many of them a legacy of the days when MLB action occupied the late-night hours of the Channel 5 schedule, hosted by Jonny Gould, a much‑loved production which achieved a rare televisual blend of insight, expertise, humour and enthusiasm. Quick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'. If you already have the Guardian app, make sure you’re on the most recent version. In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications. Turn on sport notifications. Was this helpful? Thank you for your feedback. They saw a dominant Chicago victory on Saturday, the Cubs establishing a seven-run lead by the end of the fourth of nine innings, driven by two soaring Ian Happ home runs (it is, admittedly, difficult for a home run to do anything other than soar), and a difficult outing for the veteran Cardinals pitcher Adam Wainwright. The flicker of a St Louis revival came to nothing. The game on Sunday began in a flurry of fielding errors (presumably because of the teams’ lack of red‑ball cricket in the buildup). The Cubs raced to a four-run first‑inning lead before the Cards, one of MLB’s worst-performing teams this season, finally roused from their slumbers to take a 7-5 victory in a game replete with hits but devoid of home runs, finished by the closing pitcher Jordan Hicks in a flurry of 103mph rockets. On both days, there seemed to be a healthy contingent of cricket fans in attendance. If you love one of these two historic sports you can, with the right induction, learn to love the other. (And if, as all correct-thinking humans do, you love cricket statistics, baseball offers more stats than the entire readership of the Guardian has had hot dinners.) Twenty20 cricket has been, often disparagingly, likened to baseball but the latter is – in tone, pacing and structure – much more akin to the rhythms and moods of Test cricket (assuming the current Bazballistic version of England are not batting). Its fundamental state of existence is inaction with the constant possibility of drama, rather than constant action with the occasional outbreak of actual tension. As in cricket, each delivery shifts the story of the game, sometimes imperceptibly, sometimes strikingly, and if the intricacies of the art and deception of pitching are hard to discern from 150 metres or so away, the eruption of timing and power in a home run, the smooth, high-speed precision choreography of a double play, and the sheer velocity of a well‑whanged ball are aesthetic treats for any sport lover. A Chicago Cubs fan with a beer bat before the second game in London. Photograph: Simon Marper/PA Beyond the novelty of seeing high‑level baseball in London, the spectator experience was, as spectator experiences tend to be at such events, largely indistinguishable from anything else. Any gaps in play were filled with something or other from the Anything to Avert The Remote Possibility of Crowd Spontaneity file. The unquestioned highlight was a half-lap mascot race in which a giant Winston Churchill and an even‑more‑than‑usually‑oversized Henry VIII showed the value of top-level leadership experience by streaking away from a showboating Freddie Mercury and a generic bearskin-hatted Grenadier Guard, who seemed overawed by the occasion as much as hindered by his impractical headgear, and failed to mount even a ghost of a challenge. The guardsman’s highly suspicious win in the Sunday race smacked of the kind of dubious fixing that has undermined mascot sporting contests for too long. The game itself was introduced by MLB this season, which have led to a significantly faster, more fluent spectacle. Cricket (not uniquely in sport) has yet to acknowledge that, whatever the quality of the action, dawdling never adds to it. With its slumping over rates in men’s and women’s games, endless interruptions, glacially moving umpires, and four-hour T20 games, if cricket is not feverishly studying this blueprint for product improvement it is even more of an administrative buffoon than its supporters had assumed. skip past newsletter promotion Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion In the event of the much prophesied DeathOfTestCricket™, if and when the five-day game finally succumbs to the ravening myopic maw of the so-called “free” markets, baseball will offer a refuge for those who seek a contest with a similar narrative nature. Chicago Cubs’ Nico Hoerner steals a base at the London Stadium. Photograph: Simon Marper/PA Post-season baseball in particular, in which teams compete over a series of matches with lasting resonance within the history of the sport, in which the impact of each significant play and tactical decision is magnified and scrutinised, which fluctuates and evolves over days and weeks, is the closest (and perhaps only) available alternative to Test matches. The links between the two sports have included a 1932 meeting between baseball’s defining player, Babe Ruth, and cricket’s statistical nonpareil Don Bradman, to which we can now add Anderson and Nathan Lyon, almost 1200 Test wickets between them, side‑by‑side in the impressively metamorphosed former Olympic Stadium, throwing the ceremonial first pitch on Saturday. The England maestro, who, after toiling on the Edgbaston stodgepot, was perhaps enjoying the idea of a sport in which you do not have to make the ball bounce, was in a Cubs shirt. Australia’s premium‑grade off-spinner represented the Cardinals. Regardless of St Louis’s revenge on Sunday, the Cubs’ 9-1 first-game win with Anderson in their corner has surely landed a series-swinging psychological hammer-blow for England before the Lord’s Test. Luis Arráez and the quest for baseball’s elusive .400 barrier Read more","pubDate":"2023-06-25 21:08:41","image_url":"https://i.guim.co.uk/img/media/2d61f05bfc46eeb3ac400fb1097391aa4660cc67/0_78_3500_2099/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=3542c6018e17f31911cd1aabdb280379","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"حسن علی نے ٹی ٹونٹی ورلڈ کپ میں آسٹریلیا کیخلاف کیچ ڈراپ کرنے پر افسوس کا اظہار کر دیا","link":"https://pni.net.pk/sports-news/cricket-news/467677/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"لاہور (پی این آئی ) پاکستانی کرکٹر حسن علی نے آئی سی سی T20I ورلڈ کپ 2021 میں آسٹریلیا کے خلاف سیمی فائنل میچ کے دوران ایک اہم ڈراپ کیچ پر افسوس کا اظہار کیا۔ حال ہی میں حسن علی نے ٹوئٹر پر اپنی ٹیم، [...] The post حسن علی نے ٹی ٹونٹی ورلڈ کپ میں آسٹریلیا کیخلاف کیچ ڈراپ کرنے پر افسوس کا اظہار کر دیا appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"لاہور (پی این آئی ) پاکستانی کرکٹر حسن علی نے آئی سی سی T20I ورلڈ کپ 2021 میں آسٹریلیا کے خلاف سیمی فائنل میچ کے دوران ایک اہم ڈراپ کیچ پر افسوس کا اظہار کیا۔ حال ہی میں حسن علی نے ٹوئٹر پر اپنی ٹیم، برمنگھم بیئرز کی شاندار کارکردگی پر تعریف کا اظہار کیا، کیونکہ انہوں نے جاری وائٹلٹی بلاسٹ ٹورنامنٹ میں لگاتار 5 میچ جیتنے کا شاندار کارنامہ انجام دیا۔ ان کے ٹویٹ کے جواب میں ایک مداح نے حسن کو مذکورہ آئی سی سی ٹورنامنٹ کے سیمی فائنل کے دوران چھوڑا گیا کیچ یاد دلاتے ہوئے کہا کہ “لیکن ہم آسٹریلیا کے خلاف اس کیچ کو پھر بھی نہیں بھولے۔” مداح کے ٹویٹ سے دل کی گہرائیوں سے متاثر ہوئے، 28 سالہ نوجوان پیسر نے اس لمحے کی کشش اور اس کے سیمی فائنل میں ٹیم کے امکانات پر پڑنے والے اثرات کو تسلیم کیا۔ فاسٹ بولر نے چھوٹنے والے کیچ پر دکھ کا اظہار کیا اور افسوس کا اظہار کرتے ہوئے کہا کہ گرائے گئے موقع کی یاد آخری سانس تک کبھی نہیں بھولیں گے۔ انہوں نے کہا کہ “یہاں تک کہ مجھے اب بھی یاد ہے اور آخری سانس تک یا اس کے بعد بھی کبھی نہیں بھولوں گا”۔ یاد رہے کہ پاکستان نے ٹورنامنٹ کے گروپ مرحلے میں ناقابل شکست ریکارڈ برقرار رکھتے ہوئے نہ صرف دوسری ٹیموں کے خلاف فتح حاصل کی بلکہ بھارت کے خلاف بھی شاندار کارکردگی کا مظاہرہ کرتے ہوئے آئی سی سی ایونٹ کی تاریخ میں پہلی بار دس وکٹوں سے شکست دی۔ تاہم، حسن علی نے 19ویں اوور میں میتھیو ویڈ کا کیچ ڈراپ کرنے کے بعد آسٹریلیا نے جیت حاصل کی۔ جب حسن نے کیچ چھوڑا تو آسٹریلیا کو دس گیندوں پر جیت کے لیے 20 رنز درکار تھے۔ اس کے بعد بائیں ہاتھ کے وکٹ کیپر بلے باز کی طرف سے شاندار بیٹنگ نے کینگروز کو کامیابی دلا دی ۔","pubDate":"2023-06-25 19:49:43","image_url":null,"source_id":"pninet","category":["sports"],"country":["pakistan"],"language":"Urdu"},{"title":"Cricket Updates: Australia win first Ashes Test, World Cup Qualifiers…","link":"https://www.samaaenglish.tv/news/40040346/sports-cricket-updates-australia-win-first-ashes-test-world-cup-qualifiers","keywords":["Sports"],"creator":null,"video_url":null,"description":"There were some interesting matches in different formats of Cricket this week, including the Ashes Test Series and ICC World Cup Qualifiers in Zimbabwe. Ashes England and Australia faced off in the first Ashes Test in Edgbaston, where England stunned their opponents by declaring after scoring just 393 runs on Day 1. Australia fought back and scored 386 runs but England gave them a target of 281 runs in the fourth innings. The Kangaroos were struggling at one stage as they lost eight wickets for 227 runs. They needed 54 runs but their skipper Pat Cummins did not give up. Cummins not out on 44 and helped Australia register the historic win in Birmingham. ICC World Cup Qualifiers Zimbabwe and Sri Lanka have become favourites to qualify for the ODI World Cup in India, as they have won three games each. Two-time world champions West Indies suffered an upset loss against Zimbabwe but they could still qualify, if they turn the things around in the super six round. On the other hand Ireland, UAE, Nepal and USA are already out of the race of qualification. Najam Sethi vs Zaka Ashraf Pakistan Cricket Board witnessed some big changes as Najam Sethi had to leave the office and Zaka Ashraf was added to the board of governors. Zaka Ashraf is already opposing some big decisions of Najam Sethi, as he said that the hybrid model is not a victory for Pakistan. It is also expected that he will change the coaching staff, which was appointed by Najam Sethi. But things surely could become more interesting in PCB next week.","content":"England and Australia faced off in the first Ashes Test in Edgbaston, where England stunned their opponents by declaring after scoring just 393 runs on Day 1. Australia fought back and scored 386 runs but England gave them a target of 281 runs in the fourth innings. The Kangaroos were struggling at one stage as they lost eight wickets for 227 runs. They needed 54 runs but their skipper Pat Cummins did not give up. Cummins not out on 44 and helped Australia register the historic win in Birmingham. Zimbabwe and Sri Lanka have become favourites to qualify for the ODI World Cup in India, as they have won three games each. Two-time world champions West Indies suffered an upset loss against Zimbabwe but they could still qualify, if they turn the things around in the super six round. On the other hand Ireland, UAE, Nepal and USA are already out of the race of qualification. Pakistan Cricket Board witnessed some big changes as Najam Sethi had to leave the office and Zaka Ashraf was added to the board of governors. Zaka Ashraf is already opposing some big decisions of Najam Sethi, as he said that the hybrid model is not a victory for Pakistan. It is also expected that he will change the coaching staff, which was appointed by Najam Sethi. But things surely could become more interesting in PCB next week.","pubDate":"2023-06-25 19:22:39","image_url":"https://i.samaaenglish.tv/large/2023/06/2600095475b069b.jpg?r=001038","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ash Gardner strikes to spark England collapse leaving Australia in charge","link":"https://www.theguardian.com/sport/2023/jun/25/the-ashes-england-australia-cricket-ash-gardner","keywords":["Women's Ashes","England women's cricket team","Australia women's cricket team","Women's cricket","Cricket","Australia sport","Sport"],"creator":["Raf Nicholson at Trent Bridge"],"video_url":null,"description":"Only Test, day four: Australia 473 & 257; England 463 & 116-5England lose four wickets for 18 runs to squander initiativeEngland’s chances of a first Test win since January 2014 and a first win against Australia in any format since July 2019 hung in the balance at stumps on the fourth day at Trent Bridge, as they sunk to 116 for five in pursuit of a fourth-innings target of 268.Though Sophie Ecclestone claimed her side would “go away tonight and figure out how we’re going to win this Test match”, Australia are confident that victory is within easy reach. “It is teetering a little bit,” Beth Mooney said. “I back our bowlers to take the five wickets. We feel like we’re the happier team walking off this afternoon, for sure.” Continue reading...","content":"England’s chances of a first Test victory since January 2014 and a first win against Australia in any format since July 2019 hung in the balance at stumps on the fourth day at Trent Bridge, as they sunk to 116 for five in pursuit of a fourth-innings target of 268. Though Sophie Ecclestone claimed her side would “go away tonight and figure out how we’re going to win this Test match”, Australia are confident that victory is within easy reach. “It is teetering a little bit,” Australia’s Beth Mooney said. “I back our bowlers to take the five wickets. We feel like we’re the happier team walking off this afternoon, for sure.” Women’s Ashes Test: Australia set England target of 268 to win on day four – as it happened Read more England had strolled to 55 without loss after 10 overs, but a collapse of four wickets for 18 runs in five overs midway through the evening session tipped momentum in favour of Australia. In desperation, both Emma Lamb and Heather Knight – trapped lbw by Tahlia McGrath and Ash Gardner respectively – sent their decisions upstairs, but DRS showed both as being umpire’s call on impact. Knight became Gardner’s third victim, after the off-spinner had earlier tempted the first-innings double-centurion Tammy Beaumont into slicing a half-volley to slip. In between times, Nat Sciver-Brunt was the agent of her own demise, miscuing a pull to be caught by Kim Garth running round from short leg. Minutes before the close, Garth chipped in with a wicket of her own, her outswinger taking the edge of Sophia Dunkley and landing in the gloves of Alyssa Healy behind the stumps. Though the nightwatcher Kate Cross sent the penultimate ball of the day crashing through mid‑off for four, there are still 152 runs needed to secure victory. With Australia’s spinners licking their lips at the prospect of a fifth day on this pitch, England have a mountain to climb. It was meant to be Ecclestone’s day, after her cumulative match‑haul of 10 for 192 across 77.1 overs (the most bowled by any Englishwoman in a Test since 1987) led what seemed like a routing of Australia for 257. Wickets fell in clusters, including four for 20 in 34 balls immediately after lunch, and – after a 59-run partnership between Healy and Alana King for the eighth wicket – the loss of Australia’s final three batters in the space of seven balls for no runs after tea. Beth Mooney is bowled by Sophie Ecclestone, who took five wickets in each innings. Photograph: James Gill/Danehouse/Getty Images “I knew I was going to bowl a lot of overs, but I didn’t think it would be this many,” Ecclestone said. “You can’t really prepare for that, you’ve just got to go with it and be tough in the mind.” Ecclestone had switched to the Radcliffe Road End at the start of the day, in what seemed to be an attempt to make the most of some scuffed-up footholes at the Pavilion End (from which her previous 50 overs had been delivered). That did the job to see off Mooney, who was finally dismissed halfway through the afternoon session 15 runs short of a maiden Test century, by a ball which spun out of the footmarks on to her stumps. Around her, there were some uncharacteristically tentative shots from the Australians: first-innings centurion Annabel Sutherland pulled Ecclestone straight to square-leg, while Gardner edged Cross to slip. Most strangely of all, the Australia captain Healy, carded at No 6, did not emerge from the dressing room until six wickets had already gone down. That meant a longer wait nursing three quarters of a double‑pair (after three successive ducks in Test cricket). She almost achieved that dubious honour when she was put down by Amy Jones behind the stumps first ball – one of a series of spilled chances across the day, including five by the wicketkeeper-first slip pairing of Jones and Knight. Had they taken those chances, they might yet be celebrating a win. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Quick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'. If you already have the Guardian app, make sure you’re on the most recent version. In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications. Turn on sport notifications. Was this helpful? Thank you for your feedback. Instead, Healy clung on to bring up a 61-ball half-century in the second over after tea – but fell three balls later, limply holing out off a full toss to Lamb at midwicket, to hand Ecclestone her fourth wicket of the day. Darcie Brown, trapped lbw, completed the set; Ecclestone led her team from the pitch holding the ball aloft for the second time in four days. At the close of play Ecclestone said the England head coach, Jon Lewis, had given the team “a bit of a rocket” after a difficult last hour on Saturday evening. Whatever he said, it seemed initially to have worked: they resumed day four with much more of a spring in their steps, especially when Cross – in her third over of the morning – bowled a jaffa which pitched a mile outside off and jagged back in to hit Phoebe Litchfield’s middle stump. England were also buoyed by the return of Sciver-Brunt to the attack, after she was unable to bowl on Saturday due to a knee injury. But it was Lauren Filer who made the morning session fizz, finally living up to her pre-match billing by Lewis as “a key wicket-taking threat”. In back-to-back wicket maidens just before lunch, in which she clocked speeds of 76mph, she removed two of the world’s best batters in quick succession – Ellyse Perry bowled trying to fend off a bouncer, before McGrath was beaten for pace and the ball ricocheted off her pads into the stumps. Perry, dismissed for the second time in the match by England’s debutante pacer, looked rather sheepish. As it turned out, Australia had the last laugh.","pubDate":"2023-06-25 18:59:15","image_url":"https://i.guim.co.uk/img/media/7dd5683fe5c77d821656f966cd8da219a05bd186/0_49_4699_2820/master/4699.jpg?width=460&quality=85&auto=format&fit=max&s=bcf7bd5b775bb8b97dbb5ec5f0573b5f","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"County cricket: Hill and Bean hit centuries for Yorkshire v Gloucestershire","link":"https://www.theguardian.com/sport/live/2023/jun/25/county-cricket-yorkshire-v-gloucestershire-surrey-v-lancashire-and-more-live","keywords":["County Championship","Sport","Cricket"],"creator":["Tanya Aldred"],"video_url":null,"description":"Finlay Bean and George Hill for Yorkshire on the opening day of the match against GloucestershireA wicket at The Oval – Bohannon lbw to Sean Abbot for 10. Lancs 35-2. And Hutton has ticked off another of Somerset’s batters George Bartlett for 13. Somerset 56-3.“Just trying to get my head around how the Kookaburra can be ‘more helpful to the bowlers’ despite apparently offering less seam and swing?! taps Brian Withington. “Certainly seems to be capturing some early wickets today though. Apologies if this has already been dissected BTL but haven’t got there yet.” Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 2h ago Opening day roundup 4h ago Closer of play scores 6h ago A hundred for George Hill! 7h ago Tea-time scores 7h ago Hundreds for Dan Lawrence and Tom Westley! 8h ago A hundred for Alex Lees! 8h ago A hundred for Finlay Bean! 8h ago Somerset 163 all out 12h ago Kookaburra ball 13h ago Preamble 13h ago Fixtures Show key events only Please turn on JavaScript to use this feature 2h ago 20.55 BST Opening day roundup Tanya Aldred This round of Championship cricket, squeezed between the T20 Blast, has the novelty of being the first of two this summer which will use the Kookaburra ball. They were prescribed by the Strauss report, in an attempt to reduce reliance on the swing and seam of the Dukes and encourage fast and spin bowling. One day in, with seven centuries on the board but five teams bowled out in less than a day, it seems too early to make a call. Finlay Bean and George Hill made the most of a good Headingley pitch, a swift outfield, and some wayward Gloucestershire bowling, to rock to sparkling centuries and put Yorkshire in a dominant position. At Chelmsford, Dan Lawrence made his second hundred of the season for Essex , in a partnership of 227 with Tom Westley, who was finally out for a sparkling 114. Dom Bess grabbed two consolation wickets for Warwickshire . A humdinger of a game is developing at The Oval, where Lancashire were dismissed for 274 only to have Surrey 70 for four at stumps. A Brett Hutton five‑fer took the shine off Somerset’s day against Nottinghamshire , dismissed for 163. Hampshire finished the day on 284 for four against Middlesex . Spinner Liam Dawson, overlooked by England, was 111 not out overnight and, along with Nick Gubbins, shimmied Hampshire into a dominant position. At the County Ground, Rob Keogh’s 97 propped up Northamptonshire in the Division One basement battle against Kent . Durham raced along at now familiar lick, with centuries from Alex Lees and Ollie Robinson putting pressure on a Leicestershire side already reeling from the news that Paul Nixon had been put on gardening leave. Nathan McAndrew and Jack Carson kept Glamorgan firmly tethered at Sophia Gardens against Sussex , while Anuj Dal’s five wickets ensured the bottom club Derbyshire had some skin in the game at New Road, Worcestershire all out for 237 after a stonking opening stand. 4h ago 19.37 BST That’s all from us. Thanks for hanging around on a roasting Sunday, congratulations to centurions all: Lawrence, Westley, Dawson, Bean, Hill, Lees and Robinson and five-wicketers Anuj Dal and Brett Hutton. We’ll be back tomorrow – good night! Bean-machine: a second century of the season for Yorkshires's Finlay Bean Photograph: Allan McKenzie/SWpix.com/Shutterstock 4h ago 19.33 BST Closer of play scores DIVISION ONE Chelmsford : Essex 391-7 v Warwickshire Rose Bowl : Hampshire 284-4 v Middlesex County Ground : Northants 237 v Kent 110-1 Taunton : Somerset 163 v Nottinghamshire 145-4 The Oval : Surrey 70-4 v Lancashire 274 DIVISION TWO Sophia Gardens : Glamorgan 242 v Sussex 65-1 Grace Road : Leicestershire v Durham 422-4 New Road : Worcestershire 237 v Derbyshire 32-2 Headingley : Yorkshire 393-6 v Gloucestershire 5h ago 17.52 BST And here comes the promised rain…. with Yorkshire 388-6. 5h ago 17.39 BST Right, time for me to write up. A final polka round the grounds: Dan Lawrence, 147 not out, has guided Essex to 337-5; Dawson and Gubbins are racing each other to a hundred, Hants 256-4; Compton out cheaply, but Kent 49-1; Somerset fighting back against Notts, but Slater (44 not out) is standing in their way 99-3, 63 behind. And Lancashire are all out for 274. In Division Two: Yorks 361-5 Tattersall picking up where Hill and Bean left off, but the clouds are fast approaching. Worcesterstershire have made a horlicks of their innings, from 105-1 to 237-9. Dal 4-45. Four wickets for McAndrew in Glamorgan’s 242 all out. Billy Root the top-scorer with 66. Jack Carson, on people’s lips as an up and coming spinner, 3-45; McAndrew 4-58. Sussex have already lost Haines for six. And Durham are in usual-bish-bang-baz-ball mode: 346-4. I must go off and write my roundup, but do keep chatting BTL. 6h ago 17.21 BST The new ball has been taken at Headingley. The clouds are coming over. Gloucestershire’s best chance. 6h ago 17.19 BST A third wicket for Jordan Clark has reduced Lancs to 274-9, it is left to Williams and Morley to try and scrape towards 300. 6h ago 17.03 BST A hundred for George Hill! A second century of the day for Yorkshire –maybe the prospect of a final resolution on Tuesday is instinctively inspiring some freedom of shot. Or maybe it is the excellent pitch. Or the average bowling. Or the rapid outfield. Helmet off, he shyly raises his the bat. 177 balls, 13 fours. Yorkshire making hay, 343-4. 6h ago 16.57 BST Gubbins and Dawson are pulling Hampshire away from the danger zone with a partnership of 121 – Hants 215-4 at The Rose Bowl As Jonny Tattersall sends the ball shooting through midwicket, beating George Hill in the milestone race, to reach fifty.Very nicely done. 6h ago 16.45 BST While I was looking the other way, Wes Agar (5-63) and Hamidullah Qadri (3-69) rattle through Northants. The immovable object Rob Keogh, was seventh man out for 97. Kent 16-0 in reply already. Runs, runs, more runs at Headingley. Gohar’s over is plonked: four, four, three, six, two. Hill 93, Tattersall 43. 7h ago 16.34 BST Good to see Phil Salt continuing his snappy form from Southport, 56 not out in Lancashire’s 236-7 – which definitely feels not enough against the Ovalnaughts. 7h ago 16.31 BST If you’d asked me in April to guess the Championship’s leading run-scorer at midsummer, I wouldn’t have plumped for Tom Westley. Out for 114, Essex 260-3. Updated at 16.37 BST 7h ago 16.28 BST Sophie Ecclestone’s 5-63 means England need 268 to beat Australia. Follow it all here with the master himself R Smyth (and worry about whether Ecclestone’s arm will fall off later) Women’s Ashes Test: England v Australia, day four – live Read more 7h ago 16.00 BST Tea-time scores DIVISION ONE Chelmsford : Essex 247-2 v Warwickshire Rose Bowl : Hampshire 183-4 v Middlesex County Ground : Northants 218-9 v Kent Taunton : Somerset 163 v Nottinghamshire 23-1 The Oval : Surrey v Lancashire 214-7 DIVISION TWO Sophia Gardens : Glamorgan 212-7 v Sussex Grace Road : Leicestershire v Durham 246-4 New Road : Worcestershire 189-6 v Derbyshire Headingley : Yorkshire 273-4 v Gloucestershire 7h ago 15.40 BST Hundreds for Dan Lawrence and Tom Westley! Put your feet up boys, and enjoy the show. Essex 230-2. Khushi and Cook must be kicking themselves. The century boys: Lawrence and Westley Photograph: Gavin Ellis/TGS Photo/Shutterstock 8h ago 15.36 BST A tale of two England once-weres: At Trent Bridge, Haseeb Hameed has been out for an 18-ball duck. At Chelmsford, Dom Bess has been bowling. 19 overs, 0-77. 8h ago 15.18 BST A hundred for Alex Lees! His first first-class century for 14 months. And out! A second catch for soon-to-be-Riverside bound Ackermann, a first-wicket for soon-to-be-Riverside-bound Parkinson C. Durham 223-4. 8h ago 15.13 BST And there goes Bean, pulling again, but this time straight into the hands of Charlesworth at backward square leg. off Akther, for 114. He slopes off in obvious disappointment, gloves off, helmet half cock. Smashing innings, Yorks 243-4. 8h ago 15.06 BST A hundred for Finlay Bean! Nicely does it! A snappy pull to the rope brings Bean a second hundred in his nascent first-class career. Happy applause waves around Headingley, Yorkshire on top, Gloucestershire lost for ideas. And a single brings the fourth-wicket partnership up to 150 from 211 balls. 8h ago 14.59 BST Somerset 163 all out Is this going to be one of those years when Somerset flirt with relegation? Of course it is! Five for Brett Hutton. Top scorer TKC. Not the best half a day’s batting. 9h ago 14.37 BST Getting spicy in the Test – where England have managed to drop five catches but still have Australia six down – the lead 206. 9h ago 14.35 BST Essex are still strolling through the foothills, the third wicket partnership 145 and counting. Essex 165-2. Is Dan Lawrence (68 not out) now going to have the summer of his life as he says farewell to Chelmsford? 9h ago 14.27 BST George Hill , generally considered one of the best players of spin on the team, has Yorks racing along, an easy afternoon six off Zahar Gohar into the plastic seats. The partnership between him and Finlay Bean now 98. Yorks 188-3 as a fierce win stamps round the ground. 9h ago 14.21 BST In 31 degree heat, Lancashire are starting to melt. Sean Abbott’s Kookaburra skills(3-42) have been complemented by a wicket each for Sam Curran and Tom Lawes. Lancs 123-5. Salt and Balderson don the hard hats and wearily bend to pick up the rubble. Updated at 14.21 BST 9h ago 14.16 BST Apologies for the lack of updates, a work phone call. Updates to follow. Updated at 14.17 BST 9h ago 13.51 BST A onion bhaji wrap in my brown Headingley sandwich bag, makes for a tasty lunch. Just spoke to Tanni Grey Thompson, Yorkshire’s interim chair, who has been out and about meeting and greeting round the ground. I know she would, wouldn’t she, but she was very positive about the expertise on the Yorkshire committee, and the pathway programme in particular. 10h ago 13.25 BST DIVISION ONE Chelmsford : Essex 119-2 v Warwickshire Rose Bowl : Hampshire 92-3 v Middlesex County Ground : Northants 104-4 v Kent Taunton : Somerset 106-4 v Nottinghamshire The Oval : Surrey v Lancashire 98-3 DIVISION TWO Sophia Gardens : Glamorgan 85-4 v Sussex Grace Road : Leicestershire v Durham 150-1 New Road : Worcestershire 105-2 v Derbyshire Headingley : Yorkshire 139-3 v Gloucestershire 10h ago 13.02 BST A frisky morning at Headingley, Yorks 133-3, Finlay Bean leading the way 65 not out. Lunchtime scores round the grounds to follow. 10h ago 12.53 BST Some succour for Somerset fans: SHOT!! Lovely, lovely stroke from James Rew! LIVE STREAM ➡️ https://t.co/aRtGCP7E47 #SOMvNOTTS #WeAreSomerset pic.twitter.com/5Qepo5pEEN — Somerset Cricket 🏏 (@SomersetCCC) June 25, 2023 10h ago 12.52 BST Hampshire lose a third, and its a big one, their maypole, James Vince. Josh de Caires, Atherton’s boy, the wicket-taker. Hants 81-3. Essex are making hay after being 20-2; now 112-2, a half century to Tom Westley. A fourth for Brett Hutton, who is having a very fruitful morning at Taunton, Somerset 103-4. Four before lunch: Brett Hutton. Photograph: Harry Trump/Getty Images 11h ago 12.37 BST TdL with some Ashes thoughts: Ashes to Ashes, rust to bust: England must find groove to remedy sloppy start | Tim de Lisle Read more And Barney off his long run: Bazball: a cult of bruised masculinity where you win even if you lose | Barney Ronay Read more 11h ago 12.31 BST The Trent Bridge pitch’s friendly nature continues to make wicket-taking a trial in the women’s Test. The fabulous Megan Maurice will keep you updated: Women’s Ashes Test: England v Australia, day four – live Read more 11h ago 12.16 BST In Division Two, Yorkshire are racing along – ah but perhaps not so much now – as Ben Charleswoth sends down a complete pie which Dawid Malan pulls round into Bracey’s gloes. Gone for a boundary-laden 28. Bean at the non-striker’s end tips his head back in exasperation/despair. Yorks 90-3. Roderick and Libby continue to enjoy Derbyshire’s profligacy, Worcs 65-0. Durham too racing along, as is their want, 100-0 o ff 17 overs. Parkinson C, getting to know his soon-to-be-teammates, from the bowling crease. Parkinson M, back with Durham on loan, sits in the opposition dressing room. Alone in Division Two, Glamorgan’s batters are struggling, 49-3 against Sussex.Shipley 2-21. 11h ago 12.05 BST A wicket at The Oval – Bohannon lbw to Sean Abbot for 10. Lancs 35-2. And Hutton has ticked off another of Somerset’s batters George Bartlett for 13. Somerset 56-3. 11h ago 12.01 BST “Just trying to get my head around how the Kookaburra can be ‘more helpful to the bowlers’ despite apparently offering less seam and swing?! taps Brian Withington. “Certainly seems to be capturing some early wickets today though. Apologies if this has already been dissected BTL but haven’t got there yet.” Er, yes you’re quite right. I’m writing drivel and have corrected said entry. Ball is LESS helpful to the bowlers as it doesn’t move as much. That said, no real sign of batting dominance yet except for Bazballing Durham and Worcestershire. Updated at 12.02 BST 11h ago 11.47 BST Dancing round the Division One grounds: Warwickshire’s bowlers enjoying the Kookaburra ball – Alastair Cook and Feroze Khushi both out cheaply, Essex 24-2. Dan Lawrence, moving to Surrey at the end of the summer, nine not out. At The Rose Bowl, TRJ has whittled out Fletcha Middleton for four, Hampshire 30-1. Early wickets for Kent too – Wes Agar and Arshdeep Singh taking one each, Northants 32-2. Two wickets for Brett Hutton at Taunton, where Notts have Somerset 39-2; and Lancs, inserted by Surrey, have lost Wells for three. Keaton Jennings, back from his hamstring injury, has hit three fours in his 16 not out. This too, at Taunton. I hope it brings comfort to Barnaby Webber’s family. Signed shirts from both clubs were presented to Barnaby Webber's family prior to play at Taunton today as an expression of condolence and unity. Our thoughts remain with the victims and all those affected by last week's tragic events in Nottingham. #SOMNOT pic.twitter.com/uJObocGgZF — Nottinghamshire CCC (@TrentBridge) June 25, 2023 12h ago 11.24 BST Hang about Yorkshire, the storm clouds aren’t supposed to be coming till after lunch. Shan Masood lbw Taylor for a three ball duck. 33-2. 12h ago 11.22 BST A wicket at Headingley – Lyth tries to leave alone and is snaffled up at second slip for 14. A short and sweet cameo. 12h ago 11.15 BST An early email, hello Will Unwin! “In a week where it was confirmed Matt Parkinson and Danny Lamb will leave Lancs in the summer, I’m intrigued why the club has become pretty poor at A) helping academy graduates reach their potential And B) retaining them. In recent seasons we’ve seen Hameed and Davies go, and now the latest two. We were pretty close to losing Mahmood this winter, too, so seems a big problem. We do have another hotel on the ground though… Why do you think this is the situation at Lancs? We only ever get very vague reasoning from the club.” I can’t pretend to have any special behind the scenes knowledge. In the case of Danny Lamb I think he wanted first-team cricket. With Parky, like Hameed, there seems to have been something of a breakdown in communication between both parties. Best, in such cases, for a clean break and a fresh start – but it doesn’t reflect too well on the club. 12h ago 10.57 BST Kookaburra ball Yes, this is one of the two rounds this summer which will features the Kookaburra ball – as recommended in the Strauss report. They are said to seam and swing less and generally be less helpful to the bowlers. I’m sure they’re very grateful. Bright new thing: the Kookaburra ball Photograph: Michael Dodge/AAP Updated at 11.58 BST 12h ago 10.52 BST So much to keep an eye on this round. Runaway favourites Surrey take on Lancashire – who announced the departure of Matt Parkinson to Kent at the end of the season. Meanwhile brother Callum is moving to Durham, as part of the bin-fire at Grace Road which also involved Paul Nixon being put on gardening leave and the departures of Colin Ackermann and Chris Wright. Leicestershire chief exec Sean Jarvis, quoted on cricinfo said, that there had been “ a mess behind… every door I opened” since he joined in 2020. “A lot of information has come to my attention over the past two months and as chief executive of this club, I’ll be investigating comments, allegations, all those sorts of things that have gone on. “That’s what we’re trying to sort out. All these different fires that seem to be burning, we’re now starting to eradicate and we’re starting to put the proper infrastructure in place within this club. I know members were very upset and very unhappy with what’s gone on. I get that that is sport, but we are striving to develop this club.” 13h ago 10.35 BST Fixtures DIVISION ONE Chelmsford : Essex v Warwickshire Rose Bowl : Hampshire v Middlesex County Ground : Northants v Kent Taunton : Somerset v Nottinghamshire The Oval : Surrey v Lancashire DIVISION TWO Sophia Gardens : Glamorgan v Sussex Grace Road : Leicestershire v Durham New Road : Worcestersire v Derbyshire Headingley : Yorkshire v Gloucestershire 13h ago 10.35 BST Preamble Good Sunday morning! Midsummer cricket is back – for a week. The clouds have arranged themselves prettily above Headingley this morning in preparation for this afternoon’s predicted cloudburst. And there are storm clouds ahead for English cricket generally with the publication on Tuesday of the long awaited ICEC’s Report examining the state of equity in cricket. Yorkshire have won the toss and will bat. Their team includes Dan Moriarty, signed on a loan deal from Surrey, while Dom Bess plays for Warwickshire on a one-game loan. Round and round and round we go. Updated at 10.43 BST Topics County Championship County cricket live blog Cricket Reuse this content","pubDate":"2023-06-25 18:33:19","image_url":"https://i.guim.co.uk/img/media/76e01f467531a2562d7ce589fac5016eebec11e5/0_200_6000_3600/master/6000.jpg?width=460&quality=85&auto=format&fit=max&s=bdd6cbb036c4abef0a936ec58af96de8","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Indian Team: આવનારા સમયમાં આ 3 ફાસ્ટ બોલર બનશે ભારતના સુપરસ્ટાર, ઈશાંત શર્માએ કરી ભવિષ્યવાણી","link":"https://gujarati.abplive.com/sports/cricket/ishant-sharma-named-umran-malik-arshdeep-singh-and-mukesh-kumar-3-fast-bowlers-that-can-be-indians-future-845555","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"Ishant Sharma On Indian Future Bowlers: ભારતીય ટીમનો સ્ટાર ફાસ્ટ બોલર ઈશાંત શર્મા છેલ્લા લગભગ 2 વર્ષથી ટીમની બહાર ચાલી રહ્યો છે. ઇશાંત આ વર્ષે રમાયેલી IPL 16માં રમતા જોવા મળ્યો હતો, જેમાં તેણે શાનદાર પ્રદર્શન કર્યું હતું. બીજી તરફ ટીમ ઈન્ડિયામાં ફાસ્ટ બોલરોની વાત કરીએ તો જુલાઈમાં વેસ્ટ ઈન્ડિઝ પ્રવાસ માટે ઘણા યુવા બોલરોને તક આપવામાં આવી છે. આ દરમિયાન ઈશાંત શર્માએ તે 3 ભારતીય ઝડપી બોલરો વિશે જણાવ્યું, જેમને યોગ્ય માર્ગદર્શન આપવામાં આવે તો ભવિષ્યના સુપરસ્ટાર બની શકે છે. ઇશાંત શર્માએ આ વિશે યુટ્યુબ ચેનલ 'બીયરબાઈસેપ્સ' પર વાત કરી હતી. ભારતીય ફાસ્ટ બોલરે કહ્યું,જો તમે તેની સાથે યોગ્ય રીતે કામ કરો છો તો ઉમરાન મલિકમાં દેશ માટે લાંબા સમય સુધી સારું પ્રદર્શન કરવાની ક્ષમતા છે. આમાં બીજો ફાસ્ટ બોલર અર્શદીપ સિંહ  છે. તે જ સમયે, ઇશાંત શર્માએ ત્રીજા બોલર તરીકે દિલ્હી કેપિટલ્સના મુકેશ કુમારની પસંદગી કરી છે. ઈશાંત શર્મા પણ આઈપીએલ 2023માં દિલ્હી તરફથી રમ્યો હતો. યોગ્ય માર્ગદર્શનની જરૂર છેઃ ઈશાંત શર્મા મુકેશ વિશે વાત કરતા ઈશાંત શર્માએ કહ્યું, ઘણા લોકો તેની કહાની નથી જાણતા, પરંતુ મેં તેના જેવો સરળ વ્યક્તિ ક્યારેય જોયો નથી. જો તમે તેને કોઈ ખાસ બોલ નાખવા માટે કહો છો, તો તે માત્ર તે જ બોલ ફેંકે છે. તેને મેદાન પર યોગ્ય માર્ગદર્શનની જરૂર છે, જેથી તે જાણી શકે કે દબાણની સ્થિતિમાં કયો બોલ ફેંકવો. ઇશાંત શર્માએ જણાવ્યું કે ગત IPLમાં તે કેમ મોંઘો સાબિત થયો હતો. મુકેશ કુમારે IPL 2023ની 10 મેચોમાં માત્ર 7 વિકેટ લીધી, 10થી વધુની ઈકોનોમી સાથે રન આપ્યા હતા. આ અંગે ઈશાંતે કહ્યું, આઈપીએલમાં તેની સામે રન એટલા માટે બનાવ્યા કારણ કે તેણે મુશ્કેલ ઓવરો ફેંકી હતી. તેણે કઈ પરિસ્થિતિમાં બોલિંગ કરી અથવા કયા બેટ્સમેનની સામે બોલિંગ કરી તે કોઈ જોતું નથી. બધાએ જોયું કે તેણે 4 ઓવરમાં 50 રન આપ્યા. રોહિત શર્મા હટાવાશે ને આ અનુભવીને સોંપાશે ટીમની કમાન ? BCCIએ આપ્યા સંકેત  ભારતીય ટીમની રમત અને કેપ્ટનશીપની અત્યારે તમામ ફેન્સ ટીકા કરી રહ્યું છે. સતત બીજીવાર ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપની ફાઇનલમાં હાર મળ્યા બાદ ખરાબ રણનીતિ અને કેપ્ટનને હટાવવાની ચર્ચાએ જોર પકડ્યુ છે. ગયા વર્ષે વિરાટ કોહલી અને આ વખતે રોહિત શર્માની કેપ્ટન્સીમાં ટીમ ઇન્ડિયા ટેસ્ટમાં ચેમ્પીયન બનતા રહી ગઇ છે.હાર બાદથી જ ટેસ્ટ કેપ્ટનને લઈને ચર્ચા ચાલી રહી છે. હવે આ બધાની વચ્ચે સમાચાર સામે આવ્યા છે કે રોહિત શર્મા માટે વેસ્ટ ઈન્ડિઝનો પ્રવાસ મહત્વપૂર્ણ સાબિત થઈ શકે છે. પ્રવાસ માટે ટીમની પસંદગી થઈ ગઈ છે અને તેમાં આગામી કેપ્ટનના સંકેતો છુપાયેલા છે.  બીસીસીઆઈએ શુક્રવારે વેસ્ટ ઈન્ડિઝ સામેની સીરીઝ માટે ટીમની જાહેરાત કરી હતી. 2 મેચોની ટેસ્ટ સીરીઝ માટે પસંદ કરાયેલી ટીમને લઈને કેટલાક કડક નિર્ણયો લેવામાં આવ્યા છે. આમાં એવો નિર્ણય પણ આવ્યો કે જેના વિશે કોઈએ વિચાર્યું પણ ન હતું. ચેતેશ્વર પુજારાને ટીમની બહાર રાખવામાં આવ્યો હતો અને આનીથી એવો સંકેત પણ મળ્યો છે કે, રોહિત શર્મા હવે આગામી કેપ્ટન તરીકે નહીં રહે.   સિલેક્ટરોએ ઇન્ડિયન પ્રીમિયર લીગ પછી ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપ ફાઇનલ માટે ટીમમાં પાછા ફરવા માટે આઉટ ઓફ ફેવર અજિંક્ય રહાણેને તક આપી હતી. માત્ર 1 મેચ બાદ તેને ફરીથી વાઇસ કેપ્ટન બનાવવામાં આવ્યો છે.. બીસીસીઆઈ આ ખેલાડી પર આટલો ભરોસો દર્શાવે છે તે માત્ર એક જ દિશામાં ઈશારો કરી રહ્યું છે કે, આગામી સમયમાં રોહિત શર્માને ટેસ્ટ કેપ્ટન પદેથી હટાવીને અનુભવી સ્ટાર બેટ્સમેન અજિંક્યે રહાણેને કેપ્ટન બનાવવામાં આવી શકે છે. BCCI હવે રોહિત શર્માને ત્રણેય ફોર્મેટમાં કેપ્ટનશિપના બોજમાંથી મુક્ત કરવા માંગે છે. હાર્દિક પંડ્યા પહેલાથી જ ટી-20માં મોટાભાગની મેચોની કેપ્ટનશીપ કરી રહ્યો છે. હવે તેને ટેસ્ટ મેચોમાં પણ સુકાનીપદથી રાહત મળી શકે છે. વેસ્ટ ઈન્ડિઝ પ્રવાસ બાદ અજિંક્ય રહાણેને આ જવાબદારી આપવામાં આવી શકે છે.  ICC ODI વર્લ્ડકપ પર વધુ ધ્યાન આપવા માટે, BCCI નક્કી કરી શકે છે કે રોહિત શર્મા બંને ફોર્મેટની કેપ્ટનશિપમાંથી મુક્ત રહેશે. હાર્દિક પંડ્યા T20ની કેપ્ટનશીપ સંભાળી રહ્યો છે, અજિંક્ય રહાણેને ટેસ્ટ કેપ્ટન બનાવવો જોઈએ. અચાનક ટીમમાં વાપસીની તક આપવી અને પછી તેને ઉપ-કેપ્ટન બનાવવો એ કોઈ સંયોગ નથી. Join Our Official Telegram Channel: https://t.me/abpasmitaofficial  ","content":"Ishant Sharma On Indian Future Bowlers: ભારતીય ટીમનો સ્ટાર ફાસ્ટ બોલર ઈશાંત શર્મા છેલ્લા લગભગ 2 વર્ષથી ટીમની બહાર ચાલી રહ્યો છે. ઇશાંત આ વર્ષે રમાયેલી IPL 16માં રમતા જોવા મળ્યો હતો, જેમાં તેણે શાનદાર પ્રદર્શન કર્યું હતું. બીજી તરફ ટીમ ઈન્ડિયામાં ફાસ્ટ બોલરોની વાત કરીએ તો જુલાઈમાં વેસ્ટ ઈન્ડિઝ પ્રવાસ માટે ઘણા યુવા બોલરોને તક આપવામાં આવી છે. આ દરમિયાન ઈશાંત શર્માએ તે 3 ભારતીય ઝડપી બોલરો વિશે જણાવ્યું, જેમને યોગ્ય માર્ગદર્શન આપવામાં આવે તો ભવિષ્યના સુપરસ્ટાર બની શકે છે. ઇશાંત શર્માએ આ વિશે યુટ્યુબ ચેનલ 'બીયરબાઈસેપ્સ' પર વાત કરી હતી. ભારતીય ફાસ્ટ બોલરે કહ્યું,જો તમે તેની સાથે યોગ્ય રીતે કામ કરો છો તો ઉમરાન મલિકમાં દેશ માટે લાંબા સમય સુધી સારું પ્રદર્શન કરવાની ક્ષમતા છે. આમાં બીજો ફાસ્ટ બોલર અર્શદીપ સિંહ છે. તે જ સમયે, ઇશાંત શર્માએ ત્રીજા બોલર તરીકે દિલ્હી કેપિટલ્સના મુકેશ કુમારની પસંદગી કરી છે. ઈશાંત શર્મા પણ આઈપીએલ 2023માં દિલ્હી તરફથી રમ્યો હતો. યોગ્ય માર્ગદર્શનની જરૂર છેઃ ઈશાંત શર્મા મુકેશ વિશે વાત કરતા ઈશાંત શર્માએ કહ્યું, ઘણા લોકો તેની કહાની નથી જાણતા, પરંતુ મેં તેના જેવો સરળ વ્યક્તિ ક્યારેય જોયો નથી. જો તમે તેને કોઈ ખાસ બોલ નાખવા માટે કહો છો, તો તે માત્ર તે જ બોલ ફેંકે છે. તેને મેદાન પર યોગ્ય માર્ગદર્શનની જરૂર છે, જેથી તે જાણી શકે કે દબાણની સ્થિતિમાં કયો બોલ ફેંકવો. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ઇશાંત શર્માએ જણાવ્યું કે ગત IPLમાં તે કેમ મોંઘો સાબિત થયો હતો. મુકેશ કુમારે IPL 2023ની 10 મેચોમાં માત્ર 7 વિકેટ લીધી, 10થી વધુની ઈકોનોમી સાથે રન આપ્યા હતા. આ અંગે ઈશાંતે કહ્યું, આઈપીએલ માં તેની સામે રન એટલા માટે બનાવ્યા કારણ કે તેણે મુશ્કેલ ઓવરો ફેંકી હતી. તેણે કઈ પરિસ્થિતિમાં બોલિંગ કરી અથવા કયા બેટ્સમેનની સામે બોલિંગ કરી તે કોઈ જોતું નથી. બધાએ જોયું કે તેણે 4 ઓવરમાં 50 રન આપ્યા. રોહિત શર્મા હટાવાશે ને આ અનુભવીને સોંપાશે ટીમની કમાન ? BCCIએ આપ્યા સંકેત ભારતીય ટીમની રમત અને કેપ્ટનશીપની અત્યારે તમામ ફેન્સ ટીકા કરી રહ્યું છે. સતત બીજીવાર ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપની ફાઇનલમાં હાર મળ્યા બાદ ખરાબ રણનીતિ અને કેપ્ટનને હટાવવાની ચર્ચાએ જોર પકડ્યુ છે. ગયા વર્ષે વિરાટ કોહલી અને આ વખતે રોહિત શર્માની કેપ્ટન્સીમાં ટીમ ઇન્ડિયા ટેસ્ટમાં ચેમ્પીયન બનતા રહી ગઇ છે.હાર બાદથી જ ટેસ્ટ કેપ્ટનને લઈને ચર્ચા ચાલી રહી છે. હવે આ બધાની વચ્ચે સમાચાર સામે આવ્યા છે કે રોહિત શર્મા માટે વેસ્ટ ઈન્ડિઝનો પ્રવાસ મહત્વપૂર્ણ સાબિત થઈ શકે છે. પ્રવાસ માટે ટીમની પસંદગી થઈ ગઈ છે અને તેમાં આગામી કેપ્ટનના સંકેતો છુપાયેલા છે. બીસીસીઆઈએ શુક્રવારે વેસ્ટ ઈન્ડિઝ સામેની સીરીઝ માટે ટીમની જાહેરાત કરી હતી. 2 મેચોની ટેસ્ટ સીરીઝ માટે પસંદ કરાયેલી ટીમને લઈને કેટલાક કડક નિર્ણયો લેવામાં આવ્યા છે. આમાં એવો નિર્ણય પણ આવ્યો કે જેના વિશે કોઈએ વિચાર્યું પણ ન હતું. ચેતેશ્વર પુજારાને ટીમની બહાર રાખવામાં આવ્યો હતો અને આનીથી એવો સંકેત પણ મળ્યો છે કે, રોહિત શર્મા હવે આગામી કેપ્ટન તરીકે નહીં રહે. સિલેક્ટરોએ ઇન્ડિયન પ્રીમિયર લીગ પછી ICC વર્લ્ડ ટેસ્ટ ચેમ્પિયનશિપ ફાઇનલ માટે ટીમમાં પાછા ફરવા માટે આઉટ ઓફ ફેવર અજિંક્ય રહાણેને તક આપી હતી. માત્ર 1 મેચ બાદ તેને ફરીથી વાઇસ કેપ્ટન બનાવવામાં આવ્યો છે.. બીસીસીઆઈ આ ખેલાડી પર આટલો ભરોસો દર્શાવે છે તે માત્ર એક જ દિશામાં ઈશારો કરી રહ્યું છે કે, આગામી સમયમાં રોહિત શર્માને ટેસ્ટ કેપ્ટન પદેથી હટાવીને અનુભવી સ્ટાર બેટ્સમેન અજિંક્યે રહાણેને કેપ્ટન બનાવવામાં આવી શકે છે. BCCI હવે રોહિત શર્માને ત્રણેય ફોર્મેટમાં કેપ્ટનશિપના બોજમાંથી મુક્ત કરવા માંગે છે. હાર્દિક પંડ્યા પહેલાથી જ ટી-20માં મોટાભાગની મેચોની કેપ્ટનશીપ કરી રહ્યો છે. હવે તેને ટેસ્ટ મેચોમાં પણ સુકાનીપદથી રાહત મળી શકે છે. વેસ્ટ ઈન્ડિઝ પ્રવાસ બાદ અજિંક્ય રહાણેને આ જવાબદારી આપવામાં આવી શકે છે. ICC ODI વર્લ્ડકપ પર વધુ ધ્યાન આપવા માટે, BCCI નક્કી કરી શકે છે કે રોહિત શર્મા બંને ફોર્મેટની કેપ્ટનશિપમાંથી મુક્ત રહેશે. હાર્દિક પંડ્યા T20ની કેપ્ટનશીપ સંભાળી રહ્યો છે, અજિંક્ય રહાણેને ટેસ્ટ કેપ્ટન બનાવવો જોઈએ. અચાનક ટીમમાં વાપસીની તક આપવી અને પછી તેને ઉપ-કેપ્ટન બનાવવો એ કોઈ સંયોગ નથી. Join Our Official Telegram Channel: https://t.me/abpasmitaofficial","pubDate":"2023-06-25 18:21:30","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/04/29/d388e262ecfa463710a22b8f86ffce381682735034756567_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Gujarati"},{"title":"1983 World Cup Win: ... आणि तो त्यादिवशी खऱ्या अर्थाने भारतीय क्रिकेटचा 'देव' ठरला! भारताला विश्वचषक मिळवून देण्यात कपिल देव यांचा मोलाचा वाटा","link":"https://marathi.abplive.com/sports/cricket/40-years-1983-world-cup-win-india-created-history-on-this-day-june-25-1983-beating-west-indies-at-lords-detail-marathi-news-1187235","keywords":["क्रिकेट"],"creator":["एबीपी माझा वेब टीम"],"video_url":null,"description":"1983 World Cup Win:  भारतीय क्रिकेटच्या इतिहासामध्ये सुवर्ण अक्षरांनी लिहून ठेवावा असा क्षण म्हणजे 1983 साली भारताने जिंकलेला विश्वचषक (World Cup ) संपूर्ण भारत (India) आजही ज्या गोष्टींचा अभिमान बाळगतो त्यामधलीच ही एक गोष्ट.  तेव्हा संपूर्ण जगालाच काय भारताला देखील ही आशा नव्हती की त्या विश्वचषकावर भारताचं नाव कोरलं जाईल. पण या सगळ्यामध्ये भारतासाठी खऱ्या अर्थाने तो देव ठरला होता. तो म्हणजे भारतीय संघाचा माजी कर्णधार कपिल देव.  खरंतर कपिल देव यांच्या खेळीचा भारताच्या या यशामध्ये अगदी मोलाचा वाटा आहे असं म्हटलं तरी वावगं ठरणार नाही.  कपिल देव यांनी क्रिकेटच्या इतिहासात विक्रम रचला होता. समोर झिम्बाबेसारखा संघ. खरंतर त्या काळी  झिम्बाबे संघांचं देखील क्रिकेटमध्ये चांगलचं वजन होतं. पण त्यादिवशी कपिल देव यांनी झिम्बाबेच्या खेळाडूंना धू-धू धुतलं आणि भारतीय किक्रेट संघांचं नाव जगाच्या यादीत कोरलं गेलं. भारतीय क्रिकेट संघाचे कर्णधार कपिल देव यांनी 175 धावांचा ऐतिहासिक खेळी केली होती आणि त्यानंतर तो क्षण भारतीय क्रिकेटच्या इतिहासात सुवर्ण अक्षरांनी कोरला गेला.  या दिवशी कपिल देव हे एकदिवसीय सामन्यामध्ये 100 धावांची खेळी खेळणारे पहिले भारतीय क्रिकेटपटू ठरले होते.  झिम्बाबेचा सामना जिंकणं भारतासाठी महत्त्वाचं होतं  खरंतर ती भारतासाठी करो या मरो ची खेळी होती. अगदी 17 धावा करुन भारताचा निम्मा संघ माघारी फिरला होता. त्यामुळे भारतीयाचं विश्वचषक जिंकण्याचं स्वप्न आताही अपूर्णच राहणार असाच सगळ्यांचा समज झाला होता. पण त्यावेळी कर्णधार कपिल देव यांनी अगदी संयमाने खेळी केली आणि त्यांना मोलाची साथ मिळाली ते रॉजर बिन्नी याची. या जोडीने 48 चेंडूमध्ये 22 धावांची भागिदारी केली. त्यावेळी कपील देव यांनी 138 धावांमध्ये 175 धावा केल्या. भारताने झिम्बाबे समोर 267 धावांचं आव्हान ठेवलं आणि 31 धावांनी झिम्बाबेवर विजय मिळवला. त्यामुळे विश्वचषकाच्या दिशेने भारताचा महत्त्वपूर्ण प्रवास सुरु झाला होता.  आणि भारतासमोर इंग्लंडचं आव्हान  भारतानं झिम्बाबेवर मात करून उपांत्य फेरीत प्रवेश मिळवला होता. इंग्लंडसोबत 22 जून रोजी भारतीय संघ उपात्यं फेरीचा सामना खेळत होता. इंग्लंडने नाणेफेक जिंकली आणि फलंदाजी करण्याचा निर्णय घेतला होता. तेव्हा इंग्लंडने चक्क 60 षटकांमध्ये 213 धावा केल्या होत्या. त्यादिवशी देखील कपिल देव यांच्या कामगिरीमुळे भारतीयांच्या हृदयात कोरणार तो दिवस ठरला. कपिल देव यांनी 3 विकेट्स घेत संघाला विजयाच्या दिशेने नेलं. त्यांना संघातील इतर खेळाडूंची देखील तितकीच मोलाची साथ मिळाली. त्या खेळात भारताने अवघ्या काही षटकात विजय मिळवला होता. भारताच्या फलदांनी जोरदार कामगिरी करत अंतिम फेरीत दमदार प्रवेश मिळवला होता.  एक झेल आणि भारताचा ऐतिहासिक क्षण भारतासमोर विडींज आव्हान. खरंतर भारत अंतिम फेरीत पोहचला हिच भारतीयांसाठी खूप महत्त्वाची गोष्ट होती. लॉर्ड्सच्या मैदावर भारताच्या सुपुत्रांनी सुवर्णक्षण घडवला होता. विश्वचषकात तोपर्यंत फक्त वेस्ट इंडिजनेच दोनदा विश्वकप जिंकून क्रिकेटच्या विश्वात आपलं स्थान मजबूत केलं होतं. परंतु त्यानंतर भारताने त्यांचं सलग तिसऱ्यांदा विश्वविजेता होण्याचं स्वप्न मात्र अपूर्णच ठेवलं.  वेस्ट इंडिजच्या  संघाला अवघ्या 183 धावांचं लक्ष दिलं होतं आणि 140 धावांमध्ये  भारताच्या शिलेदारांनी तो डाव गुंडाळला होता. जगातील फलंदाजांच्या यादीमध्ये मानाचं स्थान असलेले विवियन रिचर्ड्स मैदानावर होते. तुफान फटकेबाजी लॉर्ड्सच्या मैदानावर सुरु होती आणि त्या एका झेलाने संपूर्ण डावच पालटला. विवियन रिचर्ड्स यांनी एक जोरदार शॉट मारला आणि कपील देव यांनी दूरचं अंतर गाठत चेंडू झेलला.  त्या दिवसाचं भारतीय क्रिकेटविश्वातच नाही तर प्रत्येक भारतीयाच्या मनात मानाचं आणि आदराचं स्थान आहे. आज त्या ऐतिहासिक दिवसाला 40 वर्ष पूर्ण होत आहेत. पण आजही प्रत्येक भारतीयांच्या मनात तो क्षण जशाच्या तसा आहे.   महत्त्वाच्या इतर बातम्या : 1983 World Cup Win : भारताच्या ऐतिहासिक कामगिरीला 40 वर्ष पूर्ण! आजच्या दिवशी विश्वचषक उंचावून रचला होता इतिहास","content":"1983 World Cup Win: भारतीय क्रिकेटच्या इतिहासामध्ये सुवर्ण अक्षरांनी लिहून ठेवावा असा क्षण म्हणजे 1983 साली भारताने जिंकलेला विश्वचषक (World Cup ) संपूर्ण भारत (India) आजही ज्या गोष्टींचा अभिमान बाळगतो त्यामधलीच ही एक गोष्ट. तेव्हा संपूर्ण जगालाच काय भारताला देखील ही आशा नव्हती की त्या विश्वचषकावर भारताचं नाव कोरलं जाईल. पण या सगळ्यामध्ये भारतासाठी खऱ्या अर्थाने तो देव ठरला होता. तो म्हणजे भारतीय संघाचा माजी कर्णधार कपिल देव. खरंतर कपिल देव यांच्या खेळीचा भारताच्या या यशामध्ये अगदी मोलाचा वाटा आहे असं म्हटलं तरी वावगं ठरणार नाही. कपिल देव यांनी क्रिकेटच्या इतिहासात विक्रम रचला होता. समोर झिम्बाबेसारखा संघ. खरंतर त्या काळी झिम्बाबे संघांचं देखील क्रिकेटमध्ये चांगलचं वजन होतं. पण त्यादिवशी कपिल देव यांनी झिम्बाबेच्या खेळाडूंना धू-धू धुतलं आणि भारतीय किक्रेट संघांचं नाव जगाच्या यादीत कोरलं गेलं. भारतीय क्रिकेट संघाचे कर्णधार कपिल देव यांनी 175 धावांचा ऐतिहासिक खेळी केली होती आणि त्यानंतर तो क्षण भारतीय क्रिकेटच्या इतिहासात सुवर्ण अक्षरांनी कोरला गेला. या दिवशी कपिल देव हे एकदिवसीय सामन्यामध्ये 100 धावांची खेळी खेळणारे पहिले भारतीय क्रिकेटपटू ठरले होते. झिम्बाबेचा सामना जिंकणं भारतासाठी महत्त्वाचं होतं खरंतर ती भारतासाठी करो या मरो ची खेळी होती. अगदी 17 धावा करुन भारताचा निम्मा संघ माघारी फिरला होता. त्यामुळे भारतीयाचं विश्वचषक जिंकण्याचं स्वप्न आताही अपूर्णच राहणार असाच सगळ्यांचा समज झाला होता. पण त्यावेळी कर्णधार कपिल देव यांनी अगदी संयमाने खेळी केली आणि त्यांना मोलाची साथ मिळाली ते रॉजर बिन्नी याची. या जोडीने 48 चेंडूमध्ये 22 धावांची भागिदारी केली. त्यावेळी कपील देव यांनी 138 धावांमध्ये 175 धावा केल्या. भारताने झिम्बाबे समोर 267 धावांचं आव्हान ठेवलं आणि 31 धावांनी झिम्बाबेवर विजय मिळवला. त्यामुळे विश्वचषकाच्या दिशेने भारताचा महत्त्वपूर्ण प्रवास सुरु झाला होता. आणि भारतासमोर इंग्लंडचं आव्हान भारतानं झिम्बाबेवर मात करून उपांत्य फेरीत प्रवेश मिळवला होता. इंग्लंडसोबत 22 जून रोजी भारतीय संघ उपात्यं फेरीचा सामना खेळत होता. इंग्लंडने नाणेफेक जिंकली आणि फलंदाजी करण्याचा निर्णय घेतला होता. तेव्हा इंग्लंडने चक्क 60 षटकांमध्ये 213 धावा केल्या होत्या. त्यादिवशी देखील कपिल देव यांच्या कामगिरीमुळे भारतीयांच्या हृदयात कोरणार तो दिवस ठरला. कपिल देव यांनी 3 विकेट्स घेत संघाला विजयाच्या दिशेने नेलं. त्यांना संघातील इतर खेळाडूंची देखील तितकीच मोलाची साथ मिळाली. त्या खेळात भारताने अवघ्या काही षटकात विजय मिळवला होता. भारताच्या फलदांनी जोरदार कामगिरी करत अंतिम फेरीत दमदार प्रवेश मिळवला होता. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); एक झेल आणि भारताचा ऐतिहासिक क्षण भारतासमोर विडींज आव्हान. खरंतर भारत अंतिम फेरीत पोहचला हिच भारतीयांसाठी खूप महत्त्वाची गोष्ट होती. लॉर्ड्सच्या मैदावर भारताच्या सुपुत्रांनी सुवर्णक्षण घडवला होता. विश्वचषकात तोपर्यंत फक्त वेस्ट इंडिजनेच दोनदा विश्वकप जिंकून क्रिकेटच्या विश्वात आपलं स्थान मजबूत केलं होतं. परंतु त्यानंतर भारताने त्यांचं सलग तिसऱ्यांदा विश्वविजेता होण्याचं स्वप्न मात्र अपूर्णच ठेवलं. वेस्ट इंडिजच्या संघाला अवघ्या 183 धावांचं लक्ष दिलं होतं आणि 140 धावांमध्ये भारताच्या शिलेदारांनी तो डाव गुंडाळला होता. जगातील फलंदाजांच्या यादीमध्ये मानाचं स्थान असलेले विवियन रिचर्ड्स मैदानावर होते. तुफान फटकेबाजी लॉर्ड्सच्या मैदानावर सुरु होती आणि त्या एका झेलाने संपूर्ण डावच पालटला. विवियन रिचर्ड्स यांनी एक जोरदार शॉट मारला आणि कपील देव यांनी दूरचं अंतर गाठत चेंडू झेलला. त्या दिवसाचं भारतीय क्रिकेटविश्वातच नाही तर प्रत्येक भारतीयाच्या मनात मानाचं आणि आदराचं स्थान आहे. आज त्या ऐतिहासिक दिवसाला 40 वर्ष पूर्ण होत आहेत. पण आजही प्रत्येक भारतीयांच्या मनात तो क्षण जशाच्या तसा आहे. महत्त्वाच्या इतर बातम्या : 1983 World Cup Win : भारताच्या ऐतिहासिक कामगिरीला 40 वर्ष पूर्ण! आजच्या दिवशी विश्वचषक उंचावून रचला होता इतिहास","pubDate":"2023-06-25 18:19:34","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/f7597f17f5c0abe6288819f3839376231687671124260689_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Marathi"}]}