{"newsArray":[{"title":"‘Very disappointed’: Gutted Zampa fires shot at selectors over ‘last minute’ Test tease","link":"https://www.foxsports.com.au/cricket/australia/cricket-australia-2023-tour-of-india-test-squad-bbl-news-adam-zampa-gutted-over-spin-snub/news-story/b50b81e8dee74e310ede38c8372d8d23","keywords":null,"creator":null,"video_url":null,"description":"Having been told he was “close” to selection for the Test tour of India dejected spinner Adam Zampa has fired a shot across the bow of selectors, and is unsure if he’ll keep playing red ball cricket.","content":null,"pubDate":"2023-01-14 00:03:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Broke my heart’: Langer reveals cricket ‘killer’ that could end coaching career forever","link":"https://www.foxsports.com.au/cricket/australia/cricket-australia-2023-bbl-news-justin-langer-may-never-coach-again/news-story/195cfaba3c5e4f30c72dfade3b61d6c7","keywords":null,"creator":null,"video_url":null,"description":"Justin Langer says he may never coach again following his acrimonious exit from Cricket Australia.","content":null,"pubDate":"2023-01-13 23:19:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: New documentary captures Australian dressing room blow-ups","link":"https://www.newstalkzb.co.nz/news/sport/cricket-new-documentary-captures-australian-dressing-room-blow-ups/","keywords":null,"creator":null,"video_url":null,"description":"Australia’s 2016 test tour of Sri Lanka was a disaster. Steve Smith’s comrades were comprehensively outclassed by Sri Lanka’s talented spinners in the subcontinent, defeated 3-0 in a debilitating series whitewash. In Amazon Prime Video’s documentary series The Test, the second season of which dropped on Friday, veteran opener David Warner was asked to reflect on the tour, where he scored 163 runs at 27.16. He rolled his eyes and muttered: “F***ing s***. “Memories were horrible. I was getting beaten on both sides of the bat with the spinning ball.” Usman Khawaja was also queried about the 2016 series, during which he was dropped from the side after four failures with the bat. “2016 tour, what tour?” Khawaja joked. “Some tours give you nightmares.” He physically shuddered while reminiscing. Six years later, Australia returned to Sri Lanka amid an economic crisis to defend the Warne-Muralitharan Trophy in a two-Test series. Both matches of the 2022 tour were scheduled to take place at Galle International Stadium, where Australia had been rolled for 106 and 183 during their previous visit. Australia’s spinners bowled superbly on day one of the series opener, with Nathan Lyon and Mitchell Swepson collectively taking eight wickets to topple the hosts for 212 — but the batters knew the challenge that awaited them. Sri Lanka had picked three strike spinners for the match, and the Galle pitch was a verified raging turner — Lyon’s first delivery of the series struck wicketkeeper Alex Carey between the eyes. Warner was the first to depart, trapped on the pads by off-spinner Ramesh Mendis after a straight delivery beat his inside edge. “The f*** do you keep missing those?” he yelled after returning to the sheds, slamming the fridge door shut while retrieving a bottle of water. But after struggling to twist the plastic cap, Warner chucked the water bottle across the room in disgust and bellowed: “Can’t open the f***ing things!” Australian No. 3 Marnus Labuschagne, playing his first Test innings in Sri Lanka, fell cheaply after he attempted a reverse sweep against Mendis, picking out the point fielder. “Any freaking danger?” Labuschagne muttered after entering the changerooms. “Freaking hell do you pick out the one, you freaking s***?” Australia's Usman Khawaja. Photo / Photosport But the worst was to come for Australia. Smith missed a leg glance while facing Mendis in the 20th over, prompting the Sri Lankans to appeal for LBW. Amid the confusion, Smith and Khawaja began scampering through for a single, only for Khawaja to send his partner back with both batters stranded in the middle of the pitch. Smith spun around and sprinted to make his ground, desperately diving for the crease — but he was run out. Australia’s best batter was gone for 6. Smith returned to his feet with his white shirt covered in dirt, throwing his hands in the air and shaking his head in disbelief. He was absolutely livid. “F***ing run, you ***,” Smith screamed after entering the sheds. “F***ing smart getting run out on a f***ing wicket like that, that’s good. “F*** me.” The horrendous run out came after an uncharacteristically quiet couple of years for Smith in the Test arena, mustering just one century from his previous 18 matches. His Test batting average of 39.51 during that period was hardly cause for concern, but it was considerably less than what Australian cricket fans had come to expect from him. “It wasn’t ideal,” Smith said of the run out on The Test. “It was a difficult surface, and given I’m probably the most experienced player on those conditions, getting out without being challenged by the bowler probably took me a little longer to get over.” Australia was saved by Khawaja and young all-rounder Cameron Green, who scored 71 and 77 respectively to help the visitors register 321 in the first innings. The pitch had deteriorated quickly over the course of 48 hours, with Sri Lanka rolled for just 113 in the second innings, all 10 wickets falling to spin. Australia had retained the Warne-Muralitharan Trophy. Redemption was complete.","content":"Australia’s 2016 test tour of Sri Lanka was a disaster. Steve Smith’s comrades were comprehensively outclassed by Sri Lanka’s talented spinners in the subcontinent, defeated 3-0 in a debilitating series whitewash. In Amazon Prime Video’s documentary series The Test, the second season of which dropped on Friday, veteran opener David Warner was asked to reflect on the tour, where he scored 163 runs at 27.16. He rolled his eyes and muttered: “F***ing s***. “Memories were horrible. I was getting beaten on both sides of the bat with the spinning ball.” Usman Khawaja was also queried about the 2016 series, during which he was dropped from the side after four failures with the bat. “2016 tour, what tour?” Khawaja joked. “Some tours give you nightmares.” He physically shuddered while reminiscing. Six years later, Australia returned to Sri Lanka amid an economic crisis to defend the Warne-Muralitharan Trophy in a two-Test series. Both matches of the 2022 tour were scheduled to take place at Galle International Stadium, where Australia had been rolled for 106 and 183 during their previous visit. Australia’s spinners bowled superbly on day one of the series opener, with Nathan Lyon and Mitchell Swepson collectively taking eight wickets to topple the hosts for 212 — but the batters knew the challenge that awaited them. Sri Lanka had picked three strike spinners for the match, and the Galle pitch was a verified raging turner — Lyon’s first delivery of the series struck wicketkeeper Alex Carey between the eyes. Warner was the first to depart, trapped on the pads by off-spinner Ramesh Mendis after a straight delivery beat his inside edge. “The f*** do you keep missing those?” he yelled after returning to the sheds, slamming the fridge door shut while retrieving a bottle of water. But after struggling to twist the plastic cap, Warner chucked the water bottle across the room in disgust and bellowed: “Can’t open the f***ing things!” Australian No. 3 Marnus Labuschagne, playing his first Test innings in Sri Lanka, fell cheaply after he attempted a reverse sweep against Mendis, picking out the point fielder. “Any freaking danger?” Labuschagne muttered after entering the changerooms. “Freaking hell do you pick out the one, you freaking s***?” But the worst was to come for Australia. Smith missed a leg glance while facing Mendis in the 20th over, prompting the Sri Lankans to appeal for LBW. Amid the confusion, Smith and Khawaja began scampering through for a single, only for Khawaja to send his partner back with both batters stranded in the middle of the pitch. Smith spun around and sprinted to make his ground, desperately diving for the crease — but he was run out. Australia’s best batter was gone for 6. Smith returned to his feet with his white shirt covered in dirt, throwing his hands in the air and shaking his head in disbelief. He was absolutely livid. “F***ing run, you ***,” Smith screamed after entering the sheds. “F***ing smart getting run out on a f***ing wicket like that, that’s good. “F*** me.” The horrendous run out came after an uncharacteristically quiet couple of years for Smith in the Test arena, mustering just one century from his previous 18 matches. His Test batting average of 39.51 during that period was hardly cause for concern, but it was considerably less than what Australian cricket fans had come to expect from him. “It wasn’t ideal,” Smith said of the run out on The Test. “It was a difficult surface, and given I’m probably the most experienced player on those conditions, getting out without being challenged by the bowler probably took me a little longer to get over.” Australia was saved by Khawaja and young all-rounder Cameron Green, who scored 71 and 77 respectively to help the visitors register 321 in the first innings. The pitch had deteriorated quickly over the course of 48 hours, with Sri Lanka rolled for just 113 in the second innings, all 10 wickets falling to spin. Australia had retained the Warne-Muralitharan Trophy. Redemption was complete.","pubDate":"2023-01-13 23:07:26","image_url":"https://www.newstalkzb.co.nz/media/dgsgwxss/australian-stars-steve-smith-l-and-david-warner-r-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"How a ‘broken heart’ sealed Langer’s future","link":"https://www.themercury.com.au/sport/cricket/former-australia-coach-justin-langers-bombshell-coaching-call-after-tumultuous-test-team-exit/news-story/7878ccc86ddfb5736ae0cd4b973bb426","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Justin Langer has declared he is unlikely to ever coach again.","content":"The man who has lived and breathed international cricket for 30 years doesn’t believe he will ever return to the coalface after the scarring impact his demise as Australian coach has left on him and his family.It is a striking admission from a great of the game who until recently viewed himself as a career coach.Langer was at his emotional and engaging best when he appeared in front of a live audience to record the Cricket Etc. Podcast with esteemed The Australian cricket writers Peter Lalor and Gideon Haigh on the eve of the Sydney Test.For the sake of his family, a broken hearted Langer doesn’t believe he will ever return to coaching in any capacity, despite being just 52 years of age.“I don’t think I’ll coach again. No, I don’t think I’ll coach again,” Langer told Cricket Etc.“The craziness is – and it’s really strange in cricket – if you think about a lot of the other codes, the best coaches are a lot older. It doesn’t make sense in cricket.“I say I’m not going to coach again, but I reckon I’m 10 years off being the best coach I could be. I honestly reckon – because things don’t shock you, things don’t surprise you (the more experienced you get).”Within weeks of getting ousted as Australian coach, Langer had a call from England Cricket Board chief Andrew Strauss to probe his interest in coaching England.Langer could have taken a post coaching the Hobart Hurricanes in the Big Bash League this summer if he wanted it, but he was not mentally ready.Put AwayThere was always a feeling that Langer would eventually recalibrate and return to the career that runs through his veins and that he’s dedicated himself to since his retirement as a player.Langer excelled as a domestic coach at Western Australia and the Perth Scorchers and even if his life as an international coach was done after his exit from the Australian team – lower levels of the game will be poorer for a man of his passion and dedication not being involved.Unlike previous podcast interviews he has given, there was no sense of bitterness or being unable to let go in Langer’s chat with Lalor and Haigh.But the scale of Langer’s own personal trauma, and the toll it took on his family, was laid bare.“The hardest thing about my last 12 months, and I say it hand on heart, was there was this narrative that I hated the players or the players hated me back. That literally broke my heart,” Langer said.“Everything I’ve done for literally the whole time – when I was in Western Australia coaching the Scorchers, when I was with Phil Hughes when I first started and with Steve Smith, I came up with them as kids (when I was) an assistant coach (was because I loved the players)“Some of the players may not have liked my style. I am serious, I can be intense. But they know how much I loved them and they loved me back.“I kept reading this narrative and it literally broke my heart.“That’s why when you ask if I’ll be a better coach next time, for my family I am not sure I can go through that again.”Langer refutes claims he has fallen out with the current Australian playing group.“I’ve got some very, very special relationships,” Langer said.“If you had listened to the media over the last 12 months I had no relationships with the players, but it literally could not be further from the truth. I’ve got a lot of very tight bonds with the players and I cherish them for the rest of my life.“ … Most of my players I’ve coached in the last 12 years, they feel like my sons.“I don’t have the same relationships with all of them.”Langer is a warts and all, heart on the sleeve coach who gave every part of himself to Australian cricket.It’s clear he doesn’t believe he is ready to be that vulnerable again after the fallout of the past 12 months.“Every time I read it now they don’t talk about my results as coach, they just talk about the coach who fell out with his players and that kills me,” Langer said.“I’m sure a lot of people in this room are parents. I am absolutely certain my four daughters … a lot of the times they thought they didn’t agree with my decisions, (but) I’m keeping them accountable, I’m making sure I’m keeping them safe, I’m looking after them and I have their best interests at heart.“My kids love me unconditionally. As a coach sometimes you have to do that. You’ve got to pull them into line. You have to have the bigger picture in mind.“Some people aren’t going to like that and because they’re not your kids they’re going to say ‘well he’s disposable’.“That’s fine. That’s life. But that’s the killer.”","pubDate":"2023-01-13 21:56:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Australia’s selection is biased’: Usman Khawaja Cites Racism in CA Selection","link":"https://kashmirreader.com/2023/01/14/australias-selection-is-biased-usman-khawaja-cites-racism-in-ca-selection/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Sydney: “There’s subconscious bias”, Australian red-ball opener Usman Khawaja has accused Cricket Australia of being biased in their selections. The left-hander is the only South Asian-born player in the history of Australian cricket to represent the country in Tests. Speaking to Sydney Morning Herald, Khawaja revealed how he did not support the Australian side growing […]","content":"Sydney: “There’s subconscious bias”, Australian red-ball opener Usman Khawaja has accused Cricket Australia of being biased in their selections. The left-hander is the only South Asian-born player in the history of Australian cricket to represent the country in Tests. Speaking to Sydney Morning Herald, Khawaja revealed how he did not support the Australian side growing up until he was about 14-15 years. The 36-year-old claimed that the racial landscape in the country has not changed a bit in the last 10 years. “That’s where I’m trying to work with Cricket Australia saying, ‘Look, guys … you invest a lot of money into this, but something’s not going right. You’ve been doing it for 10 years and nothing’s changed,” Khawaja said. When asked about where might the root of the problem be, Khawaja responded by saying, “There’s subconscious bias. If you have two cricketers, one brown, one white, both the same, the white coach is going to pick the white cricketer just because he has a son that might look similar to him. It’s what’s familiar to him.” Khawaja was born in Pakistan and moved to Sydney at a young age. Khawaja has played in 56 tests, 40 ODIs and 9 T20Is in his career for Australia. Made his international debut way back in 2011 in Sydney at number three in an Ashes test match as a replacement for injured Ricky Ponting. Despite being an established Australian international, Khawaja claims that he has been stopped regularly by security for getting his credentials checked in the middle of the series. On Christmas day last year, Khawaja took to Twitter about the incident he experienced and wrote “I got stopped 3 times last year at our hotel, while in Australian kit and asked if I was with the Australian Cricket team…” Khawaja has scored 1080 runs at an average of 67.50 in the 2022 calendar year. According to the The Sydney Morning Herald report, in one episode of the second season of the Amazon Prime Video series The Test, which is to be released on January 13, Khawaja is seen visiting a Muslim school in Brisbane, sharing his experiences of racism and helping to inspire students to give cricket a go. The Australian cricket team’s journey of redemption from the ball-tampering scandal to a successful defence of the Ashes was turned into the docu-series, which included unseen dressing room footage. The Season 1 of the eight-part series titled ‘The Test: A New Era for Australia’s Team’, featured behind-the-scenes footage of Australia’s first-ever Test series loss to India on home soil, the World Cup semifinal exit and the Ashes defence after that. —Agencies   KR Desk","pubDate":"2023-01-13 20:01:21","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Ethics Officer dismisses ‘Conflict of Interest’ complaint against BCCI prez","link":"https://kashmirreader.com/2023/01/14/ethics-officer-dismisses-conflict-of-interest-complaint-against-bcci-prez/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: The BCCI Ethics Officer Justice (Retd) Vineet Saran has “dismissed” the ‘Conflict of Interest’ case filed against BCCI president Roger Binny, stating that complainant Sanjeev Gupta’s claims were devoid of any “merit”. Gupta’s contention in his complaint was that 1983 World Cup hero’s daughter-in-law Mayanti Langer Binny working for Star Sports as an […]","content":"New Delhi: The BCCI Ethics Officer Justice (Retd) Vineet Saran has “dismissed” the ‘Conflict of Interest’ case filed against BCCI president Roger Binny, stating that complainant Sanjeev Gupta’s claims were devoid of any “merit”. Gupta’s contention in his complaint was that 1983 World Cup hero’s daughter-in-law Mayanti Langer Binny working for Star Sports as an anchor amounts to having a contract with the BCCI and thus is a Conflict of Interest. Star Sports is the official broadcaster of Indian Premier League as well as Indian national team’s home games along with all ICC events. Gupta, a former Apex Council member of Madhya Pradesh Cricket Association (MPCA), has been filing complaints against who’s who of Indian cricket including Sachin Tendulkar, Rahul Dravid, Sourav Ganguly, VVS Laxman, Virat Kohli to name a few. Justice Saran in his 11-page 20-point report has summarily rejected Gupta’s complaint and also issued him a stern warning to not share complaint related documents with “unrelated parties”. Gupta has had a habit of mailing all his documents to hundreds of journalists, present and ex BCCI officials. In the verdict uploaded on bcci.tv, Saran stated: “It is not the case of the complainant (Gupta) that Ms Langer is involved in sales, marketing, business or management of Star Sports. “She is hosting live broadcasts and panels for Star Sports. The fact that media rights for BCCI and IPL were awarded to Star Sports on 5.4.2018 and 27.06.2022 is also not disputed. “Hence it cannot be said, as the President, the respondent (Binny) has influenced the engagement of his daughter in law in Star Sports. Ms Langer is not an employee of Star Sports and is only working on contract with Star Sports as an anchor. “In the absence of any instance of Conflict of Interest having been cited in her working in such capacity with Star Sports, it cannot be presumed that there will be any Conflict of Interest.” In fact Saran also categorically mentioned that a “mere relationship” (father-in-law and daughter-in law) between respondent (Binny) and Langer would not be sufficient enough to establish an instance of Conflict of Interest. Justice Saran also issued a “stern warning” to Gupta so that he doesn’t “voluntarily place complaints and other documents in public domain and he should send the copies of same only to parties concerned”. PTI   Press Trust of Indiakashmirreader.com","pubDate":"2023-01-13 20:00:48","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Glenn Phillips leads Black Caps to ODI series victory over Pakistan","link":"https://www.nzherald.co.nz/sport/live-cricket-updates-black-caps-v-pakistan-final-odi/3NNHCVX76NFABFUHAS6NCKFI5I/","keywords":null,"creator":null,"video_url":null,"description":"An upset stomach and injured knee didn't stop the T20 star from securing a maiden ODI 50.","content":null,"pubDate":"2023-01-13 18:39:31","image_url":"https://www.nzherald.co.nz/resizer/7hVJUZ2QjPNdKPkWtIPMP8un-gM=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/QF3LH6TWI5CP3KRZGQYPVEAGNY.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Cricket-Phillips fires New Zealand to ODI series win over Pakistan","link":"https://www.thestar.com.my/sport/cricket/2023/01/14/cricket-phillips-fires-new-zealand-to-odi-series-win-over-pakistan","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Glenn Phillips smashed a quickfire half century to guide New Zealand to a two-wicket victory over Pakistan in the third one-day international in Karachi on Friday and clinch the series 2-1. Read full story","content":null,"pubDate":"2023-01-13 18:04:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/14/1901351.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-Rohit, Kohli to miss T20s v NZ, Suryakumar, Kishan in test squad","link":"https://www.thestar.com.my/sport/cricket/2023/01/14/cricket-rohit-kohli-to-miss-t20s-v-nz-suryakumar-kishan-in-test-squad","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Indian captain Rohit Sharma and batsman Virat Kohli will play in a one-day international (ODI) series against New Zealand this month but will not feature in the following Twenty20 series, the Board of Control for Cricket in India (BCCI) said on Friday. Read full story","content":null,"pubDate":"2023-01-13 17:39:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/14/1901349.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Tragedy in domestic cricket: Young Himachal Pradesh Ranji seamer Sidharth Sharma dies after brief illness","link":"https://economictimes.indiatimes.com/news/sports/tragedy-in-domestic-cricket-young-himachal-pradesh-ranji-seamer-sidharth-sharma-dies-after-brief-illness/articleshow/96973715.cms","keywords":null,"creator":null,"video_url":null,"description":"Tragedy struck India's domestic cricket as young Himachal Pradesh seam bowler Sidharth Sharma died in a Vadodara hospital after a brief illness, confirmed a senior official of Himachal Pradesh Cricket Association (HPCA).","content":null,"pubDate":"2023-01-13 16:23:32","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-36698,resizemode-4,msid-96973715/tragedy-in-domestic-cricket-young-himachal-pradesh-ranji-seamer-sidharth-sharma-dies-after-brief-illness.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes net worth in INR: Ben Stokes brand endorsements full list","link":"https://thesportsrush.com/ben-stokes-net-worth-in-inr-ben-stokes-brand-endorsements-full-list/","keywords":["Cricket","Ben Stokes"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Born in New Zealand, all-rounder Ben Stokes is the captain of the England test team. It is quite interesting that England won their first ODI world cup in 2019, where Stokes played an important part in beating his birth country New Zealand. He was also nominated for the New Zealander of the year award in… The post Ben Stokes net worth in INR: Ben Stokes brand endorsements full list appeared first on The SportsRush.","content":"Born in New Zealand, all-rounder Ben Stokes is the captain of the England test team. It is quite interesting that England won their first ODI world cup in 2019, where Stokes played an important part in beating his birth country New Zealand. He was also nominated for the New Zealander of the year award in 2019. Stokes had quite a rough year in 2021, where he first got injured and then faced multiple weeks on the sidelines because of his mental well-being. He finally made his return in the Ashes 2021-22, but the major turnaround for him came in 2022 when he was appointed the captain of England’s test team. Under Stokes, the English team had a perfect home test summer where they did not lose a single series. England even won the T20 World Cup 2022 in Australia, and it was Stokes’ first T20 tournament after a long span. Ben Stokes net worth in INR Ben Stokes is certainly one of the most popular cricketers in the world, and according to CAKnowledge, his net worth is around $13 million, which is around 105 crores INR. This is certainly a very huge amount and most of his money comes from his cricket salary and brand endorsements. ALSO READ: Was Ben Stokes’ father a rugby player? Stokes recently gave his name in the IPL 2023 auction, where he was bought by Chennai Super Kings for a price of INR 16.25 crores. He was part of Rajasthan Royals and Rising Pune Supergiants in the past. ECB is one of the highest-paying boards, and Stokes has a central contract, plus he is also the captain of the side. Stokes owns a lot of real estate properties in the United Kingdom, plus he has a collection of luxury cars as well. He owns a Mercedes GT63, Range Rover, Audi, etc. He is quite popular on social media platforms and that’s why he is in demand amongst the brands. Ben Stokes brand endorsements full list Ben Stokes endorses some popular brands like Adidas, Red Bull, Dream 11, Royal Stag, GM (Gun & Moore), London Pilsner, Seaham Hall, etc. He earns a major chunk of money from these brand endorsements as well. The post Ben Stokes net worth in INR: Ben Stokes brand endorsements full list appeared first on The SportsRush.","pubDate":"2023-01-13 16:00:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"SA20 2023: Match 5, CT vs DUR Match Prediction – Who will win today’s SA20 match between CT vs DUR? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9zYTIwLTIwMjMtbWF0Y2gtNS1jdC12cy1kdXItbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLXNhMjAtbWF0Y2gtYmV0d2Vlbi1jdC12cy1kdXIv0gGaAWh0dHBzOi8vd3d3LmNyaWN0cmFja2VyLmNvbS9jcmlja2V0LW1hdGNoLXByZWRpY3Rpb25zL3NhMjAtMjAyMy1tYXRjaC01LWN0LXZzLWR1ci1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtc2EyMC1tYXRjaC1iZXR3ZWVuLWN0LXZzLWR1ci8_YW1wPTE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SA20 2023: Match 5, CT vs DUR Match Prediction – Who will win today’s SA20 match between CT vs DUR?  CricTrackerPRL vs JOH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- SA T20 League  Cricket AddictorCT vs DUR Dream11 Team Prediction: MI Cape Town vs Durban’s Super Giants Check Captain, Vice-Captain, and P  News18Joburg Super Kings spoil Durban's Super Giants' Kingsmead party  East Coast RadioPRL vs JOH, SA20 2023, Match 4: Best memes from the game  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2023-01-13 13:45:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Curry Muncher\": Usman Khawaja Gives Shocking Details Of Racial Discrimination He Faced - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvY3VycnktbXVuY2hlci11c21hbi1raGF3YWphLWdpdmVzLXNob2NraW5nLWRldGFpbHMtb2YtcmFjaWFsLWRpc2NyaW1pbmF0aW9uLWhlLWZhY2VkLTM2ODk1MDLSAYIBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9jdXJyeS1tdW5jaGVyLXVzbWFuLWtoYXdhamEtZ2l2ZXMtc2hvY2tpbmctZGV0YWlscy1vZi1yYWNpYWwtZGlzY3JpbWluYXRpb24taGUtZmFjZWQtMzY4OTUwMi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Curry Muncher\": Usman Khawaja Gives Shocking Details Of Racial Discrimination He Faced  NDTV Sports'There's subconscious bias' - Usman Khawaja reveals how racial bias still largely impacts cricket in Australia  CricTrackerUsman Khawaja on racial bias in selection: ‘They’ll pick the white guy’  Sportstar‘There’s subconscious bias’: Usman Khawaja accuses Cricket Australia of being biased in their selections  The Indian ExpressUsman Khawaja did not support Australia as a kid - and confirms RACIAL bias in cricket  Daily MailView Full coverage on Google News","content":null,"pubDate":"2023-01-13 13:43:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Don’t want to miss out on the team bus with teammates one last time: Dhoni’s meltdown before retirement","link":"https://thenewsglory.com/dont-want-to-miss-out-on-the-team-bus-with-teammates-one-last-time-dhonis-meltdown-before-retirement/","keywords":["Sports","Cricket","Dhoni","Dhoni melting","game","India","Indian cricketer","MS Dhoni","Rishabh Pant"],"creator":["The News Glory"],"video_url":null,"description":"The 2019 ICC World Cup cricket series held in England was a series that brought disaster and shock to Indian cricket and fans. Yes, that was the day Dhoni hinted to Rishabh Pant that he would retire with the semi-final against New Zealand. India restricted New Zealand to 239 runs in that match in July. […]","content":"The 2019 ICC World Cup cricket series held in England was a series that brought disaster and shock to Indian cricket and fans. Yes, that was the day Dhoni hinted to Rishabh Pant that he would retire with the semi-final against New Zealand. India restricted New Zealand to 239 runs in that match in July. Bhuvneshwar Kumar scored 43 runs in 10 overs and took 3 wickets. Bumrah and Jadeja bowled sparingly, Sahal gave away 63 runs in 10 overs and Hardik Pandya gave away 55 runs in 10 overs. The Indian team got off to a poor start when chasing the target. Rahul, Rohit Sharma and Virat Kohli scored just 1 run and lost their wickets to Matt Henry and Trent Boult. Dinesh Karthik lost his wicket for 6 runs. India scored only 24 runs for the loss of 4 wickets. Then Rishabh Pant (32 runs) and Hardik Pandya (32 runs) added some stability and raised the score to 71 runs when Sandner dismissed them both. Both slogged the ball badly ‘across the line’ and were caught out. All-time finishers Dhoni and Jadeja were in charge of India at 92 for 6. Jadeja played a counter-attacking innings, Dhoni supported him brilliantly with singles and twos and rotated the strike. Together they scored 116 runs in 17 overs. Jadeja scored 77 runs off 59 balls with 4 fours and 4 sixes before catching Bolt’s slow ball in the air. The game was now only in Dhoni’s hands. But Dhoni, who scored 50 runs in the very next over, hit the ball towards square and ran fast for the 2nd run. But that’s where Dhoni stretched to hit a brilliant throw straight at the stumps by Martin Guptill. But he was dismissed to be out by an inch. India were then at 216 for the loss of 8 wickets. All out for 221 runs and lost miserably. Apart from the loss, the announcement that it was Dhoni’s last ODI also came as a shock to the fans. Dhoni was run out in his debut ODI and was run out in his last ODI. India’s former fielding coach Sridhar Tannudaya wrote in his book “Coaching Beyond: My Days with the Indian Cricket Team” that Dhoni had taken the decision to retire before the match, when Dhoni hinted at Rishabh Pant’s decision to retire. “I was making myself a cup of coffee. Then Dhoni and Rishabh Pant came in and joined me at the table. There were only 2 overs left in the New Zealand innings. After that we have to chase the target. So it was clear that the match would end early. Then Rishabh Pant told Dhoni in Hindi, “Some players have decided to go to London alone today. Are you also interested in internet?” To which Dhoni replied, “No Rishabh Pant, I am not coming. “I don’t want to miss the opportunity to go on the team bus with my teammates one last time,” he said. In the book, former fielding coach Sridhar said that even though he knew that Dhoni had hinted at his retirement, he did not share this with anyone.","pubDate":"2023-01-13 13:29:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Duckett reflects on first England hundred as \"the worst I'll feel on cricket pitch\"","link":"https://www.mirror.co.uk/sport/cricket/england-ben-duckett-pakistan-hundred-28946852","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Ben Duckett earned an England recall against Pakistan after six years away from the Test team and scored a stunning century in his first innings back while battling an illness","content":null,"pubDate":"2023-01-13 13:23:22","image_url":"https://i2-prod.mirror.co.uk/incoming/article28626252.ece/ALTERNATES/s615/0_GettyImages-1445947627.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"MICT vs DSG Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s SA20 Match No. 5 MICT vs DSG in Newlands, Cape Town, 9PM IST, January 13","link":"https://zeenews.india.com/cricket/mict-vs-dsg-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-sa20-match-no-5-mict-vs-dsg-in-newlands-cape-town-9pm-ist-january-13-2561258.html","keywords":null,"creator":null,"video_url":null,"description":"MI Cape Town vs Durban Super Giants Dream11 Team Prediction MI Cape Town vs Durban Super Giants SA20 match No. 5 Preview - Check My Dream11 Team, Best players list of MICT vs DSG, MI Cape Town Dream11 Team Player List, Durban Super Giants Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2023-01-13 13:22:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Scorchers crush Thunder to consolidate lead at top of table | KFC BBL|12 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9RDc3N24xZkdNb1XSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Scorchers crush Thunder to consolidate lead at top of table | KFC BBL|12  cricket.com.auTHU vs SCO Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- KFC Big Bash League  Cricket AddictorBBL 2022-23: Match 39, THU vs SCO Match Prediction – Who will win today’s BBL match between Sydney Thunder and Perth Scorchers?  CricTrackerBBL12 Match 39: Perth Scorchers impress with bat and ball  Cricket WorldScorchers extend dominance with clinical win against Thunder | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-01-13 12:55:02","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC.TV and Sky Sports to broadcast the inaugural ICC U19 Women’s T20 World Cup in Ireland &amp; UK","link":"https://www.cricketireland.ie/news/article/icc.tv-and-sky-sports-to-broadcast-the-inaugural-icc-u19-womens-t20-world-c","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – The International Cricket Council (ICC) today announced the details of its broadcast arrangements for all 41 matches of the inaugural ICC U19 Women’s T20 World Cup 2023.","content":null,"pubDate":"2023-01-13 12:51:33","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"“Ravi Shastri says wicketkeeper should respect Dhoni” – Ex-fielding coach Sridhar shared","link":"https://thenewsglory.com/ravi-shastri-says-wicketkeeper-should-respect-dhoni-ex-fielding-coach-sridhar-shared/","keywords":["Sports","Cricket","Dhoni","Fielding coach","Goalie","India","Indian cricketers","Kohli","MS Dhoni","online special","Ravi Shastri","Sridhar","Team India","Virat Kohli"],"creator":["The News Glory"],"video_url":null,"description":"Bengaluru: Sridhar, the team’s former fielding coach, said that Ravi Shastri, the former coach of the Indian team, had once told Kohli that he should give respect to the former captain of the Indian team. He has said this in his book ‘Coaching Beyond – My days with the Indian cricket team’. Mahendra Singh Dhoni […]","content":"Bengaluru: Sridhar, the team’s former fielding coach, said that Ravi Shastri, the former coach of the Indian team, had once told Kohli that he should give respect to the former captain of the Indian team. He has said this in his book ‘Coaching Beyond – My days with the Indian cricket team’. Mahendra Singh Dhoni is the only captain in the world of cricket who has won the trophy in all three series conducted by ICC namely T20 World Cup, ODI World Cup and Champions Trophy. Kohli led the Indian team after him. First he led the Indian Test team. Later he started guiding the T20 and ODI cricket teams. But Kohli Shorter, who led the Test team, had to wait for some time to act as captain in Parmet cricket. Sridhar says in his book that he was very keen to take on the responsibility in the interim. \rSridhar with Dhoni\r “Koli was very keen to lead the T20 and ODI team in 2016. He had shared some things then. It showed his passion for the role. It was then that coach Ravi Shastri called Kohli one evening. ‘Look here Virat. It was Dhoni who gave you the Test cricket captaincy. You must respect him. He will also give you the responsibility of Shorter Parmet Captain in due course. Until then you have to give him credit. Otherwise it will be difficult for your teammates to respect you tomorrow. You don’t run after it. Ravi Shastri had said that it will come looking for you,” Sridhar said in his book. It is noteworthy that Dhoni played in the 2017 Champions Trophy and 2019 ODI World Cup series in the Kohli-led Indian team. Kohli used to consult Dhoni when making TRS decisions.","pubDate":"2023-01-13 12:28:44","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs NZ: “When The Vice-captain Is Benched...”- Ramiz Raja Mocks Pakistan Cricket Team - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMie2h0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0LW5ld3MvcGFrLXZzLW56LXdoZW4tdGhlLXZpY2UtY2FwdGFpbi1pcy1iZW5jaGVkLXJhbWl6LXJhamEtbW9ja3MtcGFraXN0YW4tY3JpY2tldC10ZWFtL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: “When The Vice-captain Is Benched...”- Ramiz Raja Mocks Pakistan Cricket Team  Cricket AddictorBCCI vs PCB LIVE: BCCI top brass 'very upset' with ex-PCB chief Ramiz Raja's 'BJP mindset' STATEMENT, says 'he is frustrated': Follow LIVE UPDATES - Inside Sport India  InsideSportRamiz Raja blames India's ‘BJP mindset’ for ‘marginalising’ Pakistan cricket  Hindustan TimesRamiz Raja says BJP-influenced BCCI curtailing Pakistan cricket  The Indian Express\"Keep your personal opinion to yourself\" - Salman Butt slams Ramiz Raja for taking shots at Mohammad Amir  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2023-01-13 12:16:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rahul Dravid’s stats appear on screen during IND vs SL Kolkata ODI, watch his golden reaction","link":"https://www.firstpost.com/firstcricket/sports-news/rahul-dravids-stats-appear-on-screen-during-ind-vs-sl-kolkata-odi-watch-his-golden-reaction-11979102.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Rahul Dravid’s stats appear on screen during IND vs SL Kolkata ODI, watch his golden reaction","content":"India head coach Rahul Dravid rang his 50th birthday on 11 January. A day after the celebration on Thursday, Team India squared off with Sri Lanka in the second ODI at the Eden Gardens in Kolkata. In the match, the Rohit Sharma-led side comfortably defeated the visitors by 4 wickets, taking an unassailable 2-0 lead in the three-match series.During India’s run-chase, when Dravid was sitting in the dugout, TV commentators went on to discuss the former India batter’s decorated career with his staggering batting stats being displayed on the giant screen. It caught the attention of Dravid and his reaction was nothing but precious.The broadcasters also let the fans relive his immortal 181 in the Eden Gardens Test against Australia in 2001 and his brilliant century against Pakistan at the same venue.A clip of his golden reaction was shared on Twitter by a fan. When the stats were appearing on the screen, Dravid was captured watching the game sincerely. Vikram Rathore, sitting beside him asked the former cricketer to have a look at the screen.After spotting his career stats, a bright smile popped up on his face. He was seen juggling a ball in his hands before shifting his focus to the match again.pic.twitter.com/BYeRzGzQ8K— cricket fan (@cricketfanvideo) January 12, 2023 Extremely talented and composed, Dravid was one of the key components in the Indian circuit during his playing days. His class, determination, and perfection in red-ball cricket made him earn the moniker of “The Wall of Indian cricket.”Not only in Tests, but the right-handed batter also demonstrated his quality in the 50-over format. He still holds the record for the second-fastest ODI fifty by an Indian batter.Looking at his astonishing numbers, Dravid has recorded 13288 and 10889 runs in 164 Tests and 344 ODIs respectively throughout his career.Following his retirement in 2011, Dravid put his entire focus on the coaching profession. First, he took charge of the Indian Under-19 side and led the young brigade to lift the 2018 Under-19 World Cup. In 2022, he was appointed the head coach of the senior team. Under his guidance, the Men in Blue reached the semi-final of the 2022 T20 World Cup but failed to touch the coveted trophy.In October-November this year, Dravid will unquestionably face the most important assignment of his coaching career- the ICC World Cup 2023. It’s been over a decade since India, led by MS Dhoni, took home the ICC World Cup trophy back in 2011. Thus, a world-cup victory will no doubt make Dravid one of the greatest coaches in the history of Indian cricket.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-13 11:36:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Dravid-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"All you need to know about the inaugural ICC Under-19 Women's T20 World Cup 2023 - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzMwMTczODDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"All you need to know about the inaugural ICC Under-19 Women's T20 World Cup 2023  ICC CricketTwo days to go for the inaugural ICC Under-19 Women's T20 World Cup  SABC NewsUnder-19 women's T20 WC: 16 teams, four groups, two venues  ESPNcricinfoSachin Tendulkar: U19 T20 World Cup can 'transform the landscape' of women's cricket  ICC CricketSachin Tendulkar delivers his verdict on India women's team's chances at ICC U-19 T20 World Cup  Republic WorldView Full coverage on Google News","content":null,"pubDate":"2023-01-13 11:32:07","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BPL 2023: Match 10, KHT vs RAN Match Prediction – Who will win today’s BPL match between KHT vs RAN? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9icGwtMjAyMy1tYXRjaC0xMC1raHQtdnMtcmFuLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy1icGwtbWF0Y2gtYmV0d2Vlbi1raHVsbmEtdGlnZXJzLXZzLXJhbmdwdXItcmlkZXJzLTQ4MTYv0gG1AWh0dHBzOi8vd3d3LmNyaWN0cmFja2VyLmNvbS9jcmlja2V0LW1hdGNoLXByZWRpY3Rpb25zL2JwbC0yMDIzLW1hdGNoLTEwLWtodC12cy1yYW4tbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLWJwbC1tYXRjaC1iZXR3ZWVuLWtodWxuYS10aWdlcnMtdnMtcmFuZ3B1ci1yaWRlcnMtNDgxNi8_YW1wPTE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BPL 2023: Match 10, KHT vs RAN Match Prediction – Who will win today’s BPL match between KHT vs RAN?  CricTrackerKHT vs RAN Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Bangladesh Premier League  Cricket AddictorBangladesh Premier League: Chattogram Challengers vs Dhaka Dominators Fantasy Cricket Tips, Probable Playing XIs, CCH vs DD LIVE at 6.00 PM: Follow BPL 2023 LIVE Updates  InsideSportBPL 2023: Match 9, CCH vs FBA Match Prediction – Who will win today’s BPL match between CCH vs FBA?  CricTrackerKHT vs RAN Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs for the Banglades  News18View Full coverage on Google News","content":null,"pubDate":"2023-01-13 11:15:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ravi Shastri asked Virat Kohli to respect MS Dhoni: R Sridhar reveals DARK reality behind Indian cricket","link":"https://zeenews.india.com/cricket/ravi-shastri-asked-virat-kohli-to-respect-ms-dhoni-r-sridhar-reveals-how-desperate-kohli-was-for-captaincy-in-2016-2561174.html","keywords":null,"creator":null,"video_url":null,"description":"When Dhoni stepped aside as India's all-format captain in 2017, Kohli heeded the advice and did well. As their relationship strengthened, Dhoni played for Kohli for the remainder of his career, enthusiastically contributing his ideas.","content":null,"pubDate":"2023-01-13 10:30:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Captains expect ILT20 to be a competitive tournament | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTI1MTY2L2NhcHRhaW5zLWV4cGVjdC1pbHQyMC10by1iZS1hLWNvbXBldGl0aXZlLXRvdXJuYW1lbnQtY3JpY2J1enpjb23SAW5odHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjUxNjYvY2FwdGFpbnMtZXhwZWN0LWlsdDIwLXRvLWJlLWEtY29tcGV0aXRpdmUtdG91cm5hbWVudC1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Captains expect ILT20 to be a competitive tournament | Cricbuzz.com - Cricbuzz  CricbuzzDUB vs ABD Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- UAE T20  Cricket AddictorILT20 Schedule, Format And Live Streaming Details: All You Need to Know About UAE's T20 League  News18ILT20 2023: Squads, fixtures, live streaming and all you need to know  India TodayILT20 2023 Live Streaming Info: When and where to watch UAE T20 League Match 1 in India; telecast details, timings in IST  SportstarView Full coverage on Google News","content":null,"pubDate":"2023-01-13 10:13:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Bahut bada karna padega and bada karunga: Prithvi Shaw told his coach before the Ranji season","link":"https://www.firstpost.com/firstcricket/sports-news/bahut-bada-karna-padega-and-bada-karunga-prithvi-shaw-told-his-coach-before-the-ranji-season-11981352.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"Bahut bada karna padega and bada karunga: Prithvi Shaw told his coach before the Ranji season","content":"‘Sir mujhe bada hi karna padega and bada karunga,’ were Prithvi Shaw’s words to his childhood coach Prashant Shetty before the domestic season got underway. The two would spend hours on the ground to get the belligerent opener ready for the grind ahead and the long sessions under the sun are finally reaping rewards. After dominating in the white-ball competitions, Shaw, after failing to convert starts in the first four Ranji Trophy fixtures, has landed a daddy knock – 379 vs Assam – and registered the second-highest individual score in the history of the competition.“I think it’s just the realisation that ‘bahut bada karna padega’ to get noticed. It was in his mind when we were practicing before the season. He had told me that ‘sir mujhe bada hi karna padega and bada karuga’. He had said this before going and himself had realised that 100s can become 150s, 150s can become 200s, and 200s maybe 300s,” Shaw’s childhood coach Shetty told News18 Cricketnext.com in an exclusive conversation.In the last couple of years, or seasons to be precise, Shaw is yet to put a foot wrong in the domestic circuit and has been bullying oppositions, across formats, match after match. Even after the truckload runs, the off-field talks continue to take centre stage and the right-hander was not even selected for the India A teams which were picked during this tenure. For both coach and his ward though, the focus always remained on runs.Thank you so much @JayShah sir. Your words of encouragement means a lot. Will keep working hard. https://t.co/RoDw5FbUEV— Prithvi Shaw (@PrithviShaw) January 11, 2023 “Motivation is simple. Work hard off the ground and ground pe sirf balla baat kare. Simple. There is no arrogance in it. If you have to do it, do it on the ground and show it on the ground. Whatever talks are happening can quickly turn in your favour when runs start coming. He has already been an India player – has played for the senior team. It’s not that he has not seen that level. And the motivation to get back there and stay there has always been there. I told him that you have to get back to that (Indian team) dressing room. So you have to work hard and keep performing to get there,” says Shetty.Big appetite for runsDuring the time away from the Indian cricket team, there were no/very little technical changes made to Shaw’s batting and it was just about increasing the appetite for runs. For Shetty, it was making him revisit what he did at the school level and the kind of hunger he displayed in his foundation years. The message to Shaw was simple – play straight and continue to score every inning.“There has been no technical change, just mental. At the level he is playing, he knows who is planning what. So it has been purely mental toughness. He has practiced really hard, a lot of focus was on preparation. He would practice hard and practice long before the season. That hunger in him was very visible this time around. He should play as straight as possible early on and then he has the skills to make it big. Just play straight initially was my communication with him when we were practicing before the season.“And for us it’s like jaise wo school mai karta tha – 200, 100, 300. I know the level is different but he has what it takes to put up a string of scores like he did at the school level – 100 after 100. He had a big appetite then and it’s about continuing with the same at this level now. Not just every match, but every inning,” says Shetty.Criticism is part and parcelShaw has remained under the lens for years now. May it be for the off-field chatter or the way he bats in the middle. Shetty, however, doesn’t complicate his messaging to the youngster and continues to motivate him to keep performing with the bat.“People will continue to talk. Even if you fail one inning, they will talk. People criticised someone like Virat Kohli too, so Shaw ko bhi bahut kara. Even he knows that criticism is part and parcel of his life. Not only off field, but he has been under the scanner for how he plays too. Question marks have been there on his attacking game and approach at top of the order. But he knows that the people who matter can only be pleased with performances. Baaki jo chal raha hai chalne do, tu bas run kar has always been my message to him,” says Shetty.Now, the typical Indian question was – how happy was the father with the 379?“Father is very happy but like every father, he was like ‘sir agla inning karna chahiye’. Fathers will never be satisfied. He would have thought on 379 that ‘agar 21 run aur hote to 400 hote’. So I think that’s the typical difference between father and coach (laughs),” says Shetty.The next stepShaw’s consistency, across formats, has been second to none in domestic competitions. The opener continues to be ignored for the A set-up but Shetty feels more scores like these will impress the selectors and men who matter in the BCCI. For Shetty, who is now serving as batting coach of Goa, there are very few like Shaw, both in domestic and world cricket, and he can be an asset in any format.“Next step is up to the selectors and people who matter in the BCCI. But for me, the focus is that he continues to score with the bat. His job is to score and he should continue doing that. For me, important is Prithvi’s mindset. Very few bat like him in the domestic, even world circuit. If groomed, Prithvi can be an asset in any format. Our perception is that our opener should see of first few hours and then score. But there is no guarantee of runs coming after that. But with Prithvi, if he bats for two hours, he can make a match out of it on any given day,” says Shetty.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-13 10:03:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Prithvi-Shaw.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Scans confirm Handscomb hip injury - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3Rvcnkvc2NhbnMtY29uZmlybS1wZXRlci1oYW5kc2NvbWItaGlwLWluanVyeS1haGVhZC1vZi1pbmRpYS10b3VyLTEzNTM1MTDSAXRodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3NjYW5zLWNvbmZpcm0tcGV0ZXItaGFuZHNjb21iLWhpcC1pbmp1cnktYWhlYWQtb2YtaW5kaWEtdG91ci0xMzUzNTEwP3BsYXRmb3JtPWFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Scans confirm Handscomb hip injury  ESPNcricinfoIND vs AUS: Injured Peter Handscomb in Race Against Clock to Be Fit for India Tour  News18Australia batter Peter Handscomb in race against time to be fit for India tour as scans confirm hip injury  India TodayIND vs AUS TEST: BIG Setback for Aussies, after Cameron Green, Mitchell Starc now Peter Handscomb suffers Injury SCARE, Follow India vs Australia LIVE updates  InsideSportHandscomb in fitness race as scans confirm injury  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2023-01-13 10:03:10","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"A different role helps me understand my game a little better: Rahul on his new role as a keeper, middle-order batter","link":"https://www.orissapost.com/a-different-role-helps-me-understand-my-game-a-little-better-rahul-on-his-new-role-as-a-keeper-middle-order-batter/","keywords":["Sports","cricket","India vs Sri Lanka","Indian cricket team","KL Rahul"],"creator":["Post News Network"],"video_url":null,"description":"Kolkata: After taking India to a tense four-wicket victory over Sri Lanka through a match-winning unbeaten 64, KL Rahul stated that the dual role of keeping wickets and batting at No. 5 in the ODIs has helped him understand his game a little better. Chasing 216, India were in a precarious situation at 86/4. That’s […]","content":"Kolkata: After taking India to a tense four-wicket victory over Sri Lanka through a match-winning unbeaten 64, KL Rahul stated that the dual role of keeping wickets and batting at No. 5 in the ODIs has helped him understand his game a little better. Chasing 216, India were in a precarious situation at 86/4. That’s when Rahul came in and stepped up in an under-pressure situation to take India over the line to secure an unassailable 2-0 series lead. In his 64 not out at Kolkata, Rahul played out 60 dot balls and hit six fours, while taking 34 singles and three twos. It was a knock in which Rahul had to be cautious and then open up with a calm head to chase down the target with 40 balls to spare. “Obviously, I’ve done this for a couple of years now. From the end of 2019, throughout 2020 and a few games in 2021, I did this role of batting in the middle-order. It’s not something that’s new. The team has given me time to settle into this position and role. “When you have the backing of your captain and coach, it helps you focus and bring your 100 per cent concentration, which is what the team is expecting and what they want you to do. Yes, it’s different to what I do in other formats, but that keeps me on my toes, keeps me challenged, a different role helps me understand my game a little better,” he said in the post-match press conference. In 15 innings at number five, Rahul, once seen as a backup opener, now averages 54.25 and has a strike rate of 102.23 and reminding everyone of what he brings to the table in Kolkata, through his 64 not out, apart from his tidy keeping behind the wickets, something which he admitted has demanded lot of hard work behind the scenes. “I’ve to work slightly differently when it comes to batting in the middle order. Wicket-keeping and batting can be slightly more taxing on the body because I have not done it for too long, I’ve done it on and off in white ball cricket. “That’s the tough part. But since I know this is what is required from me, I try to manage my body and work that much more harder on my fitness. A little bit of work on my wicket-keeping and a lot of work on batting in the middle-order and batting against spin,” he added. Rahul and Hardik Pandya had to weather the early storm and then cash on the loose balls from the Sri Lankan bowlers to stitch a crucial 75-run partnership off 119 balls. While Hardik fell, Rahul marched forward to stitch stands of 30 and 28 not out with Axar Patel and Kuldeep Yadav. Over the years since his ODI debut in 2016, Rahul has donned many roles – opening the batting, slotted in the middle-order, and being the keeper as well. Asked to reflect on his ODI career till now, Rahul felt that his being tried in various positions and scenarios show that the think tank trusted him to deliver for the side. “Any role that helps win matches for my team and country is what satisfies me the most wherever I bat. Firstly, I want to be in the playing XI, that’s the most important thing. What the team requires me to do, I try to do that. I’ve done that throughout the time I played for India.” “I remember the first Test I batted, I batted at number six. Then I opened. Then I was number six at the 2019 (ODI) World Cup. Then after an injury to Shikhar (Dhawan), I had to go back to open again. I’ve played at number five, I’ve played at number four, I’ve been asked to keep wickets. I think it is very fun for me. I have thrived on performing in tough conditions and under pressure. It tells me that the team trusts me and backs me. It has helped me understand my batting and myself better. When you decide to choose a team game as a sport or profession, you have to be ready or flexible to do whatever job you’re asked to do.” Despite all the fluctuations, Rahul insists that it has been enjoyable for him to counter various challenges and then emerge triumphant in ODIs. “I’ve been all over, I’ve been asked to keep wickets. It’s been fun for me. I’ve really enjoyed being thrown with different challenges. I’ve really thrived on performing in tough conditions and being put under pressure. “That only tells me that the team really trusts me and backs me, under Virat and Rohit. I’ve really enjoyed doing that. It helped me understand myself, my game, and my batting better. How I’m under pressure when taken out of my comfort zone.” IANS","pubDate":"2023-01-13 10:02:31","image_url":"https://www.orissapost.com/wp-content/uploads/2022/08/KL-Rahul-300x200.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Don’t know what was discussed on commentary': Irfan blasted for Kuldeep tweet - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiuQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9kb250LWtub3ctd2hhdC13YXMtZGlzY3Vzc2VkLW9uLWNvbW1lbnRhcnktaXJmYW4tcGF0aGFuLWJsYXN0ZWQtb24tdHdpdHRlci1sYXhtYW4tc2l2YXJhbWFrcmlzaG5hbi1mb3Ita3VsZGVlcC15YWRhdi1hbmFseXNpcy0xMDE2NzM2MDAyODQ0NTAuaHRtbNIBvQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9kb250LWtub3ctd2hhdC13YXMtZGlzY3Vzc2VkLW9uLWNvbW1lbnRhcnktaXJmYW4tcGF0aGFuLWJsYXN0ZWQtb24tdHdpdHRlci1sYXhtYW4tc2l2YXJhbWFrcmlzaG5hbi1mb3Ita3VsZGVlcC15YWRhdi1hbmFseXNpcy0xMDE2NzM2MDAyODQ0NTAtYW1wLmh0bWw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Don’t know what was discussed on commentary': Irfan blasted for Kuldeep tweet  Hindustan TimesKuldeep emerges from the shadows again with another match-winning performance  ESPNcricinfo\"Suryakumar Yadav Ke To Hum Batting Coach Hain\": Yuzvendra Chahal Jokes With Kuldeep Yadav. Watch | Cricket News  NDTV SportsA straighter run up, a perfect wrist position: Laxman Sivaramakrishan on what is working for Kuldeep Yadav  The Indian Express`Yeh note kar lijiye`, Yuzvendra Chahal claims he is batting coach for Suryakumar Yadav and bowling coach f...  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2023-01-13 09:37:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs New Zealand 3rd ODI LIVE: Hosts face off Kiwis in series decider","link":"https://www.firstpost.com/firstcricket/sports-news/live-cricket-score-pakistan-vs-new-zealand-3rd-odi-in-karachi-11980862.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs New Zealand 3rd ODI LIVE: Hosts face off Kiwis in series decider","content":"Playing XIPakistan Fakhar Zaman, Shan Masood, Babar Azam(c), Mohammad Rizwan(wk), Haris Sohail, Agha Salman, Mohammad Nawaz, Usama Mir, Mohammad Wasim Jr, Mohammad Hasnain, Haris RaufNew Zealand Finn Allen, Devon Conway, Kane Williamson(c), Daryl Mitchell, Tom Latham(wk), Glenn Phillips, Michael Bracewell, Mitchell Santner, Ish Sodhi, Tim Southee, Lockie FergusonToss | Pakistan have opted to batAfter Pakistan won the first ODI by six wickets, New Zealand answered back to level the series 1-1 and prevented the third ODI from being a dead rubber.The Kiwis will be excited with Kane Williamson getting amongst runs and Devon Conway as well scoring a crucial century.Interestingly, the thing that should excite the Kiwis more is that Pakistan were on a winning streak in ODIs that was broken with a 79-run defeat.Pakistan cricket is probably going through some internal turmoil, probably not. There have been questions about Babar Azam’s captaincy but that has not affected his performances with the bat at least.It will be worthwhile to see if Pakistan can win the series or if the Kiwis will dominate and have an away series win to their name.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-13 09:28:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Pakistan-vs-New-Zealand-3rd-ODI.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}