{"newsArray":[{"title":"50-1: Australia’s top cricketers from the summer ranked","link":"https://thewest.com.au/sport/cricket/50-1-australias-top-cricketers-from-the-summer-ranked-c-5782562","keywords":null,"creator":["Ben Horne"],"video_url":null,"description":"Two dominant Ashes series victories and a breakthrough T20 World Cup - Australian cricket had a summer to remember. But while several new stars emerged, others copped a reality check.","content":null,"pubDate":"2022-02-21 23:48:44","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5782562/cc4c5118e83d4be87b653ea286c5a1f7a104e646-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"UK cricket mess takes twist as ‘reckless’ racism response leaves club on brink of ruin","link":"https://www.foxsports.com.au/cricket/cricket-news-2022-yorkshire-county-cricket-club-updates-wrongful-dismissal-claims-expected-after-azeem-rafiq-racism-scandal/news-story/22c5d1acefd751ac7974e385f17b1fec","keywords":null,"creator":null,"video_url":null,"description":"Yorkshire Cricket Club could be brought to the brink of financial ruin as it braces for wrongful dismissal claims in the wake of the Azeem Rafiq racism scandal.","content":null,"pubDate":"2022-02-21 23:29:00","full_description":"Yorkshire Cricket Club could be brought to the brink of financial ruin as it braces for wrongful dismissal claims in the wake of the Azeem Rafiq racism scandal. The Telegraph reports that four former employees, who were sacked in response to Rafiq’s case, will take the club to court over their dismissals, while more claims are expected in the coming weeks. Yorkshire cleaned out 17 staff before Christmas, including its entire coaching team, following an investigation into claims of systemic racism at the club, brought forward by former player Rafiq. Watch every match of the ICC Women’s Cricket World Cup LIVE & FREE on Kayo Freebies. Join free now and start streaming instantly . Leeds Employment Tribunal confirmed that four wrongful dismissal claims were filed on Monday, according to the publication. There are now grave fears over the club’s future due to its complicated financial situation, rooted in issues from nearly 20 years ago. Yorkshire Cricket Club could be brought to the brink of financial ruin. Source: AFP In the early 2000s, the Colin Graves Trust bailed out a financially-stricken Yorkshire, which still owes approximately AUD$38 million as a result. Former Yorkshire chair Roger Hutton — who has been replaced by Lord Patel — claimed before a House of Commons Select Committee that the debt restricted the club’s ability to remove senior staff. Graves dismissed Hutton’s claim as “completely incorrect”. Under conditions imposed by the ECB for England matches to be held at Headingley again, the Board demanded that vetoing powers of the Trust be removed. As part of further reforms, members will be asked by Patel to vote at an extraordinary general meeting for eight non-members to join the club’s board as independent non-executive directors. Former chair Robin Smith believes that the future of Yorkshire — which has already paid Rafiq and another former employee six-figure sums — is under significant threat. “The end result of your ill-considered, indeed reckless, actions is a series of claims against the club (which seem to me to be certain to succeed) which will cost the rumoured total sum of over £3m (AUD$5.7m),” Smith wrote to Patel earlier this month, according to The Telegraph . “In a business the size of Yorkshire CCC, this is a huge sum threatening its future viability.” Smith has been an outspoken critic of Patel’s proposed reforms and deal with the ECB to have international cricket to return to Headingley. Waugh questions Finch's spot in T20 team | 01:55 Smith claimed that the latter reduces Yorkshire to an “ECB franchise”, while his reforms will leave the club open to “commercial and political manipulation”. “(A) four-to-one ratio of outsiders to members as non-executives on the club’s board would so change the character of the club as to render it unrecognisable as a Yorkshire institution,” Smith wrote in a letter to Patel, as reported by The Telegraph . In response, Patel has claimed that Smith’s intentions are to destabilise the club following his departure in 2020. Rafiq offered his support for Patel in a tweet, writing: “I mean you can try and make it out as I am the only person at Yorkshire that’s ever complained of racism or you can look in to facts? “Guess some institutions don’t like POC (people of colour) having any say in decision making.” The EGM will take place on March 14. Patel’s leadership will also come under question having failed to file rules amended at AGMs in 2020 and 2021 with the Financial Conduct Authority. Azeem Rafiq testifying in front of a Digital, Culture, Media and Sport (DCMS) Committee in London. Source: AFP ‘ABSOLUTELY DISTRAUGHT’ Yorkshire is still in the early stages of a mass overhaul in response to Rafiq’s harrowing testimony in front of a House of Commons Select Committee. Prior to the committee, Rafiq told foxsports.com.au in early 2021 that he contemplated suicide as a result of racism he experienced at the club. In a bid to have the club stage England matches again and regain key sponsors, Patel led a major clear-out, triggering threats of a player revolt and wrongful dismissal claims. “The players are absolutely distraught and feeling very aggrieved at what has happened,” a source told The Telegraph in December. Some players felt that the cull was indiscriminate while those who were axed felt “blindsided” by the decision. Former head coach Andrew Gale, who was suspended over a historic anti-Semitic Twitter post, indicated at the time that he would fight his sacking. “The decision has come as a surprise to me. The players knew about it before I did and I will be fighting the decision legally,” Gayle said in a statement.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"MCG could undergo significant renovation","link":"https://www.news.com.au/sport/afl/mcg-could-undergo-significant-renovation/video/8cf3db5b7319e9e51fea5dec8d9a2939","keywords":null,"creator":null,"video_url":null,"description":"AFL: The Melbourne Cricket Ground could be set to undergo renovations that could cost up to a billion dollars in an attempt to revitalize the iconic stadium","content":null,"pubDate":"2022-02-21 23:27:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Has the PSL produced the best catch of 2022?","link":"https://www.news.com.au/sport/cricket/has-the-psl-produced-the-best-catch-of-2022/video/1f4395d5936275de37ca7b00339c3866","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Arshad Iqbal has taken a catch for the ages in the Pakistan Super League.","content":null,"pubDate":"2022-02-21 23:09:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Copeland leads NSW to victory over Tasmania in final session","link":"https://www.news.com.au/sport/cricket/copeland-leads-nsw-to-victory-over-tasmania-in-final-session/video/f78099c5f324b2a6bd6ef295abc3667f","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Veteran pace bowler Trent Copeland has led New South Wales to victory over Tasmania on the final session of Day 4.","content":null,"pubDate":"2022-02-21 21:09:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Maruns explains unusual training method for Pakistan Tour","link":"https://www.news.com.au/sport/cricket/maruns-explains-unusual-training-method-for-pakistan-tour/video/455cc52afc3b7c7270eb62133d915f85","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australian star Marnus Labuschagne has explained the reasoning why he made a home made pitch to prepare for the Test tour of Pakistan.","content":null,"pubDate":"2022-02-21 21:09:18","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"NRL 2022: State of Origin predicted teams, New South Wales Blues, Queensland Maroons, 1-17","link":"https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2022-state-of-origin-predicted-teams-new-south-wales-blues-queensland-maroons-117/news-story/63d1fdfc68f5efef63bd26852d497576","keywords":null,"creator":null,"video_url":null,"description":"The conversation around the water cooler has turned from cricket to footy so we’ve decided to have some fun and predict the 2022 Origin teams given it’s.... February.","content":null,"pubDate":"2022-02-21 21:00:00","full_description":"The conversation around the water cooler has turned from cricket to footy so we’ve decided to have some fun and predict the 2022 Origin teams given it’s.... February. Brad Fittler’s Blues are chasing a fourth series victory in five years and rookie Maroons coach Billy Slater has his work cut out for him. Tom Trbojevic might be the best player in the game but he still won’t be playing for New South Wales in his preferred position of fullback. Stream every game of every round of the 2022 NRL Telstra Premiership Season Live & Ad-Break Free During Play on Kayo. New to Kayo? Try 14-days free now. Round 1 NRL Mar 11 8:05pm AEST FT Storm 26 Rabbitohs 18 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 12 6:00pm AEST FT Knights 32 Bulldogs 16 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 12 8:05pm AEST FT Broncos 16 Eels 24 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 13 3:00pm AEST FT Warriors 19 Titans 6 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 13 5:30pm AEST FT Roosters 46 Sea Eagles 4 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 13 7:35pm AEST FT Panthers 24 Cowboys 0 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 14 4:05pm AEST FT Raiders 30 Tigers 12 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES NRL Mar 14 6:15pm AEST FT Dragons 18 Sharks 32 MATCH CENTRE *Odds are current as of 22nd February 2022, 8:33am AEST VIEW ALL SCORES Queensland skipper Daly Cherry-Evans will not just be playing for his state but to protect his Kangaroos No.7 jersey from Nathan Cleary. There’s plenty of young guns in these sides, but a few old heads have managed to keep their spots. Here are the 2022 State of Origin Game I predicted teams from foxsports.com.au. Victor Radley, Ben Hunt and Jack Wighton. Getty. Source: Getty Images BLUES TEAM 1. James Tedesco The skipper is an automatic selection and will be for years to come. The 2019 player of the series strikes fear into the heart of Queensland fans - and for good reason. 2. Brian To’o The Panthers flyer burst onto the scene in 2019 and made his Origin debut last year. The best yardage winger in the game, according to Matty Johns. 3. Latrell Mitchell One of the most destructive ball runners in the game at his devastating best. Controversially dropped in 2019 but he destroyed the Maroons in Game 1 last year. 4. Tom Trbojevic The best fullback in the world will play in the centres because it doesn’t really matter where you put Turbo, just get him on the park and he’ll do the rest. 5. Josh Addo-Carr The Foxx has started every game for the Blues since debuting in 2018, scoring 10 tries in those 12 appearances. Now at the rebuilding Dogs but will still get picked. 6. Jarome Luai The most hotly-contested position in the backline goes to the premiership winner. Luai beats out Cody Walker, Jack Wighton and Matt Burton for the No.6 jersey. Blues playmaker Jarome Luai in Game II last year. Getty Images. Source: Getty Images 7. Nathan Cleary Nobody will go close to taking the 24-year-old’s spot. Cleary already has a premiership and 10 Blues appearances to his name - next stop Kangaroos. 8. Payne Haas The Broncos wrecking ball made his Origin debut as a teenager in 2019 and he’s only getting better. Will play rep footy for the next decade. 9. Damien Cook The best in the business around the ruck and Cook goes to another level when he pulls on the Blues jumper. Certain starter. 10. Junior Paulo The halfback stuck in a prop’s body has been the leader of the Eels pack since 2019 and he’s more than held his own in the Origin arena since debuting in 2020. 11. Cameron Murray A future Blues captain. Murray is a workhorse who rarely makes mistakes and his flawless consistency has been a big part of the Blues’ recent success. 12. Angus Crichton The no-nonsense second-rower made his Blues debut in 2018 and has only missed two games since, would take a dramatic fall off for him to miss out. Angus Crichton of the Blues in Game III of the 2020 series. Getty Images Source: Getty Images 13. Isaah Yeo The Panthers skipper is widely regarded as one of the most intelligent players in the game and has been the perfect link man for the Blues since debuting in 2020. 14. Jack Wighton The 2020 Dally M Medal winner endured a tough 2021 at the Raiders but great players rarely stay down for long. Expect him to bounce back in 2022. 15. Jake Trbojevic Will fight for a starting position but whether off the bench or not, this workhorse will finish the series with three more NSW caps to his name. 16. Daniel Saifiti Another destructive prop with plenty of power in his game, a formidable figure who tips the scales north of 120kgs and stands 195cm. 17. Victor Radley Victor The Inflictor should make his Blues debut this year if he can stay away from the NRL judiciary. But harness his aggression when tempers boil against the Maroons. Victor Radley of the Roosters. Getty Images. Source: Getty Images Notable omissions: Mitchell Moses, Matt Burton, Cody Walker, Tariq Sims, Liam Martin, Dale Finucane, Api Koroisau. MORE NRL NEWS EARLY ROUND 1 TEAM TIPS: Robbo pulls switch to fill huge Roosters void, Broncos’ worrying dilemma ‘AWESOME’: Ponga opens up on relationship with Joey that could swing big contract call TRANSFER WHISPERS: Unhappy Bird in talks with rival club; Storm star’s staggering $5m bid 3 BIG HITS: Eels’ headache after injury blow; ‘future’ of Dragons announces himself MAROONS TEAM 1. Kalyn Ponga The superstar fullback who could soon become the highest-paid player in the game at the Dolphins will be one of the first Maroons picked. 2. Hamiso Tabuai-Fidow The Cowboys flyer made his Origin debut as a teenager last year and this month played for the Indigenous All Stars. Will only get better. 3. Valentine Holmes One of the best outside backs in the NRL on his day and walked back into the Origin set-up after missing 2019 while chasing his NFL dream. 4. Dane Gagai Famously grows a foot taller in a Maroon jersey. Wayne Bennett joked in 2020 he needed to wear it under his Rabbitohs jumper. Dane Gagai of the Maroons in Game III last year. Getty Images Source: Getty Images 5. Xavier Coates Another young gun who made his debut as a teenager and Coates will only get better now he’s playing under Craig Bellamy in Melbourne. Australian honours await. 6. Cameron Munster The man who single-handedly dragged Queensland back into the 2020 series as the “worst team in Origin history” famously prevailed 2-1. 7. Daly Cherry-Evans DCE’s Kangaroos jumper is under threat with Nathan Cleary well on his way to becoming the best player in the game. Expect DCE to lift in 2022. 8. Christian Welch The most intelligent forward in the game has played a crucial role for the Maroons in recent years - and they’ll need him at his barnstorming best this year. 9. Harry Grant The 2020 Dally M rookie of the year has only played two Origin games but famously scored the series-sealing try in Game 3 of 2020. 10. Josh Papalii The Green Machine wrecking ball has been Queensland’s best player on the park several times, but Papa endured a tough 2020. Form is temporary, class is permanent. Josh Papalii of the Raiders. Getty Images Source: Getty Images 11. Kurt Capewell Despite playing centres in the first two Origins last year, second-row is his best position and Capewell will only grow in confidence now he’s a premiership player. 12. David Fifita The highest-paid bench player in the NRL has vowed to force his way back into the starting side for his club and state. 13. Tino Fa’asuamaleaui Big Tino has become one of the youngest NRL captains of the modern era at age 22 and is a future Maroons skipper. A serious talent. 14. Ben Hunt At 31 he’s still one of the highest earners in the NRL and the Maroons will need Hunt’s experienced head when the game is in the balance. Ben Hunt, AJ Brimson and Harry Grant of the Maroons. Getty Images Source: Getty Images 15. Jai Arrow The proud Queenslander can cover prop, lock and second-row and should add to his 10 Maroons appearances this year. 16. Moeaki Fotuaika The third Titans player who should find himself back in the Maroons pack in 2022 after making five appearances over the past two seasons. 17. Felise Kaufusi This enforcer was born (albeit in Auckland) to play Origin and will once again add plenty of grunt to an already formidable pack. Notable omissions: Kyle Feldt, AJ Brimson, Joe Ofahengaue, Coen Hess, Thomas Flegler, Francis Molo, Reece Walsh. MORE NRL PREVIEWS KNIGHTS: Ponga call that could change next ‘10 years’ as Johns’ impact revealed BULLDOGS: Why maligned star deserves last chance; ‘perfect buy’ that sets Dogs up STORM: The first cracks have appeared in Bellamy’s empire... and they could widen RABBITOHS: ‘Mix and match’ Latrell plan that can solve biggest issue SEA EAGLES: The widening crack even Turbo can’t paper over; Des’ $800k call RAIDERS: Raiders primed after ‘tragic’ lessons learned, ‘enormous’ halves boost WARRIORS: Warriors’ prodigal son returns — but one big conundrum needs solving PANTHERS: ‘Not unreachable’ - Penrith reality hits as star exodus ‘opens another door’ EELS: Forgotten truth in Eels exodus... and why $700k star’s big call changes everything ROOSTERS: The brutal baptism of fire that could trigger rise of NRL’s next dynasty SHARKS: The big ‘unknown’ that must be answered after $6.3m spending spree TIGERS: The solution to $1.7m mystery that could end ‘decade of disaster’ COWBOYS: The $1m call Payten must make to turn ‘ordinary’ Cowboys around TITANS: The forgotten signings set to unleash 107kg beast and ignite NRL dark horse BRONCOS: Walters’ $2 million war chest and why he must deliver DRAGONS: The veterans vying for an NRL rebirth and the TWO huge calls to be made Get all the latest NRL news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!!","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Wild US college basketball hit triggers all-in fight","link":"https://wwos.nine.com.au/basketball/ncaa-michigan-coach-juwan-howard-hit-fight-video-badges-assistant-joe-krabbenhoft/c480cc53-8bf5-4766-b398-af7fb7251637","keywords":null,"creator":["wwos"],"video_url":null,"description":"Mayhem erupted when a US college basketball coach hit an opposition assistant amid anger over a late timeout.","content":"Angry about Wisconsin calling a late timeout, Michigan coach Juwan H'That's what escalated it'oward began arguing in the post-game handshake line.Moments later, he hit a Badgers assistant in the head, and mayhem erupted.The Wolverines' inability to boost their NCAA tournament credentials was the least of their concerns after a 77-63 loss at No.15 Wisconsin.Their head coach could be facing major discipline after his hit turned a pushing-and-shoving scrum into a punch-filled brawl.READ MORE: Langer ally quits Cricket Australia roleREAD MORE: Kevin Walters no closer to solving major Brisbane Broncos dilemmaREAD MORE: Djokovic fires warning to rivals ahead of return to ATP tourHoward struck Wisconsin assistant Joe Krabbenhoft after jawing with Wisconsin coach Greg Gard during the handshake line.The Big Ten said it planned to \"take swift and appropriate disciplinary action when it completes its review\".During his post-game media conference, Howard said he didn't like Wisconsin calling for a timeout with 15 seconds left and the Badgers leading by 15.“I thought it was not necessary at the moment, especially being a large lead,” Howard said.Gard said he called the timeout because his reserves were in the game and only had four seconds to get the ball past mid-court. A timeout gives them 10 seconds.“I was not going to put them in position, where the ball had already gotten knocked out of bounds, to have to break a press in four seconds,” Gard said.After the game, Howard pointed a finger at Gard while complaining about the late move. Later on, Howard reached through a crowd to get to Krabbenhoft, replays showing Howard had his hand open as he struck Krabbenhoft on the left side of the head.Players from each side got involved in the skirmish, and video appeared to show Michigan's Moussa Diabate and Wisconsin's Jahcobi Neath throwing punches.Howard said he reacted after someone from Wisconsin put hands on him. He said that “at that point, I felt it was time to protect myself\".Video showed Gard had his hands touching Howard’s arm or wrist area while trying to explain why he called the timeout.“Someone touched me, and I think it was very uncalled for, for them to touch me, as we were verbalising and communicating with one another,” Howard said.\"That’s what escalated it.”https://twitter.com/BleacherReport/status/1495505607901663234Wisconsin athletic director Chris McIntosh said he had already contacted Big Ten commissioner Kevin Warren about the situation, adding that Wisconsin had staff members who were “affected and injured\".“There’s no room, no space for conduct like that in any competition, much less a Big Ten competition,\" McIntosh said.\"The Big Ten takes pride in sportsmanship. The Big Ten takes pride in acting with class. That didn’t happen today.”Michigan athletic director Warde Manuel issued a statement saying he had apologised to McIntosh and that Michigan president Mary Sue Coleman had contacted Wisconsin chancellor Rebecca Blank “to apologise for the totally unacceptable behaviour\".“There is no excuse for any of our staff or student-athletes to get into a physical altercation with others regardless of instigating factors,” Manuel said.https://twitter.com/CBSSportsHQ/status/1495493933010460673The Big Ten issued a statement saying it was “aware of a physical altercation involving Michigan head coach Juwan Howard” and that it was assessing the incident.Howard said he'd respect the Big Ten decision, whatever that may be.“We will review the situation more thoroughly and work with the Big Ten conference as they determine their disciplinary actions, and will determine if further disciplinary actions are warranted,” Manuel said.This isn’t Howard’s first high-profile incident with another Big Ten coach.Last season, he got into a shouting match with then Maryland coach Mark Turgeon during the conference tournament. Howard had to be restrained. He drew two technical fouls and was ejected from a game that Michigan ended up winning 79-66.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-21 19:44:34","full_description":"Angry about Wisconsin calling a late timeout, Michigan coach Juwan H'That's what escalated it'oward began arguing in the post-game handshake line. Moments later, he hit a Badgers assistant in the head, and mayhem erupted. The Wolverines' inability to boost their NCAA tournament credentials was the least of their concerns after a 77-63 loss at No.15 Wisconsin. Their head coach could be facing major discipline after his hit turned a pushing-and-shoving scrum into a punch-filled brawl. READ MORE: Langer ally quits Cricket Australia role READ MORE: Kevin Walters no closer to solving major Brisbane Broncos dilemma READ MORE: Djokovic fires warning to rivals ahead of return to ATP tour Howard struck Wisconsin assistant Joe Krabbenhoft after jawing with Wisconsin coach Greg Gard during the handshake line. The Big Ten said it planned to \"take swift and appropriate disciplinary action when it completes its review\". During his post-game media conference, Howard said he didn't like Wisconsin calling for a timeout with 15 seconds left and the Badgers leading by 15. “I thought it was not necessary at the moment, especially being a large lead,” Howard said. Gard said he called the timeout because his reserves were in the game and only had four seconds to get the ball past mid-court. A timeout gives them 10 seconds. “I was not going to put them in position, where the ball had already gotten knocked out of bounds, to have to break a press in four seconds,” Gard said. After the game, Howard pointed a finger at Gard while complaining about the late move. Later on, Howard reached through a crowd to get to Krabbenhoft, replays showing Howard had his hand open as he struck Krabbenhoft on the left side of the head. Players from each side got involved in the skirmish, and video appeared to show Michigan's Moussa Diabate and Wisconsin's Jahcobi Neath throwing punches. Howard said he reacted after someone from Wisconsin put hands on him. He said that “at that point, I felt it was time to protect myself\". Video showed Gard had his hands touching Howard’s arm or wrist area while trying to explain why he called the timeout. “Someone touched me, and I think it was very uncalled for, for them to touch me, as we were verbalising and communicating with one another,” Howard said. \"That’s what escalated it.” Wisconsin athletic director Chris McIntosh said he had already contacted Big Ten commissioner Kevin Warren about the situation, adding that Wisconsin had staff members who were “affected and injured\". “There’s no room, no space for conduct like that in any competition, much less a Big Ten competition,\" McIntosh said. \"The Big Ten takes pride in sportsmanship. The Big Ten takes pride in acting with class. That didn’t happen today.” Michigan athletic director Warde Manuel issued a statement saying he had apologised to McIntosh and that Michigan president Mary Sue Coleman had contacted Wisconsin chancellor Rebecca Blank “to apologise for the totally unacceptable behaviour\". “There is no excuse for any of our staff or student-athletes to get into a physical altercation with others regardless of instigating factors,” Manuel said. The Big Ten issued a statement saying it was “aware of a physical altercation involving Michigan head coach Juwan Howard” and that it was assessing the incident. Howard said he'd respect the Big Ten decision, whatever that may be. “We will review the situation more thoroughly and work with the Big Ten conference as they determine their disciplinary actions, and will determine if further disciplinary actions are warranted,” Manuel said. This isn’t Howard’s first high-profile incident with another Big Ten coach. Last season, he got into a shouting match with then Maryland coach Mark Turgeon during the conference tournament. Howard had to be restrained. He drew two technical fouls and was ejected from a game that Michigan ended up winning 79-66. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/412539/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"What is The Hundred's Deadline Day?","link":"https://www.skysports.com/cricket/news/12040/12548248/what-is-the-hundreds-deadline-day-the-key-questions-answered-on-what-will-be-revealed","keywords":null,"creator":null,"video_url":null,"description":"Ahead of The Hundred's Deadline Day on Tuesday, we answer the key questions before the cricket stars are unveiled...","content":null,"pubDate":"2022-02-21 19:00:00","full_description":"Last Updated: 21/02/22 7:18pm Please use Chrome browser for a more accessible video player Ahead of The Hundred's Deadline Day on Tuesday, we answer the key questions before the cricket stars are unveiled... The Hundred's Deadline Day is the first chance to see who will play for the different teams this summer, live on Sky Sports. Please use Chrome browser for a more accessible video player On Deadline Day, all the retained players for 2022 will be announced. Teams can keep anyone who played last year or who had to withdraw due to injury or travel restrictions. The women's squads can retain as many players as they wish, which means some teams could have the same 15 players as for last year's Hundred. Please use Chrome browser for a more accessible video player Men's squads can retain up to 10 members of their 2021 squad and assign them across seven wage bands. The head coaches are looking to fill their squads, and can include up to three overseas stars. They will also include a minimum of one England Test-contracted player. Anyone who is not retained goes into The Hundred Men's Draft on March 30. Please use Chrome browser for a more accessible video player Sky Sports will show every game of The Hundred live this summer, starting with the opening match on Wednesday August 3 between defending men's champions Southern Brave and Welsh Fire at The Ageas Bowl. Please use Chrome browser for a more accessible video player The women's competition begins a week later on Thursday August 11 following the conclusion of the 2022 Commonwealth Games in Birmingham where women's cricket is making its debut. Reigning champions Oval Invincibles will face Northern Superchargers in the opening women's game in The Hundred, which will be the first men's and women's double-header of the 2022 competition. Please use Chrome browser for a more accessible video player Invincibles vs Superchargers will take the evening slot at The Kia Oval, after their respective men's sides meet earlier in the afternoon in south London. From then on, every matchday will see men's and women's fixtures on the same day, with every game available to watch live on Sky Sports. Hundred Finals Day will take place at Lord's on Saturday September 3. Please use Chrome browser for a more accessible video player Women's matches to be played first unless otherwise stated Wed Aug 3: Southern Brave vs Welsh Fire (7pm)* Thu Aug 4: Oval Invincibles vs London Spirit (6.30pm)* Fri Aug 5: Manchester Originals vs Northern Superchargers (6.30pm)* Sat Aug 6: Trent Rockets vs Birmingham Phoenix (2.30pm)* Sun Aug 7: Welsh Fire vs Oval Invincibles (2pm)* Mon Aug 8: London Spirit vs Manchester Originals (6.30pm)* Tue Aug 9: Northern Superchargers vs Trent Rockets (6.30pm)* Wed Aug 10: Birmingham Phoenix vs Southern Brave (6.30pm)* Thu Aug 11: Oval Invincibles vs Northern Superchargers (3pm and 6.30pm)** Fri Aug 12: Southern Brave vs London Spirit (3pm and 6.30pm) Sat Aug 13: Manchester Originals vs Trent Rockets (11am and 2.30pm) Sat Aug 13: Welsh Fire vs Birmingham Phoenix (2.30pm and 6pm) Sun Aug 14: Northern Superchargers vs London Spirit (11am and 2.30pm) Sun Aug 14: Oval Invincibles vs Southern Brave (2.30pm and 6pm) Mon Aug 15: Birmingham Phoenix vs Trent Rockets (3pm and 6.30pm) Tue Aug 16: Manchester Originals vs Welsh Fire (3pm and 6.30pm) Wed Aug 17: Trent Rockets vs Oval Invincibles (3.30pm and 7pm) Thu Aug 18: Southern Brave vs Manchester Originals (3.30pm and 7pm) Fri Aug 19: Birmingham Phoenix vs Northern Superchargers (3.30pm and 7pm) Sat Aug 20: Trent Rockets vs London Spirit (3.30pm and 7pm) Sun Aug 21: Northern Superchargers vs Manchester Originals (3.30pm and 7pm) Mon Aug 22: Welsh Fire vs Southern Brave (3pm and 6.30pm) Tue Aug 23: Oval Invincibles vs Birmingham Phoenix (3pm and 6.30pm) Wed Aug 24: London Spirit vs Welsh Fire (3pm and 6.30pm) Thu Aug 25: Southern Brave vs Trent Rockets (3.30pm and 7pm) Fri Aug 26: Welsh Fire vs Northern Superchargers (3.30pm and 7pm) Sat Aug 27: London Spirit vs Oval Invincibles (3.30pm and 7pm) Sun Aug 28: Birmingham Phoenix vs Manchester Originals (3.30pm and 7pm) Mon Aug 29: Trent Rockets vs Welsh Fire (3.30pm and 7pm) Tue Aug 30: London Spirit vs Birmingham Phoenix (3pm and 6.30pm) Wed Aug 31: Northern Superchargers vs Southern Brave (11.30am and 3pm) Wed Aug 31: Manchester Originals vs Oval Invincibles (3pm and 6.30pm) Fri Sep 2: Eliminator, Ageas Bowl (3pm and 6.30pm) Sat Sep 3: Final, Lord's (3pm and 6.30pm) Sun Sep 4: Reserve day * Men's match only due to Commonwealth Games ** Women's match to be played second","image_url":"https://e0.365dm.com/22/01/1920x1080/southern-brave-the-hundred_5654195.jpg?20220127140656","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"State Government grants Shire of Dardanup $700,000 worth of grant funding for Pratt Road sporting complex","link":"https://thewest.com.au/news/south-west/state-government-grants-shire-of-dardanup-700000-worth-of-grant-funding-for-pratt-road-sporting-complex-c-5748864","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Bunbury’s reigning cricket premiers have received another massive boost, with funding for a long-awaited facility upgrade confirmed.","content":null,"pubDate":"2022-02-21 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5748864/76295332a2a607c3111756025e7e94bae8e42544-16x9-x0y270w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Finals start this weekend as part of Albany & Districts Cricket Association COVID mitigation plan","link":"https://thewest.com.au/news/albany-advertiser/finals-start-this-weekend-as-part-of-albany-districts-cricket-association-covid-mitigation-plan-c-5779903","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"The ADCA executive met on Sunday and immediately brought its senior and junior seasons forward by several weeks.","content":null,"pubDate":"2022-02-21 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5779903/4ee845132281839e29d3e498a2a4ed22a75ebb75-16x9-x0y221w4236h2383.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"State Government grants Shire of Dardanup $700,000 worth of grant funding for Pratt Road sporting complex","link":"https://thewest.com.au/news/south-west/state-government-grants-shire-of-dardanup-700000-worth-of-grant-funding-for-pratt-road-sporting-complex-c-5748864","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Bunbury’s reigning cricket premiers have received another massive boost, with funding for a long-awaited facility upgrade confirmed.","content":null,"pubDate":"2022-02-21 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5748864/76295332a2a607c3111756025e7e94bae8e42544-16x9-x0y270w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"Questions Will Be Raised\": Aakash Chopra On India Opener's Strike Rate - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvcXVlc3Rpb25zLXdpbGwtYmUtcmFpc2VkLWFha2FzaC1jaG9wcmEtb24taW5kaWEtb3BlbmVycy1zdHJpa2UtcmF0ZS0yNzgxMDcz0gFxaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9xdWVzdGlvbnMtd2lsbC1iZS1yYWlzZWQtYWFrYXNoLWNob3ByYS1vbi1pbmRpYS1vcGVuZXJzLXN0cmlrZS1yYXRlLTI3ODEwNzMvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Questions Will Be Raised\": Aakash Chopra On India Opener's Strike Rate  NDTVSports.com'Questions will be raised repeatedly': Chopra raises concerns over India batter's strike-rate; 'Not able to do that job'  Hindustan TimesWatch: Rohit Sharma's reaction goes viral after Mumbai Indians teammate Ishan Kishan gets clean bowled  DNA India‘Questions will be raised repeatedly’ – Aakash Chopra on Ishan Kishan’s poor strike rate against West Indies  CricTrackerIND vs WI: Watch – Harshal Patel Bamboozles Roston Chase With An Off-cutter In 3rd T20I  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-02-21 15:27:13","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Legends Are Forever\": Waqar Younis' Glowing Praise For Former Teammate","link":"https://sports.ndtv.com/cricket/legends-are-forever-waqar-younis-glowing-praise-for-wasim-akram-2780970","keywords":null,"creator":null,"video_url":null,"description":"On Sunday, Waqar Younis took to Twitter to praise Wasim Akram after the former Pakistan captain was inducted in the Pakistan Cricket Board 'Hall Of Fame'.","content":null,"pubDate":"2022-02-21 14:47:34","full_description":"They were and are still considered one of the finest fat bowling duo to have ever played the game of cricket. The 90s was a decade that belonged to the two Ws from Pakistan. Wasim Akram's lethal swing and Waqar Younis' pace and movement terrorised batter all over the world. The duo was a handful on any surface and together they won many matches for Pakistan in the 1990s. On Sunday, Waqar took to Twitter to praise Wasim Akram after the former Pakistan captain was inducted in the Pakistan Cricket Board 'Hall Of Fame'. \"Pride of performance, Hilal-e-Imtiaz, ICC & PCB Hall of Fame. 916 Inter wkts with 3 Hat tricks.Heroes come and go but Legends are forever. Tribute to the Legend. @wasimakramlive Well deserve Honour @TheRealPCB Proud moment for all Pakistan,\" Waqar wrote on twitter along with posting photos of Akram. Pride of performance, Hilal-e-Imtiaz, ICC & PCB Hall of Fame. 916 Inter wkts with 3 Hat tricks.Heroes come and go but Legends are forever. Tribute to the Legend. @wasimakramlive Well deserve Honour @TheRealPCB Proud moment for all ????????. pic.twitter.com/bdor0LaeA3 The post was liked by Akram and soon gathered a lot of lokes and comments from cricket fans. Akram is the first player to be formally inducted into the PCB Hall of Fame, and will be followed by seven more players -- Abdul Qadir, Fazal Mahmood, Hanif Mohammad, Imran Khan, Javed Miandad, Waqar Younis and Zaheer Abbas -- in the coming days. Promoted \"It has been an honour to represent Pakistan over 18 years during which I played in 460 international matches. Every wicket and every run I scored in these matches was priceless. I can't thank God Almighty enough for providing me the opportunity to serve this great country at the highest level,\" Akram was quoted as saying by PCB's official website. \"I want to thank all my fans who have been my greatest strengths. Their support has been invaluable. I also want to thank my family and friends who stood beside me during this incredible journey,\" he added.","image_url":"https://c.ndtvimg.com/2021-03/51d4oh68_waqar-younis-afp_650x400_28_March_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"PSL final match tickets online booking: 2022 Playoffs PSL tickets for sale","link":"https://thesportsrush.com/cricket-news-psl-final-match-tickets-online-booking-2022-playoffs-psl-tickets-for-sale/","keywords":["Cricket","Pakistan Super League","PSL 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"PSL final match tickets: The SportsRush present before you full ticketing details for Pakistan Super League 2022 playoffs. While a league match is left to be played, the seventh season of the Pakistan Super League is all set to enter its most important phase in the form of the playoffs. Starting from February 23, four… The post PSL final match tickets online booking: 2022 Playoffs PSL tickets for sale appeared first on The SportsRush.","content":"PSL final match tickets: The SportsRush present before you full ticketing details for Pakistan Super League 2022 playoffs. While a league match is left to be played, the seventh season of the Pakistan Super League is all set to enter its most important phase in the form of the playoffs. Starting from February 23, four out of six teams will play the remaining four matches to decide the winner of this season. Four teams which have qualified for the playoffs are Multan Sultans, Lahore Qalandars, Peshawar Zalmi and Islamabad United. Scheduled to be played in Lahore tonight, the final league match between Lahore Qalandars and Peshawar Zalmi is quite unlikely to change the positions on the points table. Two in-form teams play each other in the final round game of the #HBLPSL7. Whose day is it going to be? #LevelHai l #LQvPZ pic.twitter.com/KODzQ4KcLi — PakistanSuperLeague (@thePSLt20) February 21, 2022 PSL final match tickets Readers must note that the tickets for PSL 2022 playoffs can be bought from Book Me. You can visit either their website or application to book tickets for the business end of PSL 7. All you have to do is click on the “Cricket” icon on the homepage. The next page will require you to click on “Book PSL 7 tickets”. Subsequently, select the preferred match and click on Book Me. ALSO READ: Will Shadab Khan lead Islamabad United in PSL 2022 playoffs? The next page will ask you to select your preferred ticket(s) according to various stands of the stadium. Upon selecting the required number of tickets of your preferred price category, follow simple steps to complete the online transaction. To easily reach the Book Me page for booking tickets of PSL 7 matches at Gaddafi Stadium, click here. It is worth mentioning that tickets for the playoffs of PSL 2022 are currently sold out on Book Me and that there is no update regarding addition of more tickets or offline ticket counters for now. The post PSL final match tickets online booking: 2022 Playoffs PSL tickets for sale appeared first on The SportsRush.","pubDate":"2022-02-21 14:28:12","full_description":"PSL final match tickets: The SportsRush present before you full ticketing details for Pakistan Super League 2022 playoffs. While a league match is left to be played, the seventh season of the Pakistan Super League is all set to enter its most important phase in the form of the playoffs. Starting from February 23, four out of six teams will play the remaining four matches to decide the winner of this season. Four teams which have qualified for the playoffs are Multan Sultans, Lahore Qalandars, Peshawar Zalmi and Islamabad United. Scheduled to be played in Lahore tonight, the final league match between Lahore Qalandars and Peshawar Zalmi is quite unlikely to change the positions on the points table. Two in-form teams play each other in the final round game of the #HBLPSL7 . Whose day is it going to be? #LevelHai l #LQvPZ pic.twitter.com/KODzQ4KcLi — PakistanSuperLeague (@thePSLt20) February 21, 2022 Readers must note that the tickets for PSL 2022 playoffs can be bought from Book Me. You can visit either their website or application to book tickets for the business end of PSL 7. All you have to do is click on the “Cricket” icon on the homepage. The next page will require you to click on “Book PSL 7 tickets”. Subsequently, select the preferred match and click on Book Me. ALSO READ: Will Shadab Khan lead Islamabad United in PSL 2022 playoffs? The next page will ask you to select your preferred ticket(s) according to various stands of the stadium. Upon selecting the required number of tickets of your preferred price category, follow simple steps to complete the online transaction. To easily reach the Book Me page for booking tickets of PSL 7 matches at Gaddafi Stadium, click here . It is worth mentioning that tickets for the playoffs of PSL 2022 are currently sold out on Book Me and that there is no update regarding addition of more tickets or offline ticket counters for now.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Who made our AIC First XI Team of the Week?","link":"https://www.cairnspost.com.au/sport/cricket/team-of-the-week-aic-first-xi-cricket/news-story/724f0c6969764a1504c471db74499081","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Iona College batsman Harley Malpass saved his side from a potential disaster in AIC First XI cricket at the weekend.","content":null,"pubDate":"2022-02-21 14:00:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"MS Dhoni spends ‘15 times more’ time on THIS activity than on cricket: Harbhajan Singh makes BIG revelation","link":"https://zeenews.india.com/cricket/ms-dhoni-spends-15-times-more-time-on-this-activity-than-on-cricket-harbhajan-singh-makes-big-revelation-2438561.html","keywords":null,"creator":null,"video_url":null,"description":"Harbhajan Singh has revealed how CSK skipper MS Dhoni likes to spend his time away from cricket.","content":null,"pubDate":"2022-02-21 13:52:00","full_description":"MS Dhoni may be one of the most followed celebrities in India but he stays away from the limelight whenever he isn't playing cricket. The former India captain is hardly active on social media which makes fans wonder what keeps Dhoni busy when he is away from the game. Shedding the light on the same, former India off-spinner Harbhajan Singh, who recently retired from cricket, revealed that Dhoni is a big fan of Esports and loves to play games like FIFA and PUBG. Harbhajan even claimed that Dhoni spends 15 times more time playing Esports than he does playing cricket. Talking to IndiaToday Gaming during the award ceremony of the World Esports Cup (WEC), Harbhajan said, \"Yes, every cricketer in the Indian team plays Esports. I have also played. Our former captain, MS Dhoni, he plays Esports 15 times more than the cricket he plays. After matches, if you see him in the hotel room, he spends his time playing Esports. Sometimes, FIFA, sometimes PUBG, sometimes other games. Esports is a big, big thing. We cricketers also used to form teams and play these first-person shooter games online.\" Harbhajan also highlighted how the Esports industry has seen a big boom in recent times and nowadays people are even making a career out of it as well. \"For us it's a new thing...we used to play for the sake of entertainment. But people are making a career out of it now. There are analysts for them, there are discussions around it and even coaching is provided to make them understand the nuances of the game. Not only the players but many people are now associating with it in order to be something. Numbers are going to be massive. This is just the start of Esports. It will grow in unimaginable ways,\" said Harbhajan, who announced his retirement from all formats of cricket recently. Meanwhile, Dhoni, who took retirement from international cricket in 2020, will be seen leading Chennai Super Kings (CSK) in the upcoming IPL 2022.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Marsh One Day Cup 2022 Live Telecast Channel in India and Australia: When and where to watch Australia Domestic One Day Cup?","link":"https://thesportsrush.com/cricket-news-marsh-one-day-cup-2022-live-telecast-channel-in-india-and-australia-when-and-where-to-watch-australia-domestic-one-day-cup/","keywords":["Cricket","Marsh Cup 2021-22"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Marsh One Day Cup 2022 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of Marsh Cup 2022. The 13th match of the ongoing season of the Marsh Cup will be played between Victoria and Queensland in Melbourne on February 23. A double-header will also witness New South Wales hosting… The post Marsh One Day Cup 2022 Live Telecast Channel in India and Australia: When and where to watch Australia Domestic One Day Cup? appeared first on The SportsRush.","content":"Marsh One Day Cup 2022 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of Marsh Cup 2022. The 13th match of the ongoing season of the Marsh Cup will be played between Victoria and Queensland in Melbourne on February 23. A double-header will also witness New South Wales hosting Tasmania in Sydney. Having faced the brunt of a hectic summer schedule including Ashes 2021-22, Big Bash League 2021-22 and other international matches amid COVID-19 pandemic, Australia’s premier domestic One-Day competition will resume yet again to complete the remaining seven matches including the final on March 11. A primary reason why Victoria vs Queensland contest will be keenly followed not just in Australia but other countries as well is the return of all-rounder Glenn Maxwell to the competition after more than two years. Slated to meet first for the first time in more than two years, fans can brace themselves for an intriguing Victoria vs Queensland contest at the Junction Oval. The last Victoria-Queensland Marsh Cup match was also played at the same venue when Victoria batter Aaron Finch’s (not playing Wednesday’s match) career-best List A score of 188* (151) had outperformed Queensland captain Usman Khawaja’s 112 (125) in a 305-run chase. Marsh One Day Cup 2022 Live Telecast Channel in India and Australia Indian fans will have no option than to miss Marsh Cup 2021-22 matches as no channel is televising the tournament in the country. While Sony Sports Network had live streamed the competition in times of limited content due to COVID-19, even that option isn’t available anymore. Fans in India can keep an eye on cricket.com.au’s Twitter handle for they are almost certain of uploading key highlights from the match on their social media handle. On the other hand, Australia fans will have the option of picking from cricket.com.au or Kayo to live stream Marsh One Day Cup matches. Date – 23/02/2022 (Wednesday) and 11/03/2022 (Friday). Match start Time – 05:35 AM (India) and 11:05 AM (Australia). TV Channel – Not available (India and Australia). Online platform – Not available (India) and cricket.com.au and Kayo app (Australia). The post Marsh One Day Cup 2022 Live Telecast Channel in India and Australia: When and where to watch Australia Domestic One Day Cup? appeared first on The SportsRush.","pubDate":"2022-02-21 13:51:36","full_description":"Marsh One Day Cup 2022 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of Marsh Cup 2022. The 13th match of the ongoing season of the Marsh Cup will be played between Victoria and Queensland in Melbourne on February 23. A double-header will also witness New South Wales hosting Tasmania in Sydney. Having faced the brunt of a hectic summer schedule including Ashes 2021-22, Big Bash League 2021-22 and other international matches amid COVID-19 pandemic, Australia’s premier domestic One-Day competition will resume yet again to complete the remaining seven matches including the final on March 11. A primary reason why Victoria vs Queensland contest will be keenly followed not just in Australia but other countries as well is the return of all-rounder Glenn Maxwell to the competition after more than two years . Slated to meet first for the first time in more than two years, fans can brace themselves for an intriguing Victoria vs Queensland contest at the Junction Oval. The last Victoria-Queensland Marsh Cup match was also played at the same venue when Victoria batter Aaron Finch’s (not playing Wednesday’s match) career-best List A score of 188* (151) had outperformed Queensland captain Usman Khawaja’s 112 (125) in a 305-run chase. Indian fans will have no option than to miss Marsh Cup 2021-22 matches as no channel is televising the tournament in the country. While Sony Sports Network had live streamed the competition in times of limited content due to COVID-19, even that option isn’t available anymore. Fans in India can keep an eye on cricket.com.au’s Twitter handle for they are almost certain of uploading key highlights from the match on their social media handle. On the other hand, Australia fans will have the option of picking from cricket.com.au or Kayo to live stream Marsh One Day Cup matches. Date – 23/02/2022 (Wednesday) and 11/03/2022 (Friday). Match start Time – 05:35 AM (India) and 11:05 AM (Australia). TV Channel – Not available (India and Australia). Online platform – Not available (India) and cricket.com.au and Kayo app (Australia).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cousin Ishan advised me to be patient, says Bengal star debutant Abishek Porel","link":"https://sportstar.thehindu.com/cricket/domestic/cousin-ishan-advised-me-to-be-patient-bengal-debutant-abishek-porel-ranji-trophy-news/article38433881.ece","keywords":null,"creator":["Y.B. Sarangi"],"video_url":null,"description":"Abishek, who followed in his cousin and Bengal seamer Ishan Porel’s footsteps in taking up cricket, said some advice from Ishan benefited him while playing at the elite domestic tournament.","content":null,"pubDate":"2022-02-21 13:49:58","full_description":"Nineteen-year-old Abishek Porel is ahead of his age in terms of handling pressure. Even after forming a match-winning century stand with Shahbaz Ahmed to help Bengal record a come-from-behind win over Baroda in its opening Ranji Trophy match at the Barabati Stadium here, Abishek – who scored a half-century (53 not out) on debut – had his emotions in check. ALSO READ : Ranji Trophy: Bengal comes from behind for surprise win; Shahbaz shines “I went in with a positive mindset. No matter whatever the situation, I play my natural game. I made a mistake (to be caught). I was lucky it was called a no ball. My intent was to play my natural game. Pressure was there but I love batting under pressure,” Porel, who was among the reserves for the under-19 World Cup-bound Indian side, told Sportstar . “Shahbaz told me to play my natural game and guided me well. He gave good inputs about the pitch.” Abishek’s fine performance hardly surprised his childhood coach Bibhas Das. “I was optimistic about Abishek’s debut. He was disappointed as he had done well in Cooch Behar Trophy but did not get a chance in the under-19 World Cup (as he remained a reserve player). I boosted his spirits by telling him to prove his worth. “He is a natural stroke player and plays according to the situation. Never comes under pressure. Normally, he bats up the order, but here he handled the situation well batting lower,” said Das. “Abishek has a classic style of wicket-keeping. It is his passion. He needs to work on his footwork though. I will request Wriddhiman (Saha) to work with him.” ALSO READ : Former Air force man Saurabh Kumar ready for 'India Test' Abishek, who followed in his cousin and Bengal seamer Ishan Porel’s footsteps in taking up cricket, said some advice from Ishan benefited him while playing at the elite domestic tournament. “There are some differences between under-19 and senior levels. My brother advised me to be patient as there would not be too many easy deliveries. “Senior players like Manoj (Tiwary), Shahbaz (Ahmed) and Abhimanyu (Easwaran) are all like friends and guide me well. It does not feel like I am among the seniors,” said Abishek, as he looks forward to a successful season.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India women's team batter VR Vanitha, 31, announces retirement","link":"https://www.tribuneindia.com/news/sports/india-womens-team-batter-vr-vanitha-31-announces-retirement-371843","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, February 21 Batter VR Vanitha, who represented the country in six women's ODIs and 16 T20Is from 2014 to 2016, on Monday announced retirement from all forms of the game at the age of 31. She made her announcement via Twitter and India team-mates Jhulan Goswami and Mithali Raj were among those thanked by the cricketer who made her debut for the national team in an ODI against Sri Lanka in January 2014. Besides, she thanked her family members, friends, mentor and other team-mates who had been part of her journey in the sport. Vanitha also thanked the two state associations -- Karnataka and Bengal -- that she represented in domestic cricket. \"Nineteen years ago, when I started playing, I was just a little girl who loved sport. Even to this day, my love for cricket remains the same. What's changing is direction. My heart says continue playing, my body says stop and I have decided to listen to the latter. Time is ripe to hang my boots,\" Vanitha said in the post. \"I hereby announce my retirement from all forms of cricket. It's been a journey of struggles, joy, heartbreak, learning and personal milestones. While there are a few regrets, I'm grateful for the opportunities I got, especially to represent India.\" She called her retirement from the game \"not the end but the beginning of a new challenge\". In the limited number of ODIs and T20Is she played, Vanitha scored 85 and 216 runs, respectively, and was a part of India's squad during the Women's World T20 at home. During the 2021-22 domestic season, Vanitha guided Bengal to the semi-finals of the Women's Senior One-Day Trophy, scoring 225 runs with knocks of 61 against Andhra and a 71-ball 107 against Hyderabad. She enjoyed a strike rate of over 100 in the tournament.","content":null,"pubDate":"2022-02-21 13:32:37","full_description":"New Delhi, February 21 Batter VR Vanitha, who represented the country in six women's ODIs and 16 T20Is from 2014 to 2016, on Monday announced retirement from all forms of the game at the age of 31. She made her announcement via Twitter and India team-mates Jhulan Goswami and Mithali Raj were among those thanked by the cricketer who made her debut for the national team in an ODI against Sri Lanka in January 2014. Besides, she thanked her family members, friends, mentor and other team-mates who had been part of her journey in the sport. Vanitha also thanked the two state associations -- Karnataka and Bengal -- that she represented in domestic cricket. \"Nineteen years ago, when I started playing, I was just a little girl who loved sport. Even to this day, my love for cricket remains the same. What's changing is direction. My heart says continue playing, my body says stop and I have decided to listen to the latter. Time is ripe to hang my boots,\" Vanitha said in the post. \"I hereby announce my retirement from all forms of cricket. It's been a journey of struggles, joy, heartbreak, learning and personal milestones. While there are a few regrets, I'm grateful for the opportunities I got, especially to represent India.\" She called her retirement from the game \"not the end but the beginning of a new challenge\". In the limited number of ODIs and T20Is she played, Vanitha scored 85 and 216 runs, respectively, and was a part of India's squad during the Women's World T20 at home. During the 2021-22 domestic season, Vanitha guided Bengal to the semi-finals of the Women's Senior One-Day Trophy, scoring 225 runs with knocks of 61 against Andhra and a 71-ball 107 against Hyderabad. She enjoyed a strike rate of over 100 in the tournament.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1172090799.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"CLJ vs CAR Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for European Cricket League 2022, Match 4","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/clj-vs-car-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-european-cricket-league-2022-match-4?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-21 13:31:18","full_description":"Cluj (CLJ) will take on Carlton (CAR) in the fourth match of the European Cricket League 2022 at the Cartama Oval in Cartama on Monday. Carlton are one of the most formidable sides in Group C of the European Cricket League. They have a decent blend of youth and experience. Meanwhile, Cluj have a younger squad, and will hope to have a fruitful start to their campaign. Satwik Nadigotla (wk), Sivakumar Periyalwar, Sohel Shaikh, Taranjeet Singh, Anand Rajshekara, Nishant Devre, Gaurav Mishra, Rajendra Pisal-l, Arun Kumar Chandrasekaran, Sukhkaran Sahi, Aftab Ahmeed Kayani. Rory McCann, Hugo Southwell, Fraser Burnett, Syed Ali Murtaza Shah, Murray Whitaker, Adeel Raza, Arun Pillai, Angus Beattie, Alasdair Evans, Harry Simpson, Shivam Gupta. Match: CLJ vs CAR, European Cricket League 2022, Match 4. Date and Time: February 21, 2022; 7:30 PM IST. Venue: Cartama Oval, Cartama. Going by previous games, the track seems to be a batting paradise. High scores are common on this ground, as the ball skids and comes on to the bat. A total of 120 could prove to be a par score at this venue, and the team winning the toss could opt to bat first. S Nadigotla is a decent choice for the wicketkeeper position in your Dream11 Fantasy team. The top-order batter has scored 183 runs in eight games in the tournament, at an average of 30.5 and at a strike rate of 205.6. Taranjeet Singh has begun his campaign in impeccably, scoring 28 runs and picking up two wickets in the first game. He could also prove to be a valuable multiplier pick. N Devre is an excellent player who’s like to fetch plenty of fantasy points. He has scored 77 runs, and has also scalped eight wickets in 12 T10 games. He could prove to be a great multiplier choice in your CLJ vs CAR Dream11 Fantasy team. A Evans is a wonderful bowler who will hope to get into stride quickly. Taranjeet Singh (CLJ). S Nadigotla (CLJ). N Devre (CLJ). A Raza (CAR). A Evans (CAR). Taranjeet Singh: 493 runs and 12 wickets in ten games. S Nadigotla: 183 runs in eight games. N Devre: 77 runs and eight wickets in 12 games. Fantasy Suggestion #1: S Nadigotla, Taranjeet Singh, S Shaikh, F Burnett, S Periyalwar, N Devre, G Mishra, A Raza, A Kumar Chandrasekaran, A Evans, H Simpson. Captain: Taranjeet Singh. Vice-Captain: N Devre. Fantasy Suggestion #2: S Nadigotla, Taranjeet Singh, S Shaikh, F Burnett, N Devre, G Mishra, A Raza, A Kumar Chandrasekaran, A Evans, H Simpson, S Sahi. Captain: A Raza. Vice-Captain: S Nadigotla.","image_url":"https://static.sportskeeda.com/editor/2022/02/fb262-16454455833790-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Kerala cricket on the right track: Vishnu Vinod","link":"https://www.thehindu.com/sport/cricket/kerala-cricket-on-the-right-track-vishnu-vinod/article65070795.ece","keywords":null,"creator":["\n        P. K. Ajith Kumar  \n    "],"video_url":null,"description":"Kerala’s most expensive player at IPL auction impressed with youngsters in the team","content":null,"pubDate":"2022-02-21 13:14:47","full_description":"Thrilled: Vishnu Vinod is happy that the Ranji Trophy is back this season. | Photo Credit: Special Arrangement Kerala cricket was in for a disappointment at the recent mega auction for the IPL. Only three home-grown Kerala players were bought by the franchises. It was six last year. At the auction, Vishu Vinod became the most expensive Kerala player at ₹50 lakh, against a base price of ₹20 lakh. The wicketkeeper-batter is set to join Sunrisers Hyderabad, after stints with Royal Challengers Bangalore and Delhi Capitals. He is not thinking about the IPL at the moment, though. He is focussed on the on-going Ranji Trophy tournament. After Kerala won its first match against Meghalaya with a day to spare, the 28-year-old is looking forward to the game against Gujarat, starting at the Saurashtra Cricket Association Stadium here on Thursday. “Gujarat is a strong team, but we had beaten them at Krishnagiri (Wayanad) two years ago in the quarterfinal so we are confident,” Vishnu told The Hindu . “And it is nice to notice that everyone contributed to the win against Meghalaya.” He is glad that the Ranji Trophy is back. “It was frustrating that there was no Ranji last season because of Covid,” he said. “I am 28 and for players like me it was a big blow. I have always enjoyed playing red-ball cricket.” Though he has had more success in the white-ball format, one of his finest knocks came in the Ranji Trophy, against Madhya Pradesh in 2018 at Thiruvananthapuram. His unbeaten 193 and his 199-run run partnership with captain Sachin Baby had brought Kerala back into the game from a hopeless position. With that innings Vishnu showed that his batting wasn’t all about big hits and that he could adapt to the more demanding longer format. He played a similar knock just a couple of months ago, in this very city. His unbeaten 100 off 82 balls gave Kerala an unlikely four-wicket win against Maharashtra in the Vijay Hazare Trophy one-day tournament. He had added 174 for the unbroken seventh wicket with Sijomon Joseph. As someone who touched the hard cricket ball only at the age of 13, he has indeed come a long way. “Back in my village, Perunad in Pathanamthitta district, it was with the tennis ball that I played for many years,” he said. “It was after I was selected in the Kerala Under-19 team in 2012 that I felt I could have a career in cricket.” Vishnu believes Kerala cricket is on the right track. “Look at the way three newcomers — Edhen Apple Tom, Vathsal Govind and Rohan Kunnummal — performed here,” he said. “It is great watching our youngsters doing well in the Ranji Trophy.” Our code of editorial values Printable version | Feb 21, 2022 6:48:11 pm | https://www.thehindu.com/sport/cricket/kerala-cricket-on-the-right-track-vishnu-vinod/article65070795.ece © THG PUBLISHING PVT LTD.","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Radical idea floated to make MCG 'sensational'","link":"https://wwos.nine.com.au/news/cricket-afl-mcg-rebuild-development-plans-eddie-mcguire/c958546d-1257-41b8-b48b-151cc1c90ac3","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former Collingwood president Eddie McGuire has floated a radical idea amid billion-dollar redevelopment plans for the MCG.","content":"Former Collingwood president Eddie McGuire has made a radical proposal amid billion-dollar plans for the biggest redevelopment in MCG history, calling for a roof to be put on the iconic venue.The Age reported the Victorian government was preparing a feasibility study that would decide the future of the 45,000-seat Great Southern Stand, which accommodates almost half of the 100,024-strong capacity.The study is expected to propose a full rebuild of the 30-year-old stand at a cost of more than $1 billion, amid concerns the venue will soon be eclipsed by stadiums in Australia and abroad.READ MORE: Langer ally quits Cricket Australia roleREAD MORE: Kevin Walters no closer to solving major Brisbane Broncos dilemmaREAD MORE: Djokovic fires warning to rivals ahead of return to ATP tourThe MCG's 100,000-seat capacity is likely to be reduced and renovations are predicted to take two to three years.The MCG will become the second major Melbourne sporting venue to have a roof – the other is Docklands Stadium – if McGuire's proposal is acted on.\"It's got to be a knock-over, because the (Great Southern) Stand itself is just structurally not the right shape for where we need to go with what we need to build at the MCG,\" McGuire, who attended this month's Super Bowl at the $7.7 billion SoFi Stadium in Los Angeles, said on SEN radio.\"To be perfectly honest, we should be looking at even putting a roof on the MCG, or at least a sliding roof over the top of it. The difference between the stadium and what we saw the other day (at the Super Bowl) was the unbelievable audiovisual opportunities with that screen that was right around the stadium perimeter inside hanging down.\"It's not that long ago that we used to get excited about maybe having a video screen at your seat.\"It has to be a better experience than what you have at home, and we've had two years to be at home.\"MCG management, the Melbourne Cricket Club, is concerned about the Great Southern Stand's limited disability access, a lack of food and beverage options, old seating and congestion at entry and exit points.AFL, cricket and other sports will continue to be played at the MCG if rebuild plans for the venue go ahead, The Age reported.COVID-19 complications dealt the Gabba and Perth Stadium the 2020 and 2021 AFL grand finals respectively, but the MCG is contracted to host the game's showpiece event until 2059.\"Before we say we should be spending money on hospitals, there are buckets of cash,\" McGuire said.\"There are ways of doing it. One of those things is to look at the Southern Stand. At the moment it's a stand for sport when it's on. But if we do it properly, these can become many sorts of things.\"Let's use this precinct and turn it into something sensational, not just the footy game itself.\"While The Age reported the MCG capacity was likely to be reduced, McGuire suggested doing the opposite.\"The MCG is our beating heart of the city and the citadel of all sports,\" McGuire said.\"If we're going to continue to get big sports in, we need to have 100,000 or maybe even get up to 105,000 or 110,000.\"There is an opportunity for us to build the best stand for the general public of any facility in the world.\"","pubDate":"2022-02-21 13:05:44","full_description":"Former Collingwood president Eddie McGuire has made a radical proposal amid billion-dollar plans for the biggest redevelopment in MCG history, calling for a roof to be put on the iconic venue. The Age reported the Victorian government was preparing a feasibility study that would decide the future of the 45,000-seat Great Southern Stand, which accommodates almost half of the 100,024-strong capacity. The study is expected to propose a full rebuild of the 30-year-old stand at a cost of more than $1 billion, amid concerns the venue will soon be eclipsed by stadiums in Australia and abroad. READ MORE: Langer ally quits Cricket Australia role READ MORE: Kevin Walters no closer to solving major Brisbane Broncos dilemma READ MORE: Djokovic fires warning to rivals ahead of return to ATP tour The MCG's 100,000-seat capacity is likely to be reduced and renovations are predicted to take two to three years. The MCG will become the second major Melbourne sporting venue to have a roof – the other is Docklands Stadium – if McGuire's proposal is acted on. \"It's got to be a knock-over, because the (Great Southern) Stand itself is just structurally not the right shape for where we need to go with what we need to build at the MCG,\" McGuire, who attended this month's Super Bowl at the $7.7 billion SoFi Stadium in Los Angeles, said on SEN radio. \"To be perfectly honest, we should be looking at even putting a roof on the MCG, or at least a sliding roof over the top of it. The difference between the stadium and what we saw the other day (at the Super Bowl) was the unbelievable audiovisual opportunities with that screen that was right around the stadium perimeter inside hanging down. \"It's not that long ago that we used to get excited about maybe having a video screen at your seat. \"It has to be a better experience than what you have at home, and we've had two years to be at home.\" MCG management, the Melbourne Cricket Club, is concerned about the Great Southern Stand's limited disability access, a lack of food and beverage options, old seating and congestion at entry and exit points. AFL, cricket and other sports will continue to be played at the MCG if rebuild plans for the venue go ahead, The Age reported. COVID-19 complications dealt the Gabba and Perth Stadium the 2020 and 2021 AFL grand finals respectively, but the MCG is contracted to host the game's showpiece event until 2059. \"Before we say we should be spending money on hospitals, there are buckets of cash,\" McGuire said. \"There are ways of doing it. One of those things is to look at the Southern Stand. At the moment it's a stand for sport when it's on. But if we do it properly, these can become many sorts of things. \"Let's use this precinct and turn it into something sensational, not just the footy game itself.\" While The Age reported the MCG capacity was likely to be reduced, McGuire suggested doing the opposite. \"The MCG is our beating heart of the city and the citadel of all sports,\" McGuire said. \"If we're going to continue to get big sports in, we need to have 100,000 or maybe even get up to 105,000 or 110,000. \"There is an opportunity for us to build the best stand for the general public of any facility in the world.\"","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400816/raw-capture-sequence.00_05_11_06.still333.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Indian opener V.R. Vanitha announces retirement at 31","link":"https://sportstar.thehindu.com/cricket/indian-opener-vr-vanitha-announces-retirement-at-31/article38433808.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Indian opener V.R. Vanitha announced her retirement from all forms of cricket at the age of 31 in a post on Twitter on Monday.","content":null,"pubDate":"2022-02-21 12:28:41","full_description":"Indian opener V.R. Vanitha announced her retirement from all forms of cricket at the age of 31 on Monday. Vanitha informed about the decision to hang her boots in a post on Twitter. And this lovely innings comes to an END ! pic.twitter.com/ZJw9ieXHSO Vanitha, who played domestic cricket for Karnataka and Bengal, made her debut for the national team in an ODI against Sri Lanka in January 2014. She represented India in six ODIs and 16 T20Is in which she scored 85 and 216 runs respectively and was a part of India's squad during the Women's World T20 held at home.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IDCA to organise cricket meet for deaf","link":"https://www.indiatvnews.com/sports/cricket/idca-to-organise-cricket-meet-for-deaf-2022-02-21-760800","keywords":null,"creator":null,"video_url":null,"description":"The Indian Deaf Cricket Association (IDCA) on Monday said it is organising the third KFC one-day national zone cricket championship for players with hearing impairment from February 23-27.","content":null,"pubDate":"2022-02-21 12:24:02","full_description":"The Indian Deaf Cricket Association (IDCA) on Monday said it is organising the third KFC one-day national zone cricket championship for players with hearing impairment from February 23-27. The 50-over tournament, to be hosted by Madhyanchal Cricket Society of The Deaf in Madhya Pradesh, will witness the best deaf cricketing talent from across the country. Good performances in the tournament will help the players to stake a national team claim for the Deaf ICC T20 Champions Trophy, to be held in Qatar. The champion team will get a cash prize of Rs 1 lakh while the runners-up will pocket Rs 50,000. The Man of the Series will get Rs 5100, while the best bowler and best batter will pocket Rs 2500 per match. Sumit Jain, IDCA president, said, \"Our hardworking players are positive about reserving a spot for the Deaf ICCT20 Champions Trophy. We wish all the teams and its participants all the very best.\"","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"The classy touch of B. Indrajith, a fan of Mahela Jayawardene","link":"https://sportstar.thehindu.com/cricket/domestic/ranji-trophy-tamil-nadu-cricket-baba-indrajith-shahrukh-khan-kolkata-knight-riders-delhi-ipl/article38433687.ece","keywords":null,"creator":["S. Dinakar"],"video_url":null,"description":"Tamil Nadu batter Indrajith been outstanding in first-class cricket. In 54 matches, he has 3,509 runs at an average of 51.60.","content":null,"pubDate":"2022-02-21 12:01:39","full_description":"B. Indrajith's batsmanship is all about class with the lightness of feet, the soft touch of the willow, the delicately placed shots and timing. The ethereal 117 against Delhi in Ranji Trophy under pressure was indeed a classy knock. “I try to find the angles with my shots to pierce the gaps. For instance, striking between mid-off and cover or stroking to the right of mid-wicket,” Indrajith told Sportstar on Monday. Plenty of thought goes behind his batting while defending as well as attacking. And from a young age, his coach S. Balaji told him to use his feet if the ball was flighted. The 27-year-old has been outstanding in first-class cricket. In 54 matches, he has 3,509 runs at an average of 51.60. Arguably, the finest batsman against spin in the domestic circuit - the flick is his favourite stroke - Indrajith handles pace with confidence with his horizontal bat strokes. READ| Kerala cricket on the right track: Vishnu Vinod Growing up, Sachin Tendulkar was a batsman he admired. “I also like Mahela Jayawardene, a touch player,” he revealed. Queried about his crucial century partnership with the belligerent Shahrukh Khan against Delhi, Indrajith said, “Shahrukh, by his standards, took some time initially. We were not thinking about the lead. We spoke about taking it session by session.” READ| IND vs WI, 3rd T20I: Suryakumar, Venkatesh lead India to 3-0 series sweep over Windies Indrajith continued. “Then things started to happen. Shahrukh went ballistic. And we crossed 400 runs in a day to take the lead. It was sensational stuff.” Indrajith is looking forward to his stint with Kolkata Knight Riders in the IPL. “I am finally in an IPL team after some disappointments in the past. I am developing my power game. I have kept wickets in the TNPL.\" The sharp Indrajith is a fine catcher at slip. “You need reflexes, hand-eye coordination, anticipation and the ability to concentrate for long periods. Standing at slip can be very tiring mentally,” he said. The classy Indrajith has his foot on the accelerator on the cricketing highway.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"After the West Indies T20I series Venkatesh Iyer is ahead of Hardik Pandya, says Wasim Jaffer - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMivQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC93ZXN0LWluZGllcy1pbi1pbmRpYS9hZnRlci10aGUtd2VzdC1pbmRpZXMtdDIwaS1zZXJpZXMtdmVua2F0ZXNoLWl5ZXItaXMtYWhlYWQtb2YtaGFyZGlrLXBhbmR5YS1zYXlzLXdhc2ltLWphZmZlci9hcnRpY2xlc2hvdy84OTcyNjU1NC5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"After the West Indies T20I series Venkatesh Iyer is ahead of Hardik Pandya, says Wasim Jaffer  Times of India'He has bested this position': WI legend has his say on 'versatile' Venkatesh filling Hardik's shoes for T20 WC squad  Hindustan TimesIndia vs West Indies: Rahul Dravid pleased with Venkatesh Iyer's progress as finisher  India TodayIND vs WI: At The Moment Venkatesh Iyer Has Bested His Position In India's All-Rounder Role, Says Ian Bishop  Cricket Addictor'To adapt well at No.6, finish games is outstanding': Jaffer places promising 27-year-old ahead of Hardik in T20 WC team  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-21 11:59:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Kerala cricket on the right track: Vishnu Vinod","link":"https://sportstar.thehindu.com/cricket/kerala-cricket-future-on-right-track-vishnu-vinod-ranji-trophy-2022/article38433685.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Kerala vice-captain Vishnu Vinod is looking forward to the Ranji Trophy game against Gujarat this week after Kerala's first round win against Meghalaya.","content":null,"pubDate":"2022-02-21 11:58:43","full_description":"Kerala cricket was in for a disappointment at the recent mega auction for the IPL. Only three home-grown Kerala players were bought by the franchises. It was six last year. At the auction, Vishnu Vinod became the most expensive Kerala player in the IPL 2022 auction at Rs. 50 lakh, against a base price of Rs. 20 lakh. The wicketkeeper-batter is set to join Sunrisers Hyderabad, after stints with Royal Challengers Bangalore and Delhi Capitals. He is not thinking about the IPL at the moment, though. He is focussed on the on-going Ranji Trophy tournament. READ: Ranji Trophy: Youth adds shine to Kerala’s win, and promises more After Kerala won its first match against Meghalaya with a day to spare, the 28-year-old is looking forward to the game against Gujarat, starting at the Saurashtra Cricket Association Stadium on Thursday. “Gujarat is a strong team, but we had beaten them at Krishnagiri (Wayanad) two years ago in the quarterfinal so we are confident,” Vishnu told Sportstar. “And it is nice to notice that everyone contributed to the win against Meghalaya.” He is glad that the Ranji Trophy is back. “It was frustrating that there was no Ranji last season because of Covid,” he said. “I am 28 and for players like me it was a big blow. I have always enjoyed playing red-ball cricket.” Though he has had more success in the white-ball format, one of his finest knocks came in the Ranji Trophy, against Madhya Pradesh in 2018 at Thiruvananthapuram. His unbeaten 193 and his 199-run run partnership with captain Sachin Baby had brought Kerala back into the game from a hopeless position. ALSO READ: Ranji Trophy: Kerala crushes Meghalaya; Thampi snares four With that innings Vishnu showed that his batting wasn’t all about big hits and that he could adapt to the more demanding longer format. He played a similar knock just a couple of months ago, in this very city. His unbeaten 100 off 82 balls gave Kerala an unlikely four-wicket win against Maharashtra in the Vijay Hazare Trophy one-day tournament. He had added 174 for the unbroken seventh wicket with Sijomon Joseph. As someone who touched the hard cricket ball only at the age of 13, he has indeed come a long way. ALSO READ: Edhen Apple Tom: Kerala’s new pace-bowling sensation “Back in my village, Perunad in Pathanamthitta district, it was with the tennis ball that I played for many years,” he said. “It was after I was selected in the Kerala Under-19 team in 2012 that I felt I could have a career in cricket.” Vishnu believes Kerala cricket is on the right track. “Look at the way three newcomers – Edhen Apple Tom, Vathsal Govind and Rohan Kunnummal – performed here,” he said. “It is great watching our youngsters doing well in the Ranji Trophy.”","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ-W vs IN-W 4th ODI Dream11 Prediction: Fantasy Cricket Tips for India Women vs New Zealand- W in Queenstown","link":"https://www.indiatvnews.com/sports/cricket/nz-w-vs-ind-w-dream11-prediction-fantasy-cricket-tips-playing-11-india-women-vs-new-zealand-women-match-in-queenstown-2022-02-21-760796","keywords":null,"creator":null,"video_url":null,"description":"NZ-W vs IN-W 4th ODI Dream11 Prediction: Fantasy Cricket Tips for India Women vs New Zealand Women in Queenstown India Women vs New Zealand Women 4th ODI Live Streaming: When and Where to Watch IND-W vs NZ-W match India will take on New Zealand in the 4th ODI Match of the ongoing India Women tour of New Zealand, 2022. The game will take place at John Davies Oval, Queenstown.","content":null,"pubDate":"2022-02-21 11:46:08","full_description":"India vs New Zealand , 4th ODI Match John Davies Oval, Queenstown 3:30 AM IST Sabbhineni Meghana, Yastika Bhatia, (c), Richa Ghosh (w), , , Maddy Green, Amelia Kerr, Amy Satterthwaite, Hayley Jensen, Rosemary Mair. Sabbhineni Meghana, Shafali Verma, Yastika Bhatia, Mithali Raj (c), , Richa Ghosh (w), Deepti Sharma, , Simran Bahadur, Poonam Yadav, Rajeshwari Gayakwad. Suzie Bates, Maddy Green, Amelia Kerr, Amy Satterthwaite (c), Sophie Devine, Katey Martin (w), Brooke Halliday, Hayley Jensen, Jess Kerr, Rosemary Mair, Fran Jonas. Sabbhineni Meghana, Shafali Verma, Yastika Bhatia, Mithali Raj(c), Harmanpreet Kaur, Richa Ghosh(w), Deepti Sharma, Pooja Vastrakar, Jhulan Goswami, Poonam Yadav, Rajeshwari Gayakwad, Sneh Rana, Meghna Singh, , Renuka Singh, . Suzie Bates, Maddy Green, Amelia Kerr, Amy Satterthwaite, Sophie Devine(c), Lea Tahuhu, Katey Martin(w), Brooke Halliday, Hayley Jensen, Jess Kerr, Hannah Rowe, Lauren Down, Rosemary Mair, Fran Jonas, Frances Mackay. The 4th ODI match between India women and New Zealand women will take place on 18 February 2022. India women vs New Zealand women's 4th ODI match will be played at John Davies Oval in Queenstown. The match will start at 3:30 am IST. The toss between India women vs New Zealand women will take place at 3:00 AM IST. There will be no LIVE telecast of the match on TV. The match will be LIVE streamed on Amazon Prime Video.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"LAH vs PES Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s PSL 2022 Match No.30 at Gaddafi Stadium, Lahore, 8:00 PM IST February 21","link":"https://zeenews.india.com/cricket/lah-vs-pes-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-psl-2022-match-no-30-at-gaddafi-stadium-lahore-800-pm-ist-february-21-2438514.html","keywords":null,"creator":null,"video_url":null,"description":"Lahore Qalandars vs Peshawar Zalmi Dream11 Team Prediction Lahore Qalandars vs Peshawar Zalmi Match No. 30 - Check My Dream11 Team, Best players list of LAH vs PES, Lahore Qalandars Dream11 Team Player List, Peshawar Zalmi Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Pakistan Super League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-21 11:44:00","full_description":"Lahore Qalandars will take on Peshawar Zalmi in the final league match of the Pakistan Super League (PSL) 2022 on Monday (February 21). With both sides already qualified for the playoffs, it'll be an affair of who'll finish on the second spot in the standings. Lahore have good quality cricketers and have came out on top six times in this PSL edition. Fakhar Zaman is in the form of his life as he has crossed the 500 run mark in this season itself. Lahore are second in the table and will look to finish league games with a win in this fixture. On the other hand, Peshawar Zalmi are heading into fixture with a three match win streak behind their back. With 5 wins in 9 games they are 3rd in the points table with 10 points under their belt. Zalmi have been impressive throughout the second-half of the tournament and will look to carry their winning momentum coming into this matchup. Venue: Gaddafi Stadium, Lahore Date & Time: February 21st at 8:00 PM IST Live Streaming: Sony Sports Network and SonyLiv app and website Wicket-keeper : Mohammad Haris (vc) Batters: Shoaib Malik, Fakhar Zaman (c), Hazratullah Zazai, Harry Brook, All-rounders: Mohammad Hafeez, David Wiese, Liam Livingstone Bowlers: Shaheen Afridi, Salman Irshad, Zaman Khan Captain: Fakhar Zaman Vice-Captain: Mohammad Haris Lahore Qalandars: Fakhar Zaman, Phil Salt (wk), Kamran Ghulam, Mohammad Hafeez, Harry Brook, Sohail Akhtar, David Wiese, Samit Patel, Shaheen Afridi (c), Haris Rauf, Zaman Khan Peshawar Zalmi: Hazratullah Zazai, Mohammad Haris (wk), Yasir Khan, Shoaib Malik, Sherfane Rutherford, Liam Livingstone, Hussain Talat, Ben Cutting, Wahab Riaz (c), Usman Qadir, Salman Irshad","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}