{"newsArray":[{"title":"Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been'","link":"https://www.dailymail.co.uk/sport/cricket/article-12343403/Piers-Morgan-brands-Aussie-cricketers-cheating-convicts-says-England-robbed-victory-greatest-series-theres-been.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Piers Morgan has bemoaned the good fortune of the Australians this summer, insisting that cricket fans have been robbed of one of the sport's greatest series.","content":"Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been' Piers Morgan has blasted the Australian cricket team Morgan, 58, has been angered by the tourists' antics Australia retained the Ashes in underwhelming fashion By Ollie Lewis For Daily Mail Australia Updated: 04:13 EDT, 27 July 2023 e-mail 5 View comments Piers Morgan has taken aim at the Australian cricket team once again, with the British TV host branding Pat Cummins' side 'cheating convicts' amid their feisty Ashes series against England. Morgan, 58, was left infuriated by the antics of Alex Carey at Lord's, in which the Australian controversially stumped rival wicketkeeper Jonny Bairstow when the Englishman thought a Cameron Green delivery was dead. The Talk TV anchor has kept up his tirade against the tourists ever since, and vented his fury on Sunday when Australia escaped a chastening defeat at Old Trafford due to the weather, meaning that they have retained the Ashes. And speaking on the Telegraph's Vaughany and Tuffers Cricket Club Podcast, Morgan bemoaned the good fortune of the Australians this summer, insisting that cricket fans have been robbed of one of the sport's greatest series. 'This was building to one of the all-time great series — forget Ashes — of any cricket series, internationally, in history,' he said. Piers Morgan has labelled Australia 'cheating convicts' in another attack on the cricket team Australia retained the Ashes in fortunate circumstances after drawing at Old Trafford 'To be 2-0 down and then roar back to 2-2 and then go to the Oval, which is exactly what would have happened had we been able to play more than two hours at the weekend ... it would have been, really, the greatest comeback in cricket history internationally and the greatest series there's ever been. 'We should have won at Lord's, we should have won every Test, let's be honest. We're a better team, I don't think there's any doubt about that. We were dudded by the rain, and I think at the Oval we're going to flatten them. We need to. 'I don't want to lose 3-1 – to lose 3-1 to this Australian team of cheating convicts would be extremely annoying.' While the likes of Ricky Ponting have claimed Ben Stokes' captaincy should be under more scrutiny than Pat Cummins' leadership , Morgan lavished praise on the England skipper, but conceded that some modifications to Bazball may be needed. 'When we were at Lord's, when we gave away all those wickets, when we were 180-odd for 2 and then just fell apart, some of the shots we were playing – Harry Brook's innings that day was terrible,' he added. 'Yet you can see as the series has gone on he's got more sensible, more judicious in his shot selection, and you could see the world-class player in the making. Morgan praised Ben Stokes' captaincy despite England being at risk of a first home series defeat to Australia in 22 years 'I think they [England] lost their heads a bit at Lord's, but I totally understood why Ben Stokes is keen to say, 'Look, you've got to let us do our thing' because he's trying to instil in them that constant attacking mentality. 'I absolutely love everything about Ben Stokes. I think he's got that warrior spirit. When he gets going, the thing about Stokes is he doesn't go berserk for the sake of it; he doesn't play crazy shots. 'He's playing measured, brutal shots, but he can take a game away from people like no one I've seen. We take him for granted. He is unbelievable. I love the fact that nothing deters him; he doesn't make apologies.' Share or comment on this article: Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been' e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-27 07:41:01","image_url":"https://i.dailymail.co.uk/1s/2023/07/27/08/73670763-0-image-m-5_1690443605988.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"India vs West Indies 1st ODI 2023 Free Live Streaming Online on JioCinema and FanCode: Get Free Live TV Telecast of IND vs WI Cricket Match on DD Sports","link":"https://www.latestly.com/sports/cricket/india-vs-west-indies-1st-odi-2023-free-live-streaming-online-on-jiocinema-and-fancode-get-free-live-tv-telecast-of-ind-vs-wi-cricket-match-on-dd-sports-5296487.html","keywords":null,"creator":null,"video_url":null,"description":"The first game is at Bridgetown with the Men in Blue confident of a good showing. India won the test series 1-0 with the second game being washed out. The whole series so far has low on fan buzz but the fifty over format just might change things.","content":"With the Asia Cup and World Cup around the corner, the Indian cricket team will be looking to gain some early momentum when it takes on the West Indies in a three game ODI series. The first game is at Bridgetown with the Men in Blue confident of a good showing. India won the test series 1-0 with the second game being washed out. The whole series so far has low on fan buzz but the fifty-over format just might change things. Hots West Indies are not travelling to India for the World Cup after a poor performance in the qualifiers. The team is going through a rough patch off late and needs a big win to lift their morale. India vs West Indies 1st ODI 2023, Bridgetown, Barbados Weather Report: Check Out the Rain Forecast and Pitch Report at Kensington Oval . Rohit Sharma and Shubman Gill open the innings for India with Virat Kohli coming in at no 3. The trio will be doing the bulk of the scoring for the visitors. Sanju Samson could be used as a specialist wicket-keeper with Ishan Kishan as a middle order batsman. Hardik Pandya has an important role to play as a specialist all-rounder alongside Ravindra Jadeja. West Indies skipper Shai Hope is also their most skillful batsman who has excelled in the fifty over format. Alick Athinaze showcased his skills in the test series and he has an important role to play in the ODIs as well. Alzarri Joseph and Oshane Thomas will be leading the bowling attack for the hosts and a lot is riding on their shoulders. India vs West Indies 1st ODI 2023 Free Live Telecast (TV Channels in India) DD Sports has the telecast rights of India vs West Indies 2023. So, fans looking to watch IND vs WI ODI match on TV will have to tune into DD Sports to catch the action in Hindi and English commentary. The IND vs WI 1st ODI 2023 free live telecast will not only be available on DD Sports for DD FreeDish users but on DTH and DTT platforms as well. DD Bangla, DD Yadagiri, DD Saptagiri, DD Chandana, DD Podhigai, and DD National (Bhojpuri) will also provide the IND vs WI 1st ODI 2023 live telecast. IND vs WI Dream11 Team Prediction, 1st ODI 2023: Tips To Pick Best Fantasy Playing XI for India vs West Indies Cricket Match in Bridgetown. India vs West Indies 1st ODI 2023 Free Live Streaming Online Fans will have two options to watch the IND vs WI live streaming online of 1st ODI 2023. While JioCinema will provide the free live streaming online of IND vs WI, FanCode will provide live streaming, but fans will have to pay the subscription fee. On JioCinema mobile app and website, fans will get to watch the IND vs WI live streaming online for free. India has some of the best ODI players in their ranks and they should face little difficulty in securing a win in this game. (The above story first appeared on LatestLY on Jul 27, 2023 01:10 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:40:13","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st ODI Playing 11: आज भारत विरुद्ध वेस्ट इंडिज यांच्यातील पहिला एकदिवसीय सामना, अशी असु शकते दोन्ही संघांची संभाव्य प्लेइंग इलेव्हन","link":"https://marathi.latestly.com/sports/cricket/the-first-odi-match-between-india-vs-west-indies-today-this-could-be-the-possible-playing-eleven-of-both-the-teams-479640.html","keywords":null,"creator":null,"video_url":null,"description":"आम्ही तुम्हाला सांगतो की भारत विरुद्ध वेस्ट इंडिज (IND vs WI) यांच्यातील एकदिवसीय मालिकेतील पहिला सामना गुरुवारी म्हणजेच 27 जुलै रोजी खेळवला जाईल. केन्सिंग्टन ओव्हल, ब्रिजटाऊन, बार्बाडोस येथे भारतीय वेळेनुसार संध्याकाळी साडेसात वाजता दोन्ही संघ खेळणार आहेत.","content":"वेस्ट इंडिजविरुद्धच्या कसोटी मालिकेत (IND vs WI) 1-0 असा विजय नोंदवल्यानंतर भारतीय क्रिकेट संघाची नजर आता एकदिवसीय मालिकेवर आहे. आम्ही तुम्हाला सांगतो की भारत विरुद्ध वेस्ट इंडिज (IND vs WI) यांच्यातील एकदिवसीय मालिकेतील पहिला सामना गुरुवारी म्हणजेच 27 जुलै रोजी खेळवला जाईल. केन्सिंग्टन ओव्हल, ब्रिजटाऊन, बार्बाडोस येथे भारतीय वेळेनुसार संध्याकाळी साडेसात वाजता दोन्ही संघ खेळणार आहेत. चला तर मग जाणून घेऊया या सामन्यात दोन्ही संघांचे प्लेइंग 11 कसे असतील. (हे देखील वाचा: IND vs WI 1st ODI Pitch Report: केन्सिंग्टन ओव्हलच्या खेळपट्टीवर कोणाचा असेल बोलबाला, गोलंदाज की फलंदाज? जाणून घ्या खेळपट्टीचा अहवाल ) विशेष म्हणजे, अलीकडेच भारतीय संघाने वेस्ट इंडिजविरुद्ध दोन सामन्यांची कसोटी मालिका खेळली होती, ज्यामध्ये भारताने ही मालिका 1-0 अशी जिंकली होती. त्याचवेळी या मालिकेतील दुसरा सामना संततधार पावसामुळे अनिर्णित राहिला, तर पहिल्या सामन्यात भारताने दमदार कामगिरी करत विजय मिळवला. आता कसोटी मालिकेनंतर एकदिवसीय मालिका जिंकण्यावर टीम इंडियाचे डोळे लागले आहेत. भारतीय निवड समितीने वेस्ट इंडिजविरुद्धच्या संघात दोन यष्टीरक्षक फलंदाजांची निवड केली आहे. ज्यामध्ये इशान किशन आणि संजू सॅमसन यांचा समावेश आहे. अशा परिस्थितीत पहिल्या वनडेत भारतीय कर्णधार रोहित शर्मा प्लेइंग 11 मध्ये कोणाला संधी देणार हे पाहणे उत्सुकतेचे ठरणार आहे. आपणास सांगूया की वेस्ट इंडिजविरुद्धच्या दुसऱ्या कसोटीत इशानने नुकतेच शानदार फलंदाजी करताना अर्धशतक झळकावले होते, तर संजू बराच काळ संघाबाहेर आहे. पण राजस्थान रॉयल्सचा कर्णधार नेट्समध्ये सातत्यपूर्ण फलंदाजीचा सराव करत आहे. दोन्ही संघांची संभाव्य प्लेइंग इलेव्हन भारत: रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, संजू सॅमसन (यष्टीरक्षक), हार्दिक पांड्या, सूर्य कुमार यादव, शार्दुल ठाकूर, रवींद्र जडेजा, कुलदीप यादव, जयदेव उनाडकट, उमरान मलिक वेस्ट इंडिज: ब्रॅंडन किंग, काइल मेयर्स, अॅलिक अथानाझे, शाई होप (कर्णधार आणि विकेटकीपर), शिमरॉन हेटमायर, रोव्हमन पॉवेल, रोमॅरियो शेफर्ड, अल्झारी जोसेफ, केविन सिंक्लेअर, गुडाकेश मोटी, ओशाने थॉमस","pubDate":"2023-07-27 07:34:32","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"Global T20 Canada 2023: Brampton Wolves Derail Montreal Tigers; Toronto Nationals Beat Mississauga Panthers","link":"https://www.latestly.com/sports/cricket/global-t20-canada-2023-brampton-wolves-derail-montreal-tigers-toronto-nationals-beat-mississauga-panthers-5296437.html","keywords":null,"creator":null,"video_url":null,"description":"Colin Munro put in a match-winning performance with a blistering knock of 67 in just 31 deliveries as Toronto Nationals downed the Mississauga Panthers with six wickets and 6.4 overs to spare in Global T20 Canada at the TD Arena here.","content":"Brampton, July 27 : Colin Munro put in a match-winning performance with a blistering knock of 67 in just 31 deliveries as Toronto Nationals downed the Mississauga Panthers with six wickets and 6.4 overs to spare in Global T20 Canada at the TD Arena here. ‘Smashing It in Australia’ Video of Tottenham Hotspur Striker Harry Kane Showcasing His Cricket Skills Goes Viral . In the second clash on Wednesday, Colin De Grandhomme put on a stellar all-round display with 56 runs and two important wickets as the Brampton Wolves defeated the Montreal Tigers by 15 runs. The Brampton Wolves' first innings score of 143 proved enough to win them the match. The Toronto Nationals won an important toss and asked the Mississauga Panthers to bat first. The Nationals ran through the Panthers’ top order with brilliant spells from Faheem Ashraf and Saad Bin Zafar who bagged two wickets apiece early on. Chris Gayle (4), Navneet Dhaliwal (5) and Azam Khan (8) all perished in the Power-play, leaving the Panthers in trouble at 28/3 in six overs. Cameron Delport (4) also departed soon, before Shoaib Malik (37) and James Neesham (18) came together to steady the ship and weave an essential partnership of 44 runs for the Panthers, despite the conservative .Tom Cooper (26) came in at number 7 and was in sensational form in the death overs. He played a quick-fire knock in just 14 deliveries, while wickets around him tumbled, to help the Panthers finish at 115/9. Zaman Khan also showcased his proficiency in the death overs, picking up two wickets in the dying embers of the innings. In response, the Toronto Nationals blazed their way to their target. Colin Munro (67) unleashed an exhibition of power hitting reaching his half-century in just 20 balls before he was dismissed by Parveen Kumar. At the other end, Nicholas Kirton departed for 12 runs. Towards the end of the powerplay, the Nationals at 70/1 were well entrenched in the driver’s seat. Following the dismissal of Munro, Gerhard Erasmus (1) and Armaan Kapoor (5) fell in quick succession at the hands of Nikhil Dutta. Kargil Vijay Diwas 2023: Rishabh Pant Pays Tributes to Brave Warriors of India However, captain Hamza Tariq (25), who came in at number three played a composed unbeaten innings to ensure the Nationals reached their target comfortably, with six wickets and 6.4 overs to spare. The day’s second encounter saw Brampton Wolves bat first after losing the toss. The Wolves lost Aaron Johnson (6) as early as the second over. However, Usman Khan (33) cracked six boundaries while Mark Chapman (21) rotated the strike well to ensure the Wolves were well-placed at 53/1 at the end of the powerplay. Soon after, Aayaz Afzal Khan scalped Usman Khan and Hussain Talat in quick succession, before Colin De Grandhomme (56) came in at number five, to play a brilliant innings that was equal parts power and precision, before he was dismissed by Carlos Brathwaite. The Wolves looked poised for a big score initially, but the wickets continued to fall. Ayaan Afzal Khan picked up two more wickets in consecutive deliveries in the sixteenth over, while Carlos Brathwaite mopped up the tail with three wickets in the last over. The Brampton Wolves were all out for 143 in 19.5 overs. In response the Tigers lost both openers, Chris Lynn (9) and Muhammad Waseem (6) early in the innings. Shakib Al Hassan (28) and Dilpreet Singh (24) came together to forge a partnership and the Tigers were placed at 42/2 at the end of powerplay. Shakib Al Hassan once again failed to convert his start and Dilpreet Singh departed soon after. As the pressure mounted in the middle overs, Sherfane Rutherford (10) lost his wicket trying to clear the ropes. Ben Stokes to Become A Spinner? Here’s What England Test Captain Has to Say! With the Montreal Tigers chasing 44 runs in 36 balls with five wickets in hand, the game was delicately poised. However, Carlos Brathwaite (4) and Wijeyeratne (8) were both dismissed by Colin De Grandhomme, while Logan Van Beek picked up three wickets including Dipendra Singh Airee (28) to bundle out the Tigers for 128. The Brampton Wolves proved too much for the Tigers and they won by 15 runs. Brief scores: Mississauga Panthers 115/9 in 20 overs (Shoaib Malik 37, Tom Cooper 26, James Neesham 18; Saad Bin Zafar 3-31, Zaman Khan 2-20, Faheem Ashraf 2-30) lost to Toronto Nationals 118/4 in 13.2 overs (Colin Munro 67, Hamza Tariq 25; Nikhil Dutta 2/36) by 6 wickets. Brampton Wolves 143 all out in 19.5 overs (Colin De Grandhomme 56, Usman Khan 33, Mark Chapman 21; Carlos Brathwaite 4-21, Ayaan Afzal Khan 4-21) beat Montreal Tigers 128 in 19.1 overs (Shakib Al Hassan 28, Dipendra Singh Airee 28; Logan Van Beek 3-20, Colin De Grandhomme 2-8, Shahid Ahmadzai 2-33) by 15 runs. (The above story first appeared on LatestLY on Jul 27, 2023 01:05 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:29:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Former India cricketer Nidhi Buley and her sister Ritika enter BCCI Umpires panel","link":"https://www.indiatvnews.com/sports/cricket/former-india-cricketer-nidhi-buley-and-her-sister-ritika-enter-bcci-umpires-panel-2023-07-27-883294","keywords":null,"creator":null,"video_url":null,"description":"Former India cricketer Nidhi Buley has made it to the umpiring panel of the Board of Control for Cricket in India (BCCI). Her sister Ritika has also joined her in the list as a total of four females passed the umpiring exam conducted by the BCCI with a distinction. Nidhi Buley has played for India at the international level back in 2006 featuring in an ODI and a Test each.","content":"Former India cricketer Nidhi Buley has made it to the umpiring panel of the Board of Control for Cricket in India (BCCI). Her sister Ritika has also joined her in the list as a total of four females passed the umpiring exam conducted by the BCCI with a distinction. Nidhi Buley has played for India at the international level back in 2006 featuring in an ODI and a Test each. On the other hand, her sister Ritika couldn't make it to the higher level but she featured for Madhya Pradesh in domestic cricket in 31 first-class matches. The BCCI conducted an exam for the retired cricketers in the second week of June and the results of the same were declared on Wednesday (July 26). Candidates needed more than 120 marks out of 150 and both Nidhi and Ritika passed the exam with flying colours scoring 133.5 and 133 marks respectively. Apart from them, V Kritika from Tamil Nadu and Ankita Guha of Vidarbha were the other females who passed the exam and were elevated to the BCCI panel. Nikhil Patil of Mumbai Cricket Association topped the exam with a massive score of 147 out of 150. Coming back to Nidhi, she played for India in 2006 and bowled seven overs to pick one wicket in an ODI against Ireland. She also featured in the Test match against England and bowled 12 wicketless overs conceding 43 runs. But she never represented India again. Her sister Ritika never got picked for India but she always wanted to enter the big club of match officials. Nidhi regretted not getting to play at Lord's in her career but she now wants to officiate in a game at the Mecca of Cricket. \"As a player, I could not play at Lord's. We had a game there on the England tour in 2006 but I was not in the playing eleven. If I can umpire at Lord's that will be a dream come true for me,\" Nidhi said. Nidhi Buley has also witnessed the transformation of women's cricket in the last few years and lauded the BCCI for playing a huge supporting role. \"The BCCI has supported us a lot. It is after a long time retired cricketers are entering the umpiring space. The board wants to promote female umpires and bring them at par with men. It wants to treat them equally. In my playing days, even getting to practice with the male players was a big deal. I hope I get to officiate in men's matches which will be a big challenge,\" she further said. Ritika, 31, didn't get to play for India like her sister but she wants to officiate in men and women's cricket both as her interest was always in umpiring. \"As a player, I could not represent India, umpiring is the only way I can realise my dream. I used to stand behind the stumps and wonder how the umpires go about their job and count six balls. I understood that when I became an umpire myself. As players we don't know much about the laws of the game. It is only when you study you realise you did not know so much about the game,\" Ritika said while speaking to PTI.","pubDate":"2023-07-27 07:23:22","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"UEFA Champions League Qualifier 2023-24: Rakow Czestochowa Beat Qarabag FK","link":"https://www.latestly.com/sports/football/rakow-czestochowa-beat-qarabag-fk-in-uefa-champions-league-qualifier-5296172.html","keywords":null,"creator":null,"video_url":null,"description":"A stunning goal by Sonny Kittel in injury time earned Polish champions Rakow Czestochowa a 3-2 victory over Qarabag FK of Azerbaijan in the first leg of the UEFA Champions League second qualifying round.","content":"Warsaw (Poland) July 27 : A stunning goal by Sonny Kittel in injury time earned Polish champions Rakow Czestochowa a 3-2 victory over Qarabag FK of Azerbaijan in the first leg of the UEFA Champions League second qualifying round. Qarabag dominated the first half on Wednesday night, but they could not convert good chances into goals. In the 32nd minute, Patrick Andrade was in a perfect position to break the deadlock, but he hit the post, reports Xinhua. FIFA Women's World Cup 2023 Roundup: Spain, Japan Seal Last 16 Berths; Canada Beat Ireland . In other matches on Wednesday night, Kl Klaksvíkar of the Faroe Islands were held goalless by Hacken Gothenburg of Sweden; Ludogorets drew 1-1 with Olimpija Ljubljana; Aris Limassol of Cyprus thrashed BATE Borisov of Belarus 6-2 while Sheriff Tiraspol of Moldova defeated Maccabi Haifa of Israel 1-0. It was Rakow who found an opener ten minutes after the break. Marcin Cebula dribbled past a defender in the penalty area and tried to find Lukasz Zwolinski with a low pass. Elvin Jafarguliyev, who attempted to block the Rakow striker, put the ball into his own net from close range. Substitute Fabian Piasecki doubled Rakow's lead in the 71st minute through a header. However, the visitors reacted in the best possible way. The Azerbaijan champions needed just three minutes to level the score. Firstly, Redon Xhixha reduced the deficit with a stunning header into the far corner, while a moment later he tapped in after an assist by Hamidou Keyta. ‘Smashing It in Australia’ Video of Tottenham Hotspur Striker Harry Kane Showcasing His Cricket Skills Goes Viral . Qarabag tried to attack until the final whistle, but it was Rakow who had the last word. German midfielder Kittel made a dream debut as his powerful shot from distance gave the Polish champions the victory. The second leg will be played on August 2. (The above story first appeared on LatestLY on Jul 27, 2023 12:07 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:01:20","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st ODI Pitch Report: केन्सिंग्टन ओव्हलच्या खेळपट्टीवर कोणाचा असेल बोलबाला, गोलंदाज की फलंदाज? जाणून घ्या खेळपट्टीचा अहवाल","link":"https://marathi.latestly.com/sports/cricket/who-will-dominate-the-pitch-at-kensington-oval-the-bowlers-or-the-batsmen-know-the-pitch-report-479622.html","keywords":null,"creator":null,"video_url":null,"description":"पहिला वनडे सामना 27 जुलै रोजी केन्सिंग्टन ओव्हल येथे खेळवला जाईल. कसोटी मालिका 1-0 ने जिंकल्यानंतर आता ही मालिका भारतासाठी आशिया चषक आणि एकदिवसीय विश्वचषक स्पर्धेच्या दृष्टीने महत्त्वाची ठरणार आहे.","content":"भारत आणि वेस्ट इंडिज (IND vs WI) यांच्यात खेळल्या गेलेल्या दोन कसोटी सामन्यांच्या मालिकेनंतर आता दोन्ही संघ तीन सामन्यांच्या वनडे मालिकेत आमनेसामने येतील. पहिला वनडे सामना 27 जुलै रोजी केन्सिंग्टन ओव्हल येथे खेळवला जाईल. कसोटी मालिका 1-0 ने जिंकल्यानंतर आता ही मालिका भारतासाठी आशिया चषक आणि एकदिवसीय विश्वचषक स्पर्धेच्या दृष्टीने महत्त्वाची ठरणार आहे. त्याचवेळी पाहुण्या संघाला यावेळी विश्वचषकासाठी पात्र ठरविण्यात अपयश आले. केन्सिंग्टन ओव्हल स्टेडियमच्या खेळपट्टीचा अहवाल काय म्हणतो ते पाहूया... (हे देखील वाचा: IND vs WI 1st ODI 2023: वेस्ट इंडिजविरुद्ध पहिल्या सामन्यात कोण करणार विकेटकीपिंग? इशान किशन - संजू सॅमसन कोणाला मिळणार संधी; घ्या जाणून ) केन्सिंग्टन ओव्हल खेळपट्टी अहवाल तसे, केन्सिंग्टन ओव्हल ही गोलंदाजी अनुकूल पृष्ठभाग आहे. ही विकेट थोडी संथ आहे आणि वेगवान गोलंदाजांपेक्षा फिरकीपटूंना अधिक अनुकूल आहे. पहिल्या डावातील सरासरी स्कोअर 229 आहे. तथापि, येथे खेळल्या गेलेल्या शेवटच्या एकदिवसीय सामन्यात न्यूझीलंडने 302 धावांचे लक्ष्य 17 चेंडू शिल्लक असताना आणि 5 गडी राखून पूर्ण केले. टीम इंडियाने या मैदानावर एकूण तीन सामने खेळले आहेत, ज्यामध्ये त्यांचा पराभवाचा रेकॉर्ड 1-2 असा आहे. तथापि, दोन दशकांपूर्वी 2002 मध्ये तो येथे शेवटचा वनडे खेळला होता. कसे असेल हवामान येथे एकूण 49 सामने खेळले गेले आहेत, ज्यामध्ये प्रथम फलंदाजी करणाऱ्या संघाने 22 सामने जिंकले आहेत, तर पाठलाग करणाऱ्या संघाने 25 सामने जिंकले आहेत. मात्र, येथे खेळल्या गेलेल्या शेवटच्या 10 सामन्यांपैकी 7 सामने संघाने लक्ष्याचा पाठलाग करताना जिंकले आहेत. AccuWeather ने दिलेल्या हवामान अंदाजानुसार, ब्रिजटाउनमध्ये गुरुवारी कमाल तापमान 32°C आणि किमान 26°C पर्यंत पोहोचण्याची अपेक्षा आहे. अधूनमधून ढगांसह संपूर्ण सामन्यात पावसाची 7% शक्यता आहे.","pubDate":"2023-07-27 06:53:02","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"'I've no idea': Rohit Sharma not sure if Jasprit Bumrah will travel to Ireland for T20I series","link":"https://www.indiatvnews.com/sports/cricket/i-ve-no-idea-rohit-sharma-not-sure-if-jasprit-bumrah-will-travel-to-ireland-for-t20i-series-2023-07-27-883287","keywords":null,"creator":null,"video_url":null,"description":"Even as the World Cup is just over two months away from getting underway, all eyes are on India's injured players, especially Jasprit Bumrah. BCCI recently provided an update on his injury stating that the pacer has returned to bowling and will be playing a few practice matches at the National Cricket Academy. Moreover, reports recently emerged that Bumrah will be travelling to Ireland for three T20Is next month. However, when Rohit Sharma was asked about the same, he cleared that he has no idea.","content":"Even as the World Cup is just over two months away from getting underway, all eyes are on India's injured players, especially . BCCI recently provided an update on his injury stating that the pacer has returned to bowling and will be playing a few practice matches at the National Cricket Academy. Moreover, reports recently emerged that Bumrah will be travelling to Ireland for three T20Is next month. However, when was asked about the same, he cleared that he has no idea. He also highlighted the importance of match fitness while returning from a long injury layoff for a player. Moreover, the India captain is also hopeful that Bumrah returns fully fit and fine for the World Cup later this year. \"The amount of experience he (Bumrah) brings is very important. Right now he's coming from a serious injury and I've no idea if he'll travel to Ireland because the team hasn't been announced yet. If he gets to play then it's good and we hope he plays before the World Cup. When a player returns from a serious injury, match fitness, match feeling are some key components, which are missing,\" Rohit said ahead of the first ODI against West Indies. Rohit Sharma also confirmed that the team management is keeping an eye on Bumrah's recovery and if everything is going according to the plan. The management is also in touch with the NCA making sure that their premier bowler remains injury free for a longer period now. \"We'll see what has been planned and everything depends on his recovery. We are in constant touch with the NCA and things look positive at the moment,\" the India captain further added. Team India is struggling with injury to key players with World Cup approaching fast. Apart from Bumrah, even the likes of , Shreyas Iyer are injured at the moment. Speaking about the same, Rohit expressed that not much can be done about it and they have to keep backups ready while identifying the players who will play the mega event. \"You need experience when you go into big tournaments. Quite a few players are injured from our team but we try to identify players who are going to play in the World Cup and give them as many matches as possible so that they get the experience. But when there are injuries, you just don't know what you can do about it. Along with focusing on the XI, we need to focus on other 15-20 players too because anyone can get injured,\" Rohit said.","pubDate":"2023-07-27 06:42:42","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"'You got to have thick skin': Australia's skipper Pat Cummins reacts to criticism over his captaincy","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/27/you-got-to-have-thick-skin-australiasskipper-pat-cummins-reacts-to-criticism-over-his-captaincy-2599142.html","keywords":null,"creator":null,"video_url":null,"description":"Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. LONDON: Australia's captain Pat Cummins remains unfazed by criticism over his captaincy following two tight victories at Edgbaston and Lord’s, a defeat at Leeds, and a draw in Manchester. The fifth and final Test will begin at The Oval from Thursday with the hosts in with a chance to level the series. Heading into the fifth and final Ashes Test with a 2-1 series lead and having retained the Ashes, the 30-year-old emphasised the need of having a thick skin to deal with everything. Australia narrowly avoided a loss in Manchester to retain the Ashes and Cummins' tactics were criticised as the tourists played catch-up cricket. It all started with their poor batting performance after losing the toss in ideal batting conditions. \"I honestly haven’t read anything. A few things have come across my desk from the boys having a laugh. I’ve been in this job two years now, and you learn pretty quickly that you’ve got to have a thick skin,\" Sydney Morning Herald quoted Cummins as saying. \"It’s such a great bunch of players and staff here that we all know what everyone is about and how we are going to go about it, and for me, that’s more important than anything else. I’m not going to please everyone and everyone’s got opinions, but they aren’t facts, they’re opinions,\" Cummins added. Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. In the fourth Test, the right-arm pacer similarly struggled with the ball, taking only one wicket and allowing 129 runs in 23 overs. \"I think it does have a shelf life. I won’t put a date on it, I’ve got to get there first. I feel like every Test match I learn quite a bit, you just get exposed to more things with each game. I’m loving working with this team and the staff. Enjoying it at the moment, we’ll see what the future holds. I feel like with each game I’m getting better and I think there’s a fair bit more left in me,\" Cummins said of captaincy. Even though Australia has already retained the urn, captain Cummins insisted that his team is still very eager to win the long-awaited Ashes series in England. \"I don’t think it’s shifted too much over the series, to be honest. I think Edgbaston again, was another moment where there wasn’t a lot in it (the pitch) for the bowlers. They scored almost 400 on day one and I don’t see it as too dissimilar to last week,\" Cummins said. \"I think you’ve got to hold your nerve a little bit sometimes, you’ve got to trust that’s your best percentage to get nicks even if they hit a few cover drives. You’ve got to keep your catchers in, you’ve got to take wickets. I think we’ve been pretty consistent this series,\" he added.","content":"LONDON: Australia's captain Pat Cummins remains unfazed by criticism over his captaincy following two tight victories at Edgbaston and Lord’s, a defeat at Leeds, and a draw in Manchester. The fifth and final Test will begin at The Oval from Thursday with the hosts in with a chance to level the series. Heading into the fifth and final Ashes Test with a 2-1 series lead and having retained the Ashes, the 30-year-old emphasised the need of having a thick skin to deal with everything. Australia narrowly avoided a loss in Manchester to retain the Ashes and Cummins' tactics were criticised as the tourists played catch-up cricket. It all started with their poor batting performance after losing the toss in ideal batting conditions. \"I honestly haven’t read anything. A few things have come across my desk from the boys having a laugh. I’ve been in this job two years now, and you learn pretty quickly that you’ve got to have a thick skin,\" Sydney Morning Herald quoted Cummins as saying. \"It’s such a great bunch of players and staff here that we all know what everyone is about and how we are going to go about it, and for me, that’s more important than anything else. I’m not going to please everyone and everyone’s got opinions, but they aren’t facts, they’re opinions,\" Cummins added. Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. In the fourth Test, the right-arm pacer similarly struggled with the ball, taking only one wicket and allowing 129 runs in 23 overs. \"I think it does have a shelf life. I won’t put a date on it, I’ve got to get there first. I feel like every Test match I learn quite a bit, you just get exposed to more things with each game. I’m loving working with this team and the staff. Enjoying it at the moment, we’ll see what the future holds. I feel like with each game I’m getting better and I think there’s a fair bit more left in me,\" Cummins said of captaincy. Even though Australia has already retained the urn, captain Cummins insisted that his team is still very eager to win the long-awaited Ashes series in England. \"I don’t think it’s shifted too much over the series, to be honest. I think Edgbaston again, was another moment where there wasn’t a lot in it (the pitch) for the bowlers. They scored almost 400 on day one and I don’t see it as too dissimilar to last week,\" Cummins said. \"I think you’ve got to hold your nerve a little bit sometimes, you’ve got to trust that’s your best percentage to get nicks even if they hit a few cover drives. You’ve got to keep your catchers in, you’ve got to take wickets. I think we’ve been pretty consistent this series,\" he added.","pubDate":"2023-07-27 06:37:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: England vs Australia 5th Test - pitch report, weather, playing XI changes - all you need to know","link":"https://www.indiatvnews.com/sports/cricket/ashes-2023-england-vs-australia-5th-test-the-oval-pitch-report-weather-playing-xi-changes-all-you-need-to-know-2023-07-27-883284","keywords":null,"creator":null,"video_url":null,"description":"Cricket's oldest and arguably the greatest rivalry is about to hit its crescendo as the hosts England and Australia are set to lock horns with each other at The Oval in the 5th Test of the ongoing Ashes series on Thursday, July 27. Both teams have played some jaw-dropping cricket throughout the series which has kept the fans hooked and on the edge of their seats.","content":"Cricket's oldest and arguably the greatest rivalry is about to hit its crescendo as the hosts England and Australia are set to lock horns with each other at The Oval in the 5th Test of the ongoing Ashes series on Thursday, July 27. Both teams have played some jaw-dropping cricket throughout the series which has kept the fans hooked and on the edge of their seats. Australia retained the urn after weather had the last laugh at Manchester in the 4th Test and the scoreline of the series now reads 2-1, with plenty to play for in the final game. For the -led Australia, it's an opportunity to be the first Aussie touring party since Steve Waugh's side of 2001 to win the urn on English soil. The amount of question marks raised on the leadership capability of Cummins is eye-popping with former players like Mark Waugh and Ian Chappell criticising the red-ball captain. On the other hand, the Three Lions were tantalisingly close to landing an equalizer at Old Trafford but found themselves on the other side of the weather. The Ben Stokes-led side has scripted a remarkable comeback in the series. After being 2-0 down the hosts made some tactical changes and it paved the way for them to announce their arrival in the series. Though England can't regain the urn anymore, they can certainly win the 5th Test and foil Australia's plans of rewriting history. If Stokes and his men manage to gain control at The Oval, it will certainly go down as a befitting reply to all the naysayers who have questioned the need and feasibility of Bazball. The wicket at The Oval is known as one of the most batting-friendly surfaces in England. The last Test at the venue was the World Test Championship final of the 2021-23 cycle played between Australia and India and the batters hogged the limelight with Travis Head and Steven Smith scoring match-winning tons. Hence, both batters must be itching to make the most of the conditions on offer. The last time both England and Australia played at the venue was during the 2019 series when the -led side won by 135 runs. The Oval has played host to 106 Tests thus far, with the side batting first winning 39 games and teams bowling first claiming the contests on 29 occasions. The average first innings score at the venue is 344, while the same in the second innings is 304. The chances of precipitation on Day 1 and Day 3 are quite high. With 55% and 88% of rainfall predicted on both days as per Accuweather, weather might very well act as a dampener and frustrate fans and players alike. As per the weather forecast, there will be rain around on all five days and hence a thick cloud cover will be expected for the major part of the game and will keep the pacers interested. Zak Crawley, Ben Duckett, , Joe Root, Harry Brook, Ben Stokes (c), (wk), Chris Woakes, Mark Wood, Stuart Broad, James Anderson David Warner, , Marnus Labuschagne, Steven Smith, Travis Head, Mitchell Marsh, (wk), Mitchell Starc/ Michael Neser, Pat Cummins (c), Todd Murphy, Josh Hazlewood","pubDate":"2023-07-27 06:34:28","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been'","link":"https://www.dailymail.co.uk/sport/cricket/article-12343403/Piers-Morgan-brands-Aussie-cricketers-cheating-convicts-says-England-robbed-victory-greatest-series-theres-been.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Piers Morgan has bemoaned the good fortune of the Australians this summer, insisting that cricket fans have been robbed of one of the sport's greatest series.","content":"Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been' Piers Morgan has blasted the Australian cricket team Morgan, 58, has been angered by the tourists' antics Australia retained the Ashes in underwhelming fashion By Ollie Lewis For Daily Mail Australia Updated: 04:13 EDT, 27 July 2023 e-mail 5 View comments Piers Morgan has taken aim at the Australian cricket team once again, with the British TV host branding Pat Cummins' side 'cheating convicts' amid their feisty Ashes series against England. Morgan, 58, was left infuriated by the antics of Alex Carey at Lord's, in which the Australian controversially stumped rival wicketkeeper Jonny Bairstow when the Englishman thought a Cameron Green delivery was dead. The Talk TV anchor has kept up his tirade against the tourists ever since, and vented his fury on Sunday when Australia escaped a chastening defeat at Old Trafford due to the weather, meaning that they have retained the Ashes. And speaking on the Telegraph's Vaughany and Tuffers Cricket Club Podcast, Morgan bemoaned the good fortune of the Australians this summer, insisting that cricket fans have been robbed of one of the sport's greatest series. 'This was building to one of the all-time great series — forget Ashes — of any cricket series, internationally, in history,' he said. Piers Morgan has labelled Australia 'cheating convicts' in another attack on the cricket team Australia retained the Ashes in fortunate circumstances after drawing at Old Trafford 'To be 2-0 down and then roar back to 2-2 and then go to the Oval, which is exactly what would have happened had we been able to play more than two hours at the weekend ... it would have been, really, the greatest comeback in cricket history internationally and the greatest series there's ever been. 'We should have won at Lord's, we should have won every Test, let's be honest. We're a better team, I don't think there's any doubt about that. We were dudded by the rain, and I think at the Oval we're going to flatten them. We need to. 'I don't want to lose 3-1 – to lose 3-1 to this Australian team of cheating convicts would be extremely annoying.' While the likes of Ricky Ponting have claimed Ben Stokes' captaincy should be under more scrutiny than Pat Cummins' leadership , Morgan lavished praise on the England skipper, but conceded that some modifications to Bazball may be needed. 'When we were at Lord's, when we gave away all those wickets, when we were 180-odd for 2 and then just fell apart, some of the shots we were playing – Harry Brook's innings that day was terrible,' he added. 'Yet you can see as the series has gone on he's got more sensible, more judicious in his shot selection, and you could see the world-class player in the making. Morgan praised Ben Stokes' captaincy despite England being at risk of a first home series defeat to Australia in 22 years 'I think they [England] lost their heads a bit at Lord's, but I totally understood why Ben Stokes is keen to say, 'Look, you've got to let us do our thing' because he's trying to instil in them that constant attacking mentality. 'I absolutely love everything about Ben Stokes. I think he's got that warrior spirit. When he gets going, the thing about Stokes is he doesn't go berserk for the sake of it; he doesn't play crazy shots. 'He's playing measured, brutal shots, but he can take a game away from people like no one I've seen. We take him for granted. He is unbelievable. I love the fact that nothing deters him; he doesn't make apologies.' Share or comment on this article: Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been' e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-27 07:41:01","image_url":"https://i.dailymail.co.uk/1s/2023/07/27/08/73670763-0-image-m-5_1690443605988.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"India vs West Indies 1st ODI 2023 Free Live Streaming Online on JioCinema and FanCode: Get Free Live TV Telecast of IND vs WI Cricket Match on DD Sports","link":"https://www.latestly.com/sports/cricket/india-vs-west-indies-1st-odi-2023-free-live-streaming-online-on-jiocinema-and-fancode-get-free-live-tv-telecast-of-ind-vs-wi-cricket-match-on-dd-sports-5296487.html","keywords":null,"creator":null,"video_url":null,"description":"The first game is at Bridgetown with the Men in Blue confident of a good showing. India won the test series 1-0 with the second game being washed out. The whole series so far has low on fan buzz but the fifty over format just might change things.","content":"With the Asia Cup and World Cup around the corner, the Indian cricket team will be looking to gain some early momentum when it takes on the West Indies in a three game ODI series. The first game is at Bridgetown with the Men in Blue confident of a good showing. India won the test series 1-0 with the second game being washed out. The whole series so far has low on fan buzz but the fifty-over format just might change things. Hots West Indies are not travelling to India for the World Cup after a poor performance in the qualifiers. The team is going through a rough patch off late and needs a big win to lift their morale. India vs West Indies 1st ODI 2023, Bridgetown, Barbados Weather Report: Check Out the Rain Forecast and Pitch Report at Kensington Oval . Rohit Sharma and Shubman Gill open the innings for India with Virat Kohli coming in at no 3. The trio will be doing the bulk of the scoring for the visitors. Sanju Samson could be used as a specialist wicket-keeper with Ishan Kishan as a middle order batsman. Hardik Pandya has an important role to play as a specialist all-rounder alongside Ravindra Jadeja. West Indies skipper Shai Hope is also their most skillful batsman who has excelled in the fifty over format. Alick Athinaze showcased his skills in the test series and he has an important role to play in the ODIs as well. Alzarri Joseph and Oshane Thomas will be leading the bowling attack for the hosts and a lot is riding on their shoulders. India vs West Indies 1st ODI 2023 Free Live Telecast (TV Channels in India) DD Sports has the telecast rights of India vs West Indies 2023. So, fans looking to watch IND vs WI ODI match on TV will have to tune into DD Sports to catch the action in Hindi and English commentary. The IND vs WI 1st ODI 2023 free live telecast will not only be available on DD Sports for DD FreeDish users but on DTH and DTT platforms as well. DD Bangla, DD Yadagiri, DD Saptagiri, DD Chandana, DD Podhigai, and DD National (Bhojpuri) will also provide the IND vs WI 1st ODI 2023 live telecast. IND vs WI Dream11 Team Prediction, 1st ODI 2023: Tips To Pick Best Fantasy Playing XI for India vs West Indies Cricket Match in Bridgetown. India vs West Indies 1st ODI 2023 Free Live Streaming Online Fans will have two options to watch the IND vs WI live streaming online of 1st ODI 2023. While JioCinema will provide the free live streaming online of IND vs WI, FanCode will provide live streaming, but fans will have to pay the subscription fee. On JioCinema mobile app and website, fans will get to watch the IND vs WI live streaming online for free. India has some of the best ODI players in their ranks and they should face little difficulty in securing a win in this game. (The above story first appeared on LatestLY on Jul 27, 2023 01:10 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:40:13","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st ODI Playing 11: आज भारत विरुद्ध वेस्ट इंडिज यांच्यातील पहिला एकदिवसीय सामना, अशी असु शकते दोन्ही संघांची संभाव्य प्लेइंग इलेव्हन","link":"https://marathi.latestly.com/sports/cricket/the-first-odi-match-between-india-vs-west-indies-today-this-could-be-the-possible-playing-eleven-of-both-the-teams-479640.html","keywords":null,"creator":null,"video_url":null,"description":"आम्ही तुम्हाला सांगतो की भारत विरुद्ध वेस्ट इंडिज (IND vs WI) यांच्यातील एकदिवसीय मालिकेतील पहिला सामना गुरुवारी म्हणजेच 27 जुलै रोजी खेळवला जाईल. केन्सिंग्टन ओव्हल, ब्रिजटाऊन, बार्बाडोस येथे भारतीय वेळेनुसार संध्याकाळी साडेसात वाजता दोन्ही संघ खेळणार आहेत.","content":"वेस्ट इंडिजविरुद्धच्या कसोटी मालिकेत (IND vs WI) 1-0 असा विजय नोंदवल्यानंतर भारतीय क्रिकेट संघाची नजर आता एकदिवसीय मालिकेवर आहे. आम्ही तुम्हाला सांगतो की भारत विरुद्ध वेस्ट इंडिज (IND vs WI) यांच्यातील एकदिवसीय मालिकेतील पहिला सामना गुरुवारी म्हणजेच 27 जुलै रोजी खेळवला जाईल. केन्सिंग्टन ओव्हल, ब्रिजटाऊन, बार्बाडोस येथे भारतीय वेळेनुसार संध्याकाळी साडेसात वाजता दोन्ही संघ खेळणार आहेत. चला तर मग जाणून घेऊया या सामन्यात दोन्ही संघांचे प्लेइंग 11 कसे असतील. (हे देखील वाचा: IND vs WI 1st ODI Pitch Report: केन्सिंग्टन ओव्हलच्या खेळपट्टीवर कोणाचा असेल बोलबाला, गोलंदाज की फलंदाज? जाणून घ्या खेळपट्टीचा अहवाल ) विशेष म्हणजे, अलीकडेच भारतीय संघाने वेस्ट इंडिजविरुद्ध दोन सामन्यांची कसोटी मालिका खेळली होती, ज्यामध्ये भारताने ही मालिका 1-0 अशी जिंकली होती. त्याचवेळी या मालिकेतील दुसरा सामना संततधार पावसामुळे अनिर्णित राहिला, तर पहिल्या सामन्यात भारताने दमदार कामगिरी करत विजय मिळवला. आता कसोटी मालिकेनंतर एकदिवसीय मालिका जिंकण्यावर टीम इंडियाचे डोळे लागले आहेत. भारतीय निवड समितीने वेस्ट इंडिजविरुद्धच्या संघात दोन यष्टीरक्षक फलंदाजांची निवड केली आहे. ज्यामध्ये इशान किशन आणि संजू सॅमसन यांचा समावेश आहे. अशा परिस्थितीत पहिल्या वनडेत भारतीय कर्णधार रोहित शर्मा प्लेइंग 11 मध्ये कोणाला संधी देणार हे पाहणे उत्सुकतेचे ठरणार आहे. आपणास सांगूया की वेस्ट इंडिजविरुद्धच्या दुसऱ्या कसोटीत इशानने नुकतेच शानदार फलंदाजी करताना अर्धशतक झळकावले होते, तर संजू बराच काळ संघाबाहेर आहे. पण राजस्थान रॉयल्सचा कर्णधार नेट्समध्ये सातत्यपूर्ण फलंदाजीचा सराव करत आहे. दोन्ही संघांची संभाव्य प्लेइंग इलेव्हन भारत: रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, संजू सॅमसन (यष्टीरक्षक), हार्दिक पांड्या, सूर्य कुमार यादव, शार्दुल ठाकूर, रवींद्र जडेजा, कुलदीप यादव, जयदेव उनाडकट, उमरान मलिक वेस्ट इंडिज: ब्रॅंडन किंग, काइल मेयर्स, अॅलिक अथानाझे, शाई होप (कर्णधार आणि विकेटकीपर), शिमरॉन हेटमायर, रोव्हमन पॉवेल, रोमॅरियो शेफर्ड, अल्झारी जोसेफ, केविन सिंक्लेअर, गुडाकेश मोटी, ओशाने थॉमस","pubDate":"2023-07-27 07:34:32","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"Global T20 Canada 2023: Brampton Wolves Derail Montreal Tigers; Toronto Nationals Beat Mississauga Panthers","link":"https://www.latestly.com/sports/cricket/global-t20-canada-2023-brampton-wolves-derail-montreal-tigers-toronto-nationals-beat-mississauga-panthers-5296437.html","keywords":null,"creator":null,"video_url":null,"description":"Colin Munro put in a match-winning performance with a blistering knock of 67 in just 31 deliveries as Toronto Nationals downed the Mississauga Panthers with six wickets and 6.4 overs to spare in Global T20 Canada at the TD Arena here.","content":"Brampton, July 27 : Colin Munro put in a match-winning performance with a blistering knock of 67 in just 31 deliveries as Toronto Nationals downed the Mississauga Panthers with six wickets and 6.4 overs to spare in Global T20 Canada at the TD Arena here. ‘Smashing It in Australia’ Video of Tottenham Hotspur Striker Harry Kane Showcasing His Cricket Skills Goes Viral . In the second clash on Wednesday, Colin De Grandhomme put on a stellar all-round display with 56 runs and two important wickets as the Brampton Wolves defeated the Montreal Tigers by 15 runs. The Brampton Wolves' first innings score of 143 proved enough to win them the match. The Toronto Nationals won an important toss and asked the Mississauga Panthers to bat first. The Nationals ran through the Panthers’ top order with brilliant spells from Faheem Ashraf and Saad Bin Zafar who bagged two wickets apiece early on. Chris Gayle (4), Navneet Dhaliwal (5) and Azam Khan (8) all perished in the Power-play, leaving the Panthers in trouble at 28/3 in six overs. Cameron Delport (4) also departed soon, before Shoaib Malik (37) and James Neesham (18) came together to steady the ship and weave an essential partnership of 44 runs for the Panthers, despite the conservative .Tom Cooper (26) came in at number 7 and was in sensational form in the death overs. He played a quick-fire knock in just 14 deliveries, while wickets around him tumbled, to help the Panthers finish at 115/9. Zaman Khan also showcased his proficiency in the death overs, picking up two wickets in the dying embers of the innings. In response, the Toronto Nationals blazed their way to their target. Colin Munro (67) unleashed an exhibition of power hitting reaching his half-century in just 20 balls before he was dismissed by Parveen Kumar. At the other end, Nicholas Kirton departed for 12 runs. Towards the end of the powerplay, the Nationals at 70/1 were well entrenched in the driver’s seat. Following the dismissal of Munro, Gerhard Erasmus (1) and Armaan Kapoor (5) fell in quick succession at the hands of Nikhil Dutta. Kargil Vijay Diwas 2023: Rishabh Pant Pays Tributes to Brave Warriors of India However, captain Hamza Tariq (25), who came in at number three played a composed unbeaten innings to ensure the Nationals reached their target comfortably, with six wickets and 6.4 overs to spare. The day’s second encounter saw Brampton Wolves bat first after losing the toss. The Wolves lost Aaron Johnson (6) as early as the second over. However, Usman Khan (33) cracked six boundaries while Mark Chapman (21) rotated the strike well to ensure the Wolves were well-placed at 53/1 at the end of the powerplay. Soon after, Aayaz Afzal Khan scalped Usman Khan and Hussain Talat in quick succession, before Colin De Grandhomme (56) came in at number five, to play a brilliant innings that was equal parts power and precision, before he was dismissed by Carlos Brathwaite. The Wolves looked poised for a big score initially, but the wickets continued to fall. Ayaan Afzal Khan picked up two more wickets in consecutive deliveries in the sixteenth over, while Carlos Brathwaite mopped up the tail with three wickets in the last over. The Brampton Wolves were all out for 143 in 19.5 overs. In response the Tigers lost both openers, Chris Lynn (9) and Muhammad Waseem (6) early in the innings. Shakib Al Hassan (28) and Dilpreet Singh (24) came together to forge a partnership and the Tigers were placed at 42/2 at the end of powerplay. Shakib Al Hassan once again failed to convert his start and Dilpreet Singh departed soon after. As the pressure mounted in the middle overs, Sherfane Rutherford (10) lost his wicket trying to clear the ropes. Ben Stokes to Become A Spinner? Here’s What England Test Captain Has to Say! With the Montreal Tigers chasing 44 runs in 36 balls with five wickets in hand, the game was delicately poised. However, Carlos Brathwaite (4) and Wijeyeratne (8) were both dismissed by Colin De Grandhomme, while Logan Van Beek picked up three wickets including Dipendra Singh Airee (28) to bundle out the Tigers for 128. The Brampton Wolves proved too much for the Tigers and they won by 15 runs. Brief scores: Mississauga Panthers 115/9 in 20 overs (Shoaib Malik 37, Tom Cooper 26, James Neesham 18; Saad Bin Zafar 3-31, Zaman Khan 2-20, Faheem Ashraf 2-30) lost to Toronto Nationals 118/4 in 13.2 overs (Colin Munro 67, Hamza Tariq 25; Nikhil Dutta 2/36) by 6 wickets. Brampton Wolves 143 all out in 19.5 overs (Colin De Grandhomme 56, Usman Khan 33, Mark Chapman 21; Carlos Brathwaite 4-21, Ayaan Afzal Khan 4-21) beat Montreal Tigers 128 in 19.1 overs (Shakib Al Hassan 28, Dipendra Singh Airee 28; Logan Van Beek 3-20, Colin De Grandhomme 2-8, Shahid Ahmadzai 2-33) by 15 runs. (The above story first appeared on LatestLY on Jul 27, 2023 01:05 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:29:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Former India cricketer Nidhi Buley and her sister Ritika enter BCCI Umpires panel","link":"https://www.indiatvnews.com/sports/cricket/former-india-cricketer-nidhi-buley-and-her-sister-ritika-enter-bcci-umpires-panel-2023-07-27-883294","keywords":null,"creator":null,"video_url":null,"description":"Former India cricketer Nidhi Buley has made it to the umpiring panel of the Board of Control for Cricket in India (BCCI). Her sister Ritika has also joined her in the list as a total of four females passed the umpiring exam conducted by the BCCI with a distinction. Nidhi Buley has played for India at the international level back in 2006 featuring in an ODI and a Test each.","content":"Former India cricketer Nidhi Buley has made it to the umpiring panel of the Board of Control for Cricket in India (BCCI). Her sister Ritika has also joined her in the list as a total of four females passed the umpiring exam conducted by the BCCI with a distinction. Nidhi Buley has played for India at the international level back in 2006 featuring in an ODI and a Test each. On the other hand, her sister Ritika couldn't make it to the higher level but she featured for Madhya Pradesh in domestic cricket in 31 first-class matches. The BCCI conducted an exam for the retired cricketers in the second week of June and the results of the same were declared on Wednesday (July 26). Candidates needed more than 120 marks out of 150 and both Nidhi and Ritika passed the exam with flying colours scoring 133.5 and 133 marks respectively. Apart from them, V Kritika from Tamil Nadu and Ankita Guha of Vidarbha were the other females who passed the exam and were elevated to the BCCI panel. Nikhil Patil of Mumbai Cricket Association topped the exam with a massive score of 147 out of 150. Coming back to Nidhi, she played for India in 2006 and bowled seven overs to pick one wicket in an ODI against Ireland. She also featured in the Test match against England and bowled 12 wicketless overs conceding 43 runs. But she never represented India again. Her sister Ritika never got picked for India but she always wanted to enter the big club of match officials. Nidhi regretted not getting to play at Lord's in her career but she now wants to officiate in a game at the Mecca of Cricket. \"As a player, I could not play at Lord's. We had a game there on the England tour in 2006 but I was not in the playing eleven. If I can umpire at Lord's that will be a dream come true for me,\" Nidhi said. Nidhi Buley has also witnessed the transformation of women's cricket in the last few years and lauded the BCCI for playing a huge supporting role. \"The BCCI has supported us a lot. It is after a long time retired cricketers are entering the umpiring space. The board wants to promote female umpires and bring them at par with men. It wants to treat them equally. In my playing days, even getting to practice with the male players was a big deal. I hope I get to officiate in men's matches which will be a big challenge,\" she further said. Ritika, 31, didn't get to play for India like her sister but she wants to officiate in men and women's cricket both as her interest was always in umpiring. \"As a player, I could not represent India, umpiring is the only way I can realise my dream. I used to stand behind the stumps and wonder how the umpires go about their job and count six balls. I understood that when I became an umpire myself. As players we don't know much about the laws of the game. It is only when you study you realise you did not know so much about the game,\" Ritika said while speaking to PTI.","pubDate":"2023-07-27 07:23:22","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"UEFA Champions League Qualifier 2023-24: Rakow Czestochowa Beat Qarabag FK","link":"https://www.latestly.com/sports/football/rakow-czestochowa-beat-qarabag-fk-in-uefa-champions-league-qualifier-5296172.html","keywords":null,"creator":null,"video_url":null,"description":"A stunning goal by Sonny Kittel in injury time earned Polish champions Rakow Czestochowa a 3-2 victory over Qarabag FK of Azerbaijan in the first leg of the UEFA Champions League second qualifying round.","content":"Warsaw (Poland) July 27 : A stunning goal by Sonny Kittel in injury time earned Polish champions Rakow Czestochowa a 3-2 victory over Qarabag FK of Azerbaijan in the first leg of the UEFA Champions League second qualifying round. Qarabag dominated the first half on Wednesday night, but they could not convert good chances into goals. In the 32nd minute, Patrick Andrade was in a perfect position to break the deadlock, but he hit the post, reports Xinhua. FIFA Women's World Cup 2023 Roundup: Spain, Japan Seal Last 16 Berths; Canada Beat Ireland . In other matches on Wednesday night, Kl Klaksvíkar of the Faroe Islands were held goalless by Hacken Gothenburg of Sweden; Ludogorets drew 1-1 with Olimpija Ljubljana; Aris Limassol of Cyprus thrashed BATE Borisov of Belarus 6-2 while Sheriff Tiraspol of Moldova defeated Maccabi Haifa of Israel 1-0. It was Rakow who found an opener ten minutes after the break. Marcin Cebula dribbled past a defender in the penalty area and tried to find Lukasz Zwolinski with a low pass. Elvin Jafarguliyev, who attempted to block the Rakow striker, put the ball into his own net from close range. Substitute Fabian Piasecki doubled Rakow's lead in the 71st minute through a header. However, the visitors reacted in the best possible way. The Azerbaijan champions needed just three minutes to level the score. Firstly, Redon Xhixha reduced the deficit with a stunning header into the far corner, while a moment later he tapped in after an assist by Hamidou Keyta. ‘Smashing It in Australia’ Video of Tottenham Hotspur Striker Harry Kane Showcasing His Cricket Skills Goes Viral . Qarabag tried to attack until the final whistle, but it was Rakow who had the last word. German midfielder Kittel made a dream debut as his powerful shot from distance gave the Polish champions the victory. The second leg will be played on August 2. (The above story first appeared on LatestLY on Jul 27, 2023 12:07 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:01:20","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st ODI Pitch Report: केन्सिंग्टन ओव्हलच्या खेळपट्टीवर कोणाचा असेल बोलबाला, गोलंदाज की फलंदाज? जाणून घ्या खेळपट्टीचा अहवाल","link":"https://marathi.latestly.com/sports/cricket/who-will-dominate-the-pitch-at-kensington-oval-the-bowlers-or-the-batsmen-know-the-pitch-report-479622.html","keywords":null,"creator":null,"video_url":null,"description":"पहिला वनडे सामना 27 जुलै रोजी केन्सिंग्टन ओव्हल येथे खेळवला जाईल. कसोटी मालिका 1-0 ने जिंकल्यानंतर आता ही मालिका भारतासाठी आशिया चषक आणि एकदिवसीय विश्वचषक स्पर्धेच्या दृष्टीने महत्त्वाची ठरणार आहे.","content":"भारत आणि वेस्ट इंडिज (IND vs WI) यांच्यात खेळल्या गेलेल्या दोन कसोटी सामन्यांच्या मालिकेनंतर आता दोन्ही संघ तीन सामन्यांच्या वनडे मालिकेत आमनेसामने येतील. पहिला वनडे सामना 27 जुलै रोजी केन्सिंग्टन ओव्हल येथे खेळवला जाईल. कसोटी मालिका 1-0 ने जिंकल्यानंतर आता ही मालिका भारतासाठी आशिया चषक आणि एकदिवसीय विश्वचषक स्पर्धेच्या दृष्टीने महत्त्वाची ठरणार आहे. त्याचवेळी पाहुण्या संघाला यावेळी विश्वचषकासाठी पात्र ठरविण्यात अपयश आले. केन्सिंग्टन ओव्हल स्टेडियमच्या खेळपट्टीचा अहवाल काय म्हणतो ते पाहूया... (हे देखील वाचा: IND vs WI 1st ODI 2023: वेस्ट इंडिजविरुद्ध पहिल्या सामन्यात कोण करणार विकेटकीपिंग? इशान किशन - संजू सॅमसन कोणाला मिळणार संधी; घ्या जाणून ) केन्सिंग्टन ओव्हल खेळपट्टी अहवाल तसे, केन्सिंग्टन ओव्हल ही गोलंदाजी अनुकूल पृष्ठभाग आहे. ही विकेट थोडी संथ आहे आणि वेगवान गोलंदाजांपेक्षा फिरकीपटूंना अधिक अनुकूल आहे. पहिल्या डावातील सरासरी स्कोअर 229 आहे. तथापि, येथे खेळल्या गेलेल्या शेवटच्या एकदिवसीय सामन्यात न्यूझीलंडने 302 धावांचे लक्ष्य 17 चेंडू शिल्लक असताना आणि 5 गडी राखून पूर्ण केले. टीम इंडियाने या मैदानावर एकूण तीन सामने खेळले आहेत, ज्यामध्ये त्यांचा पराभवाचा रेकॉर्ड 1-2 असा आहे. तथापि, दोन दशकांपूर्वी 2002 मध्ये तो येथे शेवटचा वनडे खेळला होता. कसे असेल हवामान येथे एकूण 49 सामने खेळले गेले आहेत, ज्यामध्ये प्रथम फलंदाजी करणाऱ्या संघाने 22 सामने जिंकले आहेत, तर पाठलाग करणाऱ्या संघाने 25 सामने जिंकले आहेत. मात्र, येथे खेळल्या गेलेल्या शेवटच्या 10 सामन्यांपैकी 7 सामने संघाने लक्ष्याचा पाठलाग करताना जिंकले आहेत. AccuWeather ने दिलेल्या हवामान अंदाजानुसार, ब्रिजटाउनमध्ये गुरुवारी कमाल तापमान 32°C आणि किमान 26°C पर्यंत पोहोचण्याची अपेक्षा आहे. अधूनमधून ढगांसह संपूर्ण सामन्यात पावसाची 7% शक्यता आहे.","pubDate":"2023-07-27 06:53:02","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"'I've no idea': Rohit Sharma not sure if Jasprit Bumrah will travel to Ireland for T20I series","link":"https://www.indiatvnews.com/sports/cricket/i-ve-no-idea-rohit-sharma-not-sure-if-jasprit-bumrah-will-travel-to-ireland-for-t20i-series-2023-07-27-883287","keywords":null,"creator":null,"video_url":null,"description":"Even as the World Cup is just over two months away from getting underway, all eyes are on India's injured players, especially Jasprit Bumrah. BCCI recently provided an update on his injury stating that the pacer has returned to bowling and will be playing a few practice matches at the National Cricket Academy. Moreover, reports recently emerged that Bumrah will be travelling to Ireland for three T20Is next month. However, when Rohit Sharma was asked about the same, he cleared that he has no idea.","content":"Even as the World Cup is just over two months away from getting underway, all eyes are on India's injured players, especially . BCCI recently provided an update on his injury stating that the pacer has returned to bowling and will be playing a few practice matches at the National Cricket Academy. Moreover, reports recently emerged that Bumrah will be travelling to Ireland for three T20Is next month. However, when was asked about the same, he cleared that he has no idea. He also highlighted the importance of match fitness while returning from a long injury layoff for a player. Moreover, the India captain is also hopeful that Bumrah returns fully fit and fine for the World Cup later this year. \"The amount of experience he (Bumrah) brings is very important. Right now he's coming from a serious injury and I've no idea if he'll travel to Ireland because the team hasn't been announced yet. If he gets to play then it's good and we hope he plays before the World Cup. When a player returns from a serious injury, match fitness, match feeling are some key components, which are missing,\" Rohit said ahead of the first ODI against West Indies. Rohit Sharma also confirmed that the team management is keeping an eye on Bumrah's recovery and if everything is going according to the plan. The management is also in touch with the NCA making sure that their premier bowler remains injury free for a longer period now. \"We'll see what has been planned and everything depends on his recovery. We are in constant touch with the NCA and things look positive at the moment,\" the India captain further added. Team India is struggling with injury to key players with World Cup approaching fast. Apart from Bumrah, even the likes of , Shreyas Iyer are injured at the moment. Speaking about the same, Rohit expressed that not much can be done about it and they have to keep backups ready while identifying the players who will play the mega event. \"You need experience when you go into big tournaments. Quite a few players are injured from our team but we try to identify players who are going to play in the World Cup and give them as many matches as possible so that they get the experience. But when there are injuries, you just don't know what you can do about it. Along with focusing on the XI, we need to focus on other 15-20 players too because anyone can get injured,\" Rohit said.","pubDate":"2023-07-27 06:42:42","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"'You got to have thick skin': Australia's skipper Pat Cummins reacts to criticism over his captaincy","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/27/you-got-to-have-thick-skin-australiasskipper-pat-cummins-reacts-to-criticism-over-his-captaincy-2599142.html","keywords":null,"creator":null,"video_url":null,"description":"Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. LONDON: Australia's captain Pat Cummins remains unfazed by criticism over his captaincy following two tight victories at Edgbaston and Lord’s, a defeat at Leeds, and a draw in Manchester. The fifth and final Test will begin at The Oval from Thursday with the hosts in with a chance to level the series. Heading into the fifth and final Ashes Test with a 2-1 series lead and having retained the Ashes, the 30-year-old emphasised the need of having a thick skin to deal with everything. Australia narrowly avoided a loss in Manchester to retain the Ashes and Cummins' tactics were criticised as the tourists played catch-up cricket. It all started with their poor batting performance after losing the toss in ideal batting conditions. \"I honestly haven’t read anything. A few things have come across my desk from the boys having a laugh. I’ve been in this job two years now, and you learn pretty quickly that you’ve got to have a thick skin,\" Sydney Morning Herald quoted Cummins as saying. \"It’s such a great bunch of players and staff here that we all know what everyone is about and how we are going to go about it, and for me, that’s more important than anything else. I’m not going to please everyone and everyone’s got opinions, but they aren’t facts, they’re opinions,\" Cummins added. Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. In the fourth Test, the right-arm pacer similarly struggled with the ball, taking only one wicket and allowing 129 runs in 23 overs. \"I think it does have a shelf life. I won’t put a date on it, I’ve got to get there first. I feel like every Test match I learn quite a bit, you just get exposed to more things with each game. I’m loving working with this team and the staff. Enjoying it at the moment, we’ll see what the future holds. I feel like with each game I’m getting better and I think there’s a fair bit more left in me,\" Cummins said of captaincy. Even though Australia has already retained the urn, captain Cummins insisted that his team is still very eager to win the long-awaited Ashes series in England. \"I don’t think it’s shifted too much over the series, to be honest. I think Edgbaston again, was another moment where there wasn’t a lot in it (the pitch) for the bowlers. They scored almost 400 on day one and I don’t see it as too dissimilar to last week,\" Cummins said. \"I think you’ve got to hold your nerve a little bit sometimes, you’ve got to trust that’s your best percentage to get nicks even if they hit a few cover drives. You’ve got to keep your catchers in, you’ve got to take wickets. I think we’ve been pretty consistent this series,\" he added.","content":"LONDON: Australia's captain Pat Cummins remains unfazed by criticism over his captaincy following two tight victories at Edgbaston and Lord’s, a defeat at Leeds, and a draw in Manchester. The fifth and final Test will begin at The Oval from Thursday with the hosts in with a chance to level the series. Heading into the fifth and final Ashes Test with a 2-1 series lead and having retained the Ashes, the 30-year-old emphasised the need of having a thick skin to deal with everything. Australia narrowly avoided a loss in Manchester to retain the Ashes and Cummins' tactics were criticised as the tourists played catch-up cricket. It all started with their poor batting performance after losing the toss in ideal batting conditions. \"I honestly haven’t read anything. A few things have come across my desk from the boys having a laugh. I’ve been in this job two years now, and you learn pretty quickly that you’ve got to have a thick skin,\" Sydney Morning Herald quoted Cummins as saying. \"It’s such a great bunch of players and staff here that we all know what everyone is about and how we are going to go about it, and for me, that’s more important than anything else. I’m not going to please everyone and everyone’s got opinions, but they aren’t facts, they’re opinions,\" Cummins added. Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. In the fourth Test, the right-arm pacer similarly struggled with the ball, taking only one wicket and allowing 129 runs in 23 overs. \"I think it does have a shelf life. I won’t put a date on it, I’ve got to get there first. I feel like every Test match I learn quite a bit, you just get exposed to more things with each game. I’m loving working with this team and the staff. Enjoying it at the moment, we’ll see what the future holds. I feel like with each game I’m getting better and I think there’s a fair bit more left in me,\" Cummins said of captaincy. Even though Australia has already retained the urn, captain Cummins insisted that his team is still very eager to win the long-awaited Ashes series in England. \"I don’t think it’s shifted too much over the series, to be honest. I think Edgbaston again, was another moment where there wasn’t a lot in it (the pitch) for the bowlers. They scored almost 400 on day one and I don’t see it as too dissimilar to last week,\" Cummins said. \"I think you’ve got to hold your nerve a little bit sometimes, you’ve got to trust that’s your best percentage to get nicks even if they hit a few cover drives. You’ve got to keep your catchers in, you’ve got to take wickets. I think we’ve been pretty consistent this series,\" he added.","pubDate":"2023-07-27 06:37:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: England vs Australia 5th Test - pitch report, weather, playing XI changes - all you need to know","link":"https://www.indiatvnews.com/sports/cricket/ashes-2023-england-vs-australia-5th-test-the-oval-pitch-report-weather-playing-xi-changes-all-you-need-to-know-2023-07-27-883284","keywords":null,"creator":null,"video_url":null,"description":"Cricket's oldest and arguably the greatest rivalry is about to hit its crescendo as the hosts England and Australia are set to lock horns with each other at The Oval in the 5th Test of the ongoing Ashes series on Thursday, July 27. Both teams have played some jaw-dropping cricket throughout the series which has kept the fans hooked and on the edge of their seats.","content":"Cricket's oldest and arguably the greatest rivalry is about to hit its crescendo as the hosts England and Australia are set to lock horns with each other at The Oval in the 5th Test of the ongoing Ashes series on Thursday, July 27. Both teams have played some jaw-dropping cricket throughout the series which has kept the fans hooked and on the edge of their seats. Australia retained the urn after weather had the last laugh at Manchester in the 4th Test and the scoreline of the series now reads 2-1, with plenty to play for in the final game. For the -led Australia, it's an opportunity to be the first Aussie touring party since Steve Waugh's side of 2001 to win the urn on English soil. The amount of question marks raised on the leadership capability of Cummins is eye-popping with former players like Mark Waugh and Ian Chappell criticising the red-ball captain. On the other hand, the Three Lions were tantalisingly close to landing an equalizer at Old Trafford but found themselves on the other side of the weather. The Ben Stokes-led side has scripted a remarkable comeback in the series. After being 2-0 down the hosts made some tactical changes and it paved the way for them to announce their arrival in the series. Though England can't regain the urn anymore, they can certainly win the 5th Test and foil Australia's plans of rewriting history. If Stokes and his men manage to gain control at The Oval, it will certainly go down as a befitting reply to all the naysayers who have questioned the need and feasibility of Bazball. The wicket at The Oval is known as one of the most batting-friendly surfaces in England. The last Test at the venue was the World Test Championship final of the 2021-23 cycle played between Australia and India and the batters hogged the limelight with Travis Head and Steven Smith scoring match-winning tons. Hence, both batters must be itching to make the most of the conditions on offer. The last time both England and Australia played at the venue was during the 2019 series when the -led side won by 135 runs. The Oval has played host to 106 Tests thus far, with the side batting first winning 39 games and teams bowling first claiming the contests on 29 occasions. The average first innings score at the venue is 344, while the same in the second innings is 304. The chances of precipitation on Day 1 and Day 3 are quite high. With 55% and 88% of rainfall predicted on both days as per Accuweather, weather might very well act as a dampener and frustrate fans and players alike. As per the weather forecast, there will be rain around on all five days and hence a thick cloud cover will be expected for the major part of the game and will keep the pacers interested. Zak Crawley, Ben Duckett, , Joe Root, Harry Brook, Ben Stokes (c), (wk), Chris Woakes, Mark Wood, Stuart Broad, James Anderson David Warner, , Marnus Labuschagne, Steven Smith, Travis Head, Mitchell Marsh, (wk), Mitchell Starc/ Michael Neser, Pat Cummins (c), Todd Murphy, Josh Hazlewood","pubDate":"2023-07-27 06:34:28","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been'","link":"https://www.dailymail.co.uk/sport/cricket/article-12343403/Piers-Morgan-brands-Aussie-cricketers-cheating-convicts-says-England-robbed-victory-greatest-series-theres-been.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Piers Morgan has bemoaned the good fortune of the Australians this summer, insisting that cricket fans have been robbed of one of the sport's greatest series.","content":"Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been' Piers Morgan has blasted the Australian cricket team Morgan, 58, has been angered by the tourists' antics Australia retained the Ashes in underwhelming fashion By Ollie Lewis For Daily Mail Australia Updated: 04:13 EDT, 27 July 2023 e-mail 5 View comments Piers Morgan has taken aim at the Australian cricket team once again, with the British TV host branding Pat Cummins' side 'cheating convicts' amid their feisty Ashes series against England. Morgan, 58, was left infuriated by the antics of Alex Carey at Lord's, in which the Australian controversially stumped rival wicketkeeper Jonny Bairstow when the Englishman thought a Cameron Green delivery was dead. The Talk TV anchor has kept up his tirade against the tourists ever since, and vented his fury on Sunday when Australia escaped a chastening defeat at Old Trafford due to the weather, meaning that they have retained the Ashes. And speaking on the Telegraph's Vaughany and Tuffers Cricket Club Podcast, Morgan bemoaned the good fortune of the Australians this summer, insisting that cricket fans have been robbed of one of the sport's greatest series. 'This was building to one of the all-time great series — forget Ashes — of any cricket series, internationally, in history,' he said. Piers Morgan has labelled Australia 'cheating convicts' in another attack on the cricket team Australia retained the Ashes in fortunate circumstances after drawing at Old Trafford 'To be 2-0 down and then roar back to 2-2 and then go to the Oval, which is exactly what would have happened had we been able to play more than two hours at the weekend ... it would have been, really, the greatest comeback in cricket history internationally and the greatest series there's ever been. 'We should have won at Lord's, we should have won every Test, let's be honest. We're a better team, I don't think there's any doubt about that. We were dudded by the rain, and I think at the Oval we're going to flatten them. We need to. 'I don't want to lose 3-1 – to lose 3-1 to this Australian team of cheating convicts would be extremely annoying.' While the likes of Ricky Ponting have claimed Ben Stokes' captaincy should be under more scrutiny than Pat Cummins' leadership , Morgan lavished praise on the England skipper, but conceded that some modifications to Bazball may be needed. 'When we were at Lord's, when we gave away all those wickets, when we were 180-odd for 2 and then just fell apart, some of the shots we were playing – Harry Brook's innings that day was terrible,' he added. 'Yet you can see as the series has gone on he's got more sensible, more judicious in his shot selection, and you could see the world-class player in the making. Morgan praised Ben Stokes' captaincy despite England being at risk of a first home series defeat to Australia in 22 years 'I think they [England] lost their heads a bit at Lord's, but I totally understood why Ben Stokes is keen to say, 'Look, you've got to let us do our thing' because he's trying to instil in them that constant attacking mentality. 'I absolutely love everything about Ben Stokes. I think he's got that warrior spirit. When he gets going, the thing about Stokes is he doesn't go berserk for the sake of it; he doesn't play crazy shots. 'He's playing measured, brutal shots, but he can take a game away from people like no one I've seen. We take him for granted. He is unbelievable. I love the fact that nothing deters him; he doesn't make apologies.' Share or comment on this article: Piers Morgan brands Aussie cricketers 'cheating convicts' and says England have been robbed of victory in 'greatest series there's ever been' e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-27 07:41:01","image_url":"https://i.dailymail.co.uk/1s/2023/07/27/08/73670763-0-image-m-5_1690443605988.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"India vs West Indies 1st ODI 2023 Free Live Streaming Online on JioCinema and FanCode: Get Free Live TV Telecast of IND vs WI Cricket Match on DD Sports","link":"https://www.latestly.com/sports/cricket/india-vs-west-indies-1st-odi-2023-free-live-streaming-online-on-jiocinema-and-fancode-get-free-live-tv-telecast-of-ind-vs-wi-cricket-match-on-dd-sports-5296487.html","keywords":null,"creator":null,"video_url":null,"description":"The first game is at Bridgetown with the Men in Blue confident of a good showing. India won the test series 1-0 with the second game being washed out. The whole series so far has low on fan buzz but the fifty over format just might change things.","content":"With the Asia Cup and World Cup around the corner, the Indian cricket team will be looking to gain some early momentum when it takes on the West Indies in a three game ODI series. The first game is at Bridgetown with the Men in Blue confident of a good showing. India won the test series 1-0 with the second game being washed out. The whole series so far has low on fan buzz but the fifty-over format just might change things. Hots West Indies are not travelling to India for the World Cup after a poor performance in the qualifiers. The team is going through a rough patch off late and needs a big win to lift their morale. India vs West Indies 1st ODI 2023, Bridgetown, Barbados Weather Report: Check Out the Rain Forecast and Pitch Report at Kensington Oval . Rohit Sharma and Shubman Gill open the innings for India with Virat Kohli coming in at no 3. The trio will be doing the bulk of the scoring for the visitors. Sanju Samson could be used as a specialist wicket-keeper with Ishan Kishan as a middle order batsman. Hardik Pandya has an important role to play as a specialist all-rounder alongside Ravindra Jadeja. West Indies skipper Shai Hope is also their most skillful batsman who has excelled in the fifty over format. Alick Athinaze showcased his skills in the test series and he has an important role to play in the ODIs as well. Alzarri Joseph and Oshane Thomas will be leading the bowling attack for the hosts and a lot is riding on their shoulders. India vs West Indies 1st ODI 2023 Free Live Telecast (TV Channels in India) DD Sports has the telecast rights of India vs West Indies 2023. So, fans looking to watch IND vs WI ODI match on TV will have to tune into DD Sports to catch the action in Hindi and English commentary. The IND vs WI 1st ODI 2023 free live telecast will not only be available on DD Sports for DD FreeDish users but on DTH and DTT platforms as well. DD Bangla, DD Yadagiri, DD Saptagiri, DD Chandana, DD Podhigai, and DD National (Bhojpuri) will also provide the IND vs WI 1st ODI 2023 live telecast. IND vs WI Dream11 Team Prediction, 1st ODI 2023: Tips To Pick Best Fantasy Playing XI for India vs West Indies Cricket Match in Bridgetown. India vs West Indies 1st ODI 2023 Free Live Streaming Online Fans will have two options to watch the IND vs WI live streaming online of 1st ODI 2023. While JioCinema will provide the free live streaming online of IND vs WI, FanCode will provide live streaming, but fans will have to pay the subscription fee. On JioCinema mobile app and website, fans will get to watch the IND vs WI live streaming online for free. India has some of the best ODI players in their ranks and they should face little difficulty in securing a win in this game. (The above story first appeared on LatestLY on Jul 27, 2023 01:10 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:40:13","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st ODI Playing 11: आज भारत विरुद्ध वेस्ट इंडिज यांच्यातील पहिला एकदिवसीय सामना, अशी असु शकते दोन्ही संघांची संभाव्य प्लेइंग इलेव्हन","link":"https://marathi.latestly.com/sports/cricket/the-first-odi-match-between-india-vs-west-indies-today-this-could-be-the-possible-playing-eleven-of-both-the-teams-479640.html","keywords":null,"creator":null,"video_url":null,"description":"आम्ही तुम्हाला सांगतो की भारत विरुद्ध वेस्ट इंडिज (IND vs WI) यांच्यातील एकदिवसीय मालिकेतील पहिला सामना गुरुवारी म्हणजेच 27 जुलै रोजी खेळवला जाईल. केन्सिंग्टन ओव्हल, ब्रिजटाऊन, बार्बाडोस येथे भारतीय वेळेनुसार संध्याकाळी साडेसात वाजता दोन्ही संघ खेळणार आहेत.","content":"वेस्ट इंडिजविरुद्धच्या कसोटी मालिकेत (IND vs WI) 1-0 असा विजय नोंदवल्यानंतर भारतीय क्रिकेट संघाची नजर आता एकदिवसीय मालिकेवर आहे. आम्ही तुम्हाला सांगतो की भारत विरुद्ध वेस्ट इंडिज (IND vs WI) यांच्यातील एकदिवसीय मालिकेतील पहिला सामना गुरुवारी म्हणजेच 27 जुलै रोजी खेळवला जाईल. केन्सिंग्टन ओव्हल, ब्रिजटाऊन, बार्बाडोस येथे भारतीय वेळेनुसार संध्याकाळी साडेसात वाजता दोन्ही संघ खेळणार आहेत. चला तर मग जाणून घेऊया या सामन्यात दोन्ही संघांचे प्लेइंग 11 कसे असतील. (हे देखील वाचा: IND vs WI 1st ODI Pitch Report: केन्सिंग्टन ओव्हलच्या खेळपट्टीवर कोणाचा असेल बोलबाला, गोलंदाज की फलंदाज? जाणून घ्या खेळपट्टीचा अहवाल ) विशेष म्हणजे, अलीकडेच भारतीय संघाने वेस्ट इंडिजविरुद्ध दोन सामन्यांची कसोटी मालिका खेळली होती, ज्यामध्ये भारताने ही मालिका 1-0 अशी जिंकली होती. त्याचवेळी या मालिकेतील दुसरा सामना संततधार पावसामुळे अनिर्णित राहिला, तर पहिल्या सामन्यात भारताने दमदार कामगिरी करत विजय मिळवला. आता कसोटी मालिकेनंतर एकदिवसीय मालिका जिंकण्यावर टीम इंडियाचे डोळे लागले आहेत. भारतीय निवड समितीने वेस्ट इंडिजविरुद्धच्या संघात दोन यष्टीरक्षक फलंदाजांची निवड केली आहे. ज्यामध्ये इशान किशन आणि संजू सॅमसन यांचा समावेश आहे. अशा परिस्थितीत पहिल्या वनडेत भारतीय कर्णधार रोहित शर्मा प्लेइंग 11 मध्ये कोणाला संधी देणार हे पाहणे उत्सुकतेचे ठरणार आहे. आपणास सांगूया की वेस्ट इंडिजविरुद्धच्या दुसऱ्या कसोटीत इशानने नुकतेच शानदार फलंदाजी करताना अर्धशतक झळकावले होते, तर संजू बराच काळ संघाबाहेर आहे. पण राजस्थान रॉयल्सचा कर्णधार नेट्समध्ये सातत्यपूर्ण फलंदाजीचा सराव करत आहे. दोन्ही संघांची संभाव्य प्लेइंग इलेव्हन भारत: रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, संजू सॅमसन (यष्टीरक्षक), हार्दिक पांड्या, सूर्य कुमार यादव, शार्दुल ठाकूर, रवींद्र जडेजा, कुलदीप यादव, जयदेव उनाडकट, उमरान मलिक वेस्ट इंडिज: ब्रॅंडन किंग, काइल मेयर्स, अॅलिक अथानाझे, शाई होप (कर्णधार आणि विकेटकीपर), शिमरॉन हेटमायर, रोव्हमन पॉवेल, रोमॅरियो शेफर्ड, अल्झारी जोसेफ, केविन सिंक्लेअर, गुडाकेश मोटी, ओशाने थॉमस","pubDate":"2023-07-27 07:34:32","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"Global T20 Canada 2023: Brampton Wolves Derail Montreal Tigers; Toronto Nationals Beat Mississauga Panthers","link":"https://www.latestly.com/sports/cricket/global-t20-canada-2023-brampton-wolves-derail-montreal-tigers-toronto-nationals-beat-mississauga-panthers-5296437.html","keywords":null,"creator":null,"video_url":null,"description":"Colin Munro put in a match-winning performance with a blistering knock of 67 in just 31 deliveries as Toronto Nationals downed the Mississauga Panthers with six wickets and 6.4 overs to spare in Global T20 Canada at the TD Arena here.","content":"Brampton, July 27 : Colin Munro put in a match-winning performance with a blistering knock of 67 in just 31 deliveries as Toronto Nationals downed the Mississauga Panthers with six wickets and 6.4 overs to spare in Global T20 Canada at the TD Arena here. ‘Smashing It in Australia’ Video of Tottenham Hotspur Striker Harry Kane Showcasing His Cricket Skills Goes Viral . In the second clash on Wednesday, Colin De Grandhomme put on a stellar all-round display with 56 runs and two important wickets as the Brampton Wolves defeated the Montreal Tigers by 15 runs. The Brampton Wolves' first innings score of 143 proved enough to win them the match. The Toronto Nationals won an important toss and asked the Mississauga Panthers to bat first. The Nationals ran through the Panthers’ top order with brilliant spells from Faheem Ashraf and Saad Bin Zafar who bagged two wickets apiece early on. Chris Gayle (4), Navneet Dhaliwal (5) and Azam Khan (8) all perished in the Power-play, leaving the Panthers in trouble at 28/3 in six overs. Cameron Delport (4) also departed soon, before Shoaib Malik (37) and James Neesham (18) came together to steady the ship and weave an essential partnership of 44 runs for the Panthers, despite the conservative .Tom Cooper (26) came in at number 7 and was in sensational form in the death overs. He played a quick-fire knock in just 14 deliveries, while wickets around him tumbled, to help the Panthers finish at 115/9. Zaman Khan also showcased his proficiency in the death overs, picking up two wickets in the dying embers of the innings. In response, the Toronto Nationals blazed their way to their target. Colin Munro (67) unleashed an exhibition of power hitting reaching his half-century in just 20 balls before he was dismissed by Parveen Kumar. At the other end, Nicholas Kirton departed for 12 runs. Towards the end of the powerplay, the Nationals at 70/1 were well entrenched in the driver’s seat. Following the dismissal of Munro, Gerhard Erasmus (1) and Armaan Kapoor (5) fell in quick succession at the hands of Nikhil Dutta. Kargil Vijay Diwas 2023: Rishabh Pant Pays Tributes to Brave Warriors of India However, captain Hamza Tariq (25), who came in at number three played a composed unbeaten innings to ensure the Nationals reached their target comfortably, with six wickets and 6.4 overs to spare. The day’s second encounter saw Brampton Wolves bat first after losing the toss. The Wolves lost Aaron Johnson (6) as early as the second over. However, Usman Khan (33) cracked six boundaries while Mark Chapman (21) rotated the strike well to ensure the Wolves were well-placed at 53/1 at the end of the powerplay. Soon after, Aayaz Afzal Khan scalped Usman Khan and Hussain Talat in quick succession, before Colin De Grandhomme (56) came in at number five, to play a brilliant innings that was equal parts power and precision, before he was dismissed by Carlos Brathwaite. The Wolves looked poised for a big score initially, but the wickets continued to fall. Ayaan Afzal Khan picked up two more wickets in consecutive deliveries in the sixteenth over, while Carlos Brathwaite mopped up the tail with three wickets in the last over. The Brampton Wolves were all out for 143 in 19.5 overs. In response the Tigers lost both openers, Chris Lynn (9) and Muhammad Waseem (6) early in the innings. Shakib Al Hassan (28) and Dilpreet Singh (24) came together to forge a partnership and the Tigers were placed at 42/2 at the end of powerplay. Shakib Al Hassan once again failed to convert his start and Dilpreet Singh departed soon after. As the pressure mounted in the middle overs, Sherfane Rutherford (10) lost his wicket trying to clear the ropes. Ben Stokes to Become A Spinner? Here’s What England Test Captain Has to Say! With the Montreal Tigers chasing 44 runs in 36 balls with five wickets in hand, the game was delicately poised. However, Carlos Brathwaite (4) and Wijeyeratne (8) were both dismissed by Colin De Grandhomme, while Logan Van Beek picked up three wickets including Dipendra Singh Airee (28) to bundle out the Tigers for 128. The Brampton Wolves proved too much for the Tigers and they won by 15 runs. Brief scores: Mississauga Panthers 115/9 in 20 overs (Shoaib Malik 37, Tom Cooper 26, James Neesham 18; Saad Bin Zafar 3-31, Zaman Khan 2-20, Faheem Ashraf 2-30) lost to Toronto Nationals 118/4 in 13.2 overs (Colin Munro 67, Hamza Tariq 25; Nikhil Dutta 2/36) by 6 wickets. Brampton Wolves 143 all out in 19.5 overs (Colin De Grandhomme 56, Usman Khan 33, Mark Chapman 21; Carlos Brathwaite 4-21, Ayaan Afzal Khan 4-21) beat Montreal Tigers 128 in 19.1 overs (Shakib Al Hassan 28, Dipendra Singh Airee 28; Logan Van Beek 3-20, Colin De Grandhomme 2-8, Shahid Ahmadzai 2-33) by 15 runs. (The above story first appeared on LatestLY on Jul 27, 2023 01:05 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:29:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Former India cricketer Nidhi Buley and her sister Ritika enter BCCI Umpires panel","link":"https://www.indiatvnews.com/sports/cricket/former-india-cricketer-nidhi-buley-and-her-sister-ritika-enter-bcci-umpires-panel-2023-07-27-883294","keywords":null,"creator":null,"video_url":null,"description":"Former India cricketer Nidhi Buley has made it to the umpiring panel of the Board of Control for Cricket in India (BCCI). Her sister Ritika has also joined her in the list as a total of four females passed the umpiring exam conducted by the BCCI with a distinction. Nidhi Buley has played for India at the international level back in 2006 featuring in an ODI and a Test each.","content":"Former India cricketer Nidhi Buley has made it to the umpiring panel of the Board of Control for Cricket in India (BCCI). Her sister Ritika has also joined her in the list as a total of four females passed the umpiring exam conducted by the BCCI with a distinction. Nidhi Buley has played for India at the international level back in 2006 featuring in an ODI and a Test each. On the other hand, her sister Ritika couldn't make it to the higher level but she featured for Madhya Pradesh in domestic cricket in 31 first-class matches. The BCCI conducted an exam for the retired cricketers in the second week of June and the results of the same were declared on Wednesday (July 26). Candidates needed more than 120 marks out of 150 and both Nidhi and Ritika passed the exam with flying colours scoring 133.5 and 133 marks respectively. Apart from them, V Kritika from Tamil Nadu and Ankita Guha of Vidarbha were the other females who passed the exam and were elevated to the BCCI panel. Nikhil Patil of Mumbai Cricket Association topped the exam with a massive score of 147 out of 150. Coming back to Nidhi, she played for India in 2006 and bowled seven overs to pick one wicket in an ODI against Ireland. She also featured in the Test match against England and bowled 12 wicketless overs conceding 43 runs. But she never represented India again. Her sister Ritika never got picked for India but she always wanted to enter the big club of match officials. Nidhi regretted not getting to play at Lord's in her career but she now wants to officiate in a game at the Mecca of Cricket. \"As a player, I could not play at Lord's. We had a game there on the England tour in 2006 but I was not in the playing eleven. If I can umpire at Lord's that will be a dream come true for me,\" Nidhi said. Nidhi Buley has also witnessed the transformation of women's cricket in the last few years and lauded the BCCI for playing a huge supporting role. \"The BCCI has supported us a lot. It is after a long time retired cricketers are entering the umpiring space. The board wants to promote female umpires and bring them at par with men. It wants to treat them equally. In my playing days, even getting to practice with the male players was a big deal. I hope I get to officiate in men's matches which will be a big challenge,\" she further said. Ritika, 31, didn't get to play for India like her sister but she wants to officiate in men and women's cricket both as her interest was always in umpiring. \"As a player, I could not represent India, umpiring is the only way I can realise my dream. I used to stand behind the stumps and wonder how the umpires go about their job and count six balls. I understood that when I became an umpire myself. As players we don't know much about the laws of the game. It is only when you study you realise you did not know so much about the game,\" Ritika said while speaking to PTI.","pubDate":"2023-07-27 07:23:22","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"UEFA Champions League Qualifier 2023-24: Rakow Czestochowa Beat Qarabag FK","link":"https://www.latestly.com/sports/football/rakow-czestochowa-beat-qarabag-fk-in-uefa-champions-league-qualifier-5296172.html","keywords":null,"creator":null,"video_url":null,"description":"A stunning goal by Sonny Kittel in injury time earned Polish champions Rakow Czestochowa a 3-2 victory over Qarabag FK of Azerbaijan in the first leg of the UEFA Champions League second qualifying round.","content":"Warsaw (Poland) July 27 : A stunning goal by Sonny Kittel in injury time earned Polish champions Rakow Czestochowa a 3-2 victory over Qarabag FK of Azerbaijan in the first leg of the UEFA Champions League second qualifying round. Qarabag dominated the first half on Wednesday night, but they could not convert good chances into goals. In the 32nd minute, Patrick Andrade was in a perfect position to break the deadlock, but he hit the post, reports Xinhua. FIFA Women's World Cup 2023 Roundup: Spain, Japan Seal Last 16 Berths; Canada Beat Ireland . In other matches on Wednesday night, Kl Klaksvíkar of the Faroe Islands were held goalless by Hacken Gothenburg of Sweden; Ludogorets drew 1-1 with Olimpija Ljubljana; Aris Limassol of Cyprus thrashed BATE Borisov of Belarus 6-2 while Sheriff Tiraspol of Moldova defeated Maccabi Haifa of Israel 1-0. It was Rakow who found an opener ten minutes after the break. Marcin Cebula dribbled past a defender in the penalty area and tried to find Lukasz Zwolinski with a low pass. Elvin Jafarguliyev, who attempted to block the Rakow striker, put the ball into his own net from close range. Substitute Fabian Piasecki doubled Rakow's lead in the 71st minute through a header. However, the visitors reacted in the best possible way. The Azerbaijan champions needed just three minutes to level the score. Firstly, Redon Xhixha reduced the deficit with a stunning header into the far corner, while a moment later he tapped in after an assist by Hamidou Keyta. ‘Smashing It in Australia’ Video of Tottenham Hotspur Striker Harry Kane Showcasing His Cricket Skills Goes Viral . Qarabag tried to attack until the final whistle, but it was Rakow who had the last word. German midfielder Kittel made a dream debut as his powerful shot from distance gave the Polish champions the victory. The second leg will be played on August 2. (The above story first appeared on LatestLY on Jul 27, 2023 12:07 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-27 07:01:20","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st ODI Pitch Report: केन्सिंग्टन ओव्हलच्या खेळपट्टीवर कोणाचा असेल बोलबाला, गोलंदाज की फलंदाज? जाणून घ्या खेळपट्टीचा अहवाल","link":"https://marathi.latestly.com/sports/cricket/who-will-dominate-the-pitch-at-kensington-oval-the-bowlers-or-the-batsmen-know-the-pitch-report-479622.html","keywords":null,"creator":null,"video_url":null,"description":"पहिला वनडे सामना 27 जुलै रोजी केन्सिंग्टन ओव्हल येथे खेळवला जाईल. कसोटी मालिका 1-0 ने जिंकल्यानंतर आता ही मालिका भारतासाठी आशिया चषक आणि एकदिवसीय विश्वचषक स्पर्धेच्या दृष्टीने महत्त्वाची ठरणार आहे.","content":"भारत आणि वेस्ट इंडिज (IND vs WI) यांच्यात खेळल्या गेलेल्या दोन कसोटी सामन्यांच्या मालिकेनंतर आता दोन्ही संघ तीन सामन्यांच्या वनडे मालिकेत आमनेसामने येतील. पहिला वनडे सामना 27 जुलै रोजी केन्सिंग्टन ओव्हल येथे खेळवला जाईल. कसोटी मालिका 1-0 ने जिंकल्यानंतर आता ही मालिका भारतासाठी आशिया चषक आणि एकदिवसीय विश्वचषक स्पर्धेच्या दृष्टीने महत्त्वाची ठरणार आहे. त्याचवेळी पाहुण्या संघाला यावेळी विश्वचषकासाठी पात्र ठरविण्यात अपयश आले. केन्सिंग्टन ओव्हल स्टेडियमच्या खेळपट्टीचा अहवाल काय म्हणतो ते पाहूया... (हे देखील वाचा: IND vs WI 1st ODI 2023: वेस्ट इंडिजविरुद्ध पहिल्या सामन्यात कोण करणार विकेटकीपिंग? इशान किशन - संजू सॅमसन कोणाला मिळणार संधी; घ्या जाणून ) केन्सिंग्टन ओव्हल खेळपट्टी अहवाल तसे, केन्सिंग्टन ओव्हल ही गोलंदाजी अनुकूल पृष्ठभाग आहे. ही विकेट थोडी संथ आहे आणि वेगवान गोलंदाजांपेक्षा फिरकीपटूंना अधिक अनुकूल आहे. पहिल्या डावातील सरासरी स्कोअर 229 आहे. तथापि, येथे खेळल्या गेलेल्या शेवटच्या एकदिवसीय सामन्यात न्यूझीलंडने 302 धावांचे लक्ष्य 17 चेंडू शिल्लक असताना आणि 5 गडी राखून पूर्ण केले. टीम इंडियाने या मैदानावर एकूण तीन सामने खेळले आहेत, ज्यामध्ये त्यांचा पराभवाचा रेकॉर्ड 1-2 असा आहे. तथापि, दोन दशकांपूर्वी 2002 मध्ये तो येथे शेवटचा वनडे खेळला होता. कसे असेल हवामान येथे एकूण 49 सामने खेळले गेले आहेत, ज्यामध्ये प्रथम फलंदाजी करणाऱ्या संघाने 22 सामने जिंकले आहेत, तर पाठलाग करणाऱ्या संघाने 25 सामने जिंकले आहेत. मात्र, येथे खेळल्या गेलेल्या शेवटच्या 10 सामन्यांपैकी 7 सामने संघाने लक्ष्याचा पाठलाग करताना जिंकले आहेत. AccuWeather ने दिलेल्या हवामान अंदाजानुसार, ब्रिजटाउनमध्ये गुरुवारी कमाल तापमान 32°C आणि किमान 26°C पर्यंत पोहोचण्याची अपेक्षा आहे. अधूनमधून ढगांसह संपूर्ण सामन्यात पावसाची 7% शक्यता आहे.","pubDate":"2023-07-27 06:53:02","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"'I've no idea': Rohit Sharma not sure if Jasprit Bumrah will travel to Ireland for T20I series","link":"https://www.indiatvnews.com/sports/cricket/i-ve-no-idea-rohit-sharma-not-sure-if-jasprit-bumrah-will-travel-to-ireland-for-t20i-series-2023-07-27-883287","keywords":null,"creator":null,"video_url":null,"description":"Even as the World Cup is just over two months away from getting underway, all eyes are on India's injured players, especially Jasprit Bumrah. BCCI recently provided an update on his injury stating that the pacer has returned to bowling and will be playing a few practice matches at the National Cricket Academy. Moreover, reports recently emerged that Bumrah will be travelling to Ireland for three T20Is next month. However, when Rohit Sharma was asked about the same, he cleared that he has no idea.","content":"Even as the World Cup is just over two months away from getting underway, all eyes are on India's injured players, especially . BCCI recently provided an update on his injury stating that the pacer has returned to bowling and will be playing a few practice matches at the National Cricket Academy. Moreover, reports recently emerged that Bumrah will be travelling to Ireland for three T20Is next month. However, when was asked about the same, he cleared that he has no idea. He also highlighted the importance of match fitness while returning from a long injury layoff for a player. Moreover, the India captain is also hopeful that Bumrah returns fully fit and fine for the World Cup later this year. \"The amount of experience he (Bumrah) brings is very important. Right now he's coming from a serious injury and I've no idea if he'll travel to Ireland because the team hasn't been announced yet. If he gets to play then it's good and we hope he plays before the World Cup. When a player returns from a serious injury, match fitness, match feeling are some key components, which are missing,\" Rohit said ahead of the first ODI against West Indies. Rohit Sharma also confirmed that the team management is keeping an eye on Bumrah's recovery and if everything is going according to the plan. The management is also in touch with the NCA making sure that their premier bowler remains injury free for a longer period now. \"We'll see what has been planned and everything depends on his recovery. We are in constant touch with the NCA and things look positive at the moment,\" the India captain further added. Team India is struggling with injury to key players with World Cup approaching fast. Apart from Bumrah, even the likes of , Shreyas Iyer are injured at the moment. Speaking about the same, Rohit expressed that not much can be done about it and they have to keep backups ready while identifying the players who will play the mega event. \"You need experience when you go into big tournaments. Quite a few players are injured from our team but we try to identify players who are going to play in the World Cup and give them as many matches as possible so that they get the experience. But when there are injuries, you just don't know what you can do about it. Along with focusing on the XI, we need to focus on other 15-20 players too because anyone can get injured,\" Rohit said.","pubDate":"2023-07-27 06:42:42","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"'You got to have thick skin': Australia's skipper Pat Cummins reacts to criticism over his captaincy","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/27/you-got-to-have-thick-skin-australiasskipper-pat-cummins-reacts-to-criticism-over-his-captaincy-2599142.html","keywords":null,"creator":null,"video_url":null,"description":"Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. LONDON: Australia's captain Pat Cummins remains unfazed by criticism over his captaincy following two tight victories at Edgbaston and Lord’s, a defeat at Leeds, and a draw in Manchester. The fifth and final Test will begin at The Oval from Thursday with the hosts in with a chance to level the series. Heading into the fifth and final Ashes Test with a 2-1 series lead and having retained the Ashes, the 30-year-old emphasised the need of having a thick skin to deal with everything. Australia narrowly avoided a loss in Manchester to retain the Ashes and Cummins' tactics were criticised as the tourists played catch-up cricket. It all started with their poor batting performance after losing the toss in ideal batting conditions. \"I honestly haven’t read anything. A few things have come across my desk from the boys having a laugh. I’ve been in this job two years now, and you learn pretty quickly that you’ve got to have a thick skin,\" Sydney Morning Herald quoted Cummins as saying. \"It’s such a great bunch of players and staff here that we all know what everyone is about and how we are going to go about it, and for me, that’s more important than anything else. I’m not going to please everyone and everyone’s got opinions, but they aren’t facts, they’re opinions,\" Cummins added. Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. In the fourth Test, the right-arm pacer similarly struggled with the ball, taking only one wicket and allowing 129 runs in 23 overs. \"I think it does have a shelf life. I won’t put a date on it, I’ve got to get there first. I feel like every Test match I learn quite a bit, you just get exposed to more things with each game. I’m loving working with this team and the staff. Enjoying it at the moment, we’ll see what the future holds. I feel like with each game I’m getting better and I think there’s a fair bit more left in me,\" Cummins said of captaincy. Even though Australia has already retained the urn, captain Cummins insisted that his team is still very eager to win the long-awaited Ashes series in England. \"I don’t think it’s shifted too much over the series, to be honest. I think Edgbaston again, was another moment where there wasn’t a lot in it (the pitch) for the bowlers. They scored almost 400 on day one and I don’t see it as too dissimilar to last week,\" Cummins said. \"I think you’ve got to hold your nerve a little bit sometimes, you’ve got to trust that’s your best percentage to get nicks even if they hit a few cover drives. You’ve got to keep your catchers in, you’ve got to take wickets. I think we’ve been pretty consistent this series,\" he added.","content":"LONDON: Australia's captain Pat Cummins remains unfazed by criticism over his captaincy following two tight victories at Edgbaston and Lord’s, a defeat at Leeds, and a draw in Manchester. The fifth and final Test will begin at The Oval from Thursday with the hosts in with a chance to level the series. Heading into the fifth and final Ashes Test with a 2-1 series lead and having retained the Ashes, the 30-year-old emphasised the need of having a thick skin to deal with everything. Australia narrowly avoided a loss in Manchester to retain the Ashes and Cummins' tactics were criticised as the tourists played catch-up cricket. It all started with their poor batting performance after losing the toss in ideal batting conditions. \"I honestly haven’t read anything. A few things have come across my desk from the boys having a laugh. I’ve been in this job two years now, and you learn pretty quickly that you’ve got to have a thick skin,\" Sydney Morning Herald quoted Cummins as saying. \"It’s such a great bunch of players and staff here that we all know what everyone is about and how we are going to go about it, and for me, that’s more important than anything else. I’m not going to please everyone and everyone’s got opinions, but they aren’t facts, they’re opinions,\" Cummins added. Cummins believes he will step down as captain before retiring as a player, but he has no plans to do so anytime soon. In the fourth Test, the right-arm pacer similarly struggled with the ball, taking only one wicket and allowing 129 runs in 23 overs. \"I think it does have a shelf life. I won’t put a date on it, I’ve got to get there first. I feel like every Test match I learn quite a bit, you just get exposed to more things with each game. I’m loving working with this team and the staff. Enjoying it at the moment, we’ll see what the future holds. I feel like with each game I’m getting better and I think there’s a fair bit more left in me,\" Cummins said of captaincy. Even though Australia has already retained the urn, captain Cummins insisted that his team is still very eager to win the long-awaited Ashes series in England. \"I don’t think it’s shifted too much over the series, to be honest. I think Edgbaston again, was another moment where there wasn’t a lot in it (the pitch) for the bowlers. They scored almost 400 on day one and I don’t see it as too dissimilar to last week,\" Cummins said. \"I think you’ve got to hold your nerve a little bit sometimes, you’ve got to trust that’s your best percentage to get nicks even if they hit a few cover drives. You’ve got to keep your catchers in, you’ve got to take wickets. I think we’ve been pretty consistent this series,\" he added.","pubDate":"2023-07-27 06:37:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: England vs Australia 5th Test - pitch report, weather, playing XI changes - all you need to know","link":"https://www.indiatvnews.com/sports/cricket/ashes-2023-england-vs-australia-5th-test-the-oval-pitch-report-weather-playing-xi-changes-all-you-need-to-know-2023-07-27-883284","keywords":null,"creator":null,"video_url":null,"description":"Cricket's oldest and arguably the greatest rivalry is about to hit its crescendo as the hosts England and Australia are set to lock horns with each other at The Oval in the 5th Test of the ongoing Ashes series on Thursday, July 27. Both teams have played some jaw-dropping cricket throughout the series which has kept the fans hooked and on the edge of their seats.","content":"Cricket's oldest and arguably the greatest rivalry is about to hit its crescendo as the hosts England and Australia are set to lock horns with each other at The Oval in the 5th Test of the ongoing Ashes series on Thursday, July 27. Both teams have played some jaw-dropping cricket throughout the series which has kept the fans hooked and on the edge of their seats. Australia retained the urn after weather had the last laugh at Manchester in the 4th Test and the scoreline of the series now reads 2-1, with plenty to play for in the final game. For the -led Australia, it's an opportunity to be the first Aussie touring party since Steve Waugh's side of 2001 to win the urn on English soil. The amount of question marks raised on the leadership capability of Cummins is eye-popping with former players like Mark Waugh and Ian Chappell criticising the red-ball captain. On the other hand, the Three Lions were tantalisingly close to landing an equalizer at Old Trafford but found themselves on the other side of the weather. The Ben Stokes-led side has scripted a remarkable comeback in the series. After being 2-0 down the hosts made some tactical changes and it paved the way for them to announce their arrival in the series. Though England can't regain the urn anymore, they can certainly win the 5th Test and foil Australia's plans of rewriting history. If Stokes and his men manage to gain control at The Oval, it will certainly go down as a befitting reply to all the naysayers who have questioned the need and feasibility of Bazball. The wicket at The Oval is known as one of the most batting-friendly surfaces in England. The last Test at the venue was the World Test Championship final of the 2021-23 cycle played between Australia and India and the batters hogged the limelight with Travis Head and Steven Smith scoring match-winning tons. Hence, both batters must be itching to make the most of the conditions on offer. The last time both England and Australia played at the venue was during the 2019 series when the -led side won by 135 runs. The Oval has played host to 106 Tests thus far, with the side batting first winning 39 games and teams bowling first claiming the contests on 29 occasions. The average first innings score at the venue is 344, while the same in the second innings is 304. The chances of precipitation on Day 1 and Day 3 are quite high. With 55% and 88% of rainfall predicted on both days as per Accuweather, weather might very well act as a dampener and frustrate fans and players alike. As per the weather forecast, there will be rain around on all five days and hence a thick cloud cover will be expected for the major part of the game and will keep the pacers interested. Zak Crawley, Ben Duckett, , Joe Root, Harry Brook, Ben Stokes (c), (wk), Chris Woakes, Mark Wood, Stuart Broad, James Anderson David Warner, , Marnus Labuschagne, Steven Smith, Travis Head, Mitchell Marsh, (wk), Mitchell Starc/ Michael Neser, Pat Cummins (c), Todd Murphy, Josh Hazlewood","pubDate":"2023-07-27 06:34:28","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"}]}