{"newsArray":[{"title":"Cricket World Cup defying COVID-19 doubts","link":"https://www.perthnow.com.au/sport/cricket/cricket-world-cup-defying-covid-19-doubts-c-6132918","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"While Australia have reigned supreme at the Women's Cricket World Cup, there have been upsets and sparkling cricket as the event defies a COVID-19 outbreak.","content":null,"pubDate":"2022-03-20 01:01:22","full_description":"The Women's Cricket World Cup is belying expectations of a COVID-19 soaked showpiece, with organisers delighted to defy the pandemic. So far, that is. The tournament reached the half-way mark this weekend with a pair of marquee matches at New Zealand's national stadium, Eden Park. On Saturday, Australia produced a World Cup record chase to down India with just three balls remaining, becoming the first side to book a place in the semi-finals. On Sunday the hosts play England in a clash of two unexpectedly struggling sides, a storyline which has added to the tournament drama. But you wouldn't have blamed organisers if they weren't there to see it, driven to drink or walking out on the eve of the event. The ICC postponed the event from 2021 -- when it would have taken place in one of the few coronavirus-free places anywhere in the world. Instead, it's on this month, unfortunately timed in the middle of New Zealand's biggest outbreak of the pandemic. World Cup chief executive Andrea Nelson says her team has not countenanced the counterfactual. \"It's not a path we've gone done,\" she said. \"There's been several moments where things could have gone one of two ways. Best not to dwell.\" Nelson talks of \"staying dynamic\" when a layperson might say \"our plans went out the window\". And quite rightly, given players have waited five years for their chance to be world champions, Nelson's focus is on the cricket. \"The cricket has been extraordinary. The pitches have been amazing. The venues have looked brilliant,\" she told AAP. \"I've been working on this for two-and-a-half years and the product that we're showing on the global stage is just next level. \"Any cricket fan or any sports fan would be finding it hard not to be rapt.\" Still, COVID-19 is leaving a mighty mark on the tournament. No travelling journalists have opted to attend given quarantine requirements, which feels at odds with surging interest in women's sport. Crowds have been severely capped, and local interest is low for matches that don't involve New Zealand or India. It's understandable Kiwis aren't attending in their thousands given the local impact of COVID-19. About three per cent of the country is testing positive each week and public health officials estimate the true spread is much greater. However, just one player -- Australia's Ash Gardner -- has contracted COVID-19 so far, a charmed run which defies belief. Australia coach Matthew Mott said last week he was \"flabbergasted\" no other players had tested positive and Kiwi star Amelia Kerr said she was surprised. \"We've done pretty well to keep COVID out of it,\" she said. \"The way people have gone about their business and living under the strict guidelines and keeping safe (and) to have this tournament go and run pretty smoothly has been awesome.\" Players are no longer being routinely tested, instead are encouraged to get tested if they have symptoms. Organisers have arranged charter flights, hotel exclusivity and outdoor activities to attempt to keep players safe from COVID-19, but ultimately they're relying on teams being sensible. \"The teams are really motivated to get to the finish line,\" Nelson said. \"They're happy to follow the protocols and to keep themselves safe, because they see that is a competitive advantage.\" Naturally, there is disappointment the tournament is being played in this window. Australia's players have spoken of their sadness they can't compete in front of family, friends and travelling fans. The New Zealand government is not opening the border in time for the latter stage of the tournament, though hopes are high it will relax crowd caps. Nelson said the restrictions wouldn't blunt the tournament's legacy. \"We hope that the fans are able to come and enjoy the opportunity to see the world's best athletes here on New Zealand soil (and) interest grows as we get towards the end of the tournament,\" she said. \"I hope that young boys and girls watching it are inspired by these athletes to play sport, to play as a career and see what's possible.\"","image_url":"https://images.perthnow.com.au/publication/C-6132918/3decffba7e7276d565d42bbafe6c12ef8e17e798-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket World Cup defying COVID-19 doubts","link":"https://thewest.com.au/sport/cricket/cricket-world-cup-defying-covid-19-doubts-c-6132915","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"While Australia have reigned supreme at the Women's Cricket World Cup, there have been upsets and sparkling cricket as the event defies a COVID-19 outbreak.","content":null,"pubDate":"2022-03-20 01:01:21","full_description":"The Women's Cricket World Cup is belying expectations of a COVID-19 soaked showpiece, with organisers delighted to defy the pandemic. So far, that is. The tournament reached the half-way mark this weekend with a pair of marquee matches at New Zealand's national stadium, Eden Park. On Saturday, Australia produced a World Cup record chase to down India with just three balls remaining, becoming the first side to book a place in the semi-finals. On Sunday the hosts play England in a clash of two unexpectedly struggling sides, a storyline which has added to the tournament drama. But you wouldn't have blamed organisers if they weren't there to see it, driven to drink or walking out on the eve of the event. The ICC postponed the event from 2021 -- when it would have taken place in one of the few coronavirus-free places anywhere in the world. Instead, it's on this month, unfortunately timed in the middle of New Zealand's biggest outbreak of the pandemic. World Cup chief executive Andrea Nelson says her team has not countenanced the counterfactual. \"It's not a path we've gone done,\" she said. \"There's been several moments where things could have gone one of two ways. Best not to dwell.\" Nelson talks of \"staying dynamic\" when a layperson might say \"our plans went out the window\". And quite rightly, given players have waited five years for their chance to be world champions, Nelson's focus is on the cricket. \"The cricket has been extraordinary. The pitches have been amazing. The venues have looked brilliant,\" she told AAP. \"I've been working on this for two-and-a-half years and the product that we're showing on the global stage is just next level. \"Any cricket fan or any sports fan would be finding it hard not to be rapt.\" Still, COVID-19 is leaving a mighty mark on the tournament. No travelling journalists have opted to attend given quarantine requirements, which feels at odds with surging interest in women's sport. Crowds have been severely capped, and local interest is low for matches that don't involve New Zealand or India. It's understandable Kiwis aren't attending in their thousands given the local impact of COVID-19. About three per cent of the country is testing positive each week and public health officials estimate the true spread is much greater. However, just one player -- Australia's Ash Gardner -- has contracted COVID-19 so far, a charmed run which defies belief. Australia coach Matthew Mott said last week he was \"flabbergasted\" no other players had tested positive and Kiwi star Amelia Kerr said she was surprised. \"We've done pretty well to keep COVID out of it,\" she said. \"The way people have gone about their business and living under the strict guidelines and keeping safe (and) to have this tournament go and run pretty smoothly has been awesome.\" Players are no longer being routinely tested, instead are encouraged to get tested if they have symptoms. Organisers have arranged charter flights, hotel exclusivity and outdoor activities to attempt to keep players safe from COVID-19, but ultimately they're relying on teams being sensible. \"The teams are really motivated to get to the finish line,\" Nelson said. \"They're happy to follow the protocols and to keep themselves safe, because they see that is a competitive advantage.\" Naturally, there is disappointment the tournament is being played in this window. Australia's players have spoken of their sadness they can't compete in front of family, friends and travelling fans. The New Zealand government is not opening the border in time for the latter stage of the tournament, though hopes are high it will relax crowd caps. Nelson said the restrictions wouldn't blunt the tournament's legacy. \"We hope that the fans are able to come and enjoy the opportunity to see the world's best athletes here on New Zealand soil (and) interest grows as we get towards the end of the tournament,\" she said. \"I hope that young boys and girls watching it are inspired by these athletes to play sport, to play as a career and see what's possible.\"","image_url":"https://images.thewest.com.au/publication/C-6132915/3decffba7e7276d565d42bbafe6c12ef8e17e798-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Miandad inducted into PCB Hall of Fame","link":"https://www.thenews.com.pk/print/943102-miandad-inducted-into-pcb-hall-of-fame","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Former captain and batting stalwart Javed Miandad was formally inducted into the PCB Hall of Fame when Pakistan Cricket Board’s Chief Executive Faisal Hasnain presented him with a commemorative cap and plaque.On receiving the honour, Javed Miandad said: “I feel humbled and...","content":null,"pubDate":"2022-03-20 01:00:00","full_description":"LAHORE: Former captain and batting stalwart Javed Miandad was formally inducted into the PCB Hall of Fame when Pakistan Cricket Board’s Chief Executive Faisal Hasnain presented him with a commemorative cap and plaque. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ On receiving the honour, Javed Miandad said: “I feel humbled and honoured to have been inducted into the PCB Hall of Fame. It is appropriate that these inductions are taking place when an international cricketer is at the helm of Pakistan cricket affairs as he understands better than anyone else the hard work and sacrifices a cricketer makes to reach to the top pedestal. “Every time I stepped on to the field of play, I wanted to contribute for my team and country through my performance. To make this happen, I developed my own training and preparation plans using innovative methods visualising the oppositions and conditions I would encounter. I am delighted my efforts produced good results and I was able to serve my team and country with performances that made us a proud cricketing nation. “One thing I did with great success throughout my career was to quickly forget my previous performance and switch focus towards the next challenge. Of course, I took learnings from the previous game into the next match and tried to improve, but I didn’t dwell on what I had achieved in the past matches.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Boards agree to play white-ball games in Lahore","link":"https://www.thenews.com.pk/print/943098-boards-agree-to-play-white-ball-games-in-lahore","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: All the paper work and plans have been finalised to host the white ball series in Lahore after the cricket boards of Pakistan and Australia mutually agreed to shift matches from Rawalpindi.The PCB was asked by the federal government yesterday to hold the matches in Lahore and the decision...","content":null,"pubDate":"2022-03-20 01:00:00","full_description":"LAHORE: All the paper work and plans have been finalised to host the white ball series in Lahore after the cricket boards of Pakistan and Australia mutually agreed to shift matches from Rawalpindi. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The PCB was asked by the federal government yesterday to hold the matches in Lahore and the decision was made on Saturday morning following discussions between the two boards. A PCB official later informed that the headquarters of Pakistan cricket will host the 29 March, 31 March and 2 April One-day Internationals as well as the one-off Twenty20 International on 5 April at the back of the third Test, which commences on 21 March. The 50-over matches will start at 1500 local time, while the first ball in the 20-over match will be bowled at 2030 local time. Australia’s white-ball players, as originally planned, will arrive in Lahore on 24 March and after one-day room isolation, will integrate with other members of their side. Pakistan’s white-ball players are scheduled to assemble on 22 March and will resume training on 25 March.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pindi cricket fans lash out at politicians","link":"https://www.thenews.com.pk/print/943100-pindi-cricket-fans-lash-out-at-politicians","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Rawalpindi-Islamabad cricket fans are furious over the shifting of the Pakistan-Australia white-ball cricket series from Pindi Stadium to Lahore, cursing politicians for spoiling a rare opportunity coming their way to watch the two giants of the game in action in what was expected to be...","content":null,"pubDate":"2022-03-20 01:00:00","full_description":"ISLAMABAD: Rawalpindi-Islamabad cricket fans are furious over the shifting of the Pakistan-Australia white-ball cricket series from Pindi Stadium to Lahore, cursing politicians for spoiling a rare opportunity coming their way to watch the two giants of the game in action in what was expected to be a thrilling exhibition. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ All were unanimous in blaming politicians from either side, (government and opposition) forcing the Pakistan Cricket Board (PCB) and Cricket Australia (CA) to shift three One-day Internationals and one T20 international to Lahore. “I deliberately skipped the first Test at the Pindi Stadium, knowing well that the venue will host four limited-overs matches. When Pakistan is playing a team like Australia at home, you cannot expect a better setting. I even had applied for a week of holidays planning to watch back-to-back one-dayers on March 29 and March 31 at the Pindi Stadium. To know that these matches have now been shifted to Lahore has come as a shock to my fun days. No one but these politicians should be blamed for this whole mess. Look, I only had saved the money for match tickets and have got no extra amount to travel to Lahore, stay at the hotel and watch matches. My kids like the majority of others in Pakistan are fond of the game but going all the way to Lahore and to spend an extra amount is not possible,” Ahsan Arshad, a Bank official said. Mushtaq Shah, a university-going student was also upset and even declared that he would not vote for any politician in coming General Election. “I think they have absolutely no value for masses. Watching best of cricket is the only fun time we have. Nizakat Abbasi, an employee of a multinational company also planned big for the occasion. “ I never have watched any of the limited-overs match at the Stadium. All I wanted was to see a one-off T20 match at the Pindi Stadium. When I learned the match along with the ODIs have been shifted to Lahore I got really upset.”","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Cricket great’s memorial service at the MCG to be broadcast live at WA’s Optus Stadium","link":"https://www.perthnow.com.au/sport/cricket/shane-warne-cricket-greats-memorial-service-at-the-mcg-to-be-broadcast-live-at-was-optus-stadium--c-6132528","keywords":null,"creator":["Joe Spagnolo"],"video_url":null,"description":"Shane Warne’s memorial service will be broadcast live at Optus Stadium, giving West Australians the chance to farewell the Australian cricket legend.","content":null,"pubDate":"2022-03-20 00:29:14","full_description":"Shane Warne’s memorial service at the MCG will be broadcast live at Optus Stadium, giving West Australians the chance to pay their respects to the Australian icon. The WA Government’s announcement of the Optus event comes as Warne’s family lay him to rest at a private funeral today. The MCG public commemoration on March 30 is expected to be a star studded event attracting as many as 50,000 people, with the who’s who of Australian cricket and entertainment expected to attend. Warne’s former fiance Liz Hurley is expected to fly from the UK for the event. The 52-year-old spin king tragically died of a heart attack on March 4 while holidaying in Thailand. He was staying at a private villa with three friends, including one who performed CPR after finding him unresponsive when he did not show up for dinner. Although the event at Optus Stadium is free, people would be required to register for a free ticket to go to the event. Shane Warne’s death shocked the nation. In a beautiful moment, Warne’s son Jackson and daughter Brooke walked out to the middle of Marvel stadium and tossed the coin for the St Kilda clash with Collingwood on Friday night. Shane Warne was a lifelong Saints fan and played junior football for the club. WA Sport and Recreation Minister David Templeman said further details around timing to be made available at optusstadium.com.au soon. “Shane Warne was one of a kind, a cricketing legend and someone many Australians felt a connection with,” Mr Templeman said. “The McGowan Government is pleased to have facilitated this fitting tribute to the King of Spin, who was known for his unique personality as much as his sporting prowess. “He was just a wonderful player to watch and a great Australian character. “I know Western Australian cricket fans have nothing but fond memories of the many summers Shane Warne spent plying his trade at the WACA Ground.” Transperth train services will stop at Stadium Station before the event, with arrangements to be confirmed when the timings are released.","image_url":"https://images.perthnow.com.au/publication/C-6132528/7a4759aac8aee6576b9ff9a550bb590a67e8dd8b-16x9-x0y210w3000h1687.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne's funeral: Son Jackson steps up and supports family ahead of private Melbourne service - Daily Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvbmV3cy9hcnRpY2xlLTEwNjMxNjUzL1NoYW5lLVdhcm5lcy1mdW5lcmFsLVNvbi1KYWNrc29uLXN0ZXBzLXN1cHBvcnRzLWZhbWlseS1haGVhZC1wcml2YXRlLU1lbGJvdXJuZS1zZXJ2aWNlLmh0bWzSAZEBaHR0cHM6Ly93d3cuZGFpbHltYWlsLmNvLnVrL25ld3MvYXJ0aWNsZS0xMDYzMTY1My9hbXAvU2hhbmUtV2FybmVzLWZ1bmVyYWwtU29uLUphY2tzb24tc3RlcHMtc3VwcG9ydHMtZmFtaWx5LWFoZWFkLXByaXZhdGUtTWVsYm91cm5lLXNlcnZpY2UuaHRtbA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne's funeral: Son Jackson steps up and supports family ahead of private Melbourne service  Daily MailHeartbroken guests arrive for Warne funeral  news.com.auWarne family bids legend farewell  7NEWSFamily and friends arrive at Shane Warne’s private funeral  Sydney Morning HeraldShane Warne: Cricket great’s memorial service at the MCG to be broadcast live at WA’s Optus Stadium  PerthNowView Full coverage on Google News","content":null,"pubDate":"2022-03-19 23:47:45","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"NZ-W vs ENG-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NZ-W vs ENG-W ODI World Cup Match at Eden Park, Auckland at 03:30 am IST on March 20","link":"https://zeenews.india.com/cricket/nz-w-vs-eng-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nz-w-vs-eng-w-odi-world-cup-match-at-eden-park-auckland-at-0330-am-ist-on-march-20-2446504.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Women vs England Women Dream11 Team Prediction New Zealand Women vs England Women ICC Women's World Cup ODI- Check My Dream11 Team, Best players list of NZ-W vs ENG-W, New Zealand Women Dream11 Team Player List, England women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-03-19 20:30:00","full_description":"Defending champions England women will take on hosts New Zealand women on Sunday (March 20) in Match No 19 of the 2022 ICC Women’s Cricket World Cup. The contest between the two formidable rivals will be played at the Eden Park in Auckland will begin at 03:30 am (IST). NZ-W vs ENG-W Match Details The match between NZ-W vs ENG-W will be hosted at the Eden Park, Auckland at 03:30 am IST on March 20, Sunday. NZ-W vs ENG-W Dream11 Team Prediction Captain – Sophie Devine Vice-Captain – Natalie Sciver Suggested Playing 11 for NZ-W vs ENG-W Dream11 Fantasy Cricket: Wicketkeeper: Katey Martin Batters: Tammy Beaumont, Amy Satterthwaite, Heather Knight All-rounders: Natalie Sciver, Sophie Devine, Amelia Kerr, Lea Tahuhu Bowlers: Sophie Ecclestone, Anya Shrubsole, Jess Kerr New Zealand Women vs England Women probable XI: New Zealand Women Probable XI: Suzie Bates, Sophie Devine (c), Amelia Kerr, Amy Satterthwaite, Maddy Green, Frances Mackay, Katey Martin (wk), Brooke Halliday, Lea Tahuhu, Jess Kerr, Hannah Rowe England Women Probable XI: Danielle Wyatt, Tammy Beaumont, Heather Knight (c), Natalie Sciver, Amy Ellen Jones (wk), Sophia Dunkley, Katherine Brunt, Sophie Ecclestone, Kate Cross, Charlotte Dean, Anya Shrubsole","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ-W vs EN-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Women’s World Cup, Match 19","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nz-w-vs-en-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-women-s-world-cup-match-19?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-19 19:19:37","full_description":"New Zealand Women (NZ-W) will take on England Women (EN-W) in the 19th match of the Women’s World Cup at the Bay Oval in Mount Maunganui on Sunday. Hosts New Zealand have had a topsy-turvy World Cup campaign. They’ve won two matches but have lost thrice. They won two games on the trot before losing consecutive outings against Australia and South Africa. The White Ferns are fifth in the points table with four points. England, meanwhile, ended their streak of three successive losses with a massive win over India in their most recent game. They won by four wickets, thanks to a wonderful performance from their bowlers. England are sixth in the points table, just behind New Zealand, with two points. Suzie Bates, Sophie Devine(c), Amelia Kerr, Amy Satterthwaite, Maddy Green, Frances Mackay, Katey Martin (wk), Brooke Halliday, Lea Tahuhu, Jess Kerr, Hannah Rowe. Danielle Wyatt, Tammy Beaumont, Heather Knight(c), Natalie Sciver, Amy Ellen Jones (wk), Sophia Dunkley, Katherine Brunt, Sophie Ecclestone, Kate Cross, Charlotte Dean, Anya Shrubsole. Match: NZ-W vs EN-W, Women’s World Cup, Match 19. Date and Time: March 19, 2022; 3:30 AM IST. Venue: Bay Oval, Mount Maunganui. The track is expected to be a sporting one. Both teams should enjoy playing in these conditions. Katey Martin has done a decent job with the bat in her last three games. That makes her the best choice for the wicketkeeper slot in your Dream11 fantasy team for this game. Tammy Beaumont has been outstanding for England, scoring 183 runs in four games at an average of 45. Amelia Kerr is an awesome all-rounder who has been playing at a very high level in this competition. She has scored 152 runs and has also picked up eight wickets. She could be a splendid multiplier choice in your NZ-W vs EN-W Dream11 fantasy team. Meanwhile, Sophie Devine has been in wonderful form in the ongoing World Cup, having already scored a century. The New Zealand captain has scored 256 runs and has also picked up a wicket. Sophie Ecclestone has been the leader of the English bowling unit, picking up five wickets in four games. Amelia Kerr (NZ-W) – 470 points Sophie Devine (NZ-W) – 386 points Nat Sciver (EN-W) – 356 points Lea Tahuhu (NZ-W) – 315 points Amy Satterthwaite (NZ-W) – 279 points. Amelia Kerr: 152 runs and 8 wickets Sophie Devine: 256 runs and 1 wicket Nat Sciver: 172 runs and 2 wickets Lea Tahuhu: 9 wickets Sophie Ecclestone: 5 wickets. Fantasy Suggestion #1: Katey Martin, Amy Satterthwaite, Tammy Beaumont, Danni Wyatt, Amelia Kerr, Sophie Devine, Nat Sciver, Lea Tahuhu, Sophie Ecclestone, Frances Mackay, Anya Shrubsole. Captain: Amelia Kerr. Vice-Captain: Nat Sciver. Fantasy Suggestion #2: Katey Martin, Amy Jones, Amy Satterthwaite, Tammy Beaumont, Heather Knight, Amelia Kerr, Sophie Devine, Lea Tahuhu, Sophie Ecclestone, Charlie Dean, Anya Shrubsole. Captain: Sophie Devine. Vice-Captain: Sophie Ecclestone.","image_url":"https://static.sportskeeda.com/editor/2022/03/79712-16477153488065-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"ND vs AA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Plunket Shield 2021-22, Match 16","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nd-vs-aa-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-plunket-shield-2021-22-match-16?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-19 19:19:37","full_description":"Northern Districts (ND) will take on Auckland Aces (AA) in the 16th match of the Plunket Shield 2021-22 at the Cobham Oval in Whangarei on Sunday. Northern Districts are second in the points table, having won three of their five games thus far. They will have to punch above their weight to get a result against table-toppers Auckland Aces, though. Auckland have won all four of their games and will look to continue their winning momentum against Northern Districts. Jeet Raval, Henry Cooper, Bharat Popli, Joe Carter(c), Peter Bocock(w), Colin de Grandhomme, Brett Hampton, Ish Sodhi, Brett Randell, Joe Walker, Neil Wagner. George Worker, Sean Solia, Martin Guptill, Mark Chapman, Robert ODonnell(c), Ben Horne(w), Kyle Jamieson, William Somerville, Olly Pringle, Louis Delport, Ben Lister. Match: ND vs AA, Plunket Shield 2021-22, Match 16. Date and Time: March 20-23, 2022; 3:00 AM IST. Venue: Cobham Oval, Whangarei. Going by previous games, the track seems to be conducive to batters. Bowlers could find some movement in the first few days, while spinners could be handy in the final few days of the game. Peter Bocock is a decent choice for the wicketkeeper role. He will hope for a strong performance in this game. Jeet Raval hasn’t been at his best, but he is a top performer who is quite consistent. He has scored 279 runs in five games so far this season. Meanwhile, Martin Guptill has plenty of experience and has been in great form for his team. He has amassed 325 runs in two games and will look for another impactful performance. Sean Solia has done a decent job as an all-rounder thus far. He has scored 88 runs and has also collected two wickets. Brett Randell has done a terrific job with the ball and is the highest wicket-taker this season. He has scalped 29 wickets in five games at an average of 14.4. Martin Guptill (AA) Jeet Raval (ND) Sean Solia (AA) Brett Randell (ND) Colin de Grandhomme (ND). Martin Guptill: 325 runs Jeet Raval: 279 runs Sean Solia: 88 runs and 2 wickets Brett Randell: 29 wickets. Fantasy Suggestion #1: Peter Bocock, Jeet Raval, Mark Chapman, Martin Guptill, George Worker, Colin de Grandhomme, Sean Solia, Brett Hampton, Brett Randell, Neil Wagner, Kyle Jamieson. Captain: Brett Randell. Vice-Captain: Martin Guptill. Fantasy Suggestion #2: Peter Bocock, Jeet Raval, Mark Chapman, Martin Guptill, George Worker, Colin de Grandhomme, Sean Solia, Will Somerville, Brett Randell, Neil Wagner, Kyle Jamieson. Captain: Jeet Raval. Vice-Captain: Colin de Grandhomme.","image_url":"https://static.sportskeeda.com/editor/2022/03/4e944-16477135620857-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“I’ll go a bit crazy I feel”: Shreyas Iyer expresses excitement on prospect of meeting KKR co-owner Shah Rukh Khan ahead of IPL 2022","link":"https://thesportsrush.com/cricket-news-ill-go-a-bit-crazy-i-feel-shreyas-iyer-expresses-excitement-on-prospect-of-meeting-kkr-co-owner-shah-rukh-khan-ahead-of-ipl-2022/","keywords":["Cricket","IPL 2022","KKR","shah rukh khan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shreyas Iyer expresses excitement to meet the co-owner of Kolkata Knight Riders Shah Rukh Khan ahead of 15th season of the IPL. The ten teams are up and running with their preparations for the imminent 15th season of the Indian Premier League (IPL), which is due to commence just a week later on March 26… The post “I’ll go a bit crazy I feel”: Shreyas Iyer expresses excitement on prospect of meeting KKR co-owner Shah Rukh Khan ahead of IPL 2022 appeared first on The SportsRush.","content":"Shreyas Iyer expresses excitement to meet the co-owner of Kolkata Knight Riders Shah Rukh Khan ahead of 15th season of the IPL. The ten teams are up and running with their preparations for the imminent 15th season of the Indian Premier League (IPL), which is due to commence just a week later on March 26 at the iconic Wankhede Stadium in Mumbai. As far as the previous season runner-up Kolkata Knight Riders (KKR) are concerned, the franchise were handed a decent enough blow after their possible opener batter Alex Hales, opted to mark his unavailability for the season. Although Australia’s limited Overs skipper Aaron Finch has been added to the squad as his replacement, he would only join the same by the first week of April. However, their newly appointed skipper for the new season, Shreyas Iyer has displayed a purple patch of form off late across formats for the Indian Cricket team, which is perhaps what matters to the KKR fans the most before their action kicks-off against Chennai Super Kings (CSK) as the tournament opener game. Having said that, the 27-year-old’s another earnest wish would soon come to fruition when he’ll meet his franchise’s co-owner and Bollywood’s very own superstar Shah Rukh Khan. tain @ShreyasIyer15 #KKR #KKRHaiTaiyaar #GalaxyOfKnights #IPL2022 pic.twitter.com/a7VGm3CqLG — KolkataKnightRiders (@KKRiders) March 19, 2022 Shreyas Iyer expresses excitement to meet Shah Rukh Khan Iyer, who was roped in by KKR at INR 12.25 Crore during the auction last month, is quite eager and ‘counting on the time’ to meet Bollywood star actor Shah Rukh Khan. Terming him as one of his motivating factors, the Mumbai batter remarked that he has always been in awe of the ‘spark’ that Khan brings to the Bollywood industry, and that he’s likely to go crazy the moment he would get the opportunity to meet him. “I haven’t interacted with (Shah Rukh Khan). I am really looking forward to that moment because he has always been one of the motivating factors to me especially. Because whenever I get a break or (during) free time I love to see his interviews and I love to see the spark which he brings to the industry. And also whenever he is there present at the stadium, the support that he offers to the team is simply outstanding to see it from outside. Yeah, I am really eager and just waiting, counting on the time…whenever I’ll get that opportunity to meet him, I’ll go a bit crazy I feel,” exclaimed Iyer. Shrayas Iyer was awarded ‘Player of the series’ during the recently concluded T20I series against Sri Lanka, where he smashed three consecutive half-centuries, while managing to remain unbeaten in all of those matches. ALSO READ: Shreyas Iyer reminisces feeling nervous during IPL 2022 auction The post “I’ll go a bit crazy I feel”: Shreyas Iyer expresses excitement on prospect of meeting KKR co-owner Shah Rukh Khan ahead of IPL 2022 appeared first on The SportsRush.","pubDate":"2022-03-19 18:56:42","full_description":"Shreyas Iyer expresses excitement to meet the co-owner of Kolkata Knight Riders Shah Rukh Khan ahead of 15th season of the IPL. The ten teams are up and running with their preparations for the imminent 15th season of the Indian Premier League (IPL), which is due to commence just a week later on March 26 at the iconic Wankhede Stadium in Mumbai. As far as the previous season runner-up Kolkata Knight Riders (KKR) are concerned, the franchise were handed a decent enough blow after their possible opener batter Alex Hales, opted to mark his unavailability for the season. Although Australia’s limited Overs skipper Aaron Finch has been added to the squad as his replacement, he would only join the same by the first week of April . However, their newly appointed skipper for the new season, Shreyas Iyer has displayed a purple patch of form off late across formats for the Indian Cricket team, which is perhaps what matters to the KKR fans the most before their action kicks-off against Chennai Super Kings (CSK) as the tournament opener game. Having said that, the 27-year-old’s another earnest wish would soon come to fruition when he’ll meet his franchise’s co-owner and Bollywood’s very own superstar Shah Rukh Khan. tain @ShreyasIyer15 #KKR #KKRHaiTaiyaar #GalaxyOfKnights #IPL2022 pic.twitter.com/a7VGm3CqLG — KolkataKnightRiders (@KKRiders) March 19, 2022 Iyer, who was roped in by KKR at INR 12.25 Crore during the auction last month, is quite eager and ‘counting on the time’ to meet Bollywood star actor Shah Rukh Khan. Terming him as one of his motivating factors, the Mumbai batter remarked that he has always been in awe of the ‘spark’ that Khan brings to the Bollywood industry, and that he’s likely to go crazy the moment he would get the opportunity to meet him. “I haven’t interacted with (Shah Rukh Khan). I am really looking forward to that moment because he has always been one of the motivating factors to me especially. Because whenever I get a break or (during) free time I love to see his interviews and I love to see the spark which he brings to the industry. And also whenever he is there present at the stadium, the support that he offers to the team is simply outstanding to see it from outside. Yeah, I am really eager and just waiting, counting on the time…whenever I’ll get that opportunity to meet him, I’ll go a bit crazy I feel,” exclaimed Iyer. Shrayas Iyer was awarded ‘Player of the series’ during the recently concluded T20I series against Sri Lanka, where he smashed three consecutive half-centuries , while managing to remain unbeaten in all of those matches. ALSO READ : Shreyas Iyer reminisces feeling nervous during IPL 2022 auction","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ICC Women's WC, New Zealand vs England: Live Cricket Score, Live Updates","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-new-zealand-vs-england-live-cricket-score-live-updates-eden-park-auckland-2831982","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's Cricket World Cup Live, NZ-W vs ENG-W: New Zealand face England in their upcoming league stage fixture on Sunday, in Auckland.","content":null,"pubDate":"2022-03-19 18:41:49","full_description":"New Zealand face England in their upcoming ICC Women's Cricket World Cup league stage fixture at the Eden Park in Auckland. Captained by Heather Knight, England have lost their first three matches and then defeated India in their fourth fixture. England are also currently sixth in the table with two points. Meanwhile, New Zealand are fifth in the table with four points from five games. They lost their previous match to South Africa. ( Live Scoreboard ) New Zealand Women versus England Women - It's a virtual knockout! These two teams have experienced an inconsistent run in this edition and have arrived at a point where they have to either perform or perish! No middle way here. Bangladesh Women nearly did a favour on them last Friday and had they upset West Indies Women, the table would have been more generous to the current champions and the host nation. Currently, out of the four most desired spots on the table, two appear to be almost sealed and it's a fight for the remaining two with West Indies having a slender advantage. So, who holds the aces for this match? On one hand, you've England Women, battered and bruised after their first three close losses but a thumping win over India Women has brought a new lease of life to their campaign. On another hand, there's New Zealand Women, treading on thin ice after consecutive losses and that has put their title ambitions in serious jeopardy. One victory and all the issues related to catching, ground fielding, insipid batting and inconsistent bowling seemed to have evaporated for England. There was never a doubt on their quality and it was more about the execution of the skills on the field. Heather Knight trusted her girls and they have finally delivered. Onward and upward will be on their agenda now. The White Ferns are grappling with a tough situation related to their batting. It was a collapse of epic proportions for them against South Africa Women, losing the last 6 wickets for just 30 runs, and they're becoming habitual offenders now. Something similar happened during the recently concluded bilateral series against India Women as well and they will have to address this problem if they want to keep dreaming about lifting the World Cup trophy in front of their home fans. The way they fought with the ball in the last match was a big positive and Sophie Devine would wish for a complete team effort in this do-or-die game. Rain could be a factor in this match as the forecast is not too promising and that's another situation to counter for these two teams battling for survival. It's too risky to predict a winner here but one thing that's safe to predict is a crackerjack of a contest.","image_url":"https://c.ndtvimg.com/2022-03/78r2rcd8_devine-afp_625x300_20_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Conspiracy from the word go’: When Australia tried to quit Pakistan","link":"https://www.smh.com.au/sport/cricket/conspiracy-from-the-word-go-when-australia-tried-to-quit-pakistan-20220319-p5a63g.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"In the aftermath of a draw in Karachi, the composure of Pat Cummins’ team reflected a resilient attitude. It also underlined how far Australian cricket has come since one of the ugliest episodes in the history of the side.","content":null,"pubDate":"2022-03-19 18:00:00","full_description":"In the aftermath of a frustrating draw in Karachi, the composure of Pat Cummins’ team reflected a resilient attitude. It also underlined how far Australian cricket has come since one of the ugliest episodes in the history of the side. Thirty-four years ago, also in Karachi, an Australian team voted to fly home early in the face of what they and the team’s management saw as a “conspiracy” of dusty pitches and home umpires to ensure they could not win. Oppressive heat and humidity did not help matters: this was a tour Imran Khan declined to play in on the basis it was the wrong time of the year. Australian thwarted by Pakistan in Karachi this week. In 1988 the scene was far uglier. Credit: AP From the moment the off spinner Tim May was denied three lbw appeals against Javed Miandad on day one of the series - the first two marginal, the third rather less so - the Australians felt they had been set up to fail. By the third day, after Javed had made 211 and as the tourists’ first innings collapsed , the game was almost totally overshadowed by the Australian reaction. Extraordinarily their response was led by the team manager and Australian Cricket Board director Colin Egar, who fronted the PCB secretary Arif Abbasi, and also Tahir Memon, head of Wills, the principle sponsor of the series. Then, Egar went to the umpires’ room to berate the officials Mahboob Shah and Khizer Hayat. Next, Egar and the coach Bob Simpson called a teatime press conference for the Australian travelling media to make their feelings known. As Egar recalled in 2007: “I called them cheats. I put it right to their board and their chief sponsor, Wills. Well, they weren’t gonna do anything, so I went to the umpires’ room and lined ’em up. Then I spoke to our press and said: ‘If you wanna know what’s going on, I’ll tell ya.’” At the end of the match, lost by an innings early on the fifth day, Border joined the fracas. “This was a conspiracy from the word go. We are not going to be allowed to win,” he said. “The feeling that we were never in the game right from the word go is what really irks the players. We weren’t even given a chance and that is most depressing.” The following day at the team hotel, Egar, Simpson and Border permitted a vote among the players about whether the tour should continue. All but two players, a young Tony Dodemaide and Jamie Siddons, voted to leave immediately. That they did not was largely a product of a few cooler heads, including that of the ACB chairman Malcolm Gray, back home in Australia. “All the guys were really upset,” Dodemaide, now a national selector, tells The Age and Sydney Morning Herald . “By the end of the Test there was definitely a vote taken that a stand would be taken. I certainly didn’t vote for it, and I can recall speaking to Simmo afterwards, and you don’t want to be seen as a pariah with the rest of your teammates.” “I said to Simmo, ‘I can see where things need to change, but I don’t want to throw away the tour.’ We were young players as well and just wanted to play. More so on reflection you think, wow, that was a really significant moment.” As he went on, Dodemaide would captain Victoria, become the chief executive of two state associations, and now join the selection panel. From that vantage point, he appreciates that they were never going home. ”With the advent of those extra experiences, I certainly look back now ... that the team sits around in the captain’s room and takes a vote to go home - there was no way it was going to happen,” he says. “I think in a way everyone knew that at the time, but wanted to make a statement. We genuinely felt that it wasn’t in the spirit of the way cricket should be played.” Gray, who had impressed upon the touring party the need for a calm approach after a widely publicised fight between the England captain Mike Gatting and the umpire Shakoor Rana on the previous Pakistan tour, sought counsel beyond that of Egar and Simpson. He went to Mike Coward, then the secretary of the Australian Cricket Media Association, for an independent reading of events. Allan Border, seen here during the home summer following the 1988 Pakistan trip. Credit: Getty Images “There certainly was contact - I think he sensed from our reports that the divisions were pretty strong, and we were polarised, and confidentially he sought another view,” Coward says. “The belligerence and arrogance was breathtaking. It was a diplomatic disaster. ”It wasn’t so much that the umpiring was good, bad or indifferent. It was more that the Australians completely lost it, a collective loss of responsibility, care, and an absolute insult to Dodemaide and [Bruce] Reid, who were absolutely outstanding. Across the 1980, 1982 and 1988 tours, 45 catches were dropped in nine Tests. Some would argue about the light or catching so close, but I would say it had a hell of a lot more to do with state of mind in Pakistan.” As Gray said in Inside Story : “I’d gotten to know Mike and respected him, so I got hold of him and asked if he could take off his journalist’s hat for a bit and talk to me, and tell me what is going on. And he told, basically the opposite of what I was hearing back through Dave [Richards, ACB CEO] from Egar and Simpson - how they’d gone down into the room and fronted the umpires, and what a disgrace it was.” Mahboob Shah, the umpire responsible for most of the decisions that the Australians took exception to, spoke to Coward for his groundbreaking book Cricket Beyond The Bazaar : “I am sure there is a general view that with a coloured umpire it is often a question of integrity; with a white-skinned man the same mistake is called human error. I’ve never received anything like this criticism on the cricket field or otherwise. I thought I was good friends with Mr Egar until the first Test match started.” Events were deemed so dramatic that a 60 Minutes crew, with reporter Mike Munro, was sent to Pakistan to follow up the story. Told he would get no access to the team, Munro interrupted a press conference with the touring media for grabs from Border and Simpson, while also confronting Egar during training sessions. Meanwhile, Javed gave the crew his view of events. From the archive: Mike Munro pictured reporting for 60 Minutes. “Always been poor losers, the Australians,” he said, smiling. “I know in the past, they’ve always been bad losers. I was very upset and sad the way they behaved in the first Test match.” Gradually, the Australian response de-escalated. A team statement was released, with the tour continuing initially “under protest”, before that position was also retracted. The PCB re-appointed Shah for the second Test. In Faisalabad and Lahore, Border’s men performed far better, and got within a couple of wickets of squaring the series on its final day. Dodemaide sees it as a moment in time that ultimately helped the team’s growth. “Steve Waugh’s reflection on that was it really steeled him for a lot of the back end of his career,” he says. “Particularly going back to Asia and the sort of mindset and approach you needed to have to win over there. It certainly laid some foundations for a pretty resilient team.” For Coward, the attitude change was also evident, but he remains adamant that the 1988 tantrums had been unnecessary. “In the end, Border, Steve Waugh and Mark Taylor were the ones who pulled Australia out of that mentality,” he says. “But at the time Border was just as guilty. They were completely in the wrong frame of mind from the time it started. And management has to be culpable - this is only days after Gray made it patently clear they carried enormous responsibility because of the circumstances, the sensitivity.“ Three decades on, if there is rather more worldliness about Australia’s first tour of Pakistan since 1998, there is also more security and fewer opportunities for exploration. Dodemaide’s salient memory is not so much of cricket, but of fishing in Karachi Harbour. Tony Dodemaide, on his Test debut, dismisses Martin Crowe at the MCG in 1987. Credit: Wayne Ludbey “We had a day in Karachi with four or five of us, Steve Waugh, Tim May, Peter Sleep and Peter Taylor,” he recalls. “I’d been given a card for a captain Jack in Karachi harbour, to go down there and go out fishing crabs for the day. “We took off in a taxi, went out in a rickety old boat on the harbour, catching and cooking crabs. No mobile phones, no security at all. It seems mind-blowing now that’s what five Australian cricketers were able to do. That’s the beauty of touring at that time, you had experiences as a young bloke that I treasure.” The takeaways from the trip were significant. Undoubtedly, an international move towards neutral umpires was given momentum, stripping back Australia’s opposition to the concept. But equally, there was a sense of looking the other way for a tour not televised into Australia. The dramas certainly did not hurt Egar - he replaced Gray as ACB chairman the following year. When Pakistan faced similar hurdles with home umpires in Australia in 1989-90, their response was, by comparison, the epitome of good manners. As John Woodcock wrote in The Times : “Mercifully, Imran is not threatening to take his side home as Border wanted to do from Pakistan when Australia were there last. What is incompetence or inexperience in Melbourne can, I suppose, be something else in Faisalabad.”","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Conspiracy from the word go’: When Australia tried to quit Pakistan","link":"https://www.theage.com.au/sport/cricket/conspiracy-from-the-word-go-when-australia-tried-to-quit-pakistan-20220319-p5a63g.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"In the aftermath of a draw in Karachi, the composure of Pat Cummins’ team reflected a resilient attitude. It also underlined how far Australian cricket has come since one of the ugliest episodes in the history of the side.","content":null,"pubDate":"2022-03-19 18:00:00","full_description":"In the aftermath of a frustrating draw in Karachi, the composure of Pat Cummins’ team reflected a resilient attitude. It also underlined how far Australian cricket has come since one of the ugliest episodes in the history of the side. Thirty-four years ago, also in Karachi, an Australian team voted to fly home early in the face of what they and the team’s management saw as a “conspiracy” of dusty pitches and home umpires to ensure they could not win. Oppressive heat and humidity did not help matters: this was a tour Imran Khan declined to play in on the basis it was the wrong time of the year. Australian thwarted by Pakistan in Karachi this week. In 1988 the scene was far uglier. Credit: AP From the moment the off spinner Tim May was denied three lbw appeals against Javed Miandad on day one of the series - the first two marginal, the third rather less so - the Australians felt they had been set up to fail. By the third day, after Javed had made 211 and as the tourists’ first innings collapsed , the game was almost totally overshadowed by the Australian reaction. Extraordinarily their response was led by the team manager and Australian Cricket Board director Colin Egar, who fronted the PCB secretary Arif Abbasi, and also Tahir Memon, head of Wills, the principle sponsor of the series. Then, Egar went to the umpires’ room to berate the officials Mahboob Shah and Khizer Hayat. Next, Egar and the coach Bob Simpson called a teatime press conference for the Australian travelling media to make their feelings known. As Egar recalled in 2007: “I called them cheats. I put it right to their board and their chief sponsor, Wills. Well, they weren’t gonna do anything, so I went to the umpires’ room and lined ’em up. Then I spoke to our press and said: ‘If you wanna know what’s going on, I’ll tell ya.’” At the end of the match, lost by an innings early on the fifth day, Border joined the fracas. “This was a conspiracy from the word go. We are not going to be allowed to win,” he said. “The feeling that we were never in the game right from the word go is what really irks the players. We weren’t even given a chance and that is most depressing.” The following day at the team hotel, Egar, Simpson and Border permitted a vote among the players about whether the tour should continue. All but two players, a young Tony Dodemaide and Jamie Siddons, voted to leave immediately. That they did not was largely a product of a few cooler heads, including that of the ACB chairman Malcolm Gray, back home in Australia. “All the guys were really upset,” Dodemaide, now a national selector, tells The Age and Sydney Morning Herald . “By the end of the Test there was definitely a vote taken that a stand would be taken. I certainly didn’t vote for it, and I can recall speaking to Simmo afterwards, and you don’t want to be seen as a pariah with the rest of your teammates.” “I said to Simmo, ‘I can see where things need to change, but I don’t want to throw away the tour.’ We were young players as well and just wanted to play. More so on reflection you think, wow, that was a really significant moment.” As he went on, Dodemaide would captain Victoria, become the chief executive of two state associations, and now join the selection panel. From that vantage point, he appreciates that they were never going home. ”With the advent of those extra experiences, I certainly look back now ... that the team sits around in the captain’s room and takes a vote to go home - there was no way it was going to happen,” he says. “I think in a way everyone knew that at the time, but wanted to make a statement. We genuinely felt that it wasn’t in the spirit of the way cricket should be played.” Gray, who had impressed upon the touring party the need for a calm approach after a widely publicised fight between the England captain Mike Gatting and the umpire Shakoor Rana on the previous Pakistan tour, sought counsel beyond that of Egar and Simpson. He went to Mike Coward, then the secretary of the Australian Cricket Media Association, for an independent reading of events. Allan Border, seen here during the home summer following the 1988 Pakistan trip. Credit: Getty Images “There certainly was contact - I think he sensed from our reports that the divisions were pretty strong, and we were polarised, and confidentially he sought another view,” Coward says. “The belligerence and arrogance was breathtaking. It was a diplomatic disaster. ”It wasn’t so much that the umpiring was good, bad or indifferent. It was more that the Australians completely lost it, a collective loss of responsibility, care, and an absolute insult to Dodemaide and [Bruce] Reid, who were absolutely outstanding. Across the 1980, 1982 and 1988 tours, 45 catches were dropped in nine Tests. Some would argue about the light or catching so close, but I would say it had a hell of a lot more to do with state of mind in Pakistan.” As Gray said in Inside Story : “I’d gotten to know Mike and respected him, so I got hold of him and asked if he could take off his journalist’s hat for a bit and talk to me, and tell me what is going on. And he told, basically the opposite of what I was hearing back through Dave [Richards, ACB CEO] from Egar and Simpson - how they’d gone down into the room and fronted the umpires, and what a disgrace it was.” Mahboob Shah, the umpire responsible for most of the decisions that the Australians took exception to, spoke to Coward for his groundbreaking book Cricket Beyond The Bazaar : “I am sure there is a general view that with a coloured umpire it is often a question of integrity; with a white-skinned man the same mistake is called human error. I’ve never received anything like this criticism on the cricket field or otherwise. I thought I was good friends with Mr Egar until the first Test match started.” Events were deemed so dramatic that a 60 Minutes crew, with reporter Mike Munro, was sent to Pakistan to follow up the story. Told he would get no access to the team, Munro interrupted a press conference with the touring media for grabs from Border and Simpson, while also confronting Egar during training sessions. Meanwhile, Javed gave the crew his view of events. From the archive: Mike Munro pictured reporting for 60 Minutes. “Always been poor losers, the Australians,” he said, smiling. “I know in the past, they’ve always been bad losers. I was very upset and sad the way they behaved in the first Test match.” Gradually, the Australian response de-escalated. A team statement was released, with the tour continuing initially “under protest”, before that position was also retracted. The PCB re-appointed Shah for the second Test. In Faisalabad and Lahore, Border’s men performed far better, and got within a couple of wickets of squaring the series on its final day. Dodemaide sees it as a moment in time that ultimately helped the team’s growth. “Steve Waugh’s reflection on that was it really steeled him for a lot of the back end of his career,” he says. “Particularly going back to Asia and the sort of mindset and approach you needed to have to win over there. It certainly laid some foundations for a pretty resilient team.” For Coward, the attitude change was also evident, but he remains adamant that the 1988 tantrums had been unnecessary. “In the end, Border, Steve Waugh and Mark Taylor were the ones who pulled Australia out of that mentality,” he says. “But at the time Border was just as guilty. They were completely in the wrong frame of mind from the time it started. And management has to be culpable - this is only days after Gray made it patently clear they carried enormous responsibility because of the circumstances, the sensitivity.“ Three decades on, if there is rather more worldliness about Australia’s first tour of Pakistan since 1998, there is also more security and fewer opportunities for exploration. Dodemaide’s salient memory is not so much of cricket, but of fishing in Karachi Harbour. Tony Dodemaide, on his Test debut, dismisses Martin Crowe at the MCG in 1987. Credit: Wayne Ludbey “We had a day in Karachi with four or five of us, Steve Waugh, Tim May, Peter Sleep and Peter Taylor,” he recalls. “I’d been given a card for a captain Jack in Karachi harbour, to go down there and go out fishing crabs for the day. “We took off in a taxi, went out in a rickety old boat on the harbour, catching and cooking crabs. No mobile phones, no security at all. It seems mind-blowing now that’s what five Australian cricketers were able to do. That’s the beauty of touring at that time, you had experiences as a young bloke that I treasure.” The takeaways from the trip were significant. Undoubtedly, an international move towards neutral umpires was given momentum, stripping back Australia’s opposition to the concept. But equally, there was a sense of looking the other way for a tour not televised into Australia. The dramas certainly did not hurt Egar - he replaced Gray as ACB chairman the following year. When Pakistan faced similar hurdles with home umpires in Australia in 1989-90, their response was, by comparison, the epitome of good manners. As John Woodcock wrote in The Times : “Mercifully, Imran is not threatening to take his side home as Border wanted to do from Pakistan when Australia were there last. What is incompetence or inexperience in Melbourne can, I suppose, be something else in Faisalabad.”","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Cricket great’s memorial service at the MCG to be broadcast live at WA’s Optus Stadium","link":"https://thewest.com.au/news/wa/shane-warne-cricket-greats-memorial-service-at-the-mcg-to-be-broadcast-live-at-was-optus-stadium--c-6123505","keywords":null,"creator":["Joe Spagnolo"],"video_url":null,"description":"Shane Warne’s memorial service will be broadcast live at Optus Stadium, giving West Australians the chance to pay their respects to the Australian icon.","content":null,"pubDate":"2022-03-19 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6123505/36648288ced4365557f6a47fe8e4066e9e6cfe7e-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"ECB approaches Sir Dave Brailsford for help in restructuring of English cricket","link":"https://uk.sports.yahoo.com/news/ecb-approaches-sir-dave-brailsford-175057972.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-19 17:50:57","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Australia Are Beatable, We Needed Early Wickets: Yastika Bhatia","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-india-vs-australia-australia-are-beatable-we-needed-early-wickets-says-yastika-bhatia-2831881","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's Cricket World Cup: Speaking after India's defeat, Yastika Bhatia stated that Australia are a beatable side. Australia won by six wickets.","content":null,"pubDate":"2022-03-19 17:08:57","full_description":"India on Saturday came tantalisingly close to breaking Australia's unbeaten run in the ongoing ICC Women's World Cup before falling short and young batter Yastika Bhatia said had they picked up some early wickets, the end result could have been different. India's path to the semifinals got a lot tougher after they lost by six wickets to Australia, their third defeat in the showpiece, as the Meg Lanning-led side became the first team to qualify for the last four stage with a record chase in the tournament's history. Half-centuries from skipper Mithali Raj (68 off 96 balls), Yastika (59 off 83) and Harmanpreet Kaur (57 not out off 47) steered India to 277 for seven, but Australia rode on openers Alyssa Healy (72 off 65), Rachael Haynes (43 off 52) and Lanning's (97 off 107) knocks to cruise to their fifth win in as many games. \"They (Australia) have been playing superb cricket, everyone in their team takes responsibility,\" left-handed Yastika said in the post-match media interaction. \"It was Meg Lanning (97) who just took it on herself to take the team over the line. Her intent quite clear from the beginning, though she got out. Still, we came pretty close, it could have gone either way, we could have crossed the line.\" India, runners-up in 2017 edition, had eliminated Australia en route to the final. And Yastika said despite their ominous form, Australia are a beatable side. \"It's nothing like they can't be beaten. We can do it for sure. Our team is really good, we can do it in the semis or finals,\" the 21-year-old said. \"I think it was a defendable total. Credit to the Aussie batters the way they started. Healy and Hyanes started aggressively. \"We would have liked to take more wickets in the power play but they played really well. That (early wickets) would have turned the game but they played really well,\" she added. The Mithali Raj-led India now have a tough task at hand as they must win their remaining two matches against South Africa and Bangladesh to keep their semifinal hopes alive. Against Australia, India missed a sixth bowler as they opted for Shafali Verma in place of Deepti Sharma. India also did not use the part-time off-spin of Harmanpreet on Saturday. Promoted \"She's (Harmanpreet) bowling in the nets. We had it in our mind that we can use her in the middle overs but I don't know what the captain had in her mind. But she will bowl for sure in our future matches,\" Yastika said. India will next face Bangladesh at Hamilton on Tuesday, before taking on South Africa in their concluding league match on March 27.","image_url":"https://c.ndtvimg.com/2022-03/51gqq4mg_yastika-afp_625x300_19_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest balls faced in Test Cricket: Which player has faced most balls in a Test innings?","link":"https://thesportsrush.com/cricket-news-highest-balls-faced-in-test-cricket-which-player-has-faced-most-balls-in-a-test-innings/","keywords":["Cricket","Test cricket"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Highest balls faced in Test Cricket: West Indies batter Kraigg Brathwaite is playing a marathon innings versus England during 2nd Test. During the second Test match of the ongoing England tour of West Indies at the Kensington Oval in Barbados, Windies opening batter Kraigg Brathwaite is on course of a marathon knock during the first… The post Highest balls faced in Test Cricket: Which player has faced most balls in a Test innings? appeared first on The SportsRush.","content":"Highest balls faced in Test Cricket: West Indies batter Kraigg Brathwaite is playing a marathon innings versus England during 2nd Test. During the second Test match of the ongoing England tour of West Indies at the Kensington Oval in Barbados, Windies opening batter Kraigg Brathwaite is on course of a marathon knock during the first innings. After England posted a mammoth 507-9 d in their first innings, the Windies batters had no option but to play the catch-up game, with only a couple of days’ play left in the match. Resuming Day 4 with the overnight score of 288-4, the Windies batters led by Brathwaite dropped down their guards altogether perhaps with the realization that a Draw is the best possible result that they can achieve from here on. Resultantly, during the morning session mere 63 runs were scored by their batters across 34 Overs, with the loss of the nightwatchman Alzarri Joseph (19). Having hit his 10th Test century the previous day, Brathwaite, at Lunch, played out as many as 444 deliveries remain unbeaten at 145 runs. With 351-5 posted on the scoreboard, West Indies still trail by another 156 in their first innings. A notable feature of Kraigg Brathwaite’s game this series has been how little he’s left the ball. Just 32 deliveries from the seamers have drawn no shot from Brathwaite in the opening two Tests – he’s trusted his defence. #WIvENG @IGcom pic.twitter.com/4iGMUpo0CG — The CricViz Analyst (@cricvizanalyst) March 19, 2022 Highest balls faced in Test Cricket As far as the most number of deliveries faced by a batter during a Test innings is concerned, Brathwaite, as of now, is nowhere near the world record holder. The record is held by former England batter Len Hutton, who faced as many as 847 deliveries to come up with an individual score of 364 runs against Australia in the year 1938, at The Oval. Amongst the active group of players, only India’s Cheteshwar Pujara comes close. The right-handed batter faced 525 deliveries against Australia in 2017 at Ranchi. Despite his marathon knock Pujara is still placed at the 30th spot in the list. Top-5 players who have faced most balls in a Test innings Batters Runs Minutes Balls Team Opposition Ground Year Len Hutton 364 797 847 England Australia The Oval 1938 Glenn Turner 259 704 759 New Zealand West Indies Georgetown 1972 Bob Simpson 311 762 743 Austraia England Manchester 1964 Sid Barnes 234 649 667 Austraia England Sydney 1946 Gary Kirsten 275 878 642 South Africa England Durban 1999   The post Highest balls faced in Test Cricket: Which player has faced most balls in a Test innings? appeared first on The SportsRush.","pubDate":"2022-03-19 17:05:19","full_description":"Highest balls faced in Test Cricket: West Indies batter Kraigg Brathwaite is playing a marathon innings versus England during 2nd Test. During the second Test match of the ongoing England tour of West Indies at the Kensington Oval in Barbados, Windies opening batter Kraigg Brathwaite is on course of a marathon knock during the first innings. After England posted a mammoth 507-9 d in their first innings, the Windies batters had no option but to play the catch-up game, with only a couple of days’ play left in the match. Resuming Day 4 with the overnight score of 288-4, the Windies batters led by Brathwaite dropped down their guards altogether perhaps with the realization that a Draw is the best possible result that they can achieve from here on. Resultantly, during the morning session mere 63 runs were scored by their batters across 34 Overs, with the loss of the nightwatchman Alzarri Joseph (19). Having hit his 10th Test century the previous day, Brathwaite, at Lunch, played out as many as 444 deliveries to remain unbeaten at 145 runs. With 351-5 posted on the scoreboard, West Indies still trail by another 156 in their first innings. A notable feature of Kraigg Brathwaite’s game this series has been how little he’s left the ball. Just 32 deliveries from the seamers have drawn no shot from Brathwaite in the opening two Tests – he’s trusted his defence. #WIvENG @IGcom pic.twitter.com/4iGMUpo0CG — The CricViz Analyst (@cricvizanalyst) March 19, 2022 As far as the most number of deliveries faced by a batter during a Test innings is concerned, Brathwaite, as of now, is nowhere near the world record holder. The record is held by former England batter Len Hutton, who faced as many as 847 deliveries to come up with an individual score of 364 runs against Australia in the year 1938, at The Oval. Amongst the active group of players, only India’s Cheteshwar Pujara comes close. The right-handed batter faced 525 deliveries against Australia in 2017 at Ranchi. Despite his marathon knock Pujara is still placed at the 30th spot in the list.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies v England: second Test, day four – live! - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvbWFyLzE5L3dlc3QtaW5kaWVzLXYtZW5nbGFuZC1zZWNvbmQtdGVzdC1kYXktZm91ci1saXZlLXNjb3JlLXVwZGF0ZXPSAXBodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIyL21hci8xOS93ZXN0LWluZGllcy12LWVuZ2xhbmQtc2Vjb25kLXRlc3QtZGF5LWZvdXItbGl2ZS1zY29yZS11cGRhdGVz?oc=5","keywords":null,"creator":null,"video_url":null,"description":"West Indies v England: second Test, day four – live!  The GuardianLIVE: West Indies v England Cricket | 2nd Test Day 4 talkSPORT Stream  talkSPORTCricket should use neutral ground staff to end stalemates deliberately drawn out for five days  The TelegraphEngland will learn from day three mistakes, says spin coach Jeetan Patel  Sky SportsJack Leach is at home in the Caribbean after miserable Ashes  The TimesView Full coverage on Google News","content":null,"pubDate":"2022-03-19 16:32:32","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Watch: Vastrakar's \"Amazing Catch\" To Dismiss Lanning In Women's WC Match","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-india-vs-australia-pooja-vastrakar-dives-to-remove-meg-lanning-commentator-screams-what-a-catch-what-an-amazing-catch-wat-2831816","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's Cricket World Cup: Pooja Vastrakar put in a brilliant diving catch to dismiss Meg Lanning during India's defeat to Australia on Saturday.","content":null,"pubDate":"2022-03-19 16:25:43","full_description":"Despite a narrow defeat, Pooja Vastrakar was in brilliant form for India in their ICC Women's Cricket World Cup fixture against Australia on Saturday, in Auckland. Vastrakar registered 34 runs off 28 balls and also bagged two wickets in 10 overs. Despite her individual form, India went on to lose by six wickets as Australia became the first team to qualify for the semi-finals in the tournament. Other than her bowling and batting figures, Vastrakar also showed off her fielding skills with a brilliant diving catch to dismiss Meg Lanning during Australia's innings. Lanning, who was at 97, directed a full delivery towards Vastrakar at point, who dived to her right to complete a fantastic catch. Such was the brilliance of the catch, the commentator screamed, \"What a catch! What an amazing catch!\" A post shared by ICC (@icc) Australia successfully chased down a target of 278 runs, with Meg Lanning smashing 97 off 107 balls. Meanwhile, Alyssa Healy hammered 72 off 65 deliveries. Rachael Haynes also registered 43 runs off 53 balls with Australia reaching 280 for four, with three deliveries to spare. Initially, India posted 277 for seven in 50 overs with Mithali Raj, Yastika Bhatia and Harmanpreet Kaur bagging half-centuries. Mithali Raj smashed 68 runs off 96 balls and Bhatia added 59 runs off 83 deliveries to the scoreboard. Meanwhile, Harmanpreet Kaur played an unbeaten knock of 57 runs off 47 balls. Promoted After the defeat, India are fourth in the table with two wins and three losses. Meanwhile, the win also helped Australia break the record for the highest successful run-chase in Women's World Cup history, overtaking the one they set against Sri Lanka in the 2017 edition of the tournament.","image_url":"https://c.ndtvimg.com/2022-03/p0sreaso_vastrakar-instagram_120x90_19_March_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"'Road to 1000' book released at Sportstar Aces Awards 2022","link":"https://sportstar.thehindu.com/cricket/road-to-1000-book-released-at-sportstar-aces-awards-2022/article38458887.ece","keywords":null,"creator":["Ashwin Achal"],"video_url":null,"description":"The book is a 520-page, special collection with 1000 pictures to commemorate Indian cricket’s journey. ‘Road to 1000’ was released by former India cricketers Sunil Gavaskar, Syed Kirmani, Dilip Vengsarkar, Mohammad Azharuddin, Chandrakant Pandit and Nilesh Kulkarni.","content":null,"pubDate":"2022-03-19 16:15:38","full_description":"Sportstar and The Hindu group released a coffee-table book, ‘Road to 1000’, at the 2022 Sportstar Aces Awards at The Taj Mahal Palace hotel here on Saturday. The book is a 520-page, special collection with 1000 pictures to commemorate Indian cricket’s journey. ‘Road to 1000’ was released by former India cricketers Sunil Gavaskar, Syed Kirmani, Dilip Vengsarkar, Mohammad Azharuddin, Chandrakant Pandit and Nilesh Kulkarni here. On February 6, India played its 1,000th ODI against the West Indies in Ahmedabad, becoming the first team to record the feat. Mirabai Chanu wins Sportstar of the Year (Female) Award at Sportstar Aces 2022 Neeraj Chopra wins Sportsman of the Year (Track and Field) award at Sportstar Aces 2022 India's World Cup triumphs in 1983 and 2011, under Kapil Dev and M. S. Dhoni respectively, remain the major highlights in Indian ODI history. “Releasing this book has been an incredible journey. We started work on it four months back. We dug deep into our archives, and our photographers worked day and night to pick the best photos. Our Sportstar reporters and photographers travelled the world to cover the Indian cricket team in the 1980s and 1990s. This is the best tribute to Indian cricket,” Ayon Sengupta, Editor, Sportstar, said. You can pre-book your copy by visiting publications.thehindugroup.com/bookstore/ .","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Ashwin wins Sportsman of the Year (Cricket) award at Sportstar Aces 2022","link":"https://sportstar.thehindu.com/cricket/ashwin-wins-sportsman-of-the-year-cricket-award-at-sportstar-aces-2022/article38457408.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Ravichandran Ashwin on Saturday was adjudged Sportsman of the Year (Cricket) at the 2022 Sportstar Aces Awards, which was held at the Taj Mahal Hotel in Mumbai.","content":null,"pubDate":"2022-03-19 15:25:47","full_description":"Ravichandran Ashwin on Saturday was adjudged Sportsman of the Year (Cricket) at the 2022 Sportstar Aces Awards, which was held at the Taj Mahal Hotel in Mumbai. Against England at home in 2021, he mowed down the English batting line-up at home. What added further gloss to his haul of 32 wickets was the stellar century Ashwin scored on his home turf at Chepauk in Chennai. \"Hello to the Sportstar and Hindu family. I have always followed cricket and other sports through the Hindu and waited for my Sportstar magazine to collect the posters of my favourite stars. It is unfortunate I couldn't be there in flesh to collect my award due to the pandemic. I will like to thank the family of Hindu and Sportstar for always being there for the sport and today also honouring me,\" Ashwin said in a pre-recorded video message. Haryana wins Best State for Promotion of Sports Award at Sportstar Aces 2022 Sportstar Aces Awards: India women's hockey team wins 'Breakthrough Performance of the Year' award Earlier in the year too, Ashwin had proved Mr. Dependable with the bat, helping India salvage a draw against Australia in Sydney. His good nick in the IPL also helped the Tamil Nadu spinner to get into the Twenty20 World Cup squad, a good four years after playing his last T20 international. In the second innings against Sri Lanka in Mohali this year, in which Ashwin took four wickets, he surpassed the tally of Kapil Dev, finishing with 436 Test wickets to Kapil's 434. He is now the second-highest wicket-taker for India, only behind Anil Kumble. Legendary India cricketer Sunil Gavaskar, former India hockey captain M. M. Somaya, chess great Viswanathan Anand, former India football skipper Bhaichung Bhutia and Olympians Anjali Bhagwat and Aparna Popat are the members of the Sportstar Aces 2022 jury.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies v England: second Test, day four – live!","link":"https://www.theguardian.com/sport/live/2022/mar/19/west-indies-v-england-second-test-day-four-live-score-updates","keywords":["England in West Indies 2022","Cricket","West Indies cricket team","England cricket team","Sport","Over by over reports"],"creator":["Tim de Lisle (now) and Tom Davies (later)"],"video_url":null,"description":"Over-by-over updates from Saturday’s play at Kensington Oval‘It’s in the blood’: how Barbados became cricket’s ultimate hotspotGet in touch! Contact Tim by email or on Twitter with your thoughts118th over: West Indies 293-4 (Brathwaite 114, Joseph 4) Root hands the ball to Matthew Fisher, perhaps to make up for spurning him when this ball was news. His loosener is a bit too loose, so Brathwaite leg-glances the first ball for four. Warming to the task, Fisher bowls a good bouncer to the nightwatchman, Alzarri Joseph, who freezes and takes a blow to the hand.The players are on the field. It’s cloudy right now, but the forecast is solid sunshine. Continue reading...","content":null,"pubDate":"2022-03-19 14:53:37","full_description":"134th over: West Indies 333-4 (Brathwaite 140, Joseph 18) Yes, Leach was just changing ends, so here he is bowling his 52nd over. By the time West Indies are all out he could be on 100. For such a nice guy, Joe Root can be a bit of a gang-master. 133rd over: West Indies 333-4 (Brathwaite 140, Joseph 18) You’d think England would have spotted by now that Brathwaite feasts on width and on the first ball of an over. Ben Stokes comes on and his loosener is outside off, so Brathwaite just has to dab it to pick up four to third man. On the plus side, Leach is getting a breather – unless he’s changing ends. 132nd over: West Indies 329-4 (Brathwaite 136, Joseph 18) Where Leach wheels away, Lawrence whirls away. And although he’s done well in this series, he does have the part-timer’s habit of bowling one bad ball per over. After five dots, he gives Joseph a juicy long hop and is pulled for six , just over the man at deep square. 131st over: West Indies 323-4 (Brathwaite 136, Joseph 12) Leach continues and maintains his policy of producing one ripper per over. This one, to Brathwaite, takes off from a length and goes so high that Ben Foakes does very well to reach it: if it had been a tennis ball, he would have been able to smash it. Maybe it is a tennis ball and that’s why it bounced so high and so harmlessly. 130th over: West Indies 323-4 (Brathwaite 136, Joseph 12) Brathwaite drives the first ball of Lawrence’s second over for three. He does love to assert himself at the start of an over or a spell. 129th over: West Indies 320-4 (Brathwaite 133, Joseph 12) Another over from Leach, another single to Brathwaite. It’s a match made in purgatory. 128th over: West Indies 319-4 (Brathwaite 132, Joseph 12) Lawrence finishes his over, Joseph has a mow and gets away with an uppish slice. “A torrent of runs this morning,” says Ian Bishop. You what? We’ve had 31 in 11 overs. “Let’s go further,” says David McCairley, “why the need for the captain to be alive at all? Judicious use of the ouija board could extend England’s options. WG Grace perhaps or Boycott (still alive maybe?).” Boycott?! Yes, still alive, but he was only ever a stand-in captain, when Mike Brearley was injured, and it went so well that Ian Botham ran him out on purpose. 127.5 overs: West Indies 317-4 (Brathwaite 132, Joseph 10) Root has been more proactive this morning with his bowling changes, at least at one end. He replaces Mahmood with Dan Lawrence, or, as Butcher calls him, the Chingford Chandrasekhar. He finds some turn, but then the rain returns and the players trot off. We’ve had a third of a session and it has belonged to West Indies, though Jack Leach has been inches away from finding some joy with his periodic rippers. 127th over: West Indies 315-4 (Brathwaite 131, Joseph 9) “How did that miss?” exclaims Curtly Ambrose as Leach bamboozles Brathwaite with another jaffa – and still doesn’t find the edge. This one, unlike the other rippers, was 90kph. “So maybe,” says Mark Butcher, “things are beginning to happen on this pitch.” We can but hope. 126th over: West Indies 313-4 (Brathwaite 130, Joseph 8) Mahmood finds his groove, but still no threat. This is his second tour of the Caribbean this year and in four matches – three T20 and this one – he has yet to take a wicket . But at least he’s not going for 13 runs an over. 125th over: West Indies 312-4 (Brathwaite 129, Joseph 8) Poor old Leach: not good enough as yet to dismiss top-order batters on this surface, but far too good for Alzarri Joseph, who gets another ripper. This is another maiden, but the edge that flew to the vacant leg slip brought up Leach’s hundred. His figures are 48-16-100-1, and that’s the most overs he has bowled in a Test innings. “On the captaincy front,” says Kim Thonger, “a trick is being missed. Mark Wood, with a variety of close imaginary animal advisors, could be a marvellous captain. He could gallop round the field on his imaginary horse, marshalling the troops, deploy an imaginary owl for wise DRS decisions, unleash an imaginary parrot to sledge on his behalf, release an imaginary tiger to fire up pace bowlers with the prospect of being eaten if their all is not given. The possibilities and permutations of an imaginary menagerie are literally infinite. Plus, what a top bloke.” 124th over: West Indies 312-4 (Brathwaite 129, Joseph 8) Fisher gives way to Saqib Mahmood, one debutant replacing another. The result is much the same, only more so: a wide one, flayed for four by Brathwaite, who also picks up two twos in the same area. West Indies have avoided the follow-on : they trail by just 195 runs. 123rd over: West Indies 304-4 (Brathwaite 121, Joseph 8) Leach bowls a peach to Joseph, far too good to take the edge of a tail-ender’s bat – pitching middle, lifting and turning and heading for slip. In a perfect world, the batter would have been Mike Gatting. “In this modern day and age,” says Andrew Benton, “why do we need a captain to be on the field of play? Why not let the players play, and the captain can captain remotely from the pavilion. That way, a captain can be selected for captaining abilities alone. And could even be a woman in a man’s match.” 122nd over: West Indies 304-4 (Brathwaite 121, Joseph 8) Brathwaite, facing Fisher, waits for the bad ball, which comes along at the end of the over: a long hop, cut away for four. 121st over: West Indies 300-4 (Brathwaite 117, Joseph 8) Leach has a chat with Root and they remove his leg slip for Brathwaite – whereupon an edge loops up off the inside edge to just where the guy no longer is. That’s bad luck more than bad judgment, though it is quite early in the day to be making a defensive change. “Nice to see Kirsty MacColl remembered,” says John Starbuck, “but Shakespeare did get there first. Glendower: I can call creatures from the vasty deep. Hotspur: Why, so can I, so can any man; But will they come when you do call for them? “Henry IV Pt 1. One of the great put-downs.” 120th over: West Indies 299-4 (Brathwaite 116, Joseph 8) Fisher goes full to Joseph, hoping for a nick to the cordon only slip. Joseph is equal to it, square-driving for four. He has a Test best of 86, apparently, so maybe he’s eyeing a hundred. 119th over: West Indies 295-4 (Brathwaite 116, Joseph 4) And from the other end, it’s... Jack Leach! With a curious field, a slip and two short legs, as if they think the arm ball is more dangerous than Leach’s stock-in-trade. Brathwaite, very happy for Leach to aim at his legs, nudges the first ball for two. “Poor old Root,” says David Alcock. “I have a lot of love for the guy - local lad, went to the same school as my partner’s lass, sublime batsman, etc. But, some of his Yorkshire nicknames have become cuttingly accurate. I’d add a Homeric epithet: Craptain Cliche, Breaker of Bowlers. Sorry Joe. “Regarding a Broad captaincy being mooted again - I thought that sort of chatter was the primary reason for him and Anderson getting dropped... or am I being too cynical?” 118th over: West Indies 293-4 (Brathwaite 114, Joseph 4) Root hands the ball to Matthew Fisher, perhaps to make up for spurning him when this ball was news. His loosener is a bit too loose, so Brathwaite leg-glances the first ball for four. Warming to the task, Fisher bowls a good bouncer to the nightwatchman, Alzarri Joseph, who freezes and takes a blow to the hand. The players are on the field. It’s cloudy right now, but the forecast is solid sunshine. This series has been all about the imbalance between bat and ball. “It’s all dead tracks now,” says Kemar Roach in a statement that BT Sport showed on the screen just now. You can see this in the series stats: Dan Lawrence, not content with being top of the series averages, is the only bowler with a strike rate better than 66 balls per wicket . It is taking all the proper bowlers at least 11 overs to come by a wicket. England’s specialist seamers are all going along at over 100 balls per wicket, with poor old Chris Woakes on 330. Another view of the captaincy comes in from Andy Flintoff (“not that one”). “If this were a few years ago,” he argues, “then my choice for replacement captain would have been Anderson, who if I recall correctly, has stood in in the past. Now he’s being eased out of the set-up, then it’d probably have to be Stokes or Broad, as long as they don’t fall foul of my namesake’s failings which were to bowl themselves too much and indirectly shorten their Test careers.” “So far, this Test has been the cricketing equivalent of Mogadon,” says Jo Pridmore. “Kill me now...!!” In other news. it’s been raining this morning in Bridgetown. Another unexpected blow for the travelling masses. The covers are off now, but the start has gone back by a quarter of an hour. “To be fair to Root,” says Gary Naylor, “if he had the two blokes to bowl at their own ends, he’d look a world-beater.” Marshall and Garner? In the immortal words of Kirsty MacColl, well so could anyone. “He has been more attacking with his field placings than is usual and I’m not sure you can overrule your most experienced bowler when he says it’s not worth a review.” When you’re the captain, you can overrule anyone. And there was nothing to lose with that review – at worst, it was going to be umpire’s call, wasn’t it? And here’s John Starbuck, joining the campaign. “Yes, Root isn’t up to it,” he says, “so why don’t we take a leaf out of the Aussies’ book and appoint a senior fast bowler to lead the team properly? Broad really fits the bill, as a good analyst of the game, willing to put in the hard yards but also swap the bowling round to suit both the players and the pitch. He also fields regularly at mid-off and would keep a close eye on all his bowlers. OK, his judgment of the DRS is over-enthusiastic, but a group of designated players told to watch out for it could be his consultation council, or he might take the umpires’ DRS training course (there must be one). Plus he does the media well. And England need another fast bowler to cover all the crocks.” An email! From Dean Kinsella. “It’s hard to disagree with your assessment of Root’s captaincy shortcomings,” he says, “especially as he seems to a very affable chap and popular with the squad. But the next question is, inevitably, who do you replace him with? It’s great to see some younger players being blooded in this series and maybe a candidate may arise from these in time. But I feel the ‘reset’ is not ready for Root and branch change.” Ha. Well, Mike Brearley feels it’s time for Stokes - and he was very good when he led a one-day B team to a whitewash against Pakistan last summer. Personally I would have had Stuart Broad, who is highly analytical and articulate and also has fire in the belly. Though he would have needed a lot of help with the reviews. Test cricket, as you know, is called that for a reason. It’s the ultimate test for the players. And it can also be quite a test for the mere spectator. Picture the scene: you save up for years to follow England on tour. The Caribbean in March! Trip of a lifetime! And then you find you’ve booked in for five days of tedium. After three days of this match, there have been 13 wickets. At that rate, it would take six more days to get close to a result. While Tests elsewhere often finish early, West Indies’ groundsmen are hell-bent on bringing back the draw. In Antigua it was a reasonably tense one, with a result still possible as the final session began. In Barbados, we’ll be lucky to get anywhere near that. It’s not just the groundsmen. West Indies have mostly batted like it’s 1959, Alex Lees did the same for England, and even Joe Root, usually so fluent, found the boundary only once every 22 balls. Dan Lawrence and Ben Stokes went three times as fast as that and deserve medals for it. But in the field England have been almost as passive as West Indies with the bat. Root had Jack Leach wheeling away for hours on end, doing the same thing, expecting a different outcome. After bowling Jofra Archer and Mark Wood into the ground, he is now working on Leach – who, as a spinner, is better able to cope, but still, it made no sense to hand him the new ball when he was knackered and there were three specialist seamers kicking their heels. As a captain, Root remains superb at one facet of the job (leading from the front), good at another (being an ambassador), and hopeless at the rest: picking the team reading the pitch, having a plan, having a back-up plan, making things happen, running the show. A strong captain is always one step ahead, yet Root was so dopey with his bowling changes yesterday that some OBOers had time to work out what was needed, compose an email, wait for us writers to get through the inbox, and still be half an hour ahead of the game. Jos Buttler has copped some flak for his poor Ashes with the bat, but without his sharp eye and cool head, Root even struggles with the reviews. Watching England yesterday, you’d never have known that Root had captained them in more Tests than anyone in their history. That said, hope springs eternal, and I’ll be delighted if he goes out there today and makes this opinion look silly. Play starts at 2pm GMT: see you then.","image_url":"https://i.guim.co.uk/img/media/4b8493e9f12086b3927940bbfb8cfbbe8948b519/0_190_2178_1307/master/2178.jpg?width=460&quality=85&auto=format&fit=max&s=45a8b83c794d76735db27aa1272f4dc4","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Lethal Lanning steers Aussies to semis in record win","link":"https://wwos.nine.com.au/cricket/icc-womens-world-cup-2022-australia-india-meg-lanning-result-video-highlights/15f31f1a-eaf0-4d4b-9c34-2e9abf36e844","keywords":null,"creator":["wwos"],"video_url":null,"description":"Meg Lanning fell just short of a century but Australia sealed their place in the Women's World Cup semi-finals with a record win.","content":"Meg Lanning fell just short of a ton but Australia locked up their place in the ICC Women's World Cup semi-finals as they mounted the biggest successful run chase in tournament history.Australia advanced in the pinnacle one-day international competition in a six-wicket victory over India at Eden Park, inspired by captain Lanning's 97 from 107 balls.Harmanpreet Kaur top-scored for India with an unbeaten 57 from 47 as her side posted 7-277, before Australia chased the runs with three balls to spare.READ MORE: Geelong gun badly injured in sickening collisionREAD MORE: PM goes bananas as Sharks win post-siren belterREAD MORE: F1 champ stunned in qualifyingAlyssa Healy got Australia off to a rocketing start, pummeling 72 from 65, and Beth Mooney rounded out the job with 30 not out from 20 balls.Mooney hit a boundary, pinched a hasty two and struck veteran quick Jhulan Goswami for four down the ground to seal the special victory.\"What a great finish for Beth Mooney on the top of an all-round top performance from a side that looks nigh on unbeatable,\" said New Zealand cricket icon Ian Smith on the Fox Sports broadcast.https://twitter.com/cricketcomau/status/1505116549375721473Lanning peeled off 13 fours and garnered 44 of her runs through the gully-point region.The 29-year-old's shot at a century slipped away when she holed out in the second-last over, her team needing another eight runs to win.\"It was a belter of a wicket,\" Lanning said at the post-match ceremony.\"It came on really nicely, there wasn't a lot of turn and any width given was really hard to defend.\"So, that was sort of the strategy to have: to play really straight when it was on the stumps and when it was wide to go really hard.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-19 12:40:25","full_description":"Meg Lanning fell just short of a ton but Australia locked up their place in the ICC Women's World Cup semi-finals as they mounted the biggest successful run chase in tournament history. Australia advanced in the pinnacle one-day international competition in a six-wicket victory over India at Eden Park, inspired by captain Lanning's 97 from 107 balls. Harmanpreet Kaur top-scored for India with an unbeaten 57 from 47 as her side posted 7-277, before Australia chased the runs with three balls to spare. READ MORE: Geelong gun badly injured in sickening collision READ MORE: PM goes bananas as Sharks win post-siren belter READ MORE: F1 champ stunned in qualifying Alyssa Healy got Australia off to a rocketing start, pummeling 72 from 65, and Beth Mooney rounded out the job with 30 not out from 20 balls. Mooney hit a boundary, pinched a hasty two and struck veteran quick Jhulan Goswami for four down the ground to seal the special victory. \"What a great finish for Beth Mooney on the top of an all-round top performance from a side that looks nigh on unbeatable,\" said New Zealand cricket icon Ian Smith on the Fox Sports broadcast. Lanning peeled off 13 fours and garnered 44 of her runs through the gully-point region. The 29-year-old's shot at a century slipped away when she holed out in the second-last over, her team needing another eight runs to win. \"It was a belter of a wicket,\" Lanning said at the post-match ceremony. \"It came on really nicely, there wasn't a lot of turn and any width given was really hard to defend. \"So, that was sort of the strategy to have: to play really straight when it was on the stumps and when it was wide to go really hard.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/417974/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"RR coach Kumar Sangakkara reveals why Suresh Raina was not picked by any team for IPL 2022","link":"https://zeenews.india.com/cricket/rr-coach-kumar-sangakkara-reveals-why-suresh-raina-was-not-picked-by-any-team-for-ipl-2022-2446453.html","keywords":null,"creator":null,"video_url":null,"description":"The CSK veteran was even ignored by the MS Dhoni's team for whom he has played most of his IPL cricket.","content":null,"pubDate":"2022-03-19 12:33:00","full_description":"One of the biggest news from the IPL 2022 Auction was the snub of Mr IPL Suresh Raina. The CSK veteran was even ignored by the MS Dhoni's team for whom he has played most of his IPL cricket. Raina is not overaged for IPL and certainly not for CSK whose captain is 41. Yet he could not make the cut. No IPL team showed any interest in the left-handed batter. One of the reasons could be that Raina no more plays international cricket for India and is rarely seen on the field for his state team UP. Franchises may have lost faith in his batting abilities because of this reason. And Rajasthan Royals head coach Kumar Sangakkara believes Raina was not suited to play for this upcoming season. \"There are different ways to look at it. As the years go by, players change and reputations are also made new by younger players,\" said the former Sri Lankan captain. \"In the case of Suresh Raina, his reputation is unbelievable in IPL cricket. He has been an absolute legend, one of the best and top-most performers season after season. When you go into granular detail, perhaps the player is not suited for that season. It takes nothing away from the player being one of the best ever, or the player being of absolute high quality and it is something that analysts, coaches and owners look for,\" he concluded.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's WC Points Table: How Things Stand After Australia's Win vs India","link":"https://sports.ndtv.com/cricket/icc-cricket-womens-world-cup-points-table-how-things-stand-after-australias-win-vs-india-2831437","keywords":null,"creator":null,"video_url":null,"description":"ICC Cricket Women's World Cup: Australia became the first team to qualify for the semi-finals after defeating India on Saturday.","content":null,"pubDate":"2022-03-19 12:27:50","full_description":"Australia defeated India by six wickets in their league stage fixture to become the first team to qualify for the semi-finals of this year's ongoing ICC Women's Cricket World Cup. The Aussies also broke the record for the highest successful run-chase in the tournament's history, surpassing the one they had set against Sri Lanka in the tournament's 2017 edition. Chasing a target of 278 runs, Australia reached 280 for four with three ball to spare. Here's a look at the updated ICC Women's World Cup 2022 Points Table: 1. Australia (P5 W5 L0; Points 10; NRR +1.424) 2. South Africa (P4 W4 L0; Points 8; NRR +0.226) 3. West Indies (P5 W3 L2; Points 6; NRR -0.930) 4. India (P5 W2 L3; Points 4; NRR 5. New Zealand (P5 W2 L3; Points 4; NRR -0.216) 6. England (P4 W1 L3; Points 2; NRR +0.351) 7. Bangladesh (P4 W1 L3; Points 2; NRR -0.342) 8. Pakistan (P4 W0 L4; Points 0; NRR -0.996) After this defeat, India are still in fourth position with four points. Meanwhile, South Africa are second with eight points and West Indies are third with six. Australia occupy top spot and have already qualified for the semi-finals. Promoted Meanwhile, New Zealand are in fifth position with four points and have played the same amount of games as fourth-placed India. England are sixth with two points and Bangladesh are seventh with two points. Pakistan are bottom of the standings with zero wins and zero points.","image_url":"https://c.ndtvimg.com/2022-03/m770phco_haynes-afp_625x300_19_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's WC: We Can Improve Our Fielding, Says Australia Captain Lanning","link":"https://sports.ndtv.com/cricket/womens-world-cup-we-can-improve-our-dielding-says-australia-captain-meg-lanning-after-win-against-india-2831364","keywords":null,"creator":null,"video_url":null,"description":"Australia captain Meg Lanning expressed happiness and said they need to field better after her side defeated India by six wickets in the last over thriller in the ICC Women's Cricket World Cup 2022 on...","content":null,"pubDate":"2022-03-19 11:39:39","full_description":"Australia captain Meg Lanning expressed happiness and said they need to field better after her side defeated India by six wickets in the last over thriller in the ICC Women's Cricket World Cup 2022 here at Eden Park on Saturday. Meg Lanning played a brilliant knock of 97 while opener Alyssa Healy laid the foundation for Australian victory with a quick 72. Meg Lanning believes that her team needs to do better in their upcoming matches in the tournament and added that Australia needs to improve fielding too. \"They have got a world-class team with some real match-winners, halfway it was just about par. We felt really comfortable with that for it was a ripper of a wicket. To have come away with a win against an excellent team is really great for the group. Something we can improve on in the field as well, we were a little bit fumbly which put us under pressure. It is nice to keep winning and we want to get better with every game,\" Meg Lanning said. \"We will take the win today but we have got things to work on. It was tricky seeing ground as well, took a little bit to adjust, we sort of got there in the end. Very unique, the pockets are huge as well, lots of the grounds in New Zealand are, got to adjust as quickly as we can. We knew that we had it under control. A couple of boundaries would break the back of it,\" she added. Beth Mooney joined Lanning at the crease and made sure Australia don't lose their composure going into the death overs. Chase became tricky when Lanning fell 3 runs short of her century in the penultimate over but Beth Mooney with ice in her veins called the game off for Australia in the last over. \"Moons [Mooney] came in and took the pressure off me, I got a couple of boundaries. Healy and Haynes got us off to a great start, gave us the platform and we finished it off. Was nice to see Healy do well, you could tell from the first ball she faced today, she was on with the steely look on her face,\" Meg Lanning. Promoted Australia, currently unbeaten in the World Cup 2022, have now qualified for the semi-final with five wins.","image_url":"https://c.ndtvimg.com/2022-03/th0dlf0o_meg-lanning-australia-afp_625x300_19_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI secretary Jay Shah's term as ACC president extended by one year","link":"https://zeenews.india.com/cricket/bcci-secretary-jay-shahs-term-as-acc-president-extended-by-one-year-2446436.html","keywords":null,"creator":null,"video_url":null,"description":"BCCI secretary Jay Shah's tenure as president of the Asian Cricket Council (ACC) was on Saturday unanimously extended by a year at its annual general meeting.","content":null,"pubDate":"2022-03-19 11:25:00","full_description":"BCCI secretary Jay Shah's tenure as president of the Asian Cricket Council (ACC) was on Saturday unanimously extended by a year at its annual general meeting. Shah had taken over the reins of the ACC in January last year from Bangladesh Cricket Board (BCB) president Nazmul Hassan, making him the youngest administrator to be re-appointed as ACC president. Addressing the AGM, Shah said the ACC's key focus would be to carry forward the development of the sport in the region. \"We remain committed towards ensuring the all-round development of cricket in the region, especially carrying forward the pioneering work in women's cricket and the multiple grassroot tournaments the ACC conducts in the region around the year,\" Shah said. \"The pandemic hopefully is behind us and I am keen that we adapt, innovate and help the ACC grow from strength to strength from hereon,\" he added. Shah's extension was proposed by Sri Lanka Cricket (SLC) president Shammi Silva and the nomination was backed unanimously by all the members of the ACC. \"I would like to thank all of my esteemed colleagues at the ACC for reposing their faith in me and considering me worthy to carry on all the work we had begun,\" Shah said. \"I humbly accept this honour and I am committed to working hard with a view to organise, develop and promote our beloved sport of cricket in the region, aiding the ACC to steadily grow in stature,\" he added. At the AGM, Asia Cup 2022 dates were also confirmed. It will take place in Sri Lanka this year","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"High profile guests among thousands expected to attend Shane Warne’s funeral","link":"https://thewest.com.au/sport/cricket/high-profile-guests-among-thousands-expected-to-attend-shane-warnes-funeral--c-6127902","keywords":null,"creator":null,"video_url":null,"description":"The details of cricket great Shane Warne’s funeral have been revealed with Eddie McGuire to lead other high profile guests and the spin bowler’s closest family and friends at the farewell.","content":null,"pubDate":"2022-03-19 11:01:01","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6127902/10aec24d09a02802d16f8fac010406c126e4cebf-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"“I’m really looking forward to finishing the season back in the squad”: Will Pucovski returns to Victoria’s Sheffield Shield squad after his 11th concussion injury","link":"https://thesportsrush.com/cricket-news-im-really-looking-forward-to-finishing-the-season-back-in-the-squad-will-pucovski-return-to-victorias-sheffield-shield-squad-after-his-11th-concussion-injury/","keywords":["Cricket","Cricket Victoria","Sheffield Shield","Will Pucovski"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian batter Will Pucovski has been selected in Victoria’s Sheffield Shield squad for the game against Western Australia. Australian batter Will Pucovski has to be the unluckiest cricketer on the circuit right now. He made his much-awaited return to cricket last month in Adelaide, but yet another concussion forced him to leave the field. He got… The post “I’m really looking forward to finishing the season back in the squad”: Will Pucovski returns to Victoria’s Sheffield Shield squad after his 11th concussion injury appeared first on The SportsRush.","content":"Australian batter Will Pucovski has been selected in Victoria’s Sheffield Shield squad for the game against Western Australia. Australian batter Will Pucovski has to be the unluckiest cricketer on the circuit right now. He made his much-awaited return to cricket last month in Adelaide, but yet another concussion forced him to leave the field. He got hit on his head by a volleyball during warm-ups and faced the symptoms on the field. Pucovski suffered his 10th concussion in November and was ruled out of Ashes 2021-22. The 23-year old opener from Victoria is highly rated, but he has been really unlucky. He made his international debut last year against India, and he also scored a half-century in it. However, he injured his shoulder during the game and missed the rest of the series. Pucovski has scored 1816 first-class runs at an astonishing average of 53.41, with the help of six centuries. After Pucovski’s latest concussion, there are many calls in the media for him to retire. Will Pucovski returns to Victoria’s Sheffield Shield squad After all the talks about his retirement, Will Pucovski is set to make his return to Shield cricket. He has been picked in Victoria’s squad for their Sheffield Shield game against Western Australia from Wednesday. Will Pucovski was cleared to play club cricket, and he has played a couple of games. Will Pucovski also represented Victoria’s 2nd XI against Tasmania, and the doctors have now cleared him to play in the elite tournament for Victoria. Cricket Victoria’s Dr. Trefor James said that “Will has made positive steps in his recovery from the injury in Adelaide.” News: Doctors have cleared Will Pucovski for a return to First Class cricket. He is available for selection against WA at the WACA next week. pic.twitter.com/evYWtyafUd — Victorian Cricket Team (@VicStateCricket) March 19, 2022 Will Pucovski has also expressed his delight on making his return to the Sheffield Shield. He also thanked and appreciated the support of the club during his tough times. “I’m really looking forward to finishing the season back in the squad,” Will Pucvoski said in a statement. “It was so worthwhile to meet with the panel and hear their views on my circumstances.” “Managing my health – physically and mentally – is something I have to live with moving forward and I’m really grateful for everyone’s support at Cricket Victoria.”   The post “I’m really looking forward to finishing the season back in the squad”: Will Pucovski returns to Victoria’s Sheffield Shield squad after his 11th concussion injury appeared first on The SportsRush.","pubDate":"2022-03-19 10:54:49","full_description":"Australian batter Will Pucovski has been selected in Victoria’s Sheffield Shield squad for the game against Western Australia. Australian batter Will Pucovski has to be the unluckiest cricketer on the circuit right now. He made his much-awaited return to cricket last month in Adelaide, but yet another concussion forced him to leave the field. He got hit on his head by a volleyball during warm-ups and faced the symptoms on the field. Pucovski suffered his 10th concussion in November and was ruled out of Ashes 2021-22. The 23-year old opener from Victoria is highly rated, but he has been really unlucky. He made his international debut last year against India, and he also scored a half-century in it. However, he injured his shoulder during the game and missed the rest of the series. Pucovski has scored 1816 first-class runs at an astonishing average of 53.41, with the help of six centuries. After Pucovski’s latest concussion, there are many calls in the media for him to retire. After all the talks about his retirement, Will Pucovski is set to make his return to Shield cricket. He has been picked in Victoria’s squad for their Sheffield Shield game against Western Australia from Wednesday. Will Pucovski was cleared to play club cricket, and he has played a couple of games. Will Pucovski also represented Victoria’s 2nd XI against Tasmania, and the doctors have now cleared him to play in the elite tournament for Victoria. Cricket Victoria’s Dr. Trefor James said that “Will has made positive steps in his recovery from the injury in Adelaide.” News: Doctors have cleared Will Pucovski for a return to First Class cricket. He is available for selection against WA at the WACA next week. 💙 pic.twitter.com/evYWtyafUd — Victorian Cricket Team (@VicStateCricket) March 19, 2022 Will Pucovski has also expressed his delight on making his return to the Sheffield Shield. He also thanked and appreciated the support of the club during his tough times. “I’m really looking forward to finishing the season back in the squad,” Will Pucvoski said in a statement. “It was so worthwhile to meet with the panel and hear their views on my circumstances.” “Managing my health – physically and mentally – is something I have to live with moving forward and I’m really grateful for everyone’s support at Cricket Victoria.”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}