{"newsArray":[{"title":"Aussies keep eyes on winning women's Ashes, not drawing","link":"https://thewest.com.au/sport/cricket/aussies-keep-eyes-on-winning-womens-ashes-not-drawing-c-11251361","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia's women insist their goal remains winning the Ashes and not just drawing to retain them after back-to-back losses in the Twenty20 component.","content":"Tahlia McGrath insists Australia are still determined to win the Ashes and not just retain them, despite suffering their first back-to-back losses in any format in almost six years. Australia's grip on the multi-form Ashes has loosened in recent days, after winning the Test match and series-opening T20 to take a 6-0 points lead. However, defeats to England at The Oval and Lord's have reduced that scoreline to 6-4, with two points available for each of the remaining three ODIs. As holders of the trophy, Australia can still retain the Ashes with a victory in the opening ODI on Wednesday night in Bristol to make it 8-4 with two matches to play. But the tourists have long been adamant they have no interest in only drawing the series, after walking away with an empty feeling after doing likewise in 2016-17. Instead, they are determined to win two of the three ODIs to ensure they walk away outright winners. \"We just want to win the Ashes. That's what we came here to do,\" vice-captain McGrath said. \"I don't think (drawing) is enough. We want to win every game of cricket. First and foremost is retaining the Ashes, but we want to win these three games coming up. \"Winning 8-8 doesn't sound as good as winning them outright. The focus is on winning tomorrow, but we want to win outright.\" Australia's losses in the T20s marked their first back-to-back defeats in any formats since November 2017. But they will walk out into their preferred format on Wednesday, having dominated the 50-over game in particular over the past five years. Their record in ODIs stands at an imposing 41-1 in completed games since the start of 2018, with the team currently on a 15-game winning streak. \"Part of the reason we have been so successful in the past is you have so much more time in ODIs,\" McGrath said. \"You can build your innings a bit more. We have had players cash in and score those big hundreds with players supporting them. \"From a bowling point of view you can build a bit more pressure and work batters out a bit more. \"We have been consistent in that format, and players coming in know exactly what they need to do for the team.\" Australia could make a change to their team for Wednesday's clash, with Phoebe Litchfield, Grace Harris and Heather Graham likely to be fighting it out for one spot. Litchfield did open in Australia's last ODI matches in January, but Alyssa Healy has since returned to partner Beth Mooney at the top of the order. Sign up for our emails","pubDate":"2023-07-11 20:02:34","image_url":"https://images.thewest.com.au/publication/C-11251361/78df4874e5b1588e4dd6c7b71437e16fc799136a-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park?","link":"https://thesportsrush.com/cricket-news-roseau-dominica-time-what-is-the-time-difference-between-india-and-windsor-park/","keywords":["Cricket","India tour of West Indies 2023","Windsor Park"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Test match cricket is all set to return to the island nation of Dominica after more than a six-year gap. The first of the two-match series of India’s tour of West Indies 2023 commences in the city of Roseau from tomorrow (Wednesday) onwards. Roseau’s Windsor Park last hosted a Test in the year 2017 when… The post Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park? appeared first on The SportsRush.","content":"Test match cricket is all set to return to the island nation of Dominica after more than a six-year gap. The first of the two-match series of India’s tour of West Indies 2023 commences in the city of Roseau from tomorrow (Wednesday) onwards. Roseau’s Windsor Park last hosted a Test in the year 2017 when the hosts had squared-off against Pakistan. As for team India, this Caribbean city will mark their return back after more than a decade, with the Asian country having last played here in the year 2011. As has been the case with Indian cricket fans whenever Test matches take place in this part of the world, they will have to yet again make temporary changes to their sleeping pattern with the action set to take place till way past midnight. Roseau Dominica Time Difference With India The city of Roseau is 9 hours and 30 minutes behind the Indian Standard Time. Dominica observes the Atlantic Standard Time throughout the year, which is a result of a subtraction of four hours from Coordinated Universal Time (UTC). India, on the other hand, observes the Indian Standard Time (IST), which is 5 hours and 30 minutes ahead of the UTC. For e.g. If the present time in India as of July 12 (Wednesday) is 12:30 AM, then the corresponding time in the city of Roseau in Dominica would be 03:00 PM with the date being July 11 (Tuesday). As far as the first Test match between India and West Indies is concerned, the same will begin from 10:00 AM onwards (local time), or 07:30 PM (IST) tomorrow. How Many Time Zones Are There In The Caribbean? The Caribbean region is divided into two time zones – Eastern and Atlantic. Also, there are five nations in the region which also observe the daylight saving. They are Bahamas, Cuba, Turks & Caicos islands, Haiti and Bermuda. While the Atlantic Standard Time (as in Dominica) is four hours behind the UTC, the Eastern Standard Time is five hours behind the UTC. The post Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park? appeared first on The SportsRush.","pubDate":"2023-07-11 19:58:21","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Aussies will find it hard to get over the line: Woakes","link":"https://thewest.com.au/sport/cricket/aussies-will-find-it-hard-to-get-over-the-line-woakes-c-11251245","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"England's Headingley matchwinner Chris Woakes has insisted Australia will feel the pressure to clinch the Ashes despite being 2-1 ahead in the series","content":"Chris Woakes has sought to turn the pressure on to Australia despite their 2-1 Ashes lead by insisting the tourists will find it hard to get a series win over the line. Australia need only win at Old Trafford next week to retain the Ashes but Pat Cummins' men want to be the first Australian side to win in England for two decades. England, meanwhile, insist they can regain the urn by coming back from 2-0 down to win 3-2, which they have never previously done. \"In our dressing room the belief is we can win 3-2, I think it's always been there,\" the allrounder said. \"You don't want to look too far ahead, you have to play what's in front of you, each ball, each day, each session, each Test match as it comes. \"I'd imagine when you're so close to getting something, the harder it gets, and I'm sure the Aussies will be feeling that now. \"Once you get so close to something, it's actually hard to get that over the line, isn't it? We've got to turn up in Manchester and put in another performance. \"They're an extremely good side and we're going to have to be at our best to beat them again.\" Woakes admitted his triumphant return to Ashes cricket left him \"quite emotional\" after accepting his time as a Test player might have come to an end. The 34-year-old stepped up with bat and ball after being thrust into last week's must-win clash at Headingley, 16 months after he last donned his England whites on the ill-fated tour of the West Indies. \"It's quite emotional actually. You sometimes think the ship has sailed, of course you do,\" he said of his match-winning return. \"You do wonder, especially when the team was going so well last summer and I wasn't involved. It's hard. \"Sometimes you don't always get the rewards that you deserve, but I felt like I played well in this game and got the rewards I deserve.\" Sign up for our emails","pubDate":"2023-07-11 19:33:21","image_url":"https://images.thewest.com.au/publication/C-11251245/2215b7f02df9c617f494bfdcdc663e7e08ef06a6-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"India vs West Indies Test series: నేటి నుండి భారత్, వెస్టిండీస్ మొదటి టెస్ట్ మ్యాచ్ ప్రారంభం.. ఎప్పుడు, ఏ సమయం, ఏ ఓటీటీ ప్లాట్ ఫాంలో ఫ్రీగా టెస్ట్ మ్యాచ్ చూడచ్చో తెలుసుకోండి..","link":"https://telugu.latestly.com/sports/cricket/india-and-west-indies-first-test-match-starts-from-today-know-when-what-time-on-which-ott-platform-101508.html","keywords":null,"creator":null,"video_url":null,"description":"నేటి నుంచి భారత్, వెస్టిండీస్ మధ్య టెస్టు సిరీస్ (ఇండ్ Vs WI) ప్రారంభం కానుంది. రెండు టెస్టుల సిరీస్‌లో తొలి టెస్టు జూలై 12 నుంచి జరగనుంది. ప్రపంచ టెస్టు ఛాంపియన్‌షిప్ (డబ్ల్యూటీసీ)లో కెప్టెన్ రోహిత్ శర్మ నేతృత్వంలోని జట్టు ఓడిపోయిన తర్వాత ఇదే తొలి టెస్టు సిరీస్. వెస్టిండీస్‌తో జరిగే టెస్ట్ సిరీస్‌లో కొత్త బౌలర్లు కమాండ్‌ని పొందడం చూడవచ్చు.","content":"నేటి నుంచి భారత్, వెస్టిండీస్ మధ్య టెస్టు సిరీస్ (ఇండ్ Vs WI) ప్రారంభం కానుంది. రెండు టెస్టుల సిరీస్‌లో తొలి టెస్టు జూలై 12 నుంచి జరగనుంది. ప్రపంచ టెస్టు ఛాంపియన్‌షిప్ (డబ్ల్యూటీసీ)లో కెప్టెన్ రోహిత్ శర్మ నేతృత్వంలోని జట్టు ఓడిపోయిన తర్వాత ఇదే తొలి టెస్టు సిరీస్. వెస్టిండీస్‌తో జరిగే టెస్ట్ సిరీస్‌లో కొత్త బౌలర్లు కమాండ్‌ని పొందడం చూడవచ్చు. డొమినికా వేదికగా తొలి టెస్టు మ్యాచ్ జరగనుంది మొదటి టెస్ట్ డొమినికాలో ఆడుతుంది. ఇప్పటికే ప్రపంచకప్‌ నుంచి నిష్క్రమించిన వెస్టిండీస్‌పై రోహిత్ శర్మ నేతృత్వంలోని భారత జట్టు కరీబియన్ గడ్డపై సత్తా చాటేందుకు సిద్ధమైంది. ఈ సిరీస్‌లో ఛతేశ్వర్‌ పుజారాకు చోటు దక్కలేదు. ఇలాంటి పరిస్థితుల్లో రితురాజ్ గైక్వాడ్, యశస్వి జైస్వాల్‌లలో ఎవరికి స్థానం దక్కుతుందనేది ఆసక్తికరంగా మారింది. టెస్ట్ మ్యాచ్ ఎప్పుడు ప్రారంభమవుతుంది? భారత్, వెస్టిండీస్మ ధ్య జరగనున్న తొలి టెస్టు మ్యాచ్ రేపటి నుంచి అంటే బుధవారం నుంచి ప్రారంభం కానుంది. ఈ మ్యాచ్ భారత కాలమానం ప్రకారం రాత్రి 7.30 గంటలకు ప్రారంభమవుతుంది. ఒక రోజు ఆట దాదాపు 8 గంటల పాటు సాగుతుంది. అటువంటి పరిస్థితిలో, ఒక రోజు ఆట తెల్లవారుజామున 3:30 గంటలకు ముగుస్తుంది. మీరు టెస్ట్ సిరీస్‌ను ఎక్కడ చూడవచ్చు? భారత్, వెస్టిండీస్ మధ్య జరిగే ఈ టెస్ట్ సిరీస్‌ను అభిమానులు పూర్తిగా ఉచితంగా వీక్షించవచ్చు. అభిమానులు Hotstar లేదా Sony Livకి సబ్‌స్క్రిప్షన్ చెల్లించే బదులు Jio సినిమాలో వెస్టిండీస్, భారతదేశం మధ్య టెస్ట్ సిరీస్‌ను ఉచితంగా చూడవచ్చు. వెస్టిండీస్ పర్యటనలో టెస్టు కోసం భారత జట్టు రోహిత్ శర్మ (కెప్టెన్), శుభ్‌మన్ గిల్, రుతురాజ్ గైక్వాడ్, విరాట్ కోహ్లి, యశస్వి జైస్వాల్, అజింక్యా రహానే (వైస్ కెప్టెన్), కెఎస్ భరత్ (వికెట్ కీపర్), ఇషాన్ కిషన్ (వికెట్ కీపర్), రవిచంద్రన్ అశ్విన్, రవీంద్ర జడేజా, అక్షరుల్ పట్కూర్, అక్షరుల్ ఠాకూర్, మో. సిరాజ్, ముఖేష్ కుమార్, జయదేవ్ ఉనద్కత్, నవదీప్ సైనీ.","pubDate":"2023-07-11 19:23:42","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Telugu"},{"title":"Hasaranga, Gardner win ICC 'Player of the Month' award","link":"https://www.thehindu.com/sport/cricket/hasaranga-gardner-win-icc-player-of-the-month-award/article67069257.ece","keywords":null,"creator":null,"video_url":null,"description":"Hasaranga clinched the award following his record-breaking feats at the World Cup Qualifier games in Zimbabwe","content":"Sri Lanka spinner Wanindu Hasaranga and Australian women's team all-rounder Ashleigh Gardner were on Tuesday named ICC's 'Player of the Month' for their impressive performances in June. Hasaranga clinched the award following his record-breaking feats at the World Cup Qualifier games in Zimbabwe. Women's Ashes hero Ashleigh Gardner becomes the first player to win three Player-of-the-Month accolades. Both players were selected as the standout performers following a vote conducted among a specialist panel comprising ICC Hall of Famers, former international players, media representatives and global cricket fans registered at icc-cricket.com, who had been voting since the nominees were announced last week. With 26 wickets at an average of 10 per scalp during the calendar month, Hasaranga enjoyed several highlights during the prolific period. Heading into the Qualifier as one of the key threats in a strong Sri Lankan lineup, the spinner started in fine fashion. Claiming six wickets in the tournament opener against the UAE, and following up with 5/13 and 5/79 against Oman and Ireland respectively, Hasaranga became the first spinner in history to take three consecutive five-wicket hauls in ODI cricket, setting Sri Lanka on course for qualification to the ICC Men's Cricket World Cup in India which starts on October 5. \"It (award) comes at an important moment for Sri Lanka Cricket, after we made it to the Cricket World Cup in India. I am privileged and honoured to have been chosen as the ICC Men's Player of the Month,\" Hasaranga was quoted as saying in an ICC release. Hasaranga becomes the first Sri Lanka player to win the award since Prabath Jayasuriya in July 2022. Hasaranga emerged victorious from a strong field of candidates including another star performer at the Qualifier, Zimbabwe's Sean Williams, and the Player of the Match from the ICC World Test Championship Final, Australia's Travis Head. Gardner celebrated another prize after driving Australia to early success in the ongoing Women's Ashes series. Trent Bridge was the stage of Gardner's success, most notably with the ball, spinning Australia to a comfortable 89-run win to begin with a Test win. She followed up a valuable 40 in Australia's first innings with a four-wicket spell to help maintain a slender advantage over the hosts. Despite failing with the bat in Australia's reply, Gardner's sensational off-spin was the difference. Incredible figures of eight for 66 -- the best figures for Australia in a women’s Test -- included all five wickets to fall on the final day. “To win an Ashes Test match at Trent Bridge was a special moment for our team and I’m happy I was able to contribute towards the win. Winning a Test match overseas is one of the biggest challenges in cricket, it’s certainly a game that we will remember for a long time to come.” Gardner won her third Player-of-the-Month crown by overcoming fellow nominees Tammy Beaumont of England and Hayley Matthews of the West Indies.","pubDate":"2023-07-11 19:20:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Will Young hits century on Nottinghamshire debut to frustrate leaders Surrey","link":"https://www.watfordobserver.co.uk/sport/national/23649222.will-young-hits-century-nottinghamshire-debut-frustrate-leaders-surrey/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The New Zealand international is on a three-match contract at the county","content":"The New Zealand international, who is on a three-match contract with the Trent Bridge outfit, provided immediate value with a fluent knock of 106 not out that guided them to 248 for five at the close, trailing Surrey by 107. Young shared a second-wicket partnership of 134 with Haseeb Hameed, who hit 67, while Surrey’s Jamie Overton took two wickets on his return to bowling action for the first time this summer after recovering from a back injury. CLOSE | Nottinghamshire complete day two on 248/5 and will continue to chase 355 set by Surrey. Young ends the evening session at 106*, with Hutton alongside him at the crease. Watch highlights of 👉 — Nottinghamshire CCC (@TrentBridge) Surrey had earlier posted 355 all out in their first innings, with Nottinghamshire all-rounder Lyndon James picking up the last two wickets to register career-best figures of six for 74. Tom Westley’s 28th first-class hundred and his century partnership with Paul Walter rescued Essex from a poor start at Blackpool before a late fightback by Lancashire saw the visitors bowled out for 282. Skipper Westley made 135, his third century of the season, with Walter eventually out for 76. Tom Bailey, with six for 59, led a good reply by Lancashire, who closed on 37 for one to be 245 behind. Double century for Rob Yates! The Warwickshire opener reaches first-class high-score with a four — LV= Insurance County Championship (@CountyChamp) Rob Yates compiled a double century to put Warwickshire in a commanding position against Kent at Canterbury. The visitors declared their first innings on 549 for seven, a lead of 378, before reducing Kent to 55 for one. Yates hit his highest first-class score of 228 not out, with 23 fours and a six, having batted for nearly nine hours, while Australia’s Glenn Maxwell made 81 in his first Championship appearance for four years. Chris Rushworth bowled Tawanda Muyeye for a duck early in Kent’s second innings, with the hosts ailing 323 runs adrift. 🗞️ | MIDDLESEX V NORTHAMPTONSHIRE | MATCH REPORTRead all about the second day of our clash against Northamptonshire at Merchant Taylors' School. FULL STORY ⬇️ | — Middlesex Cricket (@Middlesex_CCC) Ryan Higgins struck a sixth half-century of the season to guide Middlesex to only their second batting bonus point of the campaign and a first-innings lead over Northamptonshire in the Division One basement battle at Merchant Taylors’ School. Higgins made 64 not out to steady the ship from 127 for five to a total of 277, which edged them 58 in front. Mark Stoneman contributed 51, while Northamptonshire off-spinner Rob Keogh returning three for 52 and Ben Sanderson three for 77. Returning to make an impact with the ball when Northamptonshire batted again, Higgins removing both Ricardo Vasconcelos (22) and Justin Broad (five) as the visitors finished on 55 for two. James Rew became Somerset’s youngest double-centurion in first-class cricket as Somerset took control against Hampshire at Taunton. The 19-year-old extended his overnight score of 77 to 221 before being last man out in his side’s first innings total of 500. Kasey Aldridge (88) and Dom Bess (54) also contributed to Somerset’s impressive recovery from 80 for five before Hampshire limped to 58 for two at close. Alex Lees scores Durham first-class best of 195 as we dominate day 2 at Seat Unique Riverside. — Durham Cricket (@DurhamCricket) In Division Two, Alex Lees scored his third century in as many innings to guide leaders Durham into a strong position against Gloucestershire at Chester-le-Street. Lees anchored the innings with a flawless 195, his highest score as a Durham player, while Graham Clark made 82 after the hosts were reduced to 109 for four in reply to Gloucestershire’s 316. Brydon Carse finished the day unbeaten on 60 in Durham’s 433 for eight, which gave them a 117-run lead. Opener Finlay Bean hit a career-best 135 to consolidate Yorkshire’s position against Worcestershire at a showery New Road. The 21-year-old, dropped twice on the opening day, put on 177 with Adam Lyth (79) – Yorkshire’s best opening stand for seven years. 🗞️ The report from day two against Yorkshire — Worcestershire CCC (@WorcsCCC) Worcestershire fought back, with seamer Adam Finch taking five wickets for 100, but Yorkshire maintained their grip after Matthew Fisher and Ben Coad dismissed both openers as the hosts finished 46 for two. On another rain-affected day in Cardiff, Glamorgan lost captain David Lloyd for six on his return to action, but steadied the ship to reach 54 for one at close against second-placed Leicestershire. Lloyd – soon to be leaving the Welsh capital – was bowled by Matt Salisbury before 32 from Zain-ul-Hassan as part of a 44-run partnership with Sam Northeast restored the hosts’ composure. Derbyshire wicketkeeper Brooke Guest hit an unbeaten 80 to frustrate Sussex’s promotion hopes at a rain-hit Hove as his side reached 212 for three in reply to Sussex’s 402, trailing by 190.","pubDate":"2023-07-11 19:12:25","image_url":"https://www.watfordobserver.co.uk/resources/images/16989832/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Younguns not throwin’ away their shots at top","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/12/younguns-not-throwin-away-their-shots-at-top-2593804.html","keywords":null,"creator":null,"video_url":null,"description":"One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. CHENNAI: After getting bowled by 18-year-old Marufa Akter for a duck in the first T20I, Shafali Verma changed the gear of her innings by smashing the Bangladesh pacer for three back-to-back fours in the second T20I. One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. Even at a crucial juncture in the match for Bangladesh, 18-year-old Rabeya Khan dismissed Jemimah Rodrigues before she could get going. For India, Verma, and debutants from the series, Minnu Mani and B Anusha, shared six wickets between themselves, helping India seal the T20I series. Given how most of the teams are going through a transition, where bringing young players is a necessity, we are going to witness more teenagers going through the ranks. This is not just with the likes of India and Bangladesh. Recently, Sri Lanka beat New Zealand to win the ODI series for the first time. Even when the majority of the contribution came from their captain Chamari Athapaththu, 17-year-old Vishmi Gunarathne chipped in with her maiden half-century. Pakistan’s 18-year-old Ayesha Naseem is considered one of the biggest hitters in the game. Amy Hunter, 17 years old, has been a regular in Ireland’s senior side. England’s Lauren Filer, Australia’s Phoebe Litchfield, the list just goes on. Most of these players are from the U19 World Cup’s class of 2023. And by the time the next U19 World Cup rolls up in 2025, the list will swell even more. Brief scores: India 95/8 (Verma 19, Khatun 3-21) bt Bangladesh 87 (N Sultana 38, Sharma 3-12, Verma 3-15).","content":"CHENNAI: After getting bowled by 18-year-old Marufa Akter for a duck in the first T20I, Shafali Verma changed the gear of her innings by smashing the Bangladesh pacer for three back-to-back fours in the second T20I. One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. Even at a crucial juncture in the match for Bangladesh, 18-year-old Rabeya Khan dismissed Jemimah Rodrigues before she could get going. For India, Verma, and debutants from the series, Minnu Mani and B Anusha, shared six wickets between themselves, helping India seal the T20I series. Given how most of the teams are going through a transition, where bringing young players is a necessity, we are going to witness more teenagers going through the ranks. This is not just with the likes of India and Bangladesh. Recently, Sri Lanka beat New Zealand to win the ODI series for the first time. Even when the majority of the contribution came from their captain Chamari Athapaththu, 17-year-old Vishmi Gunarathne chipped in with her maiden half-century. Pakistan’s 18-year-old Ayesha Naseem is considered one of the biggest hitters in the game. Amy Hunter, 17 years old, has been a regular in Ireland’s senior side. England’s Lauren Filer, Australia’s Phoebe Litchfield, the list just goes on. Most of these players are from the U19 World Cup’s class of 2023. And by the time the next U19 World Cup rolls up in 2025, the list will swell even more. : India 95/8 (Verma 19, Khatun 3-21) bt Bangladesh 87 (N Sultana 38, Sharma 3-12, Verma 3-15).","pubDate":"2023-07-11 18:57:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"BAN vs AFG: छा गए शोरिफुल इस्लाम, बांग्लादेश ने अफगानिस्तान को क्लीन स्वीप करने से रोका","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/afghanistan-won-the-3-match-odi-series-beat-bangladesh-by-2-1/articleshow/101677239.cms","keywords":null,"creator":null,"video_url":null,"description":"BAN vs AFG: अफगानिस्तान पहले दोनों वनडे मैच जीतकर श्रृंखला अपने नाम कर चुका था। अब इन दोनों देशों के बीच दो टी-20 मैचों की श्रृंखला खेली जाएगी।","content":"बाएं हाथ के तेज गेंदबाज शोरिफुल इस्लाम के करियर के सर्वश्रेष्ठ प्रदर्शन और कप्तान लिटन दास के नाबाद अर्धशतक की मदद से बांग्लादेश ने मंगलवार को यहां तीसरे एकदिवसीय अंतरराष्ट्रीय क्रिकेट मैच में सात विकेट से बड़ी जीत दर्ज करके अफगानिस्तान की तीन मैचों की श्रृंखला में क्लीन स्वीप करने की उम्मीदों पर पानी फेर दिया। शोरिफुल ने 21 रन देकर चार विकेट लिए और अफगानिस्तान को 45.2 ओवर में 126 रन पर समेटने में अहम भूमिका निभाई। अफगानिस्तान के केवल चार बल्लेबाज दोहरे अंक में पहुंचे जिनमें अजमुतुल्लाह ओमारजई ने सर्वाधिक 56 रन बनाए बांग्लादेश की तरफ से शोरिफुल के अलावा तासकीन अहमद और ताइजुल इस्लाम ने दो-दो विकेट लिए। अनुभवी शाकिब अल हसन ने किफायती गेंदबाजी करते हुए 10 ओवर में 13 रन देकर एक विकेट हासिल किया। बांग्लादेश की शुरुआत भी अच्छी नहीं रही और उसने 28 रन पर दो विकेट गंवा दिए। लिटन दास (नाबाद 53) और शाकिब (39) ने तीसरे विकेट के लिए 61 रन की साझेदारी करके टीम को लक्ष्य के करीब पहुंचाया। तौहीद हिरदोय ने नाबाद 22 रन का योगदान दिया जिससे बांग्लादेश में 23.3 ओवर में तीन विकेट पर 129 रन बनाकर आसान जीत दर्ज की।","pubDate":"2023-07-11 18:53:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies vs India: Caribbean Challenge begins","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/12/west-indies-vs-india-caribbean-challenge-begins-2593800.html","keywords":null,"creator":null,"video_url":null,"description":"With their WTC cycle set to get underway, Rohit and Co. will be looking to put up a strong show against the West Indies CHENNAI: Let’s put it straight. The last time India lost a Test series in West Indies was two decades ago. While they have threatened and competed in every series they have not beaten India in a Test match since 2002. And at a time when their non-qualification for the upcoming 2023 ODI World Cup in India has been a massive talking point, they will have to play extremely well to end up on the right side of the result in at least one of the matches in the two-Test series that begins in Dominica on Wednesday. However, there is hope. For this is probably the first time in almost a decade where India have looked vulnerable, inexperienced and beatable — all at the same time. This series against Rohit Sharma & Co. comes as an opportunity for the Caribbean side led by Kraigg Brathwaite. More than a decade since the previous generation stalwarts walked into the sunset, the cycle seem to be coming back with the quite a few of them in their mid and late 30s, including Rohit Sharma, Virat Kohli, Ajinkya Rahane, R Ashwin and Ravindra Jadeja. Which is why, transition is the buzz word in Indian cricket at the moment. They will have Shubman Gill and Yashasvi Jaiswal in the top-order. Either KS Bharat or Ishan Kishan is going to be in the middle-order. Their pace attack, barring Mohammed Siraj, do not have much international experience. To sum it all up, it is a phase where there are concerns as to whether West Indies pace attack featuring Kemar Roach, Alzarri Joseph, Jason Holder and Shanon Gabriel can break through the Indian batting with the Dukes ball. At the same time, there is a sense of excitement to see the next generation of players. Rahane, who himself has been on a comeback journey, is excited to see how the youngsters go. And with skipper Rohit confirming that Gill will bat at No. 3, Jaiswal is all set to open the batting for India. “Gill will play at No. 3 because Gill himself wants to play at No. 3. He discussed with Rahul (Dravid) that ‘I have played all my cricket at 3 and 4. I think I can do better for my team if I bat at No. 3’. And it is good for us too because it becomes an opening combination of left and right. So I think we will try to do this and hopefully this will go on for a long time,” Rohit told reporters in Dominica on Tuesday. West Indies, too, have their share of things to be excited about. Left-hand batter Kirk McKenzie has earned his maiden call-up, spinners Rahkeem Cornwall and Jomel Warrican have been recalled and their pace attack is as experienced as it could have been. Sure, the mood seems gloomy with the 50-over format, but there is nothing they can do about it at this point. They would rather want to focus on bringing some happy news to the Caribbean shores and what better way to put up a strong performance against India. The series could still end up 2-0 in favour of India. But there is hope, anticipation and excitement and a lot to look forward to. And that is all one could ask for on the first day of a Test series. Points to ponder As India takes on West Indies in the first Test at Dominica on Wednesday, a look at key talking points... What in store for veterans? Even as India enters transition, they will rely on Rohit Sharma, Ajinkya Rahane and Virat Kohli, all three in mid-30s. Will they be there to see through the upcoming cycle is a big question mark. With every innings and performance put under the lens, it will be interesting to see how the trio approach the tour and whether they are able to come out on top. The middle-order conundrum Through the previous WTC cycle, the middle-order with Rishabh Pant at the forefront was the key reason for India's success with the bat. However, the last six months have not been the same. While they are likely to have depth till 8/9 against a pace attack which has Kemar Roach, Jason Holder, Alzarri Joseph, etc, this Indian middle-order will be challenged. Can Windies seek resurgence? On paper, the Indian pace attack lacks experience. If there was ever a chance for the West Indies to make an impact, it is this. If their batting line-up, led by Kraigg Brathwaite, are able to challenge the bowlers and do something special, that could be the best medicine after the bitter fact they had to face, having missed the ODI World Cup qualification. West Indies vs India, 1st Test, Dominica Live on FanCode and DD Sports, 7.30 PM","content":"CHENNAI: Let’s put it straight. The last time India lost a Test series in West Indies was two decades ago. While they have threatened and competed in every series they have not beaten India in a Test match since 2002. And at a time when their non-qualification for the upcoming 2023 ODI World Cup in India has been a massive talking point, they will have to play extremely well to end up on the right side of the result in at least one of the matches in the two-Test series that begins in Dominica on Wednesday. However, there is hope. For this is probably the first time in almost a decade where India have looked vulnerable, inexperienced and beatable — all at the same time. This series against Rohit Sharma & Co. comes as an opportunity for the Caribbean side led by Kraigg Brathwaite. More than a decade since the previous generation stalwarts walked into the sunset, the cycle seem to be coming back with the quite a few of them in their mid and late 30s, including Rohit Sharma, Virat Kohli, Ajinkya Rahane, R Ashwin and Ravindra Jadeja. Which is why, transition is the buzz word in Indian cricket at the moment. They will have Shubman Gill and Yashasvi Jaiswal in the top-order. Either KS Bharat or Ishan Kishan is going to be in the middle-order. Their pace attack, barring Mohammed Siraj, do not have much international experience. To sum it all up, it is a phase where there are concerns as to whether West Indies pace attack featuring Kemar Roach, Alzarri Joseph, Jason Holder and Shanon Gabriel can break through the Indian batting with the Dukes ball. At the same time, there is a sense of excitement to see the next generation of players. Rahane, who himself has been on a comeback journey, is excited to see how the youngsters go. And with skipper Rohit confirming that Gill will bat at No. 3, Jaiswal is all set to open the batting for India. “Gill will play at No. 3 because Gill himself wants to play at No. 3. He discussed with Rahul (Dravid) that ‘I have played all my cricket at 3 and 4. I think I can do better for my team if I bat at No. 3’. And it is good for us too because it becomes an opening combination of left and right. So I think we will try to do this and hopefully this will go on for a long time,” Rohit told reporters in Dominica on Tuesday. West Indies, too, have their share of things to be excited about. Left-hand batter Kirk McKenzie has earned his maiden call-up, spinners Rahkeem Cornwall and Jomel Warrican have been recalled and their pace attack is as experienced as it could have been. Sure, the mood seems gloomy with the 50-over format, but there is nothing they can do about it at this point. They would rather want to focus on bringing some happy news to the Caribbean shores and what better way to put up a strong performance against India. The series could still end up 2-0 in favour of India. But there is hope, anticipation and excitement and a lot to look forward to. And that is all one could ask for on the first day of a Test series. As India takes on West Indies in the first Test at Dominica on Wednesday, a look at key talking points... Even as India enters transition, they will rely on Rohit Sharma, Ajinkya Rahane and Virat Kohli, all three in mid-30s. Will they be there to see through the upcoming cycle is a big question mark. With every innings and performance put under the lens, it will be interesting to see how the trio approach the tour and whether they are able to come out on top. Through the previous WTC cycle, the middle-order with Rishabh Pant at the forefront was the key reason for India's success with the bat. However, the last six months have not been the same. While they are likely to have depth till 8/9 against a pace attack which has Kemar Roach, Jason Holder, Alzarri Joseph, etc, this Indian middle-order will be challenged. On paper, the Indian pace attack lacks experience. If there was ever a chance for the West Indies to make an impact, it is this. If their batting line-up, led by Kraigg Brathwaite, are able to challenge the bowlers and do something special, that could be the best medicine after the bitter fact they had to face, having missed the ODI World Cup qualification.","pubDate":"2023-07-11 18:53:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"WI vs IND: तीसरे नंबर पर शुभमन गिल, ओपनिंग में लेफ्ट-राइट कॉम्बिनेशन, पहले टेस्ट के लिए रोहित शर्मा के 3 बड़े ऐलान","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/wi-vs-ind-shubman-gill-will-bat-at-number-three-left-right-opening-combination-in-opening-rohit-sharma-major-announcements/articleshow/101677344.cms","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs India: भारतीय टीम वेस्टइंडीज के खिलाफ बुधवार से शुरू हो रही दो टेस्ट मैचों की श्रृंखला के जरिए बदलाव के दौर की शुरूआत करेगी। विंडसर पार्क ने पिछले छह साल में एक भी टेस्ट मैच की मेजबानी नहीं की है, लेकिन यह एक ऐसा फॉर्मेट है, जहां कैरेबियाई टीम ने बढ़िया किया है।","content":"वेस्टइंडीज के खिलाफ आज से शुरू होने जा रहे पहले टेस्ट के लिए टीम इंडिया में कई बड़े बदलाव देखने को मिलेंगे। भारतीय कप्तान रोहित शर्मा ने मैच की पूर्व संध्या पर पत्रकारों से बात करते हुए अपनी स्ट्रैटजी का खुलासा किया। रोहित ने बताया कि युवा बल्लेबाज शुभमन गिल तीसरे नंबर पर बैटिंग करेंगे। साथ ही ओपनिंग में राइट-लेफ्ट कॉम्बिनेशन होगा। साथ ही साथ प्लेइंग इलेवन में दो स्पिनर्स खेलेंगे। रोहित शर्मा ने प्रेस कॉन्फ्रेंस में कहा, 'विकेट को देखते हुए मेरा मानना है कि हम दो स्पिनर्स और तीन सीमर्स के साथ खेलेंगे। जहां तक बल्लेबाजी की बात है, शुभमन गिल तीसरे नंबर पर आएंगे। वह इसी पोजिशन पर खेलना चाहते हैं। गिल ने कोच राहुल द्रविड़ से कहा कि उन्होंने अपने पूरे करियर में नंबर 3 और 4 पर खेला है।' रोहित शर्मा ने यह भी कहा कि वह लंबे समय के बाद बाएं-दाएं ओपनिंग संयोजन से खुश हैं। शर्मा की माने तो, 'यह भारतीय क्रिकेट के लिए रोमांचक समय होगा, हमें खिलाड़ी मिल गया है और उम्मीद है कि वह लंबे समय तक अच्छा प्रदर्शन करेगा। हम लंबे समय से बाएं हाथ के सलामी बल्लेबाज के लिए बेताब थे।' यशस्वी जयसवाल के भारत के लिए बाएं हाथ के सलामी बल्लेबाज होने की पूरी संभावना है। चेतेश्वर पुजारा के बाहर होने से भारतीय टॉप ऑर्डर में एक स्पॉट बना है। मुंबई के बेहद प्रतिभाशाली बाएं हाथ के बल्लेबाज यशस्वी जायसवाल को उम्मीद होगी कि वह अपने 'नाम' के अनुरूप प्रदर्शन करेंगे। सिर्फ 19 टेस्ट पुराने मोहम्मद सिराज के नेतृत्व में भारत का पांच सदस्यीय तेज गेंदबाजी अटैक वेस्टइंडीज के तेज आक्रमण की तुलना में कमजोर नजर आता है। यह फिर से इस बात पर निर्भर करेगा कि वेस्टइंडीज रविचंद्रन अश्विन (474 विकेट) और रविंद्र जड़ेजा (268) की चालाकी और कलात्मकता का मुकाबला कैसे करता है, जिन्होंने मिलकर लगभग 750 टेस्ट विकेट चटकाए हैं। इन तीनों के अलावा शार्दुल ठाकुर का खेलना तय है, ऐसे में मुकेश कुमार, जयदेव उनादकट और नवदीप सैनी में से किसी एक को ही मौका मिलेगा।","pubDate":"2023-07-11 18:31:06","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aussies keep eyes on winning women's Ashes, not drawing","link":"https://thewest.com.au/sport/cricket/aussies-keep-eyes-on-winning-womens-ashes-not-drawing-c-11251361","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia's women insist their goal remains winning the Ashes and not just drawing to retain them after back-to-back losses in the Twenty20 component.","content":"Tahlia McGrath insists Australia are still determined to win the Ashes and not just retain them, despite suffering their first back-to-back losses in any format in almost six years. Australia's grip on the multi-form Ashes has loosened in recent days, after winning the Test match and series-opening T20 to take a 6-0 points lead. However, defeats to England at The Oval and Lord's have reduced that scoreline to 6-4, with two points available for each of the remaining three ODIs. As holders of the trophy, Australia can still retain the Ashes with a victory in the opening ODI on Wednesday night in Bristol to make it 8-4 with two matches to play. But the tourists have long been adamant they have no interest in only drawing the series, after walking away with an empty feeling after doing likewise in 2016-17. Instead, they are determined to win two of the three ODIs to ensure they walk away outright winners. \"We just want to win the Ashes. That's what we came here to do,\" vice-captain McGrath said. \"I don't think (drawing) is enough. We want to win every game of cricket. First and foremost is retaining the Ashes, but we want to win these three games coming up. \"Winning 8-8 doesn't sound as good as winning them outright. The focus is on winning tomorrow, but we want to win outright.\" Australia's losses in the T20s marked their first back-to-back defeats in any formats since November 2017. But they will walk out into their preferred format on Wednesday, having dominated the 50-over game in particular over the past five years. Their record in ODIs stands at an imposing 41-1 in completed games since the start of 2018, with the team currently on a 15-game winning streak. \"Part of the reason we have been so successful in the past is you have so much more time in ODIs,\" McGrath said. \"You can build your innings a bit more. We have had players cash in and score those big hundreds with players supporting them. \"From a bowling point of view you can build a bit more pressure and work batters out a bit more. \"We have been consistent in that format, and players coming in know exactly what they need to do for the team.\" Australia could make a change to their team for Wednesday's clash, with Phoebe Litchfield, Grace Harris and Heather Graham likely to be fighting it out for one spot. Litchfield did open in Australia's last ODI matches in January, but Alyssa Healy has since returned to partner Beth Mooney at the top of the order. Sign up for our emails","pubDate":"2023-07-11 20:02:34","image_url":"https://images.thewest.com.au/publication/C-11251361/78df4874e5b1588e4dd6c7b71437e16fc799136a-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park?","link":"https://thesportsrush.com/cricket-news-roseau-dominica-time-what-is-the-time-difference-between-india-and-windsor-park/","keywords":["Cricket","India tour of West Indies 2023","Windsor Park"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Test match cricket is all set to return to the island nation of Dominica after more than a six-year gap. The first of the two-match series of India’s tour of West Indies 2023 commences in the city of Roseau from tomorrow (Wednesday) onwards. Roseau’s Windsor Park last hosted a Test in the year 2017 when… The post Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park? appeared first on The SportsRush.","content":"Test match cricket is all set to return to the island nation of Dominica after more than a six-year gap. The first of the two-match series of India’s tour of West Indies 2023 commences in the city of Roseau from tomorrow (Wednesday) onwards. Roseau’s Windsor Park last hosted a Test in the year 2017 when the hosts had squared-off against Pakistan. As for team India, this Caribbean city will mark their return back after more than a decade, with the Asian country having last played here in the year 2011. As has been the case with Indian cricket fans whenever Test matches take place in this part of the world, they will have to yet again make temporary changes to their sleeping pattern with the action set to take place till way past midnight. Roseau Dominica Time Difference With India The city of Roseau is 9 hours and 30 minutes behind the Indian Standard Time. Dominica observes the Atlantic Standard Time throughout the year, which is a result of a subtraction of four hours from Coordinated Universal Time (UTC). India, on the other hand, observes the Indian Standard Time (IST), which is 5 hours and 30 minutes ahead of the UTC. For e.g. If the present time in India as of July 12 (Wednesday) is 12:30 AM, then the corresponding time in the city of Roseau in Dominica would be 03:00 PM with the date being July 11 (Tuesday). As far as the first Test match between India and West Indies is concerned, the same will begin from 10:00 AM onwards (local time), or 07:30 PM (IST) tomorrow. How Many Time Zones Are There In The Caribbean? The Caribbean region is divided into two time zones – Eastern and Atlantic. Also, there are five nations in the region which also observe the daylight saving. They are Bahamas, Cuba, Turks & Caicos islands, Haiti and Bermuda. While the Atlantic Standard Time (as in Dominica) is four hours behind the UTC, the Eastern Standard Time is five hours behind the UTC. The post Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park? appeared first on The SportsRush.","pubDate":"2023-07-11 19:58:21","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Aussies will find it hard to get over the line: Woakes","link":"https://thewest.com.au/sport/cricket/aussies-will-find-it-hard-to-get-over-the-line-woakes-c-11251245","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"England's Headingley matchwinner Chris Woakes has insisted Australia will feel the pressure to clinch the Ashes despite being 2-1 ahead in the series","content":"Chris Woakes has sought to turn the pressure on to Australia despite their 2-1 Ashes lead by insisting the tourists will find it hard to get a series win over the line. Australia need only win at Old Trafford next week to retain the Ashes but Pat Cummins' men want to be the first Australian side to win in England for two decades. England, meanwhile, insist they can regain the urn by coming back from 2-0 down to win 3-2, which they have never previously done. \"In our dressing room the belief is we can win 3-2, I think it's always been there,\" the allrounder said. \"You don't want to look too far ahead, you have to play what's in front of you, each ball, each day, each session, each Test match as it comes. \"I'd imagine when you're so close to getting something, the harder it gets, and I'm sure the Aussies will be feeling that now. \"Once you get so close to something, it's actually hard to get that over the line, isn't it? We've got to turn up in Manchester and put in another performance. \"They're an extremely good side and we're going to have to be at our best to beat them again.\" Woakes admitted his triumphant return to Ashes cricket left him \"quite emotional\" after accepting his time as a Test player might have come to an end. The 34-year-old stepped up with bat and ball after being thrust into last week's must-win clash at Headingley, 16 months after he last donned his England whites on the ill-fated tour of the West Indies. \"It's quite emotional actually. You sometimes think the ship has sailed, of course you do,\" he said of his match-winning return. \"You do wonder, especially when the team was going so well last summer and I wasn't involved. It's hard. \"Sometimes you don't always get the rewards that you deserve, but I felt like I played well in this game and got the rewards I deserve.\" Sign up for our emails","pubDate":"2023-07-11 19:33:21","image_url":"https://images.thewest.com.au/publication/C-11251245/2215b7f02df9c617f494bfdcdc663e7e08ef06a6-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"India vs West Indies Test series: నేటి నుండి భారత్, వెస్టిండీస్ మొదటి టెస్ట్ మ్యాచ్ ప్రారంభం.. ఎప్పుడు, ఏ సమయం, ఏ ఓటీటీ ప్లాట్ ఫాంలో ఫ్రీగా టెస్ట్ మ్యాచ్ చూడచ్చో తెలుసుకోండి..","link":"https://telugu.latestly.com/sports/cricket/india-and-west-indies-first-test-match-starts-from-today-know-when-what-time-on-which-ott-platform-101508.html","keywords":null,"creator":null,"video_url":null,"description":"నేటి నుంచి భారత్, వెస్టిండీస్ మధ్య టెస్టు సిరీస్ (ఇండ్ Vs WI) ప్రారంభం కానుంది. రెండు టెస్టుల సిరీస్‌లో తొలి టెస్టు జూలై 12 నుంచి జరగనుంది. ప్రపంచ టెస్టు ఛాంపియన్‌షిప్ (డబ్ల్యూటీసీ)లో కెప్టెన్ రోహిత్ శర్మ నేతృత్వంలోని జట్టు ఓడిపోయిన తర్వాత ఇదే తొలి టెస్టు సిరీస్. వెస్టిండీస్‌తో జరిగే టెస్ట్ సిరీస్‌లో కొత్త బౌలర్లు కమాండ్‌ని పొందడం చూడవచ్చు.","content":"నేటి నుంచి భారత్, వెస్టిండీస్ మధ్య టెస్టు సిరీస్ (ఇండ్ Vs WI) ప్రారంభం కానుంది. రెండు టెస్టుల సిరీస్‌లో తొలి టెస్టు జూలై 12 నుంచి జరగనుంది. ప్రపంచ టెస్టు ఛాంపియన్‌షిప్ (డబ్ల్యూటీసీ)లో కెప్టెన్ రోహిత్ శర్మ నేతృత్వంలోని జట్టు ఓడిపోయిన తర్వాత ఇదే తొలి టెస్టు సిరీస్. వెస్టిండీస్‌తో జరిగే టెస్ట్ సిరీస్‌లో కొత్త బౌలర్లు కమాండ్‌ని పొందడం చూడవచ్చు. డొమినికా వేదికగా తొలి టెస్టు మ్యాచ్ జరగనుంది మొదటి టెస్ట్ డొమినికాలో ఆడుతుంది. ఇప్పటికే ప్రపంచకప్‌ నుంచి నిష్క్రమించిన వెస్టిండీస్‌పై రోహిత్ శర్మ నేతృత్వంలోని భారత జట్టు కరీబియన్ గడ్డపై సత్తా చాటేందుకు సిద్ధమైంది. ఈ సిరీస్‌లో ఛతేశ్వర్‌ పుజారాకు చోటు దక్కలేదు. ఇలాంటి పరిస్థితుల్లో రితురాజ్ గైక్వాడ్, యశస్వి జైస్వాల్‌లలో ఎవరికి స్థానం దక్కుతుందనేది ఆసక్తికరంగా మారింది. టెస్ట్ మ్యాచ్ ఎప్పుడు ప్రారంభమవుతుంది? భారత్, వెస్టిండీస్మ ధ్య జరగనున్న తొలి టెస్టు మ్యాచ్ రేపటి నుంచి అంటే బుధవారం నుంచి ప్రారంభం కానుంది. ఈ మ్యాచ్ భారత కాలమానం ప్రకారం రాత్రి 7.30 గంటలకు ప్రారంభమవుతుంది. ఒక రోజు ఆట దాదాపు 8 గంటల పాటు సాగుతుంది. అటువంటి పరిస్థితిలో, ఒక రోజు ఆట తెల్లవారుజామున 3:30 గంటలకు ముగుస్తుంది. మీరు టెస్ట్ సిరీస్‌ను ఎక్కడ చూడవచ్చు? భారత్, వెస్టిండీస్ మధ్య జరిగే ఈ టెస్ట్ సిరీస్‌ను అభిమానులు పూర్తిగా ఉచితంగా వీక్షించవచ్చు. అభిమానులు Hotstar లేదా Sony Livకి సబ్‌స్క్రిప్షన్ చెల్లించే బదులు Jio సినిమాలో వెస్టిండీస్, భారతదేశం మధ్య టెస్ట్ సిరీస్‌ను ఉచితంగా చూడవచ్చు. వెస్టిండీస్ పర్యటనలో టెస్టు కోసం భారత జట్టు రోహిత్ శర్మ (కెప్టెన్), శుభ్‌మన్ గిల్, రుతురాజ్ గైక్వాడ్, విరాట్ కోహ్లి, యశస్వి జైస్వాల్, అజింక్యా రహానే (వైస్ కెప్టెన్), కెఎస్ భరత్ (వికెట్ కీపర్), ఇషాన్ కిషన్ (వికెట్ కీపర్), రవిచంద్రన్ అశ్విన్, రవీంద్ర జడేజా, అక్షరుల్ పట్కూర్, అక్షరుల్ ఠాకూర్, మో. సిరాజ్, ముఖేష్ కుమార్, జయదేవ్ ఉనద్కత్, నవదీప్ సైనీ.","pubDate":"2023-07-11 19:23:42","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Telugu"},{"title":"Hasaranga, Gardner win ICC 'Player of the Month' award","link":"https://www.thehindu.com/sport/cricket/hasaranga-gardner-win-icc-player-of-the-month-award/article67069257.ece","keywords":null,"creator":null,"video_url":null,"description":"Hasaranga clinched the award following his record-breaking feats at the World Cup Qualifier games in Zimbabwe","content":"Sri Lanka spinner Wanindu Hasaranga and Australian women's team all-rounder Ashleigh Gardner were on Tuesday named ICC's 'Player of the Month' for their impressive performances in June. Hasaranga clinched the award following his record-breaking feats at the World Cup Qualifier games in Zimbabwe. Women's Ashes hero Ashleigh Gardner becomes the first player to win three Player-of-the-Month accolades. Both players were selected as the standout performers following a vote conducted among a specialist panel comprising ICC Hall of Famers, former international players, media representatives and global cricket fans registered at icc-cricket.com, who had been voting since the nominees were announced last week. With 26 wickets at an average of 10 per scalp during the calendar month, Hasaranga enjoyed several highlights during the prolific period. Heading into the Qualifier as one of the key threats in a strong Sri Lankan lineup, the spinner started in fine fashion. Claiming six wickets in the tournament opener against the UAE, and following up with 5/13 and 5/79 against Oman and Ireland respectively, Hasaranga became the first spinner in history to take three consecutive five-wicket hauls in ODI cricket, setting Sri Lanka on course for qualification to the ICC Men's Cricket World Cup in India which starts on October 5. \"It (award) comes at an important moment for Sri Lanka Cricket, after we made it to the Cricket World Cup in India. I am privileged and honoured to have been chosen as the ICC Men's Player of the Month,\" Hasaranga was quoted as saying in an ICC release. Hasaranga becomes the first Sri Lanka player to win the award since Prabath Jayasuriya in July 2022. Hasaranga emerged victorious from a strong field of candidates including another star performer at the Qualifier, Zimbabwe's Sean Williams, and the Player of the Match from the ICC World Test Championship Final, Australia's Travis Head. Gardner celebrated another prize after driving Australia to early success in the ongoing Women's Ashes series. Trent Bridge was the stage of Gardner's success, most notably with the ball, spinning Australia to a comfortable 89-run win to begin with a Test win. She followed up a valuable 40 in Australia's first innings with a four-wicket spell to help maintain a slender advantage over the hosts. Despite failing with the bat in Australia's reply, Gardner's sensational off-spin was the difference. Incredible figures of eight for 66 -- the best figures for Australia in a women’s Test -- included all five wickets to fall on the final day. “To win an Ashes Test match at Trent Bridge was a special moment for our team and I’m happy I was able to contribute towards the win. Winning a Test match overseas is one of the biggest challenges in cricket, it’s certainly a game that we will remember for a long time to come.” Gardner won her third Player-of-the-Month crown by overcoming fellow nominees Tammy Beaumont of England and Hayley Matthews of the West Indies.","pubDate":"2023-07-11 19:20:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Will Young hits century on Nottinghamshire debut to frustrate leaders Surrey","link":"https://www.watfordobserver.co.uk/sport/national/23649222.will-young-hits-century-nottinghamshire-debut-frustrate-leaders-surrey/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The New Zealand international is on a three-match contract at the county","content":"The New Zealand international, who is on a three-match contract with the Trent Bridge outfit, provided immediate value with a fluent knock of 106 not out that guided them to 248 for five at the close, trailing Surrey by 107. Young shared a second-wicket partnership of 134 with Haseeb Hameed, who hit 67, while Surrey’s Jamie Overton took two wickets on his return to bowling action for the first time this summer after recovering from a back injury. CLOSE | Nottinghamshire complete day two on 248/5 and will continue to chase 355 set by Surrey. Young ends the evening session at 106*, with Hutton alongside him at the crease. Watch highlights of 👉 — Nottinghamshire CCC (@TrentBridge) Surrey had earlier posted 355 all out in their first innings, with Nottinghamshire all-rounder Lyndon James picking up the last two wickets to register career-best figures of six for 74. Tom Westley’s 28th first-class hundred and his century partnership with Paul Walter rescued Essex from a poor start at Blackpool before a late fightback by Lancashire saw the visitors bowled out for 282. Skipper Westley made 135, his third century of the season, with Walter eventually out for 76. Tom Bailey, with six for 59, led a good reply by Lancashire, who closed on 37 for one to be 245 behind. Double century for Rob Yates! The Warwickshire opener reaches first-class high-score with a four — LV= Insurance County Championship (@CountyChamp) Rob Yates compiled a double century to put Warwickshire in a commanding position against Kent at Canterbury. The visitors declared their first innings on 549 for seven, a lead of 378, before reducing Kent to 55 for one. Yates hit his highest first-class score of 228 not out, with 23 fours and a six, having batted for nearly nine hours, while Australia’s Glenn Maxwell made 81 in his first Championship appearance for four years. Chris Rushworth bowled Tawanda Muyeye for a duck early in Kent’s second innings, with the hosts ailing 323 runs adrift. 🗞️ | MIDDLESEX V NORTHAMPTONSHIRE | MATCH REPORTRead all about the second day of our clash against Northamptonshire at Merchant Taylors' School. FULL STORY ⬇️ | — Middlesex Cricket (@Middlesex_CCC) Ryan Higgins struck a sixth half-century of the season to guide Middlesex to only their second batting bonus point of the campaign and a first-innings lead over Northamptonshire in the Division One basement battle at Merchant Taylors’ School. Higgins made 64 not out to steady the ship from 127 for five to a total of 277, which edged them 58 in front. Mark Stoneman contributed 51, while Northamptonshire off-spinner Rob Keogh returning three for 52 and Ben Sanderson three for 77. Returning to make an impact with the ball when Northamptonshire batted again, Higgins removing both Ricardo Vasconcelos (22) and Justin Broad (five) as the visitors finished on 55 for two. James Rew became Somerset’s youngest double-centurion in first-class cricket as Somerset took control against Hampshire at Taunton. The 19-year-old extended his overnight score of 77 to 221 before being last man out in his side’s first innings total of 500. Kasey Aldridge (88) and Dom Bess (54) also contributed to Somerset’s impressive recovery from 80 for five before Hampshire limped to 58 for two at close. Alex Lees scores Durham first-class best of 195 as we dominate day 2 at Seat Unique Riverside. — Durham Cricket (@DurhamCricket) In Division Two, Alex Lees scored his third century in as many innings to guide leaders Durham into a strong position against Gloucestershire at Chester-le-Street. Lees anchored the innings with a flawless 195, his highest score as a Durham player, while Graham Clark made 82 after the hosts were reduced to 109 for four in reply to Gloucestershire’s 316. Brydon Carse finished the day unbeaten on 60 in Durham’s 433 for eight, which gave them a 117-run lead. Opener Finlay Bean hit a career-best 135 to consolidate Yorkshire’s position against Worcestershire at a showery New Road. The 21-year-old, dropped twice on the opening day, put on 177 with Adam Lyth (79) – Yorkshire’s best opening stand for seven years. 🗞️ The report from day two against Yorkshire — Worcestershire CCC (@WorcsCCC) Worcestershire fought back, with seamer Adam Finch taking five wickets for 100, but Yorkshire maintained their grip after Matthew Fisher and Ben Coad dismissed both openers as the hosts finished 46 for two. On another rain-affected day in Cardiff, Glamorgan lost captain David Lloyd for six on his return to action, but steadied the ship to reach 54 for one at close against second-placed Leicestershire. Lloyd – soon to be leaving the Welsh capital – was bowled by Matt Salisbury before 32 from Zain-ul-Hassan as part of a 44-run partnership with Sam Northeast restored the hosts’ composure. Derbyshire wicketkeeper Brooke Guest hit an unbeaten 80 to frustrate Sussex’s promotion hopes at a rain-hit Hove as his side reached 212 for three in reply to Sussex’s 402, trailing by 190.","pubDate":"2023-07-11 19:12:25","image_url":"https://www.watfordobserver.co.uk/resources/images/16989832/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Younguns not throwin’ away their shots at top","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/12/younguns-not-throwin-away-their-shots-at-top-2593804.html","keywords":null,"creator":null,"video_url":null,"description":"One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. CHENNAI: After getting bowled by 18-year-old Marufa Akter for a duck in the first T20I, Shafali Verma changed the gear of her innings by smashing the Bangladesh pacer for three back-to-back fours in the second T20I. One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. Even at a crucial juncture in the match for Bangladesh, 18-year-old Rabeya Khan dismissed Jemimah Rodrigues before she could get going. For India, Verma, and debutants from the series, Minnu Mani and B Anusha, shared six wickets between themselves, helping India seal the T20I series. Given how most of the teams are going through a transition, where bringing young players is a necessity, we are going to witness more teenagers going through the ranks. This is not just with the likes of India and Bangladesh. Recently, Sri Lanka beat New Zealand to win the ODI series for the first time. Even when the majority of the contribution came from their captain Chamari Athapaththu, 17-year-old Vishmi Gunarathne chipped in with her maiden half-century. Pakistan’s 18-year-old Ayesha Naseem is considered one of the biggest hitters in the game. Amy Hunter, 17 years old, has been a regular in Ireland’s senior side. England’s Lauren Filer, Australia’s Phoebe Litchfield, the list just goes on. Most of these players are from the U19 World Cup’s class of 2023. And by the time the next U19 World Cup rolls up in 2025, the list will swell even more. Brief scores: India 95/8 (Verma 19, Khatun 3-21) bt Bangladesh 87 (N Sultana 38, Sharma 3-12, Verma 3-15).","content":"CHENNAI: After getting bowled by 18-year-old Marufa Akter for a duck in the first T20I, Shafali Verma changed the gear of her innings by smashing the Bangladesh pacer for three back-to-back fours in the second T20I. One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. Even at a crucial juncture in the match for Bangladesh, 18-year-old Rabeya Khan dismissed Jemimah Rodrigues before she could get going. For India, Verma, and debutants from the series, Minnu Mani and B Anusha, shared six wickets between themselves, helping India seal the T20I series. Given how most of the teams are going through a transition, where bringing young players is a necessity, we are going to witness more teenagers going through the ranks. This is not just with the likes of India and Bangladesh. Recently, Sri Lanka beat New Zealand to win the ODI series for the first time. Even when the majority of the contribution came from their captain Chamari Athapaththu, 17-year-old Vishmi Gunarathne chipped in with her maiden half-century. Pakistan’s 18-year-old Ayesha Naseem is considered one of the biggest hitters in the game. Amy Hunter, 17 years old, has been a regular in Ireland’s senior side. England’s Lauren Filer, Australia’s Phoebe Litchfield, the list just goes on. Most of these players are from the U19 World Cup’s class of 2023. And by the time the next U19 World Cup rolls up in 2025, the list will swell even more. : India 95/8 (Verma 19, Khatun 3-21) bt Bangladesh 87 (N Sultana 38, Sharma 3-12, Verma 3-15).","pubDate":"2023-07-11 18:57:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"BAN vs AFG: छा गए शोरिफुल इस्लाम, बांग्लादेश ने अफगानिस्तान को क्लीन स्वीप करने से रोका","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/afghanistan-won-the-3-match-odi-series-beat-bangladesh-by-2-1/articleshow/101677239.cms","keywords":null,"creator":null,"video_url":null,"description":"BAN vs AFG: अफगानिस्तान पहले दोनों वनडे मैच जीतकर श्रृंखला अपने नाम कर चुका था। अब इन दोनों देशों के बीच दो टी-20 मैचों की श्रृंखला खेली जाएगी।","content":"बाएं हाथ के तेज गेंदबाज शोरिफुल इस्लाम के करियर के सर्वश्रेष्ठ प्रदर्शन और कप्तान लिटन दास के नाबाद अर्धशतक की मदद से बांग्लादेश ने मंगलवार को यहां तीसरे एकदिवसीय अंतरराष्ट्रीय क्रिकेट मैच में सात विकेट से बड़ी जीत दर्ज करके अफगानिस्तान की तीन मैचों की श्रृंखला में क्लीन स्वीप करने की उम्मीदों पर पानी फेर दिया। शोरिफुल ने 21 रन देकर चार विकेट लिए और अफगानिस्तान को 45.2 ओवर में 126 रन पर समेटने में अहम भूमिका निभाई। अफगानिस्तान के केवल चार बल्लेबाज दोहरे अंक में पहुंचे जिनमें अजमुतुल्लाह ओमारजई ने सर्वाधिक 56 रन बनाए बांग्लादेश की तरफ से शोरिफुल के अलावा तासकीन अहमद और ताइजुल इस्लाम ने दो-दो विकेट लिए। अनुभवी शाकिब अल हसन ने किफायती गेंदबाजी करते हुए 10 ओवर में 13 रन देकर एक विकेट हासिल किया। बांग्लादेश की शुरुआत भी अच्छी नहीं रही और उसने 28 रन पर दो विकेट गंवा दिए। लिटन दास (नाबाद 53) और शाकिब (39) ने तीसरे विकेट के लिए 61 रन की साझेदारी करके टीम को लक्ष्य के करीब पहुंचाया। तौहीद हिरदोय ने नाबाद 22 रन का योगदान दिया जिससे बांग्लादेश में 23.3 ओवर में तीन विकेट पर 129 रन बनाकर आसान जीत दर्ज की।","pubDate":"2023-07-11 18:53:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies vs India: Caribbean Challenge begins","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/12/west-indies-vs-india-caribbean-challenge-begins-2593800.html","keywords":null,"creator":null,"video_url":null,"description":"With their WTC cycle set to get underway, Rohit and Co. will be looking to put up a strong show against the West Indies CHENNAI: Let’s put it straight. The last time India lost a Test series in West Indies was two decades ago. While they have threatened and competed in every series they have not beaten India in a Test match since 2002. And at a time when their non-qualification for the upcoming 2023 ODI World Cup in India has been a massive talking point, they will have to play extremely well to end up on the right side of the result in at least one of the matches in the two-Test series that begins in Dominica on Wednesday. However, there is hope. For this is probably the first time in almost a decade where India have looked vulnerable, inexperienced and beatable — all at the same time. This series against Rohit Sharma & Co. comes as an opportunity for the Caribbean side led by Kraigg Brathwaite. More than a decade since the previous generation stalwarts walked into the sunset, the cycle seem to be coming back with the quite a few of them in their mid and late 30s, including Rohit Sharma, Virat Kohli, Ajinkya Rahane, R Ashwin and Ravindra Jadeja. Which is why, transition is the buzz word in Indian cricket at the moment. They will have Shubman Gill and Yashasvi Jaiswal in the top-order. Either KS Bharat or Ishan Kishan is going to be in the middle-order. Their pace attack, barring Mohammed Siraj, do not have much international experience. To sum it all up, it is a phase where there are concerns as to whether West Indies pace attack featuring Kemar Roach, Alzarri Joseph, Jason Holder and Shanon Gabriel can break through the Indian batting with the Dukes ball. At the same time, there is a sense of excitement to see the next generation of players. Rahane, who himself has been on a comeback journey, is excited to see how the youngsters go. And with skipper Rohit confirming that Gill will bat at No. 3, Jaiswal is all set to open the batting for India. “Gill will play at No. 3 because Gill himself wants to play at No. 3. He discussed with Rahul (Dravid) that ‘I have played all my cricket at 3 and 4. I think I can do better for my team if I bat at No. 3’. And it is good for us too because it becomes an opening combination of left and right. So I think we will try to do this and hopefully this will go on for a long time,” Rohit told reporters in Dominica on Tuesday. West Indies, too, have their share of things to be excited about. Left-hand batter Kirk McKenzie has earned his maiden call-up, spinners Rahkeem Cornwall and Jomel Warrican have been recalled and their pace attack is as experienced as it could have been. Sure, the mood seems gloomy with the 50-over format, but there is nothing they can do about it at this point. They would rather want to focus on bringing some happy news to the Caribbean shores and what better way to put up a strong performance against India. The series could still end up 2-0 in favour of India. But there is hope, anticipation and excitement and a lot to look forward to. And that is all one could ask for on the first day of a Test series. Points to ponder As India takes on West Indies in the first Test at Dominica on Wednesday, a look at key talking points... What in store for veterans? Even as India enters transition, they will rely on Rohit Sharma, Ajinkya Rahane and Virat Kohli, all three in mid-30s. Will they be there to see through the upcoming cycle is a big question mark. With every innings and performance put under the lens, it will be interesting to see how the trio approach the tour and whether they are able to come out on top. The middle-order conundrum Through the previous WTC cycle, the middle-order with Rishabh Pant at the forefront was the key reason for India's success with the bat. However, the last six months have not been the same. While they are likely to have depth till 8/9 against a pace attack which has Kemar Roach, Jason Holder, Alzarri Joseph, etc, this Indian middle-order will be challenged. Can Windies seek resurgence? On paper, the Indian pace attack lacks experience. If there was ever a chance for the West Indies to make an impact, it is this. If their batting line-up, led by Kraigg Brathwaite, are able to challenge the bowlers and do something special, that could be the best medicine after the bitter fact they had to face, having missed the ODI World Cup qualification. West Indies vs India, 1st Test, Dominica Live on FanCode and DD Sports, 7.30 PM","content":"CHENNAI: Let’s put it straight. The last time India lost a Test series in West Indies was two decades ago. While they have threatened and competed in every series they have not beaten India in a Test match since 2002. And at a time when their non-qualification for the upcoming 2023 ODI World Cup in India has been a massive talking point, they will have to play extremely well to end up on the right side of the result in at least one of the matches in the two-Test series that begins in Dominica on Wednesday. However, there is hope. For this is probably the first time in almost a decade where India have looked vulnerable, inexperienced and beatable — all at the same time. This series against Rohit Sharma & Co. comes as an opportunity for the Caribbean side led by Kraigg Brathwaite. More than a decade since the previous generation stalwarts walked into the sunset, the cycle seem to be coming back with the quite a few of them in their mid and late 30s, including Rohit Sharma, Virat Kohli, Ajinkya Rahane, R Ashwin and Ravindra Jadeja. Which is why, transition is the buzz word in Indian cricket at the moment. They will have Shubman Gill and Yashasvi Jaiswal in the top-order. Either KS Bharat or Ishan Kishan is going to be in the middle-order. Their pace attack, barring Mohammed Siraj, do not have much international experience. To sum it all up, it is a phase where there are concerns as to whether West Indies pace attack featuring Kemar Roach, Alzarri Joseph, Jason Holder and Shanon Gabriel can break through the Indian batting with the Dukes ball. At the same time, there is a sense of excitement to see the next generation of players. Rahane, who himself has been on a comeback journey, is excited to see how the youngsters go. And with skipper Rohit confirming that Gill will bat at No. 3, Jaiswal is all set to open the batting for India. “Gill will play at No. 3 because Gill himself wants to play at No. 3. He discussed with Rahul (Dravid) that ‘I have played all my cricket at 3 and 4. I think I can do better for my team if I bat at No. 3’. And it is good for us too because it becomes an opening combination of left and right. So I think we will try to do this and hopefully this will go on for a long time,” Rohit told reporters in Dominica on Tuesday. West Indies, too, have their share of things to be excited about. Left-hand batter Kirk McKenzie has earned his maiden call-up, spinners Rahkeem Cornwall and Jomel Warrican have been recalled and their pace attack is as experienced as it could have been. Sure, the mood seems gloomy with the 50-over format, but there is nothing they can do about it at this point. They would rather want to focus on bringing some happy news to the Caribbean shores and what better way to put up a strong performance against India. The series could still end up 2-0 in favour of India. But there is hope, anticipation and excitement and a lot to look forward to. And that is all one could ask for on the first day of a Test series. As India takes on West Indies in the first Test at Dominica on Wednesday, a look at key talking points... Even as India enters transition, they will rely on Rohit Sharma, Ajinkya Rahane and Virat Kohli, all three in mid-30s. Will they be there to see through the upcoming cycle is a big question mark. With every innings and performance put under the lens, it will be interesting to see how the trio approach the tour and whether they are able to come out on top. Through the previous WTC cycle, the middle-order with Rishabh Pant at the forefront was the key reason for India's success with the bat. However, the last six months have not been the same. While they are likely to have depth till 8/9 against a pace attack which has Kemar Roach, Jason Holder, Alzarri Joseph, etc, this Indian middle-order will be challenged. On paper, the Indian pace attack lacks experience. If there was ever a chance for the West Indies to make an impact, it is this. If their batting line-up, led by Kraigg Brathwaite, are able to challenge the bowlers and do something special, that could be the best medicine after the bitter fact they had to face, having missed the ODI World Cup qualification.","pubDate":"2023-07-11 18:53:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"WI vs IND: तीसरे नंबर पर शुभमन गिल, ओपनिंग में लेफ्ट-राइट कॉम्बिनेशन, पहले टेस्ट के लिए रोहित शर्मा के 3 बड़े ऐलान","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/wi-vs-ind-shubman-gill-will-bat-at-number-three-left-right-opening-combination-in-opening-rohit-sharma-major-announcements/articleshow/101677344.cms","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs India: भारतीय टीम वेस्टइंडीज के खिलाफ बुधवार से शुरू हो रही दो टेस्ट मैचों की श्रृंखला के जरिए बदलाव के दौर की शुरूआत करेगी। विंडसर पार्क ने पिछले छह साल में एक भी टेस्ट मैच की मेजबानी नहीं की है, लेकिन यह एक ऐसा फॉर्मेट है, जहां कैरेबियाई टीम ने बढ़िया किया है।","content":"वेस्टइंडीज के खिलाफ आज से शुरू होने जा रहे पहले टेस्ट के लिए टीम इंडिया में कई बड़े बदलाव देखने को मिलेंगे। भारतीय कप्तान रोहित शर्मा ने मैच की पूर्व संध्या पर पत्रकारों से बात करते हुए अपनी स्ट्रैटजी का खुलासा किया। रोहित ने बताया कि युवा बल्लेबाज शुभमन गिल तीसरे नंबर पर बैटिंग करेंगे। साथ ही ओपनिंग में राइट-लेफ्ट कॉम्बिनेशन होगा। साथ ही साथ प्लेइंग इलेवन में दो स्पिनर्स खेलेंगे। रोहित शर्मा ने प्रेस कॉन्फ्रेंस में कहा, 'विकेट को देखते हुए मेरा मानना है कि हम दो स्पिनर्स और तीन सीमर्स के साथ खेलेंगे। जहां तक बल्लेबाजी की बात है, शुभमन गिल तीसरे नंबर पर आएंगे। वह इसी पोजिशन पर खेलना चाहते हैं। गिल ने कोच राहुल द्रविड़ से कहा कि उन्होंने अपने पूरे करियर में नंबर 3 और 4 पर खेला है।' रोहित शर्मा ने यह भी कहा कि वह लंबे समय के बाद बाएं-दाएं ओपनिंग संयोजन से खुश हैं। शर्मा की माने तो, 'यह भारतीय क्रिकेट के लिए रोमांचक समय होगा, हमें खिलाड़ी मिल गया है और उम्मीद है कि वह लंबे समय तक अच्छा प्रदर्शन करेगा। हम लंबे समय से बाएं हाथ के सलामी बल्लेबाज के लिए बेताब थे।' यशस्वी जयसवाल के भारत के लिए बाएं हाथ के सलामी बल्लेबाज होने की पूरी संभावना है। चेतेश्वर पुजारा के बाहर होने से भारतीय टॉप ऑर्डर में एक स्पॉट बना है। मुंबई के बेहद प्रतिभाशाली बाएं हाथ के बल्लेबाज यशस्वी जायसवाल को उम्मीद होगी कि वह अपने 'नाम' के अनुरूप प्रदर्शन करेंगे। सिर्फ 19 टेस्ट पुराने मोहम्मद सिराज के नेतृत्व में भारत का पांच सदस्यीय तेज गेंदबाजी अटैक वेस्टइंडीज के तेज आक्रमण की तुलना में कमजोर नजर आता है। यह फिर से इस बात पर निर्भर करेगा कि वेस्टइंडीज रविचंद्रन अश्विन (474 विकेट) और रविंद्र जड़ेजा (268) की चालाकी और कलात्मकता का मुकाबला कैसे करता है, जिन्होंने मिलकर लगभग 750 टेस्ट विकेट चटकाए हैं। इन तीनों के अलावा शार्दुल ठाकुर का खेलना तय है, ऐसे में मुकेश कुमार, जयदेव उनादकट और नवदीप सैनी में से किसी एक को ही मौका मिलेगा।","pubDate":"2023-07-11 18:31:06","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aussies keep eyes on winning women's Ashes, not drawing","link":"https://thewest.com.au/sport/cricket/aussies-keep-eyes-on-winning-womens-ashes-not-drawing-c-11251361","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia's women insist their goal remains winning the Ashes and not just drawing to retain them after back-to-back losses in the Twenty20 component.","content":"Tahlia McGrath insists Australia are still determined to win the Ashes and not just retain them, despite suffering their first back-to-back losses in any format in almost six years. Australia's grip on the multi-form Ashes has loosened in recent days, after winning the Test match and series-opening T20 to take a 6-0 points lead. However, defeats to England at The Oval and Lord's have reduced that scoreline to 6-4, with two points available for each of the remaining three ODIs. As holders of the trophy, Australia can still retain the Ashes with a victory in the opening ODI on Wednesday night in Bristol to make it 8-4 with two matches to play. But the tourists have long been adamant they have no interest in only drawing the series, after walking away with an empty feeling after doing likewise in 2016-17. Instead, they are determined to win two of the three ODIs to ensure they walk away outright winners. \"We just want to win the Ashes. That's what we came here to do,\" vice-captain McGrath said. \"I don't think (drawing) is enough. We want to win every game of cricket. First and foremost is retaining the Ashes, but we want to win these three games coming up. \"Winning 8-8 doesn't sound as good as winning them outright. The focus is on winning tomorrow, but we want to win outright.\" Australia's losses in the T20s marked their first back-to-back defeats in any formats since November 2017. But they will walk out into their preferred format on Wednesday, having dominated the 50-over game in particular over the past five years. Their record in ODIs stands at an imposing 41-1 in completed games since the start of 2018, with the team currently on a 15-game winning streak. \"Part of the reason we have been so successful in the past is you have so much more time in ODIs,\" McGrath said. \"You can build your innings a bit more. We have had players cash in and score those big hundreds with players supporting them. \"From a bowling point of view you can build a bit more pressure and work batters out a bit more. \"We have been consistent in that format, and players coming in know exactly what they need to do for the team.\" Australia could make a change to their team for Wednesday's clash, with Phoebe Litchfield, Grace Harris and Heather Graham likely to be fighting it out for one spot. Litchfield did open in Australia's last ODI matches in January, but Alyssa Healy has since returned to partner Beth Mooney at the top of the order. Sign up for our emails","pubDate":"2023-07-11 20:02:34","image_url":"https://images.thewest.com.au/publication/C-11251361/78df4874e5b1588e4dd6c7b71437e16fc799136a-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park?","link":"https://thesportsrush.com/cricket-news-roseau-dominica-time-what-is-the-time-difference-between-india-and-windsor-park/","keywords":["Cricket","India tour of West Indies 2023","Windsor Park"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Test match cricket is all set to return to the island nation of Dominica after more than a six-year gap. The first of the two-match series of India’s tour of West Indies 2023 commences in the city of Roseau from tomorrow (Wednesday) onwards. Roseau’s Windsor Park last hosted a Test in the year 2017 when… The post Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park? appeared first on The SportsRush.","content":"Test match cricket is all set to return to the island nation of Dominica after more than a six-year gap. The first of the two-match series of India’s tour of West Indies 2023 commences in the city of Roseau from tomorrow (Wednesday) onwards. Roseau’s Windsor Park last hosted a Test in the year 2017 when the hosts had squared-off against Pakistan. As for team India, this Caribbean city will mark their return back after more than a decade, with the Asian country having last played here in the year 2011. As has been the case with Indian cricket fans whenever Test matches take place in this part of the world, they will have to yet again make temporary changes to their sleeping pattern with the action set to take place till way past midnight. Roseau Dominica Time Difference With India The city of Roseau is 9 hours and 30 minutes behind the Indian Standard Time. Dominica observes the Atlantic Standard Time throughout the year, which is a result of a subtraction of four hours from Coordinated Universal Time (UTC). India, on the other hand, observes the Indian Standard Time (IST), which is 5 hours and 30 minutes ahead of the UTC. For e.g. If the present time in India as of July 12 (Wednesday) is 12:30 AM, then the corresponding time in the city of Roseau in Dominica would be 03:00 PM with the date being July 11 (Tuesday). As far as the first Test match between India and West Indies is concerned, the same will begin from 10:00 AM onwards (local time), or 07:30 PM (IST) tomorrow. How Many Time Zones Are There In The Caribbean? The Caribbean region is divided into two time zones – Eastern and Atlantic. Also, there are five nations in the region which also observe the daylight saving. They are Bahamas, Cuba, Turks & Caicos islands, Haiti and Bermuda. While the Atlantic Standard Time (as in Dominica) is four hours behind the UTC, the Eastern Standard Time is five hours behind the UTC. The post Roseau Dominica Time: What Is The Time Difference Between India and Windsor Park? appeared first on The SportsRush.","pubDate":"2023-07-11 19:58:21","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Aussies will find it hard to get over the line: Woakes","link":"https://thewest.com.au/sport/cricket/aussies-will-find-it-hard-to-get-over-the-line-woakes-c-11251245","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"England's Headingley matchwinner Chris Woakes has insisted Australia will feel the pressure to clinch the Ashes despite being 2-1 ahead in the series","content":"Chris Woakes has sought to turn the pressure on to Australia despite their 2-1 Ashes lead by insisting the tourists will find it hard to get a series win over the line. Australia need only win at Old Trafford next week to retain the Ashes but Pat Cummins' men want to be the first Australian side to win in England for two decades. England, meanwhile, insist they can regain the urn by coming back from 2-0 down to win 3-2, which they have never previously done. \"In our dressing room the belief is we can win 3-2, I think it's always been there,\" the allrounder said. \"You don't want to look too far ahead, you have to play what's in front of you, each ball, each day, each session, each Test match as it comes. \"I'd imagine when you're so close to getting something, the harder it gets, and I'm sure the Aussies will be feeling that now. \"Once you get so close to something, it's actually hard to get that over the line, isn't it? We've got to turn up in Manchester and put in another performance. \"They're an extremely good side and we're going to have to be at our best to beat them again.\" Woakes admitted his triumphant return to Ashes cricket left him \"quite emotional\" after accepting his time as a Test player might have come to an end. The 34-year-old stepped up with bat and ball after being thrust into last week's must-win clash at Headingley, 16 months after he last donned his England whites on the ill-fated tour of the West Indies. \"It's quite emotional actually. You sometimes think the ship has sailed, of course you do,\" he said of his match-winning return. \"You do wonder, especially when the team was going so well last summer and I wasn't involved. It's hard. \"Sometimes you don't always get the rewards that you deserve, but I felt like I played well in this game and got the rewards I deserve.\" Sign up for our emails","pubDate":"2023-07-11 19:33:21","image_url":"https://images.thewest.com.au/publication/C-11251245/2215b7f02df9c617f494bfdcdc663e7e08ef06a6-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"India vs West Indies Test series: నేటి నుండి భారత్, వెస్టిండీస్ మొదటి టెస్ట్ మ్యాచ్ ప్రారంభం.. ఎప్పుడు, ఏ సమయం, ఏ ఓటీటీ ప్లాట్ ఫాంలో ఫ్రీగా టెస్ట్ మ్యాచ్ చూడచ్చో తెలుసుకోండి..","link":"https://telugu.latestly.com/sports/cricket/india-and-west-indies-first-test-match-starts-from-today-know-when-what-time-on-which-ott-platform-101508.html","keywords":null,"creator":null,"video_url":null,"description":"నేటి నుంచి భారత్, వెస్టిండీస్ మధ్య టెస్టు సిరీస్ (ఇండ్ Vs WI) ప్రారంభం కానుంది. రెండు టెస్టుల సిరీస్‌లో తొలి టెస్టు జూలై 12 నుంచి జరగనుంది. ప్రపంచ టెస్టు ఛాంపియన్‌షిప్ (డబ్ల్యూటీసీ)లో కెప్టెన్ రోహిత్ శర్మ నేతృత్వంలోని జట్టు ఓడిపోయిన తర్వాత ఇదే తొలి టెస్టు సిరీస్. వెస్టిండీస్‌తో జరిగే టెస్ట్ సిరీస్‌లో కొత్త బౌలర్లు కమాండ్‌ని పొందడం చూడవచ్చు.","content":"నేటి నుంచి భారత్, వెస్టిండీస్ మధ్య టెస్టు సిరీస్ (ఇండ్ Vs WI) ప్రారంభం కానుంది. రెండు టెస్టుల సిరీస్‌లో తొలి టెస్టు జూలై 12 నుంచి జరగనుంది. ప్రపంచ టెస్టు ఛాంపియన్‌షిప్ (డబ్ల్యూటీసీ)లో కెప్టెన్ రోహిత్ శర్మ నేతృత్వంలోని జట్టు ఓడిపోయిన తర్వాత ఇదే తొలి టెస్టు సిరీస్. వెస్టిండీస్‌తో జరిగే టెస్ట్ సిరీస్‌లో కొత్త బౌలర్లు కమాండ్‌ని పొందడం చూడవచ్చు. డొమినికా వేదికగా తొలి టెస్టు మ్యాచ్ జరగనుంది మొదటి టెస్ట్ డొమినికాలో ఆడుతుంది. ఇప్పటికే ప్రపంచకప్‌ నుంచి నిష్క్రమించిన వెస్టిండీస్‌పై రోహిత్ శర్మ నేతృత్వంలోని భారత జట్టు కరీబియన్ గడ్డపై సత్తా చాటేందుకు సిద్ధమైంది. ఈ సిరీస్‌లో ఛతేశ్వర్‌ పుజారాకు చోటు దక్కలేదు. ఇలాంటి పరిస్థితుల్లో రితురాజ్ గైక్వాడ్, యశస్వి జైస్వాల్‌లలో ఎవరికి స్థానం దక్కుతుందనేది ఆసక్తికరంగా మారింది. టెస్ట్ మ్యాచ్ ఎప్పుడు ప్రారంభమవుతుంది? భారత్, వెస్టిండీస్మ ధ్య జరగనున్న తొలి టెస్టు మ్యాచ్ రేపటి నుంచి అంటే బుధవారం నుంచి ప్రారంభం కానుంది. ఈ మ్యాచ్ భారత కాలమానం ప్రకారం రాత్రి 7.30 గంటలకు ప్రారంభమవుతుంది. ఒక రోజు ఆట దాదాపు 8 గంటల పాటు సాగుతుంది. అటువంటి పరిస్థితిలో, ఒక రోజు ఆట తెల్లవారుజామున 3:30 గంటలకు ముగుస్తుంది. మీరు టెస్ట్ సిరీస్‌ను ఎక్కడ చూడవచ్చు? భారత్, వెస్టిండీస్ మధ్య జరిగే ఈ టెస్ట్ సిరీస్‌ను అభిమానులు పూర్తిగా ఉచితంగా వీక్షించవచ్చు. అభిమానులు Hotstar లేదా Sony Livకి సబ్‌స్క్రిప్షన్ చెల్లించే బదులు Jio సినిమాలో వెస్టిండీస్, భారతదేశం మధ్య టెస్ట్ సిరీస్‌ను ఉచితంగా చూడవచ్చు. వెస్టిండీస్ పర్యటనలో టెస్టు కోసం భారత జట్టు రోహిత్ శర్మ (కెప్టెన్), శుభ్‌మన్ గిల్, రుతురాజ్ గైక్వాడ్, విరాట్ కోహ్లి, యశస్వి జైస్వాల్, అజింక్యా రహానే (వైస్ కెప్టెన్), కెఎస్ భరత్ (వికెట్ కీపర్), ఇషాన్ కిషన్ (వికెట్ కీపర్), రవిచంద్రన్ అశ్విన్, రవీంద్ర జడేజా, అక్షరుల్ పట్కూర్, అక్షరుల్ ఠాకూర్, మో. సిరాజ్, ముఖేష్ కుమార్, జయదేవ్ ఉనద్కత్, నవదీప్ సైనీ.","pubDate":"2023-07-11 19:23:42","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Telugu"},{"title":"Hasaranga, Gardner win ICC 'Player of the Month' award","link":"https://www.thehindu.com/sport/cricket/hasaranga-gardner-win-icc-player-of-the-month-award/article67069257.ece","keywords":null,"creator":null,"video_url":null,"description":"Hasaranga clinched the award following his record-breaking feats at the World Cup Qualifier games in Zimbabwe","content":"Sri Lanka spinner Wanindu Hasaranga and Australian women's team all-rounder Ashleigh Gardner were on Tuesday named ICC's 'Player of the Month' for their impressive performances in June. Hasaranga clinched the award following his record-breaking feats at the World Cup Qualifier games in Zimbabwe. Women's Ashes hero Ashleigh Gardner becomes the first player to win three Player-of-the-Month accolades. Both players were selected as the standout performers following a vote conducted among a specialist panel comprising ICC Hall of Famers, former international players, media representatives and global cricket fans registered at icc-cricket.com, who had been voting since the nominees were announced last week. With 26 wickets at an average of 10 per scalp during the calendar month, Hasaranga enjoyed several highlights during the prolific period. Heading into the Qualifier as one of the key threats in a strong Sri Lankan lineup, the spinner started in fine fashion. Claiming six wickets in the tournament opener against the UAE, and following up with 5/13 and 5/79 against Oman and Ireland respectively, Hasaranga became the first spinner in history to take three consecutive five-wicket hauls in ODI cricket, setting Sri Lanka on course for qualification to the ICC Men's Cricket World Cup in India which starts on October 5. \"It (award) comes at an important moment for Sri Lanka Cricket, after we made it to the Cricket World Cup in India. I am privileged and honoured to have been chosen as the ICC Men's Player of the Month,\" Hasaranga was quoted as saying in an ICC release. Hasaranga becomes the first Sri Lanka player to win the award since Prabath Jayasuriya in July 2022. Hasaranga emerged victorious from a strong field of candidates including another star performer at the Qualifier, Zimbabwe's Sean Williams, and the Player of the Match from the ICC World Test Championship Final, Australia's Travis Head. Gardner celebrated another prize after driving Australia to early success in the ongoing Women's Ashes series. Trent Bridge was the stage of Gardner's success, most notably with the ball, spinning Australia to a comfortable 89-run win to begin with a Test win. She followed up a valuable 40 in Australia's first innings with a four-wicket spell to help maintain a slender advantage over the hosts. Despite failing with the bat in Australia's reply, Gardner's sensational off-spin was the difference. Incredible figures of eight for 66 -- the best figures for Australia in a women’s Test -- included all five wickets to fall on the final day. “To win an Ashes Test match at Trent Bridge was a special moment for our team and I’m happy I was able to contribute towards the win. Winning a Test match overseas is one of the biggest challenges in cricket, it’s certainly a game that we will remember for a long time to come.” Gardner won her third Player-of-the-Month crown by overcoming fellow nominees Tammy Beaumont of England and Hayley Matthews of the West Indies.","pubDate":"2023-07-11 19:20:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Will Young hits century on Nottinghamshire debut to frustrate leaders Surrey","link":"https://www.watfordobserver.co.uk/sport/national/23649222.will-young-hits-century-nottinghamshire-debut-frustrate-leaders-surrey/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The New Zealand international is on a three-match contract at the county","content":"The New Zealand international, who is on a three-match contract with the Trent Bridge outfit, provided immediate value with a fluent knock of 106 not out that guided them to 248 for five at the close, trailing Surrey by 107. Young shared a second-wicket partnership of 134 with Haseeb Hameed, who hit 67, while Surrey’s Jamie Overton took two wickets on his return to bowling action for the first time this summer after recovering from a back injury. CLOSE | Nottinghamshire complete day two on 248/5 and will continue to chase 355 set by Surrey. Young ends the evening session at 106*, with Hutton alongside him at the crease. Watch highlights of 👉 — Nottinghamshire CCC (@TrentBridge) Surrey had earlier posted 355 all out in their first innings, with Nottinghamshire all-rounder Lyndon James picking up the last two wickets to register career-best figures of six for 74. Tom Westley’s 28th first-class hundred and his century partnership with Paul Walter rescued Essex from a poor start at Blackpool before a late fightback by Lancashire saw the visitors bowled out for 282. Skipper Westley made 135, his third century of the season, with Walter eventually out for 76. Tom Bailey, with six for 59, led a good reply by Lancashire, who closed on 37 for one to be 245 behind. Double century for Rob Yates! The Warwickshire opener reaches first-class high-score with a four — LV= Insurance County Championship (@CountyChamp) Rob Yates compiled a double century to put Warwickshire in a commanding position against Kent at Canterbury. The visitors declared their first innings on 549 for seven, a lead of 378, before reducing Kent to 55 for one. Yates hit his highest first-class score of 228 not out, with 23 fours and a six, having batted for nearly nine hours, while Australia’s Glenn Maxwell made 81 in his first Championship appearance for four years. Chris Rushworth bowled Tawanda Muyeye for a duck early in Kent’s second innings, with the hosts ailing 323 runs adrift. 🗞️ | MIDDLESEX V NORTHAMPTONSHIRE | MATCH REPORTRead all about the second day of our clash against Northamptonshire at Merchant Taylors' School. FULL STORY ⬇️ | — Middlesex Cricket (@Middlesex_CCC) Ryan Higgins struck a sixth half-century of the season to guide Middlesex to only their second batting bonus point of the campaign and a first-innings lead over Northamptonshire in the Division One basement battle at Merchant Taylors’ School. Higgins made 64 not out to steady the ship from 127 for five to a total of 277, which edged them 58 in front. Mark Stoneman contributed 51, while Northamptonshire off-spinner Rob Keogh returning three for 52 and Ben Sanderson three for 77. Returning to make an impact with the ball when Northamptonshire batted again, Higgins removing both Ricardo Vasconcelos (22) and Justin Broad (five) as the visitors finished on 55 for two. James Rew became Somerset’s youngest double-centurion in first-class cricket as Somerset took control against Hampshire at Taunton. The 19-year-old extended his overnight score of 77 to 221 before being last man out in his side’s first innings total of 500. Kasey Aldridge (88) and Dom Bess (54) also contributed to Somerset’s impressive recovery from 80 for five before Hampshire limped to 58 for two at close. Alex Lees scores Durham first-class best of 195 as we dominate day 2 at Seat Unique Riverside. — Durham Cricket (@DurhamCricket) In Division Two, Alex Lees scored his third century in as many innings to guide leaders Durham into a strong position against Gloucestershire at Chester-le-Street. Lees anchored the innings with a flawless 195, his highest score as a Durham player, while Graham Clark made 82 after the hosts were reduced to 109 for four in reply to Gloucestershire’s 316. Brydon Carse finished the day unbeaten on 60 in Durham’s 433 for eight, which gave them a 117-run lead. Opener Finlay Bean hit a career-best 135 to consolidate Yorkshire’s position against Worcestershire at a showery New Road. The 21-year-old, dropped twice on the opening day, put on 177 with Adam Lyth (79) – Yorkshire’s best opening stand for seven years. 🗞️ The report from day two against Yorkshire — Worcestershire CCC (@WorcsCCC) Worcestershire fought back, with seamer Adam Finch taking five wickets for 100, but Yorkshire maintained their grip after Matthew Fisher and Ben Coad dismissed both openers as the hosts finished 46 for two. On another rain-affected day in Cardiff, Glamorgan lost captain David Lloyd for six on his return to action, but steadied the ship to reach 54 for one at close against second-placed Leicestershire. Lloyd – soon to be leaving the Welsh capital – was bowled by Matt Salisbury before 32 from Zain-ul-Hassan as part of a 44-run partnership with Sam Northeast restored the hosts’ composure. Derbyshire wicketkeeper Brooke Guest hit an unbeaten 80 to frustrate Sussex’s promotion hopes at a rain-hit Hove as his side reached 212 for three in reply to Sussex’s 402, trailing by 190.","pubDate":"2023-07-11 19:12:25","image_url":"https://www.watfordobserver.co.uk/resources/images/16989832/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Younguns not throwin’ away their shots at top","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/12/younguns-not-throwin-away-their-shots-at-top-2593804.html","keywords":null,"creator":null,"video_url":null,"description":"One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. CHENNAI: After getting bowled by 18-year-old Marufa Akter for a duck in the first T20I, Shafali Verma changed the gear of her innings by smashing the Bangladesh pacer for three back-to-back fours in the second T20I. One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. Even at a crucial juncture in the match for Bangladesh, 18-year-old Rabeya Khan dismissed Jemimah Rodrigues before she could get going. For India, Verma, and debutants from the series, Minnu Mani and B Anusha, shared six wickets between themselves, helping India seal the T20I series. Given how most of the teams are going through a transition, where bringing young players is a necessity, we are going to witness more teenagers going through the ranks. This is not just with the likes of India and Bangladesh. Recently, Sri Lanka beat New Zealand to win the ODI series for the first time. Even when the majority of the contribution came from their captain Chamari Athapaththu, 17-year-old Vishmi Gunarathne chipped in with her maiden half-century. Pakistan’s 18-year-old Ayesha Naseem is considered one of the biggest hitters in the game. Amy Hunter, 17 years old, has been a regular in Ireland’s senior side. England’s Lauren Filer, Australia’s Phoebe Litchfield, the list just goes on. Most of these players are from the U19 World Cup’s class of 2023. And by the time the next U19 World Cup rolls up in 2025, the list will swell even more. Brief scores: India 95/8 (Verma 19, Khatun 3-21) bt Bangladesh 87 (N Sultana 38, Sharma 3-12, Verma 3-15).","content":"CHENNAI: After getting bowled by 18-year-old Marufa Akter for a duck in the first T20I, Shafali Verma changed the gear of her innings by smashing the Bangladesh pacer for three back-to-back fours in the second T20I. One could sense the beginning of the rivalry. With old guards of most of the women’s teams hanging up their boots, it looks like the next generation is ready to fill those competitive shoes. Even at a crucial juncture in the match for Bangladesh, 18-year-old Rabeya Khan dismissed Jemimah Rodrigues before she could get going. For India, Verma, and debutants from the series, Minnu Mani and B Anusha, shared six wickets between themselves, helping India seal the T20I series. Given how most of the teams are going through a transition, where bringing young players is a necessity, we are going to witness more teenagers going through the ranks. This is not just with the likes of India and Bangladesh. Recently, Sri Lanka beat New Zealand to win the ODI series for the first time. Even when the majority of the contribution came from their captain Chamari Athapaththu, 17-year-old Vishmi Gunarathne chipped in with her maiden half-century. Pakistan’s 18-year-old Ayesha Naseem is considered one of the biggest hitters in the game. Amy Hunter, 17 years old, has been a regular in Ireland’s senior side. England’s Lauren Filer, Australia’s Phoebe Litchfield, the list just goes on. Most of these players are from the U19 World Cup’s class of 2023. And by the time the next U19 World Cup rolls up in 2025, the list will swell even more. : India 95/8 (Verma 19, Khatun 3-21) bt Bangladesh 87 (N Sultana 38, Sharma 3-12, Verma 3-15).","pubDate":"2023-07-11 18:57:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"BAN vs AFG: छा गए शोरिफुल इस्लाम, बांग्लादेश ने अफगानिस्तान को क्लीन स्वीप करने से रोका","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/afghanistan-won-the-3-match-odi-series-beat-bangladesh-by-2-1/articleshow/101677239.cms","keywords":null,"creator":null,"video_url":null,"description":"BAN vs AFG: अफगानिस्तान पहले दोनों वनडे मैच जीतकर श्रृंखला अपने नाम कर चुका था। अब इन दोनों देशों के बीच दो टी-20 मैचों की श्रृंखला खेली जाएगी।","content":"बाएं हाथ के तेज गेंदबाज शोरिफुल इस्लाम के करियर के सर्वश्रेष्ठ प्रदर्शन और कप्तान लिटन दास के नाबाद अर्धशतक की मदद से बांग्लादेश ने मंगलवार को यहां तीसरे एकदिवसीय अंतरराष्ट्रीय क्रिकेट मैच में सात विकेट से बड़ी जीत दर्ज करके अफगानिस्तान की तीन मैचों की श्रृंखला में क्लीन स्वीप करने की उम्मीदों पर पानी फेर दिया। शोरिफुल ने 21 रन देकर चार विकेट लिए और अफगानिस्तान को 45.2 ओवर में 126 रन पर समेटने में अहम भूमिका निभाई। अफगानिस्तान के केवल चार बल्लेबाज दोहरे अंक में पहुंचे जिनमें अजमुतुल्लाह ओमारजई ने सर्वाधिक 56 रन बनाए बांग्लादेश की तरफ से शोरिफुल के अलावा तासकीन अहमद और ताइजुल इस्लाम ने दो-दो विकेट लिए। अनुभवी शाकिब अल हसन ने किफायती गेंदबाजी करते हुए 10 ओवर में 13 रन देकर एक विकेट हासिल किया। बांग्लादेश की शुरुआत भी अच्छी नहीं रही और उसने 28 रन पर दो विकेट गंवा दिए। लिटन दास (नाबाद 53) और शाकिब (39) ने तीसरे विकेट के लिए 61 रन की साझेदारी करके टीम को लक्ष्य के करीब पहुंचाया। तौहीद हिरदोय ने नाबाद 22 रन का योगदान दिया जिससे बांग्लादेश में 23.3 ओवर में तीन विकेट पर 129 रन बनाकर आसान जीत दर्ज की।","pubDate":"2023-07-11 18:53:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies vs India: Caribbean Challenge begins","link":"http://www.newindianexpress.com/sport/cricket/2023/jul/12/west-indies-vs-india-caribbean-challenge-begins-2593800.html","keywords":null,"creator":null,"video_url":null,"description":"With their WTC cycle set to get underway, Rohit and Co. will be looking to put up a strong show against the West Indies CHENNAI: Let’s put it straight. The last time India lost a Test series in West Indies was two decades ago. While they have threatened and competed in every series they have not beaten India in a Test match since 2002. And at a time when their non-qualification for the upcoming 2023 ODI World Cup in India has been a massive talking point, they will have to play extremely well to end up on the right side of the result in at least one of the matches in the two-Test series that begins in Dominica on Wednesday. However, there is hope. For this is probably the first time in almost a decade where India have looked vulnerable, inexperienced and beatable — all at the same time. This series against Rohit Sharma & Co. comes as an opportunity for the Caribbean side led by Kraigg Brathwaite. More than a decade since the previous generation stalwarts walked into the sunset, the cycle seem to be coming back with the quite a few of them in their mid and late 30s, including Rohit Sharma, Virat Kohli, Ajinkya Rahane, R Ashwin and Ravindra Jadeja. Which is why, transition is the buzz word in Indian cricket at the moment. They will have Shubman Gill and Yashasvi Jaiswal in the top-order. Either KS Bharat or Ishan Kishan is going to be in the middle-order. Their pace attack, barring Mohammed Siraj, do not have much international experience. To sum it all up, it is a phase where there are concerns as to whether West Indies pace attack featuring Kemar Roach, Alzarri Joseph, Jason Holder and Shanon Gabriel can break through the Indian batting with the Dukes ball. At the same time, there is a sense of excitement to see the next generation of players. Rahane, who himself has been on a comeback journey, is excited to see how the youngsters go. And with skipper Rohit confirming that Gill will bat at No. 3, Jaiswal is all set to open the batting for India. “Gill will play at No. 3 because Gill himself wants to play at No. 3. He discussed with Rahul (Dravid) that ‘I have played all my cricket at 3 and 4. I think I can do better for my team if I bat at No. 3’. And it is good for us too because it becomes an opening combination of left and right. So I think we will try to do this and hopefully this will go on for a long time,” Rohit told reporters in Dominica on Tuesday. West Indies, too, have their share of things to be excited about. Left-hand batter Kirk McKenzie has earned his maiden call-up, spinners Rahkeem Cornwall and Jomel Warrican have been recalled and their pace attack is as experienced as it could have been. Sure, the mood seems gloomy with the 50-over format, but there is nothing they can do about it at this point. They would rather want to focus on bringing some happy news to the Caribbean shores and what better way to put up a strong performance against India. The series could still end up 2-0 in favour of India. But there is hope, anticipation and excitement and a lot to look forward to. And that is all one could ask for on the first day of a Test series. Points to ponder As India takes on West Indies in the first Test at Dominica on Wednesday, a look at key talking points... What in store for veterans? Even as India enters transition, they will rely on Rohit Sharma, Ajinkya Rahane and Virat Kohli, all three in mid-30s. Will they be there to see through the upcoming cycle is a big question mark. With every innings and performance put under the lens, it will be interesting to see how the trio approach the tour and whether they are able to come out on top. The middle-order conundrum Through the previous WTC cycle, the middle-order with Rishabh Pant at the forefront was the key reason for India's success with the bat. However, the last six months have not been the same. While they are likely to have depth till 8/9 against a pace attack which has Kemar Roach, Jason Holder, Alzarri Joseph, etc, this Indian middle-order will be challenged. Can Windies seek resurgence? On paper, the Indian pace attack lacks experience. If there was ever a chance for the West Indies to make an impact, it is this. If their batting line-up, led by Kraigg Brathwaite, are able to challenge the bowlers and do something special, that could be the best medicine after the bitter fact they had to face, having missed the ODI World Cup qualification. West Indies vs India, 1st Test, Dominica Live on FanCode and DD Sports, 7.30 PM","content":"CHENNAI: Let’s put it straight. The last time India lost a Test series in West Indies was two decades ago. While they have threatened and competed in every series they have not beaten India in a Test match since 2002. And at a time when their non-qualification for the upcoming 2023 ODI World Cup in India has been a massive talking point, they will have to play extremely well to end up on the right side of the result in at least one of the matches in the two-Test series that begins in Dominica on Wednesday. However, there is hope. For this is probably the first time in almost a decade where India have looked vulnerable, inexperienced and beatable — all at the same time. This series against Rohit Sharma & Co. comes as an opportunity for the Caribbean side led by Kraigg Brathwaite. More than a decade since the previous generation stalwarts walked into the sunset, the cycle seem to be coming back with the quite a few of them in their mid and late 30s, including Rohit Sharma, Virat Kohli, Ajinkya Rahane, R Ashwin and Ravindra Jadeja. Which is why, transition is the buzz word in Indian cricket at the moment. They will have Shubman Gill and Yashasvi Jaiswal in the top-order. Either KS Bharat or Ishan Kishan is going to be in the middle-order. Their pace attack, barring Mohammed Siraj, do not have much international experience. To sum it all up, it is a phase where there are concerns as to whether West Indies pace attack featuring Kemar Roach, Alzarri Joseph, Jason Holder and Shanon Gabriel can break through the Indian batting with the Dukes ball. At the same time, there is a sense of excitement to see the next generation of players. Rahane, who himself has been on a comeback journey, is excited to see how the youngsters go. And with skipper Rohit confirming that Gill will bat at No. 3, Jaiswal is all set to open the batting for India. “Gill will play at No. 3 because Gill himself wants to play at No. 3. He discussed with Rahul (Dravid) that ‘I have played all my cricket at 3 and 4. I think I can do better for my team if I bat at No. 3’. And it is good for us too because it becomes an opening combination of left and right. So I think we will try to do this and hopefully this will go on for a long time,” Rohit told reporters in Dominica on Tuesday. West Indies, too, have their share of things to be excited about. Left-hand batter Kirk McKenzie has earned his maiden call-up, spinners Rahkeem Cornwall and Jomel Warrican have been recalled and their pace attack is as experienced as it could have been. Sure, the mood seems gloomy with the 50-over format, but there is nothing they can do about it at this point. They would rather want to focus on bringing some happy news to the Caribbean shores and what better way to put up a strong performance against India. The series could still end up 2-0 in favour of India. But there is hope, anticipation and excitement and a lot to look forward to. And that is all one could ask for on the first day of a Test series. As India takes on West Indies in the first Test at Dominica on Wednesday, a look at key talking points... Even as India enters transition, they will rely on Rohit Sharma, Ajinkya Rahane and Virat Kohli, all three in mid-30s. Will they be there to see through the upcoming cycle is a big question mark. With every innings and performance put under the lens, it will be interesting to see how the trio approach the tour and whether they are able to come out on top. Through the previous WTC cycle, the middle-order with Rishabh Pant at the forefront was the key reason for India's success with the bat. However, the last six months have not been the same. While they are likely to have depth till 8/9 against a pace attack which has Kemar Roach, Jason Holder, Alzarri Joseph, etc, this Indian middle-order will be challenged. On paper, the Indian pace attack lacks experience. If there was ever a chance for the West Indies to make an impact, it is this. If their batting line-up, led by Kraigg Brathwaite, are able to challenge the bowlers and do something special, that could be the best medicine after the bitter fact they had to face, having missed the ODI World Cup qualification.","pubDate":"2023-07-11 18:53:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"WI vs IND: तीसरे नंबर पर शुभमन गिल, ओपनिंग में लेफ्ट-राइट कॉम्बिनेशन, पहले टेस्ट के लिए रोहित शर्मा के 3 बड़े ऐलान","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/wi-vs-ind-shubman-gill-will-bat-at-number-three-left-right-opening-combination-in-opening-rohit-sharma-major-announcements/articleshow/101677344.cms","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs India: भारतीय टीम वेस्टइंडीज के खिलाफ बुधवार से शुरू हो रही दो टेस्ट मैचों की श्रृंखला के जरिए बदलाव के दौर की शुरूआत करेगी। विंडसर पार्क ने पिछले छह साल में एक भी टेस्ट मैच की मेजबानी नहीं की है, लेकिन यह एक ऐसा फॉर्मेट है, जहां कैरेबियाई टीम ने बढ़िया किया है।","content":"वेस्टइंडीज के खिलाफ आज से शुरू होने जा रहे पहले टेस्ट के लिए टीम इंडिया में कई बड़े बदलाव देखने को मिलेंगे। भारतीय कप्तान रोहित शर्मा ने मैच की पूर्व संध्या पर पत्रकारों से बात करते हुए अपनी स्ट्रैटजी का खुलासा किया। रोहित ने बताया कि युवा बल्लेबाज शुभमन गिल तीसरे नंबर पर बैटिंग करेंगे। साथ ही ओपनिंग में राइट-लेफ्ट कॉम्बिनेशन होगा। साथ ही साथ प्लेइंग इलेवन में दो स्पिनर्स खेलेंगे। रोहित शर्मा ने प्रेस कॉन्फ्रेंस में कहा, 'विकेट को देखते हुए मेरा मानना है कि हम दो स्पिनर्स और तीन सीमर्स के साथ खेलेंगे। जहां तक बल्लेबाजी की बात है, शुभमन गिल तीसरे नंबर पर आएंगे। वह इसी पोजिशन पर खेलना चाहते हैं। गिल ने कोच राहुल द्रविड़ से कहा कि उन्होंने अपने पूरे करियर में नंबर 3 और 4 पर खेला है।' रोहित शर्मा ने यह भी कहा कि वह लंबे समय के बाद बाएं-दाएं ओपनिंग संयोजन से खुश हैं। शर्मा की माने तो, 'यह भारतीय क्रिकेट के लिए रोमांचक समय होगा, हमें खिलाड़ी मिल गया है और उम्मीद है कि वह लंबे समय तक अच्छा प्रदर्शन करेगा। हम लंबे समय से बाएं हाथ के सलामी बल्लेबाज के लिए बेताब थे।' यशस्वी जयसवाल के भारत के लिए बाएं हाथ के सलामी बल्लेबाज होने की पूरी संभावना है। चेतेश्वर पुजारा के बाहर होने से भारतीय टॉप ऑर्डर में एक स्पॉट बना है। मुंबई के बेहद प्रतिभाशाली बाएं हाथ के बल्लेबाज यशस्वी जायसवाल को उम्मीद होगी कि वह अपने 'नाम' के अनुरूप प्रदर्शन करेंगे। सिर्फ 19 टेस्ट पुराने मोहम्मद सिराज के नेतृत्व में भारत का पांच सदस्यीय तेज गेंदबाजी अटैक वेस्टइंडीज के तेज आक्रमण की तुलना में कमजोर नजर आता है। यह फिर से इस बात पर निर्भर करेगा कि वेस्टइंडीज रविचंद्रन अश्विन (474 विकेट) और रविंद्र जड़ेजा (268) की चालाकी और कलात्मकता का मुकाबला कैसे करता है, जिन्होंने मिलकर लगभग 750 टेस्ट विकेट चटकाए हैं। इन तीनों के अलावा शार्दुल ठाकुर का खेलना तय है, ऐसे में मुकेश कुमार, जयदेव उनादकट और नवदीप सैनी में से किसी एक को ही मौका मिलेगा।","pubDate":"2023-07-11 18:31:06","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}