{"newsArray":[{"title":"A disintegrating Ashes tour is the loneliest place in sport","link":"https://www.theage.com.au/sport/a-disintegrating-ashes-tour-is-the-loneliest-place-in-sport-20211219-p59irq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"If winning an Ashes series in Australia is the most daunting task in cricket, then winning one amid a quasi-lockdown is just about impossible.","content":null,"pubDate":"2021-12-18 23:46:54","full_description":"A disintegrating Ashes tour can feel like the loneliest place in sport. The cruelty of the latest mismatch is that England’s players, boiled in the Adelaide heat as their pace attack misfires and their batting crumbles faster than an overbaked Lamington, still have a month of this to go. Players react to the slow torture of series defeat in extreme ways: for Andrew Flintoff, captain 15 years ago, the answer sadly lay in the bottom of a glass, with coach Duncan Fletcher accusing him of turning up to one training session so hung over that he could not even bowl properly. For the class of 2021-22, there is no such release valve. No sooner had they trudged back to the Crowne Plaza from the Adelaide Oval, their batsmen’s pitiful collapse auguring a third 5-0 whitewash in five tours of Australia, than they learnt of the beefed-up Covid-19 measures by which they would have to abide between thrashings. It is hardly a recipe for wild nights on the road: due to the anxieties unleashed by Pat Cummins’ exposure to a positive case at a local steakhouse, they are banned from mixing in busy restaurants and ordered not even to have their hair cut. The stylishly coiffured Chris Woakes, said by former England team-mate James Taylor to book hair appointments every 10 days, is likely to find that last rule a particular torment. None of his team-mates will be much enamoured with such harsh diktats either. Since landing in Australia on Nov 7, they have soaked up every public health demand made of them, including quarantining in Queensland for 14 days - an avoidable hardship given that neither Victoria nor New South Wales was asking the same of overseas arrivals. Now, just as they look forward to relative freedoms in Melbourne and Sydney, the whip is being cracked once more. England players walk off the field after play on day three. Credit: Getty Most touring parties regard the Boxing Day and New Year Tests as cherished rites of passage. And yet for this bedraggled England team, the traditional joys of the southern-hemisphere holiday season will be tempered. After Cummins’s fateful decision to dine out, they have been told not just to steer clear of hairdressers, but to resist any shopping visits or requests for selfies. Where their predecessors could purge a torrid day in the middle with a riotous evening out, these young men risk having little beyond their own regrets for company. The worse England’s performances become, the more an impression grows that this tour was doomed from the outset. The warnings were spelt out starkly enough: how could players hope to be Ashes-sharp without any warm-up games, when in Ray Illingworth’s day it was customary to schedule several tough state contests long before the first Test? Stuart Broad was joking earlier this month when, with match practice curtailed by Brisbane downpours, he said: “We’ll be a good indoor cricket team.” But there was a grim prescience to his words. Thrust into the full glare of the Australian summer sun, England have looked blinded by the light. The English players huddle up on day three. Credit: AP If the essence of all great sport is intense competition, this series is facing a struggle to provide it. While England’s batting line-up tumbles headlong into the abyss the moment Joe Root falls, the choice to field five seamers in Adelaide appears one-dimensional. Historically, spinners have enjoyed it the most here, with Shane Warne and Nathan Lyon far ahead of their countrymen on the all-time list, with 56 and 54 wickets apiece. England have no such guile to deploy, save for Root’s gentle off-breaks. In time, an inquest will be required into the profound structural problems underlying the malaise. The factors are manifold, from the sidelining of county cricket to April and September to the stuffing of the midsummer schedule with the Hundred fixtures. This capitulation in Adelaide serves up ample evidence, whether in Jos Buttler’s 15-ball duck or in Ollie Pope’s failure to read Lyon’s enigmatic variations, that England’s love of the red-ball art is being lost. If Rory Burns and Haseeb Hameed constitute the best opening partnership, it is a reflection on how far the county game has fallen. But for now, with 3½ Tests and many dark nights of the soul ahead, England’s only option is to make do and mend. It is not as if they can call on reinforcements from the England Lions, who were intended to provide back-up but who have already flown home. They can hardly dispute the health protocols either, with Australia’s rising numbers of omicron cases threatening to trigger tougher crackdowns over the coming weeks. As with the Premier League’s ever-dwindling Christmas schedule, this Ashes series is at the mercy of an endlessly shifting public health picture. But where once the players could find sun-kissed escapes, here they are trapped inside a deepening nightmare. If winning an Ashes in Australia is the most daunting task in cricket, then winning one amid a quasi-lockdown is just about impossible. Sunday Telegraph","image_url":null,"source_id":"theage"},{"title":"A disintegrating Ashes tour is the loneliest place in sport","link":"https://www.smh.com.au/sport/a-disintegrating-ashes-tour-is-the-loneliest-place-in-sport-20211219-p59irq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"If winning an Ashes series in Australia is the most daunting task in cricket, then winning one amid a quasi-lockdown is just about impossible.","content":null,"pubDate":"2021-12-18 23:46:54","full_description":"A disintegrating Ashes tour can feel like the loneliest place in sport. The cruelty of the latest mismatch is that England’s players, boiled in the Adelaide heat as their pace attack misfires and their batting crumbles faster than an overbaked Lamington, still have a month of this to go. Players react to the slow torture of series defeat in extreme ways: for Andrew Flintoff, captain 15 years ago, the answer sadly lay in the bottom of a glass, with coach Duncan Fletcher accusing him of turning up to one training session so hung over that he could not even bowl properly. For the class of 2021-22, there is no such release valve. No sooner had they trudged back to the Crowne Plaza from the Adelaide Oval, their batsmen’s pitiful collapse auguring a third 5-0 whitewash in five tours of Australia, than they learnt of the beefed-up Covid-19 measures by which they would have to abide between thrashings. It is hardly a recipe for wild nights on the road: due to the anxieties unleashed by Pat Cummins’ exposure to a positive case at a local steakhouse, they are banned from mixing in busy restaurants and ordered not even to have their hair cut. The stylishly coiffured Chris Woakes, said by former England team-mate James Taylor to book hair appointments every 10 days, is likely to find that last rule a particular torment. None of his team-mates will be much enamoured with such harsh diktats either. Since landing in Australia on Nov 7, they have soaked up every public health demand made of them, including quarantining in Queensland for 14 days - an avoidable hardship given that neither Victoria nor New South Wales was asking the same of overseas arrivals. Now, just as they look forward to relative freedoms in Melbourne and Sydney, the whip is being cracked once more. England players walk off the field after play on day three. Credit: Getty Most touring parties regard the Boxing Day and New Year Tests as cherished rites of passage. And yet for this bedraggled England team, the traditional joys of the southern-hemisphere holiday season will be tempered. After Cummins’s fateful decision to dine out, they have been told not just to steer clear of hairdressers, but to resist any shopping visits or requests for selfies. Where their predecessors could purge a torrid day in the middle with a riotous evening out, these young men risk having little beyond their own regrets for company. The worse England’s performances become, the more an impression grows that this tour was doomed from the outset. The warnings were spelt out starkly enough: how could players hope to be Ashes-sharp without any warm-up games, when in Ray Illingworth’s day it was customary to schedule several tough state contests long before the first Test? Stuart Broad was joking earlier this month when, with match practice curtailed by Brisbane downpours, he said: “We’ll be a good indoor cricket team.” But there was a grim prescience to his words. Thrust into the full glare of the Australian summer sun, England have looked blinded by the light. The English players huddle up on day three. Credit: AP If the essence of all great sport is intense competition, this series is facing a struggle to provide it. While England’s batting line-up tumbles headlong into the abyss the moment Joe Root falls, the choice to field five seamers in Adelaide appears one-dimensional. Historically, spinners have enjoyed it the most here, with Shane Warne and Nathan Lyon far ahead of their countrymen on the all-time list, with 56 and 54 wickets apiece. England have no such guile to deploy, save for Root’s gentle off-breaks. In time, an inquest will be required into the profound structural problems underlying the malaise. The factors are manifold, from the sidelining of county cricket to April and September to the stuffing of the midsummer schedule with the Hundred fixtures. This capitulation in Adelaide serves up ample evidence, whether in Jos Buttler’s 15-ball duck or in Ollie Pope’s failure to read Lyon’s enigmatic variations, that England’s love of the red-ball art is being lost. If Rory Burns and Haseeb Hameed constitute the best opening partnership, it is a reflection on how far the county game has fallen. But for now, with 3½ Tests and many dark nights of the soul ahead, England’s only option is to make do and mend. It is not as if they can call on reinforcements from the England Lions, who were intended to provide back-up but who have already flown home. They can hardly dispute the health protocols either, with Australia’s rising numbers of omicron cases threatening to trigger tougher crackdowns over the coming weeks. As with the Premier League’s ever-dwindling Christmas schedule, this Ashes series is at the mercy of an endlessly shifting public health picture. But where once the players could find sun-kissed escapes, here they are trapped inside a deepening nightmare. If winning an Ashes in Australia is the most daunting task in cricket, then winning one amid a quasi-lockdown is just about impossible. Sunday Telegraph","image_url":null,"source_id":"smh"},{"title":"Stumps: Aussies in box seat after day 3","link":"https://www.news.com.au/sport/cricket/stumps-aussies-in-box-seat-after-day-3/video/6aad7a9593421efc41bb9a2cbcc32f41","keywords":null,"creator":null,"video_url":null,"description":"Ashes: Re-live the best action from the third day of the Adelaide Test as Australia dominated once more, with FOX Cricket's Isa Guha, Mark Waugh and Brett Lee.","content":null,"pubDate":"2021-12-18 20:32:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Stumps: Aussies in box seat after day 3","link":"https://www.cairnspost.com.au/sport/cricket/stumps-aussies-in-box-seat-after-day-3/video/6aad7a9593421efc41bb9a2cbcc32f41","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Ashes: Re-live the best action from the third day of the Adelaide Test as Australia dominated once more, with FOX Cricket's Isa Guha, Mark Waugh and Brett Lee.","content":null,"pubDate":"2021-12-18 20:32:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Test series against South Africa: Opener Rahul named vice-captain","link":"https://www.thehansindia.com/sports/cricket/test-series-against-south-africa-opener-rahul-named-vice-captain-720484","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) announced on Saturday that the national selectors have named opener KL Rahul as the vice-captain of the team for the three-match Test series against South Africa.","content":"KL RahulKL RahulJohannesburg: The Board of Control for Cricket in India (BCCI) announced on Saturday that the national selectors have named opener KL Rahul as the vice-captain of the team for the three-match Test series against South Africa. Rahul's appointment to the post comes after Rohit Sharma, promoted to be Virat Kohli's deputy, was ruled out of the series due to a left hamstring injury sustained in a practice session in Mumbai. Sharma had earlier replaced Ajinkya Rahane as the vice-captain in Tests. \"The All-India Senior selection committee has named KL Rahul as vice-captain for the upcoming 3-match Test series against South Africa. KL Rahul replaces Rohit Sharma as vice-captain, who was ruled out of the Test series owing to a hamstring injury,\" said a release from BCCI. The 29-year-old Rahul, who debuted in Test cricket in 2014, has played 40 matches so far and scored 2321 runs at an average of 35.16 with six centuries and 12 half-centuries against his name. The move also means that Rahul, one of the few all-format players in the current Indian team set-up, is being looked at as a long-term leader in the future. Rahul had captained Punjab Kings in IPL 2020 and 2021 and is highly tipped to take a similar role if the Lucknow franchise picks him via the draft ahead of IPL 2022 auctions. India have commenced their practice sessions in South Africa. The three-match Test series will start from December 26 to 30 in Centurion, followed by the second match in Johannesburg from January 3 to 7, and ends with the third and final Test in Cape Town from January 11 to 15. India are yet to win a Test series in South Africa. (IANS) INDIA'S TEST SQUAD: Virat Kohli (Captain), KL Rahul (vice-captain), Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Priyank Panchal, Shreyas Iyer, Hanuma Vihari, Rishabh Pant (wicket-keeper), Wriddhiman Saha (wicket-keeper), Ravichandran Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur and Mohammed Siraj.","pubDate":"2021-12-18 19:45:11","full_description":"KL Rahul Johannesburg : The Board of Control for Cricket in India (BCCI) announced on Saturday that the national selectors have named opener KL Rahul as the vice-captain of the team for the three-match Test series against South Africa. Rahul's appointment to the post comes after Rohit Sharma, promoted to be Virat Kohli's deputy, was ruled out of the series due to a left hamstring injury sustained in a practice session in Mumbai. Sharma had earlier replaced Ajinkya Rahane as the vice-captain in Tests. \"The All-India Senior selection committee has named KL Rahul as vice-captain for the upcoming 3-match Test series against South Africa. KL Rahul replaces Rohit Sharma as vice-captain, who was ruled out of the Test series owing to a hamstring injury,\" said a release from BCCI. The 29-year-old Rahul, who debuted in Test cricket in 2014, has played 40 matches so far and scored 2321 runs at an average of 35.16 with six centuries and 12 half-centuries against his name. The move also means that Rahul, one of the few all-format players in the current Indian team set-up, is being looked at as a long-term leader in the future. Rahul had captained Punjab Kings in IPL 2020 and 2021 and is highly tipped to take a similar role if the Lucknow franchise picks him via the draft ahead of IPL 2022 auctions. India have commenced their practice sessions in South Africa. The three-match Test series will start from December 26 to 30 in Centurion, followed by the second match in Johannesburg from January 3 to 7, and ends with the third and final Test in Cape Town from January 11 to 15. India are yet to win a Test series in South Africa. (IANS) INDIA'S TEST SQUAD: Virat Kohli (Captain), KL Rahul (vice-captain), Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Priyank Panchal, Shreyas Iyer, Hanuma Vihari, Rishabh Pant (wicket-keeper), Wriddhiman Saha (wicket-keeper), Ravichandran Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur and Mohammed Siraj.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/18/500x300_1136327-kl-rahul.jpg","source_id":"thehansindia"},{"title":"Gabriel Martinelli double helps sink Leeds to continue Arsenal’s upturn","link":"https://www.theguardian.com/football/2021/dec/18/leeds-arsenal-premier-league-match-report","keywords":["Premier League","Leeds United","Arsenal","Football","Sport"],"creator":["Nick Ames at Elland Road"],"video_url":null,"description":"The Premier League show staggers on and in a devastated schedule Arsenal stole it to strengthen their hold on fourth place. They made mincemeat of a diminished and thoroughly disorientated Leeds during the first half, making the game safe with two goals from Gabriel Martinelli and another from Bukayo Saka before easing off when a cricket score seemed on.Raphinha’s penalty salvaged some respectability for the home side but Emile Smith Rowe restored the margin and another heavy defeat may not be the only ill consequence for Leeds. They could face an investigation after an apparent allegation of racist abuse to the Arsenal bench from within their support shortly before half-time. Continue reading...","content":null,"pubDate":"2021-12-18 19:32:21","full_description":"The Premier League show staggers on and in a devastated schedule Arsenal stole it to strengthen their hold on fourth place. They made mincemeat of a diminished and thoroughly disorientated Leeds during the first half, making the game safe with two goals from Gabriel Martinelli and another from Bukayo Saka before easing off when a cricket score seemed on. Raphinha’s penalty salvaged some respectability for the home side but Emile Smith Rowe restored the margin and another heavy defeat may not be the only ill consequence for Leeds. They could face an investigation after an apparent allegation of racist abuse to the Arsenal bench from within their support shortly before half-time. Leeds will wish this game had completed the set of Covid-enforced postponements. These were the last two teams standing but that was a generous description of the hosts’ demeanour. They had escaped any wave of Covid-19 but were still down to the bare bones: nine first-teamers were absent through injury or suspension, including five of an already weakened squad that lost 7-0 at Manchester City. A substitutes’ bench almost empty of top-flight experience had an average age of 18 years and eight months; Leeds might have been a wounded beast, but they had a set of teeth missing too. Arsenal felt the pandemic’s earlier stages more keenly than most but could remain unchanged from a convincing win over West Ham. Albert Sambi Lokonga, who would have been a substitute, recorded a positive test and did not travel; even so there was no return to the squad for Pierre-Emerick Aubameyang, who has been training alone. A loud and boisterous crowd, even by this venue’s standards, had not been deterred from turning out and could take encouragement from a Leeds corner inside the first minute. Almost instantly, though, they survived successive scares. Illan Meslier stood firm to block from Alexandre Lacazette after Martin Ødegaard had sent him through, Saka fluffing the rebound; moments later the keeper made an even better stop from Thomas Partey, repelling with a firm hand, and the fears for a depleted backline escalated. They were borne out just after the quarter-hour and the frustration for Leeds was that, at that point, they appeared to have settled down. The opener was self-inflicted, even if Martinelli took it well. Granit Xhaka thought he had been fouled on the edge of the area and the ball rolled to Adam Forshaw, who had time to clear. He dawdled and allowed Lacazette to stick in a toe, creating a chance the in-form Brazilian swept past Meslier. Leeds could regret Forshaw’s hesitancy but the sequence had begun when Saka intercepted a loose pass further upfield. Kieran Tierney forced another smart save from Meslier after running beyond a dozy Raphinha; the roles were soon reversed as the winger forced his opponent to retreat, jinking inside and cutting just wide of Aaron Ramsdale’s near post. It was a reminder Leeds posed a threat; the problem was they were being exposed at will. The next time that happened, Martinelli capitalised again. Leeds were wayward once more, Stuart Dallas failing to find Joe Gelhardt; with the defensive shape all over the place Xhaka could slide a pass through to Martinelli, who held off Cody Drameh and dinked coolly beyond the overly exposed Meslier. Arsenal would have streaked further ahead had Meslier not saved from Lacazette, but they were finding space constantly and a third goal was inevitable. It arrived after Saka refused to give up when his crossfield run was snuffed out, taking possession back and earning some luck when his shot deflected in off Matheusz Klich. Leeds could justifiably fear a repeat of their Etihad embarrassment. They were entitled to feel aggrieved shortly after the restart when Xhaka went over the ball and crunched Raphinha’s ankle, a knock that needed lengthy treatment. Red cards have been given for less but Xhaka somehow escaped any kind of sanction and Elland Road was soon up in arms when Gelhardt was booked for fouling Takehiro Tomiyasu, who was later replaced after seemingly feeling the effects. The sense of indignation enlivened Leeds, Klich squaring just ahead of the substitute Crysencio Summerville. They enjoyed their best spell of the game and even if the chances of it yielding much looked slim the tide had been held back. There was certainly no sense of rancour towards Marcelo Bielsa, whose name was chanted by the Don Revie Stand; he had, at least, cajoled some sort of response. It received some reward when Gelhardt, always lively, was unceremoniously fouled close to goal by the former Leeds loanee Ben White. Raphinha battered the penalty past Ramsdale. For the next few minutes a genuine contest threatened to break out but Arsenal always had something in reserve and proved it when Smith Rowe, who had only just come on, ran on to Ødegaard’s ingenious scooped pass and finished the job.","image_url":"https://i.guim.co.uk/img/media/8a42ab1a9a39ae171f7148872b969f38b2954f32/284_24_3884_2331/master/3884.jpg?width=460&quality=85&auto=format&fit=max&s=0de6c5640bf13a26cc3dcad48955985e","source_id":"theguardian"},{"title":"KAR vs RJS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Vijay Hazare Trophy 2021-22, Pre Quarter Final 2","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/kar-vs-rjs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-vijay-hazare-trophy-2021-22-pre-quarter-final-2?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-18 19:12:27","full_description":"Karnataka will take on Rajasthan in the second pre-quarter final of the Vijay Hazare Trophy 2021-22 at the KL Saini Stadium in Jaipur on Sunday. With 12 points, Karnataka finished second in Elite Group B. They lost their last game against Bengal by four wickets. They will be the favourites to win this knockout fixture game Rajasthan. Meanwhile, Rajasthan finished second in Elite Group E, with four wins and a loss. They lost their last league game against Services by 16 runs. Ravikumar Samarth, Devdutt Padikkal, KV Siddharth, Manish Pandey (c), Karun Nair, Srinivas Sharath (wk), Jagadeesha Suchith, Krishnappa Gowtham, KC Cariappa/Praveen Dubey, V Koushik, Prateek Jain. Abhijeet Tomar, Manendar Singh (wk), Mahipal Lomror, Deepak Hooda (c), Shiva Chauhan, Shubham Sharma, Samarpit Joshi, Kamlesh Nagarkoti, Ravi Bishnoi, Aniket Choudhary, Khaleel Ahmed. Match: KAR vs RJS, Vijay Hazare Trophy 2021-22, Pre Quarter Final 2. Date and Time: 19th December, 2021; 9:00 AM IST. Venue: KL Saini Stadium, Jaipur. The surface is expected to favour bowlers, who will hope to be in control of the game. The par-score on this wicket is 240 runs. Anything more could prove to be a pretty difficult total to chase down. Both teams would like to bat first on this wicket. Manender Singh could prove to be an effective wicket-keeper choice for your Dream11 Fantasy side. He is key in the middle order for Rajasthan. Manish Pandey has always been a consistent performer in domestic cricket, and he carries a lot of responsibility in the Karnataka team. Pandey has accumulated 218 runs at an average of 54.5 in five games this season. He could prove to be an excellent captaincy choice for your KAR vs RJS Dream11 Fantasy team. Meanwhile, Devdutt Padikkal is one of the brightest young talents in the country. He was sensational in IPL 2021 for Royal Challengers Bangalore. and it’s difficult to contain him when he gets into his groove. Mahipal Lomror is a wonderful asset to have in your Dream11 Fantasy side, as he regularly contribute with both bat and ball. Lomror has scored 230 runs, and has also taken a wicket in this tournament. Aniket Choudhary has been incredibly consistent and competitive with the ball. He has scalped 13 wickets in five games this tournament. Manish Pandey (KAR). Devdutt Padikkal (KAR). Ravi Bishnoi (RJS). Mahipal Lomror (RJS) . Pravin Dubey (KAR). Ravikumar Samarth: 243 runs and 1 wicket. Manish Pandey: 218 runs. Aniket Choudhary: 13 wickets. Mahipal Lomror: 230 runs and 1 wicket. Fantasy Suggestion #1: M Singh, R Samarth, M Pandey, K Nair, D Padikkal, P Dubey, J Suchith, M Lomror, K Cariappa, A Choudhary, R Bishnoi. Captain: M Pandey. Vice-Captain: D Padikkal. Fantasy Suggestion #2: M Singh, R Samarth, M Pandey, A Tomar, D Padikkal, P Dubey, J Suchith, M Lomror, K Cariappa, A Choudhary, R Bishnoi. Captain: M Lomror. Vice-Captain: R Bishnoi.","image_url":"https://static.sportskeeda.com/editor/2021/12/2970c-16398470452784-1920.jpg","source_id":"sportskeeda"},{"title":"Starc, Lyon lead Aussie dominance with the ball | Men's Ashes 2021-22 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9OVV0STNyTlBHbmPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Starc, Lyon lead Aussie dominance with the ball | Men's Ashes 2021-22  cricket.com.auThe Ashes: England collapse again as Australia take total control of second Test  BBC SportAshes 2021-22: Australia v England second Test, day three – as it happened  The GuardianEngland up against it after another collapse – day three of the second Test  Northwich GuardianThe Ashes 2nd Test: What's worse, England's batting, fielding or team selection? | #PoliteEnquiries  ESPN UKView Full coverage on Google News","content":null,"pubDate":"2021-12-18 18:00:04","image_url":null,"source_id":"google"},{"title":"I like Virat Kohli's attitude but he fights a lot, says Sourav Ganguly","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-south-africa/i-like-virat-kohlis-attitude-but-he-fights-a-lot-says-sourav-ganguly/articleshow/88363573.cms","keywords":null,"creator":null,"video_url":null,"description":"Board of Control for Cricket in India (BCCI) president Sourav Ganguly on Saturday spoke honestly regarding what he felt about Virat Kohli's attitude, saying he likes the Indian Test skipper's \"attitude but he fights a lot\".","content":null,"pubDate":"2021-12-18 17:31:39","full_description":null,"image_url":null,"source_id":"toi"},{"title":"Cricket West Indies To Start Senior Men's Panel Recruitment In January","link":"https://sports.ndtv.com/cricket/cwi-to-commence-recruitment-for-senior-mens-selection-panel-in-january-2658778","keywords":null,"creator":null,"video_url":null,"description":"Cricket West Indies (CWI) on Saturday announced that it will commence a recruitment process for the new men's selection panel in January.","content":null,"pubDate":"2021-12-18 16:02:52","full_description":"Cricket West Indies (CWI) on Saturday announced that it will commence a recruitment process for the new men's selection panel in January. The recruitment will replace lead selector Roger Harper and fellow selector Miles Bascombe, whose contracts will not be renewed when they come to an end on December 31. An interim selection panel has been established, with head coach Phil Simmons at the helm, along with the captains in the respective men's formats. Jimmy Adams, CWI's director of cricket, will oversee the process. Adams in a statement said: \"We want to thank Roger and Miles for their work and dedicated services to West Indies cricket in the last two years, as members of the Men's Senior Selection Panel. Selecting West Indies teams for the international competition is a very challenging assignment, and both gentlemen performed their roles with transparency and dignity.\" Harper said: \"I would like to thank CWI for the opportunity to serve West Indies cricket in the role of Lead Selector and I wish the organization the very best for the future. I would also like to thank all those whose efforts and cooperation helped me to perform my role efficiently. Special thanks to Miles for his professionalism and teamwork. God bless.\" Promoted The West Indies men's next series is against Ireland at Sabina Park, Jamaica where they will play the three-match One-Day International series and a one-off T20 International from January 8 to 16.","image_url":"https://c.ndtvimg.com/2021-11/8asld11_west-indies_625x300_04_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"BCCI Shares Multiple Photos Of India's First Training Session In SA","link":"https://sports.ndtv.com/cricket/bcci-shares-multiple-photos-of-indias-first-training-session-in-south-africa-ahead-of-1st-test-2658751","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) shared multiple photographs in a series of tweets to give the fans glimpse of India's first training session in South Africa on Saturday.","content":null,"pubDate":"2021-12-18 15:42:30","full_description":"Team India began their preparations for the upcoming three-match Test series in South Africa. The Virat Kohli-led Indian Test side competed their first training session in Centurion on Saturday ahead of the series-opening Boxing Day Test on December 26 at the SuperSport Park. The Board of Control for Cricket in India (BCCI) shared multiple photographs in a series of tweets to give the fans glimpse of India's training session. \" #TeamIndia begin preparations for the first Test in Centurion First practice session done,” wrote the BCCI with the photos. In the photos, India's Test captain Virat Kohli, vice-captain for this series – Rohit has been ruled out due to a hamstring injury – KL Rahul, opener Mayank Agarwal, Ajinkya Rahane, pacer Jsaprit Bumrah, Mohammed Siraj, Umesh Yadav, spinner Ravichandran Ashwin and others were seen training under the watchful eyes of head coach Rahul Dravid, batting coach Vikram Rathour. #TeamIndia begin preparations for the first Test in Centurion 🏟️👌🏻 First practice session done ✅ #SAvIND pic.twitter.com/kNjutdpF64 The Indian team is missing a few key players like Rohit and Ravindra Jadeja and Shubman Gill – all ruled out due to injuries – and have the likes of Cheteshwar Pujara, Rahane and also captain Kohli who are not in the best of forms but they have shown in their last two away tours in England and Australia that they know how to bounce back against all odds. The record is not in India's favour. They are yet to win a Test series in South Africa but considering India's bowling attack, their recent overseas record and South Africa's not so menacing Test squad, many believe this might be the best opportunity for the visitors to win their maiden series. India are slated to play three Tests followed by as many ODIs in South Africa.","image_url":"https://c.ndtvimg.com/2021-12/5stjicio_india-training_120x90_18_December_21.jpg","source_id":"ndtv"},{"title":"Australia can ‘BURY England’s morale’ in second Test but even Aussie legend Brad Hogg doesn’t want Ashes whitewash – ‘I’m looking at the future of cricket’","link":"https://talksport.com/sport/cricket/1005191/australia-england-second-test-ashes-whitewash/","keywords":["Cricket","Sport","Australia Cricket","Brad Hogg","England Cricket"],"creator":["Sean O'Brien"],"video_url":null,"description":"England were left staring at another heavy defeat after a bruising day three in the second Ashes Test against Australia. Having lost the first Test in resounding fashion, the tourists look set to find themselves on the end of another hiding in Adelaide. Joe Root’s men collapsed from 150-2 to 236 all-out, in response to […]","content":"England were left staring at another heavy defeat after a bruising day three in the second Ashes Test against Australia. Having lost the first Test in resounding fashion, the tourists look set to find themselves on the end of another hiding in Adelaide. The series goes from bad to worse for EnglandGetty Joe Root’s men collapsed from 150-2 to 236 all-out, in response to their hosts’ first-innings declaration on 473. Rather than enforcing the follow-on, Steve Smith elected to bat again, perhaps in order to twist the knife, suggests Aussie legend Brad Hogg. He told talkSPORT: “You can really bury them, in a sense, bury their morale before we get to the Melbourne Test. “If I was playing for Australia, I’d want to bat again to really dent the morale of the England team.” However, even Hogg does not want to see England truly embarrassed over in Australia, insisting a whitewash would be bad for the game. The Aussies have been rampant with bat and ballAFP He added: “From the game’s perspective, from a promotional side of things, I don’t want to see 5-0. “I want to see England have a fightback and really put pressure on Australia – because I love seeing those close contests. “Seeing India beat Australia in that Brisbane Test match and taking the series away, that was really exciting. “It just shows that teams can come over and beat us on home soil. It gives us a different perspective and that’s what I want to see. He added: “I’m looking at the future of cricket. Not just burying England and being on a high here in Australia.”","pubDate":"2021-12-18 15:11:41","full_description":"England were left staring at another heavy defeat after a bruising day three in the second Ashes Test against Australia. Having lost the first Test in resounding fashion , the tourists look set to find themselves on the end of another hiding in Adelaide. Joe Root’s men collapsed from 150-2 to 236 all-out, in response to their hosts’ first-innings declaration on 473. Rather than enforcing the follow-on, Steve Smith elected to bat again, perhaps in order to twist the knife, suggests Aussie legend Brad Hogg. He told talkSPORT: “You can really bury them, in a sense, bury their morale before we get to the Melbourne Test. “If I was playing for Australia, I’d want to bat again to really dent the morale of the England team.” However, even Hogg does not want to see England truly embarrassed over in Australia, insisting a whitewash would be bad for the game. He added: “From the game’s perspective, from a promotional side of things, I don’t want to see 5-0. “I want to see England have a fightback and really put pressure on Australia – because I love seeing those close contests. “Seeing India beat Australia in that Brisbane Test match and taking the series away, that was really exciting. “It just shows that teams can come over and beat us on home soil. It gives us a different perspective and that’s what I want to see. He added: “I’m looking at the future of cricket. Not just burying England and being on a high here in Australia.”","image_url":null,"source_id":"talksport"},{"title":"BCCI announces appointment of Committees following 90th AGM","link":"https://zeenews.india.com/cricket/bcci-announces-appointment-of-committees-following-90th-agm-2420589.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) today announced the appointment of various committees following the 90th AGM of the BCCI held earlier this month.","content":null,"pubDate":"2021-12-18 14:53:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"‘P*sstake’: Text saved Aussies from calamity - NEWS.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMixQFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L3RoZS1hc2hlcy9wc3N0YWtlLW1pdGNoZWxsLXN0YXJjLWFuZC1uYXRoYW4tbHlvbi13ZXJlLW9uZS10ZXh0LW1lc3NhZ2UtYXdheS1mcm9tLWJlaW5nLXdpdGhkcmF3bi1mcm9tLWFkZWxhaWRlLXRlc3QvbmV3cy1zdG9yeS82NTdlZmU0MTVjMWZjNWE2NWNiMzhhZmVlZDVmYTAyZNIByQFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L3RoZS1hc2hlcy9wc3N0YWtlLW1pdGNoZWxsLXN0YXJjLWFuZC1uYXRoYW4tbHlvbi13ZXJlLW9uZS10ZXh0LW1lc3NhZ2UtYXdheS1mcm9tLWJlaW5nLXdpdGhkcmF3bi1mcm9tLWFkZWxhaWRlLXRlc3QvbmV3cy1zdG9yeS82NTdlZmU0MTVjMWZjNWE2NWNiMzhhZmVlZDVmYTAyZD9hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘P*sstake’: Text saved Aussies from calamity  NEWS.com.au‘It was a pisstake’: How stroke of dumb luck prevented Aussie Covid catastrophe  Fox SportsShould Pat play? Two cricket tragics come out swinging  The AdvertiserAustralia tighten grip on series after England blow perfect chance to fight back  Sydney Morning HeraldView Full coverage on Google News","content":null,"pubDate":"2021-12-18 14:53:00","image_url":null,"source_id":"google"},{"title":"R Ashwin Reacts After Ricky Ponting Predicts Australia Player's Wicket","link":"https://sports.ndtv.com/cricket/ravichandran-ashwin-reacts-after-ricky-ponting-predicts-australia-all-rounder-cameron-greens-dismissal-in-2nd-test-against-england-2658664","keywords":null,"creator":null,"video_url":null,"description":"\"Cricket literacy rate,\" wrote R Ashwin with a couple of emojis suggesting an upward curve quoting Ricky Ponting's video, in which he had predicted Australia all-rounder Cameron Green's dismissal.","content":null,"pubDate":"2021-12-18 14:43:13","full_description":"Ravichandran Ashwin reacted after Ricky Ponting predicted Australia all-rounder Cameron Green's dismissal on Day 2 of the ongoing second Ashes Test against England in Adelaide. “Cricket literacy rate,” wrote the India off-spinner with a couple of emojis suggesting an upward curve. Ponting, during commentary, while pointing out the issues in Green's technique, had predicted that England might target the tall right-hander by aiming at the stumps moments before Ben Stoke cleaned him up. \"A very distinct change of tactics now for Cam Green. They'll be a lot fuller and lot straighter, they'll target his stumps. He sets up with a very open front foot, that is generally a sign of someone worried about getting LBW and does not want their front foot too far across in the line of the stumps,\" Ponting said while commentating on 7Cricket. Cricket literacy rate ✈️✈️ https://t.co/YiaiQa9hvE Australia, meanwhile, tightened the grip on the pink ball Test match. After bowling England out for 236 in the first innings, they reached 45 for 1 at stumps on Day 3, enjoying a huge lead of 282 runs in the second Test. The visitors who were in control in the first session found themselves in a deep hole after losing 8 wickets for 86 runs this afternoon. Dawid Malan and Joe Root top-scored for England with innings of 80 and 62 respectively. Ben Stokes and Chris Woakes were the only other batters for visitors to reach the double-figure mark. For hosts, Mitchell Starc starred with the ball as he scalped four wickets, while Nathan Lyon bagged three. Cameron Greem returned with two wickets while Neser with one. Promoted Australia returned to bat in the final session and their batters spent tricky 17 over-stretch as England failed to start their fightback. The lone wicket of David Warner was courtesy a needless mix-up between the openers. The tidy fielding by Stuart Broad made sure that the only chance doesn't go begging for the English side. (With ANI inputs)","image_url":"https://c.ndtvimg.com/2021-12/mjv7jdik_ravichandran-ashwin_625x300_15_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Cricket-Seamers to give India hope of first series win in S.Africa says Pujara","link":"https://www.thestar.com.my/sport/cricket/2021/12/18/cricket-seamers-to-give-india-hope-of-first-series-win-in-safrica-says-pujara","keywords":null,"creator":null,"video_url":null,"description":"CAPE TOWN (Reuters) - India batsman Cheteshwar Pujara says they are confident of claiming a historic first test series win in South Africa, led by their potent fast bowling attack on the lively Highveld wickets where the first two of three tests will be played. Read full story","content":null,"pubDate":"2021-12-18 14:41:00","full_description":"CAPE TOWN (Reuters) - India batsman Cheteshwar Pujara says they are confident of claiming a historic first test series win in South Africa, led by their potent fast bowling attack on the lively Highveld wickets where the first two of three tests will be played. India are fresh from home success against New Zealand, while South Africa have not played red ball cricket since June ahead of the first test that starts in Pretoria on Dec. 26. \"We have played a couple of tests in India, so most of the guys are in touch,\" Pujara told the Board of Control for Cricket in India on Saturday. \"There is enough time for us to prepare and the guys are really looking forward to these tests. It is the best chance for us to finally win a series in South Africa.\" Pujara believes the growing influence of India's fast bowling attack, which has led to success overseas in the recent past, gives them confidence they can match the home side on what are usually seamer-friendly wickets in South Africa. \"Our fast bowlers have been the difference between the sides overall when we have played abroad. If you look at the Australia and England series, we have done exceptionally well as a bowling unit. \"Our fast bowlers are our strength (in South Africa) and I hope they can utilise the conditions and give us 20 wickets in each test match.\" South Africa may be undercooked, with a number of their leading players having not featured in first class cricket since their series win in West Indies in June, but Pujara says India must concentrate on what they can do well and not think about the opposition's troubles. \"We would not think too much about whether we have the upper hand or not. We will try and stick to our game-plan and our processes, and the things we need to do to be successful in South Africa.\" (Reporting by Nick Said; Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/18/1411883.jpg","source_id":"thestar_my"},{"title":"Cameron Green bests Joe Root again to prove increasing worth to Australia | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2021/dec/18/cameron-green-joe-root-australia-england-ashes","keywords":["Ashes 2021-22","Australia cricket team","Joe Root","England cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Geoff Lemon at Adelaide Oval"],"video_url":null,"description":"All-rounder’s numbers are not too special but he has curtailed England by twice removing their talisman in these AshesDecades from now, when some awkward teenager in a biosecure bunker tries to forget about the grimness of the dying planet outside by scrolling through old cricket statistics on their settlement’s offline intranet, they will think that Joe Root in 2021 must have been kissed on the nose by a sunbeam. Not only did he get to spend time outdoors, above ground, with no concern for atmospheric chlorine or flying sharks, but he made runs wherever he went, against all-comers, racing up the record list like a 12-legged scorpion up a respirator pipe.For his final stanza, the tour of Australia, his numbers will carry on the earlier prolific trend, at least through the first two matches in Brisbane and Adelaide. In neither match, though, has he done what he did in almost every other series this year: make centuries. Touring in Asia, three matches brought him 228, 186 and 218. Four matches in England brought 109, an unbeaten 180 and 121. Continue reading...","content":null,"pubDate":"2021-12-18 14:31:46","full_description":"D ecades from now, when some awkward teenager in a biosecure bunker tries to forget about the grimness of the dying planet outside by scrolling through old cricket statistics on their settlement’s offline intranet, they will think that Joe Root in 2021 must have been kissed on the nose by a sunbeam. Not only did he get to spend time outdoors, above ground, with no concern for atmospheric chlorine or flying sharks, but he made runs wherever he went , against all-comers, racing up the record list like a 12-legged scorpion up a respirator pipe. For his final stanza, the tour of Australia, his numbers will carry on the earlier prolific trend, at least through the first two matches in Brisbane and Adelaide. In neither match, though, has he done what he did in almost every other series this year: make centuries. Touring in Asia, three matches brought him 228, 186 and 218. Four matches in England brought 109, an unbeaten 180 and 121. In Australia, his processions have been roadblocked at 89 and 62, scores big enough to reaffirm Root’s current fineness of touch but not big enough to define the matches that contain them. Not that Root’s centuries were always enough to drag his struggling team to victory, but in Australia his two good innings have been curtailed before that even became a chance. Both times, the reason has been Cameron Green. Across the course of three overs to start the second session of day three at Adelaide , Australia’s tall all-rounder gave Root some serious testing around his off-stump. Green bashed the ball into the surface, finding dramatic lift and a bit of movement while staying unerringly accurate in his line. Root groped for a few deliveries, ran one boundary away off the face of his bat, and not long afterwards edged behind trying a similar shot. A small amount of seam movement away from him was enough to do him in at second slip. That made it two dismissals in two innings for Green, after Root had reached for a more conventional delivery in Brisbane and nicked to the keeper. After that Test he gave the young Green some lukewarm praise, saying that he was a “talented” cricketer but that England’s batters would play him better having seen him operate in two innings. Instead of them playing him better, Green bowled better to them. Familiarity certainly did not help Root. The significance, of course, is that Root has twice been able to survive bulk attention from Australia’s frontline bowlers – Nathan Lyon and Mitchell Starc in both matches, Pat Cummins and Josh Hazlewood in Brisbane, Michael Neser and Jhye Richardson in Adelaide – only to fall to the fifth option used. He has faced 281 deliveries across two innings, largely from those principal bowlers, before giving a breakthrough to the relief option. A year ago, in his first Test season, Green’s bowling was stopgap, with his recovery from a back injury limiting him to a few overs of unthreatening medium-fast stuff. This season he has regained velocity and added effort after thundering to the crease, regularly clocking speeds in the bracket reserved for fast bowlers who carry no caveat. He is becoming an option, not a fallback. Bowlers before a series always talk about targeting the opposition’s best bat. Green has been the one to succeed. He may not have made runs yet at No 6, but any player who could offer the wicket of Root in every innings would be worth their place for that alone. Even against a functional team. But this is a team that routinely lose their first two wickets in a matter of minutes to bring Root to the middle, then collapses as soon as he departs. In Adelaide, Root helped add 138 runs before getting out, from which point England lost eight wickets for 86. In Brisbane he added 168 before a collapse of seven for 68. In the first innings, where he made a rare duck, England kept sliding with eight for 136. When Green has dismissed Root, it hasn’t been a matter of felling the queen on a chessboard. It’s removing the base piece from a Jenga tower. All of this is information that our post-apocalyptic kid might never find. Root has achieved wonderful personal results, with only three players left ahead of him on the list for Test runs in a year. But he hasn’t had a wonderful year personally, with the strain of trying to lead a team that crumbles around him like this. His first three big scores created wins in Sri Lanka and in India. In the three remaining India Tests, his team were destroyed. Only one of his home hundreds got England across the line, in a series in effect lost through a cancelled match that will be played next year. The numbers are one thing; the story behind them can be something else. A bowler such as Green – five wickets from six Tests at 34 runs each, a record you would call handy but unspectacular – can attest to that.","image_url":"https://i.guim.co.uk/img/media/924d850597390c1cbd3c77c7e2c1845b48faabdd/0_3_2969_1781/master/2969.jpg?width=460&quality=85&auto=format&fit=max&s=9e1ff9d19f9b7e102607f12273cf75bf","source_id":"theguardian"},{"title":"Cricket-Australia&#039;s Lyon turns the table on England in pink-ball test","link":"https://www.thestar.com.my/sport/cricket/2021/12/18/cricket-australia039s-lyon-turns-the-table-on-england-in-pink-ball-test","keywords":null,"creator":null,"video_url":null,"description":"ADELAIDE (Reuters) - England would be justified in wishing Nathan Lyon had opted for an inside table at an Adelaide restaurant on Wednesday after the veteran Australian spinner wrecked Joe Root's team in the day-night second Ashes test on Saturday. Read full story","content":null,"pubDate":"2021-12-18 14:16:00","full_description":"ADELAIDE (Reuters) - England would be justified in wishing Nathan Lyon had opted for an inside table at an Adelaide restaurant on Wednesday after the veteran Australian spinner wrecked Joe Root's team in the day-night second Ashes test on Saturday. Australia's regular skipper Pat Cummins missed the pink-ball contest after being a close contact of a positive COVID-19 case having dined at the same restaurant. While Cummins dined inside, Lyon opted for an outside seat and escaped South Australia's strict COVID-19 protocols that ruled out his captain. Australia are also without the injured Josh Hazlewood but Lyon and Mitchell Star shared seven wickets between them as they bundled out England for 236 to put the hosts in the box seat. While the 34-year-old off-spinner was always going to be one of the first names on the team sheet, the absence of the frontline quicks placed him more front and centre than ever. Lyon responded by hollowing out England's middle order, dismissing Ollie Pope, Chris Woakes and Ollie Robinson. An economy rate of 2.07 an over - only Starc with far fewer overs coming anywhere near in this innings - was pivotal to pegging down England and his 3-58 was significant beyond mere statistics. \"Nathan is a fantastic first-class bowler, he has been world class for a long side,\" Starc said. \"He knows what he is doing no matter what the colour of the ball.\" Joe Root and Dawid Malan forged a 138-run stand to frustrate Australia in the wicketless first session and Lyon played a key role after the dinner break as Australia took charge of the contest. \"For us quicks to bowl in partnership with him was pretty key in how we went in the second session,\" Starc said. \"He is a big part of our bowling attack.\" Malan too took time to praise Lyon post-match as \"a fantastic player\". (Editing by Amlan Chakraborty, Ken Ferris and David Holmes)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/18/1411868.jpg","source_id":"thestar_my"},{"title":"Rajdeep, Naba shine in Jnan Jyoti Milan Sangha's win","link":"https://www.sentinelassam.com/sports-news/rajdeep-naba-shine-in-jnan-jyoti-milan-sanghas-win-568557","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"A half century from Rajdeep Das followed by a good spell from spinner Naba Kumar Baruah guided Jnan Jyoti Milan Sangha to 26 runs victory over Premier Club in the Assam Premier Club Cricket tournament held at Mangaldoi today.","content":"Our Sports ReporterGUWAHATI: A half century from Rajdeep Das followed by a good spell from spinner Naba Kumar Baruah guided Jnan Jyoti Milan Sangha to 26 runs victory over Premier Club in the Assam Premier Club Cricket tournament held at Mangaldoi today. Rode on Rajdeep Das's 69 balls 54 and Naba Kumar Baruah's unbeaten 43 Jnan Jyoti Milan Sangha scored 188-6 in 35 overs. Later they bowled out Premier Club for 162. Naba picked up 4-24 and he got good support from Sanjib Kumar Sarmah (3-26).Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:58:30","full_description":"Our Sports Reporter GUWAHATI: A half century from Rajdeep Das followed by a good spell from spinner Naba Kumar Baruah guided Jnan Jyoti Milan Sangha to 26 runs victory over Premier Club in the Assam Premier Club Cricket tournament held at Mangaldoi today. Rode on Rajdeep Das's 69 balls 54 and Naba Kumar Baruah's unbeaten 43 Jnan Jyoti Milan Sangha scored 188-6 in 35 overs. Later they bowled out Premier Club for 162. Naba picked up 4-24 and he got good support from Sanjib Kumar Sarmah (3-26). Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284308-9.jpg","source_id":"sentinel"},{"title":"Dibrugarh, Barpeta, Rangia, Golaghat win in RG Baruah Cricket Championship","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/dibrugarh-barpeta-rangia-golaghat-win-in-rg-baruah-cricket-championship-568556","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Dibrugarh, Barpeta, Rangia and Golaghat won their respective matches in the RG Baruah Cricket Championship held at different venues on Friday. Barpeta defeated Jorhat by 63 runs and Rangia won against Morigaon by 26 runs. In the other two games Golaghat thrashed Lakhimpur by 96 runs while Dibrugarh registered 49 runs victory over Bongaigaon.","content":"Our Sports ReporterGUWAHATI: Dibrugarh, Barpeta, Rangia and Golaghat won their respective matches in the RG Baruah Cricket Championship held at different venues on Friday. Barpeta defeated Jorhat by 63 runs and Rangia won against Morigaon by 26 runs. In the other two games Golaghat thrashed Lakhimpur by 96 runs while Dibrugarh registered 49 runs victory over Bongaigaon. Brief scores: ACA Stadium- Dibrugarh 164-7 (35 overs), Bishal Kumar 36, Vivek Dutta 30, Sujal Sarkar 4-36, Bongaigaon 115 (23.1 overs), Rahul Tarafdar 40 no, Rajeev Dubey 3-16, Dyutimoy Nath 3-20. Amingaon Ground: Barpeta 156 (31.5 overs), Ranjan Bikash Das 42, Krishna Das 31, Dibyajyoti Bora 3-31, Jorhat 93 (25.5 overs), Altaf Hussain 28, Bishnu Das 4-17, Sidhyan Mahato 3-25. Nehru stadium: Rangia 181-9 (35 overs), Aryan Mandal 35, Sumit Bishnoi 25, Morigaon 155-6 (35 overs), Himangshu Bhagavati 57. ACA Stadium: Golaghat 183-2 (35 overs), Krishanu Patar 66 no, Nandan Pator 54, Lakhimpur 87 (33.3 overs), Koustab Konwar 29, Adriyan Kashyap 4-5. Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:55:53","full_description":"Our Sports Reporter GUWAHATI: Dibrugarh, Barpeta, Rangia and Golaghat won their respective matches in the RG Baruah Cricket Championship held at different venues on Friday. Barpeta defeated Jorhat by 63 runs and Rangia won against Morigaon by 26 runs. In the other two games Golaghat thrashed Lakhimpur by 96 runs while Dibrugarh registered 49 runs victory over Bongaigaon. Brief scores: ACA Stadium- Dibrugarh 164-7 (35 overs), Bishal Kumar 36, Vivek Dutta 30, Sujal Sarkar 4-36, Bongaigaon 115 (23.1 overs), Rahul Tarafdar 40 no, Rajeev Dubey 3-16, Dyutimoy Nath 3-20. Amingaon Ground: Barpeta 156 (31.5 overs), Ranjan Bikash Das 42, Krishna Das 31, Dibyajyoti Bora 3-31, Jorhat 93 (25.5 overs), Altaf Hussain 28, Bishnu Das 4-17, Sidhyan Mahato 3-25. Nehru stadium: Rangia 181-9 (35 overs), Aryan Mandal 35, Sumit Bishnoi 25, Morigaon 155-6 (35 overs), Himangshu Bhagavati 57. ACA Stadium: Golaghat 183-2 (35 overs), Krishanu Patar 66 no, Nandan Pator 54, Lakhimpur 87 (33.3 overs), Koustab Konwar 29, Adriyan Kashyap 4-5. Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284306-dibru.jpg","source_id":"sentinel"},{"title":"Bud Cricket Club to face Titans in opening game","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/bud-cricket-club-to-face-titans-in-opening-game-568555","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Bud Cricket Club will take on Titans Club in the opening game of the 4th Assam Premier Club Championship at Amingaon ground in the city on Sunday. Altogether 11 teams will participate in this edition of the meet and the teams are divided into three groups.","content":"Our Sports ReporterGUWAHATI: Bud Cricket Club will take on Titans Club in the opening game of the 4th Assam Premier Club Championship at Amingaon ground in the city on Sunday. Altogether 11 teams will participate in this edition of the meet and the teams are divided into three groups. Group 'A' comprised City Cricket Club, Ankurjyoti Club and Santipur AC. Four teams which are in group 'B' are Bud Cricket Club, Gauhati Town Club, Titans Club and Royals Club. Teams in group 'C': ASEBSC, SG Club, River Rine Club and New Star Club. Both the Semi finals will be held on January 5 and 6 while the final is slated for January 8. Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:53:43","full_description":"Our Sports Reporter GUWAHATI: Bud Cricket Club will take on Titans Club in the opening game of the 4th Assam Premier Club Championship at Amingaon ground in the city on Sunday. Altogether 11 teams will participate in this edition of the meet and the teams are divided into three groups. Group 'A' comprised City Cricket Club, Ankurjyoti Club and Santipur AC. Four teams which are in group 'B' are Bud Cricket Club, Gauhati Town Club, Titans Club and Royals Club. Teams in group 'C': ASEBSC, SG Club, River Rine Club and New Star Club. Both the Semi finals will be held on January 5 and 6 while the final is slated for January 8. Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284305-cricket.jpg","source_id":"sentinel"},{"title":"BCCI announces appointment of Committees following the 90th AGM","link":"https://www.business-standard.com/article/sports/bcci-announces-appointment-of-committees-following-the-90th-agm-121121800673_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India today announced the appointment of various committees following the 90th AGM of the BCCI held earlier this month","content":null,"pubDate":"2021-12-18 13:50:00","full_description":"The Board of Control for Cricket in India (BCCI) today announced the appointment of various committees following the 90th AGM of the BCCI held earlier this month. It was at The 90th Annual General Meeting that BCCI announced the formation of the Tours, Fixtures and Technical Committee, Umpires Committee, and Differently Abled Cricket Committee. Tours, Fixtures, and Technical Committee consists of Amitabh Vijayvargiya, Jayendra Sahgal, Raghuram Bhat, Prabir Chakrabarty, and Hari Narayan Pujari. The senior Tournament Committee has Vishal Jagota, Vikas Katyal, Rajesh Garsondia, Surendra Shewale, and Lalrothuama. The Umpires Committee will have Amiesh Saheba, Krishna Hariharan, and Sudhir Asnani. Differently-Abled Cricket Committee consists of Ravikant Chauhan, Sumit Jain, and Mahantesh Kivadasannavar. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211218/thumb-121121800673.jpg","source_id":"business-standard"},{"title":"England lose more WTC points for slow over-rate","link":"https://www.sentinelassam.com/sports-news/england-lose-more-wtc-points-for-slow-over-rate-568550","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England cricket team have been docked eight ICC World Test Championship points -- three more than previously stated -- for maintaining a slow over-rate in the first Ashes Test against Australia, the International Cricket Council (ICC) clarified on Friday.","content":"DUBAI: England cricket team have been docked eight ICC World Test Championship points -- three more than previously stated -- for maintaining a slow over-rate in the first Ashes Test against Australia, the International Cricket Council (ICC) clarified on Friday.After the first Test in Brisbane, it was announced on last Saturday that England would be docked five WTC points, one for each over they were found to initially have fallen short by. However, it has since emerged they were eight overs short, and will therefore lose three additional points. That left them with six points after five Tests in the ongoing 2021-23 cycle of the WTC, putting them at the 7th spot in the table, with a win percentage of 10 percent. \"England were eight overs short (not five overs short as previously announced) but were only fined 100 percent of their match fee due to the limit,\" the ICC said in a statement. \"However, the points deduction for penalty overs is not capped and must reflect the actual number of penalty overs a team is short of the minimum requirement as per Clause 16.1.2 of the ICC Playing Conditions, hence they have been penalised one point for each over they were short,\" it added. IANS Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:45:53","full_description":"DUBAI: England cricket team have been docked eight ICC World Test Championship points -- three more than previously stated -- for maintaining a slow over-rate in the first Ashes Test against Australia, the International Cricket Council (ICC) clarified on Friday. After the first Test in Brisbane, it was announced on last Saturday that England would be docked five WTC points, one for each over they were found to initially have fallen short by. However, it has since emerged they were eight overs short, and will therefore lose three additional points. That left them with six points after five Tests in the ongoing 2021-23 cycle of the WTC, putting them at the 7th spot in the table, with a win percentage of 10 percent. \"England were eight overs short (not five overs short as previously announced) but were only fined 100 percent of their match fee due to the limit,\" the ICC said in a statement. \"However, the points deduction for penalty overs is not capped and must reflect the actual number of penalty overs a team is short of the minimum requirement as per Clause 16.1.2 of the ICC Playing Conditions, hence they have been penalised one point for each over they were short,\" it added. IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284299-eng.jpg","source_id":"sentinel"},{"title":"Labuschagne hits 6th ton in 20 Tests : Smith misses 28th ton","link":"https://www.sentinelassam.com/sports-news/labuschagne-hits-6th-ton-in-20-tests-smith-misses-28th-ton-568544","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Australia removed England openers Rory Burns and Haseeb Hameed to leave the tourists at 17/2 in 8.4 overs, trailing by 456 runs at stumps on day two of the second Ashes Test at the Adelaide Oval.","content":"Australia remove England's openers after declaring at 473/9 ADELAIDE: Australia removed England openers Rory Burns and Haseeb Hameed to leave the tourists at 17/2 in 8.4 overs, trailing by 456 runs at stumps on day two of the second Ashes Test at the Adelaide Oval. After Australia, on the back of counter-attack from the lower-order, declared at 473/9 in the first innings, Mitchell Starc and Michael Neser took out Burns and Hameed before a large lightning strike outside the venue forced early stumps to be called on a day thoroughly dominated by Australia. In the final session, debutant Neser and Starc inflicted more misery on England with stunning late cameos. Neser and Starc shared a rollicking 58-run stand off just 51 balls as the hosts' lower-order, along with Jhye Richardson, added 89 runs in only 10 overs before captain Steve Smith declared the innings. With the ball, Starc struck on the first ball of his second over as Burns edged a nipping away delivery straight to Steve Smith at second slip. Neser got his first Test wicket on just his second ball as Haseeb Hammed chipped to mid-on. A massive flash of lightning outside the venue when Neser bowled the fourth ball to Dawid Malan prompted the umpires to take the players off the field, eventually causing stumps. Earlier, Marnus Labuschagne competed his sixth Test century while Steve Smith fell short of his and Carey chipped in with a half-century as Australia piled on the runs on an improved yet hapless England bowling attack. Resuming from 221/2, Smith got the first boundary with a fierce cut through point off James Anderson. Labuschagne, who ended day one unbeaten on 95, reached his maiden century in the Ashes with a streaky edge past the slip cordon off Anderson for his eighth boundary in a gritty knock. Labuschagne reached the three-figure mark in 287 balls, making this his slowest century in Test cricket. The right-handed batter, who earned two reprieves on 21 and 95, was caught behind by keeper Jos Buttler on 102 off Ollie Robinson's first delivery of the day. But replays showed that Robinson's foot was on the line with nothing behind, giving Labuschagne another life. Eventually, Robinson had the last laugh in his next over, with a nip-backer that Labuschagne shouldered arms to and hitting him on the knee roll of back pad. The 27-year-old reviewed but couldn't change the decision. Smith, in company of Travis Head, continued to move forward to reach his 32nd half-century, with a top-edge flying past Buttler while pulling a short ball from Ben Stokes. Head lofted over Joe Root's head but the England captain got his wicket on the next ball, foxing the left-hander into yorking himself. Cameron Green didn't last long as Stokes got one to move past the outer edge and hit the top of off-stump. Smith and Carey ensured that Australia didn't lose another wicket till dinner break arrived. After the break, Carey, the hometown boy, was watchful at start but looked for scoring opportunities whenever it came while Smith was on cruise mode. While Carey feasted on Root's part-time off-spin, Smith was quick in dispatching all bad balls to the boundary. The 91-run stand between Smith and Carey was broken by James Anderson, whose low nip-backer rapped Smith plumb in front of the pads. Smith's dismissal on 93 meant that he missed out on his 28th Test century,16th as skipper and 12th in the Ashes. Brief Scores: Australia 473 for 9 decl in 150.4 overs (Marnus Labuschagne 103, David Warner 95,Steve Smith 93; James Anderson 2/58) lead England 17/2 in 8.4 overs (Michael Neser 1/4, Mitchell Starc 1/11) by 456 runs. IANS Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:36:06","full_description":"Australia remove England's openers after declaring at 473/9 ADELAIDE: Australia removed England openers Rory Burns and Haseeb Hameed to leave the tourists at 17/2 in 8.4 overs, trailing by 456 runs at stumps on day two of the second Ashes Test at the Adelaide Oval. After Australia, on the back of counter-attack from the lower-order, declared at 473/9 in the first innings, Mitchell Starc and Michael Neser took out Burns and Hameed before a large lightning strike outside the venue forced early stumps to be called on a day thoroughly dominated by Australia. In the final session, debutant Neser and Starc inflicted more misery on England with stunning late cameos. Neser and Starc shared a rollicking 58-run stand off just 51 balls as the hosts' lower-order, along with Jhye Richardson, added 89 runs in only 10 overs before captain Steve Smith declared the innings. With the ball, Starc struck on the first ball of his second over as Burns edged a nipping away delivery straight to Steve Smith at second slip. Neser got his first Test wicket on just his second ball as Haseeb Hammed chipped to mid-on. A massive flash of lightning outside the venue when Neser bowled the fourth ball to Dawid Malan prompted the umpires to take the players off the field, eventually causing stumps. Earlier, Marnus Labuschagne competed his sixth Test century while Steve Smith fell short of his and Carey chipped in with a half-century as Australia piled on the runs on an improved yet hapless England bowling attack. Resuming from 221/2, Smith got the first boundary with a fierce cut through point off James Anderson. Labuschagne, who ended day one unbeaten on 95, reached his maiden century in the Ashes with a streaky edge past the slip cordon off Anderson for his eighth boundary in a gritty knock. Labuschagne reached the three-figure mark in 287 balls, making this his slowest century in Test cricket. The right-handed batter, who earned two reprieves on 21 and 95, was caught behind by keeper Jos Buttler on 102 off Ollie Robinson's first delivery of the day. But replays showed that Robinson's foot was on the line with nothing behind, giving Labuschagne another life. Eventually, Robinson had the last laugh in his next over, with a nip-backer that Labuschagne shouldered arms to and hitting him on the knee roll of back pad. The 27-year-old reviewed but couldn't change the decision. Smith, in company of Travis Head, continued to move forward to reach his 32nd half-century, with a top-edge flying past Buttler while pulling a short ball from Ben Stokes. Head lofted over Joe Root's head but the England captain got his wicket on the next ball, foxing the left-hander into yorking himself. Cameron Green didn't last long as Stokes got one to move past the outer edge and hit the top of off-stump. Smith and Carey ensured that Australia didn't lose another wicket till dinner break arrived. After the break, Carey, the hometown boy, was watchful at start but looked for scoring opportunities whenever it came while Smith was on cruise mode. While Carey feasted on Root's part-time off-spin, Smith was quick in dispatching all bad balls to the boundary. The 91-run stand between Smith and Carey was broken by James Anderson, whose low nip-backer rapped Smith plumb in front of the pads. Smith's dismissal on 93 meant that he missed out on his 28th Test century,16th as skipper and 12th in the Ashes. Brief Scores: Australia 473 for 9 decl in 150.4 overs (Marnus Labuschagne 103, David Warner 95,Steve Smith 93; James Anderson 2/58) lead England 17/2 in 8.4 overs (Michael Neser 1/4, Mitchell Starc 1/11) by 456 runs. IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284292-labus.jpg","source_id":"sentinel"},{"title":"Dinner break time in Test cricket: How long are dinner and tea breaks in day-night Tests played with pink balls?","link":"https://thesportsrush.com/cricket-news-dinner-break-time-in-test-cricket-how-long-are-dinner-and-tea-breaks-in-day-night-tests-played-with-pink-balls/","keywords":["Cricket","Test cricket"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Dinner break time in Test cricket: A regular uninterrupted day of Test cricket encompasses of a couple of breaks. The 17th pink-ball Test match in the history of cricket is currently being played between Australia and England in Adelaide. In what is the eighth such Test match being played in Australia, it is the sixth… The post Dinner break time in Test cricket: How long are dinner and tea breaks in day-night Tests played with pink balls? appeared first on The SportsRush.","content":"Dinner break time in Test cricket: A regular uninterrupted day of Test cricket encompasses of a couple of breaks. The 17th pink-ball Test match in the history of cricket is currently being played between Australia and England in Adelaide. In what is the eighth such Test match being played in Australia, it is the sixth at the Adelaide Oval. Playing their ninth day-night Test match, Australia should be able to maintain their unbeaten streak as they lead by 282 runs with nine wickets in hands at Stumps on Day 3. While an Australian victory will continue their winning spree, an English loss will add to their recent dismal Test record down under. Dinner break time in Test cricket A normal uninterrupted day of Test match cricket follows the norm of three sessions separated by two breaks in between. Because playing for seven hours on the trot can be exhausting, rules have rightly been made around players playing for two hours and then stopping for a break. Day-night Tests are no different for they also follow the same aforementioned pattern. Since pink-ball Test matches begin in the afternoon, a solitary difference is that players break for dinner and not lunch after the first session. The second interval is called as the tea break in both red-ball and pink-ball Tests. Below is the time table of how a normal day-night Test match day in Australia looks like considering if it begins at 02:30 PM (can vary from venue to venue). Start time – 02:30 PM. First session (Afternoon session) – 02:30 PM to 04:30 PM. Dinner break – 04:30 PM to 05:10 PM. Second session (Evening session) – 05:10 PM to 07: 10 PM. Tea break – 07: 10 PM – 07:30 PM. Test cricket under lights #Ashes pic.twitter.com/31fvwjZRZv — ESPNcricinfo (@ESPNcricinfo) December 17, 2021 Third session (Night session) – 07:30 PM – 09:30 PM. Extra time (mandatory if fielding team hasn’t completed 90 overs per day) – 09:30 PM – 10:00 PM. How long are dinner and tea breaks in day-night Tests? As is the case in day Tests, dinner/lunch and tea breaks last for 40 and 20 minutes respectively. Readers must note that there have been cases when a tea break is taken before a dinner break. The same was observed during the India-England day-night Test match in Ahmedabad earlier this year. ALSO READ: Have number of reviews changed in the COVID-19 era? Below is the time table of how a normal day/night Test match day in India looks like considering if it begins at 02:30 PM. Start time – 02:30 PM. First session (Afternoon session) – 02:30 PM to 04:30 PM. Tea break – 04:30 PM to 04:50 PM. Second session (Evening session) – 04:50 PM to 06: 50 PM. Dinner break – 06: 50 PM – 07:30 PM. Third session (Night session) – 07:30 PM – 09:30 PM. Extra time (mandatory if fielding team hasn’t completed 90 overs per day) – 09:30 PM – 10:00 PM. The post Dinner break time in Test cricket: How long are dinner and tea breaks in day-night Tests played with pink balls? appeared first on The SportsRush.","pubDate":"2021-12-18 13:34:20","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Lanka Premier League a boon for youngsters as it prepares them for pressure situations: Arthur","link":"https://www.sentinelassam.com/sports-news/lanka-premier-league-a-boon-for-youngsters-as-it-prepares-them-for-pressure-situations-arthur-568539","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The outgoing chief coach of the Sri Lankan cricket team, Mickey Arthur, feels the Lanka Premier League (LPL) is a boon for younger players as it gives them the opportunity to play under pressure.","content":"COLOMBO: The outgoing chief coach of the Sri Lankan cricket team, Mickey Arthur, feels the Lanka Premier League (LPL) is a boon for younger players as it gives them the opportunity to play under pressure. The South African added that the league is playing an important role in the growth of Sri Lankan cricket. Under Arthur, the likes of Charith Asalanka, Lahiru Kumara and Wanindu Hasaranga have impressed with their performances around the world and the three have been showcasing their skills in the Lanka Premier League as well. \"I think the Lanka Premier League is such a good tournament, particularly for the younger players, because it gives them an opportunity to play under pressure. There's a crowd and there's a good TV audience. You can go and play in the nets a million times, but you can't replicate this atmosphere at the ground.\" IANSAlso Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:26:06","full_description":"COLOMBO: The outgoing chief coach of the Sri Lankan cricket team, Mickey Arthur, feels the Lanka Premier League (LPL) is a boon for younger players as it gives them the opportunity to play under pressure. The South African added that the league is playing an important role in the growth of Sri Lankan cricket. Under Arthur, the likes of Charith Asalanka, Lahiru Kumara and Wanindu Hasaranga have impressed with their performances around the world and the three have been showcasing their skills in the Lanka Premier League as well. \"I think the Lanka Premier League is such a good tournament, particularly for the younger players, because it gives them an opportunity to play under pressure. There's a crowd and there's a good TV audience. You can go and play in the nets a million times, but you can't replicate this atmosphere at the ground.\" IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284284-download.jpg","source_id":"sentinel"},{"title":"Glenn Maxwell should get more Test cricket opportunities: Hussey","link":"https://www.sentinelassam.com/sports-news/glenn-maxwell-should-get-more-test-cricket-opportunities-hussey-568536","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Australian limited-overs cricketer David Hussey is surprised with the limited opportunities given to Glenn Maxwell in the Asian sub-continent despite the all-rounder being an asset in white-ball game for the country.","content":"ADELAIDE: Former Australian limited-overs cricketer David Hussey is surprised with the limited opportunities given to Glenn Maxwell in the Asian sub-continent despite the all-rounder being an asset in white-ball game for the country.The 33-year-old Maxwell has played just seven Tests since debuting in 2013, with the Cricket Australia selection panel citing his aggressive batting as the reason for his non-inclusion in the longest format. But with the busy sub-continental schedule in 2022, where Australia play Pakistan, Sri Lanka and India in a variety of formats, Hussey, who is coach of Big Bash League (BBL) side Melbourne Stars, asked the selectors to give Maxwell more opportunities in Tests as well. Maxwell averages 26 in Tests and it has been reported that the selectors will consider him to play Tests for Australia on the sub-continental tours. Even Maxwell has been quoted as saying that he would like to be in the Test side. \"I think it's definitely realistic (wanting to play Test cricket again). I think I'm probably playing as well as I ever have at the moment,\" he said recently. Hussey told Sportsday on Friday that, \"I'm staggered by how little Test cricket he's (Maxwell) played, especially in the sub-continent. Arguably, and I'm a little bit biased here, I think he's one of the better players of spin in the country. \"I know the upcoming winter we have got a lot of sub-continent tours ahead, so I do believe that he should be in all those touring squads. I think he should add to his (several) Tests for Australia, I think he's in career-best form and it would be the wrong move to write him off now from playing Test cricket again.\" Maxwell has played all his Tests in Asia with the last coming in 2017. IANS Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:21:56","full_description":"ADELAIDE: Former Australian limited-overs cricketer David Hussey is surprised with the limited opportunities given to Glenn Maxwell in the Asian sub-continent despite the all-rounder being an asset in white-ball game for the country. The 33-year-old Maxwell has played just seven Tests since debuting in 2013, with the Cricket Australia selection panel citing his aggressive batting as the reason for his non-inclusion in the longest format. But with the busy sub-continental schedule in 2022, where Australia play Pakistan, Sri Lanka and India in a variety of formats, Hussey, who is coach of Big Bash League (BBL) side Melbourne Stars, asked the selectors to give Maxwell more opportunities in Tests as well. Maxwell averages 26 in Tests and it has been reported that the selectors will consider him to play Tests for Australia on the sub-continental tours. Even Maxwell has been quoted as saying that he would like to be in the Test side. \"I think it's definitely realistic (wanting to play Test cricket again). I think I'm probably playing as well as I ever have at the moment,\" he said recently. Hussey told Sportsday on Friday that, \"I'm staggered by how little Test cricket he's (Maxwell) played, especially in the sub-continent. Arguably, and I'm a little bit biased here, I think he's one of the better players of spin in the country. \"I know the upcoming winter we have got a lot of sub-continent tours ahead, so I do believe that he should be in all those touring squads. I think he should add to his (several) Tests for Australia, I think he's in career-best form and it would be the wrong move to write him off now from playing Test cricket again.\" Maxwell has played all his Tests in Asia with the last coming in 2017. IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284282-glenn.jpg","source_id":"sentinel"},{"title":"Burns needs to evolve technique for surviving in international cricket, warns Cook","link":"https://www.sentinelassam.com/sports-news/burns-needs-to-evolve-technique-for-surviving-in-international-cricket-warns-cook-568527","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former England captain Alastair Cook has warned that opener Rory Burns needs to evolve his unorthodox technique in order to survive in international cricket.","content":"ADELAIDE: Former England captain Alastair Cook has warned that opener Rory Burns needs to evolve his unorthodox technique in order to survive in international cricket.Cook's comments came after Burns edged Mitchell Starc to second slip for just four on day two of second Ashes Test in Adelaide. It has been a horror tour for Burns, who was bowled first ball by Starc in the Ashes opener in Brisbane and has scored just 17 runs in three innings of the ongoing marquee series. In 2021, Burns has a century and three fifties but has six ducks as well. Cook, an accomplished opener for England in Test cricket for more than a decade, believes Burns has to find a solution to be a reliable opener. \"He's almost at that point now where if he wants to take that next step on in international cricket does he have to evolve again? He's been very consistent with this technique at county cricket. This is what he's going to stick to. You're always told in international cricket do what you do in county cricket, don't change how you play. It is probably getting to the stage now where he'll have to sit down himself and say, this is what I've got with my technique, if I want to play even longer for England and play 60, 70, 80 Test matches for England, what do I need to improve?,\" said Cook on BT Sport. \"To start against international quality bowling is tough. It is a hard place to bat. When Rory Burns gets in, he's ok. His inconsistency will be due to having moving parts and getting them all in sync is very hard. This is a method he has worked out himself. You're not going to teach anyone to bat like that, just like Steve Smith worked out his method. He's gone 'this is how I play cricket and score my runs,\" added Cook, who played 161 Tests for England. Adelaide was also the second time where Starc dismissed Burns in the Ashes. Further delving on what the future holds for Burns, Cook remarked, \"It is a technique that he has to decide what he's going to do about. Mitchell Starc for the next five Test matches, if he stays fit, is the perfect combination against him. This does work for Rory Burns on occasions but to be more consistent early on in his innings. IANS Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 13:01:49","full_description":"ADELAIDE: Former England captain Alastair Cook has warned that opener Rory Burns needs to evolve his unorthodox technique in order to survive in international cricket. Cook's comments came after Burns edged Mitchell Starc to second slip for just four on day two of second Ashes Test in Adelaide. It has been a horror tour for Burns, who was bowled first ball by Starc in the Ashes opener in Brisbane and has scored just 17 runs in three innings of the ongoing marquee series. In 2021, Burns has a century and three fifties but has six ducks as well. Cook, an accomplished opener for England in Test cricket for more than a decade, believes Burns has to find a solution to be a reliable opener. \"He's almost at that point now where if he wants to take that next step on in international cricket does he have to evolve again? He's been very consistent with this technique at county cricket. This is what he's going to stick to. You're always told in international cricket do what you do in county cricket, don't change how you play. It is probably getting to the stage now where he'll have to sit down himself and say, this is what I've got with my technique, if I want to play even longer for England and play 60, 70, 80 Test matches for England, what do I need to improve?,\" said Cook on BT Sport. \"To start against international quality bowling is tough. It is a hard place to bat. When Rory Burns gets in, he's ok. His inconsistency will be due to having moving parts and getting them all in sync is very hard. This is a method he has worked out himself. You're not going to teach anyone to bat like that, just like Steve Smith worked out his method. He's gone 'this is how I play cricket and score my runs,\" added Cook, who played 161 Tests for England. Adelaide was also the second time where Starc dismissed Burns in the Ashes. Further delving on what the future holds for Burns, Cook remarked, \"It is a technique that he has to decide what he's going to do about. Mitchell Starc for the next five Test matches, if he stays fit, is the perfect combination against him. This does work for Rory Burns on occasions but to be more consistent early on in his innings. IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284266-burns.jpg","source_id":"sentinel"},{"title":"Rashid Khan agrees to play for Sussex","link":"https://www.sentinelassam.com/sports-news/rashid-khan-agrees-to-play-for-sussex-568526","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Afghanistan leg-spinner Rashid Khan will play for English County cricket club Sussex in the upcoming season, the club said in a statement on Friday. This will be the Afghan leg-spinner's fourth spell with the Sussex.","content":"LONDON: The Afghanistan leg-spinner Rashid Khan will play for English County cricket club Sussex in the upcoming season, the club said in a statement on Friday. This will be the Afghan leg-spinner's fourth spell with the Sussex.The 23-year-old is the fourth-highest wicket-taker in T20 history with 403 in 292 matches and has taken 26 wickets in 23 games for Sussex. After signing the agreement with the County Club, Rashid said, \"I have always enjoyed my time at Sussex and am more determined than ever to try and help bring the T20 Blast title back to Hove. The squad will look a little different this season with some key players that have moved on but the youngsters coming though impressed me greatly in recent seasons and combined with some new faces I think it is a really exciting time to be a Sharks fan.\" \"He's the best in the business and we are truly lucky to have him\" said Sussex Twenty20 coach James Kirtley. \"It is great to know we have developed a long-standing relationship with the best T20 spinner in the world and not to forget his dynamic batting which we witnessed against Yorkshire in last year's quarter-final,\" he said. IANSAlso Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 12:58:08","full_description":"LONDON: The Afghanistan leg-spinner Rashid Khan will play for English County cricket club Sussex in the upcoming season, the club said in a statement on Friday. This will be the Afghan leg-spinner's fourth spell with the Sussex. The 23-year-old is the fourth-highest wicket-taker in T20 history with 403 in 292 matches and has taken 26 wickets in 23 games for Sussex. After signing the agreement with the County Club, Rashid said, \"I have always enjoyed my time at Sussex and am more determined than ever to try and help bring the T20 Blast title back to Hove. The squad will look a little different this season with some key players that have moved on but the youngsters coming though impressed me greatly in recent seasons and combined with some new faces I think it is a really exciting time to be a Sharks fan.\" \"He's the best in the business and we are truly lucky to have him\" said Sussex Twenty20 coach James Kirtley. \"It is great to know we have developed a long-standing relationship with the best T20 spinner in the world and not to forget his dynamic batting which we witnessed against Yorkshire in last year's quarter-final,\" he said. IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284265-rashid.gif","source_id":"sentinel"},{"title":"Lucknow appoint Andy Flower as head coach","link":"https://www.sentinelassam.com/sports-news/lucknow-appoint-andy-flower-as-head-coach-568523","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Lucknow franchise of the Indian Premier League (IPL) on Friday appointed Former Zimbabwe captain Andy Flower as their head coach. Flower is the first appointment on the coaching staff by the yet-to-be-named Lucknow franchise, which was bought by Indian business conglomerate RP Sanjiv Goenka Group (RPSG) in August for nearly USD 1 billion.","content":"NEW DELHI: The Lucknow franchise of the Indian Premier League (IPL) on Friday appointed Former Zimbabwe captain Andy Flower as their head coach. Flower is the first appointment on the coaching staff by the yet-to-be-named Lucknow franchise, which was bought by Indian business conglomerate RP Sanjiv Goenka Group (RPSG) in August for nearly USD 1 billion.Sanjiv Goenka, owner of the Lucknow IPL team, in a media release said that Flower was chosen because of his \"professionalism\". \"As a player and a coach Andy has left an indelible mark in the history of cricket. We respect his professionalism and hope he will work with our vision and add value to our team,\" he said. IANS Also Read: Amarinder Singh announces party's alliance with BJPAlso Watch:","pubDate":"2021-12-18 12:51:30","full_description":"NEW DELHI: The Lucknow franchise of the Indian Premier League (IPL) on Friday appointed Former Zimbabwe captain Andy Flower as their head coach. Flower is the first appointment on the coaching staff by the yet-to-be-named Lucknow franchise, which was bought by Indian business conglomerate RP Sanjiv Goenka Group (RPSG) in August for nearly USD 1 billion. Sanjiv Goenka, owner of the Lucknow IPL team, in a media release said that Flower was chosen because of his \"professionalism\". \"As a player and a coach Andy has left an indelible mark in the history of cricket. We respect his professionalism and hope he will work with our vision and add value to our team,\" he said. IANS Also Read: Amarinder Singh announces party's alliance with BJP Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/18/284261-andy-flower-1.jpg","source_id":"sentinel"}]}