{"newsArray":[{"title":"UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs","link":"https://www.firstpost.com/firstcricket/sports-news/uae-vs-west-indies-2nd-odi-highlights-wi-win-by-78-runs-12700682.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs","content":"Cricket UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs West Indies defeated UAE by 78 runs on Tuesday to take an un assailable 2-0 lead in the ODI series. FirstCricket Staff June 7th, 2023 8:10:24 IST West Indies won the toss in the second ODI against UAE and opted to bat. Image: Twitter @windiescricket Match result: Brandon King and Jhonson Charles hit the fifties as West Indies were bowled out for 306. In reply, UAE were restricted to 228/7 with Ali Naseer scored 57. Preview: West Indies will look to seal the ODI series against the United Arab Emirates (UAE) when the two teams meet in the second game of the three-match series at the Sharjah Cricket Stadium on Tuesday. In the first match, the Windies rode on knocks from Brandon King (112) and Shamarh Brooks (44) to chase down 203 with seven wickets and 14.4 overs to spare. UAE had opted to bat in that contest, and barring Ali Naseer (58) and Vriitya Aravind (40), most of the other batters failed to convert starts. Keemo Paul (3/34) stood out among the wicket-takers to see off UAE for 202 in 47.1 overs. This series is vital for both teams, with both West Indies and UAE slated to take part in the ICC Cricket World Cup 2023 Qualifiers later in June. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: June 07, 2023 08:10:24 IST Tags: Uae Cricket Team West Indies Cricket Team Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-06-07 02:40:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/06/UAE-vs-WI-2nd-ODI-640_Twitter-@windiescricket.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"5 देशों के खिलाफ पहले ही टेस्‍ट में जड़ चुका शतक, फिर भी भारत की &#039;रेड बॉल&#039; टीम में नहीं मिल रही जगह","link":"https://hindi.news18.com/news/sports/cricket-unique-records-of-shikhar-dhawan-scored-hundred-in-his-first-test-against-five-different-countries-6438655.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत के शिखर धवन के नाम 5 देशों के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ने का अनोखा रिकॉर्ड दर्ज है. ओपनर शिखर धवन (Shikhar Dhawan) ने ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़कर यह कारनामा किया था. दुनिया का कोई बैटर 'गब्‍बर' के इस रिकॉर्ड के आस-पास नहीं है.","content":"शिखर धवन पांच देशों-ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ चुके हैं. (IPL) नई दिल्‍ली. वर्ल्‍ड टेस्‍ट चैंपियनशिप (WTC Final ) के फाइनल में रोहित शर्मा की भारतीय टीम (Team India) को आज यानी 7 जून से ऑस्‍ट्रेलिया का सामना करना है. टीम इंडिया ने हाल के वर्षों में अपने प्रदर्शन में बेहद सुधार किया है. एक समय था, जब उसे ‘घर का शेर’ कहा जाता था. माना जाता था कि टीम इंडिया स्पिन के लिए मददगार अपने घरेलू मैदानों पर ही जीत हासिल कर सकती है, लेकिन इस धारणा को बदलते हुए इसने विदेशी मैदान पर ही बड़ी-बड़ी टीमों को धूल चटाई है. इस शानदार प्रदर्शन के बीच भारत के एक बल्‍लेबाज के नाम पांच देशों के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ने का अनोखा रिकॉर्ड दर्ज है. बाएं हाथ के ओपनर शिखर धवन (Shikhar Dhawan) ने ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़कर यह कारनामा किया था. दुनिया का कोई बैटर ‘गब्‍बर’ के इस रिकॉर्ड के आस-पास नहीं है. एलेस्टेयर कुक, मैथ्‍यू हेडन, कुमार संगकारा, ग्रीम स्मिथ और मार्क टेलर ऐसे बल्‍लेबाज हैं, जिन्‍होंने 4 टीमों के खिलाफ अपने पहले टेस्‍ट में सैकड़ा लगाया था. टेस्‍ट डेब्‍यू करते हुए ऑस्‍ट्रेलिया के खिलाफ जड़ा सैकड़ा धवन ने वर्ष 2013 में ऑस्‍ट्रेलिया के खिलाफ मोहाली में डेब्‍यू करते हुए अपने पहले ही टेस्‍ट में शतक (107 रन)लगाया था. फरवरी 2014 में न्‍यूजीलैंड, जून 2015 में बांग्‍लादेश,अगस्‍त 2015 में श्रीलंका और जून 2018 में अफगानिस्‍तान के खिलाफ भी वे अपने पहले टेस्‍ट में शतक जमा चुके हैं.धवन ने 34 टेस्‍ट मैचों में अब तक 40.61 के औसत से 2315 रन बनाए हैं जिसमें सात शतक और पांच अर्धशतक शामिल हैं. मजे की बात यह है कि उन्‍होंने अपना अंतिम टेस्‍ट सितंबर 2018 में उसी ओवल मैदान पर खेला था जहां वर्ल्‍ड टेस्‍ट चैंपियनिशप 2023 का फाइनल होना है. रोहित शर्मा की प्लेइंग-XI में 5 बल्लेबाज और 2 ऑलराउंडर, WTC Final में इन 11 खिलाड़ियों को मिल सकता है मौका 37 वर्ष में अभी भी बल्‍ले से कर रहे ‘धमाल’ 37 वर्ष के हो चुके शिखर धवन अभी भी बल्‍ले से जोरदार प्रदर्शन कर रहे हैं.आईपीएल-2023 में शानदार प्रदर्शन करने वाले धवन 2015 के वर्ल्‍डकप और 2017 की चैंपियंस ट्रॉफी में भारतीय की ओर से सबसे ज्‍यादा रन बनाने वाले बैटर रहे हैं. वनडे में वे सबसे तेज 1000, 2000 और तीन हजार रन पूरे करने वाले भारतीय बैटर रह चुके हैं.शिखर अभी भी इंटरनेशनल क्रिकेट में खेल रहे हैं. 167 वनडे में 6793 रन (औसत 44.11, 17 शतक) और 68 टी20I में 27.92 के औसत से 1759 रन वे बना चुके हैं. अपना आखिरी इंटरनेशनल मैच उन्‍होंने वनडे के रूप में बांग्‍लादेश के खिलाफ दिसंबर 2022 में चटगांव में खेला था. . Tags: Cricket , Shikhar dhawan , Team india , WTC Final पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट","pubDate":"2023-06-07 02:39:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shikhar-Dhawan-IPL-3-16843753803x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC 2023 Final, IND vs AUS: क्या दो स्पिनर्स के साथ उतरेगा भारत ? ऐसा बन रहा प्लेइंग XI का समीकरण","link":"https://sports.ndtv.com/hindi/cricket/wtc-2023-final-ind-vs-aus-prediction-squad-probable-xi-icc-world-test-championship-final-2023-4100561#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WTC 2023 Final, IND vs AUS: विश्व टेस्ट चैंपियनशिप के फाइनल में आज भारत का मुकाबला ऑस्ट्रेलिया के साथ शुरू होगा. इंग्लैंड के द ओवल में यह ऐतिहासिक टेस्ट मैच खेला जा रहा है. भारत के पास इतिहास रचने का मौका होगा. 10 साल से भारतीय टीम आईसीसी को कोई ट्रॉफी नहीं जीत पाई है. देखना होगा कि इस बार रोहित की कप्तानी में भारतीय टीम इतिहास रच पाती है या नहीं.","content":"WTC 2023 Final, IND vs AUS: भारतीय प्लेइंग इलेवन का ऐसा है समीकरण : विश्व टेस्ट चैंपियनशिप के फाइनल में आज भारत और ऑस्ट्रेलिया के बीच मुकाबला शुरू होगा.इस टेस्ट मैच को जीतकर कोई एक टीम टेस्ट क्रिकेट की बादशाहत हासिल करने में सफल रहेगी. इस टेस्ट मैच में भारत की प्लेइंग इलेवन क्या होगी, इसको लेकर अभी भी जिज्ञासा का विषय है. खासकर शार्दुल ठाकुर, अश्विन, उमेश यादव, जयदेव उनादकट , ऐसे खिलाड़ी हैं जिनको लेकर कन्फ्यूजन बना हुआ है. भारत की कौशल और जज्बे से भरी टीम बुधवार से जब यहां ऑस्ट्रेलिया की मजबूत टीम के खिलाफ विश्व टेस्ट चैंपियनशिप (WTC Final) फाइनल में उतरेगी तो उसकी नजरें आईसीसी (ICC) खिताब के एक दशक के सूखे को खत्म करने पर टिकी होंगी. WTC के पिछले दो चक्र में भारत सबसे निरंतर प्रदर्शन करने वाली टीम रहा है और पिछले 10 साल में सफेद गेंद के लगभग सभी बड़े टूर्नामेंट के नॉकआउट चरण में जगह बनाने में सफल रहा लेकिन इसके बावजूद खिताब नहीं जीत पाया. भारत ने पिछला आईसीसी खिताब 2013 में इंग्लैंड में चैंपियन्स ट्रॉफी के रूप में जीता था, इसके बाद भारत को तीन बार फाइनल में हार का सामना करना पड़ा जबकि टीम चार बार सेमीफाइनल में हारी। टीम 2021 टी20 विश्व कप के शुरुआती दौर से ही बाहर हो गई. भारतीय टीम स्वेदश में अजेय रही, इंग्लैंड में कड़ी सीरीज ड्रॉ कराई और बांग्लादेश में मुश्किल में घिरने के बावजूद जीत हासिल की. द ओवल में नतीजा कुछ भी हो लेकिन मुख्य कोच राहुल द्रविड़ का टीम के प्रति नजरिया नहीं बदलेगा. 'द ओवल' 143 साल के अपने इतिहास में पहली बार जून में टेस्ट मैच की मेजबानी कर रहा है. भारत रविचंद्रन अश्विन और रविंद्र जडेजा की स्पिन जोड़ी को खिलाने को लेकर उत्सुक होगा लेकिन इंग्लैंड में गर्मियों की शुरुआत है और तरोताजा पिचों पर चौथा तेज गेंदबाज बेहतर विकल्प हो सकता है. विकेटकीपर ऋषभ पंत की गैरमौजूदगी में भारतीय टीम प्रबंधन को फैसला करना होगा कि उसे इशान किशन के रूप में ‘एक्स फेक्टर' (मैच का रुख बदलने वाला खिलाड़ी) चाहिए या फिर केएस भरत के रूप में अधिक विश्वसनीय विकेटकीपर. रोहित ने प्रेस से बात करते हुए कहा था कि प्लेइंग इलेवन का आखिरी फैसला मैच के दिन ही परिस्थिति को देखकर दिया जाएगा. यदि पिच पर नमी रहेगी तो फिर शार्दुल खेल सकते हैं अगर मौसम साफ रहा तो यकीनन भारतीय टीम दो स्पिनर्स के साथ मैदान पर उतर सकती है. तेज गेंदबाजी विभाग में मोहम्मद शमी और मोहम्मद सिराज का खेलना तय है जबकि तीसरे विकल्प के रूप में अनुभवी उमेश यादव और ऑलराउंडर शारदुल ठाकुर चुनौती पेश कर रहे हैं. भारतीय बल्लेबाजों के लिए पैट कमिंस, मिशेल स्टार्क और स्कॉट बोलैंड जैसे तेज गेंदबाजों का सामना करना आसान नहीं होगा. इस मुकाबले को ‘अल्टीमेट टेस्ट' कहां जा रहा है और बेशक इस मैच में रोहित शर्मा और विराट कोहली जैसे अनुभवी खिलाड़ियों के अलावा शुभमन गिल जैसे उभरते हुए स्टार की परीक्षा होगी. चेतेश्वर पुजारा काउंटी क्रिकेट की अच्छी फॉर्म को इस मुकाबले में दोहराना चाहेंगे जबकि अजिंक्य रहाणे वापसी करते हुए अच्छा प्रदर्शन करने को बेताब होंगे. भारतीय टीम के विपरीत ऑस्ट्रेलियाई खिलाड़ियों को मैच फिट होने का अधिक मौका नहीं मिला है लेकिन वे इस मुकाबले में तरोताजा होकर उतरेंगे. टीम के सिर्फ तीन खिलाड़ी आईपीएल में खेले जबकि मार्नस लाबुशेन और स्टीव स्मिथ काउंटी टीमों का हिस्सा रहे.पैट कमिंस जैसे खिलाड़ियों ने स्वदेश में तैयारी करने का विकल्प चुना. मैच का नतीजा काफी हद तक इस पर निर्भर करेगा कि स्तरीय तेज गेंदबाजी के खिलाफ दोनों टीम का शीर्ष क्रम कैसा प्रदर्शन करता है। ऑस्ट्रेलिया को सलामी बल्लेबाज उस्मान ख्वाजा से काफी उम्मीदें हैं जबकि डेविड वार्नर अपने करियर के अंतिम चरण में अपनी छाप छोड़ना चाहेंगे. इस मैदान पर स्मिथ का औसत 100 का है और अगर भारत को मैच पर पकड़ बनानी है तो उन्हें जल्दी आउट करना होगा. पिच चाहे कैसा भी बर्ताव करे अनुभवी ऑफ स्पिनर नाथन लियोन विरोधी बल्लेबाजों को परेशान करने की क्षमता रखते हैं जबकि ऑलराउंडर के रूप में कैमरन ग्रीन की भूमिका भी महत्वपूर्ण होगी. डेविड वार्नर, उस्मान ख्वाजा, मारनस लाबुशेन, स्टीव स्मिथ, ट्रैविस हेड, कैमरन ग्रीन, एलेक्स केरी (wk), मिचेल स्टार्क, पैट कमिंस (c)स्कॉट बोलैंड, नाथन लियोन रोहित शर्मा (c), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, केएस भरत (wk), रविचंद्रन अश्विन/शार्दुल ठाकुर, उमेश यादव/जयदेव उनादकट, मोहम्मद शमी, मोहम्मद सिराज : पैट कमिंस (कप्तान), स्कॉट बोलैंड, एलेक्स कैरी, कैमरन ग्रीन, मार्कस हैरिस, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मार्नस लाबुशेन, नाथन लियोन, जोश इंग्लिस, टॉड मर्फी, स्टीव स्मिथ, मिशेल स्टार्क, डेविड वार्नर मिचेल मार्श और मैट रेनशॉ रोहित शर्मा (कप्तान), रविचंद्रन अश्विन, केएस भरत, शुभमन गिल, रविंद्र जडेजा, विराट कोहली, इशान किशन, चेतेश्वर पुजारा, अक्षर पटेल, अजिंक्य रहाणे, मोहम्मद शमी, मोहम्मद सिराज, शार्दुल ठाकुर, जयदेव उनादकट, और उमेश यादव यशस्वी जायसवाल, मुकेश कुमार और सूर्यकुमार यादव मैच भारतीय समयानुसार दोपहर तीन बजे से शुरू होगा * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-06-07 02:06:20","image_url":"https://c.ndtvimg.com/2023-06/fds0f5qo_rohit-ashwin_625x300_06_June_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final का रोमांचक मुकाबला फ्री में देखिए, जानें कहां, कब और कैसे देख सकते हैं भारत और ऑस्ट्रेलिया का मैच","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-live-streaming-when-and-where-to-watch-live-telecast-star-sports-doordarshan-live-streaming-disneyhotstar-app-ind-vs-aus-6438595.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India vs Auatralia WTC Final Live Streaming: भारत और ऑस्ट्रेलिया के बीच वर्ल्ड टेस्ट चैंपियनशिप का फाइनल आज से इंग्लैंड के द ओवल मैदान पर खेला जाना है. भारतीय टीम की कप्तानी रोहित शर्मा करेंगे, वहीं ऑस्ट्रेलियाई टीम की कमान पैट कमिंस संभाल रहे हैं. दोनों ही टीमों की नजर पहले डब्ल्यूटीसी खिताब पर है.","content":"India vs Auatralia WTC Final Live Streaming: फाइनल मुकाबला भारतीय समयानुसार दोपहर 3 बजे से शुरू होगा. (BCCI Twitter) नई दिल्ली. भारत और ऑस्ट्रेलिया के बीच वर्ल्ड टेस्ट चैंपिनयनशिप का फाइनल मुकाबला 7 जून बुधवार से शुरू होने जा रहा है. इंग्लैंड के द ओवल मैदान में यह रोमांचक मुकाबला खेला जाएगा. ऐसे में सभी फैंस यह चाहेंगे कि यह मैच वे कैसे, कब और कहां देख सकते हैं. तो आइए हम आपको बताते हैं कि आप इस मैच का लुत्फ फ्री में कैसे उठा सकते हैं. दोनों ही टीमों की नजर पहले वर्ल्ड टेस्ट चैंपियनशिप के टाइटल पर है. ऐसे में इस मुकाबले में कई रिकॉर्ड भी बनने वाले हैं. टीम इंडिया की कप्तानी रोहित शर्मा कर रहे हैं तो ऑस्ट्रेलिया टीम की कमान तेज गेंदबाज पैट कमिंस संभाल रहे हैं. टीम इंडिया मैच में मनोवैज्ञानिक बढ़त के साथ उतरेगी. उसने कंगारू टीम के खिलाफ अंतिम चारों टेस्ट सीरीज जीती हैं. इस दौरान भारत ने ऑस्ट्रेलिया को उसी के घर में 2 बार हराया है. रोहित शर्मा से लेकर विराट कोहली तक 10 साल के आईसीसी ट्रॉफी के सूखे को भी खत्म करना चाहेंगे. भारत और ऑस्ट्रेलिया के बीच WTC Final का मुकाबला कब खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final कहां खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final कितने बजे से खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final मैच का लाइव टेलीकास्ट कहां देखें? भारत और ऑस्ट्रेलिया के बीच आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल मैच की लाइव स्ट्रीमिंग कहां देखें? . Tags: Australia , India vs Australia , Team india , WTC Final धांसू है अनलिमिटेड बेनिफिट्स वाला ये प्रीपेड प्लान, 130 दिन के लिए रिचार्ज की टेंशन हो जाती है दूर, रोजाना का खर्च भी महज 5 रुपये पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज","pubDate":"2023-06-07 01:35:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-1-16859452793x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"रोहित शर्मा की प्लेइंग-XI में 5 बल्लेबाज और 2 ऑलराउंडर, WTC Final में इन 11 खिलाड़ियों को मिल सकता है मौका","link":"https://hindi.news18.com/photogallery/sports/cricket-wtc-final-2023-rohit-sharma-can-give-chance-to-5-batsmen-and-2-all-rounders-in-playing-xi-in-final-vs-australia-team-india-6438443.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"WTC Final Playing-11: टीम इंडिया आज से ऑस्ट्रेलिया के खिलाफ शुरू हो रहे वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में किन 11 खिलाड़ियों को मौका देती है, इस पर सभी की नजर है. इंग्लैंड के द ओवल मैदान की पिच को बाउंसी विकेट बताया जा रहा है. ऐसे में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 5 बल्लेबाजों के साथ 2 ऑलराउंडर्स को मौका दे सकते हैं.","content":"WTC Final Playing-11: टीम इंडिया आज से ऑस्ट्रेलिया के खिलाफ शुरू हो रहे वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में किन 11 खिलाड़ियों को मौका देती है, इस पर सभी की नजर है. इंग्लैंड के द ओवल मैदान की पिच को बाउंसी विकेट बताया जा रहा है. ऐसे में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 5 बल्लेबाजों के साथ 2 ऑलराउंडर्स को मौका दे सकते हैं. भारतीय ऑलराउंडर शार्दुल ठाकुर ने ऑस्ट्रेलिया के खिलाफ आज से ओवल में शुरू होने वाले वर्ल्ड टेस्ट चैंपियनशिप फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया. उनके इस बयान से साफ है कि टीम मैनेजमेंट की ओर से उन्हें फाइनल में मौका दिए जाने की बात कही गई हो, लेकिन कप्तान रोहित शर्मा ने कहा कि पिच हर दिन अपना मिजाज बदल रही है. ऐसे में प्लेइंग-11 पर फैसला मैच वाले दिन लिया जाएगा. तेज गेंदबाज और ऑलराउंडर शार्दुल ठाकुर ने करियर के 8 में से 3 टेस्ट मैच इंग्लैंड में ही खेले हैं. ऐसे में वे एक और बड़े मुकाबले के लिए तैयार हैं. (AP) ओवल की पिच को लेकर साफ है कि यहां तेज गेंदबाजों को बड़ी मदद मिलती है. पिच क्यूरेटर भी साफ कर चुके हैं कि फाइनल में बाउंसी विकेट देखने को मिलेगा. ऐसे में मैच में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 3 तेज गेंदबाजों को उतार सकते हैं. इसमें मोहम्मद शमी, मोहम्मद शमी और उमेश यादव हैं. हालांकि बाएं हाथ के तेज गेंदबाज जयदेव उनादकट को भी रेस से बाहर नहीं माना जा सकता. (BCCI Twitter) ऑलराउंडर्स की बात करें, तो रवींद्र जडेजा और शार्दुल ठाकुर को ऑस्ट्रेलिया के खिलाफ जगह दी जा सकती है. बतौर ऑलराउंडर शार्दुल ने ऑस्ट्रेलिया से लेकर इंग्लैंड तक में अच्छा प्रदर्शन किया है. जडेजा आईपीएल 2023 में कमाल करके आ रहे हैं. मैच में रोहित शर्मा के साथ शुभमन गिल ओपनिंग कर सकते हैं. नंबर-3 पर चेतेश्वर पुजारा, नंबर-4 पर विराट कोहली, नंबर-5 पर अजिंक्य रहाणे तो बतौर विकेटकीपर केएस भरत को मौका मिल सकता है. (BCCI Twitter) इस बीच टीम इंडिया के कोच राहुल द्रविड़ तैयारियों से खुश हैं. द्रविड़ ने ‘स्टार स्पोर्ट्स से कहा कि हमें कुछ अनुभवी खिलाड़ी मिले हैं. हमने पिछले 18 महीनों के दौरान कई युवा खिलाड़ियों को आजमाया हैं. हमें 3 अलग-अलग फॉर्मेट और भारतीय टीम के द्वारा अधिक संख्या में मैच खेलने के कारण ज्यादा खिलाड़ियों का इस्तेमाल करना पड़ा. (AFP) टीम इंडिया के पूर्व कप्तान राहुल द्रविड़ ने कहा कि हमारी क्रिकेट प्रणाली बहुत सारे खिलाड़ी आ रहे हैं और बाहर भी हो रहे हैं. यह वास्तव में रोमांचक रहा है और मेरे लिए भी सीखने का एक अच्छा अनुभव रहा है. उन्होंने कहा कि हां, यह बहुत मजेदार रहा है और मैंने इसका लुत्फ उठाया है. इस दौरान मुझे बहुत सारे खिलाड़ियों के साथ काम करने और एक बड़े समूह के साथ बेहतर रिश्ते बनाने का मौका मिला. (AP) भारतीय कोच राहुल द्रविड़ ने कहा कि इन 18 महीनों के दौरान मैंने एक व्यक्ति के रूप में अपने बारे में और कोचिंग के बारे में भी बहुत कुछ सीखा है. फाइनल के लिए संभावित भारतीय प्लेइंग-XI: रोहित शर्मा, शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, केएस भरत, शार्दुल ठाकुर, मोहम्मद शमी, उमेश यादव और मोहम्मद सिराज. (AP) पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट भारतीय ऑलराउंडर शार्दुल ठाकुर ने ऑस्ट्रेलिया के खिलाफ आज से ओवल में शुरू होने वाले वर्ल्ड टेस्ट चैंपियनशिप फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया. उनके इस बयान से साफ है कि टीम मैनेजमेंट की ओर से उन्हें फाइनल में मौका दिए जाने की बात कही गई हो, लेकिन कप्तान रोहित शर्मा ने कहा कि पिच हर दिन अपना मिजाज बदल रही है. ऐसे में प्लेइंग-11 पर फैसला मैच वाले दिन लिया जाएगा. तेज गेंदबाज और ऑलराउंडर शार्दुल ठाकुर ने करियर के 8 में से 3 टेस्ट मैच इंग्लैंड में ही खेले हैं. ऐसे में वे एक और बड़े मुकाबले के लिए तैयार हैं. (AP)","pubDate":"2023-06-07 00:59:31","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-playing-11-16860990553x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final से पहले हड़कंप मचाने वाला बयान, मेरे जैसे खिलाड़ी को जिंदगी में 1 बार मिलता है ऐसा मौका!","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-all-rounder-shardul-thakur-calls-world-test-championship-final-against-australia-once-in-a-lifetime-moment-6438103.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल की ट्रॉफी किसकी होगी सबकी नजरें इस पर ही जमी है. भारतीय टीम ने लगातार दूसरी बार फाइनल में जगह बनाई है तो ऑस्ट्रेलिया की टीम पहली बार फाइनल खेलने उतरेगी.","content":"कप्तान रोहित शर्मा, शार्दुल ठाकुर और ईशान किशन-AP नई दिल्ली. भारतीय क्रिकेट टीम एक और बेहद रोमांचक आईसीसी इवेंट के फाइनल में उतरने के लिए तैयार है. वर्ल्ड टेस्ट चैंपियनशिप फाइनल की ट्रॉफी किसकी होगी सबकी नजरें इस पर ही जमी है. भारतीय टीम ने लगातार दूसरी बार फाइनल में जगह बनाई है तो ऑस्ट्रेलिया की टीम पहली बार फाइनल खेलने उतरेगी. भारतीय ऑलराउंडर शार्दुल ठाकुर में ऑस्ट्रेलिया के खिलाफ बुधवार से ओवल में शुरू होने वाले विश्व टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया और कहा कि वह इसमें अपनी छाप छोड़ना चाहते हैं. अभी तक अपने आठ में से तीन टेस्ट मैच इंग्लैंड में खेलने वाले ठाकुर को अंतिम एकादश में जगह मिलेगी या नहीं यह अभी तक तय नहीं है लेकिन यह 31 वर्षीय खिलाड़ी अपनी तरफ से पूरी तरह तैयार है. ठाकुर ने आईसीसी से कहा, ‘‘ मेरा मानना है आईसीसी प्रतियोगिता विशेषकर फाइनल में खेलने का मौका हमेशा नहीं मिलता है इसलिए मुझ जैसे खिलाड़ी के लिए यह जिंदगी में एक बार मिलने वाला अवसर है. मैं यही चाहता हूं कि इसका पूरा फायदा उठाया जाए. वह हमेशा विशेष क्षण होता है जब आप अपने देश का प्रतिनिधित्व करते हैं विशेषकर भारत का जहां करोड़ों लोग देश की तरफ से खेलने का सपना देखते हैं और केवल सर्वश्रेष्ठ 15 को ही देश का प्रतिनिधित्व करने के लिए चुना जाता है.’’ WTC फाइनल के लिए भारतीय टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, रविचंद्रन अश्विन, अक्षर पटेल, केएस भरत (विकेटकीपर), शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, जयदेव उनादकट, उमेश यादव, ईशान किशन (विकेटकीपर). स्टैंडबाय खिलाड़ी: यशस्वी जायसवाल, मुकेश कुमार, सूर्यकुमार यादव. WTC फाइनल के लिए ऑस्ट्रेलिया की टीम: पैट कमिंस (कप्तान), स्कॉट बोलैंड, एलेक्स केरी (विकेटकीपर), कैमरन ग्रीन, मार्कस हैरिस, ट्रैविस हेड, जोश इंगलिस (विकेटकीपर), उस्मान ख्वाजा, मार्नस लाबुशेन, नाथन लायन, टॉड मर्फी, माइकल नेसर, स्टीव स्मिथ (उप-कप्तान), मिचेल स्टार्क, डेविड वॉर्नर स्टैंडबाय खिलाड़ी: मिचेल मार्श, मैथ्यू रेनशॉ. . Tags: India vs Australia , Shardul thakur , WTC Final रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट जहां पढ़े विवेकानंद और सुभाष चंद्र बोस उस कॉलेज को मिला 100वां स्‍थान काजोल नहीं, शाहरुख की दोस्त थीं मेकर्स की पहली पसंद, 1995 में बनी इस फिल्म ने तोड़ दिए थे कमाई के कई रिकॉर्ड","pubDate":"2023-06-07 00:45:23","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-with-ishan-kishan-and-shardul-thakur-16860774313x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"टीम इंडिया के चैंपियन पर फैसला! रोहित शर्मा ने इंतजार करने कहा, सभी 15 खिलाड़ियों को तैयार रहने का निर्देश","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-rohit-sharma-reply-on-r-ashwin-we-have-to-wait-all-15-players-are-told-to-be-ready-for-match-agaist-australia-6437921.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और ऑस्ट्रेलिया के बीच होने वाले मुकाबले से जुड़ी हर एक जानकारी लोग जानने को उत्सुक हैं. मैच से पहले टीम इंडिया के कप्तान रोहित शर्मा ने मीडिया से बात की. टीम कॉम्बिनेशन और प्लेइंग इलेवन के सवाल पर उन्होंने कुछ नहीं कहा साथ ही आर अश्विन मैच खेलेंगे या नहीं इसको भी अपने तरीके से टाल गए.","content":"भारतीय टीम के कोच राहुल द्रविड़ कप्तान रोहित शर्मा और बल्लेबाजी कोच विक्रम राठौर के साथ -AP नई दिल्ली. आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लेकर फैंस में गजब का रोमांच है. भारत और ऑस्ट्रेलिया के बीच होने वाले मुकाबले से जुड़ी हर एक जानकारी लोग जानने को उत्सुक हैं. मैच से पहले टीम इंडिया के कप्तान रोहित शर्मा ने मीडिया से बात की. टीम कॉम्बिनेशन और प्लेइंग इलेवन के सवाल पर उन्होंने कुछ नहीं कहा साथ ही आर अश्विन मैच खेलेंगे या नहीं इसको भी अपने तरीके से टाल गए. रोहित से पूछा गया कि क्या अश्विन को बाहर करना मुश्किल फैसला होगा, उन्होंने कहा,‘‘ मैंने यह तो नहीं कहा कि अश्विन नहीं खेलेंगे. हमें कल तक इंतजार करना होगा क्योंकि एक चीज मैंने देखी है कि पिच वास्तव में दिन प्रतिदिन बदलती जा रही है.’’ भारतीय कप्तान ने कहा,‘‘ पिच आज जैसी है हो सकता है कि कल वह उससे भिन्न हो. इसलिए सभी 15 खिलाड़ियों के लिए स्पष्ट संदेश है कि सभी को खेलने के लिए तैयार रहना चाहिए.’’ पिच में अभी घास दिख रही है और अगर सुबह बादल छाए रहते हैं तो अतिरिक्त तेज गेंदबाज के साथ उतरना फायदेमंद हो सकता है। रोहित ने कहा,‘‘ मैंने कल पिच देखी थी, आज मुझे इसका मौका नहीं मिला लेकिन निश्चित तौर पर लग रहा है कि उससे तेज गेंदबाजों को थोड़ा मदद मिलेगी। बादल छाए रहने पर तेज गेंदबाज थोड़ा प्रभावी साबित हो सकते हैं।’’ ओवल में पहला टेस्ट मैच 1880 में खेला गया था लेकिन यह पहला अवसर है जबकि वह जून के महीने में टेस्ट मैच की मेजबानी करेगा। रोहित हालांकि इस आंकड़े को गंभीरता से नहीं लेते हैं। उन्होंने कहा,‘‘ हम सुन रहे हैं यहां जून में बहुत अधिक क्रिकेट नहीं खेली जाती है। काउंटी के मैच यहां खेले गए हैं। हमने देखा था कि दो सप्ताह पहले यहां मैच खेला गया था। ऐसा नहीं है कि इस मैदान पर यह इस सत्र का पहला मैच होगा। हम इससे अच्छी तरह वाकिफ हैं कि परिस्थितियां कैसी हैं और अगले पांच दिन में क्या होने वाला है।’’ . Tags: R ashwin , Rohit sharma , WTC Final शरीर के हर अंग को तंदुरुस्त करती हैं ये 5 सब्जियां, मेटाबोलिज्म और इम्यूनिटी दोनों होता है मजबूत, बीमारियां रहती हैं दूर WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट","pubDate":"2023-06-07 00:36:45","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/Rahul-with-rohit-and-vikram-3-16860750663x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final 2023: वो 5 कारण जो भारत को बना सकते हैं वर्ल्ड चैंपियन, मैच से पहले ही पिछड़ा ऑस्ट्रेलिया","link":"https://hindi.news18.com/news/sports/cricket-india-may-become-wtc-champion-predicts-former-coach-lalchand-rajput-shubman-gill-pujara-kohli-shami-siraj-6437805.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम का द ओवल में होने वाले डब्ल्यूटीसी फाइनल में अपर हैंड है. ऑस्ट्रेलिया के खिलाफ भारतीय टीम का पलड़ा भारी रहने की उम्मीद है. वैसे तो इसके कई कारण हैं, लेकिन सबसे पहले तो मैं यही कहूंगा कि हम लगातार दूसरी बार फाइनल में पहुंचे हैं. पिछली बार न्यूजीलैंड से हम हार गए थे. लेकिन अब हम मानसिक तौर पर अच्छी तरह तैयार हैं. मैं यहां ऐसे 5 कारण बताऊंगा जो भारत को जीत का दावेदार बनाते हैं.","content":"टीम इंडिया का फाइनल में पलड़ा भारी है. (AP) भारतीय क्रिकेट टीम एक और विश्व खिताब की दहलीज पर है. आज (7 जून) से शुरू हो रही आईसीसी वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में यूं तो कांटे के मुकाबले की उम्मीद जताई जा रही है. लेकिन मुझे लगता है कि भारतीय टीम का द ओवल में होने वाले डब्ल्यूटीसी फाइनल में अपर हैंड है. ऑस्ट्रेलिया के खिलाफ भारतीय टीम का पलड़ा भारी रहने की उम्मीद है. वैसे तो इसके कई कारण हैं, लेकिन सबसे पहले तो मैं यही कहूंगा कि हम लगातार दूसरी बार फाइनल में पहुंचे हैं. पिछली बार न्यूजीलैंड से हम हार गए थे. लेकिन अब हम मानसिक तौर पर अच्छी तरह तैयार हैं. मैं यहां ऐसे 5 कारण बताऊंगा जो भारत को जीत का दावेदार बनाते हैं. 1. शुभमन गिल की सुप्रीम फॉर्म भारत और ऑस्ट्रेलिया दोनों ही टीमों को देखें तो आप पाएंगे कि यदि कोई बैटर पिछले एक साल से अपने सुप्रीम फॉर्म में है, तो वह शुभमन गिल हैं. चाहे वह टेस्ट क्रिकेट हो या वनडे और या फिर टी20 मैच. इस युवा खिलाड़ी ने हर फॉर्मेट में अपनी छाप छोड़ी है. निरंतरता दिखाई है. ऑस्ट्रेलिया उन्हें खतरा मानकर चल रहा होगा. जहां तक भारतीय टीम की बात है तो शुभमन ओपनर हैं. जब ओपनर अच्छी स्टार्ट देते हैं तो टीम बड़ा स्कोर बनाती है. भारतीय टीम उम्मीद करेगी कि शुभमन की यह फॉर्म डब्ल्यूटीसी फाइनल में भी बरकरार रहेगी. 2. विराट कोहली की वापसी विराट कोहली का फॉर्म में लौटना वह दूसरा कारण है, जो भारत की उम्मीदें जगाता है. विराट ने आईपीएल में जमकर रन बनाए. लेकिन यह आईपीएल की बात नहीं है. विराट 2023 में उसी निरंतरता का प्रदर्शन कर रहे हैं, जो उन्होंने अपने करियर के शुरुआती 10 साल में किए. उन्होंने पिछले छह महीने में वनडे, टेस्ट और टी20 मुकाबलों में सेंचुरी बनाई है. विराट कोहली बड़े मैचों के खिलाड़ी रहे हैं. टी20 वर्ल्ड कप में पाकिस्तान के खिलाफ खेली गई पारी अब भी क्रिकेटप्रेमियों की जेहन में होगी. कोई शक नहीं उनका फॉर्म में लौटना टीम को हौसला दे रहा होगा. 3. मोहम्मद शमी की लय मोहम्मद शमी पूरे लय में हैं. आईपीएल 2023 में पर्पल कैप जीतने वाले इस खिलाड़ी की ताकत ही टेस्ट क्रिकेट है. शमी वो बॉलर हैं, जो पहले बैटर को सेट करते हैं और फिर उसका शिकार करते हैं. यह खिलाड़ी लाल गेंद से और भी खतरनाक हो जाता है. इस पर इंग्लैंड की स्विंग को मदद करने वाली परिस्थितियां इस गेंदबाज के लिए सोने पर सुहागा वाला काम करेंगी. 4. सिराज बनाते हैं हंटिंग पेयर मोहम्मद शमी के साथ-साथ मोहम्मद सिराज भी बेहतरीन लय में हैं. उन्होंने आईपीएल 2023 में 14 मैच में 23 विकेट लिए. शमी की तरह सिराज को भी लाल गेंद ज्यादा भाती है. जब आप विकेट लेते हैं तो हौसला बढ़ता है. पिछला प्रदर्शन आगे भी काम आता है. आप ज्यादा विश्वास के साथ बॉलिंग करते हैं. मोहम्मद सिराज के साथ भी यही स्थिति है. मोहम्मद सिराज अपने सीनियर साथी मोहम्मद शमी के साथ हंटिंग पेयर बनाते हैं, जो ऑस्ट्रेलिया का पसीना छुड़ाने वाली साबित होगी. 5. पुजारा बना रहे लगातार रन राहुल द्रविड़ के बाद यदि किसी बैटर ने विकेट पर लंबे समय तक टिकने का माद्दा दिखाया है तो वह चेतेश्वर पुजारा हैं. जब वे सेट होते हैं तो जल्दी आउट नहीं होते. लंबी पारी खेलते हैं. दिनभर खूंटा गाड़कर विरोधी का हौसला तोड़ देते हैं. भारतीय टीम पुजारा से यही उम्मीद भी कर रही होगी. इसकी वजह भी है. पुजारा तकरीबन 2 महीने से इंग्लैंड में हैं. उन्होंने इस दौरान काउंटी क्रिकेट में खूब रन बरसाए हैं. उनकी फॉर्म भारत को ताकत देने वाली साबित होगी. हमें यह भी नहीं भूलना चाहिए कि भारतीय टीम के मौजूदा कप्तान रोहित शर्मा का इंग्लैंड में शानदार प्रदर्शन रहा है. उन्होंने इंग्लैंड में खेल गए 2019 के वर्ल्ड कप में 5 शतक लगाए थे. अजिंक्य रहाणे तो विदेश में प्रदर्शन करने के लिए ही जाने जाते हैं. रवींद्र जडेजा इस समय दुनिया के सबसे बेहतरीन ऑलराउंडरों में शुमार हैं. वे ना सिर्फ स्पेशलिस्ट बैटर की तरह प्रदर्शन करते हैं, बल्कि विकेट से थोड़ी भी मदद मिलने पर विरोधी टीम की खटिया खड़ी कर देते हैं. रविचंद्रन अश्विन भी कम नहीं. तीन टेस्ट शतक लगा चुका यह खिलाड़ी जब गेंद से रंग दिखाता है तो अकेले ही विरोधी टीम को समेट देता है. ऑस्ट्रेलिया को इसका पूरा अनुभव भी है. दूसरी ओर, ऑस्ट्रेलिया अपनी जिस बड़ी ताकत पर इतराता है, वह फाइनल मुकाबले से ठीक पहले थोड़ी कुंद हो गई है. वह ताकत है पेस अटैक की, जो जोश हेजलवुड के चोटिल होने से कमजोर हुई है. कोई शक नहीं कि भारतीय बैटर इस मौके का पूरा फायदा उठाएंगे. कुल मिलाकर भारत की इस टीम में विश्व चैंपियन बनने का पूरा माद्दा है. उम्मीद है ये खिलाड़ी अपनी क्षमता को मैदान पर पुरजोर तरीके से उतारेंगे और भारत को विश्व चैंपियन बनाएंगे. . Tags: India vs Australia , Lalchand Rajput , Shubman gill , Team india , WTC Final शरीर के हर अंग को तंदुरुस्त करती हैं ये 5 सब्जियां, मेटाबोलिज्म और इम्यूनिटी दोनों होता है मजबूत, बीमारियां रहती हैं दूर WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट","pubDate":"2023-06-07 00:17:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-practice-rohit-with-virat-and-rahul-16860429983x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार","link":"https://hindi.news18.com/photogallery/sports/cricket-wtc-final-2023-rohit-sharma-has-won-8-titles-including-5-ipl-as-captain-team-india-ind-vs-aus-6438395.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Rohit Sharma Captaincy Record: रोहित शर्मा की कप्तानी में टीम इंडिया बड़े इम्तिहान के लिए तैयार है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल शुरू होने जा रहा है. रोहित ने बताैर कप्तान कई रिकॉर्ड बनाए हैं, लेकिन वे अब तक आईसीसी ट्रॉफी नहीं जीत सके हैं. भारतीय टीम भी 2013 के बाद से आईसीसी का कोई टाइटल अपने नाम नहीं कर सकी है.","content":"Rohit Sharma Captaincy Record: रोहित शर्मा की कप्तानी में टीम इंडिया बड़े इम्तिहान के लिए तैयार है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल शुरू होने जा रहा है. रोहित ने बताैर कप्तान कई रिकॉर्ड बनाए हैं, लेकिन वे अब तक आईसीसी ट्रॉफी नहीं जीत सके हैं. भारतीय टीम भी 2013 के बाद से आईसीसी का कोई टाइटल अपने नाम नहीं कर सकी है. रोहित शर्मा की कप्तानी में टीम इंडिया आज से इतिहास रचने उतर रही है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेला जाना है. दोनों ही टीमों की नजर टेस्ट के वर्ल्ड कप पर पहली बार कब्जा करने की है. जो भी टीम यह मुकाबला जीतेगी, इतिहास बना देगी. वह वनडे वर्ल्ड कप, टी20 वर्ल्ड कप और चैंपियंस ट्रॉफी के बाद आईसीसी के चौथे टूर्नामेंट पर कब्जा करने वाली पहली टीम बन जाएगी. (AP) रोहित शर्मा की नजर बतौर कप्तान अपने पहले आईसीसी टाइटल पर है. भारतीय टीम भी 2013 से कोई भी आईसीसी ट्रॉफी नहीं जीत सकी है. बतौर कप्तान रोहित का रिकॉर्ड अच्छा रहा है. वे अब तक 8 खिताब जीत चुके हैं. इसमें 5 आईपीएल के टाइटल, एक चैंपियंस लीग टी20, एक एशिया कप और एक निदहास ट्रॉफी का शामिल है. लेकिन उन्होंने अंतिम टाइटल 3 साल पहले 2020 में जीता था. इस दाैरान वे बल्ले से और खूंखार हो गए हैं. पिछले साल टी20 वर्ल्ड कप में रोहित की कप्तानी में टीम इंडिया सेमीफाइनल से आगे नहीं बढ़ सकी थी. (BCCI Twitter) भारत और ऑस्ट्रेलिया के बीच फाइनल ओवल में खेला जाना है. यहां रोहित शर्मा ने 2021 में एकमात्र टेस्ट खेला था और इस दौरान उन्होंने 127 रन की बेहतरीन पारी खेली थी. ऐसे में वे अपने इस प्रदर्शन को बरकरार रखना चाहेंगे. इंग्लैंड में रोहित के टेस्ट के प्रदर्शन को देखें, तो वे 6 मैच की 12 पारियों में 42 की औसत से 466 रन बना चुके हैं. इसमें एक शतक और 2 अर्धशतक शामिल है. वहीं विराट कोहली इंग्लैंड में टेस्ट में 2 शतक ठोक चुके हैं. (AP) टीम इंडिया ने ऑस्ट्रेलिया के खिलाफ अंतिम चारों टेस्ट सीरीज पर कब्जा किया है. ऐसे में उसके हौसले बुलंद हैं. इस दौरान उसने कंगारू टीम को उसी के घर में 2 बार मात दी है. हालांकि जसप्रीत बुमराह, ऋषभ पंत, श्रेयस अय्यर और केएल राहुल के नहीं होने से टीम का बैलेंस जरूर बिगड़ा है. लेकिन अनुभवी खिलाड़ी अजिंक्य रहाणे की वापसी से टीम का मनोबल भी बढ़ा है. आईपीएल 2023 में रहाणे ने बेहतरीन प्रदर्शन किया और सीएसके को चैंपियन भी बनाया. (AP) रोहित शर्मा के कप्तानी के रिकॉर्ड की बात करें, तो उन्होंने अब तक 6 टेस्ट मैच में टीम इंडिया की अगुआई की है. 4 में टीम को जीत मिली है, जबकि एक में हार. एक मुकाबला ड्रॉ रहा. इंटरनेशनल क्रिकेट के तीनों फॉर्मेट को देखें, तो रोहित शर्मा 83 मैच में टीम इंडिया की कप्तानी संभाल चुके हैं. 62 में जीत मिली है जबकि 20 में हार. यानी उनका कप्तानी का रिकॉर्ड भी अच्छा है. (AP) इस बीच दिग्गज बल्लेबाज सचिन तेंदुलकर ने ओवल की पिच टीम इंडिया के अनुकूल बताया और कहा की पिच को देखते हुए भारत फायदे में दिखता है. उन्होंने कहा कि भारतीय टीम खुश होगी कि वह ओवल में खेलने जा रही है. ओवल की पिच का नेचर इस तरह से है कि वह मैच आगे बढ़ने के साथ स्पिनरों को मदद पहुंचाती है. इसलिए स्पिनरों की भूमिका अहम होगी. (BCCI Twitter) तेंदुलकर ने 100 एमबीस्पोर्ट्स से कहा कि इसके लिए जरूरी नहीं है कि हमेशा टर्निंग विकेट की ही जरूरत पड़े. कभी-कभी स्पिनर पिच से मिल रही उछाल का भी फायदा उठाते हैं. उन्हें बादल छाए रहने की परिस्थितियों में भी पिच से मदद मिल सकती है और काफी कुछ गेंद के चमकदार हिस्से पर निर्भर करता है. इन सब कारणों से ओवल भारत के लिए अच्छा स्थान है.(AFP) भारत ने इंग्लैंड के खिलाफ 2021 में ओवल में 157 रन से जीत दर्ज की थी और सचिन तेंदुलकर ने कहा कि उसमें से जुड़ी अच्छी यादें भारत के काम आएंगी. उन्होंने कहा कि निश्चित तौर पर, जब आपके पास इस तरह की अच्छी यादें हों, तो वे आपके साथ बनी रहती हैं. भारतीय टीम को यह नहीं भूलना चाहिए कि पिछली बार उसने यहां शानदार परिणाम हासिल किया था. (AFP) WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट Most Popular IAS : ये IAS अधिकारी हैं सोशल मीडिया सेलिब्रिटी, इंस्टाग्राम पर हैं लाखों फॉलोवर रोहित शर्मा की कप्तानी में टीम इंडिया आज से इतिहास रचने उतर रही है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेला जाना है. दोनों ही टीमों की नजर टेस्ट के वर्ल्ड कप पर पहली बार कब्जा करने की है. जो भी टीम यह मुकाबला जीतेगी, इतिहास बना देगी. वह वनडे वर्ल्ड कप, टी20 वर्ल्ड कप और चैंपियंस ट्रॉफी के बाद आईसीसी के चौथे टूर्नामेंट पर कब्जा करने वाली पहली टीम बन जाएगी. (AP)","pubDate":"2023-06-07 00:09:00","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-3-16860957443x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka confident World Cup qualifiers will go well","link":"http://island.lk/sri-lanka-confident-world-cup-qualifiers-will-go-well/","keywords":["Sports","Angelo Mathews","Featured","Sri Lanka Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Rex Clementine at Suriyawewa Having failed to qualify automatically for the World Cup later this year, Sri Lanka will be flying shortly to Zimbabwe to secure one of the two remaining slots for the sport’s showpiece event. But before that they have got to finish off the ODI series against Afghanistan and the former champions […]","content":"Having failed to qualify automatically for the World Cup later this year, Sri Lanka will be flying shortly to Zimbabwe to secure one of the two remaining slots for the sport’s showpiece event. But before that they have got to finish off the ODI series against Afghanistan and the former champions will be hoping that they will be able to clinch the series prior to flying off to Harare. After losing the first ODI by six wickets, Sri Lanka bounced back to square the series with a 132-run win on Sunday. That was a match where they basically produced the perfect game and ticked all the boxes. The top order gave a solid start before the middle order capitalized on it and the lower middle order finished things off in style scoring 109 runs from the last ten overs. Sri Lanka piled up 323 for six and Afghanistan were never in the hunt as they were shot out for 191. “The last game was a perfect exhibition of our plans. Everything was executed well. Since we had wickets in hand we could take risks. We could double the score and that was the plan. That’s what we want to do,” Sri Lanka’s Batting Coach Naveed Nawaz told journalists. Prior to this series, we had a free period and we worked a lot on players’ fitness at the High-Performance Center. During this series we brought in a dietician and planned our food patterns. There is also a psychologist around. This is all done in a bid to establish whatever we have lost in the last few years,” Nawaz added. While Sri Lanka are fretting over World Cup qualifications, there’s no such trouble for Afghanistan. Their captain Hashmatullah Shahidi told journalists that they will be one of the dark horses during the World Cup. “Our ratings are improving day by day and match by match. We believe that we can do something special in this World Cup. We will be one of the best teams in the World Cup. We are the dark horses. The Asian conditions will suit our spin bowlers and we are excited,” Hashmatullah Shahidi said. For today’s series decider leg-spinner Rashid Khan is expected to make a comeback having missed the first two ODIs due to a back injury. “He is obviously our star performer. We didn’t want to take any risks with him as we have the Asia Cup and the World Cup. We will assess his situation during training and make a call whether he is ready to feature in the final game. It will mean a lot to us to come here to Sri Lanka and beat them in their own backyard,” the Afghan captain said. Published on By Have Sri Lanka, Afghanistan and Bangladesh formally rejected the hybrid model proposed by Pakistan Cricket Board (PCB) for the Asia Cup? That seems to be the latest on the imbroglio that has led to prolonged uncertainty over staging of the six-national continental championship. Sri Lanka is set to be the host. According to the news coming in from Pakistan, Sri Lanka Cricket (SLC), Bangladesh Cricket Board (BCB) and Afghanistan Cricket Board (ACB) have written to the Asian Cricket Council (ACC) formally rejecting the host PCB’s formula of conducting four games in Pakistan and rest of the matches in the UAE, thereby upholding the position of the BCCI which has been opposed to the model. The development was revealed by Rashid Latif. “India and 3 countries, except Pakistan, rejected Hybrid model for Asia cup, All agreed on one venue due to logistics and financial issues. Might be a Zoom meeting soon or a general meeting in Dubai in a few days to finalise the matter (Sic),” the former Pakistan captain said in a Twitter post. When contacted by Cricbuzz, Latif confirmed the news and also guaranteed the authenticity of this update. “I have information from independent sources that four countries have rejected the model and it is now a formality that the Asia Cup will be moved out of Pakistan,” Latif, a highly respected former captain, told cricbuzz on Tuesday morning. Asked if Pakistan would participate in the tournament, he said it should. “I feel Pakistan should and will.” However, there was no official clarity on the topic until late in the evening yesterday. Previously cricbuzz had reported, quoting an SLC official, that Sri Lanka were prepared to host the championship if allotted by the ACC. The six-team Asia Cup, tentatively scheduled to start in the second week of September, is seen as a significant precursor to the World Cup in October-November. India, Pakistan, Bangladesh, Sri Lanka, Afghanistan and Nepal are to take part in the 17-game championship. Published on By Under 13 All Island Inter Schools Badminton Tournament 2023 conducted by Sri Lanka Schools Badminton Association with the support of Sri Chandananda Buddhist College Kandy will be held from June 10 to 12 at Municipal Indoor Stadium Kandy. The championship will see ten events for both girls and boys being conducted in five Divisions namely, A, B, C, D, and E. According to Sri Lanka Schools Badminton Association, hundred school teams have confirmed their participation in the event. Further details of the championship can be obtained from Malika Waduge (077-7494478), Secretary, Sri Lanka Schools Badminton Association. Published on By Australia and India will meet at the Oval on Wednesday (07) for the ICC World Test Championship 2023. The winners of the World Test Championship final will receive £1.29m in prize money and the losers £644,000.","pubDate":"2023-06-06 23:59:32","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs","link":"https://www.firstpost.com/firstcricket/sports-news/uae-vs-west-indies-2nd-odi-highlights-wi-win-by-78-runs-12700682.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs","content":"Cricket UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs West Indies defeated UAE by 78 runs on Tuesday to take an un assailable 2-0 lead in the ODI series. FirstCricket Staff June 7th, 2023 8:10:24 IST West Indies won the toss in the second ODI against UAE and opted to bat. Image: Twitter @windiescricket Match result: Brandon King and Jhonson Charles hit the fifties as West Indies were bowled out for 306. In reply, UAE were restricted to 228/7 with Ali Naseer scored 57. Preview: West Indies will look to seal the ODI series against the United Arab Emirates (UAE) when the two teams meet in the second game of the three-match series at the Sharjah Cricket Stadium on Tuesday. In the first match, the Windies rode on knocks from Brandon King (112) and Shamarh Brooks (44) to chase down 203 with seven wickets and 14.4 overs to spare. UAE had opted to bat in that contest, and barring Ali Naseer (58) and Vriitya Aravind (40), most of the other batters failed to convert starts. Keemo Paul (3/34) stood out among the wicket-takers to see off UAE for 202 in 47.1 overs. This series is vital for both teams, with both West Indies and UAE slated to take part in the ICC Cricket World Cup 2023 Qualifiers later in June. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: June 07, 2023 08:10:24 IST Tags: Uae Cricket Team West Indies Cricket Team Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-06-07 02:40:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/06/UAE-vs-WI-2nd-ODI-640_Twitter-@windiescricket.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"5 देशों के खिलाफ पहले ही टेस्‍ट में जड़ चुका शतक, फिर भी भारत की &#039;रेड बॉल&#039; टीम में नहीं मिल रही जगह","link":"https://hindi.news18.com/news/sports/cricket-unique-records-of-shikhar-dhawan-scored-hundred-in-his-first-test-against-five-different-countries-6438655.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत के शिखर धवन के नाम 5 देशों के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ने का अनोखा रिकॉर्ड दर्ज है. ओपनर शिखर धवन (Shikhar Dhawan) ने ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़कर यह कारनामा किया था. दुनिया का कोई बैटर 'गब्‍बर' के इस रिकॉर्ड के आस-पास नहीं है.","content":"शिखर धवन पांच देशों-ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ चुके हैं. (IPL) नई दिल्‍ली. वर्ल्‍ड टेस्‍ट चैंपियनशिप (WTC Final ) के फाइनल में रोहित शर्मा की भारतीय टीम (Team India) को आज यानी 7 जून से ऑस्‍ट्रेलिया का सामना करना है. टीम इंडिया ने हाल के वर्षों में अपने प्रदर्शन में बेहद सुधार किया है. एक समय था, जब उसे ‘घर का शेर’ कहा जाता था. माना जाता था कि टीम इंडिया स्पिन के लिए मददगार अपने घरेलू मैदानों पर ही जीत हासिल कर सकती है, लेकिन इस धारणा को बदलते हुए इसने विदेशी मैदान पर ही बड़ी-बड़ी टीमों को धूल चटाई है. इस शानदार प्रदर्शन के बीच भारत के एक बल्‍लेबाज के नाम पांच देशों के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ने का अनोखा रिकॉर्ड दर्ज है. बाएं हाथ के ओपनर शिखर धवन (Shikhar Dhawan) ने ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़कर यह कारनामा किया था. दुनिया का कोई बैटर ‘गब्‍बर’ के इस रिकॉर्ड के आस-पास नहीं है. एलेस्टेयर कुक, मैथ्‍यू हेडन, कुमार संगकारा, ग्रीम स्मिथ और मार्क टेलर ऐसे बल्‍लेबाज हैं, जिन्‍होंने 4 टीमों के खिलाफ अपने पहले टेस्‍ट में सैकड़ा लगाया था. टेस्‍ट डेब्‍यू करते हुए ऑस्‍ट्रेलिया के खिलाफ जड़ा सैकड़ा धवन ने वर्ष 2013 में ऑस्‍ट्रेलिया के खिलाफ मोहाली में डेब्‍यू करते हुए अपने पहले ही टेस्‍ट में शतक (107 रन)लगाया था. फरवरी 2014 में न्‍यूजीलैंड, जून 2015 में बांग्‍लादेश,अगस्‍त 2015 में श्रीलंका और जून 2018 में अफगानिस्‍तान के खिलाफ भी वे अपने पहले टेस्‍ट में शतक जमा चुके हैं.धवन ने 34 टेस्‍ट मैचों में अब तक 40.61 के औसत से 2315 रन बनाए हैं जिसमें सात शतक और पांच अर्धशतक शामिल हैं. मजे की बात यह है कि उन्‍होंने अपना अंतिम टेस्‍ट सितंबर 2018 में उसी ओवल मैदान पर खेला था जहां वर्ल्‍ड टेस्‍ट चैंपियनिशप 2023 का फाइनल होना है. रोहित शर्मा की प्लेइंग-XI में 5 बल्लेबाज और 2 ऑलराउंडर, WTC Final में इन 11 खिलाड़ियों को मिल सकता है मौका 37 वर्ष में अभी भी बल्‍ले से कर रहे ‘धमाल’ 37 वर्ष के हो चुके शिखर धवन अभी भी बल्‍ले से जोरदार प्रदर्शन कर रहे हैं.आईपीएल-2023 में शानदार प्रदर्शन करने वाले धवन 2015 के वर्ल्‍डकप और 2017 की चैंपियंस ट्रॉफी में भारतीय की ओर से सबसे ज्‍यादा रन बनाने वाले बैटर रहे हैं. वनडे में वे सबसे तेज 1000, 2000 और तीन हजार रन पूरे करने वाले भारतीय बैटर रह चुके हैं.शिखर अभी भी इंटरनेशनल क्रिकेट में खेल रहे हैं. 167 वनडे में 6793 रन (औसत 44.11, 17 शतक) और 68 टी20I में 27.92 के औसत से 1759 रन वे बना चुके हैं. अपना आखिरी इंटरनेशनल मैच उन्‍होंने वनडे के रूप में बांग्‍लादेश के खिलाफ दिसंबर 2022 में चटगांव में खेला था. . Tags: Cricket , Shikhar dhawan , Team india , WTC Final पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट","pubDate":"2023-06-07 02:39:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shikhar-Dhawan-IPL-3-16843753803x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC 2023 Final, IND vs AUS: क्या दो स्पिनर्स के साथ उतरेगा भारत ? ऐसा बन रहा प्लेइंग XI का समीकरण","link":"https://sports.ndtv.com/hindi/cricket/wtc-2023-final-ind-vs-aus-prediction-squad-probable-xi-icc-world-test-championship-final-2023-4100561#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WTC 2023 Final, IND vs AUS: विश्व टेस्ट चैंपियनशिप के फाइनल में आज भारत का मुकाबला ऑस्ट्रेलिया के साथ शुरू होगा. इंग्लैंड के द ओवल में यह ऐतिहासिक टेस्ट मैच खेला जा रहा है. भारत के पास इतिहास रचने का मौका होगा. 10 साल से भारतीय टीम आईसीसी को कोई ट्रॉफी नहीं जीत पाई है. देखना होगा कि इस बार रोहित की कप्तानी में भारतीय टीम इतिहास रच पाती है या नहीं.","content":"WTC 2023 Final, IND vs AUS: भारतीय प्लेइंग इलेवन का ऐसा है समीकरण : विश्व टेस्ट चैंपियनशिप के फाइनल में आज भारत और ऑस्ट्रेलिया के बीच मुकाबला शुरू होगा.इस टेस्ट मैच को जीतकर कोई एक टीम टेस्ट क्रिकेट की बादशाहत हासिल करने में सफल रहेगी. इस टेस्ट मैच में भारत की प्लेइंग इलेवन क्या होगी, इसको लेकर अभी भी जिज्ञासा का विषय है. खासकर शार्दुल ठाकुर, अश्विन, उमेश यादव, जयदेव उनादकट , ऐसे खिलाड़ी हैं जिनको लेकर कन्फ्यूजन बना हुआ है. भारत की कौशल और जज्बे से भरी टीम बुधवार से जब यहां ऑस्ट्रेलिया की मजबूत टीम के खिलाफ विश्व टेस्ट चैंपियनशिप (WTC Final) फाइनल में उतरेगी तो उसकी नजरें आईसीसी (ICC) खिताब के एक दशक के सूखे को खत्म करने पर टिकी होंगी. WTC के पिछले दो चक्र में भारत सबसे निरंतर प्रदर्शन करने वाली टीम रहा है और पिछले 10 साल में सफेद गेंद के लगभग सभी बड़े टूर्नामेंट के नॉकआउट चरण में जगह बनाने में सफल रहा लेकिन इसके बावजूद खिताब नहीं जीत पाया. भारत ने पिछला आईसीसी खिताब 2013 में इंग्लैंड में चैंपियन्स ट्रॉफी के रूप में जीता था, इसके बाद भारत को तीन बार फाइनल में हार का सामना करना पड़ा जबकि टीम चार बार सेमीफाइनल में हारी। टीम 2021 टी20 विश्व कप के शुरुआती दौर से ही बाहर हो गई. भारतीय टीम स्वेदश में अजेय रही, इंग्लैंड में कड़ी सीरीज ड्रॉ कराई और बांग्लादेश में मुश्किल में घिरने के बावजूद जीत हासिल की. द ओवल में नतीजा कुछ भी हो लेकिन मुख्य कोच राहुल द्रविड़ का टीम के प्रति नजरिया नहीं बदलेगा. 'द ओवल' 143 साल के अपने इतिहास में पहली बार जून में टेस्ट मैच की मेजबानी कर रहा है. भारत रविचंद्रन अश्विन और रविंद्र जडेजा की स्पिन जोड़ी को खिलाने को लेकर उत्सुक होगा लेकिन इंग्लैंड में गर्मियों की शुरुआत है और तरोताजा पिचों पर चौथा तेज गेंदबाज बेहतर विकल्प हो सकता है. विकेटकीपर ऋषभ पंत की गैरमौजूदगी में भारतीय टीम प्रबंधन को फैसला करना होगा कि उसे इशान किशन के रूप में ‘एक्स फेक्टर' (मैच का रुख बदलने वाला खिलाड़ी) चाहिए या फिर केएस भरत के रूप में अधिक विश्वसनीय विकेटकीपर. रोहित ने प्रेस से बात करते हुए कहा था कि प्लेइंग इलेवन का आखिरी फैसला मैच के दिन ही परिस्थिति को देखकर दिया जाएगा. यदि पिच पर नमी रहेगी तो फिर शार्दुल खेल सकते हैं अगर मौसम साफ रहा तो यकीनन भारतीय टीम दो स्पिनर्स के साथ मैदान पर उतर सकती है. तेज गेंदबाजी विभाग में मोहम्मद शमी और मोहम्मद सिराज का खेलना तय है जबकि तीसरे विकल्प के रूप में अनुभवी उमेश यादव और ऑलराउंडर शारदुल ठाकुर चुनौती पेश कर रहे हैं. भारतीय बल्लेबाजों के लिए पैट कमिंस, मिशेल स्टार्क और स्कॉट बोलैंड जैसे तेज गेंदबाजों का सामना करना आसान नहीं होगा. इस मुकाबले को ‘अल्टीमेट टेस्ट' कहां जा रहा है और बेशक इस मैच में रोहित शर्मा और विराट कोहली जैसे अनुभवी खिलाड़ियों के अलावा शुभमन गिल जैसे उभरते हुए स्टार की परीक्षा होगी. चेतेश्वर पुजारा काउंटी क्रिकेट की अच्छी फॉर्म को इस मुकाबले में दोहराना चाहेंगे जबकि अजिंक्य रहाणे वापसी करते हुए अच्छा प्रदर्शन करने को बेताब होंगे. भारतीय टीम के विपरीत ऑस्ट्रेलियाई खिलाड़ियों को मैच फिट होने का अधिक मौका नहीं मिला है लेकिन वे इस मुकाबले में तरोताजा होकर उतरेंगे. टीम के सिर्फ तीन खिलाड़ी आईपीएल में खेले जबकि मार्नस लाबुशेन और स्टीव स्मिथ काउंटी टीमों का हिस्सा रहे.पैट कमिंस जैसे खिलाड़ियों ने स्वदेश में तैयारी करने का विकल्प चुना. मैच का नतीजा काफी हद तक इस पर निर्भर करेगा कि स्तरीय तेज गेंदबाजी के खिलाफ दोनों टीम का शीर्ष क्रम कैसा प्रदर्शन करता है। ऑस्ट्रेलिया को सलामी बल्लेबाज उस्मान ख्वाजा से काफी उम्मीदें हैं जबकि डेविड वार्नर अपने करियर के अंतिम चरण में अपनी छाप छोड़ना चाहेंगे. इस मैदान पर स्मिथ का औसत 100 का है और अगर भारत को मैच पर पकड़ बनानी है तो उन्हें जल्दी आउट करना होगा. पिच चाहे कैसा भी बर्ताव करे अनुभवी ऑफ स्पिनर नाथन लियोन विरोधी बल्लेबाजों को परेशान करने की क्षमता रखते हैं जबकि ऑलराउंडर के रूप में कैमरन ग्रीन की भूमिका भी महत्वपूर्ण होगी. डेविड वार्नर, उस्मान ख्वाजा, मारनस लाबुशेन, स्टीव स्मिथ, ट्रैविस हेड, कैमरन ग्रीन, एलेक्स केरी (wk), मिचेल स्टार्क, पैट कमिंस (c)स्कॉट बोलैंड, नाथन लियोन रोहित शर्मा (c), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, केएस भरत (wk), रविचंद्रन अश्विन/शार्दुल ठाकुर, उमेश यादव/जयदेव उनादकट, मोहम्मद शमी, मोहम्मद सिराज : पैट कमिंस (कप्तान), स्कॉट बोलैंड, एलेक्स कैरी, कैमरन ग्रीन, मार्कस हैरिस, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मार्नस लाबुशेन, नाथन लियोन, जोश इंग्लिस, टॉड मर्फी, स्टीव स्मिथ, मिशेल स्टार्क, डेविड वार्नर मिचेल मार्श और मैट रेनशॉ रोहित शर्मा (कप्तान), रविचंद्रन अश्विन, केएस भरत, शुभमन गिल, रविंद्र जडेजा, विराट कोहली, इशान किशन, चेतेश्वर पुजारा, अक्षर पटेल, अजिंक्य रहाणे, मोहम्मद शमी, मोहम्मद सिराज, शार्दुल ठाकुर, जयदेव उनादकट, और उमेश यादव यशस्वी जायसवाल, मुकेश कुमार और सूर्यकुमार यादव मैच भारतीय समयानुसार दोपहर तीन बजे से शुरू होगा * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-06-07 02:06:20","image_url":"https://c.ndtvimg.com/2023-06/fds0f5qo_rohit-ashwin_625x300_06_June_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final का रोमांचक मुकाबला फ्री में देखिए, जानें कहां, कब और कैसे देख सकते हैं भारत और ऑस्ट्रेलिया का मैच","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-live-streaming-when-and-where-to-watch-live-telecast-star-sports-doordarshan-live-streaming-disneyhotstar-app-ind-vs-aus-6438595.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India vs Auatralia WTC Final Live Streaming: भारत और ऑस्ट्रेलिया के बीच वर्ल्ड टेस्ट चैंपियनशिप का फाइनल आज से इंग्लैंड के द ओवल मैदान पर खेला जाना है. भारतीय टीम की कप्तानी रोहित शर्मा करेंगे, वहीं ऑस्ट्रेलियाई टीम की कमान पैट कमिंस संभाल रहे हैं. दोनों ही टीमों की नजर पहले डब्ल्यूटीसी खिताब पर है.","content":"India vs Auatralia WTC Final Live Streaming: फाइनल मुकाबला भारतीय समयानुसार दोपहर 3 बजे से शुरू होगा. (BCCI Twitter) नई दिल्ली. भारत और ऑस्ट्रेलिया के बीच वर्ल्ड टेस्ट चैंपिनयनशिप का फाइनल मुकाबला 7 जून बुधवार से शुरू होने जा रहा है. इंग्लैंड के द ओवल मैदान में यह रोमांचक मुकाबला खेला जाएगा. ऐसे में सभी फैंस यह चाहेंगे कि यह मैच वे कैसे, कब और कहां देख सकते हैं. तो आइए हम आपको बताते हैं कि आप इस मैच का लुत्फ फ्री में कैसे उठा सकते हैं. दोनों ही टीमों की नजर पहले वर्ल्ड टेस्ट चैंपियनशिप के टाइटल पर है. ऐसे में इस मुकाबले में कई रिकॉर्ड भी बनने वाले हैं. टीम इंडिया की कप्तानी रोहित शर्मा कर रहे हैं तो ऑस्ट्रेलिया टीम की कमान तेज गेंदबाज पैट कमिंस संभाल रहे हैं. टीम इंडिया मैच में मनोवैज्ञानिक बढ़त के साथ उतरेगी. उसने कंगारू टीम के खिलाफ अंतिम चारों टेस्ट सीरीज जीती हैं. इस दौरान भारत ने ऑस्ट्रेलिया को उसी के घर में 2 बार हराया है. रोहित शर्मा से लेकर विराट कोहली तक 10 साल के आईसीसी ट्रॉफी के सूखे को भी खत्म करना चाहेंगे. भारत और ऑस्ट्रेलिया के बीच WTC Final का मुकाबला कब खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final कहां खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final कितने बजे से खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final मैच का लाइव टेलीकास्ट कहां देखें? भारत और ऑस्ट्रेलिया के बीच आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल मैच की लाइव स्ट्रीमिंग कहां देखें? . Tags: Australia , India vs Australia , Team india , WTC Final धांसू है अनलिमिटेड बेनिफिट्स वाला ये प्रीपेड प्लान, 130 दिन के लिए रिचार्ज की टेंशन हो जाती है दूर, रोजाना का खर्च भी महज 5 रुपये पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज","pubDate":"2023-06-07 01:35:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-1-16859452793x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"रोहित शर्मा की प्लेइंग-XI में 5 बल्लेबाज और 2 ऑलराउंडर, WTC Final में इन 11 खिलाड़ियों को मिल सकता है मौका","link":"https://hindi.news18.com/photogallery/sports/cricket-wtc-final-2023-rohit-sharma-can-give-chance-to-5-batsmen-and-2-all-rounders-in-playing-xi-in-final-vs-australia-team-india-6438443.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"WTC Final Playing-11: टीम इंडिया आज से ऑस्ट्रेलिया के खिलाफ शुरू हो रहे वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में किन 11 खिलाड़ियों को मौका देती है, इस पर सभी की नजर है. इंग्लैंड के द ओवल मैदान की पिच को बाउंसी विकेट बताया जा रहा है. ऐसे में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 5 बल्लेबाजों के साथ 2 ऑलराउंडर्स को मौका दे सकते हैं.","content":"WTC Final Playing-11: टीम इंडिया आज से ऑस्ट्रेलिया के खिलाफ शुरू हो रहे वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में किन 11 खिलाड़ियों को मौका देती है, इस पर सभी की नजर है. इंग्लैंड के द ओवल मैदान की पिच को बाउंसी विकेट बताया जा रहा है. ऐसे में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 5 बल्लेबाजों के साथ 2 ऑलराउंडर्स को मौका दे सकते हैं. भारतीय ऑलराउंडर शार्दुल ठाकुर ने ऑस्ट्रेलिया के खिलाफ आज से ओवल में शुरू होने वाले वर्ल्ड टेस्ट चैंपियनशिप फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया. उनके इस बयान से साफ है कि टीम मैनेजमेंट की ओर से उन्हें फाइनल में मौका दिए जाने की बात कही गई हो, लेकिन कप्तान रोहित शर्मा ने कहा कि पिच हर दिन अपना मिजाज बदल रही है. ऐसे में प्लेइंग-11 पर फैसला मैच वाले दिन लिया जाएगा. तेज गेंदबाज और ऑलराउंडर शार्दुल ठाकुर ने करियर के 8 में से 3 टेस्ट मैच इंग्लैंड में ही खेले हैं. ऐसे में वे एक और बड़े मुकाबले के लिए तैयार हैं. (AP) ओवल की पिच को लेकर साफ है कि यहां तेज गेंदबाजों को बड़ी मदद मिलती है. पिच क्यूरेटर भी साफ कर चुके हैं कि फाइनल में बाउंसी विकेट देखने को मिलेगा. ऐसे में मैच में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 3 तेज गेंदबाजों को उतार सकते हैं. इसमें मोहम्मद शमी, मोहम्मद शमी और उमेश यादव हैं. हालांकि बाएं हाथ के तेज गेंदबाज जयदेव उनादकट को भी रेस से बाहर नहीं माना जा सकता. (BCCI Twitter) ऑलराउंडर्स की बात करें, तो रवींद्र जडेजा और शार्दुल ठाकुर को ऑस्ट्रेलिया के खिलाफ जगह दी जा सकती है. बतौर ऑलराउंडर शार्दुल ने ऑस्ट्रेलिया से लेकर इंग्लैंड तक में अच्छा प्रदर्शन किया है. जडेजा आईपीएल 2023 में कमाल करके आ रहे हैं. मैच में रोहित शर्मा के साथ शुभमन गिल ओपनिंग कर सकते हैं. नंबर-3 पर चेतेश्वर पुजारा, नंबर-4 पर विराट कोहली, नंबर-5 पर अजिंक्य रहाणे तो बतौर विकेटकीपर केएस भरत को मौका मिल सकता है. (BCCI Twitter) इस बीच टीम इंडिया के कोच राहुल द्रविड़ तैयारियों से खुश हैं. द्रविड़ ने ‘स्टार स्पोर्ट्स से कहा कि हमें कुछ अनुभवी खिलाड़ी मिले हैं. हमने पिछले 18 महीनों के दौरान कई युवा खिलाड़ियों को आजमाया हैं. हमें 3 अलग-अलग फॉर्मेट और भारतीय टीम के द्वारा अधिक संख्या में मैच खेलने के कारण ज्यादा खिलाड़ियों का इस्तेमाल करना पड़ा. (AFP) टीम इंडिया के पूर्व कप्तान राहुल द्रविड़ ने कहा कि हमारी क्रिकेट प्रणाली बहुत सारे खिलाड़ी आ रहे हैं और बाहर भी हो रहे हैं. यह वास्तव में रोमांचक रहा है और मेरे लिए भी सीखने का एक अच्छा अनुभव रहा है. उन्होंने कहा कि हां, यह बहुत मजेदार रहा है और मैंने इसका लुत्फ उठाया है. इस दौरान मुझे बहुत सारे खिलाड़ियों के साथ काम करने और एक बड़े समूह के साथ बेहतर रिश्ते बनाने का मौका मिला. (AP) भारतीय कोच राहुल द्रविड़ ने कहा कि इन 18 महीनों के दौरान मैंने एक व्यक्ति के रूप में अपने बारे में और कोचिंग के बारे में भी बहुत कुछ सीखा है. फाइनल के लिए संभावित भारतीय प्लेइंग-XI: रोहित शर्मा, शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, केएस भरत, शार्दुल ठाकुर, मोहम्मद शमी, उमेश यादव और मोहम्मद सिराज. (AP) पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट भारतीय ऑलराउंडर शार्दुल ठाकुर ने ऑस्ट्रेलिया के खिलाफ आज से ओवल में शुरू होने वाले वर्ल्ड टेस्ट चैंपियनशिप फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया. उनके इस बयान से साफ है कि टीम मैनेजमेंट की ओर से उन्हें फाइनल में मौका दिए जाने की बात कही गई हो, लेकिन कप्तान रोहित शर्मा ने कहा कि पिच हर दिन अपना मिजाज बदल रही है. ऐसे में प्लेइंग-11 पर फैसला मैच वाले दिन लिया जाएगा. तेज गेंदबाज और ऑलराउंडर शार्दुल ठाकुर ने करियर के 8 में से 3 टेस्ट मैच इंग्लैंड में ही खेले हैं. ऐसे में वे एक और बड़े मुकाबले के लिए तैयार हैं. (AP)","pubDate":"2023-06-07 00:59:31","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-playing-11-16860990553x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final से पहले हड़कंप मचाने वाला बयान, मेरे जैसे खिलाड़ी को जिंदगी में 1 बार मिलता है ऐसा मौका!","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-all-rounder-shardul-thakur-calls-world-test-championship-final-against-australia-once-in-a-lifetime-moment-6438103.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल की ट्रॉफी किसकी होगी सबकी नजरें इस पर ही जमी है. भारतीय टीम ने लगातार दूसरी बार फाइनल में जगह बनाई है तो ऑस्ट्रेलिया की टीम पहली बार फाइनल खेलने उतरेगी.","content":"कप्तान रोहित शर्मा, शार्दुल ठाकुर और ईशान किशन-AP नई दिल्ली. भारतीय क्रिकेट टीम एक और बेहद रोमांचक आईसीसी इवेंट के फाइनल में उतरने के लिए तैयार है. वर्ल्ड टेस्ट चैंपियनशिप फाइनल की ट्रॉफी किसकी होगी सबकी नजरें इस पर ही जमी है. भारतीय टीम ने लगातार दूसरी बार फाइनल में जगह बनाई है तो ऑस्ट्रेलिया की टीम पहली बार फाइनल खेलने उतरेगी. भारतीय ऑलराउंडर शार्दुल ठाकुर में ऑस्ट्रेलिया के खिलाफ बुधवार से ओवल में शुरू होने वाले विश्व टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया और कहा कि वह इसमें अपनी छाप छोड़ना चाहते हैं. अभी तक अपने आठ में से तीन टेस्ट मैच इंग्लैंड में खेलने वाले ठाकुर को अंतिम एकादश में जगह मिलेगी या नहीं यह अभी तक तय नहीं है लेकिन यह 31 वर्षीय खिलाड़ी अपनी तरफ से पूरी तरह तैयार है. ठाकुर ने आईसीसी से कहा, ‘‘ मेरा मानना है आईसीसी प्रतियोगिता विशेषकर फाइनल में खेलने का मौका हमेशा नहीं मिलता है इसलिए मुझ जैसे खिलाड़ी के लिए यह जिंदगी में एक बार मिलने वाला अवसर है. मैं यही चाहता हूं कि इसका पूरा फायदा उठाया जाए. वह हमेशा विशेष क्षण होता है जब आप अपने देश का प्रतिनिधित्व करते हैं विशेषकर भारत का जहां करोड़ों लोग देश की तरफ से खेलने का सपना देखते हैं और केवल सर्वश्रेष्ठ 15 को ही देश का प्रतिनिधित्व करने के लिए चुना जाता है.’’ WTC फाइनल के लिए भारतीय टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, रविचंद्रन अश्विन, अक्षर पटेल, केएस भरत (विकेटकीपर), शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, जयदेव उनादकट, उमेश यादव, ईशान किशन (विकेटकीपर). स्टैंडबाय खिलाड़ी: यशस्वी जायसवाल, मुकेश कुमार, सूर्यकुमार यादव. WTC फाइनल के लिए ऑस्ट्रेलिया की टीम: पैट कमिंस (कप्तान), स्कॉट बोलैंड, एलेक्स केरी (विकेटकीपर), कैमरन ग्रीन, मार्कस हैरिस, ट्रैविस हेड, जोश इंगलिस (विकेटकीपर), उस्मान ख्वाजा, मार्नस लाबुशेन, नाथन लायन, टॉड मर्फी, माइकल नेसर, स्टीव स्मिथ (उप-कप्तान), मिचेल स्टार्क, डेविड वॉर्नर स्टैंडबाय खिलाड़ी: मिचेल मार्श, मैथ्यू रेनशॉ. . Tags: India vs Australia , Shardul thakur , WTC Final रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट जहां पढ़े विवेकानंद और सुभाष चंद्र बोस उस कॉलेज को मिला 100वां स्‍थान काजोल नहीं, शाहरुख की दोस्त थीं मेकर्स की पहली पसंद, 1995 में बनी इस फिल्म ने तोड़ दिए थे कमाई के कई रिकॉर्ड","pubDate":"2023-06-07 00:45:23","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-with-ishan-kishan-and-shardul-thakur-16860774313x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"टीम इंडिया के चैंपियन पर फैसला! रोहित शर्मा ने इंतजार करने कहा, सभी 15 खिलाड़ियों को तैयार रहने का निर्देश","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-rohit-sharma-reply-on-r-ashwin-we-have-to-wait-all-15-players-are-told-to-be-ready-for-match-agaist-australia-6437921.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और ऑस्ट्रेलिया के बीच होने वाले मुकाबले से जुड़ी हर एक जानकारी लोग जानने को उत्सुक हैं. मैच से पहले टीम इंडिया के कप्तान रोहित शर्मा ने मीडिया से बात की. टीम कॉम्बिनेशन और प्लेइंग इलेवन के सवाल पर उन्होंने कुछ नहीं कहा साथ ही आर अश्विन मैच खेलेंगे या नहीं इसको भी अपने तरीके से टाल गए.","content":"भारतीय टीम के कोच राहुल द्रविड़ कप्तान रोहित शर्मा और बल्लेबाजी कोच विक्रम राठौर के साथ -AP नई दिल्ली. आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लेकर फैंस में गजब का रोमांच है. भारत और ऑस्ट्रेलिया के बीच होने वाले मुकाबले से जुड़ी हर एक जानकारी लोग जानने को उत्सुक हैं. मैच से पहले टीम इंडिया के कप्तान रोहित शर्मा ने मीडिया से बात की. टीम कॉम्बिनेशन और प्लेइंग इलेवन के सवाल पर उन्होंने कुछ नहीं कहा साथ ही आर अश्विन मैच खेलेंगे या नहीं इसको भी अपने तरीके से टाल गए. रोहित से पूछा गया कि क्या अश्विन को बाहर करना मुश्किल फैसला होगा, उन्होंने कहा,‘‘ मैंने यह तो नहीं कहा कि अश्विन नहीं खेलेंगे. हमें कल तक इंतजार करना होगा क्योंकि एक चीज मैंने देखी है कि पिच वास्तव में दिन प्रतिदिन बदलती जा रही है.’’ भारतीय कप्तान ने कहा,‘‘ पिच आज जैसी है हो सकता है कि कल वह उससे भिन्न हो. इसलिए सभी 15 खिलाड़ियों के लिए स्पष्ट संदेश है कि सभी को खेलने के लिए तैयार रहना चाहिए.’’ पिच में अभी घास दिख रही है और अगर सुबह बादल छाए रहते हैं तो अतिरिक्त तेज गेंदबाज के साथ उतरना फायदेमंद हो सकता है। रोहित ने कहा,‘‘ मैंने कल पिच देखी थी, आज मुझे इसका मौका नहीं मिला लेकिन निश्चित तौर पर लग रहा है कि उससे तेज गेंदबाजों को थोड़ा मदद मिलेगी। बादल छाए रहने पर तेज गेंदबाज थोड़ा प्रभावी साबित हो सकते हैं।’’ ओवल में पहला टेस्ट मैच 1880 में खेला गया था लेकिन यह पहला अवसर है जबकि वह जून के महीने में टेस्ट मैच की मेजबानी करेगा। रोहित हालांकि इस आंकड़े को गंभीरता से नहीं लेते हैं। उन्होंने कहा,‘‘ हम सुन रहे हैं यहां जून में बहुत अधिक क्रिकेट नहीं खेली जाती है। काउंटी के मैच यहां खेले गए हैं। हमने देखा था कि दो सप्ताह पहले यहां मैच खेला गया था। ऐसा नहीं है कि इस मैदान पर यह इस सत्र का पहला मैच होगा। हम इससे अच्छी तरह वाकिफ हैं कि परिस्थितियां कैसी हैं और अगले पांच दिन में क्या होने वाला है।’’ . Tags: R ashwin , Rohit sharma , WTC Final शरीर के हर अंग को तंदुरुस्त करती हैं ये 5 सब्जियां, मेटाबोलिज्म और इम्यूनिटी दोनों होता है मजबूत, बीमारियां रहती हैं दूर WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट","pubDate":"2023-06-07 00:36:45","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/Rahul-with-rohit-and-vikram-3-16860750663x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final 2023: वो 5 कारण जो भारत को बना सकते हैं वर्ल्ड चैंपियन, मैच से पहले ही पिछड़ा ऑस्ट्रेलिया","link":"https://hindi.news18.com/news/sports/cricket-india-may-become-wtc-champion-predicts-former-coach-lalchand-rajput-shubman-gill-pujara-kohli-shami-siraj-6437805.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम का द ओवल में होने वाले डब्ल्यूटीसी फाइनल में अपर हैंड है. ऑस्ट्रेलिया के खिलाफ भारतीय टीम का पलड़ा भारी रहने की उम्मीद है. वैसे तो इसके कई कारण हैं, लेकिन सबसे पहले तो मैं यही कहूंगा कि हम लगातार दूसरी बार फाइनल में पहुंचे हैं. पिछली बार न्यूजीलैंड से हम हार गए थे. लेकिन अब हम मानसिक तौर पर अच्छी तरह तैयार हैं. मैं यहां ऐसे 5 कारण बताऊंगा जो भारत को जीत का दावेदार बनाते हैं.","content":"टीम इंडिया का फाइनल में पलड़ा भारी है. (AP) भारतीय क्रिकेट टीम एक और विश्व खिताब की दहलीज पर है. आज (7 जून) से शुरू हो रही आईसीसी वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में यूं तो कांटे के मुकाबले की उम्मीद जताई जा रही है. लेकिन मुझे लगता है कि भारतीय टीम का द ओवल में होने वाले डब्ल्यूटीसी फाइनल में अपर हैंड है. ऑस्ट्रेलिया के खिलाफ भारतीय टीम का पलड़ा भारी रहने की उम्मीद है. वैसे तो इसके कई कारण हैं, लेकिन सबसे पहले तो मैं यही कहूंगा कि हम लगातार दूसरी बार फाइनल में पहुंचे हैं. पिछली बार न्यूजीलैंड से हम हार गए थे. लेकिन अब हम मानसिक तौर पर अच्छी तरह तैयार हैं. मैं यहां ऐसे 5 कारण बताऊंगा जो भारत को जीत का दावेदार बनाते हैं. 1. शुभमन गिल की सुप्रीम फॉर्म भारत और ऑस्ट्रेलिया दोनों ही टीमों को देखें तो आप पाएंगे कि यदि कोई बैटर पिछले एक साल से अपने सुप्रीम फॉर्म में है, तो वह शुभमन गिल हैं. चाहे वह टेस्ट क्रिकेट हो या वनडे और या फिर टी20 मैच. इस युवा खिलाड़ी ने हर फॉर्मेट में अपनी छाप छोड़ी है. निरंतरता दिखाई है. ऑस्ट्रेलिया उन्हें खतरा मानकर चल रहा होगा. जहां तक भारतीय टीम की बात है तो शुभमन ओपनर हैं. जब ओपनर अच्छी स्टार्ट देते हैं तो टीम बड़ा स्कोर बनाती है. भारतीय टीम उम्मीद करेगी कि शुभमन की यह फॉर्म डब्ल्यूटीसी फाइनल में भी बरकरार रहेगी. 2. विराट कोहली की वापसी विराट कोहली का फॉर्म में लौटना वह दूसरा कारण है, जो भारत की उम्मीदें जगाता है. विराट ने आईपीएल में जमकर रन बनाए. लेकिन यह आईपीएल की बात नहीं है. विराट 2023 में उसी निरंतरता का प्रदर्शन कर रहे हैं, जो उन्होंने अपने करियर के शुरुआती 10 साल में किए. उन्होंने पिछले छह महीने में वनडे, टेस्ट और टी20 मुकाबलों में सेंचुरी बनाई है. विराट कोहली बड़े मैचों के खिलाड़ी रहे हैं. टी20 वर्ल्ड कप में पाकिस्तान के खिलाफ खेली गई पारी अब भी क्रिकेटप्रेमियों की जेहन में होगी. कोई शक नहीं उनका फॉर्म में लौटना टीम को हौसला दे रहा होगा. 3. मोहम्मद शमी की लय मोहम्मद शमी पूरे लय में हैं. आईपीएल 2023 में पर्पल कैप जीतने वाले इस खिलाड़ी की ताकत ही टेस्ट क्रिकेट है. शमी वो बॉलर हैं, जो पहले बैटर को सेट करते हैं और फिर उसका शिकार करते हैं. यह खिलाड़ी लाल गेंद से और भी खतरनाक हो जाता है. इस पर इंग्लैंड की स्विंग को मदद करने वाली परिस्थितियां इस गेंदबाज के लिए सोने पर सुहागा वाला काम करेंगी. 4. सिराज बनाते हैं हंटिंग पेयर मोहम्मद शमी के साथ-साथ मोहम्मद सिराज भी बेहतरीन लय में हैं. उन्होंने आईपीएल 2023 में 14 मैच में 23 विकेट लिए. शमी की तरह सिराज को भी लाल गेंद ज्यादा भाती है. जब आप विकेट लेते हैं तो हौसला बढ़ता है. पिछला प्रदर्शन आगे भी काम आता है. आप ज्यादा विश्वास के साथ बॉलिंग करते हैं. मोहम्मद सिराज के साथ भी यही स्थिति है. मोहम्मद सिराज अपने सीनियर साथी मोहम्मद शमी के साथ हंटिंग पेयर बनाते हैं, जो ऑस्ट्रेलिया का पसीना छुड़ाने वाली साबित होगी. 5. पुजारा बना रहे लगातार रन राहुल द्रविड़ के बाद यदि किसी बैटर ने विकेट पर लंबे समय तक टिकने का माद्दा दिखाया है तो वह चेतेश्वर पुजारा हैं. जब वे सेट होते हैं तो जल्दी आउट नहीं होते. लंबी पारी खेलते हैं. दिनभर खूंटा गाड़कर विरोधी का हौसला तोड़ देते हैं. भारतीय टीम पुजारा से यही उम्मीद भी कर रही होगी. इसकी वजह भी है. पुजारा तकरीबन 2 महीने से इंग्लैंड में हैं. उन्होंने इस दौरान काउंटी क्रिकेट में खूब रन बरसाए हैं. उनकी फॉर्म भारत को ताकत देने वाली साबित होगी. हमें यह भी नहीं भूलना चाहिए कि भारतीय टीम के मौजूदा कप्तान रोहित शर्मा का इंग्लैंड में शानदार प्रदर्शन रहा है. उन्होंने इंग्लैंड में खेल गए 2019 के वर्ल्ड कप में 5 शतक लगाए थे. अजिंक्य रहाणे तो विदेश में प्रदर्शन करने के लिए ही जाने जाते हैं. रवींद्र जडेजा इस समय दुनिया के सबसे बेहतरीन ऑलराउंडरों में शुमार हैं. वे ना सिर्फ स्पेशलिस्ट बैटर की तरह प्रदर्शन करते हैं, बल्कि विकेट से थोड़ी भी मदद मिलने पर विरोधी टीम की खटिया खड़ी कर देते हैं. रविचंद्रन अश्विन भी कम नहीं. तीन टेस्ट शतक लगा चुका यह खिलाड़ी जब गेंद से रंग दिखाता है तो अकेले ही विरोधी टीम को समेट देता है. ऑस्ट्रेलिया को इसका पूरा अनुभव भी है. दूसरी ओर, ऑस्ट्रेलिया अपनी जिस बड़ी ताकत पर इतराता है, वह फाइनल मुकाबले से ठीक पहले थोड़ी कुंद हो गई है. वह ताकत है पेस अटैक की, जो जोश हेजलवुड के चोटिल होने से कमजोर हुई है. कोई शक नहीं कि भारतीय बैटर इस मौके का पूरा फायदा उठाएंगे. कुल मिलाकर भारत की इस टीम में विश्व चैंपियन बनने का पूरा माद्दा है. उम्मीद है ये खिलाड़ी अपनी क्षमता को मैदान पर पुरजोर तरीके से उतारेंगे और भारत को विश्व चैंपियन बनाएंगे. . Tags: India vs Australia , Lalchand Rajput , Shubman gill , Team india , WTC Final शरीर के हर अंग को तंदुरुस्त करती हैं ये 5 सब्जियां, मेटाबोलिज्म और इम्यूनिटी दोनों होता है मजबूत, बीमारियां रहती हैं दूर WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट","pubDate":"2023-06-07 00:17:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-practice-rohit-with-virat-and-rahul-16860429983x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार","link":"https://hindi.news18.com/photogallery/sports/cricket-wtc-final-2023-rohit-sharma-has-won-8-titles-including-5-ipl-as-captain-team-india-ind-vs-aus-6438395.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Rohit Sharma Captaincy Record: रोहित शर्मा की कप्तानी में टीम इंडिया बड़े इम्तिहान के लिए तैयार है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल शुरू होने जा रहा है. रोहित ने बताैर कप्तान कई रिकॉर्ड बनाए हैं, लेकिन वे अब तक आईसीसी ट्रॉफी नहीं जीत सके हैं. भारतीय टीम भी 2013 के बाद से आईसीसी का कोई टाइटल अपने नाम नहीं कर सकी है.","content":"Rohit Sharma Captaincy Record: रोहित शर्मा की कप्तानी में टीम इंडिया बड़े इम्तिहान के लिए तैयार है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल शुरू होने जा रहा है. रोहित ने बताैर कप्तान कई रिकॉर्ड बनाए हैं, लेकिन वे अब तक आईसीसी ट्रॉफी नहीं जीत सके हैं. भारतीय टीम भी 2013 के बाद से आईसीसी का कोई टाइटल अपने नाम नहीं कर सकी है. रोहित शर्मा की कप्तानी में टीम इंडिया आज से इतिहास रचने उतर रही है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेला जाना है. दोनों ही टीमों की नजर टेस्ट के वर्ल्ड कप पर पहली बार कब्जा करने की है. जो भी टीम यह मुकाबला जीतेगी, इतिहास बना देगी. वह वनडे वर्ल्ड कप, टी20 वर्ल्ड कप और चैंपियंस ट्रॉफी के बाद आईसीसी के चौथे टूर्नामेंट पर कब्जा करने वाली पहली टीम बन जाएगी. (AP) रोहित शर्मा की नजर बतौर कप्तान अपने पहले आईसीसी टाइटल पर है. भारतीय टीम भी 2013 से कोई भी आईसीसी ट्रॉफी नहीं जीत सकी है. बतौर कप्तान रोहित का रिकॉर्ड अच्छा रहा है. वे अब तक 8 खिताब जीत चुके हैं. इसमें 5 आईपीएल के टाइटल, एक चैंपियंस लीग टी20, एक एशिया कप और एक निदहास ट्रॉफी का शामिल है. लेकिन उन्होंने अंतिम टाइटल 3 साल पहले 2020 में जीता था. इस दाैरान वे बल्ले से और खूंखार हो गए हैं. पिछले साल टी20 वर्ल्ड कप में रोहित की कप्तानी में टीम इंडिया सेमीफाइनल से आगे नहीं बढ़ सकी थी. (BCCI Twitter) भारत और ऑस्ट्रेलिया के बीच फाइनल ओवल में खेला जाना है. यहां रोहित शर्मा ने 2021 में एकमात्र टेस्ट खेला था और इस दौरान उन्होंने 127 रन की बेहतरीन पारी खेली थी. ऐसे में वे अपने इस प्रदर्शन को बरकरार रखना चाहेंगे. इंग्लैंड में रोहित के टेस्ट के प्रदर्शन को देखें, तो वे 6 मैच की 12 पारियों में 42 की औसत से 466 रन बना चुके हैं. इसमें एक शतक और 2 अर्धशतक शामिल है. वहीं विराट कोहली इंग्लैंड में टेस्ट में 2 शतक ठोक चुके हैं. (AP) टीम इंडिया ने ऑस्ट्रेलिया के खिलाफ अंतिम चारों टेस्ट सीरीज पर कब्जा किया है. ऐसे में उसके हौसले बुलंद हैं. इस दौरान उसने कंगारू टीम को उसी के घर में 2 बार मात दी है. हालांकि जसप्रीत बुमराह, ऋषभ पंत, श्रेयस अय्यर और केएल राहुल के नहीं होने से टीम का बैलेंस जरूर बिगड़ा है. लेकिन अनुभवी खिलाड़ी अजिंक्य रहाणे की वापसी से टीम का मनोबल भी बढ़ा है. आईपीएल 2023 में रहाणे ने बेहतरीन प्रदर्शन किया और सीएसके को चैंपियन भी बनाया. (AP) रोहित शर्मा के कप्तानी के रिकॉर्ड की बात करें, तो उन्होंने अब तक 6 टेस्ट मैच में टीम इंडिया की अगुआई की है. 4 में टीम को जीत मिली है, जबकि एक में हार. एक मुकाबला ड्रॉ रहा. इंटरनेशनल क्रिकेट के तीनों फॉर्मेट को देखें, तो रोहित शर्मा 83 मैच में टीम इंडिया की कप्तानी संभाल चुके हैं. 62 में जीत मिली है जबकि 20 में हार. यानी उनका कप्तानी का रिकॉर्ड भी अच्छा है. (AP) इस बीच दिग्गज बल्लेबाज सचिन तेंदुलकर ने ओवल की पिच टीम इंडिया के अनुकूल बताया और कहा की पिच को देखते हुए भारत फायदे में दिखता है. उन्होंने कहा कि भारतीय टीम खुश होगी कि वह ओवल में खेलने जा रही है. ओवल की पिच का नेचर इस तरह से है कि वह मैच आगे बढ़ने के साथ स्पिनरों को मदद पहुंचाती है. इसलिए स्पिनरों की भूमिका अहम होगी. (BCCI Twitter) तेंदुलकर ने 100 एमबीस्पोर्ट्स से कहा कि इसके लिए जरूरी नहीं है कि हमेशा टर्निंग विकेट की ही जरूरत पड़े. कभी-कभी स्पिनर पिच से मिल रही उछाल का भी फायदा उठाते हैं. उन्हें बादल छाए रहने की परिस्थितियों में भी पिच से मदद मिल सकती है और काफी कुछ गेंद के चमकदार हिस्से पर निर्भर करता है. इन सब कारणों से ओवल भारत के लिए अच्छा स्थान है.(AFP) भारत ने इंग्लैंड के खिलाफ 2021 में ओवल में 157 रन से जीत दर्ज की थी और सचिन तेंदुलकर ने कहा कि उसमें से जुड़ी अच्छी यादें भारत के काम आएंगी. उन्होंने कहा कि निश्चित तौर पर, जब आपके पास इस तरह की अच्छी यादें हों, तो वे आपके साथ बनी रहती हैं. भारतीय टीम को यह नहीं भूलना चाहिए कि पिछली बार उसने यहां शानदार परिणाम हासिल किया था. (AFP) WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट Most Popular IAS : ये IAS अधिकारी हैं सोशल मीडिया सेलिब्रिटी, इंस्टाग्राम पर हैं लाखों फॉलोवर रोहित शर्मा की कप्तानी में टीम इंडिया आज से इतिहास रचने उतर रही है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेला जाना है. दोनों ही टीमों की नजर टेस्ट के वर्ल्ड कप पर पहली बार कब्जा करने की है. जो भी टीम यह मुकाबला जीतेगी, इतिहास बना देगी. वह वनडे वर्ल्ड कप, टी20 वर्ल्ड कप और चैंपियंस ट्रॉफी के बाद आईसीसी के चौथे टूर्नामेंट पर कब्जा करने वाली पहली टीम बन जाएगी. (AP)","pubDate":"2023-06-07 00:09:00","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-3-16860957443x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka confident World Cup qualifiers will go well","link":"http://island.lk/sri-lanka-confident-world-cup-qualifiers-will-go-well/","keywords":["Sports","Angelo Mathews","Featured","Sri Lanka Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Rex Clementine at Suriyawewa Having failed to qualify automatically for the World Cup later this year, Sri Lanka will be flying shortly to Zimbabwe to secure one of the two remaining slots for the sport’s showpiece event. But before that they have got to finish off the ODI series against Afghanistan and the former champions […]","content":"Having failed to qualify automatically for the World Cup later this year, Sri Lanka will be flying shortly to Zimbabwe to secure one of the two remaining slots for the sport’s showpiece event. But before that they have got to finish off the ODI series against Afghanistan and the former champions will be hoping that they will be able to clinch the series prior to flying off to Harare. After losing the first ODI by six wickets, Sri Lanka bounced back to square the series with a 132-run win on Sunday. That was a match where they basically produced the perfect game and ticked all the boxes. The top order gave a solid start before the middle order capitalized on it and the lower middle order finished things off in style scoring 109 runs from the last ten overs. Sri Lanka piled up 323 for six and Afghanistan were never in the hunt as they were shot out for 191. “The last game was a perfect exhibition of our plans. Everything was executed well. Since we had wickets in hand we could take risks. We could double the score and that was the plan. That’s what we want to do,” Sri Lanka’s Batting Coach Naveed Nawaz told journalists. Prior to this series, we had a free period and we worked a lot on players’ fitness at the High-Performance Center. During this series we brought in a dietician and planned our food patterns. There is also a psychologist around. This is all done in a bid to establish whatever we have lost in the last few years,” Nawaz added. While Sri Lanka are fretting over World Cup qualifications, there’s no such trouble for Afghanistan. Their captain Hashmatullah Shahidi told journalists that they will be one of the dark horses during the World Cup. “Our ratings are improving day by day and match by match. We believe that we can do something special in this World Cup. We will be one of the best teams in the World Cup. We are the dark horses. The Asian conditions will suit our spin bowlers and we are excited,” Hashmatullah Shahidi said. For today’s series decider leg-spinner Rashid Khan is expected to make a comeback having missed the first two ODIs due to a back injury. “He is obviously our star performer. We didn’t want to take any risks with him as we have the Asia Cup and the World Cup. We will assess his situation during training and make a call whether he is ready to feature in the final game. It will mean a lot to us to come here to Sri Lanka and beat them in their own backyard,” the Afghan captain said. Published on By Have Sri Lanka, Afghanistan and Bangladesh formally rejected the hybrid model proposed by Pakistan Cricket Board (PCB) for the Asia Cup? That seems to be the latest on the imbroglio that has led to prolonged uncertainty over staging of the six-national continental championship. Sri Lanka is set to be the host. According to the news coming in from Pakistan, Sri Lanka Cricket (SLC), Bangladesh Cricket Board (BCB) and Afghanistan Cricket Board (ACB) have written to the Asian Cricket Council (ACC) formally rejecting the host PCB’s formula of conducting four games in Pakistan and rest of the matches in the UAE, thereby upholding the position of the BCCI which has been opposed to the model. The development was revealed by Rashid Latif. “India and 3 countries, except Pakistan, rejected Hybrid model for Asia cup, All agreed on one venue due to logistics and financial issues. Might be a Zoom meeting soon or a general meeting in Dubai in a few days to finalise the matter (Sic),” the former Pakistan captain said in a Twitter post. When contacted by Cricbuzz, Latif confirmed the news and also guaranteed the authenticity of this update. “I have information from independent sources that four countries have rejected the model and it is now a formality that the Asia Cup will be moved out of Pakistan,” Latif, a highly respected former captain, told cricbuzz on Tuesday morning. Asked if Pakistan would participate in the tournament, he said it should. “I feel Pakistan should and will.” However, there was no official clarity on the topic until late in the evening yesterday. Previously cricbuzz had reported, quoting an SLC official, that Sri Lanka were prepared to host the championship if allotted by the ACC. The six-team Asia Cup, tentatively scheduled to start in the second week of September, is seen as a significant precursor to the World Cup in October-November. India, Pakistan, Bangladesh, Sri Lanka, Afghanistan and Nepal are to take part in the 17-game championship. Published on By Under 13 All Island Inter Schools Badminton Tournament 2023 conducted by Sri Lanka Schools Badminton Association with the support of Sri Chandananda Buddhist College Kandy will be held from June 10 to 12 at Municipal Indoor Stadium Kandy. The championship will see ten events for both girls and boys being conducted in five Divisions namely, A, B, C, D, and E. According to Sri Lanka Schools Badminton Association, hundred school teams have confirmed their participation in the event. Further details of the championship can be obtained from Malika Waduge (077-7494478), Secretary, Sri Lanka Schools Badminton Association. Published on By Australia and India will meet at the Oval on Wednesday (07) for the ICC World Test Championship 2023. The winners of the World Test Championship final will receive £1.29m in prize money and the losers £644,000.","pubDate":"2023-06-06 23:59:32","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs","link":"https://www.firstpost.com/firstcricket/sports-news/uae-vs-west-indies-2nd-odi-highlights-wi-win-by-78-runs-12700682.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs","content":"Cricket UAE vs West Indies, 2nd ODI Highlights: WI win by 78 runs West Indies defeated UAE by 78 runs on Tuesday to take an un assailable 2-0 lead in the ODI series. FirstCricket Staff June 7th, 2023 8:10:24 IST West Indies won the toss in the second ODI against UAE and opted to bat. Image: Twitter @windiescricket Match result: Brandon King and Jhonson Charles hit the fifties as West Indies were bowled out for 306. In reply, UAE were restricted to 228/7 with Ali Naseer scored 57. Preview: West Indies will look to seal the ODI series against the United Arab Emirates (UAE) when the two teams meet in the second game of the three-match series at the Sharjah Cricket Stadium on Tuesday. In the first match, the Windies rode on knocks from Brandon King (112) and Shamarh Brooks (44) to chase down 203 with seven wickets and 14.4 overs to spare. UAE had opted to bat in that contest, and barring Ali Naseer (58) and Vriitya Aravind (40), most of the other batters failed to convert starts. Keemo Paul (3/34) stood out among the wicket-takers to see off UAE for 202 in 47.1 overs. This series is vital for both teams, with both West Indies and UAE slated to take part in the ICC Cricket World Cup 2023 Qualifiers later in June. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: June 07, 2023 08:10:24 IST Tags: Uae Cricket Team West Indies Cricket Team Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-06-07 02:40:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/06/UAE-vs-WI-2nd-ODI-640_Twitter-@windiescricket.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"5 देशों के खिलाफ पहले ही टेस्‍ट में जड़ चुका शतक, फिर भी भारत की &#039;रेड बॉल&#039; टीम में नहीं मिल रही जगह","link":"https://hindi.news18.com/news/sports/cricket-unique-records-of-shikhar-dhawan-scored-hundred-in-his-first-test-against-five-different-countries-6438655.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत के शिखर धवन के नाम 5 देशों के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ने का अनोखा रिकॉर्ड दर्ज है. ओपनर शिखर धवन (Shikhar Dhawan) ने ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़कर यह कारनामा किया था. दुनिया का कोई बैटर 'गब्‍बर' के इस रिकॉर्ड के आस-पास नहीं है.","content":"शिखर धवन पांच देशों-ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ चुके हैं. (IPL) नई दिल्‍ली. वर्ल्‍ड टेस्‍ट चैंपियनशिप (WTC Final ) के फाइनल में रोहित शर्मा की भारतीय टीम (Team India) को आज यानी 7 जून से ऑस्‍ट्रेलिया का सामना करना है. टीम इंडिया ने हाल के वर्षों में अपने प्रदर्शन में बेहद सुधार किया है. एक समय था, जब उसे ‘घर का शेर’ कहा जाता था. माना जाता था कि टीम इंडिया स्पिन के लिए मददगार अपने घरेलू मैदानों पर ही जीत हासिल कर सकती है, लेकिन इस धारणा को बदलते हुए इसने विदेशी मैदान पर ही बड़ी-बड़ी टीमों को धूल चटाई है. इस शानदार प्रदर्शन के बीच भारत के एक बल्‍लेबाज के नाम पांच देशों के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़ने का अनोखा रिकॉर्ड दर्ज है. बाएं हाथ के ओपनर शिखर धवन (Shikhar Dhawan) ने ऑस्‍ट्रेलिया, न्‍यूजीलैंड, श्रीलंका, बांग्‍लादेश और अफगानिस्‍तान के खिलाफ अपने पहले ही टेस्‍ट में शतक जड़कर यह कारनामा किया था. दुनिया का कोई बैटर ‘गब्‍बर’ के इस रिकॉर्ड के आस-पास नहीं है. एलेस्टेयर कुक, मैथ्‍यू हेडन, कुमार संगकारा, ग्रीम स्मिथ और मार्क टेलर ऐसे बल्‍लेबाज हैं, जिन्‍होंने 4 टीमों के खिलाफ अपने पहले टेस्‍ट में सैकड़ा लगाया था. टेस्‍ट डेब्‍यू करते हुए ऑस्‍ट्रेलिया के खिलाफ जड़ा सैकड़ा धवन ने वर्ष 2013 में ऑस्‍ट्रेलिया के खिलाफ मोहाली में डेब्‍यू करते हुए अपने पहले ही टेस्‍ट में शतक (107 रन)लगाया था. फरवरी 2014 में न्‍यूजीलैंड, जून 2015 में बांग्‍लादेश,अगस्‍त 2015 में श्रीलंका और जून 2018 में अफगानिस्‍तान के खिलाफ भी वे अपने पहले टेस्‍ट में शतक जमा चुके हैं.धवन ने 34 टेस्‍ट मैचों में अब तक 40.61 के औसत से 2315 रन बनाए हैं जिसमें सात शतक और पांच अर्धशतक शामिल हैं. मजे की बात यह है कि उन्‍होंने अपना अंतिम टेस्‍ट सितंबर 2018 में उसी ओवल मैदान पर खेला था जहां वर्ल्‍ड टेस्‍ट चैंपियनिशप 2023 का फाइनल होना है. रोहित शर्मा की प्लेइंग-XI में 5 बल्लेबाज और 2 ऑलराउंडर, WTC Final में इन 11 खिलाड़ियों को मिल सकता है मौका 37 वर्ष में अभी भी बल्‍ले से कर रहे ‘धमाल’ 37 वर्ष के हो चुके शिखर धवन अभी भी बल्‍ले से जोरदार प्रदर्शन कर रहे हैं.आईपीएल-2023 में शानदार प्रदर्शन करने वाले धवन 2015 के वर्ल्‍डकप और 2017 की चैंपियंस ट्रॉफी में भारतीय की ओर से सबसे ज्‍यादा रन बनाने वाले बैटर रहे हैं. वनडे में वे सबसे तेज 1000, 2000 और तीन हजार रन पूरे करने वाले भारतीय बैटर रह चुके हैं.शिखर अभी भी इंटरनेशनल क्रिकेट में खेल रहे हैं. 167 वनडे में 6793 रन (औसत 44.11, 17 शतक) और 68 टी20I में 27.92 के औसत से 1759 रन वे बना चुके हैं. अपना आखिरी इंटरनेशनल मैच उन्‍होंने वनडे के रूप में बांग्‍लादेश के खिलाफ दिसंबर 2022 में चटगांव में खेला था. . Tags: Cricket , Shikhar dhawan , Team india , WTC Final पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट","pubDate":"2023-06-07 02:39:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shikhar-Dhawan-IPL-3-16843753803x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC 2023 Final, IND vs AUS: क्या दो स्पिनर्स के साथ उतरेगा भारत ? ऐसा बन रहा प्लेइंग XI का समीकरण","link":"https://sports.ndtv.com/hindi/cricket/wtc-2023-final-ind-vs-aus-prediction-squad-probable-xi-icc-world-test-championship-final-2023-4100561#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WTC 2023 Final, IND vs AUS: विश्व टेस्ट चैंपियनशिप के फाइनल में आज भारत का मुकाबला ऑस्ट्रेलिया के साथ शुरू होगा. इंग्लैंड के द ओवल में यह ऐतिहासिक टेस्ट मैच खेला जा रहा है. भारत के पास इतिहास रचने का मौका होगा. 10 साल से भारतीय टीम आईसीसी को कोई ट्रॉफी नहीं जीत पाई है. देखना होगा कि इस बार रोहित की कप्तानी में भारतीय टीम इतिहास रच पाती है या नहीं.","content":"WTC 2023 Final, IND vs AUS: भारतीय प्लेइंग इलेवन का ऐसा है समीकरण : विश्व टेस्ट चैंपियनशिप के फाइनल में आज भारत और ऑस्ट्रेलिया के बीच मुकाबला शुरू होगा.इस टेस्ट मैच को जीतकर कोई एक टीम टेस्ट क्रिकेट की बादशाहत हासिल करने में सफल रहेगी. इस टेस्ट मैच में भारत की प्लेइंग इलेवन क्या होगी, इसको लेकर अभी भी जिज्ञासा का विषय है. खासकर शार्दुल ठाकुर, अश्विन, उमेश यादव, जयदेव उनादकट , ऐसे खिलाड़ी हैं जिनको लेकर कन्फ्यूजन बना हुआ है. भारत की कौशल और जज्बे से भरी टीम बुधवार से जब यहां ऑस्ट्रेलिया की मजबूत टीम के खिलाफ विश्व टेस्ट चैंपियनशिप (WTC Final) फाइनल में उतरेगी तो उसकी नजरें आईसीसी (ICC) खिताब के एक दशक के सूखे को खत्म करने पर टिकी होंगी. WTC के पिछले दो चक्र में भारत सबसे निरंतर प्रदर्शन करने वाली टीम रहा है और पिछले 10 साल में सफेद गेंद के लगभग सभी बड़े टूर्नामेंट के नॉकआउट चरण में जगह बनाने में सफल रहा लेकिन इसके बावजूद खिताब नहीं जीत पाया. भारत ने पिछला आईसीसी खिताब 2013 में इंग्लैंड में चैंपियन्स ट्रॉफी के रूप में जीता था, इसके बाद भारत को तीन बार फाइनल में हार का सामना करना पड़ा जबकि टीम चार बार सेमीफाइनल में हारी। टीम 2021 टी20 विश्व कप के शुरुआती दौर से ही बाहर हो गई. भारतीय टीम स्वेदश में अजेय रही, इंग्लैंड में कड़ी सीरीज ड्रॉ कराई और बांग्लादेश में मुश्किल में घिरने के बावजूद जीत हासिल की. द ओवल में नतीजा कुछ भी हो लेकिन मुख्य कोच राहुल द्रविड़ का टीम के प्रति नजरिया नहीं बदलेगा. 'द ओवल' 143 साल के अपने इतिहास में पहली बार जून में टेस्ट मैच की मेजबानी कर रहा है. भारत रविचंद्रन अश्विन और रविंद्र जडेजा की स्पिन जोड़ी को खिलाने को लेकर उत्सुक होगा लेकिन इंग्लैंड में गर्मियों की शुरुआत है और तरोताजा पिचों पर चौथा तेज गेंदबाज बेहतर विकल्प हो सकता है. विकेटकीपर ऋषभ पंत की गैरमौजूदगी में भारतीय टीम प्रबंधन को फैसला करना होगा कि उसे इशान किशन के रूप में ‘एक्स फेक्टर' (मैच का रुख बदलने वाला खिलाड़ी) चाहिए या फिर केएस भरत के रूप में अधिक विश्वसनीय विकेटकीपर. रोहित ने प्रेस से बात करते हुए कहा था कि प्लेइंग इलेवन का आखिरी फैसला मैच के दिन ही परिस्थिति को देखकर दिया जाएगा. यदि पिच पर नमी रहेगी तो फिर शार्दुल खेल सकते हैं अगर मौसम साफ रहा तो यकीनन भारतीय टीम दो स्पिनर्स के साथ मैदान पर उतर सकती है. तेज गेंदबाजी विभाग में मोहम्मद शमी और मोहम्मद सिराज का खेलना तय है जबकि तीसरे विकल्प के रूप में अनुभवी उमेश यादव और ऑलराउंडर शारदुल ठाकुर चुनौती पेश कर रहे हैं. भारतीय बल्लेबाजों के लिए पैट कमिंस, मिशेल स्टार्क और स्कॉट बोलैंड जैसे तेज गेंदबाजों का सामना करना आसान नहीं होगा. इस मुकाबले को ‘अल्टीमेट टेस्ट' कहां जा रहा है और बेशक इस मैच में रोहित शर्मा और विराट कोहली जैसे अनुभवी खिलाड़ियों के अलावा शुभमन गिल जैसे उभरते हुए स्टार की परीक्षा होगी. चेतेश्वर पुजारा काउंटी क्रिकेट की अच्छी फॉर्म को इस मुकाबले में दोहराना चाहेंगे जबकि अजिंक्य रहाणे वापसी करते हुए अच्छा प्रदर्शन करने को बेताब होंगे. भारतीय टीम के विपरीत ऑस्ट्रेलियाई खिलाड़ियों को मैच फिट होने का अधिक मौका नहीं मिला है लेकिन वे इस मुकाबले में तरोताजा होकर उतरेंगे. टीम के सिर्फ तीन खिलाड़ी आईपीएल में खेले जबकि मार्नस लाबुशेन और स्टीव स्मिथ काउंटी टीमों का हिस्सा रहे.पैट कमिंस जैसे खिलाड़ियों ने स्वदेश में तैयारी करने का विकल्प चुना. मैच का नतीजा काफी हद तक इस पर निर्भर करेगा कि स्तरीय तेज गेंदबाजी के खिलाफ दोनों टीम का शीर्ष क्रम कैसा प्रदर्शन करता है। ऑस्ट्रेलिया को सलामी बल्लेबाज उस्मान ख्वाजा से काफी उम्मीदें हैं जबकि डेविड वार्नर अपने करियर के अंतिम चरण में अपनी छाप छोड़ना चाहेंगे. इस मैदान पर स्मिथ का औसत 100 का है और अगर भारत को मैच पर पकड़ बनानी है तो उन्हें जल्दी आउट करना होगा. पिच चाहे कैसा भी बर्ताव करे अनुभवी ऑफ स्पिनर नाथन लियोन विरोधी बल्लेबाजों को परेशान करने की क्षमता रखते हैं जबकि ऑलराउंडर के रूप में कैमरन ग्रीन की भूमिका भी महत्वपूर्ण होगी. डेविड वार्नर, उस्मान ख्वाजा, मारनस लाबुशेन, स्टीव स्मिथ, ट्रैविस हेड, कैमरन ग्रीन, एलेक्स केरी (wk), मिचेल स्टार्क, पैट कमिंस (c)स्कॉट बोलैंड, नाथन लियोन रोहित शर्मा (c), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, केएस भरत (wk), रविचंद्रन अश्विन/शार्दुल ठाकुर, उमेश यादव/जयदेव उनादकट, मोहम्मद शमी, मोहम्मद सिराज : पैट कमिंस (कप्तान), स्कॉट बोलैंड, एलेक्स कैरी, कैमरन ग्रीन, मार्कस हैरिस, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मार्नस लाबुशेन, नाथन लियोन, जोश इंग्लिस, टॉड मर्फी, स्टीव स्मिथ, मिशेल स्टार्क, डेविड वार्नर मिचेल मार्श और मैट रेनशॉ रोहित शर्मा (कप्तान), रविचंद्रन अश्विन, केएस भरत, शुभमन गिल, रविंद्र जडेजा, विराट कोहली, इशान किशन, चेतेश्वर पुजारा, अक्षर पटेल, अजिंक्य रहाणे, मोहम्मद शमी, मोहम्मद सिराज, शार्दुल ठाकुर, जयदेव उनादकट, और उमेश यादव यशस्वी जायसवाल, मुकेश कुमार और सूर्यकुमार यादव मैच भारतीय समयानुसार दोपहर तीन बजे से शुरू होगा * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-06-07 02:06:20","image_url":"https://c.ndtvimg.com/2023-06/fds0f5qo_rohit-ashwin_625x300_06_June_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final का रोमांचक मुकाबला फ्री में देखिए, जानें कहां, कब और कैसे देख सकते हैं भारत और ऑस्ट्रेलिया का मैच","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-live-streaming-when-and-where-to-watch-live-telecast-star-sports-doordarshan-live-streaming-disneyhotstar-app-ind-vs-aus-6438595.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India vs Auatralia WTC Final Live Streaming: भारत और ऑस्ट्रेलिया के बीच वर्ल्ड टेस्ट चैंपियनशिप का फाइनल आज से इंग्लैंड के द ओवल मैदान पर खेला जाना है. भारतीय टीम की कप्तानी रोहित शर्मा करेंगे, वहीं ऑस्ट्रेलियाई टीम की कमान पैट कमिंस संभाल रहे हैं. दोनों ही टीमों की नजर पहले डब्ल्यूटीसी खिताब पर है.","content":"India vs Auatralia WTC Final Live Streaming: फाइनल मुकाबला भारतीय समयानुसार दोपहर 3 बजे से शुरू होगा. (BCCI Twitter) नई दिल्ली. भारत और ऑस्ट्रेलिया के बीच वर्ल्ड टेस्ट चैंपिनयनशिप का फाइनल मुकाबला 7 जून बुधवार से शुरू होने जा रहा है. इंग्लैंड के द ओवल मैदान में यह रोमांचक मुकाबला खेला जाएगा. ऐसे में सभी फैंस यह चाहेंगे कि यह मैच वे कैसे, कब और कहां देख सकते हैं. तो आइए हम आपको बताते हैं कि आप इस मैच का लुत्फ फ्री में कैसे उठा सकते हैं. दोनों ही टीमों की नजर पहले वर्ल्ड टेस्ट चैंपियनशिप के टाइटल पर है. ऐसे में इस मुकाबले में कई रिकॉर्ड भी बनने वाले हैं. टीम इंडिया की कप्तानी रोहित शर्मा कर रहे हैं तो ऑस्ट्रेलिया टीम की कमान तेज गेंदबाज पैट कमिंस संभाल रहे हैं. टीम इंडिया मैच में मनोवैज्ञानिक बढ़त के साथ उतरेगी. उसने कंगारू टीम के खिलाफ अंतिम चारों टेस्ट सीरीज जीती हैं. इस दौरान भारत ने ऑस्ट्रेलिया को उसी के घर में 2 बार हराया है. रोहित शर्मा से लेकर विराट कोहली तक 10 साल के आईसीसी ट्रॉफी के सूखे को भी खत्म करना चाहेंगे. भारत और ऑस्ट्रेलिया के बीच WTC Final का मुकाबला कब खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final कहां खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final कितने बजे से खेला जाएगा? भारत और ऑस्ट्रेलिया के बीच WTC Final मैच का लाइव टेलीकास्ट कहां देखें? भारत और ऑस्ट्रेलिया के बीच आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल मैच की लाइव स्ट्रीमिंग कहां देखें? . Tags: Australia , India vs Australia , Team india , WTC Final धांसू है अनलिमिटेड बेनिफिट्स वाला ये प्रीपेड प्लान, 130 दिन के लिए रिचार्ज की टेंशन हो जाती है दूर, रोजाना का खर्च भी महज 5 रुपये पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज","pubDate":"2023-06-07 01:35:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-1-16859452793x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"रोहित शर्मा की प्लेइंग-XI में 5 बल्लेबाज और 2 ऑलराउंडर, WTC Final में इन 11 खिलाड़ियों को मिल सकता है मौका","link":"https://hindi.news18.com/photogallery/sports/cricket-wtc-final-2023-rohit-sharma-can-give-chance-to-5-batsmen-and-2-all-rounders-in-playing-xi-in-final-vs-australia-team-india-6438443.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"WTC Final Playing-11: टीम इंडिया आज से ऑस्ट्रेलिया के खिलाफ शुरू हो रहे वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में किन 11 खिलाड़ियों को मौका देती है, इस पर सभी की नजर है. इंग्लैंड के द ओवल मैदान की पिच को बाउंसी विकेट बताया जा रहा है. ऐसे में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 5 बल्लेबाजों के साथ 2 ऑलराउंडर्स को मौका दे सकते हैं.","content":"WTC Final Playing-11: टीम इंडिया आज से ऑस्ट्रेलिया के खिलाफ शुरू हो रहे वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में किन 11 खिलाड़ियों को मौका देती है, इस पर सभी की नजर है. इंग्लैंड के द ओवल मैदान की पिच को बाउंसी विकेट बताया जा रहा है. ऐसे में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 5 बल्लेबाजों के साथ 2 ऑलराउंडर्स को मौका दे सकते हैं. भारतीय ऑलराउंडर शार्दुल ठाकुर ने ऑस्ट्रेलिया के खिलाफ आज से ओवल में शुरू होने वाले वर्ल्ड टेस्ट चैंपियनशिप फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया. उनके इस बयान से साफ है कि टीम मैनेजमेंट की ओर से उन्हें फाइनल में मौका दिए जाने की बात कही गई हो, लेकिन कप्तान रोहित शर्मा ने कहा कि पिच हर दिन अपना मिजाज बदल रही है. ऐसे में प्लेइंग-11 पर फैसला मैच वाले दिन लिया जाएगा. तेज गेंदबाज और ऑलराउंडर शार्दुल ठाकुर ने करियर के 8 में से 3 टेस्ट मैच इंग्लैंड में ही खेले हैं. ऐसे में वे एक और बड़े मुकाबले के लिए तैयार हैं. (AP) ओवल की पिच को लेकर साफ है कि यहां तेज गेंदबाजों को बड़ी मदद मिलती है. पिच क्यूरेटर भी साफ कर चुके हैं कि फाइनल में बाउंसी विकेट देखने को मिलेगा. ऐसे में मैच में कप्तान रोहित शर्मा और कोच राहुल द्रविड़ 3 तेज गेंदबाजों को उतार सकते हैं. इसमें मोहम्मद शमी, मोहम्मद शमी और उमेश यादव हैं. हालांकि बाएं हाथ के तेज गेंदबाज जयदेव उनादकट को भी रेस से बाहर नहीं माना जा सकता. (BCCI Twitter) ऑलराउंडर्स की बात करें, तो रवींद्र जडेजा और शार्दुल ठाकुर को ऑस्ट्रेलिया के खिलाफ जगह दी जा सकती है. बतौर ऑलराउंडर शार्दुल ने ऑस्ट्रेलिया से लेकर इंग्लैंड तक में अच्छा प्रदर्शन किया है. जडेजा आईपीएल 2023 में कमाल करके आ रहे हैं. मैच में रोहित शर्मा के साथ शुभमन गिल ओपनिंग कर सकते हैं. नंबर-3 पर चेतेश्वर पुजारा, नंबर-4 पर विराट कोहली, नंबर-5 पर अजिंक्य रहाणे तो बतौर विकेटकीपर केएस भरत को मौका मिल सकता है. (BCCI Twitter) इस बीच टीम इंडिया के कोच राहुल द्रविड़ तैयारियों से खुश हैं. द्रविड़ ने ‘स्टार स्पोर्ट्स से कहा कि हमें कुछ अनुभवी खिलाड़ी मिले हैं. हमने पिछले 18 महीनों के दौरान कई युवा खिलाड़ियों को आजमाया हैं. हमें 3 अलग-अलग फॉर्मेट और भारतीय टीम के द्वारा अधिक संख्या में मैच खेलने के कारण ज्यादा खिलाड़ियों का इस्तेमाल करना पड़ा. (AFP) टीम इंडिया के पूर्व कप्तान राहुल द्रविड़ ने कहा कि हमारी क्रिकेट प्रणाली बहुत सारे खिलाड़ी आ रहे हैं और बाहर भी हो रहे हैं. यह वास्तव में रोमांचक रहा है और मेरे लिए भी सीखने का एक अच्छा अनुभव रहा है. उन्होंने कहा कि हां, यह बहुत मजेदार रहा है और मैंने इसका लुत्फ उठाया है. इस दौरान मुझे बहुत सारे खिलाड़ियों के साथ काम करने और एक बड़े समूह के साथ बेहतर रिश्ते बनाने का मौका मिला. (AP) भारतीय कोच राहुल द्रविड़ ने कहा कि इन 18 महीनों के दौरान मैंने एक व्यक्ति के रूप में अपने बारे में और कोचिंग के बारे में भी बहुत कुछ सीखा है. फाइनल के लिए संभावित भारतीय प्लेइंग-XI: रोहित शर्मा, शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, केएस भरत, शार्दुल ठाकुर, मोहम्मद शमी, उमेश यादव और मोहम्मद सिराज. (AP) पूजा ही नहीं सेहत के लिए भी करामाती है कपूर, एलर्जी जैसी 4 परेशानियां होंगी दूर, जान लें इसके और भी लाभ सबसे मोटी सैलरी लेने वाली 5 महिला CEO, सवा 3 करोड़ अमेरिकी डॉलर तक है पैकेज रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट भारतीय ऑलराउंडर शार्दुल ठाकुर ने ऑस्ट्रेलिया के खिलाफ आज से ओवल में शुरू होने वाले वर्ल्ड टेस्ट चैंपियनशिप फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया. उनके इस बयान से साफ है कि टीम मैनेजमेंट की ओर से उन्हें फाइनल में मौका दिए जाने की बात कही गई हो, लेकिन कप्तान रोहित शर्मा ने कहा कि पिच हर दिन अपना मिजाज बदल रही है. ऐसे में प्लेइंग-11 पर फैसला मैच वाले दिन लिया जाएगा. तेज गेंदबाज और ऑलराउंडर शार्दुल ठाकुर ने करियर के 8 में से 3 टेस्ट मैच इंग्लैंड में ही खेले हैं. ऐसे में वे एक और बड़े मुकाबले के लिए तैयार हैं. (AP)","pubDate":"2023-06-07 00:59:31","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-playing-11-16860990553x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final से पहले हड़कंप मचाने वाला बयान, मेरे जैसे खिलाड़ी को जिंदगी में 1 बार मिलता है ऐसा मौका!","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-all-rounder-shardul-thakur-calls-world-test-championship-final-against-australia-once-in-a-lifetime-moment-6438103.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल की ट्रॉफी किसकी होगी सबकी नजरें इस पर ही जमी है. भारतीय टीम ने लगातार दूसरी बार फाइनल में जगह बनाई है तो ऑस्ट्रेलिया की टीम पहली बार फाइनल खेलने उतरेगी.","content":"कप्तान रोहित शर्मा, शार्दुल ठाकुर और ईशान किशन-AP नई दिल्ली. भारतीय क्रिकेट टीम एक और बेहद रोमांचक आईसीसी इवेंट के फाइनल में उतरने के लिए तैयार है. वर्ल्ड टेस्ट चैंपियनशिप फाइनल की ट्रॉफी किसकी होगी सबकी नजरें इस पर ही जमी है. भारतीय टीम ने लगातार दूसरी बार फाइनल में जगह बनाई है तो ऑस्ट्रेलिया की टीम पहली बार फाइनल खेलने उतरेगी. भारतीय ऑलराउंडर शार्दुल ठाकुर में ऑस्ट्रेलिया के खिलाफ बुधवार से ओवल में शुरू होने वाले विश्व टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल को जिंदगी में एक बार मिलने वाला मौका करार दिया और कहा कि वह इसमें अपनी छाप छोड़ना चाहते हैं. अभी तक अपने आठ में से तीन टेस्ट मैच इंग्लैंड में खेलने वाले ठाकुर को अंतिम एकादश में जगह मिलेगी या नहीं यह अभी तक तय नहीं है लेकिन यह 31 वर्षीय खिलाड़ी अपनी तरफ से पूरी तरह तैयार है. ठाकुर ने आईसीसी से कहा, ‘‘ मेरा मानना है आईसीसी प्रतियोगिता विशेषकर फाइनल में खेलने का मौका हमेशा नहीं मिलता है इसलिए मुझ जैसे खिलाड़ी के लिए यह जिंदगी में एक बार मिलने वाला अवसर है. मैं यही चाहता हूं कि इसका पूरा फायदा उठाया जाए. वह हमेशा विशेष क्षण होता है जब आप अपने देश का प्रतिनिधित्व करते हैं विशेषकर भारत का जहां करोड़ों लोग देश की तरफ से खेलने का सपना देखते हैं और केवल सर्वश्रेष्ठ 15 को ही देश का प्रतिनिधित्व करने के लिए चुना जाता है.’’ WTC फाइनल के लिए भारतीय टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, रवींद्र जडेजा, रविचंद्रन अश्विन, अक्षर पटेल, केएस भरत (विकेटकीपर), शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, जयदेव उनादकट, उमेश यादव, ईशान किशन (विकेटकीपर). स्टैंडबाय खिलाड़ी: यशस्वी जायसवाल, मुकेश कुमार, सूर्यकुमार यादव. WTC फाइनल के लिए ऑस्ट्रेलिया की टीम: पैट कमिंस (कप्तान), स्कॉट बोलैंड, एलेक्स केरी (विकेटकीपर), कैमरन ग्रीन, मार्कस हैरिस, ट्रैविस हेड, जोश इंगलिस (विकेटकीपर), उस्मान ख्वाजा, मार्नस लाबुशेन, नाथन लायन, टॉड मर्फी, माइकल नेसर, स्टीव स्मिथ (उप-कप्तान), मिचेल स्टार्क, डेविड वॉर्नर स्टैंडबाय खिलाड़ी: मिचेल मार्श, मैथ्यू रेनशॉ. . Tags: India vs Australia , Shardul thakur , WTC Final रुक नहीं रहा है बालों का टूटना-झड़ना, 6 चीजों को करें डाइट में शामिल, दो दिन में मिलेगा बेस्ट रिजल्ट जहां पढ़े विवेकानंद और सुभाष चंद्र बोस उस कॉलेज को मिला 100वां स्‍थान काजोल नहीं, शाहरुख की दोस्त थीं मेकर्स की पहली पसंद, 1995 में बनी इस फिल्म ने तोड़ दिए थे कमाई के कई रिकॉर्ड","pubDate":"2023-06-07 00:45:23","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-with-ishan-kishan-and-shardul-thakur-16860774313x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"टीम इंडिया के चैंपियन पर फैसला! रोहित शर्मा ने इंतजार करने कहा, सभी 15 खिलाड़ियों को तैयार रहने का निर्देश","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-2023-rohit-sharma-reply-on-r-ashwin-we-have-to-wait-all-15-players-are-told-to-be-ready-for-match-agaist-australia-6437921.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और ऑस्ट्रेलिया के बीच होने वाले मुकाबले से जुड़ी हर एक जानकारी लोग जानने को उत्सुक हैं. मैच से पहले टीम इंडिया के कप्तान रोहित शर्मा ने मीडिया से बात की. टीम कॉम्बिनेशन और प्लेइंग इलेवन के सवाल पर उन्होंने कुछ नहीं कहा साथ ही आर अश्विन मैच खेलेंगे या नहीं इसको भी अपने तरीके से टाल गए.","content":"भारतीय टीम के कोच राहुल द्रविड़ कप्तान रोहित शर्मा और बल्लेबाजी कोच विक्रम राठौर के साथ -AP नई दिल्ली. आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लेकर फैंस में गजब का रोमांच है. भारत और ऑस्ट्रेलिया के बीच होने वाले मुकाबले से जुड़ी हर एक जानकारी लोग जानने को उत्सुक हैं. मैच से पहले टीम इंडिया के कप्तान रोहित शर्मा ने मीडिया से बात की. टीम कॉम्बिनेशन और प्लेइंग इलेवन के सवाल पर उन्होंने कुछ नहीं कहा साथ ही आर अश्विन मैच खेलेंगे या नहीं इसको भी अपने तरीके से टाल गए. रोहित से पूछा गया कि क्या अश्विन को बाहर करना मुश्किल फैसला होगा, उन्होंने कहा,‘‘ मैंने यह तो नहीं कहा कि अश्विन नहीं खेलेंगे. हमें कल तक इंतजार करना होगा क्योंकि एक चीज मैंने देखी है कि पिच वास्तव में दिन प्रतिदिन बदलती जा रही है.’’ भारतीय कप्तान ने कहा,‘‘ पिच आज जैसी है हो सकता है कि कल वह उससे भिन्न हो. इसलिए सभी 15 खिलाड़ियों के लिए स्पष्ट संदेश है कि सभी को खेलने के लिए तैयार रहना चाहिए.’’ पिच में अभी घास दिख रही है और अगर सुबह बादल छाए रहते हैं तो अतिरिक्त तेज गेंदबाज के साथ उतरना फायदेमंद हो सकता है। रोहित ने कहा,‘‘ मैंने कल पिच देखी थी, आज मुझे इसका मौका नहीं मिला लेकिन निश्चित तौर पर लग रहा है कि उससे तेज गेंदबाजों को थोड़ा मदद मिलेगी। बादल छाए रहने पर तेज गेंदबाज थोड़ा प्रभावी साबित हो सकते हैं।’’ ओवल में पहला टेस्ट मैच 1880 में खेला गया था लेकिन यह पहला अवसर है जबकि वह जून के महीने में टेस्ट मैच की मेजबानी करेगा। रोहित हालांकि इस आंकड़े को गंभीरता से नहीं लेते हैं। उन्होंने कहा,‘‘ हम सुन रहे हैं यहां जून में बहुत अधिक क्रिकेट नहीं खेली जाती है। काउंटी के मैच यहां खेले गए हैं। हमने देखा था कि दो सप्ताह पहले यहां मैच खेला गया था। ऐसा नहीं है कि इस मैदान पर यह इस सत्र का पहला मैच होगा। हम इससे अच्छी तरह वाकिफ हैं कि परिस्थितियां कैसी हैं और अगले पांच दिन में क्या होने वाला है।’’ . Tags: R ashwin , Rohit sharma , WTC Final शरीर के हर अंग को तंदुरुस्त करती हैं ये 5 सब्जियां, मेटाबोलिज्म और इम्यूनिटी दोनों होता है मजबूत, बीमारियां रहती हैं दूर WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट","pubDate":"2023-06-07 00:36:45","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/Rahul-with-rohit-and-vikram-3-16860750663x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final 2023: वो 5 कारण जो भारत को बना सकते हैं वर्ल्ड चैंपियन, मैच से पहले ही पिछड़ा ऑस्ट्रेलिया","link":"https://hindi.news18.com/news/sports/cricket-india-may-become-wtc-champion-predicts-former-coach-lalchand-rajput-shubman-gill-pujara-kohli-shami-siraj-6437805.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम का द ओवल में होने वाले डब्ल्यूटीसी फाइनल में अपर हैंड है. ऑस्ट्रेलिया के खिलाफ भारतीय टीम का पलड़ा भारी रहने की उम्मीद है. वैसे तो इसके कई कारण हैं, लेकिन सबसे पहले तो मैं यही कहूंगा कि हम लगातार दूसरी बार फाइनल में पहुंचे हैं. पिछली बार न्यूजीलैंड से हम हार गए थे. लेकिन अब हम मानसिक तौर पर अच्छी तरह तैयार हैं. मैं यहां ऐसे 5 कारण बताऊंगा जो भारत को जीत का दावेदार बनाते हैं.","content":"टीम इंडिया का फाइनल में पलड़ा भारी है. (AP) भारतीय क्रिकेट टीम एक और विश्व खिताब की दहलीज पर है. आज (7 जून) से शुरू हो रही आईसीसी वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में यूं तो कांटे के मुकाबले की उम्मीद जताई जा रही है. लेकिन मुझे लगता है कि भारतीय टीम का द ओवल में होने वाले डब्ल्यूटीसी फाइनल में अपर हैंड है. ऑस्ट्रेलिया के खिलाफ भारतीय टीम का पलड़ा भारी रहने की उम्मीद है. वैसे तो इसके कई कारण हैं, लेकिन सबसे पहले तो मैं यही कहूंगा कि हम लगातार दूसरी बार फाइनल में पहुंचे हैं. पिछली बार न्यूजीलैंड से हम हार गए थे. लेकिन अब हम मानसिक तौर पर अच्छी तरह तैयार हैं. मैं यहां ऐसे 5 कारण बताऊंगा जो भारत को जीत का दावेदार बनाते हैं. 1. शुभमन गिल की सुप्रीम फॉर्म भारत और ऑस्ट्रेलिया दोनों ही टीमों को देखें तो आप पाएंगे कि यदि कोई बैटर पिछले एक साल से अपने सुप्रीम फॉर्म में है, तो वह शुभमन गिल हैं. चाहे वह टेस्ट क्रिकेट हो या वनडे और या फिर टी20 मैच. इस युवा खिलाड़ी ने हर फॉर्मेट में अपनी छाप छोड़ी है. निरंतरता दिखाई है. ऑस्ट्रेलिया उन्हें खतरा मानकर चल रहा होगा. जहां तक भारतीय टीम की बात है तो शुभमन ओपनर हैं. जब ओपनर अच्छी स्टार्ट देते हैं तो टीम बड़ा स्कोर बनाती है. भारतीय टीम उम्मीद करेगी कि शुभमन की यह फॉर्म डब्ल्यूटीसी फाइनल में भी बरकरार रहेगी. 2. विराट कोहली की वापसी विराट कोहली का फॉर्म में लौटना वह दूसरा कारण है, जो भारत की उम्मीदें जगाता है. विराट ने आईपीएल में जमकर रन बनाए. लेकिन यह आईपीएल की बात नहीं है. विराट 2023 में उसी निरंतरता का प्रदर्शन कर रहे हैं, जो उन्होंने अपने करियर के शुरुआती 10 साल में किए. उन्होंने पिछले छह महीने में वनडे, टेस्ट और टी20 मुकाबलों में सेंचुरी बनाई है. विराट कोहली बड़े मैचों के खिलाड़ी रहे हैं. टी20 वर्ल्ड कप में पाकिस्तान के खिलाफ खेली गई पारी अब भी क्रिकेटप्रेमियों की जेहन में होगी. कोई शक नहीं उनका फॉर्म में लौटना टीम को हौसला दे रहा होगा. 3. मोहम्मद शमी की लय मोहम्मद शमी पूरे लय में हैं. आईपीएल 2023 में पर्पल कैप जीतने वाले इस खिलाड़ी की ताकत ही टेस्ट क्रिकेट है. शमी वो बॉलर हैं, जो पहले बैटर को सेट करते हैं और फिर उसका शिकार करते हैं. यह खिलाड़ी लाल गेंद से और भी खतरनाक हो जाता है. इस पर इंग्लैंड की स्विंग को मदद करने वाली परिस्थितियां इस गेंदबाज के लिए सोने पर सुहागा वाला काम करेंगी. 4. सिराज बनाते हैं हंटिंग पेयर मोहम्मद शमी के साथ-साथ मोहम्मद सिराज भी बेहतरीन लय में हैं. उन्होंने आईपीएल 2023 में 14 मैच में 23 विकेट लिए. शमी की तरह सिराज को भी लाल गेंद ज्यादा भाती है. जब आप विकेट लेते हैं तो हौसला बढ़ता है. पिछला प्रदर्शन आगे भी काम आता है. आप ज्यादा विश्वास के साथ बॉलिंग करते हैं. मोहम्मद सिराज के साथ भी यही स्थिति है. मोहम्मद सिराज अपने सीनियर साथी मोहम्मद शमी के साथ हंटिंग पेयर बनाते हैं, जो ऑस्ट्रेलिया का पसीना छुड़ाने वाली साबित होगी. 5. पुजारा बना रहे लगातार रन राहुल द्रविड़ के बाद यदि किसी बैटर ने विकेट पर लंबे समय तक टिकने का माद्दा दिखाया है तो वह चेतेश्वर पुजारा हैं. जब वे सेट होते हैं तो जल्दी आउट नहीं होते. लंबी पारी खेलते हैं. दिनभर खूंटा गाड़कर विरोधी का हौसला तोड़ देते हैं. भारतीय टीम पुजारा से यही उम्मीद भी कर रही होगी. इसकी वजह भी है. पुजारा तकरीबन 2 महीने से इंग्लैंड में हैं. उन्होंने इस दौरान काउंटी क्रिकेट में खूब रन बरसाए हैं. उनकी फॉर्म भारत को ताकत देने वाली साबित होगी. हमें यह भी नहीं भूलना चाहिए कि भारतीय टीम के मौजूदा कप्तान रोहित शर्मा का इंग्लैंड में शानदार प्रदर्शन रहा है. उन्होंने इंग्लैंड में खेल गए 2019 के वर्ल्ड कप में 5 शतक लगाए थे. अजिंक्य रहाणे तो विदेश में प्रदर्शन करने के लिए ही जाने जाते हैं. रवींद्र जडेजा इस समय दुनिया के सबसे बेहतरीन ऑलराउंडरों में शुमार हैं. वे ना सिर्फ स्पेशलिस्ट बैटर की तरह प्रदर्शन करते हैं, बल्कि विकेट से थोड़ी भी मदद मिलने पर विरोधी टीम की खटिया खड़ी कर देते हैं. रविचंद्रन अश्विन भी कम नहीं. तीन टेस्ट शतक लगा चुका यह खिलाड़ी जब गेंद से रंग दिखाता है तो अकेले ही विरोधी टीम को समेट देता है. ऑस्ट्रेलिया को इसका पूरा अनुभव भी है. दूसरी ओर, ऑस्ट्रेलिया अपनी जिस बड़ी ताकत पर इतराता है, वह फाइनल मुकाबले से ठीक पहले थोड़ी कुंद हो गई है. वह ताकत है पेस अटैक की, जो जोश हेजलवुड के चोटिल होने से कमजोर हुई है. कोई शक नहीं कि भारतीय बैटर इस मौके का पूरा फायदा उठाएंगे. कुल मिलाकर भारत की इस टीम में विश्व चैंपियन बनने का पूरा माद्दा है. उम्मीद है ये खिलाड़ी अपनी क्षमता को मैदान पर पुरजोर तरीके से उतारेंगे और भारत को विश्व चैंपियन बनाएंगे. . Tags: India vs Australia , Lalchand Rajput , Shubman gill , Team india , WTC Final शरीर के हर अंग को तंदुरुस्त करती हैं ये 5 सब्जियां, मेटाबोलिज्म और इम्यूनिटी दोनों होता है मजबूत, बीमारियां रहती हैं दूर WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट","pubDate":"2023-06-07 00:17:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/team-india-practice-rohit-with-virat-and-rahul-16860429983x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार","link":"https://hindi.news18.com/photogallery/sports/cricket-wtc-final-2023-rohit-sharma-has-won-8-titles-including-5-ipl-as-captain-team-india-ind-vs-aus-6438395.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Rohit Sharma Captaincy Record: रोहित शर्मा की कप्तानी में टीम इंडिया बड़े इम्तिहान के लिए तैयार है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल शुरू होने जा रहा है. रोहित ने बताैर कप्तान कई रिकॉर्ड बनाए हैं, लेकिन वे अब तक आईसीसी ट्रॉफी नहीं जीत सके हैं. भारतीय टीम भी 2013 के बाद से आईसीसी का कोई टाइटल अपने नाम नहीं कर सकी है.","content":"Rohit Sharma Captaincy Record: रोहित शर्मा की कप्तानी में टीम इंडिया बड़े इम्तिहान के लिए तैयार है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल शुरू होने जा रहा है. रोहित ने बताैर कप्तान कई रिकॉर्ड बनाए हैं, लेकिन वे अब तक आईसीसी ट्रॉफी नहीं जीत सके हैं. भारतीय टीम भी 2013 के बाद से आईसीसी का कोई टाइटल अपने नाम नहीं कर सकी है. रोहित शर्मा की कप्तानी में टीम इंडिया आज से इतिहास रचने उतर रही है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेला जाना है. दोनों ही टीमों की नजर टेस्ट के वर्ल्ड कप पर पहली बार कब्जा करने की है. जो भी टीम यह मुकाबला जीतेगी, इतिहास बना देगी. वह वनडे वर्ल्ड कप, टी20 वर्ल्ड कप और चैंपियंस ट्रॉफी के बाद आईसीसी के चौथे टूर्नामेंट पर कब्जा करने वाली पहली टीम बन जाएगी. (AP) रोहित शर्मा की नजर बतौर कप्तान अपने पहले आईसीसी टाइटल पर है. भारतीय टीम भी 2013 से कोई भी आईसीसी ट्रॉफी नहीं जीत सकी है. बतौर कप्तान रोहित का रिकॉर्ड अच्छा रहा है. वे अब तक 8 खिताब जीत चुके हैं. इसमें 5 आईपीएल के टाइटल, एक चैंपियंस लीग टी20, एक एशिया कप और एक निदहास ट्रॉफी का शामिल है. लेकिन उन्होंने अंतिम टाइटल 3 साल पहले 2020 में जीता था. इस दाैरान वे बल्ले से और खूंखार हो गए हैं. पिछले साल टी20 वर्ल्ड कप में रोहित की कप्तानी में टीम इंडिया सेमीफाइनल से आगे नहीं बढ़ सकी थी. (BCCI Twitter) भारत और ऑस्ट्रेलिया के बीच फाइनल ओवल में खेला जाना है. यहां रोहित शर्मा ने 2021 में एकमात्र टेस्ट खेला था और इस दौरान उन्होंने 127 रन की बेहतरीन पारी खेली थी. ऐसे में वे अपने इस प्रदर्शन को बरकरार रखना चाहेंगे. इंग्लैंड में रोहित के टेस्ट के प्रदर्शन को देखें, तो वे 6 मैच की 12 पारियों में 42 की औसत से 466 रन बना चुके हैं. इसमें एक शतक और 2 अर्धशतक शामिल है. वहीं विराट कोहली इंग्लैंड में टेस्ट में 2 शतक ठोक चुके हैं. (AP) टीम इंडिया ने ऑस्ट्रेलिया के खिलाफ अंतिम चारों टेस्ट सीरीज पर कब्जा किया है. ऐसे में उसके हौसले बुलंद हैं. इस दौरान उसने कंगारू टीम को उसी के घर में 2 बार मात दी है. हालांकि जसप्रीत बुमराह, ऋषभ पंत, श्रेयस अय्यर और केएल राहुल के नहीं होने से टीम का बैलेंस जरूर बिगड़ा है. लेकिन अनुभवी खिलाड़ी अजिंक्य रहाणे की वापसी से टीम का मनोबल भी बढ़ा है. आईपीएल 2023 में रहाणे ने बेहतरीन प्रदर्शन किया और सीएसके को चैंपियन भी बनाया. (AP) रोहित शर्मा के कप्तानी के रिकॉर्ड की बात करें, तो उन्होंने अब तक 6 टेस्ट मैच में टीम इंडिया की अगुआई की है. 4 में टीम को जीत मिली है, जबकि एक में हार. एक मुकाबला ड्रॉ रहा. इंटरनेशनल क्रिकेट के तीनों फॉर्मेट को देखें, तो रोहित शर्मा 83 मैच में टीम इंडिया की कप्तानी संभाल चुके हैं. 62 में जीत मिली है जबकि 20 में हार. यानी उनका कप्तानी का रिकॉर्ड भी अच्छा है. (AP) इस बीच दिग्गज बल्लेबाज सचिन तेंदुलकर ने ओवल की पिच टीम इंडिया के अनुकूल बताया और कहा की पिच को देखते हुए भारत फायदे में दिखता है. उन्होंने कहा कि भारतीय टीम खुश होगी कि वह ओवल में खेलने जा रही है. ओवल की पिच का नेचर इस तरह से है कि वह मैच आगे बढ़ने के साथ स्पिनरों को मदद पहुंचाती है. इसलिए स्पिनरों की भूमिका अहम होगी. (BCCI Twitter) तेंदुलकर ने 100 एमबीस्पोर्ट्स से कहा कि इसके लिए जरूरी नहीं है कि हमेशा टर्निंग विकेट की ही जरूरत पड़े. कभी-कभी स्पिनर पिच से मिल रही उछाल का भी फायदा उठाते हैं. उन्हें बादल छाए रहने की परिस्थितियों में भी पिच से मदद मिल सकती है और काफी कुछ गेंद के चमकदार हिस्से पर निर्भर करता है. इन सब कारणों से ओवल भारत के लिए अच्छा स्थान है.(AFP) भारत ने इंग्लैंड के खिलाफ 2021 में ओवल में 157 रन से जीत दर्ज की थी और सचिन तेंदुलकर ने कहा कि उसमें से जुड़ी अच्छी यादें भारत के काम आएंगी. उन्होंने कहा कि निश्चित तौर पर, जब आपके पास इस तरह की अच्छी यादें हों, तो वे आपके साथ बनी रहती हैं. भारतीय टीम को यह नहीं भूलना चाहिए कि पिछली बार उसने यहां शानदार परिणाम हासिल किया था. (AFP) WTC Final: रोहित शर्मा बतौर कप्तान जीत चुके हैं 8 खिताब, 3 साल के इंतजार ने बनाया और खूंखार 36 साल की इस एक्ट्रेस ने 'आदिपुरुष' को बताया मास्टरपीस, इमरान हाशमी संग किया था डेब्यू, साउथ में हैं फेवरेट Most Popular IAS : ये IAS अधिकारी हैं सोशल मीडिया सेलिब्रिटी, इंस्टाग्राम पर हैं लाखों फॉलोवर रोहित शर्मा की कप्तानी में टीम इंडिया आज से इतिहास रचने उतर रही है. भारत और ऑस्ट्रेलिया के बीच इंग्लैंड के द ओवल मैदान में वर्ल्ड टेस्ट चैंपियनशिप का फाइनल खेला जाना है. दोनों ही टीमों की नजर टेस्ट के वर्ल्ड कप पर पहली बार कब्जा करने की है. जो भी टीम यह मुकाबला जीतेगी, इतिहास बना देगी. वह वनडे वर्ल्ड कप, टी20 वर्ल्ड कप और चैंपियंस ट्रॉफी के बाद आईसीसी के चौथे टूर्नामेंट पर कब्जा करने वाली पहली टीम बन जाएगी. (AP)","pubDate":"2023-06-07 00:09:00","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-3-16860957443x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka confident World Cup qualifiers will go well","link":"http://island.lk/sri-lanka-confident-world-cup-qualifiers-will-go-well/","keywords":["Sports","Angelo Mathews","Featured","Sri Lanka Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Rex Clementine at Suriyawewa Having failed to qualify automatically for the World Cup later this year, Sri Lanka will be flying shortly to Zimbabwe to secure one of the two remaining slots for the sport’s showpiece event. But before that they have got to finish off the ODI series against Afghanistan and the former champions […]","content":"Having failed to qualify automatically for the World Cup later this year, Sri Lanka will be flying shortly to Zimbabwe to secure one of the two remaining slots for the sport’s showpiece event. But before that they have got to finish off the ODI series against Afghanistan and the former champions will be hoping that they will be able to clinch the series prior to flying off to Harare. After losing the first ODI by six wickets, Sri Lanka bounced back to square the series with a 132-run win on Sunday. That was a match where they basically produced the perfect game and ticked all the boxes. The top order gave a solid start before the middle order capitalized on it and the lower middle order finished things off in style scoring 109 runs from the last ten overs. Sri Lanka piled up 323 for six and Afghanistan were never in the hunt as they were shot out for 191. “The last game was a perfect exhibition of our plans. Everything was executed well. Since we had wickets in hand we could take risks. We could double the score and that was the plan. That’s what we want to do,” Sri Lanka’s Batting Coach Naveed Nawaz told journalists. Prior to this series, we had a free period and we worked a lot on players’ fitness at the High-Performance Center. During this series we brought in a dietician and planned our food patterns. There is also a psychologist around. This is all done in a bid to establish whatever we have lost in the last few years,” Nawaz added. While Sri Lanka are fretting over World Cup qualifications, there’s no such trouble for Afghanistan. Their captain Hashmatullah Shahidi told journalists that they will be one of the dark horses during the World Cup. “Our ratings are improving day by day and match by match. We believe that we can do something special in this World Cup. We will be one of the best teams in the World Cup. We are the dark horses. The Asian conditions will suit our spin bowlers and we are excited,” Hashmatullah Shahidi said. For today’s series decider leg-spinner Rashid Khan is expected to make a comeback having missed the first two ODIs due to a back injury. “He is obviously our star performer. We didn’t want to take any risks with him as we have the Asia Cup and the World Cup. We will assess his situation during training and make a call whether he is ready to feature in the final game. It will mean a lot to us to come here to Sri Lanka and beat them in their own backyard,” the Afghan captain said. Published on By Have Sri Lanka, Afghanistan and Bangladesh formally rejected the hybrid model proposed by Pakistan Cricket Board (PCB) for the Asia Cup? That seems to be the latest on the imbroglio that has led to prolonged uncertainty over staging of the six-national continental championship. Sri Lanka is set to be the host. According to the news coming in from Pakistan, Sri Lanka Cricket (SLC), Bangladesh Cricket Board (BCB) and Afghanistan Cricket Board (ACB) have written to the Asian Cricket Council (ACC) formally rejecting the host PCB’s formula of conducting four games in Pakistan and rest of the matches in the UAE, thereby upholding the position of the BCCI which has been opposed to the model. The development was revealed by Rashid Latif. “India and 3 countries, except Pakistan, rejected Hybrid model for Asia cup, All agreed on one venue due to logistics and financial issues. Might be a Zoom meeting soon or a general meeting in Dubai in a few days to finalise the matter (Sic),” the former Pakistan captain said in a Twitter post. When contacted by Cricbuzz, Latif confirmed the news and also guaranteed the authenticity of this update. “I have information from independent sources that four countries have rejected the model and it is now a formality that the Asia Cup will be moved out of Pakistan,” Latif, a highly respected former captain, told cricbuzz on Tuesday morning. Asked if Pakistan would participate in the tournament, he said it should. “I feel Pakistan should and will.” However, there was no official clarity on the topic until late in the evening yesterday. Previously cricbuzz had reported, quoting an SLC official, that Sri Lanka were prepared to host the championship if allotted by the ACC. The six-team Asia Cup, tentatively scheduled to start in the second week of September, is seen as a significant precursor to the World Cup in October-November. India, Pakistan, Bangladesh, Sri Lanka, Afghanistan and Nepal are to take part in the 17-game championship. Published on By Under 13 All Island Inter Schools Badminton Tournament 2023 conducted by Sri Lanka Schools Badminton Association with the support of Sri Chandananda Buddhist College Kandy will be held from June 10 to 12 at Municipal Indoor Stadium Kandy. The championship will see ten events for both girls and boys being conducted in five Divisions namely, A, B, C, D, and E. According to Sri Lanka Schools Badminton Association, hundred school teams have confirmed their participation in the event. Further details of the championship can be obtained from Malika Waduge (077-7494478), Secretary, Sri Lanka Schools Badminton Association. Published on By Australia and India will meet at the Oval on Wednesday (07) for the ICC World Test Championship 2023. The winners of the World Test Championship final will receive £1.29m in prize money and the losers £644,000.","pubDate":"2023-06-06 23:59:32","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"}]}