{"newsArray":[{"article_id":"073095cacd5777def433003a7d7882a3","title":"Rohit Sharma Looks At Ashwin As A Match-Winner: Saba Karim","link":"https://news.abplive.com/sports/cricket/rohit-sharma-looks-at-ashwin-as-a-match-winner-saba-karim-1630710","keywords":["Cricket"],"creator":["IANS"],"video_url":null,"description":"New Delhi, Sep 19 (IANS) Former cricketer Saba Karim weighed in on Ravichandran Ashwin’s return to India’s ODI squad. “I think Rohit Sharma looks at Ravichandran Ashwin as a match-winner and he’s very clear in the kind of approach he wants to portray in white ball cricket. Now with the World Cup coming up, he understands the dynamics of one-day cricket quite well and knows that he has to pick players who have that kind of an attacking mindset,” Karim told JioCinema. “He also knows that in his bowling lineup, he needs to have out of six, at least five wicket-taking options and if he has Ashwin in the eleven, then that attacking option is available. If you look at all the other players who are in the reserve – they all have that attacking mindset. So, I think Rohit Sharma wants to continue with this aggressive approach that we saw the Indian team play in the Asian challenge.” Karim further spoke about Shreyas Iyer's selection in the squad as well. “I am glad that they are persisting with Shreyas Iyer. It really shows that the team management and selectors trust him so much. And Shreyas has played a very vital role in the one-day setup. So, I am happy to see that they are backing him right till they announce the World Cup side. “I don’t think there should be any issue with him being part of the side if he's fit, even if he does not score runs in these two or three games – it does not matter. You need to back players who have done well for you in the past and they in any case get three ODI games here plus the two practice matches. The kind of player Shreyas Iyer is – I am pretty excited for him to get back into the fold and score runs at the right time for the Indian side.” (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)","content":"New Delhi, Sep 19 (IANS) Former cricketer Saba Karim weighed in on Ravichandran Ashwin’s return to India’s ODI squad. “I think Rohit Sharma looks at Ravichandran Ashwin as a match-winner and he’s very clear in the kind of approach he wants to portray in white ball cricket. Now with the World Cup coming up, he understands the dynamics of one-day cricket quite well and knows that he has to pick players who have that kind of an attacking mindset,” Karim told JioCinema. “He also knows that in his bowling lineup, he needs to have out of six, at least five wicket-taking options and if he has Ashwin in the eleven, then that attacking option is available. If you look at all the other players who are in the reserve – they all have that attacking mindset. So, I think Rohit Sharma wants to continue with this aggressive approach that we saw the Indian team play in the Asian challenge.” Karim further spoke about Shreyas Iyer's selection in the squad as well. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); “I am glad that they are persisting with Shreyas Iyer. It really shows that the team management and selectors trust him so much. And Shreyas has played a very vital role in the one-day setup. So, I am happy to see that they are backing him right till they announce the World Cup side. “I don’t think there should be any issue with him being part of the side if he's fit, even if he does not score runs in these two or three games – it does not matter. You need to back players who have done well for you in the past and they in any case get three ODI games here plus the two practice matches. The kind of player Shreyas Iyer is – I am pretty excited for him to get back into the fold and score runs at the right time for the Indian side.” (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)","pubDate":"2023-09-20 01:56:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/20/edfc4f237a7b810763afa484dd1b85521695174880439567_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0d338b7d35627be4291c7f3db75892b4","title":"युजवेंद्र चहल की टीम इंडिया में लड़ाई हुई है, किसी से कुछ बोल दिया है....हरभजन सिंह ने टीम से बाहर रखने पर जताया शक","link":"https://hindi.news18.com/cricket/harbhajan-singh-wants-spinner-yuzvendra-chahal-to-be-in-world-cup-squad-if-axar-patel-no-available-7610619.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"हरभजन सिंह ने अपने यू ट्यूब चैनल पर कहा, \"युजवेंद्र चहल को इस टीम का हिस्सा होना चाहिए था. उनको तो मौका भी नहीं दिया गया है. यह बात तो मेरी समझ से बिल्कुल परे है. या तो उन्होंने किसी से लड़ाई की है या नहीं तो किसी ना किसी से कुछ बुरा बोला है, अब मुझे तो नहीं पता कि क्या हुआ है.","content":"युजवेंद्र चहल को ऑस्ट्रेलिया के खिलाफ वर्ल्ड कप के बाद ऑस्ट्रेलिया सीरीज से भी बाहर रखा गया है. (PIC: AFP) नई दिल्ली. भारतीय क्रिकेट टीम के पूर्व स्पिनर हरभजन सिंह ने वर्ल्ड कप से पहले ऑस्ट्रेलिया के खिलाफ खेली जाने वाली सीरीज के लिए चुनी गई टीम पर सवाल उठाया है. चयनकर्ताओं ने 37 साल के स्पिनर आर अश्विन को अचानक से वनडे टीम में चुना जबकि टीम के साथ बने हुए युजवेंद्र चहल को मौका नहीं दिया. भज्जी का मानना है कि पहले चहल को मौका मिलना चाहिए था. हरभजन सिंह ने अपने यू ट्यूब चैनल पर कहा, “युजवेंद्र चहल को इस टीम का हिस्सा होना चाहिए था. उनको तो मौका भी नहीं दिया गया है. यह बात तो मेरी समझ से बिल्कुल परे है. या तो उन्होंने किसी से लड़ाई की है या नहीं तो किसी ना किसी से कुछ बुरा बोला है, अब मुझे तो नहीं पता कि क्या हुआ है. अगर जो हम सिर्फ और सिर्फ कला को लेकर बात करते हैं तो उनका नाम उस जगह पर होना ही चाहिए था. ऐसा इसलिए भी है क्योंकि काफी सारे भारतीय खिलाड़ियों को आराम दिया गया है.” आगे उन्होंने कहा, ऑस्ट्रेलिया की टीम साउथ अफ्रीका के खिलाफ खेल रही थी और भारतीय टीम एशिया कप कप में पाकिस्तान और श्रीलंका के खिलाफ खेलने उतरी थी. ऑस्ट्रेलिया की टीम पूरी तरह से अलग है. आपको ऑस्ट्रेलिया की टीम को हराने के लिए अपना सर्वश्रेष्ठ दोना होगा क्योंकि उनकी टीम के पास नंबर 7 और 8 पर भी बेहद दमदार शॉट्स लगाने वाले खिलाड़ी मौजूद हैं. पहले 2 वनडे के लिए टीम: केएल राहुल (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, श्रेयस अय्यर, ईशान किशन, सूर्यकुमार यादव, रवींद्र जडेजा, शार्दुल ठाकुर, जसप्रीत बुमराह, मोहम्मद सिराज, मोहम्मद शमी, तिलक वर्मा, प्रसिद्ध कृष्णा, रविचंद्रन अश्विन और वॉशिंगटन सुंदर. तीसरे वनडे के लिए टीम: रोहित शर्मा, शुभमन गिल, श्रेयस अय्यर, केएल राहुल, ईशान किशन, सूर्यकुमार यादव, रवींद्र जडेजा, शार्दुल ठाकुर, जसप्रीत बुमराह, मोहम्मद सिराज, मोहम्मद शमी, हार्दिक पांड्या, विराट कोहली, कुलदीप यादव, अक्षर पटेल (फिटनेस के बाद), रविचंद्रन अश्विन और वॉशिंगटन सुंदर. . Tags: India vs Australia , R ashwin , Yuzvendra Chahal पढ़ना नहीं चाहता आपका बच्‍चा, अपनाएं 5 टिप्‍स, किताबों से बढ़ेगा प्‍यार, बार बार याद नहीं दिलाना पडे़गा आपको 27 दिन में बनी नसीरुद्दीन शाह की डिजास्टर, फिल्म ने डूबाया बिजनेसमैन का करियर, सिर्फ 1 गाने ने बचाई इज्जत आंतों में जमा गंदगी को क्लीन आउट कर देंगे ये 3 मामूली जूस, पेट के हर कोने में पहुंचेगी राहत, महीनों तक नहीं होगी दिक्कत","pubDate":"2023-09-20 01:03:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/08/Yuzvendra-Chahal-Asia-Cup-2023-snub-1-16931133753x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a7a0c9fdaa673d177369a4f691ea5c00","title":"37 साल के क्रिकेटर को चुने जाने पर हंगामा, ऑस्ट्रेलिया सीरीज में जगह, क्लब मैच में 1 विकेट और सिर्फ 12 रन","link":"https://hindi.news18.com/cricket/r-ashwin-gets-only-wicket-and-12-runs-before-australia-odis-in-tamil-nadu-2nd-division-vap-trophy-7610553.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"विश्व कप में आखिरी बार खेलने का सपना संजोय अनुभवी भारतीय स्पिनर रविचंद्रन अश्विन ने यहां क्लब स्तर के 50 ओवर के मैच में 10 ओवर की गेंदबाजी कर अच्छा अभ्यास किया. हरफनमौला अक्षर पटेल के चोटिल होने के बाद अश्विन को विश्व कप से पहले ऑस्ट्रेलिया के खिलाफ तीन मैचों की घरेलू वनडे सीरीज के लिए भारतीय टीम में शामिल किया गया है.","content":"भारतीय स्पिनर आर अश्विन को ऑस्ट्रेलिया के खिलाफ वनडे सीरीज में मौका दिया गया है-PTI नई दिल्ली. भारत को आईसीसी वनडे वर्ल्ड क पसे ठीक पहले अपने घर पर ऑस्ट्रेलिया के खिलाफ वनडे सीरीज में खेलना है. यह टीम इंडिया की तैयारी के लिहाज से अहम माना जा रहा है. इस सीरीज के लिए लंबे समय से बाहर चल रहे 37 साल के स्पिनर आर अश्विन को टीम में जगह दी गई है. चयनकर्ताओँ को इस फैसले पर कई दिग्गजों ने सवाल उठाया है क्योंकि युजवेंद्र चहल बाहर बैठे हैं., विश्व कप में आखिरी बार खेलने का सपना संजोय अनुभवी भारतीय स्पिनर रविचंद्रन अश्विन ने यहां क्लब स्तर के 50 ओवर के मैच में 10 ओवर की गेंदबाजी कर अच्छा अभ्यास किया. हरफनमौला अक्षर पटेल के चोटिल होने के बाद अश्विन को विश्व कप से पहले ऑस्ट्रेलिया के खिलाफ तीन मैचों की घरेलू वनडे सीरीज के लिए भारतीय टीम में शामिल किया गया है. 37 साल के अश्विन को अगर विश्व कप के 15 सदस्यीय भारतीय टीम में शामिल किया जाता है तो वह 2011 विश्व कप का खिताब जीतने वाली टीम के दूसरे सदस्य होंगे जो आगामी वैश्विक टूर्नामेंट में खेलेंगे. अश्विन और विराट कोहली 2011 में विश्व कप जीतने वाली भारतीय टीम का हिस्सा थे. अश्विन ने अंतरराष्ट्रीय स्टार बनने के बाद भी क्लब क्रिकेट को हमेशा महत्व दिया है. वह मंगलवार को यहां टीएनसीए वीएपी ट्रॉफी में यंग स्टार्स क्रिकेट क्लब के खिलाफ मायलापुर रिक्रिएशनल क्लब ए के लिए मैदान पर उतरे. अश्विन की टीम ने पहले बल्लेबाजी करते हुए सात विकेट पर 285 रन बनाये। अश्विन ने 17 गेंद में 12 रन का योगदान दिया. लक्ष्य का पीछा करते हुए यंग स्टार्स की टीम 48वें ओवर में 257 रन पर आउट हो गई. अश्विन ने इस दौरान 10 ओवर में 30 रन देकर एक विकेट हासिल किया. डिरान वीपी ने 59 रन पर 4 विकेट लिए जिससे मायलापुर रिक्रिएशनल क्लब ए ने 28 रन की जीत हासिल की. भारतीय टीम ऑस्ट्रेलिया के खिलाफ शुक्रवार को मोहाली में पहला एकदिवसीय खेलेगी. श्रृंखला के दो अन्य मैच 24 सितंबर (इंदौर) और 27 सितंबर (राजकोट) को खेले जायेंगे. . Tags: India vs Australia , R ashwin पढ़ना नहीं चाहता आपका बच्‍चा, अपनाएं 5 टिप्‍स, किताबों से बढ़ेगा प्‍यार, बार बार याद नहीं दिलाना पडे़गा आपको 27 दिन में बनी नसीरुद्दीन शाह की डिजास्टर, फिल्म ने डूबाया बिजनेसमैन का करियर, सिर्फ 1 गाने ने बचाई इज्जत आंतों में जमा गंदगी को क्लीन आउट कर देंगे ये 3 मामूली जूस, पेट के हर कोने में पहुंचेगी राहत, महीनों तक नहीं होगी दिक्कत","pubDate":"2023-09-20 00:39:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/09/India-Team-AP-PTI-16950567733x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2982091f2445f2ffbc8842c1cc188e67","title":"मोहम्मद शमी को World Cup से पहले बड़ी राहत, कोलकाता के कोर्ट से मिली जमानत, जानिए क्या है पूरा मामला ?","link":"https://hindi.news18.com/cricket/big-relief-for-mohammed-shami-as-granted-bail-in-domestic-violence-case-now-play-odi-series-against-australia-7610515.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के तेज गेंदबाज मोहम्मद शमी को पूर्व पत्नी हसीन जहां द्वारा लगाए गए घरेलू हिंसा के आरोप में कोलकाता के अलीपुर कोर्ट में पेश होना पड़ा. एशिया कप टूर्नामेंट खत्म होने के बाद वह सीधा कोलकाता पहुंचे थे. मंगलवार 19 सितंबर को उनकी कोर्ट में पेशी हुई जिसके बाद जमानत मिल गई. अब इस बड़ी रहत के बाद वह ऑस्ट्रेलिया के खिलाफ घर पर होने वाली वनडे सीरीज में खेल सकते हैं. इसके ठीक बाद आईसीसी वनडे वर्ल्ड कप खेला जाना है.","content":"भारतीय तेज गेंदबाज मोहम्मद शमी को वर्ल्ड कप से पहले बड़ी राहत मिली है-AP नई दिल्ली. भारतीय तेज गेंदबाज मोहम्मद शमी को भारत में खेले जाने वाले आईसीसी वनडे वर्ल्ड कप से पहले बड़ी राहत मिली है. ऑस्ट्रेलिया के खिलाफ खेली जाने वाली वनडे सीरीज से पहले शमी कोलकाता में थे. एशिया कप खेलने के बाद वह सीधा एक केस के सिलसिले में अपने घर पहुंचे थे जहां उनको जमानत मिल गई. अब वह आगामी सीरीज का हिस्सा हो सकते हैं. टीम इंडिया के तेज गेंदबाज मोहम्मद शमी को पूर्व पत्नी हसीन जहां द्वारा लगाए गए घरेलू हिंसा के आरोप में कोलकाता के अलीपुर कोर्ट में पेश होना पड़ा. एशिया कप टूर्नामेंट खत्म होने के बाद वह सीधा कोलकाता पहुंचे थे. मंगलवार 19 सितंबर को उनकी कोर्ट में पेशी हुई जिसके बाद जमानत मिल गई. अब इस बड़ी रहत के बाद वह ऑस्ट्रेलिया के खिलाफ घर पर होने वाली वनडे सीरीज में खेल सकते हैं. इसके ठीक बाद आईसीसी वनडे वर्ल्ड कप खेला जाना है. क्या है पूरा मामला भारतीय टीम के तेज गेंदबाज मोहम्मद शमी पर उनकी पूर्व पत्नी हसीन जहां ने साल 2018 में घरेलू हिंसा और क्रूरता का मामला दर्ज कराया था. हसीन ने उनके उपर आरोप लगाया गया था कि वह शादी के बाद मारपीट की और घरेलू हिंसा किया करते थे. इस मामले में स्थानीय अलीपुर पुलिस स्टेशन में एफआईआर दर्ज कराई थी. इस मामले में शमी और उनके परिवार जनों से महिला शिकायत सेल ने पूछताछ की गई थी. शमी को जमानत, ऑस्ट्रेलिया के खिलाफ खेलेंगे भारत और ऑस्ट्रेलिया के बीच तीन मैचों की वनडे सीरीज का पहला मुकाबला 22 सितंबर को खेला जाना है. मोहाली को इस मुकाबले की मेजबानी दी गई है. 18 सितंबर को टीम सलेक्शन में शमी का नाम शामिल किया गया था. अब जमानत मिलने के बाद वह प्लेइंग इलेवन का हिस्सा बनने के लिए उपलब्ध होंगे . Tags: Mohammed Shami रिटायरमेंट के बाद रहने की सबसे अच्‍छी जगह, जहां खर्चे कम और सुविधाओं की भरमार, हर कोई बसना चाहेगा यहां हिन्दी के वो 20 शब्द, जो लगते हैं देसी, पर हैं विदेशी! 99 फीसदी लोगों को नहीं होगा पता भूलकर भी घर के आसपास न लगाएं ये 6 पौधे, चुंबक की तरह खिंचे चले आते हैं सांप","pubDate":"2023-09-20 00:13:32","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/09/mohammad-shami-with-jasprit-bumrah-16937564383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"9af02496fbf11810178365e3eaeed97a","title":"Sri Lankan cricketer amongst eight charged by ICC for T10 match-fixing","link":"https://www.ft.lk/sports/Sri-Lankan-cricketer-amongst-eight-charged-by-ICC-for-T10-match-fixing/23-753185","keywords":null,"creator":null,"video_url":null,"description":null,"content":"One cricketer from Sri Lanka is among eight players, officials and team owners charged with breaching various counts of the ICC Anti-Corruption Code during the T10 League. The charges are in relation to the 2021 Abu Dhabi T10 League. The said tournament took place between 19 November 2021 and 4 December 2021. Six teams played in the tournament. They pertain to attempts made to corrupt the matches in the league. These attempts were disrupted. ECB appointed ICC as the Designated Anti-Corruption Official (DACO) for the purposes of the ECB’s Code during the tournament. Thus, ICC are issuing these charges on the ECB’s behalf. The Sri Lankan player charged is Saliya Saman, a 37-year-old all-rounder with 3662 runs (avg. 27.95) and 231 wickets (avg. 25.92) from 101 first-class matches who represented Sri Lanka and U-17 and U-19 cricket and played for Galle CC, Ragama CC, Saracens SC and Lankan CC, and in numerous leagues. Saman’s charges are; Others charged are Bangladesh cricketer Nasir Hossain, domestic player Rizwan Javed, Batting Coach Ashar Zaidi, Assistant Coach Sunny Dhillon, Team Manager Shadab Ahamed, Co-owner of a team Krishan Kumar Chaudhary, and Co-owner of a team Parag Sanghvi. Six of the charged – Krishan Kumar Chaudhary, Parag Sanghvi, Azhar Zaidi, Rizwan Javed, Saliya Saman and Sunny Dhillon – have been provisionally suspended and all have 14 days from 19 September 2023 to respond to the charges.","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8f14f392dff36850328f317471e03e60","title":"Mongolia women cricketers in tears after 15 score at start of Asian Games","link":"https://www.ft.lk/sports/Mongolia-women-cricketers-in-tears-after-15-score-at-start-of-Asian-Games/23-753186","keywords":null,"creator":null,"video_url":null,"description":null,"content":"HANGZHOU, AFP: Mongolia's women's cricket team were in tears after being bowled out for 15 runs in a thrashing by Indonesia on the opening day of action at the Asian Games on Tuesday. The Games in the Chinese city of Hangzhou officially open on Saturday but sports including cricket, volleyball, beach volleyball and football begin before that. Mongolia's women were making their debut at an international tournament and were given a harsh lesson as Indonesia made 187-4 in the Twenty20 preliminary-round match. Indonesia's total included 49 extras, 38 of them wide by the Mongolian bowlers. In reply, an outclassed Mongolia were out for 15 in 10 overs. Mongolia's coach David Talalla said he was proud of his young team – their average age is just 19 – given their very limited resources and experience of the sport. More than half of his players had never even left Mongolia before and this was their first experience of a grass wicket, having been used to an artificial pitch at home. Mongolia's kit is second-hand from Australia, and their four bats were donated by a French ambassador whose wife is English and a cricket fan, said Talalla, who is working for free. “I know we've only made 15 runs but none of our girls have played the game for longer than two years and we know what a technical game it is,” said Talalla. “We've only got a squad of 12 – that's all we could afford to bring,” added Talalla, saying all of his players were in tears afterwards. “The whole idea is the longer picture – cricket in Mongolia, who would have thought it?” he said. “Even myself, I've only been in the job here for five weeks as a high-performance coach but six months ago, I didn't even know they played cricket in Mongolia. “I think most of the world didn't.”","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c1f60f03dc7d044b54afecbcc4f1d616","title":"Lankan women eye Gold at Asian Games cricket","link":"https://www.ft.lk/sports/Lankan-women-eye-Gold-at-Asian-Games-cricket/23-753187","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Sri Lanka women’s cricket team took part in a religious ceremony at Sri Lanka Cricket headquarters prior to their departure for the Asian Games in China yesterday Sri Lanka women cricketers led by Chamari Athapaththu will be walking into uncharted territory when they take strike in China at the 19th Asian Games. The Sri Lanka women’s team returned home on Saturday from a tour of England where they won the WT20I series 2-1 beating the hosts for the first time and losing the WODI series 2-0. “The conditions are going to be totally different, the weather in China is around 30-33 degrees Celsius,” said Sri Lanka women’s cricket team Head Coach Rumesh Ratnayake. “I had a look at the ground on Google and it looks green. At the start, it might be a bit greenish. Even though it is greenish we have to expect the worst. We don’t know whether it will seam or if it's just a showcase green. They have only one ground and four wickets to play 18 (men’s) and 11 (women’s) matches.” All matches for both the men's and women's tournaments will be held at the Zhejiang University of Technology Pingfeng Cricket Field. The matches at the Asian Games will be played in the T20 format and Sri Lanka is riding high having beaten New Zealand and England in a recently concluded series. ‘It would suit the whole subcontinent India, Pakistan, Bangladesh and Sri Lanka. The confidence will be there but we should not be grounded in that confidence and should not be overawed by it. It’s a matter of reminding ourselves you need hard work to get that confidence,” said Ratnayake. “It’s a different game, different teams and different opposition. How we react is the challenge which we have. What we are preparing is to react better. It would be a surprise. When we went to England also it’s our reaction against their bowling and batting. Everybody has to react fast and be prepared for what we expect from them. It’s just confidence.” The chances of Sri Lanka winning a medal? “Our ambition is to win the Gold. To be a part of the Asian Games is a huge privilege. To win the Gold will be the target of many teams.” Sri Lanka who are ranked third after India and Pakistan will go straight into the quarterfinals where they play either Indonesia, Mongolia, Hong Kong or Malaysia on 22 September. The semi-finals are on 24 September and the playoff for the Bronze medal and the Final will be on 25 September. From the 16 players who toured England, Sri Lanka has made two changes to the side picked for the Asian Games. Hansima Karunaratne has to miss out because her name was not included in the Asian Games squad that was picked three months ago, and Kaushini Nuthyangana replaces Kawya Kavindi who has dislocated her left shoulder. – (ST)","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c372bdc56b985b91bad3f65dc682f8d0","title":"Domestic cricket to resume from Friday","link":"https://www.ft.lk/sports/Domestic-cricket-to-resume-from-Friday/23-753188","keywords":null,"creator":null,"video_url":null,"description":null,"content":"By Sa’adi Thawfeeq All domestic tournaments that were suspended will resume on Friday 22 September. The tournaments came to a grinding halt when Sri Lanka Cricket (SLC) was informed by the Department of Sports Development Director General that they had not received the consent of the Sports Minister before making structural changes to the inter-club three-day tournament ahead of the 2023 season. Although the letter didn’t state to stop the tournaments, the SLC on the advice of their lawyers decided to suspend the tournaments until a clarification was received from the Sports Minister. SLC wrote to the Sports Minister for clarification and last week they had received a letter from the Ministry asking them to continue with the domestic tournaments. Thus the Major Club 3-day League will resume from Friday with a card of 10 matches. The three weekends of matches that could not be played during the period of suspension from 1-3 September, 8-10 September and 15-17 September have been rescheduled for 6-8 October, 13-15 October and 20-22 October with the 4-day final scheduled for 26-29 October. Suspending the tournament was a blessing in disguise for SLC because of the bad weather experienced during the period which would have affected a majority of the matches. The suspension affected several players who banked on their contracts and match fees they received to make a living out of cricket. Clubs who had signed up overseas players to represent them in the tournament were also affected. The bad weather still persists and it is hoped that it will clear by Friday to allow a full game of cricket to be played over the three days.","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6b6bd13451da67063f5aa70ed97bd771","title":"Asian Games 2023, Women’s Cricket Telecast Channel: Where to watch and live streaming details in India","link":"https://www.sportskeeda.com/cricket/asian-games-2023-women-s-cricket-telecast-channel-where-watch-live-streaming-details-india","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2023-09-19 22:23:01","image_url":"https://staticc.sportskeeda.com/editor/2023/09/8cb04-16951476667108-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c1da79331cfbb3e8a956b2a193ef7643","title":"Asian Games 2023, Men’s Cricket Telecast Channel: Where to watch and live streaming details in India","link":"https://www.sportskeeda.com/cricket/asian-games-2023-men-s-cricket-telecast-channel-where-watch-live-streaming-details-india","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2023-09-19 22:23:01","image_url":"https://staticc.sportskeeda.com/editor/2023/09/4cab8-16951463045130-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"073095cacd5777def433003a7d7882a3","title":"Rohit Sharma Looks At Ashwin As A Match-Winner: Saba Karim","link":"https://news.abplive.com/sports/cricket/rohit-sharma-looks-at-ashwin-as-a-match-winner-saba-karim-1630710","keywords":["Cricket"],"creator":["IANS"],"video_url":null,"description":"New Delhi, Sep 19 (IANS) Former cricketer Saba Karim weighed in on Ravichandran Ashwin’s return to India’s ODI squad. “I think Rohit Sharma looks at Ravichandran Ashwin as a match-winner and he’s very clear in the kind of approach he wants to portray in white ball cricket. Now with the World Cup coming up, he understands the dynamics of one-day cricket quite well and knows that he has to pick players who have that kind of an attacking mindset,” Karim told JioCinema. “He also knows that in his bowling lineup, he needs to have out of six, at least five wicket-taking options and if he has Ashwin in the eleven, then that attacking option is available. If you look at all the other players who are in the reserve – they all have that attacking mindset. So, I think Rohit Sharma wants to continue with this aggressive approach that we saw the Indian team play in the Asian challenge.” Karim further spoke about Shreyas Iyer's selection in the squad as well. “I am glad that they are persisting with Shreyas Iyer. It really shows that the team management and selectors trust him so much. And Shreyas has played a very vital role in the one-day setup. So, I am happy to see that they are backing him right till they announce the World Cup side. “I don’t think there should be any issue with him being part of the side if he's fit, even if he does not score runs in these two or three games – it does not matter. You need to back players who have done well for you in the past and they in any case get three ODI games here plus the two practice matches. The kind of player Shreyas Iyer is – I am pretty excited for him to get back into the fold and score runs at the right time for the Indian side.” (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)","content":"New Delhi, Sep 19 (IANS) Former cricketer Saba Karim weighed in on Ravichandran Ashwin’s return to India’s ODI squad. “I think Rohit Sharma looks at Ravichandran Ashwin as a match-winner and he’s very clear in the kind of approach he wants to portray in white ball cricket. Now with the World Cup coming up, he understands the dynamics of one-day cricket quite well and knows that he has to pick players who have that kind of an attacking mindset,” Karim told JioCinema. “He also knows that in his bowling lineup, he needs to have out of six, at least five wicket-taking options and if he has Ashwin in the eleven, then that attacking option is available. If you look at all the other players who are in the reserve – they all have that attacking mindset. So, I think Rohit Sharma wants to continue with this aggressive approach that we saw the Indian team play in the Asian challenge.” Karim further spoke about Shreyas Iyer's selection in the squad as well. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); “I am glad that they are persisting with Shreyas Iyer. It really shows that the team management and selectors trust him so much. And Shreyas has played a very vital role in the one-day setup. So, I am happy to see that they are backing him right till they announce the World Cup side. “I don’t think there should be any issue with him being part of the side if he's fit, even if he does not score runs in these two or three games – it does not matter. You need to back players who have done well for you in the past and they in any case get three ODI games here plus the two practice matches. The kind of player Shreyas Iyer is – I am pretty excited for him to get back into the fold and score runs at the right time for the Indian side.” (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)","pubDate":"2023-09-20 01:56:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/20/edfc4f237a7b810763afa484dd1b85521695174880439567_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0d338b7d35627be4291c7f3db75892b4","title":"युजवेंद्र चहल की टीम इंडिया में लड़ाई हुई है, किसी से कुछ बोल दिया है....हरभजन सिंह ने टीम से बाहर रखने पर जताया शक","link":"https://hindi.news18.com/cricket/harbhajan-singh-wants-spinner-yuzvendra-chahal-to-be-in-world-cup-squad-if-axar-patel-no-available-7610619.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"हरभजन सिंह ने अपने यू ट्यूब चैनल पर कहा, \"युजवेंद्र चहल को इस टीम का हिस्सा होना चाहिए था. उनको तो मौका भी नहीं दिया गया है. यह बात तो मेरी समझ से बिल्कुल परे है. या तो उन्होंने किसी से लड़ाई की है या नहीं तो किसी ना किसी से कुछ बुरा बोला है, अब मुझे तो नहीं पता कि क्या हुआ है.","content":"युजवेंद्र चहल को ऑस्ट्रेलिया के खिलाफ वर्ल्ड कप के बाद ऑस्ट्रेलिया सीरीज से भी बाहर रखा गया है. (PIC: AFP) नई दिल्ली. भारतीय क्रिकेट टीम के पूर्व स्पिनर हरभजन सिंह ने वर्ल्ड कप से पहले ऑस्ट्रेलिया के खिलाफ खेली जाने वाली सीरीज के लिए चुनी गई टीम पर सवाल उठाया है. चयनकर्ताओं ने 37 साल के स्पिनर आर अश्विन को अचानक से वनडे टीम में चुना जबकि टीम के साथ बने हुए युजवेंद्र चहल को मौका नहीं दिया. भज्जी का मानना है कि पहले चहल को मौका मिलना चाहिए था. हरभजन सिंह ने अपने यू ट्यूब चैनल पर कहा, “युजवेंद्र चहल को इस टीम का हिस्सा होना चाहिए था. उनको तो मौका भी नहीं दिया गया है. यह बात तो मेरी समझ से बिल्कुल परे है. या तो उन्होंने किसी से लड़ाई की है या नहीं तो किसी ना किसी से कुछ बुरा बोला है, अब मुझे तो नहीं पता कि क्या हुआ है. अगर जो हम सिर्फ और सिर्फ कला को लेकर बात करते हैं तो उनका नाम उस जगह पर होना ही चाहिए था. ऐसा इसलिए भी है क्योंकि काफी सारे भारतीय खिलाड़ियों को आराम दिया गया है.” आगे उन्होंने कहा, ऑस्ट्रेलिया की टीम साउथ अफ्रीका के खिलाफ खेल रही थी और भारतीय टीम एशिया कप कप में पाकिस्तान और श्रीलंका के खिलाफ खेलने उतरी थी. ऑस्ट्रेलिया की टीम पूरी तरह से अलग है. आपको ऑस्ट्रेलिया की टीम को हराने के लिए अपना सर्वश्रेष्ठ दोना होगा क्योंकि उनकी टीम के पास नंबर 7 और 8 पर भी बेहद दमदार शॉट्स लगाने वाले खिलाड़ी मौजूद हैं. पहले 2 वनडे के लिए टीम: केएल राहुल (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, श्रेयस अय्यर, ईशान किशन, सूर्यकुमार यादव, रवींद्र जडेजा, शार्दुल ठाकुर, जसप्रीत बुमराह, मोहम्मद सिराज, मोहम्मद शमी, तिलक वर्मा, प्रसिद्ध कृष्णा, रविचंद्रन अश्विन और वॉशिंगटन सुंदर. तीसरे वनडे के लिए टीम: रोहित शर्मा, शुभमन गिल, श्रेयस अय्यर, केएल राहुल, ईशान किशन, सूर्यकुमार यादव, रवींद्र जडेजा, शार्दुल ठाकुर, जसप्रीत बुमराह, मोहम्मद सिराज, मोहम्मद शमी, हार्दिक पांड्या, विराट कोहली, कुलदीप यादव, अक्षर पटेल (फिटनेस के बाद), रविचंद्रन अश्विन और वॉशिंगटन सुंदर. . Tags: India vs Australia , R ashwin , Yuzvendra Chahal पढ़ना नहीं चाहता आपका बच्‍चा, अपनाएं 5 टिप्‍स, किताबों से बढ़ेगा प्‍यार, बार बार याद नहीं दिलाना पडे़गा आपको 27 दिन में बनी नसीरुद्दीन शाह की डिजास्टर, फिल्म ने डूबाया बिजनेसमैन का करियर, सिर्फ 1 गाने ने बचाई इज्जत आंतों में जमा गंदगी को क्लीन आउट कर देंगे ये 3 मामूली जूस, पेट के हर कोने में पहुंचेगी राहत, महीनों तक नहीं होगी दिक्कत","pubDate":"2023-09-20 01:03:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/08/Yuzvendra-Chahal-Asia-Cup-2023-snub-1-16931133753x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a7a0c9fdaa673d177369a4f691ea5c00","title":"37 साल के क्रिकेटर को चुने जाने पर हंगामा, ऑस्ट्रेलिया सीरीज में जगह, क्लब मैच में 1 विकेट और सिर्फ 12 रन","link":"https://hindi.news18.com/cricket/r-ashwin-gets-only-wicket-and-12-runs-before-australia-odis-in-tamil-nadu-2nd-division-vap-trophy-7610553.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"विश्व कप में आखिरी बार खेलने का सपना संजोय अनुभवी भारतीय स्पिनर रविचंद्रन अश्विन ने यहां क्लब स्तर के 50 ओवर के मैच में 10 ओवर की गेंदबाजी कर अच्छा अभ्यास किया. हरफनमौला अक्षर पटेल के चोटिल होने के बाद अश्विन को विश्व कप से पहले ऑस्ट्रेलिया के खिलाफ तीन मैचों की घरेलू वनडे सीरीज के लिए भारतीय टीम में शामिल किया गया है.","content":"भारतीय स्पिनर आर अश्विन को ऑस्ट्रेलिया के खिलाफ वनडे सीरीज में मौका दिया गया है-PTI नई दिल्ली. भारत को आईसीसी वनडे वर्ल्ड क पसे ठीक पहले अपने घर पर ऑस्ट्रेलिया के खिलाफ वनडे सीरीज में खेलना है. यह टीम इंडिया की तैयारी के लिहाज से अहम माना जा रहा है. इस सीरीज के लिए लंबे समय से बाहर चल रहे 37 साल के स्पिनर आर अश्विन को टीम में जगह दी गई है. चयनकर्ताओँ को इस फैसले पर कई दिग्गजों ने सवाल उठाया है क्योंकि युजवेंद्र चहल बाहर बैठे हैं., विश्व कप में आखिरी बार खेलने का सपना संजोय अनुभवी भारतीय स्पिनर रविचंद्रन अश्विन ने यहां क्लब स्तर के 50 ओवर के मैच में 10 ओवर की गेंदबाजी कर अच्छा अभ्यास किया. हरफनमौला अक्षर पटेल के चोटिल होने के बाद अश्विन को विश्व कप से पहले ऑस्ट्रेलिया के खिलाफ तीन मैचों की घरेलू वनडे सीरीज के लिए भारतीय टीम में शामिल किया गया है. 37 साल के अश्विन को अगर विश्व कप के 15 सदस्यीय भारतीय टीम में शामिल किया जाता है तो वह 2011 विश्व कप का खिताब जीतने वाली टीम के दूसरे सदस्य होंगे जो आगामी वैश्विक टूर्नामेंट में खेलेंगे. अश्विन और विराट कोहली 2011 में विश्व कप जीतने वाली भारतीय टीम का हिस्सा थे. अश्विन ने अंतरराष्ट्रीय स्टार बनने के बाद भी क्लब क्रिकेट को हमेशा महत्व दिया है. वह मंगलवार को यहां टीएनसीए वीएपी ट्रॉफी में यंग स्टार्स क्रिकेट क्लब के खिलाफ मायलापुर रिक्रिएशनल क्लब ए के लिए मैदान पर उतरे. अश्विन की टीम ने पहले बल्लेबाजी करते हुए सात विकेट पर 285 रन बनाये। अश्विन ने 17 गेंद में 12 रन का योगदान दिया. लक्ष्य का पीछा करते हुए यंग स्टार्स की टीम 48वें ओवर में 257 रन पर आउट हो गई. अश्विन ने इस दौरान 10 ओवर में 30 रन देकर एक विकेट हासिल किया. डिरान वीपी ने 59 रन पर 4 विकेट लिए जिससे मायलापुर रिक्रिएशनल क्लब ए ने 28 रन की जीत हासिल की. भारतीय टीम ऑस्ट्रेलिया के खिलाफ शुक्रवार को मोहाली में पहला एकदिवसीय खेलेगी. श्रृंखला के दो अन्य मैच 24 सितंबर (इंदौर) और 27 सितंबर (राजकोट) को खेले जायेंगे. . Tags: India vs Australia , R ashwin पढ़ना नहीं चाहता आपका बच्‍चा, अपनाएं 5 टिप्‍स, किताबों से बढ़ेगा प्‍यार, बार बार याद नहीं दिलाना पडे़गा आपको 27 दिन में बनी नसीरुद्दीन शाह की डिजास्टर, फिल्म ने डूबाया बिजनेसमैन का करियर, सिर्फ 1 गाने ने बचाई इज्जत आंतों में जमा गंदगी को क्लीन आउट कर देंगे ये 3 मामूली जूस, पेट के हर कोने में पहुंचेगी राहत, महीनों तक नहीं होगी दिक्कत","pubDate":"2023-09-20 00:39:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/09/India-Team-AP-PTI-16950567733x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2982091f2445f2ffbc8842c1cc188e67","title":"मोहम्मद शमी को World Cup से पहले बड़ी राहत, कोलकाता के कोर्ट से मिली जमानत, जानिए क्या है पूरा मामला ?","link":"https://hindi.news18.com/cricket/big-relief-for-mohammed-shami-as-granted-bail-in-domestic-violence-case-now-play-odi-series-against-australia-7610515.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के तेज गेंदबाज मोहम्मद शमी को पूर्व पत्नी हसीन जहां द्वारा लगाए गए घरेलू हिंसा के आरोप में कोलकाता के अलीपुर कोर्ट में पेश होना पड़ा. एशिया कप टूर्नामेंट खत्म होने के बाद वह सीधा कोलकाता पहुंचे थे. मंगलवार 19 सितंबर को उनकी कोर्ट में पेशी हुई जिसके बाद जमानत मिल गई. अब इस बड़ी रहत के बाद वह ऑस्ट्रेलिया के खिलाफ घर पर होने वाली वनडे सीरीज में खेल सकते हैं. इसके ठीक बाद आईसीसी वनडे वर्ल्ड कप खेला जाना है.","content":"भारतीय तेज गेंदबाज मोहम्मद शमी को वर्ल्ड कप से पहले बड़ी राहत मिली है-AP नई दिल्ली. भारतीय तेज गेंदबाज मोहम्मद शमी को भारत में खेले जाने वाले आईसीसी वनडे वर्ल्ड कप से पहले बड़ी राहत मिली है. ऑस्ट्रेलिया के खिलाफ खेली जाने वाली वनडे सीरीज से पहले शमी कोलकाता में थे. एशिया कप खेलने के बाद वह सीधा एक केस के सिलसिले में अपने घर पहुंचे थे जहां उनको जमानत मिल गई. अब वह आगामी सीरीज का हिस्सा हो सकते हैं. टीम इंडिया के तेज गेंदबाज मोहम्मद शमी को पूर्व पत्नी हसीन जहां द्वारा लगाए गए घरेलू हिंसा के आरोप में कोलकाता के अलीपुर कोर्ट में पेश होना पड़ा. एशिया कप टूर्नामेंट खत्म होने के बाद वह सीधा कोलकाता पहुंचे थे. मंगलवार 19 सितंबर को उनकी कोर्ट में पेशी हुई जिसके बाद जमानत मिल गई. अब इस बड़ी रहत के बाद वह ऑस्ट्रेलिया के खिलाफ घर पर होने वाली वनडे सीरीज में खेल सकते हैं. इसके ठीक बाद आईसीसी वनडे वर्ल्ड कप खेला जाना है. क्या है पूरा मामला भारतीय टीम के तेज गेंदबाज मोहम्मद शमी पर उनकी पूर्व पत्नी हसीन जहां ने साल 2018 में घरेलू हिंसा और क्रूरता का मामला दर्ज कराया था. हसीन ने उनके उपर आरोप लगाया गया था कि वह शादी के बाद मारपीट की और घरेलू हिंसा किया करते थे. इस मामले में स्थानीय अलीपुर पुलिस स्टेशन में एफआईआर दर्ज कराई थी. इस मामले में शमी और उनके परिवार जनों से महिला शिकायत सेल ने पूछताछ की गई थी. शमी को जमानत, ऑस्ट्रेलिया के खिलाफ खेलेंगे भारत और ऑस्ट्रेलिया के बीच तीन मैचों की वनडे सीरीज का पहला मुकाबला 22 सितंबर को खेला जाना है. मोहाली को इस मुकाबले की मेजबानी दी गई है. 18 सितंबर को टीम सलेक्शन में शमी का नाम शामिल किया गया था. अब जमानत मिलने के बाद वह प्लेइंग इलेवन का हिस्सा बनने के लिए उपलब्ध होंगे . Tags: Mohammed Shami रिटायरमेंट के बाद रहने की सबसे अच्‍छी जगह, जहां खर्चे कम और सुविधाओं की भरमार, हर कोई बसना चाहेगा यहां हिन्दी के वो 20 शब्द, जो लगते हैं देसी, पर हैं विदेशी! 99 फीसदी लोगों को नहीं होगा पता भूलकर भी घर के आसपास न लगाएं ये 6 पौधे, चुंबक की तरह खिंचे चले आते हैं सांप","pubDate":"2023-09-20 00:13:32","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/09/mohammad-shami-with-jasprit-bumrah-16937564383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"9af02496fbf11810178365e3eaeed97a","title":"Sri Lankan cricketer amongst eight charged by ICC for T10 match-fixing","link":"https://www.ft.lk/sports/Sri-Lankan-cricketer-amongst-eight-charged-by-ICC-for-T10-match-fixing/23-753185","keywords":null,"creator":null,"video_url":null,"description":null,"content":"One cricketer from Sri Lanka is among eight players, officials and team owners charged with breaching various counts of the ICC Anti-Corruption Code during the T10 League. The charges are in relation to the 2021 Abu Dhabi T10 League. The said tournament took place between 19 November 2021 and 4 December 2021. Six teams played in the tournament. They pertain to attempts made to corrupt the matches in the league. These attempts were disrupted. ECB appointed ICC as the Designated Anti-Corruption Official (DACO) for the purposes of the ECB’s Code during the tournament. Thus, ICC are issuing these charges on the ECB’s behalf. The Sri Lankan player charged is Saliya Saman, a 37-year-old all-rounder with 3662 runs (avg. 27.95) and 231 wickets (avg. 25.92) from 101 first-class matches who represented Sri Lanka and U-17 and U-19 cricket and played for Galle CC, Ragama CC, Saracens SC and Lankan CC, and in numerous leagues. Saman’s charges are; Others charged are Bangladesh cricketer Nasir Hossain, domestic player Rizwan Javed, Batting Coach Ashar Zaidi, Assistant Coach Sunny Dhillon, Team Manager Shadab Ahamed, Co-owner of a team Krishan Kumar Chaudhary, and Co-owner of a team Parag Sanghvi. Six of the charged – Krishan Kumar Chaudhary, Parag Sanghvi, Azhar Zaidi, Rizwan Javed, Saliya Saman and Sunny Dhillon – have been provisionally suspended and all have 14 days from 19 September 2023 to respond to the charges.","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8f14f392dff36850328f317471e03e60","title":"Mongolia women cricketers in tears after 15 score at start of Asian Games","link":"https://www.ft.lk/sports/Mongolia-women-cricketers-in-tears-after-15-score-at-start-of-Asian-Games/23-753186","keywords":null,"creator":null,"video_url":null,"description":null,"content":"HANGZHOU, AFP: Mongolia's women's cricket team were in tears after being bowled out for 15 runs in a thrashing by Indonesia on the opening day of action at the Asian Games on Tuesday. The Games in the Chinese city of Hangzhou officially open on Saturday but sports including cricket, volleyball, beach volleyball and football begin before that. Mongolia's women were making their debut at an international tournament and were given a harsh lesson as Indonesia made 187-4 in the Twenty20 preliminary-round match. Indonesia's total included 49 extras, 38 of them wide by the Mongolian bowlers. In reply, an outclassed Mongolia were out for 15 in 10 overs. Mongolia's coach David Talalla said he was proud of his young team – their average age is just 19 – given their very limited resources and experience of the sport. More than half of his players had never even left Mongolia before and this was their first experience of a grass wicket, having been used to an artificial pitch at home. Mongolia's kit is second-hand from Australia, and their four bats were donated by a French ambassador whose wife is English and a cricket fan, said Talalla, who is working for free. “I know we've only made 15 runs but none of our girls have played the game for longer than two years and we know what a technical game it is,” said Talalla. “We've only got a squad of 12 – that's all we could afford to bring,” added Talalla, saying all of his players were in tears afterwards. “The whole idea is the longer picture – cricket in Mongolia, who would have thought it?” he said. “Even myself, I've only been in the job here for five weeks as a high-performance coach but six months ago, I didn't even know they played cricket in Mongolia. “I think most of the world didn't.”","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c1f60f03dc7d044b54afecbcc4f1d616","title":"Lankan women eye Gold at Asian Games cricket","link":"https://www.ft.lk/sports/Lankan-women-eye-Gold-at-Asian-Games-cricket/23-753187","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Sri Lanka women’s cricket team took part in a religious ceremony at Sri Lanka Cricket headquarters prior to their departure for the Asian Games in China yesterday Sri Lanka women cricketers led by Chamari Athapaththu will be walking into uncharted territory when they take strike in China at the 19th Asian Games. The Sri Lanka women’s team returned home on Saturday from a tour of England where they won the WT20I series 2-1 beating the hosts for the first time and losing the WODI series 2-0. “The conditions are going to be totally different, the weather in China is around 30-33 degrees Celsius,” said Sri Lanka women’s cricket team Head Coach Rumesh Ratnayake. “I had a look at the ground on Google and it looks green. At the start, it might be a bit greenish. Even though it is greenish we have to expect the worst. We don’t know whether it will seam or if it's just a showcase green. They have only one ground and four wickets to play 18 (men’s) and 11 (women’s) matches.” All matches for both the men's and women's tournaments will be held at the Zhejiang University of Technology Pingfeng Cricket Field. The matches at the Asian Games will be played in the T20 format and Sri Lanka is riding high having beaten New Zealand and England in a recently concluded series. ‘It would suit the whole subcontinent India, Pakistan, Bangladesh and Sri Lanka. The confidence will be there but we should not be grounded in that confidence and should not be overawed by it. It’s a matter of reminding ourselves you need hard work to get that confidence,” said Ratnayake. “It’s a different game, different teams and different opposition. How we react is the challenge which we have. What we are preparing is to react better. It would be a surprise. When we went to England also it’s our reaction against their bowling and batting. Everybody has to react fast and be prepared for what we expect from them. It’s just confidence.” The chances of Sri Lanka winning a medal? “Our ambition is to win the Gold. To be a part of the Asian Games is a huge privilege. To win the Gold will be the target of many teams.” Sri Lanka who are ranked third after India and Pakistan will go straight into the quarterfinals where they play either Indonesia, Mongolia, Hong Kong or Malaysia on 22 September. The semi-finals are on 24 September and the playoff for the Bronze medal and the Final will be on 25 September. From the 16 players who toured England, Sri Lanka has made two changes to the side picked for the Asian Games. Hansima Karunaratne has to miss out because her name was not included in the Asian Games squad that was picked three months ago, and Kaushini Nuthyangana replaces Kawya Kavindi who has dislocated her left shoulder. – (ST)","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c372bdc56b985b91bad3f65dc682f8d0","title":"Domestic cricket to resume from Friday","link":"https://www.ft.lk/sports/Domestic-cricket-to-resume-from-Friday/23-753188","keywords":null,"creator":null,"video_url":null,"description":null,"content":"By Sa’adi Thawfeeq All domestic tournaments that were suspended will resume on Friday 22 September. The tournaments came to a grinding halt when Sri Lanka Cricket (SLC) was informed by the Department of Sports Development Director General that they had not received the consent of the Sports Minister before making structural changes to the inter-club three-day tournament ahead of the 2023 season. Although the letter didn’t state to stop the tournaments, the SLC on the advice of their lawyers decided to suspend the tournaments until a clarification was received from the Sports Minister. SLC wrote to the Sports Minister for clarification and last week they had received a letter from the Ministry asking them to continue with the domestic tournaments. Thus the Major Club 3-day League will resume from Friday with a card of 10 matches. The three weekends of matches that could not be played during the period of suspension from 1-3 September, 8-10 September and 15-17 September have been rescheduled for 6-8 October, 13-15 October and 20-22 October with the 4-day final scheduled for 26-29 October. Suspending the tournament was a blessing in disguise for SLC because of the bad weather experienced during the period which would have affected a majority of the matches. The suspension affected several players who banked on their contracts and match fees they received to make a living out of cricket. Clubs who had signed up overseas players to represent them in the tournament were also affected. The bad weather still persists and it is hoped that it will clear by Friday to allow a full game of cricket to be played over the three days.","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6b6bd13451da67063f5aa70ed97bd771","title":"Asian Games 2023, Women’s Cricket Telecast Channel: Where to watch and live streaming details in India","link":"https://www.sportskeeda.com/cricket/asian-games-2023-women-s-cricket-telecast-channel-where-watch-live-streaming-details-india","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2023-09-19 22:23:01","image_url":"https://staticc.sportskeeda.com/editor/2023/09/8cb04-16951476667108-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c1da79331cfbb3e8a956b2a193ef7643","title":"Asian Games 2023, Men’s Cricket Telecast Channel: Where to watch and live streaming details in India","link":"https://www.sportskeeda.com/cricket/asian-games-2023-men-s-cricket-telecast-channel-where-watch-live-streaming-details-india","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2023-09-19 22:23:01","image_url":"https://staticc.sportskeeda.com/editor/2023/09/4cab8-16951463045130-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"073095cacd5777def433003a7d7882a3","title":"Rohit Sharma Looks At Ashwin As A Match-Winner: Saba Karim","link":"https://news.abplive.com/sports/cricket/rohit-sharma-looks-at-ashwin-as-a-match-winner-saba-karim-1630710","keywords":["Cricket"],"creator":["IANS"],"video_url":null,"description":"New Delhi, Sep 19 (IANS) Former cricketer Saba Karim weighed in on Ravichandran Ashwin’s return to India’s ODI squad. “I think Rohit Sharma looks at Ravichandran Ashwin as a match-winner and he’s very clear in the kind of approach he wants to portray in white ball cricket. Now with the World Cup coming up, he understands the dynamics of one-day cricket quite well and knows that he has to pick players who have that kind of an attacking mindset,” Karim told JioCinema. “He also knows that in his bowling lineup, he needs to have out of six, at least five wicket-taking options and if he has Ashwin in the eleven, then that attacking option is available. If you look at all the other players who are in the reserve – they all have that attacking mindset. So, I think Rohit Sharma wants to continue with this aggressive approach that we saw the Indian team play in the Asian challenge.” Karim further spoke about Shreyas Iyer's selection in the squad as well. “I am glad that they are persisting with Shreyas Iyer. It really shows that the team management and selectors trust him so much. And Shreyas has played a very vital role in the one-day setup. So, I am happy to see that they are backing him right till they announce the World Cup side. “I don’t think there should be any issue with him being part of the side if he's fit, even if he does not score runs in these two or three games – it does not matter. You need to back players who have done well for you in the past and they in any case get three ODI games here plus the two practice matches. The kind of player Shreyas Iyer is – I am pretty excited for him to get back into the fold and score runs at the right time for the Indian side.” (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)","content":"New Delhi, Sep 19 (IANS) Former cricketer Saba Karim weighed in on Ravichandran Ashwin’s return to India’s ODI squad. “I think Rohit Sharma looks at Ravichandran Ashwin as a match-winner and he’s very clear in the kind of approach he wants to portray in white ball cricket. Now with the World Cup coming up, he understands the dynamics of one-day cricket quite well and knows that he has to pick players who have that kind of an attacking mindset,” Karim told JioCinema. “He also knows that in his bowling lineup, he needs to have out of six, at least five wicket-taking options and if he has Ashwin in the eleven, then that attacking option is available. If you look at all the other players who are in the reserve – they all have that attacking mindset. So, I think Rohit Sharma wants to continue with this aggressive approach that we saw the Indian team play in the Asian challenge.” Karim further spoke about Shreyas Iyer's selection in the squad as well. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); “I am glad that they are persisting with Shreyas Iyer. It really shows that the team management and selectors trust him so much. And Shreyas has played a very vital role in the one-day setup. So, I am happy to see that they are backing him right till they announce the World Cup side. “I don’t think there should be any issue with him being part of the side if he's fit, even if he does not score runs in these two or three games – it does not matter. You need to back players who have done well for you in the past and they in any case get three ODI games here plus the two practice matches. The kind of player Shreyas Iyer is – I am pretty excited for him to get back into the fold and score runs at the right time for the Indian side.” (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)","pubDate":"2023-09-20 01:56:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/20/edfc4f237a7b810763afa484dd1b85521695174880439567_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0d338b7d35627be4291c7f3db75892b4","title":"युजवेंद्र चहल की टीम इंडिया में लड़ाई हुई है, किसी से कुछ बोल दिया है....हरभजन सिंह ने टीम से बाहर रखने पर जताया शक","link":"https://hindi.news18.com/cricket/harbhajan-singh-wants-spinner-yuzvendra-chahal-to-be-in-world-cup-squad-if-axar-patel-no-available-7610619.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"हरभजन सिंह ने अपने यू ट्यूब चैनल पर कहा, \"युजवेंद्र चहल को इस टीम का हिस्सा होना चाहिए था. उनको तो मौका भी नहीं दिया गया है. यह बात तो मेरी समझ से बिल्कुल परे है. या तो उन्होंने किसी से लड़ाई की है या नहीं तो किसी ना किसी से कुछ बुरा बोला है, अब मुझे तो नहीं पता कि क्या हुआ है.","content":"युजवेंद्र चहल को ऑस्ट्रेलिया के खिलाफ वर्ल्ड कप के बाद ऑस्ट्रेलिया सीरीज से भी बाहर रखा गया है. (PIC: AFP) नई दिल्ली. भारतीय क्रिकेट टीम के पूर्व स्पिनर हरभजन सिंह ने वर्ल्ड कप से पहले ऑस्ट्रेलिया के खिलाफ खेली जाने वाली सीरीज के लिए चुनी गई टीम पर सवाल उठाया है. चयनकर्ताओं ने 37 साल के स्पिनर आर अश्विन को अचानक से वनडे टीम में चुना जबकि टीम के साथ बने हुए युजवेंद्र चहल को मौका नहीं दिया. भज्जी का मानना है कि पहले चहल को मौका मिलना चाहिए था. हरभजन सिंह ने अपने यू ट्यूब चैनल पर कहा, “युजवेंद्र चहल को इस टीम का हिस्सा होना चाहिए था. उनको तो मौका भी नहीं दिया गया है. यह बात तो मेरी समझ से बिल्कुल परे है. या तो उन्होंने किसी से लड़ाई की है या नहीं तो किसी ना किसी से कुछ बुरा बोला है, अब मुझे तो नहीं पता कि क्या हुआ है. अगर जो हम सिर्फ और सिर्फ कला को लेकर बात करते हैं तो उनका नाम उस जगह पर होना ही चाहिए था. ऐसा इसलिए भी है क्योंकि काफी सारे भारतीय खिलाड़ियों को आराम दिया गया है.” आगे उन्होंने कहा, ऑस्ट्रेलिया की टीम साउथ अफ्रीका के खिलाफ खेल रही थी और भारतीय टीम एशिया कप कप में पाकिस्तान और श्रीलंका के खिलाफ खेलने उतरी थी. ऑस्ट्रेलिया की टीम पूरी तरह से अलग है. आपको ऑस्ट्रेलिया की टीम को हराने के लिए अपना सर्वश्रेष्ठ दोना होगा क्योंकि उनकी टीम के पास नंबर 7 और 8 पर भी बेहद दमदार शॉट्स लगाने वाले खिलाड़ी मौजूद हैं. पहले 2 वनडे के लिए टीम: केएल राहुल (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, श्रेयस अय्यर, ईशान किशन, सूर्यकुमार यादव, रवींद्र जडेजा, शार्दुल ठाकुर, जसप्रीत बुमराह, मोहम्मद सिराज, मोहम्मद शमी, तिलक वर्मा, प्रसिद्ध कृष्णा, रविचंद्रन अश्विन और वॉशिंगटन सुंदर. तीसरे वनडे के लिए टीम: रोहित शर्मा, शुभमन गिल, श्रेयस अय्यर, केएल राहुल, ईशान किशन, सूर्यकुमार यादव, रवींद्र जडेजा, शार्दुल ठाकुर, जसप्रीत बुमराह, मोहम्मद सिराज, मोहम्मद शमी, हार्दिक पांड्या, विराट कोहली, कुलदीप यादव, अक्षर पटेल (फिटनेस के बाद), रविचंद्रन अश्विन और वॉशिंगटन सुंदर. . Tags: India vs Australia , R ashwin , Yuzvendra Chahal पढ़ना नहीं चाहता आपका बच्‍चा, अपनाएं 5 टिप्‍स, किताबों से बढ़ेगा प्‍यार, बार बार याद नहीं दिलाना पडे़गा आपको 27 दिन में बनी नसीरुद्दीन शाह की डिजास्टर, फिल्म ने डूबाया बिजनेसमैन का करियर, सिर्फ 1 गाने ने बचाई इज्जत आंतों में जमा गंदगी को क्लीन आउट कर देंगे ये 3 मामूली जूस, पेट के हर कोने में पहुंचेगी राहत, महीनों तक नहीं होगी दिक्कत","pubDate":"2023-09-20 01:03:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/08/Yuzvendra-Chahal-Asia-Cup-2023-snub-1-16931133753x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a7a0c9fdaa673d177369a4f691ea5c00","title":"37 साल के क्रिकेटर को चुने जाने पर हंगामा, ऑस्ट्रेलिया सीरीज में जगह, क्लब मैच में 1 विकेट और सिर्फ 12 रन","link":"https://hindi.news18.com/cricket/r-ashwin-gets-only-wicket-and-12-runs-before-australia-odis-in-tamil-nadu-2nd-division-vap-trophy-7610553.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"विश्व कप में आखिरी बार खेलने का सपना संजोय अनुभवी भारतीय स्पिनर रविचंद्रन अश्विन ने यहां क्लब स्तर के 50 ओवर के मैच में 10 ओवर की गेंदबाजी कर अच्छा अभ्यास किया. हरफनमौला अक्षर पटेल के चोटिल होने के बाद अश्विन को विश्व कप से पहले ऑस्ट्रेलिया के खिलाफ तीन मैचों की घरेलू वनडे सीरीज के लिए भारतीय टीम में शामिल किया गया है.","content":"भारतीय स्पिनर आर अश्विन को ऑस्ट्रेलिया के खिलाफ वनडे सीरीज में मौका दिया गया है-PTI नई दिल्ली. भारत को आईसीसी वनडे वर्ल्ड क पसे ठीक पहले अपने घर पर ऑस्ट्रेलिया के खिलाफ वनडे सीरीज में खेलना है. यह टीम इंडिया की तैयारी के लिहाज से अहम माना जा रहा है. इस सीरीज के लिए लंबे समय से बाहर चल रहे 37 साल के स्पिनर आर अश्विन को टीम में जगह दी गई है. चयनकर्ताओँ को इस फैसले पर कई दिग्गजों ने सवाल उठाया है क्योंकि युजवेंद्र चहल बाहर बैठे हैं., विश्व कप में आखिरी बार खेलने का सपना संजोय अनुभवी भारतीय स्पिनर रविचंद्रन अश्विन ने यहां क्लब स्तर के 50 ओवर के मैच में 10 ओवर की गेंदबाजी कर अच्छा अभ्यास किया. हरफनमौला अक्षर पटेल के चोटिल होने के बाद अश्विन को विश्व कप से पहले ऑस्ट्रेलिया के खिलाफ तीन मैचों की घरेलू वनडे सीरीज के लिए भारतीय टीम में शामिल किया गया है. 37 साल के अश्विन को अगर विश्व कप के 15 सदस्यीय भारतीय टीम में शामिल किया जाता है तो वह 2011 विश्व कप का खिताब जीतने वाली टीम के दूसरे सदस्य होंगे जो आगामी वैश्विक टूर्नामेंट में खेलेंगे. अश्विन और विराट कोहली 2011 में विश्व कप जीतने वाली भारतीय टीम का हिस्सा थे. अश्विन ने अंतरराष्ट्रीय स्टार बनने के बाद भी क्लब क्रिकेट को हमेशा महत्व दिया है. वह मंगलवार को यहां टीएनसीए वीएपी ट्रॉफी में यंग स्टार्स क्रिकेट क्लब के खिलाफ मायलापुर रिक्रिएशनल क्लब ए के लिए मैदान पर उतरे. अश्विन की टीम ने पहले बल्लेबाजी करते हुए सात विकेट पर 285 रन बनाये। अश्विन ने 17 गेंद में 12 रन का योगदान दिया. लक्ष्य का पीछा करते हुए यंग स्टार्स की टीम 48वें ओवर में 257 रन पर आउट हो गई. अश्विन ने इस दौरान 10 ओवर में 30 रन देकर एक विकेट हासिल किया. डिरान वीपी ने 59 रन पर 4 विकेट लिए जिससे मायलापुर रिक्रिएशनल क्लब ए ने 28 रन की जीत हासिल की. भारतीय टीम ऑस्ट्रेलिया के खिलाफ शुक्रवार को मोहाली में पहला एकदिवसीय खेलेगी. श्रृंखला के दो अन्य मैच 24 सितंबर (इंदौर) और 27 सितंबर (राजकोट) को खेले जायेंगे. . Tags: India vs Australia , R ashwin पढ़ना नहीं चाहता आपका बच्‍चा, अपनाएं 5 टिप्‍स, किताबों से बढ़ेगा प्‍यार, बार बार याद नहीं दिलाना पडे़गा आपको 27 दिन में बनी नसीरुद्दीन शाह की डिजास्टर, फिल्म ने डूबाया बिजनेसमैन का करियर, सिर्फ 1 गाने ने बचाई इज्जत आंतों में जमा गंदगी को क्लीन आउट कर देंगे ये 3 मामूली जूस, पेट के हर कोने में पहुंचेगी राहत, महीनों तक नहीं होगी दिक्कत","pubDate":"2023-09-20 00:39:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/09/India-Team-AP-PTI-16950567733x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2982091f2445f2ffbc8842c1cc188e67","title":"मोहम्मद शमी को World Cup से पहले बड़ी राहत, कोलकाता के कोर्ट से मिली जमानत, जानिए क्या है पूरा मामला ?","link":"https://hindi.news18.com/cricket/big-relief-for-mohammed-shami-as-granted-bail-in-domestic-violence-case-now-play-odi-series-against-australia-7610515.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के तेज गेंदबाज मोहम्मद शमी को पूर्व पत्नी हसीन जहां द्वारा लगाए गए घरेलू हिंसा के आरोप में कोलकाता के अलीपुर कोर्ट में पेश होना पड़ा. एशिया कप टूर्नामेंट खत्म होने के बाद वह सीधा कोलकाता पहुंचे थे. मंगलवार 19 सितंबर को उनकी कोर्ट में पेशी हुई जिसके बाद जमानत मिल गई. अब इस बड़ी रहत के बाद वह ऑस्ट्रेलिया के खिलाफ घर पर होने वाली वनडे सीरीज में खेल सकते हैं. इसके ठीक बाद आईसीसी वनडे वर्ल्ड कप खेला जाना है.","content":"भारतीय तेज गेंदबाज मोहम्मद शमी को वर्ल्ड कप से पहले बड़ी राहत मिली है-AP नई दिल्ली. भारतीय तेज गेंदबाज मोहम्मद शमी को भारत में खेले जाने वाले आईसीसी वनडे वर्ल्ड कप से पहले बड़ी राहत मिली है. ऑस्ट्रेलिया के खिलाफ खेली जाने वाली वनडे सीरीज से पहले शमी कोलकाता में थे. एशिया कप खेलने के बाद वह सीधा एक केस के सिलसिले में अपने घर पहुंचे थे जहां उनको जमानत मिल गई. अब वह आगामी सीरीज का हिस्सा हो सकते हैं. टीम इंडिया के तेज गेंदबाज मोहम्मद शमी को पूर्व पत्नी हसीन जहां द्वारा लगाए गए घरेलू हिंसा के आरोप में कोलकाता के अलीपुर कोर्ट में पेश होना पड़ा. एशिया कप टूर्नामेंट खत्म होने के बाद वह सीधा कोलकाता पहुंचे थे. मंगलवार 19 सितंबर को उनकी कोर्ट में पेशी हुई जिसके बाद जमानत मिल गई. अब इस बड़ी रहत के बाद वह ऑस्ट्रेलिया के खिलाफ घर पर होने वाली वनडे सीरीज में खेल सकते हैं. इसके ठीक बाद आईसीसी वनडे वर्ल्ड कप खेला जाना है. क्या है पूरा मामला भारतीय टीम के तेज गेंदबाज मोहम्मद शमी पर उनकी पूर्व पत्नी हसीन जहां ने साल 2018 में घरेलू हिंसा और क्रूरता का मामला दर्ज कराया था. हसीन ने उनके उपर आरोप लगाया गया था कि वह शादी के बाद मारपीट की और घरेलू हिंसा किया करते थे. इस मामले में स्थानीय अलीपुर पुलिस स्टेशन में एफआईआर दर्ज कराई थी. इस मामले में शमी और उनके परिवार जनों से महिला शिकायत सेल ने पूछताछ की गई थी. शमी को जमानत, ऑस्ट्रेलिया के खिलाफ खेलेंगे भारत और ऑस्ट्रेलिया के बीच तीन मैचों की वनडे सीरीज का पहला मुकाबला 22 सितंबर को खेला जाना है. मोहाली को इस मुकाबले की मेजबानी दी गई है. 18 सितंबर को टीम सलेक्शन में शमी का नाम शामिल किया गया था. अब जमानत मिलने के बाद वह प्लेइंग इलेवन का हिस्सा बनने के लिए उपलब्ध होंगे . Tags: Mohammed Shami रिटायरमेंट के बाद रहने की सबसे अच्‍छी जगह, जहां खर्चे कम और सुविधाओं की भरमार, हर कोई बसना चाहेगा यहां हिन्दी के वो 20 शब्द, जो लगते हैं देसी, पर हैं विदेशी! 99 फीसदी लोगों को नहीं होगा पता भूलकर भी घर के आसपास न लगाएं ये 6 पौधे, चुंबक की तरह खिंचे चले आते हैं सांप","pubDate":"2023-09-20 00:13:32","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/09/mohammad-shami-with-jasprit-bumrah-16937564383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"9af02496fbf11810178365e3eaeed97a","title":"Sri Lankan cricketer amongst eight charged by ICC for T10 match-fixing","link":"https://www.ft.lk/sports/Sri-Lankan-cricketer-amongst-eight-charged-by-ICC-for-T10-match-fixing/23-753185","keywords":null,"creator":null,"video_url":null,"description":null,"content":"One cricketer from Sri Lanka is among eight players, officials and team owners charged with breaching various counts of the ICC Anti-Corruption Code during the T10 League. The charges are in relation to the 2021 Abu Dhabi T10 League. The said tournament took place between 19 November 2021 and 4 December 2021. Six teams played in the tournament. They pertain to attempts made to corrupt the matches in the league. These attempts were disrupted. ECB appointed ICC as the Designated Anti-Corruption Official (DACO) for the purposes of the ECB’s Code during the tournament. Thus, ICC are issuing these charges on the ECB’s behalf. The Sri Lankan player charged is Saliya Saman, a 37-year-old all-rounder with 3662 runs (avg. 27.95) and 231 wickets (avg. 25.92) from 101 first-class matches who represented Sri Lanka and U-17 and U-19 cricket and played for Galle CC, Ragama CC, Saracens SC and Lankan CC, and in numerous leagues. Saman’s charges are; Others charged are Bangladesh cricketer Nasir Hossain, domestic player Rizwan Javed, Batting Coach Ashar Zaidi, Assistant Coach Sunny Dhillon, Team Manager Shadab Ahamed, Co-owner of a team Krishan Kumar Chaudhary, and Co-owner of a team Parag Sanghvi. Six of the charged – Krishan Kumar Chaudhary, Parag Sanghvi, Azhar Zaidi, Rizwan Javed, Saliya Saman and Sunny Dhillon – have been provisionally suspended and all have 14 days from 19 September 2023 to respond to the charges.","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8f14f392dff36850328f317471e03e60","title":"Mongolia women cricketers in tears after 15 score at start of Asian Games","link":"https://www.ft.lk/sports/Mongolia-women-cricketers-in-tears-after-15-score-at-start-of-Asian-Games/23-753186","keywords":null,"creator":null,"video_url":null,"description":null,"content":"HANGZHOU, AFP: Mongolia's women's cricket team were in tears after being bowled out for 15 runs in a thrashing by Indonesia on the opening day of action at the Asian Games on Tuesday. The Games in the Chinese city of Hangzhou officially open on Saturday but sports including cricket, volleyball, beach volleyball and football begin before that. Mongolia's women were making their debut at an international tournament and were given a harsh lesson as Indonesia made 187-4 in the Twenty20 preliminary-round match. Indonesia's total included 49 extras, 38 of them wide by the Mongolian bowlers. In reply, an outclassed Mongolia were out for 15 in 10 overs. Mongolia's coach David Talalla said he was proud of his young team – their average age is just 19 – given their very limited resources and experience of the sport. More than half of his players had never even left Mongolia before and this was their first experience of a grass wicket, having been used to an artificial pitch at home. Mongolia's kit is second-hand from Australia, and their four bats were donated by a French ambassador whose wife is English and a cricket fan, said Talalla, who is working for free. “I know we've only made 15 runs but none of our girls have played the game for longer than two years and we know what a technical game it is,” said Talalla. “We've only got a squad of 12 – that's all we could afford to bring,” added Talalla, saying all of his players were in tears afterwards. “The whole idea is the longer picture – cricket in Mongolia, who would have thought it?” he said. “Even myself, I've only been in the job here for five weeks as a high-performance coach but six months ago, I didn't even know they played cricket in Mongolia. “I think most of the world didn't.”","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c1f60f03dc7d044b54afecbcc4f1d616","title":"Lankan women eye Gold at Asian Games cricket","link":"https://www.ft.lk/sports/Lankan-women-eye-Gold-at-Asian-Games-cricket/23-753187","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Sri Lanka women’s cricket team took part in a religious ceremony at Sri Lanka Cricket headquarters prior to their departure for the Asian Games in China yesterday Sri Lanka women cricketers led by Chamari Athapaththu will be walking into uncharted territory when they take strike in China at the 19th Asian Games. The Sri Lanka women’s team returned home on Saturday from a tour of England where they won the WT20I series 2-1 beating the hosts for the first time and losing the WODI series 2-0. “The conditions are going to be totally different, the weather in China is around 30-33 degrees Celsius,” said Sri Lanka women’s cricket team Head Coach Rumesh Ratnayake. “I had a look at the ground on Google and it looks green. At the start, it might be a bit greenish. Even though it is greenish we have to expect the worst. We don’t know whether it will seam or if it's just a showcase green. They have only one ground and four wickets to play 18 (men’s) and 11 (women’s) matches.” All matches for both the men's and women's tournaments will be held at the Zhejiang University of Technology Pingfeng Cricket Field. The matches at the Asian Games will be played in the T20 format and Sri Lanka is riding high having beaten New Zealand and England in a recently concluded series. ‘It would suit the whole subcontinent India, Pakistan, Bangladesh and Sri Lanka. The confidence will be there but we should not be grounded in that confidence and should not be overawed by it. It’s a matter of reminding ourselves you need hard work to get that confidence,” said Ratnayake. “It’s a different game, different teams and different opposition. How we react is the challenge which we have. What we are preparing is to react better. It would be a surprise. When we went to England also it’s our reaction against their bowling and batting. Everybody has to react fast and be prepared for what we expect from them. It’s just confidence.” The chances of Sri Lanka winning a medal? “Our ambition is to win the Gold. To be a part of the Asian Games is a huge privilege. To win the Gold will be the target of many teams.” Sri Lanka who are ranked third after India and Pakistan will go straight into the quarterfinals where they play either Indonesia, Mongolia, Hong Kong or Malaysia on 22 September. The semi-finals are on 24 September and the playoff for the Bronze medal and the Final will be on 25 September. From the 16 players who toured England, Sri Lanka has made two changes to the side picked for the Asian Games. Hansima Karunaratne has to miss out because her name was not included in the Asian Games squad that was picked three months ago, and Kaushini Nuthyangana replaces Kawya Kavindi who has dislocated her left shoulder. – (ST)","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"c372bdc56b985b91bad3f65dc682f8d0","title":"Domestic cricket to resume from Friday","link":"https://www.ft.lk/sports/Domestic-cricket-to-resume-from-Friday/23-753188","keywords":null,"creator":null,"video_url":null,"description":null,"content":"By Sa’adi Thawfeeq All domestic tournaments that were suspended will resume on Friday 22 September. The tournaments came to a grinding halt when Sri Lanka Cricket (SLC) was informed by the Department of Sports Development Director General that they had not received the consent of the Sports Minister before making structural changes to the inter-club three-day tournament ahead of the 2023 season. Although the letter didn’t state to stop the tournaments, the SLC on the advice of their lawyers decided to suspend the tournaments until a clarification was received from the Sports Minister. SLC wrote to the Sports Minister for clarification and last week they had received a letter from the Ministry asking them to continue with the domestic tournaments. Thus the Major Club 3-day League will resume from Friday with a card of 10 matches. The three weekends of matches that could not be played during the period of suspension from 1-3 September, 8-10 September and 15-17 September have been rescheduled for 6-8 October, 13-15 October and 20-22 October with the 4-day final scheduled for 26-29 October. Suspending the tournament was a blessing in disguise for SLC because of the bad weather experienced during the period which would have affected a majority of the matches. The suspension affected several players who banked on their contracts and match fees they received to make a living out of cricket. Clubs who had signed up overseas players to represent them in the tournament were also affected. The bad weather still persists and it is hoped that it will clear by Friday to allow a full game of cricket to be played over the three days.","pubDate":"2023-09-19 23:41:08","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6b6bd13451da67063f5aa70ed97bd771","title":"Asian Games 2023, Women’s Cricket Telecast Channel: Where to watch and live streaming details in India","link":"https://www.sportskeeda.com/cricket/asian-games-2023-women-s-cricket-telecast-channel-where-watch-live-streaming-details-india","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2023-09-19 22:23:01","image_url":"https://staticc.sportskeeda.com/editor/2023/09/8cb04-16951476667108-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c1da79331cfbb3e8a956b2a193ef7643","title":"Asian Games 2023, Men’s Cricket Telecast Channel: Where to watch and live streaming details in India","link":"https://www.sportskeeda.com/cricket/asian-games-2023-men-s-cricket-telecast-channel-where-watch-live-streaming-details-india","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2023-09-19 22:23:01","image_url":"https://staticc.sportskeeda.com/editor/2023/09/4cab8-16951463045130-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"}]}