{"newsArray":[{"title":"Teams convene in Buenos Aires for Americas T20 WC Qualifying","link":"http://island.lk/teams-convene-in-buenos-aires-for-americas-t20-wc-qualifying/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional […]","content":"Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-25 00:01:24","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sahan’s five-wicket haul restricts Thurstan to 186 runs","link":"http://island.lk/sahans-five-wicket-haul-restricts-thurstan-to-186-runs/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"60th Battle of Brothers Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel […]","content":"Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-24 23:40:22","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Oween, Nimuthu score centuries for Petes","link":"http://island.lk/oween-nimuthu-score-centuries-for-petes/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Under 19 Cricket By Reemus Fernando Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on […]","content":"Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-24 23:40:20","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Girls’ team advance to Junior Billie Jean King Cup tournament","link":"http://island.lk/girls-team-advance-to-junior-billie-jean-king-cup-tournament/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to […]","content":"Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday. Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:17","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Brook’s unbeaten 184 turns the tables on New Zealand","link":"http://island.lk/brooks-unbeaten-184-turns-the-tables-on-new-zealand/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"ENGLAND TOUR OF NEW ZEALAND 2023 Harry Brook continued to make Test match batting look easy as the 24-year-old scored his fourth Test hundred in just his sixth appearance in the format on Day 1 in Basin Reserve. Brook was well on course for his maiden double ton but showers in the final session brought […]","content":"Harry Brook continued to make Test match batting look easy as the 24-year-old scored his fourth Test hundred in just his sixth appearance in the format on Day 1 in Basin Reserve. Brook was well on course for his maiden double ton but showers in the final session brought an early end to the day, with the 24-year-old unbeaten on 184 off just 169 balls – including 24 fours and 5 sixes. At the other end, he had Joe Root for company, who notched up his 29th Test hundred. The pair added an undefeated stand worth 294 for the fourth wicket to snatch the momentum away from the home side. New Zealand had a dream start to their quest for series parity as Zak Crawley, Ollie Pope and Ben Duckett were sent packing by the sixth over. But from then on, England’s batting came alive via the fire-and-ice pairing of Brook and Root. New Zealand quicks went full against Brook in search of movement but all they found was the middle of the 24-year-old’s bat, who fearlessly hit through covers and over mid-off and mid-on, sometimes even when Tim Southee had fielders stationed there. Brook’s scintillating approach meant England seamlessly transitioned from being on thin ice to being in control of the proceedings as New Zealand just couldn’t find another breakthrough. Though New Zealand were bolstered by the return of Matt Henry, the bowling attack was still found wanting against England’s expansive ways as the support cast around Henry and Tim Southee failed to put any sort of pressure from either end. Daryl Mitchell and Neil Wagner were taken to the cleaners by Brook, once even with an audacious ramp shot for a six that you seldom see used in this format. Midway through the second session, Brook reached his fourth Test hundred off just 107 deliveries. Despite the green pitch, the conditions eased out rather quickly, paving the way for Brook to bat like only England do in this format. Root had the best seat in the house to watch Brook go about sending New Zealand bowlers on a leather hunt, but he too got adventurous in the final session. Through the first two sessions Root kept his reverse sweep under wraps, considering it led to his dismissal in both innings in the first Test. But when Wagner bowled from round the stumps, Root went for a risky reverse ramp shot over the slip cordon and picked up a boundary to move into the 90s. Right after Root reached his century, rain came down and forced the players off the field. Twice there were hopes of getting the game going again but as soon as the covers were peeled off, another spell of rain arrived. Eventually, no more play was possible. It was the sort of breather New Zealand needed as England finished the day on 315 for 3. New Zealand Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:13","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Karachi likely to host remainder of PSL due to financial dispute","link":"http://island.lk/karachi-likely-to-host-remainder-of-psl-due-to-financial-dispute/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"The remainder of the PSL might be moved in its entirety to Karachi after a financial dispute between the PCB and the interim Punjab government. The decision was to be made following a meeting, chaired on Friday afternoon with all franchise owners. The dispute concerns how to split the security costs of hosting the tournament, […]","content":"The remainder of the PSL might be moved in its entirety to Karachi after a financial dispute between the PCB and the interim Punjab government. The decision was to be made following a meeting, chaired on Friday afternoon with all franchise owners. The dispute concerns how to split the security costs of hosting the tournament, with the interim Punjab government understood to be demanding the PCB to pay PKR 450 million (US $1,723,000 approx.) in security costs to host the tournament in Lahore and Rawalpindi. That amount also includes the costs the government incurred for hosting matches in Multan. The PCB, otherwise, had an agreement to pay only PKR 50 million (US $192,000 approx.) with the previous government, which was dissolved in the last week of January and the board has paid that amount as agreed. According to a PCB official, the Sindh government does not require the PCB to pay a share of the security costs, and only requires remuneration for catering to the security personnel. That cost is understood to be in the region of PKR 30 million (US $115,000 approx.). The PCB is understood to be willing to pay towards catering in Punjab, too, but is reluctant to foot the bill for security, which they consider to be the responsibility of the local government. A PCB official pointed out that the government had picked up the security tab for hosting cricket in the province in the past, too, and that the financial burden of the security costs would be too onerous. If the PCB were required to pay that money, there is understood to be an expectation that the franchise owners, too, would foot part of that bill. Moving the whole tournament to Karachi would, in that event, save both stakeholders money. But the PCB and the franchise owners are not necessarily on the same page. A franchise owner ESPNcricinfo spoke to was against any change of schedule, saying it was inappropriate of the PCB to draw the franchise owners into a disagreement between itself and the Punjab government. They said the PCB had informed the owners of the possible move to Karachi at the last minute in an email, and had not yet formally spoken to them. They appealed to both parties to settle the matter in a way that did not disrupt the schedule of the PSL, believing confining the remainder of the tournament to one city would damage the PSL. Officials in the Punjab government ESPNcricinfo spoke to paint a picture of a dispute that had been in the offing for some time. A senior member of Punjab’s civil service said the government had implored the PCB to share some of the considerable costs of organising security for its premier tournament, pointing out there were three separate venues in Punjab that required security arrangements – Lahore, Rawalpindi and Multan. Sindh, meanwhile, has just one – the National Stadium Karachi. Since cricket returned to Pakistan, Punjab has hosted more PSL and international cricket, with costs adding up over time. It is not clear whether the specifics of the cost split had been ironed out ahead of the PSL, but the wider political context may also have played a part. The Punjab government has seen significant upheaval in the past few months, with Imran Khan’s party, the PTI, resigning its government in Punjab. The PCB had initially sorted out logistical considerations with the PTI’s provincial government in Punjab, with the government reportedly agreeing to pay all security costs. However, with a different setup at the helm since January, it appears certain differences have come to a head. The PCB has called an emergency PSL governing council meeting for Friday afternoon to discuss the various options of who and how to pay the additional cost to the interim Punjab government while also exploring the possibility of moving the remaining 20 matches from Punjab to Sindh and to discuss who will bear the additional cost of relocation. The first 12 matches of the PSL have taken place in Karachi and Multan. The first match in Lahore is scheduled to be held on February 26, with the first game in Rawalpindi to take place on March 1. The playoffs and final – on March 19 – were originally all scheduled for Lahore. ( ) Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Hasaranga out of PSL as Sri Lanka look to manage his workload","link":"http://island.lk/hasaranga-out-of-psl-as-sri-lanka-look-to-manage-his-workload/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Wanindu Hasaranga will not be joining Quetta Gladiators this PSL season as Sri Lanka look to manage his workload. Hasaranga was partially available, having been scheduled to play in six games before leaving on March 3, but the franchise confirmed he has been ruled out of the league altogether and they are now looking for […]","content":"Wanindu Hasaranga will not be joining Quetta Gladiators this PSL season as Sri Lanka look to manage his workload. Hasaranga was partially available, having been scheduled to play in six games before leaving on March 3, but the franchise confirmed he has been ruled out of the league altogether and they are now looking for a replacement. Hasaranga was supposed to join the team at the start of the PSL and after his stint, Afghanistan legspinner Qais Ahmad was slated to take over. But Hasaranga’s absence has forced Gladiators to play Qais in two games, though they remain open to finding a replacement for Hasaranga with seven of their group stages games still remaining. SLC CEO Ashley de Silva told ESPNcricinfo that Hasaranga “wouldn’t ask” for a No-Objection Certificate, as he had domestic commitments with the National Super League, as well as an international series to play in New Zealand. Even though neither SLC nor Hasaranga’s management mentioned it outright, there is also the IPL coming up, which given his success last year and the money he earns at the tournament, is likely to be a priority. Essentially, the issue comes down to workload: the IPL and national duties are an inevitability, and there is significant domestic pressure to play in SLC’s local tournaments, even the four-dayers, leaving the PSL lower down the priority list. Gladiators came into this season in poor form, having lost six games last season. Over the last three seasons, they have the fewest number of wins (10) of all franchises, having not made it into the play-off since 2020. They were edged out last season on net run-rate (-0.708) by Islamabad United (-0.069). They have already lost two games out of the three they played this season. Meanwhile, Kusal Mendis – who was signed up to replace Jordan Cox by Lahore Qalandars – is also now unavailable. Mendis is part of Sri Lanka’s Test outfit, and as such has officially been part of Sri Lanka’s red and white-ball preparations for that tour. His not being part of the PSL despite having been picked by a franchise are clear cut – there is a clash with his international commitments.” Qalandars have found a replacement for Mendis in West Indies ODI captain Shai Hope. This is the second time that Hasaranga has been denied the opportunity to play in a franchise league in the last eight months, after he had to withdraw from his Hundred contract with Manchester Originals at short notice. ( ) Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:09","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"First-ever World Cup final for Proteas Women, thanks to a Brits masterclass","link":"https://www.dailymaverick.co.za/article/2023-02-24-first-ever-world-cup-final-for-proteas-women-thanks-to-a-brits-masterclass/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"South Africa will take on Australia in the final of the T20 World Cup, after the hosts edged England by six runs in the semi-final at Newlands. The post First-ever World Cup final for Proteas Women, thanks to a Brits masterclass appeared first on Daily Maverick.","content":"The Proteas have shaken their semi-final hoodoo to make their first-ever World Cup final, after beating favourites England by six runs at Newlands Cricket Stadium, during the afternoon on Friday 24 February. England were unbeaten in the tournament before their tight semi-final loss, while the Proteas scraped through to the semi-final on net-run rate, and have now beaten the odds to make the final. The home team will face the dominant Aussies in the final of the T20 World Cup on Sunday, 26 February. Opening batter Tazmin Brits scored 68 off 55 deliveries, to help the Proteas to a highly competitive total of 164 for four – their highest total of the tournament. Brits also took four excellent catches in the field, to help dismiss England’s top four batters. While Brits deserves the plaudits, there were a number of players who stood up at vital moments for the Proteas. England were cruising to the required total, and toward a place in the final, before a masterful bowling spell by Nadine de Klerk, an over containing three wickets by Ayabonga Khaka, and a superb fielding display by Anneke Bosch. South Africa celebrate after winning the match during the ICC Women’s T20 World Cup semi-final between South Africa and England at Newlands. (Photo: Ashley Vlotman/Gallo Images) England’s chase could not have gotten off to a better start in their pursuit of a record World Cup knockout chase of 164. And they barely had to work for their runs. In the first two overs, the Proteas conceded five wides, a four off a misfield, as well as four byes. And England were merrily on 21 for no loss, without taking any risks. Because of the free runs, England opening batters Danni Wyatt and Sophia Dunkley were afforded an opportunity to open their shoulders with a decent score on the board, as the pair saw England to 52 for no loss after five overs – going at well above the required rate. But South Africa’s talismanic opening bowler Shabnim Ismail had the final say in the powerplay, with a fiery over – crossing the 120 km/h mark in five balls – of two wickets for two runs, to stunt the England chase. Dunkley was the first dismissal, trying to go over the top, but only managing to lob the ball to Brits at mid-on. Two balls later, Ismail bowled a dangerous bouncer at Alice Capsey’s head, which the 19-year-old could only sky. The ball looked to land safely but Brits stuck out her left hand to complete an incredible catch. “I just reacted and it stuck. They moved me everywhere in the field, and the ball kept following me,” said Brits about her fielding after the match. Tazmin Brits of South Africa celebrates scoring a half-century during the ICC Women’s T20 World Cup semi-final between South Africa and England at Newlands Cricket Ground on February 24, 2023 in Cape Town. (Photo: Ashley Vlotman/Gallo Images) From there, England’s leading batter Natalie Sciver-Brunt and Wyatt put on a steady partnership of 32 off 30 deliveries, to help England to 84 for two after 10 overs. At that stage, England needed just 80 runs off the last 10 overs, with eight wickets in hand. The dangerous Wyatt fell in the 11th over for 34 off 30 deliveries, bowled by Khaka and caught by Brits. While De Klerk was on from the other end, bowling cutters to restrict England. “Credit to South Africa, they bowled brilliantly. They had a simple plan to bowl slower balls, and into the wicket, which seemed to work,” said England captain Heather Knight, after the match. De Klerk’s spell in the middle overs, of four overs for 17 runs and one wicket, was vital for the Proteas to reclaim momentum. Captain Knight and Sciver-Brunt built a solid fourth-wicket partnership of 47 off 35 deliveries, and looked to coast their team home before De Klerk struck the big wicket of the tournament, leading run-scorer Sciver Brunt for 40 off 34 deliveries, including five boundaries. England’s capitulation started there. Khaka bowled a phenomenal 17th over of change-ups and yorkers to take three wickets – that of Amy Jones, Katherine Sciver-Brunt and Sophie Ecclestone – to all but seal the Proteas’ passage to the final. Skipper Knight was still at the crease with her team, needing 25 off the final two overs. She struck a six as Australia took 12 off Marizanne Kapp, and needed 13 off the final over. Ismail made Knight’s stumps cartwheel on the third delivery, to send the crowd into jubilation. Laura Wolvaardt of South Africa during the ICC Women’s T20 World Cup semi-final match between South Africa and England. (Photo: Ashley Vlotman/Gallo Images) Luus’ decision to bat first helped South Africa apply scoreboard pressure on the English. South Africa made a slow and steady start, with openers Laura Wolvaardt and Brits scoring 37 without loss during the powerplay. As in their last group game victory over Bangladesh, their measured approach continued until the 10th over, as the pair reached 67. But, like the victory over the Tigers, they stepped on the accelerator immediately afterwards. Wolvaardt brought up her half-century in the 14th over with one of her trademark strokes – an exquisite lofted-cover drive off the bowling of Ecclestone. Wolvaardt struck five fours and one elegant six in her knock of 53 off 44 balls. The wily Ecclestone had the last laugh though, trapping Wolvaardt with a delivery that gripped, turned and caught her outside edge, which was easily pouched by Charlie Dean at point. Brits was going at a run-a-ball 37 at that point, as she struggled to acclimatise to the pace of the wicket. She finally found her groove in the 16th over, when she tore into Sarah Glenn, smashing 17 runs off the over and bringing up her half-century off 43 deliveries in the process. Brits continued her onslaught and finished with a well-timed 68 off 55 deliveries – which included six fours and two sixes – before fast bowler Lauren Bell got her wicket in the 18th over. South Africa was on track to reach 180 runs before Brits’ dismissal. Ecclestone dragged back the momentum almost single-handedly in the penultimate over of the innings by picking up two scalps. First was big hitter Chloe Tryon, who came and went for three off three, after she holed out at deep-midwicket, tidily caught by Natalie Sciver-Brunt. Next was Nadine de Klerk, who was cleaned up masterfully by Ecclestone two balls later. Ecclestone finished with immaculate figures of three wickets for 22 runs in her four overs. But Kapp sealed the South African innings in style, with two fours off the final two balls by Katherine Sciver-Brunt, as she and captain Luus took 18 off the final over, to help the team to a fantastic 164 for four. The Proteas take on Australia in the final of the Women’s T20 World Cup at Newlands Cricket Stadium, on Sunday 26 February at 3pm. DM","pubDate":"2023-02-24 20:46:12","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas hero Brits in dreamland after semi-final heroics: 'I'm still going to need to wake up'","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-hero-brits-in-dreamland-after-semi-final-heroics-im-still-going-to-need-to-wake-up-20230224","keywords":null,"creator":null,"video_url":null,"description":"Proteas batter Tazmin Brits was emotional as she never imagined producing a match-winning performance to steer South Africa to their first-ever Women's World Cup final.","content":"Proteas batter Tazmin Brits was emotional as she never imagined producing a match-winning performance to steer South Africa to their first-ever ICC Women's World Cup final. Brits had a magical day with the bat and in the field as South Africa booked their place in Sunday's historic Women's T20 World Cup final against Australia. The hosts were underdogs heading into the semi-final but produced a brilliant six-run triumph over England in front of a roaring Newlands crowd. FIRST TAKE | World Cup final Proteas are heroes: Brits, Ismail, Khaka, Wolvaardt... remember the names Brits smashed 68 off 55 balls (hitting six fours and two sixes) before taking four catches. \"I don't know. I still can't believe it, to be honest with you, [it] feels like I'm still going to need to wake up in a sense,\" Brits told reporters on Friday. \"I try not to get too emotional, but yeah, today was very, very special for me.\" Brits' life story is filled with sporting highs and lows as she was once crowned world junior javelin champion at the IAAF Athletics Championships in Ostrava at 16. She was set for the 2012 Olympic Games in London after throwing the qualifying distance before a horrific car accident dashed her dreams. ALSO READ | 'My whole career was ripped underneath me': Proteas star Brits takes unique path to World Cup dream However, Brits found solace in cricket and years later, the now 32-year-old will represent her country in a World Cup final against the defending champions. The Proteas women have gone where no man has gone before, as they became the first senior SA team to reach an ICC World Cup final. Brits admitted that there was always belief in the side as they dispelled the underdog tag with a semi-final upset. \"I think we've always believed that we could do it,\" admitted Brits. \"We are more settled into it (the World Cup). We weren't expecting to be technically where we are now, so it's kind of like the underdog. The underdog ends up making you want to be better, so we just challenged the team and kept going. Sunday's final at Newlands starts at 15:00.","pubDate":"2023-02-24 19:28:00","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"South Africa beat England in Newlands thriller: Pics","link":"https://www.thesouthafrican.com/sport/cricket/proteas/south-africa-beat-england-newlands-thriller-pics-gallery-breaking-24-february-2023/","keywords":["Proteas","Featured","ICC Women’s T20 World Cup","Important","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"South Africa edged England in a thrilling semi-final to reach their first-ever ICC Women’s T20 World Cup final , relive it in pictures.","content":"South Africa edged England to reach their first-ever World Cup final with a six-run win in Cape Town. South Africa win World Cup thriller ALSO READ: How the Proteas beat England to reach T20 World Cup final Tazmin Brits’s 68 set South Africa up for a commanding total of 164 for four, as she combined for a 96-run opening stand with Laura Wolvaardt, with no bowler safe from an onslaught. ALSO READ: England cricketer’s Table Mountain scare – What happened? Brits and Wolvaardt showed none of the nerves on display against Bangladesh as they set the tone for a run-fest at Cape Town. ALSO READ: Women’s T20 World Cup – Record crowds turn up While wickets fell the Proteas kept going. ALSO READ: Kyle Verreynne needs to bin the wicketkeeping gloves ASAP Sophie Ecclestone delivered again in her final over, removing Chloe Tryon for three as she pulled a shot straight to Nat Sciver-Brunt, before Nadine de Klerk departed for a duck two balls later. England fall short England showed they were more than up for the fight as Danni Wyatt and Sophia Dunkley’s fifty partnership arrived after only 28 balls, Dunkley heaving Nonkululeko Mlaba for three fours in a row to bring up the half-century. Shabnim Ismail forced Wyatt into a splice which Brits held onto. Despite having Nat Sciver-Brunt alongside her, Wyatt led the charge as her partner struggled to find the gaps, a fact that became all the more worrying when Wyatt became Brits’s third catch of the innings as she went for 34. Just as soon as she found her form, she was gone, Brits taking another catch as Natalie Sciver-Brunt departed for 40 with England needing 34 from 24 balls. Amy Jones lasted only three balls, Ecclestone two and Katherine Sciver-Brunt only one as Ayabonga Khaka took three wickets in her final over. Proteas make history With 13 needed off the last over, Ismail equalled Anya Shrubsole for most wickets in a T20 World Cup with the wicket of Knight. However, the real prize came three balls later as South Africa sealed their place in the final on Sunday where they will meet holders Australia. CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-24 19:11:16","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Teams convene in Buenos Aires for Americas T20 WC Qualifying","link":"http://island.lk/teams-convene-in-buenos-aires-for-americas-t20-wc-qualifying/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional […]","content":"Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-25 00:01:24","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sahan’s five-wicket haul restricts Thurstan to 186 runs","link":"http://island.lk/sahans-five-wicket-haul-restricts-thurstan-to-186-runs/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"60th Battle of Brothers Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel […]","content":"Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-24 23:40:22","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Oween, Nimuthu score centuries for Petes","link":"http://island.lk/oween-nimuthu-score-centuries-for-petes/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Under 19 Cricket By Reemus Fernando Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on […]","content":"Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-24 23:40:20","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Girls’ team advance to Junior Billie Jean King Cup tournament","link":"http://island.lk/girls-team-advance-to-junior-billie-jean-king-cup-tournament/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to […]","content":"Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday. Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:17","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Brook’s unbeaten 184 turns the tables on New Zealand","link":"http://island.lk/brooks-unbeaten-184-turns-the-tables-on-new-zealand/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"ENGLAND TOUR OF NEW ZEALAND 2023 Harry Brook continued to make Test match batting look easy as the 24-year-old scored his fourth Test hundred in just his sixth appearance in the format on Day 1 in Basin Reserve. Brook was well on course for his maiden double ton but showers in the final session brought […]","content":"Harry Brook continued to make Test match batting look easy as the 24-year-old scored his fourth Test hundred in just his sixth appearance in the format on Day 1 in Basin Reserve. Brook was well on course for his maiden double ton but showers in the final session brought an early end to the day, with the 24-year-old unbeaten on 184 off just 169 balls – including 24 fours and 5 sixes. At the other end, he had Joe Root for company, who notched up his 29th Test hundred. The pair added an undefeated stand worth 294 for the fourth wicket to snatch the momentum away from the home side. New Zealand had a dream start to their quest for series parity as Zak Crawley, Ollie Pope and Ben Duckett were sent packing by the sixth over. But from then on, England’s batting came alive via the fire-and-ice pairing of Brook and Root. New Zealand quicks went full against Brook in search of movement but all they found was the middle of the 24-year-old’s bat, who fearlessly hit through covers and over mid-off and mid-on, sometimes even when Tim Southee had fielders stationed there. Brook’s scintillating approach meant England seamlessly transitioned from being on thin ice to being in control of the proceedings as New Zealand just couldn’t find another breakthrough. Though New Zealand were bolstered by the return of Matt Henry, the bowling attack was still found wanting against England’s expansive ways as the support cast around Henry and Tim Southee failed to put any sort of pressure from either end. Daryl Mitchell and Neil Wagner were taken to the cleaners by Brook, once even with an audacious ramp shot for a six that you seldom see used in this format. Midway through the second session, Brook reached his fourth Test hundred off just 107 deliveries. Despite the green pitch, the conditions eased out rather quickly, paving the way for Brook to bat like only England do in this format. Root had the best seat in the house to watch Brook go about sending New Zealand bowlers on a leather hunt, but he too got adventurous in the final session. Through the first two sessions Root kept his reverse sweep under wraps, considering it led to his dismissal in both innings in the first Test. But when Wagner bowled from round the stumps, Root went for a risky reverse ramp shot over the slip cordon and picked up a boundary to move into the 90s. Right after Root reached his century, rain came down and forced the players off the field. Twice there were hopes of getting the game going again but as soon as the covers were peeled off, another spell of rain arrived. Eventually, no more play was possible. It was the sort of breather New Zealand needed as England finished the day on 315 for 3. New Zealand Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:13","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Karachi likely to host remainder of PSL due to financial dispute","link":"http://island.lk/karachi-likely-to-host-remainder-of-psl-due-to-financial-dispute/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"The remainder of the PSL might be moved in its entirety to Karachi after a financial dispute between the PCB and the interim Punjab government. The decision was to be made following a meeting, chaired on Friday afternoon with all franchise owners. The dispute concerns how to split the security costs of hosting the tournament, […]","content":"The remainder of the PSL might be moved in its entirety to Karachi after a financial dispute between the PCB and the interim Punjab government. The decision was to be made following a meeting, chaired on Friday afternoon with all franchise owners. The dispute concerns how to split the security costs of hosting the tournament, with the interim Punjab government understood to be demanding the PCB to pay PKR 450 million (US $1,723,000 approx.) in security costs to host the tournament in Lahore and Rawalpindi. That amount also includes the costs the government incurred for hosting matches in Multan. The PCB, otherwise, had an agreement to pay only PKR 50 million (US $192,000 approx.) with the previous government, which was dissolved in the last week of January and the board has paid that amount as agreed. According to a PCB official, the Sindh government does not require the PCB to pay a share of the security costs, and only requires remuneration for catering to the security personnel. That cost is understood to be in the region of PKR 30 million (US $115,000 approx.). The PCB is understood to be willing to pay towards catering in Punjab, too, but is reluctant to foot the bill for security, which they consider to be the responsibility of the local government. A PCB official pointed out that the government had picked up the security tab for hosting cricket in the province in the past, too, and that the financial burden of the security costs would be too onerous. If the PCB were required to pay that money, there is understood to be an expectation that the franchise owners, too, would foot part of that bill. Moving the whole tournament to Karachi would, in that event, save both stakeholders money. But the PCB and the franchise owners are not necessarily on the same page. A franchise owner ESPNcricinfo spoke to was against any change of schedule, saying it was inappropriate of the PCB to draw the franchise owners into a disagreement between itself and the Punjab government. They said the PCB had informed the owners of the possible move to Karachi at the last minute in an email, and had not yet formally spoken to them. They appealed to both parties to settle the matter in a way that did not disrupt the schedule of the PSL, believing confining the remainder of the tournament to one city would damage the PSL. Officials in the Punjab government ESPNcricinfo spoke to paint a picture of a dispute that had been in the offing for some time. A senior member of Punjab’s civil service said the government had implored the PCB to share some of the considerable costs of organising security for its premier tournament, pointing out there were three separate venues in Punjab that required security arrangements – Lahore, Rawalpindi and Multan. Sindh, meanwhile, has just one – the National Stadium Karachi. Since cricket returned to Pakistan, Punjab has hosted more PSL and international cricket, with costs adding up over time. It is not clear whether the specifics of the cost split had been ironed out ahead of the PSL, but the wider political context may also have played a part. The Punjab government has seen significant upheaval in the past few months, with Imran Khan’s party, the PTI, resigning its government in Punjab. The PCB had initially sorted out logistical considerations with the PTI’s provincial government in Punjab, with the government reportedly agreeing to pay all security costs. However, with a different setup at the helm since January, it appears certain differences have come to a head. The PCB has called an emergency PSL governing council meeting for Friday afternoon to discuss the various options of who and how to pay the additional cost to the interim Punjab government while also exploring the possibility of moving the remaining 20 matches from Punjab to Sindh and to discuss who will bear the additional cost of relocation. The first 12 matches of the PSL have taken place in Karachi and Multan. The first match in Lahore is scheduled to be held on February 26, with the first game in Rawalpindi to take place on March 1. The playoffs and final – on March 19 – were originally all scheduled for Lahore. ( ) Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Hasaranga out of PSL as Sri Lanka look to manage his workload","link":"http://island.lk/hasaranga-out-of-psl-as-sri-lanka-look-to-manage-his-workload/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Wanindu Hasaranga will not be joining Quetta Gladiators this PSL season as Sri Lanka look to manage his workload. Hasaranga was partially available, having been scheduled to play in six games before leaving on March 3, but the franchise confirmed he has been ruled out of the league altogether and they are now looking for […]","content":"Wanindu Hasaranga will not be joining Quetta Gladiators this PSL season as Sri Lanka look to manage his workload. Hasaranga was partially available, having been scheduled to play in six games before leaving on March 3, but the franchise confirmed he has been ruled out of the league altogether and they are now looking for a replacement. Hasaranga was supposed to join the team at the start of the PSL and after his stint, Afghanistan legspinner Qais Ahmad was slated to take over. But Hasaranga’s absence has forced Gladiators to play Qais in two games, though they remain open to finding a replacement for Hasaranga with seven of their group stages games still remaining. SLC CEO Ashley de Silva told ESPNcricinfo that Hasaranga “wouldn’t ask” for a No-Objection Certificate, as he had domestic commitments with the National Super League, as well as an international series to play in New Zealand. Even though neither SLC nor Hasaranga’s management mentioned it outright, there is also the IPL coming up, which given his success last year and the money he earns at the tournament, is likely to be a priority. Essentially, the issue comes down to workload: the IPL and national duties are an inevitability, and there is significant domestic pressure to play in SLC’s local tournaments, even the four-dayers, leaving the PSL lower down the priority list. Gladiators came into this season in poor form, having lost six games last season. Over the last three seasons, they have the fewest number of wins (10) of all franchises, having not made it into the play-off since 2020. They were edged out last season on net run-rate (-0.708) by Islamabad United (-0.069). They have already lost two games out of the three they played this season. Meanwhile, Kusal Mendis – who was signed up to replace Jordan Cox by Lahore Qalandars – is also now unavailable. Mendis is part of Sri Lanka’s Test outfit, and as such has officially been part of Sri Lanka’s red and white-ball preparations for that tour. His not being part of the PSL despite having been picked by a franchise are clear cut – there is a clash with his international commitments.” Qalandars have found a replacement for Mendis in West Indies ODI captain Shai Hope. This is the second time that Hasaranga has been denied the opportunity to play in a franchise league in the last eight months, after he had to withdraw from his Hundred contract with Manchester Originals at short notice. ( ) Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:09","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"First-ever World Cup final for Proteas Women, thanks to a Brits masterclass","link":"https://www.dailymaverick.co.za/article/2023-02-24-first-ever-world-cup-final-for-proteas-women-thanks-to-a-brits-masterclass/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"South Africa will take on Australia in the final of the T20 World Cup, after the hosts edged England by six runs in the semi-final at Newlands. The post First-ever World Cup final for Proteas Women, thanks to a Brits masterclass appeared first on Daily Maverick.","content":"The Proteas have shaken their semi-final hoodoo to make their first-ever World Cup final, after beating favourites England by six runs at Newlands Cricket Stadium, during the afternoon on Friday 24 February. England were unbeaten in the tournament before their tight semi-final loss, while the Proteas scraped through to the semi-final on net-run rate, and have now beaten the odds to make the final. The home team will face the dominant Aussies in the final of the T20 World Cup on Sunday, 26 February. Opening batter Tazmin Brits scored 68 off 55 deliveries, to help the Proteas to a highly competitive total of 164 for four – their highest total of the tournament. Brits also took four excellent catches in the field, to help dismiss England’s top four batters. While Brits deserves the plaudits, there were a number of players who stood up at vital moments for the Proteas. England were cruising to the required total, and toward a place in the final, before a masterful bowling spell by Nadine de Klerk, an over containing three wickets by Ayabonga Khaka, and a superb fielding display by Anneke Bosch. South Africa celebrate after winning the match during the ICC Women’s T20 World Cup semi-final between South Africa and England at Newlands. (Photo: Ashley Vlotman/Gallo Images) England’s chase could not have gotten off to a better start in their pursuit of a record World Cup knockout chase of 164. And they barely had to work for their runs. In the first two overs, the Proteas conceded five wides, a four off a misfield, as well as four byes. And England were merrily on 21 for no loss, without taking any risks. Because of the free runs, England opening batters Danni Wyatt and Sophia Dunkley were afforded an opportunity to open their shoulders with a decent score on the board, as the pair saw England to 52 for no loss after five overs – going at well above the required rate. But South Africa’s talismanic opening bowler Shabnim Ismail had the final say in the powerplay, with a fiery over – crossing the 120 km/h mark in five balls – of two wickets for two runs, to stunt the England chase. Dunkley was the first dismissal, trying to go over the top, but only managing to lob the ball to Brits at mid-on. Two balls later, Ismail bowled a dangerous bouncer at Alice Capsey’s head, which the 19-year-old could only sky. The ball looked to land safely but Brits stuck out her left hand to complete an incredible catch. “I just reacted and it stuck. They moved me everywhere in the field, and the ball kept following me,” said Brits about her fielding after the match. Tazmin Brits of South Africa celebrates scoring a half-century during the ICC Women’s T20 World Cup semi-final between South Africa and England at Newlands Cricket Ground on February 24, 2023 in Cape Town. (Photo: Ashley Vlotman/Gallo Images) From there, England’s leading batter Natalie Sciver-Brunt and Wyatt put on a steady partnership of 32 off 30 deliveries, to help England to 84 for two after 10 overs. At that stage, England needed just 80 runs off the last 10 overs, with eight wickets in hand. The dangerous Wyatt fell in the 11th over for 34 off 30 deliveries, bowled by Khaka and caught by Brits. While De Klerk was on from the other end, bowling cutters to restrict England. “Credit to South Africa, they bowled brilliantly. They had a simple plan to bowl slower balls, and into the wicket, which seemed to work,” said England captain Heather Knight, after the match. De Klerk’s spell in the middle overs, of four overs for 17 runs and one wicket, was vital for the Proteas to reclaim momentum. Captain Knight and Sciver-Brunt built a solid fourth-wicket partnership of 47 off 35 deliveries, and looked to coast their team home before De Klerk struck the big wicket of the tournament, leading run-scorer Sciver Brunt for 40 off 34 deliveries, including five boundaries. England’s capitulation started there. Khaka bowled a phenomenal 17th over of change-ups and yorkers to take three wickets – that of Amy Jones, Katherine Sciver-Brunt and Sophie Ecclestone – to all but seal the Proteas’ passage to the final. Skipper Knight was still at the crease with her team, needing 25 off the final two overs. She struck a six as Australia took 12 off Marizanne Kapp, and needed 13 off the final over. Ismail made Knight’s stumps cartwheel on the third delivery, to send the crowd into jubilation. Laura Wolvaardt of South Africa during the ICC Women’s T20 World Cup semi-final match between South Africa and England. (Photo: Ashley Vlotman/Gallo Images) Luus’ decision to bat first helped South Africa apply scoreboard pressure on the English. South Africa made a slow and steady start, with openers Laura Wolvaardt and Brits scoring 37 without loss during the powerplay. As in their last group game victory over Bangladesh, their measured approach continued until the 10th over, as the pair reached 67. But, like the victory over the Tigers, they stepped on the accelerator immediately afterwards. Wolvaardt brought up her half-century in the 14th over with one of her trademark strokes – an exquisite lofted-cover drive off the bowling of Ecclestone. Wolvaardt struck five fours and one elegant six in her knock of 53 off 44 balls. The wily Ecclestone had the last laugh though, trapping Wolvaardt with a delivery that gripped, turned and caught her outside edge, which was easily pouched by Charlie Dean at point. Brits was going at a run-a-ball 37 at that point, as she struggled to acclimatise to the pace of the wicket. She finally found her groove in the 16th over, when she tore into Sarah Glenn, smashing 17 runs off the over and bringing up her half-century off 43 deliveries in the process. Brits continued her onslaught and finished with a well-timed 68 off 55 deliveries – which included six fours and two sixes – before fast bowler Lauren Bell got her wicket in the 18th over. South Africa was on track to reach 180 runs before Brits’ dismissal. Ecclestone dragged back the momentum almost single-handedly in the penultimate over of the innings by picking up two scalps. First was big hitter Chloe Tryon, who came and went for three off three, after she holed out at deep-midwicket, tidily caught by Natalie Sciver-Brunt. Next was Nadine de Klerk, who was cleaned up masterfully by Ecclestone two balls later. Ecclestone finished with immaculate figures of three wickets for 22 runs in her four overs. But Kapp sealed the South African innings in style, with two fours off the final two balls by Katherine Sciver-Brunt, as she and captain Luus took 18 off the final over, to help the team to a fantastic 164 for four. The Proteas take on Australia in the final of the Women’s T20 World Cup at Newlands Cricket Stadium, on Sunday 26 February at 3pm. DM","pubDate":"2023-02-24 20:46:12","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas hero Brits in dreamland after semi-final heroics: 'I'm still going to need to wake up'","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-hero-brits-in-dreamland-after-semi-final-heroics-im-still-going-to-need-to-wake-up-20230224","keywords":null,"creator":null,"video_url":null,"description":"Proteas batter Tazmin Brits was emotional as she never imagined producing a match-winning performance to steer South Africa to their first-ever Women's World Cup final.","content":"Proteas batter Tazmin Brits was emotional as she never imagined producing a match-winning performance to steer South Africa to their first-ever ICC Women's World Cup final. Brits had a magical day with the bat and in the field as South Africa booked their place in Sunday's historic Women's T20 World Cup final against Australia. The hosts were underdogs heading into the semi-final but produced a brilliant six-run triumph over England in front of a roaring Newlands crowd. FIRST TAKE | World Cup final Proteas are heroes: Brits, Ismail, Khaka, Wolvaardt... remember the names Brits smashed 68 off 55 balls (hitting six fours and two sixes) before taking four catches. \"I don't know. I still can't believe it, to be honest with you, [it] feels like I'm still going to need to wake up in a sense,\" Brits told reporters on Friday. \"I try not to get too emotional, but yeah, today was very, very special for me.\" Brits' life story is filled with sporting highs and lows as she was once crowned world junior javelin champion at the IAAF Athletics Championships in Ostrava at 16. She was set for the 2012 Olympic Games in London after throwing the qualifying distance before a horrific car accident dashed her dreams. ALSO READ | 'My whole career was ripped underneath me': Proteas star Brits takes unique path to World Cup dream However, Brits found solace in cricket and years later, the now 32-year-old will represent her country in a World Cup final against the defending champions. The Proteas women have gone where no man has gone before, as they became the first senior SA team to reach an ICC World Cup final. Brits admitted that there was always belief in the side as they dispelled the underdog tag with a semi-final upset. \"I think we've always believed that we could do it,\" admitted Brits. \"We are more settled into it (the World Cup). We weren't expecting to be technically where we are now, so it's kind of like the underdog. The underdog ends up making you want to be better, so we just challenged the team and kept going. Sunday's final at Newlands starts at 15:00.","pubDate":"2023-02-24 19:28:00","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"South Africa beat England in Newlands thriller: Pics","link":"https://www.thesouthafrican.com/sport/cricket/proteas/south-africa-beat-england-newlands-thriller-pics-gallery-breaking-24-february-2023/","keywords":["Proteas","Featured","ICC Women’s T20 World Cup","Important","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"South Africa edged England in a thrilling semi-final to reach their first-ever ICC Women’s T20 World Cup final , relive it in pictures.","content":"South Africa edged England to reach their first-ever World Cup final with a six-run win in Cape Town. South Africa win World Cup thriller ALSO READ: How the Proteas beat England to reach T20 World Cup final Tazmin Brits’s 68 set South Africa up for a commanding total of 164 for four, as she combined for a 96-run opening stand with Laura Wolvaardt, with no bowler safe from an onslaught. ALSO READ: England cricketer’s Table Mountain scare – What happened? Brits and Wolvaardt showed none of the nerves on display against Bangladesh as they set the tone for a run-fest at Cape Town. ALSO READ: Women’s T20 World Cup – Record crowds turn up While wickets fell the Proteas kept going. ALSO READ: Kyle Verreynne needs to bin the wicketkeeping gloves ASAP Sophie Ecclestone delivered again in her final over, removing Chloe Tryon for three as she pulled a shot straight to Nat Sciver-Brunt, before Nadine de Klerk departed for a duck two balls later. England fall short England showed they were more than up for the fight as Danni Wyatt and Sophia Dunkley’s fifty partnership arrived after only 28 balls, Dunkley heaving Nonkululeko Mlaba for three fours in a row to bring up the half-century. Shabnim Ismail forced Wyatt into a splice which Brits held onto. Despite having Nat Sciver-Brunt alongside her, Wyatt led the charge as her partner struggled to find the gaps, a fact that became all the more worrying when Wyatt became Brits’s third catch of the innings as she went for 34. Just as soon as she found her form, she was gone, Brits taking another catch as Natalie Sciver-Brunt departed for 40 with England needing 34 from 24 balls. Amy Jones lasted only three balls, Ecclestone two and Katherine Sciver-Brunt only one as Ayabonga Khaka took three wickets in her final over. Proteas make history With 13 needed off the last over, Ismail equalled Anya Shrubsole for most wickets in a T20 World Cup with the wicket of Knight. However, the real prize came three balls later as South Africa sealed their place in the final on Sunday where they will meet holders Australia. CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-24 19:11:16","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Teams convene in Buenos Aires for Americas T20 WC Qualifying","link":"http://island.lk/teams-convene-in-buenos-aires-for-americas-t20-wc-qualifying/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional […]","content":"Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-25 00:01:24","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sahan’s five-wicket haul restricts Thurstan to 186 runs","link":"http://island.lk/sahans-five-wicket-haul-restricts-thurstan-to-186-runs/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"60th Battle of Brothers Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel […]","content":"Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-24 23:40:22","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Oween, Nimuthu score centuries for Petes","link":"http://island.lk/oween-nimuthu-score-centuries-for-petes/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Under 19 Cricket By Reemus Fernando Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on […]","content":"Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday.","pubDate":"2023-02-24 23:40:20","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Girls’ team advance to Junior Billie Jean King Cup tournament","link":"http://island.lk/girls-team-advance-to-junior-billie-jean-king-cup-tournament/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to […]","content":"Sri Lanka girls’ team qualified for the Junior Billie Jean King Cup tournament as they won their semi-final at the pre-qualifying tournament continued at the Sri Lanka Tennis Association courts on Friday. While the hosts’ boys’ team lost their semi-final of the Junior Davis Cup qualifying event held at the same venue, girls cruised to 2-1 victory over Turkmenistan to secure a place in the final and qualify for the tournament proper. In the first girls’ singles, Dinara de Silva beat Meyriam Mijahammedova 6-2, 7-5, before teaming up with Inuki Jayaweera to win the doubles event. In the second singles match, the latter lost 6-2, 6-2 to Aisha Bikabulatova. In the semi-final of the boys’ Junior Davis Cup qualifying tournament Indonesia disappointed Sri Lanka by securing a 2-1 victory. Methwan Wijemanne was the sole winner for Sri Lanka in the boys’ semi-final yesterday. Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:17","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Brook’s unbeaten 184 turns the tables on New Zealand","link":"http://island.lk/brooks-unbeaten-184-turns-the-tables-on-new-zealand/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"ENGLAND TOUR OF NEW ZEALAND 2023 Harry Brook continued to make Test match batting look easy as the 24-year-old scored his fourth Test hundred in just his sixth appearance in the format on Day 1 in Basin Reserve. Brook was well on course for his maiden double ton but showers in the final session brought […]","content":"Harry Brook continued to make Test match batting look easy as the 24-year-old scored his fourth Test hundred in just his sixth appearance in the format on Day 1 in Basin Reserve. Brook was well on course for his maiden double ton but showers in the final session brought an early end to the day, with the 24-year-old unbeaten on 184 off just 169 balls – including 24 fours and 5 sixes. At the other end, he had Joe Root for company, who notched up his 29th Test hundred. The pair added an undefeated stand worth 294 for the fourth wicket to snatch the momentum away from the home side. New Zealand had a dream start to their quest for series parity as Zak Crawley, Ollie Pope and Ben Duckett were sent packing by the sixth over. But from then on, England’s batting came alive via the fire-and-ice pairing of Brook and Root. New Zealand quicks went full against Brook in search of movement but all they found was the middle of the 24-year-old’s bat, who fearlessly hit through covers and over mid-off and mid-on, sometimes even when Tim Southee had fielders stationed there. Brook’s scintillating approach meant England seamlessly transitioned from being on thin ice to being in control of the proceedings as New Zealand just couldn’t find another breakthrough. Though New Zealand were bolstered by the return of Matt Henry, the bowling attack was still found wanting against England’s expansive ways as the support cast around Henry and Tim Southee failed to put any sort of pressure from either end. Daryl Mitchell and Neil Wagner were taken to the cleaners by Brook, once even with an audacious ramp shot for a six that you seldom see used in this format. Midway through the second session, Brook reached his fourth Test hundred off just 107 deliveries. Despite the green pitch, the conditions eased out rather quickly, paving the way for Brook to bat like only England do in this format. Root had the best seat in the house to watch Brook go about sending New Zealand bowlers on a leather hunt, but he too got adventurous in the final session. Through the first two sessions Root kept his reverse sweep under wraps, considering it led to his dismissal in both innings in the first Test. But when Wagner bowled from round the stumps, Root went for a risky reverse ramp shot over the slip cordon and picked up a boundary to move into the 90s. Right after Root reached his century, rain came down and forced the players off the field. Twice there were hopes of getting the game going again but as soon as the covers were peeled off, another spell of rain arrived. Eventually, no more play was possible. It was the sort of breather New Zealand needed as England finished the day on 315 for 3. New Zealand Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:13","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Karachi likely to host remainder of PSL due to financial dispute","link":"http://island.lk/karachi-likely-to-host-remainder-of-psl-due-to-financial-dispute/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"The remainder of the PSL might be moved in its entirety to Karachi after a financial dispute between the PCB and the interim Punjab government. The decision was to be made following a meeting, chaired on Friday afternoon with all franchise owners. The dispute concerns how to split the security costs of hosting the tournament, […]","content":"The remainder of the PSL might be moved in its entirety to Karachi after a financial dispute between the PCB and the interim Punjab government. The decision was to be made following a meeting, chaired on Friday afternoon with all franchise owners. The dispute concerns how to split the security costs of hosting the tournament, with the interim Punjab government understood to be demanding the PCB to pay PKR 450 million (US $1,723,000 approx.) in security costs to host the tournament in Lahore and Rawalpindi. That amount also includes the costs the government incurred for hosting matches in Multan. The PCB, otherwise, had an agreement to pay only PKR 50 million (US $192,000 approx.) with the previous government, which was dissolved in the last week of January and the board has paid that amount as agreed. According to a PCB official, the Sindh government does not require the PCB to pay a share of the security costs, and only requires remuneration for catering to the security personnel. That cost is understood to be in the region of PKR 30 million (US $115,000 approx.). The PCB is understood to be willing to pay towards catering in Punjab, too, but is reluctant to foot the bill for security, which they consider to be the responsibility of the local government. A PCB official pointed out that the government had picked up the security tab for hosting cricket in the province in the past, too, and that the financial burden of the security costs would be too onerous. If the PCB were required to pay that money, there is understood to be an expectation that the franchise owners, too, would foot part of that bill. Moving the whole tournament to Karachi would, in that event, save both stakeholders money. But the PCB and the franchise owners are not necessarily on the same page. A franchise owner ESPNcricinfo spoke to was against any change of schedule, saying it was inappropriate of the PCB to draw the franchise owners into a disagreement between itself and the Punjab government. They said the PCB had informed the owners of the possible move to Karachi at the last minute in an email, and had not yet formally spoken to them. They appealed to both parties to settle the matter in a way that did not disrupt the schedule of the PSL, believing confining the remainder of the tournament to one city would damage the PSL. Officials in the Punjab government ESPNcricinfo spoke to paint a picture of a dispute that had been in the offing for some time. A senior member of Punjab’s civil service said the government had implored the PCB to share some of the considerable costs of organising security for its premier tournament, pointing out there were three separate venues in Punjab that required security arrangements – Lahore, Rawalpindi and Multan. Sindh, meanwhile, has just one – the National Stadium Karachi. Since cricket returned to Pakistan, Punjab has hosted more PSL and international cricket, with costs adding up over time. It is not clear whether the specifics of the cost split had been ironed out ahead of the PSL, but the wider political context may also have played a part. The Punjab government has seen significant upheaval in the past few months, with Imran Khan’s party, the PTI, resigning its government in Punjab. The PCB had initially sorted out logistical considerations with the PTI’s provincial government in Punjab, with the government reportedly agreeing to pay all security costs. However, with a different setup at the helm since January, it appears certain differences have come to a head. The PCB has called an emergency PSL governing council meeting for Friday afternoon to discuss the various options of who and how to pay the additional cost to the interim Punjab government while also exploring the possibility of moving the remaining 20 matches from Punjab to Sindh and to discuss who will bear the additional cost of relocation. The first 12 matches of the PSL have taken place in Karachi and Multan. The first match in Lahore is scheduled to be held on February 26, with the first game in Rawalpindi to take place on March 1. The playoffs and final – on March 19 – were originally all scheduled for Lahore. ( ) Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:10","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Hasaranga out of PSL as Sri Lanka look to manage his workload","link":"http://island.lk/hasaranga-out-of-psl-as-sri-lanka-look-to-manage-his-workload/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Wanindu Hasaranga will not be joining Quetta Gladiators this PSL season as Sri Lanka look to manage his workload. Hasaranga was partially available, having been scheduled to play in six games before leaving on March 3, but the franchise confirmed he has been ruled out of the league altogether and they are now looking for […]","content":"Wanindu Hasaranga will not be joining Quetta Gladiators this PSL season as Sri Lanka look to manage his workload. Hasaranga was partially available, having been scheduled to play in six games before leaving on March 3, but the franchise confirmed he has been ruled out of the league altogether and they are now looking for a replacement. Hasaranga was supposed to join the team at the start of the PSL and after his stint, Afghanistan legspinner Qais Ahmad was slated to take over. But Hasaranga’s absence has forced Gladiators to play Qais in two games, though they remain open to finding a replacement for Hasaranga with seven of their group stages games still remaining. SLC CEO Ashley de Silva told ESPNcricinfo that Hasaranga “wouldn’t ask” for a No-Objection Certificate, as he had domestic commitments with the National Super League, as well as an international series to play in New Zealand. Even though neither SLC nor Hasaranga’s management mentioned it outright, there is also the IPL coming up, which given his success last year and the money he earns at the tournament, is likely to be a priority. Essentially, the issue comes down to workload: the IPL and national duties are an inevitability, and there is significant domestic pressure to play in SLC’s local tournaments, even the four-dayers, leaving the PSL lower down the priority list. Gladiators came into this season in poor form, having lost six games last season. Over the last three seasons, they have the fewest number of wins (10) of all franchises, having not made it into the play-off since 2020. They were edged out last season on net run-rate (-0.708) by Islamabad United (-0.069). They have already lost two games out of the three they played this season. Meanwhile, Kusal Mendis – who was signed up to replace Jordan Cox by Lahore Qalandars – is also now unavailable. Mendis is part of Sri Lanka’s Test outfit, and as such has officially been part of Sri Lanka’s red and white-ball preparations for that tour. His not being part of the PSL despite having been picked by a franchise are clear cut – there is a clash with his international commitments.” Qalandars have found a replacement for Mendis in West Indies ODI captain Shai Hope. This is the second time that Hasaranga has been denied the opportunity to play in a franchise league in the last eight months, after he had to withdraw from his Hundred contract with Manchester Originals at short notice. ( ) Published on By Qualification for the 2024 T20 World Cup resumes in Buenos Aires on Saturday (February 25) as six teams gather in the Argentine capital to contest the Americas Sub-Regional Qualifier T20. Hosts Argentina are joined by Bermuda, The Bahamas, Belize, Cayman Islands and Panama to vie for three qualifier berths alongside Canada at the Americas regional finals, one step away from the T20 World Cup. With the United States automatically qualifying for the 2024 World Cup as co-hosts with the West Indies, combined with the replacement of the Global Qualifier with direct regional qualification, the path to the ICC’s pinnacle T20 event is less arduous than usual for lower-ranked Americas Associates. For the three teams winning through this tournament, a turn on the global stage will be just one step away as they head to the Regional Final in Bermuda at the end of September. Though there will be only one qualification spot on offer at the regional final and Canada remain firm favourites to take it, for the six teams in Buenos Aires this cycle represents a rare opportunity to make a bid for World Cup qualification should they secure a podium finish this week. In the absence of Brazil and Suriname, both of whom pulled out of the tournament, the six teams will compete in a single group, playing a simple round robin with the top three sides on the table progressing to join Canada at the four-team regional final. The only team at the tournament with a World Cup pedigree, Bermuda have slipped back into the pack somewhat since their heyday, but remain overwhelming favourites to win the tournament. Convincing wins over the hosts in two warm-up matches ahead of the tournament underlined their status, with Delray Rawlins and Kamau Leverock especially looking a cut above the grade. Argentina will fancy their chances of a top-three finish, with home conditions in their favour and a recent winning record over most of the rest of the field. An exception there is the returning Cayman Islands side however, Raymon Sealy’s team having a strong claim to the title of “best of the rest” in the region behind the USA, Canada and Bermuda. A five-nothing whitewash at the hands of the Caymans in their most recent competitive outing last year suggests that the Bahamas will be outsiders to progress, though if skipper Marc Taylor or Kervon Hinds fire they may have the next best shot at a podium finish. Belize and Panama both start as underdogs, despite boasting potentially match-winners in the likes of Bernan Stephenson or Irfan Hafejee respectively, neither have yet been able to consistently compete at regional level. Published on By Paceman Sahan Viraj came up with a five-wicket haul as Isipatana restricted their arch-rivals Thurstan to 186 runs on day one of the 60th Battle of Brothers Big Match at the SSC ground on Friday. Viraj justified the decision to bowl first as he joined Naveen Kanishka and Kevin Samuel to trouble Thurstan top and middle-order batsmen. Thurstan lost their first five wickets before lunch for the addition of 107 runs. Faced with the danger of getting bundled out for a low score Thanuja Rajapaksha and Ushan Imesh struck half-centuries to reach their eventual total. In their essay, Isipatana were 102 for two wickets at stumps with Tharushka Ashel and Yesith Kalupahana adding an unbroken stand of 71 runs for the third wicket. Published on By Ananda record a morale boosting victory against Dharmaraja, while centuries by Oween Salgado and Nimuthu Gunawardena for St. peter’s and a back to the wall knock of 81 runs by Sukitha Dewthilina for Moratu Vidyalaya were the batting highlights of the Under 19 cricket encounters continued on Friday. After suffering several defeats on the trot Ananda registered a victory ahead of their Big Match. At Galle, Sukitha Dewthilina helped Morau Vidyalaya salvage pride against Mahinda as he anchored the tail with an unbeaten 81 runs (in 192 balls) for them to post 168 runs after being 60 for six wickets overnight. His innings helped them bat for 84 overs. Ananda beat Dharmaraja by nine wickets at Ananda Mawatha Maris Stella post 236 for nine wickets against Richmond at Dombagoda St. Peter’s 366, St. Sebastian’s 27/0 at Bambalapitiya 9 overs Trinity post 209 against S. Thomas’ at Mount Lavinia Nalanda dominate proceedings at Pannipitiya","pubDate":"2023-02-24 23:40:09","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"First-ever World Cup final for Proteas Women, thanks to a Brits masterclass","link":"https://www.dailymaverick.co.za/article/2023-02-24-first-ever-world-cup-final-for-proteas-women-thanks-to-a-brits-masterclass/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"South Africa will take on Australia in the final of the T20 World Cup, after the hosts edged England by six runs in the semi-final at Newlands. The post First-ever World Cup final for Proteas Women, thanks to a Brits masterclass appeared first on Daily Maverick.","content":"The Proteas have shaken their semi-final hoodoo to make their first-ever World Cup final, after beating favourites England by six runs at Newlands Cricket Stadium, during the afternoon on Friday 24 February. England were unbeaten in the tournament before their tight semi-final loss, while the Proteas scraped through to the semi-final on net-run rate, and have now beaten the odds to make the final. The home team will face the dominant Aussies in the final of the T20 World Cup on Sunday, 26 February. Opening batter Tazmin Brits scored 68 off 55 deliveries, to help the Proteas to a highly competitive total of 164 for four – their highest total of the tournament. Brits also took four excellent catches in the field, to help dismiss England’s top four batters. While Brits deserves the plaudits, there were a number of players who stood up at vital moments for the Proteas. England were cruising to the required total, and toward a place in the final, before a masterful bowling spell by Nadine de Klerk, an over containing three wickets by Ayabonga Khaka, and a superb fielding display by Anneke Bosch. South Africa celebrate after winning the match during the ICC Women’s T20 World Cup semi-final between South Africa and England at Newlands. (Photo: Ashley Vlotman/Gallo Images) England’s chase could not have gotten off to a better start in their pursuit of a record World Cup knockout chase of 164. And they barely had to work for their runs. In the first two overs, the Proteas conceded five wides, a four off a misfield, as well as four byes. And England were merrily on 21 for no loss, without taking any risks. Because of the free runs, England opening batters Danni Wyatt and Sophia Dunkley were afforded an opportunity to open their shoulders with a decent score on the board, as the pair saw England to 52 for no loss after five overs – going at well above the required rate. But South Africa’s talismanic opening bowler Shabnim Ismail had the final say in the powerplay, with a fiery over – crossing the 120 km/h mark in five balls – of two wickets for two runs, to stunt the England chase. Dunkley was the first dismissal, trying to go over the top, but only managing to lob the ball to Brits at mid-on. Two balls later, Ismail bowled a dangerous bouncer at Alice Capsey’s head, which the 19-year-old could only sky. The ball looked to land safely but Brits stuck out her left hand to complete an incredible catch. “I just reacted and it stuck. They moved me everywhere in the field, and the ball kept following me,” said Brits about her fielding after the match. Tazmin Brits of South Africa celebrates scoring a half-century during the ICC Women’s T20 World Cup semi-final between South Africa and England at Newlands Cricket Ground on February 24, 2023 in Cape Town. (Photo: Ashley Vlotman/Gallo Images) From there, England’s leading batter Natalie Sciver-Brunt and Wyatt put on a steady partnership of 32 off 30 deliveries, to help England to 84 for two after 10 overs. At that stage, England needed just 80 runs off the last 10 overs, with eight wickets in hand. The dangerous Wyatt fell in the 11th over for 34 off 30 deliveries, bowled by Khaka and caught by Brits. While De Klerk was on from the other end, bowling cutters to restrict England. “Credit to South Africa, they bowled brilliantly. They had a simple plan to bowl slower balls, and into the wicket, which seemed to work,” said England captain Heather Knight, after the match. De Klerk’s spell in the middle overs, of four overs for 17 runs and one wicket, was vital for the Proteas to reclaim momentum. Captain Knight and Sciver-Brunt built a solid fourth-wicket partnership of 47 off 35 deliveries, and looked to coast their team home before De Klerk struck the big wicket of the tournament, leading run-scorer Sciver Brunt for 40 off 34 deliveries, including five boundaries. England’s capitulation started there. Khaka bowled a phenomenal 17th over of change-ups and yorkers to take three wickets – that of Amy Jones, Katherine Sciver-Brunt and Sophie Ecclestone – to all but seal the Proteas’ passage to the final. Skipper Knight was still at the crease with her team, needing 25 off the final two overs. She struck a six as Australia took 12 off Marizanne Kapp, and needed 13 off the final over. Ismail made Knight’s stumps cartwheel on the third delivery, to send the crowd into jubilation. Laura Wolvaardt of South Africa during the ICC Women’s T20 World Cup semi-final match between South Africa and England. (Photo: Ashley Vlotman/Gallo Images) Luus’ decision to bat first helped South Africa apply scoreboard pressure on the English. South Africa made a slow and steady start, with openers Laura Wolvaardt and Brits scoring 37 without loss during the powerplay. As in their last group game victory over Bangladesh, their measured approach continued until the 10th over, as the pair reached 67. But, like the victory over the Tigers, they stepped on the accelerator immediately afterwards. Wolvaardt brought up her half-century in the 14th over with one of her trademark strokes – an exquisite lofted-cover drive off the bowling of Ecclestone. Wolvaardt struck five fours and one elegant six in her knock of 53 off 44 balls. The wily Ecclestone had the last laugh though, trapping Wolvaardt with a delivery that gripped, turned and caught her outside edge, which was easily pouched by Charlie Dean at point. Brits was going at a run-a-ball 37 at that point, as she struggled to acclimatise to the pace of the wicket. She finally found her groove in the 16th over, when she tore into Sarah Glenn, smashing 17 runs off the over and bringing up her half-century off 43 deliveries in the process. Brits continued her onslaught and finished with a well-timed 68 off 55 deliveries – which included six fours and two sixes – before fast bowler Lauren Bell got her wicket in the 18th over. South Africa was on track to reach 180 runs before Brits’ dismissal. Ecclestone dragged back the momentum almost single-handedly in the penultimate over of the innings by picking up two scalps. First was big hitter Chloe Tryon, who came and went for three off three, after she holed out at deep-midwicket, tidily caught by Natalie Sciver-Brunt. Next was Nadine de Klerk, who was cleaned up masterfully by Ecclestone two balls later. Ecclestone finished with immaculate figures of three wickets for 22 runs in her four overs. But Kapp sealed the South African innings in style, with two fours off the final two balls by Katherine Sciver-Brunt, as she and captain Luus took 18 off the final over, to help the team to a fantastic 164 for four. The Proteas take on Australia in the final of the Women’s T20 World Cup at Newlands Cricket Stadium, on Sunday 26 February at 3pm. DM","pubDate":"2023-02-24 20:46:12","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas hero Brits in dreamland after semi-final heroics: 'I'm still going to need to wake up'","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-hero-brits-in-dreamland-after-semi-final-heroics-im-still-going-to-need-to-wake-up-20230224","keywords":null,"creator":null,"video_url":null,"description":"Proteas batter Tazmin Brits was emotional as she never imagined producing a match-winning performance to steer South Africa to their first-ever Women's World Cup final.","content":"Proteas batter Tazmin Brits was emotional as she never imagined producing a match-winning performance to steer South Africa to their first-ever ICC Women's World Cup final. Brits had a magical day with the bat and in the field as South Africa booked their place in Sunday's historic Women's T20 World Cup final against Australia. The hosts were underdogs heading into the semi-final but produced a brilliant six-run triumph over England in front of a roaring Newlands crowd. FIRST TAKE | World Cup final Proteas are heroes: Brits, Ismail, Khaka, Wolvaardt... remember the names Brits smashed 68 off 55 balls (hitting six fours and two sixes) before taking four catches. \"I don't know. I still can't believe it, to be honest with you, [it] feels like I'm still going to need to wake up in a sense,\" Brits told reporters on Friday. \"I try not to get too emotional, but yeah, today was very, very special for me.\" Brits' life story is filled with sporting highs and lows as she was once crowned world junior javelin champion at the IAAF Athletics Championships in Ostrava at 16. She was set for the 2012 Olympic Games in London after throwing the qualifying distance before a horrific car accident dashed her dreams. ALSO READ | 'My whole career was ripped underneath me': Proteas star Brits takes unique path to World Cup dream However, Brits found solace in cricket and years later, the now 32-year-old will represent her country in a World Cup final against the defending champions. The Proteas women have gone where no man has gone before, as they became the first senior SA team to reach an ICC World Cup final. Brits admitted that there was always belief in the side as they dispelled the underdog tag with a semi-final upset. \"I think we've always believed that we could do it,\" admitted Brits. \"We are more settled into it (the World Cup). We weren't expecting to be technically where we are now, so it's kind of like the underdog. The underdog ends up making you want to be better, so we just challenged the team and kept going. Sunday's final at Newlands starts at 15:00.","pubDate":"2023-02-24 19:28:00","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"South Africa beat England in Newlands thriller: Pics","link":"https://www.thesouthafrican.com/sport/cricket/proteas/south-africa-beat-england-newlands-thriller-pics-gallery-breaking-24-february-2023/","keywords":["Proteas","Featured","ICC Women’s T20 World Cup","Important","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"South Africa edged England in a thrilling semi-final to reach their first-ever ICC Women’s T20 World Cup final , relive it in pictures.","content":"South Africa edged England to reach their first-ever World Cup final with a six-run win in Cape Town. South Africa win World Cup thriller ALSO READ: How the Proteas beat England to reach T20 World Cup final Tazmin Brits’s 68 set South Africa up for a commanding total of 164 for four, as she combined for a 96-run opening stand with Laura Wolvaardt, with no bowler safe from an onslaught. ALSO READ: England cricketer’s Table Mountain scare – What happened? Brits and Wolvaardt showed none of the nerves on display against Bangladesh as they set the tone for a run-fest at Cape Town. ALSO READ: Women’s T20 World Cup – Record crowds turn up While wickets fell the Proteas kept going. ALSO READ: Kyle Verreynne needs to bin the wicketkeeping gloves ASAP Sophie Ecclestone delivered again in her final over, removing Chloe Tryon for three as she pulled a shot straight to Nat Sciver-Brunt, before Nadine de Klerk departed for a duck two balls later. England fall short England showed they were more than up for the fight as Danni Wyatt and Sophia Dunkley’s fifty partnership arrived after only 28 balls, Dunkley heaving Nonkululeko Mlaba for three fours in a row to bring up the half-century. Shabnim Ismail forced Wyatt into a splice which Brits held onto. Despite having Nat Sciver-Brunt alongside her, Wyatt led the charge as her partner struggled to find the gaps, a fact that became all the more worrying when Wyatt became Brits’s third catch of the innings as she went for 34. Just as soon as she found her form, she was gone, Brits taking another catch as Natalie Sciver-Brunt departed for 40 with England needing 34 from 24 balls. Amy Jones lasted only three balls, Ecclestone two and Katherine Sciver-Brunt only one as Ayabonga Khaka took three wickets in her final over. Proteas make history With 13 needed off the last over, Ismail equalled Anya Shrubsole for most wickets in a T20 World Cup with the wicket of Knight. However, the real prize came three balls later as South Africa sealed their place in the final on Sunday where they will meet holders Australia. CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-24 19:11:16","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"}]}