{"newsArray":[{"title":"‘We can challenge’: Aussie Test rival’s vow","link":"https://www.couriermail.com.au/sport/cricket/test-series-south-africas-best-bowling-attack-coming-to-australia/news-story/1930c49e2eb67fa2f0fd323195adbc6b","keywords":["Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"South Africa will bring one of the strongest bowling attacks in Test cricket to Australia this summer after naming a near full-strength squad for the three-Test showdown.","content":"The series will be the first Test matches between the two nations since the sandpaper scandal rocked the Australian tour of South Africa in 2018. It’s also the first Test series between the two nations in Australia for six years, the last coming when South Africa famously rolled the hosts for 85 on a green Hobart wicket that cost several players their Test spots before the tourists went on to win 2-1. Top-order batter Keegan Petersen is the only first-choice player not available due to a hamstring injury, but the full battery of fast bowlers will be coming to provide the Australian batting line-up a significant test. Kagiso Rabada, ﻿Marco Jansen, Lungi Ngidi and Anrich Nortje, who was named in the T20 World Cup team of the tournament, all made it through unscathed and were included in the 16-man squad named by South African selectors. Dean Elgar will captain South Africa, and in a big boost for the visitors, key batter Rassie van der Dussen has recovered from the finger injury that ended his tour of England in July. “We are pleased with the group of players that have been assembled for this tour. I think the selectors now have a core group of Proteas that has been built and it is just about building on what we have,” South African selection boss Victor Mpitsang said.“Overall, all the players selected undoubtedly have the ability to play at the highest level, and evidence of that is our standing on the ICC World Test Championship table.“We are confident that if they play to their ability, we can challenge Australia in their conditions.”South Africa has won the past three Test series in Australia, with the host nation having won just two of the past nine clashes at home between the two countries. But the tourists will present a different looking team from the last time they met in 2018, having blooded eight debutants in the last 18 months. Only four players – Dean Elgar, Temba Bavuma, Kagiso Rabada and spinner Keshav Maharaj – survive from the 2018 meeting. Australia is on top of the World Test Championship, with South Africa second. A series win could guarantee Australia a spot in next year’s final at Lord’s. South Africa tour of AustraliaDec 9-12: Tour game in BrisbaneDec 17-21: 1st Test in BrisbaneDec 26-30: 2nd Test in MelbourneJan 4-8: 3rd Test, Sydney South Africa squad: Dean Elgar (c), Temba Bavuma, Gerald Coetzee, Theunis de Bruyn, Sarel Eree, Simon Harmer, Marco Jansen, Keshav Maharaj, Heinrich Klaasen, Lungi Ngidi, Anrich Nortje, Kagiso Rabada, Glenton Stuurman, Rassie van der Dussen, Kyle Verreynne, Khaya Zondo.","pubDate":"2022-11-15 00:13:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Next 12 months could be my last days in Test cricket: David Warner hints","link":"https://thenewsglory.com/next-12-months-could-be-my-last-days-in-test-cricket-david-warner-hints/","keywords":["Sports","Cricket","David Warner","test"],"creator":["The News Glory"],"video_url":null,"description":"Australian cricketer David Warner has hinted that the next 12 months could be his last days in Test cricket. He seems to be saying that he is about to retire from the original format of cricket. The 36-year-old Warner has been playing international cricket for Australia since 2009. He made his Test debut in 2011. […]","content":"Australian cricketer David Warner has hinted that the next 12 months could be his last days in Test cricket. He seems to be saying that he is about to retire from the original format of cricket. The 36-year-old Warner has been playing international cricket for Australia since 2009. He made his Test debut in 2011. Warner, who has played 96 Test matches so far, has accumulated 7817 runs. This includes 24 cents and 34 half cents. He scored a maximum of 335 runs (not out). He is likely to retire after the final of the ICC Test Championship series in June 2023. Australia now have a better chance of qualifying for the finals on points. In the recently concluded T20 World Cup series, he failed to perform with the bat. “The next 12 months may be the last time I play Test cricket. I want to continue playing white ball cricket. I want to play in 2024 T20 World Cup. They say I am old. But we have to be careful about what we wish for,” Warner said.","pubDate":"2022-11-14 22:44:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Gillespie laments ‘disappointing’ Redbacks after innings loss","link":"https://www.couriermail.com.au/sport/cricket/gillespie-laments-disappointing-redbacks-after-innings-loss/video/6e00cc680237c3ae67594f41be2627be","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Redbacks coach Jason Gillespie has slammed his side's poor performance after they slumped to an innings defeat to Western Australia","content":"Cricket: Redbacks coach Jason Gillespie has slammed his side's poor performance after they slumped to an innings defeat to Western Australia","pubDate":"2022-11-14 21:45:28","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps veteran Martin Guptill dropped for India series","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-veteran-martin-guptill-dropped-for-india-series/","keywords":null,"creator":null,"video_url":null,"description":"Black Caps veteran Martin Guptill has been dropped from the Black Caps squads for the upcoming Twenty20 and ODI series against India. Guptill is New Zealand’s third highest run scorer in the ODI format and sits third in the all-time on the Twenty20 run scoring list. The 36-year-old last played against Bangladesh in the tri-series against of the Twenty20 World Cup but didn’t play at the tournament. He has averaged 33.88 in ODIs this year including a century against Ireland, his 18th in the 50-over format, but struggled in the September series in Australia. His omission means Wellington Firebirds rising star Finn Allen will face India for the first time after being confirmed in both squads. The 23-year-old Allen has already played 23 T20Is and eight ODIs for the BLACKCAPS, amassing five half-centuries and a hundred. Trent Boult is the other notable omission from the squads - with Tim Southee, Matt Henry (ODIs only), Lockie Ferguson, Blair Tickner and Adam Milne filling the pace bowling ranks. Milne is in line to play his first ODI since 2017, building on his return to the T20 International arena during the recent Tri Series and last year’s ICC T20 World Cup in the UAE. Black Caps coach Gary Stead said it was never easy leaving out the experience of Boult and Guptill but the team had to keep looking ahead. “When Trent opted out of his NZC contract in August, we indicated that priority would be given to those players with either central or domestic contracts, and that’s been the case here,” he said. “We’re all aware of Trent’s world class ability, but at this time - as we build towards more global events, we want to give opportunities and experiences to others. “The emergence and success of Finn at the top of the order in white-ball cricket means a guy of the class of Martin Guptill misses out – that’s just the nature of high performance sport. “With the 50-over World Cup less than a year away we’re keen to give Finn every opportunity to keep gaining ODI experience, especially against quality opposition such as India. “The message to both those players is that there’s a lot of international cricket ahead and the door is certainly not closed to them.” The tour begins with a three-game T20 International series across Wellington (Nov 18), Tauranga (Nov 20) and Napier (Nov 22), before moving into the ODI series across Auckland (Nov 25), Hamilton (Nov 27) and Christchurch (Nov 30). The one-day series could see Southee become the fifth New Zealander to claim 200 ODI wickets, with the 33-year-old’s tally poised on 199. Tom Latham returns as the ODI wicket-keeper with Devon Conway continuing behind the stumps for the T20 side. Kane Williamson will captain both sides with the T20 squad assembling in Wellington on Wednesday. Ben Sears (back) and Kyle Jamieson (back) were not considered for selection due to injuries while Jimmy Neesham will miss the third ODI to prepare for his wedding. Black Caps squads v India Kane Williamson (c) Finn Allen Michael Bracewell Devon Conway (wk) Lockie Ferguson Matt Henry (ODI) Tom Latham (ODI) (wk) Daryl Mitchell Adam Milne Jimmy Neesham* Glenn Phillips Mitchell Santner Ish Sodhi (T20) Tim Southee Blair Tickner (T20)","content":"Black Caps veteran Martin Guptill has been dropped from the Black Caps squads for the upcoming Twenty20 and ODI series against India. Guptill is New Zealand’s third highest run scorer in the ODI format and sits third in the all-time on the Twenty20 run scoring list. The 36-year-old last played against Bangladesh in the tri-series against of the Twenty20 World Cup but didn’t play at the tournament. He has averaged 33.88 in ODIs this year including a century against Ireland, his 18th in the 50-over format, but struggled in the September series in Australia. His omission means Wellington Firebirds rising star Finn Allen will face India for the first time after being confirmed in both squads. The 23-year-old Allen has already played 23 T20Is and eight ODIs for the BLACKCAPS, amassing five half-centuries and a hundred. Trent Boult is the other notable omission from the squads - with Tim Southee, Matt Henry (ODIs only), Lockie Ferguson, Blair Tickner and Adam Milne filling the pace bowling ranks. Milne is in line to play his first ODI since 2017, building on his return to the T20 International arena during the recent Tri Series and last year’s ICC T20 World Cup in the UAE. Black Caps coach Gary Stead said it was never easy leaving out the experience of Boult and Guptill but the team had to keep looking ahead. “When Trent opted out of his NZC contract in August, we indicated that priority would be given to those players with either central or domestic contracts, and that’s been the case here,” he said. “We’re all aware of Trent’s world class ability, but at this time - as we build towards more global events, we want to give opportunities and experiences to others. “The emergence and success of Finn at the top of the order in white-ball cricket means a guy of the class of Martin Guptill misses out – that’s just the nature of high performance sport. “With the 50-over World Cup less than a year away we’re keen to give Finn every opportunity to keep gaining ODI experience, especially against quality opposition such as India. “The message to both those players is that there’s a lot of international cricket ahead and the door is certainly not closed to them.” The tour begins with a three-game T20 International series across Wellington (Nov 18), Tauranga (Nov 20) and Napier (Nov 22), before moving into the ODI series across Auckland (Nov 25), Hamilton (Nov 27) and Christchurch (Nov 30). The one-day series could see Southee become the fifth New Zealander to claim 200 ODI wickets, with the 33-year-old’s tally poised on 199. Tom Latham returns as the ODI wicket-keeper with Devon Conway continuing behind the stumps for the T20 side. Kane Williamson will captain both sides with the T20 squad assembling in Wellington on Wednesday. Ben Sears (back) and Kyle Jamieson (back) were not considered for selection due to injuries while Jimmy Neesham will miss the third ODI to prepare for his wedding. Kane Williamson (c) Finn Allen Michael Bracewell Devon Conway (wk) Lockie Ferguson Matt Henry (ODI) Tom Latham (ODI) (wk) Daryl Mitchell Adam Milne Jimmy Neesham* Glenn Phillips Mitchell Santner Ish Sodhi (T20) Tim Southee Blair Tickner (T20)","pubDate":"2022-11-14 21:32:08","image_url":"https://www.newstalkzb.co.nz/media/lokbip1q/martin-guptill-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Update | Proposed information on players retained and released by teams including CSK","link":"https://thenewsglory.com/ipl-2023-update-proposed-information-on-players-retained-and-released-by-teams-including-csk/","keywords":["Sports","Cricket","India","IPL"],"creator":["The News Glory"],"video_url":null,"description":"Last Updated : 14 Nov, 2022 11:50 PM Published : 14 Nov 2022 11:50 PM Last Updated : 14 Nov 2022 11:50 PM IPL Cup | file Mumbai: The mini-auction for the upcoming 2023 IPL season is scheduled to take place on December 23 in Kochi. Tomorrow (November 15) is the deadline for all ten […]","content":"Last Updated : 14 Nov, 2022 11:50 PM Published : 14 Nov 2022 11:50 PM Last Updated : 14 Nov 2022 11:50 PM IPL Cup | file Mumbai: The mini-auction for the upcoming 2023 IPL season is scheduled to take place on December 23 in Kochi. Tomorrow (November 15) is the deadline for all ten teams to release the details of retained and released players. In this context, here is the intended information about the players retained and released by the teams including CSK.. IPL is a franchise league series conducted in T20 format. It has many fans not only in India but all over the world. A case in point is the multi-crore auction of television and digital broadcasting licences. In this case, cricket experts have said that this may be the intended list of players that the ten teams want to release and retain. This includes players who will not play next season. Royal Challengers Bangalore are set to release David Willey. Chennai Super Kings team is going to release Chris Jordan. Both of them are playing for England in international cricket. Jadeja is expected to be retained in the Chennai Super Kings team. Lucknow release Jason Holder. Australian players Mitchell Starc and Pat Cummins are likely to miss the upcoming IPL season. It seems that defending champions Gujarat Titans will retain wicketkeeper batsman Mathew Ved. It seems that Shardul Thakur will play for Kolkata Knight Riders. Pollard has been released by Mumbai Indians. RCB has reportedly traded Jason Behrendorff to Mumbai Indians. Sam Billings has said that he has skipped the IPL to focus on Test cricket. Don’t miss out!","pubDate":"2022-11-14 20:42:13","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Warner quietly drops big retirement news","link":"https://www.couriermail.com.au/sport/cricket/david-warner-plans-to-retire-in-the-next-12-months/news-story/dcad14f3685a6655c13b0c8d904cb199","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"David Warner says he has plans to retire from Test cricket in the next 12 months.","content":"The opening batter quietly dropped the huge news in a radio interview with Triple M on Sunday.The Australian team across all three formats is as unsettled as ever as the team confronts the prospect of ushering in the next generation of players.Watch the Weber WBBL. Every game live and ad-break free during play on Fox Cricket, available on Kayo. New to Kayo? Start your free trial now >The 36-year-old could be the first to pull the pin and open the floodgates to a series of other established Test players giving up red-ball cricket. Usman Khawaja, 35, Nathan Lyon 35, Mitchell Starc, 32, Josh Hazlewood, 32, and even Steve Smith, 33, are no certainties to play on forever.Warner says he intends to continue to play white-ball cricket and wants to be there at the next T20 World Cup in 2024 and the ODI World Cup in India next year. His plans for Test cricket do not extend beyond next year’s Ashes series in England.Australia’s busy 2023 schedule also involves a Border-Gavaskar Trophy series in India, beginning in February.“Test cricket will probably be the first one to fall off,” Warner said on Triple M’s Deadset Legends.“Because that’s how it will pan out. The T20 World Cup is in 2024, (one-day) World Cup next year.“Potentially it could be my last 12 months in Test cricket.“But I love the white-ball game. It’s amazing.”He went on to say: “T20 cricket — I love the game. I will be looking to get to 2024. “For all those people saying I am past it and a lot of those old people are past it, look out. Be careful what you wish for.”Warner continues to wait to learn news about the potential scrapping of his lifetime leadership ban which has been held over his head ever since the infamous ball-tampering scandal.Despite campaigns being run behind the scenes, Warner was overlooked as a potential candidate to replace Aaron Finch as Australia’s white-ball captain. Cricket Australia announced Test skipper Pat Cummins will captain the ODI and T20 national teams when he is not being rested from his extremely busy schedule.Australian cricket legend Shane Watson last week slammed Cricket Australia for its lack of action regarding Warner’s leadership ban, saying the veteran opener should be the skipper for the next T20 World Cup.“I’ve had an opinion on who should have been the short-term T20 World Cup captain for a while, and that’s David Warner,” a fired up Watson said.“But that seems to have been caught up in the bureaucracy of Australian cricket because of a couple of lines of a code of conduct legal document.“How hard is it to change one or two lines in a legal document to make sure that someone who has paid for his mistakes and then some (can captain the side)?“The code of conduct documents can be changed by someone in two seconds.“For me, David Warner is an excellent decision maker under pressure. Tactically, he’s very good, he’s a very good leader and he’s very experienced as well.“I’m just disappointed that for his sake he hasn’t had an opportunity to lead the Aussies because he’s a very good leader.“Obviously, it’s not a long-term solution, but another T20 World Cup is coming up in a few years and Dave is still going to be performing very well because he’s still one of the best T20 batters in the world.”","pubDate":"2022-11-14 20:18:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia star David Warner reveals he could retire from Test cricket after 2023 Ashes","link":"https://www.mirror.co.uk/sport/cricket/australia-david-warner-retirement-ashes-28489439","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Australia star David Warner has spoken openly about his retirement plans and revealed next year's Ashes could signal the end of his Test career","content":"Australia opener David Warner has revealed he may retire from Test cricket after next summer's Ashes series, admitting \"it could be my last 12 months in Test cricket\". At the age of 36, Warner is the oldest player to hold a national contract with Cricket Australia and he has now spoken openly about his retirement plans following Australia's disappointing T20 World Cup campaign. Speaking on Triple M's Deadset Legends, Warner revealed he may decide to focus solely on white-ball cricket following the 2023 Ashes, stating: \"Test cricket will probably be the first one to fall off. Because that's how it will pan out. 21-year-old England prospect turns back on Test hopes to sign white-ball-only deal Inside England's T20 World Cup celebrations including shaved head and late-night antics \"The T20 World Cup is in 2024, [50-over] World Cup next year. Potentially it could be my last 12 months in Test cricket. But I love the white-ball game; it's amazing.\" Australia's ageing side came in for criticism after crashing out of the T20 World Cup at the Super 12 stage, with legendary opener Matthew Hayden among those suggesting they need to be \"ruthless\" and refresh a squad which included just two players under the age of 29. \"There has to be some freshness,\" said Hayden, who worked as a team mentor with finalists Pakistan at the World Cup. \"And I think one of the great strengths of Australian cricket has been its ability to be able to recognise when to make that gear change into a different playing roster. Warner is, however, planning to be part of the 2024 T20 World Cup ( Image: Mark Brake-ICC/ICC via Getty Images) \"I think full credit and respect has to go to the players that played this tournament, [they] certainly deserve to be there. A little bit like Mark Waugh giving away to someone like myself after World Cup campaigns, it's always been quite ruthless preparing for the next World Cup and they seemingly come around more often than not.\" However, Warner issued a warning to those suggesting he and \"a lot of those old people are past it\", adding: \"T20 cricket - I love the game. I will be looking to get to 2024. \"For all those people saying I am past it and a lot of those old people are past it, look out. Be careful what you wish for.\" Read More England coach urges Ben Stokes to reverse ODI retirement for 2023 World Cup defence Read More Jos Buttler hopes T20 World Cup win can \"inspire\" Harry Kane's England to World Cup glory Read More Michael Vaughan leads calls for Ben Stokes to reverse ODI retirement ahead of World Cup Read More Sam Billings snubs IPL in bid to force his way into England Test reckoning Read More Jos Buttler says Ben Stokes could be England's greatest ever after T20 World Cup heroics","pubDate":"2022-11-14 19:54:04","image_url":"https://i2-prod.mirror.co.uk/incoming/article25812879.ece/ALTERNATES/s615/1_GettyImages-1361453343.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"We shouldn’t do hate-mongering: Afridi hits back at Shami’s ‘Karma’ tweet","link":"https://thenewsglory.com/we-shouldnt-do-hate-mongering-afridi-hits-back-at-shamis-karma-tweet/","keywords":["Sports","Cricket","India","Pakistan","Shahid Afridi","Shami"],"creator":["The News Glory"],"video_url":null,"description":"Former Pakistan cricketer Shahid Afridi has commented on Indian cricket team bowler Shami’s ‘Karma’ tweet saying that we should not do hateful activities. He said this in support of fellow cricketer Shoaib Akhtar. Pakistan and England were playing in the final of the ongoing T20 World Cup on Sunday. England won the match by defeating […]","content":"Former Pakistan cricketer Shahid Afridi has commented on Indian cricket team bowler Shami’s ‘Karma’ tweet saying that we should not do hateful activities. He said this in support of fellow cricketer Shoaib Akhtar. Pakistan and England were playing in the final of the ongoing T20 World Cup on Sunday. England won the match by defeating Pakistan by 5 wickets. Following this, former Pakistan player Akhtar tweeted. He shared a broken heart emoji and tweeted. To which, ‘I’m sorry brother. This is called Karma’, Shami had tweeted in response. It gained attention among fans. At this stage Afridi was asked for his opinion on the same in a TV discussion program. “We should not do acts that promote hatred. What can we expect from people if we do this ourselves? We are cricketers. Role models. We must put an end to this. We all belong to neighboring countries. Our relationship improves through sports. We have to play with them and they play on our soil. Even retired players should not do this. In this situation, whoever is playing in the current team should avoid all this,” said Afridi. Sorry brother It’s called karma https://t.co/DpaIliRYkd","pubDate":"2022-11-14 19:41:08","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Public v private: Which schools are producing most Test cricketers?","link":"https://www.themercury.com.au/sport/cricket/schools-of-the-test-cricketers-schoolboys-who-dominated-their-generation/news-story/80905455a725c11517f583f9c48b6e99","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Public schools continue to produce the majority of Test cricketers to have played for Australia since the turn of the century but some of the nation’s biggest private schools are emerging as nurseries for the nation’s favourite summer sport.","content":"Of the 102 cricketers to have played a Test for Australia since 2000, 54 completed their schooling at public institutions, with 48 coming through the private school system.And our cricketing captains this century are even more likely to have come through the public system, with six of the eight Test leaders in the 2000s - Steve Waugh, Adam Gilchrist, Ricky Ponting, Michael Clarke, Steve Smith and Tim Paine - attending public schools.SCROLL DOWN TO SEE AUSTRALIA’S TOP CRICKET SCHOOLS THIS CENTURYOnly Shane Watson - who captained a single Test in India in 2013 when Clarke was injured - and current captain and St Paul’s Grammar, Penrith, student Pat Cummins attended private schools. Unlike the rugby codes and AFL though, which rely heavily on the school system to help develop players, the schools our cricketers attend are less likely to point to their higher-level success.Eighty-six separate institutions have contributed to the tally this century, from all states and territories except the Northern Territory, with players schooled in city and country areas.Seventy-two of those have produced a single Test cricketer, while 10 have two students that have gone on to play a men’s cricket Test for Australia.But four schools stand above the rest for players this century.Western Australia’s Wesley College has produced four players - brothers Shaun and Mitchell Marsh, batsman Chris Rogers and middle-order batter Hilton Cartwright - while wrist spinner Brad Hogg, opener Cameron Bancroft and former Test stalwart and coach Justin Langer went to fellow WA Public Schools Association (PSA) member Aquinas College.Queensland’s traditional rugby nursery Nudgee College also schooled three players that turned out this century, off spinner Nathan Hauritz, opener Joe Burns and Australia’s latest Test debutant, leg spinner Mitchell Swepson.Victoria’s St Bede’s College, which also has close connections with the Kingston Hawthorn Cricket Club, has produced three players - Brad Hodge, Jon Holland and last summer’s success story, quick Scott Boland.Wesley College head of sport Luke Dwyer said the college’s facilities and the depth of the PSA competition had helped produce the champions.“Those guys (the Marsh brothers, Rogers and Cartwright) are seriously good Test cricketers, so we do pride ourselves on the fact that we’ve had some very good athletes come through our college,” Dwyer said.The college’s director of cricket Michael Deighton played 71 first class matches for Tasmania, while Test representative Shaun Marsh has given back to the college, doing some batting and fielding specialist coaching.But Dwyer said on-field success - of the individual or the team, was not everything.“We value everything that comes with sport - building resilience and discipline that it takes to commit to training and competition,” he said of Wesley, a school which has also produced AFL stars Lance “Buddy” Franklin, Ben Cousins and England Test cricketer Ben Hollioake.“We’re not a win at all costs school and we value preparing students as best as can with good coaching and mentorship to be competitive.“It’s bigger than the result. We come back to what is our philosophy and what are we doing to prepare our students for a meaningful experience as young adults and adults.”Fellow PSA school Aquinas College, whose alumni include Olympic track champion Herb Elliott, has a rich tradition of school sport its head of cricket Brett Silver says drives all at the school.“It’s a Chariots of Fire moment, you’re excited by what’s gone on in the past and you want to honour that whether you’re a player or a coach or a teacher,” Silver said.Queensland rugby nursery St Joseph’s College, Nudgee, is another school building its cricket resume.Nudgee head of cricket Tim Lang said his main focus had been getting “wonderful” coaches into the program to help develop the boys’ skills.In conjunction with multimillion-dollar facilities that include new flats and 20 artificial and eight turf practice wickets, coaches including former Test player Nathan Hauritz and Australia’s latest Test debutant Mitch Swepson helped hone players’ skills and bring a new generation through the system.“If you put good mentors in front of the boys, it’s a long process but you’ll see the fruits of the labour by the time they get to year 10,11 and 12,” Lang said.As well as Hauritz, Swepson and Joe Burns, Nudgee old boys include West Indies representative Brendan Nash, who remains heavily involved in the college’s cricket program, Australian one-day players Jimmy Maher and Chris Lynn.AUSTRALIA’S TOP CRICKET SCHOOLS THIS CENTURY","pubDate":"2022-11-14 19:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"21-year-old England prospect turns back on Test hopes to sign white-ball-only deal","link":"https://www.mirror.co.uk/sport/cricket/england-prospect-will-smeed-somerset-28489159","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"21-year-old England prospect Will Smeed has decided to focus solely on limited overs cricket, agreeing a new deal white-ball-only deal with Somerset","content":"England prospect Will Smeed has signed a new white-ball-only deal with Somerset in what could be a ground-breaking move for the sport. Smeed has never played a professional first-class match, but first hit the headlines back in 2018 as a 16-year-old when he scored a hundred alongside England legend Marcus Trescothick in a Somerset Second XI game . Since then, Smeed has excelled in the shorter formats, starring for Somerset in the T20 Blast, scoring the first-ever century in The Hundred for Birmingham Phoenix and earning overseas franchise gigs in the Pakistan Super League, Abu Dhabi T10 and the new ILT20. Marcus Trescothick predicts bright future for Will Smeed after century in The Hundred Will Smeed's century in The Hundred \"a big line in the sand for English cricket\" He also featured for the England Lions in two tour matches against South Africa earlier this summer, with the second game his only List A appearance to date. And despite insisting in August that he still had \"aspirations in all three formats\", Smeed has now decided to focus solely on white-ball cricket. Explaining his decision, Smeed said: \"I feel that my game is better suited to white-ball cricket. After a huge amount of thorough and considered discussions, I feel that I need to solely focus my attention on the limited overs formats in order to become the very best cricketer I can be. \"I can assure people that this not a decision that I've taken lightly, and I've spoken to a lot of people about it. I want to be the best player that I can be, and to do that I believe that this needs to be my focus. \"I know how much our Members love red-ball cricket, but unfortunately I haven't been performing how I would like to in the longer form of the game. The easy option would have been to carry on playing red-ball cricket and try to fit everything in and reach a certain level across all formats, but I want to try to be the best that I can be.\" Smeed added that he may one day decide he wants to play first-class cricket, but believes going down the white-ball-only road is the right move for now. \"I feel that I need to focus on excelling in one format,\" he said. \"I'm certainly not saying that I'll never play red-ball cricket again. I just feel that this is the right decision for me and Somerset at the current time.\" Read More England coach urges Ben Stokes to reverse ODI retirement for 2023 World Cup defence Read More Jos Buttler hopes T20 World Cup win can \"inspire\" Harry Kane's England to World Cup glory Read More Michael Vaughan leads calls for Ben Stokes to reverse ODI retirement ahead of World Cup Read More Sam Billings snubs IPL in bid to force his way into England Test reckoning Read More Jos Buttler says Ben Stokes could be England's greatest ever after T20 World Cup heroics","pubDate":"2022-11-14 18:59:45","image_url":"https://i2-prod.mirror.co.uk/incoming/article28489180.ece/ALTERNATES/s615/1_GettyImages-1408244670.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Should India have separate teams for Tests and white ball cricket?","link":"https://thenorthlines.com/should-india-have-separate-teams-for-tests-and-white-ball-cricket/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Former captain and coach Anil Kumble believes having totally different squads in limited overs and Test format is the way forward for India in international cricket. England’s roaring success in ODIs and T20Is has ignited the debate for different teams and coaches in white and red ball cricket. “Definitely, you need separate teams. You […] The post Should India have separate teams for Tests and white ball cricket? appeared first on Northlines.","content":"Agencies Former captain and coach Anil Kumble believes having totally different squads in limited overs and Test format is the way forward for India in international cricket . England’s roaring success in ODIs and T20Is has ignited the debate for different teams and coaches in white and red ball cricket. “Definitely, you need separate teams. You need certainly T20 specialists. I think what this English team has shown and even the last (T20) World Cup champions Australia have shown is that you need to invest in a lot of all-rounders. Look at the batting order,” Kumble told ESPNCricinfo. “Today Liam Livingstone is batting at No. 7. No other team has a No. 7 of the quality of Livingstone. (Marcus) Stoinis walks in at No. 6 (for Australia). That’s the kind of team you have to build. That’s something that you need to invest in. “I’m not really sure whether you need a different captain or a different coach. It all depends on what team you are going to pick and then choose how you want to build the support and the leadership around it.” Former Australia all-rounder Tom Moody said splitting coaches should be seriously considered by international teams. England have Brendon McCullum as their Test coach and Matthew Mott as their white-ball coach. “I think there is no doubt that moving forward, whether it be player or support management, there needs to be a serious look into that separation. “It seems England have quite a considerable difference between their red-ball squad and their white-ball squad. They’ve created a depth of quality,” Moody said after England won their second T20 World Cup title. “With regards to England being the best white-ball team (of all time), I don’t think they’re there yet. If they had won in the UAE at the last T20 World Cup, you could base an argument, but they weren’t there in that one. So they’ve missed a World Cup there. They’ve missed that sort of dominance of a cycle.” Moody said the demands on the players and the team management involved in all the formats are huge. “The price of having success is extremely draining. If you are going to be prepared properly, it’s very hard to manage it with three formats,” said Moody.","pubDate":"2022-11-14 18:43:56","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Warner set to quit Test cricket after next year's Ashes","link":"https://thenorthlines.com/warner-set-to-quit-test-cricket-after-next-years-ashes/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Australia opener David Warner has hinted he will quit Test cricket after next year&#39;s Ashes series in England but plans to continue playing white-ball cricket at least until the 2024 Twenty20 World Cup. Defending champions Australia could not make the last four in the home T20 World Cup, which England won on Sunday, and […] The post Warner set to quit Test cricket after next year's Ashes appeared first on Northlines.","content":"Agencies Australia opener David Warner has hinted he will quit Test cricket after next year's Ashes series in England but plans to continue playing white-ball cricket at least until the 2024 Twenty20 World Cup. Defending champions Australia could not make the last four in the home T20 World Cup, which England won on Sunday, and it was a particularly subdued tournament for Warner. \"Test cricket will probably be the first one to fall off,\" Warner said on Triple M's Deadset Legends show. \"Because that's how it will pan out. The T20 World Cup is in 2024, (one-day) World Cup next year. \"Potentially it could be my last 12 months in Test cricket. \"But I love the white-ball game; it's amazing.\" Australia's Test schedule next year includes trips to India and England before they return to India for the 50-overs World Cup. West Indies and the United States co-host the 20-overs World Cup in 2024. Australia could potentially lose Warner and fellow batter Usman Khawaja next year when both would turn 36. Warner endured a horrid run in the home T20 World Cup with three single digit scores followed by 25 against Afghanistan though he remains a sought-after name in franchise cricket. \"T20 cricket – I love the game. I will be looking to get to 2024,\" the left-handed batter said. \"For all those people saying I am past it and a lot of those old people are past it, look out. Be careful what you wish for.\" Australia will engage with West Indies in a two-Test home series beginning on November 30, before hosting South Africa for three Tests and an equal number of one-day internationals.","pubDate":"2022-11-14 18:43:00","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Climate change is another headache for cricket, says ICC chair","link":"https://www.watoday.com.au/sport/cricket/climate-change-is-another-headache-for-cricket-says-icc-chair-20221114-p5by0q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"A cricket World Cup that began with controversy over the carbon footprint of sponsors has ended with an admission on climate change.","content":"A World Cup that began with controversies over sponsors on a carbon footprint basis has ended with an admission by the global body’s chair Greg Barclay that climate change is adding to complications for tournament organisers. There were deep sighs of relief among planners of the T20 World Cup when a bucketload of Melbourne rain held back until a few hours after Jos Buttler’s side had lifted the trophy at the MCG. The covers were not needed on World Cup final day - but only by a narrow margin. Credit: Getty Images Showers continued on all the way through the reserve day set aside for the tournament finale, underlining how fortunate it had been that a narrow sliver of fine weather held on throughout Sunday night. Australia’s third year in a row of La Nina has added spice to the pitches but also anxiety to the schedulers, and Barclay said that the combination of capricious weather conditions and the desire of member countries to host events outside the prime months of their home seasons was a tricky one. “Cricket’s the one international sport that is very affected by weather, so it is an issue,” Barclay told The Age and The Sydney Morning Herald after he was re-elected as ICC chair for another two years. “Trying to get those events into the optimal parts of the season, country by country, is always going to be difficult, and it’s going to become even more difficult. “Overlay that with what I suspect is a bit of climate change going on, and there’s another layer of complexity that’s been introduced. So I guess that, in part, we’re just going to have to put up with what we get. England skipper Jos Buttler and his teammates celebrate World Cup victory at the MCG. Credit: Getty Images “We’ll still make every effort to work with the hosts to try to optimise the parts of the season that are going to give us the best weather, to ensure we get as much cricket as we possibly can.” Barclay’s re-election, ultimately unopposed after Zimbabwe’s chair Tavengwa Mukuhlani withdrew his nomination, happened against the backdrop of talks around how the new US$3 billion global broadcast rights deal into India will be shared.","pubDate":"2022-11-14 18:00:23","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Dhobi’s daughter from Hyderabad makes a mark in cricket","link":"https://telanganatoday.com/dhobis-daughter-from-hyderabad-makes-a-mark-in-cricket","keywords":["Hyderabad","News","Sport","cricket","Senior Women’s Challenger Trophy"],"creator":["Shiva Krishna Gundra"],"video_url":null,"description":"The experience of rubbing shoulders with the top players of the country and learning from them will help her go a long way, feels the youngster.","content":"Home | Sport | Dhobis Daughter From Hyderabad Makes A Mark In Cricket Dhobi’s daughter from Hyderabad makes a mark in cricket By Shiva Krishna Gundra Published: Updated On - 11:20 PM, Mon - 14 November 22 The experience of rubbing shoulders with the top players of the country and learning from them will help her go a long way, feels the youngster. Hyderabad: For 19-year-old Mamatha Madiwala, the news of being selected to the Senior Women’s Challenger Trophy, which will be held from November 20, is a big step in achieving her dream – playing for the country. The experience of rubbing shoulders with the top players of the country and learning from them will help her go a long way, feels the youngster. Mamatha’s father Veeresh works as a dhobi and watchman in an apartment in Alwal while her mother Bhagya works as a maid. Despite financial struggles, the youngster has been making her mark in the game. Mamatha impressed everyone with her skills in the recently-concluded Senior Women’s T20 Trophy representing Hyderabad. She has been drafted into India C team which will be led by Indian cricketer Pooja Vastrakar. With Richa Ghosh being the main wicketkeeper, Mamatha is eager to learn from the senior pro and be ready to do her best whenever she gets a chance. “Playing in this tournament is going to be a big boost as I get to mingle with Indian team players. The prospect of rubbing shoulders with them itself is very exciting. I am nervous at the same time excited for this opportunity,” said the cricketer. “I want to prove myself whenever I get a chance. I want to learn how the top players approach the game, the way they train and everything that makes me a better cricketer,” said an excited Mamatha. Richa started playing cricket as a 14-year-old with her father in the small streets of Alwal. “I used to play cricket with my father. He saw my interest and took me to Gymkhana for selections. He taught me the game first and that is why he is my first inspiration.” She was picked up for the State Under-16 team and there is no looking back since then. “When I was playing for the State Under-19 team in 2019, Chamundi sir (V Chamundeswa-ranath) saw me in the nets and encouraged me. He started training me for the last two years,” she elaborated. “Chamundi sir has been a great help. Whenever we have financial trouble, he helps us. He even arranged an auto rickshaw for my transport from my home to the Ramanaidu Cricket Academy in Madhapur every day. He pays Rs 20,000 for the autorickshaw monthly,” he said. Mamatha, who admires Smriti Mandhana, dreams of wearing the Team India jersey. “My dream is to play for the country. I am also excited that the women’s IPL is going to start. It will provide a great platform for us to show our talent,” added the B.Com second year student of Vandana College. A hard-hitting batter, Mamatha had an impressive outing in the under-19 T20 tournament. “I had three half-centuries in the U-19 T20 tournament. But I could not show my batting skills in the senior team as I didn’t get to bat higher in the batting order.” “She is a dedicated cricketer and has immense talent. I am sure she will become one of the finest wicketkeepers in the country in the future. She works hard and has a lot of passion. She hasn’t conceded a single bye in the recent T20 tournament,” said Chamundeswaranath. Mamatha also had a stint at the National Cricket Academy (NCA) recently and she is hopeful that the Challengers Trophy will boost her game and career. Follow Us : Tags cricket Hyderabad Senior Women’s Challenger Trophy Related News Unicorn Darwinbox to add 300 people in Hyderabad, 100 in other markets Hyderabad-based IIL delivers animal vaccines by drones Telangana seeks in principle approval for Hyderabad Metro Phase II from Centre Fake certificate racket busted in Hyderabad Raja Singh gets angry after bulletproof vehicle breaks down Aeroplane gets stuck on underpass in Andhra Pradesh’s Bapatla","pubDate":"2022-11-14 17:30:53","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi League: Puneri Paltan beat Bengal Warriors 43-27; Haryana Steelers edge Gujarat Giants","link":"https://www.firstpost.com/sports/pro-kabaddi-league-puneri-paltan-beat-bengal-warriors-43-27-haryana-steelers-edge-gujarat-giants-11628091.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi League: Puneri Paltan beat Bengal Warriors 43-27; Haryana Steelers edge Gujarat Giants","content":"Sports Pro Kabaddi League: Puneri Paltan beat Bengal Warriors 43-27; Haryana Steelers edge Gujarat Giants The prolific trio of Akash Shinde (10 points), Inamdar (9 points) and Mohit Goyat (8 points) were the star performers of the day. FP Sports November 14, 2022 22:37:47 IST Puneri Paltan defeated Bengal Warriors. Twitter @ProKabaddi Pune: Puneri Paltan dished out a splendid performance to outwit Bengal Warriors 43-27 in a Pro Kabaddi League match in Pune on Monday. In another contest, Haryana Steelers edged Gujarat Giants 33-32. The prolific trio of Akash Shinde (10 points), Inamdar (9 points) and Mohit Goyat (8 points) were the star performers of the day. The evening also witnessed Aslam Inamdar reaching the 100-point mark for the season. A see-saw first half saw Paltan streak into an early lead, inflicting the first ALL OUT on the Warriors to surge into a 11-1 lead. However, the Warriors rallied and picked up a string of points where they not only scored 10 points of their own but also ensured that Paltan only got three. They got an ALL OUT of their own to cut the gap before the pendulum swung again. Within five minutes, Paltan had another ALL OUT, streaking away into a 24-12 lead. They held onto it to go into halftime leading 24-13. Paltan kept the momentum going through the second half as the raiding trio of Inamdar, Shinde and Goyat regularly grabbed points and didn’t allow the Warriors any chance to recover. At the other end, the Warriors were relying solely on Maninder, whose successful raids were enough. A third ALL OUT duly arrived for the Paltan as they consolidated their lead to 33-14. Thereafter, Puneri Paltan continued to be in control of the match and Shinde’s SUPER RAID, which caught out D Balaji, Surender Nada, Vaibhav Garje and Manoj Gowda, in the final minutes, sealed the deal for the Pune side. With PTI inputs Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 14, 2022 22:37:47 IST TAGS: Bengal Warriors Gujarat Giants Haryana Steelers Pro Kabaddi League 2022","pubDate":"2022-11-14 17:07:47","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Bengal-vs-Puneri-640_Twitter-@ProKabaddi.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: England's white-ball dominance, fightback from the underdogs and other takeaways from the tournament","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-englands-white-ball-dominance-fightback-from-the-underdogs-and-other-takeaways-from-the-tournament-11627901.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"T20 World Cup: England's white-ball dominance, fightback from the underdogs and other takeaways from the tournament","content":"Cricket T20 World Cup: England's white-ball dominance, fightback from the underdogs and other takeaways from the tournament England defeated Pakistan in the final at the Melbourne Cricket Ground on Sunday to win their second T20 world title and become the only team to hold both the ODI and T20 World Cups simultaneously. Amit Banerjee November 14th, 2022 21:56:17 IST England captain Jos Buttler holds the trophy aloft during their post-match celebration after their five-wicket victory over Pakistan in the final of the 2022 T20 World Cup in Melbourne. AP After nearly a month of riveting cricketing action comprising 45 matches, the 2022 T20 World Cup reached its conclusion on Sunday with England defeating Pakistan in a cracker of a final at the Melbourne Cricket Ground to win the showpiece event for a second time. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos The tournament, which was originally supposed to take place in 2020 but was postponed by two years thanks to COVID, had it all — from outstanding individual performances both with ball and ball to sensational catches, from the Davids of cricket slaying the Goliaths to pre-tournament title favourites getting dismantled in knockout matches. Lest we forget, the tournament was also an important lesson for the ICC as far as organising tournaments in Australia during ideal weather conditions is concerned. With the T20 World Cup now ‘coming home’, England have officially crowned themselves as the undisputed kings of white-ball cricket, having won the ODI world title in 2019 on home soil. And with the team also enjoying a stellar run in Tests earlier this summer at the start of the ‘Bazball’ era, there surely isn’t a better time to be a supporter of the England men’s cricket team. With the eighth edition of the T20 World Cup coming to an end, we take a look at some of the lessons learnt from the event, starting with the victorious side: England are the team to beat in limited-overs formats England started off on a shaky note, registering a scratchy win against Afghanistan and losing against Ireland, before a washout against Australia left them staring at the prospect of an early trip back home. The Jos Buttler-led side, however, have been phenomenal since then; they would avenge their 2021 semi-final loss against New Zealand with a one-sided win and qualify for the knockouts by beating Sri Lanka before thrashing India by 10 wickets in the semi-final. And it was ultimately their disciplined bowling unit along with yet another special knock from Ben Stokes that landed them a second world title in the format. England completely revolutionised their approach towards limited-overs cricket in the aftermath of the first-round exit from the 2015 ODI World Cup, playing a fearless, attacking brand of cricket and having pretty much all the bases covered in both ODIs and T20Is. Skipper Buttler has simply carried forward the approach that his predecessor Eoin Morgan introduced in the second half of the previous decade, as a result of which England are the only team in the history of the men’s game to hold both the ODI and the T20 World Cups at the same time. No team can be taken for granted Another major takeaway from the tournament has been the manner in which some of the lower-ranked sides, aka the ‘Minnows’, have expressed themselves and defeated some of the more fancied teams. Sri Lanka and West Indies were given jolts early on in the First Round, the latter failing to reach the Super 12s after losing against Scotland and Ireland. Champions England lost to neighbours Ireland yet again while Zimbabwe won the ‘Bean Derby’ against Pakistan in style. One defeat would then lead to another, and Pakistan were left staring at an early elimination after losing against Zimbabwe. AFP And many a follower of the sport would’ve laughed at the thought of Netherlands inflicting the knockout punch on South Africa before the two sides collided in Adelaide on the final day of the Super 12 fixtures. The fight displayed by the teams is sure to send a message to the ICC and some of the more established teams — that no side is to be taken lightly in a format as volatile as T20. And that these teams deserve game time with the higher-ranked sides beyond ICC events, which is the only way they can live up to their true potential. I hope Pakistan is sending Mr Bean to Netherlands as goodwill gesture. — Silly Point (@FarziCricketer) November 6, 2022 Why this isn’t the best time to host cricket in Australia Much like the 2019 ODI World Cup in England, the 2022 T20 World Cup in Australia will go down as a tournament that was nearly spoilt by erratic weather. While rain doesn’t cause as much havoc in this part of the world as it does in the United Kingdom, where steely skies during peak summer aren’t an anomaly, the fact is that hosting a cricketing event in the months of October and November in Australia isn’t the best of options. Several matches had to be called off due to rain in 2022 T20 World Cup. AFP While hosting a multi-nation event in the peak summer months of December and January will be a difficult prospect for the ICC since Cricket Australia prefers hosting its marquee Test fixtures during this time, the February-March slot might just work better and witness fewer rain interruptions and make for a more conducive environment for a tournament as prestigious as the World Cup. A lot of people tweeting that the ICC shouldn’t have held the #T20WorldCup in Australia at this time of year. But this La Niña weather event really isn’t normal. Melbourne’s average October rainfall is around 65mm. It’s had around 120mm *so far* this month. — Melinda Farrell (@melindafarrell) October 26, 2022 Umpiring certainly could improve a notch Another major letdown in what otherwise will be remembered as a successful tournament was the umpiring, the standards of which took a major beating with a number of contentious calls and howlers spoiling games that were otherwise high on quality and drama. One such case was Shakib Al Hasan getting adjudged leg-before wicket during the Bangladesh-Pakistan encounter in Adelaide even though there was evidence of an inside edge. Shakib could have had a major impact on the outcome of the match, but was instead out for a duck. Similarly, a five-ball over during Australia’s innings in their final Super 12 game against Afghanistan went unnoticed by the match officials. Sporting pitches and thrilling matches All the negatives aside, one of the biggest positives from the tournament was perhaps the work that the curators put into preparing sporting pitches during the tournament. Australian wickets generally are hard and offer extra bounce and the ball really does zip off at times, but can also be supportive towards batters once they set themselves in, leading to some interesting contests between bat and ball. And the kind of surfaces prepared for this year’s T20 World Cup certainly was a welcome change from the slower and lower tracks that were on offer in the UAE in the previous edition last year. Perth was the liveliest of the surfaces, where the South African attack thrived against the Indians and decimated their top order with short stuff. Sydney, meanwhile, was extra supportive towards the batters and witnessed some of the higher scores in the tournament as a result, including two 200-plus scores. And Melbourne had a mix of both along with some support for swing bowling. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 14, 2022 21:56:17 IST Tags: Cricket T20 World Cup T20 World Cup 2022 T20 World Cup England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-14 16:26:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/England-celebrate-T20-World-Cup-win-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup: Miroslov Klose to Ronaldo, Top 10 goal scorers in football World Cup history","link":"https://www.firstpost.com/sports/fifa-world-cup-miroslov-klose-to-ronaldo-top-10-goal-scorers-in-football-world-cup-history-11627391.html","keywords":["Football"],"creator":["FP Sports"],"video_url":null,"description":"FIFA World Cup: Miroslov Klose to Ronaldo, Top 10 goal scorers in football World Cup history","content":"Sports FIFA World Cup 2022: Miroslav Klose to Ronaldo, Top 10 goal scorers in tournament history As many as 13 strikers have scored at least 10 goals at the FIFA World Cup, including Pele, Ronaldo, Gerd Muller among other star names. FP Sports November 14, 2022 21:47:59 IST Ronaldo was star attraction at two World Cups in 1998 and 2002 when Brazil reached final twice and winning one of them. AFP With days to go for the FIFA World Cup 2022 in Qatar, the potency of participating nations in front of the goal is seen as one of the important component in winning the ‘Cup of life’. The competition is in fact all about goals and 2548 goals scored over 21 editions of the World Cup pay homage to that. Likes of Lionel Messi, Cristiano Ronaldo, Karim Benzema, Kylian Mbappe, Robert Lewandowski among plenty others are expected to burst the net as many times as possible and will quantify their success at the tournament in Qatar. The current stars of football have a spate of yesteryear stars to look forward to and if possible surpass their goal tally. We take a look at 10 such names, who rule the all-time list of FIFA World Cup goal scorers. 8. Gabriel Batistuta (Argentina), Teofilo Cubillas (Peru), Gary Lineker (England), Thomas Muller (Germany), Grezgorz Lato (Poland), Helmut Rahn (Germany): 10 goals each Argentina star Gabriel Batistuta scored 10 goals over three World Cups. AFP As many as six players hold the eighth spot in the FIFA World Cup all-time goal-scorer list and are greats of their international side in their own rights as not many can boast they have scored 10 goals in the biggest football event in the World Cup. Something that even Diego Maradona can’t claim with eight goals to his name ovet three editions. While Argentina’s Gabriel Batistuta and England’s Gary Lineker are two recognisable names in the list, Germany’s Thomas Muller is the only footballer who is still incumbent in international football at the age of 33 and is the most reliable goal scorer for the Germans in Qatar. The German is also the only active player in the all-time top goalscorer list. 6. Jurgen Klinsmann (Germany), Sandor Kocsis (Hungary): 11 goals each Jurgen Klinsmann scored three of his 11 goals for Germany at the 1990 World Cup when West Germany lifted the world title. AFP Jurgen Klinsmann requires no introduction as the German sniper, who scored goals in galore for West Germany and then Germany over a career spanning from 1987 to 1998, scoring 40 goals. 11 of those came at the World Cups over three editions, becoming World Champion with West Germany in 1990. His winning goal against Netherlands in the round of 16 was highly praised as the Germans were down to 10 men with Klinsmann’s strike partner Rudi Voller sent off. In total, he scored 3 goals in the winning campaign. 1994 World Cup was more successful for Klinsman with five goals as Germany bowed out in the quarters to Bulgaria. In his final World Cup in 1008, the German scored three goals. Sandor Kocsis scored all his 11 goals in the 1954 World Cup. He scored in all the games except for the final. AFP Hungarian great Sandor Kocsis, on the other hand, scored all his 11 goals in the 1954 World Cup, which included two hat-tricks. His first hat-trick came against South Korea as Hungary won 9-0 while he scored a whopping four goals against Germany in an 8-3 rout. Kocsis then memorably scored two goals in 4-2 win over Brazil in the quarterfinal match regarded as ‘Battle of Berne’. Kocsis’s brace came in the extra time after the score was tied 2-2 at full-time. In a rematch with Germany in the final, Hungary went down 3-2 as Kocsis failed to score for the first time. 5. Pele (Brazil) Pele won three World Cup for Brazil, scoring 12 goals in 14 games. AFP Matches: 14 Goals: 12 Pele scored six goals in his debut World Cup in 1958 in Sweden, two of those came in the World Cup final against the host nation as Brazil won the final 5-2. Pele was expected lead Brazil to another World Cup success in 1962 as he entered the tournament as the most famous footballer on the planet. However, the player was injured early on after scoring and assisting a goal in the first game against Mexico. Pele went out of the rest of the tournament but Brazil defeated Czechoslovakia 3-1 in the final to lift the trophy. 1966 was a disaster for Pele and Brazil as the two-time defending champions went out in the group stages in England while Pele found the net just once. Pele, however, returned to the tournament in 1970, this time in Mexico, to score four times in Brazil’s third World Cup title. The all-time football great also scored in the final as Brazil thrashed Italy 4-1. 4. Just Fontaine (France) Just Fontaine scored all his 13 World Cup goals at the 1958 World Cup in Sweden. AFP Matches: 6 Goals: 13 Just Fontaine made himself one of the greatest strikers France ever produced despite participating in just one World Cup as the Frenchman overtook Kocsis’s most goals record in a single tournament by scoring as many as 13 times in 1958 edition. Fontaine scored in all the games he participated in, including a hat-trick against Paraguay and a quartet of goals against West Germany in the third-match play off as France finished third in the tournament winning 6-3. Fontaine’s dream of winning the World Cup, however, was never achieved as injuries ended his career at just 28. 3. Gerd Muller (Germany) Gerd Muller scored 68 goals for West Germany in 62 games; 14 of those came in the World Cups. AFP Matches: 13 Goals: 14 Gerd Muller is regarded as one of the most prolific goal scorers ever produced as he scored 14 goals over just two World Cups. Ten of them came in 1970 in Mexico when Gerd scored two hat-tricks in the group stages. Muller comfortably won the Golden Boot but West Germany went out in the semifinals to Italy despite the striker scoring a brace. The dream of winning the World Cup was achieved in the next edition in front of the home fans as Gerd scored four goals at the tournament, including a goal against the Netherlands in the final which the West Germans won 2-1 in Munich. Ronaldo (Brazil) – 15 goals in 19 matches Ronaldo Luis Nazario de Lima, more popularly known as Ronaldo, is second on the list of the highest goalscorers in the FIFA World Cup with 15 goals in 19 outings. 2. Ronaldo (Brazil) Ronaldo was star attraction at two World Cups in 1998 and 2002 when Brazil reached final twice and won one of them. AFP Matches: 19 Goals: 15 Regarded as a phenomenon and as the best striker of all time among modern-day greats, Ronaldo reached the epitome of his success when he led Brazil to their fifth World Cup triumph in 2002 by defeating Germany in the final. Ronaldo scored both goals in the 2-0 win in the Japanese city Yokohama. Ronaldo also won the Golden Boot with eight goals as his duel with Germany’s Thomas Muller, who scored five goals, was the highlight of the tournament. Ronaldo scored four times in the 1998 World Cup when his brilliant form took Brazil to the final. However, the showdown against France turned into a bitter memory with the Brazilian struggling to play with a fever against the hosts, who won 3-0 to lift the title. 2006 In 2006 in Germany, Ronaldo was far from his best but still managed to score thrice before Brazil went out in the quarterfinals. His three-goal tally, however, was enough to surpass Gerd Muller’s on the all-time list. 1. Miroslav Klose (Germany) Miroslav Klose scored 16 goals across four World Cups and surpassed Ronaldo to the top at the 2014 World Cup in Brazil. AFP Matches: 24 Goals: 16 Playing in four editions of the World Cup (2002, 2006, 2010 and 2014), Miroslav Klose sits atop the FIFA World Cup all-time top goal-scorer list with 16 goals. Known to be a dependable goal poacher, the German scored his last goal in the World Cup at the age of 36 as Klose didn’t just surpass Ronaldo on the all-time list but Germany also went on to lift the World Cup with Germany memorably defeating Brazil 7-1 in the semifinal followed by 1-0 win over Argentina. Klose’s first goal at the World Cup dates back to 2002, when he scored a hat-trick in Germany’s 8-0 rout of Saudi Arabia. Germany eventually finished runners-up at the event with the striker finishing second in the Golden Boot race. Klose returned to the World Cup in 2006 in front of the home fans and scored further five times as the side finished third. 2010 in South Africa was a further success for the striker individually as he scored four goals to finish as the joint-top scorer. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 14, 2022 22:23:40 IST TAGS: Fifa World Cup Fifa World Cup 2022 Football Kickingaround","pubDate":"2022-11-14 16:19:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Ronaldo-brazil-AFP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Shithikanta, Sai star for Mancherial at TCA Inter-District One Day League","link":"https://telanganatoday.com/shithikanta-sai-star-for-mancherial-at-tca-inter-district-one-day-league","keywords":["News","Sport","AMC Ground","Bellampally","TCA Inter-District One Day League"],"creator":["Telangana Today"],"video_url":null,"description":"Sai Reddy and A Shithikanta scored half-centuries while Sanjeev snared four wickets to guide Mancherial to a thumping 104-run victory","content":"Home | News | Shithikanta Sai Star For Mancherial At Tca Inter District One Day League Shithikanta, Sai star for Mancherial at TCA Inter-District One Day League By Telangana Today Published: Published Date - 08:24 PM, Mon - 14 November 22 Sai Reddy and A Shithikanta scored half-centuries while Sanjeev snared four wickets to guide Mancherial to a thumping 104-run victory Sai Reddy and A Shithikanta scored half-centuries while Sanjeev snared four wickets to guide Mancherial to a thumping 104-run victory Hyderabad: Sai Reddy and A Shithikanta scored half-centuries while Sanjeev snared four wickets to guide Mancherial to a thumping 104-run victory over Karimnagar in the Telangana Cricket Association (TCA) Seniors Inter-Districts One Day League held at the AMC Ground, Bellampally on Monday. Batting first, A Shithikanta’s 61-run knock and Sai Reddy’s 51-run knocks helped Mancherial post 200 in 30.5 overs. Iliyaz picked four wickets for Karimnagar. In reply, Sanjev returned with four for 21 bowling figures to restrict Karimnagar for 96 in 22.3 overs. Syed Aqdam Ahmed (50) went in vain. Also Read Virat Kohli, Suryakumar in ICC’s Most Valuable Team of T20 World Cup Brief Scores: TCA – Seniors Inter Districts One Day League: Mancherial 200 in 30.5 Overs (A Shithikanta 61, Sai Reddy 51, Ilyas 4/32) bt Karimnagar 96 in 22.3 Overs (Syed Aqdam Ahmed 50, Sanjev 4/21); TCA – Nizamabad District Seniors T20 League: Ilyas XI 125/7 in 18 Overs (Mohd Mujju 27, Sohel 3/19, Sk Afzal 3/22) lost to Mujahid Youth XI 129/5 in 15 Overs (Mubashir Ali Khan 53, Quader Aslam 2/17); ABCC 128/9 in 18 Overs (Abdul wasey 38, Musaib 30, Shaik Faizan 3/27) bt Pasha XI 123/9 In 18 Overs (Usman Raza 42, Abdul Wasey 3/25); MCC XI 128/9 in 18 Overs (Rupinder Singh 37, Nazim 24, Anoop Singh 3/31) bt Khalsa CC 117/7 in 18 Overs (Harminder Singh 29, Abdul Samad 2/16); NCC XI 127/8 in 18 Overs (Azhar 37, Moiz Khan 33; Gourav Sharma 3/17) lost to Yorkshire CC 128/6 in 18 Overs (Aslam Khan 38, Iliyas 37, V Nithin 3/20). Follow Us : Tags AMC Ground Bellampally TCA Inter-District One Day League Related News Young girl stages silent protest in front of lover’s house in Bhupalpally","pubDate":"2022-11-14 14:54:38","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Players can change… the game doesn’t change! – England’s winning streak since 2015 on the trail set by Morgan","link":"https://thenewsglory.com/players-can-change-the-game-doesnt-change-englands-winning-streak-since-2015-on-the-trail-set-by-morgan/","keywords":["Sports","England","online special","Pakistan","T20","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Many experts are saying that England winning the 2022 T20 World Cup is going to change the frame of T20 cricket. That is, the essence of the concept is that from now on other teams will play T20 cricket like England. The 2015 ICC 50 Over World Cup in Australia was a huge humiliating series […]","content":"Many experts are saying that England winning the 2022 T20 World Cup is going to change the frame of T20 cricket. That is, the essence of the concept is that from now on other teams will play T20 cricket like England. The 2015 ICC 50 Over World Cup in Australia was a huge humiliating series for England. However, they lost the first match to Australia by 111 runs. England were bowled out for 123 runs in 33 overs in the next match in Wellington, New Zealand. In response, New Zealand’s Brendon McCullum, James Anderson, Stuart Broad and Steve Finn hit England’s fast bowlers off the pitch and finished off the match in 12.2 overs with a 25-ball 77 with 8 fours and 7 sixes. New Zealand won by 8 wickets. Apart from this, in the World Cup England team scored 309/6 against Sri Lanka with a century of Joe Root and Sri Lanka team chased down the target of 312/1 with centuries of Trimane and Sangakkara and defeated England badly. As if all this was not enough, the Bangladesh team also suffered defeat. It was only after Morgan’s captaincy that the England team had suffered major defeats, Morgan changed the team’s players and introduced a new approach to white-ball cricket. Only after that, England gradually grew to become the 2019 World Cup, 2021 T20 World Cup Semi-Final, 2022 World Cup Champion and is threatening to become the big monster of white ball cricket today. Only Jos Buttler and Moeen Ali remain from that 2015 team today. Notably, Morgan recently retired. It was only in 2015 that the England Cricket Board appointed Andrew Strauss as its director. Together, he and Morgan made England such a formidable team in white-ball cricket. The first thing Strauss did was to drastically increase the salaries of players who played only white-ball cricket. That is, there is the county cricket salary and then there is the additional salary that Strauss has raised. This has tremendously increased the players’ interest in white-ball cricket. It was only after this that great white-ball action batsmen and bowlers like Jason Roy, Alex Hales, David Malan, Tom Bandon, Tom Curran, Chris Jordan were included in the England team. Another thing Strauss did with him was hiring Drew Bayliss as head coach. His mantra was ‘hit or die white-ball cricket’. After the 2015 World Cup humiliation, England rose to the second place in terms of win-loss ratio after India. Bayliss, Morgan’s mantra is the same old story of settling down and hitting, and play as soon as you get down. This was his masterstroke. Players were advised that the old approach was to stand around and let others score runs. Whoever comes down and scores a half-century in 30-40 balls, or if it is only 15 balls, he must score at least 25 runs in those 15 balls. For this, the trainings were also tightened and many active players rose up in a row. England’s average run rate in ODIs since the 2015 defeat is 6.29. In the 2015-2019 World Cup periods, England’s score doubled to over 300 runs in an innings and made everyone go crazy. Jason Roy, Jonny Bairstow, Joe Root, Eoin Morgan etc. Ben Stokes, Buttler, Moeen Ali came down behind and started getting whitewashed. In the end, Adil Rashid and Liam Blanket were also helpful with the batting. Batters were there to bat till the end. Most scores of 150+ in ODIs have come from England players. From the 2011 World Cup to the 2015 World Cup, not a single England player had scored 150 runs in an ODI. Nakasu’s work in converting the pitch into a batting pitch: All these are correct. But do you know what they did? There is one thing called pitch, which is swing and acceleration. To change this somehow, after 2015 they put full batting paradise pitches, England ODI cricket pitches became batting paradises. You can hit the new ball too, don’t ask for the old ball. Since the 2015 World Cup, a team has scored 400 runs 5 times, of which England have scored 400+ runs 3 times. As a result, England scored a world record 481 runs against Australia in 2018. They then broke their own world record by scoring 498 runs against the Netherlands. In T20 cricket under Eoin Morgan’s captaincy, England have won 42 out of 72 matches and lost only 27, which is slightly better than Dhoni’s win rate. Under Morgan’s captaincy, England have won 76 and lost 40 of the 126 ODIs they have played. It was against this backdrop that Jos Buttler became the captain as the adopted son of Morgan’s captaincy. At first he was a little reluctant to adopt the Morgan style, but then reverted back to his old style, realizing it wouldn’t work. The result is the title of 2022 World Cup champion. Their dramatic win against India in the semi-final reminded Morgan, but in the final against Pakistan, it was the Morgan/Buttler combination that built up the innings to win the match despite losing wickets in total control. The reason is Ben Stokes’ new avatar in T20 cricket, that of a winning finisher. This he has been doing effectively and can be expected to continue to do. Although Stokes has been dropped into the powerplay, he has emerged as a new finisher, stopping the slump at one end and getting into action no matter what the score. In other words, the revolutionary change made by England is that no matter who comes out, they should score runs quickly, aggressively and in a consistent manner. He scored 5 half-centuries in a series, says Buttler. What is the winning total? Play it the way you want to play it. This is Butler’s mantra. 2015- England were kicked out by Bangladesh in the World Cup in Adelaide. After making all these changes, England have reached the knockout stages in five ICC white-ball series since then. World champions in two, runners-up in one. Two semi-finals. Bairstow, Mark Wood, Zobra Archer, Jason Roy have achieved this without the likes of them. Players can change… Attitude never changes is England’s winning mantra right now.","pubDate":"2022-11-14 14:36:14","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Table tennis legend Sharath Kamal to receive Khel Ratna on November 30","link":"https://www.business-standard.com/article/current-affairs/table-tennis-legend-sharath-kamal-to-receive-khel-ratna-on-november-30-122111401408_1.html","keywords":null,"creator":null,"video_url":null,"description":"Table tennis legend Achanta Sharath Kamal will receive the Major Dhyan Chand Khel Ratna Award, the country's highest sporting honour, from President Droupadi Murmu on November 30 at the Rashtrapati Bhavan here. While Sharath is the lone Khel Ratna award recipient, a total of 25 athletes including shuttlers Lakshya Sen, HS Prannoy, woman boxer Nikhat Zareen, athletes Eldhose Paul, Avinash Sable have been nominated for the Arjuna Award this year. The awardees will receive their awards from the President at a specially organised function at Rashtrapati Bhavan. Jiwanjot Singh Teja (Archery), Mohammad Ali Qamar (Boxing), Suma Siddharth Shirur (Para shooting) and Sujeet Maan (Wrestling) have been nominated for the ?Dronacharya Award in the regular category, while Dinesh Jawahar Lad (Cricket), Bimal Prafulla Ghosh (Football) and Raj Singh will receive the recognition in the lifetime category. Ashwini Akkunji C (Athletics), Dharamvir Singh (Hockey), B C Suresh (Kabaddi) and Nir Bahadur ..","content":null,"pubDate":"2022-11-14 14:30:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221114/thumb-122111401408.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi 2022 LIVE Score and Updates: Bengal Warriors face Puneri Paltan","link":"https://www.firstpost.com/sports/pro-kabaddi-2022-live-bengal-warriors-vs-puneri-paltan-gujarat-giants-vs-haryana-steelers-live-streaming-pkl-season-9-match-updates-pune-11627331.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi 2022 LIVE Score and Updates: Bengal Warriors face Puneri Paltan","content":"19:50 (IST)Pro Kabaddi LIVE Score Warriors' Maninder Singh takes out Pune's Fazel Atrachalli and Sombir to inflict an ALL OUT on Puneri Paltan 19:44 (IST)Pro Kabaddi LIVE Score Puneri Paltan have inflicted an ALL OUT against Bengal Warriors inside the first five minutes of the contest. 14-7 to Pune with less than 10 minutes in the first half. 19:30 (IST)Hello and welcome to our LIVE coverage of Pro Kabaddi League. It's a double-header tonight, with Bengal Warriors taking on Puneri Paltan in Pune. Preview: It’s another double-header in Pro Kabaddi League 2022. Bengal Warriors take on Puneri Paltan in the first match, before Gujarat Giants face Haryana Steelers.Both the Steelers and Giants are desperate for victories after struggling in the bottom half of the table, with four and five wins respectively.Steelers are placed 10th of the 12 teams with 31 points while the Giants are 11th with the same number of points.For Puneri Paltan, their match against Bengal Warriors provides a chance to go top of the table. The top spot is currently occupied by Bengaluru Bulls with 46 points while Puneri Paltan are second with 44 points.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-14 14:05:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Bengal-Warrirors-vs-Gujarat-Giants-Pro-Kabaddi.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"How England won the T20 World Cup","link":"https://sportstar.thehindu.com/cricket/t20-world-cup/how-england-won-the-t20-world-cup-cricket/article66135820.ece","keywords":null,"creator":["\n        Ayan Acharya  \n    "],"video_url":null,"description":"England’s command over white-ball cricket since its unceremonious exit from the 2015 50-over World Cup has been nothing short of phenomenal. Pragmatism and an aggressive approach helped the team overcome a poor start and clinch the T20 crown in Australia.","content":null,"pubDate":"2022-11-14 13:47:08","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Anil Kumble wants Team India to adopt THIS formula used by Jos Buttler's England - Check","link":"https://zeenews.india.com/cricket/anil-kumble-wants-team-india-to-adopt-this-formula-used-by-jos-buttlers-england-check-2535370.html","keywords":null,"creator":null,"video_url":null,"description":"In England, Brendon McCullum is the red-ball coach while Ben Stokes is the skipper. Coming to white-ball cricket, Matthew Mott is the head coach while Jos Buttler is the skipper.","content":null,"pubDate":"2022-11-14 13:43:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"England captain Jos Buttler asked Moeen Ali and Adil Rashid to step aside during celebrations; know why","link":"https://www.tribuneindia.com/news/sports/england-captain-jos-buttler-asked-moeen-ali-and-adil-rashid-to-step-aside-during-celebrations-know-why-450928","keywords":null,"creator":null,"video_url":null,"description":"Melbourne, November 14 The social media has appreciated the gesture of the Jos Buttler-led England team, which waited for team-mates Moeen Ali and Adil Rashid to step aside before uncorking the bubbly in celebration of the ICC T20 World Cup triumph over Pakistan in Melbourne on Sunday. England clinched their second T20 World Cup title defeating Babar Azam's Pakistan by five wickets with an over to spare at the iconic Melbourne Cricket Ground, with all-rounder Ben Stokes scoring an unbeaten 49-ball 52 as they raced to the victory target of 138 in 19 overs. Heart touching! ❤️England's captain reminded Adil Rashid to leave and checked to see that he and Moeen Ali had left before they celebrated with champagne. Respect.#T20WorldCupFinal pic.twitter.com/RR81KSSj2G — Shahjhan Malik (She/Her) (@shahjhan_malikk) November 13, 2022 As is customary, the team uncorked the champagne bottle but not before Moeen and Rashid were asked to step aside. The due respect given to the religious sentiments of the two cricketers has been widely appreciated. Respecting the faith of his teammates, England skipper Jos Buttler first clicked pictures with the whole team before reminding the two players that the champagne celebrations were about to take place and they should step aside. The video has since gone viral, with a fan tweeting, \"Respect for religious diversity is an essential element of any peaceful society. Here England captain Jos Buttler asked Adil Rashid and Moeen Ali to leave before they celebrated with champagne. Respect. #ENGvsPAK #T20WorldCup22 #T20WorldCupFinal.\" Following Australia's Ashes triumph at home earlier this year, their Test skipper and pace bowler Pat Cummins had shown a similar gesture towards Usman Khawaja, as he stopped others from opening the champagne bottle and called Khawaja on to the stage to complete the celebrations. IANS","content":null,"pubDate":"2022-11-14 13:41:32","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1949308748.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Indian cricket should swallow pride and look at England for inspiration’: Michael Vaughan","link":"https://www.firstpost.com/firstcricket/sports-news/indian-cricket-should-swallow-pride-and-look-at-england-for-inspiration-michael-vaughan-11627011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"‘Indian cricket should swallow pride and look at England for inspiration’: Michael Vaughan","content":"Cricket ‘Indian cricket should swallow pride and look at England for inspiration’: Michael Vaughan English cricket has a trendsetting team the rest of the world should emulate according to Michael Vaughan. England are the undisputed white-ball champions. FirstCricket Staff November 14th, 2022 19:09:29 IST File image of former England captain Michael Vaughan. AFP London: Former England captain Michael Vaughan feels the Indian cricket board (BCCI) should “swallow pride” and look at England for inspiration after India’s semifinal exit from the T20 World Cup. India suffered a 10-wicket hammering from eventual champions England to end their campaign at the semifinal stage. The heavy defeat marked India’s fifth knockout loss in last six World Cups. England, meanwhile, beat Pakistan by five wickets in the finals to win the T20 World Cup in Melbourne on Sunday. “This group of England white ball players is extraordinary and for once English cricket has a trendsetting team the rest of the world should emulate. How are England going about their business? What do they do? “If I was running Indian cricket, I would swallow my pride and look at England for inspiration,” he wrote in his column for ‘The Telegraph’. Vaughan was lavish in his praise for Jos Buttler and said the England skipper has the potential to emulate India’s Mahendra Singh Dhoni in terms of longevity as a leader. “Now Jos Buttler has landed the World Cup at the first time of asking and at the age of 32 he has the chance to build his own legacy. MS Dhoni went on for years as India captain. Buttler can do the same, especially now he is concentrating on one format. There is steel there too. You can see it in Buttler’s eyes,” Vaughan said. “When you have a left-arm seamer, pace, swing, and spin, three spinners you have everything covered as a captain. That for me is the benchmark for white ball cricket – you have to have options. From 1-11 they have match-winners.” Updated Date: November 14, 2022 19:09:29 IST Tags: Bcci England Cricket Jos Buttler Michael Vaughan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-14 13:39:29","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Michael-Vaughan-England-New-Zealand-AFP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England prospect Will Smeed signs specialist white-ball deal with Somerset","link":"https://www.belfasttelegraph.co.uk/sport/cricket/england-prospect-will-smeed-signs-specialist-white-ball-deal-with-somerset-42142963.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"England prospect Will Smeed has signed a specialist white-ball deal with Somerset, turning his back on first-class cricket at the age of just 21.","content":"England prospect Will Smeed has signed a specialist white-ball deal with Somerset, turning his back on first-class cricket at the age of just 21. S meed has long been seen as one of the most talented players of his generation and came to prominence when he hit the first ever century in The Hundred earlier this year, blasting 101 not out for Birmingham Phoenix against Southern Brave. But, while Smeed has now played 55 20-over or 100-ball games, he has managed just one List A appearance and has yet to make his first-class debut. We need your consent to load this Social Media content We use a number of different Social Media outlets to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content. Manage Preference It now seems likely that could be the case throughout his career as he signed a one-year extension that keeps him at Taunton on a limited-overs contract. While others have agreed similar deals at more advanced stages of their careers, including two of England’s new T20 world champions in the shape of Alex Hales and Adil Rashid, Smeed’s decision stands out given his youth. “I feel that my game is better suited to white-ball cricket,” he said. “After a huge amount of thorough and considered discussions, I feel that I need to solely focus my attention on the limited-overs formats in order to become the very best cricketer I can be.” Daily Headlines & Evening Telegraph Newsletter Receive today's headlines directly to your inbox every morning and evening, with our free daily newsletter. Enter email address This field is required Sign Up Seemingly anticipating some of the disquiet that may meet his stance, Smeed added: “I can assure people that this not a decision that I’ve taken lightly, and I’ve spoken to a lot of people about it. The easy option would have been to carry on playing red-ball cricket and try to fit everything in and reach a certain level across all formats, but I want to try to be the best that I can be Will Smeed “I know how much our members love red-ball cricket, but unfortunately I haven’t been performing how I would like to in the longer form of the game. “The easy option would have been to carry on playing red-ball cricket and try to fit everything in and reach a certain level across all formats, but I want to try to be the best that I can be. To achieve this, I feel that I need to focus on excelling in one format. “I’m certainly not saying that I’ll never play red-ball cricket again. I just feel that this is the right decision for me and Somerset at the current time.”","pubDate":"2022-11-14 13:33:05","image_url":"https://www.belfasttelegraph.co.uk/sport/cricket/da163/42142961.ece/AUTOCROP/w1240h700/bpanews_4371fcee-b776-4832-bc5a-adf2ff8c4a7a_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Is it right to blame IPL for India's failure at ICC tournaments?","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-is-it-right-to-blame-ipl-for-indias-failure-in-icc-tournaments-11626371.html","keywords":["First Cricket News"],"creator":["Rachit Kanaujia"],"video_url":null,"description":"Is it right to blame IPL for India's failure at ICC tournaments?","content":"After a horrible show at the T20 World Cup in Dubai last year, expectations were high from Team India to deliver this time and clinch the elusive title in Australia. But, despite changing the captain and the coach and the ‘intent’, the Men in Blue choked once again in the crucial knock-out match as they were thrashed by England in the semifinals of the T20 World Cup 2022 in Adelaide.Considered one of the best teams in the world with an ocean of talent at their disposal, India have failed to live upto the expectations for quite some time now. Sadly, the Men in Blue have failed to win the ICC tournaments for nearly a decade now. Team India previously lost the final of the 2014 T20 World Cup before losing the World Cup semifinals in 2015, 2016, 2019, and 2022. Besides this, team India lost the finals of the 2017 Champions Trophy and the World Test Championship in 2021.#TeamIndia put up a fight but it was England who won the match.We had a solid run till the semifinal & enjoyed a solid support from the fans.Scorecard ▶️ https://t.co/5t1NQ2iUeJ #T20WorldCup | #INDvENG pic.twitter.com/5qPAiu8LcL— BCCI (@BCCI) November 10, 2022What’s intriguing is that every time the team gets knocked out from a major ICC tournament, the Indian Premier League (IPL) becomes the first casualty and it was the same case this time as well, as it took moments for #BoycottIPL to trend on Twitter after India bowed out of the T20 World Cup 2022.Even numerous former cricketers are of opinion that IPL is in some way or the other hindering Team India’s progress, especially when it comes to major international tournaments.Here are some of the statements made by legends of the game apropos IPL after India’s recent exit from the T20 World Cup:Sunil Gavaskar: “Changes will be there. Jab aap World Cup me jeet nahi sakte, changes honge. Hamne vo dekha hai ki jo New Zealand ke liye team jaa rahi hai, usme changes hue hain. ye jo ‘workload-workload’ ki baatein chalti hai, Kirti aur Madan ne sahi kaha ki workload sirf Bharat ke liye khelne ke liye kyun hota hai?” (When you can’t win World Cup, there will be changes. The team for New Zealand has changes. But everytime we talk about this ‘workload’, why does it only happen when they play for India?)“Aap IPL khelte hain, poora season khelte hain, vahan aap travelling karte hain… sirf pichhla IPL 4 centres me hua tha, baaki sab jagah aap idhar-udhar daudte rehte hain. Vahan par aapko thakaan nahi hoti? Vahan workload nahi hota? Sirf jab Bharat ke liye khelna hota hai, vo bhi tab jab aap non-glamorous countries me jaate hain, tab aapka workload banta hai? Ye baat galat hai.” (You play in whole season of IPL, travel from one place to other. You don’t get tired there? Is there no workload? Only when you play for India, especially when you have to tour a non-glamorous country, you remember workload? This is wrong).Wasim Akram: “Sabko yehi that ki IPL se India ko bara fark padega because IPL started in 2008. Usse pehle India 2007 me T20 World Cup jitee. Jabse se IPL shuru huyi hai, aaj tak, abhi bhi unfortunately, India kabhi T20 World Cup nehi jita. So usse phir ek question udhta hai ki kya fark padta hai ki, jo main ek interview sunn raha tha abhi, ki unke players jo overseas jaake leagues nehi khelte, ek extra league khelne ki bhi permission milo jaye, kya fark padega innlogon ki approach main?” (Everyone thought India would benefit from IPL. It started in 2008. India won the T20 World Cup in 2007. But since the start of IPL, India never won the T20 World Cup. So the question arises, I was just listening to an interview, will India’s approach change if they are allowed to play overseas leagues?)Michael Vaughan: “India are the most under-performing white-ball team in history. Every player in the world who goes to the Indian Premier League says how it improves their game but what have India ever delivered? Since winning the 50 over World Cup on home soil in 2011 what have they done? Nothing. India are playing a white-ball game that is dated and have done for years.”Now the question arises – is it right to blame IPL for India’s poor show in ICC tournaments?Well, it’s a grey area. To put it in simple words, everything has its pro and cons and IPL is no exception.But, first thing first, India’s performance in ICC tournaments has nothing to do with IPL or the tosses or the pitches on offer. India have choked in ICC tournaments because they haven’t played to their potential – a fact that is hard to digest for many.It’s a human tendency to put blame on one or the other thing as soon as something goes wrong or against their expectations and in India, where cricket is no less than a religion, fans will always resort to blame game whenever the national team will fail to deliver at the grandest stages of them all – World Cup.Now, coming to the IPL, the lucrative league to some extent justify its tagline, which reads – ‘where talent meets the opportunity’. Not only IPL has been a platform for youngsters to showcase their talent and learn from legends of the game but it has also served as an opportunity for senior players to hone their skills.However, one can argue that IPL has also been one of the main reasons behind the injuries of key players ahead of major tournaments, but it is to be noted that it’s completely players’ choice to be a part of the auction and participate in the world’s best T20 league.Since its inception, the IPL has been synonymous with growth & today is a red-letter day for India Cricket, with Brand IPL touching a new high with e-auction resulting in INR 48,390 cr value. IPL is now the 2nd most valued sporting league in the world in terms of per match value!— Jay Shah (@JayShah) June 14, 2022 If a player feels that he cannot manage the work-load and need to give rest to his body in order to stay fit for his national duty, then he must do what players like Mitchell Starc, Kylie Jamieson, Ben Stokes did – opt out of IPL. Why blame a whole league when it’s the player’s decision to be part of it?Some also say that certain players only perform in IPL and not in international games. Again, it’s an individual problem if he is unable to soak the pressure and deliver it on big stages. In fact, with top players around the world being part of the IPL, it only serves the purpose of getting enough exposure and preparing for major international tournaments.Yes, IPL is a hectic tournament, yes, it does demand a lot from players, and yes, players are prone to get injured while playing two months of continuous cricket. However, the point here is that a player is responsible towards both – his country and his franchise, but, how much weightage and importance should be given to which team totally depends on a player. Hence, the idea of blaming the whole league for an individual’s certain choices is quite vague and insensate in itself.The BCCI will utilize the revenue generated from IPL to strengthen our domestic cricket structure starting from grassroots, to boost infrastructure and spruce up facilities across India and enrich the overall cricket-watching experience.— Jay Shah (@JayShah) June 14, 2022Also, it’s the BCCI that allows contracted players to take part in IPL hence league again can’t be blamed. If the Indian cricket board thinks that the national team misses out on key services of important players due to work overload, injury issues, or tight scheduling, then the board should simply implement new policies for workload segregation or to prevent their players from participating in the IPL ahead of the important ICC tournaments. But, is the BCCI brave enough to bring in comprehensive reforms and suffer financially?Fun Fact: England pacer Sam Curran, who was named the ICC Player of the Tournament after his superb returns throughout the T20 World Cup 2022, credited IPL for his success in the tournament.“I loved my time there. Learnt a lot from these guys. It is fantastic learning from guys who have played in these tournaments and big occasions. I am always trying to keep learning and improving,” Curran said in the post-match presentation.Last year, it was New Zealand star Tim Southee who hailed IPL and dubbed it one of the main reasons behind the Black Caps making it to the final of the T20 World Cup in Dubai.Apparently, foreign players are benefitting from the IPL, but as per the critics and many fans, the Indian Premier League has been a curse for the Team India players. What an irony!To be honest, more than the IPL, it’s the team management, work-load management, team selection, scouting of players, responsibilities of team members, captaincy, and lack of intent, which should be questioned when India fail to deliver.Moreover, to hold IPL responsible for everything that goes wrong with The Men in Blue is counter-productive for Indian cricket. It will mean the real reasons don’t get addressed and the problems continue to persist.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-14 12:43:57","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Gujarat-Titans-Hardik-Pandya-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"If I was running Indian cricket, I would look at England for inspiration: Vaughan","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/indiat20-world-cup/if-i-was-running-indian-cricket-i-would-swallow-my-pride-and-look-at-england-for-inspiration-vaughan/articleshow/95511417.cms","keywords":null,"creator":null,"video_url":null,"description":"Former England captain Michael Vaughan feels the Indian cricket board (BCCI) should \"swallow pride\" and look at England for inspiration after India's semi-final exit from the T20 World Cup.","content":null,"pubDate":"2022-11-14 12:34:09","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Auction: IPL 2023 का हिस्सा नहीं होंगे पैट कमिंस और मिचेल स्टार्क! मुंबई इंडियंस ने कॉयरन पोलार्ड को किया रिलीज?","link":"https://www.abplive.com/sports/cricket/mitchell-starc-sam-billings-and-pat-cummins-set-to-miss-ipl-2023-know-details-2259222","keywords":null,"creator":["अभिनव आज़ाद"],"video_url":null,"description":"IPL Mini Auction 2023: कोच्चि में 23 दिसंबर को आईपीएल ऑक्शन 2023 (IPL Auction 2023) का आयोजन होना है. वहीं, आईपीएल टीमों (IPL Teams) को 15 नवंबर तक रिटेन और रिलीज खिलाड़ियों को फाइनल लिस्ट देनी है. मुंबई इंडियंस (Mumbai Indians) और चेन्नई सुपर किंग्स (CSK) समेत तकरीबन सभी टीमों ने अपने रिटेन और रिलीज खिलाड़ियों की फाइनल लिस्ट तैयार कर ली है. हालांकि, आईपीएल टीमों ने अब तक ऑफिशियली रिटेन और रिलीज खिलाड़ियों की फाइनल लिस्ट का ऐलान नहीं किया है. इसके अलावा आखिरी तारीख से पहले टीमें दूसरी टीमों के साथ खिलाड़ियों को ट्रेड कर रही हैं. IPL 2023 का हिस्सा नहीं होंगे पैट कमिंस और मिचेल स्टार्क! वहीं, इस बीच मीडिया रिपोर्ट्स के मुताबिक, ऑस्ट्रेलिया के पैट कमिंस और मिचेल स्टार्क आईपीएल 2023 का हिस्सा नहीं होंगे. दरअसल, पैट कमिंस कोलकाता नाइट राइडर्स का हिस्सा हैं. जबकि मिचेल स्टार्क आईपीएल मेगा ऑक्शन 2022 का हिस्सा नहीं थे, इस वजह से वह फिलहाल किसी टीम का हिस्सा नहीं हैं. इसके अलावा गुजरात टाइटंस ने मैथ्यू वेड को रिटेन करने का फैसला किया है. जबकि शाहरूख खान की टीम कोलकाता नाइट राइडर्स ने शार्दुल ठाकुर को दिल्ली कैपिटल्स से ट्रेड किया है. Mumbai Indians ने कॉयरन पोलार्ड को किया रिलीज! मीडिया रिपोर्ट्स की मानें तो मुंबई इंडियंस (Mumbai Indians) ने कॉयरन पोलार्ड (Kieron Pollard) को रिलीज कर दिया है. दरअसल, कॉयरन पोलार्ड आईपीएल 2010 (IPL 2010) से मुंबई इंडियंस के साथ जुड़े हैं. मुंबई इंडियंस की टीम सबसे ज्यादा 5 बार आईपीएल टाइटल (IPL Title) जीत चुकी है, मुबंई इंडियंस की कामयाबी में कॉयरन पोलार्ड का बड़ा योगदान माना जाता है. वहीं, इस बीच इंग्लैंड के खिलाड़ी सैम बिलिंग्स (Sam Billings) ने ट्वीट कर कहा कि वह आईपीएल 2023 (IPL 2023) में नहीं खेलेंगे. सैम बिलिंग्स के मुताबिक, वह टेस्ट क्रिकेट (Test Cricket) पर फोकस करना चाहते हैं, इस वजह से आईपीएल (IPL) के अगले सीजन में नहीं खेलेंगे. ये भी पढ़ें- IPL Auction 2023: कोलकाता नाइट राइडर्स के लिए खेलेंगे शार्दुल ठाकुर, शाहरूख खान की टीम ने दिल्ली कैपिटल्स से किया ट्रेड T20 World Cup 2022: रोहित शर्मा की टीम छक्के लगाने में टॉप पर, चैंपियन इंग्लैंड के बल्लेबाज सबसे नीचे","content":"IPL Mini Auction 2023: कोच्चि में 23 दिसंबर को आईपीएल ऑक्शन 2023 (IPL Auction 2023) का आयोजन होना है. वहीं, आईपीएल टीमों (IPL Teams) को 15 नवंबर तक रिटेन और रिलीज खिलाड़ियों को फाइनल लिस्ट देनी है. मुंबई इंडियंस (Mumbai Indians) और चेन्नई सुपर किंग्स (CSK) समेत तकरीबन सभी टीमों ने अपने रिटेन और रिलीज खिलाड़ियों की फाइनल लिस्ट तैयार कर ली है. हालांकि, आईपीएल टीमों ने अब तक ऑफिशियली रिटेन और रिलीज खिलाड़ियों की फाइनल लिस्ट का ऐलान नहीं किया है. इसके अलावा आखिरी तारीख से पहले टीमें दूसरी टीमों के साथ खिलाड़ियों को ट्रेड कर रही हैं. IPL 2023 का हिस्सा नहीं होंगे पैट कमिंस और मिचेल स्टार्क! वहीं, इस बीच मीडिया रिपोर्ट्स के मुताबिक, ऑस्ट्रेलिया के पैट कमिंस और मिचेल स्टार्क आईपीएल 2023 का हिस्सा नहीं होंगे. दरअसल, पैट कमिंस कोलकाता नाइट राइडर्स का हिस्सा हैं. जबकि मिचेल स्टार्क आईपीएल मेगा ऑक्शन 2022 का हिस्सा नहीं थे, इस वजह से वह फिलहाल किसी टीम का हिस्सा नहीं हैं. इसके अलावा गुजरात टाइटंस ने मैथ्यू वेड को रिटेन करने का फैसला किया है. जबकि शाहरूख खान की टीम कोलकाता नाइट राइडर्स ने शार्दुल ठाकुर को दिल्ली कैपिटल्स से ट्रेड किया है. Mumbai Indians ने कॉयरन पोलार्ड को किया रिलीज! googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels मीडिया रिपोर्ट्स की मानें तो मुंबई इंडियंस (Mumbai Indians) ने कॉयरन पोलार्ड (Kieron Pollard) को रिलीज कर दिया है. दरअसल, कॉयरन पोलार्ड आईपीएल 2010 (IPL 2010) से मुंबई इंडियंस के साथ जुड़े हैं. मुंबई इंडियंस की टीम सबसे ज्यादा 5 बार आईपीएल टाइटल (IPL Title) जीत चुकी है, मुबंई इंडियंस की कामयाबी में कॉयरन पोलार्ड का बड़ा योगदान माना जाता है. वहीं, इस बीच इंग्लैंड के खिलाड़ी सैम बिलिंग्स (Sam Billings) ने ट्वीट कर कहा कि वह आईपीएल 2023 (IPL 2023) में नहीं खेलेंगे. सैम बिलिंग्स के मुताबिक, वह टेस्ट क्रिकेट (Test Cricket) पर फोकस करना चाहते हैं, इस वजह से आईपीएल (IPL) के अगले सीजन में नहीं खेलेंगे. ये भी पढ़ें- IPL Auction 2023: कोलकाता नाइट राइडर्स के लिए खेलेंगे शार्दुल ठाकुर, शाहरूख खान की टीम ने दिल्ली कैपिटल्स से किया ट्रेड T20 World Cup 2022: रोहित शर्मा की टीम छक्के लगाने में टॉप पर, चैंपियन इंग्लैंड के बल्लेबाज सबसे नीचे var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-14 12:34:08","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Will Mumbai Indians release Kieron Pollard? Cricket experts opens up - Check","link":"https://zeenews.india.com/cricket/ipl-2023-retention-will-mumbai-indians-release-kieron-pollard-harbhajan-singh-tom-moody-and-irfan-pathan-opens-up-check-2535319.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma's side reteained Pollard last year ahead of the IPL 2022 auction.","content":null,"pubDate":"2022-11-14 11:51:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}