{"newsArray":[{"title":"Erik ten Hag issues Manchester United update as 'target' responds to speculation","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-injury-news-latest-26701636","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Liam Wood)"],"video_url":null,"description":"The latest news and headlines from Old Trafford as Man Utd turn their attentions to Nottingham Forest.","content":"Here are your latest Manchester United evening headlines on Friday, April 14. Ten Hag shares update on United injuries Luke Shaw and Scott McTominay could return for Manchester United against Nottingham Forest on Sunday afternoon (4.30pm). United travel over to the City Ground with uncertainty over eight injured players after centre-backs Raphael Varane and Lisandro Martinez were injured during the 2-2 Europa League quarter-final draw against Sevilla at Old Trafford. READ MORE: Every word from press conference Alejandro Garnacho has been sidelined for five weeks with an ankle problem, Shaw has missed the last two matches, Marcus Rashford is due to miss \"a few games\", McTominay was unavailable against Sevilla through injury, Donny van de Beek is out for the remainder of the season and back-up goalkeeper Tom Heaton is still recovering from a foot injury. Read the full story here >>> Frimpong responds to transfer speculation Bayer Leverkusen and Netherlands star Jeremie Frimpong has left the door open for a summer switch amid ongoing links to Manchester United. Frimpong joined Manchester City academy aged nine before permanently signing for Celtic in 2019. The right-back spent almost two seasons in Scotland while he eventually made a move to Bayer Leverkusen during the 2021 January transfer window. The 22-year-old has progressed in the Bundesliga and has made 35 starts so far this term, while he was also included by former United manager Louis van Gaal in the Netherlands' squad for the World Cup, although he did not make an appearance in the Qatar showcase. Read the full story here >>> Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. MORE TO READ: The latest Manchester United news Player ratings vs Sevilla as Sabitzer and Martial good United make Europa League squad change for injuries United share first update on Martinez injury Sabitzer gives surprise reason for Sevilla draw","pubDate":"2023-04-14 20:30:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/article26623924.ece/ALTERNATES/s615/0_GettyImages-1250520200.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man City recieve Pep Guardiola reality check as Mikel Arteta makes Arsenal admission","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-arsenal-guardiola-arteta-26702221","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The latest Man City news and headlines from Old Trafford as Pep Guardiola's attention turns to Leicester City","content":"Here are your latest Manchester City evening headlines on Friday, April 14. Guardiola gives City reality check Pep Guardiola warned against anybody expecting Manchester City to close down Arsenal despite their form. City picked up their fifth league win in a row at Southampton, then their ninth in all competitions in midweek as they smashed Bayern Munich 3-0 to put one foot in the Champions League semi-finals. Arsenal dropping points at Liverpool last week means that the title is now once again in the hands of Guardiola's defending champions. READ MORE: Every word from Guardiola press conference ahead of Leicester If they are able to beat Brighton in their game in hand, and beat Arsenal in a top-of-the-table clash later this month, they would lead the league on goal difference. With their experience and the form that they are in, the odds have shifted in City's favour . Read the full story, here Arteta's Arsenal admission Mikel Arteta admits the summer signings of Gabriel Jesus and Oleksandr Zinchenko from Manchester City have brought something different to Arsenal's Premier League title challenge. The pair swapped the north west for north London during the summer transfer window , becoming pivotal parts of Arteta 's team overnight. Jesus and Zinchenko won four Premier League titles together as City players and have brought that experience to a dressing room which was otherwise lacking in that department. Mentally, Arteta explains the impact their additions to the group have had and the high standards they have brought with them from past successes in England. Read the full story, here Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. READ NEXT: Get all the latest City news here Stones picks key moments that helped City beat Bayern Davies makes exciting Haaland prediction Grealish quality taking him to the next level Rodri praises two teammates after Bayern win","pubDate":"2023-04-14 19:51:38","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26702206.ece/ALTERNATES/s615/1_GettyImages-1250858126.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea make Mason Mount contract decision and other Manchester United transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-transfer-news-mount-26702053","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Liam Wood)"],"video_url":null,"description":"The latest transfer rumours from Old Trafford amid speculation over Chelsea player Mason Mount.","content":"Chelsea will make one last attempt to tie Mason Mount down to a new contract, according to reports, amid ongoing links between the England international and Manchester United. With one eye on the summer transfer window, Erik ten Hag wants to make at least two major signings. Harry Kane is their prime target in the search for a new striker - while United will also look to recruit another central midfielder such as Jude Bellingham, Declan Rice or Frenkie de Jong. Mount has been mooted as a possible alternative, meanwhile, as speculation over his Stamford Bridge future continues to spiral before the market reopens. Mount, 24, only has 14 months left to run on his contract, while previous discussions between his representatives and the west Londoners have stalled. READ MORE: Every word from press conference Other top-flight clubs have been linked with a move - including Liverpool and Manchester City - while Bayern Munich have also emerged as potential suitors after appointing former Blues boss Thomas Tuchel as their manager. Mount was a key part of Tuchel's squad during his time in the Stamford Bridge dugout. Reports from ESPN indicate that talks between Mount and Chelsea are set to be revived. If an agreement cannot be reached, though, the midfielder is open to leave. Elsewhere, reports from The Sun argue United are poised and ready to step up their interest in Joao Palhinha after his impressive displays with Fulham this season. Palhinha, 27, is deployed as a defensive midfielder and is thought to be valued at around £60million at Craven Cottage. Palhinha has been earmarked as a possible replacement for Scott McTominay - as cover for Casemiro - should the Academy graduate move on. United might have a fight to secure his signature, though, with Liverpool and other Premier League sides also said to be interested. Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. MORE TO READ: The latest Man United transfer news Player ratings vs Sevilla as Sabitzer and Martial good United make Europa League squad change for injuries Two players could return vs Nottingham Forest Scholes takes swipe at Fernandes for yellow card","pubDate":"2023-04-14 19:45:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/article26701980.ece/ALTERNATES/s615/0_GettyImages-1250775549.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man City 'ready to go head to head' with Liverpool for Chelsea star and more transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-transfer-news-colwill-26703254","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The latest Man City transfer rumours amid speculation over Chelsea defender Levi Colwill","content":"Manchester City have identified Chelsea defender Levi Colwill as a top target ahead of the summer transfer window, according to reports. The left-footed centre-back is currently on loan at Brighton and Hove Albion - who are also thought to be keen to keep the player permanently should his parent club choose to sell. The Evening Standard reports Colwill is also attracting interest from Liverpool , but City could look at the defender should a sale of Aymeric Laporte be sanctioned at the end of this season. Following Colwill's progress on the south coast this season, the report adds that Chelsea are keen to enter contract talks with the defender in hope of persuading him to remain at Stamford Bridge. However, it is also claimed that \"there is a feeling\" Chelsea will have to part ways with a number of homegrown stars in the summer in order to avoid breaching Financial Fair Play rules, which could open the door to a summer move for Colwill. READ MORE: Every word from Guardiola press conference ahead of Leicester Elsewhere, Spanish publication SPORT reports that the signing of Ilkay Gundogan by Barcelona is already practically complete. The City captain is set to become a free agent at the end of this season and is therefore allowed to enter talks with overseas clubs about a pre-contract agreement. An offer of €12 million per year for two seasons plus a potential third is said to be on the table at Camp Nou with Barca director Mateu Alemany and sporting advisor Jordi Cruyff rumoured to have been working on the deal \"for months\". It is claimed that the Barcelona duo met with Ilkay Gundogan's dad Ihan this week and a move is now said to be \"very close to being closed\". Ihan Gundogan also represents Andreas Christensen, who signed for the Camp Nou outfit last summer from Chelsea. Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. READ NEXT: Get all the latest City news here Stones picks key moments that helped City beat Bayern Davies makes exciting Haaland prediction Grealish quality taking him to the next level Rodri praises two teammates after Bayern win","pubDate":"2023-04-14 19:24:02","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26608232.ece/ALTERNATES/s615/0_GettyImages-1248546783.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"रिंकू सिंह-नीतिश राणा पर भारी पड़ा हैरी ब्रूक का शतक, SRH ने KKR को हराया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/video/rinku-singh-nitish-rana-heroic-inning-goes-to-vain-as-srh-beat-kkr/videoshow/99502506.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":"इंग्लैंड के बल्लेबाज हैरी ब्रुक के इंडियन प्रीमियर लीग (आईपीएल) 2023 के पहले शतक और कप्तान ऐडन मार्कराम के अर्धशतक से सनराइजर्स हैदराबाद ने शुक्रवार को यहां कोलकाता नाइटराइडर्स (केकेआर) पर 23 रन से जीत दर्ज की। ब्रुक के नाबाद 100 और मार्कराम के 50 रन से सनराइजर्स हैदराबाद ने चार विकेट पर 228 रन का विराट स्कोर खड़ा किया। ब्रुक ने 55 गेंद में 12 चौके और तीन छक्के जड़े।","pubDate":"2023-04-14 18:50:25","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"4,6,4,4,4,6... एक ओवर में तूफानी 28 रन, उमरान मलिक को नीतिश राणा ने कूट डाला","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/nitish-rana-vs-umran-malik-kkr-captain-smashed-28-runs-in-a-over-kkr-vs-srh-watch-video/articleshow/99500970.cms","keywords":null,"creator":null,"video_url":null,"description":"Nitish Rana vs Umran Malik: कोलकाता नाइटराइडर्स के खिलाफ चार विकेट पर 228 रन का विशाल स्कोर खड़ा किया। यह इस सीजन का सबसे बड़ा स्कोर है, जिसके जवाब में कोलकाता नाइटराइडर्स सात विकेट के नुकसान पर 205 रन ही बना पाया।","content":"नीतिश राणा आईपीएल इतिहास के ऐसे छठे बल्लेबाज बन गए, जिन्होंने एक ओवर की सारी गेंदों को बाउंड्री पार भेजा है। यानी हर बॉल पर छक्के-चौके। कोलकाता नाइटराइडर्स के कप्तान नीतिश राणा ने सनराइजर्स हैदराबाद के खिलाफ 41 गेंद में 75 रन की तूफानी पारी के दौरान उमरान मलिक की बैंड बजा दी। उमरान मलिक को मौजूदा दौर में भारत का सबसे तेज गेंदबाज माना जाता है। जम्मू एक्सप्रेस के नाम से मशहूर इस तूफानी पेसर के ओवर में नीतिश राणा ने चार चौके और दो छक्के समेत कुल 28 रन कूट दिए। उमरान मलिक पारी का छठा और अपना पहला ओवर फेंकने आए। 229 रन के पहाड़ जैसे लक्ष्य का पीछा करने उतरी कोलकाता नाइटराइडर्स की शुरुआत बेहद खराब रही। 20 रन पर ही तीन विकेट गिरने के बाद नीतिश राणा ने ताबडतोड़ बल्लेबाजी शुरू की। इधर उमरान मलिक 150.4 किलोमीटर प्रति घंटे की रफ्तार से गेंदबाजी कर रहे थे तो उधर से राणा जी बल्ले से थप्पड़ बरसा रहे थे। पिटाई होने के बावजूद, उमरान ने अपनी गति के साथ कभी समझौता नहीं किया और तूफानी गेंदबाजी जारी रखी। पिछले मैच में पांच छक्के जड़कर टीम को जीत दिलाने वाले रिंकू सिंह की नाबाद 58 रन (31 गेंद, चार चौके, चार छक्के) की पारी के बावजूद केकेआर की टीम निर्धारित 20 ओवर में सात विकेट पर 205 रन ही बना सकी। सनराइजर्स हैदराबाद ने फील्डिंग के दौरान कैच के कई मौके गंवाए, वरना केकेआर की टीम इस स्कोर तक नहीं पहुंची होती। उसके लिए मार्को यानसेन और मंयक मार्कंडेय ने दो दो विकेट हासिल किए। राणा की 41 गेंद की पारी का अंत 17वें ओवर में नटराजन ने किया। इससे कप्तान और रिंकू के बीच 39 गेंद में 69 रन की साझेदारी समाप्त हुई। इससे पहले ब्रुक ने पहले तीन ओवर में चार चौके और दो छक्के जड़कर आईपीएल में स्टाइल से आगमन किया जिससे सनराइजर्स हैदराबाद ने सत्र में सर्वश्रेष्ठ शुरुआत की। सनराइजर्स हैदराबाद ने ब्रुक को 13.25 करोड़ रुपये में खरीदा था, वह पहले तीन मैचों में केवल 29 रन ही बना सके थे। लेकिन उन्होंने आखिरकार लय हासिल की। ब्रुक ने 45 रन पर मिले जीवनदान का पूरा फायदा उठाया और शतक ठोका।","pubDate":"2023-04-14 17:22:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rishabh Pant Says I Am Recovering Well After Meeting Delhi Capitals Teammates","link":"https://www.thetimesofbengal.com/sports/rishabh-pant-says-i-am-recovering-well-after-meeting-delhi-capitals-teammates/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Rishabh Pant Says ‘I Am Recovering Well’ After Meeting Delhi Capitals Teammates Rishabh Pant is currently undergoing rehabilitation and recovery at the National Cricket Academy.\r Rishabh Pant chats with Sourav Ganguly on the sidelines of Delhi Capitals training. (Image: DC) New Delhi: Injured Rishabh Pant stated he is ‘recovering well’ after […]","content":"New Delhi: Injured Rishabh Pant stated he is ‘recovering well’ after the wicketkeeper batter met his Delhi Capitals teammates on the sidelines of the team’s training session in Bengaluru ahead of their IPL 2023 clash against Royal Challengers Bangalore. Pant is currently undergoing rehabilitation and recovery at the National Cricket Academy (NCA). Pant has been ruled out of action for majority of the year after suffering multiple injuries following a car accident last year. He even underwent a surgery on his right knee. “I am recovering very well and I’m getting better with each passing day. I came to visit the National Cricket Academy and the Delhi Capitals happened to be there. So I met the team,” Pant said in a media release. “I just saw how the team’s practice is carrying on. I really love to be around the boys and I am missing it,” Pant further added. “My heart and soul are always with the Delhi Capitals. I would like to wish them all the best for their next match.” The Delhi Capitals will take on Royal Challengers Bangalore at the M Chinnaswamy Stadium, Bengaluru on Saturday. Delhi have lost all their four matches so far in IPL 2023 and need to win against RCB at any cost. However, this is not the first time Pant is meeting his teammates in IPL 2023. Earlier, during Delhi Capitals’ home game against Gujarat Titans, Pant made his first public appearance at the Feroz Shah Kotla following the accident. Source link","pubDate":"2023-04-14 16:07:51","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Live cricket updates: Black Caps v Pakistan, 1st Twenty20","link":"https://www.nzherald.co.nz/sport/live-cricket-updates-black-caps-v-pakistan-1st-twenty20/F2VWFEMOR5HSVODLVCEVEK7EJA/","keywords":null,"creator":null,"video_url":null,"description":"Live updates of the Twenty20 international between the Black Caps and Pakistan.","content":"Live updates of the Twenty20 international between the Black Caps and Pakistan. The Black Caps have been set a total of 183 to win after bowling Pakistan out for 182 in the first of the five T20 series. Matt Henry was the pick of the Kiwi bowlers, taking three wickets for 32 runs off his four overs. Fakhar Zaman and Saim Ayub both scored 47 for Pakistan as the hosts looked on course for a big total before the Black Caps bowlers made inroads into the tail. Advertisement Advertise with NZME. MORE TO COME Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-04-14 16:00:00","image_url":"https://www.nzherald.co.nz/resizer/G6yWZXHjgFNa9wz2PDZXiQxZZOk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/GYD6MIO2CJD5XBAZNMCNJHH7TI.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Gujarat Cricketer Aarya Desai Joins Kolkata Knight Riders For Remainder Of Season","link":"https://www.thetimesofbengal.com/sports/gujarat-cricketer-aarya-desai-joins-kolkata-knight-riders-for-remainder-of-season/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Gujarat Cricketer Aarya Desai Joins Kolkata Knight Riders For Remainder Of Season Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian Premier League. Kolkata, Apr 13: Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian […]","content":"Kolkata, Apr 13: Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian Premier League. Desai, who represents Gujarat in domestic cricket, has played 3 First-Class matches and has 151 runs against his name. The 20-year-old joins KKR for INR 20 Lakh. Desai had made his first-class debut in January and is yet to play List A or T20 cricket for his state team. The new addition is made as regular skipper Shreyas Iyer has been ruled out of the entire season. Source link","pubDate":"2023-04-14 15:59:58","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL to be held in February with bigger window, home-away format","link":"https://www.orissapost.com/wpl-to-be-held-in-february-with-bigger-window-home-away-format/","keywords":["Sports","asia cup","Australia","BCCI","Board of Control for Cricket in India","england","ICC","Women's Premier League","World Test Championship","WPL"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: The Women’s Premier League will be played in the home-away format from the next edition onwards with a bigger window, most likely in February, a source in the Board of Control for Cricket in India (BCCI) informed Friday. The inaugural edition of the tournament was held here from March 4-26 across two venues in […]","content":"WPL to be held in February with bigger window, home-away format PTI Updated: April 14th, 2023, 20:40 IST in Sports 0 Mumbai Indians win the inaugural WPL 2023 (Image: wplt20/Twitter) Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Mumbai: The Women’s Premier League will be played in the home-away format from the next edition onwards with a bigger window, most likely in February, a source in the Board of Control for Cricket in India (BCCI) informed Friday. The inaugural edition of the tournament was held here from March 4-26 across two venues in Mumbai. Earlier this month, IPL chairman Arun Dhumal had told PTI that WPL will remain a five-team tournament for the next three seasons and it will be staged in the home and away format as that was “important for building a fan base”. The BCCI source however said it would be tough to take the league to tier-2 cities such as Indore, which doesn’t have a WPL franchise named after it. The source added that the ongoing discussions also include postponing the WPL to later in the year, around Diwali, but nothing has been finalised. Indo-Pak World Cup venue and Asia Cup still being discussed The BCCI will wait for the directives from the Indian government on their participation in the Asia Cup 2023 as well as on Pakistan’s matches in India during the World Cup, the source added, saying that all members are currently discussing the matter and a final call will be made after that. It was reported by PTI earlier that Pakistan are most likely to play a bulk of their World Cup matches in Chennai and Kolkata as the team has ‘felt safe’ at these two venues during their previous tours. BCCI chairman of selectors to be announced before Afghanistan series The BCCI is hopeful of appointing the chairman of selectors for the Indian cricket team before the three-match ODI series against Afghanistan, which is expected to be held after the ICC World Test Championship final between India and Australia in June at The Oval. The post has been lying vacant since the resignation of Chetan Sharma in February this year. The post is usually determined on seniority, as currently former India opening batter Shiv Sundar Das is the acting chairman post Sharma’s resignation. For the WTC final, India’s national coaching staff under Rahul Dravid and a few players who would have no role to play in the knockout stage of the IPL will travel to England early to bolster the preparations, the source added. BCCI confident that Bumrah will be fit for World Cup The BCCI is confident that the ace India fast bowler Jasprit Bumrah, out of action due to a back injury, will be fit in time for the World Cup 2023. India will host the 50-over tournament later this year in October-November and the schedule is expected to be declared soon. The source made it clear that the board will continue with its policy of not allowing any active Indian players to take part in various other T20 leagues around the world, including the proposed T20 league in Saudi Arabia. However, the franchises can have their presence like they have made in other competitions such as SA20 and International League T20. The source added that the ICC revenue model will be decided in the next meeting in South Africa but the dates for the same are yet to be finalised. PTI Tags: asia cup Australia BCCI Board of Control for Cricket in India england ICC Women's Premier League World Test Championship WPL Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Sunrisers Hyderabad beat Kolkata Knight Riders by 23 runs in Indian Premier League April 14, 2023 Harry Brook smashes hundred as SRH score 228/4 vs KKR April 14, 2023 Klopp cites budget constraints amid Bellingham questions April 14, 2023 Kolkata Knight Riders opt to bowl against Sunrisers Hyderabad April 14, 2023 La Liga: Clubs go head to head this weekend to avoid relegation April 14, 2023 I play a lot of match simulations, says Rahul Tewatia on finishing matches April 14, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-04-14 15:10:26","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/03/Mumbai-Indians-WPL-1.jpg?fit=300%2C180=1","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"Erik ten Hag issues Manchester United update as 'target' responds to speculation","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-injury-news-latest-26701636","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Liam Wood)"],"video_url":null,"description":"The latest news and headlines from Old Trafford as Man Utd turn their attentions to Nottingham Forest.","content":"Here are your latest Manchester United evening headlines on Friday, April 14. Ten Hag shares update on United injuries Luke Shaw and Scott McTominay could return for Manchester United against Nottingham Forest on Sunday afternoon (4.30pm). United travel over to the City Ground with uncertainty over eight injured players after centre-backs Raphael Varane and Lisandro Martinez were injured during the 2-2 Europa League quarter-final draw against Sevilla at Old Trafford. READ MORE: Every word from press conference Alejandro Garnacho has been sidelined for five weeks with an ankle problem, Shaw has missed the last two matches, Marcus Rashford is due to miss \"a few games\", McTominay was unavailable against Sevilla through injury, Donny van de Beek is out for the remainder of the season and back-up goalkeeper Tom Heaton is still recovering from a foot injury. Read the full story here >>> Frimpong responds to transfer speculation Bayer Leverkusen and Netherlands star Jeremie Frimpong has left the door open for a summer switch amid ongoing links to Manchester United. Frimpong joined Manchester City academy aged nine before permanently signing for Celtic in 2019. The right-back spent almost two seasons in Scotland while he eventually made a move to Bayer Leverkusen during the 2021 January transfer window. The 22-year-old has progressed in the Bundesliga and has made 35 starts so far this term, while he was also included by former United manager Louis van Gaal in the Netherlands' squad for the World Cup, although he did not make an appearance in the Qatar showcase. Read the full story here >>> Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. MORE TO READ: The latest Manchester United news Player ratings vs Sevilla as Sabitzer and Martial good United make Europa League squad change for injuries United share first update on Martinez injury Sabitzer gives surprise reason for Sevilla draw","pubDate":"2023-04-14 20:30:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/article26623924.ece/ALTERNATES/s615/0_GettyImages-1250520200.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man City recieve Pep Guardiola reality check as Mikel Arteta makes Arsenal admission","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-arsenal-guardiola-arteta-26702221","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The latest Man City news and headlines from Old Trafford as Pep Guardiola's attention turns to Leicester City","content":"Here are your latest Manchester City evening headlines on Friday, April 14. Guardiola gives City reality check Pep Guardiola warned against anybody expecting Manchester City to close down Arsenal despite their form. City picked up their fifth league win in a row at Southampton, then their ninth in all competitions in midweek as they smashed Bayern Munich 3-0 to put one foot in the Champions League semi-finals. Arsenal dropping points at Liverpool last week means that the title is now once again in the hands of Guardiola's defending champions. READ MORE: Every word from Guardiola press conference ahead of Leicester If they are able to beat Brighton in their game in hand, and beat Arsenal in a top-of-the-table clash later this month, they would lead the league on goal difference. With their experience and the form that they are in, the odds have shifted in City's favour . Read the full story, here Arteta's Arsenal admission Mikel Arteta admits the summer signings of Gabriel Jesus and Oleksandr Zinchenko from Manchester City have brought something different to Arsenal's Premier League title challenge. The pair swapped the north west for north London during the summer transfer window , becoming pivotal parts of Arteta 's team overnight. Jesus and Zinchenko won four Premier League titles together as City players and have brought that experience to a dressing room which was otherwise lacking in that department. Mentally, Arteta explains the impact their additions to the group have had and the high standards they have brought with them from past successes in England. Read the full story, here Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. READ NEXT: Get all the latest City news here Stones picks key moments that helped City beat Bayern Davies makes exciting Haaland prediction Grealish quality taking him to the next level Rodri praises two teammates after Bayern win","pubDate":"2023-04-14 19:51:38","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26702206.ece/ALTERNATES/s615/1_GettyImages-1250858126.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea make Mason Mount contract decision and other Manchester United transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-transfer-news-mount-26702053","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Liam Wood)"],"video_url":null,"description":"The latest transfer rumours from Old Trafford amid speculation over Chelsea player Mason Mount.","content":"Chelsea will make one last attempt to tie Mason Mount down to a new contract, according to reports, amid ongoing links between the England international and Manchester United. With one eye on the summer transfer window, Erik ten Hag wants to make at least two major signings. Harry Kane is their prime target in the search for a new striker - while United will also look to recruit another central midfielder such as Jude Bellingham, Declan Rice or Frenkie de Jong. Mount has been mooted as a possible alternative, meanwhile, as speculation over his Stamford Bridge future continues to spiral before the market reopens. Mount, 24, only has 14 months left to run on his contract, while previous discussions between his representatives and the west Londoners have stalled. READ MORE: Every word from press conference Other top-flight clubs have been linked with a move - including Liverpool and Manchester City - while Bayern Munich have also emerged as potential suitors after appointing former Blues boss Thomas Tuchel as their manager. Mount was a key part of Tuchel's squad during his time in the Stamford Bridge dugout. Reports from ESPN indicate that talks between Mount and Chelsea are set to be revived. If an agreement cannot be reached, though, the midfielder is open to leave. Elsewhere, reports from The Sun argue United are poised and ready to step up their interest in Joao Palhinha after his impressive displays with Fulham this season. Palhinha, 27, is deployed as a defensive midfielder and is thought to be valued at around £60million at Craven Cottage. Palhinha has been earmarked as a possible replacement for Scott McTominay - as cover for Casemiro - should the Academy graduate move on. United might have a fight to secure his signature, though, with Liverpool and other Premier League sides also said to be interested. Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. MORE TO READ: The latest Man United transfer news Player ratings vs Sevilla as Sabitzer and Martial good United make Europa League squad change for injuries Two players could return vs Nottingham Forest Scholes takes swipe at Fernandes for yellow card","pubDate":"2023-04-14 19:45:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/article26701980.ece/ALTERNATES/s615/0_GettyImages-1250775549.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man City 'ready to go head to head' with Liverpool for Chelsea star and more transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-transfer-news-colwill-26703254","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The latest Man City transfer rumours amid speculation over Chelsea defender Levi Colwill","content":"Manchester City have identified Chelsea defender Levi Colwill as a top target ahead of the summer transfer window, according to reports. The left-footed centre-back is currently on loan at Brighton and Hove Albion - who are also thought to be keen to keep the player permanently should his parent club choose to sell. The Evening Standard reports Colwill is also attracting interest from Liverpool , but City could look at the defender should a sale of Aymeric Laporte be sanctioned at the end of this season. Following Colwill's progress on the south coast this season, the report adds that Chelsea are keen to enter contract talks with the defender in hope of persuading him to remain at Stamford Bridge. However, it is also claimed that \"there is a feeling\" Chelsea will have to part ways with a number of homegrown stars in the summer in order to avoid breaching Financial Fair Play rules, which could open the door to a summer move for Colwill. READ MORE: Every word from Guardiola press conference ahead of Leicester Elsewhere, Spanish publication SPORT reports that the signing of Ilkay Gundogan by Barcelona is already practically complete. The City captain is set to become a free agent at the end of this season and is therefore allowed to enter talks with overseas clubs about a pre-contract agreement. An offer of €12 million per year for two seasons plus a potential third is said to be on the table at Camp Nou with Barca director Mateu Alemany and sporting advisor Jordi Cruyff rumoured to have been working on the deal \"for months\". It is claimed that the Barcelona duo met with Ilkay Gundogan's dad Ihan this week and a move is now said to be \"very close to being closed\". Ihan Gundogan also represents Andreas Christensen, who signed for the Camp Nou outfit last summer from Chelsea. Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. READ NEXT: Get all the latest City news here Stones picks key moments that helped City beat Bayern Davies makes exciting Haaland prediction Grealish quality taking him to the next level Rodri praises two teammates after Bayern win","pubDate":"2023-04-14 19:24:02","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26608232.ece/ALTERNATES/s615/0_GettyImages-1248546783.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"रिंकू सिंह-नीतिश राणा पर भारी पड़ा हैरी ब्रूक का शतक, SRH ने KKR को हराया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/video/rinku-singh-nitish-rana-heroic-inning-goes-to-vain-as-srh-beat-kkr/videoshow/99502506.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":"इंग्लैंड के बल्लेबाज हैरी ब्रुक के इंडियन प्रीमियर लीग (आईपीएल) 2023 के पहले शतक और कप्तान ऐडन मार्कराम के अर्धशतक से सनराइजर्स हैदराबाद ने शुक्रवार को यहां कोलकाता नाइटराइडर्स (केकेआर) पर 23 रन से जीत दर्ज की। ब्रुक के नाबाद 100 और मार्कराम के 50 रन से सनराइजर्स हैदराबाद ने चार विकेट पर 228 रन का विराट स्कोर खड़ा किया। ब्रुक ने 55 गेंद में 12 चौके और तीन छक्के जड़े।","pubDate":"2023-04-14 18:50:25","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"4,6,4,4,4,6... एक ओवर में तूफानी 28 रन, उमरान मलिक को नीतिश राणा ने कूट डाला","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/nitish-rana-vs-umran-malik-kkr-captain-smashed-28-runs-in-a-over-kkr-vs-srh-watch-video/articleshow/99500970.cms","keywords":null,"creator":null,"video_url":null,"description":"Nitish Rana vs Umran Malik: कोलकाता नाइटराइडर्स के खिलाफ चार विकेट पर 228 रन का विशाल स्कोर खड़ा किया। यह इस सीजन का सबसे बड़ा स्कोर है, जिसके जवाब में कोलकाता नाइटराइडर्स सात विकेट के नुकसान पर 205 रन ही बना पाया।","content":"नीतिश राणा आईपीएल इतिहास के ऐसे छठे बल्लेबाज बन गए, जिन्होंने एक ओवर की सारी गेंदों को बाउंड्री पार भेजा है। यानी हर बॉल पर छक्के-चौके। कोलकाता नाइटराइडर्स के कप्तान नीतिश राणा ने सनराइजर्स हैदराबाद के खिलाफ 41 गेंद में 75 रन की तूफानी पारी के दौरान उमरान मलिक की बैंड बजा दी। उमरान मलिक को मौजूदा दौर में भारत का सबसे तेज गेंदबाज माना जाता है। जम्मू एक्सप्रेस के नाम से मशहूर इस तूफानी पेसर के ओवर में नीतिश राणा ने चार चौके और दो छक्के समेत कुल 28 रन कूट दिए। उमरान मलिक पारी का छठा और अपना पहला ओवर फेंकने आए। 229 रन के पहाड़ जैसे लक्ष्य का पीछा करने उतरी कोलकाता नाइटराइडर्स की शुरुआत बेहद खराब रही। 20 रन पर ही तीन विकेट गिरने के बाद नीतिश राणा ने ताबडतोड़ बल्लेबाजी शुरू की। इधर उमरान मलिक 150.4 किलोमीटर प्रति घंटे की रफ्तार से गेंदबाजी कर रहे थे तो उधर से राणा जी बल्ले से थप्पड़ बरसा रहे थे। पिटाई होने के बावजूद, उमरान ने अपनी गति के साथ कभी समझौता नहीं किया और तूफानी गेंदबाजी जारी रखी। पिछले मैच में पांच छक्के जड़कर टीम को जीत दिलाने वाले रिंकू सिंह की नाबाद 58 रन (31 गेंद, चार चौके, चार छक्के) की पारी के बावजूद केकेआर की टीम निर्धारित 20 ओवर में सात विकेट पर 205 रन ही बना सकी। सनराइजर्स हैदराबाद ने फील्डिंग के दौरान कैच के कई मौके गंवाए, वरना केकेआर की टीम इस स्कोर तक नहीं पहुंची होती। उसके लिए मार्को यानसेन और मंयक मार्कंडेय ने दो दो विकेट हासिल किए। राणा की 41 गेंद की पारी का अंत 17वें ओवर में नटराजन ने किया। इससे कप्तान और रिंकू के बीच 39 गेंद में 69 रन की साझेदारी समाप्त हुई। इससे पहले ब्रुक ने पहले तीन ओवर में चार चौके और दो छक्के जड़कर आईपीएल में स्टाइल से आगमन किया जिससे सनराइजर्स हैदराबाद ने सत्र में सर्वश्रेष्ठ शुरुआत की। सनराइजर्स हैदराबाद ने ब्रुक को 13.25 करोड़ रुपये में खरीदा था, वह पहले तीन मैचों में केवल 29 रन ही बना सके थे। लेकिन उन्होंने आखिरकार लय हासिल की। ब्रुक ने 45 रन पर मिले जीवनदान का पूरा फायदा उठाया और शतक ठोका।","pubDate":"2023-04-14 17:22:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rishabh Pant Says I Am Recovering Well After Meeting Delhi Capitals Teammates","link":"https://www.thetimesofbengal.com/sports/rishabh-pant-says-i-am-recovering-well-after-meeting-delhi-capitals-teammates/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Rishabh Pant Says ‘I Am Recovering Well’ After Meeting Delhi Capitals Teammates Rishabh Pant is currently undergoing rehabilitation and recovery at the National Cricket Academy.\r Rishabh Pant chats with Sourav Ganguly on the sidelines of Delhi Capitals training. (Image: DC) New Delhi: Injured Rishabh Pant stated he is ‘recovering well’ after […]","content":"New Delhi: Injured Rishabh Pant stated he is ‘recovering well’ after the wicketkeeper batter met his Delhi Capitals teammates on the sidelines of the team’s training session in Bengaluru ahead of their IPL 2023 clash against Royal Challengers Bangalore. Pant is currently undergoing rehabilitation and recovery at the National Cricket Academy (NCA). Pant has been ruled out of action for majority of the year after suffering multiple injuries following a car accident last year. He even underwent a surgery on his right knee. “I am recovering very well and I’m getting better with each passing day. I came to visit the National Cricket Academy and the Delhi Capitals happened to be there. So I met the team,” Pant said in a media release. “I just saw how the team’s practice is carrying on. I really love to be around the boys and I am missing it,” Pant further added. “My heart and soul are always with the Delhi Capitals. I would like to wish them all the best for their next match.” The Delhi Capitals will take on Royal Challengers Bangalore at the M Chinnaswamy Stadium, Bengaluru on Saturday. Delhi have lost all their four matches so far in IPL 2023 and need to win against RCB at any cost. However, this is not the first time Pant is meeting his teammates in IPL 2023. Earlier, during Delhi Capitals’ home game against Gujarat Titans, Pant made his first public appearance at the Feroz Shah Kotla following the accident. Source link","pubDate":"2023-04-14 16:07:51","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Live cricket updates: Black Caps v Pakistan, 1st Twenty20","link":"https://www.nzherald.co.nz/sport/live-cricket-updates-black-caps-v-pakistan-1st-twenty20/F2VWFEMOR5HSVODLVCEVEK7EJA/","keywords":null,"creator":null,"video_url":null,"description":"Live updates of the Twenty20 international between the Black Caps and Pakistan.","content":"Live updates of the Twenty20 international between the Black Caps and Pakistan. The Black Caps have been set a total of 183 to win after bowling Pakistan out for 182 in the first of the five T20 series. Matt Henry was the pick of the Kiwi bowlers, taking three wickets for 32 runs off his four overs. Fakhar Zaman and Saim Ayub both scored 47 for Pakistan as the hosts looked on course for a big total before the Black Caps bowlers made inroads into the tail. Advertisement Advertise with NZME. MORE TO COME Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-04-14 16:00:00","image_url":"https://www.nzherald.co.nz/resizer/G6yWZXHjgFNa9wz2PDZXiQxZZOk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/GYD6MIO2CJD5XBAZNMCNJHH7TI.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Gujarat Cricketer Aarya Desai Joins Kolkata Knight Riders For Remainder Of Season","link":"https://www.thetimesofbengal.com/sports/gujarat-cricketer-aarya-desai-joins-kolkata-knight-riders-for-remainder-of-season/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Gujarat Cricketer Aarya Desai Joins Kolkata Knight Riders For Remainder Of Season Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian Premier League. Kolkata, Apr 13: Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian […]","content":"Kolkata, Apr 13: Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian Premier League. Desai, who represents Gujarat in domestic cricket, has played 3 First-Class matches and has 151 runs against his name. The 20-year-old joins KKR for INR 20 Lakh. Desai had made his first-class debut in January and is yet to play List A or T20 cricket for his state team. The new addition is made as regular skipper Shreyas Iyer has been ruled out of the entire season. Source link","pubDate":"2023-04-14 15:59:58","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL to be held in February with bigger window, home-away format","link":"https://www.orissapost.com/wpl-to-be-held-in-february-with-bigger-window-home-away-format/","keywords":["Sports","asia cup","Australia","BCCI","Board of Control for Cricket in India","england","ICC","Women's Premier League","World Test Championship","WPL"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: The Women’s Premier League will be played in the home-away format from the next edition onwards with a bigger window, most likely in February, a source in the Board of Control for Cricket in India (BCCI) informed Friday. The inaugural edition of the tournament was held here from March 4-26 across two venues in […]","content":"WPL to be held in February with bigger window, home-away format PTI Updated: April 14th, 2023, 20:40 IST in Sports 0 Mumbai Indians win the inaugural WPL 2023 (Image: wplt20/Twitter) Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Mumbai: The Women’s Premier League will be played in the home-away format from the next edition onwards with a bigger window, most likely in February, a source in the Board of Control for Cricket in India (BCCI) informed Friday. The inaugural edition of the tournament was held here from March 4-26 across two venues in Mumbai. Earlier this month, IPL chairman Arun Dhumal had told PTI that WPL will remain a five-team tournament for the next three seasons and it will be staged in the home and away format as that was “important for building a fan base”. The BCCI source however said it would be tough to take the league to tier-2 cities such as Indore, which doesn’t have a WPL franchise named after it. The source added that the ongoing discussions also include postponing the WPL to later in the year, around Diwali, but nothing has been finalised. Indo-Pak World Cup venue and Asia Cup still being discussed The BCCI will wait for the directives from the Indian government on their participation in the Asia Cup 2023 as well as on Pakistan’s matches in India during the World Cup, the source added, saying that all members are currently discussing the matter and a final call will be made after that. It was reported by PTI earlier that Pakistan are most likely to play a bulk of their World Cup matches in Chennai and Kolkata as the team has ‘felt safe’ at these two venues during their previous tours. BCCI chairman of selectors to be announced before Afghanistan series The BCCI is hopeful of appointing the chairman of selectors for the Indian cricket team before the three-match ODI series against Afghanistan, which is expected to be held after the ICC World Test Championship final between India and Australia in June at The Oval. The post has been lying vacant since the resignation of Chetan Sharma in February this year. The post is usually determined on seniority, as currently former India opening batter Shiv Sundar Das is the acting chairman post Sharma’s resignation. For the WTC final, India’s national coaching staff under Rahul Dravid and a few players who would have no role to play in the knockout stage of the IPL will travel to England early to bolster the preparations, the source added. BCCI confident that Bumrah will be fit for World Cup The BCCI is confident that the ace India fast bowler Jasprit Bumrah, out of action due to a back injury, will be fit in time for the World Cup 2023. India will host the 50-over tournament later this year in October-November and the schedule is expected to be declared soon. The source made it clear that the board will continue with its policy of not allowing any active Indian players to take part in various other T20 leagues around the world, including the proposed T20 league in Saudi Arabia. However, the franchises can have their presence like they have made in other competitions such as SA20 and International League T20. The source added that the ICC revenue model will be decided in the next meeting in South Africa but the dates for the same are yet to be finalised. PTI Tags: asia cup Australia BCCI Board of Control for Cricket in India england ICC Women's Premier League World Test Championship WPL Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Sunrisers Hyderabad beat Kolkata Knight Riders by 23 runs in Indian Premier League April 14, 2023 Harry Brook smashes hundred as SRH score 228/4 vs KKR April 14, 2023 Klopp cites budget constraints amid Bellingham questions April 14, 2023 Kolkata Knight Riders opt to bowl against Sunrisers Hyderabad April 14, 2023 La Liga: Clubs go head to head this weekend to avoid relegation April 14, 2023 I play a lot of match simulations, says Rahul Tewatia on finishing matches April 14, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-04-14 15:10:26","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/03/Mumbai-Indians-WPL-1.jpg?fit=300%2C180=1","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"Erik ten Hag issues Manchester United update as 'target' responds to speculation","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-injury-news-latest-26701636","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Liam Wood)"],"video_url":null,"description":"The latest news and headlines from Old Trafford as Man Utd turn their attentions to Nottingham Forest.","content":"Here are your latest Manchester United evening headlines on Friday, April 14. Ten Hag shares update on United injuries Luke Shaw and Scott McTominay could return for Manchester United against Nottingham Forest on Sunday afternoon (4.30pm). United travel over to the City Ground with uncertainty over eight injured players after centre-backs Raphael Varane and Lisandro Martinez were injured during the 2-2 Europa League quarter-final draw against Sevilla at Old Trafford. READ MORE: Every word from press conference Alejandro Garnacho has been sidelined for five weeks with an ankle problem, Shaw has missed the last two matches, Marcus Rashford is due to miss \"a few games\", McTominay was unavailable against Sevilla through injury, Donny van de Beek is out for the remainder of the season and back-up goalkeeper Tom Heaton is still recovering from a foot injury. Read the full story here >>> Frimpong responds to transfer speculation Bayer Leverkusen and Netherlands star Jeremie Frimpong has left the door open for a summer switch amid ongoing links to Manchester United. Frimpong joined Manchester City academy aged nine before permanently signing for Celtic in 2019. The right-back spent almost two seasons in Scotland while he eventually made a move to Bayer Leverkusen during the 2021 January transfer window. The 22-year-old has progressed in the Bundesliga and has made 35 starts so far this term, while he was also included by former United manager Louis van Gaal in the Netherlands' squad for the World Cup, although he did not make an appearance in the Qatar showcase. Read the full story here >>> Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. MORE TO READ: The latest Manchester United news Player ratings vs Sevilla as Sabitzer and Martial good United make Europa League squad change for injuries United share first update on Martinez injury Sabitzer gives surprise reason for Sevilla draw","pubDate":"2023-04-14 20:30:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/article26623924.ece/ALTERNATES/s615/0_GettyImages-1250520200.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man City recieve Pep Guardiola reality check as Mikel Arteta makes Arsenal admission","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-arsenal-guardiola-arteta-26702221","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The latest Man City news and headlines from Old Trafford as Pep Guardiola's attention turns to Leicester City","content":"Here are your latest Manchester City evening headlines on Friday, April 14. Guardiola gives City reality check Pep Guardiola warned against anybody expecting Manchester City to close down Arsenal despite their form. City picked up their fifth league win in a row at Southampton, then their ninth in all competitions in midweek as they smashed Bayern Munich 3-0 to put one foot in the Champions League semi-finals. Arsenal dropping points at Liverpool last week means that the title is now once again in the hands of Guardiola's defending champions. READ MORE: Every word from Guardiola press conference ahead of Leicester If they are able to beat Brighton in their game in hand, and beat Arsenal in a top-of-the-table clash later this month, they would lead the league on goal difference. With their experience and the form that they are in, the odds have shifted in City's favour . Read the full story, here Arteta's Arsenal admission Mikel Arteta admits the summer signings of Gabriel Jesus and Oleksandr Zinchenko from Manchester City have brought something different to Arsenal's Premier League title challenge. The pair swapped the north west for north London during the summer transfer window , becoming pivotal parts of Arteta 's team overnight. Jesus and Zinchenko won four Premier League titles together as City players and have brought that experience to a dressing room which was otherwise lacking in that department. Mentally, Arteta explains the impact their additions to the group have had and the high standards they have brought with them from past successes in England. Read the full story, here Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. READ NEXT: Get all the latest City news here Stones picks key moments that helped City beat Bayern Davies makes exciting Haaland prediction Grealish quality taking him to the next level Rodri praises two teammates after Bayern win","pubDate":"2023-04-14 19:51:38","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26702206.ece/ALTERNATES/s615/1_GettyImages-1250858126.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea make Mason Mount contract decision and other Manchester United transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-transfer-news-mount-26702053","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Liam Wood)"],"video_url":null,"description":"The latest transfer rumours from Old Trafford amid speculation over Chelsea player Mason Mount.","content":"Chelsea will make one last attempt to tie Mason Mount down to a new contract, according to reports, amid ongoing links between the England international and Manchester United. With one eye on the summer transfer window, Erik ten Hag wants to make at least two major signings. Harry Kane is their prime target in the search for a new striker - while United will also look to recruit another central midfielder such as Jude Bellingham, Declan Rice or Frenkie de Jong. Mount has been mooted as a possible alternative, meanwhile, as speculation over his Stamford Bridge future continues to spiral before the market reopens. Mount, 24, only has 14 months left to run on his contract, while previous discussions between his representatives and the west Londoners have stalled. READ MORE: Every word from press conference Other top-flight clubs have been linked with a move - including Liverpool and Manchester City - while Bayern Munich have also emerged as potential suitors after appointing former Blues boss Thomas Tuchel as their manager. Mount was a key part of Tuchel's squad during his time in the Stamford Bridge dugout. Reports from ESPN indicate that talks between Mount and Chelsea are set to be revived. If an agreement cannot be reached, though, the midfielder is open to leave. Elsewhere, reports from The Sun argue United are poised and ready to step up their interest in Joao Palhinha after his impressive displays with Fulham this season. Palhinha, 27, is deployed as a defensive midfielder and is thought to be valued at around £60million at Craven Cottage. Palhinha has been earmarked as a possible replacement for Scott McTominay - as cover for Casemiro - should the Academy graduate move on. United might have a fight to secure his signature, though, with Liverpool and other Premier League sides also said to be interested. Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. MORE TO READ: The latest Man United transfer news Player ratings vs Sevilla as Sabitzer and Martial good United make Europa League squad change for injuries Two players could return vs Nottingham Forest Scholes takes swipe at Fernandes for yellow card","pubDate":"2023-04-14 19:45:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/article26701980.ece/ALTERNATES/s615/0_GettyImages-1250775549.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man City 'ready to go head to head' with Liverpool for Chelsea star and more transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-transfer-news-colwill-26703254","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The latest Man City transfer rumours amid speculation over Chelsea defender Levi Colwill","content":"Manchester City have identified Chelsea defender Levi Colwill as a top target ahead of the summer transfer window, according to reports. The left-footed centre-back is currently on loan at Brighton and Hove Albion - who are also thought to be keen to keep the player permanently should his parent club choose to sell. The Evening Standard reports Colwill is also attracting interest from Liverpool , but City could look at the defender should a sale of Aymeric Laporte be sanctioned at the end of this season. Following Colwill's progress on the south coast this season, the report adds that Chelsea are keen to enter contract talks with the defender in hope of persuading him to remain at Stamford Bridge. However, it is also claimed that \"there is a feeling\" Chelsea will have to part ways with a number of homegrown stars in the summer in order to avoid breaching Financial Fair Play rules, which could open the door to a summer move for Colwill. READ MORE: Every word from Guardiola press conference ahead of Leicester Elsewhere, Spanish publication SPORT reports that the signing of Ilkay Gundogan by Barcelona is already practically complete. The City captain is set to become a free agent at the end of this season and is therefore allowed to enter talks with overseas clubs about a pre-contract agreement. An offer of €12 million per year for two seasons plus a potential third is said to be on the table at Camp Nou with Barca director Mateu Alemany and sporting advisor Jordi Cruyff rumoured to have been working on the deal \"for months\". It is claimed that the Barcelona duo met with Ilkay Gundogan's dad Ihan this week and a move is now said to be \"very close to being closed\". Ihan Gundogan also represents Andreas Christensen, who signed for the Camp Nou outfit last summer from Chelsea. Ultimate Guide to the 2023 County Cricket Season It's set to be a sizzling summer of cricket, and your ultimate guide to the domestic season ahead is available now to order. This special publication - written by experts who cover the county game week in, week out - is crammed full of interviews with coaches, captains and players, covering all 18 first-class counties, along with every side's fixture lists for the LV= Insurance County Championship, Vitality Blast and One-day Cup. We also have previews and fixtures for each of the women's regional teams, along with an exclusive interview with the ECB's Director of Men's Cricket Rob Key. CLICK HERE TO ORDER NOW Available to purchase in most supermarkets, high street retailers, and independent newsagents in England and Wales from March 22, 2023. READ NEXT: Get all the latest City news here Stones picks key moments that helped City beat Bayern Davies makes exciting Haaland prediction Grealish quality taking him to the next level Rodri praises two teammates after Bayern win","pubDate":"2023-04-14 19:24:02","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26608232.ece/ALTERNATES/s615/0_GettyImages-1248546783.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"रिंकू सिंह-नीतिश राणा पर भारी पड़ा हैरी ब्रूक का शतक, SRH ने KKR को हराया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/video/rinku-singh-nitish-rana-heroic-inning-goes-to-vain-as-srh-beat-kkr/videoshow/99502506.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":"इंग्लैंड के बल्लेबाज हैरी ब्रुक के इंडियन प्रीमियर लीग (आईपीएल) 2023 के पहले शतक और कप्तान ऐडन मार्कराम के अर्धशतक से सनराइजर्स हैदराबाद ने शुक्रवार को यहां कोलकाता नाइटराइडर्स (केकेआर) पर 23 रन से जीत दर्ज की। ब्रुक के नाबाद 100 और मार्कराम के 50 रन से सनराइजर्स हैदराबाद ने चार विकेट पर 228 रन का विराट स्कोर खड़ा किया। ब्रुक ने 55 गेंद में 12 चौके और तीन छक्के जड़े।","pubDate":"2023-04-14 18:50:25","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"4,6,4,4,4,6... एक ओवर में तूफानी 28 रन, उमरान मलिक को नीतिश राणा ने कूट डाला","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/nitish-rana-vs-umran-malik-kkr-captain-smashed-28-runs-in-a-over-kkr-vs-srh-watch-video/articleshow/99500970.cms","keywords":null,"creator":null,"video_url":null,"description":"Nitish Rana vs Umran Malik: कोलकाता नाइटराइडर्स के खिलाफ चार विकेट पर 228 रन का विशाल स्कोर खड़ा किया। यह इस सीजन का सबसे बड़ा स्कोर है, जिसके जवाब में कोलकाता नाइटराइडर्स सात विकेट के नुकसान पर 205 रन ही बना पाया।","content":"नीतिश राणा आईपीएल इतिहास के ऐसे छठे बल्लेबाज बन गए, जिन्होंने एक ओवर की सारी गेंदों को बाउंड्री पार भेजा है। यानी हर बॉल पर छक्के-चौके। कोलकाता नाइटराइडर्स के कप्तान नीतिश राणा ने सनराइजर्स हैदराबाद के खिलाफ 41 गेंद में 75 रन की तूफानी पारी के दौरान उमरान मलिक की बैंड बजा दी। उमरान मलिक को मौजूदा दौर में भारत का सबसे तेज गेंदबाज माना जाता है। जम्मू एक्सप्रेस के नाम से मशहूर इस तूफानी पेसर के ओवर में नीतिश राणा ने चार चौके और दो छक्के समेत कुल 28 रन कूट दिए। उमरान मलिक पारी का छठा और अपना पहला ओवर फेंकने आए। 229 रन के पहाड़ जैसे लक्ष्य का पीछा करने उतरी कोलकाता नाइटराइडर्स की शुरुआत बेहद खराब रही। 20 रन पर ही तीन विकेट गिरने के बाद नीतिश राणा ने ताबडतोड़ बल्लेबाजी शुरू की। इधर उमरान मलिक 150.4 किलोमीटर प्रति घंटे की रफ्तार से गेंदबाजी कर रहे थे तो उधर से राणा जी बल्ले से थप्पड़ बरसा रहे थे। पिटाई होने के बावजूद, उमरान ने अपनी गति के साथ कभी समझौता नहीं किया और तूफानी गेंदबाजी जारी रखी। पिछले मैच में पांच छक्के जड़कर टीम को जीत दिलाने वाले रिंकू सिंह की नाबाद 58 रन (31 गेंद, चार चौके, चार छक्के) की पारी के बावजूद केकेआर की टीम निर्धारित 20 ओवर में सात विकेट पर 205 रन ही बना सकी। सनराइजर्स हैदराबाद ने फील्डिंग के दौरान कैच के कई मौके गंवाए, वरना केकेआर की टीम इस स्कोर तक नहीं पहुंची होती। उसके लिए मार्को यानसेन और मंयक मार्कंडेय ने दो दो विकेट हासिल किए। राणा की 41 गेंद की पारी का अंत 17वें ओवर में नटराजन ने किया। इससे कप्तान और रिंकू के बीच 39 गेंद में 69 रन की साझेदारी समाप्त हुई। इससे पहले ब्रुक ने पहले तीन ओवर में चार चौके और दो छक्के जड़कर आईपीएल में स्टाइल से आगमन किया जिससे सनराइजर्स हैदराबाद ने सत्र में सर्वश्रेष्ठ शुरुआत की। सनराइजर्स हैदराबाद ने ब्रुक को 13.25 करोड़ रुपये में खरीदा था, वह पहले तीन मैचों में केवल 29 रन ही बना सके थे। लेकिन उन्होंने आखिरकार लय हासिल की। ब्रुक ने 45 रन पर मिले जीवनदान का पूरा फायदा उठाया और शतक ठोका।","pubDate":"2023-04-14 17:22:40","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rishabh Pant Says I Am Recovering Well After Meeting Delhi Capitals Teammates","link":"https://www.thetimesofbengal.com/sports/rishabh-pant-says-i-am-recovering-well-after-meeting-delhi-capitals-teammates/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Rishabh Pant Says ‘I Am Recovering Well’ After Meeting Delhi Capitals Teammates Rishabh Pant is currently undergoing rehabilitation and recovery at the National Cricket Academy.\r Rishabh Pant chats with Sourav Ganguly on the sidelines of Delhi Capitals training. (Image: DC) New Delhi: Injured Rishabh Pant stated he is ‘recovering well’ after […]","content":"New Delhi: Injured Rishabh Pant stated he is ‘recovering well’ after the wicketkeeper batter met his Delhi Capitals teammates on the sidelines of the team’s training session in Bengaluru ahead of their IPL 2023 clash against Royal Challengers Bangalore. Pant is currently undergoing rehabilitation and recovery at the National Cricket Academy (NCA). Pant has been ruled out of action for majority of the year after suffering multiple injuries following a car accident last year. He even underwent a surgery on his right knee. “I am recovering very well and I’m getting better with each passing day. I came to visit the National Cricket Academy and the Delhi Capitals happened to be there. So I met the team,” Pant said in a media release. “I just saw how the team’s practice is carrying on. I really love to be around the boys and I am missing it,” Pant further added. “My heart and soul are always with the Delhi Capitals. I would like to wish them all the best for their next match.” The Delhi Capitals will take on Royal Challengers Bangalore at the M Chinnaswamy Stadium, Bengaluru on Saturday. Delhi have lost all their four matches so far in IPL 2023 and need to win against RCB at any cost. However, this is not the first time Pant is meeting his teammates in IPL 2023. Earlier, during Delhi Capitals’ home game against Gujarat Titans, Pant made his first public appearance at the Feroz Shah Kotla following the accident. Source link","pubDate":"2023-04-14 16:07:51","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Live cricket updates: Black Caps v Pakistan, 1st Twenty20","link":"https://www.nzherald.co.nz/sport/live-cricket-updates-black-caps-v-pakistan-1st-twenty20/F2VWFEMOR5HSVODLVCEVEK7EJA/","keywords":null,"creator":null,"video_url":null,"description":"Live updates of the Twenty20 international between the Black Caps and Pakistan.","content":"Live updates of the Twenty20 international between the Black Caps and Pakistan. The Black Caps have been set a total of 183 to win after bowling Pakistan out for 182 in the first of the five T20 series. Matt Henry was the pick of the Kiwi bowlers, taking three wickets for 32 runs off his four overs. Fakhar Zaman and Saim Ayub both scored 47 for Pakistan as the hosts looked on course for a big total before the Black Caps bowlers made inroads into the tail. Advertisement Advertise with NZME. MORE TO COME Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-04-14 16:00:00","image_url":"https://www.nzherald.co.nz/resizer/G6yWZXHjgFNa9wz2PDZXiQxZZOk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/GYD6MIO2CJD5XBAZNMCNJHH7TI.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Gujarat Cricketer Aarya Desai Joins Kolkata Knight Riders For Remainder Of Season","link":"https://www.thetimesofbengal.com/sports/gujarat-cricketer-aarya-desai-joins-kolkata-knight-riders-for-remainder-of-season/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023: Gujarat Cricketer Aarya Desai Joins Kolkata Knight Riders For Remainder Of Season Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian Premier League. Kolkata, Apr 13: Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian […]","content":"Kolkata, Apr 13: Kolkata Knight Riders (KKR) on Friday brought Aarya Desai on board for the remainder of the Indian Premier League. Desai, who represents Gujarat in domestic cricket, has played 3 First-Class matches and has 151 runs against his name. The 20-year-old joins KKR for INR 20 Lakh. Desai had made his first-class debut in January and is yet to play List A or T20 cricket for his state team. The new addition is made as regular skipper Shreyas Iyer has been ruled out of the entire season. Source link","pubDate":"2023-04-14 15:59:58","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL to be held in February with bigger window, home-away format","link":"https://www.orissapost.com/wpl-to-be-held-in-february-with-bigger-window-home-away-format/","keywords":["Sports","asia cup","Australia","BCCI","Board of Control for Cricket in India","england","ICC","Women's Premier League","World Test Championship","WPL"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: The Women’s Premier League will be played in the home-away format from the next edition onwards with a bigger window, most likely in February, a source in the Board of Control for Cricket in India (BCCI) informed Friday. The inaugural edition of the tournament was held here from March 4-26 across two venues in […]","content":"WPL to be held in February with bigger window, home-away format PTI Updated: April 14th, 2023, 20:40 IST in Sports 0 Mumbai Indians win the inaugural WPL 2023 (Image: wplt20/Twitter) Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Mumbai: The Women’s Premier League will be played in the home-away format from the next edition onwards with a bigger window, most likely in February, a source in the Board of Control for Cricket in India (BCCI) informed Friday. The inaugural edition of the tournament was held here from March 4-26 across two venues in Mumbai. Earlier this month, IPL chairman Arun Dhumal had told PTI that WPL will remain a five-team tournament for the next three seasons and it will be staged in the home and away format as that was “important for building a fan base”. The BCCI source however said it would be tough to take the league to tier-2 cities such as Indore, which doesn’t have a WPL franchise named after it. The source added that the ongoing discussions also include postponing the WPL to later in the year, around Diwali, but nothing has been finalised. Indo-Pak World Cup venue and Asia Cup still being discussed The BCCI will wait for the directives from the Indian government on their participation in the Asia Cup 2023 as well as on Pakistan’s matches in India during the World Cup, the source added, saying that all members are currently discussing the matter and a final call will be made after that. It was reported by PTI earlier that Pakistan are most likely to play a bulk of their World Cup matches in Chennai and Kolkata as the team has ‘felt safe’ at these two venues during their previous tours. BCCI chairman of selectors to be announced before Afghanistan series The BCCI is hopeful of appointing the chairman of selectors for the Indian cricket team before the three-match ODI series against Afghanistan, which is expected to be held after the ICC World Test Championship final between India and Australia in June at The Oval. The post has been lying vacant since the resignation of Chetan Sharma in February this year. The post is usually determined on seniority, as currently former India opening batter Shiv Sundar Das is the acting chairman post Sharma’s resignation. For the WTC final, India’s national coaching staff under Rahul Dravid and a few players who would have no role to play in the knockout stage of the IPL will travel to England early to bolster the preparations, the source added. BCCI confident that Bumrah will be fit for World Cup The BCCI is confident that the ace India fast bowler Jasprit Bumrah, out of action due to a back injury, will be fit in time for the World Cup 2023. India will host the 50-over tournament later this year in October-November and the schedule is expected to be declared soon. The source made it clear that the board will continue with its policy of not allowing any active Indian players to take part in various other T20 leagues around the world, including the proposed T20 league in Saudi Arabia. However, the franchises can have their presence like they have made in other competitions such as SA20 and International League T20. The source added that the ICC revenue model will be decided in the next meeting in South Africa but the dates for the same are yet to be finalised. PTI Tags: asia cup Australia BCCI Board of Control for Cricket in India england ICC Women's Premier League World Test Championship WPL Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Sunrisers Hyderabad beat Kolkata Knight Riders by 23 runs in Indian Premier League April 14, 2023 Harry Brook smashes hundred as SRH score 228/4 vs KKR April 14, 2023 Klopp cites budget constraints amid Bellingham questions April 14, 2023 Kolkata Knight Riders opt to bowl against Sunrisers Hyderabad April 14, 2023 La Liga: Clubs go head to head this weekend to avoid relegation April 14, 2023 I play a lot of match simulations, says Rahul Tewatia on finishing matches April 14, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-04-14 15:10:26","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/03/Mumbai-Indians-WPL-1.jpg?fit=300%2C180=1","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"}]}