{"newsArray":[{"title":"New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/new-star-club-beat-sg-club-by-7-wickets-in-the-assam-premier-club-cricket-championship-570910","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship tie held at Amingaon ground here today. Arun Sonar of New Star scored half century in the game.","content":"Our Sports Reporter GUWAHATI: New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship tie held at Amingaon ground here today. Arun Sonar of New Star scored half century in the game. Brief scores: SG Club 115 (37.5 overs), Shivam Nath (35), Prince Thakur 4-24; New Star Club 118-3 (20.4 overs), Arun Sonar 57. Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","pubDate":"2022-01-01 09:12:47","full_description":"Our Sports Reporter GUWAHATI: New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship tie held at Amingaon ground here today. Arun Sonar of New Star scored half century in the game. Brief scores: SG Club 115 (37.5 overs), Shivam Nath (35), Prince Thakur 4-24; New Star Club 118-3 (20.4 overs), Arun Sonar 57. Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291626-8.jpg","source_id":"sentinel"},{"title":"BCCI postpones Vijay Merchant Trophy after surge in COVID-19 cases","link":"https://www.sentinelassam.com/sports/cricket/bcci-postpones-vijay-merchant-trophy-after-surge-in-covid-19-cases-570907","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The BCCI on Thursday postponed the Under-16 Vijay Merchant Trophy, which was scheduled to begin in January 2022, following the recent surge in the COVID-19 cases in India and the growing threat of the Omicron variant.","content":"MUMBAI: The BCCI on Thursday postponed the Under-16 Vijay Merchant Trophy, which was scheduled to begin in January 2022, following the recent surge in the COVID-19 cases in India and the growing threat of the Omicron variant. In a letter to the affiliated units of BCCI, the Indian cricket board's secretary Jay Shah said that the domestic cricket had started off well, with the completion of 748 matches till date, however, the sudden spike in cases has forced the board to postpone its junior tournament. On Thursday, India reported 13,154 new COVID-19 cases, the number of active cases stands at 82,402.\"We have been closely monitoring the situation in India and across the world, and it is estimated that the caseload will shoot up in the immediate future if the situation is not controlled now,\" Shah wrote in the letter. \"After consulting experts and seeking views of the medical teams and operations team, it has been decided that keeping health and safety in mind, the U16 Vijay Merchant Trophy is postponed for this season,\" he added. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","pubDate":"2022-01-01 09:06:28","full_description":"MUMBAI: The BCCI on Thursday postponed the Under-16 Vijay Merchant Trophy, which was scheduled to begin in January 2022, following the recent surge in the COVID-19 cases in India and the growing threat of the Omicron variant. In a letter to the affiliated units of BCCI, the Indian cricket board's secretary Jay Shah said that the domestic cricket had started off well, with the completion of 748 matches till date, however, the sudden spike in cases has forced the board to postpone its junior tournament. On Thursday, India reported 13,154 new COVID-19 cases, the number of active cases stands at 82,402. \"We have been closely monitoring the situation in India and across the world, and it is estimated that the caseload will shoot up in the immediate future if the situation is not controlled now,\" Shah wrote in the letter. \"After consulting experts and seeking views of the medical teams and operations team, it has been decided that keeping health and safety in mind, the U16 Vijay Merchant Trophy is postponed for this season,\" he added. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291621-bcci.gif","source_id":"sentinel"},{"title":"Sourav Ganguly tests negative, discharged from hospital","link":"https://www.sentinelassam.com/sports/cricket/sourav-ganguly-tests-negative-discharged-from-hospital-570906","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) president Sourav Ganguly was on Friday discharged from hospital here after testing negative for the new variant of COVID-19, Omicron.","content":"KOLKATA: The Board of Control for Cricket in India (BCCI) president Sourav Ganguly was on Friday discharged from hospital here after testing negative for the new variant of COVID-19, Omicron.According to doctors, the former India captain had mild symptoms of COVID-19 and is doing fine and would stay in home isolation. The 49-year-old Ganguly, who had undergone treatment for a heart condition earlier this year, was admitted to hospital on December 28. Ganguly had twice been admitted to hospital in January this year after complaining of chest discomfort. He later underwent two angioplasty procedures. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year awardAlso Watch:","pubDate":"2022-01-01 09:04:23","full_description":"KOLKATA: The Board of Control for Cricket in India (BCCI) president Sourav Ganguly was on Friday discharged from hospital here after testing negative for the new variant of COVID-19, Omicron. According to doctors, the former India captain had mild symptoms of COVID-19 and is doing fine and would stay in home isolation. The 49-year-old Ganguly, who had undergone treatment for a heart condition earlier this year, was admitted to hospital on December 28. Ganguly had twice been admitted to hospital in January this year after complaining of chest discomfort. He later underwent two angioplasty procedures. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291620-sourav.jpg","source_id":"sentinel"},{"title":"Indian athletes' top sporting moments in 2021","link":"https://www.sentinelassam.com/sports/athletics/indian-athletes-top-sporting-moments-in-2021-570903","keywords":["Sports,Athletics"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Neeraj Chopra strikes gold: Star javelin thrower Neeraj Chopra became the second Indian to win an individual gold at the Olympics, outperforming the field by quite a distance to notch up the first track-and-field Games medal for the country.","content":"NEW DELHI: India fared really well in sports and it was not just cricket. IANS looks at the top sporting moments of Indian athletes in 2021.1. Neeraj Chopra strikes gold: Star javelin thrower Neeraj Chopra became the second Indian to win an individual gold at the Olympics, outperforming the field by quite a distance to notch up the first track-and-field Games medal for the country. 2. Historic hockey bronze: Indian men's hockey team displayed great counter-attacking play, defeating Germany 5-4 in the bronze medal play-offs at the Olympics. The team won an Olympic medal after a gap of 41 years. India's last of the eight Olympic gold came during the 1980 Moscow Games. 3. Team India wins Gabba Test: Team India fought and won against all odds to beat a formidable Australian squad on their home ground at The Gabba. 4. Pramod Bhagat: With badminton being introduced for the first time at the Tokyo Paralympics, ace shuttler Pramod Bhagat didn't disappoint and became the first Indian in the sport to win gold at the Paralympic/Olympics. His feat was followed by that of Krishna Nagar. 5. Sumit Antil: Following in the footsteps of Neeraj Chopra, Antil not just won gold in para-javelin but also dominated the sport with three of his throws shattering the world records. 6. Saikhom Mirabai Chanu: She overcame all odds and managed to win silver at the Tokyo Olympics in women's 49kg category. 7. PV Sindhu: Ace shuttler Sindhu created history by becoming the first Indian woman to win back-to-back medals in two Olympics. The Rio Olympics silver medallist won bronze at the Tokyo Olympics, beating China's He Bing Jao 21-13, 21-15 in the third-place playoff. 8. Ravi Dahiya: The Indian became the second Indian wrestler, after Sushil Kumar, to win the Olympic silver. That was after he lost the gold-medal match to a Russian. 9. Avani Lekhara: She became the first Indian woman to win two Paralympic medals by claiming the 50m Rifle 3-Positions SH1 bronze to add to an unprecedented gold she had won earlier in the Games. 10. Sukant Kadam: The ace shuttler, who missed the Paralympics by a whisker, made amends by winning gold at the Uganda Para Badminton Championship and also won his first gold at the 4th National Para Badminton Championship. 11. Punam Raut: The Indian cricketer who has cemented her No. 3 position in the Indian batting line-up, held the spirit of the game against Australia. The star batter decided to walk even after the umpire gave her not out, holding the spirit of the game. 12. Team India's Centurion Test: At the start of the year, India breached The Gabba, they ended the year by breaching yet another fortress. India took a 1-0 lead over South Africa in the three-Test series with their first ever Test win at Centurion. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year awardAlso Watch:","pubDate":"2022-01-01 08:55:18","full_description":"NEW DELHI: India fared really well in sports and it was not just cricket. IANS looks at the top sporting moments of Indian athletes in 2021. 1. Neeraj Chopra strikes gold: Star javelin thrower Neeraj Chopra became the second Indian to win an individual gold at the Olympics, outperforming the field by quite a distance to notch up the first track-and-field Games medal for the country. 2. Historic hockey bronze: Indian men's hockey team displayed great counter-attacking play, defeating Germany 5-4 in the bronze medal play-offs at the Olympics. The team won an Olympic medal after a gap of 41 years. India's last of the eight Olympic gold came during the 1980 Moscow Games. 3. Team India wins Gabba Test: Team India fought and won against all odds to beat a formidable Australian squad on their home ground at The Gabba. 4. Pramod Bhagat: With badminton being introduced for the first time at the Tokyo Paralympics, ace shuttler Pramod Bhagat didn't disappoint and became the first Indian in the sport to win gold at the Paralympic/Olympics. His feat was followed by that of Krishna Nagar. 5. Sumit Antil: Following in the footsteps of Neeraj Chopra, Antil not just won gold in para-javelin but also dominated the sport with three of his throws shattering the world records. 6. Saikhom Mirabai Chanu: She overcame all odds and managed to win silver at the Tokyo Olympics in women's 49kg category. 7. PV Sindhu: Ace shuttler Sindhu created history by becoming the first Indian woman to win back-to-back medals in two Olympics. The Rio Olympics silver medallist won bronze at the Tokyo Olympics, beating China's He Bing Jao 21-13, 21-15 in the third-place playoff. 8. Ravi Dahiya: The Indian became the second Indian wrestler, after Sushil Kumar, to win the Olympic silver. That was after he lost the gold-medal match to a Russian. 9. Avani Lekhara: She became the first Indian woman to win two Paralympic medals by claiming the 50m Rifle 3-Positions SH1 bronze to add to an unprecedented gold she had won earlier in the Games. 10. Sukant Kadam: The ace shuttler, who missed the Paralympics by a whisker, made amends by winning gold at the Uganda Para Badminton Championship and also won his first gold at the 4th National Para Badminton Championship. 11. Punam Raut: The Indian cricketer who has cemented her No. 3 position in the Indian batting line-up, held the spirit of the game against Australia. The star batter decided to walk even after the umpire gave her not out, holding the spirit of the game. 12. Team India's Centurion Test: At the start of the year, India breached The Gabba, they ended the year by breaching yet another fortress. India took a 1-0 lead over South Africa in the three-Test series with their first ever Test win at Centurion. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291617-download.jpg","source_id":"sentinel"},{"title":"Victory at Centurion in four days is testimony to India's all-round strength: Kohli","link":"https://www.sentinelassam.com/sports-news/victory-at-centurion-in-four-days-is-testimony-to-indias-all-round-strength-kohli-570900","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The victory in four days in the first Test over South Africa here is a testimony to India's all-round strength in the longest format of the game, said, captain Virat Kohli.","content":"CENTURION: The victory in four days in the first Test over South Africa here is a testimony to India's all-round strength in the longest format of the game, said, captain Virat Kohli.The second day of the opening Test between India and South Africa was washed out but four days were enough for visitors to register a thumping win. India concluded 2021 with a 113-run win over South Africa in the first Test at SuperSport Park on Thursday to take a 1-0 lead in the three-match series. It was also India's first-ever Test victory at the Centurion, which is largely considered to be a fortress for the Proteas and the Indian skipper also feels Centurion is one of 'the most difficult' among all venues in South Africa. \"Test series in South Africa in any place is not easy and Centurion is obviously the most difficult of them all. We ended up getting a result in four days is a testimony to the fact that we have become the side we have become today and the strength of the squad was on full display with the bat, with the ball, and in the field as well,\" Kohli told bcci.tv. \"We were just looking for opportunities to win the game and that's how we play cricket now and given an opportunity at any stage we will pounce on it,\" he added. India are seeking a first-ever Test series triumph in South Africa and Kohli feels it is a 'golden opportunity' for the visitors to put pressure on the hosts. \"It's a beautiful position to be in, to be 1-0 up away from home, putting the opposition under pressure again in the second Test is a golden opportunity for us and something that every player is looking forward to,\" he said. The star batter also highlighted that Team India have played some outstanding cricket over the last 2-3 years and they are getting better and confident with each passing game. \"The new year is a very good marker to analyse how you played your cricket and I think we've played some outstanding cricket over the last 2-3 years, especially overseas. We are a side which is getting better and more confident with how much cricket we play,\" Kohli said. \"This sets us up beautifully for Wanderers, we can go out there and be more positive and optimistic,\" he added. Stand-in Test vice-captain KL Rahul, who was adjudged Player of the Match for his fantastick 123-run knock in the first innings, was also happy by the win. \"Coming to a country like South Africa and beating them in their own fortress feels very special. This is the second such victory for us, one was in Gabba and now one in Centurion. Hopefully, we can build on this and win the series,\" Rahul said. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year awardAlso Watch:","pubDate":"2022-01-01 08:48:56","full_description":"CENTURION: The victory in four days in the first Test over South Africa here is a testimony to India's all-round strength in the longest format of the game, said, captain Virat Kohli. The second day of the opening Test between India and South Africa was washed out but four days were enough for visitors to register a thumping win. India concluded 2021 with a 113-run win over South Africa in the first Test at SuperSport Park on Thursday to take a 1-0 lead in the three-match series. It was also India's first-ever Test victory at the Centurion, which is largely considered to be a fortress for the Proteas and the Indian skipper also feels Centurion is one of 'the most difficult' among all venues in South Africa. \"Test series in South Africa in any place is not easy and Centurion is obviously the most difficult of them all. We ended up getting a result in four days is a testimony to the fact that we have become the side we have become today and the strength of the squad was on full display with the bat, with the ball, and in the field as well,\" Kohli told bcci.tv. \"We were just looking for opportunities to win the game and that's how we play cricket now and given an opportunity at any stage we will pounce on it,\" he added. India are seeking a first-ever Test series triumph in South Africa and Kohli feels it is a 'golden opportunity' for the visitors to put pressure on the hosts. \"It's a beautiful position to be in, to be 1-0 up away from home, putting the opposition under pressure again in the second Test is a golden opportunity for us and something that every player is looking forward to,\" he said. The star batter also highlighted that Team India have played some outstanding cricket over the last 2-3 years and they are getting better and confident with each passing game. \"The new year is a very good marker to analyse how you played your cricket and I think we've played some outstanding cricket over the last 2-3 years, especially overseas. We are a side which is getting better and more confident with how much cricket we play,\" Kohli said. \"This sets us up beautifully for Wanderers, we can go out there and be more positive and optimistic,\" he added. Stand-in Test vice-captain KL Rahul, who was adjudged Player of the Match for his fantastick 123-run knock in the first innings, was also happy by the win. \"Coming to a country like South Africa and beating them in their own fortress feels very special. This is the second such victory for us, one was in Gabba and now one in Centurion. Hopefully, we can build on this and win the series,\" Rahul said. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291612-virat.jpg","source_id":"sentinel"},{"title":"Root stands tall among the Ashes ruins; nominated for ICC Player of the Year award","link":"https://www.sentinelassam.com/sports/cricket/root-stands-tall-among-the-ashes-ruins-nominated-for-icc-player-of-the-year-award-570899","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England Test skipper Joe Root’s individual brilliance with the bat has seen him being nominated for the Sir Garfield Sobers Trophy for the ICC Player of the Year 2021, along with young Pakistan pace bowler Shaheen Shah Afridi, their wicketkeeper-batter Mohammad Rizwan and New Zealand captain Kane Williamson.","content":"DUBAI: England Test skipper Joe Root's individual brilliance with the bat has seen him being nominated for the Sir Garfield Sobers Trophy for the ICC Player of the Year 2021, along with young Pakistan pace bowler Shaheen Shah Afridi, their wicketkeeper-batter Mohammad Rizwan and New Zealand captain Kane Williamson.His side may have lost the Ashes after Australia took an unassailable 3-0 lead in the five Test series, but the embattled Root, with 1855 runs in 18 international matches at an average of 58.37 (six centuries), has enjoyed a year that will go down in the pages of the history books. Firmly establishing himself as the backbone of England's batting in Test cricket, Root has often been the lone man standing for the side. His year began with a knock of 228 against Sri Lanka in Galle and he has only gone from strength to strength. He followed up his exploits against Sri Lanka with a memorable knock in Chennai, a brilliant 218 against India. He continued his form against India in the return leg of the Test series at home, aggregating 564 runs in four matches with three centuries to his name. His performance also helped him reach the summit of the ICC Test Player Rankings for batting, where he was eventually displaced by Australia's Marnus Labuschagne. Despite failing to convert his starts into big scores, Root continued being England's best batter against Australia in the first three Ashes Tests. Root's best knock this year has been the 218 in the heat of Chennai against an Indian spin attack of the highest calibre. Batting out 377 deliveries, Root creamed 19 fours and two sixes in his marathon innings, nullifying the threat of Ravichandran Ashwin and Co. His knock set England up for a mammoth first innings score of 578 which eventually helped them win the contest by 227 runs. Pakistan bowler Shaheen Afridi's 78 wickets in 36 internationals at an average of 22.20 — and best bowling figures of 6/51 — has seen him knock some of the best batters over across all three formats. He reached his peak during the T20 World Cup in the UAE where he impressed with his speed and skills. New Zealand captain Kane Williamson's 693 runs in 16 internationals, coupled with his leadership, helped the Blackcaps win the ICC World Test Championship Final against India in Southampton. Williamson played a crucial role in that game with the bat as well, scoring a vital 49 in the first innings. He followed it up with a crucial unbeaten 52 in the run chase of 139, taking his side home before lifting the mace. Pakistan wicketkeeper-batter Mohammad Rizwan, with 1,915 runs in 44 internationals and 56 dismissals ruled the roost this year when it came to the shortest format of the game. Aggregating 1,326 runs in only 29 matches, Rizwan struck at an average of 73.66 and a strike-rate of 134.89. Apart from his exploits with the bat, he was as solid as ever behind the stumps, playing a key role in Pakistan's run to the semifinals during the T20 World Cup. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","pubDate":"2022-01-01 08:44:52","full_description":"DUBAI: England Test skipper Joe Root's individual brilliance with the bat has seen him being nominated for the Sir Garfield Sobers Trophy for the ICC Player of the Year 2021, along with young Pakistan pace bowler Shaheen Shah Afridi, their wicketkeeper-batter Mohammad Rizwan and New Zealand captain Kane Williamson. His side may have lost the Ashes after Australia took an unassailable 3-0 lead in the five Test series, but the embattled Root, with 1855 runs in 18 international matches at an average of 58.37 (six centuries), has enjoyed a year that will go down in the pages of the history books. Firmly establishing himself as the backbone of England's batting in Test cricket, Root has often been the lone man standing for the side. His year began with a knock of 228 against Sri Lanka in Galle and he has only gone from strength to strength. He followed up his exploits against Sri Lanka with a memorable knock in Chennai, a brilliant 218 against India. He continued his form against India in the return leg of the Test series at home, aggregating 564 runs in four matches with three centuries to his name. His performance also helped him reach the summit of the ICC Test Player Rankings for batting, where he was eventually displaced by Australia's Marnus Labuschagne. Despite failing to convert his starts into big scores, Root continued being England's best batter against Australia in the first three Ashes Tests. Root's best knock this year has been the 218 in the heat of Chennai against an Indian spin attack of the highest calibre. Batting out 377 deliveries, Root creamed 19 fours and two sixes in his marathon innings, nullifying the threat of Ravichandran Ashwin and Co. His knock set England up for a mammoth first innings score of 578 which eventually helped them win the contest by 227 runs. Pakistan bowler Shaheen Afridi's 78 wickets in 36 internationals at an average of 22.20 — and best bowling figures of 6/51 — has seen him knock some of the best batters over across all three formats. He reached his peak during the T20 World Cup in the UAE where he impressed with his speed and skills. New Zealand captain Kane Williamson's 693 runs in 16 internationals, coupled with his leadership, helped the Blackcaps win the ICC World Test Championship Final against India in Southampton. Williamson played a crucial role in that game with the bat as well, scoring a vital 49 in the first innings. He followed it up with a crucial unbeaten 52 in the run chase of 139, taking his side home before lifting the mace. Pakistan wicketkeeper-batter Mohammad Rizwan, with 1,915 runs in 44 internationals and 56 dismissals ruled the roost this year when it came to the shortest format of the game. Aggregating 1,326 runs in only 29 matches, Rizwan struck at an average of 73.66 and a strike-rate of 134.89. Apart from his exploits with the bat, he was as solid as ever behind the stumps, playing a key role in Pakistan's run to the semifinals during the T20 World Cup. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291611-cricket.jpg","source_id":"sentinel"},{"title":"Head tests positive for COVID-19","link":"https://www.sentinelassam.com/sports-news/head-tests-positive-for-covid-19-570898","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Australian cricket team suffered a major jolt ahead of the fourth Ashes Test at Sydney from January 5 with their key batter Travis Head testing positive for COVID-19.","content":"SYDNEY: The Australian cricket team suffered a major jolt ahead of the fourth Ashes Test at Sydney from January 5 with their key batter Travis Head testing positive for COVID-19.Cricket Australia (CA) issued a statement on Friday morning saying the batter had tested positive for Covid-19 \"following a routine PCR test\". \"Head is asymptomatic and will remain in Melbourne and isolate with his partner for seven days in line with Victorian Government Health requirements. He will be unavailable for selection for the fourth Vodafone men's Ashes Test, starting at the SCG (Sydney Cricket Ground) on January 5,\" said Cricket Australia. Reserve batter Usman Khawaja is likely to replace Head in the fourth Test. Head was the hero of the opening Ashes Test at the Gabba in Brisbane, smashing an uncharacteristically fast 152 (148 balls) in Australia's first innings total of 425 runs. His contribution led the team to a massive nine-wicket win and take a 1-0 lead against the Joe Root-led England. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year awardAlso Watch:","pubDate":"2022-01-01 08:42:54","full_description":"SYDNEY: The Australian cricket team suffered a major jolt ahead of the fourth Ashes Test at Sydney from January 5 with their key batter Travis Head testing positive for COVID-19. Cricket Australia (CA) issued a statement on Friday morning saying the batter had tested positive for Covid-19 \"following a routine PCR test\". \"Head is asymptomatic and will remain in Melbourne and isolate with his partner for seven days in line with Victorian Government Health requirements. He will be unavailable for selection for the fourth Vodafone men's Ashes Test, starting at the SCG (Sydney Cricket Ground) on January 5,\" said Cricket Australia. Reserve batter Usman Khawaja is likely to replace Head in the fourth Test. Head was the hero of the opening Ashes Test at the Gabba in Brisbane, smashing an uncharacteristically fast 152 (148 balls) in Australia's first innings total of 425 runs. His contribution led the team to a massive nine-wicket win and take a 1-0 lead against the Joe Root-led England. IANS Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291608-head.jpg","source_id":"sentinel"},{"title":"Quinton de Kock announces retirement from Test cricket","link":"https://www.sentinelassam.com/sports-news/quinton-de-kock-announces-retirement-from-test-cricket-570895","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"South Africa wicketkeeper-batter Quinton de Kock on Thursday announced his retirement from Test cricket with immediate effect.","content":"JOHANNESBURG: South Africa wicketkeeper-batter Quinton de Kock on Thursday announced his retirement from Test cricket with immediate effect.The announcement comes after the Proteas' first Test match against India in Centurion, where the visitors won by 113 runs and took a 1-0 lead in the three-match series. As per Cricket South Africa (CSA), the 29-year old De Kock cited his intentions to spend more time with his growing family for the timing and reason for his relatively early retirement from the format. \"He and his wife, Sasha, are anticipating the imminent birth of their first-born child in the coming days,\" the CSA said in a statement. Meanwhile, De Kock said, \"This is not a decision that I have come to very easily. I have taken a lot of time to think about what my future looks like and what needs to take priority in my life now that Sasha and I are about to welcome our first child into this world and look to grow our family beyond that.\" \"My family is everything to me and I want to have the time and space to be able to be with them during this new and exciting chapter of our lives,\" he added. The wicketkeeper batsman made his Proteas Test debut against Australia in 2014. In 54 matches, he amassed 3 300 runs with a high score of 141 not-out, at an average of 38.82 and strike rate of 70.93. He also has six centuries and 22 half-centuries under his belt. IANS Also Read: India Strikes Back At China With Savage Reply For 'Inventing' Names In ArunachalAlso Watch:","pubDate":"2022-01-01 08:36:01","full_description":"JOHANNESBURG: South Africa wicketkeeper-batter Quinton de Kock on Thursday announced his retirement from Test cricket with immediate effect. The announcement comes after the Proteas' first Test match against India in Centurion, where the visitors won by 113 runs and took a 1-0 lead in the three-match series. As per Cricket South Africa (CSA), the 29-year old De Kock cited his intentions to spend more time with his growing family for the timing and reason for his relatively early retirement from the format. \"He and his wife, Sasha, are anticipating the imminent birth of their first-born child in the coming days,\" the CSA said in a statement. Meanwhile, De Kock said, \"This is not a decision that I have come to very easily. I have taken a lot of time to think about what my future looks like and what needs to take priority in my life now that Sasha and I are about to welcome our first child into this world and look to grow our family beyond that.\" \"My family is everything to me and I want to have the time and space to be able to be with them during this new and exciting chapter of our lives,\" he added. The wicketkeeper batsman made his Proteas Test debut against Australia in 2014. In 54 matches, he amassed 3 300 runs with a high score of 141 not-out, at an average of 38.82 and strike rate of 70.93. He also has six centuries and 22 half-centuries under his belt. IANS Also Read: India Strikes Back At China With Savage Reply For 'Inventing' Names In Arunachal Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291605-de-cock.jpg","source_id":"sentinel"},{"title":"2021 one of India's best years in Test cricket: Duminy","link":"https://www.sentinelassam.com/sports-news/2021-one-of-indias-best-years-in-test-cricket-duminy-570892","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former South Africa all-rounder JP Duminy stated that one has to acknowledge that 2021 will be known as one of the years for India, especially in Test cricket. He also credited KL Rahul and Mayank Agarwal for setting up India’s 113-run win at SuperSport Park on Thursday with the first-innings opening partnership of 117.","content":"CENTURION: Former South Africa all-rounder JP Duminy stated that one has to acknowledge that 2021 will be known as one of the years for India, especially in Test cricket. He also credited KL Rahul and Mayank Agarwal for setting up India's 113-run win at SuperSport Park on Thursday with the first-innings opening partnership of 117.India in Test cricket began 2021 with a heist of a draw in Sydney followed by breaching the Gabba fortress to win the Border-Gavaskar Trophy for the second straight time in Australia. In England, India notched up Test wins in Lord's and The Oval before the Manchester Test was postponed due to fears of COVID-19 outbreak in the camp. At home, India won series against England (3-1) and New Zealand (1-0) before signing off from the year with a maiden Test win in Centurion. The only sore point for India was losing the World Test Championship final to New Zealand in Southampton. \"We have to acknowledge that this will go down as one of India's best years in international cricket, particularly in Test cricket. They have put a lot of work behind the scenes, especially the kinds of performances they have put out in overseas Tests. They have always been a formidable unit at home but the way they have remodelled themselves when it comes to the conditions outside India, it's incredible. It's really paying dividends. One can talk about the influence of IPL, playing with players from different nations, that will have some sort of impact, but also how the batters have approached in challenging conditions,\" Duminy was quoted as saying by Cricket.com. Talking about the partnership from Agarwal (60) and Rahul (123) in the first innings, which eventually turned out to be the difference between the two teams, Duminy remarked, \"The way Rahul and Agarwal started, it set the tone perfectly. You think about these conditions, you think about batting first and it's no doubt it was the right decision at this venue. \"The discipline and technical ability Agarwal and Rahul showed on day one was the most impressive showing. All credit to the way India started this series.\" Duminy further praised Rahul and Agarwal's efforts against a South Africa bowling attack which didn't take advantage of home conditions. \"They were confident and it's not easy to bat first as there is always something on offer on day one but South Africa couldn't capitalise on it. It would be an easy thing to say that it was because of the lack of discipline from the South African bowling attack but I don't want to take the shine away from how well those two played.\" The 37-year-old pointed out that the Karnataka duo's friendship off the field is helping them do well in Test cricket. \"Yes, they pounced on those bad deliveries, which is expected of top-order batters, but trusting your strong defence in these conditions was very impressive. They are very good friends and they do form a solid partnership. They encourage each other because we know Test cricket comes with high-pressure moments and sometimes you need your partner to be with you and encourage you. \"And, that hunger to do well in overseas conditions, we are seeing that a lot, especially from KL Rahul. And, Mayank Agarwal is feeding off that energy as well.\" IANS Also Read: India Strikes Back At China With Savage Reply For 'Inventing' Names In ArunachalAlso Watch:","pubDate":"2022-01-01 08:26:42","full_description":"CENTURION: Former South Africa all-rounder JP Duminy stated that one has to acknowledge that 2021 will be known as one of the years for India, especially in Test cricket. He also credited KL Rahul and Mayank Agarwal for setting up India's 113-run win at SuperSport Park on Thursday with the first-innings opening partnership of 117. India in Test cricket began 2021 with a heist of a draw in Sydney followed by breaching the Gabba fortress to win the Border-Gavaskar Trophy for the second straight time in Australia. In England, India notched up Test wins in Lord's and The Oval before the Manchester Test was postponed due to fears of COVID-19 outbreak in the camp. At home, India won series against England (3-1) and New Zealand (1-0) before signing off from the year with a maiden Test win in Centurion. The only sore point for India was losing the World Test Championship final to New Zealand in Southampton. \"We have to acknowledge that this will go down as one of India's best years in international cricket, particularly in Test cricket. They have put a lot of work behind the scenes, especially the kinds of performances they have put out in overseas Tests. They have always been a formidable unit at home but the way they have remodelled themselves when it comes to the conditions outside India, it's incredible. It's really paying dividends. One can talk about the influence of IPL, playing with players from different nations, that will have some sort of impact, but also how the batters have approached in challenging conditions,\" Duminy was quoted as saying by Cricket.com. Talking about the partnership from Agarwal (60) and Rahul (123) in the first innings, which eventually turned out to be the difference between the two teams, Duminy remarked, \"The way Rahul and Agarwal started, it set the tone perfectly. You think about these conditions, you think about batting first and it's no doubt it was the right decision at this venue. \"The discipline and technical ability Agarwal and Rahul showed on day one was the most impressive showing. All credit to the way India started this series.\" Duminy further praised Rahul and Agarwal's efforts against a South Africa bowling attack which didn't take advantage of home conditions. \"They were confident and it's not easy to bat first as there is always something on offer on day one but South Africa couldn't capitalise on it. It would be an easy thing to say that it was because of the lack of discipline from the South African bowling attack but I don't want to take the shine away from how well those two played.\" The 37-year-old pointed out that the Karnataka duo's friendship off the field is helping them do well in Test cricket. \"Yes, they pounced on those bad deliveries, which is expected of top-order batters, but trusting your strong defence in these conditions was very impressive. They are very good friends and they do form a solid partnership. They encourage each other because we know Test cricket comes with high-pressure moments and sometimes you need your partner to be with you and encourage you. \"And, that hunger to do well in overseas conditions, we are seeing that a lot, especially from KL Rahul. And, Mayank Agarwal is feeding off that energy as well.\" IANS Also Read: India Strikes Back At China With Savage Reply For 'Inventing' Names In Arunachal Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291592-cricket.jpg","source_id":"sentinel"},{"title":"Rohit Sharma, Ashwin, Pant, Axar in Cricket Australia's Test XI of 2021","link":"https://www.sentinelassam.com/sports-news/rohit-sharma-ashwin-pant-axar-in-cricket-australias-test-xi-of-2021-570890","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Star opener Rohit Sharma, spinners Ravichandran Ashwin, and Axar Patel, and wicketkeeper-batsman Rishabh Pant were the four Indian cricketers who featured in Cricket.com.au’s Test team of the Year for 2021, which was revealed on Friday.","content":"MELBOURNE: Star opener Rohit Sharma, spinners Ravichandran Ashwin, and Axar Patel, and wicketkeeper-batsman Rishabh Pant were the four Indian cricketers who featured in Cricket.com.au's Test team of the Year for 2021, which was revealed on Friday.Having dominated white-ball cricket and his home conditions for years, the 34-year old Rohit Sharma conquered his final frontier this year by proving he can score big Test runs outside of Asia. And a strong 2021 that saw him finish second behind Joe Root in the list for leading run-scorers in 2021. It could have been even better if the classy right-hander had translated multiple strong starts into big hundreds. He reached 20 or more in 14 of his 19 completed innings but posted two centuries — 161 in a total of 329 to set up a win in Chennai and a patient 127 at The Oval, his maiden Test hundred away from home. On the other hand, one century and an average below 40 completely undersell Rishabh Pant's impact this year, especially in the first three months of 2021. The dynamic left-hander's numbers would have looked considerably better if he'd been able to turn scores of 97 (in Sydney), 89 not out (in Brisbane) and 91 (in Chennai) into hundreds but, as ever with a player as destructive as Pant, the numbers only tell half the story anyway. Meanwhile, this year also showed how prolific Ravichandran Ashwin has become as he took more Test wickets (54) than anyone else. However, he suffered some disappointment as well. Dominant as ever at home (where he took 46 of his 54 wickets), the off-spinner missed India's series-sealing win in Brisbane due to injury and was then surprisingly overlooked for their series in England as selectors preferred the extra batting punch provided by Ravindra Jadeja. But another year of 50-plus wickets is certainly worth celebrating, as is a fifth Test hundred and the crucial cameo he made with the bat in India's famous draw at the SCG. Another Indian spinner Axar Patel showed how bowling in favourable conditions is one thing but exploiting them to maximum effect is another thing altogether. The fact that Patel wasn't selected for India's series opener against England in February was made all the more baffling by the carnage that followed as the left-arm spinner bagged 27 wickets in just three Tests in one of the more memorable debut series in history. Cricket Australia Test XI of 2021: Rohit Sharma, Dimuth Karunaratne (c), Marnus Labuschagne, Joe Root, Fawad Alam, Rishabh Pant (wk), Ravichandran Ashwin, Kyle Jamieson, Axar Patel, Hasan Ali, Shaheen Shah Afridi. IANS Also Read: India Strikes Back At China With Savage Reply For 'Inventing' Names In Arunachal Also Watch:","pubDate":"2022-01-01 08:24:12","full_description":"MELBOURNE: Star opener Rohit Sharma, spinners Ravichandran Ashwin, and Axar Patel, and wicketkeeper-batsman Rishabh Pant were the four Indian cricketers who featured in Cricket.com.au's Test team of the Year for 2021, which was revealed on Friday. Having dominated white-ball cricket and his home conditions for years, the 34-year old Rohit Sharma conquered his final frontier this year by proving he can score big Test runs outside of Asia. And a strong 2021 that saw him finish second behind Joe Root in the list for leading run-scorers in 2021. It could have been even better if the classy right-hander had translated multiple strong starts into big hundreds. He reached 20 or more in 14 of his 19 completed innings but posted two centuries — 161 in a total of 329 to set up a win in Chennai and a patient 127 at The Oval, his maiden Test hundred away from home. On the other hand, one century and an average below 40 completely undersell Rishabh Pant's impact this year, especially in the first three months of 2021. The dynamic left-hander's numbers would have looked considerably better if he'd been able to turn scores of 97 (in Sydney), 89 not out (in Brisbane) and 91 (in Chennai) into hundreds but, as ever with a player as destructive as Pant, the numbers only tell half the story anyway. Meanwhile, this year also showed how prolific Ravichandran Ashwin has become as he took more Test wickets (54) than anyone else. However, he suffered some disappointment as well. Dominant as ever at home (where he took 46 of his 54 wickets), the off-spinner missed India's series-sealing win in Brisbane due to injury and was then surprisingly overlooked for their series in England as selectors preferred the extra batting punch provided by Ravindra Jadeja. But another year of 50-plus wickets is certainly worth celebrating, as is a fifth Test hundred and the crucial cameo he made with the bat in India's famous draw at the SCG. Another Indian spinner Axar Patel showed how bowling in favourable conditions is one thing but exploiting them to maximum effect is another thing altogether. The fact that Patel wasn't selected for India's series opener against England in February was made all the more baffling by the carnage that followed as the left-arm spinner bagged 27 wickets in just three Tests in one of the more memorable debut series in history. Cricket Australia Test XI of 2021: Rohit Sharma, Dimuth Karunaratne (c), Marnus Labuschagne, Joe Root, Fawad Alam, Rishabh Pant (wk), Ravichandran Ashwin, Kyle Jamieson, Axar Patel, Hasan Ali, Shaheen Shah Afridi. IANS Also Read: India Strikes Back At China With Savage Reply For 'Inventing' Names In Arunachal Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291586-rohit.jpg","source_id":"sentinel"},{"title":"Scarborough teen, Perth Scorchers rookie Cooper Connolly named Australian captain for Under-19s World Cup","link":"https://thewest.com.au/sport/cricket/scarborough-teen-perth-scorchers-rookie-cooper-connolly-named-australian-captain-for-under-19s-world-cup-c-5132882","keywords":null,"creator":["Jordan McArdle"],"video_url":null,"description":"Scarborough cricket prodigy Cooper Connolly will join elite company as Australia’s captain for the ICC Under-19s World Cup in the West Indies this month.","content":null,"pubDate":"2022-01-01 07:58:25","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5132882/603fa08b0402fafa545e8306702eb1cba80ab829-16x9-x0y179w3648h2052.jpg","source_id":"thewest"},{"title":"Happy New Year 2022: Kohli, Tendulkar And Co. Extend Greetings To Fans","link":"https://sports.ndtv.com/cricket/happy-new-year-2022-virat-kohli-sachin-tendulkar-indian-cricket-fraternity-extend-greetings-to-fans-2682941","keywords":null,"creator":null,"video_url":null,"description":"Happy New Year 2022: Virat Kohli, Sachin Tendulkar, Ravi Shastri and other members of the Indian cricket fraternity took to Twitter to extend greetings to fans.","content":null,"pubDate":"2022-01-01 07:44:31","full_description":"With the entire world celebrating the beginning of 2022, Virat Kohli led the Indian cricket fraternity to extend greetings to fans on the occasion of the New Year. Taking to Koo, Kohli posted photos with wife Anushka Sharma and also with Team India, who are currently touring South Africa. Leading 1-0 in an ongoing two-match Test series, the visitors will be aiming for a clean sweep in the second game which begins on January 3. The Indian Test captain also captioned his post in Hindi, which translates to, \"Hope this new year brings happiness to all of us. My love and best wishes to all.\" Spinner Ravichandran Ashwin also posted a photo with the Indian team on Twitter and captioned it as, \"New year new hopes! Wish you all a happy and prosperous 2022.\" New year new hopes! Wish you all a happy and prosperous 2022. #HappyNewYear pic.twitter.com/cssKEpeePI Meanwhile, Indian cricket legend Sachin Tendulkar also wished everyone \"a healthy and happy new year 2022.\" That time of the year when we'll do 2022. Time for a reboot! Wishing everyone a healthy and happy new year 2022. Former Team India head coach Ravi Shastri took to Twitter to post a dancing video with Bollywood star Ranveer Singh. He captioned it as, \"#HappyNewYear! Getting into 2022 be like...thanks for the dance tips @RanveerOfficial. May 2022 be a wonderful, healthy, and inspiring year for each of you\". #HappyNewYear ! Getting into 2022 be like...thanks for the dance tips @RanveerOfficial . May 2022 be a wonderful, healthy, and inspiring year for each of you pic.twitter.com/EvyTa7Ev4V Here are the other wishes: 2020 and 2021 have been years with many challenges. Wishing 2022 has a lot more ease and good health for everyone. Wishing you a very Happy New Year. #Welcome2022 pic.twitter.com/tUO8COrIU8 To a New Year, a New Journey, New Learnings and New Memories. Wishing you a happy, safe and healthy New Year . Happy New Year. After the two-match Test series, India are scheduled to face South Africa in a three-match ODI series.","image_url":"https://c.ndtvimg.com/2022-01/0iu38oo8_kohli-twitter_120x90_01_January_22.jpg","source_id":"ndtv"},{"title":"\"Introduce a franchise competition like The Hundred for red-ball cricket\" - Kevin Pietersen's radical proposal to revive Test cricket in England","link":"https://www.sportskeeda.com/cricket/news-ashes-2021-22-introduce-franchise-competition-like-the-hundred-red-ball-cricket-kevin-pietersen-s-radical-proposal-revive-test-cricket-england?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Balakrishna"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-01 07:34:32","full_description":"Former England captain Kevin Pietersen has proposed revolutionary ideas to reform the country's struggling Test setup. He wants the ECB to introduce a new franchise-based competition for red-ball cricket on the lines of The Hundred to create quality cricketers for the Test team. After disappointing performances against India and New Zealand at home, England slumped to a 0-3 defeat in the 2021-22 Ashes, losing the series with two games left to play. Ever since then, the England Test team has been coping with heavy criticism from all quarters. While many have been blaming and bashing the players, Kevin Pietersen believes the domestic cricket system is at fault here. In his blog for Betway, Kevin Pietersen shed some light on the path ahead for England in red-ball cricket and wrote: Kevin Pietersen then delved into the economic and structural aspects of a potential red-ball franchise tournament. He chose the eight-team round-robin league format to be ideal and felt it could happen during mid-summer in the country. According to Pietersen, a chance to rub shoulders with some of the best global cricketers in such competitions can prepare young English cricketers for the highest level. In this regard, Pietersen wrote: He continued: It would be interesting to see if the England and Wales Cricket Board (ECB) implement any such measures in the near future to revive the dismal state of the Test setup in the country. Q. Do you agree with Kevin Pietersen's idea? Yes No 9 votes so far","image_url":"https://static.sportskeeda.com/editor/2022/01/dc3bf-16410185406219-1920.jpg","source_id":"sportskeeda"},{"title":"India's Asia Cup win ideal confidence-booster for U-19 World Cup: Laxman","link":"https://www.tribuneindia.com/news/sports/indias-asia-cup-win-ideal-confidence-booster-for-u-19-world-cup-laxman-356901","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, January 1 National Cricket Academy (NCA) head VVS Laxman feels the Indian Under-19 team's Asia Cup title triumph becomes more praiseworthy as it came despite the players' preparations being hit by inclement weather in the run-up to the tournament. India reaffirmed their supremacy in the continental age-group meet with a record eighth title as they hammered Sri Lanka by nine wickets in the rain-hit summit showdown in Dubai on Friday. Laxman also called the result an \"ideal confidence-booster\" ahead of the ICC U-19 World Cup, which is scheduled to be held in the West Indies from January 14 to February 5 in the West Indies. \"Congrats to the India U-19 side on the #AsiaCupU19 triumph! Their preparations were hit by the weather, among other things, but it's heartening to see them improve by the game. \"That's as satisfying as the title win itself. Ideal confidence-booster for the World Cup,\" Laxman tweeted. In the final, the Indian bowlers were all over Sri Lanka, who were gasping at 74 for seven in 33 overs, when heavy rain lashed the Dubai International Cricket Stadium and stopped play for more than two hours. It became a 38-overs-a-side contest when play resumed with Sri Lanka limping to 106 for nine. India were set a revised 102-run target via DLS method which they reached in 21.3 overs with opener Angkrish Raghuvanshi scoring an unbeaten 56 off 67 balls. BCCI president Sourav Ganguly and secretary Jay Shah too congratulated the team on its victory. PTI","content":null,"pubDate":"2022-01-01 07:31:48","full_description":"New Delhi, January 1 National Cricket Academy (NCA) head VVS Laxman feels the Indian Under-19 team's Asia Cup title triumph becomes more praiseworthy as it came despite the players' preparations being hit by inclement weather in the run-up to the tournament. India reaffirmed their supremacy in the continental age-group meet with a record eighth title as they hammered Sri Lanka by nine wickets in the rain-hit summit showdown in Dubai on Friday. Laxman also called the result an \"ideal confidence-booster\" ahead of the ICC U-19 World Cup, which is scheduled to be held in the West Indies from January 14 to February 5 in the West Indies. \"Congrats to the India U-19 side on the #AsiaCupU19 triumph! Their preparations were hit by the weather, among other things, but it's heartening to see them improve by the game. \"That's as satisfying as the title win itself. Ideal confidence-booster for the World Cup,\" Laxman tweeted. In the final, the Indian bowlers were all over Sri Lanka, who were gasping at 74 for seven in 33 overs, when heavy rain lashed the Dubai International Cricket Stadium and stopped play for more than two hours. It became a 38-overs-a-side contest when play resumed with Sri Lanka limping to 106 for nine. India were set a revised 102-run target via DLS method which they reached in 21.3 overs with opener Angkrish Raghuvanshi scoring an unbeaten 56 off 67 balls. BCCI president Sourav Ganguly and secretary Jay Shah too congratulated the team on its victory. PTI","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_1947931933.jpeg","source_id":"tribuneindia"},{"title":"NZ vs BAN, 1st Test: Conway century boosts New Zealand on Day 1","link":"https://www.indiatvnews.com/sports/cricket/nz-vs-ban-1st-test-conway-century-boosts-new-zealand-on-day-1-752239","keywords":null,"creator":null,"video_url":null,"description":"After a brief interruption, Devon Conway continued his prolific run-making in test cricket with an innings of 122 which guided New Zealand to 258-5 at stumps Saturday on the first day of the first cricket test against Bangladesh.","content":null,"pubDate":"2022-01-01 07:23:36","full_description":"After a brief interruption, Devon Conway continued his prolific run-making in test cricket with an innings of 122 which guided New Zealand to 258-5 at stumps Saturday on the first day of the first cricket test against Bangladesh. South Africa-born Conway erupted onto the international scene in 2021 at the age of 29 with a double century in his first test innings and since has been a stand-out in all three formats. Within the space of four Tests, he now has scored a double century, a century and two half-centuries: 501 runs at an average of 83. He also averages 75 in one-day internationals and 50 in the Twenty20s. A broken hand suffered at the T20 World Cup in November put a brief stop to his accumulation of runs and records. He quickly picked up on Saturday where he left off, placing New Zealand in a strong position at stumps after losing the toss. Rusty when he commenced his innings after New Zealand lost captain Tom Latham in the fourth over when it was 1-1, Conway navigated the difficult first hour, then flourished, reaching his century after tea from 186 balls. He seemed impregnable until he was finally out for 122 in the over before the second new ball was taken, to the relatively benign spin bowling of Bangladesh captain . Stretching forward to an unthreatening delivery that turned down the leg side, Conway got a faint edge which carried to wicketkeeper . Through the day he had partnerships of 138 with Will Young (52), 50 with who has out for 31 in his penultimate test and 38 with who was 32 not out at stumps. Tom Blundell was out for 11 in the last over of the day. “I think (the pleasing thing) was just the partnerships we had throughout the day. It was nice to spend some time with Ross Taylor in the middle,” Conway said. “It was nice to contribute, especially after not playing for such a long period of time. It was challenging. The wicket was quite green this morning and we knew if we got through that tough period it would always get easier to bat on.” The score at stumps didn't fairly reflect the effort of Bangladesh who worked tirelessly to support the decision of Mominul to bowl on winning the toss. There was moisture in the Bay Oval pitch and Bangladesh seamers Taskin Ahmed and Shoriful Islam were ascendant in the first hour, sending back Latham and troubling Conway and Young. Hitting good lengths with an upright seam, the bowlers found movement away from the right-handers and tied down the New Zealand batsmen who eked out only one run between the first and the ninth overs. Shoriful, who dismissed Latham and later Taylor, had 1-7 from his first five overs. Conway struggled early, surviving a review for lbw before he had scored and teasing gully with a catching chance soon after. But as the pitch dried and switched its support from the bowlers to batsmen he settled, then began to flourish. Two fours off Shoriful in the 21st over were a sign of things to come. He went to lunch on 36 and reached his third half-century in four tests from 101 balls with a six from the spin bowling of Miraz in an over in which he also hit two fours. Conway had put on 138 for the second wicket with Will Young when Young was run out in the 49th over. With the bowlers struggling to find the means to a breakthrough, New Zealand wasted Young's wickets when he set off for a single to mid-wicket and Conway sent him back. An accurate throw to the keeper saw Young run out for a hard-earned 52.","image_url":null,"source_id":"indiatvnews"},{"title":"Usman Khawaja expecting to only replace COVID-positive Travis Head for fourth Ashes Test at SCG - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiaWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAxLTAxL3VzbWFuLWtoYXdhamEtY292aWQtMTktdHJhdmlzLWhlYWQtZm91cnRoLWFzaGVzLXRlc3Qtc2NnLzEwMDczNDY1NtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Usman Khawaja expecting to only replace COVID-positive Travis Head for fourth Ashes Test at SCG  ABC NewsBiggest winner from Ashes Covid carnage  NEWS.com.auHow ‘brave’ Marsh pick would unlock answer to question Aussie cricket ‘must find out’  Fox SportsHead has COVID-19, Khawaja close to recall  The Northern Daily LeaderKhawaja eyes SCG and beyond as Aussies cleared  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-01-01 07:17:37","image_url":null,"source_id":"google"},{"title":"Pollard returns to lead West Indies against England, Ireland","link":"https://www.indiatvnews.com/sports/cricket/pollard-returns-to-lead-west-indies-against-england-ireland-752236","keywords":null,"creator":null,"video_url":null,"description":"Kieron Pollard is back from injury to captain West Indies for the upcoming Twenty20 cricket series against England. West Indies plays England in five T20 internationals at Kensington Oval in Barbados from Jan. 22-30.","content":null,"pubDate":"2022-01-01 06:51:28","full_description":"Kieron Pollard is back from injury to captain West Indies for the upcoming Twenty20 cricket series against England. West Indies plays England in five T20 internationals at Kensington Oval in Barbados from Jan. 22-30. Ahead of the England series, West Indies hosts Ireland in three one-day internationals and a one-off T20 between Jan. 8-16 at Sabina Park in Jamaica. West Indies announced its squads Friday to take on England and Ireland. “We have tried to maintain the general makeup of the squads from the Pakistan tour before Christmas, with the captain and some senior players coming back in,” West Indies head coach Phil Simmons said. “COVID-19 has also played a part in the final makeup of the squad. The challenges in the next couple months are getting the young players in both squads to not only improve on their skills but maintain the attitude and desire we saw in Pakistan.\" Pollard missed the tour of Pakistan because of a hamstring injury at the T20 World Cup. Kieron Pollard (captain), Nicholas Pooran, Fabian Allen (England only), Darren Bravo (England only), Roston Chase, Sheldon Cottrell, Dominic Drakes, , Akeal Hosein, , Brandon King, Kyle Mayers, Rovman Powell, Romario Shepherd, Odean Smith, Hayden Walsh Jr. ieron Pollard (captain), Shai Hope, Shamarh Brooks, Roston Chase, Justin Greaves, Jason Holder, Akeal Hosein, Alzarri Joseph, Gudakesh Motie, Jayden Seales, Nicholas Pooran, Romario Shepherd, Odean Smith, Devon Thomas. (AP) APA APA","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket-Conway hits century on return to put New Zealand ahead","link":"https://www.thestar.com.my/sport/cricket/2022/01/01/cricket-conway-hits-century-on-return-to-put-new-zealand-ahead","keywords":null,"creator":null,"video_url":null,"description":"WELLINGTON (Reuters) - Devon Conway celebrated his return from injury with a sparkling 122 on Saturday to propel New Zealand to 258-5 against Bangladesh on the opening day of the first test in Mount Maunganui. Read full story","content":null,"pubDate":"2022-01-01 06:45:00","full_description":"WELLINGTON (Reuters) - Devon Conway celebrated his return from injury with a sparkling 122 on Saturday to propel New Zealand to 258-5 against Bangladesh on the opening day of the first test in Mount Maunganui. Bangladesh claimed three wickets in the final session but world test champions New Zealand will be confident of a 300-plus score when Henry Nicholls resumes on 32 with Rachin Ravindra joining him on Sunday. \"It might deteriorate over time but I think tomorrow the wicket would be really nice to bat on,\" Conway told reporters after the day's play. \"Hopefully we as a team can capitalise on that.\" Electing to field, Bangladesh got an early breakthrough when Shoriful Islam dismissed Tom Latham, who is leading New Zealand in the absence of injured regular skipper Kane Williamson, in the fourth over. Conway, who had been sidelined with a hand injury suffered during last year's Twenty20 World Cup, helped the hosts weather the tricky morning session with his 138-run stand with Will Young. \"The two of us decided that we needed to be as patient as possible and identify the Bangladesh bowlers who were bowling really well in that period,\" Conway said. Young made 52 before running himself out but Conway could not be denied his hundred. The left-hander pulled Taskin Ahmed for a single to bring up his second century in his fourth test match, taking his helmet off and raising his bat in celebration before embracing batting partner Ross Taylor. \"To have Ross Taylor out in the middle when I achieved that milestone, it's a very special feeling,\" Conway said of the retiring stalwart. \"It'll be one of those things that will last in my memory for a very long time.\" Taylor, who will quit test cricket after the two-test series against Bangladesh, made 34 before becoming Shoriful's second victim. Conway's patient innings, which included 16 boundaries and a six, came to an end when Mominul Haq had him caught down the leg side. Ebadat Hossain dismissed Tom Blundell with the final delivery of the day to lift the spirit in the touring camp. (Reporting by Amlan Chakraborty in New Delhi: Editing by Neil Fullick)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/01/1427895.jpg","source_id":"thestar_my"},{"title":"India's Asia Cup win ideal confidence-booster for U-19 World Cup: Laxman","link":"https://www.indiatvnews.com/sports/cricket/india-s-asia-cup-win-ideal-confidence-booster-for-u-19-world-cup-laxman-752231","keywords":null,"creator":null,"video_url":null,"description":"Newly appointed National Cricket Academy's head VVS Laxman is all praise for India's under-19 team as they won the Asia Cup 2021 beating Sri Lanka in the final on Friday. Laxman expressed that victory becomes more praiseworthy as it came despite the players' preparations being hit by inclement weather in the run-up to the tournament.","content":null,"pubDate":"2022-01-01 06:26:25","full_description":"Newly appointed National Cricket Academy's head VVS Laxman is all praise for India's under-19 team as they won the Asia Cup 2021 beating Sri Lanka in the final on Friday. Laxman expressed that victory becomes more praiseworthy as it came despite the players' preparations being hit by inclement weather in the run-up to the tournament. India reaffirmed their supremacy in the continental age-group meet with a record eighth title as they hammered Sri Lanka by nine wickets in the rain-hit summit showdown in Dubai on Friday. Laxman also called the result an \"ideal confidence-booster\" ahead of the ICC U-19 World Cup, which is scheduled to be held in the West Indies from January 14 to February 5 in the West Indies. \"Congrats to the India U-19 side on the #AsiaCupU19 triumph! Their preparations were hit by the weather, among other things, but it's heartening to see them improve by the game. That's as satisfying as the title win itself. Ideal confidence-booster for the World Cup,\" Laxman tweeted. In the final, the Indian bowlers were all over Sri Lanka, who were gasping at 74 for seven in 33 overs, when heavy rain lashed the Dubai International Cricket Stadium and stopped play for more than two hours. It became a 38-overs-a-side contest when play resumed with Sri Lanka limping to 106 for nine. India were set a revised 102-run target via DLS method which they reached in 21.3 overs with opener Angkrish Raghuvanshi scoring an unbeaten 56 off 67 balls. BCCI president Sourav Ganguly and secretary Jay Shah too congratulated the team on its victory.","image_url":null,"source_id":"indiatvnews"},{"title":"Devon Conway ton props up New Zealand against Bangladesh in first Test","link":"https://sportstar.thehindu.com/cricket/devon-conway-century-new-zealand-bangladesh-first-test-2022-will-young-ross-taylor/article38085617.ece","keywords":null,"creator":["AP"],"video_url":null,"description":"New Zealand’s Conway continues his prolific run-making in Test cricket with an innings of 122 on Day One of the first Test against Bangladesh.","content":null,"pubDate":"2022-01-01 06:24:26","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Pietersen proposes Hundred-like red-ball tournament to \"save\" Test cricket in England","link":"https://sportstar.thehindu.com/cricket/kevin-pietersen-proposes-hundred-like-red-ball-tournament-to-save-test-cricket-england/article38085631.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"Pietersen, who won the Ashes in 2005, 2009, 2010-11 and 2013, said the existing County Championship has lost its sheen and is \"not fit to serve the Test team\" in its current form.","content":null,"pubDate":"2022-01-01 06:23:06","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"“Hopefully I can go out there and score a hundred”: Usman Khawaja opens up on the aspect of playing the Ashes 2021-22 Sydney test","link":"https://thesportsrush.com/cricket-news-hopefully-i-can-go-out-there-and-score-a-hundred-usman-khawaja-opens-up-on-the-aspect-of-playing-the-ashes-2021-22-sydney-test/","keywords":["Cricket","Ashes 2021-22","The Ashes","usman khawaja"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ashes 2021-22: Usman Khawaja is all set to replace Travis Head at the SCG Test after Travis Head’s Covid positive result. Australia have already clinched the series in Melbourne, and they are looking to continue their dominance. Ashes 2021-22 marks the start of Australia’s journey in the World Test Championship, and every match has 12… The post “Hopefully I can go out there and score a hundred”: Usman Khawaja opens up on the aspect of playing the Ashes 2021-22 Sydney test appeared first on The SportsRush.","content":"Ashes 2021-22: Usman Khawaja is all set to replace Travis Head at the SCG Test after Travis Head’s Covid positive result. Australia have already clinched the series in Melbourne, and they are looking to continue their dominance. Ashes 2021-22 marks the start of Australia’s journey in the World Test Championship, and every match has 12 points. Australia wants to get all 60 points from the series. However, the threat of Covid has not left the Australian camp as well. Travis Head, who won Man of the Match in Brisbane is ruled out due to covid. The rest of the squad members are tested negative, and it is a huge positive for the side. Usman Khawaja is all set to make his appearance in the side at the number five slot. Khawaja played his last test in Ashes 2019, and it is a huge step for him. Australia have added Josh Inglis, Mitch Marsh, and Nic Maddinson in the squad, but Khawaja is all set to get the nod. Ashes 2021-22: Usman Khawaja opens up on his International return Khawaja has been in top form in the Sheffield Shield. He has scored 326 runs this season at 81.50, where he has scored two consecutive centuries. Usman batted at the number four slot for Queensland in the Shield games, and it makes him an obvious replacement. Khawaja insists that having some runs under his bank will help him to build momentum. “It’s always nicer when you’re coming off games,” Khawaja said. “I haven’t played for a month now – but it shouldn’t take too long hopefully if I play and get out there, bat for half an hour and get into it, I should find that sync again.” Usman Khawaja in the 2021/22 Sheffield Shield: 5 innings 396 runs @ 79.20 HS: 174 His latest innings? A score of 70 in a total of 129. pic.twitter.com/ENJY5MA2W4 — Wisden (@WisdenCricket) November 10, 2021 Usman Khawaja is one of the few Aussie players to have a hundred in the sub-continent, and he is hopeful to play there. Australia will tour Sri Lanka and Pakistan in the ongoing WTC cycle. Khawaja’s career was said to be over, but his terrific performances in the domestic circuit earned him the spot. “There’s a lot of cricket still to come up,” Khawaja said. “I’ll potentially have one game for Australia here, but even if that doesn’t happen, I know there’s still … a lot of cricket on the subcontinent which I feel I’m very suited too, and which I’m looking forward to hopefully being a part of moving forward.” “I’m fit and healthy. Touchwood, the body’s feeling great.” Usman Khawaja has scored 2887 test runs, whereas he has over 10,000 FC runs under his belt. The 4th Ashes 2021-22 test will be played at the SCG in Sydney from 5th January 2022. The post “Hopefully I can go out there and score a hundred”: Usman Khawaja opens up on the aspect of playing the Ashes 2021-22 Sydney test appeared first on The SportsRush.","pubDate":"2022-01-01 06:17:23","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Kevin Pietersen proposes Hundred-like red-ball tournament to ‘save’ Test cricket in England","link":"https://indianexpress.com/article/sports/cricket/kevin-pietersen-proposes-hundred-like-red-ball-tournament-to-save-test-cricket-in-england/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-01 06:14:41","full_description":"A first-class competition modelled on the Hundred can help the English Test side “return to its former glories”, reckons ex-skipper Kevin Pietersen. Pietersen, who won the Ashes in 2005, 2009, 2010-11 and 2013, said the existing County Championship has lost its sheen and is “not fit to serve the Test team” in its current form. I feel dreadfully sorry for Joe Root. He’s captaining a form of the game that Strauss & co ruined in 2015! Test Cricket should be the pinnacle but Strauss/Morgan are somehow the hero’s..? Like I keep saying, the system is broken & so are the journos who are discrediting Joe! — Kevin Pietersen🦏 (@KP24) December 31, 2021 “With the money elsewhere in the game, the (County) Championship in its current form is not fit to serve the Test team,” Pietersen wrote in a blog post on Betway. “The best players don’t want to play in it, so young English players aren’t learning from other greats like I did. Batters are being dismissed by average bowlers on poor wickets and the whole thing is spiralling.” The 41-year-old praised the England and Wales Cricket Board (ECB) for its professional franchise-based 100-ball cricket tournament – – The Hundred. https://images.indianexpress.com/2020/08/1x1.png “In The Hundred, the ECB have actually produced a competition with some sort of value. It is the best against the best, marketed properly, and the audience engaged with it. “They got new people to the games and I can tell you that the players will have improved markedly for featuring alongside other greats. It’s such a valuable experience.” He advised the board to come up with a similar tournament for the red-ball format, adding that the English players would benefit rubbing shoulders with top overseas players. “They now need to introduce a similar franchise competition for red-ball cricket, whereby the best play against the best every single week. Top Sports News Now Weekly Sports Newsletter: Don't forget Mirabai, Marijne, Washington Sundar and Djokovic Manpreet Singh: The barometer of Indian hockey Virat kohli was told to continue as T20 captain for the sake of Indian cricket: National selector Chetan Sharma Click here for more “They would make money available to attract some of the best overseas players in the world and the top English players would benefit from playing alongside them. “It would be a marketable, exciting competition, which would drive improvement in the standard and get people back through the gates for long-form cricket.” He proposed an eight-team round-robin league where pitches encourage strong batting technique. “The pitches are monitored by the ECB so that we’re not seeing majorly bowler-friendly conditions like we do now. “We have to have good pitches that reward and encourage strong batting techniques, batting for long periods of time, and that require skill from bowlers to take wickets.” Pietersen added that the county system can work as the “feeder system” where players are developed until they’re ready to step up. “I can promise you that the current England team and lots of the best youngsters in the system still see Test cricket, in particular Ashes cricket, as the pinnacle. “But the world’s best players are involved in the IPL, the PSL, the Big Bash, The Hundred, and so on, so it’s no good denying them the chance to make their millions anymore, as I was back in the day. “We need to produce lucrative, high-quality, interesting competitions that reward and improve the best players. This could be one,” he wrote. England are currently 0-3 down in the Ashes. “There is no point blaming Joe Root for what’s happened in Australia. He’s the only class batter in that team and has been tasked with leading an under-prepared, low-quality team into an Ashes series. It was a hopeless task. “Things aren’t going to change by plucking the next batter from county cricket and sticking him up to open the batting. It’s failed too many times now. “This franchise competition would be a fantastic opportunity to improve the standard of red-ball cricket, make domestic cricket interesting to the masses again and It is the only way for the ECB to show that they value Test cricket and value the paying customer.”","image_url":null,"source_id":"indianexpress"},{"title":"NZ vs BAN, 1st Test, Day 1 Report: Devon Conway Ton Anchors New Zealand","link":"https://sports.ndtv.com/cricket/new-zealand-vs-bangladesh-1st-test-day-1-report-devon-conway-ton-anchors-new-zealand-2682851","keywords":null,"creator":null,"video_url":null,"description":"NZ vs BAN: New Zealand batter Devon Conway continued his phenomenal rise in Test cricket, scoring 122 as New Zealand finished day one of the first Test against Bangladesh in a strong position at Mount...","content":null,"pubDate":"2022-01-01 06:07:27","full_description":"New Zealand batter Devon Conway continued his phenomenal rise in Test cricket, scoring 122 as New Zealand finished day one of the first Test against Bangladesh in a strong position at Mount Maunganui on Saturday. In only his fourth Test, and first since recovering from a broken hand, Conway lifted New Zealand from being one for one to close the day at 258 for five with Henry Nicholls on 32 and Tom Blundell out on the last ball for 11. It is the fourth time in seven Test innings that Conway has passed the 50 mark, it lifted his average to 71.57, but after setting New Zealand up for a big score he gave his wicket away to an innocuous Mominul Haque delivery. Mominul only put himself on for three overs before the second new ball and claimed the prized scalp of Conway with a harmless delivery that was edged to wicketkeeper Liton Das. Bangladesh started the day well, putting Zealand into bat and then claiming Tom Latham for one in the fourth over. But their mood changed as Conway mounted partnerships of 138 with Will Young (52), 50 with Ross Taylor (31) and 38 with Nicholls. Conway weathered a fiery start by accurate quicks Taskin Ahmed and Shoriful Aslam who found swing through the air and off the pitch. Shoriful had Latham caught behind for one in the fourth over and in his next over believed he had Conway who had yet to score. The original decision was not out and when Bangladesh appealed the replays were inconclusive and it remained with the umpire's call. But after Conway and Will Young inched New Zealand to 15 off the first 13 overs, the ball began to wear, the pitch began to flatten under a scorching sun and the runs started to flow. Conway brought up his 50 with a majestic pull shot that sent the ball high over the boundary fence and he followed with two fours off the same Mehidy Hasan over. He posted his century in more restrained fashion with a single as he tapped a short Taskin delivery to fine leg, finely missing the two fielders placed for a legside catch. Young was looking comfortable, and survived a delicate edge on 27 which Bangladesh did not pick up and did not appeal. But when he entered the fifties his composure began to wane and after seeing a mistimed hookshot fall in front of the boundary fielder, he called for a single that was never on and gifted the tourists a run out. Taylor, who entered Bay Oval to a standing ovation at the start of his penultimate Test, batted confidently to 31 when he drove at a wide Shoriful delivery but would not keep the ball down with Shadman Island taking a sharp catch at short cover. Promoted Shoriful was the most potent Bangladesh bowler with two for 53. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2022-01/bkfno1c_devon-conway-afp_625x300_01_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Cricket-Australia&#039;s Khawaja looks beyond stop-gap Sydney role","link":"https://www.thestar.com.my/sport/cricket/2022/01/01/cricket-australia039s-khawaja-looks-beyond-stop-gap-sydney-role","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - While Usman Khawaja is ready to fill in for Travis Head in the fourth Ashes test against England, the veteran Australia batsman hopes his would not be a stop-gap role this year. Read full story","content":null,"pubDate":"2022-01-01 06:05:00","full_description":"SYDNEY (Reuters) - While Usman Khawaja is ready to fill in for Travis Head in the fourth Ashes test against England, the veteran Australia batsman hopes his would not be a stop-gap role this year. Head will miss the Sydney contest, which begins on Wednesday, after testing positive for COVID-19, and Khawaja is set to play his first test in more than two years. Khawaja is aware that Head, whose match-winning 152 in the Brisbane opener set the tone for Australia's unassailable 3-0 lead in the series, is likely to reclaim the spot in the final test in Hobart but believes he can still contribute to Australia. \"It's one of those things where even if I do play, it'll only be for one game,\" Khawaja told Cricket Australia (CA). \"I understand that situation ... hopefully I can go out there and score a hundred and do well for the team in the absence of 'Heady'.\" \"Even if that doesn't happen, there's a lot of cricket still to come up,\" he said. Australia will tour Pakistan in March-April and Khawaja hopes to be part of the squad. \"I'll potentially have one game for Australia here, but even if that doesn't happen, I know there's still ...a lot of cricket on the subcontinent which I feel I'm very suited too.\" \"I'm just putting my head down, making sure I'm working really hard and doing the best I can for Australia whenever I get the opportunity.\" Should he get that in Sydney, the Queensland captain is confident of making the most of it despite sitting out the first three matches of the series. \"It's always nicer when you're coming off games. I haven't played for probably a month now, but it shouldn't take too long. \"If I play and get out there, bat for half an hour and get into it, I should find that sync again.\" Khawaja turned 35 last month and said he felt fit enough to carry on. \"I still feel quite young in my head. As long as that's there, I still have the fire spark and as long as the body's holding up...I'll keep playing the game.\" Cricket Australia confirmed all squad members and support staff returned negative COVID-19 results from Friday's testing. (Reporting by Amlan Chakraborty in New Delhi: Editing by Neil Fullick)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/01/1427882.jpg","source_id":"thestar_my"},{"title":"Great lengths: The long and short of why Australia are better than England - Sydney Morning Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5zbWguY29tLmF1L3Nwb3J0L2NyaWNrZXQvZ3JlYXQtbGVuZ3Rocy10aGUtbG9uZy1hbmQtc2hvcnQtb2Ytd2h5LWF1c3RyYWxpYS1hcmUtYmV0dGVyLXRoYW4tZW5nbGFuZC0yMDIyMDEwMS1wNTlsOGguaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Great lengths: The long and short of why Australia are better than England  Sydney Morning HeraldAshes Scout: Former great's plan to save English cricket, whitewash hero's 'brave' choice for Head replacement  The RoarAshes: Michael Atherton Feels Joe Root Should Step Down As England Test Skipper, Names \"Viable Alter..  NDTVSports.comRoot of England’s problem goes much deeper than their hapless captain  Sydney Morning HeraldStokes a viable option for England captaincy - Atherton  SuperSportView Full coverage on Google News","content":null,"pubDate":"2022-01-01 05:35:00","image_url":null,"source_id":"google"},{"title":"Cricket-Thorpe says Ashes shock can spur young England batters on","link":"https://www.thestar.com.my/sport/cricket/2022/01/01/cricket-thorpe-says-ashes-shock-can-spur-young-england-batters-on","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's young batters have been given a \"wake-up call\" by Australia in the Ashes series and must use it to kick-start their careers, assistant coach Graham Thorpe said. Read full story","content":null,"pubDate":"2022-01-01 05:34:00","full_description":"(Reuters) - England's young batters have been given a \"wake-up call\" by Australia in the Ashes series and must use it to kick-start their careers, assistant coach Graham Thorpe said. England find themselves down 3-0 in the five-match series, with none of their batters scoring a century amid struggles against Australia's superb pace attack. But Thorpe, who scored more than 6,000 runs in 100 tests for England, said that the players had started working on solutions to their problems. \"With some players it's a wake-up call and could actually kick-start their careers because they've started training in a very different way. They don't waste time fluffing, hitting half-volleys,\" Thorpe told British media. \"They've come up against some very good bowling attacks, who have been able to have a little watch of them and see where some of their Achilles' heels are, and they're having to face that reality.\" Thorpe said batters had to adapt to the demands of test cricket, which he described as \"10 times harder\" than the domestic game. \"County cricket is what it is, you've got to lift players out of there, then educate them in international cricket. When I look at the batting in general, I try to teach the basics of the game,\" Thorpe added. \"We're trying to still educate some of the younger guys into... the rhythm of test batting, playing situations in the game, doing it for long periods. Some of them haven't been able to do it yet. Some people's journeys are in different places.\" Thorpe will take charge of England during the fourth test in Sydney from Jan. 5-9 while head coach Chris Silverwood isolates in Melbourne after a family member tested positive for COVID-19. (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Kim Coghill)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/01/1427864.jpg","source_id":"thestar_my"},{"title":"Pollard to lead West Indies in limited-overs series against Ireland, Eng","link":"https://www.business-standard.com/article/sports/pollard-to-lead-west-indies-in-limited-overs-series-against-ireland-eng-122010100182_1.html","keywords":null,"creator":null,"video_url":null,"description":"Cricket West Indies (CWI) announced the squads for the upcoming limited-overs series against Ireland and England, with Kieron Pollard as the captain for both the series.","content":null,"pubDate":"2022-01-01 05:12:00","full_description":"Cricket West Indies (CWI) on Saturday (IST) announced the squads for the upcoming limited-overs series against Ireland and England, with Kieron Pollard as the captain for both the series. Three players -- Keacy Carty, Sheldon Cottrell, Hayden Walsh Jr -- have been kept as COVID-19 reserves for the ODI series against Ireland, while Jayden Seales, Alzarri Joseph ad Devon Thomas are the COVID-19 reserves for the two T20I series. The West Indies will start the New Year at Sabina Park, Jamaica as they host Ireland in the three-match One-Day International series and a one-off T20 International from January 8 to 16. The two-time world champions will then travel to Barbados to face England in five T20Is at Kensington Oval from January 22 to 30. \"We have tried to maintain the general make-up of the squads from the Pakistan tour before Christmas, with the captain and some senior players coming back in. COVID-19 has also played a part in the final make-up of the squad. The challenges in the next couple months are getting the young players in both squads to not only improve on their skills but maintain the attitude and desire we saw in Pakistan,\" head coach Phil Simmons said. \"We do need to start the year on a high. And we know both Ireland and England have very good teams, so we expect a very strong challenge as we look improve our chances of automatic qualification for the ICC Cricket World Cup in 2023 and building the T20 team for the ICC T20 World Cup in 2022.\" The ODI series between West Indies and Ireland will be a part of the ICC Men's Cricket World Cup Super League, in which the top seven teams can secure automatic qualification for the ICC Men's Cricket World Cup 2023 in India. CWI also said that Evin Lewis and Anderson Phillip were unavailable for selection due to recent COVID-19 positive tests, while Fabian Allen had recovered from an ankle injury but was unavailable for the Ireland series due to a COVID-19 positive test. Obed McCoy was also unavailable due to rehabilitation on a shin injury. Squads: ODIs vs Ireland: Kieron Pollard (captain), Shai Hope (vice-captain), Shamarh Brooks, Roston Chase, Justin Greaves, Jason Holder, Akeal Hosein, Alzarri Joseph, Gudakesh Motie, Jayden Seales, Nicholas Pooran, Romario Shepherd, Odean Smith, Devon Thomas. (COVID-19 reserves -- Keacy Carty, Sheldon Cottrell, Hayden Walsh Jr). T20Is vs Ireland and England: Kieron Pollard (captain), Nicholas Pooran (vice-captain), Fabian Allen (England T20Is only), Darren Bravo (England T20Is only), Roston Chase, Sheldon Cottrell, Dominic Drakes, Shai Hope, Akel Hosein, Jason Holder, Brandon King, Kyle Mayers, Rovman Powell, Romario Shepherd, Odean Smith, Hayden Walsh Jr. (COVID-19 reserves -- Jayden Seales, Alzarri Joseph, Devon Thomas). Match schedule: (For Ireland series) January 8: 1st ODI; January 11: 2nd ODI; January 14: 3rd ODI; January 16: one-off T20I. (For England series) January 22: 1st T20I; January 23: 2nd T20I; January 26: 3rd T20I; January 29: 4th T20I; January 30: 5th T20I. --IANS akm/ (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220101/thumb-122010100182.jpg","source_id":"business-standard"},{"title":"Watch: Brett Lee Shows No Mercy To Son, Castles Him In Backyard Cricket","link":"https://sports.ndtv.com/cricket/brett-lee-shows-no-mercy-to-his-son-uproots-his-middle-stump-in-backyard-cricket-watch-2682798","keywords":null,"creator":null,"video_url":null,"description":"Brett Lee represented Australia in 76 Tests, 221 ODIs and 25 T20Is, claiming a total of 718 international wickets.","content":null,"pubDate":"2022-01-01 05:07:32","full_description":"Despite hanging his boots long back, former Australia pacer Brett Lee proved that he's still got it. Lee, one of the most fearsome pacers of his time, was having some fun in the backyard playing cricket with his son Preston, who got a first-hand taste of his father's pace. The 15-year-old was shown no mercy by the 45-year-old former speedster, who sent down a thunderbolt of a yorker, uprooting his middle stump. A video of the same was posted by Lee's elder brother and former Australia all-rounder Shane Lee. \"Front yard cricket with the Lee's. @brettlee_58 to @1prestonlee Bowled for 112,\" Shane captioned the video on Instagram. The \"sound of timber\" brought much joy to the legendary pacer, who jogged down in joy raising his fingers. \"See you, Preston,\" Shane could be heard saying in the video. \"Oh yeh! Pack your bags Presto,\" Lee commented on the video. A post shared by Imatlunchwithlee (@imatlunchwithlee) Lee represented his country in 76 Tests, 221 ODIs and 25 T20Is, claiming a total of 718 international wickets. He announced his retirement from Test cricket in 2008 as Australia's sixth-highest wicket-taker, and from ODIs in 2012 as the joint-highest wicket-taker with 380 scalps, along with Glenn McGrath. Lee, who had made his debut during the 1999 Boxing Day Test against India, won two World Cups with Australia -- in 2003 and 2007. Promoted After his retirement, Lee pursued a career in broadcasting, appearing as a commentator for international as well as franchise cricket. His brother Shane, on the other hand, played 55 ODIs for the Aussies between 1995 and 2001.","image_url":"https://c.ndtvimg.com/2022-01/3m0p9bn_brett-lee-instagram_120x90_01_January_22.jpg","source_id":"ndtv"},{"title":"Will \"Do Wonders\" For Team India: Chief Selector Chetan Sharma Heaps Praise On Ruturaj Gaikwad - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiuwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtY2hpZWYtc2VsZWN0b3ItY2hldGFuLXNoYXJtYS1oZWFwcy1wcmFpc2Utb24tcnV0dXJhai1nYWlrd2FkLXNheXMtb3BlbmVyLXdpbGwtZG8td29uZGVycy1mb3ItdGVhbS1pbmRpYS0yNjgyNzcz0gHBAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3NvdXRoLWFmcmljYS12cy1pbmRpYS0yMDIxLTIyL3NvdXRoLWFmcmljYS12cy1pbmRpYS1jaGllZi1zZWxlY3Rvci1jaGV0YW4tc2hhcm1hLWhlYXBzLXByYWlzZS1vbi1ydXR1cmFqLWdhaWt3YWQtc2F5cy1vcGVuZXItd2lsbC1kby13b25kZXJzLWZvci10ZWFtLWluZGlhLTI2ODI3NzMvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Will \"Do Wonders\" For Team India: Chief Selector Chetan Sharma Heaps Praise On Ruturaj Gaikwad  NDTVSports.comRahul named captain for South Africa ODIs; Ashwin returns | Cricbuzz.com - Cricbuzz  CricbuzzJust In: Rohit Sharma Misses Out, KL Rahul Named Captain As BCCI Announces 18-Men Squad For South Africa ODIs  Cricket AddictorNominees for Sir Garfield Sobers Trophy for the ICC Player of the Year revealed  International Cricket CouncilSelectors fretting over Rohit's fitness; ODI selection today with Ashwin, Chahal in fray | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-01-01 04:52:00","image_url":null,"source_id":"google"}]}