{"newsArray":[{"title":"ODI cricket 'dying' says Aussie opener","link":"https://thewest.com.au/sport/cricket/odi-cricket-dying-says-aussie-opener-c-7607906","keywords":null,"creator":["Ed Jackson"],"video_url":null,"description":"Australia's Usman Khawaja isn't surprised England's Ben Stokes has retired from one-day international cricket, believing the format is \"dying a death\".","content":null,"pubDate":"2022-07-22 03:16:03","image_url":"https://images.thewest.com.au/publication/C-7607906/756b9b40940d41024b322681a3af63bab132d270-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI 1st ODI LIVE Streaming Details: When and Where to watch Shikhar Dhawan’s India vs West Indies LIVE in India","link":"https://zeenews.india.com/cricket/ind-vs-wi-1st-odi-live-streaming-details-when-and-where-to-watch-shikhar-dhawan-s-india-vs-west-indies-live-in-india-2488287.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI 1st ODI LIVE Streaming Details: Check When and Where to watch Shikhar Dhawan-led Team India face Nicholas Pooran’s West Indies Cricket Match LIVE.","content":"In the last few months, the hectic schedule in international cricket has become a challenge for nations to put out their best teams in every bilateral series. The effect of this has been that teams are rotating their mainstays, especially with the ICC T20 World Cup 2022 scheduled this year. It means that India are without regular captain Rohit Sharma, Virat Kohli, Rishabh Pant, Hardik Pandya and Jasprit Bumrah for the three-match ODI series against the West Indies, starting from Friday at the Queen’s Park Oval. The captaincy duties have now been handed over to opener Shikhar Dhawan , who will be the seventh captain to lead India this year when they take the field for the first ODI. Despite missing so many prominent players, the Dhawan-led visitors start as favourites against a struggling West Indies side – which is a testament to India`s deep bench strength. It also presents opportunities for players like Ishan Kishan, Ruturaj Gaikwad, Shubman Gill, Sanju Samson, Shreyas Iyer and Deepak Hooda to showcase their temperament and skill-sets in ODI cricket. The #WIvIND ODI series begins tomorrow! Drop a message in the comments below & cheer for #TeamIndia . pic.twitter.com/fYudJX0De8 — BCCI (@BCCI) July 21, 2022 Against a shaky West Indies batting line-up, India have a variety of options to choose from in their bowling attack. Ravindra Jadeja, serving as deputy to Dhawan in ODIs, is likely to team up with leg-spinner Yuzvendra Chahal in the spin department. With Shardul Thakur likely to be seen as a pace all-rounder in Pandya’s absence, Prasidh Krishna and either of Mohammed Siraj or Avesh Khan could be the two pacers if Arshdeep Singh hasn’t fully recovered from the right abdominal strain. For the West Indies, who recently lost the ODI series to Bangladesh 3-0 in Guyana, the return of premier all-rounder Jason Holder is a big boost after being rested from white-ball matches against the Netherlands, Pakistan and Bangladesh. Squads: India: Shikhar Dhawan (Captain), Ruturaj Gaikwad, Shubman Gill, Deepak Hooda, Suryakumar Yadav, Shreyas Iyer, Ishan Kishan (wk), Sanju Samson (wk), Ravindra Jadeja (vice-captain), Shardul Thakur, Yuzvendra Chahal, Axar Patel, Avesh Khan, Prasidh Krishna, Mohd Siraj and Arshdeep Singh. West Indies: Nicholas Pooran (captain), Shai Hope (vice-captain), Shamarh Brooks, Keacy Carty, Jason Holder, Akeal Hosein, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Keemo Paul, Rovman Powell and Jayden Seales. Match Details When will the India vs West Indies 1st ODI match be played? The India vs West Indies 1st ODI match will be played on Friday (July 22). Where will the India vs West Indies 1st ODI match be played? The India vs West Indies 1st ODI match will be played at the Queen’s Park Oval in Port of Spain, Trinidad. What time will the India vs West Indies 1st ODI match start? The India vs West Indies 1st ODI match will start at 7 PM IST. How can I watch the India vs West Indies 1st ODI match? The India vs West Indies 1st ODI match will not be available on any TV channel in India. How can I follow the live streaming of the India vs West Indies 1st ODI match? The India vs West Indies 1st ODI match will be streamed live on Fancode website and app.","pubDate":"2022-07-22 01:59:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Increase in domestic cricket prize money; Deodhar Trophy culled","link":"https://indianexpress.com/article/sports/cricket/increase-in-domestic-cricket-prize-money-deodhar-trophy-culled-8044666/","keywords":["Cricket","Sports"],"creator":["Devendra Pandey"],"video_url":null,"description":null,"content":"Prize money for domestic tournaments, including the Ranji Trophy, will be increased by the Board of Control for Cricket in India. This was one of the decisions taken at the Apex Council meeting held in Mumbai on Thursday. Ranji Trophy winners get a cheque of Rs 2 crore. The decision to increase the prize money follows the windfall of Rs 48,390 crore from sale of IPL media rights “The Apex Council has decided to give powers to office bearers to decide on the revised prize money,” a BCCI official said. The domestic calendar will see a change as the BCCI decided to drop the Deodhar Trophy, which was first held in 1973-74. The Deodhar Trophy is a list-A tournament which features three teams – India A, B and C. A BCCI official said the reason for culling the tournament was the packed domestic schedule. The BCCI is set to conduct 1,773 domestic games this season, including age-group tournaments. “We couldn’t find space with so many matches to be played during the domestic season which is scheduled to start from September this year,” the BCCI official said. Subscriber Only Stories View All Premium MP forest staff get ready but why cheetahs may not roam free Premium Presidential polls: Cross-voting for Murmu bares cracks in Opposition unity Premium In IIMs, few SCs, STs admitted to PhD, pool shallow over the years Premium For future dollar expenses, should you invest in US markets now? Subscribe Now to get 66% OFF The Duleep Trophy to be played in a zonal format, Ranji Trophy to have Elite and Plate groups and the Decision Review System (DRS) likely to be in place for all Ranji Trophy Games, were the other key decisions taken at the Apex Council meeting. The meeting on Thursday was the BCCI’s first physical meeting post Covid-19 . It was chaired by BCCI president Sourav Ganguly while secretary Jay Shah and treasurer Arun Dhumal also attended. As for the Ranji Trophy, the BCCI has decided to reintroduce the Elite and Plate group, like in the pre-Covid days. Thirty-two teams will be divided into four Elite groups of eight each, while six teams will be in the Plate group. The winners of the Plate Group final will get a spot in the quarterfinals of Ranji Trophy. A relegation system will also be in place. The Ranji Trophy will begin in December and teams will play home and away. The other tournaments during the domestic season will be the Irani Trophy (Rest of India vs Ranji Trophy winner), Vijay Hazare Trophy (50 overs) and Syed Mushtaq Ali Trophy (20 overs). The BCCI officials felt that going back to the zonal format in Duleep Trophy will help improve the quality of the tournament. The Duleep Trophy in its current format consists of three teams – India Red, India Blue and India Green DRS likely for Ranji Trophy? The Apex Council discussed having DRS (Decision Review System) in the next season of Ranji Trophy game. A number of howlers by umpires has resulted in the BCCI mulling over introducing DRS in Ranji Trophy. “The BCCI has agreed in principle to have the DRS system in place for next season. If everything goes smoothly, the BCCI will have a DRS system for all live games,” a BCCI official said. Special offer For your UPSC prep, a special sale on our ePaper. Do not miss out! Buy now","pubDate":"2022-07-22 01:40:13","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"India's supporting cast to take on WI","link":"https://www.tribuneindia.com/news/sports/indias-supporting-cast-to-take-on-wi-414613","keywords":null,"creator":null,"video_url":null,"description":"Port of Spain, July 21 India's fringe players will get valuable playing time in a format fighting for context when Shikhar Dhawan leads the team in the three-match ODI series against West Indies beginning here tomorrow. Ben Stokes' surprise retirement from ODIs has fuelled the growing debate about the hectic international scheduling, especially bilateral cricket. The premier English all-rounder made it clear that playing all three formats regularly is not sustainable anymore. Sandwiched between Tests and T20Is, ODI cricket has been jostling for space for a while now. West Indies came to India for three ODIs and as many T20Is in February and the two teams meet again for a total of eight limited-overs games, including five T20Is. In a T20I World Cup year, ODIs assume less significance but players who will be getting an opportunity in the absence of senior players would be eager to make an impact. — PTI KL Rahul tests +ve Mumbai: Star India batter KL Rahul today tested positive for Covid and is likely to be ruled out of the upcoming five-match T20I series against West Indies, beginning next Friday at Tarouba. BCCI president Sourav Ganguly discussed Rahul's situation after the board's Apex Council meeting here.","content":"Port of Spain, July 21 India’s fringe players will get valuable playing time in a format fighting for context when Shikhar Dhawan leads the team in the three-match ODI series against West Indies beginning here tomorrow. Ben Stokes’ surprise retirement from ODIs has fuelled the growing debate about the hectic international scheduling, especially bilateral cricket. The premier English all-rounder made it clear that playing all three formats regularly is not sustainable anymore. Sandwiched between Tests and T20Is, ODI cricket has been jostling for space for a while now. West Indies came to India for three ODIs and as many T20Is in February and the two teams meet again for a total of eight limited-overs games, including five T20Is. In a T20I World Cup year, ODIs assume less significance but players who will be getting an opportunity in the absence of senior players would be eager to make an impact. — PTI KL Rahul tests +ve Mumbai: Star India batter KL Rahul today tested positive for Covid and is likely to be ruled out of the upcoming five-match T20I series against West Indies, beginning next Friday at Tarouba. BCCI president Sourav Ganguly discussed Rahul’s situation after the board’s Apex Council meeting here.","pubDate":"2022-07-22 01:37:05","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_1439153594.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan set to host two tri-series in four years time","link":"https://www.thenews.com.pk/print/975624-pakistan-set-to-host-two-tri-series-in-four-years-time","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pakistan is to host two international tri-series cricket during the forthcoming Future Tour Programme starting from 2024-2028.A well-placed source has told ‘The News’ that idea of these two limited-overs series is the brainchild of Pakistan Cricket Board Chairman Ramiz...","content":null,"pubDate":"2022-07-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Asia Cup likely from Aug 24 in UAE","link":"https://www.thenews.com.pk/print/975627-asia-cup-likely-from-aug-24-in-uae","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The T20 Asia Cup is likely to get underway from August 24-September 10 in the United Arab Emirates with Sri Lanka continuing to act as the host nation.Sri Lanka Cricket Board only the other day expressed its inability to host the Cup considering the financial difficulties the country...","content":null,"pubDate":"2022-07-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pujara joins 'Ranji' with Lord's double century","link":"https://www.thenews.com.pk/print/975641-pujara-joins-ranji-with-lord-s-double-century","keywords":null,"creator":null,"video_url":null,"description":"LONDON: Cheteshwar Pujara emulated a feat of one of the most celebrated Indian batsmen of all time in scoring a double century for Sussex against Middlesex at Lord’s on Wednesday.The last Sussex batsman to post a double century at the Home of Cricket was India opener Pujara’s...","content":null,"pubDate":"2022-07-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Miandad wants Babar to lead till retirement","link":"https://www.thenews.com.pk/print/975630-miandad-wants-babar-to-lead-till-retirement","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Pakistan cricket legend Javed Miandad has suggested that Babar Azam should lead the national side till his retirement.Miandad’s suggestion came a day after Pakistan won the first Test at Galle to take a 1-0 series lead under Babar Azam. Pakistan created a venue record for the most...","content":null,"pubDate":"2022-07-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"ECB delegation briefed about security in Lahore","link":"https://www.thenews.com.pk/print/975626-ecb-delegation-briefed-about-security-in-lahore","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The security team of the English and Wales Cricket Board arrived in Lahore to review and assess the arrangements before the England cricket team's visit to Pakistan.On Thursday, England's security team, including Pakistan Cricket Board officials visited the National High Performance...","content":null,"pubDate":"2022-07-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘Not bad’: Aussie star’s batting average hits 247","link":"https://www.couriermail.com.au/sport/cricket/australian-allrounder-tahlia-mcgrath-takes-batting-average-to-247-in-ireland/news-story/0c241d362533d5c98e497bf57ab7de5f","keywords":["Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries","Swoop","Womens Cricket"],"creator":null,"video_url":null,"description":"Ireland managed what no-one else in world cricket has and finally dismissed Tahlia McGrath in a T20 but not before the Australian all-rounder pounded 70 runs off 45 balls in a statement win ahead of the Commonwealth Games.","content":"McGrath’s ascension to one of if not the best all-rounder in women’s cricket has come in a rush and is underlined by the fact in international T20s the South Australian now averages 247. Her innings in Ireland, as part of a 140-run partnership with captain Meg Lanning which propelled Australia to a mammoth 4-182, also earned her player of the match for the fourth time, in just her eighth game.McGrath is keeping superstar Ellyse Perry out of the team with her all-round capabilities and her hitting power, with her runs coming at a strike rate of 156. In her four international innings McGrath has unbeaten scores of 42, 44 and 91 before finally being dismissed by Georgina Dempsey in Londonderry. “The thing about the T20 format for me is there’s just so much freedom,” McGrath said after the win. “When I come to the wicket I’ve been given a license to play my shots.”Despite her stunning output however, McGrath wants to add another shot to her weaponry, and it’s one of her captain’s. “I love batting with Meg and if there’s one shot I could steal off her it would be that flick off her legs for six. It’s incredible,” she said. “I always feel so calm when I am at the crease with here, she makes things happen.”Ireland was never in the hunt chasing the big total and managed just 7-119 in their 20 overs, with Aussie spin star Alana King taking another two wickets, giving her figures of 8-28 from eight overs across three games in the tri-series which also involves Pakistan. Swing bowler Megan Schutt also became just the second Australian woman to reach 100 T20 international wickets after Ellyse Perry by taking 2-16 from her three overs in the 63-run thrashing.“That’s awesome, she’ll let us know. She likes to brag about those things,” McGrath said of her fellow South Australian.Australia will have one more match in Ireland against Pakistan on Saturday before they travel to Birmingham for the Commonwealth Games, where they‘ll be overwhelming favourites to become the inaugural gold medallists.","pubDate":"2022-07-21 22:37:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussies secure warm up win over Ireland","link":"https://www.couriermail.com.au/sport/cricket/aussies-secure-warm-up-win-over-ireland/video/028aa7834b80bfb2c8e8166c98d3eb02","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Australian Womens cricket team has turned in a solid performance against Ireland to claim victory in their warm up match before the Comm Games.","content":"Cricket: The Australian Womens cricket team has turned in a solid performance against Ireland to claim victory in their warm up match before the Comm Games.","pubDate":"2022-07-21 22:36:20","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Weather at Old Trafford cricket ground tomorrow: Weather forecast Manchester ENG vs SA 2nd ODI","link":"https://thesportsrush.com/cricket-news-weather-at-old-trafford-cricket-ground-tomorrow-weather-forecast-manchester-eng-vs-sa-2nd-odi/","keywords":["Cricket","England","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Weather at Old Trafford cricket ground: The SportsRush presents before you the weather prediction for the second ENG vs SA ODI. The second ODI of the ongoing South Africa’s tour of England in Manchester will begin in less than 24 hours from now. Slated to be a second consecutive day-night fixture for fans in both… The post Weather at Old Trafford cricket ground tomorrow: Weather forecast Manchester ENG vs SA 2nd ODI appeared first on The SportsRush.","content":"Weather at Old Trafford cricket ground: The SportsRush presents before you the weather prediction for the second ENG vs SA ODI. The second ODI of the ongoing South Africa’s tour of England in Manchester will begin in less than 24 hours from now. Slated to be a second consecutive day-night fixture for fans in both the countries, the match will be a Friday night contest for Indian fans. Having last hosted an England vs India ODI as recent as this Sunday, Old Trafford will be hosting its second international match in one week. England, who had lost the third ODI against India here, would be keen to make amends and return to winning ways especially after losing the first ODI on Tuesday. Readers must note that a loss for England on Friday would result in captain Jos Buttler losing his second consecutive ODI series. Having said that, it will also be interesting to see what England do to their Playing XI following all-rounder Ben Stokes’ ODI retirement . A 100% cloud cover to go with strong chances of rainfall in Manchester today has started to worry fans with respect to the second ODI. However, it is noteworthy that the weather prediction is comparatively better for Friday. For starters, rain is expected to make its presence felt tomorrow. Hence, it shouldn’t be a surprise if the match is affected by the weather gods. It is around the start time (01:00 PM) that there’s a highest rain probability of 51% according to AccuWeather. That being said, a major respite lies in the fact that the rain probability will continue to decrease towards the evening. Dropping from 47% to 38% to 26% to 20%, rain probability is expected to remain at 7% post 07:00 PM. Hence, even if rain plays spoilsport in the afternoon, players should get the time to complete a rain-curtailed match. 01:00 PM – 16 degree (Rain Probability – 51%). 02:00 PM – 16 degree (Rain Probability – 47%). 03:00 PM – 16 degree (Rain Probability – 38%). 04:00 PM – 16 degree (Rain Probability – 26%). 05:00 PM – 15 degree (Rain Probability – 26%). 06:00 PM – 14 degree (Rain Probability – 20%). 07:00 PM – 14 degree (Rain Probability – 7%). 08:00 PM – 13 degree (Rain Probability – 7%). 09:00 PM – 13 degree (Rain Probability – 7%). 10:00 PM – 13 degree (Rain Probability – 7%).","pubDate":"2022-07-21 18:48:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI pitch report 1st ODI: Port of Spain Trinidad pitch report batting or bowling today match","link":"https://thesportsrush.com/cricket-news-ind-vs-wi-pitch-report-1st-odi-port-of-spain-trinidad-pitch-report-batting-or-bowling-today-match/","keywords":["Cricket","India's tour of West Indies 2022","Port of Spain"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs WI pitch report 1st ODI: The Port of Spain in Trinidad will host its first One-day international match after a three-year-gap. The Queen’s Park in the city of Port of Spain is all set to host an ODI match after August 2019, with team India, led by Shikhar Dhawan in all readiness to… The post IND vs WI pitch report 1st ODI: Port of Spain Trinidad pitch report batting or bowling today match appeared first on The SportsRush.","content":"IND vs WI pitch report 1st ODI: The Port of Spain in Trinidad will host its first One-day international match after a three-year-gap. The Queen’s Park in the city of Port of Spain is all set to host an ODI match after August 2019, with team India, led by Shikhar Dhawan in all readiness to take on the West Indies challenge at the venue tomorrow. The last ODI at this venue was also an India versus West Indies fixture, with the former prevailing by 6 wickets. While team India will begin the Windies challenge after a successful recently concluded all-format tour to England, where they lifted the three-match ODI and T20I series, West Indies will play tomorrow after having maintained their infamous, winless streak in ODIs against Bangladesh, with a 0-3 series defeat at home. Having said that, the Nicholas Pooran-led side will breathe a bit easy, with the Indian side set to field their playing XI in the absence of the experience of players like Virat Kohli, Rohit Sharma, Rishabh Pant, Mohammed Shami and Jasprit Bumrah. These fans have their tickets ahead of the 1st ODI v India tomorrow!🙌🏾🔥 #WIvIND Get yours at Queen’s Park Oval box office or https://t.co/EmhsRaGBda pic.twitter.com/huhHvU29Up — Windies Cricket (@windiescricket) July 21, 2022 West Indies coach Phil Simmons expects the fresh pitch at the Queen’s Park for the first ODI between the two sides, to be decent enough for batting, despite the last ODI happening at this venue three years ago. With the average first-innings score in ODIs at this venue being 246, expect the spinners to come into play as well during the middle-Overs and reduce the run-scoring rate. With teams batting second having won 80% of the ODI matches at this venue, expect the captain winning the Toss to field first. Having said it all, no ODI at this venue for the past three years has meant that the pitch behavior can only be ascertained upon inspection before the start of play tomorrow.","pubDate":"2022-07-21 18:35:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England win toss and bowl in first women’s T20 International against South Africa","link":"https://www.iol.co.za/sport/cricket/proteas-women/england-win-toss-and-bowl-in-first-womens-t20-international-against-south-africa-b6af0748-d27c-4d05-b49e-ea4ff587fc69","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Du Preez, 33, who retired from Test and One-Day cricket, is playing her first match for the Proteas since the semi-final exit in the 50-over World Cup against England in March.","content":null,"pubDate":"2022-07-21 18:07:29","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/5d606374-f7a3-5926-b115-08182a65cd8f&operation=CROP&offset=0x189&resize=3600x2022","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"England win toss and bowl in first T20 International against South Africa","link":"https://www.iol.co.za/sport/cricket/proteas-women/england-win-toss-and-bowl-in-first-t20-international-against-south-africa-b6af0748-d27c-4d05-b49e-ea4ff587fc69","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Du Preez, 33, who retired from Test and One-Day cricket, is playing her first match for the Proteas since the semi-final exit in the 50-over World Cup against England in March.","content":null,"pubDate":"2022-07-21 17:54:39","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/5d606374-f7a3-5926-b115-08182a65cd8f&operation=CROP&offset=0x189&resize=3600x2022","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"WI vs IND: Rahul tests covid positive; adeja doubtful for ODI series","link":"https://www.thehansindia.com/sports/cricket/wi-vs-ind-rahul-tests-covid-positive-jadeja-doubtful-for-odi-series-754511","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"KL Rahul contracted the virus in BengaluruHe recently underwent a sports hernia surgeryThe first ODI between India and WI is on Friday","content":"KL Rahul is doubtful for India's T20I series against West Indies after testing positive for covid-19.BCCI chief Sourav Ganguly revealed the news on Thursday after the Apex Council Meeting, according to news reports. Rahul's departure for the Caribbean will now depend on his recovery. Rahul recently underwent sports hernia surgery in Germany. Following this, he had been training at National Cricket Academy (NCA) in Bengaluru. While he was not picked for the three-match ODI series in the Caribbean, the Indian management had expected Rahul to regain full fitness in time for the shortest format. The five-match T20I series between India and West Indies is scheduled to begin on July 29 and will go until Aug. 7. The T20Is will be played across three venues: Trinidad, St Kitts, and Florida (U.S). Just earlier in the day, NCA chief VVS Laxman thanked Rahul for interacting with aspiring cricket coaches at the NCA. \"Thank you @klrahul for addressing the candidates attending the Level-3 coach certification course at NCA. Listening to your different experiences as a player and captain will definitely help these passionate coaches to learn, improve and excel in their careers,\" Laxman said, sharing photos of Rahul's interaction with the coaches at the NCA in Bengaluru. Thank you @klrahul for addressing the candidates attending the Level-3 coach certification course at NCA. Listening to your different experiences as a player and captain will definitely help these passionate coaches to learn, improve and excel in their careers. @BCCI #NCA pic.twitter.com/LS3bdPCkIO— VVS Laxman (@VVSLaxman281) July 21, 2022 Notably, Rahul has not played since leading Lucknow Super Giants (LSG) in the Indian Premier League (IPL) 2022. He was appointed as India's stand-in captain for the five-match T20I series at home against South Africa in June. On the eve of the opening game, Rahul picked up a groin injury, and the selectors named Rishabh Pant the skipper for the series. Rahul then also missed India's tour of Ireland and England. The Karnataka batsman was seen batting against India women's cricket team fast bowler Jhulan Goswami at the NCA earlier this week. The star batsman shared clips of his training and rehabilitation at the state-of-the-art facility in Bengaluru on social media. The first ODI between India and West Indies is scheduled to be played on Friday (July 22) at Queen's Park Oval, Port of Spain, Trinidad. The visiting side is without some big names including Rohit Sharma, Virat Kohli, Jasprit Bumrah, Rishabh Pant, and Hardik Pandya. While Rohit, Pant, and Pandya will be back for the T20Is, Kohli and Bumrah are not a part of the Indian touring party. In Rohit's absence, Shikhar Dhawan will lead India in the 50-over games. Meanwhile, all-rounder Ravindra Jadeja is all doubtful for the ODI series due to a knee injury and the decision to rest him as a precautionary measure to not aggregate the issue, according to Cricbuzz.","pubDate":"2022-07-21 17:48:33","image_url":"https://assets.thehansindia.com/h-upload/2022/07/21/500x300_1304118-rahuljadeja.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian cricket team’s jersey sponsor Byju’s allegedly owes Rs 86.21 crore to BCCI, Paytm wants to exit as title sponsor","link":"https://www.tribuneindia.com/news/sports/indian-cricket-teams-jersey-sponsor-byjus-allegedly-owes-rs-86-21-crore-to-bcci-paytm-wants-to-exit-as-title-sponsor-414490","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, July 21Indian cricket team's jersey sponsor Byju's allegedly owes Rs 86.21 crore as dues to the BCCI while title sponsor Paytm has requested the board to transfer its rights to a third party.It was only in April that the Edtech company and the BCCI had agreed on the extension of their partnership until the end of the 2023 ODI World Cup in India at a 10 per cent increment.The issue was discussed by the BCCI Apex Council on Thursday.\"As of today, Byju's owes dues of Rs 86.21 crore to the Board,\" a BCCI source told PTI after the meeting.However, a Byju's spokesperson told PTI: \"We have extended the contract with the BCCI but it is not yet signed. After the contract signing is done, the payments will happen as per the contractual payment terms. So there are no dues pending from our side.\"Byju's first came on board back in 2019 when mobile manufacturer Oppo transferred the sponsorship rights to the online tutorial firm.The start-up last month said 500 people have been laid after reports suggested more than 1000 were fired.Paytm wants home cricket title rights to be shifted to MastercardIn other development, it has been learnt that fintech company Paytm has requested the BCCI to assign their India Home Cricket title rights to Mastercard.The current agreement between Paytm and the BCCI runs from September 2019 to March 31, 2023.The company had missed the July timeline to request for reassignment of the sponsorship. However, considering the \"longstanding\" relationship between the two parties, the BCCI will consider Paytm's request.\"Paytm has request the BCCI for reassignment and the board is considering it,\" the source added.In August 2019, Paytm had extended its association as the title sponsor for international and domestic cricket matches in India by four years with a winning bid of Rs 3.80 crore per match.","content":null,"pubDate":"2022-07-21 17:37:36","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_1694626877.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Belfast pitch report 3rd T20I: IRE vs NZ pitch report Civil Service Cricket Club","link":"https://thesportsrush.com/cricket-news-belfast-pitch-report-3rd-t20i-ire-vs-nz-pitch-report-civil-service-cricket-club/","keywords":["Cricket","Ireland","New Zealand","New Zealand tour of Ireland 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Belfast pitch report 3rd T20I: The SportsRush brings you the pitch report of the 3rd T20I between Ireland and New Zealand. Ireland will take on New Zealand in the 3rd match of the 3-match T20I series at the Civil Service Cricket Club in Belfast. The visitors have already won the series, and they are aiming… The post Belfast pitch report 3rd T20I: IRE vs NZ pitch report Civil Service Cricket Club appeared first on The SportsRush.","content":"Belfast pitch report 3rd T20I: The SportsRush brings you the pitch report of the 3rd T20I between Ireland and New Zealand. Ireland will take on New Zealand in the 3rd match of the 3-match T20I series at the Civil Service Cricket Club in Belfast. The visitors have already won the series, and they are aiming for a whitewash, whereas the hosts will try to win a solitary game in the series. The Kiwi batters have played really well, whereas the bowlers have also done their job with full conviction. Ireland’s batting has let them down in this series, and this is their last chance to prove their mettle in this series. The pitch at the Civil Service Cricket Club in Belfast has been excellent for cricket lovers, as the pitch has been supporting both batters and bowlers. In the two games of the series, every kind of player has enjoyed playing on this very surface in Ireland. The pacers are enjoying bowling in the first innings of the match as they are using the conditions to their advantage. With the new ball and fresh pitch, the ball is moving a bit in the initial overs. The extra bounce on the track is also helpful for the pacers out here. In the 2nd innings, the spinners have been dominating the proceedings, and hitting them has been tough. With 78*, a catch and a stumping, @DaneCleaver was named Player of the Match for T20I 2 at Stormont! #IREvNZ pic.twitter.com/q7ouVkdw2c — BLACKCAPS (@BLACKCAPS) July 20, 2022 The batters are also enjoying playing their shots at this surface after settling down. The outfield of this ground is quite fast, whereas the boundaries are also not huge. Once set, the players can play aggressively and score quick runs at this very truck. The Kiwi batters have enjoyed so far at this surface. A total of 20 T20Is have been played at this very venue, where 12 matches have been won by the chasing teams and 9 teams have been won by the teams batting first. The average 1st innings score has been 120 runs.","pubDate":"2022-07-21 17:30:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 will be held in UAE, confirms BCCI President Sourav Ganguly - Check Reason","link":"https://zeenews.india.com/cricket/asia-cup-2022-will-be-held-in-uae-bcci-president-sourav-ganguly-gives-big-update-2488216.html","keywords":null,"creator":null,"video_url":null,"description":"Despite facing the crisis, Sri Lanka had recently hosted Australia for a multi-format series. The series was highly competitive and saw good cricket from both sides.","content":"Board of Control for Cricket in India (BCCI) President Sourav Ganguly on Thursday informed that the Asia Cup 2022, will be played in UAE. Asia Cup 2022 was supposed to be held in Sri Lanka but due to the ongoing economic crisis, the event has been shifted to UAE. \"Asia Cup will be held in the UAE, as it is the only place where there won't be rain (in that duration),\" Ganguly told reporters after the Board's Apex Council meeting in Mumbai. Asia Cup, which was scheduled to be held in Sri Lanka, has been shifted to the UAE BCCI president Sourav Ganguly said here on Thursday. “Asia Cup will be in UAE, as it is the only place where there won’t be rains” Ganguly told reporters after the Board’s Apex Council meeting here pic.twitter.com/qlQ8HBosXj — Prabodth Official (@PrabodOfficial) July 21, 2022 Earlier, ANI sources in Sri Lanka Cricket Board had stated that the country is facing a huge financial crisis and the board has finally taken a decision to shift the tournament to another country. \"Yes, we are planning to shift the tournament to UAE. We have discussed this matter with the ACC officials and soon we will officially announce this,\" a source had told ANI. Despite facing the crisis, Sri Lanka had recently hosted Australia for a multi-format series. The series was highly competitive and saw good cricket from both sides. Australia won the T20I series 2-1, the ODI series was won by Sri Lanka 3-2, while the Warne-Murli Trophy in Tests was shared after the two-match series ended in a 1-1 draw. Asia Cup 2022 will be held from August 27 to September 11 and will be played in the T20 format.","pubDate":"2022-07-21 17:16:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"'Sponsor Byju's allegedly owes Rs 86 cr to BCCI, Paytm may exit as sponsor'","link":"https://www.business-standard.com/article/sports/sponsor-byju-s-allegedly-owes-rs-86-cr-to-bcci-paytm-may-exit-as-sponsor-122072101492_1.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team's jersey sponsor Byju's allegedly owes Rs 86.21 crore as dues to the BCCI while title sponsor Paytm has requested the board to transfer its rights to a third party. It was only in April that the Edtech company and the BCCI had agreed on the extension of their partnership until the end of the 2023 ODI World Cup in India at a 10 percent increment. The issue was discussed by the BCCI Apex Council on Thursday. \"As of today, Byju's owes dues of Rs 86.21 crore to the Board,\" a BCCI source told PTI after the meeting. However, a Byju's spokesperson told PTI: \"We have extended the contract with the BCCI but it is not yet signed. After the contract signing is done, the payments will happen as per the contractual payment terms. So there are no dues pending from our side.\" Byju's first came on board back in 2019 when mobile manufacturer Oppo transferred the sponsorship rights to the online tutorial firm. The start-up last month said that 500 people have been laid after re","content":"Indian cricket team's jersey sponsor Byju's allegedly owes Rs 86.21 crore as dues to the BCCI while title sponsor Paytm has requested the board to transfer its rights to a third party. It was only in April that the Edtech company and the BCCI had agreed on the extension of their partnership until the end of the 2023 ODI World Cup in India at a 10 percent increment. The issue was discussed by the BCCI Apex Council on Thursday. \"As of today, Byju's owes dues of Rs 86.21 crore to the Board,\" a BCCI source told PTI after the meeting. However, a Byju's spokesperson told PTI: \"We have extended the contract with the BCCI but it is not yet signed. After the contract signing is done, the payments will happen as per the contractual payment terms. So there are no dues pending from our side.\" Byju's first came on board back in 2019 when mobile manufacturer Oppo transferred the sponsorship rights to the online tutorial firm. The start-up last month said that 500 people have been laid after reports suggested more than 1000 were fired. Paytm wants home cricket title rights to be shifted to Mastercard ======================================= In other development, it has been learnt that fintech company Paytm has requested the BCCI to assign their India Home Cricket title rights to Mastercard. The current agreement between Paytm and the BCCI runs from September 2019 to March 31, 2023. The company had missed the July timeline to request for reassignment of the sponsorship. However, considering the \"longstanding\" relationship between the two parties, the BCCI will consider Paytm's request. \"Paytm has request the BCCI for reassignment and the board is considering it,\" the source added. In August 2019, Paytm had extended its association as the title sponsor for international and domestic cricket matches in India by four years with a winning bid of Rs 3.80 crore per match. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-21 17:05:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220721/thumb-122072101492.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022 India's Day 1 Schedule: Indian Women’s cricket team, Men's Hockey team to be in action","link":"https://zeenews.india.com/other-sports/commonwealth-games-2022-indias-day-1-schedule-indian-women-s-cricket-team-mens-hockey-team-to-be-in-action-2488213.html","keywords":null,"creator":null,"video_url":null,"description":"Here’s the full schedule of India for Day 1 of the Commonwealth Games 2022, Birmingham.","content":"The Indian contingent for the Commonwealth Games 2022 will look to improve the country's medal tally in the mega event which will kick start on July 29. This will be the 22nd edition of the game first played in 1930 in Hamilton, Canada. India is regarded as one of the strongest competitors in CWG 2022, even though Shooting is not part of the sports roster. England, Australia, Canada and New Zealand are the other top medal contenders. India's men's Hockey team led by Manpreet Singh and the Indian Women’s cricket team captained by Harmanpreet Kaur will be in action on Day 1. In squash, Sourav Ghoshal and Josahana Chinappa are India's top medal contenders while in Boxing Shiva Thapa will be one to watch out for. Commonwealth Games 2022 Day 1 July 29, 2022 Lawn Bowl - 05:30 pm IST Indian players in action Sunil Bahadur Chandan Kumar Singh Navneet Singh Dinesh Kumar Mridul Borgohain Pinki Tania Choudhury Rupa Rani Tirkey Nayan Moni Saikia Lovely Choubey Table Tennis - 06:30 pm IST Men’s and Womens’Team Event Qualification Round 1 Indian players in action Women’s Table Tennis Team: Manika Batra, Sreeja Akula, Reeth Rishya, Diya Chitale Men’s Table Tennis Team: Sharath Kamal, Gnanasekaran Sathiyan, Harmeet Desai, Sanil Shetty Swimming - 07:30 pm IST Indian players in action Sajan Prakash Srihari Nataraj Kushagra Rawat Cricket, Women’s T20I - 08:00 pm IST Australia vs India Group Match Triathalon Women's Individual (Sprint Distance) Final - 08:00 pm IST Indian players in action Sanjana Joshi Pragnya Mohan Boxing - 09:00 pm IST Indian players in action Shiva Thapa- Men’s Lightwelter Round of 32 Sumit Kundu- Men’s 75 Kg Round of 32 Squash - 09:00 pm IST Indian players in action Men’s Singles- Ramit Tandon, Sourav Ghoshal, Abhay Singh Women’s Singles- Joshna Chinappa, Anahat Singh, Sunayna Kuruvilla Badminton - 11:00 pm IST Mixed Team Event Qualifying Round 1- India vs Pakistan Boxing - 03:30 am IST Men’s 67 KG- Rohit Tokas Men’s 75 KG- Ashish Chaudhary Men’s Hockey India vs Ghana","pubDate":"2022-07-21 16:58:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies के खिलाफ वनडे सीरीज में रविन्द्र जडेजा को मिल सकता है आराम, कोहली-बुमराह भी नहीं होंगे टीम का हिस्सा","link":"https://www.abplive.com/sports/cricket/ravindra-jadeja-may-get-rest-in-odi-series-against-west-indies-2173381","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IND vs WI 2022:</strong> भारतीय ऑलराउंडर रविन्द्र जडेजा (Ravindra Jadeja) ने इंग्लैंड के खिलाफ एजबेस्टन टेस्ट में शतकीय पारी खेली थी, इसके अलावा जडेजा लगातार क्रिकेट खेल रहे हैं. अब भारतीय टीम वेस्टइंडीज दौरे पर टी20 और वनडे मैचों की सीरीज खेलेगी. वेस्टइंडीज के खिलाफ वनडे सीरीज के लिए विराट कोहली (Virat Kohli) और जसप्रीत बुमराह (Jasprit Bumrah) जैसे खिलाड़ियों को आराम दिया गया है. वहीं, अब ऐसा माना जा रहा है कि भारत-वेस्टइंडीज सीरीज (IND vs WI 2022) में ऑलराउंडर रविन्द्र जडेजा को आराम दिया जा सकता है.</p> <p style=\"text-align: justify;\"><strong>KL Rahul कोरोना पॉजिटिव</strong></p> <p style=\"text-align: justify;\">गौरतलब है कि वेस्टइंडीज के खिलाफ सीरीज के लिए विराट कोहली और जसप्रीत बुमराह जैसे खिलाड़ियों को आराम दिया गया है. वहीं, वनडे सीरीज में शिखर धवन भारतीय टीम के कप्तान होंगे. जबकि नेशनल क्रिकेट एकेडमी में अभ्यास कर रहे ओपनर बल्लेबाज केएल राहुल की कोरोना वायरस रिपोर्ट पॉजिटिव आई है. ऐसे में तकरीबन तय माना जा रहा है कि वेस्टइंडीज के खिलाफ सीरीज में केएल राहुल भारतीय टीम का हिस्सा नहीं होंगे.</p> <p style=\"text-align: justify;\"><strong>राहुल का खेलना संदिग्ध</strong></p> <p style=\"text-align: justify;\">दरअसल, भारतीय क्रिकेट टीम (Indian Cricket Team) वेस्टइंडीज दौरे पर वनडे सीरीज के अलावा टी20 मैचों की सीरीज खेलेगी. इस दौरे पर भारतीय कोच राहुल द्रविड़ (Rahul Dravid) कई नए चेहरों को आजमा सकते हैं. बहरहाल, ऐसा माना जा रहा था कि ओपनर केएल राहुल वेस्टइंडीज के खिलाफ सीरीज में भारतीय टीम का हिस्सा होंगे, लेकिन अब इस बल्लेबाज की कोरोना वायरस (Corona Virus) रिपोर्ट पॉजिटिव आने के बाद केएल राहुल का खेलना संदिग्ध माना जा रहा है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/due-to-the-political-instability-in-sri-lanka-the-asia-cup-2022-may-be-held-in-india-or-the-united-arab-emirates-2173014\">Asia Cup 2022: भारत में हो सकता है एशिया कप का आयोजन, श्रीलंका क्रिकेट बोर्ड कर रहा बातचीत</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/female-fan-shizara-waits-for-2-hours-to-meet-shreyas-iyer-at-port-of-spain-airport-in-trinidad-and-tobago-2173061\">Watch: श्रेयस अय्यर से मिलने के लिए 2 घंटे तक एयरपोर्ट पर खड़ी रही महिला फैन, देखें वीडियो</a><br /></strong></p>","content":null,"pubDate":"2022-07-21 16:56:15","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"KL Rahul की कोरोना वायरस रिपोर्ट पॉजिटिव, बीसीसीआई अध्यक्ष सौरव गांगुली ने की पुष्टि","link":"https://www.abplive.com/sports/cricket/the-corona-virus-report-of-kl-rahul-who-is-practicing-at-the-national-cricket-academy-in-bangalore-has-come-positive-2173369","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>KL Rahul Corona Virus:</strong> भारतीय क्रिकेट टीम के लिए बुरी खबर है. दरअसल, विकेटकीपर बल्लेबाज केएल राहुल (KL Rahul) की कोरोना वायरस (Corona Virus) रिपोर्ट पॉजिटिव आई है. बीसीसीआई (BCCI) अध्यक्ष सौरव गांगुली (Sourav Ganguly) ने अपेक्स काउंसिल की मीटिंग के बाद केएल राहुल के कोरोना संक्रमित होने की जानकारी दी. बहरहाल, केएल राहुल ग्रोइन इंजरी से जूझ रहे थे. पिछले दिनों जर्मनी में इस खिलाड़ी का ऑपरेशन हुआ था.</p> <p style=\"text-align: justify;\"><strong>NCA में अभ्यास कर रहे थे राहुल</strong></p> <p style=\"text-align: justify;\">गौरतलब है कि सर्जरी के बाद केएल राहुल बैंगलोर स्थित नेशनल क्रिकेट एकेडमी में अभ्यास कर रहे थे. वहीं, भारतीय टीम वेस्टइंडीज के खिलाफ सीरीज खेलने वाली है. वेस्टइंडीज के खिलाफ इस सीरीज में खेलने के लिए केएल राहुल को फिटनेस टेस्ट पास करना जरूरी था, लेकिन अब कोरोना वायरस रिपोर्ट पॉजिटिव आई है.</p> <p style=\"text-align: justify;\"><strong>वेस्टइंडीज सीरीज में राहुल के खेलने पर संशय बरकरार</strong></p> <p style=\"text-align: justify;\">बहरहाल, आगामी कुछ दिनों में भारतीय टीम वेस्टइंडीज (West Indies) के लिए रवाना होगी. अब ऐसे में केएल राहुल (KL Rahul) के खेलने पर संशय बरकरार है. दरअसल, केएल राहुल को भारतीय टीम के साथ वेस्टइंडीज दौरे पर जाने के लिए कम से कम 2 नेगेटिव रिपोर्ट की जरूरत होगी. अब यह देखने वाली बात होगी कि वह वेस्टइंडीज के खिलाफ सीरीज में भारतीय टीम का हिस्सा होते हैं या नहीं. इससे पहले साउथ अफ्रीका के खिलाफ सीरीज में भी केएल राहुल भारतीय टीम का हिस्सा नहीं थे.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/female-fan-shizara-waits-for-2-hours-to-meet-shreyas-iyer-at-port-of-spain-airport-in-trinidad-and-tobago-2173061\">Watch: श्रेयस अय्यर से मिलने के लिए 2 घंटे तक एयरपोर्ट पर खड़ी रही महिला फैन, देखें वीडियो</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/due-to-the-political-instability-in-sri-lanka-the-asia-cup-2022-may-be-held-in-india-or-the-united-arab-emirates-2173014\">Asia Cup 2022: भारत में हो सकता है एशिया कप का आयोजन, श्रीलंका क्रिकेट बोर्ड कर रहा बातचीत</a><br /></strong></p>","content":null,"pubDate":"2022-07-21 16:55:43","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Fancode subscription price: How to buy Fancode subscription for India vs West Indies ODI series 2022?","link":"https://thesportsrush.com/cricket-news-fancode-subscription-price-how-to-buy-fancode-subscription-for-india-vs-west-indies-odi-series-2022/","keywords":["Cricket","India's tour of West Indies 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Fancode subscription price: Online streaming platform Fancode will live stream India’s upcoming tour of West Indies beginning tomorrow. Team India is all set to take on West Indies for a three-match ODI series at the Queen’s Park Oval, Port of Spain, in Trinidad beginning tomorrow. The last time this venue hosted an ODI match was… The post Fancode subscription price: How to buy Fancode subscription for India vs West Indies ODI series 2022? appeared first on The SportsRush.","content":"Fancode subscription price: Online streaming platform Fancode will live stream India’s upcoming tour of West Indies beginning tomorrow. Team India is all set to take on West Indies for a three-match ODI series at the Queen’s Park Oval, Port of Spain, in Trinidad beginning tomorrow. The last time this venue hosted an ODI match was back in August 2019 between these two sides itself, with the hosts getting defeated by 6 wickets. While team India is all pumped-up following an away ODI and T20I series victory against a quality England side, they would also be without the services of some of their experienced players in Rohit Sharma, Virat Kohli, Jasprit Bumrah, Hardik Pandya, and Mohammed Shami. As for the Windies, they will have to come up with some inspirational performance to get the better of the Indian side despite being bereft of enough international experience. The Nicholas Pooran led-side were, a few days ago, handed a 0-3 drubbing against Bangladesh at home in the ODI series. ALSO READ: India vs West Indies 1st ODI Live Telecast channel Details Fancode subscription price Fans in India can live stream stream the three-match ODI series followed by a five-match T20I series between India and West Indies live on the ‘FANCODE’ app. The online viewers can watch the series by purchasing the ‘FANCODE’ pass at a nominal price. The app provides a couple of options to its users to avail the series pass – the ‘Classic pass’ and the ‘Ad Free’ pass. By availing the Classic pass, one can watch all the eight matches of the tour at INR 99. The Ad Free pass, on the other hand, can be purchased at INR 169, wherein the live streaming would not be interrupted with advertisements between Overs. Users would then be taken to the payment section, where the tour pass will be activated by paying via Debit/Credit Card, UPI, or Net Banking. Thrilled to rejoin the @FanCode team as tours @windiescricket with @RaviShastriOfc @imAagarkar @kartikmurali @DeepDasgupta7 @pragyanojha @MohammadKaif & more on Commentary Look forward to more history being created in the #Caribbean by #TeamIndia #WIvIND #INDvWI #IND pic.twitter.com/0VVmQQtRw8 — Suhail Chandhok (@suhailchandhok) July 21, 2022 For more Cricket-related news, click here. The post Fancode subscription price: How to buy Fancode subscription for India vs West Indies ODI series 2022? appeared first on The SportsRush.","pubDate":"2022-07-21 16:41:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 1st ODI Live Telecast Channel name in India and US: When and where to watch IND vs WI Port of Spain ODI?","link":"https://thesportsrush.com/cricket-news-india-vs-west-indies-1st-odi-live-telecast-channel-name-in-india-and-us-when-and-where-to-watch-ind-vs-wi-port-of-spain-odi/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs West Indies 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st WI vs IND ODI. India’s tour of West Indies 2022 will kick-start with the first ODI to be played in Port of Spain tomorrow. Set to host international cricket after almost three years,… The post India vs West Indies 1st ODI Live Telecast Channel name in India and US: When and where to watch IND vs WI Port of Spain ODI? appeared first on The SportsRush.","content":"India vs West Indies 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st WI vs IND ODI. India’s tour of West Indies 2022 will kick-start with the first ODI to be played in Port of Spain tomorrow. Set to host international cricket after almost three years, Queen’s Park Oval’s last international match was also a West Indies vs India ODI after the ICC Cricket World Cup 2019. India, who have a lead over West Indies as far as their head-to-head ODI record is concerned, would be keen to better their record against this opposition away from home. However, the visitors will have to do the needful in the absence of multiple first-choice players and under stand-in captain Shikhar Dhawan. Meanwhile, hosts West Indies will be having eyes on an ODI victory after losing six matches in a row in the last 45 days or so. In addition to their dismal current form, it is noteworthy that West Indies are on a five-match losing streak against India in this format. ALSO READ: ODI records at Queen’s Park Oval, Port of Spain In what is going to be the 23rd bilateral ODI series (10th in West Indies) between these two teams, it won’t be part of the ongoing ICC Men’s World Cup Super League. Readers must note that India have a 14-8 ODI series lead against West Indies. India, who haven’t lost a bilateral ODI series against this opposition since 2006, have won five out of eight series away from home. India vs West Indies 1st ODI Live Telecast Channel name in India and US The unwanted trend of international cricket not available for the Indian television audiences would’ve continued in this series as well had Doordarshan Sports not bagged the rights for these eight white-ball matches. It goes without saying that it will be after numerous years that Doordarshan will be solely televising a cricket series featuring India. Kicking off the ODIs tomorrow at Queen’s Park Oval, Trinidad #WIvIND 1st ODI, LIVE and Exclusive on DD Sports pic.twitter.com/0lar4exa48 — Doordarshan Sports (@ddsportschannel) July 21, 2022 Streaming platform FanCode, which had been streaming international cricket in West Indies for the Indian audiences lately, will continue to do so for this tour as well. Fans, who wish to buy a pass for the whole tour (three ODIs and five T20Is), will have to pay a nominal price of INR 99 on the website or mobile application of FanCode. Interestingly, a novel development will allow fans to watch the whole tour without any ads by spending a total of INR 169. As far as local fans in the Caribbean are concerned, they will be able to follow Trinidad ODIs on ESPN Caribbean. Meanwhile, fans living in USA and UK will be able to watch this series on ESPN+ and BT Sport respectively. Date – 22/07/2022 (Friday). Match start Time – 09:30 AM (local) and 07:00 PM (India). TV Channel – Doordarshan Sports (India), ESPN Caribbean (Caribbean), ESPN+ (USA) and BT Sport (UK). Online platform – FanCode (India). The post India vs West Indies 1st ODI Live Telecast Channel name in India and US: When and where to watch IND vs WI Port of Spain ODI? appeared first on The SportsRush.","pubDate":"2022-07-21 16:34:09","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KL Rahul tests positive for COVID-19","link":"https://telanganatoday.com/kl-rahul-tests-positive-for-covid-19","keywords":["News","Sport","Covid-19","KL Rahul","Sourav Ganguly","West Indies"],"creator":["PTI"],"video_url":null,"description":"Mumbai: Star India batter KL Rahul on Thursday tested positive for COVID-19, which is likely to rule him out of the upcoming five-match T20 series against the West Indies, starting July 29 at Tarouba. BCCI president Sourav Ganguly informed about Rahul after the Board’s Apex Council meeting here. Rahul on Thursday itself had addressed the […]","content":"Mumbai: Star India batter KL Rahul on Thursday tested positive for COVID-19, which is likely to rule him out of the upcoming five-match T20 series against the West Indies, starting July 29 at Tarouba. BCCI president Sourav Ganguly informed about Rahul after the Board’s Apex Council meeting here. Rahul on Thursday itself had addressed the candidates, who attended the Level-3 coach certification course at National Cricket Academy in Bengaluru. Rahul, who underwent a hernia operation in Germany recently, was rested for the ODI series against the West Indies starting Friday at Port of Spain. Ganguly also informed that a member of the Commonwealth Games-bound India women’s team was also down with COVID-19. He, however, did not disclose the name of the player.","pubDate":"2022-07-21 16:11:21","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 will be held in UAE, says BCCI President Sourav Ganguly","link":"https://www.business-standard.com/article/sports/asia-cup-2022-will-be-held-in-uae-says-bcci-president-sourav-ganguly-122072101372_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Asia Cup, which was scheduled to be held in Sri Lanka, has been shifted to the UAE, BCCI president Sourav Ganguly said here on Thursday. \"Asia Cup will be in UAE, as it is the only place where there won't be rains,\" Ganguly told reporters after the Board's Apex Council meeting here. Sri Lanka Cricket (SLC) on Wednesday had informed the Asian Cricket Council (ACC) that the board will not be in a position to host the upcoming edition of the Asia Cup T20 because of the economic and political crisis in the country. The development comes after the SLC recently postponed the third edition of the Lanka Premier League (LPL) due to the ongoing crisis. Asia Cup is slated to be held from August 27 to September 11 and will be played in the T20 format.","content":"The Asia Cup, which was scheduled to be held in Sri Lanka, has been shifted to the UAE, BCCI president Sourav Ganguly said here on Thursday. \" Asia Cup will be in UAE, as it is the only place where there won't be rains,\" Ganguly told reporters after the Board's Apex Council meeting here. Sri Lanka Cricket (SLC) on Wednesday had informed the Asian Cricket Council (ACC) that the board will not be in a position to host the upcoming edition of the Asia Cup T20 because of the economic and political crisis in the country. The development comes after the SLC recently postponed the third edition of the Lanka Premier League (LPL) due to the ongoing crisis. Asia Cup is slated to be held from August 27 to September 11 and will be played in the T20 format. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-21 16:01:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220721/thumb-122072101372.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: England look to add a bit of Salt to spice up their ODI team","link":"https://www.iol.co.za/sport/cricket/proteas/watch-england-look-to-add-a-bit-of-salt-to-spice-up-their-odi-team-89ada807-fa04-46bd-93d8-b7d6693a76d2","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"The timing of Ben Stokes’ departure from ODI cricket, which stunned the entire cricket world let alone England, can be understood though.","content":null,"pubDate":"2022-07-21 15:56:41","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/77186042-2a26-57e5-941c-b20cd2bb6810&operation=CROP&offset=0x34&resize=1280x720","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"KL Rahul covid: Will KL Rahul play T20 vs West Indies","link":"https://thesportsrush.com/cricket-news-kl-rahul-covid-will-kl-rahul-play-t20-vs-west-indies/","keywords":["Cricket","India tour of West Indies 2022","KL Rahul"],"creator":["Gurpreet Singh"],"video_url":null,"description":"KL Rahul covid: The wicket-keeper batter is currently training at the NCA after missing out on India’s recent fixtures due to injury. India’s premier wicket-keeper batter KL Rahul is, who is out of international Cricket action since last month, has been handed yet another setback with him being tested COVID-19 positive on Thursday. As per… The post KL Rahul covid: Will KL Rahul play T20 vs West Indies appeared first on The SportsRush.","content":"KL Rahul covid: The wicket-keeper batter is currently training at the NCA after missing out on India’s recent fixtures due to injury. India’s premier wicket-keeper batter KL Rahul is, who is out of international Cricket action since last month, has been handed yet another setback with him being tested COVID-19 positive on Thursday. As per the news agency PTI, BCCI president Sourav Ganguly, post attending the board’s apex council meeting today evening, told the reporters about the same. As for Rahul, he is presently training at the National Cricket Academy (NCA) in Bengaluru, with an aim to make a comeback into the Indian limited-Overs side for the tour of West Indies. For those unaware, the Karnataka batter was ruled out on the eleventh hour due to a groin injury after being named as captain of team India for the T20I series against South Africa in August last month. He has been out of action since then. KL Rahul covid KL Rahul, earlier this month was included in team India’s 18-member squad for the imminent five-match away T20I series against West Indies, which is scheduled to commence from July 29, after the three-match ODI series. His selection, along with leg-spinner Kuldeep Yadav, was however subject to fitness. Both Rahul and Kuldeep were supposed to leave for the Caribbean and join the squad, post clearing the fitness test set to take place this week itself. A day ago, Rahul not only posted his extensive training video, but was also seen facing the legendary Jhulan Goswami at the NCA nets in Bengaluru. Even today, he had addressed the candidates attending the Level-3 coach certification course at the academy. Thank you @klrahul for addressing the candidates attending the Level-3 coach certification course at NCA. Listening to your different experiences as a player and captain will definitely help these passionate coaches to learn, improve and excel in their careers. @BCCI #NCA pic.twitter.com/LS3bdPCkIO — VVS Laxman (@VVSLaxman281) July 21, 2022 With him now being tested COVID positive, it is highly likely that his fitness test would not take place at the scheduled date this week, which further forms darkened clouds over his selection in the playing XI, at least in the first couple of T20Is. Refer to this space for further updated news regarding his place in the T20Is against the Windies. The post KL Rahul covid: Will KL Rahul play T20 vs West Indies appeared first on The SportsRush.","pubDate":"2022-07-21 15:36:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"K L Rahul tests positive for Covid, participation in T20s in WI doubtful","link":"https://www.business-standard.com/article/sports/k-l-rahul-tests-positive-for-covid-participation-in-t20s-in-wi-doubtful-122072101345_1.html","keywords":null,"creator":null,"video_url":null,"description":"Star India batter K L Rahul on Thursday tested positive for COVID-19, which is likely to rule him out of the upcoming five-match T20 series against the West Indies, starting July 29 at Tarouba. BCCI president Sourav Ganguly informed about Rahul after the Board's Apex Council meeting here. Rahul on Thursday itself had addressed the candidates, who attended the Level-3 coach certification course at National Cricket Academy in Bengaluru. Rahul, who underwent a hernia operation in Germany recently, was rested for the ODI series against the West Indies starting Friday at Port of Spain. Ganguly also informed that a member of the Commonwealth Games-bound India women's team was also down with COVID-19. He, however, did not disclose the name of the player.","content":null,"pubDate":"2022-07-21 15:13:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220721/thumb-122072101345.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"}]}