{"newsArray":[{"title":"Finch’s dangerously familiar Australia host an England T20 side in transition","link":"https://www.theguardian.com/sport/2022/oct/08/finchs-dangerously-familiar-australia-host-an-england-t20-side-in-transition","keywords":["Australia cricket team","England cricket team","Australia sport","Cricket","Sport"],"creator":["Geoff Lemon"],"video_url":null,"description":"World Cup warm-up series sees Jos Buttler fine-tune his team while Steve Smith’s spot is the hosts’ one question markThere’s a pleasant sense of relief this week, as we head into an Australia-England cricket contest without an accompanying circus of hype.Nobody is crowing about a limited-overs series constituting the Twenty20 Ashes, as the marketing departments might once have attempted. Instead the three matches between Sunday and Friday will be rightly seen as warm-ups for the T20 World Cup, even if they’re not part of the official warm-up program that will see Australia play once against India, and England once against Pakistan, before the tournament proper. Continue reading...","content":"There’s a pleasant sense of relief this week, as we head into an Australia-England cricket contest without an accompanying circus of hype. Nobody is crowing about a limited-overs series constituting the Twenty20 Ashes, as the marketing departments might once have attempted. Instead the three matches between Sunday and Friday will be rightly seen as warm-ups for the T20 World Cup, even if they’re not part of the official warm-up program that will see Australia play once against India, and England once against Pakistan, before the tournament proper. ‘Very dangerous but not favourites’: Buttler weighs England’s T20 hopes Read more This should be a series of relative restraint, with sides looking to find a groove against quality opposition and answer a couple of final selection questions. That fits with the feeling that even the tournament proper is not exactly stirring swells of anticipation. The previous T20 trophy was won less than 11 months ago. The 2024 edition in the Caribbean and United States will be the third in less than three years. The schedule trivialises the concept of a World Cup. These are exhibition tournaments for a funding sugar-hit, not meaningful paths to defining the team of an era. The 50-over format may be declining bilaterally, but the ODI World Cup retains its cachet, while not coincidentally retaining its quadrennial structure alongside its football equivalent and the Olympic Games. So it is. People will still watch what they don’t retain, and as the modern seer Taylor Swift has observed, the players will continue to play. With their short careers and the vagaries of the format, most cricketers don’t mind a couple of extra attempts at winning a prize to pad out their commentary CVs. Australia’s win in the 2021 edition, on pay television from the Arabian Gulf in the middle of the night, got a muted reaction compared to the likely response of winning at home. England, meanwhile, have been underachievers in the shortest format while leading a white-ball revolution from 2015. They lost the 2016 final to the free-swinging West Indies and got politely mugged by New Zealand in the 2021 semi. The most destructive batting side in the world through that era has one 50-over World Cup to show for it. In many ways that era is over, though principles of aggression and some personnel remain. Eoin Morgan called it quits, Jason Roy ran out of runs, Jonny Bairstow impossibly blew his leg off playing golf, Jofra Archer was the bowler of 2019 and has been head of the injury list since, Joe Root was deemed too slow, Liam Plunkett got pensioned off, Mark Wood is always one mile per hour from injury, Ben Stokes has been drafted back in despite never doing much in the format. The consistent presences from the start of Morgan’s era to now are new captain Jos Buttler, Moeen Ali, Chris Jordan, Chris Woakes and Adil Rashid. Alex Hales (left) and Phil Salt are in competition for the opening slot alongside England captain Jos Buttler. Photograph: Alex Davidson/Getty Images Alex Hales and David Willey got booted sufficiently long ago that they have had time to cycle away from the team and work back. Newer blood like Harry Brook, Phil Salt, Liam Livingstone, and the left-arm thunderbolt merchant Reece Topley will need to run hot for England to maintain their old level. Australian selectors, meanwhile, have to make decisions about whether they will make any decisions. Their squad could produce the exact same XI that won the World Cup in Dubai last year. That won’t be the case in the series opener against England, with the main four bowlers and six-hitter Glenn Maxwell being spared the long trip to Perth in favour of resting. Fringe players will get a gallop on the park and a last chance to impress, supplemented by players from outside the squad. But the second and third matches in Canberra will give a better sense of the tournament plan. Australian selection style has been conservative since Bradman’s day, so it was amusing to see a Test pace attack picked for a T20 World Cup – and then win the thing. They will get another chance as long as Pat Cummins, Josh Hazlewood and Mitchell Starc stay fit alongside spinner Adam Zampa. The same caution will see selectors stick with Aaron Finch despite his traditional run-drought before a big tournament, and Marcus Stoinis as the incumbent all-rounder despite recent claims in his absence of Cameron Green from outside the squad. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. David Warner at the top of the order is still the most productive bat, while keeper Matthew Wade has been irreproachable as a number seven finisher. Mitchell Marsh will bat at three as he did in his trophy-clinching performance last year, and might bowl medium pace. Maxwell will float around the middle order and bowl off-spin. The only real question is whether to bow to reputation and keep Steve Smith in the side, or use the power of new boy Tim David. Smith is innovative but often doesn’t maintain a high enough run rate, while David is the kind of player who can take 30 from 10 balls at the end of an innings to change a match. Even Australian selectors can sometimes take a punt on a good thing.","pubDate":"2022-10-08 20:20:47","image_url":"https://i.guim.co.uk/img/media/298c3c5284085b5991f9af04f64a245d1f668019/113_243_6352_3812/master/6352.jpg?width=460&quality=85&auto=format&fit=max&s=f596daef06b79c6fb14df2bc65fab40c","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket IPL 2023 auction date: Has BCCI finalized IPL auction 2023 date?","link":"https://thesportsrush.com/cricket-news-cricket-ipl-2023-auction-date-has-bcci-finalized-ipl-auction-2023-date/","keywords":["Cricket","Indian Premier League","IPL","IPL 2023","IPL 2023 auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Cricket IPL 2023 auction date: A mini auction is likely to take place ahead of the sixteenth edition of the Indian Premier League. After the successful conduction of what might have been the last mega auction which took place in February 2022 ahead of the 15th season of the Indian Premier League (IPL), the Board… The post Cricket IPL 2023 auction date: Has BCCI finalized IPL auction 2023 date? appeared first on The SportsRush.","content":"After the successful conduction of what might have been the last mega auction which took place in February 2022 ahead of the 15th season of the Indian Premier League (IPL), the Board of Control for Cricket in India (BCCI) have possibly started with their preparations for the 16th edition of the lucrative league, which will take place next year. As per IPL 2023 or IPL season 16, will take place from the fourth week of March next year, although confirmed dates for the same have not been confirmed as yet by the BCCI. : However, what has been confirmed by the current BCCI president Sourav Ganguly is that IPL 2023 will certainly be back with its usual home-away format, as was the case till IPL 2019, when the term ‘COVID-19’ was not even heard of. “The next season of men’s IPL will also go back to the home and away format with all 10 teams playing their home matches at their designated venues,” remarked Ganguly. As per the mini-auction for IPL 2023 will take place in mid-December this year, with being decided as the tentative date for the same. As per the report, all the 10 franchises owners have been informally communicated and discussed with by the BCCI pertaining this development. Also, the window for the trade of players between franchises will also open a week before the mini auction date, and will reopen post the auction. Furthermore, the 10 franchises will begin the auction process with a purse limit of INR 95 Crore, as against INR 90 Crore during the previous mini auctions. There are also a few unverified reports of franchises likely to trade a player or two with the other franchises. In that case, the purse limit may further increase.","pubDate":"2022-10-08 18:18:42","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"AUS vs ENG 1st T20I Dream11 prediction: Fantasy cricket tips for Australia vs England 1st T20I in Perth","link":"https://www.dnaindia.com/cricket/report-aus-vs-eng-1st-t20i-dream11-prediction-fantasy-cricket-tips-for-australia-vs-england-1st-t20i-in-perth-2991300","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Know all about the fantasy picks and match details of the upcoming 1st T20I between Australia-England which will be played in Perth Stadium, Perth.","content":null,"pubDate":"2022-10-08 17:43:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ vs BAN Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NZ vs BAN 3rd T20 match in Hagley Oval, 11:30 AM IST, October 9","link":"https://zeenews.india.com/cricket/nz-vs-ban-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nz-vs-ban-3rd-t20-match-in-hagley-oval-1130-am-ist-october-9-2519538.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Bangladesh Dream11 Team Prediction New Zealand vs Bangladesh 3rd T20 Match Preview - Check My Dream11 Team, Best players list of NZ vs BAN, New Zealand Dream11 Team Player List, Bangladesh Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Kane Williamson-led New Zealand will take on Nurul Hasan's Bangladesh in the 3rd T20I of the tri-nation series that on October 9 (Sunday) at Hagley Oval in Christchurch. Both teams started off their campaign in the tournament with losses to Pakistan. Bangladesh lost the first T20I on Friday while hosts lost to Babar Azam's side by 6 wickets on Saturday. Williamson was critical of his side's poor show, saying that they were not good enough on the day. \"Hopefully a few learnings going into tomorrow night. The guys are feeling good, we know there will be a tough match tomorrow, a bit of homework to do, but looking forward to it,\" said Williamson. Match Details New Zealand vs Bangladesh 3rd T20 match New Zealand captain Kane Williamson has said he expects a tough game against Pakistan and Bangladesh as the three squads are set to lock horns in the tri-nation series later this week. England in the seventh Twenty20 in Lahore, Men in Green departed to New Zealand. #PakvsNz pic.twitter.com/pkGBDprWyo — Startup Pakistan (@PakStartup) October 4, 2022 Venue : Hagley Oval, Christchurch Live Streaming and TV details: Sony Sports Network and SonyLiv website and app NZ vs BAN 3rd T20 match Dream11 Prediction Wicketkeeper: Glenn Phillips, Liton Das Batters: Afif Hossain, Devon Conway, Kane Williamson All-rounders: James Neesham, Chapman, Hasan Miraz Bowlers: Tim Southee, Trent Boult, Nasum Ahmed Captain: Devon Conway Vice-captain: Liton Das New Zealand vs Bangladesh 3rd T20I Predicted 11 New Zealand: Kane Williamson(C), Finn Allen, Michael Bracewell, Devon Conway, Chapman, James Neesham, Glenn Phillips, Trent Boult, Sodhi, Tim Southee, Tickner Bangladesh: Sabbir Rahman, Yasir Ali, Afif Hossain, M Hossain, Mehidy Hasan Miraz, Liton Das, Nurul Hasan(C), Taskin Ahmed, Mustafizur Rahman, Ebadot Hossain, Hasan Mahmud","pubDate":"2022-10-08 17:42:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"MS Dhoni is missed in Team India, his experience is 'rare,' says Shardul Thakur","link":"https://www.thehansindia.com/sports/cricket/ms-dhoni-is-missed-in-team-india-his-experience-is-rare-says-shardul-thakur-764632","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Shardul Thakur played under MS Dhoni’s captaincy for India and CSKDhoni retired from international cricket in August 2020Thakur is currently playing in India’s home series against South Africa","content":"Shardul Thakur India all-rounder Shardul Thakur has said MS Dhoni is missed a lot in the Indian team before adding the former captain's experience is \"rare\" in the world of cricket. Dhoni, who played international cricket for 15 years, represented India in 350 ODIs, 90 Tests, and 98 T20Is. He captained India to the glory in the inaugural edition of T20 World Cup in 2007 and 50-over World Cup in 2011. He retired from international cricket two years ago but is still competing in the Indian Premier League (IPL). Thakur, who is currently playing in India's home series against South Africa, reckoned that Dhoni's experience \"matters a lot\" for Team India. \"Everybody misses him because his experience matters a lot. He has played more than 300 ODIs, close to 90 Tests and he played a lot of T20Is as well. So this much-experienced player, it is rare that you come across such an experienced player. We miss him definitely,\" Shardul was quoted as saying in a press conference on Saturday. Thakur also played under Dhoni's captaincy for Chennai Super Kings (CSK) in the IPL. Thakur's comments came on the eve of the second ODI between India and South Africa in Ranchi. India recently defeated the Proteas 2-1 in the T20I series but lost the opening ODI in Lucknow by nine runs. In the white-ball games so far, the bowlers have had quite a difficult time. When reporters on Saturday asked Thakur about the bowlers' consistency, the player said that even the visiting bowlers are being taken for runs due to the conditions that are more inclined to the batters. \"The bowlers who are coming to play here are also being hit for runs. If you look at the T20I series against South Africa and you criticise our bowlers, then you should criticise their bowlers as well, because we won the series. Their bowlers were scored off as well. When you ask about someone's consistency, one should see the pitch conditions,\" Thakur added further. In the first ODI on Thursday, Thakur was the most economical bowler among the Indians, finishing with figures of 2 for 35 at an economy of 4.40. He even batted well toward the end of India's chase. He scored 33 off 31 balls, including five boundaries, before falling to his former Chennai Super Kings (CSK) teammate Lungi Ngidi. The second and penultimate match of the three-game ODI series is going to be played on Sunday (Oct. 9) at JCSA Stadium in Ranchi.","pubDate":"2022-10-08 17:36:22","image_url":"https://assets.thehansindia.com/h-upload/2022/10/08/500x300_1315477-t.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi Highlights: Haryana 41 - Bengal 33; Thalaivas draw 31 - 31 with Giants; Paltan tie 34 - 34 with Pirates","link":"https://www.firstpost.com/sports/pro-kabaddi-2022-live-score-puneri-paltan-face-patna-pirates-to-kick-off-the-day-11411981.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi Highlights: Haryana 41 - Bengal 33; Thalaivas draw 31 - 31 with Giants; Paltan tie 34 - 34 with Pirates","content":"23:11 (IST)Pro Kabaddi League Live Updates:That's all from today's coverage of the Pro Kabaddi League folks! Stay tuned to Firstpost.com for more updates and do join in tomorrow for another exciting day that will witness three exciting and exhilarating games! Till then, switch in to the interview of today's star from Haryana Steelers Manjeet Dahiya - I want Kabaddi to grow as much as the Indian Premier League23:06 (IST)Pro Kabaddi League Live Updates:Another action-packed day at the Pro Kabaddi League has come to an end. A day that was tie-heavy as the first two matches ended in a tie. Haryana Steelers ensured in the last match that the day doesn't end in an all-tie. Pawan Sehrawat's injury will be a key moment of the day as his return will be doubtful for quite a while.Scores for the day:Match 1: Puneri Paltan tied 34 - 34 with Patna Pirates Match 2: Tamil Thalaivas tied 31 - 31 with Gujarat GiantsMatch 3: Haryana Steelers beat 41 - 33 Bengal Warriors23:03 (IST)Pro Kabaddi League Live Updates:Stats from the last match of the day:Total Points: Haryana Steelers 41 - 33 Bengal WarriorsRaid points: Haryana Steelers 27 - 19 Bengal WarriorsTackle points: Haryana Steelers 10 - 7 Bengal WarriorsAll-out points: Haryana Steelers 2 - 2 Bengal WarriorsExtra points: Haryana Steelers 2 - 5 Bengal Warriors22:55 (IST)Pro Kabaddi League Live Updates:Bengal Warrirors have earned two points with their last raid and that will help them to reduce the deficit of the loss.A brilliant win for Haryana Steelers with a mammoth eight-point lead.  Full time: Haryana Steelers 41 - 33 Bengal Warriors  22:53 (IST)Pro Kabaddi League Live Updates:This night belongs to Manjeet Dahiya. Another super raid for the Steelers' raider. He has earned 18 points tonight. His team stand at 41 at the moment.  Haryana Steelers 41 - 31 Bengal Warriors 22:45 (IST)Pro Kabaddi League Live Updates:Manjeet Singh with a super raid there! He has dismissed three Bengal Warriors players and Haryana Steelers moments away from clinching a big big win on Day 2. Haryana Steelers 37 - 26 Bengal Warriors  22:40 (IST)Pro Kabaddi League Live Updates:Five minutes left, and the players have taken a strategic time-out.Haryana cruising to a win in their opening match of the season. Haryana Steelers 33 - 24 Bengal Warriors 22:37 (IST)Pro Kabaddi League Live Updates:Manjeet Dahiya has a super 10! Excellent stuff by the raider! To add to the misery of Bengal Warriors, they have been all-out! Haryana ruling all over Bengal now. Six minutes left in the match.Haryana Steelers 31 - 24 Bengal Warriors  22:32 (IST)Pro Kabaddi League Live Updates:The two teams were going neck-to-neck, but Manjeet has earned two points with an excellent raid! Maninder Singh has also been tackled well in the subsequent raid. Bengal Warriors on the back foot now, as the Steelers lead by four points. The players are into a strategic time-out as less than 10 minutes are left in the game.Haryana Steelers 26 - 22 Bengal Warriors 22:27 (IST)Pro Kabaddi League Live Updates:Haryana Steelers have been all-out! Three crucial points for Bengal Warriors there as they close in on the Steeler's lead.Still quite some time left in this match - almost 14 minutes.Haryana Steelers 20 - 19 Bengal Warriors  22:25 (IST)Pro Kabaddi League Live Updates:A very interesting effort by Steeler's Nitin Rawal, but that has cost a review to them. No more reviews left for Harayana Steelers now. 22:22 (IST)Pro Kabaddi League Live Updates:Haryana doing some brilliant stuff there. Maninder Singh is out. A super tackle by Nitin Rawal. Maninder tried his heart out to reach the centre line, but in vain. Haryana have a big lead now.Haryana Steelers 19 - 14 Bengal Warriors 22:19 (IST)Pro Kabaddi League Live Updates:A tackle lapse for Bengal warriors to start the second half and Nitin Rawal has earned some brilliant points here. Three points from that first raid and the Steelers back into the lead!Haryana Steelers 15 - 13 Bengal Warriors  22:12 (IST)Pro Kabaddi League Live Updates:Bengal Warriors have inched ahead by one point at the stroke of half-time. Captain Maninder makes two successful raids at the end of the half and that will shift the momentum on their side.Haryana Steelers 12 - 13 Bengal Warriors 22:08 (IST)Pro Kabaddi League Live Score:Bengal Warriors are closing in on the lead with some crucial points as the first half reaches its business end.Haryana Steelers 11 - 10 Bengal Warriors  22:05 (IST)Pro Kabaddi League Live Score:Girish Maruti has scored a high-five in just 12 minutes! All five tackle points for the Warriors have been scored by Girish Maruti so far! Excellent performance by the defender, but the team is struggling for a collective effort. Haryana Steelers 11 - 7 Bengal Warriors 22:02 (IST)Pro Kabaddi League Live Score:Haryana Steelers have maintained the lead. The tall Manjeet Dahiya has earned a beautiful raid point for his side.Haryana Steelers 10 - 6 Bengal Warriors  21:56 (IST)Pro Kabaddi League Live Score:The match has started with some fierce moments as both the teams have scored more with tackle points! Some brilliant tackles by both the sides and Haryana have sneaked a two-point lead after five minutes.Haryana Steelers 5 - 3 Bengal Warriors 21:51 (IST)Pro Kabaddi League Live Score:The final match of the day is on its way!Haryana Steelers have won the toss and Bengal Warriors have been asked to raid first.21:50 (IST)Pro Kabaddi League Live Score:Here are some stats from game two - Total points: Tamil Thalaivas 31 - 31 Gujarat GiantsRaid points: Tamil Thalaivas 19 - 23 Gujarat GiantsTackle points: Tamil Thalaivas 8 - 6 Gujarat Giants All-out points: Tamil Thalaivas 2 - 2 Gujarat Giants  Extra points: Tamil Thalaivas 2 - 0 Gujarat Giants21:45 (IST)Pro Kabaddi League Live Score:Another match of the evening, another tie! How many ties are we going to see today?Thalaivas had a lead for maximum time in the match, but Gujarat came back brilliantly towards the fag end to level the scores. They had a chance to all-out Telugu in the last raid of the evening, but Himanshu was smart enough to not let that happen. And the two sides will split the points!Tamil Thalaivas 31 - 31 Gujarat Giants 21:40 (IST)Pro Kabaddi League Live Score:Rakesh has gained two raid points for Gujarat Giants and the scores are levelled with just one minute left in the match!Tamil Thalaivas 30 - 30 Gujarat Giants 21:37 (IST)Pro Kabaddi League Live Score:Back-to-back points for Gujarat Giants, and they have reduced the Thalaivas' lead to two points. Less than 3 minutes left now.Tamil Thalaivas 29 - 27 Gujarat Giants 21:32 (IST)Pro Kabaddi League Live Score:All right, five minutes left in the game. Can Giants make a comeback? Will we see a turnaround or Tamil Thalaivas will take the game away with their lead?The players have gone into a strategic time-out. Thalaivas lead by 4 points.Tamil Thalaivas 28 - 25 Gujarat Giants 21:28 (IST)Pro Kabaddi League Live Score:Some lazy raids after the strategic time-out as both the teams have an empty raid. Less than 9 minutes left in the match and Tamil Thalaivas are still in the lead. 21:20 (IST)Pro Kabaddi League Live Score:Tamil Thalaivas have asked for a review and the umpires have taken a long time. But the review has been successful for Thalaivas. The Chennai side is still with a three point lead. Tamil Thalaivas 24 - 21 Gujarat Giants 21:13 (IST)Pro Kabaddi League Live Score:Tamil Thalaivas have all-out the Giants as the latter started with just two players on the mat. Now, Thalaivas have taken the lead and they are looking very strong even in the absence of captain Pawan Sehrawat.Tamil Thalaivas 21 - 18 Gujarat Giants 21:11 (IST)Pro Kabaddi League Live Score, Pawan Sehrawat injured:It has been confirmed that Pawan Sehrawat will not make a comeback to the match for today. The medical staff is looking after him currently. But, the fans will have to wait more to see him again on the mat. And we are on with the second half.21:04 (IST)Pro Kabaddi League Live Score:That's the end of first half. Some good stuff by Thalaivas towards the end of the half, but Gujarat lead the match.Tamil Thalaivas 16 - 18 Gujarat GiantsWill Pawan Sehrawat return in the second half or not?21:01 (IST)Pro Kabaddi League Live Score:Three minutes left in the first half and Gujarat have had the upper hand. The injury to Pawan Sehrawat has only worked in their favour as Thalaivas have not been able to stand up to the mark against Giants.Tamil Thalaivas 12 - 16 Gujarat Giants  20:55 (IST)Pro Kabaddi League Live Score, Pawan Sehrawat injured:Pawan Sehrawat has been severly injured. He has left the mat for the moment. Giants' Chandran Ranjit's shoe hit the Thalaivas star while he was trying to get back to the centre line and that has resulted in what seems something serious. Pawan Sehrawat was taken out on strecher. Doesn't seem to be coming back before the second half.  20:52 (IST)Pro Kabaddi League Live Score:Gujarat Giants have made a very good comeback here. Just at the half-way 10-minute mark in the first-half, Giants have taken a four-point lead as Thalaivas have been all-out.Tamil Thalaivas 7 - 11 Gujarat Giants 20:46 (IST)Pro Kabaddi League Live Score, 2nd match:A very good start for Tamil Thalaivas in the first five minutes. Tamil Thalaivas 4 - 2 Gujarat Giants20:42 (IST)Pro Kabaddi League Live Score, 2nd match:The second match between Tamil Thalaivas and Gujarat Giants is about to start.The most expensive player of the league, Pawan Sehrawat will be seen in yellow for the first time! And Thalaivas have won the toss and selected the court. Gujarat will raid first.20:39 (IST)Pro Kabaddi League Live Score, stats from 1st match:Total Points: Patna Pirates 34 - 34 Puneri PaltanRaid points: Patna Pirates 18 - 22 Puneri PaltanTackle points: Patna Pirates 10 - 9 Puneri PaltanAll-out points: Patna Pirates 4 - 2 Puneri PaltanExtra points: Patna Pirates 2 - 1 Puneri Paltan 20:33 (IST)Pro Kabaddi League Live Score:Its a tie! Puneri Paltan's Aditya Shinde lets the raid go empty. He was sure that he didn't want to give away a point with just 25 seconds left and that was some smart move by Paltan at the end.Its full time and the scores are Patna Pirates 34 - 34 Puneri Paltan. 20:29 (IST)Pro Kabaddi League Live Score:A proper edge of the seat, nail-biting match as Paltan earn two points with a super tackle. Sachin was in for a do-or-die raid, but Paltan's Badal Singh does the trick for his side and they have earned two points. Less than a minute left now. 20:26 (IST)Pro Kabaddi League Live Score:Scores have levelled with 3 minutes to play on the mat.Patna Pirates 32 - 32 Puneri Paltan.Sachin has done the job in a do-or-die raid for Patna. 20:23 (IST)Pro Kabaddi League Live Score:Less than five minutes left and the scores are almost level. Patna Pirates 31 - 32 Puneri Paltan.Paltan have closed in the Pirates' lead but have not been able to take a lead yet. Puneri Paltan gaining lead in that last raid before the time-out. Aslam Imandar doing the job for them.20:14 (IST)Pro Kabaddi League Live Score:Okay, half of the second half is done. The teams are into a strategic time-out. And Patna Pirates have brought a magical turnaround in the scoreline. From a seven-point deficit, they have now gained a three-point lead.Patna Pirates 29 - 26 Puneri Paltan. 20:11 (IST)Pro Kabaddi League Live Score All-out:Puneri Paltan have been all-out. And Patna Pirates have now gained the lead with that brilliant 7 minutes in the second half. The tables have turned once again.Patna Pirates 26 - 24 Puneri Paltan.20:08 (IST)Pro Kabaddi League Live Score:A do-or-die raid for Patna Pirates. And Sachin has ensured to grarb a point for his side! Patna Pirates closing in on the Paltan's lead. Puneri Paltan 23 - 21 Patna Pirates.20:04 (IST)Pro Kabaddi League Live Score:Here we go for the second half of the first match. A calm start for both teams. No points in the first raid from both sides.19:59 (IST)Pro Kabaddi League Live Score:End of first-half. Puneri Paltan end the half with one more raid point! They now lead by 7 points.Puneri Paltan 23 - 16 Patna Pirates. A healthy lead for Paltan and Patna are going to find it very difficult to make a comeback in the second half. A seven-point deficit will not be easy to overcome.19:55 (IST)Pro Kabaddi League Live Updates:Puneri Paltan have Patna Pirates all-out with three and a half minutes left in the first half. Brilliant stuff by Paltan and now they have a four-point lead! Puneri Paltan 20 - 16 Patna Pirates. 19:53 (IST)Pro Kabaddi League Live Updates:Puneri Paltan have regained the lead after conceding the lead to Patna for a while. Some brilliant tackle points as well as raid points. But the Pirates are not allowing Paltan to just go away with the lead.  19:48 (IST)Pro Kabaddi League Live Scores:Some exciting action in the first 10 minutes of the first half of the match. Both the teams are neck to neck with Patna Pirates 8 and Puneri Paltan 9 points.19:32 (IST)Pro Kabaddi League Live Updates:Puneri Paltan have won the toss and will raid first! 19:15 (IST)Pro Kabaddi League Live Updates:Hello and Welcome to Day 2 of the Pro Kabaddi League! After an exhilarating first day of the league, day 2 promises something similar with three more matches scheduled over the course of 3 hours! Here is the lineup for today's games: 1. Patna Pirates vs Puneri Paltan2. Gujarat Titans vs Tamil thalaivas3. Bengal Warriors vs Haryana SteelersJust 15 minutes to the start! Stay tuned to Firstpost.com and don't miss out on the action!Pro Kabaddi League Day 2 Preview: Day 2 of Pro Kabaddi League season 9 promises to be another exciting day after some brilliant action on day 1.Day 1 saw a winning start for Dabang Delhi, Bengaluru Bulls, and U.P. Yoddhas.All three matches today will be played at Shree Kanteerava Stadium in Bangalore. And all the teams will have played at least one game at the end of day.Three-time champions Patna Pirates will start the day against Puneri Paltan in the opener, followed by Gujarat Giants vs Tamil Thalaivas and Bengal Warriors vs Haryana Steelers.Pirates have a solid upper hand over their opponents Puneri Paltan as they have won 13 out of 17 games Head-to-head.Gujarat, similarly, have a better head-to-head record against Thalaivas off 4-2.Bengal Warriors won season 7 of the tournament but didn’t have a good outing in season 8. They will want to replicate their performance from season 7 and they can start it best with an improvement in their 1-5 head-to-head record against Haryana Steelers in the show stopper of the day.Manjeet Dahiya and Jaideep Dahiya have said that Haryana Steelers have had brilliant practice sessions in preparations for the new season and it will be worthwhile to see if they can show that on the mat tonight.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-08 17:28:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Pro-Kabaddi-League-Live-scores.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“If Australia and England Can….Why Not The Indian Team”- Shardul Thakur On Having A Long Batting Line Up","link":"https://www.thetimesofbengal.com/sports/if-australia-and-england-can-why-not-the-indian-team-shardul-thakur-on-having-a-long-batting-line-up/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Indian Cricket Team has applied a fearless approach since the debacle of the ICC T20 World Cup 2021. So far, the team has been unable to play aggressive cricket. But they are somewhat lacking behind at the back end of the innings. India needs to work on it as that is hurting them. India is […]","content":"Indian Cricket Team has applied a fearless approach since the debacle of the ICC T20 World Cup 2021. So far, the team has been unable to play aggressive cricket. But they are somewhat lacking behind at the back end of the innings. India needs to work on it as that is hurting them. India is all set to play in Australian Conditions where smashing sixes won’t be an easy job at all. The batters will have to be careful & selective in their approach and target shorter boundaries. India would be missing the services of Ravindra Jadeja who got injured during the Asia Cup 2022; as he is someone who doesn’t fear anyone. Ravindra Jadeja PC- Twitter Shardul Thakur On Batting Deep Shardul Thakur was seen in a media interaction of the second ODI and made a point on the batting lineup. “If you see the teams who have done very well on the international platform, their batting lineup has been quite deep.” said Shardul. Shardul Thakur. Image Credits: Twitter “ For that matter Australia, if you see Pat Cummins, Mitchell Starc, they bat at number eight and nine. Even for that matter England. Even their batting lineup is deep. Why not the Indian team? Even we can have our batting lineup deep and make that difference in the game. The difference of 15-20 runs which can be crucial in winning the match, especially in white ball format.” he added. Crucial Tournament for India Indian Cricket Team would be aware of the 2021 drubbing where billion people criticized the team. This T20 World Cup is a chance to make a statement that they are not a finished product. India has got all the players who can succeed in Australia, the only thing Rahul Dravid & Rohit Sharma would be worried that the team won’t take any sort of pressure. Rahul Dravid and Rohit Sharma. Image: Twitter India has done all the hard work by beating England, West Indies, Australia & South Africa and now the unit looks like a powerful one. The team has found match-winners on the given day which means that the team is no longer dependent on Virat & Rohit which is a great sign. Also Read: ICC T20 World Cup 2022: “It’s a Big Setback, Every Players Dreams To Play in WC”- Shardul Thakur On Not Getting Selected For ICC T20 World Cup","pubDate":"2022-10-08 16:58:24","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Shardul Thakur On Not Getting Selected For ICC T20 World Cup","link":"https://www.thetimesofbengal.com/sports/shardul-thakur-on-not-getting-selected-for-icc-t20-world-cup/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Indian Cricket Team is going through a tough phase. Jasprit Bumrah & Deepak Chahar’s injury has disturbed the team a bit. Deepak has shown that he has good control over his line and length. Although, there is no official update yet on whether the pacer is out of the marquee event or not. Shardul Thakur […]","content":"Indian Cricket Team is going through a tough phase. Jasprit Bumrah & Deepak Chahar’s injury has disturbed the team a bit. Deepak has shown that he has good control over his line and length. Although, there is no official update yet on whether the pacer is out of the marquee event or not. Shardul Thakur would consider himself unlucky. The right-arm pacer has got all the traits in him to be amongst the team. The bowler needs to work a bit more on his batting and try to make a way into the team as a batting all-rounder just like Hardik Pandya. Shardul Thakur[Image-BCCI] Shardul Thakur on ICC T20 World Cup 2022 Shardul Thakur was seen having a media interaction and was asked about his non-selection for the marquee tournament. “ It’s okay I’m not selected this time. But there’s still a lot of cricket left and also there’s the ODI World Cup next year. My focus will be to do well in whatever matches I play and make winning contributions. ” said Thakur. India National Cricket Team (Image Credits: AP) Conundrum for Management The Selection Panel & Management will need to have some long conversations as there’s only one week left before making any changes to the squad. Shami is trying hard to be fit but it looks unlikely that the pacer would be given a nod as he doesn’t have any T20I match practice. Rahul Dravid and Rohit Sharma. Image: Twitter Siraj can be the choice as Head Coach Rahul Dravid has worked closely with him during his India A Coaching Days. The right-arm pacer has got express pace and is very disciplined in his line & length. Avesh Khan may be the fast bowler for a tournament but he doesn’t have that much control over his line & length. In all this chaos, Skipper Rohit Sharma & Head Coach Rahul Dravid need to be smart as the role of 3rd seamer would be critical in T20 World Cup 2022. Also Read: IND vs SA: “Mood In Team Fantastic Despite Injuries, It Is Part And Parcel Of Game”: India Pacer Shardul Thakur","pubDate":"2022-10-08 16:26:15","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"JSCA Stadium Ranchi ODI records: JSCA International Stadium Complex ODI records and highest innings total","link":"https://thesportsrush.com/cricket-news-jsca-stadium-ranchi-odi-records-jsca-international-stadium-complex-odi-records-and-highest-innings-total/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"JSCA Stadium Ranchi ODI records: The penultimate match of South Africa’s second tour of India 2022 will be played tomorrow. Cricket fans across the globe will have a field day tomorrow on the back of three international white-ball matches slated to begin within a couple of hours. India vs South Africa ODI will be the… The post JSCA Stadium Ranchi ODI records: JSCA International Stadium Complex ODI records and highest innings total appeared first on The SportsRush.","content":"JSCA Stadium Ranchi ODI records: The penultimate match of South Africa’s second tour of India 2022 will be played tomorrow. Cricket fans across the globe will have a field day tomorrow on the back of three international white-ball matches slated to begin within a couple of hours. India vs South Africa ODI will be the third match following New Zealand vs Bangladesh T20I and Australia vs England T20I. Second of a three-match ODI series, the match will bring back international cricket to the JSCA International Stadium Complex after 11 months. As far as this particular format is concerned, Ranchi will be hosting an ODI after more than three and a half years. While India have both won and lost a couple of ODIs at this venue, South Africa will be playing their first-ever ODI at this venue on Sunday. Part in a Ranchi Test three years ago, the Proteas had ended up on the losing side in their only match at this stadium. Having named all-rounder Washington Sundar as a replacement for pacer Deepak Chahar for the remaining two ODIs, it will be interesting to see if he gets a straightforward entry into the Playing XI or not. If the same happens, Sundar will be representing India after eight months. South Africa, on the other hand, are unlikely to tinker with a winning combination. JSCA Stadium Ranchi ODI records Only cricketer to have played the first five Ranchi ODIs, former India captain Virat Kohli is the highest run-scorer here with his 384 runs coming at an average of 192 including two centuries and a half-century. Catch up with #Proteas spinner Keshav Maharaj as we talk all things cricket and more Full video https://t.co/JRJ48983rV#BePartOfIt pic.twitter.com/IL9UxXMHdN — Proteas Men (@ProteasMenCSA) October 8, 2022 Kohli is followed by Angelo Mathews (139), Glenn Maxwell (139), Usman Khawaja (104) and George Bailey (98) in the highest scorers’ list at this venue. As far as players of the current Indian squad are concerned, only Shikhar Dhawan (15) and Kuldeep Yadav (10) have played a Ranchi ODI in the past. Highest ODI wicket-takers at the JSCA International Stadium Complex are Ravichandran Ashwin (6), Mohammed Shami (5), Ajantha Mendis (4), Dhawal Kulkarni (4) and Ravindra Jadeja (4). Only Kuldeep Yadav (3) has played an ODI here among players taking part in this series. Highest innings total in Ranchi ODIs Score Overs Team Opposition Year 313/5 50 Australia India 2019 295/8 50 Australia India 2013 288/7 48.4 India Sri Lanka 2014 286/8 50 Sri Lanka India 2014 281 48.2 India Australia 2019 While the first two Ranchi ODIs had been won by teams batting second, the last two were won by teams batting first. The aforementioned third-highest innings total is also the highest successful ODI run-chase at this venue. That match is fondly remembered for Kohli’s 21st ODI century (fourth as captain). The post JSCA Stadium Ranchi ODI records: JSCA International Stadium Complex ODI records and highest innings total appeared first on The SportsRush.","pubDate":"2022-10-08 16:13:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ranchi weather tomorrow: Weather in Ranchi tomorrow for IND vs SA 2nd ODI","link":"https://thesportsrush.com/cricket-news-ranchi-weather-tomorrow-weather-in-ranchi-tomorrow-for-ind-vs-sa-2nd-odi/","keywords":["Cricket","JSCA International Stadium","ranchi","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ranchi weather tomorrow: The JSCA Stadium in Ranchi will host the second ODI between India and South Africa tomorrow. Despite a valiant effort from wicket-keeper batter Sanju Samson (86* off 63), a longer tail meant that India had to end up on the losing side during the first ODI against South Africa, in Lucknow. In… The post Ranchi weather tomorrow: Weather in Ranchi tomorrow for IND vs SA 2nd ODI appeared first on The SportsRush.","content":"Ranchi weather tomorrow: The JSCA Stadium in Ranchi will host the second ODI between India and South Africa tomorrow. Despite a valiant effort from wicket-keeper batter Sanju Samson (86* off 63), a longer tail meant that India had to end up on the losing side during the first ODI against South Africa, in Lucknow. In a bid to end the four-match losing-streak against the Proteas in the format and level the three-match series, the Shikhar Dhawan-led side will take them on in the second ODI tomorrow, at the JSCA International Stadium, in Ranchi. The Indian bowling attack overall were unimpressive during the Lucknow ODI, with David Miller yet again, alongside Heinrich Klassen this time around, acting as their nemesis akin the T20I series. The batting department too, seemed to struggle against the quality Proteas pace attack upfront with the new ball, which was one of the major reasons for the Indian defeat on Thursday. ALSO READ: JSCA Stadium Ranchi pitch report for 2nd ODI As for South Africa, skipper Temba Bavuma’s form continues to be a cause of worry, while left-arm spinner Tabraiz Shamsi will look to put behind his poor returns against India across formats in the final two ODIs. Ranchi weather tomorrow The relieving news for the fans is that the city of Ranchi has not experienced any rainfall for the past two days, after witnessing continuous spells of the same in the week preceding that. Having said that, patches of dark clouds did cover the sky for majority of Saturday, despite the sun making an appearance throughout the afternoon. Come Sunday, the sun will yet again make an appearance, but the dark, rain-filled clouds might lead to a downpour for a brief period during the day, which might well bring the match proceedings to a halt, especially during the first innings. As per Accuweather, rain is predicted to arrive at around 11 am (51% chance), and then around 02:00 pm (51% chance), but might not turn out to be relentless, to lead to a reduction in the number of Overs, as was the case in Lucknow. JSCA International Cricket Stadium hourly weather tomorrow (Sunday) 01:00 PM – 29 degree (Rain Probability – 47%). 02:00 PM – 27 degree (Rain Probability – 51%). 03:00 PM – 30 degree (Rain Probability – 47%). 04:00 PM – 29 degree (Rain Probability – 34%). 05:00 PM – 27 degree (Rain Probability – 34%) 06:00 PM – 26 degree (Rain Probability – 29%). 07:00 PM – 25 degree (Rain Probability – 20%). 08:00 PM – 24 degree (Rain Probability – 20%). 09:00 PM – 24 degree (Rain Probability – 20%). The post Ranchi weather tomorrow: Weather in Ranchi tomorrow for IND vs SA 2nd ODI appeared first on The SportsRush.","pubDate":"2022-10-08 16:09:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA: “Mood In Team Fantastic Despite Injuries, It Is Part And Parcel Of Game”: India Pacer Shardul Thakur","link":"https://www.thetimesofbengal.com/sports/ind-vs-sa-mood-in-team-fantastic-despite-injuries-it-is-part-and-parcel-of-game-india-pacer-shardul-thakur/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Indian Cricket Team has been going through a lot of injuries. The recent injury of Deepak Chahar has meant that he is sidelined for the remaining 2 ODIs. India is blessed to have a huge pool of players due to which there’s no need to panic. Billion people would be hoping that Team India avoids […]","content":"Indian Cricket Team has been going through a lot of injuries. The recent injury of Deepak Chahar has meant that he is sidelined for the remaining 2 ODIs. India is blessed to have a huge pool of players due to which there’s no need to panic. Billion people would be hoping that Team India avoids series defeat in the 2nd T20I match. South Africa on the other hand would be somewhat happy as Deepak Chahar was troubling them a lot with the new ball. The Proteas would be well aware of the fact that they can’t get complacent as losing 2 back to back matches won’t take any time in a short 3 match ODI Series. India National Cricket Team Image Credits: BCCI Shardul Thakur on Team India Shardul Thakur was seen attending the pre-match press conference and was asked about how is the environment in the team after Deepak Chahar’s injury. “Mood in team fantastic despite injuries, it is part and parcel of the game. We have been playing together for quite few years. We are comfortable with each other. Injuries are part and parcel of the game. Someone is going to get hurt and some time. We do not need to take it to heart. There is a lot of cricket to come.” said Thakur. India National Cricket Team (Image Credits: AP) Great Opportunity for Shikhar Dhawan The left-handed batter won’t get a better opportunity to make a case for himself for ICC Cricket World Cup 2023. He has a good record against South Africa and most importantly he knows how to play the waiting game. Irrespective of the pitch, the batter can be lethal. Shikhar Dhawan. (Photo: BCCI) South Africa on the other hand should be ready for a counter-punch for Men in Blue. There are chances that they may apply an ultra-aggressive approach to score quickly in the power-play overs. It would be quite fascinating to see the contest between Indian batters and South African bowlers; in the 1st ODI South Africa was quite discipline in their approach. Also Read: IND vs SA: “Won’t Call Shikhar Dhawan-Led Indian ODI Side Second String”- Keshav Maharaj !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 15:54:00","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"India Vs South Africa 2nd ODI - Ranchi Weather Forecast And Pitch Report - ICC CRICKET SCHEDULE","link":"https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vd3d3LmljY2NyaWNrZXRzY2hlZHVsZS5jb20vaW5kaWEtdnMtc291dGgtYWZyaWNhLTJuZC1vZGktcmFuY2hpLXdlYXRoZXItZm9yZWNhc3QtYW5kLXBpdGNoLXJlcG9ydC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Vs South Africa 2nd ODI - Ranchi Weather Forecast And Pitch Report  ICC CRICKET SCHEDULEMatch Preview - India vs South Africa, South Africa in India 2022/23, 2nd ODI  ESPNcricinfoIndia v South Africa | 1st ODI | Review  Royal Challengers BangaloreIndia vs South Africa, 2nd ODI: India Eye All-Round Improvement In A Must Win Game vs South Africa  NDTV Sports'Ganguly, Gambhir, who next? He is absolutely phenomenal': Bangar on India star  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-10-08 14:57:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Graham Hume Replaces Craig Young In Ireland’s T20 World Cup Squad","link":"https://www.thetimesofbengal.com/sports/graham-hume-replaces-craig-young-in-irelands-t20-world-cup-squad/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Ireland Cricket Team has dealt with a huge blow with the injury of Craig Young. The right-arm pacer has been a vital cog for the Irish. Ireland has named his replacement in the form of Graham Hume. He made his international debut in July 2022 against New Zealand and then he was handed the cap […]","content":"Ireland Cricket Team has dealt with a huge blow with the injury of Craig Young. The right-arm pacer has been a vital cog for the Irish. Ireland has named his replacement in the form of Graham Hume. He made his international debut in July 2022 against New Zealand and then he was handed the cap of T20I against Afghanistan in the next month. Ireland would be hoping that the pacer gets quickly acclimatized to Australian Conditions; as the warm-up fixtures are scheduled on the 11th & 13th of October. The pacer might prove a surprise package for opponents as studying a new pacer on short notice is a bit tough. Graham Hume. Pic Credits: Twitter. Cricket Ireland on Craig Young Mark Rausa, Head of Physiotherapy and Medical Services at Cricket Ireland made a statement on Craig Young: “Unfortunately, whilst out in Sydney for our T20 World Cup prep camp, Craig experienced a recurrence of a chronic issue which we have been managing for quite some time. Whilst we thought we were on top of the issue, it sadly flared up once we arrived in Sydney and began training. Craig will now return home for an assessment with our medical specialists to plan out his rehab,” said Mark Rausa. Craig Young Photo Credit: (Twitter) Tough Road Ahead for Ireland Ireland Cricket Team is placed in a dangerous group that consists of the West Indies, Zimbabwe & Scotland. All these 3 teams won’t give an inch and would make life harder for Ireland. In the last year’s T20 World Cup, Ireland was knocked out in the qualifying stage. Ireland team. (Photo Getty Images) Ireland has got players which can win them matches, but they are not performing according to their credentials. The role of Stirling & Balbirnie would be extremely critical as these two batters know how to play long & significant innings. It would be interesting to see how the team performs in tough conditions. Their biggest competitor would be West Indies and if they upset them, then it’s game on. Also Read: Babar Azam Equals Virat Kohli, Rohit Sharma’s Magnificent T20I Records With Scintillating Match-Winning 79 vs New Zealand !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 14:49:39","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA 2nd ODI Dream11 prediction: Fantasy cricket tips for India vs South Africa 2nd ODI in Ranchi","link":"https://www.dnaindia.com/cricket/report-ind-vs-sa-2nd-odi-dream11-prediction-fantasy-cricket-tips-for-india-vs-south-africa-2nd-odi-in-ranchi-2991251","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"India and South Africa will be squaring off against each other in the second game of the ODI series at Ranchi on Sunday. The first game between these two sides had a thriller finish, with the Proteas coming on top.","content":null,"pubDate":"2022-10-08 14:23:40","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview – South Africa Tour of India 2022, 2nd ODI","link":"https://www.thetimesofbengal.com/sports/match-preview-south-africa-tour-of-india-2022-2nd-odi-2/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"IND vs SA: Match Preview – South Africa Tour of India 2022, 2nd ODI. India and South Africa will square off in the 2nd ODI of the ongoing series. IND vs SA 2nd ODI is scheduled to take place on October 9 (Sunday) at JSCA International Stadium Complex in Ranchi. The South Africa tour of […]","content":"IND vs SA: Match Preview – South Africa Tour of India 2022, 2nd ODI. India and South Africa will square off in the 2nd ODI of the ongoing series. IND vs SA 2nd ODI is scheduled to take place on October 9 (Sunday) at JSCA International Stadium Complex in Ranchi. The South Africa tour of India 2022 will observe 3 ODI matches. The visitors South Africa leads the series 1-0 as they won the 1st ODI. Proteas defeated India by 9 runs in the 1st ODI. ICC Teams Rankings | ICC Players Rankings David Miller and Heinrich Klaasen. Pic Credits: Twitter Also Read: Watch: Impatient Ruturaj Gaikwad Gets Stumped By Quinton de Kock Off Tabraiz Shamsi’s Delivery In 1st ODI In the match, India won the toss and opted to bowl first. Batting first, South Africa piled up 249-4 on the scoreboard. Quinton de Kock smacked 48 runs for the team. Later, Heinrich Klaasen and David Miller shattered brilliant knocks of unbeaten 74 and 75 respectively. Sanju Samson. (Photo: Twitter) Also Read: IND vs SA: The Way Shreyas, Samson And Shardul Batted Was Excellent – Shikhar Dhawan After 9-run Loss To South Africa In 1st ODI Later, Shikhar Dhawan got out for 4 runs and Shubman Gill got out for 3 runs as India lost both the openers cheaply. Later, Shreyas Iyer (50) and Sanju Samson (86*) slammed brilliant fifties. Shardul Thakur also added crucial 33 runs. However, India finished with 240-8 on the board and lost the match by 9 runs. India VS South Africa (Image Credits: Twitter) Also Read: IND vs SA: Watch – Kuldeep Yadav Cleans Up Aiden Markram In The 1st ODI Against South Africa In head-to-head encounters in ODIs, India and South Africa have played 88 games. India has won 35 matches while South Africa has won 50 games. In the last 5 matches, South Africa has won 4 games. Both teams will play for the first time at JSCA International Stadium Complex in Ranchi. IND vs SA: Match Preview – South Africa Tour of India 2022, 2nd ODI India Shikhar Dhawan. (Photo: Twitter) Also Read: Watch: Shardul Thakur Knocks Over Struggling Temba Bavuma With A Jaffa In IND vs SA 1st ODI Shikhar Dhawan is the skipper of India in IND vs SA ODI series. In the 1st ODI, Sanju Samson slammed the most 86 runs for the team. Shreyas Iyer was next with 50 runs. In bowling, Sharduk Thakur picked the most 2 wickets in the match. Kuldeep Yadav and Ravi Bishnoi picked 1 wicket each. Only these three bowlers managed to get a wicket. Mohammed Siraj and Avesh Khan ended wicketless in the match. India vs South Africa (Image Credits: Twitter) Also Read: IND vs SA: It Is Exciting To Open With Shikhar Dhawan: Shubman Gill IND Squad: Shikhar Dhawan (Captain), Ruturaj Gaikwad, Shubhman Gill, Shreyas Iyer (vice-captain), Rajat Patidar, Rahul Tripathi, Ishan Kishan (wicket-keeper), Sanju Samson (wicket-keeper), Shahbaz Ahmed, Shardul Thakur, Kuldeep Yadav, Ravi Bishnoi, Mukesh Kumar, Avesh Khan, Mohd. Siraj, Deepak Chahar South Africa Temba Bavuma (Photo: Twitter) Also Read: Watch: Kagiso Rabada’s 138kmph Inswinger Sends Back Shubman Gill For 3 In Lucknow ODI Temba Bavuma is the captain of South Africa in IND vs SA ODI series. David Miller slammed the most 75 runs for the team in the 1st ODI. Heinrich Klaasen also hit a beautiful knock of 74 runs. Quinton de Kock smacked 48 runs. In bowling, Lungi Ngidi hunted the most 3 wickets for the team while Kagiso Rabada got 2 wickets. Keshav Maharaj, Wayne Parnell, and Tabraiz Shamsi scalped 1 wicket each. South Africa. (Photo: Twitter) Also Read: IND vs SA: Watch – Wayne Parnell Gets Rid Off Dangerous Shikhar Dhawan In Lucknow ODI SA Squad: Temba Bavuma (Captain), Reeza Hendricks, Janneman Malan, Aiden Markram, David Miller, Wayne Parnell, Andile Phehlukwayo, Dwaine Pretorius, Quinton de Kock, Heinrich Klaasen, Keshav Maharaj (vice-captain), Lungi Ngidi, Anrich Nortje, Kagiso Rabada, Tabraiz Shamsi. Get All Cricket match prediction and fantasy Tips – CLICK HERE Cricket Match Prediction | Today Match Fantasy Prediction | Fantasy Cricket Tips | Cricket News and Updates | Cricket Live Score !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 14:17:33","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Missing T20 WC berth is huge setback but lot of cricket still left in me: Shardul","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/missing-t20-world-cup-berth-is-huge-setback-but-lot-of-cricket-still-left-in-me-shardul-thakur/articleshow/94728395.cms","keywords":null,"creator":null,"video_url":null,"description":"Shardul Thakur has come to terms with the \"big setback\" of missing the T20 World Cup cut but the Mumbai medium pace bowling all-rounder is focussed on doing well in upcoming games as he still has a \"lot of cricket\" left in him. Thakur did play the T20 format for India during the time Hardik Pandya was doing his long and intense rehabilitation program but poor economy rate of 9.15 has basically pushed him out of the national team radar.","content":"RANCHI: Shardul Thakur has come to terms with the \"big setback\" of missing the T20 World Cup cut but the Mumbai medium pace bowling all-rounder is focussed on doing well in upcoming games as he still has a \"lot of cricket\" left in him. Thakur did play the T20 format for India during the time Hardik Pandya was doing his long and intense rehabilitation program but poor economy rate of 9.15 has basically pushed him out of the national team radar. \"Of course, it's a big setback. Every player dreams to play in the World Cup, not just play but win it as well,\" Thakur said on the eve of the second ODI against South Africa. Read Also India vs South Africa 2nd ODI: India eye all-round improvement in must win ODI against South Africa Deepak Chahar's unavailability due to an ankle injury will complicate selection matters with India looking for a much improved bowling performance in a must win second ODI against South Africa on Sunday. \"It's okay I'm not selected this time. But there's still a lot of cricket left and also there's the ODI World Cup next year. My focus will be to do well in whatever matches I play and make winning contributions,\" th Mumbai man, who is just two short of completing 100 international wickets across formats, said. India have suffered another big blow to their T20 World Cup campaign when injury-prone Deepak Chahar, who was in the reserves, was ruled out of the ongoing series with his chances to go to Australia seeming remote. \"Injuries are part and parcel of the game, at some point, someone is going to get injured. We should not take it by heart honestly. There is a lot more cricket to come,\" he said. Asked if he fancies his chances, the 30-year-old said: \"If injuries happen then anyone can come at any point of time. As of now, your responsibility is to be ready whenever and wherever you're asked to play. I will be mentally ready if I'm given a call-up. That's all in my hands.\" Want to make a difference with bat lower down Thakur further said he is honing his batting skills to make the difference lower down the order, something that was on display in a 66-ball-93 run partnership with Sanju Samson in the first ODI. Chasing a stiff 250 in 40 overs, India were 51/4 but Sanju Samson (86 not out) and Thakur (33) revived their hopes only to miss out by nine runs. \"If you see teams who have done very well at international level, their batting line-up has been quite deep. Like Australia for instance, they have the likes of Pat Cummins, Mitch Starc coming at 8 or 9. Even for that matter England. \"I've been focusing on my batting for quite a long time now. obviously batting at no 7 or the one coming at no 9, if they can contribute it's always great. That gives you a cushion. \"We also can have our batting lineup deep and make the difference -- the difference of 15-20 runs that can be crucial in winning the match especially in white ball cricket,\" he said. Unfair to criticise only Indian bowlers Team India's bowling may have copped criticism of late but Thakur said it's unfair as the rival bowlers too are also leaking runs. \"It's not fair to criticise only the Indians, even their bowlers are taken to cleaners. We won the T20I series, but they also were slammed. \"I think before questioning the consistency we should see how the wicket was, the conditions. Sometimes in an ODI match more than 350-runs are scored so in that case every bowler got hit. \"There has been no one sided match for India, be it on a batting or a bowling friendly pitch, most have been competitive. We have won most matches and showed consistency,\" he added.","pubDate":"2022-10-08 14:08:58","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"“Won’t Call Shikhar Dhawan-Led Indian ODI Side Second String”- Keshav Maharaj","link":"https://www.thetimesofbengal.com/sports/wont-call-shikhar-dhawan-led-indian-odi-side-second-string-keshav-maharaj/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Indian Cricket Team suffered defeat in the 1st ODI against South Africa. The Men in Blue would be dejected as the batters failed to show character in the middle. India lost the match by 9 runs and if the team could have got a couple of partnerships then the result of the match could have […]","content":"Indian Cricket Team suffered defeat in the 1st ODI against South Africa. The Men in Blue would be dejected as the batters failed to show character in the middle. India lost the match by 9 runs and if the team could have got a couple of partnerships then the result of the match could have been different. South Africa National Cricket Team. Pic Credits: Twitter South Africa on the other side would be thrilled as winning against any Indian Side is never easy especially when India is playing in their home conditions. The Proteas would be well aware of the fact that they need to work on their death bowling. They should have won the match by at least 30 runs as they were in a commanding position. Keshav Maharaj on Indian Cricket Team Keshav was seen interacting with reporters ahead of the 2nd T20I match. “I would not call it a second string Indian side. India have so much talent that they can field four-five International Sides. Having said that , a lot of guys have IPL and International Experience. There are world class performers out there,” said Maharaj. South Africa National Cricket Team (Image Credits: BCCI) “It’s always nice to play against India. Obviously, you want to prepare yourself. They have a world class batting line up,” he added Great Chance for South Africa The Proteas would like to seal the Series in the 2nd ODI itself and most importantly grab 10 World Super League Points. Each and every match for South Africa is crucial as they can’t afford to experiment. South Africa should not get complacent as India would be ready for all sorts of uphill challenges in the 2nd ODI match. South Africa National Cricket Team. Pic Credits: Twitter India on the other side would expect Shikhar Dhawan to get a big score as the batter knows how to pace the innings in the ODI format. His presence till 30th over means that India is setting a formidable total on board. The left-handed batter will have to make the most of these remaining 2 ODIs to make a case for himself for ICC Cricket World Cup 2023. Also Read: IND vs SA: “I Think The Selectors Have Decided…”- Ex-India Wicket-Keeper Saba Karim On Shikhar Dhawan’s Chances For 2023 World Cup !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 14:01:22","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia vs England 1st T20I Live Telecast Channel in India and England: When and where to watch AUS vs ENG Perth T20I?","link":"https://thesportsrush.com/cricket-news-australia-vs-england-1st-t20i-live-telecast-channel-in-india-and-england-when-and-where-to-watch-aus-vs-eng-perth-t20i/","keywords":["Cricket","Australia","England","England tour of Australia 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Australia vs England 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st AUS vs ENG T20I. The first of three T20Is of England’s tour of Australia 2022 will be played in Perth tomorrow. Having played a total of 20 T20Is till date, Australia and England will… The post Australia vs England 1st T20I Live Telecast Channel in India and England: When and where to watch AUS vs ENG Perth T20I? appeared first on The SportsRush.","content":"The first of three T20Is of England’s tour of Australia 2022 will be played in Perth tomorrow. Having played a total of 20 T20Is till date, Australia and England will be playing one against each other after almost a year. Considering a close overall between them in this format, presuming a captivating series wouldn’t be the wrong thing to do on the eve of the first match. Australia, who will be hosting England for a T20I series after almost nine years, will be hosting them for the fourth time in the shortest format. It was in January 2014 when Australia and England had last played a T20I series down under. Readers must note that Australia haven’t won a T20I series against England since then. England, who’ve won the last three bilateral T20I series against Australia, have maintained an overall series lead of 4-2 over the years. In what is going to be only the second T20I at the , it will be the first one for the visitors. With some of their players having played a lot in Australia due to their respective Big Bash League stints in the recent years, expect England to challenge the world champions on each occasion across the next six days. England’s tour of Australia 2022 will be televised by Sony Sports Network in India. Much like the recently concluded white-ball series in Australia featuring Zimbabwe, New Zealand and West Indies, Sony will allocate only one channel for this series as well. Hence, Indian fans will have to tune in to Sony TEN 1 to watch the match in English commentary on Sunday. Readers must note that this series will only be broadcast in English commentary. Sony LIV, Sony Network’s designated streaming platform, will be streaming these three T20Is with a paid subscription. On the contrary, fans in England will be able to watch Perth and Canberra T20Is on BT Sport 1. Meanwhile, local fans in Australia will have to continue to use the services of Fox Cricket (television) and Kayo Sports (streaming app) for this series. Some key preparation before the T20 World Cup 🏆 You can watch England’s three T20s against Australia on BT Sport 💥 — Cricket on BT Sport (@btsportcricket) – 09/10/2022 (Sunday). – 08:40 AM (England), 01:10 PM (India) and 03:40 PM (local). – Sony TEN 1 (India), BT Sport 1 (England) and Fox Sports (Australia). – Sony LIV (India) and Kayo Sports (Australia).","pubDate":"2022-10-08 13:47:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CECC vs FUT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- KCC T-20 Elite Championship","link":"https://www.thetimesofbengal.com/sports/cecc-vs-fut-dream11-prediction-fantasy-cricket-tips-dream11-team-playing-xi-pitch-report-injury-update-kcc-t-20-elite-championship/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"CECC vs FUT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update of KCC T-20 Elite Championship match between Ceylinco Express CC and Future Stars. CECC vs FUT KCC T-20 Elite Championship Match 11 Details: The 11th match of the KCC T-20 Elite Championship will see Ceylinco Express CC facing off […]","content":"CECC vs FUT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update of KCC T-20 Elite Championship match between Ceylinco Express CC and Future Stars. CECC vs FUT KCC T-20 Elite Championship Match 11 Details: The 11th match of the KCC T-20 Elite Championship will see Ceylinco Express CC facing off against Future Stars on 8th October at the Sulabiya Ground. For all the Dream11 Tips and Fantasy Cricket Live Updates, follow us on Cricketaddictor Telegram Channel. This game is scheduled to start at 11:30 PM IST and live score and commentary can be seen on FanCode and CricketAddictor website. CECC vs FUT KCC T-20 Elite Championship Match 11 Preview: The KCC T-20 Elite Championship will see its eleventh match of this season between Ceylinco Express CC and Future Stars. Ceylinco Express CC will be battling against Future Stars for the first time in the eleventh match of this season of the KCC T-20 Elite Championship. Ceylinco Express CC is currently placed at the bottom of the points table of this season of the KCC T-20 Elite Championship whereas FUTURE STARS is currently placed at the seventh spot on the points table. Ceylinco Express CC played two matches in this season of the KCC T-20 Elite Championship where they were unable to win a single game while Future Stars also played two matches this season where they won one game. CECC vs FUT KCC T-20 Elite Championship Match 11 Weather Report: The temperature is expected to hover around 32°C on the matchday with 22% humidity and 14 km/hr wind speed. There are no chances of precipitation during the game. CECC vs FUT KCC T-20 Elite Championship Match 11 Pitch Report: The Sulabiya Ground is a batting-friendly wicket and is expected to boost the batters once again here. Pacers might get some help towards the latter half of the match while spinners will be bandy in the middle overs. Average 1st innings score: The average first-innings score on this wicket is 176 runs. Record of chasing teams: The team batting second doesn’t enjoy good records here. They have a winning percentage of 40 on this track. CECC vs FUT KCC T-20 Elite Championship Match 11 Injury Update: (Will be added when there is an update) CECC vs FUT KCC T-20 Elite Championship Match 11 Probable XIs: Ceylinco Express CC: Ibrahim Rifkaz, Viraj Weerasekara, Deepal Melvo©, Mohamed Shafran, Ahilan Ratnam, Priyakanth Harichchandra, Mohamed Rameez(wk), Vengadashen Abhishek, Sajeeb Kunjavaru, Indika Sanjeewa, Mohamed Hameez Future Stars: Basir Khan, Bilal Tahir, Amin Ijaz, Naveen Jacob, Muhammad Ghulam©(wk), Mirwais Khan, Irfanullah Sultanzai, Bashart Ali, Praveen Raj, Usman Tahir, Abdul Rehman Top Picks For Dream11 Prediction and Fantasy Cricket Tips: Mohamed Shafran is a right-handed batsman and right-arm off-break bowler from Ceylinco Express CC. He has marked 15 runs in this tournament so far. Deepal Melvo is a right-handed batsman from Ceylinco Express CC. He has smashed 26 runs in this tournament so far. Bilal Tahir is a right-handed batsman and right-arm leg-break bowler from Future Stars. He has hammered 61 runs in this tournament so far. Mirwais Khan is a right-handed batsman from Future Stars. He has stacked 93 runs in this tournament so far. CECC vs FUT KCC T-20 Elite Championship Match 11 Captain and Vice-Captain Choices: Captain – Amin Ijaz, Mirwais Khan Vice-Captain – Bilal Tahir, Deepal Melvo Suggested Playing XI No.1 for CECC vs FUT Dream11 Team: Keeper – Mohamed Rameez Batsmen – Bilal Tahir (VC), Deepal Melvo, Mirwais Khan All-rounders – Amin Ijaz (C), Mohammad Shafran, Priyakanth Harichchandra Bowlers – Asif Nawaz, Praveen Rao, Mohammad Hameez, Irfanullah Sultanzai CECC vs FUT Dream11 Prediction Suggested Playing XI No.2 for CECC vs FUT Dream11 Team: Keeper – Mohamed Rameez Batsmen – Bilal Tahir, Deepal Melvo (VC), Mirwais Khan (C) All-rounders – Amin Ijaz, Mohammad Shafran, Lakshan Gamage-I Bowlers – Asif Nawaz, Praveen Rao, Mohammad Hameez, Viraj Weerasekara CECC vs FUT Dream11 Prediction CECC vs FUT KCC T-20 Elite Championship Match 11 Expert Advice: Amin Ijaz will be a safe multiplier choice for the mini-grand leagues. Viraj Weeraswkara and Irfanullah Sultanzai are among the punt-picks here. The best-suggested fantasy/Dream11 combination for this game is 1-3-3-4. CECC vs FUT KCC T-20 Elite Championship Match 11 Probable Winners: Future Stars are expected to win this match. !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 13:45:23","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Files Proposal For Cricket’s Inclusion In Olympics With Special Attention On Indian Icons Virat Kohli And Mithali Raj","link":"https://www.thetimesofbengal.com/sports/icc-files-proposal-for-crickets-inclusion-in-olympics-with-special-attention-on-indian-icons-virat-kohli-and-mithali-raj/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"International Cricket Council (ICC) is trying its best to get Cricket included in Olympics. International Olympic Committee had excluded Cricket from the provisional list for Los Angeles 2028 Olympics. Cricket’s only participation had come in 1990 Paris. We all know Cricket is Famous but it’s not that popular across the globe. In the last 5 […]","content":"International Cricket Council (ICC) is trying its best to get Cricket included in Olympics. International Olympic Committee had excluded Cricket from the provisional list for Los Angeles 2028 Olympics. Cricket’s only participation had come in 1990 Paris. We all know Cricket is Famous but it’s not that popular across the globe. In the last 5 years, ICC has given status to a lot of countries and we can see a lot of European Countries participating in the sport and others too. It is assumed that the T20 format would be used in the Olympics as the game gets wrapped up in 3 hours. ICC. Image: Twitter ICC’s Proposal to Olympics ICC had a virtual presentation to Los Angeles 2028 and not to International Olympics Committee (IOC) last week and stated that Cricket’s inclusion can bring a billion fans. ICC pointed out that Former India Captain Virat Kohli & Legendary Mithali Raj were quite popular around the globe. ICC also said that Cricket is popular in South Asia which can help in Olympics. ICC On LA28 Olympics The ICC statement read, “The review process for potential new sports for the LA28 Olympic sports program is ongoing. We are continuing to learn more ahead of the sports proposal submission to the IOC next year.” said in a statement. LA Olympics 2028. Pic Credits: Twitter. A lot of other sports like Karate, Baseball, Softball, Kickboxing, Squash, American Football, Lacrosse & Break Dancing are on the list. The road to ICC is a bit steep one. It would be interesting to see what happens the next year when World Cricket would be eagerly waiting for the sport to become a global one. It looks like IOC is not interested in Cricket. It would require a miracle to see ICC in Olympics as their biggest competitor is baseball. Also Read: ICC T20 World Cup 2022: “Cricketers Like Hardik Pandya Come Once In Many Years”- Kieron Pollard !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 13:29:21","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"GWG vs BWR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Junior League T20","link":"https://www.thetimesofbengal.com/sports/gwg-vs-bwr-dream11-prediction-fantasy-cricket-tips-dream11-team-playing-xi-pitch-report-injury-update-junior-league-t20/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"GWG vs BWR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update of Junior League T20 match between Gujranwala Giants and Bahawalpur Royals. GWG vs BWR Junior League T20 Match 4 Details: The 4th match of the Junior League T20 will see Gujranwala Giants facing off against Bahawalpur Royals on 8th […]","content":"GWG vs BWR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update of Junior League T20 match between Gujranwala Giants and Bahawalpur Royals. GWG vs BWR Junior League T20 Match 4 Details: The 4th match of the Junior League T20 will see Gujranwala Giants facing off against Bahawalpur Royals on 8th October at the Gaddafi Stadium. For all the Dream11 Tips and Fantasy Cricket Live Updates, follow us on Cricketaddictor Telegram Channel. This game is scheduled to start at 8:30 PM IST and live score and commentary can be seen on FanCode and CricketAddictor website. GWG vs BWR Junior League T20 Match 4 Preview: The Junior League T20 will see its fourth match of this season between Gujranwala Giants and Bahawalpur Royals. Gujranwala Giants will be squaring off against Bahawalpur Royals for the first time in the fourth match of this season of the Junior League T20. Gujranwala Giants is currently placed at the fifth position on the points table of this season of the Junior League T20 whereas Bahawalpur Royals is currently placed at the top of the points table. Gujranwala Giants played one match in this season of the Junior League T20 where they lost that game while Bahawalpur Royals also played one game this season where they won that game. GWG vs BWR Junior League T20 Match 4 Weather Report: The temperature is expected to hover around 31°C on the matchday with 45% humidity and 10 km/hr wind speed. There are no chances of precipitation during the game. GWG vs BWR Junior League T20 Match 4 Pitch Report: The Gaddafi Stadium is a batting-friendly surface and is expected to assist the batters once again here. Pacers might get some help towards the latter half of the match while spinners will play a crucial role in the middle overs. Average 1st innings score: The average first-innings score on this wicket is 160 runs. Record of chasing teams: The team batting second has great records here. They have maintained a winning percentage of 60 on this ground. GWG vs BWR Junior League T20 Match 4 Injury Update: (Will be added when there is an update) GWG vs BWR Junior League T20 Match 4 Probable XIs: Gujranwala Giants: Azan Awais, Shevon Daniel, Uzair Mumtaz©, Ariful Islam, Mohammad Waqas, Hasnain Majid(wk), Tom Aspinwall, Ali Asfand, Mohammad Ibtisam, Mohammad Shan, Mohammad Aqib Asghar Bahawalpur Royals: Basit Ali, Johan Mahne, Obaid Shahid©, Shawaiz Irfan(wk), Farhan Yousaf, Ali Razzaq, Nangeyalia Kharote, Nathan Edward, Sajjad Ali, Arham Nawab, Mohammad Zeeshan Top Picks For Dream11 Prediction and Fantasy Cricket Tips: Mohammad Waqas-I is a right-handed batsman and left-arm orthodox spinner from Gujranwala Giants. He smashed 18 runs in the last game. Uzair Mumtaz is a right-handed batsman and right-arm off-break bowler from Gujranwala Giants. He hammered 54 runs in the last match. Obaid Shahid is a right-handed batsman and right-arm leg-break bowler from Bahawalpur Royals. He stacked 32 runs in the last game. Arham Nawab is a right-handed batsman and right-arm off-break bowler from Bahawalpur Royals. He hunted 3 wickets in the last match. GWG vs BWR Junior League T20 Match 4 Captain and Vice-Captain Choices: Captain – Uzair Mumtaz, Arham Nawab Vice-Captain – Mohammad Waqas-I, Azan Awais Suggested Playing XI No.1 for GWG vs BWR Dream11 Team: Keeper – Shawaiz Irfan Batsmen – Mohammad Waqas-I (VC), Azan Awais, Ali Razzaq All-rounders – Uzair Mumtaz (C), Obaid Shahid, Shavon Daniel Bowlers – Nangeyalia Kharote, Nathan Edwards, Tom Aspinwall, Johan Mahne GWG vs BWR Dream11 Prediction Suggested Playing XI No.2 for GWG vs BWR Dream11 Team: Keeper – Shawaiz Irfan Batsmen – Mohammad Waqas-I, Azan Awais (VC), Ali Razzaq All-rounders – Uzair Mumtaz, Obaid Shahid, Arham Nawab (C) Bowlers – Nangeyalia Kharote, Nathan Edwards, Tom Aspinwall, Mohammad Ibtisam GWG vs BWR Dream11 Prediction GWG vs BWR Junior League T20 Match 4 Expert Advice: Uzair Mumtaz will be a good captaincy choice for the mini-grand leagues. Johan Manhe and Mohammad Ibtisam are among the punt-picks here. The best-suggested fantasy/Dream11 combination for this game is 1-3-3-4. GWG vs BWR Junior League T20 Match 4 Probable Winners: Gujranwala Giants are expected to win this match. !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 13:13:28","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa LIVE: When and where to watch IND vs SA 2nd ODI, live streaming, time in IST, TV Channel and more","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-south-africa-live-when-and-where-to-watch-ind-vs-sa-2nd-odi-live-streaming-time-in-ist-tv-channel-and-more-11411821.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs South Africa LIVE: When and where to watch IND vs SA 2nd ODI, live streaming, time in IST, TV Channel and more","content":"We do not see often the Indian side trailing in a bilateral series, but this is one such instance as South Africa won the first match after a Sanju Samson show that brought life to the game that was in slumber after a certain point in time.It won’t be right to term the Indian team as fringe players, similarly as Keshav Maharaj said that the Shikhar Dhawan-led side cannot be said to be a second-string side. And rightly so, as even after losing four wickets for 51 runs in 18 overs, India lost only by 9 runs.An injury to Deepak Chahar has resulted in spin all-rounder Washington Sundar replacing him. Dhawan might be lured to play him, considering there is no spinning all-rounder on the side. Shardul Thakur, though, didn’t let the team feel void of an all-rounder.Proteas, on the other hand, will look to clinch the series early and would want a few of their players to have a breather while others play the third ODI, with the T20 World Cup nearing each day. David Miller has shown why he is one of the best in the middle order in the world right now after some brilliant innings in both formats. And Quinton De Kock’s return to form will only boost the sides’ overall confidence.However, they will want captain Temba Bavuma to fire before going Down Under and a couple of good innings might just make sure that he is in the right space.When will the second India vs South Africa ODI be played?The second match of the India vs South Africa ODI series will be played on 9 October, Sunday.What time will the second India vs South Africa ODI start?The match will start at 1:30 PM IST, with the toss taking place at 1 PM IST.Where will the second India vs South Africa ODI be played?The second ODI between India and South Africa will be played at the JSCA International Stadium in Ranchi, Jharkhand.Which TV Channel will stream second India vs South Africa ODI LIVE?The second ODI between India and South Africa will be telecast live on Star Sports Network.Where can I digitally stream the second India vs South Africa ODI LIVE?The second India vs South Africa ODI can be streamed live on the Hotstar app. You can also browse Firstpost.com for live updates.Squads: India: Shikhar Dhawan(c), Shubman Gill, Ruturaj Gaikwad, Shreyas Iyer, Ishan Kishan, Sanju Samson(wk), Shardul Thakur, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Mohammed Siraj, Rahul Tripathi, Rajat Patidar, Mukesh Kumar, Shahbaz Ahmed, Washington SundarSouth Africa: Janneman Malan, Quinton de Kock(wk), Temba Bavuma(c), Aiden Markram, Heinrich Klaasen, David Miller, Wayne Parnell, Keshav Maharaj, Kagiso Rabada, Lungi Ngidi, Tabraiz Shamsi, Anrich Nortje, Marco Jansen, Andile Phehlukwayo, Reeza HendricksRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-08 13:04:38","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/India-vs-SA-Live-Streaming.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview, South Africa Tour Of India 2022, 2nd ODI","link":"https://www.thetimesofbengal.com/sports/match-preview-south-africa-tour-of-india-2022-2nd-odi/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"India take on South Africa in the second ODI in Ranchi on Sunday, October 9. The hosts lost the first game and are under pressure to win the second to keep the series alive. South Africa, on the other hand, needs a series win to keep their hopes of direct qualification alive for the 2023 […]","content":"India take on South Africa in the second ODI in Ranchi on Sunday, October 9. The hosts lost the first game and are under pressure to win the second to keep the series alive. South Africa, on the other hand, needs a series win to keep their hopes of direct qualification alive for the 2023 ODI World Cup. Both teams have different agendas behind winning this ODI series. For India, it is about preparing a team for the next generation. For South Africa, it is about direct qualification for the next World Cup. Both teams look upbeat about it and are looking forward to the next course of events. In between, there is a series to win for both teams as they look forward to the T20 World Cup in Australia. Both teams are placed in the same group and will take on each other on October 30. India vs South Africa (Image Credits: BCCI) India vs South Africa: Match Preview, South Africa Tour Of India 2022, 2nd ODI India Washington Sundar. Credits: Twitter As India continues to find answers to their death bowling woes, they have been struck by an injury to Deepak Chahar which has ruled him out from the remaining two games. Chahar complained of a stiff back after the third T20I against South Africa. They did not play the first ODI and will now the National Cricket Academy in Bengaluru to recover from his injury. Washington Sundar is roped in as his replacement for the last two games. With Jasprit Bumrah ruled out from the T20 World Cup, Chahar is one of the possible replacements for him in the mega event. Photo Credit: (BCCI) Batting in the middle overs is another area of focus for the team heading into the second ODI. Ruturaj Gaikwad and Ishan Kishan played too slowly in the middle overs which ultimately cost India the game. The duo scored 39 runs from 79 deliveries and in the process, slowing down the run rate. India Squad Shikhar Dhawan (Captain), Ruturaj Gaikwad, Shubman Gill, Shreyas Iyer (vice-captain), Rajat Patidar, Rahul Tripathi, Ishan Kishan (wicket-keeper), Sanju Samson (wicket-keeper), Shahbaz Ahmed, Shardul Thakur, Kuldeep Yadav, Ravi Bishnoi, Mukesh Kumar, Avesh Khan, Mohd. Siraj, Washington Sundar South Africa Temba Bavuma. Pic Credits: Twitter The Proteas lost the T20I series 2-1 and made a great start to the ODIs. They managed to defend their total of 250 and win by 9 runs. Amid concerns about their direct qualification, the form of their skipper Temba Bavuma has been a big worry for the management. 8 is his highest score in the series so far he scored in the first ODI. He just has found the going tough in the series and has been failing with his strokeplay. Photo Credit: (Twitter) With the ball, Tabraiz Shamsi had a difficult game in Lucknow. He went for 89 runs off his 8 overs as the Indian batters targeted him with a score to chase. The side has enough options with the ball heading into the T20 World Cup and in the remaining two games will look to hit the target. South Africa Squad Temba Bavuma (C), Quinton De Kock, Reeza Hendricks, Heinrich Klaasen, Keshav Maharaj, Aiden Markram, David Miller, Lungi Ngidi, Anrich Nortje, Wayne Parnell, Dwaine Pretorius, Kagiso Rabada, Rilee Rossouw, Tabraiz Shamsi, Tristan Stubbs, Bjorn Fortuin, Marco Jansen, Andile Phehlukwayo Also Read: IND vs SA: “Qualifying For 2023 World Cup Going To Be Hard But South Africa Will Try” – Heinrich Klaasen !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-08 12:57:24","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - India vs South Africa, South Africa in India 2022/23, 2nd ODI - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL3NvdXRoLWFmcmljYS1pbi1pbmRpYS0yMDIyLTIzLTEzMjc0OTkvaW5kaWEtdnMtc291dGgtYWZyaWNhLTJuZC1vZGktMTMyNzUxMC9tYXRjaC1wcmV2aWV30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - India vs South Africa, South Africa in India 2022/23, 2nd ODI  ESPNcricinfoIndia vs South Africa, 2nd ODI: India Eye All-Round Improvement In A Must Win Game vs South Africa  NDTV SportsIndia Vs South Africa 2nd ODI - Ranchi Weather Forecast And Pitch Report  ICC CRICKET SCHEDULEIND vs SA 2nd ODI live streaming: When and where to watch India vs South Africa 2nd ODI live in India  DNA India'I think the selectors have decided...': Ex-India wicketkeeper on Dhawan's fate  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-10-08 12:38:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rithvik ton guides St Martin’s CA to victory at Inter-State Cricket Tournament","link":"https://telanganatoday.com/rithvik-ton-guides-st-martins-ca-to-victory-at-inter-state-cricket-tournament","keywords":["News","Sport","cricket","Inter-State Cricket Tournament"],"creator":["Telangana Today"],"video_url":null,"description":"Rithvik Goud scored an unbeaten century (102) to guide St Martin's Cricket Academy, Hyderabad to a thumping 10-wicket victory over Kapil Cricket Club of Bengaluru","content":"Hyderabad: Rithvik Goud scored an unbeaten century (102) to guide St Martin’s Cricket Academy, Hyderabad to a thumping 10-wicket victory over Kapil Cricket Club of Bengaluru in the U-14 category of the VS Sports Inter-State Cricket Tournament held in Hyderabad on Saturday. Kapil Cricket Club was restricted for 159/9 in 25 overs. Akshay Reddy picked up three for 41 for St Martin’s. In reply, Rithvik Goud scored unbeaten 102 and Vidya Sree hit an unbeaten 38-run knock to lead their side home. Brief Scores: U-12: St Martin’s Cricket Academy (Hyderabad) 210/6 in 25 overs (B Sathvik 60, M Dhanush 42 bt Kapil Cricket Club (Bengaluru) 153/10 in 23.3 overs Tejas 54; Vikranth 3/4); Kapil Cricket Academy (Bengaluru) 71 in 24.3 lost to Phoenix Cricket Academy 72/2 in 9.4 overs; U-14: Kapil Cricket Club (Bengaluru) 159/9 in 25 overs (Jayanth 35, Akshay Reddy 3/ 41) lost to St Martin’s Cricket Academy 160/0 in 24.5 overs (Rithvik Goud 102 no, Vidya Sree 38no); Kapil Cricket Club (Bengaluru) 293/6 in 25 overs (Rahul Jamkhandi 117no, Rakshith 56) bt Sunshine Cricket Academy 100 (Abhishek 3/15).","pubDate":"2022-10-08 12:22:30","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Perth Stadium T20 records: Optus Stadium Perth records and highest innings total in T20Is","link":"https://thesportsrush.com/cricket-news-perth-stadium-t20-records-optus-stadium-perth-records-and-highest-innings-total-in-t20is/","keywords":["Cricket","Australia","England","England tour of Australia 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Perth Stadium T20 records: Perth Stadium will be hosting an international match after almost three years tomorrow. The first T20I of England’s tour of Australia 2022 will be played in Perth tomorrow. The first of a three-match series will begin the last bilateral T20I series for both these teams before ICC T20 World Cup 2022.… The post Perth Stadium T20 records: Optus Stadium Perth records and highest innings total in T20Is appeared first on The SportsRush.","content":"The first T20I of England’s tour of Australia 2022 will be played in Perth tomorrow. The first of a three-match series will begin the last bilateral T20I series for both these teams before ICC T20 World Cup 2022. In what is going to be the sixth international match across formats at the Perth Stadium, it will witness the city hosting an international match for the first time since December 2019. The last match to be played here was an Australia-New Zealand Test. Scheduled to begin at 03:40 PM (local time), Australia vs England first T20I will be played in the afternoon-evening slot in Perth. The development will please the sub-continent fans, in particular, as they will have as many as three white-ball international matches to follow at the given time. With Perth Stadium hosting all of one T20I till date, there aren’t a lot of records to mention for this stadium. It was almost three years ago when Australia had defeated Pakistan by 10 wickets here. While Pakistan had registered a batting collapse, only the opening batters had batted for Australia in the inaugural T20I at the Perth Stadium. Hence, highest T20I run-scorers at this venue are Aaron Finch (52) and David Warner (48). Set to play on Sunday, Australia pacer Kane Richardson was their best bowler on the day with bowling figures of 4-0-18-3. In addition to Richardson, pacers Sean Abbott and Mitchell Starc had picked a couple of wickets each to be assisted by all-rounder Ashton Agar’s lone wicket. As far as the visitors are concerned, England’s only appearance at this stadium had come during its inaugural match in January 2018. Last of a five-match series was won by England after they successfully defended 259 runs. Part of the current squad, Alex Hales (35), Jos Buttler (21), Moeen Ali (6 and 3/55), Adil Rashid (12 and 1/55) and David Willey (2 and 0/37) had also played that match. Talking of players part of the current squads, Mitchell Marsh (363), Liam Livingstone (337), Josh Inglis (319), Hales (111), Aaron Finch (96), Marcus Stoinis (88), Matthew Wade (79), Glenn Maxwell (61) have done well in T20s at this venue. Among bowlers, Chris Jordan (11), Richardson (8), Agar (6), Marsh (5) and Starc (2) have done well in T20s played here. In what remains the only two T20I innings at the Perth Stadium, Pakistan and Australia had scored 106/8 (20 overs) and 109/0 (11.5 overs) respectively. Needless to say, Australia’s innings is the highest successful T20I run-chase at this venue. With Perth Stadium also having hosted 22 T20s till now, record for highest successful T20 run-chase lies with Sydney Thunder for sealing a 182-run target against hosts Perth Scorchers during Big Bash League 2018-19. The Australian cricket team has touched down in Perth ahead of their T20 clash with England tomorrow. The Aussies still looking to settle on their World Cup lineup – after claiming a series sweep against the West Indies. — 9News Perth (@9NewsPerth) Scorchers, however, hold the record for the highest T20 innings total here. It was during a BBL 2019-20 match against Brisbane Heat when the home team had scored 213/3 in 20 overs. Readers must note that the 200-run mark has been crossed only twice at this venue.","pubDate":"2022-10-08 11:50:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"NZ vs PAK Highlights: Brilliant Babar Azam, Haris Rauf stars as Pakistan thrash host NewZealand, wins 2nd match in T20 Tri-Series: Watch PAK beat NZ Highlights - InsideSport","link":"https://news.google.com/__i/rss/rd/articles/CBMitgFodHRwczovL3d3dy5pbnNpZGVzcG9ydC5pbi9uei12cy1wYWstaGlnaGxpZ2h0cy1icmlsbGlhbnQtYmFiYXItYXphbS1oYXJpcy1yYXVmLXN0YXJzLWFzLXBha2lzdGFuLXRocmFzaC1ob3N0LW5ld3plYWxhbmQtd2lucy0ybmQtbWF0Y2gtaW4tdDIwLXRyaXNlcmllcy13YXRjaC1wYWstYmVhdC1uei1oaWdobGlnaHRzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"NZ vs PAK Highlights: Brilliant Babar Azam, Haris Rauf stars as Pakistan thrash host NewZealand, wins 2nd match in T20 Tri-Series: Watch PAK beat NZ Highlights  InsideSportNZ vs PAK Tri-Series 2nd T20I Highlights: Pakistan beat New Zealand by six wickets  The Indian ExpressNew Zealand vs Pakistan, Tri-Series 2nd T20I: When And Where To Watch Live Telecast, Live Streaming  NDTV SportsLIVE | New Zealand vs Pakistan, Tri-Series 2nd T20 Match, Score: Babar Azam, Haris Rauf Shine in 6-Wicket Vic  India.comNZ vs PAK Live Streaming Details- When And Where To Watch New Zealand Tri-Series Live In Your Country? New Zealand Tri-Series 2022, 2nd T20I  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-10-08 11:50:42","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND-W vs BAN-W Women's Asia Cup T20 2022: India beat Bangladesh; consolidate spot in semis","link":"https://www.indiatvnews.com/sports/cricket/ind-w-vs-ban-w-women-s-asia-cup-t20-2022-india-beat-bangladesh-consolidate-spot-in-semis-2022-10-08-814687","keywords":null,"creator":null,"video_url":null,"description":"IND-W vs BAN-W Women's Asia Cup T20 2022: The Indian women's team on Saturday defeated the Bangladesh side by 59 runs at the Sylhet International Cricket Stadium, Sylhet. The women in blue have belted their fourth match of the tournament and have consolidated their spot for the semis.","content":"The Indian women's team on Saturday defeated the Bangladesh side by 59 runs at the Sylhet International Cricket Stadium, Sylhet. The women in blue have belted their fourth match of the tournament and have consolidated their spot for the semis. In the match, India made three changes. Captain , D Hemalatha, and Radha Yadav were rested today while Shafali Verma, Kiran Navgire, and Sneh Rana made comeback in the Playing XI. In Kaur's absence, Mandhana led the team. After winning the toss, India opted to bat and their regular openers- and Shafali Verma took the field. Both the players played a brilliant knock and stitched a 96-run stand before Mandhana was run out on 47. Verma, however, continued for a bit longer but she too went back after making 55. Wickets tumbled a bit and Bangladesh pulled things back, while ensured India finished at 159. Coming into the chase, it looked like one-way traffic. The Bangladesh team did not look anyway near in the second innings. The Lady Tigers got off to a slow start and when they wanted to step on the accelerator, the women in blue jolted them with regular blows. Bangladesh's captain Nigar Sultana showed some intent, but it was not enough as she could not get support and was later stumped out by Richa Ghosh. In the end, India won their fourth match comprehensively. The women in blue will next meet Thailand women, who have earlier upset the Pakistan team. The match will be played on 10th October. Smriti Mandhana(c), Shafali Verma, Sabbhineni Meghana, Jemimah Rodrigues, Richa Ghosh(w), Kiran Navgire, , , Sneh Rana, Renuka Singh, Rajeshwari Gayakwad. Murshida Khatun, Fargana Hoque, Nigar Sultana(w/c), Ritu Moni, Lata Mondal, Fahima Khatun, Rumana Ahmed, Nahida Akter, Salma Khatun, Fariha Trisna, Shanjida Akter.","pubDate":"2022-10-08 11:09:59","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"MAU vs GRA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for ECS T10 Spain 2022, Matches 2 and 3","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/mau-vs-gra-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-ecs-t10-spain-2022-matches-2-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-08 11:01:18","image_url":"https://static.sportskeeda.com/editor/2022/10/7e067-16652086857244-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's Asia Cup 2022, IND W vs BAN W Highlights: India win by 59 runs","link":"https://www.firstpost.com/firstcricket/sports-news/womens-asia-cup-2022-innd-w-vs-ban-w-highlights-india-win-by-59-runs-11409711.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Women's Asia Cup 2022, IND W vs BAN W Highlights: India win by 59 runs","content":"IND W vs BAN W: India win by 59 runs. Bangladesh were were restricted to 100/7 in reply to India’s 159/5. Shafali Verma and Deepti Sharma took two wickets each. Shafali, who also scored 55, was declared the player of the match. Toss update: India Women have won the toss and opted to bat first.Teams:India Women playing XI: Smriti Mandhana(c), Shafali Verma, Sabbhineni Meghana, Jemimah Rodrigues, Richa Ghosh(w), Kiran Navgire, Pooja Vastrakar, Deepti Sharma, Sneh Rana, Renuka Singh, Rajeshwari GayakwadBangladesh Women playing XI: Murshida Khatun, Fargana Hoque, Nigar Sultana(w/c), Ritu Moni, Lata Mondal, Fahima Khatun, Rumana Ahmed, Nahida Akter, Salma Khatun, Fariha Trisna, Shanjida AkterPreview: After losing to Pakistan the other day, India will hope to get their campaign back on track against defending champions Bangladesh. India and Bangladesh were also the finalists in the last edition of the Women’s Asia Cup when Bangladesh won the trophy in a thrilling fashion. In the ongoing tournament, Bangladesh so far have two wins from three matches. Their only defeat, like India, came against Pakistan. India are table toppers with three wins from four matches.India’s 13-run defeat to Pakistan was their third ever in the format to their arch-rivals. India’s strategy to shuffle their batting lineup backfired as admitted by captain Harmanpreet Kaur after the match. Still, India are expected to experiment further with an eye on the 2023 T20 World Cup.Earlier in the day, Sri Lanka Women defeated Malaysia Women by 72 runs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-08 10:54:33","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/India-vs-Bangladesh1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}