{"newsArray":[{"title":"Asia Cup 2023: કોહલીની બેટિંગ પોઝિશન બદલવાની જરૂર, આ દિગ્ગજ ખેલાડીએ શા માટે આપી આવી સલાહ","link":"https://gujarati.abplive.com/sports/cricket/asia-cup-2023-ab-de-villiers-said-virat-kohli-perfect-for-number-4-batting-855013","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"India vs Pakistan: એશિયા કપમાં ભારતની પ્રથમ મેચ પાકિસ્તાન સાથે છે. આ મેચ પહેલા એબી ડી વિલિયર્સે વિરાટ કોહલી માટે એક નિવેદન આપ્યું છે. ભારતીય ટીમે એશિયા કપ 2023 માટે પ્રેક્ટિસ શરૂ કરી દીધી છે. કેપ્ટન રોહિત શર્મા અને વિરાટ કોહલી સહિત તમામ ખેલાડીઓ મેદાનમાં ઉતર્યા છે. દિગ્ગજ ક્રિકેટર એબી ડી વિલિયર્સે કોહલી પર પ્રતિક્રિયા આપી છે. તેનું માનવું છે કે કોહલીએ ચોથા નંબર પર બેટિંગ કરવી જોઈએ. તે આ પદ માટે પરફેક્ટ છે. આ સાથે તેઓ મિડલ ઓર્ડરને પણ સપોર્ટ કરી શકશે. ઈન્ડિયા ટુડેના એક સમાચાર અનુસાર ડી વિલિયર્સે કોહલીનો ઉલ્લેખ કર્યો અને કહ્યું, “મને લાગે છે કે તે નંબર 4 માટે પરફેક્ટ છે. તેઓ કોઈપણ જવાબદારી સારી રીતે નિભાવી શકે છે. મને ખબર નથી કે તે આ નંબર પર રમવા માંગશે કે નહીં. પરંતુ ટીમ માટે  જવાબદારી નિભાવી મહત્વપૂર્ણ વાત હોઇ શકે છે. તમને જે પણ જવાબદારી મળે તેને સારી રીતે નિભાવવી જોઇએ. ભારત-પાકિસ્તાન મેચનો ઉલ્લેખ કરતા ડી વિલિયર્સે કહ્યું કે, ભારત અને પાકિસ્તાન આ વખતે એશિયા કપ જીતવાના પ્રબળ દાવેદાર છે. જો કે શ્રીલંકામાં પણ મોટી ટીમોને માત આપવાની  ક્ષમતા ધરાવે  છે. નોંધપાત્ર વાત એ છે કે, કોહલીએ નંબર 3 પર બેટિંગ કરતા ODI ફોર્મેટમાં સૌથી વધુ મેચ રમી છે. કોહલીએ આ બેટિંગ પોઝીશન પર 210 મેચ રમી છે. આ દરમિયાન 10777 રન બનાવ્યા છે. કોહલીએ આ ફોર્મેટમાં 39 સદી અને 55 અડધી સદી ફટકારી છે. ચોથા નંબર પર બેટિંગ કરતા તેણે 39 મેચ રમી છે. આ દરમિયાન 1767 રન બનાવ્યા છે. કોહલીએ આ બેટિંગ પોઝિશન પર 7 સદી અને 8 અડધી સદી ફટકારી છે. એશિયા કપ માટેની ભારતની ટીમ:- રોહિત શર્મા (કેપ્ટન), શુભમન ગિલ, વિરાટ કોહલી, શ્રેયસ ઐયર, સૂર્યકુમાર યાદવ, તિલક વર્મા, કેએલ રાહુલ, ઈશાન કિશન, હાર્દિક પંડ્યા (વાઈસ-કેપ્ટન), રવિન્દ્ર જાડેજા, અક્ષર પટેલ, શાર્દુલ ઠાકુર, જસપ્રીત બુમરાહ, મોહમ્મદ શમી, મોહમ્મદ સિરાજ, કુલદીપ યાદવ, પ્રખ્યાત કૃષ્ણાનો સમાવેશ થાયછે.                                           ","content":"India vs Pakistan: એશિયા કપમાં ભારતની પ્રથમ મેચ પાકિસ્તાન સાથે છે. આ મેચ પહેલા એબી ડી વિલિયર્સે વિરાટ કોહલી માટે એક નિવેદન આપ્યું છે. ભારતીય ટીમે એશિયા કપ 2023 માટે પ્રેક્ટિસ શરૂ કરી દીધી છે. કેપ્ટન રોહિત શર્મા અને વિરાટ કોહલી સહિત તમામ ખેલાડીઓ મેદાનમાં ઉતર્યા છે. દિગ્ગજ ક્રિકેટર એબી ડી વિલિયર્સે કોહલી પર પ્રતિક્રિયા આપી છે. તેનું માનવું છે કે કોહલીએ ચોથા નંબર પર બેટિંગ કરવી જોઈએ. તે આ પદ માટે પરફેક્ટ છે. આ સાથે તેઓ મિડલ ઓર્ડરને પણ સપોર્ટ કરી શકશે. ઈન્ડિયા ટુડેના એક સમાચાર અનુસાર ડી વિલિયર્સે કોહલીનો ઉલ્લેખ કર્યો અને કહ્યું, “મને લાગે છે કે તે નંબર 4 માટે પરફેક્ટ છે. તેઓ કોઈપણ જવાબદારી સારી રીતે નિભાવી શકે છે. મને ખબર નથી કે તે આ નંબર પર રમવા માંગશે કે નહીં. પરંતુ ટીમ માટે જવાબદારી નિભાવી મહત્વપૂર્ણ વાત હોઇ શકે છે. તમને જે પણ જવાબદારી મળે તેને સારી રીતે નિભાવવી જોઇએ. ભારત-પાકિસ્તાન મેચનો ઉલ્લેખ કરતા ડી વિલિયર્સે કહ્યું કે, ભારત અને પાકિસ્તાન આ વખતે એશિયા કપ જીતવાના પ્રબળ દાવેદાર છે. જો કે શ્રીલંકામાં પણ મોટી ટીમોને માત આપવાની ક્ષમતા ધરાવે છે. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); નોંધપાત્ર વાત એ છે કે, કોહલીએ નંબર 3 પર બેટિંગ કરતા ODI ફોર્મેટમાં સૌથી વધુ મેચ રમી છે. કોહલીએ આ બેટિંગ પોઝીશન પર 210 મેચ રમી છે. આ દરમિયાન 10777 રન બનાવ્યા છે. કોહલીએ આ ફોર્મેટમાં 39 સદી અને 55 અડધી સદી ફટકારી છે. ચોથા નંબર પર બેટિંગ કરતા તેણે 39 મેચ રમી છે. આ દરમિયાન 1767 રન બનાવ્યા છે. કોહલીએ આ બેટિંગ પોઝિશન પર 7 સદી અને 8 અડધી સદી ફટકારી છે. એશિયા કપ માટેની ભારતની ટીમ:- રોહિત શર્મા (કેપ્ટન), શુભમન ગિલ, વિરાટ કોહલી, શ્રેયસ ઐયર, સૂર્યકુમાર યાદવ, તિલક વર્મા, કેએલ રાહુલ, ઈશાન કિશન, હાર્દિક પંડ્યા (વાઈસ-કેપ્ટન), રવિન્દ્ર જાડેજા, અક્ષર પટેલ, શાર્દુલ ઠાકુર, જસપ્રીત બુમરાહ, મોહમ્મદ શમી, મોહમ્મદ સિરાજ, કુલદીપ યાદવ, પ્રખ્યાત કૃષ્ણાનો સમાવેશ થાયછે.","pubDate":"2023-08-26 05:32:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/26/d4f3f55f78143b946ec0fe6425fdf16b169302786190381_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"title":"\"Hope I Don't Get A Heart Attack...\": Pakistan Star's Comments Go Viral","link":"https://sports.ndtv.com/cricket/hope-i-dont-get-a-heart-attack-pakistan-star-naseem-shahs-big-statement-after-last-over-heroics-vs-afghanistan-4331034","keywords":null,"creator":null,"video_url":null,"description":"Number ten batsman Naseem Shah hit a boundary off the penultimate delivery to give Pakistan a dramatic one-wicket win over a luckless Afghanistan in the second ODI at Hambantota on Thursday.","content":"It was a match that was not for the faint-hearted. With only one wicket left, Pakistan made a dash in the last few balls to defeat Afghanistan by the narrowest of margins in the second ODI in Sri Lanka. Number ten batsman Naseem Shah hit a boundary off the penultimate delivery to give Pakistan a dramatic one-wicket win over a luckless Afghanistan in the second ODI at Hambantota on Thursday. The 20-year-old miscued a boundary off fast bowler Fazalhaq Farooqi and ran jubilantly towards the dressing room as Pakistan scored 11 off the final over to finish with 302-9 in 49.5 overs. The victory gave Pakistan an unassailable 2-0 lead in the three-match series with the last game in Colombo on Saturday. \"I would like to say that this year, with the chances I have got at the fag end of the innings, I hope I don't get a heart attack someday. I am very thankful to Allah and his grace as I always try to believe in myself in situations like that,\" said Shah in a video posted by Pakistan Cricket Board (PCB) . The quote has now been widely shared on social media. \"Let me just say that this year, the sort of situations I have had to face whilst coming into play towards the end of the innings, God Forbid I hope I don't get a heart-attack!\": Naseem Shah regarding his innings in the final over against Afghanistan in the 2nd ODI #AFGvPAK pic.twitter.com/eiysupkrse \"When I went inside, I believed in Shadab. I believed that we will finish the match. But when Shadab got out, I felt that the situation is now all mine. The bowlers are the same and I had the trust in myself to get the team over the line.\" Shah is happy that he has been taking Pakistan over the line on a quite a few occasions. \"I will say that it is a very happy thing and we needed this win a lot. I believed that I can do it.\" \"I try to be prepared for such situations as I practice a lot of batting in the nets. I know that my turn is coming when all the breathing lines stop. So I tried again to make the team win and did it. I am just trying to earn respect and rest is all upto almighty,\" he added. With AFP inputs","pubDate":"2023-08-26 03:48:36","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"Post Famous Interview With Tom Alter, Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home","link":"https://thesportsrush.com/cricket-news-post-famous-interview-with-tom-alter-sachin-tendulkar-was-fed-up-of-continuously-ringing-landline-phone-at-home/","keywords":["Cricket","Sachin Tendulkar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"For someone with an illustrious career spanning over 24 years, for someone who started his first-class career at the age of 15 and went on to become a demigod for millions, there can surely be no dearth of stories and anecdotes related to him which would make one go “Wow!!”. Legendary Indian batter Sachin Tendulkar,… The post Post Famous Interview With Tom Alter, Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home appeared first on The SportsRush.","content":"For someone with an illustrious career spanning over 24 years, for someone who started his first-class career at the age of 15 and went on to become a demigod for millions, there can surely be and related to him which would make one go “Wow!!”. Legendary Indian batter , who had emerged to be the face of India post its economic liberalization in early 1990s, can narrate aplenty ones from his days as a young prodigy itself. Advertisement The Master Blaster, who had a knack of playing and used to hardly get fed up of batting for long hours as a teenager, had experienced that emotion with respect to his landline phone at home. Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home Former sports journalist-cum-actor late Tom Alter was the first person to have recorded Tendulkar’s video interview for the press when the latter was just 15 years of age. The interview was for the newspaper, and had taken place on January 19, 1989 at Hindi Gymkhana Ground, Mumbai. Just over two months ago, Tendulkar had made his maiden Ranji Trophy appearance for Bombay, and had become the youngest Indian to score a century on first-class debut. Advertisement Tendulkar, who had become an instant hit in the Indian cricketing fraternity, had tasted the unwarranted side of fame post the interview. Not only him, but his parents also had to face the ordeal, as his home landline would just not stop ringing! The fact was revealed by veteran Indian broadcaster during an interaction with Gaurav Kapur on his podcast named ‘ ‘. Bhogle stated how well-acquainted he was with Tendulkar and his family right since the days the Mumbai batter was just 14-15. Days after the Tom Alter interview, Bhogle revealed that he had been invited to Tendulkar’s house. During his meeting with him that day, he has asked him the reason why he couldn’t receive any telephone calls from people. “I was invited to his house once, and had to ask Sachin [Tendulkar] why is it that you can’t take telephone calls from anybody? And he said, ‘Now see what happens’. And he put his phone down, pre-mobile era, he put his phone down and it started to ring, because his father’s number was in the telephone directory.” Bhogle mentioned that when someone would open the telephone directory back in the day, he/she could easily find the phone number of Ramesh Tendulkar (Sachin’s father), which, in fact, was the landline number of his house! Thus, the family members had to always keep the phone off-the-hook, because the moment it was put on, someone would definitely call. Such was the fan following of a 15-year-old! Advertisement In the above video, Bhogle recalled writing a piece on Tendulkar (after interviewing him) for a sports magazine in Kolkata before the latter’s Ranji Trophy debut and after his interview with Tom Alter. Although inadvertently, it is an inaccurate claim as mentioned above. Sachin Tendulkar’s Confidence Exhibited In Interview With Tom Alter Even though the entire video interview is not available in public domain, an ever-confident Tendulkar can be seen in a from the same. When asked if he is tired answering questions and giving interviews already, Sachin remarked, “I think this is just the start,” to which Tom added, “Yeah, it is a part of being a cricket star.” He might have come across a tad overconfident back then, but Tendulkar had admitted to be ever-ready to face the lethal fast bowling duo of Malcolm Marshall and Curtley Ambrose had be been picked for India’s tour of West Indies 1988/89. Later in the clip, he even had remarked how he had no trouble facing the in-swingers and out-swingers bowled by former India captain in the nets at the CCI (Cricket Club of India). In fact, Kapil had once remarked how with the way Tendulkar had faced him for the first time. Advertisement","pubDate":"2023-08-26 03:00:59","image_url":null,"source_id":"thesportsrush","source_priority":4166,"country":["united states of america","australia","india","united kingdom"],"category":["sports"],"language":"english"},{"title":"India's WC Squad: No Tilak, Sanju And Krishna In Ganguly's 15-Member List","link":"https://sports.ndtv.com/cricket/indias-icc-world-cup-2023-squad-no-sanju-samson-tilak-varma-and-prasidh-krishna-in-sourav-gangulys-15-member-list-4330313","keywords":null,"creator":null,"video_url":null,"description":"Sourav Ganguly named his pick for India's ICC World Cup 2023 squad and it had some interesting exclusions.","content":"Former Indian cricket team skipper Sourav Ganguly named his pick for India's ICC World Cup 2023 squad and it had some interesting exclusions. Ganguly decided to not include the trio of Sanju Samson , Prasidh Krishna and Tilak Varma - all three players who were picked for Asia Cup 2023. It included both Shreyas Iyer and KL Rahul who are making a return from injury and were added in the squad for Asia Cup. India will start their World Cup campaign against Australia on October 8 in Chennai. The former India skipper picked Rohit Sharma , Shubman Gill , Virat Kohli , Shreyas Iyer, KL Rahul and Suryakumar Yadav as proper batting options. Ishan Kishan was the only specialist wicket-keeper in the squad with Rahul being the other option in case India want to play an extra batter in their team. Among all-rounders, he picked Hardik Pandya and the left-arm spin duo of Ravindra Jadeja and Axar Patel . Kuldeep Yadav was the other spin option in the squad picked by Ganguly. In the fast bowling department, there were not many surprises as Ganguly went with Jasprit Bumrah , Mohammed Shami, Mohammed Siraj and Shardul Thakur . Ganguly also named three back-up options if any of these players are ruled out for any reason. “If one of the batters gets injured then Tilak Varma can enter, while if the pacer gets injured then it's Prasidh Krishna, while in the case of spinner, Yuzvendra Chahal is the option,\" Ganguly told Star Sports . Sourav Ganguly's picks for India's ICC World Cup 2023 squad: Rohit Sharma, Shubman Gill, Ishan Kishan, Virat Kohli, Shreyas Iyer, KL Rahul, Suryakumar Yadav, Hardik Pandya, Ravindra Jadeja, Axar Patel, Kuldeep Yadav, Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Shardul Thakur.","pubDate":"2023-08-26 02:52:15","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"PCB के निमंत्रण पर बीसीसीआई अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला जाएंगे लाहौर: रिपोर्ट्स","link":"https://sports.ndtv.com/hindi/cricket/bcci-president-roger-binny-and-vice-president-rajeev-shukla-will-visit-lahore-on-the-invitation-of-pcb-reports-4330922#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला ने पाकिस्तान क्रिकेट बोर्ड (पीसीबी) का निमंत्रण स्वीकार कर लिया है और ख़बरें आ रही हैं कि वे वे चार से सात सितंबर तक लाहौर में एशिया कप के कुछ मैच देखेंगे.","content":"PCB के निमंत्रण पर बीसीसीआई अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला जाएंगे लाहौर: रिपोर्ट्स भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला ने पाकिस्तान क्रिकेट बोर्ड (पीसीबी) का निमंत्रण स्वीकार कर लिया है और वे चार से सात सितंबर तक लाहौर में एशिया कप के कुछ मैच देखेंगे. पीसीबी ने बीसीसीआई के सभी प्रमुख पदाधिकारियों को निमंत्रण दिया था और यह समझा जाता है कि अध्यक्ष और उपाध्यक्ष को उन्हें दिए गए निमंत्रण को स्वीकार करने के लिए भारतीय बोर्ड की मंजूरी मिल गई है. पाकिस्तान 30 अगस्त को मुल्तान में एशिया कप के शुरुआती मैच में नेपाल से भिड़ेगा. इस खबर की जानकारी रखने वाले एक सूत्र ने गोपनीयता की शर्त पर कहा, ‘‘बिन्नी, शुक्ला और सचिव जय शाह दो सितंबर को पल्लेकेले (कैंडी) में भारत बनाम पाकिस्तान के प्रमुख मुकाबले के लिए श्रीलंका में होंगे. तीनों अगले दिन भारत वापस आएंगे जिसके बाद बीसीसीआई अध्यक्ष और उपाध्यक्ष वाघा सीमा से लाहौर की यात्रा करेंगे.'' बिन्नी और शुक्ला दोनों को अपनी-अपनी पत्नी के साथ चार सितंबर को लाहौर में पीसीबी के गवर्नर हाउस द्वारा आयोजित होने वाले आधिकारिक रात्रिभोज के लिए आमंत्रित किया गया है. बताया जा रहा है कि ये दोनों अधिकारी पांच सितंबर को अफगानिस्तान बनाम श्रीलंका मैच और इसके अगले दिन पाकिस्तान के सुपर चार चरण के शुरुआती मुकाबले को देखेंगे. बीसीसीआई के वरिष्ठ अधिकारी और कांग्रेस के राज्यसभा सांसद शुक्ला 2004 में पाकिस्तान दौरे पर गयी दल में शामिल थे. सौरव गांगुली के नेतृत्व में इस दौरे पर भारत ने पाकिस्तान के खिलाफ ऐतिहासिक श्रृंखला जीती थी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-26 02:13:28","image_url":"https://c.ndtvimg.com/2023-08/4h2auaa_roger-binny_625x300_26_August_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Asia Cup 2023 पर मंडराया कोविड-19 का ख़तरा, 4 खिलाड़ी हुए पॉजिटिव: रिपोर्ट्स","link":"https://sports.ndtv.com/hindi/cricket/asia-cup-2023-hit-by-covid-scare-after-four-sri-lanka-stars-test-positive-reports-4330886#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप से ठीक 5 दिन पहले टूर्नामेंट पर कोविड-19 का ख़तरा मंडराता हुआ नज़र आ रहा है. दरअसल ख़बरें ये आ रही हैं कि श्रीलंका के 4 खिलाड़ी कोविड पॉजिटिव पाए गए हैं.","content":"Asia Cup 2023 पर मंडराया कोविड-19 का खतरा की शुरूआत 30 अगस्त से हो रही है. पाकिस्तान और श्रीलंका इस टूर्नामेंट के को होस्ट हैं. वो इसलिए क्योंकि बीसीसीआई ने पहले ही ये साफ कर दिया था कि भारतीय टीम टूर्नामेंट के लिए पाकिस्तान का दौरा नहीं करेगी. बता दें कि पहला मुकाबला पाकिस्तान और नेपाल के बीच खेला जाएगा. इसी बीच टूर्नामेंट से ठीक 5 दिन पहले एशिया कप पर कोविड-19 का ख़तरा मंडराता हुआ नज़र आ रहा है. दरअसल ख़बरें ये आ रही हैं कि श्रीलंका के तेज़ गेंदबाज़ दुशमंथा चमीरा और लेग स्पिनर वानिंदु हसरंगा सहित उनके चार क्रिकेटरों का चोटों और कोविड ​​​​-19 के कारण आगामी एशिया कप में खेलना संदिग्ध हो गया है. हाल ही में लंका प्रीमियर लीग (एलपीएल) के दौरान दुशमंथा चमीरा को कंधे में लगी चोट लगी थी, जिसके के कारण चमीरा एशिया कप से बाहर भी हो सकते हैं. इसी बीच की रिपोर्ट के अनुसार, प्रमुख स्पिनर वानिंदु हसरंगा, जिन्हें एलपीएल फाइनल से पहले जांघ में चोट लगी थी, एशिया कप में अपनी टीम के कम से कम दो मैच मिस कर सकते हैं. श्रीलंका अपने एशिया कप अभियान की शुरुआत 31 अगस्त को पल्लेकेले में बांग्लादेश के खिलाफ मैच से करेगा. श्रीलंकाई टीम की मुसीबतें बढ़ती दिखाई दे रही हैं, क्योंकि इनके अलावा बल्लेबाज़ कुसल परेरा और अविष्का फर्नांडो भी कोविड ​​​पॉज़िटिव पाए गए हैं. परेरा और फर्नांडो दोनों फिलहाल निगरानी में हैं और लंकाई टीम में उनका शामिल होना रिकवरी की गति पर निर्भर करेगा. श्रीलंकाई टीम मैनेजमेंट ने कहा कि दोनों LPL 2023 के बाद के समय के दौरान COVOD ​​​​-19 के संपर्क में आ गए. एशिया कप के लिए टीम में शामिल होने के लिए उन्हें नेगेटिव रिपोर्ट के साथ लौटाना होगा. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-26 01:53:55","image_url":"https://c.ndtvimg.com/2023-08/urjkhvco_asia-cup-2023_625x300_26_August_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Coaches draw plenty of positives","link":"https://times-age.co.nz/sports/coaches-happy-with-seasons/","keywords":["Football","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Wairarapa no longer has the giddy heights of Central League Football; however, two clubs have just completed outstanding seasons, both winning promotion from their Capital Leagues. CHRIS COGDALE reviews the efforts of Douglas Villa and Greytown. Douglas Villa Tumu Douglas Villa won promotion to Capital Division One after finishing runners-up in their second year in […]","content":"Tumu Douglas Villa won promotion to Capital Division One after finishing runners-up in their second year in Division Two. Under the astute coaching of the experienced Mark Taylor, Villa finished on 42 points [a total usually good enough to win a league], with 13 wins, three draws, and two losses – the first a 2–0 home defeat to an average Horowhenua Coastal team and the second a narrow 3–2 loss to runaway champions Wellington Marist. Winning promotion was always the goal for Taylor, who was in his first year in charge of the team that finished mid-table in 2022. “I thought, right, we’ll just step things up a wee bit, let’s get a structure and a way we want to play and get some discipline sorted out so that we’re not losing players through suspensions and doing dumb things in key moments and that we’re on top of things and we’ve got a real good work ethic and a group of players that like playing together and that was really important to do that,” Taylor said. “I’m really pleased with the players – on match days, they’ve been magnificent. There are games where we’ve been behind, and we’ve shown character and come back to win and sometimes win easily, and there are other games where we’ve just been dominant from the start to finish, and it’s just a matter of when. and when you’re in those situations, it’s really enjoyable to be part of. “We knew that some of the teams we were playing were the club’s third teams, and we’re a first team, so we had to make sure that we’re not losing to teams that we should be beating, and we’ve managed to set that as a real standard and stuck with it.” Captain Chris Cox, who was in his second season with the team, showed his experience from playing at Central League level and formed a strong centre back combination with Shea Fowler, and remarkably for defenders, neither received a yellow card throughout the season. Josh McMenamin topped the team scoring, with 23 goals, and was second in the division’s golden boot, while Tremaine Rimene-Albrett was third on 15 goals. Taylor also praised assistant coach Riki Riddell, saying he was fantastic with the players and at trainings. “He was exceptional, so it wasn’t just about me; it was Riki as well. He’s the club captain, and he does the committee. He helps out with juniors, his wife is the junior coordinator, and he’s there for all the training sessions. I couldn’t get on Tuesdays until a little bit later, but he would be there doing the warm-ups and doing some of the ball activation exercises and things like that, and he was a vital part of the coaching group.” Stu McLean also assisted in coaching goalkeeping, a problem area for the team early in the season when first-choice Ben Burnley was out with a broken hand. Overall, though, Taylor said the players finished with an appreciation of the need to keep possession and play quicker, and that should hold the team in good stead in their step up to Division One, the third highest level available, and he’s already started planning for next season. “We start looking around for players. We haven’t got a lot of depth in the club underneath the first team,” Taylor explained. “We’ve got lots of guys playing local league football, but we need to have that next step, so there’s a real drive to look at young players who want to become part of it, and what we really push for is to get a real good level of respect and decency about the club so that people coming in know that we’re a football club and we’ve got a real focus on making sure we’re going to be the best that we can. “We got good feedback from the community about what we’ve been doing. We wanted to improve the respectability of the team, and we achieved that.” Taylor concluded that Douglas Villa have a few aspects to look at, including youth and making a women’s team a priority following the success of the Women’s World Cup. A mid-season slump of three consecutive losses hurt Greyfriars Motel Greytown’s Capital Division Three championship prospects, but the team fought back to finish second behind Upper City United and win promotion. Greytown finished with a record of 14 wins, one draw, and three losses, and on 43 points, three shy of Upper Hutt. Greytown started with a hiss and roar, scoring 18 goals in two home games before meeting Upper Hutt on their artificial pitch and drawing 3–3, a result that coach Phil Keinzley believes ultimately cost them the title. “The Upper Hutt game was our first on an artificial away, and when I reflect on the season, if we’d won that game, we would have won the league. We were pretty complacent, and the speed of the artificial, we weren’t ready for it,” said Keinzley, “We were full of our own importance at that stage, and suddenly striking a competitive team on an artificial really brought the truth home.” Playing on artificials became the team’s Achilles heel, with two of their losses to Petone U20s and Wellington United on artificial turfs, where the players’ fitness was tested. “I actually thought we were fitter at the start of the season than any other team in the league, but as the season progressed, we never improved in our fitness, and the other teams did and closed the gap big time there, and we had quite a good run on grass pitches and a number of home games but the warning bells were there that we were going to have trouble on the artificials.” Keinzley said Greytown weren’t helped by having to play on a sub-standard surface at Soldiers Memorial Park, and the difference between the teams in the end was the quality of both the training and playing pitches. “I think the South Wairarapa council should be disgusted with it. “There are no ifs or buts – I felt our pitch was the worst pitch anywhere in the league. “Places like Waterside-Karori and Naenae used to be the bogs, but they’re immaculate now and are like cricket pitches, and the council is not recognising the fact that football participation has grown and there’s too much overuse of the pitches because there is nowhere else. “We never lost at home, and in the same way we struggled with artificials, other teams struggled with the state of our pitch. We trained at Carterton, which was even worse, so we were okay with it.” Overall though, Keinzley was thrilled with the outcome, saying it was better than expected, especially the attack, where former national league player and assistant coach Josh Stevenson netted 33 goals for second in the Golden Boot, while captain Jarrod MacDonald was third with 21 goals. “Josh’s finishing was really good, and his experience was invaluable, and for me personally, it was handy having an assistant coach where you can break up the trainings a bit, so I didn’t need to be at every training.” Looking ahead to next season, Keinzley said there is a solid core of players, and some promising young players, including Liam Andrew, Xavier Marshall-Cox and Charlie Matthews, coming through, but there are areas to improve. “The players have to work on fitness in the off-season, so we’re not starting from scratch again, and we need to have a bit more depth in our midfield and centre back – the axle of the team.”","pubDate":"2023-08-25 22:00:00","image_url":"https://times-age.co.nz/wp-content/uploads/2023/08/502635-1024x683.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"title":"فائٹنگ لیگ آج سے دبئی میں شروع ہو گی","link":"https://pni.net.pk/sports-news/cricket-news/481772/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"دبئی (25 اگست 2023) گزشتہ برس فائٹنگ لیگ کے پہلے ایڈیشن کی کامیابی کے بعد دوسرے ایڈیشن میں سب سے زیادہ 32 امیچر ایم ایم اے فائٹرز شرکت کررہے ہیں ۔ یہ فائٹنگ لیگ(آج) ہفتہ 26 اگست کو ہوگی۔ اس لیگ کی بنیاد شوقیہ فائٹرز [...] The post فائٹنگ لیگ آج سے دبئی میں شروع ہو گی appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"دبئی (25 اگست 2023) گزشتہ برس فائٹنگ لیگ کے پہلے ایڈیشن کی کامیابی کے بعد دوسرے ایڈیشن میں سب سے زیادہ 32 امیچر ایم ایم اے فائٹرز شرکت کررہے ہیں ۔ یہ فائٹنگ لیگ(آج) ہفتہ 26 اگست کو ہوگی۔ اس لیگ کی بنیاد شوقیہ فائٹرز کی صلاحیتوں کو بڑھانے کے لئے رکھی گئی تھی تاکہ ایک جگہ جمع ہوکر قومی اور بین الاقوامی مقابلوں میں شرکت کے لئے خود کو تیار کرسکیں۔ گزشتہ ایڈیشن میں 1500 سے زائد تماشائیوں نے سنسنی خیز مقابلے دیکھے تھے ۔ اس ایونٹ میں فائٹرز سے قیام، کھانے پینے اور مہمان نوازی کی کوئی فیس وصول نہیں کیا جائے گی۔ توقع کی جارہی ہے کہ 2022 کی طرح اس ایک روزہ ایونٹ میں اصل مقابلہ جوخم دلی اور فرینکی مومن کے درمیان ہوگا۔","pubDate":"2023-08-25 21:42:36","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"یوایس ماسٹر ٹی 10 میں مورس ویل یونٹی کی نیو جرسی ٹرائیٹن کے خلاف 55 رنز سے فتح","link":"https://pni.net.pk/sports-news/cricket-news/481766/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"فلوریڈا (25 اگست 2023) نیوزی لینڈ کے کوری اینڈرسن نے مورس ویل یونٹی کی جانب سے شاندار کارکردگی کا مظاہرہ کرتے ہوئے سب سے زیادہ 4 وکٹیں حاصل کیں جس سے ان کی ٹیم نیو جرسی ٹرائیٹن کو 55 رنز سے شکست دینے میں کامیاب [...] The post یوایس ماسٹر ٹی 10 میں مورس ویل یونٹی کی نیو جرسی ٹرائیٹن کے خلاف 55 رنز سے فتح appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"فلوریڈا (25 اگست 2023) نیوزی لینڈ کے کوری اینڈرسن نے مورس ویل یونٹی کی جانب سے شاندار کارکردگی کا مظاہرہ کرتے ہوئے سب سے زیادہ 4 وکٹیں حاصل کیں جس سے ان کی ٹیم نیو جرسی ٹرائیٹن کو 55 رنز سے شکست دینے میں کامیاب ہوئی ۔ کوری اینڈرسن کو میچ کا بہترین کھلاڑی قرار دیا گیا۔مورس ویل یونٹی نے پہلی بیٹنگ کی اوپنرز شی ہان جے سوریا اور راج دیپ دربار نے اننگز کا آغاز کیا اور رنز کے ڈھیر لگادیئے۔ جس میں جے سوریا کا حصہ زیادہ تھا۔ مورس ویل کی 52 رنز پر کوئی کھلاڑی آؤٹ نہ تھا۔ اس سکور پر دربار ریٹائرڈ ہرٹ ہوگئے جس کے بعد جے سوریا بھی 34 رنز بناکر پویلین لوٹ گئے۔ اس کے بعد اوبس پینار اور کوری اینڈرسن کی جوڑی نے بیٹنگ کی ذمہ داری سنبھالی۔ انہوں نے اچھی رفتار سے رنز بنائے اور مقررہ 10 اووز میں یونٹی کا اسکور ایک وکٹ کے نقصان پر 124 رنز پر پہنچادیا ۔ کوری اینڈرسن نے 4 چھکے اور 2 چوکے جبکہ پینار نے 3 چھکے اور 2 چوکے لگائے۔جواب میں ٹرائیٹن کا آغاز سست تھا پہلے دو اوورز میں دو وکٹیں گنوا دیں۔ جیسی رائیڈر کو سری سانتھ نے صفر پر آؤٹ کیا جس کے بعد پیٹر ٹریگو 4 رنز بنا کر آؤٹ ہوئے۔ پہلے دو اوورز کے اختتام پر ٹرائیٹن کا سکور 2 وکٹوں کے نقصان پر 9 رنز تھا۔ اس مرحلے پر یوسف پٹھان اور کیمرون ڈیلپورٹ کھیلنے آئے اور دونوں نے اگلے چند اوورز میں وکٹیں نہ کھوتے ہوئے ٹیم کی پوزیشن مستحکم کی اور 2 وکٹوں کے نقصان پر 42 رنز پر پہنچادیا ۔ آخری پانچ اوورز میں ٹرائیٹن کو جیت کے لیے مزید 83 رنز درکار تھے۔ٹریٹن نے جلد بازی میں مزید تین وکٹیں کھودیں اور وہ مقررہ 10 اووز میں 7 وکٹوں کے نقصان پر صرف 69 رنز بناسکی اور یوں یہ میچ 55 رنز سے ہارگئی۔","pubDate":"2023-08-25 21:35:32","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"نیو یارک واریئرز کی چوتھی فتح، پوائنٹس ٹیبل پر پہلی پوزیشن مستحکم","link":"https://pni.net.pk/sports-news/cricket-news/481758/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"فلوریڈا (25 اگست 2023)یو ایس ماسٹرز ٹی 10 لیگ میں نیو یارک واریئرز نے ٹیکساس چارجرز کو 6 رنز سے شکست دیکر مقابلے میں چوتھی فتح حاصل کرلی۔ نیو یارک واریئرز نے مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز بنائے اور [...] The post نیو یارک واریئرز کی چوتھی فتح، پوائنٹس ٹیبل پر پہلی پوزیشن مستحکم appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"فلوریڈا (25 اگست 2023)یو ایس ماسٹرز ٹی 10 لیگ میں نیو یارک واریئرز نے ٹیکساس چارجرز کو 6 رنز سے شکست دیکر مقابلے میں چوتھی فتح حاصل کرلی۔ نیو یارک واریئرز نے مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز بنائے اور چارجرز کو 8 وکٹوں کے نقصان پر 109 رنز تک محدود کر دیا۔عبدالرحمٰن نے پہلے ہی اوور میں محمد حفیظ اور اوپل تھرنگا دونوں کو آؤٹ کرکے واریئرز کا شاندار آغاز کیا۔ اس کے بعد کپتان بین ڈنک اور سری لنکن آل راؤنڈر تھیسارا پریرا نے بالترتیب 16 اور 19 رنز بنائے۔ دونوں نے اچھی کارکردگی دکھائی تاہم وہ لمبی اننگز نہیں کھیل سکے کیونکہ چارجز 6.2 میں 71 رنز پر جدوجہد کررہے تھے اس سکور پر ان کے 7 وکٹیں گرچکی تھیں۔ تاہم فل مسٹرڈ اور سہیل تنویر نے ناقابل بیان کارکردگی دکھاتے ٹیکساس چارجرز کو قریب پہنچادیا تھا۔ میچ آخری بال تک جاری رہا ۔ اس وقت ٹیکساس کو فتح کے لئے 7 رنز درکار تھے تاہم سہیل تنویر لانگ آن باؤنڈری پر کیچ آؤٹ ہو گئے یوں نیویارک واریئرز نے 6 رنز سے میچ جیت لیا۔ اس سے قبل ٹیکساس چارجرز نے ٹاس جیت کر پہلے بولنگ کا فیصلہ کیا۔ سہیل تنویر نے 7 ویں اوور میں 2 وکٹیں حاصل کیں اس وقت وارئیرز کا سکور 5 وکٹوں کے نقصان پر 58 رنز تھا ۔ اس کے بعد کپتان مصباح الحق اور عبدالرزاق نے اننگز کی آخری 21 گیندوں پر 57 رنز بنائے۔عبدالرزاق نے 14 گیندوں پر 35 رنز کی ناقابل شکست اننگز کھیلی جس میں 4 چھکے اور ایک چوکا شامل تھا اس سے ٹیم کا سکور مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز رہا۔","pubDate":"2023-08-25 21:28:42","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"Asia Cup 2023: કોહલીની બેટિંગ પોઝિશન બદલવાની જરૂર, આ દિગ્ગજ ખેલાડીએ શા માટે આપી આવી સલાહ","link":"https://gujarati.abplive.com/sports/cricket/asia-cup-2023-ab-de-villiers-said-virat-kohli-perfect-for-number-4-batting-855013","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"India vs Pakistan: એશિયા કપમાં ભારતની પ્રથમ મેચ પાકિસ્તાન સાથે છે. આ મેચ પહેલા એબી ડી વિલિયર્સે વિરાટ કોહલી માટે એક નિવેદન આપ્યું છે. ભારતીય ટીમે એશિયા કપ 2023 માટે પ્રેક્ટિસ શરૂ કરી દીધી છે. કેપ્ટન રોહિત શર્મા અને વિરાટ કોહલી સહિત તમામ ખેલાડીઓ મેદાનમાં ઉતર્યા છે. દિગ્ગજ ક્રિકેટર એબી ડી વિલિયર્સે કોહલી પર પ્રતિક્રિયા આપી છે. તેનું માનવું છે કે કોહલીએ ચોથા નંબર પર બેટિંગ કરવી જોઈએ. તે આ પદ માટે પરફેક્ટ છે. આ સાથે તેઓ મિડલ ઓર્ડરને પણ સપોર્ટ કરી શકશે. ઈન્ડિયા ટુડેના એક સમાચાર અનુસાર ડી વિલિયર્સે કોહલીનો ઉલ્લેખ કર્યો અને કહ્યું, “મને લાગે છે કે તે નંબર 4 માટે પરફેક્ટ છે. તેઓ કોઈપણ જવાબદારી સારી રીતે નિભાવી શકે છે. મને ખબર નથી કે તે આ નંબર પર રમવા માંગશે કે નહીં. પરંતુ ટીમ માટે  જવાબદારી નિભાવી મહત્વપૂર્ણ વાત હોઇ શકે છે. તમને જે પણ જવાબદારી મળે તેને સારી રીતે નિભાવવી જોઇએ. ભારત-પાકિસ્તાન મેચનો ઉલ્લેખ કરતા ડી વિલિયર્સે કહ્યું કે, ભારત અને પાકિસ્તાન આ વખતે એશિયા કપ જીતવાના પ્રબળ દાવેદાર છે. જો કે શ્રીલંકામાં પણ મોટી ટીમોને માત આપવાની  ક્ષમતા ધરાવે  છે. નોંધપાત્ર વાત એ છે કે, કોહલીએ નંબર 3 પર બેટિંગ કરતા ODI ફોર્મેટમાં સૌથી વધુ મેચ રમી છે. કોહલીએ આ બેટિંગ પોઝીશન પર 210 મેચ રમી છે. આ દરમિયાન 10777 રન બનાવ્યા છે. કોહલીએ આ ફોર્મેટમાં 39 સદી અને 55 અડધી સદી ફટકારી છે. ચોથા નંબર પર બેટિંગ કરતા તેણે 39 મેચ રમી છે. આ દરમિયાન 1767 રન બનાવ્યા છે. કોહલીએ આ બેટિંગ પોઝિશન પર 7 સદી અને 8 અડધી સદી ફટકારી છે. એશિયા કપ માટેની ભારતની ટીમ:- રોહિત શર્મા (કેપ્ટન), શુભમન ગિલ, વિરાટ કોહલી, શ્રેયસ ઐયર, સૂર્યકુમાર યાદવ, તિલક વર્મા, કેએલ રાહુલ, ઈશાન કિશન, હાર્દિક પંડ્યા (વાઈસ-કેપ્ટન), રવિન્દ્ર જાડેજા, અક્ષર પટેલ, શાર્દુલ ઠાકુર, જસપ્રીત બુમરાહ, મોહમ્મદ શમી, મોહમ્મદ સિરાજ, કુલદીપ યાદવ, પ્રખ્યાત કૃષ્ણાનો સમાવેશ થાયછે.                                           ","content":"India vs Pakistan: એશિયા કપમાં ભારતની પ્રથમ મેચ પાકિસ્તાન સાથે છે. આ મેચ પહેલા એબી ડી વિલિયર્સે વિરાટ કોહલી માટે એક નિવેદન આપ્યું છે. ભારતીય ટીમે એશિયા કપ 2023 માટે પ્રેક્ટિસ શરૂ કરી દીધી છે. કેપ્ટન રોહિત શર્મા અને વિરાટ કોહલી સહિત તમામ ખેલાડીઓ મેદાનમાં ઉતર્યા છે. દિગ્ગજ ક્રિકેટર એબી ડી વિલિયર્સે કોહલી પર પ્રતિક્રિયા આપી છે. તેનું માનવું છે કે કોહલીએ ચોથા નંબર પર બેટિંગ કરવી જોઈએ. તે આ પદ માટે પરફેક્ટ છે. આ સાથે તેઓ મિડલ ઓર્ડરને પણ સપોર્ટ કરી શકશે. ઈન્ડિયા ટુડેના એક સમાચાર અનુસાર ડી વિલિયર્સે કોહલીનો ઉલ્લેખ કર્યો અને કહ્યું, “મને લાગે છે કે તે નંબર 4 માટે પરફેક્ટ છે. તેઓ કોઈપણ જવાબદારી સારી રીતે નિભાવી શકે છે. મને ખબર નથી કે તે આ નંબર પર રમવા માંગશે કે નહીં. પરંતુ ટીમ માટે જવાબદારી નિભાવી મહત્વપૂર્ણ વાત હોઇ શકે છે. તમને જે પણ જવાબદારી મળે તેને સારી રીતે નિભાવવી જોઇએ. ભારત-પાકિસ્તાન મેચનો ઉલ્લેખ કરતા ડી વિલિયર્સે કહ્યું કે, ભારત અને પાકિસ્તાન આ વખતે એશિયા કપ જીતવાના પ્રબળ દાવેદાર છે. જો કે શ્રીલંકામાં પણ મોટી ટીમોને માત આપવાની ક્ષમતા ધરાવે છે. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); નોંધપાત્ર વાત એ છે કે, કોહલીએ નંબર 3 પર બેટિંગ કરતા ODI ફોર્મેટમાં સૌથી વધુ મેચ રમી છે. કોહલીએ આ બેટિંગ પોઝીશન પર 210 મેચ રમી છે. આ દરમિયાન 10777 રન બનાવ્યા છે. કોહલીએ આ ફોર્મેટમાં 39 સદી અને 55 અડધી સદી ફટકારી છે. ચોથા નંબર પર બેટિંગ કરતા તેણે 39 મેચ રમી છે. આ દરમિયાન 1767 રન બનાવ્યા છે. કોહલીએ આ બેટિંગ પોઝિશન પર 7 સદી અને 8 અડધી સદી ફટકારી છે. એશિયા કપ માટેની ભારતની ટીમ:- રોહિત શર્મા (કેપ્ટન), શુભમન ગિલ, વિરાટ કોહલી, શ્રેયસ ઐયર, સૂર્યકુમાર યાદવ, તિલક વર્મા, કેએલ રાહુલ, ઈશાન કિશન, હાર્દિક પંડ્યા (વાઈસ-કેપ્ટન), રવિન્દ્ર જાડેજા, અક્ષર પટેલ, શાર્દુલ ઠાકુર, જસપ્રીત બુમરાહ, મોહમ્મદ શમી, મોહમ્મદ સિરાજ, કુલદીપ યાદવ, પ્રખ્યાત કૃષ્ણાનો સમાવેશ થાયછે.","pubDate":"2023-08-26 05:32:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/26/d4f3f55f78143b946ec0fe6425fdf16b169302786190381_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"title":"\"Hope I Don't Get A Heart Attack...\": Pakistan Star's Comments Go Viral","link":"https://sports.ndtv.com/cricket/hope-i-dont-get-a-heart-attack-pakistan-star-naseem-shahs-big-statement-after-last-over-heroics-vs-afghanistan-4331034","keywords":null,"creator":null,"video_url":null,"description":"Number ten batsman Naseem Shah hit a boundary off the penultimate delivery to give Pakistan a dramatic one-wicket win over a luckless Afghanistan in the second ODI at Hambantota on Thursday.","content":"It was a match that was not for the faint-hearted. With only one wicket left, Pakistan made a dash in the last few balls to defeat Afghanistan by the narrowest of margins in the second ODI in Sri Lanka. Number ten batsman Naseem Shah hit a boundary off the penultimate delivery to give Pakistan a dramatic one-wicket win over a luckless Afghanistan in the second ODI at Hambantota on Thursday. The 20-year-old miscued a boundary off fast bowler Fazalhaq Farooqi and ran jubilantly towards the dressing room as Pakistan scored 11 off the final over to finish with 302-9 in 49.5 overs. The victory gave Pakistan an unassailable 2-0 lead in the three-match series with the last game in Colombo on Saturday. \"I would like to say that this year, with the chances I have got at the fag end of the innings, I hope I don't get a heart attack someday. I am very thankful to Allah and his grace as I always try to believe in myself in situations like that,\" said Shah in a video posted by Pakistan Cricket Board (PCB) . The quote has now been widely shared on social media. \"Let me just say that this year, the sort of situations I have had to face whilst coming into play towards the end of the innings, God Forbid I hope I don't get a heart-attack!\": Naseem Shah regarding his innings in the final over against Afghanistan in the 2nd ODI #AFGvPAK pic.twitter.com/eiysupkrse \"When I went inside, I believed in Shadab. I believed that we will finish the match. But when Shadab got out, I felt that the situation is now all mine. The bowlers are the same and I had the trust in myself to get the team over the line.\" Shah is happy that he has been taking Pakistan over the line on a quite a few occasions. \"I will say that it is a very happy thing and we needed this win a lot. I believed that I can do it.\" \"I try to be prepared for such situations as I practice a lot of batting in the nets. I know that my turn is coming when all the breathing lines stop. So I tried again to make the team win and did it. I am just trying to earn respect and rest is all upto almighty,\" he added. With AFP inputs","pubDate":"2023-08-26 03:48:36","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"Post Famous Interview With Tom Alter, Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home","link":"https://thesportsrush.com/cricket-news-post-famous-interview-with-tom-alter-sachin-tendulkar-was-fed-up-of-continuously-ringing-landline-phone-at-home/","keywords":["Cricket","Sachin Tendulkar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"For someone with an illustrious career spanning over 24 years, for someone who started his first-class career at the age of 15 and went on to become a demigod for millions, there can surely be no dearth of stories and anecdotes related to him which would make one go “Wow!!”. Legendary Indian batter Sachin Tendulkar,… The post Post Famous Interview With Tom Alter, Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home appeared first on The SportsRush.","content":"For someone with an illustrious career spanning over 24 years, for someone who started his first-class career at the age of 15 and went on to become a demigod for millions, there can surely be and related to him which would make one go “Wow!!”. Legendary Indian batter , who had emerged to be the face of India post its economic liberalization in early 1990s, can narrate aplenty ones from his days as a young prodigy itself. Advertisement The Master Blaster, who had a knack of playing and used to hardly get fed up of batting for long hours as a teenager, had experienced that emotion with respect to his landline phone at home. Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home Former sports journalist-cum-actor late Tom Alter was the first person to have recorded Tendulkar’s video interview for the press when the latter was just 15 years of age. The interview was for the newspaper, and had taken place on January 19, 1989 at Hindi Gymkhana Ground, Mumbai. Just over two months ago, Tendulkar had made his maiden Ranji Trophy appearance for Bombay, and had become the youngest Indian to score a century on first-class debut. Advertisement Tendulkar, who had become an instant hit in the Indian cricketing fraternity, had tasted the unwarranted side of fame post the interview. Not only him, but his parents also had to face the ordeal, as his home landline would just not stop ringing! The fact was revealed by veteran Indian broadcaster during an interaction with Gaurav Kapur on his podcast named ‘ ‘. Bhogle stated how well-acquainted he was with Tendulkar and his family right since the days the Mumbai batter was just 14-15. Days after the Tom Alter interview, Bhogle revealed that he had been invited to Tendulkar’s house. During his meeting with him that day, he has asked him the reason why he couldn’t receive any telephone calls from people. “I was invited to his house once, and had to ask Sachin [Tendulkar] why is it that you can’t take telephone calls from anybody? And he said, ‘Now see what happens’. And he put his phone down, pre-mobile era, he put his phone down and it started to ring, because his father’s number was in the telephone directory.” Bhogle mentioned that when someone would open the telephone directory back in the day, he/she could easily find the phone number of Ramesh Tendulkar (Sachin’s father), which, in fact, was the landline number of his house! Thus, the family members had to always keep the phone off-the-hook, because the moment it was put on, someone would definitely call. Such was the fan following of a 15-year-old! Advertisement In the above video, Bhogle recalled writing a piece on Tendulkar (after interviewing him) for a sports magazine in Kolkata before the latter’s Ranji Trophy debut and after his interview with Tom Alter. Although inadvertently, it is an inaccurate claim as mentioned above. Sachin Tendulkar’s Confidence Exhibited In Interview With Tom Alter Even though the entire video interview is not available in public domain, an ever-confident Tendulkar can be seen in a from the same. When asked if he is tired answering questions and giving interviews already, Sachin remarked, “I think this is just the start,” to which Tom added, “Yeah, it is a part of being a cricket star.” He might have come across a tad overconfident back then, but Tendulkar had admitted to be ever-ready to face the lethal fast bowling duo of Malcolm Marshall and Curtley Ambrose had be been picked for India’s tour of West Indies 1988/89. Later in the clip, he even had remarked how he had no trouble facing the in-swingers and out-swingers bowled by former India captain in the nets at the CCI (Cricket Club of India). In fact, Kapil had once remarked how with the way Tendulkar had faced him for the first time. Advertisement","pubDate":"2023-08-26 03:00:59","image_url":null,"source_id":"thesportsrush","source_priority":4166,"country":["united states of america","australia","india","united kingdom"],"category":["sports"],"language":"english"},{"title":"India's WC Squad: No Tilak, Sanju And Krishna In Ganguly's 15-Member List","link":"https://sports.ndtv.com/cricket/indias-icc-world-cup-2023-squad-no-sanju-samson-tilak-varma-and-prasidh-krishna-in-sourav-gangulys-15-member-list-4330313","keywords":null,"creator":null,"video_url":null,"description":"Sourav Ganguly named his pick for India's ICC World Cup 2023 squad and it had some interesting exclusions.","content":"Former Indian cricket team skipper Sourav Ganguly named his pick for India's ICC World Cup 2023 squad and it had some interesting exclusions. Ganguly decided to not include the trio of Sanju Samson , Prasidh Krishna and Tilak Varma - all three players who were picked for Asia Cup 2023. It included both Shreyas Iyer and KL Rahul who are making a return from injury and were added in the squad for Asia Cup. India will start their World Cup campaign against Australia on October 8 in Chennai. The former India skipper picked Rohit Sharma , Shubman Gill , Virat Kohli , Shreyas Iyer, KL Rahul and Suryakumar Yadav as proper batting options. Ishan Kishan was the only specialist wicket-keeper in the squad with Rahul being the other option in case India want to play an extra batter in their team. Among all-rounders, he picked Hardik Pandya and the left-arm spin duo of Ravindra Jadeja and Axar Patel . Kuldeep Yadav was the other spin option in the squad picked by Ganguly. In the fast bowling department, there were not many surprises as Ganguly went with Jasprit Bumrah , Mohammed Shami, Mohammed Siraj and Shardul Thakur . Ganguly also named three back-up options if any of these players are ruled out for any reason. “If one of the batters gets injured then Tilak Varma can enter, while if the pacer gets injured then it's Prasidh Krishna, while in the case of spinner, Yuzvendra Chahal is the option,\" Ganguly told Star Sports . Sourav Ganguly's picks for India's ICC World Cup 2023 squad: Rohit Sharma, Shubman Gill, Ishan Kishan, Virat Kohli, Shreyas Iyer, KL Rahul, Suryakumar Yadav, Hardik Pandya, Ravindra Jadeja, Axar Patel, Kuldeep Yadav, Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Shardul Thakur.","pubDate":"2023-08-26 02:52:15","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"PCB के निमंत्रण पर बीसीसीआई अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला जाएंगे लाहौर: रिपोर्ट्स","link":"https://sports.ndtv.com/hindi/cricket/bcci-president-roger-binny-and-vice-president-rajeev-shukla-will-visit-lahore-on-the-invitation-of-pcb-reports-4330922#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला ने पाकिस्तान क्रिकेट बोर्ड (पीसीबी) का निमंत्रण स्वीकार कर लिया है और ख़बरें आ रही हैं कि वे वे चार से सात सितंबर तक लाहौर में एशिया कप के कुछ मैच देखेंगे.","content":"PCB के निमंत्रण पर बीसीसीआई अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला जाएंगे लाहौर: रिपोर्ट्स भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला ने पाकिस्तान क्रिकेट बोर्ड (पीसीबी) का निमंत्रण स्वीकार कर लिया है और वे चार से सात सितंबर तक लाहौर में एशिया कप के कुछ मैच देखेंगे. पीसीबी ने बीसीसीआई के सभी प्रमुख पदाधिकारियों को निमंत्रण दिया था और यह समझा जाता है कि अध्यक्ष और उपाध्यक्ष को उन्हें दिए गए निमंत्रण को स्वीकार करने के लिए भारतीय बोर्ड की मंजूरी मिल गई है. पाकिस्तान 30 अगस्त को मुल्तान में एशिया कप के शुरुआती मैच में नेपाल से भिड़ेगा. इस खबर की जानकारी रखने वाले एक सूत्र ने गोपनीयता की शर्त पर कहा, ‘‘बिन्नी, शुक्ला और सचिव जय शाह दो सितंबर को पल्लेकेले (कैंडी) में भारत बनाम पाकिस्तान के प्रमुख मुकाबले के लिए श्रीलंका में होंगे. तीनों अगले दिन भारत वापस आएंगे जिसके बाद बीसीसीआई अध्यक्ष और उपाध्यक्ष वाघा सीमा से लाहौर की यात्रा करेंगे.'' बिन्नी और शुक्ला दोनों को अपनी-अपनी पत्नी के साथ चार सितंबर को लाहौर में पीसीबी के गवर्नर हाउस द्वारा आयोजित होने वाले आधिकारिक रात्रिभोज के लिए आमंत्रित किया गया है. बताया जा रहा है कि ये दोनों अधिकारी पांच सितंबर को अफगानिस्तान बनाम श्रीलंका मैच और इसके अगले दिन पाकिस्तान के सुपर चार चरण के शुरुआती मुकाबले को देखेंगे. बीसीसीआई के वरिष्ठ अधिकारी और कांग्रेस के राज्यसभा सांसद शुक्ला 2004 में पाकिस्तान दौरे पर गयी दल में शामिल थे. सौरव गांगुली के नेतृत्व में इस दौरे पर भारत ने पाकिस्तान के खिलाफ ऐतिहासिक श्रृंखला जीती थी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-26 02:13:28","image_url":"https://c.ndtvimg.com/2023-08/4h2auaa_roger-binny_625x300_26_August_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Asia Cup 2023 पर मंडराया कोविड-19 का ख़तरा, 4 खिलाड़ी हुए पॉजिटिव: रिपोर्ट्स","link":"https://sports.ndtv.com/hindi/cricket/asia-cup-2023-hit-by-covid-scare-after-four-sri-lanka-stars-test-positive-reports-4330886#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप से ठीक 5 दिन पहले टूर्नामेंट पर कोविड-19 का ख़तरा मंडराता हुआ नज़र आ रहा है. दरअसल ख़बरें ये आ रही हैं कि श्रीलंका के 4 खिलाड़ी कोविड पॉजिटिव पाए गए हैं.","content":"Asia Cup 2023 पर मंडराया कोविड-19 का खतरा की शुरूआत 30 अगस्त से हो रही है. पाकिस्तान और श्रीलंका इस टूर्नामेंट के को होस्ट हैं. वो इसलिए क्योंकि बीसीसीआई ने पहले ही ये साफ कर दिया था कि भारतीय टीम टूर्नामेंट के लिए पाकिस्तान का दौरा नहीं करेगी. बता दें कि पहला मुकाबला पाकिस्तान और नेपाल के बीच खेला जाएगा. इसी बीच टूर्नामेंट से ठीक 5 दिन पहले एशिया कप पर कोविड-19 का ख़तरा मंडराता हुआ नज़र आ रहा है. दरअसल ख़बरें ये आ रही हैं कि श्रीलंका के तेज़ गेंदबाज़ दुशमंथा चमीरा और लेग स्पिनर वानिंदु हसरंगा सहित उनके चार क्रिकेटरों का चोटों और कोविड ​​​​-19 के कारण आगामी एशिया कप में खेलना संदिग्ध हो गया है. हाल ही में लंका प्रीमियर लीग (एलपीएल) के दौरान दुशमंथा चमीरा को कंधे में लगी चोट लगी थी, जिसके के कारण चमीरा एशिया कप से बाहर भी हो सकते हैं. इसी बीच की रिपोर्ट के अनुसार, प्रमुख स्पिनर वानिंदु हसरंगा, जिन्हें एलपीएल फाइनल से पहले जांघ में चोट लगी थी, एशिया कप में अपनी टीम के कम से कम दो मैच मिस कर सकते हैं. श्रीलंका अपने एशिया कप अभियान की शुरुआत 31 अगस्त को पल्लेकेले में बांग्लादेश के खिलाफ मैच से करेगा. श्रीलंकाई टीम की मुसीबतें बढ़ती दिखाई दे रही हैं, क्योंकि इनके अलावा बल्लेबाज़ कुसल परेरा और अविष्का फर्नांडो भी कोविड ​​​पॉज़िटिव पाए गए हैं. परेरा और फर्नांडो दोनों फिलहाल निगरानी में हैं और लंकाई टीम में उनका शामिल होना रिकवरी की गति पर निर्भर करेगा. श्रीलंकाई टीम मैनेजमेंट ने कहा कि दोनों LPL 2023 के बाद के समय के दौरान COVOD ​​​​-19 के संपर्क में आ गए. एशिया कप के लिए टीम में शामिल होने के लिए उन्हें नेगेटिव रिपोर्ट के साथ लौटाना होगा. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-26 01:53:55","image_url":"https://c.ndtvimg.com/2023-08/urjkhvco_asia-cup-2023_625x300_26_August_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Coaches draw plenty of positives","link":"https://times-age.co.nz/sports/coaches-happy-with-seasons/","keywords":["Football","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Wairarapa no longer has the giddy heights of Central League Football; however, two clubs have just completed outstanding seasons, both winning promotion from their Capital Leagues. CHRIS COGDALE reviews the efforts of Douglas Villa and Greytown. Douglas Villa Tumu Douglas Villa won promotion to Capital Division One after finishing runners-up in their second year in […]","content":"Tumu Douglas Villa won promotion to Capital Division One after finishing runners-up in their second year in Division Two. Under the astute coaching of the experienced Mark Taylor, Villa finished on 42 points [a total usually good enough to win a league], with 13 wins, three draws, and two losses – the first a 2–0 home defeat to an average Horowhenua Coastal team and the second a narrow 3–2 loss to runaway champions Wellington Marist. Winning promotion was always the goal for Taylor, who was in his first year in charge of the team that finished mid-table in 2022. “I thought, right, we’ll just step things up a wee bit, let’s get a structure and a way we want to play and get some discipline sorted out so that we’re not losing players through suspensions and doing dumb things in key moments and that we’re on top of things and we’ve got a real good work ethic and a group of players that like playing together and that was really important to do that,” Taylor said. “I’m really pleased with the players – on match days, they’ve been magnificent. There are games where we’ve been behind, and we’ve shown character and come back to win and sometimes win easily, and there are other games where we’ve just been dominant from the start to finish, and it’s just a matter of when. and when you’re in those situations, it’s really enjoyable to be part of. “We knew that some of the teams we were playing were the club’s third teams, and we’re a first team, so we had to make sure that we’re not losing to teams that we should be beating, and we’ve managed to set that as a real standard and stuck with it.” Captain Chris Cox, who was in his second season with the team, showed his experience from playing at Central League level and formed a strong centre back combination with Shea Fowler, and remarkably for defenders, neither received a yellow card throughout the season. Josh McMenamin topped the team scoring, with 23 goals, and was second in the division’s golden boot, while Tremaine Rimene-Albrett was third on 15 goals. Taylor also praised assistant coach Riki Riddell, saying he was fantastic with the players and at trainings. “He was exceptional, so it wasn’t just about me; it was Riki as well. He’s the club captain, and he does the committee. He helps out with juniors, his wife is the junior coordinator, and he’s there for all the training sessions. I couldn’t get on Tuesdays until a little bit later, but he would be there doing the warm-ups and doing some of the ball activation exercises and things like that, and he was a vital part of the coaching group.” Stu McLean also assisted in coaching goalkeeping, a problem area for the team early in the season when first-choice Ben Burnley was out with a broken hand. Overall, though, Taylor said the players finished with an appreciation of the need to keep possession and play quicker, and that should hold the team in good stead in their step up to Division One, the third highest level available, and he’s already started planning for next season. “We start looking around for players. We haven’t got a lot of depth in the club underneath the first team,” Taylor explained. “We’ve got lots of guys playing local league football, but we need to have that next step, so there’s a real drive to look at young players who want to become part of it, and what we really push for is to get a real good level of respect and decency about the club so that people coming in know that we’re a football club and we’ve got a real focus on making sure we’re going to be the best that we can. “We got good feedback from the community about what we’ve been doing. We wanted to improve the respectability of the team, and we achieved that.” Taylor concluded that Douglas Villa have a few aspects to look at, including youth and making a women’s team a priority following the success of the Women’s World Cup. A mid-season slump of three consecutive losses hurt Greyfriars Motel Greytown’s Capital Division Three championship prospects, but the team fought back to finish second behind Upper City United and win promotion. Greytown finished with a record of 14 wins, one draw, and three losses, and on 43 points, three shy of Upper Hutt. Greytown started with a hiss and roar, scoring 18 goals in two home games before meeting Upper Hutt on their artificial pitch and drawing 3–3, a result that coach Phil Keinzley believes ultimately cost them the title. “The Upper Hutt game was our first on an artificial away, and when I reflect on the season, if we’d won that game, we would have won the league. We were pretty complacent, and the speed of the artificial, we weren’t ready for it,” said Keinzley, “We were full of our own importance at that stage, and suddenly striking a competitive team on an artificial really brought the truth home.” Playing on artificials became the team’s Achilles heel, with two of their losses to Petone U20s and Wellington United on artificial turfs, where the players’ fitness was tested. “I actually thought we were fitter at the start of the season than any other team in the league, but as the season progressed, we never improved in our fitness, and the other teams did and closed the gap big time there, and we had quite a good run on grass pitches and a number of home games but the warning bells were there that we were going to have trouble on the artificials.” Keinzley said Greytown weren’t helped by having to play on a sub-standard surface at Soldiers Memorial Park, and the difference between the teams in the end was the quality of both the training and playing pitches. “I think the South Wairarapa council should be disgusted with it. “There are no ifs or buts – I felt our pitch was the worst pitch anywhere in the league. “Places like Waterside-Karori and Naenae used to be the bogs, but they’re immaculate now and are like cricket pitches, and the council is not recognising the fact that football participation has grown and there’s too much overuse of the pitches because there is nowhere else. “We never lost at home, and in the same way we struggled with artificials, other teams struggled with the state of our pitch. We trained at Carterton, which was even worse, so we were okay with it.” Overall though, Keinzley was thrilled with the outcome, saying it was better than expected, especially the attack, where former national league player and assistant coach Josh Stevenson netted 33 goals for second in the Golden Boot, while captain Jarrod MacDonald was third with 21 goals. “Josh’s finishing was really good, and his experience was invaluable, and for me personally, it was handy having an assistant coach where you can break up the trainings a bit, so I didn’t need to be at every training.” Looking ahead to next season, Keinzley said there is a solid core of players, and some promising young players, including Liam Andrew, Xavier Marshall-Cox and Charlie Matthews, coming through, but there are areas to improve. “The players have to work on fitness in the off-season, so we’re not starting from scratch again, and we need to have a bit more depth in our midfield and centre back – the axle of the team.”","pubDate":"2023-08-25 22:00:00","image_url":"https://times-age.co.nz/wp-content/uploads/2023/08/502635-1024x683.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"title":"فائٹنگ لیگ آج سے دبئی میں شروع ہو گی","link":"https://pni.net.pk/sports-news/cricket-news/481772/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"دبئی (25 اگست 2023) گزشتہ برس فائٹنگ لیگ کے پہلے ایڈیشن کی کامیابی کے بعد دوسرے ایڈیشن میں سب سے زیادہ 32 امیچر ایم ایم اے فائٹرز شرکت کررہے ہیں ۔ یہ فائٹنگ لیگ(آج) ہفتہ 26 اگست کو ہوگی۔ اس لیگ کی بنیاد شوقیہ فائٹرز [...] The post فائٹنگ لیگ آج سے دبئی میں شروع ہو گی appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"دبئی (25 اگست 2023) گزشتہ برس فائٹنگ لیگ کے پہلے ایڈیشن کی کامیابی کے بعد دوسرے ایڈیشن میں سب سے زیادہ 32 امیچر ایم ایم اے فائٹرز شرکت کررہے ہیں ۔ یہ فائٹنگ لیگ(آج) ہفتہ 26 اگست کو ہوگی۔ اس لیگ کی بنیاد شوقیہ فائٹرز کی صلاحیتوں کو بڑھانے کے لئے رکھی گئی تھی تاکہ ایک جگہ جمع ہوکر قومی اور بین الاقوامی مقابلوں میں شرکت کے لئے خود کو تیار کرسکیں۔ گزشتہ ایڈیشن میں 1500 سے زائد تماشائیوں نے سنسنی خیز مقابلے دیکھے تھے ۔ اس ایونٹ میں فائٹرز سے قیام، کھانے پینے اور مہمان نوازی کی کوئی فیس وصول نہیں کیا جائے گی۔ توقع کی جارہی ہے کہ 2022 کی طرح اس ایک روزہ ایونٹ میں اصل مقابلہ جوخم دلی اور فرینکی مومن کے درمیان ہوگا۔","pubDate":"2023-08-25 21:42:36","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"یوایس ماسٹر ٹی 10 میں مورس ویل یونٹی کی نیو جرسی ٹرائیٹن کے خلاف 55 رنز سے فتح","link":"https://pni.net.pk/sports-news/cricket-news/481766/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"فلوریڈا (25 اگست 2023) نیوزی لینڈ کے کوری اینڈرسن نے مورس ویل یونٹی کی جانب سے شاندار کارکردگی کا مظاہرہ کرتے ہوئے سب سے زیادہ 4 وکٹیں حاصل کیں جس سے ان کی ٹیم نیو جرسی ٹرائیٹن کو 55 رنز سے شکست دینے میں کامیاب [...] The post یوایس ماسٹر ٹی 10 میں مورس ویل یونٹی کی نیو جرسی ٹرائیٹن کے خلاف 55 رنز سے فتح appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"فلوریڈا (25 اگست 2023) نیوزی لینڈ کے کوری اینڈرسن نے مورس ویل یونٹی کی جانب سے شاندار کارکردگی کا مظاہرہ کرتے ہوئے سب سے زیادہ 4 وکٹیں حاصل کیں جس سے ان کی ٹیم نیو جرسی ٹرائیٹن کو 55 رنز سے شکست دینے میں کامیاب ہوئی ۔ کوری اینڈرسن کو میچ کا بہترین کھلاڑی قرار دیا گیا۔مورس ویل یونٹی نے پہلی بیٹنگ کی اوپنرز شی ہان جے سوریا اور راج دیپ دربار نے اننگز کا آغاز کیا اور رنز کے ڈھیر لگادیئے۔ جس میں جے سوریا کا حصہ زیادہ تھا۔ مورس ویل کی 52 رنز پر کوئی کھلاڑی آؤٹ نہ تھا۔ اس سکور پر دربار ریٹائرڈ ہرٹ ہوگئے جس کے بعد جے سوریا بھی 34 رنز بناکر پویلین لوٹ گئے۔ اس کے بعد اوبس پینار اور کوری اینڈرسن کی جوڑی نے بیٹنگ کی ذمہ داری سنبھالی۔ انہوں نے اچھی رفتار سے رنز بنائے اور مقررہ 10 اووز میں یونٹی کا اسکور ایک وکٹ کے نقصان پر 124 رنز پر پہنچادیا ۔ کوری اینڈرسن نے 4 چھکے اور 2 چوکے جبکہ پینار نے 3 چھکے اور 2 چوکے لگائے۔جواب میں ٹرائیٹن کا آغاز سست تھا پہلے دو اوورز میں دو وکٹیں گنوا دیں۔ جیسی رائیڈر کو سری سانتھ نے صفر پر آؤٹ کیا جس کے بعد پیٹر ٹریگو 4 رنز بنا کر آؤٹ ہوئے۔ پہلے دو اوورز کے اختتام پر ٹرائیٹن کا سکور 2 وکٹوں کے نقصان پر 9 رنز تھا۔ اس مرحلے پر یوسف پٹھان اور کیمرون ڈیلپورٹ کھیلنے آئے اور دونوں نے اگلے چند اوورز میں وکٹیں نہ کھوتے ہوئے ٹیم کی پوزیشن مستحکم کی اور 2 وکٹوں کے نقصان پر 42 رنز پر پہنچادیا ۔ آخری پانچ اوورز میں ٹرائیٹن کو جیت کے لیے مزید 83 رنز درکار تھے۔ٹریٹن نے جلد بازی میں مزید تین وکٹیں کھودیں اور وہ مقررہ 10 اووز میں 7 وکٹوں کے نقصان پر صرف 69 رنز بناسکی اور یوں یہ میچ 55 رنز سے ہارگئی۔","pubDate":"2023-08-25 21:35:32","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"نیو یارک واریئرز کی چوتھی فتح، پوائنٹس ٹیبل پر پہلی پوزیشن مستحکم","link":"https://pni.net.pk/sports-news/cricket-news/481758/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"فلوریڈا (25 اگست 2023)یو ایس ماسٹرز ٹی 10 لیگ میں نیو یارک واریئرز نے ٹیکساس چارجرز کو 6 رنز سے شکست دیکر مقابلے میں چوتھی فتح حاصل کرلی۔ نیو یارک واریئرز نے مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز بنائے اور [...] The post نیو یارک واریئرز کی چوتھی فتح، پوائنٹس ٹیبل پر پہلی پوزیشن مستحکم appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"فلوریڈا (25 اگست 2023)یو ایس ماسٹرز ٹی 10 لیگ میں نیو یارک واریئرز نے ٹیکساس چارجرز کو 6 رنز سے شکست دیکر مقابلے میں چوتھی فتح حاصل کرلی۔ نیو یارک واریئرز نے مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز بنائے اور چارجرز کو 8 وکٹوں کے نقصان پر 109 رنز تک محدود کر دیا۔عبدالرحمٰن نے پہلے ہی اوور میں محمد حفیظ اور اوپل تھرنگا دونوں کو آؤٹ کرکے واریئرز کا شاندار آغاز کیا۔ اس کے بعد کپتان بین ڈنک اور سری لنکن آل راؤنڈر تھیسارا پریرا نے بالترتیب 16 اور 19 رنز بنائے۔ دونوں نے اچھی کارکردگی دکھائی تاہم وہ لمبی اننگز نہیں کھیل سکے کیونکہ چارجز 6.2 میں 71 رنز پر جدوجہد کررہے تھے اس سکور پر ان کے 7 وکٹیں گرچکی تھیں۔ تاہم فل مسٹرڈ اور سہیل تنویر نے ناقابل بیان کارکردگی دکھاتے ٹیکساس چارجرز کو قریب پہنچادیا تھا۔ میچ آخری بال تک جاری رہا ۔ اس وقت ٹیکساس کو فتح کے لئے 7 رنز درکار تھے تاہم سہیل تنویر لانگ آن باؤنڈری پر کیچ آؤٹ ہو گئے یوں نیویارک واریئرز نے 6 رنز سے میچ جیت لیا۔ اس سے قبل ٹیکساس چارجرز نے ٹاس جیت کر پہلے بولنگ کا فیصلہ کیا۔ سہیل تنویر نے 7 ویں اوور میں 2 وکٹیں حاصل کیں اس وقت وارئیرز کا سکور 5 وکٹوں کے نقصان پر 58 رنز تھا ۔ اس کے بعد کپتان مصباح الحق اور عبدالرزاق نے اننگز کی آخری 21 گیندوں پر 57 رنز بنائے۔عبدالرزاق نے 14 گیندوں پر 35 رنز کی ناقابل شکست اننگز کھیلی جس میں 4 چھکے اور ایک چوکا شامل تھا اس سے ٹیم کا سکور مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز رہا۔","pubDate":"2023-08-25 21:28:42","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"Asia Cup 2023: કોહલીની બેટિંગ પોઝિશન બદલવાની જરૂર, આ દિગ્ગજ ખેલાડીએ શા માટે આપી આવી સલાહ","link":"https://gujarati.abplive.com/sports/cricket/asia-cup-2023-ab-de-villiers-said-virat-kohli-perfect-for-number-4-batting-855013","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"India vs Pakistan: એશિયા કપમાં ભારતની પ્રથમ મેચ પાકિસ્તાન સાથે છે. આ મેચ પહેલા એબી ડી વિલિયર્સે વિરાટ કોહલી માટે એક નિવેદન આપ્યું છે. ભારતીય ટીમે એશિયા કપ 2023 માટે પ્રેક્ટિસ શરૂ કરી દીધી છે. કેપ્ટન રોહિત શર્મા અને વિરાટ કોહલી સહિત તમામ ખેલાડીઓ મેદાનમાં ઉતર્યા છે. દિગ્ગજ ક્રિકેટર એબી ડી વિલિયર્સે કોહલી પર પ્રતિક્રિયા આપી છે. તેનું માનવું છે કે કોહલીએ ચોથા નંબર પર બેટિંગ કરવી જોઈએ. તે આ પદ માટે પરફેક્ટ છે. આ સાથે તેઓ મિડલ ઓર્ડરને પણ સપોર્ટ કરી શકશે. ઈન્ડિયા ટુડેના એક સમાચાર અનુસાર ડી વિલિયર્સે કોહલીનો ઉલ્લેખ કર્યો અને કહ્યું, “મને લાગે છે કે તે નંબર 4 માટે પરફેક્ટ છે. તેઓ કોઈપણ જવાબદારી સારી રીતે નિભાવી શકે છે. મને ખબર નથી કે તે આ નંબર પર રમવા માંગશે કે નહીં. પરંતુ ટીમ માટે  જવાબદારી નિભાવી મહત્વપૂર્ણ વાત હોઇ શકે છે. તમને જે પણ જવાબદારી મળે તેને સારી રીતે નિભાવવી જોઇએ. ભારત-પાકિસ્તાન મેચનો ઉલ્લેખ કરતા ડી વિલિયર્સે કહ્યું કે, ભારત અને પાકિસ્તાન આ વખતે એશિયા કપ જીતવાના પ્રબળ દાવેદાર છે. જો કે શ્રીલંકામાં પણ મોટી ટીમોને માત આપવાની  ક્ષમતા ધરાવે  છે. નોંધપાત્ર વાત એ છે કે, કોહલીએ નંબર 3 પર બેટિંગ કરતા ODI ફોર્મેટમાં સૌથી વધુ મેચ રમી છે. કોહલીએ આ બેટિંગ પોઝીશન પર 210 મેચ રમી છે. આ દરમિયાન 10777 રન બનાવ્યા છે. કોહલીએ આ ફોર્મેટમાં 39 સદી અને 55 અડધી સદી ફટકારી છે. ચોથા નંબર પર બેટિંગ કરતા તેણે 39 મેચ રમી છે. આ દરમિયાન 1767 રન બનાવ્યા છે. કોહલીએ આ બેટિંગ પોઝિશન પર 7 સદી અને 8 અડધી સદી ફટકારી છે. એશિયા કપ માટેની ભારતની ટીમ:- રોહિત શર્મા (કેપ્ટન), શુભમન ગિલ, વિરાટ કોહલી, શ્રેયસ ઐયર, સૂર્યકુમાર યાદવ, તિલક વર્મા, કેએલ રાહુલ, ઈશાન કિશન, હાર્દિક પંડ્યા (વાઈસ-કેપ્ટન), રવિન્દ્ર જાડેજા, અક્ષર પટેલ, શાર્દુલ ઠાકુર, જસપ્રીત બુમરાહ, મોહમ્મદ શમી, મોહમ્મદ સિરાજ, કુલદીપ યાદવ, પ્રખ્યાત કૃષ્ણાનો સમાવેશ થાયછે.                                           ","content":"India vs Pakistan: એશિયા કપમાં ભારતની પ્રથમ મેચ પાકિસ્તાન સાથે છે. આ મેચ પહેલા એબી ડી વિલિયર્સે વિરાટ કોહલી માટે એક નિવેદન આપ્યું છે. ભારતીય ટીમે એશિયા કપ 2023 માટે પ્રેક્ટિસ શરૂ કરી દીધી છે. કેપ્ટન રોહિત શર્મા અને વિરાટ કોહલી સહિત તમામ ખેલાડીઓ મેદાનમાં ઉતર્યા છે. દિગ્ગજ ક્રિકેટર એબી ડી વિલિયર્સે કોહલી પર પ્રતિક્રિયા આપી છે. તેનું માનવું છે કે કોહલીએ ચોથા નંબર પર બેટિંગ કરવી જોઈએ. તે આ પદ માટે પરફેક્ટ છે. આ સાથે તેઓ મિડલ ઓર્ડરને પણ સપોર્ટ કરી શકશે. ઈન્ડિયા ટુડેના એક સમાચાર અનુસાર ડી વિલિયર્સે કોહલીનો ઉલ્લેખ કર્યો અને કહ્યું, “મને લાગે છે કે તે નંબર 4 માટે પરફેક્ટ છે. તેઓ કોઈપણ જવાબદારી સારી રીતે નિભાવી શકે છે. મને ખબર નથી કે તે આ નંબર પર રમવા માંગશે કે નહીં. પરંતુ ટીમ માટે જવાબદારી નિભાવી મહત્વપૂર્ણ વાત હોઇ શકે છે. તમને જે પણ જવાબદારી મળે તેને સારી રીતે નિભાવવી જોઇએ. ભારત-પાકિસ્તાન મેચનો ઉલ્લેખ કરતા ડી વિલિયર્સે કહ્યું કે, ભારત અને પાકિસ્તાન આ વખતે એશિયા કપ જીતવાના પ્રબળ દાવેદાર છે. જો કે શ્રીલંકામાં પણ મોટી ટીમોને માત આપવાની ક્ષમતા ધરાવે છે. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); નોંધપાત્ર વાત એ છે કે, કોહલીએ નંબર 3 પર બેટિંગ કરતા ODI ફોર્મેટમાં સૌથી વધુ મેચ રમી છે. કોહલીએ આ બેટિંગ પોઝીશન પર 210 મેચ રમી છે. આ દરમિયાન 10777 રન બનાવ્યા છે. કોહલીએ આ ફોર્મેટમાં 39 સદી અને 55 અડધી સદી ફટકારી છે. ચોથા નંબર પર બેટિંગ કરતા તેણે 39 મેચ રમી છે. આ દરમિયાન 1767 રન બનાવ્યા છે. કોહલીએ આ બેટિંગ પોઝિશન પર 7 સદી અને 8 અડધી સદી ફટકારી છે. એશિયા કપ માટેની ભારતની ટીમ:- રોહિત શર્મા (કેપ્ટન), શુભમન ગિલ, વિરાટ કોહલી, શ્રેયસ ઐયર, સૂર્યકુમાર યાદવ, તિલક વર્મા, કેએલ રાહુલ, ઈશાન કિશન, હાર્દિક પંડ્યા (વાઈસ-કેપ્ટન), રવિન્દ્ર જાડેજા, અક્ષર પટેલ, શાર્દુલ ઠાકુર, જસપ્રીત બુમરાહ, મોહમ્મદ શમી, મોહમ્મદ સિરાજ, કુલદીપ યાદવ, પ્રખ્યાત કૃષ્ણાનો સમાવેશ થાયછે.","pubDate":"2023-08-26 05:32:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/26/d4f3f55f78143b946ec0fe6425fdf16b169302786190381_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"title":"\"Hope I Don't Get A Heart Attack...\": Pakistan Star's Comments Go Viral","link":"https://sports.ndtv.com/cricket/hope-i-dont-get-a-heart-attack-pakistan-star-naseem-shahs-big-statement-after-last-over-heroics-vs-afghanistan-4331034","keywords":null,"creator":null,"video_url":null,"description":"Number ten batsman Naseem Shah hit a boundary off the penultimate delivery to give Pakistan a dramatic one-wicket win over a luckless Afghanistan in the second ODI at Hambantota on Thursday.","content":"It was a match that was not for the faint-hearted. With only one wicket left, Pakistan made a dash in the last few balls to defeat Afghanistan by the narrowest of margins in the second ODI in Sri Lanka. Number ten batsman Naseem Shah hit a boundary off the penultimate delivery to give Pakistan a dramatic one-wicket win over a luckless Afghanistan in the second ODI at Hambantota on Thursday. The 20-year-old miscued a boundary off fast bowler Fazalhaq Farooqi and ran jubilantly towards the dressing room as Pakistan scored 11 off the final over to finish with 302-9 in 49.5 overs. The victory gave Pakistan an unassailable 2-0 lead in the three-match series with the last game in Colombo on Saturday. \"I would like to say that this year, with the chances I have got at the fag end of the innings, I hope I don't get a heart attack someday. I am very thankful to Allah and his grace as I always try to believe in myself in situations like that,\" said Shah in a video posted by Pakistan Cricket Board (PCB) . The quote has now been widely shared on social media. \"Let me just say that this year, the sort of situations I have had to face whilst coming into play towards the end of the innings, God Forbid I hope I don't get a heart-attack!\": Naseem Shah regarding his innings in the final over against Afghanistan in the 2nd ODI #AFGvPAK pic.twitter.com/eiysupkrse \"When I went inside, I believed in Shadab. I believed that we will finish the match. But when Shadab got out, I felt that the situation is now all mine. The bowlers are the same and I had the trust in myself to get the team over the line.\" Shah is happy that he has been taking Pakistan over the line on a quite a few occasions. \"I will say that it is a very happy thing and we needed this win a lot. I believed that I can do it.\" \"I try to be prepared for such situations as I practice a lot of batting in the nets. I know that my turn is coming when all the breathing lines stop. So I tried again to make the team win and did it. I am just trying to earn respect and rest is all upto almighty,\" he added. With AFP inputs","pubDate":"2023-08-26 03:48:36","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"Post Famous Interview With Tom Alter, Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home","link":"https://thesportsrush.com/cricket-news-post-famous-interview-with-tom-alter-sachin-tendulkar-was-fed-up-of-continuously-ringing-landline-phone-at-home/","keywords":["Cricket","Sachin Tendulkar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"For someone with an illustrious career spanning over 24 years, for someone who started his first-class career at the age of 15 and went on to become a demigod for millions, there can surely be no dearth of stories and anecdotes related to him which would make one go “Wow!!”. Legendary Indian batter Sachin Tendulkar,… The post Post Famous Interview With Tom Alter, Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home appeared first on The SportsRush.","content":"For someone with an illustrious career spanning over 24 years, for someone who started his first-class career at the age of 15 and went on to become a demigod for millions, there can surely be and related to him which would make one go “Wow!!”. Legendary Indian batter , who had emerged to be the face of India post its economic liberalization in early 1990s, can narrate aplenty ones from his days as a young prodigy itself. Advertisement The Master Blaster, who had a knack of playing and used to hardly get fed up of batting for long hours as a teenager, had experienced that emotion with respect to his landline phone at home. Sachin Tendulkar Was Fed Up Of Continuously Ringing Landline Phone At Home Former sports journalist-cum-actor late Tom Alter was the first person to have recorded Tendulkar’s video interview for the press when the latter was just 15 years of age. The interview was for the newspaper, and had taken place on January 19, 1989 at Hindi Gymkhana Ground, Mumbai. Just over two months ago, Tendulkar had made his maiden Ranji Trophy appearance for Bombay, and had become the youngest Indian to score a century on first-class debut. Advertisement Tendulkar, who had become an instant hit in the Indian cricketing fraternity, had tasted the unwarranted side of fame post the interview. Not only him, but his parents also had to face the ordeal, as his home landline would just not stop ringing! The fact was revealed by veteran Indian broadcaster during an interaction with Gaurav Kapur on his podcast named ‘ ‘. Bhogle stated how well-acquainted he was with Tendulkar and his family right since the days the Mumbai batter was just 14-15. Days after the Tom Alter interview, Bhogle revealed that he had been invited to Tendulkar’s house. During his meeting with him that day, he has asked him the reason why he couldn’t receive any telephone calls from people. “I was invited to his house once, and had to ask Sachin [Tendulkar] why is it that you can’t take telephone calls from anybody? And he said, ‘Now see what happens’. And he put his phone down, pre-mobile era, he put his phone down and it started to ring, because his father’s number was in the telephone directory.” Bhogle mentioned that when someone would open the telephone directory back in the day, he/she could easily find the phone number of Ramesh Tendulkar (Sachin’s father), which, in fact, was the landline number of his house! Thus, the family members had to always keep the phone off-the-hook, because the moment it was put on, someone would definitely call. Such was the fan following of a 15-year-old! Advertisement In the above video, Bhogle recalled writing a piece on Tendulkar (after interviewing him) for a sports magazine in Kolkata before the latter’s Ranji Trophy debut and after his interview with Tom Alter. Although inadvertently, it is an inaccurate claim as mentioned above. Sachin Tendulkar’s Confidence Exhibited In Interview With Tom Alter Even though the entire video interview is not available in public domain, an ever-confident Tendulkar can be seen in a from the same. When asked if he is tired answering questions and giving interviews already, Sachin remarked, “I think this is just the start,” to which Tom added, “Yeah, it is a part of being a cricket star.” He might have come across a tad overconfident back then, but Tendulkar had admitted to be ever-ready to face the lethal fast bowling duo of Malcolm Marshall and Curtley Ambrose had be been picked for India’s tour of West Indies 1988/89. Later in the clip, he even had remarked how he had no trouble facing the in-swingers and out-swingers bowled by former India captain in the nets at the CCI (Cricket Club of India). In fact, Kapil had once remarked how with the way Tendulkar had faced him for the first time. Advertisement","pubDate":"2023-08-26 03:00:59","image_url":null,"source_id":"thesportsrush","source_priority":4166,"country":["united states of america","australia","india","united kingdom"],"category":["sports"],"language":"english"},{"title":"India's WC Squad: No Tilak, Sanju And Krishna In Ganguly's 15-Member List","link":"https://sports.ndtv.com/cricket/indias-icc-world-cup-2023-squad-no-sanju-samson-tilak-varma-and-prasidh-krishna-in-sourav-gangulys-15-member-list-4330313","keywords":null,"creator":null,"video_url":null,"description":"Sourav Ganguly named his pick for India's ICC World Cup 2023 squad and it had some interesting exclusions.","content":"Former Indian cricket team skipper Sourav Ganguly named his pick for India's ICC World Cup 2023 squad and it had some interesting exclusions. Ganguly decided to not include the trio of Sanju Samson , Prasidh Krishna and Tilak Varma - all three players who were picked for Asia Cup 2023. It included both Shreyas Iyer and KL Rahul who are making a return from injury and were added in the squad for Asia Cup. India will start their World Cup campaign against Australia on October 8 in Chennai. The former India skipper picked Rohit Sharma , Shubman Gill , Virat Kohli , Shreyas Iyer, KL Rahul and Suryakumar Yadav as proper batting options. Ishan Kishan was the only specialist wicket-keeper in the squad with Rahul being the other option in case India want to play an extra batter in their team. Among all-rounders, he picked Hardik Pandya and the left-arm spin duo of Ravindra Jadeja and Axar Patel . Kuldeep Yadav was the other spin option in the squad picked by Ganguly. In the fast bowling department, there were not many surprises as Ganguly went with Jasprit Bumrah , Mohammed Shami, Mohammed Siraj and Shardul Thakur . Ganguly also named three back-up options if any of these players are ruled out for any reason. “If one of the batters gets injured then Tilak Varma can enter, while if the pacer gets injured then it's Prasidh Krishna, while in the case of spinner, Yuzvendra Chahal is the option,\" Ganguly told Star Sports . Sourav Ganguly's picks for India's ICC World Cup 2023 squad: Rohit Sharma, Shubman Gill, Ishan Kishan, Virat Kohli, Shreyas Iyer, KL Rahul, Suryakumar Yadav, Hardik Pandya, Ravindra Jadeja, Axar Patel, Kuldeep Yadav, Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Shardul Thakur.","pubDate":"2023-08-26 02:52:15","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"PCB के निमंत्रण पर बीसीसीआई अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला जाएंगे लाहौर: रिपोर्ट्स","link":"https://sports.ndtv.com/hindi/cricket/bcci-president-roger-binny-and-vice-president-rajeev-shukla-will-visit-lahore-on-the-invitation-of-pcb-reports-4330922#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला ने पाकिस्तान क्रिकेट बोर्ड (पीसीबी) का निमंत्रण स्वीकार कर लिया है और ख़बरें आ रही हैं कि वे वे चार से सात सितंबर तक लाहौर में एशिया कप के कुछ मैच देखेंगे.","content":"PCB के निमंत्रण पर बीसीसीआई अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला जाएंगे लाहौर: रिपोर्ट्स भारतीय क्रिकेट कंट्रोल बोर्ड (BCCI) के अध्यक्ष रोजर बिन्नी और उपाध्यक्ष राजीव शुक्ला ने पाकिस्तान क्रिकेट बोर्ड (पीसीबी) का निमंत्रण स्वीकार कर लिया है और वे चार से सात सितंबर तक लाहौर में एशिया कप के कुछ मैच देखेंगे. पीसीबी ने बीसीसीआई के सभी प्रमुख पदाधिकारियों को निमंत्रण दिया था और यह समझा जाता है कि अध्यक्ष और उपाध्यक्ष को उन्हें दिए गए निमंत्रण को स्वीकार करने के लिए भारतीय बोर्ड की मंजूरी मिल गई है. पाकिस्तान 30 अगस्त को मुल्तान में एशिया कप के शुरुआती मैच में नेपाल से भिड़ेगा. इस खबर की जानकारी रखने वाले एक सूत्र ने गोपनीयता की शर्त पर कहा, ‘‘बिन्नी, शुक्ला और सचिव जय शाह दो सितंबर को पल्लेकेले (कैंडी) में भारत बनाम पाकिस्तान के प्रमुख मुकाबले के लिए श्रीलंका में होंगे. तीनों अगले दिन भारत वापस आएंगे जिसके बाद बीसीसीआई अध्यक्ष और उपाध्यक्ष वाघा सीमा से लाहौर की यात्रा करेंगे.'' बिन्नी और शुक्ला दोनों को अपनी-अपनी पत्नी के साथ चार सितंबर को लाहौर में पीसीबी के गवर्नर हाउस द्वारा आयोजित होने वाले आधिकारिक रात्रिभोज के लिए आमंत्रित किया गया है. बताया जा रहा है कि ये दोनों अधिकारी पांच सितंबर को अफगानिस्तान बनाम श्रीलंका मैच और इसके अगले दिन पाकिस्तान के सुपर चार चरण के शुरुआती मुकाबले को देखेंगे. बीसीसीआई के वरिष्ठ अधिकारी और कांग्रेस के राज्यसभा सांसद शुक्ला 2004 में पाकिस्तान दौरे पर गयी दल में शामिल थे. सौरव गांगुली के नेतृत्व में इस दौरे पर भारत ने पाकिस्तान के खिलाफ ऐतिहासिक श्रृंखला जीती थी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-26 02:13:28","image_url":"https://c.ndtvimg.com/2023-08/4h2auaa_roger-binny_625x300_26_August_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Asia Cup 2023 पर मंडराया कोविड-19 का ख़तरा, 4 खिलाड़ी हुए पॉजिटिव: रिपोर्ट्स","link":"https://sports.ndtv.com/hindi/cricket/asia-cup-2023-hit-by-covid-scare-after-four-sri-lanka-stars-test-positive-reports-4330886#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप से ठीक 5 दिन पहले टूर्नामेंट पर कोविड-19 का ख़तरा मंडराता हुआ नज़र आ रहा है. दरअसल ख़बरें ये आ रही हैं कि श्रीलंका के 4 खिलाड़ी कोविड पॉजिटिव पाए गए हैं.","content":"Asia Cup 2023 पर मंडराया कोविड-19 का खतरा की शुरूआत 30 अगस्त से हो रही है. पाकिस्तान और श्रीलंका इस टूर्नामेंट के को होस्ट हैं. वो इसलिए क्योंकि बीसीसीआई ने पहले ही ये साफ कर दिया था कि भारतीय टीम टूर्नामेंट के लिए पाकिस्तान का दौरा नहीं करेगी. बता दें कि पहला मुकाबला पाकिस्तान और नेपाल के बीच खेला जाएगा. इसी बीच टूर्नामेंट से ठीक 5 दिन पहले एशिया कप पर कोविड-19 का ख़तरा मंडराता हुआ नज़र आ रहा है. दरअसल ख़बरें ये आ रही हैं कि श्रीलंका के तेज़ गेंदबाज़ दुशमंथा चमीरा और लेग स्पिनर वानिंदु हसरंगा सहित उनके चार क्रिकेटरों का चोटों और कोविड ​​​​-19 के कारण आगामी एशिया कप में खेलना संदिग्ध हो गया है. हाल ही में लंका प्रीमियर लीग (एलपीएल) के दौरान दुशमंथा चमीरा को कंधे में लगी चोट लगी थी, जिसके के कारण चमीरा एशिया कप से बाहर भी हो सकते हैं. इसी बीच की रिपोर्ट के अनुसार, प्रमुख स्पिनर वानिंदु हसरंगा, जिन्हें एलपीएल फाइनल से पहले जांघ में चोट लगी थी, एशिया कप में अपनी टीम के कम से कम दो मैच मिस कर सकते हैं. श्रीलंका अपने एशिया कप अभियान की शुरुआत 31 अगस्त को पल्लेकेले में बांग्लादेश के खिलाफ मैच से करेगा. श्रीलंकाई टीम की मुसीबतें बढ़ती दिखाई दे रही हैं, क्योंकि इनके अलावा बल्लेबाज़ कुसल परेरा और अविष्का फर्नांडो भी कोविड ​​​पॉज़िटिव पाए गए हैं. परेरा और फर्नांडो दोनों फिलहाल निगरानी में हैं और लंकाई टीम में उनका शामिल होना रिकवरी की गति पर निर्भर करेगा. श्रीलंकाई टीम मैनेजमेंट ने कहा कि दोनों LPL 2023 के बाद के समय के दौरान COVOD ​​​​-19 के संपर्क में आ गए. एशिया कप के लिए टीम में शामिल होने के लिए उन्हें नेगेटिव रिपोर्ट के साथ लौटाना होगा. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-26 01:53:55","image_url":"https://c.ndtvimg.com/2023-08/urjkhvco_asia-cup-2023_625x300_26_August_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Coaches draw plenty of positives","link":"https://times-age.co.nz/sports/coaches-happy-with-seasons/","keywords":["Football","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Wairarapa no longer has the giddy heights of Central League Football; however, two clubs have just completed outstanding seasons, both winning promotion from their Capital Leagues. CHRIS COGDALE reviews the efforts of Douglas Villa and Greytown. Douglas Villa Tumu Douglas Villa won promotion to Capital Division One after finishing runners-up in their second year in […]","content":"Tumu Douglas Villa won promotion to Capital Division One after finishing runners-up in their second year in Division Two. Under the astute coaching of the experienced Mark Taylor, Villa finished on 42 points [a total usually good enough to win a league], with 13 wins, three draws, and two losses – the first a 2–0 home defeat to an average Horowhenua Coastal team and the second a narrow 3–2 loss to runaway champions Wellington Marist. Winning promotion was always the goal for Taylor, who was in his first year in charge of the team that finished mid-table in 2022. “I thought, right, we’ll just step things up a wee bit, let’s get a structure and a way we want to play and get some discipline sorted out so that we’re not losing players through suspensions and doing dumb things in key moments and that we’re on top of things and we’ve got a real good work ethic and a group of players that like playing together and that was really important to do that,” Taylor said. “I’m really pleased with the players – on match days, they’ve been magnificent. There are games where we’ve been behind, and we’ve shown character and come back to win and sometimes win easily, and there are other games where we’ve just been dominant from the start to finish, and it’s just a matter of when. and when you’re in those situations, it’s really enjoyable to be part of. “We knew that some of the teams we were playing were the club’s third teams, and we’re a first team, so we had to make sure that we’re not losing to teams that we should be beating, and we’ve managed to set that as a real standard and stuck with it.” Captain Chris Cox, who was in his second season with the team, showed his experience from playing at Central League level and formed a strong centre back combination with Shea Fowler, and remarkably for defenders, neither received a yellow card throughout the season. Josh McMenamin topped the team scoring, with 23 goals, and was second in the division’s golden boot, while Tremaine Rimene-Albrett was third on 15 goals. Taylor also praised assistant coach Riki Riddell, saying he was fantastic with the players and at trainings. “He was exceptional, so it wasn’t just about me; it was Riki as well. He’s the club captain, and he does the committee. He helps out with juniors, his wife is the junior coordinator, and he’s there for all the training sessions. I couldn’t get on Tuesdays until a little bit later, but he would be there doing the warm-ups and doing some of the ball activation exercises and things like that, and he was a vital part of the coaching group.” Stu McLean also assisted in coaching goalkeeping, a problem area for the team early in the season when first-choice Ben Burnley was out with a broken hand. Overall, though, Taylor said the players finished with an appreciation of the need to keep possession and play quicker, and that should hold the team in good stead in their step up to Division One, the third highest level available, and he’s already started planning for next season. “We start looking around for players. We haven’t got a lot of depth in the club underneath the first team,” Taylor explained. “We’ve got lots of guys playing local league football, but we need to have that next step, so there’s a real drive to look at young players who want to become part of it, and what we really push for is to get a real good level of respect and decency about the club so that people coming in know that we’re a football club and we’ve got a real focus on making sure we’re going to be the best that we can. “We got good feedback from the community about what we’ve been doing. We wanted to improve the respectability of the team, and we achieved that.” Taylor concluded that Douglas Villa have a few aspects to look at, including youth and making a women’s team a priority following the success of the Women’s World Cup. A mid-season slump of three consecutive losses hurt Greyfriars Motel Greytown’s Capital Division Three championship prospects, but the team fought back to finish second behind Upper City United and win promotion. Greytown finished with a record of 14 wins, one draw, and three losses, and on 43 points, three shy of Upper Hutt. Greytown started with a hiss and roar, scoring 18 goals in two home games before meeting Upper Hutt on their artificial pitch and drawing 3–3, a result that coach Phil Keinzley believes ultimately cost them the title. “The Upper Hutt game was our first on an artificial away, and when I reflect on the season, if we’d won that game, we would have won the league. We were pretty complacent, and the speed of the artificial, we weren’t ready for it,” said Keinzley, “We were full of our own importance at that stage, and suddenly striking a competitive team on an artificial really brought the truth home.” Playing on artificials became the team’s Achilles heel, with two of their losses to Petone U20s and Wellington United on artificial turfs, where the players’ fitness was tested. “I actually thought we were fitter at the start of the season than any other team in the league, but as the season progressed, we never improved in our fitness, and the other teams did and closed the gap big time there, and we had quite a good run on grass pitches and a number of home games but the warning bells were there that we were going to have trouble on the artificials.” Keinzley said Greytown weren’t helped by having to play on a sub-standard surface at Soldiers Memorial Park, and the difference between the teams in the end was the quality of both the training and playing pitches. “I think the South Wairarapa council should be disgusted with it. “There are no ifs or buts – I felt our pitch was the worst pitch anywhere in the league. “Places like Waterside-Karori and Naenae used to be the bogs, but they’re immaculate now and are like cricket pitches, and the council is not recognising the fact that football participation has grown and there’s too much overuse of the pitches because there is nowhere else. “We never lost at home, and in the same way we struggled with artificials, other teams struggled with the state of our pitch. We trained at Carterton, which was even worse, so we were okay with it.” Overall though, Keinzley was thrilled with the outcome, saying it was better than expected, especially the attack, where former national league player and assistant coach Josh Stevenson netted 33 goals for second in the Golden Boot, while captain Jarrod MacDonald was third with 21 goals. “Josh’s finishing was really good, and his experience was invaluable, and for me personally, it was handy having an assistant coach where you can break up the trainings a bit, so I didn’t need to be at every training.” Looking ahead to next season, Keinzley said there is a solid core of players, and some promising young players, including Liam Andrew, Xavier Marshall-Cox and Charlie Matthews, coming through, but there are areas to improve. “The players have to work on fitness in the off-season, so we’re not starting from scratch again, and we need to have a bit more depth in our midfield and centre back – the axle of the team.”","pubDate":"2023-08-25 22:00:00","image_url":"https://times-age.co.nz/wp-content/uploads/2023/08/502635-1024x683.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"title":"فائٹنگ لیگ آج سے دبئی میں شروع ہو گی","link":"https://pni.net.pk/sports-news/cricket-news/481772/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"دبئی (25 اگست 2023) گزشتہ برس فائٹنگ لیگ کے پہلے ایڈیشن کی کامیابی کے بعد دوسرے ایڈیشن میں سب سے زیادہ 32 امیچر ایم ایم اے فائٹرز شرکت کررہے ہیں ۔ یہ فائٹنگ لیگ(آج) ہفتہ 26 اگست کو ہوگی۔ اس لیگ کی بنیاد شوقیہ فائٹرز [...] The post فائٹنگ لیگ آج سے دبئی میں شروع ہو گی appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"دبئی (25 اگست 2023) گزشتہ برس فائٹنگ لیگ کے پہلے ایڈیشن کی کامیابی کے بعد دوسرے ایڈیشن میں سب سے زیادہ 32 امیچر ایم ایم اے فائٹرز شرکت کررہے ہیں ۔ یہ فائٹنگ لیگ(آج) ہفتہ 26 اگست کو ہوگی۔ اس لیگ کی بنیاد شوقیہ فائٹرز کی صلاحیتوں کو بڑھانے کے لئے رکھی گئی تھی تاکہ ایک جگہ جمع ہوکر قومی اور بین الاقوامی مقابلوں میں شرکت کے لئے خود کو تیار کرسکیں۔ گزشتہ ایڈیشن میں 1500 سے زائد تماشائیوں نے سنسنی خیز مقابلے دیکھے تھے ۔ اس ایونٹ میں فائٹرز سے قیام، کھانے پینے اور مہمان نوازی کی کوئی فیس وصول نہیں کیا جائے گی۔ توقع کی جارہی ہے کہ 2022 کی طرح اس ایک روزہ ایونٹ میں اصل مقابلہ جوخم دلی اور فرینکی مومن کے درمیان ہوگا۔","pubDate":"2023-08-25 21:42:36","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"یوایس ماسٹر ٹی 10 میں مورس ویل یونٹی کی نیو جرسی ٹرائیٹن کے خلاف 55 رنز سے فتح","link":"https://pni.net.pk/sports-news/cricket-news/481766/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"فلوریڈا (25 اگست 2023) نیوزی لینڈ کے کوری اینڈرسن نے مورس ویل یونٹی کی جانب سے شاندار کارکردگی کا مظاہرہ کرتے ہوئے سب سے زیادہ 4 وکٹیں حاصل کیں جس سے ان کی ٹیم نیو جرسی ٹرائیٹن کو 55 رنز سے شکست دینے میں کامیاب [...] The post یوایس ماسٹر ٹی 10 میں مورس ویل یونٹی کی نیو جرسی ٹرائیٹن کے خلاف 55 رنز سے فتح appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"فلوریڈا (25 اگست 2023) نیوزی لینڈ کے کوری اینڈرسن نے مورس ویل یونٹی کی جانب سے شاندار کارکردگی کا مظاہرہ کرتے ہوئے سب سے زیادہ 4 وکٹیں حاصل کیں جس سے ان کی ٹیم نیو جرسی ٹرائیٹن کو 55 رنز سے شکست دینے میں کامیاب ہوئی ۔ کوری اینڈرسن کو میچ کا بہترین کھلاڑی قرار دیا گیا۔مورس ویل یونٹی نے پہلی بیٹنگ کی اوپنرز شی ہان جے سوریا اور راج دیپ دربار نے اننگز کا آغاز کیا اور رنز کے ڈھیر لگادیئے۔ جس میں جے سوریا کا حصہ زیادہ تھا۔ مورس ویل کی 52 رنز پر کوئی کھلاڑی آؤٹ نہ تھا۔ اس سکور پر دربار ریٹائرڈ ہرٹ ہوگئے جس کے بعد جے سوریا بھی 34 رنز بناکر پویلین لوٹ گئے۔ اس کے بعد اوبس پینار اور کوری اینڈرسن کی جوڑی نے بیٹنگ کی ذمہ داری سنبھالی۔ انہوں نے اچھی رفتار سے رنز بنائے اور مقررہ 10 اووز میں یونٹی کا اسکور ایک وکٹ کے نقصان پر 124 رنز پر پہنچادیا ۔ کوری اینڈرسن نے 4 چھکے اور 2 چوکے جبکہ پینار نے 3 چھکے اور 2 چوکے لگائے۔جواب میں ٹرائیٹن کا آغاز سست تھا پہلے دو اوورز میں دو وکٹیں گنوا دیں۔ جیسی رائیڈر کو سری سانتھ نے صفر پر آؤٹ کیا جس کے بعد پیٹر ٹریگو 4 رنز بنا کر آؤٹ ہوئے۔ پہلے دو اوورز کے اختتام پر ٹرائیٹن کا سکور 2 وکٹوں کے نقصان پر 9 رنز تھا۔ اس مرحلے پر یوسف پٹھان اور کیمرون ڈیلپورٹ کھیلنے آئے اور دونوں نے اگلے چند اوورز میں وکٹیں نہ کھوتے ہوئے ٹیم کی پوزیشن مستحکم کی اور 2 وکٹوں کے نقصان پر 42 رنز پر پہنچادیا ۔ آخری پانچ اوورز میں ٹرائیٹن کو جیت کے لیے مزید 83 رنز درکار تھے۔ٹریٹن نے جلد بازی میں مزید تین وکٹیں کھودیں اور وہ مقررہ 10 اووز میں 7 وکٹوں کے نقصان پر صرف 69 رنز بناسکی اور یوں یہ میچ 55 رنز سے ہارگئی۔","pubDate":"2023-08-25 21:35:32","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"title":"نیو یارک واریئرز کی چوتھی فتح، پوائنٹس ٹیبل پر پہلی پوزیشن مستحکم","link":"https://pni.net.pk/sports-news/cricket-news/481758/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"فلوریڈا (25 اگست 2023)یو ایس ماسٹرز ٹی 10 لیگ میں نیو یارک واریئرز نے ٹیکساس چارجرز کو 6 رنز سے شکست دیکر مقابلے میں چوتھی فتح حاصل کرلی۔ نیو یارک واریئرز نے مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز بنائے اور [...] The post نیو یارک واریئرز کی چوتھی فتح، پوائنٹس ٹیبل پر پہلی پوزیشن مستحکم appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"فلوریڈا (25 اگست 2023)یو ایس ماسٹرز ٹی 10 لیگ میں نیو یارک واریئرز نے ٹیکساس چارجرز کو 6 رنز سے شکست دیکر مقابلے میں چوتھی فتح حاصل کرلی۔ نیو یارک واریئرز نے مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز بنائے اور چارجرز کو 8 وکٹوں کے نقصان پر 109 رنز تک محدود کر دیا۔عبدالرحمٰن نے پہلے ہی اوور میں محمد حفیظ اور اوپل تھرنگا دونوں کو آؤٹ کرکے واریئرز کا شاندار آغاز کیا۔ اس کے بعد کپتان بین ڈنک اور سری لنکن آل راؤنڈر تھیسارا پریرا نے بالترتیب 16 اور 19 رنز بنائے۔ دونوں نے اچھی کارکردگی دکھائی تاہم وہ لمبی اننگز نہیں کھیل سکے کیونکہ چارجز 6.2 میں 71 رنز پر جدوجہد کررہے تھے اس سکور پر ان کے 7 وکٹیں گرچکی تھیں۔ تاہم فل مسٹرڈ اور سہیل تنویر نے ناقابل بیان کارکردگی دکھاتے ٹیکساس چارجرز کو قریب پہنچادیا تھا۔ میچ آخری بال تک جاری رہا ۔ اس وقت ٹیکساس کو فتح کے لئے 7 رنز درکار تھے تاہم سہیل تنویر لانگ آن باؤنڈری پر کیچ آؤٹ ہو گئے یوں نیویارک واریئرز نے 6 رنز سے میچ جیت لیا۔ اس سے قبل ٹیکساس چارجرز نے ٹاس جیت کر پہلے بولنگ کا فیصلہ کیا۔ سہیل تنویر نے 7 ویں اوور میں 2 وکٹیں حاصل کیں اس وقت وارئیرز کا سکور 5 وکٹوں کے نقصان پر 58 رنز تھا ۔ اس کے بعد کپتان مصباح الحق اور عبدالرزاق نے اننگز کی آخری 21 گیندوں پر 57 رنز بنائے۔عبدالرزاق نے 14 گیندوں پر 35 رنز کی ناقابل شکست اننگز کھیلی جس میں 4 چھکے اور ایک چوکا شامل تھا اس سے ٹیم کا سکور مقررہ 10 اوورز میں 5 وکٹوں کے نقصان پر 115 رنز رہا۔","pubDate":"2023-08-25 21:28:42","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"}]}