{"newsArray":[{"title":"India To Tour Zimbabwe For 3 ODIs In August","link":"https://sports.ndtv.com/cricket/india-to-tour-zimbabwe-for-3-odis-in-august-3141825","keywords":null,"creator":null,"video_url":null,"description":"India will be touring Zimbabwe for three ODIs in August this year, and Lalchand Rajput, the technical director of Zimbabwe Cricket spoke to NDTV on how this series will be a learning curve for the...","content":null,"pubDate":"2022-07-09 03:11:17","image_url":"https://c.ndtvimg.com/2022-01/g6chug0o_india-cricket-team_625x300_29_January_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Shahzaib stars as KP Whites clinch National U19 Cup","link":"https://www.thenews.com.pk/print/972597-shahzaib-stars-as-kp-whites-clinch-national-u19-cup","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Shahzaib Khan’s all-round performance helped Khyber Pakhtunkhwa U19 Whites to a five-wicket win over Central Punjab U19 Blues and clinch the National U19 Cup title here at the Rana Naveed Cricket Academy in Sheikhupura on Friday.Chasing 215 to win, last year’s finalist Khyber...","content":null,"pubDate":"2022-07-09 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Smith leads Australian charge in 2nd test","link":"https://www.cairnspost.com.au/sport/cricket/smith-leads-australian-charge-in-2nd-test/video/1d370f0b9da7b61b3d89337fac08bb54","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia are looking strong after day one in the 2nd test, with centuries to Steve Smith and Marnus Labuschagne.","content":null,"pubDate":"2022-07-09 00:54:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Steve Smith finally breaks century drought in second Test against Sri Lanka - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2p1bC8wOC9zdGV2ZS1zbWl0aC1maW5hbGx5LWJyZWFrcy1jZW50dXJ5LWRyb3VnaHQtaW4tc2Vjb25kLXRlc3QtYWdhaW5zdC1zcmktbGFua2HSAXlodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9qdWwvMDgvc3RldmUtc21pdGgtZmluYWxseS1icmVha3MtY2VudHVyeS1kcm91Z2h0LWluLXNlY29uZC10ZXN0LWFnYWluc3Qtc3JpLWxhbmth?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Steve Smith finally breaks century drought in second Test against Sri Lanka  The Guardian'Smudge headspace': Marnus details mindset for second Test | Sri Lanka v Australia 2022  cricket.com.auAustralia vs Sri Lanka 2nd Test Day 1 scores: Steve Smith and Marnus Labuschange centuries, highlights, video | news.com.au — Australia's leading news site  news.com.auSmith FINALLY breaks century drought as Aussies punish wasteful Sri Lanka  Fox SportsSpin can still win on flatter Galle wicket  The ExaminerView Full coverage on Google News","content":null,"pubDate":"2022-07-08 23:07:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Marnus Labuschagne capitalises on Sri Lankan gift to score first Test century on foreign soil - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMipAFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9zcmktbGFua2EtYXVzdHJhbGlhLXNlY29uZC10ZXN0LTIwMjItbWFybnVzLWxhYnVzY2hhZ25lLXN0ZXZlLXNtaXRoLXNjb3JlLWNlbnR1cmllcy1vbi1kYXktb25lLzA1NDNjZTk0LTBkY2QtNGMzYi1iZTI4LTY5OWIxNzUyM2JiNNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Marnus Labuschagne capitalises on Sri Lankan gift to score first Test century on foreign soil  Wide World of SportsAustralia vs Sri Lanka 2nd Test Day 1 scores: Steve Smith and Marnus Labuschange centuries, highlights, video | news.com.au — Australia's leading news site  news.com.auSmith FINALLY breaks century drought as Aussies punish wasteful Sri Lanka  Fox SportsSpin can still win on flatter Galle wicket  The Examiner'Smudge headspace': Marnus details mindset for second Test | Sri Lanka v Australia 2022  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-07-08 22:06:57","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Police arrest fan after racism allegations at England v India test","link":"https://www.thestar.com.my/sport/cricket/2022/07/09/cricket-police-arrest-fan-after-racism-allegations-at-england-v-india-test","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Birmingham Police said they arrested a man on Friday after allegations of racist behaviour during England's test match against India at Edgbaston came to light earlier this week. Read full story","content":"(Reuters) - Birmingham Police said they arrested a man on Friday after allegations of racist behaviour during England's test match against India at Edgbaston came to light earlier this week. A number of supporters said on Twitter they had been targeted by racist abuse from other fans at the Birmingham venue on the fourth day of the test, which England won by seven wickets to draw the series 2-2. \"A 32-year-old man has been arrested for a racially aggravated public order offence after reports of racist, abusive behaviour at the test match in Birmingham on Monday,\" Birmingham Police said in a statement. \"He remains in custody for questioning.\" The incident was also highlighted on Twitter by former Yorkshire spinner Azeem Rafiq, whose allegations of institutional racism at the club had rocked English cricket last year. Warwickshire said they would deploy undercover spotters for the second Twenty20 between England and India at Edgbaston on Saturday. India won the first T20 of the three-match series by 50 runs. (Reporting by Rohith Nair in Bengaluru; Editing by Toby Davis)","pubDate":"2022-07-08 19:48:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/09/1653270.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs England, 2nd T20I: With youngsters performing, pressure mounts on Virat Kohli ahead of his T20 return","link":"https://kashmirreader.com/2022/07/09/india-vs-england-2nd-t20i-with-youngsters-performing-pressure-mounts-on-virat-kohli-ahead-of-his-t20-return/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"BIRMINGHAM: Star India batter Virat Kohli would be desperate to come out of his prolonged lean patch when he makes his T20 return after five months with the second game against England, here on Saturday. Kohli, who last played a T20 international in February, has featured in only two games since India’s underwhelming campaign in […]","content":"BIRMINGHAM: Star India batter Virat Kohli would be desperate to come out of his prolonged lean patch when he makes his T20 return after five months with the second game against England, here on Saturday. Kohli, who last played a T20 international in February, has featured in only two games since India’s underwhelming campaign in the T20 World Cup in October-November when he was captain of the national side. The only T20 cricket he played since then was in the IPL but there too he was far from his best. Kohli and other seniors getting frequent breaks as part of the team’s rest and rotate policy gave opportunity to fringe players like Deepak Hooda, who will be difficult to drop on Saturday after the performances he has come up with. Batting at Kohli’s position, Hooda has made a big impact and also showed ominous form in the series opener against England, scoring a 17-ball 33. If India decide to retain Hooda, then Kohli could open alongside skipper Rohit Sharma at the expense of Ishan Kishan, who has also been consistent at the top. The opening position is something Kohli is quite familiar with and his last half-century in T20 Internationals also came at the top. With Kohli expected to take another break for the five T20s against the West Indies, the two games against England assume more importance as far as his future in the T20 set up is concerned. Kohli has ‘been there and done that’ but with the younger lot playing fearless cricket, he will need to come back to his best. The first game against England saw the return of Rohit after a COVID-induced break and the team put together a perfect game. The batters displayed the uninhibited approach that has become essential in the shortest format while the pacers exploited the conditions brilliantly. Shedding the conservative style of play that let them down in the World Cup, Indian batters gave clear signs of their approach going forward. The powerplay fetched 66 runs and even after the fall f wickets, the intent was to go hard from ball one. However, the team can improve its finishing skills, an area it lacked in on Thursday night. Besides Kohli, Rishabh Pant, Jasprit Bumrah, Ravindra Jadeja and Shreyas Iyer have also joined the T20 squad following a break after the fifth Test here. It seemed India were a batter short in the series-opener though they ended up with 198. Jadeja is a like for like replacement for Axar Patel and his inclusion also makes the batting unit more solid. Bhuvneshwar Kumar has been mighty impressive with the new ball and Bumrah is expected to join him. Arshdeep Singh made a successful debut but since he is not part of the squad for the next two games, Umran Malik may get more chances. Hardik Pandya had a game to remember with both and ball and his presence is surely a big boost to the side in a World Cup year. Rohit will also want to see a marked improvement in the team’s fielding, especially catching after an ordinary show on Thursday. England, who were blown away by the visitors at Southampton, will back themselves to make a strong comeback. They rely a lot on skipper Jos Buttler who will be keen to make amends after his first ball duck. The power packed batting including Liam Livingstone and Jason Roy failed in the first game but trust them to come good in a must win game. PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-07-08 18:31:04","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Ind vs WI, T20I: वेस्टइंडीज के खिलाफ टी20 सीरीज में खेल सकते हैं विराट-रोहित, वनडे से दिया गया था आराम","link":"https://www.abplive.com/sports/cricket/west-indies-vs-india-rohit-sharma-virat-kohli-rishabh-pant-likely-to-play-in-t20i-series-against-wi-2164038","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>West Indies vs India T20I Series Virat Kohli Rohit Sharma:</strong> टीम इंडिया जुलाई महीने के आखिरी हफ्ते में वेस्टइंडीज दौरे पर जाएगी. यहां दोनों टीमों के बीच वनडे और टी20 सीरीज खेली जानी है. बीसीसीआई ने वनडे सीरीज के लिए भारतीय टीम की घोषणा की है. इसमें विराट कोहली, रोहित शर्मा और ऋषभ पंत जैसे कुछ दिग्गज खिलाड़ी शामिल नहीं थे. इन्हें आराम दिया गया था. हालांकि अब खबर आ रही है कि कोहली और रोहित टी20 सीरीज में खेलेंगे.</p> <p style=\"text-align: justify;\">मीडिया रिपोर्ट्स के मुताबिक बीसीसीआई एक सूत्र ने बताया है कि रोहित शर्मा, विराट कोहली और ऋषभ पंत वेस्टइंडीज के खिलाफ टी20 सीरीज में खेल सकते हैं. हालांकि इसको लेकर अभी तक किसी भी तरह की आधिकारिक पुष्टि नहीं हुई है. कोहली और रोहित के साथ-साथ तेज गेंदबाज मोहम्मद शमी और जसप्रीत बुमराह को भी वनडे से आराम दिया गया था. वहीं ऑलराउंडर हार्दिक पांड्या भी इस टीम में शामिल नहीं हैं.</p> <p style=\"text-align: justify;\">गौरतलब है कि धवन को वनडे मैचों की कप्तानी सौंपी गई है. वहीं दीपक हुड्डा, संजू सैमसन, ऋतुराज गायकवाड़ और आवेश खान 12 जुलाई से इंग्लैंड में शुरू हो रही सीरीज के लिए वनडे टीम का हिस्सा नहीं हैं, लेकिन उन्हें वेस्टइंडीज दौरे के लिये 16 सदस्यीय भारतीय टीम में शामिल किया गया है. दिसंबर 2020 में अंतिम वनडे खेलने वाले शुभमन गिल को भी चयनकर्ताओं ने चुना है.</p> <p style=\"text-align: justify;\"><strong>वेस्टइंडीज के खिलाफ वनडे सीरीज के लिए भारतीय टीम - </strong>शिखर धवन (कप्तान), रविंद्र जडेजा (उप कप्तान), ऋतुराज गायकवाड़, शुभमन गिल, दीपक हुड्डा, सूर्यकुमार यादव, श्रेयस अय्यर, इशान किशन (विकेटकीपर), संजू सैमसन (विकेटकीपर), शार्दुल ठाकुर, युजवेंद्र चहल, अक्षर पटेल, आवेश खान, प्रसिद्ध कृष्णा, मोहम्मद सिराज और अर्शदीप सिंह.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/who-will-be-wicket-keeper-in-second-t20-against-england-rishabh-pant-dinesh-karthik-ishaan-kishan-2164022\">IND vs ENG: ऋषभ पंत के लिए आसान नहीं होगा प्लेइंग इलेवन में जगह बना पाना, जानिए दूसरे टी20 में कौन होगा विकेटकीपर</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/sachin-tendulkar-share-video-on-sourav-ganguly-birthday-for-wish-says-happy-birthday-dadi-2163973\"><strong>Sourav Ganguly Birthday: दादा को दादी क्यों कहते हैं सचिन तेंदुलकर, खुद वीडियो शेयर कर बताया दिलचस्प कारण</strong></a></p>","content":null,"pubDate":"2022-07-08 17:32:23","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs ENG: ऋषभ पंत के लिए आसान नहीं होगा प्लेइंग इलेवन में जगह बना पाना, जानिए दूसरे टी20 में कौन होगा विकेटकीपर","link":"https://www.abplive.com/sports/cricket/who-will-be-wicket-keeper-in-second-t20-against-england-rishabh-pant-dinesh-karthik-ishaan-kishan-2164022","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>England vs India:</strong> भारत और इंग्लैंड (IND vs ENG) के बीच तीन टी20 मैचों की सीरीज का दूसरा मुकाबला शुक्रवार, 9 जून को एजबेस्टन, बर्मिंघम (Edgbaston, Birmingham) में खेला जाएगा. इसी मैदान पर भारत ने आखिरी टेस्ट मैच खेला था. दूसरा टी20 भारतीय समयानुसार शाम 7 बजे शुरू होगा. भारत ने सीरीज का पहला 50 रन से जीत लिया था. दूसरे टी20 में पंत के लिए प्लेइंग 11 में जगह बनाना मुश्किल होगा. पंत (Rishabh Pant), ईशान (Ishaan Kishan) और कार्तिक (Dinesh Karthik) में दो खिलाड़ियों को ही प्लेइंग 11 में मौका मिल सकता है.</p> <p style=\"text-align: justify;\"><strong>ईशान कर सकते पारी की शुरुआत</strong><br />दूसरे टी20 के लिए कई भारतीय खिलाड़ियों की वापसी हो रही है. इनमें विराट कोहली (Virat Kohli), जसप्रीत बुमराह (Jasprit Bumrah), रविंद्र जडेजा, श्रेयस अय्यर और ऋषभ पंत (Rishabh Pant) शामिल हैं. ऐसे में अब देखना होगा कि दूसरी टी20 में बतौर विकेटकीपर ऋषभ पंत (Rishabh Pant) और दिनेश कार्तिक (Dinesh Karthik) में कौन जगह बनाता है. ईशान रोहित के साथ पारी की शुरुआत करेंगे, ऐसे में उनका खेलना लगभग तय है. पिछले कुछ टी20 मुकाबलों से पंत का बल्ला नहीं चला है. उनकी कप्तानी में अफ्रीका सीरीज भी ड्रा रही थी.</p> <p style=\"text-align: justify;\"><strong>पंते लिए आसान नहीं जगह बनाना</strong><br />दक्षिण अफ्रीका के खिलाफ पहले ने 5 मैचों में 29, 5, 6, 17 और नाबाद 1 रन की पारी खेली थी. वहीं इंग्लैंड के खिलाफ आखिरी टेस्ट में पंत ने पहली पारी में जहां 146 तो दूसरी पारी में 57 रन बनाए थे. दूसरी ओर दिनेश कार्तिक ने आईपीएल में शानदार प्रदर्शन किया था. अफ्रीका सीरीज में कार्तिक ने नाबाद 1, नाबाद 30, 6 और 55 रन की पारी खेली थी. वहीं इंग्लैंड के खिलाफ पहले टी20 में उन्होंने 11 रन बनाए थे. ईशान किशन भी भारत के लिए विकेटकीपिंग के विकल्प हैं. ऐसे में दूसरे टी20 में पंत के लिए प्लेइंग 11 में जगह बनाना आसान नहीं होगा.</p> <p style=\"text-align: justify;\"><strong>दूसरे टी20 के लिए भारतीय टीम</strong><br />रोहित शर्मा (कप्तान), ईशान किशन, विराट कोहली, सूर्यकुमार यादव, दीपक हुड्डा, श्रेयस अय्यर, दिनेश कार्तिक (विकेटकीपर), ऋषभ पंत (विकेटकीपर), हार्दिक पांड्या, रवींद्र जडेजा, युजवेंद्र चहल, अक्षर पटेल, रवि बिश्नोई, जसप्रीत बुमराह, भुवनेश्वर कुमार, आवेश खान, हर्षल पटेल, उमरान मलिक.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/virat-kohli-may-get-rest-in-t20-series-against-west-indies-see-possible-playing-11-2164002\">IND vs WI: विराट को टी20 सीरीज में मिलेगा आराम, रोहित रहेंगे कप्तान, ऐसी होगी टीम!</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/american-female-basketball-player-brittany-griner-sentenced-to-prison-in-russia-2163970\">अमेरिकी महिला बॉस्केटबॉल खिलाड़ी ब्रिटनी ग्रिनर को रूस में जेल, ड्रग्स तस्करी में मिली सजा</a></strong></p>","content":null,"pubDate":"2022-07-08 17:11:03","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Sourav Ganguly ने Team India के 7 कप्तान बदलने को लेकर दी प्रतिक्रिया, बताया क्या है इसका कारण","link":"https://www.abplive.com/sports/cricket/sourav-ganguly-says-about-team-india-7-captains-rohit-sharma-shikhar-dhawan-virat-kohli-2164019","keywords":null,"creator":["Agencies"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Sourav Ganguly Team India:</strong> बीसीसीआई अध्यक्ष सौरव गांगुली ऐसे व्यक्ति हैं जो हमेशा निरंतरता में भरोसा रखते हैं और उनका कहना है कि सात महीनों के अंदर सात कप्तान होना आदर्श नहीं है लेकिन कुछ कारणों से चीजें इस तरह से हुई कि ऐसा करना पड़ा. गांगुली ने अपना 50वां जन्मदिन लंदन में अपने दोस्तों और परिवार के साथ मनाया. उन्होंने एक इंटरव्यू में कई मामलों पर बात की.&nbsp;</p> <p style=\"text-align: justify;\">गांगुली ने टीम इंडिया की निरंतरता प्रभावित होने के सवाल पर कहा, ''मैं पूरी तरह से सहमत हूं कि इतने कम समय में सात अलग कप्तान रखना आदर्श नहीं है लेकिन ऐसा इसलिये हुआ क्याोंकि कुछ अपरिहार्य परिस्थितियां पैदा हुई. जैसे रोहित सफेद गेंद क्रिकेट में दक्षिण अफ्रीका में अगुआई करने वाले थे लेकिन दौरे से पहले वह चोटिल हो गए. इसलिये राहुल ने वनडे में कप्तानी की और फिर हाल में दक्षिण अफ्रीका की घरेलू श्रृंखला में राहुल श्रृंखला शुरू होने से एक दिन पहले चोटिल हो गया.''</p> <p style=\"text-align: justify;\">इंग्लैंड में रोहित अभ्यास मैच खेल रहा था जब उसे कोविड-19 संक्रमण का पता चला. इन हालात के लिये कोई जिम्मेदार नहीं है. कैलेंडर इस तरह का है कि हमें खिलाड़ियों को ब्रेक देना होता है और फिर किसी को चोट भी लग जाती है तो हमें कार्यभार प्रबंधन को भी देखना होता है. आपको मुख्य कोच राहुल द्रविड़ की परिस्थिति को भी समझना होगा कि प्रत्येक श्रृंखला में अपरिहार्य परिस्थितियों के कारण हमें नया कप्तान रखना पड़ा.</p> <p style=\"text-align: justify;\">गांगुली ने कहा, ''अपने पूरे अंतरराष्ट्रीय करियर में मेरा मानना रहा है कि जितना आप खेलोगे, उतना बेहतर होगे और उतना ही फिट होगे. इस स्तर पर आपको &lsquo;गेम टाइम&rsquo; चाहिए और आप जितने ज्यादा से ज्यादा मैच खेलोगे, उतना आपका शरीर मजबूत होगा.''</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/virat-kohli-may-get-rest-in-t20-series-against-west-indies-see-possible-playing-11-2164002\">IND vs WI: विराट को टी20 सीरीज में मिलेगा आराम, रोहित रहेंगे कप्तान, ऐसी होगी टीम!</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/shikhar-dhawan-says-about-batting-technique-ind-vs-eng-odi-series-indian-cricket-team-2163951\"><strong>IND vs ENG: Shikhar Dhawan ने बैटिंग के तरीके पर दी प्रतिक्रिया, बताया किस पर करते हैं सबसे ज्यादा भरोसा</strong></a></p>","content":null,"pubDate":"2022-07-08 16:58:12","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Birmingham cricket ground records: Edgbaston records average score in Birmingham T20Is","link":"https://thesportsrush.com/cricket-news-birmingham-cricket-ground-records-edgbaston-records-average-score-in-birmingham-t20is/","keywords":["Cricket","Birmingham","Edgbaston","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Birmingham cricket ground records: Rohit Sharma would love to continue his record T20I matches winning streak versus England tomorrow as well. After a fine display of quality Cricket with both bat and the ball during the first T20I at the Ageas Bowl, in Southampton, team India would travel to the Edgbaston Cricket Ground, Birmingham –… The post Birmingham cricket ground records: Edgbaston records average score in Birmingham T20Is appeared first on The SportsRush.","content":"Birmingham cricket ground records: Rohit Sharma would love to continue his record T20I matches winning streak versus England tomorrow as well. After a fine display of quality Cricket with both bat and the ball during the first T20I at the Ageas Bowl, in Southampton, team India would travel to the Edgbaston Cricket Ground, Birmingham – the venue for the second T20I against England, in their bid to take an unassailable lead in the three-match series. India skipper Rohit Sharma, however, would be spoilt for choices, especially in the batting department which impressed one and all during the first T20I, as Virat Kohli, Shreyas Iyer, and Rishabh Pant would join the squad and mark their availability for selection in the playing XI tomorrow. While England, on the other hand, were ordinary with the ball during the Southampton T20I, and then threw in the towel after devastating spells from Bhuvneshwar Kumar and Hardik Pandya upfront. Jos Buttler and co. would be itching to roar back in the series, as they would now have to win both the upcoming T20Is to clinch the same. Back in Birmingham. #Edgbaston | #ENGvIND https://t.co/eYlzpVTCNe — Edgbaston (@Edgbaston) July 8, 2022 Birmingham cricket ground records The Edgbaston Cricket Ground in Birmingham has hosted a total of five T20Is till date, with England featuring in three of them and ending up on the winning side each time. India, on the other hand, had lost the only T20I match they have played here against England by 3 runs in September 2014. As for the T20I records at this venue, England skipper Jos Buttler (103 runs in 3 innings) and Pakistan pacer Mohammad Amir (6 wickets in 2 innings) are the highest run-scorer and wicket-takers respectively. The highest total in an innings is 221/5 by England against Australia during the only T20I encounter between these two sides in June 2018. The lowest innings total, on the other hand, is Australia’s 144/10 versus Pakistan in the year 2010. England’s Jos Buttler and Eoin Morgan have jointly smashed the maximum number of 8 Sixes at this venue, with Aaron Finch’s 41-ball 84 against England in Birmingham (2018) being the highest individual score at this venue in a T20I encounter. Edgbaston records average score in Birmingham T20Is The average first innings score in the five T20Is at this stadium is 169.6 and the average second-innings score is 151. The teams batting first have won all the five T20Is at this venue till date. The post Birmingham cricket ground records: Edgbaston records average score in Birmingham T20Is appeared first on The SportsRush.","pubDate":"2022-07-08 16:38:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI: विराट को टी20 सीरीज में मिलेगा आराम, रोहित रहेंगे कप्तान, ऐसी होगी टीम!","link":"https://www.abplive.com/sports/cricket/virat-kohli-may-get-rest-in-t20-series-against-west-indies-see-possible-playing-11-2164002","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>INDIA Tour of WI:</strong> इंग्लैंड (England) दौरे के बाद भारतीय टीम वेस्टइंडीज (INDIA Tour of West Indies) का दौरा करेगी. यहां दोनों टीमों के बीच 3 वनडे और 5 टी20 मैचों की सीरीज खेली जाएगी. विंडीज दौरे के लिए बीसीसीआई (BCCI) पहले ही वनडे टीम का एलान कर चुकी है. शिखर धवन (Shikhar Dhawan) को भारतीय टीम का कप्तान जबकि रविंद्र जडेजा (Ravindra jadeja) को उपकप्तान बनाया गया है. जल्द ही इस दौरे के लिए टी20 टीम का एलान किया जाएगा. कयास लगाए जा रहे हैं कि विराट कोहली (Virat Kohli) को टी20 सीरीज में आराम दिया जा सकता है.&nbsp;</p> <p style=\"text-align: justify;\"><strong>बुरे दौर से गुजर रहे विराट</strong><br />वेस्टइंडीज के खिलाफ वनडे सीरीज के लिए रोहित शर्मा (Rohit Sharma), विराट कोहली, ऋषभ पंत और जसप्रीत बुमराह को आराम दिया गया है. यह खिलाड़ी इंग्लैंड दौरे पर भारतीय टीम का हिस्सा हैं. वहीं पूर्व भारतीय कप्तान विराट कोहली (Virat Kohli) को विंडीज के खिलाफ टी20 सीरज के लिए आराम दिया जा सकता है. कोहली क्रिकेट के सभी फॉर्मेट में इन दिनों बुरे दौर से गुजर रहे हैं. उन्हें इंग्लैंड के खिलाफ आखिरी दो टी20 में मौका दिया गया है. ऐसे में उनके पास अपने आप को साबित करने का मौका है.</p> <p style=\"text-align: justify;\"><strong>वनडे में रोहित को आराम</strong><br />रोहित शर्मा (Rohit Sharma) विंडीज दौरे पर टी20 की कमान संभालेंगे. रोहित को वनडे सीरीज में आराम दिया गया है. वहीं रोहित के साथ ईशान किशन ओपनिंग कर सकते हैं. मिडिल ऑर्डर में दीपक हुड्डा, सूर्यकुमार यादव, श्रेयस अय्यर, ऋषभ पंत, हार्दिक पांड्या और संजू सैमसन को मौका मिल सकता है. वहीं गेंदबाजी का जिम्मा जसप्रीत बुमराह, भुवनेश्वर कुमार, हर्षल पटेल, उमरान मलिक, अर्शदीप सिंह, युजवेंद्र चहल, अक्षर पटेल, रविंद्र जडेजा, आवेश खान को सौंपा जा सकता है.&nbsp;</p> <p style=\"text-align: justify;\"><strong>टी20 सीरीज के संभावित भारतीय स्क्वॉड</strong><br />रोहित शर्मा (कप्तान), ईशान किशन, दीपक हुड्डा, सूर्यकुमार यादव, श्रेयस अय्यर, ऋषभ पंत, संजू सैमसन, ऋतुराज गायकवाड़, हार्दिक पांड्या, अक्षर पटेल, रविंद्र जडेजा, जसप्रीत बुमराह, भुवनेश्वर कुमार, हर्षल पटेल, उमरान मलिक, अर्शदीप सिंह, युजवेंद्र चहल, आवेश खान.</p> <p style=\"text-align: justify;\"><strong>वनडे सीरीज के लिए भारतीय टीम:</strong> शिखर धवन (कप्तान), रवींद्र जडेजा (उपकप्तान), ऋतुराज गायकवाड़, शुभमन गिल, दीपक हुड्डा, सूर्यकुमार यादव, श्रेयस अय्यर, ईशान किशन (विकेटकीपर), संजू सैमसन (विकेटकीपर), शार्दुल ठाकुर, युजवेंद्र चहल, आवेश खान, प्रसिद्ध कृष्णा, अक्षर पटेल, मोहम्मद सिराज, अर्शदीप सिंह.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/american-female-basketball-player-brittany-griner-sentenced-to-prison-in-russia-2163970\">अमेरिकी महिला बॉस्केटबॉल खिलाड़ी ब्रिटनी ग्रिनर को रूस में जेल, ड्रग्स तस्करी में मिली सजा</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/birthday-sourav-ganguly-dance-with-daughter-sana-and-wife-dona-in-london-video-goes-viral-2163925\">Sourav Ganguly Birthday: लंदन की सड़कों पर परिवार संग थिरकते नजर आए दादा, वायरल हुआ Video</a></strong></p>","content":null,"pubDate":"2022-07-08 16:23:50","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs ENG 2nd T20: Sourav Ganguly breaks his silence on 7 India captains in 7 months, says THIS","link":"https://zeenews.india.com/cricket/ind-vs-eng-2nd-t20-sourav-ganguly-breaks-his-silence-on-7-india-captains-in-7-months-says-this-2483208.html","keywords":null,"creator":null,"video_url":null,"description":"Team India is going through a strange phase in international cricket across formats. Since Virat Kohli stepped down as captain in all formats last year, Team India has seen 7 captains in 7 months. The baton was passed from Kohli to Rohit Sharma, who led vs New Zealand at home. But in South Africa, KL Rahul was the ODI captain. Back in SA home T20 series, the captaincy went to Rishabh Pant. For Ireland T20s, Hardik Pandya was given the opportunity to lead the national side. In between, in the two T20 warm-up games, India were led by Dinesh Karthik. And in the last and fifth Test vs England, India had a new captain in Jasprit Bumrah. There have been several stand-in captains, all due to non-availability of Rohit due to tight scheduling or health issue.","content":"IND vs ENG 2nd T20: Team India is going through a strange phase in international cricket across formats. Since Virat Kohli stepped down as captain in all formats last year, Team India has seen 7 captains in 7 months. The baton was passed from Kohli to Rohit Sharma, who led vs New Zealand at home. But in South Africa, KL Rahul was the ODI captain. Back in SA home T20 series, the captaincy went to Rishabh Pant. For Ireland T20s, Hardik Pandya was given the opportunity to lead the national side. In between, in the two T20 warm-up games, India were led by Dinesh Karthik. And in the last and fifth Test vs England, India had a new captain in Jasprit Bumrah. There have been several stand-in captains, all due to non-availability of Rohit due to tight scheduling or health issue. BCCI president Sourav Ganguly has now opened up on the so many captaincy changes, which man fans believe makes Indian cricket look unserious about the sport in the country as there is no one man to lead the country in the sport. Ganguly said that this is happening due to an unavoidable situation. \"I fully agree that it is not ideal to have seven different captains in such a short span of time but it has happened because of unavoidable situation. Like Rohit was all set to lead in South Africa in white ball but before the tour, got injured. So we had KL (Rahul) leading in ODIs and then for this recent SA home series, KL got injured one day before the series would start,\" Ganguly told PTI. He added that head coach Rahul Dravid has to go through a tough challenge with so many captains but it is something that is not in control of anyone. \"In England, Rohit was playing the warm-up game when he had COVID-19. No one is at fault for these situations. The calender is such that we have had to give players breaks and then there have been injuries and we need to factor in workload management also. You got to feel for head coach Rahul (Dravid) as in every series, due to unavoidable circumstances, we have had new captains,\" said Ganguly.","pubDate":"2022-07-08 16:19:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL franchises and cricket fraternity extend wishes to BCCI President Sourav Ganguly as he turns 50","link":"https://www.dnaindia.com/cricket/report-ipl-franchises-and-cricket-fraternity-extend-wishes-to-bcci-president-sourav-ganguly-as-he-turns-50-2966945","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Several IPL franchises and cricketers took to social media to wish former India skipper Sourav Ganguly as the BCCI president turned 50 on Friday.","content":null,"pubDate":"2022-07-08 16:08:28","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/07/08/2520852-947270-ganguly.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly Birthday: दादा को दादी क्यों कहते हैं सचिन तेंदुलकर, खुद वीडियो शेयर कर बताया दिलचस्प कारण","link":"https://www.abplive.com/sports/cricket/sachin-tendulkar-share-video-on-sourav-ganguly-birthday-for-wish-says-happy-birthday-dadi-2163973","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Sachin Tendulkar Sourav Ganguly VIDEO:</strong> पूर्व कप्तान सौरव गांगुली और सचिन तेंदुलकर ने टीम इंडिया के लिए कई बार दमदार प्रदर्शन किया है. इन दोनों ही खिलाड़ियों ने यादगार पारियों से भारत की जीत में कई बार अहम भूमिका निभाई. गांगुली और सचिन की दोस्ती काफी पुरानी है. ये दोनों के मैदान के साथ-साथ मैदान के बाहर भी अच्छी यारी के लिए जाने जाते हैं. सचिन ने गांगुली के बर्थडे पर उन्हें खास अंदाज में विश किया. सचिन ने एक वीडियो शेयर किया है.&nbsp;</p> <p style=\"text-align: justify;\">सचिन ने अपने ऑफिशियल ट्विटर हैंडल पर एक वीडियो ट्वीट किया है. इसमें उन्होंने गांगुली को जन्मदिन की बधाई दी है. इसके साथ-साथ सचिन ने बताया कि वे गांगुली को दादा की जगह दादी क्यों कहते हैं. सचिन ने वीडियो में कहा, ''हैप्पी बर्थडे दादी. कैसे हो? ठीक हो. सब यही सोच रहे होंगे कि यह दादा को दादी क्यों बुलाता है. मैंने क्लियरीफाई करने के लिए बता दूं कि हम 13 साल के थे तब इंदौर कैम्प में मिले थे. मैं उस समय से दादा को दादी बुलाता हूं.''</p> <p style=\"text-align: justify;\">गौरतलब है कि गांगुली का इंटरनेशनल रिकॉर्ड शानदार रहा है. उन्होंने 113 टेस्ट मैचों में 7212 रन बनाए हैं. जबकि 311 वनडे मैचों में 11363 रन बना चुके हैं. गांगुली ने वनडे में 22 शतक और 72 अर्धशतक लगाए हैं. वहीं टेस्ट में 16 शतक जड़ चुके हैं.&nbsp;</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"und\">জন্মদিনের অনেক অনেক শুভেচ্ছা এবং ভালোবাসা, দাদি।<br /><br />Lots of wishes and love for your birthday Dadi.<a href=\"https://twitter.com/SGanguly99?ref_src=twsrc%5Etfw\">@SGanguly99</a> <a href=\"https://t.co/6njyuU80FB\">pic.twitter.com/6njyuU80FB</a></p> &mdash; Sachin Tendulkar (@sachin_rt) <a href=\"https://twitter.com/sachin_rt/status/1545356703159369734?ref_src=twsrc%5Etfw\">July 8, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/shikhar-dhawan-says-about-batting-technique-ind-vs-eng-odi-series-indian-cricket-team-2163951\">IND vs ENG: Shikhar Dhawan ने बैटिंग के तरीके पर दी प्रतिक्रिया, बताया किस पर करते हैं सबसे ज्यादा भरोसा</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/guru-randhawa-attend-ms-dhoni-birthday-celebration-mohammed-siraj-photos-2163835\"><strong>MS Dhoni के बर्थडे में पहुंचे सिंगर Guru Randhawa, तस्वीरों में देखें और कौन-कौन हुआ शामिल</strong></a></p>","content":null,"pubDate":"2022-07-08 16:08:10","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Lizelle Lee from South African women's team retires from international cricket with immediate effect","link":"https://www.dnaindia.com/cricket/report-lizelle-lee-from-south-african-women-s-team-retires-from-international-cricket-with-immediate-effect-2966944","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Lee, 30, who made her international debut in 2013 against Bangladesh, further said that she will continue to play domestic T20 cricket.","content":null,"pubDate":"2022-07-08 16:04:48","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/07/08/2520850-fotojet-5.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe 2022: IND vs ZIM 2022 upcoming cricket match list","link":"https://thesportsrush.com/cricket-news-india-vs-zimbabwe-2022-ind-vs-zim-2022-upcoming-cricket-match-list/","keywords":["Cricket","India Cricket Team","India","India tour of Zimbabwe 2022","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Zimbabwe 2022 upcoming cricket match list: India will be touring Zimbabwe after as many as six years next month. India will be touring Zimbabwe to play a three-match ODI series in August. Part of the ongoing ICC ODI Super League, India vs Zimbabwe ODIs will resume their cricketing rivalry after as many as… The post India vs Zimbabwe 2022: IND vs ZIM 2022 upcoming cricket match list appeared first on The SportsRush.","content":"India vs Zimbabwe 2022 upcoming cricket match list: India will be touring Zimbabwe after as many as six years next month. India will be touring Zimbabwe to play a three-match ODI series in August. Part of the ongoing ICC ODI Super League, India vs Zimbabwe ODIs will resume their cricketing rivalry after as many as six years. Although with a second-string squad, it was under the captaincy of Mahendra Singh Dhoni that India had last toured Zimbabwe for three ODIs and as many T20Is in 2016. Readers must note that India were scheduled to host Zimbabwe for three T20Is in January 2020 but the series didn’t materialize after ICC had banned Zimbabwe in 2019. As a result, Sri Lanka had substituted for Zimbabwe for a three-match T20I series on the same dates. India vs Zimbabwe 2022 While India were always scheduled to tour Zimbabwe next month, the exact dates have only been known after Cricbuzz has published a report regarding the same. “We are absolutely delighted to host India and we look forward to a competitive and memorable series,” a Zimbabwe Cricket official told Cricbuzz on Friday. IND vs ZIM 2022 upcoming cricket match list August 18 – 1st ODI, Zimbabwe vs India in Harare August 20 – 2nd ODI, Zimbabwe vs India in Harare August 22 – 3rd ODI, Zimbabwe vs India in Harare It is noteworthy that an official confirmation around the same is yet to be made by both the cricketing boards. Assuming that Zimbabwe and India play three ODIs on the aforementioned dates, it would result in India playing international cricket in three different continents in one month. Currently in England, India will move to West Indies for a white-ball tour to be played between July 22 – August 7. With Asia Cup 2022 expected to begin from August 27, it wouldn’t be a surprise if the Indian squad in Zimbabwe remains devoid of first-choice players. It is worth mentioning that the Indian ODI squad for West Indies tour doesn’t comprise of A-list players either. The post India vs Zimbabwe 2022: IND vs ZIM 2022 upcoming cricket match list appeared first on The SportsRush.","pubDate":"2022-07-08 15:19:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Edgbaston Birmingham stadium pitch report: Edgbaston batting or bowling pitch IND vs ENG 2nd T20","link":"https://thesportsrush.com/cricket-news-edgbaston-birmingham-stadium-pitch-report-edgbaston-batting-or-bowling-pitch-ind-vs-eng-2nd-t20/","keywords":["Cricket","Birmingham","Edgbaston","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Edgbaston Birmingham stadium pitch report: After registering a thumping victory in the 1st T20I, India take on England in 2nd T20I tomorrow. Despite an ordinary fielding display at Southampton yesterday, a comprehensive all-round performance with both bat and the ball during the first T20I against England meant that the Rohit Sharma-led side registered a resounding… The post Edgbaston Birmingham stadium pitch report: Edgbaston batting or bowling pitch IND vs ENG 2nd T20 appeared first on The SportsRush.","content":"Edgbaston Birmingham stadium pitch report: After registering a thumping victory in the 1st T20I, India take on England in 2nd T20I tomorrow. Despite an ordinary fielding display at Southampton yesterday, a comprehensive all-round performance with both bat and the ball during the first T20I against England meant that the Rohit Sharma-led side registered a resounding 50-run victory, in the three-match series. But, there are some expected changes to take place in the Indian Playing XI tomorrow, during the second match of the series at the Edgbaston Cricket Ground, in Birmingham – the very venue where England nailed their highest-successful run-chase ever in Test match history a few days ago against India. Also, the likes of Virat Kohli, Jasprit Bumrah, Shreyas Iyer, Rishabh Pant, and Ravindra Jadeja – all of who were part of the aforementioned fifth Test match, would be available for selection in the final two T20Is, thereby making way for a good headache for the captain and head coach while selecting the eleven players tomorrow and the day after. While England would play their fourth T20I at Edgbaston tomorrow, India would play their second, having lost the lone one against the hosts by 3 runs in September 2014. India lead series 1-0. Can England bounce back at Edgbaston?#Edgbaston | #ENGvIND pic.twitter.com/GJnzZBg4iC — Edgbaston (@Edgbaston) July 8, 2022 Edgbaston Birmingham stadium pitch report England scored at around five runs an Over to chase down the target of 378 during the fourth innings of the rescheduled Test, to leave the Indian bowlers absolutely stupefied, at this very venue a few days ago. Thus, with the average first innings score at this stadium being 169, there are no points for guessing that the batters are bound to have a merry time during the second T20I. However, akin the first T20I at Southampton, the Edgbaston pitch would also offer significant carry and swing to the pacers with the new ball upfront, to pose a threat to the top-order. With the teams batting first having won all the five T20Is at this venue till date, expect the captain winning the Toss to bat first. The post Edgbaston Birmingham stadium pitch report: Edgbaston batting or bowling pitch IND vs ENG 2nd T20 appeared first on The SportsRush.","pubDate":"2022-07-08 15:19:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"अमेरिकी महिला बॉस्केटबॉल खिलाड़ी ब्रिटनी ग्रिनर को रूस में जेल, ड्रग्स तस्करी में मिली सजा","link":"https://www.abplive.com/sports/cricket/american-female-basketball-player-brittany-griner-sentenced-to-prison-in-russia-2163970","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Brittany guilty in drug case:</strong> रूस (russia) की एक अदालत में गुरुवार को अमेरिकी महिला बास्केटबॉल प्लेयर ब्रिटनी ग्रिनर (brittany griner) ने ड्रग्स रखने और इसकी तस्करी का आरोप कबूल कर लिया. रूसी मीडिया के मुताबिक ब्रिटनी ने गुरुवार को अदालत में सुनवाई के दौरान अपना दोष स्वीकार किया. कोर्ट में सुनवाई के दौरान उन्होंने कहा कि अनजाने में ऐसा हुआ है. वह जल्दबाजी में सामान पैक कर रहीं थी, ऐसे में उन्हें नहीं पता चला की उनके बैग में मादक पदार्थ है.</p> <p style=\"text-align: justify;\"><strong>फरवरी में हिरासत में लिया था</strong><br />बता दें कि फरवरी में ब्रिटनी (brittany griner) को मॉस्को के शेरेमेतियोवो एयरपोर्ट पर हिरासत में लिया गया था. यहां कथित तौर पर उनके सामान में मारिजुआना तेल मिला था. फीनिक्स मरकरी टीम की स्टार और दो बार ओलंपिक स्वर्ण पदक विजेता टीम की हिस्सा रही ब्रिटनी के मामले की सुनवाई पिछले हफ्ते शुरू हुई थी. ब्रिटनी ड्रग आरोपों की सुनवाई के लिए गुरुवार को रूस की अदालत पहुंची, इसी दौरान रूस के एक वरिष्ठ राजनयिक ने चेतावनी दी कि अमेरिका इस मामले से निपटने के तरीके के लिए जिस तरह रूस की आलोचना कर रहा है इससे उनकी रिहाई की संभावना में मदद नहीं मिलेगी.</p> <p style=\"text-align: justify;\"><strong>ऐसा करने वाली एकमात्र महिला</strong><br />ब्रिटनी ग्रिनर (brittany griner) फीनिक्स मर्क्यूरी के लिए महिला राष्ट्रीय बास्केटबॉल एसोसिएशन (WNBA) में 7 बार की ऑल-स्टार सेंटर रही हैं. 6 फीट 9 इंच लंबी ब्रिटनी यूएस कॉलेज के इतिहास में 2,000 अंक हासिल करने और 500 शॉट्स को ब्लॉक करने वाली एकमात्र महिला हैं. ब्रिटनी के मामले की सुनवाई के बीच वाशिंगटन से अपील की जा रही है कि वह इस खिलाड़ी को छुड़ाने के लिए अधिक प्रयास करे. यह खिलाड़ी 5 महीने से अधिक समय से जेल में है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/birthday-sourav-ganguly-dance-with-daughter-sana-and-wife-dona-in-london-video-goes-viral-2163925\">Sourav Ganguly Birthday: लंदन की सड़कों पर परिवार संग थिरकते नजर आए दादा, वायरल हुआ Video</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-live-streaming-when-and-where-to-watch-india-vs-england-2nd-t20-telecast-2163884\">IND vs ENG 2nd T20: कब, कहां और कैसे देखें भारत-इंग्लैंड के बीच दूसरा टी20, ऑनलाइन देखने के लिए करना होगा ये काम&nbsp;</a></strong></p>","content":null,"pubDate":"2022-07-08 15:18:23","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ganguly@50: Seven captains in seven series isn’t ideal but there isn’t much we can do about it","link":"https://www.orissapost.com/ganguly50-seven-captains-in-seven-series-isnt-ideal-but-there-isnt-much-we-can-do-about-it/","keywords":["Sports","Sourav Ganguly"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: For someone who has always believed in continuity, Sourav Ganguly says having seven India captains in as many months “isn’t ideal”. But things panned out that way owing to factors that were beyond anyone’s control. As he rang in his 50th birthday with friends and family in London, the BCCI president, and one […]","content":"[email protected] : Seven captains in seven series isn’t ideal but there isn’t much we can do about it PTI Updated: July 8th, 2022, 20:33 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: For someone who has always believed in continuity, Sourav Ganguly says having seven India captains in as many months “isn’t ideal”. But things panned out that way owing to factors that were beyond anyone’s control. As he rang in his 50th birthday with friends and family in London, the BCCI president, and one of Indian cricket’s most fascinating characters, spoke on a range of issues in an exclusive interview with the PTI. The discussion included current issues like multiple captains, workload management, huge media rights valuation and heading the board. He also took a trip down memory lane, recollecting his time as a player and captain. Excerpts from interview: Q: We have had Virat Kohli, Rohit Sharma, KL Rahul, Rishabh Pant, Hardik Pandya, Jasprit Bumrah as India captains and now Shikhar Dhawan for ODIs. Continuity has been affected. What’s your take on that? A: I fully agree that it is not ideal to have seven different captains in such a short span of time but it has happened because of unavoidable situation. Like Rohit was all set to lead in South Africa in white ball but before the tour, got injured. So we had KL (Rahul) leading in ODIs and then for this recent SA home series, KL got injured one day before the series would start. In England, Rohit was playing the warm-up game when he had COVID-19. No one is at fault for these situations. The calender is such that we have had to give players breaks and then there have been injuries and we need to factor in workload management also. You got to feel for head coach Rahul (Dravid) as in every series, due to unavoidable circumstances, we have had new captains. Q: Do you feel the choc-a-bloc FTP calendar is creating a situation where we are seeing players taking far too many breaks due to workload management issues? A: Let me tell you something which I have believed all through my international career. The more you play, the better you get and fitter you become. At this level, you need game time and your body becomes stronger as you start playing more and more games. Yes, the IPL started from 2008 but I would like you to check how much of international cricket we played through our careers. If you compare, the volume of international cricket for Indian team in a calender year hasn’t increased significantly. We played a lot of ODI cricket, so if you see, the number of international match days is almost same. Q: We now have 10 IPL teams and the BCCI is set to earn more than Rs 60,000 crore in coming years through sale of teams and media rights. Do you fear that there could be compromise in quality of players that we will produce in future as numbers would increase? A: Not at all. On the contrary, I would say that the pool of talent in Indian cricket will only increase with passage of time and IPL has shown us the depth of talent we have in this country. You look at the two Indian teams (white and red ball) and kind of players we have been producing over the years. Q: Let’s talk a bit about your time as BCCI president for nearly three years now. How has the tenure been for you and challenges you think that you faced? A: When I became president in 2019, it was with the consent of the members associations of BCCI, and it has been a great experience. You get a chance to work for betterment of Indian cricket and a serious opportunity to change things. Being able to conduct events in two COVID-19 years was challenging, but BCCI as a team pulled off both IPL and domestic cricket (men and women) well. When I joined BCCI, I already had five years of experience in administration, having worked as CAB joint secretary and subsequently as president. You can say in 2014, I was just retired from competitive cricket for two years, having played IPL till 2012, and I was pushed into CAB administration. It was interesting as well as a challenging experience for me. Q: Did you regret retiring in 2008 season when you were perhaps batting your best in Test cricket having scored runs against England in England, Pakistan (Man of the Series) at home and a fabulous swansong versus Australia? A: I can tell you one thing about myself. I have never had regrets about anything in my life. If I retired after the series against Australia, it was at a time when I was on a high. And you were talking about Test matches but just would like to remind you that I had scored nearly 1250 runs (1240 to be precise) in 2007 season, when I was dropped from the ODI side. I had 12 half-centuries that year in 50-over cricket. Q: More than on-field, did you miss the dressing room and being one of the lads? A: I don’t miss dressing room. I never missed anything. Nothing stays forever. Everything has to come to an end. I had a great career and it was time to move on and I was glad that I finished on a high. In life, the only constant is to keep moving. Times change, and your role changes. Q: During the phase between 1992 and 1996 when you were out of the Indian team and then nearly a year during the Greg Chappell era, did you ever feel that external forces were trying to finish your career. Did you feel angry or do you have any grudges about those phases? A: I have learnt one thing in my life. Nobody can ever finish your career. If you have the skills, the self-belief and confidence to chart your own destiny, you will do it. In 1992, when I was dropped post Australia tour, I was very young and had a long time. So I was more focused on the process of comeback rather than sulking on who said what about me. That is waste of time. Q: 131 at Lord’s on debut, 144 at Gabba as India captain or 51 at Johannesburg in your comeback Test in 2006. Which one was more challenging? A: Add 87 on a rank turner at Green Park against a good South African attack in this list. But it is difficult to choose one innings. At Lord’s, I was making my Test debut, which has its own kind of pressure. At Gabba, I was leading the team and I had to show the way against the Australians. In Johannesburg, it was very different as I was dropped for nearly a year. I think that surface was very challenging and hardly anyone scored a half-century in that game. But Kanpur innings would be one of my favourites as it gave me more satisfaction than I would have ever got scoring 160 on a flat deck. Q: So how does it feel on your 50th birthday? A: No special feelings as nothing stops in life. PTI Tags: Sourav Ganguly Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Hungry for medals, Nikhat hopes boxers win four golds at CWG July 8, 2022 PV Sindhu loses again to Tai Tzu Ying, 7th defeat in succession July 8, 2022 Birthday wishes pour in for Ganguly on his 50th birthday July 8, 2022 My mindset doesn’t take me too high, neither low: Hardik Pandya July 8, 2022 With youngsters performing, pressure mounts on Kohli ahead of his T20 return July 8, 2022 Kapil Dev to be guest of honour at Indian Film Festival of Melbourne July 8, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-07-08 15:03:10","image_url":"https://www.orissapost.com/wp-content/uploads/2020/11/Sourav-Ganguly-1-300x188.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG: Shikhar Dhawan ने बैटिंग के तरीके पर दी प्रतिक्रिया, बताया किस पर करते हैं सबसे ज्यादा भरोसा","link":"https://www.abplive.com/sports/cricket/shikhar-dhawan-says-about-batting-technique-ind-vs-eng-odi-series-indian-cricket-team-2163951","keywords":null,"creator":["Agencies"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Shikhar Dhawan ODI England vs India:</strong> वनडे क्रिकेट में एक सलामी बल्लेबाज के रूप में सफल होने के लिए बल्लेबाजों को पारी की शुरुआत में गेंदबाजों को परखने की आवश्यकता होती है. भारत के सलामी बल्लेबाज शिखर धवन 2010 में अपने अंतरराष्ट्रीय डेब्यू के बाद से यह कार्य कर रहे हैं. लेकिन 2013 में धवन ने वनडे मैचों में सलामी बल्लेबाज के रूप में अपनी स्थिति को मजबूत किया, जब आईसीसी चैंपियंस ट्रॉफी में 363 रनों के साथ सबसे अधिक रन बनाने वाले खिलाड़ी बन गए और भारत को ट्रॉफी जिताने में बड़ी भूमिका निभाई. तब से धवन वनडे टीम का एक अभिन्न हिस्सा रहे हैं, जिसमें 149 वनडे मैचों में 45.53 की औसत से 6,284 रन बनाए हैं, जिसमें 17 शतक और 35 अर्धशतक शामिल हैं.</p> <p style=\"text-align: justify;\">अब, 2022 में वनडे स्पेशलिस्ट के रूप में देखे जाने वाले धवन वापस मैदान पर कदम रखेंगे, जब भारत 12, 14 और 17 जुलाई को इंग्लैंड के खिलाफ तीन वनडे मैच खेलेगा. इसके बाद, धवन वेस्टइंडीज के खिलाफ तीन मैचों के वनडे दौरे में भारत की कप्तानी करेंगे. इससे पहले, उन्होंने पिछले साल श्रीलंका में सफेद गेंद के दौरे में टीम की कप्तानी की थी.</p> <p style=\"text-align: justify;\">उन्होंने कहा, ''मैं पिछले कुछ सालों से वनडे खेल रहा हूं और इससे मुझे काफी अनुभव हासिल करने में मदद मिली है. यह एक अच्छा प्रारूप है. आपको 50 ओवर के मैच में आक्रामक खेलना होता है और स्थिति के अनुसार इसे शांत रहकर आगे बढ़ाना होता है. मुझे लगता है कि मेरे बेसिक्स शुरुआत से ही मजबूत रहे हैं, मैं अपनी तकनीक पर भरोसा करता हूं और खेलते समय दिमाग को शांत रखता हूं.''</p> <p style=\"text-align: justify;\">धवन ने कहा, ''मैं खुद को तैयार रखता हूं. मुझे पता है कि मुझे दौरे से पहले अच्छी तैयारी करनी है, इसलिए मैं हमेशा अपनी प्रक्रिया पर ध्यान केंद्रित करता हूं और हमेशा एक प्रणाली का पालन करता हूं. अब मुझे इंग्लैंड में वनडे खेलने का मौका मिला है, इसलिए मैं इसकी तैयारी कर रहा हूं. सर्वोत्तम संभव तरीके से अधिक से अधिक मैच खेलना महत्वपूर्ण है, ताकि आप खेल के संपर्क में रहें.''</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/birthday-sourav-ganguly-dance-with-daughter-sana-and-wife-dona-in-london-video-goes-viral-2163925\">Sourav Ganguly Birthday: लंदन की सड़कों पर परिवार संग थिरकते नजर आए दादा, वायरल हुआ Video</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/virat-kohli-comeback-after-5-months-t20i-india-vs-england-t20-birmingham-2163890\"><strong>IND vs ENG: 5 महीने बाद टी20 में होगी किंग कोहली की वापसी, अच्छे प्रदर्शन का होगा दबाव; जानें पिछले आंकड़े</strong></a></p>","content":null,"pubDate":"2022-07-08 15:00:53","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"‘We were our own enemies, we let ourselves down’: Aasif Karim reflects on the lost glory of cricket in Kenya","link":"https://sportstar.thehindu.com/cricket/aasif-karif-former-kenya-cricket-captain-lost-glory-of-cricket-india-bcci-sandeep-patil/article65617057.ece","keywords":null,"creator":["\n        Vijay Lokapally  \n    "],"video_url":null,"description":"Karim, who played 34 ODIs, was part of the Kenyan team at three ICC World Cups in 1996, 1999 and 2003. He led the team in 1999.","content":null,"pubDate":"2022-07-08 14:46:46","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Disadvantage To Indian Cricket\": Gavaskar On Foreign Coaches In IPL","link":"https://sports.ndtv.com/cricket/disadvantage-to-indian-cricket-sunil-gavaskar-on-foreign-coaches-in-ipl-3140849","keywords":null,"creator":null,"video_url":null,"description":"Sunil Gavaskar has raised an important point about foreign coaches getting first hand information about Indian players during their stints in the IPL.","content":"Former India captain and batting legend Sunil Gavaskar has raised an important point about foreign coaches getting first hand information about Indian players during their stints in the IPL. Gavaskar was asked about the incident during the Edgbaston Test when it was reported that England head coach Brendon McCullum signalled his bowlers from the balcony to bowl short deliveries at Shreyas Iyer . Gavaskar told Sports Today that he had not seen the incident but he pointed out that IPL stints for foreign coaches is something that needs to be looked into because it is proving to be disadvantageous for Indian cricket in the larger scheme of things. \"It is something that we need to look at when it comes to coaches in the IPL. You have a lot of players who are coaching their national teams and when they come to the IPL, they tend to see our players first hand. Now getting data from the computer and seeing players first hand is something different. Promoted \"So it is of disadvantage to Indian cricket because some of them may go back and assist, perhaps not be the main coaches but as assistant coaches or batting consultants or bowling consultants, who are coming in and getting first hand information about Indian players, that might not be advantageous for India,\" Gavaskar told Sports Today. India lost the Edgbaston Test by 7 wickets after they failed to make the most of a 100-run plus lead as batters succumbed to 245 in the second innings. The target of 378 runs was chased down in almost no time by the England batters with Joe Root and Jonny Bairstow slamming unbeaten tons.","pubDate":"2022-07-08 14:41:01","image_url":"https://c.ndtvimg.com/2021-09/dsqv8dpo_sunil-gavaskar-afp_625x300_29_September_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Malaysia Masters 2022: PV Sindhu को क्वार्टर फाइनल में ताई जू यिंग ने हराया, टूर्नामेंट से हुईं बाहर","link":"https://www.abplive.com/sports/malaysia-masters-2022-pv-sindhu-bows-out-loses-to-tai-tzu-ying-in-quarter-finals-2163945","keywords":null,"creator":["Agencies"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>PV Sindhu Malaysia Masters 2022:</strong> पूर्व विश्व चैंपियन पीवी सिंधु शुक्रवार को एक्सियाटा एरिना में अपने महिला एकल क्वार्टर फाइनल में टोक्यो 2020 की रजत पदक विजेता ताई जू यिंग से हारने के बाद मलेशिया मास्टर्स 2022 से बाहर हो गईं. बैडमिंटन विश्व रैंकिंग में सातवीं सिंधु को चीनी ताइपे और दुनिया की दूसरे नंबर की खिलाड़ी ताई जू से 55 मिनट तक चले मैच में 13-21, 21-12, 12-21 से हार का सामना करना पड़ा. सिंधु की ताई जू से यह लगातार सातवीं हार थी और 22 मैचों में 17वीं हार थी.</p> <p style=\"text-align: justify;\">दो बार के ओलंपिक पदक विजेता टोक्यो 2020 सेमीफाइनल में और पिछले हफ्ते मलेशिया ओपन क्वार्टर फाइनल में भी ताई जू से हार गई थीं. मैच में सिंधु को ताई जू के डिफेंस को तोड़ना मुश्किल लगा और पहले अंतराल पर 11-9 से पिछड़ गई. चीनी ताइपे शटलर ने बैकहैंड शॉट्स और स्मैश के अच्छे मिश्रण के साथ मैच में 1-0 की बढ़त बना ली.</p> <p style=\"text-align: justify;\">सिंधु ने दूसरे गेम में तेज शुरुआत की और 11-4 की बढ़त बना ली. ताई जू ने मध्य-खेल में वापसी की, लेकिन एक शुरुआती बढ़त ने भारतीय को तीसरे गेम में मैच ले जाने में मदद की. दोनों शटलरों ने अपने निर्णायक गेम में जोरदार मुकाबला कियाा. हालांकि, दो चुनौतियों से हारने के बाद, सिंधु ने अपनी लय खो दी और जल्दी ताई ने महत्वपूर्ण अंक हासिल कर लिए और ताई जू बीडब्ल्यूएफ सुपर 500 बैडमिंटन टूर्नामेंट के सेमीफाइनल में प्रवेश किया.</p> <p style=\"text-align: justify;\">पुरुष एकल में, मलेशिया मास्टर्स 2022 में भारत के एकमात्र शेष चैलेंजर एचएस प्रणय जापान के कांता सुनेयामा से भिड़ेंगे.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/birthday-sourav-ganguly-dance-with-daughter-sana-and-wife-dona-in-london-video-goes-viral-2163925\">Sourav Ganguly Birthday: लंदन की सड़कों पर परिवार संग थिरकते नजर आए दादा, वायरल हुआ Video</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/on-playing-test-cricket-hardik-pandya-said-that-at-the-moment-my-focus-is-only-on-t20-and-odi-cricket-2163929\"><strong>Hardik Pandya: टेस्ट क्रिकेट खेलने पर हार्दिक पांड्या का बड़ा बयान, कहा- इस वक्त लिमिटेड ओवर क्रिकेट मेरी प्राथमिकता, लेकिन...</strong></a></p>","content":null,"pubDate":"2022-07-08 14:29:54","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs ENG 2022: भारतीय फैंस के साथ नस्‍लीय दुर्व्‍यवहार पर बेन स्टोक्स ने दी अपनी प्रतिक्रिया, कही ये बात","link":"https://www.abplive.com/sports/cricket/england-captain-ben-stokes-on-racial-abuse-with-indian-fans-said-that-there-is-absolutely-no-place-for-racial-abuse-in-sports-2163919","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Ben Stokes On Racial Abuse:</strong> एजबेस्टन टेस्ट (Edgbaston Test)में इंग्लैंड ने भारत को 7 विकेट से हरा दिया. भारत के इस हार के बाद 5 टेस्ट मैचों की यह सीरीज 2-2 की बराबरी पर खत्म हुआ, लेकिन पांचवें टेस्ट के चौथे दिन भारतीय फैंस के साथ नस्&zwj;लीय (Racist) दुर्व्&zwj;यवहार के बाद विवाद थमने का नाम नहीं ले रहा है. अब इंग्लैंड के कप्तान बेन स्टोक्स (Ben Stokes) ने इस पूरे विवाद पर अपनी प्रतिक्रिया दी है. दरअसल, उन्होंने इस पूरे घटना की निंदा की है.</p> <p style=\"text-align: justify;\"><strong>'नस्&zwj;लीय दुर्व्&zwj;यवहार के लिए कोई बिल्कुल जगह नहीं है'</strong></p> <p style=\"text-align: justify;\">इंग्लैंड के कप्तान बेन स्टोक्स ने भारतीय फैंस के साथ नस्&zwj;लीय दुर्व्&zwj;यवहार मामले पर अपनी निराशा जाहिर की है. उन्होंने कहा कि खेल में नस्&zwj;लीय दुर्व्&zwj;यवहार के लिए कोई बिल्कुल जगह नहीं है, इसे कतई बर्दाश्त नहीं किया जाएगा. वहीं, बेन स्टोक्स को उम्मीद है कि भारत के खिलाफ टी20 और वनडे मैचों के दौरान बेहतरीन माहौल होगा और सब लोग इस खेल को एंजॉय करेंगे. इंग्लैंड के कप्तान ने कहा कि क्रिकेट के मैदान पर पिछला सप्ताह बेहतरीन रहा, क्योंकि हमने बड़े लक्ष्य का पीछा कर टेस्ट मैच अपने नाम किया.</p> <p style=\"text-align: justify;\"><strong>'मैदान पर समय शानदार बीता, लेकिन नस्&zwj;लीय दुर्व्&zwj;यवहार की खबरें सुन निराशा हुई'</strong></p> <p style=\"text-align: justify;\">बेन स्टोक्स (Ben Stokes) ने अपने ट्वीट में लिखा कि मैदान पर हमारा समय शानदार बीता, लेकिन एजबेस्&zwj;टन में नस्&zwj;लीय दुर्व्&zwj;यवहार की खबरें सुनकर निराशा हुई. उन्होंने कहा कि खेल में नस्&zwj;लीय (Racist) दुर्व्&zwj;यवहार के लिए बिल्कुल जगह नहीं है. वहीं, भारतीय टीम ने पहले टी20 मैच में इंग्लैंड को 50 रनों से हरा दिया. इस तरह भारतीय टीम 3 टी20 मैचो की सीरीज में 1-0 से आगे हो गई है. भारत ने पहले बल्लेबाजी करते हुए 20 ओवर में 8 विकेट पर 198 रन बनाए, जिसके जवाब में मेजबान इंग्लैंड 19.3 ओवर में महज 148 रनों पर सिमट गई. इस तरह भारत ने 50 रनों से मैच अपने नाम कर लिया.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/100-days-left-countdown-begins-for-2022-t20-world-cup-australian-captain-made-big-statement-2163767\">100 दिन बाकी: 2022 टी20 विश्व कप के लिए उलटी गिनती शुरू, ऑस्ट्रेलियाई कप्तान ने दिया बड़ा बयान</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-live-streaming-when-and-where-to-watch-india-vs-england-2nd-t20-telecast-2163884\">IND vs ENG 2nd T20: कब, कहां और कैसे देखें भारत-इंग्लैंड के बीच दूसरा टी20, ऑनलाइन देखने के लिए करना होगा ये काम&nbsp;</a><br /></strong></p>","content":null,"pubDate":"2022-07-08 14:26:56","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"GOOD BYE Bengal, Wriddhiman Saha finally signs to play for THIS side","link":"https://zeenews.india.com/cricket/good-bye-bengal-wriddhiman-saha-finally-signs-to-play-for-this-side-2483170.html","keywords":null,"creator":null,"video_url":null,"description":"Wriddhiman Saha has not yet retired from international cricket but he has been told by head coach Rahul Dravid that he will no more be considered for selection as Indian Test team is looking to invest in future.","content":null,"pubDate":"2022-07-08 14:20:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2nd T20I live streaming: When and where to watch India vs England in Birmingham","link":"https://www.dnaindia.com/cricket/report-ind-vs-eng-2nd-t20i-live-streaming-when-and-where-to-watch-india-vs-england-in-birmingham-2966927","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Know all the details about the upcoming 2nd T20I match between India vs England which will be played in Edgebaston Cricket Ground, Birmingham.","content":null,"pubDate":"2022-07-08 14:12:43","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/07/08/2520818-fotojet-4.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"I was looking to play risk-free cricket: Pandya on his 51 against England","link":"https://www.business-standard.com/article/sports/i-was-looking-to-play-risk-free-cricket-pandya-on-his-51-against-england-122070800895_1.html","keywords":null,"creator":null,"video_url":null,"description":"India all-rounder Hardik Pandya revealed that during his knock of 51 against England in the first T20I at Southampton, he was looking to play risk-free cricket.","content":"India all-rounder Hardik Pandya revealed that during his knock of 51 against England in the first T20I at Southampton, he was looking to play risk-free cricket. Coming at number five, Pandya slammed his maiden T20I fifty, 51 off 33 balls, laced with six fours and six as India reached 198/8 in their 20 overs. Pandya's day became more brighter when he took 4-33 his allotted four overs of right-arm pace, troubling the England batters with hard lengths and bowled some seam-up deliveries in between to rattle an explosive batting order, which crashed to 148 all out, giving India a 50-run win and a 1-0 lead in three-match series. \"It was very simple. It's a conscious effort by everyone that we will make sure that we want to express ourselves and enjoy out there. It's a great sign for Indian cricket, as all the batters showed positive intent and are going after the bowling from the second ball if possible, which is something which will help us a lot in T20 cricket.\" \"Personally, I was looking to play risk-free cricket as if just one wicket had fallen, would have gone for more sixes and big shots. But I knew that the wicket was good. Batting higher up the order in the IPL has helped me in finding the gaps through which areas. I have hit sixes my whole life but scoring boundaries content my heart more now. Fours touch my heart now,\" said Pandya to teammate Ishan Kishan in a video by the BCCI on their official website. Pandya's all-round efforts meant that he bagged Player of the Match award. But what made him happy was bowling a delivery in his spell, clocking 146 kmph, which surprised Kishan. Asked about the same, Pandya credited the hard work put in by the support staff. \"In my heart, I was happier because of when I bowled that delivery at 90.5 mph. All the credit goes to the support staff behind the scenes, especially Soham Desai and Harsha (strength and conditioning coaches), who have worked non-stop and make sure to prepare us for the matches after the Ireland series.\" Pandya then revealed that he skipped the practice T20s against Derbyshire and Northamptonshire to work on his fitness levels. \"I did not take a break after the Ireland tour. I trained hard for six days. I only worked on the skills in training yesterday as before that it was gym and running. In that block of six days, the specific training I did, as players, we get credit for our good performance. But I think behind the scenes, more credit should go to our trainers, masseurs and physios, especially Soham and Harsha should get a lot of credit.\" Pandya signed off by advising cricketers who aspire to play for India in future to work hard and be a good human being with clear intentions. \"Keep working hard without thinking about the result. Everything is good now, but I get happiness from the hard work I did for myself and not for the results. The result is a byproduct, which is a result of the success in hardwork put behind by you. I would want to tell them to keep a clear intention in life.\" \"Try to be a good person and work hard. When your mind is clear, you take better decisions. When you start wishing good things for your teammates, your competitors and even people whom you don't like, it doesn't matter how difficult time it is in life, you will come out on top.\"--IANS nr/inj (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-08 13:41:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220708/thumb-122070800895.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"7 captains in 7 series isn't ideal but there isn't much we can do about it: Ganguly","link":"https://timesofindia.indiatimes.com/sports/cricket/news/seven-captains-in-seven-series-isnt-ideal-but-there-isnt-much-we-can-do-about-it-sourav-ganguly/articleshow/92752257.cms","keywords":null,"creator":null,"video_url":null,"description":"For someone who has always believed in continuity, Sourav Ganguly says having seven India captains in as many months \"isn't ideal\". But things panned out that way owing to factors that were beyond anyone's control. As he rang in his 50th birthday with friends and family in London, the BCCI president, and one of Indian cricket's most fascinating characters, spoke on a range of issues.","content":"NEW DELHI: For someone who has always believed in continuity, Sourav Ganguly says having seven India captains in as many months \"isn't ideal\". But things panned out that way owing to factors that were beyond anyone's control. As he rang in his 50th birthday with friends and family in London, the BCCI president, and one of Indian cricket's most fascinating characters, spoke on a range of issues. The discussion included current issues like multiple captains, workload management, huge media rights valuation and heading the board. He also took a trip down memory lane, recollecting his time as a player and captain. Excerpts from interview: Q: We have had Virat Kohli , Rohit Sharma , KL Rahul , Rishabh Pant, Hardik Pandya, Jasprit Bumrah as India captains and now Shikhar Dhawan for ODIs. Continuity has been affected. What's your take on that? A: I fully agree that it is not ideal to have seven different captains in such a short span of time but it has happened because of unavoidable situation. Like Rohit was all set to lead in South Africa in white ball but before the tour, got injured. So we had KL (Rahul) leading in ODIs and then for this recent SA home series, KL got injured one day before the series would start. In England, Rohit was playing the warm-up game when he had COVID-19. No one is at fault for these situations. The calender is such that we have had to give players breaks and then there have been injuries and we need to factor in workload management also. You got to feel for head coach Rahul (Dravid) as in every series, due to unavoidable circumstances, we have had new captains. Q: Do you feel the choc-a-bloc FTP calendar is creating a situation where we are seeing players taking far too many breaks due to workload management issues? A: Let me tell you something which I have believed all through my international career. The more you play, the better you get and fitter you become. At this level, you need game time and your body becomes stronger as you start playing more and more games. Yes, the IPL started from 2008 but I would like you to check how much of international cricket we played through our careers. If you compare, the volume of international cricket for Indian team in a calender year hasn't increased significantly. We played a lot of ODI cricket, so if you see, the number of international match days is almost same. Q: We now have 10 IPL teams and the BCCI is set to earn more than Rs 60,000 crore in coming years through sale of teams and media rights. Do you fear that there could be compromise in quality of players that we will produce in future as numbers would increase? A: Not at all. On the contrary, I would say that the pool of talent in Indian cricket will only increase with passage of time and IPL has shown us the depth of talent we have in this country. You look at the two Indian teams (white and red ball) and kind of players we have been producing over the years. Q: Let's talk a bit about your time as BCCI president for nearly three years now. How has the tenure been for you and challenges you think that you faced? A: When I became president in 2019, it was with the consent of the members associations of BCCI, and it has been a great experience. You get a chance to work for betterment of Indian cricket and a serious opportunity to change things. Being able to conduct events in two COVID-19 years was challenging, but BCCI as a team pulled off both IPL and domestic cricket (men and women) well. When I joined BCCI, I already had five years of experience in administration, having worked as CAB joint secretary and subsequently as president. You can say in 2014, I was just retired from competitive cricket for two years, having played IPL till 2012, and I was pushed into CAB administration. It was interesting as well as a challenging experience for me. Q: Did you regret retiring in 2008 season when you were perhaps batting your best in Test cricket having scored runs against England in England, Pakistan (Man of the Series) at home and a fabulous swansong versus Australia? A: I can tell you one thing about myself. I have never had regrets about anything in my life. If I retired after the series against Australia, it was at a time when I was on a high. And you were talking about Test matches but just would like to remind you that I had scored nearly 1250 runs (1240 to be precise) in 2007 season, when I was dropped from the ODI side. I had 12 half-centuries that year in 50-over cricket. Q: More than on-field, did you miss the dressing room and being one of the lads? A: I don't miss dressing room. I never missed anything. Nothing stays forever. Everything has to come to an end. I had a great career and it was time to move on and I was glad that I finished on a high. In life, the only constant is to keep moving. Times change, and your role changes. Q: During the phase between 1992 and 1996 when you were out of the Indian team and then nearly a year during the Greg Chappell era, did you ever feel that external forces were trying to finish your career. Did you feel angry or do you have any grudges about those phases? A: I have learnt one thing in my life. Nobody can ever finish your career. If you have the skills, the self-belief and confidence to chart your own destiny, you will do it. In 1992, when I was dropped post Australia tour, I was very young and had a long time. So I was more focussed on the process of comeback rather than sulking on who said what about me. That is waste of time. Q: 131 at Lord's on debut, 144 at Gabba as India captain or 51 at Johannesburg in your comeback Test in 2006. Which one was more challenging? A: Add 87 on a rank turner at Green Park against a good South African attack in this list. But it is difficult to choose one innings. At Lord's, I was making my Test debut, which has its own kind of pressure. At Gabba, I was leading the team and I had to show the way against the Australians. In Johannesburg, it was very different as I was dropped for nearly a year. I think that surface was very challenging and hardly anyone scored a half-century in that game. But Kanpur innings would be one of my favourites as it gave me more satisfaction than I would have ever got scoring 160 on a flat deck. Q: So how does it feel on your 50th birthday? A: No special feelings as nothing stops in life.","pubDate":"2022-07-08 13:26:47","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"SL v Aus Second Test Day 1 Highlights","link":"https://www.cairnspost.com.au/sport/cricket/sl-v-aus-second-test-day-1-highlights/video/f60c11490d09cdaeb849b72dbc9b3d95","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Steve Smith and Marnus Labuschagne both claimed centuries on the first day of the second Test against Sri Lanka.","content":null,"pubDate":"2022-07-08 13:09:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"}]}