{"newsArray":[{"title":"Cricket: Ambidextrous spinner Nivethan Radhakrishnan named in Australian under 19 World Cup squad","link":"https://www.perthnow.com.au/sport/cricket-ambidextrous-spinner-nivethan-radhakrishnan-named-in-australian-under-19-world-cup-squad-c-4941325","keywords":null,"creator":["Russell Gould"],"video_url":null,"description":"A teenage spinner who bowls with his left and right hands has made the Australian under-19 World Cup squad.","content":null,"pubDate":"2021-12-14 04:00:08","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4941325/adcdeaf7f86a996d8eddf22b7b26496ff2b2e404-16x9-x0y0w2048h1152.jpg","source_id":"perthnow"},{"title":"Cricket-South Australians look to build on Ashes Head-start in Adelaide","link":"https://www.thestar.com.my/sport/cricket/2021/12/14/cricket-south-australians-look-to-build-on-ashes-head-start-in-adelaide","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - In-form batsman Travis Head said he will savour the chance to play in front of his home crowd in Adelaide with fellow South Australian Alex Carey as he looks to back up his majestic Gabba century with more runs in the second Ashes test. Read full story","content":null,"pubDate":"2021-12-14 03:59:00","full_description":"MELBOURNE (Reuters) - In-form batsman Travis Head said he will savour the chance to play in front of his home crowd in Adelaide with fellow South Australian Alex Carey as he looks to back up his majestic Gabba century with more runs in the second Ashes test. South Australia (SA) has produced fine cricketers like Greg Blewett and the Chappell brothers but Head has been his state's sole representative in the test set-up since his 2018 debut against Pakistan. Carey played his first test in Australia's nine-wicket win at the Gabba, taking a record eight catches by a debutant wicketkeeper. The 30-year-old one-day specialist also shared in a steadying 41-run partnership during Head's 152. \"It just felt like everyday. We've done it so much together,\" SA captain Head told reporters at Adelaide Oval on Tuesday. \"It was unfortunate we weren't able to have our families out there last week, so it's lucky that only a few days later we're coming to Adelaide and are going to experience that. \"I can't wait to get out there with him.\" Head's Man of the Match performance at the Gabba came while under pressure to justify his selection, having been dropped during the 2-1 India series defeat over the last home summer and picked ahead of the more experienced Usman Khawaja. He said the Gabba ton would not necessarily mean having less nerves as he walked out to the crease in Adelaide. \"I've got to earn the right again and best prepare myself over the next couple of days and enjoy the opportunity to again play for Australia,\" he added. With paceman Josh Hazlewood ruled out with a side strain, Australia's selectors must pick between two-test paceman Jhye Richardson or the uncapped Michael Neser for the day-night test against England at Adelaide Oval. Head said both would do well with the pink ball, while describing Neser as more of a like-for-like replacement for Hazlewood's supreme line-and-length bowling. \"I think Jhye probably has a bit more ball-speed and that raw ability, that raw talent,\" added Head. \"'Nes' is probably a little bit like the mould of Josh. He has relentless pressure, can get the ball to move around. We've seen that over a long period of time. \"Whoever gets that spot is ready to go.\" The second test in the five-match series begins on Thursday. (Reporting by Ian Ransom; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/14/1405601.jpg","source_id":"thestar_my"},{"title":"Star’s ultimate praise for wily veteran","link":"https://www.news.com.au/sport/cricket/big-bash/bbl-sixers-star-lloyd-pope-hails-stephen-okeefe-an-absolute-genius/news-story/a8dd2663b35e02de6c7e51b7bde86f24","keywords":null,"creator":null,"video_url":null,"description":"Sydney Sixers spinner Lloyd Pope has played with plenty of star bowlers early in his young cricket career, but it’s Stephen O’Keefe who he hailed as an “absolute genius”.","content":null,"pubDate":"2021-12-14 03:17:00","full_description":"Sydney Sixers spinner Lloyd Pope has played with plenty of star bowlers early in his young cricket career, but it’s Stephen O’Keefe who he hailed as an “absolute genius”. Pope, 22, made his first appearance in the famous magenta jersey in December 2018 after making his Sheffield Shield debut for South Australia in October of the same year. Watch every game of the KFC Big Bash League Live & On-Demand on Kayo or catch up for FREE with minis on Kayo Freebies. Join Kayo Now > He also became the first leg-spinner in a jaw-dropping 50 years to snare a five-wicket haul on the opening day of the 2020/21 Sheffield Shield season. There’s a lot to like about the red-headed youngster and it seems O’Keefe has firmly taken Pope under his wing. It’s a relationship Pope has loved every second of, acting like a sponge to O’Keefe’s wealth of knowledge and wisdom accrued over a lengthy career that began with a Sheffield Shield debut in 2005. “He’s (O’Keefe) an absolute genius,” Pope said. “We saw in the first game (of the season) he got career-best figures. “He’s just so good. “He teaches me so many different things, we work together at training all the time so I can’t speak highly enough of him.” O’Keefe dazzled in the Sixers’ season opener against the Stars, claiming four wickets for a measly 14 runs from four overs as the Melburnians were rolled for an embarrassing 61 runs. The 37-year-old has represented Australia at both Test and T20 level, but Pope feels it is not solely O’Keefe’s bowling ability that makes him a standout. Rather, it’s his on-field knowledge of the game that elevates him above his peers. “We do talk a lot about the tactics of the game,” Pope said. “That’s where his (O’Keefe’s) biggest weapon is. “He says himself that he’s not the greatest spinner of the ball, so he has to really think about the game. “Some of the finer things he does in terms of field placement is really helpful as a leggie.” Pope is yet to play for the Sixers this season but could see some action against the Stars on Wednesday night due to an injury sustained by teammate Ben Manenti. The chance to play against “some of the best players in the world” is one he would absolutely relish. “If I get an opportunity, that’d be great,” Pope said. “Unfortunate circumstances for Benny, so we’re feeling for him at the moment. “But personally, it would be a really great opportunity if I do get a game.” Three games into the season for the Melbourne Renegades and a first appearance from one star has yet to happen. He’s only 20 but spinner Tanveer Sangha has the world at his feet according to one international Big Bash star. West Indies all-rounder Andrew Russell was arguably lucky to survive this baffling moment during the Melbourne Stars run chase.","image_url":null,"source_id":"news"},{"title":"Star’s ultimate praise for wily veteran","link":"https://www.cairnspost.com.au/sport/cricket/big-bash/bbl-sixers-star-lloyd-pope-hails-stephen-okeefe-an-absolute-genius/news-story/a8dd2663b35e02de6c7e51b7bde86f24","keywords":["Big Bash News","Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"Sydney Sixers spinner Lloyd Pope has played with plenty of star bowlers early in his young cricket career, but it’s Stephen O’Keefe who he hailed as an “absolute genius”.","content":null,"pubDate":"2021-12-14 03:17:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"County Cricket: All-rounder Ben Stokes signs three years contract extension with Durham","link":"https://thesportsrush.com/cricket-news-county-cricket-all-rounder-ben-stokes-signs-three-years-contract-extension-with-durham/","keywords":["Cricket","Ben Stokes","County Cricket","durham"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"County Cricket: English all-rounder Ben Stokes has signed a three years contract extension with his County team Durham. English all-rounder Ben Stokes will be a Durham player till the end of the 2024 season. Stokes has signed a three years extension with the club. Stokes made his Durham debut in 2010 and has been a… The post County Cricket: All-rounder Ben Stokes signs three years contract extension with Durham appeared first on The SportsRush.","content":"County Cricket: English all-rounder Ben Stokes has signed a three years contract extension with his County team Durham. English all-rounder Ben Stokes will be a Durham player till the end of the 2024 season. Stokes has signed a three years extension with the club. Stokes made his Durham debut in 2010 and has been a vital part of them. Although, due to International commitments, his participation has been limited. County Cricket: Ben Stokes signs extension with Durham Ben Stokes made his comeback to cricket in the Brisbane test after a series of finger injuries and mental health issues. After his finger injury earlier this season, Stokes did make his return to Durham in the T20 Blast. After signing the contract, Stokes has expressed his delight. “I am delighted to commit to a further three years with Durham,” Stokes said. “I have had some fantastic memories playing for the Club over the years and I look forward to experiencing more of this in the future.” Stokes has played 64 FC games for Durham, scoring 3611 runs, with 185 as his highest score. He has also represented Durham in 62 T20 Blast games and has the highest score of 90*. Three more years of Stokesy #ForTheNorth pic.twitter.com/asmZYKw8gX — Durham Cricket (@DurhamCricket) December 13, 2021 Marcus North, director of Cricket at Durham has hailed the retention of Ben Stokes with the club. “Ben is one of the finest players in the world and while we may not see him as much as we would like his influence around the club remains huge.” “It’s fantastic to see Ben back fit and well following his time away from the game and now back playing for England in the Ashes.” “We are extremely happy that Ben has agreed his future to Durham for a further 3 years.” Stokes has turned into a world-class all-rounder since his debut for Durham. The big-hitting left-hander has played 71 test matches for England, scoring 4631 runs averaging 37.04, and taking 163 wickets which includes his famous 135* against Australia at Headingley. The post County Cricket: All-rounder Ben Stokes signs three years contract extension with Durham appeared first on The SportsRush.","pubDate":"2021-12-14 03:13:00","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"PAK vs WI Dream11 Team Prediction, Fantasy Cricket Hints Pakistan vs West Indies: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s 2nd T20I at National Stadium, Karachi at 6:30 PM IST December 14","link":"https://zeenews.india.com/cricket/pak-vs-wi-dream11-team-prediction-fantasy-cricket-hints-pakistan-vs-west-indies-captain-probable-playing-11s-team-news-injury-updates-for-today-s-2nd-t20i-at-national-stadium-karachi-at-630-pm-ist-december-14-2419092.html","keywords":null,"creator":null,"video_url":null,"description":"PAK vs WI Dream11 Team Prediction Pakistan vs West Indies T20I series","content":null,"pubDate":"2021-12-14 02:52:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Vijay Hazare Trophy LIVE SCORE: Tamil Nadu takes on Baroda; Karnataka plays Bengal; Delhi vs Saurashtra","link":"https://sportstar.thehindu.com/cricket/domestic/vijay-hazare-trophy-live-score-news-updates/article37949638.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Vijay Hazare Trophy 2021-22: Get the live cricket score, updates and highlights from the final stage of the league phase from across centres.","content":null,"pubDate":"2021-12-14 02:46:25","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Rohit's SA tour goes south","link":"https://www.tribuneindia.com/news/sports/rohits-sa-tour-goes-south-350278","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, December 13 India's Test vice-captain Rohit Sharma was today ruled out of the entire three-Test series against South Africa as his old left hamstring injury resurfaced during the team's net session in Mumbai, where he also took a hit on his hand. India A captain Priyank Panchal will be Rohit's replacement in the Test series. \"Team India Test vice-captain Rohit Sharma sustained a left hamstring injury during his training session here in Mumbai yesterday. He has been ruled out of the upcoming three-match Test series against South Africa. Priyank Panchal will replace Rohit Sharma in the Test squad,\" the Indian cricket board (BCCI) said in a press statement. The BCCI has not announced a stand-in vice-captain but KL Rahul seems the frontrunner to be Virat Kohli's deputy in the series. The other contenders could be Rishabh Pant and Ravichandran Ashwin, considering that Ajinkya Rahane has been removed from the role, with his place in the playing XI not being assured. The first Test is scheduled to be played in Pretoria from December 26, the second will be played in Johannesburg from January 3 while the final Test is scheduled to begin on January 11 in Cape Town. The Test series will be followed by three ODIs, scheduled to begin on January 19 in Paarl. Hand injury The 34-year-old Rohit also sustained a hand injury while facing throwdowns specialist Raghavendra. \"Yes, Rohit did suffer an injury on his hand but even after that he had batted. So we can presume that hand injury isn't serious. But thereafter, it seemed the old hamstring problem resurfaced once again and it might take some time before he is fully fit and available. They are trying to sort it out. Hamstring injuries normally take four weeks which could effectively rule him out of Test series,\" a senior BCCI source said. The BCCI is yet to share the details of his scan report which will explain the extent of the injury. Meanwhile, the home team's wicketkeeper-batter Quinton de Kock could also miss the second and third Test matches, with his wife expecting the birth of their child in early January. — Agencies","content":null,"pubDate":"2021-12-14 02:42:05","full_description":"New Delhi, December 13 India's Test vice-captain Rohit Sharma was today ruled out of the entire three-Test series against South Africa as his old left hamstring injury resurfaced during the team's net session in Mumbai, where he also took a hit on his hand. India A captain Priyank Panchal will be Rohit's replacement in the Test series. \"Team India Test vice-captain Rohit Sharma sustained a left hamstring injury during his training session here in Mumbai yesterday. He has been ruled out of the upcoming three-match Test series against South Africa. Priyank Panchal will replace Rohit Sharma in the Test squad,\" the Indian cricket board (BCCI) said in a press statement. The BCCI has not announced a stand-in vice-captain but KL Rahul seems the frontrunner to be Virat Kohli's deputy in the series. The other contenders could be Rishabh Pant and Ravichandran Ashwin, considering that Ajinkya Rahane has been removed from the role, with his place in the playing XI not being assured. The first Test is scheduled to be played in Pretoria from December 26, the second will be played in Johannesburg from January 3 while the final Test is scheduled to begin on January 11 in Cape Town. The Test series will be followed by three ODIs, scheduled to begin on January 19 in Paarl. Hand injury The 34-year-old Rohit also sustained a hand injury while facing throwdowns specialist Raghavendra. \"Yes, Rohit did suffer an injury on his hand but even after that he had batted. So we can presume that hand injury isn't serious. But thereafter, it seemed the old hamstring problem resurfaced once again and it might take some time before he is fully fit and available. They are trying to sort it out. Hamstring injuries normally take four weeks which could effectively rule him out of Test series,\" a senior BCCI source said. The BCCI is yet to share the details of his scan report which will explain the extent of the injury. Meanwhile, the home team's wicketkeeper-batter Quinton de Kock could also miss the second and third Test matches, with his wife expecting the birth of their child in early January. — Agencies","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/12/2021_12$largeimg_887776526.jpg","source_id":"tribuneindia"},{"title":"Selection shock that could shake up Ashes; why England are setting Leach up to fail — UK Wrap - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvdGhlLWFzaGVzL2VuZ2xhbmQtY2FudC1jb3BlLXNlbGVjdGlvbi1oZWFkYWNoZXMtYW5kLWJvbHN0ZXJpbmctdGhlLWJhdHRpbmctb3JkZXItYXNoZXMtdWstdmlldy9uZXdzLXN0b3J5L2VmYzYyMTFhODFiNTdiZTRiMzhiOWY3NmZjMWY1M2Nh0gGvAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC90aGUtYXNoZXMvZW5nbGFuZC1jYW50LWNvcGUtc2VsZWN0aW9uLWhlYWRhY2hlcy1hbmQtYm9sc3RlcmluZy10aGUtYmF0dGluZy1vcmRlci1hc2hlcy11ay12aWV3L25ld3Mtc3RvcnkvZWZjNjIxMWE4MWI1N2JlNGIzOGI5Zjc2ZmMxZjUzY2E?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Selection shock that could shake up Ashes; why England are setting Leach up to fail — UK Wrap  Fox SportsAussie great blasts ‘mind-boggling’ Ashes mistake  NEWS.com.auWhy England should avoid picking both Broad and Anderson for second Test  The RoarAnderson, Broad 'ready to go' for Adelaide Test  cricket.com.auAnderson, Broad 'ready to go' for England  The West AustralianView Full coverage on Google News","content":null,"pubDate":"2021-12-14 02:19:00","image_url":null,"source_id":"google"},{"title":"Katy Perry call prepped cricket for COVID","link":"https://thewest.com.au/sport/cricket/katy-perry-call-prepped-cricket-for-covid-c-4939351","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cricket Australia's near two-year battle to keep the sport going through COVID-19 started with a call from Katy Perry's management in February 2020.","content":null,"pubDate":"2021-12-14 02:07:29","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4939351/ae4bc774473db68acf0ab7b399b324028a3799fb-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Katy Perry call prepped cricket for COVID","link":"https://thewest.com.au/sport/cricket/katy-perry-call-prepped-cricket-for-covid-c-4939351","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cricket Australia's near two-year battle to keep the sport going through COVID-19 started with a call from Katy Perry's management in February 2020.","content":null,"pubDate":"2021-12-14 02:07:29","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4939351/ae4bc774473db68acf0ab7b399b324028a3799fb-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Katy Perry call prepped cricket for COVID","link":"https://www.busseltonmail.com.au/story/7551031/katy-perry-call-prepped-cricket-for-covid/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-14 02:05:09","full_description":"Not even the threat of COVID-19 could halt Katy Perry's star turn at the 2020 T20 Women's World Cup. The first time Nick Hockley was alerted to the seriousness of the coronavirus it was pop star Katy Perry's manager down the line. \"She was five months pregnant,\" the now Cricket Australia CEO recalls. \"He goes: 'Have you heard about this coronavirus, have you got any concerns'? \"I remember saying no, no concerns. \"We'd kind of heard through the early stage of the (Women's Twenty20 World Cup) that there was something happening. \"Something coming out of China and affecting Europe, but we didn't really give it too much thought.\" Hockley's where-were-you-when moment is like that of most Australians. A virus was threatening to destabilise the world while the majority still blissfully believed the storm would soon pass overseas. What is clear is Hockley's professional career has since been a never-ending battle to contend with the pandemic. In many ways, COVID-19 has been the making of Hockley. And so too were the months immediately after the phone call from Perry's management in the lead-up to her performance at the World Cup final in front of a record crowd of 86,174 at the MCG. Still the CEO of the T20 World Cup at the time, Hockley's initial job was to ensure the 2020 men's edition was not cancelled. Then, out of the blue, he was thrown into the role as CEO role of CA after Kevin Roberts' financial projections through COVID-19 fell flat. Immediately there was an uncertain summer looming in addition to a battle with a free-to-air broadcaster. \"(Those few months of planning with the T20 World Cup) did help,\" Hockley said. \"Because we were speaking to a lot of experts, a lot of epidemiologists, trying to predict how this would all unfold and play out. \"Having three months to work with our government partners, the ICC, speaking to experts. It definitely helped.\" By his nature Hockley is a different figure to the likes of powerhouse sporting administrators Peter V'landys and Gillon McLachlan. Therefore he won't get the same plaudits they have for keeping their sports running during the pandemic. However, it shouldn't be overlooked that since the start of the pandemic CA has only postponed one game on home soil. While the decision to pull out of Australia's Test tour of South Africa was heavily criticised when CA claimed protocols weren't detailed enough, there has barely been such issue at home. Last year's Perth Test featuring Afghanistan has been the only one postponed through COVID-19, while this summer's Optus Stadium Ashes clash has moved to Hobart. The Sydney Test was somehow saved last summer during the northern beaches outbreak, while also ensuring India went to the Gabba for the series finale. A brief India women's series was postponed last summer with the ODI World Cup pushed back in New Zealand, but that resulted in a Test as well as white-ball fixtures this season. CA also did what the AFL and NRL couldn't with their major women's competitions. It managed to get through a full Women's BBL as scheduled with a $3.5 million outlay for a full hub in Sydney last summer as well as further quarantine stays this year. \"I am proudest that we kept the women's stuff going,\" Hockley said. \"The first international series (of any sport) to be hosted here was New Zealand women when they came over and played in Brisbane. \"What people also don't really appreciate is that we've got three formats of the game. \"Then with that there is female, male, domestic and international.\" Issues in the domestic game have almost been the most complex, due to border crossings, overseas imports and players coming in and out of squads. \"The Big Bash is just seriously complicated,\" Hockley said. \"In footy you probably have the cadence of a week, where in the Big Bash you are playing a game every two-and-a-half days. \"Logistically it's way more complicated. There is no room for movement or error.\" Crucially too, the pandemic could not have come at a worse time for CA. Back-to-back home summers against India and England are their most lucrative. Both visiting nations have been living in different COVID-19 worlds to Australia, where a sudden lockdown and change in restrictions over a minimal number of cases seem unfathomable and nonsensical. That in particular was evident in both the Sydney Test dramas last year, as well as England's initial resistance for this summer before Hockley fronted a virtual hook up with the tourists. Still though, he labels last summer as the greater achievement, measurable by the relief at CA headquarters when India's squad was confirmed as on the plane. \"If I think about the BCCI, normally you would have one or two calls in the months leading up,\" Hockley said. \"You would exchange some correspondence around tour dates and speak to the travel agent about VISA applications. \"Whereas we were doing daily zoom calls for four months. And then probably three times a day towards the end.\" Hockley, like most, would like to think this summer is the last that he has to contend with coronavirus. That he can now work with players on topics they are passionate about, such as climate change with Pat Cummins and cultural diversity with Usman Khawaja, must be a relief. But the same hope was expressed last season, and there was a time in May when this summer's schedule was released and Australia was almost COVID-19 free. \"Before this, I worked in emerging acquisitions and did long hours,\" Hockley said. \"And then on the (2012) Olympic Games, which people refer to that as the most complex logistical exercise in peace time. \"But this, the last 18 months for our team, has just been at a different level.\" Australian Associated Press","image_url":"https://transform.newsnow.io/transform/v1/crop/frm/silverstone-feed-data/245bdbc5-f013-49d8-bea7-a7240e7172b2.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail"},{"title":"India vs South Africa 2021-22: Lungi Ngidi feels series can put SA cricket in ‘right direction’","link":"https://zeenews.india.com/cricket/india-vs-south-africa-2021-22-lungi-ngidi-feels-series-can-put-sa-cricket-in-right-direction-2419080.html","keywords":null,"creator":null,"video_url":null,"description":"Lungi Ngidi is a part of the South Africa Test squad announced for the three-match series against Virat Kohli’s men, starting December 26.","content":null,"pubDate":"2021-12-14 02:00:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"India to host Afghanistan for 3 ODIs in March next year","link":"https://www.business-standard.com/article/sports/india-to-host-afghanistan-for-3-odis-in-march-next-year-121121301580_1.html","keywords":null,"creator":null,"video_url":null,"description":"India men's cricket will be playing three ODIs against Afghanistan in March 2022, Afghanistan Cricket Board (ACB) announced on Monday.","content":null,"pubDate":"2021-12-14 01:46:00","full_description":"India men's cricket will be playing three ODIs against Afghanistan in March 2022, Afghanistan Cricket Board (ACB) announced on Monday. According to the Future Tour Program (FTP) for 2022-23, a total number of 11 ODI, four T20I and two test series have been included in the Afghanistan schedule for the upcoming two years. Apart from the series against India, Afghanistan will be squaring off against Netherlands, Zimbabwe, Australia, Ireland in 2022. These series are scheduled on a home and away basis, among which Afghanistan will play 18 home and 34 away matches, apart from participating in the Asia Cup 2022, ICC T20 World Cup 2022, the Asia Cup 2023 and the ICC Cricket World Cup 2023. \"Out of the 52 matches included in Afghanistan's schedule from 2022 to 2023, there will be 37 ODIs, 12 T20Is and 3 tests. Considering the fact that Afghanistan will be playing 7 ODI series in the ICC Cricket World Cup Super League, as well as will participate in four major limited-overs events such as Asia Cup 2022 (T20 format), ICC T20 World Cup 2022, the Asia Cup 2023 (ODI format) & the ICC Cricket World Cup 2023,\" the ACB said in an official release. It's worth mentioning that the ACB top management alongside the cricket operations team of the Afghanistan Cricket Board is in regular negotiations with the Pakistan Cricket Board to reschedule the postponed three-match ODI series for the Feb-Mar 2023 (Still to be confirmed), which was scheduled to be conducted in Sep-2021 and was postponed indefinitely due to logistical challenges. Furthermore, the ACB is in talks with other cricket nations to arrange more bilateral matches for the national team, as part of the ICC Future Tours Program, which will be announced in due course. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211213/thumb-121121301580.jpg","source_id":"business-standard"},{"title":"Jayawardena appointed 'consultant coach'","link":"https://www.thenews.com.pk/print/916583-jayawardena-appointed-consultant-coach","keywords":null,"creator":null,"video_url":null,"description":"COLOMBO: Sri Lanka cricket hall-of-famer Mahela Jayawardena was on Monday named the national team’s “consultant coach” following this month’s departure of head coach Mickey Arthur.Jayawardena is regarded as one of the island’s finest batsmen and helped mentor the team...","content":null,"pubDate":"2021-12-14 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Faisal Hasnain to take over as new PCB chief executive","link":"https://www.thenews.com.pk/print/916578-faisal-hasnain-to-take-over-as-new-pcb-chief-executive","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: As expected, Faisal Hasnain took over as new Chief Executive Officer of the Pakistan Cricket Board on Monday, .Instead of waiting for the expected Board of Governors meeting on December 21, the approval of his appointment was sought through a circular resolution. Hasnain replaced...","content":null,"pubDate":"2021-12-14 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Rohit hopes to end India's world title drought","link":"https://www.thenews.com.pk/print/916579-rohit-hopes-to-end-india-s-world-title-drought","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI: India’s new limited-overs captain Rohit Sharma said he hopes to win a world title for the cricket-crazy nation, an achievement that eluded his sacked predecessor Virat Kohli.During Kohli’s five-year tenure India rose in the one-day, Twenty20 and Test rankings but missed out...","content":null,"pubDate":"2021-12-14 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Ex-captain's dire warning over Hazlewood injury","link":"https://wwos.nine.com.au/cricket/ashes-2021-michael-clarke-warns-australia-over-risks-of-rushing-josh-hazlewood-back-into-test-team/554f560a-9b8b-4094-9e1a-e40a9ac93e85","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former captain Michael Clarke believes Josh Hazlewood's short-term future is very much dependent on what happens later this week.","content":"Former Test captain Michael Clarke says Josh Hazlewood's short-term future is very much dependent on what happens later this week in the second Ashes Test.The NSW quick is set to miss the match in Adelaide, after picking up a side strain during Australia's crushing nine-wicket win at the Gabba.But Clarke says should the Aussies come up short against England in the second tie it may force them into a rushed decision.READ MORE: The Australian official at the centre of F1 title farceREAD MORE: Clubs fume at botched Champions League drawREAD MORE: Why Cummins outfoxed Root in Ashes opener\"If Australia win, I reckon he'll definitely miss Boxing Day to be safe,\" Clarke said on Big Sports Breakfast.\"If Australia lose, then you're taking a big risk bringing him back a fraction early. [He] plays Boxing Day, it's a belter, has to bowl 25 overs a day, redoes (the injury) and is out for the series.\"Western Australia paceman Jhye Richardson looks set to take Hazlewood's spot in the team ahead of Michael Neser - but a call-up for this week could end up being an extended stay in the XI.\"They're going to have be very careful,\" Clarke said.\"They're going to have make an educated decision. You've got doctors, physios, strength and conditioning. I think it will be taken out of Josh's hands.\"If Hazlewood's injury is minor, he may be fit to play on Boxing Day - but 2021 has presented some unique challenges in terms of match fitness.\"If it is a side strain they usually say 10 days (to recover) but the problem Josh has got, like the other quicks, he hasn't got the bowling into his body because he's been playing Twenty20 cricket for the last four or five months,\" Clarke said.\"I'd imagine he wouldn't be able to do anything for a week. Then he's got to get bowling back into him as well.\"They probably will say, 'you're going to have to bowl 10 overs straight in the nets to prove your fitness'.\"What comes with that is the risk of redoing the side strain and being out for the whole series. It's a really tough one.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-14 00:46:50","full_description":"Former Test captain Michael Clarke says Josh Hazlewood 's short-term future is very much dependent on what happens later this week in the second Ashes Test. The NSW quick is set to miss the match in Adelaide , after picking up a side strain during Australia's crushing nine-wicket win at the Gabba. But Clarke says should the Aussies come up short against England in the second tie it may force them into a rushed decision. READ MORE: The Australian official at the centre of F1 title farce READ MORE: Clubs fume at botched Champions League draw READ MORE: Why Cummins outfoxed Root in Ashes opener \"If Australia win, I reckon he'll definitely miss Boxing Day to be safe,\" Clarke said on Big Sports Breakfast. \"If Australia lose, then you're taking a big risk bringing him back a fraction early. [He] plays Boxing Day, it's a belter, has to bowl 25 overs a day, redoes (the injury) and is out for the series.\" Western Australia paceman Jhye Richardson looks set to take Hazlewood's spot in the team ahead of Michael Neser - but a call-up for this week could end up being an extended stay in the XI. \"They're going to have be very careful,\" Clarke said. \"They're going to have make an educated decision. You've got doctors, physios, strength and conditioning. I think it will be taken out of Josh's hands.\" If Hazlewood's injury is minor, he may be fit to play on Boxing Day - but 2021 has presented some unique challenges in terms of match fitness. \"If it is a side strain they usually say 10 days (to recover) but the problem Josh has got, like the other quicks, he hasn't got the bowling into his body because he's been playing Twenty20 cricket for the last four or five months,\" Clarke said. \"I'd imagine he wouldn't be able to do anything for a week. Then he's got to get bowling back into him as well. \"They probably will say, 'you're going to have to bowl 10 overs straight in the nets to prove your fitness'. \"What comes with that is the risk of redoing the side strain and being out for the whole series. It's a really tough one.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/398817/pickerimage.jpg","source_id":"nine"},{"title":"Bradford cricket league's champions Salem pull out of 2022","link":"https://www.thetelegraphandargus.co.uk/sport/19781979.bradford-cricket-leagues-champions-salem-pull-2022/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"BRADFORD Mutual Sunday School League champions Salem Athletic will not defend their title next season, it was confirmed at the league's annual meeting.","content":null,"pubDate":"2021-12-14 00:46:00","full_description":"BRADFORD Mutual Sunday School League champions Salem Athletic will not be defending their title next season. The league’s annual meeting at Manningham Mills heard that there was no-one available to run either Salem’s first or second teams at Leylands Lane and that they would therefore be pulling both teams out of the league for 2022. Salem’s B team, who won the second teams’ cup, the H Broadbent Trophy, this season, were sixth in Group B. Retiring chairman Nick Spachis said: “This is a case of a team without infrastructure, and I would hope that Salem Athletic will come back in for 2023.” An identical thing happened to Craven League winners Ingrow St John’s after they won their top flight in 2017. On a happier note, Bradford Indians and Hallfield are both expanding, fielding second teams next season in the Mutual, while there is also a new club, late applicants Sunrise, who hope to play at Northcliffe. Some confusion was caused by Group B side Northcliffe changing their name to Greenfield, who already exist in the league as a separate club in Group C. This will mean that there will be eight teams in both Group A and B and nine teams in Group C. Meanwhile, many leading officials within the league have changed, including two with 16 years’ successive service. Long-standing chairman Spachis stepped down at the annual meeting, while also moving aside is president Alan Broadbent, who, like Spachis, began his stint in office in 2005. Also standing down are more recent recruits, fixture secretary Zaheer Ahmed and disciplinary secretary Mohammed Rafiq, who both started in office in 2015. Mohammed Amir Majid replaces Broadbent, who was not present at the meeting. Other new officials are Dr Rizwan Hameed (chairman), Gaurav Kumar (fixture secretary) and Graham Langton (disciplinary secretary), while commercial secretary Junaid Khan has become vice-chairman, replacing Majid. Spachis said: “I have been part of this league for nearly 40 years (as player, official and umpire) and I feel it is time for someone else to do the job (of chairman) but I will remain part of the umpiring family.” Hameed said: “There will be sweeping changes in this league and I promise to take the league forward in a different way but I need your support and am open to suggestions to take power away from the executive committee towards clubs.” Ahmed said that the league needed to move towards live scoring, which some clubs had already taken on board. A staggering 45 rule change proposals were voted on. Among the rule change proposals that were passed included the introduction of a T20 competition next season; a three-year limit on executive committee members except life vice-presidents and that executive committee members must attend at least 60 per cent of meetings otherwise they will be voted off. Others included executive committee members no longer having the right to vote at league meetings or annual meetings; no club to have two teams in the same division and no more than two players transferring from one club to another from seven days prior to the season starting until July 31. There will also be an £8 fine for failing to provide an official; and the league must provide umpires with white coats, counters, a rule book and a hat. Among the rule change proposals to fail included giving an automatic 25 points to the winners of a match and bonus points only to the losing team; reducing a club’s bond from £200 to £150; that no individual represents more than one club; and that the T20 competition be played in coloured clothing with a pink ball. Constitution - Group A: Great Horton Church, Omars, Bradford Indians, Yorkshire Friends, Apperley Bridge, Girlington, Hallfield, Allerton. Group B: Greenfield, Girlington B, TABS, Cambing, Great Horton Church B, Bowling Baptists, Bradford Phoenix, Bradford Qalandars. Group C: Kashmir Bradford, Greenfield B, Bowling Baptists B, Mandhata, Allerton B, West Bowling, Hallfield B, Bradford Indians B, Sunrise. Officers elected - President, Mohammed Amir Majid; chairman, Dr Rizwan Hameed; vice-chairman, Junaid Khan; secretary, Hafeez Ur-Rahman; fixture secretary, Gaurav Kumar; disciplinary secretary, Graham Langton; umpires’ secretary, Sajid Parvaz; commercial secretary, Junaid Khan.","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/10397066/?type=app&htype=0","source_id":"thetelegraphandargus"},{"title":"Besties crack Australian U19 cricket team for World Cup in West Indies","link":"https://www.cairnspost.com.au/sport/icc-u19-cricket-world-cup-2022-mates-aidan-cahill-corey-miller-lachlan-shaw-chase-west-indies-spots/news-story/df3fdf887519410b6e377ef1158fd71f","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"For this teenager there is nothing better than playing cricket with mates - especially when they will now be playing side-by-side for Australia at the under 19 World Cup in the West Indies in the New Year.","content":null,"pubDate":"2021-12-14 00:00:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Warner injury heaps pressure on Harris","link":"https://wwos.nine.com.au/cricket/ashes-2021-david-warner-injury-puts-pressure-on-marcus-harris-usman-khawaja-looming/fb0d951c-e2a7-40b7-94d1-40024d1d7f39","keywords":null,"creator":["wwos"],"video_url":null,"description":"David Warner's injury could heap more pressure on under-fire opener Marcus Harris, according to Mark Taylor.","content":"Marcus Harris faces more pressure to retain his spot in Australia's Test side if David Warner is unable to line up in the Adelaide Test this week, according to Mark Taylor.Warner left the Brisbane Test with severely bruised ribs after copping a short delivery from Ben Stokes on Day 2, and faces a race against time to be fit for the second Test with a short turnaround.If Warner does miss the Adelaide Test, Taylor said Australia could see both Harris and Warner's replacement fighting for one spot in the side for the third Test and beyond.READ MORE: Verstappen reveals text from Mercedes boss after F1 controversy\"In a way [Warner's absence] probably puts a bit more pressure on Marcus Harris,\" Taylor told Wide World of Sports' Outside The Rope.\"He's got to make some runs. You suspect if Warner doesn't play – it's an 'if' at this stage – it's almost a bat-off. Warner will come back in for Boxing Day for sure. Therefore, Marcus Harris will need to make some runs to keep Usman Khawaja at bay.\"If Usman plays and gets runs, and Harris's woes continue ... you can see Australia will make that choice and probably go for Khawaja for the Boxing Day Test.\"READ MORE: Truth behind exiled NRL star John Asiata's anti-vax stanceDespite a solid summer in domestic cricket, Khawaja's case was hurt by a pair of failures for Australia A against the England Lions last week.The veteran left-hander has not featured in Australia's Test side since the 2019 Ashes, but boasts an average of 96.80 in seven innings as an opener for Australia.He has two centuries as a Test opener, with one coming against South Africa in 2016 in Adelaide where he was ironically promoted up the order due to an injury to Warner.\"That was his best [innings] in Test cricket for mine,\" Taylor said. \"That pink ball game, [against] a very good bowling attack that South Africa had … he was almost thrust into opening the batting because Warner was off the field.READ MORE: Hamilton claims Abu Dhabi Grand Prix was 'manipulated'\"Khawaja gets pushed straight up and makes 140-odd and was man of the match in the game.\"The second Test will be a day-night contest at the Adelaide Oval and will get under way on Thursday, December 16.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-13 23:40:45","full_description":"Marcus Harris faces more pressure to retain his spot in Australia's Test side if David Warner is unable to line up in the Adelaide Test this week, according to Mark Taylor. Warner left the Brisbane Test with severely bruised ribs after copping a short delivery from Ben Stokes on Day 2, and faces a race against time to be fit for the second Test with a short turnaround. If Warner does miss the Adelaide Test, Taylor said Australia could see both Harris and Warner's replacement fighting for one spot in the side for the third Test and beyond. READ MORE: Verstappen reveals text from Mercedes boss after F1 controversy \"In a way [Warner's absence] probably puts a bit more pressure on Marcus Harris,\" Taylor told Wide World of Sports' Outside The Rope . \"He's got to make some runs. You suspect if Warner doesn't play – it's an 'if' at this stage – it's almost a bat-off. Warner will come back in for Boxing Day for sure. Therefore, Marcus Harris will need to make some runs to keep Usman Khawaja at bay. \"If Usman plays and gets runs, and Harris's woes continue ... you can see Australia will make that choice and probably go for Khawaja for the Boxing Day Test.\" READ MORE: Truth behind exiled NRL star John Asiata's anti-vax stance Despite a solid summer in domestic cricket, Khawaja's case was hurt by a pair of failures for Australia A against the England Lions last week. The veteran left-hander has not featured in Australia's Test side since the 2019 Ashes, but boasts an average of 96.80 in seven innings as an opener for Australia. He has two centuries as a Test opener, with one coming against South Africa in 2016 in Adelaide where he was ironically promoted up the order due to an injury to Warner. \"That was his best [innings] in Test cricket for mine,\" Taylor said. \"That pink ball game, [against] a very good bowling attack that South Africa had … he was almost thrust into opening the batting because Warner was off the field. READ MORE: Hamilton claims Abu Dhabi Grand Prix was 'manipulated' \"Khawaja gets pushed straight up and makes 140-odd and was man of the match in the game.\" The second Test will be a day-night contest at the Adelaide Oval and will get under way on Thursday, December 16. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/398939/pickerimage.jpg","source_id":"nine"},{"title":"Rohit Sharma ruled out of SA Tests due to injury","link":"https://www.thehansindia.com/sports/cricket/rohit-sharma-ruled-out-of-sa-tests-due-to-injury-719625","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Panchal announced as replacement","content":"Rohit Sharma ruled out of SA Tests due to injuryRohit Sharma ruled out of SA Tests due to injuryMumbai: The Board of Control for Cricket in India (BCCI) on Monday announced that opener Rohit Sharma has been ruled out of the Test series against South Africa due to a left hamstring injury picked during a training session on Sunday. In vice-captain Sharma's place, Gujarat opener Priyank Panchal has been named as the replacement in the Test squad.\"Team India Test vice-captain Rohit Sharma sustained a left hamstring injury during his training session here in Mumbai yesterday. He has been ruled out of the upcoming 3-match Test series against South Africa. Priyank Panchal will replace Rohit Sharma in the Test squad,\" said a release by BCCI. Sharma had recently replaced fellow Mumbaikar Ajinkya Rahane as the vice-captain of the Test side apart from being promoted as India's white-ball captain. His absence is a big blow to India's plans of winning a Test series in South Africa for the first time. Sharma had scored 906 runs in 21 innings at an average of 47.68 and was India's highest run-getter in Test cricket in 2021. He was also the second-highest run-getter in Test cricket this year after England captain Joe Root. In India's last Test against England at The Oval in September, Sharma was the 'Player of the Match' for his wonderful knock of 127 off 256 balls in India's 157-run win. Panchal was the captain of the India A team's three-four day matches tour to South Africa, where he captained in two matches, registering scores of 96, 24, and 0 in his three innings. Panchal had been a part of India's extended squad that played against England in four Tests at home in February and March. he 31-year-old, who captains Gujarat in domestic cricket, was in the squad as a reserve opener alongside Abhimanyu Easwaran for the home Tests against England, which India won 3-1. In 100 FC matches, Panchal has scored 7011 runs at a healthy average of 45.52, including 24 centuries and 25 half-centuries with an unbeaten 314 as his highest score. The three-match Test series between India and South Africa begins from December 26 to 30 at SuperSport Park in Centurion, followed by the second Test at Wanderers in Johannesburg from January 3 to 7 and the third Test at Newlands in Cape Town from January 11 to 15. India's Test squad: Virat Kohli (Captain), KL Rahul, Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Priyank Panchal, Shreyas Iyer, Hanuma Vihari, Rishabh Pant (wicket-keeper), Wriddhiman Saha (wicket-keeper), R Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur and Mohammed Siraj","pubDate":"2021-12-13 20:47:16","full_description":"Rohit Sharma ruled out of SA Tests due to injury Mumbai: The Board of Control for Cricket in India (BCCI) on Monday announced that opener Rohit Sharma has been ruled out of the Test series against South Africa due to a left hamstring injury picked during a training session on Sunday. In vice-captain Sharma's place, Gujarat opener Priyank Panchal has been named as the replacement in the Test squad. \"Team India Test vice-captain Rohit Sharma sustained a left hamstring injury during his training session here in Mumbai yesterday. He has been ruled out of the upcoming 3-match Test series against South Africa. Priyank Panchal will replace Rohit Sharma in the Test squad,\" said a release by BCCI. Sharma had recently replaced fellow Mumbaikar Ajinkya Rahane as the vice-captain of the Test side apart from being promoted as India's white-ball captain. His absence is a big blow to India's plans of winning a Test series in South Africa for the first time. Sharma had scored 906 runs in 21 innings at an average of 47.68 and was India's highest run-getter in Test cricket in 2021. He was also the second-highest run-getter in Test cricket this year after England captain Joe Root. In India's last Test against England at The Oval in September, Sharma was the 'Player of the Match' for his wonderful knock of 127 off 256 balls in India's 157-run win. Panchal was the captain of the India A team's three-four day matches tour to South Africa, where he captained in two matches, registering scores of 96, 24, and 0 in his three innings. Panchal had been a part of India's extended squad that played against England in four Tests at home in February and March. he 31-year-old, who captains Gujarat in domestic cricket, was in the squad as a reserve opener alongside Abhimanyu Easwaran for the home Tests against England, which India won 3-1. In 100 FC matches, Panchal has scored 7011 runs at a healthy average of 45.52, including 24 centuries and 25 half-centuries with an unbeaten 314 as his highest score. The three-match Test series between India and South Africa begins from December 26 to 30 at SuperSport Park in Centurion, followed by the second Test at Wanderers in Johannesburg from January 3 to 7 and the third Test at Newlands in Cape Town from January 11 to 15. India's Test squad: Virat Kohli (Captain), KL Rahul, Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Priyank Panchal, Shreyas Iyer, Hanuma Vihari, Rishabh Pant (wicket-keeper), Wriddhiman Saha (wicket-keeper), R Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur and Mohammed Siraj","image_url":"https://assets.thehansindia.com/h-upload/2021/12/13/500x300_1134443-ha.jpg","source_id":"thehansindia"},{"title":"Cricket-Pakistan seal record 18th T20 win in calendar year by beating Windies","link":"https://www.thestar.com.my/sport/cricket/2021/12/14/cricket-pakistan-seal-record-18th-t20-win-in-calendar-year-by-beating-windies","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Pakistan became the first men's team to win 18 T20 international matches in a calendar year as they beat West Indies by 63 runs in the first game of their three-match series on Monday. Read full story","content":null,"pubDate":"2021-12-13 20:44:00","full_description":"(Reuters) - Pakistan became the first men's team to win 18 T20 international matches in a calendar year as they beat West Indies by 63 runs in the first game of their three-match series on Monday. Mohammad Rizwan (78) and Haider Ali (68) put on a dominant batting performance as Pakistan set the tourists a target of 201 in Karachi. The bowlers finished the job for the home team after Mohammad Wasim picked up four wickets and Shadab Khan took three as West Indies were skittled out for 137. Pakistan's 18th T20 win in 2021 was an improvement on their record of 17 victories in 2018. The second and third matches in the series will be played on Tuesday and Thursday respectively. The teams are scheduled to play three one-day internationals after the T20 series. (Reporting by Manasi Pathak in Bengaluru; Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/14/1405381.jpg","source_id":"thestar_my"},{"title":"OV vs CTB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Ford Trophy 2021-22, Match 4","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ov-vs-ctb-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ford-trophy-2021-match-4?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Dwijesh Reddy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-13 19:14:30","full_description":"The fourth match of the Ford Trophy 2021-22 features a riveting contest between the Otago Volts (OV) and Canterbury Kings (CTB) at Eden Park in Auckland on Tuesday. The Otago Volts didn't have a good start to their Ford Trophy 2021-22 campaign, losing their first game against the Wellington Firebirds. However, they will be keen to open their account with a better performance, with the likes of Neil Broom and Jacob Duffy itching to make amends. But they come across a resourceful Canterbury Kings side who won their first Ford Trophy 2021-22 game against the Northern Brave. Although they boast a better balanced side, the Kings will be wary of what Hamish Rutherford and co. are capable of achieving, making for a good contest in Auckland. OV XI Hamish Rutherford (c), Nick Kelly, Neil Broom, Josh Finnie, Anaru Kitchen, Dale Phillips, Max Chu (wk), Matt Bacon, Michael Rippon, Jacob Duffy and Angus Mckenzie CTB XI Chad Bowes, Jack Boyle, Ken McClure, Leo Carter, Cole McConchie (c), Cam Fletcher (wk), Matt Henry, Will Williams, Ed Nuttall, Henry Shipley and Will O' Rourke OV vs CTB, Ford Trophy 2021-22, Match 4 Date and Time: 14th December 2021, 3:30 AM IST Venue: Eden Park, Auckland A good batting track is expected at Eden Park with the dimensions of the ground going against the bowlers as well. But there should be some help in terms of movement and extra bounce off the surface, keeping the bowlers interested. However as the match progresses, the bowlers will look to take the pace off and try to mix it up. Wickets in hand will be key for both sides, with chasing being the preferred option upon winning the toss. Wicketkeeper Cam Fletcher: Cam Fletcher is one of the most explosive batters in the Canterbury unit, often scoring quick runs in the backend of the innings. He has been in decent form lately, making him a good option in your OV vs CTB Dream11 fantasy team over Max Chu, who is likely to bat lower down the order. Batter Neil Broom : Neil Broom has been in fine form across all competitions, using his experience and tactical nous to full effect. He is the Otago Volts' best player of spin, a skill-set that should hold him in good stead going into this much-awaited clash. All-rounder Michael Rippon: Michael Rippon is one of the best all-rounders in the Ford Trophy 2021, with his batting ability improving in leaps and bounds over the last season or two. However, a lot will depend on his leg-spin given the nature of the pitch, making him a must-have in your OV vs CTB Dream11 fantasy team. Bowler Matt Henry: Matt Henry's form over the last few months has been noteworthy, often picking up wickets with the new ball. His ability to hit the deck hard and swing the ball at a fair pace makes him a good option for this game. Michael Rippon (OV) Cole McConchie (CTB) Chad Bowes (CTB) Michael Rippon - 306 runs in 8 Ford Trophy 2020-21 matches, Bat Average: 43.71 Cole McConchie - 57(46) vs Northern Knights in previous Ford Trophy match Will Williams - 20 wickets in 11 Ford Trophy 2020-21 matches, Bowl Average: 18.05 Fantasy Suggestion #1 : C Fletcher, N Broom, H Rutherford, K McClure, C Bowes, M Rippon, C McConchie, J Duffy, M Henry, M Bacon and W Williams Captain : H Rutherford. Vice-captain : C McConchie. Fantasy Suggestion #2 : C Fletcher, N Broom, H Rutherford, L Carter, C Bowes, M Rippon, C McConchie, J Duffy, M Henry, A Kitchen and W Williams Captain : M Rippon. Vice-captain : C Bowes.","image_url":"https://static.sportskeeda.com/editor/2021/11/c9a29-16381814746444-1920.jpg","source_id":"sportskeeda"},{"title":"Archer: I thought I’d killed Steve Smith","link":"https://www.cairnspost.com.au/sport/ashes-superstar-jofra-archer-has-called-on-england-to-pick-a-fivepronged-pace-attack-for-adelaide/news-story/34c09f1615cb5bf359ba42e4ac0c7e78","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Absent superstar Jofra Archer has revealed he thought he might have killed Steve Smith with the blow that sent a shudder through the cricket world.","content":null,"pubDate":"2021-12-13 19:00:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Cricket-England&#039;s Stokes signs new Durham deal until 2024","link":"https://www.thestar.com.my/sport/cricket/2021/12/14/cricket-england039s-stokes-signs-new-durham-deal-until-2024","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England all-rounder Ben Stokes has signed a contract extension with Durham which will keep him at the first-class county club until 2024, the team announced on Monday. Read full story","content":null,"pubDate":"2021-12-13 18:45:00","full_description":"(Reuters) - England all-rounder Ben Stokes has signed a contract extension with Durham which will keep him at the first-class county club until 2024, the team announced on Monday. Stokes has played 64 red-ball matches for Durham and scored 3,611 first-class runs, with a best of 185 against Lancashire. \"I am delighted to commit to a further three years with Durham, I have had some fantastic memories playing for the club over the years and I look forward to experiencing more of this in the future,\" Stokes said in a statement. The 30-year-old took an indefinite break from cricket in July to focus on his mental health while also recovering from a second operation on a broken finger, but returned to action this month in England's first Ashes test defeat by Australia. (Reporting by Manasi Pathak in Bengaluru; Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/14/1405357.jpg","source_id":"thestar_my"},{"title":"Fighting performance with the bat helps reigning premiers Royals prevail over Mt Barker in tense finish","link":"https://thewest.com.au/news/albany-advertiser/fighting-performance-with-the-bat-helps-reigning-premiers-royals-prevail-over-mt-barker-in-tense-finish--c-4923851","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"In the second terrific contest between last season’s grand final teams, the Lions recorded a third straight win in the Albany and Districts Cricket Association 50-over competition at Turf North.","content":null,"pubDate":"2021-12-13 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4923851/ef4f5dcbbc9a986d5ddca4b9fabc4fbf359f57d6-16x9-x0y370w4126h2321.jpg","source_id":"thewest"},{"title":"Man of the match today Pakistan vs West Indies 1st T20I: Who was awarded Man of the Match in Pakistan vs West Indies 1st T20I in Karachi?","link":"https://thesportsrush.com/cricket-news-man-of-the-match-today-pakistan-vs-west-indies-1st-t20i-who-was-awarded-man-of-the-match-in-pakistan-vs-west-indies-1st-t20i-in-karachi/","keywords":["Cricket","West Indies tour of Pakistan 2021"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Man of the match today Pakistan vs West Indies 1st T20I: The 21-year-old bailed Pakistan out of trouble with a quick fire half-century. To the much anticipation and delight of Pakistan Cricket fans, International Cricket made a fantastic comeback to Pakistan soil, with the home side defeating the West Indies by 63 runs runs in… The post Man of the match today Pakistan vs West Indies 1st T20I: Who was awarded Man of the Match in Pakistan vs West Indies 1st T20I in Karachi? appeared first on The SportsRush.","content":"Man of the match today Pakistan vs West Indies 1st T20I: The 21-year-old bailed Pakistan out of trouble with a quick fire half-century. To the much anticipation and delight of Pakistan Cricket fans, International Cricket made a fantastic comeback to Pakistan soil, with the home side defeating the West Indies by 63 runs runs in the first T20I, after what turned out to be a one-sided contest at the National Stadium in Karachi. The West Indies skipper Nicholas Pooran, invited Pakistan to bat first after winning the Toss, in what was indeed a batting paradise at Karachi. In fact, the pitch had witnessed scores in excess of 200 in the last four T20Is at this very venue. Pakistan skipper Babar Azam (0 off 2) failed to impress yet again after being dismissed in the very first Over of left-arm spinner Akeal Hossain. With the score reading 36/2 after 5 Overs, Haider Ali (68 off 39) joined the in-form wicketkeeper batter Mohammad Rizwan (78 off 52) to stitch together a century stand for the 3rd wicket to take their side to 140/2 after 15 Overs. A final onslaught by Mohammad Nawaz (30 off 10) meant that Pakistan managed to post 200/6 after the end of 20 allotted Overs. The Windies chase in reply got off to poor start, after losing Brandon King (1 0ff 2) in the second Over. Things went downhill soon after with Mohammad Wasim Jr. (4-0-40-4) picking up two back to back wickets in his successive Overs. Leg spinner Shadab Khan (4-1-17-3) then joined the party to send three more batters back in the hut to reduce them to 88/6 after 13 Overs. There was no coming back for the ‘Men in Maroon’ post the damage as they were bundled up for 137 in 19 Overs. Man of the match today Pakistan vs West Indies 1st T20I: Who was awarded ‘Man of the match’? Smashing a quick fire half-century (68 off 39) with the assistance of 6 Fours and 4 gigantic Sixes, Pakistan’s Hider Ali was awarded the ‘Man of the match’ in the 1st T20I against the Windies. He was instrumental in bailing his team out of trouble, after being reduced to 36/2 within the first 5 Overs of the innings. He not only stitched a century partnership with Mohammad Rizwan, but also played aggressively to take the Pakistani total to the 200-run mark. Haider can hit it BIG! pic.twitter.com/0kCkjA14dr — Pakistan Cricket (@TheRealPCB) December 13, 2021 For more Cricket related news, click here.         The post Man of the match today Pakistan vs West Indies 1st T20I: Who was awarded Man of the Match in Pakistan vs West Indies 1st T20I in Karachi? appeared first on The SportsRush.","pubDate":"2021-12-13 17:22:13","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Mohammad Wasim Jr. castles Nicholas Pooran with inch perfect yorker during Pakistan vs West Indies 1st T20I in Karachi","link":"https://thesportsrush.com/cricket-news-mohammad-wasim-jr-castles-nicholas-pooran-with-inch-perfect-yorker-during-pakistan-vs-west-indies-1st-t20i-in-karachi/","keywords":["Cricket","Mohammad Wasim Jr","Nicholas Pooran","West Indies tour of Pakistan 2021"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Mohammad Wasim Jr. castles Nicholas Pooran with inch perfect yorker after Pakistan amass 200/6 during 1st T20I versus West Indies in Karachi. During the first T20I between Pakistan and West Indies at the National Stadium in Karachi, Pakistan’s speedster Mohammmad Wasim Jr. dished out an inch-perfect Yorker to uproot the West Indies skipper Nicholas Pooran’s… The post Mohammad Wasim Jr. castles Nicholas Pooran with inch perfect yorker during Pakistan vs West Indies 1st T20I in Karachi appeared first on The SportsRush.","content":"Mohammad Wasim Jr. castles Nicholas Pooran with inch perfect yorker after Pakistan amass 200/6 during 1st T20I versus West Indies in Karachi. During the first T20I between Pakistan and West Indies at the National Stadium in Karachi, Pakistan’s speedster Mohammmad Wasim Jr. dished out an inch-perfect Yorker to uproot the West Indies skipper Nicholas Pooran’s stumps. It all happened on the penultimate delivery of the fourth Over during the Windies Chase, The 20-year-old Mohammad Wasim, bowled a perfect Yorker at the base of the off-stump to surprise Pooran with his sheer pace. The previous delivery, Pooran had in fact hit Wasim out of the park off a short delivery in front of square. The Windies skipper was simply not expecting Wasim to come up with such a delivery to send him packing, with the dreadful sight of the stumps falling all over the place. Talk about accuracy from the 20-year-old from North Wazirasthan. West Indies in deep trouble Earlier, Pooran won the Toss and invited Pakistan to bat first on what looked like a batting paradise at Karachi’s National stadium. Pakistan skipper Babar Azam (0 off 2) failed to impress yet again after being dismissed in the very first Over of left-arm spinner Akeal Hossain. With the score reading 36/2 after 5 Overs, Haider Ali (68 off 39) joined the in-form wicketkeeper batter Mohammad Rizwan (78 off 52) to stitch together a century stand for the 3rd wicket to take their side to 140/2 after 15 Overs. A final onslaught by Mohammad Nawaz (30 off 10) meant that Pakistan managed to post 200/6 after the end of 20 allotted Overs. The Windies chase in reply got off to poor start, after losing Brandon King (1 0ff 2) in the second Over. Things went downhill soon after with Mohammad Wasim Jr. picking up two back to back wickets in his successive Overs. At the time of writing the Windies scorecard read 88/7 in 14 Overs, with another 113 runs required in mere 6 Overs. Watch: Mohammad Wasim Jr. castles Nicholas Pooran with inch perfect yorker Pace like fire! Mohammad Wasim Jr flattens the off-stump of Nicholas Pooran with a gem of a yorker #PAKvWI pic.twitter.com/S2z8NeDd4T — CricWick (@CricWick) December 13, 2021 For more Cricket related news, click here.     The post Mohammad Wasim Jr. castles Nicholas Pooran with inch perfect yorker during Pakistan vs West Indies 1st T20I in Karachi appeared first on The SportsRush.","pubDate":"2021-12-13 16:27:43","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"India to host Afghanistan for three T20Is in March 2022","link":"https://sportstar.thehindu.com/cricket/india-vs-afghanistan-series-ind-afg-icc-ftp-march-2022-schedule-t20is/article37946613.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"According to the FTP released by the Afghanistan Cricket Board, the team will be travelling to India for an away series after touring Bangladesh.","content":null,"pubDate":"2021-12-13 16:04:35","full_description":null,"image_url":null,"source_id":"sportstar"}]}