{"newsArray":[{"title":"‘If all the pitches are like that I’m done’: Anderson hints at retirement","link":"https://www.watoday.com.au/sport/cricket/if-all-the-pitches-are-like-that-i-m-done-anderson-hints-at-retirement-20230623-p5divj.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"England’s most successful bowler, Jimmy Anderson, suggests flat pitches like the one served up for the first Test in Edgbaston may drive him out of the game.","content":"The world’s most successful fast bowler, Jimmy Anderson, has hinted he may retire if the pitches in this Ashes series continue to be as flat as the one served up for the first Test at Edgbaston. “If all the pitches are like that I’m done in the Ashes series,” Anderson wrote in his column in London’s Daily Telegraph just days after he played almost no part in a dramatic Test, which Australia won by two wickets late on the fifth day. “That pitch was like kryptonite for me. There was not much swing, no reverse swing, no seam movement, no bounce and no pace,” wrote Anderson, who will be 41 next month. “I’ve tried over the years to hone my skills so I can bowl in any conditions but everything I tried made no difference. I felt like I was fighting an uphill battle.” With 686 wickets at an average of 26 in 180 Tests, Anderson sits behind only Muttiah Muralitharan (800) and Shane Warne (708) as the most successful bowler of all time. However, he claimed only one wicket in the first Ashes Test and was not used late in the game when Australia’s tail were completing an improbable run chase and England took the second new ball. There have been suggestions Anderson is still feeling the groin injury which kept him out of England’s Test against Ireland early this month, but an England team spokesman denied there were any fitness concerns. Anderson also defended fellow fast bowler Ollie Robinson for his abusive send-off of Usman Khawaja . Robinson’s celebration, after bowling Khawaja for 141 on Saturday, included him saying “f--- off, you f------ p---k”. Jimmy Anderson is the highest-ranked fast bowler on the all-time Test wicket list but his long career may be nearing its end. Credit: AP “Ollie did nothing wrong when he had his moment with Khawaja. In fact, I stood at mid-off for most of the game and didn’t hear anything said by either team that was unacceptable,” Anderson wrote. Khawaja also said he didn’t hear anything because the crowd noise was so loud when he was dismissed.","pubDate":"2023-06-22 22:30:32","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Joe Root wishes he’d led England like Ben Stokes does","link":"https://www.watoday.com.au/sport/cricket/joe-root-wishes-he-d-led-england-like-ben-stokes-does-20230622-p5diuf.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Joe Root has admitted he would like to go back in time and redo his Test captaincy tenure in the image of Bazball.","content":"Traditionally, a couple of Test match defeats in a row would send England’s cricketers and their mentors scurrying for different ideas and turning over players in search of a fix for the malady being written up in great detail by the British press. Yet in the aftermath of a two-wicket loss to Australia in an Ashes classic at Edgbaston, the regret of Joe Root, newly crowned as the world’s No.1 batter on the ICC rankings, was an entirely different one altogether. Joe Root tries to scoop Pat Cummins at Edgbaston. Credit: AP Root’s humility since handing over the captaincy to Ben Stokes has been one of the hallmarks of a successful transition. As he ruminated on the narrow two-wicket margin in Birmingham, Root spoke of how, given a time machine, he would have tried to lead exactly as Stokes and Brendon McCullum have done. “If I could go back in time I’d go back and start my captaincy tenure the way Ben has and try to play in a similar manner to how he does it,” Root said candidly after Edgbaston. “It’s far more exciting, far more interesting and I think we are getting more out of our team and our individuals. “We’re playing better cricket to watch, producing better results overall. If we are going to grow as a team we can’t just look at a day like this, with a couple of moments going against us, and say ‘we need to do things differently’. “If anything we need to double down on how we do it, completely back ourselves and make sure we get those one per centers right at Lord’s. We feel like we’ve ran the game for five days and we might be on the wrong end of it, but there’s still so much more to come in that dressing room. It’s a great spot to be in.” Captains, even if unsuccessful, tend to be fervently defensive of their chosen methods in the circumstances. But Root’s admission reflected the freedom he felt to give full rein to his own talents, as emphasised by the audacious decision to try to scoop Pat Cummins over the slips on the first ball of day four.","pubDate":"2023-06-22 20:30:09","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘It’s a bummer’: Perry falls agonisingly short of ton as Australia’s depth is tested","link":"https://www.watoday.com.au/sport/cricket/australia-s-depth-tested-by-england-on-ashes-opening-day-20230622-p5diue.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Ellyse Perry was out for 99 and Alyssa Healy had a third Test duck in a row as Australia’s depth was tested by the hosts in Nottingham on day one of the Test at Trent Bridge.","content":"Australia 7-328 (Perry 99, McGrath 61, Ecclestone 3-71) Nottingham: Australian cricket’s envious depth was on display at Trent Bridge as Alyssa Healy unveiled her first team as a Test captain . There was no room for Megan Schutt, Georgia Wareham or Grace Harris – all of whom would likely have played for England. But by the close of the day that depth had been sorely tested, as the hosts unveiled the decidedly sharpish Lauren Filer, a speedy counterpoint to the spin mastery of Sophie Ecclestone on a surface that offered swing, seam and spin in useful quantities. Ellyse Perry in batting action as wicketkeeper Amy Jones and Tammy Beaumont of England look on. Credit: Getty Images As is so often the case whenever Australia get to play a Test match, Ellyse Perry provided the spinal contribution, and like the similarly powerful Tahlia McGrath appeared set to grace Nottingham with a century. That neither McGrath (61) nor Perry (99) were able to get there was down to the combination of Ecclestone (3-71) and Filer (2-65), who each did enough with the Dukes ball to coax errors out of set batters. A 90-minute rain delay may also have served to freshen up a well-grassed pitch. “It’s a number, and one we talk about a lot in cricket,” Perry said of missing her century. Australia’s Alyssa Healy is bowled for a duck by England’s Sophie Ecclestone. Credit: PA via AP “But the whole experience out there today was so much fun. I love every opportunity. Sometimes things just go that way, it’s hard to be disappointed. “There’s just not really much to dwell on there. It’s like every time you get out, it’s a bummer. But the game goes on and life goes on for sure.”","pubDate":"2023-06-22 20:04:48","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka, Oman clash in crucial match","link":"https://www.dailymirror.lk/sports/Sri-Lanka--Oman-clash-in-crucial-match/322-261628","keywords":null,"creator":null,"video_url":null,"description":"Two unbeaten teams in Group B of the ICC Cricket World Cup Qualifiers Sri Lanka and Oman will clash in a crucial match scheduled to be played in Bulawayo, Zimbabwe tomorrow.","content":"ICC World Cup Qualifier Two unbeaten teams in Group B of the ICC Cricket World Cup Qualifiers Sri Lanka and Oman will clash in a crucial match scheduled to be played in Bulawayo, Zimbabwe tomorrow. Oman have been a surprise team at the tournament, exceeding expectations, having already beaten Ireland and UAE and will come into the game full of confidence to register what would be one of their biggest wins in their history. Sri Lanka on the other hand, deemed as one of the strongest of the ten team’s that are battling for the two slots for the forthcoming World Cup, will be facing a team that has pulled off a surprise and are in top form. Sri Lanka began their campaign in style with a massive 175 runs win over UAE with Kusal Mendis who made a top score of 78, Sadeera Samarawickrama (72), Pathum Nissanka (57), Dimuth Karunaratne (52) and an unbeaten 43 by Charith Asalanka which laid the foundation for the win. Spinner Wanindu Hasaranga did the finishing touches with impressive match figures of 6 for 24 which sealed the win for Sri Lanka. Oman too began their campaign with success defeating a Test playing side in Ireland against whom they prevailed with a comfortable five-wicket win a high scoring encounter. They followed it up with another win also by five wickets against UAE. They have four top batsmen in their ranks in Kashyap Prajapati, skipper Zeeshan Maqsood, Aqib Illyas, who so far made back to back half tons, Mohammad Nadeem and Shoaib Khan from whom they will be expecting for a repeat of their performances of the first two matches. But it’s left to be seen whether the Omanis would be able to come in terms with the Sri Lanka bowling which much more contrast than the two teams that they confronted and Sri Lanka no doubt will be favored carry on their winning trend which began against Afghanistan in their three-match series. (MSA)","pubDate":"2023-06-22 18:55:12","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_b134b556f3.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"\"जब भी मुझे सलाह की जरूरत होती है...\", विराट को लेकर पाकिस्तानी बल्लेबाज़ ने कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/ahmed-shahzad-on-virat-kohli-about-hi-batting-and-fitness-whenever-i-needed-advice-see-virat-kohli-4145010#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Ahmed Shahzad on Virat Kohli: एक बल्लेबाज के रूप में अपनी क्षमताओं के अलावा, कोहली ने भारत में एक फिटनेस का दौर शुरू किया है, जिसका पालन देश का हर उभरता हुआ क्रिकेटर करता है.","content":"Ahmed Shahzad on Virat Kohli भारत के स्टार बल्लेबाज विराट कोहली को उनके स्वभाव और उनकी काम के लिए विश्व स्तर पर सराहना मिलती है. एक बल्लेबाज के रूप में अपनी क्षमताओं के अलावा, कोहली ने भारत में एक फिटनेस का दौर शुरू किया है, जिसका पालन देश का हर उभरता हुआ क्रिकेटर करता है. हालांकि, उनका आकर्षण भारत तक ही सीमित नहीं है. पाकिस्तानी बल्लेबाज अहमद शहजाद, जिनकी तुलना अक्सर कोहली से की जाती है, भारत के पूर्व कप्तान के बहुत बड़े प्रशंसक हैं. शहजाद ने कोहली की जमकर तारीफ की और 34 वर्षीय खिलाड़ी को भारत की टेस्ट टीम की किस्मत बदलने का श्रेय दिया. शहजाद (Ahmed Shahzad on Virat Kohli) को भरोसा है कि बल्लेबाजी का महारथी फिर से उभरेगा, उनका कहना है कि कोहली का \"सर्वश्रेष्ठ आना अभी बाकी है\". \"हम एक-दूसरे के लिए परस्पर सम्मान साझा करते हैं. जब भी मुझे क्रिकेट के संबंध में किसी सलाह की आवश्यकता होती है, वह दयालु रहे हैं (मेरी मदद करने के लिए). एक खिलाड़ी के रूप में मैं वास्तव में उनका सम्मान करता हूं. उन्होंने खुद को नाटकीय रूप से बदल दिया है. जब वह इस दौरान सामने आए थे अंडर-19 विश्व कप में, वह थोड़ा मोटे थे, लेकिन जिस तरह से उन्होंने खुद को बदला है, केवल क्रिकेट के पहलू से, वह सराहनीय है. वह भारत को टेस्ट क्रिकेट में नई ऊंचाइयों पर ले गए. मैंने ऐसा कोई नहीं देखा जिसने ऐसा किया हो. मुझे लगता है, उनका सर्वश्रेष्ठ आना अभी बाकी है,'' शहजाद ने नादिर अली के पॉडकास्ट पर कहा. भारतीय टेस्ट कप्तान के रूप में अपने कार्यकाल के दौरान, कोहली ने टीम को अंतर्राष्ट्रीय क्रिकेट परिषद (आईसीसी) की विश्व रैंकिंग में शीर्ष पर पहुंचाया और ऑस्ट्रेलिया में एक श्रृंखला भी जीती. उन्होंने जून 2021 में लॉर्ड्स में आईसीसी विश्व टेस्ट चैंपियनशिप फाइनल के फाइनल में भी टीम का नेतृत्व किया, जहां वे केन विलियमसन की अगुवाई वाली न्यूजीलैंड से हार गए. जहां तक शहजाद की बात है, उन्हें आखिरी बार पाकिस्तानी टीम के लिए खेलने का मौका मिले काफी समय हो गया है. साल 2019 में राष्ट्रीय टीम के लिए प्रदर्शन किया. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-06-22 18:40:58","image_url":"https://c.ndtvimg.com/2022-10/23kd7v_virat-kohli-afp-_650x400_24_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ellyse Perry misses out on 3rd Test hundred, Australia reach 328/7 at stumps on Day 1","link":"https://www.indiatoday.in/sports/cricket/story/womens-ashes-day-1-ellyse-perry-misses-out-on-3rd-test-hundred-australia-reach-3287-at-stumps-2396679-2023-06-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ellyse Perry misses out on 3rd Test hundred, Australia reach 328/7 at stumps on Day 1","content":": Ellyse Perry fell just short of scoring her third Test century as England fought back against Australia on the first day of the Ashes Test at Trent Bridge on Thursday. Australia reached 328/7, with Annabel Sutherland unbeaten on 39 and Alana King on seven. The match saw a momentum swing between the two teams after Australia chose to bat first. Australia had a strong start and were cruising at 215/3 close to tea when rain interrupted the game. After the resumption, England's Sophie Ecclestone and debutant Lauren Filer took three quick wickets, including the dismissals of Healy for a duck and . However, Ashleigh Gardner and Annabel Sutherland managed to regain some momentum for Australia, taking the team past the 300-run mark before stumps. A fine catch to end a fine knock! Ellyse Perry is out for 99 — cricket.com.au (@cricketcomau) Ecclestone showcased her skills as the world's premier spinner, bowling 31 overs and ending the day with figures of 3-71. Filer, who was a surprise inclusion in England's Test squad, troubled the Australian batters with her pace and bounce, taking two important wickets, including that of Beth Mooney for 33 and denying Perry her century. Promoted to No.3 for this Test, Perry made her intentions clear from the start, dispatching Ecclestone's first ball to the boundary. She formed a crucial partnership with Tahlia McGrath, helping Australia gain an advantage in the middle session. McGrath played some excellent shots and reached her second Test fifty off just 67 deliveries. However, Ecclestone spun one past McGrath's defenses, dismissing her for a career-best 61 and ending their partnership of 119 runs. Meanwhile, Perry continued to dominate against the red-ball, punishing loose deliveries and handling Ecclestone's challenges. Her innings was interrupted by rain when she was on 82 and Australia was at 213/3. After the rain delay, Ecclestone struck twice in an over, dismissing Jess Jonassen for 11 and bowling Healy for a duck. England fought their way back into the game, reducing Australia to 226/5. Earlier in the day, Healy won the toss and chose to bat, a decision that pleased both captains as England's Heather Knight revealed she would have made the same choice. Debutant Phoebe Litchfield looked comfortable at the top of the order but was given out lbw on 23. Mooney, who had a few lucky escapes, eventually edged Filer to gully, leaving Australia at 83/2. The Ashes Test marks the beginning of the multi-format series, with four points available for this match and two points for each of the three ODIs and three T20s. Australia have held the Ashes since 2015.","pubDate":"2023-06-22 18:29:48","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Bazball must stay. Losing still hurts, but at least this isn’t cricket to do admin to","link":"https://metro.co.uk/2023/06/22/bazball-must-stay-losing-hurts-but-this-isnt-cricket-to-do-admin-to-18999049/","keywords":["Cricket","Sport","Australia cricket","Ben Stokes","Brendon McCullum","England cricket","Metro newspaper","The Ashes"],"creator":["Kate Mason"],"video_url":null,"description":"Whoever you are – a former Test captain, a paying guest or a social-media vibe – this England team cannot care.","content":"I back the declaration and you should, too. Here’s Ben Stokes, the England captain who called his batters in on 393 for eight on day one of the first Test: ‘I am not a captain who gets by on what ifs. We saw it as an opportunity to pounce on Australia and really start day two on top.’ Also: ‘I am not going to change the way I have gone about my cricket because it is the Ashes.’ England had Joe Root out there looking fierce on 118, but Stokes chose to put Australia in to bat after 78 overs. His was the earliest declaration in Ashes history. And, lest we forget, the Ashes have been being played since 1882. Anyone with a passing interest will know by now the England Test team of today play a piratical version of cricket known as Bazball. For everybody else, it is very simply put an aggressive style with a positive mental attitude deployed in the sport’s most traditional format. If you don’t know what Test cricket is, it’s the one played in whites between two countries lasting five whole days yet still often ending in a draw. Baz is Brendon McCullum to you and me, England men’s head coach in the longest form of cricket. He took over 13 months ago, two weeks after Stokes was appointed captain. Baz doesn’t like the term. It lacks nuance. Sounds like short form hit-and-hope cricket smuggled into the noble five-day fete with which you are about to become obsessed. Why is it not Benball? After all the captain’s little wrinkled frown when considering his options is what comes to mind when reflecting on the 11 wins from 14 since England’s Test shake-up last summer. His powerful on-field decision-making and extraordinary all-round talent makes Stokes a more than worthy totem. Perhaps it’s because it sounds like an expensive pen rebrand. Either way, Bazball it is. And whatever you call it, it is beautiful. To sustain that level of intrigue over a contest the length of a working week, peppered with irritating midlands rain flurries and blistery fingers, and to do it each time out: that’s something new. How Titan five could be rescued in four terrifying steps TikTok prankster Mizzy flouts court order and sneaks into another home Titanic billionaire's stepson defends bizarre move: 'What am I supposed to do?' Back to the Stokes’ declaration. It was taken in independence from whatever you think. Whoever you are – a former Test captain, a paying guest or a social-media vibe – this England team cannot care. That’s not pig-headed belligerence, that’s a hard-won decision from a man who took a mental-health break from cricket in 2021 to come back into the sport on his own terms, when ready. So, England could have had 40 more runs in the first innings, or Jonny Bairstow could make a few catches, or Stuart Broad could have bowled a legal ball to Usman Khawaja, or Stokes could have held onto that improbable chance with Australia 37 runs short. Or England could have batted 170 first-innings overs and supplied us with a drizzly draw, and the kind of cricket you can do admin to. Instead we got this. Against the world champion Test side. A two-wicket loss, with all kinds of imponderables. As Stokes pointed out afterwards, ‘losing sucks’. If this England team go on to be whitewashed in this Ashes series, well, let’s have a rethink. But when he says ‘we’re not a results-driven team’ he means it. Losing hurts, but it can’t retrospectively inform the thinking. He and his Brett Lee-scarred head coach, owner of the fastest-ever Test hundred, will – contrary to Michael Vaughan’s theory – do the same again if the opportunity arises again at Lord’s. And I will love it. But, God, the 40 runs might have come in useful, mightn’t they? MORE : ‘We spoke and we are all good’ – Ollie Robinson has ‘learned his lesson’ after Usman Khawaja Ashes send-off MORE : After the revolution must come evolution if macho England are to win back the Ashes","pubDate":"2023-06-22 18:24:52","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘That’s heartbreaking’: Ellyse Perry falls agonisingly short of century in Trent Bridge Ashes Test","link":"https://www.foxsports.com.au/cricket/the-ashes/thats-heartbreaking-ellyse-perry-falls-agonisingly-short-of-century-on-day-one-of-ashes-test-at-trent-bridge/news-story/4cad21532e7e996c12953ba7d7cb9c4e","keywords":null,"creator":null,"video_url":null,"description":"Ellyse Perry has fallen agonisingly short of scoring her third Test century, dismissed for 99 on day one of the women’s Ashes Test against England at Trent Bridge.","content":null,"pubDate":"2023-06-22 18:17:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"PCB BOG's constituted; date for chairman’s election revised","link":"https://en.dailypakistan.com.pk/22-Jun-2023/pcb-bog-s-constituted-date-for-chairman-s-election-revised","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE — Following announcement that 28 June will be a holiday, the Election Commissioner has confirmed the PCB Chairman’s elections will be held at the Gaddafi Stadium in Lahore on Tuesday, 27th June.","content":"LAHORE — Following announcement that 28 June will be a holiday, the Election Commissioner has confirmed the PCB Chairman’s elections will be held at the Gaddafi Stadium in Lahore on Tuesday, 27th June. The election calendar will be made public when the departments and service organisations have filed their nominees. The Election Commission office has contacted departments and service organisations to nominate representatives. PCB is in receipt of letter and notification dated 20 June from the Inter-Provincial Coordination (IPC) Ministry that states: “On completion of the tenure, the Management Committee of PCB stands dissolved, ceases to operate”. Accordingly, the Election Commissioner, Mr Ahmed Shehzad Farooq Rana, who is also the Acting Chair of the PCB, has constituted the PCB Board of Governors in accordance with Para 10 of the PCB Constitution 2014 and in line with and pursuant to the above referred letter and notification. The formation of the PCB BOG now stands as follows: Mr Muhammad Zaka Ashraf (PCB Patron’s nominee) Mr Mustafa Ramday (PCB Patron’s nominee) National Bank of Pakistan State Bank of Pakistan Sui Northern Gas Pipeline Limited (SNGPL) Sui Southern Gas Company (SSGC) President Larkana Region President Dera Murad Jamali Region President Bahawalpur Region President Hyderabad Region It is to remember that Zaka Ashraf is all set to take over the reins of Pakistan Cricket Board’s (PCB) stewardship before Eid-ul-Azha as Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari said on Wednesday that the government did not want to delay his appointment. Talking to media along with Zaka Ashraf the minister said that the PCB Election Commissioner would be looking after the affairs of the board till the election of the new PCB chief. “Every effort will be made to hold the elections before Eid. It is clear that Zaka Ashraf will be the new chairman of the board, following its elections,” he said. The Prime Minister Office on Tuesday in a notification said that the prime minister had nominated Zaka and Supreme Court advocate Mustafa Ramday as PCB’s Board of Governors (BoG).","pubDate":"2023-06-22 18:12:32","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-06-22/1687456211-9466.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB चीफ बनने से पहले ही अकड़ दिखा रहे थे जका अशरफ, 24 घंटे के भीतर लेना पड़ा यूटर्न","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pcb-future-chairman-zaka-ashraf-take-u-turn-said-will-go-with-acc-decision-on-hybrid-model/articleshow/101199363.cms","keywords":null,"creator":null,"video_url":null,"description":"Asia cup 2023: पाकिस्तान क्रिकेट बोर्ड के भावी अध्यक्ष जका अशरफ ने अपने उस बयान यूटर्न ले लिया है जिसमें उन्होंने कहा था कि वह एशिया कप के हाइब्रिड मॉडल के तहत मेजबानी को स्वीकार नहीं करेंगे। उन्होंने बयान देने के 24 घंटे के भीतर ही यूटर्न लिया है।","content":"पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के भावी अध्यक्ष जका अशरफ ने एशिया कप की मेजबानी पर यूटर्न ले लिया है। एशियाई क्रिकेट परिषद (एसीसी) की औपचारिक स्वीकृति के बावजूद जका एशिया कप के ‘हाइब्रिड मॉडल’ को ‘खारिज’ करने की बात कही थी लेकिन 24 घंटे से भीतर ही उन्होंने ‘यूटर्न’ लेते हुए चार मैचों की मेजबानी स्वीकार कर ली है। हाइब्रिड मॉडल के तहत एशिया कप की सह मेजबानी पाकिस्तान और श्रीलंका करेंगे। भारत अपने सभी मैच श्रीलंका में खेलेगा जिसमें चिर प्रतिद्वंद्वी पाकिस्तान के खिलाफ दो मैच भी शामिल हैं। यह मॉडल अशरफ के पूर्ववर्ती नजम सेठी ने पेश किया था। 27 जून को पीसीबी की कमान संभालने जा रहे अशरफ ने हालांकि प्रेस कांफ्रेंस में इसे खारिज कर दिया था। पता चला है कि अशरफ को नहीं पता था कि पीसीबी के मौजूदा प्रमुख सेठी पहले ही ‘हाइब्रिड मॉडल’ पर हस्ताक्षर कर चुके हैं और इसे भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव जय शाह की अध्यक्षता वाले एसीसी के कार्यकारी बोर्ड से स्वीकृति मिल चुकी है और इस फैसले को बदला नहीं जा सकता। अशरफ अगर बिना पूर्ण जानकारी से अड़ंगा डालने का प्रयास करते तो पीसीबी को सजा का सामना करना पड़ सकता था। ‘ईएसपीएनक्रिकइंफो’ ने अशरफ के हवाले से कहा, 'मेरी व्यक्तिगत राय में, यह पूरा हाइब्रिड मॉडल पाकिस्तान के लिए फायदेमंद नहीं है और मुझे यह पसंद नहीं आया।' उन्होंने कहा, 'एक मेजबान होने के नाते पाकिस्तान को यह सुनिश्चित करने के लिए बेहतर बातचीत करनी चाहिए थी कि पूरा टूर्नामेंट पाकिस्तान में खेला जाना चाहिए। श्रीलंका ने बड़े मैच ले लिए, पाकिस्तान के लिए केवल चार मैचों को छोड़ दिया, यह हमारे देश के सर्वोत्तम हित में नहीं है।' इसके बाद अशरफ ने स्वीकार किया कि उन्हें पूरी जानकारी नहीं थी और उन्होंने पूरी तरह से यूटर्न ले लिया। उन्होंने कहा, 'लेकिन मैं देख रहा हूं कि निर्णय लिया जा चुका है इसलिए हमें इसके साथ जाना होगा। मैं इसे नहीं रोकूंगा या फैसले का पालन नहीं करने का कोई इरादा नहीं है। मैं इसके बारे में प्रतिबद्धता का सम्मान करने के अलावा बहुत कुछ नहीं कर सकता। लेकिन भविष्य में हम जो निर्णय लेंगे वह देश के लिए और देश के हित में होगा।'","pubDate":"2023-06-22 17:57:57","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"‘If all the pitches are like that I’m done’: Anderson hints at retirement","link":"https://www.watoday.com.au/sport/cricket/if-all-the-pitches-are-like-that-i-m-done-anderson-hints-at-retirement-20230623-p5divj.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"England’s most successful bowler, Jimmy Anderson, suggests flat pitches like the one served up for the first Test in Edgbaston may drive him out of the game.","content":"The world’s most successful fast bowler, Jimmy Anderson, has hinted he may retire if the pitches in this Ashes series continue to be as flat as the one served up for the first Test at Edgbaston. “If all the pitches are like that I’m done in the Ashes series,” Anderson wrote in his column in London’s Daily Telegraph just days after he played almost no part in a dramatic Test, which Australia won by two wickets late on the fifth day. “That pitch was like kryptonite for me. There was not much swing, no reverse swing, no seam movement, no bounce and no pace,” wrote Anderson, who will be 41 next month. “I’ve tried over the years to hone my skills so I can bowl in any conditions but everything I tried made no difference. I felt like I was fighting an uphill battle.” With 686 wickets at an average of 26 in 180 Tests, Anderson sits behind only Muttiah Muralitharan (800) and Shane Warne (708) as the most successful bowler of all time. However, he claimed only one wicket in the first Ashes Test and was not used late in the game when Australia’s tail were completing an improbable run chase and England took the second new ball. There have been suggestions Anderson is still feeling the groin injury which kept him out of England’s Test against Ireland early this month, but an England team spokesman denied there were any fitness concerns. Anderson also defended fellow fast bowler Ollie Robinson for his abusive send-off of Usman Khawaja . Robinson’s celebration, after bowling Khawaja for 141 on Saturday, included him saying “f--- off, you f------ p---k”. Jimmy Anderson is the highest-ranked fast bowler on the all-time Test wicket list but his long career may be nearing its end. Credit: AP “Ollie did nothing wrong when he had his moment with Khawaja. In fact, I stood at mid-off for most of the game and didn’t hear anything said by either team that was unacceptable,” Anderson wrote. Khawaja also said he didn’t hear anything because the crowd noise was so loud when he was dismissed.","pubDate":"2023-06-22 22:30:32","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Joe Root wishes he’d led England like Ben Stokes does","link":"https://www.watoday.com.au/sport/cricket/joe-root-wishes-he-d-led-england-like-ben-stokes-does-20230622-p5diuf.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Joe Root has admitted he would like to go back in time and redo his Test captaincy tenure in the image of Bazball.","content":"Traditionally, a couple of Test match defeats in a row would send England’s cricketers and their mentors scurrying for different ideas and turning over players in search of a fix for the malady being written up in great detail by the British press. Yet in the aftermath of a two-wicket loss to Australia in an Ashes classic at Edgbaston, the regret of Joe Root, newly crowned as the world’s No.1 batter on the ICC rankings, was an entirely different one altogether. Joe Root tries to scoop Pat Cummins at Edgbaston. Credit: AP Root’s humility since handing over the captaincy to Ben Stokes has been one of the hallmarks of a successful transition. As he ruminated on the narrow two-wicket margin in Birmingham, Root spoke of how, given a time machine, he would have tried to lead exactly as Stokes and Brendon McCullum have done. “If I could go back in time I’d go back and start my captaincy tenure the way Ben has and try to play in a similar manner to how he does it,” Root said candidly after Edgbaston. “It’s far more exciting, far more interesting and I think we are getting more out of our team and our individuals. “We’re playing better cricket to watch, producing better results overall. If we are going to grow as a team we can’t just look at a day like this, with a couple of moments going against us, and say ‘we need to do things differently’. “If anything we need to double down on how we do it, completely back ourselves and make sure we get those one per centers right at Lord’s. We feel like we’ve ran the game for five days and we might be on the wrong end of it, but there’s still so much more to come in that dressing room. It’s a great spot to be in.” Captains, even if unsuccessful, tend to be fervently defensive of their chosen methods in the circumstances. But Root’s admission reflected the freedom he felt to give full rein to his own talents, as emphasised by the audacious decision to try to scoop Pat Cummins over the slips on the first ball of day four.","pubDate":"2023-06-22 20:30:09","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘It’s a bummer’: Perry falls agonisingly short of ton as Australia’s depth is tested","link":"https://www.watoday.com.au/sport/cricket/australia-s-depth-tested-by-england-on-ashes-opening-day-20230622-p5diue.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Ellyse Perry was out for 99 and Alyssa Healy had a third Test duck in a row as Australia’s depth was tested by the hosts in Nottingham on day one of the Test at Trent Bridge.","content":"Australia 7-328 (Perry 99, McGrath 61, Ecclestone 3-71) Nottingham: Australian cricket’s envious depth was on display at Trent Bridge as Alyssa Healy unveiled her first team as a Test captain . There was no room for Megan Schutt, Georgia Wareham or Grace Harris – all of whom would likely have played for England. But by the close of the day that depth had been sorely tested, as the hosts unveiled the decidedly sharpish Lauren Filer, a speedy counterpoint to the spin mastery of Sophie Ecclestone on a surface that offered swing, seam and spin in useful quantities. Ellyse Perry in batting action as wicketkeeper Amy Jones and Tammy Beaumont of England look on. Credit: Getty Images As is so often the case whenever Australia get to play a Test match, Ellyse Perry provided the spinal contribution, and like the similarly powerful Tahlia McGrath appeared set to grace Nottingham with a century. That neither McGrath (61) nor Perry (99) were able to get there was down to the combination of Ecclestone (3-71) and Filer (2-65), who each did enough with the Dukes ball to coax errors out of set batters. A 90-minute rain delay may also have served to freshen up a well-grassed pitch. “It’s a number, and one we talk about a lot in cricket,” Perry said of missing her century. Australia’s Alyssa Healy is bowled for a duck by England’s Sophie Ecclestone. Credit: PA via AP “But the whole experience out there today was so much fun. I love every opportunity. Sometimes things just go that way, it’s hard to be disappointed. “There’s just not really much to dwell on there. It’s like every time you get out, it’s a bummer. But the game goes on and life goes on for sure.”","pubDate":"2023-06-22 20:04:48","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka, Oman clash in crucial match","link":"https://www.dailymirror.lk/sports/Sri-Lanka--Oman-clash-in-crucial-match/322-261628","keywords":null,"creator":null,"video_url":null,"description":"Two unbeaten teams in Group B of the ICC Cricket World Cup Qualifiers Sri Lanka and Oman will clash in a crucial match scheduled to be played in Bulawayo, Zimbabwe tomorrow.","content":"ICC World Cup Qualifier Two unbeaten teams in Group B of the ICC Cricket World Cup Qualifiers Sri Lanka and Oman will clash in a crucial match scheduled to be played in Bulawayo, Zimbabwe tomorrow. Oman have been a surprise team at the tournament, exceeding expectations, having already beaten Ireland and UAE and will come into the game full of confidence to register what would be one of their biggest wins in their history. Sri Lanka on the other hand, deemed as one of the strongest of the ten team’s that are battling for the two slots for the forthcoming World Cup, will be facing a team that has pulled off a surprise and are in top form. Sri Lanka began their campaign in style with a massive 175 runs win over UAE with Kusal Mendis who made a top score of 78, Sadeera Samarawickrama (72), Pathum Nissanka (57), Dimuth Karunaratne (52) and an unbeaten 43 by Charith Asalanka which laid the foundation for the win. Spinner Wanindu Hasaranga did the finishing touches with impressive match figures of 6 for 24 which sealed the win for Sri Lanka. Oman too began their campaign with success defeating a Test playing side in Ireland against whom they prevailed with a comfortable five-wicket win a high scoring encounter. They followed it up with another win also by five wickets against UAE. They have four top batsmen in their ranks in Kashyap Prajapati, skipper Zeeshan Maqsood, Aqib Illyas, who so far made back to back half tons, Mohammad Nadeem and Shoaib Khan from whom they will be expecting for a repeat of their performances of the first two matches. But it’s left to be seen whether the Omanis would be able to come in terms with the Sri Lanka bowling which much more contrast than the two teams that they confronted and Sri Lanka no doubt will be favored carry on their winning trend which began against Afghanistan in their three-match series. (MSA)","pubDate":"2023-06-22 18:55:12","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_b134b556f3.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"\"जब भी मुझे सलाह की जरूरत होती है...\", विराट को लेकर पाकिस्तानी बल्लेबाज़ ने कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/ahmed-shahzad-on-virat-kohli-about-hi-batting-and-fitness-whenever-i-needed-advice-see-virat-kohli-4145010#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Ahmed Shahzad on Virat Kohli: एक बल्लेबाज के रूप में अपनी क्षमताओं के अलावा, कोहली ने भारत में एक फिटनेस का दौर शुरू किया है, जिसका पालन देश का हर उभरता हुआ क्रिकेटर करता है.","content":"Ahmed Shahzad on Virat Kohli भारत के स्टार बल्लेबाज विराट कोहली को उनके स्वभाव और उनकी काम के लिए विश्व स्तर पर सराहना मिलती है. एक बल्लेबाज के रूप में अपनी क्षमताओं के अलावा, कोहली ने भारत में एक फिटनेस का दौर शुरू किया है, जिसका पालन देश का हर उभरता हुआ क्रिकेटर करता है. हालांकि, उनका आकर्षण भारत तक ही सीमित नहीं है. पाकिस्तानी बल्लेबाज अहमद शहजाद, जिनकी तुलना अक्सर कोहली से की जाती है, भारत के पूर्व कप्तान के बहुत बड़े प्रशंसक हैं. शहजाद ने कोहली की जमकर तारीफ की और 34 वर्षीय खिलाड़ी को भारत की टेस्ट टीम की किस्मत बदलने का श्रेय दिया. शहजाद (Ahmed Shahzad on Virat Kohli) को भरोसा है कि बल्लेबाजी का महारथी फिर से उभरेगा, उनका कहना है कि कोहली का \"सर्वश्रेष्ठ आना अभी बाकी है\". \"हम एक-दूसरे के लिए परस्पर सम्मान साझा करते हैं. जब भी मुझे क्रिकेट के संबंध में किसी सलाह की आवश्यकता होती है, वह दयालु रहे हैं (मेरी मदद करने के लिए). एक खिलाड़ी के रूप में मैं वास्तव में उनका सम्मान करता हूं. उन्होंने खुद को नाटकीय रूप से बदल दिया है. जब वह इस दौरान सामने आए थे अंडर-19 विश्व कप में, वह थोड़ा मोटे थे, लेकिन जिस तरह से उन्होंने खुद को बदला है, केवल क्रिकेट के पहलू से, वह सराहनीय है. वह भारत को टेस्ट क्रिकेट में नई ऊंचाइयों पर ले गए. मैंने ऐसा कोई नहीं देखा जिसने ऐसा किया हो. मुझे लगता है, उनका सर्वश्रेष्ठ आना अभी बाकी है,'' शहजाद ने नादिर अली के पॉडकास्ट पर कहा. भारतीय टेस्ट कप्तान के रूप में अपने कार्यकाल के दौरान, कोहली ने टीम को अंतर्राष्ट्रीय क्रिकेट परिषद (आईसीसी) की विश्व रैंकिंग में शीर्ष पर पहुंचाया और ऑस्ट्रेलिया में एक श्रृंखला भी जीती. उन्होंने जून 2021 में लॉर्ड्स में आईसीसी विश्व टेस्ट चैंपियनशिप फाइनल के फाइनल में भी टीम का नेतृत्व किया, जहां वे केन विलियमसन की अगुवाई वाली न्यूजीलैंड से हार गए. जहां तक शहजाद की बात है, उन्हें आखिरी बार पाकिस्तानी टीम के लिए खेलने का मौका मिले काफी समय हो गया है. साल 2019 में राष्ट्रीय टीम के लिए प्रदर्शन किया. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-06-22 18:40:58","image_url":"https://c.ndtvimg.com/2022-10/23kd7v_virat-kohli-afp-_650x400_24_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ellyse Perry misses out on 3rd Test hundred, Australia reach 328/7 at stumps on Day 1","link":"https://www.indiatoday.in/sports/cricket/story/womens-ashes-day-1-ellyse-perry-misses-out-on-3rd-test-hundred-australia-reach-3287-at-stumps-2396679-2023-06-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ellyse Perry misses out on 3rd Test hundred, Australia reach 328/7 at stumps on Day 1","content":": Ellyse Perry fell just short of scoring her third Test century as England fought back against Australia on the first day of the Ashes Test at Trent Bridge on Thursday. Australia reached 328/7, with Annabel Sutherland unbeaten on 39 and Alana King on seven. The match saw a momentum swing between the two teams after Australia chose to bat first. Australia had a strong start and were cruising at 215/3 close to tea when rain interrupted the game. After the resumption, England's Sophie Ecclestone and debutant Lauren Filer took three quick wickets, including the dismissals of Healy for a duck and . However, Ashleigh Gardner and Annabel Sutherland managed to regain some momentum for Australia, taking the team past the 300-run mark before stumps. A fine catch to end a fine knock! Ellyse Perry is out for 99 — cricket.com.au (@cricketcomau) Ecclestone showcased her skills as the world's premier spinner, bowling 31 overs and ending the day with figures of 3-71. Filer, who was a surprise inclusion in England's Test squad, troubled the Australian batters with her pace and bounce, taking two important wickets, including that of Beth Mooney for 33 and denying Perry her century. Promoted to No.3 for this Test, Perry made her intentions clear from the start, dispatching Ecclestone's first ball to the boundary. She formed a crucial partnership with Tahlia McGrath, helping Australia gain an advantage in the middle session. McGrath played some excellent shots and reached her second Test fifty off just 67 deliveries. However, Ecclestone spun one past McGrath's defenses, dismissing her for a career-best 61 and ending their partnership of 119 runs. Meanwhile, Perry continued to dominate against the red-ball, punishing loose deliveries and handling Ecclestone's challenges. Her innings was interrupted by rain when she was on 82 and Australia was at 213/3. After the rain delay, Ecclestone struck twice in an over, dismissing Jess Jonassen for 11 and bowling Healy for a duck. England fought their way back into the game, reducing Australia to 226/5. Earlier in the day, Healy won the toss and chose to bat, a decision that pleased both captains as England's Heather Knight revealed she would have made the same choice. Debutant Phoebe Litchfield looked comfortable at the top of the order but was given out lbw on 23. Mooney, who had a few lucky escapes, eventually edged Filer to gully, leaving Australia at 83/2. The Ashes Test marks the beginning of the multi-format series, with four points available for this match and two points for each of the three ODIs and three T20s. Australia have held the Ashes since 2015.","pubDate":"2023-06-22 18:29:48","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Bazball must stay. Losing still hurts, but at least this isn’t cricket to do admin to","link":"https://metro.co.uk/2023/06/22/bazball-must-stay-losing-hurts-but-this-isnt-cricket-to-do-admin-to-18999049/","keywords":["Cricket","Sport","Australia cricket","Ben Stokes","Brendon McCullum","England cricket","Metro newspaper","The Ashes"],"creator":["Kate Mason"],"video_url":null,"description":"Whoever you are – a former Test captain, a paying guest or a social-media vibe – this England team cannot care.","content":"I back the declaration and you should, too. Here’s Ben Stokes, the England captain who called his batters in on 393 for eight on day one of the first Test: ‘I am not a captain who gets by on what ifs. We saw it as an opportunity to pounce on Australia and really start day two on top.’ Also: ‘I am not going to change the way I have gone about my cricket because it is the Ashes.’ England had Joe Root out there looking fierce on 118, but Stokes chose to put Australia in to bat after 78 overs. His was the earliest declaration in Ashes history. And, lest we forget, the Ashes have been being played since 1882. Anyone with a passing interest will know by now the England Test team of today play a piratical version of cricket known as Bazball. For everybody else, it is very simply put an aggressive style with a positive mental attitude deployed in the sport’s most traditional format. If you don’t know what Test cricket is, it’s the one played in whites between two countries lasting five whole days yet still often ending in a draw. Baz is Brendon McCullum to you and me, England men’s head coach in the longest form of cricket. He took over 13 months ago, two weeks after Stokes was appointed captain. Baz doesn’t like the term. It lacks nuance. Sounds like short form hit-and-hope cricket smuggled into the noble five-day fete with which you are about to become obsessed. Why is it not Benball? After all the captain’s little wrinkled frown when considering his options is what comes to mind when reflecting on the 11 wins from 14 since England’s Test shake-up last summer. His powerful on-field decision-making and extraordinary all-round talent makes Stokes a more than worthy totem. Perhaps it’s because it sounds like an expensive pen rebrand. Either way, Bazball it is. And whatever you call it, it is beautiful. To sustain that level of intrigue over a contest the length of a working week, peppered with irritating midlands rain flurries and blistery fingers, and to do it each time out: that’s something new. How Titan five could be rescued in four terrifying steps TikTok prankster Mizzy flouts court order and sneaks into another home Titanic billionaire's stepson defends bizarre move: 'What am I supposed to do?' Back to the Stokes’ declaration. It was taken in independence from whatever you think. Whoever you are – a former Test captain, a paying guest or a social-media vibe – this England team cannot care. That’s not pig-headed belligerence, that’s a hard-won decision from a man who took a mental-health break from cricket in 2021 to come back into the sport on his own terms, when ready. So, England could have had 40 more runs in the first innings, or Jonny Bairstow could make a few catches, or Stuart Broad could have bowled a legal ball to Usman Khawaja, or Stokes could have held onto that improbable chance with Australia 37 runs short. Or England could have batted 170 first-innings overs and supplied us with a drizzly draw, and the kind of cricket you can do admin to. Instead we got this. Against the world champion Test side. A two-wicket loss, with all kinds of imponderables. As Stokes pointed out afterwards, ‘losing sucks’. If this England team go on to be whitewashed in this Ashes series, well, let’s have a rethink. But when he says ‘we’re not a results-driven team’ he means it. Losing hurts, but it can’t retrospectively inform the thinking. He and his Brett Lee-scarred head coach, owner of the fastest-ever Test hundred, will – contrary to Michael Vaughan’s theory – do the same again if the opportunity arises again at Lord’s. And I will love it. But, God, the 40 runs might have come in useful, mightn’t they? MORE : ‘We spoke and we are all good’ – Ollie Robinson has ‘learned his lesson’ after Usman Khawaja Ashes send-off MORE : After the revolution must come evolution if macho England are to win back the Ashes","pubDate":"2023-06-22 18:24:52","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘That’s heartbreaking’: Ellyse Perry falls agonisingly short of century in Trent Bridge Ashes Test","link":"https://www.foxsports.com.au/cricket/the-ashes/thats-heartbreaking-ellyse-perry-falls-agonisingly-short-of-century-on-day-one-of-ashes-test-at-trent-bridge/news-story/4cad21532e7e996c12953ba7d7cb9c4e","keywords":null,"creator":null,"video_url":null,"description":"Ellyse Perry has fallen agonisingly short of scoring her third Test century, dismissed for 99 on day one of the women’s Ashes Test against England at Trent Bridge.","content":null,"pubDate":"2023-06-22 18:17:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"PCB BOG's constituted; date for chairman’s election revised","link":"https://en.dailypakistan.com.pk/22-Jun-2023/pcb-bog-s-constituted-date-for-chairman-s-election-revised","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE — Following announcement that 28 June will be a holiday, the Election Commissioner has confirmed the PCB Chairman’s elections will be held at the Gaddafi Stadium in Lahore on Tuesday, 27th June.","content":"LAHORE — Following announcement that 28 June will be a holiday, the Election Commissioner has confirmed the PCB Chairman’s elections will be held at the Gaddafi Stadium in Lahore on Tuesday, 27th June. The election calendar will be made public when the departments and service organisations have filed their nominees. The Election Commission office has contacted departments and service organisations to nominate representatives. PCB is in receipt of letter and notification dated 20 June from the Inter-Provincial Coordination (IPC) Ministry that states: “On completion of the tenure, the Management Committee of PCB stands dissolved, ceases to operate”. Accordingly, the Election Commissioner, Mr Ahmed Shehzad Farooq Rana, who is also the Acting Chair of the PCB, has constituted the PCB Board of Governors in accordance with Para 10 of the PCB Constitution 2014 and in line with and pursuant to the above referred letter and notification. The formation of the PCB BOG now stands as follows: Mr Muhammad Zaka Ashraf (PCB Patron’s nominee) Mr Mustafa Ramday (PCB Patron’s nominee) National Bank of Pakistan State Bank of Pakistan Sui Northern Gas Pipeline Limited (SNGPL) Sui Southern Gas Company (SSGC) President Larkana Region President Dera Murad Jamali Region President Bahawalpur Region President Hyderabad Region It is to remember that Zaka Ashraf is all set to take over the reins of Pakistan Cricket Board’s (PCB) stewardship before Eid-ul-Azha as Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari said on Wednesday that the government did not want to delay his appointment. Talking to media along with Zaka Ashraf the minister said that the PCB Election Commissioner would be looking after the affairs of the board till the election of the new PCB chief. “Every effort will be made to hold the elections before Eid. It is clear that Zaka Ashraf will be the new chairman of the board, following its elections,” he said. The Prime Minister Office on Tuesday in a notification said that the prime minister had nominated Zaka and Supreme Court advocate Mustafa Ramday as PCB’s Board of Governors (BoG).","pubDate":"2023-06-22 18:12:32","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-06-22/1687456211-9466.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB चीफ बनने से पहले ही अकड़ दिखा रहे थे जका अशरफ, 24 घंटे के भीतर लेना पड़ा यूटर्न","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pcb-future-chairman-zaka-ashraf-take-u-turn-said-will-go-with-acc-decision-on-hybrid-model/articleshow/101199363.cms","keywords":null,"creator":null,"video_url":null,"description":"Asia cup 2023: पाकिस्तान क्रिकेट बोर्ड के भावी अध्यक्ष जका अशरफ ने अपने उस बयान यूटर्न ले लिया है जिसमें उन्होंने कहा था कि वह एशिया कप के हाइब्रिड मॉडल के तहत मेजबानी को स्वीकार नहीं करेंगे। उन्होंने बयान देने के 24 घंटे के भीतर ही यूटर्न लिया है।","content":"पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के भावी अध्यक्ष जका अशरफ ने एशिया कप की मेजबानी पर यूटर्न ले लिया है। एशियाई क्रिकेट परिषद (एसीसी) की औपचारिक स्वीकृति के बावजूद जका एशिया कप के ‘हाइब्रिड मॉडल’ को ‘खारिज’ करने की बात कही थी लेकिन 24 घंटे से भीतर ही उन्होंने ‘यूटर्न’ लेते हुए चार मैचों की मेजबानी स्वीकार कर ली है। हाइब्रिड मॉडल के तहत एशिया कप की सह मेजबानी पाकिस्तान और श्रीलंका करेंगे। भारत अपने सभी मैच श्रीलंका में खेलेगा जिसमें चिर प्रतिद्वंद्वी पाकिस्तान के खिलाफ दो मैच भी शामिल हैं। यह मॉडल अशरफ के पूर्ववर्ती नजम सेठी ने पेश किया था। 27 जून को पीसीबी की कमान संभालने जा रहे अशरफ ने हालांकि प्रेस कांफ्रेंस में इसे खारिज कर दिया था। पता चला है कि अशरफ को नहीं पता था कि पीसीबी के मौजूदा प्रमुख सेठी पहले ही ‘हाइब्रिड मॉडल’ पर हस्ताक्षर कर चुके हैं और इसे भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव जय शाह की अध्यक्षता वाले एसीसी के कार्यकारी बोर्ड से स्वीकृति मिल चुकी है और इस फैसले को बदला नहीं जा सकता। अशरफ अगर बिना पूर्ण जानकारी से अड़ंगा डालने का प्रयास करते तो पीसीबी को सजा का सामना करना पड़ सकता था। ‘ईएसपीएनक्रिकइंफो’ ने अशरफ के हवाले से कहा, 'मेरी व्यक्तिगत राय में, यह पूरा हाइब्रिड मॉडल पाकिस्तान के लिए फायदेमंद नहीं है और मुझे यह पसंद नहीं आया।' उन्होंने कहा, 'एक मेजबान होने के नाते पाकिस्तान को यह सुनिश्चित करने के लिए बेहतर बातचीत करनी चाहिए थी कि पूरा टूर्नामेंट पाकिस्तान में खेला जाना चाहिए। श्रीलंका ने बड़े मैच ले लिए, पाकिस्तान के लिए केवल चार मैचों को छोड़ दिया, यह हमारे देश के सर्वोत्तम हित में नहीं है।' इसके बाद अशरफ ने स्वीकार किया कि उन्हें पूरी जानकारी नहीं थी और उन्होंने पूरी तरह से यूटर्न ले लिया। उन्होंने कहा, 'लेकिन मैं देख रहा हूं कि निर्णय लिया जा चुका है इसलिए हमें इसके साथ जाना होगा। मैं इसे नहीं रोकूंगा या फैसले का पालन नहीं करने का कोई इरादा नहीं है। मैं इसके बारे में प्रतिबद्धता का सम्मान करने के अलावा बहुत कुछ नहीं कर सकता। लेकिन भविष्य में हम जो निर्णय लेंगे वह देश के लिए और देश के हित में होगा।'","pubDate":"2023-06-22 17:57:57","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"‘If all the pitches are like that I’m done’: Anderson hints at retirement","link":"https://www.watoday.com.au/sport/cricket/if-all-the-pitches-are-like-that-i-m-done-anderson-hints-at-retirement-20230623-p5divj.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"England’s most successful bowler, Jimmy Anderson, suggests flat pitches like the one served up for the first Test in Edgbaston may drive him out of the game.","content":"The world’s most successful fast bowler, Jimmy Anderson, has hinted he may retire if the pitches in this Ashes series continue to be as flat as the one served up for the first Test at Edgbaston. “If all the pitches are like that I’m done in the Ashes series,” Anderson wrote in his column in London’s Daily Telegraph just days after he played almost no part in a dramatic Test, which Australia won by two wickets late on the fifth day. “That pitch was like kryptonite for me. There was not much swing, no reverse swing, no seam movement, no bounce and no pace,” wrote Anderson, who will be 41 next month. “I’ve tried over the years to hone my skills so I can bowl in any conditions but everything I tried made no difference. I felt like I was fighting an uphill battle.” With 686 wickets at an average of 26 in 180 Tests, Anderson sits behind only Muttiah Muralitharan (800) and Shane Warne (708) as the most successful bowler of all time. However, he claimed only one wicket in the first Ashes Test and was not used late in the game when Australia’s tail were completing an improbable run chase and England took the second new ball. There have been suggestions Anderson is still feeling the groin injury which kept him out of England’s Test against Ireland early this month, but an England team spokesman denied there were any fitness concerns. Anderson also defended fellow fast bowler Ollie Robinson for his abusive send-off of Usman Khawaja . Robinson’s celebration, after bowling Khawaja for 141 on Saturday, included him saying “f--- off, you f------ p---k”. Jimmy Anderson is the highest-ranked fast bowler on the all-time Test wicket list but his long career may be nearing its end. Credit: AP “Ollie did nothing wrong when he had his moment with Khawaja. In fact, I stood at mid-off for most of the game and didn’t hear anything said by either team that was unacceptable,” Anderson wrote. Khawaja also said he didn’t hear anything because the crowd noise was so loud when he was dismissed.","pubDate":"2023-06-22 22:30:32","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Joe Root wishes he’d led England like Ben Stokes does","link":"https://www.watoday.com.au/sport/cricket/joe-root-wishes-he-d-led-england-like-ben-stokes-does-20230622-p5diuf.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Joe Root has admitted he would like to go back in time and redo his Test captaincy tenure in the image of Bazball.","content":"Traditionally, a couple of Test match defeats in a row would send England’s cricketers and their mentors scurrying for different ideas and turning over players in search of a fix for the malady being written up in great detail by the British press. Yet in the aftermath of a two-wicket loss to Australia in an Ashes classic at Edgbaston, the regret of Joe Root, newly crowned as the world’s No.1 batter on the ICC rankings, was an entirely different one altogether. Joe Root tries to scoop Pat Cummins at Edgbaston. Credit: AP Root’s humility since handing over the captaincy to Ben Stokes has been one of the hallmarks of a successful transition. As he ruminated on the narrow two-wicket margin in Birmingham, Root spoke of how, given a time machine, he would have tried to lead exactly as Stokes and Brendon McCullum have done. “If I could go back in time I’d go back and start my captaincy tenure the way Ben has and try to play in a similar manner to how he does it,” Root said candidly after Edgbaston. “It’s far more exciting, far more interesting and I think we are getting more out of our team and our individuals. “We’re playing better cricket to watch, producing better results overall. If we are going to grow as a team we can’t just look at a day like this, with a couple of moments going against us, and say ‘we need to do things differently’. “If anything we need to double down on how we do it, completely back ourselves and make sure we get those one per centers right at Lord’s. We feel like we’ve ran the game for five days and we might be on the wrong end of it, but there’s still so much more to come in that dressing room. It’s a great spot to be in.” Captains, even if unsuccessful, tend to be fervently defensive of their chosen methods in the circumstances. But Root’s admission reflected the freedom he felt to give full rein to his own talents, as emphasised by the audacious decision to try to scoop Pat Cummins over the slips on the first ball of day four.","pubDate":"2023-06-22 20:30:09","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘It’s a bummer’: Perry falls agonisingly short of ton as Australia’s depth is tested","link":"https://www.watoday.com.au/sport/cricket/australia-s-depth-tested-by-england-on-ashes-opening-day-20230622-p5diue.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Ellyse Perry was out for 99 and Alyssa Healy had a third Test duck in a row as Australia’s depth was tested by the hosts in Nottingham on day one of the Test at Trent Bridge.","content":"Australia 7-328 (Perry 99, McGrath 61, Ecclestone 3-71) Nottingham: Australian cricket’s envious depth was on display at Trent Bridge as Alyssa Healy unveiled her first team as a Test captain . There was no room for Megan Schutt, Georgia Wareham or Grace Harris – all of whom would likely have played for England. But by the close of the day that depth had been sorely tested, as the hosts unveiled the decidedly sharpish Lauren Filer, a speedy counterpoint to the spin mastery of Sophie Ecclestone on a surface that offered swing, seam and spin in useful quantities. Ellyse Perry in batting action as wicketkeeper Amy Jones and Tammy Beaumont of England look on. Credit: Getty Images As is so often the case whenever Australia get to play a Test match, Ellyse Perry provided the spinal contribution, and like the similarly powerful Tahlia McGrath appeared set to grace Nottingham with a century. That neither McGrath (61) nor Perry (99) were able to get there was down to the combination of Ecclestone (3-71) and Filer (2-65), who each did enough with the Dukes ball to coax errors out of set batters. A 90-minute rain delay may also have served to freshen up a well-grassed pitch. “It’s a number, and one we talk about a lot in cricket,” Perry said of missing her century. Australia’s Alyssa Healy is bowled for a duck by England’s Sophie Ecclestone. Credit: PA via AP “But the whole experience out there today was so much fun. I love every opportunity. Sometimes things just go that way, it’s hard to be disappointed. “There’s just not really much to dwell on there. It’s like every time you get out, it’s a bummer. But the game goes on and life goes on for sure.”","pubDate":"2023-06-22 20:04:48","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka, Oman clash in crucial match","link":"https://www.dailymirror.lk/sports/Sri-Lanka--Oman-clash-in-crucial-match/322-261628","keywords":null,"creator":null,"video_url":null,"description":"Two unbeaten teams in Group B of the ICC Cricket World Cup Qualifiers Sri Lanka and Oman will clash in a crucial match scheduled to be played in Bulawayo, Zimbabwe tomorrow.","content":"ICC World Cup Qualifier Two unbeaten teams in Group B of the ICC Cricket World Cup Qualifiers Sri Lanka and Oman will clash in a crucial match scheduled to be played in Bulawayo, Zimbabwe tomorrow. Oman have been a surprise team at the tournament, exceeding expectations, having already beaten Ireland and UAE and will come into the game full of confidence to register what would be one of their biggest wins in their history. Sri Lanka on the other hand, deemed as one of the strongest of the ten team’s that are battling for the two slots for the forthcoming World Cup, will be facing a team that has pulled off a surprise and are in top form. Sri Lanka began their campaign in style with a massive 175 runs win over UAE with Kusal Mendis who made a top score of 78, Sadeera Samarawickrama (72), Pathum Nissanka (57), Dimuth Karunaratne (52) and an unbeaten 43 by Charith Asalanka which laid the foundation for the win. Spinner Wanindu Hasaranga did the finishing touches with impressive match figures of 6 for 24 which sealed the win for Sri Lanka. Oman too began their campaign with success defeating a Test playing side in Ireland against whom they prevailed with a comfortable five-wicket win a high scoring encounter. They followed it up with another win also by five wickets against UAE. They have four top batsmen in their ranks in Kashyap Prajapati, skipper Zeeshan Maqsood, Aqib Illyas, who so far made back to back half tons, Mohammad Nadeem and Shoaib Khan from whom they will be expecting for a repeat of their performances of the first two matches. But it’s left to be seen whether the Omanis would be able to come in terms with the Sri Lanka bowling which much more contrast than the two teams that they confronted and Sri Lanka no doubt will be favored carry on their winning trend which began against Afghanistan in their three-match series. (MSA)","pubDate":"2023-06-22 18:55:12","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_b134b556f3.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"\"जब भी मुझे सलाह की जरूरत होती है...\", विराट को लेकर पाकिस्तानी बल्लेबाज़ ने कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/ahmed-shahzad-on-virat-kohli-about-hi-batting-and-fitness-whenever-i-needed-advice-see-virat-kohli-4145010#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Ahmed Shahzad on Virat Kohli: एक बल्लेबाज के रूप में अपनी क्षमताओं के अलावा, कोहली ने भारत में एक फिटनेस का दौर शुरू किया है, जिसका पालन देश का हर उभरता हुआ क्रिकेटर करता है.","content":"Ahmed Shahzad on Virat Kohli भारत के स्टार बल्लेबाज विराट कोहली को उनके स्वभाव और उनकी काम के लिए विश्व स्तर पर सराहना मिलती है. एक बल्लेबाज के रूप में अपनी क्षमताओं के अलावा, कोहली ने भारत में एक फिटनेस का दौर शुरू किया है, जिसका पालन देश का हर उभरता हुआ क्रिकेटर करता है. हालांकि, उनका आकर्षण भारत तक ही सीमित नहीं है. पाकिस्तानी बल्लेबाज अहमद शहजाद, जिनकी तुलना अक्सर कोहली से की जाती है, भारत के पूर्व कप्तान के बहुत बड़े प्रशंसक हैं. शहजाद ने कोहली की जमकर तारीफ की और 34 वर्षीय खिलाड़ी को भारत की टेस्ट टीम की किस्मत बदलने का श्रेय दिया. शहजाद (Ahmed Shahzad on Virat Kohli) को भरोसा है कि बल्लेबाजी का महारथी फिर से उभरेगा, उनका कहना है कि कोहली का \"सर्वश्रेष्ठ आना अभी बाकी है\". \"हम एक-दूसरे के लिए परस्पर सम्मान साझा करते हैं. जब भी मुझे क्रिकेट के संबंध में किसी सलाह की आवश्यकता होती है, वह दयालु रहे हैं (मेरी मदद करने के लिए). एक खिलाड़ी के रूप में मैं वास्तव में उनका सम्मान करता हूं. उन्होंने खुद को नाटकीय रूप से बदल दिया है. जब वह इस दौरान सामने आए थे अंडर-19 विश्व कप में, वह थोड़ा मोटे थे, लेकिन जिस तरह से उन्होंने खुद को बदला है, केवल क्रिकेट के पहलू से, वह सराहनीय है. वह भारत को टेस्ट क्रिकेट में नई ऊंचाइयों पर ले गए. मैंने ऐसा कोई नहीं देखा जिसने ऐसा किया हो. मुझे लगता है, उनका सर्वश्रेष्ठ आना अभी बाकी है,'' शहजाद ने नादिर अली के पॉडकास्ट पर कहा. भारतीय टेस्ट कप्तान के रूप में अपने कार्यकाल के दौरान, कोहली ने टीम को अंतर्राष्ट्रीय क्रिकेट परिषद (आईसीसी) की विश्व रैंकिंग में शीर्ष पर पहुंचाया और ऑस्ट्रेलिया में एक श्रृंखला भी जीती. उन्होंने जून 2021 में लॉर्ड्स में आईसीसी विश्व टेस्ट चैंपियनशिप फाइनल के फाइनल में भी टीम का नेतृत्व किया, जहां वे केन विलियमसन की अगुवाई वाली न्यूजीलैंड से हार गए. जहां तक शहजाद की बात है, उन्हें आखिरी बार पाकिस्तानी टीम के लिए खेलने का मौका मिले काफी समय हो गया है. साल 2019 में राष्ट्रीय टीम के लिए प्रदर्शन किया. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-06-22 18:40:58","image_url":"https://c.ndtvimg.com/2022-10/23kd7v_virat-kohli-afp-_650x400_24_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ellyse Perry misses out on 3rd Test hundred, Australia reach 328/7 at stumps on Day 1","link":"https://www.indiatoday.in/sports/cricket/story/womens-ashes-day-1-ellyse-perry-misses-out-on-3rd-test-hundred-australia-reach-3287-at-stumps-2396679-2023-06-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ellyse Perry misses out on 3rd Test hundred, Australia reach 328/7 at stumps on Day 1","content":": Ellyse Perry fell just short of scoring her third Test century as England fought back against Australia on the first day of the Ashes Test at Trent Bridge on Thursday. Australia reached 328/7, with Annabel Sutherland unbeaten on 39 and Alana King on seven. The match saw a momentum swing between the two teams after Australia chose to bat first. Australia had a strong start and were cruising at 215/3 close to tea when rain interrupted the game. After the resumption, England's Sophie Ecclestone and debutant Lauren Filer took three quick wickets, including the dismissals of Healy for a duck and . However, Ashleigh Gardner and Annabel Sutherland managed to regain some momentum for Australia, taking the team past the 300-run mark before stumps. A fine catch to end a fine knock! Ellyse Perry is out for 99 — cricket.com.au (@cricketcomau) Ecclestone showcased her skills as the world's premier spinner, bowling 31 overs and ending the day with figures of 3-71. Filer, who was a surprise inclusion in England's Test squad, troubled the Australian batters with her pace and bounce, taking two important wickets, including that of Beth Mooney for 33 and denying Perry her century. Promoted to No.3 for this Test, Perry made her intentions clear from the start, dispatching Ecclestone's first ball to the boundary. She formed a crucial partnership with Tahlia McGrath, helping Australia gain an advantage in the middle session. McGrath played some excellent shots and reached her second Test fifty off just 67 deliveries. However, Ecclestone spun one past McGrath's defenses, dismissing her for a career-best 61 and ending their partnership of 119 runs. Meanwhile, Perry continued to dominate against the red-ball, punishing loose deliveries and handling Ecclestone's challenges. Her innings was interrupted by rain when she was on 82 and Australia was at 213/3. After the rain delay, Ecclestone struck twice in an over, dismissing Jess Jonassen for 11 and bowling Healy for a duck. England fought their way back into the game, reducing Australia to 226/5. Earlier in the day, Healy won the toss and chose to bat, a decision that pleased both captains as England's Heather Knight revealed she would have made the same choice. Debutant Phoebe Litchfield looked comfortable at the top of the order but was given out lbw on 23. Mooney, who had a few lucky escapes, eventually edged Filer to gully, leaving Australia at 83/2. The Ashes Test marks the beginning of the multi-format series, with four points available for this match and two points for each of the three ODIs and three T20s. Australia have held the Ashes since 2015.","pubDate":"2023-06-22 18:29:48","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Bazball must stay. Losing still hurts, but at least this isn’t cricket to do admin to","link":"https://metro.co.uk/2023/06/22/bazball-must-stay-losing-hurts-but-this-isnt-cricket-to-do-admin-to-18999049/","keywords":["Cricket","Sport","Australia cricket","Ben Stokes","Brendon McCullum","England cricket","Metro newspaper","The Ashes"],"creator":["Kate Mason"],"video_url":null,"description":"Whoever you are – a former Test captain, a paying guest or a social-media vibe – this England team cannot care.","content":"I back the declaration and you should, too. Here’s Ben Stokes, the England captain who called his batters in on 393 for eight on day one of the first Test: ‘I am not a captain who gets by on what ifs. We saw it as an opportunity to pounce on Australia and really start day two on top.’ Also: ‘I am not going to change the way I have gone about my cricket because it is the Ashes.’ England had Joe Root out there looking fierce on 118, but Stokes chose to put Australia in to bat after 78 overs. His was the earliest declaration in Ashes history. And, lest we forget, the Ashes have been being played since 1882. Anyone with a passing interest will know by now the England Test team of today play a piratical version of cricket known as Bazball. For everybody else, it is very simply put an aggressive style with a positive mental attitude deployed in the sport’s most traditional format. If you don’t know what Test cricket is, it’s the one played in whites between two countries lasting five whole days yet still often ending in a draw. Baz is Brendon McCullum to you and me, England men’s head coach in the longest form of cricket. He took over 13 months ago, two weeks after Stokes was appointed captain. Baz doesn’t like the term. It lacks nuance. Sounds like short form hit-and-hope cricket smuggled into the noble five-day fete with which you are about to become obsessed. Why is it not Benball? After all the captain’s little wrinkled frown when considering his options is what comes to mind when reflecting on the 11 wins from 14 since England’s Test shake-up last summer. His powerful on-field decision-making and extraordinary all-round talent makes Stokes a more than worthy totem. Perhaps it’s because it sounds like an expensive pen rebrand. Either way, Bazball it is. And whatever you call it, it is beautiful. To sustain that level of intrigue over a contest the length of a working week, peppered with irritating midlands rain flurries and blistery fingers, and to do it each time out: that’s something new. How Titan five could be rescued in four terrifying steps TikTok prankster Mizzy flouts court order and sneaks into another home Titanic billionaire's stepson defends bizarre move: 'What am I supposed to do?' Back to the Stokes’ declaration. It was taken in independence from whatever you think. Whoever you are – a former Test captain, a paying guest or a social-media vibe – this England team cannot care. That’s not pig-headed belligerence, that’s a hard-won decision from a man who took a mental-health break from cricket in 2021 to come back into the sport on his own terms, when ready. So, England could have had 40 more runs in the first innings, or Jonny Bairstow could make a few catches, or Stuart Broad could have bowled a legal ball to Usman Khawaja, or Stokes could have held onto that improbable chance with Australia 37 runs short. Or England could have batted 170 first-innings overs and supplied us with a drizzly draw, and the kind of cricket you can do admin to. Instead we got this. Against the world champion Test side. A two-wicket loss, with all kinds of imponderables. As Stokes pointed out afterwards, ‘losing sucks’. If this England team go on to be whitewashed in this Ashes series, well, let’s have a rethink. But when he says ‘we’re not a results-driven team’ he means it. Losing hurts, but it can’t retrospectively inform the thinking. He and his Brett Lee-scarred head coach, owner of the fastest-ever Test hundred, will – contrary to Michael Vaughan’s theory – do the same again if the opportunity arises again at Lord’s. And I will love it. But, God, the 40 runs might have come in useful, mightn’t they? MORE : ‘We spoke and we are all good’ – Ollie Robinson has ‘learned his lesson’ after Usman Khawaja Ashes send-off MORE : After the revolution must come evolution if macho England are to win back the Ashes","pubDate":"2023-06-22 18:24:52","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘That’s heartbreaking’: Ellyse Perry falls agonisingly short of century in Trent Bridge Ashes Test","link":"https://www.foxsports.com.au/cricket/the-ashes/thats-heartbreaking-ellyse-perry-falls-agonisingly-short-of-century-on-day-one-of-ashes-test-at-trent-bridge/news-story/4cad21532e7e996c12953ba7d7cb9c4e","keywords":null,"creator":null,"video_url":null,"description":"Ellyse Perry has fallen agonisingly short of scoring her third Test century, dismissed for 99 on day one of the women’s Ashes Test against England at Trent Bridge.","content":null,"pubDate":"2023-06-22 18:17:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"PCB BOG's constituted; date for chairman’s election revised","link":"https://en.dailypakistan.com.pk/22-Jun-2023/pcb-bog-s-constituted-date-for-chairman-s-election-revised","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE — Following announcement that 28 June will be a holiday, the Election Commissioner has confirmed the PCB Chairman’s elections will be held at the Gaddafi Stadium in Lahore on Tuesday, 27th June.","content":"LAHORE — Following announcement that 28 June will be a holiday, the Election Commissioner has confirmed the PCB Chairman’s elections will be held at the Gaddafi Stadium in Lahore on Tuesday, 27th June. The election calendar will be made public when the departments and service organisations have filed their nominees. The Election Commission office has contacted departments and service organisations to nominate representatives. PCB is in receipt of letter and notification dated 20 June from the Inter-Provincial Coordination (IPC) Ministry that states: “On completion of the tenure, the Management Committee of PCB stands dissolved, ceases to operate”. Accordingly, the Election Commissioner, Mr Ahmed Shehzad Farooq Rana, who is also the Acting Chair of the PCB, has constituted the PCB Board of Governors in accordance with Para 10 of the PCB Constitution 2014 and in line with and pursuant to the above referred letter and notification. The formation of the PCB BOG now stands as follows: Mr Muhammad Zaka Ashraf (PCB Patron’s nominee) Mr Mustafa Ramday (PCB Patron’s nominee) National Bank of Pakistan State Bank of Pakistan Sui Northern Gas Pipeline Limited (SNGPL) Sui Southern Gas Company (SSGC) President Larkana Region President Dera Murad Jamali Region President Bahawalpur Region President Hyderabad Region It is to remember that Zaka Ashraf is all set to take over the reins of Pakistan Cricket Board’s (PCB) stewardship before Eid-ul-Azha as Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari said on Wednesday that the government did not want to delay his appointment. Talking to media along with Zaka Ashraf the minister said that the PCB Election Commissioner would be looking after the affairs of the board till the election of the new PCB chief. “Every effort will be made to hold the elections before Eid. It is clear that Zaka Ashraf will be the new chairman of the board, following its elections,” he said. The Prime Minister Office on Tuesday in a notification said that the prime minister had nominated Zaka and Supreme Court advocate Mustafa Ramday as PCB’s Board of Governors (BoG).","pubDate":"2023-06-22 18:12:32","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-06-22/1687456211-9466.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB चीफ बनने से पहले ही अकड़ दिखा रहे थे जका अशरफ, 24 घंटे के भीतर लेना पड़ा यूटर्न","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pcb-future-chairman-zaka-ashraf-take-u-turn-said-will-go-with-acc-decision-on-hybrid-model/articleshow/101199363.cms","keywords":null,"creator":null,"video_url":null,"description":"Asia cup 2023: पाकिस्तान क्रिकेट बोर्ड के भावी अध्यक्ष जका अशरफ ने अपने उस बयान यूटर्न ले लिया है जिसमें उन्होंने कहा था कि वह एशिया कप के हाइब्रिड मॉडल के तहत मेजबानी को स्वीकार नहीं करेंगे। उन्होंने बयान देने के 24 घंटे के भीतर ही यूटर्न लिया है।","content":"पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के भावी अध्यक्ष जका अशरफ ने एशिया कप की मेजबानी पर यूटर्न ले लिया है। एशियाई क्रिकेट परिषद (एसीसी) की औपचारिक स्वीकृति के बावजूद जका एशिया कप के ‘हाइब्रिड मॉडल’ को ‘खारिज’ करने की बात कही थी लेकिन 24 घंटे से भीतर ही उन्होंने ‘यूटर्न’ लेते हुए चार मैचों की मेजबानी स्वीकार कर ली है। हाइब्रिड मॉडल के तहत एशिया कप की सह मेजबानी पाकिस्तान और श्रीलंका करेंगे। भारत अपने सभी मैच श्रीलंका में खेलेगा जिसमें चिर प्रतिद्वंद्वी पाकिस्तान के खिलाफ दो मैच भी शामिल हैं। यह मॉडल अशरफ के पूर्ववर्ती नजम सेठी ने पेश किया था। 27 जून को पीसीबी की कमान संभालने जा रहे अशरफ ने हालांकि प्रेस कांफ्रेंस में इसे खारिज कर दिया था। पता चला है कि अशरफ को नहीं पता था कि पीसीबी के मौजूदा प्रमुख सेठी पहले ही ‘हाइब्रिड मॉडल’ पर हस्ताक्षर कर चुके हैं और इसे भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव जय शाह की अध्यक्षता वाले एसीसी के कार्यकारी बोर्ड से स्वीकृति मिल चुकी है और इस फैसले को बदला नहीं जा सकता। अशरफ अगर बिना पूर्ण जानकारी से अड़ंगा डालने का प्रयास करते तो पीसीबी को सजा का सामना करना पड़ सकता था। ‘ईएसपीएनक्रिकइंफो’ ने अशरफ के हवाले से कहा, 'मेरी व्यक्तिगत राय में, यह पूरा हाइब्रिड मॉडल पाकिस्तान के लिए फायदेमंद नहीं है और मुझे यह पसंद नहीं आया।' उन्होंने कहा, 'एक मेजबान होने के नाते पाकिस्तान को यह सुनिश्चित करने के लिए बेहतर बातचीत करनी चाहिए थी कि पूरा टूर्नामेंट पाकिस्तान में खेला जाना चाहिए। श्रीलंका ने बड़े मैच ले लिए, पाकिस्तान के लिए केवल चार मैचों को छोड़ दिया, यह हमारे देश के सर्वोत्तम हित में नहीं है।' इसके बाद अशरफ ने स्वीकार किया कि उन्हें पूरी जानकारी नहीं थी और उन्होंने पूरी तरह से यूटर्न ले लिया। उन्होंने कहा, 'लेकिन मैं देख रहा हूं कि निर्णय लिया जा चुका है इसलिए हमें इसके साथ जाना होगा। मैं इसे नहीं रोकूंगा या फैसले का पालन नहीं करने का कोई इरादा नहीं है। मैं इसके बारे में प्रतिबद्धता का सम्मान करने के अलावा बहुत कुछ नहीं कर सकता। लेकिन भविष्य में हम जो निर्णय लेंगे वह देश के लिए और देश के हित में होगा।'","pubDate":"2023-06-22 17:57:57","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}