{"newsArray":[{"title":"T20 match between India Women and South Africa Women called off due to heavy rain","link":"https://sportstar.thehindu.com/cricket/womens-cricket/india-women-vs-south-africa-women-t20-match-called-off-due-to-heavy-rain-tri-series-final-february-2/article66444798.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"The T20 international between India Women and South Africa women was called off due to heavy rain, with only two overs having been played.","content":"The T20 international between India Women and South Africa women was called off due to heavy rain, with only two overs having been played. India won the toss and elected to bat first, as Smriti Mandhana and Jemimah Rodrigues came out to open the innings. However, the sky opened up after just two overs, and play was suspended with the Women in Blue at a score of 4-0. Having lost to India in the tri-series opener, South Africa was looking to even the score with India ahead of a repeat clash in the final. India will play South Africa in the final of the tri-series tournament on February 2. Read more stories on Women's Cricket.","pubDate":"2023-01-28 20:18:54","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"India-W vs South Africa-W highlights, Tri-Series: Match called off due to heavy rain; Both teams to play final on February 2","link":"https://sportstar.thehindu.com/cricket/womens-cricket/india-women-vs-south-africa-women-live-score-5th-t20-game-tri-series-updates-highlights/article66443358.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Highlights from the India vs South Africa women’s T20 tri-series match.","content":"Welcome to Sportstar’s highlights of the India vs South Africa women’s T20 tri-series match. The match was called off due to heavy rain. Team news for the match South Africa and India have made a change each. Shabnim Ismail replaces Masabata Klaas for the hosts. India brings back Pooja Vastrakar in place of Amanjot Kaur. Match Preview A more fearless approach will be expected from India’s top-order when it meets South Africa in Saturday’s dress rehearsal for the women’s tri-series final. West Indies losing its first three games has ensured an India-South Africa final on February 2. It if wasn’t for the experienced duo of Smriti Mandhana and captain Harmanpreet Kaur, India would have struggled to post a competitive total against the West Indies in its previous league fixture. While they both are expected to perform consistently for the team, the captain will be expecting stand-out performances from the younger lot. Opening the innings in the absence of Shafali Verma, Yastika Bhatia has not been able to attack the bowlers in the powerplay. With due respect to South Africa and West India, a similar batting approach can prove costly against tougher opponents like Australia and England in the upcoming World Cup. In the absence of Richa Ghosh, who is also on India U-19 duty with Shafali, the team needs to find another power hitter in the middle-order. Rookie Amanjot Kaur was impressive on her debut and would be itching to use the long handle again. Jemimah Rodrigues’ wretched run has continued since the home series against Australia and she needs to find runs ahead of the ICC event next month. The game will also provide another opportunity for Harleen Deol to make an impact after two failures. All-rounder Pooja Vastrakar is yet to get a game considering her fitness but she might play on Saturday. Shikha Pandey, who made a surprise return to the national team, will be expected to provide early breakthroughs after going wicketless in her comeback game. Having lost to India in the tri-series opener, South Africa will be looking to make amends ahead of a repeat clash in the final. The host hammered West Indies by 10 wickets to seal its place in the title clash. Match starts at 10:30 PM. -PTI Where to watch IND-W vs SA-W tri-series match live on TV in India? The tri-series match between India Women and South Africa Women will be aired LIVE on the Star Sports Network. Where to watch IND-W vs SA-W tri-series match live online in India? The tri-series match between India Women and South Africa Women will be streamed LIVE on Disney+Hotstar app. At what time will IND-W vs SA-W tri-series match start in India? The tri-series match between India Women and South Africa Women will begin at 10:30 PM IST. When will IND-W vs SA-W tri-series match be played? The tri-series match between India Women and South Africa Women will be held on Saturday, January 28. Read more stories on Women's Cricket.","pubDate":"2023-01-28 19:59:28","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"For ‘senior’ Shafali, another World Cup opportunity","link":"https://indianexpress.com/article/sports/cricket/for-senior-shafali-another-world-cup-opportunity-8410126/","keywords":["Cricket","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":"At 16, Shafali Verma was India’s highest run scorer in her first senior T20 World Cup in 2020. Seven months earlier, she had become the youngest to feature in a T20 International at the age of 15. And so when she was caught behind by Alyssa Healy, in the third ball of an unsuccessful chase, while trying to go for a boundary, it was just seen as an off day for one of the most promising young cricketers. Cut to three years later, watching her lead India in the maiden U19 Women’s T20 World Cup final shouldn’t come as a surprise. However, the journey since the 2020 World Cup hasn’t been as smooth as many believed it would be for Shafali. Sunday presents an opportunity for Shafali to create happy memories of an ICC event. With over 2,000 runs in 74 games, Shafali has had a mixed run with the senior side. In T20Is, the format she has most featured in, the explosive opener scored 487 runs in her first 19 matches at a strike rate above 146 up until the 2020 final in Melbourne. In the next 32 outings, the strike rate dropped to 127.83. In the ODIs, while she averages a tad better than the shorterest format, she was dropped for three consecutive games at the World Cup last year. When India and England clash in the #U19T20WorldCup final tomorrow, there will be 🎆 Who are you backing❓ pic.twitter.com/4TDZsQjZZJ — T20 World Cup (@T20WorldCup) January 28, 2023 At the Under-19 World Cup, as the most experienced player in the side, she has had to guide the team. “Yes, I’ve played a lot of finals and seen it all,” Shafali, who turned 19 on Saturday, said on the eve of the final. “It’s about going out there and enjoying the game. I’ve told the teammates ‘don’t stress, just give your 100 percent without thinking of it as the final. Just believe in yourself. It’s all past and that cannot be recreated. We are determined to bring the World Cup this time and are trying to improve day by day,” she added. India suffered one defeat in the Super Six league stage where they lost to Australia after being bowled out for 87. Advertisement “We had nervous moments and couldn’t sleep, thinking about whether we could make the final or not… But we have learnt from the mistakes and here we are. Now we’re all very confident, clear of our roles. Everyone is enjoying each other’s company and staying normal, we are not thinking much.I may be senior to many of them but I’ve told them ‘on the ground we all are equal’ it’s about keeping everyone comfortable,” Shafali said. In the semifinal, India registered an eight-wicket win after their bowlers restricted the New Zealanders to an under-par 107/9. India will be up against a strong England side that topped its Super Six group by winning all the four matches. They suffered a batting debacle in the semifinal against Australia when they were bowled out for 99 in 19.5 overs. But their bowling attack fought back to keep Australia to 96 in 18.4 overs. “We are determined to bring the World Cup this time” 💬 Shafali Verma is in high spirits ahead of the mouthwatering final clash at the Women’s #U19T20WorldCup 🤩https://t.co/TDGoKKsUAO — T20 World Cup (@T20WorldCup) January 28, 2023 Aggressive England Advertisement Positive intent has been a keyword for English cricket of late. From Eoin Morgan’s white ball revolution to Brendon McCullum ’s Bazball philosophy in Test cricket. It had rubbed off on the Under-19 side too. “We set out as a group and as a coaching staff for the U19s to play with a positive mindset,” captain Grace Scrivens had told Sky Sports. “That might have been influenced by people higher up, but we were all keen on buying into the positive intent and mindset that we have shown.” On the eve of the final, the England skipper spoke about the positives. “It was unbelievable to be a part of it (final). It’s about resetting and going to the next game. We want to play with a positive mindset, and play fearless cricket. I’m sure yesterday’s collapse will not affect us,” Grace said. Teams: (India): Shafali Verma, Shweta Sehrawat, Gongadi Trisha, Soumya Tiwari, Sonia Mehdiya, Richa Ghosh, Hrishita Basu, Titas Sadhu, Mannat Kashyap, Parshavi Chopra, Sonam Yadav, Shabnam, Falak Naz and Yashasri Soppadhandhi (England): Grace Scrivens, Ellie Anderson, Hannah Bakers, Josie Groves, Liberty Heap, Niamh Holland, Ryana MacDonald-Gay, Emma Marlov, Charis Pavley, Davina Perrin, Lizzie Scott, Seren Smale, Sophia Smale, Alexa Stonehouse and Maddie Ward. Subscriber Only Stories View All The K Arun Prakash Interview: ‘My style is to highlight the composition a... At international checkpoint, online system helps vehicles cross over sea... Experts say Adani Group stock sell-off may not affect market, but deepens... Delhi Confidential: Lok Sabha Speaker wants MPs to learn lessons from Pad... Apply New Year promo code SD25 U19 Women’s T20 World Cup final, Live on FanCode, Star Sports Network, 5:15 pm","pubDate":"2023-01-28 19:17:37","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Roy proud of battling back for England","link":"https://www.perthnow.com.au/sport/cricket/roy-proud-of-battling-back-for-england-c-9587377","keywords":null,"creator":["David Charlesworth"],"video_url":null,"description":"Star batter Jason Roy says he's proud to have battled through self-doubt to return to England's international ranks with a century.","content":"Jason Roy has spoken of his pride at battling through self-doubt to end his prolonged run-scoring drought with a trademark belligerent century for England. Roy has for long been England's pacesetter at the top of the order and often instrumental in their successes, none greater than when he returned from injury to inspire the side to 2019 World Cup glory. But after excelling in last winter's Pakistan Super League, his form nosedived in the English summer, both internationally and domestically, to the extent he was omitted from England's T20 World Cup squad. Roy then lost his central contract and was downgraded to an incremental deal while his figures in this month's SA20 painted a bleak picture as he averaged just 12.5 for Paarl Royals in eight innings. He felt he had turned a corner after some frank conversations with Jos Buttler and rewarded the England captain's faith by peeling off 113 from 91 balls in a 27-run defeat by South Africa in the first ODI on Friday. \"It was like an avalanche of s*** things happening over and over again,\" said Roy. \"You start doubting yourself as a player, thinking people have forgotten about you even though you've played a huge amount of cricket, start doubting yourself as a guy, becoming reserved, which is just not me. \"Mentally overcoming a lot of doubts and thoughts that I had in my head towards the latter part of last year, that's probably the proudest I've been of myself. \"I've gone out there and just enjoyed myself, tried to impose myself which I don't think I've done over a period of time so it was a nice feeling to go out there and just be myself: chew on some gum, give it the full bravado, say a few things to the opposition, get in the fight a bit and it was a very proud moment. \"I'm never a guy who's going to roll over. That's why, after the year I had, not pushing myself as much as I should have, it's good to see that I've still got a bit of fight.\" Being left out of England's T20 World Cup winning campaign last autumn was a \"huge hammer blow\" for Roy, who credited the support of his wife Elle for keeping him \"level-headed\" through low moments. Roy has worked with Surrey psychologist Dr Andrea Furst and his Bloemfontein innings came a day after England great Kevin Pietersen had a pep talk with the squad at Mangaung Oval. \"We spoke about being free, not worrying about the outcome, just playing my game,\" Roy said. \"The big thing for me the night before was to go out on my own terms. \"How do I want to be remembered? As a guy who had a great career, smacked it everywhere, then all of a sudden a completely different player? \"Or as a guy who went out there and attacked the bowlers? Fair enough if I got out, but I got out on my terms. That has helped my psyche.\"","pubDate":"2023-01-28 18:40:35","image_url":"https://images.perthnow.com.au/publication/C-9587377/1a0e0e7ad85a4cc2d73499cab37aae8aa5323c2f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Gujarat Giants appoint Mithali Raj as mentor ahead of inaugural Women’s Premier League","link":"https://thenewsmill.com/2023/01/gujarat-giants-appoint-mithali-raj-as-mentor-ahead-of-inaugural-womens-premier-league/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Gujarat Giants has appointed legendary Indian batter and former captain Mithali Raj as the mentor and advisor for the side ahead of the inaugural edition of the Women’s Premier League (WPL), which will take place in March-April 2023. Over the years, Mithali’s trailblazing achievements and contributions to Indian cricket have not only earned her numerous awards and accolades but have also played a key role in bringing women’s cricket into the limelight, both on national and international platforms. As a mentor and advisor, Mithali will also promote women’s cricket and help develop the sport at the grassroots level in Gujarat. “The inaugural season of the Women’s Premier League is a fantastic move for women’s cricket and the involvement of the Adani Group is a massive boost for the sport as well,” said Mithali Raj, ex-Skipper of the Indian Women’s National Cricket Team as quoted by an Adani Sportsline. “Women’s cricket is growing steadily, and this kind of impetus will undoubtedly encourage young women to consider taking up cricket professionally. I believe that the high-impact participation of corporates will help hasten the process of eventually bringing more glory to India. This level of influence can help strengthen the sporting ecosystem and enhance opportunities for women athletes”. “Mithali Raj is a role model for the young generation and we are delighted to have such an inspirational athlete on board to mentor our women’s cricket team,” said Pranav Adani, Director of Adani Enterprises. “This is the first time the Adani Group has ventured into women’s cricket, and we are privileged to be able to promote women in sports through the inaugural Women’s Premier League. We believe that the presence of international sporting heroes like Mithali will attract new talent not just into cricket but also into every other sport and transform the professional sports ecosystem,” added Pranav. Acknowledged as one of the greatest female cricketers of all time, Mithali Raj opened her ODI career with a rare accomplishment – a century on debut. Mithali is the highest run-scorer in women’s ODIs and has scored 17 half-centuries in her T20Is. In 89 T20Is, Raj has also scored 2,364 runs at an average of 37.52, with the best score of 97. But Mithali’s best format was ODIs, in which she played 232 matches and scored 7,805 runs in 211 innings at an average of 50.68. She had seven tons and 64 fifties in the format, with best score of 125*. The highly acclaimed cricketer captained India in the 2017 Women’s ODI Cricket World Cup, where India finished runners-up. She was also part of the Indian team that made it to the semi-finals of the 2018 ICC Women’s World T20, held in the West Indies. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 18:31:30","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Ahoy Senor holds on to hand Lucinda Russell emotional Cotswold Chase win","link":"https://www.theguardian.com/sport/2023/jan/28/editeur-du-gite-edges-edwardstone-thrilling-clarence-house-chase","keywords":["Horse racing","Horse racing tips","Cheltenham","Sport"],"creator":["Greg Wood at Cheltenham"],"video_url":null,"description":"Trainer’s father Peter died this week – ‘He’d be very proud today’Editeur Du Gite surges to thrilling win in Clarence House ChaseThe “Trials Day” label on the last card at Cheltenham before the Festival might suggest it is little more than an appetiser ahead of the main event. For the connections of the big chase winners here on Saturday, however, it was a day of real significance and, for trainer Lucinda Russell, an emotional afternoon too.Russell’s father, Peter, who died this week at 95, was a co-owner of Ahoy Senor, the winner of the Grade Two Cotswold Chase, and also played a big part in launching his daughter’s training career. “He loved this horse and really wanted him to do well,” she said. “It was Dad that set me up and gave me the desire and determination. He’d be very proud today. Continue reading...","content":"The “Trials Day” label on the last card at Cheltenham before the Festival might suggest it is little more than an appetiser ahead of the main event. For the connections of the big chase winners here on Saturday, however, it was a day of real significance and, for trainer Lucinda Russell, an emotional afternoon too. Russell’s father, Peter, who died this week at 95, was a co-owner of Ahoy Senor, the winner of the Grade Two Cotswold Chase, and also played a big part in launching his daughter’s training career. “He loved this horse and really wanted him to do well,” she said. “It was Dad that set me up and gave me the desire and determination. He’d be very proud today. Talking Horses: Fugitif can steal big prize on Cheltenham Trials day Read more “As he went on in his life, the racing meant a lot to him and he would always phone me before and after the races. I’ll miss that intensely.” Ahoy Senor was a leading novice over fences last season, rounding off his campaign with a Grade One win at Aintree in April, but was also prone to losing his confidence after a mistake, particularly in the latter stages of races. That continued in his first three starts this term, but he was far more assured this time, overcoming a slight error at the last to battle to a one-and-a-half length defeat of Sounds Russian with the market leaders, Protektorat and Noble Yeats, the 2022 Grand National winner, fourth and third respectively. “He’s always been good, but he just had to learn about it and I think he came of age today,” Russell said, while her partner, the former champion jockey, Peter Scudamore, reached for a cricketing analogy. “I’ve said he’s the best horse we’ve ever trained,” Scudamore said. “Then you begin to doubt yourself, but things eventually come right in the end and that’s what sport is about. When he gets it right, he is like Ian Botham, when he gets it wrong, he can be back in the pavilion for 10.” Ahoy Senor was cut to around 12-1 for the Gold Cup in March while Noble Yeats, who would be the first horse to win the Grand National and Gold Cup in that order, is 8-1 for the Festival’s showpiece having stayed on well in the closing stages, over a trip a furlong shorter than the Gold Cup. It proved to be a significant afternoon for Niall Houlihan, a conditional rider at Gary Moore’s Sussex stable, as he recorded the first Grade One success of his career aboard Editeur Du Gite in the Clarence House Chase, which was added to the card after Ascot’s meeting last Saturday succumbed to the weather. Editeur Du Gite was not among the declarations for the race seven days ago, but Moore felt it was worth paying £2,250 to add him to a field that included Energumene and Edwardstone, the winners of last season’s Champion Chase and Arkle Trophy respectively. His gamble was richly rewarded as the 14-1 shot responded strongly to Houlihan’s urging and edged past Edwardstone in the final strides, after being passed on the run-in. Energumene, the 4-9 favourite, was third, with Willie Mullins, his trainer, suggesting the new white marker boards on the fences may have unsettled his runner. “It is unreal really,” Houlihan said. “The horse tries so hard for you. Every time a horse came to me, he stuck his neck out, especially when he got headed after the last. It is brilliant that they put the faith in me on a horse like him and to pull it off is great.” Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. Quick Guide Greg Wood's Sunday tips Show Sedgefield 12.50 Aubis Walk 1.25 Twoshotsoftequila (nb) 2.00 Ashington 2.35 Nero Rock 3.10 Basford 3.45 Skyhill 4.20 Silkstone Fontwell 1.05 Firestream 1.40 Unit Sixtyfour 2.15 Concrete King (nap) 2.50 Coolvalla 3.25 Our Champ 4.00 Art Decco 4.35 Film D’Action Southwell 1.15 Get Prepared 1.50 Monte Igueldo 2.25 Doc McCoy 3.00 Strong Leader 3.35 Richhill 4.10 Shallow River Was this helpful? Thank you for your feedback. Editeur Du Gite is top-priced at 13-2 for the Champion Chase on 15 March, behind Energumene and Edwardstone at 3-1 and Blue Lord, on 9-2. Gold Tweet (14-1) was another surprise winner in the Grade Two Cleeve Hurdle, but there was little sign of fluke as he went clear of Dashel Drasher and Paisley Park, a former Stayers’ Hurdle winner, to become the first French-trained winner on Trials day for 18 years. Gabriel Leenders, his trainer, will now consider a supplementary entry for the Stayers’ Hurdle in March. “It’s expensive and we are not rich,” he said, “but it would be a dream to come here in March.”","pubDate":"2023-01-28 18:17:06","image_url":"https://i.guim.co.uk/img/media/410b18ffbceeb1a9887fae4b707a9044f02e2652/0_202_4896_2938/master/4896.jpg?width=460&quality=85&auto=format&fit=max&s=6143f9a9a2ec0a5f02bea39acfec8b4f","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Marizanne Kapp on significance of winning tri-series battles against India: “You want that bit of momentum when you go into a T20 World Cup”","link":"https://www.sportskeeda.com/cricket/news-marizanne-kapp-significance-winning-tri-series-battles-india-you-want-bit-momentum-go-t20-world-cup?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Seasoned South African all-rounder Marizanne Kapp has stated that winning the upcoming matches against India in the ongoing Women’s T20I Tri-Series in East London will be a ‘major boost’ for her team, keeping the T20 World Cup 2023 in mind. South Africa will take on India in the fifth match of the tri-series at Buffalo Park in East London on Saturday, January 28. With West Indies being knocked out of the tournament, the same two teams will once again meet in the final on February 2. Sharing her views on the importance of South Africa ’s upcoming battles against India, Kapp said ahead of Saturday’s match: South Africa went down to India by 27 runs in the tri-series opener. The Indians came up with a terrific bowling performance to restrict South Africa to 120/9, defending a total of 147. In subsequent matches, South Africa have got the better of West Indies by 44 runs and 10 wickets respectively. Reflecting on the challenge of facing India for the second time, Kapp admitted that facing spin bowling is not easy given the surfaces on offer. She explained: India stifled South Africa with spin when the two teams met in the first match of the tri-series. Deepti Sharma claimed 3/30, Devika Vaidya 2/19, while Rajeshwari Gayakwad, Sneh Rana and Radha Yadav claimed one scalp each. Speaking of her individual performances, Kapp has scored 22 and 52, apart from claiming one wicket. South Africa will depend on her to deliver with both bat and ball against India. The confident 33-year-old stated: Kapp has played 87 T20Is for South Africa, scoring 1120 runs. She has also claimed 67 wickets with her medium pace. Get IND vs NZ Live Cricket Score , 1st T20 at Sportskeeda. Follow us for the latest cricket Updates. Poll : 0 votes Quick Links","pubDate":"2023-01-28 17:54:43","image_url":"https://static.sportskeeda.com/editor/2023/01/c4759-16749088068151-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Neeraj Chopra meets U-19 India women’s team before their final against England on Sunday","link":"https://indianexpress.com/article/sports/cricket/neeraj-chopra-meets-u-19-india-womens-team-before-their-final-against-england-8410072/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Olympic gold medal winning javelin thrower Neeraj Chopra on Saturday met the Indian contingent on the eve of their U19 T20 Women’s World Cup final against England on Sunday, a post shared by the BCCI revealed. The post which was captioned, “A Gold-standard meeting! 👏👏 Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final!” showed the superstar javelin thrower in various moods as he interacted with the U-19 team. On Sunday, India captain Shafali Verma will chase history when she leads India against England in the first-ever ICC U-19 Women’s T20 World Cup final. For all their success at the international stage, the Indian women’s cricket team has never won a World Cup at any level and the young batter, who has been part of two World Cup and one Commonwealth Games final with the senior team, will look to bring the elusive title home. A Gold-standard meeting! 👏👏 Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final! 👍 👍 pic.twitter.com/TxL5afL2FT — BCCI (@BCCI) January 28, 2023 The seniors have made the World Cup final on three occasions across formats only to have returned with bitter memories — losing to Australia by 98 runs in 2005 and losing to England by 9 runs in 2017 in the ODIs, and in T20Is they went down in the 2020 final to the Aussies by 85 runs. In the U-19 World Cup semifinal, India registered a dominating eight-wicket win after their bowlers restricted a powerful New Zealand side to an under-par 107/9. Leg-spinner Parshavi Chopra led the bowling show by claiming 3/20, while Shafali went for just seven runs in her four overs, taking one wicket. In reply, a ruthless half-century from the opening batter and the tournament’s leading scorer, Shweta Sehrawat, saw India home. Neeraj Chopra, meanwhile, has set himself a target in the new year which is to breach the 90-metre mark with his javelin. “In this new year, I hope I will put an end to this question,” Chopra had said in a video interaction from England earlier this month. Subscriber Only Stories View All The K Arun Prakash Interview: ‘My style is to highlight the composition a... At international checkpoint, online system helps vehicles cross over sea... Experts say Adani Group stock sell-off may not affect market, but deepens... Delhi Confidential: Lok Sabha Speaker wants MPs to learn lessons from Pad... Apply New Year promo code SD25 After the historic gold in Tokyo, the 24-year-old Olympic champion javelin thrower has continued to raise expectations with a silver at the World Championships, before adding another feather in his cap by winning the Diamond League Finals gold.","pubDate":"2023-01-28 17:35:23","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Neeraj Chopra interacts with Team India ahead of Women’s T20 World Cup final","link":"https://thenewsmill.com/2023/01/neeraj-chopra-interacts-with-team-india-ahead-of-womens-t20-world-cup-final/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Star India javelin thrower and Olympic medalist Neeraj Chopra interacted with the national women’s under-19 cricket team ahead of the final of the ICC Women’s U19 T20 World Cup clash against England. India will take on England in the final of the ICC Women’s Under 19 T20 World Cup on Sunday. The Board of Control for Cricket in India (BCCI) took to Twitter to share some pictures of the interaction. “A Gold-standard meeting! Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final!,” tweeted BCCI. Notably, ahead of her side’s final of the ICC Women’s Under 19 World Cup final against England, Indian skipper Shafali Verma said that the side is extremely excited to play the summit clash and she has shared her experiences of playing finals major tournaments at senior level with them. Shafali is the third-highest run-scorer in the tournament, having scored 157 runs at an average of 26.16, with one half-century and a strike rate of 201.28. “The feeling among the team is great. We have done whatever plans we had in our nets session. Everyone is aware of their roles and what they need to do for tomorrow’s game. Everyone’s excited to be playing in the final. We are going to back each other in the final and are going to enjoy it, give our 100 per cent,” said Shafali in a post-match press conference. “I have played a lot of finals, like the T20 World Cup 2020 final and the final of the Commonwealth Games tournament. I told them to enjoy their game and not think that it is a final. But at the same time, they have to give their 100 per cent. The team does not need to stress itself out, because if you do so, the match itself will be stressful. They should have belief in themselves,” added Shafali. Shafali said that a lot of team members, including herself had seen the second semifinal between Australia and England, which saw England defend the target of 100 runs after being bundled out for just 99 and win the game by three runs. Australia was bundled out for 96 runs. “It was a good game. We have seen England, how they play, how they bat. We have our strategies and are going to execute them,” he added. The skipper said that winning the trophy would mean a lot for her as a captain. “My father used to tell me that you have to win the U19 title. I will remember these things. I have told everyone to enjoy the game and that we are one as a unit. I am trying to keep my teammates comfortable,” added Shafali. Also, 2022 was an amazing year for Neeraj, though he missed out on Commonwealth Games 2022 due to an injury. In June, he made new national record and finished with a silver medal with a throw of 89.30 metres at the Paavo Nurmi Games in Finland, bettering his own previous national record of 88.07 meters which he had set in Patiala in March last year. In June again, he gave another sterling performance as he clinched gold in the 2022 Kuortane Games in Finland. Neeraj threw 86.69 m to clinch the top prize in tricky and wet conditions. At the World Athletics Championships in July, Neeraj Chopra made history by becoming only the second Indian and the first male track and field athlete to take home a medal. He finished second and won the silver medal, realising his aim of winning a World medal with a throw of 88.13 metres. Anju Bobby George won a bronze medal for India in the long jump competition before Neeraj. In September, Chopra made history by becoming the first-ever Indian to win the prestigious Diamond League trophy, a top-tier athletics competition, achieving the best throw of 88.44 m to clinch one of the biggest wins of his career. He now holds the male javelin record thanks to a throw in the Stockholm Diamond League that measured 89.94 metres, with which he broke his own record. He clinched a silver medal at the prestigious Diamond League meet in Stockholm and broke his own previous record. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 17:31:25","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Jacques Kallis, Brett Lee, Ross Taylor confirm participation for LLC Masters","link":"https://thenewsmill.com/2023/01/jacques-kallis-brett-lee-ross-taylor-confirm-participation-for-llc-masters/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Legendary South African all-rounder Jacques Kallis, former New Zealand batter Ross Taylor, Australian pace great Brett Lee and former Bangladesh spinner Abdur Razzak have confirmed their participation for the LLC Masters, announced the Legends League Cricket on Saturday. LLC Masters will be played in Qatar from February 27 to Match 8. The list of confirmed players includes Shane Watson, Upul Tharanga, Albie Morkel, Kevin O’Brien, Shoaib Akhtar, Chris Gayle and S Sreesanth. Jacques Kallis said, “It has been amazing experience to play with the legends of the game in India. I am hoping to enjoy the game in Qatar as well.” Ross Taylor said, “I thoroughly enjoyed season two and happy to be part of the winning team. Look forward to playing in LLC Masters.” Brett Lee commented, “Having played both seasons, I am excited to play some really competitive cricket in Legends League Cricket. I look forward to performing well for my team at LLC Masters.” Abdur Razzak said, “I am looking forward to play in LLC Masters, I am following some of the legends in LLC and I am happy to play with them.” Raman Raheja, Co-Founder & CEO, of Legends League Cricket, said, “The excitement is building towards LLC Masters with so many players coming forward to participate. Legends League Cricket is already one of the most respected, followed and watched senior leagues in the World. With LLC Masters, we would definitely retain our position with so much serious and competitive cricket.” (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 17:31:19","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"T20 match between India Women and South Africa Women called off due to heavy rain","link":"https://sportstar.thehindu.com/cricket/womens-cricket/india-women-vs-south-africa-women-t20-match-called-off-due-to-heavy-rain-tri-series-final-february-2/article66444798.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"The T20 international between India Women and South Africa women was called off due to heavy rain, with only two overs having been played.","content":"The T20 international between India Women and South Africa women was called off due to heavy rain, with only two overs having been played. India won the toss and elected to bat first, as Smriti Mandhana and Jemimah Rodrigues came out to open the innings. However, the sky opened up after just two overs, and play was suspended with the Women in Blue at a score of 4-0. Having lost to India in the tri-series opener, South Africa was looking to even the score with India ahead of a repeat clash in the final. India will play South Africa in the final of the tri-series tournament on February 2. Read more stories on Women's Cricket.","pubDate":"2023-01-28 20:18:54","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"India-W vs South Africa-W highlights, Tri-Series: Match called off due to heavy rain; Both teams to play final on February 2","link":"https://sportstar.thehindu.com/cricket/womens-cricket/india-women-vs-south-africa-women-live-score-5th-t20-game-tri-series-updates-highlights/article66443358.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Highlights from the India vs South Africa women’s T20 tri-series match.","content":"Welcome to Sportstar’s highlights of the India vs South Africa women’s T20 tri-series match. The match was called off due to heavy rain. Team news for the match South Africa and India have made a change each. Shabnim Ismail replaces Masabata Klaas for the hosts. India brings back Pooja Vastrakar in place of Amanjot Kaur. Match Preview A more fearless approach will be expected from India’s top-order when it meets South Africa in Saturday’s dress rehearsal for the women’s tri-series final. West Indies losing its first three games has ensured an India-South Africa final on February 2. It if wasn’t for the experienced duo of Smriti Mandhana and captain Harmanpreet Kaur, India would have struggled to post a competitive total against the West Indies in its previous league fixture. While they both are expected to perform consistently for the team, the captain will be expecting stand-out performances from the younger lot. Opening the innings in the absence of Shafali Verma, Yastika Bhatia has not been able to attack the bowlers in the powerplay. With due respect to South Africa and West India, a similar batting approach can prove costly against tougher opponents like Australia and England in the upcoming World Cup. In the absence of Richa Ghosh, who is also on India U-19 duty with Shafali, the team needs to find another power hitter in the middle-order. Rookie Amanjot Kaur was impressive on her debut and would be itching to use the long handle again. Jemimah Rodrigues’ wretched run has continued since the home series against Australia and she needs to find runs ahead of the ICC event next month. The game will also provide another opportunity for Harleen Deol to make an impact after two failures. All-rounder Pooja Vastrakar is yet to get a game considering her fitness but she might play on Saturday. Shikha Pandey, who made a surprise return to the national team, will be expected to provide early breakthroughs after going wicketless in her comeback game. Having lost to India in the tri-series opener, South Africa will be looking to make amends ahead of a repeat clash in the final. The host hammered West Indies by 10 wickets to seal its place in the title clash. Match starts at 10:30 PM. -PTI Where to watch IND-W vs SA-W tri-series match live on TV in India? The tri-series match between India Women and South Africa Women will be aired LIVE on the Star Sports Network. Where to watch IND-W vs SA-W tri-series match live online in India? The tri-series match between India Women and South Africa Women will be streamed LIVE on Disney+Hotstar app. At what time will IND-W vs SA-W tri-series match start in India? The tri-series match between India Women and South Africa Women will begin at 10:30 PM IST. When will IND-W vs SA-W tri-series match be played? The tri-series match between India Women and South Africa Women will be held on Saturday, January 28. Read more stories on Women's Cricket.","pubDate":"2023-01-28 19:59:28","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"For ‘senior’ Shafali, another World Cup opportunity","link":"https://indianexpress.com/article/sports/cricket/for-senior-shafali-another-world-cup-opportunity-8410126/","keywords":["Cricket","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":"At 16, Shafali Verma was India’s highest run scorer in her first senior T20 World Cup in 2020. Seven months earlier, she had become the youngest to feature in a T20 International at the age of 15. And so when she was caught behind by Alyssa Healy, in the third ball of an unsuccessful chase, while trying to go for a boundary, it was just seen as an off day for one of the most promising young cricketers. Cut to three years later, watching her lead India in the maiden U19 Women’s T20 World Cup final shouldn’t come as a surprise. However, the journey since the 2020 World Cup hasn’t been as smooth as many believed it would be for Shafali. Sunday presents an opportunity for Shafali to create happy memories of an ICC event. With over 2,000 runs in 74 games, Shafali has had a mixed run with the senior side. In T20Is, the format she has most featured in, the explosive opener scored 487 runs in her first 19 matches at a strike rate above 146 up until the 2020 final in Melbourne. In the next 32 outings, the strike rate dropped to 127.83. In the ODIs, while she averages a tad better than the shorterest format, she was dropped for three consecutive games at the World Cup last year. When India and England clash in the #U19T20WorldCup final tomorrow, there will be 🎆 Who are you backing❓ pic.twitter.com/4TDZsQjZZJ — T20 World Cup (@T20WorldCup) January 28, 2023 At the Under-19 World Cup, as the most experienced player in the side, she has had to guide the team. “Yes, I’ve played a lot of finals and seen it all,” Shafali, who turned 19 on Saturday, said on the eve of the final. “It’s about going out there and enjoying the game. I’ve told the teammates ‘don’t stress, just give your 100 percent without thinking of it as the final. Just believe in yourself. It’s all past and that cannot be recreated. We are determined to bring the World Cup this time and are trying to improve day by day,” she added. India suffered one defeat in the Super Six league stage where they lost to Australia after being bowled out for 87. Advertisement “We had nervous moments and couldn’t sleep, thinking about whether we could make the final or not… But we have learnt from the mistakes and here we are. Now we’re all very confident, clear of our roles. Everyone is enjoying each other’s company and staying normal, we are not thinking much.I may be senior to many of them but I’ve told them ‘on the ground we all are equal’ it’s about keeping everyone comfortable,” Shafali said. In the semifinal, India registered an eight-wicket win after their bowlers restricted the New Zealanders to an under-par 107/9. India will be up against a strong England side that topped its Super Six group by winning all the four matches. They suffered a batting debacle in the semifinal against Australia when they were bowled out for 99 in 19.5 overs. But their bowling attack fought back to keep Australia to 96 in 18.4 overs. “We are determined to bring the World Cup this time” 💬 Shafali Verma is in high spirits ahead of the mouthwatering final clash at the Women’s #U19T20WorldCup 🤩https://t.co/TDGoKKsUAO — T20 World Cup (@T20WorldCup) January 28, 2023 Aggressive England Advertisement Positive intent has been a keyword for English cricket of late. From Eoin Morgan’s white ball revolution to Brendon McCullum ’s Bazball philosophy in Test cricket. It had rubbed off on the Under-19 side too. “We set out as a group and as a coaching staff for the U19s to play with a positive mindset,” captain Grace Scrivens had told Sky Sports. “That might have been influenced by people higher up, but we were all keen on buying into the positive intent and mindset that we have shown.” On the eve of the final, the England skipper spoke about the positives. “It was unbelievable to be a part of it (final). It’s about resetting and going to the next game. We want to play with a positive mindset, and play fearless cricket. I’m sure yesterday’s collapse will not affect us,” Grace said. Teams: (India): Shafali Verma, Shweta Sehrawat, Gongadi Trisha, Soumya Tiwari, Sonia Mehdiya, Richa Ghosh, Hrishita Basu, Titas Sadhu, Mannat Kashyap, Parshavi Chopra, Sonam Yadav, Shabnam, Falak Naz and Yashasri Soppadhandhi (England): Grace Scrivens, Ellie Anderson, Hannah Bakers, Josie Groves, Liberty Heap, Niamh Holland, Ryana MacDonald-Gay, Emma Marlov, Charis Pavley, Davina Perrin, Lizzie Scott, Seren Smale, Sophia Smale, Alexa Stonehouse and Maddie Ward. Subscriber Only Stories View All The K Arun Prakash Interview: ‘My style is to highlight the composition a... At international checkpoint, online system helps vehicles cross over sea... Experts say Adani Group stock sell-off may not affect market, but deepens... Delhi Confidential: Lok Sabha Speaker wants MPs to learn lessons from Pad... Apply New Year promo code SD25 U19 Women’s T20 World Cup final, Live on FanCode, Star Sports Network, 5:15 pm","pubDate":"2023-01-28 19:17:37","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Roy proud of battling back for England","link":"https://www.perthnow.com.au/sport/cricket/roy-proud-of-battling-back-for-england-c-9587377","keywords":null,"creator":["David Charlesworth"],"video_url":null,"description":"Star batter Jason Roy says he's proud to have battled through self-doubt to return to England's international ranks with a century.","content":"Jason Roy has spoken of his pride at battling through self-doubt to end his prolonged run-scoring drought with a trademark belligerent century for England. Roy has for long been England's pacesetter at the top of the order and often instrumental in their successes, none greater than when he returned from injury to inspire the side to 2019 World Cup glory. But after excelling in last winter's Pakistan Super League, his form nosedived in the English summer, both internationally and domestically, to the extent he was omitted from England's T20 World Cup squad. Roy then lost his central contract and was downgraded to an incremental deal while his figures in this month's SA20 painted a bleak picture as he averaged just 12.5 for Paarl Royals in eight innings. He felt he had turned a corner after some frank conversations with Jos Buttler and rewarded the England captain's faith by peeling off 113 from 91 balls in a 27-run defeat by South Africa in the first ODI on Friday. \"It was like an avalanche of s*** things happening over and over again,\" said Roy. \"You start doubting yourself as a player, thinking people have forgotten about you even though you've played a huge amount of cricket, start doubting yourself as a guy, becoming reserved, which is just not me. \"Mentally overcoming a lot of doubts and thoughts that I had in my head towards the latter part of last year, that's probably the proudest I've been of myself. \"I've gone out there and just enjoyed myself, tried to impose myself which I don't think I've done over a period of time so it was a nice feeling to go out there and just be myself: chew on some gum, give it the full bravado, say a few things to the opposition, get in the fight a bit and it was a very proud moment. \"I'm never a guy who's going to roll over. That's why, after the year I had, not pushing myself as much as I should have, it's good to see that I've still got a bit of fight.\" Being left out of England's T20 World Cup winning campaign last autumn was a \"huge hammer blow\" for Roy, who credited the support of his wife Elle for keeping him \"level-headed\" through low moments. Roy has worked with Surrey psychologist Dr Andrea Furst and his Bloemfontein innings came a day after England great Kevin Pietersen had a pep talk with the squad at Mangaung Oval. \"We spoke about being free, not worrying about the outcome, just playing my game,\" Roy said. \"The big thing for me the night before was to go out on my own terms. \"How do I want to be remembered? As a guy who had a great career, smacked it everywhere, then all of a sudden a completely different player? \"Or as a guy who went out there and attacked the bowlers? Fair enough if I got out, but I got out on my terms. That has helped my psyche.\"","pubDate":"2023-01-28 18:40:35","image_url":"https://images.perthnow.com.au/publication/C-9587377/1a0e0e7ad85a4cc2d73499cab37aae8aa5323c2f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Gujarat Giants appoint Mithali Raj as mentor ahead of inaugural Women’s Premier League","link":"https://thenewsmill.com/2023/01/gujarat-giants-appoint-mithali-raj-as-mentor-ahead-of-inaugural-womens-premier-league/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Gujarat Giants has appointed legendary Indian batter and former captain Mithali Raj as the mentor and advisor for the side ahead of the inaugural edition of the Women’s Premier League (WPL), which will take place in March-April 2023. Over the years, Mithali’s trailblazing achievements and contributions to Indian cricket have not only earned her numerous awards and accolades but have also played a key role in bringing women’s cricket into the limelight, both on national and international platforms. As a mentor and advisor, Mithali will also promote women’s cricket and help develop the sport at the grassroots level in Gujarat. “The inaugural season of the Women’s Premier League is a fantastic move for women’s cricket and the involvement of the Adani Group is a massive boost for the sport as well,” said Mithali Raj, ex-Skipper of the Indian Women’s National Cricket Team as quoted by an Adani Sportsline. “Women’s cricket is growing steadily, and this kind of impetus will undoubtedly encourage young women to consider taking up cricket professionally. I believe that the high-impact participation of corporates will help hasten the process of eventually bringing more glory to India. This level of influence can help strengthen the sporting ecosystem and enhance opportunities for women athletes”. “Mithali Raj is a role model for the young generation and we are delighted to have such an inspirational athlete on board to mentor our women’s cricket team,” said Pranav Adani, Director of Adani Enterprises. “This is the first time the Adani Group has ventured into women’s cricket, and we are privileged to be able to promote women in sports through the inaugural Women’s Premier League. We believe that the presence of international sporting heroes like Mithali will attract new talent not just into cricket but also into every other sport and transform the professional sports ecosystem,” added Pranav. Acknowledged as one of the greatest female cricketers of all time, Mithali Raj opened her ODI career with a rare accomplishment – a century on debut. Mithali is the highest run-scorer in women’s ODIs and has scored 17 half-centuries in her T20Is. In 89 T20Is, Raj has also scored 2,364 runs at an average of 37.52, with the best score of 97. But Mithali’s best format was ODIs, in which she played 232 matches and scored 7,805 runs in 211 innings at an average of 50.68. She had seven tons and 64 fifties in the format, with best score of 125*. The highly acclaimed cricketer captained India in the 2017 Women’s ODI Cricket World Cup, where India finished runners-up. She was also part of the Indian team that made it to the semi-finals of the 2018 ICC Women’s World T20, held in the West Indies. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 18:31:30","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Ahoy Senor holds on to hand Lucinda Russell emotional Cotswold Chase win","link":"https://www.theguardian.com/sport/2023/jan/28/editeur-du-gite-edges-edwardstone-thrilling-clarence-house-chase","keywords":["Horse racing","Horse racing tips","Cheltenham","Sport"],"creator":["Greg Wood at Cheltenham"],"video_url":null,"description":"Trainer’s father Peter died this week – ‘He’d be very proud today’Editeur Du Gite surges to thrilling win in Clarence House ChaseThe “Trials Day” label on the last card at Cheltenham before the Festival might suggest it is little more than an appetiser ahead of the main event. For the connections of the big chase winners here on Saturday, however, it was a day of real significance and, for trainer Lucinda Russell, an emotional afternoon too.Russell’s father, Peter, who died this week at 95, was a co-owner of Ahoy Senor, the winner of the Grade Two Cotswold Chase, and also played a big part in launching his daughter’s training career. “He loved this horse and really wanted him to do well,” she said. “It was Dad that set me up and gave me the desire and determination. He’d be very proud today. Continue reading...","content":"The “Trials Day” label on the last card at Cheltenham before the Festival might suggest it is little more than an appetiser ahead of the main event. For the connections of the big chase winners here on Saturday, however, it was a day of real significance and, for trainer Lucinda Russell, an emotional afternoon too. Russell’s father, Peter, who died this week at 95, was a co-owner of Ahoy Senor, the winner of the Grade Two Cotswold Chase, and also played a big part in launching his daughter’s training career. “He loved this horse and really wanted him to do well,” she said. “It was Dad that set me up and gave me the desire and determination. He’d be very proud today. Talking Horses: Fugitif can steal big prize on Cheltenham Trials day Read more “As he went on in his life, the racing meant a lot to him and he would always phone me before and after the races. I’ll miss that intensely.” Ahoy Senor was a leading novice over fences last season, rounding off his campaign with a Grade One win at Aintree in April, but was also prone to losing his confidence after a mistake, particularly in the latter stages of races. That continued in his first three starts this term, but he was far more assured this time, overcoming a slight error at the last to battle to a one-and-a-half length defeat of Sounds Russian with the market leaders, Protektorat and Noble Yeats, the 2022 Grand National winner, fourth and third respectively. “He’s always been good, but he just had to learn about it and I think he came of age today,” Russell said, while her partner, the former champion jockey, Peter Scudamore, reached for a cricketing analogy. “I’ve said he’s the best horse we’ve ever trained,” Scudamore said. “Then you begin to doubt yourself, but things eventually come right in the end and that’s what sport is about. When he gets it right, he is like Ian Botham, when he gets it wrong, he can be back in the pavilion for 10.” Ahoy Senor was cut to around 12-1 for the Gold Cup in March while Noble Yeats, who would be the first horse to win the Grand National and Gold Cup in that order, is 8-1 for the Festival’s showpiece having stayed on well in the closing stages, over a trip a furlong shorter than the Gold Cup. It proved to be a significant afternoon for Niall Houlihan, a conditional rider at Gary Moore’s Sussex stable, as he recorded the first Grade One success of his career aboard Editeur Du Gite in the Clarence House Chase, which was added to the card after Ascot’s meeting last Saturday succumbed to the weather. Editeur Du Gite was not among the declarations for the race seven days ago, but Moore felt it was worth paying £2,250 to add him to a field that included Energumene and Edwardstone, the winners of last season’s Champion Chase and Arkle Trophy respectively. His gamble was richly rewarded as the 14-1 shot responded strongly to Houlihan’s urging and edged past Edwardstone in the final strides, after being passed on the run-in. Energumene, the 4-9 favourite, was third, with Willie Mullins, his trainer, suggesting the new white marker boards on the fences may have unsettled his runner. “It is unreal really,” Houlihan said. “The horse tries so hard for you. Every time a horse came to me, he stuck his neck out, especially when he got headed after the last. It is brilliant that they put the faith in me on a horse like him and to pull it off is great.” Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. Quick Guide Greg Wood's Sunday tips Show Sedgefield 12.50 Aubis Walk 1.25 Twoshotsoftequila (nb) 2.00 Ashington 2.35 Nero Rock 3.10 Basford 3.45 Skyhill 4.20 Silkstone Fontwell 1.05 Firestream 1.40 Unit Sixtyfour 2.15 Concrete King (nap) 2.50 Coolvalla 3.25 Our Champ 4.00 Art Decco 4.35 Film D’Action Southwell 1.15 Get Prepared 1.50 Monte Igueldo 2.25 Doc McCoy 3.00 Strong Leader 3.35 Richhill 4.10 Shallow River Was this helpful? Thank you for your feedback. Editeur Du Gite is top-priced at 13-2 for the Champion Chase on 15 March, behind Energumene and Edwardstone at 3-1 and Blue Lord, on 9-2. Gold Tweet (14-1) was another surprise winner in the Grade Two Cleeve Hurdle, but there was little sign of fluke as he went clear of Dashel Drasher and Paisley Park, a former Stayers’ Hurdle winner, to become the first French-trained winner on Trials day for 18 years. Gabriel Leenders, his trainer, will now consider a supplementary entry for the Stayers’ Hurdle in March. “It’s expensive and we are not rich,” he said, “but it would be a dream to come here in March.”","pubDate":"2023-01-28 18:17:06","image_url":"https://i.guim.co.uk/img/media/410b18ffbceeb1a9887fae4b707a9044f02e2652/0_202_4896_2938/master/4896.jpg?width=460&quality=85&auto=format&fit=max&s=6143f9a9a2ec0a5f02bea39acfec8b4f","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Marizanne Kapp on significance of winning tri-series battles against India: “You want that bit of momentum when you go into a T20 World Cup”","link":"https://www.sportskeeda.com/cricket/news-marizanne-kapp-significance-winning-tri-series-battles-india-you-want-bit-momentum-go-t20-world-cup?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Seasoned South African all-rounder Marizanne Kapp has stated that winning the upcoming matches against India in the ongoing Women’s T20I Tri-Series in East London will be a ‘major boost’ for her team, keeping the T20 World Cup 2023 in mind. South Africa will take on India in the fifth match of the tri-series at Buffalo Park in East London on Saturday, January 28. With West Indies being knocked out of the tournament, the same two teams will once again meet in the final on February 2. Sharing her views on the importance of South Africa ’s upcoming battles against India, Kapp said ahead of Saturday’s match: South Africa went down to India by 27 runs in the tri-series opener. The Indians came up with a terrific bowling performance to restrict South Africa to 120/9, defending a total of 147. In subsequent matches, South Africa have got the better of West Indies by 44 runs and 10 wickets respectively. Reflecting on the challenge of facing India for the second time, Kapp admitted that facing spin bowling is not easy given the surfaces on offer. She explained: India stifled South Africa with spin when the two teams met in the first match of the tri-series. Deepti Sharma claimed 3/30, Devika Vaidya 2/19, while Rajeshwari Gayakwad, Sneh Rana and Radha Yadav claimed one scalp each. Speaking of her individual performances, Kapp has scored 22 and 52, apart from claiming one wicket. South Africa will depend on her to deliver with both bat and ball against India. The confident 33-year-old stated: Kapp has played 87 T20Is for South Africa, scoring 1120 runs. She has also claimed 67 wickets with her medium pace. Get IND vs NZ Live Cricket Score , 1st T20 at Sportskeeda. Follow us for the latest cricket Updates. Poll : 0 votes Quick Links","pubDate":"2023-01-28 17:54:43","image_url":"https://static.sportskeeda.com/editor/2023/01/c4759-16749088068151-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Neeraj Chopra meets U-19 India women’s team before their final against England on Sunday","link":"https://indianexpress.com/article/sports/cricket/neeraj-chopra-meets-u-19-india-womens-team-before-their-final-against-england-8410072/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Olympic gold medal winning javelin thrower Neeraj Chopra on Saturday met the Indian contingent on the eve of their U19 T20 Women’s World Cup final against England on Sunday, a post shared by the BCCI revealed. The post which was captioned, “A Gold-standard meeting! 👏👏 Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final!” showed the superstar javelin thrower in various moods as he interacted with the U-19 team. On Sunday, India captain Shafali Verma will chase history when she leads India against England in the first-ever ICC U-19 Women’s T20 World Cup final. For all their success at the international stage, the Indian women’s cricket team has never won a World Cup at any level and the young batter, who has been part of two World Cup and one Commonwealth Games final with the senior team, will look to bring the elusive title home. A Gold-standard meeting! 👏👏 Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final! 👍 👍 pic.twitter.com/TxL5afL2FT — BCCI (@BCCI) January 28, 2023 The seniors have made the World Cup final on three occasions across formats only to have returned with bitter memories — losing to Australia by 98 runs in 2005 and losing to England by 9 runs in 2017 in the ODIs, and in T20Is they went down in the 2020 final to the Aussies by 85 runs. In the U-19 World Cup semifinal, India registered a dominating eight-wicket win after their bowlers restricted a powerful New Zealand side to an under-par 107/9. Leg-spinner Parshavi Chopra led the bowling show by claiming 3/20, while Shafali went for just seven runs in her four overs, taking one wicket. In reply, a ruthless half-century from the opening batter and the tournament’s leading scorer, Shweta Sehrawat, saw India home. Neeraj Chopra, meanwhile, has set himself a target in the new year which is to breach the 90-metre mark with his javelin. “In this new year, I hope I will put an end to this question,” Chopra had said in a video interaction from England earlier this month. Subscriber Only Stories View All The K Arun Prakash Interview: ‘My style is to highlight the composition a... At international checkpoint, online system helps vehicles cross over sea... Experts say Adani Group stock sell-off may not affect market, but deepens... Delhi Confidential: Lok Sabha Speaker wants MPs to learn lessons from Pad... Apply New Year promo code SD25 After the historic gold in Tokyo, the 24-year-old Olympic champion javelin thrower has continued to raise expectations with a silver at the World Championships, before adding another feather in his cap by winning the Diamond League Finals gold.","pubDate":"2023-01-28 17:35:23","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Neeraj Chopra interacts with Team India ahead of Women’s T20 World Cup final","link":"https://thenewsmill.com/2023/01/neeraj-chopra-interacts-with-team-india-ahead-of-womens-t20-world-cup-final/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Star India javelin thrower and Olympic medalist Neeraj Chopra interacted with the national women’s under-19 cricket team ahead of the final of the ICC Women’s U19 T20 World Cup clash against England. India will take on England in the final of the ICC Women’s Under 19 T20 World Cup on Sunday. The Board of Control for Cricket in India (BCCI) took to Twitter to share some pictures of the interaction. “A Gold-standard meeting! Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final!,” tweeted BCCI. Notably, ahead of her side’s final of the ICC Women’s Under 19 World Cup final against England, Indian skipper Shafali Verma said that the side is extremely excited to play the summit clash and she has shared her experiences of playing finals major tournaments at senior level with them. Shafali is the third-highest run-scorer in the tournament, having scored 157 runs at an average of 26.16, with one half-century and a strike rate of 201.28. “The feeling among the team is great. We have done whatever plans we had in our nets session. Everyone is aware of their roles and what they need to do for tomorrow’s game. Everyone’s excited to be playing in the final. We are going to back each other in the final and are going to enjoy it, give our 100 per cent,” said Shafali in a post-match press conference. “I have played a lot of finals, like the T20 World Cup 2020 final and the final of the Commonwealth Games tournament. I told them to enjoy their game and not think that it is a final. But at the same time, they have to give their 100 per cent. The team does not need to stress itself out, because if you do so, the match itself will be stressful. They should have belief in themselves,” added Shafali. Shafali said that a lot of team members, including herself had seen the second semifinal between Australia and England, which saw England defend the target of 100 runs after being bundled out for just 99 and win the game by three runs. Australia was bundled out for 96 runs. “It was a good game. We have seen England, how they play, how they bat. We have our strategies and are going to execute them,” he added. The skipper said that winning the trophy would mean a lot for her as a captain. “My father used to tell me that you have to win the U19 title. I will remember these things. I have told everyone to enjoy the game and that we are one as a unit. I am trying to keep my teammates comfortable,” added Shafali. Also, 2022 was an amazing year for Neeraj, though he missed out on Commonwealth Games 2022 due to an injury. In June, he made new national record and finished with a silver medal with a throw of 89.30 metres at the Paavo Nurmi Games in Finland, bettering his own previous national record of 88.07 meters which he had set in Patiala in March last year. In June again, he gave another sterling performance as he clinched gold in the 2022 Kuortane Games in Finland. Neeraj threw 86.69 m to clinch the top prize in tricky and wet conditions. At the World Athletics Championships in July, Neeraj Chopra made history by becoming only the second Indian and the first male track and field athlete to take home a medal. He finished second and won the silver medal, realising his aim of winning a World medal with a throw of 88.13 metres. Anju Bobby George won a bronze medal for India in the long jump competition before Neeraj. In September, Chopra made history by becoming the first-ever Indian to win the prestigious Diamond League trophy, a top-tier athletics competition, achieving the best throw of 88.44 m to clinch one of the biggest wins of his career. He now holds the male javelin record thanks to a throw in the Stockholm Diamond League that measured 89.94 metres, with which he broke his own record. He clinched a silver medal at the prestigious Diamond League meet in Stockholm and broke his own previous record. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 17:31:25","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Jacques Kallis, Brett Lee, Ross Taylor confirm participation for LLC Masters","link":"https://thenewsmill.com/2023/01/jacques-kallis-brett-lee-ross-taylor-confirm-participation-for-llc-masters/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Legendary South African all-rounder Jacques Kallis, former New Zealand batter Ross Taylor, Australian pace great Brett Lee and former Bangladesh spinner Abdur Razzak have confirmed their participation for the LLC Masters, announced the Legends League Cricket on Saturday. LLC Masters will be played in Qatar from February 27 to Match 8. The list of confirmed players includes Shane Watson, Upul Tharanga, Albie Morkel, Kevin O’Brien, Shoaib Akhtar, Chris Gayle and S Sreesanth. Jacques Kallis said, “It has been amazing experience to play with the legends of the game in India. I am hoping to enjoy the game in Qatar as well.” Ross Taylor said, “I thoroughly enjoyed season two and happy to be part of the winning team. Look forward to playing in LLC Masters.” Brett Lee commented, “Having played both seasons, I am excited to play some really competitive cricket in Legends League Cricket. I look forward to performing well for my team at LLC Masters.” Abdur Razzak said, “I am looking forward to play in LLC Masters, I am following some of the legends in LLC and I am happy to play with them.” Raman Raheja, Co-Founder & CEO, of Legends League Cricket, said, “The excitement is building towards LLC Masters with so many players coming forward to participate. Legends League Cricket is already one of the most respected, followed and watched senior leagues in the World. With LLC Masters, we would definitely retain our position with so much serious and competitive cricket.” (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 17:31:19","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"T20 match between India Women and South Africa Women called off due to heavy rain","link":"https://sportstar.thehindu.com/cricket/womens-cricket/india-women-vs-south-africa-women-t20-match-called-off-due-to-heavy-rain-tri-series-final-february-2/article66444798.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"The T20 international between India Women and South Africa women was called off due to heavy rain, with only two overs having been played.","content":"The T20 international between India Women and South Africa women was called off due to heavy rain, with only two overs having been played. India won the toss and elected to bat first, as Smriti Mandhana and Jemimah Rodrigues came out to open the innings. However, the sky opened up after just two overs, and play was suspended with the Women in Blue at a score of 4-0. Having lost to India in the tri-series opener, South Africa was looking to even the score with India ahead of a repeat clash in the final. India will play South Africa in the final of the tri-series tournament on February 2. Read more stories on Women's Cricket.","pubDate":"2023-01-28 20:18:54","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"India-W vs South Africa-W highlights, Tri-Series: Match called off due to heavy rain; Both teams to play final on February 2","link":"https://sportstar.thehindu.com/cricket/womens-cricket/india-women-vs-south-africa-women-live-score-5th-t20-game-tri-series-updates-highlights/article66443358.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Highlights from the India vs South Africa women’s T20 tri-series match.","content":"Welcome to Sportstar’s highlights of the India vs South Africa women’s T20 tri-series match. The match was called off due to heavy rain. Team news for the match South Africa and India have made a change each. Shabnim Ismail replaces Masabata Klaas for the hosts. India brings back Pooja Vastrakar in place of Amanjot Kaur. Match Preview A more fearless approach will be expected from India’s top-order when it meets South Africa in Saturday’s dress rehearsal for the women’s tri-series final. West Indies losing its first three games has ensured an India-South Africa final on February 2. It if wasn’t for the experienced duo of Smriti Mandhana and captain Harmanpreet Kaur, India would have struggled to post a competitive total against the West Indies in its previous league fixture. While they both are expected to perform consistently for the team, the captain will be expecting stand-out performances from the younger lot. Opening the innings in the absence of Shafali Verma, Yastika Bhatia has not been able to attack the bowlers in the powerplay. With due respect to South Africa and West India, a similar batting approach can prove costly against tougher opponents like Australia and England in the upcoming World Cup. In the absence of Richa Ghosh, who is also on India U-19 duty with Shafali, the team needs to find another power hitter in the middle-order. Rookie Amanjot Kaur was impressive on her debut and would be itching to use the long handle again. Jemimah Rodrigues’ wretched run has continued since the home series against Australia and she needs to find runs ahead of the ICC event next month. The game will also provide another opportunity for Harleen Deol to make an impact after two failures. All-rounder Pooja Vastrakar is yet to get a game considering her fitness but she might play on Saturday. Shikha Pandey, who made a surprise return to the national team, will be expected to provide early breakthroughs after going wicketless in her comeback game. Having lost to India in the tri-series opener, South Africa will be looking to make amends ahead of a repeat clash in the final. The host hammered West Indies by 10 wickets to seal its place in the title clash. Match starts at 10:30 PM. -PTI Where to watch IND-W vs SA-W tri-series match live on TV in India? The tri-series match between India Women and South Africa Women will be aired LIVE on the Star Sports Network. Where to watch IND-W vs SA-W tri-series match live online in India? The tri-series match between India Women and South Africa Women will be streamed LIVE on Disney+Hotstar app. At what time will IND-W vs SA-W tri-series match start in India? The tri-series match between India Women and South Africa Women will begin at 10:30 PM IST. When will IND-W vs SA-W tri-series match be played? The tri-series match between India Women and South Africa Women will be held on Saturday, January 28. Read more stories on Women's Cricket.","pubDate":"2023-01-28 19:59:28","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"For ‘senior’ Shafali, another World Cup opportunity","link":"https://indianexpress.com/article/sports/cricket/for-senior-shafali-another-world-cup-opportunity-8410126/","keywords":["Cricket","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":"At 16, Shafali Verma was India’s highest run scorer in her first senior T20 World Cup in 2020. Seven months earlier, she had become the youngest to feature in a T20 International at the age of 15. And so when she was caught behind by Alyssa Healy, in the third ball of an unsuccessful chase, while trying to go for a boundary, it was just seen as an off day for one of the most promising young cricketers. Cut to three years later, watching her lead India in the maiden U19 Women’s T20 World Cup final shouldn’t come as a surprise. However, the journey since the 2020 World Cup hasn’t been as smooth as many believed it would be for Shafali. Sunday presents an opportunity for Shafali to create happy memories of an ICC event. With over 2,000 runs in 74 games, Shafali has had a mixed run with the senior side. In T20Is, the format she has most featured in, the explosive opener scored 487 runs in her first 19 matches at a strike rate above 146 up until the 2020 final in Melbourne. In the next 32 outings, the strike rate dropped to 127.83. In the ODIs, while she averages a tad better than the shorterest format, she was dropped for three consecutive games at the World Cup last year. When India and England clash in the #U19T20WorldCup final tomorrow, there will be 🎆 Who are you backing❓ pic.twitter.com/4TDZsQjZZJ — T20 World Cup (@T20WorldCup) January 28, 2023 At the Under-19 World Cup, as the most experienced player in the side, she has had to guide the team. “Yes, I’ve played a lot of finals and seen it all,” Shafali, who turned 19 on Saturday, said on the eve of the final. “It’s about going out there and enjoying the game. I’ve told the teammates ‘don’t stress, just give your 100 percent without thinking of it as the final. Just believe in yourself. It’s all past and that cannot be recreated. We are determined to bring the World Cup this time and are trying to improve day by day,” she added. India suffered one defeat in the Super Six league stage where they lost to Australia after being bowled out for 87. Advertisement “We had nervous moments and couldn’t sleep, thinking about whether we could make the final or not… But we have learnt from the mistakes and here we are. Now we’re all very confident, clear of our roles. Everyone is enjoying each other’s company and staying normal, we are not thinking much.I may be senior to many of them but I’ve told them ‘on the ground we all are equal’ it’s about keeping everyone comfortable,” Shafali said. In the semifinal, India registered an eight-wicket win after their bowlers restricted the New Zealanders to an under-par 107/9. India will be up against a strong England side that topped its Super Six group by winning all the four matches. They suffered a batting debacle in the semifinal against Australia when they were bowled out for 99 in 19.5 overs. But their bowling attack fought back to keep Australia to 96 in 18.4 overs. “We are determined to bring the World Cup this time” 💬 Shafali Verma is in high spirits ahead of the mouthwatering final clash at the Women’s #U19T20WorldCup 🤩https://t.co/TDGoKKsUAO — T20 World Cup (@T20WorldCup) January 28, 2023 Aggressive England Advertisement Positive intent has been a keyword for English cricket of late. From Eoin Morgan’s white ball revolution to Brendon McCullum ’s Bazball philosophy in Test cricket. It had rubbed off on the Under-19 side too. “We set out as a group and as a coaching staff for the U19s to play with a positive mindset,” captain Grace Scrivens had told Sky Sports. “That might have been influenced by people higher up, but we were all keen on buying into the positive intent and mindset that we have shown.” On the eve of the final, the England skipper spoke about the positives. “It was unbelievable to be a part of it (final). It’s about resetting and going to the next game. We want to play with a positive mindset, and play fearless cricket. I’m sure yesterday’s collapse will not affect us,” Grace said. Teams: (India): Shafali Verma, Shweta Sehrawat, Gongadi Trisha, Soumya Tiwari, Sonia Mehdiya, Richa Ghosh, Hrishita Basu, Titas Sadhu, Mannat Kashyap, Parshavi Chopra, Sonam Yadav, Shabnam, Falak Naz and Yashasri Soppadhandhi (England): Grace Scrivens, Ellie Anderson, Hannah Bakers, Josie Groves, Liberty Heap, Niamh Holland, Ryana MacDonald-Gay, Emma Marlov, Charis Pavley, Davina Perrin, Lizzie Scott, Seren Smale, Sophia Smale, Alexa Stonehouse and Maddie Ward. Subscriber Only Stories View All The K Arun Prakash Interview: ‘My style is to highlight the composition a... At international checkpoint, online system helps vehicles cross over sea... Experts say Adani Group stock sell-off may not affect market, but deepens... Delhi Confidential: Lok Sabha Speaker wants MPs to learn lessons from Pad... Apply New Year promo code SD25 U19 Women’s T20 World Cup final, Live on FanCode, Star Sports Network, 5:15 pm","pubDate":"2023-01-28 19:17:37","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Roy proud of battling back for England","link":"https://www.perthnow.com.au/sport/cricket/roy-proud-of-battling-back-for-england-c-9587377","keywords":null,"creator":["David Charlesworth"],"video_url":null,"description":"Star batter Jason Roy says he's proud to have battled through self-doubt to return to England's international ranks with a century.","content":"Jason Roy has spoken of his pride at battling through self-doubt to end his prolonged run-scoring drought with a trademark belligerent century for England. Roy has for long been England's pacesetter at the top of the order and often instrumental in their successes, none greater than when he returned from injury to inspire the side to 2019 World Cup glory. But after excelling in last winter's Pakistan Super League, his form nosedived in the English summer, both internationally and domestically, to the extent he was omitted from England's T20 World Cup squad. Roy then lost his central contract and was downgraded to an incremental deal while his figures in this month's SA20 painted a bleak picture as he averaged just 12.5 for Paarl Royals in eight innings. He felt he had turned a corner after some frank conversations with Jos Buttler and rewarded the England captain's faith by peeling off 113 from 91 balls in a 27-run defeat by South Africa in the first ODI on Friday. \"It was like an avalanche of s*** things happening over and over again,\" said Roy. \"You start doubting yourself as a player, thinking people have forgotten about you even though you've played a huge amount of cricket, start doubting yourself as a guy, becoming reserved, which is just not me. \"Mentally overcoming a lot of doubts and thoughts that I had in my head towards the latter part of last year, that's probably the proudest I've been of myself. \"I've gone out there and just enjoyed myself, tried to impose myself which I don't think I've done over a period of time so it was a nice feeling to go out there and just be myself: chew on some gum, give it the full bravado, say a few things to the opposition, get in the fight a bit and it was a very proud moment. \"I'm never a guy who's going to roll over. That's why, after the year I had, not pushing myself as much as I should have, it's good to see that I've still got a bit of fight.\" Being left out of England's T20 World Cup winning campaign last autumn was a \"huge hammer blow\" for Roy, who credited the support of his wife Elle for keeping him \"level-headed\" through low moments. Roy has worked with Surrey psychologist Dr Andrea Furst and his Bloemfontein innings came a day after England great Kevin Pietersen had a pep talk with the squad at Mangaung Oval. \"We spoke about being free, not worrying about the outcome, just playing my game,\" Roy said. \"The big thing for me the night before was to go out on my own terms. \"How do I want to be remembered? As a guy who had a great career, smacked it everywhere, then all of a sudden a completely different player? \"Or as a guy who went out there and attacked the bowlers? Fair enough if I got out, but I got out on my terms. That has helped my psyche.\"","pubDate":"2023-01-28 18:40:35","image_url":"https://images.perthnow.com.au/publication/C-9587377/1a0e0e7ad85a4cc2d73499cab37aae8aa5323c2f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Gujarat Giants appoint Mithali Raj as mentor ahead of inaugural Women’s Premier League","link":"https://thenewsmill.com/2023/01/gujarat-giants-appoint-mithali-raj-as-mentor-ahead-of-inaugural-womens-premier-league/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Gujarat Giants has appointed legendary Indian batter and former captain Mithali Raj as the mentor and advisor for the side ahead of the inaugural edition of the Women’s Premier League (WPL), which will take place in March-April 2023. Over the years, Mithali’s trailblazing achievements and contributions to Indian cricket have not only earned her numerous awards and accolades but have also played a key role in bringing women’s cricket into the limelight, both on national and international platforms. As a mentor and advisor, Mithali will also promote women’s cricket and help develop the sport at the grassroots level in Gujarat. “The inaugural season of the Women’s Premier League is a fantastic move for women’s cricket and the involvement of the Adani Group is a massive boost for the sport as well,” said Mithali Raj, ex-Skipper of the Indian Women’s National Cricket Team as quoted by an Adani Sportsline. “Women’s cricket is growing steadily, and this kind of impetus will undoubtedly encourage young women to consider taking up cricket professionally. I believe that the high-impact participation of corporates will help hasten the process of eventually bringing more glory to India. This level of influence can help strengthen the sporting ecosystem and enhance opportunities for women athletes”. “Mithali Raj is a role model for the young generation and we are delighted to have such an inspirational athlete on board to mentor our women’s cricket team,” said Pranav Adani, Director of Adani Enterprises. “This is the first time the Adani Group has ventured into women’s cricket, and we are privileged to be able to promote women in sports through the inaugural Women’s Premier League. We believe that the presence of international sporting heroes like Mithali will attract new talent not just into cricket but also into every other sport and transform the professional sports ecosystem,” added Pranav. Acknowledged as one of the greatest female cricketers of all time, Mithali Raj opened her ODI career with a rare accomplishment – a century on debut. Mithali is the highest run-scorer in women’s ODIs and has scored 17 half-centuries in her T20Is. In 89 T20Is, Raj has also scored 2,364 runs at an average of 37.52, with the best score of 97. But Mithali’s best format was ODIs, in which she played 232 matches and scored 7,805 runs in 211 innings at an average of 50.68. She had seven tons and 64 fifties in the format, with best score of 125*. The highly acclaimed cricketer captained India in the 2017 Women’s ODI Cricket World Cup, where India finished runners-up. She was also part of the Indian team that made it to the semi-finals of the 2018 ICC Women’s World T20, held in the West Indies. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 18:31:30","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Ahoy Senor holds on to hand Lucinda Russell emotional Cotswold Chase win","link":"https://www.theguardian.com/sport/2023/jan/28/editeur-du-gite-edges-edwardstone-thrilling-clarence-house-chase","keywords":["Horse racing","Horse racing tips","Cheltenham","Sport"],"creator":["Greg Wood at Cheltenham"],"video_url":null,"description":"Trainer’s father Peter died this week – ‘He’d be very proud today’Editeur Du Gite surges to thrilling win in Clarence House ChaseThe “Trials Day” label on the last card at Cheltenham before the Festival might suggest it is little more than an appetiser ahead of the main event. For the connections of the big chase winners here on Saturday, however, it was a day of real significance and, for trainer Lucinda Russell, an emotional afternoon too.Russell’s father, Peter, who died this week at 95, was a co-owner of Ahoy Senor, the winner of the Grade Two Cotswold Chase, and also played a big part in launching his daughter’s training career. “He loved this horse and really wanted him to do well,” she said. “It was Dad that set me up and gave me the desire and determination. He’d be very proud today. Continue reading...","content":"The “Trials Day” label on the last card at Cheltenham before the Festival might suggest it is little more than an appetiser ahead of the main event. For the connections of the big chase winners here on Saturday, however, it was a day of real significance and, for trainer Lucinda Russell, an emotional afternoon too. Russell’s father, Peter, who died this week at 95, was a co-owner of Ahoy Senor, the winner of the Grade Two Cotswold Chase, and also played a big part in launching his daughter’s training career. “He loved this horse and really wanted him to do well,” she said. “It was Dad that set me up and gave me the desire and determination. He’d be very proud today. Talking Horses: Fugitif can steal big prize on Cheltenham Trials day Read more “As he went on in his life, the racing meant a lot to him and he would always phone me before and after the races. I’ll miss that intensely.” Ahoy Senor was a leading novice over fences last season, rounding off his campaign with a Grade One win at Aintree in April, but was also prone to losing his confidence after a mistake, particularly in the latter stages of races. That continued in his first three starts this term, but he was far more assured this time, overcoming a slight error at the last to battle to a one-and-a-half length defeat of Sounds Russian with the market leaders, Protektorat and Noble Yeats, the 2022 Grand National winner, fourth and third respectively. “He’s always been good, but he just had to learn about it and I think he came of age today,” Russell said, while her partner, the former champion jockey, Peter Scudamore, reached for a cricketing analogy. “I’ve said he’s the best horse we’ve ever trained,” Scudamore said. “Then you begin to doubt yourself, but things eventually come right in the end and that’s what sport is about. When he gets it right, he is like Ian Botham, when he gets it wrong, he can be back in the pavilion for 10.” Ahoy Senor was cut to around 12-1 for the Gold Cup in March while Noble Yeats, who would be the first horse to win the Grand National and Gold Cup in that order, is 8-1 for the Festival’s showpiece having stayed on well in the closing stages, over a trip a furlong shorter than the Gold Cup. It proved to be a significant afternoon for Niall Houlihan, a conditional rider at Gary Moore’s Sussex stable, as he recorded the first Grade One success of his career aboard Editeur Du Gite in the Clarence House Chase, which was added to the card after Ascot’s meeting last Saturday succumbed to the weather. Editeur Du Gite was not among the declarations for the race seven days ago, but Moore felt it was worth paying £2,250 to add him to a field that included Energumene and Edwardstone, the winners of last season’s Champion Chase and Arkle Trophy respectively. His gamble was richly rewarded as the 14-1 shot responded strongly to Houlihan’s urging and edged past Edwardstone in the final strides, after being passed on the run-in. Energumene, the 4-9 favourite, was third, with Willie Mullins, his trainer, suggesting the new white marker boards on the fences may have unsettled his runner. “It is unreal really,” Houlihan said. “The horse tries so hard for you. Every time a horse came to me, he stuck his neck out, especially when he got headed after the last. It is brilliant that they put the faith in me on a horse like him and to pull it off is great.” Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. Quick Guide Greg Wood's Sunday tips Show Sedgefield 12.50 Aubis Walk 1.25 Twoshotsoftequila (nb) 2.00 Ashington 2.35 Nero Rock 3.10 Basford 3.45 Skyhill 4.20 Silkstone Fontwell 1.05 Firestream 1.40 Unit Sixtyfour 2.15 Concrete King (nap) 2.50 Coolvalla 3.25 Our Champ 4.00 Art Decco 4.35 Film D’Action Southwell 1.15 Get Prepared 1.50 Monte Igueldo 2.25 Doc McCoy 3.00 Strong Leader 3.35 Richhill 4.10 Shallow River Was this helpful? Thank you for your feedback. Editeur Du Gite is top-priced at 13-2 for the Champion Chase on 15 March, behind Energumene and Edwardstone at 3-1 and Blue Lord, on 9-2. Gold Tweet (14-1) was another surprise winner in the Grade Two Cleeve Hurdle, but there was little sign of fluke as he went clear of Dashel Drasher and Paisley Park, a former Stayers’ Hurdle winner, to become the first French-trained winner on Trials day for 18 years. Gabriel Leenders, his trainer, will now consider a supplementary entry for the Stayers’ Hurdle in March. “It’s expensive and we are not rich,” he said, “but it would be a dream to come here in March.”","pubDate":"2023-01-28 18:17:06","image_url":"https://i.guim.co.uk/img/media/410b18ffbceeb1a9887fae4b707a9044f02e2652/0_202_4896_2938/master/4896.jpg?width=460&quality=85&auto=format&fit=max&s=6143f9a9a2ec0a5f02bea39acfec8b4f","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Marizanne Kapp on significance of winning tri-series battles against India: “You want that bit of momentum when you go into a T20 World Cup”","link":"https://www.sportskeeda.com/cricket/news-marizanne-kapp-significance-winning-tri-series-battles-india-you-want-bit-momentum-go-t20-world-cup?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Seasoned South African all-rounder Marizanne Kapp has stated that winning the upcoming matches against India in the ongoing Women’s T20I Tri-Series in East London will be a ‘major boost’ for her team, keeping the T20 World Cup 2023 in mind. South Africa will take on India in the fifth match of the tri-series at Buffalo Park in East London on Saturday, January 28. With West Indies being knocked out of the tournament, the same two teams will once again meet in the final on February 2. Sharing her views on the importance of South Africa ’s upcoming battles against India, Kapp said ahead of Saturday’s match: South Africa went down to India by 27 runs in the tri-series opener. The Indians came up with a terrific bowling performance to restrict South Africa to 120/9, defending a total of 147. In subsequent matches, South Africa have got the better of West Indies by 44 runs and 10 wickets respectively. Reflecting on the challenge of facing India for the second time, Kapp admitted that facing spin bowling is not easy given the surfaces on offer. She explained: India stifled South Africa with spin when the two teams met in the first match of the tri-series. Deepti Sharma claimed 3/30, Devika Vaidya 2/19, while Rajeshwari Gayakwad, Sneh Rana and Radha Yadav claimed one scalp each. Speaking of her individual performances, Kapp has scored 22 and 52, apart from claiming one wicket. South Africa will depend on her to deliver with both bat and ball against India. The confident 33-year-old stated: Kapp has played 87 T20Is for South Africa, scoring 1120 runs. She has also claimed 67 wickets with her medium pace. Get IND vs NZ Live Cricket Score , 1st T20 at Sportskeeda. Follow us for the latest cricket Updates. Poll : 0 votes Quick Links","pubDate":"2023-01-28 17:54:43","image_url":"https://static.sportskeeda.com/editor/2023/01/c4759-16749088068151-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Neeraj Chopra meets U-19 India women’s team before their final against England on Sunday","link":"https://indianexpress.com/article/sports/cricket/neeraj-chopra-meets-u-19-india-womens-team-before-their-final-against-england-8410072/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Olympic gold medal winning javelin thrower Neeraj Chopra on Saturday met the Indian contingent on the eve of their U19 T20 Women’s World Cup final against England on Sunday, a post shared by the BCCI revealed. The post which was captioned, “A Gold-standard meeting! 👏👏 Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final!” showed the superstar javelin thrower in various moods as he interacted with the U-19 team. On Sunday, India captain Shafali Verma will chase history when she leads India against England in the first-ever ICC U-19 Women’s T20 World Cup final. For all their success at the international stage, the Indian women’s cricket team has never won a World Cup at any level and the young batter, who has been part of two World Cup and one Commonwealth Games final with the senior team, will look to bring the elusive title home. A Gold-standard meeting! 👏👏 Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final! 👍 👍 pic.twitter.com/TxL5afL2FT — BCCI (@BCCI) January 28, 2023 The seniors have made the World Cup final on three occasions across formats only to have returned with bitter memories — losing to Australia by 98 runs in 2005 and losing to England by 9 runs in 2017 in the ODIs, and in T20Is they went down in the 2020 final to the Aussies by 85 runs. In the U-19 World Cup semifinal, India registered a dominating eight-wicket win after their bowlers restricted a powerful New Zealand side to an under-par 107/9. Leg-spinner Parshavi Chopra led the bowling show by claiming 3/20, while Shafali went for just seven runs in her four overs, taking one wicket. In reply, a ruthless half-century from the opening batter and the tournament’s leading scorer, Shweta Sehrawat, saw India home. Neeraj Chopra, meanwhile, has set himself a target in the new year which is to breach the 90-metre mark with his javelin. “In this new year, I hope I will put an end to this question,” Chopra had said in a video interaction from England earlier this month. Subscriber Only Stories View All The K Arun Prakash Interview: ‘My style is to highlight the composition a... At international checkpoint, online system helps vehicles cross over sea... Experts say Adani Group stock sell-off may not affect market, but deepens... Delhi Confidential: Lok Sabha Speaker wants MPs to learn lessons from Pad... Apply New Year promo code SD25 After the historic gold in Tokyo, the 24-year-old Olympic champion javelin thrower has continued to raise expectations with a silver at the World Championships, before adding another feather in his cap by winning the Diamond League Finals gold.","pubDate":"2023-01-28 17:35:23","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Neeraj Chopra interacts with Team India ahead of Women’s T20 World Cup final","link":"https://thenewsmill.com/2023/01/neeraj-chopra-interacts-with-team-india-ahead-of-womens-t20-world-cup-final/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Star India javelin thrower and Olympic medalist Neeraj Chopra interacted with the national women’s under-19 cricket team ahead of the final of the ICC Women’s U19 T20 World Cup clash against England. India will take on England in the final of the ICC Women’s Under 19 T20 World Cup on Sunday. The Board of Control for Cricket in India (BCCI) took to Twitter to share some pictures of the interaction. “A Gold-standard meeting! Javelin thrower & Olympic Gold medallist @Neeraj_chopra1 interacted with #TeamIndia ahead of the #U19T20WorldCup Final!,” tweeted BCCI. Notably, ahead of her side’s final of the ICC Women’s Under 19 World Cup final against England, Indian skipper Shafali Verma said that the side is extremely excited to play the summit clash and she has shared her experiences of playing finals major tournaments at senior level with them. Shafali is the third-highest run-scorer in the tournament, having scored 157 runs at an average of 26.16, with one half-century and a strike rate of 201.28. “The feeling among the team is great. We have done whatever plans we had in our nets session. Everyone is aware of their roles and what they need to do for tomorrow’s game. Everyone’s excited to be playing in the final. We are going to back each other in the final and are going to enjoy it, give our 100 per cent,” said Shafali in a post-match press conference. “I have played a lot of finals, like the T20 World Cup 2020 final and the final of the Commonwealth Games tournament. I told them to enjoy their game and not think that it is a final. But at the same time, they have to give their 100 per cent. The team does not need to stress itself out, because if you do so, the match itself will be stressful. They should have belief in themselves,” added Shafali. Shafali said that a lot of team members, including herself had seen the second semifinal between Australia and England, which saw England defend the target of 100 runs after being bundled out for just 99 and win the game by three runs. Australia was bundled out for 96 runs. “It was a good game. We have seen England, how they play, how they bat. We have our strategies and are going to execute them,” he added. The skipper said that winning the trophy would mean a lot for her as a captain. “My father used to tell me that you have to win the U19 title. I will remember these things. I have told everyone to enjoy the game and that we are one as a unit. I am trying to keep my teammates comfortable,” added Shafali. Also, 2022 was an amazing year for Neeraj, though he missed out on Commonwealth Games 2022 due to an injury. In June, he made new national record and finished with a silver medal with a throw of 89.30 metres at the Paavo Nurmi Games in Finland, bettering his own previous national record of 88.07 meters which he had set in Patiala in March last year. In June again, he gave another sterling performance as he clinched gold in the 2022 Kuortane Games in Finland. Neeraj threw 86.69 m to clinch the top prize in tricky and wet conditions. At the World Athletics Championships in July, Neeraj Chopra made history by becoming only the second Indian and the first male track and field athlete to take home a medal. He finished second and won the silver medal, realising his aim of winning a World medal with a throw of 88.13 metres. Anju Bobby George won a bronze medal for India in the long jump competition before Neeraj. In September, Chopra made history by becoming the first-ever Indian to win the prestigious Diamond League trophy, a top-tier athletics competition, achieving the best throw of 88.44 m to clinch one of the biggest wins of his career. He now holds the male javelin record thanks to a throw in the Stockholm Diamond League that measured 89.94 metres, with which he broke his own record. He clinched a silver medal at the prestigious Diamond League meet in Stockholm and broke his own previous record. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 17:31:25","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Jacques Kallis, Brett Lee, Ross Taylor confirm participation for LLC Masters","link":"https://thenewsmill.com/2023/01/jacques-kallis-brett-lee-ross-taylor-confirm-participation-for-llc-masters/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Legendary South African all-rounder Jacques Kallis, former New Zealand batter Ross Taylor, Australian pace great Brett Lee and former Bangladesh spinner Abdur Razzak have confirmed their participation for the LLC Masters, announced the Legends League Cricket on Saturday. LLC Masters will be played in Qatar from February 27 to Match 8. The list of confirmed players includes Shane Watson, Upul Tharanga, Albie Morkel, Kevin O’Brien, Shoaib Akhtar, Chris Gayle and S Sreesanth. Jacques Kallis said, “It has been amazing experience to play with the legends of the game in India. I am hoping to enjoy the game in Qatar as well.” Ross Taylor said, “I thoroughly enjoyed season two and happy to be part of the winning team. Look forward to playing in LLC Masters.” Brett Lee commented, “Having played both seasons, I am excited to play some really competitive cricket in Legends League Cricket. I look forward to performing well for my team at LLC Masters.” Abdur Razzak said, “I am looking forward to play in LLC Masters, I am following some of the legends in LLC and I am happy to play with them.” Raman Raheja, Co-Founder & CEO, of Legends League Cricket, said, “The excitement is building towards LLC Masters with so many players coming forward to participate. Legends League Cricket is already one of the most respected, followed and watched senior leagues in the World. With LLC Masters, we would definitely retain our position with so much serious and competitive cricket.” (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-28 17:31:19","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}