{"newsArray":[{"title":"Atlet Kriket Bali Diharapkan Bisa Terus Berkembang","link":"https://sport.detik.com/sport-lain/d-6046666/atlet-kriket-bali-diharapkan-bisa-terus-berkembang","keywords":null,"creator":null,"video_url":null,"description":"Prestasi gemilang ditorehkan tim Cricket putra Papua, yakni tim Cendrawasih. Mereka sukses menyabet gelar juara dalam Bali Internasional Cricket Sixes 25 tahun.","content":"Prestasi gemilang ditorehkan tim Cricket putra Papua, yakni tim Cendrawasih. Mereka sukses menyabet gelar juara dalam Bali Internasional Cricket Sixes 25 tahun.","pubDate":"2022-04-23 00:15:24","image_url":null,"source_id":"detik","country":["indonesia"],"category":["sports"],"language":"indonesian"},{"title":"DC vs RR yesterday match highlights: Rishabh Pant controversy highlights around no ball in Delhi vs Rajasthan 2022 IPL match","link":"https://thesportsrush.com/cricket-news-dc-vs-rr-yesterday-match-highlights-rishabh-pant-controversy-highlights-around-no-ball-in-delhi-vs-rajasthan-2022-ipl-match/","keywords":["Cricket","Delhi Capitals","IPL 2022","Rajasthan Royals","DC","Indian Premier League","rajasthan royals","rishabh pant","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"DC vs RR yesterday match highlights: Indian Premier League 2022 Match 34 witnessed a player and an assistant coach going overboard. In spite of batters scoring 429 runs and bowlers picking 10 wickets, the recently concluded 34th Indian Premier League 2022 match will be remembered for Delhi Capitals captain Rishabh Pant and assistant coach Pravin… The post DC vs RR yesterday match highlights: Rishabh Pant controversy highlights around no ball in Delhi vs Rajasthan 2022 IPL match appeared first on The SportsRush.","content":"DC vs RR yesterday match highlights: Indian Premier League 2022 Match 34 witnessed a player and an assistant coach going overboard. In spite of batters scoring 429 runs and bowlers picking 10 wickets, the recently concluded 34th Indian Premier League 2022 match will be remembered for Delhi Capitals captain Rishabh Pant and assistant coach Pravin Amre’s public disapproval of on-field umpire’s decision to not convert a waist-height full toss into a no-ball. Delhi batter Rovman Powell appeared to have lost out on a badly needed six-hitting momentum due to an elongated halt at the Wankhede Stadium tonight. Needing 36 runs to win off six deliveries to seal a 223-run chase, Powell had hit three sixes in a row only to be interrupted by his own captain and a member of the support staff. As a result, Rajasthan Royals fast bowler Obed McCoy managed to contain the batter to give away only a couple of runs off the last three balls to register a 15-run victory. While McCoy’s teammate Prasidh Krishna emerged as a star whilst successfully defending a total, opening batter Jos Buttler scoring his third century of the ongoing 15th season of the IPL put Rajasthan in a commendable position after Pant invited them to bat first. DC vs RR yesterday match highlights An archetype dramatic turn of events were accompanied by a lot of severity as Pant was visibly asking Powell and non-striker Kuldeep Yadav to forfeit the match due to a decision not going in their favour. Had it not been for another assistant coach at DC in Shane Watson’s words to Pant, the matter was likely to be extended especially after Amre entered the playing area to argue with the umpire with respect to the decision. Bad sportsman spirit on display by #DelhiCapitals Cricket is a game of gentlemen and this behaviour is completely unacceptable. #IPL20222 #DCvsRR — Mohammed Azharuddin (@azharflicks) April 22, 2022 In what was Capitals’ fourth IPL 2022 loss, they are still at the sixth position on the points table waiting for a turnaround in the second half of the league phase. Royals, on the other hand, have reached to the top of the points table on the back of winning five and losing two out of their seven matches thus far. You can watch the highlights of this match by clicking here. The post DC vs RR yesterday match highlights: Rishabh Pant controversy highlights around no ball in Delhi vs Rajasthan 2022 IPL match appeared first on The SportsRush.","pubDate":"2022-04-22 21:14:50","full_description":"DC vs RR yesterday match highlights: Indian Premier League 2022 Match 34 witnessed a player and an assistant coach going overboard. In spite of batters scoring 429 runs and bowlers picking 10 wickets, the recently concluded 34th Indian Premier League 2022 match will be remembered for Delhi Capitals captain Rishabh Pant and assistant coach Pravin Amre’s public disapproval of on-field umpire’s decision to not convert a waist-height full toss into a no-ball. Delhi batter Rovman Powell appeared to have lost out on a badly needed six-hitting momentum due to an elongated halt at the Wankhede Stadium tonight. Needing 36 runs to win off six deliveries to seal a 223-run chase, Powell had hit three sixes in a row only to be interrupted by his own captain and a member of the support staff. As a result, Rajasthan Royals fast bowler Obed McCoy managed to contain the batter to give away only a couple of runs off the last three balls to register a 15-run victory. While McCoy’s teammate Prasidh Krishna emerged as a star whilst successfully defending a total , opening batter Jos Buttler scoring his third century of the ongoing 15th season of the IPL put Rajasthan in a commendable position after Pant invited them to bat first. An archetype dramatic turn of events were accompanied by a lot of severity as Pant was visibly asking Powell and non-striker Kuldeep Yadav to forfeit the match due to a decision not going in their favour. Had it not been for another assistant coach at DC in Shane Watson’s words to Pant, the matter was likely to be extended especially after Amre entered the playing area to argue with the umpire with respect to the decision. Bad sportsman spirit on display by #DelhiCapitals Cricket is a game of gentlemen and this behaviour is completely unacceptable. #IPL20222 #DCvsRR — Mohammed Azharuddin (@azharflicks) April 22, 2022 In what was Capitals’ fourth IPL 2022 loss, they are still at the sixth position on the points table waiting for a turnaround in the second half of the league phase. Royals, on the other hand, have reached to the top of the points table on the back of winning five and losing two out of their seven matches thus far. You can watch the highlights of this match by clicking here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Wicket maiden over meaning in cricket: Prasidh Krishna price in IPL 2022","link":"https://thesportsrush.com/cricket-news-wicket-maiden-over-meaning-in-cricket-prasidh-krishna-price-in-ipl-2022/","keywords":["Cricket","Delhi Capitals","IPL 2022","Rajasthan Royals","DC","Indian Premier League","Prasidh Krishna","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Prasidh Krishna price in IPL 2022: The fast bowler from Rajasthan Royals bowled a game-changing penultimate over of the match. It is quite unfair on Rajasthan Royals fast bowler Prasidh Krishna for not many are discussing his game-changing penultimate over of the match against Delhi Capitals at the Wankhede Stadium. With Delhi needing 36 runs… The post Wicket maiden over meaning in cricket: Prasidh Krishna price in IPL 2022 appeared first on The SportsRush.","content":"Prasidh Krishna price in IPL 2022: The fast bowler from Rajasthan Royals bowled a game-changing penultimate over of the match. It is quite unfair on Rajasthan Royals fast bowler Prasidh Krishna for not many are discussing his game-changing penultimate over of the match against Delhi Capitals at the Wankhede Stadium. With Delhi needing 36 runs to win the match in two overs, Krishna bowled a sensational wicket maiden to force the opposition in requiring to hit six sixes in an over for the first time in the history of Indian Premier League to win the match. However, the 26-year old player isn’t being credited enough for a 15-run victory primarily due to Capitals captain Rishabh Pant and assistant coach Pravin Amre hogging limelight on the back of an animated protest for a no-ball. Bowling to a well-set Lalit Yadav (37), Krishna was fortunate enough to witness the batter altogether missing a full-toss first up. Krishna pumping serious pace resulted in Yadav missing the second delivery as well as no contact with the ball put more pressure on him. On the next delivery, Yadav’s wild swing against a wide delivery saw him edging the ball to Rajasthan captain Sanju Samson behind the wickets. Krishna, who had picked bowling figures of 3-0-22-2 before his final over, managed to bowl three consecutive dot balls to Kuldeep Yadav as well to end up with figures of 4-1-22-2. While a maiden over in a T20 match is a rare achievement in itself, Krishna bowling a wicket maiden (an over without any run and a wicket) in the 19th over of a high-scoring contest speaks highly about his performance on Friday. Prasidh Krishna price in IPL 2022 Krishna, who made his IPL debut for Kolkata Knight Riders in 2018, had represented them for four seasons before being released by the franchise ahead of IPL 2022 mega auction. In this last over kerfuffle let’s not forget that Prasidh Krishna bowled a wicket maiden in the 19th over! #DCvsRR — Gaurav Kapur (@gauravkapur) April 22, 2022 Registered for INR 1 crore in the auction, Krishna had initiated a fierce bidding competition between Royals and Lucknow Super Giants only to see the former acquiring his services for a whopping INR 10 crore. The post Wicket maiden over meaning in cricket: Prasidh Krishna price in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-22 20:29:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PLO vs PLE Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECS Bulgaria 2022, Eliminator","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/plo-vs-ple-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ecs-bulgaria-2022-eliminator?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-22 19:10:01","image_url":"https://static.sportskeeda.com/editor/2022/04/e841c-16506497805844-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Sachin went ballistic over the prawns’: Sydney restaurant icon and cricket tragic dies","link":"https://www.theage.com.au/sport/cricket/sachin-went-ballistic-over-the-prawns-sydney-restaurant-icon-and-cricket-tragic-dies-20220422-p5afi9.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Surjit Gujral was known by Australian and international cricketers for the brilliant hospitality at his Annandale restaurant.","content":null,"pubDate":"2022-04-22 19:00:00","full_description":"One of Sydney’s most iconic Indian restaurant owners who catered for some of world cricket’s biggest stars – including Sachin Tendulkar – has been remembered as a generous man whose passion for the game was unparalleled. Surjit Gujral, the much-loved figure who ran the institution that is Surjit’s Indian Restaurant on Parramatta Road in Annandale, passed away on Wednesday. He was 67. Surjit Gujral has passed away. Hundreds of cricketers and Sydney food lovers have paid their respects to the Gujral family and in particular son Rasan, who is also a key figure in the family business. Gujral considered Imran Khan, Steve Waugh, Shane Warne and Ricky Ponting his friends. “My dad was everything to me,” said Rasan. “When Dad started [his Strathfield restaurant in 1985], it was one of the first iconic restaurants in Sydney. “His first passion was food and his second passion was cricket. It wasn’t just A-listers, his customers were his friends. Our restaurant was our temple, church and mosque.” Surjit Gujral with Steve Waugh. Gujral, who migrated from Chandigarh, Punjab, in 1980, was a huge supporter of junior, elite, shires and grade cricket. He sponsored many cricketers. Australian and international cricketers have ventured to Surjit’s for decades, with the Waugh brothers, Brett Lee, Michael Clarke and Greg Chappell all regulars at the restaurant, which has become synonymous with the Sydney University Cricket Club as a sponsor since the late 1990s. Gujral even named a bar in his CBD restaurant after Steve Waugh, who has celebrated birthdays at the highly rated eatery. “He was an extremely generous guy,” Waugh told the Herald . “I went to his original restaurant in Strathfield many years ago. He became a really good friend from that moment. He always refused to take any money when he hosted. Just a very generous person who loves cricket. He was really well-loved in the cricket community. Surjit Gujral at his restaurant. “Tandoori fish was my favourite in Annandale. It was beautiful. A lot of touring Indian [and Pakistan] sides would go to his restaurant and he used to cater for them. He knew most of the [Australian] team and most had been there at some stage. It’s another sad loss for the game.” Gujral would also provide meals for touring Test teams but in late 1999, the entire Indian squad were brought along by former Australian captain and coach Bob Simpson during a four-day match against NSW. Cricketing royalty walked in the door and loved every minute. “Sachin [Tendulkar] said he will be back with his wife and children when he’s next in town,” Gujral was quoted as saying at the time in the Herald . “He loves my tandoori prawns. Best he has ever had, he says.” Rasan adds: “There was a big photo with the headline ‘Sachin Tandoori’ in the paper because Sachin went ballistic over the prawns dad made him.” Esteemed batting coach and close friend Neil D’Costa had an Indian Bollywood party put on for him by Gujral at his city restaurant. In attendance were Anthony Mundine, Sonny Bill Williams, Phillip Hughes and Mitchell Starc. “It was a cracking party,” D’Costa said. “Our community deserves to know about his contributions to cricket. He always presented himself so impeccably. He was a very proud Australian and a very proud Indian. To serve you food you were going to enjoy was his No.1 priority. “Bishen Bedi would stay at his house. So too Wasim Akram. Indian, Sri Lankan and Pakistani Test cricketers, he entertained them all. They always went to his restaurant to eat.” The Sydney University Cricket Club posted a tribute on its website on Friday. “Surjit was a generous host, a benefactor and passionate about the game. He was a man who will be greatly missed by this club and the broader SUCC community.” Rasan says he hopes he can continue his father’s legacy. “I’m scared of how I’m going to fill those big shoes,” Rasan said. “I’ve been doing it with him for 20 years. I promise I’ll do my best.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Waist height no ball rules in cricket: Was it a no ball when Rishabh Pant asked Rovman Powell to forfeit Delhi vs Rajasthan IPL 2022 match?","link":"https://thesportsrush.com/cricket-news-waist-height-no-ball-rules-in-cricket-was-it-a-no-ball-when-rishabh-pant-asked-rovman-powell-to-forfeit-delhi-vs-rajasthan-ipl-2022-match/","keywords":["Cricket","Delhi Capitals","IPL 2022","Rajasthan Royals"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Was it a no ball: A debate around a potential no-ball resulted in extreme flow of emotions at the Wankhede Stadium. During the 34th match of the ongoing 15th season of the Indian Premier League between Delhi Capitals and Rajasthan Royals at the Wankhede Stadium, a lot of drama unfolded in the last over after… The post Waist height no ball rules in cricket: Was it a no ball when Rishabh Pant asked Rovman Powell to forfeit Delhi vs Rajasthan IPL 2022 match? appeared first on The SportsRush.","content":"Was it a no ball: A debate around a potential no-ball resulted in extreme flow of emotions at the Wankhede Stadium. During the 34th match of the ongoing 15th season of the Indian Premier League between Delhi Capitals and Rajasthan Royals at the Wankhede Stadium, a lot of drama unfolded in the last over after on-field umpires didn’t give a waist-height full-toss as a no-ball. Chasing a 223-run target, Capitals needed 36 runs to win the match in the last over. Batter Rovman Powell (36*) allured bountiful interest in the match by hitting three consecutive sixes off Obed McCoy to reduce the equation to 18 runs needed off three balls. With the third delivery of the over being a full-toss, Delhi’s dugout considered it to be a no-ball. Umpires Nikhil Patwardhan and Nitin Menon not only ruling it as a fair delivery but also refusing to refer it to third umpire Yeshwant Barde irked DC captain Rishabh Pant and assistant coach Pravin Amre. As a result, an animated conversation between them led to Pant gesturing Powell and non-striker Kuldeep Yadav (0*) to return to the dugout in a bid to forfeit the match. Amre, on the other hand, ran on to the ground to argue with the umpires but only to return back empty-handed. In the meantime, Pant and Rajasthan Royals batter Jos Buttler were seen engaging in another argument near the boundary. Eventually, it was another assistant coach in Shane Watson who seemed to have calmed Pant down; letting the players continue with the match. With Powell scoring only a couple of runs on the remaining three deliveries, Capitals ended up losing the match by 15 runs as a clear change in momentum affected Powell. Was it a no ball when Rishabh Pant asked Rovman Powell to forfeit Delhi vs Rajasthan IPL 2022 match? A very close decision such as this has it in it to invite contrasting opinions. However, upon looking at the replays, it does give the impression of being a no-ball. That being said, whatever Pant or Amre did can’t be justified by any means. Irrespective of the umpires’ decision, one expects a contemporary role model in Pant and an experienced campaigner in Amre to behave in a much more dignified manner than asking their teammates to forfeit a match. So umpires check no balls for front foot every ball, but can’t check a high full toss? Makes sense… pic.twitter.com/RUOX3Yh3YF — Glenn Maxwell (@Gmaxi_32) April 22, 2022 As far as the umpires are concerned, the best possible way for them to deal with the situation would’ve been to refer it to the third umpire. In times when on-field umpires take regular assistance from the TV umpire throughout a cricket match, referring a close and potentially game-changing decision would have been fair to one and all. The post Waist height no ball rules in cricket: Was it a no ball when Rishabh Pant asked Rovman Powell to forfeit Delhi vs Rajasthan IPL 2022 match? appeared first on The SportsRush.","pubDate":"2022-04-22 18:33:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bohannon stars for Lancs; Masood dazzles for Derbyshire: county cricket – as it happened","link":"https://www.theguardian.com/sport/live/2022/apr/22/lancashire-v-gloucestershire-surrey-v-somerset-and-more-county-cricket-live","keywords":["Cricket","County Championship","County Championship Division One","County Championship Division Two","Sport"],"creator":["Tanya Aldred at Old Trafford"],"video_url":null,"description":"Look back on the day two action from around the groundsBohannon scores unbeaten 142 for Lancs against GloucsPart of the advertising hoarding blows onto the pitch and play is held up while some poor sap has to run and gather it.I’m going to put this here, just in case Bohannon doesn’t make the milestones when I’m watching. Stats courtesy of Ken Grime. When/if Bohannon reaches 46 this morning, he will have reached 2000 f-c runs. If he makes 119, he will have made 2000 f-c runs for Lancs. Continue reading...","content":null,"pubDate":"2022-04-22 18:27:29","full_description":"Lancashire ’s Josh Bohannon made an unbeaten 142 against Gloucestershire to the accompaniment of blustery winds which screamed across Old Trafford, from the rubble of the now dismantled Red Rose suite to the empty space where the party stand sometime shakes. More pertinently, perhaps, James Taylor, England selector, was watching a pugnacious innings of crisp strokes and a gritty dead bat. Bohannon, who had a breakthrough summer in 2021, scoring two hundreds and averaging over fifty in Championship cricket, spent part of the winter with the Lions, and is thought to be more than a twinkle in England’s future plans. Shan Masood’s superlative spring in a Derbyshire shirt continued against Leicestershire as he majestically strode to his second consecutive double century, pound for pound the best value signing since a wet behind the ears Jamie Vardy autographed the dotted line. Already more than half way to a thousand runs before the end of May, he is galloping towards becoming the first man to do it since Graeme Hick in 1988. Tom Abell made a career best unbeaten 150 as Somerset kicked on against Surrey at The Oval. Ollie Pope and Ben Foakes brought balance after early wickets, but both fell by stumps, Pope snaffled by an astonishing one-handed boundary catch by Tom Banton. A frolicsome century by James Vince, at less than a run a ball, kept the runs flowing for Kent against Hampshire at Canterbury; while Michael Burgess skimmed to his second tempestuous mega hundred in successive innings, as the 2021 county champions, Warwickshire , lorded it over the 2020 Bob Willis Trophy winners Essex . Middlesex built a huge lead against Glamorgan thanks to an undefeated stoical hundred from John Simpson and some entertaining pots and pan bashing from Shaheen Shah Afridi. Shaheen then dismissed Marnus Labuschagne cheaply for the second time in the match, and the middle-order crumpled. Glamorgan’s prospects look bleak; as do Sussex ’s against Worcestershire at New Road. That’s it from me for today, time for a glass of something tasty. Have a lovely evening! Canterbury Kent 305 (Bell-Drummond 149) v Hampshire 337-4 Old Trafford Lancashire 289-3 v Gloucestershire 252 all out Northampton Northamptonshire 204 all out v Yorkshire 296 and 85-1 The Oval Surrey 204-5 v Somerset 337 all out (Abell 150 no) Edgbaston Warwickshire 385 all out v Essex 168 and 0-1 Riverside Durham 230 all out v Nottinghamshire 371-3 Sophia Gardens Glamorgan 122 and 104-6 v Middlesex 336 all out Grace Road Leicestershire 213 all out v Derbyshire 437-4 New Road Worcestershire 491 (D’Oliveira 169 no) v Sussex 169-5 Bowled Parky - the slow-left arm one. Back to back double centuries in April, if you please. 91, 62, 239 and 219: 611 runs at 152.75. Grovel, grovel, cringe, bow, stoop, fall. Worship, worship, beg, kneel, sponge, crawl, etc Stumps: Lancashire 289-3. Bohannon, 142 not out, is applauded off. He raises his bat to those in the pavilion shade, whose toes no longer belong to their bodies, and his teammates basking in the Manchester sun. Somerset on top at The Ova l in a very un-Somerset way: cautious, controlled run accumulation followed by steady bowling. Foakes and Pope winkled out after a partnership of 80 - a beaut of a catch by Banton. Sam Curran 37 not out in his first match back after a long time out with a back injury. Surrey 185-5, trail by 152. Rumours that Ron Kalifa is favourite for the vacant ECB chair job, though various jars to juggle. Ron Kalifa set to be next ECB chair | The Cricketer https://t.co/6aX1LZ8Nf7 For those who are interested in such things: Jos Buttler has just made his third IPL hundred for Rajasthan Royals, 116 from 65 balls, resplendent in pink and purple. Jos Buttler's first 63 IPL innings: 0 hundreds Jos Buttler's last 8 IPL innings: 4 hundreds #IPL2022 pic.twitter.com/kQyt8SkxQ6 Warwicks have made a concussion substitute, Craig Miles, while Liam Norwell is off to hospital for a precautionary check. So this happened: Marnus Labuschagne has been dismissed 5 times out of the last 7 times he has faced Shaheen Shah Afridi in First-class cricket #CountyCricket2022 #Cricket pic.twitter.com/Pj8fQvWUwY Things looking glum for Glamorgan , 75-4, still trailing Middlesex on first innings by 134. I’m back! But so, more importantly, is Ali... Hello from Edgbaston, where my arrival was nearly so late as to be positively posthumous but thankfully just in time to see Liam Norwell retire hurt after a nasty blow to the head, Michael Burgess bring up a second successive century and play interrupted by a number of advertising hoardings being blown onto the field by a gust of wind. No news yet on Norwell, who walked off visibly dazed from a Mark Steketee bouncer that pranged him on the side of the helmet in the 100th over. Burgess was on 88 at the time - Warwickshire 280 for eight and leading by 116 runs - and for the second time in a fortnight was joined by the BFG that is Oliver Hannon-Dalby. While the No11 is in resolute form after his record 94-minute show of defiance to get off the mark against Surrey a fortnight ago, Burgess decided he’d best not assume repeat, carving four fours from Steketee’s next over, the third of which brought up three figures. Having arrived at 124 for five and still 40 runs in arrears, Burgess is now 111 not out and has since taken his side to 314 for eight in the 110th over for a lead of 146. Hannon-Dalby is 20 dot balls into his latest masterpiece. Am waiting for the big hurrah from Bohannon but must write up for early Friday deadlines. Listen for the OT roar...back soonish. Canterbury Kent 305 (Bell-Drummond 149) v Hampshire 205-3 Old Trafford Lancashire 194-2 v Gloucestershire 252 all out Northampton Northamptonshire 188-8 v Yorkshire 296 all out The Oval Surrey 118-3 v Somerset 337 all out (Abell 150 no) Edgbaston Warwickshire 261-7 v Essex 168 all out Riverside Durham 230 all out v Nottinghamshire 276-3 Sophia Gardens Glamorgan 122 all out and 16-0 v Middlesex 336 all out Grace Road Leicestershire 213 all out v Derbyshire 295-3 New Road Worcestershire 491 (D’Oliveira 169 no) v Sussex 64-2 Last year, Josh Bohannon (98 not out) made 853 Championship runs at 53.31, with two centuries. And that’s tea! He and Croft punch gloves, with much to mull over a cup of Earl Grey/rehydration squash. In Division One, Lancs are stoically battling the wind as Bohannon pounds towards three figures: 178-2. At Canterbury - neck n neck fifties for Gubbins and Vince as Hampshire hit cruise control (172-2). Two wickets for Dom Bess as Northants falter: 172-7; and Burns, Amla and Ryan Patel all out cheaply at The Oval - Pope and Foakes rebuild (again). Surrey 84-3, trail (!) Somerset by 253. Another wicket for Marnus, as Shaheen throws the bidet after the kitchen sink. Marnus gets Shaheen! 💪 Middlesex 334/9 (lead by 212) 𝗪𝗮𝘁𝗰𝗵 𝗹𝗶𝘃𝗲: https://t.co/5pYkZu6Dt1 #GLAMvMID | #GoGlam pic.twitter.com/vdidbAepqV It’s been busy, down in Division Two: : Hundreds for Ben Slater for Notts (240-3 - all three to Matthew Potts) and a stoical unbeaten 103 off 244 balls for John Simpson (Middx 334-9, a lead of 212 over Glamorgan) Only Ali Orr (who I read yesterday is Sussex’s PCA rep, at the age of 21) out for Sussex, Pujara a majestic 7 not out, Sussex 30-1. And Shan Masood over half way to 1000 runs, now 133 not out, Wayne Madsen 88 not out: Derby 255-2. Do yourself a favour and spend a minute watching Shan Masood bat 😍 pic.twitter.com/Ga3guKCBzz Some lovely words from Hassan Ali after play yesterday, following his six wickets: “It was a great moment for me and great for our team. “We made a plan to keep it simple and it succeeded. It was special for me to be bowling with the great Jimmy Anderson. I will remember coming off the ground and he was clapping me - it was a great moment for me. “I was nervous about sharing the bowling with Jimmy but he was there to support me and he was backing me. “We have a brilliant bowling attack and I’m really enjoying it. The first session wasn’t good enough for us but after that we tried to keep bowling in the right areas and we did well. “I have heard a lot about county cricket and I will try my best to get a lot of experience here - I have Jimmy here and I will speak to him and I think it is a great opportunity for me. There is a lot of talent in this group.” It would be really disheartening for Sussex to watch Worcestershire pummel towards 500 and then lose an early wicket. If you’ve found yourself suppressing a yawn while watching the Old Trafford stream, that’s because things have been slowing winding down towards a post-prandial snooze. Lancs have made 23 in 15 overs since lunch, and seven of the last nine have been maidens. To date : 91, 62, 239 and 100 in the scorebook - he needs just another 508 for 1000 before the end of May. In that time Derbyshire have games against Glamorgan,Worcester and Notts. No-one has done it since Graeme Hick in 1998, though I’m pretty sure CCLive! predicted it for David Bedingham last year, who had 567 on May 5 2021 but whose form fell away. Shan Masood, quick! S till there on 98... Ryan Higgins’ hair is Metamorphosising into Beaker’s from the Muppets, thanks to post-lunch blustery winds which scream across Old Trafford from the rubble of the now dead Red Rose suite to the empty space where the party stand sometimes lives. Luke Wells has gone, lbw to Zafar for 59, playing back, unadvisedly. George Dobell of The Cricketer reports that Wasim Khan’s new position will be announced imminently, which rules him out of the running for the ECB chair. Wasim, who was Pakistan’s cricket CEO, left in September. Wasim Khan is to take up a senior role at the ICC, ending chances of him becoming ECB chair | @GeorgeDobell1 https://t.co/Cy1PUp4YYc An Americano and a four through gully to bring Bohannon his fifty - which is handy what with James Taylor being here on England watch. Canterbury Kent 305 (Bell-Drummond 149) v Hampshire 47-1 Old Trafford Lancashire 103-1 v Gloucestershire 252 all out Northampton Northamptonshire 116-6 v Yorkshire 296 all out The Oval Surrey 14-0 v Somerset 337 all out (Abell 150 no) Edgbaston Warwickshire 148-5 v Essex 168 all out Riverside Durham 230 all out v Nottinghamshire 155-3 Sophia Gardens Glamorgan 122 all out v Middlesex 263-7 Grace Road Leicestershire 213 all out v Derbyshire 147-2 New Road Worcestershire 360-8 (D’Oliveira 149 no) v Sussex Little and large, Bohannon and Wells , walk past the mower and up the Old Trafford steps. An excellent morning’s work, Lancs 103-1. Lunchtime scores round the grounds to follow. That’s the 46 - I’m losing my powers. A ripple of applause encircles Old Trafford, congratulations Josh Bohannon. Some lunchtime reading. \"I won’t be quietened by the system any more, and I don’t care if you call me difficult. Besides, I’ve got a third passion now, and it’s the most important one: I want kids from all backgrounds to see cricket as a chance to have the time of their life.\" https://t.co/Y3OLJisbbU Somerset are all out for 337 with Tom Abell undefeated on 150 - a career best and played over seven hours. A metaphorical back-slap heading post-haste to south London care of ATL and (may I be so bold) BTL. Good morning Em Jackson! “I’ll start by saying Will Brown is an excellent CEO, I’d very much love an apartment - even as a Geordie (and not with a Kenicke related pension fund either) - at the Ashley Down Road End of Gloucestershire’s home ground in Bristol. But the English summer’s love affair with 2-3 match international class overseas players has to end although it could be adapted whereby in Division 2 there’s an “Overseas Guest County” made up of the guest-players, supported by the best Minor County side every season retrospectively (as a reward for their contribution to the Minor Counties League) perhaps? So Amir would play 2-3 games for OGC not GCCC. . . . its “back of tab packet” idea I know but how much wisdom can Amir impart in 3 games plus a bit of training? Either that or the ECB send them as and where . . . . ?” Hoping Durham can build a small lead come lunch and not lose their last wicket with the final ball of the session like yesterday.” To Division Two, where international superstars prowl: Slater and Duckett are moving things on nicely for Notts (109-1 - Slater 50. At Sophia Gardens, TRJ has been dismissed for 65 but John Simpson has a nice juicy fifty, and Middlesex a tasty three figure lead. In the least surprising news of the day, S han Masood has 63, Derbys 113-2. And Worcestershire reach 400 - Dolly still there, 122 not out. Part of the advertising hoarding blow s onto the pitch and play is held up while some poor sap has to run and gather it. I’m going to put this here, just in case Bohannon doesn’t make the milestones when I’m watching. Stats courtesy of Ken Grime. When/if Bohannon reaches 46 this morning, he will have reached 2000 f-c runs. If he makes 119, he will have made 2000 f-c runs for Lancs. Of the batsmen to have scored 2,000 runs for Lancashire only Stuart Law (55.63), John Crawley (51.13), Ashwell Prince (49.49), Mal Loye (46.68), Ernest Tyldesley (45.20), Clive Lloyd (44.94), Dane Vilas (44.83), & Mike Atherton (44.41) have a better career average than Bohannon (43.32) for Lancs. Luke Wells belting the ball gloriously at Old Trafford; while Tom Abell moves celestially towards 150 at The Oval, with Jack Leach for company;Somerset 321-7. Kent are all out for 203, Hampshire getting a bit of their own medicine from Jackson Bird. Hain and Lamb are building on Warwickshire’s early morning wobble - 112-4, just 56 behind Essex; Will Young and Emilio Gay rebuild at the County Ground: Northants 81-3. Kent are subsiding, 305-9. Six wickets for Keith Barker. Almost six degrees of Kevin Bacon : both Josh Bohannon and one of the Old Trafford umpires, Steve O’Shaughnessy, went to Harper Green High School in Bolton, where Michael Atherton’s dad was the headmaster . I’m afraid to say Has has gone, for 33. Notts 60-1. Here, Josh Bohannon, another twinkle in the selectorial eye, has raced to 17. Lancs 29-1. While Dom Sibley was out to the first ball of the day at Edgbaston, Warwickshire 90-4. Yet another Pakistan superstar graces the County Championship! Amir will arrive in time for Gloucestershire’s games against Surrey, Hampshire and Somerset. Amir previously played for Essex in 2017 and 2019 and for London Spirit in last year’s Hundred. Bohannaon has hit a four over the rope, through the picnic tables, between the metal gate and under a car. Even the finest racehorses need a bit of rubbing down. After spending the second half of the winter on the sidelines, omitted from England’s West Indies tour, James Anderson rolled up to Old Trafford for Lancashire ’s second match of the season. He was as lithe as ever, a 39-year-old without a sign of middle age. But for one reason or another – the unaccustomed Manchester sunshine, the brisk breeze that rustled across the ground, causing spectators to pull up their gloves – he went wicketless. His first seven overs went for 21 runs; his next nine for just nine. Perhaps he pitched a little short, a little wide at times, perhaps the toast just landed butter side down. Gloucestershire had spent the morning spreading Lancashire’s international attack of Anderson, Hasan Ali, Saqib Mahmood and Matt Parkinson around the ground, the only batting team in the entire Championship not to lose a wicket in the morning session. They then contrived to lose six between lunch and tea as Mahmood got reward for his accuracy, and Hasan Ali, whose celebrations deserve to be immortalised on the stage, bowled superbly, finishing the day with six wickets. Another Pakistan international cut a dash, this time Shaheen Shah Afridi on his Middlesex debut against Glamorgan , on a day when 16 wickets fell at Sophia Gardens. He finished with three for 35, bowling a bewildered Marnus Labuschagne with a humdinger. Daniel Bell-Drummond made 149 as Kent inched towards 300 against Hampshire , Zak Crawley out for seven after dancing unadvisedly towards Mohammad Abbas. Essex collapsed from 98 for two to 168 all out on a good batting track at Edgbaston, a day made worse when Dan Lawrence limped off towards the end clutching his hamstring. Tom Westley had been the last Essex man out for 80. Warwickshire were 76 for two at the close, with Alex Davies out for an archetypal bish, bang, swish on his Warwickshire debut; Dom Sibley survived until stumps. At the County Ground, there were more runs for Dawid Malan and Harry Brook, who together put on 131, but the Sri Lanka Test captain, Dimuth Karunaratne, was dismissed cheaply. Gareth Berg proved a tricky prospect, finishing with five for 58. Yorkshire ’s Jordan Thompson then took two quick Northamptonshire wickets before stumps. At the Riverside, Liam Patterson-White snaffled five wickets as Durham struggled to 230. Haseeb Hameed was not out on 23 for Nottinghamshire at the close. Sam Conners took four wickets for Derbyshire in the East Midlands derby against Leicestershire, who were dismissed for 213. Brett D’Oliveira’s golden touch since being made Worcestershire captain continued with his second century in two games. Dropped on 19, he made Sussex pay, blossoming through the day. The leading wicket-taker for Sussex – whose injury list includes winter signing Steven Finn and Ollie Robinson, out with a tooth infection – was the captain and opening batsman, Tom Haines. Gorgeous: You need not be a person of faith, only a person in possession of a soul, to find the adhan call to prayer reverberating around the @HomeOfCricket Long Room spine-tingling. A beautiful moment. pic.twitter.com/PGN2EsksOC Canterbury Kent 271-7 (Bell-Drummond 149) v Hampshire Old Trafford Lancashire 11-1 v Gloucestershire 252 all out Northampton Northamptonshire 26-2 v Yorkshire 296 all out The Oval Surrey v Somerset 283-6 (Abell 121 no) Edgbaston Warwickshire 76-2 v Essex 168 all out Riverside Durham 230 all out v Nottinghamshire 50-0 Sophia Gardens Glamorgan 122 all out v Middlesex 171-6 Grace Road Leicestershire 213 all out v Derbyshire 36-1 New Road Worcestershire 338-5 (D’Oliveira 106 no) v Sussex Good morning and welcome to day two of round three ! It’s a blustery sort of day in the north but there is a sun, if somewhat distant and furry. Lots to look forward to today - a chance to see if Lancashire can do better than a ridiculous late-afternoon run out; a statement-score for Dom Sibley; the scent of victory for Yorkshire; unaccustomed bounty for Somerset; while Darren Stevens is not out. In Division Two, Durham have work to do while Glamorgan need quick wickets. Shan Masood is not out at Derby and Sussex must keep on keeping on, probably till a Worcestershire declaration.","image_url":"https://i.guim.co.uk/img/media/aaab21a61ddcb81ee5bb3aa8df033874e658b83e/0_0_3423_2054/master/3423.jpg?width=460&quality=85&auto=format&fit=max&s=e9aaddfb2d61c53b762ecef43e26da89","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Highlights, Tata IPL 2022 DC vs RR, Full Cricket Score: RR survive late scare to beat DC by 15 runs - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLXRhdGEtaXBsLTIwMjItZGMtdnMtcnItZnVsbC1jcmlja2V0LXNjb3JlLXJyLXN1cnZpdmUtbGF0ZS1zY2FyZS10by1iZWF0LWRjLWJ5LTE1LXJ1bnMtMTA1ODMxMTEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, Tata IPL 2022 DC vs RR, Full Cricket Score: RR survive late scare to beat DC by 15 runs  FirstpostIPL 2022, DC vs RR Live Score Updates: Rajasthan win by 15 runs  The Indian ExpressLive match blog - Royals vs Capitals 34th Match 2022 - Cricket Insights  ESPNcricinfoDC vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorYuzvendra Chahal or Kuldeep Yadav? Former Australia opener picks winner in battle of wrist-spinners  WIONView Full coverage on Google News","content":null,"pubDate":"2022-04-22 18:23:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 DC vs RR Live Cricket Score and Update: RR survive late scare to beat DC by 15 runs - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMi1AFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9kYy12cy1yci1saXZlLWNyaWNrZXQtc2NvcmUtdGF0YS1pcGwtMjAyMi1tYXRjaC1zY29yZWNhcmQtbGl2ZS11cGRhdGUtZGVsaGktY2FwaXRhbHMtdnMtcmFqYXN0aGFuLXJveWFscy1pbmRpYW4tcHJlbWllci1sZWFndWUtbGl2ZS1zdHJlYW1pbmctdG9kYXktMTA1ODMxMTEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tata IPL 2022 DC vs RR Live Cricket Score and Update: RR survive late scare to beat DC by 15 runs  FirstpostIPL 2022, DC vs RR Live Score Updates: Rajasthan win by 15 runs  The Indian ExpressDC vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorDC vs RR, IPL 2022 stats: head-to-head record, players to watch out for  SportstarYuzvendra Chahal or Kuldeep Yadav? Former Australia opener picks winner in battle of wrist-spinners  WIONView Full coverage on Google News","content":null,"pubDate":"2022-04-22 18:03:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"A DRS defence for Boris Johnson? That’s simply not cricket, Jacob Rees-Mogg","link":"https://ca.sports.yahoo.com/news/drs-defence-boris-johnson-simply-162717145.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-22 16:27:17","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 DC vs RR Live Cricket Score and Update: Jos Buttler's blazing 116 helps RR post 222/2","link":"https://www.firstpost.com/firstcricket/sports-news/dc-vs-rr-live-cricket-score-tata-ipl-2022-match-scorecard-live-update-delhi-capitals-vs-rajasthan-royals-indian-premier-league-live-streaming-today-10583111.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Tata IPL 2022 DC vs RR Live Cricket Score and Update: Jos Buttler's blazing 116 helps RR post 222/2","content":"21:50 (IST)After 2 overs,Delhi Capitals 14/0 ( Prithvi Shaw 9 , David Warner 5)Prasidh Krishna bowls from the other end. FOUR! Warner gets off the mark with a boundary, getting down on one knee and heaving a full, wide delivery over extra cover! Excellent comeback by Prasidh though, as he concedes just two singles in the next five deliveries. Six from the over.21:42 (IST)After 1 over,Delhi Capitals 8/0 ( Prithvi Shaw 8 , David Warner 0)The Delhi innings gets off to a promising start with back-to-back hits to the fence by Shaw off Boult, though the Kiwi seamer keeps things tight for the remainder of the over with four consecutive dots. Eight from the over.21:41 (IST)Trent Boult to start off with the ball in hand as Prithvi Shaw and David Warner walk out to begin Delhi's chase of the challenging 223-run target. Certainly not impossible, but will need a tremendous start from the in-form openers if they are to chase this down.  21:29 (IST)Richie Benaud would be smilling in heaven right nowRajasthan Royals 222/2 on April 22, 2022. Nice! #DCvsRR— Prasenjit Dey (@CricPrasen) April 22, 202221:28 (IST)Just one short of VK's legendary feat now! Most centuries in an IPL season:4 - Virat Kohli, 20163 - Jos Buttler, 2022*2 - Chris Gayle, 20112 - Hashim Amla, 20172 - Shane Watson, 20182 - Shikhar Dhawan, 2020/21#DCvsRR— Umang Pabari (@UPStatsman) April 22, 202221:24 (IST)After 20 overs,Rajasthan Royals 222/2 ( Sanju Samson (C) (W) 46 , Shimron Hetmyer 1)Thakur returning for the first time since the powerplay, starts off with a wide, with Samson collecting a brace and a four off the next two. Another wide off the third, followed by a couple of singles. Thick outside edge off Samson’s bat in the penultimate delivery results in the ball going all the way to the third man fence for a four. Thakur bowls a juicy full toss to Samson in the last delivery and the RR captain promptly smacks it over the square leg fence to end the innings with a maximum. Rajasthan set Delhi a humongous 223 to win after being asked to bat!21:19 (IST)After 19 overs,Rajasthan Royals 202/2 ( Sanju Samson (C) (W) 29 , Shimron Hetmyer 0)Buttler starts off with a four and a six off consecutive balls — sweeping Mustafizur behind square before just about clearing the man at long off. Fizz does well to restrict Buttler and Samson to just a single off the next two. Excellent piece of fielding by Powell at the straight boundary to save a couple of runs for the Capitals. Fizz finally gets Buttler in the last ball as the latter holes out to Warner at long on to depart for 116.21:19 (IST)OUT! Buttler's magnificent knock FINALLY comes to an end as he holes out to David Warner at long on while looking for his tenth maximum of the innings. Mustafizur with the breakthrough, collecting just the second wicket of the innings. RR 202/2Buttler c Warner b Mustafizur 116(65)21:09 (IST)After 18 overs,Rajasthan Royals 188/1 ( Jos Buttler 103 , Sanju Samson (C) (W) 28)OUCH! Samson looks to play a ramp towards the third man region, but instead ends up top-edging the ball onto his throat, the ball narrowly missing the grille of his helmet. He needs a quick look from the physio before continuing with his innings. The RR skipper looks unfazed from the blow as he collects a four and a huge six off the next two balls. An under-pressure Khaleel bowls a wide outside off in the fourth delivery. Another four and a six off consecutive deliveries for Samson, targetting the off side on both occasions. The misery concludes with Khaleel dropping a sitter off his own bowling. 21 runs and dropped catch off Khaleel’s final over of the evening as he signs off with 1/47.21:03 (IST)After 17 overs,Rajasthan Royals 167/1 ( Jos Buttler 103 , Sanju Samson (C) (W) 8)The Fizz into his third over of the evening. Keeps things fairly tidy in the over barring the third delivery, in which skipper Samson goes for a ramp that sends the ball towards the third man fence. Nine from the over. Rajasthan on course for a total in excess of 200.20:59 (IST)After 16 overs,Rajasthan Royals 158/1 ( Jos Buttler 101 , Sanju Samson (C) (W) 1)Outstanding over from Khaleel with just three runs coming off it along with the wicket of Padikkal that breaks the marathon 155-run opening stand. But the focus is firmly on Jos Buttler, who collects a brace in the penultimate delivery to bring up his third century of the season!20:57 (IST)Making it look like a cakewalk, is JosDear Jos ButtlerCan you please stop making batting look so easy, it's embarrassing for most other batters in the world.Thanks😂😂— Manya (@CSKian716) April 22, 202220:57 (IST)What an incredible turnaround by Jos the Boss! This time last year, Jos Buttler had never scored a T20 hundred. Now, he’s scored 5 in his last 24 innings - and 4 in his last 8 IPL inningsA remarkable player making the most of his incredible talents - undoubtedly the best T20 batter in the world at the moment— Matt Roller (@mroller98) April 22, 202220:56 (IST)For making batting look this ridiculously easy! Jos has a cheat code for batting 😂— Jofra Archer (@JofraArcher) April 22, 202220:56 (IST)CENTURY FOR JOS BUTTLER — HIS THIRD OF THE SEASON! What a run the English keeper-batter's having so far in IPL 2022. Brings up his third ton of the season in just 57 deliveries — his fastest ton so far this season — collecting eight fours and as many sixes along the way. RR 158/120:49 (IST)OUT! Khaleel with the breakthrough, as he traps Padikkal leg-before to bring the marathon opening stand to an end. The umpire rules it not out initially, DDP got a bit of bat on it. Pant goes for the review, and gets three reds in return. The umpire signals timeout after the wicket. RR 155/1Padikkal LBW Ahmed 54(35)20:46 (IST)After 15 overs,Rajasthan Royals 155/0 ( Jos Buttler 99 , Devdutt Padikkal 54)Buttler smashes Kuldeep for back-to-back sixes at the start of the chinaman bowler’s third over, the first one once again going past the 100-metre mark as it sails into the top tier. He then collects a four three balls later, and is one short of his third ton of the season at the end of the over. 18 off the over. Nothing’s going Delhi’s way at the moment. The opening stand too is in excess of 150 at the moment.20:44 (IST)After 14 overs,Rajasthan Royals 137/0 ( Jos Buttler 82 , Devdutt Padikkal 53)Axar replaces Mustafizur. Nine from the over, with Buttler and Padikkal collecting a boundary each, the latter bringing up his first half-century of the season in the process.20:43 (IST)FIFTY up for Devdutt Padikkal as he bounces back to form with his first half-century of the season, bringing up the milestone in just 31 deliveries — five less than what Buttler needed earlier today. RR 137/020:41 (IST)After 13 overs,Rajasthan Royals 128/0 ( Jos Buttler 77 , Devdutt Padikkal 49)Buttler continues to toy with the Delhi attack, smashing two maximums and a four as Lalit Yadav’s final over of the evening yields 18 runs for the Royals. The nightmare just doesn’t seem to end for the Capitals at the moment.20:35 (IST)After 12 overs,Rajasthan Royals 110/0 ( Jos Buttler 60 , Devdutt Padikkal 48)A relatively better over for the Royals as Mustafizur concedes just six from his second over after being brought back in place of Thakur. Concedes just two singles in the first five deliveries before Buttler drills the ball down the ground, nearly taking the non-striker out.20:34 (IST)After 11 overs,Rajasthan Royals 104/0 ( Jos Buttler 55 , Devdutt Padikkal 47)HUGE over for the Royals, with Lalit Yadav getting smashed for 17 runs. Not only does Buttler bring up his fifth fifty-plus score of the season with a four, but Padikkal also completes the century stand — the first of the season — with a six off the last ball. Royals are cruising towards a massive score at the moment.20:29 (IST)SIX! DDP brings up the century opening stand — the first of the season — with a maximum off Lalit Yadav in the same over as Buttler brings up his third fifty of the season. RR 104/0  20:27 (IST)FOUR! Jos Buttler brings up his fifth fifty-plus score of the season as he completes a 36-ball half-century by smashing a full toss from Lalit Yadav over the extra cover region. RR 91/0  20:22 (IST)After 10 overs,Rajasthan Royals 87/0 ( Jos Buttler 49 , Devdutt Padikkal 36)Thakur returns. SIX! Buttler rocks back and smashes the ball over long on, into Wankhede’s top tier for a 107-metre hit! He’s batting on 49 at the end of this over. RR in full control at the halfway stage.20:16 (IST)After 9 overs,Rajasthan Royals 78/0 ( Jos Buttler 41 , Devdutt Padikkal 35)An even more expensive over from Kuldeep in his second, as he ends up conceding 15, with Buttler collecting a six and a four off consecutive deliveries and is batting in the 40s at the end of the over. Umpire signals timeout at the end of the ninth.20:13 (IST)After 8 overs,Rajasthan Royals 63/0 ( Jos Buttler 29 , Devdutt Padikkal 33)Padikkal continues to dominate the spinners, this time smashing Axar for a six and four off consecutive deliveries, with 12 coming from the eighth over. Padikkal’s batting in the 30s at the moment.20:12 (IST)After 7 overs,Rajasthan Royals 51/0 ( Jos Buttler 28 , Devdutt Padikkal 22)Kuldeep Yadav introduced into the attack for the first time on the other side of the powerplay. Seven off the over, including a boundary to Padikkal in the fourth off a well-timed sweep, as the partnership between the Rajasthan openers goes past the 50-mark. 20:08 (IST)FIFTY of the partnership comes up between Rajasthan openers Buttler and Padikkal! Padikkal collects a single off Kuldeep to bring up the milestone. RR 50/020:02 (IST)After 6 overs,Rajasthan Royals 44/0 ( Jos Buttler 26 , Devdutt Padikkal 17)Khaleel brought back for the final over of the powerplay. Buttler, meanwhile, continues to boss the Capitals, smashing two maximums in three deliveries — the ball sailing over the midwicket fence on both occasions. Would’ve also collected a four in the second delivery had it not been for a fine effort by Warner to save a couple of runs. Buttler keeps the strike with a single off the last ball, with 15 coming from the over.19:56 (IST)After 5 overs,Rajasthan Royals 29/0 ( Jos Buttler 11 , Devdutt Padikkal 17)Lalit continues. Another tidy over from the off-spinner with Buttler and Padikkal happy to rotate the strike between themselves through singles, three of which are added to the Rajasthan total in this over.19:53 (IST)After 4 overs,Rajasthan Royals 26/0 ( Jos Buttler 9 , Devdutt Padikkal 16)Mustafizur Rahman introduced, replacing Thakur. And he’s off to a poor start as he leaks 14 from his first, including a hat-trick of fours to the left-handed Padikkal, who guides the ball to third man and fence leg before producing a lovely cover drive. Confident start for the Royals so far.19:52 (IST)After 3 overs,Rajasthan Royals 12/0 ( Jos Buttler 9 , Devdutt Padikkal 2)Offie Lalit Yadav replaces Khaleel Yadav, with Delhi bringing spin into the equation early in the innings. He starts off on a tidy note with just three singles coming from the over.19:42 (IST)After 2 overs,Rajasthan Royals 9/0 ( Jos Buttler 8 , Devdutt Padikkal 0)Shardul Thakur steams in from the other end, with Devdutt Padikkal on strike for the first time. Big appeal for LBW against the southpaw in the second delivery, and Pant decides to review it after umpire shakes his head. And Delhi lose the review, with the ball found to be pitching outside off. With just a leg bye added to the Royals’ score in this over, Thakur starts off with a maiden. 19:39 (IST)After 1 over,Rajasthan Royals 8/0 ( Jos Buttler 8 , Devdutt Padikkal 0)Khaleel starts off with three dot balls, before Jos Buttler gets going early on, collecting two boundaries in three balls to open the team’s account. The Englishman though, isn’t in full control in the two shots, the ball flying off the edge towards the third man fence on both occasions.19:34 (IST)Khaleel Ahmed to bowl the first over of the evening. Jos Buttler and Devdutt Padikkal to open the innings as usual.19:05 (IST)DC XI: Prithvi Shaw, David Warner, Rishabh Pant (c & wk), Rovman Powell, Lalit Yadav, Sarfaraz Khan, Shardul Thakur, Axar Patel, Kuldeep Yadav, Mustafizur Rahman, Khaleel AhmedRR XI: Jos Buttler, Devdutt Padikkal, Sanju Samson (c & wk), Karun Nair, Shimron Hetmyer, Riyan Parag, Ravichandran Ashwin, Trent Boult, Prasidh Krishna, Obed McCoy, Yuzvendra Chahal19:04 (IST)Sanju Samson: I don’t mind. We’re ready for both. Toss isn’t something in our control. I think we definitely had a lot of discussions around, both batters and bowlers have to be ready for both situations. We’ve done well, but each and every game is important. No change to our XI.19:03 (IST)Rishabh Pant: These conditions might be helpful for the fast bowlers and spinners. Let’s not focus on the outside. This is the only thing we can control as a player. When you get the desired result, it’s good, but we’re looking to improve with each and every match. We’re playing the same side.19:01 (IST)TOSS: Delhi Capitals win the toss, and skipper Rishabh Pant opts to field against Rajasthan Royals18:55 (IST)Pitch report by Graeme Swann: \"It’s an absolute belter. There’s a bit of grass, but it’s rock hard. We’re halfway through and the leading wicket-takers are spinners. Both Kuldeep and Chahal are bowling brilliantly, and there maybe a bit of turn as well. Overall, expect high scores.\"18:45 (IST)We have come to associate the skill of nerveless anticipation and execution with MS Dhoni for over a decade now. The game against Mumbai Indians further shows how the mind never gets old even as his body is closing in on 41 years on the planet.Rajesh Tiwary writes on how MSD's prevails in final over 3D chess against familiar foes. Click here to read18:33 (IST)The DC vs RR fixture will witness two top Indian spinners — Kuldeep Yadav and Yuzvendra Chahal — battle it out at the Wankhede Stadium.Chahal's haul of 5/40 against KKR, which included the first hat-trick of the season, turned the match on its head and helped the Royals defeat Shreyas Iyer's Knight Riders. Kuldeep too has been in fine form for the Capitals so far this season in what has been a fine comeback for the left-arm wrist spinner since joining the Delhi franchise.Both teams, most importantly, will seek consistency going forward after getting their campaigns back on track with a victory in their last outings.Click here to read the DC vs RR match preview18:15 (IST)Ponting isolates after family member tests positive for COVIDDelhi Capitals head coach Ricky Ponting will not be present at the sidelines for his team's fixture against the Rajasthan Royals at the Wankhede Stadium after a member of his family returned a positive test, forcing the former Australia captain to isolate along with the rest of his family.Delhi has witnessed several COVID cases since physio Patrick Farhart returned a positive test. Since then, overseas players Mitchell Marsh and Tim Seifert have also joined the list.Click here for the reportClick here for the full timeline of COVID-19 cases in the DC camp18:07 (IST)Hello and welcome to our live coverage of Match 34 of IPL 2022, with Delhi Capitals taking on the Rajasthan Royals at the Wankhede Stadium in Mumbai on Friday. Delhi enter this game on the back of a commanding nine-wicket thrashing of Punjab Kings just down the road at the Brabourne Stadium just two days ago. Rajasthan, on the other hand, pulled off a nervy seven-run win over Kolkata Knight Riders at the same venue earlier on Monday.Delhi Capitals vs Rajasthan Royals Live update - Tata IPL 2022 DC vs RR Live cricket score , 34th IPL Match Live Coverage: Prasidh Krishna bowls from the other end. FOUR! Warner gets off the mark with a boundary, getting down on one knee and heaving a full, wide delivery over extra cover! Excellent comeback by Prasidh though, as he concedes just two singles in the next five deliveries. Six from the over. Preview: A confident Delhi Capitals will face Rajasthan Royals in the Indian Premier League match at the Wankhede Stadium in Mumbai on Friday. Coming into this match, Delhi Capitals have three wins from six matches. They hammered Punjab Kings in the last match.Rajasthan Royals, on the other hand, scored 217 runs against Kolkata Knight Riders in their last match and managed to sneak home in the final over in what proved to be an absolute thriller of a contest.Jos Buttler, who smashed a 61-ball 103 against KKR, will remain the key for Rajasthan. With the ball, leg-spinner Yuzvendra Chahal bagged a hat-trick in the last match and also a five-wicket haul.When will the Delhi Capitals and Rajasthan Royals match be played?The DC vs RR IPL 2022 match will take place on 22 April.Where will the Delhi Capitals and Rajasthan Royals match be held?The DC vs RR IPL 2022 match will be held at Wankhede Stadium, Mumbai.What time will the Delhi Capitals and Rajasthan Royals match start?The DC vs RR IPL 2022 match will start at 7:30 pm. The toss will be held at 7 pm.Where can you watch DC vs RR IPL 2022 match on TV and online?The DC vs RR IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the DC vs RR IPL 2022 match.Squads:Delhi Capitals: David Warner, Prithvi Shaw, Sarfaraz Khan, Rishabh Pant (c), Rovman Powell, Lalit Yadav, Axar Patel, Shardul Thakur, Kuldeep Yadav, Mustafizur Rahman, Khaleel Ahmed, Pravin Dubey, Mitchell Marsh, Kona Srikar-Bharat, Yash Dhull, Ripal Patel, Chetan Sakariya, Vicky Ostwal, Mandeep Singh, Tim Seifert, Ashwin Hebbar, Anrich Nortje, Kamlesh Nagarkoti, Lungi NgidiRajasthan Royals: Devdutt Padikkal, Jos Buttler, Sanju Samson (c), Karun Nair, Shimron Hetmyer, Riyan Parag, Ravichandran Ashwin, Trent Boult, Prasidh Krishna, Obed McCoy, Yuzvendra Chahal, Shubham Garhwal, Dhruv Jurel, Yashasvi Jaiswal, Daryl Mitchell, KC Cariappa, Tejas Baroka, Anunay- Singh, Rassie van der-Dussen, Jimmy Neesham, Nathan Coulter-Nile, Navdeep Saini, Kuldip Yadav, Kuldeep SenRead all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-22 16:20:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/PP2-16.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Former Australian Cricket Board chief Alan Crompton dies","link":"https://www.indiatvnews.com/sports/cricket/former-australian-cricket-board-chief-alan-crompton-dies-2022-04-22-771540","keywords":null,"creator":null,"video_url":null,"description":"Former chairman of the Australian Cricket Board and long-time administrator Alan Crompton has died aged 81.","content":null,"pubDate":"2022-04-22 16:18:28","full_description":"Former chairman of the Australian Cricket Board and long-time administrator Alan Crompton has died aged 81. Crompton served as chairman of the Australian Cricket Board (now Cricket Australia) from 1992-1995. A Sydney grade cricketer of repute for more than two decades, Crompton also held various posts including the chairman of Cricket New South Wales before his appointment as head of ACB. \"Everyone at Cricket Australia who worked with Alan and all those who have benefited from his service to cricket will be deeply saddened by his passing,\" CA chairman Lachlan Henderson said in a statement on Friday. \"The energy, enthusiasm and expertise Alan brought to cricket in New South Wales and Australia for more than 60 years was remarkable and he leaves an outstanding legacy at all levels of the game.\" Crompton also served as tour manager of Australian Test teams thrice. He was conferred with the Order of Australia Medal and life membership of both Cricket NSW and the Sydney University Cricket Club.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Former Australian cricket board chief Alan Crompton dies","link":"https://sportstar.thehindu.com/cricket/alan-crompton-dies-australian-cricket-board-chief/article38478673.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"Alan Crompton served as chairman of Australian Cricket Board (now Cricket Australia) from 1992-1995.","content":null,"pubDate":"2022-04-22 15:11:35","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC appoints Pakistan's Wasim Khan as General Manager","link":"https://sportstar.thehindu.com/cricket/wasim-khan-icc-general-manager-pakistan-cricket-board-ceo/article38478662.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"The International Cricket Council on Friday appointed Wasim Khan, the former chief executive of Pakistan Cricket Board, as its General Manager - Cricket to succeed Geoff Allardice.","content":null,"pubDate":"2022-04-22 15:00:35","full_description":"The International Cricket Council (ICC) on Friday appointed Wasim Khan, the former chief executive of Pakistan Cricket Board (PCB), as its General Manager - Cricket to succeed Geoff Allardice. Khan, who will take up his post next month, was also previously the Chief Executive of Leicestershire County Cricket Club and Chance to Shine. He last held the post of PCB CEO. He will take over from Allardice who spent eight years in the role before being appointed as ICC CEO. READ: Pakistan to tour Netherlands for ODI series \"I am honoured to be joining the ICC, I can't wait to get started and work in partnership with our Members to strengthen and grow our sport,\" Khan said in an ICC statement. \"I'm particularly excited by the ICC's commitment to the growth of the women's game, and I look forward to playing my part in really accelerating that growth over the next decade.\" Welcoming Khan to his new position, his predecessor Allardice said: \"He (Khan) brings an in-depth knowledge of our sport and its stakeholders and his firsthand experience of the international cricket landscape will be of enormous benefit as we implement the ICC global growth strategy and move forward into a new events cycle.”","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, DC vs RR Live Updates: Jos Buttler Hits 50, Devdutt Padikkal Going Strong For Rajasthan Royals - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2xpdmUtaXBsLXNjb3JlLWRjLXZzLXJyLWxpdmUtY3JpY2tldC1zY29yZS1kZWxoaS1jYXBpdGFscy12cy1yYWphc3RoYW4tcm95YWxzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTExMjI10gGXAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvbGl2ZS1pcGwtc2NvcmUtZGMtdnMtcnItbGl2ZS1jcmlja2V0LXNjb3JlLWRlbGhpLWNhcGl0YWxzLXZzLXJhamFzdGhhbi1yb3lhbHMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5MTEyMjUvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, DC vs RR Live Updates: Jos Buttler Hits 50, Devdutt Padikkal Going Strong For Rajasthan Royals  NDTV SportsDC vs RR, IPL 2022 stats: head-to-head record, players to watch out for  SportstarMatch Preview - Capitals vs Royals, Indian Premier League 2022, 34th Match  ESPNcricinfoDC vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL 2022: Delhi Capitals Coach Ricky Ponting To Miss Rajasthan Royals Tie As Family Member Tests Pos..  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-04-22 14:57:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC appoints Pakistan’s Wasim Khan as its General Manager-Cricket","link":"https://indianexpress.com/article/sports/cricket/icc-appoints-pakistans-wasim-khan-as-its-general-manager-cricket-7882670/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-22 14:55:57","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - RCB vs Sunrisers, Indian Premier League 2022, 36th Match - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi0xMjk4NDIzL3JveWFsLWNoYWxsZW5nZXJzLWJhbmdhbG9yZS12cy1zdW5yaXNlcnMtaHlkZXJhYmFkLTM2dGgtbWF0Y2gtMTMwNDA4Mi9tYXRjaC1wcmV2aWV30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - RCB vs Sunrisers, Indian Premier League 2022, 36th Match  ESPNcricinfoRCB vs SRH Match Prediction- Who Will Win Today's IPL Match Between Royal Challengers Bangalore And Sunrisers Hyderabad? IPL 2022, Match 36, RCB vs SRH  Cricket AddictorIPL 2022: Match 36, RCB vs SRH Match Prediction – Who will win today’s IPL match between RCB and SRH?  CricTrackerIPL 2022: In-form RCB to face resurgent SRH; focus on Dinesh Karthik  SportstarRCB vs SRH: Sunrisers Hyderabad's Predicted Playing XI Against Royal Challengers Bangalore, IPL 2022, Match 36 RCB vs SRH  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-22 14:48:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-rajasthan-royals-live-score-over-match-34-t20-6-10-updates-2911497","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Rajasthan Royals from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-22 14:43:51","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Rajasthan Royals are 91/0. The live updates of Delhi Capitals vs Rajasthan Royals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Rajasthan Royals, Delhi Capitals vs Rajasthan Royals live score, Delhi Capitals vs Rajasthan Royals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) 1 run. 9.5 overs (6 Runs) SIX! HIGH AND HANDSOME! A length ball, around middle. Jos Buttler dispatches this one over deep mid-wicket for a massive six. A 107 m hit that! 9.4 overs (0 Run) Mix-up...but no harm done! A yorker-length delivery, around middle. Jos Buttler jams it out towards mid on. He wanted a single there, but he is sent back by Devdutt Padikkal mid-way. 9.3 overs (1 Run) Pitches it up, around the leg pole. Devdutt Padikkal whips it towards deep square leg. Single taken! 9.2 overs (1 Run) Outside off, on a length. Jos Buttler pushes it off the back foot towards sweeper cover for a single. 9.1 overs (0 Run) Good-length delivery, nipping back in, around middle and off. Jos Buttler blocks it out solidly. Drinks! Delhi have no answers to this carnage from Jos Buttler and Devdutt Padikkal. If they don't stop it quickly, they will end up chasing a huge total. 8.6 overs (1 Run) Wide of off, shorter ball. Jos Buttler slashes it towards deep point for a single. He retains the strike! 8.6 overs (1 Run) Wide! Down the leg side, fuller ball. Jos Buttler leaves it alone. Wide called! 8.5 overs (1 Run) Spinning away, shortish ball, outside off. Devdutt Padikkal cuts it towards point and takes a single. 8.4 overs (1 Run) A low full toss, on the pads. Jos Buttler works it away towards deep square leg for a single. 8.3 overs (4 Runs) FOUR! Crunched! Tosses it up, full, around middle again. Jos Buttler smashes it over the bowler's head for a boundary. 8.2 overs (6 Runs) SIX! Up, up and away! Loopy ball, full, around middle. Jos Buttler shimmies down the pitch and tonks it over long on for a biggie. 8.1 overs (1 Run) Tosses it up, full, around middle. Devdutt Padikkal knocks it down towards long on for a single. 7.6 overs (1 Run) A single as this is flicked off the back-foot to square leg for a single. 7.5 overs (4 Runs) FOUR! Top shot! Down leg this time, around fullish ball. Devdutt Padikkal gets down on his knee and sweeps it towards fine leg for a boundary. 7.4 overs (6 Runs) SIX! BANG! Tossed up, around off. Devdutt Padikkal slog-sweeps it all the way over mid-wicketfor a biggie. 7.3 overs (1 Run) This is full and on middle. Buttler reverse sweeps it through point for a single. 7.2 overs (0 Run) Around off, pushed to covers. 7.1 overs (0 Run) An arm ball,sliding on middle, Buttler mistimes his heave to fine leg for a single. 6.6 overs (1 Run) Pitches it up, turning it in onto the pads. Jos Buttler tucks it towards square leg for a single. 6.5 overs (1 Run) Turning away, shortish ball, outside off. Devdutt Padikkal chops it towards point and rotates the strike. 6.4 overs (4 Runs) FOUR! Top shot! Slower through the air, full, around off. Devdutt Padikkal gets down on his knee and sweeps it towards deep mid-wicket for cracking boundary. 6.3 overs (0 Run) Outside off, touch shorter and quicker. Devdutt Padikkal tries to cut this away but he misses. 6.2 overs (1 Run) Loopy ball, fuller, around middle and off. Jos Buttler taps it towards cover and takes a single. 6.1 overs (0 Run) Kuldeep Yadav tosses this up, full, outside off. Jos Buttler pushes it towards point. Kuldeep Yadav is into the attack. 5.6 overs (1 Run) A low full toss, around middle. Jos Buttler taps it towards mid off and scampers through to the other end. He retains the strike! Rajasthan are 44 for 0 at the end of the Powerplay! 5.5 overs (0 Run) Swing and a miss! On a length, outside off. Jos Buttler stays back and looks to slash this away but he misses. 5.4 overs (6 Runs) SIX! BANG! Jos Buttler taking full advantage of the final over of the Powerplay! On a length, around middle. Jos Buttler once again clears his front foot and heaves it high over deep mid-wicket another maximum. 5.3 overs (0 Run) A full toss, around off. Jos Buttler pushes it towards cover. 5.2 overs (2 Runs) Full again, outside off. Jos Buttler lifts it over mid off. David Warner chases it and does extremely well, to keep the ball away from the ropes. Two taken! Top stuff from Warner! 5.1 overs (6 Runs) SIX! KABOOM! There it is! Jos Buttler was eagerly waiting to get going! A fuller ball, around middle. Jos Buttler clears his front leg and tonks it over deep mid-wicket for a biggie!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637862552233503748.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan fast bowler Amir set to play County cricket for Gloucestershire","link":"https://www.indiatvnews.com/sports/cricket/pakistan-fast-bowler-amir-set-to-play-county-cricket-for-gloucestershire-2022-04-22-771511","keywords":null,"creator":null,"video_url":null,"description":"Pakistan fast bowler Mohammad Amir is set to make a surprise return to first-class cricket less than two years after announcing his international retirement as he has signed a short-term contract with Gloucestershire to play in the County Championship.","content":null,"pubDate":"2022-04-22 14:04:46","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-rajasthan-royals-live-score-over-match-34-t20-1-5-updates-2911313","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Rajasthan Royals from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-22 13:43:55","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637862516266405484.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Problems aplenty for KKR as they run into in-form GT | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTIxOTk4L2lwbC0yMDIyLXByb2JsZW1zLWFwbGVudHktZm9yLWtrci1hcy10aGV5LXJ1bi1pbnRvLWluLWZvcm0tZ3QtY3JpY2J1enpjb23SAXdodHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjE5OTgvaXBsLTIwMjItcHJvYmxlbXMtYXBsZW50eS1mb3Ita2tyLWFzLXRoZXktcnVuLWludG8taW4tZm9ybS1ndC1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Problems aplenty for KKR as they run into in-form GT | Cricbuzz.com - Cricbuzz  CricbuzzKKR vs GT Match Prediction- Who Will Win Today's IPL Match Between Kolkata Knight Riders And Gujarat Titans, IPL 2022, Match 35  Cricket AddictorAaron Finch : \"I got the call from Brendon McCullum\" | Knights TV | KKR IPL 2022  Kolkata Knight RidersIPL 2022: Match 35, KKR vs GT Match Prediction – Who will win today’s IPL match between KKR and GT?  CricTrackerKKR vs GT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-22 13:37:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 RCB vs SRH Live Streaming: Royal Challengers Bangalore vs Sunrisers Hyderabad Live Coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/sunrisers-hyderabad-vs-royal-challengers-bangalore-indian-premier-league-live-streaming-today-check-srh-vs-rcb-live-coverage-venue-date-streaming-channel-date-time-10589341.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Tata IPL 2022 RCB vs SRH Live Streaming: Royal Challengers Bangalore vs Sunrisers Hyderabad Live Coverage, venue, date, timing","content":"Sunrisers Hyderabad will look to continue their winning ways when they meet Royal Challengers Bangalore at the Brabourne Stadium on Saturday.Both the teams will step into the ground at the back of victories in their previous games. Royal Challengers Bangalore clinched a comfortable win against KL Rahul’s Lucknow Super Giants in their last match. Their batters clicked well for them to cross the 180-run mark in 20 overs.RCB's skipper Faf Du Plessis top scored for the team with a blazing 96 runs off 64 deliveries. Shahbaz Ahmed and Glenn Maxwell also displayed some fireworks. However, former captain Virat Kohli had to leave the crease with a golden duck. In reply, Lucknow only managed to get 163 runs for the loss of 8 wickets. Josh Hazlewood turned out to be the best performer among the RCB bowlers. The right-arm pacer scalped four wickets and also bowled four economical overs. RCB is at the second spot on the table with 10 points in seven matches.On the other hand, Sunrisers Hyderabad will be coming out to play with four consecutive wins under their belt. In their previous game against Punjab Kings, the Kane Williamson-led side successfully chased down 152 runs with seven balls to spare. Winning the toss, Williamson invited Punjab Kings to bat first. Among the Punjab batters, only Liam Livingstone and Shahrukh Khan managed to cross the 20-run mark. Livingstone top-scored with a 33-ball 60 and helped his side reach a decent score of 151 runs.Despite losing Williamson early, Abhishek Sharma, Aiden Markram, Rahul Tripathi, and Nicholas Pooran successfully led Sunrisers Hyderabad to the finishing line in the 19th over. Aiden Markram was the highest scorer for them with an unbeaten 41-run knock. Hyderabad are now at the fifth position with 8 points.When will the Royal Challengers Bangalore vs Sunrisers Hyderabad match be played?The RCB vs SRH IPL 2022 match will take place on 23 April, 2022.Where will the Royal Challengers Bangalore vs Sunrisers Hyderabad match be held?The RCB vs SRH IPL 2022 match will be held at Brabourne Stadium, Mumbai.What time will the Royal Challengers Bangalore vs Sunrisers Hyderabad match start?The RCB vs SRH IPL 2022 match will start at 7:30 pm. The toss will take place at 7 pm.Where can you watch RBC vs SRH IPL 2022 match on TV and online?The RCB vs SRH IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The RCB vs SRH match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the RCB vs SRH IPL 2022 match.Squads:Sunrisers Hyderabad: Kane Williamson, Abhishek Sharma, Rahul Tripathi, Aiden Markram, Nicholas Pooran, Abdul Samad, Priyam Garg, Vishnu Vinod, Glenn Phillips, R Samarth, Shashank Singh, Washington Sundar, Romario Shepherd, Marco Jansen, J Suchith, Shreyas Gopal, Bhuvneshwar Kumar, Sean Abbott, Kartik Tyagi, Saurabh Tiwary, Fazalhaq Farooqi, T Natarajan, Umran Malik.Royal Challengers Bangalore: Virat Kohli, Glenn Maxwell, Mohammed Siraj, Faf du Plessis, Harshal Patel, Wanindu Hasaranga, Dinesh Karthik, Josh Hazlewood, Shahbaz Ahmed, Anuj Rawat, Akash Deep, Mahipal Lomror, Finn Allen, Sherfane Rutherford, Jason Behrendorff, Suyash Prabhudessai, Chama Milind, Aneeshwar Gautam, Karn Sharma, David Willey, Siddharth Kaul, Rajat Patidar.Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-22 13:34:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/SRH-beat-PBKS-600.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC appoints Pakistan's Wasim Khan as its cricket general manager","link":"https://www.indiatvnews.com/sports/cricket/icc-appoints-pakistan-s-wasim-khan-as-its-cricket-general-manager-2022-04-22-771507","keywords":null,"creator":null,"video_url":null,"description":"The ICC on Friday appointed Wasim Khan, the former chief executive of Pakistan Cricket Board, as its general manager - cricket to succeed Geoff Allardice.","content":null,"pubDate":"2022-04-22 13:31:50","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"INB vs BS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECS T10 Bulgaria 2022, Match 20","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/inb-vs-bs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ecs-t10-bulgaria-2022-match-20?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-22 13:28:57","image_url":"https://static.sportskeeda.com/editor/2022/04/3a2d9-16506281405256-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"DC head coach Ricky Ponting’s family member tests positive for COVID ahead of RR match: Timeline of events","link":"https://www.firstpost.com/firstcricket/sports-news/dc-head-coach-ricky-pontings-family-member-tests-positive-for-covid-ahead-of-rr-match-timeline-of-events-10573111.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"DC head coach Ricky Ponting’s family member tests positive for COVID ahead of RR match: Timeline of events","content":"The Indian Premier League (IPL) hasn't quite been the same since the SARS-COV2 virus spread from China to the entire world in 2020.The league was suspended for a few months after the coronavirus pandemic brought the sporting world to a screeching halt, and later took place entirely in the United Arab Emirates from September to November.The BCCI looked to host the tournament in India the following year and a few matches even took place in Mumbai, Chennai and Delhi before the virus breached the bio-secure bubble and led to the tournament getting suspended again. The remaining matches took place in the UAE right before the T20 World Cup.The organisers of the league would've had high hopes for the 15th season of the league given the sharp reduction in COVID cases in the country after the third wave in January. Four venues in Maharashtra had been given the responsibility of hosting the league phase of the tournament with BCCI allowing 25 percent fan capacity.However, hosting an event in the middle of a global pandemic is fraught with risk and one can never rule out the possibility of players and team officials coming in contact with the virus and news of multiple COVID cases in the Delhi Capitals (DC) camp this week will have the BCCI sweating bullets and frantically coming up with solutions to try and keep the tournament running as smoothly as possible.Here we look at the timeline of events surrounding the emergence of multiple positive COVID-19 tests in the Delhi Capitals camp:The first caseDelhi Capitals physio Patrick Farhart returned a positive COVID-19 test on 15 April in what was the first case reported in this year's IPL. Farhart's positive test was confirmed five days after Delhi's last game, which was against the Kolkata Knight Riders (KKR) in Mumbai.\"Delhi Capitals physio Patrick Farhart has been tested positive for COVID-19. He is being closely monitored by the DC Medical Team at the moment,\" read the official statement from the franchise. Their match against Royal Challengers Bangalore (RCB) the following day went ahead as scheduled with the Rishabh Pant-led side losing by 16 runs.Marsh isolated, hospitalisedAustralian all-rounder Mitchell Marsh became the first player to return a positive COVID-19 test. Marsh, who had made his debut for the Capitals earlier on Saturday, had initially returned a negative test, but the second one turned out to be positive, resulting in immediate isolation from the squad.OFFICIAL STATEMENT:Delhi Capitals all-rounder Mitchell Marsh has tested positive for COVID-19, following which he has been admitted to a hospital. The Delhi Capitals medical team is closely monitoring Marsh’s condition. pic.twitter.com/lvatopJtcV— Delhi Capitals (@DelhiCapitals) April 18, 2022Marsh was later admitted to a hospital, according to an official statement from the Capitals. \"Delhi Capitals all-rounder Mitchell Marsh has tested positive for COVID-19, following which he has been admitted to a hospital. The Delhi Capitals medical team is closely monitoring Marsh’s condition,\" read the DC statement that was posted on Twitter late in the evening on Monday.More cases in the DC campIt wasn't just Farhart and Marsh who came in contact with the virus — team doctor Abhijit Salvi, a team masseur and social media content team member also returned positive tests, taking the tally to five and causing further worry not just for the franchise but for the tournament as a whole as well as for the BCCI.\"'DC were supposed to travel to Pune today but the entire squad members have been told to retire to their respective rooms and as per protocol RT PCR is being done to ascertain whether there is an outbreak in the camp or it is an isolated case like Patrick Farhart,'' a source in the BCCI was quoted as saying according to PTI.DC-PBKS match shifted out of PuneIn latest development in the Delhi Capitals COVID saga, the upcoming fixture against the Punjab Kings that was supposed to take place at Pune's MCA Stadium was shifted to Mumbai's Brabourne Stadium, which was officially confirmed by the BCCI on Tuesday afternoon.According to the BCCI, the decision was taken \"to avoid any further incident due to any undetected case during a long-distance bus journey in a closed environment.\"Another overseas player tests positiveThings got worse both for the Capitals as well as for the BCCI after a second member of the Delhi Capitals squad, another overseas player at that, tested positive for the virus.New Zealand wicketkeeper-batter Tim Seifert, who had been picked up by the franchise in the player auction earlier this year for his base price of Rs 50 lakh, returned a positive test after a fourth round of testing on Wednesday, according to PTI. Seifert has made two appearances for the Capitals so far this season, against MI and GT on 27 March and 2 April respectively.Incidentally, Seifert had also tested positive for the virus along with Prasidh Krishna last year when he was part of the KKR setup. The outbreak of cases had forced the BCCI to suspend the tournament for more than four months.Ponting's family member tests positiveDelhi ended up playing their match against Punjab despite the lingering threat of COVID, with the Rishabh Pant-led side thrashing the Kings by nine wickets in a one-sided affair to give their playoff hopes a much-needed boost.However, on the eve of their next fixture against Rajasthan Royals, a member of head coach Ricky Ponting's family returned a positive COVID test.Ponting's family, as a result, has been moved to the isolation facility following the positive test. Even though Ponting tested negative twice in the build-up to the Rajasthan Royals fixture, he decided to join his family in the isolation facility and thus will not be present at the Wankhede Stadium later on Friday evening.\"Ponting himself has tested negative twice subsequently. However, in the best interest of the team, the management and medical team has decided that he will remain in isolation for five days, as he was a close contact. He will, therefore, not be present at the ground for tonight’s game against Rajasthan Royals. The franchise requests for Ponting and his family's privacy to be respected in the current scenario,\" read the official statement from the franchise.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-22 13:22:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Ricky-Ponting-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC appoints Pakistan's Wasim Khan as its General Manager-Cricket","link":"https://www.business-standard.com/article/sports/icc-appoints-pakistan-s-wasim-khan-as-its-general-manager-cricket-122042201053_1.html","keywords":null,"creator":null,"video_url":null,"description":"The ICC on Friday appointed Wasim Khan, the former chief executive of Pakistan Cricket Board, as its General Manager - Cricket to succeed Geoff Allardice.","content":null,"pubDate":"2022-04-22 13:19:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220422/thumb-122042201053.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Wasim Khan appointed as ICC General Manager of Cricket","link":"https://www.indiatoday.in/sports/cricket/story/wasim-khan-appointed-as-icc-general-manager-of-cricket-1940750-2022-04-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Wasim Khan appointed as ICC General Manager of Cricket","content":null,"pubDate":"2022-04-22 13:06:06","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Appoints Pakistan's Wasim Khan As Its General Manager-Cricket","link":"https://sports.ndtv.com/cricket/icc-appoints-pakistans-wasim-khan-as-its-general-manager-cricket-2911219","keywords":null,"creator":null,"video_url":null,"description":"The ICC on Friday appointed Wasim Khan, the former chief executive of Pakistan Cricket Board, as its General Manager - Cricket to succeed Geoff Allardice","content":null,"pubDate":"2022-04-22 13:05:05","full_description":"The ICC on Friday appointed Wasim Khan, the former chief executive of Pakistan Cricket Board, as its General Manager - Cricket to succeed Geoff Allardice. Khan, who will take up his post next month, was also previously the Chief Executive of Leicestershire County Cricket Club and Chance to Shine. He last held the post of PCB CEO. He will take over from Allardice who spent eight years in the role before being appointed as the ICC CEO. \"I am honoured to be joining the ICC, I can't wait to get started and work in partnership with our Members to strengthen and grow our sport,\" Khan said in an ICC statement. Wasim Khan appointed as ICC General Manager of Cricket. Read more here https://t.co/hjzX6oDEBq pic.twitter.com/91AAQcmBsJ \"I'm particularly excited by the ICC's commitment to the growth of the women's game, and I look forward to playing my part in really accelerating that growth over the next decade.\" Welcoming Khan to his new position, his predecessor Allardice said: \"He (Khan) brings an in-depth knowledge of our sport and its stakeholders and his firsthand experience of the international cricket landscape will be of enormous benefit as we implement the ICC global growth strategy and move forward into a new events cycle.”","image_url":"https://c.ndtvimg.com/2022-04/gcr4mi9_wasim-khan-icc-twitter_120x90_22_April_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: MS Dhoni's mind prevails in final over 3D chess against familiar foes","link":"https://www.firstpost.com/opinion/ipl-2022-ms-dhonis-mind-prevails-in-final-over-3d-chess-against-familiar-foes-10589181.html","keywords":["First Cricket News"],"creator":["Rajesh Tiwary"],"video_url":null,"description":"IPL 2022: MS Dhoni's mind prevails in final over 3D chess against familiar foes","content":"Most people will tell you that cricket is played on a 22-yard pitch with a bat and ball. But discerning readers of the game understand that the game's mental aspects are akin to the game of chess.If you strip down cricket to its essential elements, you can watch it as a duel, just like chess, that happens between a batter and a bowler. Ball after ball, a batter and a bowler are both plotting their next move. What delivery should I choose from my armoury of weapons for this next ball? Where should I hit the next ball? Should I go for a single or a boundary?Along with plotting, they anticipate what their opponents are going to do. He knows my strength is a yorker; should I bluff him and bowl something else? He knows I will be anticipating a yorker. Would he try to bluff me? But he also knows I am expecting a bluff? Would he double bluff?When it comes to the pure physical skills of batting and bowling, the difference at the elite level is minimal. What separates the good from the GOATs is their mental ability. The best batters don't just anticipate what the bowler will bowl next with a fair degree of accuracy. At times they play with the bowlers' minds so that they make them bowl the next ball exactly where they want it.We have come to associate this skill of nerveless anticipation and execution with Dhoni for over a decade now. The game against Mumbai Indians further shows how the mind never gets old even as his body is closing in on 41 years on the planet. Dhoni's movements on the crease are visibly sluggish now. His levers creak as they move. Like a vintage car, he struggles to find any acceleration early on as he starts, if he starts at all. But that computer in his head continues to work as if the makers have continuously upgraded the hardware and applied all software patches timely and diligently. That computer is what still separates him from the crowd in a crunch situation.Imagine being a bowler at the other end against Dhoni in the final over. You know Dhoni has set up the entire game for this duel. You have studied Dhoni's videos and watched all his finishes. You know all his shots. You should be able to predict where he likes to hit and what he wants to do. But at the moment, you are hypnotised by the man's aura. You stand at the top of your mark, watch him adjust his gloves, and mark his guard. You wonder if your name will get added to the long list of victims. You wonder if Dhoni has left it too late, but is it ever too late for Dhoni?Australia and Clint McKay thought the same at Adelaide a decade ago. Dhoni wasn't able to find any timing on that day. Plus, surely he can't clear those humungous Adelaide boundaries. Dhoni is looking for just one six early in the over to put the pressure back on the bowler. If he doesn't get it, you have a chance. You know you are a dead duck if he can deposit you over the boundary with three or more balls remaining. If you look at the third ball six against Unadkat, it seems eerily similar to the third ball six against McKay at Adelaide. Not that big, but it was the same situation and the same shot. As the commentators remarked at Adelaide, Dhoni's entire weight was on the backfoot when he played the shot. But once he made that connection, there was only one place the ball could go.With the equation in his favour (anything less than a boundary, every ball is in Dhoni's favour), Dhoni reverts to cruise control. The creaky vintage car is revved up and is switching between gears with ease. The pitch has been sluggish all day, but Model Dhoni, circa 2004, is renowned for being reliable on all surfaces.At Port of Spain in 2013, India were struggling to score at four an over for 49 overs when all of a sudden Dhoni delivered with 15 off 4. Here, on a similar surface, he somehow turned a spell on Unadkat, who forgot to use the two-paced nature of the pitch by bowling cutters and went for full yorkers in the last two balls. Dhoni anticipated the first and swatted a two; he predicted the second even better, now that he was well calibrated and turned his wrist at the last moment to find the deep square leg boundary. Dhoni delivered yet again. With less muscle power and more brainpower this time.You won't back Dhoni to deliver against all opponents on all surfaces anymore. But when he finds the right matchup, he still has what it takes to turn back the clock, as DC and Tom Curran also discovered last season in a critical finish.At the DY Patil on Thursday, Dhoni's experience and wit weren't just visible in how he scored runs. At the end of the game, his partner in crime, Dwayne Pretorious, commented on how Dhoni shepherded him through the night. Telling him when to wait and the exact moment he needs to unleash the lap shot against Bumrah.Earlier in the evening, he was instrumental in dismissing Pollard with his patented field setting against the big lad from West Indies. You would think a player of Pollard's calibre and experience wouldn't fall in the same trap 12 years after Dhoni had first laid it. But whether it is Dhoni's Midas touch, aura, force field, or charm, he continues to lay the bait out from behind the stumps, and the batters continue to fall into his trap.CSK still have a lot of running to do this season for any chance to qualify for playoffs. Their fielding has been abysmal, batting pedestal, and bowling patchy. Yet once their talisman shows the way, CSK now has the inspiration they need. The road ahead is challenging, but this is still not over for Team Yellow.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-22 12:42:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Dhoni-640-vs-MI_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: DC coach Ricky Ponting in isolation after family member tests positive; will miss match against RR","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-dc-coach-ricky-ponting-in-isolation-after-family-member-tests-positive-will-miss-match-against-rr-10589081.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: DC coach Ricky Ponting in isolation after family member tests positive; will miss match against RR","content":"Delhi Capitals head coach Ricky Ponting has been isolated from the rest of the squad after one of his family members tested positive for COVID-19 just days after the contagion struck the DC camp.Consequently, Ponting is set to miss tonight's (22 April) match against Rajasthan Royals.\"A family member of Delhi Capitals head coach Ricky Ponting has tested positive for COVID. The family has now been moved into an isolation facility and is being well taken care of. Ponting tested negative twice, subsequently. However, in the best interest of the team, the management and medical team has decided that he will remain in isolation for five days, as he was a close contact,\" read the statement from the Delhi Capitals.\"He will, therefore, not be present at the ground for tonight’s game against Rajasthan Royals. The franchise requests for Ponting and his family's privacy to be respected in the current scenario,\" added the statement.Recently five people from DC camp tested positive, including all-rounder Mitchell Marsh. In the light of events, the match between Delhi Capitals and Punjab Kings on 20 April was shifted from MCA Stadium in Pune to Brabourne Stadium in Mumbai .On Wednesday, the game between Delhi Capitals and Punjab Kings was played as scheduled after being rendered doubtful due to the emergence of a sixth COVID-19 case in the former's camp, with the bio-bubble breach raising some serious questions.High drama unfolded in the lead-up to that game with Tim Seifert becoming the sixth member from Delhi contingent to test positive.The first positive case was triggered by former Indian physiotherapist Patrick Farhat on 15 April. Thereafter, sports massage therapist Chetan Kumar tested positive on 16 April followed by Marsh, DC team doctor Abhijit Salvi and social media content team member Akash Mane on 18 April.The Delhi Capitals contingent had been put under a daily RT-PCR testing procedure from 16 April after the positive tests.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-22 12:40:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Ricky-Ponting-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}