{"newsArray":[{"title":"Sipi Trekkers find slippery track against Itanda Kayakers, Bujjagali Rafters","link":"https://kawowo.com/2023/01/27/sipi-trekkers-find-slippery-track-against-itanda-kayakers-bujjagali-rafters/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"The Water Falls T20 League Men’s EditionGame 1: Sipi Trekkers v Itanda KayakersSipi Trekkers 92 all outItanda Kayakers 93/ 0Itanda Kayakers won by 10 wicketsPlayer of the Match: Igance Niteriganya (3/15)Match Highlights: https://fromsmash.com/GAME-ONE-SHORT-HIGHLIGHTSLive score link: https://cricclubs.com/viewScorecard.do?&matchId=1715&clubId=5335 Game 2: Sipi Trekkers v Bujjagali RaftersBujjagali Rafters 175/8Sipi Trekkers 115Bujjagali Rafters by 60 runsPlayer of the Match: Juma […] The post Sipi Trekkers find slippery track against Itanda Kayakers, Bujjagali Rafters appeared first on Kawowo Sports.","content":"The Water Falls T20 League Men’s Edition Game 1: Sipi Trekkers v Itanda Kayakers Sipi Trekkers 92 all out Itanda Kayakers 93/ 0 Itanda Kayakers won by 10 wickets Player of the Match: Igance Niteriganya (3/15) Match Highlights: https://fromsmash.com/GAME-ONE-SHORT-HIGHLIGHTS Live score link: https://cricclubs.com/viewScorecard.do?&matchId=1715&clubId=5335 Game 2: Sipi Trekkers v Bujjagali Rafters Bujjagali Rafters 175/8 Sipi Trekkers 115 Bujjagali Rafters by 60 runs Player of the Match: Juma Miyagi Full Match Scorecard: https://cricclubs.com/viewScorecard.do?&matchId=1716&clubId=5335 The men’s edition of the Water Falls T20 League started off with pomp and good-quality cricket. Cricket Cranes All Rounder Juma Miyagi struck the 1st half-century of the tournament in the afternoon for Bujjagali Rafters against Sipi Trekkers. His knock was the difference between the two sides as the Bujjagali Rafters inflicted a second defeat on the Sipi Trekkers that derailed their chance of being in the Sunday afternoon final. In the morning Sipi Trekkers were put on the sword by Itanda Kayakers defeating them by 10 wickets in a no contest. The game was over even before 12pm after starting at 9:30 am, the fast bowlers for Itanda Kayakers ripped through the top order of Sipi Trekkers and once the top had been taken care of there was nothing left for the trekkers. Sipi Trekkers skittled out for just 92 and Ronald Lutaaya and Wasim Butt knocked it off in just 7 overs. The two losses leave Sipi Trekkers in a difficult position as they will need some results to go their way if they will be able to make the final on Sunday. Itanda Kayakers will have two games tomorrow, they will take on Bujjagali Rafters in the morning and then Sipi Trekkers in the afternoon.","pubDate":"2023-01-26 21:28:38","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"Ind vs Nz 1st T20I: टीम इंडिया को झटका, ऋतुराज गायकवाड़ हुए पूरी सीरीज से बाहर","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-1st-t20i-team-india-faces-jolt-ruturaj-gaikwad-is-ruled-out-of-entire-series-3727509#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 1st T20I: टीम हार्दिक शुक्रवार से तीन मैचों की सीरीज की शुरुआत कर रही है. पहला मैच रांची में खेला जाएगा.","content":"टीम इंडिया से ज्यादा यह ऋतुराज गायकवाड़ के लिए बड़ा झटका है न्यूजीलैंड के खिलाफ शुक्रवार से शुरू हो रही तीन टी20 मैचों की सीरीज शुरू होने से पहले ही भारतीय टीम को झटका लगा है. और उसके ओपनर बल्लेबाज ऋतुराज गायकवाड़ चोट के कारण अब पूरी सीरीज से बाहर हो गए हैं. इससे पहले तक गायकवाड़ के सिर्फ पहले ही मैच से बाहर होने की खबरें आ रही थीं, लेकिन अब साफ हो गया है कि तमिलनाडु का यह बल्लेबाज सीरीज के तीनों ही मुकाबले नहीं खेल पाएगा. निश्चित तौर पर यह टीम इंडिया से ज्यादा गायकवाड़ के लिए ज्यादा बड़ा झटका है क्योंकि इस समय टीम इंडिया में ओपनिंग के लिए बहुत ही कड़ी प्रतिस्पर्धा है. बीसीसीआई के सूत्रों के अनुसार गायकवाड़ की कलायी में चोट है. और स्कैन के बाद पता चला कि यह उम्मीद से ज्यादा गंभीर है. और फिर बीसीसीआई की मेडिकल टीम से विचार-विमर्श करने के बाद गायकवाड़ ने पूरी सीरीज से हटने का फैसला किया है. गायकवाड़ को रिहैबिलिटेशन के लिए बेंगलुरू स्थित राष्ट्रीय क्रिकेट अकादमी भेजा गया है. गायकवाड़ ने एक वनडे और नौ टी20 खेले हैं. उन्होंने पिछले साल अक्टूबर में भारत के खिलाफ आखिरी मैच खेला था. गायकवाड़ के टीम इंडिया से बाहर होने के बाद अब सीरीज में पारी की शुरुआत के लिए मुकाबला शुबमन गिल और घरेलू क्रिकेट में धमाकेदार तिहरा शतक जड़कर वापसी करने वाले पृथ्वी शॉ के बीच है. गिल ने हाल ही में दिखाया है कि उनका बल्ला कैसे आग उगल रहा है. निश्चित तौर पर हालिया वनडे सीरीज के प्रदर्शन के बाद गिल का दावा स्वभाविक रूप से मजबूत नजर आ रहा है. रांची में होने वाले पहले टी20 मुकाबले के लिए भारत की संभावित इलेवन इस प्रकार है: 1. हार्दिक पांड्या (कप्तान) 2. सू्र्यकुमार यादव (उप-कप्तान) 3. शुबमन गिल 4. ईशान किशन 5. राहुल त्रिपाठी 6. दीपक हूडा 7. वॉशिंगटन सुंदर 8. कुलदीप यादव 9. युजवेंद्र चहल 10. अर्शदीप सिंह 11. उमरान मलिक * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:36:46","image_url":"https://c.ndtvimg.com/2022-11/4r3i0nlg_ruturaj-gaikwad-twitter-_625x300_28_November_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | Bavuma on SA20 snub: I'm a person who moves on with things","link":"https://www.news24.com/sport/Cricket/Proteas/bavuma-on-sa20-snub-im-a-person-who-moves-on-with-things-20230126","keywords":null,"creator":null,"video_url":null,"description":"Proteas limited-overs skipper Temba Bavuma has made peace with not being part of the SA20, saying he's moved on from that disappointment.","content":"Proteas limited-overs skipper Temba Bavuma has made peace with not being part of the SA20, saying he's moved on from that disappointment. Bavuma, who remains the captain of the T20 team, wasn't picked at last year's auction, where his base price of R850 000 wasn't able to fetch him a bid from any of the six teams. Even when players were unavailable for various reasons, Bavuma was still not picked up, with the example of Joburg Super Kings going for Sibonelo Makhanya as a replacement for England batter Harry Brooks. STAT ATTACK | Recalling red-hot Faf for Proteas would immediately relieve T20 headache Even T20 teammate Andile Phehlukwayo, who also didn't find a home during the auction, was picked up by the Paarl Royals. Bavuma admitted to the unusual nature of a national T20 captain not being in what is the premier T20 competition but said he's moved on from that disappointment. \"It seems unusual, but it has happened this way, and there's nothing I can really do about it, as unusual as it is,\" Bavuma said. \"People have to go on and I'm definitely one of those people who moves on with things. Whatever comes my way, comes my way. \"I always try to keep a smile on my face regardless of what is happening.\" Bavuma, who hasn't played white-ball cricket since South Africa's infamous 13-run loss to the Netherlands in Adelaide on 6 November, said he took it easy during the SA20 break. READ | Faf delighted after smashing unbeaten SA20 ton: 'Important to convert those scores' Bavuma featured in the three Tests against Australia that SA lost 2-0, while his provincial team, the Lions won the Cricket South Africa 1-Day Cup. Bavuma will lead the men's 50-over team for the three-match ODI series against England that starts in Bloemfontein on Friday. \"I've been taking it easy over the past two weeks and I've been connecting with family, so it's been really relaxing,\" Bavuma added. \"I tried to watch one or two games of the SA20, and it was quite exciting. I've been taking it easy and day by day.\"","pubDate":"2023-01-26 18:26:36","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Athiya Shetty-KL Rahul Wedding: परिवार ने महंगे तोहफों मिलने की खबरों का किया खंडन","link":"https://sports.ndtv.com/hindi/cricket/suniel-shetty-denies-reports-bout-gifts-given-to-athiya-shetty-and-kl-rahul-3727275#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"इन रिपोर्टों को फिल्मी और क्रिकेट फैंस दोनों ने ही हाथों हाथ लिया और देखते ही देखते यह तोहफे से जुड़ी खबर सोशल मीडिया साथ-साथ आम प्रशंसकों के बीच चर्चा का विषय गयी. इस खबर पर सोशल मीडिया ने अपने-अपने अंदाज में प्रतिक्रिया भी व्यक्त ही.","content":"केएल राहुल और आथिया शेट्टी बॉलीवुड एक्टर सुनील शेट्टी के प्रवक्ता ने आथिया शेट्टी (Athiya Shettey) और केएल राहुल (Kl Rahul) की शादी में बॉलीवुड सितारों और क्रिकेटरों से मिलने वाले महंगे तोहफों की खबरों को सिरे से खारिज कर दिया है. पिछले कई सालों से डेट कर रहे केएल राहुल और आथिया शेट्टी बीते सोमवार को सुनील शेट्टी के खंडाला स्थित आवास पर सादे समारोह में विवाह बंधन में बंधे थे. इस शादी में चुनिंदा क्रिकेटरों के अलावा बॉलीवुड सितारों ने भी हिस्सा लिया था. क्रिकेटरों की बात करें, तो इशांत शर्मा और वरुण एरॉन के विवाह समारोह में पहुंचने की तस्वीरें भी सामने आयी थीं. विवाह समारोह संपन्न होने के बाद सुनील शेट्टी ने मीडिया का आभार प्रकट करते कहा था कि आईपीएल शुरू होने से पहले मुंबई में रिसेप्शन समारोह आयोजित किया जाएगा. बता दें, कुछ मीडिया रिपोर्ट्स में बताया गया था कि नवयुगल को बॉलीवुड स्टार्स और क्रिकेटरों ने महंगे तोहफे दिए हैं. इस तरह की रिपोर्ट्स को सोशल मीडिया पर भी शेयर किया जा रहा था. गुरुवार को सुनील शेट्टी के प्रवक्ता ने कहा कि इस तरह की खबरें पूरी तरह से निराधार हैं. उन्होंने कहा कि आथिया और केएल राहुल को मिले तोहफों से जुड़ी खबरें सच नहीं है. नवविवाहित जोड़े ने आथिया शेट्टी और केएल राहुल ने समारोह अपने-अपने इंस्टाग्राम अकाउंट पर शादी समारोह की तस्वीरें साझा कीं. उन्होंने अपने-अपने सोशल मीडिया अकाउंट पर लिखा, “तुम्हारी रोशनी में, मैनें सीखा प्यार कैसे करते हैं...” आज, हमारे सबसे प्रियजनों के साथ, हमने उस घर में शादी की जिसने हमें अपार खुशी और शांति दी है. कृतज्ञता और प्यार से भरे दिल के साथ, हम इस एक साथ चलने की यात्रा पर आपका आशीर्वाद चाहते हैं.” * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:26:25","image_url":"https://c.ndtvimg.com/2023-01/41p89j5o_first-video-of-athiya-shetty-kl-rahul-after-wedding_625x300_23_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ind vs Nz 1st T20I: यह भारतीय XI पहले टी20 में मैदान पर उतरेगी, नजर दौड़ा लें","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-1st-t20i-this-is-india-final-xi-will-step-in-to-ground-against-new-zealand-in-first-t20i-3726948#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 1st T20I: न्यूजीलैंड के साथ टीम हार्दिक पहला टी20 मुकाबला शुक्रवार को रांची में खेलने जा रही है.","content":"Ind vs Nz 1st T20I: टीम इंडिया की फाइल फोटो वनडे में मेहमान टीम के सफाए के बाद बाद टी20 के कप्तान हार्दिक पांड्या (Hardik Pandya) की नजरें भी शुक्रवार को रांची में शुरू होने जा रही टी20 सीरीज में भी कीवियों के सफाए पर टिकी हुई हैं. और इसके लिए हार्दिक एंड कंपनी कोई कोर-कसर बाकी नहीं छोड़ना चाहती. मुकाबले से पहले ऋतुराज गायकवाड़ (Ruturaj Gaikwad) जरूर चोटिल होकर पहले मुकाबले से बाहर हो गए हैं, लेकिन हार्दिक अपनी ओर से कोई कोर-कसर बाकी नहीं छोड़ना चाहते. वहीं, फैंस ने भी अपने सपनों की टीम और टीम इंडिया की फाइनल इलेवन बनाना शुरू कर दिया है. चलिए हम आपको बताते हैं कि पहले मुकाबले में भारत किसी इलेवन के साथ मैदान पर उतरने जा रहा है. नजर दौड़ा लें. अब किसी की चोट किसी का फायदा बनकर आती है, तो ऋतुराज गायकवाड़ की चोट का फायदा हाल ही में वनडे में प्रचंड फॉर्म में दिख रहे शुबमन गिल को मिलेगा, जो ईशान किशन के साथ पारी की शुरू करेंगे. वहीं, रांची का विकेट स्पिनरों का मददगार रहा है, तो भारतीय मैनेजमेंट इस मैच में स्पिनरों पर दांव खेलेगा. यहां की पिच पर स्पिनरों के खिलाफ रन बनाना टेढ़ी खीर रहा है. ऐसे में \"कुलचा\" मतलब कुलदीप यादव और युजवेंद्र चहल की जोड़ी दिखायी पड़ सकती है, तो सहारा देने के लिए वॉशिंगटन सुंदर और दीपक हूडा भी होंगे. वहीं, तेज गेंदबाजी का जिम्मा अर्शदीप, उमरान मलिक और खुद कप्तान हार्दिक पांड्या पर होगा. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:25:23","image_url":"https://c.ndtvimg.com/2023-01/mqg6fr4g_team-india-afp_625x300_11_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"रांची खेलने पहुंचे कप्तान हार्दिक ने धोनी संग लिया \"शोले बाइक\" का मजा, फैंस को पसंद आ रही pic","link":"https://sports.ndtv.com/hindi/cricket/captain-hardik-panda-enjoyed-sholay-bike-with-dhoni-as-he-reached-ranchi-to-play-against-new-zealand-fans-like-the-pick-3726771#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand 1st T20I: हार्दिक की कप्तानी में टीम इंडिया शुक्रवार को पहले टी20 मुकाबले में मेहमान न्यूजीलैंड से रांची में भिड़ेगी.","content":"अब यह तो आप जानते ही हैं कि टी20 कप्तान हार्दिक पांड्या (Hardik Pandya) और उनके मेंटोर एमएस धोनी (MS Dhoni) के बीच कितनी ज्यादा छनती है. पूर्व में ऐसे कई मौके रहे, जब हार्दिक ने खुलकर धोनी के प्रति अपने प्यार और सम्मान को प्रदर्शित था. यह कोविड-काल के बाद का समय था, जब हार्दिक अपने भाई क्रुणाल के साथ धोनी का जन्मदिन मनाने रांची पहुंच गए थे. और अब जब टीम इंडिया वीरवार को न्यूजीलैंड के खिलाफ जब तीन टी-20 मैचों की सीरीज का पहला मैच खेलने धोनी के गृहनगर रांची पहुंची तो भला ऐसे कैसे हो सकता था कि हार्दिक अपने मेंटोर से न मिलते. रांची पहुंचते ही हार्दिक ने धोनी से मुलाकात तो की ही, बल्कि \"गुरु\" मिलन की तस्वीर भी उन्होंने अपने ट्विटर अकाउंट पर पोस्ट की. इस फोटो में धोनी एक ऐसी मोटरबाइक पर दिख रहे हैं, जैसी शोले फिल्म में \"ये दोस्त हम नहीं तोड़ेंगे...\" गाने के दौरान दिखायी गयी थी. Sholay 2 coming soon इस तस्वीर में जहां हार्दिक बाइक की मेन सीट, तो एमएस धोनी उसे जुड़े सीट पर बैठे दिखायी पड़ रहे हैं. और इसका कैप्शन हार्दिक ने दिया है-\"शोले 2 कमिंग सून.\" इससे आप इन दोनों की दोस्ती के बारे में सहज ही अंदाजा लगा सकते हैं. वैसे आप तो यह जानते ही हैं कि धोनी कितने बड़े बाइकप्रेमी हैं. ऐसे में एक बार को यह तस्वीर धोनी के गैराज की हो सकती हैं, जहां धोनी ने अपनी तमाम पुरानी से लेकर नयी बाइक जमा कर रखी हैं. बहरहाल, हार्दिक और धोनी की यह तस्वीर फैंस को बहुत ही पसंद आ रही है और इस पर खासी प्रतिक्रिया भी देखने को मिली है. वनडे में मेहमान न्यूजीलैंड का सफाया करने के बाद अब टीम हार्दिक की नजर शुक्रवार से शुरू हो रही टी20 सीरीज पर टिकी है. तीन मैचों की सीरीज का पहला मुकाबला शुक्रवार को रांची के जेएससीए इंटरनेशनल स्टेडियम में खेला जाएगा. मुकाबले को लेकर टीम इंडिया ने वीरवार को नेट पर खासा अभ्यास किया. और जब धोनी भी स्टेडियम में ट्रेनिंग के लिए पहुंचे, तो खिलाड़ी उनकी उपस्थिति में खासे उत्साहित दिखायी पड़े. फैंस को तस्वीर खासी पसंद आयी Close Enough धोनी के गैराज की ही तस्वीर है Mahi's vintage car garage यह प्रशंसक हार्दिक को नसीहत दे रहा है Ye ENFIELD toh badiya hai but Thoda ONFIELD nakhre kam kiya karo hardik pandya! * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:23:17","image_url":"https://c.ndtvimg.com/2023-01/s9abbagg_hardik-pandya-in-press-conference-bcci_625x300_08_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"इस भारतीय बल्लेबाज के बिना तीनों फौरमेट होने ही नहीं चाहिए\", सुरेश रैना का बड़ा बयान","link":"https://sports.ndtv.com/hindi/cricket/all-there-format-even-should-not-exist-without-this-indias-batsman-suresh-raina-makes-big-statement-3726401#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia: अब जबकि ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज सिर उठाए खड़ी है, तो इलेवन को लेकर चर्चा अभी से शुरू हो गयी है.","content":"पूर्व बल्लेबाज सुरेश रैना पूर्व भारतीय क्रिकेटर सुरेश रैना का मानना है कि व्हाइट-बॉल क्रिकेट में सफलता के बाद टी20 के आईसीसी प्लयेर ऑफ द ईयर सूर्यकुमार यादव (Suryakumar Yadav) को टेस्ट इलेवन का हिस्सा बनाए जाने की जरूरत है. उन्होंने कहा कि बिना सूर्यकुमार यादव के तीनों फौरमेट नहीं ही होना चाहिए. गुजरा साल सूर्यकुमार यादव के लिए बहुत ही सनसनी वाला साल रहा है. और उन्होंने टी20 में वह रिकॉर्ड बनाया, जो पहले इस फौरमेट में नहीं ही बना था. सूर्यकुमार यादव गुजरे साल टी20 में एक हजार रन बनाने वाले सिर्फ दूसरे बल्लेबाज तो बने ही, साथ ही वह साल में सबसे ज्यादा रन बनाने वाले बल्लेबाज भी बने. सूर्यकुमार ने 187.43 के स्ट्राइक-रेट से 1,164 रनबनाए. और इसका क्रिकेट की पैतृक संस्था आईसीसी ने भी लोहा माना और उन्हें टी20 क्रिकेटर ऑफ द ईयर चुना, जो बताने के लिए काफी है कि यादव किस स्तर के बल्लेबाज हैं. एक टीवी चैनल पर आकाश चोपड़ा के साथ बातचीत में रैना ने कहा कि जिस अंदाज में सूर्यकुमार यादव बल्लेबाजी कर रहे हैं, निश्चित रूप से वह तीनों फौरमेटों का हिस्सा होना चाहिए. उनके बिना तीनों फौरेट होने ही नहीं चाहिए. जिस तरह उन्होंने परफॉर्म किया है, रनों के प्रति जैसी भूख उन्होंने जतायी है, जिस तरह वह अलग-अलग शॉट की योजना बनाते हैं और जिस निर्भीकता के साथ मैदान के आकार का इस्तेमाल करते हैं, वह बहुत ही काबिलेतारीफ है. पूर्व बल्लेबाज ने कहा कि वह मुंबई के खिलाड़ी हैं और अच्छी तरह जानते हैं कि रेड-बॉल क्रिकेट कैसे खेलनी है. मुझे लगता है कि उनके टेस्ट इलेवन में चयनित होने के अच्छे आसार है. टेस्ट क्रिकेट खेलने से वह वनडे में भी स्थापित होंगे और उन्हें स्थायित्व भी आएगा. वह कई शतक और फिर दोहरे शतक जडेंगे. रैना की इस बात पर सहमति जताते हुए पूर्व लेग स्पिनर प्रज्ञान ओझा ने कहा कि निश्चित तौर पर सूर्यकुमार योक टेस्ट इलेवन का हिस्सा होना चाहिए. जिस तरह उन्होंने क्रिकेट खेली है और जैसा प्रदर्शन किया है, वह तीनों फौरमेट में खेलने ही चाहिए. मैं जानता हूं कि ऐसा सवाल क्यों हो रहा है. यह सवाल नियमित रूप से बेहतर कर रहे सरफराज खान के कारण है. निश्चित तौर पर सरफराज को लेकर भी मैनेजमेंट का मन मचल रहा है, लेकिन सूर्यकुमार टेस्ट टीम में चयन का निश्चित तौर पर हकदार हैं. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:19:45","image_url":"https://c.ndtvimg.com/2022-02/ma6q1csg_suresh-raina-bcciipl_650x400_15_February_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ T20: ऋतुराज गायकवाड़ के चोटिल होने के बाद इस खिलाड़ी की लगी लॉटरी, न्यूजीलैंड के खिलाफ धमाल मचाने को है तैयार","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-t20-after-rituraj-gaikwads-injury-this-players-lottery-ready-to-rock-against-new-zealand-ind-vs-nz-1st-t20-playing-11-3725552#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ T20: वनडे सीरीज में न्यूजीलैंड के खिलाफ अपने धमाकेदार प्रदर्शन के बाद अब टी20 सीरीज में भी टीम इंडिया अपना जलवा कायम रखना चाहेगी.","content":"Ruturaj Gaikwad हार्दिक पंड्या (Hardik Pandya) की कप्तानी में टीम इंडिया न्यूजीलैंड के खिलाफ (Ind vs Nz) तीन टी20 मुकाबला खेलेगी, जिसकी शुरुआत 27 जनवरी को JSCA स्टेडियम रांची से होगा. वनडे सीरीज में न्यूजीलैंड (Ind vs Nz Odi) के खिलाफ अपने धमाकेदार प्रदर्शन के बाद अब टी20 सीरीज में भी टीम इंडिया अपना जलवा कायम रखना चाहेगी. सीनियर खिलाड़ी रोहित शर्मा (Rohit Sharma) और विराट कोहली (Virat Kohli) की गैरमौजूदगी में युवा खिलाड़ियों के पास अपने बेहतरीन प्रदर्शन को दिखने का भरपूर मौका होगा. न्यूजीलैंड के खिलाफ टी20 स्क्वॉड (Team India T20 Squad vs Nz) में शामिल किये गए ऋतुराज गायकवाड़ (Ruturaj Gaikwad Injury) के चोटिल होने की खबर के बाद अब युवा बल्लेबाज़ पृथ्वी शॉ (Prithvi Shaw) के पास सुनहरा मौका होगा. पृथ्वी शॉ (Prithvi Shaw) को टीम में सलामी बल्लेबाज़ के विकल्प के तौर पर टीम में जोड़ा गया था. (Team India T20 Squad) टी20 स्क्वॉड में पृथ्वी शॉ को मौका मिलना उनके रणजी ट्रॉफी (Prithvi Shaw Ranji) में मुंबई के लिए शानदार प्रदर्शन का नतीजा है. शुभमन गिल (Shubman Gill) को श्रीलंका के खिलाफ टी20 फॉर्मेट में डेब्यू का मौका मिला तब ईशान किशन (Ishan Kishan) और गिल (Shubman Gill) की ओपनिंग जोड़ी ने जिम्मेदारी संभाली थी, लेकिन ईशान किशन (Ishan Kishan T20 Record) का प्रदर्शन बतौर ओपनिंग बल्लेबाज़ खास नहीं रहा था, लेकिन वनडे में ईशान किशन (Ishan Kishan Odi Record) ने जरूर अपने प्रदर्शन से सबका दिल जीता है. टी20 फॉर्मेट की बात करें तो न्यूजीलैंड के खिलाफ एक बार फिर शुभमन गिल और ईशान किशन की ओपनिंग जोड़ी (Shubman Gill and Ishan Kishan Opening) दिखने के पूरे आसार है और अगर इस जोड़ी के प्रदर्शन में जरा भी चूक हुई तो उसका फायदा युवा बल्लेबाज़ पृथ्वी शॉ को होगा. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:19:33","image_url":"https://c.ndtvimg.com/2023-01/d3ga57ro_team-india_625x300_07_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Younger players hampered by ‘impossible’ cricket schedule, says England captain Jos Buttler","link":"https://www.standard.co.uk/sport/cricket/england-cricket-jos-buttler-b1055857.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"As Harry Brook and Ben Duckett continue to impress across other formats, the England skipper sympathises with the talented youngsters","content":"says he feels for ’s most talented young players, who face an “impossible” task to become all-format cricketers due to the game’s overloaded schedule. Buttler’s ODI team begin their World Cup build-up in earnest with a three-match series in South Africa, starting with the opener in Bloemfontein tomorrow. Among the players hoping to stake a claim for a place on the flight to India in October are batters , who will make his 50-over debut having already excelled in T20 and Test colours, and , who will win his first ODI cap in more than six years, having impressed during recalls in the other two formats. Time is of the essence for both Duckett and Brook, neither of whom are expected to be available for England’s next ODI series in Bangladesh. That begins in Dhaka on March 1, the day after England’s Test tour to New Zealand - for which both have been selected - is scheduled to finish in Wellington. “I feel for the players to be honest,” Buttler said. “There are certain players who have the ability to play all three formats but that is kind of impossible because of the schedules. “That is a frustration I would have if I was a young player growing up now, that you don’t want to feel pigeon-holed as a player because the schedule doesn’t allow you to play everything.” Duckett and Brook are expected to bat at three and four, respectively, in South Africa, though at this stage they look to be vying for a single position in England’s first-choice XI, with Joe Root rested for this series but nailed on to return to the side for the World Cup. “It’s going to be pretty impossible for those guys to be involved [in Bangladesh], so it’s really important we expose them here and give them opportunity,” Buttler added. “We’ve got to use these games here and in Bangladesh to experiment a bit, expose people to playing international cricket. That’s just something we have to manage the whole way through. If we play well, I think we should win games of cricket.” Buttler also revealed that, with Jonny Bairstow still injured, Dawid Malan will open alongside the under-pressure Jason Roy, the Yorkshire batter set to get the nod over Phil Salt, who has been struggling with illness in the build-up. “My preference is Malan and Roy to open at the start of the series,” Buttler confirmed. “Malan has performed very well in international cricket for a long time. [He’s] batted three at certain times, but we want to get Duckett and Brook in at three and four to expose them. Harry Brook. “Jason has an outstanding record over a long period of time. He knows he’s not performing as well as he’d like to at the minute, he knows that more than anyone, but we are backing him. He has been a really influential figure in white-ball cricket, the 50-over team. He has been exceptional for a long period of time. We think he has loads to offer, and are excited to see him get back to his best.” Following the Bangladesh tour, England do not play another ODI until September, with the front half of the home summer geared around the Ashes and then the Hundred granted its own window in August. Consistency in selection had been one of the pillars of England’s rise in the build-up to the 2019 World Cup, with players - once picked - given ample opportunity to succeed in defined roles. Head coach Matthew Mott reiterated earlier this week that he wants it to be “harder to get in the team than get out of it” but the lack of ODI cricket between now and the World Cup means Buttler is aware of the need for an open mind. “We have to look at what everyone’s doing, whether that be playing in franchise tournaments, whether that’s playing in the Test team, IPL, the Hundred and the Blast,” he added. “If people are performing really well and banging the door down, that’s what’s been happening for a long time in white ball cricket, and I expect guys to be doing everything they can over the next nine months to put their name in the hat as well. “That’s wherever they are playing their cricket - it doesn’t have to be here in ODIs for England. You can demand a place in that squad wherever you’re playing. That competition for places is something that’s driven standards for a long time, and I want that to continue.”","pubDate":"2023-01-26 18:00:36","image_url":"https://static.standard.co.uk/2023/01/26/16/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"इन तीन दिग्गजों को पीछे छोड़ बाबर आजम ने जीता आईसीसी का सबसे प्रतिष्ठित अवार्ड","link":"https://sports.ndtv.com/hindi/cricket/babar-azam-won-icc-most-prestigious-award-by-dipping-these-three-stalwarts-3726582#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ICC Awards: वैसे अगर बाबर प्लेयर ऑफ द ईयर (सभी फौरमेटों को मिलाकर) चुने गए, तो उसकी वजह यह भी रही कि उनका टेस्ट में भी प्रदर्शन शानदार रहा. फिर भले ही टीम का प्रदर्शन ज्यादा अच्छा न रहा हो.","content":"पाकिस्तान के पूर्व कप्तान बाबर आजम पाकिस्तान के कप्तान बाबर आजम (Babar Azam) ने पिछले साल जमकर रन बरसाए, तो उनका इनाम भी उन्हें मिल गया है. बाबर को आईसीसी मेन क्रिकेटर ऑफ द ईयर चुना गया है. बाबर आजम ने पिछले साल एक से बढ़कर एक पारियां खेलीं और अपने कई निजी रिकॉर्ड तोड़े. इस दौरान पाकिस्तान टीम के प्रदर्शन में खासे उतार भी रहे, लेकिन जो चीज नहीं बदली, वह रहा बाबर का प्रदर्शन. पाकिस्तान कप्तान ने कई रिकॉर्ड तोड़ते हुए 54.12 के औसत से तीनों फौरमेट में 2598 रन बनाए. बाबर पिछले साल इकलौते ऐसे बल्लेबाज रहे, जिन्होंने पूरे कैलेंडर ईयर में सभी फौरमेटों में दो हजार से ज्यादा रन बनाए. बाबर ने सीजन में आठ शतक और 17 अर्द्धशतक बनाए. यही वजह रही कि बाबर तीनों प्रतिद्वंद्वियों को पछाड़ते हुए सर गैरी सोबर्स ट्रॉफी को अपनी झोली में डाल लिया. खेल का फिफ्टी-फिफ्टी फौरमेट साल 2021 और 2022 के वनडे प्लेयर ऑफ द ईयर बाबर के दबदबे वाला ही रहा. बाबर ने नौ मैचों में 679 रन बनाए. बाबर की नियमितता आप इस बात से समझ सकते हैं कि पाकिस्तान कप्तान ने नौ में से आठ पारियों में पचास या इससे ज्यादा की पारियां खेलीं. ऐसे में कोई चौंकाने वाली बात नहीं रही कि 28 साल के बाबर को लगातार दूसरे साल पुरुषों की कैटेगिरी में प्लेयर ऑफ द ईयर चुना गया. वहीं बाबर वनडे रैंकिंग में नंबर एक बल्लेबाज बने हुए हैं. वैसे अगर बाबर प्लेयर ऑफ द ईयर (सभी फौरमेटों को मिलाकर) चुने गए, तो उसकी वजह यह भी रही कि उनका टेस्ट में भी प्रदर्शन शानदार रहा. फिर भले ही टीम का प्रदर्शन ज्यादा अच्छा न रहा हो. दीर्घकालिक फौरमेट में पाकिस्तान के लिए नौ मैचों में 1184 रन बनाए. बता दें कि क्रिकेटर ऑफ द ईयर कैटेगिरी के लिए पाकिस्तान से बाबर आजम, इंग्लैंड के बेन स्टोक्स, जिंबाब्वे के सिकंदर रजा और न्यूजीलैंड के टिम साऊदी नामित थे, लेकिन फैंस और जूरी पैनल का निर्णय बाबर आजम के पक्ष में गया और यह चौंकाने वाली बात बिल्कुल भी नहीं है. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 17:08:07","image_url":"https://c.ndtvimg.com/2023-01/3kl6e4cg_babar-azam_625x300_09_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sipi Trekkers find slippery track against Itanda Kayakers, Bujjagali Rafters","link":"https://kawowo.com/2023/01/27/sipi-trekkers-find-slippery-track-against-itanda-kayakers-bujjagali-rafters/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"The Water Falls T20 League Men’s EditionGame 1: Sipi Trekkers v Itanda KayakersSipi Trekkers 92 all outItanda Kayakers 93/ 0Itanda Kayakers won by 10 wicketsPlayer of the Match: Igance Niteriganya (3/15)Match Highlights: https://fromsmash.com/GAME-ONE-SHORT-HIGHLIGHTSLive score link: https://cricclubs.com/viewScorecard.do?&matchId=1715&clubId=5335 Game 2: Sipi Trekkers v Bujjagali RaftersBujjagali Rafters 175/8Sipi Trekkers 115Bujjagali Rafters by 60 runsPlayer of the Match: Juma […] The post Sipi Trekkers find slippery track against Itanda Kayakers, Bujjagali Rafters appeared first on Kawowo Sports.","content":"The Water Falls T20 League Men’s Edition Game 1: Sipi Trekkers v Itanda Kayakers Sipi Trekkers 92 all out Itanda Kayakers 93/ 0 Itanda Kayakers won by 10 wickets Player of the Match: Igance Niteriganya (3/15) Match Highlights: https://fromsmash.com/GAME-ONE-SHORT-HIGHLIGHTS Live score link: https://cricclubs.com/viewScorecard.do?&matchId=1715&clubId=5335 Game 2: Sipi Trekkers v Bujjagali Rafters Bujjagali Rafters 175/8 Sipi Trekkers 115 Bujjagali Rafters by 60 runs Player of the Match: Juma Miyagi Full Match Scorecard: https://cricclubs.com/viewScorecard.do?&matchId=1716&clubId=5335 The men’s edition of the Water Falls T20 League started off with pomp and good-quality cricket. Cricket Cranes All Rounder Juma Miyagi struck the 1st half-century of the tournament in the afternoon for Bujjagali Rafters against Sipi Trekkers. His knock was the difference between the two sides as the Bujjagali Rafters inflicted a second defeat on the Sipi Trekkers that derailed their chance of being in the Sunday afternoon final. In the morning Sipi Trekkers were put on the sword by Itanda Kayakers defeating them by 10 wickets in a no contest. The game was over even before 12pm after starting at 9:30 am, the fast bowlers for Itanda Kayakers ripped through the top order of Sipi Trekkers and once the top had been taken care of there was nothing left for the trekkers. Sipi Trekkers skittled out for just 92 and Ronald Lutaaya and Wasim Butt knocked it off in just 7 overs. The two losses leave Sipi Trekkers in a difficult position as they will need some results to go their way if they will be able to make the final on Sunday. Itanda Kayakers will have two games tomorrow, they will take on Bujjagali Rafters in the morning and then Sipi Trekkers in the afternoon.","pubDate":"2023-01-26 21:28:38","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"Ind vs Nz 1st T20I: टीम इंडिया को झटका, ऋतुराज गायकवाड़ हुए पूरी सीरीज से बाहर","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-1st-t20i-team-india-faces-jolt-ruturaj-gaikwad-is-ruled-out-of-entire-series-3727509#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 1st T20I: टीम हार्दिक शुक्रवार से तीन मैचों की सीरीज की शुरुआत कर रही है. पहला मैच रांची में खेला जाएगा.","content":"टीम इंडिया से ज्यादा यह ऋतुराज गायकवाड़ के लिए बड़ा झटका है न्यूजीलैंड के खिलाफ शुक्रवार से शुरू हो रही तीन टी20 मैचों की सीरीज शुरू होने से पहले ही भारतीय टीम को झटका लगा है. और उसके ओपनर बल्लेबाज ऋतुराज गायकवाड़ चोट के कारण अब पूरी सीरीज से बाहर हो गए हैं. इससे पहले तक गायकवाड़ के सिर्फ पहले ही मैच से बाहर होने की खबरें आ रही थीं, लेकिन अब साफ हो गया है कि तमिलनाडु का यह बल्लेबाज सीरीज के तीनों ही मुकाबले नहीं खेल पाएगा. निश्चित तौर पर यह टीम इंडिया से ज्यादा गायकवाड़ के लिए ज्यादा बड़ा झटका है क्योंकि इस समय टीम इंडिया में ओपनिंग के लिए बहुत ही कड़ी प्रतिस्पर्धा है. बीसीसीआई के सूत्रों के अनुसार गायकवाड़ की कलायी में चोट है. और स्कैन के बाद पता चला कि यह उम्मीद से ज्यादा गंभीर है. और फिर बीसीसीआई की मेडिकल टीम से विचार-विमर्श करने के बाद गायकवाड़ ने पूरी सीरीज से हटने का फैसला किया है. गायकवाड़ को रिहैबिलिटेशन के लिए बेंगलुरू स्थित राष्ट्रीय क्रिकेट अकादमी भेजा गया है. गायकवाड़ ने एक वनडे और नौ टी20 खेले हैं. उन्होंने पिछले साल अक्टूबर में भारत के खिलाफ आखिरी मैच खेला था. गायकवाड़ के टीम इंडिया से बाहर होने के बाद अब सीरीज में पारी की शुरुआत के लिए मुकाबला शुबमन गिल और घरेलू क्रिकेट में धमाकेदार तिहरा शतक जड़कर वापसी करने वाले पृथ्वी शॉ के बीच है. गिल ने हाल ही में दिखाया है कि उनका बल्ला कैसे आग उगल रहा है. निश्चित तौर पर हालिया वनडे सीरीज के प्रदर्शन के बाद गिल का दावा स्वभाविक रूप से मजबूत नजर आ रहा है. रांची में होने वाले पहले टी20 मुकाबले के लिए भारत की संभावित इलेवन इस प्रकार है: 1. हार्दिक पांड्या (कप्तान) 2. सू्र्यकुमार यादव (उप-कप्तान) 3. शुबमन गिल 4. ईशान किशन 5. राहुल त्रिपाठी 6. दीपक हूडा 7. वॉशिंगटन सुंदर 8. कुलदीप यादव 9. युजवेंद्र चहल 10. अर्शदीप सिंह 11. उमरान मलिक * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:36:46","image_url":"https://c.ndtvimg.com/2022-11/4r3i0nlg_ruturaj-gaikwad-twitter-_625x300_28_November_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | Bavuma on SA20 snub: I'm a person who moves on with things","link":"https://www.news24.com/sport/Cricket/Proteas/bavuma-on-sa20-snub-im-a-person-who-moves-on-with-things-20230126","keywords":null,"creator":null,"video_url":null,"description":"Proteas limited-overs skipper Temba Bavuma has made peace with not being part of the SA20, saying he's moved on from that disappointment.","content":"Proteas limited-overs skipper Temba Bavuma has made peace with not being part of the SA20, saying he's moved on from that disappointment. Bavuma, who remains the captain of the T20 team, wasn't picked at last year's auction, where his base price of R850 000 wasn't able to fetch him a bid from any of the six teams. Even when players were unavailable for various reasons, Bavuma was still not picked up, with the example of Joburg Super Kings going for Sibonelo Makhanya as a replacement for England batter Harry Brooks. STAT ATTACK | Recalling red-hot Faf for Proteas would immediately relieve T20 headache Even T20 teammate Andile Phehlukwayo, who also didn't find a home during the auction, was picked up by the Paarl Royals. Bavuma admitted to the unusual nature of a national T20 captain not being in what is the premier T20 competition but said he's moved on from that disappointment. \"It seems unusual, but it has happened this way, and there's nothing I can really do about it, as unusual as it is,\" Bavuma said. \"People have to go on and I'm definitely one of those people who moves on with things. Whatever comes my way, comes my way. \"I always try to keep a smile on my face regardless of what is happening.\" Bavuma, who hasn't played white-ball cricket since South Africa's infamous 13-run loss to the Netherlands in Adelaide on 6 November, said he took it easy during the SA20 break. READ | Faf delighted after smashing unbeaten SA20 ton: 'Important to convert those scores' Bavuma featured in the three Tests against Australia that SA lost 2-0, while his provincial team, the Lions won the Cricket South Africa 1-Day Cup. Bavuma will lead the men's 50-over team for the three-match ODI series against England that starts in Bloemfontein on Friday. \"I've been taking it easy over the past two weeks and I've been connecting with family, so it's been really relaxing,\" Bavuma added. \"I tried to watch one or two games of the SA20, and it was quite exciting. I've been taking it easy and day by day.\"","pubDate":"2023-01-26 18:26:36","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Athiya Shetty-KL Rahul Wedding: परिवार ने महंगे तोहफों मिलने की खबरों का किया खंडन","link":"https://sports.ndtv.com/hindi/cricket/suniel-shetty-denies-reports-bout-gifts-given-to-athiya-shetty-and-kl-rahul-3727275#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"इन रिपोर्टों को फिल्मी और क्रिकेट फैंस दोनों ने ही हाथों हाथ लिया और देखते ही देखते यह तोहफे से जुड़ी खबर सोशल मीडिया साथ-साथ आम प्रशंसकों के बीच चर्चा का विषय गयी. इस खबर पर सोशल मीडिया ने अपने-अपने अंदाज में प्रतिक्रिया भी व्यक्त ही.","content":"केएल राहुल और आथिया शेट्टी बॉलीवुड एक्टर सुनील शेट्टी के प्रवक्ता ने आथिया शेट्टी (Athiya Shettey) और केएल राहुल (Kl Rahul) की शादी में बॉलीवुड सितारों और क्रिकेटरों से मिलने वाले महंगे तोहफों की खबरों को सिरे से खारिज कर दिया है. पिछले कई सालों से डेट कर रहे केएल राहुल और आथिया शेट्टी बीते सोमवार को सुनील शेट्टी के खंडाला स्थित आवास पर सादे समारोह में विवाह बंधन में बंधे थे. इस शादी में चुनिंदा क्रिकेटरों के अलावा बॉलीवुड सितारों ने भी हिस्सा लिया था. क्रिकेटरों की बात करें, तो इशांत शर्मा और वरुण एरॉन के विवाह समारोह में पहुंचने की तस्वीरें भी सामने आयी थीं. विवाह समारोह संपन्न होने के बाद सुनील शेट्टी ने मीडिया का आभार प्रकट करते कहा था कि आईपीएल शुरू होने से पहले मुंबई में रिसेप्शन समारोह आयोजित किया जाएगा. बता दें, कुछ मीडिया रिपोर्ट्स में बताया गया था कि नवयुगल को बॉलीवुड स्टार्स और क्रिकेटरों ने महंगे तोहफे दिए हैं. इस तरह की रिपोर्ट्स को सोशल मीडिया पर भी शेयर किया जा रहा था. गुरुवार को सुनील शेट्टी के प्रवक्ता ने कहा कि इस तरह की खबरें पूरी तरह से निराधार हैं. उन्होंने कहा कि आथिया और केएल राहुल को मिले तोहफों से जुड़ी खबरें सच नहीं है. नवविवाहित जोड़े ने आथिया शेट्टी और केएल राहुल ने समारोह अपने-अपने इंस्टाग्राम अकाउंट पर शादी समारोह की तस्वीरें साझा कीं. उन्होंने अपने-अपने सोशल मीडिया अकाउंट पर लिखा, “तुम्हारी रोशनी में, मैनें सीखा प्यार कैसे करते हैं...” आज, हमारे सबसे प्रियजनों के साथ, हमने उस घर में शादी की जिसने हमें अपार खुशी और शांति दी है. कृतज्ञता और प्यार से भरे दिल के साथ, हम इस एक साथ चलने की यात्रा पर आपका आशीर्वाद चाहते हैं.” * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:26:25","image_url":"https://c.ndtvimg.com/2023-01/41p89j5o_first-video-of-athiya-shetty-kl-rahul-after-wedding_625x300_23_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ind vs Nz 1st T20I: यह भारतीय XI पहले टी20 में मैदान पर उतरेगी, नजर दौड़ा लें","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-1st-t20i-this-is-india-final-xi-will-step-in-to-ground-against-new-zealand-in-first-t20i-3726948#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 1st T20I: न्यूजीलैंड के साथ टीम हार्दिक पहला टी20 मुकाबला शुक्रवार को रांची में खेलने जा रही है.","content":"Ind vs Nz 1st T20I: टीम इंडिया की फाइल फोटो वनडे में मेहमान टीम के सफाए के बाद बाद टी20 के कप्तान हार्दिक पांड्या (Hardik Pandya) की नजरें भी शुक्रवार को रांची में शुरू होने जा रही टी20 सीरीज में भी कीवियों के सफाए पर टिकी हुई हैं. और इसके लिए हार्दिक एंड कंपनी कोई कोर-कसर बाकी नहीं छोड़ना चाहती. मुकाबले से पहले ऋतुराज गायकवाड़ (Ruturaj Gaikwad) जरूर चोटिल होकर पहले मुकाबले से बाहर हो गए हैं, लेकिन हार्दिक अपनी ओर से कोई कोर-कसर बाकी नहीं छोड़ना चाहते. वहीं, फैंस ने भी अपने सपनों की टीम और टीम इंडिया की फाइनल इलेवन बनाना शुरू कर दिया है. चलिए हम आपको बताते हैं कि पहले मुकाबले में भारत किसी इलेवन के साथ मैदान पर उतरने जा रहा है. नजर दौड़ा लें. अब किसी की चोट किसी का फायदा बनकर आती है, तो ऋतुराज गायकवाड़ की चोट का फायदा हाल ही में वनडे में प्रचंड फॉर्म में दिख रहे शुबमन गिल को मिलेगा, जो ईशान किशन के साथ पारी की शुरू करेंगे. वहीं, रांची का विकेट स्पिनरों का मददगार रहा है, तो भारतीय मैनेजमेंट इस मैच में स्पिनरों पर दांव खेलेगा. यहां की पिच पर स्पिनरों के खिलाफ रन बनाना टेढ़ी खीर रहा है. ऐसे में \"कुलचा\" मतलब कुलदीप यादव और युजवेंद्र चहल की जोड़ी दिखायी पड़ सकती है, तो सहारा देने के लिए वॉशिंगटन सुंदर और दीपक हूडा भी होंगे. वहीं, तेज गेंदबाजी का जिम्मा अर्शदीप, उमरान मलिक और खुद कप्तान हार्दिक पांड्या पर होगा. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:25:23","image_url":"https://c.ndtvimg.com/2023-01/mqg6fr4g_team-india-afp_625x300_11_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"रांची खेलने पहुंचे कप्तान हार्दिक ने धोनी संग लिया \"शोले बाइक\" का मजा, फैंस को पसंद आ रही pic","link":"https://sports.ndtv.com/hindi/cricket/captain-hardik-panda-enjoyed-sholay-bike-with-dhoni-as-he-reached-ranchi-to-play-against-new-zealand-fans-like-the-pick-3726771#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand 1st T20I: हार्दिक की कप्तानी में टीम इंडिया शुक्रवार को पहले टी20 मुकाबले में मेहमान न्यूजीलैंड से रांची में भिड़ेगी.","content":"अब यह तो आप जानते ही हैं कि टी20 कप्तान हार्दिक पांड्या (Hardik Pandya) और उनके मेंटोर एमएस धोनी (MS Dhoni) के बीच कितनी ज्यादा छनती है. पूर्व में ऐसे कई मौके रहे, जब हार्दिक ने खुलकर धोनी के प्रति अपने प्यार और सम्मान को प्रदर्शित था. यह कोविड-काल के बाद का समय था, जब हार्दिक अपने भाई क्रुणाल के साथ धोनी का जन्मदिन मनाने रांची पहुंच गए थे. और अब जब टीम इंडिया वीरवार को न्यूजीलैंड के खिलाफ जब तीन टी-20 मैचों की सीरीज का पहला मैच खेलने धोनी के गृहनगर रांची पहुंची तो भला ऐसे कैसे हो सकता था कि हार्दिक अपने मेंटोर से न मिलते. रांची पहुंचते ही हार्दिक ने धोनी से मुलाकात तो की ही, बल्कि \"गुरु\" मिलन की तस्वीर भी उन्होंने अपने ट्विटर अकाउंट पर पोस्ट की. इस फोटो में धोनी एक ऐसी मोटरबाइक पर दिख रहे हैं, जैसी शोले फिल्म में \"ये दोस्त हम नहीं तोड़ेंगे...\" गाने के दौरान दिखायी गयी थी. Sholay 2 coming soon इस तस्वीर में जहां हार्दिक बाइक की मेन सीट, तो एमएस धोनी उसे जुड़े सीट पर बैठे दिखायी पड़ रहे हैं. और इसका कैप्शन हार्दिक ने दिया है-\"शोले 2 कमिंग सून.\" इससे आप इन दोनों की दोस्ती के बारे में सहज ही अंदाजा लगा सकते हैं. वैसे आप तो यह जानते ही हैं कि धोनी कितने बड़े बाइकप्रेमी हैं. ऐसे में एक बार को यह तस्वीर धोनी के गैराज की हो सकती हैं, जहां धोनी ने अपनी तमाम पुरानी से लेकर नयी बाइक जमा कर रखी हैं. बहरहाल, हार्दिक और धोनी की यह तस्वीर फैंस को बहुत ही पसंद आ रही है और इस पर खासी प्रतिक्रिया भी देखने को मिली है. वनडे में मेहमान न्यूजीलैंड का सफाया करने के बाद अब टीम हार्दिक की नजर शुक्रवार से शुरू हो रही टी20 सीरीज पर टिकी है. तीन मैचों की सीरीज का पहला मुकाबला शुक्रवार को रांची के जेएससीए इंटरनेशनल स्टेडियम में खेला जाएगा. मुकाबले को लेकर टीम इंडिया ने वीरवार को नेट पर खासा अभ्यास किया. और जब धोनी भी स्टेडियम में ट्रेनिंग के लिए पहुंचे, तो खिलाड़ी उनकी उपस्थिति में खासे उत्साहित दिखायी पड़े. फैंस को तस्वीर खासी पसंद आयी Close Enough धोनी के गैराज की ही तस्वीर है Mahi's vintage car garage यह प्रशंसक हार्दिक को नसीहत दे रहा है Ye ENFIELD toh badiya hai but Thoda ONFIELD nakhre kam kiya karo hardik pandya! * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:23:17","image_url":"https://c.ndtvimg.com/2023-01/s9abbagg_hardik-pandya-in-press-conference-bcci_625x300_08_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"इस भारतीय बल्लेबाज के बिना तीनों फौरमेट होने ही नहीं चाहिए\", सुरेश रैना का बड़ा बयान","link":"https://sports.ndtv.com/hindi/cricket/all-there-format-even-should-not-exist-without-this-indias-batsman-suresh-raina-makes-big-statement-3726401#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia: अब जबकि ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज सिर उठाए खड़ी है, तो इलेवन को लेकर चर्चा अभी से शुरू हो गयी है.","content":"पूर्व बल्लेबाज सुरेश रैना पूर्व भारतीय क्रिकेटर सुरेश रैना का मानना है कि व्हाइट-बॉल क्रिकेट में सफलता के बाद टी20 के आईसीसी प्लयेर ऑफ द ईयर सूर्यकुमार यादव (Suryakumar Yadav) को टेस्ट इलेवन का हिस्सा बनाए जाने की जरूरत है. उन्होंने कहा कि बिना सूर्यकुमार यादव के तीनों फौरमेट नहीं ही होना चाहिए. गुजरा साल सूर्यकुमार यादव के लिए बहुत ही सनसनी वाला साल रहा है. और उन्होंने टी20 में वह रिकॉर्ड बनाया, जो पहले इस फौरमेट में नहीं ही बना था. सूर्यकुमार यादव गुजरे साल टी20 में एक हजार रन बनाने वाले सिर्फ दूसरे बल्लेबाज तो बने ही, साथ ही वह साल में सबसे ज्यादा रन बनाने वाले बल्लेबाज भी बने. सूर्यकुमार ने 187.43 के स्ट्राइक-रेट से 1,164 रनबनाए. और इसका क्रिकेट की पैतृक संस्था आईसीसी ने भी लोहा माना और उन्हें टी20 क्रिकेटर ऑफ द ईयर चुना, जो बताने के लिए काफी है कि यादव किस स्तर के बल्लेबाज हैं. एक टीवी चैनल पर आकाश चोपड़ा के साथ बातचीत में रैना ने कहा कि जिस अंदाज में सूर्यकुमार यादव बल्लेबाजी कर रहे हैं, निश्चित रूप से वह तीनों फौरमेटों का हिस्सा होना चाहिए. उनके बिना तीनों फौरेट होने ही नहीं चाहिए. जिस तरह उन्होंने परफॉर्म किया है, रनों के प्रति जैसी भूख उन्होंने जतायी है, जिस तरह वह अलग-अलग शॉट की योजना बनाते हैं और जिस निर्भीकता के साथ मैदान के आकार का इस्तेमाल करते हैं, वह बहुत ही काबिलेतारीफ है. पूर्व बल्लेबाज ने कहा कि वह मुंबई के खिलाड़ी हैं और अच्छी तरह जानते हैं कि रेड-बॉल क्रिकेट कैसे खेलनी है. मुझे लगता है कि उनके टेस्ट इलेवन में चयनित होने के अच्छे आसार है. टेस्ट क्रिकेट खेलने से वह वनडे में भी स्थापित होंगे और उन्हें स्थायित्व भी आएगा. वह कई शतक और फिर दोहरे शतक जडेंगे. रैना की इस बात पर सहमति जताते हुए पूर्व लेग स्पिनर प्रज्ञान ओझा ने कहा कि निश्चित तौर पर सूर्यकुमार योक टेस्ट इलेवन का हिस्सा होना चाहिए. जिस तरह उन्होंने क्रिकेट खेली है और जैसा प्रदर्शन किया है, वह तीनों फौरमेट में खेलने ही चाहिए. मैं जानता हूं कि ऐसा सवाल क्यों हो रहा है. यह सवाल नियमित रूप से बेहतर कर रहे सरफराज खान के कारण है. निश्चित तौर पर सरफराज को लेकर भी मैनेजमेंट का मन मचल रहा है, लेकिन सूर्यकुमार टेस्ट टीम में चयन का निश्चित तौर पर हकदार हैं. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:19:45","image_url":"https://c.ndtvimg.com/2022-02/ma6q1csg_suresh-raina-bcciipl_650x400_15_February_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ T20: ऋतुराज गायकवाड़ के चोटिल होने के बाद इस खिलाड़ी की लगी लॉटरी, न्यूजीलैंड के खिलाफ धमाल मचाने को है तैयार","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-t20-after-rituraj-gaikwads-injury-this-players-lottery-ready-to-rock-against-new-zealand-ind-vs-nz-1st-t20-playing-11-3725552#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ T20: वनडे सीरीज में न्यूजीलैंड के खिलाफ अपने धमाकेदार प्रदर्शन के बाद अब टी20 सीरीज में भी टीम इंडिया अपना जलवा कायम रखना चाहेगी.","content":"Ruturaj Gaikwad हार्दिक पंड्या (Hardik Pandya) की कप्तानी में टीम इंडिया न्यूजीलैंड के खिलाफ (Ind vs Nz) तीन टी20 मुकाबला खेलेगी, जिसकी शुरुआत 27 जनवरी को JSCA स्टेडियम रांची से होगा. वनडे सीरीज में न्यूजीलैंड (Ind vs Nz Odi) के खिलाफ अपने धमाकेदार प्रदर्शन के बाद अब टी20 सीरीज में भी टीम इंडिया अपना जलवा कायम रखना चाहेगी. सीनियर खिलाड़ी रोहित शर्मा (Rohit Sharma) और विराट कोहली (Virat Kohli) की गैरमौजूदगी में युवा खिलाड़ियों के पास अपने बेहतरीन प्रदर्शन को दिखने का भरपूर मौका होगा. न्यूजीलैंड के खिलाफ टी20 स्क्वॉड (Team India T20 Squad vs Nz) में शामिल किये गए ऋतुराज गायकवाड़ (Ruturaj Gaikwad Injury) के चोटिल होने की खबर के बाद अब युवा बल्लेबाज़ पृथ्वी शॉ (Prithvi Shaw) के पास सुनहरा मौका होगा. पृथ्वी शॉ (Prithvi Shaw) को टीम में सलामी बल्लेबाज़ के विकल्प के तौर पर टीम में जोड़ा गया था. (Team India T20 Squad) टी20 स्क्वॉड में पृथ्वी शॉ को मौका मिलना उनके रणजी ट्रॉफी (Prithvi Shaw Ranji) में मुंबई के लिए शानदार प्रदर्शन का नतीजा है. शुभमन गिल (Shubman Gill) को श्रीलंका के खिलाफ टी20 फॉर्मेट में डेब्यू का मौका मिला तब ईशान किशन (Ishan Kishan) और गिल (Shubman Gill) की ओपनिंग जोड़ी ने जिम्मेदारी संभाली थी, लेकिन ईशान किशन (Ishan Kishan T20 Record) का प्रदर्शन बतौर ओपनिंग बल्लेबाज़ खास नहीं रहा था, लेकिन वनडे में ईशान किशन (Ishan Kishan Odi Record) ने जरूर अपने प्रदर्शन से सबका दिल जीता है. टी20 फॉर्मेट की बात करें तो न्यूजीलैंड के खिलाफ एक बार फिर शुभमन गिल और ईशान किशन की ओपनिंग जोड़ी (Shubman Gill and Ishan Kishan Opening) दिखने के पूरे आसार है और अगर इस जोड़ी के प्रदर्शन में जरा भी चूक हुई तो उसका फायदा युवा बल्लेबाज़ पृथ्वी शॉ को होगा. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:19:33","image_url":"https://c.ndtvimg.com/2023-01/d3ga57ro_team-india_625x300_07_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Younger players hampered by ‘impossible’ cricket schedule, says England captain Jos Buttler","link":"https://www.standard.co.uk/sport/cricket/england-cricket-jos-buttler-b1055857.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"As Harry Brook and Ben Duckett continue to impress across other formats, the England skipper sympathises with the talented youngsters","content":"says he feels for ’s most talented young players, who face an “impossible” task to become all-format cricketers due to the game’s overloaded schedule. Buttler’s ODI team begin their World Cup build-up in earnest with a three-match series in South Africa, starting with the opener in Bloemfontein tomorrow. Among the players hoping to stake a claim for a place on the flight to India in October are batters , who will make his 50-over debut having already excelled in T20 and Test colours, and , who will win his first ODI cap in more than six years, having impressed during recalls in the other two formats. Time is of the essence for both Duckett and Brook, neither of whom are expected to be available for England’s next ODI series in Bangladesh. That begins in Dhaka on March 1, the day after England’s Test tour to New Zealand - for which both have been selected - is scheduled to finish in Wellington. “I feel for the players to be honest,” Buttler said. “There are certain players who have the ability to play all three formats but that is kind of impossible because of the schedules. “That is a frustration I would have if I was a young player growing up now, that you don’t want to feel pigeon-holed as a player because the schedule doesn’t allow you to play everything.” Duckett and Brook are expected to bat at three and four, respectively, in South Africa, though at this stage they look to be vying for a single position in England’s first-choice XI, with Joe Root rested for this series but nailed on to return to the side for the World Cup. “It’s going to be pretty impossible for those guys to be involved [in Bangladesh], so it’s really important we expose them here and give them opportunity,” Buttler added. “We’ve got to use these games here and in Bangladesh to experiment a bit, expose people to playing international cricket. That’s just something we have to manage the whole way through. If we play well, I think we should win games of cricket.” Buttler also revealed that, with Jonny Bairstow still injured, Dawid Malan will open alongside the under-pressure Jason Roy, the Yorkshire batter set to get the nod over Phil Salt, who has been struggling with illness in the build-up. “My preference is Malan and Roy to open at the start of the series,” Buttler confirmed. “Malan has performed very well in international cricket for a long time. [He’s] batted three at certain times, but we want to get Duckett and Brook in at three and four to expose them. Harry Brook. “Jason has an outstanding record over a long period of time. He knows he’s not performing as well as he’d like to at the minute, he knows that more than anyone, but we are backing him. He has been a really influential figure in white-ball cricket, the 50-over team. He has been exceptional for a long period of time. We think he has loads to offer, and are excited to see him get back to his best.” Following the Bangladesh tour, England do not play another ODI until September, with the front half of the home summer geared around the Ashes and then the Hundred granted its own window in August. Consistency in selection had been one of the pillars of England’s rise in the build-up to the 2019 World Cup, with players - once picked - given ample opportunity to succeed in defined roles. Head coach Matthew Mott reiterated earlier this week that he wants it to be “harder to get in the team than get out of it” but the lack of ODI cricket between now and the World Cup means Buttler is aware of the need for an open mind. “We have to look at what everyone’s doing, whether that be playing in franchise tournaments, whether that’s playing in the Test team, IPL, the Hundred and the Blast,” he added. “If people are performing really well and banging the door down, that’s what’s been happening for a long time in white ball cricket, and I expect guys to be doing everything they can over the next nine months to put their name in the hat as well. “That’s wherever they are playing their cricket - it doesn’t have to be here in ODIs for England. You can demand a place in that squad wherever you’re playing. That competition for places is something that’s driven standards for a long time, and I want that to continue.”","pubDate":"2023-01-26 18:00:36","image_url":"https://static.standard.co.uk/2023/01/26/16/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"इन तीन दिग्गजों को पीछे छोड़ बाबर आजम ने जीता आईसीसी का सबसे प्रतिष्ठित अवार्ड","link":"https://sports.ndtv.com/hindi/cricket/babar-azam-won-icc-most-prestigious-award-by-dipping-these-three-stalwarts-3726582#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ICC Awards: वैसे अगर बाबर प्लेयर ऑफ द ईयर (सभी फौरमेटों को मिलाकर) चुने गए, तो उसकी वजह यह भी रही कि उनका टेस्ट में भी प्रदर्शन शानदार रहा. फिर भले ही टीम का प्रदर्शन ज्यादा अच्छा न रहा हो.","content":"पाकिस्तान के पूर्व कप्तान बाबर आजम पाकिस्तान के कप्तान बाबर आजम (Babar Azam) ने पिछले साल जमकर रन बरसाए, तो उनका इनाम भी उन्हें मिल गया है. बाबर को आईसीसी मेन क्रिकेटर ऑफ द ईयर चुना गया है. बाबर आजम ने पिछले साल एक से बढ़कर एक पारियां खेलीं और अपने कई निजी रिकॉर्ड तोड़े. इस दौरान पाकिस्तान टीम के प्रदर्शन में खासे उतार भी रहे, लेकिन जो चीज नहीं बदली, वह रहा बाबर का प्रदर्शन. पाकिस्तान कप्तान ने कई रिकॉर्ड तोड़ते हुए 54.12 के औसत से तीनों फौरमेट में 2598 रन बनाए. बाबर पिछले साल इकलौते ऐसे बल्लेबाज रहे, जिन्होंने पूरे कैलेंडर ईयर में सभी फौरमेटों में दो हजार से ज्यादा रन बनाए. बाबर ने सीजन में आठ शतक और 17 अर्द्धशतक बनाए. यही वजह रही कि बाबर तीनों प्रतिद्वंद्वियों को पछाड़ते हुए सर गैरी सोबर्स ट्रॉफी को अपनी झोली में डाल लिया. खेल का फिफ्टी-फिफ्टी फौरमेट साल 2021 और 2022 के वनडे प्लेयर ऑफ द ईयर बाबर के दबदबे वाला ही रहा. बाबर ने नौ मैचों में 679 रन बनाए. बाबर की नियमितता आप इस बात से समझ सकते हैं कि पाकिस्तान कप्तान ने नौ में से आठ पारियों में पचास या इससे ज्यादा की पारियां खेलीं. ऐसे में कोई चौंकाने वाली बात नहीं रही कि 28 साल के बाबर को लगातार दूसरे साल पुरुषों की कैटेगिरी में प्लेयर ऑफ द ईयर चुना गया. वहीं बाबर वनडे रैंकिंग में नंबर एक बल्लेबाज बने हुए हैं. वैसे अगर बाबर प्लेयर ऑफ द ईयर (सभी फौरमेटों को मिलाकर) चुने गए, तो उसकी वजह यह भी रही कि उनका टेस्ट में भी प्रदर्शन शानदार रहा. फिर भले ही टीम का प्रदर्शन ज्यादा अच्छा न रहा हो. दीर्घकालिक फौरमेट में पाकिस्तान के लिए नौ मैचों में 1184 रन बनाए. बता दें कि क्रिकेटर ऑफ द ईयर कैटेगिरी के लिए पाकिस्तान से बाबर आजम, इंग्लैंड के बेन स्टोक्स, जिंबाब्वे के सिकंदर रजा और न्यूजीलैंड के टिम साऊदी नामित थे, लेकिन फैंस और जूरी पैनल का निर्णय बाबर आजम के पक्ष में गया और यह चौंकाने वाली बात बिल्कुल भी नहीं है. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 17:08:07","image_url":"https://c.ndtvimg.com/2023-01/3kl6e4cg_babar-azam_625x300_09_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sipi Trekkers find slippery track against Itanda Kayakers, Bujjagali Rafters","link":"https://kawowo.com/2023/01/27/sipi-trekkers-find-slippery-track-against-itanda-kayakers-bujjagali-rafters/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"The Water Falls T20 League Men’s EditionGame 1: Sipi Trekkers v Itanda KayakersSipi Trekkers 92 all outItanda Kayakers 93/ 0Itanda Kayakers won by 10 wicketsPlayer of the Match: Igance Niteriganya (3/15)Match Highlights: https://fromsmash.com/GAME-ONE-SHORT-HIGHLIGHTSLive score link: https://cricclubs.com/viewScorecard.do?&matchId=1715&clubId=5335 Game 2: Sipi Trekkers v Bujjagali RaftersBujjagali Rafters 175/8Sipi Trekkers 115Bujjagali Rafters by 60 runsPlayer of the Match: Juma […] The post Sipi Trekkers find slippery track against Itanda Kayakers, Bujjagali Rafters appeared first on Kawowo Sports.","content":"The Water Falls T20 League Men’s Edition Game 1: Sipi Trekkers v Itanda Kayakers Sipi Trekkers 92 all out Itanda Kayakers 93/ 0 Itanda Kayakers won by 10 wickets Player of the Match: Igance Niteriganya (3/15) Match Highlights: https://fromsmash.com/GAME-ONE-SHORT-HIGHLIGHTS Live score link: https://cricclubs.com/viewScorecard.do?&matchId=1715&clubId=5335 Game 2: Sipi Trekkers v Bujjagali Rafters Bujjagali Rafters 175/8 Sipi Trekkers 115 Bujjagali Rafters by 60 runs Player of the Match: Juma Miyagi Full Match Scorecard: https://cricclubs.com/viewScorecard.do?&matchId=1716&clubId=5335 The men’s edition of the Water Falls T20 League started off with pomp and good-quality cricket. Cricket Cranes All Rounder Juma Miyagi struck the 1st half-century of the tournament in the afternoon for Bujjagali Rafters against Sipi Trekkers. His knock was the difference between the two sides as the Bujjagali Rafters inflicted a second defeat on the Sipi Trekkers that derailed their chance of being in the Sunday afternoon final. In the morning Sipi Trekkers were put on the sword by Itanda Kayakers defeating them by 10 wickets in a no contest. The game was over even before 12pm after starting at 9:30 am, the fast bowlers for Itanda Kayakers ripped through the top order of Sipi Trekkers and once the top had been taken care of there was nothing left for the trekkers. Sipi Trekkers skittled out for just 92 and Ronald Lutaaya and Wasim Butt knocked it off in just 7 overs. The two losses leave Sipi Trekkers in a difficult position as they will need some results to go their way if they will be able to make the final on Sunday. Itanda Kayakers will have two games tomorrow, they will take on Bujjagali Rafters in the morning and then Sipi Trekkers in the afternoon.","pubDate":"2023-01-26 21:28:38","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"Ind vs Nz 1st T20I: टीम इंडिया को झटका, ऋतुराज गायकवाड़ हुए पूरी सीरीज से बाहर","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-1st-t20i-team-india-faces-jolt-ruturaj-gaikwad-is-ruled-out-of-entire-series-3727509#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 1st T20I: टीम हार्दिक शुक्रवार से तीन मैचों की सीरीज की शुरुआत कर रही है. पहला मैच रांची में खेला जाएगा.","content":"टीम इंडिया से ज्यादा यह ऋतुराज गायकवाड़ के लिए बड़ा झटका है न्यूजीलैंड के खिलाफ शुक्रवार से शुरू हो रही तीन टी20 मैचों की सीरीज शुरू होने से पहले ही भारतीय टीम को झटका लगा है. और उसके ओपनर बल्लेबाज ऋतुराज गायकवाड़ चोट के कारण अब पूरी सीरीज से बाहर हो गए हैं. इससे पहले तक गायकवाड़ के सिर्फ पहले ही मैच से बाहर होने की खबरें आ रही थीं, लेकिन अब साफ हो गया है कि तमिलनाडु का यह बल्लेबाज सीरीज के तीनों ही मुकाबले नहीं खेल पाएगा. निश्चित तौर पर यह टीम इंडिया से ज्यादा गायकवाड़ के लिए ज्यादा बड़ा झटका है क्योंकि इस समय टीम इंडिया में ओपनिंग के लिए बहुत ही कड़ी प्रतिस्पर्धा है. बीसीसीआई के सूत्रों के अनुसार गायकवाड़ की कलायी में चोट है. और स्कैन के बाद पता चला कि यह उम्मीद से ज्यादा गंभीर है. और फिर बीसीसीआई की मेडिकल टीम से विचार-विमर्श करने के बाद गायकवाड़ ने पूरी सीरीज से हटने का फैसला किया है. गायकवाड़ को रिहैबिलिटेशन के लिए बेंगलुरू स्थित राष्ट्रीय क्रिकेट अकादमी भेजा गया है. गायकवाड़ ने एक वनडे और नौ टी20 खेले हैं. उन्होंने पिछले साल अक्टूबर में भारत के खिलाफ आखिरी मैच खेला था. गायकवाड़ के टीम इंडिया से बाहर होने के बाद अब सीरीज में पारी की शुरुआत के लिए मुकाबला शुबमन गिल और घरेलू क्रिकेट में धमाकेदार तिहरा शतक जड़कर वापसी करने वाले पृथ्वी शॉ के बीच है. गिल ने हाल ही में दिखाया है कि उनका बल्ला कैसे आग उगल रहा है. निश्चित तौर पर हालिया वनडे सीरीज के प्रदर्शन के बाद गिल का दावा स्वभाविक रूप से मजबूत नजर आ रहा है. रांची में होने वाले पहले टी20 मुकाबले के लिए भारत की संभावित इलेवन इस प्रकार है: 1. हार्दिक पांड्या (कप्तान) 2. सू्र्यकुमार यादव (उप-कप्तान) 3. शुबमन गिल 4. ईशान किशन 5. राहुल त्रिपाठी 6. दीपक हूडा 7. वॉशिंगटन सुंदर 8. कुलदीप यादव 9. युजवेंद्र चहल 10. अर्शदीप सिंह 11. उमरान मलिक * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:36:46","image_url":"https://c.ndtvimg.com/2022-11/4r3i0nlg_ruturaj-gaikwad-twitter-_625x300_28_November_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | Bavuma on SA20 snub: I'm a person who moves on with things","link":"https://www.news24.com/sport/Cricket/Proteas/bavuma-on-sa20-snub-im-a-person-who-moves-on-with-things-20230126","keywords":null,"creator":null,"video_url":null,"description":"Proteas limited-overs skipper Temba Bavuma has made peace with not being part of the SA20, saying he's moved on from that disappointment.","content":"Proteas limited-overs skipper Temba Bavuma has made peace with not being part of the SA20, saying he's moved on from that disappointment. Bavuma, who remains the captain of the T20 team, wasn't picked at last year's auction, where his base price of R850 000 wasn't able to fetch him a bid from any of the six teams. Even when players were unavailable for various reasons, Bavuma was still not picked up, with the example of Joburg Super Kings going for Sibonelo Makhanya as a replacement for England batter Harry Brooks. STAT ATTACK | Recalling red-hot Faf for Proteas would immediately relieve T20 headache Even T20 teammate Andile Phehlukwayo, who also didn't find a home during the auction, was picked up by the Paarl Royals. Bavuma admitted to the unusual nature of a national T20 captain not being in what is the premier T20 competition but said he's moved on from that disappointment. \"It seems unusual, but it has happened this way, and there's nothing I can really do about it, as unusual as it is,\" Bavuma said. \"People have to go on and I'm definitely one of those people who moves on with things. Whatever comes my way, comes my way. \"I always try to keep a smile on my face regardless of what is happening.\" Bavuma, who hasn't played white-ball cricket since South Africa's infamous 13-run loss to the Netherlands in Adelaide on 6 November, said he took it easy during the SA20 break. READ | Faf delighted after smashing unbeaten SA20 ton: 'Important to convert those scores' Bavuma featured in the three Tests against Australia that SA lost 2-0, while his provincial team, the Lions won the Cricket South Africa 1-Day Cup. Bavuma will lead the men's 50-over team for the three-match ODI series against England that starts in Bloemfontein on Friday. \"I've been taking it easy over the past two weeks and I've been connecting with family, so it's been really relaxing,\" Bavuma added. \"I tried to watch one or two games of the SA20, and it was quite exciting. I've been taking it easy and day by day.\"","pubDate":"2023-01-26 18:26:36","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Athiya Shetty-KL Rahul Wedding: परिवार ने महंगे तोहफों मिलने की खबरों का किया खंडन","link":"https://sports.ndtv.com/hindi/cricket/suniel-shetty-denies-reports-bout-gifts-given-to-athiya-shetty-and-kl-rahul-3727275#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"इन रिपोर्टों को फिल्मी और क्रिकेट फैंस दोनों ने ही हाथों हाथ लिया और देखते ही देखते यह तोहफे से जुड़ी खबर सोशल मीडिया साथ-साथ आम प्रशंसकों के बीच चर्चा का विषय गयी. इस खबर पर सोशल मीडिया ने अपने-अपने अंदाज में प्रतिक्रिया भी व्यक्त ही.","content":"केएल राहुल और आथिया शेट्टी बॉलीवुड एक्टर सुनील शेट्टी के प्रवक्ता ने आथिया शेट्टी (Athiya Shettey) और केएल राहुल (Kl Rahul) की शादी में बॉलीवुड सितारों और क्रिकेटरों से मिलने वाले महंगे तोहफों की खबरों को सिरे से खारिज कर दिया है. पिछले कई सालों से डेट कर रहे केएल राहुल और आथिया शेट्टी बीते सोमवार को सुनील शेट्टी के खंडाला स्थित आवास पर सादे समारोह में विवाह बंधन में बंधे थे. इस शादी में चुनिंदा क्रिकेटरों के अलावा बॉलीवुड सितारों ने भी हिस्सा लिया था. क्रिकेटरों की बात करें, तो इशांत शर्मा और वरुण एरॉन के विवाह समारोह में पहुंचने की तस्वीरें भी सामने आयी थीं. विवाह समारोह संपन्न होने के बाद सुनील शेट्टी ने मीडिया का आभार प्रकट करते कहा था कि आईपीएल शुरू होने से पहले मुंबई में रिसेप्शन समारोह आयोजित किया जाएगा. बता दें, कुछ मीडिया रिपोर्ट्स में बताया गया था कि नवयुगल को बॉलीवुड स्टार्स और क्रिकेटरों ने महंगे तोहफे दिए हैं. इस तरह की रिपोर्ट्स को सोशल मीडिया पर भी शेयर किया जा रहा था. गुरुवार को सुनील शेट्टी के प्रवक्ता ने कहा कि इस तरह की खबरें पूरी तरह से निराधार हैं. उन्होंने कहा कि आथिया और केएल राहुल को मिले तोहफों से जुड़ी खबरें सच नहीं है. नवविवाहित जोड़े ने आथिया शेट्टी और केएल राहुल ने समारोह अपने-अपने इंस्टाग्राम अकाउंट पर शादी समारोह की तस्वीरें साझा कीं. उन्होंने अपने-अपने सोशल मीडिया अकाउंट पर लिखा, “तुम्हारी रोशनी में, मैनें सीखा प्यार कैसे करते हैं...” आज, हमारे सबसे प्रियजनों के साथ, हमने उस घर में शादी की जिसने हमें अपार खुशी और शांति दी है. कृतज्ञता और प्यार से भरे दिल के साथ, हम इस एक साथ चलने की यात्रा पर आपका आशीर्वाद चाहते हैं.” * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:26:25","image_url":"https://c.ndtvimg.com/2023-01/41p89j5o_first-video-of-athiya-shetty-kl-rahul-after-wedding_625x300_23_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ind vs Nz 1st T20I: यह भारतीय XI पहले टी20 में मैदान पर उतरेगी, नजर दौड़ा लें","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-1st-t20i-this-is-india-final-xi-will-step-in-to-ground-against-new-zealand-in-first-t20i-3726948#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 1st T20I: न्यूजीलैंड के साथ टीम हार्दिक पहला टी20 मुकाबला शुक्रवार को रांची में खेलने जा रही है.","content":"Ind vs Nz 1st T20I: टीम इंडिया की फाइल फोटो वनडे में मेहमान टीम के सफाए के बाद बाद टी20 के कप्तान हार्दिक पांड्या (Hardik Pandya) की नजरें भी शुक्रवार को रांची में शुरू होने जा रही टी20 सीरीज में भी कीवियों के सफाए पर टिकी हुई हैं. और इसके लिए हार्दिक एंड कंपनी कोई कोर-कसर बाकी नहीं छोड़ना चाहती. मुकाबले से पहले ऋतुराज गायकवाड़ (Ruturaj Gaikwad) जरूर चोटिल होकर पहले मुकाबले से बाहर हो गए हैं, लेकिन हार्दिक अपनी ओर से कोई कोर-कसर बाकी नहीं छोड़ना चाहते. वहीं, फैंस ने भी अपने सपनों की टीम और टीम इंडिया की फाइनल इलेवन बनाना शुरू कर दिया है. चलिए हम आपको बताते हैं कि पहले मुकाबले में भारत किसी इलेवन के साथ मैदान पर उतरने जा रहा है. नजर दौड़ा लें. अब किसी की चोट किसी का फायदा बनकर आती है, तो ऋतुराज गायकवाड़ की चोट का फायदा हाल ही में वनडे में प्रचंड फॉर्म में दिख रहे शुबमन गिल को मिलेगा, जो ईशान किशन के साथ पारी की शुरू करेंगे. वहीं, रांची का विकेट स्पिनरों का मददगार रहा है, तो भारतीय मैनेजमेंट इस मैच में स्पिनरों पर दांव खेलेगा. यहां की पिच पर स्पिनरों के खिलाफ रन बनाना टेढ़ी खीर रहा है. ऐसे में \"कुलचा\" मतलब कुलदीप यादव और युजवेंद्र चहल की जोड़ी दिखायी पड़ सकती है, तो सहारा देने के लिए वॉशिंगटन सुंदर और दीपक हूडा भी होंगे. वहीं, तेज गेंदबाजी का जिम्मा अर्शदीप, उमरान मलिक और खुद कप्तान हार्दिक पांड्या पर होगा. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:25:23","image_url":"https://c.ndtvimg.com/2023-01/mqg6fr4g_team-india-afp_625x300_11_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"रांची खेलने पहुंचे कप्तान हार्दिक ने धोनी संग लिया \"शोले बाइक\" का मजा, फैंस को पसंद आ रही pic","link":"https://sports.ndtv.com/hindi/cricket/captain-hardik-panda-enjoyed-sholay-bike-with-dhoni-as-he-reached-ranchi-to-play-against-new-zealand-fans-like-the-pick-3726771#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand 1st T20I: हार्दिक की कप्तानी में टीम इंडिया शुक्रवार को पहले टी20 मुकाबले में मेहमान न्यूजीलैंड से रांची में भिड़ेगी.","content":"अब यह तो आप जानते ही हैं कि टी20 कप्तान हार्दिक पांड्या (Hardik Pandya) और उनके मेंटोर एमएस धोनी (MS Dhoni) के बीच कितनी ज्यादा छनती है. पूर्व में ऐसे कई मौके रहे, जब हार्दिक ने खुलकर धोनी के प्रति अपने प्यार और सम्मान को प्रदर्शित था. यह कोविड-काल के बाद का समय था, जब हार्दिक अपने भाई क्रुणाल के साथ धोनी का जन्मदिन मनाने रांची पहुंच गए थे. और अब जब टीम इंडिया वीरवार को न्यूजीलैंड के खिलाफ जब तीन टी-20 मैचों की सीरीज का पहला मैच खेलने धोनी के गृहनगर रांची पहुंची तो भला ऐसे कैसे हो सकता था कि हार्दिक अपने मेंटोर से न मिलते. रांची पहुंचते ही हार्दिक ने धोनी से मुलाकात तो की ही, बल्कि \"गुरु\" मिलन की तस्वीर भी उन्होंने अपने ट्विटर अकाउंट पर पोस्ट की. इस फोटो में धोनी एक ऐसी मोटरबाइक पर दिख रहे हैं, जैसी शोले फिल्म में \"ये दोस्त हम नहीं तोड़ेंगे...\" गाने के दौरान दिखायी गयी थी. Sholay 2 coming soon इस तस्वीर में जहां हार्दिक बाइक की मेन सीट, तो एमएस धोनी उसे जुड़े सीट पर बैठे दिखायी पड़ रहे हैं. और इसका कैप्शन हार्दिक ने दिया है-\"शोले 2 कमिंग सून.\" इससे आप इन दोनों की दोस्ती के बारे में सहज ही अंदाजा लगा सकते हैं. वैसे आप तो यह जानते ही हैं कि धोनी कितने बड़े बाइकप्रेमी हैं. ऐसे में एक बार को यह तस्वीर धोनी के गैराज की हो सकती हैं, जहां धोनी ने अपनी तमाम पुरानी से लेकर नयी बाइक जमा कर रखी हैं. बहरहाल, हार्दिक और धोनी की यह तस्वीर फैंस को बहुत ही पसंद आ रही है और इस पर खासी प्रतिक्रिया भी देखने को मिली है. वनडे में मेहमान न्यूजीलैंड का सफाया करने के बाद अब टीम हार्दिक की नजर शुक्रवार से शुरू हो रही टी20 सीरीज पर टिकी है. तीन मैचों की सीरीज का पहला मुकाबला शुक्रवार को रांची के जेएससीए इंटरनेशनल स्टेडियम में खेला जाएगा. मुकाबले को लेकर टीम इंडिया ने वीरवार को नेट पर खासा अभ्यास किया. और जब धोनी भी स्टेडियम में ट्रेनिंग के लिए पहुंचे, तो खिलाड़ी उनकी उपस्थिति में खासे उत्साहित दिखायी पड़े. फैंस को तस्वीर खासी पसंद आयी Close Enough धोनी के गैराज की ही तस्वीर है Mahi's vintage car garage यह प्रशंसक हार्दिक को नसीहत दे रहा है Ye ENFIELD toh badiya hai but Thoda ONFIELD nakhre kam kiya karo hardik pandya! * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:23:17","image_url":"https://c.ndtvimg.com/2023-01/s9abbagg_hardik-pandya-in-press-conference-bcci_625x300_08_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"इस भारतीय बल्लेबाज के बिना तीनों फौरमेट होने ही नहीं चाहिए\", सुरेश रैना का बड़ा बयान","link":"https://sports.ndtv.com/hindi/cricket/all-there-format-even-should-not-exist-without-this-indias-batsman-suresh-raina-makes-big-statement-3726401#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia: अब जबकि ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज सिर उठाए खड़ी है, तो इलेवन को लेकर चर्चा अभी से शुरू हो गयी है.","content":"पूर्व बल्लेबाज सुरेश रैना पूर्व भारतीय क्रिकेटर सुरेश रैना का मानना है कि व्हाइट-बॉल क्रिकेट में सफलता के बाद टी20 के आईसीसी प्लयेर ऑफ द ईयर सूर्यकुमार यादव (Suryakumar Yadav) को टेस्ट इलेवन का हिस्सा बनाए जाने की जरूरत है. उन्होंने कहा कि बिना सूर्यकुमार यादव के तीनों फौरमेट नहीं ही होना चाहिए. गुजरा साल सूर्यकुमार यादव के लिए बहुत ही सनसनी वाला साल रहा है. और उन्होंने टी20 में वह रिकॉर्ड बनाया, जो पहले इस फौरमेट में नहीं ही बना था. सूर्यकुमार यादव गुजरे साल टी20 में एक हजार रन बनाने वाले सिर्फ दूसरे बल्लेबाज तो बने ही, साथ ही वह साल में सबसे ज्यादा रन बनाने वाले बल्लेबाज भी बने. सूर्यकुमार ने 187.43 के स्ट्राइक-रेट से 1,164 रनबनाए. और इसका क्रिकेट की पैतृक संस्था आईसीसी ने भी लोहा माना और उन्हें टी20 क्रिकेटर ऑफ द ईयर चुना, जो बताने के लिए काफी है कि यादव किस स्तर के बल्लेबाज हैं. एक टीवी चैनल पर आकाश चोपड़ा के साथ बातचीत में रैना ने कहा कि जिस अंदाज में सूर्यकुमार यादव बल्लेबाजी कर रहे हैं, निश्चित रूप से वह तीनों फौरमेटों का हिस्सा होना चाहिए. उनके बिना तीनों फौरेट होने ही नहीं चाहिए. जिस तरह उन्होंने परफॉर्म किया है, रनों के प्रति जैसी भूख उन्होंने जतायी है, जिस तरह वह अलग-अलग शॉट की योजना बनाते हैं और जिस निर्भीकता के साथ मैदान के आकार का इस्तेमाल करते हैं, वह बहुत ही काबिलेतारीफ है. पूर्व बल्लेबाज ने कहा कि वह मुंबई के खिलाड़ी हैं और अच्छी तरह जानते हैं कि रेड-बॉल क्रिकेट कैसे खेलनी है. मुझे लगता है कि उनके टेस्ट इलेवन में चयनित होने के अच्छे आसार है. टेस्ट क्रिकेट खेलने से वह वनडे में भी स्थापित होंगे और उन्हें स्थायित्व भी आएगा. वह कई शतक और फिर दोहरे शतक जडेंगे. रैना की इस बात पर सहमति जताते हुए पूर्व लेग स्पिनर प्रज्ञान ओझा ने कहा कि निश्चित तौर पर सूर्यकुमार योक टेस्ट इलेवन का हिस्सा होना चाहिए. जिस तरह उन्होंने क्रिकेट खेली है और जैसा प्रदर्शन किया है, वह तीनों फौरमेट में खेलने ही चाहिए. मैं जानता हूं कि ऐसा सवाल क्यों हो रहा है. यह सवाल नियमित रूप से बेहतर कर रहे सरफराज खान के कारण है. निश्चित तौर पर सरफराज को लेकर भी मैनेजमेंट का मन मचल रहा है, लेकिन सूर्यकुमार टेस्ट टीम में चयन का निश्चित तौर पर हकदार हैं. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:19:45","image_url":"https://c.ndtvimg.com/2022-02/ma6q1csg_suresh-raina-bcciipl_650x400_15_February_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ T20: ऋतुराज गायकवाड़ के चोटिल होने के बाद इस खिलाड़ी की लगी लॉटरी, न्यूजीलैंड के खिलाफ धमाल मचाने को है तैयार","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-nz-t20-after-rituraj-gaikwads-injury-this-players-lottery-ready-to-rock-against-new-zealand-ind-vs-nz-1st-t20-playing-11-3725552#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ T20: वनडे सीरीज में न्यूजीलैंड के खिलाफ अपने धमाकेदार प्रदर्शन के बाद अब टी20 सीरीज में भी टीम इंडिया अपना जलवा कायम रखना चाहेगी.","content":"Ruturaj Gaikwad हार्दिक पंड्या (Hardik Pandya) की कप्तानी में टीम इंडिया न्यूजीलैंड के खिलाफ (Ind vs Nz) तीन टी20 मुकाबला खेलेगी, जिसकी शुरुआत 27 जनवरी को JSCA स्टेडियम रांची से होगा. वनडे सीरीज में न्यूजीलैंड (Ind vs Nz Odi) के खिलाफ अपने धमाकेदार प्रदर्शन के बाद अब टी20 सीरीज में भी टीम इंडिया अपना जलवा कायम रखना चाहेगी. सीनियर खिलाड़ी रोहित शर्मा (Rohit Sharma) और विराट कोहली (Virat Kohli) की गैरमौजूदगी में युवा खिलाड़ियों के पास अपने बेहतरीन प्रदर्शन को दिखने का भरपूर मौका होगा. न्यूजीलैंड के खिलाफ टी20 स्क्वॉड (Team India T20 Squad vs Nz) में शामिल किये गए ऋतुराज गायकवाड़ (Ruturaj Gaikwad Injury) के चोटिल होने की खबर के बाद अब युवा बल्लेबाज़ पृथ्वी शॉ (Prithvi Shaw) के पास सुनहरा मौका होगा. पृथ्वी शॉ (Prithvi Shaw) को टीम में सलामी बल्लेबाज़ के विकल्प के तौर पर टीम में जोड़ा गया था. (Team India T20 Squad) टी20 स्क्वॉड में पृथ्वी शॉ को मौका मिलना उनके रणजी ट्रॉफी (Prithvi Shaw Ranji) में मुंबई के लिए शानदार प्रदर्शन का नतीजा है. शुभमन गिल (Shubman Gill) को श्रीलंका के खिलाफ टी20 फॉर्मेट में डेब्यू का मौका मिला तब ईशान किशन (Ishan Kishan) और गिल (Shubman Gill) की ओपनिंग जोड़ी ने जिम्मेदारी संभाली थी, लेकिन ईशान किशन (Ishan Kishan T20 Record) का प्रदर्शन बतौर ओपनिंग बल्लेबाज़ खास नहीं रहा था, लेकिन वनडे में ईशान किशन (Ishan Kishan Odi Record) ने जरूर अपने प्रदर्शन से सबका दिल जीता है. टी20 फॉर्मेट की बात करें तो न्यूजीलैंड के खिलाफ एक बार फिर शुभमन गिल और ईशान किशन की ओपनिंग जोड़ी (Shubman Gill and Ishan Kishan Opening) दिखने के पूरे आसार है और अगर इस जोड़ी के प्रदर्शन में जरा भी चूक हुई तो उसका फायदा युवा बल्लेबाज़ पृथ्वी शॉ को होगा. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 18:19:33","image_url":"https://c.ndtvimg.com/2023-01/d3ga57ro_team-india_625x300_07_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Younger players hampered by ‘impossible’ cricket schedule, says England captain Jos Buttler","link":"https://www.standard.co.uk/sport/cricket/england-cricket-jos-buttler-b1055857.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"As Harry Brook and Ben Duckett continue to impress across other formats, the England skipper sympathises with the talented youngsters","content":"says he feels for ’s most talented young players, who face an “impossible” task to become all-format cricketers due to the game’s overloaded schedule. Buttler’s ODI team begin their World Cup build-up in earnest with a three-match series in South Africa, starting with the opener in Bloemfontein tomorrow. Among the players hoping to stake a claim for a place on the flight to India in October are batters , who will make his 50-over debut having already excelled in T20 and Test colours, and , who will win his first ODI cap in more than six years, having impressed during recalls in the other two formats. Time is of the essence for both Duckett and Brook, neither of whom are expected to be available for England’s next ODI series in Bangladesh. That begins in Dhaka on March 1, the day after England’s Test tour to New Zealand - for which both have been selected - is scheduled to finish in Wellington. “I feel for the players to be honest,” Buttler said. “There are certain players who have the ability to play all three formats but that is kind of impossible because of the schedules. “That is a frustration I would have if I was a young player growing up now, that you don’t want to feel pigeon-holed as a player because the schedule doesn’t allow you to play everything.” Duckett and Brook are expected to bat at three and four, respectively, in South Africa, though at this stage they look to be vying for a single position in England’s first-choice XI, with Joe Root rested for this series but nailed on to return to the side for the World Cup. “It’s going to be pretty impossible for those guys to be involved [in Bangladesh], so it’s really important we expose them here and give them opportunity,” Buttler added. “We’ve got to use these games here and in Bangladesh to experiment a bit, expose people to playing international cricket. That’s just something we have to manage the whole way through. If we play well, I think we should win games of cricket.” Buttler also revealed that, with Jonny Bairstow still injured, Dawid Malan will open alongside the under-pressure Jason Roy, the Yorkshire batter set to get the nod over Phil Salt, who has been struggling with illness in the build-up. “My preference is Malan and Roy to open at the start of the series,” Buttler confirmed. “Malan has performed very well in international cricket for a long time. [He’s] batted three at certain times, but we want to get Duckett and Brook in at three and four to expose them. Harry Brook. “Jason has an outstanding record over a long period of time. He knows he’s not performing as well as he’d like to at the minute, he knows that more than anyone, but we are backing him. He has been a really influential figure in white-ball cricket, the 50-over team. He has been exceptional for a long period of time. We think he has loads to offer, and are excited to see him get back to his best.” Following the Bangladesh tour, England do not play another ODI until September, with the front half of the home summer geared around the Ashes and then the Hundred granted its own window in August. Consistency in selection had been one of the pillars of England’s rise in the build-up to the 2019 World Cup, with players - once picked - given ample opportunity to succeed in defined roles. Head coach Matthew Mott reiterated earlier this week that he wants it to be “harder to get in the team than get out of it” but the lack of ODI cricket between now and the World Cup means Buttler is aware of the need for an open mind. “We have to look at what everyone’s doing, whether that be playing in franchise tournaments, whether that’s playing in the Test team, IPL, the Hundred and the Blast,” he added. “If people are performing really well and banging the door down, that’s what’s been happening for a long time in white ball cricket, and I expect guys to be doing everything they can over the next nine months to put their name in the hat as well. “That’s wherever they are playing their cricket - it doesn’t have to be here in ODIs for England. You can demand a place in that squad wherever you’re playing. That competition for places is something that’s driven standards for a long time, and I want that to continue.”","pubDate":"2023-01-26 18:00:36","image_url":"https://static.standard.co.uk/2023/01/26/16/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"इन तीन दिग्गजों को पीछे छोड़ बाबर आजम ने जीता आईसीसी का सबसे प्रतिष्ठित अवार्ड","link":"https://sports.ndtv.com/hindi/cricket/babar-azam-won-icc-most-prestigious-award-by-dipping-these-three-stalwarts-3726582#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ICC Awards: वैसे अगर बाबर प्लेयर ऑफ द ईयर (सभी फौरमेटों को मिलाकर) चुने गए, तो उसकी वजह यह भी रही कि उनका टेस्ट में भी प्रदर्शन शानदार रहा. फिर भले ही टीम का प्रदर्शन ज्यादा अच्छा न रहा हो.","content":"पाकिस्तान के पूर्व कप्तान बाबर आजम पाकिस्तान के कप्तान बाबर आजम (Babar Azam) ने पिछले साल जमकर रन बरसाए, तो उनका इनाम भी उन्हें मिल गया है. बाबर को आईसीसी मेन क्रिकेटर ऑफ द ईयर चुना गया है. बाबर आजम ने पिछले साल एक से बढ़कर एक पारियां खेलीं और अपने कई निजी रिकॉर्ड तोड़े. इस दौरान पाकिस्तान टीम के प्रदर्शन में खासे उतार भी रहे, लेकिन जो चीज नहीं बदली, वह रहा बाबर का प्रदर्शन. पाकिस्तान कप्तान ने कई रिकॉर्ड तोड़ते हुए 54.12 के औसत से तीनों फौरमेट में 2598 रन बनाए. बाबर पिछले साल इकलौते ऐसे बल्लेबाज रहे, जिन्होंने पूरे कैलेंडर ईयर में सभी फौरमेटों में दो हजार से ज्यादा रन बनाए. बाबर ने सीजन में आठ शतक और 17 अर्द्धशतक बनाए. यही वजह रही कि बाबर तीनों प्रतिद्वंद्वियों को पछाड़ते हुए सर गैरी सोबर्स ट्रॉफी को अपनी झोली में डाल लिया. खेल का फिफ्टी-फिफ्टी फौरमेट साल 2021 और 2022 के वनडे प्लेयर ऑफ द ईयर बाबर के दबदबे वाला ही रहा. बाबर ने नौ मैचों में 679 रन बनाए. बाबर की नियमितता आप इस बात से समझ सकते हैं कि पाकिस्तान कप्तान ने नौ में से आठ पारियों में पचास या इससे ज्यादा की पारियां खेलीं. ऐसे में कोई चौंकाने वाली बात नहीं रही कि 28 साल के बाबर को लगातार दूसरे साल पुरुषों की कैटेगिरी में प्लेयर ऑफ द ईयर चुना गया. वहीं बाबर वनडे रैंकिंग में नंबर एक बल्लेबाज बने हुए हैं. वैसे अगर बाबर प्लेयर ऑफ द ईयर (सभी फौरमेटों को मिलाकर) चुने गए, तो उसकी वजह यह भी रही कि उनका टेस्ट में भी प्रदर्शन शानदार रहा. फिर भले ही टीम का प्रदर्शन ज्यादा अच्छा न रहा हो. दीर्घकालिक फौरमेट में पाकिस्तान के लिए नौ मैचों में 1184 रन बनाए. बता दें कि क्रिकेटर ऑफ द ईयर कैटेगिरी के लिए पाकिस्तान से बाबर आजम, इंग्लैंड के बेन स्टोक्स, जिंबाब्वे के सिकंदर रजा और न्यूजीलैंड के टिम साऊदी नामित थे, लेकिन फैंस और जूरी पैनल का निर्णय बाबर आजम के पक्ष में गया और यह चौंकाने वाली बात बिल्कुल भी नहीं है. * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-26 17:08:07","image_url":"https://c.ndtvimg.com/2023-01/3kl6e4cg_babar-azam_625x300_09_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"}]}