{"newsArray":[{"title":"Scorecard: Australia vs England, third Ashes Test","link":"https://www.skysports.com/live-scores/cricket/australia-v-england/36452/scorecard","keywords":null,"creator":null,"video_url":null,"description":"The latest score from the third Ashes Test between Australia and England at The Melbourne Cricket Ground.","content":null,"pubDate":"2021-12-25 23:25:00","full_description":null,"image_url":"https://e0.365dm.com/21/12/1920x1080/skysports-pat-cummins-cricket_5611234.jpg?20211211074101","source_id":"skysports"},{"title":"Ashes 2021-22 third Test, day one: Australia v England – live!","link":"https://www.theguardian.com/sport/live/2021/dec/26/ashes-2021-22-australia-vs-england-day-one-1-cricket-3rd-third-boxing-day-test-live-score-card-aus-v-eng-start-time-latest-updates","keywords":["Ashes 2021-22","The Ashes","Australia cricket team","Cricket","England cricket team","Australia sport","Sport","Over by over reports"],"creator":["Jonathan Howcroft (now) and Tanya Aldred (later)"],"video_url":null,"description":"Start time for the Boxing Day Test is 10:30am local, 11:30pm GMTThe Spin: subscribe to our weekly cricket newsletterAny thoughts? Email or tweet @JPHowcroftHello everybody and welcome to live over-by-over coverage of the Boxing Day Ashes Test. We’re underway at the Melbourne Cricket Ground at 10.30am local time (11.30pm UK).I hope you’re all well-fed, well-rested, and ready for one of the landmark days on the sporting calendar. As Cliff Richard sang, it’s a time for giving (your wicket away reverse-sweeping to point during a blockathon) a time for getting (dropped), a time for forgiving (Jos Buttler) and a time for forgetting (Joe Root winning the toss in Brisbane). Now let’s rejoice in the good that we see. Continue reading...","content":null,"pubDate":"2021-12-25 22:36:44","full_description":"On the subject of England recovering from 2-0 down with three to play, senior players made the right noises pre-Test. Brollies down, covers coming off. We might have a toss soon. “Festive greetings, Jonathan,” and to you Andrew Benton. “As Elton John once sang, ‘It’s a sad, sad situation, and it’s getting more and more absurd’. It would be a fair miracle if England were to regain the urn, the change in attitude and aptitude needed to win three in a row is surely beyond them. If miracles are going to happen, there are many far more worthy causes to which they should be applied. Fielding mistakes and giving away wickets should have been ironed out in the summer, and it will be interesting to see if the pressure applied by management over the past few days has any result. At least some learning could then be legitimately be said to be happening.” All relevant points. However, I think the most salient is simple one: that this cohort of Australians are better at cricket than their English rivals. This is magnified in Australian conditions. Exacerbated further by injuries and lack of preparation to the tourists. I feel like much of the “Root must to do this” analysis, and heated discussions about application or concentration are mostly performative and largely empty. What really needs resolving is the problem of why this England side is so poorly equipped for this challenge; repeatedly. Until then, the incidental gripes around fielding and captaincy will be little more than piddling into the wind. Pass the time while the drizzle hangs around with Simon Burton’s look at Boxing Day Tests of yore. The Boxing Day Test has become, in the words of Mark Butcher, “a major part of cricketing folklore”, but it was a surprisingly recent addition to the calendar. England and Australia first met on that date in 1950, when the second Test resumed on 26 December after two days off. The following year, West Indies played Test cricket on Christmas Day itself, which one tourist declared “sacrilegious” and was not much more popular with the home side. “I have never played on Christmas Day before in my life and don’t like having to do so now,” an unnamed Australian said. Here is the cut strip that won’t be used for a while yet. . @bowlologist says he'd love to have a bowl on this MCG pitch 👀 #Ashes pic.twitter.com/iz5cUM7jXG Confirmation the toss has been delayed. Here we go then @JPHowcroft . 4 changes, part in hope, perhaps in desperation. My twin brother Dave is in the ground for 2 days, copping it from the locals. With drizzle in the air, if you won the toss, you'd bowl, SURELY? I think Wood may have a lot to say here. I hope so. Good luck to Dave. By midway through the afternoon session, being in the outer at the G is not always the most relaxing place for an Englishman. (I speak from personal experience.) As for the toss. Yes, you’d reckon it’s a bowl-first, but a wet outfield may force some second-guessing. I’m not sure it matters much for Cummins, but Root really has to attack, and with such a weak batting order around him, making early inroads with the new ball may be his only route to victory. There’s been plenty of talk about the pitch here at the MCG, but - Melbourne being Melbourne - the start of play is under threat from drizzle. Just ten minutes out from the toss, the pitch is under cover as some rain drifts across the arena. It’s been midsummer beautiful in Victoria for a week or so, but conditions today are cool, there’s a blanket of cloud swaddling the CBD, and some of it is heavy enough to reach ground level. Some sad news to begin with following the announcement of the death of former England allrounder, captain, coach, selector, and self-appointed supremo, Ray Illingworth. Hello everybody and welcome to live over-by-over coverage of the Boxing Day Ashes Test. We’re underway at the Melbourne Cricket Ground at 10.30am local time (11.30pm UK). I hope you’re all well-fed, well-rested, and ready for one of the landmark days on the sporting calendar. As Cliff Richard sang, it’s a time for giving (your wicket away reverse-sweeping to point during a blockathon) a time for getting (dropped), a time for forgiving (Jos Buttler) and a time for forgetting (Joe Root winning the toss in Brisbane). Now let’s rejoice in the good that we see. That good includes the selection of Scott Boland, only the second Indigenous Australian man to be awarded a baggy green, as well as the prospect of 70,000 or so fans inside the MCG, providing one of sport’s most incredible audiences. There’s England’s final chance to right some wrongs in the battle to regain the Ashes. Pat Cummins is back. So is Jonny Bairstow. And Zak Crawley. So put the wrapping paper in the recycling, lay out your selection box on the table, and settle in for one of the best days (or nights) of sport of the year. I’ll be back with more shortly, but if you would like to join in, you can reach me by email or Twitter ( @JPHowcroft ).","image_url":"https://i.guim.co.uk/img/media/e7bb4d28a464e9c0375daa7940aa15ffe208b0e3/0_362_5427_3256/master/5427.jpg?width=460&quality=85&auto=format&fit=max&s=358d5d57a3e8fb92c06d99599c6127d8","source_id":"theguardian"},{"title":"Boxing Day Ashes Test to get underway at the MCG","link":"https://www.news.com.au/sport/boxing-day-ashes-test-to-get-underway-at-the-mcg/video/a82838c458fff5396250e4dd673edbe3","keywords":null,"creator":null,"video_url":null,"description":"Melbournians are preparing for one of the biggest days of the Australian sporting calendar, with the Boxing Day Test set to get underway at the MCG later this morning. Spectators will have something to look forward to in Victorian paceman Scott Boland making his Test debut for Australia – at 32 years of age. Mr Boland is only the second male Indigenous Test player in Australian cricket history after Jason Gillespie. All eyes will also be on Marcus Harris after the embattled Aussie opener looks to find some form in front of his home crowd after struggling to score runs in the first two Tests. England have made four changes to their side – including the omission of fast bowler Stuart Broad.","content":null,"pubDate":"2021-12-25 22:36:42","full_description":null,"image_url":null,"source_id":"news"},{"title":"Novak Djokovic ‘pulls out of ATP Cup’ as doubts continue over Covid vaccination and Australian Open defence","link":"https://www.thesun.co.uk/sport/17144488/novak-djokovic-pulls-out-atp-cup-australian-open/","keywords":["Sport","Tennis","Australian Open 2021"],"creator":["Joshua Jones"],"video_url":null,"description":"NOVAK DJOKOVIC’S Australian Open defence has been thrown into doubt once again – after he reportedly pulled out of the ATP Cup. The world No1 was named in 2020 champions Serbia’s team to play in the men’s team competition in Sydney next week. Serbia are in Group A along with Norway, Chile and Spain at […]","content":"NOVAK DJOKOVIC’S Australian Open defence has been thrown into doubt once again – after he reportedly pulled out of the ATP Cup. The world No1 was named in 2020 champions Serbia’s team to play in the men’s team competition in Sydney next week. AFPNovak Djokovic has reportedly withdrawn from Serbia’s ATP Cup team a week before the tournament[/caption] Serbia are in Group A along with Norway, Chile and Spain at the ATP Cup, which is scheduled for January 1-9 before the Australian Open begins on January 17. But Serbian newspaper Blic reported Djokovic will not travel Down Under for the tournament. And the latest news has led to suggestions he might not travel to Australia at all for the season-opening swing. Djokovic has still not confirmed whether or not he has been fully vaccinated against coronavirus as question marks remain over his involvement at the Australian Open. Australian Open chief Craig Tiley said on Wednesday that he is still uncertain if Djokovic will be playing at the first Grand Slam of 2022 He confirmed all players and staff at the Australian Open would be vaccinated or have a medical exemption granted by an independent panel of experts. Most read in Sport SAVED! How surgery transformed 'ugly' scorpion kick keeper Higuita - he's SO different now LEGEND LOST Former Ashes-winning England cricket captain Ray Illingworth dies at 89 NEW LOOK Man Utd legend looks like a new man with bushy beard and grey hair TROUBLE 19 Darts World Championships on alert over Covid outbreak fears after positive test DRIVING OFF Hamilton WILL retire after Abu Dhabi controversy, says Bernie Ecclestone FAN'S BEST FRIEND Ex Premier League star ordered to pay £22,400 to man who found his dog FREE BETS: GET OVER £2,000 IN NEW CUSTOMER DEALS But speaking after Serbia’s Davis Cup exit, Djokovic – who is on the Oz Open entrant list – said: “I understand you want some answers on where I start the season, how I start it. “I’m really, really tired from this season and this whole year, so I just prefer sticking to the family quality time, rehab mode, then let’s see what the future brings. “You will be informed. I know what you want. I’m not going to give you an answer tonight. “I know what you want to ask me. But you will be informed. That’s all I can tell you. “I cannot give you any date. Obviously, Australia is around the corner, so you will know very soon.” Djokovic beat Daniil Medvedev in last year’s final to secure his ninth crown in Melbourne. And should he successfully defend his title, he would surpass Roger Federer and Rafael Nadal on to a record-breaking 21 Grand Slams.","pubDate":"2021-12-25 22:12:27","full_description":"NOVAK DJOKOVIC'S Australian Open defence has been thrown into doubt once again - after he reportedly pulled out of the ATP Cup. The world No1 was named in 2020 champions Serbia's team to play in the men's team competition in Sydney next week. Serbia are in Group A along with Norway, Chile and Spain at the ATP Cup, which is scheduled for January 1-9 before the Australian Open begins on January 17. But Serbian newspaper Blic reported Djokovic will not travel Down Under for the tournament. And the latest news has led to suggestions he might not travel to Australia at all for the season-opening swing. Djokovic has still not confirmed whether or not he has been fully vaccinated against coronavirus as question marks remain over his involvement at the Australian Open . Australian Open chief Craig Tiley said on Wednesday that he is still uncertain if Djokovic will be playing at the first Grand Slam of 2022 He confirmed all players and staff at the Australian Open would be vaccinated or have a medical exemption granted by an independent panel of experts. FREE BETS: GET OVER £2,000 IN NEW CUSTOMER DEALS But speaking after Serbia's Davis Cup exit , Djokovic - who is on the Oz Open entrant list - said: \"I understand you want some answers on where I start the season, how I start it. \"I'm really, really tired from this season and this whole year, so I just prefer sticking to the family quality time, rehab mode, then let's see what the future brings. \"You will be informed. I know what you want. I'm not going to give you an answer tonight. \"I know what you want to ask me. But you will be informed. That's all I can tell you. \"I cannot give you any date. Obviously, Australia is around the corner, so you will know very soon.\" Djokovic beat Daniil Medvedev in last year's final to secure his ninth crown in Melbourne. And should he successfully defend his title, he would surpass Roger Federer and Rafael Nadal on to a record-breaking 21 Grand Slams.","image_url":null,"source_id":"thesun"},{"title":"Ex England skipper Ray Illingworth dies aged 89","link":"https://www.news.com.au/sport/cricket/ex-england-skipper-ray-illingworth-dies-aged-89/video/6bf2e80d7d3a55bd28a6c381cf9ad4cd","keywords":null,"creator":null,"video_url":null,"description":"Tributes have flowed for former England cricket captain Ray Illingworth following his death at the age of 89.","content":null,"pubDate":"2021-12-25 22:02:30","full_description":null,"image_url":null,"source_id":"news"},{"title":"Ex England skipper Ray Illingworth dies aged 89","link":"https://www.cairnspost.com.au/sport/cricket/ex-england-skipper-ray-illingworth-dies-aged-89/video/6bf2e80d7d3a55bd28a6c381cf9ad4cd","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Tributes have flowed for former England cricket captain Ray Illingworth following his death at the age of 89.","content":null,"pubDate":"2021-12-25 22:02:30","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Can Aussies continue Ashes domination?","link":"https://www.news.com.au/sport/cricket/ashes-202122-follow-all-the-action-from-day-one-of-the-boxing-day-test-between-australia-and-england/news-story/80971fde7080e3f4d62270de21383f41","keywords":null,"creator":null,"video_url":null,"description":"The biggest day on the cricket calendar has arrived.","content":null,"pubDate":"2021-12-25 21:01:00","full_description":"The biggest day on the cricket calendar has arrived. A huge crowd is expected at the Boxing Day Test as Australia looks to inflict even more pain on England. The home side already holds a 2-0 series lead after handing out smashings in Brisbane and Adelaide. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Now they can lock in a series win with a victory in Melbourne. Scott Boland will make his debut for Australia while Pat Cummins returns from his Covid close-contact absence. Bowlers Jhye Richardson and Michael Neser have been given a rest. For England, Rory Burns, Ollie Pope, Chris Woakes and Stuart Broad have all been dropped. Zak Crawley, Mark Wood and Jack Leach are among the inclusions. Follow our live blog below for all the latest news from the MCG. Originally published as Ashes 2021-22: Follow all the action from day one of the Boxing Day Test between Australia and England To join the conversation, please log in. Don't have an account? Register Join the conversation, you are commenting as Logout Ashes legend and former England captain Ray Illingworth, who led his nation to a win on Australian soil in seventies, has lost his battle to cancer. English cricket is in mourning as the last man to lead the nation to an unbeaten Ashes series win on Australian soil has died. Australian sportswomen have achieved incredible feats this year, dominating on the biggest stages of all. We rank our top-20 female athletes of 2021.","image_url":null,"source_id":"news"},{"title":"Tributes paid after Yorkshire cricket legend Ray Illingworth dies","link":"https://www.thetelegraphandargus.co.uk/sport/19809134.tributes-paid-yorkshire-cricket-legend-ray-illingworth-dies/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Former England captain Ray Illingworth has died at the age of 89.","content":null,"pubDate":"2021-12-25 20:49:30","full_description":"Former England captain Ray Illingworth has died at the age of 89. Illingworth, who led England to a 2-0 Ashes series victory in Australia in 1970-71, had been undergoing radiotherapy for oesophageal cancer. Illingworth, who enjoyed a hugely successful domestic career with Yorkshire and Leicestershire, played 61 Tests for England between 1958 and 1973, scoring 1,836 runs at an average of 23.24 and claiming 122 wickets at 31.20. He captained England 31 times, winning 12 of those matches. Illingworth served as chairman of selectors for England between 1993 and 1996 and coached the national team in 1995-96. England and Wales Cricket Board chief executive Tom Harrison said in a statement: “It’s always incredibly sad to lose a person who has given so much to the English game, and to the sport of cricket in general. “Ray was a superb cricketer, and his deep love, passion and knowledge for the game meant he continued to contribute long after his playing days had finished. We send our sympathy and warmest wishes to Ray’s friends and family at this difficult time.” Illingworth’s first-class career spanned a remarkable 32 years from his debut in 1951 to his final appearance in 1983. He finished with a final total of 24,134 first-class runs and 2,072 wickets and was named a Wisden Cricketer of the Year in 1960. He played for Yorkshire from 1951 to 1968, leading them to three successive County Championship victories in those final three years, before joining Leicestershire in 1969, remaining at Grace Road until 1978. He returned to Yorkshire initially as team manager but made his playing comeback at the age of 50 in 1982. Yorkshire paid tribute to “the club’s most successful modern day captain”. “We are deeply saddened to learn that Ray Illingworth has passed away,” the county said in a statement. “His success at county level was matched on the international scene, enjoying a long career with England as captain. “Our thoughts are with Ray’s family and the wider Yorkshire family who held Ray so dear to their hearts.” The club’s chairman Lord Patel described Illingworth as “one of Yorkshire’s, and England’s, greatest players”. He said: “He had a significant, and lasting, impact, and will be fondly remembered by fans of cricket across the county and the nation. My heart goes out to his family and all who knew him.” Leicestershire said on Twitter: “Everybody at Leicestershire County Cricket Club are deeply, deeply saddened to hear of the passing of former Captain, Ray Illingworth. “Our thoughts are with Illy’s family and friends at this difficult time.” Marylebone Cricket Club, of which Illingworth was an honorary life member, also said it was “deeply saddened” to learn of his death. Farsley Cricket Club, Illingworth’s local club where he would prepare wickets well into his 70s, said cricket had “lost a great”. They added on Twitter: “Absolute LEGEND of a man you will be sorely missed by many!” Illingworth’s wife Shirley died earlier this year after battling cancer and Illingworth had offered his support for law changes over assisted dying. “I don’t want to have the last 12 months that my wife had,” he said. “She had a terrible time going from hospital to hospital and in pain. “I believe in assisted dying. The way my wife was, there was no pleasure in life in the last 12 months, and I don’t see the point of living like that, to be honest. “But we don’t have assisted dying in England yet, so you don’t have the option do you? They are debating it and I think it will come eventually. “A lot of doctors are against it, but if they had to live like my wife did in her last 12 months they might change their minds.”","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/13329718/?type=app&htype=74","source_id":"thetelegraphandargus"},{"title":"England cricket in mourning as Ashes hero dies","link":"https://wwos.nine.com.au/cricket/england-ray-illingworth-dies-aged-89-ashes-legend/be6c2c6c-a1df-47c4-b761-a0f65f214e4c","keywords":null,"creator":["wwos"],"video_url":null,"description":"A former England cricket captain who led England to a 2-0 series victory in Australia in the 1970-71 Ashes, has died.","content":"Ray Illingworth, a former England cricket captain who went on to coach the team, has died. He was 89.Illingworth, who led England to a 2-0 series victory in Australia in the 1970-71 Ashes, had been undergoing radiotherapy for esophageal cancer. Yorkshire, the English county Illingworth played for, announced his death this morning.\"Our thoughts are with Ray's family and the wider Yorkshire family who held Ray so dear to their hearts,\" Yorkshire tweeted.READ MORE: Root's future on the line amidst Ashes calamityREAD MORE: 'Divided' England in turmoilIllingworth played 61 test matches for England between 1958 and 1973, scoring 1,836 runs at an average of 23.24 and he claimed 122 wickets.https://twitter.com/YorkshireCCC/status/1474730255357292545He captained England 31 times, winning 12 of those matches. He served as chairman of selectors for England between 1993 and 1996 and coached the national team in 1995-96.\"Ray was a superb cricketer, and his deep love, passion and knowledge for the game meant he continued to contribute long after his playing days had finished,\" England and Wales Cricket Board chief executive Tom Harrison said.Illingworth's top-level playing career spanned 32 years from his debut in 1951 to his final appearance in 1983. He finished with a final total of 24,134 first-class runs and 2,072 wickets and was named a Wisden Cricketer of the Year in 1960.Illingworth's wife, Shirley, died earlier this year after battling cancer and Illingworth had offered his support to change the laws in Britain on assisted dying.\"I don't want to have the last 12 months that my wife had,\" he had said. \"She had a terrible time going from hospital to hospital and in pain. I believe in assisted dying. The way my wife was, there was no pleasure in life in the last 12 months, and I don't see the point of living like that, to be honest.https://twitter.com/englandcricket/status/1474759701334265865\"But we don't have assisted dying in England yet, so you don't have the option do you? They are debating it and I think it will come eventually. A lot of doctors are against it, but if they had to live like my wife did in her last 12 months they might change their minds.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-25 20:34:07","full_description":"Ray Illingworth, a former England cricket captain who went on to coach the team, has died. He was 89. Illingworth, who led England to a 2-0 series victory in Australia in the 1970-71 Ashes, had been undergoing radiotherapy for esophageal cancer. Yorkshire, the English county Illingworth played for, announced his death this morning. \"Our thoughts are with Ray's family and the wider Yorkshire family who held Ray so dear to their hearts,\" Yorkshire tweeted. READ MORE: Root's future on the line amidst Ashes calamity READ MORE: 'Divided' England in turmoil Illingworth played 61 test matches for England between 1958 and 1973, scoring 1,836 runs at an average of 23.24 and he claimed 122 wickets. He captained England 31 times, winning 12 of those matches. He served as chairman of selectors for England between 1993 and 1996 and coached the national team in 1995-96. \"Ray was a superb cricketer, and his deep love, passion and knowledge for the game meant he continued to contribute long after his playing days had finished,\" England and Wales Cricket Board chief executive Tom Harrison said. Illingworth's top-level playing career spanned 32 years from his debut in 1951 to his final appearance in 1983. He finished with a final total of 24,134 first-class runs and 2,072 wickets and was named a Wisden Cricketer of the Year in 1960. Illingworth's wife, Shirley, died earlier this year after battling cancer and Illingworth had offered his support to change the laws in Britain on assisted dying. \"I don't want to have the last 12 months that my wife had,\" he had said. \"She had a terrible time going from hospital to hospital and in pain. I believe in assisted dying. The way my wife was, there was no pleasure in life in the last 12 months, and I don't see the point of living like that, to be honest. \"But we don't have assisted dying in England yet, so you don't have the option do you? They are debating it and I think it will come eventually. A lot of doctors are against it, but if they had to live like my wife did in her last 12 months they might change their minds.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400557/pickerimage.jpg","source_id":"nine"},{"title":"3rd Ashes Test: Boland to make Test debut, England makes 4 changes","link":"https://www.thehansindia.com/sports/3rd-ashes-test-boland-to-make-test-debut-eng-makes-4-changes-721675","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Australia will give fast bowler Scott Boland a Test debut in the third Ashes match beginning on Sunday at the Melbourne Cricket Ground while England has made four changes to its side.","content":"Boland to make Test debut, England makes 4 changesBoland to make Test debut, England makes 4 changesMelbourne: Australia will give fast bowler Scott Boland a Test debut in the third Ashes match beginning on Sunday at the Melbourne Cricket Ground while England has made four changes to its side.Boland was brought in as cover earlier this week and received the starting nod when fellow fast bowlers Jhye Richardson and Michael Neser were ruled out because of muscle soreness. Josh Hazelwood was already out as he continues to recover from side strain, meaning captain Pat Cummins and Boland are the two new inclusions to the Australian XI. \"Jhye and Nes were a little bit sore after Adelaide so we've decided to go with Scotty,\" said Cummins, who missed the Adelaide Test after being a close contact of a COVID-19 case. \"It's a luxury to have someone like him, fresh and ready to go.\" Boland will become the second Australian male indigenous Test player after fellow pace bowler Jason Gillespie. Australia, which leads the five-match series 2-0, can wrap up the series and clinch the Ashes with a victory at the MCG. England, meanwhile, dropped opener Rory Burns and paceman Stuart Broad, along with Ollie Pope and Chris Woakes. Bowlers Mark Wood and Jack Leach will return to the starting side, while Zak Crawley and Jonathan Bairstow will play their first Tests in this series. England also confirmed Jos Buttler will continue as wicketkeeper, rather than Bairstow taking over the gloves. Buttler was in a confident mood Saturday at a Christmas morning media conference. \"We're certainly not here to just take part and let 70,000 people enjoy another Australian victory,\" Buttler said. \"We have to fight back, we want to win the series and we want to win this test match. I'm sure it will be a hostile environment here but that's to be embraced and enjoyed, everyone is excited to be here. This is why you play the game because you want to be part of big occasions.\" (AP) Lineups Australia: David Warner, Marcus Harris, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey, Pat Cummins (captain), Mitchell Starc, Nathan Lyon, Scott Boland. England: Joe Root (captain), Haseeb Hameed, Zak Crawley, Dawid Malan, Ben Stokes, Jonathan Bairstow, Jos Butler, Mark Wood, Ollie Robinson, Jack Leach, James Anderson.","pubDate":"2021-12-25 20:27:51","full_description":"Boland to make Test debut, England makes 4 changes Melbourne: Australia will give fast bowler Scott Boland a Test debut in the third Ashes match beginning on Sunday at the Melbourne Cricket Ground while England has made four changes to its side. Boland was brought in as cover earlier this week and received the starting nod when fellow fast bowlers Jhye Richardson and Michael Neser were ruled out because of muscle soreness. Josh Hazelwood was already out as he continues to recover from side strain, meaning captain Pat Cummins and Boland are the two new inclusions to the Australian XI. \"Jhye and Nes were a little bit sore after Adelaide so we've decided to go with Scotty,\" said Cummins, who missed the Adelaide Test after being a close contact of a COVID-19 case. \"It's a luxury to have someone like him, fresh and ready to go.\" Boland will become the second Australian male indigenous Test player after fellow pace bowler Jason Gillespie. Australia, which leads the five-match series 2-0, can wrap up the series and clinch the Ashes with a victory at the MCG. England, meanwhile, dropped opener Rory Burns and paceman Stuart Broad, along with Ollie Pope and Chris Woakes. Bowlers Mark Wood and Jack Leach will return to the starting side, while Zak Crawley and Jonathan Bairstow will play their first Tests in this series. England also confirmed Jos Buttler will continue as wicketkeeper, rather than Bairstow taking over the gloves. Buttler was in a confident mood Saturday at a Christmas morning media conference. \"We're certainly not here to just take part and let 70,000 people enjoy another Australian victory,\" Buttler said. \"We have to fight back, we want to win the series and we want to win this test match. I'm sure it will be a hostile environment here but that's to be embraced and enjoyed, everyone is excited to be here. This is why you play the game because you want to be part of big occasions.\" (AP) Lineups Australia: David Warner, Marcus Harris, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey, Pat Cummins (captain), Mitchell Starc, Nathan Lyon, Scott Boland. England: Joe Root (captain), Haseeb Hameed, Zak Crawley, Dawid Malan, Ben Stokes, Jonathan Bairstow, Jos Butler, Mark Wood, Ollie Robinson, Jack Leach, James Anderson.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/25/500x300_1137768-sports.jpg","source_id":"thehansindia"},{"title":"India out to crack Proteas code","link":"https://www.thehansindia.com/sports/india-out-to-crack-proteas-code-721672","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"After notching up scintillating wins in Australia (twice) and England, India will be out to crack the all-elusive South Africa code when the three-match Test series begins with Boxing Day game at SuperSport Park in Centurion on Sunday.","content":"India out to crack Proteas code India out to crack Proteas code Centurion: After notching up scintillating wins in Australia (twice) and England, India will be out to crack the all-elusive South Africa code when the three-match Test series begins with Boxing Day game at SuperSport Park in Centurion on Sunday.After the Omicron variant of COVID-19 virus threatened to cancel the tour, the fixtures were revised with the Tests and ODIs retaining their places and changes in dates. South Africa, with its pace, bounce and challenging pitches, has been a place where India haven't won yet. Australia and England have been conquered but South Africa is yet to be. In 2018, India gave a glimmer of hope when it began the first Test at Cape Town very well. But South Africa bounced back and quashed hopes of an Indian win, eventually winning the series 2-1. Starting the series well is something vice-captain KL Rahul is extremely aware of. \"The discussion so far has only been about the first Test match. We are not thinking too far ahead. The first Test match of the series is the most important for us to start well. All our discussion and focus has been on trying to do the best in the first game and get the team off to a good start, be it with the bat or ball,\" Rahul had said in the virtual press conference on Friday. On paper, India have got the arsenal to match South Africa in terms of pace line-up. Since the tour of 2018, Jasprit Bumrah's stocks have risen in Test cricket, followed by Mohammed Shami and Ishant Sharma with Umesh Yadav, Mohammed Siraj and Shardul Thakur completing the hexagon of India's world-class pace attack. The tourists' pace bowling contingent is something which South Africa captain Dean Elgar had singled out as the biggest challenge for the hosts. \"Their strength at the moment lies in their bowling. We are extremely aware of that as well. They have had a lot of successes as a bowling unit. They have got a lot of older spearhead bowlers that lead the attack and have got a good back-up set of bowlers as well. Being in South Africa, I am pretty sure their bowling attack will exploit the conditions reasonably well.\" Though India is missing the services of left-arm spin all-rounders Ravindra Jadeja and Axar Patel, trust off-spinner Ravichandran Ashwin to be the sole spin lead with Thakur filling in for the all-rounder's slot. But the main concerns of the Indian team have been in batting, with captain Virat Kohli and senior pros Cheteshwar Pujara and Ajinkya Rahane in the middle of a lean patch. In the recent home series against New Zealand, India were majorly bailed out of trouble by newbie Shreyas Iyer in Kanpur and opener Mayank Agarwal in Mumbai. With Rohit Sharma out of the series due to a left hamstring injury, the batters have to put their best foot forward. South Africa, on the other hand, will be playing a Test match for the first time since playing two matches against West Indies in June. Though the hosts' batting might has been depleted by the retirements of AB de Villiers, Hashim Amla and Faf du Plessis, captain Dean Elgar is still there with Aiden Markram and Rassie van der Dussen for company. But they will have more batting concerns in terms of experience with wicketkeeper-batter Quinton de Kock only available for the first Test before going on paternity leave. But their bowling unit, led by Kagiso Rabada, is still capable of troubling the Indian batters despite the absence of Anrich Nortje. Lungi Ngidi, who shone with 6/39 on Test debut against India at this venue in 2018, has been plagued by injuries and recently, COVID-19. South Africa will be hoping that he and the returning Duanne Olivier can maintain the strength of their fast-bowling stocks. In the Proteas' favour, Centurion has been a fortress, just like the Gabba has been for Australia. In 26 Tests at the venue, South Africa have won 21 times and faced defeat only twice, against England in 2000 and Australia in 2014. But with them and India having pockets of weakness in batting, one can say that the series could be decided by runs and to some extent, the ability to dismiss the batters quickly. Squads South Africa: Dean Elgar (captain), Temba Bavuma (vice-captain), Quinton de Kock (wicket-keeper), Kagiso Rabada, Sarel Erwee, Beuran Hendricks, George Linde, Keshav Maharaj, Lungi Ngidi, Aiden Markram, Wiaan Mulder, Keegan Petersen, Rassie van der Dussen, Kyle Verreynne, Marco Jansen, Glenton Stuurman, Prenelan Subrayen, Sisanda Magala, Ryan Rickelton and Duanne Olivier. India: Virat Kohli (captain), KL Rahul (vice-captain), Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Shreyas Iyer, Hanuma Vihari, Rishabh Pant (wicket-keeper), Wriddhiman Saha (wicket-keeper), Ravichandran Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur and Mohammed Siraj.","pubDate":"2021-12-25 20:23:35","full_description":"India out to crack Proteas code Centurion: After notching up scintillating wins in Australia (twice) and England, India will be out to crack the all-elusive South Africa code when the three-match Test series begins with Boxing Day game at SuperSport Park in Centurion on Sunday. After the Omicron variant of COVID-19 virus threatened to cancel the tour, the fixtures were revised with the Tests and ODIs retaining their places and changes in dates. South Africa, with its pace, bounce and challenging pitches, has been a place where India haven't won yet. Australia and England have been conquered but South Africa is yet to be. In 2018, India gave a glimmer of hope when it began the first Test at Cape Town very well. But South Africa bounced back and quashed hopes of an Indian win, eventually winning the series 2-1. Starting the series well is something vice-captain KL Rahul is extremely aware of. \"The discussion so far has only been about the first Test match. We are not thinking too far ahead. The first Test match of the series is the most important for us to start well. All our discussion and focus has been on trying to do the best in the first game and get the team off to a good start, be it with the bat or ball,\" Rahul had said in the virtual press conference on Friday. On paper, India have got the arsenal to match South Africa in terms of pace line-up. Since the tour of 2018, Jasprit Bumrah's stocks have risen in Test cricket, followed by Mohammed Shami and Ishant Sharma with Umesh Yadav, Mohammed Siraj and Shardul Thakur completing the hexagon of India's world-class pace attack. The tourists' pace bowling contingent is something which South Africa captain Dean Elgar had singled out as the biggest challenge for the hosts. \"Their strength at the moment lies in their bowling. We are extremely aware of that as well. They have had a lot of successes as a bowling unit. They have got a lot of older spearhead bowlers that lead the attack and have got a good back-up set of bowlers as well. Being in South Africa, I am pretty sure their bowling attack will exploit the conditions reasonably well.\" Though India is missing the services of left-arm spin all-rounders Ravindra Jadeja and Axar Patel, trust off-spinner Ravichandran Ashwin to be the sole spin lead with Thakur filling in for the all-rounder's slot. But the main concerns of the Indian team have been in batting, with captain Virat Kohli and senior pros Cheteshwar Pujara and Ajinkya Rahane in the middle of a lean patch. In the recent home series against New Zealand, India were majorly bailed out of trouble by newbie Shreyas Iyer in Kanpur and opener Mayank Agarwal in Mumbai. With Rohit Sharma out of the series due to a left hamstring injury, the batters have to put their best foot forward. South Africa, on the other hand, will be playing a Test match for the first time since playing two matches against West Indies in June. Though the hosts' batting might has been depleted by the retirements of AB de Villiers, Hashim Amla and Faf du Plessis, captain Dean Elgar is still there with Aiden Markram and Rassie van der Dussen for company. But they will have more batting concerns in terms of experience with wicketkeeper-batter Quinton de Kock only available for the first Test before going on paternity leave. But their bowling unit, led by Kagiso Rabada, is still capable of troubling the Indian batters despite the absence of Anrich Nortje. Lungi Ngidi, who shone with 6/39 on Test debut against India at this venue in 2018, has been plagued by injuries and recently, COVID-19. South Africa will be hoping that he and the returning Duanne Olivier can maintain the strength of their fast-bowling stocks. In the Proteas' favour, Centurion has been a fortress, just like the Gabba has been for Australia. In 26 Tests at the venue, South Africa have won 21 times and faced defeat only twice, against England in 2000 and Australia in 2014. But with them and India having pockets of weakness in batting, one can say that the series could be decided by runs and to some extent, the ability to dismiss the batters quickly. Squads South Africa: Dean Elgar (captain), Temba Bavuma (vice-captain), Quinton de Kock (wicket-keeper), Kagiso Rabada, Sarel Erwee, Beuran Hendricks, George Linde, Keshav Maharaj, Lungi Ngidi, Aiden Markram, Wiaan Mulder, Keegan Petersen, Rassie van der Dussen, Kyle Verreynne, Marco Jansen, Glenton Stuurman, Prenelan Subrayen, Sisanda Magala, Ryan Rickelton and Duanne Olivier. India: Virat Kohli (captain), KL Rahul (vice-captain), Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Shreyas Iyer, Hanuma Vihari, Rishabh Pant (wicket-keeper), Wriddhiman Saha (wicket-keeper), Ravichandran Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur and Mohammed Siraj.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/25/500x300_1137766-sports.jpg","source_id":"thehansindia"},{"title":"Former England Test captain and Ashes legend dies at 89 - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvdGhlLWFzaGVzL2NyaWNrZXQtbmV3cy0yMDIxLWVuZ2xhbmQtcmF5LWlsbGluZ3dvcnRoLWRpZXMtZGVhdGgtYWdlLWFzaGVzLWxlZ2VuZC9uZXdzLXN0b3J5L2NkYmYwZDc3MTIyZTAzNjVjNTJlZTUyOTAyNjVkYjU20gGgAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC90aGUtYXNoZXMvY3JpY2tldC1uZXdzLTIwMjEtZW5nbGFuZC1yYXktaWxsaW5nd29ydGgtZGllcy1kZWF0aC1hZ2UtYXNoZXMtbGVnZW5kL25ld3Mtc3RvcnkvY2RiZjBkNzcxMjJlMDM2NWM1MmVlNTI5MDI2NWRiNTY?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Former England Test captain and Ashes legend dies at 89  Fox Sports‘Very sad’: Tributes flow as Ashes giant dies  NEWS.com.auLegendary Ashes all-rounder dies at 89  Herald SunFormer England Test Captain Ray Illingworth Dies At 89  NDTV SportsFormer England cricket captain Ray Illingworth dies aged 89  Taiwan NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-25 20:09:18","image_url":null,"source_id":"google"},{"title":"THU vs SIX Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for BBL 2021-22, Match 20","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/thu-vs-six-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bbl-2021-22-match-20?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-25 19:19:09","full_description":"The Sydney Thunder will be locking horns with the Sydney Sixers in the 20th match of the Big Bash League (BBL) 2021-22 on Sunday, 26th December at Sydney Showground Stadium. The Sydney Thunder have had a rollercoaster journey in the BBL 2021-22 and are currently fourth in the points table with two wins and as many losses. After two consecutive defeats, they got back to winning ways with a 53-run victory over the Brisbane Heat in their previous outing. The Thunder will hope to keep the momentum going in their next game. Meanwhile, the Sydney Sixers have kickstarted their BBL 2021-22 campaign in fine fashion, winning four out of five games so far. They presently hold the second spot on the points table with 14 points to their name. Led by Moises Henriques, the Sixers have been excellent and will be eager to sustain their top form. Sydney Thunder Sam Billings (WK), Matthew Gilkes, Alex Hales, Jason Sangha , Chris Green(C), Daniel Sams, Saqib Mahmood, Tanveer Sangha, Ben Cutting , Alex Ross, Nathan McAndrew Sydney Sixers Josh Philippe (WK), Daniel Hughes, Lloyd Pope, James Vince , Moises Henriques (C), Jordan Silk, Daniel Christian , Sean Abbott, Hayden Kerr, Chris Jordan , Ben Dwarshuis Match : Sydney Thunder vs Sydney Sixers, Match 20, Big Bash League 2021 Date and Time : December 26th 2021, 12:35 PM IST Venue : Sydney Showground Stadium, Sydney The surface at the Sydney Showground Stadium has generally favored the batters. The batters enjoy batting on this track as the ball comes nicely onto the bat. The bowlers need to be precise with their lengths while bowling on this surface. Wicketkeeper Josh Philippe: Josh Philippe has hit the ground running this season, with three fifties in five games. He has been consistent with his shot selection, mixing caution with aggression in equal measure. Philippe has smashed a total of 282 runs so far and is currently the highest scorer in the BBL. Batters Alex Ross: Alex is another in-form player this season who can hit the ball all over the ground and assist his team to put up a massive total. He couldn’t live up to expectations in the last game but has performed pretty well in the first three games, scoring 155 runs. James Vince: Vince hasn't been at his best so far with the bat but he is a versatile T20 batter. He has 113 runs to his name this season and will be looking forward to scoring in this game. All-rounders Moises Henriques: Henriques is the best pick from the Sixers side given his knack for scoring vital runs down the order. He also adds value with his bowling in the middle overs, making him one to watch out for in this game. Daniel Sams: Daniel Sams has scored handy runs with the bat as well as picked up four wickets. He is expected to play in this game and make vital contributions for his side. Bowlers Sean Abbott: Abbott has shown glimpses of his fantastic death-bowling skills in the BBL 2021-22, chipping in with six wickets in three matches. He has proven to be an economical bowler for the Sydney Sixers. Tanveer Sangha: Tanveer Sangha will be crucial with his bowling variations. He has consistently picked up key wickets in the last four games for the Thunder. Josh Philippe: 442 points Moises Henriques: 323 points Tanveer Sangha: 260 points Sam Billings: 253 points Alex Ross: 250 points Josh Philippe: 5 matches, 282 runs Moises Henriques: 5 matches, 232 runs Sam Billings: 4 matches, 160 runs Alex Ross: 4 matches, 159 runs Tanveer Sangha: 4 matches, 8 wickets Fantasy Suggestion #1 : Josh Philippe, Sam Billings, Alex Ross, James Vince, Jason Sangha, Moises Henriques, Dan Christian, Daniel Sams, Sean Abbott, Tanveer Sangha, Hayden Kerr Captain: Josh Philippe Vice-Captain: Alex Ross Fantasy Suggestion #2 : Josh Philippe, Matthew Gilkes, Alex Ross, James Vince, Jordan Silk, Alex Hales, Moises Henriques, Daniel Sams, Sean Abbott, Tanveer Sangha, Saqib Mahmood Captain: Moises Henriques Vice-Captain: Daniel Sams","image_url":"https://static.sportskeeda.com/editor/2021/12/cdd3c-16404556200830-1920.jpg","source_id":"sportskeeda"},{"title":"SAP vs EME Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for KCA Pink T20 Challengers 2021 Match 19","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sap-eme-dream11-prediction-fantasy-cricket-tips-todays-playing-11-pitch-report-kca-pink-t20-challengers-2021-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-25 19:19:09","full_description":"Team Sapphire will take on Team Emerald in Match No. 19 of the KCA Pink T20 Challengers 2021 at the Sanatana Dharma College Ground, Alappuzha, Kerala on Sunday. Team Sapphire have been inconsistent so far, having won three matches and lost four. They are currently fifth in the points table. Team Emerald, on the other hand, are sitting pretty at the top of the points table. They have returned with six wins and a loss so far. Team Sapphire : Drishya Devan (wk), Ajanya T P, Ansu Sunil, Ananya Pradeep, Drisya, Sajeevan Sajana, Sooya Sukumar, Potti Manasvi, Renjusha, Diya Gireesh, Sraya Roy Team Emerald : Fairooz Fathima (wk), B Sauparnika, Mani Minnu, Darsana Mohanan, Aleena Surendran, Vinaya Surendran, Anaswara Santosh, VJ Joshitha, Alka A Suresh-I, Stanly Steffi, Yadhu Priya Match: SAP vs EME Date & Time: December 26th 2021, 9 AM IST Venue: Sanatana Dharma College Ground, Alappuzha, Kerala It hasn't been a very high-scoring tournament so far and the average score batting first after 18 games is just 107. Thus, another track favoring the bowlers may be in store at the Sanatana Dharma College Ground in Alappuzha. Wicketkeeper Drishya Devan is the leading run-getter for SAP, having aggregated 222 runs at an average of 44.40. Batters Ajanya T.P. has fared well with the ball and has taken eight wickets in seven games. All-rounders Mani Minnu has had a significant impact with both the bat and the ball. She has returned with 12 scalps and has amassed 268 runs. Sajeevan Sajana is in good all-round form. She has mustered 195 runs and has seven wickets to her name. Bowlers Anaswara Santosh has been in excellent touch with both the bat and the ball. She has scored 116 runs and has picked up 10 wickets. Mani Minnu (EME): 904 points Sajeevan Sajana (SAP): 539 points Anaswara Santosh (EME): 483 points Vinaya Surendran (EME): 392 points Drishya Devan (SAP): 351 points Sajeevan Sajana: 195 runs & seven wickets Drishya Devan: 222 runs Mani Minnu: 268 runs & 12 wickets Anaswara Santosh: 116 runs & 10 wickets Fantasy Suggestion #1: Drishya Devan, Ajanya T P, B Sauparnika, Ananya Pradeep, Sajeevan Sajana, Mani Minnu, Darsana Mohanan, Aleena Surendran, Vinaya Surendran, Anaswara Santosh, Diya Gireesh Captain: Mani Minnu Vice-captain: Sajeevan Sajana Fantasy Suggestion #2: Drishya Devan, Ajanya T P, B Sauparnika, Ananya Pradeep, Sajeevan Sajana, Mani Minnu, Darsana Mohanan, Alka A Suresh-I, Vinaya Surendran, Anaswara Santosh, Diya Gireesh Captain: Mani Minnu Vice-captain: Anaswara Santosh","image_url":"https://staticg.sportskeeda.com/editor/2021/12/85d19-16396714448020-1920.jpg","source_id":"sportskeeda"},{"title":"CM-W vs OS-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Women’s Super Smash 2021-22 Match 13","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/cm-w-vs-os-w-dream11-prediction-fantasy-cricet-tips-todays-playing-11-pitch-report-women-s-super-smash-2021-22-match-13?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-25 19:19:09","full_description":"Canterbury Magicians will take on Otago Sparks in Match No. 13 of the Women’s Super Smash 2021-22 at the Hagley Oval, Christchurch on Sunday. Canterbury Magicians have been inconsistent this season. Having won two games and lost two so far, they are fourth in the points table. On the other hand, Otago Sparks have won all four of their matches and are second in the points table. Canterbury Magicians : Amy Satterthwaite, Natalie Cox, Frances Mackay (c), Kirsty Nation, Jacinta Savage, Abigale Gerken, Melissa Banks, Sarah Asmussen, Laura Hughes (wk), Emma Kench, Jessica Simmons Otago Sparks : Suzie Bates (c), Polly Inglis, Katey Martin (wk), Kate Ebrahim, Caitlin Blakely, Bella James, Olivia Gain, EJ Carson, Emma Black, Sophie Oldershaw, ME Loe Match: CM-W vs OS-W Date & Time: December 26th 2021, 6:40 AM IST Venue: Hagley Oval, Christchurch The pitch at the Hagley Oval in Christchurch has been a decent one to bat on. 145 and 137 have been the scores batting first at this venue in this tournament. More of the same can be expected from this game and a score of around 145-150 could be par. Wicketkeeper Polly Inglis has looked in good touch with the bat, having scored 85 runs in four innings in this tournament. Batters Suzie Bates has batted superbly so far, amassing 170 runs in four innings, which includes two half-centuries. All-rounders Frances Mackay is in fabulous all-round form. She has smashed 153 runs and has picked up seven wickets with the ball. Kate Ebrahim has chipped in well with both the bat and the ball. She has notched 71 runs and has taken six wickets so far. Bowlers Sophie Oldershaw seems to have bowled consistently in this competition. She has six wickets to her name. Frances Mackay (CM-W): 426 points Suzie Bates (OS-W): 288 points Kate Ebrahim (OS-W): 283 points Sophie Oldershaw (OS-W): 220 points Amy Satterthwaite (CM-W): 203 points Frances Mackay: 153 runs & 7 wickets Amy Satterthwaite: 63 runs & 3 wickets Suzie Bates: 170 runs Kate Ebrahim: 71 runs & 6 wickets Fantasy Suggestion #1: Katey Martin, Polly Inglis, Suzie Bates, Natalie Cox, Jacinta Savage, Amy Satterthwaite, Kate Ebrahim, Frances Mackay, Melissa Banks, Emma Black, Sophie Oldershaw Captain: Frances Mackay Vice-captain: Kate Ebrahim Fantasy Suggestion #2: Polly Inglis, Suzie Bates, Natalie Cox, Jacinta Savage, Amy Satterthwaite, Kate Ebrahim, Frances Mackay, EJ Carson, Melissa Banks, Sophie Oldershaw, ME Loe Captain: Suzie Bates Vice-captain: Amy Satterthwaite","image_url":"https://static.sportskeeda.com/editor/2021/12/6ad8e-16404538863589-1920.jpg","source_id":"sportskeeda"},{"title":"Ray Illingworth, former England cricket captain and coach, dies aged 89 - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8yNS9yYXktaWxsaW5nd29ydGgtZm9ybWVyLWVuZ2xhbmQtY3JpY2tldC1jYXB0YWluLWFuZC1jb2FjaC1kaWVzLWFnZWQtODnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ray Illingworth, former England cricket captain and coach, dies aged 89  The GuardianRay Illingworth: Former England cricket captain has died aged 89  Sky NewsFormer England captain Ray Illingworth dies at the age of 89  Daily MailRay Illingworth: Yorkshire cricket legend has died at the age of 89  The Yorkshire PostRay Illingworth dead: Former England and Yorkshire cricket captain dies aged 89  ExpressView Full coverage on Google News","content":null,"pubDate":"2021-12-25 18:35:00","image_url":null,"source_id":"google"},{"title":"‘He needs to back it up’: Leaked cricket drug complaint sparks security warning","link":"https://www.theage.com.au/sport/cricket/he-needs-to-back-it-up-leaked-cricket-drug-complaint-sparks-security-warning-20211221-p59j9p.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Cowie"],"video_url":null,"description":"A confidential phone call between a whistleblower and Cricket Australia’s ex-integrity chief has been leaked, exposing serious security flaws in the organisation’s anti-corruption unit.","content":null,"pubDate":"2021-12-25 18:30:00","full_description":"A confidential phone call between a whistleblower and Cricket Australia’s ex-integrity chief discussing a then-player’s alleged cocaine use and sexual activities has been leaked, exposing serious security flaws in the organisation’s anti-corruption unit. The recording, sent anonymously to The Sunday Age , is of a call by former Cricket Australia head of integrity Sean Carroll to a woman who describes herself as a high-class escort and provides information that a well-known cricketer should “back it up” or he will end up destroying his career. Former Cricket Australia head of integrity Sean Carroll. In the phone call, the woman makes allegations about the player dancing naked on a balcony, openly using cocaine and cavorting with numerous women. It is believed the phone call took place several years ago, and the allegations against the unnamed player could not be substantiated. But the existence of the recording years later and the ease at which such recordings can be accessed has led to sports corruption experts warning that there is a risk of players being blackmailed and whistleblowers being deterred from coming forward. It is unclear how or when the recording was obtained from Cricket Australia. It was sent to The Sunday Age through an encrypted email service from an anonymous address. The player was not identified and The Sunday Age has established that the recording is genuine. The source of the leak said they wanted to bring attention to what they described as the integrity unit’s “abuse of power” and the lack of security around the handling of information from whistleblowers. The person said they were a former Cricket Australia staffer who wanted to expose flaws in the integrity unit and asked for the matter to be made public. “There are no rules regarding storage of these recordings, who can listen to them, or how long they should be archived,” the source said. “There are no policies or procedures in place regarding access, integrity and confidentiality of this material. “I want to protect members of the public, players and staff from an abuse of power and ensure accountability – I think this behaviour has gone unchecked for far too long.” In the recording, the woman who contacted Cricket Australia tells Mr Carroll she is surprised at the player’s behaviour given his public profile. “He needs to back it up a bit, back it up, like deadset seriously back it up because I’m probably doing him a favour if anything,” she says. “I wouldn’t want to be publicly letting everyone seeing me party and snorting lines.” The woman tells Mr Carroll there is “probably” video or photos of the player engaging in the reported activities but declines to provide any vision to Cricket Australia. She says the last time she saw it happen was in the lead-up to Christmas but does not say which year. “They party a lot these boys,” the woman says. Cricket Australia was unaware of the leak until an inquiry by The Sunday Age . A spokesman said it had been reported to the Victoria Police Sporting Integrity Intelligence Unit, which was providing assistance. “Cricket Australia takes this matter extremely seriously, which is why we contacted Victoria Police,” the spokesman said. “We constantly review our systems, and our controls around sensitive information are continually being improved and aligned with best practice. “We take integrity matters extremely seriously and ensure appropriate action is taken.” A Victoria Police spokeswoman said police had met with Cricket Australia but was not investigating the matter. It is the second major leak in two months involving players investigated by Cricket Australia’s integrity unit. In November, former Test captain Tim Paine resigned when his explicit texts sent to a co-worker in 2017 became public on the eve of the Ashes. Mr Carroll, who investigated the Paine complaint when it was first reported to Cricket Australia, left the organisation in December last year to take up a role as Victorian Racing Integrity Commissioner. Cricket Australia’s investigation of the complaint found Paine had not breached its code of conduct. Sport corruption researcher Adam Masters, a senior lecturer in criminology at Australian National University, said the recording of sensitive information made players vulnerable to blackmail and possible match-fixing. “The big risk with that sort of information, if it went to organised crime, is you’re looking at problems in places like the sub-continent where organised crime has historically been involved with sport gambling,” Dr Masters said. “Players are much more aware of approaches by gambling interests and organised crime [than they used to be]. However, something like drug taking and prostitution really opens that blackmail element up in a very broad kind of way.” University of Canberra integrity expert Catherine Ordway. Credit: Melissa Adams Integrity expert Catherine Ordway from the University of Canberra said sporting organisations needed to develop strong whistleblower protections. Dr Ordway, along with Dr Masters and associate professor Kath Hall, co-authored a report on sport corruption that contributed to the creation of a new national body, Sport Integrity Australia, last year. “What we found over the last decade is that most major corruption scandals in the world have come through a whistleblowing process,” she said. “It’s really important that the whistleblowing processes are strong and protected and that people who are providing information through these frameworks have confidence and trust in the system.” A Cricket Australia spokesman said whistleblowers are encouraged to come forward knowing that the security of confidential information was regularly reviewed. “We are committed to ensuring cricket is a safe environment for all, and we have no tolerance for any behaviour that compromises the safety or wellbeing of anyone involved in cricket,” the spokesman said. Do you know more about this story? Contact the reporter confidentially on tomcowie@protonmail.com . The Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here .","image_url":null,"source_id":"theage"},{"title":"‘He needs to back it up’: Leaked cricket drug complaint sparks security warning","link":"https://www.smh.com.au/sport/cricket/he-needs-to-back-it-up-leaked-cricket-drug-complaint-sparks-security-warning-20211221-p59j9p.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Cowie"],"video_url":null,"description":"A confidential phone call between a whistleblower and Cricket Australia’s ex-integrity chief has been leaked, exposing serious security flaws in the organisation’s anti-corruption unit.","content":null,"pubDate":"2021-12-25 18:30:00","full_description":"A confidential phone call between a whistleblower and Cricket Australia’s ex-integrity chief discussing a then-player’s alleged cocaine use and sexual activities has been leaked, exposing serious security flaws in the organisation’s anti-corruption unit. The recording, sent anonymously to The Sunday Age , is of a call by former Cricket Australia head of integrity Sean Carroll to a woman who describes herself as a high-class escort and provides information that a well-known cricketer should “back it up” or he will end up destroying his career. Former Cricket Australia head of integrity Sean Carroll. In the phone call, the woman makes allegations about the player dancing naked on a balcony, openly using cocaine and cavorting with numerous women. It is believed the phone call took place several years ago, and the allegations against the unnamed player could not be substantiated. But the existence of the recording years later and the ease at which such recordings can be accessed has led to sports corruption experts warning that there is a risk of players being blackmailed and whistleblowers being deterred from coming forward. It is unclear how or when the recording was obtained from Cricket Australia. It was sent to The Sunday Age through an encrypted email service from an anonymous address. The player was not identified and The Sunday Age has established that the recording is genuine. The source of the leak said they wanted to bring attention to what they described as the integrity unit’s “abuse of power” and the lack of security around the handling of information from whistleblowers. The person said they were a former Cricket Australia staffer who wanted to expose flaws in the integrity unit and asked for the matter to be made public. “There are no rules regarding storage of these recordings, who can listen to them, or how long they should be archived,” the source said. “There are no policies or procedures in place regarding access, integrity and confidentiality of this material. “I want to protect members of the public, players and staff from an abuse of power and ensure accountability – I think this behaviour has gone unchecked for far too long.” In the recording, the woman who contacted Cricket Australia tells Mr Carroll she is surprised at the player’s behaviour given his public profile. “He needs to back it up a bit, back it up, like deadset seriously back it up because I’m probably doing him a favour if anything,” she says. “I wouldn’t want to be publicly letting everyone seeing me party and snorting lines.” The woman tells Mr Carroll there is “probably” video or photos of the player engaging in the reported activities but declines to provide any vision to Cricket Australia. She says the last time she saw it happen was in the lead-up to Christmas but does not say which year. “They party a lot these boys,” the woman says. Cricket Australia was unaware of the leak until an inquiry by The Sunday Age . A spokesman said it had been reported to the Victoria Police Sporting Integrity Intelligence Unit, which was providing assistance. “Cricket Australia takes this matter extremely seriously, which is why we contacted Victoria Police,” the spokesman said. “We constantly review our systems, and our controls around sensitive information are continually being improved and aligned with best practice. “We take integrity matters extremely seriously and ensure appropriate action is taken.” A Victoria Police spokeswoman said police had met with Cricket Australia but was not investigating the matter. It is the second major leak in two months involving players investigated by Cricket Australia’s integrity unit. In November, former Test captain Tim Paine resigned when his explicit texts sent to a co-worker in 2017 became public on the eve of the Ashes. Mr Carroll, who investigated the Paine complaint when it was first reported to Cricket Australia, left the organisation in December last year to take up a role as Victorian Racing Integrity Commissioner. Cricket Australia’s investigation of the complaint found Paine had not breached its code of conduct. Sport corruption researcher Adam Masters, a senior lecturer in criminology at Australian National University, said the recording of sensitive information made players vulnerable to blackmail and possible match-fixing. “The big risk with that sort of information, if it went to organised crime, is you’re looking at problems in places like the sub-continent where organised crime has historically been involved with sport gambling,” Dr Masters said. “Players are much more aware of approaches by gambling interests and organised crime [than they used to be]. However, something like drug taking and prostitution really opens that blackmail element up in a very broad kind of way.” University of Canberra integrity expert Catherine Ordway. Credit: Melissa Adams Integrity expert Catherine Ordway from the University of Canberra said sporting organisations needed to develop strong whistleblower protections. Dr Ordway, along with Dr Masters and associate professor Kath Hall, co-authored a report on sport corruption that contributed to the creation of a new national body, Sport Integrity Australia, last year. “What we found over the last decade is that most major corruption scandals in the world have come through a whistleblowing process,” she said. “It’s really important that the whistleblowing processes are strong and protected and that people who are providing information through these frameworks have confidence and trust in the system.” A Cricket Australia spokesman said whistleblowers are encouraged to come forward knowing that the security of confidential information was regularly reviewed. “We are committed to ensuring cricket is a safe environment for all, and we have no tolerance for any behaviour that compromises the safety or wellbeing of anyone involved in cricket,” the spokesman said. Do you know more about this story? Contact the reporter confidentially on tomcowie@protonmail.com . The Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here .","image_url":null,"source_id":"smh"},{"title":"Conor McGregor’s amazing £2.7m luxury Lamborghini yacht is the ‘Supercar of the Sea’, and one of just 63 made in world","link":"https://www.thesun.co.uk/sport/12916841/conor-mcgregor-lamborghini-yacht-luxury-supercar/","keywords":["MMA","Sport","Lamborghini","Retime","UFC"],"creator":["Jake Lambourne"],"video_url":null,"description":"UFC legend Conor McGregor’s life of luxury knows no bounds – with his incredible toy box including a Lamborghini yacht worth £2.7million. The 33-year-old took to social media last year to show off his lavish purchase, which has been designed and built by the Italian Sea Group and Tecnomar for Lamborghini. Dubbed the ‘Supercar of […]","content":"UFC legend Conor McGregor’s life of luxury knows no bounds – with his incredible toy box including a Lamborghini yacht worth £2.7million. The 33-year-old took to social media last year to show off his lavish purchase, which has been designed and built by the Italian Sea Group and Tecnomar for Lamborghini. LamborghiniConor McGregor revealed he has bought himself a Lamborghini Tecnomar 63[/caption] LamborghiniOnly 63 of the yachts will be made, with each one costing £2.7million[/caption] Instagram @thenotoriousmmaMcGregor has spoken of his joy at his purchase of the ‘Supercar of the sea’[/caption] Dubbed the ‘Supercar of the Sea’, only 63 of the yachts will be made, with the Notorious purchasing number 12 in homage to his Proper No. Twelve whiskey brand. McGregor – who is already the proud owner of a £3m yacht – uploaded a number of photos on Instagram of the 24 ton, 63ft long Lamborghini Tecnomar 63. Dressed in a navy tweed suit and accompanied by his partner Dee Devlin and their two oldest children, the Irishman posed for pictures at the Italian Sea Group’s headquarters. Captioning his post, he said: “The No.12 “McGregor edition” @tecnomaryachts @lamborghini. “Lamborghini’s first entry into the Sport Yacht World comes in the form of this 63foot, 4000bhp, duel engine, twin turbo, rocket ship! “Titled the ‘Supercar of the Sea’, I am honoured to secure the Number 12 edition of just 63 to be made. LamborghiniThe Lamborghini Tecnomar 63 is capable of reaching a top speed of 69mph[/caption] LamborghiniMcGregor already boasts a £3million yacht he purchased following his defeat against Khabib Nurmagomedov[/caption] Instagram @thenotoriousmmaMcGregor showed off what the yacht will look like to his two oldest children[/caption] Instagram @thenotoriousmmaThe Notorious was last seen in the octagon on July 10[/caption] Most read in Sport SAVED! How surgery transformed 'ugly' scorpion kick keeper Higuita - he's SO different now LEGEND LOST Former Ashes-winning England cricket captain Ray Illingworth dies at 89 DRIVING OFF Hamilton WILL retire after Abu Dhabi controversy, says Bernie Ecclestone FAN'S BEST FRIEND Ex Premier League star ordered to pay £22,400 to man who found his dog INSTA-HAM Lewis Hamilton unfollows EVERYBODY on Instagram amid retirement speculation DRASTIC CHANGE Man Utd Treble winner looks unrecognisable with long hair and beard JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) “1963 being the year Lamborghini first began, and 12 being, well you know Twelve! “Proper f****** Twelve baby! Ain’t no stopping it! @properwhiskey. “Thank you Giuseppe Constantino and the entire team at ‘The Italian Sea Group’ for your amazing work! Excited to see the finished result during next season’s yachting season.” The Tecnomar 63 – which boasts over 4,000 horsepower – is capable of reaching a top speed of 69mph thanks to its 24.2-liter V-12 diesels. McGregor is not only growing his fleet of yachts, as he owns a car collection worth over £2.5m, as well as a watch collection worth over £1m. LamborghiniMcGregor will have to wait before he can set sail in the Lamborghini Tecnomar 63[/caption] Instagram @thenotoriousmmaMcGregor shared a number of snaps of the yacht on Instagram[/caption] LamborghiniThe Tecnomar 63 boasts over 4,000 horsepower thanks to its 24.2-liter V-12 diesels[/caption]","pubDate":"2021-12-25 17:05:00","full_description":"UFC legend Conor McGregor's life of luxury knows no bounds - with his incredible toy box including a Lamborghini yacht worth £2.7million. The 33-year-old took to social media last year to show off his lavish purchase, which has been designed and built by the Italian Sea Group and Tecnomar for Lamborghini. Dubbed the 'Supercar of the Sea', only 63 of the yachts will be made, with the Notorious purchasing number 12 in homage to his Proper No. Twelve whiskey brand. McGregor - who is already the proud owner of a £3m yacht - uploaded a number of photos on Instagram of the 24 ton, 63ft long Lamborghini Tecnomar 63. Dressed in a navy tweed suit and accompanied by his partner Dee Devlin and their two oldest children, the Irishman posed for pictures at the Italian Sea Group's headquarters. Captioning his post , he said: \"The No.12 “McGregor edition” @tecnomaryachts @lamborghini. \"Lamborghini’s first entry into the Sport Yacht World comes in the form of this 63foot, 4000bhp, duel engine, twin turbo, rocket ship! \"Titled the 'Supercar of the Sea', I am honoured to secure the Number 12 edition of just 63 to be made. JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) \"1963 being the year Lamborghini first began, and 12 being, well you know Twelve! \"Proper f****** Twelve baby! Ain’t no stopping it! @properwhiskey. \"Thank you Giuseppe Constantino and the entire team at 'The Italian Sea Group' for your amazing work! Excited to see the finished result during next season's yachting season.\" The Tecnomar 63 - which boasts over 4,000 horsepower - is capable of reaching a top speed of 69mph thanks to its 24.2-liter V-12 diesels. McGregor is not only growing his fleet of yachts, as he owns a car collection worth over £2.5m , as well as a watch collection worth over £1m .","image_url":null,"source_id":"thesun"},{"title":"SA vs IND, 1st Test: Cricket back in focus as Virat Kohli's India look to move on from off-field controversies","link":"https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-1st-test-preview-ajinkya-rahane-ishant-sharma-selection-supersport-park-centurion-1892223-2021-12-25?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Centurion Test: Cricket back in focus as Kohli's India look to put behind off-field issues","content":null,"pubDate":"2021-12-25 15:37:35","full_description":"All eyes will be on India's playing combination and Virat Kohli when they take the field against South Africa in the first Test against South Africa at the SuperSport Park in Centurion on Sunday. Decisions around the middle-order batting and how many seamers to pick will be the main conundrum for the selectors. Ajinkya Rahane's selection or omission will be another big talking point on Boxing Day when Virat Kohli walks out for the toss along with Dean Elgar. Rahane has been struggling for form with the bat for a couple of years now but has been given a long rope by the team management due to his experience and past record. Time however, is running for the former vice-captain with young Shreyas Iyer and Hanuma Vihari waiting in the wings. Rahane was stripped of vice-captaincy going into the series before which he sat out Inda's second Test against New Zealand due to what captain Virat Kohli said was an injury. Calls for his axing from the squad have grown louder over this year but the 34-year-old might just get one more Test to try and hold on to his place in the XI due to his past record and experience of the South African conditions. Rahane averages over 53 in South Africa, where he has amassed 266 runs from 3 Tests with 2 fifties on his last two tours. India head coach Rahul Dravid said on Saturday that he has had positive conversations with Rahane and he is in a good mental space ahead of the series-opener. Reuters Photo \"I have ad positive conversations with him, he has trained very well. It has been no different to conversations with others. He seems to be in good space,\" Dravid told reporters on the eve of the first Test of the series. SHARDUL OVER ISHANT? Another selection dilemma that India face is that of chasing all-rounder Shardul Thakur over the experienced Ishant Sharma, who has also been struggling for form with the ball in Test cricket this year. Shardul Thakur has been in excellent form with the ball this year in Tests, having taken 14 wickets from 3 games at an average of 22.07 and scored 232 runs with the bat at 37.20. The 30-year-old played crucial roles with ball and bat in India's Test wins at the Gabba (vs Australia) and The Oval (vs England) which is why the all-rounder might be preferred over the 105-Test old Ishant, who has struggled with the ball in 2021 with just 14 scalps from 8 games. SA TOUR THE FINAL FRONTIER? View this post on Instagram A post shared by Team India (@indiancricketteam) India will be gunning for their maiden Test series win in South Africa when the Virat Kohli-led side locks horns with the hosts in the opening game at the SuperSport Park on Boxing Day. India have never won a Test series in South Africa out of 7 attempts so far, but after recent successes in Australia and England are buoyed by their ability to compete on the road. The prospect of making history as the first Indian touring side to win a series in South Africa is a tantalising one for the visiting players, who will be looking to move on from the off-field controversies surrounding the Kohli and the BCCI to put their best foot forward in the rainbow nation. Expectations will be high to say the least from Virat Kohli's squad of champions, which has already conquered Australia, West Indies, Sri Lanka and England in red-ball cricket and South Africa remains one of the final frontiers. TEAM INDIA DREAM11 PREDICTION Courtesy of BCCI India predicted playing XI: 1. KL Rahul, 2. Mayank Agarwal, 3. Cheteshwar Pujara, 4. Virat Kohli (Captain), 5. Ajinkya Rahane, 6. Rishabh Pant (WK), 7. R Ashwin, 8. Shardul Thakur, 9.Jasprit Bumrah 10. Mohammed Shami 11. Mohammed Siraj. CENTURION TEST WEATHER FORECAST While chances of rain causing a stoppage of play is minimal on Day 1 of the Test on Sunday, it might not be the case in the subsequent days. Rain could cause trouble on the second day. Showers were forecasted for Monday morning, which could coincide with the timings for the first session of Day 2. According to the website of the South African Weather Service, which is the government's meteorological service, there could be rain after nightfall in Centurion on Sunday. It is set to be cloudy throughout the day, however, which alongwith the pacer-friendly conditions can turn out to be a difficult prospect for the batters to negotiate. Live TV Also Read | Never easy to leave out players: Rahul Dravid on India XI for Centurion Test Also Read | SA vs IND: Rahane seems in good space, had positive conversations with him - Dravid","image_url":null,"source_id":"indiatoday"},{"title":"Ray Illingworth: Former England cricket captain has died aged 89, Yorkshire have announced - Sky News","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vbmV3cy5za3kuY29tL3N0b3J5L3JheS1pbGxpbmd3b3J0aC1mb3JtZXItZW5nbGFuZC1jcmlja2V0LWNhcHRhaW4taGFzLWRpZWQtYWdlZC04OS15b3Jrc2hpcmUtaGF2ZS1hbm5vdW5jZWQtMTI1MDM3NDjSAYABaHR0cHM6Ly9uZXdzLnNreS5jb20vc3RvcnkvYW1wL3JheS1pbGxpbmd3b3J0aC1mb3JtZXItZW5nbGFuZC1jcmlja2V0LWNhcHRhaW4taGFzLWRpZWQtYWdlZC04OS15b3Jrc2hpcmUtaGF2ZS1hbm5vdW5jZWQtMTI1MDM3NDg?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ray Illingworth: Former England cricket captain has died aged 89, Yorkshire have announced  Sky NewsEngland cricket captain Ray Illingworth passes away on Christmas Day at age of 89  Daily StarRay Illingworth dies aged 89 as tributes to Leeds cricket legend flood in  Leeds LiveRay Illingworth dead: Former England cricket captain passes away age 89  The MirrorFormer England Ashes-winning captain Ray Illingworth dies, aged 89  The TelegraphView Full coverage on Google News","content":null,"pubDate":"2021-12-25 15:33:45","image_url":null,"source_id":"google"},{"title":"Former England cricket captain Ray Illingworth, 89, passes away","link":"https://zeenews.india.com/cricket/former-england-cricket-captain-ray-illingworth-89-passes-away-2422590.html","keywords":null,"creator":null,"video_url":null,"description":"Ray Illingworth, a former England cricket captain, has died. He was 89.","content":null,"pubDate":"2021-12-25 14:59:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Cricket-Former England captain Illingworth dies at 89","link":"https://www.thestar.com.my/sport/cricket/2021/12/25/cricket-former-england-captain-illingworth-dies-at-89","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former England captain Ray Illingworth, who famously captained the team to an Ashes series victory in Australia in 1970–71, has died at the age of 89, county club Yorkshire said on Saturday. Read full story","content":null,"pubDate":"2021-12-25 14:46:00","full_description":"(Reuters) - Former England captain Ray Illingworth, who famously captained the team to an Ashes series victory in Australia in 1970–71, has died at the age of 89, county club Yorkshire said on Saturday. Illingworth said in November he had been undergoing treatment for oesophageal cancer. \"Our thoughts are with Ray's family and the wider Yorkshire family who held Ray so dear to their hearts,\" Yorkshire tweeted https://twitter.com/YorkshireCCC/status/1474730255357292545. Illingworth captained England in 31 test matches between 1958 and 1973 and played in the first-ever one-day international in 1971. He also had spells as an administrator and the coach of the national team. (Reporting by Manasi Pathak in Bengaluru, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/25/1420275.jpg","source_id":"thestar_my"},{"title":"England cricket great Ray Illingworth dies","link":"https://thewest.com.au/sport/cricket/england-cricket-great-ray-illingworth-dies-c-5084717","keywords":null,"creator":["AAP"],"video_url":null,"description":"Ray Illingworth, who captained England to an Ashes series win in Australia in 1970-71, has died at the age of 89.","content":null,"pubDate":"2021-12-25 14:15:17","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5084717/141b90d7e8ee5e872f2d57de8d61206dcb822d71-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"England cricket great Ray Illingworth dies","link":"https://www.perthnow.com.au/sport/cricket/england-cricket-great-ray-illingworth-dies-c-5084720","keywords":null,"creator":["AAP"],"video_url":null,"description":"Ray Illingworth, who captained England to an Ashes series win in Australia in 1970-71, has died at the age of 89.","content":null,"pubDate":"2021-12-25 14:15:17","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5084720/141b90d7e8ee5e872f2d57de8d61206dcb822d71-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Ray Illingworth dead: Former England and Yorkshire cricket captain dies aged 89","link":"https://www.express.co.uk/sport/cricket/1541152/Ray-Illingworth-dead-England-Yorkshire-cricket-captain-dies-aged-89-sport","keywords":null,"creator":null,"video_url":null,"description":"FORMER England cricket captain Ray Illingworth has died aged 89, it has been confirmed.","content":null,"pubDate":"2021-12-25 14:08:00","full_description":null,"image_url":null,"source_id":"express"},{"title":"U19 Asia Cup: India Lose To Arch-Rivals Pakistan In Last-Ball Thriller - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvdTE5LWFzaWEtY3VwLWluZGlhLWxvc2UtdG8tYXJjaC1yaXZhbHMtcGFraXN0YW4taW4tbGFzdC1iYWxsLXRocmlsbGVyLTI2NzEyNzTSAXNodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L3UxOS1hc2lhLWN1cC1pbmRpYS1sb3NlLXRvLWFyY2gtcml2YWxzLXBha2lzdGFuLWluLWxhc3QtYmFsbC10aHJpbGxlci0yNjcxMjc0L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"U19 Asia Cup: India Lose To Arch-Rivals Pakistan In Last-Ball Thriller  NDTVSports.comIND U19 vs PAK U19 Live Streaming Details- When And Where To Watch India U19 vs PAK U19 In Your Country? U19 Asia Cup 2021  Cricket AddictorACC U19 Asia Cup 2021: Pakistan beat India by 2 wickets in nail-biter  India TV NewsSenior Pakistan Players Hail 'Boys' After Win Over Rivals India in U-19 Asia Cup  News18Sports Buzz || U-19 Cricket: India beat UAE by 154 runs & other top sports news  DD INDIAView Full coverage on Google News","content":null,"pubDate":"2021-12-25 13:57:55","image_url":null,"source_id":"google"},{"title":"U19 Asia Cup: India Lose To Arch-Rivals Pakistan In Last-Ball Thriller - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvdTE5LWFzaWEtY3VwLWluZGlhLWxvc2UtdG8tYXJjaC1yaXZhbHMtcGFraXN0YW4taW4tbGFzdC1iYWxsLXRocmlsbGVyLTI2NzEyNzTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"U19 Asia Cup: India Lose To Arch-Rivals Pakistan In Last-Ball Thriller  NDTV SportsIND U19 vs PAK U19 Live Streaming Details- When And Where To Watch India U19 vs PAK U19 In Your Country? U19 Asia Cup 2021  Cricket AddictorSenior Pakistan Players Hail 'Boys' After Win Over Rivals India in U-19 Asia Cup  News18Pakistan beat India by two wickets in nail-biter U-19 Asia Cup clash  Zee NewsU-19 Asia Cup: Pakistan beat India by 2 wickets in thriller  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-25 13:57:55","image_url":null,"source_id":"google"},{"title":"ACC U19 Asia Cup 2021: Pakistan beat India by 2 wickets in nail-biter - India TV News","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmluZGlhdHZuZXdzLmNvbS9zcG9ydHMvY3JpY2tldC9hY2MtdTE5LWFzaWEtY3VwLTIwMjEtcGFraXN0YW4tYmVhdC1pbmRpYS1ieS0yLXdpY2tldHMtaW4tbmFpbC1iaXRlci03NTExODXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ACC U19 Asia Cup 2021: Pakistan beat India by 2 wickets in nail-biter  India TV NewsIND U19 vs PAK U19 Live Streaming Details- When And Where To Watch India U19 vs PAK U19 In Your Country? U19 Asia Cup 2021  Cricket AddictorSenior Pakistan Players Hail 'Boys' After Win Over Rivals India in U-19 Asia Cup  News18Pakistan beat India by two wickets in nail-biter U-19 Asia Cup clash  Zee NewsSports Buzz || U-19 Cricket: India beat UAE by 154 runs & other top sports news  DD INDIAView Full coverage on Google News","content":null,"pubDate":"2021-12-25 13:56:17","image_url":null,"source_id":"google"},{"title":"Ray Illingworth, former England cricket captain and coach, dies aged 89","link":"https://www.theguardian.com/sport/2021/dec/25/ray-illingworth-former-england-cricket-captain-and-coach-dies-aged-89","keywords":["Cricket","Sport"],"creator":["PA Media"],"video_url":null,"description":"Illingworth played 61 Tests for England between 1958 and 1973He served a chair of selectors and England coach in the 1990sThe former England captain Ray Illingworth has died at the age of 89, Yorkshire have announced.Illingworth, who led England to an away Test series victory over Australia in 1970-71, had been undergoing radiotherapy for esophageal cancer. Continue reading...","content":null,"pubDate":"2021-12-25 13:52:23","full_description":"The former England captain Ray Illingworth has died at the age of 89, Yorkshire have announced. Illingworth, who led England to an away Test series victory over Australia in 1970-71, had been undergoing radiotherapy for esophageal cancer. Illingworth played 61 Tests for England between 1958 and 1973, scoring 1,836 Test runs at an average of 23.24 and claimed 122 wickets at 31.20. He captained England 31 times, winning 12 of those matches, and played in the first-ever one-day international in 1971. Illingworth went on to become the chairman of selectors for England between 1994 and 1996, and coached the team in 1995-96. Yorkshire paid tribute to Illingworth and posted on Twitter: “We are deeply saddened to learn that Ray Illingworth has passed away. Our thoughts are with Ray’s family and the wider Yorkshire family who held Ray so dear to their hearts.” Illingworth the player was shy of true elite status, but as a solid lower middle-order batsman, infuriatingly miserly off-spinner and specialist gully fielder, he was never far from the action. But his wider impact on cricket in England was marked. At his best he will be remembered as one of the nation’s finest captains – a single-minded leader with an appetite for authority and broad enough shoulders to bear it. At his worst, in his second act as selector, coach and over-arching ‘supremo’ of the national side, the same qualities engulfed him and those who served at his pleasure. By a lesser number, primarily those involved at his beloved Farsley Cricket Club, he will be cherished as the life-long club man who prepared wickets well into his 70s and could not resist arriving to paint the crease even after a heart attack slowed him in 2011. In his home life he was a doting husband to his childhood sweetheart Shirley, father to Diane and Vicky and later both grandfather and great-grandfather. After starting his professional career in a Yorkshire dressing room dominated by big characters, Illingworth grew in stature as a fixture of the dominant White Rose side which swept seven county championships in nine years between 1959 and 1968. England also came calling but it was not until his move to Leicestershire in 1969 that he truly found his calling. Installed immediately as captain at Grace Road, he was then summoned to lead his country when injury struck Colin Cowdrey. Initially a stand-in, he held the position for over four years, winning 12 and losing five of his 31 Tests. Illingworth leveraged power on and off the pitch, demanding more concessions than ever before from the board and more input in selection than the job typically entailed. For those who made his cut, he called for outright obedience and a clear commitment to his game plan. If that caused a couple of bumps in the road, notably with Geoffrey Boycott and John Snow, it was frequently a productive arrangement for all concerned. The era peaked with an away Ashes success against Bill Lawry’s Australia in 1970-71, Illingworth’s overriding legacy even after his remarkable return to Yorkshire colours at the age of 50. Originally appointed team manager, he eased himself back into the playing roster and ended up with a John Player League winners’ medal. That would have proved a fitting finale had he not been tempted back into the spotlight as England’s chairman of selectors. He joined what was essentially a sinking ship and hopes were high that his astute reading of the game and simplicity of approach would put things right. Instead his tenure was a debacle. Most obviously, he clashed on every conceivable level with the captain Michael Atherton, declining to award the young Lancastrian the same powers he had claimed when holding the role. The pair were generationally and temperamentally incompatible and Illingworth’s eye for a player appeared more than once to be offering only blurred vision. In his three years in post he accrued enough responsibilities to warrant the ‘supremo’ moniker, but as results and relationships teetered off a cliff – most notably an ill-tempered and ill-advised public rebuke of the bowler Devon Malcolm in South Africa – there was nobody with whom he could share the blame.","image_url":"https://i.guim.co.uk/img/media/05109559526156fb0388349e9e4004c8bc885f91/1_3_1009_606/master/1009.jpg?width=460&quality=85&auto=format&fit=max&s=29fe36925299639e3817ca115b66ffa2","source_id":"theguardian"}]}