{"newsArray":[{"title":"Cricket: भारतीय टीम की जर्सी पर पाकिस्तान का नाम! पहली बार एशिया कप में दिखेगा ऐसा नजारा","link":"https://hindi.latestly.com/socially/sports/cricket/cricket-pakistan-name-on-the-jersey-of-the-indian-team-in-asia-cup-2023-know-the-reason-1891872.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट के इतिहास में पहली बार ऐसा होगा, जब टीम इंडिया की जर्सी पर पाकिस्तान का नाम लिखा होगा. भारतीय टीम जब एशिया कप 2023 में उतरेगी तो टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा.","content":"भारतीय क्रिकेट के इतिहास में पहली बार ऐसा होगा, जब टीम इंडिया की जर्सी पर पाकिस्तान का नाम लिखा होगा. भारतीय टीम जब एशिया कप 2023 में उतरेगी तो टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा. दरअसल, पाकिस्तान क्रिकेट बोर्ड यानी पीसीबी के पास एशिया कप 2023 के होस्टिंग राइट्स हैं. हालांकि, टूर्नामेंट हाइब्रिड मॉडल के तहत खेला जाएगा, जिसमें सिर्फ चार ही मैच पाकिस्तान में होंगे और बाकी के मैच 9 मैच श्रीलंका में होंगे. इसकी शुरुआत 30 अगस्त होगी और जब भारतीय टीम 2 सितंबर को पाकिस्तान से भिड़ेगी तो इस मैच में भारतीय टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा. एशिया कप में भारतीय टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा ◆ ऐसा इसलिए होगा क्योंकि पाकिस्तान के पास मल्टी नेशन टूर्नामेंट की मेजबानी का अधिकारी होगा #AsiaCup | Asia Cup | Indian Team Jersey pic.twitter.com/b0v1kIXKsV — News24 (@news24tvchannel) August 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-10 04:28:29","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"2023 ODI World Cup games rescheduled, India-Pak on Oct 14; ticket sales from Aug 25","link":"http://www.newindianexpress.com/sport/cricket/2023/aug/10/2023-odi-world-cup-games-rescheduled-india-pak-on-oct-14-ticket-sales-from-aug-25-2603771.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. CHENNAI: As many as nine games, including two India games and three Pakistan matches, are rescheduled as the International Cricket Council announced the revised schedule for the 2023 ICC Men’s ODI World Cup that is set to be played in India from October 5 to November 19. The most anticipated fixture between arch-rivals India and Pakistan is advanced by a day from October 15 to 14 as the Ahmedabad police had raised security concerns on the game initially coinciding with the first day of the Navaratri festival. Similarly, the clash between Pakistan and England that was set to be played in Kolkata on November 12, too, was advanced by a day after the Cricket Association of Bengal raised the concerns communicated by the Kolkata police department as the match was on the same day as that of Kali Puja, another major Hindu festival. To accommodate the two changes, a few other games had to be tinkered with, taking the number of rescheduled games to nine (approximately 18 per cent of the matches in the tournament). With the India-Pakistan game moved to October 14, the England-Afghanistan game in Delhi is moved to October 15 and the clash between New Zealand and Bangladesh is moved from October 14 to 13 and will be played as a day-night game. Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. As the Pakistan game against England in Kolkata had to be rescheduled, two more changes had to be made. The first being the clash between Australia and Bangladesh rescheduled to November 1 (day game) and then India’s clash against the Netherlands on November 11 is moved to 24 hours later. In what comes as a bigger relief to the fans who were anxiously waiting for the schedule to be finalised so that they can plan their travel, the ICC has said that the tickets will be sold in multiple phases from August 25 — 42 days before the opening game. The sale of tickets for all non-India games, including warm-ups, will be opened on August 25. Tickets for India’s warm-up fixtures will be sold on August 30. Ticket sales for India games at Chennai, Delhi and Pune will open on August 31 followed by their matches in Dharamsala, Lucknow and Mumbai on September 1. Tickets for India matches in Bengaluru and Kolkata will be sold on September 2 and for the game against Pakistan in Ahmedabad on September 3. The tickets for the knockouts will be available on September 15. Fans can register their interest via https://www.cricketworldcup.com/register from August 15. India matches ticket sale details: Aug 30: warm-ups in Guwahati & Thiruvananthapuram Aug 31: vs Australia, Afghanistan, Bangladesh Sep 1: vs England, New Zealand, Sri Lanka Sep 2: vs Netherlands, South Africa Sep 3: vs Pakistan","content":"CHENNAI: As many as nine games, including two India games and three Pakistan matches, are rescheduled as the International Cricket Council announced the revised schedule for the 2023 ICC Men’s ODI World Cup that is set to be played in India from October 5 to November 19. The most anticipated fixture between arch-rivals India and Pakistan is advanced by a day from October 15 to 14 as the Ahmedabad police had raised security concerns on the game initially coinciding with the first day of the Navaratri festival. Similarly, the clash between Pakistan and England that was set to be played in Kolkata on November 12, too, was advanced by a day after the Cricket Association of Bengal raised the concerns communicated by the Kolkata police department as the match was on the same day as that of Kali Puja, another major Hindu festival. To accommodate the two changes, a few other games had to be tinkered with, taking the number of rescheduled games to nine (approximately 18 per cent of the matches in the tournament). With the India-Pakistan game moved to October 14, the England-Afghanistan game in Delhi is moved to October 15 and the clash between New Zealand and Bangladesh is moved from October 14 to 13 and will be played as a day-night game. Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. As the Pakistan game against England in Kolkata had to be rescheduled, two more changes had to be made. The first being the clash between Australia and Bangladesh rescheduled to November 1 (day game) and then India’s clash against the Netherlands on November 11 is moved to 24 hours later. In what comes as a bigger relief to the fans who were anxiously waiting for the schedule to be finalised so that they can plan their travel, the ICC has said that the tickets will be sold in multiple phases from August 25 — 42 days before the opening game. The sale of tickets for all non-India games, including warm-ups, will be opened on August 25. Tickets for India’s warm-up fixtures will be sold on August 30. Ticket sales for India games at Chennai, Delhi and Pune will open on August 31 followed by their matches in Dharamsala, Lucknow and Mumbai on September 1. Tickets for India matches in Bengaluru and Kolkata will be sold on September 2 and for the game against Pakistan in Ahmedabad on September 3. The tickets for the knockouts will be available on September 15. Fans can register their interest via https://www.cricketworldcup.com/register from August 15.","pubDate":"2023-08-10 03:53:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Ellyse Perry extends stay with Sydney Sixers, signs two-year deal","link":"https://thenewsmill.com/2023/08/ellyse-perry-extends-stay-with-sydney-sixers-signs-two-year-deal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Australian all-rounder Ellyse Perry has extended her stay with Sydney Sixers, signing another two-year deal with the Women’s Big Bash League (WBBL) club. “Long-term captain and fan favourite, Ellyse Perry, will continue her WBBL career after the star all-rounder re-signed for two more years with the Sydney Sixers,” said the club in a statement. Perry will lead the Sixers onto the familiar grounds of North Sydney Oval again this summer, starting with the first match of WBBL season 09, on October 19, against the Melbourne Stars. ‘ The now 32-year-old was the Sixers’ first-ever signing way back in 2015 and has remained a loyal and crucial player to the club’s success over the years, leading the side to two title wins and amassing the most runs in club history. Perry broke records during the WBBL 04 season, being named the ‘Player of the Tournament’ and was the first ever Big Bash player to reach 2000 runs. Her sensational performances were deservingly rewarded in 2016, 2018 and 2020, where she won the Belinda Clark Award as Australia’s women’s player of the year. Perry said she was excited for the summer ahead, highlighting the Sixers’ blockbuster Sydney Smash against the Sydney Thunder at the SCG on November 26. “It is a lovely feeling to be able to continue at the Sixers for another two WBBL seasons,” Perry said. “The club has been a special part of my career for almost a decade and I am proud of what we have achieved, both on and off the field, especially in terms of connecting with and inspiring lots of girls and boys to be involved in the game.” “I am really looking forward to the challenge this season presents, and seeing as many fans as we can at North Sydney Oval and the SCG.” “To be able to play at the SCG on November 26 in a stand-alone WBBL match for the first time is a significant step forward and a reflection of the ever-growing appetite for large numbers of fans to be able to watch women’s sport at our world-class sporting venues.” “I think both the Sixers and Thunder can be truly ambitious about attracting a great crowd for the Sydney Smash,” concluded Perry. Perry has represented Australia in 142 T20Is, scoring 1,627 runs in 87 innings at an average of 31.28, with eight half-centuries and best score of 75. Cricket NSW’s General Manager of Big Bash Leagues, Chris Botherway, said it was hard to imagine Perry playing for any other WBBL club. “Ellyse is very much a part of the fabric of the Sydney Sixers and it’s great to have her back on board for the next two seasons,” Botherway said. “She is a leader for the club, both on and off the field, and someone who obviously has an amazing connection with our members and fans.” “We are looking forward to seeing her lead the club to more success in WBBL 09,” he concluded. Sydney Sixers WBBL|09 squad: Maitlan Brown, Erin Burns, Lauren Cheatle, Ash Gardner, Emma Hughes, Ellyse Perry (c). (ANI)","pubDate":"2023-08-10 03:34:41","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Maheesh Theekshana Shows Wonderful Reflexes To Take Catch off His Bowling During Colombo Strikers vs Jaffna Kings LPL 2023 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/maheesh-theekshana-shows-wonderful-reflexes-to-take-catch-off-his-bowling-during-colombo-strikers-vs-jaffna-kings-lpl-2023-match-watch-video-5329742.html","keywords":null,"creator":null,"video_url":null,"description":"The Sri Lankan off-spinner dived full-length to grab the catch after it was hit straight back to him by Colombo Strikers' Lahiru Udara. Jaffna Kings eventually won the match by six wickets.","content":"Maheesh Theekshana showed wonderful reflexes to take a stunning catch off his own bowling during the Lanka Premier League 2023 match between Colombo Strikers and Jaffna Kings on August 8. The off-spinner jumped to his right and grabbed the ball with both hands after batter Lahiru Udara hit it straight back to him, having earlier made room for himself to play a shot on the off-side. The Sri Lankan spinner came up with a full-length dive to complete the catch. 'I Just Absolutely Love Him, Want To Marry Him’ Ramiz Raja's Remark While Praising Babar Azam During LPL 2023 Goes Viral!. Watch Maheesh Theekshana's Catch Here Theekshana showing us what quick reflexes look like ⚡ #LPL2023 #LPLOnFanCode pic.twitter.com/DcmrnJawcf — FanCode (@FanCode) August 9, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-10 03:29:58","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Baba Aparajith Engages in Argument With Umpires, Opposition Player After Being Controversially Dismissed During TNCA Division 1 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/baba-aparajith-engages-in-argument-with-umpires-opposition-player-after-being-controversially-dismissed-during-tnca-division-1-match-watch-video-5329694.html","keywords":null,"creator":null,"video_url":null,"description":"The right-handed batsman was shocked with the umpire's decision to give him out and was involved in a long chat with them before eventually leaving the field. Baba Aparajith's team won the match in the end though by four wickets.","content":"Baba Aparajith got engaged in an argument with the umpires and an opposition player after he was controversially dismissed during a Tamil Nadu Cricket Association (TNCA) Division 1 match. The right-hander, representing Young Stars Cricket Club, was batting against Jolly Rovers CC when he was struck by a delivery on his pads with GS Raju, fielding a forward short-leg, taking the catch. The umpire immediately raised the finger and Aparajith was not happy with the decision. He argued with the umpires and later, also had to be separated after he got into a heated exchange with an opposition player. It took five minutes for him to leave the field after he was adjudged out. Ravi Ashwin Plays Club Cricket, Fans React As India International Cricketer Features in TNCA Division 1 Match . Watch Video: 'The Umpire's decision is final’ Baba Aparajith: Hold my bat! pic.twitter.com/A4Cd6sOV8g — FanCode (@FanCode) August 9, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-10 03:14:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Asia Cup 2023: પાકિસ્તાન સામે ટીમ ઇન્ડિયાનો જોવા મળ્યો છે દબદબો, જાણો એશિયા કપમાં કેવો છે રેકોર્ડ?","link":"https://gujarati.abplive.com/sports/cricket/india-vs-pakistan-record-india-vs-pakistan-cricket-records-head-to-head-853054","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"India vs Pakistan Record: એશિયા કપ 2023 30 ઓગસ્ટથી શરૂ થશે. તેની પ્રથમ મેચ પાકિસ્તાન અને નેપાળ વચ્ચે રમાશે. આ વખતે ટુર્નામેન્ટનું આયોજન હાઇબ્રિડ મોડલ હેઠળ કરવામાં આવશે. તેની કેટલીક મેચો પાકિસ્તાનમાં અને બાકીની શ્રીલંકામાં યોજાશે. આ ટૂર્નામેન્ટમાં ભારતે અત્યાર સુધી પાકિસ્તાન પર જીત મેળવી છે. આ બંન્ને ટીમો 2 સપ્ટેમ્બરે સામ સામે ટકરાશે. આ વખતે એશિયા કપ વન-ડે ફોર્મેટમાં રમાશે અને તેમાં કુલ 13 મેચ રમાશે. જો આપણે ટૂર્નામેન્ટના વન-ડે ફોર્મેટની મેચો પર નજર કરીએ તો ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધી 13 મેચ રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 7 મેચ જીતી છે. જ્યારે તેમને 5 મેચમાં હારનો સામનો કરવો પડ્યો છે. જો આપણે ભારત અને પાકિસ્તાન વચ્ચે રમાયેલી ઓવર ઓલ વન-ડે મેચની વાત કરીએ તો તેમાં પાકિસ્તાનનો દબદબો જોવા મળી રહ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધીમાં 132 વનડે રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 55 મેચ જીતી છે, જ્યારે 73 મેચમાં હારનો સામનો કરવો પડ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે છેલ્લી વન-ડે  મેચ જૂન 2019માં રમાઈ હતી. જેમાં ટીમ ઈન્ડિયાનો 89 રને વિજય થયો હતો. વર્લ્ડ કપ 2019ની આ મેચમાં પ્રથમ બેટિંગ કરતા ભારતે 5 વિકેટ ગુમાવીને 336 રન બનાવ્યા હતા. જવાબમાં પાકિસ્તાની ટીમ 6 વિકેટ ગુમાવીને 212 રન જ બનાવી શકી હતી. તેને ડકવર્થ-લુઈસ નિયમથી હારનો સામનો કરવો પડ્યો હતો. ભારતે છેલ્લી ત્રણ વનડેમાં સતત પાકિસ્તાનને હરાવ્યું છે. ટીમ ઈન્ડિયાએ સપ્ટેમ્બર 2018માં રમાયેલી મેચમાં 8 વિકેટે જીત મેળવી હતી. આ પછી આ જ મહિનામાં પાકિસ્તાનને 9 વિકેટે હરાવ્યું હતું. આ બંન્ને મેચ દુબઈમાં રમાઈ હતી. આગામી વનડે વર્લ્ડકપ 2023ને લઇને મોટુ અપડેટ સામે આવ્યુ છે. વનડે વર્લ્ડકપ 2023 આ વર્ષે 5 ઓક્ટોબરથી શરૂ થવાનો છે, અને આનું આયોજન આ વખતે ભારત કરશે. આ ટૂર્નામેન્ટની ફાઈનલ મેચ 19 નવેમ્બરે રમાશે. ઇન્ટરનેશનલ ક્રિકેટ કાઉન્સિલ (ICC) એ હવે આનું નવું શિડ્યૂલ જાહેર કર્યું છે. આ અંતર્ગત ભારત-પાકિસ્તાન મેચ સહિત 9 મેચોમાં ફેરફાર કરવામાં આવ્યા છે. ભારત અને પાકિસ્તાન વચ્ચેની મેચ હવે 15મીને બદલે એક દિવસ પહેલા એટલે કે 14મી ઓક્ટોબરે અમદાવાદના નરેન્દ્ર મોદી ક્રિકેટ સ્ટેડિયમમાં રમાશે. આ સહિત 9 મેચોના શિડ્યૂલમાં ફેરફાર કરવામાં આવ્યા છે.","content":"India vs Pakistan Record: એશિયા કપ 2023 30 ઓગસ્ટથી શરૂ થશે. તેની પ્રથમ મેચ પાકિસ્તાન અને નેપાળ વચ્ચે રમાશે. આ વખતે ટુર્નામેન્ટનું આયોજન હાઇબ્રિડ મોડલ હેઠળ કરવામાં આવશે. તેની કેટલીક મેચો પાકિસ્તાનમાં અને બાકીની શ્રીલંકામાં યોજાશે. આ ટૂર્નામેન્ટમાં ભારતે અત્યાર સુધી પાકિસ્તાન પર જીત મેળવી છે. આ બંન્ને ટીમો 2 સપ્ટેમ્બરે સામ સામે ટકરાશે. આ વખતે એશિયા કપ વન-ડે ફોર્મેટમાં રમાશે અને તેમાં કુલ 13 મેચ રમાશે. જો આપણે ટૂર્નામેન્ટના વન-ડે ફોર્મેટની મેચો પર નજર કરીએ તો ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધી 13 મેચ રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 7 મેચ જીતી છે. જ્યારે તેમને 5 મેચમાં હારનો સામનો કરવો પડ્યો છે. જો આપણે ભારત અને પાકિસ્તાન વચ્ચે રમાયેલી ઓવર ઓલ વન-ડે મેચની વાત કરીએ તો તેમાં પાકિસ્તાનનો દબદબો જોવા મળી રહ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધીમાં 132 વનડે રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 55 મેચ જીતી છે, જ્યારે 73 મેચમાં હારનો સામનો કરવો પડ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે છેલ્લી વન-ડે મેચ જૂન 2019માં રમાઈ હતી. જેમાં ટીમ ઈન્ડિયાનો 89 રને વિજય થયો હતો. વર્લ્ડ કપ 2019ની આ મેચમાં પ્રથમ બેટિંગ કરતા ભારતે 5 વિકેટ ગુમાવીને 336 રન બનાવ્યા હતા. જવાબમાં પાકિસ્તાની ટીમ 6 વિકેટ ગુમાવીને 212 રન જ બનાવી શકી હતી. તેને ડકવર્થ-લુઈસ નિયમથી હારનો સામનો કરવો પડ્યો હતો. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ભારતે છેલ્લી ત્રણ વનડેમાં સતત પાકિસ્તાનને હરાવ્યું છે. ટીમ ઈન્ડિયાએ સપ્ટેમ્બર 2018માં રમાયેલી મેચમાં 8 વિકેટે જીત મેળવી હતી. આ પછી આ જ મહિનામાં પાકિસ્તાનને 9 વિકેટે હરાવ્યું હતું. આ બંન્ને મેચ દુબઈમાં રમાઈ હતી. આગામી વનડે વર્લ્ડકપ 2023ને લઇને મોટુ અપડેટ સામે આવ્યુ છે. વનડે વર્લ્ડકપ 2023 આ વર્ષે 5 ઓક્ટોબરથી શરૂ થવાનો છે, અને આનું આયોજન આ વખતે ભારત કરશે. આ ટૂર્નામેન્ટની ફાઈનલ મેચ 19 નવેમ્બરે રમાશે. ઇન્ટરનેશનલ ક્રિકેટ કાઉન્સિલ (ICC) એ હવે આનું નવું શિડ્યૂલ જાહેર કર્યું છે. આ અંતર્ગત ભારત-પાકિસ્તાન મેચ સહિત 9 મેચોમાં ફેરફાર કરવામાં આવ્યા છે. ભારત અને પાકિસ્તાન વચ્ચેની મેચ હવે 15મીને બદલે એક દિવસ પહેલા એટલે કે 14મી ઓક્ટોબરે અમદાવાદના નરેન્દ્ર મોદી ક્રિકેટ સ્ટેડિયમમાં રમાશે. આ સહિત 9 મેચોના શિડ્યૂલમાં ફેરફાર કરવામાં આવ્યા છે.","pubDate":"2023-08-10 03:07:57","image_url":"https://static.abplive.com/wp-content/uploads/sites/7/2018/11/20162120/INDVSPAK3-620x400.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Gujarati"},{"title":"Asian Champions Trophy Hockey 2023: BCCI Secretary Jay Shah Extends Wishes to Indian Team for Registering Dominant Victory Over Pakistan","link":"https://www.latestly.com/agency-news/sports-news-bcci-secretary-jay-shah-extends-wishes-to-indian-hockey-team-for-thumping-victory-against-pakistan-5329419.html","keywords":null,"creator":null,"video_url":null,"description":"India pulled off a remarkable 4-0 victory to end Pakistan's hope of making their place in the semi-finals of the tournament.","content":"The Board of Control for Cricket in India (BCCI) secretary Jay Shah congratulated the Indian hockey team for their remarkable victory against Pakistan in the Asian Champions Trophy (ACT) on Wednesday. India pulled off a remarkable 4-0 victory to end Pakistan's hope of making their place in the semi-finals of the tournament. Shah took to X, formerly known as Twitter to extend wishes to the team and wrote, \"Congratulations @TheHockeyIndia on a fabulous win against Pakistan in the Asian Champions Trophy, and qualifying for the semi-finals! The dedication and skill were truly inspiring. Best wishes to the team for the semi-final clash on 11th August. Let's bring home that victory!\" 'Total Dominance' Twitterati React After India Secures Clinical Victory Over Arch-Rivals Pakistan in Asian Champions Trophy Hockey 2023 Clash Coming to the match, Harmanpreet netted a brace while Jugraj Singh and Akashdeep Singh struck one goal each to help India defeat Pakistan 4-0 at the Mayor Radhakrishnan Hockey Stadium in Chennai. The win ensured India finished at the top of the Asian Champions Trophy 2023 points table with 13 points from five matches. Pakistan, ranked 16th in the world, tried to get off to a good start and nearly did so three minutes in. They needed to avoid a loss by two goals or more to advance to the semifinals. After displaying some deft stickwork on the wings, Aqeel Ahmad fired a beautiful pass to an approaching Abdul Hannan. Krishan Bahadur Pathak of the Indian hockey team made a spectacular save, but Hannan was able to bundle in the rebound. The visitors' joy was cut short, however, after a review revealed that the ball had come off the Pakistani player's body. The goal was called off, but Pakistan was granted a penalty corner in its place. Pakistan's hockey team came close to scoring again, but Pathak stopped them. India made use of their opportunities to attack quickly while Pakistan attempted to press hard, and one such break netted the hosts their second penalty corner. Harmanpreet took the opportunity to score the second goal with a powerful drag flick past Hussain's legs. Fans Sing 'Vande Mataram' During India vs Pakistan Asian Champions Trophy 2023 Hockey Match in Chennai (Watch Video) When the Indian hockey team had a comfortable two-goal lead, they were able to play more freely and earn back-to-back penalty corners right before the halftime whistle. Harmanpreet was only narrowly able to be kept out by the Pakistani rushers in order to prevent additional harm. After the restart, Pakistan, the three-time winner of the Asian Champions Trophy, attempted to put on pressure to secure a berth in the semi-finals, but this also left openings for India to take advantage of. This time, Jugraj Singh converted a penalty corner to score the third goal for the home team, giving him his first goal against Pakistan. India took advantage of Pakistan's desperate and gung-ho efforts to keep their dreams of making the semifinals alive after falling behind 3-0. India often exploited Pakistan's inexperienced defence on the counter. India attempted multiple circle penetrations, but they were unable to take the lead in the third period. Akashde Singh finally made the score 4-0 in the fourth quarter after numerous missed opportunities, receiving the tiniest of touches to Mandeep's cross to seal a convincing victory. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","pubDate":"2023-08-10 02:59:34","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"India’s Shaw slams sixth-highest one-day score of 244","link":"https://www.dailymirror.lk/cricket-news/India’s-Shaw-slams-sixth-highest-one-day-score-of-244/320-264958","keywords":null,"creator":null,"video_url":null,"description":"India’s Prithvi Shaw struck the sixth-highest individual one-day score on Wednesday when he blasted an extraordinary 244 for Northamptonshire in their English county One-Day Cup match at home to Somerset.","content":"India's Prithvi Shaw struck the sixth-highest individual one-day score on Wednesday when he blasted an extraordinary 244 for Northamptonshire in their English county One-Day Cup match at home to Somerset. The 23-year-old, opening the batting, faced just 153 balls, including 28 fours and 11 sixes as Northamptonshire piled up 415-8 en route to an 87-run win at Wantage Road. Shaw's innings was the sixth-highest individual score in any limited overs match, with only Ali Brown's 268 for Surrey against Glamorgan in 2002 a higher solo total in an English county match of this kind. Long tipped for batting stardom after making a mammoth 546 in a single innings as a 14-year-old during a school match, the right-hander's first hundred runs Wednesday came off 81 balls with Shaw facing a mere 48 balls for his second hundred. Shaw, who made a century on Test debut for India as an 18-year-old, comfortably surpassed Northamptonshire's previous highest limited-overs individual record score of 172 not out by former England batsman Wayne Larkins, made in a 40-over match back in 1983. \"We were not prepared for this,\" said a post on Northamptonshire's Twitter feed. \"Prithvi Shaw has another List A double century! There are no words for how good this innings has been.\" Shaw was eventually dismissed three balls from the end of the innings, caught at deep mid-wicket off seamer Danny Lamb. This was the second time Shaw had made a double century in a domestic one-day match, following his unbeaten 227 for Mumbai against Puducherry in 2021. Shaw has so far represented India in 12 matches across all three international formats -- Tests, one-day internationals and Twenty20 matches -- with the last of those appearances coming two years ago. (AFP) Highest individual scores in one-day games: 277 - Narayan Jagadeesan, Tamil Nadu v Arunachal, 2022 268 - Alistair Brown, Surrey v Glamorgan, 2002 264 - Rohit Sharma, India v Sri Lanka, 2014 257 - D'Arcy Short, Western Australia v Queensland, 2018 248 - Shikhar Dhawan, India A v South Africa A, 2013 244 - Prithvi Shaw, Northamptonshire v Somerset, 2023","pubDate":"2023-08-10 01:38:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_0674a72bfa.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India, Pakistan World Cup match now on Oct 14","link":"https://www.thehansindia.com/sports/cricket/india-pakistan-world-cup-match-now-on-oct-14-814631","keywords":["Sports,Top Stories,Cricket"],"creator":["The Hans India"],"video_url":null,"description":null,"content":"New Delhi: The mega clash between India and Pakistan in Ahmedabad has been advanced by a day to October 14 and India’s final league match against Netherlands in Bengaluru has been pushed back by a day to November 12. These are among the nine changes made in the revised tournament fixtures released by the International Cricket Council (ICC) on Wednesday. The much-delayed announcement comes with less than two months left before the tournament kicks off in Ahmedabad on October 5.","pubDate":"2023-08-10 01:23:06","image_url":"https://assets.thehansindia.com/h-upload/2023/08/10/500x300_1371366-indpak.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"AFL wants to show Matildas match at clash between Blues and Demons","link":"https://www.brisbanetimes.com.au/sport/soccer/afl-wants-to-show-matildas-match-at-clash-between-blues-and-demons-20230810-p5dve1.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"The league is awaiting approval from FIFA and is also working through other logistical issues, but a formal announcement is expected on Thursday afternoon.","content":"The AFL has given the green light for the Matildas’ World Cup quarter-final against France to be shown on the big screens at the MCG before the Carlton-Melbourne blockbuster on Saturday night. The league is awaiting approval from FIFA and is also working through other logistical issues, but a formal announcement is expected on Thursday afternoon. The Matildas’ run at the World Cup is capturing the imagination of Australians. Credit: Reuters Though the AFL has traditionally fiercely guarded its territory against other codes, the league has recognised the national importance of the Matildas’ World Cup charge on home soil and the significance for women’s sport in this country. But there is a twist. The AFL will not push back the start time of the Blues-Demons clash, having already changed it from 7.25pm to 7.30pm after the Matildas beat Denmark in the round of 16 on Monday to progress to the quarters. It means there is a possibility the Matildas will be bumped off the big screen if extra time is required once the AFL match starts, and if the World Cup match progresses from that to a penalty shootout. The match, though, would still be shown on TVs in bars and boxes at the ground. The SCG will allow members to stay after the Sydney Swans’ game against Gold Coast to watch the Matildas, and will keep its bars and food outlets open. A crowd of 60,000 is expected at the MCG to watch the two form teams of the AFL go head-to-head in a match with huge ramifications for the finals. Loading The Demons are hunting for a top-two berth, while the Blues are striving for their first finals appearance since 2013. The AFL was widely criticised on social media last year when they released the 2023 fixture on the same morning as the Socceroos were playing Argentina in a knockout match at the World Cup in Qatar. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article FIFA Women's World Cup Matildas AFL 2023 Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-08-10 01:05:41","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket: भारतीय टीम की जर्सी पर पाकिस्तान का नाम! पहली बार एशिया कप में दिखेगा ऐसा नजारा","link":"https://hindi.latestly.com/socially/sports/cricket/cricket-pakistan-name-on-the-jersey-of-the-indian-team-in-asia-cup-2023-know-the-reason-1891872.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट के इतिहास में पहली बार ऐसा होगा, जब टीम इंडिया की जर्सी पर पाकिस्तान का नाम लिखा होगा. भारतीय टीम जब एशिया कप 2023 में उतरेगी तो टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा.","content":"भारतीय क्रिकेट के इतिहास में पहली बार ऐसा होगा, जब टीम इंडिया की जर्सी पर पाकिस्तान का नाम लिखा होगा. भारतीय टीम जब एशिया कप 2023 में उतरेगी तो टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा. दरअसल, पाकिस्तान क्रिकेट बोर्ड यानी पीसीबी के पास एशिया कप 2023 के होस्टिंग राइट्स हैं. हालांकि, टूर्नामेंट हाइब्रिड मॉडल के तहत खेला जाएगा, जिसमें सिर्फ चार ही मैच पाकिस्तान में होंगे और बाकी के मैच 9 मैच श्रीलंका में होंगे. इसकी शुरुआत 30 अगस्त होगी और जब भारतीय टीम 2 सितंबर को पाकिस्तान से भिड़ेगी तो इस मैच में भारतीय टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा. एशिया कप में भारतीय टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा ◆ ऐसा इसलिए होगा क्योंकि पाकिस्तान के पास मल्टी नेशन टूर्नामेंट की मेजबानी का अधिकारी होगा #AsiaCup | Asia Cup | Indian Team Jersey pic.twitter.com/b0v1kIXKsV — News24 (@news24tvchannel) August 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-10 04:28:29","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"2023 ODI World Cup games rescheduled, India-Pak on Oct 14; ticket sales from Aug 25","link":"http://www.newindianexpress.com/sport/cricket/2023/aug/10/2023-odi-world-cup-games-rescheduled-india-pak-on-oct-14-ticket-sales-from-aug-25-2603771.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. CHENNAI: As many as nine games, including two India games and three Pakistan matches, are rescheduled as the International Cricket Council announced the revised schedule for the 2023 ICC Men’s ODI World Cup that is set to be played in India from October 5 to November 19. The most anticipated fixture between arch-rivals India and Pakistan is advanced by a day from October 15 to 14 as the Ahmedabad police had raised security concerns on the game initially coinciding with the first day of the Navaratri festival. Similarly, the clash between Pakistan and England that was set to be played in Kolkata on November 12, too, was advanced by a day after the Cricket Association of Bengal raised the concerns communicated by the Kolkata police department as the match was on the same day as that of Kali Puja, another major Hindu festival. To accommodate the two changes, a few other games had to be tinkered with, taking the number of rescheduled games to nine (approximately 18 per cent of the matches in the tournament). With the India-Pakistan game moved to October 14, the England-Afghanistan game in Delhi is moved to October 15 and the clash between New Zealand and Bangladesh is moved from October 14 to 13 and will be played as a day-night game. Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. As the Pakistan game against England in Kolkata had to be rescheduled, two more changes had to be made. The first being the clash between Australia and Bangladesh rescheduled to November 1 (day game) and then India’s clash against the Netherlands on November 11 is moved to 24 hours later. In what comes as a bigger relief to the fans who were anxiously waiting for the schedule to be finalised so that they can plan their travel, the ICC has said that the tickets will be sold in multiple phases from August 25 — 42 days before the opening game. The sale of tickets for all non-India games, including warm-ups, will be opened on August 25. Tickets for India’s warm-up fixtures will be sold on August 30. Ticket sales for India games at Chennai, Delhi and Pune will open on August 31 followed by their matches in Dharamsala, Lucknow and Mumbai on September 1. Tickets for India matches in Bengaluru and Kolkata will be sold on September 2 and for the game against Pakistan in Ahmedabad on September 3. The tickets for the knockouts will be available on September 15. Fans can register their interest via https://www.cricketworldcup.com/register from August 15. India matches ticket sale details: Aug 30: warm-ups in Guwahati & Thiruvananthapuram Aug 31: vs Australia, Afghanistan, Bangladesh Sep 1: vs England, New Zealand, Sri Lanka Sep 2: vs Netherlands, South Africa Sep 3: vs Pakistan","content":"CHENNAI: As many as nine games, including two India games and three Pakistan matches, are rescheduled as the International Cricket Council announced the revised schedule for the 2023 ICC Men’s ODI World Cup that is set to be played in India from October 5 to November 19. The most anticipated fixture between arch-rivals India and Pakistan is advanced by a day from October 15 to 14 as the Ahmedabad police had raised security concerns on the game initially coinciding with the first day of the Navaratri festival. Similarly, the clash between Pakistan and England that was set to be played in Kolkata on November 12, too, was advanced by a day after the Cricket Association of Bengal raised the concerns communicated by the Kolkata police department as the match was on the same day as that of Kali Puja, another major Hindu festival. To accommodate the two changes, a few other games had to be tinkered with, taking the number of rescheduled games to nine (approximately 18 per cent of the matches in the tournament). With the India-Pakistan game moved to October 14, the England-Afghanistan game in Delhi is moved to October 15 and the clash between New Zealand and Bangladesh is moved from October 14 to 13 and will be played as a day-night game. Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. As the Pakistan game against England in Kolkata had to be rescheduled, two more changes had to be made. The first being the clash between Australia and Bangladesh rescheduled to November 1 (day game) and then India’s clash against the Netherlands on November 11 is moved to 24 hours later. In what comes as a bigger relief to the fans who were anxiously waiting for the schedule to be finalised so that they can plan their travel, the ICC has said that the tickets will be sold in multiple phases from August 25 — 42 days before the opening game. The sale of tickets for all non-India games, including warm-ups, will be opened on August 25. Tickets for India’s warm-up fixtures will be sold on August 30. Ticket sales for India games at Chennai, Delhi and Pune will open on August 31 followed by their matches in Dharamsala, Lucknow and Mumbai on September 1. Tickets for India matches in Bengaluru and Kolkata will be sold on September 2 and for the game against Pakistan in Ahmedabad on September 3. The tickets for the knockouts will be available on September 15. Fans can register their interest via https://www.cricketworldcup.com/register from August 15.","pubDate":"2023-08-10 03:53:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Ellyse Perry extends stay with Sydney Sixers, signs two-year deal","link":"https://thenewsmill.com/2023/08/ellyse-perry-extends-stay-with-sydney-sixers-signs-two-year-deal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Australian all-rounder Ellyse Perry has extended her stay with Sydney Sixers, signing another two-year deal with the Women’s Big Bash League (WBBL) club. “Long-term captain and fan favourite, Ellyse Perry, will continue her WBBL career after the star all-rounder re-signed for two more years with the Sydney Sixers,” said the club in a statement. Perry will lead the Sixers onto the familiar grounds of North Sydney Oval again this summer, starting with the first match of WBBL season 09, on October 19, against the Melbourne Stars. ‘ The now 32-year-old was the Sixers’ first-ever signing way back in 2015 and has remained a loyal and crucial player to the club’s success over the years, leading the side to two title wins and amassing the most runs in club history. Perry broke records during the WBBL 04 season, being named the ‘Player of the Tournament’ and was the first ever Big Bash player to reach 2000 runs. Her sensational performances were deservingly rewarded in 2016, 2018 and 2020, where she won the Belinda Clark Award as Australia’s women’s player of the year. Perry said she was excited for the summer ahead, highlighting the Sixers’ blockbuster Sydney Smash against the Sydney Thunder at the SCG on November 26. “It is a lovely feeling to be able to continue at the Sixers for another two WBBL seasons,” Perry said. “The club has been a special part of my career for almost a decade and I am proud of what we have achieved, both on and off the field, especially in terms of connecting with and inspiring lots of girls and boys to be involved in the game.” “I am really looking forward to the challenge this season presents, and seeing as many fans as we can at North Sydney Oval and the SCG.” “To be able to play at the SCG on November 26 in a stand-alone WBBL match for the first time is a significant step forward and a reflection of the ever-growing appetite for large numbers of fans to be able to watch women’s sport at our world-class sporting venues.” “I think both the Sixers and Thunder can be truly ambitious about attracting a great crowd for the Sydney Smash,” concluded Perry. Perry has represented Australia in 142 T20Is, scoring 1,627 runs in 87 innings at an average of 31.28, with eight half-centuries and best score of 75. Cricket NSW’s General Manager of Big Bash Leagues, Chris Botherway, said it was hard to imagine Perry playing for any other WBBL club. “Ellyse is very much a part of the fabric of the Sydney Sixers and it’s great to have her back on board for the next two seasons,” Botherway said. “She is a leader for the club, both on and off the field, and someone who obviously has an amazing connection with our members and fans.” “We are looking forward to seeing her lead the club to more success in WBBL 09,” he concluded. Sydney Sixers WBBL|09 squad: Maitlan Brown, Erin Burns, Lauren Cheatle, Ash Gardner, Emma Hughes, Ellyse Perry (c). (ANI)","pubDate":"2023-08-10 03:34:41","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Maheesh Theekshana Shows Wonderful Reflexes To Take Catch off His Bowling During Colombo Strikers vs Jaffna Kings LPL 2023 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/maheesh-theekshana-shows-wonderful-reflexes-to-take-catch-off-his-bowling-during-colombo-strikers-vs-jaffna-kings-lpl-2023-match-watch-video-5329742.html","keywords":null,"creator":null,"video_url":null,"description":"The Sri Lankan off-spinner dived full-length to grab the catch after it was hit straight back to him by Colombo Strikers' Lahiru Udara. Jaffna Kings eventually won the match by six wickets.","content":"Maheesh Theekshana showed wonderful reflexes to take a stunning catch off his own bowling during the Lanka Premier League 2023 match between Colombo Strikers and Jaffna Kings on August 8. The off-spinner jumped to his right and grabbed the ball with both hands after batter Lahiru Udara hit it straight back to him, having earlier made room for himself to play a shot on the off-side. The Sri Lankan spinner came up with a full-length dive to complete the catch. 'I Just Absolutely Love Him, Want To Marry Him’ Ramiz Raja's Remark While Praising Babar Azam During LPL 2023 Goes Viral!. Watch Maheesh Theekshana's Catch Here Theekshana showing us what quick reflexes look like ⚡ #LPL2023 #LPLOnFanCode pic.twitter.com/DcmrnJawcf — FanCode (@FanCode) August 9, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-10 03:29:58","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Baba Aparajith Engages in Argument With Umpires, Opposition Player After Being Controversially Dismissed During TNCA Division 1 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/baba-aparajith-engages-in-argument-with-umpires-opposition-player-after-being-controversially-dismissed-during-tnca-division-1-match-watch-video-5329694.html","keywords":null,"creator":null,"video_url":null,"description":"The right-handed batsman was shocked with the umpire's decision to give him out and was involved in a long chat with them before eventually leaving the field. Baba Aparajith's team won the match in the end though by four wickets.","content":"Baba Aparajith got engaged in an argument with the umpires and an opposition player after he was controversially dismissed during a Tamil Nadu Cricket Association (TNCA) Division 1 match. The right-hander, representing Young Stars Cricket Club, was batting against Jolly Rovers CC when he was struck by a delivery on his pads with GS Raju, fielding a forward short-leg, taking the catch. The umpire immediately raised the finger and Aparajith was not happy with the decision. He argued with the umpires and later, also had to be separated after he got into a heated exchange with an opposition player. It took five minutes for him to leave the field after he was adjudged out. Ravi Ashwin Plays Club Cricket, Fans React As India International Cricketer Features in TNCA Division 1 Match . Watch Video: 'The Umpire's decision is final’ Baba Aparajith: Hold my bat! pic.twitter.com/A4Cd6sOV8g — FanCode (@FanCode) August 9, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-10 03:14:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Asia Cup 2023: પાકિસ્તાન સામે ટીમ ઇન્ડિયાનો જોવા મળ્યો છે દબદબો, જાણો એશિયા કપમાં કેવો છે રેકોર્ડ?","link":"https://gujarati.abplive.com/sports/cricket/india-vs-pakistan-record-india-vs-pakistan-cricket-records-head-to-head-853054","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"India vs Pakistan Record: એશિયા કપ 2023 30 ઓગસ્ટથી શરૂ થશે. તેની પ્રથમ મેચ પાકિસ્તાન અને નેપાળ વચ્ચે રમાશે. આ વખતે ટુર્નામેન્ટનું આયોજન હાઇબ્રિડ મોડલ હેઠળ કરવામાં આવશે. તેની કેટલીક મેચો પાકિસ્તાનમાં અને બાકીની શ્રીલંકામાં યોજાશે. આ ટૂર્નામેન્ટમાં ભારતે અત્યાર સુધી પાકિસ્તાન પર જીત મેળવી છે. આ બંન્ને ટીમો 2 સપ્ટેમ્બરે સામ સામે ટકરાશે. આ વખતે એશિયા કપ વન-ડે ફોર્મેટમાં રમાશે અને તેમાં કુલ 13 મેચ રમાશે. જો આપણે ટૂર્નામેન્ટના વન-ડે ફોર્મેટની મેચો પર નજર કરીએ તો ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધી 13 મેચ રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 7 મેચ જીતી છે. જ્યારે તેમને 5 મેચમાં હારનો સામનો કરવો પડ્યો છે. જો આપણે ભારત અને પાકિસ્તાન વચ્ચે રમાયેલી ઓવર ઓલ વન-ડે મેચની વાત કરીએ તો તેમાં પાકિસ્તાનનો દબદબો જોવા મળી રહ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધીમાં 132 વનડે રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 55 મેચ જીતી છે, જ્યારે 73 મેચમાં હારનો સામનો કરવો પડ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે છેલ્લી વન-ડે  મેચ જૂન 2019માં રમાઈ હતી. જેમાં ટીમ ઈન્ડિયાનો 89 રને વિજય થયો હતો. વર્લ્ડ કપ 2019ની આ મેચમાં પ્રથમ બેટિંગ કરતા ભારતે 5 વિકેટ ગુમાવીને 336 રન બનાવ્યા હતા. જવાબમાં પાકિસ્તાની ટીમ 6 વિકેટ ગુમાવીને 212 રન જ બનાવી શકી હતી. તેને ડકવર્થ-લુઈસ નિયમથી હારનો સામનો કરવો પડ્યો હતો. ભારતે છેલ્લી ત્રણ વનડેમાં સતત પાકિસ્તાનને હરાવ્યું છે. ટીમ ઈન્ડિયાએ સપ્ટેમ્બર 2018માં રમાયેલી મેચમાં 8 વિકેટે જીત મેળવી હતી. આ પછી આ જ મહિનામાં પાકિસ્તાનને 9 વિકેટે હરાવ્યું હતું. આ બંન્ને મેચ દુબઈમાં રમાઈ હતી. આગામી વનડે વર્લ્ડકપ 2023ને લઇને મોટુ અપડેટ સામે આવ્યુ છે. વનડે વર્લ્ડકપ 2023 આ વર્ષે 5 ઓક્ટોબરથી શરૂ થવાનો છે, અને આનું આયોજન આ વખતે ભારત કરશે. આ ટૂર્નામેન્ટની ફાઈનલ મેચ 19 નવેમ્બરે રમાશે. ઇન્ટરનેશનલ ક્રિકેટ કાઉન્સિલ (ICC) એ હવે આનું નવું શિડ્યૂલ જાહેર કર્યું છે. આ અંતર્ગત ભારત-પાકિસ્તાન મેચ સહિત 9 મેચોમાં ફેરફાર કરવામાં આવ્યા છે. ભારત અને પાકિસ્તાન વચ્ચેની મેચ હવે 15મીને બદલે એક દિવસ પહેલા એટલે કે 14મી ઓક્ટોબરે અમદાવાદના નરેન્દ્ર મોદી ક્રિકેટ સ્ટેડિયમમાં રમાશે. આ સહિત 9 મેચોના શિડ્યૂલમાં ફેરફાર કરવામાં આવ્યા છે.","content":"India vs Pakistan Record: એશિયા કપ 2023 30 ઓગસ્ટથી શરૂ થશે. તેની પ્રથમ મેચ પાકિસ્તાન અને નેપાળ વચ્ચે રમાશે. આ વખતે ટુર્નામેન્ટનું આયોજન હાઇબ્રિડ મોડલ હેઠળ કરવામાં આવશે. તેની કેટલીક મેચો પાકિસ્તાનમાં અને બાકીની શ્રીલંકામાં યોજાશે. આ ટૂર્નામેન્ટમાં ભારતે અત્યાર સુધી પાકિસ્તાન પર જીત મેળવી છે. આ બંન્ને ટીમો 2 સપ્ટેમ્બરે સામ સામે ટકરાશે. આ વખતે એશિયા કપ વન-ડે ફોર્મેટમાં રમાશે અને તેમાં કુલ 13 મેચ રમાશે. જો આપણે ટૂર્નામેન્ટના વન-ડે ફોર્મેટની મેચો પર નજર કરીએ તો ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધી 13 મેચ રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 7 મેચ જીતી છે. જ્યારે તેમને 5 મેચમાં હારનો સામનો કરવો પડ્યો છે. જો આપણે ભારત અને પાકિસ્તાન વચ્ચે રમાયેલી ઓવર ઓલ વન-ડે મેચની વાત કરીએ તો તેમાં પાકિસ્તાનનો દબદબો જોવા મળી રહ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધીમાં 132 વનડે રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 55 મેચ જીતી છે, જ્યારે 73 મેચમાં હારનો સામનો કરવો પડ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે છેલ્લી વન-ડે મેચ જૂન 2019માં રમાઈ હતી. જેમાં ટીમ ઈન્ડિયાનો 89 રને વિજય થયો હતો. વર્લ્ડ કપ 2019ની આ મેચમાં પ્રથમ બેટિંગ કરતા ભારતે 5 વિકેટ ગુમાવીને 336 રન બનાવ્યા હતા. જવાબમાં પાકિસ્તાની ટીમ 6 વિકેટ ગુમાવીને 212 રન જ બનાવી શકી હતી. તેને ડકવર્થ-લુઈસ નિયમથી હારનો સામનો કરવો પડ્યો હતો. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ભારતે છેલ્લી ત્રણ વનડેમાં સતત પાકિસ્તાનને હરાવ્યું છે. ટીમ ઈન્ડિયાએ સપ્ટેમ્બર 2018માં રમાયેલી મેચમાં 8 વિકેટે જીત મેળવી હતી. આ પછી આ જ મહિનામાં પાકિસ્તાનને 9 વિકેટે હરાવ્યું હતું. આ બંન્ને મેચ દુબઈમાં રમાઈ હતી. આગામી વનડે વર્લ્ડકપ 2023ને લઇને મોટુ અપડેટ સામે આવ્યુ છે. વનડે વર્લ્ડકપ 2023 આ વર્ષે 5 ઓક્ટોબરથી શરૂ થવાનો છે, અને આનું આયોજન આ વખતે ભારત કરશે. આ ટૂર્નામેન્ટની ફાઈનલ મેચ 19 નવેમ્બરે રમાશે. ઇન્ટરનેશનલ ક્રિકેટ કાઉન્સિલ (ICC) એ હવે આનું નવું શિડ્યૂલ જાહેર કર્યું છે. આ અંતર્ગત ભારત-પાકિસ્તાન મેચ સહિત 9 મેચોમાં ફેરફાર કરવામાં આવ્યા છે. ભારત અને પાકિસ્તાન વચ્ચેની મેચ હવે 15મીને બદલે એક દિવસ પહેલા એટલે કે 14મી ઓક્ટોબરે અમદાવાદના નરેન્દ્ર મોદી ક્રિકેટ સ્ટેડિયમમાં રમાશે. આ સહિત 9 મેચોના શિડ્યૂલમાં ફેરફાર કરવામાં આવ્યા છે.","pubDate":"2023-08-10 03:07:57","image_url":"https://static.abplive.com/wp-content/uploads/sites/7/2018/11/20162120/INDVSPAK3-620x400.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Gujarati"},{"title":"Asian Champions Trophy Hockey 2023: BCCI Secretary Jay Shah Extends Wishes to Indian Team for Registering Dominant Victory Over Pakistan","link":"https://www.latestly.com/agency-news/sports-news-bcci-secretary-jay-shah-extends-wishes-to-indian-hockey-team-for-thumping-victory-against-pakistan-5329419.html","keywords":null,"creator":null,"video_url":null,"description":"India pulled off a remarkable 4-0 victory to end Pakistan's hope of making their place in the semi-finals of the tournament.","content":"The Board of Control for Cricket in India (BCCI) secretary Jay Shah congratulated the Indian hockey team for their remarkable victory against Pakistan in the Asian Champions Trophy (ACT) on Wednesday. India pulled off a remarkable 4-0 victory to end Pakistan's hope of making their place in the semi-finals of the tournament. Shah took to X, formerly known as Twitter to extend wishes to the team and wrote, \"Congratulations @TheHockeyIndia on a fabulous win against Pakistan in the Asian Champions Trophy, and qualifying for the semi-finals! The dedication and skill were truly inspiring. Best wishes to the team for the semi-final clash on 11th August. Let's bring home that victory!\" 'Total Dominance' Twitterati React After India Secures Clinical Victory Over Arch-Rivals Pakistan in Asian Champions Trophy Hockey 2023 Clash Coming to the match, Harmanpreet netted a brace while Jugraj Singh and Akashdeep Singh struck one goal each to help India defeat Pakistan 4-0 at the Mayor Radhakrishnan Hockey Stadium in Chennai. The win ensured India finished at the top of the Asian Champions Trophy 2023 points table with 13 points from five matches. Pakistan, ranked 16th in the world, tried to get off to a good start and nearly did so three minutes in. They needed to avoid a loss by two goals or more to advance to the semifinals. After displaying some deft stickwork on the wings, Aqeel Ahmad fired a beautiful pass to an approaching Abdul Hannan. Krishan Bahadur Pathak of the Indian hockey team made a spectacular save, but Hannan was able to bundle in the rebound. The visitors' joy was cut short, however, after a review revealed that the ball had come off the Pakistani player's body. The goal was called off, but Pakistan was granted a penalty corner in its place. Pakistan's hockey team came close to scoring again, but Pathak stopped them. India made use of their opportunities to attack quickly while Pakistan attempted to press hard, and one such break netted the hosts their second penalty corner. Harmanpreet took the opportunity to score the second goal with a powerful drag flick past Hussain's legs. Fans Sing 'Vande Mataram' During India vs Pakistan Asian Champions Trophy 2023 Hockey Match in Chennai (Watch Video) When the Indian hockey team had a comfortable two-goal lead, they were able to play more freely and earn back-to-back penalty corners right before the halftime whistle. Harmanpreet was only narrowly able to be kept out by the Pakistani rushers in order to prevent additional harm. After the restart, Pakistan, the three-time winner of the Asian Champions Trophy, attempted to put on pressure to secure a berth in the semi-finals, but this also left openings for India to take advantage of. This time, Jugraj Singh converted a penalty corner to score the third goal for the home team, giving him his first goal against Pakistan. India took advantage of Pakistan's desperate and gung-ho efforts to keep their dreams of making the semifinals alive after falling behind 3-0. India often exploited Pakistan's inexperienced defence on the counter. India attempted multiple circle penetrations, but they were unable to take the lead in the third period. Akashde Singh finally made the score 4-0 in the fourth quarter after numerous missed opportunities, receiving the tiniest of touches to Mandeep's cross to seal a convincing victory. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","pubDate":"2023-08-10 02:59:34","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"India’s Shaw slams sixth-highest one-day score of 244","link":"https://www.dailymirror.lk/cricket-news/India’s-Shaw-slams-sixth-highest-one-day-score-of-244/320-264958","keywords":null,"creator":null,"video_url":null,"description":"India’s Prithvi Shaw struck the sixth-highest individual one-day score on Wednesday when he blasted an extraordinary 244 for Northamptonshire in their English county One-Day Cup match at home to Somerset.","content":"India's Prithvi Shaw struck the sixth-highest individual one-day score on Wednesday when he blasted an extraordinary 244 for Northamptonshire in their English county One-Day Cup match at home to Somerset. The 23-year-old, opening the batting, faced just 153 balls, including 28 fours and 11 sixes as Northamptonshire piled up 415-8 en route to an 87-run win at Wantage Road. Shaw's innings was the sixth-highest individual score in any limited overs match, with only Ali Brown's 268 for Surrey against Glamorgan in 2002 a higher solo total in an English county match of this kind. Long tipped for batting stardom after making a mammoth 546 in a single innings as a 14-year-old during a school match, the right-hander's first hundred runs Wednesday came off 81 balls with Shaw facing a mere 48 balls for his second hundred. Shaw, who made a century on Test debut for India as an 18-year-old, comfortably surpassed Northamptonshire's previous highest limited-overs individual record score of 172 not out by former England batsman Wayne Larkins, made in a 40-over match back in 1983. \"We were not prepared for this,\" said a post on Northamptonshire's Twitter feed. \"Prithvi Shaw has another List A double century! There are no words for how good this innings has been.\" Shaw was eventually dismissed three balls from the end of the innings, caught at deep mid-wicket off seamer Danny Lamb. This was the second time Shaw had made a double century in a domestic one-day match, following his unbeaten 227 for Mumbai against Puducherry in 2021. Shaw has so far represented India in 12 matches across all three international formats -- Tests, one-day internationals and Twenty20 matches -- with the last of those appearances coming two years ago. (AFP) Highest individual scores in one-day games: 277 - Narayan Jagadeesan, Tamil Nadu v Arunachal, 2022 268 - Alistair Brown, Surrey v Glamorgan, 2002 264 - Rohit Sharma, India v Sri Lanka, 2014 257 - D'Arcy Short, Western Australia v Queensland, 2018 248 - Shikhar Dhawan, India A v South Africa A, 2013 244 - Prithvi Shaw, Northamptonshire v Somerset, 2023","pubDate":"2023-08-10 01:38:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_0674a72bfa.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India, Pakistan World Cup match now on Oct 14","link":"https://www.thehansindia.com/sports/cricket/india-pakistan-world-cup-match-now-on-oct-14-814631","keywords":["Sports,Top Stories,Cricket"],"creator":["The Hans India"],"video_url":null,"description":null,"content":"New Delhi: The mega clash between India and Pakistan in Ahmedabad has been advanced by a day to October 14 and India’s final league match against Netherlands in Bengaluru has been pushed back by a day to November 12. These are among the nine changes made in the revised tournament fixtures released by the International Cricket Council (ICC) on Wednesday. The much-delayed announcement comes with less than two months left before the tournament kicks off in Ahmedabad on October 5.","pubDate":"2023-08-10 01:23:06","image_url":"https://assets.thehansindia.com/h-upload/2023/08/10/500x300_1371366-indpak.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"AFL wants to show Matildas match at clash between Blues and Demons","link":"https://www.brisbanetimes.com.au/sport/soccer/afl-wants-to-show-matildas-match-at-clash-between-blues-and-demons-20230810-p5dve1.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"The league is awaiting approval from FIFA and is also working through other logistical issues, but a formal announcement is expected on Thursday afternoon.","content":"The AFL has given the green light for the Matildas’ World Cup quarter-final against France to be shown on the big screens at the MCG before the Carlton-Melbourne blockbuster on Saturday night. The league is awaiting approval from FIFA and is also working through other logistical issues, but a formal announcement is expected on Thursday afternoon. The Matildas’ run at the World Cup is capturing the imagination of Australians. Credit: Reuters Though the AFL has traditionally fiercely guarded its territory against other codes, the league has recognised the national importance of the Matildas’ World Cup charge on home soil and the significance for women’s sport in this country. But there is a twist. The AFL will not push back the start time of the Blues-Demons clash, having already changed it from 7.25pm to 7.30pm after the Matildas beat Denmark in the round of 16 on Monday to progress to the quarters. It means there is a possibility the Matildas will be bumped off the big screen if extra time is required once the AFL match starts, and if the World Cup match progresses from that to a penalty shootout. The match, though, would still be shown on TVs in bars and boxes at the ground. The SCG will allow members to stay after the Sydney Swans’ game against Gold Coast to watch the Matildas, and will keep its bars and food outlets open. A crowd of 60,000 is expected at the MCG to watch the two form teams of the AFL go head-to-head in a match with huge ramifications for the finals. Loading The Demons are hunting for a top-two berth, while the Blues are striving for their first finals appearance since 2013. The AFL was widely criticised on social media last year when they released the 2023 fixture on the same morning as the Socceroos were playing Argentina in a knockout match at the World Cup in Qatar. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article FIFA Women's World Cup Matildas AFL 2023 Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-08-10 01:05:41","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket: भारतीय टीम की जर्सी पर पाकिस्तान का नाम! पहली बार एशिया कप में दिखेगा ऐसा नजारा","link":"https://hindi.latestly.com/socially/sports/cricket/cricket-pakistan-name-on-the-jersey-of-the-indian-team-in-asia-cup-2023-know-the-reason-1891872.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट के इतिहास में पहली बार ऐसा होगा, जब टीम इंडिया की जर्सी पर पाकिस्तान का नाम लिखा होगा. भारतीय टीम जब एशिया कप 2023 में उतरेगी तो टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा.","content":"भारतीय क्रिकेट के इतिहास में पहली बार ऐसा होगा, जब टीम इंडिया की जर्सी पर पाकिस्तान का नाम लिखा होगा. भारतीय टीम जब एशिया कप 2023 में उतरेगी तो टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा. दरअसल, पाकिस्तान क्रिकेट बोर्ड यानी पीसीबी के पास एशिया कप 2023 के होस्टिंग राइट्स हैं. हालांकि, टूर्नामेंट हाइब्रिड मॉडल के तहत खेला जाएगा, जिसमें सिर्फ चार ही मैच पाकिस्तान में होंगे और बाकी के मैच 9 मैच श्रीलंका में होंगे. इसकी शुरुआत 30 अगस्त होगी और जब भारतीय टीम 2 सितंबर को पाकिस्तान से भिड़ेगी तो इस मैच में भारतीय टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा. एशिया कप में भारतीय टीम की जर्सी पर पाकिस्तान का नाम लिखा होगा ◆ ऐसा इसलिए होगा क्योंकि पाकिस्तान के पास मल्टी नेशन टूर्नामेंट की मेजबानी का अधिकारी होगा #AsiaCup | Asia Cup | Indian Team Jersey pic.twitter.com/b0v1kIXKsV — News24 (@news24tvchannel) August 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-10 04:28:29","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"2023 ODI World Cup games rescheduled, India-Pak on Oct 14; ticket sales from Aug 25","link":"http://www.newindianexpress.com/sport/cricket/2023/aug/10/2023-odi-world-cup-games-rescheduled-india-pak-on-oct-14-ticket-sales-from-aug-25-2603771.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. CHENNAI: As many as nine games, including two India games and three Pakistan matches, are rescheduled as the International Cricket Council announced the revised schedule for the 2023 ICC Men’s ODI World Cup that is set to be played in India from October 5 to November 19. The most anticipated fixture between arch-rivals India and Pakistan is advanced by a day from October 15 to 14 as the Ahmedabad police had raised security concerns on the game initially coinciding with the first day of the Navaratri festival. Similarly, the clash between Pakistan and England that was set to be played in Kolkata on November 12, too, was advanced by a day after the Cricket Association of Bengal raised the concerns communicated by the Kolkata police department as the match was on the same day as that of Kali Puja, another major Hindu festival. To accommodate the two changes, a few other games had to be tinkered with, taking the number of rescheduled games to nine (approximately 18 per cent of the matches in the tournament). With the India-Pakistan game moved to October 14, the England-Afghanistan game in Delhi is moved to October 15 and the clash between New Zealand and Bangladesh is moved from October 14 to 13 and will be played as a day-night game. Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. As the Pakistan game against England in Kolkata had to be rescheduled, two more changes had to be made. The first being the clash between Australia and Bangladesh rescheduled to November 1 (day game) and then India’s clash against the Netherlands on November 11 is moved to 24 hours later. In what comes as a bigger relief to the fans who were anxiously waiting for the schedule to be finalised so that they can plan their travel, the ICC has said that the tickets will be sold in multiple phases from August 25 — 42 days before the opening game. The sale of tickets for all non-India games, including warm-ups, will be opened on August 25. Tickets for India’s warm-up fixtures will be sold on August 30. Ticket sales for India games at Chennai, Delhi and Pune will open on August 31 followed by their matches in Dharamsala, Lucknow and Mumbai on September 1. Tickets for India matches in Bengaluru and Kolkata will be sold on September 2 and for the game against Pakistan in Ahmedabad on September 3. The tickets for the knockouts will be available on September 15. Fans can register their interest via https://www.cricketworldcup.com/register from August 15. India matches ticket sale details: Aug 30: warm-ups in Guwahati & Thiruvananthapuram Aug 31: vs Australia, Afghanistan, Bangladesh Sep 1: vs England, New Zealand, Sri Lanka Sep 2: vs Netherlands, South Africa Sep 3: vs Pakistan","content":"CHENNAI: As many as nine games, including two India games and three Pakistan matches, are rescheduled as the International Cricket Council announced the revised schedule for the 2023 ICC Men’s ODI World Cup that is set to be played in India from October 5 to November 19. The most anticipated fixture between arch-rivals India and Pakistan is advanced by a day from October 15 to 14 as the Ahmedabad police had raised security concerns on the game initially coinciding with the first day of the Navaratri festival. Similarly, the clash between Pakistan and England that was set to be played in Kolkata on November 12, too, was advanced by a day after the Cricket Association of Bengal raised the concerns communicated by the Kolkata police department as the match was on the same day as that of Kali Puja, another major Hindu festival. To accommodate the two changes, a few other games had to be tinkered with, taking the number of rescheduled games to nine (approximately 18 per cent of the matches in the tournament). With the India-Pakistan game moved to October 14, the England-Afghanistan game in Delhi is moved to October 15 and the clash between New Zealand and Bangladesh is moved from October 14 to 13 and will be played as a day-night game. Pakistan’s game against Sri Lanka, originally slotted on October 12, will now be held on October 10 and Australia’s game against South Africa will be played on October 12. As the Pakistan game against England in Kolkata had to be rescheduled, two more changes had to be made. The first being the clash between Australia and Bangladesh rescheduled to November 1 (day game) and then India’s clash against the Netherlands on November 11 is moved to 24 hours later. In what comes as a bigger relief to the fans who were anxiously waiting for the schedule to be finalised so that they can plan their travel, the ICC has said that the tickets will be sold in multiple phases from August 25 — 42 days before the opening game. The sale of tickets for all non-India games, including warm-ups, will be opened on August 25. Tickets for India’s warm-up fixtures will be sold on August 30. Ticket sales for India games at Chennai, Delhi and Pune will open on August 31 followed by their matches in Dharamsala, Lucknow and Mumbai on September 1. Tickets for India matches in Bengaluru and Kolkata will be sold on September 2 and for the game against Pakistan in Ahmedabad on September 3. The tickets for the knockouts will be available on September 15. Fans can register their interest via https://www.cricketworldcup.com/register from August 15.","pubDate":"2023-08-10 03:53:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Ellyse Perry extends stay with Sydney Sixers, signs two-year deal","link":"https://thenewsmill.com/2023/08/ellyse-perry-extends-stay-with-sydney-sixers-signs-two-year-deal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Australian all-rounder Ellyse Perry has extended her stay with Sydney Sixers, signing another two-year deal with the Women’s Big Bash League (WBBL) club. “Long-term captain and fan favourite, Ellyse Perry, will continue her WBBL career after the star all-rounder re-signed for two more years with the Sydney Sixers,” said the club in a statement. Perry will lead the Sixers onto the familiar grounds of North Sydney Oval again this summer, starting with the first match of WBBL season 09, on October 19, against the Melbourne Stars. ‘ The now 32-year-old was the Sixers’ first-ever signing way back in 2015 and has remained a loyal and crucial player to the club’s success over the years, leading the side to two title wins and amassing the most runs in club history. Perry broke records during the WBBL 04 season, being named the ‘Player of the Tournament’ and was the first ever Big Bash player to reach 2000 runs. Her sensational performances were deservingly rewarded in 2016, 2018 and 2020, where she won the Belinda Clark Award as Australia’s women’s player of the year. Perry said she was excited for the summer ahead, highlighting the Sixers’ blockbuster Sydney Smash against the Sydney Thunder at the SCG on November 26. “It is a lovely feeling to be able to continue at the Sixers for another two WBBL seasons,” Perry said. “The club has been a special part of my career for almost a decade and I am proud of what we have achieved, both on and off the field, especially in terms of connecting with and inspiring lots of girls and boys to be involved in the game.” “I am really looking forward to the challenge this season presents, and seeing as many fans as we can at North Sydney Oval and the SCG.” “To be able to play at the SCG on November 26 in a stand-alone WBBL match for the first time is a significant step forward and a reflection of the ever-growing appetite for large numbers of fans to be able to watch women’s sport at our world-class sporting venues.” “I think both the Sixers and Thunder can be truly ambitious about attracting a great crowd for the Sydney Smash,” concluded Perry. Perry has represented Australia in 142 T20Is, scoring 1,627 runs in 87 innings at an average of 31.28, with eight half-centuries and best score of 75. Cricket NSW’s General Manager of Big Bash Leagues, Chris Botherway, said it was hard to imagine Perry playing for any other WBBL club. “Ellyse is very much a part of the fabric of the Sydney Sixers and it’s great to have her back on board for the next two seasons,” Botherway said. “She is a leader for the club, both on and off the field, and someone who obviously has an amazing connection with our members and fans.” “We are looking forward to seeing her lead the club to more success in WBBL 09,” he concluded. Sydney Sixers WBBL|09 squad: Maitlan Brown, Erin Burns, Lauren Cheatle, Ash Gardner, Emma Hughes, Ellyse Perry (c). (ANI)","pubDate":"2023-08-10 03:34:41","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Maheesh Theekshana Shows Wonderful Reflexes To Take Catch off His Bowling During Colombo Strikers vs Jaffna Kings LPL 2023 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/maheesh-theekshana-shows-wonderful-reflexes-to-take-catch-off-his-bowling-during-colombo-strikers-vs-jaffna-kings-lpl-2023-match-watch-video-5329742.html","keywords":null,"creator":null,"video_url":null,"description":"The Sri Lankan off-spinner dived full-length to grab the catch after it was hit straight back to him by Colombo Strikers' Lahiru Udara. Jaffna Kings eventually won the match by six wickets.","content":"Maheesh Theekshana showed wonderful reflexes to take a stunning catch off his own bowling during the Lanka Premier League 2023 match between Colombo Strikers and Jaffna Kings on August 8. The off-spinner jumped to his right and grabbed the ball with both hands after batter Lahiru Udara hit it straight back to him, having earlier made room for himself to play a shot on the off-side. The Sri Lankan spinner came up with a full-length dive to complete the catch. 'I Just Absolutely Love Him, Want To Marry Him’ Ramiz Raja's Remark While Praising Babar Azam During LPL 2023 Goes Viral!. Watch Maheesh Theekshana's Catch Here Theekshana showing us what quick reflexes look like ⚡ #LPL2023 #LPLOnFanCode pic.twitter.com/DcmrnJawcf — FanCode (@FanCode) August 9, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-10 03:29:58","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Baba Aparajith Engages in Argument With Umpires, Opposition Player After Being Controversially Dismissed During TNCA Division 1 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/baba-aparajith-engages-in-argument-with-umpires-opposition-player-after-being-controversially-dismissed-during-tnca-division-1-match-watch-video-5329694.html","keywords":null,"creator":null,"video_url":null,"description":"The right-handed batsman was shocked with the umpire's decision to give him out and was involved in a long chat with them before eventually leaving the field. Baba Aparajith's team won the match in the end though by four wickets.","content":"Baba Aparajith got engaged in an argument with the umpires and an opposition player after he was controversially dismissed during a Tamil Nadu Cricket Association (TNCA) Division 1 match. The right-hander, representing Young Stars Cricket Club, was batting against Jolly Rovers CC when he was struck by a delivery on his pads with GS Raju, fielding a forward short-leg, taking the catch. The umpire immediately raised the finger and Aparajith was not happy with the decision. He argued with the umpires and later, also had to be separated after he got into a heated exchange with an opposition player. It took five minutes for him to leave the field after he was adjudged out. Ravi Ashwin Plays Club Cricket, Fans React As India International Cricketer Features in TNCA Division 1 Match . Watch Video: 'The Umpire's decision is final’ Baba Aparajith: Hold my bat! pic.twitter.com/A4Cd6sOV8g — FanCode (@FanCode) August 9, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-10 03:14:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Asia Cup 2023: પાકિસ્તાન સામે ટીમ ઇન્ડિયાનો જોવા મળ્યો છે દબદબો, જાણો એશિયા કપમાં કેવો છે રેકોર્ડ?","link":"https://gujarati.abplive.com/sports/cricket/india-vs-pakistan-record-india-vs-pakistan-cricket-records-head-to-head-853054","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"India vs Pakistan Record: એશિયા કપ 2023 30 ઓગસ્ટથી શરૂ થશે. તેની પ્રથમ મેચ પાકિસ્તાન અને નેપાળ વચ્ચે રમાશે. આ વખતે ટુર્નામેન્ટનું આયોજન હાઇબ્રિડ મોડલ હેઠળ કરવામાં આવશે. તેની કેટલીક મેચો પાકિસ્તાનમાં અને બાકીની શ્રીલંકામાં યોજાશે. આ ટૂર્નામેન્ટમાં ભારતે અત્યાર સુધી પાકિસ્તાન પર જીત મેળવી છે. આ બંન્ને ટીમો 2 સપ્ટેમ્બરે સામ સામે ટકરાશે. આ વખતે એશિયા કપ વન-ડે ફોર્મેટમાં રમાશે અને તેમાં કુલ 13 મેચ રમાશે. જો આપણે ટૂર્નામેન્ટના વન-ડે ફોર્મેટની મેચો પર નજર કરીએ તો ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધી 13 મેચ રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 7 મેચ જીતી છે. જ્યારે તેમને 5 મેચમાં હારનો સામનો કરવો પડ્યો છે. જો આપણે ભારત અને પાકિસ્તાન વચ્ચે રમાયેલી ઓવર ઓલ વન-ડે મેચની વાત કરીએ તો તેમાં પાકિસ્તાનનો દબદબો જોવા મળી રહ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધીમાં 132 વનડે રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 55 મેચ જીતી છે, જ્યારે 73 મેચમાં હારનો સામનો કરવો પડ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે છેલ્લી વન-ડે  મેચ જૂન 2019માં રમાઈ હતી. જેમાં ટીમ ઈન્ડિયાનો 89 રને વિજય થયો હતો. વર્લ્ડ કપ 2019ની આ મેચમાં પ્રથમ બેટિંગ કરતા ભારતે 5 વિકેટ ગુમાવીને 336 રન બનાવ્યા હતા. જવાબમાં પાકિસ્તાની ટીમ 6 વિકેટ ગુમાવીને 212 રન જ બનાવી શકી હતી. તેને ડકવર્થ-લુઈસ નિયમથી હારનો સામનો કરવો પડ્યો હતો. ભારતે છેલ્લી ત્રણ વનડેમાં સતત પાકિસ્તાનને હરાવ્યું છે. ટીમ ઈન્ડિયાએ સપ્ટેમ્બર 2018માં રમાયેલી મેચમાં 8 વિકેટે જીત મેળવી હતી. આ પછી આ જ મહિનામાં પાકિસ્તાનને 9 વિકેટે હરાવ્યું હતું. આ બંન્ને મેચ દુબઈમાં રમાઈ હતી. આગામી વનડે વર્લ્ડકપ 2023ને લઇને મોટુ અપડેટ સામે આવ્યુ છે. વનડે વર્લ્ડકપ 2023 આ વર્ષે 5 ઓક્ટોબરથી શરૂ થવાનો છે, અને આનું આયોજન આ વખતે ભારત કરશે. આ ટૂર્નામેન્ટની ફાઈનલ મેચ 19 નવેમ્બરે રમાશે. ઇન્ટરનેશનલ ક્રિકેટ કાઉન્સિલ (ICC) એ હવે આનું નવું શિડ્યૂલ જાહેર કર્યું છે. આ અંતર્ગત ભારત-પાકિસ્તાન મેચ સહિત 9 મેચોમાં ફેરફાર કરવામાં આવ્યા છે. ભારત અને પાકિસ્તાન વચ્ચેની મેચ હવે 15મીને બદલે એક દિવસ પહેલા એટલે કે 14મી ઓક્ટોબરે અમદાવાદના નરેન્દ્ર મોદી ક્રિકેટ સ્ટેડિયમમાં રમાશે. આ સહિત 9 મેચોના શિડ્યૂલમાં ફેરફાર કરવામાં આવ્યા છે.","content":"India vs Pakistan Record: એશિયા કપ 2023 30 ઓગસ્ટથી શરૂ થશે. તેની પ્રથમ મેચ પાકિસ્તાન અને નેપાળ વચ્ચે રમાશે. આ વખતે ટુર્નામેન્ટનું આયોજન હાઇબ્રિડ મોડલ હેઠળ કરવામાં આવશે. તેની કેટલીક મેચો પાકિસ્તાનમાં અને બાકીની શ્રીલંકામાં યોજાશે. આ ટૂર્નામેન્ટમાં ભારતે અત્યાર સુધી પાકિસ્તાન પર જીત મેળવી છે. આ બંન્ને ટીમો 2 સપ્ટેમ્બરે સામ સામે ટકરાશે. આ વખતે એશિયા કપ વન-ડે ફોર્મેટમાં રમાશે અને તેમાં કુલ 13 મેચ રમાશે. જો આપણે ટૂર્નામેન્ટના વન-ડે ફોર્મેટની મેચો પર નજર કરીએ તો ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધી 13 મેચ રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 7 મેચ જીતી છે. જ્યારે તેમને 5 મેચમાં હારનો સામનો કરવો પડ્યો છે. જો આપણે ભારત અને પાકિસ્તાન વચ્ચે રમાયેલી ઓવર ઓલ વન-ડે મેચની વાત કરીએ તો તેમાં પાકિસ્તાનનો દબદબો જોવા મળી રહ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે અત્યાર સુધીમાં 132 વનડે રમાઈ છે. આ દરમિયાન ટીમ ઈન્ડિયાએ 55 મેચ જીતી છે, જ્યારે 73 મેચમાં હારનો સામનો કરવો પડ્યો છે. ભારત અને પાકિસ્તાન વચ્ચે છેલ્લી વન-ડે મેચ જૂન 2019માં રમાઈ હતી. જેમાં ટીમ ઈન્ડિયાનો 89 રને વિજય થયો હતો. વર્લ્ડ કપ 2019ની આ મેચમાં પ્રથમ બેટિંગ કરતા ભારતે 5 વિકેટ ગુમાવીને 336 રન બનાવ્યા હતા. જવાબમાં પાકિસ્તાની ટીમ 6 વિકેટ ગુમાવીને 212 રન જ બનાવી શકી હતી. તેને ડકવર્થ-લુઈસ નિયમથી હારનો સામનો કરવો પડ્યો હતો. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ભારતે છેલ્લી ત્રણ વનડેમાં સતત પાકિસ્તાનને હરાવ્યું છે. ટીમ ઈન્ડિયાએ સપ્ટેમ્બર 2018માં રમાયેલી મેચમાં 8 વિકેટે જીત મેળવી હતી. આ પછી આ જ મહિનામાં પાકિસ્તાનને 9 વિકેટે હરાવ્યું હતું. આ બંન્ને મેચ દુબઈમાં રમાઈ હતી. આગામી વનડે વર્લ્ડકપ 2023ને લઇને મોટુ અપડેટ સામે આવ્યુ છે. વનડે વર્લ્ડકપ 2023 આ વર્ષે 5 ઓક્ટોબરથી શરૂ થવાનો છે, અને આનું આયોજન આ વખતે ભારત કરશે. આ ટૂર્નામેન્ટની ફાઈનલ મેચ 19 નવેમ્બરે રમાશે. ઇન્ટરનેશનલ ક્રિકેટ કાઉન્સિલ (ICC) એ હવે આનું નવું શિડ્યૂલ જાહેર કર્યું છે. આ અંતર્ગત ભારત-પાકિસ્તાન મેચ સહિત 9 મેચોમાં ફેરફાર કરવામાં આવ્યા છે. ભારત અને પાકિસ્તાન વચ્ચેની મેચ હવે 15મીને બદલે એક દિવસ પહેલા એટલે કે 14મી ઓક્ટોબરે અમદાવાદના નરેન્દ્ર મોદી ક્રિકેટ સ્ટેડિયમમાં રમાશે. આ સહિત 9 મેચોના શિડ્યૂલમાં ફેરફાર કરવામાં આવ્યા છે.","pubDate":"2023-08-10 03:07:57","image_url":"https://static.abplive.com/wp-content/uploads/sites/7/2018/11/20162120/INDVSPAK3-620x400.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Gujarati"},{"title":"Asian Champions Trophy Hockey 2023: BCCI Secretary Jay Shah Extends Wishes to Indian Team for Registering Dominant Victory Over Pakistan","link":"https://www.latestly.com/agency-news/sports-news-bcci-secretary-jay-shah-extends-wishes-to-indian-hockey-team-for-thumping-victory-against-pakistan-5329419.html","keywords":null,"creator":null,"video_url":null,"description":"India pulled off a remarkable 4-0 victory to end Pakistan's hope of making their place in the semi-finals of the tournament.","content":"The Board of Control for Cricket in India (BCCI) secretary Jay Shah congratulated the Indian hockey team for their remarkable victory against Pakistan in the Asian Champions Trophy (ACT) on Wednesday. India pulled off a remarkable 4-0 victory to end Pakistan's hope of making their place in the semi-finals of the tournament. Shah took to X, formerly known as Twitter to extend wishes to the team and wrote, \"Congratulations @TheHockeyIndia on a fabulous win against Pakistan in the Asian Champions Trophy, and qualifying for the semi-finals! The dedication and skill were truly inspiring. Best wishes to the team for the semi-final clash on 11th August. Let's bring home that victory!\" 'Total Dominance' Twitterati React After India Secures Clinical Victory Over Arch-Rivals Pakistan in Asian Champions Trophy Hockey 2023 Clash Coming to the match, Harmanpreet netted a brace while Jugraj Singh and Akashdeep Singh struck one goal each to help India defeat Pakistan 4-0 at the Mayor Radhakrishnan Hockey Stadium in Chennai. The win ensured India finished at the top of the Asian Champions Trophy 2023 points table with 13 points from five matches. Pakistan, ranked 16th in the world, tried to get off to a good start and nearly did so three minutes in. They needed to avoid a loss by two goals or more to advance to the semifinals. After displaying some deft stickwork on the wings, Aqeel Ahmad fired a beautiful pass to an approaching Abdul Hannan. Krishan Bahadur Pathak of the Indian hockey team made a spectacular save, but Hannan was able to bundle in the rebound. The visitors' joy was cut short, however, after a review revealed that the ball had come off the Pakistani player's body. The goal was called off, but Pakistan was granted a penalty corner in its place. Pakistan's hockey team came close to scoring again, but Pathak stopped them. India made use of their opportunities to attack quickly while Pakistan attempted to press hard, and one such break netted the hosts their second penalty corner. Harmanpreet took the opportunity to score the second goal with a powerful drag flick past Hussain's legs. Fans Sing 'Vande Mataram' During India vs Pakistan Asian Champions Trophy 2023 Hockey Match in Chennai (Watch Video) When the Indian hockey team had a comfortable two-goal lead, they were able to play more freely and earn back-to-back penalty corners right before the halftime whistle. Harmanpreet was only narrowly able to be kept out by the Pakistani rushers in order to prevent additional harm. After the restart, Pakistan, the three-time winner of the Asian Champions Trophy, attempted to put on pressure to secure a berth in the semi-finals, but this also left openings for India to take advantage of. This time, Jugraj Singh converted a penalty corner to score the third goal for the home team, giving him his first goal against Pakistan. India took advantage of Pakistan's desperate and gung-ho efforts to keep their dreams of making the semifinals alive after falling behind 3-0. India often exploited Pakistan's inexperienced defence on the counter. India attempted multiple circle penetrations, but they were unable to take the lead in the third period. Akashde Singh finally made the score 4-0 in the fourth quarter after numerous missed opportunities, receiving the tiniest of touches to Mandeep's cross to seal a convincing victory. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","pubDate":"2023-08-10 02:59:34","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"India’s Shaw slams sixth-highest one-day score of 244","link":"https://www.dailymirror.lk/cricket-news/India’s-Shaw-slams-sixth-highest-one-day-score-of-244/320-264958","keywords":null,"creator":null,"video_url":null,"description":"India’s Prithvi Shaw struck the sixth-highest individual one-day score on Wednesday when he blasted an extraordinary 244 for Northamptonshire in their English county One-Day Cup match at home to Somerset.","content":"India's Prithvi Shaw struck the sixth-highest individual one-day score on Wednesday when he blasted an extraordinary 244 for Northamptonshire in their English county One-Day Cup match at home to Somerset. The 23-year-old, opening the batting, faced just 153 balls, including 28 fours and 11 sixes as Northamptonshire piled up 415-8 en route to an 87-run win at Wantage Road. Shaw's innings was the sixth-highest individual score in any limited overs match, with only Ali Brown's 268 for Surrey against Glamorgan in 2002 a higher solo total in an English county match of this kind. Long tipped for batting stardom after making a mammoth 546 in a single innings as a 14-year-old during a school match, the right-hander's first hundred runs Wednesday came off 81 balls with Shaw facing a mere 48 balls for his second hundred. Shaw, who made a century on Test debut for India as an 18-year-old, comfortably surpassed Northamptonshire's previous highest limited-overs individual record score of 172 not out by former England batsman Wayne Larkins, made in a 40-over match back in 1983. \"We were not prepared for this,\" said a post on Northamptonshire's Twitter feed. \"Prithvi Shaw has another List A double century! There are no words for how good this innings has been.\" Shaw was eventually dismissed three balls from the end of the innings, caught at deep mid-wicket off seamer Danny Lamb. This was the second time Shaw had made a double century in a domestic one-day match, following his unbeaten 227 for Mumbai against Puducherry in 2021. Shaw has so far represented India in 12 matches across all three international formats -- Tests, one-day internationals and Twenty20 matches -- with the last of those appearances coming two years ago. (AFP) Highest individual scores in one-day games: 277 - Narayan Jagadeesan, Tamil Nadu v Arunachal, 2022 268 - Alistair Brown, Surrey v Glamorgan, 2002 264 - Rohit Sharma, India v Sri Lanka, 2014 257 - D'Arcy Short, Western Australia v Queensland, 2018 248 - Shikhar Dhawan, India A v South Africa A, 2013 244 - Prithvi Shaw, Northamptonshire v Somerset, 2023","pubDate":"2023-08-10 01:38:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_0674a72bfa.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India, Pakistan World Cup match now on Oct 14","link":"https://www.thehansindia.com/sports/cricket/india-pakistan-world-cup-match-now-on-oct-14-814631","keywords":["Sports,Top Stories,Cricket"],"creator":["The Hans India"],"video_url":null,"description":null,"content":"New Delhi: The mega clash between India and Pakistan in Ahmedabad has been advanced by a day to October 14 and India’s final league match against Netherlands in Bengaluru has been pushed back by a day to November 12. These are among the nine changes made in the revised tournament fixtures released by the International Cricket Council (ICC) on Wednesday. The much-delayed announcement comes with less than two months left before the tournament kicks off in Ahmedabad on October 5.","pubDate":"2023-08-10 01:23:06","image_url":"https://assets.thehansindia.com/h-upload/2023/08/10/500x300_1371366-indpak.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"AFL wants to show Matildas match at clash between Blues and Demons","link":"https://www.brisbanetimes.com.au/sport/soccer/afl-wants-to-show-matildas-match-at-clash-between-blues-and-demons-20230810-p5dve1.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"The league is awaiting approval from FIFA and is also working through other logistical issues, but a formal announcement is expected on Thursday afternoon.","content":"The AFL has given the green light for the Matildas’ World Cup quarter-final against France to be shown on the big screens at the MCG before the Carlton-Melbourne blockbuster on Saturday night. The league is awaiting approval from FIFA and is also working through other logistical issues, but a formal announcement is expected on Thursday afternoon. The Matildas’ run at the World Cup is capturing the imagination of Australians. Credit: Reuters Though the AFL has traditionally fiercely guarded its territory against other codes, the league has recognised the national importance of the Matildas’ World Cup charge on home soil and the significance for women’s sport in this country. But there is a twist. The AFL will not push back the start time of the Blues-Demons clash, having already changed it from 7.25pm to 7.30pm after the Matildas beat Denmark in the round of 16 on Monday to progress to the quarters. It means there is a possibility the Matildas will be bumped off the big screen if extra time is required once the AFL match starts, and if the World Cup match progresses from that to a penalty shootout. The match, though, would still be shown on TVs in bars and boxes at the ground. The SCG will allow members to stay after the Sydney Swans’ game against Gold Coast to watch the Matildas, and will keep its bars and food outlets open. A crowd of 60,000 is expected at the MCG to watch the two form teams of the AFL go head-to-head in a match with huge ramifications for the finals. Loading The Demons are hunting for a top-two berth, while the Blues are striving for their first finals appearance since 2013. The AFL was widely criticised on social media last year when they released the 2023 fixture on the same morning as the Socceroos were playing Argentina in a knockout match at the World Cup in Qatar. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article FIFA Women's World Cup Matildas AFL 2023 Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-08-10 01:05:41","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"}]}