{"newsArray":[{"title":"BAN vs ZIM Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BAN vs ZIM T20 World Cup 2022 Super 12 at Gabba, 830 AM IST, October 30","link":"https://zeenews.india.com/cricket/ban-vs-zim-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ban-vs-zim-t20-world-cup-2022-super-12-at-gabba-830-am-ist-october-30-2528293.html","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs Zimbabwe Dream11 Team Prediction Bangladesh vs Zimbabwe T20 World Cup 2022 Super 12 Preview - Check My Dream11 Team, Best players list of BAN vs ZIM, Bangladesh Dream11 Team Player List, Zimbabwe Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"A spirited Zimbabwe team held its nerves to beat Pakistan by one run in a thrilling ICC Men's T20 World Cup 2022 Super 12 match that went down to the very last delivery at Perth Stadium, on Thursday (October 27). This was Pakistan's second defeat in two games and their road to the semifinal has become difficult now. They had earlier lost to arch-rivals India in their campaign opener on Sunday. Zimbabwe were seen celebrating their famous victory over Pakistan in style after the game. (WATCH: Pakistan's Mr Bean breaks his silence after Zimbabwe thump Men in Green) Bangladesh on the other hand would be short of confidence and ambition coming into this fixture tasting a heavy defeat against South Africa by 104 runs in their last fixture. The Protest posted a heavy target of 206 for the Shakib Al Hassan-led side and they were bowled out for just 101 in 16.3 overs. Match Details Bangladesh vs Zimbabwe T20 World Cup 2022 Super 12 Match No. 28 Venue: The Gabba Date & Time: October 30 at 8:30 AM IST Live Streaming and TV details: Star Sports Network and Disney+ Hotstar website and app BAN vs ZIM Dream11 Team Prediction Captain: Sikandar Raza Vice-Captain: Shakib Al Hasan Suggested Playing XI for BAN vs ZIM Dream11 Fantasy Cricket: Wicketkeepers: Litton Das Batsmen: Craig Ervine, Afif Hossain, Wesley Madhevere, Soumya Sarkar All-rounders: Shakib Al Hasan, Sikandar Raza, Sean Williams Bowlers: Blessing Muzarabani, Richard Ngarava, Mustafizur Rahman BAN vs ZIM Probable Playing XI: Bangladesh Probable Playing Line-up: Soumya Sarkar, Nazmul Hossain Shanto, Afif Hossain, Mosaddek Hossain, Shakib Al Hasan (c), Mehidy Hasan Miraz, Litton Das, Nurul Hasan, Taskin Ahmed, Mustafizur Rahman, Hasan Mahmud Zimbabwe Probable Playing Line-up: Regis Chakabva, Sean Williams, Craig Ervine (c), Wesley Madhevere, Sikandar Raza, Milton Shumba, Ryan Burl, Tendai Chatara, Blessing Muzarabani, Richard Ngarava, Luke Jongwe","pubDate":"2022-10-29 17:46:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"‘I could not sleep, I could not eat’: Pakistan pace great Wasim Akram reveals he got addicted to cocaine after retirement","link":"https://www.tribuneindia.com/news/sports/i-could-not-sleep-i-could-not-eat-pakistan-pace-great-wasim-akram-reveals-he-got-addicted-to-cocaine-after-retirement-445649","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, October 29Pakistan pace great Wasim Akram has revealed he developed a cocaine addiction after his retirement from the game but quit following the death of his first wife in 2009.The 56-year-old has opened up about his dependency on cocaine in his upcoming autobiography 'Sultan: A Memoir'.Pakistan's leading wicket-taker in both Test and ODI cricket said he started to crave \"a substitute for the adrenaline rush of competition\" when he was travelling away from his first wife Huma.\"The culture of fame in south Asia is all consuming, seductive and corrupting. You can go to 10 parties a night, and some do. And it took its toll on me,\" Akram told the Times.\"It made me volatile. It made me deceptive. Huma, I know, was often lonely in this time... she would talk of her desire to move to Karachi, to be nearer her parents and siblings.\"I was reluctant. Why? Partly because I liked going to Karachi on my own, pretending it was work when it was actually about partying, often for days at a time.\"Widely regarded as one of the best bowlers of all times, Akram made his international debut in 1985, playing 104 Tests and 356 ODIs for Pakistan. He picked 414 Test wickets and 502 ODI wickets.\"Huma eventually found me out, discovering a packet of cocaine in my wallet... 'You need help.' I agreed. It was getting out of hand. I couldn't control it. One line would become two, two would become four; four would become a gram, a gram would become two. I could not sleep. I could not eat.\"I grew inattentive to my diabetes, which caused me headaches and mood swings. Like a lot of addicts, part of me welcomed discovery: the secrecy had been exhausting.\" Akram went for rehab but his experience with the doctor was all but pleasant, resulting in a relapse.\"The doctor was a complete con man, who worked primarily on manipulating families rather than treating patients, on separating relatives from money rather than users from drugs,\" he said.\"Try as I might, part of me was still smouldering inside about the indignity of what I'd been put through. My pride was hurt, and the lure of my lifestyle remained.\"I briefly contemplated divorce. I settled for heading to the 2009 ICC Champions Trophy where, out from under Huma's daily scrutiny, I started using again.\" However, the legendary pacer, who continues to take up commentary and coaching assignments around the world, said he eventually stopped after Huma's sudden death from a rare fungal infection in 2009.\"Huma's last selfless, unconscious act was curing me of my drug problem. That way of life was over, and I have never looked back,\" he added.","content":"PTI New Delhi, October 29 Pakistan pace great Wasim Akram has revealed he developed a cocaine addiction after his retirement from the game but quit following the death of his first wife in 2009. The 56-year-old has opened up about his dependency on cocaine in his upcoming autobiography ‘Sultan: A Memoir’. Pakistan’s leading wicket-taker in both Test and ODI cricket said he started to crave “a substitute for the adrenaline rush of competition” when he was travelling away from his first wife Huma. “The culture of fame in south Asia is all consuming, seductive and corrupting. You can go to 10 parties a night, and some do. And it took its toll on me,” Akram told the Times. “It made me volatile. It made me deceptive. Huma, I know, was often lonely in this time... she would talk of her desire to move to Karachi, to be nearer her parents and siblings. “I was reluctant. Why? Partly because I liked going to Karachi on my own, pretending it was work when it was actually about partying, often for days at a time.” Widely regarded as one of the best bowlers of all times, Akram made his international debut in 1985, playing 104 Tests and 356 ODIs for Pakistan. He picked 414 Test wickets and 502 ODI wickets. “Huma eventually found me out, discovering a packet of cocaine in my wallet... ‘You need help.’ I agreed. It was getting out of hand. I couldn’t control it. One line would become two, two would become four; four would become a gram, a gram would become two. I could not sleep. I could not eat. “I grew inattentive to my diabetes, which caused me headaches and mood swings. Like a lot of addicts, part of me welcomed discovery: the secrecy had been exhausting.” Akram went for rehab but his experience with the doctor was all but pleasant, resulting in a relapse. “The doctor was a complete con man, who worked primarily on manipulating families rather than treating patients, on separating relatives from money rather than users from drugs,” he said. “Try as I might, part of me was still smouldering inside about the indignity of what I’d been put through. My pride was hurt, and the lure of my lifestyle remained. “I briefly contemplated divorce. I settled for heading to the 2009 ICC Champions Trophy where, out from under Huma’s daily scrutiny, I started using again.” However, the legendary pacer, who continues to take up commentary and coaching assignments around the world, said he eventually stopped after Huma’s sudden death from a rare fungal infection in 2009. “Huma’s last selfless, unconscious act was curing me of my drug problem. That way of life was over, and I have never looked back,” he added.","pubDate":"2022-10-29 17:40:08","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_355494768.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: New Zealand Star's Awkward Injury While Fielding vs Sri Lanka In T20 World Cup Match - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvbmV3LXplYWxhbmQtc3RhcnMtYXdrd2FyZC1pbmp1cnktd2hpbGUtZmllbGRpbmctdnMtc3JpLWxhbmthLWluLXQyMC13b3JsZC1jdXAtbWF0Y2gtd2F0Y2gtMzQ3MjkyMtIBkgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvbmV3LXplYWxhbmQtc3RhcnMtYXdrd2FyZC1pbmp1cnktd2hpbGUtZmllbGRpbmctdnMtc3JpLWxhbmthLWluLXQyMC13b3JsZC1jdXAtbWF0Y2gtd2F0Y2gtMzQ3MjkyMi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: New Zealand Star's Awkward Injury While Fielding vs Sri Lanka In T20 World Cup Match  NDTV SportsCricbuzz Live: T20 WC | New Zealand v Sri Lanka, Match 27, Mid-innings show  CricbuzzNZ vs SL: Glenn Phillips BREAKS massive T20 World Cup record with ton vs Sri Lanka  Zee NewsT20 Time Out LIVE | T20 World Cup | New Zealand vs Sri Lanka  ESPNcricinfoLive Cricket Score: New Zealand vs Sri Lanka, T20 WC 2022, Match 27 | Cricbuzz.com  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-10-29 16:20:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Karbi Anglong, Charaideo win in RG Baruah Cricket","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/karbi-anglong-charaideo-win-in-rg-baruah-cricket-620801","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Karbi Anglong defeated Titabor by 33 runs in the RG Baruah Cricket at Amingaon Cricket ground here today.","content":"Our Sports Reporter GUWAHATI: Karbi Anglong defeated Titabor by 33 runs in the RG Baruah Cricket at Amingaon Cricket ground here today. In another game at the ACA Stadium, Guwahati, Charaideo defeated Bokakhat by 7 wickets. Brief scores: (Amingaon): Karbi Anglong 1st innings 81, Titabor 1st innings 117, Karbi Anglong 2nd innings 172, Udai Babu Roy 88, Ritupan Das 8-90, Titabor 2nd innings 103, Ritupan Das 35 no, Moksud Uddin 6-39. (ACA Stadium): Bokakhat 1st innings 101, Charaideo 1st innings 160, Bokakhat 2nd innings 88, Kaustubh Mahanta 4-28, Ziddan Ahmed 3-16, Charaideo 2nd innings 30-3, Akash Das 3-14. Also Read: Karimganj win against Tezpur in RG Baruah Cricket at Assam's Furkating Also watch:","pubDate":"2022-10-29 14:49:23","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/29/407590-cricke.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"'Ramiz Raja should resign; Babar is top batter but what's his contribution?' - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMixwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9yYW1pei1yYWphLXNob3VsZC1yZXNpZ24taW1tZWRpYXRlbHktYmFiYXItYXphbS1pcy10b3AtYmF0dGVyLWJ1dC13aGF0LXMtaGlzLWNvbnRyaWJ1dGlvbi1leC1wYWtpc3Rhbi1jcmlja2V0ZXItcy1zaWthbmRlci1iYWtodC1maWVyeS1yYW50LTEwMTY2NzA1MzQyOTgwNC5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Ramiz Raja should resign; Babar is top batter but what's his contribution?'  Hindustan TimesBabar Azam's Old \"Welcome Zimbaway\" Tweet Goes Viral, Fans Troll Pakistan Captain  NDTV SportsPak Vs Zim | Story Behind the Fake Mr Bean Explained | Pak PM Reacts to Zimbabwe President's Tweet  MIRROR NOWWatch: Shocking fan angle shows Afridi struggling to take second run vs Zimbabwe  Hindustan TimesMohammad Wasim Jr's Viral Picture Shows Why Cricket Needs 'Non-Striker Run-Out'  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-10-29 14:48:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Wasim Akram criticizes Babar Azam for not taking Shoaib Malik","link":"https://www.sentinelassam.com/sports/cricket/wasim-akram-criticizes-babar-azam-for-not-taking-shoaib-malik-620798","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Pakistan fast bowling legend Wasim Akram strongly criticised captain Babar Azam for not being \"intelligent enough\" with team selection","content":"NEW DELHI: Pakistan fast bowling legend Wasim Akram strongly criticised captain Babar Azam for not being \"intelligent enough\" with team selection and omitting veteran middle-order batter Shoaib Malik from Pakistan's squad for the ongoing Men's T20 World Cup in Australia. Pakistan's chances of reaching the semifinals of the T20 World Cup are now hanging by a thread after losing to Zimbabwe by one run in their second Super 12 match at Perth on Thursday. They had lost to India in their opening match. Their prolific opening pair of Azam and Mohammad Rizwan 'idn't fire and with 43 needed off 37 balls with seven wickets in hand, Pakistan's middle order crumbled in spectacular fashion to lose the match on the final ball of the innings. \"This is what I was talking about. As Waqar said, everyone has to sit down. Everyone from Pakistan from last year, including us, knew that the middle order is slightly weak. Now, this bloke is sitting here, Shoaib Malik. If I was the captain, what is my end goal as a skipper? It is to win the World Cup.\" \"I will go to any extent in selecting the team who can win you the World Cup. If I want Shoaib Malik in the middle-order, I will make sure that I convey that to the chairman of selectors otherwise I will say I am not captaining the side if I don't get my side,\" said Akram on the 'A Sports' Channel. Malik's last T20I appearance came in 2021 against Bangladesh and hasn't played a single match for Pakistan this year. \"Babar has to be more intelligent. This is not a gully cricket team where anybody comes into the team on the basis of preferences. I am just saying what I am hearing. If I was the selector, I would have kept Malik in the middle order on the very first day. It's Australia, it's not Sharjah, Dubai, or Pakistan that there will be dead wickets,\" added Akram. IANS Also Read: Pakistan skipper Babar Azam, Nawaz elated with middle-order's showing in Tri-series final Also watch:","pubDate":"2022-10-29 14:36:06","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/29/407587-akram-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Jhulan Goswami, Deepti Sharma felicitated by Cricket Association of Bengal","link":"https://www.indiatoday.in/sports/cricket/story/jhulan-goswami-deepti-sharma-felicitated-by-cricket-association-of-bengal-sourav-ganguly-showers-praise-2290945-2022-10-29?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Jhulan Goswami, Deepti Sharma felicitated by Cricket Association of Bengal","content":null,"pubDate":"2022-10-29 14:22:18","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Jhulan Goswami: Will decide about post-retirement plans after a break","link":"https://sportstar.thehindu.com/cricket/jhulan-goswami-post-retirement-plans-break-from-cricket/article66070083.ece","keywords":null,"creator":["\n        Y. B. Sarangi  \n    "],"video_url":null,"description":"Jhulan welcomed the Board of Control for Cricket in India (BCCI) decision to implement pay parity for men and women cricketers.","content":"Jhulan Goswami on Saturday said that she would like to take a break from cricket before thinking about her post-retirement plans. “Let me spend some time after my retirement. I have not thought about what to do,” said Jhulan, who retired from cricket last month following her 20-year-old international career. “The CAB has asked me to mentor the women’s team. This is something which I have not done before. The women’s Indian Premier League is coming. So, let’s see,” said Jhulan during a panel discussion after receiving a special award from former India captain Sourav Ganguly and the Cricket Association of Bengal (CAB) president Avishek Dalmiya at the association’s annual awards function here. Jhulan welcomed the Board of Control for Cricket in India (BCCI) decision to implement pay parity for men and women cricketers. Internationals Jhulan, Deepti Sharma and Richa Ghosh were handed special awards for their contribution to cricket. Uday Bhanu Banerjee and Gargi Banerjee (2019-20), Sambaran Banerjee and Lopamudra Bhattacharjee (2020-21) and Ashok Malhotra and Mithu Mukherjee (2021-22) were honoured with Kartick Bose lifetime achievement awards. Anustup Majumdar (2019-20) and Shahbaz Ahmed (2020-21 and 2021-22) got the best cricketer of the year award. Among others, Rumeli Dhar (2019-20 and 2021-22) and Parna Paul (2020-21) got the best woman cricketer of the year award. Read more stories on Cricket.","pubDate":"2022-10-29 14:00:16","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia-England clash washed out in Super 12 of Men's T20 World Cup","link":"https://www.sentinelassam.com/sports/cricket/australia-england-clash-washed-out-in-super-12-of-mens-t20-world-cup-620791","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The highly-anticipated Group 1 clash between Australia and England in Super 12 of Men’s T20 World Cup on Friday was washed out due to rain without a ball being bowled at the Melbourne Cricket Ground on Friday.","content":"SYDNEY: The highly-anticipated Group 1 clash between Australia and England in Super 12 of Men's T20 World Cup on Friday was washed out due to rain without a ball being bowled at the Melbourne Cricket Ground on Friday. Earlier in the day, another Group 1 match between Ireland and Afghanistan was also abandoned without a ball being bowled due to rain. Now, just like Afghanistan and Ireland split points, England and Australia will now share points from Friday's washout. The toss for the clash, which was supposed to be at 6:30pm Melbourne time, was delayed ahead of an inspection at 7.30pm local time. There were hopes that a truncated match would happen as covers were taken off, as the fans saw a glimmer of hope. But, with player safety being a priority and the outfield being visibly damp, umpires Chris Brown, Joel Wilson and Aleem Dar decided to have another inspection at 8:15pm. With conditions not changing much, a third inspection was scheduled later on. But just 20 minutes before the scheduled inspection would happen, rain returned and eventually led to the match being called off as captains Aaron Finch and Jos Buttler shook hands. Australia and England were awarded one point each and now join table-toppers New Zealand and second-placed Ireland on three points in the Group 1 points table. \"The outfield was drenched, it was as wet as I have ever seen it. I think the run-ups were an issue and the inner circle. It comes down to player safety. If you are trying to run out there, it was going to be a real issue,\" said Finch later on. The next match from Group 1 will be played between New Zealand and Sri Lanka on Saturday at the Sydney Cricket Ground, with the winner of the clash having a chance to be on top of Group 1. England's next match in the tournament will be against New Zealand at The Gabba in Brisbane on Tuesday, with Australia facing Ireland on Monday at the same venue. IANS Also Read: Spirited Zimbabwe stun Pakistan, snatch 1 run victory in ICC Men's T20 WC 2022 Super 12 match Also Watch:","pubDate":"2022-10-29 13:57:23","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/29/407579-rain.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IOL Sport Show: Temba Bavuma doesn’t select himself, so buck stops with Boucher, Mpitsang","link":"https://www.iol.co.za/sport/cricket/proteas/iol-sport-show-temba-bavuma-doesnt-select-himself-so-buck-stops-with-boucher-mpitsang-bf6b2c5a-94d5-4367-8dc9-d554ba1137ab","keywords":null,"creator":["Staff Reporter"],"video_url":null,"description":"IOL Sport senior cricket writer Zaahier Adams will be joined by SA U19 coach Shukri Conrad on the IOL Sport Show to analyse the Proteas’ T20 World Cup match against India on Sunday.","content":null,"pubDate":"2022-10-29 13:41:19","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/63fd9d5a-9f08-5a1a-bb71-a917dc7f5f37&operation=CROP&offset=0x102&resize=1708x961","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Abu Dhabi T10: New York Strikers' coach Carl Crowe banking on balanced squad","link":"https://www.sentinelassam.com/sports/cricket/abu-dhabi-t10-new-york-strikers-coach-carl-crowe-banking-on-balanced-squad-620787","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Coached by the former English cricketer Carl Crowe, the New York Strikers' squad in the Abu Dhabi T10 League has players such as Kieron Pollard and England's ODI winning World Cup captain Eoin Morgan.","content":"ABU DHABI: Coached by the former English cricketer Carl Crowe, the New York Strikers' squad in the Abu Dhabi T10 League has players such as Kieron Pollard and England's ODI winning World Cup captain Eoin Morgan. The team will be mentored by the Indian legend Yuvraj Singh, and are banking on their batting depth at the Abu Dhabi T10 this year. Speaking ahead of the season, coach Carl Crowe said, \"One of our goals during the draft was to pick a squad with huge depth batting wise so you can look at some of the names we bat all the way down the order to 8, 9, 10. Whichever combination we select, so we are happy with the depth rather than necessarily picking out one player.\" Come the season, the coach will have his task cut out in terms of planning and zeroing in on the playing combinations to make sure the team paints a clear picture of their ambitions. \"I think the beauty of our squad is a nice balance between youth and experience the likes of Pollard, Wahab, Eoin Morgan. These guys have got brilliant experience in the World Cup Finals in winning, winning important tournaments and playing in all kind of franchise tournaments. We have some nice young players like Tom Hartley and Izharulhaq Naveed who have experience in franchise tournaments and did well.\" Considered to be the fastest format in cricket, T10 shines the spotlight on the players' ability to get going from the very moment they take the field. \"You have to get going straightaway, and in practice you're also not easing into it. You have to bat or bowl like you'd do it in the game. One of the exciting bits in T10 for the fans, players and coaches is that the game moves very quickly and in practice it's essential to replicate that. But, also have to be calm inside your head, and that's where the coaches and the support staff have a big part to play, by making sure there is clarity about the roles, so players can produce the fast brand of cricket with a cool head.\" The New York Strikers are looking to make the kind of impact that is synonymous with the Big Apple, Team Owner Sagar Khanna is pretty clear about the franchise's plans. \"What attracted us to UAE is that we wanted to take a step forward from being a franchise owner in the US. So, it seemed to us that the Abu Dhabi T10 is a good platform and good stepping stone, especially since the UAE is the hub of franchise cricket,\" he said. IANS Also Read: T10 League In Abu Dhabi Gets Underway, Check Out The Schedule, Squads, Teams Also watch:","pubDate":"2022-10-29 13:32:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/29/407575-carl.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Chase, Brooks back in Windies test squad, Chanderpaul's son gets first call-up","link":"https://www.channelnewsasia.com/sport/cricket-chase-brooks-back-windies-test-squad-chanderpauls-son-gets-first-call-3032381","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-29 13:18:15","image_url":"https://onecms-res.cloudinary.com/image/upload/s--6lrsqZpm--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-10-29t131815z_1_lynxmpei9s04k_rtroptp_3_cricket-test-eng-win.jpg?itok=_XpgyAdy","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"T20 World Cup scenarios: England, Sri Lanka and Afghanistan cannot afford washouts - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3QyMC13b3JsZC1jdXAtMjAyMi1zY2VuYXJpb3MtZW5nbGFuZC1zcmktbGFua2EtYW5kLWFmZ2hhbmlzdGFuLWNhbm5vdC1hZmZvcmQtd2FzaG91dHMtMTM0MjI5NtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup scenarios: England, Sri Lanka and Afghanistan cannot afford washouts  ESPNcricinfoCricbuzz Live: T20 WC | New Zealand v Sri Lanka, Match 27, Mid-innings show  CricbuzzTrent Boult and Tim Southee are among the best bowling pairs across all three formats: Wasim Jaffer  CricTrackerMatch Preview - New Zealand vs Sri Lanka, ICC Men's T20 World Cup 2022/23, 27th Match, Group 1  ESPNcricinfoLive Cricket Score: New Zealand vs Sri Lanka, T20 WC 2022, Match 27 | Cricbuzz.com  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-10-29 13:01:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“The boys asked me to not take risks”: Glenn Phillips gives injury update after winning Man of the Match vs Sri Lanka in ICC T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-the-boys-asked-me-to-not-take-risks-glenn-phillips-gives-injury-update-after-winning-man-of-the-match-vs-sri-lanka-in-icc-t20-world-cup-2022/","keywords":["Cricket","Glenn Phillips","ICC T20 World Cup 2022","New Zealand vs Sri Lanka"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"New Zealand batter Glenn Phillips played a huge part in New Zealand’s incredible win over Sri Lanka by scoring an excellent century with the bat. However, while fielding, Phillips was not at all comfortable. He even limped off the field and Martin Guptill took his place as a substitute fielder. Phillips talked about his injury… The post “The boys asked me to not take risks”: Glenn Phillips gives injury update after winning Man of the Match vs Sri Lanka in ICC T20 World Cup 2022 appeared first on The SportsRush.","content":"New Zealand batter Glenn Phillips played a huge part in New Zealand’s incredible win over Sri Lanka by scoring an excellent century with the bat. However, while fielding, Phillips was not at all comfortable. He even limped off the field and Martin Guptill took his place as a substitute fielder. Phillips talked about his injury in the post-match conference. The Blackcaps continued their dominance in the T20 World Cup by securing a 65 runs victory over Sri Lanka at the Sydney Cricket Ground in Sydney. New Zealand defeated Australia at this very ground only in the opening match of the Super-12 stage. With this win, they have solidified their place at the top of the table. Batting first, the top-order of the side failed completely, and the Sri Lankan spinners took control. However, Glenn Phillips was in his mood today, and he played a blinder. On a track, where all the other batters were struggling, he managed to score 104 runs in 64 balls and led New Zealand to a score of 167-7. ALSO READ: Daryl Mitchell bows down to Glenn Phillips The Sri Lankan side never looked comfortable in the chase, and they lost their first four wickets for just 8 runs. They kept losing wickets and got all out for 102 runs in the end. New Zealand’s Trent Boult bowled an exceptional spell of 4-0-13-4. Glenn Phillips gives injury update after winning Man of the Match vs Sri Lanka Glenn Phillips won the Man of the Match trophy for his incredible knock in the match, and he also gave an injury update on the same. Martin Guptill came as a replacement for him while fielding and Phillips limped off the field during the match. However, Phillips has confirmed that it was just cramps. Phillips insists that he was cramping up a little after playing for so long, and the team asked him to not take any kind of risk and that’s why he decided to step out of the field. “I did cramp up a bit, lack of salts possibly there, the boys asked me not to take any further risks on limping away,” Glenn Phillips said after winning the Man of the Match trophy. Glenn Phillips praises ‘exceptional’ New Zealand bowlers Phillips also appreciated the performance of the Kiwi bowlers against Sri Lanka. He said that taking early wickets was very crucial on this track, and the way Trent Boult and Tim Southee bowled was incredible to watch. Phillips called it an exceptional performance by the bowlers. “They swung the new ball (Boult and Southee), the slower ones were holding onto the surface, getting early wickets was crucial and we managed to do that early. ​It was an exceptional performance by our bowlers and fielders,” Phillips added.   The post “The boys asked me to not take risks”: Glenn Phillips gives injury update after winning Man of the Match vs Sri Lanka in ICC T20 World Cup 2022 appeared first on The SportsRush.","pubDate":"2022-10-29 11:52:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Dinesh Karthik does special drills, Rishabh Pant bats like man possessed","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/indiat20-world-cup/t20-world-cup-dinesh-karthik-does-special-drills-rishabh-pant-bats-like-man-possessed/articleshow/95165720.cms","keywords":null,"creator":null,"video_url":null,"description":"At 37, Dinesh Karthik could well be playing his last ICC tournament, having been a part of the global event squad for the first time back in 2007. At 25, Rishabh Pant has years of top flight cricket left in him. He batted from start to finish during the nets but a place in the playing eleven still looks like a distant reality.","content":"KL Rahul might have failed in a couple of games but that's not a big enough \"sample size\" to drop him and include Rishabh Pant at the top of the order, India batting coach Vikram Rathour said on eve of the T20 World Cup match against South Africa on Sunday. Virat Kohli's innings against Pakistan was close to being a 'song of god', the literal translation of 'Bhagvad Gita', and has legitimised T20 cricket as an \"art form\", feels Australian legend Greg Chappell. Kagiso Rabada and Anrich Nortje are expected to spit fire on a track that will offer steep bounce as India's top-order gears up for its toughest test in adverse conditions against a top-notch South African side in T20 World Cup on Sunday.","pubDate":"2022-10-29 11:51:02","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Glenn Phillips plunders T20 World Cup century, stumbles from field with cramps in huge New Zealand win - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC90MjAtd29ybGQtY3VwLTIwMjItZ2xlbm4tcGhpbGxpcHMtY2VudHVyeS12aWRlby1uZXctemVhbGFuZC12LXNyaS1sYW5rYS1tYXRjaC1yZXN1bHQvMGJjNjc2OWEtNDU5ZC00MjQxLTg3ZmQtYmRhZmE0ZGUyMGQ10gFEaHR0cHM6Ly9hbXAubmluZS5jb20uYXUvYXJ0aWNsZS8wYmM2NzY5YS00NTlkLTQyNDEtODdmZC1iZGFmYTRkZTIwZDU?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Glenn Phillips plunders T20 World Cup century, stumbles from field with cramps in huge New Zealand win  Wide World of Sports‘Ridiculous’: Kiwi’s World Cup masterclass  news.com.auNZ star erupts in ‘unbelievable’ century as ‘big miss’ haunts ‘diabolical’ Sri Lanka  Fox SportsSprint start could be next T20 innovation  Mandurah MailPhillips ton makes Sri Lanka pay as Kiwis stay unbeaten  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-10-29 11:49:31","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Relive Glenn Phillips Century vs Sri Lanka In T20 WC: Full Highlights","link":"https://sports.ndtv.com/cricket/relive-glenn-phillips-century-vs-sri-lanka-in-t20-world-cup-full-highlights-3472213","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"New Zealand batter Glenn Phillips scored his second T20I century in the T20 World Cup game against Sri Lanka at the Sydney Cricket Ground on Saturday.","content":"New Zealand batter Glenn Phillips scored his second T20I century in the T20 World Cup game against Sri Lanka at the Sydney Cricket Ground on Saturday. Phillips crossed the 100-run mark in 61 balls, having hit Maheesh Theekshana for a four towards the midwicket region. He hit 10 fours and four sixes as New Zealand ended their innings with a strong total. He was eventually dismissed on 104 (64) by Lahiru Kumara , before New Zealand posted a total of 167/7 after electing to bat. A post shared by ICC (@icc) Talking about the match, New Zealand defeated Sri Lanka by 65 runs at Sydney Cricket Ground on Saturday to consolidate their top spot in Group 1 table of the Super-12 stage in the ongoing T20 World Cup. Glenn Phillips' century guided the Blackcaps to 167 for 7 despite the side being reduced to 15 for 3 at one stage. Phillips stitched an 84-run stand for the fourth wicket with Daryl Mitchell . The latter fell for 22 but Phillips kept playing his shots from the other end and raced to his second T20I century before being dismissed by Lahiru Kumara on the fourth ball of the last over of New Zealand innings. Promoted While defending the total, New Zealand bundled out Sri Lanka for 102 as Trent Boult returned figures of 4 for 13 and Mitchell Santner and Ish Sodhi scalped two wickets each. Meanwhile, Dasun Shanaka (35 off 32) and Bhanuka Rajapaksa (34 off 22) were the top run-scorers for Sri Lanka.","pubDate":"2022-10-29 11:49:13","image_url":"https://c.ndtvimg.com/2022-10/nslv0iu_glenn-phillips-afp_625x300_29_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Phillips ton drives New Zealand to Sri Lanka win after rocky start","link":"https://www.channelnewsasia.com/sport/cricket-phillips-ton-drives-new-zealand-sri-lanka-win-after-rocky-start-3032311","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide Best News Website or Mobile Service Digital Media Awards Worldwide SYDNEY -Glenn Phillips scored a brilliant century to rescue New Zealand after a rocky start and fire them to an emphatic 65-run victory on Saturday which sent the Black Caps clear at the top of Group 1 at the Twenty20 World Cup. The muscular righthander helped resurrect New Zealand's innings from three for 15 in the fourth over and departed for 104 with his team closing on their ultimate tally of 167 for seven. With paceman Trent Boult (4-13) to the fore, the New Zealand bowlers took over and gave Sri Lanka an even worse start, reducing the 2014 champions to 8-4 in the fourth over and dismissing them for 102 in the 20th. Tied with England, Australia and Ireland at the top of the rain-disrupted Super 12 group at the start of the evening, New Zealand moved two points clear of their rivals and improved their already impressive net run rate. \"When it comes to cricket, I try to entertain as much as possible whether it's for good or for bad..., thankfully, it was on the good end of things,\" said Phillips. \"But the way the bowlers bowled, the catches that were taken, we were high energy, we were exceptional all round.\" Sri Lanka will now need a remarkable run of results to grab one of the top two spots and a place in the semi-finals but a balmy spring evening at the Sydney Cricket Ground started well for the recent Asia Cup winners. Maheesh Theekshana foxed Finn Allen with a skidding delivery, off-spinner Dhananjaya de Silva deceived Devon Conway with flight and Kane Williamson nicked a Kasun Rajitha delivery to leave New Zealand in all sorts of trouble. With Daryl Mitchell, Phillips steadied the ship in an 84-run stand for the fourth wicket before the all-rounder was bowled for 22 by de Silva. Phillips, who was dropped on 12 and 45, was already in his stride and continued to thread his shots through the field for boundaries as New Zealand's expected score eased up from acceptable to respectable. The 25-year-old, who hit four sixes, roared with delight as he punched one of his 10 fours through square leg to become the second player to score a century in the tournament after South Africa's Rilee Rossouw at the same ground on Thursday. Sri Lanka were always going to struggle after Boult and Tim Southee had toppled their top order and once the third quick, Lockie Ferguson, had Bhanuka Rajapaksa caught at mid off for 34, the cause looked lost. Skipper Dasun Shanaka stood his ground with a defiant 35 but had little help from the tailenders and holed out to give Boult his fourth wicket. \"We started well but there were a few dropped catches,\" Shanaka said. \"We've still got a chance of qualifying if we can somehow get a couple of wins.\"","pubDate":"2022-10-29 11:41:51","image_url":null,"source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Bowler should be credited: Chappell calls for review of dead ball rule","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/bowler-should-be-credited-greg-chappell-calls-for-review-of-dead-ball-rule/articleshow/95165517.cms","keywords":null,"creator":null,"video_url":null,"description":"Australian great Greg Chappell has called for a review of the laws of cricket, saying if the ball beats the bat and hits the stumps during a free-hit it should be declared dead to credit the bowlers as the game is already tilted in the favour of batters.","content":null,"pubDate":"2022-10-29 11:40:43","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Alistair Campbell on Zimbabwe cricket, FTP, Sikandar Raza, and more","link":"https://sportstar.thehindu.com/cricket/t20-world-cup/alistair-campbell-interview-zimbabwe-cricket-pakistan-t20-world-cup/article66069345.ece","keywords":null,"creator":["\n        Ayan Acharya  \n    "],"video_url":null,"description":"Former captain Alistair Campell is chuffed to bits for Zimbabwe after its one-run defeat of Pakistan at the T20 World Cup. Sikandar Raza’s spell of bowling made the difference, he says. Campbell speaks about the health of cricket in Zimbabwe, the 1990s era, and more, in an interview.","content":"Pakistan’s 2022 T20 World Cup hopes suffered a major blow with a shock one-run defeat by Zimbabwe in Perth . An inspired performance from the Zimbabwean bowlers ensured Pakistan finished on 129 for 8, chasing 131 to win. And Alistair Campbell, a former Zimbabwe captain, is chuffed to bits for the team. Campbell, who played 60 Tests and 188 ODIs for Zimbabwe, had previously held the positions of director of international cricket and commercial affairs, chief selector and chairman of the cricket committee, during which time he helped oversee Zimbabwe’s return to Test cricket in 2011. He spoke to Sportstar about Zimbabwe’s famous one-run win over Pakistan at the T20 World Cup, and the potential road ahead for the team. Q. Did you watch the Zimbabwe-vs-Pakistan game, and what was your initial reaction? What were the turning points? A. I watched bits and pieces of the game. But mainly the last few overs. I think the turning point was Sikandar Raza’s wickets in the middle overs because it looked like Pakistan were on top of the game and were very much favourites to win at that point. In the end, the way Brad Evans held his nerve in the final over.... They hit the boundary, so they only needed four off four, and he was able to defend that. That’s no mean feat against a side like Pakistan. You’d back Pakistan any day of the week to chase down that total, but those wickets by Raza were the main turning point. Sikandar Raza has been in terrific form with bat and ball. What sets Raza apart from the others? His energy, skill level and generally his reading of the pressure situation in a game. That’s very crucial in so far as high-pressure games are concerned — to produce the right stuff at the right time. He has been in terrific form. His work ethic is unparalleled to make sure he has all the bowling skills and all the variations, but his impact batting has been outstanding in the year so far. We may not have seen much of it yet in this World Cup, apart from the first game against Ireland. That said, whenever he is on song with the bat, he will do very well. He is one of the leading all-rounders in the world now. You throw in his energy in the field, and you’ve got the most complete package in T20 cricket. Zimbabwe isn’t scheduled to play against Australia/India/England in the 2023-27 FTP. Do you think it's high time ICC addresses this imbalance? The imbalance in fixtures is always a talking point. Even when I was involved with Zimbabwe Cricket, going to ICC meetings, and trying to get those to play against Zimbabwe — India has been relatively forthcoming. If you see, over the years, there have been more games against India than Australia and, particularly, England, and that’s more political than anything else. Yes, I think it is high time it is dealt with, and there is more equality in terms of matches against ‘bigger’ teams, particularly in the shorter format. You got to start somewhere. I can understand if you are talking about Tests and ODIs, but it is very easy to organise a three-match ODI and three-match T20I series to get the ball rolling and ensure an interaction between lesser-ranked teams and higher-ranked teams. Playing against higher-caliber teams helps improve the skills of the players. The player pathway in Zimbabwe from first-class cricket and then to international cricket... is it a bit more well-defined now than it was a few years back? The player pathway is a lot more defined now. Zimbabwe’s struggles with finances and a few other bits and pieces are well documented. Now there is a much better system in place. We see some very good tournaments taking place at a decent standard. It’s well-funded, players have contracts and are getting paid — that’s starting to show. That said, it can be improved, particularly from school-boy level up to franchise teams — to make sure there is more cohesion in so far as what Zimbabwe Cricket’s policy is, what coaches and scouts are looking for, to make sure any talent there is, is captured at an early age and groomed all the way to come through the system. They could do well to get better coaches involved... ALSO READ - How coach Dave Houghton turned it around for Zimbabwe We have seen what Dave Houghton has done with the national side, and there are a lot of ex-players out there who could do wonders with franchise teams and cricket in general in Zimbabwe, so trying to coax them back would be a big bonus. There are also players plying their trade in England — and Zimbabwe cricket should try to entice them back and strengthen the state of local and franchise cricket as well as the national team. Are there enough young people taking up the game in Zimbabwe? Does it seem like it should be a lucrative option to make a career in cricket? There is a lot of enthusiasm for cricket amongst young people and supporters. You need to look at footage of a game played at the Harare Sports Club to see the level of noise and support. I have seen it while Zimbabwe has been doing well at this World Cup. People are talking about it on social media, gathering at local pubs and sports clubs. But in government schools, cricket is underfunded. It is an expensive sport — unlike football, where you just need a ball, and people can kick it around. With cricket, you need all equipment — which impedes getting more people involved. So, make sure it is better resourced, funded and better organised at the grassroots level, garnering enthusiasm and promoting it in a better way is the key. Would you say that the 1999-2003 team was the best side Zimbabwe ever had, with the likes of the Flower brothers, Heath Streak, yourself, Murray Goodwin, Neil Johnson, Olonga, and others? All players from past years like to think their era was the best (laughs). But yes, I would like to think that that’s the best team Zimbabwe has put out, and the results are there to see. I also think we played in a better era. There was the Australian team that was nearly invincible with Shane Warne, Glenn McGrath, Matthew Hayden, and Justin Langer to name a few. Pakistan had an outstanding fast-bowling attack. India had Sachin Tendulkar, Rahul Dravid, V. V. S. Laxman, and Javagal Srinath, so we were part of a very great era in terms of cricket. Of course, we just had the ODIs and Tests in those days. That era missed out on playing a lot of bilateral T20 cricket. But the current lot, particularly in the shorter format, is leading the way insofar as results are concerned... They win a couple more games, and suddenly they find themselves in the semifinal of a World Cup (smiles), which is something we never achieved. So, they are on the brink of greatness. Let’s hope they get the job done, and it does not get overwhelming. What were your feelings seeing a Zimbabwean team come together, like in 1999-2003, and then fall apart? Sad to see the team disintegrate and people move on. The politics of Zimbabwe at the time came into play. So, for non-cricket reasons, people left, and the team fell apart. I retired at 31, so when I look at what Raza is doing at 36 and Craig Ervine at 37, I feel I was just starting to get into my best cricket form at the time. So, it would’ve been nice to play on till 2006, or 07 because the players had started to gel as a unit... you still have those pangs of sadness and what could have been... But it is what it is. It could have been dealt with differently. But hindsight is a beautiful thing. When you look back at your Zimbabwe career, how will you describe how your career went? When I look back at my career, I think of the opportunities I gave away and think of a few more runs that I could've scored... and some situations that you would have dealt with a bit differently if you had them over again. I am saddened by the fact that I retired when I was 31. In your thirties, you are in your prime — you've learnt your lessons and gained all the experience, you are keen to put it into practice. I had a decent start, but towards the end, the politics took a toll on my performance. If I could have played for three-four years, I would've finished on a higher note than where I finished. That said, few people get the privilege of playing cricket for their country and I had the honour of playing with and against some of the greatest names in the game at some great venues. Read more stories on T20 World Cup.","pubDate":"2022-10-29 11:39:22","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs NED T20 2022 records: Pakistan vs Netherlands T20 head to head record and stats","link":"https://thesportsrush.com/cricket-news-pak-vs-ned-t20-2022-records-pakistan-vs-netherlands-t20-head-to-head-record-and-stats/","keywords":["Cricket","ICC T20 World Cup 2022","Netherlands","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Having faced each other in a three-match ODI series in Rotterdam just over a couple of months ago, Pakistan and Netherlands are all in readiness for resuming their T20I rivalry after as many as 13 years. The last and only time when these two teams had faced each other in the shortest format was during… The post PAK vs NED T20 2022 records: Pakistan vs Netherlands T20 head to head record and stats appeared first on The SportsRush.","content":"Having faced each other in a three-match ODI series in Rotterdam just over a couple of months ago, Pakistan and Netherlands are all in readiness for resuming their T20I rivalry after as many as 13 years. The last and only time when these two teams had faced each other in the shortest format was during ICC World Twenty20 2009. With wounds of an embarrassing loss against Zimbabwe still afresh, a dejected Pakistani squad will have no option than to return to the Perth Stadium in search of a maiden T20I victory in both ICC T20 World Cup 2022 and Australia. Only two Group 2 teams without a win in this World Cup, both Pakistan and Netherlands are struggling at the bottom of the points table on the back of two consecutive losses. While a losing streak will come to an end for one of these teams tomorrow, one of them will become the first team to lose three matches in this round. Pakistan vs Netherlands T20 head to head records Pakistan, who had lifted the trophy in what was only the second edition of T20 World Cup, had defeated Netherlands by 82 runs back in the day at Lord’s. In what remains Pakistan’s eighth-biggest T20I victory (by runs), it still is Netherlands’ fourth-biggest defeat in this format. Readers must note that no player part of the current squads had taken part in that match. Therefore, there aren’t any head-to-head player records for these two teams. Training underway for Sunday’s match #WeHaveWeWill | #T20WorldCup pic.twitter.com/86Klohezac — Pakistan Cricket (@TheRealPCB) October 29, 2022 As far as the innings total are concerned, Pakistan had bundled out Netherlands for 93 whilst defending a 176-run target in 2009. PAK vs NED T20 2022 records It is worth a mention that Pakistan and Netherlands haven’t played any T20I against each other this year. A three-match ODI series earlier this year had witnessed Pakistan registering a 3-0 victory. Overall, Pakistan have won all their seven white-ball matches against this opposition. The post PAK vs NED T20 2022 records: Pakistan vs Netherlands T20 head to head record and stats appeared first on The SportsRush.","pubDate":"2022-10-29 10:55:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Phillips dropped twice, blasts a CENTURY","link":"https://www.themercury.com.au/sport/cricket/phillips-dropped-twice-blasts-a-century/video/f3ebe102fbc0b1dadf3b38b1791047d3","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket World Cup: Glenn Phillips survived a few early drops to go on and blast his way to a sensational century for the New Zealand against Sri Lanka.","content":"Cricket World Cup: Glenn Phillips survived a few early drops to go on and blast his way to a sensational century for the New Zealand against Sri Lanka.","pubDate":"2022-10-29 10:36:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"New Zealand vs Sri Lanka Live Cricket Score, T20 World Cup 2022: Sri Lanka in deep trouble - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9uZXctemVhbGFuZC12cy1zcmktbGFua2EtbGl2ZS1jcmlja2V0LXNjb3JlLXQyMC13b3JsZC1jdXAtMjAyMi04MjM2NTQ1L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Sri Lanka Live Cricket Score, T20 World Cup 2022: Sri Lanka in deep trouble  The Indian ExpressNew Zealand vs Sri Lanka, Super 12: Preview  CricbuzzMatch Preview - New Zealand vs Sri Lanka, ICC Men's T20 World Cup 2022/23, 27th Match, Group 1  ESPNcricinfoLIVE New Zealand vs Sri Lanka Score: Boult On Fire, SL In Spot Of Bother  India.comCrunch clash looms between New Zealand and Sri Lanka | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-10-29 10:27:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-&#039;Nothing fancy&#039; in S Africa&#039;s plans to restrict India, says Nortje","link":"https://www.thestar.com.my/sport/cricket/2022/10/29/cricket-039nothing-fancy039-in-s-africa039s-plans-to-restrict-india-says-nortje","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - South Africa's pace attack will not attempt anything \"fancy\" against India's star-studded batting order in Sunday's T20 World Cup Super 12 match on what is expected to be a lively track in Perth, speedster Anrich Nortje said. Read full story","content":"MELBOURNE (Reuters) - South Africa's pace attack will not attempt anything \"fancy\" against India's star-studded batting order in Sunday's T20 World Cup Super 12 match on what is expected to be a lively track in Perth, speedster Anrich Nortje said. On a seamer-friendly surface at the Perth Stadium, South Africa would be tempted to unleash a four-pronged pace attack harnessing Lungi Ngidi and Marco Jansen with Nortje and Kagiso Rabada. Nortje said they would need to identify the ideal line and length early to contain the India batsmen in the Super 12 contest. \"I think what we've seen the last few games, it's been a really good wicket, lots of pace and bounce,\" the 28-year-old told a news conference. \"We're just going to ... identify what is a good length and a good line on the day and try and stick to that. \"Not try and do anything fancy ... Try and stick to our basics and sort of restrict - get as many wickets as possible, obviously, but restrict the runs as much as possible.\" Nortje called South Africa's pace attack \"one of the best\" and potent enough to unsettle any batting order. \"We have great variety. We cover a lot of aspects. We cover a lot of bases with our attack,\" he said. \"As a pace attack, we definitely back ourselves against any team to go out and do what we have to do on the day to try and get over the line.\" Inaugural champions India top Group 1 having won both their games looking largely settled except concerns over the form of opener KL Rahul who has scored four and nine so far. India's batting coach Vikram Rathour, however, ruled out replacing Rahul with Rishabh Pant, a change that would have introduced a left-hander in India's top order. \"Two games, I don't think that's a good enough sample size anyways,\" Rathour told reporters. \"He's been batting really well and he's batted really well in the practice games also. So we're not looking at any such thing at the moment.\" (Reporting by Amlan Chakraborty in New Delhi; editing by Robert Birsel)","pubDate":"2022-10-29 09:18:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/10/29/1796220.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-'Nothing fancy' in S Africa's plans to restrict India, says Nortje","link":"https://www.channelnewsasia.com/sport/cricket-nothing-fancy-s-africas-plans-restrict-india-says-nortje-3032226","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide Best News Website or Mobile Service Digital Media Awards Worldwide MELBOURNE : South Africa's pace attack will not attempt anything \"fancy\" against India's star-studded batting order in Sunday's T20 World Cup Super 12 match on what is expected to be a lively track in Perth, speedster Anrich Nortje said. On a seamer-friendly surface at the Perth Stadium, South Africa would be tempted to unleash a four-pronged pace attack harnessing Lungi Ngidi and Marco Jansen with Nortje and Kagiso Rabada. Nortje said they would need to identify the ideal line and length early to contain the India batsmen in the Super 12 contest. \"I think what we've seen the last few games, it's been a really good wicket, lots of pace and bounce,\" the 28-year-old told a news conference. \"We're just going to ... identify what is a good length and a good line on the day and try and stick to that. \"Not try and do anything fancy ... Try and stick to our basics and sort of restrict - get as many wickets as possible, obviously, but restrict the runs as much as possible.\" Nortje called South Africa's pace attack \"one of the best\" and potent enough to unsettle any batting order. \"We have great variety. We cover a lot of aspects. We cover a lot of bases with our attack,\" he said. \"As a pace attack, we definitely back ourselves against any team to go out and do what we have to do on the day to try and get over the line.\" Inaugural champions India top Group 1 having won both their games looking largely settled except concerns over the form of opener KL Rahul who has scored four and nine so far. India's batting coach Vikram Rathour, however, ruled out replacing Rahul with Rishabh Pant, a change that would have introduced a left-hander in India's top order. \"Two games, I don't think that's a good enough sample size anyways,\" Rathour told reporters. \"He's been batting really well and he's batted really well in the practice games also. So we're not looking at any such thing at the moment.\"","pubDate":"2022-10-29 09:10:57","image_url":"https://onecms-res.cloudinary.com/image/upload/s--bOZViUkM--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-10-29t093144z_2_lynxmpei9s037_rtroptp_3_cricket-t20worldcup-zaf-bgd.jpg?itok=671lnAXP","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Pakistan’s Rauf says focused on cricket, not criticism at T20 World Cup","link":"https://sportstar.thehindu.com/cricket/t20-world-cup/news/pakistan-haris-rauf-focused-on-cricket-not-criticism-t20-world-cup-2022/article66069084.ece","keywords":null,"creator":["\n        AFP  \n    "],"video_url":null,"description":"Pakistan will take on the Netherlands in Perth on Sunday to try and stay alive in the tournament after nailbiting one-run defeats to Zimbabwe and arch-rivals India.","content":"Pakistani fast bowler Haris Rauf on Saturday said the team was trying to shut out the noise and focus after a torrent of criticism over their shock loss to Zimbabwe at the Twenty20 World Cup. Pakistan will take on the Netherlands in Perth on Sunday to try and stay alive in the tournament after nail-biting one-run defeats to Zimbabwe and arch-rivals India. Former Pakistani stars including Shoaib Akhtar and Javed Miandad slammed the team for their poor start to the World Cup, describing their batting as “shameful” during the loss to Zimbabwe. “It is people’s job to talk, so they will talk. You face criticism in any sport you play,” Rauf told reporters. “We have come here to play a tournament and our focus is on that. So we try not to listen to them (ex-players and pundits) much and play our game. Even some positive talk can hurt you and negative talk can also hurt you.” Pakistan witnessed a special performance in its first match of the tournament from superstar batsman Virat Kohli as India chased down 160 on the final ball at a packed Melbourne Cricket Ground. But it was the second loss against the 11th-ranked Zimbabwe that stung its supporters more as the Pakistani batting lineup choked while chasing a modest 130. It ended a run short of Zimbabwe’s total, with two run-outs on the last two balls of the innings. ‘We have belief’ Rauf said despite the defeats, morale was high in the Pakistani camp. “We haven’t had the kind of start that we wanted. But the team morale is good,” the paceman said, adding that the games against Zimbabwe and India were close. “There is hurt but we have belief in each other’s abilities. We have bonded well, sat together and tried to address our mistakes,” he said. And while the Netherlands have also lost both their Super 12 matches, Rauf stressed that Pakistan will not be taking the challenge lightly. “There is no weak or strong team in a World Cup. Everyone playing an international game and has come to win the cup,” said Rauf. Netherlands coach Ryan Cook said Saturday his team was ready for the Pakistan clash. “We’ve obviously seen that Pakistan team is beatable, so that’s good to know,” said Cook. “Playing them in the World Super League not so long ago in the Netherlands has given us a lot of confidence because we came quite close in those matches. Hoping to get over the line this time.” Read more stories on News.","pubDate":"2022-10-29 09:09:16","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"'Virat Kohli is the most complete Indian batsman': Greg Chappell showers praise on batter after his epic knock vs Pakistan","link":"https://zeenews.india.com/cricket/ind-vs-sa-t20-world-cup-2022-the-most-complete-indian-batsman-greg-chappell-showers-praise-on-virat-kohli-after-his-epic-knock-vs-pakistan-2528044.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: Greg Chappell is might impressed with Virat Kohli, saying his knock against Pakistan legitimised T20 cricket, Read more here","content":null,"pubDate":"2022-10-29 08:56:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket World Cup live updates: Black Caps v Sri Lanka","link":"https://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=12561783&ref=rss","keywords":null,"creator":null,"video_url":null,"description":"All the action as the Black Caps take on Sri Lanka in the Cricket World Cup. ‌","content":null,"pubDate":"2022-10-29 08:30:00","image_url":null,"source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Virat Kohli's knock legitimized T20 cricket, says Greg Chappell","link":"https://www.indiatoday.in/sports/cricket/story/t20-world-cup-virat-kohlis-knock-legitimized-t20-cricket-says-australia-legend-greg-chappell-2290831-2022-10-29?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup: Virat Kohli's knock legitimized T20 cricket, says Greg Chappell","content":": Australia legend Greg Chappell has showered praise on India batter Virat Kohli for his match-winning knock against Pakistan, saying his innings legitimized T20 cricket. The 74-year-old went on to call Kohli the most complete Indian batsman of his time. Writing in a column for The Sydney Morning Herald, the former India coach lauded Kohli's heroic knock of 82 runs off 53 balls against Pakistan, saying Kohli legitimized T20 cricket as an art form. \"Ironically, it was also the innings that legitimized T20 cricket as, dare I say it, an art form, more than any that I have seen in the past 15 years. Nobody can dismiss T20 cricket as simply entertainment ever again. I can think of many of the best hitters in the modern game who could have pulled off a similar victory, and probably have, but none has ever done it with pure batting skills in the manner that Kohli did against Pakistan,\" wrote Chappell. The former Australia cricketer called Kohli the most complete Indian batsman of his time, saying only Tiger Pataudi came close to transcending a similar stratosphere. \"None of the greats of bygone eras could have dismembered an opponent so brutally without compromising the niceties of the art of batting than Kohli did last Sunday night. Kohli is the most complete Indian batsman of my time. Only the greatest of champions have the courage and the intelligence to transport their imagination beyond the mortal plane. Kohli has that. Perhaps only Tiger Pataudi has come close to transcending a similar stratosphere,\" Chappell added. Chappell also hailed the fans that filled up the Melbourne Cricket Stadium, saying this was the day T20 cricket came to maturity. \"This was the day that T20 cricket came to maturity, and the nail-biting game was played between two of the younger nations of the long form of the game in front of 90,000 rapturous fans, most of whom were thousands of miles from the land of their birth,\" Chappell wrote. After winning their opening two matches in the Super-12 stage in the ongoing ICC Men's T20 World Cup, Team India will turn their attention towards South Africa, who they face on October 30.","pubDate":"2022-10-29 08:20:17","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"\"I Love You Zimbabwe\": Fake Mr Bean Releases Statement After Pakistan's Defeat In T20 World Cup - NDTV","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5uZHR2LmNvbS9vZmZiZWF0L2ktbG92ZS15b3UtemltYmFid2UtZmFrZS1tci1iZWFuLXJlbGVhc2VzLXN0YXRlbWVudC1hZnRlci1wYWtpc3RhbnMtZGVmZWF0LWluLXQyMC13b3JsZC1jdXAtMzQ3MTY5MtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"I Love You Zimbabwe\": Fake Mr Bean Releases Statement After Pakistan's Defeat In T20 World Cup  NDTVCricket might not love Zimbabwe, but the game would be poorer without them  ESPNcricinfoIt will be difficult for Pakistan to make it to semi-finals: Roger Binny  Times of India\"India Not Tees Maar Khan Either, Will Be Back Home Next Week\": Shoaib Akhtar After Pakistan's Defeat To Zimbabwe | Cricket News  NDTV SportsIreland, Zimbabwe have great chance to qualify for semi-finals amongst lesser nations: Stuart Law  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-10-29 08:13:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}