{"newsArray":[{"title":"Babar Azam fully consulted in team selection: Chief Selector","link":"https://www.nation.com.pk/06-Apr-2023/babar-azam-fully-consulted-in-team-selection-chief-selector","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan cricket team chief selector, Haroon Rasheed has said that Babar Azam, the team’s captain, has been fully consulted and involved in the selection process, and everyone is on the same page.","content":"LAHORE - Pakistan cricket team chief selector, Haroon Rasheed has said that , the team’s captain, has been fully consulted and involved in the selection process, and everyone is on the same page. Chief Selector Haroon Rasheed said this while addressing a press conference here on Wednesday about the team’s selection process for the upcoming home tour of New Zealand. He clarified that there have been rumors regarding Babar Azam’s captaincy, but he has never discussed the matter with anyone. He emphasized that the team is looking forward to an exciting series against New Zealand and will not take any team lightly. Rasheed also spoke about the upcoming Asia Cup, World Cup, and T20 World Cup, which are scheduled for next year. “We are trying to finalize our team combination for the upcoming Asia Cup, World Cup and T20 World Cup and has only eight ODIs before the Asia Cup to assess the potential and talent of the players. Rasheed said that Haris Sohail is an exceptional left-hand batsman, and he can prove good in Asian conditions, and if he stays in form and fit, he can support the middle order. About Azam Khan, the chief selector said that the wicketkeeper batter himself has to see what the weakness is and work he needs to make a comeback. Azam Khan has had a hard time against the spinners which has to be worked on, if a player is dropped it does not mean he can’t make a comeback, he added. The chief selector said that Shadab Khan has played very little cricket and he has to be given a chance. “The doors are open for everyone, and the selection committee is considering 30 to 35 players for the team. Additionally, some of these players will be selected to play for Pakistan Shaheens.” Replying to a query about Muhammad Amir, Rasheed refuted media reports that a member of selection committee asked the left-arm pacer to be prepared for international comeback. “Why would selection committee contact anyone? We said on the first day that the selection door is open for everyone, now it is up to them how they perform. Then we will judge their performance,” he said. PAKISTAN SQUADS T20I: (captain), Shadab Khan (vice-captain), Faheem Ashraf, Fakhar Zaman, Haris Rauf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Rizwan, Naseem Shah, Saim Ayub, Shaheen Shah Afridi, Shan Masood and Zaman Khan. ODI: (captain), Shadab Khan (vice-captain), Abdullah Shafique, Fakhar Zaman, Haris Rauf, Haris Sohail, Ihsanullah, Imam-ul-Haq, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Salman Ali Agha, Shaheen Shah Afridi, Shan Masood and Usama Mir.","pubDate":"2023-04-06 00:00:35","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/babar-azam-fully-consulted-in-team-selection-chief-selector-1680739229-1702.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Mushfiqur ton, bowling attack give Bangladesh edge in Ireland Test","link":"https://www.nation.com.pk/06-Apr-2023/mushfiqur-ton-bowling-attack-give-bangladesh-edge-in-ireland-test","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Bangladeshi left-arm spin duo Shakib Al Hasan and Taijul Islam made quick work of Ireland’s top order on Wednesday to leave the tourists flailing at 27-4 on day two of their one-off Test in Dhaka.","content":"MIRPUR - Bangladeshi left-arm spin duo Shakib Al Hasan and Taijul Islam made quick work of Ireland’s top order on Wednesday to leave the tourists flailing at 27-4 on day two of their one-off Test in Dhaka. Mushfiqur Rahim’s knock of 126 put the hosts on the front foot after early wobbles in the first innings and the hosts were still 128 runs ahead at stumps. Andy McBrine claimed 6-118, becoming only the second Irish bowler to take five Test wickets, to help close out the first innings in the final session. But Ireland’s batsmen spoiled his party with four quick wickets before the day was done. Murray Commins (1), James McCollum (0), Andy Balbirnie (3) and Curtis Campher (1) wilted in front of Taijul and Shakib, who claimed 2-7 and 2-11 respectively. Herry Tector was batting on eight alongside Peter Moor, 10 not out at the end of play to leave Ireland staring at the prospect of an innings defeat. Bangladesh resumed on 34-2 and looked shaky after losing Mominul Haque, bowled round his legs for 17, in the third over of the morning. But Shakib and Mushfiqur turned up the aggression to quickly claw back the deficit with a 159-run partnership for the fourth wicket. Shakib was at his mercurial best until he chased a ball from McBrine wide outside the off stump to get a feather touch on the bat. He was caught behind after an impressive 14 fours from his 94-ball knock. Liton Das joined Mushfiqur to continue on the front foot, adding 87 runs for the fifth wicket. Mushfiqur finished his hundred from 135 balls with a four off Mark Adair before Ben White dismissed Liton for 43 runs. McBrine finally dispatched Mushfiqur — with Commins taking a fine diving catch at long-on — and cut short the tail with three wickets in three consecutive overs. Ireland have lost all three of their previous Tests since becoming a full member of the International Cricket Council in 2017.","pubDate":"2023-04-05 23:58:59","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/mushfiqur-ton-bowling-attack-give-bangladesh-edge-in-ireland-test-1680739110-6276.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Kiwis thrash Sri Lanka in second T20 to level series","link":"https://www.nation.com.pk/06-Apr-2023/kiwis-thrash-sri-lanka-in-second-t20-to-level-series","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"DUNEDIN - Adam Milne’s five-wicket haul and Tim Seifert’s unbeaten 79 set up New Zealand’s nine-wicket victory in the second T20I against Sri Lanka on Wednesday, with the match also earning female umpire Kim Cotton a place in history.","content":"DUNEDIN - Adam Milne’s five-wicket haul and Tim Seifert’s unbeaten 79 set up New Zealand’s nine-wicket victory in the second T20I against Sri Lanka on Wednesday, with the match also earning female umpire Kim Cotton a place in history. Seifert smashed six sixes in his 43-ball blitz as New Zealand romped home with 5.2 overs to spare to level the three-match series and gain a psychological edge ahead of Saturday’s decider in Queenstown. Auckland-born Cotton became the first female umpire to stand in a men’s international match between two International Cricket Council full-member countries. Earlier, Milne claimed a career-best 5-26 to help bowl out Sri Lanka for 141 in 19 overs, which proved belowpar at Dunedin’s University Oval, which has relatively short boundaries. Sri Lanka lost their openers cheaply and after Kusal Perera (35), Dhananjaya de Silva (37) and Charith Asalanka (24) shored them up the wheels came off their innings in the second half. Sri Lanka, who had won the opening match on Sunday via Super Over, lost their last eight wickets for 50 runs with Milne claiming three in the final over. New Zealand’s chase got off to a blazing start with Chad Bowes (31) hitting Dilshan Madushanka for four boundaries in the second over, including three in a row, throwing the seamer out of the attack. Seifert ensured there was no respite for the tourists even after Bowes fell as he tore into the Sri Lankan attack, sealing New Zealand’s victory with back-to-back sixes. Sri Lanka’s sloppy catching did not help their cause either as they dropped both Seifert and home captain Tom Latham, who remained unbeaten on 20.","pubDate":"2023-04-05 23:57:08","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/kiwis-thrash-sri-lanka-in-second-t20-to-level-series-1680739016-2384.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"MCC awards Muhammad Hafeez with Honorary Life Membership","link":"https://www.nation.com.pk/06-Apr-2023/mcc-awards-muhammad-hafeez-with-honorary-life-membership","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - Former Pakistan captain Mohammad Hafeez was named in the list of renowned men and women cricketers, awarded with honorary life membership by Marylebone Cricket Club (MCC) on Wednesday.","content":"LAHORE - Former Pakistan captain Mohammad Hafeez was named in the list of renowned men and women cricketers, awarded with honorary life membership by Marylebone Cricket Club (MCC) on Wednesday. Taking to Twitter, Hafeez expressed his gratitude to MCC for awarding him with honorary membership and acknowledging his services for the sport. “I would like to express my deepest gratitude to @MCCOfficial honouring life membership acknowledging my services to this beautiful game of cricket. Looking forward to meet new friends & add value as member of MCC,” wrote Hafeez. Besides Hafeez, England’s World Cup-winning captain Eoin Morgan and five Indian players including legendary skipper MS Dhoni were also acknowledged by the MCC.","pubDate":"2023-04-05 23:51:21","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"One more spot remaining for ICC World Cup Qualifier","link":"https://www.chronicle.co.zw/one-more-spot-remaining-for-icc-world-cup-qualifier/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ONLY one spot is remaining for the 2023 International Cricket Council (ICC) World Cup Qualifier after two teams, the United States of America (USA) and the United Arab Emirates (UAE) booked their berths in Zimbabwe for the June tournament. The two nations managed to reach the Qualifier stage after emerging victorious […]","content":"The Chronicle ONLY one spot is remaining for the 2023 International Cricket Council (ICC) World Cup Qualifier after two teams, the United States of America (USA) and the United Arab Emirates (UAE) booked their berths in Zimbabwe for the June tournament. The two nations managed to reach the Qualifier stage after emerging victorious in the World Cup Qualifier play-off that ended in Namibia yesterday. After their victories, only one team, coming from the Super League, remains to make it 10 nations. The USA won by 25 runs against Jersey in their final round-robin match, a win that capped a 4-1 tournament for them. Their only loss came against Canada and Namibia’s win over Canada in Windhoek on Tuesday ensuring that only UAE can equal the USA at 4-1 in round-robin play, guaranteeing them a top-two finish to advance to the qualifier in Zimbabwe. For UAE, yesterday’s match against Jersey was a dead rubber as they already owned the initial tournament tiebreaker over Namibia and Canada having beaten both teams head-to-head. Wins in head-to-head matches supersede net run rate as a tiebreaker if teams are level on points or round-robin play. After the two associate nations booked their places in the Qualifier, South Africa or Ireland will be coming to Zimbabwe to make it 10 teams as the two countries are still in contention for direct qualification. However, Ireland, who have a home series against Bangladesh next month will have to whitewash the Tigers to have a chance of direct contention. The Proteas sit in eighth place, but Ireland still has three One Day Internationals (ODIs) remaining against Bangladesh scheduled for May. Should Ireland win all three, they would be level with South Africa on points in which case net run rate would serve as the tiebreaker to decide which team clinches an automatic berth to the 2023 World Cup and which team falls back into the Qualifier in Zimbabwe. South Africa moved to eighth after their series win against the Netherlands saw them overtake the West Indies, effectively sending the Caribbean nation to the Qualifier. South Africa have 98 points, while the Irish are on 68 and a whitewash over Bangladesh in May will also take them to 98. USA, UAE, Scotland, Oman, Nepal, Netherlands, West Indies, Sri Lanka, and Zimbabwe are the nine teams confirmed to take part in the Qualifier. The Chevrons missed out on the previous edition of the World Cup in 2019 for the first time and will be hoping to make the most out of the home conditions and qualify for the global showpiece scheduled for India in October. – @brandon_malvin","pubDate":"2023-04-05 22:04:14","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"PNL takes Easter break","link":"https://www.herald.co.zw/pnl-takes-easter-break/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Ellina Mhlanga-Senior Sports Reporter THE Premier Netball League will have an extended break following the postponement of this weekend’s matches to April 15. The league got underway last month, and matches are played after every two weeks in clusters. So far, they have played two round of matches and the third round of matches was […]","content":"Eddie Chikamhi-Senior Sports Reporter DOMESTIC football giants Highlanders and Dynamos will set the stage alight again this year when they clash in the Independence Trophy in a landmark outing in Mashonaland Central where this year’s celebrations will be held for the first time in history. Government announced that the cup final will take place in […] Tadious Manyepo-Sports Reporter DYNAMOS coach Herbert “Jompano”Maruwa is sweating over the fitness of some of his key players who are in a race against time to recover before the giants’ Castle Lager Premier Soccer League tie against Cranborne Bullets at the National Sports Stadium on Easter Monday. The Harare giants have started the league brightly […] Eddie Chikamhi-Senior Sports Reporter TWO former world champions West Indies and Sri Lanka are set to headline the cast during the ICC Men’s Cricket World Cup qualifier to be held in Zimbabwe in June. The two cricket powerhouses were confirmed to be among the 10 nations to converge in Harare and Bulawayo in two […]","pubDate":"2023-04-05 22:02:59","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Why are the Rajasthan Royals playing in Guwahati in IPL 2023?","link":"https://www.sportskeeda.com/cricket/news-why-rajasthan-royals-playing-guwahati-ipl-2023","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-04-05 17:08:42","image_url":"https://staticc.sportskeeda.com/editor/2023/04/29064-16806984717443-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"RR vs PBKS Live Score | IPL 2023: राजस्थान को लगा तीसरा झटका, बटलर 19 रन बनाकर आउट","link":"https://sports.ndtv.com/hindi/cricket/rr-vs-pbks-live-score-ipl-2023-rajasthan-royals-vs-punjab-kings-live-8th-match-3923092#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RR vs PBKS Live Score: राजस्थान रॉयल्स के शुरुआत के 6 ओवर में ही तीन बल्लेबाज़ पवेलियन जा चुके हैं, जिसके बाद राजस्थान मुश्किल में नज़र आ रही है.","content":"RR vs PBKS Live Score | IPL 2023: 198 रनों के लक्ष्य का पीछा करने उतरी राजस्थान रॉयल्स के लिए ये मुकाबला आसान नहीं लग रहा है, शुरू के 6 ओवरों में ही तीन विकेट गवाने के बाद राजस्थान मुश्किल में नज़र आ रही है.राजस्थान रॉयल्स vs पंजाब किंग्स लाइव स्कोरबोर्डराजस्थान रॉयल्स प्लेइंग XI: यशस्वी जायसवाल, जोस बटलर, संजू सैमसन (w/c), देवदत्त पडिक्कल, रियान पराग, शिमरोन हेटमायर, जेसन होल्डर, रविचंद्रन अश्विन, ट्रेंट बोल्ट, केएम आसिफ, युजवेंद्र चहलपंजाब किंग्स प्लेइंग XI:शिखर धवन (c), प्रभसिमरन सिंह (w), भानुका राजपक्षे, जितेश शर्मा, शाहरुख खान, सैम क्यूरन, सिकंदर रजा, नाथन एलिस, हरप्रीत बराड़, राहुल चाहर, अर्शदीप सिंहराजस्थान रॉयल्स को यशसवी जायसवाल के रूप में पहला झटका लगा. ओपनर  बल्लेबाज़ यशसवी मात्र 11 रन बनाकर आउट हो गए. उसके बाद यशसवी के साथ ओपनिंग करने आये अश्विन बिना खाता खोले पवेलियन लौट गए. पंजाब किंग्स ने राजस्थान रॉयल्स के खिलाफ चार विकेट पर 197 रन बनाए. पंजाब किंग्स की ओर से कप्तान शिखर धवन ने नाबाद 86 जबकि प्रभसिमरन सिंह ने 60 रन बनाए. रॉयल्स की तरफ से जेसन होल्डर ने दो विकेट चटकाए.पंजाब किंग्स ने राजस्थान रॉयल्स के खिलाफ अपना तीन विकेट गवां दिया है. प्रभसिमरन ने (60 ) जितेश शर्मा ने (27) और सिकंदर रजा ने (1) रन बनाये. भानुका राजपक्षे के रिटायर्ड हर्ट होने के बाद बल्लेबाज़ी करने आये जितेश शर्मा ने भी आते ही तेज़ खेलना शुरू कर दिया लेकिन अपनी पारी को बड़ा रूप नहीं दे सके और मात्र 27 रन बनाकर पवेलियन लौट गए. प्रभसिमरन सिंह क्वे बाद शिखर धवन ने भी तूफानी अंदाज़ में बल्लेबाज़ी करते हुए 36 गेंदों में अपना अर्धशतक पूरा कर लिया. राजस्थान रॉयल्स ने पंजाब किंग्स के खिलाफ टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. राजस्थान रॉयल्स और पंजाब किंग्स दोनों ने अपनी प्लेइंग 11 में कोई बदलाव नहीं किया है.पंजाब किंग्स को एक ठोस शुरुआत दिलाते हुए धवन और प्रभसिमरन सिंह ने शानदार बल्लेबाज़ी की. प्रभसिमरन ने धमाकेदार अंदाज़ में अर्धशतक भी पूरा किया लेकिन होल्डर की गेंद पर जोस बटलर को कैच थमा बैठे और अपना विकेट गवां बैठे. प्रभसिमरन सिंह के आउट होने के बाद राजपक्षे नॉन स्ट्राइकर एन्ड पर खड़े थे, धवन ने शॉट खेला और गेंद राजपक्षे के हाथ पर जा लगी और वो रिटायर्ड हर्ट हो गए जिसके बाद उन्हें मैदान से बाहर जाना पड़ा. आईपीएल 2023 में आज का इकलौता मुकाबला राजस्थान रॉयल्स (RR) बनाम पंजाब किंग्स (PBKS) के बीच गुवाहाटी के बरसापारा स्टेडियम में खेला जा रहा है. इस सीजन में दोनों ही टीमों ने अब तक एक-एक मुकाबला खेला है और दोनों ही टीमों ने जीत भी दर्ज की हैं. पंजाब किंग्स ने कोलकाता के खिलाफ डीएलएस प्रक्रिया के तहत 7 रनों से मुकाबला जीता था, तो वहीं राजस्थान की टीम ने सनराइजर्स हैदराबाद के खिलाफ 72 रनों से धमाकेदार जीत हासिल की थी. राजस्थान की टीम के ओपनिंग बल्लेबाज यशस्वी जयसवाल और जोस बटलर के साथ-साथ कप्तान संजू सैमसन ने भी हैदराबाद के खिलाफ शानदार अर्धशतकीय पारी खेली थी. वहीं, पंजाब किंग्स के तरफ से अर्शदीप सिंह ने अपनी धारदार गेंदबाज़ी से कोलकाता के खिलाफ कहर बरपाया था. दोनों ही टीमें खुद में संतुलित है, जिससे रोमांचक मुकाबले की उम्मीद है.Rajasthan Royals vs Punjab Kings, 8th Match - Live Cricket Score, Commentary From Barsapara Cricket Stadium, Guwahati.","pubDate":"2023-04-05 16:57:53","image_url":"https://c.ndtvimg.com/2023-04/ntulou7o_shikhar-dhawan-bcci_625x300_05_April_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: \"इस फैसले ने कोहली को सहज और खुश बना दिया\", एबीडि विलियर्स का बड़ा बयान","link":"https://sports.ndtv.com/hindi/cricket/ipl-2023-this-decision-has-has-made-virat-kohli-comfortable-ab-de-villiers-makes-big-statement-3923905#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: सभी ने देखा है कि विराट कोहली (Virat Kohli) ने आरसीबी के लिए कैसी शुरुआत की है. और यह बात मैनेजमेंट और फैंस दोनों को बहुत ही भरोसा देता है","content":"दक्षिण अफ्रीका के पूर्व कप्तान और रॉयल चैलेंजर्स बेंगलूर (RCB) के पूर्व दिग्गज खिलाड़ी एबीडिविलियर्स का कहना है कि विराट कोहली (Virat Kohli) इंडियन प्रीमियर लीग (IPL 2023) फ्रेंचाइजी और राष्ट्रीय टीम के कप्तान की भूमिका छोड़ने के बाद इस सत्र में तनावमुक्त और खुश नजर आ रहे हैं. आईपीएल 2023 के पहले मैच में नाबाद 82 रन की पारी खेलकर अपनी टीम को जीत दिलाने वाले कोहली 2021 सत्र के बाद आरसीबी की कप्तानी से हट गए और लगभग उसी समय उन्होंने सभी प्रारूपों में राष्ट्रीय टीम की कप्तानी भी छोड़ी. कोहली की बल्लेबाजी के संदर्भ में डिविलियर्स ने मीडिया से कहा, \"मैंने ज्यादा बदलाव नहीं देखा है. सब कुछ पहले जैसा है. तकनीक ठोस दिखती है, उसे क्रीज पर अच्छा संतुलन मिला है. उसमें अब भी काफी ऊर्जा है. मुझे बस यही लगता है कि इस सीजन में वह काफी तरो-ताजा दिख रहा है. मैंने उसके कुछ साक्षात्कार देखे हैं जहां वह पहले से कहीं ज्यादा हंस रहा था.\"SPECIAL STORIES:प्रभसिमरन सिंह ने दिखायी \"पावर\", यह गजब X फैक्टर टीम इंडिया के लिए बहुत ही काम काआईपीएल में इस सीजन में फैंटेसी गेम्स कंपनियों पर पैसा बरसेगा छप्पर फाड़ के, कमाएंगी इतनी रकमगुजरात ओपनर गिल की ICC odi Ranking में बड़ी उपलब्धि, कुछ ऐसे बोला है हालिया समय में बल्लापूर्व दिग्गज ने कहा, \"मुझे लगता है कि पिछले सत्र में कप्तानी छोड़ने से उसे सहज होने में काफी मदद मिली. वह एक शानदार कप्तान थे, लेकिन उन्होंने अंतरराष्ट्रीय स्तर पर और आईपीएल में भी लंबे समय तक ऐसा किया जो चुनौतीपूर्ण हो सकता है. आपको आराम करने या परिवार के साथ बिताने या कुछ दोस्तों के साथ हंसी-मजाक करने का समय नहीं मिलता है. मुझे लगता है कि इस सत्र के लिए उनका यही मंत्र है, बस मौज-मस्ती करना, मुस्कुराते रहना.\"डिविलियर्स ने कहा, ‘जब वह लुत्फ उठा रहा होता है तो नैसर्गिक प्रतिभा हावी हो जाती है और वह आसानी से रन बनाता है जो उसने पहले मैच में किया. मुझे लगता है कि अभी सर्वश्रेष्ठ आना बाकी है और हमें कुछ आतिशबाजी बल्लेबाजी देखने को मिलेगी.\" डिविलियर्स ने भारत और मुंबई इंडियंस के बल्लेबाज सूर्यकुमार यादव का बचाव किया जिनके फॉर्म में अचानक गिरावट दिखी है. उन्हें सूर्यकुमार को सलाह दी कि अतीत में जो काम किया है उस पर ध्यान केंद्रित करें.उन्होंने कहा, ‘‘वह शायद अब उस चरण में है जहां उसे कुछ करने की जरूरत है, लेकिन इसका राज यह है कि घबराएं नहीं और अपना रणनीति नहीं बदलें. वर्षों से जो उसके लिए काम कर रहा है, उसे उसी पर टिके रहना होगा. हां, वह कोशिश कर सकता है और याद रख सकता है कि ‘मेरे बेसिक्स क्या हैं' या ‘जब मैं लगातार रन बना रहा था तो मैंने क्या अच्छा किया' क्योंकि जाहिर है कि वह अपने खेल को पूरी तरह से अलग स्तर पर ले गया था.\"--- ये भी पढ़ें ---* IPL 2023: दिल्ली की लगातार 2 हार ने बदला Points Table का समीकरण, अब यह टीम टॉप पर, जानें पर्पल कैप और ऑरेंज कैप किसके पास है.. * IPL 2023: हार्दिक पंड्या ने 'किलर मिलर' के साथ की ऐसी हरकत, देख फूटा फूटा फैन्स का गुस्सा, लोगों ने दे डाली ऐसी नसीहत स्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-04-05 16:43:15","image_url":"https://c.ndtvimg.com/2023-04/4t5vdtpg_virat-kohli_625x300_02_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Canadian cricketers regain one-day international status at Namibia qualifier","link":"https://www.nsnews.com/national-sports/canadian-cricketers-regain-one-day-international-status-at-namibia-qualifier-6812628","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"WINDHOEK, Namibia — Pargat Singh led the batting attack with 66 runs and bowler Jeremy Gordon took six wickets as Canada wrapped up play Wednesday at the ICC Cricket World Cup Qualifier Playoff with a 90-run victory over winless Papua New Guinea Whil","content":null,"pubDate":"2023-04-05 16:03:31","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/04/20230405100444-25dfec17a4b2864aefb70ee4d5038b90ae7ff88ba1b37d2f9a8651cc2d582f86.jpg;w=960","source_id":"nsnews","category":["sports"],"country":["canada"],"language":"english"},{"title":"Babar Azam fully consulted in team selection: Chief Selector","link":"https://www.nation.com.pk/06-Apr-2023/babar-azam-fully-consulted-in-team-selection-chief-selector","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan cricket team chief selector, Haroon Rasheed has said that Babar Azam, the team’s captain, has been fully consulted and involved in the selection process, and everyone is on the same page.","content":"LAHORE - Pakistan cricket team chief selector, Haroon Rasheed has said that , the team’s captain, has been fully consulted and involved in the selection process, and everyone is on the same page. Chief Selector Haroon Rasheed said this while addressing a press conference here on Wednesday about the team’s selection process for the upcoming home tour of New Zealand. He clarified that there have been rumors regarding Babar Azam’s captaincy, but he has never discussed the matter with anyone. He emphasized that the team is looking forward to an exciting series against New Zealand and will not take any team lightly. Rasheed also spoke about the upcoming Asia Cup, World Cup, and T20 World Cup, which are scheduled for next year. “We are trying to finalize our team combination for the upcoming Asia Cup, World Cup and T20 World Cup and has only eight ODIs before the Asia Cup to assess the potential and talent of the players. Rasheed said that Haris Sohail is an exceptional left-hand batsman, and he can prove good in Asian conditions, and if he stays in form and fit, he can support the middle order. About Azam Khan, the chief selector said that the wicketkeeper batter himself has to see what the weakness is and work he needs to make a comeback. Azam Khan has had a hard time against the spinners which has to be worked on, if a player is dropped it does not mean he can’t make a comeback, he added. The chief selector said that Shadab Khan has played very little cricket and he has to be given a chance. “The doors are open for everyone, and the selection committee is considering 30 to 35 players for the team. Additionally, some of these players will be selected to play for Pakistan Shaheens.” Replying to a query about Muhammad Amir, Rasheed refuted media reports that a member of selection committee asked the left-arm pacer to be prepared for international comeback. “Why would selection committee contact anyone? We said on the first day that the selection door is open for everyone, now it is up to them how they perform. Then we will judge their performance,” he said. PAKISTAN SQUADS T20I: (captain), Shadab Khan (vice-captain), Faheem Ashraf, Fakhar Zaman, Haris Rauf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Rizwan, Naseem Shah, Saim Ayub, Shaheen Shah Afridi, Shan Masood and Zaman Khan. ODI: (captain), Shadab Khan (vice-captain), Abdullah Shafique, Fakhar Zaman, Haris Rauf, Haris Sohail, Ihsanullah, Imam-ul-Haq, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Salman Ali Agha, Shaheen Shah Afridi, Shan Masood and Usama Mir.","pubDate":"2023-04-06 00:00:35","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/babar-azam-fully-consulted-in-team-selection-chief-selector-1680739229-1702.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Mushfiqur ton, bowling attack give Bangladesh edge in Ireland Test","link":"https://www.nation.com.pk/06-Apr-2023/mushfiqur-ton-bowling-attack-give-bangladesh-edge-in-ireland-test","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Bangladeshi left-arm spin duo Shakib Al Hasan and Taijul Islam made quick work of Ireland’s top order on Wednesday to leave the tourists flailing at 27-4 on day two of their one-off Test in Dhaka.","content":"MIRPUR - Bangladeshi left-arm spin duo Shakib Al Hasan and Taijul Islam made quick work of Ireland’s top order on Wednesday to leave the tourists flailing at 27-4 on day two of their one-off Test in Dhaka. Mushfiqur Rahim’s knock of 126 put the hosts on the front foot after early wobbles in the first innings and the hosts were still 128 runs ahead at stumps. Andy McBrine claimed 6-118, becoming only the second Irish bowler to take five Test wickets, to help close out the first innings in the final session. But Ireland’s batsmen spoiled his party with four quick wickets before the day was done. Murray Commins (1), James McCollum (0), Andy Balbirnie (3) and Curtis Campher (1) wilted in front of Taijul and Shakib, who claimed 2-7 and 2-11 respectively. Herry Tector was batting on eight alongside Peter Moor, 10 not out at the end of play to leave Ireland staring at the prospect of an innings defeat. Bangladesh resumed on 34-2 and looked shaky after losing Mominul Haque, bowled round his legs for 17, in the third over of the morning. But Shakib and Mushfiqur turned up the aggression to quickly claw back the deficit with a 159-run partnership for the fourth wicket. Shakib was at his mercurial best until he chased a ball from McBrine wide outside the off stump to get a feather touch on the bat. He was caught behind after an impressive 14 fours from his 94-ball knock. Liton Das joined Mushfiqur to continue on the front foot, adding 87 runs for the fifth wicket. Mushfiqur finished his hundred from 135 balls with a four off Mark Adair before Ben White dismissed Liton for 43 runs. McBrine finally dispatched Mushfiqur — with Commins taking a fine diving catch at long-on — and cut short the tail with three wickets in three consecutive overs. Ireland have lost all three of their previous Tests since becoming a full member of the International Cricket Council in 2017.","pubDate":"2023-04-05 23:58:59","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/mushfiqur-ton-bowling-attack-give-bangladesh-edge-in-ireland-test-1680739110-6276.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Kiwis thrash Sri Lanka in second T20 to level series","link":"https://www.nation.com.pk/06-Apr-2023/kiwis-thrash-sri-lanka-in-second-t20-to-level-series","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"DUNEDIN - Adam Milne’s five-wicket haul and Tim Seifert’s unbeaten 79 set up New Zealand’s nine-wicket victory in the second T20I against Sri Lanka on Wednesday, with the match also earning female umpire Kim Cotton a place in history.","content":"DUNEDIN - Adam Milne’s five-wicket haul and Tim Seifert’s unbeaten 79 set up New Zealand’s nine-wicket victory in the second T20I against Sri Lanka on Wednesday, with the match also earning female umpire Kim Cotton a place in history. Seifert smashed six sixes in his 43-ball blitz as New Zealand romped home with 5.2 overs to spare to level the three-match series and gain a psychological edge ahead of Saturday’s decider in Queenstown. Auckland-born Cotton became the first female umpire to stand in a men’s international match between two International Cricket Council full-member countries. Earlier, Milne claimed a career-best 5-26 to help bowl out Sri Lanka for 141 in 19 overs, which proved belowpar at Dunedin’s University Oval, which has relatively short boundaries. Sri Lanka lost their openers cheaply and after Kusal Perera (35), Dhananjaya de Silva (37) and Charith Asalanka (24) shored them up the wheels came off their innings in the second half. Sri Lanka, who had won the opening match on Sunday via Super Over, lost their last eight wickets for 50 runs with Milne claiming three in the final over. New Zealand’s chase got off to a blazing start with Chad Bowes (31) hitting Dilshan Madushanka for four boundaries in the second over, including three in a row, throwing the seamer out of the attack. Seifert ensured there was no respite for the tourists even after Bowes fell as he tore into the Sri Lankan attack, sealing New Zealand’s victory with back-to-back sixes. Sri Lanka’s sloppy catching did not help their cause either as they dropped both Seifert and home captain Tom Latham, who remained unbeaten on 20.","pubDate":"2023-04-05 23:57:08","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/kiwis-thrash-sri-lanka-in-second-t20-to-level-series-1680739016-2384.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"MCC awards Muhammad Hafeez with Honorary Life Membership","link":"https://www.nation.com.pk/06-Apr-2023/mcc-awards-muhammad-hafeez-with-honorary-life-membership","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - Former Pakistan captain Mohammad Hafeez was named in the list of renowned men and women cricketers, awarded with honorary life membership by Marylebone Cricket Club (MCC) on Wednesday.","content":"LAHORE - Former Pakistan captain Mohammad Hafeez was named in the list of renowned men and women cricketers, awarded with honorary life membership by Marylebone Cricket Club (MCC) on Wednesday. Taking to Twitter, Hafeez expressed his gratitude to MCC for awarding him with honorary membership and acknowledging his services for the sport. “I would like to express my deepest gratitude to @MCCOfficial honouring life membership acknowledging my services to this beautiful game of cricket. Looking forward to meet new friends & add value as member of MCC,” wrote Hafeez. Besides Hafeez, England’s World Cup-winning captain Eoin Morgan and five Indian players including legendary skipper MS Dhoni were also acknowledged by the MCC.","pubDate":"2023-04-05 23:51:21","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"One more spot remaining for ICC World Cup Qualifier","link":"https://www.chronicle.co.zw/one-more-spot-remaining-for-icc-world-cup-qualifier/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ONLY one spot is remaining for the 2023 International Cricket Council (ICC) World Cup Qualifier after two teams, the United States of America (USA) and the United Arab Emirates (UAE) booked their berths in Zimbabwe for the June tournament. The two nations managed to reach the Qualifier stage after emerging victorious […]","content":"The Chronicle ONLY one spot is remaining for the 2023 International Cricket Council (ICC) World Cup Qualifier after two teams, the United States of America (USA) and the United Arab Emirates (UAE) booked their berths in Zimbabwe for the June tournament. The two nations managed to reach the Qualifier stage after emerging victorious in the World Cup Qualifier play-off that ended in Namibia yesterday. After their victories, only one team, coming from the Super League, remains to make it 10 nations. The USA won by 25 runs against Jersey in their final round-robin match, a win that capped a 4-1 tournament for them. Their only loss came against Canada and Namibia’s win over Canada in Windhoek on Tuesday ensuring that only UAE can equal the USA at 4-1 in round-robin play, guaranteeing them a top-two finish to advance to the qualifier in Zimbabwe. For UAE, yesterday’s match against Jersey was a dead rubber as they already owned the initial tournament tiebreaker over Namibia and Canada having beaten both teams head-to-head. Wins in head-to-head matches supersede net run rate as a tiebreaker if teams are level on points or round-robin play. After the two associate nations booked their places in the Qualifier, South Africa or Ireland will be coming to Zimbabwe to make it 10 teams as the two countries are still in contention for direct qualification. However, Ireland, who have a home series against Bangladesh next month will have to whitewash the Tigers to have a chance of direct contention. The Proteas sit in eighth place, but Ireland still has three One Day Internationals (ODIs) remaining against Bangladesh scheduled for May. Should Ireland win all three, they would be level with South Africa on points in which case net run rate would serve as the tiebreaker to decide which team clinches an automatic berth to the 2023 World Cup and which team falls back into the Qualifier in Zimbabwe. South Africa moved to eighth after their series win against the Netherlands saw them overtake the West Indies, effectively sending the Caribbean nation to the Qualifier. South Africa have 98 points, while the Irish are on 68 and a whitewash over Bangladesh in May will also take them to 98. USA, UAE, Scotland, Oman, Nepal, Netherlands, West Indies, Sri Lanka, and Zimbabwe are the nine teams confirmed to take part in the Qualifier. The Chevrons missed out on the previous edition of the World Cup in 2019 for the first time and will be hoping to make the most out of the home conditions and qualify for the global showpiece scheduled for India in October. – @brandon_malvin","pubDate":"2023-04-05 22:04:14","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"PNL takes Easter break","link":"https://www.herald.co.zw/pnl-takes-easter-break/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Ellina Mhlanga-Senior Sports Reporter THE Premier Netball League will have an extended break following the postponement of this weekend’s matches to April 15. The league got underway last month, and matches are played after every two weeks in clusters. So far, they have played two round of matches and the third round of matches was […]","content":"Eddie Chikamhi-Senior Sports Reporter DOMESTIC football giants Highlanders and Dynamos will set the stage alight again this year when they clash in the Independence Trophy in a landmark outing in Mashonaland Central where this year’s celebrations will be held for the first time in history. Government announced that the cup final will take place in […] Tadious Manyepo-Sports Reporter DYNAMOS coach Herbert “Jompano”Maruwa is sweating over the fitness of some of his key players who are in a race against time to recover before the giants’ Castle Lager Premier Soccer League tie against Cranborne Bullets at the National Sports Stadium on Easter Monday. The Harare giants have started the league brightly […] Eddie Chikamhi-Senior Sports Reporter TWO former world champions West Indies and Sri Lanka are set to headline the cast during the ICC Men’s Cricket World Cup qualifier to be held in Zimbabwe in June. The two cricket powerhouses were confirmed to be among the 10 nations to converge in Harare and Bulawayo in two […]","pubDate":"2023-04-05 22:02:59","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Why are the Rajasthan Royals playing in Guwahati in IPL 2023?","link":"https://www.sportskeeda.com/cricket/news-why-rajasthan-royals-playing-guwahati-ipl-2023","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-04-05 17:08:42","image_url":"https://staticc.sportskeeda.com/editor/2023/04/29064-16806984717443-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"RR vs PBKS Live Score | IPL 2023: राजस्थान को लगा तीसरा झटका, बटलर 19 रन बनाकर आउट","link":"https://sports.ndtv.com/hindi/cricket/rr-vs-pbks-live-score-ipl-2023-rajasthan-royals-vs-punjab-kings-live-8th-match-3923092#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RR vs PBKS Live Score: राजस्थान रॉयल्स के शुरुआत के 6 ओवर में ही तीन बल्लेबाज़ पवेलियन जा चुके हैं, जिसके बाद राजस्थान मुश्किल में नज़र आ रही है.","content":"RR vs PBKS Live Score | IPL 2023: 198 रनों के लक्ष्य का पीछा करने उतरी राजस्थान रॉयल्स के लिए ये मुकाबला आसान नहीं लग रहा है, शुरू के 6 ओवरों में ही तीन विकेट गवाने के बाद राजस्थान मुश्किल में नज़र आ रही है.राजस्थान रॉयल्स vs पंजाब किंग्स लाइव स्कोरबोर्डराजस्थान रॉयल्स प्लेइंग XI: यशस्वी जायसवाल, जोस बटलर, संजू सैमसन (w/c), देवदत्त पडिक्कल, रियान पराग, शिमरोन हेटमायर, जेसन होल्डर, रविचंद्रन अश्विन, ट्रेंट बोल्ट, केएम आसिफ, युजवेंद्र चहलपंजाब किंग्स प्लेइंग XI:शिखर धवन (c), प्रभसिमरन सिंह (w), भानुका राजपक्षे, जितेश शर्मा, शाहरुख खान, सैम क्यूरन, सिकंदर रजा, नाथन एलिस, हरप्रीत बराड़, राहुल चाहर, अर्शदीप सिंहराजस्थान रॉयल्स को यशसवी जायसवाल के रूप में पहला झटका लगा. ओपनर  बल्लेबाज़ यशसवी मात्र 11 रन बनाकर आउट हो गए. उसके बाद यशसवी के साथ ओपनिंग करने आये अश्विन बिना खाता खोले पवेलियन लौट गए. पंजाब किंग्स ने राजस्थान रॉयल्स के खिलाफ चार विकेट पर 197 रन बनाए. पंजाब किंग्स की ओर से कप्तान शिखर धवन ने नाबाद 86 जबकि प्रभसिमरन सिंह ने 60 रन बनाए. रॉयल्स की तरफ से जेसन होल्डर ने दो विकेट चटकाए.पंजाब किंग्स ने राजस्थान रॉयल्स के खिलाफ अपना तीन विकेट गवां दिया है. प्रभसिमरन ने (60 ) जितेश शर्मा ने (27) और सिकंदर रजा ने (1) रन बनाये. भानुका राजपक्षे के रिटायर्ड हर्ट होने के बाद बल्लेबाज़ी करने आये जितेश शर्मा ने भी आते ही तेज़ खेलना शुरू कर दिया लेकिन अपनी पारी को बड़ा रूप नहीं दे सके और मात्र 27 रन बनाकर पवेलियन लौट गए. प्रभसिमरन सिंह क्वे बाद शिखर धवन ने भी तूफानी अंदाज़ में बल्लेबाज़ी करते हुए 36 गेंदों में अपना अर्धशतक पूरा कर लिया. राजस्थान रॉयल्स ने पंजाब किंग्स के खिलाफ टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. राजस्थान रॉयल्स और पंजाब किंग्स दोनों ने अपनी प्लेइंग 11 में कोई बदलाव नहीं किया है.पंजाब किंग्स को एक ठोस शुरुआत दिलाते हुए धवन और प्रभसिमरन सिंह ने शानदार बल्लेबाज़ी की. प्रभसिमरन ने धमाकेदार अंदाज़ में अर्धशतक भी पूरा किया लेकिन होल्डर की गेंद पर जोस बटलर को कैच थमा बैठे और अपना विकेट गवां बैठे. प्रभसिमरन सिंह के आउट होने के बाद राजपक्षे नॉन स्ट्राइकर एन्ड पर खड़े थे, धवन ने शॉट खेला और गेंद राजपक्षे के हाथ पर जा लगी और वो रिटायर्ड हर्ट हो गए जिसके बाद उन्हें मैदान से बाहर जाना पड़ा. आईपीएल 2023 में आज का इकलौता मुकाबला राजस्थान रॉयल्स (RR) बनाम पंजाब किंग्स (PBKS) के बीच गुवाहाटी के बरसापारा स्टेडियम में खेला जा रहा है. इस सीजन में दोनों ही टीमों ने अब तक एक-एक मुकाबला खेला है और दोनों ही टीमों ने जीत भी दर्ज की हैं. पंजाब किंग्स ने कोलकाता के खिलाफ डीएलएस प्रक्रिया के तहत 7 रनों से मुकाबला जीता था, तो वहीं राजस्थान की टीम ने सनराइजर्स हैदराबाद के खिलाफ 72 रनों से धमाकेदार जीत हासिल की थी. राजस्थान की टीम के ओपनिंग बल्लेबाज यशस्वी जयसवाल और जोस बटलर के साथ-साथ कप्तान संजू सैमसन ने भी हैदराबाद के खिलाफ शानदार अर्धशतकीय पारी खेली थी. वहीं, पंजाब किंग्स के तरफ से अर्शदीप सिंह ने अपनी धारदार गेंदबाज़ी से कोलकाता के खिलाफ कहर बरपाया था. दोनों ही टीमें खुद में संतुलित है, जिससे रोमांचक मुकाबले की उम्मीद है.Rajasthan Royals vs Punjab Kings, 8th Match - Live Cricket Score, Commentary From Barsapara Cricket Stadium, Guwahati.","pubDate":"2023-04-05 16:57:53","image_url":"https://c.ndtvimg.com/2023-04/ntulou7o_shikhar-dhawan-bcci_625x300_05_April_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: \"इस फैसले ने कोहली को सहज और खुश बना दिया\", एबीडि विलियर्स का बड़ा बयान","link":"https://sports.ndtv.com/hindi/cricket/ipl-2023-this-decision-has-has-made-virat-kohli-comfortable-ab-de-villiers-makes-big-statement-3923905#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: सभी ने देखा है कि विराट कोहली (Virat Kohli) ने आरसीबी के लिए कैसी शुरुआत की है. और यह बात मैनेजमेंट और फैंस दोनों को बहुत ही भरोसा देता है","content":"दक्षिण अफ्रीका के पूर्व कप्तान और रॉयल चैलेंजर्स बेंगलूर (RCB) के पूर्व दिग्गज खिलाड़ी एबीडिविलियर्स का कहना है कि विराट कोहली (Virat Kohli) इंडियन प्रीमियर लीग (IPL 2023) फ्रेंचाइजी और राष्ट्रीय टीम के कप्तान की भूमिका छोड़ने के बाद इस सत्र में तनावमुक्त और खुश नजर आ रहे हैं. आईपीएल 2023 के पहले मैच में नाबाद 82 रन की पारी खेलकर अपनी टीम को जीत दिलाने वाले कोहली 2021 सत्र के बाद आरसीबी की कप्तानी से हट गए और लगभग उसी समय उन्होंने सभी प्रारूपों में राष्ट्रीय टीम की कप्तानी भी छोड़ी. कोहली की बल्लेबाजी के संदर्भ में डिविलियर्स ने मीडिया से कहा, \"मैंने ज्यादा बदलाव नहीं देखा है. सब कुछ पहले जैसा है. तकनीक ठोस दिखती है, उसे क्रीज पर अच्छा संतुलन मिला है. उसमें अब भी काफी ऊर्जा है. मुझे बस यही लगता है कि इस सीजन में वह काफी तरो-ताजा दिख रहा है. मैंने उसके कुछ साक्षात्कार देखे हैं जहां वह पहले से कहीं ज्यादा हंस रहा था.\"SPECIAL STORIES:प्रभसिमरन सिंह ने दिखायी \"पावर\", यह गजब X फैक्टर टीम इंडिया के लिए बहुत ही काम काआईपीएल में इस सीजन में फैंटेसी गेम्स कंपनियों पर पैसा बरसेगा छप्पर फाड़ के, कमाएंगी इतनी रकमगुजरात ओपनर गिल की ICC odi Ranking में बड़ी उपलब्धि, कुछ ऐसे बोला है हालिया समय में बल्लापूर्व दिग्गज ने कहा, \"मुझे लगता है कि पिछले सत्र में कप्तानी छोड़ने से उसे सहज होने में काफी मदद मिली. वह एक शानदार कप्तान थे, लेकिन उन्होंने अंतरराष्ट्रीय स्तर पर और आईपीएल में भी लंबे समय तक ऐसा किया जो चुनौतीपूर्ण हो सकता है. आपको आराम करने या परिवार के साथ बिताने या कुछ दोस्तों के साथ हंसी-मजाक करने का समय नहीं मिलता है. मुझे लगता है कि इस सत्र के लिए उनका यही मंत्र है, बस मौज-मस्ती करना, मुस्कुराते रहना.\"डिविलियर्स ने कहा, ‘जब वह लुत्फ उठा रहा होता है तो नैसर्गिक प्रतिभा हावी हो जाती है और वह आसानी से रन बनाता है जो उसने पहले मैच में किया. मुझे लगता है कि अभी सर्वश्रेष्ठ आना बाकी है और हमें कुछ आतिशबाजी बल्लेबाजी देखने को मिलेगी.\" डिविलियर्स ने भारत और मुंबई इंडियंस के बल्लेबाज सूर्यकुमार यादव का बचाव किया जिनके फॉर्म में अचानक गिरावट दिखी है. उन्हें सूर्यकुमार को सलाह दी कि अतीत में जो काम किया है उस पर ध्यान केंद्रित करें.उन्होंने कहा, ‘‘वह शायद अब उस चरण में है जहां उसे कुछ करने की जरूरत है, लेकिन इसका राज यह है कि घबराएं नहीं और अपना रणनीति नहीं बदलें. वर्षों से जो उसके लिए काम कर रहा है, उसे उसी पर टिके रहना होगा. हां, वह कोशिश कर सकता है और याद रख सकता है कि ‘मेरे बेसिक्स क्या हैं' या ‘जब मैं लगातार रन बना रहा था तो मैंने क्या अच्छा किया' क्योंकि जाहिर है कि वह अपने खेल को पूरी तरह से अलग स्तर पर ले गया था.\"--- ये भी पढ़ें ---* IPL 2023: दिल्ली की लगातार 2 हार ने बदला Points Table का समीकरण, अब यह टीम टॉप पर, जानें पर्पल कैप और ऑरेंज कैप किसके पास है.. * IPL 2023: हार्दिक पंड्या ने 'किलर मिलर' के साथ की ऐसी हरकत, देख फूटा फूटा फैन्स का गुस्सा, लोगों ने दे डाली ऐसी नसीहत स्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-04-05 16:43:15","image_url":"https://c.ndtvimg.com/2023-04/4t5vdtpg_virat-kohli_625x300_02_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Canadian cricketers regain one-day international status at Namibia qualifier","link":"https://www.nsnews.com/national-sports/canadian-cricketers-regain-one-day-international-status-at-namibia-qualifier-6812628","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"WINDHOEK, Namibia — Pargat Singh led the batting attack with 66 runs and bowler Jeremy Gordon took six wickets as Canada wrapped up play Wednesday at the ICC Cricket World Cup Qualifier Playoff with a 90-run victory over winless Papua New Guinea Whil","content":null,"pubDate":"2023-04-05 16:03:31","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/04/20230405100444-25dfec17a4b2864aefb70ee4d5038b90ae7ff88ba1b37d2f9a8651cc2d582f86.jpg;w=960","source_id":"nsnews","category":["sports"],"country":["canada"],"language":"english"},{"title":"Babar Azam fully consulted in team selection: Chief Selector","link":"https://www.nation.com.pk/06-Apr-2023/babar-azam-fully-consulted-in-team-selection-chief-selector","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan cricket team chief selector, Haroon Rasheed has said that Babar Azam, the team’s captain, has been fully consulted and involved in the selection process, and everyone is on the same page.","content":"LAHORE - Pakistan cricket team chief selector, Haroon Rasheed has said that , the team’s captain, has been fully consulted and involved in the selection process, and everyone is on the same page. Chief Selector Haroon Rasheed said this while addressing a press conference here on Wednesday about the team’s selection process for the upcoming home tour of New Zealand. He clarified that there have been rumors regarding Babar Azam’s captaincy, but he has never discussed the matter with anyone. He emphasized that the team is looking forward to an exciting series against New Zealand and will not take any team lightly. Rasheed also spoke about the upcoming Asia Cup, World Cup, and T20 World Cup, which are scheduled for next year. “We are trying to finalize our team combination for the upcoming Asia Cup, World Cup and T20 World Cup and has only eight ODIs before the Asia Cup to assess the potential and talent of the players. Rasheed said that Haris Sohail is an exceptional left-hand batsman, and he can prove good in Asian conditions, and if he stays in form and fit, he can support the middle order. About Azam Khan, the chief selector said that the wicketkeeper batter himself has to see what the weakness is and work he needs to make a comeback. Azam Khan has had a hard time against the spinners which has to be worked on, if a player is dropped it does not mean he can’t make a comeback, he added. The chief selector said that Shadab Khan has played very little cricket and he has to be given a chance. “The doors are open for everyone, and the selection committee is considering 30 to 35 players for the team. Additionally, some of these players will be selected to play for Pakistan Shaheens.” Replying to a query about Muhammad Amir, Rasheed refuted media reports that a member of selection committee asked the left-arm pacer to be prepared for international comeback. “Why would selection committee contact anyone? We said on the first day that the selection door is open for everyone, now it is up to them how they perform. Then we will judge their performance,” he said. PAKISTAN SQUADS T20I: (captain), Shadab Khan (vice-captain), Faheem Ashraf, Fakhar Zaman, Haris Rauf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Rizwan, Naseem Shah, Saim Ayub, Shaheen Shah Afridi, Shan Masood and Zaman Khan. ODI: (captain), Shadab Khan (vice-captain), Abdullah Shafique, Fakhar Zaman, Haris Rauf, Haris Sohail, Ihsanullah, Imam-ul-Haq, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Salman Ali Agha, Shaheen Shah Afridi, Shan Masood and Usama Mir.","pubDate":"2023-04-06 00:00:35","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/babar-azam-fully-consulted-in-team-selection-chief-selector-1680739229-1702.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Mushfiqur ton, bowling attack give Bangladesh edge in Ireland Test","link":"https://www.nation.com.pk/06-Apr-2023/mushfiqur-ton-bowling-attack-give-bangladesh-edge-in-ireland-test","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Bangladeshi left-arm spin duo Shakib Al Hasan and Taijul Islam made quick work of Ireland’s top order on Wednesday to leave the tourists flailing at 27-4 on day two of their one-off Test in Dhaka.","content":"MIRPUR - Bangladeshi left-arm spin duo Shakib Al Hasan and Taijul Islam made quick work of Ireland’s top order on Wednesday to leave the tourists flailing at 27-4 on day two of their one-off Test in Dhaka. Mushfiqur Rahim’s knock of 126 put the hosts on the front foot after early wobbles in the first innings and the hosts were still 128 runs ahead at stumps. Andy McBrine claimed 6-118, becoming only the second Irish bowler to take five Test wickets, to help close out the first innings in the final session. But Ireland’s batsmen spoiled his party with four quick wickets before the day was done. Murray Commins (1), James McCollum (0), Andy Balbirnie (3) and Curtis Campher (1) wilted in front of Taijul and Shakib, who claimed 2-7 and 2-11 respectively. Herry Tector was batting on eight alongside Peter Moor, 10 not out at the end of play to leave Ireland staring at the prospect of an innings defeat. Bangladesh resumed on 34-2 and looked shaky after losing Mominul Haque, bowled round his legs for 17, in the third over of the morning. But Shakib and Mushfiqur turned up the aggression to quickly claw back the deficit with a 159-run partnership for the fourth wicket. Shakib was at his mercurial best until he chased a ball from McBrine wide outside the off stump to get a feather touch on the bat. He was caught behind after an impressive 14 fours from his 94-ball knock. Liton Das joined Mushfiqur to continue on the front foot, adding 87 runs for the fifth wicket. Mushfiqur finished his hundred from 135 balls with a four off Mark Adair before Ben White dismissed Liton for 43 runs. McBrine finally dispatched Mushfiqur — with Commins taking a fine diving catch at long-on — and cut short the tail with three wickets in three consecutive overs. Ireland have lost all three of their previous Tests since becoming a full member of the International Cricket Council in 2017.","pubDate":"2023-04-05 23:58:59","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/mushfiqur-ton-bowling-attack-give-bangladesh-edge-in-ireland-test-1680739110-6276.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Kiwis thrash Sri Lanka in second T20 to level series","link":"https://www.nation.com.pk/06-Apr-2023/kiwis-thrash-sri-lanka-in-second-t20-to-level-series","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"DUNEDIN - Adam Milne’s five-wicket haul and Tim Seifert’s unbeaten 79 set up New Zealand’s nine-wicket victory in the second T20I against Sri Lanka on Wednesday, with the match also earning female umpire Kim Cotton a place in history.","content":"DUNEDIN - Adam Milne’s five-wicket haul and Tim Seifert’s unbeaten 79 set up New Zealand’s nine-wicket victory in the second T20I against Sri Lanka on Wednesday, with the match also earning female umpire Kim Cotton a place in history. Seifert smashed six sixes in his 43-ball blitz as New Zealand romped home with 5.2 overs to spare to level the three-match series and gain a psychological edge ahead of Saturday’s decider in Queenstown. Auckland-born Cotton became the first female umpire to stand in a men’s international match between two International Cricket Council full-member countries. Earlier, Milne claimed a career-best 5-26 to help bowl out Sri Lanka for 141 in 19 overs, which proved belowpar at Dunedin’s University Oval, which has relatively short boundaries. Sri Lanka lost their openers cheaply and after Kusal Perera (35), Dhananjaya de Silva (37) and Charith Asalanka (24) shored them up the wheels came off their innings in the second half. Sri Lanka, who had won the opening match on Sunday via Super Over, lost their last eight wickets for 50 runs with Milne claiming three in the final over. New Zealand’s chase got off to a blazing start with Chad Bowes (31) hitting Dilshan Madushanka for four boundaries in the second over, including three in a row, throwing the seamer out of the attack. Seifert ensured there was no respite for the tourists even after Bowes fell as he tore into the Sri Lankan attack, sealing New Zealand’s victory with back-to-back sixes. Sri Lanka’s sloppy catching did not help their cause either as they dropped both Seifert and home captain Tom Latham, who remained unbeaten on 20.","pubDate":"2023-04-05 23:57:08","image_url":"https://www.nation.com.pk/print_images/large/2023-04-06/kiwis-thrash-sri-lanka-in-second-t20-to-level-series-1680739016-2384.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"MCC awards Muhammad Hafeez with Honorary Life Membership","link":"https://www.nation.com.pk/06-Apr-2023/mcc-awards-muhammad-hafeez-with-honorary-life-membership","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - Former Pakistan captain Mohammad Hafeez was named in the list of renowned men and women cricketers, awarded with honorary life membership by Marylebone Cricket Club (MCC) on Wednesday.","content":"LAHORE - Former Pakistan captain Mohammad Hafeez was named in the list of renowned men and women cricketers, awarded with honorary life membership by Marylebone Cricket Club (MCC) on Wednesday. Taking to Twitter, Hafeez expressed his gratitude to MCC for awarding him with honorary membership and acknowledging his services for the sport. “I would like to express my deepest gratitude to @MCCOfficial honouring life membership acknowledging my services to this beautiful game of cricket. Looking forward to meet new friends & add value as member of MCC,” wrote Hafeez. Besides Hafeez, England’s World Cup-winning captain Eoin Morgan and five Indian players including legendary skipper MS Dhoni were also acknowledged by the MCC.","pubDate":"2023-04-05 23:51:21","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"One more spot remaining for ICC World Cup Qualifier","link":"https://www.chronicle.co.zw/one-more-spot-remaining-for-icc-world-cup-qualifier/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ONLY one spot is remaining for the 2023 International Cricket Council (ICC) World Cup Qualifier after two teams, the United States of America (USA) and the United Arab Emirates (UAE) booked their berths in Zimbabwe for the June tournament. The two nations managed to reach the Qualifier stage after emerging victorious […]","content":"The Chronicle ONLY one spot is remaining for the 2023 International Cricket Council (ICC) World Cup Qualifier after two teams, the United States of America (USA) and the United Arab Emirates (UAE) booked their berths in Zimbabwe for the June tournament. The two nations managed to reach the Qualifier stage after emerging victorious in the World Cup Qualifier play-off that ended in Namibia yesterday. After their victories, only one team, coming from the Super League, remains to make it 10 nations. The USA won by 25 runs against Jersey in their final round-robin match, a win that capped a 4-1 tournament for them. Their only loss came against Canada and Namibia’s win over Canada in Windhoek on Tuesday ensuring that only UAE can equal the USA at 4-1 in round-robin play, guaranteeing them a top-two finish to advance to the qualifier in Zimbabwe. For UAE, yesterday’s match against Jersey was a dead rubber as they already owned the initial tournament tiebreaker over Namibia and Canada having beaten both teams head-to-head. Wins in head-to-head matches supersede net run rate as a tiebreaker if teams are level on points or round-robin play. After the two associate nations booked their places in the Qualifier, South Africa or Ireland will be coming to Zimbabwe to make it 10 teams as the two countries are still in contention for direct qualification. However, Ireland, who have a home series against Bangladesh next month will have to whitewash the Tigers to have a chance of direct contention. The Proteas sit in eighth place, but Ireland still has three One Day Internationals (ODIs) remaining against Bangladesh scheduled for May. Should Ireland win all three, they would be level with South Africa on points in which case net run rate would serve as the tiebreaker to decide which team clinches an automatic berth to the 2023 World Cup and which team falls back into the Qualifier in Zimbabwe. South Africa moved to eighth after their series win against the Netherlands saw them overtake the West Indies, effectively sending the Caribbean nation to the Qualifier. South Africa have 98 points, while the Irish are on 68 and a whitewash over Bangladesh in May will also take them to 98. USA, UAE, Scotland, Oman, Nepal, Netherlands, West Indies, Sri Lanka, and Zimbabwe are the nine teams confirmed to take part in the Qualifier. The Chevrons missed out on the previous edition of the World Cup in 2019 for the first time and will be hoping to make the most out of the home conditions and qualify for the global showpiece scheduled for India in October. – @brandon_malvin","pubDate":"2023-04-05 22:04:14","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"PNL takes Easter break","link":"https://www.herald.co.zw/pnl-takes-easter-break/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Ellina Mhlanga-Senior Sports Reporter THE Premier Netball League will have an extended break following the postponement of this weekend’s matches to April 15. The league got underway last month, and matches are played after every two weeks in clusters. So far, they have played two round of matches and the third round of matches was […]","content":"Eddie Chikamhi-Senior Sports Reporter DOMESTIC football giants Highlanders and Dynamos will set the stage alight again this year when they clash in the Independence Trophy in a landmark outing in Mashonaland Central where this year’s celebrations will be held for the first time in history. Government announced that the cup final will take place in […] Tadious Manyepo-Sports Reporter DYNAMOS coach Herbert “Jompano”Maruwa is sweating over the fitness of some of his key players who are in a race against time to recover before the giants’ Castle Lager Premier Soccer League tie against Cranborne Bullets at the National Sports Stadium on Easter Monday. The Harare giants have started the league brightly […] Eddie Chikamhi-Senior Sports Reporter TWO former world champions West Indies and Sri Lanka are set to headline the cast during the ICC Men’s Cricket World Cup qualifier to be held in Zimbabwe in June. The two cricket powerhouses were confirmed to be among the 10 nations to converge in Harare and Bulawayo in two […]","pubDate":"2023-04-05 22:02:59","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Why are the Rajasthan Royals playing in Guwahati in IPL 2023?","link":"https://www.sportskeeda.com/cricket/news-why-rajasthan-royals-playing-guwahati-ipl-2023","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-04-05 17:08:42","image_url":"https://staticc.sportskeeda.com/editor/2023/04/29064-16806984717443-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"RR vs PBKS Live Score | IPL 2023: राजस्थान को लगा तीसरा झटका, बटलर 19 रन बनाकर आउट","link":"https://sports.ndtv.com/hindi/cricket/rr-vs-pbks-live-score-ipl-2023-rajasthan-royals-vs-punjab-kings-live-8th-match-3923092#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RR vs PBKS Live Score: राजस्थान रॉयल्स के शुरुआत के 6 ओवर में ही तीन बल्लेबाज़ पवेलियन जा चुके हैं, जिसके बाद राजस्थान मुश्किल में नज़र आ रही है.","content":"RR vs PBKS Live Score | IPL 2023: 198 रनों के लक्ष्य का पीछा करने उतरी राजस्थान रॉयल्स के लिए ये मुकाबला आसान नहीं लग रहा है, शुरू के 6 ओवरों में ही तीन विकेट गवाने के बाद राजस्थान मुश्किल में नज़र आ रही है.राजस्थान रॉयल्स vs पंजाब किंग्स लाइव स्कोरबोर्डराजस्थान रॉयल्स प्लेइंग XI: यशस्वी जायसवाल, जोस बटलर, संजू सैमसन (w/c), देवदत्त पडिक्कल, रियान पराग, शिमरोन हेटमायर, जेसन होल्डर, रविचंद्रन अश्विन, ट्रेंट बोल्ट, केएम आसिफ, युजवेंद्र चहलपंजाब किंग्स प्लेइंग XI:शिखर धवन (c), प्रभसिमरन सिंह (w), भानुका राजपक्षे, जितेश शर्मा, शाहरुख खान, सैम क्यूरन, सिकंदर रजा, नाथन एलिस, हरप्रीत बराड़, राहुल चाहर, अर्शदीप सिंहराजस्थान रॉयल्स को यशसवी जायसवाल के रूप में पहला झटका लगा. ओपनर  बल्लेबाज़ यशसवी मात्र 11 रन बनाकर आउट हो गए. उसके बाद यशसवी के साथ ओपनिंग करने आये अश्विन बिना खाता खोले पवेलियन लौट गए. पंजाब किंग्स ने राजस्थान रॉयल्स के खिलाफ चार विकेट पर 197 रन बनाए. पंजाब किंग्स की ओर से कप्तान शिखर धवन ने नाबाद 86 जबकि प्रभसिमरन सिंह ने 60 रन बनाए. रॉयल्स की तरफ से जेसन होल्डर ने दो विकेट चटकाए.पंजाब किंग्स ने राजस्थान रॉयल्स के खिलाफ अपना तीन विकेट गवां दिया है. प्रभसिमरन ने (60 ) जितेश शर्मा ने (27) और सिकंदर रजा ने (1) रन बनाये. भानुका राजपक्षे के रिटायर्ड हर्ट होने के बाद बल्लेबाज़ी करने आये जितेश शर्मा ने भी आते ही तेज़ खेलना शुरू कर दिया लेकिन अपनी पारी को बड़ा रूप नहीं दे सके और मात्र 27 रन बनाकर पवेलियन लौट गए. प्रभसिमरन सिंह क्वे बाद शिखर धवन ने भी तूफानी अंदाज़ में बल्लेबाज़ी करते हुए 36 गेंदों में अपना अर्धशतक पूरा कर लिया. राजस्थान रॉयल्स ने पंजाब किंग्स के खिलाफ टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. राजस्थान रॉयल्स और पंजाब किंग्स दोनों ने अपनी प्लेइंग 11 में कोई बदलाव नहीं किया है.पंजाब किंग्स को एक ठोस शुरुआत दिलाते हुए धवन और प्रभसिमरन सिंह ने शानदार बल्लेबाज़ी की. प्रभसिमरन ने धमाकेदार अंदाज़ में अर्धशतक भी पूरा किया लेकिन होल्डर की गेंद पर जोस बटलर को कैच थमा बैठे और अपना विकेट गवां बैठे. प्रभसिमरन सिंह के आउट होने के बाद राजपक्षे नॉन स्ट्राइकर एन्ड पर खड़े थे, धवन ने शॉट खेला और गेंद राजपक्षे के हाथ पर जा लगी और वो रिटायर्ड हर्ट हो गए जिसके बाद उन्हें मैदान से बाहर जाना पड़ा. आईपीएल 2023 में आज का इकलौता मुकाबला राजस्थान रॉयल्स (RR) बनाम पंजाब किंग्स (PBKS) के बीच गुवाहाटी के बरसापारा स्टेडियम में खेला जा रहा है. इस सीजन में दोनों ही टीमों ने अब तक एक-एक मुकाबला खेला है और दोनों ही टीमों ने जीत भी दर्ज की हैं. पंजाब किंग्स ने कोलकाता के खिलाफ डीएलएस प्रक्रिया के तहत 7 रनों से मुकाबला जीता था, तो वहीं राजस्थान की टीम ने सनराइजर्स हैदराबाद के खिलाफ 72 रनों से धमाकेदार जीत हासिल की थी. राजस्थान की टीम के ओपनिंग बल्लेबाज यशस्वी जयसवाल और जोस बटलर के साथ-साथ कप्तान संजू सैमसन ने भी हैदराबाद के खिलाफ शानदार अर्धशतकीय पारी खेली थी. वहीं, पंजाब किंग्स के तरफ से अर्शदीप सिंह ने अपनी धारदार गेंदबाज़ी से कोलकाता के खिलाफ कहर बरपाया था. दोनों ही टीमें खुद में संतुलित है, जिससे रोमांचक मुकाबले की उम्मीद है.Rajasthan Royals vs Punjab Kings, 8th Match - Live Cricket Score, Commentary From Barsapara Cricket Stadium, Guwahati.","pubDate":"2023-04-05 16:57:53","image_url":"https://c.ndtvimg.com/2023-04/ntulou7o_shikhar-dhawan-bcci_625x300_05_April_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: \"इस फैसले ने कोहली को सहज और खुश बना दिया\", एबीडि विलियर्स का बड़ा बयान","link":"https://sports.ndtv.com/hindi/cricket/ipl-2023-this-decision-has-has-made-virat-kohli-comfortable-ab-de-villiers-makes-big-statement-3923905#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: सभी ने देखा है कि विराट कोहली (Virat Kohli) ने आरसीबी के लिए कैसी शुरुआत की है. और यह बात मैनेजमेंट और फैंस दोनों को बहुत ही भरोसा देता है","content":"दक्षिण अफ्रीका के पूर्व कप्तान और रॉयल चैलेंजर्स बेंगलूर (RCB) के पूर्व दिग्गज खिलाड़ी एबीडिविलियर्स का कहना है कि विराट कोहली (Virat Kohli) इंडियन प्रीमियर लीग (IPL 2023) फ्रेंचाइजी और राष्ट्रीय टीम के कप्तान की भूमिका छोड़ने के बाद इस सत्र में तनावमुक्त और खुश नजर आ रहे हैं. आईपीएल 2023 के पहले मैच में नाबाद 82 रन की पारी खेलकर अपनी टीम को जीत दिलाने वाले कोहली 2021 सत्र के बाद आरसीबी की कप्तानी से हट गए और लगभग उसी समय उन्होंने सभी प्रारूपों में राष्ट्रीय टीम की कप्तानी भी छोड़ी. कोहली की बल्लेबाजी के संदर्भ में डिविलियर्स ने मीडिया से कहा, \"मैंने ज्यादा बदलाव नहीं देखा है. सब कुछ पहले जैसा है. तकनीक ठोस दिखती है, उसे क्रीज पर अच्छा संतुलन मिला है. उसमें अब भी काफी ऊर्जा है. मुझे बस यही लगता है कि इस सीजन में वह काफी तरो-ताजा दिख रहा है. मैंने उसके कुछ साक्षात्कार देखे हैं जहां वह पहले से कहीं ज्यादा हंस रहा था.\"SPECIAL STORIES:प्रभसिमरन सिंह ने दिखायी \"पावर\", यह गजब X फैक्टर टीम इंडिया के लिए बहुत ही काम काआईपीएल में इस सीजन में फैंटेसी गेम्स कंपनियों पर पैसा बरसेगा छप्पर फाड़ के, कमाएंगी इतनी रकमगुजरात ओपनर गिल की ICC odi Ranking में बड़ी उपलब्धि, कुछ ऐसे बोला है हालिया समय में बल्लापूर्व दिग्गज ने कहा, \"मुझे लगता है कि पिछले सत्र में कप्तानी छोड़ने से उसे सहज होने में काफी मदद मिली. वह एक शानदार कप्तान थे, लेकिन उन्होंने अंतरराष्ट्रीय स्तर पर और आईपीएल में भी लंबे समय तक ऐसा किया जो चुनौतीपूर्ण हो सकता है. आपको आराम करने या परिवार के साथ बिताने या कुछ दोस्तों के साथ हंसी-मजाक करने का समय नहीं मिलता है. मुझे लगता है कि इस सत्र के लिए उनका यही मंत्र है, बस मौज-मस्ती करना, मुस्कुराते रहना.\"डिविलियर्स ने कहा, ‘जब वह लुत्फ उठा रहा होता है तो नैसर्गिक प्रतिभा हावी हो जाती है और वह आसानी से रन बनाता है जो उसने पहले मैच में किया. मुझे लगता है कि अभी सर्वश्रेष्ठ आना बाकी है और हमें कुछ आतिशबाजी बल्लेबाजी देखने को मिलेगी.\" डिविलियर्स ने भारत और मुंबई इंडियंस के बल्लेबाज सूर्यकुमार यादव का बचाव किया जिनके फॉर्म में अचानक गिरावट दिखी है. उन्हें सूर्यकुमार को सलाह दी कि अतीत में जो काम किया है उस पर ध्यान केंद्रित करें.उन्होंने कहा, ‘‘वह शायद अब उस चरण में है जहां उसे कुछ करने की जरूरत है, लेकिन इसका राज यह है कि घबराएं नहीं और अपना रणनीति नहीं बदलें. वर्षों से जो उसके लिए काम कर रहा है, उसे उसी पर टिके रहना होगा. हां, वह कोशिश कर सकता है और याद रख सकता है कि ‘मेरे बेसिक्स क्या हैं' या ‘जब मैं लगातार रन बना रहा था तो मैंने क्या अच्छा किया' क्योंकि जाहिर है कि वह अपने खेल को पूरी तरह से अलग स्तर पर ले गया था.\"--- ये भी पढ़ें ---* IPL 2023: दिल्ली की लगातार 2 हार ने बदला Points Table का समीकरण, अब यह टीम टॉप पर, जानें पर्पल कैप और ऑरेंज कैप किसके पास है.. * IPL 2023: हार्दिक पंड्या ने 'किलर मिलर' के साथ की ऐसी हरकत, देख फूटा फूटा फैन्स का गुस्सा, लोगों ने दे डाली ऐसी नसीहत स्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-04-05 16:43:15","image_url":"https://c.ndtvimg.com/2023-04/4t5vdtpg_virat-kohli_625x300_02_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Canadian cricketers regain one-day international status at Namibia qualifier","link":"https://www.nsnews.com/national-sports/canadian-cricketers-regain-one-day-international-status-at-namibia-qualifier-6812628","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"WINDHOEK, Namibia — Pargat Singh led the batting attack with 66 runs and bowler Jeremy Gordon took six wickets as Canada wrapped up play Wednesday at the ICC Cricket World Cup Qualifier Playoff with a 90-run victory over winless Papua New Guinea Whil","content":null,"pubDate":"2023-04-05 16:03:31","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/04/20230405100444-25dfec17a4b2864aefb70ee4d5038b90ae7ff88ba1b37d2f9a8651cc2d582f86.jpg;w=960","source_id":"nsnews","category":["sports"],"country":["canada"],"language":"english"}]}