{"newsArray":[{"title":"Markram century carries Sunrisers Eastern Cape into SA20 final","link":"https://www.citizen.co.za/sport/cricket/aiden-markram-sunrisers-eastern-cape-sa20-semi-final/","keywords":["Cricket","Joburg Super Kings","SA20","Sunrisers Eastern Cape"],"creator":["Ken Borland"],"video_url":null,"description":"Sunrisers Eastern Cape will now take on the Pretoria Capitals in the final at the Wanderers on Saturday.","content":"Aiden Markram’s magnificent century flattened Joburg Super Kings before the Sunrisers Eastern Cape bowlers struck at key times to keep a full-throttle run-chase just about under control and win their SA20 semifinal by 14 runs in Centurion on Thursday night. Captain Markram came to the crease under pressure with the Sunrisers on 10/2, having been sent in to bat on a pitch which offered assistance to the new ball. Showing his class, he looked comfortable from the outset but employed a measured approach as he and young Jordan Hermann, who showed admirable composure in scoring 48 off 36 balls, put the innings back on level ground. ALSO READ: Rossouw says ‘fearless’ Capitals are ready for battle in SA20 final Markram went to his half-century off 40 balls and then exploded into an array of punishing strokes all around the ground as he completed the third century of the SA20 just 17 deliveries later. The skipper fell in the penultimate over for 100 off 58 balls, having added 99 off 76 balls with Hermann and then 75 off 31 balls with Tristan Stubbs (20 off 11). Jordan Cox then lifted Sunrisers Eastern Cape to 213/5 with a cameo of 18 not out off six balls. Lizaad Williams was the best of the Joburg bowlers with 4/36 in his four overs, but Gerald Coetzee, who had bowled really well to concede just 16 runs in his first three overs, was pulverised in a final over that cost 27 runs and included two free hits for high full tosses, a wide and two sixes. Coetzee did not have long to ruminate over his misfortune because he was bizarrely sent up the order to open the batting for Super Kings. He then had to watch Joburg’s two most successful performers with the bat, Faf du Plessis, for his second successive first-ball dismissal, and Leus du Plooy depart for ducks. Coetzee could only score 12 off 17 balls, but fortunately for Joburg, Reeza Hendricks batted like he was having a hit in his back garden, keeping them alive with his great effort of 96 off 54 balls. But the early damage and the fact that the Sunrisers kept chipping away by taking wickets at key moments meant the run-rate grew out of control. Donovan Ferreira lashed 20 off 11 balls, but when Romario Shepherd came to the crease, the Super Kings needed 83 off just 28 deliveries. The West Indian plundered 38 not out off just 14 balls to keep the result in the balance, the Sunrisers bowling and fielding getting a bit wild under pressure, but they still needed 44 off the last two overs, which was too much. Left-arm spinner Roelof van der Merwe was once again outstanding with the ball, taking 2/23 in his four overs. Sunrisers Eastern Cape will now be taking on the Pretoria Capitals in the final at the Wanderers on Saturday.","pubDate":"2023-02-09 20:29:50","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/IMG_20230209_193537_1500_x_1000_pixel.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"The moment is now for the Proteas Women to achieve World Cup glory","link":"https://www.dailymaverick.co.za/article/2023-02-09-the-moment-is-now-for-the-proteas-women-to-achieve-world-cup-glory/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"South Africa has never won a cricket World Cup. The Women’s T20 tournament is the perfect opportunity for the country to set that right. The post The moment is now for the Proteas Women to achieve World Cup glory appeared first on Daily Maverick.","content":"The Proteas Women are not the favourites going into the T20 World Cup — starting tomorrow evening at Newlands with South Africa taking on Sri Lanka. In fact, they are only the fifth-ranked team in the format. However, with a monumental tournament on home ground, and arguably their best side yet, there is no better chance for the side to be the first from the country to claim a World Cup trophy. “It’s massive. I don’t think we’ve realised what we’ve already achieved without playing a game,” said team captain Sune Luus at Thursday’s pre-match press conference. Women’s cricket has grown rapidly in the past few years and the South African team has grown with it, becoming one of the leading teams in the world. The Proteas Women played some of their best cricket in the previous edition of the tournament in Australia, topping their group before unluckily going out via the Duckworth-Lewis method to eventual champions Australia. However, skipper Luus believes the side has grown and become better since that bitter defeat in Sydney. “[In the past] three years, a lot of our skills have improved. Going into this World Cup, we’re more confident in our skill set that we have. We have more options going into this tournament as well,” she said. “We’re a more confident side, although we’re very young. We have a very well-balanced side, experience and youth. “It’s very exciting for everyone going into this World Cup just knowing the skill set we have and how we’ve developed over the last few years.” South Africa’s opening match against Sri Lanka won’t be easy, despite the opponents coming into the tournament ranked a lowly eighth. The Newlands wicket has proven to be on the slow side over the course of the SA20 and domestic matches this season which could favour the subcontinent side and their plethora of spin options. The Proteas, though, have decent spin bowling options themselves in all-rounders Chloe Tryon — with her left-arm orthodox bowling — and Luus’ leg breaks. But their main spin threat is that of Nonkululeko Mlaba, who is the No 2-ranked spin bowler in T20. “She’s been fantastic in our team. She’s started at a very young age and she’s grown in leaps and bounds over the last few years in terms of her bowling,” said Luus about Mlaba. “Every game she plays she only gets more confident. She’s going to be vital for us, being our main spinner, controlling the game.” Visit Daily Maverick’s home page for more news, analysis and investigations A healthy South African spin crop bodes well for a side that have relied on the exploits of their fast bowlers for so long. Marizanne Kapp and Shabnim Ismail are still two of the most feared fast bowlers in the game and Ayabonga Khaka, along with Masabata Klaas, always provide more than able support. The quartet are sure to fire, if not against Sri Lanka, then on the slightly quicker wickets at St George’s Park and Boland Park. South Africa’s task does not get any easier after Sri Lanka. They face a potential do-or-die match against New Zealand on Monday — as both teams are likely to be battling it out for second place in group 1 — before they take on world champions Australia the following Saturday. The Proteas Women’s final group stage match is against Bangladesh on Tuesday, 21 February. The semifinals follow on 23 and 24 February before the final on 26 February. In essence, the Proteas only need to play their very best cricket in five matches to go where no other South African cricket side has gone. The World Cup is about more than just winning matches and “success” according to Luus. With the eyes of the country on its women’s side, it is an opportunity to inspire young girls. “Apart from the cricketing things and apart from being successful and winning games, we have a responsibility of inspiring a nation and inspiring young girls to get out of their comfort zones and to imagine a career where they can do anything,” said the skipper. “That is one of our biggest roles as a team we would like to play. Not just winning games but also inspiring a nation to give them the opportunity to know that they can be anything they want.” The role of both inspiring and being successful could add to the pressure South Africa already has as the host nation. But Luus assured that the pressure was there to be embraced. “There’s always going to be pressure and you feel it whether you play at home or not… We just need to embrace the moment and embrace the pressure and run with it. “There’s not much you can do about the pressure and all the people that’s going to be here and all the media saying things. We just have to embrace it and stay in the moment and play good cricket. SA have played two warm-up matches leading up to the tournament. They lost to England by 17 runs on Monday before thumping Pakistan by six wickets on Wednesday. “The results showed a loss and a win but for us, both games were wins for us,” said Luus. England scored a mammoth 246 for seven against the Proteas before the South Africans hit back with 229 for nine in their allotted 20 overs. “Our batting has come a long way. To score 229, that’s massive and our biggest score yet. That’s really cool to see what we can actually do. Pushing that 160s, 170s if the pitches allow that.” South Africa’s batters have all had a good knock headed into the tournament and the bowlers have never let the side down on the big stage. All the pieces are in place for the side to have their best World Cup yet. DM","pubDate":"2023-02-09 20:24:43","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas ready to embrace the responsibility as hosts of the first women's World Cup in Africa","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-ready-to-embrace-the-responsibility-as-hosts-of-the-first-womens-world-cup-in-africa-20230209","keywords":null,"creator":null,"video_url":null,"description":"Proteas skipper Sune Luus says her side is excited and will embrace the challenge of hosting the ICC Women's T20 World Cup.","content":"Proteas skipper Sune Luus says her team understands the responsibility of hosting the ICC Women's T20 World Cup over the next fortnight, as well as the role they could play in inspiring future generations of young women. South Africa open their World Cup campaign against Sri Lanka at Newlands on Friday. It's the first-ever senior Women's World Cup to be played on African soil and the first senior World Cup hosted in South Africa since India won the men's T20 format in 2007. \"It's quite massive. I don't think we quite realise what we already achieved without playing the game. I think it's going to be awesome tomorrow just seeing everyone coming out,\" Luus told reporters at Newlands on Thursday. \"Apart from being successful and winning games, I think there's a responsibility of inspiring a nation as well and inspiring young girls to imagine a career, that they can do anything. \"I think that's one of our biggest roles as a team we would like to play, not just winning games, but also inspiring a nation to give them that opportunity to know that they can be anything they want.\" Fans can now buy tickets for all 23 matches in Cape Town, Paarl and Gqeberha as the top 10 teams in the world vie for the ICC trophy. The Proteas are in a tough Group A alongside Sri Lanka, New Zealand, Bangladesh and defending champions Australia. Luus insists that her side will embrace the pressure as they look to reach an elusive final berth, having reached the semi-final threshold in the 2014 and 2020 editions. \"I think there's always going to be pressure and you're always going to feel it, whether you play at home or not, but I think we've spoken a lot about it and how we would want to go about this World Cup,\" said Luus. \"We just need to embrace the moment and embrace the pressure and take it on and run with it.\" READ | Proteas to let 'cricket do the talking' as excitement builds for T20 Women's World Cup The Proteas come off a Tri-Series title win against West Indies and India. Despite losing their warm-up against England in Stellenbosch this week, they went down swinging in pursuit of a sizeable 247, falling short by 17 runs. In their final warm-up game at Boland Park, Paarl, on Wednesday, they defeated Pakistan by six wickets. Luus believes that Sri Lanka will throw a lot of spin at them and is expecting a used wicket at Newlands following the action of the SA20. \"Newlands is always a good ground to play on. Obviously, with the SA20 a lot of cricket has been played on it. We're not expecting a road... it should be a very good wicket,\" Luus said. \"They're a subcontinent team. They're going to throw a lot of spin overs at us and that's something we've addressed and are well prepared for. \"They also have a well-balanced side with some strong hitters and some players that's just knocking it around and taking those ones and twos. It's going to be a well-balanced game and it's going to be a game for us that we really need to try and be at our best.\" Play on Friday starts at 19:00.","pubDate":"2023-02-09 18:34:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Paine, Vaughan fuel debate around Jadeja interaction","link":"https://thewest.com.au/sport/cricket/paine-vaughan-fuel-debate-around-jadeja-interaction-c-9708546","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Former Australia captain Tim Paine has fuelled a debate around what star India spinner Ravi Jadeja was doing with an unidentified substance near the ball.","content":null,"pubDate":"2023-02-09 17:47:39","image_url":"https://images.thewest.com.au/publication/C-9708546/218b856354d75bf9a825c9cb933ca5b8b41021f5-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Anthony Stewart in 'freakish' injury blow after Aberdeen loan exit","link":"https://www.heraldscotland.com/sport/23311482.anthony-stewart-freakish-injury-blow-aberdeen-loan-exit/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stewart joined MK Dons on loan on transfer-deadline day.","content":"Aberdeen defender Anthony Stewart has left new manager Mark Jackson with his ‘head in his hands’ after being ruled out for weeks with a freakish training-ground injury. Stewart joined MK Dons on loan on transfer-deadline day and was denied an instant debut due to the suspension hanging over him from his League Cup semi-final red card against Rangers. Now, the 30-year-old is sweating on the extent of the unspecified injury that has sidelined him for even longer. Stewart was made Aberdeen skipper by Jim Goodwin after his arrival from Wycombe Wanderers last summer but was allowed to depart on loan after Goodwin was sacked in the wake of embarrassing defeats to Hearts, Darvel and Hibernian. READ MORE: Aberdeen to celebrate 40th anniversary of Cup Winners' Cup success Jackson said: “Anthony Stewart has joined us, done everything right, he’s been playing all season and training all season, and he’s picked up an injury. “We had his suspension, where we had to deal with that, but he’s picked up a freakish injury in training where we have to assess it and look at it in more depth to see what the extent of it is. It was a real kick in the teeth. “We’re hopeful it might not be too long, but we have to prepare ourselves for the worst, just in case. It won’t be days, it’s going to be weeks but there’s no specific timeframe on it yet. “Anthony was devastated. One of the reasons we brought him in was leadership, so he’s keen and he wants to be about the group. “He’s a really, really strong character. It’s a bit of a blow for him, of course it it; it’s knocked him for six a bit. “I had my head in my hands for half-an-hour after I was given the news .” At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football , golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this bespoke piece sent directly to your email inbox for free every day at 5pm, simply take 5 seconds to type in your email here . It's that simple!","pubDate":"2023-02-09 17:09:59","image_url":"https://www.heraldscotland.com/resources/images/16442684/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Handscomb maintains faith after Aussies' dismal day","link":"https://thewest.com.au/sport/cricket/handscomb-maintains-faith-after-aussies-dismal-day-c-9708315","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia are reeling after just one day of the first Test against India in Nagpur, but recalled batter Peter Handscomb says morale remains high in the camp.","content":null,"pubDate":"2023-02-09 16:39:24","image_url":"https://images.thewest.com.au/publication/C-9708315/a250239ebaee8f746f4f00cfdd069a590b8d68d0-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Hyderabad: PV Prabhakar Rao plants sapling at Academia Sports Village","link":"https://telanganatoday.com/hyderabad-pv-prabhakar-rao-plants-sapling-at-academia-sports-village","keywords":["Hyderabad","News","Sport","Aziznagar","Moinabad"],"creator":["Telangana Today"],"video_url":null,"description":"Chairman of PV Global Foundation planted a sapling in the premises of Academia Sports Village in Aziznagar","content":"Home | Sport | Hyderabad Pv Prabhakar Rao Plants Sapling At Academia Sports Village Hyderabad: PV Prabhakar Rao plants sapling at Academia Sports Village Chairman of PV Global Foundation planted a sapling in the premises of Academia Sports Village in Aziznagar By Telangana Today Published Date - 10:00 PM, Thu - 9 February 23 Hyderabad: PV Prabhakar Rao, Chairman of PV Global Foundation and son of former Prime Minister P V Narasimha Rao planted a sapling in the premises of Academia Sports Village in Aziznagar, Moinabad on Thursday. Speaking on the occasion, Prabhakar Rao said, “Strong minds and strong bodies are required for the overall personality development of the youngsters. To build strong bodies there is a need for the youngsters to participate in outdoor activities like sports.” Also Read Jadeja applies “ointment on sore finger”, triggers debate VPG makes it to quarters of SVK Memorial Basketball tournament “Cricket, badminton are the only sports getting attention to a certain extent because of their popularity. Sports like tennis, football, volleyball, hockey and athletics are not getting the focus they deserve,” he added. Follow Us : Tags Aziznagar Hyderabad Moinabad Related News Cargill launches Gemini Pureit sunflower oil in Hyderabad Hyderabad preps for Valentine’s Day Mahindra-owned Automobili Pininfarina unveils Battista in Hyderabad India’s largest musical floating fountain launched in Hyderabad JBR Architecture College commemorates BV DOSHI Four-day conference of radiologists begins in Hyderabad","pubDate":"2023-02-09 16:30:28","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"SA20 | Live scores: Joburg Super Kings v Sunrisers EC semi-final","link":"https://www.thesouthafrican.com/sport/cricket/sa20-live-scores-joburg-super-kings-sunrisers-semi-final-breaking-09-february-2023/","keywords":["Cricket","Featured","Important","latest cricket news","SA20 League"],"creator":["Craig Lewis"],"video_url":null,"description":"Follow the live action as the Joburg Super Kings take on the Sunrisers Eastern Cape in the second SA20 semi-final on Thursday.","content":"Follow the live action as the Joburg Super Kings take on the Sunrisers Eastern Cape in the second SA20 semi-final on Thursday.","pubDate":"2023-02-09 15:54:00","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Jadeja applies “ointment on sore finger”, triggers debate","link":"https://telanganatoday.com/jadeja-applies-ointment-on-sore-finger-triggers-debate","keywords":["News","Sport","Australia","India","Ravindra Jadeja"],"creator":["PTI"],"video_url":null,"description":"A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger","content":"Home | Sport | Jadeja Applies Ointment On Sore Finger Triggers Debate Jadeja applies “ointment on sore finger”, triggers debate A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger By PTI Published Date - 09:08 PM, Thu - 9 February 23 Indias Ravindra Jadeja, is given the ball after getting 5 wickets as he walks back during the first day of the first cricket test match between India and Australia in Nagpur, India, Thursday, Feb. 9, 2023. (AP Photo/Rafiq Maqbool) Nagpur: Ravindra Jadeja drew attention not only for demolishing Australia with his fifer on the opening day of the first Test but also for applying something on his spinning finger, triggering a debate on what it was. A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. Also Read IND v AUS: Australia opt to bat first as SKY, Bharat, Murphy make Test debut When a fan shared the footage with former Australia captain Tim Paine , he replied,”interesting”. However, a BCCI source told PTI that it was an “ointment for pain relief for the sore finger”. David Warner and Steve Smith, who are part of the visiting side, served bans for their role in the ball-tampering scandal in 2018 in South Africa. Follow Us : Tags Australia India Ravindra Jadeja Related News Twitter Blue with verification now in India, starts at Rs 650 per month IND v AUS: Australia opt to bat first as SKY, Bharat, Murphy make Test debut IND vs AUS, 1st Test: Battle of big guns Editorial: Indigenisation gets wings Actual Covid infections in India 17 times higher than reported: BHU study Man admits to killing Indian student in Australia","pubDate":"2023-02-09 15:38:31","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravindra Jadeja applies mysterious substance on finger, Australian fans allege ball tampering","link":"https://economictimes.indiatimes.com/news/sports/ravindra-jadeja-applies-mysterious-substance-on-finger-australian-fans-allege-ball-tampering/articleshow/97780827.cms","keywords":null,"creator":null,"video_url":null,"description":"A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested.","content":"Synopsis A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. When a fan shared the footage with former Australia captain Tim Paine, he replied, \"interesting\". Making a dream comeback after injury, Indian cricketer Ravindra Jadeja today demolished the Australian batting with his five wicket haul in the opening test match of four-match test series in Nagpur. But some Australian fans has released a video alleging that Jadeja tampered the ball during the match. A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. The incident happened when Australia was at 120/5. When a fan shared the footage with former Australia captain Tim Paine , he replied, \"interesting\". @tdpaine36 @StephenEdwin4 What do you think of this @tdpaine36 Looks like one player giving grippo to the bowler an… https://t.co/IiXqlBWTNr — Darren Lock (@Dags_L) 1675929720000 Former England Test captains Michael Vaughan also raised concern on his intent. However, a BCCI source told PTI that it was an \"ointment for pain relief for the sore finger\". Ravindra Jadeja celebrated his return to international cricket after injury with a five-wicket haul as India bowled out Australia for 177 and then cruised to 77-1 to dominate day one of the opening test in Nagpur. The 34-year-old left-arm all rounder suffered a knee injury during India's Asia Cup campaign and has been out of action since September 2022. The star all rounder also missed India's T20 World Cup campaign in Australia. (Inputs from PTI) Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Thursday, 09 Feb, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Brands & Companies ET Markets More RBI Increases Repo Rate by 25 bps to 6.5%, Signals a Pause The Reserve Bank of India (RBI) Wednesday raised policy interest rates by a quarter percentage point, the sixth climb in a row for a key gauge, and signalled the latest increase gives it elbow room to pause before taking a broader directional call on the cost of funds amid widening differences within the rate-setting committee. All-Star Lineup of Speakers at ET GBS 2023 PM Modi to deliver keynote address on opening day of the ET GBS 2023 at The Taj Palace Hotel, New Delhi on February 17-18. Read More News on Ravindra Jadeja News ravindra jadeja india australia jadeja australia tim paine jadeja ball tampering (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Real Estate Interest rates are rising, so are rental yields. Is it the right time to invest in property? 8 mins read 3 insights to kick-start your day, featuring Swiggy’s “poor judgement” 3 mins read Strategy Stock Radar: Technical charts suggest HDFC Bank is likely to hit fresh record highs in next 3-6 months; time to buy? 3 mins read Subscribe to ETPrime","pubDate":"2023-02-09 15:33:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-17610,resizemode-4,msid-97780827/ravindra-jadeja-applies-mysterious-substance-on-finger-australian-fans-allege-ball-tampering.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Markram century carries Sunrisers Eastern Cape into SA20 final","link":"https://www.citizen.co.za/sport/cricket/aiden-markram-sunrisers-eastern-cape-sa20-semi-final/","keywords":["Cricket","Joburg Super Kings","SA20","Sunrisers Eastern Cape"],"creator":["Ken Borland"],"video_url":null,"description":"Sunrisers Eastern Cape will now take on the Pretoria Capitals in the final at the Wanderers on Saturday.","content":"Aiden Markram’s magnificent century flattened Joburg Super Kings before the Sunrisers Eastern Cape bowlers struck at key times to keep a full-throttle run-chase just about under control and win their SA20 semifinal by 14 runs in Centurion on Thursday night. Captain Markram came to the crease under pressure with the Sunrisers on 10/2, having been sent in to bat on a pitch which offered assistance to the new ball. Showing his class, he looked comfortable from the outset but employed a measured approach as he and young Jordan Hermann, who showed admirable composure in scoring 48 off 36 balls, put the innings back on level ground. ALSO READ: Rossouw says ‘fearless’ Capitals are ready for battle in SA20 final Markram went to his half-century off 40 balls and then exploded into an array of punishing strokes all around the ground as he completed the third century of the SA20 just 17 deliveries later. The skipper fell in the penultimate over for 100 off 58 balls, having added 99 off 76 balls with Hermann and then 75 off 31 balls with Tristan Stubbs (20 off 11). Jordan Cox then lifted Sunrisers Eastern Cape to 213/5 with a cameo of 18 not out off six balls. Lizaad Williams was the best of the Joburg bowlers with 4/36 in his four overs, but Gerald Coetzee, who had bowled really well to concede just 16 runs in his first three overs, was pulverised in a final over that cost 27 runs and included two free hits for high full tosses, a wide and two sixes. Coetzee did not have long to ruminate over his misfortune because he was bizarrely sent up the order to open the batting for Super Kings. He then had to watch Joburg’s two most successful performers with the bat, Faf du Plessis, for his second successive first-ball dismissal, and Leus du Plooy depart for ducks. Coetzee could only score 12 off 17 balls, but fortunately for Joburg, Reeza Hendricks batted like he was having a hit in his back garden, keeping them alive with his great effort of 96 off 54 balls. But the early damage and the fact that the Sunrisers kept chipping away by taking wickets at key moments meant the run-rate grew out of control. Donovan Ferreira lashed 20 off 11 balls, but when Romario Shepherd came to the crease, the Super Kings needed 83 off just 28 deliveries. The West Indian plundered 38 not out off just 14 balls to keep the result in the balance, the Sunrisers bowling and fielding getting a bit wild under pressure, but they still needed 44 off the last two overs, which was too much. Left-arm spinner Roelof van der Merwe was once again outstanding with the ball, taking 2/23 in his four overs. Sunrisers Eastern Cape will now be taking on the Pretoria Capitals in the final at the Wanderers on Saturday.","pubDate":"2023-02-09 20:29:50","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/IMG_20230209_193537_1500_x_1000_pixel.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"The moment is now for the Proteas Women to achieve World Cup glory","link":"https://www.dailymaverick.co.za/article/2023-02-09-the-moment-is-now-for-the-proteas-women-to-achieve-world-cup-glory/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"South Africa has never won a cricket World Cup. The Women’s T20 tournament is the perfect opportunity for the country to set that right. The post The moment is now for the Proteas Women to achieve World Cup glory appeared first on Daily Maverick.","content":"The Proteas Women are not the favourites going into the T20 World Cup — starting tomorrow evening at Newlands with South Africa taking on Sri Lanka. In fact, they are only the fifth-ranked team in the format. However, with a monumental tournament on home ground, and arguably their best side yet, there is no better chance for the side to be the first from the country to claim a World Cup trophy. “It’s massive. I don’t think we’ve realised what we’ve already achieved without playing a game,” said team captain Sune Luus at Thursday’s pre-match press conference. Women’s cricket has grown rapidly in the past few years and the South African team has grown with it, becoming one of the leading teams in the world. The Proteas Women played some of their best cricket in the previous edition of the tournament in Australia, topping their group before unluckily going out via the Duckworth-Lewis method to eventual champions Australia. However, skipper Luus believes the side has grown and become better since that bitter defeat in Sydney. “[In the past] three years, a lot of our skills have improved. Going into this World Cup, we’re more confident in our skill set that we have. We have more options going into this tournament as well,” she said. “We’re a more confident side, although we’re very young. We have a very well-balanced side, experience and youth. “It’s very exciting for everyone going into this World Cup just knowing the skill set we have and how we’ve developed over the last few years.” South Africa’s opening match against Sri Lanka won’t be easy, despite the opponents coming into the tournament ranked a lowly eighth. The Newlands wicket has proven to be on the slow side over the course of the SA20 and domestic matches this season which could favour the subcontinent side and their plethora of spin options. The Proteas, though, have decent spin bowling options themselves in all-rounders Chloe Tryon — with her left-arm orthodox bowling — and Luus’ leg breaks. But their main spin threat is that of Nonkululeko Mlaba, who is the No 2-ranked spin bowler in T20. “She’s been fantastic in our team. She’s started at a very young age and she’s grown in leaps and bounds over the last few years in terms of her bowling,” said Luus about Mlaba. “Every game she plays she only gets more confident. She’s going to be vital for us, being our main spinner, controlling the game.” Visit Daily Maverick’s home page for more news, analysis and investigations A healthy South African spin crop bodes well for a side that have relied on the exploits of their fast bowlers for so long. Marizanne Kapp and Shabnim Ismail are still two of the most feared fast bowlers in the game and Ayabonga Khaka, along with Masabata Klaas, always provide more than able support. The quartet are sure to fire, if not against Sri Lanka, then on the slightly quicker wickets at St George’s Park and Boland Park. South Africa’s task does not get any easier after Sri Lanka. They face a potential do-or-die match against New Zealand on Monday — as both teams are likely to be battling it out for second place in group 1 — before they take on world champions Australia the following Saturday. The Proteas Women’s final group stage match is against Bangladesh on Tuesday, 21 February. The semifinals follow on 23 and 24 February before the final on 26 February. In essence, the Proteas only need to play their very best cricket in five matches to go where no other South African cricket side has gone. The World Cup is about more than just winning matches and “success” according to Luus. With the eyes of the country on its women’s side, it is an opportunity to inspire young girls. “Apart from the cricketing things and apart from being successful and winning games, we have a responsibility of inspiring a nation and inspiring young girls to get out of their comfort zones and to imagine a career where they can do anything,” said the skipper. “That is one of our biggest roles as a team we would like to play. Not just winning games but also inspiring a nation to give them the opportunity to know that they can be anything they want.” The role of both inspiring and being successful could add to the pressure South Africa already has as the host nation. But Luus assured that the pressure was there to be embraced. “There’s always going to be pressure and you feel it whether you play at home or not… We just need to embrace the moment and embrace the pressure and run with it. “There’s not much you can do about the pressure and all the people that’s going to be here and all the media saying things. We just have to embrace it and stay in the moment and play good cricket. SA have played two warm-up matches leading up to the tournament. They lost to England by 17 runs on Monday before thumping Pakistan by six wickets on Wednesday. “The results showed a loss and a win but for us, both games were wins for us,” said Luus. England scored a mammoth 246 for seven against the Proteas before the South Africans hit back with 229 for nine in their allotted 20 overs. “Our batting has come a long way. To score 229, that’s massive and our biggest score yet. That’s really cool to see what we can actually do. Pushing that 160s, 170s if the pitches allow that.” South Africa’s batters have all had a good knock headed into the tournament and the bowlers have never let the side down on the big stage. All the pieces are in place for the side to have their best World Cup yet. DM","pubDate":"2023-02-09 20:24:43","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas ready to embrace the responsibility as hosts of the first women's World Cup in Africa","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-ready-to-embrace-the-responsibility-as-hosts-of-the-first-womens-world-cup-in-africa-20230209","keywords":null,"creator":null,"video_url":null,"description":"Proteas skipper Sune Luus says her side is excited and will embrace the challenge of hosting the ICC Women's T20 World Cup.","content":"Proteas skipper Sune Luus says her team understands the responsibility of hosting the ICC Women's T20 World Cup over the next fortnight, as well as the role they could play in inspiring future generations of young women. South Africa open their World Cup campaign against Sri Lanka at Newlands on Friday. It's the first-ever senior Women's World Cup to be played on African soil and the first senior World Cup hosted in South Africa since India won the men's T20 format in 2007. \"It's quite massive. I don't think we quite realise what we already achieved without playing the game. I think it's going to be awesome tomorrow just seeing everyone coming out,\" Luus told reporters at Newlands on Thursday. \"Apart from being successful and winning games, I think there's a responsibility of inspiring a nation as well and inspiring young girls to imagine a career, that they can do anything. \"I think that's one of our biggest roles as a team we would like to play, not just winning games, but also inspiring a nation to give them that opportunity to know that they can be anything they want.\" Fans can now buy tickets for all 23 matches in Cape Town, Paarl and Gqeberha as the top 10 teams in the world vie for the ICC trophy. The Proteas are in a tough Group A alongside Sri Lanka, New Zealand, Bangladesh and defending champions Australia. Luus insists that her side will embrace the pressure as they look to reach an elusive final berth, having reached the semi-final threshold in the 2014 and 2020 editions. \"I think there's always going to be pressure and you're always going to feel it, whether you play at home or not, but I think we've spoken a lot about it and how we would want to go about this World Cup,\" said Luus. \"We just need to embrace the moment and embrace the pressure and take it on and run with it.\" READ | Proteas to let 'cricket do the talking' as excitement builds for T20 Women's World Cup The Proteas come off a Tri-Series title win against West Indies and India. Despite losing their warm-up against England in Stellenbosch this week, they went down swinging in pursuit of a sizeable 247, falling short by 17 runs. In their final warm-up game at Boland Park, Paarl, on Wednesday, they defeated Pakistan by six wickets. Luus believes that Sri Lanka will throw a lot of spin at them and is expecting a used wicket at Newlands following the action of the SA20. \"Newlands is always a good ground to play on. Obviously, with the SA20 a lot of cricket has been played on it. We're not expecting a road... it should be a very good wicket,\" Luus said. \"They're a subcontinent team. They're going to throw a lot of spin overs at us and that's something we've addressed and are well prepared for. \"They also have a well-balanced side with some strong hitters and some players that's just knocking it around and taking those ones and twos. It's going to be a well-balanced game and it's going to be a game for us that we really need to try and be at our best.\" Play on Friday starts at 19:00.","pubDate":"2023-02-09 18:34:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Paine, Vaughan fuel debate around Jadeja interaction","link":"https://thewest.com.au/sport/cricket/paine-vaughan-fuel-debate-around-jadeja-interaction-c-9708546","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Former Australia captain Tim Paine has fuelled a debate around what star India spinner Ravi Jadeja was doing with an unidentified substance near the ball.","content":null,"pubDate":"2023-02-09 17:47:39","image_url":"https://images.thewest.com.au/publication/C-9708546/218b856354d75bf9a825c9cb933ca5b8b41021f5-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Anthony Stewart in 'freakish' injury blow after Aberdeen loan exit","link":"https://www.heraldscotland.com/sport/23311482.anthony-stewart-freakish-injury-blow-aberdeen-loan-exit/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stewart joined MK Dons on loan on transfer-deadline day.","content":"Aberdeen defender Anthony Stewart has left new manager Mark Jackson with his ‘head in his hands’ after being ruled out for weeks with a freakish training-ground injury. Stewart joined MK Dons on loan on transfer-deadline day and was denied an instant debut due to the suspension hanging over him from his League Cup semi-final red card against Rangers. Now, the 30-year-old is sweating on the extent of the unspecified injury that has sidelined him for even longer. Stewart was made Aberdeen skipper by Jim Goodwin after his arrival from Wycombe Wanderers last summer but was allowed to depart on loan after Goodwin was sacked in the wake of embarrassing defeats to Hearts, Darvel and Hibernian. READ MORE: Aberdeen to celebrate 40th anniversary of Cup Winners' Cup success Jackson said: “Anthony Stewart has joined us, done everything right, he’s been playing all season and training all season, and he’s picked up an injury. “We had his suspension, where we had to deal with that, but he’s picked up a freakish injury in training where we have to assess it and look at it in more depth to see what the extent of it is. It was a real kick in the teeth. “We’re hopeful it might not be too long, but we have to prepare ourselves for the worst, just in case. It won’t be days, it’s going to be weeks but there’s no specific timeframe on it yet. “Anthony was devastated. One of the reasons we brought him in was leadership, so he’s keen and he wants to be about the group. “He’s a really, really strong character. It’s a bit of a blow for him, of course it it; it’s knocked him for six a bit. “I had my head in my hands for half-an-hour after I was given the news .” At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football , golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this bespoke piece sent directly to your email inbox for free every day at 5pm, simply take 5 seconds to type in your email here . It's that simple!","pubDate":"2023-02-09 17:09:59","image_url":"https://www.heraldscotland.com/resources/images/16442684/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Handscomb maintains faith after Aussies' dismal day","link":"https://thewest.com.au/sport/cricket/handscomb-maintains-faith-after-aussies-dismal-day-c-9708315","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia are reeling after just one day of the first Test against India in Nagpur, but recalled batter Peter Handscomb says morale remains high in the camp.","content":null,"pubDate":"2023-02-09 16:39:24","image_url":"https://images.thewest.com.au/publication/C-9708315/a250239ebaee8f746f4f00cfdd069a590b8d68d0-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Hyderabad: PV Prabhakar Rao plants sapling at Academia Sports Village","link":"https://telanganatoday.com/hyderabad-pv-prabhakar-rao-plants-sapling-at-academia-sports-village","keywords":["Hyderabad","News","Sport","Aziznagar","Moinabad"],"creator":["Telangana Today"],"video_url":null,"description":"Chairman of PV Global Foundation planted a sapling in the premises of Academia Sports Village in Aziznagar","content":"Home | Sport | Hyderabad Pv Prabhakar Rao Plants Sapling At Academia Sports Village Hyderabad: PV Prabhakar Rao plants sapling at Academia Sports Village Chairman of PV Global Foundation planted a sapling in the premises of Academia Sports Village in Aziznagar By Telangana Today Published Date - 10:00 PM, Thu - 9 February 23 Hyderabad: PV Prabhakar Rao, Chairman of PV Global Foundation and son of former Prime Minister P V Narasimha Rao planted a sapling in the premises of Academia Sports Village in Aziznagar, Moinabad on Thursday. Speaking on the occasion, Prabhakar Rao said, “Strong minds and strong bodies are required for the overall personality development of the youngsters. To build strong bodies there is a need for the youngsters to participate in outdoor activities like sports.” Also Read Jadeja applies “ointment on sore finger”, triggers debate VPG makes it to quarters of SVK Memorial Basketball tournament “Cricket, badminton are the only sports getting attention to a certain extent because of their popularity. Sports like tennis, football, volleyball, hockey and athletics are not getting the focus they deserve,” he added. Follow Us : Tags Aziznagar Hyderabad Moinabad Related News Cargill launches Gemini Pureit sunflower oil in Hyderabad Hyderabad preps for Valentine’s Day Mahindra-owned Automobili Pininfarina unveils Battista in Hyderabad India’s largest musical floating fountain launched in Hyderabad JBR Architecture College commemorates BV DOSHI Four-day conference of radiologists begins in Hyderabad","pubDate":"2023-02-09 16:30:28","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"SA20 | Live scores: Joburg Super Kings v Sunrisers EC semi-final","link":"https://www.thesouthafrican.com/sport/cricket/sa20-live-scores-joburg-super-kings-sunrisers-semi-final-breaking-09-february-2023/","keywords":["Cricket","Featured","Important","latest cricket news","SA20 League"],"creator":["Craig Lewis"],"video_url":null,"description":"Follow the live action as the Joburg Super Kings take on the Sunrisers Eastern Cape in the second SA20 semi-final on Thursday.","content":"Follow the live action as the Joburg Super Kings take on the Sunrisers Eastern Cape in the second SA20 semi-final on Thursday.","pubDate":"2023-02-09 15:54:00","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Jadeja applies “ointment on sore finger”, triggers debate","link":"https://telanganatoday.com/jadeja-applies-ointment-on-sore-finger-triggers-debate","keywords":["News","Sport","Australia","India","Ravindra Jadeja"],"creator":["PTI"],"video_url":null,"description":"A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger","content":"Home | Sport | Jadeja Applies Ointment On Sore Finger Triggers Debate Jadeja applies “ointment on sore finger”, triggers debate A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger By PTI Published Date - 09:08 PM, Thu - 9 February 23 Indias Ravindra Jadeja, is given the ball after getting 5 wickets as he walks back during the first day of the first cricket test match between India and Australia in Nagpur, India, Thursday, Feb. 9, 2023. (AP Photo/Rafiq Maqbool) Nagpur: Ravindra Jadeja drew attention not only for demolishing Australia with his fifer on the opening day of the first Test but also for applying something on his spinning finger, triggering a debate on what it was. A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. Also Read IND v AUS: Australia opt to bat first as SKY, Bharat, Murphy make Test debut When a fan shared the footage with former Australia captain Tim Paine , he replied,”interesting”. However, a BCCI source told PTI that it was an “ointment for pain relief for the sore finger”. David Warner and Steve Smith, who are part of the visiting side, served bans for their role in the ball-tampering scandal in 2018 in South Africa. Follow Us : Tags Australia India Ravindra Jadeja Related News Twitter Blue with verification now in India, starts at Rs 650 per month IND v AUS: Australia opt to bat first as SKY, Bharat, Murphy make Test debut IND vs AUS, 1st Test: Battle of big guns Editorial: Indigenisation gets wings Actual Covid infections in India 17 times higher than reported: BHU study Man admits to killing Indian student in Australia","pubDate":"2023-02-09 15:38:31","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravindra Jadeja applies mysterious substance on finger, Australian fans allege ball tampering","link":"https://economictimes.indiatimes.com/news/sports/ravindra-jadeja-applies-mysterious-substance-on-finger-australian-fans-allege-ball-tampering/articleshow/97780827.cms","keywords":null,"creator":null,"video_url":null,"description":"A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested.","content":"Synopsis A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. When a fan shared the footage with former Australia captain Tim Paine, he replied, \"interesting\". Making a dream comeback after injury, Indian cricketer Ravindra Jadeja today demolished the Australian batting with his five wicket haul in the opening test match of four-match test series in Nagpur. But some Australian fans has released a video alleging that Jadeja tampered the ball during the match. A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. The incident happened when Australia was at 120/5. When a fan shared the footage with former Australia captain Tim Paine , he replied, \"interesting\". @tdpaine36 @StephenEdwin4 What do you think of this @tdpaine36 Looks like one player giving grippo to the bowler an… https://t.co/IiXqlBWTNr — Darren Lock (@Dags_L) 1675929720000 Former England Test captains Michael Vaughan also raised concern on his intent. However, a BCCI source told PTI that it was an \"ointment for pain relief for the sore finger\". Ravindra Jadeja celebrated his return to international cricket after injury with a five-wicket haul as India bowled out Australia for 177 and then cruised to 77-1 to dominate day one of the opening test in Nagpur. The 34-year-old left-arm all rounder suffered a knee injury during India's Asia Cup campaign and has been out of action since September 2022. The star all rounder also missed India's T20 World Cup campaign in Australia. (Inputs from PTI) Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Thursday, 09 Feb, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Brands & Companies ET Markets More RBI Increases Repo Rate by 25 bps to 6.5%, Signals a Pause The Reserve Bank of India (RBI) Wednesday raised policy interest rates by a quarter percentage point, the sixth climb in a row for a key gauge, and signalled the latest increase gives it elbow room to pause before taking a broader directional call on the cost of funds amid widening differences within the rate-setting committee. All-Star Lineup of Speakers at ET GBS 2023 PM Modi to deliver keynote address on opening day of the ET GBS 2023 at The Taj Palace Hotel, New Delhi on February 17-18. Read More News on Ravindra Jadeja News ravindra jadeja india australia jadeja australia tim paine jadeja ball tampering (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Real Estate Interest rates are rising, so are rental yields. Is it the right time to invest in property? 8 mins read 3 insights to kick-start your day, featuring Swiggy’s “poor judgement” 3 mins read Strategy Stock Radar: Technical charts suggest HDFC Bank is likely to hit fresh record highs in next 3-6 months; time to buy? 3 mins read Subscribe to ETPrime","pubDate":"2023-02-09 15:33:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-17610,resizemode-4,msid-97780827/ravindra-jadeja-applies-mysterious-substance-on-finger-australian-fans-allege-ball-tampering.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Markram century carries Sunrisers Eastern Cape into SA20 final","link":"https://www.citizen.co.za/sport/cricket/aiden-markram-sunrisers-eastern-cape-sa20-semi-final/","keywords":["Cricket","Joburg Super Kings","SA20","Sunrisers Eastern Cape"],"creator":["Ken Borland"],"video_url":null,"description":"Sunrisers Eastern Cape will now take on the Pretoria Capitals in the final at the Wanderers on Saturday.","content":"Aiden Markram’s magnificent century flattened Joburg Super Kings before the Sunrisers Eastern Cape bowlers struck at key times to keep a full-throttle run-chase just about under control and win their SA20 semifinal by 14 runs in Centurion on Thursday night. Captain Markram came to the crease under pressure with the Sunrisers on 10/2, having been sent in to bat on a pitch which offered assistance to the new ball. Showing his class, he looked comfortable from the outset but employed a measured approach as he and young Jordan Hermann, who showed admirable composure in scoring 48 off 36 balls, put the innings back on level ground. ALSO READ: Rossouw says ‘fearless’ Capitals are ready for battle in SA20 final Markram went to his half-century off 40 balls and then exploded into an array of punishing strokes all around the ground as he completed the third century of the SA20 just 17 deliveries later. The skipper fell in the penultimate over for 100 off 58 balls, having added 99 off 76 balls with Hermann and then 75 off 31 balls with Tristan Stubbs (20 off 11). Jordan Cox then lifted Sunrisers Eastern Cape to 213/5 with a cameo of 18 not out off six balls. Lizaad Williams was the best of the Joburg bowlers with 4/36 in his four overs, but Gerald Coetzee, who had bowled really well to concede just 16 runs in his first three overs, was pulverised in a final over that cost 27 runs and included two free hits for high full tosses, a wide and two sixes. Coetzee did not have long to ruminate over his misfortune because he was bizarrely sent up the order to open the batting for Super Kings. He then had to watch Joburg’s two most successful performers with the bat, Faf du Plessis, for his second successive first-ball dismissal, and Leus du Plooy depart for ducks. Coetzee could only score 12 off 17 balls, but fortunately for Joburg, Reeza Hendricks batted like he was having a hit in his back garden, keeping them alive with his great effort of 96 off 54 balls. But the early damage and the fact that the Sunrisers kept chipping away by taking wickets at key moments meant the run-rate grew out of control. Donovan Ferreira lashed 20 off 11 balls, but when Romario Shepherd came to the crease, the Super Kings needed 83 off just 28 deliveries. The West Indian plundered 38 not out off just 14 balls to keep the result in the balance, the Sunrisers bowling and fielding getting a bit wild under pressure, but they still needed 44 off the last two overs, which was too much. Left-arm spinner Roelof van der Merwe was once again outstanding with the ball, taking 2/23 in his four overs. Sunrisers Eastern Cape will now be taking on the Pretoria Capitals in the final at the Wanderers on Saturday.","pubDate":"2023-02-09 20:29:50","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/IMG_20230209_193537_1500_x_1000_pixel.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"The moment is now for the Proteas Women to achieve World Cup glory","link":"https://www.dailymaverick.co.za/article/2023-02-09-the-moment-is-now-for-the-proteas-women-to-achieve-world-cup-glory/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"South Africa has never won a cricket World Cup. The Women’s T20 tournament is the perfect opportunity for the country to set that right. The post The moment is now for the Proteas Women to achieve World Cup glory appeared first on Daily Maverick.","content":"The Proteas Women are not the favourites going into the T20 World Cup — starting tomorrow evening at Newlands with South Africa taking on Sri Lanka. In fact, they are only the fifth-ranked team in the format. However, with a monumental tournament on home ground, and arguably their best side yet, there is no better chance for the side to be the first from the country to claim a World Cup trophy. “It’s massive. I don’t think we’ve realised what we’ve already achieved without playing a game,” said team captain Sune Luus at Thursday’s pre-match press conference. Women’s cricket has grown rapidly in the past few years and the South African team has grown with it, becoming one of the leading teams in the world. The Proteas Women played some of their best cricket in the previous edition of the tournament in Australia, topping their group before unluckily going out via the Duckworth-Lewis method to eventual champions Australia. However, skipper Luus believes the side has grown and become better since that bitter defeat in Sydney. “[In the past] three years, a lot of our skills have improved. Going into this World Cup, we’re more confident in our skill set that we have. We have more options going into this tournament as well,” she said. “We’re a more confident side, although we’re very young. We have a very well-balanced side, experience and youth. “It’s very exciting for everyone going into this World Cup just knowing the skill set we have and how we’ve developed over the last few years.” South Africa’s opening match against Sri Lanka won’t be easy, despite the opponents coming into the tournament ranked a lowly eighth. The Newlands wicket has proven to be on the slow side over the course of the SA20 and domestic matches this season which could favour the subcontinent side and their plethora of spin options. The Proteas, though, have decent spin bowling options themselves in all-rounders Chloe Tryon — with her left-arm orthodox bowling — and Luus’ leg breaks. But their main spin threat is that of Nonkululeko Mlaba, who is the No 2-ranked spin bowler in T20. “She’s been fantastic in our team. She’s started at a very young age and she’s grown in leaps and bounds over the last few years in terms of her bowling,” said Luus about Mlaba. “Every game she plays she only gets more confident. She’s going to be vital for us, being our main spinner, controlling the game.” Visit Daily Maverick’s home page for more news, analysis and investigations A healthy South African spin crop bodes well for a side that have relied on the exploits of their fast bowlers for so long. Marizanne Kapp and Shabnim Ismail are still two of the most feared fast bowlers in the game and Ayabonga Khaka, along with Masabata Klaas, always provide more than able support. The quartet are sure to fire, if not against Sri Lanka, then on the slightly quicker wickets at St George’s Park and Boland Park. South Africa’s task does not get any easier after Sri Lanka. They face a potential do-or-die match against New Zealand on Monday — as both teams are likely to be battling it out for second place in group 1 — before they take on world champions Australia the following Saturday. The Proteas Women’s final group stage match is against Bangladesh on Tuesday, 21 February. The semifinals follow on 23 and 24 February before the final on 26 February. In essence, the Proteas only need to play their very best cricket in five matches to go where no other South African cricket side has gone. The World Cup is about more than just winning matches and “success” according to Luus. With the eyes of the country on its women’s side, it is an opportunity to inspire young girls. “Apart from the cricketing things and apart from being successful and winning games, we have a responsibility of inspiring a nation and inspiring young girls to get out of their comfort zones and to imagine a career where they can do anything,” said the skipper. “That is one of our biggest roles as a team we would like to play. Not just winning games but also inspiring a nation to give them the opportunity to know that they can be anything they want.” The role of both inspiring and being successful could add to the pressure South Africa already has as the host nation. But Luus assured that the pressure was there to be embraced. “There’s always going to be pressure and you feel it whether you play at home or not… We just need to embrace the moment and embrace the pressure and run with it. “There’s not much you can do about the pressure and all the people that’s going to be here and all the media saying things. We just have to embrace it and stay in the moment and play good cricket. SA have played two warm-up matches leading up to the tournament. They lost to England by 17 runs on Monday before thumping Pakistan by six wickets on Wednesday. “The results showed a loss and a win but for us, both games were wins for us,” said Luus. England scored a mammoth 246 for seven against the Proteas before the South Africans hit back with 229 for nine in their allotted 20 overs. “Our batting has come a long way. To score 229, that’s massive and our biggest score yet. That’s really cool to see what we can actually do. Pushing that 160s, 170s if the pitches allow that.” South Africa’s batters have all had a good knock headed into the tournament and the bowlers have never let the side down on the big stage. All the pieces are in place for the side to have their best World Cup yet. DM","pubDate":"2023-02-09 20:24:43","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas ready to embrace the responsibility as hosts of the first women's World Cup in Africa","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-ready-to-embrace-the-responsibility-as-hosts-of-the-first-womens-world-cup-in-africa-20230209","keywords":null,"creator":null,"video_url":null,"description":"Proteas skipper Sune Luus says her side is excited and will embrace the challenge of hosting the ICC Women's T20 World Cup.","content":"Proteas skipper Sune Luus says her team understands the responsibility of hosting the ICC Women's T20 World Cup over the next fortnight, as well as the role they could play in inspiring future generations of young women. South Africa open their World Cup campaign against Sri Lanka at Newlands on Friday. It's the first-ever senior Women's World Cup to be played on African soil and the first senior World Cup hosted in South Africa since India won the men's T20 format in 2007. \"It's quite massive. I don't think we quite realise what we already achieved without playing the game. I think it's going to be awesome tomorrow just seeing everyone coming out,\" Luus told reporters at Newlands on Thursday. \"Apart from being successful and winning games, I think there's a responsibility of inspiring a nation as well and inspiring young girls to imagine a career, that they can do anything. \"I think that's one of our biggest roles as a team we would like to play, not just winning games, but also inspiring a nation to give them that opportunity to know that they can be anything they want.\" Fans can now buy tickets for all 23 matches in Cape Town, Paarl and Gqeberha as the top 10 teams in the world vie for the ICC trophy. The Proteas are in a tough Group A alongside Sri Lanka, New Zealand, Bangladesh and defending champions Australia. Luus insists that her side will embrace the pressure as they look to reach an elusive final berth, having reached the semi-final threshold in the 2014 and 2020 editions. \"I think there's always going to be pressure and you're always going to feel it, whether you play at home or not, but I think we've spoken a lot about it and how we would want to go about this World Cup,\" said Luus. \"We just need to embrace the moment and embrace the pressure and take it on and run with it.\" READ | Proteas to let 'cricket do the talking' as excitement builds for T20 Women's World Cup The Proteas come off a Tri-Series title win against West Indies and India. Despite losing their warm-up against England in Stellenbosch this week, they went down swinging in pursuit of a sizeable 247, falling short by 17 runs. In their final warm-up game at Boland Park, Paarl, on Wednesday, they defeated Pakistan by six wickets. Luus believes that Sri Lanka will throw a lot of spin at them and is expecting a used wicket at Newlands following the action of the SA20. \"Newlands is always a good ground to play on. Obviously, with the SA20 a lot of cricket has been played on it. We're not expecting a road... it should be a very good wicket,\" Luus said. \"They're a subcontinent team. They're going to throw a lot of spin overs at us and that's something we've addressed and are well prepared for. \"They also have a well-balanced side with some strong hitters and some players that's just knocking it around and taking those ones and twos. It's going to be a well-balanced game and it's going to be a game for us that we really need to try and be at our best.\" Play on Friday starts at 19:00.","pubDate":"2023-02-09 18:34:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Paine, Vaughan fuel debate around Jadeja interaction","link":"https://thewest.com.au/sport/cricket/paine-vaughan-fuel-debate-around-jadeja-interaction-c-9708546","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Former Australia captain Tim Paine has fuelled a debate around what star India spinner Ravi Jadeja was doing with an unidentified substance near the ball.","content":null,"pubDate":"2023-02-09 17:47:39","image_url":"https://images.thewest.com.au/publication/C-9708546/218b856354d75bf9a825c9cb933ca5b8b41021f5-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Anthony Stewart in 'freakish' injury blow after Aberdeen loan exit","link":"https://www.heraldscotland.com/sport/23311482.anthony-stewart-freakish-injury-blow-aberdeen-loan-exit/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stewart joined MK Dons on loan on transfer-deadline day.","content":"Aberdeen defender Anthony Stewart has left new manager Mark Jackson with his ‘head in his hands’ after being ruled out for weeks with a freakish training-ground injury. Stewart joined MK Dons on loan on transfer-deadline day and was denied an instant debut due to the suspension hanging over him from his League Cup semi-final red card against Rangers. Now, the 30-year-old is sweating on the extent of the unspecified injury that has sidelined him for even longer. Stewart was made Aberdeen skipper by Jim Goodwin after his arrival from Wycombe Wanderers last summer but was allowed to depart on loan after Goodwin was sacked in the wake of embarrassing defeats to Hearts, Darvel and Hibernian. READ MORE: Aberdeen to celebrate 40th anniversary of Cup Winners' Cup success Jackson said: “Anthony Stewart has joined us, done everything right, he’s been playing all season and training all season, and he’s picked up an injury. “We had his suspension, where we had to deal with that, but he’s picked up a freakish injury in training where we have to assess it and look at it in more depth to see what the extent of it is. It was a real kick in the teeth. “We’re hopeful it might not be too long, but we have to prepare ourselves for the worst, just in case. It won’t be days, it’s going to be weeks but there’s no specific timeframe on it yet. “Anthony was devastated. One of the reasons we brought him in was leadership, so he’s keen and he wants to be about the group. “He’s a really, really strong character. It’s a bit of a blow for him, of course it it; it’s knocked him for six a bit. “I had my head in my hands for half-an-hour after I was given the news .” At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football , golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this bespoke piece sent directly to your email inbox for free every day at 5pm, simply take 5 seconds to type in your email here . It's that simple!","pubDate":"2023-02-09 17:09:59","image_url":"https://www.heraldscotland.com/resources/images/16442684/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Handscomb maintains faith after Aussies' dismal day","link":"https://thewest.com.au/sport/cricket/handscomb-maintains-faith-after-aussies-dismal-day-c-9708315","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia are reeling after just one day of the first Test against India in Nagpur, but recalled batter Peter Handscomb says morale remains high in the camp.","content":null,"pubDate":"2023-02-09 16:39:24","image_url":"https://images.thewest.com.au/publication/C-9708315/a250239ebaee8f746f4f00cfdd069a590b8d68d0-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Hyderabad: PV Prabhakar Rao plants sapling at Academia Sports Village","link":"https://telanganatoday.com/hyderabad-pv-prabhakar-rao-plants-sapling-at-academia-sports-village","keywords":["Hyderabad","News","Sport","Aziznagar","Moinabad"],"creator":["Telangana Today"],"video_url":null,"description":"Chairman of PV Global Foundation planted a sapling in the premises of Academia Sports Village in Aziznagar","content":"Home | Sport | Hyderabad Pv Prabhakar Rao Plants Sapling At Academia Sports Village Hyderabad: PV Prabhakar Rao plants sapling at Academia Sports Village Chairman of PV Global Foundation planted a sapling in the premises of Academia Sports Village in Aziznagar By Telangana Today Published Date - 10:00 PM, Thu - 9 February 23 Hyderabad: PV Prabhakar Rao, Chairman of PV Global Foundation and son of former Prime Minister P V Narasimha Rao planted a sapling in the premises of Academia Sports Village in Aziznagar, Moinabad on Thursday. Speaking on the occasion, Prabhakar Rao said, “Strong minds and strong bodies are required for the overall personality development of the youngsters. To build strong bodies there is a need for the youngsters to participate in outdoor activities like sports.” Also Read Jadeja applies “ointment on sore finger”, triggers debate VPG makes it to quarters of SVK Memorial Basketball tournament “Cricket, badminton are the only sports getting attention to a certain extent because of their popularity. Sports like tennis, football, volleyball, hockey and athletics are not getting the focus they deserve,” he added. Follow Us : Tags Aziznagar Hyderabad Moinabad Related News Cargill launches Gemini Pureit sunflower oil in Hyderabad Hyderabad preps for Valentine’s Day Mahindra-owned Automobili Pininfarina unveils Battista in Hyderabad India’s largest musical floating fountain launched in Hyderabad JBR Architecture College commemorates BV DOSHI Four-day conference of radiologists begins in Hyderabad","pubDate":"2023-02-09 16:30:28","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"SA20 | Live scores: Joburg Super Kings v Sunrisers EC semi-final","link":"https://www.thesouthafrican.com/sport/cricket/sa20-live-scores-joburg-super-kings-sunrisers-semi-final-breaking-09-february-2023/","keywords":["Cricket","Featured","Important","latest cricket news","SA20 League"],"creator":["Craig Lewis"],"video_url":null,"description":"Follow the live action as the Joburg Super Kings take on the Sunrisers Eastern Cape in the second SA20 semi-final on Thursday.","content":"Follow the live action as the Joburg Super Kings take on the Sunrisers Eastern Cape in the second SA20 semi-final on Thursday.","pubDate":"2023-02-09 15:54:00","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Jadeja applies “ointment on sore finger”, triggers debate","link":"https://telanganatoday.com/jadeja-applies-ointment-on-sore-finger-triggers-debate","keywords":["News","Sport","Australia","India","Ravindra Jadeja"],"creator":["PTI"],"video_url":null,"description":"A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger","content":"Home | Sport | Jadeja Applies Ointment On Sore Finger Triggers Debate Jadeja applies “ointment on sore finger”, triggers debate A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger By PTI Published Date - 09:08 PM, Thu - 9 February 23 Indias Ravindra Jadeja, is given the ball after getting 5 wickets as he walks back during the first day of the first cricket test match between India and Australia in Nagpur, India, Thursday, Feb. 9, 2023. (AP Photo/Rafiq Maqbool) Nagpur: Ravindra Jadeja drew attention not only for demolishing Australia with his fifer on the opening day of the first Test but also for applying something on his spinning finger, triggering a debate on what it was. A video made way to social media, showing Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. Also Read IND v AUS: Australia opt to bat first as SKY, Bharat, Murphy make Test debut When a fan shared the footage with former Australia captain Tim Paine , he replied,”interesting”. However, a BCCI source told PTI that it was an “ointment for pain relief for the sore finger”. David Warner and Steve Smith, who are part of the visiting side, served bans for their role in the ball-tampering scandal in 2018 in South Africa. Follow Us : Tags Australia India Ravindra Jadeja Related News Twitter Blue with verification now in India, starts at Rs 650 per month IND v AUS: Australia opt to bat first as SKY, Bharat, Murphy make Test debut IND vs AUS, 1st Test: Battle of big guns Editorial: Indigenisation gets wings Actual Covid infections in India 17 times higher than reported: BHU study Man admits to killing Indian student in Australia","pubDate":"2023-02-09 15:38:31","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravindra Jadeja applies mysterious substance on finger, Australian fans allege ball tampering","link":"https://economictimes.indiatimes.com/news/sports/ravindra-jadeja-applies-mysterious-substance-on-finger-australian-fans-allege-ball-tampering/articleshow/97780827.cms","keywords":null,"creator":null,"video_url":null,"description":"A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested.","content":"Synopsis A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. When a fan shared the footage with former Australia captain Tim Paine, he replied, \"interesting\". Making a dream comeback after injury, Indian cricketer Ravindra Jadeja today demolished the Australian batting with his five wicket haul in the opening test match of four-match test series in Nagpur. But some Australian fans has released a video alleging that Jadeja tampered the ball during the match. A video has gone viral on the social media in which Jadeja can be seen applying a mysterious substance on his bowling finger that has triggering a debate on what it was. The video shows Jadeja receiving something from his teammate Mohammed Siraj and then applying and rubbing that on his left index finger, something that had Australian media and a former player interested. The incident happened when Australia was at 120/5. When a fan shared the footage with former Australia captain Tim Paine , he replied, \"interesting\". @tdpaine36 @StephenEdwin4 What do you think of this @tdpaine36 Looks like one player giving grippo to the bowler an… https://t.co/IiXqlBWTNr — Darren Lock (@Dags_L) 1675929720000 Former England Test captains Michael Vaughan also raised concern on his intent. However, a BCCI source told PTI that it was an \"ointment for pain relief for the sore finger\". Ravindra Jadeja celebrated his return to international cricket after injury with a five-wicket haul as India bowled out Australia for 177 and then cruised to 77-1 to dominate day one of the opening test in Nagpur. The 34-year-old left-arm all rounder suffered a knee injury during India's Asia Cup campaign and has been out of action since September 2022. The star all rounder also missed India's T20 World Cup campaign in Australia. (Inputs from PTI) Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Thursday, 09 Feb, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Brands & Companies ET Markets More RBI Increases Repo Rate by 25 bps to 6.5%, Signals a Pause The Reserve Bank of India (RBI) Wednesday raised policy interest rates by a quarter percentage point, the sixth climb in a row for a key gauge, and signalled the latest increase gives it elbow room to pause before taking a broader directional call on the cost of funds amid widening differences within the rate-setting committee. All-Star Lineup of Speakers at ET GBS 2023 PM Modi to deliver keynote address on opening day of the ET GBS 2023 at The Taj Palace Hotel, New Delhi on February 17-18. Read More News on Ravindra Jadeja News ravindra jadeja india australia jadeja australia tim paine jadeja ball tampering (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Real Estate Interest rates are rising, so are rental yields. Is it the right time to invest in property? 8 mins read 3 insights to kick-start your day, featuring Swiggy’s “poor judgement” 3 mins read Strategy Stock Radar: Technical charts suggest HDFC Bank is likely to hit fresh record highs in next 3-6 months; time to buy? 3 mins read Subscribe to ETPrime","pubDate":"2023-02-09 15:33:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-17610,resizemode-4,msid-97780827/ravindra-jadeja-applies-mysterious-substance-on-finger-australian-fans-allege-ball-tampering.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"}]}