{"newsArray":[{"title":"Sri Lanka Under 19s tour UAE under Daniel’s captaincy","link":"http://island.lk/sri-lanka-under-19s-tour-uae-under-daniels-captaincy/","keywords":["Sports","Sri Lanka under-19 Cricket","UAE"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College […]","content":"Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:38","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sri Devananda take a step closer to Division I promotion","link":"http://island.lk/sri-devananda-take-a-step-closer-to-division-i-promotion/","keywords":["Sports","Sri Lankan Under 19 Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division II Tier A Cricket quarter-finals by Reemus Fernando Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. […]","content":"Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:36","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Neththaru stars with century as St. Servatius’ dominate day one","link":"http://island.lk/neththaru-stars-with-century-as-st-servatius-dominate-day-on/","keywords":["Sports","Chiran Neththaru","Under 19 Division I Tier ‘B’"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division I Tier ‘B’ Cricket quarter-finals Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order […]","content":"Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:23","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Dickwella – a monster the selectors created","link":"http://island.lk/dickwella-a-monster-the-selectors-created/","keywords":["Sports","Featured","Niroshan Dikwella"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Rex Clementine There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little […]","content":"There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps.","pubDate":"2023-03-14 23:55:19","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ricky Ponting New Home: 20 मिलियन डॉलर खर्च करके रिकी पोंटिंग ने खरीदा एक शानदार घर, देखें इस हवेली की कुछ बेहद खूबसूरत पिक्चर्स","link":"https://www.abplive.com/photo-gallery/sports/cricket-former-australian-captain-ricky-ponting-bought-a-dream-home-at-20-million-dollars-at-toorak-melbourne-2358207","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":null,"content":"ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग ने मेलबर्न के एक शानदार इलाके तूराक में अपने लिए एक बेहतरीन घर खरीदा है. इस घर के लिए रिकी पोंटिंग ने पूरे 20 मिलियन डॉलर खर्च किए हैं. ऑस्ट्रेलियाई मीडिया में आई खबरों के मुताबिक, हवेली को उसकी तय कीमत से ज्यादा में बेचा गया है. (फोटो - FORBES GLOBAL PROPERTIES) इस हवेली की प्राइज गाइड $19 मिलियन से $20.6 मिलियन के बीच में था, लेकिन इसे पोंटिंग ने 20.75 मिलियन डॉलर में खरीदा है. आइए हम आपको इस घर की खूबसूरत पिक्चर्स के साथ इसकी कुछ डिटेल्स भी बताते हैं. (फोटो - Realestate.com.au) द एज की एक रिपोर्ट के अनुसार रिकी पोंटिंग की यह नई हवेली मेलबर्न के टॉप यानी सबसे अच्छे इलाके में मौजूद है. इस घर का क्षेत्रफल 1400 स्क्वॉयर मीटर है. (फोटो - Realestate.com.au) इस घर में एक ओपन प्लान वाला इनडोर-आउटडोर लीविंग स्पेस दिया गया है. इस घर में रॉट-लोहे की सीढ़ियां बनी हुई है. (फोटो - Realestate.com.au) इस घर में एक शानदार किचन भी मौजूद है, जो कई आधुनिक सुविधाओं से लैस है. इस रसोईघर की सतह संगमरमर से बनी हुई है. (फोटो - FORBES GLOBAL PROPERTIES) रिकी पोंटिंग के इस नए घर में एक शानदार टेनिस कोर्ट भी मौजूद है. 6 बेडरूम वाले रिकी पोंटिंग के इस घर में दुनियाभर की तमाम सुविधाएं मौजूद है. (फोटो - FORBES GLOBAL PROPERTIES) Delhi Riots 2020: दिल्ली दंगा मामले में 9 लोगों को कोर्ट ने ठहराया दोषी, कहा- एक समुदाय विशेष को नुकसान पहुंचाना था मकसद","pubDate":"2023-03-14 16:44:45","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/3a27c4c50a56e07118a16a59259672d21678811214579428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI-W vs GG-W, 1 Innings Highlight: मुंबई ने दिया 163 रनों का लक्ष्य, हरमनप्रीत कौर तूफानी अर्धशतक","link":"https://www.abplive.com/sports/cricket/wpl-2023-mi-w-given-target-of-163-runs-against-gg-w-in-match-12-at-brabourne-stadium-2358192","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"WPL 2023: महिला प्रीमियर लीग के पहले सीजन का 12वां मैच मुंबई इंडियंस और गुजरात जायंट्स के बीच में खेला जा रहा है. इस मैच में गुजरात ने टॉस जीतकर मुंबई को बल्लेबाजी का न्यौता दिया और पहले ही ओवर में हेली मैथ्यूज को आउट करके मुंबई को एक बड़ा झटका दे दिया. हालांकि, उसके बाद मुंबई की महिलाओं ने पारी को संभाला और टीम का स्कोर 160 रनों के पार पहुंचा दिया. मुंबई की विकेटकीपर ओपनर बल्लेबाज यस्तिका भाटिया ने  37 गेंदों में 44 रनों की पारी खेली और नेट सीवर ब्रंट ने भी 31 गेंदों में 36 रनों की पारी खेलकर उनका भरपूर साथ दिया. धीमी शुरुआत करने वाली मुंबई की टीम ने बाद में काफी तेजी से रन बनाए, जिसमें सबसे ज्यादा योगदान हरमनप्रीत कौर ने दिया. हरमनप्रीत ने फिर खेली बढ़िया पारी मुंबई की कप्तान हरमनप्रीत कौर ने 30 गेंदों में 51 रनों की पारी खेलकर अपनी टीम को एक सम्मानजनक स्कोर तक पहुंचा दिया. इन तीन बल्लेबाजों के अलावा मुंबई की ओर से कोई भी बड़ी पारी नहीं खेल पाया. मुबई की टीम ने 20 ओवर में 8 विकेट खोकर 162 रन बनाए हैं. उधर, गुजरात की गेंदबाजी पर गौर करें तो उनकी टीम से एशले गार्डनर ने 4 ओवर में 34 रन देकर सबसे ज्यादा 3 विकेट हासिल किए. उनके अलावा किम गार्थ, कप्तान स्नेह राणा, और तनुजा कंवर ने भी एक-एक विकेट हासिल किया है. अब देखना होगा कि गुजरात टाइटन्स इस मैच में मुंबई को हराकर अपना पुराना हिसाब चुक्ता कर पाती है या नहीं. आपको बता दें कि महिला आईपीएल 2023 के पहले मैच में मुंबई ने गुजरात को 143 रन से शर्मनाक हार दी थी. उस मैच में मुंबई ने 20 ओवर में 5 विकेट खोकर 207 रन बनाए थे और फिर गुजरात की टीम को सिर्फ 64 रनों पर ऑल आउट कर दिया था. ऐसे में महिला प्रीमियर लीग के इस दूसरे राउंड में गुजरात के पास 163 रन बनाकर मुंबई से बदला लेने का शानदार मौका है.  यह भी पढ़ें: IPL 2023: आईपीएल के 16वें सीजन में ये पांच खिलाड़ी करा सकते हैं चेन्नई सुपर किंग्स की दमदार वापसी","content":"WPL 2023: महिला प्रीमियर लीग के पहले सीजन का 12वां मैच मुंबई इंडियंस और गुजरात जायंट्स के बीच में खेला जा रहा है. इस मैच में गुजरात ने टॉस जीतकर मुंबई को बल्लेबाजी का न्यौता दिया और पहले ही ओवर में हेली मैथ्यूज को आउट करके मुंबई को एक बड़ा झटका दे दिया. हालांकि, उसके बाद मुंबई की महिलाओं ने पारी को संभाला और टीम का स्कोर 160 रनों के पार पहुंचा दिया. मुंबई की विकेटकीपर ओपनर बल्लेबाज यस्तिका भाटिया ने 37 गेंदों में 44 रनों की पारी खेली और नेट सीवर ब्रंट ने भी 31 गेंदों में 36 रनों की पारी खेलकर उनका भरपूर साथ दिया. धीमी शुरुआत करने वाली मुंबई की टीम ने बाद में काफी तेजी से रन बनाए, जिसमें सबसे ज्यादा योगदान हरमनप्रीत कौर ने दिया. हरमनप्रीत ने फिर खेली बढ़िया पारी मुंबई की कप्तान हरमनप्रीत कौर ने 30 गेंदों में 51 रनों की पारी खेलकर अपनी टीम को एक सम्मानजनक स्कोर तक पहुंचा दिया. इन तीन बल्लेबाजों के अलावा मुंबई की ओर से कोई भी बड़ी पारी नहीं खेल पाया. मुबई की टीम ने 20 ओवर में 8 विकेट खोकर 162 रन बनाए हैं. उधर, गुजरात की गेंदबाजी पर गौर करें तो उनकी टीम से एशले गार्डनर ने 4 ओवर में 34 रन देकर सबसे ज्यादा 3 विकेट हासिल किए. उनके अलावा किम गार्थ, कप्तान स्नेह राणा, और तनुजा कंवर ने भी एक-एक विकेट हासिल किया है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); अब देखना होगा कि गुजरात टाइटन्स इस मैच में मुंबई को हराकर अपना पुराना हिसाब चुक्ता कर पाती है या नहीं. आपको बता दें कि महिला आईपीएल 2023 के पहले मैच में मुंबई ने गुजरात को 143 रन से शर्मनाक हार दी थी. उस मैच में मुंबई ने 20 ओवर में 5 विकेट खोकर 207 रन बनाए थे और फिर गुजरात की टीम को सिर्फ 64 रनों पर ऑल आउट कर दिया था. ऐसे में महिला प्रीमियर लीग के इस दूसरे राउंड में गुजरात के पास 163 रन बनाकर मुंबई से बदला लेने का शानदार मौका है. यह भी पढ़ें: IPL 2023: आईपीएल के 16वें सीजन में ये पांच खिलाड़ी करा सकते हैं चेन्नई सुपर किंग्स की दमदार वापसी","pubDate":"2023-03-14 16:43:26","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/34e5d7d694c3854ec3b3d5e6f898d1591678809584419428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Exclusive: IPL 2023 में कौन लेगा ऋषभ पंत की जगह, क्या सरफराज खान करेंगे विकेटकीपिंग? abp से बातचीत में कैफ ने दिया जवाब","link":"https://www.abplive.com/sports/cricket/who-will-replace-rishabh-pant-in-ipl-2023-sarfaraz-khan-play-as-a-wicketkeeper-mohammad-kaif-interview-2358203","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Mohammad Kaif Interview In Hindi: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने आईपीएल 2023 में ऋषभ पंत के रिप्लेसमेंट और सरफराज खान के विकेटकीपिंग करने के बारे में बातचीत की. इसके अलावा और भी कई पहलुओं पर कैफ ने खुलकर बात की.  इंटरव्यू में जब मोहम्मद कैफ से ऋषभ पंत की चोट के बारे में बात की तो उन्होंने जवाब दिया, \"मेरी ऋषभ पंत से बातचीत हुई. वह तेजी से रिकवरी कर रहे हैं. वह ठीक हैं अब. जो उनके साथ घटना घटी वो काफी दुर्भाग्यपूर्ण थी. लेकिन वह काफी मज़बूत खिलाड़ी हैं, इसीलिए आप जल्द ही उन्हें भारतीय जर्सी में देखेंगे.\"  वहीं आईपीएल 2023 में ऋषभ पंत की जगह कौन लेगा? कौन उनकी जगह विकेटकीपिंग करेगा? कई रिपोर्ट्स में कहा जा रहा है कि सरफराज खान दिल्ली के विकेटकीपर होंगे. इस सवाल के जवाब में कैफ ने कहा, दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है.  आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं.  उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स.  यह भी पढ़ें- Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","content":"Mohammad Kaif Interview In Hindi: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने आईपीएल 2023 में ऋषभ पंत के रिप्लेसमेंट और सरफराज खान के विकेटकीपिंग करने के बारे में बातचीत की. इसके अलावा और भी कई पहलुओं पर कैफ ने खुलकर बात की. इंटरव्यू में जब मोहम्मद कैफ से ऋषभ पंत की चोट के बारे में बात की तो उन्होंने जवाब दिया, \"मेरी ऋषभ पंत से बातचीत हुई. वह तेजी से रिकवरी कर रहे हैं. वह ठीक हैं अब. जो उनके साथ घटना घटी वो काफी दुर्भाग्यपूर्ण थी. लेकिन वह काफी मज़बूत खिलाड़ी हैं, इसीलिए आप जल्द ही उन्हें भारतीय जर्सी में देखेंगे.\" वहीं आईपीएल 2023 में ऋषभ पंत की जगह कौन लेगा? कौन उनकी जगह विकेटकीपिंग करेगा? कई रिपोर्ट्स में कहा जा रहा है कि सरफराज खान दिल्ली के विकेटकीपर होंगे. इस सवाल के जवाब में कैफ ने कहा, दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है. आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स. यह भी पढ़ें- Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","pubDate":"2023-03-14 16:39:10","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/05a397304a7ba4bce6ab1d2ccfe541be1678810491274143_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: क्या रोहित शर्मा के बाद टीम के नियमित कप्तान होंगे हार्दिक पांड्या?, सुनील गावस्कर ने दिया जवाब","link":"https://www.abplive.com/sports/cricket/sunil-gavaskar-says-can-almost-stamp-hardik-pandya-as-india-captain-once-2023-world-cup-is-over-after-rohit-sharma-2358197","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sunil Gavaskar On Hardik Pandya: ऑस्ट्रेलिया के खिलाफ 3 वनडे मैचों की सीरीज के पहले मैच में रोहित शर्मा नहीं होंगे. रोहित शर्मा की गैरमौजूदगी में ऑलराउंडर हार्दिक पांड्या टीम के कप्तान होंगे. हालांकि, ऑस्ट्रेलिया के खिलाफ दूसरे वनडे मैच में रोहित शर्मा की वापसी होगी. यानि, रोहित शर्मा सीरीज के दूसरे मैच में टीम के कप्तान होंगे. बहरहाल, पूर्व भारतीय क्रिकेटर सुनील गावस्कर ने ऑलराउंडर हार्दिक पांड्या की कप्तानी पर बड़ा बयान दिया है. साथ ही उन्होंने बताया कि कप्तान के तौर पर हार्दिक पांड्या का भविष्य क्या होगा? सुनील गावस्कर ने हार्दिक पांड्या की कप्तानी पर क्या कहा? पूर्व भारतीय क्रिकेटर सुनील गावस्कर का मानना है कि रोहित शर्मा वनडे वर्ल्ड कप 2023 तक टीम के कप्तान होंगे, लेकिन इस टूर्नामेंट के बाद हार्दिक पांड्या को भारतीय टी20 और वनडे टीम का नियमित कप्तान बना दिया जाएगा. उन्होंने कहा कि हार्दिक पांड्या कप्तान के तौर पर खिलाड़ियों को अपना नेचुरल गेम खेलने की आजादी देते हैं. साथ ही उन्होंने कहा कि आईपीएल में गुजरात टाइटंस के लिए हार्दिक पांड्या ने खुद को बल्लेबाजी क्रम में प्रमोट किया. पिछले सीजन में वह बल्लेबाजी करने के लिए टॉप में उतरे. यह शानदार फैसला था. रोहित शर्मा की जगह टीम के नए कप्तान होंगे हार्दिक पांड्या! सुनील गावस्कर ने कहा कि हार्दिक पांड्या ने वनडे मैचों के अलावा टी20 में शानदार कप्तानी का नजारा पेश किया है. खासकर, आईपीएल में इस खिलाड़ी ने गजब का नेतृत्व किया. हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस ने आईपीएल 2022 अपने नाम किया. जबकि गुजरात टाइटंस की टीम पहली आईपीएल में खेल रही थी. साथ ही उन्होंने कहा कि जिस तरह हार्दिक पांड्या ने अपनी कप्तानी क्षमता का प्रदर्शन किया है, मुझे पूरा भरोसा है कि रोहित शर्मा के बाद इस खिलाड़ी को कप्तान बनाया जाएगा. यह खिलाड़ी रोहित शर्मा के बाद कप्तान बनने के लिए सबसे बेहतरीन विकल्पों में एक है. ये भी पढ़ें- IND vs AUS 1st ODI: वनडे में कप्तानी करना हार्दिक पांड्या के लिए नहीं होगा आसान, जानें क्या है बड़ी चुनौती","content":"Sunil Gavaskar On Hardik Pandya: ऑस्ट्रेलिया के खिलाफ 3 वनडे मैचों की सीरीज के पहले मैच में रोहित शर्मा नहीं होंगे. रोहित शर्मा की गैरमौजूदगी में ऑलराउंडर हार्दिक पांड्या टीम के कप्तान होंगे. हालांकि, ऑस्ट्रेलिया के खिलाफ दूसरे वनडे मैच में रोहित शर्मा की वापसी होगी. यानि, रोहित शर्मा सीरीज के दूसरे मैच में टीम के कप्तान होंगे. बहरहाल, पूर्व भारतीय क्रिकेटर सुनील गावस्कर ने ऑलराउंडर हार्दिक पांड्या की कप्तानी पर बड़ा बयान दिया है. साथ ही उन्होंने बताया कि कप्तान के तौर पर हार्दिक पांड्या का भविष्य क्या होगा? सुनील गावस्कर ने हार्दिक पांड्या की कप्तानी पर क्या कहा? पूर्व भारतीय क्रिकेटर सुनील गावस्कर का मानना है कि रोहित शर्मा वनडे वर्ल्ड कप 2023 तक टीम के कप्तान होंगे, लेकिन इस टूर्नामेंट के बाद हार्दिक पांड्या को भारतीय टी20 और वनडे टीम का नियमित कप्तान बना दिया जाएगा. उन्होंने कहा कि हार्दिक पांड्या कप्तान के तौर पर खिलाड़ियों को अपना नेचुरल गेम खेलने की आजादी देते हैं. साथ ही उन्होंने कहा कि आईपीएल में गुजरात टाइटंस के लिए हार्दिक पांड्या ने खुद को बल्लेबाजी क्रम में प्रमोट किया. पिछले सीजन में वह बल्लेबाजी करने के लिए टॉप में उतरे. यह शानदार फैसला था. रोहित शर्मा की जगह टीम के नए कप्तान होंगे हार्दिक पांड्या! googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सुनील गावस्कर ने कहा कि हार्दिक पांड्या ने वनडे मैचों के अलावा टी20 में शानदार कप्तानी का नजारा पेश किया है. खासकर, आईपीएल में इस खिलाड़ी ने गजब का नेतृत्व किया. हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस ने आईपीएल 2022 अपने नाम किया. जबकि गुजरात टाइटंस की टीम पहली आईपीएल में खेल रही थी. साथ ही उन्होंने कहा कि जिस तरह हार्दिक पांड्या ने अपनी कप्तानी क्षमता का प्रदर्शन किया है, मुझे पूरा भरोसा है कि रोहित शर्मा के बाद इस खिलाड़ी को कप्तान बनाया जाएगा. यह खिलाड़ी रोहित शर्मा के बाद कप्तान बनने के लिए सबसे बेहतरीन विकल्पों में एक है. ये भी पढ़ें- IND vs AUS 1st ODI: वनडे में कप्तानी करना हार्दिक पांड्या के लिए नहीं होगा आसान, जानें क्या है बड़ी चुनौती","pubDate":"2023-03-14 16:13:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/4d6557bc64cd51ace63165c4fc1832581678810167973428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","link":"https://www.abplive.com/sports/cricket/who-is-better-captain-in-ms-dhoni-and-sourav-ganguly-mohammad-kaif-exclusive-interview-abp-news-2358173","keywords":["Cricket"],"creator":["मोहम्मद वाहिद"],"video_url":null,"description":"Mohammad Kaif On MS Dhoni And Sourav Ganguly: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने एमएस धोनी और सौरव गांगुली की कैप्टेंसी, ऋषभ पंत की चोट और दिल्ली कैपिटल्स के संभावित कप्तान को लेकर बातचीत की.  इंटरव्यू में जब कैफ से पूछा गया कि महेंद्र सिंह धोनी और सौरव गांगुली में बेहतर कप्तान कौन था, और दोनों की कैप्टेंसी स्टाइल में क्या फर्क है? इसके जवाब में कैफ ने कहा, \"दादा ने ही धोनी को बनाया. हमेशा उनको सपोर्ट किया. गांगुली साहब ने ही धोनी को टीम में लिया और उनको तैयार किया.\" कैफ ने आगे कहा कि वैसे मैं खिलाड़ियों की तुलना करने में विश्वास नहीं रखता हूं.   विश्व के सर्वश्रेष्ठ फिल्डिरों में से एक रहे कैफ ने आगे कहा, भारतीय क्रिकेट के लिए यह अच्छा रहा कि धोनी और गांगुली दोनों देश के लिए खेले. पहले दादा आए और उन्होंने खिलाड़ियों को सपोर्ट किया और टीम तैयार की और फिर धोनी आए और उसे आगे ले गए.  कैफ से आगे जब उनके बेस्ट फील्डर के बारे में पूछा गया तो उन्होंने जवाब दिया, \"रवींद्र जडेजा मौजूदा वक्त में विश्व के सबसे बेस्ट फील्डर हैं. मुझे जडेजा की फील्डिंग बहुत पसंद है. मैं उन्हें करीब 11 सालों से फॉलो कर रहा हूं. वह कैच नहीं छोड़ते हैं. उनका थ्रो भी एकदम सटीक रहता है. आप उनसे कहीं भी फील्डिंग करा सकते हैं. जडेजा को देखकर मुझे अपनी याद आ जाती है.\" क्या सरफराज खान दिल्ली कैपिटल्स में लेंगे ऋषभ पंत की जगह लेंगे? इस सवाल के जवाब में कैफ ने कहा, \"दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है.  आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं.  उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स. ","content":"Mohammad Kaif On MS Dhoni And Sourav Ganguly: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने एमएस धोनी और सौरव गांगुली की कैप्टेंसी, ऋषभ पंत की चोट और दिल्ली कैपिटल्स के संभावित कप्तान को लेकर बातचीत की. इंटरव्यू में जब कैफ से पूछा गया कि महेंद्र सिंह धोनी और सौरव गांगुली में बेहतर कप्तान कौन था, और दोनों की कैप्टेंसी स्टाइल में क्या फर्क है? इसके जवाब में कैफ ने कहा, \"दादा ने ही धोनी को बनाया. हमेशा उनको सपोर्ट किया. गांगुली साहब ने ही धोनी को टीम में लिया और उनको तैयार किया.\" कैफ ने आगे कहा कि वैसे मैं खिलाड़ियों की तुलना करने में विश्वास नहीं रखता हूं. विश्व के सर्वश्रेष्ठ फिल्डिरों में से एक रहे कैफ ने आगे कहा, भारतीय क्रिकेट के लिए यह अच्छा रहा कि धोनी और गांगुली दोनों देश के लिए खेले. पहले दादा आए और उन्होंने खिलाड़ियों को सपोर्ट किया और टीम तैयार की और फिर धोनी आए और उसे आगे ले गए. कैफ से आगे जब उनके बेस्ट फील्डर के बारे में पूछा गया तो उन्होंने जवाब दिया, \"रवींद्र जडेजा मौजूदा वक्त में विश्व के सबसे बेस्ट फील्डर हैं. मुझे जडेजा की फील्डिंग बहुत पसंद है. मैं उन्हें करीब 11 सालों से फॉलो कर रहा हूं. वह कैच नहीं छोड़ते हैं. उनका थ्रो भी एकदम सटीक रहता है. आप उनसे कहीं भी फील्डिंग करा सकते हैं. जडेजा को देखकर मुझे अपनी याद आ जाती है.\" googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); क्या सरफराज खान दिल्ली कैपिटल्स में लेंगे ऋषभ पंत की जगह लेंगे? इस सवाल के जवाब में कैफ ने कहा, \"दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है. आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं. उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स.","pubDate":"2023-03-14 15:59:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/8d07620540da1320bbfcce1d870085261678807997794143_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: टेस्ट के बाद वनडे में भी गरजेगा विराट का बल्ला! तीनों स्टेडियम में है कमाल का रिकॉर्ड","link":"https://www.abplive.com/sports/cricket/ind-vs-aus-virat-kohli-kohli-is-ready-for-odi-series-against-australia-see-the-batting-records-of-all-three-stadium-here-2358166","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs AUS, Virat Kohli: भारतीय टीम ने ऑस्ट्रेलिया को चार मैचों की टेस्ट सीरीज (Border Gavaskar Trophy) में 2-1 से मात देकर सीरीज पर अपना कब्जा कर लिया है. अब दोनों टीमों के बीच 17 मार्च से तीन वनडे की जंग शुरू होगी. दोनों टीमों के बीच तीन मैचों की वनडे सीरीज वानखेड़े, विजाग और चेन्नई में खेला जाएगा. वहीं वनडे सीरीज में भारत के लिए बल्ले से विराट कोहली एक बार फिर कमाल कर सकते हैं. अहमदाबाद में खेले गए आखिरी टेस्ट में विराट ने शानदार 186 रनों की शतकीय पारी खेली थी. विराट अभी कमाल के फॉर्म में हैं. वहीं उनका उन तीनों स्टेडियम में शानदार रिकॉर्ड है जहां वनडे के मुकाबले होने वाले हैं. तीनों स्टेडियम में खूब चलता है विराट को बल्ला वानखेड़े स्टेडिय में भारत और ऑस्ट्रेलिया कि बीच 17 मार्च को पहला वनडे मुकाबला खेला जाएगा. इस स्टेडियम में विराट का प्रदर्शन शानदार रहा है. 2011 से 2020 तक में विराट ने यहां कुल 5 मैच खेले हैं. जिसमें उन्होंने 66.25 की शानदार औसत और 1 शतक और 1 अर्धशतक की मदद से शानदार 265 रन बनाए हैं. वहीं विजाग के डॉ. वाई एस राजशेखर स्टेडियम में विराट ने साल 2010 से लेकर 2019 तक 5 मैच खेल हैं. इस दौरान उन्होंने 157 रनों की शानदार पारी भी खेली है. यहां विराट को बैटिंग करना काफी पसंद है. खास बात यह भी है कि इस मैदान पर टीम इंडिया को हर मैच में जीत नसीब हुई है. वनडे सीरीज का आखिरी मुकाबला 22 मार्च को चेन्नई के चेपॉक स्टेडियम में खेला जाएगा. इस मैदान पर विराट ने 2010 से लेकर 2019 के बीच कुल 7 मैच खेले हैं. इन मुकाबले में विराट ने 283 रन बनाए हैं. विराट ने इस मैदान पर 1 शतक और 2 अर्धशतक ठोका है.       भारत और ऑस्ट्रेलिया की वनडे टीम भारत की वनडे टीम: रोहित शर्मा (कप्तान) युजवेंद्र चहल, ईशान किशन, श्रेयस अय्यर, रवीद्र जडेजा, विराट कोहली, कुलदीप यादव, मोहम्मद शमी, मोहम्मद सिराज, हार्दिक पंड्या, अक्षर पटेल, केएल राहुल, शुभमन गिल, शार्दुल ठाकुर, उमरान मलिक, जयदेव उनादकट, वाशिंगटन सुंदर, सुर्यकुमार यादव.  ऑस्ट्रेलिया की वनडे टीम: पैट कमिंस (कप्तान) सीन एबॉट, एश्टन एगर, एलेक्स कैरी, नाथन एलिस, कैमरून ग्रीन, ट्रेविस हेड, जोस इंग्लिस, मार्नस लाबुशेन, मिचेल मार्श, ग्लेन मैक्सवेल, स्टीव स्मिथ, मिचेल स्टार्क, मार्क स्टोइनिस, डेविड वार्नर, एडम जैंपा. यह भी पढ़ें: ENG vs BAN: बांग्लादेश ने टी20 सीरीज में वर्ल्ड चैंपियन इंग्लैंड का सूपड़ा साफ कर रचा इतिहास, जानें मैच का हाल","content":"IND vs AUS, Virat Kohli: भारतीय टीम ने ऑस्ट्रेलिया को चार मैचों की टेस्ट सीरीज (Border Gavaskar Trophy) में 2-1 से मात देकर सीरीज पर अपना कब्जा कर लिया है. अब दोनों टीमों के बीच 17 मार्च से तीन वनडे की जंग शुरू होगी. दोनों टीमों के बीच तीन मैचों की वनडे सीरीज वानखेड़े, विजाग और चेन्नई में खेला जाएगा. वहीं वनडे सीरीज में भारत के लिए बल्ले से विराट कोहली एक बार फिर कमाल कर सकते हैं. अहमदाबाद में खेले गए आखिरी टेस्ट में विराट ने शानदार 186 रनों की शतकीय पारी खेली थी. विराट अभी कमाल के फॉर्म में हैं. वहीं उनका उन तीनों स्टेडियम में शानदार रिकॉर्ड है जहां वनडे के मुकाबले होने वाले हैं. तीनों स्टेडियम में खूब चलता है विराट को बल्ला वानखेड़े स्टेडिय में भारत और ऑस्ट्रेलिया कि बीच 17 मार्च को पहला वनडे मुकाबला खेला जाएगा. इस स्टेडियम में विराट का प्रदर्शन शानदार रहा है. 2011 से 2020 तक में विराट ने यहां कुल 5 मैच खेले हैं. जिसमें उन्होंने 66.25 की शानदार औसत और 1 शतक और 1 अर्धशतक की मदद से शानदार 265 रन बनाए हैं. वहीं विजाग के डॉ. वाई एस राजशेखर स्टेडियम में विराट ने साल 2010 से लेकर 2019 तक 5 मैच खेल हैं. इस दौरान उन्होंने 157 रनों की शानदार पारी भी खेली है. यहां विराट को बैटिंग करना काफी पसंद है. खास बात यह भी है कि इस मैदान पर टीम इंडिया को हर मैच में जीत नसीब हुई है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); वनडे सीरीज का आखिरी मुकाबला 22 मार्च को चेन्नई के चेपॉक स्टेडियम में खेला जाएगा. इस मैदान पर विराट ने 2010 से लेकर 2019 के बीच कुल 7 मैच खेले हैं. इन मुकाबले में विराट ने 283 रन बनाए हैं. विराट ने इस मैदान पर 1 शतक और 2 अर्धशतक ठोका है. भारत और ऑस्ट्रेलिया की वनडे टीम भारत की वनडे टीम: रोहित शर्मा (कप्तान) युजवेंद्र चहल, ईशान किशन, श्रेयस अय्यर, रवीद्र जडेजा, विराट कोहली, कुलदीप यादव, मोहम्मद शमी, मोहम्मद सिराज, हार्दिक पंड्या, अक्षर पटेल, केएल राहुल, शुभमन गिल, शार्दुल ठाकुर, उमरान मलिक, जयदेव उनादकट, वाशिंगटन सुंदर, सुर्यकुमार यादव. ऑस्ट्रेलिया की वनडे टीम: पैट कमिंस (कप्तान) सीन एबॉट, एश्टन एगर, एलेक्स कैरी, नाथन एलिस, कैमरून ग्रीन, ट्रेविस हेड, जोस इंग्लिस, मार्नस लाबुशेन, मिचेल मार्श, ग्लेन मैक्सवेल, स्टीव स्मिथ, मिचेल स्टार्क, मार्क स्टोइनिस, डेविड वार्नर, एडम जैंपा. यह भी पढ़ें: ENG vs BAN: बांग्लादेश ने टी20 सीरीज में वर्ल्ड चैंपियन इंग्लैंड का सूपड़ा साफ कर रचा इतिहास, जानें मैच का हाल","pubDate":"2023-03-14 15:55:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/bc4973a8f36fa18885af4fd7d34181bf1678807308461127_original.avif","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka Under 19s tour UAE under Daniel’s captaincy","link":"http://island.lk/sri-lanka-under-19s-tour-uae-under-daniels-captaincy/","keywords":["Sports","Sri Lanka under-19 Cricket","UAE"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College […]","content":"Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:38","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sri Devananda take a step closer to Division I promotion","link":"http://island.lk/sri-devananda-take-a-step-closer-to-division-i-promotion/","keywords":["Sports","Sri Lankan Under 19 Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division II Tier A Cricket quarter-finals by Reemus Fernando Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. […]","content":"Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:36","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Neththaru stars with century as St. Servatius’ dominate day one","link":"http://island.lk/neththaru-stars-with-century-as-st-servatius-dominate-day-on/","keywords":["Sports","Chiran Neththaru","Under 19 Division I Tier ‘B’"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division I Tier ‘B’ Cricket quarter-finals Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order […]","content":"Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:23","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Dickwella – a monster the selectors created","link":"http://island.lk/dickwella-a-monster-the-selectors-created/","keywords":["Sports","Featured","Niroshan Dikwella"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Rex Clementine There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little […]","content":"There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps.","pubDate":"2023-03-14 23:55:19","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ricky Ponting New Home: 20 मिलियन डॉलर खर्च करके रिकी पोंटिंग ने खरीदा एक शानदार घर, देखें इस हवेली की कुछ बेहद खूबसूरत पिक्चर्स","link":"https://www.abplive.com/photo-gallery/sports/cricket-former-australian-captain-ricky-ponting-bought-a-dream-home-at-20-million-dollars-at-toorak-melbourne-2358207","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":null,"content":"ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग ने मेलबर्न के एक शानदार इलाके तूराक में अपने लिए एक बेहतरीन घर खरीदा है. इस घर के लिए रिकी पोंटिंग ने पूरे 20 मिलियन डॉलर खर्च किए हैं. ऑस्ट्रेलियाई मीडिया में आई खबरों के मुताबिक, हवेली को उसकी तय कीमत से ज्यादा में बेचा गया है. (फोटो - FORBES GLOBAL PROPERTIES) इस हवेली की प्राइज गाइड $19 मिलियन से $20.6 मिलियन के बीच में था, लेकिन इसे पोंटिंग ने 20.75 मिलियन डॉलर में खरीदा है. आइए हम आपको इस घर की खूबसूरत पिक्चर्स के साथ इसकी कुछ डिटेल्स भी बताते हैं. (फोटो - Realestate.com.au) द एज की एक रिपोर्ट के अनुसार रिकी पोंटिंग की यह नई हवेली मेलबर्न के टॉप यानी सबसे अच्छे इलाके में मौजूद है. इस घर का क्षेत्रफल 1400 स्क्वॉयर मीटर है. (फोटो - Realestate.com.au) इस घर में एक ओपन प्लान वाला इनडोर-आउटडोर लीविंग स्पेस दिया गया है. इस घर में रॉट-लोहे की सीढ़ियां बनी हुई है. (फोटो - Realestate.com.au) इस घर में एक शानदार किचन भी मौजूद है, जो कई आधुनिक सुविधाओं से लैस है. इस रसोईघर की सतह संगमरमर से बनी हुई है. (फोटो - FORBES GLOBAL PROPERTIES) रिकी पोंटिंग के इस नए घर में एक शानदार टेनिस कोर्ट भी मौजूद है. 6 बेडरूम वाले रिकी पोंटिंग के इस घर में दुनियाभर की तमाम सुविधाएं मौजूद है. (फोटो - FORBES GLOBAL PROPERTIES) Delhi Riots 2020: दिल्ली दंगा मामले में 9 लोगों को कोर्ट ने ठहराया दोषी, कहा- एक समुदाय विशेष को नुकसान पहुंचाना था मकसद","pubDate":"2023-03-14 16:44:45","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/3a27c4c50a56e07118a16a59259672d21678811214579428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI-W vs GG-W, 1 Innings Highlight: मुंबई ने दिया 163 रनों का लक्ष्य, हरमनप्रीत कौर तूफानी अर्धशतक","link":"https://www.abplive.com/sports/cricket/wpl-2023-mi-w-given-target-of-163-runs-against-gg-w-in-match-12-at-brabourne-stadium-2358192","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"WPL 2023: महिला प्रीमियर लीग के पहले सीजन का 12वां मैच मुंबई इंडियंस और गुजरात जायंट्स के बीच में खेला जा रहा है. इस मैच में गुजरात ने टॉस जीतकर मुंबई को बल्लेबाजी का न्यौता दिया और पहले ही ओवर में हेली मैथ्यूज को आउट करके मुंबई को एक बड़ा झटका दे दिया. हालांकि, उसके बाद मुंबई की महिलाओं ने पारी को संभाला और टीम का स्कोर 160 रनों के पार पहुंचा दिया. मुंबई की विकेटकीपर ओपनर बल्लेबाज यस्तिका भाटिया ने  37 गेंदों में 44 रनों की पारी खेली और नेट सीवर ब्रंट ने भी 31 गेंदों में 36 रनों की पारी खेलकर उनका भरपूर साथ दिया. धीमी शुरुआत करने वाली मुंबई की टीम ने बाद में काफी तेजी से रन बनाए, जिसमें सबसे ज्यादा योगदान हरमनप्रीत कौर ने दिया. हरमनप्रीत ने फिर खेली बढ़िया पारी मुंबई की कप्तान हरमनप्रीत कौर ने 30 गेंदों में 51 रनों की पारी खेलकर अपनी टीम को एक सम्मानजनक स्कोर तक पहुंचा दिया. इन तीन बल्लेबाजों के अलावा मुंबई की ओर से कोई भी बड़ी पारी नहीं खेल पाया. मुबई की टीम ने 20 ओवर में 8 विकेट खोकर 162 रन बनाए हैं. उधर, गुजरात की गेंदबाजी पर गौर करें तो उनकी टीम से एशले गार्डनर ने 4 ओवर में 34 रन देकर सबसे ज्यादा 3 विकेट हासिल किए. उनके अलावा किम गार्थ, कप्तान स्नेह राणा, और तनुजा कंवर ने भी एक-एक विकेट हासिल किया है. अब देखना होगा कि गुजरात टाइटन्स इस मैच में मुंबई को हराकर अपना पुराना हिसाब चुक्ता कर पाती है या नहीं. आपको बता दें कि महिला आईपीएल 2023 के पहले मैच में मुंबई ने गुजरात को 143 रन से शर्मनाक हार दी थी. उस मैच में मुंबई ने 20 ओवर में 5 विकेट खोकर 207 रन बनाए थे और फिर गुजरात की टीम को सिर्फ 64 रनों पर ऑल आउट कर दिया था. ऐसे में महिला प्रीमियर लीग के इस दूसरे राउंड में गुजरात के पास 163 रन बनाकर मुंबई से बदला लेने का शानदार मौका है.  यह भी पढ़ें: IPL 2023: आईपीएल के 16वें सीजन में ये पांच खिलाड़ी करा सकते हैं चेन्नई सुपर किंग्स की दमदार वापसी","content":"WPL 2023: महिला प्रीमियर लीग के पहले सीजन का 12वां मैच मुंबई इंडियंस और गुजरात जायंट्स के बीच में खेला जा रहा है. इस मैच में गुजरात ने टॉस जीतकर मुंबई को बल्लेबाजी का न्यौता दिया और पहले ही ओवर में हेली मैथ्यूज को आउट करके मुंबई को एक बड़ा झटका दे दिया. हालांकि, उसके बाद मुंबई की महिलाओं ने पारी को संभाला और टीम का स्कोर 160 रनों के पार पहुंचा दिया. मुंबई की विकेटकीपर ओपनर बल्लेबाज यस्तिका भाटिया ने 37 गेंदों में 44 रनों की पारी खेली और नेट सीवर ब्रंट ने भी 31 गेंदों में 36 रनों की पारी खेलकर उनका भरपूर साथ दिया. धीमी शुरुआत करने वाली मुंबई की टीम ने बाद में काफी तेजी से रन बनाए, जिसमें सबसे ज्यादा योगदान हरमनप्रीत कौर ने दिया. हरमनप्रीत ने फिर खेली बढ़िया पारी मुंबई की कप्तान हरमनप्रीत कौर ने 30 गेंदों में 51 रनों की पारी खेलकर अपनी टीम को एक सम्मानजनक स्कोर तक पहुंचा दिया. इन तीन बल्लेबाजों के अलावा मुंबई की ओर से कोई भी बड़ी पारी नहीं खेल पाया. मुबई की टीम ने 20 ओवर में 8 विकेट खोकर 162 रन बनाए हैं. उधर, गुजरात की गेंदबाजी पर गौर करें तो उनकी टीम से एशले गार्डनर ने 4 ओवर में 34 रन देकर सबसे ज्यादा 3 विकेट हासिल किए. उनके अलावा किम गार्थ, कप्तान स्नेह राणा, और तनुजा कंवर ने भी एक-एक विकेट हासिल किया है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); अब देखना होगा कि गुजरात टाइटन्स इस मैच में मुंबई को हराकर अपना पुराना हिसाब चुक्ता कर पाती है या नहीं. आपको बता दें कि महिला आईपीएल 2023 के पहले मैच में मुंबई ने गुजरात को 143 रन से शर्मनाक हार दी थी. उस मैच में मुंबई ने 20 ओवर में 5 विकेट खोकर 207 रन बनाए थे और फिर गुजरात की टीम को सिर्फ 64 रनों पर ऑल आउट कर दिया था. ऐसे में महिला प्रीमियर लीग के इस दूसरे राउंड में गुजरात के पास 163 रन बनाकर मुंबई से बदला लेने का शानदार मौका है. यह भी पढ़ें: IPL 2023: आईपीएल के 16वें सीजन में ये पांच खिलाड़ी करा सकते हैं चेन्नई सुपर किंग्स की दमदार वापसी","pubDate":"2023-03-14 16:43:26","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/34e5d7d694c3854ec3b3d5e6f898d1591678809584419428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Exclusive: IPL 2023 में कौन लेगा ऋषभ पंत की जगह, क्या सरफराज खान करेंगे विकेटकीपिंग? abp से बातचीत में कैफ ने दिया जवाब","link":"https://www.abplive.com/sports/cricket/who-will-replace-rishabh-pant-in-ipl-2023-sarfaraz-khan-play-as-a-wicketkeeper-mohammad-kaif-interview-2358203","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Mohammad Kaif Interview In Hindi: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने आईपीएल 2023 में ऋषभ पंत के रिप्लेसमेंट और सरफराज खान के विकेटकीपिंग करने के बारे में बातचीत की. इसके अलावा और भी कई पहलुओं पर कैफ ने खुलकर बात की.  इंटरव्यू में जब मोहम्मद कैफ से ऋषभ पंत की चोट के बारे में बात की तो उन्होंने जवाब दिया, \"मेरी ऋषभ पंत से बातचीत हुई. वह तेजी से रिकवरी कर रहे हैं. वह ठीक हैं अब. जो उनके साथ घटना घटी वो काफी दुर्भाग्यपूर्ण थी. लेकिन वह काफी मज़बूत खिलाड़ी हैं, इसीलिए आप जल्द ही उन्हें भारतीय जर्सी में देखेंगे.\"  वहीं आईपीएल 2023 में ऋषभ पंत की जगह कौन लेगा? कौन उनकी जगह विकेटकीपिंग करेगा? कई रिपोर्ट्स में कहा जा रहा है कि सरफराज खान दिल्ली के विकेटकीपर होंगे. इस सवाल के जवाब में कैफ ने कहा, दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है.  आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं.  उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स.  यह भी पढ़ें- Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","content":"Mohammad Kaif Interview In Hindi: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने आईपीएल 2023 में ऋषभ पंत के रिप्लेसमेंट और सरफराज खान के विकेटकीपिंग करने के बारे में बातचीत की. इसके अलावा और भी कई पहलुओं पर कैफ ने खुलकर बात की. इंटरव्यू में जब मोहम्मद कैफ से ऋषभ पंत की चोट के बारे में बात की तो उन्होंने जवाब दिया, \"मेरी ऋषभ पंत से बातचीत हुई. वह तेजी से रिकवरी कर रहे हैं. वह ठीक हैं अब. जो उनके साथ घटना घटी वो काफी दुर्भाग्यपूर्ण थी. लेकिन वह काफी मज़बूत खिलाड़ी हैं, इसीलिए आप जल्द ही उन्हें भारतीय जर्सी में देखेंगे.\" वहीं आईपीएल 2023 में ऋषभ पंत की जगह कौन लेगा? कौन उनकी जगह विकेटकीपिंग करेगा? कई रिपोर्ट्स में कहा जा रहा है कि सरफराज खान दिल्ली के विकेटकीपर होंगे. इस सवाल के जवाब में कैफ ने कहा, दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है. आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स. यह भी पढ़ें- Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","pubDate":"2023-03-14 16:39:10","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/05a397304a7ba4bce6ab1d2ccfe541be1678810491274143_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: क्या रोहित शर्मा के बाद टीम के नियमित कप्तान होंगे हार्दिक पांड्या?, सुनील गावस्कर ने दिया जवाब","link":"https://www.abplive.com/sports/cricket/sunil-gavaskar-says-can-almost-stamp-hardik-pandya-as-india-captain-once-2023-world-cup-is-over-after-rohit-sharma-2358197","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sunil Gavaskar On Hardik Pandya: ऑस्ट्रेलिया के खिलाफ 3 वनडे मैचों की सीरीज के पहले मैच में रोहित शर्मा नहीं होंगे. रोहित शर्मा की गैरमौजूदगी में ऑलराउंडर हार्दिक पांड्या टीम के कप्तान होंगे. हालांकि, ऑस्ट्रेलिया के खिलाफ दूसरे वनडे मैच में रोहित शर्मा की वापसी होगी. यानि, रोहित शर्मा सीरीज के दूसरे मैच में टीम के कप्तान होंगे. बहरहाल, पूर्व भारतीय क्रिकेटर सुनील गावस्कर ने ऑलराउंडर हार्दिक पांड्या की कप्तानी पर बड़ा बयान दिया है. साथ ही उन्होंने बताया कि कप्तान के तौर पर हार्दिक पांड्या का भविष्य क्या होगा? सुनील गावस्कर ने हार्दिक पांड्या की कप्तानी पर क्या कहा? पूर्व भारतीय क्रिकेटर सुनील गावस्कर का मानना है कि रोहित शर्मा वनडे वर्ल्ड कप 2023 तक टीम के कप्तान होंगे, लेकिन इस टूर्नामेंट के बाद हार्दिक पांड्या को भारतीय टी20 और वनडे टीम का नियमित कप्तान बना दिया जाएगा. उन्होंने कहा कि हार्दिक पांड्या कप्तान के तौर पर खिलाड़ियों को अपना नेचुरल गेम खेलने की आजादी देते हैं. साथ ही उन्होंने कहा कि आईपीएल में गुजरात टाइटंस के लिए हार्दिक पांड्या ने खुद को बल्लेबाजी क्रम में प्रमोट किया. पिछले सीजन में वह बल्लेबाजी करने के लिए टॉप में उतरे. यह शानदार फैसला था. रोहित शर्मा की जगह टीम के नए कप्तान होंगे हार्दिक पांड्या! सुनील गावस्कर ने कहा कि हार्दिक पांड्या ने वनडे मैचों के अलावा टी20 में शानदार कप्तानी का नजारा पेश किया है. खासकर, आईपीएल में इस खिलाड़ी ने गजब का नेतृत्व किया. हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस ने आईपीएल 2022 अपने नाम किया. जबकि गुजरात टाइटंस की टीम पहली आईपीएल में खेल रही थी. साथ ही उन्होंने कहा कि जिस तरह हार्दिक पांड्या ने अपनी कप्तानी क्षमता का प्रदर्शन किया है, मुझे पूरा भरोसा है कि रोहित शर्मा के बाद इस खिलाड़ी को कप्तान बनाया जाएगा. यह खिलाड़ी रोहित शर्मा के बाद कप्तान बनने के लिए सबसे बेहतरीन विकल्पों में एक है. ये भी पढ़ें- IND vs AUS 1st ODI: वनडे में कप्तानी करना हार्दिक पांड्या के लिए नहीं होगा आसान, जानें क्या है बड़ी चुनौती","content":"Sunil Gavaskar On Hardik Pandya: ऑस्ट्रेलिया के खिलाफ 3 वनडे मैचों की सीरीज के पहले मैच में रोहित शर्मा नहीं होंगे. रोहित शर्मा की गैरमौजूदगी में ऑलराउंडर हार्दिक पांड्या टीम के कप्तान होंगे. हालांकि, ऑस्ट्रेलिया के खिलाफ दूसरे वनडे मैच में रोहित शर्मा की वापसी होगी. यानि, रोहित शर्मा सीरीज के दूसरे मैच में टीम के कप्तान होंगे. बहरहाल, पूर्व भारतीय क्रिकेटर सुनील गावस्कर ने ऑलराउंडर हार्दिक पांड्या की कप्तानी पर बड़ा बयान दिया है. साथ ही उन्होंने बताया कि कप्तान के तौर पर हार्दिक पांड्या का भविष्य क्या होगा? सुनील गावस्कर ने हार्दिक पांड्या की कप्तानी पर क्या कहा? पूर्व भारतीय क्रिकेटर सुनील गावस्कर का मानना है कि रोहित शर्मा वनडे वर्ल्ड कप 2023 तक टीम के कप्तान होंगे, लेकिन इस टूर्नामेंट के बाद हार्दिक पांड्या को भारतीय टी20 और वनडे टीम का नियमित कप्तान बना दिया जाएगा. उन्होंने कहा कि हार्दिक पांड्या कप्तान के तौर पर खिलाड़ियों को अपना नेचुरल गेम खेलने की आजादी देते हैं. साथ ही उन्होंने कहा कि आईपीएल में गुजरात टाइटंस के लिए हार्दिक पांड्या ने खुद को बल्लेबाजी क्रम में प्रमोट किया. पिछले सीजन में वह बल्लेबाजी करने के लिए टॉप में उतरे. यह शानदार फैसला था. रोहित शर्मा की जगह टीम के नए कप्तान होंगे हार्दिक पांड्या! googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सुनील गावस्कर ने कहा कि हार्दिक पांड्या ने वनडे मैचों के अलावा टी20 में शानदार कप्तानी का नजारा पेश किया है. खासकर, आईपीएल में इस खिलाड़ी ने गजब का नेतृत्व किया. हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस ने आईपीएल 2022 अपने नाम किया. जबकि गुजरात टाइटंस की टीम पहली आईपीएल में खेल रही थी. साथ ही उन्होंने कहा कि जिस तरह हार्दिक पांड्या ने अपनी कप्तानी क्षमता का प्रदर्शन किया है, मुझे पूरा भरोसा है कि रोहित शर्मा के बाद इस खिलाड़ी को कप्तान बनाया जाएगा. यह खिलाड़ी रोहित शर्मा के बाद कप्तान बनने के लिए सबसे बेहतरीन विकल्पों में एक है. ये भी पढ़ें- IND vs AUS 1st ODI: वनडे में कप्तानी करना हार्दिक पांड्या के लिए नहीं होगा आसान, जानें क्या है बड़ी चुनौती","pubDate":"2023-03-14 16:13:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/4d6557bc64cd51ace63165c4fc1832581678810167973428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","link":"https://www.abplive.com/sports/cricket/who-is-better-captain-in-ms-dhoni-and-sourav-ganguly-mohammad-kaif-exclusive-interview-abp-news-2358173","keywords":["Cricket"],"creator":["मोहम्मद वाहिद"],"video_url":null,"description":"Mohammad Kaif On MS Dhoni And Sourav Ganguly: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने एमएस धोनी और सौरव गांगुली की कैप्टेंसी, ऋषभ पंत की चोट और दिल्ली कैपिटल्स के संभावित कप्तान को लेकर बातचीत की.  इंटरव्यू में जब कैफ से पूछा गया कि महेंद्र सिंह धोनी और सौरव गांगुली में बेहतर कप्तान कौन था, और दोनों की कैप्टेंसी स्टाइल में क्या फर्क है? इसके जवाब में कैफ ने कहा, \"दादा ने ही धोनी को बनाया. हमेशा उनको सपोर्ट किया. गांगुली साहब ने ही धोनी को टीम में लिया और उनको तैयार किया.\" कैफ ने आगे कहा कि वैसे मैं खिलाड़ियों की तुलना करने में विश्वास नहीं रखता हूं.   विश्व के सर्वश्रेष्ठ फिल्डिरों में से एक रहे कैफ ने आगे कहा, भारतीय क्रिकेट के लिए यह अच्छा रहा कि धोनी और गांगुली दोनों देश के लिए खेले. पहले दादा आए और उन्होंने खिलाड़ियों को सपोर्ट किया और टीम तैयार की और फिर धोनी आए और उसे आगे ले गए.  कैफ से आगे जब उनके बेस्ट फील्डर के बारे में पूछा गया तो उन्होंने जवाब दिया, \"रवींद्र जडेजा मौजूदा वक्त में विश्व के सबसे बेस्ट फील्डर हैं. मुझे जडेजा की फील्डिंग बहुत पसंद है. मैं उन्हें करीब 11 सालों से फॉलो कर रहा हूं. वह कैच नहीं छोड़ते हैं. उनका थ्रो भी एकदम सटीक रहता है. आप उनसे कहीं भी फील्डिंग करा सकते हैं. जडेजा को देखकर मुझे अपनी याद आ जाती है.\" क्या सरफराज खान दिल्ली कैपिटल्स में लेंगे ऋषभ पंत की जगह लेंगे? इस सवाल के जवाब में कैफ ने कहा, \"दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है.  आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं.  उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स. ","content":"Mohammad Kaif On MS Dhoni And Sourav Ganguly: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने एमएस धोनी और सौरव गांगुली की कैप्टेंसी, ऋषभ पंत की चोट और दिल्ली कैपिटल्स के संभावित कप्तान को लेकर बातचीत की. इंटरव्यू में जब कैफ से पूछा गया कि महेंद्र सिंह धोनी और सौरव गांगुली में बेहतर कप्तान कौन था, और दोनों की कैप्टेंसी स्टाइल में क्या फर्क है? इसके जवाब में कैफ ने कहा, \"दादा ने ही धोनी को बनाया. हमेशा उनको सपोर्ट किया. गांगुली साहब ने ही धोनी को टीम में लिया और उनको तैयार किया.\" कैफ ने आगे कहा कि वैसे मैं खिलाड़ियों की तुलना करने में विश्वास नहीं रखता हूं. विश्व के सर्वश्रेष्ठ फिल्डिरों में से एक रहे कैफ ने आगे कहा, भारतीय क्रिकेट के लिए यह अच्छा रहा कि धोनी और गांगुली दोनों देश के लिए खेले. पहले दादा आए और उन्होंने खिलाड़ियों को सपोर्ट किया और टीम तैयार की और फिर धोनी आए और उसे आगे ले गए. कैफ से आगे जब उनके बेस्ट फील्डर के बारे में पूछा गया तो उन्होंने जवाब दिया, \"रवींद्र जडेजा मौजूदा वक्त में विश्व के सबसे बेस्ट फील्डर हैं. मुझे जडेजा की फील्डिंग बहुत पसंद है. मैं उन्हें करीब 11 सालों से फॉलो कर रहा हूं. वह कैच नहीं छोड़ते हैं. उनका थ्रो भी एकदम सटीक रहता है. आप उनसे कहीं भी फील्डिंग करा सकते हैं. जडेजा को देखकर मुझे अपनी याद आ जाती है.\" googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); क्या सरफराज खान दिल्ली कैपिटल्स में लेंगे ऋषभ पंत की जगह लेंगे? इस सवाल के जवाब में कैफ ने कहा, \"दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है. आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं. उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स.","pubDate":"2023-03-14 15:59:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/8d07620540da1320bbfcce1d870085261678807997794143_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: टेस्ट के बाद वनडे में भी गरजेगा विराट का बल्ला! तीनों स्टेडियम में है कमाल का रिकॉर्ड","link":"https://www.abplive.com/sports/cricket/ind-vs-aus-virat-kohli-kohli-is-ready-for-odi-series-against-australia-see-the-batting-records-of-all-three-stadium-here-2358166","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs AUS, Virat Kohli: भारतीय टीम ने ऑस्ट्रेलिया को चार मैचों की टेस्ट सीरीज (Border Gavaskar Trophy) में 2-1 से मात देकर सीरीज पर अपना कब्जा कर लिया है. अब दोनों टीमों के बीच 17 मार्च से तीन वनडे की जंग शुरू होगी. दोनों टीमों के बीच तीन मैचों की वनडे सीरीज वानखेड़े, विजाग और चेन्नई में खेला जाएगा. वहीं वनडे सीरीज में भारत के लिए बल्ले से विराट कोहली एक बार फिर कमाल कर सकते हैं. अहमदाबाद में खेले गए आखिरी टेस्ट में विराट ने शानदार 186 रनों की शतकीय पारी खेली थी. विराट अभी कमाल के फॉर्म में हैं. वहीं उनका उन तीनों स्टेडियम में शानदार रिकॉर्ड है जहां वनडे के मुकाबले होने वाले हैं. तीनों स्टेडियम में खूब चलता है विराट को बल्ला वानखेड़े स्टेडिय में भारत और ऑस्ट्रेलिया कि बीच 17 मार्च को पहला वनडे मुकाबला खेला जाएगा. इस स्टेडियम में विराट का प्रदर्शन शानदार रहा है. 2011 से 2020 तक में विराट ने यहां कुल 5 मैच खेले हैं. जिसमें उन्होंने 66.25 की शानदार औसत और 1 शतक और 1 अर्धशतक की मदद से शानदार 265 रन बनाए हैं. वहीं विजाग के डॉ. वाई एस राजशेखर स्टेडियम में विराट ने साल 2010 से लेकर 2019 तक 5 मैच खेल हैं. इस दौरान उन्होंने 157 रनों की शानदार पारी भी खेली है. यहां विराट को बैटिंग करना काफी पसंद है. खास बात यह भी है कि इस मैदान पर टीम इंडिया को हर मैच में जीत नसीब हुई है. वनडे सीरीज का आखिरी मुकाबला 22 मार्च को चेन्नई के चेपॉक स्टेडियम में खेला जाएगा. इस मैदान पर विराट ने 2010 से लेकर 2019 के बीच कुल 7 मैच खेले हैं. इन मुकाबले में विराट ने 283 रन बनाए हैं. विराट ने इस मैदान पर 1 शतक और 2 अर्धशतक ठोका है.       भारत और ऑस्ट्रेलिया की वनडे टीम भारत की वनडे टीम: रोहित शर्मा (कप्तान) युजवेंद्र चहल, ईशान किशन, श्रेयस अय्यर, रवीद्र जडेजा, विराट कोहली, कुलदीप यादव, मोहम्मद शमी, मोहम्मद सिराज, हार्दिक पंड्या, अक्षर पटेल, केएल राहुल, शुभमन गिल, शार्दुल ठाकुर, उमरान मलिक, जयदेव उनादकट, वाशिंगटन सुंदर, सुर्यकुमार यादव.  ऑस्ट्रेलिया की वनडे टीम: पैट कमिंस (कप्तान) सीन एबॉट, एश्टन एगर, एलेक्स कैरी, नाथन एलिस, कैमरून ग्रीन, ट्रेविस हेड, जोस इंग्लिस, मार्नस लाबुशेन, मिचेल मार्श, ग्लेन मैक्सवेल, स्टीव स्मिथ, मिचेल स्टार्क, मार्क स्टोइनिस, डेविड वार्नर, एडम जैंपा. यह भी पढ़ें: ENG vs BAN: बांग्लादेश ने टी20 सीरीज में वर्ल्ड चैंपियन इंग्लैंड का सूपड़ा साफ कर रचा इतिहास, जानें मैच का हाल","content":"IND vs AUS, Virat Kohli: भारतीय टीम ने ऑस्ट्रेलिया को चार मैचों की टेस्ट सीरीज (Border Gavaskar Trophy) में 2-1 से मात देकर सीरीज पर अपना कब्जा कर लिया है. अब दोनों टीमों के बीच 17 मार्च से तीन वनडे की जंग शुरू होगी. दोनों टीमों के बीच तीन मैचों की वनडे सीरीज वानखेड़े, विजाग और चेन्नई में खेला जाएगा. वहीं वनडे सीरीज में भारत के लिए बल्ले से विराट कोहली एक बार फिर कमाल कर सकते हैं. अहमदाबाद में खेले गए आखिरी टेस्ट में विराट ने शानदार 186 रनों की शतकीय पारी खेली थी. विराट अभी कमाल के फॉर्म में हैं. वहीं उनका उन तीनों स्टेडियम में शानदार रिकॉर्ड है जहां वनडे के मुकाबले होने वाले हैं. तीनों स्टेडियम में खूब चलता है विराट को बल्ला वानखेड़े स्टेडिय में भारत और ऑस्ट्रेलिया कि बीच 17 मार्च को पहला वनडे मुकाबला खेला जाएगा. इस स्टेडियम में विराट का प्रदर्शन शानदार रहा है. 2011 से 2020 तक में विराट ने यहां कुल 5 मैच खेले हैं. जिसमें उन्होंने 66.25 की शानदार औसत और 1 शतक और 1 अर्धशतक की मदद से शानदार 265 रन बनाए हैं. वहीं विजाग के डॉ. वाई एस राजशेखर स्टेडियम में विराट ने साल 2010 से लेकर 2019 तक 5 मैच खेल हैं. इस दौरान उन्होंने 157 रनों की शानदार पारी भी खेली है. यहां विराट को बैटिंग करना काफी पसंद है. खास बात यह भी है कि इस मैदान पर टीम इंडिया को हर मैच में जीत नसीब हुई है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); वनडे सीरीज का आखिरी मुकाबला 22 मार्च को चेन्नई के चेपॉक स्टेडियम में खेला जाएगा. इस मैदान पर विराट ने 2010 से लेकर 2019 के बीच कुल 7 मैच खेले हैं. इन मुकाबले में विराट ने 283 रन बनाए हैं. विराट ने इस मैदान पर 1 शतक और 2 अर्धशतक ठोका है. भारत और ऑस्ट्रेलिया की वनडे टीम भारत की वनडे टीम: रोहित शर्मा (कप्तान) युजवेंद्र चहल, ईशान किशन, श्रेयस अय्यर, रवीद्र जडेजा, विराट कोहली, कुलदीप यादव, मोहम्मद शमी, मोहम्मद सिराज, हार्दिक पंड्या, अक्षर पटेल, केएल राहुल, शुभमन गिल, शार्दुल ठाकुर, उमरान मलिक, जयदेव उनादकट, वाशिंगटन सुंदर, सुर्यकुमार यादव. ऑस्ट्रेलिया की वनडे टीम: पैट कमिंस (कप्तान) सीन एबॉट, एश्टन एगर, एलेक्स कैरी, नाथन एलिस, कैमरून ग्रीन, ट्रेविस हेड, जोस इंग्लिस, मार्नस लाबुशेन, मिचेल मार्श, ग्लेन मैक्सवेल, स्टीव स्मिथ, मिचेल स्टार्क, मार्क स्टोइनिस, डेविड वार्नर, एडम जैंपा. यह भी पढ़ें: ENG vs BAN: बांग्लादेश ने टी20 सीरीज में वर्ल्ड चैंपियन इंग्लैंड का सूपड़ा साफ कर रचा इतिहास, जानें मैच का हाल","pubDate":"2023-03-14 15:55:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/bc4973a8f36fa18885af4fd7d34181bf1678807308461127_original.avif","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka Under 19s tour UAE under Daniel’s captaincy","link":"http://island.lk/sri-lanka-under-19s-tour-uae-under-daniels-captaincy/","keywords":["Sports","Sri Lanka under-19 Cricket","UAE"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College […]","content":"Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:38","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sri Devananda take a step closer to Division I promotion","link":"http://island.lk/sri-devananda-take-a-step-closer-to-division-i-promotion/","keywords":["Sports","Sri Lankan Under 19 Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division II Tier A Cricket quarter-finals by Reemus Fernando Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. […]","content":"Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:36","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Neththaru stars with century as St. Servatius’ dominate day one","link":"http://island.lk/neththaru-stars-with-century-as-st-servatius-dominate-day-on/","keywords":["Sports","Chiran Neththaru","Under 19 Division I Tier ‘B’"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division I Tier ‘B’ Cricket quarter-finals Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order […]","content":"Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises.","pubDate":"2023-03-15 00:00:23","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Dickwella – a monster the selectors created","link":"http://island.lk/dickwella-a-monster-the-selectors-created/","keywords":["Sports","Featured","Niroshan Dikwella"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Rex Clementine There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little […]","content":"There was knee jerk reaction from the national selection panel following Sri Lanka’s heart-breaking last ball defeat to New Zealand in Christchurch. Rather than addressing burning issues and long-standing problems, they were blaming Niroshan Dickwella for the defeat after the wicketkeeper had a poor game dropping Kane Williamson and making a little contribution with the bat. The current selection panel is quick to take credit when things go right but when things go wrong, they waste no time in finding scapegoats. They have conveniently forgotten that Niroshan Dickwella is a monster they created. When Dickwella was on suspension, instead of grooming the nation’s next wicketkeeper, the selectors adopted temporary measures by giving the gloves to Dinesh Chandimal for the home series against West Indies. Then they recalled Dickwella back into the squad soon after his suspension ended. That was in Mohali last year. The side was in trouble but Dickwella being Dickwella wasted no time in sweeping Ravindra Jadeja taking on the two men placed square of the wicket for the top edge and he was dismissed cheaply. This is not a lack of game awareness. This is pure stubbornness and not playing for the team’s cause. A strong selection panel would have axed Dickwella for the next Test in Bangalore. Even now when they have finally decided to axe him the keeping gloves will again go to Chandimal, who has been one of the team’s best batters in the last couple of years. Keeping duties will diminish his effectiveness as a batsman and you wonder why the selectors have failed to groom a replacement for Dickwella. Is he indispensable in their books? Dickwella experiment has ended after 54 Tests and he’s got only himself to blame for that. Despite the costly fumble of Williamson, you’ve got to accept the fact that Dickwella is Sri Lanka’s best keeper. He may not be in the class of Prasanna Jayawardene but among the current keepers, he’s the best. It’s all the drama that he does behind the stumps that’s crap. The problem is not with the drama but his inability to convert starts and throwing his wicket away after being well set. Lessons should have been taught long before he ended up playing 50 Tests. One dropped catch seems pretty harsh for someone to be axed but that’s how the game goes. You’ve got away with too many soft dismissals and when your dropped catch has cost the side a game and probably a place in the World Test Championship final, your mistakes are magnified. If Dickwella doesn’t make a comeback it will be a crying shame. He was one of the brightest prospects to emerge when he first came onto the scene almost ten years ago. Like so many before him, he’s faded away without fulfilling the promises. Published on By Sri Lanka Under 19 will compete against Afghanistan and Bangladesh in a Tri-Nation Youth tournament in Abu Dhabi, UAE under the captaincy of St. Joseph’s all-rounder Shevon Daniel. Except for Daniel, Treveen Mathew and Theeraka Ranathunga all other players in the 15-member squad are eligible to play in the next Youth World Cup. Richmond College all-rounder Malsha Tharupathi who played in the last Youth World Cup is among the experienced members in the squad. However, Tharupathi, Royal College player Sineth Jayawardena and Mahinda College Galle player Dinura Kalupahana are not leaving the island with the rest of the squad on March 15 as Sri Lanka Cricket has made exemptions for them to take part in their respective Big Matches. Of the 15 players, three are from St. Joseph’s College, Darley Road, while there are two from Trinity. Sri Lanka Under 19 team: Shevon Daniel (Captain), Hirun Kapurubandara, Malsha Tharupathi, Dinura Kalupahana, Sineth Jayawardena, Vihas Thewmika, Vishen Halambage, Hiran Jayasundara, Traveen Mathew, Theeraka Ranathunga, Vishva Lahiru, Duvindu Ranatunga, Manula Kularathne, Garuka Sanketh, Vishwa Rajapaksa. Published on By Sri Devananda College took a step closer to earning the Division I promotion as they rode on a century by Mithila Charles to record a first-innings win over Piliyandala Central in the Under 19 Division II Tier ‘A’ cricket quarter-final at Piliyandala on Tuesday. The team from Ambalangoda doused a threat from spinner Thineth Salinga, who bagged 13 wickets including eight second-innings’ scalps, to post 139 runs at close in pursuit of a target of 145 runs to win. Sri Devananda will now meet Holy Cross College, Kalutara in the semi-final. The winner of that match will not only secure a place in the final but will also earn a place in the Division I category. Under 19 Division II Tier ‘B’ Cricket quarter-finals Sri Jayawardenapura MV scored a first-innings win over Bandaranaike College to secure the semi-final berth in the Under 19 Division II Tier ‘B’ tournament at Gampaha on Tuesday. Sri Jayawardenapura MV will now meet Henegama Central in the semi-final. Published on By Electing to bat first St. Servatius’ posted 308 for nine wickets declared against Ananda as skipper Chiran Neththaru top scored with 124 runs on day one of the Under 19 Division I Tier ‘B’ cricket quarter-final at Uyanwatta stadium on Tuesday. St. Servatius’ recovered from a top-order collapse (57 for five wickets)to post their eventual total after Mithila Charles and Neththaru anchored the innings with dogged knocks. While Mithila Charles scored 72 runs facing 141 balls, Neththaru scored 124 runs in 205 balls. Ananda were 21 for one wicket at stumps.","pubDate":"2023-03-14 23:55:19","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ricky Ponting New Home: 20 मिलियन डॉलर खर्च करके रिकी पोंटिंग ने खरीदा एक शानदार घर, देखें इस हवेली की कुछ बेहद खूबसूरत पिक्चर्स","link":"https://www.abplive.com/photo-gallery/sports/cricket-former-australian-captain-ricky-ponting-bought-a-dream-home-at-20-million-dollars-at-toorak-melbourne-2358207","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":null,"content":"ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग ने मेलबर्न के एक शानदार इलाके तूराक में अपने लिए एक बेहतरीन घर खरीदा है. इस घर के लिए रिकी पोंटिंग ने पूरे 20 मिलियन डॉलर खर्च किए हैं. ऑस्ट्रेलियाई मीडिया में आई खबरों के मुताबिक, हवेली को उसकी तय कीमत से ज्यादा में बेचा गया है. (फोटो - FORBES GLOBAL PROPERTIES) इस हवेली की प्राइज गाइड $19 मिलियन से $20.6 मिलियन के बीच में था, लेकिन इसे पोंटिंग ने 20.75 मिलियन डॉलर में खरीदा है. आइए हम आपको इस घर की खूबसूरत पिक्चर्स के साथ इसकी कुछ डिटेल्स भी बताते हैं. (फोटो - Realestate.com.au) द एज की एक रिपोर्ट के अनुसार रिकी पोंटिंग की यह नई हवेली मेलबर्न के टॉप यानी सबसे अच्छे इलाके में मौजूद है. इस घर का क्षेत्रफल 1400 स्क्वॉयर मीटर है. (फोटो - Realestate.com.au) इस घर में एक ओपन प्लान वाला इनडोर-आउटडोर लीविंग स्पेस दिया गया है. इस घर में रॉट-लोहे की सीढ़ियां बनी हुई है. (फोटो - Realestate.com.au) इस घर में एक शानदार किचन भी मौजूद है, जो कई आधुनिक सुविधाओं से लैस है. इस रसोईघर की सतह संगमरमर से बनी हुई है. (फोटो - FORBES GLOBAL PROPERTIES) रिकी पोंटिंग के इस नए घर में एक शानदार टेनिस कोर्ट भी मौजूद है. 6 बेडरूम वाले रिकी पोंटिंग के इस घर में दुनियाभर की तमाम सुविधाएं मौजूद है. (फोटो - FORBES GLOBAL PROPERTIES) Delhi Riots 2020: दिल्ली दंगा मामले में 9 लोगों को कोर्ट ने ठहराया दोषी, कहा- एक समुदाय विशेष को नुकसान पहुंचाना था मकसद","pubDate":"2023-03-14 16:44:45","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/3a27c4c50a56e07118a16a59259672d21678811214579428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI-W vs GG-W, 1 Innings Highlight: मुंबई ने दिया 163 रनों का लक्ष्य, हरमनप्रीत कौर तूफानी अर्धशतक","link":"https://www.abplive.com/sports/cricket/wpl-2023-mi-w-given-target-of-163-runs-against-gg-w-in-match-12-at-brabourne-stadium-2358192","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"WPL 2023: महिला प्रीमियर लीग के पहले सीजन का 12वां मैच मुंबई इंडियंस और गुजरात जायंट्स के बीच में खेला जा रहा है. इस मैच में गुजरात ने टॉस जीतकर मुंबई को बल्लेबाजी का न्यौता दिया और पहले ही ओवर में हेली मैथ्यूज को आउट करके मुंबई को एक बड़ा झटका दे दिया. हालांकि, उसके बाद मुंबई की महिलाओं ने पारी को संभाला और टीम का स्कोर 160 रनों के पार पहुंचा दिया. मुंबई की विकेटकीपर ओपनर बल्लेबाज यस्तिका भाटिया ने  37 गेंदों में 44 रनों की पारी खेली और नेट सीवर ब्रंट ने भी 31 गेंदों में 36 रनों की पारी खेलकर उनका भरपूर साथ दिया. धीमी शुरुआत करने वाली मुंबई की टीम ने बाद में काफी तेजी से रन बनाए, जिसमें सबसे ज्यादा योगदान हरमनप्रीत कौर ने दिया. हरमनप्रीत ने फिर खेली बढ़िया पारी मुंबई की कप्तान हरमनप्रीत कौर ने 30 गेंदों में 51 रनों की पारी खेलकर अपनी टीम को एक सम्मानजनक स्कोर तक पहुंचा दिया. इन तीन बल्लेबाजों के अलावा मुंबई की ओर से कोई भी बड़ी पारी नहीं खेल पाया. मुबई की टीम ने 20 ओवर में 8 विकेट खोकर 162 रन बनाए हैं. उधर, गुजरात की गेंदबाजी पर गौर करें तो उनकी टीम से एशले गार्डनर ने 4 ओवर में 34 रन देकर सबसे ज्यादा 3 विकेट हासिल किए. उनके अलावा किम गार्थ, कप्तान स्नेह राणा, और तनुजा कंवर ने भी एक-एक विकेट हासिल किया है. अब देखना होगा कि गुजरात टाइटन्स इस मैच में मुंबई को हराकर अपना पुराना हिसाब चुक्ता कर पाती है या नहीं. आपको बता दें कि महिला आईपीएल 2023 के पहले मैच में मुंबई ने गुजरात को 143 रन से शर्मनाक हार दी थी. उस मैच में मुंबई ने 20 ओवर में 5 विकेट खोकर 207 रन बनाए थे और फिर गुजरात की टीम को सिर्फ 64 रनों पर ऑल आउट कर दिया था. ऐसे में महिला प्रीमियर लीग के इस दूसरे राउंड में गुजरात के पास 163 रन बनाकर मुंबई से बदला लेने का शानदार मौका है.  यह भी पढ़ें: IPL 2023: आईपीएल के 16वें सीजन में ये पांच खिलाड़ी करा सकते हैं चेन्नई सुपर किंग्स की दमदार वापसी","content":"WPL 2023: महिला प्रीमियर लीग के पहले सीजन का 12वां मैच मुंबई इंडियंस और गुजरात जायंट्स के बीच में खेला जा रहा है. इस मैच में गुजरात ने टॉस जीतकर मुंबई को बल्लेबाजी का न्यौता दिया और पहले ही ओवर में हेली मैथ्यूज को आउट करके मुंबई को एक बड़ा झटका दे दिया. हालांकि, उसके बाद मुंबई की महिलाओं ने पारी को संभाला और टीम का स्कोर 160 रनों के पार पहुंचा दिया. मुंबई की विकेटकीपर ओपनर बल्लेबाज यस्तिका भाटिया ने 37 गेंदों में 44 रनों की पारी खेली और नेट सीवर ब्रंट ने भी 31 गेंदों में 36 रनों की पारी खेलकर उनका भरपूर साथ दिया. धीमी शुरुआत करने वाली मुंबई की टीम ने बाद में काफी तेजी से रन बनाए, जिसमें सबसे ज्यादा योगदान हरमनप्रीत कौर ने दिया. हरमनप्रीत ने फिर खेली बढ़िया पारी मुंबई की कप्तान हरमनप्रीत कौर ने 30 गेंदों में 51 रनों की पारी खेलकर अपनी टीम को एक सम्मानजनक स्कोर तक पहुंचा दिया. इन तीन बल्लेबाजों के अलावा मुंबई की ओर से कोई भी बड़ी पारी नहीं खेल पाया. मुबई की टीम ने 20 ओवर में 8 विकेट खोकर 162 रन बनाए हैं. उधर, गुजरात की गेंदबाजी पर गौर करें तो उनकी टीम से एशले गार्डनर ने 4 ओवर में 34 रन देकर सबसे ज्यादा 3 विकेट हासिल किए. उनके अलावा किम गार्थ, कप्तान स्नेह राणा, और तनुजा कंवर ने भी एक-एक विकेट हासिल किया है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); अब देखना होगा कि गुजरात टाइटन्स इस मैच में मुंबई को हराकर अपना पुराना हिसाब चुक्ता कर पाती है या नहीं. आपको बता दें कि महिला आईपीएल 2023 के पहले मैच में मुंबई ने गुजरात को 143 रन से शर्मनाक हार दी थी. उस मैच में मुंबई ने 20 ओवर में 5 विकेट खोकर 207 रन बनाए थे और फिर गुजरात की टीम को सिर्फ 64 रनों पर ऑल आउट कर दिया था. ऐसे में महिला प्रीमियर लीग के इस दूसरे राउंड में गुजरात के पास 163 रन बनाकर मुंबई से बदला लेने का शानदार मौका है. यह भी पढ़ें: IPL 2023: आईपीएल के 16वें सीजन में ये पांच खिलाड़ी करा सकते हैं चेन्नई सुपर किंग्स की दमदार वापसी","pubDate":"2023-03-14 16:43:26","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/34e5d7d694c3854ec3b3d5e6f898d1591678809584419428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Exclusive: IPL 2023 में कौन लेगा ऋषभ पंत की जगह, क्या सरफराज खान करेंगे विकेटकीपिंग? abp से बातचीत में कैफ ने दिया जवाब","link":"https://www.abplive.com/sports/cricket/who-will-replace-rishabh-pant-in-ipl-2023-sarfaraz-khan-play-as-a-wicketkeeper-mohammad-kaif-interview-2358203","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Mohammad Kaif Interview In Hindi: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने आईपीएल 2023 में ऋषभ पंत के रिप्लेसमेंट और सरफराज खान के विकेटकीपिंग करने के बारे में बातचीत की. इसके अलावा और भी कई पहलुओं पर कैफ ने खुलकर बात की.  इंटरव्यू में जब मोहम्मद कैफ से ऋषभ पंत की चोट के बारे में बात की तो उन्होंने जवाब दिया, \"मेरी ऋषभ पंत से बातचीत हुई. वह तेजी से रिकवरी कर रहे हैं. वह ठीक हैं अब. जो उनके साथ घटना घटी वो काफी दुर्भाग्यपूर्ण थी. लेकिन वह काफी मज़बूत खिलाड़ी हैं, इसीलिए आप जल्द ही उन्हें भारतीय जर्सी में देखेंगे.\"  वहीं आईपीएल 2023 में ऋषभ पंत की जगह कौन लेगा? कौन उनकी जगह विकेटकीपिंग करेगा? कई रिपोर्ट्स में कहा जा रहा है कि सरफराज खान दिल्ली के विकेटकीपर होंगे. इस सवाल के जवाब में कैफ ने कहा, दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है.  आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं.  उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स.  यह भी पढ़ें- Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","content":"Mohammad Kaif Interview In Hindi: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने आईपीएल 2023 में ऋषभ पंत के रिप्लेसमेंट और सरफराज खान के विकेटकीपिंग करने के बारे में बातचीत की. इसके अलावा और भी कई पहलुओं पर कैफ ने खुलकर बात की. इंटरव्यू में जब मोहम्मद कैफ से ऋषभ पंत की चोट के बारे में बात की तो उन्होंने जवाब दिया, \"मेरी ऋषभ पंत से बातचीत हुई. वह तेजी से रिकवरी कर रहे हैं. वह ठीक हैं अब. जो उनके साथ घटना घटी वो काफी दुर्भाग्यपूर्ण थी. लेकिन वह काफी मज़बूत खिलाड़ी हैं, इसीलिए आप जल्द ही उन्हें भारतीय जर्सी में देखेंगे.\" वहीं आईपीएल 2023 में ऋषभ पंत की जगह कौन लेगा? कौन उनकी जगह विकेटकीपिंग करेगा? कई रिपोर्ट्स में कहा जा रहा है कि सरफराज खान दिल्ली के विकेटकीपर होंगे. इस सवाल के जवाब में कैफ ने कहा, दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है. आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स. यह भी पढ़ें- Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","pubDate":"2023-03-14 16:39:10","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/05a397304a7ba4bce6ab1d2ccfe541be1678810491274143_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: क्या रोहित शर्मा के बाद टीम के नियमित कप्तान होंगे हार्दिक पांड्या?, सुनील गावस्कर ने दिया जवाब","link":"https://www.abplive.com/sports/cricket/sunil-gavaskar-says-can-almost-stamp-hardik-pandya-as-india-captain-once-2023-world-cup-is-over-after-rohit-sharma-2358197","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sunil Gavaskar On Hardik Pandya: ऑस्ट्रेलिया के खिलाफ 3 वनडे मैचों की सीरीज के पहले मैच में रोहित शर्मा नहीं होंगे. रोहित शर्मा की गैरमौजूदगी में ऑलराउंडर हार्दिक पांड्या टीम के कप्तान होंगे. हालांकि, ऑस्ट्रेलिया के खिलाफ दूसरे वनडे मैच में रोहित शर्मा की वापसी होगी. यानि, रोहित शर्मा सीरीज के दूसरे मैच में टीम के कप्तान होंगे. बहरहाल, पूर्व भारतीय क्रिकेटर सुनील गावस्कर ने ऑलराउंडर हार्दिक पांड्या की कप्तानी पर बड़ा बयान दिया है. साथ ही उन्होंने बताया कि कप्तान के तौर पर हार्दिक पांड्या का भविष्य क्या होगा? सुनील गावस्कर ने हार्दिक पांड्या की कप्तानी पर क्या कहा? पूर्व भारतीय क्रिकेटर सुनील गावस्कर का मानना है कि रोहित शर्मा वनडे वर्ल्ड कप 2023 तक टीम के कप्तान होंगे, लेकिन इस टूर्नामेंट के बाद हार्दिक पांड्या को भारतीय टी20 और वनडे टीम का नियमित कप्तान बना दिया जाएगा. उन्होंने कहा कि हार्दिक पांड्या कप्तान के तौर पर खिलाड़ियों को अपना नेचुरल गेम खेलने की आजादी देते हैं. साथ ही उन्होंने कहा कि आईपीएल में गुजरात टाइटंस के लिए हार्दिक पांड्या ने खुद को बल्लेबाजी क्रम में प्रमोट किया. पिछले सीजन में वह बल्लेबाजी करने के लिए टॉप में उतरे. यह शानदार फैसला था. रोहित शर्मा की जगह टीम के नए कप्तान होंगे हार्दिक पांड्या! सुनील गावस्कर ने कहा कि हार्दिक पांड्या ने वनडे मैचों के अलावा टी20 में शानदार कप्तानी का नजारा पेश किया है. खासकर, आईपीएल में इस खिलाड़ी ने गजब का नेतृत्व किया. हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस ने आईपीएल 2022 अपने नाम किया. जबकि गुजरात टाइटंस की टीम पहली आईपीएल में खेल रही थी. साथ ही उन्होंने कहा कि जिस तरह हार्दिक पांड्या ने अपनी कप्तानी क्षमता का प्रदर्शन किया है, मुझे पूरा भरोसा है कि रोहित शर्मा के बाद इस खिलाड़ी को कप्तान बनाया जाएगा. यह खिलाड़ी रोहित शर्मा के बाद कप्तान बनने के लिए सबसे बेहतरीन विकल्पों में एक है. ये भी पढ़ें- IND vs AUS 1st ODI: वनडे में कप्तानी करना हार्दिक पांड्या के लिए नहीं होगा आसान, जानें क्या है बड़ी चुनौती","content":"Sunil Gavaskar On Hardik Pandya: ऑस्ट्रेलिया के खिलाफ 3 वनडे मैचों की सीरीज के पहले मैच में रोहित शर्मा नहीं होंगे. रोहित शर्मा की गैरमौजूदगी में ऑलराउंडर हार्दिक पांड्या टीम के कप्तान होंगे. हालांकि, ऑस्ट्रेलिया के खिलाफ दूसरे वनडे मैच में रोहित शर्मा की वापसी होगी. यानि, रोहित शर्मा सीरीज के दूसरे मैच में टीम के कप्तान होंगे. बहरहाल, पूर्व भारतीय क्रिकेटर सुनील गावस्कर ने ऑलराउंडर हार्दिक पांड्या की कप्तानी पर बड़ा बयान दिया है. साथ ही उन्होंने बताया कि कप्तान के तौर पर हार्दिक पांड्या का भविष्य क्या होगा? सुनील गावस्कर ने हार्दिक पांड्या की कप्तानी पर क्या कहा? पूर्व भारतीय क्रिकेटर सुनील गावस्कर का मानना है कि रोहित शर्मा वनडे वर्ल्ड कप 2023 तक टीम के कप्तान होंगे, लेकिन इस टूर्नामेंट के बाद हार्दिक पांड्या को भारतीय टी20 और वनडे टीम का नियमित कप्तान बना दिया जाएगा. उन्होंने कहा कि हार्दिक पांड्या कप्तान के तौर पर खिलाड़ियों को अपना नेचुरल गेम खेलने की आजादी देते हैं. साथ ही उन्होंने कहा कि आईपीएल में गुजरात टाइटंस के लिए हार्दिक पांड्या ने खुद को बल्लेबाजी क्रम में प्रमोट किया. पिछले सीजन में वह बल्लेबाजी करने के लिए टॉप में उतरे. यह शानदार फैसला था. रोहित शर्मा की जगह टीम के नए कप्तान होंगे हार्दिक पांड्या! googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सुनील गावस्कर ने कहा कि हार्दिक पांड्या ने वनडे मैचों के अलावा टी20 में शानदार कप्तानी का नजारा पेश किया है. खासकर, आईपीएल में इस खिलाड़ी ने गजब का नेतृत्व किया. हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस ने आईपीएल 2022 अपने नाम किया. जबकि गुजरात टाइटंस की टीम पहली आईपीएल में खेल रही थी. साथ ही उन्होंने कहा कि जिस तरह हार्दिक पांड्या ने अपनी कप्तानी क्षमता का प्रदर्शन किया है, मुझे पूरा भरोसा है कि रोहित शर्मा के बाद इस खिलाड़ी को कप्तान बनाया जाएगा. यह खिलाड़ी रोहित शर्मा के बाद कप्तान बनने के लिए सबसे बेहतरीन विकल्पों में एक है. ये भी पढ़ें- IND vs AUS 1st ODI: वनडे में कप्तानी करना हार्दिक पांड्या के लिए नहीं होगा आसान, जानें क्या है बड़ी चुनौती","pubDate":"2023-03-14 16:13:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/4d6557bc64cd51ace63165c4fc1832581678810167973428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Exclusive: धोनी और गांगुली में कौन था बेहतर कप्तान, दोनों में क्या है फर्क? abp से बातचीत में मोहम्मद कैफ ने डिटेल में बताया","link":"https://www.abplive.com/sports/cricket/who-is-better-captain-in-ms-dhoni-and-sourav-ganguly-mohammad-kaif-exclusive-interview-abp-news-2358173","keywords":["Cricket"],"creator":["मोहम्मद वाहिद"],"video_url":null,"description":"Mohammad Kaif On MS Dhoni And Sourav Ganguly: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने एमएस धोनी और सौरव गांगुली की कैप्टेंसी, ऋषभ पंत की चोट और दिल्ली कैपिटल्स के संभावित कप्तान को लेकर बातचीत की.  इंटरव्यू में जब कैफ से पूछा गया कि महेंद्र सिंह धोनी और सौरव गांगुली में बेहतर कप्तान कौन था, और दोनों की कैप्टेंसी स्टाइल में क्या फर्क है? इसके जवाब में कैफ ने कहा, \"दादा ने ही धोनी को बनाया. हमेशा उनको सपोर्ट किया. गांगुली साहब ने ही धोनी को टीम में लिया और उनको तैयार किया.\" कैफ ने आगे कहा कि वैसे मैं खिलाड़ियों की तुलना करने में विश्वास नहीं रखता हूं.   विश्व के सर्वश्रेष्ठ फिल्डिरों में से एक रहे कैफ ने आगे कहा, भारतीय क्रिकेट के लिए यह अच्छा रहा कि धोनी और गांगुली दोनों देश के लिए खेले. पहले दादा आए और उन्होंने खिलाड़ियों को सपोर्ट किया और टीम तैयार की और फिर धोनी आए और उसे आगे ले गए.  कैफ से आगे जब उनके बेस्ट फील्डर के बारे में पूछा गया तो उन्होंने जवाब दिया, \"रवींद्र जडेजा मौजूदा वक्त में विश्व के सबसे बेस्ट फील्डर हैं. मुझे जडेजा की फील्डिंग बहुत पसंद है. मैं उन्हें करीब 11 सालों से फॉलो कर रहा हूं. वह कैच नहीं छोड़ते हैं. उनका थ्रो भी एकदम सटीक रहता है. आप उनसे कहीं भी फील्डिंग करा सकते हैं. जडेजा को देखकर मुझे अपनी याद आ जाती है.\" क्या सरफराज खान दिल्ली कैपिटल्स में लेंगे ऋषभ पंत की जगह लेंगे? इस सवाल के जवाब में कैफ ने कहा, \"दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है.  आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं.  उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स. ","content":"Mohammad Kaif On MS Dhoni And Sourav Ganguly: कतर के दोहा में 2023 लीजेंड्स लीग खेली जा रही है. यहां पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने एबीपी लाइव से खास बातचीत की. इस दौरान उन्होंने एमएस धोनी और सौरव गांगुली की कैप्टेंसी, ऋषभ पंत की चोट और दिल्ली कैपिटल्स के संभावित कप्तान को लेकर बातचीत की. इंटरव्यू में जब कैफ से पूछा गया कि महेंद्र सिंह धोनी और सौरव गांगुली में बेहतर कप्तान कौन था, और दोनों की कैप्टेंसी स्टाइल में क्या फर्क है? इसके जवाब में कैफ ने कहा, \"दादा ने ही धोनी को बनाया. हमेशा उनको सपोर्ट किया. गांगुली साहब ने ही धोनी को टीम में लिया और उनको तैयार किया.\" कैफ ने आगे कहा कि वैसे मैं खिलाड़ियों की तुलना करने में विश्वास नहीं रखता हूं. विश्व के सर्वश्रेष्ठ फिल्डिरों में से एक रहे कैफ ने आगे कहा, भारतीय क्रिकेट के लिए यह अच्छा रहा कि धोनी और गांगुली दोनों देश के लिए खेले. पहले दादा आए और उन्होंने खिलाड़ियों को सपोर्ट किया और टीम तैयार की और फिर धोनी आए और उसे आगे ले गए. कैफ से आगे जब उनके बेस्ट फील्डर के बारे में पूछा गया तो उन्होंने जवाब दिया, \"रवींद्र जडेजा मौजूदा वक्त में विश्व के सबसे बेस्ट फील्डर हैं. मुझे जडेजा की फील्डिंग बहुत पसंद है. मैं उन्हें करीब 11 सालों से फॉलो कर रहा हूं. वह कैच नहीं छोड़ते हैं. उनका थ्रो भी एकदम सटीक रहता है. आप उनसे कहीं भी फील्डिंग करा सकते हैं. जडेजा को देखकर मुझे अपनी याद आ जाती है.\" googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); क्या सरफराज खान दिल्ली कैपिटल्स में लेंगे ऋषभ पंत की जगह लेंगे? इस सवाल के जवाब में कैफ ने कहा, \"दिल्ली चाहेगी कि किसी तरह सरफराज को प्लेइंग इलेवन में फिट करो. वह एक अच्छे बल्लेबाज़ हैं और फॉर्म में भी हैं. लेकिन मुझे नहीं लगता कि उन्होंने कभी विकेटकीपिंग की है. हां अगर दिल्ली पार्टटाइमर विकेटकीपर के रूप में उनको देख रही है तो अलग बात है.\" साथ ही उनके पास केएस भरत का विकल्प है. लेकिन सरफराज ने घरेलू क्रिकेट में बहुत रन बनाए हैं और वह आईपीएल में खेलना डिजर्व करते हैं. कैफ ने आगे कहा कि ऋषभ पंत का रिप्लेसमेंट ढूंढ़ना असंभव है. आईपीएल 2023 में दिल्ली कैपिटल्स का कप्तान कौन होगा. इस सवाल के जवाब में उन्होंने कहा, ऋषभ पंत की जगह कप्तान...डेविड वॉर्नर सबसे बड़े दावेदार हैं. वह आईपीएल में पहले भी कप्तान रह चुके हैं. वैसे अक्षर पटेल भी विकल्प हैं. वह काफी समय से आईपीएल में खेल रहे हैं. उन्होंने आगे कहा कि आजकल फ्रेंचाइजी भारतीय क्रिकेटरों को कप्तान बनाना चाहती है. अब ओवरसीज़ का ट्रेंड नहीं है. इस बारे में ज़रूर चर्चा करना चाहेगी दिल्ली कैपिटल्स.","pubDate":"2023-03-14 15:59:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/8d07620540da1320bbfcce1d870085261678807997794143_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: टेस्ट के बाद वनडे में भी गरजेगा विराट का बल्ला! तीनों स्टेडियम में है कमाल का रिकॉर्ड","link":"https://www.abplive.com/sports/cricket/ind-vs-aus-virat-kohli-kohli-is-ready-for-odi-series-against-australia-see-the-batting-records-of-all-three-stadium-here-2358166","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs AUS, Virat Kohli: भारतीय टीम ने ऑस्ट्रेलिया को चार मैचों की टेस्ट सीरीज (Border Gavaskar Trophy) में 2-1 से मात देकर सीरीज पर अपना कब्जा कर लिया है. अब दोनों टीमों के बीच 17 मार्च से तीन वनडे की जंग शुरू होगी. दोनों टीमों के बीच तीन मैचों की वनडे सीरीज वानखेड़े, विजाग और चेन्नई में खेला जाएगा. वहीं वनडे सीरीज में भारत के लिए बल्ले से विराट कोहली एक बार फिर कमाल कर सकते हैं. अहमदाबाद में खेले गए आखिरी टेस्ट में विराट ने शानदार 186 रनों की शतकीय पारी खेली थी. विराट अभी कमाल के फॉर्म में हैं. वहीं उनका उन तीनों स्टेडियम में शानदार रिकॉर्ड है जहां वनडे के मुकाबले होने वाले हैं. तीनों स्टेडियम में खूब चलता है विराट को बल्ला वानखेड़े स्टेडिय में भारत और ऑस्ट्रेलिया कि बीच 17 मार्च को पहला वनडे मुकाबला खेला जाएगा. इस स्टेडियम में विराट का प्रदर्शन शानदार रहा है. 2011 से 2020 तक में विराट ने यहां कुल 5 मैच खेले हैं. जिसमें उन्होंने 66.25 की शानदार औसत और 1 शतक और 1 अर्धशतक की मदद से शानदार 265 रन बनाए हैं. वहीं विजाग के डॉ. वाई एस राजशेखर स्टेडियम में विराट ने साल 2010 से लेकर 2019 तक 5 मैच खेल हैं. इस दौरान उन्होंने 157 रनों की शानदार पारी भी खेली है. यहां विराट को बैटिंग करना काफी पसंद है. खास बात यह भी है कि इस मैदान पर टीम इंडिया को हर मैच में जीत नसीब हुई है. वनडे सीरीज का आखिरी मुकाबला 22 मार्च को चेन्नई के चेपॉक स्टेडियम में खेला जाएगा. इस मैदान पर विराट ने 2010 से लेकर 2019 के बीच कुल 7 मैच खेले हैं. इन मुकाबले में विराट ने 283 रन बनाए हैं. विराट ने इस मैदान पर 1 शतक और 2 अर्धशतक ठोका है.       भारत और ऑस्ट्रेलिया की वनडे टीम भारत की वनडे टीम: रोहित शर्मा (कप्तान) युजवेंद्र चहल, ईशान किशन, श्रेयस अय्यर, रवीद्र जडेजा, विराट कोहली, कुलदीप यादव, मोहम्मद शमी, मोहम्मद सिराज, हार्दिक पंड्या, अक्षर पटेल, केएल राहुल, शुभमन गिल, शार्दुल ठाकुर, उमरान मलिक, जयदेव उनादकट, वाशिंगटन सुंदर, सुर्यकुमार यादव.  ऑस्ट्रेलिया की वनडे टीम: पैट कमिंस (कप्तान) सीन एबॉट, एश्टन एगर, एलेक्स कैरी, नाथन एलिस, कैमरून ग्रीन, ट्रेविस हेड, जोस इंग्लिस, मार्नस लाबुशेन, मिचेल मार्श, ग्लेन मैक्सवेल, स्टीव स्मिथ, मिचेल स्टार्क, मार्क स्टोइनिस, डेविड वार्नर, एडम जैंपा. यह भी पढ़ें: ENG vs BAN: बांग्लादेश ने टी20 सीरीज में वर्ल्ड चैंपियन इंग्लैंड का सूपड़ा साफ कर रचा इतिहास, जानें मैच का हाल","content":"IND vs AUS, Virat Kohli: भारतीय टीम ने ऑस्ट्रेलिया को चार मैचों की टेस्ट सीरीज (Border Gavaskar Trophy) में 2-1 से मात देकर सीरीज पर अपना कब्जा कर लिया है. अब दोनों टीमों के बीच 17 मार्च से तीन वनडे की जंग शुरू होगी. दोनों टीमों के बीच तीन मैचों की वनडे सीरीज वानखेड़े, विजाग और चेन्नई में खेला जाएगा. वहीं वनडे सीरीज में भारत के लिए बल्ले से विराट कोहली एक बार फिर कमाल कर सकते हैं. अहमदाबाद में खेले गए आखिरी टेस्ट में विराट ने शानदार 186 रनों की शतकीय पारी खेली थी. विराट अभी कमाल के फॉर्म में हैं. वहीं उनका उन तीनों स्टेडियम में शानदार रिकॉर्ड है जहां वनडे के मुकाबले होने वाले हैं. तीनों स्टेडियम में खूब चलता है विराट को बल्ला वानखेड़े स्टेडिय में भारत और ऑस्ट्रेलिया कि बीच 17 मार्च को पहला वनडे मुकाबला खेला जाएगा. इस स्टेडियम में विराट का प्रदर्शन शानदार रहा है. 2011 से 2020 तक में विराट ने यहां कुल 5 मैच खेले हैं. जिसमें उन्होंने 66.25 की शानदार औसत और 1 शतक और 1 अर्धशतक की मदद से शानदार 265 रन बनाए हैं. वहीं विजाग के डॉ. वाई एस राजशेखर स्टेडियम में विराट ने साल 2010 से लेकर 2019 तक 5 मैच खेल हैं. इस दौरान उन्होंने 157 रनों की शानदार पारी भी खेली है. यहां विराट को बैटिंग करना काफी पसंद है. खास बात यह भी है कि इस मैदान पर टीम इंडिया को हर मैच में जीत नसीब हुई है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); वनडे सीरीज का आखिरी मुकाबला 22 मार्च को चेन्नई के चेपॉक स्टेडियम में खेला जाएगा. इस मैदान पर विराट ने 2010 से लेकर 2019 के बीच कुल 7 मैच खेले हैं. इन मुकाबले में विराट ने 283 रन बनाए हैं. विराट ने इस मैदान पर 1 शतक और 2 अर्धशतक ठोका है. भारत और ऑस्ट्रेलिया की वनडे टीम भारत की वनडे टीम: रोहित शर्मा (कप्तान) युजवेंद्र चहल, ईशान किशन, श्रेयस अय्यर, रवीद्र जडेजा, विराट कोहली, कुलदीप यादव, मोहम्मद शमी, मोहम्मद सिराज, हार्दिक पंड्या, अक्षर पटेल, केएल राहुल, शुभमन गिल, शार्दुल ठाकुर, उमरान मलिक, जयदेव उनादकट, वाशिंगटन सुंदर, सुर्यकुमार यादव. ऑस्ट्रेलिया की वनडे टीम: पैट कमिंस (कप्तान) सीन एबॉट, एश्टन एगर, एलेक्स कैरी, नाथन एलिस, कैमरून ग्रीन, ट्रेविस हेड, जोस इंग्लिस, मार्नस लाबुशेन, मिचेल मार्श, ग्लेन मैक्सवेल, स्टीव स्मिथ, मिचेल स्टार्क, मार्क स्टोइनिस, डेविड वार्नर, एडम जैंपा. यह भी पढ़ें: ENG vs BAN: बांग्लादेश ने टी20 सीरीज में वर्ल्ड चैंपियन इंग्लैंड का सूपड़ा साफ कर रचा इतिहास, जानें मैच का हाल","pubDate":"2023-03-14 15:55:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/bc4973a8f36fa18885af4fd7d34181bf1678807308461127_original.avif","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"}]}