{"newsArray":[{"title":"3rd ODI: Injury-plagued India stare at clean sweep by ‘Bangla Tigers’","link":"https://kashmirreader.com/2022/12/10/3rd-odi-injury-plagued-india-stare-at-clean-sweep-by-bangla-tigers/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Chattogram: A struggling Indian team, severely depleted by a spate of on-field injuries and fitness-related problems, will be determined to avoid the ignominy of a clean sweep against Bangladesh in the final ODI of the three-match series here on Saturday. Bangladesh, riding on two contrasting yet brilliant knocks from Mehidy Hasan Miraz, have already sealed […]","content":"Chattogram: A struggling Indian team, severely depleted by a spate of on-field injuries and fitness-related problems, will be determined to avoid the ignominy of a clean sweep against Bangladesh in the final ODI of the three-match series here on Saturday. Bangladesh, riding on two contrasting yet brilliant knocks from Mehidy Hasan Miraz, have already sealed the series after winning the first two matches but if Litton Das’ men can blank the ‘Men in Blue’ 3-0, it will be a historic first in the country’s cricket. Not only will it be an icing on the cake for the hosts but also significantly dent the visiting team’s confidence ahead of the Test series, starting at this very venue in less than a week’s time (December 14). For India, there were 20 cricketers originally available for this series since there was a very short turnaround time between the first ODI in Bangladesh and the last game in New Zealand as some players in both squads were common. But call it a cruel twist of fate as within a week things have gone from bad to worse and they only have 14 fit and available players to choose from for the final game. Such has been the plight that Kuldeep Yadav has been flown into Chattogram on SOS basis as the Indian bowling attack looks thin on experience. The left-arm wrist spinner with 118 wickets from 72 ODIs will be the most experienced bowler in the line-up. Regular skipper Rohit Sharma sustained a left thumb dislocation and has flown back home. Up and coming pacer Kuldeep Sen suffered a back injury after playing his first international game. Seamer Deepak Chahar continued his saga of breaking down in almost all the series he has played since his comeback from a long lay-off. Add to this, Axar Patel suffered a hit in the ribs and missed the first game while Rishabh Pant, who flew all the way from New Zealand, reportedly had a niggle and had to be rested for excessive workload prior to this series. In fact, there will be two forced changes in the playing eleven with Rohit and Chahar already unavailable. It is there to be seen whether India bring in Ishan Kishan into the playing XI as an opener or stand-in skipper KL Rahul, who is now a designated middle-order batter-keeper in this format, decides to promote himself just like during the tour of South Africa. The other option is continuing with Virat Kohli-Shikhar Dhawan combination and get someone like Rahul Tripathi, who can also bowl some cutters at mid 120 clicks, in the playing XI. If the team management goes for a pure batter rather than a utility player, then the stylish Rajat Patidar could get his first game for India. In case of Chahar’s replacement, there isn’t a back-up pacer available and the team might not have an option but to fall back to all-rounder Shahbaz Ahmed, who could be the sixth bowling option. India’s five-pronged bowling attack will be Mohammed Siraj, Shardul Thakur, Umran Malik, Washington Sundar and Axar Patel. With no Jasprit BUmrah, Mohammed Shami and Ravindra Jadeja, the Indian bowling unit’s performance at the back-end has been far from impressive. In the first match, it was plain and simple poor bowling when only one wicket to get and 51 runs still required, while in the second game, Bangladesh scored 200-plus runs after being six down for 69. In the second game, Chahar’s breakdown with another hamstring injury prompted skipper Rohit Sharma to make a terse statement about how one needs to get to the bottom of the issue to find out why so many players (fast bowlers especially) are getting injured in recent times. While a full-strength Bangladesh will start as favourites in the final game, the bigger worry will be KL Rahul, the skipper. —PTI His record, save in the ODI series win against a below-par Zimbabwe, has been dismal and the last thing he would need is another clean sweep defeat against his name after the tour of South Africa. Till now, there has been little or no indication that Rahul is a long-time future India captain, who can display above average leadership acumen in the matches that he has led so far. PTI 3rd ODI: Injury-plagued India stare at clean sweep by ‘Bangla Tigers’ added by Press Trust of India on 12:40 am December 10, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-09 19:10:08","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Call on Rohit’s availability for Test series to be taken later Jay Shah","link":"https://kashmirreader.com/2022/12/10/call-on-rohits-availability-for-test-series-to-be-taken-later-jay-shah/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: A call on injured India captain Rohit Sharma’s participation in the upcoming two-match Test series against Bangladesh, starting December 14, will be taken later, BCCI secretary Jay Shah said on Friday. Rohit had suffered a blow to his thumb while fielding in the slips during the second ODI against Bangladesh in Mirpur on […]","content":"New Delhi: A call on injured India captain Rohit Sharma’s participation in the upcoming two-match Test series against Bangladesh, starting December 14, will be taken later, BCCI secretary Jay Shah said on Friday. Rohit had suffered a blow to his thumb while fielding in the slips during the second ODI against Bangladesh in Mirpur on December 7. “The BCCI Medical Team assessed him and he underwent scans at a local hospital in Dhaka. He has flown to Mumbai for specialist consultation and will miss the final ODI. A call on his availability for the upcoming Test series will be taken later,” Shah stated in a press release. While the BCCI will wait for an update on Indian skipper’s availability, it can be safely concluded that with a dislocation as well as stitches, it will be near impossible for Rohit to train and then play a five-day match starting Wednesday. It is also not just about batting but also fielding. With India having a packed schedule of white-ball games throughout January, whether the risk will be taken in a Test series against Bangladesh is there to be seen. Kuldeep, Chahar set to report to NCA The BCCI has also instructed injury-prone pacer Deepak Chahar and rookie Kuldeep Sen to report to National Cricket Academy (NCA) for assessment of their hamstring and back injuries respectively, informed Shah. “Fast bowler Kuldeep Sen complained of stiffness in his back after the first ODI. The BCCI Medical Team assessed him and he was advised rest from the 2nd ODI. Kuldeep has been diagnosed with a stress injury and is ruled out of the series. “Fellow fast bowler Deepak Chahar sustained a left hamstring strain during the 2nd ODI and is also ruled out of the series. Both Kuldeep and Deepak will now report to NCA for further management of their injuries,” Shah stated. —PTI Call on Rohit’s availability for Test series to be taken later Jay Shah added by Press Trust of India on 12:37 am December 10, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-09 19:07:58","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi League 2022: Gujarat Giants hold Jaipur Pink Panthers to 51-all tie; UP Yoddhas beat Puneri Paltan","link":"https://www.firstpost.com/sports/pro-kabaddi-league-2022-gujarat-giants-hold-jaipur-pink-panthers-to-51-all-tie-up-yoddhas-beat-puneri-paltan-11783191.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi League 2022: Gujarat Giants hold Jaipur Pink Panthers to 51-all tie; UP Yoddhas beat Puneri Paltan","content":"Sports Pro Kabaddi League 2022: Gujarat Giants hold Jaipur Pink Panthers to 51-all tie; UP Yoddhas beat Puneri Paltan Sonu scored 14 points, while captain Lee contributed 10 points at the Gachibowli Indoor Stadium as the Giants held the Pink Panthers to a stalemate. FP Sports December 10, 2022 00:20:59 IST Gujarat Giants in action against the Jaipur Pink Panthers at the Gachibowli Indoor Stadium in Hyderabad. Image credit: PKL Hyderabad : Jaipur Pink Panthers held a healthy lead going into the last minute of the match, but Sonu and Dong Geon Lee put up inspiring performances and helped Gujarat Giants tie the game 51-51 in the Pro Kabaddi League in Hyderabad on Friday. Sonu scored 14 points, while captain Lee contributed 10 points at the Gachibowli Indoor Stadium. Parteek Dahiya pulled off a super raid as Gujarat Giants took the lead at 6-3 in the four minute. The all-rounder continued to make raids and reduced the Panthers to just two members on the mat. Moments later, the Giants inflicted an all out and took a massive lead at 13-7 in the seventh minute. But the Jaipur side tackled Dong Geon Lee and stayed in the game at 11-13. Abhishek KS and Deepak Singh picked up tackle points, but the Giants still held the lead at 17-15. Dahiya pulled off a magnificent multi-point raid catching out Deepak Singh and Abhishek KS and helped the Gujarat side extend their lead further. However, Rahul Chaudhari effected a couple of raids and helped the Panthers reach within touching distance of Giants’ score at 20-21. Spectacular performance coming from our super #Giant ! 💪 @sonujaglan55 is our @AmbujaCementACL player of the match. 😍 #GGvJPP #GarjegaGujarat #Kabaddi #PKL #kabaddifans #Kabaddifever #FantasicPanga @ProKabaddi pic.twitter.com/0vW9UkhShR — Gujarat Giants (@GujaratGiants) December 9, 2022 Thereafter, the Jaipur side tackled Mahendra Rajput and levelled the scores at 21-21 at the stroke of half-time. The Panthers pulled off an all out in the 24th minute and inched ahead at 29-26. Thereafter, Arjun Deshwal picked up a few raid points as the Jaipur side continued to keep their noses in front. UP Yoddhas deny Puneri Paltan top spot In the second fixture at Hyderabad’s Gachibowli Stadium on Friday, UP Yoddhas defeated Puneri Paltan 45-41 to deny them the opportunity to jump to the top of the PKL table heading into the playoffs that begin next week. The Yoddhas produced a clinical team performance with as many as three players scoring five or more points and eight registering at least a point on the scorecard. Puneri Paltan surged to a healthy nine-point lead early in the game as Aditya Shinde and Saurabh’s raiding helped inflict the first All Out of the game. The Yoddhas however, managed to reduce the deficit to a great extent shortly before halftime courtesy a Super Raid from Anil Kumar, with the score reading 22-19 in favour of the Paltan at the interval. #vivoProKabaddi ka Hyderabad leg khatam kiya Yoddhas ne ek shaandaar jeet ke sath 💪 Agla Station 👉 Playoffs 😍 #PUNvUP #SaansRokSeenaThok #YoddhasHum #FantasticPanga #GMRGroup #GMRSports pic.twitter.com/40uIjvVlnH — U.P. YODDHAS (@UpYoddhas) December 9, 2022 UP drew level with an All Out on the other side of the interval, before another one put them in the lead. The Paltan tried fighting back late in the game but a series of Super Tackles helped UP maintain their lead, and ultimately clinch the game. Puneri Paltan currently sit at the second spot on the table with 80 points, two points behind leaders Jaipur Pink Panthers. UP Yoddhas, meanwhile, sit two places below the Paltan with 71 points, two short of Bengaluru Bulls. With inputs from PTI Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 10, 2022 00:24:54 IST TAGS: Pkl Pro Kabaddi League 2022 Pro-kabaddi League","pubDate":"2022-12-09 18:54:54","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Gujarat-Giants-Jaipur-Pink-Panthers-PKL-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Can battered India avoid Bangladesh whitewash?","link":"https://thenorthlines.com/can-battered-india-avoid-bangladesh-whitewash/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies A struggling Indian team, severely depleted by a spate of on-field injuries and fitness-related problems, will be determined to avoid the ignominy of a clean sweep against Bangladesh in the final ODI of the three-match series in Chattogram on Saturday. Bangladesh, riding on two contrasting yet brilliant knocks from Mehidy Hasan Miraz, have already […] The post Can battered India avoid Bangladesh whitewash? appeared first on Northlines.","content":"Agencies A struggling Indian team, severely depleted by a spate of on-field injuries and fitness-related problems, will be determined to avoid the ignominy of a clean sweep against Bangladesh in the final ODI of the three-match series in Chattogram on Saturday. Bangladesh, riding on two contrasting yet brilliant knocks from Mehidy Hasan Miraz, have already sealed the series after winning the first two matches. If Litton Das’ men can blank India 3-0, it will be a historic first for Bangladesh cricket . Not only will it be an icing on the cake for the hosts but also significantly dent the visiting team’s confidence ahead of the two-Test series, starting at this very venue in less than a week’s time (December 14). For India, there were 20 cricketers originally available for this series since there was a very short turnaround time between the first ODI in Bangladesh and the last game in New Zealand as some players in both squads were common. But call it a cruel twist of fate as within a week things have gone from bad to worse and they only have 13 fit and available players to choose from for the final game. Such has been the plight that Kuldeep Yadav has been flown into Chattogram on SOS basis as the Indian bowling attack looks thin on experience. The left-arm wrist spinner with 118 wickets from 72 ODIs will be the most experienced bowler in the line-up. Captain Rohit Sharma sustained a left thumb injury and has flown back home. Pacer Kuldeep Sen suffered a back injury after playing his first international game, while seamer Deepak Chahar continued his saga of breaking down in almost all the series he has played since his comeback from a long lay-off. Add to this, Axar Patel suffered a hit in the ribs and missed the first game while Rishabh Pant, who flew all the way from New Zealand, reportedly had a niggle and had to be rested for excessive workload prior to this series. In fact, there will be two forced changes in the playing eleven with Rohit and Chahar already unavailable. It is there to be seen whether India bring in Ishan Kishan into the playing XI as an opener or stand-in skipper KL Rahul, who is now a designated middle-order batter-keeper in this format, decides to promote himself just like during the tour of South Africa. The other option is continuing with Virat Kohli-Shikhar Dhawan combination and get someone like Rahul Tripathi, who can also bowl some medium pacers, in the playing XI. If the team management goes for a pure batter rather than a utility player, then the stylish Rajat Patidar could get his first game for India.","pubDate":"2022-12-09 18:03:50","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS Women T20 Cricket | Deepthi scored 36 runs in 15 balls: Aussie won the game.","link":"https://thenewsglory.com/ind-vs-aus-women-t20-cricket-deepthi-scored-36-runs-in-15-balls-aussie-won-the-game/","keywords":["Sports","Australia","Cricket","Deepti Sharma","IND vs AUS","India","T20","Women's cricket"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: In the first T20 cricket match against the Australian team, Deepti Sharma of the Indian women’s team scored an amazing 36 runs off 15 balls. Many are praising his action innings. Australian women’s cricket team is touring India for a 5-match T20I series. The first match of the series started today at the DY […]","content":"Mumbai: In the first T20 cricket match against the Australian team, Deepti Sharma of the Indian women’s team scored an amazing 36 runs off 15 balls. Many are praising his action innings. Australian women’s cricket team is touring India for a 5-match T20I series. The first match of the series started today at the DY Patil Stadium. The Australian team won the toss and chose to bowl. Indian team scored 175 runs for the loss of 5 wickets in 20 overs. Playing for the Indian team, Shefali scored 21 runs, Smriti Mandhana scored 28 runs, Captain Harmanpreet 21 runs, Devika 25 runs, Richa Ghosh 36 runs and Deepti 36 runs. Deepti Sharma scored 36 runs in 15 balls. His strike rate is 240. This includes 8 boundaries. Australia chased down the target of 173 runs to win. Team captain Alyssa Healy and Beth Mooney opened the innings. Healy was dismissed for 37 runs off 23 balls. McGrath continued to approach the innings with responsibility. He changed his game dramatically in the final overs. He scored 40 runs off 29 balls. Mooney, on the other hand, scored 89 off 57 balls. Australia scored 173 runs in 18.1 overs and won by 9 wickets.","pubDate":"2022-12-09 17:39:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"I have been working on my power-hitting: Washington Sundar","link":"https://www.orissapost.com/i-have-been-working-on-my-power-hitting-washington-sundar/","keywords":["Sports","Washington Sundar"],"creator":["Post News Network"],"video_url":null,"description":"Chattogram: He is not the quintessential power-hitter. But, keeping in mind the Indian team’s requirements ahead of next year’s World Cup, Washington Sundar is working “specifically” on how to hit the ball long and hard. Known to rely more on timing and placement, Washington has also played a few blinders, the most recent coming in […]","content":"I have been working on my power-hitting: Washington Sundar PTI Updated: December 9th, 2022, 22:42 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Chattogram: He is not the quintessential power-hitter. But, keeping in mind the Indian team’s requirements ahead of next year’s World Cup, Washington Sundar is working “specifically” on how to hit the ball long and hard. Known to rely more on timing and placement, Washington has also played a few blinders, the most recent coming in the tour of New Zealand. And who can forget his 14-ball 40 against Rajasthan Royals in the IPL, representing Sunrisers Hyderabad. “That’s the role I have been getting in the last few years or so. That’s what that particular position demands, and I have working quite specifically that way. “Whatever positions demand me to do, I have been practising that way. I have been working in those specific manners,” Washington said on the eve of the third ODI against Bangladesh. Washington is happy that his hard work is reaping dividends. “I am glad that all the hard work has been coming good in the last few months or so. Hopefully, I will continue to do really well in the coming months and years as well.” The all-rounder, who has picked up five wickets in the two preceding matches of the series which India have already lost, is looking to be the player for all situations and positions. “It was a great opportunity for me in last game. With the World Cup next year, I want to be the player who could play in any situation, in any sort of combinations, and wherever the team needs. To win games, wherever they ask me to play, I will play. That’s the kind of player I want to be. “I want to be able to contribute to my potential, contribute in a way that the team gets to win most of the games, and eventually, be very, very successful in the World Cup. I just want to be in the present and keep doing well, keep getting better in every aspect of the game.” India lost both their matches in Bangladesh from winning positions, having the hosts at 136 for nine in a chase of 187 in the opener and then reducing them to 69 for six before letting them off the hook to make 271 for seven in the second match. “To be honest, we had our opportunities in both the games, First game, they needed about 50 runs to win with one wicket and we had a good opportunity. And even the last game, we had a good opportunity. “In the first innings, they were 70 for six and with the way Shreyas and Axar were batting, we we were going to win quite convincingly and Rohit bhai, the kind of knock he played, it was unreal. “It was just about winning those critical moments, probably doing one or two things better here and there. We will look to end the one-day series on a high.” Washington was all praise for the Bangladesh side. “Bangladesh is a high-quality side, especially at home, I think they have lost only one series at home, to England. They had a good run in the T20 World Cup.” The struggling and depleted Indian team will be determined to avoid the ignominy of a clean sweep against Bangladesh in the final ODI of the three-match series here on Saturday. “Every game is an opportunity for us to keep getting better, to get the right rhythm, and obviously, perform really well as a team. There is not going to be many games in the next 10 months or so, so every game is very important for us, we want to play a very good brand of cricket no matter who we are playing. “Our job is to play to our potential and keep getting better whenever we have to. That’s the kind of mindset we are in and we will keep looking to improve,’ Washington said. Washington has battled a spate of injuries before forcing his way back into the Indian team. “Definitely quite disappointing with the few injuries that I have had in the past. I just want to live in the present, I am getting opportunities, really want to perform and win games for India consistently. That way things will be very bright for me and we as a team will also be very consistent.” Asked about getting advice from head coach Rahul Dravid, he said, “He has got so much experience especially at this level, one-day format, he has played so many games. So obviously, he had lots of insights to share and every conversation with him is very valuable.” PTI Tags: Washington Sundar Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Croatia beat Brazil on penalties to enter World Cup semifinals December 9, 2022 Hero Motosports team announces four-rider team for Dakar Rally December 9, 2022 Washington Sundar wants to be ready for all situations December 9, 2022 BCCI invites bids for Women’s IPL media rights December 9, 2022 PT Usha to be officially elected as first woman president December 9, 2022 Tennis star Barty awarded Australian sport’s highest honour December 9, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-12-09 17:12:43","image_url":"https://www.orissapost.com/wp-content/uploads/2022/10/jkhjkhhkjh-300x197.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Fox Cricket captures the voice of the batsman on the pitch through the mic","link":"https://thenewsglory.com/fox-cricket-captures-the-voice-of-the-batsman-on-the-pitch-through-the-mic/","keywords":["Sports","Australia","Cricket","Fox Cricket","India"],"creator":["The News Glory"],"video_url":null,"description":"Adelaide: Fox Cricket, the Australian TV channel company, has launched a new initiative to add more interest to the viewers who love to watch cricket matches. It is about capturing the batsman’s voice on the pitch, his mental flow through the mic. It has also been well received by fans internationally. Following Australian players like […]","content":"Adelaide: Fox Cricket, the Australian TV channel company, has launched a new initiative to add more interest to the viewers who love to watch cricket matches. It is about capturing the batsman’s voice on the pitch, his mental flow through the mic. It has also been well received by fans internationally. Following Australian players like Warner and Smith, Fox Cricket recently put the mic on the team’s opener Usman Khawaja. Here the voices of commentators are muted. He scored 62 off 129 balls in the first innings of the ongoing Test match against the West Indies at the Adelaide Stadium. The TV channel has put the mic on this innings of his. All his speech like taking the cut, facing the ball, running, talking to his opposite partner is recorded on this mic. Fox Cricket has shared it as it is in audio visual format. The fans who saw the video asked, ‘When will it come to India?’ Fans are sharing their comments of various types starting from. It is noteworthy that earlier in IPL cricket the players of the fielding team spoke to the commentators. We Mic’d up Usman Khawaja and the results are *chef’s kiss* pic.twitter.com/EmnZ73a7XM","pubDate":"2022-12-09 16:38:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: South African and Australian players bound for Carrickfergus","link":"https://www.northernirelandworld.com/sport/cricket/cricket-south-african-and-australian-players-bound-for-carrickfergus-3948907","keywords":["Sport"],"creator":["By The Newsroom"],"video_url":null,"description":"Carrickfergus Cricket Club is pleased to announce the signings of new South African professional,Titans all-rounder Dayyaan Galiem (25) and the highly-rated Irish-qualified Western Australian batsman Jake Egan (19) for the 2023 season.","content":"Sport Cricket: South African and Australian players bound for Carrickfergus Carrickfergus Cricket Club is pleased to announce the signings of new South African professional,Titans all-rounder Dayyaan Galiem (25) and the highly-rated Irish-qualified Western Australian batsman Jake Egan (19) for the 2023 season. By The Newsroom 4 hours ago Updated 9th Dec 2022, 3:47pm Commenting on the appointments, a spokesperson for the Middle Road-based club said: “Dayyaan Galiem, was a schoolboy star who represented South Africa Under 19’s at the age of just 16 and went on to play in the 2016 U19 World Cup. “He made his debut for Western Province the same year and also represented SA Universities and SA Emerging players. Advertisement “He joined the Titans franchise in 2019 and has become one of the most consistent performers in South African franchise cricket. Most Popular Philadelphia, here comes golfer Jake! Sport Cricket: South African and Australian players bound for Carrickfergus Sport Dayyaan Galiem. Advertisement “Galiem is a genuine all-rounder, a right-handed top order batsman who has scored 1,684 first class runs at 33.01 and a high-quality right arm fast medium bowler with 108 first class wickets at 29.12 to his credit.” The spokesperson added: “Jake Egan is a top order batsman and handy off spinner, who has now established himself in Perth first Grade cricket, representing the University club in the WACA Premier competition. Advertisement “He has the power to dominate an attack and the patience to bat long innings depending on the situation. He has recently made his best first Grade score of 89* and has best bowling figures of 4 for 27.” The east Antrim club has also announced the appointment of Stephen Smyth to the new role of Director of Cricket . Jake Egan. A Former Irish international, Smyth has vast experience in the coaching and development of players at all levels and will be working with the professional, coaches and captains to deliver an effective structured coaching programme for all players in the club. Advertisement He will also act as team manager for the 1 st XI and will be working to develop links with local secondary schools and to develop women’s cricket at the club. Captain CJ van der Walt said: “I am very pleased that the club has been able make these two quality signings and really look forward to welcoming Dayyaan and Jake next season. We are also delighted that Stephen will shortly be joining us as Director of Cricket. Advertisement Read More Kilwaughter Minerals Larne 10-Miler: Race to be staged in March Stephen Smyth. \"We will be working hard over the winter and have clear plans for 2023 and beyond.” Cricket","pubDate":"2022-12-09 15:47:27","image_url":"https://www.northernirelandworld.com/webimg/b25lY21zOjA5YmQzMjdlLWQyYjctNDdmOS1iZmJiLTVhODQ2OTgwNzg5YzphYzBlNGFiYy04NTNjLTRiMGYtYWM2YS01OGUyN2MwYzdiNzM=.jpg?width=1200&auto=webp","source_id":"northernirelandworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Former England cricketer who plays for his home country Zimbabwe","link":"https://thenewsglory.com/former-england-cricketer-who-plays-for-his-home-country-zimbabwe/","keywords":["Sports","Cricket","England","Gary Ballance","Zimbabwe"],"creator":["The News Glory"],"video_url":null,"description":"It has been reported that Gary Ballance, who played for England in the international cricket field, is now going to play for his motherland Zimbabwe. He has reportedly signed a two-year deal with Zimbabwe Cricket. 33-year-old Carey made his debut in international cricket in 2013 to play for the England team. He last played for […]","content":"It has been reported that Gary Ballance, who played for England in the international cricket field, is now going to play for his motherland Zimbabwe. He has reportedly signed a two-year deal with Zimbabwe Cricket. 33-year-old Carey made his debut in international cricket in 2013 to play for the England team. He last played for the England team till July 2017. Left handed batsman. After that he did not get a chance in the team. He played 23 Test matches and scored 1,498 runs. He has also played in 16 ODIs. Born in Zimbabwe in 1989, Gary has played cricket in various age groups in that country. His parents have been farming there. In the 2006 U-19 World Cup series against England, he won the man of the match award. Later the same year he moved to England and started playing cricket at the local level. He got a chance to play for the England team due to his amazing performance. From 2013 to 2017 he played in some major series including the Ashes series. But he has been coming and going in the team. Of his four Test centuries, two came against India. Last year he was accused of racially abusing a fellow Yorkshire team-mate. He subsequently lost his chance to play for England. He was released from the Yorkshire team before the end of his contract. In this context, he is going to play for Zimbabwe in the international arena.","pubDate":"2022-12-09 15:37:09","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: Abhimanyu Easwaran set to join visitors' squad ahead of Chattogram Test","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-abhimanyu-easwaran-set-to-join-visitors-squad-ahead-of-chattogram-test-11783051.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh: Abhimanyu Easwaran set to join visitors' squad ahead of Chattogram Test","content":"Cricket India vs Bangladesh: Abhimanyu Easwaran set to join visitors' squad ahead of Chattogram Test Easwaran had earlier led the India A team in their unofficial Test series against Bangladesh A, where the Bengal batter scored two hundreds in as many outings. FirstCricket Staff December 9th, 2022 21:21:04 IST Abhimanyu Easwaran led from the front during India A's unofficial Test series against Bangladesh A, scoring a ton in each of his two outings. Image credit: Twitter/@BCCI After being touted as a likely inclusion, Abhimanyu Easwaran is set to join the Indian team for the first Test against Bangladesh in Chattogram. Opening batter Easwaran, who represents Bengal in domestic cricket and led the India A team in their unofficial Test series against Bangladesh A, joins the side as skipper Rohit Sharma’s replacement, according to a report by ESPNCricinfo . ‘Hitman’ has been ruled out of the third ODI as well as the first Test — both of which take place in Chattogram’s Zahur Ahmed Chowdhury Stadium — after picking up a thumb injury while fielding during the second ODI in Dhaka. Easwaran’s call-up to the senior side comes on the back of a prolific run in the series against Bangladesh A, where he led the India A side from the front with scores of 141 and 157, the second knock earning the Indians an innings and 123-run victor and him the ‘Player of the Match’ award. Easwaran’s chances of making his international debut in the series however, appear slim with the Indian team likely to open with KL Rahul — who will take over the leadership in Rohit’s absence — and Shubman Gill at Chattogram. The BCCI, meanwhile, is hopeful of Rohit recovering in time for the second Test, which takes place at Dhaka’s Sher-e-Bangla Stadium. Rohit, who produced a heroic 51 not out that nearly helped India level the series in the second ODI, has been sent to the National Cricket Academy in Bengaluru to recover from the injury on his left thumb. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 09, 2022 21:21:04 IST Tags: Abhimanyu Easwaran Cricket India Vs Bangladesh India Vs Bangladesh 2022 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-09 15:34:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Abhimanyu-Easwaran-IND-A-BAN-A-Twitter-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 to begin on 1 April; Women's IPL from 3 March: Report","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-to-begin-on-1-april-womens-ipl-from-3-march-report-11783061.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023 to begin on 1 April; Women's IPL from 3 March: Report","content":"Cricket IPL 2023 to begin on 1 April; Women's IPL from 3 March: Report The final dates of the IPL 2023 are being worked out by BCCI on the availability of overseas players with the 10-team tournament returning to home-away format for the first time since the COVID-19 pandemic FirstCricket Staff December 9th, 2022 20:56:50 IST IPL 2023 is reported to start from 1 April while WIPL 2023 to be played from 3 March. IPL IPL 2023 is likely to be hosted from 1 April while the inaugural edition of the Women’s IPL is expected to be hosted from 3 March, reported Espncricinfo. BCCI are yet to officially confirm the dates for both the tournaments but the window for the Women’s IPL is slated a week after the 2023 Women’s T20 World Cup ends in Cape Town. The final dates of the IPL 2023 are being worked out by BCCI on the availability of overseas players with the 10-team tournament returning to home-away format for the first time since the COVID-19 pandemic. The IPL is likely to be wrapped up by the of May as England are slated to face Ireland in a one-off Test from 1 June. Soon after, The Oval will host the ICC World Test Championship final with India as one of the favourites for the game. The Ashes also begin soon after from 16 June. Earlier on Friday, BCCI announced the tender for the media rights of Women’s IPL from 2023 to 2027. The deadline for picking up the tender is 31 December. The bids for the media rights will open from 8 January, the report further added. The Indian cricket board has opted for a closed-bid process this time instead of an e-auction. As confirmed by BCCI to its state association, there will be five franchise teams at the inaugural edition of the WIPL with 22 matches being played in total. Each teams will have up to 18 players, including six overseas players. The teams will be allowed to field five overseas player in the playing XI with four from Full Member countries and one from an Associate nation. After the teams face each other twice in the league phase, the table topper will directly progress to the final while the team’s finishing second and third will face off in an eliminator to decide the second finalist. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 09, 2022 20:56:50 IST Tags: Cricket Ipl 2023 Wipl Women's Ipl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-09 15:26:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/IPL-trophy.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs PAK | Abrar Ahmed took 7 wickets in his debut Test match","link":"https://thenewsglory.com/eng-vs-pak-abrar-ahmed-took-7-wickets-in-his-debut-test-match/","keywords":["Sports","Abrar Ahmed","Cricket","game","India","online special","Pakistan"],"creator":["The News Glory"],"video_url":null,"description":"Every sports enthusiast has a dream to play for his country. Pakistan’s magic spinner Abrar Ahmed made that dream come true today and set a record by capturing 7 wickets. He made his debut in the 2nd Test against England. In the first innings he bowled 22 overs and scored 114 runs and took 7 […]","content":"Every sports enthusiast has a dream to play for his country. Pakistan’s magic spinner Abrar Ahmed made that dream come true today and set a record by capturing 7 wickets. He made his debut in the 2nd Test against England. In the first innings he bowled 22 overs and scored 114 runs and took 7 wickets. An over maiden in this. The English cricket team led by Stokes is touring Pakistan and playing Test cricket series. The England team is leading 1-0 after winning the first match of this 3-match series. The second match started today in Multan city. England won the toss and elected to bat. The team was all out for 281 runs in the first innings. Debutant Abrar took 7 wickets. He is the first player since 1950 to take 5 wickets in the first opening session of a men’s Test cricket match. Before this, Australia’s Charlie Turner (1887), England’s Martin (1890), and West Indies’ Valentine (1950) have taken 5 wickets in their debut match in the first session. who is he? – Although officially known as a leg-spinner, he is capable of bowling googly and carrom balls. Sri Lanka’s Mahesh Thiksana is another mystery spinner who bowls leg spin, off spin and carom balls with variety. This is confirmed by news from that country. His hard spin on the ball has attracted the attention of Karachi cricket fans. Karachi is the weakest cricket zone in Pakistan. But, coming from there, he grabbed 53 wickets in 2016 and attracted attention. His bowling evolved at the Rashid Latif Academy. His name came to light in Pakistan Super League T20 cricket for Karachi Kings. He bowled 7 dot balls to Eoin Morgan was a talking point. It is noteworthy that Eoin Morgan scored 80 runs in 57 balls in this match. But he could not do anything to Abrar Ahmed. Sri Lankan legends Jayawardene and Sangakkara were amazed to see his bowling. His coach Masroor says about him, “A player capable of playing in all formats. Because he knows the art of taking wickets. He bowls a variety of balls and chokes. He is sure to be Pakistan’s main bowler. At the end of the first day’s play, Pakistan team scored 107 runs for the loss of 2 wickets. Babar Azam, the captain of the team, is in the field with 61 runs. Shakeel has scored 32 runs.","pubDate":"2022-12-09 14:36:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Mignon du Preez announces retirement from international cricket","link":"https://thenewsmill.com/2022/12/mignon-du-preez-announces-retirement-from-international-cricket/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Mignon du Preez, the veteran South African all-rounder, announced her retirement from international cricket on Friday. After the ICC Women’s Cricket World Cup earlier this year, Du Preez decided to stop playing Test matches and ODIs. She ended a stellar 15-year international career on Friday, announcing that she would also retire from T20 Internationals. Du Preez represented South Africa in 269 international games, the last of which was at the Commonwealth Games. “Fifteen years of international cricket, wow, what a blessing it has been. It’s never an easy decision to step away from something you love as much as I love cricket, but I know in my heart that the time is right for me to announce my retirement from all forms of international cricket. I will definitely miss the change-room chats, the off-field friendships from all around the globe, travelling and learning about different cultures. However, I am extremely excited about the next phase of my life together with the ones that I love dearly and that have taken a back seat during the last 15 years of my career,” ESPNcricinfo quoted du Preez as saying in a retirement note circulated by Cricket South Africa. The 33-year-old will be available for T20 franchise leagues, though. She has contracts with the Women’s Hundred’s Trent Rockets and the WBBL’s Hobart Hurricanes. ALSO READ: Safdarjung Hospital reports cyberattack but not ransomware; AIIMS server down for 11th day “However, I will still continue to play the shorter format of the game in the global leagues until such a time that I am blessed to become a mom and start a family of my own,” said the batter. After South Africa’s successful 50-over World Cup campaign in New Zealand, where she helped lead them into their second consecutive semi-final, she announced her retirement from Test and ODI cricket, in April. In August, she competed in her final match in South Africa colours at the Commonwealth Games in Birmingham. “This is a bittersweet moment for South African cricket and the world at large as we bid farewell to one of the game’s favourite characters on the international stage. Over the last 16 years, du Preez’s professionalism and commitment shown towards her country has been exemplary… Her devoted, passionate team-first personality will be sorely missed, and I wish her the very best with the rest of her career and life after the game,” Enoch Nkwe, CSA’s director of cricket was quoted by ESPNcricinfo as saying. After making her debut at the age of 17 in 2007, she played 154 ODIs, 114 T20Is, and one Test, in which she led and scored a hundred. She finished as South Africa’s all-time leading ODI run scorer. She participated in seven T20 World Cups in total, and throughout that time she oversaw South Africa’s evolution from a team with little experience to one of the top contenders of world titles. She took over as the team’s permanent captain in 2011 and served in that capacity for five years before resigning to concentrate on her batting. She captained South Africa in all 46 One Day Internationals, 50 Twenty20 Internationals, and the lone Test the side has played since her debut. (ANI) ALSO READ: All-round England beat valiant Pakistan by 74-runs in first Test in country since 2005 This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-09 14:31:24","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"England opener Ben Duckett sends warning to Pakistan spinner Abrar Ahmed after dream debut","link":"https://metro.co.uk/2022/12/09/cricket-pakistan-england-ben-duckett-sends-warning-abrar-ahmed-17910519/","keywords":["Cricket","Sport","England cricket","Pakistan Cricket"],"creator":["Louis Sealey"],"video_url":null,"description":"Ahmed took seven wickets on his Test debut.","content":"Abrar Ahmed took seven wickets as Pakistan fought back (Picture: Getty) Ben Duckett insists England have no intention of ‘blocking’ Pakistan debutant Abrar Ahmed despite his dream start to Test cricket. Ahmed, 24, took seven wickets as England were bowled out for 281 in 51.4 overs on day one of the second Test in Multan. At one stage Ahmed had taken all seven wickets to fall and just missed out on becoming the first Pakistan bowler to take eight wickets in his first Test innings as fellow spinner Zahid Mahmood chipped in with three lower-order scalps. Pakistan reached 107-2 by the close of play as they look to level the three-match series after a humbling defeat in Rawalpindi last week. Duckett says Ahmed bowled ‘beautifully’ on his debut but has dismissed suggestions England could not read the mystery spinner and insisted they would take him on in the second innings. ‘I can only talk individually and I had my plans for him. He was basically a leg-spinner who had a good googly,’ said Duckett, who top-scored for England with 63 from 49 balls. ‘There was no real mystery to it but he bowled beautifully today. I’m sure we’ll have our plans second innings but I’m pretty sure it won’t be blocking it. Ben Duckett says England won’t hold back against the spinner (Picture: Getty) ‘I think I swept about 90% of his balls and when you’re sweeping you don’t necessarily look for it but his googly was a lot slower. ‘Most of the guys said they did pick him, he just bowled some nice deliveries and unfortunately for us, it was his day today. ‘There was limited footage of him, mainly of him bowling in the nets and not much to left-handers but to me personally, I’d rather not know all of his tricks because I’ll be worrying about what he can do. ‘I’d rather focus on what I can do to him. When you’re sweeping, he generally bowls quite slow, it doesn’t matter too much which way it is turning.’ Duckett, who scored a century in the series opener, believes the second Test is evenly poised and insists Ben Stokes and Brendon McCullum were ‘very happy’ with England’s batting display. England looked in a good position to post another big total at 117-1 but lost four more wickets before lunch as their batters continued to look for boundaries. ‘I’d say it’s level at the minute. We were a couple of quick wickets away from it being our day,’ Duckett added to Sky Sports. ‘We’ll have to see how it goes in the morning but we’re pretty happy overall. Today was about assessing those conditions early and as soon as the seamer bowled that slower ball, it was clear it was going to spin. I think the game is going to move forward pretty quickly. ‘If we can keep them to around our score, anything less is a bonus, then I think it should be very hard work in the fourth innings. Pakistan will look to build a first-innings lead on day two (Picture: Getty) ‘[Stokes and McCullum] are very happy. You’re know what they’re like, they’re very positive. We were actually really happy at lunch with the rate we scored. ‘A lot of teams might have been quite tentative and you could easily have been 100-6 at lunch. The rate we scored at, they’re pretty happy. I think it’ll be an exciting game, I hope it keeps spinning.’ Ahmed, meanwhile, insisted his Test debut was a day to remember as he ripped through England and put Pakistan on top. ‘I will not forget today, but now I want to win this match for Pakistan,’ he said via an interpreter. ‘I definitely dreamed about getting five wickets on debut but not so quickly.’ MORE : Ben Stokes explains Foakes snub and Wood recall for second Pakistan Test MORE : Alice Capsey cuts England cricket tour short after breaking collarbone For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-12-09 14:20:09","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Aussie bowlers make inroads under lights after posting 500 | Australia v West Indies 2022-23 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9T01YUElvTU9GTk3SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Aussie bowlers make inroads under lights after posting 500 | Australia v West Indies 2022-23  cricket.com.auRecent Match Report - Australia vs West Indies 2nd Test 2022/23  ESPNcricinfoChanderpaul fights but Australia in command | Cricbuzz.com - Cricbuzz  CricbuzzMilestones galore as Marnus, Head take full control | Australia v West Indies 2022-23  cricket.com.auAustralia vs West Indies 2nd Test, Day 3 Live Updates: Australia Look To Bundle Out West Indies On D..  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-12-09 13:55:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Gary Ballance set to play for Zimbabwe after signing two year contract","link":"https://www.indiatvnews.com/sports/cricket/gary-ballance-set-to-play-for-zimbabwe-after-signing-two-year-contract-gary-ballance-england-cricket-zimbabwe-cricket-2022-12-09-829991","keywords":null,"creator":null,"video_url":null,"description":"Zimbabwe Cricket have been 'elated' to bring aboard England's batter into their cricket framework. Following his release from the Yorkshire county side, England's Gary Ballance is set to play for Zimbabwe in domestic and international cricket after penning a two-year contract with the country of his birth.","content":null,"pubDate":"2022-12-09 13:39:25","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Mudit, Rajab shine with the ball at HCA A3 division league","link":"https://telanganatoday.com/mudit-rajab-shine-with-the-ball-at-hca-a3-division-league","keywords":["News","Sport","HCA","HCA A3 division league","Hyderabad"],"creator":["Telangana Today"],"video_url":null,"description":"Mudit scalped seven for 24 to guide his side Picket CC to a six-wicket win over Mahbubnagar College in the HCA A3 division","content":"Home | Sport | Mudit Rajab Shine With The Ball At Hca A3 Division League Mudit, Rajab shine with the ball at HCA A3 division league Mudit scalped seven for 24 to guide his side Picket CC to a six-wicket win over Mahbubnagar College in the HCA A3 division By Telangana Today Published Date - 07:00 PM, Fri - 9 December 22 Hyderabad: Mudit scalped seven for 24 to guide his side Picket CC to a six-wicket win over Mahbubnagar College in the HCA A3 division one-day league championship in Hyderabad on Friday. In another match, Rajab Ali returned with 7/25 bowling figures as his side Southern Stars defeated Raju Cricket Centre by 206 runs. Also Read Maqbool, Daniyal star for Nizam CC at HCA A3 division league Brief Scores: MP Sporting 241/6 in 30 overs (Anil Kumar 110, Rajasekhar 50; C V Anand 2/45) bt Secunderabad Club 228/8 in 30 overs (CV Anand 62; Satish Gupta 3/34); Southern Stars 287 in 37 overs (Mohd Abdul Sami 75, Kamal Teja 84; Srinivas Kalyan 5/47, T Naren 5/47) bt Raju Cricket Centre 81 in 20.1 overs (Rajab Ali 7/25); Vijaynagar 198/7 in 45 overs (Rayudu Naik 86; Mohd Rayan 3/22) bt Victory 169 in 42.1 overs (Chalapathy 101); Natraj CC 132 in 33.5 overs (Sai Manideep 4/20) lost to Raju CA 133/6 in 28.3 overs; Lal Bahadur CC 68 in 21.5 overs (Mehraj Ahmed 3/19, Pranav 3/5) lost to Sungrace 72/2 in 14 overs; Mahbubnagar College 122 in 26.2 overs (Mudit 7/24) lost to Picket CC 123/4 in 19.1 overs (Raghavan 62no); Gaganmahal 54 in 33.4 overs (Sreekar 4/9) lost to Youth CC 56/1 in 6.5 overs; Roshanara 80 in 30 overs (Naresh 4/15, Somshubra Pal 3/23) lost to PPMCC 81/3 in 11.4 overs; Rangareddy 182 in 41.5 overs (Tapish Kumar 75; Hanu Pavan 4/38) bt Reliance 74 in 27.3 overs (Rahul 3/24); Boystown 272/8 in 50 overs (Sohail khan 70; Ganesh Naik 3/59, Vishnuvardhan 3/31) bt Lal Bahadur PG 168 in 46.3 overs (Sai Veerendra 59; B Prasad 3/29); Lucky XI 236 in 37.3 overs (Ram Charan 65, Abhiram 70; Rudra Nair 3/40, Smaran 4/45) lost to St Andrew’s 238/8 in 42.2 overs (Surya Kiran Yadav 88no; Adeesh 3/56); Southend Raymonds 159/8 in 30 overs (Ajay Suri 52) bt Navjeevan Friends 120/6 in 30 overs (Rakesh Sekhar 50). Top Performers: Centurions: Anil Kumar 110, Chalapathy 101 Five or more wickets: Mudit 7/24, Rajab Ali 7/25, Srinivas Kalyan 5/47, T Naren 5/47 Follow Us : Tags HCA HCA A3 division league Hyderabad Related News Hyderabad: Man held for selling Chinese manja Rizwan’s ton powers HSE into finals of HCA U-16 tournament Hyderabad CP holds meeting with organisers of Formula-E race Unidentified persons allegedly kidnapped woman before her engagement in Hyderabad Hyderabad: 6,119 units of residential properties registered in November Hyderabad to have all round Metro Rail connectivity, infrastructure for future: CM KCR","pubDate":"2022-12-09 13:30:13","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Mignon Du Preez retires from international cricket","link":"https://ewn.co.za/2022/12/09/mignon-du-preez-retires-from-international-cricket","keywords":null,"creator":null,"video_url":null,"description":"One of the all-time greats of women's cricket in South Africa, du Preez, has announced her retirement after 15 years. She represented the Proteas in 154 One Day Internationals and 114 T20 matches, along with a solitary Test match in 2014.","content":null,"pubDate":"2022-12-09 13:09:44","image_url":null,"source_id":"ewn","country":["south africa"],"category":["sports"],"language":"english"},{"title":"India-W vs Australia-W Live Cricket scores: Australia have won the toss, opted to field first","link":"https://www.firstpost.com/firstcricket/sports-news/india-women-vs-australia-women-live-score-ind-w-vs-aus-w-1st-t20i-2022-women-cricket-latest-updates-11782271.html","keywords":["First Cricket News"],"creator":["Bansal Shah"],"video_url":null,"description":"India-W vs Australia-W Live Cricket scores: Australia have won the toss, opted to field first","content":"18:44 (IST)India vs Australia Women Toss:Here are the visuals from the toss 🚨 Toss News 🚨Australia have won the toss & elected to bowl against #TeamIndia in the first #INDvAUS T20I. Follow the match 👉 https://t.co/bJbnxaQzAr pic.twitter.com/XrtPRtfDcG— BCCI Women (@BCCIWomen) December 9, 202218:43 (IST)India vs Australia Women Toss:Playing XIAustralia Women: Alyssa Healy(c/wk), Beth Mooney, Tahlia McGrath, Ashleigh Gardner, Ellyse Perry, Grace Harris, Annabel Sutherland, Jess Jonassen, Alana King, Kim Garth, Megan SchuttIndia Women: Smriti Mandhana, Shafali Verma, Jemimah Rodrigues, Harmanpreet Kaur(c), Devika Vaidya, Richa Ghosh(wk), Deepti Sharma, Radha Yadav, Anjali Sarvani, Meghna Singh, Renuka Singh18:37 (IST)India vs Australia Women Toss:Australia have won the toss, opted to field first. India will bat first. 18:26 (IST)India vs Australia Women Live:Hello and Welcome to the live coverage of the 1st T20I between India and Australia. India will look to improve their poor record against the Aussies at home. Aussies, on the other hand, will try to continue their domination. Toss in a while, stay tuned!India have had a fascinating year in T20Is with the Commonwealth Games silver medal being the spotlight of the year. However, what restricted India from clinching the coveted gold medal at the CWG was the dominating and intimidating Australian side led by Alyssa Healy.Indian women’s cricket has definitely come through the ranks over the years but the Aussies have been the nemesis for the women-in-blue.There will be a sharp eye on the Indian middle order that proved to be fragile and failed to complement the dashing top order in the Asia Cup.Australia, on the other hand, are playing without some of their key players from the CWG squad as Rachel Haynes retired from cricket and Meg Lanning has been on an indefinite break. The spinner in Alana King shall enjoy the Indian conditions, but probably not more than her Indian counterparts.Squads:India Women Squad: Smriti Mandhana, Shafali Verma, Sabbhineni Meghana, Harmanpreet Kaur(c), Jemimah Rodrigues, Deepti Sharma, Richa Ghosh(wk), Rajeshwari Gayakwad, Radha Yadav, Harleen Deol, Renuka Singh, Yastika Bhatia, Meghna Singh, Devika Vaidya, Anjali SarvaniAustralia Women Squad: Alyssa Healy(c/wk), Beth Mooney, Tahlia McGrath, Ellyse Perry, Ashleigh Gardner, Annabel Sutherland, Grace Harris, Nicola Carey, Alana King, Jess Jonassen, Megan Schutt, Darcie Brown, Heather Graham, Kim Garth, Phoebe LitchfieldRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-09 13:07:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-W-vs-Australia-W.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL: BCCI invites bids for Women's IPL media rights for 2023-2027","link":"https://www.indiatvnews.com/sports/cricket/ipl-bcci-invites-bid-for-women-s-ipl-media-rights-for-2023-2027-invitation-to-tender-for-media-rights-2022-12-09-829978","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) on Friday, invited bids for media rights of the Women’s Indian Premier League for a five-year period from 2023 to the year 2027.","content":null,"pubDate":"2022-12-09 13:05:06","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Abrar Ahmed picks seven wickets in Pakistan vs England 2nd Test","link":"https://www.firstpost.com/firstcricket/sports-news/watch-abrar-ahmed-picks-seven-wickets-in-pakistan-vs-england-2nd-test-11781971.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Abrar Ahmed picks seven wickets in Pakistan vs England 2nd Test","content":"Multan: Abrar Ahmed turned out to be the biggest surprise of Pakistan vs England 2nd Test as the unheralded spinner grabbed seven wickets to bundle out the visitors for a paltry total on the opening day of the match on Friday.The 24-year-old mystery spinner grabbed 7-114 and got plenty of help from the dry wicket at Multan Cricket Stadium to dismiss England for 281 inside the first two sessions.England got rid of both Pakistan openers — Imam-ul-Haq and Abdullah Shafique — early before captain Babar Azam’s unbeaten 61 carried the home team to 107-2 at stumps when bad light stopped play with 10 overs still remaining in the day.First wicket: Zak Crawley falls prey to a googlyWhat a ball to get your first Test wicket!Immediate impact by Abrar Ahmed #PAKvENG | #UKSePK pic.twitter.com/8tvnuGFzyo— Pakistan Cricket (@TheRealPCB) December 9, 2022Second wicket: Ben Duckett departs after a well-taken late reviewOnce again, it’s Abrar! ☝️Brilliant review.#PAKvENG | #UKSePK pic.twitter.com/KgGaB3kt3K— Pakistan Cricket (@TheRealPCB) December 9, 2022Third wicket: An uplayable delivery for Joe RootMore magic from AbrarAnother superb review #PAKvENG | #UKSePK pic.twitter.com/jxlIjxIi4B— Pakistan Cricket (@TheRealPCB) December 9, 2022Fourth wicket: Ollie Pope fails to time reverse sweepAbrar Ahmed to Ollie Pope, THATS OUT!! Caught!! pic.twitter.com/vNPqPTDfnx— Roshan Abeysinghe (@RoshanCricket) December 9, 2022Fifth wicket: Maiden fifer with the scalp of Harry Brooks #PAKvENG | #UKSePK pic.twitter.com/l9LUdcLVgZ— Pakistan Cricket (@TheRealPCB) December 9, 2022Sixth wicket: Ben Stokes stunned by a googlyThis. Is. Special. #PAKvENG | #UKSePK pic.twitter.com/ExgHlMfrxY— Pakistan Cricket (@TheRealPCB) December 9, 2022Seventh wicket: Will Jacks caught plum lbw in front of the stumpsNo.7️⃣ for Abrar! #PAKvENG | #UKSePK pic.twitter.com/cmsq585Mus— Pakistan Cricket (@TheRealPCB) December 9, 2022Saud Shakeel, who scored a gritty half century in Pakistan’s 74-run defeat in the first test at Rawalpindi, was not out on 32.Ahmed was surprisingly left out from the first test despite picking up 43 wickets in this season’s first class tournament. He mystified England with his sharp googlies and carrom balls with only Ben Duckett (63) and Ollie Pope (60) scoring rapid half centuries.Legspinner Zahid Mahmood made a forgetful test debut at Rawalpindi, but finished off the tail just before tea to end up with 3-63 after Ahmed’s brilliance constantly posed challenges to England’s aggression.Duckett and Pope both scored half centuries in the first session before falling to Ahmed as the legspinner became only the second bowler in test history to pick up five wickets before lunch in his debut test and England reached 180-5.Leftarm spinner Alf Valentine of the West Indies was the other bowler to do so when he debuted against England at Manchester in 1950.Ahmed struck off his fifth ball as Babar turned to his mystery spinner as early as in the ninth over after Ben Stokes won the toss and elected to bat.Ahmed challenged England’s aggression through his variety of bowling on a wicket offering plenty of assistance to the spinners inside the first hour and wasn’t afraid to lure the England batters through his variations.Zak Crawley (19) was baffled by Ahmed’s sharp delivery which jagged back into him and knocked back his stumps and then the legspinner successfully won lbw decisions against Duckett and Joe Root (8) through television referrals.Duckett and Pope combined in a 79-run stand off 61 balls and briefly dominated even Ahmed through their extravagant reverse sweep shots before the bowler broke through soon after Duckett had completed his half century.Allrounder Faheem Ashraf and Ahmed were two of the three changes Pakistan had to make after fast bowlers Haris Rauf and Naseem Shah both were ruled out with injuries, and the home team also dropped experienced No. 3 batter Azhar Ali because of lack of form and brought in allrounder Mohammad Nawaz.England didn’t slow down and its fearless approach to score at a rapid pace cost them when Pope was caught at point while going for a reverse sweep and Harry Brook gave a skied shot to Nawaz at mid-off against Ahmed as England reached 180-5.Captain Stokes (30) and Will Jacks (31) added 61 runs but Ahmed continued to strike after lunch by removing both batters in his successive overs. Stokes was shocked by Ahmed’s sharp turner that hit the lefthander’s off stump and Jacks was trapped leg before wicket.Mark Wood, the only change England made to its playing XI, struck eight fours in his unbeaten 36 off 27 balls to underline England’s aggressive batting throughout the innings before Mahmood wrapped up England’s innings quickly.Wood, playing his first test since March, replaced allrounder Liam Livingstone who flew back home after injuring his knee during the first test.Veteran James Anderson struck early when he found the outside edge of Imam in his second over without scoring before wicketkeeper Pope held on to another thin edge of Shafique’s bat against Jack Leach when England successfully went for television referral.Leach couldn’t get much purchase of the wicket with the new ball after Stokes went to his spinners from the onset in the last session.Babar, who pushed himself at No. 3 after Azhar was dropped, was fluent against both spin and pace and completed his half century off 57 balls late in the last session before bad light brought an early closure.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-09 12:49:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Abrar-Ahmed-Pakistan-vs-England-2nd-test.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG 2nd Test, Day One: Abrar seven-for on debut, Pakistan 107/2 after England 281 all out","link":"https://sportstar.thehindu.com/cricket/pakistan-vs-england-2nd-test-multan-abrar-ahmed-seven-wickets-score-report-pak-v-eng/article66243259.ece","keywords":null,"creator":["\n         AP  \n    "],"video_url":null,"description":"Abrar Ahmed, the 24-year-old mystery spinner, grabbed 7-114 and got plenty of help from the dry wicket at Multan Cricket Stadium to dismiss England for 281 inside the first two sessions.","content":null,"pubDate":"2022-12-09 12:39:40","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Washington Sundar wants to be ready for all situations","link":"https://www.orissapost.com/washington-sundar-wants-to-be-ready-for-all-situations/","keywords":["Sports","all rounder","bangladesh","India","ipl","Washington Sundar","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Chattogram: He is not the quintessential power-hitter. But, keeping in mind the Indian team’s requirements ahead of next year’s World Cup, Washington Sundar is working ‘specifically’ on how to hit the ball long and hard. Washington Sundar is known to rely more on timing and placement. However, Washington has also played a few blinders, the […]","content":"Washington Sundar wants to be ready for all situations Agencies Updated: December 9th, 2022, 18:06 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Chattogram: He is not the quintessential power-hitter. But, keeping in mind the Indian team’s requirements ahead of next year’s World Cup, Washington Sundar is working ‘specifically’ on how to hit the ball long and hard. Washington Sundar is known to rely more on timing and placement. However, Washington has also played a few blinders, the most recent coming in the tour of New Zealand. And who can forget his 14-ball 40 against Rajasthan Royals in the IPL, representing Sunrisers Hyderabad (SRH). “That’s the role I have been getting in the last few years or so. That’s what that particular position demands, and I have working quite specifically that way. Whatever positions demand me to do, I have been practicing that way. I have been working in those specific manners,” Washington said on the eve of the third ODI against Bangladesh here. Washington is happy that his hard work is reaping dividends. “I am glad that all the hard work has been coming good in the last few months or so. Hopefully, I will continue to do really well in the coming months and years as well,” the all-rounder pointed out. Washington has picked up five wickets in the two preceding matches of the series which India have already lost. He is looking to be the player for all situations and positions. “It was a great opportunity for me in last game. With the World Cup next year, I want to be the player who could play in any situation, in any sort of combinations, and wherever the team need. To win games, wherever they ask me to play, I will play. That’s the kind of player I want to be,” asserted Washington. “I want to be able to contribute to my potential, contribute in a way that the team get to win most of the games. I just want to be in the present and keep doing well, keep getting better in every aspect of the game,” he added. India lost both their matches in Bangladesh from winning positions. They had the hosts at 136 for nine in a chase of 187 in the opener. In the second game they had reduced Bangladesh to 69 for six before letting them off the hook to make 271 for seven. “To be honest, we had our opportunities in both the games, First game, they needed about 50 runs to win with one wicket and we had a good opportunity. And even the last game, we had a good opportunity. However, we failed to win at the critical moments and that cost us the game,” lamented Washington. Washington however, was all praise for the Bangladesh side. “Bangladesh are a high-quality side, especially at home, I think they have lost only one series at home, to England. They had a good run in the T20 World Cup,” also. The struggling and depleted Indian team will be determined to avoid the ignominy of a clean sweep against Bangladesh in the final ODI of the three-match series here Saturday. “Every game is an opportunity for us to keep getting better, to get the right rhythm, and obviously, perform really well as a team. There is not going to be many games in the next 10 months or so, so every game is very important for us. We want to play a very good brand of cricket no matter who we are playing,” asserted Washington. Washington has battled a spate of injuries before forcing his way back into the Indian team. “Definitely it was quite disappointing with the few injuries that I have had in the past. I just want to live in the present, I am getting opportunities, really want to perform and win games for India consistently. In that manner things will be very bright for me and we as a team will also be very consistent,” he signed off. Tags: all rounder bangladesh India ipl Washington Sundar world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts BCCI invites bids for Women’s IPL media rights December 9, 2022 PT Usha to be officially elected as first woman president December 9, 2022 Tennis star Barty awarded Australian sport’s highest honour December 9, 2022 Kuldeep Yadav added to India squad for third ODI against Bangladesh; Rahul to captain in Rohit’s absence December 9, 2022 Call on Rohit’s availability for Test series to be taken later: Jay Shah December 9, 2022 Former coach Madan Lal lashes out at Indian team; says this December 9, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-12-09 12:36:54","image_url":"https://www.orissapost.com/wp-content/uploads/2022/12/Washington-Sundar-300x166.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 3rd ODI LIVE Streaming: When and where to watch IND vs BAN match live","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-3rd-odi-live-streaming-when-and-where-to-watch-ind-vs-ban-match-live-11781721.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh 3rd ODI LIVE Streaming: When and where to watch IND vs BAN match live","content":"Team India will hope to end the three-match series against Bangladesh on a high by collecting a consolation win in third ODI in Chattogram on Saturday.India have had a mixed run so far this year, with the performance graph showing a gradual decline in the second half. And the back-to-back defeats in the first two games of the ODI series in Bangladesh, both games going down to the very last ball, has further deepened the crisis that Indian cricket finds itself in at the moment.Skipper Rohit Sharma and coach Rahul Dravid will no doubt have to go back to the drawing board after the tour is complete. But for now, the visiting side will hope to get their planning and execution right in the third one-dayer in Chattogram, although Rohit will not be participating in that game due to a thumb injury, with vice-captain KL Rahul taking over the responsibility in his stead.Besides Rohit, seamers Kuldeep Sen and Deepak Chahar have also been ruled out with injuries, with the BCCI bringing left-arm wrist spinner Kuldeep Yadav into India’s revised squad for the third one-dayer.Ahead of final white-ball game of India’s tour of Bangladesh before the action shifts to the two-Test series, we bring to you live telecast and other details pertaining to the match:When will the 3rd ODI between India and Bangladesh take place?The 3rd ODI between India and Bangladesh will take place on Saturday, 10 December.Where will the 3rd ODI between India and Bangladesh be held?The 3rd ODI between India and Bangladesh will be held at Zahur Ahmed Chowdhury Stadium, Chattogram.What time will the 3rd ODI between India and Bangladesh begin?The 3rd ODI between India and Bangladesh will start at 11.30 am IST. Toss will take place half an hour before start of play.How can I watch the 3rd ODI between India and Bangladesh?The 3rd ODI between India and Bangladesh will be telecast live on the Sony Sports Network. You can also watch the match on the SonyLIV app, as well as follow the live scorecard and updates on Firstpost.com.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-09 12:34:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/KL-Rahul-India-Bangladesh-2nd-ODI-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Im interested to see Umran Malik play after Sachin in Indian team: Gavaskar","link":"https://thenewsglory.com/im-interested-to-see-umran-malik-play-after-sachin-in-indian-team-gavaskar/","keywords":["Sports","Cricket","game","Gavaskar","India","Sunil Gavaskar"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: Former India cricketer Sunil Gavaskar has said that he is keen to see Umran Malik play for India after Sachin Tendulkar. He played in the 1983 World Cup winning team. Gavaskar, 73, played international cricket from 1971 to 1987. He has scored 10,122 runs in 125 Tests and 3092 runs in 108 ODIs. Belongs […]","content":"Mumbai: Former India cricketer Sunil Gavaskar has said that he is keen to see Umran Malik play for India after Sachin Tendulkar. He played in the 1983 World Cup winning team. Gavaskar, 73, played international cricket from 1971 to 1987. He has scored 10,122 runs in 125 Tests and 3092 runs in 108 ODIs. Belongs to Mumbai. After retirement, he has been doing commentary on matches and writing about cricket. In this case, Gavaskar has said this about the young player who has been included in the Indian cricket team: “I am very excited to see the game of Umran Malik, the young fast bowler who will play for India after Sachin Tendulkar,” Gavaskar said on a private television. Umran Malik, 23, is a fast bowler from Jammu and Kashmir. He has the ability to bowl at lightning speed. He is identified with IPL cricket. So far he has played 7 international cricket matches. He plays for Sunrisers Hyderabad in IPL.","pubDate":"2022-12-09 12:34:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Sales of cricket book raises £3,500 for local children&#8217;s charity","link":"https://www.cricketireland.ie/news/article/sales-of-cricket-book-raises-3500-for-local-childrens-charity","keywords":null,"creator":null,"video_url":null,"description":"£3,500 has been raised for local children's charity, The NI Children to Lapland and Days to Remember Trust, thanks to the sales of a new cricketing book by historian of the sport, Clarence Hiles.","content":"‘Gone, But Not Forgotten’ tells the life stories of sixty trojans of cricket in Ulster, each of whom has contributed to the game across the past century and beyond through administration, advocacy, advancement or simply by great play. The book includes well-known legends like Roy Torrens, Donald Shearer, James Macdonald, Alfie Linehan, Raymond Hunter, alongside some less familiar names like Lexie Miller, AB Mitchell, William Doherty, Sam Clark whose impact is no less significant, just less documented. All proceeds from the book have been donated to the charity, which was established in 2008. It takes terminally ill, life limited and deserving children, from all over the Province, on a magical trip to meet Santa at his home in Lapland, a trip which creates very special memories for the children and their families. Chairman of the charity, Colin Barkley , said: “We never cease to be amazed at people’s generosity and Clarence’s gesture, in donating the entire proceeds of his book sales, is hugely appreciated. After a Covid enforced absence, we are delighted to be able to travel to Lapland this year, for the first time since 2019, on our own chartered 189 seat aircraft and this money will help to make the dreams of almost 100 very sick children come true.” Author of ‘Gone, But Not Forgotten’, Clarence Hiles , said: “I have always been passionate about remembering cricket legends, ensuring their impact on the game is never forgotten. This book is a homage to the sixty characters recognised, and I’m incredibly proud that the proceeds can benefit such a worthy charity.” Learn more about the charity here: https://nichildrentolapland.com/","pubDate":"2022-12-09 12:16:41","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"IND vs BAN: पूर्व भारतीय दिग्गज ने खिलाड़ियों को दिया सख्त संदेश, कहा - 'आराम चाहिए तो IPL से लें ब्रेक'","link":"https://www.abplive.com/sports/cricket/indian-cricket-team-take-rest-in-ipl-do-not-miss-any-odi-match-now-says-aakash-chopra-2278239","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Indian Cricket Team: पिछले कुछ समय से लगातार आईसीसी इवेंट्स में संघर्ष कर रही भारतीय टीम अगले साल होने वाले वनडे वर्ल्ड कप की तैयारी कर रही है. हालांकि, इस दौरान भारत अपनी बेस्ट टीम नहीं उतार पा रहा है क्योंकि कई स्टार खिलाड़ी चोटिल हैं. पिछले कुछ समय से लगातार यह भी देखने को मिला है कि खिलाड़ियों ने काफी ज्यादा ब्रेक लिए हैं और अब आकाश चोपड़ा ने उस पर ही सवाल उठाए हैं. चोपड़ा का मानना है कि जिसे भी ब्रेक लेना हो वो आईपीएल में ले और फिलहाल कोई भी वनडे मैच मिस मत करे. चोपड़ा ने कहा, \"यदि आप लगातार साथ में क्रिकेट नहीं खेलते हैं तो फिर आपकी अच्छी तैयारी पर सवाल खड़े होंगे. यदि ऑस्ट्रेलिया को देखें तो उन्होंने वर्ल्ड कप से पहले थकान की बात कही थी और पूरी टीम नहीं उतारी थी. वे सेमीफाइनल में भी नहीं जा सके थे. आईपीएल तक आपके पास 10 वनडे मैच हैं और भारत की बेस्ट टीम को ये मैच खेलने चाहिए. जो कोई भी फिट है उसे इन मैचों में हिस्सा लेना चाहिए. यदि हम वनडे वर्ल्ड कप के लिए गंभीर हैं तो जहां भी वनडे मैच हो रहे हैं पूरी टीम उतारिए.\" इस साल वनडे में अच्छा नहीं रहा है भारत का प्रदर्शन भारत ने इस साल कम ही वनडे मुकाबले खेले हैं और उनमें भी उनका प्रदर्शन कुछ खास नहीं रहा है. साल की शुरुआत में दक्षिण अफ्रीका में उन्हें तीन मैचों की सीरीज में क्लीन स्वीप झेलना पड़ा था. इंग्लैंड में खेली गई सीरीज में भारत ने 2-1 से जीत हासिल की थी. बांग्लादेश में चल रही वर्तमान सीरीज में भारतीय टीम 2-0 से पीछे चल रही है. यदि आखिरी मैच में भी भारत को हार मिली तो इस साल उन्हें दूसरी क्लीन स्वीप झेलनी पड़ेगी. यह भी पढ़ें: IND vs BAN Test Series: शमी-जडेजा की जगह भारत सौरभ-नवदीप को टेस्ट टीम में दे सकता है मौका, जानें कैसा रहा करियर","content":"Indian Cricket Team: पिछले कुछ समय से लगातार आईसीसी इवेंट्स में संघर्ष कर रही भारतीय टीम अगले साल होने वाले वनडे वर्ल्ड कप की तैयारी कर रही है. हालांकि, इस दौरान भारत अपनी बेस्ट टीम नहीं उतार पा रहा है क्योंकि कई स्टार खिलाड़ी चोटिल हैं. पिछले कुछ समय से लगातार यह भी देखने को मिला है कि खिलाड़ियों ने काफी ज्यादा ब्रेक लिए हैं और अब आकाश चोपड़ा ने उस पर ही सवाल उठाए हैं. चोपड़ा का मानना है कि जिसे भी ब्रेक लेना हो वो आईपीएल में ले और फिलहाल कोई भी वनडे मैच मिस मत करे. चोपड़ा ने कहा, \"यदि आप लगातार साथ में क्रिकेट नहीं खेलते हैं तो फिर आपकी अच्छी तैयारी पर सवाल खड़े होंगे. यदि ऑस्ट्रेलिया को देखें तो उन्होंने वर्ल्ड कप से पहले थकान की बात कही थी और पूरी टीम नहीं उतारी थी. वे सेमीफाइनल में भी नहीं जा सके थे. आईपीएल तक आपके पास 10 वनडे मैच हैं और भारत की बेस्ट टीम को ये मैच खेलने चाहिए. जो कोई भी फिट है उसे इन मैचों में हिस्सा लेना चाहिए. यदि हम वनडे वर्ल्ड कप के लिए गंभीर हैं तो जहां भी वनडे मैच हो रहे हैं पूरी टीम उतारिए.\" इस साल वनडे में अच्छा नहीं रहा है भारत का प्रदर्शन भारत ने इस साल कम ही वनडे मुकाबले खेले हैं और उनमें भी उनका प्रदर्शन कुछ खास नहीं रहा है. साल की शुरुआत में दक्षिण अफ्रीका में उन्हें तीन मैचों की सीरीज में क्लीन स्वीप झेलना पड़ा था. इंग्लैंड में खेली गई सीरीज में भारत ने 2-1 से जीत हासिल की थी. बांग्लादेश में चल रही वर्तमान सीरीज में भारतीय टीम 2-0 से पीछे चल रही है. यदि आखिरी मैच में भी भारत को हार मिली तो इस साल उन्हें दूसरी क्लीन स्वीप झेलनी पड़ेगी. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels यह भी पढ़ें: IND vs BAN Test Series: शमी-जडेजा की जगह भारत सौरभ-नवदीप को टेस्ट टीम में दे सकता है मौका, जानें कैसा रहा करियर var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-12-09 12:13:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/09/3ab8120318cb90b67692026aafeb155a1670583758613581_original.png","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"In a crazy world, Australia’s domination offers us all comfort","link":"https://www.watoday.com.au/sport/cricket/in-a-crazy-world-australia-s-domination-offers-us-all-comfort-20221209-p5c581.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Knox"],"video_url":null,"description":"Cricket is currently a blur of activity, just not on the Adelaide Oval. With all the cyclonic forces around it, the Test match itself rotated calmly toward a steady state of Australian control.","content":"There are a lot of interesting things happening in cricket at the moment, just not on the Adelaide Oval. Most significant is England’s endeavour in reinventing a 150-year-old wheel. They were at it again in Pakistan on Friday, lathering the boundaries while also losing wickets. Eventually, the whole “being unafraid to fail” philosophy of Baz-Ball will be tested by failure itself. Fear will make its comeback. But not just yet. In Brisbane, South Africa’s batters were ironing out the kinks before taking on Australia in a few days. Dean Elgar made a hundred. Elgar is one of the players who is going to answer the question whether Australia are that good or the West Indies are that bad. At least the Proteas are giving genuine fans something to look forward to. In India, the best two women’s teams in the world are squaring off in a series to start on Saturday. Healy, McGrath, Verma, Kaur, a lustrous line-up of superstars on both teams: there are no doubts that we are watching the best of the best here, and for a spectacle, the Adelaide Test match is going to have to plead with its viewers, like Larry Sanders: “No flipping.“ In Adelaide (around rather than on the Oval), things were also spicing up, with managers and administrators and commentators converging around the unhealed scab of 2018 newly peeled away by David Warner’s outburst on the eve of the Test match. It’s mostly happening in unphotogenic locations, but that doesn’t stop it making award-winning drama. Like Succession or The White Lotus , it is compelling because all the characters are, to greater or lesser degree, villainous. It’s just up to you to pick who you dislike least, and to take pleasure from watching the most venal squirm. Travis Head celebrates his 150 with Marnus Labuschagne at the Adelaide Oval on Friday. Credit: Getty Images Cricket Australia’s CEO Nick Hockley finally found something to take a firm principled stand against, but his adversary was only David Warner’s manager James Erskine, who revived old rumours and threw out some smelly old chum to attract the sharks (those sharks being us, the observers and the fans, who, in the never-ending sandpaper scandal, at least find something that gets our passions flowing again). It’s unclear whether all of these diversions were saving cricket from the event taking place on the Adelaide Oval, or unhelpfully getting in its way. From Jason Holder’s first trundlers, on a placid pitch in perfect Friday weather, to Australia’s steady assertion of dominance under lights, there was precious little theatre to match what was happening elsewhere.","pubDate":"2022-12-09 12:10:57","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ball-tampering approved by Cricket Australia officials before Cape Town scandal, claims Warner’s manager","link":"https://sportstar.thehindu.com/cricket/david-warner-manager-ball-tampering-scandal-sandpaper-gate-allegations-cricket-australia-involvement/article66243003.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"The players got the go ahead from “two executives” after losing a Test match to South Africa in late 2016 in Hobart, according to Erskine.","content":null,"pubDate":"2022-12-09 12:06:44","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia vs West Indies 2nd Test Day 2 at Adelaide: Windies four down, trail by 409 runs","link":"https://www.firstpost.com/firstcricket/sports-news/australia-vs-west-indies-2nd-test-day-2-at-adelaide-windies-four-down-trail-by-409-runs-11777591.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Australia vs West Indies 2nd Test Day 2 at Adelaide: Windies four down, trail by 409 runs","content":"Day 1 report: Marnus Labuschagne and Travis Head posted unbeaten centuries in a 199-run stand to lead Australia to 330-3 against West Indies at stumps on day one Thursday of the second cricket test.Labuschagne scored his third century in as many innings against West Indies and was 120 not out at Adelaide Oval.Head was 114 not out after making his first test century on his home ground in the day-night match.Both teams made injury-enforced changes following Australia’s 164-run win in the series-opener in Perth last weekend. Marquino Mindley, one of three changes for the depleted West Indies, left the field with a hamstring strain after bowling just two overs on debut.The Australians got on top early after stand-in captain Steve Smith won the toss and opted to bat first.Usman Khawaja shared a 34-run opening stand with David Warner (21) and 95 with Labuschagne for the second wicket before his dismissal for 62 triggered the only slight wobble in Australia’s innings.Part-time seamer Devon Thomas was the unlikely bowler to break the second-wicket stand, trapping Khawaja lbw from around the wicket on the first ball of the 42nd over.Khawaja, who surpassed 1,000 test runs in the calendar year when he reached 42, was given out and immediately reviewed the decision, but the third umpire confirmed the dismissal and Australia was 129-2.In the next over, former skipper Jason Holder took a return catch off his own bowling to dismiss Smith for a rare duck as Australia lost two wickets for two runs in 11 deliveries.But Labuschagne, the No. 1-ranked batter in test cricket, and Head counterattacked in quick time, restoring Australia’s dominance.Labuschagne cut Thomas to the point boundary to raise his 10th century in his 30th test, and third in succession in this series following his 204 and 104 not out in Perth. He’s just the 10th batter to post two triple-figure scores immediately after a double-century and only the second Australian.Head was next, reaching triple figures for the fifth time in a test with a driven boundary through mid-off, continuing his dominance through the off-side. His century came off 125 deliveries and contained 10 boundaries, and made up for the disappointment of being dismissed for 99 in Perth.“It was a long week — nice for the next one to get across the line,” he said. “Now I can forget about that.”Head said Labuschagne’s third consecutive triple-figure score was all the more impressive considering it was against the pink ball in a day-night test match.“A chanceless one as well, which was nice,” Head said. “He played beautifully. When you’re in the form that he is, to do what he’s done, he’s got a ridiculous amount of hundreds in the first innings as well to set games up.“We’ve started off very nicely.”West Indies skipper Kraigg Brathwaite cycled through seven bowlers in pursuit of a wicket on a pitch that favored the bat, with only Joseph (1-81), Holder (1-42) and Thomas (1-43) getting any rewards.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-09 12:04:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Australia-vs-West-Indies1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}