{"newsArray":[{"title":"Sakubva Stadium refurbishment begins","link":"https://www.manicapost.co.zw/sakubva-stadium-refurbishment-begins/","keywords":["Sports"],"creator":["Moffat Mungazi"],"video_url":null,"description":"  Ray Bande Senior Reporter   SAKUBVA Stadium could soon be hosting Premiership matches as Mutare businessman Isau Mupfumi has started refurbishment works at the match venue.   The project seeks to ensure that the facility satisfies the minimum standards acceptable for the return of top-flight league football to Mutare.   The prominent Mutare businessman […]","content":"The ManicaPost SAKUBVA Stadium could soon be hosting Premiership matches as Mutare businessman Isau Mupfumi has started refurbishment works at the match venue. The project seeks to ensure that the facility satisfies the minimum standards acceptable for the return of top-flight league football to Mutare. The prominent Mutare businessman engaged Mutare City Council management recently with the aim of helping out in the renovations of Sakubva Stadium. Works to renovate the turf, which was the main area of concern, begun this week, with Mupfumi acquiring pine bark and fertilisers to rejuvenate the playing surface as well as deploying and paying people carrying out the job. Mupfumi said: “Surely with good turf at Mutare Sports Club, at the cricket ground and also the Hillcrest sports fields as well as Africa University, as Manicaland we could engage the professionals who man these facilities to assist Mutare City Council. “The measures that I am undertaking are short term and meant to let the facility meet minimum acceptable standards that will allow people of Mutare to watch the beloved game. “Mutare as a city cannot afford to have no football matches at the venue; that is unacceptable to me. I know and I understand that football is the best supported sport in this country, hence as a community leader I felt I should play my part.” As the renovation works commence, the Mutare businessman is not resting on his laurels. Instead, he is making plans to urge local corporate community – the Zimbabwe Consolidated Diamond Company in particular – to make lasting refurbishments to the facility. “The sad thing about all this is that we have so many corporates in Manicaland who seem to invest their corporate social responsibility initiatives in other areas apart from what directly affects the community. “For example, the Zimbabwe Consolidated Diamond Company, which apparently owns a team in the Premiership, should really play a leading role in the construction of a world class stadium here in Mutare. “As a community leader, this is one issue I will work round the clock to see it happen. For now, we can only be content with renovations that will enable the return of Premiership action to Sakubva Stadium,” said Mupfumi. Sakubva Stadium was banned from hosting Castle Lager Premiership matches since the start of the season after the Mutare facility was sidelined on the list of match venues that are hosting top-flight league football. The only Premiership team in Mutare — Manica Diamonds — has been playing their home matches far away from home at Gibbo Stadium in Triangle. Maverick women football administrator, Cecilia Gambe, who is heavily involved in the logistical arrangements to see Mupfumi accomplish the short term renovations said: “We are thankful to Isau Mupfumi for his help. Very few, if any, among our businessmen and politicians find it worthwhile to assist the community like he is doing. “As a football personality, I will forever be grateful to him and I really hope and pray that at some point some corporates will see value in constructing a world class stadium in Mutare.” Staunch Liverpool and Dynamos supporter, Munyaradzi Zinomwe said: “The Sakubva stadium ban is a very painful situation for us the football- crazy Mutare soccer lovers. Our last hope is in Isau Mupfumi coming to aid in the refurbishment of the Sakubva Stadium turf. Driving past Sakubva Stadium every week stabs a sharp dagger in my heart. “Week Five of action is now beckoning without a slight hint of good news from Mutare City council. It is sad that our beloved Manica Diamonds have to drive every week to play away from home. It is time for us all the local football supporters in Manicaland to meet and contribute the little resources which can to aid our cause.","pubDate":"2023-04-13 22:05:42","image_url":null,"source_id":"manicapost","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"The ‘brilliance, dash’ of cricket pioneer Ollivierre","link":"https://www.manicapost.co.zw/the-brilliance-dash-of-cricket-pioneer-ollivierre/","keywords":["Sports"],"creator":["Moffat Mungazi"],"video_url":null,"description":"  “The gentleman stood up at the wicket as tall and straight as a poplar, and his fours were like the sabre cuts of a defiant soldier.” The year was 1904 and the man described in the Athletic News was Charles Ollivierre — the first black West Indian to play county cricket. He was like […]","content":"The ManicaPost “The gentleman stood up at the wicket as tall and straight as a poplar, and his fours were like the sabre cuts of a defiant soldier.” The year was 1904 and the man described in the Athletic News was Charles Ollivierre — the first black West Indian to play county cricket. He was like nothing the first-class game in England had seen. Ollivierre had made his County Championship debut for Derbyshire in 1902 and, two years later, a report carried in the Derby Daily Telegraph could only compare the seemingly outrageous entertainment he conjured with the bat — and recklessness in doing so – to one of the great playwrights of the time. “Ollivierre is the Bernard Shaw of the cricket world,” the piece stated. “The plain, common tack is beneath him, and when he cannot work his miracles he becomes indifferent.” While works of Pygmalion author Shaw have endured, the achievements and influence of Ollivierre have largely been consigned to history. This was a self-taught batter from a cricketing family who swapped the Caribbean island of St Vincent, where he was said to have learned to bat with “a branch of a coconut tree” and “a small bread fruit for a ball”, for the mountain ranges of Glossop in England’s north west. And it was there that he became a sporting pioneer. At the age of 24, he left the then British colony in 1900 as part of the first West Indies side to tour England, having become a father just two years earlier. And he was never to return, being offered a job as a clerk in a Peak District mill and an opportunity to qualify to play for Derbyshire — an undertaking that demanded two years’ full-time residency. Some of his descendants have only realised their links to Ollivierre in recent years, and say they are “immensely proud to have come from the lineage of a man who broke down significant barriers”. “He must have been a courageous man to actually get on that boat and go to a place that was cold,” his great, great grandson Marlon Bute, a business owner who lives in Canada, told BBC Sport. “And it’s in different ways that it would have been cold, not just where the weather is concerned. He was a young black man venturing to the motherland, so to speak, and that should indicate how much he really loved cricket and how much he was determined to follow his passion. “We understand what it is to want better, we understand the limitations of the circumstances that we were born into. “We do not see him as a father who abandoned anyone, I prefer to see him as someone who stepped out of the conditions that he was born in.” During a tour game for the West Indies against Lancashire in 1900, Ollivierre was lauded in the Manchester Courier for having “an extraordinary adaptability for the game”. He was seen as a man who “bats in a most attractive and really scientific manner”, with a lack of professional coaching meaning he “learned the most of his strokes from cricket booklore and diagrams”. In other media reports he was singled out as one of the best players for the tourists and, after top scoring with 159 in their win against Leicestershire, it was said his batting “would justify his inclusion in any first-class county”. Derbyshire were the ones to move for Ollivierre — who had previously played first-class cricket for Trinidad — and he was set up with a job that paid “£150 a year for the two years he is qualifying”, before increasing to £200 after that. It was a sizeable income at the time, with the average man in the UK earning less than £43 per year, according to the national archives. Derbyshire captain Samuel Hill-Wood – who would famously go on to become chairman of London football club Arsenal — was instrumental, giving Ollivierre a job at his cotton mill. He settled and worked in Glossop, and was the headline recruit for the town’s cricket side. His appearance for a Central Lancashire League game against Middleton in 1901 was said to have drawn “a good assembly”, with “curiosity being evident to see Ollivierre”. It was in Glossop last year that a blue plaque was unveiled at the club’s ground to commemorate the batter’s influence on English cricket at a time when it was almost exclusively played by white men. “He was tremendously influential because he got people used to the idea of black people playing cricket,” said Tony Wright, chair of the Glossop Heritage Trust. The colour of Ollivierre’s skin and his background was regularly mentioned in match reports. He was also compared a number of times to Kumar Shri Ranjitsinhji — better known simply as Ranji — an Indian prince who played for Sussex and commanded celebrity status for his performances with the bat. How a black West Indian player was received in rural Derbyshire more than 120 years ago is not clear, but Wright tells a story of Ollivierre and his brush with the famous Buffalo Bill — also known as William Cody — when he brought his Wild West show to Glossop. “Ollivierre had a team-mate called Alfred Charlesworth who was landlord of the Norfolk Arms, and he used to drink there,” Wright said. “Buffalo Bill went in for a drink and expressed concern about having to drink in the pub with a black man, so Charlesworth ordered Buffalo Bill out. It’s quite a well known local tale in Glossop. “It epitomises how Ollivierre was respected locally.” After two years of club cricket, his long-awaited first-class debut for Derbyshire in 1902 saw the Hull Daily Mail predict that Ollivierre would be “one of the sensations of the season”. “He is a player of brilliance and dash, and alone he should help mend ‘the fallen fortunes of the state’,” the piece concluded. He would go on to play a total of 110 matches for Derbyshire and score 4 670 runs, including three centuries and 24 half-centuries, in seven seasons. Ollivierre was also said to be an “excellent fielder” and took 109 catches for the county. It was one historic performance in 1904, scoring a career-high 229 against Essex at Chesterfield, that guaranteed his place in club and county cricket folklore. Percy Perrin, who would go on to be named Wisden Cricketer of the Year 12 months later, scored 343 as the visitors amassed a first-innings total of 597. Ollivierre led the reply with a double century and, after Essex were skittled for 97 in their second innings, the West Indian saw the hosts home to an unlikely nine-wicket victory with 92 not out. His 321 runs in a single game would stand as the most by any Derbyshire cricketer for 106 years, with Chris Rogers only breaking the record in 2010. For decades, Ollivierre’s performance and Derbyshire’s win continued to be recalled as “extraordinary” and “never-to-be-forgotten”. It was as a teenager that Derbyshire’s heritage officer David Griffin first came by Ollivierre, as he flicked through the club’s year book and statistical almanac. “We always knew of Ollivierre as a record breaker, if nothing else,” Griffin said. “Although he was a trailblazer in his own right, going back over 120 years, the trail stops because it wasn’t until much later that black cricketers were seen more often. “He was very much a one-off and unique at the time.” It took almost half a century before a black West Indian scored a century in county cricket after Ollivierre, with Derief Taylor doing so for Warwickshire in 1949 – the year that Ollivierre died. The next black West Indian to play for Derbyshire was Lawrence Rowe in 1974. An eye injury is said to have eventually ended Ollivierre’s career with Derbyshire in 1907, although a letter to the editor in the Sheffield Independent in 1909 said that “some have taken exception to his colour” when arguing that “the committee for some stupid reason will not play one of the finest bats in the country”. After his first-class career, he continued playing club cricket, first with Darley Dale then sides in Yorkshire. He even appeared for Pontefract at the age of 48 in 1924, by which time he was coaching schoolboys’ cricket in the Netherlands. He died in Pontefract, aged 72, having apparently never grown his family further when in England, and was buried at Fylingdales on the Yorkshire coast. Short obituaries ran in local newspapers and in Wisden, marking the passing of Derbyshire’s West Indian batter whose name and historical importance would fade from public consciousness over time. Garrey Dennie, an associate professor of history at St Mary’s College of Maryland and former speech writer for Nelson Mandela, is another of Ollivierre’s great, great grandchildren and sees interest in him as “a resurrection”. “When we speak of the Caribbean cricket history we look at the great Viv Richards, the Garry Sobers, the Clive Lloyds and all these wonderful players who we see as heroes,” Dennie said. “In fact there is a beginning point, there is a gateway. That gateway starts with Charles Ollivierre.” — BBCsport.","pubDate":"2023-04-13 22:01:11","image_url":null,"source_id":"manicapost","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"IPL 2023 Points Table: Here's how the points table looks after CSK vs RR match - Indiatimes.com","link":"https://news.google.com/rss/articles/CBMigwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjMtaGVyZXMtaG93LXRoZS1wb2ludHMtdGFibGUtbG9va3Mtc28tZmFyL2FydGljbGVzaG93Lzk5NDI1MDUwLmNtc9IBhwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjMtaGVyZXMtaG93LXRoZS1wb2ludHMtdGFibGUtbG9va3Mtc28tZmFyL2FtcF9hcnRpY2xlc2hvdy85OTQyNTA1MC5jbXM?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023 Points Table: Here's how the points table looks after CSK vs RR match  Indiatimes.comIPL 2023 Points Table, Orange Cap, Purple Cap Updated On 13th April After CSK Vs RR  ICC CRICKET SCHEDULEIPL 2023 Points Table After CSK vs RR: Rajasthan Back Top; Shikhar Dhawan Keeps Orange Cap, Yuzvendra Chaha  News18IPL Points Table: MI rise, DC slump; Warner challenges Dhawan for Orange Cap  Hindustan TimesTATA IPL Points Table Latest Updated | IPL 2023 Points Table After CSK Vs RR On April 13  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-04-13 15:38:58","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"PBKS vs GT Live Score, IPL 2023: Bhanuka Rajapaksa Departs For 20, PBKS Go 5 Down Against GT - NDTV Sports","link":"https://news.google.com/rss/articles/CBMiigFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9pcGwtMjAyMy1wYmtzLXZzLWd0LWxpdmUtc2NvcmUtdXBkYXRlcy1wdW5qYWIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtbGl2ZS1zY29yZS10b2RheS0xOHRoLW1hdGNoLTM5NDQ3OTHSAZABaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjMvaXBsLTIwMjMtcGJrcy12cy1ndC1saXZlLXNjb3JlLXVwZGF0ZXMtcHVuamFiLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLWxpdmUtc2NvcmUtdG9kYXktMTh0aC1tYXRjaC0zOTQ0NzkxL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs GT Live Score, IPL 2023: Bhanuka Rajapaksa Departs For 20, PBKS Go 5 Down Against GT  NDTV SportsPBKS vs GT Dream11 Prediction Today Match 18, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorLive Cricket Score - PBKS vs GT, Match 18, IPL 2023 | Cricbuzz.com - Cricbuzz  CricbuzzRest of the Batters Will Have to Score Runs: Aakash Chopra Feels Punjab Kings Are Overdependent on Shikhar  News18PBKS vs GT: Weather Report Live Today And Pitch Report Of IS Bindra Stadium in Mohali- IPL 2023, Match 18  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-04-13 15:38:19","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"HC notice to cricketer Prithvi Shaw on social media influencer’s plea against FIR","link":"https://indianexpress.com/article/sports/cricket/hc-notice-to-cricketer-prithvi-shaw-on-social-media-influencers-plea-against-fir-8555117/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-13 15:31:15","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: शुभमन गिल की फिफ्टी की बदौलत गुजरात टाइटंस ने पंजाब किंग्स को 6 विकेट से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-ipl-2023-gujarat-titans-won-the-toss-and-chose-bowling-news-hindi-1-554500-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"मोहाली में खेले गए आईपीएल 2023 के 18वें मुकाबले में गुजरात टाइटंस ने पंजाब किंग्स को...","content":"मोहाली में खेले गए आईपीएल 2023 के 18वें मुकाबले में गुजरात टाइटंस ने पंजाब किंग्स को 6 विकेट से हरा दिया। गुजरात की इस सीज़न में यह तीसरी जीत है। वहीं पंजाब किंग्स की दूसरी हार है। पंजाब ने पहले खेलने के बाद गुजरात के सामने 154 रनों का लक्ष्य रखा था, जिसे डिफेंडिंग चैंपियन ने सिर्फ चार विकेट खोकर हासिल कर लिया। गुजरात के लिए ओपनर शुभमन गिल ने मैच विनिंग पारी खेली। हालांकि, अंतिम ओवर में जब शुभमन गिल आउट हुए तो मैच बराबरी पर आ गया था, लेकिन जब दो गेंदों में चार रन चाहिए थे तो राहुल तेवतिया ने चौका लगाकर अपनी टीम को जीत दिलाई। इससे पहले मोहाली के PCA स्टेडियम में गुजरात टाइटंस ने टॉस जीतकर बॉलिंग चुनी। पंजाब किंग्स ने पहले बल्लेबाजी करते हुए 153 बनाए। पंजाब किंग्स ने गुजरात टाइटंस को 154 रनों का लक्ष्य दिया है। पंजाब के लिए सबसे ज्यादा 36 रन मैथ्यू शॉर्ट ने बनाए। उनके अलावा मध्यक्रम के बल्लेबाजों ने भी उपयोगी योगदान दिया। गुजरात के लिए मोहित शर्मा ने दो विकेट लिए। वहीं, अन्य सभी गेंदबाजों को एक-एक विकेट मिला। शिखर धवन, प्रभसिमरन सिंह, मैथ्यू शॉर्ट. जितेश शर्मा, भानुका राजपक्षा, शाहरुख खान, सैम करन, कैगिसो रबाडा, ऋषि धवन, हरप्रीत बरार, अर्शदीप सिंह इंपैक्ट प्लेयर सब राहुल चाहर, सिकंदर रजा, अथर्व ताइडे, गुरनुर बरार, हरप्रीत शुभमन गिल, ऋद्धिमान साहा, डेविड मिलर, साई सुदर्शन, राहुल तेवतिया, हार्दिक पांड्या, राशिद खान, जॉशुआ लिटिल, अल्जारी जोसफ, मोहित शर्मा, मोहम्मद शमी इंपैक्ट प्लेयर सब: विजय शंकर, अभिनव मनोहर, केएस भरत, शिवम मावी, जयंत यादव --आईएएनएस","pubDate":"2023-04-13 13:47:42","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Living in Pakistan was like living in jail, couldn’t go out as Babar Azam fans were waiting: New Zealand cricketer Simon Doull - OpIndia","link":"https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm9waW5kaWEuY29tLzIwMjMvMDQvc2ltb24tZG91bGwtbmV3LXplYWxhbmQtbWVudGFsLXRvcnR1cmUtcGFraXN0YW4v0gFUaHR0cHM6Ly93d3cub3BpbmRpYS5jb20vMjAyMy8wNC9zaW1vbi1kb3VsbC1uZXctemVhbGFuZC1tZW50YWwtdG9ydHVyZS1wYWtpc3Rhbi9hbXAv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Living in Pakistan was like living in jail, couldn’t go out as Babar Azam fans were waiting: New Zealand cricketer Simon Doull  OpIndiaSimon Doull reveals mental torture in Pakistan: Couldn't go out as Babar Azam fans were waiting for me  India Today“Living in Pakistan is like living in jail” – Simon Doull opens up on his ordeal after criticizing Babar Azam  SportskeedaLiving In Pakistan Is Like Living In Hell, I Stayed Without Food For Many Days: Simon Doull  Times NowIPL 2023: 'Living in Pakistan is like living in jail,' IPL commentator Simon Doull REVEALS ordeal in Pakistan after criticising Babar Azam, Check OUT  InsideSportView Full coverage on Google News","content":null,"pubDate":"2023-04-13 13:07:35","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ Match Prediction - Who will win today's 1st T20I match between Pakistan vs New Zealand? - CricTracker","link":"https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9wYWstdnMtbnotbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLTFzdC10MjBpLW1hdGNoLWJldHdlZW4tcGFraXN0YW4tdnMtbmV3LXplYWxhbmQv0gGaAWh0dHBzOi8vd3d3LmNyaWN0cmFja2VyLmNvbS9jcmlja2V0LW1hdGNoLXByZWRpY3Rpb25zL3Bhay12cy1uei1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtMXN0LXQyMGktbWF0Y2gtYmV0d2Vlbi1wYWtpc3Rhbi12cy1uZXctemVhbGFuZC8_YW1wPTE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ Match Prediction - Who will win today's 1st T20I match between Pakistan vs New Zealand?  CricTrackerFull-strength Pakistan to bring 'A game' against depleted New Zealand  Gulf NewsPAK vs NZ T20 Series LIVE Broadcast: WHEN & WHERE to watch Pakistan vs New Zealand T20 series LIVE Broadcast in India, Follow PAK vs NZ LIVE  InsideSportFocus on Babar as hosts look to tame NZ  The News InternationalPAK Vs NZ 1st T20I Dream11 Prediction, Playing XI, Pitch Report For 1st T20I  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-04-13 12:00:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score, IPL 2023: Shubman Gill-Sai Sudharsan take over after Saha is nabbed by Rabada","link":"https://indianexpress.com/article/sports/cricket/pbks-vs-gt-live-score-ipl-2023-punjab-kings-vs-gujarat-titans-latest-scorecard-updates-8554129/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-13 11:59:53","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"&#039;माही ऊपर आएगा तो मारेगा&#039;...धोनी के दोस्त की तरह दिग्गज खिलाड़ी का अनुमान! क्या प्ले ऑफ में दिखेगा बड़ा बदलाव?","link":"https://hindi.news18.com/news/sports/cricket-he-can-come-up-to-bat-in-play-offs-eoin-morgan-gave-advice-on-ms-dhoni-batting-order-after-rr-vs-csk-ipl-2023-5864689.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 में धोनी के फैंस उनकी बल्लेबाजी का लुत्फ उठाते नजर आ रहे हैं. धोनी की आतिशी बैटिंग देखने के बाद उनके बल्लेबाजी क्रम को लेकर ईयोन मॉर्गन ने अपने विचार साझा किए हैं. राजस्थान रॉयल्स के खिलाफ माही ने शानदार बल्लेबाजी की.","content":null,"pubDate":"2023-04-13 11:52:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/MS-Dhoni--16813867353x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sakubva Stadium refurbishment begins","link":"https://www.manicapost.co.zw/sakubva-stadium-refurbishment-begins/","keywords":["Sports"],"creator":["Moffat Mungazi"],"video_url":null,"description":"  Ray Bande Senior Reporter   SAKUBVA Stadium could soon be hosting Premiership matches as Mutare businessman Isau Mupfumi has started refurbishment works at the match venue.   The project seeks to ensure that the facility satisfies the minimum standards acceptable for the return of top-flight league football to Mutare.   The prominent Mutare businessman […]","content":"The ManicaPost SAKUBVA Stadium could soon be hosting Premiership matches as Mutare businessman Isau Mupfumi has started refurbishment works at the match venue. The project seeks to ensure that the facility satisfies the minimum standards acceptable for the return of top-flight league football to Mutare. The prominent Mutare businessman engaged Mutare City Council management recently with the aim of helping out in the renovations of Sakubva Stadium. Works to renovate the turf, which was the main area of concern, begun this week, with Mupfumi acquiring pine bark and fertilisers to rejuvenate the playing surface as well as deploying and paying people carrying out the job. Mupfumi said: “Surely with good turf at Mutare Sports Club, at the cricket ground and also the Hillcrest sports fields as well as Africa University, as Manicaland we could engage the professionals who man these facilities to assist Mutare City Council. “The measures that I am undertaking are short term and meant to let the facility meet minimum acceptable standards that will allow people of Mutare to watch the beloved game. “Mutare as a city cannot afford to have no football matches at the venue; that is unacceptable to me. I know and I understand that football is the best supported sport in this country, hence as a community leader I felt I should play my part.” As the renovation works commence, the Mutare businessman is not resting on his laurels. Instead, he is making plans to urge local corporate community – the Zimbabwe Consolidated Diamond Company in particular – to make lasting refurbishments to the facility. “The sad thing about all this is that we have so many corporates in Manicaland who seem to invest their corporate social responsibility initiatives in other areas apart from what directly affects the community. “For example, the Zimbabwe Consolidated Diamond Company, which apparently owns a team in the Premiership, should really play a leading role in the construction of a world class stadium here in Mutare. “As a community leader, this is one issue I will work round the clock to see it happen. For now, we can only be content with renovations that will enable the return of Premiership action to Sakubva Stadium,” said Mupfumi. Sakubva Stadium was banned from hosting Castle Lager Premiership matches since the start of the season after the Mutare facility was sidelined on the list of match venues that are hosting top-flight league football. The only Premiership team in Mutare — Manica Diamonds — has been playing their home matches far away from home at Gibbo Stadium in Triangle. Maverick women football administrator, Cecilia Gambe, who is heavily involved in the logistical arrangements to see Mupfumi accomplish the short term renovations said: “We are thankful to Isau Mupfumi for his help. Very few, if any, among our businessmen and politicians find it worthwhile to assist the community like he is doing. “As a football personality, I will forever be grateful to him and I really hope and pray that at some point some corporates will see value in constructing a world class stadium in Mutare.” Staunch Liverpool and Dynamos supporter, Munyaradzi Zinomwe said: “The Sakubva stadium ban is a very painful situation for us the football- crazy Mutare soccer lovers. Our last hope is in Isau Mupfumi coming to aid in the refurbishment of the Sakubva Stadium turf. Driving past Sakubva Stadium every week stabs a sharp dagger in my heart. “Week Five of action is now beckoning without a slight hint of good news from Mutare City council. It is sad that our beloved Manica Diamonds have to drive every week to play away from home. It is time for us all the local football supporters in Manicaland to meet and contribute the little resources which can to aid our cause.","pubDate":"2023-04-13 22:05:42","image_url":null,"source_id":"manicapost","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"The ‘brilliance, dash’ of cricket pioneer Ollivierre","link":"https://www.manicapost.co.zw/the-brilliance-dash-of-cricket-pioneer-ollivierre/","keywords":["Sports"],"creator":["Moffat Mungazi"],"video_url":null,"description":"  “The gentleman stood up at the wicket as tall and straight as a poplar, and his fours were like the sabre cuts of a defiant soldier.” The year was 1904 and the man described in the Athletic News was Charles Ollivierre — the first black West Indian to play county cricket. He was like […]","content":"The ManicaPost “The gentleman stood up at the wicket as tall and straight as a poplar, and his fours were like the sabre cuts of a defiant soldier.” The year was 1904 and the man described in the Athletic News was Charles Ollivierre — the first black West Indian to play county cricket. He was like nothing the first-class game in England had seen. Ollivierre had made his County Championship debut for Derbyshire in 1902 and, two years later, a report carried in the Derby Daily Telegraph could only compare the seemingly outrageous entertainment he conjured with the bat — and recklessness in doing so – to one of the great playwrights of the time. “Ollivierre is the Bernard Shaw of the cricket world,” the piece stated. “The plain, common tack is beneath him, and when he cannot work his miracles he becomes indifferent.” While works of Pygmalion author Shaw have endured, the achievements and influence of Ollivierre have largely been consigned to history. This was a self-taught batter from a cricketing family who swapped the Caribbean island of St Vincent, where he was said to have learned to bat with “a branch of a coconut tree” and “a small bread fruit for a ball”, for the mountain ranges of Glossop in England’s north west. And it was there that he became a sporting pioneer. At the age of 24, he left the then British colony in 1900 as part of the first West Indies side to tour England, having become a father just two years earlier. And he was never to return, being offered a job as a clerk in a Peak District mill and an opportunity to qualify to play for Derbyshire — an undertaking that demanded two years’ full-time residency. Some of his descendants have only realised their links to Ollivierre in recent years, and say they are “immensely proud to have come from the lineage of a man who broke down significant barriers”. “He must have been a courageous man to actually get on that boat and go to a place that was cold,” his great, great grandson Marlon Bute, a business owner who lives in Canada, told BBC Sport. “And it’s in different ways that it would have been cold, not just where the weather is concerned. He was a young black man venturing to the motherland, so to speak, and that should indicate how much he really loved cricket and how much he was determined to follow his passion. “We understand what it is to want better, we understand the limitations of the circumstances that we were born into. “We do not see him as a father who abandoned anyone, I prefer to see him as someone who stepped out of the conditions that he was born in.” During a tour game for the West Indies against Lancashire in 1900, Ollivierre was lauded in the Manchester Courier for having “an extraordinary adaptability for the game”. He was seen as a man who “bats in a most attractive and really scientific manner”, with a lack of professional coaching meaning he “learned the most of his strokes from cricket booklore and diagrams”. In other media reports he was singled out as one of the best players for the tourists and, after top scoring with 159 in their win against Leicestershire, it was said his batting “would justify his inclusion in any first-class county”. Derbyshire were the ones to move for Ollivierre — who had previously played first-class cricket for Trinidad — and he was set up with a job that paid “£150 a year for the two years he is qualifying”, before increasing to £200 after that. It was a sizeable income at the time, with the average man in the UK earning less than £43 per year, according to the national archives. Derbyshire captain Samuel Hill-Wood – who would famously go on to become chairman of London football club Arsenal — was instrumental, giving Ollivierre a job at his cotton mill. He settled and worked in Glossop, and was the headline recruit for the town’s cricket side. His appearance for a Central Lancashire League game against Middleton in 1901 was said to have drawn “a good assembly”, with “curiosity being evident to see Ollivierre”. It was in Glossop last year that a blue plaque was unveiled at the club’s ground to commemorate the batter’s influence on English cricket at a time when it was almost exclusively played by white men. “He was tremendously influential because he got people used to the idea of black people playing cricket,” said Tony Wright, chair of the Glossop Heritage Trust. The colour of Ollivierre’s skin and his background was regularly mentioned in match reports. He was also compared a number of times to Kumar Shri Ranjitsinhji — better known simply as Ranji — an Indian prince who played for Sussex and commanded celebrity status for his performances with the bat. How a black West Indian player was received in rural Derbyshire more than 120 years ago is not clear, but Wright tells a story of Ollivierre and his brush with the famous Buffalo Bill — also known as William Cody — when he brought his Wild West show to Glossop. “Ollivierre had a team-mate called Alfred Charlesworth who was landlord of the Norfolk Arms, and he used to drink there,” Wright said. “Buffalo Bill went in for a drink and expressed concern about having to drink in the pub with a black man, so Charlesworth ordered Buffalo Bill out. It’s quite a well known local tale in Glossop. “It epitomises how Ollivierre was respected locally.” After two years of club cricket, his long-awaited first-class debut for Derbyshire in 1902 saw the Hull Daily Mail predict that Ollivierre would be “one of the sensations of the season”. “He is a player of brilliance and dash, and alone he should help mend ‘the fallen fortunes of the state’,” the piece concluded. He would go on to play a total of 110 matches for Derbyshire and score 4 670 runs, including three centuries and 24 half-centuries, in seven seasons. Ollivierre was also said to be an “excellent fielder” and took 109 catches for the county. It was one historic performance in 1904, scoring a career-high 229 against Essex at Chesterfield, that guaranteed his place in club and county cricket folklore. Percy Perrin, who would go on to be named Wisden Cricketer of the Year 12 months later, scored 343 as the visitors amassed a first-innings total of 597. Ollivierre led the reply with a double century and, after Essex were skittled for 97 in their second innings, the West Indian saw the hosts home to an unlikely nine-wicket victory with 92 not out. His 321 runs in a single game would stand as the most by any Derbyshire cricketer for 106 years, with Chris Rogers only breaking the record in 2010. For decades, Ollivierre’s performance and Derbyshire’s win continued to be recalled as “extraordinary” and “never-to-be-forgotten”. It was as a teenager that Derbyshire’s heritage officer David Griffin first came by Ollivierre, as he flicked through the club’s year book and statistical almanac. “We always knew of Ollivierre as a record breaker, if nothing else,” Griffin said. “Although he was a trailblazer in his own right, going back over 120 years, the trail stops because it wasn’t until much later that black cricketers were seen more often. “He was very much a one-off and unique at the time.” It took almost half a century before a black West Indian scored a century in county cricket after Ollivierre, with Derief Taylor doing so for Warwickshire in 1949 – the year that Ollivierre died. The next black West Indian to play for Derbyshire was Lawrence Rowe in 1974. An eye injury is said to have eventually ended Ollivierre’s career with Derbyshire in 1907, although a letter to the editor in the Sheffield Independent in 1909 said that “some have taken exception to his colour” when arguing that “the committee for some stupid reason will not play one of the finest bats in the country”. After his first-class career, he continued playing club cricket, first with Darley Dale then sides in Yorkshire. He even appeared for Pontefract at the age of 48 in 1924, by which time he was coaching schoolboys’ cricket in the Netherlands. He died in Pontefract, aged 72, having apparently never grown his family further when in England, and was buried at Fylingdales on the Yorkshire coast. Short obituaries ran in local newspapers and in Wisden, marking the passing of Derbyshire’s West Indian batter whose name and historical importance would fade from public consciousness over time. Garrey Dennie, an associate professor of history at St Mary’s College of Maryland and former speech writer for Nelson Mandela, is another of Ollivierre’s great, great grandchildren and sees interest in him as “a resurrection”. “When we speak of the Caribbean cricket history we look at the great Viv Richards, the Garry Sobers, the Clive Lloyds and all these wonderful players who we see as heroes,” Dennie said. “In fact there is a beginning point, there is a gateway. That gateway starts with Charles Ollivierre.” — BBCsport.","pubDate":"2023-04-13 22:01:11","image_url":null,"source_id":"manicapost","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"IPL 2023 Points Table: Here's how the points table looks after CSK vs RR match - Indiatimes.com","link":"https://news.google.com/rss/articles/CBMigwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjMtaGVyZXMtaG93LXRoZS1wb2ludHMtdGFibGUtbG9va3Mtc28tZmFyL2FydGljbGVzaG93Lzk5NDI1MDUwLmNtc9IBhwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjMtaGVyZXMtaG93LXRoZS1wb2ludHMtdGFibGUtbG9va3Mtc28tZmFyL2FtcF9hcnRpY2xlc2hvdy85OTQyNTA1MC5jbXM?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023 Points Table: Here's how the points table looks after CSK vs RR match  Indiatimes.comIPL 2023 Points Table, Orange Cap, Purple Cap Updated On 13th April After CSK Vs RR  ICC CRICKET SCHEDULEIPL 2023 Points Table After CSK vs RR: Rajasthan Back Top; Shikhar Dhawan Keeps Orange Cap, Yuzvendra Chaha  News18IPL Points Table: MI rise, DC slump; Warner challenges Dhawan for Orange Cap  Hindustan TimesTATA IPL Points Table Latest Updated | IPL 2023 Points Table After CSK Vs RR On April 13  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-04-13 15:38:58","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"PBKS vs GT Live Score, IPL 2023: Bhanuka Rajapaksa Departs For 20, PBKS Go 5 Down Against GT - NDTV Sports","link":"https://news.google.com/rss/articles/CBMiigFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9pcGwtMjAyMy1wYmtzLXZzLWd0LWxpdmUtc2NvcmUtdXBkYXRlcy1wdW5qYWIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtbGl2ZS1zY29yZS10b2RheS0xOHRoLW1hdGNoLTM5NDQ3OTHSAZABaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjMvaXBsLTIwMjMtcGJrcy12cy1ndC1saXZlLXNjb3JlLXVwZGF0ZXMtcHVuamFiLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLWxpdmUtc2NvcmUtdG9kYXktMTh0aC1tYXRjaC0zOTQ0NzkxL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs GT Live Score, IPL 2023: Bhanuka Rajapaksa Departs For 20, PBKS Go 5 Down Against GT  NDTV SportsPBKS vs GT Dream11 Prediction Today Match 18, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorLive Cricket Score - PBKS vs GT, Match 18, IPL 2023 | Cricbuzz.com - Cricbuzz  CricbuzzRest of the Batters Will Have to Score Runs: Aakash Chopra Feels Punjab Kings Are Overdependent on Shikhar  News18PBKS vs GT: Weather Report Live Today And Pitch Report Of IS Bindra Stadium in Mohali- IPL 2023, Match 18  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-04-13 15:38:19","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"HC notice to cricketer Prithvi Shaw on social media influencer’s plea against FIR","link":"https://indianexpress.com/article/sports/cricket/hc-notice-to-cricketer-prithvi-shaw-on-social-media-influencers-plea-against-fir-8555117/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-13 15:31:15","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: शुभमन गिल की फिफ्टी की बदौलत गुजरात टाइटंस ने पंजाब किंग्स को 6 विकेट से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-ipl-2023-gujarat-titans-won-the-toss-and-chose-bowling-news-hindi-1-554500-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"मोहाली में खेले गए आईपीएल 2023 के 18वें मुकाबले में गुजरात टाइटंस ने पंजाब किंग्स को...","content":"मोहाली में खेले गए आईपीएल 2023 के 18वें मुकाबले में गुजरात टाइटंस ने पंजाब किंग्स को 6 विकेट से हरा दिया। गुजरात की इस सीज़न में यह तीसरी जीत है। वहीं पंजाब किंग्स की दूसरी हार है। पंजाब ने पहले खेलने के बाद गुजरात के सामने 154 रनों का लक्ष्य रखा था, जिसे डिफेंडिंग चैंपियन ने सिर्फ चार विकेट खोकर हासिल कर लिया। गुजरात के लिए ओपनर शुभमन गिल ने मैच विनिंग पारी खेली। हालांकि, अंतिम ओवर में जब शुभमन गिल आउट हुए तो मैच बराबरी पर आ गया था, लेकिन जब दो गेंदों में चार रन चाहिए थे तो राहुल तेवतिया ने चौका लगाकर अपनी टीम को जीत दिलाई। इससे पहले मोहाली के PCA स्टेडियम में गुजरात टाइटंस ने टॉस जीतकर बॉलिंग चुनी। पंजाब किंग्स ने पहले बल्लेबाजी करते हुए 153 बनाए। पंजाब किंग्स ने गुजरात टाइटंस को 154 रनों का लक्ष्य दिया है। पंजाब के लिए सबसे ज्यादा 36 रन मैथ्यू शॉर्ट ने बनाए। उनके अलावा मध्यक्रम के बल्लेबाजों ने भी उपयोगी योगदान दिया। गुजरात के लिए मोहित शर्मा ने दो विकेट लिए। वहीं, अन्य सभी गेंदबाजों को एक-एक विकेट मिला। शिखर धवन, प्रभसिमरन सिंह, मैथ्यू शॉर्ट. जितेश शर्मा, भानुका राजपक्षा, शाहरुख खान, सैम करन, कैगिसो रबाडा, ऋषि धवन, हरप्रीत बरार, अर्शदीप सिंह इंपैक्ट प्लेयर सब राहुल चाहर, सिकंदर रजा, अथर्व ताइडे, गुरनुर बरार, हरप्रीत शुभमन गिल, ऋद्धिमान साहा, डेविड मिलर, साई सुदर्शन, राहुल तेवतिया, हार्दिक पांड्या, राशिद खान, जॉशुआ लिटिल, अल्जारी जोसफ, मोहित शर्मा, मोहम्मद शमी इंपैक्ट प्लेयर सब: विजय शंकर, अभिनव मनोहर, केएस भरत, शिवम मावी, जयंत यादव --आईएएनएस","pubDate":"2023-04-13 13:47:42","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Living in Pakistan was like living in jail, couldn’t go out as Babar Azam fans were waiting: New Zealand cricketer Simon Doull - OpIndia","link":"https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm9waW5kaWEuY29tLzIwMjMvMDQvc2ltb24tZG91bGwtbmV3LXplYWxhbmQtbWVudGFsLXRvcnR1cmUtcGFraXN0YW4v0gFUaHR0cHM6Ly93d3cub3BpbmRpYS5jb20vMjAyMy8wNC9zaW1vbi1kb3VsbC1uZXctemVhbGFuZC1tZW50YWwtdG9ydHVyZS1wYWtpc3Rhbi9hbXAv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Living in Pakistan was like living in jail, couldn’t go out as Babar Azam fans were waiting: New Zealand cricketer Simon Doull  OpIndiaSimon Doull reveals mental torture in Pakistan: Couldn't go out as Babar Azam fans were waiting for me  India Today“Living in Pakistan is like living in jail” – Simon Doull opens up on his ordeal after criticizing Babar Azam  SportskeedaLiving In Pakistan Is Like Living In Hell, I Stayed Without Food For Many Days: Simon Doull  Times NowIPL 2023: 'Living in Pakistan is like living in jail,' IPL commentator Simon Doull REVEALS ordeal in Pakistan after criticising Babar Azam, Check OUT  InsideSportView Full coverage on Google News","content":null,"pubDate":"2023-04-13 13:07:35","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ Match Prediction - Who will win today's 1st T20I match between Pakistan vs New Zealand? - CricTracker","link":"https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9wYWstdnMtbnotbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLTFzdC10MjBpLW1hdGNoLWJldHdlZW4tcGFraXN0YW4tdnMtbmV3LXplYWxhbmQv0gGaAWh0dHBzOi8vd3d3LmNyaWN0cmFja2VyLmNvbS9jcmlja2V0LW1hdGNoLXByZWRpY3Rpb25zL3Bhay12cy1uei1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtMXN0LXQyMGktbWF0Y2gtYmV0d2Vlbi1wYWtpc3Rhbi12cy1uZXctemVhbGFuZC8_YW1wPTE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ Match Prediction - Who will win today's 1st T20I match between Pakistan vs New Zealand?  CricTrackerFull-strength Pakistan to bring 'A game' against depleted New Zealand  Gulf NewsPAK vs NZ T20 Series LIVE Broadcast: WHEN & WHERE to watch Pakistan vs New Zealand T20 series LIVE Broadcast in India, Follow PAK vs NZ LIVE  InsideSportFocus on Babar as hosts look to tame NZ  The News InternationalPAK Vs NZ 1st T20I Dream11 Prediction, Playing XI, Pitch Report For 1st T20I  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-04-13 12:00:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score, IPL 2023: Shubman Gill-Sai Sudharsan take over after Saha is nabbed by Rabada","link":"https://indianexpress.com/article/sports/cricket/pbks-vs-gt-live-score-ipl-2023-punjab-kings-vs-gujarat-titans-latest-scorecard-updates-8554129/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-13 11:59:53","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"&#039;माही ऊपर आएगा तो मारेगा&#039;...धोनी के दोस्त की तरह दिग्गज खिलाड़ी का अनुमान! क्या प्ले ऑफ में दिखेगा बड़ा बदलाव?","link":"https://hindi.news18.com/news/sports/cricket-he-can-come-up-to-bat-in-play-offs-eoin-morgan-gave-advice-on-ms-dhoni-batting-order-after-rr-vs-csk-ipl-2023-5864689.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 में धोनी के फैंस उनकी बल्लेबाजी का लुत्फ उठाते नजर आ रहे हैं. धोनी की आतिशी बैटिंग देखने के बाद उनके बल्लेबाजी क्रम को लेकर ईयोन मॉर्गन ने अपने विचार साझा किए हैं. राजस्थान रॉयल्स के खिलाफ माही ने शानदार बल्लेबाजी की.","content":null,"pubDate":"2023-04-13 11:52:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/MS-Dhoni--16813867353x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sakubva Stadium refurbishment begins","link":"https://www.manicapost.co.zw/sakubva-stadium-refurbishment-begins/","keywords":["Sports"],"creator":["Moffat Mungazi"],"video_url":null,"description":"  Ray Bande Senior Reporter   SAKUBVA Stadium could soon be hosting Premiership matches as Mutare businessman Isau Mupfumi has started refurbishment works at the match venue.   The project seeks to ensure that the facility satisfies the minimum standards acceptable for the return of top-flight league football to Mutare.   The prominent Mutare businessman […]","content":"The ManicaPost SAKUBVA Stadium could soon be hosting Premiership matches as Mutare businessman Isau Mupfumi has started refurbishment works at the match venue. The project seeks to ensure that the facility satisfies the minimum standards acceptable for the return of top-flight league football to Mutare. The prominent Mutare businessman engaged Mutare City Council management recently with the aim of helping out in the renovations of Sakubva Stadium. Works to renovate the turf, which was the main area of concern, begun this week, with Mupfumi acquiring pine bark and fertilisers to rejuvenate the playing surface as well as deploying and paying people carrying out the job. Mupfumi said: “Surely with good turf at Mutare Sports Club, at the cricket ground and also the Hillcrest sports fields as well as Africa University, as Manicaland we could engage the professionals who man these facilities to assist Mutare City Council. “The measures that I am undertaking are short term and meant to let the facility meet minimum acceptable standards that will allow people of Mutare to watch the beloved game. “Mutare as a city cannot afford to have no football matches at the venue; that is unacceptable to me. I know and I understand that football is the best supported sport in this country, hence as a community leader I felt I should play my part.” As the renovation works commence, the Mutare businessman is not resting on his laurels. Instead, he is making plans to urge local corporate community – the Zimbabwe Consolidated Diamond Company in particular – to make lasting refurbishments to the facility. “The sad thing about all this is that we have so many corporates in Manicaland who seem to invest their corporate social responsibility initiatives in other areas apart from what directly affects the community. “For example, the Zimbabwe Consolidated Diamond Company, which apparently owns a team in the Premiership, should really play a leading role in the construction of a world class stadium here in Mutare. “As a community leader, this is one issue I will work round the clock to see it happen. For now, we can only be content with renovations that will enable the return of Premiership action to Sakubva Stadium,” said Mupfumi. Sakubva Stadium was banned from hosting Castle Lager Premiership matches since the start of the season after the Mutare facility was sidelined on the list of match venues that are hosting top-flight league football. The only Premiership team in Mutare — Manica Diamonds — has been playing their home matches far away from home at Gibbo Stadium in Triangle. Maverick women football administrator, Cecilia Gambe, who is heavily involved in the logistical arrangements to see Mupfumi accomplish the short term renovations said: “We are thankful to Isau Mupfumi for his help. Very few, if any, among our businessmen and politicians find it worthwhile to assist the community like he is doing. “As a football personality, I will forever be grateful to him and I really hope and pray that at some point some corporates will see value in constructing a world class stadium in Mutare.” Staunch Liverpool and Dynamos supporter, Munyaradzi Zinomwe said: “The Sakubva stadium ban is a very painful situation for us the football- crazy Mutare soccer lovers. Our last hope is in Isau Mupfumi coming to aid in the refurbishment of the Sakubva Stadium turf. Driving past Sakubva Stadium every week stabs a sharp dagger in my heart. “Week Five of action is now beckoning without a slight hint of good news from Mutare City council. It is sad that our beloved Manica Diamonds have to drive every week to play away from home. It is time for us all the local football supporters in Manicaland to meet and contribute the little resources which can to aid our cause.","pubDate":"2023-04-13 22:05:42","image_url":null,"source_id":"manicapost","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"The ‘brilliance, dash’ of cricket pioneer Ollivierre","link":"https://www.manicapost.co.zw/the-brilliance-dash-of-cricket-pioneer-ollivierre/","keywords":["Sports"],"creator":["Moffat Mungazi"],"video_url":null,"description":"  “The gentleman stood up at the wicket as tall and straight as a poplar, and his fours were like the sabre cuts of a defiant soldier.” The year was 1904 and the man described in the Athletic News was Charles Ollivierre — the first black West Indian to play county cricket. He was like […]","content":"The ManicaPost “The gentleman stood up at the wicket as tall and straight as a poplar, and his fours were like the sabre cuts of a defiant soldier.” The year was 1904 and the man described in the Athletic News was Charles Ollivierre — the first black West Indian to play county cricket. He was like nothing the first-class game in England had seen. Ollivierre had made his County Championship debut for Derbyshire in 1902 and, two years later, a report carried in the Derby Daily Telegraph could only compare the seemingly outrageous entertainment he conjured with the bat — and recklessness in doing so – to one of the great playwrights of the time. “Ollivierre is the Bernard Shaw of the cricket world,” the piece stated. “The plain, common tack is beneath him, and when he cannot work his miracles he becomes indifferent.” While works of Pygmalion author Shaw have endured, the achievements and influence of Ollivierre have largely been consigned to history. This was a self-taught batter from a cricketing family who swapped the Caribbean island of St Vincent, where he was said to have learned to bat with “a branch of a coconut tree” and “a small bread fruit for a ball”, for the mountain ranges of Glossop in England’s north west. And it was there that he became a sporting pioneer. At the age of 24, he left the then British colony in 1900 as part of the first West Indies side to tour England, having become a father just two years earlier. And he was never to return, being offered a job as a clerk in a Peak District mill and an opportunity to qualify to play for Derbyshire — an undertaking that demanded two years’ full-time residency. Some of his descendants have only realised their links to Ollivierre in recent years, and say they are “immensely proud to have come from the lineage of a man who broke down significant barriers”. “He must have been a courageous man to actually get on that boat and go to a place that was cold,” his great, great grandson Marlon Bute, a business owner who lives in Canada, told BBC Sport. “And it’s in different ways that it would have been cold, not just where the weather is concerned. He was a young black man venturing to the motherland, so to speak, and that should indicate how much he really loved cricket and how much he was determined to follow his passion. “We understand what it is to want better, we understand the limitations of the circumstances that we were born into. “We do not see him as a father who abandoned anyone, I prefer to see him as someone who stepped out of the conditions that he was born in.” During a tour game for the West Indies against Lancashire in 1900, Ollivierre was lauded in the Manchester Courier for having “an extraordinary adaptability for the game”. He was seen as a man who “bats in a most attractive and really scientific manner”, with a lack of professional coaching meaning he “learned the most of his strokes from cricket booklore and diagrams”. In other media reports he was singled out as one of the best players for the tourists and, after top scoring with 159 in their win against Leicestershire, it was said his batting “would justify his inclusion in any first-class county”. Derbyshire were the ones to move for Ollivierre — who had previously played first-class cricket for Trinidad — and he was set up with a job that paid “£150 a year for the two years he is qualifying”, before increasing to £200 after that. It was a sizeable income at the time, with the average man in the UK earning less than £43 per year, according to the national archives. Derbyshire captain Samuel Hill-Wood – who would famously go on to become chairman of London football club Arsenal — was instrumental, giving Ollivierre a job at his cotton mill. He settled and worked in Glossop, and was the headline recruit for the town’s cricket side. His appearance for a Central Lancashire League game against Middleton in 1901 was said to have drawn “a good assembly”, with “curiosity being evident to see Ollivierre”. It was in Glossop last year that a blue plaque was unveiled at the club’s ground to commemorate the batter’s influence on English cricket at a time when it was almost exclusively played by white men. “He was tremendously influential because he got people used to the idea of black people playing cricket,” said Tony Wright, chair of the Glossop Heritage Trust. The colour of Ollivierre’s skin and his background was regularly mentioned in match reports. He was also compared a number of times to Kumar Shri Ranjitsinhji — better known simply as Ranji — an Indian prince who played for Sussex and commanded celebrity status for his performances with the bat. How a black West Indian player was received in rural Derbyshire more than 120 years ago is not clear, but Wright tells a story of Ollivierre and his brush with the famous Buffalo Bill — also known as William Cody — when he brought his Wild West show to Glossop. “Ollivierre had a team-mate called Alfred Charlesworth who was landlord of the Norfolk Arms, and he used to drink there,” Wright said. “Buffalo Bill went in for a drink and expressed concern about having to drink in the pub with a black man, so Charlesworth ordered Buffalo Bill out. It’s quite a well known local tale in Glossop. “It epitomises how Ollivierre was respected locally.” After two years of club cricket, his long-awaited first-class debut for Derbyshire in 1902 saw the Hull Daily Mail predict that Ollivierre would be “one of the sensations of the season”. “He is a player of brilliance and dash, and alone he should help mend ‘the fallen fortunes of the state’,” the piece concluded. He would go on to play a total of 110 matches for Derbyshire and score 4 670 runs, including three centuries and 24 half-centuries, in seven seasons. Ollivierre was also said to be an “excellent fielder” and took 109 catches for the county. It was one historic performance in 1904, scoring a career-high 229 against Essex at Chesterfield, that guaranteed his place in club and county cricket folklore. Percy Perrin, who would go on to be named Wisden Cricketer of the Year 12 months later, scored 343 as the visitors amassed a first-innings total of 597. Ollivierre led the reply with a double century and, after Essex were skittled for 97 in their second innings, the West Indian saw the hosts home to an unlikely nine-wicket victory with 92 not out. His 321 runs in a single game would stand as the most by any Derbyshire cricketer for 106 years, with Chris Rogers only breaking the record in 2010. For decades, Ollivierre’s performance and Derbyshire’s win continued to be recalled as “extraordinary” and “never-to-be-forgotten”. It was as a teenager that Derbyshire’s heritage officer David Griffin first came by Ollivierre, as he flicked through the club’s year book and statistical almanac. “We always knew of Ollivierre as a record breaker, if nothing else,” Griffin said. “Although he was a trailblazer in his own right, going back over 120 years, the trail stops because it wasn’t until much later that black cricketers were seen more often. “He was very much a one-off and unique at the time.” It took almost half a century before a black West Indian scored a century in county cricket after Ollivierre, with Derief Taylor doing so for Warwickshire in 1949 – the year that Ollivierre died. The next black West Indian to play for Derbyshire was Lawrence Rowe in 1974. An eye injury is said to have eventually ended Ollivierre’s career with Derbyshire in 1907, although a letter to the editor in the Sheffield Independent in 1909 said that “some have taken exception to his colour” when arguing that “the committee for some stupid reason will not play one of the finest bats in the country”. After his first-class career, he continued playing club cricket, first with Darley Dale then sides in Yorkshire. He even appeared for Pontefract at the age of 48 in 1924, by which time he was coaching schoolboys’ cricket in the Netherlands. He died in Pontefract, aged 72, having apparently never grown his family further when in England, and was buried at Fylingdales on the Yorkshire coast. Short obituaries ran in local newspapers and in Wisden, marking the passing of Derbyshire’s West Indian batter whose name and historical importance would fade from public consciousness over time. Garrey Dennie, an associate professor of history at St Mary’s College of Maryland and former speech writer for Nelson Mandela, is another of Ollivierre’s great, great grandchildren and sees interest in him as “a resurrection”. “When we speak of the Caribbean cricket history we look at the great Viv Richards, the Garry Sobers, the Clive Lloyds and all these wonderful players who we see as heroes,” Dennie said. “In fact there is a beginning point, there is a gateway. That gateway starts with Charles Ollivierre.” — BBCsport.","pubDate":"2023-04-13 22:01:11","image_url":null,"source_id":"manicapost","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"IPL 2023 Points Table: Here's how the points table looks after CSK vs RR match - Indiatimes.com","link":"https://news.google.com/rss/articles/CBMigwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjMtaGVyZXMtaG93LXRoZS1wb2ludHMtdGFibGUtbG9va3Mtc28tZmFyL2FydGljbGVzaG93Lzk5NDI1MDUwLmNtc9IBhwFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjMtaGVyZXMtaG93LXRoZS1wb2ludHMtdGFibGUtbG9va3Mtc28tZmFyL2FtcF9hcnRpY2xlc2hvdy85OTQyNTA1MC5jbXM?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023 Points Table: Here's how the points table looks after CSK vs RR match  Indiatimes.comIPL 2023 Points Table, Orange Cap, Purple Cap Updated On 13th April After CSK Vs RR  ICC CRICKET SCHEDULEIPL 2023 Points Table After CSK vs RR: Rajasthan Back Top; Shikhar Dhawan Keeps Orange Cap, Yuzvendra Chaha  News18IPL Points Table: MI rise, DC slump; Warner challenges Dhawan for Orange Cap  Hindustan TimesTATA IPL Points Table Latest Updated | IPL 2023 Points Table After CSK Vs RR On April 13  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-04-13 15:38:58","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"PBKS vs GT Live Score, IPL 2023: Bhanuka Rajapaksa Departs For 20, PBKS Go 5 Down Against GT - NDTV Sports","link":"https://news.google.com/rss/articles/CBMiigFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9pcGwtMjAyMy1wYmtzLXZzLWd0LWxpdmUtc2NvcmUtdXBkYXRlcy1wdW5qYWIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtbGl2ZS1zY29yZS10b2RheS0xOHRoLW1hdGNoLTM5NDQ3OTHSAZABaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjMvaXBsLTIwMjMtcGJrcy12cy1ndC1saXZlLXNjb3JlLXVwZGF0ZXMtcHVuamFiLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLWxpdmUtc2NvcmUtdG9kYXktMTh0aC1tYXRjaC0zOTQ0NzkxL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs GT Live Score, IPL 2023: Bhanuka Rajapaksa Departs For 20, PBKS Go 5 Down Against GT  NDTV SportsPBKS vs GT Dream11 Prediction Today Match 18, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorLive Cricket Score - PBKS vs GT, Match 18, IPL 2023 | Cricbuzz.com - Cricbuzz  CricbuzzRest of the Batters Will Have to Score Runs: Aakash Chopra Feels Punjab Kings Are Overdependent on Shikhar  News18PBKS vs GT: Weather Report Live Today And Pitch Report Of IS Bindra Stadium in Mohali- IPL 2023, Match 18  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-04-13 15:38:19","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"HC notice to cricketer Prithvi Shaw on social media influencer’s plea against FIR","link":"https://indianexpress.com/article/sports/cricket/hc-notice-to-cricketer-prithvi-shaw-on-social-media-influencers-plea-against-fir-8555117/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-13 15:31:15","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: शुभमन गिल की फिफ्टी की बदौलत गुजरात टाइटंस ने पंजाब किंग्स को 6 विकेट से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-ipl-2023-gujarat-titans-won-the-toss-and-chose-bowling-news-hindi-1-554500-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"मोहाली में खेले गए आईपीएल 2023 के 18वें मुकाबले में गुजरात टाइटंस ने पंजाब किंग्स को...","content":"मोहाली में खेले गए आईपीएल 2023 के 18वें मुकाबले में गुजरात टाइटंस ने पंजाब किंग्स को 6 विकेट से हरा दिया। गुजरात की इस सीज़न में यह तीसरी जीत है। वहीं पंजाब किंग्स की दूसरी हार है। पंजाब ने पहले खेलने के बाद गुजरात के सामने 154 रनों का लक्ष्य रखा था, जिसे डिफेंडिंग चैंपियन ने सिर्फ चार विकेट खोकर हासिल कर लिया। गुजरात के लिए ओपनर शुभमन गिल ने मैच विनिंग पारी खेली। हालांकि, अंतिम ओवर में जब शुभमन गिल आउट हुए तो मैच बराबरी पर आ गया था, लेकिन जब दो गेंदों में चार रन चाहिए थे तो राहुल तेवतिया ने चौका लगाकर अपनी टीम को जीत दिलाई। इससे पहले मोहाली के PCA स्टेडियम में गुजरात टाइटंस ने टॉस जीतकर बॉलिंग चुनी। पंजाब किंग्स ने पहले बल्लेबाजी करते हुए 153 बनाए। पंजाब किंग्स ने गुजरात टाइटंस को 154 रनों का लक्ष्य दिया है। पंजाब के लिए सबसे ज्यादा 36 रन मैथ्यू शॉर्ट ने बनाए। उनके अलावा मध्यक्रम के बल्लेबाजों ने भी उपयोगी योगदान दिया। गुजरात के लिए मोहित शर्मा ने दो विकेट लिए। वहीं, अन्य सभी गेंदबाजों को एक-एक विकेट मिला। शिखर धवन, प्रभसिमरन सिंह, मैथ्यू शॉर्ट. जितेश शर्मा, भानुका राजपक्षा, शाहरुख खान, सैम करन, कैगिसो रबाडा, ऋषि धवन, हरप्रीत बरार, अर्शदीप सिंह इंपैक्ट प्लेयर सब राहुल चाहर, सिकंदर रजा, अथर्व ताइडे, गुरनुर बरार, हरप्रीत शुभमन गिल, ऋद्धिमान साहा, डेविड मिलर, साई सुदर्शन, राहुल तेवतिया, हार्दिक पांड्या, राशिद खान, जॉशुआ लिटिल, अल्जारी जोसफ, मोहित शर्मा, मोहम्मद शमी इंपैक्ट प्लेयर सब: विजय शंकर, अभिनव मनोहर, केएस भरत, शिवम मावी, जयंत यादव --आईएएनएस","pubDate":"2023-04-13 13:47:42","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Living in Pakistan was like living in jail, couldn’t go out as Babar Azam fans were waiting: New Zealand cricketer Simon Doull - OpIndia","link":"https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm9waW5kaWEuY29tLzIwMjMvMDQvc2ltb24tZG91bGwtbmV3LXplYWxhbmQtbWVudGFsLXRvcnR1cmUtcGFraXN0YW4v0gFUaHR0cHM6Ly93d3cub3BpbmRpYS5jb20vMjAyMy8wNC9zaW1vbi1kb3VsbC1uZXctemVhbGFuZC1tZW50YWwtdG9ydHVyZS1wYWtpc3Rhbi9hbXAv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Living in Pakistan was like living in jail, couldn’t go out as Babar Azam fans were waiting: New Zealand cricketer Simon Doull  OpIndiaSimon Doull reveals mental torture in Pakistan: Couldn't go out as Babar Azam fans were waiting for me  India Today“Living in Pakistan is like living in jail” – Simon Doull opens up on his ordeal after criticizing Babar Azam  SportskeedaLiving In Pakistan Is Like Living In Hell, I Stayed Without Food For Many Days: Simon Doull  Times NowIPL 2023: 'Living in Pakistan is like living in jail,' IPL commentator Simon Doull REVEALS ordeal in Pakistan after criticising Babar Azam, Check OUT  InsideSportView Full coverage on Google News","content":null,"pubDate":"2023-04-13 13:07:35","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ Match Prediction - Who will win today's 1st T20I match between Pakistan vs New Zealand? - CricTracker","link":"https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9wYWstdnMtbnotbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLTFzdC10MjBpLW1hdGNoLWJldHdlZW4tcGFraXN0YW4tdnMtbmV3LXplYWxhbmQv0gGaAWh0dHBzOi8vd3d3LmNyaWN0cmFja2VyLmNvbS9jcmlja2V0LW1hdGNoLXByZWRpY3Rpb25zL3Bhay12cy1uei1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtMXN0LXQyMGktbWF0Y2gtYmV0d2Vlbi1wYWtpc3Rhbi12cy1uZXctemVhbGFuZC8_YW1wPTE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ Match Prediction - Who will win today's 1st T20I match between Pakistan vs New Zealand?  CricTrackerFull-strength Pakistan to bring 'A game' against depleted New Zealand  Gulf NewsPAK vs NZ T20 Series LIVE Broadcast: WHEN & WHERE to watch Pakistan vs New Zealand T20 series LIVE Broadcast in India, Follow PAK vs NZ LIVE  InsideSportFocus on Babar as hosts look to tame NZ  The News InternationalPAK Vs NZ 1st T20I Dream11 Prediction, Playing XI, Pitch Report For 1st T20I  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-04-13 12:00:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score, IPL 2023: Shubman Gill-Sai Sudharsan take over after Saha is nabbed by Rabada","link":"https://indianexpress.com/article/sports/cricket/pbks-vs-gt-live-score-ipl-2023-punjab-kings-vs-gujarat-titans-latest-scorecard-updates-8554129/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-13 11:59:53","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"&#039;माही ऊपर आएगा तो मारेगा&#039;...धोनी के दोस्त की तरह दिग्गज खिलाड़ी का अनुमान! क्या प्ले ऑफ में दिखेगा बड़ा बदलाव?","link":"https://hindi.news18.com/news/sports/cricket-he-can-come-up-to-bat-in-play-offs-eoin-morgan-gave-advice-on-ms-dhoni-batting-order-after-rr-vs-csk-ipl-2023-5864689.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 में धोनी के फैंस उनकी बल्लेबाजी का लुत्फ उठाते नजर आ रहे हैं. धोनी की आतिशी बैटिंग देखने के बाद उनके बल्लेबाजी क्रम को लेकर ईयोन मॉर्गन ने अपने विचार साझा किए हैं. राजस्थान रॉयल्स के खिलाफ माही ने शानदार बल्लेबाजी की.","content":null,"pubDate":"2023-04-13 11:52:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/MS-Dhoni--16813867353x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}