{"newsArray":[{"article_id":"ded7b3c331a6d20fed23f67b982f9f15","title":"IND vs SA 1st Test: टीम इंडिया के फैंस के लिए गुड न्यूज, टेस्ट मैच से पहले कोहली की हुई वापसी","link":"https://www.abplive.com/sports/cricket/ind-vs-sa-1st-test-virat-kohli-joins-team-india-before-test-match-against-south-africa-2568133","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"<p><strong>India vs South Africa 1st Test:</strong> भारत और दक्षिण अफ्रीका के बीच 26 दिसंबर से टेस्ट सीरीज का आगाज होगा. इसका पहला मैच सेंचुरियन में खेला जाएगा. विराट कोहली फैमिली इमरजेंसी की वजह से भारत लौट आए थे. लेकिन अब खबर आई है कि कोहली टीम इंडिया से जुड़ गए हैं. मीडिया रिपोर्ट्स के मुताबिक कोहली के जाने को लेकर भारतीय क्रिकेट कंट्रोल बोर्ड को पहले से ही जानकारी थी. हालांकि टीम के लिए अच्छी बात यह है कि उनकी वापसी हो चुकी है. कोहली सेंचुरियन में होने वाले मुकाबले में हिस्सा लेंगे.</p> <p>&nbsp;</p> <p>अपडेट जारी है...</p> <p><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/mitchell-starc-reveals-real-reason-behind-not-playing-ipl-since-2015-here-know-latest-sports-news-2568061\">Mitchell Starc: आईपीएल 2015 में आखिरी बार दिखे थे मिचेल स्टार्क, फिर 7 सीजन क्यों नहीं खेले? खुद बताई वजह</a></strong></p>","content":"India vs South Africa 1st Test: भारत और दक्षिण अफ्रीका के बीच 26 दिसंबर से टेस्ट सीरीज का आगाज होगा. इसका पहला मैच सेंचुरियन में खेला जाएगा. विराट कोहली फैमिली इमरजेंसी की वजह से भारत लौट आए थे. लेकिन अब खबर आई है कि कोहली टीम इंडिया से जुड़ गए हैं. मीडिया रिपोर्ट्स के मुताबिक कोहली के जाने को लेकर भारतीय क्रिकेट कंट्रोल बोर्ड को पहले से ही जानकारी थी. हालांकि टीम के लिए अच्छी बात यह है कि उनकी वापसी हो चुकी है. कोहली सेंचुरियन में होने वाले मुकाबले में हिस्सा लेंगे. न्यूज 18 की एक खबर के मुताबिक कोहली टीम इंडिया से जुड़ गए हैं. वे अचानक नहीं गए थे. बीसीसीआई को कोहली के जाने को लेकर पहले से जानकारी थी. अहम बात यह है कि कोहली फैमिली इमरजेंसी की वजह से नहीं गए थे. वे लंदन गए थे. उनके प्लान को लेकर बोर्ड को पूरी जानकारी थी. यह अचानक लिया गया फैसला नहीं था. कोहली जल्द ही टेस्ट मैच के लिए प्रैक्टिस शुरू करेंगे. अपडेट जारी है... googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); यह भी पढ़ें : Mitchell Starc: आईपीएल 2015 में आखिरी बार दिखे थे मिचेल स्टार्क, फिर 7 सीजन क्यों नहीं खेले? खुद बताई वजह","pubDate":"2023-12-24 02:10:33","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/83484918a8da61dc582bbdd5b768bf541703383816327344_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"271e22006f3eedd67fd9619ddaccd937","title":"Aussies eye Christmas miracle as one-off India Test comes down to thrilling finale: LIVE","link":"https://www.foxsports.com.au/cricket/australia/cricket-2023-australia-vs-india-womens-test-live-updates-aussies-eye-christmas-miracle-on-final-day/news-story/0af45ab332602daf9b9b1bb0820ec30d","keywords":null,"creator":null,"video_url":null,"description":"Australia will need something of a Christmas (Eve) miracle on the fourth and final day to claim victory in their one-off Test against India.","content":"Australia will need something of a Christmas (Eve) miracle on the fourth and final day to claim victory in their one-off Test against India. Australia enter the final day (3pm AEDT) with a 46-run lead, with the score 5-233 in Australia’s second innings. India piled on 406 runs (their highest total against Australia) to take a 187-run lead after the first innings, and Australia will need their lower order to fire – and then bowl out India quickly – to avoid a first-ever defeat to India. Watch India v Australia Women’s Series LIVE and exclusive to Fox Sports on Kayo. New to Kayo? Start Your Free Trial Today > McGrath leads huge day 3 showing | 03:05 DAY THREE REPORT: Horror brain fade as Australian fightback sets up thrilling final day Annabel Sutherland (12* off 67) and Ash Gardner (7*) will hope to survive against a rampant India bowling attack at Wankhede Stadium. Ellyse Perry told reporters on Saturday afternoon that staying “present” in the moment was key to Australia’s success. “We’ve just grown into this Test match a little bit and adjusted to the conditions as we’ve gone,” the all-rounder said. “Today, I think there was a really clear plan there – obviously with the position of the game, it was just for us to bat for as long as we possibly could, and just to play what was in front of us without too much of a mind on what’s going to happen down the track. “I think having that focus on the present was really helpful for all of us and I thought there were some really good patches and partnerships from us. “As individual batters within our group, we all play a little bit differently so all of us have a slightly different method, but the big message today was just to be really strong in our conviction to those methods.” Day four gets underway at 3pm AEDT. MATCH CENTRE: India vs Australia women’s Test scorecard LIVE LIVE BLOG Follow the action in our live blog below!","pubDate":"2023-12-24 01:56:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5284db45f8349b06308f22e0833ae913","title":"रोहित-विराट और कौन? जब साउथ अफ्रीका पर हुई थी डबल सेंचुरी की बारिश","link":"https://hindi.news18.com/cricket/ind-vs-sa-test-3-batsmen-including-rohit-sharma-and-virat-kohli-had-scored-double-centuries-against-south-africa-7926135.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA Test: टीम इंडिया टेस्ट सीरीज में साउथ अफ्रीका को उसके घर में टक्कर देने के लिए तैयार है. दोनों टीमें पहले टेस्ट में 26 दिसंबर को आमने-सामने होंगी. 4 साल पहले टीम इंडिया के 3 बल्लेबाजों ने इस टीम के खिलाफ रनों का अंबार खड़ा कर दिया था.","content":"साउथ अफ्रीका के खिलाफ भारत पहला टेस्ट 26 दिसंबर को खेलेगा. (AP) नई दिल्ली. रोहित शर्मा (Rohit Sharma), टीम इंडिया के वो बल्लेबाज जिनका दोहरे शतक से एक अलग रिश्ता है. वनडे क्रिकेट में रोहित सबसे ज्यादा दोहरे शतक लगाने वाले बल्लेबाज हैं. लेकिन कई बार टेस्ट में भी हिटमैन ने बल्ले से धमाल मचाया है. दूसरी ओर विराट भी इस टीम के खिलाफ बल्ले से हल्ला बोलते नजर आए थे. लेकिन इन दोनों के साथ मिलकर एक और बल्लेबाज था जिसने साउथ अफ्रीका के खिलाफ रनों का अंबार खड़ा कर दिया था. 4 साल पहले साउथ अफ्रीका की टीम भारत दौरे पर थी. भारत के खिलाफ मेहमान टीम को 3 टेस्ट की सीरीज खेलनी थी और टीम की कमान दिग्गज फाफ डु प्लेसी के हाथों में थी. वहीं, टीम इंडिया की कप्तान स्टार बल्लेबाज विराट कोहली संभाल रहे थे. इस सीरीज के पहले ही मुकाबले से भारतीय बल्लेबाजों ने रनों की बौछार कर दी. पहले टेस्ट की पहली पारी में सलामी बल्लेबाज मयंक अग्रवाल और रोहित शर्मा थे. एक तरफ मयंक अग्रवाल ने 215 रन ठोक डाले. दूसरी ओर हिटमैन भी डबल सेंचुरी की तरफ तेजी से बढ़ते नजर आ रहे थे. लेकिन बदकिस्मती से रोहित 176 रन पर अपना विकेट गंवा बैठे. जब दूसरी पारी आई तो मयंक का बल्ला खामोश रहा लेकिन रोहित नहीं रुके. हिटमैन ने 127 रन की ताबड़तोड़ पारी को अंजाम दिया. भारत ने पहली पारी में 523 जबकि दूसरी पारी में 323 रन ठोके, इन दमदार पारियों की बदौलत टीम इंडिया ने इस मैच को 203 रन से अपने नाम कर लिया था. दूसरे टेस्ट मयंक और कोहली ने बोला हल्ला मेहमान टीम के खिलाफ दूसरे टेस्ट में मयंक अग्रवाल का बल्ला फिर बोला. उन्होंने 108 रन की शानदार पारी खेली. चौथे नंबर पर आए कप्तान कोहली ने भी इस मैच में रनों की बौछार कर दी. उन्होंने 254 रन की पहाड़नुमा पारी खेली और टीम को 500 के पार पहुंचा दिया. इसके अलावा जडेजा ने भी बहती गंगा में हाथ धोए लेकिन शतक से महज 9 रन दूर रह गए. टीम इंडिया ने 601 रन का पहाड़ साउथ अफ्रीका के सामने रखा. दूसरी तरफ अफ्रीकी टीम दोनों पारियों में 275 और 189 रन पर ही सिमट गई. भारत ने इस मुकाबले को 137 रन से जीता. भारत को टेस्ट सीरीज नहीं जीतने देगा साउथ अफ्रीका, कोच ने दे डाली चेतावनी, सर्वश्रेष्ठ प्रदर्शन नहीं करने देंगे तीसरे टेस्ट में रोहित का कहर तीसरे और आखिरी टेस्ट में न तो मयंक चले और न कोहली. इस मैच में रोहित शर्मा अफ्रीकी टीम के सामने दीवार बन गए. हिटमैन ने महज 255 गेंद में 212 रन ठोक दिए. भारतीय टीम ने 497 रन का विशाल स्कोर बनाया, जिसमें अजिंक्य रहाणे के दमदार शतक ने भी अहम योगदान दिया. मेहमान टीम 162 और 133 रन पर दोनों पारियों में सिमट गई और भारत ने 202 रन से मैच जीतकर सीरीज अपने नाम की. . Tags: Ind vs sa , Mayank agarwal , Team india , Virat Kohli असल में ऐसा दिखता है सांता क्लॉज, AI ने दिखाया असली चेहरा, लोगों ने कहा-एनिमल का अबरार कभी गैराज में गुजारी थी रातें, काम के लिए एक्ट्रेस के घर के भी खाए थे धक्के, सुपरस्टार की भाई ने लगाई थी नैया पार मात्र 3000-4500 रुपए में लें जंगल सफारी सहित नेपाल के पर्यटन स्थलों का मजा, ऐसे बुक करें टिकट लाइव ब्लॉग 3 days ago 3 days ago 4 days ago 5 days ago","pubDate":"2023-12-24 01:52:13","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/virat-kohli-in-test-vs-wi-2023-12-920fb46b40309e579bbecd4b4124e523-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ff6346641fc165973071b2e759c8ce6d","title":"Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama","link":"https://www.dailymail.co.uk/sport/cricket/article-12897579/Marcus-Stoinis-controversial-act-Tom-Curran-BBL-drama-cricket.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Footage has emerged of Melbourne Stars captain Marcus Stoinis doing a similar run-through on the pitch to what sparked an incident recently with English cricketer Tom Curran.","content":"Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama Footage shows Stoinis performing run-through before match Players aren't allowed to run onto the pitch before a game Curran was suspended for charging at an umpire By James Cooney For Daily Mail Australia Published: 20:43 EST, 23 December 2023 | Updated: 20:45 EST, 23 December 2023 e-mail View comments Footage has emerged of Melbourne Stars captain Marcus Stoinis doing a similar run-through on the pitch to what sparked an incident recently with English cricketer Tom Curran. Curran was suspended for four Big Big League matches after vision emerged of him charging in toward an umpire at full stride before launching a verbal tirade prior to the match against the Hobart Hurricanes. The umpire instructed Curran to not run on the wicket during his warm up, in line with the laws of the game, and stood in his way to prevent him from running onto the pitch. While the vision clearly shows Curran running at the umpire, his skipper Henriques has gone in to bat for him and challenged the level three offence under the code of conduct for intimidating an umpire. The controversial incident took another twist when reporter Tom Decent posted video of Stoinis doing a similar pre-match run-through onto the pitch on December 13 - though not running at an umpire. The vision everyone's been waiting for. This is the series of events that's led to Tom Curran's four-game suspension... pic.twitter.com/CRcBujbIl0 — 7Cricket (@7Cricket) December 21, 2023 Not providing an opinion or condoning what Tom Curran did the other night. Just a clip to show that during this year’s Big Bash there have been instances of players doing run-throughs on the pitch before a game. Umpire was right there. Appeal will be interesting. pic.twitter.com/R9F6FDKaV7 — Tom Decent (@tomdecent) December 23, 2023 Stoinis, as the captain, is allowed by the rules of cricket to inspect the pitch before the match - but he isn't allowed to run onto it to practice a run-up. 'Not providing an opinion or condoning what Tom Curran did the other night,' wrote Decent. 'Just a clip to show that during this year's Big Bash there have been instances of players doing run-throughs on the pitch before a game. 'Umpire was right there. Appeal will be interesting.' Some cricket fans replied to Decent's post to point out that the English paceman had been suspended for intimidation of an official, while others questioned why Stoinis wasn't told to stop by the umpire. Curran's charges specifically cite 'intimidation or attempted intimidation of an Umpire, Match Referee, or Medical Personnel, whether by language or conduct (including gestures).' Curran was instructed not to enter the pitch, then went to the other end to complete another practice run-up. 'You can run here, but not here,' the umpire could be heard telling Curran, also using his arms to show where he can run. Stoinis was spotted doing a run-through onto the pitch pre-match, which isn't allowed Curran has been suspended for four Big Big League matches after vision emerged of him charging in toward an umpire at full stride before launching a verbal tirade Curran then attempted to perform a practice run-up and steamed in at pace straight towards the umpire, who stood in the bowling crease facing him. Making his actions even worse, Curran then turned to deliver a spray to the umpire. Channel Nine journalist Tom Morris revealed what he said on SEN: 'Word for word, Tom Curran to the fourth umpire after he ran past him: \"If you stand in the way I have nowhere go, you f***head.' Curran's actions in the video have been widely slammed by cricket fans, with many saying the penalty is too lenient and lashing the Sixers for appealing the four-match ban. Former Australian pace bowler Merv Hughes led the calls, posting: 'So they should appeal….. I don’t think the four game suspension is anywhere near harsh enough!!!! Should have got 10!!' 'Should be banned for the whole season,' one fan posted. 'For appealing it they should add 4 more games and the sixes to be deducted points, appealing means they condone this behavior,' added another. 'Send him home. Tear up his contract, don’t appeal the decision,' posted another. Melbourne Share or comment on this article: Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-24 01:45:48","image_url":"https://i.dailymail.co.uk/1s/2023/12/24/01/79296293-0-image-a-287_1703381926031.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ac989afac1d2e06ddd1e36dcb2c5ace3","title":"Indian Team: ਟੀਮ ਇੰਡੀਆ 'ਤੇ ਮੰਡਰਾ ਰਿਹਾ ਵੱਡਾ ਖਤਰਾ, ਇਨ੍ਹਾਂ ਖਿਡਾਰੀਆਂ ਦੀ ਗੈਰਮੌਜੂਦਗੀ ਵਿਗਾੜ ਸਕਦੀ ਖੇਡ","link":"https://punjabi.abplive.com/sports/cricket/indian-cricket-team-4-player-injured-before-t20-world-cup-2024-know-health-update-766706","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>Injured Indian Player Before T20 World Cup 2024:</strong> ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਨੇ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੇ ਗਏ ਇੱਕ ਰੋਜ਼ਾ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੇ ਫਾਈਨਲ ਵਿੱਚ ਆਸਟਰੇਲੀਆ ਤੋਂ ਹਾਰ ਗਈ ਸੀ। ਹੁਣ ਪ੍ਰਸ਼ੰਸਕ ਉਮੀਦ ਕਰ ਰਹੇ ਹਨ ਕਿ ਟੀਮ ਇੰਡੀਆ 2024 'ਚ ਹੋਣ ਵਾਲਾ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਜਿੱਤੇਗੀ। ਪਰ ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਭਾਰਤੀ ਟੀਮ ਦੇ 4 ਸਟਾਰ ਖਿਡਾਰੀ ਜ਼ਖਮੀ ਹੋ ਚੁੱਕੇ ਹਨ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੱਟ ਨੂੰ ਲੈ ਕੇ ਅਜੇ ਤੱਕ ਕੋਈ ਅਧਿਕਾਰਤ ਅਪਡੇਟ ਨਹੀਂ ਆਇਆ ਹੈ। ਜ਼ਖ਼ਮੀ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਵਿੱਚ ਮੁਹੰਮਦ ਸ਼ਮੀ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ, ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਅਤੇ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਸ਼ਾਮਲ ਹਨ।</p> <p><strong>1- ਹਾਰਦਿਕ ਪਾਂਡਿਆ</strong></p> <p>ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਦੇ ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ। ਹਾਰਦਿਕ ਨੂੰ ਟੂਰਨਾਮੈਂਟ 'ਚ ਬੰਗਲਾਦੇਸ਼ ਖਿਲਾਫ ਖੇਡੇ ਗਏ ਮੈਚ 'ਚ ਅੱਡੀ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਉਹ ਹੁਣ ਤੱਕ ਵਾਪਸੀ ਨਹੀਂ ਕਰ ਸਕੇ ਹਨ।</p> <p><strong>2- ਮੁਹੰਮਦ ਸ਼ਮੀ</strong></p> <p><br />ਹਾਲ ਹੀ 'ਚ ਭਾਰਤੀ ਧਰਤੀ 'ਤੇ ਖੇਡੇ ਗਏ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 'ਚ ਮੁਹੰਮਦ ਸ਼ਮੀ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ ਵਿਕਟਾਂ ਲੈਣ ਵਾਲੇ ਗੇਂਦਬਾਜ਼ ਸਨ। ਸ਼ਮੀ ਨੇ 7 ਮੈਚਾਂ 'ਚ 10.71 ਦੀ ਸ਼ਾਨਦਾਰ ਔਸਤ ਨਾਲ 24 ਵਿਕਟਾਂ ਲਈਆਂ। ਸ਼ਮੀ ਦੇ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਉਹ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੈਸਟ ਸੀਰੀਜ਼ ਤੋਂ ਬਾਹਰ ਹੋ ਗਿਆ ਸੀ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਸ਼ਮੀ ਨੂੰ ਟੈਸਟ ਟੀਮ 'ਚ ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ ਸੀ ਪਰ ਫਿਰ ਬੀਸੀਸੀਆਈ ਨੇ ਅਪਡੇਟ ਦਿੰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਸੱਟ ਕਾਰਨ ਉਹ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਹਿੱਸਾ ਨਹੀਂ ਹੋਣਗੇ।</p> <p><strong>3- ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ</strong></p> <p>ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਤੋਂ ਬਾਅਦ, ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਨੇ ਆਸਟ੍ਰੇਲੀਆ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੀ-20 ਸੀਰੀਜ਼ 'ਚ ਭਾਰਤ ਦੀ ਕਮਾਨ ਸੰਭਾਲੀ। ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਤੀਜੇ ਟੀ-20 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਨੂੰ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ। ਸੂਰਿਆ ਨੂੰ ਗਰੇਡ-2 ਦੀ ਸੱਟ ਲੱਗੀ ਹੈ। ਹਾਲਾਂਕਿ ਅਜੇ ਤੱਕ ਸੂਰਿਆ ਦੀ ਸੱਟ ਬਾਰੇ ਕੋਈ ਅਧਿਕਾਰਤ ਜਾਣਕਾਰੀ ਨਹੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ <a title=\"ਟੀਮ ਇੰਡੀਆ\" href=\"https://punjabi.abplive.com/topic/indian-cricket-team\" data-type=\"interlinkingkeywords\">ਟੀਮ ਇੰਡੀਆ</a> ਲਈ ਵੱਡੀ ਸਮੱਸਿਆ ਹੋ ਸਕਦੀ ਹੈ। ਸੂਰਿਆ ਭਾਰਤੀ ਟੀ-20 ਟੀਮ ਦਾ ਅਹਿਮ ਖਿਡਾਰੀ ਹੈ।</p> <p><strong>4- ਰੁਤੂਰਾਜ ਗਾਇਕਵਾੜ</strong></p> <p>ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੀ ਗਈ ਇੱਕ ਰੋਜ਼ਾ ਲੜੀ ਵਿੱਚ ਭਾਰਤੀ ਟੀਮ ਦਾ ਹਿੱਸਾ ਸੀ। ਸੀਰੀਜ਼ ਦੇ ਦੂਜੇ ਵਨਡੇ 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਦੇ ਸੱਜੇ ਹੱਥ ਦੀ ਮੁੰਦਰੀ 'ਚ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਗਾਇਕਵਾੜ ਬਾਕੀ ਦੇ ਅਫਰੀਕਾ ਦੌਰੇ ਤੋਂ ਬਾਹਰ ਹੋ ਗਏ ਹਨ।</p>","content":"Injured Indian Player Before T20 World Cup 2024: ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਨੇ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੇ ਗਏ ਇੱਕ ਰੋਜ਼ਾ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੇ ਫਾਈਨਲ ਵਿੱਚ ਆਸਟਰੇਲੀਆ ਤੋਂ ਹਾਰ ਗਈ ਸੀ। ਹੁਣ ਪ੍ਰਸ਼ੰਸਕ ਉਮੀਦ ਕਰ ਰਹੇ ਹਨ ਕਿ ਟੀਮ ਇੰਡੀਆ 2024 'ਚ ਹੋਣ ਵਾਲਾ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਜਿੱਤੇਗੀ। ਪਰ ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਭਾਰਤੀ ਟੀਮ ਦੇ 4 ਸਟਾਰ ਖਿਡਾਰੀ ਜ਼ਖਮੀ ਹੋ ਚੁੱਕੇ ਹਨ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੱਟ ਨੂੰ ਲੈ ਕੇ ਅਜੇ ਤੱਕ ਕੋਈ ਅਧਿਕਾਰਤ ਅਪਡੇਟ ਨਹੀਂ ਆਇਆ ਹੈ। ਜ਼ਖ਼ਮੀ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਵਿੱਚ ਮੁਹੰਮਦ ਸ਼ਮੀ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ, ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਅਤੇ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਸ਼ਾਮਲ ਹਨ। 1- ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਦੇ ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ। ਹਾਰਦਿਕ ਨੂੰ ਟੂਰਨਾਮੈਂਟ 'ਚ ਬੰਗਲਾਦੇਸ਼ ਖਿਲਾਫ ਖੇਡੇ ਗਏ ਮੈਚ 'ਚ ਅੱਡੀ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਉਹ ਹੁਣ ਤੱਕ ਵਾਪਸੀ ਨਹੀਂ ਕਰ ਸਕੇ ਹਨ। 2- ਮੁਹੰਮਦ ਸ਼ਮੀ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਹਾਲ ਹੀ 'ਚ ਭਾਰਤੀ ਧਰਤੀ 'ਤੇ ਖੇਡੇ ਗਏ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 'ਚ ਮੁਹੰਮਦ ਸ਼ਮੀ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ ਵਿਕਟਾਂ ਲੈਣ ਵਾਲੇ ਗੇਂਦਬਾਜ਼ ਸਨ। ਸ਼ਮੀ ਨੇ 7 ਮੈਚਾਂ 'ਚ 10.71 ਦੀ ਸ਼ਾਨਦਾਰ ਔਸਤ ਨਾਲ 24 ਵਿਕਟਾਂ ਲਈਆਂ। ਸ਼ਮੀ ਦੇ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਉਹ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੈਸਟ ਸੀਰੀਜ਼ ਤੋਂ ਬਾਹਰ ਹੋ ਗਿਆ ਸੀ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਸ਼ਮੀ ਨੂੰ ਟੈਸਟ ਟੀਮ 'ਚ ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ ਸੀ ਪਰ ਫਿਰ ਬੀਸੀਸੀਆਈ ਨੇ ਅਪਡੇਟ ਦਿੰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਸੱਟ ਕਾਰਨ ਉਹ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਹਿੱਸਾ ਨਹੀਂ ਹੋਣਗੇ। 3- ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਤੋਂ ਬਾਅਦ, ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਨੇ ਆਸਟ੍ਰੇਲੀਆ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੀ-20 ਸੀਰੀਜ਼ 'ਚ ਭਾਰਤ ਦੀ ਕਮਾਨ ਸੰਭਾਲੀ। ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਤੀਜੇ ਟੀ-20 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਨੂੰ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ। ਸੂਰਿਆ ਨੂੰ ਗਰੇਡ-2 ਦੀ ਸੱਟ ਲੱਗੀ ਹੈ। ਹਾਲਾਂਕਿ ਅਜੇ ਤੱਕ ਸੂਰਿਆ ਦੀ ਸੱਟ ਬਾਰੇ ਕੋਈ ਅਧਿਕਾਰਤ ਜਾਣਕਾਰੀ ਨਹੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਟੀਮ ਇੰਡੀਆ ਲਈ ਵੱਡੀ ਸਮੱਸਿਆ ਹੋ ਸਕਦੀ ਹੈ। ਸੂਰਿਆ ਭਾਰਤੀ ਟੀ-20 ਟੀਮ ਦਾ ਅਹਿਮ ਖਿਡਾਰੀ ਹੈ। 4- ਰੁਤੂਰਾਜ ਗਾਇਕਵਾੜ ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੀ ਗਈ ਇੱਕ ਰੋਜ਼ਾ ਲੜੀ ਵਿੱਚ ਭਾਰਤੀ ਟੀਮ ਦਾ ਹਿੱਸਾ ਸੀ। ਸੀਰੀਜ਼ ਦੇ ਦੂਜੇ ਵਨਡੇ 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਦੇ ਸੱਜੇ ਹੱਥ ਦੀ ਮੁੰਦਰੀ 'ਚ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਗਾਇਕਵਾੜ ਬਾਕੀ ਦੇ ਅਫਰੀਕਾ ਦੌਰੇ ਤੋਂ ਬਾਹਰ ਹੋ ਗਏ ਹਨ।","pubDate":"2023-12-24 01:41:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/35affca015e6ba31155cb01bbfff35ec1703382049987709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"603da2e57bac72a93e53dde76ad9c0a4","title":"LLC: ਲੀਜੈਂਡਜ਼ ਲੀਗ ਨੇ Viewership 'ਚ ਬਣਾਇਆ ਵੱਡਾ ਰਿਕਾਰਡ! ਵਿਸ਼ਵ ਭਰ ਵਿੱਚ ਬੈਠੇ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇੰਝ ਦਿੱਤਾ ਪਿਆਰ","link":"https://punjabi.abplive.com/sports/cricket/legends-league-cricket-is-live-viewership-landmark-of-300-million-globally-for-season-2-know-details-766705","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>Legends League Cricket Viewership:</strong> ਹਾਲ ਹੀ 'ਚ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦਾ ਦੂਜਾ ਸੀਜ਼ਨ ਖੇਡਿਆ ਗਿਆ। 22 ਦਿਨਾਂ ਤੱਕ ਚੱਲੇ ਇਸ ਟੂਰਨਾਮੈਂਟ ਵਿੱਚ 19 ਮੈਚ ਖੇਡੇ ਗਏ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਨੇ ਦਰਸ਼ਕਾਂ ਦੀ ਗਿਣਤੀ ਦਾ ਨਵਾਂ ਰਿਕਾਰਡ ਬਣਾਇਆ ਹੈ। ਦਰਅਸਲ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਸੀਜ਼ਨ-2 ਨੂੰ ਦੁਨੀਆ ਭਰ ਦੇ 30 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਨੇ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦੀ ਸਫਲਤਾ 'ਤੇ ਆਪਣੀ ਪ੍ਰਤੀਕਿਰਿਆ ਦਿੱਤੀ। ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਆਪਣੇ ਆਪ ਵਿੱਚ ਵਿਲੱਖਣ ਹੈ। ਇਸ ਦੇ ਤਹਿਤ ਪ੍ਰਸ਼ੰਸਕ ਰਾਸ਼ਟਰੀ ਅਤੇ ਅੰਤਰਰਾਸ਼ਟਰੀ ਕ੍ਰਿਕਟਰਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਸਕਣਗੇ।</p> <p><strong>&nbsp;ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਕੀ ਬੋਲੇ ?</strong></p> <p>ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਭਾਰਤ ਤੋਂ ਇਲਾਵਾ ਅਸੀਂ ਆਪਣੇ ਗਲੋਬਲ ਬ੍ਰਾਡਕਾਸਟਿੰਗ ਪਾਰਟਨਰਜ਼ ਦਾ ਧੰਨਵਾਦ ਕਰਨਾ ਚਾਹਾਂਗੇ, ਜਿਨ੍ਹਾਂ ਦੀ ਬਦੌਲਤ ਕਰੋੜਾਂ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਆਪਣੇ ਘਰਾਂ 'ਚ ਟੂਰਨਾਮੈਂਟ ਲਾਈਵ ਦੇਖਿਆ। ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦਾ ਦਾਇਰਾ ਭਾਰਤ ਸਮੇਤ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਲਗਾਤਾਰ ਵਧ ਰਿਹਾ ਹੈ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕ ਆਪਣੇ ਚਹੇਤੇ ਦਿੱਗਜਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਰਹੇ ਹਨ। ਦਰਅਸਲ, ਇਸ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਦੁਨੀਆ ਦੇ ਕਈ ਦੇਸ਼ਾਂ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਭਾਸ਼ਾਵਾਂ ਵਿੱਚ ਲਾਈਵ ਦੇਖਿਆ ਗਿਆ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ, ਫੈਨਕੋਡ, ਈਐਸਪੀਐਨ+ ਅਤੇ ਵਿਲੋ ਟੀਵੀ ਸਮੇਤ ਕਈ ਪਲੇਟਫਾਰਮਾਂ 'ਤੇ ਦੇਖਿਆ।</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">In these 66 seconds, we tried to capture our consistency with hardwork, persistence, performance, progress and achievements. We just didn&rsquo;t stop dreaming of success, we have been working on it. Another step forward, we@llct20 thank all the fans and well wishers. Now the next stop&hellip; <a href=\"https://t.co/TtFuPAxr8U\">pic.twitter.com/TtFuPAxr8U</a></p> &mdash; Raman Raheja (@ramanraheja) <a href=\"https://twitter.com/ramanraheja/status/1738551981323809192?ref_src=twsrc%5Etfw\">December 23, 2023</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p><strong>ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ</strong></p> <p>ਇਸ ਸੀਜ਼ਨ ਵਿੱਚ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ, ਜਦੋਂ ਕਿ ਦੁਨੀਆ ਭਰ ਦੇ 300 ਮਿਲੀਅਨ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਲਾਈਵ ਦੇਖਿਆ। ਲਾਈਵ ਪ੍ਰਸ਼ੰਸਕਾਂ ਵਿੱਚ ਪਿਛਲੇ ਸੀਜ਼ਨ ਦੇ ਮੁਕਾਬਲੇ 80 ਪ੍ਰਤੀਸ਼ਤ ਦਾ ਵਾਧਾ ਹੋਇਆ ਹੈ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਇਸ ਵਾਰ ਟੀਵੀਆਰ ਪਹਿਲਾਂ ਦੇ ਮੁਕਾਬਲੇ 15 ਫੀਸਦੀ ਵਧਿਆ ਹੈ। ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਦੁਨੀਆ ਭਰ ਵਿੱਚ 1.56 ਬਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਡਿਜੀਟਲ ਪਲੇਟਫਾਰਮ 'ਤੇ ਦੇਖਿਆ ਹੈ। ਜਦੋਂ ਕਿ 182 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਟੈਲੀਵਿਜ਼ਨ ਰਾਹੀਂ ਦੇਖਿਆ। ਇਸ ਤਰ੍ਹਾਂ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਦੇਖੇ ਜਾਣ ਵਾਲੇ ਖੇਡ ਮੁਕਾਬਲਿਆਂ ਵਿੱਚੋਂ ਇੱਕ ਬਣ ਗਿਆ ਹੈ।</p> <p>ਨੋਟ: ਪੰਜਾਬੀ ਦੀਆਂ ਬ੍ਰੇਕਿੰਗ ਖ਼ਬਰਾਂ ਪੜ੍ਹਨ ਲਈ ਤੁਸੀਂ ਸਾਡੇ ਐਪ ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।ਜੇ ਤੁਸੀਂ ਵੀਡੀਓ ਵੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ABP ਸਾਂਝਾ ਦੇ YouTube ਚੈਨਲ ਨੂੰ Subscribe ਕਰ ਲਵੋ। ABP ਸਾਂਝਾ ਸਾਰੇ ਸੋਸ਼ਲ ਮੀਡੀਆ ਪਲੇਟਫਾਰਮਾਂ ਤੇ ਉਪਲੱਬਧ ਹੈ। ਤੁਸੀਂ ਸਾਨੂੰ ਫੇਸਬੁੱਕ, ਟਵਿੱਟਰ, ਕੂ, ਸ਼ੇਅਰਚੈੱਟ ਅਤੇ ਡੇਲੀਹੰਟ 'ਤੇ ਵੀ ਫੋਲੋ ਕਰ ਸਕਦੇ ਹੋ।</p> <p>&nbsp;</p> <p>&nbsp;</p>","content":"Legends League Cricket Viewership: ਹਾਲ ਹੀ 'ਚ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦਾ ਦੂਜਾ ਸੀਜ਼ਨ ਖੇਡਿਆ ਗਿਆ। 22 ਦਿਨਾਂ ਤੱਕ ਚੱਲੇ ਇਸ ਟੂਰਨਾਮੈਂਟ ਵਿੱਚ 19 ਮੈਚ ਖੇਡੇ ਗਏ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਨੇ ਦਰਸ਼ਕਾਂ ਦੀ ਗਿਣਤੀ ਦਾ ਨਵਾਂ ਰਿਕਾਰਡ ਬਣਾਇਆ ਹੈ। ਦਰਅਸਲ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਸੀਜ਼ਨ-2 ਨੂੰ ਦੁਨੀਆ ਭਰ ਦੇ 30 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਨੇ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦੀ ਸਫਲਤਾ 'ਤੇ ਆਪਣੀ ਪ੍ਰਤੀਕਿਰਿਆ ਦਿੱਤੀ। ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਆਪਣੇ ਆਪ ਵਿੱਚ ਵਿਲੱਖਣ ਹੈ। ਇਸ ਦੇ ਤਹਿਤ ਪ੍ਰਸ਼ੰਸਕ ਰਾਸ਼ਟਰੀ ਅਤੇ ਅੰਤਰਰਾਸ਼ਟਰੀ ਕ੍ਰਿਕਟਰਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਸਕਣਗੇ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਕੀ ਬੋਲੇ ? ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਭਾਰਤ ਤੋਂ ਇਲਾਵਾ ਅਸੀਂ ਆਪਣੇ ਗਲੋਬਲ ਬ੍ਰਾਡਕਾਸਟਿੰਗ ਪਾਰਟਨਰਜ਼ ਦਾ ਧੰਨਵਾਦ ਕਰਨਾ ਚਾਹਾਂਗੇ, ਜਿਨ੍ਹਾਂ ਦੀ ਬਦੌਲਤ ਕਰੋੜਾਂ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਆਪਣੇ ਘਰਾਂ 'ਚ ਟੂਰਨਾਮੈਂਟ ਲਾਈਵ ਦੇਖਿਆ। ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦਾ ਦਾਇਰਾ ਭਾਰਤ ਸਮੇਤ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਲਗਾਤਾਰ ਵਧ ਰਿਹਾ ਹੈ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕ ਆਪਣੇ ਚਹੇਤੇ ਦਿੱਗਜਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਰਹੇ ਹਨ। ਦਰਅਸਲ, ਇਸ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਦੁਨੀਆ ਦੇ ਕਈ ਦੇਸ਼ਾਂ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਭਾਸ਼ਾਵਾਂ ਵਿੱਚ ਲਾਈਵ ਦੇਖਿਆ ਗਿਆ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ, ਫੈਨਕੋਡ, ਈਐਸਪੀਐਨ+ ਅਤੇ ਵਿਲੋ ਟੀਵੀ ਸਮੇਤ ਕਈ ਪਲੇਟਫਾਰਮਾਂ 'ਤੇ ਦੇਖਿਆ। In these 66 seconds, we tried to capture our consistency with hardwork, persistence, performance, progress and achievements. We just didn’t stop dreaming of success, we have been working on it. Another step forward, we@llct20 thank all the fans and well wishers. Now the next stop… pic.twitter.com/TtFuPAxr8U googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — Raman Raheja (@ramanraheja) December 23, 2023 ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ ਇਸ ਸੀਜ਼ਨ ਵਿੱਚ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ, ਜਦੋਂ ਕਿ ਦੁਨੀਆ ਭਰ ਦੇ 300 ਮਿਲੀਅਨ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਲਾਈਵ ਦੇਖਿਆ। ਲਾਈਵ ਪ੍ਰਸ਼ੰਸਕਾਂ ਵਿੱਚ ਪਿਛਲੇ ਸੀਜ਼ਨ ਦੇ ਮੁਕਾਬਲੇ 80 ਪ੍ਰਤੀਸ਼ਤ ਦਾ ਵਾਧਾ ਹੋਇਆ ਹੈ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਇਸ ਵਾਰ ਟੀਵੀਆਰ ਪਹਿਲਾਂ ਦੇ ਮੁਕਾਬਲੇ 15 ਫੀਸਦੀ ਵਧਿਆ ਹੈ। ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਦੁਨੀਆ ਭਰ ਵਿੱਚ 1.56 ਬਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਡਿਜੀਟਲ ਪਲੇਟਫਾਰਮ 'ਤੇ ਦੇਖਿਆ ਹੈ। ਜਦੋਂ ਕਿ 182 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਟੈਲੀਵਿਜ਼ਨ ਰਾਹੀਂ ਦੇਖਿਆ। ਇਸ ਤਰ੍ਹਾਂ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਦੇਖੇ ਜਾਣ ਵਾਲੇ ਖੇਡ ਮੁਕਾਬਲਿਆਂ ਵਿੱਚੋਂ ਇੱਕ ਬਣ ਗਿਆ ਹੈ। ਨੋਟ: ਪੰਜਾਬੀ ਦੀਆਂ ਬ੍ਰੇਕਿੰਗ ਖ਼ਬਰਾਂ ਪੜ੍ਹਨ ਲਈ ਤੁਸੀਂ ਸਾਡੇ ਐਪ ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।ਜੇ ਤੁਸੀਂ ਵੀਡੀਓ ਵੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ABP ਸਾਂਝਾ ਦੇ YouTube ਚੈਨਲ ਨੂੰ Subscribe ਕਰ ਲਵੋ। ABP ਸਾਂਝਾ ਸਾਰੇ ਸੋਸ਼ਲ ਮੀਡੀਆ ਪਲੇਟਫਾਰਮਾਂ ਤੇ ਉਪਲੱਬਧ ਹੈ। ਤੁਸੀਂ ਸਾਨੂੰ ਫੇਸਬੁੱਕ, ਟਵਿੱਟਰ, ਕੂ, ਸ਼ੇਅਰਚੈੱਟ ਅਤੇ ਡੇਲੀਹੰਟ 'ਤੇ ਵੀ ਫੋਲੋ ਕਰ ਸਕਦੇ ਹੋ।","pubDate":"2023-12-24 01:21:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/5e694562abf08e26fbeb63258e880c8d1703380846312709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"28d0abea2fe83650b888ec71120371dc","title":"IND vs SA टेस्ट सीरीज से पहले फैंस के लिए आई बुरी खबर, मैच का मजा होगा किरकिरा!","link":"https://www.indiatv.in/sports/cricket/ind-vs-sa-1st-test-centurion-weather-report-rain-likely-wash-out-first-2-days-2023-12-24-1010683","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA 1st Test: भारत और साउथ अफ्रीका के बीच टेस्ट सीरीज का पहला मैच 26 दिसंबर से सेंचुरियन के सुपरस्पोर्ट पार्क में खेला जाएगा। इस मैच से पहले मौसम को लेकर एक बड़ा अपडेट सामने आया है।","content":"टीम इंडिया का साउथ अफ्रीका दौरा अभी तक काफी शानदार रहा है। भारतीय टीम ने टी20 सीरीज में साउथ अफ्रीका को बराबरी पर रोका था और वनडे सीरीज 2-1 से अपने नाम की। अब दोनों टीमों के बीच टेस्ट सीरीज खेली जाएगी। 26 दिसंबर से दोनों टीमों के बीच 2 मैचों की टेस्ट सीरीज की शुरुआत होने जा रही है। सीरीज का पहला मैच सेंचुरियन के सुपरस्पोर्ट पार्क में खेला जाएगा। इस मैच से पहले फैंस के लिए एक बुरी खबर सामने आई है। भारत और साउथ अफ्रीका के बीच सेंचुरियन में खेले जाने वाले टेस्ट मैच पर बारिश की खतरा मंडरा रहा है। सेंचुरियन के क्यूरेटर ने कहा कि टेस्ट के शुरूआती दिन और दूसरे दिन के ज्यादातर हिस्से में खेल की संभावना बहुत कम है और भारी बारिश के कारण तापमान में गिरावट होगी जिससे स्पिनरों को ज्यादा मदद नहीं मिलेगी। ब्लॉय ने पीटीआई से कहा कि तापमान काफी कम होगा जैसे 20 डिग्री। अभी तापमान 34 डिग्री है और यह गिरकर 20 डिग्री तक पहुंच जाएगा। उम्मीद करता हूं कि कुछ खेल हो और तीसरे दिन यह ठीक रहेगा लेकिन मुझे नहीं पता कि पिच पर कितना टर्न होगा। मैं मौसम की भविष्यवाणी की गारंटी नहीं ले सकता लेकिन अगर पिच दो दिन में ज्यादातर समय ढकी रहेगी तो पहले बल्लेबाजी करना थोड़ा पेचीदा हो सकता है क्योंकि यह काफी लंबे समय तक ढकी रहेगी और हमें नहीं पता कि मौजूदा स्थिति में यह कितने समय में खेलने के लिए तैयार होगी। उन्होंने कहा कि अगर तीसरे दिन खेल सुबह 10 बजे शुरू होगा तो हमें ज्यादा समय नहीं मिलेगा। अगर यह दो दिन तक ढकी रहेगी तो मेरा मानना है कि इससे गेंदबाजों को फायदा होगा। भारत: रोहित शर्मा (कप्तान), शुभमन गिल, यशस्वी जायसवाल, विराट कोहली, श्रेयस अय्यर, अभिमन्यु ईश्वरन, केएल राहुल (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, शार्दुल ठाकुर, मोहम्मद सिराज, मुकेश कुमार, जसप्रीत बुमराह (उपकप्तान), प्रसिद्ध कृष्णा और केएस भरत (विकेटकीपर)। साउथ अफ्रीका: टेम्बा बावुमा (कप्तान), डेविड बेडिंघम, नांद्रे बर्गर, एडेन मार्करम, वियान मुल्डर, कगिसो रबाडा, ट्रिस्टन स्टब्स, काइल वेरेन, गेराल्ड कोएट्जी, टोनी डी जोर्जी, डीन एल्गर, मार्को यानसेन, केशव महाराज, लुंगी एनगिडी, कीगन पीटरसन। ये भी पढ़ें","pubDate":"2023-12-24 01:08:54","image_url":"https://resize.indiatv.in/resize/715_-/2023/12/g-1703380017.jpg","source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"70b1d717522c5ea4a7eb11d0d62c85e2","title":"The five most memorable Boxing Day Tests","link":"https://www.cairnspost.com.au/news/victoria/the-five-most-memorable-boxing-day-test-moments-picked-by-an-mcg-historian/news-story/13aa7edde52f85bf1ab6bad514cd12bf","keywords":["Cricket news and galleries","News","Victoria"],"creator":[""],"video_url":null,"description":"Forget about Christmas – the Boxing Day Test is almost upon us.","content":"Victoria Don't miss out on the headlines from Victoria. Followed categories will be added to My News. Forget about Christmas – the Boxing Day Test is almost upon us. On the eve of Australia lining up against Pakistan at the MCG, Melbourne Cricket Club historian and librarian David Studham has picked his five most memorable Boxing Day Test moments, in chronological order. Check out his list and have your say below. 1. Lillee produces “one of the most memorable wickets in MCG history”, 1981 Dennis Lillee celebrates the wicket of Viv Richards in the 1981 Boxing Day Test. Lillee took 10 wickets in the match. Dennis Lillee knocking over West Indies great Viv Richards with the final ball of the opening day of the 1981 Boxing Day Test ranks as “one of the most memorable wickets in MCG history”, Mr Studham says. “Richards played on to his stumps, and that left the West Indies at 4/10,” Mr Studham said. “Australia went on to win that match by the 58 runs, knocking the West Indies over for 161 in the last innings.” The wicket capped off a remarkable spell in which Lillee claimed three scalps in a 35-minute period before stumps. He finished the match with 10-127, the seventh and final 10-wicket haul of his career. Australia’s victory ended a West Indies run of 15 Tests without defeat since February 1980. 2. Border and Thomson’s brave ninth-wicket stand, 1982 Allan Border and Jeff Thomson’s valiant ninth-wicket stand just fell short in 1982. Thomson being mobbed by fans at the Boxing Day Test. Allan Border and Jeff Thomson fell agonisingly short of claiming what would have been a remarkable win for Australia against England in the 1982 Boxing Day Test. The pair came together at 9/218, chasing 292, and nearly got there. “On the last day of the Test, we needed 37 runs and England needed one wicket to win,” Mr Studham said. “We ended up with more than 18,000 fans coming along for potentially one ball. And of course, we get 33 runs and then poor Thomson gets what I can only describe as not one of Ian Botham’s best balls that gets delivered the outside the off stump. “Thomson pushes his bat at it, snicks it to Chris Tavaré who flicks it up to be caught by Geoff Miller at slips, and that breaks the hearts of the 18,000 fans at MCG.” Border was stranded at the non-striker’s end on 62 after spending almost four hours at the crease. 3. The longest day in Test cricket history, 1998 Dean Headley was a well-deserved man of the match in the 1998 Boxing Day Test. This dead rubber proved to be such an exciting match that English fans celebrated their unlikely victory “like they’d won the Ashes”, Mr Studham recalls. “The longest day in Test cricket history was the (fourth day of the) 1998 Boxing Day Test,” he said. “We were washed out on the first day, but the fourth day lasted for eight hours and three minutes, because the umpires decided to take an extra half-hour to force a result. It looked like Australia was going to beat England and score the runs they needed. “Then, Dean Headley ran amok and changed the course of the game by taking three wickets in 12 deliveries. We ended up falling apart and losing by 12 runs to England in the last innings, really unexpectedly. “I remember going out to dinner afterwards with a lot of English cricket fans who were out here, and they were so ecstatic that they actually won a match. They were acting like they’d won the Ashes.” Headley took 6/60 in the second innings to achieve his first five-for and be named player of the match. The Balmy army celebrate England's win by crowding on to the MCG field. 4. Warnie gets his 700th Test wicket, 2006 Shane Warne takes his 700th Test wicket during day one of the 2006 Boxing Day Test. Warnie gets carried off by Andrew Symonds and Matthew Hayden. It’s impossible to go past Shane Warne taking his 700th Test scalp when talking about memorable Boxing Day Test moments, Mr Studham says. In the 47th over on day one, Warne deceived Strauss with a quicker, well-pitched up delivery that rattled his middle stump. “When Warnie came in and bowled Andrew Strauss, the whole place just shook,” he said. “He was the first player to capture 700 Test wickets. “We had hoped to break the record of the 90,800 for a day at the MCG, but we only got to 89,155 because it was cold, wet and damp. “Australia ended up winning by an innings in three days.” Warne bowls Strauss for his 700th wicket. It was Warne’s 37th five-wicket haul in a Test match. Mr Studham said the spin king’s hat-trick against England in 1994 was another clear MGC cricket highlight – but it technically took place in a Christmas Eve Test. It was the first Ashes hat-trick in 90 years and capped off by a leaping David Boon catch. “It was my first Test actually working at the MCG – what a match to start with,” he said. 5. Hayden’s record six Boxing Day tons, 2001-2007 Andrew Symonds celebrates his century with Matthew Hayden at the 2006 Boxing Day Test. Matthew Hayden notches a record sixth Boxing Day Test century. Matthew Hayden scored his record sixth Boxing Day Test century against India in 2007, making 124. But Mr Studham considers his 2006 ton, in which he and “Andrew Symonds destroyed England”, to be the most memorable. The star opener reached 153 to add another highlight to the dominant Aussie win also containing Warne’s 700th wicket. Mr Studham said Hayden’s haul was the highest number of Boxing Day centuries scored by one player, but Sir Don Bradman held the record for most MCG tons with nine. He added the Boxing Day Test was formalised by the Australian Cricket Board in 1980. The MCC Library is open to MCC members and guests throughout the Boxing Day Test, and on other days, to anyone who books an MCG Tour. Visitors can check out a special exhibition, 150 Treasures , collated by librarians to celebrate the Library’s 150th birthday. Over summer, these include cricket treasures like the newspaper obituary mourning the “death of English cricket” from which The Ashes was named. Visit: mcc.org.au/mcc-reserve/mcc-library Originally published as The five most memorable Boxing Day Test moments, picked by an MCG historian More related stories Property What do Victorians think is the state’s top home? Property pundits have turned up in force to back in their favourite houses in Victoria, with a surprising result for what they deemed the state’s best. SEE THE LIST Read more Victoria Mixed forecasts for Victoria on Christmas, Carols facing storms Melburnians can have a Christmas roast and pudding in comfort with rain forecast for the 25th, but other parts of the state will be warm and dry. Meanwhile Carols by Candlelight could be hit by thunderstorms. Read more","pubDate":"2023-12-24 01:00:00","image_url":null,"source_id":"cairnspost","source_priority":626680,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"e7339179829a3f18554eba133b21b67b","title":"BBL opts not to reschedule abandoned Geelong game","link":"https://www.perthnow.com.au/sport/cricket/bbl-opts-not-to-reschedule-abandoned-geelong-game-c-13008201","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"A BBL match in Geelong between the Renegades and Scorchers that was abandoned because of the state of the pitch will not be rescheduled.","content":"The abandoned Big Bash League game in Geelong between the Melbourne Renegades and Perth will not be replayed. The match at GMHBA Stadium on December 10 was called off amid farcical scenes after just 6.5 overs because of concerns over the safety of the pitch. Water damage had made the pitch unplayable, with multiple Scorchers batters hit by deliveries before umpires stopped play. BBL authorities confirmed on Sunday the game would not be rescheduled and both teams would receive a point each. \"The circumstances giving rise to the abandoned match remain the subject of an ongoing investigation,\" the BBL statement read. \"While various options to reschedule were explored, it became apparent rescheduling would be challenging due to a variety of factors, including the existing schedule across the two clubs, and limited access to venues.\" Perth are favourites to claim a record third straight BBL title, while the Renegades are winless after losing to the Hobart Hurricanes on Saturday night.","pubDate":"2023-12-24 00:50:49","image_url":"https://images.perthnow.com.au/publication/C-13008201/5443d3b8f9c20238ca4992593815b1dfc2ba3151-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"4cea91a842741a353484d8d4ad6065fb","title":"Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese","link":"https://www.dailymail.co.uk/sport/cricket/article-12897447/iconic-band-six-Prime-Minister-Anthony-Albanese-cricket.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Much-loved Aussie rock and roll band Six and Out have reunited after 20 years and are touring this summer - and fans have got Prime Minister Anthony Albanese to thank for it.","content":"Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese Iconic cricket band Six and Out have reunited The PM recently requested them to play The band will play three gigs this summer By James Cooney For Daily Mail Australia Published: 19:14 EST, 23 December 2023 | Updated: 19:18 EST, 23 December 2023 e-mail 2 View comments Much-loved Aussie rock and roll band Six and Out have reunited after 20 years and are touring this summer - and fans have got Prime Minister Anthony Albanese to thank for it. Six and Out, which is made up of former first-class cricketers Brett Lee, Shane Lee, Gavin Robertson, Brad McNamara and Richard Chee Quee, have decided to get the band back together and go on tour. The rockers, who are best known for their song 'Can't Bowl, Can't Throw', were recently asked to play at Marrickville Lawn Tennis Club by the PM. 'Basically, Mr Albanese's partner, Jodie Haydon , she was a Six and Out fan back in the day when we played, and she asked the PM if he'd contact Binga to ask us to play at the 100th anniversary,' McNamara told News Corp . 'The PM and Binga had had the odd game of tennis together. Cricket star rockers Six and Out will be playing three shows this summer The PM inspired the tour by asking the band to play at the Marrickville Lawn Tennis Club 'It was the catalyst to fire it all up again. It was great. 'It brought back memories. How much fun we had and how much we'd missed it all. It's amazing how quick life passes you by.' The iconic band had so much fun that they decided to go back on tour and are planning three gigs this summer. Brett Lee, who plays bass in the band, likened being on stage to the thrill of playing cricket for Australia. 'When you hit that harmony … I liken it to when you bowl a perfect outswinger,' Lee said. 'I've felt a lot more comfortable playing cricket because I've done it a lot more … it can be very, very nerve wracking when you're on stage. 'It's a great buzz because you're out of your comfort zone but that also brings out this massive adrenaline rush which is why it's such a fun thing to do.' Lee, who travelled the world playing cricket, recently opened up about a secret chamber at the SCG where only legends of the game are allowed to tread. The iconic Aussie band are best known for their hit song 'Can't Bowl, Can't Throw' Speaking on the Hello Sport podcast, Lee revealed the top-secret cellar at the Sydney venue that has been a safe haven for Test players since Bradman brandished the Willow over 70 years ago. 'At the Sydney Cricket Ground, a lot of people don't know — (I'm) giving away a little bit of inside knowledge here,' Lee told the podcast hosts. 'That inner sanctum where we feel comfortable, where there's no press, where we can relax and just speak honestly and openly.' The secret cellar even had a secret knock to gain access. 'After the Test win at the SCG, the tradition is you'll get a cricket bat and go thump thump thump on the floor, three taps. 'Then a few minutes later you'll hear thump thump thump, someone from downstairs in the cellar, which means come downstairs to the cellar. 'So you walk down underneath the change rooms of the Australian players, opposite near where the race is and there's a little garage door. 'You walk inside and it's (tiny) so we reckon it's Justin Langer's house because he fits in beautifully. And there's a door that's been signed by every Test cricketer I think since the 1950s that's in there. 'And it's a cellar. So beers and wine, you get down there and have a chat with some of the ground staff and have a cold beer with them.' Anthony Albanese Jodie Haydon Share or comment on this article: Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-24 00:18:28","image_url":"https://i.dailymail.co.uk/1s/2023/12/24/00/79295005-0-image-a-273_1703376641307.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ded7b3c331a6d20fed23f67b982f9f15","title":"IND vs SA 1st Test: टीम इंडिया के फैंस के लिए गुड न्यूज, टेस्ट मैच से पहले कोहली की हुई वापसी","link":"https://www.abplive.com/sports/cricket/ind-vs-sa-1st-test-virat-kohli-joins-team-india-before-test-match-against-south-africa-2568133","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"<p><strong>India vs South Africa 1st Test:</strong> भारत और दक्षिण अफ्रीका के बीच 26 दिसंबर से टेस्ट सीरीज का आगाज होगा. इसका पहला मैच सेंचुरियन में खेला जाएगा. विराट कोहली फैमिली इमरजेंसी की वजह से भारत लौट आए थे. लेकिन अब खबर आई है कि कोहली टीम इंडिया से जुड़ गए हैं. मीडिया रिपोर्ट्स के मुताबिक कोहली के जाने को लेकर भारतीय क्रिकेट कंट्रोल बोर्ड को पहले से ही जानकारी थी. हालांकि टीम के लिए अच्छी बात यह है कि उनकी वापसी हो चुकी है. कोहली सेंचुरियन में होने वाले मुकाबले में हिस्सा लेंगे.</p> <p>&nbsp;</p> <p>अपडेट जारी है...</p> <p><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/mitchell-starc-reveals-real-reason-behind-not-playing-ipl-since-2015-here-know-latest-sports-news-2568061\">Mitchell Starc: आईपीएल 2015 में आखिरी बार दिखे थे मिचेल स्टार्क, फिर 7 सीजन क्यों नहीं खेले? खुद बताई वजह</a></strong></p>","content":"India vs South Africa 1st Test: भारत और दक्षिण अफ्रीका के बीच 26 दिसंबर से टेस्ट सीरीज का आगाज होगा. इसका पहला मैच सेंचुरियन में खेला जाएगा. विराट कोहली फैमिली इमरजेंसी की वजह से भारत लौट आए थे. लेकिन अब खबर आई है कि कोहली टीम इंडिया से जुड़ गए हैं. मीडिया रिपोर्ट्स के मुताबिक कोहली के जाने को लेकर भारतीय क्रिकेट कंट्रोल बोर्ड को पहले से ही जानकारी थी. हालांकि टीम के लिए अच्छी बात यह है कि उनकी वापसी हो चुकी है. कोहली सेंचुरियन में होने वाले मुकाबले में हिस्सा लेंगे. न्यूज 18 की एक खबर के मुताबिक कोहली टीम इंडिया से जुड़ गए हैं. वे अचानक नहीं गए थे. बीसीसीआई को कोहली के जाने को लेकर पहले से जानकारी थी. अहम बात यह है कि कोहली फैमिली इमरजेंसी की वजह से नहीं गए थे. वे लंदन गए थे. उनके प्लान को लेकर बोर्ड को पूरी जानकारी थी. यह अचानक लिया गया फैसला नहीं था. कोहली जल्द ही टेस्ट मैच के लिए प्रैक्टिस शुरू करेंगे. अपडेट जारी है... googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); यह भी पढ़ें : Mitchell Starc: आईपीएल 2015 में आखिरी बार दिखे थे मिचेल स्टार्क, फिर 7 सीजन क्यों नहीं खेले? खुद बताई वजह","pubDate":"2023-12-24 02:10:33","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/83484918a8da61dc582bbdd5b768bf541703383816327344_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"271e22006f3eedd67fd9619ddaccd937","title":"Aussies eye Christmas miracle as one-off India Test comes down to thrilling finale: LIVE","link":"https://www.foxsports.com.au/cricket/australia/cricket-2023-australia-vs-india-womens-test-live-updates-aussies-eye-christmas-miracle-on-final-day/news-story/0af45ab332602daf9b9b1bb0820ec30d","keywords":null,"creator":null,"video_url":null,"description":"Australia will need something of a Christmas (Eve) miracle on the fourth and final day to claim victory in their one-off Test against India.","content":"Australia will need something of a Christmas (Eve) miracle on the fourth and final day to claim victory in their one-off Test against India. Australia enter the final day (3pm AEDT) with a 46-run lead, with the score 5-233 in Australia’s second innings. India piled on 406 runs (their highest total against Australia) to take a 187-run lead after the first innings, and Australia will need their lower order to fire – and then bowl out India quickly – to avoid a first-ever defeat to India. Watch India v Australia Women’s Series LIVE and exclusive to Fox Sports on Kayo. New to Kayo? Start Your Free Trial Today > McGrath leads huge day 3 showing | 03:05 DAY THREE REPORT: Horror brain fade as Australian fightback sets up thrilling final day Annabel Sutherland (12* off 67) and Ash Gardner (7*) will hope to survive against a rampant India bowling attack at Wankhede Stadium. Ellyse Perry told reporters on Saturday afternoon that staying “present” in the moment was key to Australia’s success. “We’ve just grown into this Test match a little bit and adjusted to the conditions as we’ve gone,” the all-rounder said. “Today, I think there was a really clear plan there – obviously with the position of the game, it was just for us to bat for as long as we possibly could, and just to play what was in front of us without too much of a mind on what’s going to happen down the track. “I think having that focus on the present was really helpful for all of us and I thought there were some really good patches and partnerships from us. “As individual batters within our group, we all play a little bit differently so all of us have a slightly different method, but the big message today was just to be really strong in our conviction to those methods.” Day four gets underway at 3pm AEDT. MATCH CENTRE: India vs Australia women’s Test scorecard LIVE LIVE BLOG Follow the action in our live blog below!","pubDate":"2023-12-24 01:56:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5284db45f8349b06308f22e0833ae913","title":"रोहित-विराट और कौन? जब साउथ अफ्रीका पर हुई थी डबल सेंचुरी की बारिश","link":"https://hindi.news18.com/cricket/ind-vs-sa-test-3-batsmen-including-rohit-sharma-and-virat-kohli-had-scored-double-centuries-against-south-africa-7926135.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA Test: टीम इंडिया टेस्ट सीरीज में साउथ अफ्रीका को उसके घर में टक्कर देने के लिए तैयार है. दोनों टीमें पहले टेस्ट में 26 दिसंबर को आमने-सामने होंगी. 4 साल पहले टीम इंडिया के 3 बल्लेबाजों ने इस टीम के खिलाफ रनों का अंबार खड़ा कर दिया था.","content":"साउथ अफ्रीका के खिलाफ भारत पहला टेस्ट 26 दिसंबर को खेलेगा. (AP) नई दिल्ली. रोहित शर्मा (Rohit Sharma), टीम इंडिया के वो बल्लेबाज जिनका दोहरे शतक से एक अलग रिश्ता है. वनडे क्रिकेट में रोहित सबसे ज्यादा दोहरे शतक लगाने वाले बल्लेबाज हैं. लेकिन कई बार टेस्ट में भी हिटमैन ने बल्ले से धमाल मचाया है. दूसरी ओर विराट भी इस टीम के खिलाफ बल्ले से हल्ला बोलते नजर आए थे. लेकिन इन दोनों के साथ मिलकर एक और बल्लेबाज था जिसने साउथ अफ्रीका के खिलाफ रनों का अंबार खड़ा कर दिया था. 4 साल पहले साउथ अफ्रीका की टीम भारत दौरे पर थी. भारत के खिलाफ मेहमान टीम को 3 टेस्ट की सीरीज खेलनी थी और टीम की कमान दिग्गज फाफ डु प्लेसी के हाथों में थी. वहीं, टीम इंडिया की कप्तान स्टार बल्लेबाज विराट कोहली संभाल रहे थे. इस सीरीज के पहले ही मुकाबले से भारतीय बल्लेबाजों ने रनों की बौछार कर दी. पहले टेस्ट की पहली पारी में सलामी बल्लेबाज मयंक अग्रवाल और रोहित शर्मा थे. एक तरफ मयंक अग्रवाल ने 215 रन ठोक डाले. दूसरी ओर हिटमैन भी डबल सेंचुरी की तरफ तेजी से बढ़ते नजर आ रहे थे. लेकिन बदकिस्मती से रोहित 176 रन पर अपना विकेट गंवा बैठे. जब दूसरी पारी आई तो मयंक का बल्ला खामोश रहा लेकिन रोहित नहीं रुके. हिटमैन ने 127 रन की ताबड़तोड़ पारी को अंजाम दिया. भारत ने पहली पारी में 523 जबकि दूसरी पारी में 323 रन ठोके, इन दमदार पारियों की बदौलत टीम इंडिया ने इस मैच को 203 रन से अपने नाम कर लिया था. दूसरे टेस्ट मयंक और कोहली ने बोला हल्ला मेहमान टीम के खिलाफ दूसरे टेस्ट में मयंक अग्रवाल का बल्ला फिर बोला. उन्होंने 108 रन की शानदार पारी खेली. चौथे नंबर पर आए कप्तान कोहली ने भी इस मैच में रनों की बौछार कर दी. उन्होंने 254 रन की पहाड़नुमा पारी खेली और टीम को 500 के पार पहुंचा दिया. इसके अलावा जडेजा ने भी बहती गंगा में हाथ धोए लेकिन शतक से महज 9 रन दूर रह गए. टीम इंडिया ने 601 रन का पहाड़ साउथ अफ्रीका के सामने रखा. दूसरी तरफ अफ्रीकी टीम दोनों पारियों में 275 और 189 रन पर ही सिमट गई. भारत ने इस मुकाबले को 137 रन से जीता. भारत को टेस्ट सीरीज नहीं जीतने देगा साउथ अफ्रीका, कोच ने दे डाली चेतावनी, सर्वश्रेष्ठ प्रदर्शन नहीं करने देंगे तीसरे टेस्ट में रोहित का कहर तीसरे और आखिरी टेस्ट में न तो मयंक चले और न कोहली. इस मैच में रोहित शर्मा अफ्रीकी टीम के सामने दीवार बन गए. हिटमैन ने महज 255 गेंद में 212 रन ठोक दिए. भारतीय टीम ने 497 रन का विशाल स्कोर बनाया, जिसमें अजिंक्य रहाणे के दमदार शतक ने भी अहम योगदान दिया. मेहमान टीम 162 और 133 रन पर दोनों पारियों में सिमट गई और भारत ने 202 रन से मैच जीतकर सीरीज अपने नाम की. . Tags: Ind vs sa , Mayank agarwal , Team india , Virat Kohli असल में ऐसा दिखता है सांता क्लॉज, AI ने दिखाया असली चेहरा, लोगों ने कहा-एनिमल का अबरार कभी गैराज में गुजारी थी रातें, काम के लिए एक्ट्रेस के घर के भी खाए थे धक्के, सुपरस्टार की भाई ने लगाई थी नैया पार मात्र 3000-4500 रुपए में लें जंगल सफारी सहित नेपाल के पर्यटन स्थलों का मजा, ऐसे बुक करें टिकट लाइव ब्लॉग 3 days ago 3 days ago 4 days ago 5 days ago","pubDate":"2023-12-24 01:52:13","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/virat-kohli-in-test-vs-wi-2023-12-920fb46b40309e579bbecd4b4124e523-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ff6346641fc165973071b2e759c8ce6d","title":"Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama","link":"https://www.dailymail.co.uk/sport/cricket/article-12897579/Marcus-Stoinis-controversial-act-Tom-Curran-BBL-drama-cricket.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Footage has emerged of Melbourne Stars captain Marcus Stoinis doing a similar run-through on the pitch to what sparked an incident recently with English cricketer Tom Curran.","content":"Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama Footage shows Stoinis performing run-through before match Players aren't allowed to run onto the pitch before a game Curran was suspended for charging at an umpire By James Cooney For Daily Mail Australia Published: 20:43 EST, 23 December 2023 | Updated: 20:45 EST, 23 December 2023 e-mail View comments Footage has emerged of Melbourne Stars captain Marcus Stoinis doing a similar run-through on the pitch to what sparked an incident recently with English cricketer Tom Curran. Curran was suspended for four Big Big League matches after vision emerged of him charging in toward an umpire at full stride before launching a verbal tirade prior to the match against the Hobart Hurricanes. The umpire instructed Curran to not run on the wicket during his warm up, in line with the laws of the game, and stood in his way to prevent him from running onto the pitch. While the vision clearly shows Curran running at the umpire, his skipper Henriques has gone in to bat for him and challenged the level three offence under the code of conduct for intimidating an umpire. The controversial incident took another twist when reporter Tom Decent posted video of Stoinis doing a similar pre-match run-through onto the pitch on December 13 - though not running at an umpire. The vision everyone's been waiting for. This is the series of events that's led to Tom Curran's four-game suspension... pic.twitter.com/CRcBujbIl0 — 7Cricket (@7Cricket) December 21, 2023 Not providing an opinion or condoning what Tom Curran did the other night. Just a clip to show that during this year’s Big Bash there have been instances of players doing run-throughs on the pitch before a game. Umpire was right there. Appeal will be interesting. pic.twitter.com/R9F6FDKaV7 — Tom Decent (@tomdecent) December 23, 2023 Stoinis, as the captain, is allowed by the rules of cricket to inspect the pitch before the match - but he isn't allowed to run onto it to practice a run-up. 'Not providing an opinion or condoning what Tom Curran did the other night,' wrote Decent. 'Just a clip to show that during this year's Big Bash there have been instances of players doing run-throughs on the pitch before a game. 'Umpire was right there. Appeal will be interesting.' Some cricket fans replied to Decent's post to point out that the English paceman had been suspended for intimidation of an official, while others questioned why Stoinis wasn't told to stop by the umpire. Curran's charges specifically cite 'intimidation or attempted intimidation of an Umpire, Match Referee, or Medical Personnel, whether by language or conduct (including gestures).' Curran was instructed not to enter the pitch, then went to the other end to complete another practice run-up. 'You can run here, but not here,' the umpire could be heard telling Curran, also using his arms to show where he can run. Stoinis was spotted doing a run-through onto the pitch pre-match, which isn't allowed Curran has been suspended for four Big Big League matches after vision emerged of him charging in toward an umpire at full stride before launching a verbal tirade Curran then attempted to perform a practice run-up and steamed in at pace straight towards the umpire, who stood in the bowling crease facing him. Making his actions even worse, Curran then turned to deliver a spray to the umpire. Channel Nine journalist Tom Morris revealed what he said on SEN: 'Word for word, Tom Curran to the fourth umpire after he ran past him: \"If you stand in the way I have nowhere go, you f***head.' Curran's actions in the video have been widely slammed by cricket fans, with many saying the penalty is too lenient and lashing the Sixers for appealing the four-match ban. Former Australian pace bowler Merv Hughes led the calls, posting: 'So they should appeal….. I don’t think the four game suspension is anywhere near harsh enough!!!! Should have got 10!!' 'Should be banned for the whole season,' one fan posted. 'For appealing it they should add 4 more games and the sixes to be deducted points, appealing means they condone this behavior,' added another. 'Send him home. Tear up his contract, don’t appeal the decision,' posted another. Melbourne Share or comment on this article: Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-24 01:45:48","image_url":"https://i.dailymail.co.uk/1s/2023/12/24/01/79296293-0-image-a-287_1703381926031.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ac989afac1d2e06ddd1e36dcb2c5ace3","title":"Indian Team: ਟੀਮ ਇੰਡੀਆ 'ਤੇ ਮੰਡਰਾ ਰਿਹਾ ਵੱਡਾ ਖਤਰਾ, ਇਨ੍ਹਾਂ ਖਿਡਾਰੀਆਂ ਦੀ ਗੈਰਮੌਜੂਦਗੀ ਵਿਗਾੜ ਸਕਦੀ ਖੇਡ","link":"https://punjabi.abplive.com/sports/cricket/indian-cricket-team-4-player-injured-before-t20-world-cup-2024-know-health-update-766706","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>Injured Indian Player Before T20 World Cup 2024:</strong> ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਨੇ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੇ ਗਏ ਇੱਕ ਰੋਜ਼ਾ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੇ ਫਾਈਨਲ ਵਿੱਚ ਆਸਟਰੇਲੀਆ ਤੋਂ ਹਾਰ ਗਈ ਸੀ। ਹੁਣ ਪ੍ਰਸ਼ੰਸਕ ਉਮੀਦ ਕਰ ਰਹੇ ਹਨ ਕਿ ਟੀਮ ਇੰਡੀਆ 2024 'ਚ ਹੋਣ ਵਾਲਾ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਜਿੱਤੇਗੀ। ਪਰ ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਭਾਰਤੀ ਟੀਮ ਦੇ 4 ਸਟਾਰ ਖਿਡਾਰੀ ਜ਼ਖਮੀ ਹੋ ਚੁੱਕੇ ਹਨ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੱਟ ਨੂੰ ਲੈ ਕੇ ਅਜੇ ਤੱਕ ਕੋਈ ਅਧਿਕਾਰਤ ਅਪਡੇਟ ਨਹੀਂ ਆਇਆ ਹੈ। ਜ਼ਖ਼ਮੀ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਵਿੱਚ ਮੁਹੰਮਦ ਸ਼ਮੀ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ, ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਅਤੇ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਸ਼ਾਮਲ ਹਨ।</p> <p><strong>1- ਹਾਰਦਿਕ ਪਾਂਡਿਆ</strong></p> <p>ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਦੇ ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ। ਹਾਰਦਿਕ ਨੂੰ ਟੂਰਨਾਮੈਂਟ 'ਚ ਬੰਗਲਾਦੇਸ਼ ਖਿਲਾਫ ਖੇਡੇ ਗਏ ਮੈਚ 'ਚ ਅੱਡੀ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਉਹ ਹੁਣ ਤੱਕ ਵਾਪਸੀ ਨਹੀਂ ਕਰ ਸਕੇ ਹਨ।</p> <p><strong>2- ਮੁਹੰਮਦ ਸ਼ਮੀ</strong></p> <p><br />ਹਾਲ ਹੀ 'ਚ ਭਾਰਤੀ ਧਰਤੀ 'ਤੇ ਖੇਡੇ ਗਏ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 'ਚ ਮੁਹੰਮਦ ਸ਼ਮੀ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ ਵਿਕਟਾਂ ਲੈਣ ਵਾਲੇ ਗੇਂਦਬਾਜ਼ ਸਨ। ਸ਼ਮੀ ਨੇ 7 ਮੈਚਾਂ 'ਚ 10.71 ਦੀ ਸ਼ਾਨਦਾਰ ਔਸਤ ਨਾਲ 24 ਵਿਕਟਾਂ ਲਈਆਂ। ਸ਼ਮੀ ਦੇ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਉਹ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੈਸਟ ਸੀਰੀਜ਼ ਤੋਂ ਬਾਹਰ ਹੋ ਗਿਆ ਸੀ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਸ਼ਮੀ ਨੂੰ ਟੈਸਟ ਟੀਮ 'ਚ ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ ਸੀ ਪਰ ਫਿਰ ਬੀਸੀਸੀਆਈ ਨੇ ਅਪਡੇਟ ਦਿੰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਸੱਟ ਕਾਰਨ ਉਹ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਹਿੱਸਾ ਨਹੀਂ ਹੋਣਗੇ।</p> <p><strong>3- ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ</strong></p> <p>ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਤੋਂ ਬਾਅਦ, ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਨੇ ਆਸਟ੍ਰੇਲੀਆ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੀ-20 ਸੀਰੀਜ਼ 'ਚ ਭਾਰਤ ਦੀ ਕਮਾਨ ਸੰਭਾਲੀ। ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਤੀਜੇ ਟੀ-20 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਨੂੰ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ। ਸੂਰਿਆ ਨੂੰ ਗਰੇਡ-2 ਦੀ ਸੱਟ ਲੱਗੀ ਹੈ। ਹਾਲਾਂਕਿ ਅਜੇ ਤੱਕ ਸੂਰਿਆ ਦੀ ਸੱਟ ਬਾਰੇ ਕੋਈ ਅਧਿਕਾਰਤ ਜਾਣਕਾਰੀ ਨਹੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ <a title=\"ਟੀਮ ਇੰਡੀਆ\" href=\"https://punjabi.abplive.com/topic/indian-cricket-team\" data-type=\"interlinkingkeywords\">ਟੀਮ ਇੰਡੀਆ</a> ਲਈ ਵੱਡੀ ਸਮੱਸਿਆ ਹੋ ਸਕਦੀ ਹੈ। ਸੂਰਿਆ ਭਾਰਤੀ ਟੀ-20 ਟੀਮ ਦਾ ਅਹਿਮ ਖਿਡਾਰੀ ਹੈ।</p> <p><strong>4- ਰੁਤੂਰਾਜ ਗਾਇਕਵਾੜ</strong></p> <p>ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੀ ਗਈ ਇੱਕ ਰੋਜ਼ਾ ਲੜੀ ਵਿੱਚ ਭਾਰਤੀ ਟੀਮ ਦਾ ਹਿੱਸਾ ਸੀ। ਸੀਰੀਜ਼ ਦੇ ਦੂਜੇ ਵਨਡੇ 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਦੇ ਸੱਜੇ ਹੱਥ ਦੀ ਮੁੰਦਰੀ 'ਚ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਗਾਇਕਵਾੜ ਬਾਕੀ ਦੇ ਅਫਰੀਕਾ ਦੌਰੇ ਤੋਂ ਬਾਹਰ ਹੋ ਗਏ ਹਨ।</p>","content":"Injured Indian Player Before T20 World Cup 2024: ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਨੇ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੇ ਗਏ ਇੱਕ ਰੋਜ਼ਾ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੇ ਫਾਈਨਲ ਵਿੱਚ ਆਸਟਰੇਲੀਆ ਤੋਂ ਹਾਰ ਗਈ ਸੀ। ਹੁਣ ਪ੍ਰਸ਼ੰਸਕ ਉਮੀਦ ਕਰ ਰਹੇ ਹਨ ਕਿ ਟੀਮ ਇੰਡੀਆ 2024 'ਚ ਹੋਣ ਵਾਲਾ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਜਿੱਤੇਗੀ। ਪਰ ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਭਾਰਤੀ ਟੀਮ ਦੇ 4 ਸਟਾਰ ਖਿਡਾਰੀ ਜ਼ਖਮੀ ਹੋ ਚੁੱਕੇ ਹਨ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੱਟ ਨੂੰ ਲੈ ਕੇ ਅਜੇ ਤੱਕ ਕੋਈ ਅਧਿਕਾਰਤ ਅਪਡੇਟ ਨਹੀਂ ਆਇਆ ਹੈ। ਜ਼ਖ਼ਮੀ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਵਿੱਚ ਮੁਹੰਮਦ ਸ਼ਮੀ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ, ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਅਤੇ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਸ਼ਾਮਲ ਹਨ। 1- ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਦੇ ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ। ਹਾਰਦਿਕ ਨੂੰ ਟੂਰਨਾਮੈਂਟ 'ਚ ਬੰਗਲਾਦੇਸ਼ ਖਿਲਾਫ ਖੇਡੇ ਗਏ ਮੈਚ 'ਚ ਅੱਡੀ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਉਹ ਹੁਣ ਤੱਕ ਵਾਪਸੀ ਨਹੀਂ ਕਰ ਸਕੇ ਹਨ। 2- ਮੁਹੰਮਦ ਸ਼ਮੀ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਹਾਲ ਹੀ 'ਚ ਭਾਰਤੀ ਧਰਤੀ 'ਤੇ ਖੇਡੇ ਗਏ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 'ਚ ਮੁਹੰਮਦ ਸ਼ਮੀ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ ਵਿਕਟਾਂ ਲੈਣ ਵਾਲੇ ਗੇਂਦਬਾਜ਼ ਸਨ। ਸ਼ਮੀ ਨੇ 7 ਮੈਚਾਂ 'ਚ 10.71 ਦੀ ਸ਼ਾਨਦਾਰ ਔਸਤ ਨਾਲ 24 ਵਿਕਟਾਂ ਲਈਆਂ। ਸ਼ਮੀ ਦੇ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਉਹ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੈਸਟ ਸੀਰੀਜ਼ ਤੋਂ ਬਾਹਰ ਹੋ ਗਿਆ ਸੀ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਸ਼ਮੀ ਨੂੰ ਟੈਸਟ ਟੀਮ 'ਚ ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ ਸੀ ਪਰ ਫਿਰ ਬੀਸੀਸੀਆਈ ਨੇ ਅਪਡੇਟ ਦਿੰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਸੱਟ ਕਾਰਨ ਉਹ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਹਿੱਸਾ ਨਹੀਂ ਹੋਣਗੇ। 3- ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਤੋਂ ਬਾਅਦ, ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਨੇ ਆਸਟ੍ਰੇਲੀਆ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੀ-20 ਸੀਰੀਜ਼ 'ਚ ਭਾਰਤ ਦੀ ਕਮਾਨ ਸੰਭਾਲੀ। ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਤੀਜੇ ਟੀ-20 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਨੂੰ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ। ਸੂਰਿਆ ਨੂੰ ਗਰੇਡ-2 ਦੀ ਸੱਟ ਲੱਗੀ ਹੈ। ਹਾਲਾਂਕਿ ਅਜੇ ਤੱਕ ਸੂਰਿਆ ਦੀ ਸੱਟ ਬਾਰੇ ਕੋਈ ਅਧਿਕਾਰਤ ਜਾਣਕਾਰੀ ਨਹੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਟੀਮ ਇੰਡੀਆ ਲਈ ਵੱਡੀ ਸਮੱਸਿਆ ਹੋ ਸਕਦੀ ਹੈ। ਸੂਰਿਆ ਭਾਰਤੀ ਟੀ-20 ਟੀਮ ਦਾ ਅਹਿਮ ਖਿਡਾਰੀ ਹੈ। 4- ਰੁਤੂਰਾਜ ਗਾਇਕਵਾੜ ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੀ ਗਈ ਇੱਕ ਰੋਜ਼ਾ ਲੜੀ ਵਿੱਚ ਭਾਰਤੀ ਟੀਮ ਦਾ ਹਿੱਸਾ ਸੀ। ਸੀਰੀਜ਼ ਦੇ ਦੂਜੇ ਵਨਡੇ 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਦੇ ਸੱਜੇ ਹੱਥ ਦੀ ਮੁੰਦਰੀ 'ਚ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਗਾਇਕਵਾੜ ਬਾਕੀ ਦੇ ਅਫਰੀਕਾ ਦੌਰੇ ਤੋਂ ਬਾਹਰ ਹੋ ਗਏ ਹਨ।","pubDate":"2023-12-24 01:41:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/35affca015e6ba31155cb01bbfff35ec1703382049987709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"603da2e57bac72a93e53dde76ad9c0a4","title":"LLC: ਲੀਜੈਂਡਜ਼ ਲੀਗ ਨੇ Viewership 'ਚ ਬਣਾਇਆ ਵੱਡਾ ਰਿਕਾਰਡ! ਵਿਸ਼ਵ ਭਰ ਵਿੱਚ ਬੈਠੇ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇੰਝ ਦਿੱਤਾ ਪਿਆਰ","link":"https://punjabi.abplive.com/sports/cricket/legends-league-cricket-is-live-viewership-landmark-of-300-million-globally-for-season-2-know-details-766705","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>Legends League Cricket Viewership:</strong> ਹਾਲ ਹੀ 'ਚ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦਾ ਦੂਜਾ ਸੀਜ਼ਨ ਖੇਡਿਆ ਗਿਆ। 22 ਦਿਨਾਂ ਤੱਕ ਚੱਲੇ ਇਸ ਟੂਰਨਾਮੈਂਟ ਵਿੱਚ 19 ਮੈਚ ਖੇਡੇ ਗਏ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਨੇ ਦਰਸ਼ਕਾਂ ਦੀ ਗਿਣਤੀ ਦਾ ਨਵਾਂ ਰਿਕਾਰਡ ਬਣਾਇਆ ਹੈ। ਦਰਅਸਲ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਸੀਜ਼ਨ-2 ਨੂੰ ਦੁਨੀਆ ਭਰ ਦੇ 30 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਨੇ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦੀ ਸਫਲਤਾ 'ਤੇ ਆਪਣੀ ਪ੍ਰਤੀਕਿਰਿਆ ਦਿੱਤੀ। ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਆਪਣੇ ਆਪ ਵਿੱਚ ਵਿਲੱਖਣ ਹੈ। ਇਸ ਦੇ ਤਹਿਤ ਪ੍ਰਸ਼ੰਸਕ ਰਾਸ਼ਟਰੀ ਅਤੇ ਅੰਤਰਰਾਸ਼ਟਰੀ ਕ੍ਰਿਕਟਰਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਸਕਣਗੇ।</p> <p><strong>&nbsp;ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਕੀ ਬੋਲੇ ?</strong></p> <p>ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਭਾਰਤ ਤੋਂ ਇਲਾਵਾ ਅਸੀਂ ਆਪਣੇ ਗਲੋਬਲ ਬ੍ਰਾਡਕਾਸਟਿੰਗ ਪਾਰਟਨਰਜ਼ ਦਾ ਧੰਨਵਾਦ ਕਰਨਾ ਚਾਹਾਂਗੇ, ਜਿਨ੍ਹਾਂ ਦੀ ਬਦੌਲਤ ਕਰੋੜਾਂ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਆਪਣੇ ਘਰਾਂ 'ਚ ਟੂਰਨਾਮੈਂਟ ਲਾਈਵ ਦੇਖਿਆ। ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦਾ ਦਾਇਰਾ ਭਾਰਤ ਸਮੇਤ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਲਗਾਤਾਰ ਵਧ ਰਿਹਾ ਹੈ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕ ਆਪਣੇ ਚਹੇਤੇ ਦਿੱਗਜਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਰਹੇ ਹਨ। ਦਰਅਸਲ, ਇਸ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਦੁਨੀਆ ਦੇ ਕਈ ਦੇਸ਼ਾਂ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਭਾਸ਼ਾਵਾਂ ਵਿੱਚ ਲਾਈਵ ਦੇਖਿਆ ਗਿਆ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ, ਫੈਨਕੋਡ, ਈਐਸਪੀਐਨ+ ਅਤੇ ਵਿਲੋ ਟੀਵੀ ਸਮੇਤ ਕਈ ਪਲੇਟਫਾਰਮਾਂ 'ਤੇ ਦੇਖਿਆ।</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">In these 66 seconds, we tried to capture our consistency with hardwork, persistence, performance, progress and achievements. We just didn&rsquo;t stop dreaming of success, we have been working on it. Another step forward, we@llct20 thank all the fans and well wishers. Now the next stop&hellip; <a href=\"https://t.co/TtFuPAxr8U\">pic.twitter.com/TtFuPAxr8U</a></p> &mdash; Raman Raheja (@ramanraheja) <a href=\"https://twitter.com/ramanraheja/status/1738551981323809192?ref_src=twsrc%5Etfw\">December 23, 2023</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p><strong>ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ</strong></p> <p>ਇਸ ਸੀਜ਼ਨ ਵਿੱਚ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ, ਜਦੋਂ ਕਿ ਦੁਨੀਆ ਭਰ ਦੇ 300 ਮਿਲੀਅਨ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਲਾਈਵ ਦੇਖਿਆ। ਲਾਈਵ ਪ੍ਰਸ਼ੰਸਕਾਂ ਵਿੱਚ ਪਿਛਲੇ ਸੀਜ਼ਨ ਦੇ ਮੁਕਾਬਲੇ 80 ਪ੍ਰਤੀਸ਼ਤ ਦਾ ਵਾਧਾ ਹੋਇਆ ਹੈ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਇਸ ਵਾਰ ਟੀਵੀਆਰ ਪਹਿਲਾਂ ਦੇ ਮੁਕਾਬਲੇ 15 ਫੀਸਦੀ ਵਧਿਆ ਹੈ। ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਦੁਨੀਆ ਭਰ ਵਿੱਚ 1.56 ਬਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਡਿਜੀਟਲ ਪਲੇਟਫਾਰਮ 'ਤੇ ਦੇਖਿਆ ਹੈ। ਜਦੋਂ ਕਿ 182 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਟੈਲੀਵਿਜ਼ਨ ਰਾਹੀਂ ਦੇਖਿਆ। ਇਸ ਤਰ੍ਹਾਂ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਦੇਖੇ ਜਾਣ ਵਾਲੇ ਖੇਡ ਮੁਕਾਬਲਿਆਂ ਵਿੱਚੋਂ ਇੱਕ ਬਣ ਗਿਆ ਹੈ।</p> <p>ਨੋਟ: ਪੰਜਾਬੀ ਦੀਆਂ ਬ੍ਰੇਕਿੰਗ ਖ਼ਬਰਾਂ ਪੜ੍ਹਨ ਲਈ ਤੁਸੀਂ ਸਾਡੇ ਐਪ ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।ਜੇ ਤੁਸੀਂ ਵੀਡੀਓ ਵੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ABP ਸਾਂਝਾ ਦੇ YouTube ਚੈਨਲ ਨੂੰ Subscribe ਕਰ ਲਵੋ। ABP ਸਾਂਝਾ ਸਾਰੇ ਸੋਸ਼ਲ ਮੀਡੀਆ ਪਲੇਟਫਾਰਮਾਂ ਤੇ ਉਪਲੱਬਧ ਹੈ। ਤੁਸੀਂ ਸਾਨੂੰ ਫੇਸਬੁੱਕ, ਟਵਿੱਟਰ, ਕੂ, ਸ਼ੇਅਰਚੈੱਟ ਅਤੇ ਡੇਲੀਹੰਟ 'ਤੇ ਵੀ ਫੋਲੋ ਕਰ ਸਕਦੇ ਹੋ।</p> <p>&nbsp;</p> <p>&nbsp;</p>","content":"Legends League Cricket Viewership: ਹਾਲ ਹੀ 'ਚ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦਾ ਦੂਜਾ ਸੀਜ਼ਨ ਖੇਡਿਆ ਗਿਆ। 22 ਦਿਨਾਂ ਤੱਕ ਚੱਲੇ ਇਸ ਟੂਰਨਾਮੈਂਟ ਵਿੱਚ 19 ਮੈਚ ਖੇਡੇ ਗਏ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਨੇ ਦਰਸ਼ਕਾਂ ਦੀ ਗਿਣਤੀ ਦਾ ਨਵਾਂ ਰਿਕਾਰਡ ਬਣਾਇਆ ਹੈ। ਦਰਅਸਲ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਸੀਜ਼ਨ-2 ਨੂੰ ਦੁਨੀਆ ਭਰ ਦੇ 30 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਨੇ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦੀ ਸਫਲਤਾ 'ਤੇ ਆਪਣੀ ਪ੍ਰਤੀਕਿਰਿਆ ਦਿੱਤੀ। ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਆਪਣੇ ਆਪ ਵਿੱਚ ਵਿਲੱਖਣ ਹੈ। ਇਸ ਦੇ ਤਹਿਤ ਪ੍ਰਸ਼ੰਸਕ ਰਾਸ਼ਟਰੀ ਅਤੇ ਅੰਤਰਰਾਸ਼ਟਰੀ ਕ੍ਰਿਕਟਰਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਸਕਣਗੇ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਕੀ ਬੋਲੇ ? ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਭਾਰਤ ਤੋਂ ਇਲਾਵਾ ਅਸੀਂ ਆਪਣੇ ਗਲੋਬਲ ਬ੍ਰਾਡਕਾਸਟਿੰਗ ਪਾਰਟਨਰਜ਼ ਦਾ ਧੰਨਵਾਦ ਕਰਨਾ ਚਾਹਾਂਗੇ, ਜਿਨ੍ਹਾਂ ਦੀ ਬਦੌਲਤ ਕਰੋੜਾਂ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਆਪਣੇ ਘਰਾਂ 'ਚ ਟੂਰਨਾਮੈਂਟ ਲਾਈਵ ਦੇਖਿਆ। ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦਾ ਦਾਇਰਾ ਭਾਰਤ ਸਮੇਤ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਲਗਾਤਾਰ ਵਧ ਰਿਹਾ ਹੈ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕ ਆਪਣੇ ਚਹੇਤੇ ਦਿੱਗਜਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਰਹੇ ਹਨ। ਦਰਅਸਲ, ਇਸ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਦੁਨੀਆ ਦੇ ਕਈ ਦੇਸ਼ਾਂ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਭਾਸ਼ਾਵਾਂ ਵਿੱਚ ਲਾਈਵ ਦੇਖਿਆ ਗਿਆ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ, ਫੈਨਕੋਡ, ਈਐਸਪੀਐਨ+ ਅਤੇ ਵਿਲੋ ਟੀਵੀ ਸਮੇਤ ਕਈ ਪਲੇਟਫਾਰਮਾਂ 'ਤੇ ਦੇਖਿਆ। In these 66 seconds, we tried to capture our consistency with hardwork, persistence, performance, progress and achievements. We just didn’t stop dreaming of success, we have been working on it. Another step forward, we@llct20 thank all the fans and well wishers. Now the next stop… pic.twitter.com/TtFuPAxr8U googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — Raman Raheja (@ramanraheja) December 23, 2023 ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ ਇਸ ਸੀਜ਼ਨ ਵਿੱਚ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ, ਜਦੋਂ ਕਿ ਦੁਨੀਆ ਭਰ ਦੇ 300 ਮਿਲੀਅਨ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਲਾਈਵ ਦੇਖਿਆ। ਲਾਈਵ ਪ੍ਰਸ਼ੰਸਕਾਂ ਵਿੱਚ ਪਿਛਲੇ ਸੀਜ਼ਨ ਦੇ ਮੁਕਾਬਲੇ 80 ਪ੍ਰਤੀਸ਼ਤ ਦਾ ਵਾਧਾ ਹੋਇਆ ਹੈ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਇਸ ਵਾਰ ਟੀਵੀਆਰ ਪਹਿਲਾਂ ਦੇ ਮੁਕਾਬਲੇ 15 ਫੀਸਦੀ ਵਧਿਆ ਹੈ। ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਦੁਨੀਆ ਭਰ ਵਿੱਚ 1.56 ਬਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਡਿਜੀਟਲ ਪਲੇਟਫਾਰਮ 'ਤੇ ਦੇਖਿਆ ਹੈ। ਜਦੋਂ ਕਿ 182 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਟੈਲੀਵਿਜ਼ਨ ਰਾਹੀਂ ਦੇਖਿਆ। ਇਸ ਤਰ੍ਹਾਂ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਦੇਖੇ ਜਾਣ ਵਾਲੇ ਖੇਡ ਮੁਕਾਬਲਿਆਂ ਵਿੱਚੋਂ ਇੱਕ ਬਣ ਗਿਆ ਹੈ। ਨੋਟ: ਪੰਜਾਬੀ ਦੀਆਂ ਬ੍ਰੇਕਿੰਗ ਖ਼ਬਰਾਂ ਪੜ੍ਹਨ ਲਈ ਤੁਸੀਂ ਸਾਡੇ ਐਪ ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।ਜੇ ਤੁਸੀਂ ਵੀਡੀਓ ਵੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ABP ਸਾਂਝਾ ਦੇ YouTube ਚੈਨਲ ਨੂੰ Subscribe ਕਰ ਲਵੋ। ABP ਸਾਂਝਾ ਸਾਰੇ ਸੋਸ਼ਲ ਮੀਡੀਆ ਪਲੇਟਫਾਰਮਾਂ ਤੇ ਉਪਲੱਬਧ ਹੈ। ਤੁਸੀਂ ਸਾਨੂੰ ਫੇਸਬੁੱਕ, ਟਵਿੱਟਰ, ਕੂ, ਸ਼ੇਅਰਚੈੱਟ ਅਤੇ ਡੇਲੀਹੰਟ 'ਤੇ ਵੀ ਫੋਲੋ ਕਰ ਸਕਦੇ ਹੋ।","pubDate":"2023-12-24 01:21:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/5e694562abf08e26fbeb63258e880c8d1703380846312709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"28d0abea2fe83650b888ec71120371dc","title":"IND vs SA टेस्ट सीरीज से पहले फैंस के लिए आई बुरी खबर, मैच का मजा होगा किरकिरा!","link":"https://www.indiatv.in/sports/cricket/ind-vs-sa-1st-test-centurion-weather-report-rain-likely-wash-out-first-2-days-2023-12-24-1010683","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA 1st Test: भारत और साउथ अफ्रीका के बीच टेस्ट सीरीज का पहला मैच 26 दिसंबर से सेंचुरियन के सुपरस्पोर्ट पार्क में खेला जाएगा। इस मैच से पहले मौसम को लेकर एक बड़ा अपडेट सामने आया है।","content":"टीम इंडिया का साउथ अफ्रीका दौरा अभी तक काफी शानदार रहा है। भारतीय टीम ने टी20 सीरीज में साउथ अफ्रीका को बराबरी पर रोका था और वनडे सीरीज 2-1 से अपने नाम की। अब दोनों टीमों के बीच टेस्ट सीरीज खेली जाएगी। 26 दिसंबर से दोनों टीमों के बीच 2 मैचों की टेस्ट सीरीज की शुरुआत होने जा रही है। सीरीज का पहला मैच सेंचुरियन के सुपरस्पोर्ट पार्क में खेला जाएगा। इस मैच से पहले फैंस के लिए एक बुरी खबर सामने आई है। भारत और साउथ अफ्रीका के बीच सेंचुरियन में खेले जाने वाले टेस्ट मैच पर बारिश की खतरा मंडरा रहा है। सेंचुरियन के क्यूरेटर ने कहा कि टेस्ट के शुरूआती दिन और दूसरे दिन के ज्यादातर हिस्से में खेल की संभावना बहुत कम है और भारी बारिश के कारण तापमान में गिरावट होगी जिससे स्पिनरों को ज्यादा मदद नहीं मिलेगी। ब्लॉय ने पीटीआई से कहा कि तापमान काफी कम होगा जैसे 20 डिग्री। अभी तापमान 34 डिग्री है और यह गिरकर 20 डिग्री तक पहुंच जाएगा। उम्मीद करता हूं कि कुछ खेल हो और तीसरे दिन यह ठीक रहेगा लेकिन मुझे नहीं पता कि पिच पर कितना टर्न होगा। मैं मौसम की भविष्यवाणी की गारंटी नहीं ले सकता लेकिन अगर पिच दो दिन में ज्यादातर समय ढकी रहेगी तो पहले बल्लेबाजी करना थोड़ा पेचीदा हो सकता है क्योंकि यह काफी लंबे समय तक ढकी रहेगी और हमें नहीं पता कि मौजूदा स्थिति में यह कितने समय में खेलने के लिए तैयार होगी। उन्होंने कहा कि अगर तीसरे दिन खेल सुबह 10 बजे शुरू होगा तो हमें ज्यादा समय नहीं मिलेगा। अगर यह दो दिन तक ढकी रहेगी तो मेरा मानना है कि इससे गेंदबाजों को फायदा होगा। भारत: रोहित शर्मा (कप्तान), शुभमन गिल, यशस्वी जायसवाल, विराट कोहली, श्रेयस अय्यर, अभिमन्यु ईश्वरन, केएल राहुल (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, शार्दुल ठाकुर, मोहम्मद सिराज, मुकेश कुमार, जसप्रीत बुमराह (उपकप्तान), प्रसिद्ध कृष्णा और केएस भरत (विकेटकीपर)। साउथ अफ्रीका: टेम्बा बावुमा (कप्तान), डेविड बेडिंघम, नांद्रे बर्गर, एडेन मार्करम, वियान मुल्डर, कगिसो रबाडा, ट्रिस्टन स्टब्स, काइल वेरेन, गेराल्ड कोएट्जी, टोनी डी जोर्जी, डीन एल्गर, मार्को यानसेन, केशव महाराज, लुंगी एनगिडी, कीगन पीटरसन। ये भी पढ़ें","pubDate":"2023-12-24 01:08:54","image_url":"https://resize.indiatv.in/resize/715_-/2023/12/g-1703380017.jpg","source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"70b1d717522c5ea4a7eb11d0d62c85e2","title":"The five most memorable Boxing Day Tests","link":"https://www.cairnspost.com.au/news/victoria/the-five-most-memorable-boxing-day-test-moments-picked-by-an-mcg-historian/news-story/13aa7edde52f85bf1ab6bad514cd12bf","keywords":["Cricket news and galleries","News","Victoria"],"creator":[""],"video_url":null,"description":"Forget about Christmas – the Boxing Day Test is almost upon us.","content":"Victoria Don't miss out on the headlines from Victoria. Followed categories will be added to My News. Forget about Christmas – the Boxing Day Test is almost upon us. On the eve of Australia lining up against Pakistan at the MCG, Melbourne Cricket Club historian and librarian David Studham has picked his five most memorable Boxing Day Test moments, in chronological order. Check out his list and have your say below. 1. Lillee produces “one of the most memorable wickets in MCG history”, 1981 Dennis Lillee celebrates the wicket of Viv Richards in the 1981 Boxing Day Test. Lillee took 10 wickets in the match. Dennis Lillee knocking over West Indies great Viv Richards with the final ball of the opening day of the 1981 Boxing Day Test ranks as “one of the most memorable wickets in MCG history”, Mr Studham says. “Richards played on to his stumps, and that left the West Indies at 4/10,” Mr Studham said. “Australia went on to win that match by the 58 runs, knocking the West Indies over for 161 in the last innings.” The wicket capped off a remarkable spell in which Lillee claimed three scalps in a 35-minute period before stumps. He finished the match with 10-127, the seventh and final 10-wicket haul of his career. Australia’s victory ended a West Indies run of 15 Tests without defeat since February 1980. 2. Border and Thomson’s brave ninth-wicket stand, 1982 Allan Border and Jeff Thomson’s valiant ninth-wicket stand just fell short in 1982. Thomson being mobbed by fans at the Boxing Day Test. Allan Border and Jeff Thomson fell agonisingly short of claiming what would have been a remarkable win for Australia against England in the 1982 Boxing Day Test. The pair came together at 9/218, chasing 292, and nearly got there. “On the last day of the Test, we needed 37 runs and England needed one wicket to win,” Mr Studham said. “We ended up with more than 18,000 fans coming along for potentially one ball. And of course, we get 33 runs and then poor Thomson gets what I can only describe as not one of Ian Botham’s best balls that gets delivered the outside the off stump. “Thomson pushes his bat at it, snicks it to Chris Tavaré who flicks it up to be caught by Geoff Miller at slips, and that breaks the hearts of the 18,000 fans at MCG.” Border was stranded at the non-striker’s end on 62 after spending almost four hours at the crease. 3. The longest day in Test cricket history, 1998 Dean Headley was a well-deserved man of the match in the 1998 Boxing Day Test. This dead rubber proved to be such an exciting match that English fans celebrated their unlikely victory “like they’d won the Ashes”, Mr Studham recalls. “The longest day in Test cricket history was the (fourth day of the) 1998 Boxing Day Test,” he said. “We were washed out on the first day, but the fourth day lasted for eight hours and three minutes, because the umpires decided to take an extra half-hour to force a result. It looked like Australia was going to beat England and score the runs they needed. “Then, Dean Headley ran amok and changed the course of the game by taking three wickets in 12 deliveries. We ended up falling apart and losing by 12 runs to England in the last innings, really unexpectedly. “I remember going out to dinner afterwards with a lot of English cricket fans who were out here, and they were so ecstatic that they actually won a match. They were acting like they’d won the Ashes.” Headley took 6/60 in the second innings to achieve his first five-for and be named player of the match. The Balmy army celebrate England's win by crowding on to the MCG field. 4. Warnie gets his 700th Test wicket, 2006 Shane Warne takes his 700th Test wicket during day one of the 2006 Boxing Day Test. Warnie gets carried off by Andrew Symonds and Matthew Hayden. It’s impossible to go past Shane Warne taking his 700th Test scalp when talking about memorable Boxing Day Test moments, Mr Studham says. In the 47th over on day one, Warne deceived Strauss with a quicker, well-pitched up delivery that rattled his middle stump. “When Warnie came in and bowled Andrew Strauss, the whole place just shook,” he said. “He was the first player to capture 700 Test wickets. “We had hoped to break the record of the 90,800 for a day at the MCG, but we only got to 89,155 because it was cold, wet and damp. “Australia ended up winning by an innings in three days.” Warne bowls Strauss for his 700th wicket. It was Warne’s 37th five-wicket haul in a Test match. Mr Studham said the spin king’s hat-trick against England in 1994 was another clear MGC cricket highlight – but it technically took place in a Christmas Eve Test. It was the first Ashes hat-trick in 90 years and capped off by a leaping David Boon catch. “It was my first Test actually working at the MCG – what a match to start with,” he said. 5. Hayden’s record six Boxing Day tons, 2001-2007 Andrew Symonds celebrates his century with Matthew Hayden at the 2006 Boxing Day Test. Matthew Hayden notches a record sixth Boxing Day Test century. Matthew Hayden scored his record sixth Boxing Day Test century against India in 2007, making 124. But Mr Studham considers his 2006 ton, in which he and “Andrew Symonds destroyed England”, to be the most memorable. The star opener reached 153 to add another highlight to the dominant Aussie win also containing Warne’s 700th wicket. Mr Studham said Hayden’s haul was the highest number of Boxing Day centuries scored by one player, but Sir Don Bradman held the record for most MCG tons with nine. He added the Boxing Day Test was formalised by the Australian Cricket Board in 1980. The MCC Library is open to MCC members and guests throughout the Boxing Day Test, and on other days, to anyone who books an MCG Tour. Visitors can check out a special exhibition, 150 Treasures , collated by librarians to celebrate the Library’s 150th birthday. Over summer, these include cricket treasures like the newspaper obituary mourning the “death of English cricket” from which The Ashes was named. Visit: mcc.org.au/mcc-reserve/mcc-library Originally published as The five most memorable Boxing Day Test moments, picked by an MCG historian More related stories Property What do Victorians think is the state’s top home? Property pundits have turned up in force to back in their favourite houses in Victoria, with a surprising result for what they deemed the state’s best. SEE THE LIST Read more Victoria Mixed forecasts for Victoria on Christmas, Carols facing storms Melburnians can have a Christmas roast and pudding in comfort with rain forecast for the 25th, but other parts of the state will be warm and dry. Meanwhile Carols by Candlelight could be hit by thunderstorms. Read more","pubDate":"2023-12-24 01:00:00","image_url":null,"source_id":"cairnspost","source_priority":626680,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"e7339179829a3f18554eba133b21b67b","title":"BBL opts not to reschedule abandoned Geelong game","link":"https://www.perthnow.com.au/sport/cricket/bbl-opts-not-to-reschedule-abandoned-geelong-game-c-13008201","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"A BBL match in Geelong between the Renegades and Scorchers that was abandoned because of the state of the pitch will not be rescheduled.","content":"The abandoned Big Bash League game in Geelong between the Melbourne Renegades and Perth will not be replayed. The match at GMHBA Stadium on December 10 was called off amid farcical scenes after just 6.5 overs because of concerns over the safety of the pitch. Water damage had made the pitch unplayable, with multiple Scorchers batters hit by deliveries before umpires stopped play. BBL authorities confirmed on Sunday the game would not be rescheduled and both teams would receive a point each. \"The circumstances giving rise to the abandoned match remain the subject of an ongoing investigation,\" the BBL statement read. \"While various options to reschedule were explored, it became apparent rescheduling would be challenging due to a variety of factors, including the existing schedule across the two clubs, and limited access to venues.\" Perth are favourites to claim a record third straight BBL title, while the Renegades are winless after losing to the Hobart Hurricanes on Saturday night.","pubDate":"2023-12-24 00:50:49","image_url":"https://images.perthnow.com.au/publication/C-13008201/5443d3b8f9c20238ca4992593815b1dfc2ba3151-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"4cea91a842741a353484d8d4ad6065fb","title":"Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese","link":"https://www.dailymail.co.uk/sport/cricket/article-12897447/iconic-band-six-Prime-Minister-Anthony-Albanese-cricket.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Much-loved Aussie rock and roll band Six and Out have reunited after 20 years and are touring this summer - and fans have got Prime Minister Anthony Albanese to thank for it.","content":"Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese Iconic cricket band Six and Out have reunited The PM recently requested them to play The band will play three gigs this summer By James Cooney For Daily Mail Australia Published: 19:14 EST, 23 December 2023 | Updated: 19:18 EST, 23 December 2023 e-mail 2 View comments Much-loved Aussie rock and roll band Six and Out have reunited after 20 years and are touring this summer - and fans have got Prime Minister Anthony Albanese to thank for it. Six and Out, which is made up of former first-class cricketers Brett Lee, Shane Lee, Gavin Robertson, Brad McNamara and Richard Chee Quee, have decided to get the band back together and go on tour. The rockers, who are best known for their song 'Can't Bowl, Can't Throw', were recently asked to play at Marrickville Lawn Tennis Club by the PM. 'Basically, Mr Albanese's partner, Jodie Haydon , she was a Six and Out fan back in the day when we played, and she asked the PM if he'd contact Binga to ask us to play at the 100th anniversary,' McNamara told News Corp . 'The PM and Binga had had the odd game of tennis together. Cricket star rockers Six and Out will be playing three shows this summer The PM inspired the tour by asking the band to play at the Marrickville Lawn Tennis Club 'It was the catalyst to fire it all up again. It was great. 'It brought back memories. How much fun we had and how much we'd missed it all. It's amazing how quick life passes you by.' The iconic band had so much fun that they decided to go back on tour and are planning three gigs this summer. Brett Lee, who plays bass in the band, likened being on stage to the thrill of playing cricket for Australia. 'When you hit that harmony … I liken it to when you bowl a perfect outswinger,' Lee said. 'I've felt a lot more comfortable playing cricket because I've done it a lot more … it can be very, very nerve wracking when you're on stage. 'It's a great buzz because you're out of your comfort zone but that also brings out this massive adrenaline rush which is why it's such a fun thing to do.' Lee, who travelled the world playing cricket, recently opened up about a secret chamber at the SCG where only legends of the game are allowed to tread. The iconic Aussie band are best known for their hit song 'Can't Bowl, Can't Throw' Speaking on the Hello Sport podcast, Lee revealed the top-secret cellar at the Sydney venue that has been a safe haven for Test players since Bradman brandished the Willow over 70 years ago. 'At the Sydney Cricket Ground, a lot of people don't know — (I'm) giving away a little bit of inside knowledge here,' Lee told the podcast hosts. 'That inner sanctum where we feel comfortable, where there's no press, where we can relax and just speak honestly and openly.' The secret cellar even had a secret knock to gain access. 'After the Test win at the SCG, the tradition is you'll get a cricket bat and go thump thump thump on the floor, three taps. 'Then a few minutes later you'll hear thump thump thump, someone from downstairs in the cellar, which means come downstairs to the cellar. 'So you walk down underneath the change rooms of the Australian players, opposite near where the race is and there's a little garage door. 'You walk inside and it's (tiny) so we reckon it's Justin Langer's house because he fits in beautifully. And there's a door that's been signed by every Test cricketer I think since the 1950s that's in there. 'And it's a cellar. So beers and wine, you get down there and have a chat with some of the ground staff and have a cold beer with them.' Anthony Albanese Jodie Haydon Share or comment on this article: Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-24 00:18:28","image_url":"https://i.dailymail.co.uk/1s/2023/12/24/00/79295005-0-image-a-273_1703376641307.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ded7b3c331a6d20fed23f67b982f9f15","title":"IND vs SA 1st Test: टीम इंडिया के फैंस के लिए गुड न्यूज, टेस्ट मैच से पहले कोहली की हुई वापसी","link":"https://www.abplive.com/sports/cricket/ind-vs-sa-1st-test-virat-kohli-joins-team-india-before-test-match-against-south-africa-2568133","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"<p><strong>India vs South Africa 1st Test:</strong> भारत और दक्षिण अफ्रीका के बीच 26 दिसंबर से टेस्ट सीरीज का आगाज होगा. इसका पहला मैच सेंचुरियन में खेला जाएगा. विराट कोहली फैमिली इमरजेंसी की वजह से भारत लौट आए थे. लेकिन अब खबर आई है कि कोहली टीम इंडिया से जुड़ गए हैं. मीडिया रिपोर्ट्स के मुताबिक कोहली के जाने को लेकर भारतीय क्रिकेट कंट्रोल बोर्ड को पहले से ही जानकारी थी. हालांकि टीम के लिए अच्छी बात यह है कि उनकी वापसी हो चुकी है. कोहली सेंचुरियन में होने वाले मुकाबले में हिस्सा लेंगे.</p> <p>&nbsp;</p> <p>अपडेट जारी है...</p> <p><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/mitchell-starc-reveals-real-reason-behind-not-playing-ipl-since-2015-here-know-latest-sports-news-2568061\">Mitchell Starc: आईपीएल 2015 में आखिरी बार दिखे थे मिचेल स्टार्क, फिर 7 सीजन क्यों नहीं खेले? खुद बताई वजह</a></strong></p>","content":"India vs South Africa 1st Test: भारत और दक्षिण अफ्रीका के बीच 26 दिसंबर से टेस्ट सीरीज का आगाज होगा. इसका पहला मैच सेंचुरियन में खेला जाएगा. विराट कोहली फैमिली इमरजेंसी की वजह से भारत लौट आए थे. लेकिन अब खबर आई है कि कोहली टीम इंडिया से जुड़ गए हैं. मीडिया रिपोर्ट्स के मुताबिक कोहली के जाने को लेकर भारतीय क्रिकेट कंट्रोल बोर्ड को पहले से ही जानकारी थी. हालांकि टीम के लिए अच्छी बात यह है कि उनकी वापसी हो चुकी है. कोहली सेंचुरियन में होने वाले मुकाबले में हिस्सा लेंगे. न्यूज 18 की एक खबर के मुताबिक कोहली टीम इंडिया से जुड़ गए हैं. वे अचानक नहीं गए थे. बीसीसीआई को कोहली के जाने को लेकर पहले से जानकारी थी. अहम बात यह है कि कोहली फैमिली इमरजेंसी की वजह से नहीं गए थे. वे लंदन गए थे. उनके प्लान को लेकर बोर्ड को पूरी जानकारी थी. यह अचानक लिया गया फैसला नहीं था. कोहली जल्द ही टेस्ट मैच के लिए प्रैक्टिस शुरू करेंगे. अपडेट जारी है... googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); यह भी पढ़ें : Mitchell Starc: आईपीएल 2015 में आखिरी बार दिखे थे मिचेल स्टार्क, फिर 7 सीजन क्यों नहीं खेले? खुद बताई वजह","pubDate":"2023-12-24 02:10:33","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/83484918a8da61dc582bbdd5b768bf541703383816327344_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"271e22006f3eedd67fd9619ddaccd937","title":"Aussies eye Christmas miracle as one-off India Test comes down to thrilling finale: LIVE","link":"https://www.foxsports.com.au/cricket/australia/cricket-2023-australia-vs-india-womens-test-live-updates-aussies-eye-christmas-miracle-on-final-day/news-story/0af45ab332602daf9b9b1bb0820ec30d","keywords":null,"creator":null,"video_url":null,"description":"Australia will need something of a Christmas (Eve) miracle on the fourth and final day to claim victory in their one-off Test against India.","content":"Australia will need something of a Christmas (Eve) miracle on the fourth and final day to claim victory in their one-off Test against India. Australia enter the final day (3pm AEDT) with a 46-run lead, with the score 5-233 in Australia’s second innings. India piled on 406 runs (their highest total against Australia) to take a 187-run lead after the first innings, and Australia will need their lower order to fire – and then bowl out India quickly – to avoid a first-ever defeat to India. Watch India v Australia Women’s Series LIVE and exclusive to Fox Sports on Kayo. New to Kayo? Start Your Free Trial Today > McGrath leads huge day 3 showing | 03:05 DAY THREE REPORT: Horror brain fade as Australian fightback sets up thrilling final day Annabel Sutherland (12* off 67) and Ash Gardner (7*) will hope to survive against a rampant India bowling attack at Wankhede Stadium. Ellyse Perry told reporters on Saturday afternoon that staying “present” in the moment was key to Australia’s success. “We’ve just grown into this Test match a little bit and adjusted to the conditions as we’ve gone,” the all-rounder said. “Today, I think there was a really clear plan there – obviously with the position of the game, it was just for us to bat for as long as we possibly could, and just to play what was in front of us without too much of a mind on what’s going to happen down the track. “I think having that focus on the present was really helpful for all of us and I thought there were some really good patches and partnerships from us. “As individual batters within our group, we all play a little bit differently so all of us have a slightly different method, but the big message today was just to be really strong in our conviction to those methods.” Day four gets underway at 3pm AEDT. MATCH CENTRE: India vs Australia women’s Test scorecard LIVE LIVE BLOG Follow the action in our live blog below!","pubDate":"2023-12-24 01:56:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5284db45f8349b06308f22e0833ae913","title":"रोहित-विराट और कौन? जब साउथ अफ्रीका पर हुई थी डबल सेंचुरी की बारिश","link":"https://hindi.news18.com/cricket/ind-vs-sa-test-3-batsmen-including-rohit-sharma-and-virat-kohli-had-scored-double-centuries-against-south-africa-7926135.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA Test: टीम इंडिया टेस्ट सीरीज में साउथ अफ्रीका को उसके घर में टक्कर देने के लिए तैयार है. दोनों टीमें पहले टेस्ट में 26 दिसंबर को आमने-सामने होंगी. 4 साल पहले टीम इंडिया के 3 बल्लेबाजों ने इस टीम के खिलाफ रनों का अंबार खड़ा कर दिया था.","content":"साउथ अफ्रीका के खिलाफ भारत पहला टेस्ट 26 दिसंबर को खेलेगा. (AP) नई दिल्ली. रोहित शर्मा (Rohit Sharma), टीम इंडिया के वो बल्लेबाज जिनका दोहरे शतक से एक अलग रिश्ता है. वनडे क्रिकेट में रोहित सबसे ज्यादा दोहरे शतक लगाने वाले बल्लेबाज हैं. लेकिन कई बार टेस्ट में भी हिटमैन ने बल्ले से धमाल मचाया है. दूसरी ओर विराट भी इस टीम के खिलाफ बल्ले से हल्ला बोलते नजर आए थे. लेकिन इन दोनों के साथ मिलकर एक और बल्लेबाज था जिसने साउथ अफ्रीका के खिलाफ रनों का अंबार खड़ा कर दिया था. 4 साल पहले साउथ अफ्रीका की टीम भारत दौरे पर थी. भारत के खिलाफ मेहमान टीम को 3 टेस्ट की सीरीज खेलनी थी और टीम की कमान दिग्गज फाफ डु प्लेसी के हाथों में थी. वहीं, टीम इंडिया की कप्तान स्टार बल्लेबाज विराट कोहली संभाल रहे थे. इस सीरीज के पहले ही मुकाबले से भारतीय बल्लेबाजों ने रनों की बौछार कर दी. पहले टेस्ट की पहली पारी में सलामी बल्लेबाज मयंक अग्रवाल और रोहित शर्मा थे. एक तरफ मयंक अग्रवाल ने 215 रन ठोक डाले. दूसरी ओर हिटमैन भी डबल सेंचुरी की तरफ तेजी से बढ़ते नजर आ रहे थे. लेकिन बदकिस्मती से रोहित 176 रन पर अपना विकेट गंवा बैठे. जब दूसरी पारी आई तो मयंक का बल्ला खामोश रहा लेकिन रोहित नहीं रुके. हिटमैन ने 127 रन की ताबड़तोड़ पारी को अंजाम दिया. भारत ने पहली पारी में 523 जबकि दूसरी पारी में 323 रन ठोके, इन दमदार पारियों की बदौलत टीम इंडिया ने इस मैच को 203 रन से अपने नाम कर लिया था. दूसरे टेस्ट मयंक और कोहली ने बोला हल्ला मेहमान टीम के खिलाफ दूसरे टेस्ट में मयंक अग्रवाल का बल्ला फिर बोला. उन्होंने 108 रन की शानदार पारी खेली. चौथे नंबर पर आए कप्तान कोहली ने भी इस मैच में रनों की बौछार कर दी. उन्होंने 254 रन की पहाड़नुमा पारी खेली और टीम को 500 के पार पहुंचा दिया. इसके अलावा जडेजा ने भी बहती गंगा में हाथ धोए लेकिन शतक से महज 9 रन दूर रह गए. टीम इंडिया ने 601 रन का पहाड़ साउथ अफ्रीका के सामने रखा. दूसरी तरफ अफ्रीकी टीम दोनों पारियों में 275 और 189 रन पर ही सिमट गई. भारत ने इस मुकाबले को 137 रन से जीता. भारत को टेस्ट सीरीज नहीं जीतने देगा साउथ अफ्रीका, कोच ने दे डाली चेतावनी, सर्वश्रेष्ठ प्रदर्शन नहीं करने देंगे तीसरे टेस्ट में रोहित का कहर तीसरे और आखिरी टेस्ट में न तो मयंक चले और न कोहली. इस मैच में रोहित शर्मा अफ्रीकी टीम के सामने दीवार बन गए. हिटमैन ने महज 255 गेंद में 212 रन ठोक दिए. भारतीय टीम ने 497 रन का विशाल स्कोर बनाया, जिसमें अजिंक्य रहाणे के दमदार शतक ने भी अहम योगदान दिया. मेहमान टीम 162 और 133 रन पर दोनों पारियों में सिमट गई और भारत ने 202 रन से मैच जीतकर सीरीज अपने नाम की. . Tags: Ind vs sa , Mayank agarwal , Team india , Virat Kohli असल में ऐसा दिखता है सांता क्लॉज, AI ने दिखाया असली चेहरा, लोगों ने कहा-एनिमल का अबरार कभी गैराज में गुजारी थी रातें, काम के लिए एक्ट्रेस के घर के भी खाए थे धक्के, सुपरस्टार की भाई ने लगाई थी नैया पार मात्र 3000-4500 रुपए में लें जंगल सफारी सहित नेपाल के पर्यटन स्थलों का मजा, ऐसे बुक करें टिकट लाइव ब्लॉग 3 days ago 3 days ago 4 days ago 5 days ago","pubDate":"2023-12-24 01:52:13","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/virat-kohli-in-test-vs-wi-2023-12-920fb46b40309e579bbecd4b4124e523-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ff6346641fc165973071b2e759c8ce6d","title":"Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama","link":"https://www.dailymail.co.uk/sport/cricket/article-12897579/Marcus-Stoinis-controversial-act-Tom-Curran-BBL-drama-cricket.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Footage has emerged of Melbourne Stars captain Marcus Stoinis doing a similar run-through on the pitch to what sparked an incident recently with English cricketer Tom Curran.","content":"Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama Footage shows Stoinis performing run-through before match Players aren't allowed to run onto the pitch before a game Curran was suspended for charging at an umpire By James Cooney For Daily Mail Australia Published: 20:43 EST, 23 December 2023 | Updated: 20:45 EST, 23 December 2023 e-mail View comments Footage has emerged of Melbourne Stars captain Marcus Stoinis doing a similar run-through on the pitch to what sparked an incident recently with English cricketer Tom Curran. Curran was suspended for four Big Big League matches after vision emerged of him charging in toward an umpire at full stride before launching a verbal tirade prior to the match against the Hobart Hurricanes. The umpire instructed Curran to not run on the wicket during his warm up, in line with the laws of the game, and stood in his way to prevent him from running onto the pitch. While the vision clearly shows Curran running at the umpire, his skipper Henriques has gone in to bat for him and challenged the level three offence under the code of conduct for intimidating an umpire. The controversial incident took another twist when reporter Tom Decent posted video of Stoinis doing a similar pre-match run-through onto the pitch on December 13 - though not running at an umpire. The vision everyone's been waiting for. This is the series of events that's led to Tom Curran's four-game suspension... pic.twitter.com/CRcBujbIl0 — 7Cricket (@7Cricket) December 21, 2023 Not providing an opinion or condoning what Tom Curran did the other night. Just a clip to show that during this year’s Big Bash there have been instances of players doing run-throughs on the pitch before a game. Umpire was right there. Appeal will be interesting. pic.twitter.com/R9F6FDKaV7 — Tom Decent (@tomdecent) December 23, 2023 Stoinis, as the captain, is allowed by the rules of cricket to inspect the pitch before the match - but he isn't allowed to run onto it to practice a run-up. 'Not providing an opinion or condoning what Tom Curran did the other night,' wrote Decent. 'Just a clip to show that during this year's Big Bash there have been instances of players doing run-throughs on the pitch before a game. 'Umpire was right there. Appeal will be interesting.' Some cricket fans replied to Decent's post to point out that the English paceman had been suspended for intimidation of an official, while others questioned why Stoinis wasn't told to stop by the umpire. Curran's charges specifically cite 'intimidation or attempted intimidation of an Umpire, Match Referee, or Medical Personnel, whether by language or conduct (including gestures).' Curran was instructed not to enter the pitch, then went to the other end to complete another practice run-up. 'You can run here, but not here,' the umpire could be heard telling Curran, also using his arms to show where he can run. Stoinis was spotted doing a run-through onto the pitch pre-match, which isn't allowed Curran has been suspended for four Big Big League matches after vision emerged of him charging in toward an umpire at full stride before launching a verbal tirade Curran then attempted to perform a practice run-up and steamed in at pace straight towards the umpire, who stood in the bowling crease facing him. Making his actions even worse, Curran then turned to deliver a spray to the umpire. Channel Nine journalist Tom Morris revealed what he said on SEN: 'Word for word, Tom Curran to the fourth umpire after he ran past him: \"If you stand in the way I have nowhere go, you f***head.' Curran's actions in the video have been widely slammed by cricket fans, with many saying the penalty is too lenient and lashing the Sixers for appealing the four-match ban. Former Australian pace bowler Merv Hughes led the calls, posting: 'So they should appeal….. I don’t think the four game suspension is anywhere near harsh enough!!!! Should have got 10!!' 'Should be banned for the whole season,' one fan posted. 'For appealing it they should add 4 more games and the sixes to be deducted points, appealing means they condone this behavior,' added another. 'Send him home. Tear up his contract, don’t appeal the decision,' posted another. Melbourne Share or comment on this article: Melbourne Stars captain Marcus Stoinis spotted doing controversial act amid Tom Curran BBL drama e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-24 01:45:48","image_url":"https://i.dailymail.co.uk/1s/2023/12/24/01/79296293-0-image-a-287_1703381926031.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ac989afac1d2e06ddd1e36dcb2c5ace3","title":"Indian Team: ਟੀਮ ਇੰਡੀਆ 'ਤੇ ਮੰਡਰਾ ਰਿਹਾ ਵੱਡਾ ਖਤਰਾ, ਇਨ੍ਹਾਂ ਖਿਡਾਰੀਆਂ ਦੀ ਗੈਰਮੌਜੂਦਗੀ ਵਿਗਾੜ ਸਕਦੀ ਖੇਡ","link":"https://punjabi.abplive.com/sports/cricket/indian-cricket-team-4-player-injured-before-t20-world-cup-2024-know-health-update-766706","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>Injured Indian Player Before T20 World Cup 2024:</strong> ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਨੇ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੇ ਗਏ ਇੱਕ ਰੋਜ਼ਾ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੇ ਫਾਈਨਲ ਵਿੱਚ ਆਸਟਰੇਲੀਆ ਤੋਂ ਹਾਰ ਗਈ ਸੀ। ਹੁਣ ਪ੍ਰਸ਼ੰਸਕ ਉਮੀਦ ਕਰ ਰਹੇ ਹਨ ਕਿ ਟੀਮ ਇੰਡੀਆ 2024 'ਚ ਹੋਣ ਵਾਲਾ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਜਿੱਤੇਗੀ। ਪਰ ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਭਾਰਤੀ ਟੀਮ ਦੇ 4 ਸਟਾਰ ਖਿਡਾਰੀ ਜ਼ਖਮੀ ਹੋ ਚੁੱਕੇ ਹਨ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੱਟ ਨੂੰ ਲੈ ਕੇ ਅਜੇ ਤੱਕ ਕੋਈ ਅਧਿਕਾਰਤ ਅਪਡੇਟ ਨਹੀਂ ਆਇਆ ਹੈ। ਜ਼ਖ਼ਮੀ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਵਿੱਚ ਮੁਹੰਮਦ ਸ਼ਮੀ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ, ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਅਤੇ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਸ਼ਾਮਲ ਹਨ।</p> <p><strong>1- ਹਾਰਦਿਕ ਪਾਂਡਿਆ</strong></p> <p>ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਦੇ ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ। ਹਾਰਦਿਕ ਨੂੰ ਟੂਰਨਾਮੈਂਟ 'ਚ ਬੰਗਲਾਦੇਸ਼ ਖਿਲਾਫ ਖੇਡੇ ਗਏ ਮੈਚ 'ਚ ਅੱਡੀ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਉਹ ਹੁਣ ਤੱਕ ਵਾਪਸੀ ਨਹੀਂ ਕਰ ਸਕੇ ਹਨ।</p> <p><strong>2- ਮੁਹੰਮਦ ਸ਼ਮੀ</strong></p> <p><br />ਹਾਲ ਹੀ 'ਚ ਭਾਰਤੀ ਧਰਤੀ 'ਤੇ ਖੇਡੇ ਗਏ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 'ਚ ਮੁਹੰਮਦ ਸ਼ਮੀ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ ਵਿਕਟਾਂ ਲੈਣ ਵਾਲੇ ਗੇਂਦਬਾਜ਼ ਸਨ। ਸ਼ਮੀ ਨੇ 7 ਮੈਚਾਂ 'ਚ 10.71 ਦੀ ਸ਼ਾਨਦਾਰ ਔਸਤ ਨਾਲ 24 ਵਿਕਟਾਂ ਲਈਆਂ। ਸ਼ਮੀ ਦੇ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਉਹ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੈਸਟ ਸੀਰੀਜ਼ ਤੋਂ ਬਾਹਰ ਹੋ ਗਿਆ ਸੀ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਸ਼ਮੀ ਨੂੰ ਟੈਸਟ ਟੀਮ 'ਚ ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ ਸੀ ਪਰ ਫਿਰ ਬੀਸੀਸੀਆਈ ਨੇ ਅਪਡੇਟ ਦਿੰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਸੱਟ ਕਾਰਨ ਉਹ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਹਿੱਸਾ ਨਹੀਂ ਹੋਣਗੇ।</p> <p><strong>3- ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ</strong></p> <p>ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਤੋਂ ਬਾਅਦ, ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਨੇ ਆਸਟ੍ਰੇਲੀਆ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੀ-20 ਸੀਰੀਜ਼ 'ਚ ਭਾਰਤ ਦੀ ਕਮਾਨ ਸੰਭਾਲੀ। ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਤੀਜੇ ਟੀ-20 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਨੂੰ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ। ਸੂਰਿਆ ਨੂੰ ਗਰੇਡ-2 ਦੀ ਸੱਟ ਲੱਗੀ ਹੈ। ਹਾਲਾਂਕਿ ਅਜੇ ਤੱਕ ਸੂਰਿਆ ਦੀ ਸੱਟ ਬਾਰੇ ਕੋਈ ਅਧਿਕਾਰਤ ਜਾਣਕਾਰੀ ਨਹੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ <a title=\"ਟੀਮ ਇੰਡੀਆ\" href=\"https://punjabi.abplive.com/topic/indian-cricket-team\" data-type=\"interlinkingkeywords\">ਟੀਮ ਇੰਡੀਆ</a> ਲਈ ਵੱਡੀ ਸਮੱਸਿਆ ਹੋ ਸਕਦੀ ਹੈ। ਸੂਰਿਆ ਭਾਰਤੀ ਟੀ-20 ਟੀਮ ਦਾ ਅਹਿਮ ਖਿਡਾਰੀ ਹੈ।</p> <p><strong>4- ਰੁਤੂਰਾਜ ਗਾਇਕਵਾੜ</strong></p> <p>ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੀ ਗਈ ਇੱਕ ਰੋਜ਼ਾ ਲੜੀ ਵਿੱਚ ਭਾਰਤੀ ਟੀਮ ਦਾ ਹਿੱਸਾ ਸੀ। ਸੀਰੀਜ਼ ਦੇ ਦੂਜੇ ਵਨਡੇ 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਦੇ ਸੱਜੇ ਹੱਥ ਦੀ ਮੁੰਦਰੀ 'ਚ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਗਾਇਕਵਾੜ ਬਾਕੀ ਦੇ ਅਫਰੀਕਾ ਦੌਰੇ ਤੋਂ ਬਾਹਰ ਹੋ ਗਏ ਹਨ।</p>","content":"Injured Indian Player Before T20 World Cup 2024: ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਨੇ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੇ ਗਏ ਇੱਕ ਰੋਜ਼ਾ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੇ ਫਾਈਨਲ ਵਿੱਚ ਆਸਟਰੇਲੀਆ ਤੋਂ ਹਾਰ ਗਈ ਸੀ। ਹੁਣ ਪ੍ਰਸ਼ੰਸਕ ਉਮੀਦ ਕਰ ਰਹੇ ਹਨ ਕਿ ਟੀਮ ਇੰਡੀਆ 2024 'ਚ ਹੋਣ ਵਾਲਾ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਜਿੱਤੇਗੀ। ਪਰ ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਭਾਰਤੀ ਟੀਮ ਦੇ 4 ਸਟਾਰ ਖਿਡਾਰੀ ਜ਼ਖਮੀ ਹੋ ਚੁੱਕੇ ਹਨ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੱਟ ਨੂੰ ਲੈ ਕੇ ਅਜੇ ਤੱਕ ਕੋਈ ਅਧਿਕਾਰਤ ਅਪਡੇਟ ਨਹੀਂ ਆਇਆ ਹੈ। ਜ਼ਖ਼ਮੀ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਵਿੱਚ ਮੁਹੰਮਦ ਸ਼ਮੀ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ, ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਅਤੇ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਸ਼ਾਮਲ ਹਨ। 1- ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਭਾਰਤੀ ਕ੍ਰਿਕਟ ਟੀਮ ਦੇ ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪਾਂਡਿਆ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ। ਹਾਰਦਿਕ ਨੂੰ ਟੂਰਨਾਮੈਂਟ 'ਚ ਬੰਗਲਾਦੇਸ਼ ਖਿਲਾਫ ਖੇਡੇ ਗਏ ਮੈਚ 'ਚ ਅੱਡੀ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਉਹ ਹੁਣ ਤੱਕ ਵਾਪਸੀ ਨਹੀਂ ਕਰ ਸਕੇ ਹਨ। 2- ਮੁਹੰਮਦ ਸ਼ਮੀ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਹਾਲ ਹੀ 'ਚ ਭਾਰਤੀ ਧਰਤੀ 'ਤੇ ਖੇਡੇ ਗਏ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 'ਚ ਮੁਹੰਮਦ ਸ਼ਮੀ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ ਵਿਕਟਾਂ ਲੈਣ ਵਾਲੇ ਗੇਂਦਬਾਜ਼ ਸਨ। ਸ਼ਮੀ ਨੇ 7 ਮੈਚਾਂ 'ਚ 10.71 ਦੀ ਸ਼ਾਨਦਾਰ ਔਸਤ ਨਾਲ 24 ਵਿਕਟਾਂ ਲਈਆਂ। ਸ਼ਮੀ ਦੇ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਉਹ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੈਸਟ ਸੀਰੀਜ਼ ਤੋਂ ਬਾਹਰ ਹੋ ਗਿਆ ਸੀ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਸ਼ਮੀ ਨੂੰ ਟੈਸਟ ਟੀਮ 'ਚ ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ ਸੀ ਪਰ ਫਿਰ ਬੀਸੀਸੀਆਈ ਨੇ ਅਪਡੇਟ ਦਿੰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਸੱਟ ਕਾਰਨ ਉਹ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਹਿੱਸਾ ਨਹੀਂ ਹੋਣਗੇ। 3- ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਤੋਂ ਬਾਅਦ, ਸੂਰਿਆ ਕੁਮਾਰ ਯਾਦਵ ਨੇ ਆਸਟ੍ਰੇਲੀਆ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਟੀ-20 ਸੀਰੀਜ਼ 'ਚ ਭਾਰਤ ਦੀ ਕਮਾਨ ਸੰਭਾਲੀ। ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਤੀਜੇ ਟੀ-20 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਨੂੰ ਗਿੱਟੇ 'ਤੇ ਸੱਟ ਲੱਗ ਗਈ ਸੀ। ਸੂਰਿਆ ਨੂੰ ਗਰੇਡ-2 ਦੀ ਸੱਟ ਲੱਗੀ ਹੈ। ਹਾਲਾਂਕਿ ਅਜੇ ਤੱਕ ਸੂਰਿਆ ਦੀ ਸੱਟ ਬਾਰੇ ਕੋਈ ਅਧਿਕਾਰਤ ਜਾਣਕਾਰੀ ਨਹੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀ-20 ਵਿਸ਼ਵ ਕੱਪ ਤੋਂ ਪਹਿਲਾਂ ਟੀਮ ਇੰਡੀਆ ਲਈ ਵੱਡੀ ਸਮੱਸਿਆ ਹੋ ਸਕਦੀ ਹੈ। ਸੂਰਿਆ ਭਾਰਤੀ ਟੀ-20 ਟੀਮ ਦਾ ਅਹਿਮ ਖਿਡਾਰੀ ਹੈ। 4- ਰੁਤੂਰਾਜ ਗਾਇਕਵਾੜ ਰੁਤੁਰਾਜ ਗਾਇਕਵਾੜ ਦੱਖਣੀ ਅਫਰੀਕਾ ਖਿਲਾਫ ਹਾਲ ਹੀ ਵਿੱਚ ਖੇਡੀ ਗਈ ਇੱਕ ਰੋਜ਼ਾ ਲੜੀ ਵਿੱਚ ਭਾਰਤੀ ਟੀਮ ਦਾ ਹਿੱਸਾ ਸੀ। ਸੀਰੀਜ਼ ਦੇ ਦੂਜੇ ਵਨਡੇ 'ਚ ਫੀਲਡਿੰਗ ਕਰਦੇ ਸਮੇਂ ਉਨ੍ਹਾਂ ਦੇ ਸੱਜੇ ਹੱਥ ਦੀ ਮੁੰਦਰੀ 'ਚ ਸੱਟ ਲੱਗ ਗਈ ਸੀ, ਜਿਸ ਤੋਂ ਬਾਅਦ ਗਾਇਕਵਾੜ ਬਾਕੀ ਦੇ ਅਫਰੀਕਾ ਦੌਰੇ ਤੋਂ ਬਾਹਰ ਹੋ ਗਏ ਹਨ।","pubDate":"2023-12-24 01:41:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/35affca015e6ba31155cb01bbfff35ec1703382049987709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"603da2e57bac72a93e53dde76ad9c0a4","title":"LLC: ਲੀਜੈਂਡਜ਼ ਲੀਗ ਨੇ Viewership 'ਚ ਬਣਾਇਆ ਵੱਡਾ ਰਿਕਾਰਡ! ਵਿਸ਼ਵ ਭਰ ਵਿੱਚ ਬੈਠੇ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇੰਝ ਦਿੱਤਾ ਪਿਆਰ","link":"https://punjabi.abplive.com/sports/cricket/legends-league-cricket-is-live-viewership-landmark-of-300-million-globally-for-season-2-know-details-766705","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>Legends League Cricket Viewership:</strong> ਹਾਲ ਹੀ 'ਚ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦਾ ਦੂਜਾ ਸੀਜ਼ਨ ਖੇਡਿਆ ਗਿਆ। 22 ਦਿਨਾਂ ਤੱਕ ਚੱਲੇ ਇਸ ਟੂਰਨਾਮੈਂਟ ਵਿੱਚ 19 ਮੈਚ ਖੇਡੇ ਗਏ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਨੇ ਦਰਸ਼ਕਾਂ ਦੀ ਗਿਣਤੀ ਦਾ ਨਵਾਂ ਰਿਕਾਰਡ ਬਣਾਇਆ ਹੈ। ਦਰਅਸਲ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਸੀਜ਼ਨ-2 ਨੂੰ ਦੁਨੀਆ ਭਰ ਦੇ 30 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਨੇ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦੀ ਸਫਲਤਾ 'ਤੇ ਆਪਣੀ ਪ੍ਰਤੀਕਿਰਿਆ ਦਿੱਤੀ। ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਆਪਣੇ ਆਪ ਵਿੱਚ ਵਿਲੱਖਣ ਹੈ। ਇਸ ਦੇ ਤਹਿਤ ਪ੍ਰਸ਼ੰਸਕ ਰਾਸ਼ਟਰੀ ਅਤੇ ਅੰਤਰਰਾਸ਼ਟਰੀ ਕ੍ਰਿਕਟਰਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਸਕਣਗੇ।</p> <p><strong>&nbsp;ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਕੀ ਬੋਲੇ ?</strong></p> <p>ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਭਾਰਤ ਤੋਂ ਇਲਾਵਾ ਅਸੀਂ ਆਪਣੇ ਗਲੋਬਲ ਬ੍ਰਾਡਕਾਸਟਿੰਗ ਪਾਰਟਨਰਜ਼ ਦਾ ਧੰਨਵਾਦ ਕਰਨਾ ਚਾਹਾਂਗੇ, ਜਿਨ੍ਹਾਂ ਦੀ ਬਦੌਲਤ ਕਰੋੜਾਂ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਆਪਣੇ ਘਰਾਂ 'ਚ ਟੂਰਨਾਮੈਂਟ ਲਾਈਵ ਦੇਖਿਆ। ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦਾ ਦਾਇਰਾ ਭਾਰਤ ਸਮੇਤ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਲਗਾਤਾਰ ਵਧ ਰਿਹਾ ਹੈ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕ ਆਪਣੇ ਚਹੇਤੇ ਦਿੱਗਜਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਰਹੇ ਹਨ। ਦਰਅਸਲ, ਇਸ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਦੁਨੀਆ ਦੇ ਕਈ ਦੇਸ਼ਾਂ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਭਾਸ਼ਾਵਾਂ ਵਿੱਚ ਲਾਈਵ ਦੇਖਿਆ ਗਿਆ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ, ਫੈਨਕੋਡ, ਈਐਸਪੀਐਨ+ ਅਤੇ ਵਿਲੋ ਟੀਵੀ ਸਮੇਤ ਕਈ ਪਲੇਟਫਾਰਮਾਂ 'ਤੇ ਦੇਖਿਆ।</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">In these 66 seconds, we tried to capture our consistency with hardwork, persistence, performance, progress and achievements. We just didn&rsquo;t stop dreaming of success, we have been working on it. Another step forward, we@llct20 thank all the fans and well wishers. Now the next stop&hellip; <a href=\"https://t.co/TtFuPAxr8U\">pic.twitter.com/TtFuPAxr8U</a></p> &mdash; Raman Raheja (@ramanraheja) <a href=\"https://twitter.com/ramanraheja/status/1738551981323809192?ref_src=twsrc%5Etfw\">December 23, 2023</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p><strong>ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ</strong></p> <p>ਇਸ ਸੀਜ਼ਨ ਵਿੱਚ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ, ਜਦੋਂ ਕਿ ਦੁਨੀਆ ਭਰ ਦੇ 300 ਮਿਲੀਅਨ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਲਾਈਵ ਦੇਖਿਆ। ਲਾਈਵ ਪ੍ਰਸ਼ੰਸਕਾਂ ਵਿੱਚ ਪਿਛਲੇ ਸੀਜ਼ਨ ਦੇ ਮੁਕਾਬਲੇ 80 ਪ੍ਰਤੀਸ਼ਤ ਦਾ ਵਾਧਾ ਹੋਇਆ ਹੈ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਇਸ ਵਾਰ ਟੀਵੀਆਰ ਪਹਿਲਾਂ ਦੇ ਮੁਕਾਬਲੇ 15 ਫੀਸਦੀ ਵਧਿਆ ਹੈ। ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਦੁਨੀਆ ਭਰ ਵਿੱਚ 1.56 ਬਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਡਿਜੀਟਲ ਪਲੇਟਫਾਰਮ 'ਤੇ ਦੇਖਿਆ ਹੈ। ਜਦੋਂ ਕਿ 182 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਟੈਲੀਵਿਜ਼ਨ ਰਾਹੀਂ ਦੇਖਿਆ। ਇਸ ਤਰ੍ਹਾਂ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਦੇਖੇ ਜਾਣ ਵਾਲੇ ਖੇਡ ਮੁਕਾਬਲਿਆਂ ਵਿੱਚੋਂ ਇੱਕ ਬਣ ਗਿਆ ਹੈ।</p> <p>ਨੋਟ: ਪੰਜਾਬੀ ਦੀਆਂ ਬ੍ਰੇਕਿੰਗ ਖ਼ਬਰਾਂ ਪੜ੍ਹਨ ਲਈ ਤੁਸੀਂ ਸਾਡੇ ਐਪ ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।ਜੇ ਤੁਸੀਂ ਵੀਡੀਓ ਵੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ABP ਸਾਂਝਾ ਦੇ YouTube ਚੈਨਲ ਨੂੰ Subscribe ਕਰ ਲਵੋ। ABP ਸਾਂਝਾ ਸਾਰੇ ਸੋਸ਼ਲ ਮੀਡੀਆ ਪਲੇਟਫਾਰਮਾਂ ਤੇ ਉਪਲੱਬਧ ਹੈ। ਤੁਸੀਂ ਸਾਨੂੰ ਫੇਸਬੁੱਕ, ਟਵਿੱਟਰ, ਕੂ, ਸ਼ੇਅਰਚੈੱਟ ਅਤੇ ਡੇਲੀਹੰਟ 'ਤੇ ਵੀ ਫੋਲੋ ਕਰ ਸਕਦੇ ਹੋ।</p> <p>&nbsp;</p> <p>&nbsp;</p>","content":"Legends League Cricket Viewership: ਹਾਲ ਹੀ 'ਚ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦਾ ਦੂਜਾ ਸੀਜ਼ਨ ਖੇਡਿਆ ਗਿਆ। 22 ਦਿਨਾਂ ਤੱਕ ਚੱਲੇ ਇਸ ਟੂਰਨਾਮੈਂਟ ਵਿੱਚ 19 ਮੈਚ ਖੇਡੇ ਗਏ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਨੇ ਦਰਸ਼ਕਾਂ ਦੀ ਗਿਣਤੀ ਦਾ ਨਵਾਂ ਰਿਕਾਰਡ ਬਣਾਇਆ ਹੈ। ਦਰਅਸਲ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਸੀਜ਼ਨ-2 ਨੂੰ ਦੁਨੀਆ ਭਰ ਦੇ 30 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਨੇ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦੀ ਸਫਲਤਾ 'ਤੇ ਆਪਣੀ ਪ੍ਰਤੀਕਿਰਿਆ ਦਿੱਤੀ। ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਆਪਣੇ ਆਪ ਵਿੱਚ ਵਿਲੱਖਣ ਹੈ। ਇਸ ਦੇ ਤਹਿਤ ਪ੍ਰਸ਼ੰਸਕ ਰਾਸ਼ਟਰੀ ਅਤੇ ਅੰਤਰਰਾਸ਼ਟਰੀ ਕ੍ਰਿਕਟਰਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਸਕਣਗੇ। ਸੀਈਓ ਰਮਨ ਰਹੇਜਾ ਕੀ ਬੋਲੇ ? ਰਮਨ ਰਹੇਜਾ ਨੇ ਕਿਹਾ ਕਿ ਭਾਰਤ ਤੋਂ ਇਲਾਵਾ ਅਸੀਂ ਆਪਣੇ ਗਲੋਬਲ ਬ੍ਰਾਡਕਾਸਟਿੰਗ ਪਾਰਟਨਰਜ਼ ਦਾ ਧੰਨਵਾਦ ਕਰਨਾ ਚਾਹਾਂਗੇ, ਜਿਨ੍ਹਾਂ ਦੀ ਬਦੌਲਤ ਕਰੋੜਾਂ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਆਪਣੇ ਘਰਾਂ 'ਚ ਟੂਰਨਾਮੈਂਟ ਲਾਈਵ ਦੇਖਿਆ। ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਦਾ ਦਾਇਰਾ ਭਾਰਤ ਸਮੇਤ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਲਗਾਤਾਰ ਵਧ ਰਿਹਾ ਹੈ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕ ਆਪਣੇ ਚਹੇਤੇ ਦਿੱਗਜਾਂ ਨੂੰ ਫਿਰ ਤੋਂ ਮੈਦਾਨ 'ਤੇ ਦੇਖ ਰਹੇ ਹਨ। ਦਰਅਸਲ, ਇਸ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਦੁਨੀਆ ਦੇ ਕਈ ਦੇਸ਼ਾਂ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਭਾਸ਼ਾਵਾਂ ਵਿੱਚ ਲਾਈਵ ਦੇਖਿਆ ਗਿਆ। ਕ੍ਰਿਕਟ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ, ਫੈਨਕੋਡ, ਈਐਸਪੀਐਨ+ ਅਤੇ ਵਿਲੋ ਟੀਵੀ ਸਮੇਤ ਕਈ ਪਲੇਟਫਾਰਮਾਂ 'ਤੇ ਦੇਖਿਆ। In these 66 seconds, we tried to capture our consistency with hardwork, persistence, performance, progress and achievements. We just didn’t stop dreaming of success, we have been working on it. Another step forward, we@llct20 thank all the fans and well wishers. Now the next stop… pic.twitter.com/TtFuPAxr8U googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — Raman Raheja (@ramanraheja) December 23, 2023 ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ ਇਸ ਸੀਜ਼ਨ ਵਿੱਚ ਟੂਰਨਾਮੈਂਟ ਨੂੰ ਭਾਰਤ ਵਿੱਚ 170 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਲਾਈਵ ਦੇਖਿਆ, ਜਦੋਂ ਕਿ ਦੁਨੀਆ ਭਰ ਦੇ 300 ਮਿਲੀਅਨ ਪ੍ਰਸ਼ੰਸਕਾਂ ਨੇ ਇਸਨੂੰ ਲਾਈਵ ਦੇਖਿਆ। ਲਾਈਵ ਪ੍ਰਸ਼ੰਸਕਾਂ ਵਿੱਚ ਪਿਛਲੇ ਸੀਜ਼ਨ ਦੇ ਮੁਕਾਬਲੇ 80 ਪ੍ਰਤੀਸ਼ਤ ਦਾ ਵਾਧਾ ਹੋਇਆ ਹੈ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਇਸ ਵਾਰ ਟੀਵੀਆਰ ਪਹਿਲਾਂ ਦੇ ਮੁਕਾਬਲੇ 15 ਫੀਸਦੀ ਵਧਿਆ ਹੈ। ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਦੁਨੀਆ ਭਰ ਵਿੱਚ 1.56 ਬਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਡਿਜੀਟਲ ਪਲੇਟਫਾਰਮ 'ਤੇ ਦੇਖਿਆ ਹੈ। ਜਦੋਂ ਕਿ 182 ਮਿਲੀਅਨ ਲੋਕਾਂ ਨੇ ਟੈਲੀਵਿਜ਼ਨ ਰਾਹੀਂ ਦੇਖਿਆ। ਇਸ ਤਰ੍ਹਾਂ, ਲੀਜੈਂਡਜ਼ ਲੀਗ ਕ੍ਰਿਕਟ ਟੂਰਨਾਮੈਂਟ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਦੇਖੇ ਜਾਣ ਵਾਲੇ ਖੇਡ ਮੁਕਾਬਲਿਆਂ ਵਿੱਚੋਂ ਇੱਕ ਬਣ ਗਿਆ ਹੈ। ਨੋਟ: ਪੰਜਾਬੀ ਦੀਆਂ ਬ੍ਰੇਕਿੰਗ ਖ਼ਬਰਾਂ ਪੜ੍ਹਨ ਲਈ ਤੁਸੀਂ ਸਾਡੇ ਐਪ ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।ਜੇ ਤੁਸੀਂ ਵੀਡੀਓ ਵੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ABP ਸਾਂਝਾ ਦੇ YouTube ਚੈਨਲ ਨੂੰ Subscribe ਕਰ ਲਵੋ। ABP ਸਾਂਝਾ ਸਾਰੇ ਸੋਸ਼ਲ ਮੀਡੀਆ ਪਲੇਟਫਾਰਮਾਂ ਤੇ ਉਪਲੱਬਧ ਹੈ। ਤੁਸੀਂ ਸਾਨੂੰ ਫੇਸਬੁੱਕ, ਟਵਿੱਟਰ, ਕੂ, ਸ਼ੇਅਰਚੈੱਟ ਅਤੇ ਡੇਲੀਹੰਟ 'ਤੇ ਵੀ ਫੋਲੋ ਕਰ ਸਕਦੇ ਹੋ।","pubDate":"2023-12-24 01:21:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/24/5e694562abf08e26fbeb63258e880c8d1703380846312709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"28d0abea2fe83650b888ec71120371dc","title":"IND vs SA टेस्ट सीरीज से पहले फैंस के लिए आई बुरी खबर, मैच का मजा होगा किरकिरा!","link":"https://www.indiatv.in/sports/cricket/ind-vs-sa-1st-test-centurion-weather-report-rain-likely-wash-out-first-2-days-2023-12-24-1010683","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA 1st Test: भारत और साउथ अफ्रीका के बीच टेस्ट सीरीज का पहला मैच 26 दिसंबर से सेंचुरियन के सुपरस्पोर्ट पार्क में खेला जाएगा। इस मैच से पहले मौसम को लेकर एक बड़ा अपडेट सामने आया है।","content":"टीम इंडिया का साउथ अफ्रीका दौरा अभी तक काफी शानदार रहा है। भारतीय टीम ने टी20 सीरीज में साउथ अफ्रीका को बराबरी पर रोका था और वनडे सीरीज 2-1 से अपने नाम की। अब दोनों टीमों के बीच टेस्ट सीरीज खेली जाएगी। 26 दिसंबर से दोनों टीमों के बीच 2 मैचों की टेस्ट सीरीज की शुरुआत होने जा रही है। सीरीज का पहला मैच सेंचुरियन के सुपरस्पोर्ट पार्क में खेला जाएगा। इस मैच से पहले फैंस के लिए एक बुरी खबर सामने आई है। भारत और साउथ अफ्रीका के बीच सेंचुरियन में खेले जाने वाले टेस्ट मैच पर बारिश की खतरा मंडरा रहा है। सेंचुरियन के क्यूरेटर ने कहा कि टेस्ट के शुरूआती दिन और दूसरे दिन के ज्यादातर हिस्से में खेल की संभावना बहुत कम है और भारी बारिश के कारण तापमान में गिरावट होगी जिससे स्पिनरों को ज्यादा मदद नहीं मिलेगी। ब्लॉय ने पीटीआई से कहा कि तापमान काफी कम होगा जैसे 20 डिग्री। अभी तापमान 34 डिग्री है और यह गिरकर 20 डिग्री तक पहुंच जाएगा। उम्मीद करता हूं कि कुछ खेल हो और तीसरे दिन यह ठीक रहेगा लेकिन मुझे नहीं पता कि पिच पर कितना टर्न होगा। मैं मौसम की भविष्यवाणी की गारंटी नहीं ले सकता लेकिन अगर पिच दो दिन में ज्यादातर समय ढकी रहेगी तो पहले बल्लेबाजी करना थोड़ा पेचीदा हो सकता है क्योंकि यह काफी लंबे समय तक ढकी रहेगी और हमें नहीं पता कि मौजूदा स्थिति में यह कितने समय में खेलने के लिए तैयार होगी। उन्होंने कहा कि अगर तीसरे दिन खेल सुबह 10 बजे शुरू होगा तो हमें ज्यादा समय नहीं मिलेगा। अगर यह दो दिन तक ढकी रहेगी तो मेरा मानना है कि इससे गेंदबाजों को फायदा होगा। भारत: रोहित शर्मा (कप्तान), शुभमन गिल, यशस्वी जायसवाल, विराट कोहली, श्रेयस अय्यर, अभिमन्यु ईश्वरन, केएल राहुल (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, शार्दुल ठाकुर, मोहम्मद सिराज, मुकेश कुमार, जसप्रीत बुमराह (उपकप्तान), प्रसिद्ध कृष्णा और केएस भरत (विकेटकीपर)। साउथ अफ्रीका: टेम्बा बावुमा (कप्तान), डेविड बेडिंघम, नांद्रे बर्गर, एडेन मार्करम, वियान मुल्डर, कगिसो रबाडा, ट्रिस्टन स्टब्स, काइल वेरेन, गेराल्ड कोएट्जी, टोनी डी जोर्जी, डीन एल्गर, मार्को यानसेन, केशव महाराज, लुंगी एनगिडी, कीगन पीटरसन। ये भी पढ़ें","pubDate":"2023-12-24 01:08:54","image_url":"https://resize.indiatv.in/resize/715_-/2023/12/g-1703380017.jpg","source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"70b1d717522c5ea4a7eb11d0d62c85e2","title":"The five most memorable Boxing Day Tests","link":"https://www.cairnspost.com.au/news/victoria/the-five-most-memorable-boxing-day-test-moments-picked-by-an-mcg-historian/news-story/13aa7edde52f85bf1ab6bad514cd12bf","keywords":["Cricket news and galleries","News","Victoria"],"creator":[""],"video_url":null,"description":"Forget about Christmas – the Boxing Day Test is almost upon us.","content":"Victoria Don't miss out on the headlines from Victoria. Followed categories will be added to My News. Forget about Christmas – the Boxing Day Test is almost upon us. On the eve of Australia lining up against Pakistan at the MCG, Melbourne Cricket Club historian and librarian David Studham has picked his five most memorable Boxing Day Test moments, in chronological order. Check out his list and have your say below. 1. Lillee produces “one of the most memorable wickets in MCG history”, 1981 Dennis Lillee celebrates the wicket of Viv Richards in the 1981 Boxing Day Test. Lillee took 10 wickets in the match. Dennis Lillee knocking over West Indies great Viv Richards with the final ball of the opening day of the 1981 Boxing Day Test ranks as “one of the most memorable wickets in MCG history”, Mr Studham says. “Richards played on to his stumps, and that left the West Indies at 4/10,” Mr Studham said. “Australia went on to win that match by the 58 runs, knocking the West Indies over for 161 in the last innings.” The wicket capped off a remarkable spell in which Lillee claimed three scalps in a 35-minute period before stumps. He finished the match with 10-127, the seventh and final 10-wicket haul of his career. Australia’s victory ended a West Indies run of 15 Tests without defeat since February 1980. 2. Border and Thomson’s brave ninth-wicket stand, 1982 Allan Border and Jeff Thomson’s valiant ninth-wicket stand just fell short in 1982. Thomson being mobbed by fans at the Boxing Day Test. Allan Border and Jeff Thomson fell agonisingly short of claiming what would have been a remarkable win for Australia against England in the 1982 Boxing Day Test. The pair came together at 9/218, chasing 292, and nearly got there. “On the last day of the Test, we needed 37 runs and England needed one wicket to win,” Mr Studham said. “We ended up with more than 18,000 fans coming along for potentially one ball. And of course, we get 33 runs and then poor Thomson gets what I can only describe as not one of Ian Botham’s best balls that gets delivered the outside the off stump. “Thomson pushes his bat at it, snicks it to Chris Tavaré who flicks it up to be caught by Geoff Miller at slips, and that breaks the hearts of the 18,000 fans at MCG.” Border was stranded at the non-striker’s end on 62 after spending almost four hours at the crease. 3. The longest day in Test cricket history, 1998 Dean Headley was a well-deserved man of the match in the 1998 Boxing Day Test. This dead rubber proved to be such an exciting match that English fans celebrated their unlikely victory “like they’d won the Ashes”, Mr Studham recalls. “The longest day in Test cricket history was the (fourth day of the) 1998 Boxing Day Test,” he said. “We were washed out on the first day, but the fourth day lasted for eight hours and three minutes, because the umpires decided to take an extra half-hour to force a result. It looked like Australia was going to beat England and score the runs they needed. “Then, Dean Headley ran amok and changed the course of the game by taking three wickets in 12 deliveries. We ended up falling apart and losing by 12 runs to England in the last innings, really unexpectedly. “I remember going out to dinner afterwards with a lot of English cricket fans who were out here, and they were so ecstatic that they actually won a match. They were acting like they’d won the Ashes.” Headley took 6/60 in the second innings to achieve his first five-for and be named player of the match. The Balmy army celebrate England's win by crowding on to the MCG field. 4. Warnie gets his 700th Test wicket, 2006 Shane Warne takes his 700th Test wicket during day one of the 2006 Boxing Day Test. Warnie gets carried off by Andrew Symonds and Matthew Hayden. It’s impossible to go past Shane Warne taking his 700th Test scalp when talking about memorable Boxing Day Test moments, Mr Studham says. In the 47th over on day one, Warne deceived Strauss with a quicker, well-pitched up delivery that rattled his middle stump. “When Warnie came in and bowled Andrew Strauss, the whole place just shook,” he said. “He was the first player to capture 700 Test wickets. “We had hoped to break the record of the 90,800 for a day at the MCG, but we only got to 89,155 because it was cold, wet and damp. “Australia ended up winning by an innings in three days.” Warne bowls Strauss for his 700th wicket. It was Warne’s 37th five-wicket haul in a Test match. Mr Studham said the spin king’s hat-trick against England in 1994 was another clear MGC cricket highlight – but it technically took place in a Christmas Eve Test. It was the first Ashes hat-trick in 90 years and capped off by a leaping David Boon catch. “It was my first Test actually working at the MCG – what a match to start with,” he said. 5. Hayden’s record six Boxing Day tons, 2001-2007 Andrew Symonds celebrates his century with Matthew Hayden at the 2006 Boxing Day Test. Matthew Hayden notches a record sixth Boxing Day Test century. Matthew Hayden scored his record sixth Boxing Day Test century against India in 2007, making 124. But Mr Studham considers his 2006 ton, in which he and “Andrew Symonds destroyed England”, to be the most memorable. The star opener reached 153 to add another highlight to the dominant Aussie win also containing Warne’s 700th wicket. Mr Studham said Hayden’s haul was the highest number of Boxing Day centuries scored by one player, but Sir Don Bradman held the record for most MCG tons with nine. He added the Boxing Day Test was formalised by the Australian Cricket Board in 1980. The MCC Library is open to MCC members and guests throughout the Boxing Day Test, and on other days, to anyone who books an MCG Tour. Visitors can check out a special exhibition, 150 Treasures , collated by librarians to celebrate the Library’s 150th birthday. Over summer, these include cricket treasures like the newspaper obituary mourning the “death of English cricket” from which The Ashes was named. Visit: mcc.org.au/mcc-reserve/mcc-library Originally published as The five most memorable Boxing Day Test moments, picked by an MCG historian More related stories Property What do Victorians think is the state’s top home? Property pundits have turned up in force to back in their favourite houses in Victoria, with a surprising result for what they deemed the state’s best. SEE THE LIST Read more Victoria Mixed forecasts for Victoria on Christmas, Carols facing storms Melburnians can have a Christmas roast and pudding in comfort with rain forecast for the 25th, but other parts of the state will be warm and dry. Meanwhile Carols by Candlelight could be hit by thunderstorms. Read more","pubDate":"2023-12-24 01:00:00","image_url":null,"source_id":"cairnspost","source_priority":626680,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"e7339179829a3f18554eba133b21b67b","title":"BBL opts not to reschedule abandoned Geelong game","link":"https://www.perthnow.com.au/sport/cricket/bbl-opts-not-to-reschedule-abandoned-geelong-game-c-13008201","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"A BBL match in Geelong between the Renegades and Scorchers that was abandoned because of the state of the pitch will not be rescheduled.","content":"The abandoned Big Bash League game in Geelong between the Melbourne Renegades and Perth will not be replayed. The match at GMHBA Stadium on December 10 was called off amid farcical scenes after just 6.5 overs because of concerns over the safety of the pitch. Water damage had made the pitch unplayable, with multiple Scorchers batters hit by deliveries before umpires stopped play. BBL authorities confirmed on Sunday the game would not be rescheduled and both teams would receive a point each. \"The circumstances giving rise to the abandoned match remain the subject of an ongoing investigation,\" the BBL statement read. \"While various options to reschedule were explored, it became apparent rescheduling would be challenging due to a variety of factors, including the existing schedule across the two clubs, and limited access to venues.\" Perth are favourites to claim a record third straight BBL title, while the Renegades are winless after losing to the Hobart Hurricanes on Saturday night.","pubDate":"2023-12-24 00:50:49","image_url":"https://images.perthnow.com.au/publication/C-13008201/5443d3b8f9c20238ca4992593815b1dfc2ba3151-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"4cea91a842741a353484d8d4ad6065fb","title":"Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese","link":"https://www.dailymail.co.uk/sport/cricket/article-12897447/iconic-band-six-Prime-Minister-Anthony-Albanese-cricket.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Much-loved Aussie rock and roll band Six and Out have reunited after 20 years and are touring this summer - and fans have got Prime Minister Anthony Albanese to thank for it.","content":"Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese Iconic cricket band Six and Out have reunited The PM recently requested them to play The band will play three gigs this summer By James Cooney For Daily Mail Australia Published: 19:14 EST, 23 December 2023 | Updated: 19:18 EST, 23 December 2023 e-mail 2 View comments Much-loved Aussie rock and roll band Six and Out have reunited after 20 years and are touring this summer - and fans have got Prime Minister Anthony Albanese to thank for it. Six and Out, which is made up of former first-class cricketers Brett Lee, Shane Lee, Gavin Robertson, Brad McNamara and Richard Chee Quee, have decided to get the band back together and go on tour. The rockers, who are best known for their song 'Can't Bowl, Can't Throw', were recently asked to play at Marrickville Lawn Tennis Club by the PM. 'Basically, Mr Albanese's partner, Jodie Haydon , she was a Six and Out fan back in the day when we played, and she asked the PM if he'd contact Binga to ask us to play at the 100th anniversary,' McNamara told News Corp . 'The PM and Binga had had the odd game of tennis together. Cricket star rockers Six and Out will be playing three shows this summer The PM inspired the tour by asking the band to play at the Marrickville Lawn Tennis Club 'It was the catalyst to fire it all up again. It was great. 'It brought back memories. How much fun we had and how much we'd missed it all. It's amazing how quick life passes you by.' The iconic band had so much fun that they decided to go back on tour and are planning three gigs this summer. Brett Lee, who plays bass in the band, likened being on stage to the thrill of playing cricket for Australia. 'When you hit that harmony … I liken it to when you bowl a perfect outswinger,' Lee said. 'I've felt a lot more comfortable playing cricket because I've done it a lot more … it can be very, very nerve wracking when you're on stage. 'It's a great buzz because you're out of your comfort zone but that also brings out this massive adrenaline rush which is why it's such a fun thing to do.' Lee, who travelled the world playing cricket, recently opened up about a secret chamber at the SCG where only legends of the game are allowed to tread. The iconic Aussie band are best known for their hit song 'Can't Bowl, Can't Throw' Speaking on the Hello Sport podcast, Lee revealed the top-secret cellar at the Sydney venue that has been a safe haven for Test players since Bradman brandished the Willow over 70 years ago. 'At the Sydney Cricket Ground, a lot of people don't know — (I'm) giving away a little bit of inside knowledge here,' Lee told the podcast hosts. 'That inner sanctum where we feel comfortable, where there's no press, where we can relax and just speak honestly and openly.' The secret cellar even had a secret knock to gain access. 'After the Test win at the SCG, the tradition is you'll get a cricket bat and go thump thump thump on the floor, three taps. 'Then a few minutes later you'll hear thump thump thump, someone from downstairs in the cellar, which means come downstairs to the cellar. 'So you walk down underneath the change rooms of the Australian players, opposite near where the race is and there's a little garage door. 'You walk inside and it's (tiny) so we reckon it's Justin Langer's house because he fits in beautifully. And there's a door that's been signed by every Test cricketer I think since the 1950s that's in there. 'And it's a cellar. So beers and wine, you get down there and have a chat with some of the ground staff and have a cold beer with them.' Anthony Albanese Jodie Haydon Share or comment on this article: Iconic Aussie rock and roll band Six and Out to make shock return - and it's thanks to Prime Minister Anthony Albanese e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-24 00:18:28","image_url":"https://i.dailymail.co.uk/1s/2023/12/24/00/79295005-0-image-a-273_1703376641307.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"}]}