{"newsArray":[{"title":"Southern Punjab win to keep semi-final hope alive","link":"https://www.thenews.com.pk/print/992371-southern-punjab-win-to-keep-semi-final-hope-alive","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Sohaib Maqsood struck form at the right time as his unbeaten half-century helped Southern Punjab beat table toppers Khyber Pakhtunkhwa by six wickets in the 28th fixture of the National T20 Cup at the Multan Cricket Stadium on Friday evening.The right-handed Sohaib coming to bat at number...","content":null,"pubDate":"2022-09-18 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pakistan start training for England T20 series","link":"https://www.thenews.com.pk/print/992366-pakistan-start-training-for-england-t20-series","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Pakistan cricket team on Saturday held its first training session here at the National Stadium to prepare for the seven-match T20 series against England which will begin on September 20.Pakistan's wicket-keeper batsman Mohammad Rizwan and bowling coach Shan Tait did not attend the...","content":null,"pubDate":"2022-09-18 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav: Try to follow the same batting mantra as AB de Villiers","link":"https://sportstar.thehindu.com/cricket/suryakumar-yadav-sky-t20-world-cup-australia-ipl-ab-de-villiers/article65902480.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"Having spent almost a decade in domestic cricket before his India debut, Suryakumar Yadav stressed that flexibility is the key to success for a T20 batter.","content":null,"pubDate":"2022-09-18 00:45:14","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"“Let’s exchange notes on Cricket and Tennis”: When Sachin Tendulkar seemed impressed with Roger Federer’s forward defence during 2018 Wimbledon match","link":"https://thesportsrush.com/cricket-news-lets-exchange-notes-on-cricket-and-tennis-when-sachin-tendulkar-seemed-impressed-with-roger-federers-forward-defence-during-2018-wimbledon-match/","keywords":["Cricket","Roger Federer","Sachin Tendulkar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sachin Tendulkar seemed impressed with the recently retired Tennis champion Roger Federer, when he played an on-court forward defence. 20-time Grand Slam winner, Switzerland’s Roger Federer, at the age of 41, decided to hang up his boots from professional Tennis, to send millions of his fans across the globe, to even places where the sport… The post “Let’s exchange notes on Cricket and Tennis”: When Sachin Tendulkar seemed impressed with Roger Federer’s forward defence during 2018 Wimbledon match appeared first on The SportsRush.","content":"Sachin Tendulkar seemed impressed with the recently retired Tennis champion Roger Federer, when he played an on-court forward defence. 20-time Grand Slam winner, Switzerland’s Roger Federer, at the age of 41, decided to hang up his boots from professional Tennis, to send millions of his fans across the globe, to even places where the sport is not even half as popular, teary-eyed, as they celebrated some of their star’s evergreen on-field moments across social media. Scores of celebrities across different walks of life, including the legendary Indian Cricketer Sachin Tendulkar carefully chose some of the well-crafted words and phrases to describe the man, who will be hailed as one of the greatest of all time, across sporting divisions. What a career, @rogerfederer. We fell in love with your brand of tennis. Slowly, your tennis became a habit. And habits never retire, they become a part of us. Thank you for all the wonderful memories. pic.twitter.com/FFEFWGLxKR — Sachin Tendulkar (@sachin_rt) September 15, 2022 Akin most of the sportspersons, Tendulkar too has been a huge Federer fan, and around four years ago, he decided not to hold himself back to even express his awe while noticing Federer – the batter, although on the Tennis court, while playing his Wimbledon match. Sachin Tendulkar seemed impressed with Roger Federer’s forward defence During the third-round match of the Wimbledon Championship 2018 between Federer and Adrian Mannarino, the former played a long ball to lose a point, as Mannarino returned back the ball as an instinctive reaction. Federer, upon seeing the returning ball, cheekily played a stylish-looking forward defence with both his hands on the racquet, perhaps towards one of the ballkids, so much so, that the official Wimbledon Twitter handle posted a video clip of the same while tagging the ICC, to rate the Tennis star’s forward defence. Tendulkar took note of the tweet, and was quick to respond by hilariously commenting – “As always, great hand-eye co-ordination Roger Federer, let’s exchange notes on cricket and tennis after you win your 9th Wimbledon title.” As always, great hand-eye co-ordination. @rogerfederer, let’s exchange notes on cricket and tennis after you win your 9th @Wimbledon title https://t.co/2TNUHGn1zK — Sachin Tendulkar (@sachin_rt) July 10, 2018 Post the match, Federer too replied by wittingly commenting – “Why wait? I’m ready to take notes”. why wait? I’m ready to take notes! @sachin_rt https://t.co/UjH5m1wuNT — Roger Federer (@rogerfederer) July 10, 2018 For more Cricket-related news, click here. The post “Let’s exchange notes on Cricket and Tennis”: When Sachin Tendulkar seemed impressed with Roger Federer’s forward defence during 2018 Wimbledon match appeared first on The SportsRush.","pubDate":"2022-09-17 20:00:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Mera coaching ka hisaab khatam ho gaya”: Ravi Shastri uninterested in resuming coaching career post nearly INR 10 crore annual salary as head coach","link":"https://thesportsrush.com/cricket-news-mera-coaching-ka-hisaab-khatam-ho-gaya-ravi-shastri-uninterested-in-resuming-coaching-career-post-nearly-inr-10-crore-annual-salary-as-head-coach/","keywords":["Cricket","India","Ravi Shastri"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ravi Shastri uninterested in resuming coaching: The former Indian head coach had been with the team for seven years. Former India all-rounder Ravi Shastri has donned multiple hats during his professional career which now runs across decades. Shastri, who had debuted for India in 1981, performed various roles throughout his 11-year old career which saw… The post “Mera coaching ka hisaab khatam ho gaya”: Ravi Shastri uninterested in resuming coaching career post nearly INR 10 crore annual salary as head coach appeared first on The SportsRush.","content":"Ravi Shastri uninterested in resuming coaching: The former Indian head coach had been with the team for seven years. Former India all-rounder Ravi Shastri has donned multiple hats during his professional career which now runs across decades. Shastri, who had debuted for India in 1981, performed various roles throughout his 11-year old career which saw him playing 230 international matches across formats. Shastri, who even led India on 12 occasions, has been a regular face as a broadcaster for several channels for over decades now. Currently pursuing the same role after a considerable gap, Shastri is often seen calling games in both T20 leagues and international cricket. Nice to feel like a youngster in the Pod again @thehundred with – @Eoin16 @josbuttler @darensammy88 @alextudorcoach pic.twitter.com/5dE87ccTsj — Ravi Shastri (@RaviShastriOfc) August 23, 2022 Ravi Shastri uninterested in resuming coaching career post nearly INR 10 crore annual salary as head coach Shastri, who had briefly been appointed as the manager of the Indian Men’s Cricket team around 2007, was appointed the Director of Cricket during India’s tour of England 2014. Subsequently, Shastri replaced former India captain Anil Kumble to serve as the coach of the Indian cricket team for two consecutive stints. Shastri, whose second stint finished post ICC T20 World Cup 2021 in the UAE, appears to have had enough as far as the expectations out of a head coach are concerned. Speaking in a recent interview with Sports Today, Shastri confirmed moving on as a coach stating that his time with coaching has come to an end. “Mera coaching ka hisaab khatam ho gaya [My time with coaching has come to an end]. Saat saal jitna karna tha, mein kar liya [For seven years, I have done enough]. “If I’m doing some coaching, it will be at the grassroots level, for which I have a company that is doing it. I will participate in that. Otherwise, my time as a coach has come to an end. Now I will view the game from far away and enjoy it,” Shastri told Sports Today. The post “Mera coaching ka hisaab khatam ho gaya”: Ravi Shastri uninterested in resuming coaching career post nearly INR 10 crore annual salary as head coach appeared first on The SportsRush.","pubDate":"2022-09-17 19:57:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“My time as a coach is over” – Ravi Shastri","link":"https://thenewsglory.com/my-time-as-a-coach-is-over-ravi-shastri/","keywords":["Sports","coach","Cricket","Indian team","Ravi Shastri","Team India"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: Former Indian cricketer Ravi Shastri has given an explanation regarding his return to coaching. Ravi Shastri is a former player and former head coach of the Indian cricket team (2017-2021). After retiring from the field in international cricket, he is looking after the work of commentating cricket matches. India’s series win against Australia during […]","content":"Mumbai: Former Indian cricketer Ravi Shastri has given an explanation regarding his return to coaching. Ravi Shastri is a former player and former head coach of the Indian cricket team (2017-2021). After retiring from the field in international cricket, he is looking after the work of commentating cricket matches. India’s series win against Australia during his tenure as head coach was seen as a record.","pubDate":"2022-09-17 18:41:06","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022: Kevin O’Brien hits 56-ball 100 to power Gujarat Giants to 3-wicket win vs India Capitals","link":"https://www.indiatoday.in/sports/cricket/story/legends-league-cricket-2022-kevin-o-brien-hits-56-ball-100-to-power-gujarat-giants-to-3-wicket-win-vs-india-capitals-2001558-2022-09-17?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket: Kevin O’Brien hits 56-ball 100 to power Giants to win vs Capitals","content":null,"pubDate":"2022-09-17 18:04:37","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"147 Crore net worth Gautam Gambhir, once lent his wife’s father a huge sum of loan post marriage","link":"https://thesportsrush.com/cricket-news-147-crore-net-worth-gautam-gambhir-once-lent-his-wifes-father-a-huge-sum-of-loan-post-marriage/","keywords":["Cricket","Gautam Gambhir"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Former India batter and present Lok Sabha Member of Parliament, Gautam Gambhir, had once lent his father-in-law a hefty sum of loan. After more than a decade-long illustrious Cricketing career for team India, Gautam Gambhir has also started to make a mark for himself in the political arena, in the capacity of a member of… The post 147 Crore net worth Gautam Gambhir, once lent his wife’s father a huge sum of loan post marriage appeared first on The SportsRush.","content":"Former India batter and present Lok Sabha Member of Parliament, Gautam Gambhir, had once lent his father-in-law a hefty sum of loan. After more than a decade-long illustrious Cricketing career for team India, Gautam Gambhir has also started to make a mark for himself in the political arena, in the capacity of a member of the Parliament of the ruling Bhartiya Janta Party (BJP). Having triumphed during the 2019 general elections from Delhi East constituency, Gambhir, with a net worth of over INR 147 Crores, has managed to balance his political life and that as a Cricket analyst and commentator wonderfully well thus far. While critiques have questioned his involvement in the game of Cricket despite holding an office of political responsibility in the capital city of India, he has earned the respect of the populace under his constituency, courtesy of the development projects he has initiated in the city, and for his social work during COVID-19. Don’t change your passion, change circumstances! #Vision pic.twitter.com/hW7LFCr3IQ — Gautam Gambhir (@GautamGambhir) September 13, 2022 Gautam Gambhir once lent his multi-millionaire father-in-law a huge sum of loan One of the richest member of Parliament, as are 88% of the total number in the country, Gambhir had once, as per a report in ‘The Indian Express’, surprisingly lent a loan of INR 73 Lakhs to his multi-millionaire father-in-law. It is worth of a mention that, Gambhir’s father-in-law – Ravindra Jain is a multi-millionaire businessman in Gurugram, and has a close acquaintance with his father Deepak Gambhir, a renowned Textile businessman himself. The exact reason for the alleged hefty sum of loan from the former Indian cricketer is however, unknown as of date. Having said that, Natasha Jain Gambhir, wife of Gautam Gambhir, interestingly has no stake in her husband’s net income or worth, which as aforementioned tunes to over INR 147 Crore. The above information is mentioned in Gautam’s affidavit as presented by him to the Election Commission of India, ahead of the 2019 Lok Sabha elections. Also, as per a report from the ‘Financial Express’, the 40-year-old has in his possession moveable assets worth more than INR 116 Crore, and immovable assets to the tune of INR 28 Crore. The post 147 Crore net worth Gautam Gambhir, once lent his wife’s father a huge sum of loan post marriage appeared first on The SportsRush.","pubDate":"2022-09-17 17:53:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies cricket structure is flawed if Andre Russell is not playing in T20 World Cup: Aakash Chopra","link":"https://www.indiatoday.in/sports/cricket/story/west-indies-cricket-structure-is-flawed-if-andre-russell-is-not-playing-in-t20-world-cup-aakash-chopra-2001554-2022-09-17?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"West Indies cricket structure is flawed if Russell is not playing in T20 WC: Chopra","content":null,"pubDate":"2022-09-17 17:49:15","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit, Virat Kohli and other Team India members arrive at Mohali stadium for T20I against Australia","link":"https://www.tribuneindia.com/news/sports/rohit-virat-kohli-and-other-team-india-members-arrive-at-mohali-stadium-for-t20i-against-australia-432727","keywords":null,"creator":null,"video_url":null,"description":"Mohali, September 17Star Indian batter Virat Kohli and other members of Team India arrived at the Punjab Cricket Association IS Bindra Stadium in Mohali on Saturday ahead of the first T20I match against Australia, which will take place on September 20.The three-match T20I home series against Australia will start on September 20 in Mohali. The next T20I match will take place in Nagpur on September 23, followed by the third and final T20I match in Hyderabad on September 25.Punjab Cricket Association took to Instagram to share pictures and videos of players arriving at the stadium.Along with Kohli, players like Dinesh Karthik, Yuzvendra Chahal, captain Rohit Sharma, Ravichandran Ashwin, Harshal Patel arrived at the venue. Indian head coach Rahul Dravid also reached along with his players.Virat Kohli found his touch during the recently concluded Asia Cup 2022, in which he finished as the second-highest run scorer in the tournament and also scored his much anticipated 71st international ton.Kohli scored 276 runs in five matches at an average of 92.00 with one century and two half-centuries.However, he could not take his team to the trophy as it finished third in the Super Four phase of the tournament, topped by winners Sri Lanka and runners-up Pakistan respectively.All eyes are on this T20I series against Australia and another home series against South Africa, starting from October 28, consisting of three ODIs and three T20Is. These will serve as quality match practice for Men in Blue for ICC T20 World Cup 2022, which will go on from October 16 to November 13 this year.India could not even qualify for semis the previous year as they crashed out of the competition in the Super 12 phase.Pacers Jasprit Bumrah and Harshal Patel have made their return to the squad for the World Cup and for Australia and South Africa home series. Pacers Mohammed Shami and Deepak Chahar have been included in the squad for T20 World Cup as standby players and also feature in squads for the two home series.India squad for ICC T20 World Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh.Standby players - Mohd. Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar.India Squad for Australia T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah.India squad for South Africa T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah.","content":"ANI Mohali, September 17 Star Indian batter Virat Kohli and other members of Team India arrived at the Punjab Cricket Association IS Bindra Stadium in Mohali on Saturday ahead of the first T20I match against Australia, which will take place on September 20. The three-match T20I home series against Australia will start on September 20 in Mohali. The next T20I match will take place in Nagpur on September 23, followed by the third and final T20I match in Hyderabad on September 25. Punjab Cricket Association took to Instagram to share pictures and videos of players arriving at the stadium. Along with Kohli, players like Dinesh Karthik, Yuzvendra Chahal, captain Rohit Sharma, Ravichandran Ashwin, Harshal Patel arrived at the venue. Indian head coach Rahul Dravid also reached along with his players. Virat Kohli found his touch during the recently concluded Asia Cup 2022, in which he finished as the second-highest run scorer in the tournament and also scored his much anticipated 71st international ton. Kohli scored 276 runs in five matches at an average of 92.00 with one century and two half-centuries. However, he could not take his team to the trophy as it finished third in the Super Four phase of the tournament, topped by winners Sri Lanka and runners-up Pakistan respectively. All eyes are on this T20I series against Australia and another home series against South Africa, starting from October 28, consisting of three ODIs and three T20Is. These will serve as quality match practice for Men in Blue for ICC T20 World Cup 2022, which will go on from October 16 to November 13 this year. India could not even qualify for semis the previous year as they crashed out of the competition in the Super 12 phase. Pacers Jasprit Bumrah and Harshal Patel have made their return to the squad for the World Cup and for Australia and South Africa home series. Pacers Mohammed Shami and Deepak Chahar have been included in the squad for T20 World Cup as standby players and also feature in squads for the two home series. India squad for ICC T20 World Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh. Standby players - Mohd. Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar. India Squad for Australia T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah. India squad for South Africa T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah.","pubDate":"2022-09-17 17:39:22","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_793208069.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Kent star penalised for glove blunder in ridiculous One-Day Cup final incident","link":"https://www.mirror.co.uk/sport/cricket/kent-lancashire-oneday-cup-final-28016953","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Kent fielder Harry Finch violated Law 28 of the MCC's Laws of Cricket in a bizarre incident in the One-Day Cup final against Lancashire, which Kent won by 21 runs","content":null,"pubDate":"2022-09-17 16:47:15","image_url":"https://i2-prod.mirror.co.uk/incoming/article28016965.ece/ALTERNATES/s615/0_jpg.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"I think playing at number 4 is great: Suryakumar Yadav","link":"https://thenewsglory.com/i-think-playing-at-number-4-is-great-suryakumar-yadav/","keywords":["Sports","Cricket","game","India","Suryakumar Yadav"],"creator":["The News Glory"],"video_url":null,"description":"Suryakumar Yadav has said that it would be right for him to play as the fourth batsman in the batting order of the Indian team. He has been included in the Indian squad for the upcoming T20 World Cup series. He is adept at playing action and showing great fun. The 32-year-old has played 13 […]","content":"Suryakumar Yadav has said that it would be right for him to play as the fourth batsman in the batting order of the Indian team. He has been included in the Indian squad for the upcoming T20 World Cup series. He is adept at playing action and showing great fun. The 32-year-old has played 13 ODIs and 28 T20Is for India in international cricket. He has scored a total of 1151 runs. Vlasi has 6 half-centuries and 1 century in T20 cricket. His strike rate in this form of cricket is 173.29. He has batted at various positions from opening batsman to batting at number five. He has revealed that this is the best place for him to bat. Many people are commenting on who should be the opener in the Indian cricket team. In this case, he expressed his opinion. “I want to bat everywhere. But I think it would be perfect to play at number four. It’s good for me too. Because between 7 and 15 overs I enjoy playing cricket a lot. At that point I’ll be positive. For me, I think the time from 8th to 14th over is very important in T20 cricket. At that point I would avoid taking risks. I will hit the ball over the cover direction and run hard. It is challenging to play in the fourth place,” he said.\r","pubDate":"2022-09-17 16:39:07","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India Capitals vs Gujarat Giants, Legends League Cricket Live: Mitchell Johnson Removes Virender Sehwag Early, Kevin O'Brien Solid In Chase Of 180 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaW5kaWEtY2FwaXRhbHMtdnMtZ3VqYXJhdC1naWFudHMtbGVnZW5kcy1sZWFndWUtY3JpY2tldC0yMDIyLWxpdmUtdXBkYXRlcy0zMzUzNDc00gF3aHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9pbmRpYS1jYXBpdGFscy12cy1ndWphcmF0LWdpYW50cy1sZWdlbmRzLWxlYWd1ZS1jcmlja2V0LTIwMjItbGl2ZS11cGRhdGVzLTMzNTM0NzQvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Capitals vs Gujarat Giants, Legends League Cricket Live: Mitchell Johnson Removes Virender Sehwag Early, Kevin O'Brien Solid In Chase Of 180  NDTV SportsLegends League Cricket 2022: Yusuf and Irfan Pathan star as India Maharajas beat World Giants in Special Ma...  Zee NewsIndia Capitals vs Gujarat Giants Live Score, Legends League Cricket 2022: GG 15/0 In 1 Overs; Giants Off To  News18India Maharajas defeat World Giants in match to mark 75 years of India's Independence  DNA IndiaIC vs GJG Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for Legends League Cricket T20 2022, Match 1  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2022-09-17 16:23:43","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"PM Narendra Modi Birthday: From Kohli to Sachin, wishes pour in from cricket fraternity","link":"https://www.indiatvnews.com/sports/cricket/pm-narendra-modi-birthday-from-kohli-to-sachin-wishes-pour-in-from-cricket-fraternity-2022-09-17-809190","keywords":null,"creator":null,"video_url":null,"description":"Narendra Modi celebrated his 72nd birthday today and wishes poured in from all around the world. As far as the cricket fraternity is concerned, everyone ranging from the master blaster Sachin Tendulkar to Virat Kohli congratulated the Prime Minister on his special day.","content":null,"pubDate":"2022-09-17 16:08:55","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Very natural for such incidents to happen”: Venkatesh Iyer plays down injury after getting hit by Chintan Gaja throw in Duleep Trophy 2022","link":"https://thesportsrush.com/cricket-news-very-natural-for-such-incidents-to-happen-venkatesh-iyer-plays-down-injury-after-getting-hit-by-chintan-gaja-throw-in-duleep-trophy-2022/","keywords":["Cricket","Central Zone","Chintan Gaja","Duleep Trophy 2022-23","Venkatesh Iyer","West Zone"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Venkatesh Iyer plays down injury: The Indian all-rounder has accepted an avoidable injury in a sporting manner. It was during the second day of the first semi-final of Duleep Trophy 2022 between West Zone and Central Zone in Coimbatore yesterday that Central Zone all-rounder Venkatesh Iyer had suffered a neck injury. Coming in to bat… The post “Very natural for such incidents to happen”: Venkatesh Iyer plays down injury after getting hit by Chintan Gaja throw in Duleep Trophy 2022 appeared first on The SportsRush.","content":"Venkatesh Iyer plays down injury: The Indian all-rounder has accepted an avoidable injury in a sporting manner. It was during the second day of the first semi-final of Duleep Trophy 2022 between West Zone and Central Zone in Coimbatore yesterday that Central Zone all-rounder Venkatesh Iyer had suffered a neck injury. Coming in to bat at No. 7 in the 26th over, Iyer had hit West Zone pacer Chintan Gaja for a a first-ball six to surprise the bowler. Having missed the following delivery, Iyer was quite unfortunate to be at the receiving end of a needless throw. Perhaps wanting to show aggression after being hit for a six, Gaja ended up hitting Iyer on the neck. For a moment, the situation appeared so serious that an ambulance and a stretcher had to be called on to the field at the SNR College Cricket Ground. Iyer, however, provided an instant sigh of relief by walking back to the pavilion for treatment. While he couldn’t contribute substantially, Iyer returned to bat before a nine-ball stay was brought to an end by West Zone spinner Tanush Kotian. Venkatesh Iyer plays down injury after getting hit by Chintan Gaja in Duleep Trophy 2022 Iyer, who didn’t take part in the second innings on the third day today, took to social media platform Twitter about an hour ago to confirm “feeling alright”. Iyer, 27, thanked his fans for showing concerns and the medical staff for taking good care of him. Iyer, who has been in the team hotel post a hospital visit on Friday, played down the injury in a sporting manner saying that it is “very natural” for such an incident to happen. Thanks to all my supporters and cricket lovers for showering your concerns . My physios and doctors are completely taking good care of me and I’m feeling alright ! And it is very natural for such incidents to happen on field #TakenInARightSpirit — Venkatesh Iyer (@venkateshiyer) September 17, 2022 Speaking to Cricbuzz yesterday, Iyer had confirmed being “absolutely fine” in spite of copping a blow on a sensitive part of his body. “I was hit below my ear. It was a shock initially but I am absolutely fine,” Iyer had told Cricbuzz yesterday. With Central Zone losing opening batters cheaply whilst chasing a 501-run target, it would be interesting to see if Iyer bats on Day 4 tomorrow or not. Needing 468 runs with eight wickets in hand to win the match, Central Zone face a near-impossible situation ahead of the final day of the match. The last of Iyer’s 11 limited-over matches had come against Sri Lanka in Dharamsala earlier this year. The post “Very natural for such incidents to happen”: Venkatesh Iyer plays down injury after getting hit by Chintan Gaja throw in Duleep Trophy 2022 appeared first on The SportsRush.","pubDate":"2022-09-17 15:54:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Punjab Cricket Association IS Bindra Stadium Mohali pitch report: Mohali Stadium pitch report IND vs AUS 1st T20","link":"https://thesportsrush.com/cricket-news-punjab-cricket-association-is-bindra-stadium-mohali-pitch-report-mohali-stadium-pitch-report-ind-vs-aus-1st-t20/","keywords":["Cricket","Australia tour of India 2022","Mohali"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Punjab Cricket Association IS Bindra Stadium Mohali pitch report: India will take on defending T20 World Champions in a home T20I series. After a disappointing Asia Cup 2022 campaign, which opened their exit gate after losses against Pakistan and then the ultimate champions Sri Lanka, team India will look to iron out their wrinkles as… The post Punjab Cricket Association IS Bindra Stadium Mohali pitch report: Mohali Stadium pitch report IND vs AUS 1st T20 appeared first on The SportsRush.","content":"Punjab Cricket Association IS Bindra Stadium Mohali pitch report: India will take on defending T20 World Champions in a home T20I series. After a disappointing Asia Cup 2022 campaign, which opened their exit gate after losses against Pakistan and then the ultimate champions Sri Lanka, team India will look to iron out their wrinkles as they face the T20 World champions Australia, in a three-match T20I series. The first match of the series will take place at the Punjab Cricket Association IS Bindra Stadium in Mohali, on September 20 (Tuesday). After a ordinary display of pace bowling throughout the Asia Cup campaign, team India will be more than just happy with the return back of two of their better bowlers in the format, Jasprit Bumrah and Harshal Patel. The management has also included Mohammed Shami, who has perhaps been included in place of Avesh Khan, after the latter was dropped from the side owing to ordinary performances in the format off-late, including the Asia Cup. As for Australia, the imminent series will be their first against a top-ranked side since last year’s T20 World Cup. Since their World Cup triumph, the Aaron Finch-led side has only played a couple of series (home and away) versus Sri Lanka, and a T20I match against Pakistan in the format. FORT MOHALI. 4⃣ days to go for a chance to keep the 100% record in T20Is at the PCA Stadium for #TeamIndia. #PlayBold #INDvAUS pic.twitter.com/DZ62HXzW5Z — Royal Challengers Bangalore (@RCBTweets) September 16, 2022 Punjab Cricket Association IS Bindra Stadium Mohali pitch report The Punjab Cricket Association IS Bindra Stadium in Mohali will host only its sixth T20I on Tuesday, with India and Australia having faced each other once before in March 2016. The venue will host a T20I after a three-year gap, after India defeated South Africa by 7 wickets here last time around, in September 2019. The average score at this venue during the five T20Is from the period 2009-2019, is 176 runs. Overall, across the 86 T20 matches, the average score is still a healthy 163.6 runs, thus making it a decent enough venue as far as the batters are concerned. The lightning quick outfield will further act to the batters’ advantage, with the seamers likely to have a say with the new ball, especially during the Powerplay. As for the conditions, the night temperature will drop to a rather pleasant 28 degrees Celsius, with no chances of rain during the match hours. The post Punjab Cricket Association IS Bindra Stadium Mohali pitch report: Mohali Stadium pitch report IND vs AUS 1st T20 appeared first on The SportsRush.","pubDate":"2022-09-17 15:41:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mohali Cricket Stadium last 10 matches: Punjab Cricket Association Stadium Mohali matches all result list","link":"https://thesportsrush.com/cricket-news-mohali-cricket-stadium-last-10-matches-punjab-cricket-association-stadium-mohali-matches-all-result-list/","keywords":["Cricket","Australia","Australia tour of India 2022","India","PCA Stadium Mohali"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Mohali Cricket Stadium last 10 matches: Punjab Cricket Association Stadium has hosted only five T20Is till date. India and Australia are gearing up for a three-match T20I series to be played across three different venues within six days starting from September 20. Australia, who have reached India, are here for a brief T20I series as… The post Mohali Cricket Stadium last 10 matches: Punjab Cricket Association Stadium Mohali matches all result list appeared first on The SportsRush.","content":"Mohali Cricket Stadium last 10 matches: Punjab Cricket Association Stadium has hosted only five T20Is till date. India and Australia are gearing up for a three-match T20I series to be played across three different venues within six days starting from September 20. Australia, who have reached India, are here for a brief T20I series as part of preparations for ICC T20 World Cup 2022. The first of the three T20Is will be played at the Punjab Cricket Association IS Bindra Stadium on Tuesday as the venue will witness a return of white-ball cricket after three years. Rooting for #TeamIndia and excited that our home ground is hosting #IndvsAus T20I. Follow @pcacricket for all the live updates. @gulzarchahal pic.twitter.com/O5jgHpzZ7J — Harmanpreet Kaur (@ImHarmanpreet) September 17, 2022 Mohali, which had hosted an India-Sri Lanka Test match earlier this year, had last hosted a T20I against South Africa in September 2019. As far as Australia are concerned, both their Mohali T20Is had come during ICC World Twenty20 2016. Punjab Cricket Association Stadium Mohali matches all result list Having first hosted a T20I in 2009, Mohali has hosted only five matches of the shortest format till date. Barring the first and last T20I, all the remaining had been played during the world event in 2016. ALSO READ: T20I Ticket prices at PCA Stadium, Mohali India, who have played three T20Is at this venue, have won all their matches here. Set to face a strong Australian squad ahead of ICC T20 World Cup 2022 in Australia, the hosts would be keen to maintain their winning streak at the PCA Stadium. S. No. Match Result Year 1 India vs Sri Lanka India won by 6 wickets 2009 2 New Zealand vs Pakistan New Zealand won by 22 runs 2016 3 Australia vs Pakistan Australia won by 21 runs 2016 4 India vs Australia India won by 6 wickets 2016 5 India vs South Africa India won by 7 wickets 2019 Mohali Cricket Stadium last 10 matches Interestingly, the above mentioned last Mohali T20I is also the last T20 to be played at this venue. The same has primarily happened on the back of no Indian Premier League matches here in the last three seasons due to COVID-19 pandemic. The last 10 T20s at the PCA Stadium comprise of a few matches from IPL 2018 as well. S. No. Match Result Year 1 India vs South Africa India won by 7 wickets 2019 2 KXIP vs CSK KXIP won by 6 wickets 2019 3 KXIP vs KKR KKR won by 7 wickets 2019 4 KXIP vs RR KXIP won by 12 runs 2019 5 KXIP vs RCB RCB won by 8 wickets 2019 6 KXIP vs SRH KXIP won by 6 wickets 2019 7 KXIP vs DC KXIP won by 14 runs 2019 8 KXIP vs MI KXIP won by 8 wickets 2019 9 KXIP vs SRH KXIP won by 15 runs 2018 10 KXIP vs CSK KXIP won by 4 runs 2018 The post Mohali Cricket Stadium last 10 matches: Punjab Cricket Association Stadium Mohali matches all result list appeared first on The SportsRush.","pubDate":"2022-09-17 15:11:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ramiz Raja opens up on Pakistan Cricket Board not taking care of Shaheen Afridi","link":"https://zeenews.india.com/cricket/ramiz-raja-opens-up-on-pakistan-cricket-board-not-taking-care-of-shaheen-afridi-2511361.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board was already criticised for delaying his departure to London to get him fit as soon as possible.","content":"Former Pakistan captain Shahid Afridi made a shocking statement that Pakistan Cricket Board is not helping Shaheen Afridi with the knee injury he suffered ahead of the Asia Cup 2022. Responding to the claim by Shahid, the PCB chairman has said that the board has not disowned Shaheen Afridi. Ramiz Raja speaks to clear the air around Shaheen Afridi's treatment. Convinced with his response? pic.twitter.com/oYSBSukBmZ — Change of Pace (@ChangeofPace414) September 16, 2022 “How can you even think that PCB can disown Shaheen Afridi? It is beyond my understanding. It’s an unfortunate controversy. When Mohammad Rizwan fell ill during the T20 World Cup last year, our doctors panel went out of their way to ensure he played the final. Players are the most important stakeholders for us. They must have been some issue with regard to his accommodation or hotel room, but we have definitely not left Shaheen in the lurch,\" said Raja in an interaction on his own Youtube channel. Earlier, Afridi was quoted as saying on ESPNcricinfo, \"He has flown out to the UK on his own ticket, he is staying there on his own money, I arranged a doctor for him there, he contacted him there, the PCB is not doing anything in all this. As far as I know, he is doing everything about staying there and coordinating with doctors.\" After Afridi's comments, PCB released a statement in which they said they have contacted Shaheen and would bear all his expenses in the rehab programme. Pakistan Cricket Board was already criticised for delaying his departure to London to get him fit as soon as possible. Despite the injury., Shaneen continued to travel with the team as PCB wanted him to be under the supervision of the team's medical staff. He travelled to the Netherlands for the 3 ODIs and then to UAE for Asia Cup as PCB hoped he would be able to recover in time. It was not to be. Rather, it worsened and then PCB announced that he would be out for 4 to 6 weeks and would travel to London for a rehab programme. Shaheen has been named in the T20 World Cup 2022 squad after he posted a video of a gym session in London and wrote that he is almost near to full fitness.","pubDate":"2022-09-17 14:11:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Impact Player rule in T20: What is the new Impact Player rule in Syed Mushtaq Ali Trophy?","link":"https://thesportsrush.com/cricket-news-impact-player-rule-in-t20-what-is-the-new-impact-player-rule-in-syed-mushtaq-ali-trophy/","keywords":["Cricket","Syed Mushtaq Ali Trophy"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Impact Player rule: The next season of the Indian domestic T20 competition will be played with a new innovative role. It wouldn’t be wrong to say that the T20 format in cricket has evolved fastest among all other formats. Less than a couple of decades old, T20s have not only faced new intriguing rules to… The post Impact Player rule in T20: What is the new Impact Player rule in Syed Mushtaq Ali Trophy? appeared first on The SportsRush.","content":"Impact Player rule: The next season of the Indian domestic T20 competition will be played with a new innovative role. It wouldn’t be wrong to say that the T20 format in cricket has evolved fastest among all other formats. Less than a couple of decades old, T20s have not only faced new intriguing rules to make the game more thrilling but have also witnessed other shorter formats being introduced to further reduce the length of a cricket match. Any change made with respect to the existing format or the launch of a new format is mostly received with mixed views. While traditionalists often complain of too much tampering with a format, innovation-hungry fans relish attempts being made to further make the sport more exciting. The former set of people also highlight how attempting to fix something which ain’t broke calls for unnecessary changes disrupting the prevailing template. Impact Player rule in Syed Mushtaq Ali Trophy Not known for experimenting much regarding formats, BCCI (Board of Control for Cricket in India) have surprised quite a few by introducing tactical substitutes for the upcoming season of Syed Mushtaq Ali Trophy. Despite being against the conservative nature of a cricket match, substitutes are nothing new in this sport. Having said that, BCCI planning to implement such a change in their premier domestic competition is enough a hint around how there is no stopping the T20 evolution. Known as an “Impact Player”, teams will have to name four substitutes in addition to their Playing XIs from Syed Mushtaq Ali Trophy 2022-23 onward. One of these four players will be allowed to be substituted at any point before the end of the 14th over of either innings. In the general run of things, cricket’s rendezvous with substitutes have mostly come with a catch that dismissed batters and bowlers who’ve bowled a certain amount of overs cannot be substituted. Even the Big Bash League follows the same. That being said, BCCI have removed that filter to allow anyone to get substituted irrespective of his involvement in the match by the time the substitution happens. In simple words, a dismissed batter could be substituted to allow a team an additional batting option provided they only bat with a total of 11 batters. Similarly, a bowler who has bowled his quota of four overs could also be substituted to bring in a death-over specialist before the 14th over. It is worth mentioning that teams will be allowed to substitute only at the end of an over barring a couple of exceptional cases (batting team substitutes at the fall of a wicket and bowling team substitutes if a fielder gets injured in between an over). Points to note for Impact Player substitutions 1) Only one Impact Player per team will be allowed in a match. 2) Introducing an Impact Player in a match is not mandatory. 3) Player replaced by the Impact Player won’t be allowed to take part in the remainder of the match (not even as a fielding substitute). 4) If an Impact Player gets injured, normal playing conditions around substitutions will be followed. The post Impact Player rule in T20: What is the new Impact Player rule in Syed Mushtaq Ali Trophy? appeared first on The SportsRush.","pubDate":"2022-09-17 13:57:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BCCI set to introduce ‘Impact Player’ rule in domestic T20; find out how he can be a game-changer","link":"https://www.tribuneindia.com/news/sports/bcci-set-to-introduce-impact-player-rule-in-domestic-t20-find-out-how-he-can-be-a-game-changer-432699","keywords":null,"creator":null,"video_url":null,"description":"IANS New Delhi, September 17 The Board of Control for Cricket in India (BCCI) is set to introduce tactical substitutes, which will be known as 'Impact Player', in the upcoming season of its domestic men's T20 tournament, mainly the Syed Mushtaq Ali Trophy, which will begin on October 11. The idea behind introducing 'Impact Player' is to make the T20 format more attractive, dynamic and interesting. In an email sent to its state associations, the BCCI elaborated on the concept and rule, which will allow teams to use one tactical substitute in each match. According to an ESPNcricinfo report, the BCCI has been keen to introduce the tactical substitute in the IPL for the past few years. However, the board wants to implement it in the SMAT first. If it works smoothly, the 'Impact Player' substitute will feature in IPL 2023. \"With the ever-growing popularity of T20 cricket, it is imperative that we look at introducing new dimensions which will make this format more attractive and interesting not only for our viewers but also the participating teams from a strategic viewpoint,\" the BCCI's email said. \"The BCCI would like to introduce the concept of 'Impact Player' wherein participating teams could replace one member of its playing XI during a T20 match based on the context of the game,\" it added. Substitute's role Along with the starting XI, teams will name four substitutes in their team sheet at the toss, and use one of the four during the match. The player can replace any member of the starting XI at any point before the end of the 14th over of either inning and will be able to bat and bowl his full allotment of overs. \"Tactically, the Impact Player can play any role during the game. For example, the Impact Player can replace a batter who has already been dismissed and still get to bat - as long as the team only uses 11 batters. Or he could replace a bowler who has already sent down a few overs and still get to bowl his full four-over quota,\" it added. Likely scenarios to use the tactical sub The rule has the potential to reduce the impact of the toss. For example, if a team loses the toss and has to bowl second when the dew sets in, it has the opportunity to strengthen its bowling attack for that challenge. Similarly, on a pitch that is turning square, the team batting second could boost its batting with an extra batter. The ruling will also help teams offset the impact of a player picking up an injury during the game. Will teams be allowed an Impact Player in shortened games? Yes, but not if a delayed start reduces the match to fewer than ten overs per side. If the scheduled number of overs per innings is more than ten, the Impact Player can be introduced, with a sliding cut-off point. For example, in a 17-overs-a-side game, the Impact Player can come on before the end of the 13th over of either inning. In an 11-overs-a-side game, he can enter before the end of the ninth over. If the match begins as a full T20 game, and if the side batting first has faced at least ten overs when there is an interruption in play, both teams will be able to use an Impact Player regardless of the extent of reduction of overs. If the match is reduced such that one team has already used its Impact Player, but the second innings is reduced to less than ten overs, the second team can still use its Impact Player -- before the end of the seventh over in a nine-over innings, for example, or before the end of the third over in a five-over innings. Other aspects of Impact Player rule The Impact Player can only be introduced at the end of an over, and not during it, with two exceptions: if a batting team sends in the Impact Player at the fall of a wicket, or if the fielding team replaces an injured fielder with the Impact Player in the middle of an over. The substituted player can take no further part in the game -- not even as a substitute fielder. In a scenario where a bowler is suspended, having bowled two beamers in an over, he can be replaced by the Impact Player, but that player cannot bowl.","content":"IANS New Delhi, September 17 The Board of Control for Cricket in India (BCCI) is set to introduce tactical substitutes, which will be known as ‘Impact Player’, in the upcoming season of its domestic men’s T20 tournament, mainly the Syed Mushtaq Ali Trophy, which will begin on October 11. The idea behind introducing ‘Impact Player’ is to make the T20 format more attractive, dynamic and interesting. In an email sent to its state associations, the BCCI elaborated on the concept and rule, which will allow teams to use one tactical substitute in each match. According to an ESPNcricinfo report, the BCCI has been keen to introduce the tactical substitute in the IPL for the past few years. However, the board wants to implement it in the SMAT first. If it works smoothly, the ‘Impact Player’ substitute will feature in IPL 2023. \"With the ever-growing popularity of T20 cricket, it is imperative that we look at introducing new dimensions which will make this format more attractive and interesting not only for our viewers but also the participating teams from a strategic viewpoint,\" the BCCI’s email said. \"The BCCI would like to introduce the concept of ‘Impact Player’ wherein participating teams could replace one member of its playing XI during a T20 match based on the context of the game,\" it added . Substitute’s role Along with the starting XI, teams will name four substitutes in their team sheet at the toss, and use one of the four during the match. The player can replace any member of the starting XI at any point before the end of the 14th over of either inning and will be able to bat and bowl his full allotment of overs. \"Tactically, the Impact Player can play any role during the game. For example, the Impact Player can replace a batter who has already been dismissed and still get to bat - as long as the team only uses 11 batters. Or he could replace a bowler who has already sent down a few overs and still get to bowl his full four-over quota,\" it added. Likely scenarios to use the tactical sub The rule has the potential to reduce the impact of the toss. For example, if a team loses the toss and has to bowl second when the dew sets in, it has the opportunity to strengthen its bowling attack for that challenge. Similarly, on a pitch that is turning square, the team batting second could boost its batting with an extra batter. The ruling will also help teams offset the impact of a player picking up an injury during the game. Will teams be allowed an Impact Player in shortened games? Yes, but not if a delayed start reduces the match to fewer than ten overs per side. If the scheduled number of overs per innings is more than ten, the Impact Player can be introduced, with a sliding cut-off point. For example, in a 17-overs-a-side game, the Impact Player can come on before the end of the 13th over of either inning. In an 11-overs-a-side game, he can enter before the end of the ninth over. If the match begins as a full T20 game, and if the side batting first has faced at least ten overs when there is an interruption in play, both teams will be able to use an Impact Player regardless of the extent of reduction of overs. If the match is reduced such that one team has already used its Impact Player, but the second innings is reduced to less than ten overs, the second team can still use its Impact Player -- before the end of the seventh over in a nine-over innings, for example, or before the end of the third over in a five-over innings. Other aspects of Impact Player rule The Impact Player can only be introduced at the end of an over, and not during it, with two exceptions: if a batting team sends in the Impact Player at the fall of a wicket, or if the fielding team replaces an injured fielder with the Impact Player in the middle of an over. The substituted player can take no further part in the game -- not even as a substitute fielder. In a scenario where a bowler is suspended, having bowled two beamers in an over, he can be replaced by the Impact Player, but that player cannot bowl.","pubDate":"2022-09-17 12:39:41","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_485771431.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC: O'Brien Stars As Gujarat Giants Beat India Capitals By 3 Wickets","link":"https://sports.ndtv.com/cricket/india-capitals-vs-gujarat-giants-legends-league-cricket-2022-live-updates-3353474","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket Highlights: Kevin O'Brien starred with the bat as Gujarat Giants defeated India Capitals by three wickets in the opening match at the Eden Gardens.","content":null,"pubDate":"2022-09-17 12:32:04","image_url":"https://c.ndtvimg.com/2022-09/saoou1jo_kevin-obrien-240_120x90_17_September_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Reminded me how much I love cricket: Chris Woakes talks about his battle with injury","link":"https://www.indiatoday.in/sports/cricket/story/reminded-me-how-much-i-love-cricket-chris-woakes-talks-about-his-battle-with-injury-2001446-2022-09-17?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Reminded me how much I love cricket: Woakes talks about his battle with injury","content":null,"pubDate":"2022-09-17 11:40:36","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa 2nd T20 online booking cost price: How to do online ticket booking for cricket match in Guwahati?","link":"https://thesportsrush.com/cricket-news-india-vs-south-africa-2nd-t20-online-booking-cost-price-how-to-do-online-ticket-booking-for-cricket-match-in-guwahati/","keywords":["Cricket","Ind vs SA","South Africa tour of India"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"India vs South Africa 2nd T20 online booking cost price: Guwahati will host the 2nd T20I between IND vs SA on 2nd October. After the upcoming 3-match T20I series against Australia, the Indian team will face South Africa in a 3-match T20I & ODI series. The T20Is against South Africa will be the last T20I… The post India vs South Africa 2nd T20 online booking cost price: How to do online ticket booking for cricket match in Guwahati? appeared first on The SportsRush.","content":"India vs South Africa 2nd T20 online booking cost price: Guwahati will host the 2nd T20I between IND vs SA on 2nd October. After the upcoming 3-match T20I series against Australia, the Indian team will face South Africa in a 3-match T20I & ODI series. The T20Is against South Africa will be the last T20I series for India ahead of the T20 World Cup. Both teams would want to do well in the series. Thiruvananthapuram, Guwahati, and Indore will be hosting the T20Is of the series. The series will start on 28 September 2022, whereas the last T20I will be played on 4th October 2022. India vs South Africa 2nd T20 online booking cost price Guwahati’s Barsapara Cricket Stadium will host the 2nd T20I match of the India vs South Africa series on 2 October 2022. Guwahati will be hosting an international match after a span of more than 2 years, and there is a lot of excitement for the same amongst the fans. The ticket sales started from 16 September 2022, and ACA secretary, Debajit Saikia confirmed that the tickets will be sold in two phases on the Bookmyshow platform. 15,000 tickets will be sold in the first phase which started from 16 September 2022, whereas 5,000 tickets will be sold in the second phase starting on 26 September. Reviewed preparations for India-South Africa T20 match in Guwahati on Oct 2 with Assam Cricket Association,PWD, Sports Dept, Fire & Emergency Services and Power Dept officials. Asked police to make spl traffic arrangement to avoid jams as the match will coincide with Durga Puja. pic.twitter.com/3Tr1UiDvlI — Himanta Biswa Sarma (@himantabiswa) September 2, 2022 It is to be noted that the tickets for the first phase are already sold out. The ticket price starts from Rs 475, which is only for students. The normal tickets start from Rs 1500, and it goes to Rs 6000. Right now, the tickets are available via online modes only. Students tickets (West Stand 2nd Floor): Rs 475 East Stand 2nd Floor: Rs 1500 East and West Stand 1st Floor: Rs 2000 North and South Stand Top Floor: Rs 2000 East and West Stand Ground Floor: Rs 3000 North and South Stand Ground Floor: Rs 3500 North and South Stand 2nd Floor: Rs 4000 South Stand 1st Floor: Rs 6000 The users can directly book the tickets by clicking here. The post India vs South Africa 2nd T20 online booking cost price: How to do online ticket booking for cricket match in Guwahati? appeared first on The SportsRush.","pubDate":"2022-09-17 10:41:30","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Dada do you think you missed a trick”: Mohammad Kaif hints at Sourav Ganguly not spotting all-rounder in him after picking wicket in LLC Special Match","link":"https://thesportsrush.com/cricket-news-dada-do-you-think-you-missed-a-trick-mohammad-kaif-hints-at-sourav-ganguly-not-spotting-all-rounder-in-him-after-picking-wicket-in-llc-special-match/","keywords":["Cricket","Videos","India Maharajas","Legends League Cricket 2022","mohammad kaif","parwinder awana","Sourav Ganguly","thisara perera","World Giants"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Mohammad Kaif hints at Sourav Ganguly missing a trick: The former Indian batter rolled his arm for a couple of deliveries last night. LLC Special Match to kick-start the second season of Legends League Cricket was a success after India Maharajas chased down a 171-run target with six wickets and eight balls remaining in the… The post “Dada do you think you missed a trick”: Mohammad Kaif hints at Sourav Ganguly not spotting all-rounder in him after picking wicket in LLC Special Match appeared first on The SportsRush.","content":"Mohammad Kaif hints at Sourav Ganguly missing a trick: The former Indian batter rolled his arm for a couple of deliveries last night. LLC Special Match to kick-start the second season of Legends League Cricket was a success after India Maharajas chased down a 171-run target with six wickets and eight balls remaining in the match against World Giants. In a bit of spot of bother after being reduced to 50/3 in the seventh over, batter Tanmay Srivastava (54) and all-rounder Yusuf Pathan (50*) scored individual half-centuries in a match-winning 62-ball 103-run fourth-wicket partnership at the Eden Gardens last night. While Srivastava hit eight fours and a six at a strike rate of 138.46, Pathan hit five fours and two sixes at a strike rate of 142.85 during a counterattacking stand. Pathan was joined by younger brother Irfan Pathan (20*) in the 18th over as the latter hit three sixes to seal the chase in the penultimate over. However, Maharajas pacer Pankaj Singh was adjudged the Player of the Match for his bowling figures of 4-1-26-5. Called upon to bowl as a first-change bowler in the powerplay by captain Harbhajan Singh, Pankaj dismissed Hamilton Masakadza (18), Tatenda Taibu (7), Romesh Kaluwitharana (2), Tim Bresnan (0) and Daniel Vettori (0). Mohammad Kaif hints at Sourav Ganguly not spotting all-rounder in him after picking wicket in LLC Special Match Maharajas batter Mohammad Kaif, who scored a 12-ball 11 after coming in to bat at No. 4 yesterday, brought his bowling into the limelight via a tweet about an hour ago. Kaif, who had bowled a total of three overs across his 138-match international career, was needed to bowl a couple of deliveries to cover up for injured pacer Ashok Dinda. Welcomed by former Sri Lanka all-rounder Thisara Perera (23) into the bowling attack with a six, Kaif made immediate amends by picking a second-ball wicket. Kaif, who bowled a flighted delivery outside the off-stump, enticed Perera into playing another big shot. With the left-handed batter mis-timing the ball, Maharajas’ Parwinder Awana completed a catch at short third-man. Bringing into light his flight, drift and turn, Kaif asked his former India captain Sourav Ganguly if he missed a trick during his captaincy days by not recognizing an all-rounder in him. Special attention skipper: Please see the drift, flight and turn by Mohammad Kaif the all-rounder. Dada do you think you missed a trick? ⁦@SGanguly99⁩ pic.twitter.com/7Of9RKRS9o — Mohammad Kaif (@MohammadKaif) September 17, 2022 Having made his ODI debut under Ganguly, Kaif went on to represent India in 87 matches across formats under him. The post “Dada do you think you missed a trick”: Mohammad Kaif hints at Sourav Ganguly not spotting all-rounder in him after picking wicket in LLC Special Match appeared first on The SportsRush.","pubDate":"2022-09-17 10:24:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“The best headline ever written about me”: When Kevin Pietersen was bought by RCB for $1.5M in IPL 2009 auction","link":"https://thesportsrush.com/cricket-news-the-best-headline-ever-written-about-me-when-kevin-pietersen-was-bought-by-rcb-for-1-5m-in-ipl-2009-auction/","keywords":["Cricket","IPL","kevin pietersen","RCB"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"English all-rounder Kevin Pietersen was bought by the Royal Challengers Bangalore in IPL 2009 for a price of $1.5 Million. English batter Kevin Pietersen has to be one of the most decorated cricketers England has ever produced. It is safe to say that if Pietersen would have played his full years of England, he would… The post “The best headline ever written about me”: When Kevin Pietersen was bought by RCB for $1.5M in IPL 2009 auction appeared first on The SportsRush.","content":"English all-rounder Kevin Pietersen was bought by the Royal Challengers Bangalore in IPL 2009 for a price of $1.5 Million. English batter Kevin Pietersen has to be one of the most decorated cricketers England has ever produced. It is safe to say that if Pietersen would have played his full years of England, he would have broken a lot of records. The personality of Pietersen made him an icon both on and off the field. Pietersen scored 8181 test runs with the help of 23 centuries and 35 half-centuries, whereas he also has 4440 ODI and 1176 T20I runs under his belt. Apart from International cricket, Pietersen made his presence known in almost every big T20 League around the world. When Kevin Pietersen was bought by RCB for $1.5M Kevin Pietersen recalled the incident when he was bought for a hefty amount by RCB in the IPL 2009 auction. Pietersen was one of the first players from England to take part in the tournament as it was getting a lot of backlashes back him. KP and English all-rounder Andrew Flintoff was part of the auction, and both of them were bought for the exact same price. Pietersen was bought by RCB, whereas Flintoff was bought by CSK for $1.5 million (INR 7.5 crore) each. He recalls there was a headline in the newspaper as ‘Dumb Slog Millionaire’, and it is the best headline that he has read about himself. “The IPL auction – which takes place for the 2021 competition on Thursday – can be very exciting, or very disappointing. It’s as simple as that. You can get signed for big money and see your life change, or you can sit there with nothing,” Pietersen said as quoted as saying by Daily Mirror. “In 2009, me and Freddie found out we’d gone for $1.5m in the middle of a Test match in the Caribbean. The next day I slogged one up in the air on 97, and the headline was, ‘Dumb Slog Millionaire’ I still think that was the best headline ever written about me.” Until today, only one England player has captained the team in IPL – Kevin Pietersen in 2009-14. Eoin Morgan is likely to become the second (Buttler if confirmed, might become the third).#MIvKKR #IPL2020 — Kausthub Gudipati (@kaustats) October 16, 2020 RCB played very well in the 2009 season, and they manage to make it to the finals, but Pietersen had a tournament to forget with the bat. He managed to score just 93 runs in 6 games at an average of 15.50. The post “The best headline ever written about me”: When Kevin Pietersen was bought by RCB for $1.5M in IPL 2009 auction appeared first on The SportsRush.","pubDate":"2022-09-17 10:04:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sydney defy thrilling Collingwood comeback to win through to AFL grand final","link":"https://www.theguardian.com/sport/2022/sep/17/sydney-defy-thrilling-collingwood-comeback-to-win-through-to-afl-grand-final","keywords":["Sport","Sydney Swans","AFL","Collingwood","Australian rules football","Australia sport"],"creator":["Angus Fontaine"],"video_url":null,"description":"Sydney 14.11.95 defeated Collingwood 14.10.94The Swans now play Geelong in the 2022 grand fin al next weekSydney will meet Geelong in the 2022 AFL grand final, after the Swans held off a courageous Collingwood comeback by one point to win a thrilling preliminary final 14.11.95 to 14.10.94 before an ecstatic 45,608 fans at the Sydney Cricket Ground.Having waited 72 years for their iconic 2005 premierships, the Swans will now look for their second AFL flag in a decade as they prepare to take on the Cats, who purred into the decider with a 71-point obliteration of Brisbane at the MCG on Friday night. But they went within a whisker of blowing it as Collingwood overcame a four-goal deficit to close within a kick. In the end, a brave Bloods outfit did enough to hold on. Continue reading...","content":null,"pubDate":"2022-09-17 10:01:57","image_url":"https://i.guim.co.uk/img/media/57e2a91c9d50059e1df8c6a09c38ca45002a01de/0_176_5330_3200/master/5330.jpg?width=460&quality=85&auto=format&fit=max&s=b0cf1225f731416a20cc38ad644155cf","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Hopefully, I am in the starting XI”: Pat Cummins shows hesitancy in taking up Australia ODI captaincy role","link":"https://thesportsrush.com/cricket-news-hopefully-i-am-in-the-starting-xi-pat-cummins-shows-hesitancy-in-taking-up-australia-odi-captaincy-role/","keywords":["Cricket","Pat Cummins"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian test captain Pat Cummins has said that he will be happy if he can be a regular part of Australia’s ODI playing 11. The search for the new Australian ODI captain is on after the retirement of Aaron Finch. Finch recently led Australia in the 3-match ODI series against New Zealand, where the hosts… The post “Hopefully, I am in the starting XI”: Pat Cummins shows hesitancy in taking up Australia ODI captaincy role appeared first on The SportsRush.","content":"Australian test captain Pat Cummins has said that he will be happy if he can be a regular part of Australia’s ODI playing 11. The search for the new Australian ODI captain is on after the retirement of Aaron Finch. Finch recently led Australia in the 3-match ODI series against New Zealand, where the hosts completed a whitewash. Finch was going through a very rough phase in ODIs, and he took his retirement to focus on the T20 format. There are quite a few potential candidates to take up the leadership role in ODIs. It is interesting that there is no concrete candidate to take up the role from Finch. Carey led Australia in West Indies when Finch was unavailable, but the majority of the senior players were absent from that tour. Pat Cummins hesitant in taking up Australia ODI captaincy Australian test captain Pat Cummins recently said that he is not interested in taking up the ODI captaincy of Australia as he believes that it won’t be feasible for a pacer to lead in all three formats of the game. Ahead of the Indian ODI series, Cummins has re-iterated the same fact. Cummins said that the team is in no rush about naming the ODI captain of the side as Australia won’t play an ODI game before the T20 World Cup 2022. He said that there are quite a few senior players in the side, who can take up the captaincy role and insists that he will be happy if he can be a part of the playing eleven regularly. “I think we are in no rush. We will chat through a few of those different options. Good thing is that we have plenty of options. There’s Steve Smith, Mitchell Marsh, Alex Carey, Josh Hazlewood, Adam Zampa,” Cummins said in an interview with ABC. A true champion of the white-ball game. Aaron Finch will retire from one-day cricket after tomorrow’s third and final Dettol ODI vs New Zealand, with focus shifting to leading Australia at the #T20WorldCup pic.twitter.com/SG8uQuTVGc — Cricket Australia (@CricketAus) September 9, 2022 “We have got a lot of senior guys in the line-up, who could do a very good job. Hopefully, I am in the starting XI, and I will be happy.” A few days ago, Cummins backed David Warner to be the new captain of Australia’s ODI squad. Even Warner has said that he will beready to do the role if the board approaches him. The post “Hopefully, I am in the starting XI”: Pat Cummins shows hesitancy in taking up Australia ODI captaincy role appeared first on The SportsRush.","pubDate":"2022-09-17 09:34:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BCCI set to introduce tactical substitutions in Syed Mushtaq Ali Trophy T20s - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2ltcGFjdC1wbGF5ZXItcnVsZS1pbi1kb21lc3RpYy10MjAtYmNjaS1zZXQtdG8taW50cm9kdWNlLXRhY3RpY2FsLXN1YnN0aXR1dGlvbnMtaW4tdGhlLXN5ZWQtbXVzaHRhcS1hbGktdHJvcGh5LTEzMzUyNjbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BCCI set to introduce tactical substitutions in Syed Mushtaq Ali Trophy T20s  ESPNcricinfoBCCI to allow player substitution in Syed Mushtaq Ali Trophy | Cricbuzz.com - Cricbuzz  CricbuzzBCCI announces new 'Impact Player' rule for domestic T20s: Here is how it works  Hindustan Times`Impact Player` rule EXPLAINED, BCCI`s new T20 concept that can change IPL forever  Zee NewsEXPLAINED | What is an Impact Player- BCCI's New Concept in Domestic Cricket  News18View Full coverage on Google News","content":null,"pubDate":"2022-09-17 09:29:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS Hyderabad tickets price: How to book India vs Australia T20 Hyderabad tickets online?","link":"https://thesportsrush.com/cricket-news-ind-vs-aus-hyderabad-tickets-price-how-to-book-india-vs-australia-t20-hyderabad-tickets-online/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs AUS Hyderabad tickets: The first phase of ticket sales received immense response from fans in Hyderabad. The third T20I of the imminent Australia’s tour of India will be played in Hyderabad as international cricket will return to the city after almost three years. Last of a three-match T20I series, fans can expect an… The post IND vs AUS Hyderabad tickets price: How to book India vs Australia T20 Hyderabad tickets online? appeared first on The SportsRush.","content":"IND vs AUS Hyderabad tickets: The first phase of ticket sales received immense response from fans in Hyderabad. The third T20I of the imminent Australia’s tour of India will be played in Hyderabad as international cricket will return to the city after almost three years. Last of a three-match T20I series, fans can expect an enthralling contest especially ahead of a potential series-decider between two A-list teams in the shortest format. Although Australia will be without a key quartet of their squad, potent replacements call for quite a strong Australian T20I squad. An India vs West Indies T20I in December 2019 was the last international match to be played at the Rajiv Gandhi International Stadium. In what remains the solitary T20I here, Australia will be playing their first-ever T20I at this venue next week. It is noteworthy that an India-Australia T20I series-decider had to be played in Hyderabad half-a-decade ago. In what would’ve been the first-ever T20I here, it ended up being abandoned without a ball being bowled due to inclement weather conditions. How to book India vs Australia T20 Hyderabad tickets online? While the tickets for the second India-Australia T20I in Nagpur are yet to be put on sale, tickets for the third T20I have been sold out in the first phase of booking. An immense response from fans in Hyderabad witnessed booking of close to 39,000 tickets on the first day itself. Having said that, a second round of ticket sales is expected to begun in the near future. With the tickets being made available on online platform Paytm Insider, interested fans are advised to keep checking the website on an hourly basis. All they have to do is search “Mastercard Series” in the search box. The option of “Buy Now” will be available on the right side of computer screens. Click on the same, select seats of the preferred price category (mentioned below in detail) and follow simple steps to complete the online transaction. IND vs AUS Hyderabad tickets price North First Terrace – INR 850. North Second Terrace – INR 850. South Second Terrace – INR 1,000. South First Terrace – INR 1,250. East First Floor – INR 1,500. West First Floor – INR 1,500. East Ground Floor – INR 2,500. West Ground Floor – INR 2,500. ALSO READ: Ticket prices at VCA Stadium Jamtha, Nagpur, for IND vs AUS 2nd T20I North First Floor – INR 5,000. North Ground Floor – INR 7,500. South First Floor – INR 7,500. South Ground Floor – INR 10,000. North Corporate Box – INR 12,500. South Corporate Box – INR 15,000. The post IND vs AUS Hyderabad tickets price: How to book India vs Australia T20 Hyderabad tickets online? appeared first on The SportsRush.","pubDate":"2022-09-17 09:10:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2023: Speculated Impact Player Rule in development, more than 11 players will participate | READ","link":"https://www.indiatvnews.com/sports/cricket/ipl-2023-speculated-impact-player-rule-in-development-more-than-11-players-will-participate-read-bcci-jay-shah-2022-09-17-809095","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: When it comes to the game of cricket, the Board of Control for Cricket in India has always been doing something that can raise the bar of the game. Earlier on September 17, 2022, reports surfaced that the BCCI is developing an Impact Player Rule that might be a part of the upcoming season of the Indian Premier League (IPL). The main feature of this rule will be to allow more than 11 players to take the field in a game of cricket. ","content":"When it comes to the game of cricket, the Board of Control for Cricket in India has always been doing something that can raise the bar of the game. Earlier on September 17, 2022, reports surfaced that the BCCI is developing an Impact Player Rule that might be a part of the upcoming season of the Indian Premier League (IPL). The main feature of this rule will be to allow more than 11 players to take the field in a game of cricket. This rule is certainly not new for any sports fan and has been used accordingly both in Hockey and soccer. Similar to how things are done and managed in both these sports, cricket might end up following the same path. The specialty of the rule is that it can be implemented in the first 14 overs of each innings which will give teams a better chance to put their plans in place and increase their chances of winning a match. After the 14th over ends, the rule can't be implemented. Reports suggest that the testing of this rule might begin with the commencement of the upcoming Syed Mushtaq Ali Trophy. This development is somewhat related to the Super-Sub rule that was introduced in cricket a few years back. The rule has been named \"Impact Player\". This is almost similar to the \"X-factor\" rule that is a part of the Big Bash League and allows the teams to play with 13 players. But before it debuts on the big stage, the new rule will be tested in the domesticate circuit just to determine the flaws and intricacies involved with it. As per sources close to the BCCI, it is said that the board has sent a circular to all the circular which says that the new rule has been put in place due to the rise of viewership in the shortest format of the game. As of now, the rule sounds like an amazing prospect and is bound to create curiosity and excitement among the fans of the game.","pubDate":"2022-09-17 08:52:38","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}