{"newsArray":[{"title":"Can play in front of millions, but was once ‘petrified’ of the ocean","link":"https://www.brisbanetimes.com.au/sport/afl/can-play-in-front-of-millions-but-was-once-petrified-of-the-ocean-20230523-p5dagr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter Ryan"],"video_url":null,"description":"Pies stalwart Steele Sidebottom plays his 300th game on Sunday, and his close friends and teammates have shared their stories of a laid-back, fun-loving, competitive beast.","content":"Loading Collingwood’s Steele Sidebottom has never been one to pump himself up. Nor has he chased the limelight. But he could not resist interrupting his premiership skipper Nick Maxwell - who had joined the club as a rookie - during a pre-season session where the captain emphasised to the club’s recruits that regardless of what number pick they had been when they arrived, they were all equally entitled to play in round one. Collingwood’s Steele Sidebottom, who reaches 300 AFL games on Sunday, with the statue of Bob Rose. Credit: Getty Images Maxwell extolled the virtues of his rookie brethren, praising them for their persistence and resilience and making it pretty obvious he had a soft spot for footy’s battlers. The speech became all a bit rich for Sidebottom. “Sorry for being a gun and kicking 10 in a granny,” Sidebottom suddenly blurted out. The room dissolved into laughter. Premiership player Steele Sidebottom is one of the constants between the 2010 and 2023 sides. Credit: Getty Images That bag of 10 for the Murray Bushrangers in the 2008 TAC Cup grand final ensured he was a first-round pick, Collingwood using selection 11 to make him a Magpie. It was the first thing his new teammates heard about him. Soon enough, however, they were talking about his constant smile, his skills on both sides of his body and his clean hands, and his competitiveness. “He is realistically one of the most competitive people I have ever met,” said Jarryd Blair, the former Pie who also joined the club as a rookie, and who remains one of Sidebottom’s great mates. His friend Sam Muggleton told The Age that Sidebottom had been “a gun” from the moment they first played together as primary school children in a combined team from Shepparton. Celebrate if you’ve kicked 10 goals in a TAC Cup grand final: Steele Sidebottom can. Credit: Getty Images At Sidebottom’s wedding in 2022, Muggleton recalled in his speech a bloke with a rat’s tail rocking up to training for that team late in the piece and being picked immediately. Their first game was tight before Sidebottom stepped up to kick one goal with his left foot from the right forward pocket, and then the winning goal with his right foot from the left forward pocket. He had learned to kick on both feet because he idolised his older brother Tyson - who he cheekily described on Wednesday as the favourite of his four older brothers - who was proficient on both feet. Sidebottom spent hours booting a footy into the back fence, alternating feet to keep it interesting. “I’ve always had some kind of ball in my hand. I played touch footy, soccer, cricket, tennis, whatever it is,” Sidebottom said. The endurance beast Another of his mates from around Shepparton, Michael Morey, knew his friend’s ball skills were good, but it wasn’t until they were in their teens he realised he had other athletic attributes. The pair had faced off in Morey’s family orchard with three small apples in their hands to ping at each other. Morey moved first, but each throw missed. He had to run. Loading Soon after he took off, he felt Sidebottom’s breath on his neck despite the fact he was sprinting to get away. “He just slowly sat behind me for the next 500 metres and as soon as I started puffing a little bit, bang, apple in the back of the head. He got all three into me and I remember thinking, ‘This guy can run’,” Morey said. Close to 20 years after that horseplay revealed his tank, Sidebottom is still covering more ground during matches than all but one or two of his teammates, reaching “anywhere from 13 to 15 [kilometres] a game”. Blair, his premiership teammate who arrived at the club a month after Sidebottom, said his endurance had set him apart from his peers. He remembered Sidebottom revealing to him at the start of their second season that he had gone for one five-kilometre run in the off-season as he felt guilty after a few consecutive days spent socialising. Steele Sidebottom and Jarryd Blair were front and centre in the 2010 premiership team. which contained eight players who started their careers on a rookie list. Credit: Paul Rovere “He then won the 2k time trial in about 6:05 minutes,” Blair said. Blair said it’s one thing to have the endurance Sidebottom possessed but another to push the body to extremes to empty the tank. A competitive animal That will to always push harder came from an innate competitiveness that Blair has seen hilariously play out time after time, on and off the field. In their first year, the pair and another rookie, Tristan Francis, settled down for a game of cricket in the courtyard of their house in Williamstown. Three hours later, with Sidebottom still batting, his mates had had enough and went inside. “He just straight batted it back like it was the fifth day of a Test match, and he was just trying to hang on,” Blair said. Loading That stubborn competitiveness is combined with a constant smile that his former coach Nathan Buckley calls the “opposite of a resting bitch face”. The battles on the golf course between him and Jeremy Howe - two friends whose laid-back demeanour masks their desire to win - are famous at the club. “Whether it’s golf, table tennis, tennis, goal kicking, or an argument there is minimal chance you’re going to beat him with his relentless competitive drive,” Howe said. “Being one of four brothers will create that within, I guess.” The smile is not just a facade. Sidebottom loves playing all sport, particularly football, and hanging out with his mates, his wife Alisha Edwards, who is a lawyer, and their daughter Matilda. His down-to-earth nature means 100 friends and family will be at Marvel Stadium on Sunday to watch him reach his milestone300th game, including his mum Linda, who Sidebottom bought a house for when his career took off to show his appreciation for her efforts raising five boys . “He’s still the same old Steele he was when I met him 15-20 years ago,” Morey said. Muggleton laughs at his friend’s competitiveness, saying they often end some sort of sporting battle with a beer, unable to talk to each other about what transpired as one of them will still be seething. Left or right foot, it never mattered to Steele Sidebottom. Credit: Getty Images The pair played football together at Congupna, where Muggleton, a year older, was captain. Such was Sidebottom’s love of the club, which carries the nickname, “the Road”, he ended his Hotmail at one stage with “Roaders”. He might appear a country boy through and through, but he hasn’t fooled Muggleton. Loading “He is scared of everything,” Muggleton said. He remembers taking Sidebottom fishing with his former teammate Adam Oxley, and Sidebottom yelling at them to pick up a fish that had dropped off the line after being caught. Muggleton finally said, “You do it”, and watched Sidebottom retreat like a defeated army. “He said, ‘No way’,” Muggleton recalled. Blair adds that his mate was “genuinely petrified” of the ocean when he first moved to the club, never moving beyond his waist. He then taught himself to swim better. Such fears do not translate to the middle of the MCG, with Blair simply describing his friend’s record in big games as “unreal”. Let me entertain you During his 299 matches, Sidebottom has played in front of 15,083,531 fans, with only teammate Scott Pendlebury and Essendon’s Dustin Fletcher showing their skills to more spectators. He won a flag in his second year, was runner-up in the Norm Smith Medal in the grand final replay behind Pendlebury, and after battling a bruised heel for several seasons midway through his career became a star during 2017 and 2018, earning All-Australian selection in 2018, was runner-up in a Brownlow Medal and became a dual Copeland Trophy winner. His 41-touch performance in the 2018 preliminary final is often forgotten due to Mason Cox’s heroics . He also won the 2016 Anzac Day Medal. He has been trouble free, apart from his COVID-19 breach in 2020 after a few drinks got out of hand. He served a four-game suspension and probably dashed any hopes he would replace Pendlebury as captain. Buckley, who was coach at the time, has enormous respect for him, as do all his teammates, with Sidebottom’s sense of humour often a ballast during difficult times at the club. “Steele keeps life relatively simple and then makes the difficult look ridiculously easy. He just loves being a part of the club and around the boys. He is just a balanced guy,” Buckley said. Blair played 144 games alongside Sidebottom, and knows his consistency is due to more than natural talent. Sidebottom said it would be wrong to say he is enjoying football more than ever under Craig McRae because he has always enjoyed it. Credit: Getty Images “He has a deep level of care for what he is doing and pride in his performance. He has obviously always been a high achiever in sports and carried that through with him the whole way. His desperation to win has always been evident and cool to see and be a part of,” Blair said. He said his quiet leadership and the direction he has guided the club in should not be underestimated, either. “He’s not a confrontational person, but he has got a strong sense of right from wrong, and he is pretty comfortable in sticking to what he believes is right and the best thing for him and everyone at the club,” Blair said. Now, as just the fourth Magpie and the 101st player ever to reach 300 games, he is already confirmed as a club great. Not that anyone would recognise his status in the game if they bumped into him having a quiet beer with his mates, which is where he seems most comfortable. Magpies skipper Darcy Moore says his influence has been profound on and off the field. “He is such a great teammate, so passionate and such a larrikin. He just never takes anything too seriously. He is always making jokes, and he is a really popular guy,” Moore said. But there is one thing Sidebottom is taking seriously, and that is Collingwood’s tilt at another premiership. Amid all the enjoyment, his focus on achieving that goal is at an all-time high. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Collingwood Magpies Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-05-27 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain?","link":"https://www.thetimesofbengal.com/sports/what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain/?utm_source=rss&utm_medium=rss&utm_campaign=what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand […] The post What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? first appeared on The Times of Bengal.","content":"New Delhi: Chennai Super Kings lock horns with defending champions Gujarat Titans in the 16th final of the Indian Premier League on Sunday at the Narendra Stadium in Ahmedabad. Rumours are also peaking high at the same time that this blockbuster finale will mark the end of CSK captain MS Dhoni’s cricketing career. The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand will be fighting for Dhoni and make it equal with Mumbai on most trophies won. But what happens if the IPL Final gets washed out due to rain ? Even though there are less chances of rain in Ahmedabad and if not a single ball is bowled due to the harsh weather conditions, then one with the highest position in the table will run away with the trophy. In the case, Gujarat Titans will claim a second successive title as they topped the league phase ahead of Chennai Super Kings. A minimum of 5 overs need to be bowled for a match to take place. If the match gets stopped in between the play then quite obviously Duckworth-Lewis (DLS) method will come into play to determine the winner. Gujarat Titans Squad: Wriddhiman Saha(w), Shubman Gill, Sai Sudharsan, Hardik Pandya(c), Vijay Shankar, David Miller, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami, Joshua Little, Srikar Bharat, Shivam Mavi, Odean Smith, Ravisrinivasan Sai Kishore, Pradeep Sangwan, Matthew Wade, Jayant Yadav, Dasun Shanaka, Abhinav Manohar, Alzarri Joseph, Darshan Nalkande, Urvil Patel, Yash Dayal. Chennai Super Kings Squad: Ruturaj Gaikwad, Devon Conway, Shivam Dube, Ajinkya Rahane, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Moeen Ali, Deepak Chahar, Tushar Deshpande, Maheesh Theekshana, Matheesha Pathirana, Mitchell Santner, Subhranshu Senapati, Shaik Rasheed, Akash Singh, Ben Stokes, Dwaine Pretorius, Sisanda Magala, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Bhagath Varma, Nishant Sindhu. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-27 18:17:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"स्ट्रीप क्लब में क्या कर रहे थे केएल राहुल जो अथिया शेट्टी को देनी पड़ी सफाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/athiya-shetty-had-to-explain-what-kl-rahul-was-doing-in-the-strip-club/articleshow/100557070.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया के स्टार ओपनर बल्लेबाज केएल राहुल चोटिल होने के कारण ब्रेक पर हैं। राहुल सर्जरी के बाद अपनी पत्नी और कुछ दोस्तों के साथ लंदन में हैं। हालांकि इस बीच वह स्ट्रीप क्लब के एक वीडियो को लेकर सुर्खियों में हैं। सोशल मीडिया पर एक वीडियो वायरल हुआ जिसमें दावा किया जा रहा है कि वह राहुल हैं।","content":"ओपनर बल्लेबाज केएल राहुल चोटिल होने के बाद इंडियन प्रीमियर लीग 2023 से बाहर हो गए। चोट काफी गंभीर था जिसके कारण उन्हें सर्जरी करानी पड़ी। सर्जरी के बाद वह ब्रेक पर हैं लेकिन इस बीच वह एक खास वजह से चर्चा में आ गए हैं। दरअसल सोशल मीडिया पर एक वीडियो वायरल हो रहा है जिसमें दावा किया जा रहा है कि उसमें दिखने वाला शख्स केएल राहुल हैं। यह वीडियो लंदन के एक स्ट्रीप क्लब की है, जहां उन्हें एंजॉय करते हुए देखा जा रहा है। ऐसे में सोशल मीडिया पर ट्रोलर्स को केएल राहुल पर निशाना साधने का मौका मिल गया। सोशल मीडिया पर उन्हें खूब सुनाया गया लेकिन राहुल ने कोई प्रतिक्रिया नहीं दी। हालांकि उनकी पत्नी अथिया शेट्टी ने जरूर ने सफाई दी है और ट्रोलर्स की क्लास भी लगा दी। अथिया ने अपने इंस्टाग्राम पर एक स्टोरी शेयर की जिसमें उन्होंने लिखा, 'मैं आम तौर पर किसी बात पर प्रतिक्रिया देने की जगह पर चुप रहना पसंद करती हूं लेकिन कभी कभी अपने आप के लिए भी खड़ा होना बहुत जरूरी हो जाता है।' अथिया आगे लिखती हैं कि, 'मैं, राहुल और मेरे दोस्त एक आम सी जगह पर गए थे जैसे कि बाकी सभी लोग जाते हैं। ऐसे कुछ भी कहीं से लेकर बातें बनाना बंद करिए। कुछ भी ऐसे कहने और लिखने से से पहले अपने फैक्ट को अच्छे से चेक जरूर कर लीजिए।' बता दें कि केएल राहुल अगले महीने ऑस्ट्रेलिया के खिलाफ होने वाले वर्ल्ड टेस्ट चैंपियनशिप के फाइनल से भी बाहर हो गए हैं। वह भारतीय टीम के सदस्य थे। उनकी जगह ईशान किशन को टीम में शामिल किया गया है। राहुल आईपीएल में लखनऊ सुपरजाइंट्स के कप्तान थे। उन्हें 1 मई को रॉयल चैलेंजर्स बैंगलोर के खिलाफ फील्डिंग करते समय चोट लगी थी। इसके बाद से ही वह टूर्नामेंट से बाहर हो गए थे। इसके बाद क्रुणाल पंड्या ने फिर टीम की कमान संभाली थी।","pubDate":"2023-05-27 18:10:54","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"फाइनल से पहले सीएसके के कोच ने भरी हुंकार, गुजरात टाइटंस को हर हाल हराएगी धोनी की सेना","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/gt-vs-csk-final-match-stephen-fleming-head-coach-ipl-2023/articleshow/100556809.cms","keywords":null,"creator":null,"video_url":null,"description":"GT vs CSK: इंडियन प्रीमियर लीग 2023 का फाइनल मुकाबला गुजरात टाइटंस और चेन्नई सुपर किंग्स के बीच खेला जाना है। दोनों टीमें इस मुकाबले के लिए अहमदाबाद के नरेंद्र मोदी स्टेडियम में भिड़ेगी। इस मैच से पहले सीएसके के कोच ने कहा है कि उनकी टीम की तैयारी पहले काफी बेहतर है।","content":"चेन्नई सुपरकिंग्स के मुख्य कोच स्टीफन फ्लेमिंग ने कहा कि उनकी टीम गुजरात टाइटंस के खिलाफ होने वाले इंडियन प्रीमियर लीग (आईपीएल) के फाइनल के लिए पहले की तुलना में बेहतर तैयार है। उन्होंने कहा कि उनकी टीम किसी भी परिस्थिति में खेलने के लिए तैयार रहेगी तथा अतीत में उन्होंने परिस्थितियों और पिचों का आकलन करने में गलती की थी। रविवार को फाइनल के दिन बारिश की संभावना जताई गई है। फ्लेमिंग ने मैच की पूर्व संध्या पर कहा, 'हमने चेन्नई के लिए खुद को इतनी अच्छी तरह से तैयार किया कि कुछ अवसरों पर हमें विरोधी टीम के मैदानों पर जूझना पड़ा। इसलिए फाइनल में थोड़ी चुनौती होगी लेकिन फाइनल में जीत दर्ज करने का हमारा रिकॉर्ड 50 प्रतिशत है।' उन्होंने कहा, 'हमें फाइनल में किस तरह की परिस्थितियां मिलेंगी हम इसको लेकर चिंतित नहीं हैं। दो पिच में से किसी एक का चयन किया जाएगा लेकिन हम चिंतित नहीं हैं। हम अतीत की तुलना में इस बार फाइनल के लिए बेहतर तैयार हैं।' इस बीच गुजरात टाइटंस के टीम निदेशक विक्रम सोलंकी ने कहा कि घरेलू परिस्थितियों की अच्छी समझ होने से उनकी टीम को फायदा मिलेगा। सोलंकी ने कहा, 'हमने यहां कई मैच खेले हैं और इस मामले में हम निश्चित तौर पर बेहतर स्थिति में है। हमने पिछले साल यहां फाइनल खेला था और बड़े मैचों में सफल रहे हैं।' गुजरात टाइटंस की टीम आईपीएल 2023 में लगातार दूसरी बार फाइनल में पहुंची है। लीग स्टेज में भी गुजरात का दमदार प्रदर्शन रहा है। ऐसे में फाइनल मैच में सीएसके के लिए गुजरात की चुनौती बिल्कुल भी आसान नहीं रहने वाली है। गुजरात टाइटंस लीग स्टेज में पॉइंट्स टेबल में पहले स्थान पर रही थी। हालांकि सीएसके भी चार बार की चैंपियन टीम है और धोनी की कप्तानी में इस टीम को मुश्किल परिस्थियों में भी जीतना आता है। ऐसे में फाइनल की टक्कर रोमांचक होने की उम्मीद है।","pubDate":"2023-05-27 17:37:15","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Bayern sack CEO Oliver Kahn, sports director Hasan Salihamidzic after title win-club","link":"https://indianexpress.com/article/sports/football/bayern-sack-ceo-oliver-kahn-sports-director-hasan-salihamidzic-after-title-win-club-8632539/","keywords":["Football","Sports"],"creator":null,"video_url":null,"description":null,"content":"Bayern Munich have parted ways with club CEO Oliver Kahn and Hasan Salihamidzic only minutes after they snatched their 11th straight Bundesliga title on the last matchday on Saturday, the club said. Kahn, who took over the position in 2021 succeeding Karl-Heinz Rummenigge, will be replaced by Jan-Christian Dreesen with immediate effect, the club said in a statement. “It was a difficult decision to part ways with Oliver but we came to the conclusion that based on the overall development a restaffing of the top position in the board,” Bayern said. Bayern beat Cologne 2-1 thanks to an 89th minute winner from Jamal Musiala and benefited from Borussia Dortmund’s 2-2 draw to win the title on goal difference. Also Read 'Insult to Kolkata's sporting culture, an undemocratic step': East Bengal... 'Ronaldo's right foot vs Messi's left foot?': Haaland picks Cristiano's r... 'Could've had 5,00,000 people in stadium today if we could fit them': On ... Marco Reus: Forever the bridesmaid Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more They were eliminated from the German Cup and the Champions League in the last eight despite changing coaches in late March with Thomas Tuchel taking over from Julian Nagelsmann in a surprise move.","pubDate":"2023-05-27 17:08:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"ये गिल मांगे मोर, इंडिया की नई रन मशीन, जो IPL में चौके से ज्यादा अब छक्के उड़ाने लगी है","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/shubman-gill-hits-more-sixes-in-ipl-2023-then-last-two-combined-seasons/articleshow/100556334.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: टेस्ट और वनडे में भारतीय क्रिकेट में अपनी जगह पक्की कर चुके शुभमन गिल को टी-20 स्पेशलिस्ट नहीं माना जाता था पर दाएं हाथ का यह ओपनर आईपीएल के 16वें सीजन में अपने खेल को अलग स्तर पर ले जा चुका है।","content":"आईपीएल 2023 का पहला मैच खेलने वाली दो टीमें चेन्नई सुपरकिंग्स और गुजरात टाइटंस के बीच सीजन का आखिरी यानी फाइनल मुकाबला भी खेला जा रहा है। दोनों टीमें इससे पहले मंगलवार को क्वालीफायर-1 में भिड़ी थीं। तब चेन्नई ने गुजरात को 15 रन से हराया था। उस मैच में गुजरात की हार की वजह जबरदस्त फॉर्म में चल रहे भारतीय क्रिकेट के नए रन मशीन शुभमान गिल का जल्दी आउट हो जाना था। गिल उस मुकाबले से पहले लीग राउंड के आखिरी दोनों मुकाबलों में शतक लगा चुके थे। हालांकि गिल ने इसकी भरपाई दूसरे क्वालीफायर मुकाबले में कर दी और एक और शतक लगाकर टीम को फाइनल में पहुंचा दिया। फाइनल में चेन्नई को अगर गुजरात को बड़े स्कोर से रोकना है तो उसे इस नई रन मशीन गिल को पिछले मैच की ही तरह जल्दी आउट करना होगा। शुभमन गिल ने दूसरे क्वालीफायर में मुंबई इंडियंस के खिलाफ 60 गेंदों पर 10 छक्कों और सात चौकों की मदद से 129 रनों की सनसनीखेज पारी खेली, जो आईपीएल 2023 में उनका तीसरा शतक था। गुजरात ने 233/3 के रूप में बड़ा स्कोर पोस्ट किया। इस तरह गिल ने आरसीबी के कप्तान फाफ डुप्लेसी को पछाड़कर फाइनल से पहले ही ऑरेंज कैप अपने नाम कर ली। 2023- 33 छक्के 2022- 11 छक्के 2021- 12 छक्के 2020- 9 छक्के 2019- 10 छक्के 2018- 5 छक्के इस साल शुभमन गिल अबतक कुल 16 मैच में 33 छक्के लगा चुके हैं, इतना तो उन्होंने बीते तीन सीजन में मिलाकर नहीं मारा। सीजन में सबसे ज्यादा 36 छक्के लगाकर वैसे तो फाफ डुप्लेसिस सबसे आगे हैं। मगर संयुक्त रूप से दूसरे नंबर पर मौजूद गिल की सबसे बड़ी ताकत छक्का मारने के साथ-साथ स्ट्राइक रोटेट करना भी है। उससे बड़ी ताकत पावरप्ले में गैप ढूंढने की है।","pubDate":"2023-05-27 16:42:05","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: Chennai Super Kings better prepared for IPL final compared to past, says Stephen Fleming","link":"https://indianexpress.com/article/sports/ipl/chennai-super-kings-better-prepared-for-ipl-final-compared-to-past-says-stephen-fleming-8632525/","keywords":["IPL 2023","Sports"],"creator":null,"video_url":null,"description":null,"content":"Chennai Super Kings head coach Stephen Fleming on Saturday said that the four-time winners are better prepared for the IPL final against Gujarat Titans than any other time in the past, when conditions affected their performance. Fleming said CSK’s win-loss ratio remained around 50 per cent because they would usually build and prepare their squads keeping the conditions and pitches at the home venue at Chepauk in mind, but that is not the case anymore. He said the team would be ready for any conditions — there are rains expected during the final here on Sunday — and that they have erred in reading conditions and pitches in the past. “We geared ourselves up so well for Chennai that we did struggle with conditions at times in away games, so the finals were always a little bit of a challenge, and our record is about 50 per cent of winning the final,” Fleming said during the pre-match press conference. “It is maybe due to the style of the game we created — a victim of being so good at home that we had to make adjustments when we went to a neutral venue.” Fleming said CSK were “a bit more rounded” this year. “Because of that going back to Chennai (for Qualifier 1), it was hard. I wanted to bowl (first) in the last qualifying game and batting proved to be the right call and MS (Dhoni) was the other way in the last game,” he said. Anbuden ➡️ Ahmedabad with a million whistles! 🥳 #GTvCSK #WhistlePodu #Yellove 🦁💛 pic.twitter.com/Tyjhxd1Nsf — Chennai Super Kings (@ChennaiIPL) May 23, 2023 https://platform.twitter.com/widgets.js “So we are well off the mark in trying to get the conditions right but the team is rounded enough to put performances together. Come the final, we are not worried as to what conditions we get, there are two pitches to choose from now but we are not too worried. We are a lot better placed than what we had been in the past,” he said. Advertisement The former New Zealand captain said that making early breakthroughs will be key for his side as GT batter Shubman Gill’s red-hot form presents the biggest challenge for CSK. “He (Gill) is playing really well. It (the plans) does not really change, you hope that you pick him up early, you have enough firepower to create an opportunity. The only thing that we are looking at is when you have got openers, when they are in such good form, there is an opportunity to get into the middle order. Advertisement “If we can get a couple of early breakthroughs then, (just like) in the last game we played there is an opportunity. But we got to get past him, he is playing really well,” Fleming said. For someone who has won IPL title four times with CSK, Fleming said it is not easy winning the trophy back-to-back. “So hard! It is impossible, it is going to be so hard for them (GT) to do it (laughs). No, they are a good side; you got to say ‘really well done’ to what they have put together in a short space of time,” he said. “I like the coaching staff a lot, they are really balanced guys. Ashish, for all his talking, has got a really good grasp of the game, his enthusiasm is really high after working with him in Chennai. We have a huge amount of respect for what they have done but it is very hard to go back to back.” Gujarat Titans ’ team director Vikram Solanki also returned the favour, but added that knowledge of conditions in their ‘home ground’ here should hold them in good stead. “We are definitely better for the experience for having played here, having played in the final (last year) here, and having been successful in those big games. We are better for it,” he said. Caution: Wear helmets and watch Shivam drive! 🦁💥 #WhistlePodu #Yellove 💛 @IamShivamDube pic.twitter.com/dfdIK9fXLQ — Chennai Super Kings (@ChennaiIPL) May 27, 2023 https://platform.twitter.com/widgets.js Advertisement “We entirely appreciate this sort of respect CSK have given. They have been a fabulous team for a good number of years now and we respect that. We are confident; what transpires on the day is what transpires on the day,” Solanki added. Solanki praised GT’s bowling trio of Mohammad Shami (28 wickets), Rashid Khan (27 wickets) and Mohit Sharma (24 wickets), who also are the top three wicket-takers in this IPL. Advertisement “If you look at the tournament in its entirety, the impact player rule has had a bearing on the number of batsmen that are playing, therefore, wicket-taking becomes all the more important. We have always being attacking minded, an attack that is able to take wickets in different conditions through different phases of the game,” he said. “That is our go-to, the ability to take wickets. All three have been quite brilliant this year, they have worked extremely hard and they deserve all the success that is coming their way.” The former England batter said at just 23, Gill could be an example for young batters to model their batting on. Advertisement Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more “For a young man, he is quite a brilliant technician as far as batting is concerned. He would certainly be one of the examples that you would like to use for young players on how to bat,” Solanki said. Also Read For CSK, Dhoni is a habit, he isn't retiring any time soon Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must ... Sometimes Virat celebrates more than the bowlers, says Anushka Sharma Now we are sure that Malli is in safe hands: MS Dhoni meets Matheesha Pat... “He has all of the qualities of a world-class player and he is just showing his skill level. Fortunately for us, he is in good form, he works very hard on his game, not just in practice. He is very conscious of the opposition that he is going to face, where he is likely to gain advantage, what are the dangers, what are the things that he is going to have to deal with.”","pubDate":"2023-05-27 16:41:18","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"“Hello friend, we meet again”: Jasprit Bumrah hints at international cricket return","link":"https://thenewsmill.com/2023/05/hello-friend-we-meet-again-jasprit-bumrah-hints-at-international-cricket-return/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Indian pace spearhead Jasprit Bumrah, who has been out of action for the last several months due to injury, seems to be on the path of a stunning comeback to the sport. The 29-year-old pacer posted a picture of his cricket shoes on his Instagram. “Hello friend, we meet again,” said Bumrah’s post caption. https://www.instagram.com/p/CsvzrL-KHuq/?hl=en In April, Bumrah underwent surgery on his lower back in New Zealand. The medical procedure was successful and helped Bumrah get free from pain. “Jasprit Bumrah underwent surgery on his lower back in New Zealand which was successful and he remains pain-free. The fast bowler was advised by the specialist to start his rehab six weeks after the surgery and accordingly, Bumrah commenced his rehab management at the National Cricket Academy (NCA) in Bengaluru from Friday,” said a press release from BCCI on April 15. Bumrah is out of action since September 2022 owing to a back injury and as a result, missed the ICC Men’s T20 World Cup 2022 in Australia. The ace pacer completed his rehabilitation at the National Cricket Academy (NCA) in Bengaluru and has been seen bowling in the nets but BCCI has chosen not to rush him back into action. The pacer also missed Indian Premier League (2023), in which he represents Mumbai Indians. Though MI reached playoffs, their bowling attack looked extremely toothless without Bumrah’s presence on numerous occasions. While fans wait to see Bumrah back on the field with his unique bowling action, he has been unable to join the team due to a recurring injury. He has attempted to make a comeback more than once since suffering a back injury in August last year which ruled him out of the Asia Cup. Initially, the injury did not seem serious as he was named in India’s T20 World Cup squad in September and even played the last two T20Is against Australia on September 23 and September 25 last year. Three days later, Bumrah did not play the first T20I against South Africa and it was learnt that he was taken for scans, which revealed a stress-related injury in his back. He was rushed to NCA and the scans there confirmed that the injury was serious. It ruled him out of the T20 World Cup, in which India achieved a semifinal finish. Bumrah resumed his rehab in November and started to bowl in mid-December. His progress seemed to be positive as he was added to the white-ball series played in January against Sri Lanka more than a week after the original squad was picked up. Bumrah had performed the match simulation exercises in the NCA, but discomfort resurfaced while taking up higher workloads during fitness drills in January. Scans revealed the development of a fresh niggle, which ruled him out of the Sri Lanka series and Border-Gavaskar Trophy against Australia. (ANI)","pubDate":"2023-05-27 16:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"When Gautam Gambhir Kicked Chair in Frustration Post KKR Win vs RCB in IPL 2016","link":"https://thesportsrush.com/cricket-news-when-gautam-gambhir-kicked-chair-in-frustration-post-kkr-win-vs-rcb-in-ipl-2016/","keywords":["Cricket","KKR","RCB","Gautam Gambhir","IPL 2016","Kolkata Knight riders","Royal Challenegers Bangalore"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Be it in the capacity of a player or in his role as the mentor of Lucknow Super Giants at present, Gautam Gambhir has made sure to not shy away from displaying his raw emotions to the ever-ready cameras panning towards him. His temperature perhaps soars higher by a couple of notches whenever he is… The post When Gautam Gambhir Kicked Chair in Frustration Post KKR Win vs RCB in IPL 2016 appeared first on The SportsRush.","content":"Be it in the capacity of a player or in his role as the mentor of at present, has made sure to not shy away from displaying his raw emotions to the ever-ready cameras panning towards him. Advertisement His temperature perhaps soars higher by a couple of notches whenever he is involved in an IPL fixture featuring former captain because of some past moments of uneasy tension between the two . During the 2016 edition of the coveted league, Gambhir had yet again indulged himself in an act which was not only unnecessary but had resultantly cost him 15% of match fee owing to unruly behavior. Advertisement En route a 186-run targetagainst RCB in Bengaluru, Gambhir-led had lost four wickets by the 11th over of the chase. However, the pair of (60*) and (39) nailed their respective power game to see their side home with five deliveries to spare. The moment (10*) smashed the winning boundary, a pumped-up Gambhir could not control his emotions and vented his frustration by kicking a chair placed in the dug out across the boundary rope. The southpaw batter, who was still with his pads on, was more than just excited with the way his team snatched victory from the jaws of defeat. Post kicking the chair, he perhaps also hurled a couple of expletives while looking at someone in the field of play. Loading embed instagram https://www.instagram.com/reel/CslGQYNNmrB/?utm_source=ig_embed&utm_campaign=loading After being fined with the Level 1 breach of the IPL code of conduct, the KKR skipper did accept his mistake while realizing that he shouldn’t have kicked the chair. Advertisement However, he was later quoted as saying by that despite being a role model, he, too, is entitled to have emotions and feelings which get naturally displayed on the field of action. “My brush with the authorities is not new. While I am repentant and embarrassed, I have never got the answer to one very basic question – Aren’t role models entitled to have emotions? Aren’t they human enough to express themselves or release their pent-up feelings? I think they, too, are by-products of the times and the society they are living in.” Eyeing on his third IPL title, Gambhir did manage to take KKR through to the playoffs that season by finishing at the fourth spot on the points table post the league stage. However, Kolkata ended up losing to by 22 runs in the Eliminator to crash out of the tournament. Advertisement","pubDate":"2023-05-27 16:32:35","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"‘He tells everyone, please keep watching me’: S Badrinath reveals how MS Dhoni’s last moment field changes produce wickets","link":"https://indianexpress.com/article/sports/ipl/he-tells-everyone-please-keep-watching-me-s-badrinath-reveals-how-ms-dhonis-last-moment-field-changes-produce-wickets-8632488/","keywords":["IPL 2023","Sports"],"creator":null,"video_url":null,"description":null,"content":"Former Chennai Super Kings player Subramaniam Badrinath revealed how skipper Mahendra Singh Dhoni tends to make maneuvers in the last moment before every delivery and occasionally they end up producing wickets. Speaking on Star Sports, Badrinath said, “He tells everyone, please keep watching me. Because that last minute adjustment, that two yard left or right could be the difference between a catch and a drop. It has happened many times.” “It’s important that we keep tuned into the game, and try to remain involved. Every ball is an event, and we complete the event and move onto the next event. That’s how he addresses every ball. He assures the field is right, the bowler is right,” he added. In response to a query about Dhoni’s conversation with the team in the 2010 final Badrinath said, “Every time there was a par total, and not so much of a par, he only said one thing; let’s try and save one run each.” “If we save a run each, we can make the score 10 runs extra. That’s what was going to be the difference, because these were under our control. Wickets will happen, but the small things; if everybody is trying to save one run, the score becomes a little extra,” he added. Also Read For CSK, Dhoni is a habit, he isn't retiring any time soon Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must ... Sometimes Virat celebrates more than the bowlers, says Anushka Sharma Now we are sure that Malli is in safe hands: MS Dhoni meets Matheesha Pat... Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more Super Kings will face defending Gujarat Titans on Sunday in the final of the IPL 2023 in Narendra Modi Stadium at Ahmedabad .","pubDate":"2023-05-27 16:19:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Can play in front of millions, but was once ‘petrified’ of the ocean","link":"https://www.brisbanetimes.com.au/sport/afl/can-play-in-front-of-millions-but-was-once-petrified-of-the-ocean-20230523-p5dagr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter Ryan"],"video_url":null,"description":"Pies stalwart Steele Sidebottom plays his 300th game on Sunday, and his close friends and teammates have shared their stories of a laid-back, fun-loving, competitive beast.","content":"Loading Collingwood’s Steele Sidebottom has never been one to pump himself up. Nor has he chased the limelight. But he could not resist interrupting his premiership skipper Nick Maxwell - who had joined the club as a rookie - during a pre-season session where the captain emphasised to the club’s recruits that regardless of what number pick they had been when they arrived, they were all equally entitled to play in round one. Collingwood’s Steele Sidebottom, who reaches 300 AFL games on Sunday, with the statue of Bob Rose. Credit: Getty Images Maxwell extolled the virtues of his rookie brethren, praising them for their persistence and resilience and making it pretty obvious he had a soft spot for footy’s battlers. The speech became all a bit rich for Sidebottom. “Sorry for being a gun and kicking 10 in a granny,” Sidebottom suddenly blurted out. The room dissolved into laughter. Premiership player Steele Sidebottom is one of the constants between the 2010 and 2023 sides. Credit: Getty Images That bag of 10 for the Murray Bushrangers in the 2008 TAC Cup grand final ensured he was a first-round pick, Collingwood using selection 11 to make him a Magpie. It was the first thing his new teammates heard about him. Soon enough, however, they were talking about his constant smile, his skills on both sides of his body and his clean hands, and his competitiveness. “He is realistically one of the most competitive people I have ever met,” said Jarryd Blair, the former Pie who also joined the club as a rookie, and who remains one of Sidebottom’s great mates. His friend Sam Muggleton told The Age that Sidebottom had been “a gun” from the moment they first played together as primary school children in a combined team from Shepparton. Celebrate if you’ve kicked 10 goals in a TAC Cup grand final: Steele Sidebottom can. Credit: Getty Images At Sidebottom’s wedding in 2022, Muggleton recalled in his speech a bloke with a rat’s tail rocking up to training for that team late in the piece and being picked immediately. Their first game was tight before Sidebottom stepped up to kick one goal with his left foot from the right forward pocket, and then the winning goal with his right foot from the left forward pocket. He had learned to kick on both feet because he idolised his older brother Tyson - who he cheekily described on Wednesday as the favourite of his four older brothers - who was proficient on both feet. Sidebottom spent hours booting a footy into the back fence, alternating feet to keep it interesting. “I’ve always had some kind of ball in my hand. I played touch footy, soccer, cricket, tennis, whatever it is,” Sidebottom said. The endurance beast Another of his mates from around Shepparton, Michael Morey, knew his friend’s ball skills were good, but it wasn’t until they were in their teens he realised he had other athletic attributes. The pair had faced off in Morey’s family orchard with three small apples in their hands to ping at each other. Morey moved first, but each throw missed. He had to run. Loading Soon after he took off, he felt Sidebottom’s breath on his neck despite the fact he was sprinting to get away. “He just slowly sat behind me for the next 500 metres and as soon as I started puffing a little bit, bang, apple in the back of the head. He got all three into me and I remember thinking, ‘This guy can run’,” Morey said. Close to 20 years after that horseplay revealed his tank, Sidebottom is still covering more ground during matches than all but one or two of his teammates, reaching “anywhere from 13 to 15 [kilometres] a game”. Blair, his premiership teammate who arrived at the club a month after Sidebottom, said his endurance had set him apart from his peers. He remembered Sidebottom revealing to him at the start of their second season that he had gone for one five-kilometre run in the off-season as he felt guilty after a few consecutive days spent socialising. Steele Sidebottom and Jarryd Blair were front and centre in the 2010 premiership team. which contained eight players who started their careers on a rookie list. Credit: Paul Rovere “He then won the 2k time trial in about 6:05 minutes,” Blair said. Blair said it’s one thing to have the endurance Sidebottom possessed but another to push the body to extremes to empty the tank. A competitive animal That will to always push harder came from an innate competitiveness that Blair has seen hilariously play out time after time, on and off the field. In their first year, the pair and another rookie, Tristan Francis, settled down for a game of cricket in the courtyard of their house in Williamstown. Three hours later, with Sidebottom still batting, his mates had had enough and went inside. “He just straight batted it back like it was the fifth day of a Test match, and he was just trying to hang on,” Blair said. Loading That stubborn competitiveness is combined with a constant smile that his former coach Nathan Buckley calls the “opposite of a resting bitch face”. The battles on the golf course between him and Jeremy Howe - two friends whose laid-back demeanour masks their desire to win - are famous at the club. “Whether it’s golf, table tennis, tennis, goal kicking, or an argument there is minimal chance you’re going to beat him with his relentless competitive drive,” Howe said. “Being one of four brothers will create that within, I guess.” The smile is not just a facade. Sidebottom loves playing all sport, particularly football, and hanging out with his mates, his wife Alisha Edwards, who is a lawyer, and their daughter Matilda. His down-to-earth nature means 100 friends and family will be at Marvel Stadium on Sunday to watch him reach his milestone300th game, including his mum Linda, who Sidebottom bought a house for when his career took off to show his appreciation for her efforts raising five boys . “He’s still the same old Steele he was when I met him 15-20 years ago,” Morey said. Muggleton laughs at his friend’s competitiveness, saying they often end some sort of sporting battle with a beer, unable to talk to each other about what transpired as one of them will still be seething. Left or right foot, it never mattered to Steele Sidebottom. Credit: Getty Images The pair played football together at Congupna, where Muggleton, a year older, was captain. Such was Sidebottom’s love of the club, which carries the nickname, “the Road”, he ended his Hotmail at one stage with “Roaders”. He might appear a country boy through and through, but he hasn’t fooled Muggleton. Loading “He is scared of everything,” Muggleton said. He remembers taking Sidebottom fishing with his former teammate Adam Oxley, and Sidebottom yelling at them to pick up a fish that had dropped off the line after being caught. Muggleton finally said, “You do it”, and watched Sidebottom retreat like a defeated army. “He said, ‘No way’,” Muggleton recalled. Blair adds that his mate was “genuinely petrified” of the ocean when he first moved to the club, never moving beyond his waist. He then taught himself to swim better. Such fears do not translate to the middle of the MCG, with Blair simply describing his friend’s record in big games as “unreal”. Let me entertain you During his 299 matches, Sidebottom has played in front of 15,083,531 fans, with only teammate Scott Pendlebury and Essendon’s Dustin Fletcher showing their skills to more spectators. He won a flag in his second year, was runner-up in the Norm Smith Medal in the grand final replay behind Pendlebury, and after battling a bruised heel for several seasons midway through his career became a star during 2017 and 2018, earning All-Australian selection in 2018, was runner-up in a Brownlow Medal and became a dual Copeland Trophy winner. His 41-touch performance in the 2018 preliminary final is often forgotten due to Mason Cox’s heroics . He also won the 2016 Anzac Day Medal. He has been trouble free, apart from his COVID-19 breach in 2020 after a few drinks got out of hand. He served a four-game suspension and probably dashed any hopes he would replace Pendlebury as captain. Buckley, who was coach at the time, has enormous respect for him, as do all his teammates, with Sidebottom’s sense of humour often a ballast during difficult times at the club. “Steele keeps life relatively simple and then makes the difficult look ridiculously easy. He just loves being a part of the club and around the boys. He is just a balanced guy,” Buckley said. Blair played 144 games alongside Sidebottom, and knows his consistency is due to more than natural talent. Sidebottom said it would be wrong to say he is enjoying football more than ever under Craig McRae because he has always enjoyed it. Credit: Getty Images “He has a deep level of care for what he is doing and pride in his performance. He has obviously always been a high achiever in sports and carried that through with him the whole way. His desperation to win has always been evident and cool to see and be a part of,” Blair said. He said his quiet leadership and the direction he has guided the club in should not be underestimated, either. “He’s not a confrontational person, but he has got a strong sense of right from wrong, and he is pretty comfortable in sticking to what he believes is right and the best thing for him and everyone at the club,” Blair said. Now, as just the fourth Magpie and the 101st player ever to reach 300 games, he is already confirmed as a club great. Not that anyone would recognise his status in the game if they bumped into him having a quiet beer with his mates, which is where he seems most comfortable. Magpies skipper Darcy Moore says his influence has been profound on and off the field. “He is such a great teammate, so passionate and such a larrikin. He just never takes anything too seriously. He is always making jokes, and he is a really popular guy,” Moore said. But there is one thing Sidebottom is taking seriously, and that is Collingwood’s tilt at another premiership. Amid all the enjoyment, his focus on achieving that goal is at an all-time high. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Collingwood Magpies Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-05-27 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain?","link":"https://www.thetimesofbengal.com/sports/what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain/?utm_source=rss&utm_medium=rss&utm_campaign=what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand […] The post What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? first appeared on The Times of Bengal.","content":"New Delhi: Chennai Super Kings lock horns with defending champions Gujarat Titans in the 16th final of the Indian Premier League on Sunday at the Narendra Stadium in Ahmedabad. Rumours are also peaking high at the same time that this blockbuster finale will mark the end of CSK captain MS Dhoni’s cricketing career. The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand will be fighting for Dhoni and make it equal with Mumbai on most trophies won. But what happens if the IPL Final gets washed out due to rain ? Even though there are less chances of rain in Ahmedabad and if not a single ball is bowled due to the harsh weather conditions, then one with the highest position in the table will run away with the trophy. In the case, Gujarat Titans will claim a second successive title as they topped the league phase ahead of Chennai Super Kings. A minimum of 5 overs need to be bowled for a match to take place. If the match gets stopped in between the play then quite obviously Duckworth-Lewis (DLS) method will come into play to determine the winner. Gujarat Titans Squad: Wriddhiman Saha(w), Shubman Gill, Sai Sudharsan, Hardik Pandya(c), Vijay Shankar, David Miller, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami, Joshua Little, Srikar Bharat, Shivam Mavi, Odean Smith, Ravisrinivasan Sai Kishore, Pradeep Sangwan, Matthew Wade, Jayant Yadav, Dasun Shanaka, Abhinav Manohar, Alzarri Joseph, Darshan Nalkande, Urvil Patel, Yash Dayal. Chennai Super Kings Squad: Ruturaj Gaikwad, Devon Conway, Shivam Dube, Ajinkya Rahane, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Moeen Ali, Deepak Chahar, Tushar Deshpande, Maheesh Theekshana, Matheesha Pathirana, Mitchell Santner, Subhranshu Senapati, Shaik Rasheed, Akash Singh, Ben Stokes, Dwaine Pretorius, Sisanda Magala, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Bhagath Varma, Nishant Sindhu. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-27 18:17:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"स्ट्रीप क्लब में क्या कर रहे थे केएल राहुल जो अथिया शेट्टी को देनी पड़ी सफाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/athiya-shetty-had-to-explain-what-kl-rahul-was-doing-in-the-strip-club/articleshow/100557070.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया के स्टार ओपनर बल्लेबाज केएल राहुल चोटिल होने के कारण ब्रेक पर हैं। राहुल सर्जरी के बाद अपनी पत्नी और कुछ दोस्तों के साथ लंदन में हैं। हालांकि इस बीच वह स्ट्रीप क्लब के एक वीडियो को लेकर सुर्खियों में हैं। सोशल मीडिया पर एक वीडियो वायरल हुआ जिसमें दावा किया जा रहा है कि वह राहुल हैं।","content":"ओपनर बल्लेबाज केएल राहुल चोटिल होने के बाद इंडियन प्रीमियर लीग 2023 से बाहर हो गए। चोट काफी गंभीर था जिसके कारण उन्हें सर्जरी करानी पड़ी। सर्जरी के बाद वह ब्रेक पर हैं लेकिन इस बीच वह एक खास वजह से चर्चा में आ गए हैं। दरअसल सोशल मीडिया पर एक वीडियो वायरल हो रहा है जिसमें दावा किया जा रहा है कि उसमें दिखने वाला शख्स केएल राहुल हैं। यह वीडियो लंदन के एक स्ट्रीप क्लब की है, जहां उन्हें एंजॉय करते हुए देखा जा रहा है। ऐसे में सोशल मीडिया पर ट्रोलर्स को केएल राहुल पर निशाना साधने का मौका मिल गया। सोशल मीडिया पर उन्हें खूब सुनाया गया लेकिन राहुल ने कोई प्रतिक्रिया नहीं दी। हालांकि उनकी पत्नी अथिया शेट्टी ने जरूर ने सफाई दी है और ट्रोलर्स की क्लास भी लगा दी। अथिया ने अपने इंस्टाग्राम पर एक स्टोरी शेयर की जिसमें उन्होंने लिखा, 'मैं आम तौर पर किसी बात पर प्रतिक्रिया देने की जगह पर चुप रहना पसंद करती हूं लेकिन कभी कभी अपने आप के लिए भी खड़ा होना बहुत जरूरी हो जाता है।' अथिया आगे लिखती हैं कि, 'मैं, राहुल और मेरे दोस्त एक आम सी जगह पर गए थे जैसे कि बाकी सभी लोग जाते हैं। ऐसे कुछ भी कहीं से लेकर बातें बनाना बंद करिए। कुछ भी ऐसे कहने और लिखने से से पहले अपने फैक्ट को अच्छे से चेक जरूर कर लीजिए।' बता दें कि केएल राहुल अगले महीने ऑस्ट्रेलिया के खिलाफ होने वाले वर्ल्ड टेस्ट चैंपियनशिप के फाइनल से भी बाहर हो गए हैं। वह भारतीय टीम के सदस्य थे। उनकी जगह ईशान किशन को टीम में शामिल किया गया है। राहुल आईपीएल में लखनऊ सुपरजाइंट्स के कप्तान थे। उन्हें 1 मई को रॉयल चैलेंजर्स बैंगलोर के खिलाफ फील्डिंग करते समय चोट लगी थी। इसके बाद से ही वह टूर्नामेंट से बाहर हो गए थे। इसके बाद क्रुणाल पंड्या ने फिर टीम की कमान संभाली थी।","pubDate":"2023-05-27 18:10:54","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"फाइनल से पहले सीएसके के कोच ने भरी हुंकार, गुजरात टाइटंस को हर हाल हराएगी धोनी की सेना","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/gt-vs-csk-final-match-stephen-fleming-head-coach-ipl-2023/articleshow/100556809.cms","keywords":null,"creator":null,"video_url":null,"description":"GT vs CSK: इंडियन प्रीमियर लीग 2023 का फाइनल मुकाबला गुजरात टाइटंस और चेन्नई सुपर किंग्स के बीच खेला जाना है। दोनों टीमें इस मुकाबले के लिए अहमदाबाद के नरेंद्र मोदी स्टेडियम में भिड़ेगी। इस मैच से पहले सीएसके के कोच ने कहा है कि उनकी टीम की तैयारी पहले काफी बेहतर है।","content":"चेन्नई सुपरकिंग्स के मुख्य कोच स्टीफन फ्लेमिंग ने कहा कि उनकी टीम गुजरात टाइटंस के खिलाफ होने वाले इंडियन प्रीमियर लीग (आईपीएल) के फाइनल के लिए पहले की तुलना में बेहतर तैयार है। उन्होंने कहा कि उनकी टीम किसी भी परिस्थिति में खेलने के लिए तैयार रहेगी तथा अतीत में उन्होंने परिस्थितियों और पिचों का आकलन करने में गलती की थी। रविवार को फाइनल के दिन बारिश की संभावना जताई गई है। फ्लेमिंग ने मैच की पूर्व संध्या पर कहा, 'हमने चेन्नई के लिए खुद को इतनी अच्छी तरह से तैयार किया कि कुछ अवसरों पर हमें विरोधी टीम के मैदानों पर जूझना पड़ा। इसलिए फाइनल में थोड़ी चुनौती होगी लेकिन फाइनल में जीत दर्ज करने का हमारा रिकॉर्ड 50 प्रतिशत है।' उन्होंने कहा, 'हमें फाइनल में किस तरह की परिस्थितियां मिलेंगी हम इसको लेकर चिंतित नहीं हैं। दो पिच में से किसी एक का चयन किया जाएगा लेकिन हम चिंतित नहीं हैं। हम अतीत की तुलना में इस बार फाइनल के लिए बेहतर तैयार हैं।' इस बीच गुजरात टाइटंस के टीम निदेशक विक्रम सोलंकी ने कहा कि घरेलू परिस्थितियों की अच्छी समझ होने से उनकी टीम को फायदा मिलेगा। सोलंकी ने कहा, 'हमने यहां कई मैच खेले हैं और इस मामले में हम निश्चित तौर पर बेहतर स्थिति में है। हमने पिछले साल यहां फाइनल खेला था और बड़े मैचों में सफल रहे हैं।' गुजरात टाइटंस की टीम आईपीएल 2023 में लगातार दूसरी बार फाइनल में पहुंची है। लीग स्टेज में भी गुजरात का दमदार प्रदर्शन रहा है। ऐसे में फाइनल मैच में सीएसके के लिए गुजरात की चुनौती बिल्कुल भी आसान नहीं रहने वाली है। गुजरात टाइटंस लीग स्टेज में पॉइंट्स टेबल में पहले स्थान पर रही थी। हालांकि सीएसके भी चार बार की चैंपियन टीम है और धोनी की कप्तानी में इस टीम को मुश्किल परिस्थियों में भी जीतना आता है। ऐसे में फाइनल की टक्कर रोमांचक होने की उम्मीद है।","pubDate":"2023-05-27 17:37:15","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Bayern sack CEO Oliver Kahn, sports director Hasan Salihamidzic after title win-club","link":"https://indianexpress.com/article/sports/football/bayern-sack-ceo-oliver-kahn-sports-director-hasan-salihamidzic-after-title-win-club-8632539/","keywords":["Football","Sports"],"creator":null,"video_url":null,"description":null,"content":"Bayern Munich have parted ways with club CEO Oliver Kahn and Hasan Salihamidzic only minutes after they snatched their 11th straight Bundesliga title on the last matchday on Saturday, the club said. Kahn, who took over the position in 2021 succeeding Karl-Heinz Rummenigge, will be replaced by Jan-Christian Dreesen with immediate effect, the club said in a statement. “It was a difficult decision to part ways with Oliver but we came to the conclusion that based on the overall development a restaffing of the top position in the board,” Bayern said. Bayern beat Cologne 2-1 thanks to an 89th minute winner from Jamal Musiala and benefited from Borussia Dortmund’s 2-2 draw to win the title on goal difference. Also Read 'Insult to Kolkata's sporting culture, an undemocratic step': East Bengal... 'Ronaldo's right foot vs Messi's left foot?': Haaland picks Cristiano's r... 'Could've had 5,00,000 people in stadium today if we could fit them': On ... Marco Reus: Forever the bridesmaid Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more They were eliminated from the German Cup and the Champions League in the last eight despite changing coaches in late March with Thomas Tuchel taking over from Julian Nagelsmann in a surprise move.","pubDate":"2023-05-27 17:08:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"ये गिल मांगे मोर, इंडिया की नई रन मशीन, जो IPL में चौके से ज्यादा अब छक्के उड़ाने लगी है","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/shubman-gill-hits-more-sixes-in-ipl-2023-then-last-two-combined-seasons/articleshow/100556334.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: टेस्ट और वनडे में भारतीय क्रिकेट में अपनी जगह पक्की कर चुके शुभमन गिल को टी-20 स्पेशलिस्ट नहीं माना जाता था पर दाएं हाथ का यह ओपनर आईपीएल के 16वें सीजन में अपने खेल को अलग स्तर पर ले जा चुका है।","content":"आईपीएल 2023 का पहला मैच खेलने वाली दो टीमें चेन्नई सुपरकिंग्स और गुजरात टाइटंस के बीच सीजन का आखिरी यानी फाइनल मुकाबला भी खेला जा रहा है। दोनों टीमें इससे पहले मंगलवार को क्वालीफायर-1 में भिड़ी थीं। तब चेन्नई ने गुजरात को 15 रन से हराया था। उस मैच में गुजरात की हार की वजह जबरदस्त फॉर्म में चल रहे भारतीय क्रिकेट के नए रन मशीन शुभमान गिल का जल्दी आउट हो जाना था। गिल उस मुकाबले से पहले लीग राउंड के आखिरी दोनों मुकाबलों में शतक लगा चुके थे। हालांकि गिल ने इसकी भरपाई दूसरे क्वालीफायर मुकाबले में कर दी और एक और शतक लगाकर टीम को फाइनल में पहुंचा दिया। फाइनल में चेन्नई को अगर गुजरात को बड़े स्कोर से रोकना है तो उसे इस नई रन मशीन गिल को पिछले मैच की ही तरह जल्दी आउट करना होगा। शुभमन गिल ने दूसरे क्वालीफायर में मुंबई इंडियंस के खिलाफ 60 गेंदों पर 10 छक्कों और सात चौकों की मदद से 129 रनों की सनसनीखेज पारी खेली, जो आईपीएल 2023 में उनका तीसरा शतक था। गुजरात ने 233/3 के रूप में बड़ा स्कोर पोस्ट किया। इस तरह गिल ने आरसीबी के कप्तान फाफ डुप्लेसी को पछाड़कर फाइनल से पहले ही ऑरेंज कैप अपने नाम कर ली। 2023- 33 छक्के 2022- 11 छक्के 2021- 12 छक्के 2020- 9 छक्के 2019- 10 छक्के 2018- 5 छक्के इस साल शुभमन गिल अबतक कुल 16 मैच में 33 छक्के लगा चुके हैं, इतना तो उन्होंने बीते तीन सीजन में मिलाकर नहीं मारा। सीजन में सबसे ज्यादा 36 छक्के लगाकर वैसे तो फाफ डुप्लेसिस सबसे आगे हैं। मगर संयुक्त रूप से दूसरे नंबर पर मौजूद गिल की सबसे बड़ी ताकत छक्का मारने के साथ-साथ स्ट्राइक रोटेट करना भी है। उससे बड़ी ताकत पावरप्ले में गैप ढूंढने की है।","pubDate":"2023-05-27 16:42:05","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: Chennai Super Kings better prepared for IPL final compared to past, says Stephen Fleming","link":"https://indianexpress.com/article/sports/ipl/chennai-super-kings-better-prepared-for-ipl-final-compared-to-past-says-stephen-fleming-8632525/","keywords":["IPL 2023","Sports"],"creator":null,"video_url":null,"description":null,"content":"Chennai Super Kings head coach Stephen Fleming on Saturday said that the four-time winners are better prepared for the IPL final against Gujarat Titans than any other time in the past, when conditions affected their performance. Fleming said CSK’s win-loss ratio remained around 50 per cent because they would usually build and prepare their squads keeping the conditions and pitches at the home venue at Chepauk in mind, but that is not the case anymore. He said the team would be ready for any conditions — there are rains expected during the final here on Sunday — and that they have erred in reading conditions and pitches in the past. “We geared ourselves up so well for Chennai that we did struggle with conditions at times in away games, so the finals were always a little bit of a challenge, and our record is about 50 per cent of winning the final,” Fleming said during the pre-match press conference. “It is maybe due to the style of the game we created — a victim of being so good at home that we had to make adjustments when we went to a neutral venue.” Fleming said CSK were “a bit more rounded” this year. “Because of that going back to Chennai (for Qualifier 1), it was hard. I wanted to bowl (first) in the last qualifying game and batting proved to be the right call and MS (Dhoni) was the other way in the last game,” he said. Anbuden ➡️ Ahmedabad with a million whistles! 🥳 #GTvCSK #WhistlePodu #Yellove 🦁💛 pic.twitter.com/Tyjhxd1Nsf — Chennai Super Kings (@ChennaiIPL) May 23, 2023 https://platform.twitter.com/widgets.js “So we are well off the mark in trying to get the conditions right but the team is rounded enough to put performances together. Come the final, we are not worried as to what conditions we get, there are two pitches to choose from now but we are not too worried. We are a lot better placed than what we had been in the past,” he said. Advertisement The former New Zealand captain said that making early breakthroughs will be key for his side as GT batter Shubman Gill’s red-hot form presents the biggest challenge for CSK. “He (Gill) is playing really well. It (the plans) does not really change, you hope that you pick him up early, you have enough firepower to create an opportunity. The only thing that we are looking at is when you have got openers, when they are in such good form, there is an opportunity to get into the middle order. Advertisement “If we can get a couple of early breakthroughs then, (just like) in the last game we played there is an opportunity. But we got to get past him, he is playing really well,” Fleming said. For someone who has won IPL title four times with CSK, Fleming said it is not easy winning the trophy back-to-back. “So hard! It is impossible, it is going to be so hard for them (GT) to do it (laughs). No, they are a good side; you got to say ‘really well done’ to what they have put together in a short space of time,” he said. “I like the coaching staff a lot, they are really balanced guys. Ashish, for all his talking, has got a really good grasp of the game, his enthusiasm is really high after working with him in Chennai. We have a huge amount of respect for what they have done but it is very hard to go back to back.” Gujarat Titans ’ team director Vikram Solanki also returned the favour, but added that knowledge of conditions in their ‘home ground’ here should hold them in good stead. “We are definitely better for the experience for having played here, having played in the final (last year) here, and having been successful in those big games. We are better for it,” he said. Caution: Wear helmets and watch Shivam drive! 🦁💥 #WhistlePodu #Yellove 💛 @IamShivamDube pic.twitter.com/dfdIK9fXLQ — Chennai Super Kings (@ChennaiIPL) May 27, 2023 https://platform.twitter.com/widgets.js Advertisement “We entirely appreciate this sort of respect CSK have given. They have been a fabulous team for a good number of years now and we respect that. We are confident; what transpires on the day is what transpires on the day,” Solanki added. Solanki praised GT’s bowling trio of Mohammad Shami (28 wickets), Rashid Khan (27 wickets) and Mohit Sharma (24 wickets), who also are the top three wicket-takers in this IPL. Advertisement “If you look at the tournament in its entirety, the impact player rule has had a bearing on the number of batsmen that are playing, therefore, wicket-taking becomes all the more important. We have always being attacking minded, an attack that is able to take wickets in different conditions through different phases of the game,” he said. “That is our go-to, the ability to take wickets. All three have been quite brilliant this year, they have worked extremely hard and they deserve all the success that is coming their way.” The former England batter said at just 23, Gill could be an example for young batters to model their batting on. Advertisement Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more “For a young man, he is quite a brilliant technician as far as batting is concerned. He would certainly be one of the examples that you would like to use for young players on how to bat,” Solanki said. Also Read For CSK, Dhoni is a habit, he isn't retiring any time soon Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must ... Sometimes Virat celebrates more than the bowlers, says Anushka Sharma Now we are sure that Malli is in safe hands: MS Dhoni meets Matheesha Pat... “He has all of the qualities of a world-class player and he is just showing his skill level. Fortunately for us, he is in good form, he works very hard on his game, not just in practice. He is very conscious of the opposition that he is going to face, where he is likely to gain advantage, what are the dangers, what are the things that he is going to have to deal with.”","pubDate":"2023-05-27 16:41:18","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"“Hello friend, we meet again”: Jasprit Bumrah hints at international cricket return","link":"https://thenewsmill.com/2023/05/hello-friend-we-meet-again-jasprit-bumrah-hints-at-international-cricket-return/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Indian pace spearhead Jasprit Bumrah, who has been out of action for the last several months due to injury, seems to be on the path of a stunning comeback to the sport. The 29-year-old pacer posted a picture of his cricket shoes on his Instagram. “Hello friend, we meet again,” said Bumrah’s post caption. https://www.instagram.com/p/CsvzrL-KHuq/?hl=en In April, Bumrah underwent surgery on his lower back in New Zealand. The medical procedure was successful and helped Bumrah get free from pain. “Jasprit Bumrah underwent surgery on his lower back in New Zealand which was successful and he remains pain-free. The fast bowler was advised by the specialist to start his rehab six weeks after the surgery and accordingly, Bumrah commenced his rehab management at the National Cricket Academy (NCA) in Bengaluru from Friday,” said a press release from BCCI on April 15. Bumrah is out of action since September 2022 owing to a back injury and as a result, missed the ICC Men’s T20 World Cup 2022 in Australia. The ace pacer completed his rehabilitation at the National Cricket Academy (NCA) in Bengaluru and has been seen bowling in the nets but BCCI has chosen not to rush him back into action. The pacer also missed Indian Premier League (2023), in which he represents Mumbai Indians. Though MI reached playoffs, their bowling attack looked extremely toothless without Bumrah’s presence on numerous occasions. While fans wait to see Bumrah back on the field with his unique bowling action, he has been unable to join the team due to a recurring injury. He has attempted to make a comeback more than once since suffering a back injury in August last year which ruled him out of the Asia Cup. Initially, the injury did not seem serious as he was named in India’s T20 World Cup squad in September and even played the last two T20Is against Australia on September 23 and September 25 last year. Three days later, Bumrah did not play the first T20I against South Africa and it was learnt that he was taken for scans, which revealed a stress-related injury in his back. He was rushed to NCA and the scans there confirmed that the injury was serious. It ruled him out of the T20 World Cup, in which India achieved a semifinal finish. Bumrah resumed his rehab in November and started to bowl in mid-December. His progress seemed to be positive as he was added to the white-ball series played in January against Sri Lanka more than a week after the original squad was picked up. Bumrah had performed the match simulation exercises in the NCA, but discomfort resurfaced while taking up higher workloads during fitness drills in January. Scans revealed the development of a fresh niggle, which ruled him out of the Sri Lanka series and Border-Gavaskar Trophy against Australia. (ANI)","pubDate":"2023-05-27 16:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"When Gautam Gambhir Kicked Chair in Frustration Post KKR Win vs RCB in IPL 2016","link":"https://thesportsrush.com/cricket-news-when-gautam-gambhir-kicked-chair-in-frustration-post-kkr-win-vs-rcb-in-ipl-2016/","keywords":["Cricket","KKR","RCB","Gautam Gambhir","IPL 2016","Kolkata Knight riders","Royal Challenegers Bangalore"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Be it in the capacity of a player or in his role as the mentor of Lucknow Super Giants at present, Gautam Gambhir has made sure to not shy away from displaying his raw emotions to the ever-ready cameras panning towards him. His temperature perhaps soars higher by a couple of notches whenever he is… The post When Gautam Gambhir Kicked Chair in Frustration Post KKR Win vs RCB in IPL 2016 appeared first on The SportsRush.","content":"Be it in the capacity of a player or in his role as the mentor of at present, has made sure to not shy away from displaying his raw emotions to the ever-ready cameras panning towards him. Advertisement His temperature perhaps soars higher by a couple of notches whenever he is involved in an IPL fixture featuring former captain because of some past moments of uneasy tension between the two . During the 2016 edition of the coveted league, Gambhir had yet again indulged himself in an act which was not only unnecessary but had resultantly cost him 15% of match fee owing to unruly behavior. Advertisement En route a 186-run targetagainst RCB in Bengaluru, Gambhir-led had lost four wickets by the 11th over of the chase. However, the pair of (60*) and (39) nailed their respective power game to see their side home with five deliveries to spare. The moment (10*) smashed the winning boundary, a pumped-up Gambhir could not control his emotions and vented his frustration by kicking a chair placed in the dug out across the boundary rope. The southpaw batter, who was still with his pads on, was more than just excited with the way his team snatched victory from the jaws of defeat. Post kicking the chair, he perhaps also hurled a couple of expletives while looking at someone in the field of play. Loading embed instagram https://www.instagram.com/reel/CslGQYNNmrB/?utm_source=ig_embed&utm_campaign=loading After being fined with the Level 1 breach of the IPL code of conduct, the KKR skipper did accept his mistake while realizing that he shouldn’t have kicked the chair. Advertisement However, he was later quoted as saying by that despite being a role model, he, too, is entitled to have emotions and feelings which get naturally displayed on the field of action. “My brush with the authorities is not new. While I am repentant and embarrassed, I have never got the answer to one very basic question – Aren’t role models entitled to have emotions? Aren’t they human enough to express themselves or release their pent-up feelings? I think they, too, are by-products of the times and the society they are living in.” Eyeing on his third IPL title, Gambhir did manage to take KKR through to the playoffs that season by finishing at the fourth spot on the points table post the league stage. However, Kolkata ended up losing to by 22 runs in the Eliminator to crash out of the tournament. Advertisement","pubDate":"2023-05-27 16:32:35","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"‘He tells everyone, please keep watching me’: S Badrinath reveals how MS Dhoni’s last moment field changes produce wickets","link":"https://indianexpress.com/article/sports/ipl/he-tells-everyone-please-keep-watching-me-s-badrinath-reveals-how-ms-dhonis-last-moment-field-changes-produce-wickets-8632488/","keywords":["IPL 2023","Sports"],"creator":null,"video_url":null,"description":null,"content":"Former Chennai Super Kings player Subramaniam Badrinath revealed how skipper Mahendra Singh Dhoni tends to make maneuvers in the last moment before every delivery and occasionally they end up producing wickets. Speaking on Star Sports, Badrinath said, “He tells everyone, please keep watching me. Because that last minute adjustment, that two yard left or right could be the difference between a catch and a drop. It has happened many times.” “It’s important that we keep tuned into the game, and try to remain involved. Every ball is an event, and we complete the event and move onto the next event. That’s how he addresses every ball. He assures the field is right, the bowler is right,” he added. In response to a query about Dhoni’s conversation with the team in the 2010 final Badrinath said, “Every time there was a par total, and not so much of a par, he only said one thing; let’s try and save one run each.” “If we save a run each, we can make the score 10 runs extra. That’s what was going to be the difference, because these were under our control. Wickets will happen, but the small things; if everybody is trying to save one run, the score becomes a little extra,” he added. Also Read For CSK, Dhoni is a habit, he isn't retiring any time soon Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must ... Sometimes Virat celebrates more than the bowlers, says Anushka Sharma Now we are sure that Malli is in safe hands: MS Dhoni meets Matheesha Pat... Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more Super Kings will face defending Gujarat Titans on Sunday in the final of the IPL 2023 in Narendra Modi Stadium at Ahmedabad .","pubDate":"2023-05-27 16:19:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Can play in front of millions, but was once ‘petrified’ of the ocean","link":"https://www.brisbanetimes.com.au/sport/afl/can-play-in-front-of-millions-but-was-once-petrified-of-the-ocean-20230523-p5dagr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter Ryan"],"video_url":null,"description":"Pies stalwart Steele Sidebottom plays his 300th game on Sunday, and his close friends and teammates have shared their stories of a laid-back, fun-loving, competitive beast.","content":"Loading Collingwood’s Steele Sidebottom has never been one to pump himself up. Nor has he chased the limelight. But he could not resist interrupting his premiership skipper Nick Maxwell - who had joined the club as a rookie - during a pre-season session where the captain emphasised to the club’s recruits that regardless of what number pick they had been when they arrived, they were all equally entitled to play in round one. Collingwood’s Steele Sidebottom, who reaches 300 AFL games on Sunday, with the statue of Bob Rose. Credit: Getty Images Maxwell extolled the virtues of his rookie brethren, praising them for their persistence and resilience and making it pretty obvious he had a soft spot for footy’s battlers. The speech became all a bit rich for Sidebottom. “Sorry for being a gun and kicking 10 in a granny,” Sidebottom suddenly blurted out. The room dissolved into laughter. Premiership player Steele Sidebottom is one of the constants between the 2010 and 2023 sides. Credit: Getty Images That bag of 10 for the Murray Bushrangers in the 2008 TAC Cup grand final ensured he was a first-round pick, Collingwood using selection 11 to make him a Magpie. It was the first thing his new teammates heard about him. Soon enough, however, they were talking about his constant smile, his skills on both sides of his body and his clean hands, and his competitiveness. “He is realistically one of the most competitive people I have ever met,” said Jarryd Blair, the former Pie who also joined the club as a rookie, and who remains one of Sidebottom’s great mates. His friend Sam Muggleton told The Age that Sidebottom had been “a gun” from the moment they first played together as primary school children in a combined team from Shepparton. Celebrate if you’ve kicked 10 goals in a TAC Cup grand final: Steele Sidebottom can. Credit: Getty Images At Sidebottom’s wedding in 2022, Muggleton recalled in his speech a bloke with a rat’s tail rocking up to training for that team late in the piece and being picked immediately. Their first game was tight before Sidebottom stepped up to kick one goal with his left foot from the right forward pocket, and then the winning goal with his right foot from the left forward pocket. He had learned to kick on both feet because he idolised his older brother Tyson - who he cheekily described on Wednesday as the favourite of his four older brothers - who was proficient on both feet. Sidebottom spent hours booting a footy into the back fence, alternating feet to keep it interesting. “I’ve always had some kind of ball in my hand. I played touch footy, soccer, cricket, tennis, whatever it is,” Sidebottom said. The endurance beast Another of his mates from around Shepparton, Michael Morey, knew his friend’s ball skills were good, but it wasn’t until they were in their teens he realised he had other athletic attributes. The pair had faced off in Morey’s family orchard with three small apples in their hands to ping at each other. Morey moved first, but each throw missed. He had to run. Loading Soon after he took off, he felt Sidebottom’s breath on his neck despite the fact he was sprinting to get away. “He just slowly sat behind me for the next 500 metres and as soon as I started puffing a little bit, bang, apple in the back of the head. He got all three into me and I remember thinking, ‘This guy can run’,” Morey said. Close to 20 years after that horseplay revealed his tank, Sidebottom is still covering more ground during matches than all but one or two of his teammates, reaching “anywhere from 13 to 15 [kilometres] a game”. Blair, his premiership teammate who arrived at the club a month after Sidebottom, said his endurance had set him apart from his peers. He remembered Sidebottom revealing to him at the start of their second season that he had gone for one five-kilometre run in the off-season as he felt guilty after a few consecutive days spent socialising. Steele Sidebottom and Jarryd Blair were front and centre in the 2010 premiership team. which contained eight players who started their careers on a rookie list. Credit: Paul Rovere “He then won the 2k time trial in about 6:05 minutes,” Blair said. Blair said it’s one thing to have the endurance Sidebottom possessed but another to push the body to extremes to empty the tank. A competitive animal That will to always push harder came from an innate competitiveness that Blair has seen hilariously play out time after time, on and off the field. In their first year, the pair and another rookie, Tristan Francis, settled down for a game of cricket in the courtyard of their house in Williamstown. Three hours later, with Sidebottom still batting, his mates had had enough and went inside. “He just straight batted it back like it was the fifth day of a Test match, and he was just trying to hang on,” Blair said. Loading That stubborn competitiveness is combined with a constant smile that his former coach Nathan Buckley calls the “opposite of a resting bitch face”. The battles on the golf course between him and Jeremy Howe - two friends whose laid-back demeanour masks their desire to win - are famous at the club. “Whether it’s golf, table tennis, tennis, goal kicking, or an argument there is minimal chance you’re going to beat him with his relentless competitive drive,” Howe said. “Being one of four brothers will create that within, I guess.” The smile is not just a facade. Sidebottom loves playing all sport, particularly football, and hanging out with his mates, his wife Alisha Edwards, who is a lawyer, and their daughter Matilda. His down-to-earth nature means 100 friends and family will be at Marvel Stadium on Sunday to watch him reach his milestone300th game, including his mum Linda, who Sidebottom bought a house for when his career took off to show his appreciation for her efforts raising five boys . “He’s still the same old Steele he was when I met him 15-20 years ago,” Morey said. Muggleton laughs at his friend’s competitiveness, saying they often end some sort of sporting battle with a beer, unable to talk to each other about what transpired as one of them will still be seething. Left or right foot, it never mattered to Steele Sidebottom. Credit: Getty Images The pair played football together at Congupna, where Muggleton, a year older, was captain. Such was Sidebottom’s love of the club, which carries the nickname, “the Road”, he ended his Hotmail at one stage with “Roaders”. He might appear a country boy through and through, but he hasn’t fooled Muggleton. Loading “He is scared of everything,” Muggleton said. He remembers taking Sidebottom fishing with his former teammate Adam Oxley, and Sidebottom yelling at them to pick up a fish that had dropped off the line after being caught. Muggleton finally said, “You do it”, and watched Sidebottom retreat like a defeated army. “He said, ‘No way’,” Muggleton recalled. Blair adds that his mate was “genuinely petrified” of the ocean when he first moved to the club, never moving beyond his waist. He then taught himself to swim better. Such fears do not translate to the middle of the MCG, with Blair simply describing his friend’s record in big games as “unreal”. Let me entertain you During his 299 matches, Sidebottom has played in front of 15,083,531 fans, with only teammate Scott Pendlebury and Essendon’s Dustin Fletcher showing their skills to more spectators. He won a flag in his second year, was runner-up in the Norm Smith Medal in the grand final replay behind Pendlebury, and after battling a bruised heel for several seasons midway through his career became a star during 2017 and 2018, earning All-Australian selection in 2018, was runner-up in a Brownlow Medal and became a dual Copeland Trophy winner. His 41-touch performance in the 2018 preliminary final is often forgotten due to Mason Cox’s heroics . He also won the 2016 Anzac Day Medal. He has been trouble free, apart from his COVID-19 breach in 2020 after a few drinks got out of hand. He served a four-game suspension and probably dashed any hopes he would replace Pendlebury as captain. Buckley, who was coach at the time, has enormous respect for him, as do all his teammates, with Sidebottom’s sense of humour often a ballast during difficult times at the club. “Steele keeps life relatively simple and then makes the difficult look ridiculously easy. He just loves being a part of the club and around the boys. He is just a balanced guy,” Buckley said. Blair played 144 games alongside Sidebottom, and knows his consistency is due to more than natural talent. Sidebottom said it would be wrong to say he is enjoying football more than ever under Craig McRae because he has always enjoyed it. Credit: Getty Images “He has a deep level of care for what he is doing and pride in his performance. He has obviously always been a high achiever in sports and carried that through with him the whole way. His desperation to win has always been evident and cool to see and be a part of,” Blair said. He said his quiet leadership and the direction he has guided the club in should not be underestimated, either. “He’s not a confrontational person, but he has got a strong sense of right from wrong, and he is pretty comfortable in sticking to what he believes is right and the best thing for him and everyone at the club,” Blair said. Now, as just the fourth Magpie and the 101st player ever to reach 300 games, he is already confirmed as a club great. Not that anyone would recognise his status in the game if they bumped into him having a quiet beer with his mates, which is where he seems most comfortable. Magpies skipper Darcy Moore says his influence has been profound on and off the field. “He is such a great teammate, so passionate and such a larrikin. He just never takes anything too seriously. He is always making jokes, and he is a really popular guy,” Moore said. But there is one thing Sidebottom is taking seriously, and that is Collingwood’s tilt at another premiership. Amid all the enjoyment, his focus on achieving that goal is at an all-time high. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Collingwood Magpies Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-05-27 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain?","link":"https://www.thetimesofbengal.com/sports/what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain/?utm_source=rss&utm_medium=rss&utm_campaign=what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand […] The post What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? first appeared on The Times of Bengal.","content":"New Delhi: Chennai Super Kings lock horns with defending champions Gujarat Titans in the 16th final of the Indian Premier League on Sunday at the Narendra Stadium in Ahmedabad. Rumours are also peaking high at the same time that this blockbuster finale will mark the end of CSK captain MS Dhoni’s cricketing career. The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand will be fighting for Dhoni and make it equal with Mumbai on most trophies won. But what happens if the IPL Final gets washed out due to rain ? Even though there are less chances of rain in Ahmedabad and if not a single ball is bowled due to the harsh weather conditions, then one with the highest position in the table will run away with the trophy. In the case, Gujarat Titans will claim a second successive title as they topped the league phase ahead of Chennai Super Kings. A minimum of 5 overs need to be bowled for a match to take place. If the match gets stopped in between the play then quite obviously Duckworth-Lewis (DLS) method will come into play to determine the winner. Gujarat Titans Squad: Wriddhiman Saha(w), Shubman Gill, Sai Sudharsan, Hardik Pandya(c), Vijay Shankar, David Miller, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami, Joshua Little, Srikar Bharat, Shivam Mavi, Odean Smith, Ravisrinivasan Sai Kishore, Pradeep Sangwan, Matthew Wade, Jayant Yadav, Dasun Shanaka, Abhinav Manohar, Alzarri Joseph, Darshan Nalkande, Urvil Patel, Yash Dayal. Chennai Super Kings Squad: Ruturaj Gaikwad, Devon Conway, Shivam Dube, Ajinkya Rahane, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Moeen Ali, Deepak Chahar, Tushar Deshpande, Maheesh Theekshana, Matheesha Pathirana, Mitchell Santner, Subhranshu Senapati, Shaik Rasheed, Akash Singh, Ben Stokes, Dwaine Pretorius, Sisanda Magala, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Bhagath Varma, Nishant Sindhu. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-27 18:17:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"स्ट्रीप क्लब में क्या कर रहे थे केएल राहुल जो अथिया शेट्टी को देनी पड़ी सफाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/athiya-shetty-had-to-explain-what-kl-rahul-was-doing-in-the-strip-club/articleshow/100557070.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया के स्टार ओपनर बल्लेबाज केएल राहुल चोटिल होने के कारण ब्रेक पर हैं। राहुल सर्जरी के बाद अपनी पत्नी और कुछ दोस्तों के साथ लंदन में हैं। हालांकि इस बीच वह स्ट्रीप क्लब के एक वीडियो को लेकर सुर्खियों में हैं। सोशल मीडिया पर एक वीडियो वायरल हुआ जिसमें दावा किया जा रहा है कि वह राहुल हैं।","content":"ओपनर बल्लेबाज केएल राहुल चोटिल होने के बाद इंडियन प्रीमियर लीग 2023 से बाहर हो गए। चोट काफी गंभीर था जिसके कारण उन्हें सर्जरी करानी पड़ी। सर्जरी के बाद वह ब्रेक पर हैं लेकिन इस बीच वह एक खास वजह से चर्चा में आ गए हैं। दरअसल सोशल मीडिया पर एक वीडियो वायरल हो रहा है जिसमें दावा किया जा रहा है कि उसमें दिखने वाला शख्स केएल राहुल हैं। यह वीडियो लंदन के एक स्ट्रीप क्लब की है, जहां उन्हें एंजॉय करते हुए देखा जा रहा है। ऐसे में सोशल मीडिया पर ट्रोलर्स को केएल राहुल पर निशाना साधने का मौका मिल गया। सोशल मीडिया पर उन्हें खूब सुनाया गया लेकिन राहुल ने कोई प्रतिक्रिया नहीं दी। हालांकि उनकी पत्नी अथिया शेट्टी ने जरूर ने सफाई दी है और ट्रोलर्स की क्लास भी लगा दी। अथिया ने अपने इंस्टाग्राम पर एक स्टोरी शेयर की जिसमें उन्होंने लिखा, 'मैं आम तौर पर किसी बात पर प्रतिक्रिया देने की जगह पर चुप रहना पसंद करती हूं लेकिन कभी कभी अपने आप के लिए भी खड़ा होना बहुत जरूरी हो जाता है।' अथिया आगे लिखती हैं कि, 'मैं, राहुल और मेरे दोस्त एक आम सी जगह पर गए थे जैसे कि बाकी सभी लोग जाते हैं। ऐसे कुछ भी कहीं से लेकर बातें बनाना बंद करिए। कुछ भी ऐसे कहने और लिखने से से पहले अपने फैक्ट को अच्छे से चेक जरूर कर लीजिए।' बता दें कि केएल राहुल अगले महीने ऑस्ट्रेलिया के खिलाफ होने वाले वर्ल्ड टेस्ट चैंपियनशिप के फाइनल से भी बाहर हो गए हैं। वह भारतीय टीम के सदस्य थे। उनकी जगह ईशान किशन को टीम में शामिल किया गया है। राहुल आईपीएल में लखनऊ सुपरजाइंट्स के कप्तान थे। उन्हें 1 मई को रॉयल चैलेंजर्स बैंगलोर के खिलाफ फील्डिंग करते समय चोट लगी थी। इसके बाद से ही वह टूर्नामेंट से बाहर हो गए थे। इसके बाद क्रुणाल पंड्या ने फिर टीम की कमान संभाली थी।","pubDate":"2023-05-27 18:10:54","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"फाइनल से पहले सीएसके के कोच ने भरी हुंकार, गुजरात टाइटंस को हर हाल हराएगी धोनी की सेना","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/gt-vs-csk-final-match-stephen-fleming-head-coach-ipl-2023/articleshow/100556809.cms","keywords":null,"creator":null,"video_url":null,"description":"GT vs CSK: इंडियन प्रीमियर लीग 2023 का फाइनल मुकाबला गुजरात टाइटंस और चेन्नई सुपर किंग्स के बीच खेला जाना है। दोनों टीमें इस मुकाबले के लिए अहमदाबाद के नरेंद्र मोदी स्टेडियम में भिड़ेगी। इस मैच से पहले सीएसके के कोच ने कहा है कि उनकी टीम की तैयारी पहले काफी बेहतर है।","content":"चेन्नई सुपरकिंग्स के मुख्य कोच स्टीफन फ्लेमिंग ने कहा कि उनकी टीम गुजरात टाइटंस के खिलाफ होने वाले इंडियन प्रीमियर लीग (आईपीएल) के फाइनल के लिए पहले की तुलना में बेहतर तैयार है। उन्होंने कहा कि उनकी टीम किसी भी परिस्थिति में खेलने के लिए तैयार रहेगी तथा अतीत में उन्होंने परिस्थितियों और पिचों का आकलन करने में गलती की थी। रविवार को फाइनल के दिन बारिश की संभावना जताई गई है। फ्लेमिंग ने मैच की पूर्व संध्या पर कहा, 'हमने चेन्नई के लिए खुद को इतनी अच्छी तरह से तैयार किया कि कुछ अवसरों पर हमें विरोधी टीम के मैदानों पर जूझना पड़ा। इसलिए फाइनल में थोड़ी चुनौती होगी लेकिन फाइनल में जीत दर्ज करने का हमारा रिकॉर्ड 50 प्रतिशत है।' उन्होंने कहा, 'हमें फाइनल में किस तरह की परिस्थितियां मिलेंगी हम इसको लेकर चिंतित नहीं हैं। दो पिच में से किसी एक का चयन किया जाएगा लेकिन हम चिंतित नहीं हैं। हम अतीत की तुलना में इस बार फाइनल के लिए बेहतर तैयार हैं।' इस बीच गुजरात टाइटंस के टीम निदेशक विक्रम सोलंकी ने कहा कि घरेलू परिस्थितियों की अच्छी समझ होने से उनकी टीम को फायदा मिलेगा। सोलंकी ने कहा, 'हमने यहां कई मैच खेले हैं और इस मामले में हम निश्चित तौर पर बेहतर स्थिति में है। हमने पिछले साल यहां फाइनल खेला था और बड़े मैचों में सफल रहे हैं।' गुजरात टाइटंस की टीम आईपीएल 2023 में लगातार दूसरी बार फाइनल में पहुंची है। लीग स्टेज में भी गुजरात का दमदार प्रदर्शन रहा है। ऐसे में फाइनल मैच में सीएसके के लिए गुजरात की चुनौती बिल्कुल भी आसान नहीं रहने वाली है। गुजरात टाइटंस लीग स्टेज में पॉइंट्स टेबल में पहले स्थान पर रही थी। हालांकि सीएसके भी चार बार की चैंपियन टीम है और धोनी की कप्तानी में इस टीम को मुश्किल परिस्थियों में भी जीतना आता है। ऐसे में फाइनल की टक्कर रोमांचक होने की उम्मीद है।","pubDate":"2023-05-27 17:37:15","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Bayern sack CEO Oliver Kahn, sports director Hasan Salihamidzic after title win-club","link":"https://indianexpress.com/article/sports/football/bayern-sack-ceo-oliver-kahn-sports-director-hasan-salihamidzic-after-title-win-club-8632539/","keywords":["Football","Sports"],"creator":null,"video_url":null,"description":null,"content":"Bayern Munich have parted ways with club CEO Oliver Kahn and Hasan Salihamidzic only minutes after they snatched their 11th straight Bundesliga title on the last matchday on Saturday, the club said. Kahn, who took over the position in 2021 succeeding Karl-Heinz Rummenigge, will be replaced by Jan-Christian Dreesen with immediate effect, the club said in a statement. “It was a difficult decision to part ways with Oliver but we came to the conclusion that based on the overall development a restaffing of the top position in the board,” Bayern said. Bayern beat Cologne 2-1 thanks to an 89th minute winner from Jamal Musiala and benefited from Borussia Dortmund’s 2-2 draw to win the title on goal difference. Also Read 'Insult to Kolkata's sporting culture, an undemocratic step': East Bengal... 'Ronaldo's right foot vs Messi's left foot?': Haaland picks Cristiano's r... 'Could've had 5,00,000 people in stadium today if we could fit them': On ... Marco Reus: Forever the bridesmaid Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more They were eliminated from the German Cup and the Champions League in the last eight despite changing coaches in late March with Thomas Tuchel taking over from Julian Nagelsmann in a surprise move.","pubDate":"2023-05-27 17:08:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"ये गिल मांगे मोर, इंडिया की नई रन मशीन, जो IPL में चौके से ज्यादा अब छक्के उड़ाने लगी है","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/shubman-gill-hits-more-sixes-in-ipl-2023-then-last-two-combined-seasons/articleshow/100556334.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: टेस्ट और वनडे में भारतीय क्रिकेट में अपनी जगह पक्की कर चुके शुभमन गिल को टी-20 स्पेशलिस्ट नहीं माना जाता था पर दाएं हाथ का यह ओपनर आईपीएल के 16वें सीजन में अपने खेल को अलग स्तर पर ले जा चुका है।","content":"आईपीएल 2023 का पहला मैच खेलने वाली दो टीमें चेन्नई सुपरकिंग्स और गुजरात टाइटंस के बीच सीजन का आखिरी यानी फाइनल मुकाबला भी खेला जा रहा है। दोनों टीमें इससे पहले मंगलवार को क्वालीफायर-1 में भिड़ी थीं। तब चेन्नई ने गुजरात को 15 रन से हराया था। उस मैच में गुजरात की हार की वजह जबरदस्त फॉर्म में चल रहे भारतीय क्रिकेट के नए रन मशीन शुभमान गिल का जल्दी आउट हो जाना था। गिल उस मुकाबले से पहले लीग राउंड के आखिरी दोनों मुकाबलों में शतक लगा चुके थे। हालांकि गिल ने इसकी भरपाई दूसरे क्वालीफायर मुकाबले में कर दी और एक और शतक लगाकर टीम को फाइनल में पहुंचा दिया। फाइनल में चेन्नई को अगर गुजरात को बड़े स्कोर से रोकना है तो उसे इस नई रन मशीन गिल को पिछले मैच की ही तरह जल्दी आउट करना होगा। शुभमन गिल ने दूसरे क्वालीफायर में मुंबई इंडियंस के खिलाफ 60 गेंदों पर 10 छक्कों और सात चौकों की मदद से 129 रनों की सनसनीखेज पारी खेली, जो आईपीएल 2023 में उनका तीसरा शतक था। गुजरात ने 233/3 के रूप में बड़ा स्कोर पोस्ट किया। इस तरह गिल ने आरसीबी के कप्तान फाफ डुप्लेसी को पछाड़कर फाइनल से पहले ही ऑरेंज कैप अपने नाम कर ली। 2023- 33 छक्के 2022- 11 छक्के 2021- 12 छक्के 2020- 9 छक्के 2019- 10 छक्के 2018- 5 छक्के इस साल शुभमन गिल अबतक कुल 16 मैच में 33 छक्के लगा चुके हैं, इतना तो उन्होंने बीते तीन सीजन में मिलाकर नहीं मारा। सीजन में सबसे ज्यादा 36 छक्के लगाकर वैसे तो फाफ डुप्लेसिस सबसे आगे हैं। मगर संयुक्त रूप से दूसरे नंबर पर मौजूद गिल की सबसे बड़ी ताकत छक्का मारने के साथ-साथ स्ट्राइक रोटेट करना भी है। उससे बड़ी ताकत पावरप्ले में गैप ढूंढने की है।","pubDate":"2023-05-27 16:42:05","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: Chennai Super Kings better prepared for IPL final compared to past, says Stephen Fleming","link":"https://indianexpress.com/article/sports/ipl/chennai-super-kings-better-prepared-for-ipl-final-compared-to-past-says-stephen-fleming-8632525/","keywords":["IPL 2023","Sports"],"creator":null,"video_url":null,"description":null,"content":"Chennai Super Kings head coach Stephen Fleming on Saturday said that the four-time winners are better prepared for the IPL final against Gujarat Titans than any other time in the past, when conditions affected their performance. Fleming said CSK’s win-loss ratio remained around 50 per cent because they would usually build and prepare their squads keeping the conditions and pitches at the home venue at Chepauk in mind, but that is not the case anymore. He said the team would be ready for any conditions — there are rains expected during the final here on Sunday — and that they have erred in reading conditions and pitches in the past. “We geared ourselves up so well for Chennai that we did struggle with conditions at times in away games, so the finals were always a little bit of a challenge, and our record is about 50 per cent of winning the final,” Fleming said during the pre-match press conference. “It is maybe due to the style of the game we created — a victim of being so good at home that we had to make adjustments when we went to a neutral venue.” Fleming said CSK were “a bit more rounded” this year. “Because of that going back to Chennai (for Qualifier 1), it was hard. I wanted to bowl (first) in the last qualifying game and batting proved to be the right call and MS (Dhoni) was the other way in the last game,” he said. Anbuden ➡️ Ahmedabad with a million whistles! 🥳 #GTvCSK #WhistlePodu #Yellove 🦁💛 pic.twitter.com/Tyjhxd1Nsf — Chennai Super Kings (@ChennaiIPL) May 23, 2023 https://platform.twitter.com/widgets.js “So we are well off the mark in trying to get the conditions right but the team is rounded enough to put performances together. Come the final, we are not worried as to what conditions we get, there are two pitches to choose from now but we are not too worried. We are a lot better placed than what we had been in the past,” he said. Advertisement The former New Zealand captain said that making early breakthroughs will be key for his side as GT batter Shubman Gill’s red-hot form presents the biggest challenge for CSK. “He (Gill) is playing really well. It (the plans) does not really change, you hope that you pick him up early, you have enough firepower to create an opportunity. The only thing that we are looking at is when you have got openers, when they are in such good form, there is an opportunity to get into the middle order. Advertisement “If we can get a couple of early breakthroughs then, (just like) in the last game we played there is an opportunity. But we got to get past him, he is playing really well,” Fleming said. For someone who has won IPL title four times with CSK, Fleming said it is not easy winning the trophy back-to-back. “So hard! It is impossible, it is going to be so hard for them (GT) to do it (laughs). No, they are a good side; you got to say ‘really well done’ to what they have put together in a short space of time,” he said. “I like the coaching staff a lot, they are really balanced guys. Ashish, for all his talking, has got a really good grasp of the game, his enthusiasm is really high after working with him in Chennai. We have a huge amount of respect for what they have done but it is very hard to go back to back.” Gujarat Titans ’ team director Vikram Solanki also returned the favour, but added that knowledge of conditions in their ‘home ground’ here should hold them in good stead. “We are definitely better for the experience for having played here, having played in the final (last year) here, and having been successful in those big games. We are better for it,” he said. Caution: Wear helmets and watch Shivam drive! 🦁💥 #WhistlePodu #Yellove 💛 @IamShivamDube pic.twitter.com/dfdIK9fXLQ — Chennai Super Kings (@ChennaiIPL) May 27, 2023 https://platform.twitter.com/widgets.js Advertisement “We entirely appreciate this sort of respect CSK have given. They have been a fabulous team for a good number of years now and we respect that. We are confident; what transpires on the day is what transpires on the day,” Solanki added. Solanki praised GT’s bowling trio of Mohammad Shami (28 wickets), Rashid Khan (27 wickets) and Mohit Sharma (24 wickets), who also are the top three wicket-takers in this IPL. Advertisement “If you look at the tournament in its entirety, the impact player rule has had a bearing on the number of batsmen that are playing, therefore, wicket-taking becomes all the more important. We have always being attacking minded, an attack that is able to take wickets in different conditions through different phases of the game,” he said. “That is our go-to, the ability to take wickets. All three have been quite brilliant this year, they have worked extremely hard and they deserve all the success that is coming their way.” The former England batter said at just 23, Gill could be an example for young batters to model their batting on. Advertisement Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more “For a young man, he is quite a brilliant technician as far as batting is concerned. He would certainly be one of the examples that you would like to use for young players on how to bat,” Solanki said. Also Read For CSK, Dhoni is a habit, he isn't retiring any time soon Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must ... Sometimes Virat celebrates more than the bowlers, says Anushka Sharma Now we are sure that Malli is in safe hands: MS Dhoni meets Matheesha Pat... “He has all of the qualities of a world-class player and he is just showing his skill level. Fortunately for us, he is in good form, he works very hard on his game, not just in practice. He is very conscious of the opposition that he is going to face, where he is likely to gain advantage, what are the dangers, what are the things that he is going to have to deal with.”","pubDate":"2023-05-27 16:41:18","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"“Hello friend, we meet again”: Jasprit Bumrah hints at international cricket return","link":"https://thenewsmill.com/2023/05/hello-friend-we-meet-again-jasprit-bumrah-hints-at-international-cricket-return/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Indian pace spearhead Jasprit Bumrah, who has been out of action for the last several months due to injury, seems to be on the path of a stunning comeback to the sport. The 29-year-old pacer posted a picture of his cricket shoes on his Instagram. “Hello friend, we meet again,” said Bumrah’s post caption. https://www.instagram.com/p/CsvzrL-KHuq/?hl=en In April, Bumrah underwent surgery on his lower back in New Zealand. The medical procedure was successful and helped Bumrah get free from pain. “Jasprit Bumrah underwent surgery on his lower back in New Zealand which was successful and he remains pain-free. The fast bowler was advised by the specialist to start his rehab six weeks after the surgery and accordingly, Bumrah commenced his rehab management at the National Cricket Academy (NCA) in Bengaluru from Friday,” said a press release from BCCI on April 15. Bumrah is out of action since September 2022 owing to a back injury and as a result, missed the ICC Men’s T20 World Cup 2022 in Australia. The ace pacer completed his rehabilitation at the National Cricket Academy (NCA) in Bengaluru and has been seen bowling in the nets but BCCI has chosen not to rush him back into action. The pacer also missed Indian Premier League (2023), in which he represents Mumbai Indians. Though MI reached playoffs, their bowling attack looked extremely toothless without Bumrah’s presence on numerous occasions. While fans wait to see Bumrah back on the field with his unique bowling action, he has been unable to join the team due to a recurring injury. He has attempted to make a comeback more than once since suffering a back injury in August last year which ruled him out of the Asia Cup. Initially, the injury did not seem serious as he was named in India’s T20 World Cup squad in September and even played the last two T20Is against Australia on September 23 and September 25 last year. Three days later, Bumrah did not play the first T20I against South Africa and it was learnt that he was taken for scans, which revealed a stress-related injury in his back. He was rushed to NCA and the scans there confirmed that the injury was serious. It ruled him out of the T20 World Cup, in which India achieved a semifinal finish. Bumrah resumed his rehab in November and started to bowl in mid-December. His progress seemed to be positive as he was added to the white-ball series played in January against Sri Lanka more than a week after the original squad was picked up. Bumrah had performed the match simulation exercises in the NCA, but discomfort resurfaced while taking up higher workloads during fitness drills in January. Scans revealed the development of a fresh niggle, which ruled him out of the Sri Lanka series and Border-Gavaskar Trophy against Australia. (ANI)","pubDate":"2023-05-27 16:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"When Gautam Gambhir Kicked Chair in Frustration Post KKR Win vs RCB in IPL 2016","link":"https://thesportsrush.com/cricket-news-when-gautam-gambhir-kicked-chair-in-frustration-post-kkr-win-vs-rcb-in-ipl-2016/","keywords":["Cricket","KKR","RCB","Gautam Gambhir","IPL 2016","Kolkata Knight riders","Royal Challenegers Bangalore"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Be it in the capacity of a player or in his role as the mentor of Lucknow Super Giants at present, Gautam Gambhir has made sure to not shy away from displaying his raw emotions to the ever-ready cameras panning towards him. His temperature perhaps soars higher by a couple of notches whenever he is… The post When Gautam Gambhir Kicked Chair in Frustration Post KKR Win vs RCB in IPL 2016 appeared first on The SportsRush.","content":"Be it in the capacity of a player or in his role as the mentor of at present, has made sure to not shy away from displaying his raw emotions to the ever-ready cameras panning towards him. Advertisement His temperature perhaps soars higher by a couple of notches whenever he is involved in an IPL fixture featuring former captain because of some past moments of uneasy tension between the two . During the 2016 edition of the coveted league, Gambhir had yet again indulged himself in an act which was not only unnecessary but had resultantly cost him 15% of match fee owing to unruly behavior. Advertisement En route a 186-run targetagainst RCB in Bengaluru, Gambhir-led had lost four wickets by the 11th over of the chase. However, the pair of (60*) and (39) nailed their respective power game to see their side home with five deliveries to spare. The moment (10*) smashed the winning boundary, a pumped-up Gambhir could not control his emotions and vented his frustration by kicking a chair placed in the dug out across the boundary rope. The southpaw batter, who was still with his pads on, was more than just excited with the way his team snatched victory from the jaws of defeat. Post kicking the chair, he perhaps also hurled a couple of expletives while looking at someone in the field of play. Loading embed instagram https://www.instagram.com/reel/CslGQYNNmrB/?utm_source=ig_embed&utm_campaign=loading After being fined with the Level 1 breach of the IPL code of conduct, the KKR skipper did accept his mistake while realizing that he shouldn’t have kicked the chair. Advertisement However, he was later quoted as saying by that despite being a role model, he, too, is entitled to have emotions and feelings which get naturally displayed on the field of action. “My brush with the authorities is not new. While I am repentant and embarrassed, I have never got the answer to one very basic question – Aren’t role models entitled to have emotions? Aren’t they human enough to express themselves or release their pent-up feelings? I think they, too, are by-products of the times and the society they are living in.” Eyeing on his third IPL title, Gambhir did manage to take KKR through to the playoffs that season by finishing at the fourth spot on the points table post the league stage. However, Kolkata ended up losing to by 22 runs in the Eliminator to crash out of the tournament. Advertisement","pubDate":"2023-05-27 16:32:35","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"‘He tells everyone, please keep watching me’: S Badrinath reveals how MS Dhoni’s last moment field changes produce wickets","link":"https://indianexpress.com/article/sports/ipl/he-tells-everyone-please-keep-watching-me-s-badrinath-reveals-how-ms-dhonis-last-moment-field-changes-produce-wickets-8632488/","keywords":["IPL 2023","Sports"],"creator":null,"video_url":null,"description":null,"content":"Former Chennai Super Kings player Subramaniam Badrinath revealed how skipper Mahendra Singh Dhoni tends to make maneuvers in the last moment before every delivery and occasionally they end up producing wickets. Speaking on Star Sports, Badrinath said, “He tells everyone, please keep watching me. Because that last minute adjustment, that two yard left or right could be the difference between a catch and a drop. It has happened many times.” “It’s important that we keep tuned into the game, and try to remain involved. Every ball is an event, and we complete the event and move onto the next event. That’s how he addresses every ball. He assures the field is right, the bowler is right,” he added. In response to a query about Dhoni’s conversation with the team in the 2010 final Badrinath said, “Every time there was a par total, and not so much of a par, he only said one thing; let’s try and save one run each.” “If we save a run each, we can make the score 10 runs extra. That’s what was going to be the difference, because these were under our control. Wickets will happen, but the small things; if everybody is trying to save one run, the score becomes a little extra,” he added. Also Read For CSK, Dhoni is a habit, he isn't retiring any time soon Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must ... Sometimes Virat celebrates more than the bowlers, says Anushka Sharma Now we are sure that Malli is in safe hands: MS Dhoni meets Matheesha Pat... Top Sports News Now The Shubman Gill nullifier: What makes Deepak Chahar MS Dhoni's favorite Prithvi Shaw thinks he's a star, should learn from Shubman Gill and must work on his technique and fitness: Karsan Ghavri 'Shubman is the next superstar of world cricket': Karsan Ghavri recalls when he nurtured an 11-yr-old Gill Click here for more Super Kings will face defending Gujarat Titans on Sunday in the final of the IPL 2023 in Narendra Modi Stadium at Ahmedabad .","pubDate":"2023-05-27 16:19:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"}]}