{"newsArray":[{"title":"Queen of all our sports: Stars unite to share their most joyous memories of Her Majesty, The Queen","link":"https://www.dailymail.co.uk/sport/sportsnews/article-11225295/Queen-sports-Stars-unite-share-joyous-memories-Majesty-Queen.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sports stars from the worlds of horse racing, tennis, athletics, rugby, cricket and football pay tribute to Her Majesty, The Queen, after her death last week at the age of 96.","content":"Queen of all our sports: Stars including David Gower, Virginia Wade, Sir Clive Woodward and from her beloved horse racing unite to share their most joyous memories of Her Majesty Queen Elizabeth II died at the age of 96 in Balmoral Castle in Scotland last week She had spent 70 years in the role, meeting a variety of sports figures in her time Stars of horse racing, tennis, athletics, rugby, cricket and football pay tribute She was a known racing fan, but also attended Wimbledon and FA Cup finals By Sportsmail Published: 17:30 EDT, 18 September 2022 | Updated: 18:22 EDT, 18 September 2022 e-mail View comments During her 70 year reign of Queen Elizabeth II, her duties led her to interact with some of Britain's greatest sporting heroes, either issuing them with trophies, or royal honours. As we reflect upon the death of Her Majesty, The Queen, and her funeral taking place in London on Monday, some of those sports stars have shared their stories about the interactions they had with her during her 96 years. In addition to her much-publicised love of horse racing, there are stories to be embraced from the Olympics , cricket, tennis, rugby and football. Her Majesty Queen Elizabeth II died last Thursday aged 96 at her Scottish estate at Balmoral RELATED ARTICLES Previous 1 Next The Queen as you've never seen her before: Her Majesty runs... 'I was so nervous I forgot Julio Baptista's name!': Thierry... England's cricketers pay an emotional tribute to Queen... Touch of class! Eddie Howe comes out in a formal suit to... Share this article Share Racing How The Monarch used statue to stump Trump John Gosden, who received an OBE in 2017 and trained numerous winners in the royal colours, recounts one visit from the Queen with great fondness. 'I remember very well that we presented all our horses to her three years ago and then she said she would like to see Enable,' said Gosden. 'Frankie Dettori was here and he decided to be master of ceremonies. So, Enable was walking round, and Frankie looked at the filly and said, 'You may think you are the Queen, but that is the real Queen!' 'The Queen had a great feel for horses, she would love to see all the foals and yearlings and she was passionate about the breed. It was her joy and relaxation. The trainers would call at 10am and you were given your slot to talk to the Queen about her runners. 'They were always wonderful conversations because you would talk about the horse and the race and then talk about other things. We were very privileged.' The Queen, who loved her horseracing, pictured at Royal Ascot in 2018, alongside John Warren Gosden also revealed how a gift for the Queen featured in one prominent US Presidential visit. 'We set up a statue of the Queen standing with a mare and a foal at the top of Newmarket and there were maquettes (scale models) done of the statue and the Queen was presented with one in the house here. 'She immediately said, 'I know where that is going' and there was a State visit from President Trump a few days later. Of course, Trump liked to stand rather largely in front of everybody and there in the Buckingham Palace rotunda room is Trump but even his tummy could not block out the size of this maquette of the Queen and the mare and foal sitting on the round table.' Floral tributes were left at a statue of Queen Elizabeth II outside Newmarket Racecourse Ian Balding, who like Gosden was a long-time trainer for the Queen, recalls when misinformation earned him a swift riposte from racing's most famous ambassador. He said: 'I can remember writing to her one time, as I had read that she had given up riding and I knew how it would upset her. So, I wrote and said, 'I'm so sorry Ma'am that you have had to give up riding and I feel for you'. 'Anyway, I had a reply, literally by return of post, saying, 'I have not given up riding', so I was delighted by that. 'It was lovely if you happened to have a winner for the Queen as you could see the pleasure and the excitement. I couldn't begin to tell you how important she has been to the racing world.' The Queen watched on as Richard Hughes won on her horse Free Agent at Ascot in 2008 Richard Hughes rode 51 winners for Her Majesty and trained his first winner in her colours when Patchwork won at Redcar in 2017. He said: 'Having a winner for the Queen was like having 10 winners. I'm very privileged and lucky to have trained for such a wonderful woman.' Just two days before her passing on September 8, the Queen celebrated her final winner, Love Affairs at Goodwood, with racing manager John Warren. He revealed that even in the week of her death, Her Majesty was still strategising and planning future targets for her horses. Warren said: 'She was in such a healthy state of mind and in tremendous form. We sat there for hours strategising and making plans. I think the nicest thing for me is to know that she was surrounded by her family members. 'I left her on Monday afternoon, the Prime Ministers were coming on the Tuesday and she had a winner on that day. That evening she was in really good form, delighted she had had a winner, and she talked about the Prime Ministers coming in and out.' Words by Sam Turner Warren (2nd left) said the Queen was still passionate about her horses shortly before her death Cricket David Gower - Former England cricket captain and TV commentator who was awarded the OBE 'I went too far during lunch in the palace!' I am a big royalist, so it was always a huge moment for me when Her Majesty popped into Lord's. Needless to say, she dealt with her duties with her usual equanimity. For an England captain invited to introduce his players to the Queen on the outfield, the etiquette was simple. She would enter through the Long Room and be presented to you by the MCC secretary. You nod, take her down the line, and try to remember the names. Keith Fletcher, one of my predecessors, was never great in that regard, and might have made up a few, but I think I got away with it. There have been plenty of stories about who said what to her during the line-ups. The Australia fast bowler Dennis Lillee reportedly asked her for an autograph, while England off-spinner Pat Pocock requested tickets for the FA Cup final. During my leadership, everyone seemed on their best behaviour. David Gower met The Queen several times, including as a 21-year-old, and has many stories If you weren't in the field, you might have an audience with her in the committee room. Prince Philip was the cricketer in the family, and the Queen didn't come to Lord's every year. But she was always impeccable. Once, I was lucky enough to be invited to the Palace. The Queen used to do these intimate lunches for seven or eight guests, and it was all very relaxed. She played a full part in conversation. We had people from every walk of life and you discussed all things under the sun. She was very interested in everyone, and always well briefed. There was a jockey present, and we discussed helmets — for riding and batting. I remember taking it a little bit too far with the gory details about what happens if one gets hit without one. The general agreement was, 'Well, let's move on from there. It sounds as though it's much better to wear one…' One year, I arrived in Barbados and was met by a message inviting me to drinks and dinner on the Royal Yacht Britannia. I was not exactly prepared, and had to borrow a dinner suit, some size-nine black shoes, and try to look the part. I presented myself at the docks in Bridgetown, among the great and good of Barbados, including Clyde Walcott and Everton Weekes, with the ladies wearing gloves up to their elbows and beyond. I walked up the gangplank, where the welcoming party was Her Majesty and Prince Philip. Her first words were, 'Oh, what are you doing here?' The implication, I like to think, was that it was someone she recognised. Words by Lawrence Booth The Queen was a frequent visitor to England Test cricket, such as this from an Ashes series Rugby Sir Clive Woodward - Knighted by the Queen after winning 2003 World Cup 'We were greeted by pack of corgis after World Cup' I was privileged to meet the Queen on several occasions but three stand out and I feel incredibly lucky to be able to say that. The first was in November 1980 when I played in a centenary match to mark the 100th anniversary of the Welsh Rugby Union at Cardiff Arms Park. I was in an England and Wales combined team and we faced an opposition made up of the best from Ireland and Scotland. I was in the same back-line as Welsh greats like JPR Williams and Terry Holmes. That was big enough in itself as it was my first year of international rugby but it was so surreal when we were introduced to the Queen before kick-off. I was in my early 20s, I was from a service family, my father being a pilot in the RAF. I remember thinking to myself, 'Wow, I cannot believe this is happening.' I've never forgotten that moment of shaking hands with the Queen and I know how proud my family were. Sir Clive Woodward was surrounded by corgis when celebrating England's 2003 success More than two decades later, we were able to celebrate England's World Cup win at Buckingham Palace. I was stood at the front of two massive doors with Martin Johnson, the captain, and what was funny was there was this moment which was very similar to the video in which the Queen met Daniel Craig as part of the 2012 Olympics. Someone announced the Queen was coming, the doors opened but before she arrived, about four or five corgis ran out first! What they say about the corgis is true — they're everywhere! I genuinely felt like the Queen enjoyed that day. The Queen and Prince William welcomed Woodward and England captain Martin Johnson She was in her element hosting the England team. Many people have commented on how welcoming she was and I can attest to that. She had a great way with the players and she went out of her way to speak to the players' partners which really was special as I know how much it meant to Jayne, my wife. After winning the World Cup, it really added an extra dimension to the success by presenting the trophy to the Queen. She had achieved so much but was clearly very touched at being part of this extraordinary occasion. From my perspective, it was something I could never have dreamed of and something you never ever forget. The following year, I was incredibly fortunate to be knighted. When it came to my turn, I was delighted the Queen was in attendance. My three children were allowed to attend and it is something they still talk about. The Queen's service to this country has been nothing short of remarkable and I feel very lucky to have shared a handful of moments with her. Woodward said his family still talks frequently about the day he was knighted by the Queen Athletics Lord Coe - Double Olympic champion and athletics chief 'Her Majesty's Olympic arrival in 2012 is iconic' I can say with some confidence that the Queen was a huge champion of British sport. Over her long reign, she worked in her quiet and diligent way behind the scenes to promote the prospects of generations of athletes. My association with Her Majesty goes back to when she and the Duke of Edinburgh hosted those of us who set world records in British vests, and I can attest to the fact that she took the keenest possible interest in what we were all doing. Her empathetic appreciation can only have been helped by Princess Anne's own achievements in equestrianism. Of course, the Princess Royal, as she became, was one of the great supporters of the London Olympics as an important IOC member. Lord Sebastian Coe hailed The Queen's ability to champion sport across Britain and the world So was the Queen. She hosted the IOC Evaluation Commission while we were still vying to host the Games in 2012. She even waved the commission members goodbye from the balcony. But nothing could beat her contribution to the opening ceremony, when she greeted James Bond at her desk and arrived at the stadium by helicopter. I can tell you I was a little nervous about this whole concept when Danny Boyle put it to me. Would the Queen even acquiesce to it? I knew these scenes had to be done in the most affectionate and sensitive way – something Daniel Craig got absolutely right, down to looking out of the helicopter's gaping hole to check it was safe for her to parachute out. Lord Coe was knighted for services to sport at Buckingham Palace by Queen Elizabeth in 2006 I was sitting next to the new King, the now Prince of Wales and Duke of Sussex during the ceremony. None of them knew what was about to unfold. So when the sequence began with the corgis running into shot, Charles looked at me and laughed somewhat apprehensively. Then the camera cut to Her Majesty's back. Nobody believed it was actually her. As the stadium roared its realisation that it was the Queen, I heard two voices behind me exclaim: 'Go, Grannie!' What a moment. It set the tone for the whole fortnight's carnival of sport. Words by Jonathan McEvoy The Queen's appearance with James Bond in the 2012 Opening Ceremony was a surprise to all Tennis Virginia Wade - 1977 Wimbledon winner and OBE 'She inspired me to win Wimbledon' Virginia Wade will rise early at her home in New York to watch the Queen's funeral, having been glued to the extensive coverage of events in America, which has long since been her home. Her Majesty was famously present in the Royal Box in the silver Jubilee year of 1977 when Wade became the last British woman to win the Wimbledon singles title, handing the trophy to the then 32-year-old. Wade even curtailed her visits to this month's US Open after news of her death emerged on the second Thursday of the tournament. Royal fan Virginia Wade was presented with her Wimbledon trophy by the Queen in 1977 'Once the Queen passed away, I was simply glued to the screen watching with copious tears. Tennis took a back seat,' said the three-time Grand Slam champion. 'It was surreal winning in front of her and knowing she would be in attendance was motivating to me. 'The interaction with her was extraordinarily special. I heard the Queen was coming and I said to myself, 'I'm going to be there. It might be my one and only chance and I'm going to win.' So I had this destiny in a way. 'It's humbling to reflect I am the only tennis player to have been presented a winner's trophy by the Queen since, I think, Althea Gibson (in 1957). I believe anyone who had any interaction with the Queen would remember it for ever.' Queen Elizabeth was not a huge tennis fan but made one of her rare visits to Wimbledon in 2010, where she had lunch with Wade and several other former top British players such as Roger Taylor. 'She was the most important woman in the world and she was totally down to earth,' said Wade. 'She had a very good sense of humour and she was very warm, but I don't think she could take any nonsense.' Words by Mike Dickson The Queen made a rare return to the grounds of Wimbledon during the 2010 Championships Football Lawrie McMenemy - Former Guardsman and manager of FA Cup winners Southampton 'I was so lucky to have chances to get so close to her' I was a teenager when I reported for National Service and the man on the desk took one look at me standing over six feet tall and decided it was the Guards for me. I landed in the first battalion of the Coldstream Guards based at Chelsea Barracks and we worked regularly at Buckingham Palace. Sometimes at the front of the palace — outside the gates in those days so members of the public would stand next to you and take photographs — we would have to present arms when the Royal family came out in their limousines. On guard in the gardens behind the house, out of sight of the public, it was a bit more relaxed and, now and then, one of the Royals would come out for a walk or a cup of tea. When the Queen came out, you would present arms, and she would smile and give you a nod and say 'Good afternoon' or something like that. Once, I was on evening duty there and probably a little too relaxed when a door opened and out came Prince Philip. It caught me completely by surprise and I started to get myself together and present arms. He looked at me, gave me a smile and a wink and told me to keep quiet. I think he was off out. The Queen was no stranger to football, and gave Bobby Moore the 1966 World Cup trophy Many years later, in 1976, the Queen attended the FA Cup final when my Southampton team beat Manchester United at Wembley. The managers did not go up the steps to the Royal Box in those days so I looked up as she handed the Cup to our captain, Peter Rodrigues, and saw our directors standing proudly beside her with tears in their eyes. Peter still says it was the best moment of his life. The Queen wore a royal blue coat and hat, similar to the blue in the strip we were wearing to avoid a colour clash with United. Peter smiled as he said to her, 'I hope people don't think you were on our side'. The day I received an MBE for services to football and charity in 2006, the Queen presented the honours. I walked towards her, she pinned the medal on my jacket and we had a few words. She mentioned football and I reminded her she had been at Wembley when we won the Cup. It was the last final she ever attended and I said, 'It wasn't that bad was it, Ma'am?' She had a good laugh about that, and she was quite surprised when I told her that I used to stand outside the palace on guard. I was very lucky to have those opportunities to get close to the Queen. She had an aura about her without ever giving you the impression she was the boss or anything like it. I've met plenty of people in the public eye who think they are bigger and better than others, and here was the most famous woman in the world able to hold you in a nice conversation and make you feel for a few moments as if it was like any other normal encounter between two people who had never met. Words by Matt Barlow The Queen presented Southampton captain Peter Rodrigues with the 1976 FA Cup trophy RELATED ARTICLES Previous 1 Next The Queen as you've never seen her before: Her Majesty runs... 'I was so nervous I forgot Julio Baptista's name!': Thierry... England's cricketers pay an emotional tribute to Queen... Touch of class! Eddie Howe comes out in a formal suit to... Share this article Share Share or comment on this article: Queen of all our sports: Stars unite to share their most joyous memories of Her Majesty, The Queen e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2022-09-18 22:22:46","image_url":"https://i.dailymail.co.uk/1s/2022/09/18/21/62540465-0-image-m-112_1663534189502.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Kohli makes his intent clear in India’s first practice session","link":"https://kashmirreader.com/2022/09/19/kohli-makes-his-intent-clear-in-indias-first-practice-session/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"MOHALI: Pull shots off the fast bowlers and stepping out against spinners was the order of the day as Virat Kohli nicely warmed up for the T20Is against Australia with an extensive net session here on Sunday. Kohli, as often is the case, was among the first ones who headed into the nets. The focus […]","content":"MOHALI: Pull shots off the fast bowlers and stepping out against spinners was the order of the day as Virat Kohli nicely warmed up for the T20Is against Australia with an extensive net session here on Sunday. Kohli, as often is the case, was among the first ones who headed into the nets. The focus was clearly on playing the short ball as he faced a barrage of rising deliveries in his 45-minute session. Having roared back to form with a much awaited hundred in Asia Cup, the spring in Kohli’s stride was palpable. The star batter had stepped out to even the likes of Rashid Khan in the Asia Cup displaying supreme confidence. He was in a similar mindset in the nets on Sunday, charging down to the spinners for those straight hits down the ground. He struck that hundred against Afghanistan as an opener, igniting the debate over his batting slot. Whether he bats at the top or his usual number three spot, Kohli realises the need to attack from the get go in the shortest format. Kohli is ready to get out of his comfort zone to follow the team’s new template and a rare sweep shot during the Asia Cup is a testimony to that. One of his finest T20 innings, 82 not out versus Australia in the 2016 World T20, came here at his very ground and now with his form and confidence back, fans can expect another special knock from him against the same opponents on Tuesday. PCA to unveil Yuvraj and Harbhajan stands before toss The Punjab Cricket Association will be unveiling the stands named after two of its star cricketers, Yuvraj Singh and Harbhajan Singh, an hour before the match start on Tuesday. The south pavillion has been named after one of India’s greatest spinners Harbhajan and north pavillion after 2011 World Cup hero Yuvraj, “We have taken initiative to honour all the star players of Punjab. It happens in other associations and we thought we should also honour two iconic cricketers from Punjab,” PCA secretary Dilsher Khanna told PTI. “What better way than having a stand in their name. The unveiling will take place before the start of game.” —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-09-18 19:36:30","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"SA20 team purse balance 2022: Total purse of SA20 teams 2022","link":"https://thesportsrush.com/cricket-news-sa20-team-purse-balance-2022-total-purse-of-sa20-teams-2022/","keywords":["Cricket","SA20","SA20 2023"],"creator":["Gurpreet Singh"],"video_url":null,"description":"SA20 team purse balance 2022: The maiden edition of Cricket South Africa’s new T20 league is set to commence in the beginning of next year. The inaugural edition of Cricket South Africa’s new T20 league or the ‘SA20’ is scheduled to commence from January 23 next year, with a total of six franchises set to… The post SA20 team purse balance 2022: Total purse of SA20 teams 2022 appeared first on The SportsRush.","content":"SA20 team purse balance 2022: The maiden edition of Cricket South Africa’s new T20 league is set to commence in the beginning of next year. The inaugural edition of Cricket South Africa’s new T20 league or the ‘SA20’ is scheduled to commence from January 23 next year, with a total of six franchises set to partake in the tournament. Each of the ‘SA20’ franchises – MI Cape Town, Durban Super Giants, Johannesburg Super Kings, Paarl Royals, Pretoria Capitals, and Sunrisers Eastern Cape had the option of signing a maximum number of five players in their squad as part of their pre-auction signing. While the Cape Town, Durban, and the Johannesburg-based franchises roped in all the five players, Paarl, Pretoria, and Eastern Cape franchises have signed four, two, and two players respectively. Ahead of the much-awaited #SA20Auction, our dignitaries were part of a valuable briefing session hosted by @Sa20_League that focused on everything that’ll go into play as the hammer strikes tomorrow #PretoriaCapitals #CapitalsUniverse pic.twitter.com/svTBDIPxJz — Pretoria Capitals (@PretoriaCapsSA) September 18, 2022 Akin the IPL, the SA20 auction ahead of its maiden season will take place on September 19 (Monday), with each franchise allowed to bring in a maximum of 17 players within their squad, comprising 10 South Africans and 7 overseas cricketers. SA20 team purse balance 2022 Each of the six franchises have a total of USD 2 million as their purse limit, within which they will have to complete the purchase of their 17 players in the squad. Since we have no information as yet on the signing amount of each of the pre-auction players in the six franchise squads, the total purse amount available will only be known when the franchise think-tanks will arrive at the auction table today. More than 500 players from a total of 18 countries, excluding those from India and Pakistan have got themselves registered for the SA20 season one auction. As per verified reports, with around 250 players, South Africans form the largest pool registered for the auctions. England, with 100 registered players take the second spot. The post SA20 team purse balance 2022: Total purse of SA20 teams 2022 appeared first on The SportsRush.","pubDate":"2022-09-18 19:11:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Billionaire Andrew Forrest eyes stake in Rugby Australia","link":"https://www.theage.com.au/sport/billionaire-andrew-forrest-eyes-stake-in-rugby-australia-20220917-p5biw6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Anne Hyland"],"video_url":null,"description":"Forget about a summer of sport, private equity is the main game in town, as it seeks to take stakes in a collection of sporting organisations from cricket, rugby union, soccer, tennis and netball.","content":"Australia’s richest man Andrew ‘Twiggy’ Forrest has held informal talks with Rugby Australia about investing in its commercial rights, as part of a billion dollar gold rush by professional investors into the nation’s major sporting codes. Rugby Australia, the governing body of rugby union, is understood to have held informal discussions with private equity firms Silver Lake, CVC Capital Partners, and Forrest, and is expected to finalise a deal in the next six to nine months to sell a minority stake. Forrest’s company Tattarang, which funds the Perth-based Super Rugby team Western Force, is interested in acquiring a stake in Rugby Australia, and is in discussions with Bruin Sports Capital, according to sources who spoke on the condition of anonymity because the discussions are confidential. Bruin is in a strategic partnership with CVC. Andrew Forrest’s company Tattarang, which funds the Perth-based Super Rugby team Western Force, is said to be interested in acquiring a stake in Rugby Australia. Credit: Edwina Pickles Tattarang and Rugby Australia chairman Hamish McLennan declined to comment. Last week, Rugby Australia signed a sponsorship deal with the Tattarang-owned RM Williams. Rugby union sporting bodies globally have been doing deals with private equity firms, with CVC building a dominant commercial position in the game. CVC is close to a deal with South African rugby, and last year sealed a £365m ($609 million) deal with the Six Nations, Europe’s top annual national rugby tournament, taking a one-seventh share of the group. In June, New Zealand Rugby signed a $NZ200 million ($180 million) deal with Silver Lake for about 6 per cent, which valued the governing body’s assets at $NZ3.5 billion. By building a series of stakes across rugby’s sporting bodies CVC and Silver Lake are in a position to reshape rugby union globally. The changes they could make to improve the game’s financial returns include bundling broadcast rights to competitions around the world into a single package, expanding the game by creating a Champions’ tournament, or controversially forcing a simplification of the game’s rules by tackling its bureaucracy. The complicated rules of rugby have increasingly turned off fans and slowed the game in comparison to other codes such as rugby league and the AFL, making it less appealing as entertainment. “We’re in an optimal position to do a deal with private equity as one of the last major unions left standing.” Rugby Australia, which has underperformed operationally for a number of years, has a $40 million loan with investment group Ares SSG Capital Management, which has also been a significant investor of sport around the world. Rugby Australia would be hoping to achieve a deal comparable to that struck by New Zealand Rugby, especially ahead of it hosting the 2025 Lions Tour of Australia, and also the 2027 men and women’s World Cups. “We’re in an optimal position to do a deal with private equity as one of the last major unions left standing,” said Rugby Australia chair Hamish McLennan. “We still need to provide final details to the member unions and the Super Clubs, but it would be fair to say we have an agreement in principle to progress forward. “We’ll be selling a portion of Rugby Australia’s future revenue streams to help fund the growth and development of grassroots and our pathways for men and women.” “We’ll be selling a portion of Rugby Australia’s future revenue streams to help fund the growth and development of grassroots and our pathways for men and women.” said Rugby Australia chairman Hamish McLennan. Credit: Edwina Pickles, Stuart Walmsley The pandemic laid waste financially to all sporting bodies’ earnings as restrictions on gatherings at major events cut revenues for sports and leagues. Last year, Silver Lake paid 33 per cent for a stake in soccer’s A-league for $140 million , with the funds from that deal to be used to buy marquee players, expand the A-League Women’s season, and invest in digital and marketing programs. Silver Lake, like CVC, has been stepping up its bets on the sports industry, with investments ranging from football and rugby to baseball across the globe. Silver Lake last week increased its investment in the company that owns English Premier League team Manchester City. While CVC last year did a €2 billion deal with La Liga, which runs the top two divisions of professional football in Spain. CVC is entitled to 8.2 per cent of the Spanish leagues commercial profits for the next 50 years from that deal. “These funds are astute hard-nosed investors looking for attractive commercial returns, so they’re not investing to be Santa Claus, but they can also be very positive catalysts for sports.” In Australia, other sporting bodies such as Cricket Australia and Netball Australia have held discussions with private equity firms. Silver Lake and CVC are understood to have spoken to Cricket Australia, which has been struggling to compete for players given the deep pockets of the Indian Premier League and the new UAE T20 competition, which begins in January. Continuing to be comfortable with the status quo comes with significant risks of its own, warns NSW Cricket chair John Knox. Credit: Dominic Lorrimer NSW Cricket chair John Knox said its board was supportive of private equity investment coming into the game’s governing body Cricket Australia because of the competitive pressures facing the game. “The cricket New South Wales board is supportive of considering private equity investment in the game to drive the growth and leverage the capability of others. It’s complicated and requires careful consideration but continuing to be comfortable with the status quo comes with significant risks of its own.” Knox, who is also chairman of Ares in Australia, said the risk was that cricket became a club-based competition around the world and players followed the money. “We’ve got to pay the players to keep them playing in Australia, and in turn that will attract more dollars from broadcasters, and that money will flow back down to the grassroots.” Typically, private equity firms buy a stake in an organisation and then work to improve its performance through their commercial and technological expertise, with an eye toward eventually selling out. A private equity investor, who asked not to be named, said that Cricket Australia could draw as much as $500 million in investment by selling a minority stake. John Wylie, a former investment banker, who has also been chair of the Australian Sports Commission and Melbourne Cricket Ground Trust, said private equity was interested in investing in cricket because there are under-exploited commercial opportunities. “The quality of the Big Bash League product, for example, has declined in recent years, yet it’s the shopfront window for the sport into new markets. Cricket generally faces an increasing fight for relevance with a lot of young Australians knowing the names of players in the English Premier League or the National Basketball Association more than the Test team, so it’s critical that Cricket Australia is entrepreneurial, and willing to take risks in how it thinks about the future of the sport. Bringing private equity into the BBL could be a positive part of that.” “Private investors see the opportunity in sports media rights because sport is one of the few things that can pull together a mass audience, even a global one,” says former investment banker and Australian Sports Commission chair John Wylie. Credit: Arsineh Houspian In addition to driving greater returns from sporting business, private equity is attracted to the growth in value of digital and broadcast sporting rights, which has only increased with the advent of streaming services. “Private investors see the opportunity in sports media rights because sport is one of the few things that can pull together a mass audience, even a global one, and those audiences continue to grow,” says Wylie,” who is a founder of Tanarra Capital. “Investors will pay for that exposure and growth, as well as the franchise and brand value.” Still, private equity is there to make money and that will create tension with some fans who consider their teams to be cultural institutions rather than businesses. “These funds are astute hard-nosed investors looking for attractive commercial returns, so they’re not investing to be Santa Claus, but they can also be very positive catalysts for sports. Rugby globally is a sport that desperately needs the reform that the impetus of private capital can provide.” Netball Australia recently rejected an unsolicited $6.5m bid to buy out its debt and take over the Super Netball competition from a private equity group led by entrepreneur and former cricketer Matt Berriman. Netball Australia chair Marina Go said finding the right institutional partner was more important than then taking the highest bid. Credit: Rob Homer Netball Australia said it would not be rushed into a deal until it completed a review of the sport. The deal was dismissed by at least one other private equity investor as “laughable” for the amount being offered. Netball Australia Marina Go said the sporting organisation remained open to institutional capital at the “right value, with the right business model and the right partner”. “There are definitely options to bringing in investment partners to raise capital for expansion and growth into the future,” she said. “We’ve spoken to, for example, the people involved in New Zealand Rugby’s deal with Silver Lake, to understand what that looked like because it’s not just about money. It’s about the ongoing governance, and the impact on the rest of the sport. Finding the right partner is actually more important than then having the highest bid.” Go said it was fundamental to understand what the private equity partner’s exit strategy would be. “You don’t want to find yourself taking an upfront gain, and then leaving the sport in a very difficult situation down the line.”","pubDate":"2022-09-18 19:00:00","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mandhana Shines Again | Highlights - England v India | 1st Women's Royal London ODI 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9QkNPWEwzU0diMVXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Mandhana Shines Again | Highlights - England v India | 1st Women's Royal London ODI 2022  England & Wales Cricket BoardCricket Betting Tips and Match Predictions: India Women Tour of England 2022 - India Women vs England Women- 1st ODI - 18th September 2022  Cricket WorldEngland W vs India W (ENG vs IND) 1st ODI Live Streaming: When and where to watch match live?  The Indian ExpressIND-W vs ENG-W LIVE Broadcast starts, India chasing 228 to win: Follow LIVE  InsideSportIndia Women vs England Women, 1st ODI: When And Where To Watch Live Telecast, Live Streaming  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-18 18:38:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Bhilwara Kings vs Manipal Tigers, Legends League Cricket Highlights: Bhilwara Kings Beat Manipal Tigers By 3 Wickets In Thriller - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvYmhpbHdhcmEta2luZ3MtdnMtbWFuaXBhbC10aWdlcnMtbGVnZW5kcy1sZWFndWUtY3JpY2tldC0yMDIyLWxpdmUtdXBkYXRlcy0zMzU1Njc40gF3aHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9iaGlsd2FyYS1raW5ncy12cy1tYW5pcGFsLXRpZ2Vycy1sZWdlbmRzLWxlYWd1ZS1jcmlja2V0LTIwMjItbGl2ZS11cGRhdGVzLTMzNTU2NzgvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bhilwara Kings vs Manipal Tigers, Legends League Cricket Highlights: Bhilwara Kings Beat Manipal Tigers By 3 Wickets In Thriller  NDTV SportsMNT vs BHK Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for Legends League Cricket 2022, Match 2  SportskeedaLLC 2022, Match 2 Review: Yusuf Pathan, Fidel Edwards shine in Bhilwara Kings' victory over Manipal Tigers  CricTrackerBhilwara Kings vs Manipal Tigers Live Streaming: When and where to watch Legends League Cricket 2022 Live o...  Zee NewsBhilwara Kings vs Mahipal Tigers, Legends League Cricket Live: Bhilwara Kings And Mahipal Tigers Square Off In Lucknow  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-18 18:30:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC 2022: गौतम गंभीर का बड़ा दावा- बिना ऑस्ट्रेलिया को हराए भारत वर्ल्ड कप नहीं जीत सकता; वजह भी बताई","link":"https://www.abplive.com/sports/cricket/former-indian-player-gautam-gambhir-said-that-the-indian-team-cannot-win-the-t20-world-cup-2022-without-beating-australia-2218752","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Gautam Gambhir On T20 World Cup 2022: ऑस्ट्रेलिया में खेले जाने वाले T20 वर्ल्ड कप 2022 (T20 World Cup 2022) के लिए भारतीय टीम (Indian Cricket Team) का ऐलान कर दिया गया है. भारतीय टीम इस टूर्नामेंट में हिस्सा लेने के लिए 6 अक्टूबर को रवाना होगी. इस बीच T20 वर्ल्ड कप 2022 में भारत की संभावनाओं पर पूर्व भारतीय खिलाड़ी गौतम गंभीर (Gautam Gambhir) ने बड़ा बयान दिया है. दरअसल, गौतम गंभीर ने कहा कि भारत ऑस्ट्रेलिया (IND vs AUS 2022) को हराने में कामयाब नहीं होता है, तो वह टी20 वर्ल्ड कप नहीं जीत सकता है. 'T20 वर्ल्ड कप जीतने के लिए ऑस्ट्र्लिया को हराना होगा' गौरतलब है कि भारतीय टीम ऑस्ट्रेलिया के खिलाफ 3 T20 मैचों की सीरीज खेलेगी. इस सीरीज का पहला मैच 20 सितंबर को मोहाली में खेला जाएगा. गौतम गंभीर के मुताबिक, अगर भारतीय टीम अरोन फिंच की अगुवाई वाली टीम को हरा नहीं पाती है तो वह खिताब नहीं जीत पाएगी. साथ ही पूर्व भारतीय ओपनर ने T20 वर्ल्ड कप 2007 और वनडे वर्ल्ड कप 2011 को याद किया. उन्होंने कहा कि T20 वर्ल्ड कप 2007 में टीम इंडिया ने ऑस्ट्रेलिया को सेमीफाइनल में हराया, जबकि वनडे वर्ल्ड कप 2011 के क्वॉटरफाइनल में कंगारू टीम को हराया. भारत-ऑस्ट्रेलिया सीरीज का पहला मैच मोहाली में खेला जाएगा गौरतलब है कि भारतीय टीम T20 वर्ल्ड कप 2022 से पहले ऑस्ट्रेलिया और साउथ अफ्रीका के खिलाफ सीरीज खेलेगी. टीम इंडिया ऑस्ट्रेलिया के खिलाफ 3 T20 मैचों की सीरीज खेलेगी. इस सीरीज का पहला मैच 20 सितंबर को मोहाली में खेला जाएगा. जबकि दूसरा T20 मैच 23 सितंबर को नागपुर में खेला जाएगा. वहीं, भारत-ऑस्ट्रेलिया सीरीज का आखिरी मैच 25 सितंबर को हैदराबाद में खेला जाएगा. ऑस्ट्रेलिया के खिलाफ सीरीज के बाद टीम इंडिया साउथ अफ्रीका के साथ सीरीज खेलेगी. जबकि T20 वर्ल्ड कप 2022 भारतीय टीम रोहित शर्मा की अगुवाई में 6 अक्टूबर को ऑस्ट्रेलिया के लिए रवाना होगी. ये भी पढ़ें- T20 World Cup 2022: टी20 विश्व कप में ये पांच बल्लेबाज बना सकते हैं सबसे ज्यादा रन, लिस्ट में सिर्फ एक भारतीय Legends League: संन्यास के चार साल बाद भी आग उगल रहा मोहम्मद कैफ का बल्ला, बना दिया टी20 का सर्वाधिक स्कोर","content":null,"pubDate":"2022-09-18 17:33:34","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"“No risks will be taken”: Moeen Ali confirms that injured Jos Buttler will himself decide participation on Pakistan tour","link":"https://thesportsrush.com/cricket-news-no-risks-will-be-taken-moeen-ali-confirms-that-injured-jos-buttler-will-himself-decide-participation-on-pakistan-tour/","keywords":["Cricket","England","England tour of Pakistan 2022","Jos Buttler","Moeen Ali","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Moeen Ali was speaking ahead of the first Pakistan vs England T20I to be played at the National Stadium on Tuesday. England vice-captain Moeen Ali, who will be leading the side especially during the first half of England’s tour of Pakistan 2022, will be at the helm in England’s first-ever international match in Pakistan since… The post “No risks will be taken”: Moeen Ali confirms that injured Jos Buttler will himself decide participation on Pakistan tour appeared first on The SportsRush.","content":"Moeen Ali was speaking ahead of the first Pakistan vs England T20I to be played at the National Stadium on Tuesday. England vice-captain Moeen Ali, who will be leading the side especially during the first half of England’s tour of Pakistan 2022, will be at the helm in England’s first-ever international match in Pakistan since 2005. Ali, 35, has led England in four T20Is in the past which includes him leading them thrice during the tour of West Indies earlier this year. Ali, who will be leading for the first time in an international match in the Asian conditions on Tuesday, considers captaining England as a “huge honour”. “Of course, my family is very happy as are my friends and my community and everybody who I feel I represent are very happy for me. Captaining England in any game, anywhere in the world is a huge honour for me,” Ali told reporters during a press conference in Karachi. For the unversed, the first England-Pakistan T20I will be all the most special for Ali because his family belongs to Pakistan. The only other instance of Ali playing representative cricket in Pakistan dates back to Pakistan Super League 2020. Moeen Ali confirms that injured Jos Buttler will himself decide participation on Pakistan tour A primary reason behind Ali bagging the leadership role is a calf injury to regular white-ball captain Jos Buttler. Buttler, whose The Hundred 2022 stint at Manchester Originals had come to an end due to the same injury, hasn’t played any representative match in the last one month. Despite being part of the squad in Pakistan, Buttler isn’t expected to take the field in the first half of the series. The same has further been confirmed by Ali providing an update around Buttler’s injury saying that England won’t risk playing him ahead of ICC T20 World Cup 2022 in Australia next month. ALSO READ: Moeen Ali sides with Jos Buttler after his poor start to full-time captaincy career “Jos [Buttler] injured his calf during The Hundred [2022]. So, he has to be careful. The [T20] World Cup in Australia is huge for us and we want him fit for the whole competition. So, no risks will be taken. He [Jos Buttler] will decide whether he will play in the last one or two games in Pakistan [or not],” Ali said of Buttler. The post “No risks will be taken”: Moeen Ali confirms that injured Jos Buttler will himself decide participation on Pakistan tour appeared first on The SportsRush.","pubDate":"2022-09-18 17:04:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India beat England by seven wickets in first women’s ODI – live - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiWGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvc2VwLzE4L2VuZ2xhbmQtdi1pbmRpYS1maXJzdC13b21lbnMtb2RpLWxpdmXSAVhodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIyL3NlcC8xOC9lbmdsYW5kLXYtaW5kaWEtZmlyc3Qtd29tZW5zLW9kaS1saXZl?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India beat England by seven wickets in first women’s ODI – live  The GuardianIndia Women vs England Women 2022 Live Cricket Score 1st ODI: Fifty for Harmanpreet, INDW Eye Victory  News18Recent Match Report - ENG Women vs IND Women 1st ODI 2022  ESPNcricinfoIndia Women vs England Women, 1st ODI Live Updates: Smriti Mandhana, Harmanpreet Kaur Guide India To..  NDTV Sports1st WODI: Smriti Mandhana, Harmanpreet Kaur, bowlers power India to thumping win over England in series opener  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-09-18 16:59:01","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"New jerseys unveiled for India men's and women's T20I cricket matches","link":"https://www.business-standard.com/article/sports/new-jerseys-unveiled-for-india-men-s-and-women-s-t20i-cricket-matches-122091800812_1.html","keywords":null,"creator":null,"video_url":null,"description":"For the first time in Indian cricket history, the jersey was unveiled not by the national team, but by the Mumbai Under-19 women's cricket players along with some of the 'superfans' of the game","content":null,"pubDate":"2022-09-18 16:55:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220918/thumb-122091800812.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"New jersey for India men’s and women’s T20I matches unveiled","link":"https://telanganatoday.com/new-jersey-for-india-mens-and-womens-t20i-matches-unveiled","keywords":["News","Sport","BCCI","national cricket team","New Jersey"],"creator":["IANS"],"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) and MPL Sports, the official kit sponsor of the national cricket team, here on Sunday unveiled the official jersey","content":"Mumbai: The Board of Control for Cricket in India (BCCI) and MPL Sports, the official kit sponsor of the national cricket team, here on Sunday unveiled the official jersey of the side for all India T20I men’s and women’s matches. For the first time in Indian cricket history, the jersey was unveiled not by the national team, but by the Mumbai Under-19 women’s cricket players along with some of the ‘superfans’ of the game. The jersey comes in shades of the iconic and fan-favourite blue colour for a look befitting the champions of the game. Termed as ‘One Blue Jersey’, it will make its debut on the pitch during the first match of the upcoming T20 series against Australia on September 20. The new one replaces the Billion Cheers Jersey at all T20 International competitions. However, the players will continue to sport the Billion Cheers Jersey in ODIs. “The jersey pays homage to the legions of fans that span different genders and age groups, and transcend geographical borders,” the kit sponsor said in a release. “It is styled with a pattern of equilateral triangles – a universal symbol of the blend of energy, spirit and power – that celebrates the unswerving support of the fans who have stood behind the team through thick and thin,” it added. Combined with petals found in the BCCI’s official insignia, the jersey embodies the loyalty and merit that the game demands. It will be available for purchase at kit sponsor’s official website and at all leading e-commerce and retail outlets.","pubDate":"2022-09-18 16:52:18","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"New Indian cricket jersey: Indian cricket team new jersey price before T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-new-indian-cricket-jersey-indian-cricket-team-new-jersey-price-before-t20-world-cup-2022/","keywords":["Cricket","BCCI","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"New Indian cricket jersey: The BCCI has revealed a new jersey for the Indian Cricket team for their upcoming international assignments. The Board of Control for Cricket in India (BCCI) unveiled the new jersey for both its men’s and women’s limited Overs teams on Sunday. The men’s team will don the brand new jersey right… The post New Indian cricket jersey: Indian cricket team new jersey price before T20 World Cup 2022 appeared first on The SportsRush.","content":"New Indian cricket jersey: The BCCI has revealed a new jersey for the Indian Cricket team for their upcoming international assignments. The Board of Control for Cricket in India (BCCI) unveiled the new jersey for both its men’s and women’s limited Overs teams on Sunday. The men’s team will don the brand new jersey right away during the upcoming three international assignments – T20I home series versus Australia, limited Overs series versus South Africa, and the T20 World Cup 2022 in Australia. “To every cricket fan out there, this one’s for you. Presenting the all new T20 Jersey – One Blue Jersey,” the BCCI tweeted. Presented by the ‘MPL Sports’, BCCI’s official kit sponsor since the year 2020, the latest one is the team’s third jersey under their sponsorship. The latest jersey is a Light-Blue T-Shirt, with Dark Blue sleeves providing a perfect contrast, to make it much more presentable and attractive, than the entire Dark Blue one donned by the players during the Asia Cup 2022. Moreover, unlike the dark blue trousers earlier, this one is an all light blue in accordance to the front of the t-shirt. To every cricket fan out there, this one’s for you. Presenting the all new T20 Jersey – One Blue Jersey by @mpl_sport. #HarFanKiJersey#TeamIndia #MPLSports #CricketFandom pic.twitter.com/3VVro2TgTT — BCCI (@BCCI) September 18, 2022 New Indian cricket jersey Good news for the Indian Cricket team fans is that the new T20 jersey is available in all the sizes from small to triple XL. Also, there are different variations of the brand new jersey from fan edition to player edition, and also the customized edition where one can have one’s name written on its back side. Also, there are separate jerseys for women and kids as well. Below are the price categories for each of the mentioned MPL new T20 jersey of team India: Fan Edition – Men – INR 1,999 Player Edition – Men – INR 3,999 Player Edition – Virat Kohli and Rohit Sharma – INR 4,299 Player Edition – Men (Customised) – INR 4,499 Player Edition – For Kids – INR 2,999 Fan Edition – For Kids – INR 1,999 Fan Edition – Virat Kohli – INR 2,299 Fan Edition – Women – INR 1,999 Fan Edition – Kids – INR 1,999 Player Edition – Women – INR 3,999 Player Edition – Kids – INR 3,999. One can purchase the aforementioned jerseys by clicking here, and going to the required category section, under the ‘New Arrival’ drop-down menu. The post New Indian cricket jersey: Indian cricket team new jersey price before T20 World Cup 2022 appeared first on The SportsRush.","pubDate":"2022-09-18 16:49:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Team's New Jersey Launched? Indian fans troll PCB as Babar Azam's photo in new jersey goes viral - Check Here","link":"https://zeenews.india.com/cricket/pakistan-cricket-teams-new-jersey-launched-indian-fans-troll-pcb-as-babar-azams-photo-in-new-jersey-goes-viral-check-here-2511679.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan announced their squad for the ICC T20 World Cup 2022 in Australia last week.","content":"The Indian cricket team's new jersey for the upcoming ICC T20 World Cup 2022 was launched by the official kit sponsor on Sunday. Team India will sport this jersey for the first time ever during the three-match T20I series against Australia, which will take place from September 20 onwards. It will also wear it during its three-match T20I series against South Africa, which will start from September 28 onwards. On the other hand, arch-rivals Pakistan's captain Babar Azam's photo with the new jersey has also gone viral on social media. The Indian fans could not control their emotions and started trolling PCB for the poor design compared to the Indian kit. However, there is no official announcement by PCB on the new kit. Check reactions - Jitna us Desiner ne paisa liya hoga n utna me tera pura pakistan chalajayenge, pura pakistan chalajayenge aua h___ aur haa jersey achhi h ____ — Vikash kumar (@Vikashk74581610) September 18, 2022 T20 WorldCup 2022 Pakistan Kit #BabarAzam #T20WorldCup2022 #Jersey #T20WorldCup pic.twitter.com/FJAW7yImYv — Syed Jalal Haider (@Jalal_haider003) September 18, 2022 Leaked: Pakistan's jersey for #T20wc2022 #T20WorldCup #T20WorldCup2022 #Pakistan #PCB pic.twitter.com/qOIS2AFe6M — Abrar Salim (@abraruae) September 18, 2022 https://t.co/mAez7vTovW Pakistan jersey — G wagon (@maybach__7171) September 18, 2022 Pakistan jersey pic.twitter.com/KOvpeQpfxc — Vishal Patel (@Vishal_dhoni07) September 18, 2022 India and Pakistan jerseys pic.twitter.com/jF0lOAbOvm — gurudattaaa (@gurudattaispog) September 18, 2022 T20 World Cup squad: Babar Azam (c), Shadab Khan (vc), Asif Ali, Haider Ali, Haris Rauf, Iftikhar Ahmed, Khushdil Shah, Mohammad Hasnain, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim, Naseem Shah, Shaheen Shah Afridi, Shan Masood, Usman Qadir Reserves: Fakhar Zaman, Mohammad Haris, Shahnawaz Dahani","pubDate":"2022-09-18 16:47:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Karachi’s renowned Polo Ground still fertile territory for Pakistani cricket","link":"https://www.theguardian.com/sport/2022/sep/18/the-renowned-polo-grounds-are-still-a-breeding-ground-for-pakistan-cricket","keywords":["Pakistan cricket team","England cricket team","Pakistan v England 2022","Cricket","Sport"],"creator":["Andy Bull in Karachi"],"video_url":null,"description":"Hanif Mohammad and his four brothers learned the game here and today hundreds of cricketers play in overlapping matchesLate Sunday morning, and there is not a scrap of spare ground to be found at Polo Ground in downtown Karachi. Every last patch of its 20 acres of path and grass is taken up with games of tape-ball cricket. There must be 30, 40, 50 overlapping matches — enough, anyway, that it is impossible to count the hundreds of players who are scattered all around, the fielders mixing with each so that, if the man at mid-wicket in one game turned on the spot, he could play cover in another, or fine leg for a third. Outside India, and the maidan in Mumbai, there is not a sight in cricket quite like it.The place is officially known as the Gulshan-e-Jinnah but no one will be able to give you directions if you call it that. Polo Ground, on the other hand, everyone knows. Everyone in Karachi cricket has played here over the years. Back in the late 1940s and early 1950s it was where Hanif Mohammad and his four brothers learned the game. They had only just moved to the city after partition. “One could see hundreds of people, mostly youngsters, playing cricket there every day,” Hanif wrote in his autobiography. “Whoever came first would choose his own spot and pitch his stumps for practice or for a match. Even the maulvis would join in.” Continue reading...","content":"L ate Sunday morning, and there is not a scrap of spare ground to be found at Polo Ground in downtown Karachi. Every last patch of its 20 acres of path and grass is taken up with games of tape-ball cricket. There must be 30, 40, 50 overlapping matches — enough, anyway, that it is impossible to count the hundreds of players who are scattered all around, the fielders mixing with each so that, if the man at mid-wicket in one game turned on the spot, he could play cover in another, or fine leg for a third. Outside India, and the maidan in Mumbai, there is not a sight in cricket quite like it. The place is officially known as the Gulshan-e-Jinnah but no one will be able to give you directions if you call it that. Polo Ground, on the other hand, everyone knows. Everyone in Karachi cricket has played here over the years. Back in the late 1940s and early 1950s it was where Hanif Mohammad and his four brothers learned the game. They had only just moved to the city after partition. “One could see hundreds of people, mostly youngsters, playing cricket there every day,” Hanif wrote in his autobiography. “Whoever came first would choose his own spot and pitch his stumps for practice or for a match. Even the maulvis would join in.” Jos Buttler and England aware of debt to Pakistan on first tour since 2005 Read more His younger brother, Mushtaq, told Peter Oborne how “when we were still small, my youngest cousin Iqbal and my older cousin Nisar and I would set out every Sunday with just two annas each in our pockets, and we headed to Polo Ground in the centre of the city where many teams used to be playing matches with intermingled field placings”. He has still not forgiven his older brothers for making him the 12th man. Soon enough Mushtaq and his brother both graduated to the old Gymkhana ground over next door’s wall, where Pakistan played some of their earliest games against MCC and other teams. In the 1960s the government used Polo Ground for military parades and after that it had a reputation as a spot where young lovers would come to meet each other. That stopped, the story goes, when a TV crew came and made a show in which the presenter went around asking the couples whether they had told their parents they were visiting the park together. The cricketers, though, have always been here. For years players have come from all over the country to play in this park in Karachi as they try to find their way in the game. These days they dream of making it much further than the Gymkhana, to the National Stadium, further out of town. Youngsters use a pile of bricks as a wicket on Sunday morning in cricket-mad Karachi. Photograph: Alex Davidson/Getty Images There is still a man on the gate collecting rupees from the lads who want to park their motorbikes inside, and a vendor wandering around between the games inside, carrying high piles of pomegranate seeds on platters hanging from a yoke over his shoulders. Even he does not try to pick his way through the middle of the park. Play does not stop for strollers, and besides there are no free paths left. The pavements make the best wickets. The latecomers have to play in the grass out by the fences, where, if they are unlucky, the ball will slip through the railings and run into the road outside. The littlest kids, five and six, are there too, out on the mud boundary that runs around the park. Inside that it is all more serious. There is still a lot of laughter but it is the bragging kind. Almost everyone who bowls here wants to be fast, and plenty really are, and almost everyone who bats wants to hit sixes, and most do. So the balls fly all over, till they plug in the long grass, where they are fetched by the unsighted fielders running around behind trees and bushes and pavilions trying to follow the bowler’s cries of “catch”. Some even have to fetch the ball from out of the muddy pond in the middle. Some players wear shalwar kameez, some are in jeans and tees, but plenty are in lurid cricket kit, bright strips and brilliant slashes, some of them from Pakistan Super League, one even in an England top, but many of the rest are from local teams, the Rising Stars, the Young Fighters. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. They use teetering piles of bricks as wickets, or sets of soldered metal stumps, and keep bags of replacement balls ready. The ground is littered with chewed-up scraps of red tape, offcuts from where it has been wound around the tennis balls to improve the swing and bounce. It seems there is always one guy who has the knack of doing it, and the players will toss him old ones to repair with the stuff he keeps in his bag. The sorry part of it all is that it is so close to England’s team hotel, hardly five minutes walk along the way, but the players themselves get to see it only through the tinted windows of their coach as they pass by on the way to training. There is palpable frustration among some of them, especially the ones who have been here before to play in the PSL, that the security cordon is so tight that they cannot even walk to the park. They may not get to see it but they can be sure everyone playing here will be watching them on Tuesday and, likely as not, somewhere among them will be the bowler they will be facing when they come back here in a few years.","pubDate":"2022-09-18 16:38:08","image_url":"https://i.guim.co.uk/img/media/b704c87469726eae250e25f23bc8f4abdf09f385/0_247_4352_2611/master/4352.jpg?width=460&quality=85&auto=format&fit=max&s=b61e4601c1b64689614b5169c63b1f04","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Team India's new cricket jersey out, fans not entirely impressed – Where is Virat Kohli?","link":"https://www.indiatoday.in/sports/cricket/story/team-india-s-new-cricket-jersey-out-fans-not-entirely-impressed-where-is-virat-kohli-2001798-2022-09-18?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Where is Kohli? Team India's new cricket jersey out, fans not entirely impressed","content":null,"pubDate":"2022-09-18 16:35:59","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket: मणिपाल टाइगर्स ने भीलवाड़ा किंग्स को दिया 154 का लक्ष्य, कैफ ने फिफ्टी जड़ पलटा मैच","link":"https://www.abplive.com/sports/cricket/manipal-tigers-gave-a-target-of-154-runs-to-bhilwara-kings-mohammad-kaif-scored-a-half-century-2218710","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Bhilwara Kings vs Manipal Tigers: लीजेंड्स लीग क्रिकेट के दूसरे मुकाबले में आज इरफान पठान की टीम भीलवाड़ा किंग्स का मुकाबला हरभजन सिंह के मणिपाल टाइगर्स से हो रहा है. दोनों के बीच यह मुकाबला लखनऊ के इकाना इंटरनेशनल क्रिकेट स्टेडियम में खेला जा रहा है. वहीं इस मैच में टॉस हारकर मणिपाल टाइगर्स बल्लेबाजी करने उतरी. मणिपाल टाइगर्स के ओर से सिर्फ मोहम्मद कैफ ने शानदार 73 रनों की अर्धशतकीय पारी खेली. जिसके बाद मणिपाल टाइगर्स ने 153 रनों का स्कोर बनाया. वहीं भीलवाड़ा किंग्स के ओर से फिडेल एडवर्ड्स ने सबसे अधिक 4 विकेट अपने नाम किए. अब भीलवाड़ा किंग्स को जीतने के लिए 154 रन बनाने होंगे. भीलवाड़ा किंग्स को मिला 154 रनों का टारगेटटॉस हारकर पहले बल्लेबाजी करने उतरी मणिपाल टाइगर्स की शुरूआत अच्छी नहीं रही. और टीम का पहला विकेट 1 रन के स्कोर पर रविकांत शुक्ला (1) रन बनाकर भीलवाड़ा किंग्स के कप्तान इरफान पठान का पहला शिकार बने. वहीं पहले विकेट के बाद मणिपाल टाइगर्स संभल नहीं पाई और टीम के शुरूआत चार बल्लेबाज 15 रन के भीतर आउट हो गए. पहले विकेट के बाद 6 रन के स्कोर पर स्वपनिल (3) रन, कोरी एंडरसन (0) शून्य के स्कोर पर और रिचार्डो पॉवेल (3) रन बनाकर आउट हुए. मणिपाल टाइगर्स को यह तीनों झटके फिडेल एडवर्ड्स ने दिए. इसके बाद मणिपाल की पारी को मोहम्मद कैफ और ततेंद्र टायबू ने संभाला और टीम का स्कोर 50 के पार ले गए. हालांकि 53 के स्कोर पर टायबू (17) रन बनाकर मोंटी पनेसर की गेंद पर आउट हो गए. मणिपाल के तरफ से मोहम्मद कैफ ने सबसे अधिक 59 गेदों पर 10 चौके की मदद से 73 रनों की शानदार अर्धशतकीय पारी खेली. कैफ के अलावा प्रदीप साहू ने 30 रनों की पारी खेली. वहीं भालवाड़ा किंग्स के ओर से फिडेल एडवर्ड ने सबसे अधिक 4 विकेट हासिल किया. इस मैच में मणिपाल टाइगर्स ने 153 रन बनाए हैं. वहीं अब इसके बाद भीलवाड़ा किंग्स को जीतने के लिए 154 रन बनाने होंगे. यह भी पढ़ें: T20 World Cup 2022: टी20 वर्ल्ड कप के लिए टीम इंडिया की नई जर्सी लॉन्च, सामने आईं ये खास तस्वीरें Most Runs In T20I 2022: इन खिलाड़ियों ने इस साल T20I में बनाए सबसे ज्यादा रन, देखें लिस्ट में कौन कौन है शामिल","content":null,"pubDate":"2022-09-18 16:18:33","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Team India's New Jersey Launched: Here's all you need to know about Indian cricket team new 'SKY-BLUE' kit","link":"https://zeenews.india.com/cricket/team-indias-new-jersey-launched-heres-all-you-need-to-know-about-indian-cricket-team-new-sky-blue-kit-2511671.html","keywords":null,"creator":null,"video_url":null,"description":"The jersey comes in shades of the iconic and fan-favourite blue colour for a look befitting the champions of the game.","content":"Team India's jersey for the upcoming ICC T20 World Cup 2022 was unveiled on Sunday. The Board of Control for Cricket in India (BCCI) took to Twitter to reveal the jersey. The front of the jersey has light tones of Azure Blue while the sleeves feature dark tones of Royal Blue. \"To every cricket fan out there, this one's for you. Presenting the all-new T20 Jersey - One Blue Jersey by @mpl_sport. #HarFanKiJersey #TeamIndia #MPLSports #CricketFandom,\" tweeted BCCI. Team India will sport this jersey for the first time ever during the three-match T20I series against Australia, which will take place from September 20 onwards. It will also wear it during its three-match T20I series against South Africa, which will start from September 28 onwards. Check all photos of new jersey here To every cricket fan out there, this one’s for you. Presenting the all new T20 Jersey - One Blue Jersey by @mpl_sport . #HarFanKiJersey #TeamIndia #MPLSports #CricketFandom pic.twitter.com/3VVro2TgTT — BCCI (@BCCI) September 18, 2022 For the first time in Indian cricket history, the jersey was unveiled not by the national team, but by the Mumbai Under-19 women's cricket players along with some of the 'superfans' of the game. The jersey comes in shades of the iconic and fan-favourite blue colour for a look befitting the champions of the game. Termed as 'One Blue Jersey', it will make its debut on the pitch during the first match of the upcoming T20 series against Australia on September 20. The new one replaces the Billion Cheers Jersey at all T20 International competitions. However, the players will continue to sport the Billion Cheers Jersey in ODIs. \"The jersey pays homage to the legions of fans that span different genders and age groups, and transcend geographical borders,\" the kit sponsor said in a release. \"It is styled with a pattern of equilateral triangles - a universal symbol of the blend of energy, spirit and power - that celebrates the unswerving support of the fans who have stood behind the team through thick and thin,\" it added. Combined with petals found in the BCCI's official insignia, the jersey embodies the loyalty and merit that the game demands. It will be available for purchase at kit sponsor's official website and at all leading e-commerce and retail outlets. Team India skipper Rohit Sharma, star all-rounder Hardik Pandya and Suryakumar Yadav were among the men's players present in the picture. While women's cricketers like Renuka Singh, captain Harmanpreet Kaur were among the players from the women's team in the picture. All eyes are on this T20I series against Australia and another home series against South Africa, starting from October 28, consisting of three ODIs and three T20Is. These will serve as quality match practice for Men in Blue for ICC T20 World Cup 2022, which will go on from October 16 to November 13 this year. India could not qualify for semis the previous year as they crashed out of the competition in the Super 12 phase. India squad for the Australia series: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Harshal Patel, Deepak Chahar, Jasprit Bumrah, Umesh Yadav. India squad for South Africa T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah. India squad for ICC T20 World Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh. Standby players - Mohd. Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar.","pubDate":"2022-09-18 16:06:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India cricket team unveils new jersey for T20 World Cup","link":"https://indianexpress.com/article/sports/cricket/india-cricket-team-unveils-new-jersey-for-t20-world-cup-8158871/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-09-18 15:59:53","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa Indore match tickets: How to book Indore Cricket Match tickets for 3rd IND vs SA T20?","link":"https://thesportsrush.com/cricket-news-india-vs-south-africa-indore-match-tickets-how-to-book-indore-cricket-match-tickets-for-3rd-ind-vs-sa-t20/","keywords":["Cricket","Holkar Cricket Stadium","Indore","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs South Africa Indore match tickets: India will take on South Africa as their last limited Overs assignment before the T20 World Cup. Post the three-match T20I series against Australia, team India will take on South Africa soon after, in a three-match each T20I and ODI series at home commencing September 28. The action… The post India vs South Africa Indore match tickets: How to book Indore Cricket Match tickets for 3rd IND vs SA T20? appeared first on The SportsRush.","content":"India vs South Africa Indore match tickets: India will take on South Africa as their last limited Overs assignment before the T20 World Cup. Post the three-match T20I series against Australia, team India will take on South Africa soon after, in a three-match each T20I and ODI series at home commencing September 28. The action for the first and second T20Is will take place at Thiruvananthapuram and Guwahati respectively, after which the action moves to heart of the country at the Holkar Cricket Stadium in Indore, on October 4. It is worth of a mention that ticket booking (online or offline) for the general populace has not yet begun, but the registrations for a set quota of special students concession tickets and ‘Women only’ tickets have already begun. We will now present before you the steps for the mandatory registration process for the aforementioned tickets. While a student can only purchase one ticket each of the relevant stand, a woman can purchase only up to two tickets for the relevant stands. India vs South Africa Indore match tickets Student concession tickets East Gallery Upper tier tickets at INR 449, and East Gallery Second Floor tickets at INR 600, will be available for the students of 1st standard onwards of the ‘Government Recognized education institutions’ – including colleges, schools, universities, but excluding coaching classes, academies etc. The interested students will first have to register themselves (the link for which is provided at the end of this article) by submitting the below mentioned documents latest by September 20, 5 pm, or till the end of the quota of tickets. Photo identity card issued by the Institution for the current academic year 2021-22 or 2022-23 Or ‘Progress report card’ for the current academic year 2021-22 or 2022-23 Or ‘Mid-term exam result’ for the current academic year 2021-22 or 2022-23 Or A special form designed for students who do not have the above documents. The form should be duly filled and the signature of the School Authority be obtained. After successfully registering themselves, eligible students will receive a ticket buying link on their registered e-mail address by September 21. The link for the approved students will be open till 8 pm on September 21, or till the end of the quota of tickets. Women Only Tickets South Pavilion Lower tickets at INR 4,000, and West Gallery Lower tickets at INR 570, will be available for women and/or their accompanying male or female child below 12 years of age, after registering themselves (the link for which is provided at the end of this article) by submitting the below mentioned documents latest by September 20, 5 pm, or till the end of the quota of tickets. Aadhar Card Valid Driving License Valid Passport Valid Voter ID One will have to upload a clear scanned copy of the above documents during the submission process. After successfully registering themselves, women will receive a ticket buying link on their registered e-mail address by September 21, 12 pm. The link for the approved women applicants will be open till 8 pm on September 21, or till the end of the quota of tickets. Both the students and women ticket holders will have the tickets delivered via courier services. They will also have to additionally bear the gateway charges, while only the women will have to bear the relevant taxes for the tickets. Click here for the registration link for both students and women only tickets. Post clicking on the link, click on the relevant image (for student or women ticket) present on the page to begin with the process. The post India vs South Africa Indore match tickets: How to book Indore Cricket Match tickets for 3rd IND vs SA T20? appeared first on The SportsRush.","pubDate":"2022-09-18 15:45:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BCCI unveils new jersey for Team India ahead of T20 World Cup","link":"https://www.tribuneindia.com/news/sports/bcci-unveils-new-jersey-for-team-india-ahead-of-t20-world-cup-433015","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, September 18Team India's jersey for the upcoming ICC T20 World Cup 2022 was unveiled on Sunday.The Board of Control for Cricket in India (BCCI) took to Twitter to reveal the jersey.The front of the jersey has light tones of Azure Blue while the sleeves feature dark tones of Royal Blue.\"To every cricket fan out there, this one's for you. Presenting the all-new T20 Jersey - One Blue Jersey by @mpl_sport. #HarFanKiJersey #TeamIndia #MPLSports #CricketFandom,\" tweeted BCCI.To every cricket fan out there, this one's for you.Presenting the all new T20 Jersey - One Blue Jersey by @mpl_sport. #HarFanKiJersey#TeamIndia #MPLSports #CricketFandom pic.twitter.com/3VVro2TgTT— BCCI (@BCCI) September 18, 2022Team India will sport this jersey for the first time ever during the three-match T20I series against Australia, which will take place from September 20 onwards. It will also wear it during its three-match T20I series against South Africa, which will start from September 28 onwards.Team India skipper Rohit Sharma, star all-rounder Hardik Pandya and Suryakumar Yadav were among the men's players present in the picture. While women's cricketers like Renuka Singh, captain Harmanpreet Kaur were among the players from the women's team in the picture.All eyes are on this T20I series against Australia and another home series against South Africa, starting from October 28, consisting of three ODIs and three T20Is. These will serve as quality match practice for Men in Blue for ICC T20 World Cup 2022, which will go on from October 16 to November 13 this year.India could not qualify for semis the previous year as they crashed out of the competition in the Super 12 phase.India squad for the Australia series: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Harshal Patel, Deepak Chahar, Jasprit Bumrah, Umesh Yadav.India squad for South Africa T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah.India squad for ICC T20 World Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh.Standby players - Mohd. Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar.","content":"ANI Mumbai, September 18 Team India's jersey for the upcoming ICC T20 World Cup 2022 was unveiled on Sunday. The Board of Control for Cricket in India (BCCI) took to Twitter to reveal the jersey. The front of the jersey has light tones of Azure Blue while the sleeves feature dark tones of Royal Blue. \"To every cricket fan out there, this one's for you. Presenting the all-new T20 Jersey - One Blue Jersey by @mpl_sport. #HarFanKiJersey #TeamIndia #MPLSports #CricketFandom,\" tweeted BCCI. To every cricket fan out there, this one’s for you. Presenting the all new T20 Jersey - One Blue Jersey by @mpl_sport . #HarFanKiJersey #TeamIndia #MPLSports #CricketFandom pic.twitter.com/3VVro2TgTT Team India will sport this jersey for the first time ever during the three-match T20I series against Australia, which will take place from September 20 onwards. It will also wear it during its three-match T20I series against South Africa, which will start from September 28 onwards. Team India skipper Rohit Sharma, star all-rounder Hardik Pandya and Suryakumar Yadav were among the men's players present in the picture. While women's cricketers like Renuka Singh, captain Harmanpreet Kaur were among the players from the women's team in the picture. All eyes are on this T20I series against Australia and another home series against South Africa, starting from October 28, consisting of three ODIs and three T20Is. These will serve as quality match practice for Men in Blue for ICC T20 World Cup 2022, which will go on from October 16 to November 13 this year. India could not qualify for semis the previous year as they crashed out of the competition in the Super 12 phase. India squad for the Australia series: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Harshal Patel, Deepak Chahar, Jasprit Bumrah, Umesh Yadav. India squad for South Africa T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah. India squad for ICC T20 World Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh. Standby players - Mohd. Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar. #BCCI #t20 world cup","pubDate":"2022-09-18 15:39:07","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_338491593.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India's New Jersey Unveiled Ahead Of ICC T20 World Cup 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0LW5ld3MvaW5kaWFzLW5ldy1qZXJzZXktdW52ZWlsZWQtYWhlYWQtb2YtaWNjLXQyMC13b3JsZC1jdXAtMjAyMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India's New Jersey Unveiled Ahead Of ICC T20 World Cup 2022  Cricket AddictorBCCI Unveils New Team India T20 Jersey Ahead Of T20 World Cup  NDTV SportsBCCI unveils Team India's new jersey ahead of T20 World Cup; see first pictures  Hindustan TimesIndia Cricket Team Jersey Reveal Highlights: Skipper Rohit Sharma, Harmanpreet Kaur Flaunt Jersey In Style, P  India.comTeam India's new cricket jersey out, fans not entirely impressed – Where is Virat Kohli?  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-09-18 15:28:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI Unveils New Team India T20 Jersey Ahead Of T20 World Cup - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvYmNjaS11bnZlaWxzLW5ldy10ZWFtLWluZGlhLXQyMC1qZXJzZXktYWhlYWQtb2Ytd29ybGQtY3VwLTMzNTU5NjPSAWdodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2JjY2ktdW52ZWlscy1uZXctdGVhbS1pbmRpYS10MjAtamVyc2V5LWFoZWFkLW9mLXdvcmxkLWN1cC0zMzU1OTYzL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BCCI Unveils New Team India T20 Jersey Ahead Of T20 World Cup  NDTV SportsBCCI unveils Team India's new jersey ahead of T20 World Cup; see first pictures  Hindustan TimesIndia Cricket Team Jersey Reveal Highlights: Skipper Rohit Sharma, Harmanpreet Kaur Flaunt Jersey In Style, P  India.comBCCI unveils India's new jersey ahead of T20 World Cup 2022  CricTrackerBCCI unveils new T20 jersey for both men's, women's Indian cricket teams | Mint  MintView Full coverage on Google News","content":null,"pubDate":"2022-09-18 15:12:42","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Hafeez slams selectors for leaving Malik out of Pakistan's T20 WC squad","link":"https://www.business-standard.com/article/sports/hafeez-slams-selectors-for-leaving-malik-out-of-pakistan-s-t20-wc-squad-122091800758_1.html","keywords":null,"creator":null,"video_url":null,"description":"Former Pakistan captain Muhammad Hafeez has lashed out at the national selectors for ignoring seasoned allrounder Shoaib Malik for the upcoming T20 World Cup in Australia. Hafeez said he had advised Malik to take retirement after last year's World Cup as he knew they would no longer be part of the Pakistan team set-up. \"I don't even know whether he will get a proper farewell now which he should, given his 22 years of international cricket. Because as things stand after his recent tweet where he highlighted friendships, liking and disliking in the team many are unhappy with him,\" Hafeez told the CricketPakistan channel. \"Malik gave his best to Pakistan for about 21-22 years and maintaining your fitness standards for that long is absolutely remarkable. \"When I took my retirement, I told Malik to take retirement as well because I knew that he will not be respected as it was also evident in my case. My understanding was that he wanted one last standing but cricket is cruel like ...","content":null,"pubDate":"2022-09-18 15:11:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220918/thumb-122091800758.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Jemimah Rodrigues dropped: Why is Jemimah Rodrigues not playing today’s 1st ODI between India and England in Hove?","link":"https://thesportsrush.com/cricket-news-why-jemimah-rodrigues-dropped-why-is-jemimah-rodrigues-not-playing-todays-1st-odi-between-india-and-england-in-hove/","keywords":["Cricket","England Women","India Women","India Women tour of England 2022","Jemimah Rodrigues"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why is Jemimah Rodrigues not playing today: The Indian batter isn’t part of the Playing XI for the first ODI in Hove today. England Women have managed to steer to a safe and respectable innings total in the first WODI against India Women in Hove today. Asked to bat first by visiting captain Harmanpreet Kaur… The post Why Jemimah Rodrigues dropped: Why is Jemimah Rodrigues not playing today’s 1st ODI between India and England in Hove? appeared first on The SportsRush.","content":"Why is Jemimah Rodrigues not playing today: The Indian batter isn’t part of the Playing XI for the first ODI in Hove today. England Women have managed to steer to a safe and respectable innings total in the first WODI against India Women in Hove today. Asked to bat first by visiting captain Harmanpreet Kaur at the toss, England had lost half their side before the 100-run mark just after the halfway mark of their innings. Playing only her third WODI, England all-rounder Alice Davidson-Richards scored a maiden white-ball half-century playing a pivotal role in her team scoring 227/7 in 50 overs. Davidson-Richards, who scored 50* (61) with the help of four fours, batted at a strike rate of 81.96 at the County Ground on a Sunday afternoon. Davidson-Richards was well-assisted by Sophie Ecclestone (31) and Charlie Dean (24*) as lower-order contributions worked in the hosts’ favour. India all-rounder Deepti Sharma was the pick of their bowlers as her bowling figures of 10-1-33-2 comprised of dismissals of Danni Wyatt (43) and Ecclestone. Apart from Sharma, Jhulan Goswami, Harleen Deol, Rajeshwari Gayakwad, Meghna Singh and Sneh Rana picked a wicket apiece. Why is Jemimah Rodrigues not playing vs England today? Coming on the back of a 1-2 T20I series loss, India lost opening batter Shafali Verma (1) to Kate Cross in the second over to not register the best of starts chasing a 228-run target. Having said that, opening batter Smriti Mandhana and wicket-keeper batter Yastika Bhatia have been batting at over a run-a-ball to put on display a brilliant progress. Bhatia, in particular, is in the middle of a stroke-filled innings inching towards a fourth WODI half-century. However, Bhatia’s presence in the middle is making the Indian fans wonder about the absence of batter Jemimah Rodrigues. With most of her international appearances coming in the top-order, Rodrigues not playing this match isn’t because she has been dropped from the Indian squad. ALSO READ: Jemimah Rodrigues asks Mumbai Indians to bid for her in Women’s IPL auction 2023 Readers must note that Rodrigues is currently recovering from a wrist injury which she had sustained during Commonwealth Games 2022 Women’s Cricket Competition in England last month. With Women’s Asia Cup 2022 and Women’s Big Bash League 2022 to be played next month, fans can expect Rodrigues to return to action soon. The post Why Jemimah Rodrigues dropped: Why is Jemimah Rodrigues not playing today’s 1st ODI between India and England in Hove? appeared first on The SportsRush.","pubDate":"2022-09-18 15:07:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Indian cricket team's new jersey for ICC T20 World Cup 2022 unveiled by BCCI- Check photos","link":"https://zeenews.india.com/cricket/new-jersey-of-indian-cricket-team-bcci-unveils-indian-cricket-teams-new-jersey-for-icc-t20-world-cup-2022-check-photos-2511634.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team changed their jersey ahead of ICC T20 World Cup 2021 in UAE.","content":"Indian cricket team finally unveiled their jersey for the upcoming ICC T20 World Cup 2022 scheduled to take place in Australia starting in the month of October. The BCCI has decided to switch back to the sky-blue colour for the mega event. India won three ICC events in the sky-blue jersey. This is likely to be the new Jersey of the Indian team. pic.twitter.com/9qldPk0t05 — Johns. (@CricCrazyJohns) New Jersey of the Indian T20 team. pic.twitter.com/jvJaXhuqDE — Johns. (@CricCrazyJohns) September 18, 2022 #Jersey #IndianCricketTeam Here is the New Jersey of India. For T20 World Cup Good jersey atleast better than last one but what is stopping them to use our flag as a part of jersey . As a fan I would love to have that type of jersey pic.twitter.com/HrS1xiyVMm — CricFun (@CricFunstand) September 18, 2022 When will Team India's T20 World Cup 2022 jersey launch? India are playing Australia in a T20I series from September 20. The first match takes place in Mohali, Punjab. However, some members of Team India are expected to be present in Mumbai on September 18 as the new jersey will be launched in Mumbai on that day. As per a press release by MPL Sports, Team India's new jersey will be launched at or after 8 pm in an event that is being held at Bandstand Promenade in Mumbai. India have a tough challenge before World Cup India could not defend the Asia Cup title this year. They lost 2 key games in Super 4 stage and that led to them being knocked out of the tournament. In words of Virat Kohli and Rohit, India got a good understanding of how they are going to deal with such crunch situations at the World Cup. Kohli had said that India got those pressure points and difficult situations in a multi-nation tournament and that has been the biggest takeaway for Men In Blue. The upcoming T20Is vs Australia and South Africa will act as another round of practice for Team India, where they are expected to play their full-strength XI.","pubDate":"2022-09-18 14:25:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC Live: Bhilwara Kings Win Toss, Elect To Bowl vs Manipal Tigers","link":"https://sports.ndtv.com/cricket/bhilwara-kings-vs-manipal-tigers-legends-league-cricket-2022-live-updates-3355678","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket, Bhilwara Kings vs Manipal Tigers Live Updates: Bhilwara Kings won the toss and elected to bowl against Manipal Tigers in the second match of the Legends League Cricket in...","content":"Legends League Cricket, Bhilwara Kings vs Manipal Tigers Live Updates : Bhilwara Kings won the toss and elected to bowl against Manipal Tigers in the second match of the Legends League Cricket in Lucknow. The Kings will be led by the former India all-rounder Irfan Pathan while former India spinner Harbhajan Singh will be captaining the Tigers. It will be an interesting match as the Irfan Pathan-led side features the likes of Shane Watson , Matt Prior , Naman Ojha , among others. Tigers on the other hand, will be having the services of Australia pacer legend Brett Lee and former South Africa spinner Imran Tahir .","pubDate":"2022-09-18 13:09:13","image_url":"https://c.ndtvimg.com/2022-09/lnacpoho_ekana-stadium-lucknow-240_120x90_18_September_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Duleep Trophy: South Zone crush North Zone by 645 runs, to face West Zone in finals","link":"https://telanganatoday.com/duleep-trophy-south-zone-crush-north-zone-by-645-runs-to-face-west-zone-in-finals","keywords":["News","Sport","(South Zone)","Duleep Trophy","North Zone"],"creator":["PTI"],"video_url":null,"description":"Left-arm orthodox spinner R Sai Kishore's maiden match haul of 10 wickets ensured a staggering 645-run victory for South Zone over North","content":"Coimbatore: Left-arm orthodox spinner R Sai Kishore’s maiden match haul of 10 wickets ensured a staggering 645-run victory for South Zone over North to set up a clash with West Zone in the Duleep Trophy final starting on Wednesday. The margin of victory was one of the highest in Indian first-class cricket. West Zone also won their semi-final in commanding fashion beating Central Zone by a comfortable 279-run margin. The final will be played in Coimbatore from September 21, and it will be a five-day affair. In the South versus North game, the contest was killed by the winning team’s batters when they piled up a mammoth 630/8 declared in their first innings, riding on hundreds from opener Rohan Kunnummal, skipper Hanuma Vihari and Ricky Bhui. Once North were all out for 207 in their first innings, courtesy Sai Kishore’s 7/70, the writing was on the cards. South didn’t enforce follow-on and scored 316/4, piling on North’s misery by giving them an improbable target of 740 to chase. On the final day, North were bowled out for 94 in 30.4 overs with Sai Kishore (3/28), off-spinner Krishnappa Gautham (3/50) and another slow left-armer, Tanay Thyagarajan (3/12), sharing the spoils. It was a match that belonged to Sai Kishore for his stupendous effort (10/98 in 39 overs) as the pitch wasn’t difficult to bat on. Sai Kishore varied his pace and lengths to trouble the North batters with only opener Yash Dhull (59 off 58 balls) showing some counter-attacking instincts. The innings was terminated at the fall of ninth wicket as Navdeep Saini, who has been declared unfit by the BCCI, didn’t come out to bat. As many as eight North batters failed to reach double figures. Left-arm spinner Shams Mulani, who finished as the highest wicket-taker in Ranji Trophy, continued his rich vein of form by taking 5 for 72, as West made short work of Central in the other semifinal. Chasing a gigantic target of 501, Central were never in contention to make a match of it and were all out for 221 in little over 57 overs. Chintan Gaja, the seamer whose mindless bravado of deliberately throwing the ball back on follow through injured Venkatesh Iyer, also got his act together and chipped in with three wickets. Rinku Singh (65 off 71 balls), and ‘concussion substitute’ Ashok Menaria (in place of Venkatesh Iyer) (32 off 71 balls), delayed the inevitable with a 87-run stand for the seventh wicket. Brief Scores: South Zone 630/8 decl & 316/4 decl (Ravi Teja 104 no, Rohan Kunnummal 77, Mayank Agarwal 64) bt North Zone 207 & 94 in 30.4 overs (Yash Dhull 59, R Sai Kishore 3/28, K Gowtham 3/50, Tanay Thayagrajan 3/12); West Zone 257 & 371 bt Central Zone 128 & 221 in 57.1 overs (Rinku Singh 65, Shams Mulani 5/72).","pubDate":"2022-09-18 12:38:40","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS Nagpur tickets: How to redeem physical India vs Australia Nagpur cricket match tickets?","link":"https://thesportsrush.com/cricket-news-ind-vs-aus-nagpur-tickets-how-to-redeem-physical-india-vs-australia-nagpur-cricket-match-tickets/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs AUS Nagpur tickets: India vs Australia 2nd T20I ticket sales for general public was scheduled to begin from today. Slated to be played on September 23 in Nagpur, ticket sales for general public for the second India vs Australia T20I was scheduled to commence from today at online platform Paytm Insider. September 18… The post IND vs AUS Nagpur tickets: How to redeem physical India vs Australia Nagpur cricket match tickets? appeared first on The SportsRush.","content":"IND vs AUS Nagpur tickets: India vs Australia 2nd T20I ticket sales for general public was scheduled to begin from today. Slated to be played on September 23 in Nagpur, ticket sales for general public for the second India vs Australia T20I was scheduled to commence from today at online platform Paytm Insider. September 18 also brings an end to all opportunities Life Members of the Vidarbha Cricket Association Stadium had to secure tickets on a priority basis. IND vs AUS Nagpur tickets Interested fans must note that they can book tickets for this match on both the website and mobile application of Paytm Insider. In the morning, the traffic on the website was such that it had crashed leading to confusion among people who were looking to book tickets. It is noteworthy that all issues with respect to the website have been resolved now and that people can book tickets without facing any errors. All you have to do is click here to reach Paytm Insider’s web page and select price categories and number of tickets to be booked according to the requirements. VCA Stadium, Jamtha, which has a total of five levels, has as many as 10 price categories from which people can pick and choose. That being said, Paytm Insider had tickets available in seven different price categories this morning. It is worth mentioning that most of the tickets have been sold out and that there is no official information right now around another round of ticket booking for this match. How to redeem physical India vs Australia Nagpur cricket match tickets? Unlike tickets for the third India-Australia T20I in Hyderabad, there’s no option of Nagpur fans getting booked tickets delivered to their residential address. Therefore, all the ticket holders for Nagpur T20Is will have to visit VCA Civil Lines to collect physical tickets. Readers must note that entry inside the stadium won’t be allowed without obtaining physical tickets. The counters for collecting physical tickets at the above mentioned venue will be in operation between September 19-23 (10:00 AM to 05:00 PM). The post IND vs AUS Nagpur tickets: How to redeem physical India vs Australia Nagpur cricket match tickets? appeared first on The SportsRush.","pubDate":"2022-09-18 12:36:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Nathan Ellis’ long and winding road to international cricket, past the Starc-arc","link":"https://indianexpress.com/article/sports/cricket/nathan-ellis-long-and-winding-road-to-international-cricket-past-the-starc-arc-8158632/","keywords":["Cricket","Sports"],"creator":["Pratyush Raj"],"video_url":null,"description":null,"content":"From being a landscaping worker, working at a construction site, being a furniture removalist, a teacher’s assistant at a high school, doing multiple shifts to pay the bills, to becoming the first man to take a T20I hat-trick in his first game, Nathan Ellis has endured more than his share of struggles en route representing Australia. Although, he has played only a handful of games for Australia, but the 27-year-old, since making his debut for Hobart Hurricanes in 2019, has become one of the finest death bowlers in Australia. After his impressive outing in the BBL and with the national team, he found a spot in Australia’s victorious T20 World Cup campaign as a travelling reserve, and bagged a IPL contract with the Punjab Kings. Switching jobs to paying his bills At 22, Nathan Ellis moved from New South Wales to Tasmania to make a living out of cricket. He had no contract, no job, but the only thing that kept him going was the hunger to prove his nasayers wrong. Subscriber Only Stories View All Premium Sleight of Sukesh Chandrashekhar: Life of a conman with an obsession for ... Premium A letter from Lakhimpur Kheri: All that died in a UP village as two siste... Premium Godard, God & Kerala: A breathless admiration Premium Tavleen Singh writes: Punishment without proof Subscribe Now to get 33% OFF “Back when I was 22, I moved from New South Wales to Tasmania to try and pursue a cricketing dream. I didn’t have a contract then, and I was moving out of home for the first time, so there were a lot of expenses that came with it,” Ellis told Cricket Australia’s YouTube channel. “I had 5-6 different jobs back then to try and pay the bills. I started with some landscaping work, but I had to quit that because they wanted me to work Saturdays and that’s when the cricket was on,” recalls Ellis. “I did some furniture removal and furnishing as well, but I had to leave that too because it clashed with my match days. I also did some construction work but that was too hard on the body, so I had to give that up as well,” he added. After working assorted different jobs to support his cricket career, he refers the lowest moment of his life, as when he was sacked from a door-to-door fundraiser for the World Wildlife Fund. Advertisement “I got a door knocking job, they probably pay you just to knock on the door, eight hours a day. You are waking up people at 6 am and most of them used to slam doors on my face. It was one of the lowest moments in my career,” he laughs. Nathan Ellis then found an ideal job as a teacher’s assistant at a high school, which fortunately did not interfere with his match days. “Looking back, I don’t even know how I managed to fit everything together. It was a tough few years where I was getting fired from a lot of different jobs and working lots of different shifts. Something that at the time was hard, but now I can look back on as a really great life experience,” he stated with a smile on his face. Giving up on the game Advertisement Ellis is not the first cricketer from New South Wales, to find a home in Tasmania and flourish into an international cricketer. He joins the likes of Jackson Bird, Ed Cowan and Jason Krejza. Despite all this effort, Ellis was not able to break into the Tasmanian senior team. He says, in 2019, he considered returning to Sydney. “I had played two seasons in Tasmania, and I had done really well in grade level cricket but I hadn’t received an opportunity in the state team,” said the 26-year-old. “I was sort of thinking that I need to go back home, I wasn’t saving any money, I wasn’t really building a career so it was time to start the next chapter of my life,” he added. A phone call from then Tasmania coach Adam Griffith persuaded him to stay for another year. Advertisement “I told him (Griffith) I’m done, I can’t do another season here. I’m not making any money. But he sort of coaxed me into staying, and I just thought one more year! And that turned out to be my breakout year. It all happened really quickly from there on, with my call up to Tasmania and the Big Bash contract,” recalled Ellis. Ellis’s world was changing. He took his first domestic five-wicket haul in just his fifth game against a star-studded NSW side. Advertisement In his debut BBL season, he took 20 wickets at an economy rate of 8.31, fifth best for the competition overall. What followed was a maiden Australian call-up, and what followed that is an indelible place in the history books for Ellis owing to that dream T20I debut. “I sort of look back at that moment and think what could have been had I not stayed for one more year in Tasmania. My bags were packed, I was ready to go home. So I look back now and think Wow! What a good decision I made,” he said. Advertisement Life came a full circle for Ellis in Mirpur last year, when Mitchell Starc, one of the NSW quicks, who was ahead of him in the pecking order, handed over his first international cap. “In a nutshell he was one of the reasons I had to go (to Tasmania) – they’re such a strong state with a lot of depth,” said Ellis. Cut to present, for Australia’s tour to India, he has now replaced an injured Mitchell Starc, who has complained of a knee problem after the ODI series win against New Zealand.","pubDate":"2022-09-18 12:33:15","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Manipal Tigers vs Bhilwara Kings Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s MNT vs BHK Legends League Cricket 2022 at Ekana Cricket Stadium, Lucknow","link":"https://zeenews.india.com/cricket/manipal-tigers-vs-bhilwara-kings-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-mnt-vs-bhk-legends-league-cricket-2022-at-ekana-cricket-stadium-lucknow-2511611.html","keywords":null,"creator":null,"video_url":null,"description":"Manipal Tigers vs Bhilwara Kings Dream11 Team Prediction Manipal Tigers vs Bhilwara Kings Legends League Cricket 2022 Match Preview - Check My Dream11 Team, Best players list of BHK vs MNT, Manipal Tigers Dream11 Team Player List, Bhilwara Kings Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-09-18 12:25:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}