{"newsArray":[{"title":"Mehidy, Najmul help Bangladesh seal T20I series against England","link":"http://island.lk/mehidy-najmul-help-bangladesh-seal-t20i-series-against-england/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"On a typical Dhaka surface aiding spinners, Bangladesh made all the right moves and held their nerves to secure an unassailable 2-0 series lead over England, the reigning T20 World Cup champions. Mehidy Hasan Miraz, who was brought in for this game, starred with figures of 4 for 12 and helped bowl out England for […]","content":"On a typical Dhaka surface aiding spinners, Bangladesh made all the right moves and held their nerves to secure an unassailable 2-0 series lead over England, the reigning T20 World Cup champions. Mehidy Hasan Miraz, who was brought in for this game, starred with figures of 4 for 12 and helped bowl out England for 117. Najmul Hossain Shanto then steered Bangladesh in a tricky run chase with a 46* and delivered the win with seven balls to spare. Brief Scores : 117 (Ben Duckett 28; Mehidy Hasan Miraz 4-12) 120/6 in 18.5 overs (Najmul Hossain Shanto 46*; Jofra Archer 3-13) Published on By A dominant half-century from Harmanpreet Kaur, coupled with impressive performances with the bat from Yastika Bhatia and Nat Sciver-Brunt helped Mumbai Indians register their fourth straight win in the inaugural Women’s Premier League. Half-centuries from Alyssa Healy and Tahlia McGrath appeared to be enough initially to inflict the first loss for MI in their campaign but the table-toppers eventually cruised to victory in pursuit of 160 with 15 balls to spare following a century stand. Brief scores: UP Warriorz 159/6 in 20 overs (Alyssa Healy 58, Tahlia McGrath 50; Saika Ishaque 3/33) Mumbai Indians Women 164/2 in 17.3 overs (Harmanpreet Kaur 53*, Nat Sciver-Brunt 45*, Yastika Bhatia 42) Published on By Sri Lanka’s hopes of playing the World Test Championship final later this year at The Oval during the British summer largely depended on Angelo Mathews and he didn’t disappoint posting his 14th Test hundred enabling Sri Lanka to set the Kiwis a challenging target. Play gets underway in Christchurch at 3:30 am Sri Lanka time as New Zealand is seven and half hours ahead and most Sri Lankan fans who switched on their televisions at 6am yesterday after late nights on Saturday expected Sri Lanka to have collapsed as they had done time and again in recent years. But instead they found a fight back with Mathews leading the way. It was that kind of a wicket as a batter never looked comfortable against seamers and it helped that the Kiwis were without Neil Wagner, ruled out with a hamstring injury. Matt Henry wasn’t firing on all cylinders either having needed three stitches in the webbing between his thumb and index finger but that’s not to say that run making was a walk in the park. Where this Test and the series was heading depended on Mathews. He ended up giving Sri Lanka a very good chance to win the game. Mathews while posting 115 shared a 105 run stand with Dinesh Chandimal (42) and a further 60 runs with Dhananjaya de Silva (47 not out). Under pressure to save his place, Niroshan Dickwella didn’t do himself any favours as he was caught behind for a duck. It was a good ball but patience is running thin given Dickwella’s poor numbers and captain Dimuth Karunaratne who’s backed him to the hilt will have to do lot so convincing with the selectors to stop him being axed for the second Test. The day belonged to Mathews as he showcased his ability to build an innings and put Sri Lanka in a formidable position. At stumps on day four, the Kiwis were 28 for one chasing 285 to win. Devon Conway was dismissed early by Kasun Rajitha and all three quicks bowled impeccable lines and will have to do more of that as New Zealand begin day five needing 257 runs. Kane Williamson will be the key for New Zealand and Sri Lanka need to knock him off early if they are to pull off a win. Sri Lanka dominated the first two days of the Test but defensive field settings helped the Kiwis to stage a comeback and even end up with a first innings lead. Published on By Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel blasted five fours and four sixes in a blazing 79 to hand India a first-innings lead of 91 after posting 50-plus partnerships for each of the first six wickets of the innings. It could have been more but Shreyas Iyer was unable to bat or take the field on day four due to lower back pain. He left the venue early in the day to have scans. Australia suffered an injury of their own on a day where their bowlers’ figures were badly bruised as they failed to make inroads, or even create chances, on an unhelpful surface. Usman Khawaja hurt his left leg while attempting to take a catch on the rope just after drinks in the middle session. He landed awkwardly and limped from the field shortly after with Australia’s team physio. Details of his injury were not confirmed but he did not return and did not bat late in the day with Matt Kuhnemann opening as a nightwatcher. Khawaja has suffered a torn ACL and torn meniscus in his left knee in the past having had surgery to repair both tears. Kuhnemann and Travis Head survived six overs for three runs as Australia remains 88 runs behind with three sessions of cricket remaining to either salvage a draw or somehow manufacture a result to level the series 2-2.Kohli, and it seems most of India, had been waiting the agonizing 1205 days for his 28th Test century. But he was willing to wait as long as was necessary to reach three figures against some disciplined Australian bowling in the first two hours of the day. He was near faultless in reaching his 75th international century just after lunch. It was the second slowest of his Test career, off 241 deliveries, and featured just five boundaries in his first 100 runs and none in the first session of the morning. The discipline and patience he showed was rewarded handsomely thereafter, as the burden of the three-year wait washed away and the dominant Kohli of old returned. He tore into Australia’s two fast men Cameron Green and Mitchell Starc during attempted hostile spells with the reversing ball. He also became ever more expansive and extravagant against the two offspinners Nathan Lyon and Todd Murphy, who he treated with the utmost respect in the first session. He got wonderful support all the way through the day. His 168-run partnership with Axar was the fruit of his morning labour. The pair scored with incredible freedom compared to the grind pre-lunch. Australia’s bowlers flagged in the afternoon sun. Kohli struck 10 classy boundaries in the afternoon unfurling some sublime drives on the up and some supreme pull shots off Lyon in particular, trusting the Ahmedabad bounce with cross-bat shots having fallen foul to them previously in the series on less trustful surfaces. While Kohli got into line and prospered mostly through the leg side, Axar gave room to carve through the off. But he did mix in four brutal slog sweeps, three that landed in the stands and one that bounced into the fence at warp speed. Axar did have some luck against Lyon, edging him to slip where Smith couldn’t hang onto an incredibly difficult one-handed chance high to his right. There were some other nervous moments defending Lyon but otherwise, it was smooth sailing. The pair looked nailed on for a double-century stand and twin milestones with Kohli’s 200 and Axar’s maiden Test century in sight. But Axar fell by the sword, chopping Mitchell Starc onto the stumps trying to flay him on the up through cover. Kohli ran out of partners as R Ashwin holed out in the deep and Umesh Yadav was run out by a brilliant direct hit from the deep from Peter Handscomb for a diamond duck trying to keep Kohli on strike.Kohli was dropped himself by Handscomb in the deep off Lyon on 185, a difficult chance diving low at long-on. It only cost one run as he holed out swinging for the fence next over. Earlier, Kohli also shared half-century stands with Ravindra Jadeja and KS Bharat in the morning but India only managed 73 runs in the first session. Lyon and Murphy bowled superbly to keep a lid on the scoring, with Kohli really battling to break free from very disciplined lines and lengths although he was never threatened in defence. Jadeja eventually did smacking Murphy down the ground, but he holed out meekly to mid-on not long after. Bharat slog-swept his second ball for six over wide long-on but battled to 25 from 70 at lunch. However, he hit the accelerator after lunch when Cameron Green tried to pepper him with short balls under instruction from his captain Steven Smith with a heavy legside field. After ducking a full over of short balls, he unfurled two pulls for a six and a cut for four in the following over. Lyon knocked him over shortly after with turn and bounce. It was one of only three wickets he took for the innings across a marathon 65 overs. It is the most he has ever bowled in a Test innings and he deserved better reward than he got. Murphy also took three wickets from 45.5. They were Australia’s best two bowlers by far as indicated by their workloads. Smith did not have as much faith in the other three with the two quicks lathered to all parts while Kuhnemann was nowhere near as effective on this surface as he had been in Indore.","pubDate":"2023-03-13 00:21:51","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Kohli 186, Axar 79 give India a chance to push for a win","link":"http://island.lk/kohli-186-axar-79-give-india-a-chance-to-push-for-a-win/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel […]","content":"Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel blasted five fours and four sixes in a blazing 79 to hand India a first-innings lead of 91 after posting 50-plus partnerships for each of the first six wickets of the innings. It could have been more but Shreyas Iyer was unable to bat or take the field on day four due to lower back pain. He left the venue early in the day to have scans. Australia suffered an injury of their own on a day where their bowlers’ figures were badly bruised as they failed to make inroads, or even create chances, on an unhelpful surface. Usman Khawaja hurt his left leg while attempting to take a catch on the rope just after drinks in the middle session. He landed awkwardly and limped from the field shortly after with Australia’s team physio. Details of his injury were not confirmed but he did not return and did not bat late in the day with Matt Kuhnemann opening as a nightwatcher. Khawaja has suffered a torn ACL and torn meniscus in his left knee in the past having had surgery to repair both tears. Kuhnemann and Travis Head survived six overs for three runs as Australia remains 88 runs behind with three sessions of cricket remaining to either salvage a draw or somehow manufacture a result to level the series 2-2.Kohli, and it seems most of India, had been waiting the agonizing 1205 days for his 28th Test century. But he was willing to wait as long as was necessary to reach three figures against some disciplined Australian bowling in the first two hours of the day. He was near faultless in reaching his 75th international century just after lunch. It was the second slowest of his Test career, off 241 deliveries, and featured just five boundaries in his first 100 runs and none in the first session of the morning. The discipline and patience he showed was rewarded handsomely thereafter, as the burden of the three-year wait washed away and the dominant Kohli of old returned. He tore into Australia’s two fast men Cameron Green and Mitchell Starc during attempted hostile spells with the reversing ball. He also became ever more expansive and extravagant against the two offspinners Nathan Lyon and Todd Murphy, who he treated with the utmost respect in the first session. He got wonderful support all the way through the day. His 168-run partnership with Axar was the fruit of his morning labour. The pair scored with incredible freedom compared to the grind pre-lunch. Australia’s bowlers flagged in the afternoon sun. Kohli struck 10 classy boundaries in the afternoon unfurling some sublime drives on the up and some supreme pull shots off Lyon in particular, trusting the Ahmedabad bounce with cross-bat shots having fallen foul to them previously in the series on less trustful surfaces. While Kohli got into line and prospered mostly through the leg side, Axar gave room to carve through the off. But he did mix in four brutal slog sweeps, three that landed in the stands and one that bounced into the fence at warp speed. Axar did have some luck against Lyon, edging him to slip where Smith couldn’t hang onto an incredibly difficult one-handed chance high to his right. There were some other nervous moments defending Lyon but otherwise, it was smooth sailing. The pair looked nailed on for a double-century stand and twin milestones with Kohli’s 200 and Axar’s maiden Test century in sight. But Axar fell by the sword, chopping Mitchell Starc onto the stumps trying to flay him on the up through cover. Kohli ran out of partners as R Ashwin holed out in the deep and Umesh Yadav was run out by a brilliant direct hit from the deep from Peter Handscomb for a diamond duck trying to keep Kohli on strike.Kohli was dropped himself by Handscomb in the deep off Lyon on 185, a difficult chance diving low at long-on. It only cost one run as he holed out swinging for the fence next over. Earlier, Kohli also shared half-century stands with Ravindra Jadeja and KS Bharat in the morning but India only managed 73 runs in the first session. Lyon and Murphy bowled superbly to keep a lid on the scoring, with Kohli really battling to break free from very disciplined lines and lengths although he was never threatened in defence. Jadeja eventually did smacking Murphy down the ground, but he holed out meekly to mid-on not long after. Bharat slog-swept his second ball for six over wide long-on but battled to 25 from 70 at lunch. However, he hit the accelerator after lunch when Cameron Green tried to pepper him with short balls under instruction from his captain Steven Smith with a heavy legside field. After ducking a full over of short balls, he unfurled two pulls for a six and a cut for four in the following over. Lyon knocked him over shortly after with turn and bounce. It was one of only three wickets he took for the innings across a marathon 65 overs. It is the most he has ever bowled in a Test innings and he deserved better reward than he got. Murphy also took three wickets from 45.5. They were Australia’s best two bowlers by far as indicated by their workloads. Smith did not have as much faith in the other three with the two quicks lathered to all parts while Kuhnemann was nowhere near as effective on this surface as he had been in Indore. Published on By A dominant half-century from Harmanpreet Kaur, coupled with impressive performances with the bat from Yastika Bhatia and Nat Sciver-Brunt helped Mumbai Indians register their fourth straight win in the inaugural Women’s Premier League. Half-centuries from Alyssa Healy and Tahlia McGrath appeared to be enough initially to inflict the first loss for MI in their campaign but the table-toppers eventually cruised to victory in pursuit of 160 with 15 balls to spare following a century stand. Brief scores: UP Warriorz 159/6 in 20 overs (Alyssa Healy 58, Tahlia McGrath 50; Saika Ishaque 3/33) Mumbai Indians Women 164/2 in 17.3 overs (Harmanpreet Kaur 53*, Nat Sciver-Brunt 45*, Yastika Bhatia 42) Published on By Sri Lanka’s hopes of playing the World Test Championship final later this year at The Oval during the British summer largely depended on Angelo Mathews and he didn’t disappoint posting his 14th Test hundred enabling Sri Lanka to set the Kiwis a challenging target. Play gets underway in Christchurch at 3:30 am Sri Lanka time as New Zealand is seven and half hours ahead and most Sri Lankan fans who switched on their televisions at 6am yesterday after late nights on Saturday expected Sri Lanka to have collapsed as they had done time and again in recent years. But instead they found a fight back with Mathews leading the way. It was that kind of a wicket as a batter never looked comfortable against seamers and it helped that the Kiwis were without Neil Wagner, ruled out with a hamstring injury. Matt Henry wasn’t firing on all cylinders either having needed three stitches in the webbing between his thumb and index finger but that’s not to say that run making was a walk in the park. Where this Test and the series was heading depended on Mathews. He ended up giving Sri Lanka a very good chance to win the game. Mathews while posting 115 shared a 105 run stand with Dinesh Chandimal (42) and a further 60 runs with Dhananjaya de Silva (47 not out). Under pressure to save his place, Niroshan Dickwella didn’t do himself any favours as he was caught behind for a duck. It was a good ball but patience is running thin given Dickwella’s poor numbers and captain Dimuth Karunaratne who’s backed him to the hilt will have to do lot so convincing with the selectors to stop him being axed for the second Test. The day belonged to Mathews as he showcased his ability to build an innings and put Sri Lanka in a formidable position. At stumps on day four, the Kiwis were 28 for one chasing 285 to win. Devon Conway was dismissed early by Kasun Rajitha and all three quicks bowled impeccable lines and will have to do more of that as New Zealand begin day five needing 257 runs. Kane Williamson will be the key for New Zealand and Sri Lanka need to knock him off early if they are to pull off a win. Sri Lanka dominated the first two days of the Test but defensive field settings helped the Kiwis to stage a comeback and even end up with a first innings lead. Published on By After Angelo Mathews led Sri Lanka’s fight and recovery with his 14th Test century, Matt Henry struck thrice in quick succession in the final session to keep the Christchurch Test on a knife’s edge. Henry removed Niroshan Dickwella and Kasun Rajitha in the space of six overs as Sri Lanka went from 200 for 5 to 302 allout, setting New Zealand a target of 285. The home side lost Devon Conway early, and went to stumps at 28 for 1. Brief Scores : 355 & 302 (Angelo Mathews 115, Blair Tickner 4-100, Matt Henry 3-71) 373 & 28/1 (Kasun Rajitha 1-5)","pubDate":"2023-03-12 23:40:24","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"अजब-गजब ! रेहान अहमद ने फिर से रचा इतिहास, अब T20I में इंग्लैंड के लिए डेब्यू कर किया ऐतिहासिक कमाल","link":"https://sports.ndtv.com/hindi/cricket/bangladesh-vs-england-2nd-t20-rehan-ahmed-makes-his-t20-debut-this-morning-and-is-now-england-mens-youngest-ever-in-all-3-formats-still-aged-18-3854063#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs England T20I: इंग्लैंड के युवा स्पिनर रेहान अहमद (Rehan Ahmed) ने एक बार फिर इंग्लैंड के लिए इतिहास रच दिया है.","content":"अब टी-20 इंटरनेशनल में रेहान अहमद ने रचा इतिहास Bangladesh vs England T20I: इंग्लैंड के युवा स्पिनर एक बार फिर इंग्लैंड के लिए इतिहास रच दिया है. बता दें कि बांग्लादेश के खिलाफ दूसरे टी-20 मैच में उन्हें डेब्यू करने का मौका मिला है. रेहान को जोस बटलर ने डेब्यू कैप देकर उनका टी-20 इंटरनेशनल टीम में स्वागत किया. बता दें कि रेहान अब इंग्लैंड की ओर से सबसे कम उम्र में इंग्लैंड के लिए टी-20 इंटरनेशनल मैच खेलने वाले खिलाड़ी बन गए हैं. ✅ Test ✅ ODI ✅ T20 Rehan Ahmed makes his T20 debut this morning and is now England Men's youngest ever in all 3 formats still aged 18 🤯 बता दें कि वो इंग्लैंड के पहले ऐसे खिलाड़ी हैं जो वनडे, टेस्ट और टी-20 में डेब्यू करने वाले सबसे युवा खिलाड़ी हैं. इससे पहले रेहान ने टेस्ट क्रिकेट में इंग्लैंड के लिए सबसे कम उम्र में डेब्यू किया था. वही, बांग्लादेश के खिलाफ वनडे सीरीज के दौरान रेहान वनडे में डेब्यू करने वाले इंग्लैंड के सबसे युवा खिलाड़ी बने थे. अब टी-20 सीरीज के दूसरे मैच में डेब्यू कर रेहान ने अनोखा कमाल अपने करियर में डेब्यू के साथ ही कर दिया है. 🏏 We've lost the toss and are batting first! And… becomes the youngest ever England men's T20 player! 🏴󠁧󠁢󠁥󠁮󠁧󠁿 Congratulations, Rehan - go and smash it 👏 🤝 # टेस्ट में रेहान ने 18 साल और 126 दिन की उम्र में इंग्लैंड के लिए टेस्ट डेब्यू किया था. # वनडे में 18 साल और 205 दिन की उम्र में वनडे में डेब्यू किया था. # रेहान 18 साल और 211 दिन की उम्र में T20I में इंग्लैंड के लिए डेब्यू करने में सफल रहे हैं. बता दें कि रेहान अहमद का जन्म 13 अगस्त 2004 को हुआ था. उन्होंने 17 दिसंबर 2022 को पाकिस्तान के खिलाफ टेस्ट खेलकर इंटरनेशनल क्रिकेट में डेब्यू किया करने में सफल रहे थे. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 19:56:10","image_url":"https://c.ndtvimg.com/2023-03/nufjtij8_rehan-ahmed_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: अक्षर पटेल ने विराट को लेकर कह दी बड़ी बात, स्पिन के खिलाफ रणनीति को लेकर भी किया खुलासा","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-akshar-patel-said-a-big-thing-about-virat-also-revealed-about-the-strategy-against-spin-axar-patel-2nd-highest-scorer-in-bgt-2023-3854876#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 4th Test: बॉर्डर-गावस्कर श्रृंखला (Axar Patel Half Century) में अक्षर अब तक भारत के दूसरे सर्वोच्च स्कोरर रहे. उन्होंने श्रृंखला में तीन अर्धशतकीय पारियों के साथ कुल 264 रन बनाये.","content":"Axar Patel हरफनमौला अक्षर पटेल (Axar Patel) ने ऑस्ट्रेलिया के खिलाफ चौथे टेस्ट मैच के चौथे दिन शनिवार को अर्धशतकीय पारी खेलकर भारत को मजबूत स्थिति में पहुंचाने के बाद कहा कि इस श्रृंखला के लिए स्पिनरों के खिलाफ योजना बनाकर बल्लेबाजी करना उनके लिए कारगर रहा. बॉर्डर-गावस्कर श्रृंखला (Axar Patel Half Century) में अक्षर अब तक भारत के दूसरे सर्वोच्च स्कोरर रहे. उन्होंने श्रृंखला में तीन अर्धशतकीय पारियों के साथ कुल 264 रन बनाये. उन्होंने नागपुर में 84, दिल्ली में 74 और मौजूदा मैच में 79 रन की पारी खेली. वह इस दौरान अपने पहले टेस्ट शतक के सपने को पूरा नहीं कर सके लेकिन इन तीनों मैचों में उन्होंने शानदार साझेदारियां बनाकर टीम की जीत की नींव रखी. A pat from Virat Kohli on Axar Patel's shoulder when he got out - Kohli appreciating Axar's brilliant innings. अक्षर ने शनिवार को संवाददाता सम्मेलन में कहा, ‘‘ जब हमने नागपुर में शिविर शुरू किया था तो हमें पता था कि हम स्पिन गेंदबाजों के लिए मददगार पिच पर खेलेंगे. मैंने ज्यादा तैयारी नहीं की थी लेकिन स्पिनरों के खिलाफ बल्लेबाजी की बारीकियों पर काम किया. मैंने पगबाधा होने से बचने के लिए लेग स्टंप के बाहर से बल्लेबाजी करने के साथ क्रीज से ज्यादा बाहर नहीं निकलने का फैसला किया था. स्पिन गेंदबाजों के लिए मददगार पिच पर आपके पगबाधा या स्टंप होने की संभावना अधिक होती है.'' अक्षर से पूछा गया कि क्या उन्हें लगता है कि उन्होंने शतक पूरा करने का तीन मौका गंवा दिया. उन्होंने हंसते हुए कहा, ‘‘ आप जले पर नमक झिड़क रहे है. मैं जिस तरह से बल्लेबाजी कर रहा था और मैं जानता हूं कि मैंने जो मौके गंवाए वे बार-बार नहीं आते. इन पारियों को बड़े स्कोर में बदलना चाहिये था.'' भारतीय टीम अब अपना अगला टेस्ट संभवत: विश्व टेस्ट चैम्पियनशिप (डब्ल्यूटीसी) के फाइनल में ऑस्ट्रेलिया के खिलाफ ओवल (लंदन) में खेलेगी. इंग्लैंड की परिस्थितियों में भारतीय टीम शायद एक स्पिनर के साथ उतरे और वह रविन्द्र जडेजा हो सकते है. Axar Patel appreciation tweet Man missed the century for the third time in this series but all knocks were game changer. अक्षर ने कहा, ‘‘ अंतिम एकादश (डब्ल्यूटीसी फाइनल के लिए) में जगह हासिल करना मेरे हाथ में नहीं है और मैं इस बारे में कुछ नहीं कर सकता. मुझे जो मौके मिल रहे हैं मैं उसमें प्रदर्शन कर रहा हूं और जो मेरे हाथ में है उस पर ध्यान लगा रहा हूं. कोच और कप्तान अंतिम एकादश तय करते हैं और मेरा काम लगातार अच्छा प्रदर्शन करना और एकादश में जगह बनाना है.'' शनिवार की अर्धशतकीय पारी के बारे में अक्षर ने कहा कि टीम की ओर से उन्हें कोई विशेष संदेश नहीं मिला था और सिर्फ सकारात्मक बल्लेबाजी करने के लिए कहा गया था. उन्होंने कहा, ‘‘ जब मैं विराट भाई (कोहली) के साथ बल्लेबाजी कर रहा था तो टीम की तरफ से कोई खास संदेश नहीं था. विराट भाई ने मुझसे कहा कि मैं अपनी तरह सकारात्मक होकर खेलना जारी रखूं. जब हमने क्रीज पर समय बिता लिया तब गेंदबाजों को पिच से भी ज्यादा मदद नहीं मिल रही थी.'' उन्होंने कहा, ‘‘ मेरा अर्धशतक पूरा होने के बाद विराट भाई भी कह रहे थे कि मैं बड़ा स्कोर करने की सोच सकता हूं क्योंकि दिन के खेल में 22 ओवर बाकी थे. उस समय तक पारी घोषित करने की कोई योजना नहीं थी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:54:38","image_url":"https://c.ndtvimg.com/2023-03/u7rp65po_axar-patel_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WC 2023: क्या सच में ऐसा होगा? ODI क्रिकेट को लेकर रवि शास्त्री के बयान ने क्रिकेट जगत को चौकाया","link":"https://sports.ndtv.com/hindi/cricket/odi-wc-2023-will-it-really-happen-ravi-shastris-statement-regarding-odi-cricket-shocked-the-cricket-world-dinesh-karthik-on-odi-format-3855069#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ODI WC 2023: कपिल देव की अगुआई वाली भारतीय टीम ने 1983 में वनडे विश्व कप जीता (WC 1983) था तो यह 60-60 ओवर (60 Overs Match ODI WC 1983) का टूर्नामेंट हुआ करता था.","content":"Ravi Shastri भारत में होने वाले वनडे विश्व कप में सात महीने से भी कम समय रह गया है और देश की क्रिकेट टीम के पूर्व मुख्य कोच रवि शास्त्री (Ravi Shastri on One Day World Cup) का मानना है कि इस टूर्नामेंट को नयापन देने के लिये आईसीसी टूर्नामेंट के भविष्य के चरणों को 40-40 ओवर का कर देना चाहिए. भारत और आस्ट्रेलिया के बीच चौथे टेस्ट के चौथे दिन रविवार को पूर्व भारतीय कप्तान ने कहा, ‘‘वनडे क्रिकेट को बचे रहने के लिए इसे भविष्य में घटाकर 40-40 ओवर (Ravi Shastri on 40 Overs Odi Match) का कर देना चाहिए. '' शास्त्री ने कहा कि वनडे में दर्शकों की घटती संख्या का निवारण किया जाना चाहिए और उन्होंने कहा कि जब कपिल देव की अगुआई वाली भारतीय टीम ने 1983 में वनडे विश्व कप जीता था तो यह 60-60 ओवर (60 Overs Match Odi WC 1983) का टूर्नामेंट हुआ करता था लेकिन बाद में इसे घटाकर 50-50 ओवर का कर दिया गया. उन्होंने कहा, ‘‘मैं यह इसलिये कह रहा हूं क्योंकि जब हमने 1983 में विश्व कप (1983 Odi WC) जीता था तो यह 60 ओवर का मैच हुआ करता था. फिर लोगों का आकर्षण इसके प्रति कम होता गया तो यह 50 ओवर का बन गया. मुझे लगता है कि अब समय आ गया है जब इसे 40-40 ओवर का कर देना चाहिए। समय के साथ बदलना जरूरी है, प्रारूप को घटाना चाहिए. '' शास्त्री (Ravi Shastri on Odi Cricket Future) की दर्शकों की दिलचस्पी कम होने की बात सही है लेकिन जब 1987 में विश्व कप उप महाद्वीप में कराया गया था तो 120 ओवर के दौरान दो ब्रेक (लंच और चाय) करना संभव नहीं था जैसा कि इंग्लैंड में पिछले तीन चरण के दौरान हुआ था. शास्त्री ने कहा कि टी20 प्रारूप खेल में बड़ी कमाई करता रहेगा, लेकिन वह द्विपक्षीय टी20 अंतरराष्ट्रीय श्रृंखला को पसंद नहीं करते और उनका कहना है कि इन्हें कम कर देना चाहिए. यह महान क्रिकेटर द्विपक्षीय श्रृंखला को कम करने की वकालत करता रहा है. उन्होंने कहा, ‘‘मुझे लगता है कि टी20 प्रारूप महत्वपूर्ण है. इसे विकसित करने की जरूरत है, लेकिन मुझे लगता है कि द्विपक्षीय श्रृंखला को कम किया जाना चाहिए.'' पूर्व खिलाड़ी ने कहा कि टेस्ट क्रिकेट अपने शीर्ष अहम स्थान का लुत्फ उठाना जारी रखेगा क्योंकि यही महत्वपूर्ण प्रारूप है. उन्होंने कहा, ‘‘टेस्ट क्रिकेट हमेशा टेस्ट क्रिकेट बना रहेगा और इसे सबसे ज्यादा महत्व दिया जाना चाहिए. मुझे लगता है कि भारत में सभी प्रारूपों के लिए जगह है. विशेष रूप से उपमहाद्वीप में विशेष रूप से ऑस्ट्रेलिया जैसी जगहों पर. '' भारतीय क्रिकेटर दिनेश कार्तिक (Dinesh Karthik on Odi Cricket) ने भी कहा कि एकदिवसीय प्रारूप अपना आकर्षण खो रहा है और इस साल अक्टूबर-नवंबर में भारत में होने वाला विश्व कप आखिरी संस्करण हो सकता है. कार्तिक ने कहा, ‘‘वनडे प्रारूप ने अपना आकर्षण खो दिया है. हम इस साल के अंत में या उसके बाद एक और विश्व कप देख सकते हैं. लोग टेस्ट क्रिकेट देखना चाहते हैं, जो क्रिकेट का सही मायने में प्रारूप है और टी20 मनोरंजन के लिए है. '' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:54:18","image_url":"https://c.ndtvimg.com/2022-04/7htad1d_ravi-shastri_625x300_01_April_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: Virat Kohli के शतक पर ऐसा रिएक्शन, जिसने Asia Cup के जश्न की यादें ताज़ा कर दी","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-such-a-reaction-on-virats-century-which-brought-back-memories-of-asia-cup-celebrations-small-boy-celebration-on-virat-kohli-28th-test-centu-3855268#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS, Virat Kohli Test Century: अहमदाबाद के नरेंद्र मोदी स्टेडियम में एक बार फिर कुछ अलग तस्वीर नज़र आई वो भी तब जब विराट अपने शतक का जश्न मना रहे थे.","content":"Virat Kohli Century Celebration विराट कोहली ने ऑस्ट्रेलिया के खिलाफ शतकीय पारी खेली और अपने दोहरे शतक के बेहद करीब थें, लेकिन विराट चूक गए. आपको विराट कोहली का एशिया कप में लगाया गया वो शतक तो याद होगा क्योंकि विराट ने वनडे में शतक तब लगाया था जब शतक का इंतज़ार 3 साल पार कर चूका था. विराट के द्वारा एशिया कप (Virat Kohli Asia Cup Century) में लगाए गए. उस शतक के दौरान एक तस्वीर ने सबका दिल जीत लिया था, लेकिन आज अहमदाबाद के नरेंद्र मोदी स्टेडियम में एक बार फिर कुछ अलग तस्वीर नज़र आई वो भी तब जब विराट अपने शतक का जश्न मना रहे थे. Two completely different and opposite generations bowing down to Virat Kohli. Iconic. ❤️ एशिया कप के दौरान विराट के जश्न के उस वीडियो में एक बुजुर्ग क्रिकेट प्रशंसक विराट के शतक पर उनको शाबाशी देते हुए दोनों हाथों को ऊपर कर सर को झुकाते हुए देखे गए. आज फिर एक तस्वीर सोशल मीडिया पर तहलका मचा रही है, लेकिन तस्वीर में बुजुर्ग फैन की जगह एक नया क्रिकेट का भविष्य दिखाई दे रहा था. विराट के शतक लगाने के बाद एक छोटे बच्चे ने विराट के शतक पर ऐसा रिएक्शन दिया जिसने एशिया कप के जश्न की यादें ताज़ा कर दी. स्टेडियम में मौजूद लगभग 15 हजार लोगों के लिए रविवार का दिन यादगार रहा जब कोहली ने ऑफ स्पिनर नाथन लियोन की गेंद को मिड विकेट पर एक रन के लिए खेलकर नवंबर 2019 के बाद अपना पहला टेस्ट शतक पूरा किया.कोहली का यह टेस्ट क्रिकेट में 28वां और कुल 75वां अंतरराष्ट्रीय शतक है. उन्होंने 241 गेंद में शतक पूरा किया. कोहली ने कुल 364 गेंदों में 184 रनों की पारी खेली. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:53:55","image_url":"https://c.ndtvimg.com/2023-03/clak0qmo_virat-kohli-icc-806_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jos Buttler happy with batters at England’s disposal despite Bangladesh defeat","link":"https://www.standard.co.uk/sport/cricket/jos-buttler-england-bangladesh-b1066667.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Jos Buttler has no regrets about not drafting in more batting options after England's lack of runs came back to haunt them again as Bangladesh wrapped up a T20 series victory.","content":"has no regrets about not drafting in more batting options after 's lack of runs came back to haunt them again as wrapped up a T20 series victory. England decided against summoning replacements for injured duo Tom Abell and Will Jacks ahead of these three matches, leaving them with 13 players to choose from and a threadbare batting unit. Buttler highlighted the absences of several players including Alex Hales, Sam Billings and Liam Dawson, who were given special dispensation by England to prioritise the ongoing Pakistan Super League. England have been exposed in Chattogram and now in Dhaka, where they rejigged their top-order but slipped from 50 for one after six overs on a difficult pitch to 117 all out in a four-wicket defeat. But Buttler feels using Moeen Ali and Sam Curran higher up the order gives them a chance to acclimatise to conditions they might face when England defend their 50-over World Cup title in India this year. SPONSORED \"It's a different balance and a different feel to the team,\" said Buttler. \"We wanted to give exposure to guys especially who, in these conditions, will also probably play a part in the 50-over World Cup. \"It felt like a great chance to expose the all-rounders' batting, maybe one spot higher than in our normal team. \"The way cricket is at the moment, there's a few players who've opted not to be here anyway for various reasons, so it felt like instead of calling someone else up, try to use the guys who would be exposed to these conditions in the 50-over World Cup as well.\" Buttler has a phenomenal record as an opening batter in T20s, averaging 49.2 with a strike-rate of 152.22 in 44 matches, but elected to shift himself down to number four in the order on Sunday. That was down to numbers three to six in the series opener all being left-handed, so the right-hand, left-hand combination of Phil Salt and Dawid Malan opened and, when the latter fell, out strode Moeen. \"We've obviously got a bank of left-handers in our middle order, it was just an opportunity to change that up a little bit,\" said Buttler. \"Try to break up our right and left-handers. \"I'm very comfortable batting anywhere in the order, I've spent a hell of a lot of my career as a middle-order player as well. I just felt like it would be an opportunity to try something different. \"The opportunity for Mo to go in at number three, something he's done successfully for Chennai Super Kings (in the Indian Premier League). There's still some good strengths there as well.\" On the same ground where Mehidy Hasan Miraz collected 12 match wickets to inspire Bangladesh to a first Test win over England seven years ago, the off-spinner claimed four for 12 in four excellent overs. Buttler accepted England did not put enough on the board, despite an outstanding effort in the field, led by Jofra Archer, who took three for 13 which seemed to give his side a glimmer of hope. But with 13 needed off 12 balls, Chris Jordan, bowling the penultimate over and his first of the day, was dispatched for three fours in five deliveries as Bangladesh won with 1.1 overs to spare. \"We know the challenge here, you have to adapt and play well, and we're not miles off,\" added Buttler. \"I thought it was an outstanding bowling display from us to take it that deep and put pressure on Bangladesh to chase those runs. The extra 10 or 15 runs would have probably been crucial in that game.\" England will now look to avoid suffering a whitewash in their first T20 series since winning last year's World Cup although Mehidy is hoping to deepen the misery of the tourists. \"There might be some (England) players getting rest, so it's a good opportunity for us, and we are really proud of this moment,\" he said.","pubDate":"2023-03-12 18:40:50","image_url":"https://static.standard.co.uk/2023/03/12/18/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"विराट कोहली को दोहरे शतक से रोकने के लिए स्टीव स्मिथ ने चली थी ये चाल","link":"https://sports.ndtv.com/hindi/cricket/steve-smith-did-this-trick-to-stop-virat-kohli-from-double-century-3854590#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"सभी को उम्मीद थी कि विराट कोहली के बल्ले से दोहरा शतक देखने को मिलेगा. लेकिन वे मात्र 14 रन से दोहरा शतक लगाने से चूक गए. बता दें कि ऑस्ट्रेलियाई कप्तान ने एक ऐसी चाल चली जिसमें फंसकर कोहली अपने करियर का 8वां दोहरा शतक लगाने से चूक गए.","content":"विराट कोहली को दोहरे शतक से रोकने के लिए स्टीव स्मिथ ने चली थी ये चाल भारत और ऑस्ट्रेलिया के बीच अहमदाबाद में खेले जा रहे चौथे टेस्ट मैच में भारत की तरफ से कोहली ने 186 रन की विराट पारी खेली. जिसके चलते भारतीय टीम पहली पारी में 571 रन बनाने में कामयाब हुई और पहली पारी के आधार पर टीम इंडिया ने ऑस्ट्रेलिया पर 91 रनों की बढ़त भी ले ली. सभी को उम्मीद थी कि विराट कोहली के बल्ले से शतक के बाद दोहरा शतक भी देखने को मिलेगा. लेकिन वे मात्र 14 रन से दोहरा शतक लगाने से चूक गए. यहां पर आपको बता दें कि दोहरा शतक लगा सकते थे लेकिन ऑस्ट्रेलियाई कप्तान ने एक ऐसी चाल चली कि कोहली उसमें फंसकर अपने करियर का 8वां शतक लगाने से चूक गए. अब स्मिथ ने किंग कोहली को आउट करने के लिए ऐसी कौन-सी चाल चली कि वे इसे समझ नहीं पाए तो आइए आपको बताते हैं. बता दें कि विराट जब अपने करियर के 8वें दोहरे शतक से मात्र कुछ ही रनों की दूरी पर थे तब स्मिथ ने सभी 9 फील्डर्स को बाउंड्री लाइन पर तैनात कर दिया. फिल्ड पोजीशन की एक तस्वीर सामने आई है जिसमें साफ दिखाई दे रहा है कि कीपर व बॉलर को छोड़ दिया जाए तो ऑस्ट्रेलियन टीम के सभी फील्डर्स सीमा रेखा पर हैं. विराट भी स्मिथ के बिछाए इस जाल में फंस गए और बाउंड्री लाइन पर एक बड़ा शॉट लगाने के चलते 186 के स्कोर पर मार्नस लाबुशेन को कैच थमा बैठे और आउट हो गए, इसी के साथ भारत की पारी भी 571 के स्कोर पर सिमट गई. यानि कि आखिरकार स्मिथ ने विराट को अपने जाल में फंसा ही लिया. चौथे दिन का खेल समाप्त होने तक ऑस्ट्रेलिया ने दूसरी पारी में बिना कोई विकेट गंवाए 3 रन बना लिए हैं. Field for Virat Kohli - everyone at the boundary. विराट अपने करियर का 8वां दोहरा शतक लगाने से मात्र 14 रन से चूक गए. बता दें कि ये उनके टेस्ट करियर का ये 28वां शतक है. विराट के बल्ले से 1205 दिन, 23 मैचों और 41 पारियों के बाद शतकीय पारी देखने को मिली. पूर्व भारतीय कप्तान के आउट होते ही भारत की पहली पारी भी 571 के स्कोर पर खत्म हो गई. विराट कोहली के बल्ले से बड़ी पारी का इंतज़ार था और विराट ने भी अपने फैंस को खुश करने का कोई मौका नहीं छोड़ा. 186 रन की दमदार पारी खेलकर उन्होंने दर्शा दिया है कि उन्हें इस खेल का किंग यूंही नहीं कहा जाता. अंतर्राष्ट्रीय क्रिकेट में विराट के नाम कुल 75 शतक हो गए हैं. अब वे सचिन तेंदुलकर के 100 शतकों के रिकॉर्ड को तोड़ने से 26 शतकों की दूरी पर हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:35:48","image_url":"https://c.ndtvimg.com/2023-03/t95o7hno_virat-kohli-afp_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL में देखने को मिला DRS ब्लंडर! क्रिकेट इतिहास में पहली बार हुआ कुछ ऐसा, देखकर पकड़ लेंगे माथा","link":"https://sports.ndtv.com/hindi/cricket/drs-blunder-seen-in-wpl-something-like-this-happened-for-the-first-time-in-the-history-of-cricket-you-will-be-surprised-to-see-it-3855180#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विमेंस प्रीमियर लीग में मुंबई इंडियंस और यूपी वॉरियर्स के बीच मुकाबला खेला जा रहा है. जिसमें मुंबई इंडियंस की बल्लेबाज़ी के चौथे ही ओवर में DRS को लेकर बड़ा ब्लंडर देखने को मिला.","content":"WPL में देखने को मिला DRS ब्लंडर! विमेंस प्रीमियर लीग में मुंबई इंडियंस और यूपी वॉरियर्स के बीच मुकाबला खेला जा रहा है. मुंबई ने अब तक इस लीग में कोई भी मैच नहीं गवाया है. यूपी ने इस मैच में टॉस जीतकर पहले बल्लेबाज़ी करते हुए 159 रन बनाए. इसी बीच मुंबई इंडियंस की बल्लेबाज़ी के चौथे ही ओवर में DRS को लेकर बड़ा ब्लंडर देखने को मिला. जब चौथे ओवर की पांचवीं गेंद पर सोफी एक्लेस्टन ने फुलर लैंथ गेंद फेंकी और मैथ्यूज़ ने इस गेंद पर डिफेंस किया लेकिन यूपी वॉरियर्स ने LBW की अपील कर दी. अंपायर ने अपील को नकार दिया. लेकिन रिव्यू में दिखा कि गेंद मैथ्यूज़ के बल्ले के बीचों बीच लगी है. इसके बावजूद LBW चेक किया गया और हौरानी तो तब हुई जब मैथ्यूज़ को आउट दे दिया गया. लेकिन हेली फिर भी मैदान पर खड़ी रहीं. दोबारा से DRS चेक किया गया तो पता चला कि किसी दूसरी बॉल का DRS दिखाया जा रहा था. अब अंपायर को अपना फैसला बदलना पड़ा और मैथ्यूज़ को नॉटआउट दिया गया. इससे पहले हेली रनआउट होने से भी बचीं. वैसे क्रिकेट इतिहास में ये पहली बार हुआ है जब किसी DRS के फैसले को बदलने के लिए थर्ड अंपायर ने मैदानी अंपायर को रेफर किया फैसला और फिर ग्राउंड अंपायर ने फिर से DRS लिया. On field umpire - Not out. Review taken... Third - Out. taken again... Third umpire - Not out. Comedy of errors.😹 Director shows Reverse footage first after taking DRS in WPL match this shows ball hits Shoe first and given Heally Mathews OUT And Than shown actuall footage which shows ball hit bat first Is this the first time there has been a DRS for a DRS?? What's happening?? Is this the first time there has been a DRS for a DRS?? What's happening?? First time I see a DRS decision being reversed! Ever! Was first given out after DRS review, but the batters questioned it, umpires reverted back to off field umpire for 2nd review. Decision was reversed. WPL 2023 coming with innovation hey! * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:35:12","image_url":"https://c.ndtvimg.com/2023-03/0kd1825g_drs_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL: Top knocks from Harmanpreet, Nat Sciver help MI down UP Warriorz by eight wickets","link":"https://thenewsmill.com/2023/03/wpl-top-knocks-from-harmanpreet-nat-sciver-help-mi-down-up-warriorz-by-eight-wickets/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"An unbeaten half-century from skipper Harmanpreet Kaur and fiery knocks from Yastika Bhatia and Nat-Sciver Brunt helped Mumbai Indians clinch their fourth successive win in the Women’s Premier League (WPL), as they defeated UP Warriorz by eight wickets on Sunday. With this win, MI is at the top of the points table with four wins in four games and total of eight points. UP Warriorz is at the third position, with two wins in four matches, two losses and a total of four points. In chase of 160 runs, Mumbai Indians started really well. Openers Yastika Bhatia and Hayley Matthews gave the side start they needed. Matthews hit Rajeshwari Gayakwad for two fours in the first over. But after that, Yastika lit up the stadium with some clean hitting. The wicketkeeper-batter smashed Shabnim Ismail, the world’s fastest bowler in women’s cricket, for three straight overs in the sixth over, bringing up the 50-run opening stand in 5.3 overs. At the end of the powerplay, MI was at 51/0, with Yastika (36*) and Hayley (11*) unbeaten. After the powerplay, MI lost their openers. Yastika was dismissed by Rajeshwari for a quickfire 42 off 27 balls after being caught by Simran Shaikh at deep-midwicket. MI was 58/1 at that point. Soon, world’s number one T20I bowler Sophie Ecclestone caught and bowled a struggling Matthews for 12 off 17 balls. MI was 58/2 at that point. Following this, skipper Harmanpreet Kaur and Nat-Sciver Brunt was the fresh pair on the crease. At the end of their 10 overs, MI was 72/2, with Sciver-Brunt (4*) and skipper Harmanpreet (7*) unbeaten. Brunt and Harman started to build a partnership, with the English star as the aggressor. MI touched the 100-run mark in 13.1 overs. Harman and Sciver also brought up their 50-run stand in just 41 balls. Harmanpreet accelerated with three straight boundaries. At the end of 15 overs, MI was 123/2, with Harmanpreet (31*) and Nat-Sciver (28*) at the crease. They needed 37 runs in the final five overs. Tahlia McGrath was smashed for 19 runs in the 16th over, including a wide and three fours and a six by Harmanpreet. This brought down the deficit to 18 runs in final four overs. Kaur brought up her fifty in 32 balls, with nine fours and one six. MI was able to chase down the target easily and finished their innings at 164/2 in 17.3 overs. Harmanpreet scored an unbeaten 53 off 33 balls, while Nat-Sciver finished at 45* in 31 balls, consisting of six fours and a six. They had a hard-hitting stand of 106 runs in 61 balls. Sophie and Gayakwad took a wicket each for UP. Earlier, half-centuries from skipper Alyssa Healy and Tahlia McGrath powered UP Warriorz to a modest 159/6 at the end of their 20 overs against Mumbai Indians in their Women’s Premier League (WPL) match in Mumbai on Sunday. After electing to bat first, UP Warriorz was off to a bad start. Spinner Saika Ishaque, the Purple Cup holder in WPL 2023, rolled her golden arm to trap Devika Vaidya leg-before wicket for just six runs off five balls. UPW was reduced 8/1 in two overs. Alyssa Healy, the skipper, then started rebuilding the innings in the company of Kiran Navgire. Healy smashed Saika for three straight fours in the fourth over. At the end of the powerplay, UPW was at 48/1, with Healy (30*) and Kiran Navgire (7*) unbeaten. UPW crossed the 50-run mark in 6.2 overs thanks to a six from Navgire. After the powerplay, Navgire tried to up the ante by hitting Amelia Kerr for a four and six. But the bowler had the last laugh as she dismissed Navgire for 17 off 14 balls after she was caught by wicketkeeper Yastika Bhatia. UPW was 58/2 in 6.4 overs. Tahlia McGrath, the world’s number one T20I batter was next up on the crease. In the ninth over, Tahlia smashed Amelia for three boundaries. At the end of 10 overs, UPW was at 58/2, with McGrath (22*) and McGrath (33*) unbeaten at the crease. UPW reached the 100-run mark with help of a four from McGrath in 11.5 overs. he Australian duo brought up their 50-run stand as well. Healy brought up her half-century in just 36 balls, studded with seven fours and a six. At the end of 15 overs, UPW was at 133/2, with Healy (53*) and McGrath (48*) unbeaten at the crease. Saika ended the 82-run stand between Healy and McGrath in the 17th over. She dismissed Healy for 58 off 46 balls and followed it up with McGrath’s scalp for 50 off 37 balls. Her strikes reduced UPW to 141/4 in 16.5 overs. Half of the UPW batting line-up was inside the hut after Sophie Ecclestone was dismissed for just one run by Hayley Matthews. UPW was 146/5 in 18 overs. UPW crossed 150-run mark in 18.3 overs. UPW ended the innings at 159/6. Deepti Sharma was dismissed for just seven by Amelia on the third ball of the final over. Shweta Sehrawat (2*) and Simran Shaikh (9*) were unbeaten at the close of their innings. Saika was the pick of the bowlers for MI, with 3/33 in her four overs. Kerr took two wickets while Hayley got one. Brief Scores: UPW: 159/6 (Alyssa Healy 58, Tahlia McGrath 50, Saika Ishaque 3/33) vs MI. (ANI)","pubDate":"2023-03-12 18:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Mehidy, Najmul help Bangladesh seal T20I series against England","link":"http://island.lk/mehidy-najmul-help-bangladesh-seal-t20i-series-against-england/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"On a typical Dhaka surface aiding spinners, Bangladesh made all the right moves and held their nerves to secure an unassailable 2-0 series lead over England, the reigning T20 World Cup champions. Mehidy Hasan Miraz, who was brought in for this game, starred with figures of 4 for 12 and helped bowl out England for […]","content":"On a typical Dhaka surface aiding spinners, Bangladesh made all the right moves and held their nerves to secure an unassailable 2-0 series lead over England, the reigning T20 World Cup champions. Mehidy Hasan Miraz, who was brought in for this game, starred with figures of 4 for 12 and helped bowl out England for 117. Najmul Hossain Shanto then steered Bangladesh in a tricky run chase with a 46* and delivered the win with seven balls to spare. Brief Scores : 117 (Ben Duckett 28; Mehidy Hasan Miraz 4-12) 120/6 in 18.5 overs (Najmul Hossain Shanto 46*; Jofra Archer 3-13) Published on By A dominant half-century from Harmanpreet Kaur, coupled with impressive performances with the bat from Yastika Bhatia and Nat Sciver-Brunt helped Mumbai Indians register their fourth straight win in the inaugural Women’s Premier League. Half-centuries from Alyssa Healy and Tahlia McGrath appeared to be enough initially to inflict the first loss for MI in their campaign but the table-toppers eventually cruised to victory in pursuit of 160 with 15 balls to spare following a century stand. Brief scores: UP Warriorz 159/6 in 20 overs (Alyssa Healy 58, Tahlia McGrath 50; Saika Ishaque 3/33) Mumbai Indians Women 164/2 in 17.3 overs (Harmanpreet Kaur 53*, Nat Sciver-Brunt 45*, Yastika Bhatia 42) Published on By Sri Lanka’s hopes of playing the World Test Championship final later this year at The Oval during the British summer largely depended on Angelo Mathews and he didn’t disappoint posting his 14th Test hundred enabling Sri Lanka to set the Kiwis a challenging target. Play gets underway in Christchurch at 3:30 am Sri Lanka time as New Zealand is seven and half hours ahead and most Sri Lankan fans who switched on their televisions at 6am yesterday after late nights on Saturday expected Sri Lanka to have collapsed as they had done time and again in recent years. But instead they found a fight back with Mathews leading the way. It was that kind of a wicket as a batter never looked comfortable against seamers and it helped that the Kiwis were without Neil Wagner, ruled out with a hamstring injury. Matt Henry wasn’t firing on all cylinders either having needed three stitches in the webbing between his thumb and index finger but that’s not to say that run making was a walk in the park. Where this Test and the series was heading depended on Mathews. He ended up giving Sri Lanka a very good chance to win the game. Mathews while posting 115 shared a 105 run stand with Dinesh Chandimal (42) and a further 60 runs with Dhananjaya de Silva (47 not out). Under pressure to save his place, Niroshan Dickwella didn’t do himself any favours as he was caught behind for a duck. It was a good ball but patience is running thin given Dickwella’s poor numbers and captain Dimuth Karunaratne who’s backed him to the hilt will have to do lot so convincing with the selectors to stop him being axed for the second Test. The day belonged to Mathews as he showcased his ability to build an innings and put Sri Lanka in a formidable position. At stumps on day four, the Kiwis were 28 for one chasing 285 to win. Devon Conway was dismissed early by Kasun Rajitha and all three quicks bowled impeccable lines and will have to do more of that as New Zealand begin day five needing 257 runs. Kane Williamson will be the key for New Zealand and Sri Lanka need to knock him off early if they are to pull off a win. Sri Lanka dominated the first two days of the Test but defensive field settings helped the Kiwis to stage a comeback and even end up with a first innings lead. Published on By Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel blasted five fours and four sixes in a blazing 79 to hand India a first-innings lead of 91 after posting 50-plus partnerships for each of the first six wickets of the innings. It could have been more but Shreyas Iyer was unable to bat or take the field on day four due to lower back pain. He left the venue early in the day to have scans. Australia suffered an injury of their own on a day where their bowlers’ figures were badly bruised as they failed to make inroads, or even create chances, on an unhelpful surface. Usman Khawaja hurt his left leg while attempting to take a catch on the rope just after drinks in the middle session. He landed awkwardly and limped from the field shortly after with Australia’s team physio. Details of his injury were not confirmed but he did not return and did not bat late in the day with Matt Kuhnemann opening as a nightwatcher. Khawaja has suffered a torn ACL and torn meniscus in his left knee in the past having had surgery to repair both tears. Kuhnemann and Travis Head survived six overs for three runs as Australia remains 88 runs behind with three sessions of cricket remaining to either salvage a draw or somehow manufacture a result to level the series 2-2.Kohli, and it seems most of India, had been waiting the agonizing 1205 days for his 28th Test century. But he was willing to wait as long as was necessary to reach three figures against some disciplined Australian bowling in the first two hours of the day. He was near faultless in reaching his 75th international century just after lunch. It was the second slowest of his Test career, off 241 deliveries, and featured just five boundaries in his first 100 runs and none in the first session of the morning. The discipline and patience he showed was rewarded handsomely thereafter, as the burden of the three-year wait washed away and the dominant Kohli of old returned. He tore into Australia’s two fast men Cameron Green and Mitchell Starc during attempted hostile spells with the reversing ball. He also became ever more expansive and extravagant against the two offspinners Nathan Lyon and Todd Murphy, who he treated with the utmost respect in the first session. He got wonderful support all the way through the day. His 168-run partnership with Axar was the fruit of his morning labour. The pair scored with incredible freedom compared to the grind pre-lunch. Australia’s bowlers flagged in the afternoon sun. Kohli struck 10 classy boundaries in the afternoon unfurling some sublime drives on the up and some supreme pull shots off Lyon in particular, trusting the Ahmedabad bounce with cross-bat shots having fallen foul to them previously in the series on less trustful surfaces. While Kohli got into line and prospered mostly through the leg side, Axar gave room to carve through the off. But he did mix in four brutal slog sweeps, three that landed in the stands and one that bounced into the fence at warp speed. Axar did have some luck against Lyon, edging him to slip where Smith couldn’t hang onto an incredibly difficult one-handed chance high to his right. There were some other nervous moments defending Lyon but otherwise, it was smooth sailing. The pair looked nailed on for a double-century stand and twin milestones with Kohli’s 200 and Axar’s maiden Test century in sight. But Axar fell by the sword, chopping Mitchell Starc onto the stumps trying to flay him on the up through cover. Kohli ran out of partners as R Ashwin holed out in the deep and Umesh Yadav was run out by a brilliant direct hit from the deep from Peter Handscomb for a diamond duck trying to keep Kohli on strike.Kohli was dropped himself by Handscomb in the deep off Lyon on 185, a difficult chance diving low at long-on. It only cost one run as he holed out swinging for the fence next over. Earlier, Kohli also shared half-century stands with Ravindra Jadeja and KS Bharat in the morning but India only managed 73 runs in the first session. Lyon and Murphy bowled superbly to keep a lid on the scoring, with Kohli really battling to break free from very disciplined lines and lengths although he was never threatened in defence. Jadeja eventually did smacking Murphy down the ground, but he holed out meekly to mid-on not long after. Bharat slog-swept his second ball for six over wide long-on but battled to 25 from 70 at lunch. However, he hit the accelerator after lunch when Cameron Green tried to pepper him with short balls under instruction from his captain Steven Smith with a heavy legside field. After ducking a full over of short balls, he unfurled two pulls for a six and a cut for four in the following over. Lyon knocked him over shortly after with turn and bounce. It was one of only three wickets he took for the innings across a marathon 65 overs. It is the most he has ever bowled in a Test innings and he deserved better reward than he got. Murphy also took three wickets from 45.5. They were Australia’s best two bowlers by far as indicated by their workloads. Smith did not have as much faith in the other three with the two quicks lathered to all parts while Kuhnemann was nowhere near as effective on this surface as he had been in Indore.","pubDate":"2023-03-13 00:21:51","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Kohli 186, Axar 79 give India a chance to push for a win","link":"http://island.lk/kohli-186-axar-79-give-india-a-chance-to-push-for-a-win/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel […]","content":"Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel blasted five fours and four sixes in a blazing 79 to hand India a first-innings lead of 91 after posting 50-plus partnerships for each of the first six wickets of the innings. It could have been more but Shreyas Iyer was unable to bat or take the field on day four due to lower back pain. He left the venue early in the day to have scans. Australia suffered an injury of their own on a day where their bowlers’ figures were badly bruised as they failed to make inroads, or even create chances, on an unhelpful surface. Usman Khawaja hurt his left leg while attempting to take a catch on the rope just after drinks in the middle session. He landed awkwardly and limped from the field shortly after with Australia’s team physio. Details of his injury were not confirmed but he did not return and did not bat late in the day with Matt Kuhnemann opening as a nightwatcher. Khawaja has suffered a torn ACL and torn meniscus in his left knee in the past having had surgery to repair both tears. Kuhnemann and Travis Head survived six overs for three runs as Australia remains 88 runs behind with three sessions of cricket remaining to either salvage a draw or somehow manufacture a result to level the series 2-2.Kohli, and it seems most of India, had been waiting the agonizing 1205 days for his 28th Test century. But he was willing to wait as long as was necessary to reach three figures against some disciplined Australian bowling in the first two hours of the day. He was near faultless in reaching his 75th international century just after lunch. It was the second slowest of his Test career, off 241 deliveries, and featured just five boundaries in his first 100 runs and none in the first session of the morning. The discipline and patience he showed was rewarded handsomely thereafter, as the burden of the three-year wait washed away and the dominant Kohli of old returned. He tore into Australia’s two fast men Cameron Green and Mitchell Starc during attempted hostile spells with the reversing ball. He also became ever more expansive and extravagant against the two offspinners Nathan Lyon and Todd Murphy, who he treated with the utmost respect in the first session. He got wonderful support all the way through the day. His 168-run partnership with Axar was the fruit of his morning labour. The pair scored with incredible freedom compared to the grind pre-lunch. Australia’s bowlers flagged in the afternoon sun. Kohli struck 10 classy boundaries in the afternoon unfurling some sublime drives on the up and some supreme pull shots off Lyon in particular, trusting the Ahmedabad bounce with cross-bat shots having fallen foul to them previously in the series on less trustful surfaces. While Kohli got into line and prospered mostly through the leg side, Axar gave room to carve through the off. But he did mix in four brutal slog sweeps, three that landed in the stands and one that bounced into the fence at warp speed. Axar did have some luck against Lyon, edging him to slip where Smith couldn’t hang onto an incredibly difficult one-handed chance high to his right. There were some other nervous moments defending Lyon but otherwise, it was smooth sailing. The pair looked nailed on for a double-century stand and twin milestones with Kohli’s 200 and Axar’s maiden Test century in sight. But Axar fell by the sword, chopping Mitchell Starc onto the stumps trying to flay him on the up through cover. Kohli ran out of partners as R Ashwin holed out in the deep and Umesh Yadav was run out by a brilliant direct hit from the deep from Peter Handscomb for a diamond duck trying to keep Kohli on strike.Kohli was dropped himself by Handscomb in the deep off Lyon on 185, a difficult chance diving low at long-on. It only cost one run as he holed out swinging for the fence next over. Earlier, Kohli also shared half-century stands with Ravindra Jadeja and KS Bharat in the morning but India only managed 73 runs in the first session. Lyon and Murphy bowled superbly to keep a lid on the scoring, with Kohli really battling to break free from very disciplined lines and lengths although he was never threatened in defence. Jadeja eventually did smacking Murphy down the ground, but he holed out meekly to mid-on not long after. Bharat slog-swept his second ball for six over wide long-on but battled to 25 from 70 at lunch. However, he hit the accelerator after lunch when Cameron Green tried to pepper him with short balls under instruction from his captain Steven Smith with a heavy legside field. After ducking a full over of short balls, he unfurled two pulls for a six and a cut for four in the following over. Lyon knocked him over shortly after with turn and bounce. It was one of only three wickets he took for the innings across a marathon 65 overs. It is the most he has ever bowled in a Test innings and he deserved better reward than he got. Murphy also took three wickets from 45.5. They were Australia’s best two bowlers by far as indicated by their workloads. Smith did not have as much faith in the other three with the two quicks lathered to all parts while Kuhnemann was nowhere near as effective on this surface as he had been in Indore. Published on By A dominant half-century from Harmanpreet Kaur, coupled with impressive performances with the bat from Yastika Bhatia and Nat Sciver-Brunt helped Mumbai Indians register their fourth straight win in the inaugural Women’s Premier League. Half-centuries from Alyssa Healy and Tahlia McGrath appeared to be enough initially to inflict the first loss for MI in their campaign but the table-toppers eventually cruised to victory in pursuit of 160 with 15 balls to spare following a century stand. Brief scores: UP Warriorz 159/6 in 20 overs (Alyssa Healy 58, Tahlia McGrath 50; Saika Ishaque 3/33) Mumbai Indians Women 164/2 in 17.3 overs (Harmanpreet Kaur 53*, Nat Sciver-Brunt 45*, Yastika Bhatia 42) Published on By Sri Lanka’s hopes of playing the World Test Championship final later this year at The Oval during the British summer largely depended on Angelo Mathews and he didn’t disappoint posting his 14th Test hundred enabling Sri Lanka to set the Kiwis a challenging target. Play gets underway in Christchurch at 3:30 am Sri Lanka time as New Zealand is seven and half hours ahead and most Sri Lankan fans who switched on their televisions at 6am yesterday after late nights on Saturday expected Sri Lanka to have collapsed as they had done time and again in recent years. But instead they found a fight back with Mathews leading the way. It was that kind of a wicket as a batter never looked comfortable against seamers and it helped that the Kiwis were without Neil Wagner, ruled out with a hamstring injury. Matt Henry wasn’t firing on all cylinders either having needed three stitches in the webbing between his thumb and index finger but that’s not to say that run making was a walk in the park. Where this Test and the series was heading depended on Mathews. He ended up giving Sri Lanka a very good chance to win the game. Mathews while posting 115 shared a 105 run stand with Dinesh Chandimal (42) and a further 60 runs with Dhananjaya de Silva (47 not out). Under pressure to save his place, Niroshan Dickwella didn’t do himself any favours as he was caught behind for a duck. It was a good ball but patience is running thin given Dickwella’s poor numbers and captain Dimuth Karunaratne who’s backed him to the hilt will have to do lot so convincing with the selectors to stop him being axed for the second Test. The day belonged to Mathews as he showcased his ability to build an innings and put Sri Lanka in a formidable position. At stumps on day four, the Kiwis were 28 for one chasing 285 to win. Devon Conway was dismissed early by Kasun Rajitha and all three quicks bowled impeccable lines and will have to do more of that as New Zealand begin day five needing 257 runs. Kane Williamson will be the key for New Zealand and Sri Lanka need to knock him off early if they are to pull off a win. Sri Lanka dominated the first two days of the Test but defensive field settings helped the Kiwis to stage a comeback and even end up with a first innings lead. Published on By After Angelo Mathews led Sri Lanka’s fight and recovery with his 14th Test century, Matt Henry struck thrice in quick succession in the final session to keep the Christchurch Test on a knife’s edge. Henry removed Niroshan Dickwella and Kasun Rajitha in the space of six overs as Sri Lanka went from 200 for 5 to 302 allout, setting New Zealand a target of 285. The home side lost Devon Conway early, and went to stumps at 28 for 1. Brief Scores : 355 & 302 (Angelo Mathews 115, Blair Tickner 4-100, Matt Henry 3-71) 373 & 28/1 (Kasun Rajitha 1-5)","pubDate":"2023-03-12 23:40:24","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"अजब-गजब ! रेहान अहमद ने फिर से रचा इतिहास, अब T20I में इंग्लैंड के लिए डेब्यू कर किया ऐतिहासिक कमाल","link":"https://sports.ndtv.com/hindi/cricket/bangladesh-vs-england-2nd-t20-rehan-ahmed-makes-his-t20-debut-this-morning-and-is-now-england-mens-youngest-ever-in-all-3-formats-still-aged-18-3854063#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs England T20I: इंग्लैंड के युवा स्पिनर रेहान अहमद (Rehan Ahmed) ने एक बार फिर इंग्लैंड के लिए इतिहास रच दिया है.","content":"अब टी-20 इंटरनेशनल में रेहान अहमद ने रचा इतिहास Bangladesh vs England T20I: इंग्लैंड के युवा स्पिनर एक बार फिर इंग्लैंड के लिए इतिहास रच दिया है. बता दें कि बांग्लादेश के खिलाफ दूसरे टी-20 मैच में उन्हें डेब्यू करने का मौका मिला है. रेहान को जोस बटलर ने डेब्यू कैप देकर उनका टी-20 इंटरनेशनल टीम में स्वागत किया. बता दें कि रेहान अब इंग्लैंड की ओर से सबसे कम उम्र में इंग्लैंड के लिए टी-20 इंटरनेशनल मैच खेलने वाले खिलाड़ी बन गए हैं. ✅ Test ✅ ODI ✅ T20 Rehan Ahmed makes his T20 debut this morning and is now England Men's youngest ever in all 3 formats still aged 18 🤯 बता दें कि वो इंग्लैंड के पहले ऐसे खिलाड़ी हैं जो वनडे, टेस्ट और टी-20 में डेब्यू करने वाले सबसे युवा खिलाड़ी हैं. इससे पहले रेहान ने टेस्ट क्रिकेट में इंग्लैंड के लिए सबसे कम उम्र में डेब्यू किया था. वही, बांग्लादेश के खिलाफ वनडे सीरीज के दौरान रेहान वनडे में डेब्यू करने वाले इंग्लैंड के सबसे युवा खिलाड़ी बने थे. अब टी-20 सीरीज के दूसरे मैच में डेब्यू कर रेहान ने अनोखा कमाल अपने करियर में डेब्यू के साथ ही कर दिया है. 🏏 We've lost the toss and are batting first! And… becomes the youngest ever England men's T20 player! 🏴󠁧󠁢󠁥󠁮󠁧󠁿 Congratulations, Rehan - go and smash it 👏 🤝 # टेस्ट में रेहान ने 18 साल और 126 दिन की उम्र में इंग्लैंड के लिए टेस्ट डेब्यू किया था. # वनडे में 18 साल और 205 दिन की उम्र में वनडे में डेब्यू किया था. # रेहान 18 साल और 211 दिन की उम्र में T20I में इंग्लैंड के लिए डेब्यू करने में सफल रहे हैं. बता दें कि रेहान अहमद का जन्म 13 अगस्त 2004 को हुआ था. उन्होंने 17 दिसंबर 2022 को पाकिस्तान के खिलाफ टेस्ट खेलकर इंटरनेशनल क्रिकेट में डेब्यू किया करने में सफल रहे थे. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 19:56:10","image_url":"https://c.ndtvimg.com/2023-03/nufjtij8_rehan-ahmed_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: अक्षर पटेल ने विराट को लेकर कह दी बड़ी बात, स्पिन के खिलाफ रणनीति को लेकर भी किया खुलासा","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-akshar-patel-said-a-big-thing-about-virat-also-revealed-about-the-strategy-against-spin-axar-patel-2nd-highest-scorer-in-bgt-2023-3854876#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 4th Test: बॉर्डर-गावस्कर श्रृंखला (Axar Patel Half Century) में अक्षर अब तक भारत के दूसरे सर्वोच्च स्कोरर रहे. उन्होंने श्रृंखला में तीन अर्धशतकीय पारियों के साथ कुल 264 रन बनाये.","content":"Axar Patel हरफनमौला अक्षर पटेल (Axar Patel) ने ऑस्ट्रेलिया के खिलाफ चौथे टेस्ट मैच के चौथे दिन शनिवार को अर्धशतकीय पारी खेलकर भारत को मजबूत स्थिति में पहुंचाने के बाद कहा कि इस श्रृंखला के लिए स्पिनरों के खिलाफ योजना बनाकर बल्लेबाजी करना उनके लिए कारगर रहा. बॉर्डर-गावस्कर श्रृंखला (Axar Patel Half Century) में अक्षर अब तक भारत के दूसरे सर्वोच्च स्कोरर रहे. उन्होंने श्रृंखला में तीन अर्धशतकीय पारियों के साथ कुल 264 रन बनाये. उन्होंने नागपुर में 84, दिल्ली में 74 और मौजूदा मैच में 79 रन की पारी खेली. वह इस दौरान अपने पहले टेस्ट शतक के सपने को पूरा नहीं कर सके लेकिन इन तीनों मैचों में उन्होंने शानदार साझेदारियां बनाकर टीम की जीत की नींव रखी. A pat from Virat Kohli on Axar Patel's shoulder when he got out - Kohli appreciating Axar's brilliant innings. अक्षर ने शनिवार को संवाददाता सम्मेलन में कहा, ‘‘ जब हमने नागपुर में शिविर शुरू किया था तो हमें पता था कि हम स्पिन गेंदबाजों के लिए मददगार पिच पर खेलेंगे. मैंने ज्यादा तैयारी नहीं की थी लेकिन स्पिनरों के खिलाफ बल्लेबाजी की बारीकियों पर काम किया. मैंने पगबाधा होने से बचने के लिए लेग स्टंप के बाहर से बल्लेबाजी करने के साथ क्रीज से ज्यादा बाहर नहीं निकलने का फैसला किया था. स्पिन गेंदबाजों के लिए मददगार पिच पर आपके पगबाधा या स्टंप होने की संभावना अधिक होती है.'' अक्षर से पूछा गया कि क्या उन्हें लगता है कि उन्होंने शतक पूरा करने का तीन मौका गंवा दिया. उन्होंने हंसते हुए कहा, ‘‘ आप जले पर नमक झिड़क रहे है. मैं जिस तरह से बल्लेबाजी कर रहा था और मैं जानता हूं कि मैंने जो मौके गंवाए वे बार-बार नहीं आते. इन पारियों को बड़े स्कोर में बदलना चाहिये था.'' भारतीय टीम अब अपना अगला टेस्ट संभवत: विश्व टेस्ट चैम्पियनशिप (डब्ल्यूटीसी) के फाइनल में ऑस्ट्रेलिया के खिलाफ ओवल (लंदन) में खेलेगी. इंग्लैंड की परिस्थितियों में भारतीय टीम शायद एक स्पिनर के साथ उतरे और वह रविन्द्र जडेजा हो सकते है. Axar Patel appreciation tweet Man missed the century for the third time in this series but all knocks were game changer. अक्षर ने कहा, ‘‘ अंतिम एकादश (डब्ल्यूटीसी फाइनल के लिए) में जगह हासिल करना मेरे हाथ में नहीं है और मैं इस बारे में कुछ नहीं कर सकता. मुझे जो मौके मिल रहे हैं मैं उसमें प्रदर्शन कर रहा हूं और जो मेरे हाथ में है उस पर ध्यान लगा रहा हूं. कोच और कप्तान अंतिम एकादश तय करते हैं और मेरा काम लगातार अच्छा प्रदर्शन करना और एकादश में जगह बनाना है.'' शनिवार की अर्धशतकीय पारी के बारे में अक्षर ने कहा कि टीम की ओर से उन्हें कोई विशेष संदेश नहीं मिला था और सिर्फ सकारात्मक बल्लेबाजी करने के लिए कहा गया था. उन्होंने कहा, ‘‘ जब मैं विराट भाई (कोहली) के साथ बल्लेबाजी कर रहा था तो टीम की तरफ से कोई खास संदेश नहीं था. विराट भाई ने मुझसे कहा कि मैं अपनी तरह सकारात्मक होकर खेलना जारी रखूं. जब हमने क्रीज पर समय बिता लिया तब गेंदबाजों को पिच से भी ज्यादा मदद नहीं मिल रही थी.'' उन्होंने कहा, ‘‘ मेरा अर्धशतक पूरा होने के बाद विराट भाई भी कह रहे थे कि मैं बड़ा स्कोर करने की सोच सकता हूं क्योंकि दिन के खेल में 22 ओवर बाकी थे. उस समय तक पारी घोषित करने की कोई योजना नहीं थी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:54:38","image_url":"https://c.ndtvimg.com/2023-03/u7rp65po_axar-patel_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WC 2023: क्या सच में ऐसा होगा? ODI क्रिकेट को लेकर रवि शास्त्री के बयान ने क्रिकेट जगत को चौकाया","link":"https://sports.ndtv.com/hindi/cricket/odi-wc-2023-will-it-really-happen-ravi-shastris-statement-regarding-odi-cricket-shocked-the-cricket-world-dinesh-karthik-on-odi-format-3855069#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ODI WC 2023: कपिल देव की अगुआई वाली भारतीय टीम ने 1983 में वनडे विश्व कप जीता (WC 1983) था तो यह 60-60 ओवर (60 Overs Match ODI WC 1983) का टूर्नामेंट हुआ करता था.","content":"Ravi Shastri भारत में होने वाले वनडे विश्व कप में सात महीने से भी कम समय रह गया है और देश की क्रिकेट टीम के पूर्व मुख्य कोच रवि शास्त्री (Ravi Shastri on One Day World Cup) का मानना है कि इस टूर्नामेंट को नयापन देने के लिये आईसीसी टूर्नामेंट के भविष्य के चरणों को 40-40 ओवर का कर देना चाहिए. भारत और आस्ट्रेलिया के बीच चौथे टेस्ट के चौथे दिन रविवार को पूर्व भारतीय कप्तान ने कहा, ‘‘वनडे क्रिकेट को बचे रहने के लिए इसे भविष्य में घटाकर 40-40 ओवर (Ravi Shastri on 40 Overs Odi Match) का कर देना चाहिए. '' शास्त्री ने कहा कि वनडे में दर्शकों की घटती संख्या का निवारण किया जाना चाहिए और उन्होंने कहा कि जब कपिल देव की अगुआई वाली भारतीय टीम ने 1983 में वनडे विश्व कप जीता था तो यह 60-60 ओवर (60 Overs Match Odi WC 1983) का टूर्नामेंट हुआ करता था लेकिन बाद में इसे घटाकर 50-50 ओवर का कर दिया गया. उन्होंने कहा, ‘‘मैं यह इसलिये कह रहा हूं क्योंकि जब हमने 1983 में विश्व कप (1983 Odi WC) जीता था तो यह 60 ओवर का मैच हुआ करता था. फिर लोगों का आकर्षण इसके प्रति कम होता गया तो यह 50 ओवर का बन गया. मुझे लगता है कि अब समय आ गया है जब इसे 40-40 ओवर का कर देना चाहिए। समय के साथ बदलना जरूरी है, प्रारूप को घटाना चाहिए. '' शास्त्री (Ravi Shastri on Odi Cricket Future) की दर्शकों की दिलचस्पी कम होने की बात सही है लेकिन जब 1987 में विश्व कप उप महाद्वीप में कराया गया था तो 120 ओवर के दौरान दो ब्रेक (लंच और चाय) करना संभव नहीं था जैसा कि इंग्लैंड में पिछले तीन चरण के दौरान हुआ था. शास्त्री ने कहा कि टी20 प्रारूप खेल में बड़ी कमाई करता रहेगा, लेकिन वह द्विपक्षीय टी20 अंतरराष्ट्रीय श्रृंखला को पसंद नहीं करते और उनका कहना है कि इन्हें कम कर देना चाहिए. यह महान क्रिकेटर द्विपक्षीय श्रृंखला को कम करने की वकालत करता रहा है. उन्होंने कहा, ‘‘मुझे लगता है कि टी20 प्रारूप महत्वपूर्ण है. इसे विकसित करने की जरूरत है, लेकिन मुझे लगता है कि द्विपक्षीय श्रृंखला को कम किया जाना चाहिए.'' पूर्व खिलाड़ी ने कहा कि टेस्ट क्रिकेट अपने शीर्ष अहम स्थान का लुत्फ उठाना जारी रखेगा क्योंकि यही महत्वपूर्ण प्रारूप है. उन्होंने कहा, ‘‘टेस्ट क्रिकेट हमेशा टेस्ट क्रिकेट बना रहेगा और इसे सबसे ज्यादा महत्व दिया जाना चाहिए. मुझे लगता है कि भारत में सभी प्रारूपों के लिए जगह है. विशेष रूप से उपमहाद्वीप में विशेष रूप से ऑस्ट्रेलिया जैसी जगहों पर. '' भारतीय क्रिकेटर दिनेश कार्तिक (Dinesh Karthik on Odi Cricket) ने भी कहा कि एकदिवसीय प्रारूप अपना आकर्षण खो रहा है और इस साल अक्टूबर-नवंबर में भारत में होने वाला विश्व कप आखिरी संस्करण हो सकता है. कार्तिक ने कहा, ‘‘वनडे प्रारूप ने अपना आकर्षण खो दिया है. हम इस साल के अंत में या उसके बाद एक और विश्व कप देख सकते हैं. लोग टेस्ट क्रिकेट देखना चाहते हैं, जो क्रिकेट का सही मायने में प्रारूप है और टी20 मनोरंजन के लिए है. '' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:54:18","image_url":"https://c.ndtvimg.com/2022-04/7htad1d_ravi-shastri_625x300_01_April_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: Virat Kohli के शतक पर ऐसा रिएक्शन, जिसने Asia Cup के जश्न की यादें ताज़ा कर दी","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-such-a-reaction-on-virats-century-which-brought-back-memories-of-asia-cup-celebrations-small-boy-celebration-on-virat-kohli-28th-test-centu-3855268#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS, Virat Kohli Test Century: अहमदाबाद के नरेंद्र मोदी स्टेडियम में एक बार फिर कुछ अलग तस्वीर नज़र आई वो भी तब जब विराट अपने शतक का जश्न मना रहे थे.","content":"Virat Kohli Century Celebration विराट कोहली ने ऑस्ट्रेलिया के खिलाफ शतकीय पारी खेली और अपने दोहरे शतक के बेहद करीब थें, लेकिन विराट चूक गए. आपको विराट कोहली का एशिया कप में लगाया गया वो शतक तो याद होगा क्योंकि विराट ने वनडे में शतक तब लगाया था जब शतक का इंतज़ार 3 साल पार कर चूका था. विराट के द्वारा एशिया कप (Virat Kohli Asia Cup Century) में लगाए गए. उस शतक के दौरान एक तस्वीर ने सबका दिल जीत लिया था, लेकिन आज अहमदाबाद के नरेंद्र मोदी स्टेडियम में एक बार फिर कुछ अलग तस्वीर नज़र आई वो भी तब जब विराट अपने शतक का जश्न मना रहे थे. Two completely different and opposite generations bowing down to Virat Kohli. Iconic. ❤️ एशिया कप के दौरान विराट के जश्न के उस वीडियो में एक बुजुर्ग क्रिकेट प्रशंसक विराट के शतक पर उनको शाबाशी देते हुए दोनों हाथों को ऊपर कर सर को झुकाते हुए देखे गए. आज फिर एक तस्वीर सोशल मीडिया पर तहलका मचा रही है, लेकिन तस्वीर में बुजुर्ग फैन की जगह एक नया क्रिकेट का भविष्य दिखाई दे रहा था. विराट के शतक लगाने के बाद एक छोटे बच्चे ने विराट के शतक पर ऐसा रिएक्शन दिया जिसने एशिया कप के जश्न की यादें ताज़ा कर दी. स्टेडियम में मौजूद लगभग 15 हजार लोगों के लिए रविवार का दिन यादगार रहा जब कोहली ने ऑफ स्पिनर नाथन लियोन की गेंद को मिड विकेट पर एक रन के लिए खेलकर नवंबर 2019 के बाद अपना पहला टेस्ट शतक पूरा किया.कोहली का यह टेस्ट क्रिकेट में 28वां और कुल 75वां अंतरराष्ट्रीय शतक है. उन्होंने 241 गेंद में शतक पूरा किया. कोहली ने कुल 364 गेंदों में 184 रनों की पारी खेली. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:53:55","image_url":"https://c.ndtvimg.com/2023-03/clak0qmo_virat-kohli-icc-806_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jos Buttler happy with batters at England’s disposal despite Bangladesh defeat","link":"https://www.standard.co.uk/sport/cricket/jos-buttler-england-bangladesh-b1066667.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Jos Buttler has no regrets about not drafting in more batting options after England's lack of runs came back to haunt them again as Bangladesh wrapped up a T20 series victory.","content":"has no regrets about not drafting in more batting options after 's lack of runs came back to haunt them again as wrapped up a T20 series victory. England decided against summoning replacements for injured duo Tom Abell and Will Jacks ahead of these three matches, leaving them with 13 players to choose from and a threadbare batting unit. Buttler highlighted the absences of several players including Alex Hales, Sam Billings and Liam Dawson, who were given special dispensation by England to prioritise the ongoing Pakistan Super League. England have been exposed in Chattogram and now in Dhaka, where they rejigged their top-order but slipped from 50 for one after six overs on a difficult pitch to 117 all out in a four-wicket defeat. But Buttler feels using Moeen Ali and Sam Curran higher up the order gives them a chance to acclimatise to conditions they might face when England defend their 50-over World Cup title in India this year. SPONSORED \"It's a different balance and a different feel to the team,\" said Buttler. \"We wanted to give exposure to guys especially who, in these conditions, will also probably play a part in the 50-over World Cup. \"It felt like a great chance to expose the all-rounders' batting, maybe one spot higher than in our normal team. \"The way cricket is at the moment, there's a few players who've opted not to be here anyway for various reasons, so it felt like instead of calling someone else up, try to use the guys who would be exposed to these conditions in the 50-over World Cup as well.\" Buttler has a phenomenal record as an opening batter in T20s, averaging 49.2 with a strike-rate of 152.22 in 44 matches, but elected to shift himself down to number four in the order on Sunday. That was down to numbers three to six in the series opener all being left-handed, so the right-hand, left-hand combination of Phil Salt and Dawid Malan opened and, when the latter fell, out strode Moeen. \"We've obviously got a bank of left-handers in our middle order, it was just an opportunity to change that up a little bit,\" said Buttler. \"Try to break up our right and left-handers. \"I'm very comfortable batting anywhere in the order, I've spent a hell of a lot of my career as a middle-order player as well. I just felt like it would be an opportunity to try something different. \"The opportunity for Mo to go in at number three, something he's done successfully for Chennai Super Kings (in the Indian Premier League). There's still some good strengths there as well.\" On the same ground where Mehidy Hasan Miraz collected 12 match wickets to inspire Bangladesh to a first Test win over England seven years ago, the off-spinner claimed four for 12 in four excellent overs. Buttler accepted England did not put enough on the board, despite an outstanding effort in the field, led by Jofra Archer, who took three for 13 which seemed to give his side a glimmer of hope. But with 13 needed off 12 balls, Chris Jordan, bowling the penultimate over and his first of the day, was dispatched for three fours in five deliveries as Bangladesh won with 1.1 overs to spare. \"We know the challenge here, you have to adapt and play well, and we're not miles off,\" added Buttler. \"I thought it was an outstanding bowling display from us to take it that deep and put pressure on Bangladesh to chase those runs. The extra 10 or 15 runs would have probably been crucial in that game.\" England will now look to avoid suffering a whitewash in their first T20 series since winning last year's World Cup although Mehidy is hoping to deepen the misery of the tourists. \"There might be some (England) players getting rest, so it's a good opportunity for us, and we are really proud of this moment,\" he said.","pubDate":"2023-03-12 18:40:50","image_url":"https://static.standard.co.uk/2023/03/12/18/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"विराट कोहली को दोहरे शतक से रोकने के लिए स्टीव स्मिथ ने चली थी ये चाल","link":"https://sports.ndtv.com/hindi/cricket/steve-smith-did-this-trick-to-stop-virat-kohli-from-double-century-3854590#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"सभी को उम्मीद थी कि विराट कोहली के बल्ले से दोहरा शतक देखने को मिलेगा. लेकिन वे मात्र 14 रन से दोहरा शतक लगाने से चूक गए. बता दें कि ऑस्ट्रेलियाई कप्तान ने एक ऐसी चाल चली जिसमें फंसकर कोहली अपने करियर का 8वां दोहरा शतक लगाने से चूक गए.","content":"विराट कोहली को दोहरे शतक से रोकने के लिए स्टीव स्मिथ ने चली थी ये चाल भारत और ऑस्ट्रेलिया के बीच अहमदाबाद में खेले जा रहे चौथे टेस्ट मैच में भारत की तरफ से कोहली ने 186 रन की विराट पारी खेली. जिसके चलते भारतीय टीम पहली पारी में 571 रन बनाने में कामयाब हुई और पहली पारी के आधार पर टीम इंडिया ने ऑस्ट्रेलिया पर 91 रनों की बढ़त भी ले ली. सभी को उम्मीद थी कि विराट कोहली के बल्ले से शतक के बाद दोहरा शतक भी देखने को मिलेगा. लेकिन वे मात्र 14 रन से दोहरा शतक लगाने से चूक गए. यहां पर आपको बता दें कि दोहरा शतक लगा सकते थे लेकिन ऑस्ट्रेलियाई कप्तान ने एक ऐसी चाल चली कि कोहली उसमें फंसकर अपने करियर का 8वां शतक लगाने से चूक गए. अब स्मिथ ने किंग कोहली को आउट करने के लिए ऐसी कौन-सी चाल चली कि वे इसे समझ नहीं पाए तो आइए आपको बताते हैं. बता दें कि विराट जब अपने करियर के 8वें दोहरे शतक से मात्र कुछ ही रनों की दूरी पर थे तब स्मिथ ने सभी 9 फील्डर्स को बाउंड्री लाइन पर तैनात कर दिया. फिल्ड पोजीशन की एक तस्वीर सामने आई है जिसमें साफ दिखाई दे रहा है कि कीपर व बॉलर को छोड़ दिया जाए तो ऑस्ट्रेलियन टीम के सभी फील्डर्स सीमा रेखा पर हैं. विराट भी स्मिथ के बिछाए इस जाल में फंस गए और बाउंड्री लाइन पर एक बड़ा शॉट लगाने के चलते 186 के स्कोर पर मार्नस लाबुशेन को कैच थमा बैठे और आउट हो गए, इसी के साथ भारत की पारी भी 571 के स्कोर पर सिमट गई. यानि कि आखिरकार स्मिथ ने विराट को अपने जाल में फंसा ही लिया. चौथे दिन का खेल समाप्त होने तक ऑस्ट्रेलिया ने दूसरी पारी में बिना कोई विकेट गंवाए 3 रन बना लिए हैं. Field for Virat Kohli - everyone at the boundary. विराट अपने करियर का 8वां दोहरा शतक लगाने से मात्र 14 रन से चूक गए. बता दें कि ये उनके टेस्ट करियर का ये 28वां शतक है. विराट के बल्ले से 1205 दिन, 23 मैचों और 41 पारियों के बाद शतकीय पारी देखने को मिली. पूर्व भारतीय कप्तान के आउट होते ही भारत की पहली पारी भी 571 के स्कोर पर खत्म हो गई. विराट कोहली के बल्ले से बड़ी पारी का इंतज़ार था और विराट ने भी अपने फैंस को खुश करने का कोई मौका नहीं छोड़ा. 186 रन की दमदार पारी खेलकर उन्होंने दर्शा दिया है कि उन्हें इस खेल का किंग यूंही नहीं कहा जाता. अंतर्राष्ट्रीय क्रिकेट में विराट के नाम कुल 75 शतक हो गए हैं. अब वे सचिन तेंदुलकर के 100 शतकों के रिकॉर्ड को तोड़ने से 26 शतकों की दूरी पर हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:35:48","image_url":"https://c.ndtvimg.com/2023-03/t95o7hno_virat-kohli-afp_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL में देखने को मिला DRS ब्लंडर! क्रिकेट इतिहास में पहली बार हुआ कुछ ऐसा, देखकर पकड़ लेंगे माथा","link":"https://sports.ndtv.com/hindi/cricket/drs-blunder-seen-in-wpl-something-like-this-happened-for-the-first-time-in-the-history-of-cricket-you-will-be-surprised-to-see-it-3855180#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विमेंस प्रीमियर लीग में मुंबई इंडियंस और यूपी वॉरियर्स के बीच मुकाबला खेला जा रहा है. जिसमें मुंबई इंडियंस की बल्लेबाज़ी के चौथे ही ओवर में DRS को लेकर बड़ा ब्लंडर देखने को मिला.","content":"WPL में देखने को मिला DRS ब्लंडर! विमेंस प्रीमियर लीग में मुंबई इंडियंस और यूपी वॉरियर्स के बीच मुकाबला खेला जा रहा है. मुंबई ने अब तक इस लीग में कोई भी मैच नहीं गवाया है. यूपी ने इस मैच में टॉस जीतकर पहले बल्लेबाज़ी करते हुए 159 रन बनाए. इसी बीच मुंबई इंडियंस की बल्लेबाज़ी के चौथे ही ओवर में DRS को लेकर बड़ा ब्लंडर देखने को मिला. जब चौथे ओवर की पांचवीं गेंद पर सोफी एक्लेस्टन ने फुलर लैंथ गेंद फेंकी और मैथ्यूज़ ने इस गेंद पर डिफेंस किया लेकिन यूपी वॉरियर्स ने LBW की अपील कर दी. अंपायर ने अपील को नकार दिया. लेकिन रिव्यू में दिखा कि गेंद मैथ्यूज़ के बल्ले के बीचों बीच लगी है. इसके बावजूद LBW चेक किया गया और हौरानी तो तब हुई जब मैथ्यूज़ को आउट दे दिया गया. लेकिन हेली फिर भी मैदान पर खड़ी रहीं. दोबारा से DRS चेक किया गया तो पता चला कि किसी दूसरी बॉल का DRS दिखाया जा रहा था. अब अंपायर को अपना फैसला बदलना पड़ा और मैथ्यूज़ को नॉटआउट दिया गया. इससे पहले हेली रनआउट होने से भी बचीं. वैसे क्रिकेट इतिहास में ये पहली बार हुआ है जब किसी DRS के फैसले को बदलने के लिए थर्ड अंपायर ने मैदानी अंपायर को रेफर किया फैसला और फिर ग्राउंड अंपायर ने फिर से DRS लिया. On field umpire - Not out. Review taken... Third - Out. taken again... Third umpire - Not out. Comedy of errors.😹 Director shows Reverse footage first after taking DRS in WPL match this shows ball hits Shoe first and given Heally Mathews OUT And Than shown actuall footage which shows ball hit bat first Is this the first time there has been a DRS for a DRS?? What's happening?? Is this the first time there has been a DRS for a DRS?? What's happening?? First time I see a DRS decision being reversed! Ever! Was first given out after DRS review, but the batters questioned it, umpires reverted back to off field umpire for 2nd review. Decision was reversed. WPL 2023 coming with innovation hey! * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:35:12","image_url":"https://c.ndtvimg.com/2023-03/0kd1825g_drs_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL: Top knocks from Harmanpreet, Nat Sciver help MI down UP Warriorz by eight wickets","link":"https://thenewsmill.com/2023/03/wpl-top-knocks-from-harmanpreet-nat-sciver-help-mi-down-up-warriorz-by-eight-wickets/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"An unbeaten half-century from skipper Harmanpreet Kaur and fiery knocks from Yastika Bhatia and Nat-Sciver Brunt helped Mumbai Indians clinch their fourth successive win in the Women’s Premier League (WPL), as they defeated UP Warriorz by eight wickets on Sunday. With this win, MI is at the top of the points table with four wins in four games and total of eight points. UP Warriorz is at the third position, with two wins in four matches, two losses and a total of four points. In chase of 160 runs, Mumbai Indians started really well. Openers Yastika Bhatia and Hayley Matthews gave the side start they needed. Matthews hit Rajeshwari Gayakwad for two fours in the first over. But after that, Yastika lit up the stadium with some clean hitting. The wicketkeeper-batter smashed Shabnim Ismail, the world’s fastest bowler in women’s cricket, for three straight overs in the sixth over, bringing up the 50-run opening stand in 5.3 overs. At the end of the powerplay, MI was at 51/0, with Yastika (36*) and Hayley (11*) unbeaten. After the powerplay, MI lost their openers. Yastika was dismissed by Rajeshwari for a quickfire 42 off 27 balls after being caught by Simran Shaikh at deep-midwicket. MI was 58/1 at that point. Soon, world’s number one T20I bowler Sophie Ecclestone caught and bowled a struggling Matthews for 12 off 17 balls. MI was 58/2 at that point. Following this, skipper Harmanpreet Kaur and Nat-Sciver Brunt was the fresh pair on the crease. At the end of their 10 overs, MI was 72/2, with Sciver-Brunt (4*) and skipper Harmanpreet (7*) unbeaten. Brunt and Harman started to build a partnership, with the English star as the aggressor. MI touched the 100-run mark in 13.1 overs. Harman and Sciver also brought up their 50-run stand in just 41 balls. Harmanpreet accelerated with three straight boundaries. At the end of 15 overs, MI was 123/2, with Harmanpreet (31*) and Nat-Sciver (28*) at the crease. They needed 37 runs in the final five overs. Tahlia McGrath was smashed for 19 runs in the 16th over, including a wide and three fours and a six by Harmanpreet. This brought down the deficit to 18 runs in final four overs. Kaur brought up her fifty in 32 balls, with nine fours and one six. MI was able to chase down the target easily and finished their innings at 164/2 in 17.3 overs. Harmanpreet scored an unbeaten 53 off 33 balls, while Nat-Sciver finished at 45* in 31 balls, consisting of six fours and a six. They had a hard-hitting stand of 106 runs in 61 balls. Sophie and Gayakwad took a wicket each for UP. Earlier, half-centuries from skipper Alyssa Healy and Tahlia McGrath powered UP Warriorz to a modest 159/6 at the end of their 20 overs against Mumbai Indians in their Women’s Premier League (WPL) match in Mumbai on Sunday. After electing to bat first, UP Warriorz was off to a bad start. Spinner Saika Ishaque, the Purple Cup holder in WPL 2023, rolled her golden arm to trap Devika Vaidya leg-before wicket for just six runs off five balls. UPW was reduced 8/1 in two overs. Alyssa Healy, the skipper, then started rebuilding the innings in the company of Kiran Navgire. Healy smashed Saika for three straight fours in the fourth over. At the end of the powerplay, UPW was at 48/1, with Healy (30*) and Kiran Navgire (7*) unbeaten. UPW crossed the 50-run mark in 6.2 overs thanks to a six from Navgire. After the powerplay, Navgire tried to up the ante by hitting Amelia Kerr for a four and six. But the bowler had the last laugh as she dismissed Navgire for 17 off 14 balls after she was caught by wicketkeeper Yastika Bhatia. UPW was 58/2 in 6.4 overs. Tahlia McGrath, the world’s number one T20I batter was next up on the crease. In the ninth over, Tahlia smashed Amelia for three boundaries. At the end of 10 overs, UPW was at 58/2, with McGrath (22*) and McGrath (33*) unbeaten at the crease. UPW reached the 100-run mark with help of a four from McGrath in 11.5 overs. he Australian duo brought up their 50-run stand as well. Healy brought up her half-century in just 36 balls, studded with seven fours and a six. At the end of 15 overs, UPW was at 133/2, with Healy (53*) and McGrath (48*) unbeaten at the crease. Saika ended the 82-run stand between Healy and McGrath in the 17th over. She dismissed Healy for 58 off 46 balls and followed it up with McGrath’s scalp for 50 off 37 balls. Her strikes reduced UPW to 141/4 in 16.5 overs. Half of the UPW batting line-up was inside the hut after Sophie Ecclestone was dismissed for just one run by Hayley Matthews. UPW was 146/5 in 18 overs. UPW crossed 150-run mark in 18.3 overs. UPW ended the innings at 159/6. Deepti Sharma was dismissed for just seven by Amelia on the third ball of the final over. Shweta Sehrawat (2*) and Simran Shaikh (9*) were unbeaten at the close of their innings. Saika was the pick of the bowlers for MI, with 3/33 in her four overs. Kerr took two wickets while Hayley got one. Brief Scores: UPW: 159/6 (Alyssa Healy 58, Tahlia McGrath 50, Saika Ishaque 3/33) vs MI. (ANI)","pubDate":"2023-03-12 18:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Mehidy, Najmul help Bangladesh seal T20I series against England","link":"http://island.lk/mehidy-najmul-help-bangladesh-seal-t20i-series-against-england/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"On a typical Dhaka surface aiding spinners, Bangladesh made all the right moves and held their nerves to secure an unassailable 2-0 series lead over England, the reigning T20 World Cup champions. Mehidy Hasan Miraz, who was brought in for this game, starred with figures of 4 for 12 and helped bowl out England for […]","content":"On a typical Dhaka surface aiding spinners, Bangladesh made all the right moves and held their nerves to secure an unassailable 2-0 series lead over England, the reigning T20 World Cup champions. Mehidy Hasan Miraz, who was brought in for this game, starred with figures of 4 for 12 and helped bowl out England for 117. Najmul Hossain Shanto then steered Bangladesh in a tricky run chase with a 46* and delivered the win with seven balls to spare. Brief Scores : 117 (Ben Duckett 28; Mehidy Hasan Miraz 4-12) 120/6 in 18.5 overs (Najmul Hossain Shanto 46*; Jofra Archer 3-13) Published on By A dominant half-century from Harmanpreet Kaur, coupled with impressive performances with the bat from Yastika Bhatia and Nat Sciver-Brunt helped Mumbai Indians register their fourth straight win in the inaugural Women’s Premier League. Half-centuries from Alyssa Healy and Tahlia McGrath appeared to be enough initially to inflict the first loss for MI in their campaign but the table-toppers eventually cruised to victory in pursuit of 160 with 15 balls to spare following a century stand. Brief scores: UP Warriorz 159/6 in 20 overs (Alyssa Healy 58, Tahlia McGrath 50; Saika Ishaque 3/33) Mumbai Indians Women 164/2 in 17.3 overs (Harmanpreet Kaur 53*, Nat Sciver-Brunt 45*, Yastika Bhatia 42) Published on By Sri Lanka’s hopes of playing the World Test Championship final later this year at The Oval during the British summer largely depended on Angelo Mathews and he didn’t disappoint posting his 14th Test hundred enabling Sri Lanka to set the Kiwis a challenging target. Play gets underway in Christchurch at 3:30 am Sri Lanka time as New Zealand is seven and half hours ahead and most Sri Lankan fans who switched on their televisions at 6am yesterday after late nights on Saturday expected Sri Lanka to have collapsed as they had done time and again in recent years. But instead they found a fight back with Mathews leading the way. It was that kind of a wicket as a batter never looked comfortable against seamers and it helped that the Kiwis were without Neil Wagner, ruled out with a hamstring injury. Matt Henry wasn’t firing on all cylinders either having needed three stitches in the webbing between his thumb and index finger but that’s not to say that run making was a walk in the park. Where this Test and the series was heading depended on Mathews. He ended up giving Sri Lanka a very good chance to win the game. Mathews while posting 115 shared a 105 run stand with Dinesh Chandimal (42) and a further 60 runs with Dhananjaya de Silva (47 not out). Under pressure to save his place, Niroshan Dickwella didn’t do himself any favours as he was caught behind for a duck. It was a good ball but patience is running thin given Dickwella’s poor numbers and captain Dimuth Karunaratne who’s backed him to the hilt will have to do lot so convincing with the selectors to stop him being axed for the second Test. The day belonged to Mathews as he showcased his ability to build an innings and put Sri Lanka in a formidable position. At stumps on day four, the Kiwis were 28 for one chasing 285 to win. Devon Conway was dismissed early by Kasun Rajitha and all three quicks bowled impeccable lines and will have to do more of that as New Zealand begin day five needing 257 runs. Kane Williamson will be the key for New Zealand and Sri Lanka need to knock him off early if they are to pull off a win. Sri Lanka dominated the first two days of the Test but defensive field settings helped the Kiwis to stage a comeback and even end up with a first innings lead. Published on By Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel blasted five fours and four sixes in a blazing 79 to hand India a first-innings lead of 91 after posting 50-plus partnerships for each of the first six wickets of the innings. It could have been more but Shreyas Iyer was unable to bat or take the field on day four due to lower back pain. He left the venue early in the day to have scans. Australia suffered an injury of their own on a day where their bowlers’ figures were badly bruised as they failed to make inroads, or even create chances, on an unhelpful surface. Usman Khawaja hurt his left leg while attempting to take a catch on the rope just after drinks in the middle session. He landed awkwardly and limped from the field shortly after with Australia’s team physio. Details of his injury were not confirmed but he did not return and did not bat late in the day with Matt Kuhnemann opening as a nightwatcher. Khawaja has suffered a torn ACL and torn meniscus in his left knee in the past having had surgery to repair both tears. Kuhnemann and Travis Head survived six overs for three runs as Australia remains 88 runs behind with three sessions of cricket remaining to either salvage a draw or somehow manufacture a result to level the series 2-2.Kohli, and it seems most of India, had been waiting the agonizing 1205 days for his 28th Test century. But he was willing to wait as long as was necessary to reach three figures against some disciplined Australian bowling in the first two hours of the day. He was near faultless in reaching his 75th international century just after lunch. It was the second slowest of his Test career, off 241 deliveries, and featured just five boundaries in his first 100 runs and none in the first session of the morning. The discipline and patience he showed was rewarded handsomely thereafter, as the burden of the three-year wait washed away and the dominant Kohli of old returned. He tore into Australia’s two fast men Cameron Green and Mitchell Starc during attempted hostile spells with the reversing ball. He also became ever more expansive and extravagant against the two offspinners Nathan Lyon and Todd Murphy, who he treated with the utmost respect in the first session. He got wonderful support all the way through the day. His 168-run partnership with Axar was the fruit of his morning labour. The pair scored with incredible freedom compared to the grind pre-lunch. Australia’s bowlers flagged in the afternoon sun. Kohli struck 10 classy boundaries in the afternoon unfurling some sublime drives on the up and some supreme pull shots off Lyon in particular, trusting the Ahmedabad bounce with cross-bat shots having fallen foul to them previously in the series on less trustful surfaces. While Kohli got into line and prospered mostly through the leg side, Axar gave room to carve through the off. But he did mix in four brutal slog sweeps, three that landed in the stands and one that bounced into the fence at warp speed. Axar did have some luck against Lyon, edging him to slip where Smith couldn’t hang onto an incredibly difficult one-handed chance high to his right. There were some other nervous moments defending Lyon but otherwise, it was smooth sailing. The pair looked nailed on for a double-century stand and twin milestones with Kohli’s 200 and Axar’s maiden Test century in sight. But Axar fell by the sword, chopping Mitchell Starc onto the stumps trying to flay him on the up through cover. Kohli ran out of partners as R Ashwin holed out in the deep and Umesh Yadav was run out by a brilliant direct hit from the deep from Peter Handscomb for a diamond duck trying to keep Kohli on strike.Kohli was dropped himself by Handscomb in the deep off Lyon on 185, a difficult chance diving low at long-on. It only cost one run as he holed out swinging for the fence next over. Earlier, Kohli also shared half-century stands with Ravindra Jadeja and KS Bharat in the morning but India only managed 73 runs in the first session. Lyon and Murphy bowled superbly to keep a lid on the scoring, with Kohli really battling to break free from very disciplined lines and lengths although he was never threatened in defence. Jadeja eventually did smacking Murphy down the ground, but he holed out meekly to mid-on not long after. Bharat slog-swept his second ball for six over wide long-on but battled to 25 from 70 at lunch. However, he hit the accelerator after lunch when Cameron Green tried to pepper him with short balls under instruction from his captain Steven Smith with a heavy legside field. After ducking a full over of short balls, he unfurled two pulls for a six and a cut for four in the following over. Lyon knocked him over shortly after with turn and bounce. It was one of only three wickets he took for the innings across a marathon 65 overs. It is the most he has ever bowled in a Test innings and he deserved better reward than he got. Murphy also took three wickets from 45.5. They were Australia’s best two bowlers by far as indicated by their workloads. Smith did not have as much faith in the other three with the two quicks lathered to all parts while Kuhnemann was nowhere near as effective on this surface as he had been in Indore.","pubDate":"2023-03-13 00:21:51","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Kohli 186, Axar 79 give India a chance to push for a win","link":"http://island.lk/kohli-186-axar-79-give-india-a-chance-to-push-for-a-win/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel […]","content":"Virat Kohli’s Test century drought has been broken and the floodgates could open on Australia as they face a battle to save the game on the final day after India’s lengthy batting line-up piled up 571 for 9 on the fourth day in Ahmedabad. Kohli made a magnificent 186 from 364 balls while Axar Patel blasted five fours and four sixes in a blazing 79 to hand India a first-innings lead of 91 after posting 50-plus partnerships for each of the first six wickets of the innings. It could have been more but Shreyas Iyer was unable to bat or take the field on day four due to lower back pain. He left the venue early in the day to have scans. Australia suffered an injury of their own on a day where their bowlers’ figures were badly bruised as they failed to make inroads, or even create chances, on an unhelpful surface. Usman Khawaja hurt his left leg while attempting to take a catch on the rope just after drinks in the middle session. He landed awkwardly and limped from the field shortly after with Australia’s team physio. Details of his injury were not confirmed but he did not return and did not bat late in the day with Matt Kuhnemann opening as a nightwatcher. Khawaja has suffered a torn ACL and torn meniscus in his left knee in the past having had surgery to repair both tears. Kuhnemann and Travis Head survived six overs for three runs as Australia remains 88 runs behind with three sessions of cricket remaining to either salvage a draw or somehow manufacture a result to level the series 2-2.Kohli, and it seems most of India, had been waiting the agonizing 1205 days for his 28th Test century. But he was willing to wait as long as was necessary to reach three figures against some disciplined Australian bowling in the first two hours of the day. He was near faultless in reaching his 75th international century just after lunch. It was the second slowest of his Test career, off 241 deliveries, and featured just five boundaries in his first 100 runs and none in the first session of the morning. The discipline and patience he showed was rewarded handsomely thereafter, as the burden of the three-year wait washed away and the dominant Kohli of old returned. He tore into Australia’s two fast men Cameron Green and Mitchell Starc during attempted hostile spells with the reversing ball. He also became ever more expansive and extravagant against the two offspinners Nathan Lyon and Todd Murphy, who he treated with the utmost respect in the first session. He got wonderful support all the way through the day. His 168-run partnership with Axar was the fruit of his morning labour. The pair scored with incredible freedom compared to the grind pre-lunch. Australia’s bowlers flagged in the afternoon sun. Kohli struck 10 classy boundaries in the afternoon unfurling some sublime drives on the up and some supreme pull shots off Lyon in particular, trusting the Ahmedabad bounce with cross-bat shots having fallen foul to them previously in the series on less trustful surfaces. While Kohli got into line and prospered mostly through the leg side, Axar gave room to carve through the off. But he did mix in four brutal slog sweeps, three that landed in the stands and one that bounced into the fence at warp speed. Axar did have some luck against Lyon, edging him to slip where Smith couldn’t hang onto an incredibly difficult one-handed chance high to his right. There were some other nervous moments defending Lyon but otherwise, it was smooth sailing. The pair looked nailed on for a double-century stand and twin milestones with Kohli’s 200 and Axar’s maiden Test century in sight. But Axar fell by the sword, chopping Mitchell Starc onto the stumps trying to flay him on the up through cover. Kohli ran out of partners as R Ashwin holed out in the deep and Umesh Yadav was run out by a brilliant direct hit from the deep from Peter Handscomb for a diamond duck trying to keep Kohli on strike.Kohli was dropped himself by Handscomb in the deep off Lyon on 185, a difficult chance diving low at long-on. It only cost one run as he holed out swinging for the fence next over. Earlier, Kohli also shared half-century stands with Ravindra Jadeja and KS Bharat in the morning but India only managed 73 runs in the first session. Lyon and Murphy bowled superbly to keep a lid on the scoring, with Kohli really battling to break free from very disciplined lines and lengths although he was never threatened in defence. Jadeja eventually did smacking Murphy down the ground, but he holed out meekly to mid-on not long after. Bharat slog-swept his second ball for six over wide long-on but battled to 25 from 70 at lunch. However, he hit the accelerator after lunch when Cameron Green tried to pepper him with short balls under instruction from his captain Steven Smith with a heavy legside field. After ducking a full over of short balls, he unfurled two pulls for a six and a cut for four in the following over. Lyon knocked him over shortly after with turn and bounce. It was one of only three wickets he took for the innings across a marathon 65 overs. It is the most he has ever bowled in a Test innings and he deserved better reward than he got. Murphy also took three wickets from 45.5. They were Australia’s best two bowlers by far as indicated by their workloads. Smith did not have as much faith in the other three with the two quicks lathered to all parts while Kuhnemann was nowhere near as effective on this surface as he had been in Indore. Published on By A dominant half-century from Harmanpreet Kaur, coupled with impressive performances with the bat from Yastika Bhatia and Nat Sciver-Brunt helped Mumbai Indians register their fourth straight win in the inaugural Women’s Premier League. Half-centuries from Alyssa Healy and Tahlia McGrath appeared to be enough initially to inflict the first loss for MI in their campaign but the table-toppers eventually cruised to victory in pursuit of 160 with 15 balls to spare following a century stand. Brief scores: UP Warriorz 159/6 in 20 overs (Alyssa Healy 58, Tahlia McGrath 50; Saika Ishaque 3/33) Mumbai Indians Women 164/2 in 17.3 overs (Harmanpreet Kaur 53*, Nat Sciver-Brunt 45*, Yastika Bhatia 42) Published on By Sri Lanka’s hopes of playing the World Test Championship final later this year at The Oval during the British summer largely depended on Angelo Mathews and he didn’t disappoint posting his 14th Test hundred enabling Sri Lanka to set the Kiwis a challenging target. Play gets underway in Christchurch at 3:30 am Sri Lanka time as New Zealand is seven and half hours ahead and most Sri Lankan fans who switched on their televisions at 6am yesterday after late nights on Saturday expected Sri Lanka to have collapsed as they had done time and again in recent years. But instead they found a fight back with Mathews leading the way. It was that kind of a wicket as a batter never looked comfortable against seamers and it helped that the Kiwis were without Neil Wagner, ruled out with a hamstring injury. Matt Henry wasn’t firing on all cylinders either having needed three stitches in the webbing between his thumb and index finger but that’s not to say that run making was a walk in the park. Where this Test and the series was heading depended on Mathews. He ended up giving Sri Lanka a very good chance to win the game. Mathews while posting 115 shared a 105 run stand with Dinesh Chandimal (42) and a further 60 runs with Dhananjaya de Silva (47 not out). Under pressure to save his place, Niroshan Dickwella didn’t do himself any favours as he was caught behind for a duck. It was a good ball but patience is running thin given Dickwella’s poor numbers and captain Dimuth Karunaratne who’s backed him to the hilt will have to do lot so convincing with the selectors to stop him being axed for the second Test. The day belonged to Mathews as he showcased his ability to build an innings and put Sri Lanka in a formidable position. At stumps on day four, the Kiwis were 28 for one chasing 285 to win. Devon Conway was dismissed early by Kasun Rajitha and all three quicks bowled impeccable lines and will have to do more of that as New Zealand begin day five needing 257 runs. Kane Williamson will be the key for New Zealand and Sri Lanka need to knock him off early if they are to pull off a win. Sri Lanka dominated the first two days of the Test but defensive field settings helped the Kiwis to stage a comeback and even end up with a first innings lead. Published on By After Angelo Mathews led Sri Lanka’s fight and recovery with his 14th Test century, Matt Henry struck thrice in quick succession in the final session to keep the Christchurch Test on a knife’s edge. Henry removed Niroshan Dickwella and Kasun Rajitha in the space of six overs as Sri Lanka went from 200 for 5 to 302 allout, setting New Zealand a target of 285. The home side lost Devon Conway early, and went to stumps at 28 for 1. Brief Scores : 355 & 302 (Angelo Mathews 115, Blair Tickner 4-100, Matt Henry 3-71) 373 & 28/1 (Kasun Rajitha 1-5)","pubDate":"2023-03-12 23:40:24","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"अजब-गजब ! रेहान अहमद ने फिर से रचा इतिहास, अब T20I में इंग्लैंड के लिए डेब्यू कर किया ऐतिहासिक कमाल","link":"https://sports.ndtv.com/hindi/cricket/bangladesh-vs-england-2nd-t20-rehan-ahmed-makes-his-t20-debut-this-morning-and-is-now-england-mens-youngest-ever-in-all-3-formats-still-aged-18-3854063#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs England T20I: इंग्लैंड के युवा स्पिनर रेहान अहमद (Rehan Ahmed) ने एक बार फिर इंग्लैंड के लिए इतिहास रच दिया है.","content":"अब टी-20 इंटरनेशनल में रेहान अहमद ने रचा इतिहास Bangladesh vs England T20I: इंग्लैंड के युवा स्पिनर एक बार फिर इंग्लैंड के लिए इतिहास रच दिया है. बता दें कि बांग्लादेश के खिलाफ दूसरे टी-20 मैच में उन्हें डेब्यू करने का मौका मिला है. रेहान को जोस बटलर ने डेब्यू कैप देकर उनका टी-20 इंटरनेशनल टीम में स्वागत किया. बता दें कि रेहान अब इंग्लैंड की ओर से सबसे कम उम्र में इंग्लैंड के लिए टी-20 इंटरनेशनल मैच खेलने वाले खिलाड़ी बन गए हैं. ✅ Test ✅ ODI ✅ T20 Rehan Ahmed makes his T20 debut this morning and is now England Men's youngest ever in all 3 formats still aged 18 🤯 बता दें कि वो इंग्लैंड के पहले ऐसे खिलाड़ी हैं जो वनडे, टेस्ट और टी-20 में डेब्यू करने वाले सबसे युवा खिलाड़ी हैं. इससे पहले रेहान ने टेस्ट क्रिकेट में इंग्लैंड के लिए सबसे कम उम्र में डेब्यू किया था. वही, बांग्लादेश के खिलाफ वनडे सीरीज के दौरान रेहान वनडे में डेब्यू करने वाले इंग्लैंड के सबसे युवा खिलाड़ी बने थे. अब टी-20 सीरीज के दूसरे मैच में डेब्यू कर रेहान ने अनोखा कमाल अपने करियर में डेब्यू के साथ ही कर दिया है. 🏏 We've lost the toss and are batting first! And… becomes the youngest ever England men's T20 player! 🏴󠁧󠁢󠁥󠁮󠁧󠁿 Congratulations, Rehan - go and smash it 👏 🤝 # टेस्ट में रेहान ने 18 साल और 126 दिन की उम्र में इंग्लैंड के लिए टेस्ट डेब्यू किया था. # वनडे में 18 साल और 205 दिन की उम्र में वनडे में डेब्यू किया था. # रेहान 18 साल और 211 दिन की उम्र में T20I में इंग्लैंड के लिए डेब्यू करने में सफल रहे हैं. बता दें कि रेहान अहमद का जन्म 13 अगस्त 2004 को हुआ था. उन्होंने 17 दिसंबर 2022 को पाकिस्तान के खिलाफ टेस्ट खेलकर इंटरनेशनल क्रिकेट में डेब्यू किया करने में सफल रहे थे. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 19:56:10","image_url":"https://c.ndtvimg.com/2023-03/nufjtij8_rehan-ahmed_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: अक्षर पटेल ने विराट को लेकर कह दी बड़ी बात, स्पिन के खिलाफ रणनीति को लेकर भी किया खुलासा","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-akshar-patel-said-a-big-thing-about-virat-also-revealed-about-the-strategy-against-spin-axar-patel-2nd-highest-scorer-in-bgt-2023-3854876#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 4th Test: बॉर्डर-गावस्कर श्रृंखला (Axar Patel Half Century) में अक्षर अब तक भारत के दूसरे सर्वोच्च स्कोरर रहे. उन्होंने श्रृंखला में तीन अर्धशतकीय पारियों के साथ कुल 264 रन बनाये.","content":"Axar Patel हरफनमौला अक्षर पटेल (Axar Patel) ने ऑस्ट्रेलिया के खिलाफ चौथे टेस्ट मैच के चौथे दिन शनिवार को अर्धशतकीय पारी खेलकर भारत को मजबूत स्थिति में पहुंचाने के बाद कहा कि इस श्रृंखला के लिए स्पिनरों के खिलाफ योजना बनाकर बल्लेबाजी करना उनके लिए कारगर रहा. बॉर्डर-गावस्कर श्रृंखला (Axar Patel Half Century) में अक्षर अब तक भारत के दूसरे सर्वोच्च स्कोरर रहे. उन्होंने श्रृंखला में तीन अर्धशतकीय पारियों के साथ कुल 264 रन बनाये. उन्होंने नागपुर में 84, दिल्ली में 74 और मौजूदा मैच में 79 रन की पारी खेली. वह इस दौरान अपने पहले टेस्ट शतक के सपने को पूरा नहीं कर सके लेकिन इन तीनों मैचों में उन्होंने शानदार साझेदारियां बनाकर टीम की जीत की नींव रखी. A pat from Virat Kohli on Axar Patel's shoulder when he got out - Kohli appreciating Axar's brilliant innings. अक्षर ने शनिवार को संवाददाता सम्मेलन में कहा, ‘‘ जब हमने नागपुर में शिविर शुरू किया था तो हमें पता था कि हम स्पिन गेंदबाजों के लिए मददगार पिच पर खेलेंगे. मैंने ज्यादा तैयारी नहीं की थी लेकिन स्पिनरों के खिलाफ बल्लेबाजी की बारीकियों पर काम किया. मैंने पगबाधा होने से बचने के लिए लेग स्टंप के बाहर से बल्लेबाजी करने के साथ क्रीज से ज्यादा बाहर नहीं निकलने का फैसला किया था. स्पिन गेंदबाजों के लिए मददगार पिच पर आपके पगबाधा या स्टंप होने की संभावना अधिक होती है.'' अक्षर से पूछा गया कि क्या उन्हें लगता है कि उन्होंने शतक पूरा करने का तीन मौका गंवा दिया. उन्होंने हंसते हुए कहा, ‘‘ आप जले पर नमक झिड़क रहे है. मैं जिस तरह से बल्लेबाजी कर रहा था और मैं जानता हूं कि मैंने जो मौके गंवाए वे बार-बार नहीं आते. इन पारियों को बड़े स्कोर में बदलना चाहिये था.'' भारतीय टीम अब अपना अगला टेस्ट संभवत: विश्व टेस्ट चैम्पियनशिप (डब्ल्यूटीसी) के फाइनल में ऑस्ट्रेलिया के खिलाफ ओवल (लंदन) में खेलेगी. इंग्लैंड की परिस्थितियों में भारतीय टीम शायद एक स्पिनर के साथ उतरे और वह रविन्द्र जडेजा हो सकते है. Axar Patel appreciation tweet Man missed the century for the third time in this series but all knocks were game changer. अक्षर ने कहा, ‘‘ अंतिम एकादश (डब्ल्यूटीसी फाइनल के लिए) में जगह हासिल करना मेरे हाथ में नहीं है और मैं इस बारे में कुछ नहीं कर सकता. मुझे जो मौके मिल रहे हैं मैं उसमें प्रदर्शन कर रहा हूं और जो मेरे हाथ में है उस पर ध्यान लगा रहा हूं. कोच और कप्तान अंतिम एकादश तय करते हैं और मेरा काम लगातार अच्छा प्रदर्शन करना और एकादश में जगह बनाना है.'' शनिवार की अर्धशतकीय पारी के बारे में अक्षर ने कहा कि टीम की ओर से उन्हें कोई विशेष संदेश नहीं मिला था और सिर्फ सकारात्मक बल्लेबाजी करने के लिए कहा गया था. उन्होंने कहा, ‘‘ जब मैं विराट भाई (कोहली) के साथ बल्लेबाजी कर रहा था तो टीम की तरफ से कोई खास संदेश नहीं था. विराट भाई ने मुझसे कहा कि मैं अपनी तरह सकारात्मक होकर खेलना जारी रखूं. जब हमने क्रीज पर समय बिता लिया तब गेंदबाजों को पिच से भी ज्यादा मदद नहीं मिल रही थी.'' उन्होंने कहा, ‘‘ मेरा अर्धशतक पूरा होने के बाद विराट भाई भी कह रहे थे कि मैं बड़ा स्कोर करने की सोच सकता हूं क्योंकि दिन के खेल में 22 ओवर बाकी थे. उस समय तक पारी घोषित करने की कोई योजना नहीं थी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:54:38","image_url":"https://c.ndtvimg.com/2023-03/u7rp65po_axar-patel_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WC 2023: क्या सच में ऐसा होगा? ODI क्रिकेट को लेकर रवि शास्त्री के बयान ने क्रिकेट जगत को चौकाया","link":"https://sports.ndtv.com/hindi/cricket/odi-wc-2023-will-it-really-happen-ravi-shastris-statement-regarding-odi-cricket-shocked-the-cricket-world-dinesh-karthik-on-odi-format-3855069#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ODI WC 2023: कपिल देव की अगुआई वाली भारतीय टीम ने 1983 में वनडे विश्व कप जीता (WC 1983) था तो यह 60-60 ओवर (60 Overs Match ODI WC 1983) का टूर्नामेंट हुआ करता था.","content":"Ravi Shastri भारत में होने वाले वनडे विश्व कप में सात महीने से भी कम समय रह गया है और देश की क्रिकेट टीम के पूर्व मुख्य कोच रवि शास्त्री (Ravi Shastri on One Day World Cup) का मानना है कि इस टूर्नामेंट को नयापन देने के लिये आईसीसी टूर्नामेंट के भविष्य के चरणों को 40-40 ओवर का कर देना चाहिए. भारत और आस्ट्रेलिया के बीच चौथे टेस्ट के चौथे दिन रविवार को पूर्व भारतीय कप्तान ने कहा, ‘‘वनडे क्रिकेट को बचे रहने के लिए इसे भविष्य में घटाकर 40-40 ओवर (Ravi Shastri on 40 Overs Odi Match) का कर देना चाहिए. '' शास्त्री ने कहा कि वनडे में दर्शकों की घटती संख्या का निवारण किया जाना चाहिए और उन्होंने कहा कि जब कपिल देव की अगुआई वाली भारतीय टीम ने 1983 में वनडे विश्व कप जीता था तो यह 60-60 ओवर (60 Overs Match Odi WC 1983) का टूर्नामेंट हुआ करता था लेकिन बाद में इसे घटाकर 50-50 ओवर का कर दिया गया. उन्होंने कहा, ‘‘मैं यह इसलिये कह रहा हूं क्योंकि जब हमने 1983 में विश्व कप (1983 Odi WC) जीता था तो यह 60 ओवर का मैच हुआ करता था. फिर लोगों का आकर्षण इसके प्रति कम होता गया तो यह 50 ओवर का बन गया. मुझे लगता है कि अब समय आ गया है जब इसे 40-40 ओवर का कर देना चाहिए। समय के साथ बदलना जरूरी है, प्रारूप को घटाना चाहिए. '' शास्त्री (Ravi Shastri on Odi Cricket Future) की दर्शकों की दिलचस्पी कम होने की बात सही है लेकिन जब 1987 में विश्व कप उप महाद्वीप में कराया गया था तो 120 ओवर के दौरान दो ब्रेक (लंच और चाय) करना संभव नहीं था जैसा कि इंग्लैंड में पिछले तीन चरण के दौरान हुआ था. शास्त्री ने कहा कि टी20 प्रारूप खेल में बड़ी कमाई करता रहेगा, लेकिन वह द्विपक्षीय टी20 अंतरराष्ट्रीय श्रृंखला को पसंद नहीं करते और उनका कहना है कि इन्हें कम कर देना चाहिए. यह महान क्रिकेटर द्विपक्षीय श्रृंखला को कम करने की वकालत करता रहा है. उन्होंने कहा, ‘‘मुझे लगता है कि टी20 प्रारूप महत्वपूर्ण है. इसे विकसित करने की जरूरत है, लेकिन मुझे लगता है कि द्विपक्षीय श्रृंखला को कम किया जाना चाहिए.'' पूर्व खिलाड़ी ने कहा कि टेस्ट क्रिकेट अपने शीर्ष अहम स्थान का लुत्फ उठाना जारी रखेगा क्योंकि यही महत्वपूर्ण प्रारूप है. उन्होंने कहा, ‘‘टेस्ट क्रिकेट हमेशा टेस्ट क्रिकेट बना रहेगा और इसे सबसे ज्यादा महत्व दिया जाना चाहिए. मुझे लगता है कि भारत में सभी प्रारूपों के लिए जगह है. विशेष रूप से उपमहाद्वीप में विशेष रूप से ऑस्ट्रेलिया जैसी जगहों पर. '' भारतीय क्रिकेटर दिनेश कार्तिक (Dinesh Karthik on Odi Cricket) ने भी कहा कि एकदिवसीय प्रारूप अपना आकर्षण खो रहा है और इस साल अक्टूबर-नवंबर में भारत में होने वाला विश्व कप आखिरी संस्करण हो सकता है. कार्तिक ने कहा, ‘‘वनडे प्रारूप ने अपना आकर्षण खो दिया है. हम इस साल के अंत में या उसके बाद एक और विश्व कप देख सकते हैं. लोग टेस्ट क्रिकेट देखना चाहते हैं, जो क्रिकेट का सही मायने में प्रारूप है और टी20 मनोरंजन के लिए है. '' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:54:18","image_url":"https://c.ndtvimg.com/2022-04/7htad1d_ravi-shastri_625x300_01_April_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: Virat Kohli के शतक पर ऐसा रिएक्शन, जिसने Asia Cup के जश्न की यादें ताज़ा कर दी","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-such-a-reaction-on-virats-century-which-brought-back-memories-of-asia-cup-celebrations-small-boy-celebration-on-virat-kohli-28th-test-centu-3855268#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS, Virat Kohli Test Century: अहमदाबाद के नरेंद्र मोदी स्टेडियम में एक बार फिर कुछ अलग तस्वीर नज़र आई वो भी तब जब विराट अपने शतक का जश्न मना रहे थे.","content":"Virat Kohli Century Celebration विराट कोहली ने ऑस्ट्रेलिया के खिलाफ शतकीय पारी खेली और अपने दोहरे शतक के बेहद करीब थें, लेकिन विराट चूक गए. आपको विराट कोहली का एशिया कप में लगाया गया वो शतक तो याद होगा क्योंकि विराट ने वनडे में शतक तब लगाया था जब शतक का इंतज़ार 3 साल पार कर चूका था. विराट के द्वारा एशिया कप (Virat Kohli Asia Cup Century) में लगाए गए. उस शतक के दौरान एक तस्वीर ने सबका दिल जीत लिया था, लेकिन आज अहमदाबाद के नरेंद्र मोदी स्टेडियम में एक बार फिर कुछ अलग तस्वीर नज़र आई वो भी तब जब विराट अपने शतक का जश्न मना रहे थे. Two completely different and opposite generations bowing down to Virat Kohli. Iconic. ❤️ एशिया कप के दौरान विराट के जश्न के उस वीडियो में एक बुजुर्ग क्रिकेट प्रशंसक विराट के शतक पर उनको शाबाशी देते हुए दोनों हाथों को ऊपर कर सर को झुकाते हुए देखे गए. आज फिर एक तस्वीर सोशल मीडिया पर तहलका मचा रही है, लेकिन तस्वीर में बुजुर्ग फैन की जगह एक नया क्रिकेट का भविष्य दिखाई दे रहा था. विराट के शतक लगाने के बाद एक छोटे बच्चे ने विराट के शतक पर ऐसा रिएक्शन दिया जिसने एशिया कप के जश्न की यादें ताज़ा कर दी. स्टेडियम में मौजूद लगभग 15 हजार लोगों के लिए रविवार का दिन यादगार रहा जब कोहली ने ऑफ स्पिनर नाथन लियोन की गेंद को मिड विकेट पर एक रन के लिए खेलकर नवंबर 2019 के बाद अपना पहला टेस्ट शतक पूरा किया.कोहली का यह टेस्ट क्रिकेट में 28वां और कुल 75वां अंतरराष्ट्रीय शतक है. उन्होंने 241 गेंद में शतक पूरा किया. कोहली ने कुल 364 गेंदों में 184 रनों की पारी खेली. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:53:55","image_url":"https://c.ndtvimg.com/2023-03/clak0qmo_virat-kohli-icc-806_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jos Buttler happy with batters at England’s disposal despite Bangladesh defeat","link":"https://www.standard.co.uk/sport/cricket/jos-buttler-england-bangladesh-b1066667.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Jos Buttler has no regrets about not drafting in more batting options after England's lack of runs came back to haunt them again as Bangladesh wrapped up a T20 series victory.","content":"has no regrets about not drafting in more batting options after 's lack of runs came back to haunt them again as wrapped up a T20 series victory. England decided against summoning replacements for injured duo Tom Abell and Will Jacks ahead of these three matches, leaving them with 13 players to choose from and a threadbare batting unit. Buttler highlighted the absences of several players including Alex Hales, Sam Billings and Liam Dawson, who were given special dispensation by England to prioritise the ongoing Pakistan Super League. England have been exposed in Chattogram and now in Dhaka, where they rejigged their top-order but slipped from 50 for one after six overs on a difficult pitch to 117 all out in a four-wicket defeat. But Buttler feels using Moeen Ali and Sam Curran higher up the order gives them a chance to acclimatise to conditions they might face when England defend their 50-over World Cup title in India this year. SPONSORED \"It's a different balance and a different feel to the team,\" said Buttler. \"We wanted to give exposure to guys especially who, in these conditions, will also probably play a part in the 50-over World Cup. \"It felt like a great chance to expose the all-rounders' batting, maybe one spot higher than in our normal team. \"The way cricket is at the moment, there's a few players who've opted not to be here anyway for various reasons, so it felt like instead of calling someone else up, try to use the guys who would be exposed to these conditions in the 50-over World Cup as well.\" Buttler has a phenomenal record as an opening batter in T20s, averaging 49.2 with a strike-rate of 152.22 in 44 matches, but elected to shift himself down to number four in the order on Sunday. That was down to numbers three to six in the series opener all being left-handed, so the right-hand, left-hand combination of Phil Salt and Dawid Malan opened and, when the latter fell, out strode Moeen. \"We've obviously got a bank of left-handers in our middle order, it was just an opportunity to change that up a little bit,\" said Buttler. \"Try to break up our right and left-handers. \"I'm very comfortable batting anywhere in the order, I've spent a hell of a lot of my career as a middle-order player as well. I just felt like it would be an opportunity to try something different. \"The opportunity for Mo to go in at number three, something he's done successfully for Chennai Super Kings (in the Indian Premier League). There's still some good strengths there as well.\" On the same ground where Mehidy Hasan Miraz collected 12 match wickets to inspire Bangladesh to a first Test win over England seven years ago, the off-spinner claimed four for 12 in four excellent overs. Buttler accepted England did not put enough on the board, despite an outstanding effort in the field, led by Jofra Archer, who took three for 13 which seemed to give his side a glimmer of hope. But with 13 needed off 12 balls, Chris Jordan, bowling the penultimate over and his first of the day, was dispatched for three fours in five deliveries as Bangladesh won with 1.1 overs to spare. \"We know the challenge here, you have to adapt and play well, and we're not miles off,\" added Buttler. \"I thought it was an outstanding bowling display from us to take it that deep and put pressure on Bangladesh to chase those runs. The extra 10 or 15 runs would have probably been crucial in that game.\" England will now look to avoid suffering a whitewash in their first T20 series since winning last year's World Cup although Mehidy is hoping to deepen the misery of the tourists. \"There might be some (England) players getting rest, so it's a good opportunity for us, and we are really proud of this moment,\" he said.","pubDate":"2023-03-12 18:40:50","image_url":"https://static.standard.co.uk/2023/03/12/18/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"विराट कोहली को दोहरे शतक से रोकने के लिए स्टीव स्मिथ ने चली थी ये चाल","link":"https://sports.ndtv.com/hindi/cricket/steve-smith-did-this-trick-to-stop-virat-kohli-from-double-century-3854590#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"सभी को उम्मीद थी कि विराट कोहली के बल्ले से दोहरा शतक देखने को मिलेगा. लेकिन वे मात्र 14 रन से दोहरा शतक लगाने से चूक गए. बता दें कि ऑस्ट्रेलियाई कप्तान ने एक ऐसी चाल चली जिसमें फंसकर कोहली अपने करियर का 8वां दोहरा शतक लगाने से चूक गए.","content":"विराट कोहली को दोहरे शतक से रोकने के लिए स्टीव स्मिथ ने चली थी ये चाल भारत और ऑस्ट्रेलिया के बीच अहमदाबाद में खेले जा रहे चौथे टेस्ट मैच में भारत की तरफ से कोहली ने 186 रन की विराट पारी खेली. जिसके चलते भारतीय टीम पहली पारी में 571 रन बनाने में कामयाब हुई और पहली पारी के आधार पर टीम इंडिया ने ऑस्ट्रेलिया पर 91 रनों की बढ़त भी ले ली. सभी को उम्मीद थी कि विराट कोहली के बल्ले से शतक के बाद दोहरा शतक भी देखने को मिलेगा. लेकिन वे मात्र 14 रन से दोहरा शतक लगाने से चूक गए. यहां पर आपको बता दें कि दोहरा शतक लगा सकते थे लेकिन ऑस्ट्रेलियाई कप्तान ने एक ऐसी चाल चली कि कोहली उसमें फंसकर अपने करियर का 8वां शतक लगाने से चूक गए. अब स्मिथ ने किंग कोहली को आउट करने के लिए ऐसी कौन-सी चाल चली कि वे इसे समझ नहीं पाए तो आइए आपको बताते हैं. बता दें कि विराट जब अपने करियर के 8वें दोहरे शतक से मात्र कुछ ही रनों की दूरी पर थे तब स्मिथ ने सभी 9 फील्डर्स को बाउंड्री लाइन पर तैनात कर दिया. फिल्ड पोजीशन की एक तस्वीर सामने आई है जिसमें साफ दिखाई दे रहा है कि कीपर व बॉलर को छोड़ दिया जाए तो ऑस्ट्रेलियन टीम के सभी फील्डर्स सीमा रेखा पर हैं. विराट भी स्मिथ के बिछाए इस जाल में फंस गए और बाउंड्री लाइन पर एक बड़ा शॉट लगाने के चलते 186 के स्कोर पर मार्नस लाबुशेन को कैच थमा बैठे और आउट हो गए, इसी के साथ भारत की पारी भी 571 के स्कोर पर सिमट गई. यानि कि आखिरकार स्मिथ ने विराट को अपने जाल में फंसा ही लिया. चौथे दिन का खेल समाप्त होने तक ऑस्ट्रेलिया ने दूसरी पारी में बिना कोई विकेट गंवाए 3 रन बना लिए हैं. Field for Virat Kohli - everyone at the boundary. विराट अपने करियर का 8वां दोहरा शतक लगाने से मात्र 14 रन से चूक गए. बता दें कि ये उनके टेस्ट करियर का ये 28वां शतक है. विराट के बल्ले से 1205 दिन, 23 मैचों और 41 पारियों के बाद शतकीय पारी देखने को मिली. पूर्व भारतीय कप्तान के आउट होते ही भारत की पहली पारी भी 571 के स्कोर पर खत्म हो गई. विराट कोहली के बल्ले से बड़ी पारी का इंतज़ार था और विराट ने भी अपने फैंस को खुश करने का कोई मौका नहीं छोड़ा. 186 रन की दमदार पारी खेलकर उन्होंने दर्शा दिया है कि उन्हें इस खेल का किंग यूंही नहीं कहा जाता. अंतर्राष्ट्रीय क्रिकेट में विराट के नाम कुल 75 शतक हो गए हैं. अब वे सचिन तेंदुलकर के 100 शतकों के रिकॉर्ड को तोड़ने से 26 शतकों की दूरी पर हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:35:48","image_url":"https://c.ndtvimg.com/2023-03/t95o7hno_virat-kohli-afp_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL में देखने को मिला DRS ब्लंडर! क्रिकेट इतिहास में पहली बार हुआ कुछ ऐसा, देखकर पकड़ लेंगे माथा","link":"https://sports.ndtv.com/hindi/cricket/drs-blunder-seen-in-wpl-something-like-this-happened-for-the-first-time-in-the-history-of-cricket-you-will-be-surprised-to-see-it-3855180#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विमेंस प्रीमियर लीग में मुंबई इंडियंस और यूपी वॉरियर्स के बीच मुकाबला खेला जा रहा है. जिसमें मुंबई इंडियंस की बल्लेबाज़ी के चौथे ही ओवर में DRS को लेकर बड़ा ब्लंडर देखने को मिला.","content":"WPL में देखने को मिला DRS ब्लंडर! विमेंस प्रीमियर लीग में मुंबई इंडियंस और यूपी वॉरियर्स के बीच मुकाबला खेला जा रहा है. मुंबई ने अब तक इस लीग में कोई भी मैच नहीं गवाया है. यूपी ने इस मैच में टॉस जीतकर पहले बल्लेबाज़ी करते हुए 159 रन बनाए. इसी बीच मुंबई इंडियंस की बल्लेबाज़ी के चौथे ही ओवर में DRS को लेकर बड़ा ब्लंडर देखने को मिला. जब चौथे ओवर की पांचवीं गेंद पर सोफी एक्लेस्टन ने फुलर लैंथ गेंद फेंकी और मैथ्यूज़ ने इस गेंद पर डिफेंस किया लेकिन यूपी वॉरियर्स ने LBW की अपील कर दी. अंपायर ने अपील को नकार दिया. लेकिन रिव्यू में दिखा कि गेंद मैथ्यूज़ के बल्ले के बीचों बीच लगी है. इसके बावजूद LBW चेक किया गया और हौरानी तो तब हुई जब मैथ्यूज़ को आउट दे दिया गया. लेकिन हेली फिर भी मैदान पर खड़ी रहीं. दोबारा से DRS चेक किया गया तो पता चला कि किसी दूसरी बॉल का DRS दिखाया जा रहा था. अब अंपायर को अपना फैसला बदलना पड़ा और मैथ्यूज़ को नॉटआउट दिया गया. इससे पहले हेली रनआउट होने से भी बचीं. वैसे क्रिकेट इतिहास में ये पहली बार हुआ है जब किसी DRS के फैसले को बदलने के लिए थर्ड अंपायर ने मैदानी अंपायर को रेफर किया फैसला और फिर ग्राउंड अंपायर ने फिर से DRS लिया. On field umpire - Not out. Review taken... Third - Out. taken again... Third umpire - Not out. Comedy of errors.😹 Director shows Reverse footage first after taking DRS in WPL match this shows ball hits Shoe first and given Heally Mathews OUT And Than shown actuall footage which shows ball hit bat first Is this the first time there has been a DRS for a DRS?? What's happening?? Is this the first time there has been a DRS for a DRS?? What's happening?? First time I see a DRS decision being reversed! Ever! Was first given out after DRS review, but the batters questioned it, umpires reverted back to off field umpire for 2nd review. Decision was reversed. WPL 2023 coming with innovation hey! * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-12 18:35:12","image_url":"https://c.ndtvimg.com/2023-03/0kd1825g_drs_625x300_12_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL: Top knocks from Harmanpreet, Nat Sciver help MI down UP Warriorz by eight wickets","link":"https://thenewsmill.com/2023/03/wpl-top-knocks-from-harmanpreet-nat-sciver-help-mi-down-up-warriorz-by-eight-wickets/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"An unbeaten half-century from skipper Harmanpreet Kaur and fiery knocks from Yastika Bhatia and Nat-Sciver Brunt helped Mumbai Indians clinch their fourth successive win in the Women’s Premier League (WPL), as they defeated UP Warriorz by eight wickets on Sunday. With this win, MI is at the top of the points table with four wins in four games and total of eight points. UP Warriorz is at the third position, with two wins in four matches, two losses and a total of four points. In chase of 160 runs, Mumbai Indians started really well. Openers Yastika Bhatia and Hayley Matthews gave the side start they needed. Matthews hit Rajeshwari Gayakwad for two fours in the first over. But after that, Yastika lit up the stadium with some clean hitting. The wicketkeeper-batter smashed Shabnim Ismail, the world’s fastest bowler in women’s cricket, for three straight overs in the sixth over, bringing up the 50-run opening stand in 5.3 overs. At the end of the powerplay, MI was at 51/0, with Yastika (36*) and Hayley (11*) unbeaten. After the powerplay, MI lost their openers. Yastika was dismissed by Rajeshwari for a quickfire 42 off 27 balls after being caught by Simran Shaikh at deep-midwicket. MI was 58/1 at that point. Soon, world’s number one T20I bowler Sophie Ecclestone caught and bowled a struggling Matthews for 12 off 17 balls. MI was 58/2 at that point. Following this, skipper Harmanpreet Kaur and Nat-Sciver Brunt was the fresh pair on the crease. At the end of their 10 overs, MI was 72/2, with Sciver-Brunt (4*) and skipper Harmanpreet (7*) unbeaten. Brunt and Harman started to build a partnership, with the English star as the aggressor. MI touched the 100-run mark in 13.1 overs. Harman and Sciver also brought up their 50-run stand in just 41 balls. Harmanpreet accelerated with three straight boundaries. At the end of 15 overs, MI was 123/2, with Harmanpreet (31*) and Nat-Sciver (28*) at the crease. They needed 37 runs in the final five overs. Tahlia McGrath was smashed for 19 runs in the 16th over, including a wide and three fours and a six by Harmanpreet. This brought down the deficit to 18 runs in final four overs. Kaur brought up her fifty in 32 balls, with nine fours and one six. MI was able to chase down the target easily and finished their innings at 164/2 in 17.3 overs. Harmanpreet scored an unbeaten 53 off 33 balls, while Nat-Sciver finished at 45* in 31 balls, consisting of six fours and a six. They had a hard-hitting stand of 106 runs in 61 balls. Sophie and Gayakwad took a wicket each for UP. Earlier, half-centuries from skipper Alyssa Healy and Tahlia McGrath powered UP Warriorz to a modest 159/6 at the end of their 20 overs against Mumbai Indians in their Women’s Premier League (WPL) match in Mumbai on Sunday. After electing to bat first, UP Warriorz was off to a bad start. Spinner Saika Ishaque, the Purple Cup holder in WPL 2023, rolled her golden arm to trap Devika Vaidya leg-before wicket for just six runs off five balls. UPW was reduced 8/1 in two overs. Alyssa Healy, the skipper, then started rebuilding the innings in the company of Kiran Navgire. Healy smashed Saika for three straight fours in the fourth over. At the end of the powerplay, UPW was at 48/1, with Healy (30*) and Kiran Navgire (7*) unbeaten. UPW crossed the 50-run mark in 6.2 overs thanks to a six from Navgire. After the powerplay, Navgire tried to up the ante by hitting Amelia Kerr for a four and six. But the bowler had the last laugh as she dismissed Navgire for 17 off 14 balls after she was caught by wicketkeeper Yastika Bhatia. UPW was 58/2 in 6.4 overs. Tahlia McGrath, the world’s number one T20I batter was next up on the crease. In the ninth over, Tahlia smashed Amelia for three boundaries. At the end of 10 overs, UPW was at 58/2, with McGrath (22*) and McGrath (33*) unbeaten at the crease. UPW reached the 100-run mark with help of a four from McGrath in 11.5 overs. he Australian duo brought up their 50-run stand as well. Healy brought up her half-century in just 36 balls, studded with seven fours and a six. At the end of 15 overs, UPW was at 133/2, with Healy (53*) and McGrath (48*) unbeaten at the crease. Saika ended the 82-run stand between Healy and McGrath in the 17th over. She dismissed Healy for 58 off 46 balls and followed it up with McGrath’s scalp for 50 off 37 balls. Her strikes reduced UPW to 141/4 in 16.5 overs. Half of the UPW batting line-up was inside the hut after Sophie Ecclestone was dismissed for just one run by Hayley Matthews. UPW was 146/5 in 18 overs. UPW crossed 150-run mark in 18.3 overs. UPW ended the innings at 159/6. Deepti Sharma was dismissed for just seven by Amelia on the third ball of the final over. Shweta Sehrawat (2*) and Simran Shaikh (9*) were unbeaten at the close of their innings. Saika was the pick of the bowlers for MI, with 3/33 in her four overs. Kerr took two wickets while Hayley got one. Brief Scores: UPW: 159/6 (Alyssa Healy 58, Tahlia McGrath 50, Saika Ishaque 3/33) vs MI. (ANI)","pubDate":"2023-03-12 18:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}