{"newsArray":[{"article_id":"164681f10344f73b1979983b73117147","title":"Marsh centurion sinks Bangladesh, Australia keeps winning","link":"https://www.fbcnews.com.fj/sports/cricket/marsh-centurion-sinks-bangladesh-australia-keeps-winning/","keywords":["Cricket"],"creator":["Timoci Batibasaga"],"video_url":null,"description":"Mitchell Marsh blasted his second big century of the World Cup as Australia primed themselves for the semi-finals by cruising to their seventh straight victory with an eight-wicket win over Bangladesh. Australia lost Travis Head early in their chase of 307 but fellow opener David Warner (53) and Marsh (177 not out) forged a 120-run […]","content":"Mitchell Marsh blasted his second big century of the World Cup as Australia primed themselves for the semi-finals by cruising to their seventh straight victory with an eight-wicket win over Bangladesh. Australia lost Travis Head early in their chase of 307 but fellow opener David Warner (53) and Marsh (177 not out) forged a 120-run partnership for the second wicket before the five-time world champions comfortably got home in 44.4 overs. Australia skipper Pat Cummins heaped praise on Marsh and struck a confident tone ahead of the semi-finals. Marsh reached his third one-day international century in 87 deliveries and ended with 17 fours and nine sixes as he turned the screws on Bangladesh in a 175-run stand with Steve Smith (63 not out), who returned to the side after a bout of vertigo. Marsh had briefly returned home last week following his grandfather’s death. Towhid Hridoy earlier scored his maiden half-century of the tournament on his way to 74 at Pune’s MCA Stadium, as Bangladesh finished with 306-8 from 50 overs in the final group game for both sides. Australia gave explosive batsman Glenn Maxwell another day off ahead of their semi-final with South Africa in Kolkata on Nov. 16, while Sean Abbott (2-61) had a good match replacing Mitchell Starc. Bangladesh’s top-order all made solid starts after Cummins won the toss and opted to bowl as Tanzid Hasan (36), Litton Das (36), Najmul Hossain Shanto (45) and Mahmudullah (32) took advantage of the helpful conditions. Leg-spinner Adam Zampa (2-32) snared Mushfiqur Rahim to bag his 22nd victim and emerge as the top wicket-taker after Marnus Labuschagne threw a spanner in the works by superbly effecting two run-outs. Hridoy ensured Bangladesh had a good platform to build on and the 22-year-old struck five fours and two sixes in his 79-ball knock but was caught in the deep while looking to accelerate in the 47th over. Bangladesh finished with their best total of the tournament, only to suffer disappointment as Australia comfortably chased down their target with overs to spare.","pubDate":"2023-11-11 19:24:05","image_url":null,"source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"ecb31e328cbb399020f5dc3ae39ee869","title":"'England find the blueprint at the bitter end'","link":"https://www.bbc.co.uk/sport/cricket/67393790","keywords":null,"creator":null,"video_url":null,"description":"England's World Cup campaign was shrouded with confusion but they found a blueprint that helped them avoid falling apart like previous sides.","content":"England end World Cup with win over Pakistan It turns out David Willey nearly did not get on the plane to get to the World Cup. The real England did not arrive in India until it was time to go home. Throughout England's campaign there has been confusion. There have been various theories for what made the defending champions lose six of their first seven games - a collective loss of form, poor preparation, The Hundred, bad decisions and a mix of all of the above and more. Now there is uncertainty at how to feel after they saved their best performance for the day before they fly home. England beat Pakistan for consolation win Where does England's campaign rank in disappointing exits? World Cup Daily podcast: Willey bows out with win & Australia looking strong Frustration that it has come now? Disappointment? Or simply pleasure in another World Cup win which avoids further embarrassment? \"Definitely frustration,\" said coach Matthew Mott. \"We know we're a very good team and unfortunately when it mattered the most, we didn't perform as well as we would have liked.\" With the bat in Kolkata, England were as close to their 2019 World Cup-winning selves as we have seen across five weeks in India. As he did in victory against the Netherlands on Wednesday, Jos Buttler won the toss and opted to bat first. They scored 337-9 with a good opening partnership, built on in the middle overs before an attack at the end. Early wickets with the ball then set them on the way to a comfortable victory against the side that will finish fifth in the tournament. Those muddled minds of the opening weeks, when England were spooked into wanting to chase by the dew in Ahmedabad against New Zealand, were gone. This was the blueprint. This is what could have been. In the week of Diwali, England finally found the light. But then again, it is always easier to think clearly when it does not matter and the pressure is off. Sport is about performing when it matters. No-one remembers the goalscorers in the last World Cup third-place play-off - Mislav Orsic and Josko Gvardiol, if you're wondering. They remember Angel di Maria, Kylian Mbappe and Lionel Messi. \"We're incredibly disappointed,\" Mott added. \"We came here with certain expectations and haven't delivered on that. \"I'm really proud of the way the guys finished and showed a lot of tenacity and resilience when we were out of the tournament a couple of weeks ago.\" Watch best moments of Stokes' 84 against Pakistan It should not be forgotten that both of England's warm-up games in India were impacted by rain in Guwahati. This squad's only preparation for this World Cup was four, low-key matches against New Zealand in England in September. Still, their XI in the opening game had never played together before. Mott said he had \"no doubt\" things would have been different had the preparation been better. \"But I'm not sure how that's possible given we have to give back to the domestic game,\" he added. \"We don't want to take our players out when they can be playing. \"We play the cards we're dealt. We don't make the schedules. And it's certainly not an excuse.\" Mott admitted there were \"learnings\" he would take from his time in India - things he would improve if given the chance again in four years. He refused to reveal them, leaving us to ponder whether some blame lies with muddled selections, calls at the toss or the preparation, though the Australian admitted the timing of the board's central contract announcement \"was not fantastic\". Willey takes 100th ODI wicket in final England appearance That call left Willey as the only member of the 15-man squad without a deal and led to him announcing his retirement while England's hopes were still alive in Bengaluru. \"If I'm being brutally honest I wasn't sure whether I was going to come to the World Cup even to the 11th hour - the morning that we were joining up at Lord's,\" Willey said. \"It's not just that I haven't been offered a contract. \"It's how I feel valued as an England player there when I look down that list of other guys that have got contracts.\" And with others who will be desperate to play at the next World Cup on the sidelines, it was Willey who struck with the second ball of Pakistan's chase. Two further wickets, Fakhar Zaman caught at mid-off and Salman Agha at mid-on, took him to 100 one-day international wickets in his final game. \"It was nice to be able to go out there with clarity on what I'm doing beyond this,\" said Willey, who was given the honour of leading England out onto the field. \"My situation with England has always been, I know I'm on the fringe, I'm next in if there's an injury, very much a squad player and I've been very much at peace with that. \"But it doesn't mean it's easy to be in that position, never knowing where you stand from tour to tour. \"So, look, to go out there and just be able to enjoy my last game of cricket for England was lovely - the boys have been great.\" Perhaps that last line is what matters the most as England exit. At the end, Buttler stood alone on the boundary edge for a moment looking out across the iconic Eden Gardens before his team-mate Ben Stokes put an arm around him, followed by four heartfelt pats on the back. This tournament has been brutally tough for England and, in particular, Buttler, who had to answer whether he was still the right man to be skipper a year on from winning the T20 World Cup in Australia. In Ashes series past, England teams have fallen apart when things turned sour. This one, once the greatest England have produced in white-ball cricket, did not. That is something we can cling to.","pubDate":"2023-11-11 19:22:53","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b1aef3af92bd56281e9c6e11a9853dbb","title":"Woakes Surpasses Botham To Become England's Most Successful Bowler In WC","link":"https://sports.ndtv.com/cricket/chris-woakes-surpasses-ian-botham-to-become-englands-most-successful-bowler-in-world-cups-4567703","keywords":null,"creator":null,"video_url":null,"description":"Chris Woakes became England's most successful bowler in World Cups as he surpassed former all-rounder Ian Botham","content":"Chris Woakes became England's most successful bowler in World Cups as he surpassed former all-rounder Ian Botham after claiming a single wicket during England's 93-run victory over Pakistan at the iconic Eden Gardens. Woakes' 31st wicket was the final dismissal of the night as he bowled a slower off delivery, Haris Rauf slogged it with full strength trying to clear the boundary but his shot went straight to Ben Stokes at mid-on. In England's last game against the Netherlands, he levelled Botham's record of 30 wickets for England which he picked during his decorated career. With 29 wickets right-arm pacer Phil Defreitas holds the second spot while James Anderson who still continues to put up performance for England in the Test format has claimed 27 wickets for the Three Lions in the World Cup. Spinner Adil Rashid has 26 wickets to his name while pacer Mark Wood has 24 wickets. Coming to the match, while chasing a target of 338, David Willey in his last international game made Pakistan batters toil hard as they had no answers to his quick swinging deliveries. He made the most of the opportunity as he dismissed Abdullah Shafique and Fakhar Azam back to the pavilion for scores of 0 and 1 respectively. Skipper Babar Azam and Mohammad Rizwan stitched up a 51-run partnership driving Pakistan's innings with hopes of ending it on a positive note. Rizwan held on to his wicket on the other end along with Saud Shakeel . Another promising yet short liver partnership ended with Rizwan walking back to the pavilion. The 25-year-old Gus Atkinson provided the breakthrough to derail Pakistan's innings by dismissing Babar for 38. Adil Rashid's spin bamboozled Shakeel (29) while Agha Salman 's promising knock of 51 was brought to an end by Willey. The rest of the batters crumbled except for Shaheen Sha Afridi and Haris Rauf who showed some fight towards the end. Afridi's cameo of 25 ended as Atkinson claimed his second wicket of the night, while Rauf's fireworks took Pakistan's score past 200 but his valiant 35-run knock came to an end with Chris Woakes picking up the final wicket.","pubDate":"2023-11-11 18:55:02","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c0516386097bfba8cb68560f408ed5c8","title":"\"Can't Judge Middle-order By Numbers': Dravid On India's WC Campaign","link":"https://sports.ndtv.com/cricket/cant-judge-middle-order-by-numbers-rahul-dravid-on-indias-cricket-world-cup-campaign-4567701","keywords":null,"creator":null,"video_url":null,"description":"Dravid was not worried about the fact that the numbers of players like Rahul and Iyer were not as glossy as some other batters in the side.","content":"There was a hint of concern surrounding the Indian middle-order, particularly around KL Rahul and Shreyas Iyer ahead of the World Cup, but head coach Rahul Dravid on Saturday expressed his delight over the manner in which they responded to the task at the showpiece. Rahul returned from a tendon injury during the recent Asia Cup while Iyer had to battle against a back spasm before getting fit just in time for the marquee event. While they have not set the stage ablaze, Rahul's tally of 245 runs and Iyer's 293 runs have allowed India a good degree of batting solidity in the tournament. \"How well your middle-order performs in challenging situations under pressure, is going to probably decide how well you do. While our top order batters performed exceptionally well, I think our middle-order played very critical roles,\" Dravid said. Dravid was not worried about the fact that the numbers of players like Rahul and Iyer were not as glossy as some other batters in the side. \"You can't judge them by numbers. It only gives you half of the picture, but it's actually some of those 30s, 40s, critical knocks. I can look back at the contributions of our middle-order and they'll come only in sort of spurts -- a Shreyas (Iyer), or a KL (Rahul), or a Surya ( Suryakumar Yadav ), and Jaddu's ( Ravindra Jadeja ) important knock in Dharamsala. These small things actually what really gives you those ticks,\" said Dravid. The former Indian captain was impressed the way Iyer made his comeback into the side after his injury to make some vital contributions. \"He brings temperament -- one of the things Shreyas has shown us from the time I have seen him at India A -- the way he handles success and failure. He's able to bring the best out of himself under those pressure situations,\" said Dravid. \"Guys like that who have incredible temperament and strength of mind, and I think that's what has held him in really good stead. He's terrific temperamentally. So, when someone like him does well, you know he's going to make big contribution,\" he added. Apart from Rahul and Iyer, India also had injury worries over pacer Jasprit Bumrah and left-arm spinner Jadeja in the run-up to the World Cup. Advertisement But both the players recovered well in time to play in the quadrennial big bash, and made a telling impact. Bumrah's spells -- in the Power Play or at the death -- have given India an undeniable edge, and the 29-year-old so far has taken 15 wickets from eight matches. Dravid acknowledged the effort these players have put in to make a comeback and also credited the National Cricket Academy and team support staff for helping them recover efficiently. \"Obviously, a lot of thought and planning have gone into it. You need a little bit of luck as well. I think it's been great for us to have those guys back fit and ready just in time for this tournament. Our margins were tight,\" he said. \"We knew that some of them would be coming in just at the Asia Cup and prior to this tournament. So, we had to make some contingency plans. \"But the fact that they were able to come into this tournament is a tribute and to their own hard work, the efforts of the NCA, the physios, the trainers for ensuring that, we stuck to those timelines,\" he said. Dravid said the Indian side responded nicely to the challenges despite losing left-arm spinner Axar Patel ahead of the tournament and all-rounder Hardik Pandya during the event to injuries. \"At the World Test Championship, we missed a couple of guys. Even here we have missed a couple of guys, one before the tournament and one during the tournament. But we've been able to respond really well so far. \"It's not easy. Sometimes people think, oh, it's easy to get injured players playing. It's not that simple. You know, when you have an injury in normal life and getting back to normal office work is easy, but getting back to people to professional sport is not easy. So, well done to everyone so far,\" he said. Dravid was also impressed with the way India managed to adapt to conditions across different venues during this tournament. India have played all their eight matches so far at different stadiums and Bengaluru will be their ninth in as many games. \"I think we've maintained some really high standards -- in terms of our execution and intensity. I think we've travelled the length and breadth of this country and played in eight venues. This is our ninth venue. We know we have nine boxes to tick, and we've ticked eight,\" he concluded.","pubDate":"2023-11-11 18:51:56","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3c330fba65fc42cab6d7439e1f8ea925","title":"England send Pakistan crashing out of World Cup with thumping win","link":"https://thefrontierpost.com/england-send-pakistan-crashing-out-of-world-cup-with-thumping-win/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"Monitoring Desk Kolkata: England sent Pakistan crashing out of the World Cup with a convincing 93-run win as Ben Stokes and David Willey helped their team end their miserable title defence on a high in Kolkata on Saturday. Stokes, who came out of ODI retirement for the World Cup, scored 84 while Joe Root hit […]","content":"Monitoring Desk Kolkata: England sent Pakistan crashing out of the World Cup with a convincing 93-run win as Ben Stokes and David Willey helped their team end their miserable title defence on a high in Kolkata on Saturday. Stokes, who came out of ODI retirement for the World Cup, scored 84 while Joe Root hit 60 to lift England to an impressive 337-9 in their 50 overs before Pakistan folded on 244 in 43.3 overs. Willey, who already announced he will retire from international cricket after the World Cup, removed Pakistan openers Abdullah Shafique (nought) and Fakhar Zaman (one) before dismissing Agha Salman for 51 to finish with 3-56. With Salman’s wicket, Willey also completed 100 wickets in his 73rd ODI. Fellow fast bowler Gus Atkinson (2-45) had Babar Azam for 38, caught at short mid-wicket off a miscued pull to end the Pakistan skipper’s below-par tournament on 320 runs with four fifties but without a century. Spinners Moeen Ali (2-60) and Adil Rashid (2-55) took care of the middle-order as only Salman defied the bowling with a fighting 45-ball knock studded with six boundaries and a six. Tail-enders Shaheen Shah Afridi scored 27 and Haris Rauf made 35 to at least take Pakistan past the 200-mark. Ali removed Mohammad Rizwan for a 51-ball 36 and Iftikhar Ahmed for three while Rashid had Saud Shakeel bowled round his legs for 29 before bowling Shadab Khan for four with a googly. Pakistan started the day needing to beat England by 287 runs in order to squeeze into the semi-finals on net run-rate but that escape route was immediately closed when Jos Buttler won the toss and chose to bat first. As a result, New Zealand became the fourth team into the semi-finals and will face undefeated India in Mumbai on November 15. A day later, Australia and South Africa will meet in the other semi-final in Kolkata. Stokes — dropped on 10 by Shaheen off his own bowling — rode his luck during a 76-ball innings. – Wayward bowling – Root added a 72-ball 60 after England won the toss and batted. Stokes and Root built on a solid opening stand of 82 between Jonny Bairstow (59) and Dawid Malan (31), taking full advantage of a slow Eden Gardens pitch and some wayward bowling. Bairstow hit seven boundaries and a six in his 61-ball knock — his second fifty in an otherwise lacklustre performance in the tournament. Malan was the first to go, miscuing a reverse sweep off spinner Iftikhar Ahmed while Bairstow was caught in the covers off Rauf, Pakistan’s best bowler with 3-64. Once Stokes, who came out of ODI retirement for the World Cup, got a life he continued to bat like he did during his century against the Netherlands in Pune three days ago, cracking 11 boundaries and two sixes. He was finally yorked by Shaheen in the 41st over after adding 132 for the third wicket with Root. Root hit four boundaries in his third half century of the World Cup before he was caught off a leading edge against Shaheen who finished with 2-72. Harry Brook made 30, with two sixes and as many fours, and Buttler hit 27 with a six and three boundaries as the pair added a quick 45 with England scoring 97 runs in the last ten overs. Pakistan finished in fifth place in the 10-nation table while England are a further two places down, but still able to qualify for the 2025 Champions Trophy.","pubDate":"2023-11-11 18:46:08","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"f97cb39aa82fa17eb8de503167b25350","title":"Australia Face Happy Selection Headache Ahead Of WC Semifinal: Pat Cummins","link":"https://sports.ndtv.com/cricket/australia-face-happy-selection-headache-ahead-of-cricket-world-cup-2023-semifinal-pat-cummins-4567187","keywords":null,"creator":null,"video_url":null,"description":"Pat Cummins on Saturday conceded Australia will be facing selection headaches going into their World Cup semifinal against South Africa.","content":"Pat Cummins on Saturday conceded Australia will be facing selection headaches going into their World Cup semifinal against South Africa, after Mitchell Marsh's 177 not out powered the five-time champions to a commanding eight-wicket win against Bangladesh in the last league game. Australia, who began the World Cup campaign with two losses on the trot, have now seven consecutive wins and will face South Africa in the second semifinal at the iconic Eden Gardens in Kolkata on November 16. Marsh's 177 not out (132 balls, 17x4s, 9x6s) follows a stunning knock of 201 not out from all-rounder Glenn Maxwell against Afghanistan in Mumbai last week, who single-handedly made the bulk of the runs when Australia were reduced to 91 for seven chasing 292. \"We thought it was a really good wicket and thought we could get that total. All 15 players have played this tournament now and we go up to Kolkata, re-assess and perhaps a few selection headaches there,\" Cummins said at post-match presentation ceremony. With injury to Travis Head (hand) and Marsh returning home during their World Cup campaign due to a personal loss, it was only in their last two matches that Australia finally had their preferred squad of 15 at their disposal. Maxwell, who struggled with severe cramps all over his body in his monumental knock against Afghanistan, will be in mix for the semifinal along with Marsh. The 'selection headache' originates from the fact that both Maxwell and Marsh have struck two centuries each in the World Cup. \"He (Mitchell Marsh) played beautifully and the tempo he played with was sustainable and the way he finished off the innings, it's a scary prospect to have him next week,\" Cummins said. \"(Winning) seven games in a row, I think chasing 300 was something really special and everything is clicking together,\" said Cummins after Australia recorded their highest successful chase in World Cup history. Marsh said he was surprised to have been named the Man of the Match after a costly spell with the ball in the first half of the match. \"It's rare that you'd win the Man of the Match award after going for nearly fifty from 4 overs, but I would want to contribute more to the team. It was important for me to back myself at (No) 3, knowing when Head comes back, I'll have to go down. Have failed a few times, but have backed myself to perform,\" he said. \"Sure my mum and dad would be watching back home and they would be happy with this, my grandpop (who died last week) was a great man and I'm sure he'd be happy out there,\" he added. Advertisement \"I think we're peaking well at the moment and looking forward to the semi-finals in Kolkata,\" he added. Stand-in captain Najmul Hossain Shanto said Bangladesh will look into all their league stage games for improvement after they finished eighth with two wins and seven defeats. \"It's disappointing, we didn't play our best this tournament. We will see what we can do better from now,\" he said. \"Mahmuduallah batted really well in this World Cup and Shakib (Al Hasan) also bowled well in a couple of games. We have to improve as a team. It is not about individual performances, we want to look at the nine games and work on areas we need to improve,\" he said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-11 18:41:46","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3378c62fa7ad0479eb430001c41e3c80","title":"Waqar Younis, Shahid Afridi May Get Roles In PCB And National Team: Report","link":"https://sports.ndtv.com/cricket/waqar-younis-shahid-afridi-may-get-roles-in-pcb-and-national-team-after-cricket-world-cup-2023-report-4567309","keywords":null,"creator":null,"video_url":null,"description":"Former cricketers Waqar Younis, Aqib Javed and Shahid Afridi are under consideration for important posts in the Pakistan Board and team set-up after the World Cup, says report.","content":"Former cricketers Waqar Younis, Aqib Javed and Shahid Afridi are under consideration for important posts in the Pakistan Board and team set-up after the World Cup, it has been learnt. The names of Younis Khan and Azhar Ali are also doing the rounds as a new set up will be in place as soon as the interim arrangement ends. The Zaka Ashraf-led 12-member committee, running the PCB, has got a three-month extension which will end in February next year. A PCB insider said important positions including chief selector, Director of cricket and coaching staff of the national side will be up for grabs. \"After the World Cup since the Pakistan squad has to leave for Australia and New Zealand. Zaka Ashraf who heads the cricket management committee running the Pakistan Cricket Board affairs has already started discussing possible plans and appointments for the future,\" the insider said. The source said that even the name of Shoaib Malik was under consideration for either captain or coach of the national T20 side. Zaka the decisions will made after consulting former players and an evaluation of team's performance at the Asia Cup and the World Cup will be done. While Waqar has served as head coach of the Pakistan team twice, Aqib and Younis have also worked as bowling and batting coaches with the team in the past. Babar has come in for criticism over his captaincy and leadership skills and also batting form in the World Cup though he has defended himself. His comments at a press conference on Friday have not gone well with former stalwarts Wasim Akram and Shahid Afridi, who on Saturday advised him to just perform on the field. The duo said that instead of making comments Babar must understand the importance of focusing on playing well and delivering performances that silence critics, rather than engaging in verbal exchanges. \"I don't think Babar needs to give any response, he should just concentrate on playing well so that no one can criticise you,\" Afridi said. Akram said that Babar must understand that, \"If you do well, everything goes fine. But if you don't, then you have to be answerable to people and in the media.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-11 18:34:07","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c0f6e2ad5e53ad92d0194522f115cf46","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.northwalespioneer.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"Head coach Matthew Mott accepts England’s World Cup disappointment could represent “a line in the sand moment” for an ageing side. England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.northwalespioneer.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ad38b485cf80df6dcb1279214a1e394","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.southwalesguardian.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"Head coach Matthew Mott accepts England’s World Cup disappointment could represent “a line in the sand moment” for an ageing side. England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.southwalesguardian.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0be00d2eefa13a4a24cce3de48aaec69","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.echo-news.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.echo-news.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"164681f10344f73b1979983b73117147","title":"Marsh centurion sinks Bangladesh, Australia keeps winning","link":"https://www.fbcnews.com.fj/sports/cricket/marsh-centurion-sinks-bangladesh-australia-keeps-winning/","keywords":["Cricket"],"creator":["Timoci Batibasaga"],"video_url":null,"description":"Mitchell Marsh blasted his second big century of the World Cup as Australia primed themselves for the semi-finals by cruising to their seventh straight victory with an eight-wicket win over Bangladesh. Australia lost Travis Head early in their chase of 307 but fellow opener David Warner (53) and Marsh (177 not out) forged a 120-run […]","content":"Mitchell Marsh blasted his second big century of the World Cup as Australia primed themselves for the semi-finals by cruising to their seventh straight victory with an eight-wicket win over Bangladesh. Australia lost Travis Head early in their chase of 307 but fellow opener David Warner (53) and Marsh (177 not out) forged a 120-run partnership for the second wicket before the five-time world champions comfortably got home in 44.4 overs. Australia skipper Pat Cummins heaped praise on Marsh and struck a confident tone ahead of the semi-finals. Marsh reached his third one-day international century in 87 deliveries and ended with 17 fours and nine sixes as he turned the screws on Bangladesh in a 175-run stand with Steve Smith (63 not out), who returned to the side after a bout of vertigo. Marsh had briefly returned home last week following his grandfather’s death. Towhid Hridoy earlier scored his maiden half-century of the tournament on his way to 74 at Pune’s MCA Stadium, as Bangladesh finished with 306-8 from 50 overs in the final group game for both sides. Australia gave explosive batsman Glenn Maxwell another day off ahead of their semi-final with South Africa in Kolkata on Nov. 16, while Sean Abbott (2-61) had a good match replacing Mitchell Starc. Bangladesh’s top-order all made solid starts after Cummins won the toss and opted to bowl as Tanzid Hasan (36), Litton Das (36), Najmul Hossain Shanto (45) and Mahmudullah (32) took advantage of the helpful conditions. Leg-spinner Adam Zampa (2-32) snared Mushfiqur Rahim to bag his 22nd victim and emerge as the top wicket-taker after Marnus Labuschagne threw a spanner in the works by superbly effecting two run-outs. Hridoy ensured Bangladesh had a good platform to build on and the 22-year-old struck five fours and two sixes in his 79-ball knock but was caught in the deep while looking to accelerate in the 47th over. Bangladesh finished with their best total of the tournament, only to suffer disappointment as Australia comfortably chased down their target with overs to spare.","pubDate":"2023-11-11 19:24:05","image_url":null,"source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"ecb31e328cbb399020f5dc3ae39ee869","title":"'England find the blueprint at the bitter end'","link":"https://www.bbc.co.uk/sport/cricket/67393790","keywords":null,"creator":null,"video_url":null,"description":"England's World Cup campaign was shrouded with confusion but they found a blueprint that helped them avoid falling apart like previous sides.","content":"England end World Cup with win over Pakistan It turns out David Willey nearly did not get on the plane to get to the World Cup. The real England did not arrive in India until it was time to go home. Throughout England's campaign there has been confusion. There have been various theories for what made the defending champions lose six of their first seven games - a collective loss of form, poor preparation, The Hundred, bad decisions and a mix of all of the above and more. Now there is uncertainty at how to feel after they saved their best performance for the day before they fly home. England beat Pakistan for consolation win Where does England's campaign rank in disappointing exits? World Cup Daily podcast: Willey bows out with win & Australia looking strong Frustration that it has come now? Disappointment? Or simply pleasure in another World Cup win which avoids further embarrassment? \"Definitely frustration,\" said coach Matthew Mott. \"We know we're a very good team and unfortunately when it mattered the most, we didn't perform as well as we would have liked.\" With the bat in Kolkata, England were as close to their 2019 World Cup-winning selves as we have seen across five weeks in India. As he did in victory against the Netherlands on Wednesday, Jos Buttler won the toss and opted to bat first. They scored 337-9 with a good opening partnership, built on in the middle overs before an attack at the end. Early wickets with the ball then set them on the way to a comfortable victory against the side that will finish fifth in the tournament. Those muddled minds of the opening weeks, when England were spooked into wanting to chase by the dew in Ahmedabad against New Zealand, were gone. This was the blueprint. This is what could have been. In the week of Diwali, England finally found the light. But then again, it is always easier to think clearly when it does not matter and the pressure is off. Sport is about performing when it matters. No-one remembers the goalscorers in the last World Cup third-place play-off - Mislav Orsic and Josko Gvardiol, if you're wondering. They remember Angel di Maria, Kylian Mbappe and Lionel Messi. \"We're incredibly disappointed,\" Mott added. \"We came here with certain expectations and haven't delivered on that. \"I'm really proud of the way the guys finished and showed a lot of tenacity and resilience when we were out of the tournament a couple of weeks ago.\" Watch best moments of Stokes' 84 against Pakistan It should not be forgotten that both of England's warm-up games in India were impacted by rain in Guwahati. This squad's only preparation for this World Cup was four, low-key matches against New Zealand in England in September. Still, their XI in the opening game had never played together before. Mott said he had \"no doubt\" things would have been different had the preparation been better. \"But I'm not sure how that's possible given we have to give back to the domestic game,\" he added. \"We don't want to take our players out when they can be playing. \"We play the cards we're dealt. We don't make the schedules. And it's certainly not an excuse.\" Mott admitted there were \"learnings\" he would take from his time in India - things he would improve if given the chance again in four years. He refused to reveal them, leaving us to ponder whether some blame lies with muddled selections, calls at the toss or the preparation, though the Australian admitted the timing of the board's central contract announcement \"was not fantastic\". Willey takes 100th ODI wicket in final England appearance That call left Willey as the only member of the 15-man squad without a deal and led to him announcing his retirement while England's hopes were still alive in Bengaluru. \"If I'm being brutally honest I wasn't sure whether I was going to come to the World Cup even to the 11th hour - the morning that we were joining up at Lord's,\" Willey said. \"It's not just that I haven't been offered a contract. \"It's how I feel valued as an England player there when I look down that list of other guys that have got contracts.\" And with others who will be desperate to play at the next World Cup on the sidelines, it was Willey who struck with the second ball of Pakistan's chase. Two further wickets, Fakhar Zaman caught at mid-off and Salman Agha at mid-on, took him to 100 one-day international wickets in his final game. \"It was nice to be able to go out there with clarity on what I'm doing beyond this,\" said Willey, who was given the honour of leading England out onto the field. \"My situation with England has always been, I know I'm on the fringe, I'm next in if there's an injury, very much a squad player and I've been very much at peace with that. \"But it doesn't mean it's easy to be in that position, never knowing where you stand from tour to tour. \"So, look, to go out there and just be able to enjoy my last game of cricket for England was lovely - the boys have been great.\" Perhaps that last line is what matters the most as England exit. At the end, Buttler stood alone on the boundary edge for a moment looking out across the iconic Eden Gardens before his team-mate Ben Stokes put an arm around him, followed by four heartfelt pats on the back. This tournament has been brutally tough for England and, in particular, Buttler, who had to answer whether he was still the right man to be skipper a year on from winning the T20 World Cup in Australia. In Ashes series past, England teams have fallen apart when things turned sour. This one, once the greatest England have produced in white-ball cricket, did not. That is something we can cling to.","pubDate":"2023-11-11 19:22:53","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b1aef3af92bd56281e9c6e11a9853dbb","title":"Woakes Surpasses Botham To Become England's Most Successful Bowler In WC","link":"https://sports.ndtv.com/cricket/chris-woakes-surpasses-ian-botham-to-become-englands-most-successful-bowler-in-world-cups-4567703","keywords":null,"creator":null,"video_url":null,"description":"Chris Woakes became England's most successful bowler in World Cups as he surpassed former all-rounder Ian Botham","content":"Chris Woakes became England's most successful bowler in World Cups as he surpassed former all-rounder Ian Botham after claiming a single wicket during England's 93-run victory over Pakistan at the iconic Eden Gardens. Woakes' 31st wicket was the final dismissal of the night as he bowled a slower off delivery, Haris Rauf slogged it with full strength trying to clear the boundary but his shot went straight to Ben Stokes at mid-on. In England's last game against the Netherlands, he levelled Botham's record of 30 wickets for England which he picked during his decorated career. With 29 wickets right-arm pacer Phil Defreitas holds the second spot while James Anderson who still continues to put up performance for England in the Test format has claimed 27 wickets for the Three Lions in the World Cup. Spinner Adil Rashid has 26 wickets to his name while pacer Mark Wood has 24 wickets. Coming to the match, while chasing a target of 338, David Willey in his last international game made Pakistan batters toil hard as they had no answers to his quick swinging deliveries. He made the most of the opportunity as he dismissed Abdullah Shafique and Fakhar Azam back to the pavilion for scores of 0 and 1 respectively. Skipper Babar Azam and Mohammad Rizwan stitched up a 51-run partnership driving Pakistan's innings with hopes of ending it on a positive note. Rizwan held on to his wicket on the other end along with Saud Shakeel . Another promising yet short liver partnership ended with Rizwan walking back to the pavilion. The 25-year-old Gus Atkinson provided the breakthrough to derail Pakistan's innings by dismissing Babar for 38. Adil Rashid's spin bamboozled Shakeel (29) while Agha Salman 's promising knock of 51 was brought to an end by Willey. The rest of the batters crumbled except for Shaheen Sha Afridi and Haris Rauf who showed some fight towards the end. Afridi's cameo of 25 ended as Atkinson claimed his second wicket of the night, while Rauf's fireworks took Pakistan's score past 200 but his valiant 35-run knock came to an end with Chris Woakes picking up the final wicket.","pubDate":"2023-11-11 18:55:02","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c0516386097bfba8cb68560f408ed5c8","title":"\"Can't Judge Middle-order By Numbers': Dravid On India's WC Campaign","link":"https://sports.ndtv.com/cricket/cant-judge-middle-order-by-numbers-rahul-dravid-on-indias-cricket-world-cup-campaign-4567701","keywords":null,"creator":null,"video_url":null,"description":"Dravid was not worried about the fact that the numbers of players like Rahul and Iyer were not as glossy as some other batters in the side.","content":"There was a hint of concern surrounding the Indian middle-order, particularly around KL Rahul and Shreyas Iyer ahead of the World Cup, but head coach Rahul Dravid on Saturday expressed his delight over the manner in which they responded to the task at the showpiece. Rahul returned from a tendon injury during the recent Asia Cup while Iyer had to battle against a back spasm before getting fit just in time for the marquee event. While they have not set the stage ablaze, Rahul's tally of 245 runs and Iyer's 293 runs have allowed India a good degree of batting solidity in the tournament. \"How well your middle-order performs in challenging situations under pressure, is going to probably decide how well you do. While our top order batters performed exceptionally well, I think our middle-order played very critical roles,\" Dravid said. Dravid was not worried about the fact that the numbers of players like Rahul and Iyer were not as glossy as some other batters in the side. \"You can't judge them by numbers. It only gives you half of the picture, but it's actually some of those 30s, 40s, critical knocks. I can look back at the contributions of our middle-order and they'll come only in sort of spurts -- a Shreyas (Iyer), or a KL (Rahul), or a Surya ( Suryakumar Yadav ), and Jaddu's ( Ravindra Jadeja ) important knock in Dharamsala. These small things actually what really gives you those ticks,\" said Dravid. The former Indian captain was impressed the way Iyer made his comeback into the side after his injury to make some vital contributions. \"He brings temperament -- one of the things Shreyas has shown us from the time I have seen him at India A -- the way he handles success and failure. He's able to bring the best out of himself under those pressure situations,\" said Dravid. \"Guys like that who have incredible temperament and strength of mind, and I think that's what has held him in really good stead. He's terrific temperamentally. So, when someone like him does well, you know he's going to make big contribution,\" he added. Apart from Rahul and Iyer, India also had injury worries over pacer Jasprit Bumrah and left-arm spinner Jadeja in the run-up to the World Cup. Advertisement But both the players recovered well in time to play in the quadrennial big bash, and made a telling impact. Bumrah's spells -- in the Power Play or at the death -- have given India an undeniable edge, and the 29-year-old so far has taken 15 wickets from eight matches. Dravid acknowledged the effort these players have put in to make a comeback and also credited the National Cricket Academy and team support staff for helping them recover efficiently. \"Obviously, a lot of thought and planning have gone into it. You need a little bit of luck as well. I think it's been great for us to have those guys back fit and ready just in time for this tournament. Our margins were tight,\" he said. \"We knew that some of them would be coming in just at the Asia Cup and prior to this tournament. So, we had to make some contingency plans. \"But the fact that they were able to come into this tournament is a tribute and to their own hard work, the efforts of the NCA, the physios, the trainers for ensuring that, we stuck to those timelines,\" he said. Dravid said the Indian side responded nicely to the challenges despite losing left-arm spinner Axar Patel ahead of the tournament and all-rounder Hardik Pandya during the event to injuries. \"At the World Test Championship, we missed a couple of guys. Even here we have missed a couple of guys, one before the tournament and one during the tournament. But we've been able to respond really well so far. \"It's not easy. Sometimes people think, oh, it's easy to get injured players playing. It's not that simple. You know, when you have an injury in normal life and getting back to normal office work is easy, but getting back to people to professional sport is not easy. So, well done to everyone so far,\" he said. Dravid was also impressed with the way India managed to adapt to conditions across different venues during this tournament. India have played all their eight matches so far at different stadiums and Bengaluru will be their ninth in as many games. \"I think we've maintained some really high standards -- in terms of our execution and intensity. I think we've travelled the length and breadth of this country and played in eight venues. This is our ninth venue. We know we have nine boxes to tick, and we've ticked eight,\" he concluded.","pubDate":"2023-11-11 18:51:56","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3c330fba65fc42cab6d7439e1f8ea925","title":"England send Pakistan crashing out of World Cup with thumping win","link":"https://thefrontierpost.com/england-send-pakistan-crashing-out-of-world-cup-with-thumping-win/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"Monitoring Desk Kolkata: England sent Pakistan crashing out of the World Cup with a convincing 93-run win as Ben Stokes and David Willey helped their team end their miserable title defence on a high in Kolkata on Saturday. Stokes, who came out of ODI retirement for the World Cup, scored 84 while Joe Root hit […]","content":"Monitoring Desk Kolkata: England sent Pakistan crashing out of the World Cup with a convincing 93-run win as Ben Stokes and David Willey helped their team end their miserable title defence on a high in Kolkata on Saturday. Stokes, who came out of ODI retirement for the World Cup, scored 84 while Joe Root hit 60 to lift England to an impressive 337-9 in their 50 overs before Pakistan folded on 244 in 43.3 overs. Willey, who already announced he will retire from international cricket after the World Cup, removed Pakistan openers Abdullah Shafique (nought) and Fakhar Zaman (one) before dismissing Agha Salman for 51 to finish with 3-56. With Salman’s wicket, Willey also completed 100 wickets in his 73rd ODI. Fellow fast bowler Gus Atkinson (2-45) had Babar Azam for 38, caught at short mid-wicket off a miscued pull to end the Pakistan skipper’s below-par tournament on 320 runs with four fifties but without a century. Spinners Moeen Ali (2-60) and Adil Rashid (2-55) took care of the middle-order as only Salman defied the bowling with a fighting 45-ball knock studded with six boundaries and a six. Tail-enders Shaheen Shah Afridi scored 27 and Haris Rauf made 35 to at least take Pakistan past the 200-mark. Ali removed Mohammad Rizwan for a 51-ball 36 and Iftikhar Ahmed for three while Rashid had Saud Shakeel bowled round his legs for 29 before bowling Shadab Khan for four with a googly. Pakistan started the day needing to beat England by 287 runs in order to squeeze into the semi-finals on net run-rate but that escape route was immediately closed when Jos Buttler won the toss and chose to bat first. As a result, New Zealand became the fourth team into the semi-finals and will face undefeated India in Mumbai on November 15. A day later, Australia and South Africa will meet in the other semi-final in Kolkata. Stokes — dropped on 10 by Shaheen off his own bowling — rode his luck during a 76-ball innings. – Wayward bowling – Root added a 72-ball 60 after England won the toss and batted. Stokes and Root built on a solid opening stand of 82 between Jonny Bairstow (59) and Dawid Malan (31), taking full advantage of a slow Eden Gardens pitch and some wayward bowling. Bairstow hit seven boundaries and a six in his 61-ball knock — his second fifty in an otherwise lacklustre performance in the tournament. Malan was the first to go, miscuing a reverse sweep off spinner Iftikhar Ahmed while Bairstow was caught in the covers off Rauf, Pakistan’s best bowler with 3-64. Once Stokes, who came out of ODI retirement for the World Cup, got a life he continued to bat like he did during his century against the Netherlands in Pune three days ago, cracking 11 boundaries and two sixes. He was finally yorked by Shaheen in the 41st over after adding 132 for the third wicket with Root. Root hit four boundaries in his third half century of the World Cup before he was caught off a leading edge against Shaheen who finished with 2-72. Harry Brook made 30, with two sixes and as many fours, and Buttler hit 27 with a six and three boundaries as the pair added a quick 45 with England scoring 97 runs in the last ten overs. Pakistan finished in fifth place in the 10-nation table while England are a further two places down, but still able to qualify for the 2025 Champions Trophy.","pubDate":"2023-11-11 18:46:08","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"f97cb39aa82fa17eb8de503167b25350","title":"Australia Face Happy Selection Headache Ahead Of WC Semifinal: Pat Cummins","link":"https://sports.ndtv.com/cricket/australia-face-happy-selection-headache-ahead-of-cricket-world-cup-2023-semifinal-pat-cummins-4567187","keywords":null,"creator":null,"video_url":null,"description":"Pat Cummins on Saturday conceded Australia will be facing selection headaches going into their World Cup semifinal against South Africa.","content":"Pat Cummins on Saturday conceded Australia will be facing selection headaches going into their World Cup semifinal against South Africa, after Mitchell Marsh's 177 not out powered the five-time champions to a commanding eight-wicket win against Bangladesh in the last league game. Australia, who began the World Cup campaign with two losses on the trot, have now seven consecutive wins and will face South Africa in the second semifinal at the iconic Eden Gardens in Kolkata on November 16. Marsh's 177 not out (132 balls, 17x4s, 9x6s) follows a stunning knock of 201 not out from all-rounder Glenn Maxwell against Afghanistan in Mumbai last week, who single-handedly made the bulk of the runs when Australia were reduced to 91 for seven chasing 292. \"We thought it was a really good wicket and thought we could get that total. All 15 players have played this tournament now and we go up to Kolkata, re-assess and perhaps a few selection headaches there,\" Cummins said at post-match presentation ceremony. With injury to Travis Head (hand) and Marsh returning home during their World Cup campaign due to a personal loss, it was only in their last two matches that Australia finally had their preferred squad of 15 at their disposal. Maxwell, who struggled with severe cramps all over his body in his monumental knock against Afghanistan, will be in mix for the semifinal along with Marsh. The 'selection headache' originates from the fact that both Maxwell and Marsh have struck two centuries each in the World Cup. \"He (Mitchell Marsh) played beautifully and the tempo he played with was sustainable and the way he finished off the innings, it's a scary prospect to have him next week,\" Cummins said. \"(Winning) seven games in a row, I think chasing 300 was something really special and everything is clicking together,\" said Cummins after Australia recorded their highest successful chase in World Cup history. Marsh said he was surprised to have been named the Man of the Match after a costly spell with the ball in the first half of the match. \"It's rare that you'd win the Man of the Match award after going for nearly fifty from 4 overs, but I would want to contribute more to the team. It was important for me to back myself at (No) 3, knowing when Head comes back, I'll have to go down. Have failed a few times, but have backed myself to perform,\" he said. \"Sure my mum and dad would be watching back home and they would be happy with this, my grandpop (who died last week) was a great man and I'm sure he'd be happy out there,\" he added. Advertisement \"I think we're peaking well at the moment and looking forward to the semi-finals in Kolkata,\" he added. Stand-in captain Najmul Hossain Shanto said Bangladesh will look into all their league stage games for improvement after they finished eighth with two wins and seven defeats. \"It's disappointing, we didn't play our best this tournament. We will see what we can do better from now,\" he said. \"Mahmuduallah batted really well in this World Cup and Shakib (Al Hasan) also bowled well in a couple of games. We have to improve as a team. It is not about individual performances, we want to look at the nine games and work on areas we need to improve,\" he said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-11 18:41:46","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3378c62fa7ad0479eb430001c41e3c80","title":"Waqar Younis, Shahid Afridi May Get Roles In PCB And National Team: Report","link":"https://sports.ndtv.com/cricket/waqar-younis-shahid-afridi-may-get-roles-in-pcb-and-national-team-after-cricket-world-cup-2023-report-4567309","keywords":null,"creator":null,"video_url":null,"description":"Former cricketers Waqar Younis, Aqib Javed and Shahid Afridi are under consideration for important posts in the Pakistan Board and team set-up after the World Cup, says report.","content":"Former cricketers Waqar Younis, Aqib Javed and Shahid Afridi are under consideration for important posts in the Pakistan Board and team set-up after the World Cup, it has been learnt. The names of Younis Khan and Azhar Ali are also doing the rounds as a new set up will be in place as soon as the interim arrangement ends. The Zaka Ashraf-led 12-member committee, running the PCB, has got a three-month extension which will end in February next year. A PCB insider said important positions including chief selector, Director of cricket and coaching staff of the national side will be up for grabs. \"After the World Cup since the Pakistan squad has to leave for Australia and New Zealand. Zaka Ashraf who heads the cricket management committee running the Pakistan Cricket Board affairs has already started discussing possible plans and appointments for the future,\" the insider said. The source said that even the name of Shoaib Malik was under consideration for either captain or coach of the national T20 side. Zaka the decisions will made after consulting former players and an evaluation of team's performance at the Asia Cup and the World Cup will be done. While Waqar has served as head coach of the Pakistan team twice, Aqib and Younis have also worked as bowling and batting coaches with the team in the past. Babar has come in for criticism over his captaincy and leadership skills and also batting form in the World Cup though he has defended himself. His comments at a press conference on Friday have not gone well with former stalwarts Wasim Akram and Shahid Afridi, who on Saturday advised him to just perform on the field. The duo said that instead of making comments Babar must understand the importance of focusing on playing well and delivering performances that silence critics, rather than engaging in verbal exchanges. \"I don't think Babar needs to give any response, he should just concentrate on playing well so that no one can criticise you,\" Afridi said. Akram said that Babar must understand that, \"If you do well, everything goes fine. But if you don't, then you have to be answerable to people and in the media.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-11 18:34:07","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c0f6e2ad5e53ad92d0194522f115cf46","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.northwalespioneer.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"Head coach Matthew Mott accepts England’s World Cup disappointment could represent “a line in the sand moment” for an ageing side. England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.northwalespioneer.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ad38b485cf80df6dcb1279214a1e394","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.southwalesguardian.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"Head coach Matthew Mott accepts England’s World Cup disappointment could represent “a line in the sand moment” for an ageing side. England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.southwalesguardian.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0be00d2eefa13a4a24cce3de48aaec69","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.echo-news.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.echo-news.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"164681f10344f73b1979983b73117147","title":"Marsh centurion sinks Bangladesh, Australia keeps winning","link":"https://www.fbcnews.com.fj/sports/cricket/marsh-centurion-sinks-bangladesh-australia-keeps-winning/","keywords":["Cricket"],"creator":["Timoci Batibasaga"],"video_url":null,"description":"Mitchell Marsh blasted his second big century of the World Cup as Australia primed themselves for the semi-finals by cruising to their seventh straight victory with an eight-wicket win over Bangladesh. Australia lost Travis Head early in their chase of 307 but fellow opener David Warner (53) and Marsh (177 not out) forged a 120-run […]","content":"Mitchell Marsh blasted his second big century of the World Cup as Australia primed themselves for the semi-finals by cruising to their seventh straight victory with an eight-wicket win over Bangladesh. Australia lost Travis Head early in their chase of 307 but fellow opener David Warner (53) and Marsh (177 not out) forged a 120-run partnership for the second wicket before the five-time world champions comfortably got home in 44.4 overs. Australia skipper Pat Cummins heaped praise on Marsh and struck a confident tone ahead of the semi-finals. Marsh reached his third one-day international century in 87 deliveries and ended with 17 fours and nine sixes as he turned the screws on Bangladesh in a 175-run stand with Steve Smith (63 not out), who returned to the side after a bout of vertigo. Marsh had briefly returned home last week following his grandfather’s death. Towhid Hridoy earlier scored his maiden half-century of the tournament on his way to 74 at Pune’s MCA Stadium, as Bangladesh finished with 306-8 from 50 overs in the final group game for both sides. Australia gave explosive batsman Glenn Maxwell another day off ahead of their semi-final with South Africa in Kolkata on Nov. 16, while Sean Abbott (2-61) had a good match replacing Mitchell Starc. Bangladesh’s top-order all made solid starts after Cummins won the toss and opted to bowl as Tanzid Hasan (36), Litton Das (36), Najmul Hossain Shanto (45) and Mahmudullah (32) took advantage of the helpful conditions. Leg-spinner Adam Zampa (2-32) snared Mushfiqur Rahim to bag his 22nd victim and emerge as the top wicket-taker after Marnus Labuschagne threw a spanner in the works by superbly effecting two run-outs. Hridoy ensured Bangladesh had a good platform to build on and the 22-year-old struck five fours and two sixes in his 79-ball knock but was caught in the deep while looking to accelerate in the 47th over. Bangladesh finished with their best total of the tournament, only to suffer disappointment as Australia comfortably chased down their target with overs to spare.","pubDate":"2023-11-11 19:24:05","image_url":null,"source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"ecb31e328cbb399020f5dc3ae39ee869","title":"'England find the blueprint at the bitter end'","link":"https://www.bbc.co.uk/sport/cricket/67393790","keywords":null,"creator":null,"video_url":null,"description":"England's World Cup campaign was shrouded with confusion but they found a blueprint that helped them avoid falling apart like previous sides.","content":"England end World Cup with win over Pakistan It turns out David Willey nearly did not get on the plane to get to the World Cup. The real England did not arrive in India until it was time to go home. Throughout England's campaign there has been confusion. There have been various theories for what made the defending champions lose six of their first seven games - a collective loss of form, poor preparation, The Hundred, bad decisions and a mix of all of the above and more. Now there is uncertainty at how to feel after they saved their best performance for the day before they fly home. England beat Pakistan for consolation win Where does England's campaign rank in disappointing exits? World Cup Daily podcast: Willey bows out with win & Australia looking strong Frustration that it has come now? Disappointment? Or simply pleasure in another World Cup win which avoids further embarrassment? \"Definitely frustration,\" said coach Matthew Mott. \"We know we're a very good team and unfortunately when it mattered the most, we didn't perform as well as we would have liked.\" With the bat in Kolkata, England were as close to their 2019 World Cup-winning selves as we have seen across five weeks in India. As he did in victory against the Netherlands on Wednesday, Jos Buttler won the toss and opted to bat first. They scored 337-9 with a good opening partnership, built on in the middle overs before an attack at the end. Early wickets with the ball then set them on the way to a comfortable victory against the side that will finish fifth in the tournament. Those muddled minds of the opening weeks, when England were spooked into wanting to chase by the dew in Ahmedabad against New Zealand, were gone. This was the blueprint. This is what could have been. In the week of Diwali, England finally found the light. But then again, it is always easier to think clearly when it does not matter and the pressure is off. Sport is about performing when it matters. No-one remembers the goalscorers in the last World Cup third-place play-off - Mislav Orsic and Josko Gvardiol, if you're wondering. They remember Angel di Maria, Kylian Mbappe and Lionel Messi. \"We're incredibly disappointed,\" Mott added. \"We came here with certain expectations and haven't delivered on that. \"I'm really proud of the way the guys finished and showed a lot of tenacity and resilience when we were out of the tournament a couple of weeks ago.\" Watch best moments of Stokes' 84 against Pakistan It should not be forgotten that both of England's warm-up games in India were impacted by rain in Guwahati. This squad's only preparation for this World Cup was four, low-key matches against New Zealand in England in September. Still, their XI in the opening game had never played together before. Mott said he had \"no doubt\" things would have been different had the preparation been better. \"But I'm not sure how that's possible given we have to give back to the domestic game,\" he added. \"We don't want to take our players out when they can be playing. \"We play the cards we're dealt. We don't make the schedules. And it's certainly not an excuse.\" Mott admitted there were \"learnings\" he would take from his time in India - things he would improve if given the chance again in four years. He refused to reveal them, leaving us to ponder whether some blame lies with muddled selections, calls at the toss or the preparation, though the Australian admitted the timing of the board's central contract announcement \"was not fantastic\". Willey takes 100th ODI wicket in final England appearance That call left Willey as the only member of the 15-man squad without a deal and led to him announcing his retirement while England's hopes were still alive in Bengaluru. \"If I'm being brutally honest I wasn't sure whether I was going to come to the World Cup even to the 11th hour - the morning that we were joining up at Lord's,\" Willey said. \"It's not just that I haven't been offered a contract. \"It's how I feel valued as an England player there when I look down that list of other guys that have got contracts.\" And with others who will be desperate to play at the next World Cup on the sidelines, it was Willey who struck with the second ball of Pakistan's chase. Two further wickets, Fakhar Zaman caught at mid-off and Salman Agha at mid-on, took him to 100 one-day international wickets in his final game. \"It was nice to be able to go out there with clarity on what I'm doing beyond this,\" said Willey, who was given the honour of leading England out onto the field. \"My situation with England has always been, I know I'm on the fringe, I'm next in if there's an injury, very much a squad player and I've been very much at peace with that. \"But it doesn't mean it's easy to be in that position, never knowing where you stand from tour to tour. \"So, look, to go out there and just be able to enjoy my last game of cricket for England was lovely - the boys have been great.\" Perhaps that last line is what matters the most as England exit. At the end, Buttler stood alone on the boundary edge for a moment looking out across the iconic Eden Gardens before his team-mate Ben Stokes put an arm around him, followed by four heartfelt pats on the back. This tournament has been brutally tough for England and, in particular, Buttler, who had to answer whether he was still the right man to be skipper a year on from winning the T20 World Cup in Australia. In Ashes series past, England teams have fallen apart when things turned sour. This one, once the greatest England have produced in white-ball cricket, did not. That is something we can cling to.","pubDate":"2023-11-11 19:22:53","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b1aef3af92bd56281e9c6e11a9853dbb","title":"Woakes Surpasses Botham To Become England's Most Successful Bowler In WC","link":"https://sports.ndtv.com/cricket/chris-woakes-surpasses-ian-botham-to-become-englands-most-successful-bowler-in-world-cups-4567703","keywords":null,"creator":null,"video_url":null,"description":"Chris Woakes became England's most successful bowler in World Cups as he surpassed former all-rounder Ian Botham","content":"Chris Woakes became England's most successful bowler in World Cups as he surpassed former all-rounder Ian Botham after claiming a single wicket during England's 93-run victory over Pakistan at the iconic Eden Gardens. Woakes' 31st wicket was the final dismissal of the night as he bowled a slower off delivery, Haris Rauf slogged it with full strength trying to clear the boundary but his shot went straight to Ben Stokes at mid-on. In England's last game against the Netherlands, he levelled Botham's record of 30 wickets for England which he picked during his decorated career. With 29 wickets right-arm pacer Phil Defreitas holds the second spot while James Anderson who still continues to put up performance for England in the Test format has claimed 27 wickets for the Three Lions in the World Cup. Spinner Adil Rashid has 26 wickets to his name while pacer Mark Wood has 24 wickets. Coming to the match, while chasing a target of 338, David Willey in his last international game made Pakistan batters toil hard as they had no answers to his quick swinging deliveries. He made the most of the opportunity as he dismissed Abdullah Shafique and Fakhar Azam back to the pavilion for scores of 0 and 1 respectively. Skipper Babar Azam and Mohammad Rizwan stitched up a 51-run partnership driving Pakistan's innings with hopes of ending it on a positive note. Rizwan held on to his wicket on the other end along with Saud Shakeel . Another promising yet short liver partnership ended with Rizwan walking back to the pavilion. The 25-year-old Gus Atkinson provided the breakthrough to derail Pakistan's innings by dismissing Babar for 38. Adil Rashid's spin bamboozled Shakeel (29) while Agha Salman 's promising knock of 51 was brought to an end by Willey. The rest of the batters crumbled except for Shaheen Sha Afridi and Haris Rauf who showed some fight towards the end. Afridi's cameo of 25 ended as Atkinson claimed his second wicket of the night, while Rauf's fireworks took Pakistan's score past 200 but his valiant 35-run knock came to an end with Chris Woakes picking up the final wicket.","pubDate":"2023-11-11 18:55:02","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c0516386097bfba8cb68560f408ed5c8","title":"\"Can't Judge Middle-order By Numbers': Dravid On India's WC Campaign","link":"https://sports.ndtv.com/cricket/cant-judge-middle-order-by-numbers-rahul-dravid-on-indias-cricket-world-cup-campaign-4567701","keywords":null,"creator":null,"video_url":null,"description":"Dravid was not worried about the fact that the numbers of players like Rahul and Iyer were not as glossy as some other batters in the side.","content":"There was a hint of concern surrounding the Indian middle-order, particularly around KL Rahul and Shreyas Iyer ahead of the World Cup, but head coach Rahul Dravid on Saturday expressed his delight over the manner in which they responded to the task at the showpiece. Rahul returned from a tendon injury during the recent Asia Cup while Iyer had to battle against a back spasm before getting fit just in time for the marquee event. While they have not set the stage ablaze, Rahul's tally of 245 runs and Iyer's 293 runs have allowed India a good degree of batting solidity in the tournament. \"How well your middle-order performs in challenging situations under pressure, is going to probably decide how well you do. While our top order batters performed exceptionally well, I think our middle-order played very critical roles,\" Dravid said. Dravid was not worried about the fact that the numbers of players like Rahul and Iyer were not as glossy as some other batters in the side. \"You can't judge them by numbers. It only gives you half of the picture, but it's actually some of those 30s, 40s, critical knocks. I can look back at the contributions of our middle-order and they'll come only in sort of spurts -- a Shreyas (Iyer), or a KL (Rahul), or a Surya ( Suryakumar Yadav ), and Jaddu's ( Ravindra Jadeja ) important knock in Dharamsala. These small things actually what really gives you those ticks,\" said Dravid. The former Indian captain was impressed the way Iyer made his comeback into the side after his injury to make some vital contributions. \"He brings temperament -- one of the things Shreyas has shown us from the time I have seen him at India A -- the way he handles success and failure. He's able to bring the best out of himself under those pressure situations,\" said Dravid. \"Guys like that who have incredible temperament and strength of mind, and I think that's what has held him in really good stead. He's terrific temperamentally. So, when someone like him does well, you know he's going to make big contribution,\" he added. Apart from Rahul and Iyer, India also had injury worries over pacer Jasprit Bumrah and left-arm spinner Jadeja in the run-up to the World Cup. Advertisement But both the players recovered well in time to play in the quadrennial big bash, and made a telling impact. Bumrah's spells -- in the Power Play or at the death -- have given India an undeniable edge, and the 29-year-old so far has taken 15 wickets from eight matches. Dravid acknowledged the effort these players have put in to make a comeback and also credited the National Cricket Academy and team support staff for helping them recover efficiently. \"Obviously, a lot of thought and planning have gone into it. You need a little bit of luck as well. I think it's been great for us to have those guys back fit and ready just in time for this tournament. Our margins were tight,\" he said. \"We knew that some of them would be coming in just at the Asia Cup and prior to this tournament. So, we had to make some contingency plans. \"But the fact that they were able to come into this tournament is a tribute and to their own hard work, the efforts of the NCA, the physios, the trainers for ensuring that, we stuck to those timelines,\" he said. Dravid said the Indian side responded nicely to the challenges despite losing left-arm spinner Axar Patel ahead of the tournament and all-rounder Hardik Pandya during the event to injuries. \"At the World Test Championship, we missed a couple of guys. Even here we have missed a couple of guys, one before the tournament and one during the tournament. But we've been able to respond really well so far. \"It's not easy. Sometimes people think, oh, it's easy to get injured players playing. It's not that simple. You know, when you have an injury in normal life and getting back to normal office work is easy, but getting back to people to professional sport is not easy. So, well done to everyone so far,\" he said. Dravid was also impressed with the way India managed to adapt to conditions across different venues during this tournament. India have played all their eight matches so far at different stadiums and Bengaluru will be their ninth in as many games. \"I think we've maintained some really high standards -- in terms of our execution and intensity. I think we've travelled the length and breadth of this country and played in eight venues. This is our ninth venue. We know we have nine boxes to tick, and we've ticked eight,\" he concluded.","pubDate":"2023-11-11 18:51:56","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3c330fba65fc42cab6d7439e1f8ea925","title":"England send Pakistan crashing out of World Cup with thumping win","link":"https://thefrontierpost.com/england-send-pakistan-crashing-out-of-world-cup-with-thumping-win/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"Monitoring Desk Kolkata: England sent Pakistan crashing out of the World Cup with a convincing 93-run win as Ben Stokes and David Willey helped their team end their miserable title defence on a high in Kolkata on Saturday. Stokes, who came out of ODI retirement for the World Cup, scored 84 while Joe Root hit […]","content":"Monitoring Desk Kolkata: England sent Pakistan crashing out of the World Cup with a convincing 93-run win as Ben Stokes and David Willey helped their team end their miserable title defence on a high in Kolkata on Saturday. Stokes, who came out of ODI retirement for the World Cup, scored 84 while Joe Root hit 60 to lift England to an impressive 337-9 in their 50 overs before Pakistan folded on 244 in 43.3 overs. Willey, who already announced he will retire from international cricket after the World Cup, removed Pakistan openers Abdullah Shafique (nought) and Fakhar Zaman (one) before dismissing Agha Salman for 51 to finish with 3-56. With Salman’s wicket, Willey also completed 100 wickets in his 73rd ODI. Fellow fast bowler Gus Atkinson (2-45) had Babar Azam for 38, caught at short mid-wicket off a miscued pull to end the Pakistan skipper’s below-par tournament on 320 runs with four fifties but without a century. Spinners Moeen Ali (2-60) and Adil Rashid (2-55) took care of the middle-order as only Salman defied the bowling with a fighting 45-ball knock studded with six boundaries and a six. Tail-enders Shaheen Shah Afridi scored 27 and Haris Rauf made 35 to at least take Pakistan past the 200-mark. Ali removed Mohammad Rizwan for a 51-ball 36 and Iftikhar Ahmed for three while Rashid had Saud Shakeel bowled round his legs for 29 before bowling Shadab Khan for four with a googly. Pakistan started the day needing to beat England by 287 runs in order to squeeze into the semi-finals on net run-rate but that escape route was immediately closed when Jos Buttler won the toss and chose to bat first. As a result, New Zealand became the fourth team into the semi-finals and will face undefeated India in Mumbai on November 15. A day later, Australia and South Africa will meet in the other semi-final in Kolkata. Stokes — dropped on 10 by Shaheen off his own bowling — rode his luck during a 76-ball innings. – Wayward bowling – Root added a 72-ball 60 after England won the toss and batted. Stokes and Root built on a solid opening stand of 82 between Jonny Bairstow (59) and Dawid Malan (31), taking full advantage of a slow Eden Gardens pitch and some wayward bowling. Bairstow hit seven boundaries and a six in his 61-ball knock — his second fifty in an otherwise lacklustre performance in the tournament. Malan was the first to go, miscuing a reverse sweep off spinner Iftikhar Ahmed while Bairstow was caught in the covers off Rauf, Pakistan’s best bowler with 3-64. Once Stokes, who came out of ODI retirement for the World Cup, got a life he continued to bat like he did during his century against the Netherlands in Pune three days ago, cracking 11 boundaries and two sixes. He was finally yorked by Shaheen in the 41st over after adding 132 for the third wicket with Root. Root hit four boundaries in his third half century of the World Cup before he was caught off a leading edge against Shaheen who finished with 2-72. Harry Brook made 30, with two sixes and as many fours, and Buttler hit 27 with a six and three boundaries as the pair added a quick 45 with England scoring 97 runs in the last ten overs. Pakistan finished in fifth place in the 10-nation table while England are a further two places down, but still able to qualify for the 2025 Champions Trophy.","pubDate":"2023-11-11 18:46:08","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"f97cb39aa82fa17eb8de503167b25350","title":"Australia Face Happy Selection Headache Ahead Of WC Semifinal: Pat Cummins","link":"https://sports.ndtv.com/cricket/australia-face-happy-selection-headache-ahead-of-cricket-world-cup-2023-semifinal-pat-cummins-4567187","keywords":null,"creator":null,"video_url":null,"description":"Pat Cummins on Saturday conceded Australia will be facing selection headaches going into their World Cup semifinal against South Africa.","content":"Pat Cummins on Saturday conceded Australia will be facing selection headaches going into their World Cup semifinal against South Africa, after Mitchell Marsh's 177 not out powered the five-time champions to a commanding eight-wicket win against Bangladesh in the last league game. Australia, who began the World Cup campaign with two losses on the trot, have now seven consecutive wins and will face South Africa in the second semifinal at the iconic Eden Gardens in Kolkata on November 16. Marsh's 177 not out (132 balls, 17x4s, 9x6s) follows a stunning knock of 201 not out from all-rounder Glenn Maxwell against Afghanistan in Mumbai last week, who single-handedly made the bulk of the runs when Australia were reduced to 91 for seven chasing 292. \"We thought it was a really good wicket and thought we could get that total. All 15 players have played this tournament now and we go up to Kolkata, re-assess and perhaps a few selection headaches there,\" Cummins said at post-match presentation ceremony. With injury to Travis Head (hand) and Marsh returning home during their World Cup campaign due to a personal loss, it was only in their last two matches that Australia finally had their preferred squad of 15 at their disposal. Maxwell, who struggled with severe cramps all over his body in his monumental knock against Afghanistan, will be in mix for the semifinal along with Marsh. The 'selection headache' originates from the fact that both Maxwell and Marsh have struck two centuries each in the World Cup. \"He (Mitchell Marsh) played beautifully and the tempo he played with was sustainable and the way he finished off the innings, it's a scary prospect to have him next week,\" Cummins said. \"(Winning) seven games in a row, I think chasing 300 was something really special and everything is clicking together,\" said Cummins after Australia recorded their highest successful chase in World Cup history. Marsh said he was surprised to have been named the Man of the Match after a costly spell with the ball in the first half of the match. \"It's rare that you'd win the Man of the Match award after going for nearly fifty from 4 overs, but I would want to contribute more to the team. It was important for me to back myself at (No) 3, knowing when Head comes back, I'll have to go down. Have failed a few times, but have backed myself to perform,\" he said. \"Sure my mum and dad would be watching back home and they would be happy with this, my grandpop (who died last week) was a great man and I'm sure he'd be happy out there,\" he added. Advertisement \"I think we're peaking well at the moment and looking forward to the semi-finals in Kolkata,\" he added. Stand-in captain Najmul Hossain Shanto said Bangladesh will look into all their league stage games for improvement after they finished eighth with two wins and seven defeats. \"It's disappointing, we didn't play our best this tournament. We will see what we can do better from now,\" he said. \"Mahmuduallah batted really well in this World Cup and Shakib (Al Hasan) also bowled well in a couple of games. We have to improve as a team. It is not about individual performances, we want to look at the nine games and work on areas we need to improve,\" he said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-11 18:41:46","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3378c62fa7ad0479eb430001c41e3c80","title":"Waqar Younis, Shahid Afridi May Get Roles In PCB And National Team: Report","link":"https://sports.ndtv.com/cricket/waqar-younis-shahid-afridi-may-get-roles-in-pcb-and-national-team-after-cricket-world-cup-2023-report-4567309","keywords":null,"creator":null,"video_url":null,"description":"Former cricketers Waqar Younis, Aqib Javed and Shahid Afridi are under consideration for important posts in the Pakistan Board and team set-up after the World Cup, says report.","content":"Former cricketers Waqar Younis, Aqib Javed and Shahid Afridi are under consideration for important posts in the Pakistan Board and team set-up after the World Cup, it has been learnt. The names of Younis Khan and Azhar Ali are also doing the rounds as a new set up will be in place as soon as the interim arrangement ends. The Zaka Ashraf-led 12-member committee, running the PCB, has got a three-month extension which will end in February next year. A PCB insider said important positions including chief selector, Director of cricket and coaching staff of the national side will be up for grabs. \"After the World Cup since the Pakistan squad has to leave for Australia and New Zealand. Zaka Ashraf who heads the cricket management committee running the Pakistan Cricket Board affairs has already started discussing possible plans and appointments for the future,\" the insider said. The source said that even the name of Shoaib Malik was under consideration for either captain or coach of the national T20 side. Zaka the decisions will made after consulting former players and an evaluation of team's performance at the Asia Cup and the World Cup will be done. While Waqar has served as head coach of the Pakistan team twice, Aqib and Younis have also worked as bowling and batting coaches with the team in the past. Babar has come in for criticism over his captaincy and leadership skills and also batting form in the World Cup though he has defended himself. His comments at a press conference on Friday have not gone well with former stalwarts Wasim Akram and Shahid Afridi, who on Saturday advised him to just perform on the field. The duo said that instead of making comments Babar must understand the importance of focusing on playing well and delivering performances that silence critics, rather than engaging in verbal exchanges. \"I don't think Babar needs to give any response, he should just concentrate on playing well so that no one can criticise you,\" Afridi said. Akram said that Babar must understand that, \"If you do well, everything goes fine. But if you don't, then you have to be answerable to people and in the media.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-11-11 18:34:07","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c0f6e2ad5e53ad92d0194522f115cf46","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.northwalespioneer.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"Head coach Matthew Mott accepts England’s World Cup disappointment could represent “a line in the sand moment” for an ageing side. England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.northwalespioneer.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ad38b485cf80df6dcb1279214a1e394","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.southwalesguardian.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"Head coach Matthew Mott accepts England’s World Cup disappointment could represent “a line in the sand moment” for an ageing side. England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.southwalesguardian.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0be00d2eefa13a4a24cce3de48aaec69","title":"Matthew Mott admits some ageing England players face ‘line in the sand moment’","link":"https://www.echo-news.co.uk/sport/national/23917767.matthew-mott-admits-ageing-england-players-face-line-sand-moment/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Eleven of the travelling England squad were aged 30 or older and the appetite for change will surely prove overwhelming.","content":"England arrived in India as reigning champions following the highs of 2019, but leave the country among the also-rans after racking up six defeats and three wins. They signed off with perhaps their best all-round display against a dangerous Pakistan side, posting 337 for nine at Eden Gardens and then bowling their opponents out for 244. We end our 2023 World Cup campaign with a win ✅ | — England Cricket (@englandcricket) But with 11 of the travelling squad aged 30 or older, the appetite for change will surely prove overwhelming. Mott was eager not to get caught up in specific cases before discussions have been held in private, but appreciates that David Willey’s retirement is unlikely to be the only change to the landscape. “We’ve got an opportunity to sit back and reflect and have individual conversations with all the players,” he said. “Win, lose or draw at this tournament, there was always going to be players that would look at this as a line in the sand moment. Every good squad has that blend of experience and youth. Four years is a long way so we always look to pick our best side, learn from where we’ve missed out on here and try to build on that with some good honest conversations about how we’re going to move forward as group.” Captain Jos Buttler was more guarded, suggesting he had no desire for mass change and a full-scale rebuild like the one his predecessor Eoin Morgan oversaw almost eight years ago. “The World Cup as a whole has been a disappointment, but it’s not going to be a drastic change of playing style, like 2015,” he said. “We know where we need to go. That doesn’t mean a huge clearout, it’s just pushing on from here.” Back-to-back victories over the Netherlands and Pakistan to finish the competition recovered a modicum of pride and, more importantly, secured Champions Trophy qualification for 2025. That took some of the heat off Mott and Buttler, whose partnership had begun to draw scrutiny during a five-match losing streak. Director of cricket Rob Key, who flew back out to join the team in Kolkata, is not thought to have any desire to axe a duo who won the T20 World Cup together last autumn, and all signs point to both avoiding martyrdom. Asked if he expected to stay in place, Mott said: “Absolutely, I do. If anything I’m more determined than ever. “We’ve had a poor tournament, but you can learn some great lessons from defeat. Not always do you learn as much about yourself while you’re in full flow. I think the character that has been shown by this group to fight back and show what we’re about. “And I think Jos has got a great future. You judge leadership in times that are tough and he’s continually tried to motivate the boys. He’s clearly disappointed with his own contribution, but none of that has affected the way he’s led the team. I’ve been really impressed by the way he’s kept the team together. He’s a player who is immensely talented and will bounce back.” Among those players whose futures are in the balance, Moeen Ali and Dawid Malan have publicly accepted that their time could be up, while Jonny Bairstow and Joe Root have gone on record aiming for the 2027 World Cup. Ben Stokes, meanwhile, has already retired once and was only tempted back by the prospect of defending the crown he helped win at Lord’s four years ago. He is heading back to England now for a long-awaited knee operation, but Mott is not taking it for granted that the Test captain will leave the 50-over format behind again. “I certainly haven’t heard otherwise,” he said. “He’s a key player and I think he’s really enjoyed it. He’s only been glowing about the environment we’ve got here. He’s got some work to do to get back to full fitness, but knowing what I know about him, he’s a very determined guy and I can’t wait to see him doing well over the next couple of years.”","pubDate":"2023-11-11 18:32:47","image_url":"https://www.echo-news.co.uk/resources/images/17383067/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"}]}