{"newsArray":[{"title":"Strikers dominate T20 phase of Pakistan Cup Women’s Cricket Tournament","link":"https://www.nation.com.pk/22-May-2023/strikers-dominate-t20-phase-of-pakistan-cup-women-s-cricket-tournament","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The T20 phase of the Pakistan Cup Women’s Cricket Tournament 2022-23 comprised four teams so the probables for the ACC Women’s Emerging Asia Cup in Hong Kong next month could get maximum match practice ahead of the all-important event.","content":"LAHORE-The T20 phase of the Pakistan Cup Women’s Cricket Tournament 2022-23 comprised four teams so the probables for the ACC Women’s Emerging Asia Cup in Hong Kong next month could get maximum match practice ahead of the all-important event. These emerging women cricketers, captained by Pakistan seamer Fatima Sana, formed Strikers and made the most of the opportunity by winning all three matches, defeating Challengers (42 runs), Blasters (nine wickets) and Dynamites (three runs) on Friday, Saturday and Sunday in Karachi. Shawaal Zulfiqar scored 74 off 52 balls (12 fours) and all-rounder Natalia Pervaiz hit 39 off 29 to lift Strikers to 171-6 before Anoosha Nasir’s 4-19 and Tuba Hasan’s 2-20 limited Sadia Iqbal-led Challengers to 129 at the Oval Academy Ground. They inflicted a thumping defeat on Blasters, skippered by Muneeba Ali, the next day, chasing 119 with as many as 9 wickets and 6 overs spare with Eyman Fatima smashing unbeaten 72 off 49 (9 fours and 3 sxies) and Sadaf Shamas hitting unbeaten 40 off 26 (6 fours and a six) in a 104-run stand. This young bunch displayed great nerves on Sunday when they secured a three-run win in a low-score affair at the State Bank Ground by limiting Sidra Amin’s Dynamites to 89 after posting 92-8. Umm-e-Hani took 3-18 and Syeda Aroob Shah took 2-17. Dynamites were the second best side with two wins – against Blasters, who remained winless, and Challengers, whose only win came on Sunday when they beat Blasters by a staggering 96 runs, thanks to Saima Malik’s 5-9. Former Pakistan captain and Dynamites batter Bismah Maroof accumulated the most runs (139) with back-to-back half-centuries while two Javerias – Rauf and Khan – made 134 and 109. Saima recorded the only five-wicket haul and the best figures with her 5-9 on Sunday. She finished with six wickets, the joint most with Dynamites leg-spinner Ghulam Fatima. The one-day phase of the Pakistan Cup Women’s Cricket Tournament commences tomorrow (Tuesday) with three teams – Challengers, Blasters and Dynamites – playing each other twice. The final will be played on June 4.","pubDate":"2023-05-21 21:24:18","image_url":"https://www.nation.com.pk/print_images/large/2023-05-22/strikers-dominate-t20-phase-of-pakistan-cup-women-s-cricket-tournament-1684704254-3270.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB confirms appointments to men’s selection committee","link":"https://www.nation.com.pk/22-May-2023/pcb-confirms-appointments-to-men-s-selection-committee","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE - The Pakistan Cricket Board (PCB) on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides.","content":"LAHORE - The Pakistan Cricket Board (PCB) on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides. The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant Bradburn (national men’s team’s head coach). The presence of Cheema, who has worked as strategy manager and data analyst in franchise cricket around the world, Arthur and Bradburn will aid in strategising for the approaching and upcoming series. The first task of the selection committee is to name the players for the fast and spin bowling camps next month in Lahore, which will be announced in due course.","pubDate":"2023-05-21 21:21:34","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"‘When he plays such shots, it’s a different Shubman Gill’: Gujarat Titans skipper Hardik Pandya praises centurion","link":"https://indianexpress.com/article/sports/ipl/when-he-plays-such-shots-its-a-different-shubman-gill-gujarat-titans-skipper-hardik-pandya-praises-centurion-8621725/?utm_source=FBBOT&utm_medium=Referral","keywords":["IPL 2023","Sports"],"creator":["Sports Desk"],"video_url":null,"description":"Gujarat needed a 52-ball 104 from Gill to seal victory after Virat Kohli scored his seventh IPL century to lead RCB to 197 for five in their 20 overs batting first.","content":"Gujarat Titans skipper Hardik Pandya was full of praise for his star batter Shubman Gill, who cracked a century to lead the team to a six-wicket victory over the Royal Challengers Bangalore in the final group stage game of the 2023 Indian Premier League on Sunday. While Gujarat had already sealed their top spot in the table, the defeat means RCB will not make the cut for the playoffs, with Mumbai Indians joining Gujarat, Chennai Super Kings and Lucknow Super Giants. Gujarat needed a blitzkrieg from Gill after Virat Kohli scored his seventh IPL century to lead RCB to 197 for five in their 20 overs batting first. Gill though slammed a 52-ball 104, while Vijay Shankar scored 53 in 35 in the rain-delayed match to seal victory. Speaking on the player of the match, Gujarat captain Pandya said: “He knows when he plays those cricketing shots, it’s a different Shubman Gill. He doesn’t give any chance and that gives confidence to the other batter as well.” He went on to add: “The calmness which the boys showed was terrific. We wanted to keep the momentum going. We have ticked a lot of boxes today. We would have taken 197 at the start, but we didn’t bowl well. It was a special innings from Kohli, but we went too early for the death overs. I can’t ask anything better from the boys. Last year, everything went well for us. We were expecting people to challenge us. The boys showed tremendous character.” Meanwhile, Gill spoke of the early season when the centuries were eluding him despite him being in form. Also Read IPL 2023, DC vs CSK emotional rollercoaster: When Dhoni advised Jadeja to... Watch: Gautam Gambhir responds to Virat Kohli chants from Eden Gardens crowd Karma will get back at you: Ravindra Jadeja's cryptic tweet a day after C... If I bowl only two overs....I also need some overs to heat up my batterie... “I am in good form, it’s about getting a start and converting it into a big one. It’s all working out for me in the business end of the tournament. You need to keep playing shots in T20 cricket. Earlier in the season, I was getting starts, 40s and so on. But the shots would go to fielders hands. I know my game, I will keep building on it. It’s going to be an exciting one, playing against Chennai in Chennai.”","pubDate":"2023-05-21 19:34:28","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Nottinghamshire up to fourth in Division One after draw against Essex","link":"https://www.independent.co.uk/sport/cricket/alastair-cook-sussex-essex-nottinghamshire-trent-bridge-b2343058.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Sir Alastair Cook scored 99 for the visitors at Trent Bridge.","content":"Nottinghamshire moved into fourth in the LV= Insurance County Championship Division One table after drawing against Essex . Having been 144 runs behind on the first innings, former England captain Sir Alastair Cook scored 99 alongside Tom Westley’s 95 to help Essex put on 362 for eight before declaring. With the hosts set 219 to chase in 39 overs, Nottinghamshire were 97 for four, still 122 runs short of their target, when the sides agreed to call it a day with five of the scheduled overs unbowled. In Division Two, Ajaz Patel finished with match figures of 10 for 209 as Durham cemented their position at the top with a 125-run triumph over Gloucestershire at Bristol. The hosts were bowled out for 300 before lunch despite Marcus Harris carrying his bat with an unbeaten 122 and putting on an eighth-wicket stand of 88 with Josh Shaw (44). However, New Zealand Test left-arm spinner Patel was able to follow up his five for 113 in the first innings with five for 96 as Durham earned their fourth victory in six games. Elsewhere, an extraordinary effort saw Glamorgan pile up a vast total of 737 to save their match against Sussex , which ended in a draw. Michael Neser became the third century-maker of the innings, following Marnus Labuschagne and Kiran Carlson, as Glamorgan turned a first-innings deficit of 358 into a lead of 379 against the weakened hosts. Any doubt about the outcome of the match had long gone by the time the players shook hands.","pubDate":"2023-05-21 18:24:26","image_url":"https://static.independent.co.uk/2023/05/21/19/433929dd9fdf2f20f1a8c8496c2a0565Y29udGVudHNlYXJjaGFwaSwxNjg0Nzc4MzA4-2.59477320.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cameron Green hits glorious matchwinning ton for Mumbai","link":"https://www.perthnow.com.au/sport/cricket/cameron-green-hits-glorious-matchwinning-ton-for-mumbai-c-10723094","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australia's gun allrounder Cameron Green has finally delivered his very best for Mumbai Indians with a glorious matchwinning Indian Premier League ton.","content":null,"pubDate":"2023-05-21 15:55:07","image_url":"https://images.perthnow.com.au/publication/C-10723094/0c08a516c1ea83b56743b860b7e6507ad2231eae-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket: Devonshire Recreation Defeat U/19","link":"https://bernews.com/2023/05/cricket-devonshire-recreation-defeats-under-19/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"The Bermuda Under 19 National Team were defeated by 1 wicket by the Devonshire Recreation Club. Batting first, the Under 19 team was bowled all out for 227. Jermal Proctor was the top scorer with 95, Proctor would score 17 boundaries, while Zakao Hart added 54. Lamont Brangman was the pick of the Devonshire Recreation Club […]","content":"The Bermuda Under 19 National Team were defeated by 1 wicket by the Devonshire Recreation Club. Batting first, the Under 19 team was bowled all out for 227. Jermal Proctor was the top scorer with 95, Proctor would score 17 boundaries, while Zakao Hart added 54. Lamont Brangman was the pick of the Devonshire Recreation Club bowlers with figures of 10-1-52-3. In reply, the Devonshire Recreation Club scored 228/9, a 135-run 4th wicket partnership between Ankoma Cannonier, and Clay Darrell took the Devonshire Recreation Club from 26/3 to 171/4. Cannonier was the top scorer with 73, he hit 10 fours, and 3 sixes off 61 balls, while Darrell scored 68 off 43, with 3 fours and 6 sixes. Proctor was the pick of the Under 19 bowlers with figures of 10-1-49-4, Dionte Dowling bowled 6.5-1-32-3. : ,","pubDate":"2023-05-21 15:00:17","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"Cricket SA names 15-player men’s Under-19 50-over squad to tour Bangladesh","link":"https://www.iol.co.za/sport/cricket/cricket-sa-names-15-player-mens-under-19-50-over-squad-to-tour-bangladesh-b338583d-3205-4b1a-afd7-fcde34731677","keywords":null,"creator":["Supplied"],"video_url":null,"description":"The announcement follows a four-day selection camp which was held at the Centre of Excellence in Pretoria this week.","content":null,"pubDate":"2023-05-21 13:55:30","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/ef777261-3365-5090-9fcc-7614f9f98382&operation=CROP&offset=0x95&resize=1902x1069","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"PCB makes three key appointments to national selection committee","link":"https://a-sports.tv/pcb-makes-three-key-appointments-to-national-selection-committee/","keywords":["Cricket","Sports","Top News","Top Picks","national selection committee","Pakistan national selection committee","Paksitan Cricket Board","Selection committee"],"creator":["A Sports"],"video_url":null,"description":"LAHORE: The Pakistan Cricket Board on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides. The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant […] The post PCB makes three key appointments to national selection committee appeared first on ASports.tv.","content":"LAHORE: The Pakistan Cricket Board on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides . The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant Bradburn (national men’s team’s head coach). The presence of Cheema, who has worked as strategy manager and data analyst in franchise cricket around the world, Arthur and Bradburn will aid in strategising for the approaching and upcoming series, enhance the bench strength and provide a proper pathway to performing players in Shaheens and U19 sides to graduate to the national side. The first task of the selection committee is to name the players for the fast and spin bowling camps next month in Lahore, which will be announced in due course. READ: Champions Barcelona suffer defeat at home ahead of trophy celebration","pubDate":"2023-05-21 13:04:52","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pics: Top Indian bowlers to get Purple Cap in IPL history","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/web-stories/top-indian-bowlers-to-get-purple-cap-in-ipl-history/photostory/100398259.cms","keywords":null,"creator":null,"video_url":null,"description":"Read more on TOI Sports","content":null,"pubDate":"2023-05-21 12:21:57","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"RCB vs GT Live: Toss at 7:45 pm IST and match to start at 8 pm IST","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/royal-challengers-bangalore-vs-gujarat-titans-live-score-ipl-2023-match-70-bengaluru/liveblog/100397894.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-21 12:01:56","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Strikers dominate T20 phase of Pakistan Cup Women’s Cricket Tournament","link":"https://www.nation.com.pk/22-May-2023/strikers-dominate-t20-phase-of-pakistan-cup-women-s-cricket-tournament","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The T20 phase of the Pakistan Cup Women’s Cricket Tournament 2022-23 comprised four teams so the probables for the ACC Women’s Emerging Asia Cup in Hong Kong next month could get maximum match practice ahead of the all-important event.","content":"LAHORE-The T20 phase of the Pakistan Cup Women’s Cricket Tournament 2022-23 comprised four teams so the probables for the ACC Women’s Emerging Asia Cup in Hong Kong next month could get maximum match practice ahead of the all-important event. These emerging women cricketers, captained by Pakistan seamer Fatima Sana, formed Strikers and made the most of the opportunity by winning all three matches, defeating Challengers (42 runs), Blasters (nine wickets) and Dynamites (three runs) on Friday, Saturday and Sunday in Karachi. Shawaal Zulfiqar scored 74 off 52 balls (12 fours) and all-rounder Natalia Pervaiz hit 39 off 29 to lift Strikers to 171-6 before Anoosha Nasir’s 4-19 and Tuba Hasan’s 2-20 limited Sadia Iqbal-led Challengers to 129 at the Oval Academy Ground. They inflicted a thumping defeat on Blasters, skippered by Muneeba Ali, the next day, chasing 119 with as many as 9 wickets and 6 overs spare with Eyman Fatima smashing unbeaten 72 off 49 (9 fours and 3 sxies) and Sadaf Shamas hitting unbeaten 40 off 26 (6 fours and a six) in a 104-run stand. This young bunch displayed great nerves on Sunday when they secured a three-run win in a low-score affair at the State Bank Ground by limiting Sidra Amin’s Dynamites to 89 after posting 92-8. Umm-e-Hani took 3-18 and Syeda Aroob Shah took 2-17. Dynamites were the second best side with two wins – against Blasters, who remained winless, and Challengers, whose only win came on Sunday when they beat Blasters by a staggering 96 runs, thanks to Saima Malik’s 5-9. Former Pakistan captain and Dynamites batter Bismah Maroof accumulated the most runs (139) with back-to-back half-centuries while two Javerias – Rauf and Khan – made 134 and 109. Saima recorded the only five-wicket haul and the best figures with her 5-9 on Sunday. She finished with six wickets, the joint most with Dynamites leg-spinner Ghulam Fatima. The one-day phase of the Pakistan Cup Women’s Cricket Tournament commences tomorrow (Tuesday) with three teams – Challengers, Blasters and Dynamites – playing each other twice. The final will be played on June 4.","pubDate":"2023-05-21 21:24:18","image_url":"https://www.nation.com.pk/print_images/large/2023-05-22/strikers-dominate-t20-phase-of-pakistan-cup-women-s-cricket-tournament-1684704254-3270.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB confirms appointments to men’s selection committee","link":"https://www.nation.com.pk/22-May-2023/pcb-confirms-appointments-to-men-s-selection-committee","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE - The Pakistan Cricket Board (PCB) on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides.","content":"LAHORE - The Pakistan Cricket Board (PCB) on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides. The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant Bradburn (national men’s team’s head coach). The presence of Cheema, who has worked as strategy manager and data analyst in franchise cricket around the world, Arthur and Bradburn will aid in strategising for the approaching and upcoming series. The first task of the selection committee is to name the players for the fast and spin bowling camps next month in Lahore, which will be announced in due course.","pubDate":"2023-05-21 21:21:34","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"‘When he plays such shots, it’s a different Shubman Gill’: Gujarat Titans skipper Hardik Pandya praises centurion","link":"https://indianexpress.com/article/sports/ipl/when-he-plays-such-shots-its-a-different-shubman-gill-gujarat-titans-skipper-hardik-pandya-praises-centurion-8621725/?utm_source=FBBOT&utm_medium=Referral","keywords":["IPL 2023","Sports"],"creator":["Sports Desk"],"video_url":null,"description":"Gujarat needed a 52-ball 104 from Gill to seal victory after Virat Kohli scored his seventh IPL century to lead RCB to 197 for five in their 20 overs batting first.","content":"Gujarat Titans skipper Hardik Pandya was full of praise for his star batter Shubman Gill, who cracked a century to lead the team to a six-wicket victory over the Royal Challengers Bangalore in the final group stage game of the 2023 Indian Premier League on Sunday. While Gujarat had already sealed their top spot in the table, the defeat means RCB will not make the cut for the playoffs, with Mumbai Indians joining Gujarat, Chennai Super Kings and Lucknow Super Giants. Gujarat needed a blitzkrieg from Gill after Virat Kohli scored his seventh IPL century to lead RCB to 197 for five in their 20 overs batting first. Gill though slammed a 52-ball 104, while Vijay Shankar scored 53 in 35 in the rain-delayed match to seal victory. Speaking on the player of the match, Gujarat captain Pandya said: “He knows when he plays those cricketing shots, it’s a different Shubman Gill. He doesn’t give any chance and that gives confidence to the other batter as well.” He went on to add: “The calmness which the boys showed was terrific. We wanted to keep the momentum going. We have ticked a lot of boxes today. We would have taken 197 at the start, but we didn’t bowl well. It was a special innings from Kohli, but we went too early for the death overs. I can’t ask anything better from the boys. Last year, everything went well for us. We were expecting people to challenge us. The boys showed tremendous character.” Meanwhile, Gill spoke of the early season when the centuries were eluding him despite him being in form. Also Read IPL 2023, DC vs CSK emotional rollercoaster: When Dhoni advised Jadeja to... Watch: Gautam Gambhir responds to Virat Kohli chants from Eden Gardens crowd Karma will get back at you: Ravindra Jadeja's cryptic tweet a day after C... If I bowl only two overs....I also need some overs to heat up my batterie... “I am in good form, it’s about getting a start and converting it into a big one. It’s all working out for me in the business end of the tournament. You need to keep playing shots in T20 cricket. Earlier in the season, I was getting starts, 40s and so on. But the shots would go to fielders hands. I know my game, I will keep building on it. It’s going to be an exciting one, playing against Chennai in Chennai.”","pubDate":"2023-05-21 19:34:28","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Nottinghamshire up to fourth in Division One after draw against Essex","link":"https://www.independent.co.uk/sport/cricket/alastair-cook-sussex-essex-nottinghamshire-trent-bridge-b2343058.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Sir Alastair Cook scored 99 for the visitors at Trent Bridge.","content":"Nottinghamshire moved into fourth in the LV= Insurance County Championship Division One table after drawing against Essex . Having been 144 runs behind on the first innings, former England captain Sir Alastair Cook scored 99 alongside Tom Westley’s 95 to help Essex put on 362 for eight before declaring. With the hosts set 219 to chase in 39 overs, Nottinghamshire were 97 for four, still 122 runs short of their target, when the sides agreed to call it a day with five of the scheduled overs unbowled. In Division Two, Ajaz Patel finished with match figures of 10 for 209 as Durham cemented their position at the top with a 125-run triumph over Gloucestershire at Bristol. The hosts were bowled out for 300 before lunch despite Marcus Harris carrying his bat with an unbeaten 122 and putting on an eighth-wicket stand of 88 with Josh Shaw (44). However, New Zealand Test left-arm spinner Patel was able to follow up his five for 113 in the first innings with five for 96 as Durham earned their fourth victory in six games. Elsewhere, an extraordinary effort saw Glamorgan pile up a vast total of 737 to save their match against Sussex , which ended in a draw. Michael Neser became the third century-maker of the innings, following Marnus Labuschagne and Kiran Carlson, as Glamorgan turned a first-innings deficit of 358 into a lead of 379 against the weakened hosts. Any doubt about the outcome of the match had long gone by the time the players shook hands.","pubDate":"2023-05-21 18:24:26","image_url":"https://static.independent.co.uk/2023/05/21/19/433929dd9fdf2f20f1a8c8496c2a0565Y29udGVudHNlYXJjaGFwaSwxNjg0Nzc4MzA4-2.59477320.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cameron Green hits glorious matchwinning ton for Mumbai","link":"https://www.perthnow.com.au/sport/cricket/cameron-green-hits-glorious-matchwinning-ton-for-mumbai-c-10723094","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australia's gun allrounder Cameron Green has finally delivered his very best for Mumbai Indians with a glorious matchwinning Indian Premier League ton.","content":null,"pubDate":"2023-05-21 15:55:07","image_url":"https://images.perthnow.com.au/publication/C-10723094/0c08a516c1ea83b56743b860b7e6507ad2231eae-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket: Devonshire Recreation Defeat U/19","link":"https://bernews.com/2023/05/cricket-devonshire-recreation-defeats-under-19/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"The Bermuda Under 19 National Team were defeated by 1 wicket by the Devonshire Recreation Club. Batting first, the Under 19 team was bowled all out for 227. Jermal Proctor was the top scorer with 95, Proctor would score 17 boundaries, while Zakao Hart added 54. Lamont Brangman was the pick of the Devonshire Recreation Club […]","content":"The Bermuda Under 19 National Team were defeated by 1 wicket by the Devonshire Recreation Club. Batting first, the Under 19 team was bowled all out for 227. Jermal Proctor was the top scorer with 95, Proctor would score 17 boundaries, while Zakao Hart added 54. Lamont Brangman was the pick of the Devonshire Recreation Club bowlers with figures of 10-1-52-3. In reply, the Devonshire Recreation Club scored 228/9, a 135-run 4th wicket partnership between Ankoma Cannonier, and Clay Darrell took the Devonshire Recreation Club from 26/3 to 171/4. Cannonier was the top scorer with 73, he hit 10 fours, and 3 sixes off 61 balls, while Darrell scored 68 off 43, with 3 fours and 6 sixes. Proctor was the pick of the Under 19 bowlers with figures of 10-1-49-4, Dionte Dowling bowled 6.5-1-32-3. : ,","pubDate":"2023-05-21 15:00:17","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"Cricket SA names 15-player men’s Under-19 50-over squad to tour Bangladesh","link":"https://www.iol.co.za/sport/cricket/cricket-sa-names-15-player-mens-under-19-50-over-squad-to-tour-bangladesh-b338583d-3205-4b1a-afd7-fcde34731677","keywords":null,"creator":["Supplied"],"video_url":null,"description":"The announcement follows a four-day selection camp which was held at the Centre of Excellence in Pretoria this week.","content":null,"pubDate":"2023-05-21 13:55:30","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/ef777261-3365-5090-9fcc-7614f9f98382&operation=CROP&offset=0x95&resize=1902x1069","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"PCB makes three key appointments to national selection committee","link":"https://a-sports.tv/pcb-makes-three-key-appointments-to-national-selection-committee/","keywords":["Cricket","Sports","Top News","Top Picks","national selection committee","Pakistan national selection committee","Paksitan Cricket Board","Selection committee"],"creator":["A Sports"],"video_url":null,"description":"LAHORE: The Pakistan Cricket Board on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides. The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant […] The post PCB makes three key appointments to national selection committee appeared first on ASports.tv.","content":"LAHORE: The Pakistan Cricket Board on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides . The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant Bradburn (national men’s team’s head coach). The presence of Cheema, who has worked as strategy manager and data analyst in franchise cricket around the world, Arthur and Bradburn will aid in strategising for the approaching and upcoming series, enhance the bench strength and provide a proper pathway to performing players in Shaheens and U19 sides to graduate to the national side. The first task of the selection committee is to name the players for the fast and spin bowling camps next month in Lahore, which will be announced in due course. READ: Champions Barcelona suffer defeat at home ahead of trophy celebration","pubDate":"2023-05-21 13:04:52","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pics: Top Indian bowlers to get Purple Cap in IPL history","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/web-stories/top-indian-bowlers-to-get-purple-cap-in-ipl-history/photostory/100398259.cms","keywords":null,"creator":null,"video_url":null,"description":"Read more on TOI Sports","content":null,"pubDate":"2023-05-21 12:21:57","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"RCB vs GT Live: Toss at 7:45 pm IST and match to start at 8 pm IST","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/royal-challengers-bangalore-vs-gujarat-titans-live-score-ipl-2023-match-70-bengaluru/liveblog/100397894.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-21 12:01:56","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Strikers dominate T20 phase of Pakistan Cup Women’s Cricket Tournament","link":"https://www.nation.com.pk/22-May-2023/strikers-dominate-t20-phase-of-pakistan-cup-women-s-cricket-tournament","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The T20 phase of the Pakistan Cup Women’s Cricket Tournament 2022-23 comprised four teams so the probables for the ACC Women’s Emerging Asia Cup in Hong Kong next month could get maximum match practice ahead of the all-important event.","content":"LAHORE-The T20 phase of the Pakistan Cup Women’s Cricket Tournament 2022-23 comprised four teams so the probables for the ACC Women’s Emerging Asia Cup in Hong Kong next month could get maximum match practice ahead of the all-important event. These emerging women cricketers, captained by Pakistan seamer Fatima Sana, formed Strikers and made the most of the opportunity by winning all three matches, defeating Challengers (42 runs), Blasters (nine wickets) and Dynamites (three runs) on Friday, Saturday and Sunday in Karachi. Shawaal Zulfiqar scored 74 off 52 balls (12 fours) and all-rounder Natalia Pervaiz hit 39 off 29 to lift Strikers to 171-6 before Anoosha Nasir’s 4-19 and Tuba Hasan’s 2-20 limited Sadia Iqbal-led Challengers to 129 at the Oval Academy Ground. They inflicted a thumping defeat on Blasters, skippered by Muneeba Ali, the next day, chasing 119 with as many as 9 wickets and 6 overs spare with Eyman Fatima smashing unbeaten 72 off 49 (9 fours and 3 sxies) and Sadaf Shamas hitting unbeaten 40 off 26 (6 fours and a six) in a 104-run stand. This young bunch displayed great nerves on Sunday when they secured a three-run win in a low-score affair at the State Bank Ground by limiting Sidra Amin’s Dynamites to 89 after posting 92-8. Umm-e-Hani took 3-18 and Syeda Aroob Shah took 2-17. Dynamites were the second best side with two wins – against Blasters, who remained winless, and Challengers, whose only win came on Sunday when they beat Blasters by a staggering 96 runs, thanks to Saima Malik’s 5-9. Former Pakistan captain and Dynamites batter Bismah Maroof accumulated the most runs (139) with back-to-back half-centuries while two Javerias – Rauf and Khan – made 134 and 109. Saima recorded the only five-wicket haul and the best figures with her 5-9 on Sunday. She finished with six wickets, the joint most with Dynamites leg-spinner Ghulam Fatima. The one-day phase of the Pakistan Cup Women’s Cricket Tournament commences tomorrow (Tuesday) with three teams – Challengers, Blasters and Dynamites – playing each other twice. The final will be played on June 4.","pubDate":"2023-05-21 21:24:18","image_url":"https://www.nation.com.pk/print_images/large/2023-05-22/strikers-dominate-t20-phase-of-pakistan-cup-women-s-cricket-tournament-1684704254-3270.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB confirms appointments to men’s selection committee","link":"https://www.nation.com.pk/22-May-2023/pcb-confirms-appointments-to-men-s-selection-committee","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE - The Pakistan Cricket Board (PCB) on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides.","content":"LAHORE - The Pakistan Cricket Board (PCB) on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides. The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant Bradburn (national men’s team’s head coach). The presence of Cheema, who has worked as strategy manager and data analyst in franchise cricket around the world, Arthur and Bradburn will aid in strategising for the approaching and upcoming series. The first task of the selection committee is to name the players for the fast and spin bowling camps next month in Lahore, which will be announced in due course.","pubDate":"2023-05-21 21:21:34","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"‘When he plays such shots, it’s a different Shubman Gill’: Gujarat Titans skipper Hardik Pandya praises centurion","link":"https://indianexpress.com/article/sports/ipl/when-he-plays-such-shots-its-a-different-shubman-gill-gujarat-titans-skipper-hardik-pandya-praises-centurion-8621725/?utm_source=FBBOT&utm_medium=Referral","keywords":["IPL 2023","Sports"],"creator":["Sports Desk"],"video_url":null,"description":"Gujarat needed a 52-ball 104 from Gill to seal victory after Virat Kohli scored his seventh IPL century to lead RCB to 197 for five in their 20 overs batting first.","content":"Gujarat Titans skipper Hardik Pandya was full of praise for his star batter Shubman Gill, who cracked a century to lead the team to a six-wicket victory over the Royal Challengers Bangalore in the final group stage game of the 2023 Indian Premier League on Sunday. While Gujarat had already sealed their top spot in the table, the defeat means RCB will not make the cut for the playoffs, with Mumbai Indians joining Gujarat, Chennai Super Kings and Lucknow Super Giants. Gujarat needed a blitzkrieg from Gill after Virat Kohli scored his seventh IPL century to lead RCB to 197 for five in their 20 overs batting first. Gill though slammed a 52-ball 104, while Vijay Shankar scored 53 in 35 in the rain-delayed match to seal victory. Speaking on the player of the match, Gujarat captain Pandya said: “He knows when he plays those cricketing shots, it’s a different Shubman Gill. He doesn’t give any chance and that gives confidence to the other batter as well.” He went on to add: “The calmness which the boys showed was terrific. We wanted to keep the momentum going. We have ticked a lot of boxes today. We would have taken 197 at the start, but we didn’t bowl well. It was a special innings from Kohli, but we went too early for the death overs. I can’t ask anything better from the boys. Last year, everything went well for us. We were expecting people to challenge us. The boys showed tremendous character.” Meanwhile, Gill spoke of the early season when the centuries were eluding him despite him being in form. Also Read IPL 2023, DC vs CSK emotional rollercoaster: When Dhoni advised Jadeja to... Watch: Gautam Gambhir responds to Virat Kohli chants from Eden Gardens crowd Karma will get back at you: Ravindra Jadeja's cryptic tweet a day after C... If I bowl only two overs....I also need some overs to heat up my batterie... “I am in good form, it’s about getting a start and converting it into a big one. It’s all working out for me in the business end of the tournament. You need to keep playing shots in T20 cricket. Earlier in the season, I was getting starts, 40s and so on. But the shots would go to fielders hands. I know my game, I will keep building on it. It’s going to be an exciting one, playing against Chennai in Chennai.”","pubDate":"2023-05-21 19:34:28","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Nottinghamshire up to fourth in Division One after draw against Essex","link":"https://www.independent.co.uk/sport/cricket/alastair-cook-sussex-essex-nottinghamshire-trent-bridge-b2343058.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Sir Alastair Cook scored 99 for the visitors at Trent Bridge.","content":"Nottinghamshire moved into fourth in the LV= Insurance County Championship Division One table after drawing against Essex . Having been 144 runs behind on the first innings, former England captain Sir Alastair Cook scored 99 alongside Tom Westley’s 95 to help Essex put on 362 for eight before declaring. With the hosts set 219 to chase in 39 overs, Nottinghamshire were 97 for four, still 122 runs short of their target, when the sides agreed to call it a day with five of the scheduled overs unbowled. In Division Two, Ajaz Patel finished with match figures of 10 for 209 as Durham cemented their position at the top with a 125-run triumph over Gloucestershire at Bristol. The hosts were bowled out for 300 before lunch despite Marcus Harris carrying his bat with an unbeaten 122 and putting on an eighth-wicket stand of 88 with Josh Shaw (44). However, New Zealand Test left-arm spinner Patel was able to follow up his five for 113 in the first innings with five for 96 as Durham earned their fourth victory in six games. Elsewhere, an extraordinary effort saw Glamorgan pile up a vast total of 737 to save their match against Sussex , which ended in a draw. Michael Neser became the third century-maker of the innings, following Marnus Labuschagne and Kiran Carlson, as Glamorgan turned a first-innings deficit of 358 into a lead of 379 against the weakened hosts. Any doubt about the outcome of the match had long gone by the time the players shook hands.","pubDate":"2023-05-21 18:24:26","image_url":"https://static.independent.co.uk/2023/05/21/19/433929dd9fdf2f20f1a8c8496c2a0565Y29udGVudHNlYXJjaGFwaSwxNjg0Nzc4MzA4-2.59477320.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cameron Green hits glorious matchwinning ton for Mumbai","link":"https://www.perthnow.com.au/sport/cricket/cameron-green-hits-glorious-matchwinning-ton-for-mumbai-c-10723094","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australia's gun allrounder Cameron Green has finally delivered his very best for Mumbai Indians with a glorious matchwinning Indian Premier League ton.","content":null,"pubDate":"2023-05-21 15:55:07","image_url":"https://images.perthnow.com.au/publication/C-10723094/0c08a516c1ea83b56743b860b7e6507ad2231eae-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Cricket: Devonshire Recreation Defeat U/19","link":"https://bernews.com/2023/05/cricket-devonshire-recreation-defeats-under-19/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"The Bermuda Under 19 National Team were defeated by 1 wicket by the Devonshire Recreation Club. Batting first, the Under 19 team was bowled all out for 227. Jermal Proctor was the top scorer with 95, Proctor would score 17 boundaries, while Zakao Hart added 54. Lamont Brangman was the pick of the Devonshire Recreation Club […]","content":"The Bermuda Under 19 National Team were defeated by 1 wicket by the Devonshire Recreation Club. Batting first, the Under 19 team was bowled all out for 227. Jermal Proctor was the top scorer with 95, Proctor would score 17 boundaries, while Zakao Hart added 54. Lamont Brangman was the pick of the Devonshire Recreation Club bowlers with figures of 10-1-52-3. In reply, the Devonshire Recreation Club scored 228/9, a 135-run 4th wicket partnership between Ankoma Cannonier, and Clay Darrell took the Devonshire Recreation Club from 26/3 to 171/4. Cannonier was the top scorer with 73, he hit 10 fours, and 3 sixes off 61 balls, while Darrell scored 68 off 43, with 3 fours and 6 sixes. Proctor was the pick of the Under 19 bowlers with figures of 10-1-49-4, Dionte Dowling bowled 6.5-1-32-3. : ,","pubDate":"2023-05-21 15:00:17","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"Cricket SA names 15-player men’s Under-19 50-over squad to tour Bangladesh","link":"https://www.iol.co.za/sport/cricket/cricket-sa-names-15-player-mens-under-19-50-over-squad-to-tour-bangladesh-b338583d-3205-4b1a-afd7-fcde34731677","keywords":null,"creator":["Supplied"],"video_url":null,"description":"The announcement follows a four-day selection camp which was held at the Centre of Excellence in Pretoria this week.","content":null,"pubDate":"2023-05-21 13:55:30","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/ef777261-3365-5090-9fcc-7614f9f98382&operation=CROP&offset=0x95&resize=1902x1069","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"PCB makes three key appointments to national selection committee","link":"https://a-sports.tv/pcb-makes-three-key-appointments-to-national-selection-committee/","keywords":["Cricket","Sports","Top News","Top Picks","national selection committee","Pakistan national selection committee","Paksitan Cricket Board","Selection committee"],"creator":["A Sports"],"video_url":null,"description":"LAHORE: The Pakistan Cricket Board on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides. The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant […] The post PCB makes three key appointments to national selection committee appeared first on ASports.tv.","content":"LAHORE: The Pakistan Cricket Board on Sunday confirmed three appointments to the national men’s selection committee, which will select senior, Shaheens and U19 sides . The new selection committee comprises Haroon Rashid (chair), Hassan Cheema (selection committee secretary and manager analytics and team strategy for national men’s side), Mickey Arthur (national men’s team’s director), and Grant Bradburn (national men’s team’s head coach). The presence of Cheema, who has worked as strategy manager and data analyst in franchise cricket around the world, Arthur and Bradburn will aid in strategising for the approaching and upcoming series, enhance the bench strength and provide a proper pathway to performing players in Shaheens and U19 sides to graduate to the national side. The first task of the selection committee is to name the players for the fast and spin bowling camps next month in Lahore, which will be announced in due course. READ: Champions Barcelona suffer defeat at home ahead of trophy celebration","pubDate":"2023-05-21 13:04:52","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pics: Top Indian bowlers to get Purple Cap in IPL history","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/web-stories/top-indian-bowlers-to-get-purple-cap-in-ipl-history/photostory/100398259.cms","keywords":null,"creator":null,"video_url":null,"description":"Read more on TOI Sports","content":null,"pubDate":"2023-05-21 12:21:57","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"RCB vs GT Live: Toss at 7:45 pm IST and match to start at 8 pm IST","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/royal-challengers-bangalore-vs-gujarat-titans-live-score-ipl-2023-match-70-bengaluru/liveblog/100397894.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-21 12:01:56","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"}]}