{"newsArray":[{"title":"Australia obliterate Proteas at the MCG in just four days","link":"https://www.themercury.com.au/sport/cricket/australia-obliterate-proteas-at-the-mcg-in-just-four-days/video/99ababe0f466a4749815c869555d210b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia were too good for South Africa at the MCG, romping to an outrageous innings-and-182 run win over the visitors in the second Test.","content":"Cricket: Australia were too good for South Africa at the MCG, romping to an outrageous innings-and-182 run win over the visitors in the second Test.","pubDate":"2022-12-29 07:00:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"David Warner coy on future: ‘You never know!’","link":"https://www.themercury.com.au/sport/cricket/david-warner-coy-on-future-you-never-know/video/f15ead4a5551d318681c1c8bb4e60ad3","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: David Warner's Test cricket future is still unknown despite the opener's epic double ton at the MCG against South Africa.","content":"Cricket: David Warner's Test cricket future is still unknown despite the opener's epic double ton at the MCG against South Africa.","pubDate":"2022-12-29 07:00:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Keep In Your Crease”: Agitated Mitchell Starc Warns South Africa Batter In 2nd Check. Watch | Cricket Information","link":"https://www.thetimesofbengal.com/sports/keep-in-your-crease-agitated-mitchell-starc-warns-south-africa-batter-in-2nd-check-watch-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Working the batter out on the non-striker’s finish if he/she leaves his/her crease earlier than the ball is bowled remains","content":"Read Time:2 Minute, 0 Second Working the batter out on the non-striker’s finish if he/she leaves his/her crease earlier than the ball is bowled remains to be a controversial mode of dismissal in cricket. Whereas some followers and consultants are in help of the legislation, others suppose that it must be eliminated as it’s unfair. Marylebone Cricket Membership — the custodians of the legal guidelines of cricket — had earlier this yr moved the mode of dismissal from the ‘unfair play’ part of their legal guidelines to the ‘run out’ part which was adopted by ICC from October 1. No matter be the opinion of the followers and consultants, however the truth can’t be ignored that the batters at instances, acquire an unfair benefit of leaving their crease early on the non-striker’s finish. To sort out this amid the continuing controversy surrounding the mode of dismissal, the bowlers normally attempt to warn the batters who do such an offence somewhat than dismissing them on the first time. The same occasion was seen when Australia pacer Mitchell Starc obtained agitated and warned South Africa batter Theunis de Bruyn within the recently-concluded secon Check on the Melbourne Cricket Floor. On day 4 of the Boxing Day Check, Starc was going to bowl the final ball of the seventeenth over through the South African innings. Nonetheless, de Bruyn left his crease effectively earlier than Starc may have launched the ball from his palms. Starc did not bowl that supply and when he returned from the follow-up, he warned the batter. “Keep in your crease. It is not that tough,” mentioned Starc. Watch it right here: “Keep in your crease, it is not that tough!” Half 2 of Starc v de Bruyn #AUSvSA pic.twitter.com/I6bPWXAOSX — 7Cricket (@7Cricket) December 29, 2022 South Africa have been on the mistaken finish of a “hammering” towards rampant top-ranked Australia on Thursday, dropping the second Check by 182 runs and with it the collection. The loss capped a dismal first two Exams for the guests who slumped by six wickets within the opener at Brisbane inside two days, with a possible face-saving third match at Sydney nonetheless to play. (With AFP Inputs) Featured Video Of The Day FIH Girls’s Nations Cup: Victorious Crew India Receives Heat Welcome In Delhi Matters talked about on this article Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 06:33:38","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Agar frontrunner to end five years in Test wilderness","link":"https://www.themercury.com.au/sport/cricket/cricket-news-ashton-agar-looms-for-test-return-at-scg-more-than-five-years-after-last-match/news-story/34c60de01c9822450134eb4fcaa551f9","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Ashton Agar is firmly in the frame to play his first ever Test on home soil, should he win the race to be added as Australia’s second spinner for Sydney.","content":"Selectors will meet on Thursday night and are set to choose between left-armer Agar and Victorian rookie Todd Murphy as their SCG spin addition to be announced on Friday.Pace bowler and handy bat Michael Neser and young all-rounder Aaron Hardie are also in contention for call-ups to the squad as replacements for Mitchell Starc and Cameron Green.Australia are big fans of off-spinner Murphy, but working against the 22-year-old’s chances of a squad call-up may be the question of whether it’s logical to pick him in the same XI as Nathan Lyon, particularly when there’s another part-time offie in Travis Head already in the team.Not only does Agar spin it the other way as a left-arm orthodox, but he is also capable of batting at No. 7, which could be an important factor with all-rounder Green out of action with his broken finger.If Australia picks a second spinner in Sydney, who should play? It’s not guaranteed that Australia will play a second spinner in its XI in any case.But SCG curator Adam Lewis has gently encouraged Pat Cummins’ that the deck he has prepared for next week would warrant the hosts picking a No. 1 slow bowler for the first time since Steve O’Keefe partnered Nathan Lyon in Sydney against Pakistan in 2017.Agar has only played four Tests since his extraordinary debut as an 19-year-old at Trent Bridge on the 2013 Ashes made him an instant household name as the country stayed up to watch his remarkable 98.Those same batting skills he showed as a No. 11 could again come to the fore nearly 10 years later if selectors are thinking about promoting wicketkeeper Alex Carey to No. 6 and replacing Green with a bowling all-rounder, rather than a like-for-like batting all-rounder like Hardie.In that scenario, Agar or Queenslander Michael Neser both have first-class records which prove they’re capable of batting at No. 7 in Test cricket.There would be a temptation for Australia to use this as an opportunity to blood young gun Murphy, who they see a big future in and who Lyon has anointed behind the scenes as the real deal.But looking ahead to the Indian tour that immediately follows the Sydney Test and the reality is Australia and other international cricket teams have shown over recent years a penchant for picking left-arm spinners in the subcontinent.In fact, Australia would have picked Agar in Sri Lanka earlier this year over leg-spinner Mitchell Swepson, if it wasn’t for Agar breaking down with a side strain during the preceding one-day matches.Unless selectors have changed their theory, Agar could be the most likely man to partner Lyon for the first Test on the tour of India in Nagpur starting in early February and if that is the case, it would make sense to pick Agar in the Sydney Test squad in the interest of continuity.The fact the choice for Sydney appears to be between Agar and Murphy is a blow to Queenslander Swepson who has fallen back in the spin pecking order from 12 months ago.Agar’s four Test matches have come in England in 2013 and Bangladesh in 2017, so it has now been more than five years’ since he last played Test cricket for his country.In that time, the West Australian has come a long way as a white ball bowler and feels he is as well-equipped as he’s ever been aged 29 to finally thrive with the ball at Test level.","pubDate":"2022-12-29 06:24:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"England Star Danielle Wyatt Trolls India U19 Crew Over Run Out Incident, Faces Backlash | Cricket Information","link":"https://www.thetimesofbengal.com/sports/england-star-danielle-wyatt-trolls-india-u19-crew-over-run-out-incident-faces-backlash-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The Indian U-19 ladies’s cricket crew produced an all-round effort to beat South Africa by 54 runs within the first","content":"Read Time:2 Minute, 1 Second The Indian U-19 ladies’s cricket crew produced an all-round effort to beat South Africa by 54 runs within the first T20I of the five-match sequence in Pretoria on Tuesday. The sequence serves as preparation for each groups forward of the ICC U-19 Ladies’s T20 World Cup to be held in South Africa from January 14 to 29. Opener Shewata Sehrawat and Soumya Tiwari scored 40 every off 39 and 46 balls respectively to information India to 137 for 5 after being requested to bat. In reply, South Africa solely 83. Nonetheless, the match grabbed consideration for an additional purpose. It got here within the seventeenth over of the South African innings when India’s Mannat Kashyap ran out Jenna Evans on the non-striker’s finish. The video quickly went viral on social media. Ultimately India captain Shafali Verma took again the attraction and the match went forward. England ladies’s cricketer Danielle Wyatt was not impressed with the incident. “Oh no I hope there’s none of this within the u19 WC!” Wyatt tweeted. India and England have a historical past concerning working out batters at he non-striker’s finish. In September, India all-rounder Deepti Sharma had run out England’s Charlotte Dean throughout an ODI sport. That incident divided the cricket world on whether or not it was finished in the appropriate spirit. Oh no I hope there’s none of this within the u19 WC! https://t.co/s7SgkNto1v — Danielle Wyatt (@Danni_Wyatt) December 27, 2022 Now, after Wyatt’s tweet, the cricketer is getting trolled on social media. I hope there’s 10 occasions extra of that. Y’all can preserve crying. — Izu (@outof22yards) December 27, 2022 Cry little extra — Abijith Subramanya Prasad (@plyomaniac) December 27, 2022 kinda bizarre {that a} skilled such as you asking an u-19 cricketer to not play inside the legal guidelines of sport, Danni. pls undergo the principles, this tweet is apparent embarrassing — s (@_sectumsempra18) December 28, 2022 It is hilarious that nobody appears to be bothered about precise dishonest, however all of them get labored up over a legit dismissal — kabhikabhimeredilmekhayalaatahai (@kr_kinshuk) December 28, 2022 The second T20I will likely be performed on the identical venue afterward Thursday. Featured Video Of The Day Hardik Pandya to Lead In T20Is Vs Sri Lanka Subjects talked about on this article Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 06:21:37","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa, 2nd Take a look at: David Warner Stars As Australia Thrash South Africa To Win Sequence | Cricket Information","link":"https://www.thetimesofbengal.com/sports/india-vs-south-africa-2nd-take-a-look-at-david-warner-stars-as-australia-thrash-south-africa-to-win-sequence-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"South Africa capitulated towards rampant top-ranked Australia to lose the second Take a look at in Melbourne by an innings","content":"Read Time:3 Minute, 21 Second South Africa capitulated towards rampant top-ranked Australia to lose the second Take a look at in Melbourne by an innings and 182 runs on Thursday and with it the collection. It capped a dismal first two Checks for the Proteas who slumped by six wickets within the opener at Brisbane inside two days, with a possible face-saving third match at Sydney nonetheless to play. They resumed day 4 on 15-1 after skipper Dean Elgar was caught by Alex Carey off Pat Cummins for a duck earlier than rain halted play early on Wednesday. However their resistance did not final lengthy with three wickets falling earlier than lunch on the Melbourne Cricket Floor and the remaining within the second session as they meekly succumbed for 204. Temba Bavuma top-scored with 65 whereas Nathan Lyon took 3-58 in a depleted, injury-hit, assault. It leaves South Africa dealing with a visit to Sydney subsequent week for the ultimate Take a look at with solely satisfaction to play for and doubtlessly some adjustments to a batting line up that has largely failed to fireside. Australia can have a new-look workforce with Cameron Inexperienced and Mitchell Starc already dominated out as they race the clock to be prepared for a blockbuster collection in India in February. Josh Hazlewood is ready to return in Sydney after recovering from a facet pressure, declaring Thursday he was match after lacking the final two Checks, with Inexperienced’s substitute to be determined. Theunis de Bruyn (28), Sarel Erwee (21) and Khaya Zondo (one) all departed earlier than lunch by the hands of Australia’s high-class tempo assault. Then the spin of Nathan Lyon, and two careless run outs, ended any hope that they had within the second session. Bruised finger Australia declared on Wednesday at 575-8 constructed on the again of man-of-the-match David Warner‘s 200 in reply to South Africa’s first innings 189 after which took management with the ball. The wickets fell regardless of the hosts’ assault being depleted, with Cameron Inexperienced, who took 5-27 of their first innings, dominated out of bowling once more in Melbourne — and the ultimate Take a look at in Sydney — with a fractured finger. Mitchell Starc was additionally nursing a bruised and bloodied finger, however he performed by means of the ache and his sheer tempo brought about loads of issues. Erwee, who resumed on seven, hit an excellent drive for 4 off him as his confidence grew, however Starc shortly bought his revenge, trapping him lbw with a cracking yorker. De Bruyn, who was dropped late Wednesday, started on six and constructed as much as 28, however he quickly adopted his teammate again to the pavilion. This time Scott Boland did the harm, attractive an edge that was taken by the ever-reliable Smith within the slips for his a hundred and fiftieth catch. He’s 14th on the all-time listing, led by Indian nice Rahul Dravid‘s 210. South Africa had been beneath the pump and wanted to dig in, however Bavuma inexplicably tried a single from Cummins and Khaya Zondo was simply run out by a Travis Head underarm throw. It left them teetering at 65-4 earlier than Bavuma and Kyle Verreynne knuckled down. However Boland struck once more quickly after lunch with Verreynne, one in all their finest batsmen this collection, out lbw for 33. Lyon’s spin eliminated Marco Jansen earlier than one other disastrous run out involving Bavuma, with Keshav Maharaj out after a complicated mix-up as they went for a 3rd run and Starc made a direct hit. Extra weak dismissals by Lyon and a uncommon wicket for Steve Smith ended the match. (This story has not been edited by NDTV employees and is auto-generated from a syndicated feed.) Featured Video Of The Day Artist Makes Smoke Portrait Of Lionel Messi With FIFA World Cup Subjects talked about on this article Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 05:57:42","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Up to date WTC Factors Desk: How South Africa Loss In 2nd Take a look at To Australia Additional Improves India’s Probabilities Of Making Ultimate | Cricket Information","link":"https://www.thetimesofbengal.com/sports/up-to-date-wtc-factors-desk-how-south-africa-loss-in-2nd-take-a-look-at-to-australia-additional-improves-indias-probabilities-of-making-ultimate-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Australia on Thursday defeated South Africa by an innings and 182 runs within the second Take a look at to","content":"Read Time:2 Minute, 2 Second Australia on Thursday defeated South Africa by an innings and 182 runs within the second Take a look at to take an unassailable 2-0 lead within the three-match collection. After resuming play on Day 4 at 15/1, the Proteas capitulated in opposition to a rampant Australian bowling line-up and had been bowled out for 204. Earlier, Australia had taken a 386-run lead, after having declared their first innings at 575/8. Cameron Inexperienced had taken his first five-wicket haul as South Africa had been bowled out for 189 within the first innings. With the collection within the bag, Australia additional stamped their authority on the high of the ICC World Take a look at Championship factors desk. This is the up to date ICC World Take a look at Championship factors desk after Australia’s win over South Africa within the second Take a look at: The Pat Cummins-led Australia stay high of the factors desk with a win share of 78.57. They’ll additional enhance their win share in the event that they beat South Africa within the third and closing Take a look at. India, following their 2-0 collection win over Bangladesh final week, stay second. They’ve a win share of 58.93, forward of a four-match Take a look at collection in opposition to Australia on house soil subsequent 12 months. If India may win three of these 4 video games, they’ll comfortably e-book a spot within the World Take a look at Championship closing subsequent 12 months. Sri Lanka and South Africa change locations and are actually third and fourth with a win share of 53.3 and 50, respectively. England are fifth within the desk after clear sweeping Pakistan 3-0. The Ben Stokes-led aspect has a win share of 46.97. With a win share of 40.91, West Indies are behind them on sixth. Pakistan and New Zealand, who’re presently squaring off within the first Take a look at of a two-match collection in Karachi, are seventh and eighth with win percentages of 38.89 and 25.93, respectively. With a poor win share of 11.11, Bangladesh sit on the backside of the factors desk. Featured Video Of The Day IPL Public sale: Groups Make investments In Untested Gamers – Consultants Subjects talked about on this article Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 05:33:37","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia beats South Africa by innings and 182 runs to win sequence","link":"https://www.thetimesofbengal.com/sports/australia-beats-south-africa-by-innings-and-182-runs-to-win-sequence/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"A depleted Australian assault secured an innings and 182-run victory over South Africa within the second Take a look at","content":"Read Time:2 Minute, 43 Second A depleted Australian assault secured an innings and 182-run victory over South Africa within the second Take a look at on Thursday, wrapping up the sequence with a match to spare after the customer’s batting woes had been uncovered as soon as extra.\r Needing 386 runs to make Australia bat once more after the host had declared on a mammoth 575 for eight, the Proteas had been bowled out for 204, with two farcical run-outs hastening their demise earlier than tea on day 4 on the Melbourne Cricket Floor.\r Australia’s win, fourth in successive Exams within the house summer time, shored up its high spot within the World Take a look at Championship, whereas underlining its No. 1 rating within the format. With all-rounder Cameron Inexperienced unable to bowl and Mitchell Starc with an injured center finger on his bowling hand, Australia confirmed loads of grit.\r “That’s really sweet, super proud of how we kind of ‘gutsed’ it out at times,” captain Pat Cummins mentioned on the post-match presentation.\r “For Starcy to come out with a pretty big injury (and) bowl like he did … really, really proud of this team.”\r Having received the final three Take a look at sequence in Australia, South Africa’s proud report within the nation lay in smoking ruins on Thursday.\r It was its worst defeat in Australia, eclipsing the innings and 163-run loss in Brisbane in 1931.\r Overwhelmed by six wickets within the series-opener in Brisbane, Dean Elgar’s facet head to the third Take a look at in Sydney with a number of issues and solely delight on the road.\r “It’s not easy at the moment,” mentioned Elgar.\r “I must say it’s a bit of a hammering that. We haven’t been up to speed with the kind of intensity that test cricket demands.”\r Temba Bavuma scored the Proteas’ sole half-century within the second innings however the quantity 4 was one thing of a legal responsibility for his companions, operating out Khaya Zondo for one and Keshav Maharaj for 13.\r After Maharaj’s dismissal, Bavuma top-edged a slog-sweep off spinner Nathan Lyon to be caught for 65, leaving South Africa 176 for eight and the tail-end uncovered.\r Lyon completed with 3-58 for the innings, with paceman Scott Boland taking two wickets.\r David Warner was named Participant of the Match for his 200 in scorching warmth on day two.\r Starc set the tone with a scorching yorker that trapped Sarel Erwee lbw for 21 after South Africa resumed on 15 for one within the morning.\r “Nice way to do it,” mentioned Starc after the win.\r “It’s been an interesting week on and off the field with a bit going on, but I think batting and bowling, we adapted to all hurdles this week, and it was a fantastic win.” Temporary scores Australia 575 for 8 dec (Warner 200, Carey 111, Smith 85, Inexperienced 51*, Head 51) beat South Africa 189 (Jansen 59, Verreynne 52, Inexperienced 5-27) & 204 (Bavuma 65) by an innings and 182 runs Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 05:08:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Shikha Pandey T20 stats in 2022 earlier than Girls’s T20 World Cup squad choice","link":"https://www.thetimesofbengal.com/sports/shikha-pandey-t20-stats-in-2022-earlier-than-girlss-t20-world-cup-squad-choice/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Shikha Pandey returned to India’s ladies’s workforce when she was named within the 15-member squad for the ICC Girls’s T20","content":"Read Time:1 Minute, 45 Second Shikha Pandey returned to India’s ladies’s workforce when she was named within the 15-member squad for the ICC Girls’s T20 World Cup in South Africa in February 2023. The pacer final appeared for India in October 2021 when she performed a T20I in opposition to Australia in Carrara. She was excluded from India’s Girls’s ODI World Cup squad in 2022 and missed for the Commonwealth Video games in Birmingham as properly. READ | India squad for Girls’s T20 World Cup 2023 Regardless of the snub from the nationwide workforce, Pandey continued impressing along with her performances in home tournaments. The 33-year-old even performed a event in Australia. Pandey, Goa’s captain, picked 11 wickets at a mean of 10.90 in seven matches within the Inter-State Girls’s T20 Competitors. She impressed with the bat as properly, scoring 105 runs with a highest rating of 47. Within the Inter Zonal T20 Competitors, taking part in for South Zone, Pandey picked seven wickets in 5 video games at a mean of 9.85. Even right here, Pandey offered helpful contributions with the bat. She scored 94 runs in 5 innings at a mean of 23.50. Pandey made headlines in September when she scored 100 on debut in Australia’s Katherine Raymont Protect competitors, taking part in for the for Wynnum Manly Cricket Membership. She then returned spectacular figures with the ball – 6-1-7-2. The not too long ago concluded Senior T20 Challenger Trophy noticed Pandey decide two wickets in 4 matches. Shikha Pandey’s batting stats: Event Matches Innings Runs Highest Common Inter-State T20 7 7 105 47 17.50 Inter-Zonal T20 5 5 94 34* 23.50 T20 Challenger 4 2 9 6* 9.00 Shikha Pandey’s bowling stats: Event Matches Runs Wickets Finest Common Inter-State T20 7 120 11 3-10 10.90 Inter-Zonal T20 5 69 7 3-12 9.85 T20 Challenger 4 80 2 1-14 40.00 (Supply: Cricket Archive) Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 04:56:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Player Ratings: Perfect Warner leads Aussie annihilation","link":"https://www.couriermail.com.au/sport/australia-vs-south-africa-boxing-day-test-player-ratings-who-starred-flopped-in-huge-win/news-story/de485ca39d7baea975733a2f3082d285","keywords":["Premium interactives"],"creator":null,"video_url":null,"description":"Australia have secured their Test series win against South Africa – a first on home soil in nearly 17 years.","content":"David Warner’s magical double-century set the tone for the dominant victory, while Cameron Green secured a career-first five-wicket haul and Alex Carey a maiden Test century – and Green and Mitchell Starc earned enormous respect for battling on with injuries.It wasn’t all smooth sailing – Usman Khawaja will rue his early exit as teammates cashed in on a flat MCG wicket.So who starred in the series-sealing victory? And who will be looking to turn things around at the SCG?Cricket 2022 AUS v SA Player Ratings Second Test","pubDate":"2022-12-29 04:48:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Amateur hour’: Aussies crush forlorn Proteas","link":"https://www.couriermail.com.au/sport/cricket/australia-v-south-africa-follow-all-the-day-four-action-from-the-mcg/news-story/8aee1a3e9d806a9a344f19c95cc0913b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Australia should start planning for an extra test when they head to England next year after emphatically ending a run of three straight home series losses to South Africa with a dominant victory at the MCG.","content":"Already the No.1 ranked nation in the world, a trip to the Test Championship final at The Oval before next year’s Ashes campaign to cement that status is now a near certainty after demolishing a Proteas batting outfit which again showed itself to be severely lacking in the face of the best bowling attack in cricket.Even without first innings star Cameron Green, three wickets from Nathan Lyon after a shoulder scare, a ferocious Mitchell Starc bowling rockets with an injured finger needing need six weeks to repair, two more scalps to hometown hero Scott Boland and two calamitous run outs helped secure a first home series win against the Proteas for more than 15 years.SCROLL DOWN FOR OUR LIVE DAY FOUR COVERAGE Prior to this encounter, the Aussies had won just two of the past nine home tests against South Africa.But captain Pat Cummins’ men showed a gulf in class and skill in Brisbane, then rammed home their advantage in Melbourne on the back of a resurgence from all-time great David Warner, Green’s golden arm and relentless intensity in the field which has become the hallmark of the fledgling skippers reign.South Africa were all out for 204, before tea on day four, Steve Smith taking the final wicket. While the finally passing 200 for the first time in eight tests innings, their combined total of 393 at the MCG was 182 short of Australia’s monstrous single effort. Australia will push for a clean sweep in Sydney with changes coming to replace Green and Starc, who bowled 18 second innings overs despite his finger being broken, bruised and bloodied, an effort which typified the want for the Australians to show the battling visitors no mercy. After refusing a painkilling injection before play, so as not to lose the feeling in his middle finger crucial to his bowling, Starc wore a protective sleeve while fielding but took it off to bowl.“(The injury) is not the prettiest thing but it was good enough for this test match especially with Greeny going down. His (finger) is a bit worse than mine, but I think he will come back quicker than me,” he said post-match. “It is a Test match and I didn’t want to leave the boys a man down, so it was nice to get through, contribute and play a role.“I wasn’t overly sure what I could do, there was a bit of planning in the nets to see what was capable. That first over of the second innings, Patty was at mid-off and came over and said ‘that went a bit better than I expected’ and I think that was two of us.”Starc will have a scan in Sydney to determine the extent of his injury and recovery plan as he turns his attention to the Indian tour. Are you concerned about the state of Test cricket?He regularly winced in pain, but was so in the game he engaged in a brief war of words with South African number three Thenis de Bruyn who kept leaving his crease at the non-striker’s end early.Starc even pulled up at the climax of his action with a warning for the walking batter before the very next delivery removing opener Sarel Erwee with a full-throttle Yorker.“Just stay in your crease. It’s not that hard. The line’s there for a reason mate.” Starc had screamed to de Bruyn, firing him up for the following ball. Perhaps chastened by the run-in, de Bruyn departed shortly after as Boland, who went for 10 runs off his opening over, had him caught by Steve Smith at second slip, the former skipper’s 150th in tests.The dismissal came a ball after Marnus Labuschagne charged furiously to stop a deflection from Temba Bavuma going to the boundary, an action which ensured de Bruyn was on strike.The fielding effort was a display of the all-in, always-on intensity which has been lacking in a South African outfit a long way removed from the types of teams which took the Aussies down the last three times they toured.Birthday boy Travis Head typified the Aussie energy when he ran out a dozing Khaya Zondo at the end of what loomed as yet another Pat Cummins maiden.South Africa didn’t score off eight of the skipper’s 16 overs, their thirst for positive intent stifled by the permanent Australian pressure.A 63-run partnership between Bavuma and one of the bright spots for the Proteas, keeper Kyle Verreynne only prolonged the inevitable, broken by Boland’s second wicket.Then Lyon, who returned from the field after he left the field clutching his shoulder after an incident in the field, returned and seized a wicket in his first over back. A second for Lyon came when he removed Bavuma, then a third as the end came quickly for a South African side which had been outgunned from the moment the series began. Day two fact boxMAN OF THE MATCH: David Warner (Australia) 3.18PM MILESTONE FOR SOUTH AFRICASouth Africa has ended a run of seven innings without reaching 200 thanks to a last-wicket stand which has reached 24 between Ngidi and Nortje. The end is nigh. What a dreadful mix up. Mark Waugh doesn’t mince words on Fox Cricket, calling the calamity involving Maharaj and Bavuma “amateur hour” and below Test standard. Bavuma’s turn for the third run was very strange. He almost spun 360 degrees, causing all sorts of confusion. “Absolute disaster for South Africa and that sums up the first two Test matches for them,” Waugh said. He added: “Just amateur hour from Bavuma unfortunately and that’s not good enough at Test level. It’s all right to be out to a good ball...but not a mistake like that.Waugh later said: “They’re not quite up to Test level at the moment.” Ian Smith called it “dreadful cricket”. 2.45PM HOW ABOUT THIS STEVE SMITH BALL? He’s out of the attack now but Steve Smith seriously ripped it during a brief cameo. Adam Gilchrist told Fox Cricket it was likely Smith had come on to help Australia’s over rate. Nathan Lyon has returned to the bowling crease after earlier hurting his left shoulder. 2.10PM INDIA-PAKISTAN MCG TALKS TAKE PLACE Owen Leonard and Tim Michell Melbourne Cricket Club chief executive Stuart Fox has revealed the MCC and Victorian government are lobbying for an India-Pakistan Test match at the MCG.The arch rivals don’t play against each other in their home countries due to political complications, and therefore only meet during limited-overs competitions such as world cups and the Asia Cup. However, after packing out the MCG during the recent T20 World Cup in an epic encounter, there were calls for Melbourne to host a one-off India-Pakistan test match. Fox confirmed that idea had progressed from initial interest but conceded there were “complications” to making it a reality. “Three in a row would be lovely at the MCG — you’d fill it every time,” Fox told SEN. “We have asked. We have taken that up with Cricket Australia and I know the government have as well. Would an India-Pakistan Test at the MCG be a success?“It’s enormously complicated in amongst, from what I understand, a really busy schedule, the world schedule. I think that’s probably the greater challenge. “Wouldn’t it be great that it wasn’t just Australia-centric or Victoria-centric, that we’re catering for all the countries and filling the stadium all the time?”Fox said he hoped Cricket Australia would continue to champion the idea with the ICC. “When you do see some of the stadiums around the world unoccupied, I think it would be much better to have a full house, that atmosphere and celebrating the game with full houses,” he said. 1.55PM GRUESOME DETAILS OF GREEN INJURY REVEALED Russell Gould Cameron Green thought his broken finger was “inverted” when it was first cracked at the MCG before scans revealed the damage which is set to sideline him for some time.But Green, who seized his first test five-wicket haul in Melbourne before making an unbeaten half-century as he batted through the pain, remains hopeful he’ll be back for February’s tour of India.Green said he knew he’d suffered a serious injury almost immediately after getting hit by an Anrich Nortje bouncer, with scans revealing a “minor fracture” which has ruled him out of the final test in Sydney.The 23-year-old will also miss a return to the BBL with the Perth Scorchers.“You try to not show the pain straight away,” Green told cricket.com.au.“”I marked my guard again and walked a couple of steps, and I was like ‘I reckon my finger is out of place here’.“I checked on it – it looked a little bit inverted is the only way I can explain it. It already had a big cut in it, then I got the bad news after the scan.”CLICK HERE FOR THE FULL STORY 1.40PM LYON INJURY CONCERN Nathan Lyon was assisted from the field after appearing to hurt his shoulder diving for a catch. Lyon stayed down, grimacing in pain and then clutching at his shoulder. “It’s a very ginger position he’s in,” said Adam Gilchrist in commentary. The Australians will lose Cameron Green (fractured finger) and Mitchell Starc (finger) for the SCG. Gilchrist added: “That change room has been like a hospital ward. “That’s the last thing Australia need.”In a pleasing sign for the Aussies, Lyon returned to the field a few overs later but did not appear to be 100 per cent. Fox Cricket later reported Lyon had suffered a “stinger” in his non-bowling arm. Only minutes after Nathan Lyon is assisted from the field after hurting his shoulder, Scott Boland traps the South African keeper in front and a DRS review can’t save him. 1.30PM SKULL DOUBLES DOWN ON ALL-ROUNDER CALL Kerry O’Keeffe says he hopes Australia goes with a “like-for-like” replacement for Cameron Green and considers debuting Aaron Hardie in Sydney. The Western Australian all-rounder has already featured for Australia A and was touted by O’Keefe and Ricky Ponting as a Test bolter on Wednesday. O’Keefe said on Thursday Hardie should be a serious contender to play at the SCG. “You would think it would be like for like where upon Aaron Hardie the impressive West Australia all-rounder comes into the thinking,” he said on Fox Cricket. “There’s a whisper that they’re going to play a second spinner who can bat a little bit. If you look at that scenario somebody like Ashton Agar is an option with Carey pushing up to bat six and Agar at seven. “It means that Agar jumps over the top of Mitchell Swepson and the second best spinner in the country who is also an off-spinner in Todd Murphy. It will be horses for courses. Sydney has been dry.”Bavuma resumes on 37 — his highest score against Australia is 95 not out. But it’s more about how long the South Africans can bat than how many runs at the moment as they still trail by 266 and making Australia bat again looks a very tall order. Verreynne will be his partner on 27 not out. Australia moved three wickets closer to wrapping up this Test series in an opening session extended by 30 minutes due to yesterday’s rain. Erwee was the first to go after a successful Australian review for lbw and No. 3 batter Theunis de Bruyn followed three overs later when Scott Boland found his edge. It came after de Bruyn was warned for backing up too far by Mitch Starc.Khaya Zondo was the other wicket, caught flat footed and metres short of his ground by a Travis Head direct hit after being called through for a single by Temba Bavuma. Since that disastrous moment, Bavuma and the impressive Kyle Verreynne have put on a partnership of 55 runs to defy the Australians into the middle session of play. 12.10PM COULD MCG TEST HAVE LATER START? The boss of the Melbourne Cricket Club says he expects Cricket Australia to consider a later start to the opening day of the Boxing Day Test. The idea of a midday start on December 26 has been floated to allow fans more time to converge on the MCG after festive celebrations the previous day. It would mean pushing the traditional start back by 90 minutes and playing through until 7.30pm-8pm on day one. “I have got to be careful here because we, the MCC are really a venue to hire,” MCC boss Stuart Fox said on SEN. “Cricket Australia control the fixturing, as do the AFL here. We will support whatever they want. “Personally, I love your idea. I think a 12pm start would work really well. “It is a big Christmas Day isn’t it? You have really got to be up and going at about 8am if you want to get in here and get yourself settled if you want to be ready for that first ball. “I like your idea and playing into the night day one. Not suggesting a day-night Test, but I don’t mind your idea personally. “Cricket Australia, I had a quick chat to Nick Hockley about it and I think they’ll look at it.”Should day one of the Boxing Day Test start at midday?What an absolute disaster for South Africa. Bavuma bunts a ball straight to Travis Head, Zondo is caught on his heels and he’s metres short when Head hits the stumps. That was very poor cricket. “That’s a terrible run. It really is,” says Mark Waugh in commentary. “Bavuma has called the single, there was half a single in it. “Zondo had given up.”Waugh added: “I think that probably sums up their tour so far. Mistake after mistake.“Looks like he was asleep … his backing up looked non-existent.” 11.35AM EX-PROTEAS SPINNER’S SWIPE Former South African tweaker Paul Harris has appeared to slam the Proteas’ Aussie tour efforts in a tweet overnight.Retweeting a 2021 post from the official Proteas account which read “our victories are not measured by the scoreboard but how many we bring along with us”, Harris simply posted eight laughing emojis as his country stumbled to a series defeat in Australia. Harris was part of the fearsome South African squad that defeated Australia in Australia in the 2008/09 summer. Steve Smith pouches his 150th catch in Test cricket to give Scott Boland his first wicket of the second innings. South Africa is teetering again with Australia still leading by 329 runs.11.05AM STARC’S MANKAD WARNING FOR BATTERS Mitch Starc has issued a mankad warning to South Africa as tensions rose in the opening session of day four. Cameras captured the Aussie quick telling No. 3 batter Theunis de Bruyn: “Stay in your crease. It's not that hard.”“He’s given him two warnings next time I reckon he’s going to whip the bails off,” said Mark Waugh in commentary. De Bruyn was out minutes after the spray, caught in the slips off Scott Boland. Asked about the incident minutes later, Starc told Fox Cricket: “I think he was halfway down Punt Road wasn’t he? It’s bad enough in white-ball cricket, I don't know what the need is in red-ball cricket. Just letting him know if I have to keep my foot behind the line he can at least keep his bat behind the line.”Travis Head later weighed in on Channel 7: “Marcus Harris did say he was somewhere down Punt Road he was that far out of his crease. I think it was mentioned to him a couple of times, all in good fun. It’s in the rules now isn’t it? Should bowlers give warnings before attempting a mankad?Mitchell Starc gets a ball to swing back at Erwee and he jams the bat down — but too late. He was originally given not out but Pat Cummins sent the decision upstairs and the third umpire decided Erwee hit his toe first, rather than making contact with the ball. South Africa still trails by 339 runs. Josh Hazlewood revealed the difficulty Starc is having bowling earlier, telling SEN: “He seems OK. 140km and swinging it. He’s obviously in a lot of pain and dealing with that, but as far as bowling I think he’ll get through today.”10.45AM CUMMINS’ SPELL BETTER THAN SA ATTACK Owen Leonard Pat Cummins bowled four maidens with his four overs this innings, which is more than any South African has bowled over the entire series so far.The Aussie captain has so far managed 15 maidens, nearly double the next best, which is Mitch Starc on eight.Each of South Africa’s four specialist bowlers have managed just three, while all-rounder Marco Jansen has claimed two. Overall, the Aussies have bowled 37 maidens to South Africa’s 14, illustrating a stark difference in pressure applied.10.30AM CAREY REFLECTS ON GREEN CELEBRATION Alex Carey might have looked subdued when he scored his maiden Test ton on day three, but his batting partner Cameron Green was anything but. Green had his armed raised as soon as Carey’s drive beat the field, knowing his teammate was about to reach triple figures for the first time in a Test. Carey revealed post-match the moment had been replayed in the Australian dressing room to highlight team spirit. “He certainly is and we have spoken a lot over the past period of playing together and we love batting together,” Carey told ABC. “We have formed a really strong relationship off the field. “We just sat down there in the rooms as a group and the staff put that together and showed the group, I guess, what it means to play in a team sport and celebrating others’ success. He did that and no better way than showing that emotion out there. It means a lot to me. I love batting with him.”Carey said he did not expect to Green to bat in the first innings and was surprised when he joined him in the middle. 10.15AM HOW WILL THE PITCH PLAY? Here’s what Mike Hussey said earlier on Fox Cricket: “It’s really not changed too much in the last couple of days, it has to be said. It's holding together really well. There’s a little bit of rough for a spinner to work into but it’s not that really deep rough that you expect to see maybe on day three or day four of a Test match. There’s still a nice even coverage of grass, still a tinge of green … with the brand new ball it can just seam a little bit.”Hussey also reported “a little bit of rough” that would offer assistance for Nathan Lyon but tipped conditions would favour batting if South Africa is good enough to take advantage. Pat Cummins has the ball in hand with Erwee and de Bruyn to resume for South Africa. Can they thwart the Aussies in this first session? 9.55AM DAY FOUR PREVIEWWhen will Australia win the Boxing Day Test?9.50AM HAZLEWOOD FIT FOR SYDNEY Josh Hazlewood has declared himself fit for selection for the SCG Test. The paceman withdrew from contention for the Boxing Day Test as he continued his recovery from injury. “At this stage I am. A few more overs to bowl during this game out in the nets. I had a good hit out two days ago and the signs are good and feel ready and fit,” Hazlewood said on SEN. Hazlewood said he would have been confident of playing in Melbourne if his workload was 30 overs or less. But the Australians did not take the risk and it proved a shrewd call with Cameron Green fracturing his finger and Mitch Starc injured while fielding. Should Josh Hazlewood play in Sydney?CAREY PROVES AUSSIES MUST CHALLENGE CONVENTION Australia has this year taught us to be careful about what we believe in cricket and it’s time to challenge convention once more.With Cameron Green poised to miss the Sydney Test, Australia should be cavalier in a likely dead rubber and promote MCG century-maker Alex Carey to No 6 to allow it to have a look at a second spinner.Australia has never liked making this move.But let’s remind you that Australia also had a 144-year theory that fast bowlers don’t make Test captains. And that you should always bat first in a Test match.Both of these maxims have been up-ended this year and there is major upside in clearing the decks to play an expanded bowling attack in Sydney.Australia needs to get up and running for India and while Sydney is the most overrated spinners decks in cricket, curator Adam Lewis has declared it will take turn.So it should.With Australia heading to India for four Tests on dusty decks the more Sydney turns the better.If it breaks apart, turns square and starts embarrassing batsmen, happy days.Historically Australia has always loathed shifting the keeper in the batting order. Even when the great Adam Gilchrist was in full sail as a batsman Australia liked to leave him at seven even though he made a staggering 17 Test centuries.But if Green’s broken finger keeps him out of any part of the Indian tour Australia will need to play five bowlers and Carey at No. 6 is a gamble worth making, if indeed it is a gamble at all.Carey has a classy Test average of 39 after 13 games.That’s good enough to bat at six.Of more relevance is the fact he will finish the year with an average of 48 for his 11 Tests in 2022.As he displayed at the MCG he is a cool cat with plenty of shots and a willingness to play them.If you did go with Carey at No 6 you could go with two all-rounders of sorts beneath him such as left-arm spinner Ashton Agar and Michael Neser before captain Pat Cummins and one of Lance Morris, Josh Hazlewood and Scott Boland (if Mitchell Starc is out) plus Nathan Lyon.The two other spinners in strong contention with Agar are Mitchell Swepson and Victoria’s uncapped off-spinner Todd Murphy.It would be a surprise if Australia chose a second off-spinner to accompany Lyon – a left-armer or a leg-spinner would provide variety – but nothing is off the table.Australia continued to dominate the series at the MCG.One old saying that did have merit was one time mantra of the great West Indian sides who toured Australia – take down the captain, take down the team.South African captain Dean Elgar, caught down the leg side for a duck, is having a stinker of a tour.He looked poor in the nets before the game and abandoned a net session to have throwdowns because he was hitting the ball so badly.At press conferences Elgar comes across with an air on combative defiance.Previous captains Faf du Plessis and Graeme Smith did as well – but they backed up their words with actions.Updates to story","pubDate":"2022-12-29 04:44:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Amateur hour!’: South Africa roasted for run outs","link":"https://www.couriermail.com.au/sport/cricket/amateur-hour-south-africa-roasted-for-run-outs/video/ccf436204ef52bab288944b441ac7bf9","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: South Africa's complacent running between the wickets came back to bite them twice on day four of the second Test against Australia at the MCG.","content":"Cricket: South Africa's complacent running between the wickets came back to bite them twice on day four of the second Test against Australia at the MCG.","pubDate":"2022-12-29 04:36:20","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"It's Complicated\": MCC CEO On Possibility Of Hosting India-Pakistan Test","link":"https://sports.ndtv.com/cricket/its-complicated-mcg-ceo-on-possibility-of-hosting-india-pakistan-test-3646623","keywords":null,"creator":null,"video_url":null,"description":"The Melbourne Cricket Club CEO Stuart Fox has revealed his intentions to host the Test following the tremendous success of the T20 World Cup clash in October, which was attended by over 90,000 spectators","content":null,"pubDate":"2022-12-29 04:34:41","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"JUST IN: Proteas walloped in embarrassing MCG defeat","link":"https://www.thesouthafrican.com/sport/cricket/proteas/proteas-walloped-embarrassing-mcg-defeat-result-breaking-29-december-2022/","keywords":["Proteas","Featured","latest cricket news","MCG","Proteas in Australia"],"creator":["Garrin Lambley"],"video_url":null,"description":"The Proteas have crashed to an embarrassing defeat in the second Test against Australia at the Melbourne Cricket Ground.","content":"The Proteas have crashed to an embarrassing defeat in the second Test against Australia at the Melbourne Cricket Ground.","pubDate":"2022-12-29 04:30:33","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Jadeja, Bumrah to not be rushed again; Pant will likely be at NCA","link":"https://www.thetimesofbengal.com/sports/jadeja-bumrah-to-not-be-rushed-again-pant-will-likely-be-at-nca/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"India’s dwelling season is about to begin with a white-ball collection towards Sri Lanka on January 3 and the squads","content":"Read Time:1 Minute, 46 Second India’s dwelling season is about to begin with a white-ball collection towards Sri Lanka on January 3 and the squads of which have been introduced on Tuesday. However, there have been no mentions of Jasprit Bumrah, Ravindra Jadeja and Rishabh Pant in T20I in addition to ODI squads. As per an ESPNCricinfo report, Bumrah and Jadeja have been out there for choice for the Sri Lanka collection, however the choice committee determined that the duo, who’ve been on the sidelines for a very long time, is not going to be rushed again into the nationwide workforce. “They need to simulate coaching for him that replicates the workload of a correct match, and see how he holds up earlier than he’s introduced again to worldwide cricket,” mentioned the report on Bumrah, who has been out of motion since his again damage had reoccurred throughout the T20Is towards Australia in September. Additionally Learn: Ranji Trophy: Not for the faint-hearted! Jadeja, then again, had been named within the ODI and Take a look at squads for the Bangladesh tour. However was withdrawn from each squads as his restoration from knee damage publish surgical procedure in September was nonetheless beneath means. “The selectors now need to see him in match simulation simply to make sure of his match health,” added the report. There’s additionally Pant, whose identify was absent from the white-ball squads for the collection towards Sri Lanka on Tuesday. However the report says that the left-handed wicketkeeper-batsman is being despatched to the Nationwide Cricket Academy (NCA) in Bangalore for energy and conditioning earlier than the four-match Take a look at collection towards Australia. This story has been sourced from a 3rd social gathering syndicated feed, businesses. Mid-day accepts no accountability or legal responsibility for its dependability, trustworthiness, reliability and information of the textual content. Mid-day administration/mid-day.com reserves the only real proper to change, delete or take away (with out discover) the content material in its absolute discretion for any cause in any respect Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 04:20:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya in lead role as India press reset button","link":"https://timesofindia.indiatimes.com/sports/cricket/sri-lanka-in-india/india-vs-sri-lanka-hardik-pandya-in-lead-role-as-india-press-reset-button/articleshow/96583991.cms","keywords":null,"creator":null,"video_url":null,"description":"For the second time in 12 months, selectors and Team India management have pressed the reset button. On Tuesday night, the selectors announced a T20I team and an ODI team to play a home series against Sri Lanka from next week, which indicates that they are looking at a future beyond established names of Indian cricket.","content":null,"pubDate":"2022-12-29 03:09:27","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Had Lot Of Difficulties With Previous Board\": Pak Star On Ramiz-Led Panel","link":"https://sports.ndtv.com/cricket/made-us-feel-like-loolhay-langray-pakistan-pacer-vents-ire-on-ramiz-raja-led-ex-pcb-management-3646457","keywords":null,"creator":null,"video_url":null,"description":"Ever since Ramiz Raja was removed from the post of Pakistan Cricket Board (PCB) chairman, several stakeholders of the game in the country have spoken out against him.","content":null,"pubDate":"2022-12-29 02:46:30","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England cricket revival, Emiliano Martinez's antics and glory for Matt Fitzpatrick - 2022 review","link":"https://www.dailymail.co.uk/sport/othersports/article-11580097/England-cricket-revival-Emiliano-Martinezs-antics-glory-Matt-Fitzpatrick-2022-review.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"With 2022 drawing to a close, it is time to reflect on the thrills and spills of the sporting world over the last 12 months. Here, Sportsmail review the year and also whet the appetite for what's to come in 2023.","content":null,"pubDate":"2022-12-29 00:46:21","image_url":"https://i.dailymail.co.uk/1s/2022/12/28/21/66000863-0-image-a-38_1672262934994.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Meet Mo Bobat - the backroom guru who's quietly helping Ben Stokes shape a cricket revolution","link":"https://www.dailymail.co.uk/sport/cricket/article-11580367/Meet-Mo-Bobat-backroom-guru-whos-quietly-helping-Ben-Stokes-shape-cricket-revolution.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY PAUL NEWMAN: It has been the year when Ben Stokes and Brendon McCullum were brought together by Rob Key to transform England and revolutionise Test cricket.","content":null,"pubDate":"2022-12-29 00:42:36","image_url":"https://i.dailymail.co.uk/1s/2022/12/28/20/65999155-0-image-a-34_1672258745853.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Melbourne Cricket Club enquires about hosting first India, Pakistan Test in 15 years","link":"https://thewest.com.au/sport/cricket/mcc-enquires-about-india-pakistan-match-c-9298498","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"The Melbourne Cricket Club are keen to host India and Pakistan in a Test match but admit the situation between the rivals is ‘complicated’.","content":null,"pubDate":"2022-12-29 00:19:53","image_url":"https://images.thewest.com.au/publication/C-9298498/d528f8f0cfd72874d12c1d47ee34ee7f4df04e74-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"MCC enquires about India-Pakistan match","link":"https://www.perthnow.com.au/sport/cricket/mcc-enquires-about-india-pakistan-match-c-9298501","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"The Melbourne Cricket Club are keen to host India and Pakistan in a Test match but admit the situation between the rivals is \"complicated\".","content":null,"pubDate":"2022-12-29 00:19:53","image_url":"https://images.perthnow.com.au/publication/C-9298501/d528f8f0cfd72874d12c1d47ee34ee7f4df04e74-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Too early to see how Tim Southee’s captaincy style will emerge, says Black Caps opener Tom Latham","link":"https://www.nzherald.co.nz/sport/cricket-too-early-to-see-how-tim-southees-captaincy-style-will-emerge-says-black-caps-opener-tom-latham/VMLRKFUC45DMXAMB7M7RIFS4BE/","keywords":null,"creator":null,"video_url":null,"description":"Even the Kiwi players aren't sure how new captain Tim Southee will change the game plan.","content":null,"pubDate":"2022-12-28 23:00:29","image_url":"https://www.nzherald.co.nz/resizer/-gx9w-otqY4k8QR06xTIIX4Q7Rw=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/5G43MQZHRBEQZPJWWAUMKTUFNY.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"What a difference a year can make in cricket","link":"https://www.arabnews.com/node/2223481/sport","keywords":null,"creator":["Mahad"],"video_url":null,"description":"Thu, 2022-12-29 (All day) As the year closes, it is possible to discern certain themes of the last twelve months that will continue in cricket for the next. First, is COVID-19. It delayed the 2020 T20 World Cup until Nov. 2021, as well as forcing its move from India to the UAE and Oman. At the same time, it disrupted England’s Ashes tour to Australia. A Test scheduled for Perth in January was switched to Tasmania at short notice because of border restrictions in Western Australia. Main category: SportCricket","content":null,"pubDate":"2022-12-28 21:00:00","image_url":null,"source_id":"arabnews","country":["saudi arabia"],"category":["sports"],"language":"english"},{"title":"Carey shows Aussies must challenge convention once more","link":"https://www.cairnspost.com.au/sport/cricket/australia-v-south-africa-follow-all-the-day-four-action-from-the-mcg/news-story/8aee1a3e9d806a9a344f19c95cc0913b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Australia has this year taught us to be careful about what we believe in cricket and it’s time to challenge convention once more.","content":null,"pubDate":"2022-12-28 20:00:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"PAK vs NZ: Pakistan ODI Squad vs New Zealand Announced, Babar Azam To Lead - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0LW5ld3MvcGFrLXZzLW56LXBha2lzdGFuLW9kaS1zcXVhZC12cy1uZXctemVhbGFuZC1hbm5vdW5jZWQtYmFiYXItYXphbS10by1sZWFkL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: Pakistan ODI Squad vs New Zealand Announced, Babar Azam To Lead  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-12-28 17:57:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh coach Domingo resigns after Test series loss to India","link":"https://thenorthlines.com/bangladesh-coach-domingo-resigns-after-test-series-loss-to-india/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Russell Domingo has stepped down from his post as Bangladesh head coach, two days after his side lost the home Test series to India. Domingo had taken over as head coach after Steve Rhodes was sacked, in September 2019. The South African was to stay on till the 2023 World Cup. “He (Domingo) sent […] The post Bangladesh coach Domingo resigns after Test series loss to India appeared first on Northlines.","content":"Agencies Russell Domingo has stepped down from his post as Bangladesh head coach, two days after his side lost the home Test series to India. Domingo had taken over as head coach after Steve Rhodes was sacked, in September 2019. The South African was to stay on till the 2023 World Cup. “He (Domingo) sent his resignation letter yesterday (Tuesday) and that is with immediate effect,” Bangladesh Cricket Board (BCB) cricket operation chairman Jalal Yunus told cricbuzz.com on Wednesday. Under Domingo’s tutelage, Bangladesh won T20I series against Australia and New Zealand at home, its first-ever Test in New Zealand, an ODI series in South Africa and at home against India. Handed a 188-run loss in the first Test, a profligate Bangladesh went down by three wickets in the second Test on Sunday at Mirpur. After the Mirpur Test, Yunus had hinted at a change. “We need a coach who has an impact and influence on the team. You will soon see some changes. We are trying. We want a very strong team that can play quality and highly competitive team. “We went close to beating India but it is tough to beat this team. We beat England and Australia in this ground, but India is a tougher side in these conditions.” “In the mainstream, motivation is important. We don’t just want a good coach, but he has to be a mentor. There’s less scope to teach them skills at this level, but the coach needs to review performances with the players after a series,” Yunus said.The post Bangladesh coach Domingo resigns after Test series loss to India appeared first on Northlines.","pubDate":"2022-12-28 17:43:25","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"BBL 2022: Match 20, SCO vs STA Match Prediction- Who will win today's BBL match between Perth Scorchers and Melbourne Stars? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMiswFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9iYmwtMjAyMi1tYXRjaC0yMC1zY28tdnMtc3RhLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy1iYmwtbWF0Y2gtYmV0d2Vlbi1wZXJ0aC1zY29yY2hlcnMtYW5kLW1lbGJvdXJuZS1zdGFycy0wMDQwL9IBuQFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9iYmwtMjAyMi1tYXRjaC0yMC1zY28tdnMtc3RhLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy1iYmwtbWF0Y2gtYmV0d2Vlbi1wZXJ0aC1zY29yY2hlcnMtYW5kLW1lbGJvdXJuZS1zdGFycy0wMDQwLz9hbXA9MQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BBL 2022: Match 20, SCO vs STA Match Prediction- Who will win today's BBL match between Perth Scorchers and Melbourne Stars?  CricTrackerPerth Scorchers v Melbourne Stars Big Bash Tips: Go big on top-bat picks  Betting.betfairBig Bash 2022-23 match preview: Perth Scorchers v Melbourne Stars  The CricketerSCO vs STA Dream11 Prediction: Perth Scorchers vs Melbourne Stars Top Fantasy Picks, Playing XIs, SCO vs STA LIVE at 3:45 PM: Follow BBL 2022 LIVE  InsideSportSCO vs STA Dream11 Prediction, Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates for Today Match 20  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-12-28 17:00:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Williamson and Latham, the two constants of New Zealand cricket - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2thbmUtd2lsbGlhbXNvbi1hbmQtdG9tLWxhdGhhbS1zaG93LXRoZXktYXJlLXRoZS1jb25zdGFudHMtb2YtbnotY3JpY2tldC1hZ2FpbnN0LXBha2lzdGFuLWluLWthcmFjaGktMTM1MTUwNNIBnAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2thbmUtd2lsbGlhbXNvbi1hbmQtdG9tLWxhdGhhbS1zaG93LXRoZXktYXJlLXRoZS1jb25zdGFudHMtb2YtbnotY3JpY2tldC1hZ2FpbnN0LXBha2lzdGFuLWluLWthcmFjaGktMTM1MTUwND9wbGF0Zm9ybT1hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Williamson and Latham, the two constants of New Zealand cricket  ESPNcricinfo","content":null,"pubDate":"2022-12-28 16:59:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia eye victory after Carey century in second South Africa Test","link":"https://www.kuwaittimes.com/australia-eye-victory-after-carey-century-in-second-south-africa-test/","keywords":["Cricket","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"MELBOURNE: Australia closed in on winning the second Test and the series against South Africa on Wednesday after Alex Carey struck a maiden century to leave them in a commanding position. The hosts declared at tea on 575-8 on day three with an ominous lead of 386 after South Africa were bowled out in their … The post Australia eye victory after Carey century in second South Africa Test appeared first on Kuwait Times.","content":"Australia closed in on winning the second Test and the series against South Africa on Wednesday after Alex Carey struck a maiden century to leave them in a commanding position. The hosts declared at tea on 575-8 on day three with an ominous lead of 386 after South Africa were bowled out in their first innings for 189. In reply, the Proteas were 15-1 when play was abandoned early at the Melbourne Cricket Ground due to persistent drizzle. Their bid to save the Test, and the three-match series after losing the opener in Brisbane, got off to a horror start with under-pressure skipper Dean Elgar caught by Carey off Pat Cummins without scoring in the second over. Theunis de Bruyn, who was dropped by David Warner on three, was not out six alongside Sarel Erwee on seven. Wicketkeeper Carey, playing in his 14th Test, was superb in reaching three figures for the first time before he was caught and bowled by Marco Jansen for 111. At the declaration, a battling Cameron Green was not out 51 despite a fractured finger, alongside Mitchell Starc on 10. “It was nice to be able to consolidate from our start from yesterday,” Carey, only the second wicketkeeper to make a Test century at the MCG after Rod Marsh, told reporters. “This one’s really special, obviously it’s a big moment. But it’s also great to help the Australian cricket team be in a strong position. That’s what we play for, to win games.” Carey and Green piled on the misery in a 117-run partnership after South Africa gave themselves a glimmer of hope with early wickets, including Warner first ball after he resumed on 200. Australia began on 386-3 with Travis Head on 48 and Carey on nine after a herculean unbeaten double century from Warner in his 100th Test in gruelling heat on day two. The veteran opener retired exhausted with severe cramp after making his third Test double ton, but he returned to the crease when Head was out for 51. He told host broadcaster Fox before play began that he had a “rough night’s sleep”. “I probably woke up six or seven times,” he added, and was bowled first ball by an Anrich Nortje yorker as Australia lost three wickets for five runs. Temperatures were much cooler than the 37 degrees Celsius (98.6 Fahrenheit) on Tuesday, with conditions overcast and humid-generally favourable to the bowlers. And the ever-dangerous Anrich Nortje took advantage, bowling Head in the third over before snaring a bewildered Warner next ball. “In general it has been a tough three days for us as a bowling unit,” admitted Proteas bowling coach Charl Langeveldt. “Kagi (Rabada) wasn’t on song and a few of the other guys in periods didn’t bowl well as a unit. It’s important for us to get the consistency going, but it hasn’t been there for us in this game.” “We have to take it hour by hour tomorrow and just try and get runs and see where it goes from there,” he added. Pat Cummins fell to the third ball he faced when South Africa successfully reviewed a caught behind decision off Rabada’s bowling that was initially denied by the umpire. Carey was joined by Nathan Lyon and they steadied the ship with the spinner making an entertaining 25. Ahead of play, Green, who took 5-27 in South Africa’s first innings, was ruled out of bowling again in Melbourne-and the third Sydney Test-with a fractured finger, but he bravely came out to bat. After a slow start, he began playing his shots in an admirable supporting role to Carey, who counter-attacked after the early wickets fell to consolidate Australia’s advantage. – AFP","pubDate":"2022-12-28 16:55:26","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Philippe, Dwarshuis lead Sixers to third straight victory | BBL|12 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9dnNRZm5YSC1YTDTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Philippe, Dwarshuis lead Sixers to third straight victory | BBL|12  cricket.com.auSIX vs REN Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- KFC Big Bash League  Cricket AddictorSydney Sixers v Melbourne Renegades, Big Bash 2022-23: score, scorecard, result, report  The CricketerBen Dwarshuis bowls Sydney Sixers to comfortable win | Cricbuzz.com - Cricbuzz  CricbuzzSixers down 'Gades for third straight win | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-12-28 16:45:01","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}