{"newsArray":[{"title":"Why the Pele Legacy transcends mere Football Greatness","link":"https://kawowo.com/2023/01/08/why-the-pele-legacy-transcends-mere-football-greatness/","keywords":["Football","Opinion"],"creator":["Timothy Kuteesa"],"video_url":null,"description":"For most if not all fans intimately acquainted with the beautiful game today, a conventional disregard for the insurmountable deeds of players from past generations has more often than not proved to be the centre of disqualification in the conversation about the “Greatest of All Time” (G.O.A.T). Their arguments often revolve around matters like; football […] The post Why the Pele Legacy transcends mere Football Greatness appeared first on Kawowo Sports.","content":"For most if not all fans intimately acquainted with the beautiful game today, a conventional disregard for the insurmountable deeds of players from past generations has more often than not proved to be the centre of disqualification in the conversation about the “Greatest of All Time” (G.O.A.T). Their arguments often revolve around matters like; football wasn’t as modernised and competitive then, players weren’t as astute, such players did not even play in Europe, and so forth. This has never been more relevant than in the case of Edson Arantes do Nascimento, simply known as Pelé. Regarded by many as football’s godfather, the Brazilian has left behind a legacy that will stand the litmus test of time, and a reputation that might never ever be challenged. He was the first footballer to marvel the world in unison at a turbulent time, a global icon that earned worldwide popularity courtesy of his artistry even before the game was fully globalised, and of course, used this fame to elevate footballers to celebrity status. In fact, the player of the century is the mould upon which all modern footballers were and continue to be shaped. He did not just shape the FIFA World Cup narrative, he literally built that house; the only player with three winner’s medals in football’s most coveted competition – a record that has existed since his last championship in Mexico 1970. He danced to his own beat while on the pitch, set new ethnic standards, changed the entire outlook of the game and redefined greatness, sold football to all corners of the world and did so with neither internet nor social media. Off the pitch, Pelé changed geopolitics with a modest approach and established himself as the voice the world listened to, especially when his presence with Santos in Nigeria for a friendly game against the Super Eagles in 1967 caused a 48-hour ceasefire between the country’s two warring factions. Actually, Pelé is to football what Martin Luther King Junior is to the black community in the US and that precisely explains why his legacy simply stretches beyond; a skills workshop on pitch, scoring of incredible goals in the most acrobatic of ways, achieving individual accolades with both his club Santos and Brazil, and everything football has to offer. He might just be in the conversation of the greatest athlete or sportsperson to ever walk the earth given his influence on the entire world. Now that I think about it, Pelé with a political stand (and he never took one) could have been bigger than Muhammad Ali. While debates for who is the G.O.A.T still continue to linger, and two Argentinians; Diego Armando Maradona (now deceased) and Lionel Messi come to mind, the reality is that majority oldtimers give Pelé the edge not only because of his staggering achievements, but also the influence and role in selling football to all corners of the world. It is imperative to remember that before the turn of the millennium, Pelé signed for New York Cosmos, an enormous deal at the time that saw him earn annual wages of $1.4M, all this geared towards promoting the game in the US. This indeed made the Major League Soccer (MLS) more marketable and ultimately grew it. So then, why is Pelé regarded as the G.O.A.T? Why does his legacy stretch beyond football? Why are his achievements so impregnable? What was so special about him that got the world craving a piece of his mastery? How good was he really and why is his legacy something worth writing home about? To understand this to the letter, one needs to take a walk down memory lane, into the life of football’s most celebrated person and exciting talent of the late 1950s, 60s, and 70s before hanging his playing boots in October 1977. Born 52 years after slavery was abolished in Brazil and right into the turbulent times of World War II (1940), Pelé was clearly not about to know any privilege given that his family was classified as not well off. “Pelé’s story is a tribute to the democratic nature of the game, for he saw first-hand what poverty looked like. Actually, this reality provided him with the best motivation as a shoe shine boy and he would later end up shining more brightly than anyone in the history of the game,” highlighted Brazilian journalist Tim Vickery. Indeed, the game though traditionally unforgiving, punishing – as it so often does – any whiff of a mistake, can be accommodating to anyone, regardless of their background, provided one exhibits sophistication in artistry and stoicism of a veteran. That was Pelé according to the majority that saw him hit the floor and stamp the yard. Actually watching his clips had me extremely ecstatic and feeling like a player from the modern game – with all the benefits was taken back to show the old-timers how it is done. This probably explains why the Brazilian was no ordinary player even during his inception to football. Before cracking the code in his debut FIFA World Cup championship with Brazil (Sweden 1958), where he brilliantly wrote his own history with 6 goals in four games, including a hat-trick against an incredible French side that had the luxury of fielding Just Fontaine, and a brace in the final against the hosts at just 17 years old, the game knew a different definition of greatness, one not quite as glaringly special as what the youngster presented. He allowed his country to dream when they had no business doing so and enthralled an entire generation. Football had a love affair with super teams like a Hungary side led by Ferenc Puskas in Switzerland 1954 that played a brand we have come to associate with as “ ” before Pelé, as explained by a senior Brazilian editor Juca Kfouri in a podcast; “Football has known three super teams that never won a World Cup but got the world talking, Hungary in 1954, Holland in 1974, and Brazil in 1982,” he said before confirming; “There were good players like; Puskas, the Italian Giuseppe Meazza, Jose Nassazi from Uruguay and Brazilians like; Leonidas, Ademir or even Ziznho but the coming of Pelé changed everything.” That said, for those still inquisitive, here is some more perspective; “There are two major reasons why Pelé is the greatest ever,” Kfouri highlights as he continues to say; “One, his achievements and two, his influence on the game. When you think about football, the first thing that comes to mind is Pelé.” Indeed, winning the FIFA World Cup thrice comes in handy and Pelé withered all the storm considering the conditions under which the game was played then. His ability to stand adversity does not also get mentioned enough as he considered quitting on a number of occasions but changed his mind right after. He found a nation with a reputation of failure at the grand stage, a laughing stock on the continent-trolled by rivals and two-time world champions Uruguay, and made Brazil the most successful nation in the tournament with three championships during his tenure (They have since become five championships including; US 1994 and South Korea & Japan 2002). “For Brazil, the disappointment in the 1950 World Cup hurt deep, it led to the team not playing for two years and when they decided to come back, they changed colour from the black and white to the now iconic yellow and blue so as to start fresh. He (Pele) provided that fresh start for the country,” Kfouri concluded. After his masterclass in Sweden (1958) where he won the Young Player of the tournament Award, Pelé found the following FIFA World Cup edition in Chile not as hospitable as the Brazilians struggled to live with the hard but yet fair style of the Europeans. He got injured in their second group stage game against Czechoslovakia and that marked the end of his tournament. That simply meant that Brazil more than ever sought inspiration from one of his teammates to step up and deliver the Holy Grail, and who better to do so than the other wonderkid in the team; Manuel Francisco dos Santos, commonly known as Mané Garrincha. Branded a cripple as a child, Garrincha had an extraordinary story of his own-as it disturbed many how he had defied the odds and could play the game so lifelessly. A master of craft with the dribbles, Garrincha is regarded by many as one of the most talented players to ever play the game, and make no mistake about it, Chile 1962 helped shape this narrative. He was instrumental throughout the tournament and helped Brazil to a 3-1 win against Czechoslovakia at the final stage, helping Brazil defend the championship to become the second and last nation to do so after Italy in 1938. This exceptionally saw him win both the Golden Ball and Golden Shoe (boat) with 4 goals while at it. While Chile 1962 gave Pelé his second FIFA World Cup gold, it isn’t as memorable for him and his legendary as Mexico 1970 is, since the latter helped cement his legacy in the aftermath of the disappointment in England 1966-where Brazil did not even leave the group stages as explained by former Brazilian commentator Luiz Mendez. “That was Pelé winning it with the greatest Brazilian squad the world has ever seen,” he deduced before he would make a comparison; “Of course, there is always talk of the Brazilian squad in Spain 1982 but they won nothing much as they were very talented.” “That team had; Fëlix, Everard, Piazza, Brito, Carlos Alberto the captain, Gērson-who was the engine in that midfield with Clodoaldo and Rivellino, the attack had Tostäo, Jairzinho-who scored in all six games, and most importantly, the team had Pelé who was not even going for the tournament because of the insecurity in Brazil thanks to the military leadership, until he was convinced by the sports president,” Mendez stated. The team also had Mario Zagallo as coach, a loyal servant that had captained his nation during the glory of 1958 and 1962 and needed no invitation to instil a winning mentality. The fact that Brazil were not even favourites, following the debacle in 1966 helped take some pressure off the players, but not Pelé being the only player in the team that had been part of the class of 1958. For Pelé, extra pressure was derived from the fact that he had chosen Mexico to be his last dance ground in the yellow and blue and needed no motivation to pounce. As a matter of fact, Brazil did not disappoint, playing with a style and swagger quite synonymous with them. The navigation through the knockouts against Peru where Didi was now coach, and a revenge against Uruguay for the 1950 Maracana agony in the quarter and semifinals respectively couldn’t have come any sweeter. The final against Italy would prove to be Brazil’s easiest game of the tournament as they scored four goals, including a brilliantly executed team goal for the fourth. The kind of goal where every single Brazilian player on the pitch had a touch on the ball, the decisive moment coming from Clodoadlo bossing the ball in midfield and finding Rivellino, who played it in the path of Jairzinhno, the winger finding Pelé whose instinctive nature didn’t even suggest he looks before laying the ball in the path of Carlos Alberto to finish in a sublime manner and seal the game with arguably the greatest team goal in FIFA World Cup history. Pelé rightfully won the Golden Ball for the most valuable player at the tournament as his teammates rushed to wax lyrical about his obviously immense contributions and mastery exhibited. “We always loved to say that Pelé’s thought process was so quick, he thought and executed in a very short time. I don’t think there will ever be a player quite like him,” Fēlix highlighted while Pelé’s captain and coach Mario Zagallo maintained that; “The calm that other players had in the centre circle, Pelé had it in the penalty area.” Meanwhile, Italian centre-half and losing finalist in 1970, Burgnich admitted that; “I took the field thinking that Pelé was another player, I told myself that he was made of skin and bones, but I was wrong.” Pelé had yet again conquered the world and redefined success. The Mexico 1970 FIFA World Cup being the first edition to be televised globally in colour, would later become the single edition upon which subsequent FIFA World Cups are measured, Brazil would become the team upon which subsequent teams would be measured, and of course Pelé would become the player subsequent players would be measured, a poetic summation. Let’s digest the second reason for Pelé’s GOAT status. Shall we? His influence and what he gave the game. So often when one speaks about greatness, it’s the achievements and influence that tend to take precedence. Think about the sport of golf for a minute; while Jack Nichlaus a.k.a “Golden Bear” is widely celebrated and has outrageous stats, the majority argue that Tiger Woods takes the G.O.A.T status because of his role in selling the game beyond the borders the sport knew. I would wager that if you said the word “Golf” to a group of people today, regardless of their age, status or race, their first response would be Tiger Woods, and that seals his reputation in the sport. A little more perspective now in the sport of Tennis, shall we? While Margaret Court might have sealed her legacy in the female tennis division with 24 major Grand slams, despite Serena Williams coming so close with 23, the jury is still out there for the male division with the two athletes still active; Novak Djokovic and Rafa Nadal. Many that however fell in love with the finesse and beauty that came with Roja Federer’s game will have him as a favourite, but as fact will have it, Djokovic and Nadal will still go the long way. Does it give you some context about where this is going? If not yet, then hold on to your seat belts! Those that have had a chance to watch the Netflix series; “Last Dance”, should have been able to catch my drift by now. Michael Jordan is regarded as the G.O.A.T in the NBA but was he the most talented ever? Those that watched; Wilt Chamberlain, Larry Bird, Magic Johnson, or even Kobe Bryant and LeBron James (the list is long) will either disagree or plead the fifth with you. So if Jordan wasn’t the most talented, why is he the G.O.A.T? Two reasons still; achievements and role in the globalisation of the game. Jordan won six rings with the Chicago Bulls, a one-franchise player, winning six rings? That makes for a Hollywood blockbuster, something none of his competitors have. The NBA was also marketed around Jordan at the turn of the millennium and everyone born in the 90s like your Columnist followed the NBA because Jordan was marketing it. Those are two intangibles none of his competitors has, just like is the case with Pelé in football. Was Pelé the most talented player to ever play the game? Maybe yes, maybe not but that’s not the issue because greatness must at least have an inclination to achievements and influence. There isn’t a player that influenced or achieved more from the game of football than Pelé considering the fact that the FIFA World Cup is the single greatest achievement in the sport. Maradona often comes to mind because of his incredible career, headlined by his heroic deeds as he single-handedly turned Italian side Napoli into a title contender and won the 1987 and 1990 Italian championships, eventually having his retired by the club in his honour after retiring from the game. His magical FIFA World Cup triumph in Mexico 1986 also goes without mention given the level of high calibre mentality and performances to lift his Argentine side past a good West Germany team in the finals. All this puts him in the conversation but did he achieve more than Pelé? You have your answer. First forward to Lionel Messi, a player that has had an illustrious career with a litany of achievements. Where does someone even start? Is it on loads of goals, or the mouthwatering manner under which he takes them, is it the seven Ballon d’Or (and they could soon be eight) or the other individual accolades? I ran out of fingers counting. However, what’s important and brings relevance to this conversation is his recent glory, clinching the FIFA World Cup 2022 championship in Qatar to cement his legacy as the greatest of his generation. Has he achieved more or even enthralled a generation like the Brazilian magnifico did? You still have your answer. To reiterate this more, the greatest achievement in the game of football is a World Cup gold, at least according to football’s governing body (FIFA), Pelé has three and his major competitors can’t beat that. Furthermore, the notion that not playing in Europe disqualifies Pele from the conversation is as absurd as it is laughable. It is guided by some subjective European journalists and pundits that have engendered the kind of narrative that one has to play in their top leagues to be great. The only reason why Pelé never played in Europe was because of a bill enacted in 1961 by Janio Quadros, the Brazilian president then. A bill that rendered Pele a national treasure who was not to leave Brazil to play for any other club around the world. Perhaps he would have won the Ballon d’Or every single season had he played in Europe. We shall certainly never know. If the argument that Pelé isn’t the G.O.A.T because he never played in Europe holds any water, then the Brazilian squad of 1982 coached by Tele Santana should also be disqualified as greats being that none of those players played in Europe, the stars of the team played in the Brazilian topflight league; Zico played for Flamengo, Falcao played for SC Internacional, the captain Socratis played for Corinthians and Botafogo a bit earlier in his career, and so forth. This never stopped them from still managing to marvel the world. Exceptional talent is exceptional talent regardless of where they play and that should be accounted for. The goals that Pelé scored in his career continue to be the benchmark for today’s stats with the likes of; Josef Bican, Cristiano Ronaldo and Lionel Messi keeping up with this milestone. Even after his illustrious career and during a three-year stint as the Minister of Sports for Brazil (between 1995 and 1998), Pelé still explored the motivation that his service did not need to be a zero-sum game and dedicated himself to unconditional service. He found pleasure in serving the game he loved so dearly, the game that made him an international icon, and a worldwide star. His autobiography continues to be an inspiration for movies including the 2016 masterpiece which highlights the scenes of the FIFA World Cup 1958 in Sweden. No prizes for guessing whether more movies will be made about his life. While the stranger has yet again visited the beautiful game and cast a dark shadow that has seen football’s brightest light burn out, and as he goes ahead to pitch up in heaven, there is no doubt that the world will always remember Pelé as the Brazilian that used football to make humanity dream. His passing has been felt deeply across the game’s stark divide considering that his life straddled a little over eight decades, hopping metaphorically, if not literally from sports to humanitarianism-sports to sports politics. He was unparalleled as a player and undisputedly conquered the most shimmering stage in football to breathe life into the supposition that renders him the Greatest sportsperson of All Time. Rest in Peace Legend.","pubDate":"2023-01-07 23:09:44","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"Damar Hamlin posts on social media for first time since NFL star's on-field cardiac arrest","link":"https://www.irishmirror.ie/sport/other-sport/damar-hamlin-social-media-nfl-28900900","keywords":["Sport"],"creator":["news@irishmirror.ie (Andrew Gamble)"],"video_url":null,"description":"Damar Hamlin took to social media to send a message to fans who have supported him after the Buffalo Bills safety suffered a cardiac arrest on Monday Night Football","content":"Buffalo Bills star Damar Hamlin has posted on social media for the first time since suffering a cardiac arrest during an NFL match on Monday. During the crucial clash between the Bills and Cincinnati Bengals, Hamlin collapsed on the turf midway through the first quarter. The 24-year-old fell after making a tackle on Bengals receiver Tee Higgins and had to be revived on the field before he was rushed to the University of Cincinnati hospital. The match was understandably suspended as no players were in the right state to continue playing, while there was a tsunami of support for Hamlin and his family in the aftermath of the worrying scene. On Thursday, University of Cincinnati Health physicians Dr. Timothy Pritts and Dr. William Knight announced Hamlin began to wake up that morning, while they confirmed his neurological function was intact. On Friday, the Bills revealed the physicians at UCMC confirmed Hamlin’s breathing tube had been removed overnight and the safety has reportedly spoken to his family, his care team and Bills teammates ahead of their final match of the regular season on Sunday. Buffalo can clinch the first seed in the AFC with a win over the New England Patriots. Amid positive news surrounding his remarkable recovery progress, Hamlin has posted on social media for the first time since suffering a cardiac arrest during Monday Night Football. He took to Instagram to write: “When you put real love out into the world it comes back to you 3x's as much. “The love has been overwhelming but I'm thankful for every single person that prayed for me and reached out. We brung (sic) the world back together behind this. If you know me you know this only gone make me stronger. “On a long road keep praying for me!” Ahead of the final week in the 2022 regular season, the NFL announced a number of gestures to support Hamlin as he begins his road to recovery, with all 32 teams encouraged to read a special message before kickoff as a unified show of solidarity for the Buffalo safety. Meanwhile, the Bills revealed they are set to wear special jersey patches displaying the no.3 - Hamlin’s jersey number - when they face the Patriots on Sunday. The NFL have also allowed teams to outline the ’3’ at each 30-yard line marker in the Bills’ iconic blue or red colours. Finally, all players will be permitted to wear black Nike t-shirts that display the message: “Love for Damar 3.” The Bills are set to wrap up their regular season campaign against the Patriots this week, with their AFC East rivals needing to win to clinch a spot in the postseason. It’s a huge match for Buffalo too, as the first seed in the AFC could be on the line - and the franchise will undoubtedly want to secure the win as the ultimate tribute to Hamlin.","pubDate":"2023-01-07 22:47:58","image_url":"https://i2-prod.mirror.co.uk/incoming/article28900782.ece/ALTERNATES/s98/0_Steelers-Bills-Football-Orchard-Park-United-States-09-Oct-2022.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Football: FA Cup holders Liverpool face replay after Wolves draw","link":"https://www.straitstimes.com/sport/football/football-fa-cup-holders-liverpool-face-replay-after-wolves-draw","keywords":null,"creator":null,"video_url":null,"description":"January 08, 2023 6:29 AMVisitors have a late goal chalked off for offside, in a breathless third-round tie.","content":"LIVERPOOL, England - Holders Liverpool were held to a 2-2 home draw by Wolverhampton Wanderers in the FA Cup on Saturday and will now face a replay after a breathless third-round tie in which the visitors had a late goal chalked off for offside. Liverpool fell behind after 26 minutes following a howler from goalkeeper Alisson who attempted to play a pass out from the back but directed the ball to the feet of Goncalo Guedes, who slotted it into the empty net. The hosts, however, entered the break level after a superb cross-field Trent Alexander-Arnold pass was met by Darwin Nunez on the volley, who directed the ball past Matija Sarkic. A defensive mix-up then handed the lead to Liverpool, with Mohamed Salah producing a calm finish after Wolves defender Toti flicked a Liverpool pass into his path. Wolves did not let up in their intensity after going behind and were rewarded as Hwang Hee-chan sneaked the ball between Alisson’s legs after being threaded through by fellow substitute Matheus Cunha. The visitors thought they were close to knocking Liverpool out of the competition as Toti flicked the ball into the Reds’ net, and sprinted away in celebration, taking off his shirt, but his effort was ruled out for offside. The decision to disallow the goal sparked a furious reaction from Wolves manager Julen Lopetegui, who received a booking from the referee for his protests. “It was a good start, a dominant start,” Liverpool manager Juergen Klopp told ITV. “We played really good football moments and then we concede. The goal should not happen, but we all know how often Ali (Alisson) saves our backsides. “They had counter-attacks before then, it is always dangerous when (Adama) Traore gets the ball. We could see that. We came back with a fantastic equaliser, everything was clear at halftime what we wanted to improve and change to cause them more problems. “Then it was a dominant performance before they got a foot in the game and we didn’t win enough challenges from there. They caused us massive problems. We kept the problems in the game. The equaliser was unlucky, but he should not be able to work into our box.” Liverpool’s Cody Gakpo’s made his debut after joining from PSV Eindhoven at the start of the January transfer window. “He (Gakpo) fitted into the game,” Klopp said. “It was not easy for a first step. We cannot expect it to be perfect, but he showed good signs. We have to get him in better positions but that will come no doubt.” REUTERS","pubDate":"2023-01-07 22:29:56","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Football: Newcastle stunned in FA Cup, but West Ham, Spurs, Leicester progress","link":"https://www.straitstimes.com/sport/football/football-newcastle-stunned-in-fa-cup-but-west-ham-spurs-leicester-progress","keywords":null,"creator":null,"video_url":null,"description":"January 08, 2023 5:42 AMTottenham Hotspur and Leicester City record 1-0 wins over Portsmouth and Gillingham respectively.","content":"LONDON - Premier League Newcastle United were on the receiving end of a shock 2-1 defeat away to third-tier Sheffield Wednesday as they crashed out of the FA Cup in the third round on Saturday, while West Ham United beat Brentford in a top-flight showdown. West Ham secured their ticket to the fourth round after Said Benrahma scored a stunning long-range effort against his former club in a 1-0 win at Brentford. Tottenham Hotspur and Leicester City recorded 1-0 victories over Portsmouth and Gillingham respectively. Josh Windass netted twice for Wednesday as they took a two-goal lead over Newcastle in the second half. While Bruno Guimaraes pulled one back for Newcastle in the 69th minute, tapping in from close range, they could not find a leveller. There had been few opportunities for either side as West Ham travelled to Brentford before substitute Benrahma rushed forward and unleashed a powerful effort from distance to break the deadlock with his side’s first shot on target in the 79th minute. Brentford had the better of the limited first-half chances, with Yoanne Wissa denied from close range by Lukas Fabianski. Yet they did little in the way of replicating the form which saw them lead 2-0 after 43 minutes against West Ham when they met in the Premier League eight days ago. Brentford manager Thomas Frank made seven changes from the side that beat Liverpool in the league on Monday and they were lacking in quality, managing only one shot on target. Thomas Soucek went the closest to opening West Ham’s account shortly after the break but he miscued his effort from five metres out and directed Emerson’s cross wide of goal. The visiting supporters had been singing Benrahma’s name throughout the match, and the Algerian provided his side with the spark they needed in the final third to avoid a replay and reach the next round. Brentford are now out of both domestic cup competitions, having exited the League Cup after a loss to League Two Gillingham in November. Elsewhere, Premier League sides Bournemouth and Nottingham Forest suffered defeats by Championship teams Burnley and Blackpool respectively. REUTERS","pubDate":"2023-01-07 21:42:13","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Football: Newcastle shocked by third-tier Sheffield Wednesday in FA Cup","link":"https://www.straitstimes.com/sport/football/football-newcastle-shocked-by-third-tier-sheffield-wednesday-in-fa-cup","keywords":null,"creator":null,"video_url":null,"description":"January 08, 2023 5:24 AMNewcastle were the dominant side, but failed to make the most of it.","content":"SHEFFIELD, England - Premier League high-flyers Newcastle United were shocked by third-tier Sheffield Wednesday on Saturday as they suffered a 2-1 away defeat to crash out of the FA Cup in the third round. Newcastle, who sit third in the top flight, fell two goals behind as League One side Sheffield Wednesday’s Josh Windass netted twice in the second half. Windass opened the scoring as he finished off an intricate move in the 52nd minute before doubling his side’s advantage when he coolly slotted past Newcastle goalkeeper Martin Dubravka later in the half after running through a gap in the middle of the defence. “It’s one of the proudest moments in my managerial career to date,” Wednesday manager Darren Moore told the BBC. “I’m really pleased for everybody at the club and I’m delighted for the players. We were up against a really good team and put in an excellent performance.” Eddie Howe’s Newcastle were the dominant side with 76 per cent of the possession and 22 shots compared with the hosts’ nine, yet they failed to make the most of it. Bruno Guimaraes pulled one back for Newcastle in the 69th minute as he tapped in from close range after Cameron Dawson did well to stop Chris Wood’s initial effort from a corner, but it was little more than a consolation. Dawson was called into action throughout the game to keep the dream alive for Wednesday, and his manager highlighted the importance of his performance. He added: “We didn’t allow them to settle into their rhythm and that gave us some hope in the game. I thought every one of them did well. “Josh Windass will get the headlines but Cameron Dawson pulled off a couple of great saves. You know you’re going to get tested against teams like this so your keeper has to concentrate and be in the right place when needed, and he was.” Newcastle manager Howe highlighted that he thought his team should’ve made the most of the chances they created. He told the BBC: “(We are) bitterly disappointed to go out, I thought the performance was okay. “We created enough chances to win the tie and their goalkeeper made a number of great saves but we weren’t clinical enough when those presentable opportunities were there. “We have to accept the defeat and Sheffield Wednesday battled for everything, as we did, but it wasn’t to be.” REUTERS","pubDate":"2023-01-07 21:24:30","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Desert Oasis athlete was cleared to play flag football, father says","link":"https://www.reviewjournal.com/local/local-las-vegas/desert-oasis-athlete-was-cleared-to-play-flag-football-father-says-2708184/","keywords":["Education","Local","Local Las Vegas","News","Sports","mc-local"],"creator":["Sabrina Schnur"],"video_url":null,"description":"Although Ashari Hughes had a medical issue, doctors had agreed the 16-year-old could play the game she called “the love of her life,” her father said.","content":"Ever since she was 11, Ashari Hughes had always wanted to play flag football. Although she had a medical issue, doctors had agreed that the 16-year-old could play the game she called “the love of her life,” including during her sophomore season at Desert Oasis High School. “We let her continue to play with the stipulations that we have to trust her to make the best decision when she’s feeling her chest getting tight,” her father, Enttroda Hughes, wrote in a message to the Review-Journal Saturday. He did not share details about her medical issue. Ashari Hughes collapsed after a flag football game at Desert Oasis on Thursday night and died within hours. Her cause and manner of death had not been determined as of Saturday. “Vibrant, intelligent, beautiful, resilient, and determined are just a few of the words to describe one phenomenal human being who has inspired and impacted so many lives in the 16 years she shared with us,” Enttroda Hughes wrote in the message. His daughter had just finished a game against Valley High School. The Clark County School District said that student athletes undergo an annual physical before each season and that each student athlete must complete a pre-participation history form. Ashari Hughes told her parents at age 11 that she wanted to play flag football and played on Centennial High School’s junior varsity team her freshman year before moving to Desert Oasis and playing varsity. “She went from being terrified her first day of practice to not only making the team but dominating the field!” her father wrote, noting she also trained with a separate coach outside of school. Her parents said she maintained good grades, taking advanced placement classes as a sophomore, and they called her a leader in everything she did. The family has started an online fundraiser for funeral costs called “Ashari Hughes” on GoFundMe. Contact Sabrina Schnur at sschnur@reviewjournal.com or 702-383-0278. Follow @sabrina_schnur on Twitter.","pubDate":"2023-01-07 20:32:19","image_url":null,"source_id":"reviewjournal","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Football: Wenger to help 'sleeping giant' India develop football talent","link":"https://www.straitstimes.com/sport/football/football-wenger-to-help-sleeping-giant-india-develop-football-talent","keywords":null,"creator":null,"video_url":null,"description":"January 08, 2023 3:56 AMIndia aims to be a football powerhouse by 2047 – the country’s centenary of independence.","content":"NEW DELHI - Former Arsenal manager Arsene Wenger will work with India to develop football talent as the sport’s national federation attempts to overhaul its “identity and philosophy”, the organisation revealed on Saturday. India, once called a “sleeping giant” of football by former Fifa president Sepp Blatter, are 106th in world rankings and struggle to grab public attention in the cricket-obsessed country. The All India Football Federation (AIFF) has struggled with governance issues and was temporarily suspended by football world governing body Fifa last year. Fresh elections followed in September and the AIFF is now eyeing big changes with the help of 73-year-old Frenchman Wenger. “We will have a data driven scouting system in place for the national team,” secretary general Shaji Prabhakaran told reporters on Saturday. “We are going to work on this project with Fifa and Arsene Wenger is personally going to devote his time.” Wenger is currently working for Fifa as its head of global football development. AIFF president Kalyan Chaubey did not specify Wenger’s exact role in the talent development programme but said the excercise would be key to making India a football powerhouse by 2047 – the country’s centenary of independence. “We are not going to sell dreams,” he said. “We have to build the foundations of a strong structure and build our own identity and philosophy.” Croatian Igor Stimac has been India’s head coach since 2019. India hosted the Under-17 World Cup in 2017 and the women’s edition last year. AFP","pubDate":"2023-01-07 19:56:19","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Football: Ronaldo clear for Saudi debut on Jan 22, says club source","link":"https://www.straitstimes.com/sport/football/football-ronaldo-clear-for-saudi-debut-on-jan-22-says-club-source","keywords":null,"creator":null,"video_url":null,"description":"January 08, 2023 3:48 AMRonaldo joined the squad list after Al Nassr terminated Man United-linked striker Vincent Aboubakar.","content":null,"pubDate":"2023-01-07 19:48:25","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"VIDEO. Football - Coupe de France : un joueur d’Hyères hospitalisé en réanimation après avoir été blessé par le défenseur de l'OM Eric Bailly","link":"https://www.lindependant.fr/2023/01/07/video-football-coupe-de-france-un-joueur-dhyeres-hospitalise-en-reanimation-apres-avoir-ete-blesse-par-le-defenseur-de-lom-eric-bailly-10911002.php","keywords":["Sport"],"creator":null,"video_url":null,"description":"Le milieu de terrain d’Hyères (N2) Almike Moussa N'Diaye, blessé samedi par le Marseillais Eric Bailly, a été transporté à l'Hôpital Nord de Marseille où il a été admis en service de réanimation, a fait savoir à l'AFP...","content":null,"pubDate":"2023-01-07 19:40:02","image_url":"https://images.lindependant.fr/api/v1/images/view/63b9c963a4f4b53f0f349315/standard/image.jpg?v=1","source_id":"lindependant","country":["france"],"category":["sports"],"language":"french"},{"title":"Football : Nîmes Olympique encore vraiment loin du but","link":"https://www.midilibre.fr/2023/01/07/football-nimes-olympique-encore-vraiment-loin-du-but-10910955.php","keywords":["Football"],"creator":null,"video_url":null,"description":"À Grenoble, où ils ont été éliminés samedi de la Coupe de France (1-0), les Crocos ont été inoffensifs en attaque.","content":null,"pubDate":"2023-01-07 19:22:42","image_url":"https://images.midilibre.fr/api/v1/images/view/63b9c12bedcdbd213f374406/standard/image.jpg?v=1","source_id":"midilibre","country":["france"],"category":["sports"],"language":"french"},{"title":"Kuwait lose to Qatar in opener","link":"https://www.kuwaittimes.com/kuwait-lose-to-qatar-in-opener/","keywords":["Football","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"BASRA: Kuwaiti lost its first match in the Arabian Gulf Cup (Khaleeji Zain 25) against Qatar on Saturday, with two clean goals in the first-round match of the second group of the tournament, which is being held in Basra and will continue until Jan 19. Qatar advanced in the first half of the match, which … The post Kuwait lose to Qatar in opener appeared first on Kuwait Times.","content":"Kuwaiti lost its first match in the Arabian Gulf Cup (Khaleeji Zain 25) against Qatar on Saturday, with two clean goals in the first-round match of the second group of the tournament, which is being held in Basra and will continue until Jan 19. Qatar advanced in the first half of the match, which was held at Al Mina Stadium, with goals scored by Amr Abdel Fattah in the 23rd minute through a perfect shot from the edge of the penalty area and Ahmed Alaa El-Din in the 38th minute through a penalty kick. The Kuwaiti team was active in the second half, and its players missed several chances through Eid Al-Rashidi, Shuaib Al-Khalidi, Mubarak Al-Fenini and Faisal Zayed. Qatar now tops the group with three points on goal difference from Bahrain, which finished second after winning earlier against the UAE. UAE and Kuwait occupy third and fourth places respectively without any points. Sunday will be a rest day for all participating teams. Matches resume on Monday with two matches in the second round of Group A, as leaders Saudi Arabia play Iraq, the host of the tournament, and Oman play Yemen. Titleholders Bahrain gained three points after Kamil Al-Aswad and Jassim Al-Sheikh scored in the 60th and 77th minute, respectively. UAE’s sole goal was scored at 92th minute. The media center for the 25th Arabian Gulf Cup is working to overcome all obstacles and facilitate procedures for media professionals to enable them to cover the tournament. The media outlets include television channels, radio stations, news agencies and newspapers in the media center. Everyone works to keep abreast of the tournament and its accompanying events through interviews, reports, and newsletters. The 25th Arabian Gulf Cup is being hosted by Iraq for the second time after the edition of 1979. The participation of teams of Iraq, Kuwait, Saudi Arabia, the Emirates, Oman, Bahrain, Qatar, and Yemen, were divided into two groups so that the first and second of each group qualified for the semi-finals. The opening matches of the football tournament are Iraq against Oman at 7:00 pm local time (16:00 GMT), followed by Saudi Arabia against Yemen in the same stadium. The Gulf Cup Federation approved the two stadiums, Basra International (capacity of 65,000 spectators) and Al-Minaa (30,000 spectators), for the “Gulf 25” group of matches, two stadiums located within the Sports City in Basra. – KUNA","pubDate":"2023-01-07 19:11:49","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Iraq eyes comeback with Gulf Cup","link":"https://www.kuwaittimes.com/iraq-eyes-comeback-with-gulf-cup/","keywords":["Football","Sports","Top Stories"],"creator":["kuwaittimes"],"video_url":null,"description":"BASRA: Iraq on Friday welcomed football teams from across the region for the 25th Arabian Gulf Cup (Khaleeji Zain 25), ending nearly three decades of repeated bans on international matches in the country. The tournament in the southern city of Basra brings together eight teams. HH the Amir Sheikh Nawaf Al-Ahmad Al-Jaber Al-Sabah sent Friday … The post Iraq eyes comeback with Gulf Cup appeared first on Kuwait Times.","content":"Iraq on Friday welcomed football teams from across the region for the 25th Arabian Gulf Cup (Khaleeji Zain 25), ending nearly three decades of repeated bans on international matches in the country. The tournament in the southern city of Basra brings together eight teams. HH the Amir Sheikh Nawaf Al-Ahmad Al-Jaber Al-Sabah sent Friday a cable of congratulations to Iraqi Prime Minister Mohammed Al-Sudani and Iraqi President Abdul Latif Rashid on the successful inauguration of the 25th Arabian Gulf Cup in Basra. HH the Crown Prince Sheikh Mishal Al-Ahmad Al-Jaber Al-Sabah and HH the Prime Minister Sheikh Ahmad Nawaf Al-Sabah also sent congratulatory cables to the Iraqi leaders. But the opening ceremony was marred after security personnel failed to control stampeding crowds, which forced Kuwait’s delegation to withdraw from the ceremony for safety reasons. Kuwait’s team will still participate in the tournament after receiving assurances from Iraqi officials to protect their safety, Kuwait Football Association confirmed. Iraq Football Association (IFA) expressed Saturday its regret to the Kuwaiti delegation for being unable to attend the inauguration ceremony of the Gulf Cup due to the stampede that occurred in front of the stadium in Basra. In a statement, the association expressed its great sorrow over some incidents during the inauguration ceremony. Head of IFA Adnan Darjal apologized to the Kuwaiti delegation for obstacles that prevented it from entering the stadium, forcing Sheikh Fahad Al-Nasser, representative of HH the Amir and head of the Kuwaiti Olympic Committee, and head of Kuwait Football Association and members to leave. Darjal voiced sorrow over the stampede, stressing that IFA and those responsible for organizing the event will take into consideration to put all things in good shape. What has happened will not affect the deep-rooted relations between Iraq and Kuwait, he affirmed, also noting that Kuwait Football Association greatly supported holding the championship in Basra. He urged fans to continue providing the necessary support to make the championship successful, which will help the country host sports events after a long period of suspension. Later on Saturday, Iraqi Interior Minister Abdul-Amir Al-Shammari said Prime Minister Sudani directed a comprehensive probe into and analysis of all incidents that accompanied the opening ceremony of the Gulf Cup. Shammari held several meetings with governor of Basra, commanders of Basra operations and other security leaders to review all matters and find solutions to them, according to Iraqi News Agency. Shammari noted that the ministry of interior conducted a complete reorganization of the security plan and review of traffic to and from the stadiums. Shammari referred to the reinforcement of the stadium’s security force from Baghdad, pledging incidents that happened at the tournament’s opening ceremony will never be repeated in the upcoming matches. More than 10,000 foreign fans had arrived by the afternoon in Basra, located a short distance from Iraq’s borders with Kuwait and Iran, an official from Basra’s provincial government told AFP. Flags of the participating countries fluttered in the breeze at Basra’s corniche, which runs along the Shatt al-Arab river, and the scent of shisha wafted from coffee shops. Omar Badr, a 22-year-old from Kuwait, was enthused by the local hospitality. He said some restaurants have offered fans free meals “and people invite us to their homes”. Teams from Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, the United Arab Emirates and Yemen have all arrived in town. It is the first time Iraq hosts the regional competition since 1979, the same year Saddam Hussein seized power in Baghdad. Decades of turmoil followed with the 1980-1988 war against Iran, Iraq’s 1990 invasion of Kuwait and the subsequent Gulf War, the US-led invasion of Iraq in 2003 and a bloody sectarian civil war lasting from 2006 to 2008. The invasion of Kuwait saw Iraq banned by FIFA, world football’s governing body, and subsequent sporadic bans were imposed until early 2022 due to instability in the country. Three decades after the Kuwait invasion, Iraqis are now enthusiastically welcoming their neighbors. Mohammed Al-Azemi, a 39-year-old football fan from Kuwait, said “social and family ties” unite the two countries. “The brotherly relationship between (us)… is back on track.” Louay Mansour, a nurse from Basra, said: “God be praised, the Gulf Cup is back. We hope it will be crowned with success.” Tournament organizers have undertaken major infrastructure projects to help Iraqis forget their years in the football wilderness. Basra is now home to two stadiums: the 65,000-capacity International Stadium, opened in 2013, and the 30,000-seat Minaa Olympic Stadium, inaugurated just two weeks before the tournament. The city has had a makeover, with renovations to the corniche, new hotels built and streets repaved. In total, Baghdad allocated $33 million to the Iraq Football Association to organize the Gulf Cup. – Agencies","pubDate":"2023-01-07 19:02:36","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Best College Football Betting Sites: Top sportsbooks ranked – January 2023","link":"https://nypost.com/2023/01/07/best-college-football-betting-sites-top-sportsbooks-ranked-january-2023/","keywords":null,"creator":["Action Network"],"video_url":null,"description":"Here’s our guide to the top college football betting sites with information about the best promo codes and offers.","content":"Here’s our guide to the top college football betting sites with information about the best promo codes and offers.","pubDate":"2023-01-07 19:00:00","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/01/GettyImages-1246048732.jpg?quality=90&strip=all","source_id":"nypost","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"\"Reminds me of Neymar\": Leeds now in talks to sign £15,000-a-week \"monster\"","link":"https://www.hitc.com/en-gb/2023/01/07/reminds-me-of-neymar-leeds-now-in-talks-to-sign-15000-a-week-monster/?utm_source=rss&utm_medium=rss&utm_campaign=reminds-me-of-neymar-leeds-now-in-talks-to-sign-15000-a-week-monster","keywords":["Competitions","Football","Leeds United","Premier League","Teams","georginio rutter"],"creator":["Billy Meyers"],"video_url":null,"description":"Leeds are now focused on signing Georginio Rutter after completing a deal to bring Maximilian Wöber to Elland Road. That is according to Florian Plettenburg... The post \"Reminds me of Neymar\": Leeds now in talks to sign £15,000-a-week \"monster\" appeared first on HITC.","content":"Leeds are now focused on signing Georginio Rutter after completing a deal to bring Maximilian Wöber to Elland Road. That is according to Florian Plettenburg of Sky Germany, who believes the Whites are in talks with TSG Hoffenheim over a deal for the £15,000-a-week striker. If Victor Orta can successfully lure Rutter to Yorkshire, Leeds fans should be very excited based on what has already been said about the France Under-21 international. What’s the story? Well, for those of you who do not know much about Rutter, a comparison may prove helpful – the Frenchman has been likened to one of the very best footballers around. The 20-year-old has been told he plays like Neymar by Frederic Lagadec – a coach at AS Menimur, where Rutter learned his trade. As quoted by Goal, Lagadec said: “He reminds me of Neymar, but not because of the bad things. It’s because he loves football and just wants to have fun on the pitch.” Photo by Christian Kaspar-Bartke/Getty Images Rutter has also been described as a “monster” of a footballer. It was Christopher Martin – the striker’s old teammate – who made that comment. Again quoted by Goal, he said: “Technically, he was extremely good, whether with left or right, and physically he was a monster.” Leeds must sign Rutter If Leeds fail to sign Rutter, it could end up being the difference between survival and relegation. Jesse Marsch is severely lacking a physical frontman who can give defenders something to think about throughout the entire 90 minutes, as well as a striker who can bring his teammates into the game with impressive hold up play. Nah, that's just ice cold from Georginio Rutter! #Bundesliga pic.twitter.com/zl6HiY5uwr— Bundesliga English (@Bundesliga_EN) December 2, 2021 Patrick Bamford sadly cannot be relied on right now as his body continues to let him down. Rodrigo is having an impressive season, although Marsch needs a striker with the aforementioned traits alongside him in attack. Keep an eye on this situation, as Leeds continue their discussions with TSG Hoffenheim. The post \"Reminds me of Neymar\": Leeds now in talks to sign £15,000-a-week \"monster\" appeared first on HITC.","pubDate":"2023-01-07 19:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Xavi talks Busquets, Griezmann, Lewandowski and Atletico","link":"https://www.barcablaugranes.com/2023/1/7/23543536/xavi-talks-busquets-future-antoine-griezmann-replacing-lewandowski-and-atletico","keywords":null,"creator":["Gill Clark"],"video_url":null,"description":null,"content":"Photo by Joan Valls/Urbanandsport /NurPhoto via Getty Images Check out the latest from the Barcelona boss Xavi was in front of the press again on Saturday to preview his team’s next match against Atletico Madrid in La Liga. The Barcelona boss heads into the match with both Robert Lewandowski and Jordi Alba suspended and after seeing his side taken to extra-time in midweek. Here are the best bits: Xavi on facing Ceuta in the Copa del Rey It will be very difficult. One of the most complicated ones. We have to compete. Try to be more effective. Try to be ourselves. Try to enforce our style of play. These last two games, the results haven’t been all that positive, but the performances have been. We want to play our best and go through. Xavi on killing games off I think it’s more of a mental thing. Our play has been good, we’ve been dominating, making chances. But that’s when you need to kill off the game. We need to be more effective in the 18-yard box. We are often superior over our rivals but we need to show that and score more goals. We need to try not to make any mistakes and be more imposing when chances come. Xavi on who will replace Lewandowski Jordi and Robert are out. We will play with 11 players and a No. 9. We’ll see who it will be. We have different options. Xavi on Atletico It’s the next game, it’s three points. If we can win at the Wanda it will be a big statement. It’s a tough stadium. Cholo as a coach is defensively very sound, if not perfect. It will be difficult. We’ll have to be more effective. It’s very important but not decisive for who will win the league. Xavi on January transfers I told you I’m happy with the players we have. We spoke with Laporta and Mateu, I’m happy with the players I have. If nothing changes that’s perfect for me. We will compete. Xavi on Ansu and Ferran Ferran is perhaps more mobile. Ansu is more positional, associative. They are very similar. They create chances, perhaps the people don’t see or value that but we do. Defensively Ferran is very intense. Ansu in that aspect is different. Both are capable of playing as a 9 as well as Memphis and tomorrow we will decide. Xavi on if Barca are missing a leader - does Araujo fit the bill? I think we have leaders. Sometimes you just need to show more personality. Some players express things verbally, others through football. Araujo, Busuqets, Ter Stegen are more verbal. But Pedri, Ansu show their leadership qualities through playing. I think we have leaders within our team. We know who they are. I don’t think that’s a problem. Xavi on conceding goals through individual errors Sometimes it’s an individual, sometimes it’s a team error. That’s my fault as well. We try to give them all the confidence in the world they need so they don’t make mistakes. But football is a game of errors, sooner or later we’ll make a mistake or our opponents will. We try to make sure our players are in great shape and don’t make errors, sometimes it’s happens. Intercity made things very difficult for us but I think my team reacted very well. Xavi on Antoine Griezmann I don’t know what it was like for him here. I know he’s important for Atletico. We’ve analyzed it, he’s on the ball a lot, creates chances, organises the attack, he’s very important. We are keeping an eye on him. He’s dangerous in the final third for sure. Xavi on agreement with Uruguay about Araujo He’s super important for us. He’s an excellent defender, gives us leadership, extra speed, he corrects many mistakes, as we play with a high line. He’s so good in that. Our conversations with Uruguay were very fluid, very clear. We said we would wait and see his sensations. In the end it was Ronald’s decision whether he would play or not. The most important thing is that now he’s 100%. Xavi on Busquets future I don’t know. I think it depends on sensations and our ability to sign players and the fair play situation. Sergio is a very important player, he’s the captain. It depends on him. It’s a personal decision. In June we will have another conversation. Xavi on Barca lacking aggression? Against Espanyol we lacked aggression in the final third. Espanyol only had one shot on target so in defense that was not the case. We’ve spoken about being defensively sound against Intercity but we conceded three goals. We need to be more aggressive. We can’t concede six goals. If you look at the last games we played then we are conceding too many goals. Xavi on playing extra-time in midweek It doesn’t change much. We had four days to rest, to disconnect. Xavi on Frenkie replacing Busquets We’ll see tomorrow. They can also play together. Both players are important for the team. They don’t lose the ball, they give the team more energy. They are smart, have a high IQ, we’ll see tomorrow. Xavi on more minutes for Pablo Torre For sure yeah. I’ve probably been not very fair to many players. I try to be fair and give them minutes but it’s difficult. It’s normal that some players feel they are not being fairly treated. Pablo’s been great. He plays well between the lines, set pieces are great, he’ll be important for us. He will go from less to more, Xavi on Hector Bellerin I don’t know. It depends in his final six months left on his contract. It’s similar to Busquets. He gives me a lot of confidence, he is a guarantee of sucess at the back. He talks a lot with his team-mates, understands the game, he’s a guarantee.","pubDate":"2023-01-07 19:00:00","image_url":null,"source_id":"barcablaugranes","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Kuwait make losing start, Qatar bounce back","link":"https://www.arabtimesonline.com/news/kuwait-make-losing-start-qatar-bounce-back/","keywords":["Sports","gulf cup"],"creator":["Arab Times"],"video_url":null,"description":"BAGHDAD, Jan 7: Record Gulf Cup champions Kuwait suffered a 2-0 opening loss against Qatar on Saturday. Qatar still reeling from a disappointing World Cup campaign, took an early lead in the 23rd minute through Surag. Alaaeldin increased their tally from the spot kick. Kuwait increased the tempo after the second goal but were denied … The post Kuwait make losing start, Qatar bounce back appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 792 times! BAGHDAD, Jan 7: Record Gulf Cup champions Kuwait suffered a 2-0 opening loss against Qatar on Saturday. Qatar still reeling from a disappointing World Cup campaign, took an early lead in the 23rd minute through Surag. Alaaeldin increased their tally from the spot kick. Kuwait increased the tempo after the second goal but were denied on numerous occasions by the goalkeeper. Bahrain begun their title defense with 2-1 win over UAE. Kamil Al-Aswad opened the scoring in 60 while Jassim Al-Sheikh doubled the defending champions advantage in 77th minute. UAE scored the consolation goal in injury time through Sebastián Lucas Tagliabúe. Saudi Arabia’s edged their neighbors Yemen 2-0. Saudi’s midfielder Smayhan Al- Nabit broke the deadlock in the 18th minute. Museb Al-Juwayr scored the Saudis second from the spot kick a penalty . The result puts Saudi on top of Group A, with Iraq and Oman tied in second, while Yemen have 0-points. Iraq drew with Oman 0-0 in the opening game of the 25th Arabian Gulf Cup in the southeastern city of Basra on Friday evening. The Group A game, aired live by Al-Iraqiya Sports TV channel, was less exciting and below the expectations of the Iraqi soccer fans. Meanwhile,Iraqi Interior Minister Abdul-Amir Al-Shammari said Saturday the Prime Minister Muhammad al-Sudani directed that a comprehensive probe into, and analysis of, all incidents that accompanied the opening ceremony of the Arabian Gulf Cup 25. Al-Shammari had held several meetings with governor of Basra, the commanders of Basra operations, and other security leaders to review all matters and find solutions to them, according to Iraqi News Agency. Al-Shammari noted that the Ministry of Interior conducted a complete reorganization of the security plan, review of traffic to and from the stadiums. Al-Shammari referred to the reinforcement of the stadium security force in different numbers from the capital, Baghdad, pledging that the things that happened at the tournament’s opening ceremony would never be repeated in the upcoming matches. In another development,Iraq Football Association (IFA) expressed Saturday its regret to the Kuwaiti delegation for being unable to attend the inauguration ceremony of the 25th Arabian Gulf Cup due to stampede that occurred in front of the stadium in Basra City. In a statement, the association expressed its great sorrow over some unorganized matters during the inauguration ceremony in Basra City. Head of IFA Adnan Darjal apologized to the Kuwaiti delegation for obstacles that prevented it from entering the stadium. Thus, Sheikh Fahad Al-Naser, representative of His Highness the Amir and head of the Kuwaiti Olympic Committee, and head of Kuwait Football Association and members left. Darjal voiced sorrow over the stampede that happened in front of the stadium, stressing that the IFA and those responsible for organizing the event will take into consideration making all things in good shape. What has happened will not affect the deep-rooted relations between Iraq and Kuwait, he affirmed, also noting that the Kuwait Football Association has supported greatly holding the championship in Basra City. He urged audience to continue providing necessary support to make a successful championship that will help the country host sports events after a long period of suspension. (KUNA) This post has been read 793 times! KUWAIT/IRAQ, Jan 4: Zain, a leading mobile telecom … You must be to post a comment.","pubDate":"2023-01-07 18:50:23","image_url":null,"source_id":"arabtimesonline","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"'Almost closed'... Manchester United reportedly on verge of shock 6ft 6\" striker deal","link":"https://www.unitedinfocus.com/transfer-news/manchester-united-transfer-news-wout-weghorst-close-to-deal/","keywords":["Transfer News","Premier League","Wout Weghorst"],"creator":["Dan Coombs"],"video_url":null,"description":"Manchester United are being linked with a surprise move for Dutch international striker Wout Weghorst. French outlet Footmercato claim Manchester United are negotiating with Burnley... The post 'Almost closed'... Manchester United reportedly on verge of shock 6ft 6\" striker deal appeared first on United In Focus.","content":"Manchester United are being linked with a surprise move for Dutch international striker Wout Weghorst. French outlet Footmercato claim Manchester United are negotiating with Burnley over a loan deal, and claim the deal is ‘almost closed’. Weghorst has been on loan at Turkish side Besiktas, and this deal is reportedly set to be terminated, so the United move can advance. The striker has scored eight goals in 16 Super Lig games for Besiktas this season, plus four assists. READ: Confirmed Manchester United transfers in, out, loan deals for January 2023 Photo by Rico Brouwer/Soccrates/Getty Images Wout Weghorst linked to Manchester United Weghorst signed for Burnley from Wolfsburg last January for £12 million, but could not help them avoid relegation – although did provide an assist against Manchester United. He had no intention of playing Championship football and was keen to be loaned out this season, and has rediscovered his scoring touch. Weghorst showed his quality at the World Cup by scoring a brace against Argentina to send the tie to extra-time. The 30-year-old has 170 club career goals to his name and is a physically imposing forward at 6ft 6″. He would provide a very different ‘plan B’ for United up front and would give Erik ten Hag added flexibility. United are short of a striker after Cristiano Ronaldo left the club, while Anthony Martial is renowned for being injury-prone. Ten Hag will be well aware for the former AZ Alkmaar and Heracles forward from his time in the Eredivisie, and if this move goes ahead, it could be a savvy loan deal for United. He would become United’s second signing this month, following a deal for goalkeeper Jack Butland. Wout Weghorst profile Full name: Wout Francois Maria WeghorstAge: 30Height: 1.97 m (6 ft 6 in)Nationality: DutchDate of birth: 7th August 1992Place of birth: Borne, NetherlandsPosition: StrikerClub: Burnley, on loan at Besiktas The post 'Almost closed'... Manchester United reportedly on verge of shock 6ft 6\" striker deal appeared first on United In Focus.","pubDate":"2023-01-07 18:46:00","image_url":null,"source_id":"unitedinfocus","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Kuwait Football Association dissatisfied with opening of ‘Gulf Cup’","link":"https://www.arabtimesonline.com/news/kuwait-football-association-dissatisfied-with-opening-of-gulf-cup/","keywords":["Sports","gulf cup"],"creator":["Arab Times"],"video_url":null,"description":"KUWAIT CITY, Jan 7: The Kuwait Football Association expressed its strong dissatisfaction with the poor organization of the opening ceremony of the 25th Gulf Cup in the city of Basra, and the resulting mass stampede and overcrowding that prevented the entry of the representative of His Highness the Amir Sheikh Nawaf Al-Ahmad Al- Jaber Al-Sabah … The post Kuwait Football Association dissatisfied with opening of ‘Gulf Cup’ appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 899 times! KUWAIT CITY, Jan 7: The Kuwait Football Association expressed its strong dissatisfaction with the poor organization of the opening ceremony of the 25th Gulf Cup in the city of Basra, and the resulting mass stampede and overcrowding that prevented the entry of the representative of His Highness the Amir Sheikh Nawaf Al-Ahmad Al- Jaber Al-Sabah – Chairman of the Kuwait Olympic Committee Sheikh Fahad Nasser Sabah Al- Ahmad – to the Palm Trunk Stadium to attend the opening ceremony, in order to preserve his safety and the safety of his accompanying delegation, reports Al-Qabas daily. The association stated that, “Due to what happened and in solidarity with the representative of His Highness the Amir of the country, the president of the Kuwait Football Association and his accompanying delegation withdrew from the opening ceremony. His Iraqi counterpart and those responsible for the organization were informed of the association’s protest against these organizational matters. In order to preserve the status and importance of the tournament, and in support of the brothers, the Kuwait national football team will participate in the tournament activities. With assurances from the Iraqi side about the availability of all security and safety means required for the continuation of participation, the president of the Kuwait Football Association and his accompanying delegation will follow up the affairs of the national team to ensure that the players are not affected by any of these events, and to be assured of their security and safety. We reassure the Kuwaiti fans about the safety of the players and all members of the Kuwaiti delegation, who are currently in the city of Basra.” This post has been read 900 times! KUWAIT/IRAQ, Jan 4: Zain, a leading mobile telecom … You must be to post a comment.","pubDate":"2023-01-07 18:41:23","image_url":null,"source_id":"arabtimesonline","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Football: Villarreal dent champions Real Madrid's title hopes","link":"https://www.straitstimes.com/sport/football/football-villarreal-dent-champions-real-madrids-title-hopes","keywords":null,"creator":null,"video_url":null,"description":"January 08, 2023 2:39 AMReal Madrid remain level on points with league leaders Barcelona, who next face Atletico Madrid.","content":"VILA-REAL, Spain - Real Madrid blew a chance to ramp up the pressure on La Liga leaders Barcelona in the title race as they fell 2-1 at Villarreal in a disjointed display on Saturday. Yeremy Pino and Gerard Moreno’s strikes either side of Karim Benzema’s penalty were enough to give the hosts a sixth consecutive victory across all competitions and dent the Spanish champions’ bid to retain the trophy. Madrid remain level on points with league leaders Barcelona, who face Atletico Madrid on Sunday, and this season the country’s two giants seem destined to tussle over the title themselves. Carlo Ancelotti’s side caught up with Barcelona last weekend after Xavi’s team drew with Espanyol in the Catalan derby, but Madrid have not started 2023 particularly well. Madrid’s slim Spanish Cup victory over fourth-tier opponents Cacereno was followed by this bruising wake-up call at the renovated and newly reopened Estadio de la Ceramica, their second league defeat. Ancelotti selected a Madrid starting line-up without a Spanish player in it for the first time in the club’s history, according to media reports in Spain. Los Blancos have struggled away at Villarreal in recent years, with two wins in 11 visits, the last coming in 2017 when Cristiano Ronaldo, Gareth Bale and Alvaro Morata were on the scoresheet. Quique Setien’s side, building confidence after a tough start for the former Barcelona coach, comprehensively outplayed Madrid in the first half, albeit without the goal they craved. Francis Coquelin hit the post with a wonderful flick from Alberto Moreno’s cross, while Dani Parejo fired wide. Gerard Moreno played in Yeremy Pino but Madrid goalkeeper Thibaut Courtois did brilliantly to thwart the Spanish winger as he attempted to dribble round him. Alex Baena drilled one effort wide and curled another narrowly over as Villarreal carved open Madrid’s sluggish defence at will. Madrid, still suffering after the World Cup break, began to pry themselves towards the end of the first half. Benzema chose poorly when racing through on goal with Vinicius in support, crashing into last man Raul Albiol instead of springing the Brazilian. When the French forward then did tee up Vinicius, he was denied by veteran goalkeeper Pepe Reina, starting after Geronimo Rulli’s move to Ajax. Villarreal began the second half with the same vigour and this time it did pay off, with the electric Pino slamming home from Moreno’s pass. Benzema immediately had a chance to equalise but dragged a shot inches wide of the far post after being slipped in by Vinicius. The 2022 Ballon d’Or winner eventually levelled from the spot after the most marginal of handball decisions was given against Argentine World Cup winner Juan Foyth after an hour. Villarreal were infuriated but just three minutes later were gifted a soft penalty themselves when David Alaba slipped and touched the ball with his hand. Moreno sent Thibaut Courtois the wrong way to restore the hosts’ lead and they clung to it tightly. Rodrygo Goes fired wide as Madrid hunted for an equaliser before Vinicius sprinted through on goal but fired over the bar when he might have scored. Madrid travel to Saudi Arabia next to take part in the Spanish Super Cup – but first they face an anxious wait to see if Barcelona drop points in the capital. AFP","pubDate":"2023-01-07 18:39:26","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Daily Schmankerl: Bayern Munich scoping center-back and right-back for depth?; Manchester United preparing Joao Felix move?; FC Barcelona, Real Madrid battle for Manchester City star; What’s next for Jude Bellingham; & MORE!","link":"https://www.bavarianfootballworks.com/2023/1/7/23541807/bayern-munich-manchester-united-joao-felix-fc-barcelona-real-madrid-manchester-city-bellingham-silva","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Photo by Sebastian Widmann/Getty Images Bayern Munich is in the mix for quite a few players. Bayern eyeing French defender (RMC Sport via Get French Football News) According to a report out of France, Bayern Munich is pursuing AS Monaco center-back Axel Disasi: RMC Sport are reporting Bayern Munich are interested in making a move for AS Monaco centre-back Axel Disasi (24) this summer. Disasi has been a consistent high-performer for Monaco this season. This form earnt him a place in Didier Deschamps’ World Cup squad. During the tournament in Qatar, the former Reims centre-back made his France debut. Monaco asked for €50m when Paris Saint-Germain made advancements last summer and given Disasi’s form and recently accrued international experience, the Ligue 1 side will be looking for upward of €50m for the player next summer. Aware that some of their defenders could leave, Bayern Munich are anticipating adding defensive reinforcements and it is within this context that the German club have identified Disasi as a target, and made their initial approach. With Benjamin Pavard’s future up in the air and Lucas Hernandez’s comeback timeline unclear, it would not be shocking to see Bayern Munich take a look at who might be available. What would be shocking is the club dropping €50 million on another center-back. Dumfries still on Bayern’s radar? (Football Italia) Assuming Bayern Munich’s relationship with Daley Blind will only last six months and that Benjamin Pavard’s future remains uncertain, the Bavarians are still being linked to Inter Milan’s Denzel Dumfries. A right-back, it could be assumed that Bayern Munich has Dumfries on its radar for any potential roster openings for next season: Bayern Munich is preparing to find a replacement for Benjamin Pavard and are reportedly considering making a move for Inter’s Denzel Dumfries. The Nerazzurri picked up the Dutch wing back from PSV in August 2021 for around €14.25m. Since his arrival, Dumfries has become a regular feature of Simone Inzaghi’s squad in the Lombardy capital and shot to prominence with his star performance in the Netherlands’ World Cup Round of 16 clash with the United States, where he scored once and provided two assists. As reported by TZ Munchen, Pavard’s contract is set to expire with Bayern Munich in the summer and the club aren’t planning to renew his deal, forcing them to find a replacement in the transfer market. The Bavarian giants are considering two players in particular: Lyon’s Malo Gusto, who was once wanted by Juventus, and Inter’s Dumfries. The Nerazzurri are open to the sale of the Dutchman in the summer, needing to generate some funds from the sale of a first team regular, and he could soon make the jump to the Bundesliga. Madrid, Barca competing for Silva (Fichajes via 90Min.com) Real Madrid and FC Barcelona are competing off the pitch as well — for Manchester City’s Bernardo Silva: Real Madrid are keen to sign Bernardo Silva in 2023 ahead of rivals Barcelona, with Manchester City prepared to agree to a sale for a price of €80m. Bavarian Podcast Works — Weekend Warm-up Podcast: Season 2, Episode 25 (Bavarian Football Works) Another week and Bayern Munich provided its fanbase with another shocker or two. As always, there is plenty to talk about when it comes to Bayern Munich — and we start this episode by rapping about the surprise pickup of Daley Blind and what appears to be a nearly done deal for Yann Sommer. Here is the full rundown for what we have on tap: What Daley Blind will bring to Bayern Munich — and what it means for other players on the roster. The latest on where things stand with Bayern Munich’s pursuit of Yann Sommer. The Harry Kane pipedream appears to be dead, so is Randal Kolo Muani a viable option to be Bayern Munich’s striker of the future? Was Leon Goretzka using the World Cup platform to grandstand? Julian Nagelsmann had some interesting thoughts on coaching. United attempting Felix swoop (Football Transfers) Quick question: Is there anyone that Manchester United is not interested in? The Red Devils are working on bringing in Felix on a loan: Following their Champions League group stage exit, it was reported that Atletico needed to offload several stars in order to balance the books. Matheus Cunha’s departure to Wolves is a start, but Felix could still leave the club. The likelihood of that happening is increased by Atleti’s reported interest in Liverpool’s Roberto Firmino, whose contract at Anfield expires this summer. According to Revelo, Man Utd are willing to pay Felix’s full wages for the duration of the loan deal, but the offer will not include an option to buy permanently in the summer transfer window. It’s believed that Felix wants to leave Atleti, and Man Utd are currently the frontrunners in the race to sign him. However, Atletico have indicated that they want a loan fee of €13m for Felix, far more than the offer Man Utd are currently preparing. Premier League table-toppers Arenal have also registered an interest in the Portugal international, but Mikel Arteta’s side are currently pursuing a deal for Shakhtar Donestk forward Mykhailo Mudryk, which could complicate things. Chelsea are another team in the running for Felix, but like Arsenal they are also in the hunt for Mudryk, leaving Man Utd as the favourites to land the Benfica academy graduate. Plattenhardt to leave Hertha? (kicker) Longtime Hertha Berlin defender Marvin Plattenhardt could be leaving the club this summer: Hertha captain Marvin Plattenhardt is absent from the Hertha training camp in the USA because he does not have the necessary corona vaccination status. In the first half of the season, when Plattenhardt was slowed down several times by adductor problems, two other professionals, defender Marc Oliver Kempf and midfield driver Lucas Tousart, increasingly took on leading roles. It is quite possible that his time in the capital will come to an end this summer (contract is expiring, talks have not yet taken place). Madrid’s offer to Bellingham (Football Transfers) If you were wondering what personal terms might look like as Real Madrid prepares an offer to Borussia Dortmund star Jude Bellingham, here you go: Real Madrid will start negotiating with Borussia Dortmund for Jude Bellingham’s transfer this week, and the amount they plan to offer the England international has been revealed. Bellingham has quickly become one of the most eligible young players in world football since his move to Dortmund from Birmingham in 2020, and has already led BVB out in the Champions League at the tender age of 19. Now one of the first names on Gareth Southgate’s England teamsheet, Liverpool and Manchester City remain keen to bring him to the Premier League, but Real are determined to close the deal for him in the January transfer window. According to Cadena SER, Real will offer Bellingham a five-year deal with a salary of €12 million per year, which will put him on a par with Aurelien Tchouameni and see him earn more than Rodrygo and Eduardo Camavinga, among others.","pubDate":"2023-01-07 18:30:21","image_url":null,"source_id":"bavarianfootballworks","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Lisandro Martinez says he respects Manchester United defender so much it's like they've played together for years","link":"https://www.unitedinfocus.com/news/lisandro-martinez-discusses-beating-united-teammate-raphael-varane-in-the-world-cup-final/","keywords":["News","Lisandro Martinez","Raphael Varane"],"creator":["Sam Preston"],"video_url":null,"description":"Lisandro Martinez has discussed beating Manchester United teammate Raphael Varane in the 2022 World Cup final. Martinez’s Argentina beat Varane’s France on penalties after a... The post Lisandro Martinez says he respects Manchester United defender so much it's like they've played together for years appeared first on United In Focus.","content":"Lisandro Martinez has discussed beating Manchester United teammate Raphael Varane in the 2022 World Cup final. Martinez’s Argentina beat Varane’s France on penalties after a stunning 3-3 draw after 120 minutes in Qatar. There was a great image after the game of both players shaking hands despite their respective contrasting emotions. And Martinez told Sky Sports he has so much respect for his defensive colleague and it feels like their relationship spans back longer than half a season. Photo by Tom Purslow/Manchester United via Getty Images Martinez on Varane “It was really, really important,” he said of that moment. “We’ve only known each other a short time at United but we get on really, really well and there’s a real mutual respect and feeling between us. It’s like we’ve known each other for years. “He was my opponent, but that’s football. One team has to win, and won team has to lose, but I think it’s important to recognise that. “There’s a mutual love and respect between us. We shared that hug and it was important because football is like that. What happens on the pitch, stays on the pitch, but what happens off it is just as important and relationships like that count.” Buenos diassss!! A disfrutarla con todos los nuestros. 🇦🇷⭐️ pic.twitter.com/tyEcAxEWVX— Lisandro Martinez (@LisandrMartinez) December 19, 2022 View Tweet It seems like Lisandro and Varane are United’s first choice central defensive partnership when they are both fit, but Martinez is yet to start since the World Cup. Luke Shaw has deputised as the left-sided central defender, something he has not done in a back four before, and performed well. But it seems unlikely Ten Hag will continue with that experiment against Manchester City or Arsenal, who are United’s next two Premier League opponents. Varane and Martinez will be key in those games and if United can get two clean sheets there, it would be a really great platform to potentially get two huge results. The post Lisandro Martinez says he respects Manchester United defender so much it's like they've played together for years appeared first on United In Focus.","pubDate":"2023-01-07 18:30:00","image_url":null,"source_id":"unitedinfocus","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Opinion: Arsenal should not blame United for Mudryk fee with Antony coup, made same error in 2019","link":"https://www.hitc.com/en-gb/2023/01/07/arsenal-mykhaylo-mudryk-antony-nicolas-pepe-manchester-united/?utm_source=rss&utm_medium=rss&utm_campaign=arsenal-mykhaylo-mudryk-antony-nicolas-pepe-manchester-united","keywords":["Arsenal","Competitions","Football","Manchester United","Premier League","Teams","antony","arsenal","manchester united","mykhaylo mudryk","nicolas pepe"],"creator":["Srinivas Sadhanand"],"video_url":null,"description":"In our view, Arsenal should not be so quick to point the finger at Manchester United for forking out £86 million (Sky Sports) to sign... The post Opinion: Arsenal should not blame United for Mudryk fee with Antony coup, made same error in 2019 appeared first on HITC.","content":"In our view, Arsenal should not be so quick to point the finger at Manchester United for forking out £86 million (Sky Sports) to sign Antony, which has raised the price for target Mykhaylo Mudryk, as they spent a ridiculous £72 million (Sky Sports) to sign Nicolas Pepe back in 2019. The Mykhaylo Mudryk & Antony connection Shakhtar Donestk director, Carlo Nicolini told CalcioNapoli24 that since the club rate Mudryk higher than Manchester United winger, Antony, Arsenal will have to pay a higher fee to sign the 21-year-old. After all, the Daily Mail had recently claimed that a second bid worth £62 million was rejected by Shakhtar from the Gunners for the wonderkid Why Arsenal should blame themselves and not Manchester United, made the same error with Nicolas Pepe in 2019 Photo by Stuart MacFarlane/Arsenal FC via Getty Images However, it’s key to note that Arsenal broke their club-record to sign Nicolas Pele in 2019, which negates Manchester United of any blame for breaking the bank for Antony. While Pepe did look like a serious talent for Lille in Ligue 1, he was still a rather unproven commodity in European football. Yet, a frugal Arsenal at the time inflated the market for wingers themselves by signing the Ivorian, which is why a certain Mudryk is priced £16 million higher than their current loanee, while not even operating in a top 5 league in Europe. As for Antony, at least he has made a name for himself in the Champions League for Ajax, whether one agrees with the fee shelled out by Manchester United or not. Before any comparison begins between Mudryk and Antony, the point at hand is that Arsenal made the same mistake Man United may well have made, but 3 years ago. As a result, the blame lies at their door and not at that of Manchester United for Shakhtar Donetsk demanding a staggering fee for Mykhaylo Mudryk. The post Opinion: Arsenal should not blame United for Mudryk fee with Antony coup, made same error in 2019 appeared first on HITC.","pubDate":"2023-01-07 18:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pakistan football team gears up for Saudi Arabia’s first international women’s tournament","link":"https://www.arabnews.com/node/2228221/sport","keywords":null,"creator":["malawi"],"video_url":null,"description":"Sat, 2023-01-07 20:47 LAHORE: Pakistan’s national women’s football team are gearing up for Saudi Arabia’s first international women’s football tournament next week, a competition they hope will gain them more international exposure. The four-nation friendly tournament featuring Saudi Arabia, Pakistan, Comoros and Mauritius will kick off at Prince Saud bin Jalawi Stadium in Alkhobar on Jan. 11.Main category: Sport","content":null,"pubDate":"2023-01-07 17:52:59","image_url":null,"source_id":"arabnews","country":["saudi arabia"],"category":["sports"],"language":"english"},{"title":"Report: Premier League club know Liverpool want to sign their £85,000-a-week star, exit possible","link":"https://www.hitc.com/en-gb/2023/01/07/report-premier-league-club-know-liverpool-want-to-sign-their-85000-a-week-star-exit-possible/?utm_source=rss&utm_medium=rss&utm_campaign=report-premier-league-club-know-liverpool-want-to-sign-their-85000-a-week-star-exit-possible","keywords":["Competitions","Football","Liverpool","Premier League","Teams","matheus nunes"],"creator":["Billy Meyers"],"video_url":null,"description":"Liverpool are hoping to sign Matheus Nunes from Wolves at some point in 2023 – and the Premier League side are all too aware of... The post Report: Premier League club know Liverpool want to sign their £85,000-a-week star, exit possible appeared first on HITC.","content":"Liverpool are hoping to sign Matheus Nunes from Wolves at some point in 2023 – and the Premier League side are all too aware of that fact. What’s the story? Well – according to The Athletic – Wolves knew Liverpool wanted the Portugal international when they initially struck a £38m agreement with Sporting Lisbon back in August, and are aware that Jürgen Klopp still wants him. The Athletic add that Wolves hold most of the cards in this particular transfer saga, although the Old Gold have an underlying acknowledgement that Nunes signed on the basis that he would be allowed to leave for a bigger club. This update comes after Pep Lijnders allegedly told Liverpool to sign the £85,000-a-week midfield maestro as the Dutchman obtains added control over recruitment at Anfield, as detailed by the Telegraph. Liverpool had the opportunity to sign Nunes from Sporting Lisbon when Wolves did, although the Reds felt he was not quite ready for Premier League football just yet, and decided to let him move to Molineux first. Photo by Jack Thomas – WWFC/Wolves via Getty Images The Athletic add that Wolves feel their No.27 has done enough in English football so far to increase his £38m price tag substantially, so Liverpool allowing him to join the Old Gold may backfire on them. So far this season, Nunes has made 15 Premier League appearances for Wolves, providing one assist as they sit 19th in the Premier League. Liverpool should have signed Matheus Nunes It is easy to say this in hindsight, but Liverpool were wrong to let Wolves beat them to Nunes. In fact, it was more than wrong – it reeks of arrogance from the Reds, and a naive confidence in their midfield department which is nowhere near up to the required standard right now. Liverpool should have taken Nunes pic.twitter.com/B4IS3LStW5— CF Comps (@CF_Compss) August 24, 2022 Klopp and Julian Ward – Director of Football at Anfield – could have signed Nunes on a permanent basis before loaning him to Wolves or another Premier League side if they felt he wasn’t quite ready for English football. Now, Liverpool face paying far more than £38m for the Portugal international, at a time where their midfield department is in serious need of strengthening. The post Report: Premier League club know Liverpool want to sign their £85,000-a-week star, exit possible appeared first on HITC.","pubDate":"2023-01-07 17:30:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Équipe de France : les coulisses de la prolongation de Didier Deschamps, selon Jacques Vendroux","link":"https://www.europe1.fr/sport/equipe-de-france-les-coulisses-de-la-prolongation-de-didier-deschamps-selon-jacques-vendroux-4159515","keywords":null,"creator":null,"video_url":null,"description":"Didier Deschamps a été prolongé à la tête de l'équipe de France de football ce samedi par le président de la Fédération française, Noël Le Graët. Une négociation entre les deux hommes que l'éditorialiste d'Europe 1 Jacques Vendroux a suivie de près. Dans \"Europe Soir Week-end\", il en révèle quelques détails.","content":null,"pubDate":"2023-01-07 17:27:04","image_url":null,"source_id":"europe1","country":["france"],"category":["sports"],"language":"french"},{"title":"Angleterre : Ait Nouri élu meilleur joueur du mois de décembre","link":"https://www.dzfoot.com/divers/angleterre-ait-nouri-elu-meilleur-joueur-du-mois-de-decembre-236516.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Verts du Monde","Meilleur joueur","Ait Nouri","Premier League","Wolverhampton","mois de décembre"],"creator":null,"video_url":null,"description":"Rayane Ait nouri, le latéral gauche de Wolverhampton, est le le meilleur joueur du club du mois de décembre. Le futur membre de l'équipe nationale d'Algérie a remporté ce titre grâce aux votes (56%) des supporters qui l'ont élu comme le meilleur joueur des Wolves. Cette récompense intervient en dépit du fait que le joueur […] The post Angleterre : Ait Nouri élu meilleur joueur du mois de décembre appeared first on Football Algérien - DZFOOT.COM.","content":"Rayane Ait nouri, le latéral gauche de Wolverhampton, est le le meilleur joueur du club du mois de décembre. Le futur membre de l'équipe nationale d'Algérie a remporté ce titre grâce aux votes (56%) des supporters qui l'ont élu comme le meilleur joueur des Wolves. Cette récompense intervient en dépit du fait que le joueur de 21 ans a joué à chaque fois en tant que remplaçant durant les matchs du mois de décembre (Everton, Manchester United et Aston Villa en championnat et contre le FC Villingham en EFL Cup), se montrant pour autant systématiquement décisif, notamment en inscrivant des buts face à Everton en championnat et contre le FC Villingham en EFL Cup. ✌️ Two goals 🥊 Boxing day winner 🥇 56% of the vote — Wolves (@Wolves) January 6, 2023 DZfoot","pubDate":"2023-01-07 17:23:48","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"Belgique : Ahmed Nadhir Benbouali s’est blessé au genou","link":"https://www.dzfoot.com/verts-deurope/belgique-ahmed-nadhir-benbouali-sest-blesse-au-genou-236524.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Blessure","Verts du Monde","Benbouali"],"creator":null,"video_url":null,"description":"Sur le banc des remplaçant en début de rencontre face à Aspen, le jeune attaquant de Charleroi Ahmed Nadhir Benbouali est finalement entré mais a été contrait de quitter ses coéquipiers après 25 minutes seulement. L'ancien buteur du Paradou, sur une action banale au milieu terrain, a reçu un mauvais coup au genou. Benbouali voulait […] The post Belgique : Ahmed Nadhir Benbouali s’est blessé au genou appeared first on Football Algérien - DZFOOT.COM.","content":"Sur le banc des remplaçant en début de rencontre face à Aspen, le jeune attaquant de Charleroi Ahmed Nadhir Benbouali est finalement entré mais a été contrait de quitter ses coéquipiers après 25 minutes seulement. L'ancien buteur du Paradou, sur une action banale au milieu terrain, a reçu un mauvais coup au genou. Benbouali voulait faire un contrôle orienté du ballon mais le défenseur adverse est intervenu brutalement sur lui. Le joueur est tombé en demandant immédiatement les soins du staff médical. Après une aide d’urgence, Benbouali est retourné sur le terrain avant de finalement demander le changement. L'attaquant de 22 ans devrait effectuer des tests approfondis dans les heures à venir pour connaître la nature et la durée de sa blessure. La blessure de Benbouali face à Eupen : À souligner que Charleroi a réussi à revenir avec les trois points de l'extérieur après avoir marqué deux buts en deuxième période. Le match s’est terminé par 2-1 et a connu la présence de Zorgane durant l'intégralité de la rencontre. DZfoot","pubDate":"2023-01-07 17:21:09","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"GAA wrap: Junior and Intermediate club finalists set; Dublin beat Antrim in Walsh Cup","link":"https://kildare-nationalist.ie/2023/01/07/gaa-wrap-junior-and-intermediate-club-finalists-set-dublin-beat-antrim-in-walsh-cup/","keywords":["National Sport"],"creator":["Kildare Nationalist Reporter"],"video_url":null,"description":"There was GAA action at both club and county level on Saturday as the Walsh and O’Byrne Cups continued, and the Intermediate and Junior All-Ireland Club Football semi-finals were staged. The intermediate decider will pit Galbally Pearses (Tyrone) against Kerry’s Rathmore after their respective wins. The Tyrone men took a four-point win over Galway’s Dunmore...","content":"There was GAA action at both club and county level on Saturday as the Walsh and O’Byrne Cups continued, and the Intermediate and Junior All-Ireland Club Football semi-finals were staged. The intermediate decider will pit Galbally Pearses (Tyrone) against Kerry’s Rathmore after their respective wins. The Tyrone men took a four-point win over Galway’s Dunmore MacHales in Mullingar, where it ended 4... Source","pubDate":"2023-01-07 17:06:23","image_url":null,"source_id":"kildare-nationalist","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Mwamba hungry for ‘lion meat’ after dramatic Kenya Cup win over Leos","link":"https://www.capitalfm.co.ke/sports/2023/01/07/mwamba-hungry-for-lion-meat-after-dramatic-kenya-cup-win-over-leos/","keywords":["Kenya Cup","Rugby","Sports","featured"],"creator":["Omondi Onyatta"],"video_url":null,"description":"NAIROBI, Kenya, Jan 7 – Mwamba coach Kepher Ndonji says they will not be bending over backwards for Kenya Cup leaders Kenya Commercial Bank (KCB) when the two teams clash in their next top-tier fixture. The lions remain unbeaten in all matches, following their 24-3 blanking of Kenyatta University’s Blak Blad on Matchday 5, but […] The post <strong>Mwamba hungry for ‘lion meat’ after dramatic Kenya Cup win over Leos</strong> appeared first on Capital Sports.","content":"The lions remain unbeaten in all matches, following their 24-3 blanking of Kenyatta University’s Blak Blad on Matchday 5, but Ndonji warns that Kulabu will not be a walk in the park for the bankers. “The mentality is to win. We are taking every game at a time…for us every game is a final. We are going for nothing short of a win and right now our focus is on KCB and we want to win every game at a time,” Ndonji said. The coach was beside himself after a nail-biting duel on Saturday against Strathmore Leos at the latter’s Strathmore University Sports Complex, which the visitors edged 27-20 thanks to a last-gasp try from Chrispine Onyango. The match itself was a see-saw affair, laced with vociferous home and away support, as both sides sought to kick off 2023 on a high note. What a fantastic way to start the year! A team effort all round and a buzzer -beater try by to win it 27-20 against ! Well done boys…. — Mwamba Rugby Football Club (@MwambaRFC) The students drew first blood through a Joseph Ayiro try but it was not long before their opponents levelled the scores via Eliakim Kichoi. Leos went into the halftime break with a 17-7 lead after a penalty kick and another centre-post try. On resumption, Kulabu reduced the deficit to 17-14 after a try by Mike Okello with the resultant penalty kick converted by Brian Kivasia. Another penalty kick brought them level with the students once again before Leos retook the lead in a similar fashion. However, Mwamba were in no mood to give up and soon levelled the scores in what was expected to be the last piece of action. There was more joy for their fans as Onyango pounced on a loose ball to dive over the whitewash to ensure his side takes all the points. The win was the most perfect response Ndonji could ask from his charges after their disappointing 24-23 upset by Catholic University Monks, just before the festive season break. He explained the significance of the win in light of Mwamba’s unenviable fixture list this month. “It feels great to begin the year with a win. Looking at January, we have four tough fixtures beginning with Strathmore, KCB, Kabras and then Oilers. Now we are planning to shape and change as we go to the next games,” Ndonji said. He added: “There has been a very big change and motivation considering we have been having a few challenges with regards to training grounds. But, I believe that even with those challenges, we will be able to win the upcoming tough games.” Ndonji further said the festive season break was a blessing to Kulabu as it allowed the team to refresh and improve on their system and physical fitness considering they began training belatedly ahead of the top tier action. In other matches of the weekend, Quins collected their second win in two matches after thrashing Catholic Monks 45-15 at the Catholic University of East Africa (CUEA) as University of Nairobi’s Mean Machine beat their counterparts, Masinde Muliro University 24-23. Menengai Oilers beat Nakuru 25-18 whereas the match between defending champions Kabras Sugar and Homboyz was postponed.","pubDate":"2023-01-07 17:06:20","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Report: 49-year-old Everton want to replace Lampard has now agreed to take over elsewhere","link":"https://www.hitc.com/en-gb/2023/01/07/report-49-year-old-everton-want-to-replace-lampard-has-now-agreed-to-take-over-elsewhere/?utm_source=rss&utm_medium=rss&utm_campaign=report-49-year-old-everton-want-to-replace-lampard-has-now-agreed-to-take-over-elsewhere","keywords":["Competitions","Everton","Football","Premier League","Teams","frank lampard","roberto martinez"],"creator":["Billy Meyers"],"video_url":null,"description":"Everton were said to be interested in bringing Roberto Martinez back to Goodison Park as Frank Lampard struggles. It was Belgian news outlet Het Belang... The post Report: 49-year-old Everton want to replace Lampard has now agreed to take over elsewhere appeared first on HITC.","content":"Everton were said to be interested in bringing Roberto Martinez back to Goodison Park as Frank Lampard struggles. It was Belgian news outlet Het Belang van Limburg who revealed that the Toffees were considering an approach for the 49-year-old as they sit 18th in the Premier League. Speculation regarding that topic intensified when Martinez resigned from his role in charge of Belgium following their shock Group Stage exit at the World Cup. Now, however, Farhad Moshiri and Bill Kenwright will have to look elsewhere. What’s the story? Well, along with Martinez, Fernando Santos also resigned from his role in charge of an international side at Portugal. Now, the Spaniard is replacing the 68-year-old. The Athletic believe Martinez has verbally agreed to take over the Portugal national team from Santos, putting an end to rumours that he may return to Everton. During his time at Goodison Park, the Balaguer-born tactician won 62 of his 143 games in charge, drawing 37 while losing 44 as he guided the Toffees into the Europa League. Photo by Tony McArdle/Everton FC via Getty Images Everton have gradually got worse since his exit, and we believe a return for Martinez certainly would have been an improvement on Lampard, albeit not a significant one. Nevertheless, Moshiri and Kenwright will now have to cross his name off their list. Who Everton could turn to instead of Martinez If Lampard continues to steer Everton towards the Championship, Moshiri and Kenwright will have to act. The Toffees could target Sean Dyche – who is still unemployed after Burnley sacked him back in April – while the likes of Chris Wilder and Dean Smith are also available. Can Frank Lampard turn things around at Everton? He spoke to us following his side's defeat at Man Utd last night pic.twitter.com/BWat6HXhNG— ITV Football (@itvfootball) January 7, 2023 If we’re being ambitious, top coaches such as Thomas Tuchel, Mauricio Pochettino and Zinedine Zidane are also there to be hired, although it would take a miracle for Everton to pull off another Carlo Ancelotti style coup right now. Whatever happens, Everton must do something if Lampard fails to show any signs of improvement. The post Report: 49-year-old Everton want to replace Lampard has now agreed to take over elsewhere appeared first on HITC.","pubDate":"2023-01-07 17:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"}]}