{"newsArray":[{"article_id":"c1d209d7b96077a5444d96f2bbb5bbc6","title":"2 Swedes shot dead in Brussels, Belgium raises terror alert to top level","link":"https://www.rappler.com/world/europe/brussels-belgium-shooting-updates-october-17-2023/","keywords":null,"creator":["Reuters"],"video_url":null,"description":"A Belgian federal prosecutor says there is no evidence the attacker, who was still on the loose, had any link to the recent renewed conflict between Israel and Palestinian militants","content":"BRUSSELS, Belgium – Two Swedish nationals were shot to death and a third person was wounded in central Brussels on Monday night, October 16, and a man who identified himself as a member of the Islamic State claimed responsibility in a video posted online. The suspected assailant fled the scene after the shooting as a football match between Belgium and Sweden was about to start, triggering a massive manhunt and prompting Belgium to raise its terror alert to the highest level. A Belgian federal prosecutor said there was no evidence that the attacker, who was still on the loose, had any link to the recent renewed conflict between Israel and Palestinian militants. The likely motive for the attack was the Swedish nationality of the victims, the prosecutor said. Sweden in August raised its terror alert to the second-highest level, warning of an increase in threats against Swedish interests abroad, after Koran burnings and other acts in Sweden against Islam’s holiest text outraged Muslims and triggered threats from jihadists. The suspected assailant, calling himself Abdesalem Al Guilani, claimed in a video on social media that he was a fighter for Allah. The federal prosecutor said the third victim, who was wounded but whose condition was not life-threatening, was a taxi driver. The prosecutor called on Brussels’ residents to stay indoors until the threat was over. European Commission staff were also advised to stay indoors. Belgian Prime Minister Alexander de Croo confirmed on social media platform X, formerly known as Twitter, the victims were Swedish. “I have just offered my sincere condolences to the Swedish PM following tonight’s harrowing attack on Swedish citizens in Brussels,” de Croo said on X. “Our thoughts are with the families and friends who lost their loved ones. As close partners, the fight against terrorism is a joint one,” he said. Sweden’s Justice minister, Gunnar Strommer, told Reuters the government was working intensively with Belgian authorities to get more information about what happened. All Swedes in Belgium will receive a text message sent to their phones urging them to be vigilant and to follow instructions from Belgian authorities, Swedish Prime Minister Ulf Kristersson said. Belgium’s interior minister said the investigation was in the hands of a federal prosecutor because of “a possible terrorist motive.” One Belgian newspaper said it was likely that the victims were two soccer supporters. Belgium were hosting Sweden in a Euro 2024 qualifying match on Monday evening. The match was suspended at halftime because of security reasons. The shooting comes at a time of heightened security concerns in some European countries linked to the Israel-Hamas conflict. France is deploying 7,000 extra troops onto its streets after a teacher was fatally stabbed on Friday in an attack President Emmanuel Macron condemned as “barbaric Islamic terrorism.” Video footage of the Brussels attack posted on the Het Laatste Nieuws newspaper website showed a man in an orange jacket on a scooter at a street intersection with a rifle first firing two shots, then three more, then running into a building, firing two more shots, leaving, taking a few steps back again and shooting one more time. One Belgium newspaper said a witness said the shooter shouted “Allahu Akbar” before the shots were fired. According to a media transcript of the video message recorded by the self-declared perpetrator, he said: “Islamic greeting Allahu Akbar. My name is Abdesalem Al Guilani and I am a fighter for Allah. I am from the Islamic State. We love who loves us and we hate who hates us. We live for our religion and we die for our religion. Alhamdulah. Your brother took revenge in the name of Muslims. I have killed 3 Swedes so far Al hamdoulelah. 3 Swedish, yes. Those to whom I have done something wrong, may they forgive me. And I forgive everyone. Salam Aleykoum.” France is tightening controls at the border with Belgium after the deadly attack in Brussels, Belgian media said. Belgium’s crisis center warned the public not to make any unnecessary trips in the capital. – Rappler.com","pubDate":"2023-10-17 00:48:59","image_url":null,"source_id":"rappler","source_priority":14296,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"a43c30bad5fa25a1f31bf290a4420805","title":"Куман — о победе над Грецией: «Нужно было быть очень осторожным, чтобы не уступить»","link":"https://www.sport-express.ru/football/euro/news/kuman-prokommentiroval-pobedu-sbornoy-niderlandov-nad-greciey-2134364/","keywords":["Футбол - Чемпионат Европы"],"creator":null,"video_url":null,"description":"Главный тренер сборной Нидерландов Роналд Куман подвел итоги матча отборочного турнира Евро-2024 против Греции (1:0).","content":"Главный тренер сборной Нидерландов Роналд Куман подвел итоги матча отборочного турнира Евро-2024 против Греции (1:0). «Мы должны были решить исход матча задолго до пенальти в добавленное время. Греция выпустила троих нападающих, и внезапно игроки оказались на своих позициях. У нас был комфортный первый тайм, но мы должны были забить пенальти. После этого матч стал другим. Мы продолжали верить в себя. Греция не создавала моментов, но нам нужно было быть очень осторожными, чтобы не уступить», — приводит слова Кумана официальный сайт УЕФА. Единственный мяч забил Вирджил ван Дейк. Он реализовал пенальти на 93-й минуте. Сборная Нидерландов занимает второе место в группе B, набрав 12 очков в 6 матчах. Греция — на третьем месте (12 очков в 7 играх).","pubDate":"2023-10-16 23:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"51a06489b8163a390fc860a6f1c366a6","title":"Моуринью покинет «Рому» в конце сезона","link":"https://www.sport-express.ru/football/italy/news/mourinyu-pokinet-romu-v-konce-sezona-2134355/","keywords":["Футбол - Италия"],"creator":null,"video_url":null,"description":"Главный тренер «Ромы» Жозе Моуринью покинет клуб в конце сезона, сообщает Sky Sports Italia.","content":"Главный тренер «Ромы» Жозе Моуринью покинет клуб в конце сезона, сообщает Sky Sports Italia. По сведениям источника, 60-летний португалец и клуб не будут продлевать соглашение, никаких переговоров не ведется. После 8 матчей «Рома» занимает 10-е место в турнирной таблице Италии, набрав 11 очков.","pubDate":"2023-10-16 22:31:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"ba1bc38dc27defe0f6f909e48c7a7dc6","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.northwaleschronicle.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d47e9cb5e84a0f9be6ae4c613ce877d6","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.southwalesguardian.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.southwalesguardian.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c17cc96554a52a467c6f19f851ce7b16","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.northwalespioneer.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.northwalespioneer.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4c6eb1789edccc2deff0ddf98585115b","title":"Le stade Roi-Baudoin de Bruxelles évacué après l'interruption de Belgique-Suède","link":"https://www.lequipe.fr/Football/Actualites/Le-stade-roi-baudoin-de-bruxelles-evacue-apres-l-interruption-de-belgique-suede/1425776#xtor=RSS-1","keywords":["Foot, Qualif. Euro"],"creator":["Arthur Verdelet"],"video_url":null,"description":"L'évacuation du stade Roi-Baudoin de Bruxelles a démarré à 23h45 ce lundi soir, plus de deux heures après l'arrêt de la rencontre Belgique-Suède. Une décision prise suite à « l'attentat terroriste » survenu plus tôt en centre-ville.","content":"L'évacuation a démarré à 23h45. Après près de deux heures d'attente, les premiers des 35 000 supporters présents dans les tribunes du stade Roi-Baudoin pour assister à la rencontre Belgique-Suède (arrêtée à la mi-temps) ont été autorisés à quitter l'enceinte par les forces de sécurité, toujours à la recherche de l'auteur d'un , comme annoncé par le Premier ministre belge en centre-ville. L'évacuation semble se dérouler dans le calme selon les premières images diffusées par les médias présents sur place. Les supporters suédois sont eux pour la plupart encore présents dans les travées, tout comme une partie des fans belges.","pubDate":"2023-10-16 22:28:26","image_url":"https://medias.lequipe.fr/img-photo-jpg/les-spectateurs-de-la-rencontre-belgique-suede-ont-pu-commencer-a-quitter-les-tribunes-du-stade-roi-baudoin-de-bruxelles-dans-le-calme-apres-une-longue-attente-y-herman-reuters/1500000001848291/0:0,1918:959-665-335-70/01b67.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"3630963e1a54480fc08de2382cc7c59a","title":"Belgium V Sweden Euro Qualifier Abandoned After Brussels Shooting","link":"https://www.ibtimes.com/belgium-v-sweden-euro-qualifier-abandoned-after-brussels-shooting-3715451","keywords":null,"creator":null,"video_url":null,"description":"Belgium's Euro 2024 qualifier against Sweden was abandoned at half-time and fans were kept in the stadium for security reasons after two Swedes were shot dead in an attack in Brussels on Monday.","content":"INTERNATIONAL BUSINESS TIMES NEWSLETTER SIGNUP My account Log Out Oct 16, 6:06 PM EDT World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion NEWSLETTER My account Log Out US Edition World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Business Belgium V Sweden Euro Qualifier Abandoned After Brussels Shooting By AFP News 10/16/23 AT 6:06 PM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard Marcel Sabitzer's goal sent Austria to Euro 2024 AFP Belgium's Euro 2024 qualifier against Sweden was abandoned at half-time and fans were kept in the stadium for security reasons after two Swedes were shot dead in an attack in Brussels on Monday. Supporters at the King Baudouin stadium in the Belgian capital were told to remain inside the ground following an announcement that the players would not return for the second half. \"Following a suspected terrorist attack in Brussels this evening, it has been decided after consultation with the two teams and the local police authorities, that the UEFA EURO 2024 qualifying match between Belgium and Sweden is abandoned,\" UEFA said on its website. Sweden's football association said Belgian police had told supporters \"to stay in the arena for security reasons\". Two Swedish nationals were shot dead by a suspect who remains at large, in an attack the Belgian prime minister described as \"terrorism\". Several Belgian media outlets said the two individuals killed were wearing the jersey of the Sweden national team. Belgium, who had already qualified for next year's tournament, had equalised through a Romelu Lukaku penalty after Viktor Gyokeres opened the scoring for Sweden before the match was halted with the score at 1-1. Belgian media reported that the Swedish players did not want to continue the game after learning of the attack. Austria had earlier Monday become the eighth team to book their place at next year's finals in Germany courtesy of a 1-0 win in Azerbaijan in the other Group F game. Borussia Dortmund midfielder Marcel Sabitzer scored a penalty three minutes after coming on as a half-time substitute for Ralf Rangnick's side. Cristiano Ronaldo struck twice as Portugal thrashed Bosnia and Herzegovina 5-0 to maintain their perfect record in Group J. Ronaldo, 38, extended his men's record international goals tally to 127 after an early penalty was followed by a deft chip that doubled the lead for Portugal in Zenica. Bruno Fernandes hammered in a third and Joao Cancelo supplied a brilliant finish of his own, with Joao Felix making it five before half-time. Portugal clinched first place with two games remaining and have scored 32 times and conceded just twice -- both in Friday's 3-2 win over Slovakia which secured qualification. Slovakia solidified their grip on second place with a 1-0 victory in Luxembourg. Gylfi Sigurdsson scored twice for Iceland as they stayed in contention with a 4-0 rout of Liechtenstein. Virgil van Dijk converted a stoppage-time penalty to earn the Netherlands a crucial 1-0 victory away to Greece in Group B. Wout Weghorst had a first-half spot-kick saved for the Dutch in Athens, but Liverpool defender Van Dijk made no mistake after a foul on Denzel Dumfries. The Netherlands drew level on 12 points with Greece and have the head-to-head advantage after beating them home and away. Ronald Koeman's team also have a game in hand on their rivals as they bid to wrap up second behind group winners France. Brighton's rising 18-year-old star Evan Ferguson was among the scorers as the Republic of Ireland dispatched Gibraltar 4-0 in Portugal. Cristiano Ronaldo scored twice in Portugal's easy win against Bosnia-Herzegovina AFP Sweden supporters wait inside the ground after their team's game against Belgium was stopped in the wake of an attack in Brussels AFP © Copyright AFP 2023. All rights reserved. Join the Discussion MOST READ IN Business 1 US Pharmacy Chain Rite Aid Files For Bankruptcy 2 Poland's Liberal Opposition On Course To Win Election 3 World Leaders Seek To Contain Israel-Hamas War, Protect Civilians 4 'Great Vibrations' Of Mark Rothko At Blockbuster Paris Show 5 Serbia-Kosovo Dialogue Urged As Balkan Summit Opens NEWS World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Editions Japan Nigeria Singapore South Africa South Korea Spain Mexico United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.","pubDate":"2023-10-16 22:06:33","image_url":null,"source_id":"ibtimes","source_priority":458722,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"218bfa5329481316e07bcdd25f0bfc2d","title":"Евро 2024: все участники, кто прошел отбор чемпионата Европы","link":"https://www.sport-express.ru/football/euro/news/evro-2024-vse-sbornye-uchastniki-komandy-chempionata-evropy-kto-proshel-otbor-na-turnir-2133671/","keywords":["Футбол - Чемпионат Европы"],"creator":null,"video_url":null,"description":"17-й розыгрыш чемпионата Европы по футболу пройдет в Германии в 2024 году с 14 июня по 14 июля.","content":"17-й розыгрыш чемпионата Европы по футболу пройдет в Германии в 2024 году с 14 июня по 14 июля. В нем примут участие всего 24 команды. Немецкая сборная, как страна-хозяйка, получила автоматическое право участвовать в турнире. Еще 23 национальные команды определятся по итогам квалификации, в которой участвуют 53 сборные. Жеребьевка отборочного турнира состоялась 9 октября 2022 года. Все сборные поделены на 10 групп: 7 групп по 5 команд, 3 группы по 6 команд. Квалификационные матчи проходят с марта 2023 года по март 2024. Россия отстранена от участия в турнирах под эгидой организации на неопределенный срок по решению УЕФА. Новость будет дополняться.","pubDate":"2023-10-16 22:00:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"b79d9e58d1661f50de8ec0da727e4cf5","title":"«Ювентус» продолжает интересоваться Хейбьергом","link":"https://www.sport-express.ru/football/transfers/news/yuventus-prodolzhaet-interesovatsya-heybergom-2134357/","keywords":["Футбол - Трансферы"],"creator":null,"video_url":null,"description":"Полузащитник «Тоттенхэма» Пьер-Эмиль Хейбьерг может продолжить карьеру в Италии, сообщает La Gazzetta dello Sport.","content":"Полузащитник «Тоттенхэма» Пьер-Эмиль Хейбьерг может продолжить карьеру в Италии, сообщает La Gazzetta dello Sport. По сведениям источника, на 28-летнего датчанина претендует «Ювентус». Туринцы продолжают следить за игроком и хотят подписать его зимой. В текущем сезоне Хейбьерг провел 8 матчей, в которых не отметился результативными действиями.","pubDate":"2023-10-16 21:59:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"c1d209d7b96077a5444d96f2bbb5bbc6","title":"2 Swedes shot dead in Brussels, Belgium raises terror alert to top level","link":"https://www.rappler.com/world/europe/brussels-belgium-shooting-updates-october-17-2023/","keywords":null,"creator":["Reuters"],"video_url":null,"description":"A Belgian federal prosecutor says there is no evidence the attacker, who was still on the loose, had any link to the recent renewed conflict between Israel and Palestinian militants","content":"BRUSSELS, Belgium – Two Swedish nationals were shot to death and a third person was wounded in central Brussels on Monday night, October 16, and a man who identified himself as a member of the Islamic State claimed responsibility in a video posted online. The suspected assailant fled the scene after the shooting as a football match between Belgium and Sweden was about to start, triggering a massive manhunt and prompting Belgium to raise its terror alert to the highest level. A Belgian federal prosecutor said there was no evidence that the attacker, who was still on the loose, had any link to the recent renewed conflict between Israel and Palestinian militants. The likely motive for the attack was the Swedish nationality of the victims, the prosecutor said. Sweden in August raised its terror alert to the second-highest level, warning of an increase in threats against Swedish interests abroad, after Koran burnings and other acts in Sweden against Islam’s holiest text outraged Muslims and triggered threats from jihadists. The suspected assailant, calling himself Abdesalem Al Guilani, claimed in a video on social media that he was a fighter for Allah. The federal prosecutor said the third victim, who was wounded but whose condition was not life-threatening, was a taxi driver. The prosecutor called on Brussels’ residents to stay indoors until the threat was over. European Commission staff were also advised to stay indoors. Belgian Prime Minister Alexander de Croo confirmed on social media platform X, formerly known as Twitter, the victims were Swedish. “I have just offered my sincere condolences to the Swedish PM following tonight’s harrowing attack on Swedish citizens in Brussels,” de Croo said on X. “Our thoughts are with the families and friends who lost their loved ones. As close partners, the fight against terrorism is a joint one,” he said. Sweden’s Justice minister, Gunnar Strommer, told Reuters the government was working intensively with Belgian authorities to get more information about what happened. All Swedes in Belgium will receive a text message sent to their phones urging them to be vigilant and to follow instructions from Belgian authorities, Swedish Prime Minister Ulf Kristersson said. Belgium’s interior minister said the investigation was in the hands of a federal prosecutor because of “a possible terrorist motive.” One Belgian newspaper said it was likely that the victims were two soccer supporters. Belgium were hosting Sweden in a Euro 2024 qualifying match on Monday evening. The match was suspended at halftime because of security reasons. The shooting comes at a time of heightened security concerns in some European countries linked to the Israel-Hamas conflict. France is deploying 7,000 extra troops onto its streets after a teacher was fatally stabbed on Friday in an attack President Emmanuel Macron condemned as “barbaric Islamic terrorism.” Video footage of the Brussels attack posted on the Het Laatste Nieuws newspaper website showed a man in an orange jacket on a scooter at a street intersection with a rifle first firing two shots, then three more, then running into a building, firing two more shots, leaving, taking a few steps back again and shooting one more time. One Belgium newspaper said a witness said the shooter shouted “Allahu Akbar” before the shots were fired. According to a media transcript of the video message recorded by the self-declared perpetrator, he said: “Islamic greeting Allahu Akbar. My name is Abdesalem Al Guilani and I am a fighter for Allah. I am from the Islamic State. We love who loves us and we hate who hates us. We live for our religion and we die for our religion. Alhamdulah. Your brother took revenge in the name of Muslims. I have killed 3 Swedes so far Al hamdoulelah. 3 Swedish, yes. Those to whom I have done something wrong, may they forgive me. And I forgive everyone. Salam Aleykoum.” France is tightening controls at the border with Belgium after the deadly attack in Brussels, Belgian media said. Belgium’s crisis center warned the public not to make any unnecessary trips in the capital. – Rappler.com","pubDate":"2023-10-17 00:48:59","image_url":null,"source_id":"rappler","source_priority":14296,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"a43c30bad5fa25a1f31bf290a4420805","title":"Куман — о победе над Грецией: «Нужно было быть очень осторожным, чтобы не уступить»","link":"https://www.sport-express.ru/football/euro/news/kuman-prokommentiroval-pobedu-sbornoy-niderlandov-nad-greciey-2134364/","keywords":["Футбол - Чемпионат Европы"],"creator":null,"video_url":null,"description":"Главный тренер сборной Нидерландов Роналд Куман подвел итоги матча отборочного турнира Евро-2024 против Греции (1:0).","content":"Главный тренер сборной Нидерландов Роналд Куман подвел итоги матча отборочного турнира Евро-2024 против Греции (1:0). «Мы должны были решить исход матча задолго до пенальти в добавленное время. Греция выпустила троих нападающих, и внезапно игроки оказались на своих позициях. У нас был комфортный первый тайм, но мы должны были забить пенальти. После этого матч стал другим. Мы продолжали верить в себя. Греция не создавала моментов, но нам нужно было быть очень осторожными, чтобы не уступить», — приводит слова Кумана официальный сайт УЕФА. Единственный мяч забил Вирджил ван Дейк. Он реализовал пенальти на 93-й минуте. Сборная Нидерландов занимает второе место в группе B, набрав 12 очков в 6 матчах. Греция — на третьем месте (12 очков в 7 играх).","pubDate":"2023-10-16 23:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"51a06489b8163a390fc860a6f1c366a6","title":"Моуринью покинет «Рому» в конце сезона","link":"https://www.sport-express.ru/football/italy/news/mourinyu-pokinet-romu-v-konce-sezona-2134355/","keywords":["Футбол - Италия"],"creator":null,"video_url":null,"description":"Главный тренер «Ромы» Жозе Моуринью покинет клуб в конце сезона, сообщает Sky Sports Italia.","content":"Главный тренер «Ромы» Жозе Моуринью покинет клуб в конце сезона, сообщает Sky Sports Italia. По сведениям источника, 60-летний португалец и клуб не будут продлевать соглашение, никаких переговоров не ведется. После 8 матчей «Рома» занимает 10-е место в турнирной таблице Италии, набрав 11 очков.","pubDate":"2023-10-16 22:31:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"ba1bc38dc27defe0f6f909e48c7a7dc6","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.northwaleschronicle.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d47e9cb5e84a0f9be6ae4c613ce877d6","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.southwalesguardian.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.southwalesguardian.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c17cc96554a52a467c6f19f851ce7b16","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.northwalespioneer.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.northwalespioneer.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4c6eb1789edccc2deff0ddf98585115b","title":"Le stade Roi-Baudoin de Bruxelles évacué après l'interruption de Belgique-Suède","link":"https://www.lequipe.fr/Football/Actualites/Le-stade-roi-baudoin-de-bruxelles-evacue-apres-l-interruption-de-belgique-suede/1425776#xtor=RSS-1","keywords":["Foot, Qualif. Euro"],"creator":["Arthur Verdelet"],"video_url":null,"description":"L'évacuation du stade Roi-Baudoin de Bruxelles a démarré à 23h45 ce lundi soir, plus de deux heures après l'arrêt de la rencontre Belgique-Suède. Une décision prise suite à « l'attentat terroriste » survenu plus tôt en centre-ville.","content":"L'évacuation a démarré à 23h45. Après près de deux heures d'attente, les premiers des 35 000 supporters présents dans les tribunes du stade Roi-Baudoin pour assister à la rencontre Belgique-Suède (arrêtée à la mi-temps) ont été autorisés à quitter l'enceinte par les forces de sécurité, toujours à la recherche de l'auteur d'un , comme annoncé par le Premier ministre belge en centre-ville. L'évacuation semble se dérouler dans le calme selon les premières images diffusées par les médias présents sur place. Les supporters suédois sont eux pour la plupart encore présents dans les travées, tout comme une partie des fans belges.","pubDate":"2023-10-16 22:28:26","image_url":"https://medias.lequipe.fr/img-photo-jpg/les-spectateurs-de-la-rencontre-belgique-suede-ont-pu-commencer-a-quitter-les-tribunes-du-stade-roi-baudoin-de-bruxelles-dans-le-calme-apres-une-longue-attente-y-herman-reuters/1500000001848291/0:0,1918:959-665-335-70/01b67.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"3630963e1a54480fc08de2382cc7c59a","title":"Belgium V Sweden Euro Qualifier Abandoned After Brussels Shooting","link":"https://www.ibtimes.com/belgium-v-sweden-euro-qualifier-abandoned-after-brussels-shooting-3715451","keywords":null,"creator":null,"video_url":null,"description":"Belgium's Euro 2024 qualifier against Sweden was abandoned at half-time and fans were kept in the stadium for security reasons after two Swedes were shot dead in an attack in Brussels on Monday.","content":"INTERNATIONAL BUSINESS TIMES NEWSLETTER SIGNUP My account Log Out Oct 16, 6:06 PM EDT World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion NEWSLETTER My account Log Out US Edition World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Business Belgium V Sweden Euro Qualifier Abandoned After Brussels Shooting By AFP News 10/16/23 AT 6:06 PM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard Marcel Sabitzer's goal sent Austria to Euro 2024 AFP Belgium's Euro 2024 qualifier against Sweden was abandoned at half-time and fans were kept in the stadium for security reasons after two Swedes were shot dead in an attack in Brussels on Monday. Supporters at the King Baudouin stadium in the Belgian capital were told to remain inside the ground following an announcement that the players would not return for the second half. \"Following a suspected terrorist attack in Brussels this evening, it has been decided after consultation with the two teams and the local police authorities, that the UEFA EURO 2024 qualifying match between Belgium and Sweden is abandoned,\" UEFA said on its website. Sweden's football association said Belgian police had told supporters \"to stay in the arena for security reasons\". Two Swedish nationals were shot dead by a suspect who remains at large, in an attack the Belgian prime minister described as \"terrorism\". Several Belgian media outlets said the two individuals killed were wearing the jersey of the Sweden national team. Belgium, who had already qualified for next year's tournament, had equalised through a Romelu Lukaku penalty after Viktor Gyokeres opened the scoring for Sweden before the match was halted with the score at 1-1. Belgian media reported that the Swedish players did not want to continue the game after learning of the attack. Austria had earlier Monday become the eighth team to book their place at next year's finals in Germany courtesy of a 1-0 win in Azerbaijan in the other Group F game. Borussia Dortmund midfielder Marcel Sabitzer scored a penalty three minutes after coming on as a half-time substitute for Ralf Rangnick's side. Cristiano Ronaldo struck twice as Portugal thrashed Bosnia and Herzegovina 5-0 to maintain their perfect record in Group J. Ronaldo, 38, extended his men's record international goals tally to 127 after an early penalty was followed by a deft chip that doubled the lead for Portugal in Zenica. Bruno Fernandes hammered in a third and Joao Cancelo supplied a brilliant finish of his own, with Joao Felix making it five before half-time. Portugal clinched first place with two games remaining and have scored 32 times and conceded just twice -- both in Friday's 3-2 win over Slovakia which secured qualification. Slovakia solidified their grip on second place with a 1-0 victory in Luxembourg. Gylfi Sigurdsson scored twice for Iceland as they stayed in contention with a 4-0 rout of Liechtenstein. Virgil van Dijk converted a stoppage-time penalty to earn the Netherlands a crucial 1-0 victory away to Greece in Group B. Wout Weghorst had a first-half spot-kick saved for the Dutch in Athens, but Liverpool defender Van Dijk made no mistake after a foul on Denzel Dumfries. The Netherlands drew level on 12 points with Greece and have the head-to-head advantage after beating them home and away. Ronald Koeman's team also have a game in hand on their rivals as they bid to wrap up second behind group winners France. Brighton's rising 18-year-old star Evan Ferguson was among the scorers as the Republic of Ireland dispatched Gibraltar 4-0 in Portugal. Cristiano Ronaldo scored twice in Portugal's easy win against Bosnia-Herzegovina AFP Sweden supporters wait inside the ground after their team's game against Belgium was stopped in the wake of an attack in Brussels AFP © Copyright AFP 2023. All rights reserved. Join the Discussion MOST READ IN Business 1 US Pharmacy Chain Rite Aid Files For Bankruptcy 2 Poland's Liberal Opposition On Course To Win Election 3 World Leaders Seek To Contain Israel-Hamas War, Protect Civilians 4 'Great Vibrations' Of Mark Rothko At Blockbuster Paris Show 5 Serbia-Kosovo Dialogue Urged As Balkan Summit Opens NEWS World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Editions Japan Nigeria Singapore South Africa South Korea Spain Mexico United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.","pubDate":"2023-10-16 22:06:33","image_url":null,"source_id":"ibtimes","source_priority":458722,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"218bfa5329481316e07bcdd25f0bfc2d","title":"Евро 2024: все участники, кто прошел отбор чемпионата Европы","link":"https://www.sport-express.ru/football/euro/news/evro-2024-vse-sbornye-uchastniki-komandy-chempionata-evropy-kto-proshel-otbor-na-turnir-2133671/","keywords":["Футбол - Чемпионат Европы"],"creator":null,"video_url":null,"description":"17-й розыгрыш чемпионата Европы по футболу пройдет в Германии в 2024 году с 14 июня по 14 июля.","content":"17-й розыгрыш чемпионата Европы по футболу пройдет в Германии в 2024 году с 14 июня по 14 июля. В нем примут участие всего 24 команды. Немецкая сборная, как страна-хозяйка, получила автоматическое право участвовать в турнире. Еще 23 национальные команды определятся по итогам квалификации, в которой участвуют 53 сборные. Жеребьевка отборочного турнира состоялась 9 октября 2022 года. Все сборные поделены на 10 групп: 7 групп по 5 команд, 3 группы по 6 команд. Квалификационные матчи проходят с марта 2023 года по март 2024. Россия отстранена от участия в турнирах под эгидой организации на неопределенный срок по решению УЕФА. Новость будет дополняться.","pubDate":"2023-10-16 22:00:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"b79d9e58d1661f50de8ec0da727e4cf5","title":"«Ювентус» продолжает интересоваться Хейбьергом","link":"https://www.sport-express.ru/football/transfers/news/yuventus-prodolzhaet-interesovatsya-heybergom-2134357/","keywords":["Футбол - Трансферы"],"creator":null,"video_url":null,"description":"Полузащитник «Тоттенхэма» Пьер-Эмиль Хейбьерг может продолжить карьеру в Италии, сообщает La Gazzetta dello Sport.","content":"Полузащитник «Тоттенхэма» Пьер-Эмиль Хейбьерг может продолжить карьеру в Италии, сообщает La Gazzetta dello Sport. По сведениям источника, на 28-летнего датчанина претендует «Ювентус». Туринцы продолжают следить за игроком и хотят подписать его зимой. В текущем сезоне Хейбьерг провел 8 матчей, в которых не отметился результативными действиями.","pubDate":"2023-10-16 21:59:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"c1d209d7b96077a5444d96f2bbb5bbc6","title":"2 Swedes shot dead in Brussels, Belgium raises terror alert to top level","link":"https://www.rappler.com/world/europe/brussels-belgium-shooting-updates-october-17-2023/","keywords":null,"creator":["Reuters"],"video_url":null,"description":"A Belgian federal prosecutor says there is no evidence the attacker, who was still on the loose, had any link to the recent renewed conflict between Israel and Palestinian militants","content":"BRUSSELS, Belgium – Two Swedish nationals were shot to death and a third person was wounded in central Brussels on Monday night, October 16, and a man who identified himself as a member of the Islamic State claimed responsibility in a video posted online. The suspected assailant fled the scene after the shooting as a football match between Belgium and Sweden was about to start, triggering a massive manhunt and prompting Belgium to raise its terror alert to the highest level. A Belgian federal prosecutor said there was no evidence that the attacker, who was still on the loose, had any link to the recent renewed conflict between Israel and Palestinian militants. The likely motive for the attack was the Swedish nationality of the victims, the prosecutor said. Sweden in August raised its terror alert to the second-highest level, warning of an increase in threats against Swedish interests abroad, after Koran burnings and other acts in Sweden against Islam’s holiest text outraged Muslims and triggered threats from jihadists. The suspected assailant, calling himself Abdesalem Al Guilani, claimed in a video on social media that he was a fighter for Allah. The federal prosecutor said the third victim, who was wounded but whose condition was not life-threatening, was a taxi driver. The prosecutor called on Brussels’ residents to stay indoors until the threat was over. European Commission staff were also advised to stay indoors. Belgian Prime Minister Alexander de Croo confirmed on social media platform X, formerly known as Twitter, the victims were Swedish. “I have just offered my sincere condolences to the Swedish PM following tonight’s harrowing attack on Swedish citizens in Brussels,” de Croo said on X. “Our thoughts are with the families and friends who lost their loved ones. As close partners, the fight against terrorism is a joint one,” he said. Sweden’s Justice minister, Gunnar Strommer, told Reuters the government was working intensively with Belgian authorities to get more information about what happened. All Swedes in Belgium will receive a text message sent to their phones urging them to be vigilant and to follow instructions from Belgian authorities, Swedish Prime Minister Ulf Kristersson said. Belgium’s interior minister said the investigation was in the hands of a federal prosecutor because of “a possible terrorist motive.” One Belgian newspaper said it was likely that the victims were two soccer supporters. Belgium were hosting Sweden in a Euro 2024 qualifying match on Monday evening. The match was suspended at halftime because of security reasons. The shooting comes at a time of heightened security concerns in some European countries linked to the Israel-Hamas conflict. France is deploying 7,000 extra troops onto its streets after a teacher was fatally stabbed on Friday in an attack President Emmanuel Macron condemned as “barbaric Islamic terrorism.” Video footage of the Brussels attack posted on the Het Laatste Nieuws newspaper website showed a man in an orange jacket on a scooter at a street intersection with a rifle first firing two shots, then three more, then running into a building, firing two more shots, leaving, taking a few steps back again and shooting one more time. One Belgium newspaper said a witness said the shooter shouted “Allahu Akbar” before the shots were fired. According to a media transcript of the video message recorded by the self-declared perpetrator, he said: “Islamic greeting Allahu Akbar. My name is Abdesalem Al Guilani and I am a fighter for Allah. I am from the Islamic State. We love who loves us and we hate who hates us. We live for our religion and we die for our religion. Alhamdulah. Your brother took revenge in the name of Muslims. I have killed 3 Swedes so far Al hamdoulelah. 3 Swedish, yes. Those to whom I have done something wrong, may they forgive me. And I forgive everyone. Salam Aleykoum.” France is tightening controls at the border with Belgium after the deadly attack in Brussels, Belgian media said. Belgium’s crisis center warned the public not to make any unnecessary trips in the capital. – Rappler.com","pubDate":"2023-10-17 00:48:59","image_url":null,"source_id":"rappler","source_priority":14296,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"a43c30bad5fa25a1f31bf290a4420805","title":"Куман — о победе над Грецией: «Нужно было быть очень осторожным, чтобы не уступить»","link":"https://www.sport-express.ru/football/euro/news/kuman-prokommentiroval-pobedu-sbornoy-niderlandov-nad-greciey-2134364/","keywords":["Футбол - Чемпионат Европы"],"creator":null,"video_url":null,"description":"Главный тренер сборной Нидерландов Роналд Куман подвел итоги матча отборочного турнира Евро-2024 против Греции (1:0).","content":"Главный тренер сборной Нидерландов Роналд Куман подвел итоги матча отборочного турнира Евро-2024 против Греции (1:0). «Мы должны были решить исход матча задолго до пенальти в добавленное время. Греция выпустила троих нападающих, и внезапно игроки оказались на своих позициях. У нас был комфортный первый тайм, но мы должны были забить пенальти. После этого матч стал другим. Мы продолжали верить в себя. Греция не создавала моментов, но нам нужно было быть очень осторожными, чтобы не уступить», — приводит слова Кумана официальный сайт УЕФА. Единственный мяч забил Вирджил ван Дейк. Он реализовал пенальти на 93-й минуте. Сборная Нидерландов занимает второе место в группе B, набрав 12 очков в 6 матчах. Греция — на третьем месте (12 очков в 7 играх).","pubDate":"2023-10-16 23:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"51a06489b8163a390fc860a6f1c366a6","title":"Моуринью покинет «Рому» в конце сезона","link":"https://www.sport-express.ru/football/italy/news/mourinyu-pokinet-romu-v-konce-sezona-2134355/","keywords":["Футбол - Италия"],"creator":null,"video_url":null,"description":"Главный тренер «Ромы» Жозе Моуринью покинет клуб в конце сезона, сообщает Sky Sports Italia.","content":"Главный тренер «Ромы» Жозе Моуринью покинет клуб в конце сезона, сообщает Sky Sports Italia. По сведениям источника, 60-летний португалец и клуб не будут продлевать соглашение, никаких переговоров не ведется. После 8 матчей «Рома» занимает 10-е место в турнирной таблице Италии, набрав 11 очков.","pubDate":"2023-10-16 22:31:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"ba1bc38dc27defe0f6f909e48c7a7dc6","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.northwaleschronicle.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d47e9cb5e84a0f9be6ae4c613ce877d6","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.southwalesguardian.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.southwalesguardian.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c17cc96554a52a467c6f19f851ce7b16","title":"Stephen Kenny focused on fixtures instead of future after Ireland beat Gibraltar","link":"https://www.northwalespioneer.co.uk/sport/national/23859713.stephen-kenny-focused-fixtures-instead-future-ireland-beat-gibraltar/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Ireland will head for Amsterdam on the back of victory over the Group B minnows.","content":"Stephen Kenny is thinking only of the Republic of Ireland’s final Euro 2024 qualifier in the Netherlands after avoiding a potential banana skin against Gibraltar. Monday evening’s 4-0 win over Group B’s basement boys handed Ireland just a second victory in seven attempts in qualification, and they will head for Amsterdam next month to face a Dutch side still to secure a place at next summer’s finals. That game and the friendly against New Zealand which follows it seem likely to be Kenny’s last at the helm, with his contract due to expire at the end of the campaign. “It’s a big game. Holland need to win to qualify. They will be flying. We’ve got to put a performance in against Holland in Amsterdam. It’s a big challenge, it’s one we are looking forward to. Out of that, it’s out of my control. “I honestly don’t know. It may well be. I’ll give it everything against Holland and New Zealand. There’s no doubt, of course I want to be the manager of Ireland. It’s brilliant.” Kenny has found himself under intense pressure since Friday night’s 2-0 home defeat by Greece – who also won the reverse fixture in Athens 2-1 – which ended Ireland’s hopes of automatic qualification. The 51-year-old, who insisted before the game that he was not considering resigning, said: “I understand the Greek results, I understand that. Losing to Greece, that’s a 50-50 game. We lost it. There’s a lot of criticism because of that. “That’s OK. There’s also been a lot of good football that people shouldn’t forget either.” Evan Ferguson’s early strike set Kenny’s men on their way in Faro before Mikey Johnston made it 2-0 at the break, and second-half strikes from Matt Doherty and substitute Callum Robinson completed a win which was every bit as regulation as it should have been against a side who have now played 44 Euro and World Cup qualifiers and are yet to collect a point. The manager was delighted with the way his players responded to the defeat by the Greeks. He said: “We’re disappointed having lost the game on Friday. To put that behind them and to train and get themselves ready in a professional way and then work the openings for the goals in a very clever way, it made the finishes easier. “The players deserve credit because it was a professional job on the night, a good performance. We could have got a lot more goals.” Kenny was particularly pleased with Celtic winger Johnston’s contribution as he claimed a second senior international goal on his first start for his country. He said: “Mikey Johnston, he needs games. The tempo of that game isn’t Greece and Holland. He is a talent, he will be a good player for Ireland.”","pubDate":"2023-10-16 22:29:34","image_url":"https://www.northwalespioneer.co.uk/resources/images/17339619/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4c6eb1789edccc2deff0ddf98585115b","title":"Le stade Roi-Baudoin de Bruxelles évacué après l'interruption de Belgique-Suède","link":"https://www.lequipe.fr/Football/Actualites/Le-stade-roi-baudoin-de-bruxelles-evacue-apres-l-interruption-de-belgique-suede/1425776#xtor=RSS-1","keywords":["Foot, Qualif. Euro"],"creator":["Arthur Verdelet"],"video_url":null,"description":"L'évacuation du stade Roi-Baudoin de Bruxelles a démarré à 23h45 ce lundi soir, plus de deux heures après l'arrêt de la rencontre Belgique-Suède. Une décision prise suite à « l'attentat terroriste » survenu plus tôt en centre-ville.","content":"L'évacuation a démarré à 23h45. Après près de deux heures d'attente, les premiers des 35 000 supporters présents dans les tribunes du stade Roi-Baudoin pour assister à la rencontre Belgique-Suède (arrêtée à la mi-temps) ont été autorisés à quitter l'enceinte par les forces de sécurité, toujours à la recherche de l'auteur d'un , comme annoncé par le Premier ministre belge en centre-ville. L'évacuation semble se dérouler dans le calme selon les premières images diffusées par les médias présents sur place. Les supporters suédois sont eux pour la plupart encore présents dans les travées, tout comme une partie des fans belges.","pubDate":"2023-10-16 22:28:26","image_url":"https://medias.lequipe.fr/img-photo-jpg/les-spectateurs-de-la-rencontre-belgique-suede-ont-pu-commencer-a-quitter-les-tribunes-du-stade-roi-baudoin-de-bruxelles-dans-le-calme-apres-une-longue-attente-y-herman-reuters/1500000001848291/0:0,1918:959-665-335-70/01b67.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"3630963e1a54480fc08de2382cc7c59a","title":"Belgium V Sweden Euro Qualifier Abandoned After Brussels Shooting","link":"https://www.ibtimes.com/belgium-v-sweden-euro-qualifier-abandoned-after-brussels-shooting-3715451","keywords":null,"creator":null,"video_url":null,"description":"Belgium's Euro 2024 qualifier against Sweden was abandoned at half-time and fans were kept in the stadium for security reasons after two Swedes were shot dead in an attack in Brussels on Monday.","content":"INTERNATIONAL BUSINESS TIMES NEWSLETTER SIGNUP My account Log Out Oct 16, 6:06 PM EDT World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion NEWSLETTER My account Log Out US Edition World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Business Belgium V Sweden Euro Qualifier Abandoned After Brussels Shooting By AFP News 10/16/23 AT 6:06 PM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard Marcel Sabitzer's goal sent Austria to Euro 2024 AFP Belgium's Euro 2024 qualifier against Sweden was abandoned at half-time and fans were kept in the stadium for security reasons after two Swedes were shot dead in an attack in Brussels on Monday. Supporters at the King Baudouin stadium in the Belgian capital were told to remain inside the ground following an announcement that the players would not return for the second half. \"Following a suspected terrorist attack in Brussels this evening, it has been decided after consultation with the two teams and the local police authorities, that the UEFA EURO 2024 qualifying match between Belgium and Sweden is abandoned,\" UEFA said on its website. Sweden's football association said Belgian police had told supporters \"to stay in the arena for security reasons\". Two Swedish nationals were shot dead by a suspect who remains at large, in an attack the Belgian prime minister described as \"terrorism\". Several Belgian media outlets said the two individuals killed were wearing the jersey of the Sweden national team. Belgium, who had already qualified for next year's tournament, had equalised through a Romelu Lukaku penalty after Viktor Gyokeres opened the scoring for Sweden before the match was halted with the score at 1-1. Belgian media reported that the Swedish players did not want to continue the game after learning of the attack. Austria had earlier Monday become the eighth team to book their place at next year's finals in Germany courtesy of a 1-0 win in Azerbaijan in the other Group F game. Borussia Dortmund midfielder Marcel Sabitzer scored a penalty three minutes after coming on as a half-time substitute for Ralf Rangnick's side. Cristiano Ronaldo struck twice as Portugal thrashed Bosnia and Herzegovina 5-0 to maintain their perfect record in Group J. Ronaldo, 38, extended his men's record international goals tally to 127 after an early penalty was followed by a deft chip that doubled the lead for Portugal in Zenica. Bruno Fernandes hammered in a third and Joao Cancelo supplied a brilliant finish of his own, with Joao Felix making it five before half-time. Portugal clinched first place with two games remaining and have scored 32 times and conceded just twice -- both in Friday's 3-2 win over Slovakia which secured qualification. Slovakia solidified their grip on second place with a 1-0 victory in Luxembourg. Gylfi Sigurdsson scored twice for Iceland as they stayed in contention with a 4-0 rout of Liechtenstein. Virgil van Dijk converted a stoppage-time penalty to earn the Netherlands a crucial 1-0 victory away to Greece in Group B. Wout Weghorst had a first-half spot-kick saved for the Dutch in Athens, but Liverpool defender Van Dijk made no mistake after a foul on Denzel Dumfries. The Netherlands drew level on 12 points with Greece and have the head-to-head advantage after beating them home and away. Ronald Koeman's team also have a game in hand on their rivals as they bid to wrap up second behind group winners France. Brighton's rising 18-year-old star Evan Ferguson was among the scorers as the Republic of Ireland dispatched Gibraltar 4-0 in Portugal. Cristiano Ronaldo scored twice in Portugal's easy win against Bosnia-Herzegovina AFP Sweden supporters wait inside the ground after their team's game against Belgium was stopped in the wake of an attack in Brussels AFP © Copyright AFP 2023. All rights reserved. Join the Discussion MOST READ IN Business 1 US Pharmacy Chain Rite Aid Files For Bankruptcy 2 Poland's Liberal Opposition On Course To Win Election 3 World Leaders Seek To Contain Israel-Hamas War, Protect Civilians 4 'Great Vibrations' Of Mark Rothko At Blockbuster Paris Show 5 Serbia-Kosovo Dialogue Urged As Balkan Summit Opens NEWS World U.S. Economy & Markets Companies Technology Digital Life Culture Sports Opinion Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Editions Japan Nigeria Singapore South Africa South Korea Spain Mexico United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.","pubDate":"2023-10-16 22:06:33","image_url":null,"source_id":"ibtimes","source_priority":458722,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"218bfa5329481316e07bcdd25f0bfc2d","title":"Евро 2024: все участники, кто прошел отбор чемпионата Европы","link":"https://www.sport-express.ru/football/euro/news/evro-2024-vse-sbornye-uchastniki-komandy-chempionata-evropy-kto-proshel-otbor-na-turnir-2133671/","keywords":["Футбол - Чемпионат Европы"],"creator":null,"video_url":null,"description":"17-й розыгрыш чемпионата Европы по футболу пройдет в Германии в 2024 году с 14 июня по 14 июля.","content":"17-й розыгрыш чемпионата Европы по футболу пройдет в Германии в 2024 году с 14 июня по 14 июля. В нем примут участие всего 24 команды. Немецкая сборная, как страна-хозяйка, получила автоматическое право участвовать в турнире. Еще 23 национальные команды определятся по итогам квалификации, в которой участвуют 53 сборные. Жеребьевка отборочного турнира состоялась 9 октября 2022 года. Все сборные поделены на 10 групп: 7 групп по 5 команд, 3 группы по 6 команд. Квалификационные матчи проходят с марта 2023 года по март 2024. Россия отстранена от участия в турнирах под эгидой организации на неопределенный срок по решению УЕФА. Новость будет дополняться.","pubDate":"2023-10-16 22:00:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"b79d9e58d1661f50de8ec0da727e4cf5","title":"«Ювентус» продолжает интересоваться Хейбьергом","link":"https://www.sport-express.ru/football/transfers/news/yuventus-prodolzhaet-interesovatsya-heybergom-2134357/","keywords":["Футбол - Трансферы"],"creator":null,"video_url":null,"description":"Полузащитник «Тоттенхэма» Пьер-Эмиль Хейбьерг может продолжить карьеру в Италии, сообщает La Gazzetta dello Sport.","content":"Полузащитник «Тоттенхэма» Пьер-Эмиль Хейбьерг может продолжить карьеру в Италии, сообщает La Gazzetta dello Sport. По сведениям источника, на 28-летнего датчанина претендует «Ювентус». Туринцы продолжают следить за игроком и хотят подписать его зимой. В текущем сезоне Хейбьерг провел 8 матчей, в которых не отметился результативными действиями.","pubDate":"2023-10-16 21:59:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"}]}