{"newsArray":[{"title":"Réunion ce lundi à la FFF pour nommer Thierry Henry à la tête de l'équipe de France Espoirs","link":"https://www.lequipe.fr/Football/Actualites/Reunion-ce-lundi-a-la-fff-pour-nommer-thierry-henry-a-la-tete-de-l-equipe-de-france-espoirs/1414800#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Rédaction"],"video_url":null,"description":"Le comité exécutif de la Fédération française de football, qui se réunit lundi, devrait choisir l'ancien attaquant de l'équipe de France Thierry Henry comme sélectionneur des Espoirs.","content":"Le jour tant attendu, pour l'équipe de France Espoirs, est enfin arrivé. La FFF devrait valider lundi la nomination de Thierry Henry à la tête des Espoirs, à un an des Jeux Olympiques à Paris. Auditionné le 7 août par le président Philippe Diallo, Marc Keller (en charge des sélections de jeunes) et Hubert Fournier (directeur technique national), l'ex-attaquant d'Arsenal était le , après plusieurs réunions des dirigeants de la Fédération pour affiner leur choix. Au cours des discussions, Henry s'était détaché de la concurrence de Jocelyn Gourvennec, Sabri Lamouchi et Julien Stéphan, qui n'avaient toujours pas de nouvelles de la FFF ces derniers jours. Dans les hautes sphères de l'instance, on assurait encore dimanche que le choix n'était pas totalement arrêté mais la nomination de l'ex-Gunner, cet après-midi, ne fait plus beaucoup de doutes. Le comité exécutif de la Fédération doit en effet se réunir à 16 heures avec un seul sujet à l'ordre du jour : « équipe de France Espoirs ». Mathieu Le Scornet pressenti au poste d'adjoint Actuellement en vacances, Jean-Michel Aulas y participera. L'ex-patron de l'OL est un fan de Thierry Henry et il a pu influer sur le choix de Diallo. Les dernières discussions, ce week-end et probablement encore ce lundi matin, portaient sur des considérations financières et sur la composition du staff, que Keller souhaite très complet. Selon certaines indiscrétions, Mathieu Le Scornet, très apprécié du président du Racing Club de Strasbourg, pourrait être nommé comme adjoint. Sur le plan économique, Henry a concédé de gros efforts, par rapport à ce qu'il gagne dans ses activités médiatiques (CBS, Amazon), mais un terrain d'entente n'était pas encore tout à fait trouvé ce week-end. L'ancien attaquant des Bleus (123 sélections, 51 buts) était d'ailleurs sur le bord de la pelouse du stade Bollaert-Delelis, dimanche soir, en direct sur Prime Video, pour Lens-Rennes. Blazer bleu marine, baskets blanches, tout sourire et comme à son habitude très complice du présentateur Thibault Le Rol, il n'a rien laissé transparaître et n'a fait aucune allusion à son probable futur poste.","pubDate":"2023-08-20 19:56:24","image_url":"https://medias.lequipe.fr/img-photo-jpg/thierry-henry-devrait-etre-nomme-au-poste-de-selectionneur-des-espoirs-b-papon-l-equipe/1500000001823440/0:0,1998:999-665-335-70/349a4.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Le Barça a trouvé la faille contre Cadix","link":"https://www.lequipe.fr/Football/Actualites/Le-barca-a-trouve-la-faille-contre-cadix/1414796#xtor=RSS-1","keywords":["Foot, ESP"],"creator":["Rémi Laxague"],"video_url":null,"description":"Une semaine après avoir été tenus en échec à Getafe (0-0), les Barcelonnais ont battu Cadix (2-0) en fin de match ce dimanche soir, pour la 2e journée de Liga, grâce à des buts de Pedri et Ferran Torres.","content":"Le match : 2-0 Le Barça a repris ses vieilles habitudes. Comme très souvent l'an passé, les Blaugranas se sont imposés ce dimanche soir sans encaisser de but (2-0) et dans les derniers instants du match contre Cadix, lors de la 2e journée de Liga. Pour leur premier match officiel au stade olympique de Montjuïc, où se joueront les rencontres à domicile des Blaugranas pendant les travaux de rénovation du Camp Nou, les Barcelonnais ont buté une bonne partie de la rencontre sur Jeremias Ledesma, le gardien adverse. Très autoritaire, réalisant 8 parades, dont plusieurs majeures (29e, 34e, 46e, 81e), il permettait aux Andalous de rester en vie, quand ce n'était pas la barre transversale qui repoussait la tête de Gavi (54e). Mais en fin de match, les hommes de Xavi ont débloqué leur compteur cette saison sur une superbe passe d'Ilkay Gündogan de l'extérieur du pied qui a trouvé Pedri dans la surface de Cadix, le milieu de terrain concluant de près, au ras du poteau de Ledesma (83e). En toute fin de match, Ferran Tores a ensuite profité d'une grossière erreur de placement défensif pour faire le break (90e+4), cinq minutes après que le but d'Ansu Fati a été refusé pour hors-jeu. Ce succès permet au Barça de se lancer dans cette saison, une semaine après le à Getafe. Cadix, qui avait gagné lors de la première journée, recule au classement (11e) et recevra Almeria la semaine prochaine dans un duel 100 % andalou.","pubDate":"2023-08-20 19:38:02","image_url":"https://medias.lequipe.fr/img-photo-jpg/gavi-et-les-barcelonnais-se-sont-sortis-du-piege-de-cadix-ce-dimanche-soir-b-casas-reuters/1500000001823432/0:0,1998:999-665-335-70/74347.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"NFL: Gehalt und Topverdiener: Das verdienen Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.","link":"https://www.spox.com/de/sport/ussport/nfl/2308/Artikel/gehalt-und-topverdiener-das-verdienen-patrick-mahomes-odell-beckham-jr-aaron-rodgers-und-co.html","keywords":["US-Sport / NFL"],"creator":null,"video_url":null,"description":"Die NFL-Regular-Season steht in den Startlöchern. SPOX wirft daher einen Blick auf die Topverdiener der amerikanischen Profiliga. Was verdienen Stars wie Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.?","content":"Die NFL-Regular-Season steht in den Startlöchern. SPOX wirft daher einen Blick auf die Topverdiener der amerikanischen Profiliga. Was verdienen Stars wie Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.? Die Football-Saison ist eröffnet, auf den Spielplätzen der 32 NFL-Teams finden in den kommenden Tagen und Wochen noch Preseason-Spiele statt. Am 8. September ist es dann aber endlich so weit und die Regular Season geht mit dem Duell zwischen den Kansas City Chiefs und den Detroit Lions offiziell los. Mit dem Auftaktspiel im Arrowhead Stadium in Kansas City beginnt die 18-wöchige Reise zu den Playoffs, die am 12. Februar 2024 mit Super Bowl LVIII in Paradise, Nevada, ihr Ende finden. Die NFL gehört zu den beliebtesten Profiligen, die es im Sport gibt, und wird von Millionen Fans weltweit begleitet. Daher ist es auch keine Überraschung, dass die Akteure auf dem Feld dementsprechend finanziell belohnt werden. Die NFL ist eine Liga der Quarterbacks. Das ist die Position, auf der Spieler am meisten Einfluss am Ausgang eines Spiels haben. Der QB hat bei fast jedem Spielzug seine Hände im Spiel und kriegt bei Siegen oft das meiste Lob ab, während er auch für Niederlagen die meiste Verantwortung trägt. Daher überrascht es nicht, dass die Topverdiener-Liste der NFL von der Quarterback-Position dominiert wird. Die Top 10 der wertvollsten Verträge lassen sich QBs zuschreiben. An der Spitze dieser Liste liegt Justin Herbert von den Los Angeles Chargers. Der 25-Jährige wurde erst im vergangenen Monat mit einem neuen Fünfjahresvertrag in Höhe von mehr als 262 Millionen US-Dollar ausgestattet. Damit ist er an Lamar Jackson von den Baltimore Ravens vorbeigezogen, der einen Fünfjahresvertrag in Höhe von 260 Millionen US-Dollar unterschrieben hat. Patrick Mahomes, zweifacher Super-Bowl-Champion mit den Kansas City Chiefs, belegt den siebten Platz (450 Millionen US-Dollar für insgesamt zehn Jahre). Der erste Nicht-QB in der Liste der wertvollsten Verträge ist Defensive Lineman Aaron Donald, der für seine Leistungen für die Los Angeles Rams mit 31,7 Millionen US-Dollar pro Jahr belohnt wird. Er reiht sich damit auf Platz 16 ein. Aaron Rodgers kriegt von den New York Jets 37,5 Millionen jährlich. Odell Beckham Jr., Wide Receiver, von den Baltimore Ravens 15 Millionen US-Dollar. Was die Saison 2023 betrifft, darf sich Lamar Jackson über das meiste Geld freuen, sein Gehalt für beträgt satte 80 Millionen US-Dollar. Darauf folgen auf Platz zwei mit einem Riesenabstand Daniel Jones und Deshaun Watson (beide 46 Millionen US-Dollar). Name Team Lamar Jackson Baltimore Ravens Daniel Jones New York Giants $46.000.000 Deshaun Watson Cleveland Browns Patrick Mahomes Kansas City Chiefs Kyler Murray Arizona Cardinals Aaron Rodgers New York Jets Chris Lindstrom Atlanta Falcons Orlando Brown Jr. Cincinnati Bengals Laremy Tunsil Houston Texans Daron Payne Washington Commanders","pubDate":"2023-08-20 19:24:32","image_url":"https://www.spox.com/de/sport/ussport/nfl/2308/Bilder/298/mahomes-1200_298x171.jpg","source_id":"spox","source_priority":673559,"country":["germany"],"category":["sports"],"language":"german"},{"title":"Facile face à Strasbourg, Monaco devient leader de la Ligue 1","link":"https://www.lequipe.fr/Football/Actualites/Facile-face-a-strasbourg-monaco-devient-leader-de-la-ligue-1/1414780#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"Grâce à une victoire probante acquise ce dimanche sur Strasbourg (3-0), Monaco occupe la première place du classement de la Ligue 1 en attendant le match de Rennes à Lens dans la soirée.","content":"Après avoir complètement manqué sa fin de saison dernière, privé sur la fin d'une place européenne, Monaco attaque ce nouvel exercice avec un autre visage, bien plus séduisant. , avec la manière (4-2), l'équipe désormais entraînée par Adi Hütter a enchaîné un deuxième succès ce dimanche face à Strasbourg (3-0). Et l'ASM a encore sorti les grands moyens, en marquant pas moins de trois buts à la défense alsacienne. Cette victoire au Louis-II lui permet même de grimper à la première place de la Ligue 1, en attendant le résultat de Rennes à Lens dans la soirée (coup d'envoi à 20h45). Il serait exagéré de dire que Monaco a dû s'employer dans cette rencontre. Même avec peu d'occasions franches, le club de la Principauté menait facilement de deux buts à la pause, sans avoir réellement dû s'employer contre un adversaire dépassé. Auteur d'un doublé, Takumi Minamino a d'abord chipé le ballon dans les pieds d'Abakar Sylla avant de décocher une magnifique frappe rasante qui a terminé sa trajectoire dans les petits filets de Matz Sels (1-0, 20e). Puis c'est de la tête que le Japonais, servi depuis la gauche par Caio Henrique, a marqué en devançant le malheureux Sylla (2-0, 36e). Et côté strasbourgeois ? Privé de ballons (l'ASM avait 62 % de possession à la pause), le Racing aurait pu égaliser par Lebo Mothiba, trouvé par Delaine, mais la tête du buteur sud-africain a frôlé la barre. Au retour des vestiaires, le scénario n'a pas évolué. Il a juste permis à Monaco de creuser encore l'écart, par Wissam Ben Yedder qui a conclu un contre parfaitement orchestré sur un tir détourné par Abakar Sylla (3-0, 58e). Bien pensif, Patrick Vieira a tenté dans la foulée d'insuffler un peu d'oxygène dans son équipe, avec les entrées d'Angelo et de Dilane Bakwa à la place de Mothiba et Kévin Gameiro, mais ce sont bien les Rouge et Blanc qui ont encore enchaîné les situations favorables. Minamino a frappé à côté (58e) et Eliot Matazo a obligé Sels à une claquette inspirée (73e). L'ASM devra confirmer ses belles dispositions le week-end prochain à Nantes, tandis que Strasbourg, vainqueur de l'OL (2-1) pour ses débuts, tentera de montrer un autre visage contre Toulouse.","pubDate":"2023-08-20 19:06:55","image_url":"https://medias.lequipe.fr/img-photo-jpg/takumi-minamino-auteur-d-un-double-contre-strasbourg-f-porcu-l-equipe/1500000001823410/0:0,1997:998-665-335-70/38416.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Football. J’ai pris 15-1 en Coupe de France","link":"https://www.bienpublic.com/sport/2023/08/20/j-ai-pris-15-1-en-coupe-de-france","keywords":["Sport","Football","Dijon","Dijon-ville","Edition Dijon et son agglomération","Fil Info"],"creator":null,"video_url":null,"description":"La fin du mois d’août marque la fin des vacances, mais aussi le 1er tour de la Coupe de France. Tous les clubs de district débutent leur saison par la plus grande compétition de foot du pays. C’est le cas de l’Olympique de Merceuil, club dont je fais fièrement partie. Une équipe de copains qui a connu un dimanche difficile…","content":"L’un des rares moments où j’ai touché le ballon. Photo Stéphane Rak Dans l'intimité du vestiaire de l'OM. Photo Stéphane Rak L’Olympique de Merceuil. Photo Stéphane Rak Ce n’est donc pas cette année que je verrai le Stade de France. La route vers Saint-Denis a connu un sacré glissement de terrain du côté de la Fontaine d’Ouche (D3). Un peu plus de 14 heures, “l’OM” (D3) arrive fringant au stade malgré quelques excès de la veille. Ces mecs-là en ont vu d’autres. Petit bémol, l’effectif est juste. C’est le 20 août, quelques vacanciers se dorent encore la pilule. 12 joueurs sont montés de Merceuil à Dijon, dont les co-entraîneurs, Flo et Antho. Des passionnés, des vrais. Nos hôtes nous... ...pour lire la suite, rejoignez notre communauté d'abonnés et accédez à l'intégralité de nos articles sur le site et l'application mobile à partir de 1 € le 1er mois, sans engagement de durée {'skus': ['lbpswgpremium5']} Google : -50% les 6 premiers mois","pubDate":"2023-08-20 19:06:00","image_url":"https://cdn-s-www.bienpublic.com/images/EC3A2987-19AE-4D7B-9D00-7409D82A2EB9/NW_listB/l-un-des-rares-moments-ou-j-ai-touche-le-ballon-photo-stephane-rak-1692558705.jpg","source_id":"bienpublic","source_priority":2016833,"country":["france"],"category":["sports"],"language":"french"},{"title":"Luka Elsner (Le Havre) inquiet pour Oussama Targhalline","link":"https://www.lequipe.fr/Football/Actualites/Luka-elsner-le-havre-inquiet-pour-oussama-targhalline/1414779#xtor=RSS-1","keywords":["Foot, L1, Le Havre"],"creator":["Sébastien Buron"],"video_url":null,"description":"L'entraîneur du Havre, Luka Elsner, craint « probablement » plusieurs semaines d'indisponibilité pour Oussama Targhalline, forfait de dernière minute pour le match contre Brest, dimanche (1-2) en Ligue 1.","content":"Après la ce dimanche (1-2), Luka Elsner, l'entraîneur du Havre, est revenu sur le . Pressenti titulaire, le Marocain s'est blessé à la hanche à l'échauffement, et son forfait a pu peser sur l'issue de la rencontre. a affirmé le technicien. Surtout, Elsner a fait part de sa grande inquiétude concernant la gravité de la blessure du joueur. , a indiqué le Slovène. (lundi), Elsner craint « » plusieurs semaines d'indisponibilité : Pour le HAC, ce serait un gros coup dur.","pubDate":"2023-08-20 19:02:45","image_url":"https://medias.lequipe.fr/img-photo-jpg/luka-elsner-craint-une-longue-periode-d-indisponibilite-pour-targhalline-b-paquot-l-equipe/1500000001823408/0:0,1998:999-665-335-70/6d0c3.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Crystal Palace vs Arsenal live stream, match preview, team news and kick-off time for this Premier League match","link":"https://www.fourfourtwo.com/features/crystal-palace-vs-arsenal-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match","keywords":null,"creator":null,"video_url":null,"description":"Find a Crystal Palace vs Arsenal live stream for how to watch this Premier League clash in the UK, US, Canada and anywhere in the world","content":"Looking for a Crystal Palace vs Arsenal live stream? We've got you covered. Crystal Palace vs Arsenal is on Sky Sports in the UK. Brit abroad? from anywhere. Arsenal started off their Premier League title challenge with a convincing 2-1 win against Nottingham Forest last weekend, at least for the first 80 minutes that is. Bukayo Saka and Eddie Nketiah were both on target for the Gunners as they got three points under their belt early on, but Thomas Partey started at right-back and Gabriel was dropped from the starting XI, confusing fans. With Jurrien Timber out for an extended period of time, though, Mikel Arteta will need the whole squad at full fitness. They face a Crystal Palace side who are taking positive steps under Roy Hodgson, especially after they beat new boys Sheffield United 1-0 away from home on opening day. The side is strong and balanced, but a lack of goals from the strikers this season could prove a problem for Palace, despite Odsonne Édouard bagging the winner at Bramall Lane. Kick-off is at 8pm BST. Make sure you know wherever you are. Crystal Palace are missing Michael Olise, Will Hughes and Matheus Franca for the visit of Arsenal, with Olise likely going to take the longest to recover. Arsenal will be without new signing Jurrien Timber for a number of months, though the full extent of his knee injury isn't yet known. What is known, though, is that Oleksandr Zinchenko and Folarin Balogun could both be fit enough to make the bench, but Gabriel Jesus will be out until at least September. Crystal Palace: W Arsenal: W David Coote will be the referee for Crystal Palace vs Arsenal. His assistants will be Marc Perry and Wade Smith, with Thomas Bramall the fourth official. Jarred Gillett is the VAR, with Neil Davies the assistant VAR. Crystal Palace vs Arsenal will be played at Selhurst Park in Croydon, London, which has a capacity of 25,486. kick-off is at on in the UK. The game is on in the UK. In the US, kick-off time is The match will be shown on NBC in the US. See below for international broadcast options. If you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit. A Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result. There are plenty of good-value options out there. For the Premier League, currently recommends: • UK: and are the two main players, but also have a slice of the pie in 2023/24. • USA: NBC Sports Group are the Premier League rights holders, with the streaming platform showing all 380 games in the season. A also lets you watch every game. • Canada: The way to watch Premier League football in 2023/24 is , which has exclusive rights to all the action. • Australia: will screen every game of the Premier League season. • New Zealand: are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.","pubDate":"2023-08-20 19:00:53","image_url":"https://cdn.mos.cms.futurecdn.net/hhnfZ6nzQmRwep3q2b7595.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Transferts : l'Inter Milan va faire une nouvelle offre pour Benjamin Pavard (Bayern Munich)","link":"https://www.lequipe.fr/Football/Actualites/Transferts-l-inter-milan-va-faire-une-nouvelle-offre-pour-benjamin-pavard-bayern-munich/1414774#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Loïc Tanzi"],"video_url":null,"description":"Après une première tentative de 25 M€ et 5 M€ de bonus, l'Inter Milan va augmenter son offre pour le défenseur du Bayern Munich Benjamin Pavard.","content":". Le club italien poursuit ses discussions avec le Bayern Munich et prévoit de faire une deuxième offre estimée à 28 M€, accompagnés de 5 M€ de bonus, pour le champion du monde 2018. Le Bayern Munich cherche déjà un remplaçant au Français, et acceptera de le laisser partir à ce moment-là. Ces dernières heures, le club allemand a retenté de faire venir Kyle Walker, sans succès.","pubDate":"2023-08-20 18:49:41","image_url":"https://medias.lequipe.fr/img-photo-jpg/l-inter-milan-pousse-pour-benjamin-pavard-h-feiner-expa-eibner-pressefoto/1500000001823401/0:0,1998:999-665-335-70/a25e2.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"L'AS Rome accrochée d'entrée par la Salernitana en Serie A","link":"https://www.lequipe.fr/Football/Actualites/L-as-rome-accrochee-d-entree-face-a-la-salernitana/1414773#xtor=RSS-1","keywords":["Foot, ITA"],"creator":["Arnaud De La Bruyère"],"video_url":null,"description":"Privée de Dybala, l'AS Rome a fait match nul ce dimanche sur sa pelouse face à la Salernitana (2-2) pour sa reprise en Serie A. Belotti et Candreva ont chacun marqué un doublé.","content":"Sixième du dernier exercice, l'AS Rome a lancé sa saison 2023-2024 en Serie A par un match nul ce dimanche au Stadio Olimpico face à la Salernitana (2-2) lors duquel Andrea Belotti et Antonio Candreva ont chacun scoré à deux reprises. Privé de Dybala et Pellegrini, suspendus pour accumulation de carton jaune en fin de saison dernière, le club de la Louve jouait également sans José Mourinho sur le banc, l'entraîneur portugais étant . L'AS Rome a parfaitement commencé son match en mettant de l'intensité. Andrea Belotti a ouvert son compteur, lui qui n'avait plus marqué depuis le 1er mai 2022 en Championnat, en ne laissant aucune chance à Ochoa de près (17e). L'ancien du Torino s'était vu refuser un premier but pour hors-jeu, inscrit sur un centre lointain de Cristante (7e). 34 Andrea Belotti a mis fin à une série de 34 matches sans inscrire de but en Championnat. La Salernitana est toutefois parvenue à renverser les Romains grâce à un superbe doublé d'Antonio Candreva. Il a d'abord remis son équipe à égalité d'une lourde frappe dans la surface après avoir facilement éliminé Smalling (36e) puis l'a mise devant au score avec un sublime enchaînement contrôle aérien du droit, frappe enroulée du gauche (49e). Andrea Belotti a finalement remis les deux équipes à égalité d'une jolie tête, sur un corner de Leandro Paredes. L'ancien Parisien est rentré en jeu après l'heure de jeu, tout comme Renato Sanches alors qu'Houssem Aouar a joué tout le match. Du côté de la formation dirigée par Paulo Sousa, Benoît Costil est resté sur le banc.","pubDate":"2023-08-20 18:49:14","image_url":"https://medias.lequipe.fr/img-photo-jpg/houssem-aouar-a-joue-son-premier-match-de-serie-a-avec-l-as-rome-italyphotopress-ipp/1500000001823400/0:0,1998:999-665-335-70/7e005.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Mondial féminin: polémique en Espagne après le baiser forcé du président de la fédération sur une joueuse","link":"https://www.h24info.ma/mondial-feminin-polemique-en-espagne-apres-le-baiser-force-du-president-de-la-federation-du-football-sur-une-joueuse/","keywords":["Sport","baiser de force","Espagne","FIFAWWC","finale coupe du monde féminin","Jenni Hermoso","Luis Rubiales"],"creator":["Alae Sdiqi"],"video_url":null,"description":"Durant la cérémonie de remise des médailles au terme de la finale de la Coupe du monde, le président de la Fédération espagnole de…","content":"Durant la cérémonie de remise des médailles au terme de la finale de la Coupe du monde, le président de la Fédération espagnole de football, Luis Rubiales, a embrassé de force l’attaquante Jenni Hermoso sur la bouche tout en soutenant sa tête avec ses deux mains. Un geste considéré comme un » abus sexuel » selon la législation espagnole. La scène a fait le tour du monde. Dans une ambiance d’euphorie totale et de folie déchaînée, l’un des moments les plus viraux s’est produit pendant les célébrations, juste avant de soulever la Coupe, et à quelques pas seulement de la Reine d’Espagne et la Princesse Sofia. Luis Rubiales, patron de la fédération espagnole de football se trouvait sur le podium installé au stade de Sydney, en train de distribuer les médailles. Là, il en profitait pour serrer avec un enthousiasme déchainé chacune des joueuses fraîchement couronnées championnes du monde du football féminin en battant l’Anglettere (1-0). Au passage de l’attaquante Jenni Hermoso, celle-ci serre dans ses bras le surexcité dirigeant sportif espagnol. Après cette chaleureuse accolade, Rubiales s’est enflammé. Il a pris le visage d’Hermoso et lui a posé un baiser de force sur la bouche en plein milieu de la remise des médailles. Un moment capturé par les caméras de la télévision publique espagnole, la TVE. Cette vidéo a rapidement fait le buzz sur les réseaux sociaux et la plupart des commentaires critiquent le comportement du dirigeant du football espagnol après avoir remporté la Coupe du Monde. Selon la radio Cadena Ser, la joueuse elle-même, lors d’un live sur Instagram depuis le vestiaire du Stadium Arena où elle célébrait le sacre avec ses coéquipières, plaisantait sur la démarche en disant « Eh bien, je n’ai pas aimé ça, hein »! Les réseaux sociaux ont réclamé des sanctions exemplaires contre le dirigeant sportif qui traîne déjà plusieurs casseroles à son actif, notamment des accusations d’organisation d’orgies en puisant dans les fonds de la fédération sportive espagnole.","pubDate":"2023-08-20 18:30:05","image_url":null,"source_id":"h24info","source_priority":6052027,"country":["morocco"],"category":["sports"],"language":"french"},{"title":"Réunion ce lundi à la FFF pour nommer Thierry Henry à la tête de l'équipe de France Espoirs","link":"https://www.lequipe.fr/Football/Actualites/Reunion-ce-lundi-a-la-fff-pour-nommer-thierry-henry-a-la-tete-de-l-equipe-de-france-espoirs/1414800#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Rédaction"],"video_url":null,"description":"Le comité exécutif de la Fédération française de football, qui se réunit lundi, devrait choisir l'ancien attaquant de l'équipe de France Thierry Henry comme sélectionneur des Espoirs.","content":"Le jour tant attendu, pour l'équipe de France Espoirs, est enfin arrivé. La FFF devrait valider lundi la nomination de Thierry Henry à la tête des Espoirs, à un an des Jeux Olympiques à Paris. Auditionné le 7 août par le président Philippe Diallo, Marc Keller (en charge des sélections de jeunes) et Hubert Fournier (directeur technique national), l'ex-attaquant d'Arsenal était le , après plusieurs réunions des dirigeants de la Fédération pour affiner leur choix. Au cours des discussions, Henry s'était détaché de la concurrence de Jocelyn Gourvennec, Sabri Lamouchi et Julien Stéphan, qui n'avaient toujours pas de nouvelles de la FFF ces derniers jours. Dans les hautes sphères de l'instance, on assurait encore dimanche que le choix n'était pas totalement arrêté mais la nomination de l'ex-Gunner, cet après-midi, ne fait plus beaucoup de doutes. Le comité exécutif de la Fédération doit en effet se réunir à 16 heures avec un seul sujet à l'ordre du jour : « équipe de France Espoirs ». Mathieu Le Scornet pressenti au poste d'adjoint Actuellement en vacances, Jean-Michel Aulas y participera. L'ex-patron de l'OL est un fan de Thierry Henry et il a pu influer sur le choix de Diallo. Les dernières discussions, ce week-end et probablement encore ce lundi matin, portaient sur des considérations financières et sur la composition du staff, que Keller souhaite très complet. Selon certaines indiscrétions, Mathieu Le Scornet, très apprécié du président du Racing Club de Strasbourg, pourrait être nommé comme adjoint. Sur le plan économique, Henry a concédé de gros efforts, par rapport à ce qu'il gagne dans ses activités médiatiques (CBS, Amazon), mais un terrain d'entente n'était pas encore tout à fait trouvé ce week-end. L'ancien attaquant des Bleus (123 sélections, 51 buts) était d'ailleurs sur le bord de la pelouse du stade Bollaert-Delelis, dimanche soir, en direct sur Prime Video, pour Lens-Rennes. Blazer bleu marine, baskets blanches, tout sourire et comme à son habitude très complice du présentateur Thibault Le Rol, il n'a rien laissé transparaître et n'a fait aucune allusion à son probable futur poste.","pubDate":"2023-08-20 19:56:24","image_url":"https://medias.lequipe.fr/img-photo-jpg/thierry-henry-devrait-etre-nomme-au-poste-de-selectionneur-des-espoirs-b-papon-l-equipe/1500000001823440/0:0,1998:999-665-335-70/349a4.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Le Barça a trouvé la faille contre Cadix","link":"https://www.lequipe.fr/Football/Actualites/Le-barca-a-trouve-la-faille-contre-cadix/1414796#xtor=RSS-1","keywords":["Foot, ESP"],"creator":["Rémi Laxague"],"video_url":null,"description":"Une semaine après avoir été tenus en échec à Getafe (0-0), les Barcelonnais ont battu Cadix (2-0) en fin de match ce dimanche soir, pour la 2e journée de Liga, grâce à des buts de Pedri et Ferran Torres.","content":"Le match : 2-0 Le Barça a repris ses vieilles habitudes. Comme très souvent l'an passé, les Blaugranas se sont imposés ce dimanche soir sans encaisser de but (2-0) et dans les derniers instants du match contre Cadix, lors de la 2e journée de Liga. Pour leur premier match officiel au stade olympique de Montjuïc, où se joueront les rencontres à domicile des Blaugranas pendant les travaux de rénovation du Camp Nou, les Barcelonnais ont buté une bonne partie de la rencontre sur Jeremias Ledesma, le gardien adverse. Très autoritaire, réalisant 8 parades, dont plusieurs majeures (29e, 34e, 46e, 81e), il permettait aux Andalous de rester en vie, quand ce n'était pas la barre transversale qui repoussait la tête de Gavi (54e). Mais en fin de match, les hommes de Xavi ont débloqué leur compteur cette saison sur une superbe passe d'Ilkay Gündogan de l'extérieur du pied qui a trouvé Pedri dans la surface de Cadix, le milieu de terrain concluant de près, au ras du poteau de Ledesma (83e). En toute fin de match, Ferran Tores a ensuite profité d'une grossière erreur de placement défensif pour faire le break (90e+4), cinq minutes après que le but d'Ansu Fati a été refusé pour hors-jeu. Ce succès permet au Barça de se lancer dans cette saison, une semaine après le à Getafe. Cadix, qui avait gagné lors de la première journée, recule au classement (11e) et recevra Almeria la semaine prochaine dans un duel 100 % andalou.","pubDate":"2023-08-20 19:38:02","image_url":"https://medias.lequipe.fr/img-photo-jpg/gavi-et-les-barcelonnais-se-sont-sortis-du-piege-de-cadix-ce-dimanche-soir-b-casas-reuters/1500000001823432/0:0,1998:999-665-335-70/74347.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"NFL: Gehalt und Topverdiener: Das verdienen Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.","link":"https://www.spox.com/de/sport/ussport/nfl/2308/Artikel/gehalt-und-topverdiener-das-verdienen-patrick-mahomes-odell-beckham-jr-aaron-rodgers-und-co.html","keywords":["US-Sport / NFL"],"creator":null,"video_url":null,"description":"Die NFL-Regular-Season steht in den Startlöchern. SPOX wirft daher einen Blick auf die Topverdiener der amerikanischen Profiliga. Was verdienen Stars wie Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.?","content":"Die NFL-Regular-Season steht in den Startlöchern. SPOX wirft daher einen Blick auf die Topverdiener der amerikanischen Profiliga. Was verdienen Stars wie Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.? Die Football-Saison ist eröffnet, auf den Spielplätzen der 32 NFL-Teams finden in den kommenden Tagen und Wochen noch Preseason-Spiele statt. Am 8. September ist es dann aber endlich so weit und die Regular Season geht mit dem Duell zwischen den Kansas City Chiefs und den Detroit Lions offiziell los. Mit dem Auftaktspiel im Arrowhead Stadium in Kansas City beginnt die 18-wöchige Reise zu den Playoffs, die am 12. Februar 2024 mit Super Bowl LVIII in Paradise, Nevada, ihr Ende finden. Die NFL gehört zu den beliebtesten Profiligen, die es im Sport gibt, und wird von Millionen Fans weltweit begleitet. Daher ist es auch keine Überraschung, dass die Akteure auf dem Feld dementsprechend finanziell belohnt werden. Die NFL ist eine Liga der Quarterbacks. Das ist die Position, auf der Spieler am meisten Einfluss am Ausgang eines Spiels haben. Der QB hat bei fast jedem Spielzug seine Hände im Spiel und kriegt bei Siegen oft das meiste Lob ab, während er auch für Niederlagen die meiste Verantwortung trägt. Daher überrascht es nicht, dass die Topverdiener-Liste der NFL von der Quarterback-Position dominiert wird. Die Top 10 der wertvollsten Verträge lassen sich QBs zuschreiben. An der Spitze dieser Liste liegt Justin Herbert von den Los Angeles Chargers. Der 25-Jährige wurde erst im vergangenen Monat mit einem neuen Fünfjahresvertrag in Höhe von mehr als 262 Millionen US-Dollar ausgestattet. Damit ist er an Lamar Jackson von den Baltimore Ravens vorbeigezogen, der einen Fünfjahresvertrag in Höhe von 260 Millionen US-Dollar unterschrieben hat. Patrick Mahomes, zweifacher Super-Bowl-Champion mit den Kansas City Chiefs, belegt den siebten Platz (450 Millionen US-Dollar für insgesamt zehn Jahre). Der erste Nicht-QB in der Liste der wertvollsten Verträge ist Defensive Lineman Aaron Donald, der für seine Leistungen für die Los Angeles Rams mit 31,7 Millionen US-Dollar pro Jahr belohnt wird. Er reiht sich damit auf Platz 16 ein. Aaron Rodgers kriegt von den New York Jets 37,5 Millionen jährlich. Odell Beckham Jr., Wide Receiver, von den Baltimore Ravens 15 Millionen US-Dollar. Was die Saison 2023 betrifft, darf sich Lamar Jackson über das meiste Geld freuen, sein Gehalt für beträgt satte 80 Millionen US-Dollar. Darauf folgen auf Platz zwei mit einem Riesenabstand Daniel Jones und Deshaun Watson (beide 46 Millionen US-Dollar). Name Team Lamar Jackson Baltimore Ravens Daniel Jones New York Giants $46.000.000 Deshaun Watson Cleveland Browns Patrick Mahomes Kansas City Chiefs Kyler Murray Arizona Cardinals Aaron Rodgers New York Jets Chris Lindstrom Atlanta Falcons Orlando Brown Jr. Cincinnati Bengals Laremy Tunsil Houston Texans Daron Payne Washington Commanders","pubDate":"2023-08-20 19:24:32","image_url":"https://www.spox.com/de/sport/ussport/nfl/2308/Bilder/298/mahomes-1200_298x171.jpg","source_id":"spox","source_priority":673559,"country":["germany"],"category":["sports"],"language":"german"},{"title":"Facile face à Strasbourg, Monaco devient leader de la Ligue 1","link":"https://www.lequipe.fr/Football/Actualites/Facile-face-a-strasbourg-monaco-devient-leader-de-la-ligue-1/1414780#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"Grâce à une victoire probante acquise ce dimanche sur Strasbourg (3-0), Monaco occupe la première place du classement de la Ligue 1 en attendant le match de Rennes à Lens dans la soirée.","content":"Après avoir complètement manqué sa fin de saison dernière, privé sur la fin d'une place européenne, Monaco attaque ce nouvel exercice avec un autre visage, bien plus séduisant. , avec la manière (4-2), l'équipe désormais entraînée par Adi Hütter a enchaîné un deuxième succès ce dimanche face à Strasbourg (3-0). Et l'ASM a encore sorti les grands moyens, en marquant pas moins de trois buts à la défense alsacienne. Cette victoire au Louis-II lui permet même de grimper à la première place de la Ligue 1, en attendant le résultat de Rennes à Lens dans la soirée (coup d'envoi à 20h45). Il serait exagéré de dire que Monaco a dû s'employer dans cette rencontre. Même avec peu d'occasions franches, le club de la Principauté menait facilement de deux buts à la pause, sans avoir réellement dû s'employer contre un adversaire dépassé. Auteur d'un doublé, Takumi Minamino a d'abord chipé le ballon dans les pieds d'Abakar Sylla avant de décocher une magnifique frappe rasante qui a terminé sa trajectoire dans les petits filets de Matz Sels (1-0, 20e). Puis c'est de la tête que le Japonais, servi depuis la gauche par Caio Henrique, a marqué en devançant le malheureux Sylla (2-0, 36e). Et côté strasbourgeois ? Privé de ballons (l'ASM avait 62 % de possession à la pause), le Racing aurait pu égaliser par Lebo Mothiba, trouvé par Delaine, mais la tête du buteur sud-africain a frôlé la barre. Au retour des vestiaires, le scénario n'a pas évolué. Il a juste permis à Monaco de creuser encore l'écart, par Wissam Ben Yedder qui a conclu un contre parfaitement orchestré sur un tir détourné par Abakar Sylla (3-0, 58e). Bien pensif, Patrick Vieira a tenté dans la foulée d'insuffler un peu d'oxygène dans son équipe, avec les entrées d'Angelo et de Dilane Bakwa à la place de Mothiba et Kévin Gameiro, mais ce sont bien les Rouge et Blanc qui ont encore enchaîné les situations favorables. Minamino a frappé à côté (58e) et Eliot Matazo a obligé Sels à une claquette inspirée (73e). L'ASM devra confirmer ses belles dispositions le week-end prochain à Nantes, tandis que Strasbourg, vainqueur de l'OL (2-1) pour ses débuts, tentera de montrer un autre visage contre Toulouse.","pubDate":"2023-08-20 19:06:55","image_url":"https://medias.lequipe.fr/img-photo-jpg/takumi-minamino-auteur-d-un-double-contre-strasbourg-f-porcu-l-equipe/1500000001823410/0:0,1997:998-665-335-70/38416.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Football. J’ai pris 15-1 en Coupe de France","link":"https://www.bienpublic.com/sport/2023/08/20/j-ai-pris-15-1-en-coupe-de-france","keywords":["Sport","Football","Dijon","Dijon-ville","Edition Dijon et son agglomération","Fil Info"],"creator":null,"video_url":null,"description":"La fin du mois d’août marque la fin des vacances, mais aussi le 1er tour de la Coupe de France. Tous les clubs de district débutent leur saison par la plus grande compétition de foot du pays. C’est le cas de l’Olympique de Merceuil, club dont je fais fièrement partie. Une équipe de copains qui a connu un dimanche difficile…","content":"L’un des rares moments où j’ai touché le ballon. Photo Stéphane Rak Dans l'intimité du vestiaire de l'OM. Photo Stéphane Rak L’Olympique de Merceuil. Photo Stéphane Rak Ce n’est donc pas cette année que je verrai le Stade de France. La route vers Saint-Denis a connu un sacré glissement de terrain du côté de la Fontaine d’Ouche (D3). Un peu plus de 14 heures, “l’OM” (D3) arrive fringant au stade malgré quelques excès de la veille. Ces mecs-là en ont vu d’autres. Petit bémol, l’effectif est juste. C’est le 20 août, quelques vacanciers se dorent encore la pilule. 12 joueurs sont montés de Merceuil à Dijon, dont les co-entraîneurs, Flo et Antho. Des passionnés, des vrais. Nos hôtes nous... ...pour lire la suite, rejoignez notre communauté d'abonnés et accédez à l'intégralité de nos articles sur le site et l'application mobile à partir de 1 € le 1er mois, sans engagement de durée {'skus': ['lbpswgpremium5']} Google : -50% les 6 premiers mois","pubDate":"2023-08-20 19:06:00","image_url":"https://cdn-s-www.bienpublic.com/images/EC3A2987-19AE-4D7B-9D00-7409D82A2EB9/NW_listB/l-un-des-rares-moments-ou-j-ai-touche-le-ballon-photo-stephane-rak-1692558705.jpg","source_id":"bienpublic","source_priority":2016833,"country":["france"],"category":["sports"],"language":"french"},{"title":"Luka Elsner (Le Havre) inquiet pour Oussama Targhalline","link":"https://www.lequipe.fr/Football/Actualites/Luka-elsner-le-havre-inquiet-pour-oussama-targhalline/1414779#xtor=RSS-1","keywords":["Foot, L1, Le Havre"],"creator":["Sébastien Buron"],"video_url":null,"description":"L'entraîneur du Havre, Luka Elsner, craint « probablement » plusieurs semaines d'indisponibilité pour Oussama Targhalline, forfait de dernière minute pour le match contre Brest, dimanche (1-2) en Ligue 1.","content":"Après la ce dimanche (1-2), Luka Elsner, l'entraîneur du Havre, est revenu sur le . Pressenti titulaire, le Marocain s'est blessé à la hanche à l'échauffement, et son forfait a pu peser sur l'issue de la rencontre. a affirmé le technicien. Surtout, Elsner a fait part de sa grande inquiétude concernant la gravité de la blessure du joueur. , a indiqué le Slovène. (lundi), Elsner craint « » plusieurs semaines d'indisponibilité : Pour le HAC, ce serait un gros coup dur.","pubDate":"2023-08-20 19:02:45","image_url":"https://medias.lequipe.fr/img-photo-jpg/luka-elsner-craint-une-longue-periode-d-indisponibilite-pour-targhalline-b-paquot-l-equipe/1500000001823408/0:0,1998:999-665-335-70/6d0c3.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Crystal Palace vs Arsenal live stream, match preview, team news and kick-off time for this Premier League match","link":"https://www.fourfourtwo.com/features/crystal-palace-vs-arsenal-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match","keywords":null,"creator":null,"video_url":null,"description":"Find a Crystal Palace vs Arsenal live stream for how to watch this Premier League clash in the UK, US, Canada and anywhere in the world","content":"Looking for a Crystal Palace vs Arsenal live stream? We've got you covered. Crystal Palace vs Arsenal is on Sky Sports in the UK. Brit abroad? from anywhere. Arsenal started off their Premier League title challenge with a convincing 2-1 win against Nottingham Forest last weekend, at least for the first 80 minutes that is. Bukayo Saka and Eddie Nketiah were both on target for the Gunners as they got three points under their belt early on, but Thomas Partey started at right-back and Gabriel was dropped from the starting XI, confusing fans. With Jurrien Timber out for an extended period of time, though, Mikel Arteta will need the whole squad at full fitness. They face a Crystal Palace side who are taking positive steps under Roy Hodgson, especially after they beat new boys Sheffield United 1-0 away from home on opening day. The side is strong and balanced, but a lack of goals from the strikers this season could prove a problem for Palace, despite Odsonne Édouard bagging the winner at Bramall Lane. Kick-off is at 8pm BST. Make sure you know wherever you are. Crystal Palace are missing Michael Olise, Will Hughes and Matheus Franca for the visit of Arsenal, with Olise likely going to take the longest to recover. Arsenal will be without new signing Jurrien Timber for a number of months, though the full extent of his knee injury isn't yet known. What is known, though, is that Oleksandr Zinchenko and Folarin Balogun could both be fit enough to make the bench, but Gabriel Jesus will be out until at least September. Crystal Palace: W Arsenal: W David Coote will be the referee for Crystal Palace vs Arsenal. His assistants will be Marc Perry and Wade Smith, with Thomas Bramall the fourth official. Jarred Gillett is the VAR, with Neil Davies the assistant VAR. Crystal Palace vs Arsenal will be played at Selhurst Park in Croydon, London, which has a capacity of 25,486. kick-off is at on in the UK. The game is on in the UK. In the US, kick-off time is The match will be shown on NBC in the US. See below for international broadcast options. If you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit. A Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result. There are plenty of good-value options out there. For the Premier League, currently recommends: • UK: and are the two main players, but also have a slice of the pie in 2023/24. • USA: NBC Sports Group are the Premier League rights holders, with the streaming platform showing all 380 games in the season. A also lets you watch every game. • Canada: The way to watch Premier League football in 2023/24 is , which has exclusive rights to all the action. • Australia: will screen every game of the Premier League season. • New Zealand: are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.","pubDate":"2023-08-20 19:00:53","image_url":"https://cdn.mos.cms.futurecdn.net/hhnfZ6nzQmRwep3q2b7595.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Transferts : l'Inter Milan va faire une nouvelle offre pour Benjamin Pavard (Bayern Munich)","link":"https://www.lequipe.fr/Football/Actualites/Transferts-l-inter-milan-va-faire-une-nouvelle-offre-pour-benjamin-pavard-bayern-munich/1414774#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Loïc Tanzi"],"video_url":null,"description":"Après une première tentative de 25 M€ et 5 M€ de bonus, l'Inter Milan va augmenter son offre pour le défenseur du Bayern Munich Benjamin Pavard.","content":". Le club italien poursuit ses discussions avec le Bayern Munich et prévoit de faire une deuxième offre estimée à 28 M€, accompagnés de 5 M€ de bonus, pour le champion du monde 2018. Le Bayern Munich cherche déjà un remplaçant au Français, et acceptera de le laisser partir à ce moment-là. Ces dernières heures, le club allemand a retenté de faire venir Kyle Walker, sans succès.","pubDate":"2023-08-20 18:49:41","image_url":"https://medias.lequipe.fr/img-photo-jpg/l-inter-milan-pousse-pour-benjamin-pavard-h-feiner-expa-eibner-pressefoto/1500000001823401/0:0,1998:999-665-335-70/a25e2.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"L'AS Rome accrochée d'entrée par la Salernitana en Serie A","link":"https://www.lequipe.fr/Football/Actualites/L-as-rome-accrochee-d-entree-face-a-la-salernitana/1414773#xtor=RSS-1","keywords":["Foot, ITA"],"creator":["Arnaud De La Bruyère"],"video_url":null,"description":"Privée de Dybala, l'AS Rome a fait match nul ce dimanche sur sa pelouse face à la Salernitana (2-2) pour sa reprise en Serie A. Belotti et Candreva ont chacun marqué un doublé.","content":"Sixième du dernier exercice, l'AS Rome a lancé sa saison 2023-2024 en Serie A par un match nul ce dimanche au Stadio Olimpico face à la Salernitana (2-2) lors duquel Andrea Belotti et Antonio Candreva ont chacun scoré à deux reprises. Privé de Dybala et Pellegrini, suspendus pour accumulation de carton jaune en fin de saison dernière, le club de la Louve jouait également sans José Mourinho sur le banc, l'entraîneur portugais étant . L'AS Rome a parfaitement commencé son match en mettant de l'intensité. Andrea Belotti a ouvert son compteur, lui qui n'avait plus marqué depuis le 1er mai 2022 en Championnat, en ne laissant aucune chance à Ochoa de près (17e). L'ancien du Torino s'était vu refuser un premier but pour hors-jeu, inscrit sur un centre lointain de Cristante (7e). 34 Andrea Belotti a mis fin à une série de 34 matches sans inscrire de but en Championnat. La Salernitana est toutefois parvenue à renverser les Romains grâce à un superbe doublé d'Antonio Candreva. Il a d'abord remis son équipe à égalité d'une lourde frappe dans la surface après avoir facilement éliminé Smalling (36e) puis l'a mise devant au score avec un sublime enchaînement contrôle aérien du droit, frappe enroulée du gauche (49e). Andrea Belotti a finalement remis les deux équipes à égalité d'une jolie tête, sur un corner de Leandro Paredes. L'ancien Parisien est rentré en jeu après l'heure de jeu, tout comme Renato Sanches alors qu'Houssem Aouar a joué tout le match. Du côté de la formation dirigée par Paulo Sousa, Benoît Costil est resté sur le banc.","pubDate":"2023-08-20 18:49:14","image_url":"https://medias.lequipe.fr/img-photo-jpg/houssem-aouar-a-joue-son-premier-match-de-serie-a-avec-l-as-rome-italyphotopress-ipp/1500000001823400/0:0,1998:999-665-335-70/7e005.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Mondial féminin: polémique en Espagne après le baiser forcé du président de la fédération sur une joueuse","link":"https://www.h24info.ma/mondial-feminin-polemique-en-espagne-apres-le-baiser-force-du-president-de-la-federation-du-football-sur-une-joueuse/","keywords":["Sport","baiser de force","Espagne","FIFAWWC","finale coupe du monde féminin","Jenni Hermoso","Luis Rubiales"],"creator":["Alae Sdiqi"],"video_url":null,"description":"Durant la cérémonie de remise des médailles au terme de la finale de la Coupe du monde, le président de la Fédération espagnole de…","content":"Durant la cérémonie de remise des médailles au terme de la finale de la Coupe du monde, le président de la Fédération espagnole de football, Luis Rubiales, a embrassé de force l’attaquante Jenni Hermoso sur la bouche tout en soutenant sa tête avec ses deux mains. Un geste considéré comme un » abus sexuel » selon la législation espagnole. La scène a fait le tour du monde. Dans une ambiance d’euphorie totale et de folie déchaînée, l’un des moments les plus viraux s’est produit pendant les célébrations, juste avant de soulever la Coupe, et à quelques pas seulement de la Reine d’Espagne et la Princesse Sofia. Luis Rubiales, patron de la fédération espagnole de football se trouvait sur le podium installé au stade de Sydney, en train de distribuer les médailles. Là, il en profitait pour serrer avec un enthousiasme déchainé chacune des joueuses fraîchement couronnées championnes du monde du football féminin en battant l’Anglettere (1-0). Au passage de l’attaquante Jenni Hermoso, celle-ci serre dans ses bras le surexcité dirigeant sportif espagnol. Après cette chaleureuse accolade, Rubiales s’est enflammé. Il a pris le visage d’Hermoso et lui a posé un baiser de force sur la bouche en plein milieu de la remise des médailles. Un moment capturé par les caméras de la télévision publique espagnole, la TVE. Cette vidéo a rapidement fait le buzz sur les réseaux sociaux et la plupart des commentaires critiquent le comportement du dirigeant du football espagnol après avoir remporté la Coupe du Monde. Selon la radio Cadena Ser, la joueuse elle-même, lors d’un live sur Instagram depuis le vestiaire du Stadium Arena où elle célébrait le sacre avec ses coéquipières, plaisantait sur la démarche en disant « Eh bien, je n’ai pas aimé ça, hein »! Les réseaux sociaux ont réclamé des sanctions exemplaires contre le dirigeant sportif qui traîne déjà plusieurs casseroles à son actif, notamment des accusations d’organisation d’orgies en puisant dans les fonds de la fédération sportive espagnole.","pubDate":"2023-08-20 18:30:05","image_url":null,"source_id":"h24info","source_priority":6052027,"country":["morocco"],"category":["sports"],"language":"french"},{"title":"Réunion ce lundi à la FFF pour nommer Thierry Henry à la tête de l'équipe de France Espoirs","link":"https://www.lequipe.fr/Football/Actualites/Reunion-ce-lundi-a-la-fff-pour-nommer-thierry-henry-a-la-tete-de-l-equipe-de-france-espoirs/1414800#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Rédaction"],"video_url":null,"description":"Le comité exécutif de la Fédération française de football, qui se réunit lundi, devrait choisir l'ancien attaquant de l'équipe de France Thierry Henry comme sélectionneur des Espoirs.","content":"Le jour tant attendu, pour l'équipe de France Espoirs, est enfin arrivé. La FFF devrait valider lundi la nomination de Thierry Henry à la tête des Espoirs, à un an des Jeux Olympiques à Paris. Auditionné le 7 août par le président Philippe Diallo, Marc Keller (en charge des sélections de jeunes) et Hubert Fournier (directeur technique national), l'ex-attaquant d'Arsenal était le , après plusieurs réunions des dirigeants de la Fédération pour affiner leur choix. Au cours des discussions, Henry s'était détaché de la concurrence de Jocelyn Gourvennec, Sabri Lamouchi et Julien Stéphan, qui n'avaient toujours pas de nouvelles de la FFF ces derniers jours. Dans les hautes sphères de l'instance, on assurait encore dimanche que le choix n'était pas totalement arrêté mais la nomination de l'ex-Gunner, cet après-midi, ne fait plus beaucoup de doutes. Le comité exécutif de la Fédération doit en effet se réunir à 16 heures avec un seul sujet à l'ordre du jour : « équipe de France Espoirs ». Mathieu Le Scornet pressenti au poste d'adjoint Actuellement en vacances, Jean-Michel Aulas y participera. L'ex-patron de l'OL est un fan de Thierry Henry et il a pu influer sur le choix de Diallo. Les dernières discussions, ce week-end et probablement encore ce lundi matin, portaient sur des considérations financières et sur la composition du staff, que Keller souhaite très complet. Selon certaines indiscrétions, Mathieu Le Scornet, très apprécié du président du Racing Club de Strasbourg, pourrait être nommé comme adjoint. Sur le plan économique, Henry a concédé de gros efforts, par rapport à ce qu'il gagne dans ses activités médiatiques (CBS, Amazon), mais un terrain d'entente n'était pas encore tout à fait trouvé ce week-end. L'ancien attaquant des Bleus (123 sélections, 51 buts) était d'ailleurs sur le bord de la pelouse du stade Bollaert-Delelis, dimanche soir, en direct sur Prime Video, pour Lens-Rennes. Blazer bleu marine, baskets blanches, tout sourire et comme à son habitude très complice du présentateur Thibault Le Rol, il n'a rien laissé transparaître et n'a fait aucune allusion à son probable futur poste.","pubDate":"2023-08-20 19:56:24","image_url":"https://medias.lequipe.fr/img-photo-jpg/thierry-henry-devrait-etre-nomme-au-poste-de-selectionneur-des-espoirs-b-papon-l-equipe/1500000001823440/0:0,1998:999-665-335-70/349a4.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Le Barça a trouvé la faille contre Cadix","link":"https://www.lequipe.fr/Football/Actualites/Le-barca-a-trouve-la-faille-contre-cadix/1414796#xtor=RSS-1","keywords":["Foot, ESP"],"creator":["Rémi Laxague"],"video_url":null,"description":"Une semaine après avoir été tenus en échec à Getafe (0-0), les Barcelonnais ont battu Cadix (2-0) en fin de match ce dimanche soir, pour la 2e journée de Liga, grâce à des buts de Pedri et Ferran Torres.","content":"Le match : 2-0 Le Barça a repris ses vieilles habitudes. Comme très souvent l'an passé, les Blaugranas se sont imposés ce dimanche soir sans encaisser de but (2-0) et dans les derniers instants du match contre Cadix, lors de la 2e journée de Liga. Pour leur premier match officiel au stade olympique de Montjuïc, où se joueront les rencontres à domicile des Blaugranas pendant les travaux de rénovation du Camp Nou, les Barcelonnais ont buté une bonne partie de la rencontre sur Jeremias Ledesma, le gardien adverse. Très autoritaire, réalisant 8 parades, dont plusieurs majeures (29e, 34e, 46e, 81e), il permettait aux Andalous de rester en vie, quand ce n'était pas la barre transversale qui repoussait la tête de Gavi (54e). Mais en fin de match, les hommes de Xavi ont débloqué leur compteur cette saison sur une superbe passe d'Ilkay Gündogan de l'extérieur du pied qui a trouvé Pedri dans la surface de Cadix, le milieu de terrain concluant de près, au ras du poteau de Ledesma (83e). En toute fin de match, Ferran Tores a ensuite profité d'une grossière erreur de placement défensif pour faire le break (90e+4), cinq minutes après que le but d'Ansu Fati a été refusé pour hors-jeu. Ce succès permet au Barça de se lancer dans cette saison, une semaine après le à Getafe. Cadix, qui avait gagné lors de la première journée, recule au classement (11e) et recevra Almeria la semaine prochaine dans un duel 100 % andalou.","pubDate":"2023-08-20 19:38:02","image_url":"https://medias.lequipe.fr/img-photo-jpg/gavi-et-les-barcelonnais-se-sont-sortis-du-piege-de-cadix-ce-dimanche-soir-b-casas-reuters/1500000001823432/0:0,1998:999-665-335-70/74347.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"NFL: Gehalt und Topverdiener: Das verdienen Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.","link":"https://www.spox.com/de/sport/ussport/nfl/2308/Artikel/gehalt-und-topverdiener-das-verdienen-patrick-mahomes-odell-beckham-jr-aaron-rodgers-und-co.html","keywords":["US-Sport / NFL"],"creator":null,"video_url":null,"description":"Die NFL-Regular-Season steht in den Startlöchern. SPOX wirft daher einen Blick auf die Topverdiener der amerikanischen Profiliga. Was verdienen Stars wie Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.?","content":"Die NFL-Regular-Season steht in den Startlöchern. SPOX wirft daher einen Blick auf die Topverdiener der amerikanischen Profiliga. Was verdienen Stars wie Patrick Mahomes, Odell Beckham Jr., Aaron Rodgers und Co.? Die Football-Saison ist eröffnet, auf den Spielplätzen der 32 NFL-Teams finden in den kommenden Tagen und Wochen noch Preseason-Spiele statt. Am 8. September ist es dann aber endlich so weit und die Regular Season geht mit dem Duell zwischen den Kansas City Chiefs und den Detroit Lions offiziell los. Mit dem Auftaktspiel im Arrowhead Stadium in Kansas City beginnt die 18-wöchige Reise zu den Playoffs, die am 12. Februar 2024 mit Super Bowl LVIII in Paradise, Nevada, ihr Ende finden. Die NFL gehört zu den beliebtesten Profiligen, die es im Sport gibt, und wird von Millionen Fans weltweit begleitet. Daher ist es auch keine Überraschung, dass die Akteure auf dem Feld dementsprechend finanziell belohnt werden. Die NFL ist eine Liga der Quarterbacks. Das ist die Position, auf der Spieler am meisten Einfluss am Ausgang eines Spiels haben. Der QB hat bei fast jedem Spielzug seine Hände im Spiel und kriegt bei Siegen oft das meiste Lob ab, während er auch für Niederlagen die meiste Verantwortung trägt. Daher überrascht es nicht, dass die Topverdiener-Liste der NFL von der Quarterback-Position dominiert wird. Die Top 10 der wertvollsten Verträge lassen sich QBs zuschreiben. An der Spitze dieser Liste liegt Justin Herbert von den Los Angeles Chargers. Der 25-Jährige wurde erst im vergangenen Monat mit einem neuen Fünfjahresvertrag in Höhe von mehr als 262 Millionen US-Dollar ausgestattet. Damit ist er an Lamar Jackson von den Baltimore Ravens vorbeigezogen, der einen Fünfjahresvertrag in Höhe von 260 Millionen US-Dollar unterschrieben hat. Patrick Mahomes, zweifacher Super-Bowl-Champion mit den Kansas City Chiefs, belegt den siebten Platz (450 Millionen US-Dollar für insgesamt zehn Jahre). Der erste Nicht-QB in der Liste der wertvollsten Verträge ist Defensive Lineman Aaron Donald, der für seine Leistungen für die Los Angeles Rams mit 31,7 Millionen US-Dollar pro Jahr belohnt wird. Er reiht sich damit auf Platz 16 ein. Aaron Rodgers kriegt von den New York Jets 37,5 Millionen jährlich. Odell Beckham Jr., Wide Receiver, von den Baltimore Ravens 15 Millionen US-Dollar. Was die Saison 2023 betrifft, darf sich Lamar Jackson über das meiste Geld freuen, sein Gehalt für beträgt satte 80 Millionen US-Dollar. Darauf folgen auf Platz zwei mit einem Riesenabstand Daniel Jones und Deshaun Watson (beide 46 Millionen US-Dollar). Name Team Lamar Jackson Baltimore Ravens Daniel Jones New York Giants $46.000.000 Deshaun Watson Cleveland Browns Patrick Mahomes Kansas City Chiefs Kyler Murray Arizona Cardinals Aaron Rodgers New York Jets Chris Lindstrom Atlanta Falcons Orlando Brown Jr. Cincinnati Bengals Laremy Tunsil Houston Texans Daron Payne Washington Commanders","pubDate":"2023-08-20 19:24:32","image_url":"https://www.spox.com/de/sport/ussport/nfl/2308/Bilder/298/mahomes-1200_298x171.jpg","source_id":"spox","source_priority":673559,"country":["germany"],"category":["sports"],"language":"german"},{"title":"Facile face à Strasbourg, Monaco devient leader de la Ligue 1","link":"https://www.lequipe.fr/Football/Actualites/Facile-face-a-strasbourg-monaco-devient-leader-de-la-ligue-1/1414780#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"Grâce à une victoire probante acquise ce dimanche sur Strasbourg (3-0), Monaco occupe la première place du classement de la Ligue 1 en attendant le match de Rennes à Lens dans la soirée.","content":"Après avoir complètement manqué sa fin de saison dernière, privé sur la fin d'une place européenne, Monaco attaque ce nouvel exercice avec un autre visage, bien plus séduisant. , avec la manière (4-2), l'équipe désormais entraînée par Adi Hütter a enchaîné un deuxième succès ce dimanche face à Strasbourg (3-0). Et l'ASM a encore sorti les grands moyens, en marquant pas moins de trois buts à la défense alsacienne. Cette victoire au Louis-II lui permet même de grimper à la première place de la Ligue 1, en attendant le résultat de Rennes à Lens dans la soirée (coup d'envoi à 20h45). Il serait exagéré de dire que Monaco a dû s'employer dans cette rencontre. Même avec peu d'occasions franches, le club de la Principauté menait facilement de deux buts à la pause, sans avoir réellement dû s'employer contre un adversaire dépassé. Auteur d'un doublé, Takumi Minamino a d'abord chipé le ballon dans les pieds d'Abakar Sylla avant de décocher une magnifique frappe rasante qui a terminé sa trajectoire dans les petits filets de Matz Sels (1-0, 20e). Puis c'est de la tête que le Japonais, servi depuis la gauche par Caio Henrique, a marqué en devançant le malheureux Sylla (2-0, 36e). Et côté strasbourgeois ? Privé de ballons (l'ASM avait 62 % de possession à la pause), le Racing aurait pu égaliser par Lebo Mothiba, trouvé par Delaine, mais la tête du buteur sud-africain a frôlé la barre. Au retour des vestiaires, le scénario n'a pas évolué. Il a juste permis à Monaco de creuser encore l'écart, par Wissam Ben Yedder qui a conclu un contre parfaitement orchestré sur un tir détourné par Abakar Sylla (3-0, 58e). Bien pensif, Patrick Vieira a tenté dans la foulée d'insuffler un peu d'oxygène dans son équipe, avec les entrées d'Angelo et de Dilane Bakwa à la place de Mothiba et Kévin Gameiro, mais ce sont bien les Rouge et Blanc qui ont encore enchaîné les situations favorables. Minamino a frappé à côté (58e) et Eliot Matazo a obligé Sels à une claquette inspirée (73e). L'ASM devra confirmer ses belles dispositions le week-end prochain à Nantes, tandis que Strasbourg, vainqueur de l'OL (2-1) pour ses débuts, tentera de montrer un autre visage contre Toulouse.","pubDate":"2023-08-20 19:06:55","image_url":"https://medias.lequipe.fr/img-photo-jpg/takumi-minamino-auteur-d-un-double-contre-strasbourg-f-porcu-l-equipe/1500000001823410/0:0,1997:998-665-335-70/38416.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Football. J’ai pris 15-1 en Coupe de France","link":"https://www.bienpublic.com/sport/2023/08/20/j-ai-pris-15-1-en-coupe-de-france","keywords":["Sport","Football","Dijon","Dijon-ville","Edition Dijon et son agglomération","Fil Info"],"creator":null,"video_url":null,"description":"La fin du mois d’août marque la fin des vacances, mais aussi le 1er tour de la Coupe de France. Tous les clubs de district débutent leur saison par la plus grande compétition de foot du pays. C’est le cas de l’Olympique de Merceuil, club dont je fais fièrement partie. Une équipe de copains qui a connu un dimanche difficile…","content":"L’un des rares moments où j’ai touché le ballon. Photo Stéphane Rak Dans l'intimité du vestiaire de l'OM. Photo Stéphane Rak L’Olympique de Merceuil. Photo Stéphane Rak Ce n’est donc pas cette année que je verrai le Stade de France. La route vers Saint-Denis a connu un sacré glissement de terrain du côté de la Fontaine d’Ouche (D3). Un peu plus de 14 heures, “l’OM” (D3) arrive fringant au stade malgré quelques excès de la veille. Ces mecs-là en ont vu d’autres. Petit bémol, l’effectif est juste. C’est le 20 août, quelques vacanciers se dorent encore la pilule. 12 joueurs sont montés de Merceuil à Dijon, dont les co-entraîneurs, Flo et Antho. Des passionnés, des vrais. Nos hôtes nous... ...pour lire la suite, rejoignez notre communauté d'abonnés et accédez à l'intégralité de nos articles sur le site et l'application mobile à partir de 1 € le 1er mois, sans engagement de durée {'skus': ['lbpswgpremium5']} Google : -50% les 6 premiers mois","pubDate":"2023-08-20 19:06:00","image_url":"https://cdn-s-www.bienpublic.com/images/EC3A2987-19AE-4D7B-9D00-7409D82A2EB9/NW_listB/l-un-des-rares-moments-ou-j-ai-touche-le-ballon-photo-stephane-rak-1692558705.jpg","source_id":"bienpublic","source_priority":2016833,"country":["france"],"category":["sports"],"language":"french"},{"title":"Luka Elsner (Le Havre) inquiet pour Oussama Targhalline","link":"https://www.lequipe.fr/Football/Actualites/Luka-elsner-le-havre-inquiet-pour-oussama-targhalline/1414779#xtor=RSS-1","keywords":["Foot, L1, Le Havre"],"creator":["Sébastien Buron"],"video_url":null,"description":"L'entraîneur du Havre, Luka Elsner, craint « probablement » plusieurs semaines d'indisponibilité pour Oussama Targhalline, forfait de dernière minute pour le match contre Brest, dimanche (1-2) en Ligue 1.","content":"Après la ce dimanche (1-2), Luka Elsner, l'entraîneur du Havre, est revenu sur le . Pressenti titulaire, le Marocain s'est blessé à la hanche à l'échauffement, et son forfait a pu peser sur l'issue de la rencontre. a affirmé le technicien. Surtout, Elsner a fait part de sa grande inquiétude concernant la gravité de la blessure du joueur. , a indiqué le Slovène. (lundi), Elsner craint « » plusieurs semaines d'indisponibilité : Pour le HAC, ce serait un gros coup dur.","pubDate":"2023-08-20 19:02:45","image_url":"https://medias.lequipe.fr/img-photo-jpg/luka-elsner-craint-une-longue-periode-d-indisponibilite-pour-targhalline-b-paquot-l-equipe/1500000001823408/0:0,1998:999-665-335-70/6d0c3.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Crystal Palace vs Arsenal live stream, match preview, team news and kick-off time for this Premier League match","link":"https://www.fourfourtwo.com/features/crystal-palace-vs-arsenal-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match","keywords":null,"creator":null,"video_url":null,"description":"Find a Crystal Palace vs Arsenal live stream for how to watch this Premier League clash in the UK, US, Canada and anywhere in the world","content":"Looking for a Crystal Palace vs Arsenal live stream? We've got you covered. Crystal Palace vs Arsenal is on Sky Sports in the UK. Brit abroad? from anywhere. Arsenal started off their Premier League title challenge with a convincing 2-1 win against Nottingham Forest last weekend, at least for the first 80 minutes that is. Bukayo Saka and Eddie Nketiah were both on target for the Gunners as they got three points under their belt early on, but Thomas Partey started at right-back and Gabriel was dropped from the starting XI, confusing fans. With Jurrien Timber out for an extended period of time, though, Mikel Arteta will need the whole squad at full fitness. They face a Crystal Palace side who are taking positive steps under Roy Hodgson, especially after they beat new boys Sheffield United 1-0 away from home on opening day. The side is strong and balanced, but a lack of goals from the strikers this season could prove a problem for Palace, despite Odsonne Édouard bagging the winner at Bramall Lane. Kick-off is at 8pm BST. Make sure you know wherever you are. Crystal Palace are missing Michael Olise, Will Hughes and Matheus Franca for the visit of Arsenal, with Olise likely going to take the longest to recover. Arsenal will be without new signing Jurrien Timber for a number of months, though the full extent of his knee injury isn't yet known. What is known, though, is that Oleksandr Zinchenko and Folarin Balogun could both be fit enough to make the bench, but Gabriel Jesus will be out until at least September. Crystal Palace: W Arsenal: W David Coote will be the referee for Crystal Palace vs Arsenal. His assistants will be Marc Perry and Wade Smith, with Thomas Bramall the fourth official. Jarred Gillett is the VAR, with Neil Davies the assistant VAR. Crystal Palace vs Arsenal will be played at Selhurst Park in Croydon, London, which has a capacity of 25,486. kick-off is at on in the UK. The game is on in the UK. In the US, kick-off time is The match will be shown on NBC in the US. See below for international broadcast options. If you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit. A Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result. There are plenty of good-value options out there. For the Premier League, currently recommends: • UK: and are the two main players, but also have a slice of the pie in 2023/24. • USA: NBC Sports Group are the Premier League rights holders, with the streaming platform showing all 380 games in the season. A also lets you watch every game. • Canada: The way to watch Premier League football in 2023/24 is , which has exclusive rights to all the action. • Australia: will screen every game of the Premier League season. • New Zealand: are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.","pubDate":"2023-08-20 19:00:53","image_url":"https://cdn.mos.cms.futurecdn.net/hhnfZ6nzQmRwep3q2b7595.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Transferts : l'Inter Milan va faire une nouvelle offre pour Benjamin Pavard (Bayern Munich)","link":"https://www.lequipe.fr/Football/Actualites/Transferts-l-inter-milan-va-faire-une-nouvelle-offre-pour-benjamin-pavard-bayern-munich/1414774#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Loïc Tanzi"],"video_url":null,"description":"Après une première tentative de 25 M€ et 5 M€ de bonus, l'Inter Milan va augmenter son offre pour le défenseur du Bayern Munich Benjamin Pavard.","content":". Le club italien poursuit ses discussions avec le Bayern Munich et prévoit de faire une deuxième offre estimée à 28 M€, accompagnés de 5 M€ de bonus, pour le champion du monde 2018. Le Bayern Munich cherche déjà un remplaçant au Français, et acceptera de le laisser partir à ce moment-là. Ces dernières heures, le club allemand a retenté de faire venir Kyle Walker, sans succès.","pubDate":"2023-08-20 18:49:41","image_url":"https://medias.lequipe.fr/img-photo-jpg/l-inter-milan-pousse-pour-benjamin-pavard-h-feiner-expa-eibner-pressefoto/1500000001823401/0:0,1998:999-665-335-70/a25e2.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"L'AS Rome accrochée d'entrée par la Salernitana en Serie A","link":"https://www.lequipe.fr/Football/Actualites/L-as-rome-accrochee-d-entree-face-a-la-salernitana/1414773#xtor=RSS-1","keywords":["Foot, ITA"],"creator":["Arnaud De La Bruyère"],"video_url":null,"description":"Privée de Dybala, l'AS Rome a fait match nul ce dimanche sur sa pelouse face à la Salernitana (2-2) pour sa reprise en Serie A. Belotti et Candreva ont chacun marqué un doublé.","content":"Sixième du dernier exercice, l'AS Rome a lancé sa saison 2023-2024 en Serie A par un match nul ce dimanche au Stadio Olimpico face à la Salernitana (2-2) lors duquel Andrea Belotti et Antonio Candreva ont chacun scoré à deux reprises. Privé de Dybala et Pellegrini, suspendus pour accumulation de carton jaune en fin de saison dernière, le club de la Louve jouait également sans José Mourinho sur le banc, l'entraîneur portugais étant . L'AS Rome a parfaitement commencé son match en mettant de l'intensité. Andrea Belotti a ouvert son compteur, lui qui n'avait plus marqué depuis le 1er mai 2022 en Championnat, en ne laissant aucune chance à Ochoa de près (17e). L'ancien du Torino s'était vu refuser un premier but pour hors-jeu, inscrit sur un centre lointain de Cristante (7e). 34 Andrea Belotti a mis fin à une série de 34 matches sans inscrire de but en Championnat. La Salernitana est toutefois parvenue à renverser les Romains grâce à un superbe doublé d'Antonio Candreva. Il a d'abord remis son équipe à égalité d'une lourde frappe dans la surface après avoir facilement éliminé Smalling (36e) puis l'a mise devant au score avec un sublime enchaînement contrôle aérien du droit, frappe enroulée du gauche (49e). Andrea Belotti a finalement remis les deux équipes à égalité d'une jolie tête, sur un corner de Leandro Paredes. L'ancien Parisien est rentré en jeu après l'heure de jeu, tout comme Renato Sanches alors qu'Houssem Aouar a joué tout le match. Du côté de la formation dirigée par Paulo Sousa, Benoît Costil est resté sur le banc.","pubDate":"2023-08-20 18:49:14","image_url":"https://medias.lequipe.fr/img-photo-jpg/houssem-aouar-a-joue-son-premier-match-de-serie-a-avec-l-as-rome-italyphotopress-ipp/1500000001823400/0:0,1998:999-665-335-70/7e005.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Mondial féminin: polémique en Espagne après le baiser forcé du président de la fédération sur une joueuse","link":"https://www.h24info.ma/mondial-feminin-polemique-en-espagne-apres-le-baiser-force-du-president-de-la-federation-du-football-sur-une-joueuse/","keywords":["Sport","baiser de force","Espagne","FIFAWWC","finale coupe du monde féminin","Jenni Hermoso","Luis Rubiales"],"creator":["Alae Sdiqi"],"video_url":null,"description":"Durant la cérémonie de remise des médailles au terme de la finale de la Coupe du monde, le président de la Fédération espagnole de…","content":"Durant la cérémonie de remise des médailles au terme de la finale de la Coupe du monde, le président de la Fédération espagnole de football, Luis Rubiales, a embrassé de force l’attaquante Jenni Hermoso sur la bouche tout en soutenant sa tête avec ses deux mains. Un geste considéré comme un » abus sexuel » selon la législation espagnole. La scène a fait le tour du monde. Dans une ambiance d’euphorie totale et de folie déchaînée, l’un des moments les plus viraux s’est produit pendant les célébrations, juste avant de soulever la Coupe, et à quelques pas seulement de la Reine d’Espagne et la Princesse Sofia. Luis Rubiales, patron de la fédération espagnole de football se trouvait sur le podium installé au stade de Sydney, en train de distribuer les médailles. Là, il en profitait pour serrer avec un enthousiasme déchainé chacune des joueuses fraîchement couronnées championnes du monde du football féminin en battant l’Anglettere (1-0). Au passage de l’attaquante Jenni Hermoso, celle-ci serre dans ses bras le surexcité dirigeant sportif espagnol. Après cette chaleureuse accolade, Rubiales s’est enflammé. Il a pris le visage d’Hermoso et lui a posé un baiser de force sur la bouche en plein milieu de la remise des médailles. Un moment capturé par les caméras de la télévision publique espagnole, la TVE. Cette vidéo a rapidement fait le buzz sur les réseaux sociaux et la plupart des commentaires critiquent le comportement du dirigeant du football espagnol après avoir remporté la Coupe du Monde. Selon la radio Cadena Ser, la joueuse elle-même, lors d’un live sur Instagram depuis le vestiaire du Stadium Arena où elle célébrait le sacre avec ses coéquipières, plaisantait sur la démarche en disant « Eh bien, je n’ai pas aimé ça, hein »! Les réseaux sociaux ont réclamé des sanctions exemplaires contre le dirigeant sportif qui traîne déjà plusieurs casseroles à son actif, notamment des accusations d’organisation d’orgies en puisant dans les fonds de la fédération sportive espagnole.","pubDate":"2023-08-20 18:30:05","image_url":null,"source_id":"h24info","source_priority":6052027,"country":["morocco"],"category":["sports"],"language":"french"}]}