{"newsArray":[{"article_id":"b2102382b3da1b5707a0c27db8f54302","title":"Φαν Ντάικ σε διαιτητή: «Τα έχεις πιεί;»","link":"https://www.gazzetta.gr/football/premier-league/2287650/fan-ntaik-se-diaititi-ta-eheis-piei","keywords":["Ποδόσφαιρο","Premier League","Λίβερπουλ","Βίρτζιλ Φαν Ντάικ","Ανδρέας Σουλάι"],"creator":null,"video_url":null,"description":"Μια απόφαση του Κρις Κάβανα εξόργισε τον Βίρτζιλ Φαν Ντάικ ο οποίος ρώτησε τον Άγγλο εάν τα είχε... πιεί πριν από την έναρξη του αγώνα.","content":"Χωρίς νικητή έληξε το μεγάλο ντέρμπι του «Άνφιλντ» ανάμεσα στη Λίβερπουλ και την Άρσεναλ για την 18η αγωνιστική της Premier League. Σε ένα παιχνίδι με γρήγορο ρυθμό και κλασικές ευκαιρίες, οι δύο ομάδες έμειναν στο 1-1, με τους «κανονιέρηδες» να παραμένουν στην κορυφή και στο +1 από τους «reds» και την Άστον Βίλα. Από την πλευρά τους Λίβερπουλ υπάρχει έντονη δυσαρέσκεια για τη διαιτησία του Κρις Κάβανα και κυρίως για τη φάση του Μάρτιν Όντεγκαρντ, όπου η μπάλα φάνηκε να βρίσκει στο χέρι του εντός της περιοχής του Ράγια. Οι ποδοσφαιριστές του Κλοπ είχαν γενικότερα πολλά παράπονα κατά τη διάρκεια του αγώνα, με τον Βίρτζιλ Φαν Ντάικ να ξεσπά σε μια φάση, λέγοντας μια τρομερή ατάκα προς τον διαιτητή της αναμέτρησης. Πιο συγκεκριμένα, σε ένα φάουλ κοντά στον χώρο της μεσαίας γραμμής, ο Ολλανδός έμεινε έκπληκτος από την απόφαση του Άγγλου διαιτητή και πάνω στην ένταση ρώτησε τον ρέφερι αν τα είχε... πιεί πριν από τον αγώνα.","pubDate":"2023-12-24 06:32:45","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"f0092422fc84118d13035bc0959fd04a","title":"УЕФА примет решение по поводу отстранения «Барселоны» от еврокубков в феврале","link":"https://www.sport-express.ru/football/champions-league/news/uefa-primet-reshenie-po-povodu-otstraneniya-barselony-ot-evrokubkov-v-fevrale-2161141/","keywords":["Футбол - Лига чемпионов"],"creator":null,"video_url":null,"description":"УЕФА примет решением по поводу возможного отстранения «Барселоны» от еврокубков в феврале, сообщает Marca.","content":"УЕФА примет решением по поводу возможного отстранения «Барселоны» от еврокубков в феврале 2024 года, сообщает Marca . Каталонцы вместе с «ПСЖ», «Манчестер Сити» и «Миланом» подозреваются в несоблюдении финансовых правил УЕФА. Ранее издание Welt утверждало, что «блаугранас» могут отстранить на три года от участия в Лиге чемпионов. В июле 2023 года «Барселона» была штрафована УЕФА на 500 тысяч евро за неверное отражение финансовой отчетности. As сообщал, что клуб заработал 71,5 миллиона евро за выступление на групповой стадии ЛЧ в сезоне-2023/24 . Каталонцы вышли в 1/8 финала Лиги чемпионов-2023/24, где их соперником будет «Наполи».","pubDate":"2023-12-24 06:29:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"f662b420f6af4e5e1b96754cda21f989","title":"Steam Winter Sale 2023: Top 5 Christmas Games to Try","link":"https://thesportsrush.com/gaming-news-steam-winter-sale-2023-top-5-christmas-games-try/","keywords":["Gaming","Guides","News","Christmas games","co-op","multiplayer","Steam","steam winter sale 2023"],"creator":["Amlan Roy"],"video_url":null,"description":"Steam Winter Sale 2023 started right before Christmas ptoviding gamers with unmissable deals on several games. If you’re down to spend the holidays with friends and family, there are several couch co-op games to make the time merrier. If you’re on the lookout for this criteria specifically, we have listed five such games to try… The post Steam Winter Sale 2023: Top 5 Christmas Games to Try appeared first on The SportsRush.","content":"Advertisement Advertisement Steam Winter Sale 2023: Top 5 Couch Co-op Games to Play During Christmas Advertisement 5) EA Sports FC 24 – $27.99 4) Street Fighter 6 – $39.59 3) Keep Talking and Nobody Explodes – $4.49 2) Moving Out 2 – $14.99 1) Overcooked 2 – $6.24 Advertisement","pubDate":"2023-12-24 06:25:02","image_url":"https://cdn-wp.thesportsrush.com/2023/12/61391632-chrsitmas-games.jpg","source_id":"thesportsrush","source_priority":4166,"country":["united kingdom","india","united states of america","australia"],"category":["sports"],"language":"english"},{"article_id":"55aa2b85cd493ae40b75dfe83000b309","title":"Las Vegas Bowl: Utah Utes fall to Northwestern Wildcats 14-7","link":"https://www.deseret.com/2023/12/23/24000795/utah-utes-vs-northwestern-wildcats-analysis-las-vegas-bowl-bryson-barnes-brandon-rose","keywords":null,"creator":["Joe Coles"],"video_url":null,"description":null,"content":"At one point this season, the story of a walk-on pig farmer who stuck it out for years and went on to quarterback the college team he grew up cheering for could have been the plot of a movie. But there was be no Hollywood ending to Bryson Barnes’ Utah career. In a 14-7 loss to Northwestern in the Las Vegas Bowl Saturday, Utah’s fifth consecutive bowl loss, the senior quarterback had his worst game of the season. Barnes went 8 for 13 passing for 55 yards and threw two interceptions, finishing with a quarterback rating of 66.3. After a bad first half in which he was 4 for 8 for 10 yards and -21 yards rushing — he was sacked three times — his quarterback rating was 10.5. Barnes underthrew Money Parks in the first quarter on a deep shot for his first interception and overthrew Parks in the second quarter for his second pick. Both interceptions were easy snags for Northwestern cornerback Jaheem Joseph. Barnes, who entered his name into the transfer portal before the bowl game but started Saturday for the Utes, held onto the ball too long at times and didn’t see open receivers in some instances. At no point did it feel like he ever found a groove. “Not a good showing by us today. Congratulations to Northwestern. They played well. Our offense completely stymied. We had 12 possessions — seven times we punt, three times we turn it over, once we don’t get it on fourth down and once we score,” Utah coach Kyle Whittingham said. “Tough to win a football game scoring seven points and losing the turnover margin 3-0.” While Barnes’ performance certainly didn’t help matters, seemingly everything that could go wrong for the Utes on offense did go wrong. That started up front with the offensive line, which was missing two starters — left guard Keaton Bills and right tackle Sataoa Laumea — who opted out of the bowl game to prepare for the NFL draft. Utah allowed five sacks and was never able to consistently to get the run game the holes it needed. “They beat us up up front,” Whittingham said when asked what made it hard to get the offense going. “Yeah, typically we own the line of scrimmage. Tonight, that was not the case. We did not play as well as we typically do up front, and that’s where everything starts, up front, and so we weren’t able to really get much of a push.” Running back Ja’Quinden Jackson, who has played through an ankle injury the whole season, had 55 yards on eight carries but left the game early in the second quarter due to an injury. Jaylon Glover had the ball stripped from him in the third quarter for Utah’s third turnover at the night. Pretty much nothing worked when Utah had the ball. Northwestern recognized Utah’s inability to move the ball through the air and was able to crowd the line of scrimmage and shut down the Utes’ run game. Save for about three drives — two touchdown drives and another at the end of the first half that should have resulted in a field goal but Northwestern kicker Jack Olsen missed the attempt — Utah’s defense kept giving its offense chances. The game was there for the taking for Utah, but the offense failed to execute. In the midst of Barnes’ struggles, did the Utes think about inserting redshirt freshman quarterback Brandon Rose into the game to try and turn the tide offensively? The question arose when Rose was seen throwing at times during timeout breaks in second and third quarters. But there was no intention to insert the redshirt freshman into Saturday’s Las Vegas Bowl. “That was just him warming up. Yeah, he wasn’t instructed to do so or anything like that,” Whittingham said. Prior to the bowl game, Whittingham and offensive coordinator Andy Ludwig said that Rose would be available to play. There was talk in October of Rose being “on the path” for a medical redshirt, but postgame Saturday, Whittingham said the redshirt wasn’t a consideration, rather that Rose wasn’t ready for game action yet. “He just is not ready to do that yet. He’s just not grasped the offense and decision making,” Whittingham said. “He’s still in the learning stage — his learning stage — and he’s got a lot of things going for him. “He’s got a big arm and he moves around pretty good, so it’s not indicative of where he could be at some point in time, but he’s just not ready to be thrust in there right now.” There were also a few plays with Luke Bottari at quarterback. Bottari entered the game near the end of the third quarter after Barnes got hit and lost his helmet, causing him to go to the sideline to get checked out. Bottari had one of the most productive passing plays of the game on Utah’s only touchdown drive, an 18-yard screen pass to Jaylon Glover, but Barnes was inserted back into the game on the very next play. Was there any consideration of leaving Bottari, who helped the Utes beat Colorado, in? Utah Utes quarterback Bryson Barnes (16) reacts in pain after a hit as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah Utes fan takes photos as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes Sidney Mbanasor and other players gets ready as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham talks with a couple of the officials as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes players run onto the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham, walks the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Northwestern Wildcats defensive lineman Jaylen Pate (41) watches warmups as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders pose for photos as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) and other players run onto the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes gather on the field as they and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes offensive lineman Kolinu’u Faaiu (61) and Utah Utes quarterback Bryson Barnes (16) hug as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders talk and laugh as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham walks the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Fans get set as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes tight end Dallen Bentley (88) makes a catch as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) walks off the field after being sacked as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes wide receiver Money Parks (10) reaches out to take the punt as Northwestern Wildcats defensive back Evan Smith (22) defends as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders perform during a timeout as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes wide receiver Money Parks (10) can’t hold onto the ball as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Northwestern Wildcats wide receiver Cam Johnson (14) stretches out as he tries to make a catch with Utah Utes cornerback Zemaiah Vaughn (5) defending as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah players try to block an extra point as they and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) tries to avoid Northwestern Wildcats linebacker Bryce Gallagher (32) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) gets ready for the hit by Northwestern Wildcats linebacker Bryce Gallagher (32) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah fans watch the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Northwestern Wildcats players celebrate their win over Utah in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Ja’Quinden Jackson (3) leaves the field as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News A Utah Utes fan looks up at the scoreboard as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) winds up for a long pass that was intercepted as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes running back Ja’Quinden Jackson (3) looks to stiff arm Northwestern Wildcats defensive back Rod Heard II (24) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cornerback Zemaiah Vaughn (5) brings down Northwestern Wildcats running back Joseph Himon II (20) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders and fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Reggie Russell and Scott Nielson pose for a photo before Utah and Northwestern playing in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes players and fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) scores a touchdown with Northwestern Wildcats defensive back Jaheem Joseph (3) hanging onto his foot as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) celebrates after scoring a touchdown as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes players and coaches sing their fight song after losing the Northwestern in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes wide receiver Emery Simmons (18) shows some emotion after Utah lost to Northwestern in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Cameron Rising (7) watches the game from the sideline as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) is sacked by Northwestern Wildcats defensive lineman Carmine Bastone (90) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans talk as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A cameraman works the game dressed as a reindeer as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans dance as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) has his helmet torn off by Northwestern Wildcats linebacker Xander Mueller (34) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) is hit by Northwestern Wildcats linebacker Xander Mueller (34) Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) gets up after his helmet was torn off by Northwestern Wildcats linebacker Xander Mueller (34) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) tries to pass as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Jaylon Glover (1) celebrates after a run as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes wide receiver Munir McClain (4) falls after being hit as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans cheer after a touchdown as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) is tackled by Northwestern Wildcats defensive back Rod Heard II (24) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) dumps a pass over the line as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Northwestern Wildcats linebacker Kenny Soares Jr. (35) brings down Utah Utes running back Micah Bernard (2) Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham watches the game from the sideline as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah fan watches the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah fan watches the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News “We talked about it, but when Bryson was ready to come back, we just decided that Bryson gave us our best chance to win,” Whittingham said. To Barnes’ credit, he came in and completed an 18-yard pass to Munir McClain, followed that up with a 3-yard keeper and then Micah Bernard scored Utah’s only touchdown of the night, tying the game on an explosive 6-yard run in his first game action since sustaining an off-the-field injury after the season-opening win over Florida. “I just felt everything released off my shoulders and when I got to the sideline it just all came out. The tears was flowing. It just felt good to be able to come back and get a touchdown in my first game back,” Bernard said. Following Bernard’s touchdown, momentum seemed squarely on Utah’s side, especially after Northwestern backup quarterback Ryan Hilinski, who entered the game following a hit on starting quarterback Ben Bryant with 11 minutes left, sailed a pass on fourth-and-7 from Utah’s 33-yard line. When Barnes and the Utes got the ball back with 9:44 left in the game, the lead was theirs for the taking. Glover had a 12-yard run to start the Utes off on the right foot, but then two straight runs went effectively nowhere, setting up a third-and-9. Barnes couldn’t find anyone and tucked it, running for seven yards to set up fourth-and-2. The fourth-and-2 play was a run by Glover that was absolutey stuffed, and Utah turned the ball over on downs at the Northwestern 47-yard-line. After struggling for a lot of the game, Bryant — who was cleared to go back into the contest — put together the Wildcats’ best drive following the turnover on downs. The play of the game — a 34-yard pass thrown off the back of Bryant’s foot to A.J. Henning, who made a spectacular diving grab — set the Wildcats up in the Utah red zone. “I mean, it was a great play. I feel like we were able to limit those explosive plays and the timing of that was real unfortunate,” Utes linebacker Karene Reid said. Bryant found Bryce Kirtz on the next play to score what would be the game-winning touchdown. Utah was down to its last chance and put together a decent drive with heavy doses of the ground game, plus an 18-yard pass from Barnes to Bernard. But on second-and-8, Barnes was sacked, then had an eight-yard completion to Luca Caldarella to set up the game-deciding fourth-and-3. Barnes’ last-chance throw to Money Parks was broken up by Garnett Hollis Jr. No flags were thrown, and that was all she wrote on the 2023 season for Utah. “Today is very forgettable,” Whittingham said. “We got to bury this one and move on. ... No positive came out of this game tonight. At least I can’t see it right now.”","pubDate":"2023-12-24 06:21:17","image_url":null,"source_id":"deseret","source_priority":1778,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f287975f9340204aa6a4931905f34213","title":"OM – Mercato : coup de froid sur trois départs en janvier !","link":"https://www.butfootballclub.fr/om/mercato/om-mercato-coup-de-froid-sur-trois-departs-en-janvier-845618","keywords":null,"creator":null,"video_url":null,"description":"Si certaines rumeurs les donnent partants cet hiver, Vitinha, Ismaïla Sarr et Joaquin Correa sont encore loin de quitter l’OM.","content":"Pablo Longoria évasif sur les postes ciblés et les départs possibles lors de sa conférence de presse bilan de première partie de saison à l’OM, de nombreuses rumeurs circulent au sujet des partants de l’hiver. Samedi, dans les colonnes de L’Equipe, les noms de Vitinha et Ismaïla Sarr ont circulé sur la base de départs en prêt avec option d’achat. L’insider La Minute OM a vite remis les choses au clair, assurant que si départ de l’ancien joueur de Braga il y a, ce ne sera que sur une vente. Pour Sarr, la direction olympienne souhaite aussi attendre la CAN avec le Sénégal pour prendre une décision. La fiche de l'OM sur But! Football Club Pas de retour en Argentine pour Joaquin Correa Par ailleurs, une troisième et surprenante rumeur est née en Argentine avant d’être tué dans l’œuf. Selon la presse locale, Estudiantes – club formateur de Joaquin Correa – souhaiterait obtenir son retour. Le directeur sportif du club de la Plata Marcos Angeleri a répondu à ce bruit de couloirs à El Dia : « Je n’ai rien à dire au sujet de Joaquin. Je n’ai pas été en contact avec lui et il n’a pas été en contrat avec nous. Je ne sais pas comment son nom est sorti ». Pour rendre un retour en Argentine possible, il aurait fallu que l’OM et l’Inter Milan s’entendent pour casser le prêt du joueur. Quasiment impossible dans la mesure où le prêt est assorti d’une option d’achat qui peut être obligatoire sous certaines conditions (qualification en Ligue des Champions)… Pour Vitinha ils veulent une vente pas de prêt et Sarr il ne devrait pas partir. Ils vont attendre de voir son niveau à la CAN et le niveau qu’il aura à son retour. — La Minute OM (@LaMinuteOM_) December 23, 2023 Rejoignez le fil But ! Football Club sur WhatsApp pour ne rien rater des grosses infos sur vos clubs favoris. function getDimensionGA() { var dimension1 = \"142\"; return dimension1; } Voir le fil infos Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Si certaines rumeurs les donnent partants cet hiver, Vitinha, Ismaïla Sarr et Joaquin Correa sont encore loin de quitter l’OM. Le Portugais ne sera pas prêté en janvier. Quant à Sarr et Correa, leur départ tient du fantasme. Rédacteur Alexandre Corboz","pubDate":"2023-12-24 06:20:00","image_url":"https://static.butfootballclub.fr/16/2023/12/photo_article/845618/339652/1200-L-om-mercato-coup-de-froid-sur-trois-dparts-en-janvier.jpg","source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"e2fb32650dc50015679517ded16ac528","title":"Источник: защитник «Спартака» Хлусевич может перейти в «Спортинг»","link":"https://www.sport-express.ru/football/rfpl/news/zaschitnik-spartaka-hlusevich-mozhet-pereyti-v-sporting-2161140/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Защитник «Спартака» Даниил Хлусевич может перейти в «Спортинг» в январе 2024 года, сообщает Rumores Sporting.","content":"Защитник «Спартака» Даниил Хлусевич может перейти в «Спортинг» в январе 2024 года, сообщает Rumores Sporting. По информации издания, футболист входит число кандидатов португальского клуба на покупку в ближайшее трансферное окно. 22-летний Хлусевич играет в «Спартаке» с января 2022 года. Футболист перешел к красно-белым из тульского «Арсенала». В этом сезоне провел 14 матчей, не отметившись результативными действими.","pubDate":"2023-12-24 06:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"ef695e6120919a965f24bbc058a28c7d","title":"Роналду лайкнул эмоциональный пост против создания Суперлиги","link":"https://www.sport-express.ru/football/superliga/news/ronaldu-layknul-emocionalnyy-post-protiv-sozdaniya-superligi-2161137/","keywords":["Футбол - Суперлига"],"creator":null,"video_url":null,"description":"Португальский нападающий саудовского «Аль-Насра» Криштиану Роналду поддержал лайком пост в социальных сетях клуба из третьего дивизиона Черногории «Фанс Юнайтед», который выступил против создания Суперлиги.","content":"Португальский нападающий саудовского «Аль-Насра» Криштиану Роналду поддержал лайком пост в социальных сетях клуба из третьего дивизиона Черногории «Фанс Юнайтед», который выступил против создания Суперлиги. «Пожалуйста, не отнимайте нашу мечту. Не позволяйте Суперлиге появиться. Дайте нам и всем маленьким клубам мечтать», — говорится в сообщении клуба. 21 декабря Европейский суд признал незаконными действия ФИФА и УЕФА по блокировке создания Суперлиги. В апреле 2021 года 12 клубов («Реал», «Ювентус», «Барселона», «Атлетико», «Милан», «Интер», «Манчестер Юнайтед», «Манчестер Сити», «Челси», «Ливерпуль», «Тоттенхэм» и «Арсенал») объявили о создании турнира, однако позднее многие отказались от этой идеи. После угрозы санкций со стороны УЕФА проект был приостановлен. В мае 2021 года Суперлига обвинила УЕФА и ФИФА в нарушении закона о конкуренции.","pubDate":"2023-12-24 06:13:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"4da5c9d2db1970c38b2ce445905a40fd","title":"Sports Ministry suspends WFI after newly elected president Sanjay Singh announces U-15 and U-20 nationals","link":"https://www.hindustantimes.com/sports/others/sports-ministry-suspends-wfi-after-newly-elected-president-sanjay-singh-announces-u-15-and-u-20-nationals-101703397273051.html","keywords":["sports"],"creator":null,"video_url":null,"description":"The Union Sports Ministry suspended the newly elected body of the Wrestling Federation of India (WFI) on Sunday.","content":"The Union Sports Ministry suspended the newly elected body of the Wrestling Federation of India (WFI) after the newly elected president Sanjay Singh confirmed that the U-15 and U-20 nationals will take place in Nandini Nagar, Gonda (UP) before the end of the 2023 season. BJP MP Brij Bhushan Sharan Singh with the newly-elected president of the Wrestling Federation of India (WFI) Sanjay Singh at the former's residence(PTI) \"Such decisions (holding nationals) are to be taken by Executive Committee, before which agendas are required to be placed for consideration. As per Article XI of the WFI constitution under the Heading 'Notices and Quorum for Meetings', minimum notice period for EC meeting is 15 clear days and quorum is of 1/3rd of representatives. Even for Emergency EC meeting, minimum notice period is 7 clear days with quorum requirement of 1/3rd of representatives,\" the ministry said in its press release. Wrap up the year gone by & gear up for 2024 with HT! Click here Further details awaited... Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON Share this article Read this news in brief form Share Via Copy Link ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail","pubDate":"2023-12-24 06:03:11","image_url":"https://www.hindustantimes.com/ht-img/img/2023/12/24/1600x900/PTI12-22-2023-000172A-0_1703397710965_1703397727021.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"499b7388b56de67bf40f8f941af6929f","title":"Steven Ferguson says Ross County did all they could to ensure early postponement of Hibernian fixture","link":"https://www.pressandjournal.co.uk/fp/sport/football/ross-county/6306778/steven-ferguson-says-ross-county-did-all-they-could-to-ensure-early-postponement-of-hibernian-fixture/","keywords":["Ross County","Hibernian FC","Premiership","Ross County FC","SPFL","Steven Ferguson","Victoria Park"],"creator":["Andy Skinner"],"video_url":null,"description":"The match was called off following a 10am inspection on Saturday morning, due to a waterlogged pitch at Victoria Park.","content":"Steven Ferguson says Ross County acted as quickly as possible to ensure an early postponement of Saturday’s match against Hibernian. The Staggies’ final fixture before Christmas fell foul of the weather, after failing a 10am pitch inspection on Saturday morning due to a waterlogged pitch. County had staff at the ground from 7am, at which point they initiated contact with the SPFL as a result of the heavy overnight rain. After match referee Iain Snedden was sent to the ground for a 10am inspection, the pitch was deemed unplayable. Staggies chief executive Ferguson insists the club did all they could to minimise the disruption to travelling supporters. Staggies were on the ground from 7am He said: “With the torrential rain through the night, we phoned the SPFL first thing in the morning and the pitch inspection was set for 10am. “We were here at 7am and we contacted the SPFL first thing. We asked for a pitch inspection first thing in the morning. It was still dark. “If they wanted to come at 7am, they could have. It was the match referee who was sent to do it and he did so at 10am. “That’s what time the authorities said they would get a referee along. “Hibs had travelled up here the day before, so obviously they, like us, wanted every opportunity for the game to go ahead. “Hibs, having travelled up, were kept well aware and were here for the pitch inspection. “The SPFL gave us the time for the pitch inspection. The SPFL need to get in touch with the SFA who run the referees’ side and 10 am was the time we were given. “But we had contacted them first thing in the morning to say there was a doubt about the pitch. “The referee came and did the pitch inspection. “There was very little else we could do.” Correct decision was made to postpone fixture Saturday’s postponement is already the fourth occasion this season in which the Staggies have suffered a call-off on the morning of a game. Derek Adams’ men will now turn their focus to Wednesday’s game against Rangers at Ibrox. Ferguson is in no doubt the correct decision was made however, adding: “Two-thirds of the pitch was okay, but the goalmouths were unplayable. “The pitch was very much unplayable by 10.30am and the rain was forecast to continue for the next six or seven hours. “It was the correct decision. “Listen, we’ve experienced it at and already this season. We know how it works and we follow the same process as everybody else.” Ferguson also confirmed County had been due to have 300 people eating in their hospitality lounges prior to the match, with the meals having been sent to local charities and good causes following the call off. ‘These things happen’ says Hibs boss Montgomery Hibernian’s squad was already in the Highlands, having travelled north on Friday, however manager Nick Montgomery was understanding of the situation. Montgomery said: “We had our breakfast and knew the rain had been pretty heavy through the night. Then we got a notification that the referee was going to go and inspect the pitch at 10am. “To be honest, it already sounded like there was a bit of water in one of the goal mouths, which was an issue. Around 9.30am, we heard about the pitch inspection. “Obviously it’s disappointing because you do the preparation, the travel and the overnight stay. But that’s out of our control. These things happen. As much as we’re disappointed about it, these things happen. “We go back now and train on Sunday, and adapt the session a little bit. But the boys are really disappointed because they were ready for the game. “Playing the game on a heavy pitch, you never know what the outcome would have been. The boys want to play games, they wanted to get it done, but they should be fresh. “We do have a small squad, we still have quite a thin squad. So we prepare as well as we can.”","pubDate":"2023-12-24 06:00:58","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/12/PJ6_9939_54375597-lpr28eol-scaled-e1703342962232-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d8fe7704dcda9c05073c6ea132403ab0","title":"Programme TV foot : à quelle heure et sur quelle chaîne voir les matchs de ce soir (24 décembre 2023) ?","link":"https://www.lequipe.fr/Football/Actualites/Programme-tv-foot-a-quelle-heure-et-sur-quelle-chaine-voir-les-matchs-de-ce-soir-24-decembre-2023/1438763#xtor=RSS-1","keywords":["Foot"],"creator":["Base de données"],"video_url":null,"description":"Retrouvez l'intégralité des retransmissions des matches de football du jour diffusés sur toutes les chaînes du bouquet TNT, Câble et Satellite. Ligue 1, Ligue 2, Premier League, coupes d'Europe... Suivez tous les matches en direct sur votre télévision ou en streaming.","content":"Retrouvez l'intégralité du . - Wolverhampton - Chelsea : à 14 heures en direct sur Canal+ Foot - Adana Demirspor - Antalyaspor : à 14 heures en direct sur beIN Sports 4 - Fenerbahçe - Galatasaray : à 17 heures en direct sur beIN Sports 1","pubDate":"2023-12-24 06:00:18","image_url":"https://medias.lequipe.fr/img-photo-jpg/-/1500000001560313/4:0,2500:1664-665-335-70/47b22.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b2102382b3da1b5707a0c27db8f54302","title":"Φαν Ντάικ σε διαιτητή: «Τα έχεις πιεί;»","link":"https://www.gazzetta.gr/football/premier-league/2287650/fan-ntaik-se-diaititi-ta-eheis-piei","keywords":["Ποδόσφαιρο","Premier League","Λίβερπουλ","Βίρτζιλ Φαν Ντάικ","Ανδρέας Σουλάι"],"creator":null,"video_url":null,"description":"Μια απόφαση του Κρις Κάβανα εξόργισε τον Βίρτζιλ Φαν Ντάικ ο οποίος ρώτησε τον Άγγλο εάν τα είχε... πιεί πριν από την έναρξη του αγώνα.","content":"Χωρίς νικητή έληξε το μεγάλο ντέρμπι του «Άνφιλντ» ανάμεσα στη Λίβερπουλ και την Άρσεναλ για την 18η αγωνιστική της Premier League. Σε ένα παιχνίδι με γρήγορο ρυθμό και κλασικές ευκαιρίες, οι δύο ομάδες έμειναν στο 1-1, με τους «κανονιέρηδες» να παραμένουν στην κορυφή και στο +1 από τους «reds» και την Άστον Βίλα. Από την πλευρά τους Λίβερπουλ υπάρχει έντονη δυσαρέσκεια για τη διαιτησία του Κρις Κάβανα και κυρίως για τη φάση του Μάρτιν Όντεγκαρντ, όπου η μπάλα φάνηκε να βρίσκει στο χέρι του εντός της περιοχής του Ράγια. Οι ποδοσφαιριστές του Κλοπ είχαν γενικότερα πολλά παράπονα κατά τη διάρκεια του αγώνα, με τον Βίρτζιλ Φαν Ντάικ να ξεσπά σε μια φάση, λέγοντας μια τρομερή ατάκα προς τον διαιτητή της αναμέτρησης. Πιο συγκεκριμένα, σε ένα φάουλ κοντά στον χώρο της μεσαίας γραμμής, ο Ολλανδός έμεινε έκπληκτος από την απόφαση του Άγγλου διαιτητή και πάνω στην ένταση ρώτησε τον ρέφερι αν τα είχε... πιεί πριν από τον αγώνα.","pubDate":"2023-12-24 06:32:45","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"f0092422fc84118d13035bc0959fd04a","title":"УЕФА примет решение по поводу отстранения «Барселоны» от еврокубков в феврале","link":"https://www.sport-express.ru/football/champions-league/news/uefa-primet-reshenie-po-povodu-otstraneniya-barselony-ot-evrokubkov-v-fevrale-2161141/","keywords":["Футбол - Лига чемпионов"],"creator":null,"video_url":null,"description":"УЕФА примет решением по поводу возможного отстранения «Барселоны» от еврокубков в феврале, сообщает Marca.","content":"УЕФА примет решением по поводу возможного отстранения «Барселоны» от еврокубков в феврале 2024 года, сообщает Marca . Каталонцы вместе с «ПСЖ», «Манчестер Сити» и «Миланом» подозреваются в несоблюдении финансовых правил УЕФА. Ранее издание Welt утверждало, что «блаугранас» могут отстранить на три года от участия в Лиге чемпионов. В июле 2023 года «Барселона» была штрафована УЕФА на 500 тысяч евро за неверное отражение финансовой отчетности. As сообщал, что клуб заработал 71,5 миллиона евро за выступление на групповой стадии ЛЧ в сезоне-2023/24 . Каталонцы вышли в 1/8 финала Лиги чемпионов-2023/24, где их соперником будет «Наполи».","pubDate":"2023-12-24 06:29:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"f662b420f6af4e5e1b96754cda21f989","title":"Steam Winter Sale 2023: Top 5 Christmas Games to Try","link":"https://thesportsrush.com/gaming-news-steam-winter-sale-2023-top-5-christmas-games-try/","keywords":["Gaming","Guides","News","Christmas games","co-op","multiplayer","Steam","steam winter sale 2023"],"creator":["Amlan Roy"],"video_url":null,"description":"Steam Winter Sale 2023 started right before Christmas ptoviding gamers with unmissable deals on several games. If you’re down to spend the holidays with friends and family, there are several couch co-op games to make the time merrier. If you’re on the lookout for this criteria specifically, we have listed five such games to try… The post Steam Winter Sale 2023: Top 5 Christmas Games to Try appeared first on The SportsRush.","content":"Advertisement Advertisement Steam Winter Sale 2023: Top 5 Couch Co-op Games to Play During Christmas Advertisement 5) EA Sports FC 24 – $27.99 4) Street Fighter 6 – $39.59 3) Keep Talking and Nobody Explodes – $4.49 2) Moving Out 2 – $14.99 1) Overcooked 2 – $6.24 Advertisement","pubDate":"2023-12-24 06:25:02","image_url":"https://cdn-wp.thesportsrush.com/2023/12/61391632-chrsitmas-games.jpg","source_id":"thesportsrush","source_priority":4166,"country":["united kingdom","india","united states of america","australia"],"category":["sports"],"language":"english"},{"article_id":"55aa2b85cd493ae40b75dfe83000b309","title":"Las Vegas Bowl: Utah Utes fall to Northwestern Wildcats 14-7","link":"https://www.deseret.com/2023/12/23/24000795/utah-utes-vs-northwestern-wildcats-analysis-las-vegas-bowl-bryson-barnes-brandon-rose","keywords":null,"creator":["Joe Coles"],"video_url":null,"description":null,"content":"At one point this season, the story of a walk-on pig farmer who stuck it out for years and went on to quarterback the college team he grew up cheering for could have been the plot of a movie. But there was be no Hollywood ending to Bryson Barnes’ Utah career. In a 14-7 loss to Northwestern in the Las Vegas Bowl Saturday, Utah’s fifth consecutive bowl loss, the senior quarterback had his worst game of the season. Barnes went 8 for 13 passing for 55 yards and threw two interceptions, finishing with a quarterback rating of 66.3. After a bad first half in which he was 4 for 8 for 10 yards and -21 yards rushing — he was sacked three times — his quarterback rating was 10.5. Barnes underthrew Money Parks in the first quarter on a deep shot for his first interception and overthrew Parks in the second quarter for his second pick. Both interceptions were easy snags for Northwestern cornerback Jaheem Joseph. Barnes, who entered his name into the transfer portal before the bowl game but started Saturday for the Utes, held onto the ball too long at times and didn’t see open receivers in some instances. At no point did it feel like he ever found a groove. “Not a good showing by us today. Congratulations to Northwestern. They played well. Our offense completely stymied. We had 12 possessions — seven times we punt, three times we turn it over, once we don’t get it on fourth down and once we score,” Utah coach Kyle Whittingham said. “Tough to win a football game scoring seven points and losing the turnover margin 3-0.” While Barnes’ performance certainly didn’t help matters, seemingly everything that could go wrong for the Utes on offense did go wrong. That started up front with the offensive line, which was missing two starters — left guard Keaton Bills and right tackle Sataoa Laumea — who opted out of the bowl game to prepare for the NFL draft. Utah allowed five sacks and was never able to consistently to get the run game the holes it needed. “They beat us up up front,” Whittingham said when asked what made it hard to get the offense going. “Yeah, typically we own the line of scrimmage. Tonight, that was not the case. We did not play as well as we typically do up front, and that’s where everything starts, up front, and so we weren’t able to really get much of a push.” Running back Ja’Quinden Jackson, who has played through an ankle injury the whole season, had 55 yards on eight carries but left the game early in the second quarter due to an injury. Jaylon Glover had the ball stripped from him in the third quarter for Utah’s third turnover at the night. Pretty much nothing worked when Utah had the ball. Northwestern recognized Utah’s inability to move the ball through the air and was able to crowd the line of scrimmage and shut down the Utes’ run game. Save for about three drives — two touchdown drives and another at the end of the first half that should have resulted in a field goal but Northwestern kicker Jack Olsen missed the attempt — Utah’s defense kept giving its offense chances. The game was there for the taking for Utah, but the offense failed to execute. In the midst of Barnes’ struggles, did the Utes think about inserting redshirt freshman quarterback Brandon Rose into the game to try and turn the tide offensively? The question arose when Rose was seen throwing at times during timeout breaks in second and third quarters. But there was no intention to insert the redshirt freshman into Saturday’s Las Vegas Bowl. “That was just him warming up. Yeah, he wasn’t instructed to do so or anything like that,” Whittingham said. Prior to the bowl game, Whittingham and offensive coordinator Andy Ludwig said that Rose would be available to play. There was talk in October of Rose being “on the path” for a medical redshirt, but postgame Saturday, Whittingham said the redshirt wasn’t a consideration, rather that Rose wasn’t ready for game action yet. “He just is not ready to do that yet. He’s just not grasped the offense and decision making,” Whittingham said. “He’s still in the learning stage — his learning stage — and he’s got a lot of things going for him. “He’s got a big arm and he moves around pretty good, so it’s not indicative of where he could be at some point in time, but he’s just not ready to be thrust in there right now.” There were also a few plays with Luke Bottari at quarterback. Bottari entered the game near the end of the third quarter after Barnes got hit and lost his helmet, causing him to go to the sideline to get checked out. Bottari had one of the most productive passing plays of the game on Utah’s only touchdown drive, an 18-yard screen pass to Jaylon Glover, but Barnes was inserted back into the game on the very next play. Was there any consideration of leaving Bottari, who helped the Utes beat Colorado, in? Utah Utes quarterback Bryson Barnes (16) reacts in pain after a hit as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah Utes fan takes photos as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes Sidney Mbanasor and other players gets ready as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham talks with a couple of the officials as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes players run onto the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham, walks the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Northwestern Wildcats defensive lineman Jaylen Pate (41) watches warmups as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders pose for photos as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) and other players run onto the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes gather on the field as they and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes offensive lineman Kolinu’u Faaiu (61) and Utah Utes quarterback Bryson Barnes (16) hug as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders talk and laugh as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham walks the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Fans get set as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes tight end Dallen Bentley (88) makes a catch as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) walks off the field after being sacked as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes wide receiver Money Parks (10) reaches out to take the punt as Northwestern Wildcats defensive back Evan Smith (22) defends as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders perform during a timeout as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes wide receiver Money Parks (10) can’t hold onto the ball as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Northwestern Wildcats wide receiver Cam Johnson (14) stretches out as he tries to make a catch with Utah Utes cornerback Zemaiah Vaughn (5) defending as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah players try to block an extra point as they and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) tries to avoid Northwestern Wildcats linebacker Bryce Gallagher (32) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) gets ready for the hit by Northwestern Wildcats linebacker Bryce Gallagher (32) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah fans watch the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Northwestern Wildcats players celebrate their win over Utah in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Ja’Quinden Jackson (3) leaves the field as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News A Utah Utes fan looks up at the scoreboard as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) winds up for a long pass that was intercepted as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes running back Ja’Quinden Jackson (3) looks to stiff arm Northwestern Wildcats defensive back Rod Heard II (24) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cornerback Zemaiah Vaughn (5) brings down Northwestern Wildcats running back Joseph Himon II (20) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders and fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Reggie Russell and Scott Nielson pose for a photo before Utah and Northwestern playing in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes players and fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) scores a touchdown with Northwestern Wildcats defensive back Jaheem Joseph (3) hanging onto his foot as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) celebrates after scoring a touchdown as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes players and coaches sing their fight song after losing the Northwestern in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes wide receiver Emery Simmons (18) shows some emotion after Utah lost to Northwestern in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Cameron Rising (7) watches the game from the sideline as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) is sacked by Northwestern Wildcats defensive lineman Carmine Bastone (90) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans talk as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A cameraman works the game dressed as a reindeer as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans dance as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) has his helmet torn off by Northwestern Wildcats linebacker Xander Mueller (34) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) is hit by Northwestern Wildcats linebacker Xander Mueller (34) Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) gets up after his helmet was torn off by Northwestern Wildcats linebacker Xander Mueller (34) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) tries to pass as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Jaylon Glover (1) celebrates after a run as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes wide receiver Munir McClain (4) falls after being hit as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans cheer after a touchdown as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) is tackled by Northwestern Wildcats defensive back Rod Heard II (24) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) dumps a pass over the line as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Northwestern Wildcats linebacker Kenny Soares Jr. (35) brings down Utah Utes running back Micah Bernard (2) Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham watches the game from the sideline as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah fan watches the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah fan watches the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News “We talked about it, but when Bryson was ready to come back, we just decided that Bryson gave us our best chance to win,” Whittingham said. To Barnes’ credit, he came in and completed an 18-yard pass to Munir McClain, followed that up with a 3-yard keeper and then Micah Bernard scored Utah’s only touchdown of the night, tying the game on an explosive 6-yard run in his first game action since sustaining an off-the-field injury after the season-opening win over Florida. “I just felt everything released off my shoulders and when I got to the sideline it just all came out. The tears was flowing. It just felt good to be able to come back and get a touchdown in my first game back,” Bernard said. Following Bernard’s touchdown, momentum seemed squarely on Utah’s side, especially after Northwestern backup quarterback Ryan Hilinski, who entered the game following a hit on starting quarterback Ben Bryant with 11 minutes left, sailed a pass on fourth-and-7 from Utah’s 33-yard line. When Barnes and the Utes got the ball back with 9:44 left in the game, the lead was theirs for the taking. Glover had a 12-yard run to start the Utes off on the right foot, but then two straight runs went effectively nowhere, setting up a third-and-9. Barnes couldn’t find anyone and tucked it, running for seven yards to set up fourth-and-2. The fourth-and-2 play was a run by Glover that was absolutey stuffed, and Utah turned the ball over on downs at the Northwestern 47-yard-line. After struggling for a lot of the game, Bryant — who was cleared to go back into the contest — put together the Wildcats’ best drive following the turnover on downs. The play of the game — a 34-yard pass thrown off the back of Bryant’s foot to A.J. Henning, who made a spectacular diving grab — set the Wildcats up in the Utah red zone. “I mean, it was a great play. I feel like we were able to limit those explosive plays and the timing of that was real unfortunate,” Utes linebacker Karene Reid said. Bryant found Bryce Kirtz on the next play to score what would be the game-winning touchdown. Utah was down to its last chance and put together a decent drive with heavy doses of the ground game, plus an 18-yard pass from Barnes to Bernard. But on second-and-8, Barnes was sacked, then had an eight-yard completion to Luca Caldarella to set up the game-deciding fourth-and-3. Barnes’ last-chance throw to Money Parks was broken up by Garnett Hollis Jr. No flags were thrown, and that was all she wrote on the 2023 season for Utah. “Today is very forgettable,” Whittingham said. “We got to bury this one and move on. ... No positive came out of this game tonight. At least I can’t see it right now.”","pubDate":"2023-12-24 06:21:17","image_url":null,"source_id":"deseret","source_priority":1778,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f287975f9340204aa6a4931905f34213","title":"OM – Mercato : coup de froid sur trois départs en janvier !","link":"https://www.butfootballclub.fr/om/mercato/om-mercato-coup-de-froid-sur-trois-departs-en-janvier-845618","keywords":null,"creator":null,"video_url":null,"description":"Si certaines rumeurs les donnent partants cet hiver, Vitinha, Ismaïla Sarr et Joaquin Correa sont encore loin de quitter l’OM.","content":"Pablo Longoria évasif sur les postes ciblés et les départs possibles lors de sa conférence de presse bilan de première partie de saison à l’OM, de nombreuses rumeurs circulent au sujet des partants de l’hiver. Samedi, dans les colonnes de L’Equipe, les noms de Vitinha et Ismaïla Sarr ont circulé sur la base de départs en prêt avec option d’achat. L’insider La Minute OM a vite remis les choses au clair, assurant que si départ de l’ancien joueur de Braga il y a, ce ne sera que sur une vente. Pour Sarr, la direction olympienne souhaite aussi attendre la CAN avec le Sénégal pour prendre une décision. La fiche de l'OM sur But! Football Club Pas de retour en Argentine pour Joaquin Correa Par ailleurs, une troisième et surprenante rumeur est née en Argentine avant d’être tué dans l’œuf. Selon la presse locale, Estudiantes – club formateur de Joaquin Correa – souhaiterait obtenir son retour. Le directeur sportif du club de la Plata Marcos Angeleri a répondu à ce bruit de couloirs à El Dia : « Je n’ai rien à dire au sujet de Joaquin. Je n’ai pas été en contact avec lui et il n’a pas été en contrat avec nous. Je ne sais pas comment son nom est sorti ». Pour rendre un retour en Argentine possible, il aurait fallu que l’OM et l’Inter Milan s’entendent pour casser le prêt du joueur. Quasiment impossible dans la mesure où le prêt est assorti d’une option d’achat qui peut être obligatoire sous certaines conditions (qualification en Ligue des Champions)… Pour Vitinha ils veulent une vente pas de prêt et Sarr il ne devrait pas partir. Ils vont attendre de voir son niveau à la CAN et le niveau qu’il aura à son retour. — La Minute OM (@LaMinuteOM_) December 23, 2023 Rejoignez le fil But ! Football Club sur WhatsApp pour ne rien rater des grosses infos sur vos clubs favoris. function getDimensionGA() { var dimension1 = \"142\"; return dimension1; } Voir le fil infos Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Si certaines rumeurs les donnent partants cet hiver, Vitinha, Ismaïla Sarr et Joaquin Correa sont encore loin de quitter l’OM. Le Portugais ne sera pas prêté en janvier. Quant à Sarr et Correa, leur départ tient du fantasme. Rédacteur Alexandre Corboz","pubDate":"2023-12-24 06:20:00","image_url":"https://static.butfootballclub.fr/16/2023/12/photo_article/845618/339652/1200-L-om-mercato-coup-de-froid-sur-trois-dparts-en-janvier.jpg","source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"e2fb32650dc50015679517ded16ac528","title":"Источник: защитник «Спартака» Хлусевич может перейти в «Спортинг»","link":"https://www.sport-express.ru/football/rfpl/news/zaschitnik-spartaka-hlusevich-mozhet-pereyti-v-sporting-2161140/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Защитник «Спартака» Даниил Хлусевич может перейти в «Спортинг» в январе 2024 года, сообщает Rumores Sporting.","content":"Защитник «Спартака» Даниил Хлусевич может перейти в «Спортинг» в январе 2024 года, сообщает Rumores Sporting. По информации издания, футболист входит число кандидатов португальского клуба на покупку в ближайшее трансферное окно. 22-летний Хлусевич играет в «Спартаке» с января 2022 года. Футболист перешел к красно-белым из тульского «Арсенала». В этом сезоне провел 14 матчей, не отметившись результативными действими.","pubDate":"2023-12-24 06:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"ef695e6120919a965f24bbc058a28c7d","title":"Роналду лайкнул эмоциональный пост против создания Суперлиги","link":"https://www.sport-express.ru/football/superliga/news/ronaldu-layknul-emocionalnyy-post-protiv-sozdaniya-superligi-2161137/","keywords":["Футбол - Суперлига"],"creator":null,"video_url":null,"description":"Португальский нападающий саудовского «Аль-Насра» Криштиану Роналду поддержал лайком пост в социальных сетях клуба из третьего дивизиона Черногории «Фанс Юнайтед», который выступил против создания Суперлиги.","content":"Португальский нападающий саудовского «Аль-Насра» Криштиану Роналду поддержал лайком пост в социальных сетях клуба из третьего дивизиона Черногории «Фанс Юнайтед», который выступил против создания Суперлиги. «Пожалуйста, не отнимайте нашу мечту. Не позволяйте Суперлиге появиться. Дайте нам и всем маленьким клубам мечтать», — говорится в сообщении клуба. 21 декабря Европейский суд признал незаконными действия ФИФА и УЕФА по блокировке создания Суперлиги. В апреле 2021 года 12 клубов («Реал», «Ювентус», «Барселона», «Атлетико», «Милан», «Интер», «Манчестер Юнайтед», «Манчестер Сити», «Челси», «Ливерпуль», «Тоттенхэм» и «Арсенал») объявили о создании турнира, однако позднее многие отказались от этой идеи. После угрозы санкций со стороны УЕФА проект был приостановлен. В мае 2021 года Суперлига обвинила УЕФА и ФИФА в нарушении закона о конкуренции.","pubDate":"2023-12-24 06:13:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"4da5c9d2db1970c38b2ce445905a40fd","title":"Sports Ministry suspends WFI after newly elected president Sanjay Singh announces U-15 and U-20 nationals","link":"https://www.hindustantimes.com/sports/others/sports-ministry-suspends-wfi-after-newly-elected-president-sanjay-singh-announces-u-15-and-u-20-nationals-101703397273051.html","keywords":["sports"],"creator":null,"video_url":null,"description":"The Union Sports Ministry suspended the newly elected body of the Wrestling Federation of India (WFI) on Sunday.","content":"The Union Sports Ministry suspended the newly elected body of the Wrestling Federation of India (WFI) after the newly elected president Sanjay Singh confirmed that the U-15 and U-20 nationals will take place in Nandini Nagar, Gonda (UP) before the end of the 2023 season. BJP MP Brij Bhushan Sharan Singh with the newly-elected president of the Wrestling Federation of India (WFI) Sanjay Singh at the former's residence(PTI) \"Such decisions (holding nationals) are to be taken by Executive Committee, before which agendas are required to be placed for consideration. As per Article XI of the WFI constitution under the Heading 'Notices and Quorum for Meetings', minimum notice period for EC meeting is 15 clear days and quorum is of 1/3rd of representatives. Even for Emergency EC meeting, minimum notice period is 7 clear days with quorum requirement of 1/3rd of representatives,\" the ministry said in its press release. Wrap up the year gone by & gear up for 2024 with HT! Click here Further details awaited... Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON Share this article Read this news in brief form Share Via Copy Link ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail","pubDate":"2023-12-24 06:03:11","image_url":"https://www.hindustantimes.com/ht-img/img/2023/12/24/1600x900/PTI12-22-2023-000172A-0_1703397710965_1703397727021.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"499b7388b56de67bf40f8f941af6929f","title":"Steven Ferguson says Ross County did all they could to ensure early postponement of Hibernian fixture","link":"https://www.pressandjournal.co.uk/fp/sport/football/ross-county/6306778/steven-ferguson-says-ross-county-did-all-they-could-to-ensure-early-postponement-of-hibernian-fixture/","keywords":["Ross County","Hibernian FC","Premiership","Ross County FC","SPFL","Steven Ferguson","Victoria Park"],"creator":["Andy Skinner"],"video_url":null,"description":"The match was called off following a 10am inspection on Saturday morning, due to a waterlogged pitch at Victoria Park.","content":"Steven Ferguson says Ross County acted as quickly as possible to ensure an early postponement of Saturday’s match against Hibernian. The Staggies’ final fixture before Christmas fell foul of the weather, after failing a 10am pitch inspection on Saturday morning due to a waterlogged pitch. County had staff at the ground from 7am, at which point they initiated contact with the SPFL as a result of the heavy overnight rain. After match referee Iain Snedden was sent to the ground for a 10am inspection, the pitch was deemed unplayable. Staggies chief executive Ferguson insists the club did all they could to minimise the disruption to travelling supporters. Staggies were on the ground from 7am He said: “With the torrential rain through the night, we phoned the SPFL first thing in the morning and the pitch inspection was set for 10am. “We were here at 7am and we contacted the SPFL first thing. We asked for a pitch inspection first thing in the morning. It was still dark. “If they wanted to come at 7am, they could have. It was the match referee who was sent to do it and he did so at 10am. “That’s what time the authorities said they would get a referee along. “Hibs had travelled up here the day before, so obviously they, like us, wanted every opportunity for the game to go ahead. “Hibs, having travelled up, were kept well aware and were here for the pitch inspection. “The SPFL gave us the time for the pitch inspection. The SPFL need to get in touch with the SFA who run the referees’ side and 10 am was the time we were given. “But we had contacted them first thing in the morning to say there was a doubt about the pitch. “The referee came and did the pitch inspection. “There was very little else we could do.” Correct decision was made to postpone fixture Saturday’s postponement is already the fourth occasion this season in which the Staggies have suffered a call-off on the morning of a game. Derek Adams’ men will now turn their focus to Wednesday’s game against Rangers at Ibrox. Ferguson is in no doubt the correct decision was made however, adding: “Two-thirds of the pitch was okay, but the goalmouths were unplayable. “The pitch was very much unplayable by 10.30am and the rain was forecast to continue for the next six or seven hours. “It was the correct decision. “Listen, we’ve experienced it at and already this season. We know how it works and we follow the same process as everybody else.” Ferguson also confirmed County had been due to have 300 people eating in their hospitality lounges prior to the match, with the meals having been sent to local charities and good causes following the call off. ‘These things happen’ says Hibs boss Montgomery Hibernian’s squad was already in the Highlands, having travelled north on Friday, however manager Nick Montgomery was understanding of the situation. Montgomery said: “We had our breakfast and knew the rain had been pretty heavy through the night. Then we got a notification that the referee was going to go and inspect the pitch at 10am. “To be honest, it already sounded like there was a bit of water in one of the goal mouths, which was an issue. Around 9.30am, we heard about the pitch inspection. “Obviously it’s disappointing because you do the preparation, the travel and the overnight stay. But that’s out of our control. These things happen. As much as we’re disappointed about it, these things happen. “We go back now and train on Sunday, and adapt the session a little bit. But the boys are really disappointed because they were ready for the game. “Playing the game on a heavy pitch, you never know what the outcome would have been. The boys want to play games, they wanted to get it done, but they should be fresh. “We do have a small squad, we still have quite a thin squad. So we prepare as well as we can.”","pubDate":"2023-12-24 06:00:58","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/12/PJ6_9939_54375597-lpr28eol-scaled-e1703342962232-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d8fe7704dcda9c05073c6ea132403ab0","title":"Programme TV foot : à quelle heure et sur quelle chaîne voir les matchs de ce soir (24 décembre 2023) ?","link":"https://www.lequipe.fr/Football/Actualites/Programme-tv-foot-a-quelle-heure-et-sur-quelle-chaine-voir-les-matchs-de-ce-soir-24-decembre-2023/1438763#xtor=RSS-1","keywords":["Foot"],"creator":["Base de données"],"video_url":null,"description":"Retrouvez l'intégralité des retransmissions des matches de football du jour diffusés sur toutes les chaînes du bouquet TNT, Câble et Satellite. Ligue 1, Ligue 2, Premier League, coupes d'Europe... Suivez tous les matches en direct sur votre télévision ou en streaming.","content":"Retrouvez l'intégralité du . - Wolverhampton - Chelsea : à 14 heures en direct sur Canal+ Foot - Adana Demirspor - Antalyaspor : à 14 heures en direct sur beIN Sports 4 - Fenerbahçe - Galatasaray : à 17 heures en direct sur beIN Sports 1","pubDate":"2023-12-24 06:00:18","image_url":"https://medias.lequipe.fr/img-photo-jpg/-/1500000001560313/4:0,2500:1664-665-335-70/47b22.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b2102382b3da1b5707a0c27db8f54302","title":"Φαν Ντάικ σε διαιτητή: «Τα έχεις πιεί;»","link":"https://www.gazzetta.gr/football/premier-league/2287650/fan-ntaik-se-diaititi-ta-eheis-piei","keywords":["Ποδόσφαιρο","Premier League","Λίβερπουλ","Βίρτζιλ Φαν Ντάικ","Ανδρέας Σουλάι"],"creator":null,"video_url":null,"description":"Μια απόφαση του Κρις Κάβανα εξόργισε τον Βίρτζιλ Φαν Ντάικ ο οποίος ρώτησε τον Άγγλο εάν τα είχε... πιεί πριν από την έναρξη του αγώνα.","content":"Χωρίς νικητή έληξε το μεγάλο ντέρμπι του «Άνφιλντ» ανάμεσα στη Λίβερπουλ και την Άρσεναλ για την 18η αγωνιστική της Premier League. Σε ένα παιχνίδι με γρήγορο ρυθμό και κλασικές ευκαιρίες, οι δύο ομάδες έμειναν στο 1-1, με τους «κανονιέρηδες» να παραμένουν στην κορυφή και στο +1 από τους «reds» και την Άστον Βίλα. Από την πλευρά τους Λίβερπουλ υπάρχει έντονη δυσαρέσκεια για τη διαιτησία του Κρις Κάβανα και κυρίως για τη φάση του Μάρτιν Όντεγκαρντ, όπου η μπάλα φάνηκε να βρίσκει στο χέρι του εντός της περιοχής του Ράγια. Οι ποδοσφαιριστές του Κλοπ είχαν γενικότερα πολλά παράπονα κατά τη διάρκεια του αγώνα, με τον Βίρτζιλ Φαν Ντάικ να ξεσπά σε μια φάση, λέγοντας μια τρομερή ατάκα προς τον διαιτητή της αναμέτρησης. Πιο συγκεκριμένα, σε ένα φάουλ κοντά στον χώρο της μεσαίας γραμμής, ο Ολλανδός έμεινε έκπληκτος από την απόφαση του Άγγλου διαιτητή και πάνω στην ένταση ρώτησε τον ρέφερι αν τα είχε... πιεί πριν από τον αγώνα.","pubDate":"2023-12-24 06:32:45","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"f0092422fc84118d13035bc0959fd04a","title":"УЕФА примет решение по поводу отстранения «Барселоны» от еврокубков в феврале","link":"https://www.sport-express.ru/football/champions-league/news/uefa-primet-reshenie-po-povodu-otstraneniya-barselony-ot-evrokubkov-v-fevrale-2161141/","keywords":["Футбол - Лига чемпионов"],"creator":null,"video_url":null,"description":"УЕФА примет решением по поводу возможного отстранения «Барселоны» от еврокубков в феврале, сообщает Marca.","content":"УЕФА примет решением по поводу возможного отстранения «Барселоны» от еврокубков в феврале 2024 года, сообщает Marca . Каталонцы вместе с «ПСЖ», «Манчестер Сити» и «Миланом» подозреваются в несоблюдении финансовых правил УЕФА. Ранее издание Welt утверждало, что «блаугранас» могут отстранить на три года от участия в Лиге чемпионов. В июле 2023 года «Барселона» была штрафована УЕФА на 500 тысяч евро за неверное отражение финансовой отчетности. As сообщал, что клуб заработал 71,5 миллиона евро за выступление на групповой стадии ЛЧ в сезоне-2023/24 . Каталонцы вышли в 1/8 финала Лиги чемпионов-2023/24, где их соперником будет «Наполи».","pubDate":"2023-12-24 06:29:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"f662b420f6af4e5e1b96754cda21f989","title":"Steam Winter Sale 2023: Top 5 Christmas Games to Try","link":"https://thesportsrush.com/gaming-news-steam-winter-sale-2023-top-5-christmas-games-try/","keywords":["Gaming","Guides","News","Christmas games","co-op","multiplayer","Steam","steam winter sale 2023"],"creator":["Amlan Roy"],"video_url":null,"description":"Steam Winter Sale 2023 started right before Christmas ptoviding gamers with unmissable deals on several games. If you’re down to spend the holidays with friends and family, there are several couch co-op games to make the time merrier. If you’re on the lookout for this criteria specifically, we have listed five such games to try… The post Steam Winter Sale 2023: Top 5 Christmas Games to Try appeared first on The SportsRush.","content":"Advertisement Advertisement Steam Winter Sale 2023: Top 5 Couch Co-op Games to Play During Christmas Advertisement 5) EA Sports FC 24 – $27.99 4) Street Fighter 6 – $39.59 3) Keep Talking and Nobody Explodes – $4.49 2) Moving Out 2 – $14.99 1) Overcooked 2 – $6.24 Advertisement","pubDate":"2023-12-24 06:25:02","image_url":"https://cdn-wp.thesportsrush.com/2023/12/61391632-chrsitmas-games.jpg","source_id":"thesportsrush","source_priority":4166,"country":["united kingdom","india","united states of america","australia"],"category":["sports"],"language":"english"},{"article_id":"55aa2b85cd493ae40b75dfe83000b309","title":"Las Vegas Bowl: Utah Utes fall to Northwestern Wildcats 14-7","link":"https://www.deseret.com/2023/12/23/24000795/utah-utes-vs-northwestern-wildcats-analysis-las-vegas-bowl-bryson-barnes-brandon-rose","keywords":null,"creator":["Joe Coles"],"video_url":null,"description":null,"content":"At one point this season, the story of a walk-on pig farmer who stuck it out for years and went on to quarterback the college team he grew up cheering for could have been the plot of a movie. But there was be no Hollywood ending to Bryson Barnes’ Utah career. In a 14-7 loss to Northwestern in the Las Vegas Bowl Saturday, Utah’s fifth consecutive bowl loss, the senior quarterback had his worst game of the season. Barnes went 8 for 13 passing for 55 yards and threw two interceptions, finishing with a quarterback rating of 66.3. After a bad first half in which he was 4 for 8 for 10 yards and -21 yards rushing — he was sacked three times — his quarterback rating was 10.5. Barnes underthrew Money Parks in the first quarter on a deep shot for his first interception and overthrew Parks in the second quarter for his second pick. Both interceptions were easy snags for Northwestern cornerback Jaheem Joseph. Barnes, who entered his name into the transfer portal before the bowl game but started Saturday for the Utes, held onto the ball too long at times and didn’t see open receivers in some instances. At no point did it feel like he ever found a groove. “Not a good showing by us today. Congratulations to Northwestern. They played well. Our offense completely stymied. We had 12 possessions — seven times we punt, three times we turn it over, once we don’t get it on fourth down and once we score,” Utah coach Kyle Whittingham said. “Tough to win a football game scoring seven points and losing the turnover margin 3-0.” While Barnes’ performance certainly didn’t help matters, seemingly everything that could go wrong for the Utes on offense did go wrong. That started up front with the offensive line, which was missing two starters — left guard Keaton Bills and right tackle Sataoa Laumea — who opted out of the bowl game to prepare for the NFL draft. Utah allowed five sacks and was never able to consistently to get the run game the holes it needed. “They beat us up up front,” Whittingham said when asked what made it hard to get the offense going. “Yeah, typically we own the line of scrimmage. Tonight, that was not the case. We did not play as well as we typically do up front, and that’s where everything starts, up front, and so we weren’t able to really get much of a push.” Running back Ja’Quinden Jackson, who has played through an ankle injury the whole season, had 55 yards on eight carries but left the game early in the second quarter due to an injury. Jaylon Glover had the ball stripped from him in the third quarter for Utah’s third turnover at the night. Pretty much nothing worked when Utah had the ball. Northwestern recognized Utah’s inability to move the ball through the air and was able to crowd the line of scrimmage and shut down the Utes’ run game. Save for about three drives — two touchdown drives and another at the end of the first half that should have resulted in a field goal but Northwestern kicker Jack Olsen missed the attempt — Utah’s defense kept giving its offense chances. The game was there for the taking for Utah, but the offense failed to execute. In the midst of Barnes’ struggles, did the Utes think about inserting redshirt freshman quarterback Brandon Rose into the game to try and turn the tide offensively? The question arose when Rose was seen throwing at times during timeout breaks in second and third quarters. But there was no intention to insert the redshirt freshman into Saturday’s Las Vegas Bowl. “That was just him warming up. Yeah, he wasn’t instructed to do so or anything like that,” Whittingham said. Prior to the bowl game, Whittingham and offensive coordinator Andy Ludwig said that Rose would be available to play. There was talk in October of Rose being “on the path” for a medical redshirt, but postgame Saturday, Whittingham said the redshirt wasn’t a consideration, rather that Rose wasn’t ready for game action yet. “He just is not ready to do that yet. He’s just not grasped the offense and decision making,” Whittingham said. “He’s still in the learning stage — his learning stage — and he’s got a lot of things going for him. “He’s got a big arm and he moves around pretty good, so it’s not indicative of where he could be at some point in time, but he’s just not ready to be thrust in there right now.” There were also a few plays with Luke Bottari at quarterback. Bottari entered the game near the end of the third quarter after Barnes got hit and lost his helmet, causing him to go to the sideline to get checked out. Bottari had one of the most productive passing plays of the game on Utah’s only touchdown drive, an 18-yard screen pass to Jaylon Glover, but Barnes was inserted back into the game on the very next play. Was there any consideration of leaving Bottari, who helped the Utes beat Colorado, in? Utah Utes quarterback Bryson Barnes (16) reacts in pain after a hit as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah Utes fan takes photos as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes Sidney Mbanasor and other players gets ready as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham talks with a couple of the officials as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes players run onto the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham, walks the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Northwestern Wildcats defensive lineman Jaylen Pate (41) watches warmups as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders pose for photos as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) and other players run onto the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes gather on the field as they and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) warms up as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes offensive lineman Kolinu’u Faaiu (61) and Utah Utes quarterback Bryson Barnes (16) hug as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders talk and laugh as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham walks the field as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Fans get set as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes tight end Dallen Bentley (88) makes a catch as Utah and Northwestern prepare to play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) walks off the field after being sacked as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes wide receiver Money Parks (10) reaches out to take the punt as Northwestern Wildcats defensive back Evan Smith (22) defends as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders perform during a timeout as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes wide receiver Money Parks (10) can’t hold onto the ball as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Northwestern Wildcats wide receiver Cam Johnson (14) stretches out as he tries to make a catch with Utah Utes cornerback Zemaiah Vaughn (5) defending as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah players try to block an extra point as they and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) tries to avoid Northwestern Wildcats linebacker Bryce Gallagher (32) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) gets ready for the hit by Northwestern Wildcats linebacker Bryce Gallagher (32) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah fans watch the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Northwestern Wildcats players celebrate their win over Utah in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Ja’Quinden Jackson (3) leaves the field as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News A Utah Utes fan looks up at the scoreboard as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) winds up for a long pass that was intercepted as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes running back Ja’Quinden Jackson (3) looks to stiff arm Northwestern Wildcats defensive back Rod Heard II (24) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cornerback Zemaiah Vaughn (5) brings down Northwestern Wildcats running back Joseph Himon II (20) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes cheerleaders and fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Reggie Russell and Scott Nielson pose for a photo before Utah and Northwestern playing in the SRS Distribution Las Vegas Bowl on Saturday, Dec. 23, 2023. Scott G Winterton, Deseret News Utah Utes players and fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) scores a touchdown with Northwestern Wildcats defensive back Jaheem Joseph (3) hanging onto his foot as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) celebrates after scoring a touchdown as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes players and coaches sing their fight song after losing the Northwestern in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes wide receiver Emery Simmons (18) shows some emotion after Utah lost to Northwestern in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Cameron Rising (7) watches the game from the sideline as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) is sacked by Northwestern Wildcats defensive lineman Carmine Bastone (90) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans talk as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A cameraman works the game dressed as a reindeer as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans dance as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) has his helmet torn off by Northwestern Wildcats linebacker Xander Mueller (34) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) is hit by Northwestern Wildcats linebacker Xander Mueller (34) Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans stand in honor of late players Ty Jordan and Aaron Lowe as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) gets up after his helmet was torn off by Northwestern Wildcats linebacker Xander Mueller (34) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) tries to pass as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Jaylon Glover (1) celebrates after a run as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes wide receiver Munir McClain (4) falls after being hit as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes fans cheer after a touchdown as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes running back Micah Bernard (2) is tackled by Northwestern Wildcats defensive back Rod Heard II (24) as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes quarterback Bryson Barnes (16) dumps a pass over the line as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Northwestern Wildcats linebacker Kenny Soares Jr. (35) brings down Utah Utes running back Micah Bernard (2) Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News Utah Utes head coach Kyle Whittingham watches the game from the sideline as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah fan watches the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News A Utah fan watches the game as Utah and Northwestern play in the SRS Distribution Las Vegas Bowl at Allegiant Stadium on Saturday, Dec. 23, 2023. Northwestern won 14-7. Scott G Winterton, Deseret News “We talked about it, but when Bryson was ready to come back, we just decided that Bryson gave us our best chance to win,” Whittingham said. To Barnes’ credit, he came in and completed an 18-yard pass to Munir McClain, followed that up with a 3-yard keeper and then Micah Bernard scored Utah’s only touchdown of the night, tying the game on an explosive 6-yard run in his first game action since sustaining an off-the-field injury after the season-opening win over Florida. “I just felt everything released off my shoulders and when I got to the sideline it just all came out. The tears was flowing. It just felt good to be able to come back and get a touchdown in my first game back,” Bernard said. Following Bernard’s touchdown, momentum seemed squarely on Utah’s side, especially after Northwestern backup quarterback Ryan Hilinski, who entered the game following a hit on starting quarterback Ben Bryant with 11 minutes left, sailed a pass on fourth-and-7 from Utah’s 33-yard line. When Barnes and the Utes got the ball back with 9:44 left in the game, the lead was theirs for the taking. Glover had a 12-yard run to start the Utes off on the right foot, but then two straight runs went effectively nowhere, setting up a third-and-9. Barnes couldn’t find anyone and tucked it, running for seven yards to set up fourth-and-2. The fourth-and-2 play was a run by Glover that was absolutey stuffed, and Utah turned the ball over on downs at the Northwestern 47-yard-line. After struggling for a lot of the game, Bryant — who was cleared to go back into the contest — put together the Wildcats’ best drive following the turnover on downs. The play of the game — a 34-yard pass thrown off the back of Bryant’s foot to A.J. Henning, who made a spectacular diving grab — set the Wildcats up in the Utah red zone. “I mean, it was a great play. I feel like we were able to limit those explosive plays and the timing of that was real unfortunate,” Utes linebacker Karene Reid said. Bryant found Bryce Kirtz on the next play to score what would be the game-winning touchdown. Utah was down to its last chance and put together a decent drive with heavy doses of the ground game, plus an 18-yard pass from Barnes to Bernard. But on second-and-8, Barnes was sacked, then had an eight-yard completion to Luca Caldarella to set up the game-deciding fourth-and-3. Barnes’ last-chance throw to Money Parks was broken up by Garnett Hollis Jr. No flags were thrown, and that was all she wrote on the 2023 season for Utah. “Today is very forgettable,” Whittingham said. “We got to bury this one and move on. ... No positive came out of this game tonight. At least I can’t see it right now.”","pubDate":"2023-12-24 06:21:17","image_url":null,"source_id":"deseret","source_priority":1778,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f287975f9340204aa6a4931905f34213","title":"OM – Mercato : coup de froid sur trois départs en janvier !","link":"https://www.butfootballclub.fr/om/mercato/om-mercato-coup-de-froid-sur-trois-departs-en-janvier-845618","keywords":null,"creator":null,"video_url":null,"description":"Si certaines rumeurs les donnent partants cet hiver, Vitinha, Ismaïla Sarr et Joaquin Correa sont encore loin de quitter l’OM.","content":"Pablo Longoria évasif sur les postes ciblés et les départs possibles lors de sa conférence de presse bilan de première partie de saison à l’OM, de nombreuses rumeurs circulent au sujet des partants de l’hiver. Samedi, dans les colonnes de L’Equipe, les noms de Vitinha et Ismaïla Sarr ont circulé sur la base de départs en prêt avec option d’achat. L’insider La Minute OM a vite remis les choses au clair, assurant que si départ de l’ancien joueur de Braga il y a, ce ne sera que sur une vente. Pour Sarr, la direction olympienne souhaite aussi attendre la CAN avec le Sénégal pour prendre une décision. La fiche de l'OM sur But! Football Club Pas de retour en Argentine pour Joaquin Correa Par ailleurs, une troisième et surprenante rumeur est née en Argentine avant d’être tué dans l’œuf. Selon la presse locale, Estudiantes – club formateur de Joaquin Correa – souhaiterait obtenir son retour. Le directeur sportif du club de la Plata Marcos Angeleri a répondu à ce bruit de couloirs à El Dia : « Je n’ai rien à dire au sujet de Joaquin. Je n’ai pas été en contact avec lui et il n’a pas été en contrat avec nous. Je ne sais pas comment son nom est sorti ». Pour rendre un retour en Argentine possible, il aurait fallu que l’OM et l’Inter Milan s’entendent pour casser le prêt du joueur. Quasiment impossible dans la mesure où le prêt est assorti d’une option d’achat qui peut être obligatoire sous certaines conditions (qualification en Ligue des Champions)… Pour Vitinha ils veulent une vente pas de prêt et Sarr il ne devrait pas partir. Ils vont attendre de voir son niveau à la CAN et le niveau qu’il aura à son retour. — La Minute OM (@LaMinuteOM_) December 23, 2023 Rejoignez le fil But ! Football Club sur WhatsApp pour ne rien rater des grosses infos sur vos clubs favoris. function getDimensionGA() { var dimension1 = \"142\"; return dimension1; } Voir le fil infos Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Si certaines rumeurs les donnent partants cet hiver, Vitinha, Ismaïla Sarr et Joaquin Correa sont encore loin de quitter l’OM. Le Portugais ne sera pas prêté en janvier. Quant à Sarr et Correa, leur départ tient du fantasme. Rédacteur Alexandre Corboz","pubDate":"2023-12-24 06:20:00","image_url":"https://static.butfootballclub.fr/16/2023/12/photo_article/845618/339652/1200-L-om-mercato-coup-de-froid-sur-trois-dparts-en-janvier.jpg","source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"e2fb32650dc50015679517ded16ac528","title":"Источник: защитник «Спартака» Хлусевич может перейти в «Спортинг»","link":"https://www.sport-express.ru/football/rfpl/news/zaschitnik-spartaka-hlusevich-mozhet-pereyti-v-sporting-2161140/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Защитник «Спартака» Даниил Хлусевич может перейти в «Спортинг» в январе 2024 года, сообщает Rumores Sporting.","content":"Защитник «Спартака» Даниил Хлусевич может перейти в «Спортинг» в январе 2024 года, сообщает Rumores Sporting. По информации издания, футболист входит число кандидатов португальского клуба на покупку в ближайшее трансферное окно. 22-летний Хлусевич играет в «Спартаке» с января 2022 года. Футболист перешел к красно-белым из тульского «Арсенала». В этом сезоне провел 14 матчей, не отметившись результативными действими.","pubDate":"2023-12-24 06:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"ef695e6120919a965f24bbc058a28c7d","title":"Роналду лайкнул эмоциональный пост против создания Суперлиги","link":"https://www.sport-express.ru/football/superliga/news/ronaldu-layknul-emocionalnyy-post-protiv-sozdaniya-superligi-2161137/","keywords":["Футбол - Суперлига"],"creator":null,"video_url":null,"description":"Португальский нападающий саудовского «Аль-Насра» Криштиану Роналду поддержал лайком пост в социальных сетях клуба из третьего дивизиона Черногории «Фанс Юнайтед», который выступил против создания Суперлиги.","content":"Португальский нападающий саудовского «Аль-Насра» Криштиану Роналду поддержал лайком пост в социальных сетях клуба из третьего дивизиона Черногории «Фанс Юнайтед», который выступил против создания Суперлиги. «Пожалуйста, не отнимайте нашу мечту. Не позволяйте Суперлиге появиться. Дайте нам и всем маленьким клубам мечтать», — говорится в сообщении клуба. 21 декабря Европейский суд признал незаконными действия ФИФА и УЕФА по блокировке создания Суперлиги. В апреле 2021 года 12 клубов («Реал», «Ювентус», «Барселона», «Атлетико», «Милан», «Интер», «Манчестер Юнайтед», «Манчестер Сити», «Челси», «Ливерпуль», «Тоттенхэм» и «Арсенал») объявили о создании турнира, однако позднее многие отказались от этой идеи. После угрозы санкций со стороны УЕФА проект был приостановлен. В мае 2021 года Суперлига обвинила УЕФА и ФИФА в нарушении закона о конкуренции.","pubDate":"2023-12-24 06:13:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"4da5c9d2db1970c38b2ce445905a40fd","title":"Sports Ministry suspends WFI after newly elected president Sanjay Singh announces U-15 and U-20 nationals","link":"https://www.hindustantimes.com/sports/others/sports-ministry-suspends-wfi-after-newly-elected-president-sanjay-singh-announces-u-15-and-u-20-nationals-101703397273051.html","keywords":["sports"],"creator":null,"video_url":null,"description":"The Union Sports Ministry suspended the newly elected body of the Wrestling Federation of India (WFI) on Sunday.","content":"The Union Sports Ministry suspended the newly elected body of the Wrestling Federation of India (WFI) after the newly elected president Sanjay Singh confirmed that the U-15 and U-20 nationals will take place in Nandini Nagar, Gonda (UP) before the end of the 2023 season. BJP MP Brij Bhushan Sharan Singh with the newly-elected president of the Wrestling Federation of India (WFI) Sanjay Singh at the former's residence(PTI) \"Such decisions (holding nationals) are to be taken by Executive Committee, before which agendas are required to be placed for consideration. As per Article XI of the WFI constitution under the Heading 'Notices and Quorum for Meetings', minimum notice period for EC meeting is 15 clear days and quorum is of 1/3rd of representatives. Even for Emergency EC meeting, minimum notice period is 7 clear days with quorum requirement of 1/3rd of representatives,\" the ministry said in its press release. Wrap up the year gone by & gear up for 2024 with HT! Click here Further details awaited... Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON Share this article Read this news in brief form Share Via Copy Link ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail","pubDate":"2023-12-24 06:03:11","image_url":"https://www.hindustantimes.com/ht-img/img/2023/12/24/1600x900/PTI12-22-2023-000172A-0_1703397710965_1703397727021.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"499b7388b56de67bf40f8f941af6929f","title":"Steven Ferguson says Ross County did all they could to ensure early postponement of Hibernian fixture","link":"https://www.pressandjournal.co.uk/fp/sport/football/ross-county/6306778/steven-ferguson-says-ross-county-did-all-they-could-to-ensure-early-postponement-of-hibernian-fixture/","keywords":["Ross County","Hibernian FC","Premiership","Ross County FC","SPFL","Steven Ferguson","Victoria Park"],"creator":["Andy Skinner"],"video_url":null,"description":"The match was called off following a 10am inspection on Saturday morning, due to a waterlogged pitch at Victoria Park.","content":"Steven Ferguson says Ross County acted as quickly as possible to ensure an early postponement of Saturday’s match against Hibernian. The Staggies’ final fixture before Christmas fell foul of the weather, after failing a 10am pitch inspection on Saturday morning due to a waterlogged pitch. County had staff at the ground from 7am, at which point they initiated contact with the SPFL as a result of the heavy overnight rain. After match referee Iain Snedden was sent to the ground for a 10am inspection, the pitch was deemed unplayable. Staggies chief executive Ferguson insists the club did all they could to minimise the disruption to travelling supporters. Staggies were on the ground from 7am He said: “With the torrential rain through the night, we phoned the SPFL first thing in the morning and the pitch inspection was set for 10am. “We were here at 7am and we contacted the SPFL first thing. We asked for a pitch inspection first thing in the morning. It was still dark. “If they wanted to come at 7am, they could have. It was the match referee who was sent to do it and he did so at 10am. “That’s what time the authorities said they would get a referee along. “Hibs had travelled up here the day before, so obviously they, like us, wanted every opportunity for the game to go ahead. “Hibs, having travelled up, were kept well aware and were here for the pitch inspection. “The SPFL gave us the time for the pitch inspection. The SPFL need to get in touch with the SFA who run the referees’ side and 10 am was the time we were given. “But we had contacted them first thing in the morning to say there was a doubt about the pitch. “The referee came and did the pitch inspection. “There was very little else we could do.” Correct decision was made to postpone fixture Saturday’s postponement is already the fourth occasion this season in which the Staggies have suffered a call-off on the morning of a game. Derek Adams’ men will now turn their focus to Wednesday’s game against Rangers at Ibrox. Ferguson is in no doubt the correct decision was made however, adding: “Two-thirds of the pitch was okay, but the goalmouths were unplayable. “The pitch was very much unplayable by 10.30am and the rain was forecast to continue for the next six or seven hours. “It was the correct decision. “Listen, we’ve experienced it at and already this season. We know how it works and we follow the same process as everybody else.” Ferguson also confirmed County had been due to have 300 people eating in their hospitality lounges prior to the match, with the meals having been sent to local charities and good causes following the call off. ‘These things happen’ says Hibs boss Montgomery Hibernian’s squad was already in the Highlands, having travelled north on Friday, however manager Nick Montgomery was understanding of the situation. Montgomery said: “We had our breakfast and knew the rain had been pretty heavy through the night. Then we got a notification that the referee was going to go and inspect the pitch at 10am. “To be honest, it already sounded like there was a bit of water in one of the goal mouths, which was an issue. Around 9.30am, we heard about the pitch inspection. “Obviously it’s disappointing because you do the preparation, the travel and the overnight stay. But that’s out of our control. These things happen. As much as we’re disappointed about it, these things happen. “We go back now and train on Sunday, and adapt the session a little bit. But the boys are really disappointed because they were ready for the game. “Playing the game on a heavy pitch, you never know what the outcome would have been. The boys want to play games, they wanted to get it done, but they should be fresh. “We do have a small squad, we still have quite a thin squad. So we prepare as well as we can.”","pubDate":"2023-12-24 06:00:58","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/12/PJ6_9939_54375597-lpr28eol-scaled-e1703342962232-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d8fe7704dcda9c05073c6ea132403ab0","title":"Programme TV foot : à quelle heure et sur quelle chaîne voir les matchs de ce soir (24 décembre 2023) ?","link":"https://www.lequipe.fr/Football/Actualites/Programme-tv-foot-a-quelle-heure-et-sur-quelle-chaine-voir-les-matchs-de-ce-soir-24-decembre-2023/1438763#xtor=RSS-1","keywords":["Foot"],"creator":["Base de données"],"video_url":null,"description":"Retrouvez l'intégralité des retransmissions des matches de football du jour diffusés sur toutes les chaînes du bouquet TNT, Câble et Satellite. Ligue 1, Ligue 2, Premier League, coupes d'Europe... Suivez tous les matches en direct sur votre télévision ou en streaming.","content":"Retrouvez l'intégralité du . - Wolverhampton - Chelsea : à 14 heures en direct sur Canal+ Foot - Adana Demirspor - Antalyaspor : à 14 heures en direct sur beIN Sports 4 - Fenerbahçe - Galatasaray : à 17 heures en direct sur beIN Sports 1","pubDate":"2023-12-24 06:00:18","image_url":"https://medias.lequipe.fr/img-photo-jpg/-/1500000001560313/4:0,2500:1664-665-335-70/47b22.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"}]}