{"newsArray":[{"title":"FC Barcelona vs Manchester United LIVE! Europa League match stream, team news, lineups, TV, prediction today","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-live-stream-europa-league-2023-latest-score-result-watch-tv-team-news-b1060895.html","keywords":["Football","Sport"],"creator":["Matt Verri"],"video_url":null,"description":"Barcelona vs Manchester United - LIVE!","content":"vs - LIVE! A heavyweight clash marks the return of the as Manchester United travel to face Barcelona at the Camp Nou tonight. It’s the first leg of the play-off round clash, between two of the favourites to win the whole competition. Barcelona dropped down to the Europa League after finishing behind Bayern Munich and Inter Milan in their Champions League group, but go into this tie with real confidence. ’s side are eight points clear at the top of La Liga, and have not lost in any competition since October. Marcos Alonso starts for the hosts at centre-back, with Robert Lewandowski leading the line. It’s therefore a huge test for United, though they are in good form themselves. has turned things around at Old Trafford, with the team just five points off the top of the Premier League and they have a Carabao Cup final to come. Luke Shaw partners Raphael Varane in defence, as Aaron Wan-Bissaka returns. Follow all the action with Standard Sport’s LIVE blog below! Alonso starts at centre-back for Barcelona, getting the nod over Christensen. Araujo his partner, with Kounde at right-back and Alba on the opposite flank. De Jong starts against a side that admire him so much, while Lewandowski is the main man as ever up front leading the line. For United, no real surprises. Martinez out so Shaw slots in at centre-back alongside Varane, while Wan-Bissaka is preferred to Dalot. Sancho continues on the right wing, with Garnacho having to settle for a place on the bench. De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst. Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo. : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessi, Pedri, Gavi, Raphinha, Lewandowski. : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon The summer transfer window had an endless stream of reports linking Frenkie de Jong with a move to Manchester United. Ultimately the Dutchman remained at Barcelona rather than joining up with his former Ajax boss Erik ten Hag at Old Trafford. Sure we have more of those rumours to endure at the end of the season, but for now De Jong is very much in the Barcelona corner. Manchester United’s bid to finish top of their Europa League group went down to the final match. They needed to beat Real Sociedad by two goals or more in Spain to top the group, meaning Alejandro Garnacho’s goal in a 1-0 win was not enough. United finished second on goal difference, leaving them in the play-off round with Real Sociedad going straight through to the last-16. Not the European competition that Barcelona wanted to be playing in this year. They finished third in their Champions League group before the World Cup, behind Bayern Munich and Inter Milan. Very much not what Robert Lewandowski and Co were brought in for. Barcelona will be eyeing a very deep run in the Europa League to make up for it. Barcelona are yet to lose at home this season and boast the best defence in Spain. While United have come on leaps and bounds of late, it’s a huge ask to go to Camp Nou and win. It’s all about staying in the tie. .","pubDate":"2023-02-16 15:59:03","image_url":"https://static.standard.co.uk/2023/02/16/15/SEI144345906.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Graham Potter told he’s making same ‘frustrating’ Brighton mistake at Chelsea","link":"https://www.standard.co.uk/sport/football/potter-chelsea-fc-brighton-cundy-b1060903.html","keywords":["Football","Sport"],"creator":["Marc Mayo"],"video_url":null,"description":"Jason Cundy disappointed with lack of finishing touch to Chelsea’s play","content":"’s team are suffering from the same issue as his previous side: nobody can finish their chances. That is according to pundit and former Blues player , who described watching his old club as “frustrating” following Wednesday night’s narrow defeat at . Chelsea created several chances to score but saw in particular waste opportunities before Karim Adeyemi’s second-half winner. “If we play the same [in the second leg] and we don’t score we’re out,” Cundy told . “Simple as that and football will never change. It’s so frustrating to play as well as we did. “I think this is like watching Potter’s Brighton. [The] chances they create, play well and don’t put the ball in the back of the net. Honestly, it’s so frustrating. The frustration of watching Chelsea play tonight. SPONSORED “I don’t care how much money we spend, spend more! We need a striker and you need someone that can put the ball in the back of the net.” Potter led Brighton to ninth in the Premier League last season yet only four teams scored fewer goals, while Chelsea rank 13th in the table this season for goals scored. Despite the defeat, Blues boss Potter insisted he was happy with many aspects of his side’s performance and rued a lack of “luck” and “execution” in front of goal. “Overall, we were pleased with the performance for big parts of the game,” he told reporters. “It is complicated away from home in the Champions League, in a hostile environment against a team that's in a good moment. It was an even first half, we managed the game quite well with good opportunities to counter-attack and we hit the bar. “Then in the second half apart from the one decisive action where we didn't do well enough, we were the dominant, the better team and created some good chances. “We needed a little bit of luck maybe and a little bit of final execution. We deserved a goal but have to keep going. It's half-time. It's a tight tie. We look forward to Stamford Bridge.”","pubDate":"2023-02-16 15:50:02","image_url":"https://static.standard.co.uk/2023/02/16/15/newFile-12.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona vs Manchester United: Prediction, kick off time, TV, live stream, team news, h2h results, odds today","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-prediction-kick-off-time-tv-live-stream-team-news-latest-h2h-results-odds-europa-league-2023-preview-today-b1059992.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Barcelona and Manchester United face off tonight in the first leg of a true heavyweight Europa League clash.","content":"and face off tonight in the first leg of a true heavyweight clash. While this most glamorous of fixtures is taking place within the confines of Europe’s secondary club competition, that does not tell the whole story with excitement levels still high. Both Barca and United look resurgent. ’s side sit atop LaLiga with the safety of an eight-point gap over Real Madrid, while Erik ten Hag has United playing some of their best football in years. A Champions League final just over a decade ago, even a Europa League setting does little to dampen the excitement of a meeting between two of the continent’s in-form sides. SPONSORED Barcelona vs Manchester United is scheduled for a 5.45pm GMT kick-off tonight, February 16, 2023. Camp Nou in Barcelona will host. : The game will be broadcast on BT Sport 2 with coverage starting at 5pm GMT. : The BT Sport app will allow subscribers to access a live steam across mobile devices, laptops, games consoles, tablets and more. Follow all of the action with Injured: Busquets will miss the United game with ankle ligament damage : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessie, Pedri, Gavi, Raphinha, Lewandowski : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo Barcelona are yet to lose at home this season and boast the best defence in Spain. While United have come on leaps and bounds of late, it’s a huge ask to go to Camp Nou and win. It’s all about staying in the tie. . Barcelona wins: 3 Draws: 4 Manchester United wins: 6 Barcelona to win: 3/4 Draw: 29/10 Manchester United to win: 10/3 .","pubDate":"2023-02-16 15:29:16","image_url":"https://static.standard.co.uk/2023/02/16/07/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Manchester United XI vs Barcelona: Confirmed team news, predicted lineup, injury latest for Europa League","link":"https://www.standard.co.uk/sport/football/man-utd-xi-vs-fc-barcelona-confirmed-team-predicted-lineup-news-injury-latest-europa-league-2023-today-b1060618.html","keywords":["Football","Sport"],"creator":["Matt Verri"],"video_url":null,"description":"Latest Manchester United team news ahead of tonight’s clash","content":"and Aaron Wan-Bissaka both return to the starting line-up for a depleted side as they face in the tonight. It’s a blockbuster play-off tie, with two of European football’s heavyweights looking to book their place in the last-16 stage of the competition. headlines a number of absentees for Erik ten Hag, he is suspended after picking up three yellow cards in the group stage. Luke Shaw moves into central defence as a result, allowing Tyrell Malacia to come in at left-back. Marcel Sabitzer is also suspended, having been booked three times for Bayern Munich in the Champions League group stage. , currently suspended domestically, is available for European fixtures and partners Fred in midfield. Aaron Wan-Bissaka is back after illness and he replaces Diogo Dalot at right-back. Antony, Anthony Martial and Scott McTominay all miss out again through injury and have not travelled to Barcelona. On their availability for the Carabao Cup final later this month, Ten Hag said: “It looks good. They are on the way back. They are on the training ground individually. They are making progress. “At the end of the week, maybe Scott can make the team, then next week, maybe Antony.” Wout Weghorst was added to United’s Europa League squad after arriving in January and leads the line at the Camp Nou, with Jadon Sancho, Marcus Rashford and Bruno Fernandes starting behind him. De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst. Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo.","pubDate":"2023-02-16 15:28:32","image_url":"https://static.standard.co.uk/2022/10/07/09/UEFAEUROPALEAGUEMANUTDTENHAGPREDICTEDXI.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona XI vs Manchester United: Confirmed team news, predicted lineup, injury latest for Europa League","link":"https://www.standard.co.uk/sport/football/fc-barcelona-xi-vs-man-utd-confirmed-team-predicted-lineup-news-injury-latest-europa-league-2023-today-b1060423.html","keywords":["Football","Sport"],"creator":["Dom Smith"],"video_url":null,"description":"Latest Barcelona team news ahead of tonight’s Europa League clash","content":"starts for against in the , with Marcos Alonso at centre-back. Manchester United visit the for the first-leg of their Europa League play-off tie in a match-up Barcelona coach has labelled as “spectacular”. Former Leeds forward Raphinha is set to start the match for Barcelona, who have been playing a 4-4-2 diamond formation which morphs into a conventional 4-3-3. Xavi’s side are LaLiga leaders by eight points and have won their last 11 matches in all competitions. Barcelona have not faced United since they met in the Champions League in April 2019, when the Catalan club made it four competitive victories in a row over the Red Devils. SPONSORED Alonso gets the nod at centre-back alongside Araujo, with Andreas Christensen having to settle for a place on the bench. Ousmane Dembele is set to miss both legs of the tie with a thigh injury and Sergio Busquets is out too with an ankle issue. : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessie, Pedri, Gavi, Raphinha, Lewandowski. : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon","pubDate":"2023-02-16 15:28:02","image_url":"https://static.standard.co.uk/2023/02/16/07/newFile-5.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona vs Manchester United live stream: How can I watch Europa League game on TV in UK today?","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-europa-league-how-can-i-watch-live-tv-coverage-stream-today-b1060041.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Barcelona and Manchester United go head-to-head in the first leg of a huge Europa League clash tonight.","content":"and go head-to-head in the first leg of a huge clash tonight. Two of the biggest names in world football, it seems odd to see such an evocative fixture played in Europe’s secondary club competition. Still, while this being played in the Champions League would undoubtedly add another level of sheen to this tie, the fact it is in the Europa League should take little away. Both teams are in brilliant form this season, with Barca clear of Real Madrid at the top of LaLiga and United impressing under Erik ten Hag. SPONSORED It’s going to be quite the meeting between two bonafide European heavyweights. : The game will be broadcast on BT Sport 2 with coverage starting at 5pm GMT for a 5.45pm GMT kick-off. : The BT Sport app will allow subscribers to access a live steam across mobile devices, laptops, games consoles, tablets and more. Follow all of the action with","pubDate":"2023-02-16 15:27:31","image_url":"https://static.standard.co.uk/2023/02/04/17/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Arsenal hurt most by Gabriel Jesus absence with Eddie Nketiah guilty of costly misses","link":"https://www.standard.co.uk/sport/football/arsenal-fc-news-jesus-nketiah-b1060888.html","keywords":["Football","Sport"],"creator":["Simon Collings"],"video_url":null,"description":"The deputising striker has failed to score in four games - coinciding with Arsenal’s worst run of the season","content":"visited the dressing room last night to console his team-mates after this defeat to . Despite being out injured since the World Cup with a knee injury, Jesus has stayed close to the squad and offered support in his role as vice-captain. But how Arteta will have wished he could have had the Brazilian on the pitch last night. This was a chastening night for Arsenal as they surrendered top spot in the Premier League and their woes in front of goal summed it up. Striker Eddie Nketiah missed two glorious headed chances in either half, while at the other end Erling Haaland made no mistake with his one opportunity to secure a 3-1 win for City. Nketiah has performed admirably for Arsenal since being tasked with leading the line after Jesus injured his knee playing for Brazil at the World Cup, but his form has dipped in recent weeks and his four matches without a goal have coincided with Arsenal failing to win a game in that time. The 23-year-old’s all-round game has come on leaps in bounds this season, but his main currency remains goals. When they dry up, it is hard not to feel the absence of Jesus. A returning Jesus feels like the spark Arsenal need to ignite their title bid back into life. The Brazilian is not a great goalscorer, however his ability to link the play and open up defences is vital. Jesus drifts across the forward line and his movement allows others to flourish. Gabriel Martinelli, who enjoys a close relationship with Jesus off the field, is one of those suffering in his absence and he has not scored a goal since New Year’s Eve. Eddie Nketiah missed a number of gilt-edged chances. Arsenal are wary about rushing Jesus back after knee surgery, but he has made good progress this week. The striker has been out back on the grass at the club’s training ground, doing some individual work with the ball, having previously been working indoors, undergoing sessions with fitness coaches to strengthen the muscles around his knee. It is a testament to Jesus that his absence was felt more keenly than Thomas Partey last night, who also missed out through injury. The midfielder felt discomfort in his back yesterday and Arsenal made a very late call to pull him out. Jorginho was handed a first start at his new club and he impressed during the opening 45 minutes when Arsenal dominated possession, but the Italian, like his team-mates, faded in the second half to take a small shine off an otherwise fine performance. Arsenal are wobbling for the first time this season and they cannot let the slide continue.","pubDate":"2023-02-16 15:21:31","image_url":"https://static.standard.co.uk/2023/02/16/15/newFile-9.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Affaire Le Graët : \"il est urgent d'agir\" pour le président du Conseil national d'éthique, qui appelle à une démission","link":"https://www.midilibre.fr/2023/02/16/affaire-le-graet-il-est-urgent-dagir-pour-le-president-du-conseil-national-dethique-qui-appelle-a-une-demission-11003716.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Attendre fin février pour se pencher sur le sort de Noël Le Graët est \"beaucoup trop tardif\" et \"il est urgent d'agir\", affirme jeudi le président du Conseil national de l'éthique (CNE), Patrick Anton, appelant le...","content":"Attendre fin février pour se pencher sur le sort de Noël Le Graët est \"beaucoup trop tardif\" et \"il est urgent d'agir\", affirme jeudi le président du Conseil national de l'éthique (CNE), Patrick Anton, appelant le président de la FFF à démissionner. Le Conseil national de l'éthique \"ne s'est pas encore réuni mais la tendance est de demander sa démission\" puisque le rapport de l'Inspection générale a clairement établi qu'il \"n'avait plus la légitimité pour diriger une fédération sportive\", affirme son président auprès de l'AFP. \"Notre levier à nous, s'il ne démissionne pas, ce sera de le traduire devant une commission de discipline\" afin d'engager une procédure pouvant aller jusqu'à la radiation, indique Patrick Anton , peu enclin à activer ce processus pour celui qui a autrefois été \"un grand dirigeant\". \"Je préférerais nettement la démission à des procédures qui le mettraient dehors. Il sortirait encore plus par la petite porte, et elle est déjà étroite. Ça gâcherait tout ce qu'il a fait pour le football français et on ne parlerait de lui dans quelques mois ou années que par l'aspect négatif\", insiste-t-il. Le président du CNE \"regrette\" que le prochain comité exécutif fédéral, censé statuer sur le sort de Noël Le Graët , ait été fixé au 28 février et pas dans la foulée de la publication du rapport, comme prévu initialement. \"C'est beaucoup trop tardif\", dit-il. \"Autant il était urgent d'attendre avant le dépôt du rapport, autant aujourd'hui il est urgent d'agir. Philippe Diallo n'est plus le président intérimaire, Noël Le Graët est redevenu le président. Or, peu de gens veulent encore de lui à la tête de la Fédération. Surtout, il faut que le football continue à tourner. Or là on est en plein marasme\". \"Démissionner serait une sortie à peu près honorable. On referme la page et on travaille sur l'avenir. Cette crise a démontré qu'il y avait des choses à faire, à modifier, notamment sur la gouvernance\", insiste-t-il.","pubDate":"2023-02-16 15:20:54","image_url":"https://images.midilibre.fr/api/v1/images/view/63ee4883bf8f55404317d920/standard/image.jpg?v=1","source_id":"midilibre","category":["sports"],"country":["france"],"language":"french"},{"title":"Ottavi di Youth League (gara secca): Milan-Ruh Lviv si giocherà il 28 febbraio alle 15 al Puma House of Football","link":"https://www.milannews.it/la-primavera/ottavi-di-youth-league-gara-secca-milan-ruh-lviv-si-giochera-il-28-febbraio-alle-15-al-puma-house-of-football-482988","keywords":["La Primavera"],"creator":null,"video_url":null,"description":"Il sito ufficiale della UEFA ha reso noto il programma degli ottavi di Youth League che si giocheranno tutti in gara secca: la Primavera del Milan di Ignazio Abate sarà impegnata martedì 28 febbraio alle 15 contro gli ucraini del Ruh Lv ...","content":"Il sito ufficiale della UEFA ha reso noto il programma degli ottavi di Youth League che si giocheranno tutti in gara secca: la Primavera del Milan di Ignazio Abate sarà impegnata martedì 28 febbraio alle 15 contro gli ucraini del Ruh Lviv. Il match andrà in scena al PUMA House of Football - Centro Sportivo Vismara di Milano.","pubDate":"2023-02-16 15:10:55","image_url":"https://net-storage.tcccdn.com/storage/milannews.it/img_notizie/thumb3/7b/7bb52c22a1417bd98fcc8ad475bbc0d0-04875-336o529o1026o1219z0c26.jpeg","source_id":"milannews","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Snl24.com | 'Not everyone gets to rub shoulders with legends' - Petersen hails Khune influence","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/not-everyone-gets-to-rub-shoulders-with-legends-petersen-hails-khune-influence-20230216","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs goalkeeper Brandon Petersen has revealed the lessons he’s picked up from fellow goalkeeper and club captain Itumeleng Khune who he describes as a legend.","content":"Petersen has been in goal for Amakhosi’s last three matches and has kept just as many clean sheets during that period. The 28-year-old replaced Itumeleng Khune, who last featured for Amakhosi in a 1-0 loss to Sundowns in January. Although the pair compete for the same position, Petersen has revealed that he’s picked up some lessons from the well-established Amakhosi captain. \"I think the main thing [I learned from Khune] is consistency,\" Petersen told Journalists. \"He’s a legend. He’s been in the game and to play alongside a player like that everyday, it’s a blessing you know. Those are the moments as a footballer you need to cherish. Because not everyone gets to rub shoulders with legends. \"Not only meet them, but to train with them, it’s been good. I’ve learned a lot from him; the way he carries himself, the confidence he has and all his achievements. \"That’s encouragement for us as goalkeepers, you want to achieve those things the things he’s achieved. So it’s good. It’s exciting and it’s always fun. There’s never a dull moment, especially between us goalkeepers.\" | Petersen is likely to keep his place between the posts when Chiefs take on Golden Arrows in Polokwane. Amakhosi are looking to build momentum going into the Soweto Derby at the end of February. You must be to post and read comments. Click here to register:","pubDate":"2023-02-16 14:54:47","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"FC Barcelona vs Manchester United LIVE! Europa League match stream, team news, lineups, TV, prediction today","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-live-stream-europa-league-2023-latest-score-result-watch-tv-team-news-b1060895.html","keywords":["Football","Sport"],"creator":["Matt Verri"],"video_url":null,"description":"Barcelona vs Manchester United - LIVE!","content":"vs - LIVE! A heavyweight clash marks the return of the as Manchester United travel to face Barcelona at the Camp Nou tonight. It’s the first leg of the play-off round clash, between two of the favourites to win the whole competition. Barcelona dropped down to the Europa League after finishing behind Bayern Munich and Inter Milan in their Champions League group, but go into this tie with real confidence. ’s side are eight points clear at the top of La Liga, and have not lost in any competition since October. Marcos Alonso starts for the hosts at centre-back, with Robert Lewandowski leading the line. It’s therefore a huge test for United, though they are in good form themselves. has turned things around at Old Trafford, with the team just five points off the top of the Premier League and they have a Carabao Cup final to come. Luke Shaw partners Raphael Varane in defence, as Aaron Wan-Bissaka returns. Follow all the action with Standard Sport’s LIVE blog below! Alonso starts at centre-back for Barcelona, getting the nod over Christensen. Araujo his partner, with Kounde at right-back and Alba on the opposite flank. De Jong starts against a side that admire him so much, while Lewandowski is the main man as ever up front leading the line. For United, no real surprises. Martinez out so Shaw slots in at centre-back alongside Varane, while Wan-Bissaka is preferred to Dalot. Sancho continues on the right wing, with Garnacho having to settle for a place on the bench. De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst. Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo. : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessi, Pedri, Gavi, Raphinha, Lewandowski. : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon The summer transfer window had an endless stream of reports linking Frenkie de Jong with a move to Manchester United. Ultimately the Dutchman remained at Barcelona rather than joining up with his former Ajax boss Erik ten Hag at Old Trafford. Sure we have more of those rumours to endure at the end of the season, but for now De Jong is very much in the Barcelona corner. Manchester United’s bid to finish top of their Europa League group went down to the final match. They needed to beat Real Sociedad by two goals or more in Spain to top the group, meaning Alejandro Garnacho’s goal in a 1-0 win was not enough. United finished second on goal difference, leaving them in the play-off round with Real Sociedad going straight through to the last-16. Not the European competition that Barcelona wanted to be playing in this year. They finished third in their Champions League group before the World Cup, behind Bayern Munich and Inter Milan. Very much not what Robert Lewandowski and Co were brought in for. Barcelona will be eyeing a very deep run in the Europa League to make up for it. Barcelona are yet to lose at home this season and boast the best defence in Spain. While United have come on leaps and bounds of late, it’s a huge ask to go to Camp Nou and win. It’s all about staying in the tie. .","pubDate":"2023-02-16 15:59:03","image_url":"https://static.standard.co.uk/2023/02/16/15/SEI144345906.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Graham Potter told he’s making same ‘frustrating’ Brighton mistake at Chelsea","link":"https://www.standard.co.uk/sport/football/potter-chelsea-fc-brighton-cundy-b1060903.html","keywords":["Football","Sport"],"creator":["Marc Mayo"],"video_url":null,"description":"Jason Cundy disappointed with lack of finishing touch to Chelsea’s play","content":"’s team are suffering from the same issue as his previous side: nobody can finish their chances. That is according to pundit and former Blues player , who described watching his old club as “frustrating” following Wednesday night’s narrow defeat at . Chelsea created several chances to score but saw in particular waste opportunities before Karim Adeyemi’s second-half winner. “If we play the same [in the second leg] and we don’t score we’re out,” Cundy told . “Simple as that and football will never change. It’s so frustrating to play as well as we did. “I think this is like watching Potter’s Brighton. [The] chances they create, play well and don’t put the ball in the back of the net. Honestly, it’s so frustrating. The frustration of watching Chelsea play tonight. SPONSORED “I don’t care how much money we spend, spend more! We need a striker and you need someone that can put the ball in the back of the net.” Potter led Brighton to ninth in the Premier League last season yet only four teams scored fewer goals, while Chelsea rank 13th in the table this season for goals scored. Despite the defeat, Blues boss Potter insisted he was happy with many aspects of his side’s performance and rued a lack of “luck” and “execution” in front of goal. “Overall, we were pleased with the performance for big parts of the game,” he told reporters. “It is complicated away from home in the Champions League, in a hostile environment against a team that's in a good moment. It was an even first half, we managed the game quite well with good opportunities to counter-attack and we hit the bar. “Then in the second half apart from the one decisive action where we didn't do well enough, we were the dominant, the better team and created some good chances. “We needed a little bit of luck maybe and a little bit of final execution. We deserved a goal but have to keep going. It's half-time. It's a tight tie. We look forward to Stamford Bridge.”","pubDate":"2023-02-16 15:50:02","image_url":"https://static.standard.co.uk/2023/02/16/15/newFile-12.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona vs Manchester United: Prediction, kick off time, TV, live stream, team news, h2h results, odds today","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-prediction-kick-off-time-tv-live-stream-team-news-latest-h2h-results-odds-europa-league-2023-preview-today-b1059992.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Barcelona and Manchester United face off tonight in the first leg of a true heavyweight Europa League clash.","content":"and face off tonight in the first leg of a true heavyweight clash. While this most glamorous of fixtures is taking place within the confines of Europe’s secondary club competition, that does not tell the whole story with excitement levels still high. Both Barca and United look resurgent. ’s side sit atop LaLiga with the safety of an eight-point gap over Real Madrid, while Erik ten Hag has United playing some of their best football in years. A Champions League final just over a decade ago, even a Europa League setting does little to dampen the excitement of a meeting between two of the continent’s in-form sides. SPONSORED Barcelona vs Manchester United is scheduled for a 5.45pm GMT kick-off tonight, February 16, 2023. Camp Nou in Barcelona will host. : The game will be broadcast on BT Sport 2 with coverage starting at 5pm GMT. : The BT Sport app will allow subscribers to access a live steam across mobile devices, laptops, games consoles, tablets and more. Follow all of the action with Injured: Busquets will miss the United game with ankle ligament damage : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessie, Pedri, Gavi, Raphinha, Lewandowski : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo Barcelona are yet to lose at home this season and boast the best defence in Spain. While United have come on leaps and bounds of late, it’s a huge ask to go to Camp Nou and win. It’s all about staying in the tie. . Barcelona wins: 3 Draws: 4 Manchester United wins: 6 Barcelona to win: 3/4 Draw: 29/10 Manchester United to win: 10/3 .","pubDate":"2023-02-16 15:29:16","image_url":"https://static.standard.co.uk/2023/02/16/07/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Manchester United XI vs Barcelona: Confirmed team news, predicted lineup, injury latest for Europa League","link":"https://www.standard.co.uk/sport/football/man-utd-xi-vs-fc-barcelona-confirmed-team-predicted-lineup-news-injury-latest-europa-league-2023-today-b1060618.html","keywords":["Football","Sport"],"creator":["Matt Verri"],"video_url":null,"description":"Latest Manchester United team news ahead of tonight’s clash","content":"and Aaron Wan-Bissaka both return to the starting line-up for a depleted side as they face in the tonight. It’s a blockbuster play-off tie, with two of European football’s heavyweights looking to book their place in the last-16 stage of the competition. headlines a number of absentees for Erik ten Hag, he is suspended after picking up three yellow cards in the group stage. Luke Shaw moves into central defence as a result, allowing Tyrell Malacia to come in at left-back. Marcel Sabitzer is also suspended, having been booked three times for Bayern Munich in the Champions League group stage. , currently suspended domestically, is available for European fixtures and partners Fred in midfield. Aaron Wan-Bissaka is back after illness and he replaces Diogo Dalot at right-back. Antony, Anthony Martial and Scott McTominay all miss out again through injury and have not travelled to Barcelona. On their availability for the Carabao Cup final later this month, Ten Hag said: “It looks good. They are on the way back. They are on the training ground individually. They are making progress. “At the end of the week, maybe Scott can make the team, then next week, maybe Antony.” Wout Weghorst was added to United’s Europa League squad after arriving in January and leads the line at the Camp Nou, with Jadon Sancho, Marcus Rashford and Bruno Fernandes starting behind him. De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst. Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo.","pubDate":"2023-02-16 15:28:32","image_url":"https://static.standard.co.uk/2022/10/07/09/UEFAEUROPALEAGUEMANUTDTENHAGPREDICTEDXI.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona XI vs Manchester United: Confirmed team news, predicted lineup, injury latest for Europa League","link":"https://www.standard.co.uk/sport/football/fc-barcelona-xi-vs-man-utd-confirmed-team-predicted-lineup-news-injury-latest-europa-league-2023-today-b1060423.html","keywords":["Football","Sport"],"creator":["Dom Smith"],"video_url":null,"description":"Latest Barcelona team news ahead of tonight’s Europa League clash","content":"starts for against in the , with Marcos Alonso at centre-back. Manchester United visit the for the first-leg of their Europa League play-off tie in a match-up Barcelona coach has labelled as “spectacular”. Former Leeds forward Raphinha is set to start the match for Barcelona, who have been playing a 4-4-2 diamond formation which morphs into a conventional 4-3-3. Xavi’s side are LaLiga leaders by eight points and have won their last 11 matches in all competitions. Barcelona have not faced United since they met in the Champions League in April 2019, when the Catalan club made it four competitive victories in a row over the Red Devils. SPONSORED Alonso gets the nod at centre-back alongside Araujo, with Andreas Christensen having to settle for a place on the bench. Ousmane Dembele is set to miss both legs of the tie with a thigh injury and Sergio Busquets is out too with an ankle issue. : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessie, Pedri, Gavi, Raphinha, Lewandowski. : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon","pubDate":"2023-02-16 15:28:02","image_url":"https://static.standard.co.uk/2023/02/16/07/newFile-5.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona vs Manchester United live stream: How can I watch Europa League game on TV in UK today?","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-europa-league-how-can-i-watch-live-tv-coverage-stream-today-b1060041.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Barcelona and Manchester United go head-to-head in the first leg of a huge Europa League clash tonight.","content":"and go head-to-head in the first leg of a huge clash tonight. Two of the biggest names in world football, it seems odd to see such an evocative fixture played in Europe’s secondary club competition. Still, while this being played in the Champions League would undoubtedly add another level of sheen to this tie, the fact it is in the Europa League should take little away. Both teams are in brilliant form this season, with Barca clear of Real Madrid at the top of LaLiga and United impressing under Erik ten Hag. SPONSORED It’s going to be quite the meeting between two bonafide European heavyweights. : The game will be broadcast on BT Sport 2 with coverage starting at 5pm GMT for a 5.45pm GMT kick-off. : The BT Sport app will allow subscribers to access a live steam across mobile devices, laptops, games consoles, tablets and more. Follow all of the action with","pubDate":"2023-02-16 15:27:31","image_url":"https://static.standard.co.uk/2023/02/04/17/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Arsenal hurt most by Gabriel Jesus absence with Eddie Nketiah guilty of costly misses","link":"https://www.standard.co.uk/sport/football/arsenal-fc-news-jesus-nketiah-b1060888.html","keywords":["Football","Sport"],"creator":["Simon Collings"],"video_url":null,"description":"The deputising striker has failed to score in four games - coinciding with Arsenal’s worst run of the season","content":"visited the dressing room last night to console his team-mates after this defeat to . Despite being out injured since the World Cup with a knee injury, Jesus has stayed close to the squad and offered support in his role as vice-captain. But how Arteta will have wished he could have had the Brazilian on the pitch last night. This was a chastening night for Arsenal as they surrendered top spot in the Premier League and their woes in front of goal summed it up. Striker Eddie Nketiah missed two glorious headed chances in either half, while at the other end Erling Haaland made no mistake with his one opportunity to secure a 3-1 win for City. Nketiah has performed admirably for Arsenal since being tasked with leading the line after Jesus injured his knee playing for Brazil at the World Cup, but his form has dipped in recent weeks and his four matches without a goal have coincided with Arsenal failing to win a game in that time. The 23-year-old’s all-round game has come on leaps in bounds this season, but his main currency remains goals. When they dry up, it is hard not to feel the absence of Jesus. A returning Jesus feels like the spark Arsenal need to ignite their title bid back into life. The Brazilian is not a great goalscorer, however his ability to link the play and open up defences is vital. Jesus drifts across the forward line and his movement allows others to flourish. Gabriel Martinelli, who enjoys a close relationship with Jesus off the field, is one of those suffering in his absence and he has not scored a goal since New Year’s Eve. Eddie Nketiah missed a number of gilt-edged chances. Arsenal are wary about rushing Jesus back after knee surgery, but he has made good progress this week. The striker has been out back on the grass at the club’s training ground, doing some individual work with the ball, having previously been working indoors, undergoing sessions with fitness coaches to strengthen the muscles around his knee. It is a testament to Jesus that his absence was felt more keenly than Thomas Partey last night, who also missed out through injury. The midfielder felt discomfort in his back yesterday and Arsenal made a very late call to pull him out. Jorginho was handed a first start at his new club and he impressed during the opening 45 minutes when Arsenal dominated possession, but the Italian, like his team-mates, faded in the second half to take a small shine off an otherwise fine performance. Arsenal are wobbling for the first time this season and they cannot let the slide continue.","pubDate":"2023-02-16 15:21:31","image_url":"https://static.standard.co.uk/2023/02/16/15/newFile-9.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Affaire Le Graët : \"il est urgent d'agir\" pour le président du Conseil national d'éthique, qui appelle à une démission","link":"https://www.midilibre.fr/2023/02/16/affaire-le-graet-il-est-urgent-dagir-pour-le-president-du-conseil-national-dethique-qui-appelle-a-une-demission-11003716.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Attendre fin février pour se pencher sur le sort de Noël Le Graët est \"beaucoup trop tardif\" et \"il est urgent d'agir\", affirme jeudi le président du Conseil national de l'éthique (CNE), Patrick Anton, appelant le...","content":"Attendre fin février pour se pencher sur le sort de Noël Le Graët est \"beaucoup trop tardif\" et \"il est urgent d'agir\", affirme jeudi le président du Conseil national de l'éthique (CNE), Patrick Anton, appelant le président de la FFF à démissionner. Le Conseil national de l'éthique \"ne s'est pas encore réuni mais la tendance est de demander sa démission\" puisque le rapport de l'Inspection générale a clairement établi qu'il \"n'avait plus la légitimité pour diriger une fédération sportive\", affirme son président auprès de l'AFP. \"Notre levier à nous, s'il ne démissionne pas, ce sera de le traduire devant une commission de discipline\" afin d'engager une procédure pouvant aller jusqu'à la radiation, indique Patrick Anton , peu enclin à activer ce processus pour celui qui a autrefois été \"un grand dirigeant\". \"Je préférerais nettement la démission à des procédures qui le mettraient dehors. Il sortirait encore plus par la petite porte, et elle est déjà étroite. Ça gâcherait tout ce qu'il a fait pour le football français et on ne parlerait de lui dans quelques mois ou années que par l'aspect négatif\", insiste-t-il. Le président du CNE \"regrette\" que le prochain comité exécutif fédéral, censé statuer sur le sort de Noël Le Graët , ait été fixé au 28 février et pas dans la foulée de la publication du rapport, comme prévu initialement. \"C'est beaucoup trop tardif\", dit-il. \"Autant il était urgent d'attendre avant le dépôt du rapport, autant aujourd'hui il est urgent d'agir. Philippe Diallo n'est plus le président intérimaire, Noël Le Graët est redevenu le président. Or, peu de gens veulent encore de lui à la tête de la Fédération. Surtout, il faut que le football continue à tourner. Or là on est en plein marasme\". \"Démissionner serait une sortie à peu près honorable. On referme la page et on travaille sur l'avenir. Cette crise a démontré qu'il y avait des choses à faire, à modifier, notamment sur la gouvernance\", insiste-t-il.","pubDate":"2023-02-16 15:20:54","image_url":"https://images.midilibre.fr/api/v1/images/view/63ee4883bf8f55404317d920/standard/image.jpg?v=1","source_id":"midilibre","category":["sports"],"country":["france"],"language":"french"},{"title":"Ottavi di Youth League (gara secca): Milan-Ruh Lviv si giocherà il 28 febbraio alle 15 al Puma House of Football","link":"https://www.milannews.it/la-primavera/ottavi-di-youth-league-gara-secca-milan-ruh-lviv-si-giochera-il-28-febbraio-alle-15-al-puma-house-of-football-482988","keywords":["La Primavera"],"creator":null,"video_url":null,"description":"Il sito ufficiale della UEFA ha reso noto il programma degli ottavi di Youth League che si giocheranno tutti in gara secca: la Primavera del Milan di Ignazio Abate sarà impegnata martedì 28 febbraio alle 15 contro gli ucraini del Ruh Lv ...","content":"Il sito ufficiale della UEFA ha reso noto il programma degli ottavi di Youth League che si giocheranno tutti in gara secca: la Primavera del Milan di Ignazio Abate sarà impegnata martedì 28 febbraio alle 15 contro gli ucraini del Ruh Lviv. Il match andrà in scena al PUMA House of Football - Centro Sportivo Vismara di Milano.","pubDate":"2023-02-16 15:10:55","image_url":"https://net-storage.tcccdn.com/storage/milannews.it/img_notizie/thumb3/7b/7bb52c22a1417bd98fcc8ad475bbc0d0-04875-336o529o1026o1219z0c26.jpeg","source_id":"milannews","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Snl24.com | 'Not everyone gets to rub shoulders with legends' - Petersen hails Khune influence","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/not-everyone-gets-to-rub-shoulders-with-legends-petersen-hails-khune-influence-20230216","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs goalkeeper Brandon Petersen has revealed the lessons he’s picked up from fellow goalkeeper and club captain Itumeleng Khune who he describes as a legend.","content":"Petersen has been in goal for Amakhosi’s last three matches and has kept just as many clean sheets during that period. The 28-year-old replaced Itumeleng Khune, who last featured for Amakhosi in a 1-0 loss to Sundowns in January. Although the pair compete for the same position, Petersen has revealed that he’s picked up some lessons from the well-established Amakhosi captain. \"I think the main thing [I learned from Khune] is consistency,\" Petersen told Journalists. \"He’s a legend. He’s been in the game and to play alongside a player like that everyday, it’s a blessing you know. Those are the moments as a footballer you need to cherish. Because not everyone gets to rub shoulders with legends. \"Not only meet them, but to train with them, it’s been good. I’ve learned a lot from him; the way he carries himself, the confidence he has and all his achievements. \"That’s encouragement for us as goalkeepers, you want to achieve those things the things he’s achieved. So it’s good. It’s exciting and it’s always fun. There’s never a dull moment, especially between us goalkeepers.\" | Petersen is likely to keep his place between the posts when Chiefs take on Golden Arrows in Polokwane. Amakhosi are looking to build momentum going into the Soweto Derby at the end of February. You must be to post and read comments. Click here to register:","pubDate":"2023-02-16 14:54:47","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"FC Barcelona vs Manchester United LIVE! Europa League match stream, team news, lineups, TV, prediction today","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-live-stream-europa-league-2023-latest-score-result-watch-tv-team-news-b1060895.html","keywords":["Football","Sport"],"creator":["Matt Verri"],"video_url":null,"description":"Barcelona vs Manchester United - LIVE!","content":"vs - LIVE! A heavyweight clash marks the return of the as Manchester United travel to face Barcelona at the Camp Nou tonight. It’s the first leg of the play-off round clash, between two of the favourites to win the whole competition. Barcelona dropped down to the Europa League after finishing behind Bayern Munich and Inter Milan in their Champions League group, but go into this tie with real confidence. ’s side are eight points clear at the top of La Liga, and have not lost in any competition since October. Marcos Alonso starts for the hosts at centre-back, with Robert Lewandowski leading the line. It’s therefore a huge test for United, though they are in good form themselves. has turned things around at Old Trafford, with the team just five points off the top of the Premier League and they have a Carabao Cup final to come. Luke Shaw partners Raphael Varane in defence, as Aaron Wan-Bissaka returns. Follow all the action with Standard Sport’s LIVE blog below! Alonso starts at centre-back for Barcelona, getting the nod over Christensen. Araujo his partner, with Kounde at right-back and Alba on the opposite flank. De Jong starts against a side that admire him so much, while Lewandowski is the main man as ever up front leading the line. For United, no real surprises. Martinez out so Shaw slots in at centre-back alongside Varane, while Wan-Bissaka is preferred to Dalot. Sancho continues on the right wing, with Garnacho having to settle for a place on the bench. De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst. Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo. : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessi, Pedri, Gavi, Raphinha, Lewandowski. : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon The summer transfer window had an endless stream of reports linking Frenkie de Jong with a move to Manchester United. Ultimately the Dutchman remained at Barcelona rather than joining up with his former Ajax boss Erik ten Hag at Old Trafford. Sure we have more of those rumours to endure at the end of the season, but for now De Jong is very much in the Barcelona corner. Manchester United’s bid to finish top of their Europa League group went down to the final match. They needed to beat Real Sociedad by two goals or more in Spain to top the group, meaning Alejandro Garnacho’s goal in a 1-0 win was not enough. United finished second on goal difference, leaving them in the play-off round with Real Sociedad going straight through to the last-16. Not the European competition that Barcelona wanted to be playing in this year. They finished third in their Champions League group before the World Cup, behind Bayern Munich and Inter Milan. Very much not what Robert Lewandowski and Co were brought in for. Barcelona will be eyeing a very deep run in the Europa League to make up for it. Barcelona are yet to lose at home this season and boast the best defence in Spain. While United have come on leaps and bounds of late, it’s a huge ask to go to Camp Nou and win. It’s all about staying in the tie. .","pubDate":"2023-02-16 15:59:03","image_url":"https://static.standard.co.uk/2023/02/16/15/SEI144345906.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Graham Potter told he’s making same ‘frustrating’ Brighton mistake at Chelsea","link":"https://www.standard.co.uk/sport/football/potter-chelsea-fc-brighton-cundy-b1060903.html","keywords":["Football","Sport"],"creator":["Marc Mayo"],"video_url":null,"description":"Jason Cundy disappointed with lack of finishing touch to Chelsea’s play","content":"’s team are suffering from the same issue as his previous side: nobody can finish their chances. That is according to pundit and former Blues player , who described watching his old club as “frustrating” following Wednesday night’s narrow defeat at . Chelsea created several chances to score but saw in particular waste opportunities before Karim Adeyemi’s second-half winner. “If we play the same [in the second leg] and we don’t score we’re out,” Cundy told . “Simple as that and football will never change. It’s so frustrating to play as well as we did. “I think this is like watching Potter’s Brighton. [The] chances they create, play well and don’t put the ball in the back of the net. Honestly, it’s so frustrating. The frustration of watching Chelsea play tonight. SPONSORED “I don’t care how much money we spend, spend more! We need a striker and you need someone that can put the ball in the back of the net.” Potter led Brighton to ninth in the Premier League last season yet only four teams scored fewer goals, while Chelsea rank 13th in the table this season for goals scored. Despite the defeat, Blues boss Potter insisted he was happy with many aspects of his side’s performance and rued a lack of “luck” and “execution” in front of goal. “Overall, we were pleased with the performance for big parts of the game,” he told reporters. “It is complicated away from home in the Champions League, in a hostile environment against a team that's in a good moment. It was an even first half, we managed the game quite well with good opportunities to counter-attack and we hit the bar. “Then in the second half apart from the one decisive action where we didn't do well enough, we were the dominant, the better team and created some good chances. “We needed a little bit of luck maybe and a little bit of final execution. We deserved a goal but have to keep going. It's half-time. It's a tight tie. We look forward to Stamford Bridge.”","pubDate":"2023-02-16 15:50:02","image_url":"https://static.standard.co.uk/2023/02/16/15/newFile-12.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona vs Manchester United: Prediction, kick off time, TV, live stream, team news, h2h results, odds today","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-prediction-kick-off-time-tv-live-stream-team-news-latest-h2h-results-odds-europa-league-2023-preview-today-b1059992.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Barcelona and Manchester United face off tonight in the first leg of a true heavyweight Europa League clash.","content":"and face off tonight in the first leg of a true heavyweight clash. While this most glamorous of fixtures is taking place within the confines of Europe’s secondary club competition, that does not tell the whole story with excitement levels still high. Both Barca and United look resurgent. ’s side sit atop LaLiga with the safety of an eight-point gap over Real Madrid, while Erik ten Hag has United playing some of their best football in years. A Champions League final just over a decade ago, even a Europa League setting does little to dampen the excitement of a meeting between two of the continent’s in-form sides. SPONSORED Barcelona vs Manchester United is scheduled for a 5.45pm GMT kick-off tonight, February 16, 2023. Camp Nou in Barcelona will host. : The game will be broadcast on BT Sport 2 with coverage starting at 5pm GMT. : The BT Sport app will allow subscribers to access a live steam across mobile devices, laptops, games consoles, tablets and more. Follow all of the action with Injured: Busquets will miss the United game with ankle ligament damage : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessie, Pedri, Gavi, Raphinha, Lewandowski : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo Barcelona are yet to lose at home this season and boast the best defence in Spain. While United have come on leaps and bounds of late, it’s a huge ask to go to Camp Nou and win. It’s all about staying in the tie. . Barcelona wins: 3 Draws: 4 Manchester United wins: 6 Barcelona to win: 3/4 Draw: 29/10 Manchester United to win: 10/3 .","pubDate":"2023-02-16 15:29:16","image_url":"https://static.standard.co.uk/2023/02/16/07/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Manchester United XI vs Barcelona: Confirmed team news, predicted lineup, injury latest for Europa League","link":"https://www.standard.co.uk/sport/football/man-utd-xi-vs-fc-barcelona-confirmed-team-predicted-lineup-news-injury-latest-europa-league-2023-today-b1060618.html","keywords":["Football","Sport"],"creator":["Matt Verri"],"video_url":null,"description":"Latest Manchester United team news ahead of tonight’s clash","content":"and Aaron Wan-Bissaka both return to the starting line-up for a depleted side as they face in the tonight. It’s a blockbuster play-off tie, with two of European football’s heavyweights looking to book their place in the last-16 stage of the competition. headlines a number of absentees for Erik ten Hag, he is suspended after picking up three yellow cards in the group stage. Luke Shaw moves into central defence as a result, allowing Tyrell Malacia to come in at left-back. Marcel Sabitzer is also suspended, having been booked three times for Bayern Munich in the Champions League group stage. , currently suspended domestically, is available for European fixtures and partners Fred in midfield. Aaron Wan-Bissaka is back after illness and he replaces Diogo Dalot at right-back. Antony, Anthony Martial and Scott McTominay all miss out again through injury and have not travelled to Barcelona. On their availability for the Carabao Cup final later this month, Ten Hag said: “It looks good. They are on the way back. They are on the training ground individually. They are making progress. “At the end of the week, maybe Scott can make the team, then next week, maybe Antony.” Wout Weghorst was added to United’s Europa League squad after arriving in January and leads the line at the Camp Nou, with Jadon Sancho, Marcus Rashford and Bruno Fernandes starting behind him. De Gea; Wan-Bissaka, Varane, Shaw, Malacia; Casemiro, Fred; Sancho, Fernandes, Rashford; Weghorst. Heaton, Butland, Lindelof, Maguire, Dalot, Pellistri, Elanga, Garnacho, Iqbal, Mainoo.","pubDate":"2023-02-16 15:28:32","image_url":"https://static.standard.co.uk/2022/10/07/09/UEFAEUROPALEAGUEMANUTDTENHAGPREDICTEDXI.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona XI vs Manchester United: Confirmed team news, predicted lineup, injury latest for Europa League","link":"https://www.standard.co.uk/sport/football/fc-barcelona-xi-vs-man-utd-confirmed-team-predicted-lineup-news-injury-latest-europa-league-2023-today-b1060423.html","keywords":["Football","Sport"],"creator":["Dom Smith"],"video_url":null,"description":"Latest Barcelona team news ahead of tonight’s Europa League clash","content":"starts for against in the , with Marcos Alonso at centre-back. Manchester United visit the for the first-leg of their Europa League play-off tie in a match-up Barcelona coach has labelled as “spectacular”. Former Leeds forward Raphinha is set to start the match for Barcelona, who have been playing a 4-4-2 diamond formation which morphs into a conventional 4-3-3. Xavi’s side are LaLiga leaders by eight points and have won their last 11 matches in all competitions. Barcelona have not faced United since they met in the Champions League in April 2019, when the Catalan club made it four competitive victories in a row over the Red Devils. SPONSORED Alonso gets the nod at centre-back alongside Araujo, with Andreas Christensen having to settle for a place on the bench. Ousmane Dembele is set to miss both legs of the tie with a thigh injury and Sergio Busquets is out too with an ankle issue. : Ter Stegen, Kounde, Araujo, Alonso, Alba, De Jong, Kessie, Pedri, Gavi, Raphinha, Lewandowski. : Pena, Tenas, Fati, Torres, Christensen, Roberto, Garcia, Balde, Casado, Torre, Alarcon","pubDate":"2023-02-16 15:28:02","image_url":"https://static.standard.co.uk/2023/02/16/07/newFile-5.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Barcelona vs Manchester United live stream: How can I watch Europa League game on TV in UK today?","link":"https://www.standard.co.uk/sport/football/fc-barcelona-vs-man-utd-europa-league-how-can-i-watch-live-tv-coverage-stream-today-b1060041.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Barcelona and Manchester United go head-to-head in the first leg of a huge Europa League clash tonight.","content":"and go head-to-head in the first leg of a huge clash tonight. Two of the biggest names in world football, it seems odd to see such an evocative fixture played in Europe’s secondary club competition. Still, while this being played in the Champions League would undoubtedly add another level of sheen to this tie, the fact it is in the Europa League should take little away. Both teams are in brilliant form this season, with Barca clear of Real Madrid at the top of LaLiga and United impressing under Erik ten Hag. SPONSORED It’s going to be quite the meeting between two bonafide European heavyweights. : The game will be broadcast on BT Sport 2 with coverage starting at 5pm GMT for a 5.45pm GMT kick-off. : The BT Sport app will allow subscribers to access a live steam across mobile devices, laptops, games consoles, tablets and more. Follow all of the action with","pubDate":"2023-02-16 15:27:31","image_url":"https://static.standard.co.uk/2023/02/04/17/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Arsenal hurt most by Gabriel Jesus absence with Eddie Nketiah guilty of costly misses","link":"https://www.standard.co.uk/sport/football/arsenal-fc-news-jesus-nketiah-b1060888.html","keywords":["Football","Sport"],"creator":["Simon Collings"],"video_url":null,"description":"The deputising striker has failed to score in four games - coinciding with Arsenal’s worst run of the season","content":"visited the dressing room last night to console his team-mates after this defeat to . Despite being out injured since the World Cup with a knee injury, Jesus has stayed close to the squad and offered support in his role as vice-captain. But how Arteta will have wished he could have had the Brazilian on the pitch last night. This was a chastening night for Arsenal as they surrendered top spot in the Premier League and their woes in front of goal summed it up. Striker Eddie Nketiah missed two glorious headed chances in either half, while at the other end Erling Haaland made no mistake with his one opportunity to secure a 3-1 win for City. Nketiah has performed admirably for Arsenal since being tasked with leading the line after Jesus injured his knee playing for Brazil at the World Cup, but his form has dipped in recent weeks and his four matches without a goal have coincided with Arsenal failing to win a game in that time. The 23-year-old’s all-round game has come on leaps in bounds this season, but his main currency remains goals. When they dry up, it is hard not to feel the absence of Jesus. A returning Jesus feels like the spark Arsenal need to ignite their title bid back into life. The Brazilian is not a great goalscorer, however his ability to link the play and open up defences is vital. Jesus drifts across the forward line and his movement allows others to flourish. Gabriel Martinelli, who enjoys a close relationship with Jesus off the field, is one of those suffering in his absence and he has not scored a goal since New Year’s Eve. Eddie Nketiah missed a number of gilt-edged chances. Arsenal are wary about rushing Jesus back after knee surgery, but he has made good progress this week. The striker has been out back on the grass at the club’s training ground, doing some individual work with the ball, having previously been working indoors, undergoing sessions with fitness coaches to strengthen the muscles around his knee. It is a testament to Jesus that his absence was felt more keenly than Thomas Partey last night, who also missed out through injury. The midfielder felt discomfort in his back yesterday and Arsenal made a very late call to pull him out. Jorginho was handed a first start at his new club and he impressed during the opening 45 minutes when Arsenal dominated possession, but the Italian, like his team-mates, faded in the second half to take a small shine off an otherwise fine performance. Arsenal are wobbling for the first time this season and they cannot let the slide continue.","pubDate":"2023-02-16 15:21:31","image_url":"https://static.standard.co.uk/2023/02/16/15/newFile-9.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Affaire Le Graët : \"il est urgent d'agir\" pour le président du Conseil national d'éthique, qui appelle à une démission","link":"https://www.midilibre.fr/2023/02/16/affaire-le-graet-il-est-urgent-dagir-pour-le-president-du-conseil-national-dethique-qui-appelle-a-une-demission-11003716.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Attendre fin février pour se pencher sur le sort de Noël Le Graët est \"beaucoup trop tardif\" et \"il est urgent d'agir\", affirme jeudi le président du Conseil national de l'éthique (CNE), Patrick Anton, appelant le...","content":"Attendre fin février pour se pencher sur le sort de Noël Le Graët est \"beaucoup trop tardif\" et \"il est urgent d'agir\", affirme jeudi le président du Conseil national de l'éthique (CNE), Patrick Anton, appelant le président de la FFF à démissionner. Le Conseil national de l'éthique \"ne s'est pas encore réuni mais la tendance est de demander sa démission\" puisque le rapport de l'Inspection générale a clairement établi qu'il \"n'avait plus la légitimité pour diriger une fédération sportive\", affirme son président auprès de l'AFP. \"Notre levier à nous, s'il ne démissionne pas, ce sera de le traduire devant une commission de discipline\" afin d'engager une procédure pouvant aller jusqu'à la radiation, indique Patrick Anton , peu enclin à activer ce processus pour celui qui a autrefois été \"un grand dirigeant\". \"Je préférerais nettement la démission à des procédures qui le mettraient dehors. Il sortirait encore plus par la petite porte, et elle est déjà étroite. Ça gâcherait tout ce qu'il a fait pour le football français et on ne parlerait de lui dans quelques mois ou années que par l'aspect négatif\", insiste-t-il. Le président du CNE \"regrette\" que le prochain comité exécutif fédéral, censé statuer sur le sort de Noël Le Graët , ait été fixé au 28 février et pas dans la foulée de la publication du rapport, comme prévu initialement. \"C'est beaucoup trop tardif\", dit-il. \"Autant il était urgent d'attendre avant le dépôt du rapport, autant aujourd'hui il est urgent d'agir. Philippe Diallo n'est plus le président intérimaire, Noël Le Graët est redevenu le président. Or, peu de gens veulent encore de lui à la tête de la Fédération. Surtout, il faut que le football continue à tourner. Or là on est en plein marasme\". \"Démissionner serait une sortie à peu près honorable. On referme la page et on travaille sur l'avenir. Cette crise a démontré qu'il y avait des choses à faire, à modifier, notamment sur la gouvernance\", insiste-t-il.","pubDate":"2023-02-16 15:20:54","image_url":"https://images.midilibre.fr/api/v1/images/view/63ee4883bf8f55404317d920/standard/image.jpg?v=1","source_id":"midilibre","category":["sports"],"country":["france"],"language":"french"},{"title":"Ottavi di Youth League (gara secca): Milan-Ruh Lviv si giocherà il 28 febbraio alle 15 al Puma House of Football","link":"https://www.milannews.it/la-primavera/ottavi-di-youth-league-gara-secca-milan-ruh-lviv-si-giochera-il-28-febbraio-alle-15-al-puma-house-of-football-482988","keywords":["La Primavera"],"creator":null,"video_url":null,"description":"Il sito ufficiale della UEFA ha reso noto il programma degli ottavi di Youth League che si giocheranno tutti in gara secca: la Primavera del Milan di Ignazio Abate sarà impegnata martedì 28 febbraio alle 15 contro gli ucraini del Ruh Lv ...","content":"Il sito ufficiale della UEFA ha reso noto il programma degli ottavi di Youth League che si giocheranno tutti in gara secca: la Primavera del Milan di Ignazio Abate sarà impegnata martedì 28 febbraio alle 15 contro gli ucraini del Ruh Lviv. Il match andrà in scena al PUMA House of Football - Centro Sportivo Vismara di Milano.","pubDate":"2023-02-16 15:10:55","image_url":"https://net-storage.tcccdn.com/storage/milannews.it/img_notizie/thumb3/7b/7bb52c22a1417bd98fcc8ad475bbc0d0-04875-336o529o1026o1219z0c26.jpeg","source_id":"milannews","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Snl24.com | 'Not everyone gets to rub shoulders with legends' - Petersen hails Khune influence","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/not-everyone-gets-to-rub-shoulders-with-legends-petersen-hails-khune-influence-20230216","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs goalkeeper Brandon Petersen has revealed the lessons he’s picked up from fellow goalkeeper and club captain Itumeleng Khune who he describes as a legend.","content":"Petersen has been in goal for Amakhosi’s last three matches and has kept just as many clean sheets during that period. The 28-year-old replaced Itumeleng Khune, who last featured for Amakhosi in a 1-0 loss to Sundowns in January. Although the pair compete for the same position, Petersen has revealed that he’s picked up some lessons from the well-established Amakhosi captain. \"I think the main thing [I learned from Khune] is consistency,\" Petersen told Journalists. \"He’s a legend. He’s been in the game and to play alongside a player like that everyday, it’s a blessing you know. Those are the moments as a footballer you need to cherish. Because not everyone gets to rub shoulders with legends. \"Not only meet them, but to train with them, it’s been good. I’ve learned a lot from him; the way he carries himself, the confidence he has and all his achievements. \"That’s encouragement for us as goalkeepers, you want to achieve those things the things he’s achieved. So it’s good. It’s exciting and it’s always fun. There’s never a dull moment, especially between us goalkeepers.\" | Petersen is likely to keep his place between the posts when Chiefs take on Golden Arrows in Polokwane. Amakhosi are looking to build momentum going into the Soweto Derby at the end of February. You must be to post and read comments. Click here to register:","pubDate":"2023-02-16 14:54:47","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"}]}