{"newsArray":[{"article_id":"854410b89bc71f676267c90fc49ce3bf","title":"Los Madrid Bravos, el equipo de la capital de fútbol americano","link":"https://www.marca.com/otros-deportes/2023/09/26/6512b32ce2704e553c8b4597.html","keywords":["Polideportivo","Otros Deportes","Fútbol americano"],"creator":["EUGENIO MUÑOZ"],"video_url":null,"description":null,"content":"Fuerza, bravura, lucha y victoria\". Es el mensaje de presentación de una realidad. Los en la European Football League -principal competición de fútbol americano en el 'Viejo Continente'-, desveló su identidad que la definirá. Rojo, blanco y detalles inconfundibles. Existen equipos repartidos por las principales categorías nacionales (LG Oled Las Rozas Black Demons, Osos Rivas y Camioneros de Coslada), y los Bravos dan el siguiente paso para competir en una liga que reúne a las principales ciudades europeas. Desde los siempre favoritos alemanes (Berlin Thunder, Cologne Centurions, Frankfurt Galaxy...) hasta el gran rival, los míticos Barcelona Dragons. Su color, a falta de conocer cómo serán sus equipaciones, partirá del rojo . \"Es más que una simple pieza de protección. Un símbolo de valentía, coraje y poder\", cuentan en su presentación. Además de unirlo a un mensaje que se difunde desde la EFL: \"Estampida a la victoria\". La unión entre Madrid y el fútbol americano es un paso lógico entre una ciudad con base de aficionados y estructuras con potencial. . \"Tienen gran ambición y España cuenta con jugadores del primer nivel para la liga\", agregó Patrick Esume, Comisionado de la competición. Pelearán con los míticos Barcelona Dragons por ser el estandarte del fútbol americano español. La mítica franquicia de la Ciudad Condal alcanzó momentos dorados en la segunda mitad de la década de los 90.","pubDate":"2023-09-26 10:32:35","image_url":"https://phantom-marca.unidadeditorial.es/dfb6cf2492e79af76347da2f0a833f9b/resize/600/assets/multimedia/imagenes/2023/09/26/16957231469308.jpg","source_id":"marca","source_priority":426,"country":["colombia"],"category":["sports"],"language":"spanish"},{"article_id":"0b3e631ff30ebf3db0a30ee6759250de","title":"An Analysis Of The Global Sports Betting Market","link":"https://www.completesports.com/an-analysis-of-the-global-sports-betting-market/","keywords":["Back Pass","Artificial Intelligence","Betting Market","Global Sports","iGaming","Sports Betting"],"creator":["Solomon Ojeagbase"],"video_url":null,"description":"Sports betting has never been as big as today and depending on your region you will be able to make your bets on sports in land based settings and online platforms. Digitalisation backed up by technological developments have contributed to online bookmakers being able to offer an enjoyable and safe betting experience to their customers. The global sports betting market is responsible for a value of U$ 83.65 million in 2022 and is expected to keep on growing 10.3% until 2030. This makes the global sports betting market one of the most interesting industries when it comes to the numbers. In this article, we’ll give you an in-depth analysis of the global sports betting market and what has driven its success. Main Drivers The growth of the global sports betting market is mainly driven by the overall enhancement of the online infrastructure and the more flexible regulatory landscape of the gambling industry in many regions around the world. In addition, the widespread availability of sports events such as the World Cup Football, the Champions League, and the Olympic Games has attracted new users and positively influenced the demand for betting products. The integration of Artificial Intelligence and blockchain technologies will contribute to the prediction algorithms in software and boost the growth of the global sports betting market in the next decade. A further boost will depend on the developments of disposable income. Technology is one of the most important drivers for today’s success of sports betting as an entertainment activity with advanced encryption protocols, optimised payment infrastructure, and the latest identity verification systems, making it possible that personal and financial data of registered customers is kept safe. Also, regulatory bodies and licensing authorities have contributed to the safety of the industry by coming up with responsible play policies, tools for age verification, and other measures to keep problem gambling as low as possible. This has made it possible to offer a regulated environment for sports betting, building trust, and confidence amongst players. With mobile optimised sites available globally, players can make their wagers anywhere and anytime, as long as they have access to the internet and credits. Increasing Legalisation The relaxation of governments around the world towards betting has made it possible to regulate betting activities across the globe. For many governments, legalising sports betting is a way to offer consumer protection from illicit websites, but it is also considered a lucrative opportunity that adds to the treasury department through gambling taxes. In most countries in the European Union, gambling is now legal, with more and more countries/regions in North and South America opting for the legalisation of sports betting. The United States, Canada, and LatAm are expected to contribute to the global growth of sports betting. Online casinos sites have yet not been legalised in many states in the US, but when this happens, this will lead to another boost of the iGaming market. Regional Contributions Still, Europe accounts for the largest market share for sports betting of over 35% in 2022. The region is expected to expand at nearly 10% until the year 2030. In most European countries, governments have a liberal approach towards gambling with some nations having legalised betting a long time ago. In the United Kingdom, sports betting was legalised in 1960 and is now home to one of most developed laws that allow legal sports betting. Stricter rules for advertisements have been announced though in the UK. The online sports betting segment has shown sizable growth across Europe owing to retail betting activities, reaching a market size of over US $ 40 billion until the year of 2030. Asia is also likely to show growth at a percentage of 11% until 2030. The most significant factor contributing to the sports betting market development in Asia is the increasing percentage of the population getting access to different sports betting activities on the internet. Also, several countries in the region have started to legalise the gambling industry by either offering it to local citizens or opening the market for overseas players. Related: Navigating The Sports Betting Landscape: Strategies For Success eSports Interestingly, eSports have highly contributed to the industry’s growth. This particular segment is expected to show a growth of 12% and stay one of the most dominant drivers. The growth of this category can also be attributed to the availability of mobile phones, live streaming, and increasing internet infrastructure worldwide. With multiplayer games and major eSports events organised in many countries around the world, eSports have grown to an important industry. The eSports betting segment currently has the highest growth rate of all categories and is set at a 14% growth rate until 2030. eSports will most likely have a major significant contribution in regions where the activity has not developed as much as in leading countries. eSports is particularly popular in Asia with Europe as a solid number two. Technological Developments Today, 60% of the population in the world enjoys internet access. The most important companies in the sports betting markets focus on their online offer rather than on offline products. This has led to operators developing high-end websites and coming up with a wide range of bonuses in order to get to a competitive edge in the market. Online gambling companies have been focusing on integrating technologies such as APIs to enhance functionalities and come up with a simplified user interface. In addition, the main competitors on the market have been working together on product enhancements and the joint creation of new revenue streams. With the introduction of AI and machine learning algorithms, betting companies are better able to thoroughly analyse vast amounts of data as well as player stats and present a convincing base for players to use for their own activities. These also come up with more accurate odds and predictions as well as tailor-made bonuses, promotions, and other deals. Today’s world is data driven and this in particular makes a vast contribution to the game experience of players, giving them all the tools and data to make carefully based decisions. Smartphones and mobile technology have of course also played a role in consumers getting access to sports betting products. Both mobile apps and responsive websites have made it easier than ever for enthusiasts to place bets anywhere and at any time. Sport book lobbies and other supporting pages such as the banking page have all been adapted to the growing group of mobile users. Faster internet connections and larger data packs have made it possible for players to have a smooth experience, enjoy the very best graphics and make it possible to make real-money wins. Conclusion In the ever evolving landscape of global sports betting, the industry has shown to be a lucrative and fun activity combining both real money gains and entertainment. Online sports betting has been a major driver for the industry, relying, or getting the most out of the power of the internet. Developments in terms of regulation and the introduction of advanced AI and other technologies in betting software has made it easier for bookmakers and other gambling websites to present prediction algorithms, helping the industry to target players, offering them high-end and smooth real-time platforms for betting. The industry has grown in recent years, thanks to online betting in particular and an increasing number of regulatory bodies legalising sports betting. Amongst the different segments available, eSports have shown to be highly sought after, offering new opportunities for the betting industry. Online operators have been more than willing to include eSports in their lobby and have looked out for technological developments to be able to do so. This has even led to joint developments with stakeholders such as payment providers making it possible to streamline their solutions to offer players an A to Z solution. The post An Analysis Of The Global Sports Betting Market appeared first on Complete Sports.","content":"Sports betting has never been as big as today and depending on your region you will be able to make your bets on sports in land based settings and online platforms. Digitalisation backed up by technological developments have contributed to online bookmakers being able to offer an enjoyable and safe betting experience to their customers. The global sports betting market is responsible for a value of U$ 83.65 million in 2022 and is expected to keep on growing 10.3% until 2030. This makes the global sports betting market one of the most interesting industries when it comes to the numbers. In this article, we’ll give you an in-depth analysis of the global sports betting market and what has driven its success. The growth of the global sports betting market is mainly driven by the overall enhancement of the online infrastructure and the more flexible regulatory landscape of the gambling industry in many regions around the world. In addition, the widespread availability of sports events such as the World Cup Football, the , and the Olympic Games has attracted new users and positively influenced the demand for betting products. The integration of and blockchain technologies will contribute to the prediction algorithms in software and boost the growth of the global sports betting market in the next decade. A further boost will depend on the developments of disposable income. Technology is one of the most important drivers for today’s success of sports betting as an entertainment activity with advanced encryption protocols, optimised payment infrastructure, and the latest identity verification systems, making it possible that personal and financial data of registered customers is kept safe. Also, regulatory bodies and licensing authorities have contributed to the safety of the industry by coming up with responsible play policies, tools for age verification, and other measures to keep problem gambling as low as possible. This has made it possible to offer a regulated environment for , building trust, and confidence amongst players. With mobile optimised sites available globally, players can make their wagers anywhere and anytime, as long as they have access to the internet and credits. The relaxation of governments around the world towards betting has made it possible to regulate betting activities across the globe. For many governments, legalising sports betting is a way to offer consumer protection from illicit websites, but it is also considered a lucrative opportunity that adds to the treasury department through gambling taxes. In most countries in the European Union, gambling is now legal, with more and more countries/regions in North and South America opting for the legalisation of sports betting. The United States, Canada, and LatAm are expected to contribute to the global growth of sports betting. Online casinos have yet not been legalised in many states in the US, but when this happens, this will lead to another boost of the iGaming market. Still, Europe accounts for the largest market share for sports betting of over 35% in 2022. The region is expected to expand at nearly 10% until the year 2030. In most European countries, governments have a liberal approach towards gambling with some nations having legalised betting a long time ago. In the United Kingdom, sports betting was legalised in 1960 and is now home to one of most developed laws that allow legal sports betting. Stricter rules for advertisements have been announced though in the UK. The online sports betting segment has shown sizable growth across Europe owing to retail betting activities, reaching a market size of over US $ 40 billion until the year of 2030. Asia is also likely to show growth at a percentage of 11% until 2030. The most significant factor contributing to the sports betting market development in Asia is the increasing percentage of the population getting access to different sports betting activities on the internet. Also, several countries in the region have started to legalise the gambling industry by either offering it to local citizens or opening the market for overseas players. Interestingly, eSports have highly contributed to the industry’s growth. This particular segment is expected to show a growth of 12% and stay one of the most dominant drivers. The growth of this category can also be attributed to the availability of mobile phones, live streaming, and increasing internet infrastructure worldwide. With multiplayer games and major eSports events organised in many countries around the world, eSports have grown to an important industry. The eSports betting segment currently has the highest growth rate of all categories and is set at a 14% growth rate until 2030. eSports will most likely have a major significant contribution in regions where the activity has not developed as much as in leading countries. eSports is particularly popular in Asia with Europe as a solid number two.","pubDate":"2023-09-26 10:30:42","image_url":null,"source_id":"completesports","source_priority":44611,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"b6ab01d9f53b0b33cada8a386b824b31","title":"NPFL Announces Kick-Off Date For 2023/24 League Season","link":"https://newtelegraphng.com/npfl-announces-kick-off-date-for-2023-24-league-season/?utm_source=rss&utm_medium=rss&utm_campaign=npfl-announces-kick-off-date-for-2023-24-league-season","keywords":["Sports","AFCON qualifier: CAF bars media","FIFA","NPFL"],"creator":["Boma Achenimie"],"video_url":null,"description":"After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30. Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in... The post NPFL Announces Kick-Off Date For 2023/24 League Season appeared first on New Telegraph.","content":"<div class=\"entry-content clearfix\"> <p>After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30.</p> <p>Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in Ibadan.</p> <p>The league’s start date was delayed once more due to a number of reasons, including the need to install the AI cameras needed to stream the games and train the staff on how to operate them.</p><div class=\"newte-inside-posts\" id=\"newte-1748048299\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6244403671\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>Before the league body officially chose September 30 as the new date for the start of the 2023–2024 NPFL season it was delayed for over three weeks.</p> <p>The games will still be televised online via the recently opened NPFL Live.</p> <p><strong>READ ALSO:</strong></p> <ul> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-gti-thumbs-up-rangers-commercialisation-initiative/\">NPFL: GTI Thumbs Up Rangers Commercialisation Initiative </a></span></li> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-gti-tasks-investors-on-elite-club-ownership/\">NPFL: GTI Tasks Investors On Elite Club Ownership </a></span></li> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-championship-playoff-supporters-in-a-contest-of-songs/\">NPFL Championship Playoff: Supporters in a contest of songs</a></span></li> </ul> <p>In a circular issued to all the clubs and signed by the league’s chief operational officer, Davidson Owumi, the NPFL board announced that the league would commence to secure the agreements that led to its postponement.</p><div class=\"newte-inside-posts_2\" id=\"newte-1137581551\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6244403671\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>The circular revealed that the prize money has increased from N100 million to N150 million and a take-off fund of N10 million will be given to each of the league’s 20 clubs.</p> <p>The circular reads in parts, “The 20 clubs will, as was done last season, receive a take-off grant of N10m each to smoothen your operations as the season starts.</p><div class=\"newte-content\" id=\"newte-1262978785\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6530340984\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>“We are, therefore, expecting all the clubs to as a matter of urgency forward their respective account details to the NPFL secretariat for the transfer of the said amount as the season is set to commence on Saturday, September 30.”</p> <div id=\"jp-relatedposts\" class=\"jp-relatedposts\"> <h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3> </div> </div> After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30. Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in Ibadan. The league’s start date was delayed once more due to a number of reasons, including the need to install the AI cameras needed to stream the games and train the staff on how to operate them. Before the league body officially chose September 30 as the new date for the start of the 2023–2024 NPFL season it was delayed for over three weeks. The games will still be televised online via the recently opened NPFL Live. In a circular issued to all the clubs and signed by the league’s chief operational officer, Davidson Owumi, the NPFL board announced that the league would commence to secure the agreements that led to its postponement. The circular revealed that the prize money has increased from N100 million to N150 million and a take-off fund of N10 million will be given to each of the league’s 20 clubs. The circular reads in parts, “The 20 clubs will, as was done last season, receive a take-off grant of N10m each to smoothen your operations as the season starts. “We are, therefore, expecting all the clubs to as a matter of urgency forward their respective account details to the NPFL secretariat for the transfer of the said amount as the season is set to commence on Saturday, September 30.”","pubDate":"2023-09-26 10:26:31","image_url":null,"source_id":"newtelegraphng","source_priority":447614,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"f64d6a526bf329eb9a2eab7329ccc814","title":"Gift Orban Handed Two-Match Ban After Debut Red Card","link":"https://tdpelmedia.com/gift-orban-to-pay-e1500-fine-in-belgium/","keywords":["Sports News","Nigeria"],"creator":["Funmilayo Salau"],"video_url":null,"description":"Gift Orban Handed Two-Match Ban After Debut Red Card Nigerian forward Gift Orban, plying his trade for KAA Gent, has been hit with a two-match The post Gift Orban Handed Two-Match Ban After Debut Red Card appeared first on TDPel Media.","content":"Nigerian forward Gift Orban, plying his trade for KAA Gent, has been hit with a two-match suspension after receiving a red card during a recent game against KAS Eupen. This incident marks Orban’s first red card as a professional footballer and has raised significant consequences for both him and his team. During the match between Gent and Eupen in the Belgian Pro League, a pivotal moment unfolded in the 45th minute. Referee intervention and a subsequent VAR review confirmed Orban’s dismissal for elbowing Rune Paeshuyse in the neck during an off-the-ball incident. This act of aggression warranted a straight red card for the young player. Despite the gravity of the offense, Gift Orban received a relatively lenient punishment due to it being his first red card in his professional career. Had he been penalized for acting violently, the suspension would have extended over multiple games. However, his clean disciplinary record worked to his advantage in this instance. The Belgian Football Association issued a statement clarifying the nature of the offense as “physical misconduct,” specifically describing it as a “brutal push with high intensity.” Consequently, a minimum suspension of two matches was deemed appropriate, in accordance with the indicative table for such infractions. Additionally, a fine of 1,500 euros was imposed. KAA Gent, Orban’s club, announced that they would consider any recommendations for a peaceful resolution and will decide on the final sanction on September 26, 2023. The incident and its repercussions come at a time when the player has been grappling with fitness issues and form challenges. Orban’s suspension will entail missing the league match against reigning champions Antwerp. Furthermore, the financial penalty adds to the consequences of his actions. The young Super Eagles invitee, who missed a recent Africa Cup of Nations qualification game due to fitness issues, will need to reflect on this episode as he aims to regain his form and contribute positively to his team’s performance in future matches.","pubDate":"2023-09-26 10:23:03","image_url":null,"source_id":"tdpelmedia","source_priority":27640785,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"c67683328c4f51cfd3a558ee61b336ef","title":"Harvey Barnes injury update with £38m transfer set to be out for ‘months’ in huge Newcastle blow","link":"https://www.thescottishsun.co.uk/sport/football/11288478/harvey-barnes-injury-update-newcastle/","keywords":["Football","Sport"],"creator":["Oscar Paul"],"video_url":null,"description":null,"content":"NEWCASTLE winger Harvey Barnes is facing months on the sidelines with a \"substantial\" foot injury. Toon’s new winger, signed from Leicester for £38million , was forced off just 11 minutes into last Sunday’s 8-0 demolition of Sheffield United. 3 Harvey Barnes limped off injured during Newcastle’s 8-0 mauling of Sheffield United Credit: Getty 3 Barnes joined the Magpies from Leicester this summer Credit: Getty And Barnes, 25, could now face surgery in what is a major early blow to his Magpies career. Newcastle boss Eddie Howe said: “I think it is an injury to the lower part of his foot just below the toe. It is quite a substantial injury. “We’ve had it scanned and we are waiting on what’s next, whether there’s surgery or not. “I don’t think it was from a tackle, it was just pushing off to run, very unlucky. “We are fearing - and I don’t want to put a time on it until we’ve seen the specialist - that’ll be weeks rather than months.” The Mags face Manchester City tomorrow in the Carabao Cup, with Howe set to rotate his squad with Burnley at home in the Prem on Saturday before hosting PSG in the Champions League next Wednesday. He added: “There are a couple of players carrying certain injuries. “We do have players that are really keen to play and show what they can do. We will have to utilise the squad, especially with what we have coming up next week.” Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed CASINO SPECIAL - BEST CASINO WELCOME OFFERS Newcastle had a tough start to their Prem campaign with matches against Man City, Liverpool and Brighton all in their first five fixtures of the season. But after their challenging run they will be full of confidence heading into a run of winnable league games after their 8-0 masterclass at the weekend. 3 Newcastle netted eight time as they breezed past Sheffield United on Sunday Credit: Getty","pubDate":"2023-09-26 10:08:55","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3f5cafd3e5c3757c96ee7a15cc9e9506","title":"FG intensifies lobby to host AFCON as Sports Minister, NFF officials storm Egypt","link":"https://blueprint.ng/fg-intensifies-lobby-to-host-afcon-as-sports-minister-nff-officials-storm-egypt/","keywords":["Sports","AFCON","FEDERAL GOVERNMENT"],"creator":["Editor"],"video_url":null,"description":"The Minister of Sports Development, Senator John Owan Enoh, will be attending the Confederation of African Football Executive Committee meeting in Cairo, Egypt, as the nation solidifies its bid to host the African Cup of Nations (AFCON) tournament for the first time since 1980. Nigeria and the Republic of Benin presented a joint bid to host the tournament. The Minister Read More The post FG intensifies lobby to host AFCON as Sports Minister, NFF officials storm Egypt appeared first on Blueprint Newspapers Limited.","content":"The Minister of Sports Development, Senator John Owan Enoh, will be attending the Confederation of African Football Executive Committee meeting in Cairo, Egypt, as the nation solidifies its bid to host the African Cup of Nations (AFCON) tournament for the first time since 1980. Nigeria and the Republic of Benin presented a joint bid to host the tournament. The Minister and the leadership of Nigeria Football Federation, (NFF) will be attending the meeting as representatives of the Federal Government of Nigeria. During the meeting, Nigeria will make its presentation to the Executive Committee of CAF in Cairo, Egypt. Senator Owan Enoh is attending the meeting alongside top members of the Nigeria Football Federation. All countries who submitted bids to host the AFCON tournament in 2025 and 2027 respectively are expected to attend the meeting during which the Independent Assessment Committee of CAF will submit their reports for assessment and discussions by CAF Exco. The CAF team had previously visited Nigeria to assess facilities at different proposed host venues around the nation. The Nigerian delegation includes the Permanent Secretary, Federal Ministry of Sports Development, Alhaji Ismaila Abubakar, President of the Nigeria Football Federation (NFF), Alhaji Ibrahim Gusau, General Secretary of the NFF, Dr. Mohammed Sanusi and bid coordinator, Mallam Mainasara Ilo. Nigeria will make a 10-minute presentation to the CAF exco, and thereafter will be allocated time to answer questions from its presentation. The meeting will hold on Wednesday, September 27, 2023.","pubDate":"2023-09-26 10:05:41","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"2f381ded42fcbc7970f393f80d7b7f91","title":"Ex Celtic ace said a random drug test saved his life after he ignored symptoms","link":"https://www.thescottishsun.co.uk/sport/football/11261550/celtic-ace-random-drug-test-saved-life-cancer/","keywords":["Football","Sport","Cancer (disease)","NHS","Scottish Premiership"],"creator":["Lynn Kernan"],"video_url":null,"description":null,"content":"FORMER Celtic ace Alan Stubbs reckons football saved his life – because a random drug test found he had testicular cancer. The spot check – after the Hoops lost the Scottish Cup final to Rangers in 1999 – showed traces of a hormone found only in pregnant women and men with a malignant growth. 5 Alan said no one should worry in silence 5 The Scottish Government is calling for Scots to 'Be the Early Bird' Celtic ace Alan, then 28, had felt a hardness in one of his testicles, as well as pain and numbness, but convinced himself that it would be ok - the test revealed otherwise. The top-flight defender had surgery within a week and was soon back on the pitch, but two years later doctors found another tumour on his spine during routine checks. After chemotherapy and a nine-hour operation , he made a full recovery and has been living well ever since. Alan, 51, said: “I don’t think I’d still be here if I hadn’t had that drug test.\" The sportsman is speaking out as The Scottish Government calls for people to ‘be the early bird’ and contact their GP practice if they have unusual, persistent symptoms that are not normal for them. READ MORE IN HEALTH BATS AMAZING! Bats could hold vital clues to beating cancer, study reveals get checked Chris Evans shows off scar as he issues health update after cancer scare Finding cancer earlier is really key to maximising your treatment options and means you’re more likely to live well again after treatment. So, whether it is you who has possible symptoms, or you are worried about a family member or friend, your GP practice wants to know. Alan said: \"I’d have carried on telling myself that it would be ok, that I was invincible and that footballers don’t get cancer. “I chose to ignore my symptoms, rather than confront them. “I was very, very fortunate – if it had been left any longer it might have spread, and it could have been too late.” Most read in Football WHO'S THAT GER? Rangers fans stumped as hero posts legends pic and mystery 'fifth player' FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move SHELF LIFE Famous Scottish stadium has been Morrisons for 20 years but footy past lives on Alan, who is now Director of Football at a school near his home in Formby, Liverpool , went on to play for Everton and later led Hibs to their first Scottish Cup victory in 114 years in 2016. Today, more than 20 years on, he is still cancer free – but checks himself every couple of days for peace of mind. He added: “I’d say to anyone worried about persistent, unusual symptoms, ‘Don’t worry in silence, go and get checked’. “Every day you wait, hoping it will be ok, is a day from potentially being on the road to recovery.” Snooker referee Leo Scullion was diagnosed with lung cancer in July 2014, his first thought was that it could be terminal – but nine years later he is in remission and is refereeing the British Open at Cheltenham. He is proof that, if cancer is diagnosed early, it boosts the range of treatment options and means you are more likely to live well again. Like lots of us might do, Leo initially ignored the signs that something wasn’t right but, when a player at a snooker event in China noticed that he’d lost a lot of weight , and another colleague urged him to stop smoking because of a persistent cough, he knew he had to contact his GP practice. He explained: “I knew I was coughing, but put it down to the smog, and the fact that I was a smoker, but I was also waking up at night with terrible sweats and I had started to feel pretty rough.” Following his lung cancer diagnosis, Leo, of Irvine, North Ayrshire , started a combination of chemotherapy and radiotherapy to shrink the tumour ahead of surgery, but the chemotherapy had to be stopped after he suffered a mild stroke. He continued with radiotherapy and had an operation in March 2015 – but surgeons decided not to remove the rest of the tumour as it was too close to a major artery. CONTACT YOUR GP DR Douglas Rigg, GP & Co-chair of the Scottish Primary Care Cancer Group urged anyone worried about persistent symptoms that are unusual for them to contact their GP practice – and let them help. He said: “Have you noticed unexplained weight loss or bleeding, or an unusual lump maybe? Has something been worrying you that doesn’t feel right? “Don't try to ignore it, be worried about bothering your doctor or feeling embarrassed. Your GP practice want to know. “For most people it won't be anything serious, such as cancer, but even if it is, finding cancer earlier can mean more treatments are available, giving you a better chance of living well again. “So please contact your GP practice and let us help you.” Acting on unusual, persistent symptoms as early as possible can save lives. Here are some of the key signs and symptoms to be aware of, but if you notice any persistent changes that are not on this list, contact your GP practice. In most cases these symptoms will be caused by something less serious than cancer, but it’s best to get checked: ● Very heavy night sweats ● Fatigue ● Unexplained bleeding or bruising ● Unexplained pain or ache ● Unexplained weight loss ● An unusual lump or swelling anywhere on your body ● A new mole or changes to a mole ● Skin changes or a sore that won’t heal To understand more about possible symptoms, visit the symptom checker at getcheckedearly.org He said: \"The treatment left me very weak and the recovery was harder than I expected, but I made a conscious decision to reduce the painkillers, work on my fitness and get my life back.” Leo started walking , then cycling , to get his fitness back and by 2017 he was on the circuit, working as a professional snooker referee again. He was regularly monitored and, in December 2019, he was given the news that the cancer was in remission, five years after diagnosis. Read more on the Scottish Sun TOP THAT I tried H&M's viral £7 Skims dupe - it's so sculpting and you don't need a bra HI SOCIETY I'm an etiquette pro & here's the correct way to greet people, Queen swore by it That same year he officiated his first World Championship final. Leo said: “I feel very lucky I got diagnosed when I did. If you are worried about unusual, persistent symptoms, contact your GP practice now – don’t leave it, get it checked out.” 5 Alan, pictured in his Celtic days, thought he was invincible 5 Leo Scullion is in remission from lung cancer 5 The ref officiated his first World Championship final in 2019","pubDate":"2023-09-26 10:04:38","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"94aee43a5d1cb5cec0f784452ff35ec0","title":"Alan Shearer’s glam daughter Hollie sends fans wild in see-through lace outfit as they say ‘looking amazing’","link":"https://www.thescottishsun.co.uk/sport/football/11288389/alan-shearer-daughter-hollie-instagram-paris/","keywords":["Football","Sport","Female Sport Influencers"],"creator":["Ciaran Wiseman"],"video_url":null,"description":null,"content":"HOLLIE SHEARER has sent her fans wild by posing in a see-through lace outfit. The singer-songwriter had her followers saying she was \"looking amazing\" after he latest Instagram upload. 7 Hollie Shearer sent her fans wild in a see-through lace outfit Credit: Instagram @hollieshearer 7 Hollie's fans were left saying she was 'looking amazing' Credit: Instagram @hollieshearer 7 Hollie wowed as she relaxed outside a café in Paris Credit: Instagram / @hollieshearer Hollie , who is the daughter of Premier League legend Alan Shearer, shared a pair of snaps as she relaxed outside a café in Paris. She stunned in a see-through white lace top whilst looking off into the distance in the candid snaps. Along with the top, Hollie completed her look with a pair of brown trousers, captioning the post: \"Coffee Stop.\" Hollie's fans were left in awe in the comments section, with one follower writing: \"Elegant and classy.\" Another also wrote: \"Looking amazing.\" Meanwhile, a third fan added: \"Stunning Hollie.\" The 28-year-old regularly treats her 83,700 Instagram followers to stunning snaps from her life and travels. She often showed off her tan over the summer as she relaxed in several striking bikinis whilst on holiday. Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed 7 The singer-songwriter is the daughter of ex-footballer Alan Shearer Credit: Instagram 7 Hollie has over 80,000 Instagram followers Credit: instagram @hirestreetuk Hollie also celebrated her sister Chloe's 31st birthday in Paris earlier this month. She recently moved to the city after her rugby star boyfriend Joe Marchant signed for French side Stade Francais. The former Harlequins centre will join up with his new team after the Rugby World Cup in France, where he has been starring for England. Hollie has been amongst the Wags cheering on Steve Borthwick's side and was pictured in the crowd at their group stage win over Argentina. 7 Hollie's fans are often treated to stunning bikini snaps on social media Credit: Instagram @hollieshearer 7 The 28-year-old is dating England rugby star Joe Marchant Credit: instagram @hollieshearer","pubDate":"2023-09-26 09:55:04","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"af7c2accaeaddc2817b6b8c4fc633dc9","title":"Son Heung-min awkwardly corrected on live TV by journalist for saying Tottenham team-mate’s name wrong","link":"https://www.thescottishsun.co.uk/sport/football/11288353/son-heung-min-awkward-tottenham-team-mates-name-wrong/","keywords":["Football","Sport"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"SON HEUNG-MIN was awkwardly caught out by a journalist for saying one of his team-mate's names wrong. The Tottenham star was talking to a reporter following the North London derby against Arsenal . 2 Son Heung-min was corrected about the pronunciation of a team-mates name Credit: Reddit 2 Son was incorrectly saying Micky van de Ven's name Credit: Getty Son , 31, was interrupted during the interview and explained to someone off-camera that he and the journalist were talking \"about Micky van de Vick\". To which the interviewer then questioned the attacker saying: \"How do you pronounce it?\" To which Son replied \"Micky van de Vick\" for a second time. The journalist then showed Son the correct pronunciation and said: \" Micky van de Ven we say, with an N\". Son then responded saying \"Van de ven, wow.\" Van de Ven joined Tottenham in the summer from Wolfsburg and has become a member of the first team under manager Ange Postecoglou. The Dutch defender has made six appearances in the Premier League and one in the Carabao Cup. Van den Ven cost Tottenham £43million when he joined the club . Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed FREE BETS - BEST BETTING OFFERS AND BONUSES NEW CUSTOMERS Son was named captain of the club in the summer after the armband was taken away from Hugo Lloris. He has been in good form so far this season having already scored five goals in the Premier League. The South Korean star most recently netted a brace against Arsenal in the North London derby. The game ended 2-2 as Spurs came from behind twice to earn a point from their fierce rivals.","pubDate":"2023-09-26 09:50:13","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0de8c7a034620becbf6a4662b9d6e0d0","title":"Football club boss gunned down by hired killers on bikes in front of daughter just hours after his side is beaten 3-2","link":"https://www.thescottishsun.co.uk/sport/football/11288299/football-club-boss-shot-daughter-loss-edgar-paez/","keywords":["Football","Sport","Crime","Police"],"creator":["Sarah Hooper"],"video_url":null,"description":null,"content":"A COLOMBIAN football club boss was gunned down in front of his daughter only hours after his team was defeated on the pitch. 63-year-old Edgar Paez, president of the Tigres Football Club, was returning home with his daughter when two men on a motorbike carried out the horror attack. 2 Paez, President of the Tigres Football Club, was gunned down in the senseless attack Credit: Tigres FC 2 The club had just been knocked to the bottom of their league following a loss Credit: Tigres FC Colombian National Police revealed the footy boss suffered three fatal gunshot wounds nearby the stadium around 6:15pm on Saturday. His daughter escaped unscathed, but Paez died of his injuries before reaching a nearby hospital. Paez's team had just been knocked to the bottom of their 16-team league after a 3-2 defeat earlier in the day - though it is unknown if the loss was related to the murder. Police are currently investigating the murder as tributes have poured in for the football figurehead. Tigres FC released a statement reading: \"The Tigres family and the sporting community are devastated by this event. \"His commitment to the team and his dedication to the development of the sport in our region left an indelible mark on all who had the privilege of knowing him.\" The President of the Major Division of Colombian Professional Football, Fernando Jaramillo, said: \"He was always distinguished by his respect for his friends, by his strong but respectful positions and by the love he professed for the sport that we are all passionate about: football.\" Paez formerly directed Independiente Santa Fe, another football team based out of Bogota. Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed A moment of silence will be held in memory of Paez in the next two matches played by Colombian teams. Further questions about the circumstances of Paez's death have continued to flood in in recent days. One Twitter user said: \"The murder of Paez should immediately cancel this championship. An unprecedented setback. What dark interests are behind it?\" Another user added: \"It is unfortunate that these types of incidents persist in Colombian sports.\" One passionate Colombian footy fan shared: \"In a decent country, the championship would have been suspended. \"May the murder of the president of Tigres be clarified and justice be done.\" In 2019, a South African football manager was shot dead outside of his stadium in a \"spray of bullets.\" Siphiwo \"Mawawa\" Nyobo had just finished watching a match in East London, in Eastern South Africa. He was boss of team Tornado FC and said to be a “prominent businessman” in the city.","pubDate":"2023-09-26 09:42:47","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"854410b89bc71f676267c90fc49ce3bf","title":"Los Madrid Bravos, el equipo de la capital de fútbol americano","link":"https://www.marca.com/otros-deportes/2023/09/26/6512b32ce2704e553c8b4597.html","keywords":["Polideportivo","Otros Deportes","Fútbol americano"],"creator":["EUGENIO MUÑOZ"],"video_url":null,"description":null,"content":"Fuerza, bravura, lucha y victoria\". Es el mensaje de presentación de una realidad. Los en la European Football League -principal competición de fútbol americano en el 'Viejo Continente'-, desveló su identidad que la definirá. Rojo, blanco y detalles inconfundibles. Existen equipos repartidos por las principales categorías nacionales (LG Oled Las Rozas Black Demons, Osos Rivas y Camioneros de Coslada), y los Bravos dan el siguiente paso para competir en una liga que reúne a las principales ciudades europeas. Desde los siempre favoritos alemanes (Berlin Thunder, Cologne Centurions, Frankfurt Galaxy...) hasta el gran rival, los míticos Barcelona Dragons. Su color, a falta de conocer cómo serán sus equipaciones, partirá del rojo . \"Es más que una simple pieza de protección. Un símbolo de valentía, coraje y poder\", cuentan en su presentación. Además de unirlo a un mensaje que se difunde desde la EFL: \"Estampida a la victoria\". La unión entre Madrid y el fútbol americano es un paso lógico entre una ciudad con base de aficionados y estructuras con potencial. . \"Tienen gran ambición y España cuenta con jugadores del primer nivel para la liga\", agregó Patrick Esume, Comisionado de la competición. Pelearán con los míticos Barcelona Dragons por ser el estandarte del fútbol americano español. La mítica franquicia de la Ciudad Condal alcanzó momentos dorados en la segunda mitad de la década de los 90.","pubDate":"2023-09-26 10:32:35","image_url":"https://phantom-marca.unidadeditorial.es/dfb6cf2492e79af76347da2f0a833f9b/resize/600/assets/multimedia/imagenes/2023/09/26/16957231469308.jpg","source_id":"marca","source_priority":426,"country":["colombia"],"category":["sports"],"language":"spanish"},{"article_id":"0b3e631ff30ebf3db0a30ee6759250de","title":"An Analysis Of The Global Sports Betting Market","link":"https://www.completesports.com/an-analysis-of-the-global-sports-betting-market/","keywords":["Back Pass","Artificial Intelligence","Betting Market","Global Sports","iGaming","Sports Betting"],"creator":["Solomon Ojeagbase"],"video_url":null,"description":"Sports betting has never been as big as today and depending on your region you will be able to make your bets on sports in land based settings and online platforms. Digitalisation backed up by technological developments have contributed to online bookmakers being able to offer an enjoyable and safe betting experience to their customers. The global sports betting market is responsible for a value of U$ 83.65 million in 2022 and is expected to keep on growing 10.3% until 2030. This makes the global sports betting market one of the most interesting industries when it comes to the numbers. In this article, we’ll give you an in-depth analysis of the global sports betting market and what has driven its success. Main Drivers The growth of the global sports betting market is mainly driven by the overall enhancement of the online infrastructure and the more flexible regulatory landscape of the gambling industry in many regions around the world. In addition, the widespread availability of sports events such as the World Cup Football, the Champions League, and the Olympic Games has attracted new users and positively influenced the demand for betting products. The integration of Artificial Intelligence and blockchain technologies will contribute to the prediction algorithms in software and boost the growth of the global sports betting market in the next decade. A further boost will depend on the developments of disposable income. Technology is one of the most important drivers for today’s success of sports betting as an entertainment activity with advanced encryption protocols, optimised payment infrastructure, and the latest identity verification systems, making it possible that personal and financial data of registered customers is kept safe. Also, regulatory bodies and licensing authorities have contributed to the safety of the industry by coming up with responsible play policies, tools for age verification, and other measures to keep problem gambling as low as possible. This has made it possible to offer a regulated environment for sports betting, building trust, and confidence amongst players. With mobile optimised sites available globally, players can make their wagers anywhere and anytime, as long as they have access to the internet and credits. Increasing Legalisation The relaxation of governments around the world towards betting has made it possible to regulate betting activities across the globe. For many governments, legalising sports betting is a way to offer consumer protection from illicit websites, but it is also considered a lucrative opportunity that adds to the treasury department through gambling taxes. In most countries in the European Union, gambling is now legal, with more and more countries/regions in North and South America opting for the legalisation of sports betting. The United States, Canada, and LatAm are expected to contribute to the global growth of sports betting. Online casinos sites have yet not been legalised in many states in the US, but when this happens, this will lead to another boost of the iGaming market. Regional Contributions Still, Europe accounts for the largest market share for sports betting of over 35% in 2022. The region is expected to expand at nearly 10% until the year 2030. In most European countries, governments have a liberal approach towards gambling with some nations having legalised betting a long time ago. In the United Kingdom, sports betting was legalised in 1960 and is now home to one of most developed laws that allow legal sports betting. Stricter rules for advertisements have been announced though in the UK. The online sports betting segment has shown sizable growth across Europe owing to retail betting activities, reaching a market size of over US $ 40 billion until the year of 2030. Asia is also likely to show growth at a percentage of 11% until 2030. The most significant factor contributing to the sports betting market development in Asia is the increasing percentage of the population getting access to different sports betting activities on the internet. Also, several countries in the region have started to legalise the gambling industry by either offering it to local citizens or opening the market for overseas players. Related: Navigating The Sports Betting Landscape: Strategies For Success eSports Interestingly, eSports have highly contributed to the industry’s growth. This particular segment is expected to show a growth of 12% and stay one of the most dominant drivers. The growth of this category can also be attributed to the availability of mobile phones, live streaming, and increasing internet infrastructure worldwide. With multiplayer games and major eSports events organised in many countries around the world, eSports have grown to an important industry. The eSports betting segment currently has the highest growth rate of all categories and is set at a 14% growth rate until 2030. eSports will most likely have a major significant contribution in regions where the activity has not developed as much as in leading countries. eSports is particularly popular in Asia with Europe as a solid number two. Technological Developments Today, 60% of the population in the world enjoys internet access. The most important companies in the sports betting markets focus on their online offer rather than on offline products. This has led to operators developing high-end websites and coming up with a wide range of bonuses in order to get to a competitive edge in the market. Online gambling companies have been focusing on integrating technologies such as APIs to enhance functionalities and come up with a simplified user interface. In addition, the main competitors on the market have been working together on product enhancements and the joint creation of new revenue streams. With the introduction of AI and machine learning algorithms, betting companies are better able to thoroughly analyse vast amounts of data as well as player stats and present a convincing base for players to use for their own activities. These also come up with more accurate odds and predictions as well as tailor-made bonuses, promotions, and other deals. Today’s world is data driven and this in particular makes a vast contribution to the game experience of players, giving them all the tools and data to make carefully based decisions. Smartphones and mobile technology have of course also played a role in consumers getting access to sports betting products. Both mobile apps and responsive websites have made it easier than ever for enthusiasts to place bets anywhere and at any time. Sport book lobbies and other supporting pages such as the banking page have all been adapted to the growing group of mobile users. Faster internet connections and larger data packs have made it possible for players to have a smooth experience, enjoy the very best graphics and make it possible to make real-money wins. Conclusion In the ever evolving landscape of global sports betting, the industry has shown to be a lucrative and fun activity combining both real money gains and entertainment. Online sports betting has been a major driver for the industry, relying, or getting the most out of the power of the internet. Developments in terms of regulation and the introduction of advanced AI and other technologies in betting software has made it easier for bookmakers and other gambling websites to present prediction algorithms, helping the industry to target players, offering them high-end and smooth real-time platforms for betting. The industry has grown in recent years, thanks to online betting in particular and an increasing number of regulatory bodies legalising sports betting. Amongst the different segments available, eSports have shown to be highly sought after, offering new opportunities for the betting industry. Online operators have been more than willing to include eSports in their lobby and have looked out for technological developments to be able to do so. This has even led to joint developments with stakeholders such as payment providers making it possible to streamline their solutions to offer players an A to Z solution. The post An Analysis Of The Global Sports Betting Market appeared first on Complete Sports.","content":"Sports betting has never been as big as today and depending on your region you will be able to make your bets on sports in land based settings and online platforms. Digitalisation backed up by technological developments have contributed to online bookmakers being able to offer an enjoyable and safe betting experience to their customers. The global sports betting market is responsible for a value of U$ 83.65 million in 2022 and is expected to keep on growing 10.3% until 2030. This makes the global sports betting market one of the most interesting industries when it comes to the numbers. In this article, we’ll give you an in-depth analysis of the global sports betting market and what has driven its success. The growth of the global sports betting market is mainly driven by the overall enhancement of the online infrastructure and the more flexible regulatory landscape of the gambling industry in many regions around the world. In addition, the widespread availability of sports events such as the World Cup Football, the , and the Olympic Games has attracted new users and positively influenced the demand for betting products. The integration of and blockchain technologies will contribute to the prediction algorithms in software and boost the growth of the global sports betting market in the next decade. A further boost will depend on the developments of disposable income. Technology is one of the most important drivers for today’s success of sports betting as an entertainment activity with advanced encryption protocols, optimised payment infrastructure, and the latest identity verification systems, making it possible that personal and financial data of registered customers is kept safe. Also, regulatory bodies and licensing authorities have contributed to the safety of the industry by coming up with responsible play policies, tools for age verification, and other measures to keep problem gambling as low as possible. This has made it possible to offer a regulated environment for , building trust, and confidence amongst players. With mobile optimised sites available globally, players can make their wagers anywhere and anytime, as long as they have access to the internet and credits. The relaxation of governments around the world towards betting has made it possible to regulate betting activities across the globe. For many governments, legalising sports betting is a way to offer consumer protection from illicit websites, but it is also considered a lucrative opportunity that adds to the treasury department through gambling taxes. In most countries in the European Union, gambling is now legal, with more and more countries/regions in North and South America opting for the legalisation of sports betting. The United States, Canada, and LatAm are expected to contribute to the global growth of sports betting. Online casinos have yet not been legalised in many states in the US, but when this happens, this will lead to another boost of the iGaming market. Still, Europe accounts for the largest market share for sports betting of over 35% in 2022. The region is expected to expand at nearly 10% until the year 2030. In most European countries, governments have a liberal approach towards gambling with some nations having legalised betting a long time ago. In the United Kingdom, sports betting was legalised in 1960 and is now home to one of most developed laws that allow legal sports betting. Stricter rules for advertisements have been announced though in the UK. The online sports betting segment has shown sizable growth across Europe owing to retail betting activities, reaching a market size of over US $ 40 billion until the year of 2030. Asia is also likely to show growth at a percentage of 11% until 2030. The most significant factor contributing to the sports betting market development in Asia is the increasing percentage of the population getting access to different sports betting activities on the internet. Also, several countries in the region have started to legalise the gambling industry by either offering it to local citizens or opening the market for overseas players. Interestingly, eSports have highly contributed to the industry’s growth. This particular segment is expected to show a growth of 12% and stay one of the most dominant drivers. The growth of this category can also be attributed to the availability of mobile phones, live streaming, and increasing internet infrastructure worldwide. With multiplayer games and major eSports events organised in many countries around the world, eSports have grown to an important industry. The eSports betting segment currently has the highest growth rate of all categories and is set at a 14% growth rate until 2030. eSports will most likely have a major significant contribution in regions where the activity has not developed as much as in leading countries. eSports is particularly popular in Asia with Europe as a solid number two.","pubDate":"2023-09-26 10:30:42","image_url":null,"source_id":"completesports","source_priority":44611,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"b6ab01d9f53b0b33cada8a386b824b31","title":"NPFL Announces Kick-Off Date For 2023/24 League Season","link":"https://newtelegraphng.com/npfl-announces-kick-off-date-for-2023-24-league-season/?utm_source=rss&utm_medium=rss&utm_campaign=npfl-announces-kick-off-date-for-2023-24-league-season","keywords":["Sports","AFCON qualifier: CAF bars media","FIFA","NPFL"],"creator":["Boma Achenimie"],"video_url":null,"description":"After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30. Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in... The post NPFL Announces Kick-Off Date For 2023/24 League Season appeared first on New Telegraph.","content":"<div class=\"entry-content clearfix\"> <p>After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30.</p> <p>Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in Ibadan.</p> <p>The league’s start date was delayed once more due to a number of reasons, including the need to install the AI cameras needed to stream the games and train the staff on how to operate them.</p><div class=\"newte-inside-posts\" id=\"newte-1748048299\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6244403671\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>Before the league body officially chose September 30 as the new date for the start of the 2023–2024 NPFL season it was delayed for over three weeks.</p> <p>The games will still be televised online via the recently opened NPFL Live.</p> <p><strong>READ ALSO:</strong></p> <ul> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-gti-thumbs-up-rangers-commercialisation-initiative/\">NPFL: GTI Thumbs Up Rangers Commercialisation Initiative </a></span></li> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-gti-tasks-investors-on-elite-club-ownership/\">NPFL: GTI Tasks Investors On Elite Club Ownership </a></span></li> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-championship-playoff-supporters-in-a-contest-of-songs/\">NPFL Championship Playoff: Supporters in a contest of songs</a></span></li> </ul> <p>In a circular issued to all the clubs and signed by the league’s chief operational officer, Davidson Owumi, the NPFL board announced that the league would commence to secure the agreements that led to its postponement.</p><div class=\"newte-inside-posts_2\" id=\"newte-1137581551\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6244403671\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>The circular revealed that the prize money has increased from N100 million to N150 million and a take-off fund of N10 million will be given to each of the league’s 20 clubs.</p> <p>The circular reads in parts, “The 20 clubs will, as was done last season, receive a take-off grant of N10m each to smoothen your operations as the season starts.</p><div class=\"newte-content\" id=\"newte-1262978785\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6530340984\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>“We are, therefore, expecting all the clubs to as a matter of urgency forward their respective account details to the NPFL secretariat for the transfer of the said amount as the season is set to commence on Saturday, September 30.”</p> <div id=\"jp-relatedposts\" class=\"jp-relatedposts\"> <h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3> </div> </div> After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30. Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in Ibadan. The league’s start date was delayed once more due to a number of reasons, including the need to install the AI cameras needed to stream the games and train the staff on how to operate them. Before the league body officially chose September 30 as the new date for the start of the 2023–2024 NPFL season it was delayed for over three weeks. The games will still be televised online via the recently opened NPFL Live. In a circular issued to all the clubs and signed by the league’s chief operational officer, Davidson Owumi, the NPFL board announced that the league would commence to secure the agreements that led to its postponement. The circular revealed that the prize money has increased from N100 million to N150 million and a take-off fund of N10 million will be given to each of the league’s 20 clubs. The circular reads in parts, “The 20 clubs will, as was done last season, receive a take-off grant of N10m each to smoothen your operations as the season starts. “We are, therefore, expecting all the clubs to as a matter of urgency forward their respective account details to the NPFL secretariat for the transfer of the said amount as the season is set to commence on Saturday, September 30.”","pubDate":"2023-09-26 10:26:31","image_url":null,"source_id":"newtelegraphng","source_priority":447614,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"f64d6a526bf329eb9a2eab7329ccc814","title":"Gift Orban Handed Two-Match Ban After Debut Red Card","link":"https://tdpelmedia.com/gift-orban-to-pay-e1500-fine-in-belgium/","keywords":["Sports News","Nigeria"],"creator":["Funmilayo Salau"],"video_url":null,"description":"Gift Orban Handed Two-Match Ban After Debut Red Card Nigerian forward Gift Orban, plying his trade for KAA Gent, has been hit with a two-match The post Gift Orban Handed Two-Match Ban After Debut Red Card appeared first on TDPel Media.","content":"Nigerian forward Gift Orban, plying his trade for KAA Gent, has been hit with a two-match suspension after receiving a red card during a recent game against KAS Eupen. This incident marks Orban’s first red card as a professional footballer and has raised significant consequences for both him and his team. During the match between Gent and Eupen in the Belgian Pro League, a pivotal moment unfolded in the 45th minute. Referee intervention and a subsequent VAR review confirmed Orban’s dismissal for elbowing Rune Paeshuyse in the neck during an off-the-ball incident. This act of aggression warranted a straight red card for the young player. Despite the gravity of the offense, Gift Orban received a relatively lenient punishment due to it being his first red card in his professional career. Had he been penalized for acting violently, the suspension would have extended over multiple games. However, his clean disciplinary record worked to his advantage in this instance. The Belgian Football Association issued a statement clarifying the nature of the offense as “physical misconduct,” specifically describing it as a “brutal push with high intensity.” Consequently, a minimum suspension of two matches was deemed appropriate, in accordance with the indicative table for such infractions. Additionally, a fine of 1,500 euros was imposed. KAA Gent, Orban’s club, announced that they would consider any recommendations for a peaceful resolution and will decide on the final sanction on September 26, 2023. The incident and its repercussions come at a time when the player has been grappling with fitness issues and form challenges. Orban’s suspension will entail missing the league match against reigning champions Antwerp. Furthermore, the financial penalty adds to the consequences of his actions. The young Super Eagles invitee, who missed a recent Africa Cup of Nations qualification game due to fitness issues, will need to reflect on this episode as he aims to regain his form and contribute positively to his team’s performance in future matches.","pubDate":"2023-09-26 10:23:03","image_url":null,"source_id":"tdpelmedia","source_priority":27640785,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"c67683328c4f51cfd3a558ee61b336ef","title":"Harvey Barnes injury update with £38m transfer set to be out for ‘months’ in huge Newcastle blow","link":"https://www.thescottishsun.co.uk/sport/football/11288478/harvey-barnes-injury-update-newcastle/","keywords":["Football","Sport"],"creator":["Oscar Paul"],"video_url":null,"description":null,"content":"NEWCASTLE winger Harvey Barnes is facing months on the sidelines with a \"substantial\" foot injury. Toon’s new winger, signed from Leicester for £38million , was forced off just 11 minutes into last Sunday’s 8-0 demolition of Sheffield United. 3 Harvey Barnes limped off injured during Newcastle’s 8-0 mauling of Sheffield United Credit: Getty 3 Barnes joined the Magpies from Leicester this summer Credit: Getty And Barnes, 25, could now face surgery in what is a major early blow to his Magpies career. Newcastle boss Eddie Howe said: “I think it is an injury to the lower part of his foot just below the toe. It is quite a substantial injury. “We’ve had it scanned and we are waiting on what’s next, whether there’s surgery or not. “I don’t think it was from a tackle, it was just pushing off to run, very unlucky. “We are fearing - and I don’t want to put a time on it until we’ve seen the specialist - that’ll be weeks rather than months.” The Mags face Manchester City tomorrow in the Carabao Cup, with Howe set to rotate his squad with Burnley at home in the Prem on Saturday before hosting PSG in the Champions League next Wednesday. He added: “There are a couple of players carrying certain injuries. “We do have players that are really keen to play and show what they can do. We will have to utilise the squad, especially with what we have coming up next week.” Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed CASINO SPECIAL - BEST CASINO WELCOME OFFERS Newcastle had a tough start to their Prem campaign with matches against Man City, Liverpool and Brighton all in their first five fixtures of the season. But after their challenging run they will be full of confidence heading into a run of winnable league games after their 8-0 masterclass at the weekend. 3 Newcastle netted eight time as they breezed past Sheffield United on Sunday Credit: Getty","pubDate":"2023-09-26 10:08:55","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3f5cafd3e5c3757c96ee7a15cc9e9506","title":"FG intensifies lobby to host AFCON as Sports Minister, NFF officials storm Egypt","link":"https://blueprint.ng/fg-intensifies-lobby-to-host-afcon-as-sports-minister-nff-officials-storm-egypt/","keywords":["Sports","AFCON","FEDERAL GOVERNMENT"],"creator":["Editor"],"video_url":null,"description":"The Minister of Sports Development, Senator John Owan Enoh, will be attending the Confederation of African Football Executive Committee meeting in Cairo, Egypt, as the nation solidifies its bid to host the African Cup of Nations (AFCON) tournament for the first time since 1980. Nigeria and the Republic of Benin presented a joint bid to host the tournament. The Minister Read More The post FG intensifies lobby to host AFCON as Sports Minister, NFF officials storm Egypt appeared first on Blueprint Newspapers Limited.","content":"The Minister of Sports Development, Senator John Owan Enoh, will be attending the Confederation of African Football Executive Committee meeting in Cairo, Egypt, as the nation solidifies its bid to host the African Cup of Nations (AFCON) tournament for the first time since 1980. Nigeria and the Republic of Benin presented a joint bid to host the tournament. The Minister and the leadership of Nigeria Football Federation, (NFF) will be attending the meeting as representatives of the Federal Government of Nigeria. During the meeting, Nigeria will make its presentation to the Executive Committee of CAF in Cairo, Egypt. Senator Owan Enoh is attending the meeting alongside top members of the Nigeria Football Federation. All countries who submitted bids to host the AFCON tournament in 2025 and 2027 respectively are expected to attend the meeting during which the Independent Assessment Committee of CAF will submit their reports for assessment and discussions by CAF Exco. The CAF team had previously visited Nigeria to assess facilities at different proposed host venues around the nation. The Nigerian delegation includes the Permanent Secretary, Federal Ministry of Sports Development, Alhaji Ismaila Abubakar, President of the Nigeria Football Federation (NFF), Alhaji Ibrahim Gusau, General Secretary of the NFF, Dr. Mohammed Sanusi and bid coordinator, Mallam Mainasara Ilo. Nigeria will make a 10-minute presentation to the CAF exco, and thereafter will be allocated time to answer questions from its presentation. The meeting will hold on Wednesday, September 27, 2023.","pubDate":"2023-09-26 10:05:41","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"2f381ded42fcbc7970f393f80d7b7f91","title":"Ex Celtic ace said a random drug test saved his life after he ignored symptoms","link":"https://www.thescottishsun.co.uk/sport/football/11261550/celtic-ace-random-drug-test-saved-life-cancer/","keywords":["Football","Sport","Cancer (disease)","NHS","Scottish Premiership"],"creator":["Lynn Kernan"],"video_url":null,"description":null,"content":"FORMER Celtic ace Alan Stubbs reckons football saved his life – because a random drug test found he had testicular cancer. The spot check – after the Hoops lost the Scottish Cup final to Rangers in 1999 – showed traces of a hormone found only in pregnant women and men with a malignant growth. 5 Alan said no one should worry in silence 5 The Scottish Government is calling for Scots to 'Be the Early Bird' Celtic ace Alan, then 28, had felt a hardness in one of his testicles, as well as pain and numbness, but convinced himself that it would be ok - the test revealed otherwise. The top-flight defender had surgery within a week and was soon back on the pitch, but two years later doctors found another tumour on his spine during routine checks. After chemotherapy and a nine-hour operation , he made a full recovery and has been living well ever since. Alan, 51, said: “I don’t think I’d still be here if I hadn’t had that drug test.\" The sportsman is speaking out as The Scottish Government calls for people to ‘be the early bird’ and contact their GP practice if they have unusual, persistent symptoms that are not normal for them. READ MORE IN HEALTH BATS AMAZING! Bats could hold vital clues to beating cancer, study reveals get checked Chris Evans shows off scar as he issues health update after cancer scare Finding cancer earlier is really key to maximising your treatment options and means you’re more likely to live well again after treatment. So, whether it is you who has possible symptoms, or you are worried about a family member or friend, your GP practice wants to know. Alan said: \"I’d have carried on telling myself that it would be ok, that I was invincible and that footballers don’t get cancer. “I chose to ignore my symptoms, rather than confront them. “I was very, very fortunate – if it had been left any longer it might have spread, and it could have been too late.” Most read in Football WHO'S THAT GER? Rangers fans stumped as hero posts legends pic and mystery 'fifth player' FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move SHELF LIFE Famous Scottish stadium has been Morrisons for 20 years but footy past lives on Alan, who is now Director of Football at a school near his home in Formby, Liverpool , went on to play for Everton and later led Hibs to their first Scottish Cup victory in 114 years in 2016. Today, more than 20 years on, he is still cancer free – but checks himself every couple of days for peace of mind. He added: “I’d say to anyone worried about persistent, unusual symptoms, ‘Don’t worry in silence, go and get checked’. “Every day you wait, hoping it will be ok, is a day from potentially being on the road to recovery.” Snooker referee Leo Scullion was diagnosed with lung cancer in July 2014, his first thought was that it could be terminal – but nine years later he is in remission and is refereeing the British Open at Cheltenham. He is proof that, if cancer is diagnosed early, it boosts the range of treatment options and means you are more likely to live well again. Like lots of us might do, Leo initially ignored the signs that something wasn’t right but, when a player at a snooker event in China noticed that he’d lost a lot of weight , and another colleague urged him to stop smoking because of a persistent cough, he knew he had to contact his GP practice. He explained: “I knew I was coughing, but put it down to the smog, and the fact that I was a smoker, but I was also waking up at night with terrible sweats and I had started to feel pretty rough.” Following his lung cancer diagnosis, Leo, of Irvine, North Ayrshire , started a combination of chemotherapy and radiotherapy to shrink the tumour ahead of surgery, but the chemotherapy had to be stopped after he suffered a mild stroke. He continued with radiotherapy and had an operation in March 2015 – but surgeons decided not to remove the rest of the tumour as it was too close to a major artery. CONTACT YOUR GP DR Douglas Rigg, GP & Co-chair of the Scottish Primary Care Cancer Group urged anyone worried about persistent symptoms that are unusual for them to contact their GP practice – and let them help. He said: “Have you noticed unexplained weight loss or bleeding, or an unusual lump maybe? Has something been worrying you that doesn’t feel right? “Don't try to ignore it, be worried about bothering your doctor or feeling embarrassed. Your GP practice want to know. “For most people it won't be anything serious, such as cancer, but even if it is, finding cancer earlier can mean more treatments are available, giving you a better chance of living well again. “So please contact your GP practice and let us help you.” Acting on unusual, persistent symptoms as early as possible can save lives. Here are some of the key signs and symptoms to be aware of, but if you notice any persistent changes that are not on this list, contact your GP practice. In most cases these symptoms will be caused by something less serious than cancer, but it’s best to get checked: ● Very heavy night sweats ● Fatigue ● Unexplained bleeding or bruising ● Unexplained pain or ache ● Unexplained weight loss ● An unusual lump or swelling anywhere on your body ● A new mole or changes to a mole ● Skin changes or a sore that won’t heal To understand more about possible symptoms, visit the symptom checker at getcheckedearly.org He said: \"The treatment left me very weak and the recovery was harder than I expected, but I made a conscious decision to reduce the painkillers, work on my fitness and get my life back.” Leo started walking , then cycling , to get his fitness back and by 2017 he was on the circuit, working as a professional snooker referee again. He was regularly monitored and, in December 2019, he was given the news that the cancer was in remission, five years after diagnosis. Read more on the Scottish Sun TOP THAT I tried H&M's viral £7 Skims dupe - it's so sculpting and you don't need a bra HI SOCIETY I'm an etiquette pro & here's the correct way to greet people, Queen swore by it That same year he officiated his first World Championship final. Leo said: “I feel very lucky I got diagnosed when I did. If you are worried about unusual, persistent symptoms, contact your GP practice now – don’t leave it, get it checked out.” 5 Alan, pictured in his Celtic days, thought he was invincible 5 Leo Scullion is in remission from lung cancer 5 The ref officiated his first World Championship final in 2019","pubDate":"2023-09-26 10:04:38","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"94aee43a5d1cb5cec0f784452ff35ec0","title":"Alan Shearer’s glam daughter Hollie sends fans wild in see-through lace outfit as they say ‘looking amazing’","link":"https://www.thescottishsun.co.uk/sport/football/11288389/alan-shearer-daughter-hollie-instagram-paris/","keywords":["Football","Sport","Female Sport Influencers"],"creator":["Ciaran Wiseman"],"video_url":null,"description":null,"content":"HOLLIE SHEARER has sent her fans wild by posing in a see-through lace outfit. The singer-songwriter had her followers saying she was \"looking amazing\" after he latest Instagram upload. 7 Hollie Shearer sent her fans wild in a see-through lace outfit Credit: Instagram @hollieshearer 7 Hollie's fans were left saying she was 'looking amazing' Credit: Instagram @hollieshearer 7 Hollie wowed as she relaxed outside a café in Paris Credit: Instagram / @hollieshearer Hollie , who is the daughter of Premier League legend Alan Shearer, shared a pair of snaps as she relaxed outside a café in Paris. She stunned in a see-through white lace top whilst looking off into the distance in the candid snaps. Along with the top, Hollie completed her look with a pair of brown trousers, captioning the post: \"Coffee Stop.\" Hollie's fans were left in awe in the comments section, with one follower writing: \"Elegant and classy.\" Another also wrote: \"Looking amazing.\" Meanwhile, a third fan added: \"Stunning Hollie.\" The 28-year-old regularly treats her 83,700 Instagram followers to stunning snaps from her life and travels. She often showed off her tan over the summer as she relaxed in several striking bikinis whilst on holiday. Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed 7 The singer-songwriter is the daughter of ex-footballer Alan Shearer Credit: Instagram 7 Hollie has over 80,000 Instagram followers Credit: instagram @hirestreetuk Hollie also celebrated her sister Chloe's 31st birthday in Paris earlier this month. She recently moved to the city after her rugby star boyfriend Joe Marchant signed for French side Stade Francais. The former Harlequins centre will join up with his new team after the Rugby World Cup in France, where he has been starring for England. Hollie has been amongst the Wags cheering on Steve Borthwick's side and was pictured in the crowd at their group stage win over Argentina. 7 Hollie's fans are often treated to stunning bikini snaps on social media Credit: Instagram @hollieshearer 7 The 28-year-old is dating England rugby star Joe Marchant Credit: instagram @hollieshearer","pubDate":"2023-09-26 09:55:04","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"af7c2accaeaddc2817b6b8c4fc633dc9","title":"Son Heung-min awkwardly corrected on live TV by journalist for saying Tottenham team-mate’s name wrong","link":"https://www.thescottishsun.co.uk/sport/football/11288353/son-heung-min-awkward-tottenham-team-mates-name-wrong/","keywords":["Football","Sport"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"SON HEUNG-MIN was awkwardly caught out by a journalist for saying one of his team-mate's names wrong. The Tottenham star was talking to a reporter following the North London derby against Arsenal . 2 Son Heung-min was corrected about the pronunciation of a team-mates name Credit: Reddit 2 Son was incorrectly saying Micky van de Ven's name Credit: Getty Son , 31, was interrupted during the interview and explained to someone off-camera that he and the journalist were talking \"about Micky van de Vick\". To which the interviewer then questioned the attacker saying: \"How do you pronounce it?\" To which Son replied \"Micky van de Vick\" for a second time. The journalist then showed Son the correct pronunciation and said: \" Micky van de Ven we say, with an N\". Son then responded saying \"Van de ven, wow.\" Van de Ven joined Tottenham in the summer from Wolfsburg and has become a member of the first team under manager Ange Postecoglou. The Dutch defender has made six appearances in the Premier League and one in the Carabao Cup. Van den Ven cost Tottenham £43million when he joined the club . Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed FREE BETS - BEST BETTING OFFERS AND BONUSES NEW CUSTOMERS Son was named captain of the club in the summer after the armband was taken away from Hugo Lloris. He has been in good form so far this season having already scored five goals in the Premier League. The South Korean star most recently netted a brace against Arsenal in the North London derby. The game ended 2-2 as Spurs came from behind twice to earn a point from their fierce rivals.","pubDate":"2023-09-26 09:50:13","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0de8c7a034620becbf6a4662b9d6e0d0","title":"Football club boss gunned down by hired killers on bikes in front of daughter just hours after his side is beaten 3-2","link":"https://www.thescottishsun.co.uk/sport/football/11288299/football-club-boss-shot-daughter-loss-edgar-paez/","keywords":["Football","Sport","Crime","Police"],"creator":["Sarah Hooper"],"video_url":null,"description":null,"content":"A COLOMBIAN football club boss was gunned down in front of his daughter only hours after his team was defeated on the pitch. 63-year-old Edgar Paez, president of the Tigres Football Club, was returning home with his daughter when two men on a motorbike carried out the horror attack. 2 Paez, President of the Tigres Football Club, was gunned down in the senseless attack Credit: Tigres FC 2 The club had just been knocked to the bottom of their league following a loss Credit: Tigres FC Colombian National Police revealed the footy boss suffered three fatal gunshot wounds nearby the stadium around 6:15pm on Saturday. His daughter escaped unscathed, but Paez died of his injuries before reaching a nearby hospital. Paez's team had just been knocked to the bottom of their 16-team league after a 3-2 defeat earlier in the day - though it is unknown if the loss was related to the murder. Police are currently investigating the murder as tributes have poured in for the football figurehead. Tigres FC released a statement reading: \"The Tigres family and the sporting community are devastated by this event. \"His commitment to the team and his dedication to the development of the sport in our region left an indelible mark on all who had the privilege of knowing him.\" The President of the Major Division of Colombian Professional Football, Fernando Jaramillo, said: \"He was always distinguished by his respect for his friends, by his strong but respectful positions and by the love he professed for the sport that we are all passionate about: football.\" Paez formerly directed Independiente Santa Fe, another football team based out of Bogota. Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed A moment of silence will be held in memory of Paez in the next two matches played by Colombian teams. Further questions about the circumstances of Paez's death have continued to flood in in recent days. One Twitter user said: \"The murder of Paez should immediately cancel this championship. An unprecedented setback. What dark interests are behind it?\" Another user added: \"It is unfortunate that these types of incidents persist in Colombian sports.\" One passionate Colombian footy fan shared: \"In a decent country, the championship would have been suspended. \"May the murder of the president of Tigres be clarified and justice be done.\" In 2019, a South African football manager was shot dead outside of his stadium in a \"spray of bullets.\" Siphiwo \"Mawawa\" Nyobo had just finished watching a match in East London, in Eastern South Africa. He was boss of team Tornado FC and said to be a “prominent businessman” in the city.","pubDate":"2023-09-26 09:42:47","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"854410b89bc71f676267c90fc49ce3bf","title":"Los Madrid Bravos, el equipo de la capital de fútbol americano","link":"https://www.marca.com/otros-deportes/2023/09/26/6512b32ce2704e553c8b4597.html","keywords":["Polideportivo","Otros Deportes","Fútbol americano"],"creator":["EUGENIO MUÑOZ"],"video_url":null,"description":null,"content":"Fuerza, bravura, lucha y victoria\". Es el mensaje de presentación de una realidad. Los en la European Football League -principal competición de fútbol americano en el 'Viejo Continente'-, desveló su identidad que la definirá. Rojo, blanco y detalles inconfundibles. Existen equipos repartidos por las principales categorías nacionales (LG Oled Las Rozas Black Demons, Osos Rivas y Camioneros de Coslada), y los Bravos dan el siguiente paso para competir en una liga que reúne a las principales ciudades europeas. Desde los siempre favoritos alemanes (Berlin Thunder, Cologne Centurions, Frankfurt Galaxy...) hasta el gran rival, los míticos Barcelona Dragons. Su color, a falta de conocer cómo serán sus equipaciones, partirá del rojo . \"Es más que una simple pieza de protección. Un símbolo de valentía, coraje y poder\", cuentan en su presentación. Además de unirlo a un mensaje que se difunde desde la EFL: \"Estampida a la victoria\". La unión entre Madrid y el fútbol americano es un paso lógico entre una ciudad con base de aficionados y estructuras con potencial. . \"Tienen gran ambición y España cuenta con jugadores del primer nivel para la liga\", agregó Patrick Esume, Comisionado de la competición. Pelearán con los míticos Barcelona Dragons por ser el estandarte del fútbol americano español. La mítica franquicia de la Ciudad Condal alcanzó momentos dorados en la segunda mitad de la década de los 90.","pubDate":"2023-09-26 10:32:35","image_url":"https://phantom-marca.unidadeditorial.es/dfb6cf2492e79af76347da2f0a833f9b/resize/600/assets/multimedia/imagenes/2023/09/26/16957231469308.jpg","source_id":"marca","source_priority":426,"country":["colombia"],"category":["sports"],"language":"spanish"},{"article_id":"0b3e631ff30ebf3db0a30ee6759250de","title":"An Analysis Of The Global Sports Betting Market","link":"https://www.completesports.com/an-analysis-of-the-global-sports-betting-market/","keywords":["Back Pass","Artificial Intelligence","Betting Market","Global Sports","iGaming","Sports Betting"],"creator":["Solomon Ojeagbase"],"video_url":null,"description":"Sports betting has never been as big as today and depending on your region you will be able to make your bets on sports in land based settings and online platforms. Digitalisation backed up by technological developments have contributed to online bookmakers being able to offer an enjoyable and safe betting experience to their customers. The global sports betting market is responsible for a value of U$ 83.65 million in 2022 and is expected to keep on growing 10.3% until 2030. This makes the global sports betting market one of the most interesting industries when it comes to the numbers. In this article, we’ll give you an in-depth analysis of the global sports betting market and what has driven its success. Main Drivers The growth of the global sports betting market is mainly driven by the overall enhancement of the online infrastructure and the more flexible regulatory landscape of the gambling industry in many regions around the world. In addition, the widespread availability of sports events such as the World Cup Football, the Champions League, and the Olympic Games has attracted new users and positively influenced the demand for betting products. The integration of Artificial Intelligence and blockchain technologies will contribute to the prediction algorithms in software and boost the growth of the global sports betting market in the next decade. A further boost will depend on the developments of disposable income. Technology is one of the most important drivers for today’s success of sports betting as an entertainment activity with advanced encryption protocols, optimised payment infrastructure, and the latest identity verification systems, making it possible that personal and financial data of registered customers is kept safe. Also, regulatory bodies and licensing authorities have contributed to the safety of the industry by coming up with responsible play policies, tools for age verification, and other measures to keep problem gambling as low as possible. This has made it possible to offer a regulated environment for sports betting, building trust, and confidence amongst players. With mobile optimised sites available globally, players can make their wagers anywhere and anytime, as long as they have access to the internet and credits. Increasing Legalisation The relaxation of governments around the world towards betting has made it possible to regulate betting activities across the globe. For many governments, legalising sports betting is a way to offer consumer protection from illicit websites, but it is also considered a lucrative opportunity that adds to the treasury department through gambling taxes. In most countries in the European Union, gambling is now legal, with more and more countries/regions in North and South America opting for the legalisation of sports betting. The United States, Canada, and LatAm are expected to contribute to the global growth of sports betting. Online casinos sites have yet not been legalised in many states in the US, but when this happens, this will lead to another boost of the iGaming market. Regional Contributions Still, Europe accounts for the largest market share for sports betting of over 35% in 2022. The region is expected to expand at nearly 10% until the year 2030. In most European countries, governments have a liberal approach towards gambling with some nations having legalised betting a long time ago. In the United Kingdom, sports betting was legalised in 1960 and is now home to one of most developed laws that allow legal sports betting. Stricter rules for advertisements have been announced though in the UK. The online sports betting segment has shown sizable growth across Europe owing to retail betting activities, reaching a market size of over US $ 40 billion until the year of 2030. Asia is also likely to show growth at a percentage of 11% until 2030. The most significant factor contributing to the sports betting market development in Asia is the increasing percentage of the population getting access to different sports betting activities on the internet. Also, several countries in the region have started to legalise the gambling industry by either offering it to local citizens or opening the market for overseas players. Related: Navigating The Sports Betting Landscape: Strategies For Success eSports Interestingly, eSports have highly contributed to the industry’s growth. This particular segment is expected to show a growth of 12% and stay one of the most dominant drivers. The growth of this category can also be attributed to the availability of mobile phones, live streaming, and increasing internet infrastructure worldwide. With multiplayer games and major eSports events organised in many countries around the world, eSports have grown to an important industry. The eSports betting segment currently has the highest growth rate of all categories and is set at a 14% growth rate until 2030. eSports will most likely have a major significant contribution in regions where the activity has not developed as much as in leading countries. eSports is particularly popular in Asia with Europe as a solid number two. Technological Developments Today, 60% of the population in the world enjoys internet access. The most important companies in the sports betting markets focus on their online offer rather than on offline products. This has led to operators developing high-end websites and coming up with a wide range of bonuses in order to get to a competitive edge in the market. Online gambling companies have been focusing on integrating technologies such as APIs to enhance functionalities and come up with a simplified user interface. In addition, the main competitors on the market have been working together on product enhancements and the joint creation of new revenue streams. With the introduction of AI and machine learning algorithms, betting companies are better able to thoroughly analyse vast amounts of data as well as player stats and present a convincing base for players to use for their own activities. These also come up with more accurate odds and predictions as well as tailor-made bonuses, promotions, and other deals. Today’s world is data driven and this in particular makes a vast contribution to the game experience of players, giving them all the tools and data to make carefully based decisions. Smartphones and mobile technology have of course also played a role in consumers getting access to sports betting products. Both mobile apps and responsive websites have made it easier than ever for enthusiasts to place bets anywhere and at any time. Sport book lobbies and other supporting pages such as the banking page have all been adapted to the growing group of mobile users. Faster internet connections and larger data packs have made it possible for players to have a smooth experience, enjoy the very best graphics and make it possible to make real-money wins. Conclusion In the ever evolving landscape of global sports betting, the industry has shown to be a lucrative and fun activity combining both real money gains and entertainment. Online sports betting has been a major driver for the industry, relying, or getting the most out of the power of the internet. Developments in terms of regulation and the introduction of advanced AI and other technologies in betting software has made it easier for bookmakers and other gambling websites to present prediction algorithms, helping the industry to target players, offering them high-end and smooth real-time platforms for betting. The industry has grown in recent years, thanks to online betting in particular and an increasing number of regulatory bodies legalising sports betting. Amongst the different segments available, eSports have shown to be highly sought after, offering new opportunities for the betting industry. Online operators have been more than willing to include eSports in their lobby and have looked out for technological developments to be able to do so. This has even led to joint developments with stakeholders such as payment providers making it possible to streamline their solutions to offer players an A to Z solution. The post An Analysis Of The Global Sports Betting Market appeared first on Complete Sports.","content":"Sports betting has never been as big as today and depending on your region you will be able to make your bets on sports in land based settings and online platforms. Digitalisation backed up by technological developments have contributed to online bookmakers being able to offer an enjoyable and safe betting experience to their customers. The global sports betting market is responsible for a value of U$ 83.65 million in 2022 and is expected to keep on growing 10.3% until 2030. This makes the global sports betting market one of the most interesting industries when it comes to the numbers. In this article, we’ll give you an in-depth analysis of the global sports betting market and what has driven its success. The growth of the global sports betting market is mainly driven by the overall enhancement of the online infrastructure and the more flexible regulatory landscape of the gambling industry in many regions around the world. In addition, the widespread availability of sports events such as the World Cup Football, the , and the Olympic Games has attracted new users and positively influenced the demand for betting products. The integration of and blockchain technologies will contribute to the prediction algorithms in software and boost the growth of the global sports betting market in the next decade. A further boost will depend on the developments of disposable income. Technology is one of the most important drivers for today’s success of sports betting as an entertainment activity with advanced encryption protocols, optimised payment infrastructure, and the latest identity verification systems, making it possible that personal and financial data of registered customers is kept safe. Also, regulatory bodies and licensing authorities have contributed to the safety of the industry by coming up with responsible play policies, tools for age verification, and other measures to keep problem gambling as low as possible. This has made it possible to offer a regulated environment for , building trust, and confidence amongst players. With mobile optimised sites available globally, players can make their wagers anywhere and anytime, as long as they have access to the internet and credits. The relaxation of governments around the world towards betting has made it possible to regulate betting activities across the globe. For many governments, legalising sports betting is a way to offer consumer protection from illicit websites, but it is also considered a lucrative opportunity that adds to the treasury department through gambling taxes. In most countries in the European Union, gambling is now legal, with more and more countries/regions in North and South America opting for the legalisation of sports betting. The United States, Canada, and LatAm are expected to contribute to the global growth of sports betting. Online casinos have yet not been legalised in many states in the US, but when this happens, this will lead to another boost of the iGaming market. Still, Europe accounts for the largest market share for sports betting of over 35% in 2022. The region is expected to expand at nearly 10% until the year 2030. In most European countries, governments have a liberal approach towards gambling with some nations having legalised betting a long time ago. In the United Kingdom, sports betting was legalised in 1960 and is now home to one of most developed laws that allow legal sports betting. Stricter rules for advertisements have been announced though in the UK. The online sports betting segment has shown sizable growth across Europe owing to retail betting activities, reaching a market size of over US $ 40 billion until the year of 2030. Asia is also likely to show growth at a percentage of 11% until 2030. The most significant factor contributing to the sports betting market development in Asia is the increasing percentage of the population getting access to different sports betting activities on the internet. Also, several countries in the region have started to legalise the gambling industry by either offering it to local citizens or opening the market for overseas players. Interestingly, eSports have highly contributed to the industry’s growth. This particular segment is expected to show a growth of 12% and stay one of the most dominant drivers. The growth of this category can also be attributed to the availability of mobile phones, live streaming, and increasing internet infrastructure worldwide. With multiplayer games and major eSports events organised in many countries around the world, eSports have grown to an important industry. The eSports betting segment currently has the highest growth rate of all categories and is set at a 14% growth rate until 2030. eSports will most likely have a major significant contribution in regions where the activity has not developed as much as in leading countries. eSports is particularly popular in Asia with Europe as a solid number two.","pubDate":"2023-09-26 10:30:42","image_url":null,"source_id":"completesports","source_priority":44611,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"b6ab01d9f53b0b33cada8a386b824b31","title":"NPFL Announces Kick-Off Date For 2023/24 League Season","link":"https://newtelegraphng.com/npfl-announces-kick-off-date-for-2023-24-league-season/?utm_source=rss&utm_medium=rss&utm_campaign=npfl-announces-kick-off-date-for-2023-24-league-season","keywords":["Sports","AFCON qualifier: CAF bars media","FIFA","NPFL"],"creator":["Boma Achenimie"],"video_url":null,"description":"After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30. Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in... The post NPFL Announces Kick-Off Date For 2023/24 League Season appeared first on New Telegraph.","content":"<div class=\"entry-content clearfix\"> <p>After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30.</p> <p>Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in Ibadan.</p> <p>The league’s start date was delayed once more due to a number of reasons, including the need to install the AI cameras needed to stream the games and train the staff on how to operate them.</p><div class=\"newte-inside-posts\" id=\"newte-1748048299\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6244403671\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>Before the league body officially chose September 30 as the new date for the start of the 2023–2024 NPFL season it was delayed for over three weeks.</p> <p>The games will still be televised online via the recently opened NPFL Live.</p> <p><strong>READ ALSO:</strong></p> <ul> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-gti-thumbs-up-rangers-commercialisation-initiative/\">NPFL: GTI Thumbs Up Rangers Commercialisation Initiative </a></span></li> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-gti-tasks-investors-on-elite-club-ownership/\">NPFL: GTI Tasks Investors On Elite Club Ownership </a></span></li> <li class=\"\"><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://newtelegraphng.com/npfl-championship-playoff-supporters-in-a-contest-of-songs/\">NPFL Championship Playoff: Supporters in a contest of songs</a></span></li> </ul> <p>In a circular issued to all the clubs and signed by the league’s chief operational officer, Davidson Owumi, the NPFL board announced that the league would commence to secure the agreements that led to its postponement.</p><div class=\"newte-inside-posts_2\" id=\"newte-1137581551\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6244403671\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>The circular revealed that the prize money has increased from N100 million to N150 million and a take-off fund of N10 million will be given to each of the league’s 20 clubs.</p> <p>The circular reads in parts, “The 20 clubs will, as was done last season, receive a take-off grant of N10m each to smoothen your operations as the season starts.</p><div class=\"newte-content\" id=\"newte-1262978785\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-4000354584205076\" crossorigin=\"anonymous\"></script><ins class=\"adsbygoogle\" style=\"display:block;\" data-ad-client=\"ca-pub-4000354584205076\" data-ad-slot=\"6530340984\" data-ad-format=\"auto\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> </div> <p>“We are, therefore, expecting all the clubs to as a matter of urgency forward their respective account details to the NPFL secretariat for the transfer of the said amount as the season is set to commence on Saturday, September 30.”</p> <div id=\"jp-relatedposts\" class=\"jp-relatedposts\"> <h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3> </div> </div> After the two postponements, the Nigeria Premier Football League (NPFL) for 2023–2024 will finally start on Saturday, September 30. Remember that the new season was supposed to start on August 26. However, it was moved to September 9. Then, it was intended to start the new campaign with the 3SC vs. Plateau United match in Ibadan. The league’s start date was delayed once more due to a number of reasons, including the need to install the AI cameras needed to stream the games and train the staff on how to operate them. Before the league body officially chose September 30 as the new date for the start of the 2023–2024 NPFL season it was delayed for over three weeks. The games will still be televised online via the recently opened NPFL Live. In a circular issued to all the clubs and signed by the league’s chief operational officer, Davidson Owumi, the NPFL board announced that the league would commence to secure the agreements that led to its postponement. The circular revealed that the prize money has increased from N100 million to N150 million and a take-off fund of N10 million will be given to each of the league’s 20 clubs. The circular reads in parts, “The 20 clubs will, as was done last season, receive a take-off grant of N10m each to smoothen your operations as the season starts. “We are, therefore, expecting all the clubs to as a matter of urgency forward their respective account details to the NPFL secretariat for the transfer of the said amount as the season is set to commence on Saturday, September 30.”","pubDate":"2023-09-26 10:26:31","image_url":null,"source_id":"newtelegraphng","source_priority":447614,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"f64d6a526bf329eb9a2eab7329ccc814","title":"Gift Orban Handed Two-Match Ban After Debut Red Card","link":"https://tdpelmedia.com/gift-orban-to-pay-e1500-fine-in-belgium/","keywords":["Sports News","Nigeria"],"creator":["Funmilayo Salau"],"video_url":null,"description":"Gift Orban Handed Two-Match Ban After Debut Red Card Nigerian forward Gift Orban, plying his trade for KAA Gent, has been hit with a two-match The post Gift Orban Handed Two-Match Ban After Debut Red Card appeared first on TDPel Media.","content":"Nigerian forward Gift Orban, plying his trade for KAA Gent, has been hit with a two-match suspension after receiving a red card during a recent game against KAS Eupen. This incident marks Orban’s first red card as a professional footballer and has raised significant consequences for both him and his team. During the match between Gent and Eupen in the Belgian Pro League, a pivotal moment unfolded in the 45th minute. Referee intervention and a subsequent VAR review confirmed Orban’s dismissal for elbowing Rune Paeshuyse in the neck during an off-the-ball incident. This act of aggression warranted a straight red card for the young player. Despite the gravity of the offense, Gift Orban received a relatively lenient punishment due to it being his first red card in his professional career. Had he been penalized for acting violently, the suspension would have extended over multiple games. However, his clean disciplinary record worked to his advantage in this instance. The Belgian Football Association issued a statement clarifying the nature of the offense as “physical misconduct,” specifically describing it as a “brutal push with high intensity.” Consequently, a minimum suspension of two matches was deemed appropriate, in accordance with the indicative table for such infractions. Additionally, a fine of 1,500 euros was imposed. KAA Gent, Orban’s club, announced that they would consider any recommendations for a peaceful resolution and will decide on the final sanction on September 26, 2023. The incident and its repercussions come at a time when the player has been grappling with fitness issues and form challenges. Orban’s suspension will entail missing the league match against reigning champions Antwerp. Furthermore, the financial penalty adds to the consequences of his actions. The young Super Eagles invitee, who missed a recent Africa Cup of Nations qualification game due to fitness issues, will need to reflect on this episode as he aims to regain his form and contribute positively to his team’s performance in future matches.","pubDate":"2023-09-26 10:23:03","image_url":null,"source_id":"tdpelmedia","source_priority":27640785,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"c67683328c4f51cfd3a558ee61b336ef","title":"Harvey Barnes injury update with £38m transfer set to be out for ‘months’ in huge Newcastle blow","link":"https://www.thescottishsun.co.uk/sport/football/11288478/harvey-barnes-injury-update-newcastle/","keywords":["Football","Sport"],"creator":["Oscar Paul"],"video_url":null,"description":null,"content":"NEWCASTLE winger Harvey Barnes is facing months on the sidelines with a \"substantial\" foot injury. Toon’s new winger, signed from Leicester for £38million , was forced off just 11 minutes into last Sunday’s 8-0 demolition of Sheffield United. 3 Harvey Barnes limped off injured during Newcastle’s 8-0 mauling of Sheffield United Credit: Getty 3 Barnes joined the Magpies from Leicester this summer Credit: Getty And Barnes, 25, could now face surgery in what is a major early blow to his Magpies career. Newcastle boss Eddie Howe said: “I think it is an injury to the lower part of his foot just below the toe. It is quite a substantial injury. “We’ve had it scanned and we are waiting on what’s next, whether there’s surgery or not. “I don’t think it was from a tackle, it was just pushing off to run, very unlucky. “We are fearing - and I don’t want to put a time on it until we’ve seen the specialist - that’ll be weeks rather than months.” The Mags face Manchester City tomorrow in the Carabao Cup, with Howe set to rotate his squad with Burnley at home in the Prem on Saturday before hosting PSG in the Champions League next Wednesday. He added: “There are a couple of players carrying certain injuries. “We do have players that are really keen to play and show what they can do. We will have to utilise the squad, especially with what we have coming up next week.” Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed CASINO SPECIAL - BEST CASINO WELCOME OFFERS Newcastle had a tough start to their Prem campaign with matches against Man City, Liverpool and Brighton all in their first five fixtures of the season. But after their challenging run they will be full of confidence heading into a run of winnable league games after their 8-0 masterclass at the weekend. 3 Newcastle netted eight time as they breezed past Sheffield United on Sunday Credit: Getty","pubDate":"2023-09-26 10:08:55","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3f5cafd3e5c3757c96ee7a15cc9e9506","title":"FG intensifies lobby to host AFCON as Sports Minister, NFF officials storm Egypt","link":"https://blueprint.ng/fg-intensifies-lobby-to-host-afcon-as-sports-minister-nff-officials-storm-egypt/","keywords":["Sports","AFCON","FEDERAL GOVERNMENT"],"creator":["Editor"],"video_url":null,"description":"The Minister of Sports Development, Senator John Owan Enoh, will be attending the Confederation of African Football Executive Committee meeting in Cairo, Egypt, as the nation solidifies its bid to host the African Cup of Nations (AFCON) tournament for the first time since 1980. Nigeria and the Republic of Benin presented a joint bid to host the tournament. The Minister Read More The post FG intensifies lobby to host AFCON as Sports Minister, NFF officials storm Egypt appeared first on Blueprint Newspapers Limited.","content":"The Minister of Sports Development, Senator John Owan Enoh, will be attending the Confederation of African Football Executive Committee meeting in Cairo, Egypt, as the nation solidifies its bid to host the African Cup of Nations (AFCON) tournament for the first time since 1980. Nigeria and the Republic of Benin presented a joint bid to host the tournament. The Minister and the leadership of Nigeria Football Federation, (NFF) will be attending the meeting as representatives of the Federal Government of Nigeria. During the meeting, Nigeria will make its presentation to the Executive Committee of CAF in Cairo, Egypt. Senator Owan Enoh is attending the meeting alongside top members of the Nigeria Football Federation. All countries who submitted bids to host the AFCON tournament in 2025 and 2027 respectively are expected to attend the meeting during which the Independent Assessment Committee of CAF will submit their reports for assessment and discussions by CAF Exco. The CAF team had previously visited Nigeria to assess facilities at different proposed host venues around the nation. The Nigerian delegation includes the Permanent Secretary, Federal Ministry of Sports Development, Alhaji Ismaila Abubakar, President of the Nigeria Football Federation (NFF), Alhaji Ibrahim Gusau, General Secretary of the NFF, Dr. Mohammed Sanusi and bid coordinator, Mallam Mainasara Ilo. Nigeria will make a 10-minute presentation to the CAF exco, and thereafter will be allocated time to answer questions from its presentation. The meeting will hold on Wednesday, September 27, 2023.","pubDate":"2023-09-26 10:05:41","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"2f381ded42fcbc7970f393f80d7b7f91","title":"Ex Celtic ace said a random drug test saved his life after he ignored symptoms","link":"https://www.thescottishsun.co.uk/sport/football/11261550/celtic-ace-random-drug-test-saved-life-cancer/","keywords":["Football","Sport","Cancer (disease)","NHS","Scottish Premiership"],"creator":["Lynn Kernan"],"video_url":null,"description":null,"content":"FORMER Celtic ace Alan Stubbs reckons football saved his life – because a random drug test found he had testicular cancer. The spot check – after the Hoops lost the Scottish Cup final to Rangers in 1999 – showed traces of a hormone found only in pregnant women and men with a malignant growth. 5 Alan said no one should worry in silence 5 The Scottish Government is calling for Scots to 'Be the Early Bird' Celtic ace Alan, then 28, had felt a hardness in one of his testicles, as well as pain and numbness, but convinced himself that it would be ok - the test revealed otherwise. The top-flight defender had surgery within a week and was soon back on the pitch, but two years later doctors found another tumour on his spine during routine checks. After chemotherapy and a nine-hour operation , he made a full recovery and has been living well ever since. Alan, 51, said: “I don’t think I’d still be here if I hadn’t had that drug test.\" The sportsman is speaking out as The Scottish Government calls for people to ‘be the early bird’ and contact their GP practice if they have unusual, persistent symptoms that are not normal for them. READ MORE IN HEALTH BATS AMAZING! Bats could hold vital clues to beating cancer, study reveals get checked Chris Evans shows off scar as he issues health update after cancer scare Finding cancer earlier is really key to maximising your treatment options and means you’re more likely to live well again after treatment. So, whether it is you who has possible symptoms, or you are worried about a family member or friend, your GP practice wants to know. Alan said: \"I’d have carried on telling myself that it would be ok, that I was invincible and that footballers don’t get cancer. “I chose to ignore my symptoms, rather than confront them. “I was very, very fortunate – if it had been left any longer it might have spread, and it could have been too late.” Most read in Football WHO'S THAT GER? Rangers fans stumped as hero posts legends pic and mystery 'fifth player' FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move SHELF LIFE Famous Scottish stadium has been Morrisons for 20 years but footy past lives on Alan, who is now Director of Football at a school near his home in Formby, Liverpool , went on to play for Everton and later led Hibs to their first Scottish Cup victory in 114 years in 2016. Today, more than 20 years on, he is still cancer free – but checks himself every couple of days for peace of mind. He added: “I’d say to anyone worried about persistent, unusual symptoms, ‘Don’t worry in silence, go and get checked’. “Every day you wait, hoping it will be ok, is a day from potentially being on the road to recovery.” Snooker referee Leo Scullion was diagnosed with lung cancer in July 2014, his first thought was that it could be terminal – but nine years later he is in remission and is refereeing the British Open at Cheltenham. He is proof that, if cancer is diagnosed early, it boosts the range of treatment options and means you are more likely to live well again. Like lots of us might do, Leo initially ignored the signs that something wasn’t right but, when a player at a snooker event in China noticed that he’d lost a lot of weight , and another colleague urged him to stop smoking because of a persistent cough, he knew he had to contact his GP practice. He explained: “I knew I was coughing, but put it down to the smog, and the fact that I was a smoker, but I was also waking up at night with terrible sweats and I had started to feel pretty rough.” Following his lung cancer diagnosis, Leo, of Irvine, North Ayrshire , started a combination of chemotherapy and radiotherapy to shrink the tumour ahead of surgery, but the chemotherapy had to be stopped after he suffered a mild stroke. He continued with radiotherapy and had an operation in March 2015 – but surgeons decided not to remove the rest of the tumour as it was too close to a major artery. CONTACT YOUR GP DR Douglas Rigg, GP & Co-chair of the Scottish Primary Care Cancer Group urged anyone worried about persistent symptoms that are unusual for them to contact their GP practice – and let them help. He said: “Have you noticed unexplained weight loss or bleeding, or an unusual lump maybe? Has something been worrying you that doesn’t feel right? “Don't try to ignore it, be worried about bothering your doctor or feeling embarrassed. Your GP practice want to know. “For most people it won't be anything serious, such as cancer, but even if it is, finding cancer earlier can mean more treatments are available, giving you a better chance of living well again. “So please contact your GP practice and let us help you.” Acting on unusual, persistent symptoms as early as possible can save lives. Here are some of the key signs and symptoms to be aware of, but if you notice any persistent changes that are not on this list, contact your GP practice. In most cases these symptoms will be caused by something less serious than cancer, but it’s best to get checked: ● Very heavy night sweats ● Fatigue ● Unexplained bleeding or bruising ● Unexplained pain or ache ● Unexplained weight loss ● An unusual lump or swelling anywhere on your body ● A new mole or changes to a mole ● Skin changes or a sore that won’t heal To understand more about possible symptoms, visit the symptom checker at getcheckedearly.org He said: \"The treatment left me very weak and the recovery was harder than I expected, but I made a conscious decision to reduce the painkillers, work on my fitness and get my life back.” Leo started walking , then cycling , to get his fitness back and by 2017 he was on the circuit, working as a professional snooker referee again. He was regularly monitored and, in December 2019, he was given the news that the cancer was in remission, five years after diagnosis. Read more on the Scottish Sun TOP THAT I tried H&M's viral £7 Skims dupe - it's so sculpting and you don't need a bra HI SOCIETY I'm an etiquette pro & here's the correct way to greet people, Queen swore by it That same year he officiated his first World Championship final. Leo said: “I feel very lucky I got diagnosed when I did. If you are worried about unusual, persistent symptoms, contact your GP practice now – don’t leave it, get it checked out.” 5 Alan, pictured in his Celtic days, thought he was invincible 5 Leo Scullion is in remission from lung cancer 5 The ref officiated his first World Championship final in 2019","pubDate":"2023-09-26 10:04:38","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"94aee43a5d1cb5cec0f784452ff35ec0","title":"Alan Shearer’s glam daughter Hollie sends fans wild in see-through lace outfit as they say ‘looking amazing’","link":"https://www.thescottishsun.co.uk/sport/football/11288389/alan-shearer-daughter-hollie-instagram-paris/","keywords":["Football","Sport","Female Sport Influencers"],"creator":["Ciaran Wiseman"],"video_url":null,"description":null,"content":"HOLLIE SHEARER has sent her fans wild by posing in a see-through lace outfit. The singer-songwriter had her followers saying she was \"looking amazing\" after he latest Instagram upload. 7 Hollie Shearer sent her fans wild in a see-through lace outfit Credit: Instagram @hollieshearer 7 Hollie's fans were left saying she was 'looking amazing' Credit: Instagram @hollieshearer 7 Hollie wowed as she relaxed outside a café in Paris Credit: Instagram / @hollieshearer Hollie , who is the daughter of Premier League legend Alan Shearer, shared a pair of snaps as she relaxed outside a café in Paris. She stunned in a see-through white lace top whilst looking off into the distance in the candid snaps. Along with the top, Hollie completed her look with a pair of brown trousers, captioning the post: \"Coffee Stop.\" Hollie's fans were left in awe in the comments section, with one follower writing: \"Elegant and classy.\" Another also wrote: \"Looking amazing.\" Meanwhile, a third fan added: \"Stunning Hollie.\" The 28-year-old regularly treats her 83,700 Instagram followers to stunning snaps from her life and travels. She often showed off her tan over the summer as she relaxed in several striking bikinis whilst on holiday. Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed 7 The singer-songwriter is the daughter of ex-footballer Alan Shearer Credit: Instagram 7 Hollie has over 80,000 Instagram followers Credit: instagram @hirestreetuk Hollie also celebrated her sister Chloe's 31st birthday in Paris earlier this month. She recently moved to the city after her rugby star boyfriend Joe Marchant signed for French side Stade Francais. The former Harlequins centre will join up with his new team after the Rugby World Cup in France, where he has been starring for England. Hollie has been amongst the Wags cheering on Steve Borthwick's side and was pictured in the crowd at their group stage win over Argentina. 7 Hollie's fans are often treated to stunning bikini snaps on social media Credit: Instagram @hollieshearer 7 The 28-year-old is dating England rugby star Joe Marchant Credit: instagram @hollieshearer","pubDate":"2023-09-26 09:55:04","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"af7c2accaeaddc2817b6b8c4fc633dc9","title":"Son Heung-min awkwardly corrected on live TV by journalist for saying Tottenham team-mate’s name wrong","link":"https://www.thescottishsun.co.uk/sport/football/11288353/son-heung-min-awkward-tottenham-team-mates-name-wrong/","keywords":["Football","Sport"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"SON HEUNG-MIN was awkwardly caught out by a journalist for saying one of his team-mate's names wrong. The Tottenham star was talking to a reporter following the North London derby against Arsenal . 2 Son Heung-min was corrected about the pronunciation of a team-mates name Credit: Reddit 2 Son was incorrectly saying Micky van de Ven's name Credit: Getty Son , 31, was interrupted during the interview and explained to someone off-camera that he and the journalist were talking \"about Micky van de Vick\". To which the interviewer then questioned the attacker saying: \"How do you pronounce it?\" To which Son replied \"Micky van de Vick\" for a second time. The journalist then showed Son the correct pronunciation and said: \" Micky van de Ven we say, with an N\". Son then responded saying \"Van de ven, wow.\" Van de Ven joined Tottenham in the summer from Wolfsburg and has become a member of the first team under manager Ange Postecoglou. The Dutch defender has made six appearances in the Premier League and one in the Carabao Cup. Van den Ven cost Tottenham £43million when he joined the club . Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed FREE BETS - BEST BETTING OFFERS AND BONUSES NEW CUSTOMERS Son was named captain of the club in the summer after the armband was taken away from Hugo Lloris. He has been in good form so far this season having already scored five goals in the Premier League. The South Korean star most recently netted a brace against Arsenal in the North London derby. The game ended 2-2 as Spurs came from behind twice to earn a point from their fierce rivals.","pubDate":"2023-09-26 09:50:13","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0de8c7a034620becbf6a4662b9d6e0d0","title":"Football club boss gunned down by hired killers on bikes in front of daughter just hours after his side is beaten 3-2","link":"https://www.thescottishsun.co.uk/sport/football/11288299/football-club-boss-shot-daughter-loss-edgar-paez/","keywords":["Football","Sport","Crime","Police"],"creator":["Sarah Hooper"],"video_url":null,"description":null,"content":"A COLOMBIAN football club boss was gunned down in front of his daughter only hours after his team was defeated on the pitch. 63-year-old Edgar Paez, president of the Tigres Football Club, was returning home with his daughter when two men on a motorbike carried out the horror attack. 2 Paez, President of the Tigres Football Club, was gunned down in the senseless attack Credit: Tigres FC 2 The club had just been knocked to the bottom of their league following a loss Credit: Tigres FC Colombian National Police revealed the footy boss suffered three fatal gunshot wounds nearby the stadium around 6:15pm on Saturday. His daughter escaped unscathed, but Paez died of his injuries before reaching a nearby hospital. Paez's team had just been knocked to the bottom of their 16-team league after a 3-2 defeat earlier in the day - though it is unknown if the loss was related to the murder. Police are currently investigating the murder as tributes have poured in for the football figurehead. Tigres FC released a statement reading: \"The Tigres family and the sporting community are devastated by this event. \"His commitment to the team and his dedication to the development of the sport in our region left an indelible mark on all who had the privilege of knowing him.\" The President of the Major Division of Colombian Professional Football, Fernando Jaramillo, said: \"He was always distinguished by his respect for his friends, by his strong but respectful positions and by the love he professed for the sport that we are all passionate about: football.\" Paez formerly directed Independiente Santa Fe, another football team based out of Bogota. Most read in Football FERGUSON FOR BOSS Inverness set to name Premier League legend as new boss in Highlands INFERNO DRAMA Huge fire breaks out at hotel as emergency services race to seaside town NEW KIT? Steven Gerrard 'tries to tempt' key man from his Rangers spell in surprise move TRAGIC DISCOVERY Body found in Glasgow amid missing person search as family informed A moment of silence will be held in memory of Paez in the next two matches played by Colombian teams. Further questions about the circumstances of Paez's death have continued to flood in in recent days. One Twitter user said: \"The murder of Paez should immediately cancel this championship. An unprecedented setback. What dark interests are behind it?\" Another user added: \"It is unfortunate that these types of incidents persist in Colombian sports.\" One passionate Colombian footy fan shared: \"In a decent country, the championship would have been suspended. \"May the murder of the president of Tigres be clarified and justice be done.\" In 2019, a South African football manager was shot dead outside of his stadium in a \"spray of bullets.\" Siphiwo \"Mawawa\" Nyobo had just finished watching a match in East London, in Eastern South Africa. He was boss of team Tornado FC and said to be a “prominent businessman” in the city.","pubDate":"2023-09-26 09:42:47","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"}]}