{"newsArray":[{"article_id":"34d12e00dc90620c5ff8012dd9627294","title":"Host nations from UK, Ireland set to enter Euro 2028 qualifying","link":"https://www.malaymail.com/news/sports/2023/10/11/host-nations-from-uk-ireland-set-to-enter-euro-2028-qualifying/95568","keywords":["Euro 2028"],"creator":null,"video_url":null,"description":"LONDON, Oct 11 — England, Scotland, Wales, Northern Ireland and the Republic of Ireland will enter qualifying for Euro 2...","content":"LONDON, Oct 11 — England, Scotland, Wales, Northern Ireland and the Republic of Ireland will enter qualifying for Euro 2028 despite being named hosts, the head of the English Football Association (FA) said on Tuesday. Uefa awarded the tournament to the five-nation bid after it was unopposed, with Italy and Turkey agreeing to co-host the 2032 European Championship. However, not all the hosts will be guaranteed passage to the 24-team tournament, according to FA chief executive Mark Bullingham. Uefa are reportedly planning to reserve two spots for the best two performing host nations that fail to qualify. England have only failed to qualify once for the Euro since 1984, when it was a 16-team tournament in 2008. But making major tournaments has been a far tougher task for the other four hosts. Northern Ireland have only reached one European Championship in their history. Wales’ only two appearances in the competition have come since it was expanded to a 24-team tournament. Scotland’s qualification for Euro 2020 was their first for any major tournament since 1998, while the Republic of Ireland are currently ranked 55th in the world. “From our point of view, it’s great to be taking part in qualifying and we want to get everyone (all five nations) there,” Bullingham told Sky Sports. “It is better to play in a tournament where it matters and we have competitive games. We’re looking forward to that. “It’s always been part of our discussions with the other countries and Uefa that we would take part in qualifying. We think with the new format of European football that’s the right thing to do.” ‘Good partnership’ England is set to provide six of the 10 venues; Wembley and the Tottenham Hotspur Stadium in London, Manchester City’s Etihad Stadium, Newcastle’s St James’ Park, Villa Park in Birmingham and Everton’s new stadium in Liverpool. Belfast, Cardiff, Dublin and Glasgow will be the other host cities. “It’s a really good partnership. We know we’re going to have five games in Northern Ireland, six in Wales, Scotland and Ireland,” added Bullingham. “It’s brilliant those countries are going to get a significant portion of games, particularly if they end up with some of their own home games - it will really excite the countries.” Football Association of Wales chief executive Noel Mooney confirmed Cardiff was bidding to host the opening match. “Cardiff would be perfect for the opening match,” said Mooney. The Welsh capital, Glasgow, Dublin and Wembley are expected to be handed quarter-finals. However, there remain doubts about the proposed Belfast venue at Casement Park. Plans to redevelop the derelict site into a 34,000-capacity venue have been mired in controversy and hit by delays. Wembley is also set to host both semi-finals and final as it did at Euro 2020. The final two years ago was marred by scenes of violence as supporters stormed the gates to access the stadium. But Bullingham said Uefa had no hesitation in returning to the home of English football for a showpiece occasion. “They know we’ve spent a lot of money upgrading the stadium. They’re really confident we can deliver a brilliant Euros and that’s what we’ll do,” added Bullingham. — AFP","pubDate":"2023-10-10 23:57:58","image_url":null,"source_id":"malaymail","source_priority":105894,"country":["malaysia","singapore"],"category":["sports"],"language":"english"},{"article_id":"8f4a321c1bd579b3310e1b0f38418ede","title":"Has Joao Cancelo made Barcelona better? ","link":"https://www.barcablaugranes.com/2023/10/11/23911742/has-joao-cancelo-made-barcelona-better","keywords":null,"creator":["Nick Batlle"],"video_url":null,"description":null,"content":"This isn’t the same Barcelona that won La Liga a few months ago. That team was led by the heroics of Marc-Andre ter Stegen who tied Francisco Liano for the most clean sheets in Spanish history at 26. The German keeper played in front of a four-man backline that for the majority of the season used a center-back, Ronald Araujo or Jules Kounde, to neutralize dangerous counter attacks that plagued the team the year before. Playing this way wasn’t the plan. Understandably, Xavi wasn’t convinced by Sergino Dest or Sergi Roberto, and was quickly turned off by new signing Hector Bellerin. That left the manager with no choice but to improvise, which led him to realizing that Barcelona was actually quite well off with the defensive approach to the full-back position. No longer was Barcelona shaking their head, and lamenting unforced errors that were costing the team points in the past. It actually felt good to have a sense of calm and security in the back, which turned to excitement when Araujo started putting Vinicius Junior, and other world class wingers, in his pocket. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images If it weren’t for the injuries to these defenders during the Champions League group stage, it’s worth imagining what could have been. In the end, however, Barcelona did claim the league title as a result of their consistent defending, conceding only 20 goals, which is astonishing when you consider that the next best defensive team was Atletico Madrid who allowed 33. But all along, there was a sense that this approach couldn’t continue. As effective as it was, a Barcelona team needed to play like a Barcelona team, and that meant playing total football, which necessarily required attacking ability and skill from the full-backs. On the left side, Alejandro Balde revealed himself as a full-back of the future, but identifying a proven playmaker for the right side remained priority number one. Photo by Fran Santiago/Getty Images And so began mission Joao Cancelo, which was completed right before the close of the summer transfer window. Since his arrival, the Portuguese international has appeared in every game, and in every game, he has made his presence felt. Cancelo is not shy. He wants the ball, and when he has it, he has the confidence to make something happen. Xavi has given him the green light to read the game and express himself. The result has been dangerous balls that have led to assists and goals during clutch moments. With injuries to critical talent in the attack, Barcelona has relied on the creativity of Cancelo, and they are privileged to know if other injuries should occur, they have a versatile player on their hands who can step in and contribute at a high level. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images But the question remains whether Barcelona is a better team this year. In answering that question, Cancelo is front and center, because for better or worse, he is a focal point of this team from a tactical point of view. Ter Stegen has had early struggles, missing saves he would normally make, and looking shaky while playing out of the back. Against Granada, Jules Kounde was caught in a challenging, but manageable, one versus one situation. A battle he ultimately lost, with Barcelona giving up a second early goal. How much blame should be given to the keeper and center-backs? Have they let down the team? After all, this Barcelona squad has already surrendered 10 goals, which means they’re on track to allow in more than 40. In my opinion, Kounde has been excellent, and with Araujo, Andreas Christensen, and Inigo Martinez, Barcelona have enough talent on the backline to stabilize the defense going forward. I one hundred percent believe in Ter Stegen as well. Photo by Fran Santiago/Getty Images The problem is tactical in that Cancelo and Balde are playing high up the field. That means the team must be better on the ball. First order of business, limit the silly turnovers in the midfield. It’s not fair to point the finger at center backs when you’re asking them to constantly put out fires that shouldn’t be created in the first place. Second, Barcelona needs to be more dangerous in the way they attack if this is the approach they want to take. It doesn’t make sense to use extra playmakers if the team doesn’t attack better as a result of it. When you look at the evidence, this is a difficult assessment to make when considering Cancelo. He is definitely one of the most effective attacking players on the team, and Barcelona honestly seems to rely on him for their best moments high up the field. But his presence, with the way he likes to play, also makes the defense more vulnerable. You never know where he’s going to be at any point in time, which leaves a player like Kounde out on an island, especially when you aren’t playing with a true defensive midfielder to help out. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images So what’s the solution? Drop Cancelo all together, and replace him with Kounde or Araujo? Play him in a new position? Maybe as part of a double pivot with Oriol Romeu in a 3-2-4-1 a la Manchester City? Or continue as is with Cancelo playing full-back in the traditional 4-3-3? In the short term, the injury situation will limit Xavi’s choices. Surely, he’ll want Cancelo on the field, especially with El Clasico on the horizon. Real Madrid, however, are no longer playing 4-3-3 with traditional wingers. Does that change the calculation at all? Photo by Florencia Tan Jun/Getty Images These are big questions, and maybe the answer is to go back to what was working last season, especially if Kounde and Araujo willingly allow it. But that will also require players like Pedri, Frenkie de Jong, and Raphinha to get back from injury. In the meantime, regardless of who’s on the field, Barcelona need to be smart, and do the basic things right, regardless of their tactical approach. Take care of the ball. When in doubt, show you can keep it. Especially against teams that play in a low block. And when Cancelo is on the field, maybe their best defense is to press aggressively high up the field, and not rely so much on building from the back. Frankly, they need Frenkie and Pedri in order for that to be effective. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images Whatever approach they take, Xavi needs his men to be well drilled and focused on the mission. So far, it’s been inconsistent. Let’s hope they get healthy, and have a run of games to figure out who they are, and how they want to play. When in doubt, don’t forget what got you so far last season. As the saying goes, it’s the defense that wins championships.","pubDate":"2023-10-10 23:00:00","image_url":null,"source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"27f8097b5fad30ee3e0ee40db05b4ddb","title":"EFL Trophy: Derby County goalkeeper Josh Vickers returns with win after death of wife Laura","link":"https://www.newsr.in/n/Sports/1zpnzuphar/EFL-Trophy-Derby-County-goalkeeper-Josh-Vickers-returns.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Josh Vickers helps Derby County to victory in the EFL Trophy as he returns to football for the first time since the death of his wife. Reported by BBC Sport 2 hours ago.","content":"Tuesday, 10 October 2023 ( 3 hours ago ) Josh Vickers helps Derby County to victory in the EFL Trophy as he returns to football for the first time since the death of his wife. 👓 View full article","pubDate":"2023-10-10 22:00:55","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"711b52a61d8a1785e3299f05afff1790","title":"Papers: PL faces calls from clubs to respond to Israel-Hamas war","link":"https://www.skysports.com/football/news/20876/12982070/premier-league-faces-calls-from-clubs-to-provide-formal-response-to-israel-hamas-war-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Wednesday's newspapers...","content":"All the top stories and transfer rumours from Wednesday's newspapers... DAILY MAIL The Premier League is facing calls from clubs to provide a formal response to the outbreak of war in Israel, with executives at several of them unhappy at the sport's silence since last Friday's terrorist attack by Hamas. Netherlands head coach Ronald Koeman has admitted he is still bitter about Ryan Gravenberch rejecting a national team call-up last month. Manchester United are in a dilemma over what to do with the notoriously leaky roof at Old Trafford. Tottenham defender Eric Dier and former team-mate Matt Doherty have been trading one-word blows on social media after the latter gave away a penalty in Sunday's 1-1 draw against Aston Villa. Manchester United are in discussions to extend the contract of exciting teenage forward Omari Forson who has been named in the England elite development squad (formerly known as U20s) for games against Romania and Portugal during the international break. Stream the Premier League and more with NOW for £21 a month for six months Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Antony's ex-girlfriend Gabriela Cavallin will hold a formal interview with Greater Manchester Police on Thursday. THE SUN Jadon Sancho has \"no relationship\" with manager Erik ten Hag, according to reports. Cristiano Ronaldo is reportedly determined to play at the 2026 World Cup. Italy and Turkey will co-host Euro 2032, despite the joint bid breaching Uefa's own regulations - the European football governing body's rule states that joint-hosts must be neighbouring countries. Chris Coleman has resigned as Atromitos boss in Greece. DAILY MIRROR Jamaica have opened the door to Mason Greenwood resurrecting his international career - three years after the forward was capped by England. Sir Jim Ratcliffe took a share of a £75m dividend after the Mercedes Formula 1 team recorded a significant jump in profits. Spain's Jenni Hermoso has claimed that her image has been tarnished following the unsolicited kiss from former president Luis Rubiales, with the striker adding that \"no-one protected me\". Brentford striker Ivan Toney is keen on a move to Arsenal when his eight-month ban for breaching the FA's betting rules is up in January. Chelsea forward Nicolas Jackson has undergone a minor operation on his wrist - although he is set to be available for the visit of Arsenal when club football returns after the international break. THE ATHLETIC Victor Francos, the Spanish Secretary of State for Sports, believes their men's national team could have done more to support the women's side following former federation president Luis Rubiales' kiss on Jenni Hermoso. West Brom midfielder John Swift will miss six weeks of action with a calf injury. Serie A side Salernitana have appointed Filippo Inzaghi as their new head coach. Diego Alonso has been appointed as Sevilla head coach on a deal until the end of the season. 50 Cent has agreed to sponsor Welsh football team AFC Rumney's girls U14 team. NHL players won't be allowed to put Pride-themed tape on their sticks while on the ice this season as part of a decision made by the board of governors in June. DAILY TELEGRAPH The Football Association's slow response to the terror attacks in Israel has been condemned by its former chairman, the Jewish business executive David Bernstein. Tottenham Hotspur are offering support to the club's Israeli winger Manor Solomon over the Hamas attacks in his home country. Football Association chief executive Mark Bullingham expects Euro 2028 to transform facilities for the grassroots game after describing current standards in the country as \"embarrassing\". Israel Dagg, the former All Black, has expressed his concern for the future of the game in New Zealand ahead of their Rugby World Cup quarter-final against Ireland, believing that \"we're losing the heart and the grassroots of New Zealand rugby\". England players have been playing at the Cricket World Cup wearing different shirts because of a printing error on their Castore kits. THE GUARDIAN Premier League clubs are wary of being seen to take sides in the Middle East conflict and are awaiting guidance from the league over how to commemorate the victims of the attacks in Israel. DAILY EXPRESS The Glazer family will remain Manchester United owners for the January transfer window if they delay their takeover decision beyond November, according to reports. Donny van de Beek could make a return to the Eredivisie as he continues to be frozen out at Manchester United. THE TIMES UK and Ireland have been confirmed by Uefa as the hosts of Euro 2028 with the organisers promising affordable tickets for fans. The World Cup-winning coach Jorge Vilda has denied putting pressure on Spain midfielder Jenni Hermoso to downplay the unsolicited kiss she received from Luis Rubiales, the former president of the Spanish FA. More than 3,600 tickets are still available for England's Rugby World Cup quarter-final against Fiji in Marseille on Sunday, suggesting that fans are yet to be convinced by Steve Borthwick's side. The ECB will hold talks over the international schedule in 2028 to decide whether to leave a gap in the English summer schedule to accommodate the Los Angeles Olympic Games. DAILY RECORD Trent Alexander-Arnold has bizarrely name-dropped former Rangers and Hibs star Brandon Barker as one of the toughest opponents he's ever faced. SCOTTISH SUN Rangers have yet to make a final decision on their next manager. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-10 22:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"838864aea1b52b2bea4c391283934106","title":"Baseball, cricket e lacrosse (ri)bussano alla porta dei Giochi","link":"https://www.laregione.ch/sport/altri-sport/1704027/baseball-cricket-e-lacrosse-ri-bussano-alla-porta-dei-giochi","keywords":["OLIMPIADI"],"creator":null,"video_url":null,"description":"Cinque nuove proposte nel programma delle Olimpiadi di Los Angeles del 2028. Dovranno però superare lo scoglio del Congresso del Cio, che inizia domenica","content":"141esima sessione del Cio, il Comitato olimpico internazionale. Come a ogni nuova edizione dei Giochi olimpici, il comitato organizzatore della città ospitante ha la possibilità di suggerire delle aggiunte ai 28 sport presenti nel programma standard, con discipline più vicine agli interessi dei propri connazionali o che possono attrarre l'attenzione delle nuove generazioni: così hanno fatto i promotori dell'edizione di Los Angeles, e forse in pochi sanno che dei cinque sport che chiedono di entrare a far parte del cartellone il cricket è secondo soltanto al calcio quanto a popolarità globale ben 2,5 miliardi di appassionati, un miliardo dei quali nella sola India, ciò che gli conferisce un enorme forza pensando che la votazione si terrà proprio a Mumbai. Riuscisse a ottenere i voti necessari, il ritorno del cricket alle Olimpiadi colmerebbe una lacuna che dura da oltre un secolo, visto che la sua unica presenza ai Giochi risale addirittura all'edizione 1900 a Parigi. Tuttavia, la durata delle partite del cricket mal si adatta ai tempi della programmazione olimpica, e così sarebbe disputato nel formato accelerato, il cosiddetto Twenty20. Le altre new-entry proposte guardano invece decisamente al mondo sportivo nordamericano. Il baseball (il softball nella versione al femminile) è una religione negli Stati Uniti – oltre che in Giappone, dove peraltro è stato protagonista ai Tokyo 2021, ma non lo sarà più a Parigi –, lo squash è un simbolo della cosiddetta ‘american way of life’, mentre lacrosse e flag football sono ampiamente praticati soprattutto nelle scuole. Il lacrosse, tra l'altro, ha dei precedenti olimpici risalenti agli inizi del secolo scorso (1904 e nel 1908) ed è stato presente come sport dimostrativo nelle edizioni del 1928, 1932 e 1948. Un possibile fattore negativo potrebbe essere proprio la sua connotazione molto nordamericana e scolastica, e inoltre richiede un'attrezzatura piuttosto costosa che ne frena la diffusione nei Paesi meno ricchi. Anche la candidatura dello squash non è esente da pecche, la principale delle quali è la quasi assenza di test sulla capacità di attrarre pubblico televisivo e oltretutto nella fattispeciea si tratterebbe di un debutto olimpico assoluto, al pari del flag football, una versione ridotta e senza contatto fisico del football americano, che ha molto successo tra le donne ma rischia di avere a sua volta scarso appeal negli altri continenti.","pubDate":"2023-10-10 21:46:48","image_url":"https://media.laregione.ch/files/domains/laregione.ch/images/4c3q/1csm2.jpg?v=2","source_id":"laregione","source_priority":4191229,"country":["switzerland"],"category":["sports"],"language":"italian"},{"article_id":"6be44393d5a8ea99b021b155c4668027","title":"Football fan gets on pitch and mocks rivals - who throw tennis balls at his head","link":"https://www.dailystar.co.uk/sport/football/swindon-fan-reading-tennis-balls-31157451","keywords":["Sport"],"creator":null,"video_url":null,"description":"One brave Swindon Town fan invaded the pitch before giving stick to Reading fans who lobbed tennis balls at him, but the Royals had the last laugh","content":"A fan got pelted with tennis balls and other objects as he mocked furious fans after getting onto the pitch at the Select Car Leasing Stadium. Tuesday night proved to be a welcome break from action for Reading as they hosted the League Two side in the EFL Trophy. The Royals’ early season has been marred by talks of administration and points deductions following relegation last season - . Reading find themselves currently in 22nd place in the table after having four points deducted, but even without the deduction, Ruben Selles’ side would still be in the relegation zone. Recent weeks and months have seen Reading fans stage protests against their owner Dai Yongge, including throwing tennis balls onto the pitch. And seemingly those tennis balls are now a permanent fixture of Royals faithful’s matchday attire as furious fans launched tennis balls at a Swindon supporter who had run onto the pitch to mock the home supporters. The Swindon fan ran over to the Reading supporters before hand gestures were exchanged, seeing the Robins fan continue to goad the home fans by holding his arms out and appearing to chant at them as tennis balls and other items were launched from the stands. Stewards could be seen holding back aggressive fans who attempted to charge the Swindon fan. Eventually, a steward appeared to take the fan off the pitch, but before he found himself man-handled, he took himself off and gave himself up. But just as the 5-0 scoreline to the hosts on the night, Reading fans got the last say as he was foolishly taken down an exit by two stewards past the raging home fans who continued to pelt and abuse the man as he was slowly dragged past them. In a rare night to remember for Reading fans, Harvey Knibbs scored a hat-trick, before injury-time goals from Paul Mukairu and Harlee Dean at the end of the second half sealed a dominant display.","pubDate":"2023-10-10 21:45:08","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31157399.ece/ALTERNATES/s98/0_Screenshot-2023-10-10-at-221311.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"73ccaa1ad89114591fd88be336568fcd","title":"Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card","link":"https://www.dailymail.co.uk/sport/football/article-12616111/Howard-Webb-Man-City-Mateo-Kovacic-fortunate-1-0-Arsenal-Martin-Odegaard-Declan-Rice.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"KIERAN GILL: Speaking for the first time since the Diaz debacle on Match Officials Mic'd Up programme, Webb confessed that mistake harmed the refereeing body's reputation.","content":"Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card Gabriel Martinelli scored the only goal to help Arsenal defeat Manchester City Howard Webb was appearing on Match Officials Mic'd Up with Michael Owen Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Kieran Gill for the Daily Mail Published: 19:38, 10 October 2023 | Updated: 22:32, 10 October 2023 e-mail 309 shares 121 View comments Manchester City 's Mateo Kovacic should have seen red against Arsenal , Howard Webb admitted on Tuesday night, as the refereeing body PGMOL owned up to yet another major mistake. For the second successive weekend, the biggest game in the Premier League was overshadowed by an officiating error. Referee Michael Oliver failed to dismiss Kovacic when he fouled Declan Rice while already on a yellow card, a week after Luis Diaz's opener for Liverpool at Tottenham was wrongly disallowed for offside. Speaking for the first time since the Diaz debacle on the PGMOL's Match Officials Mic'd Up programme, Webb confessed that mistake harmed the refereeing body's reputation. Webb admitted Kovacic was fortunate to escape a straight red for a foul on Martin Odegaard , for which he only received a yellow, saying: 'This is clearly a poor tackle and I'm confident if a red card had been given by Michael Oliver on the day, it would have been a very straightforward \"check complete\", but he doesn't.' Howard Webb admitted that Mateo Kovacic was fortunate to remain on the pitch on Sunday Kovacic came under heavy scrutiny for this two robust challenges against Arsenal Man City's Croatian midfielder first fouled Martin Odegaard before a challenge on Declan Rice Your browser does not support iframes. On Kovacic's follow-up foul on Rice, Webb said: 'Second yellows are something the VAR is not able to get involved in. 'But he was extremely fortunate to stay on the field. (Oliver) doesn't want to have a negative impact on the game by overreacting to something… but it is also true that if you under-react you have a negative impact. 'He will realise the second one should have been a yellow card, which would have seen Kovacic sent off.' Numerous pundits and former referees have voiced their own opinions in the ensuing days, with Gary Neville and Mark Clattenburg both claiming that the player should have seen the red. The show is designed to help fans understand more about the refereeing process in the top-flight, with certain VAR calls and real-time decisions dissected on television. Tuesday evening's programme saw Webb and pundit Michael Owen discuss the controversial disallowed Luis Diaz goal from Liverpool's defeat to Tottenham the weekend previous. The goal was disallowed despite the player being clearly onside, due to a miscommunication by the VARs who thought they were checking to confirm the goal was onside, rather than offside. Kovacic avoided a second yellow for a challenge on Declan Rice - which Webb admitted was wrong PGMOL chief Webb was joined by former Liverpool and Man United forward Michael Owen IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Share or comment on this article: Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card e-mail 309 shares Add comment Comments 121 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-10 21:32:35","image_url":"https://i.dailymail.co.uk/1s/2023/10/10/20/76395225-0-image-a-22_1696965393339.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"226c7e74eb6b7d606fbb5950c4e51432","title":"Striker Bojan Miovski warns Aberdeen ‘are not scared of anyone’ in Europe","link":"https://www.pressandjournal.co.uk/fp/sport/football/aberdeen-fc/6215812/bojan-miovski-warns-aberdeen-fear-no-club-in-europe/","keywords":["Aberdeen FC","Aberdeen","Barry Robson","Bojan Miovski","Europa Conference League"],"creator":["Sean Wallace"],"video_url":null,"description":"The North Macedonian is relishing the challenge of facing Europa Conference League Group G leaders PAOK.","content":"Goal hero Bojan Miovski has warned Aberdeen have no fear of any club in the Europa Conference League, including group leaders PAOK. The Dons face Greek side PAOK in their next Group G game at Pittodrie on Thursday, October 26. PAOK boast a 100% record from their opening two group games having defeated German Bundesliga giants Eintracht Frankfurt (2-1) and Finnish champions HJK Helsinki (3-2). Scottish Premiership Hearts were crushed 6-1 on aggregate by PAOK in the Europa Conference League play-off in in August. Miovski, who has netted three goals in Europe this season, insists Aberdeen “are not scared” of any club in Europe. He said: “PAOK has started the group well but it is OK. “We aren’t scared of anyone. “When we played in Germany, we showed courage and that we can be good on the ball as well. “We know we might not have a lot of time on the ball and we have to concentrate. “And we are looking forward to the next game against PAOK.” PAOK racking up victories In-form PAOK have won 11 of their previous 15 matches in all competitions and sit third in the Greek Super League 1 table. Their only game between beating Eintracht Frankfurt and facing Aberdeen is a home league clash with Atromitos on Sunday, October 22. PAOK were Conference League quarter-finalists in 2022, losing 3-1 to Marseille on aggregate. The Greek outfit have reached the Europa League group stage and progressed to the knock-out round on multiple occasions in the past decade. Miovski said: “We will fully analyse the HJK game then in Europe our full focus will be on PAOK.” BM 9⃣ | — Aberdeen FC (@AberdeenFC) Frustration at missed opportunities are competing in the group stages of Europe for the first time since the 2007-08 UEFA Cup. The of the Euro groups. His headed equaliser could only salvage a point from a game he accepts the Dons engineered enough scoring chances to win. He said: “For me personally it was a great experience because it was only my second game in the group stages. “We will take the point against HJK but are disappointed because we had chances to win the game. “It was good to get off the mark in the group. “We had chances as after my goal Duk had a one-on-one. “It was a great moment to win the game. “The stadium atmosphere was unbelievable and I felt we had them at that moment. “We pushed until the finish but ended up with a point.” Learning lessons in Euro group stage Striker Miovski has delivered in Europe having scored in three of the Dons fixtures on the Continental stage this season. He netted in both legs of th The 24-year-old also impressed in the narrow loss to Eintracht Frankfurt before netting against HJK Helsinki. Miovski has now scored eight goals in all competitions this season. The striker insists valuable Euro lessons will be learned from the goal conceded against HJK Helsinki. He said: “We conceded an easy goal from nothing, a throw-in. “Sometimes we need to work really hard to score ourselves so that was a bit disappointing. “However, it is something we will learn from.” Miovski set to face Ukraine in Euro 2024 qualifier After a hectic schedule balancing Euro group-stage action with domestic commitments the Dons can recharge during the international break. However there is no rest for Miovski who is currently on international duty with North Macedonia. Capped 13 times, Miovski is in contention to start against Ukraine in a Euro 2024 Group C clash on Saturday. The match will be played at the Epet Centre in Prague, Czech Republic due to the ongoing war in Ukraine. North Macedonia are level on seven points with second-placed Italy, with England topping the group. On Tuesday October 17 North Macedonia also host Armenia in a friendly. Miovski said: “The game with Ukraine is the most important in the group. “It is played in Prague and we are looking forward to it.”","pubDate":"2023-10-10 21:30:07","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/10/20876907_53500113-xu67nl06-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"55fcd1b1e1e02102cd73fe2306054cd4","title":"Harry Kane says he'll 'never regret' leaving Spurs – even if they win the Premier League","link":"https://www.dailystar.co.uk/sport/football/harry-kane-bayern-tottenhan-ange-31156838","keywords":["Sport"],"creator":null,"video_url":null,"description":"Harry Kane would love to see Tottenham stun English football by winning the Premier League under Ange Postecoglou after leaving for Bayern Munich","content":"insists he’ll never regret leaving Tottenham – even if his former club win the under Ange Postecoglou. While Kane is enjoying life in Germany, there might be some jealousy to see his former club flying high in the under their new Aussie boss. But he actually wants to see them keep it up and win the title. There won’t be any regret if they do and he’s over in Germany winning the Bundesliga. “I have made it clear my whole career I am a fan and I would love to see Tottenham do well,” said Kane. “There is no other team in the Premier League I would want to win than Tottenham. “To experience a new league, if I got to 40 and I was retired and I looked back and never played in another league I would have always wondered what it would have been like. So now I am here, I am excited and it will always be a decision I never regret.” Kane has scored 59 goals for England to be the nation’s record goalscorer while he also holds the record at 280 goals with . It is that record which earned him the £86m move to Bayern in the summer but he believes he’s yet to hit his peak. The England captain believes he’s got plenty of time yet and he can emulate the likes of , , Robert Lewandowski and Zlatan Ibrahimovic by still plundering goals well into his 30s. “There is definitely room for improvement,” he said. “I have been coming to a stage over the last year or two when it has been coming together, having the experience, knowing your body, knowing the way you want to play, playing in high-pressure games. “When you look at a lot of the top-level players – Ronaldos, Messis, Lewandowskis, Ibrahimovich – they have almost got better as they hit 30. In a lot of sports that happens as well. Everything is maybe settled in your personal life. “You have got family, you have got kids – so that side is all settled. You are comfortable with your body, you are comfortable mentally where you are at and that just allows you to focus on the football. “The perception in sport or football in general is you hit 30 and people start to think the end. But the way I am looking at it is that I almost have the second half of my career. “I played in the first team at Spurs from 20 or 21 so I have had nine or 10 years at the highest level and I am hoping for another eight or nine years at the highest level again. It all depends. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month “You see some players who want to have a different change or challenge so I would never be able to tell you what I will do but at the moment, I just want to keep playing. I think, with everything, with recovery, sports science and the way the game has been and adapted, it has allowed players to play for longer. We may have a bit more information over what the players had in the past. “But when you look at the players you said [Ronaldo, Messi and Lewandowski]. That makes me believe and shows it is possible to play until your late thirties and that is what I am planning to do.”","pubDate":"2023-10-10 21:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31156858.ece/ALTERNATES/s98/0_Untitled-design-87.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"40685014ba3fd40798a80e55b228a8d0","title":"Roughriders look to clinch playoff spot Friday in Calgary","link":"https://leaderpost.com/sports/football/cfl/saskatchewan-roughriders/sports-riders-look-to-clinch-playoff-spot-against-stamps","keywords":["CFL","Football","Saskatchewan Roughriders","Sports"],"creator":["Taylor Shire"],"video_url":null,"description":"With the season series on the line, the Riders can book their post-season spot this week against the Stampeders","content":"Article content Despite a five-game losing streak, the Saskatchewan Roughriders still control their own fate when it comes to the CFL playoff race. Heading into a Week 19 road game against the 4-11 Calgary Stampeders on Friday (7:30 p.m., TSN), the 6-10 Riders can officially clinch a spot in the post-season with a victory. “You want to always control your own fate and we still have control of that,” Riders’ head coach Craig Dickenson said after practice at Mosaic Stadium on Tuesday. “There’s a few other teams in this league that don’t and it’s tough to motivate those guys when they know they’re already out.” Entering this Friday’s game, the Stamps not only trail the Riders by four points in the West Division standings, but the season series — and standings tiebreaker — is also on the line after the Riders beat Calgary 29-26 in overtime in Week 3 , which was followed by a Stamps 33-31 win in Week 6, when quarterback Trevor Harris was injured. If the Riders lose on Friday, then it sets up for a crucial final two weeks of the season for both teams. For Calgary to get in, they would need a Saskatchewan loss in their Week 20 game against the 13-2 Toronto Argonauts on Oct. 21. The Stampeders would need to beat the 11-5 B.C. Lions on Oct. 20 or beat the 12-4 Winnipeg Blue Bombers on Oct. 27. If Saskatchewan loses to Calgary and then beats Toronto, then the Stamps would have to win both of their games to leapfrog the Riders for the third and final playoff spot in the West Division. The Riders have a bye in the final week of the season. “We’re steering the ship for our own destiny,” said quarterback Jake Dolegala. “We win this week, we’re in and that’s just what we’ve got to do.” While the Riders enter Friday’s game on a five-game skid, after Saturday’s 38-13 loss to the Hamilton Tiger-Cats , the Stampeders haven’t been playing well of late either, having lost six of their last seven games, including three straight contents. “We feel very fortunate,” said Dickenson. “We’ve been lucky in a lot of ways that other teams have lost and we’re still in the mix. “But we’ve got to take advantage of that.” Upon their return to the practice field on Tuesday , Dickenson had a number of veteran players, plus general manager Jeremy O’Day, address the team as they get set for the final two games of the season. The message? “We want better energy, we want to play with a little more emotion and we need to execute,” said the head coach. “We talked a lot about those three things and that we need all of them in order to be successful. “You can’t have one without the other two and expect to be successful.” As the Riders returned for Day 1 of practice on Tuesday, several players missed the workout. Linebacker Derrick Moncrief (shoulder/neck), linebacker T.J. Brunson (neck), receiver Tevin Jones (hamstring), defensive back Jaxon Ford (hamstring) and defensive lineman Charbel Dabire (illness) did not participate. Neither did defensive back Jeremy Clark (knee) who missed last week’s game against Hamilton. The Riders added another player to the roster on Tuesday, signing American defensive back Abu Daramy-Swaray. This season, the 27-year-old played five games with the Winnipeg Blue Bombers, making 23 tackles and a forced fumble. He was released from the Bombers’ practice roster last week. Prior to his time in the CFL, Daramy-Swaray spent time with the NFL’s Cincinnati Bengals, the XFL’s Arlington Renegades and the German Football League’s Potsdam Royals. The 5-foot-9, 176-pounder played college football at Colgate University where he racked up 155 tackles, 25 pass breakups and five interceptions in 44 games, while also serving as a punt and kickoff returner. tshire@postmedia.com Share this Story : Roughriders look to clinch playoff spot Friday in Calgary Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr","pubDate":"2023-10-10 21:19:22","image_url":null,"source_id":"leaderpost","source_priority":72082,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"34d12e00dc90620c5ff8012dd9627294","title":"Host nations from UK, Ireland set to enter Euro 2028 qualifying","link":"https://www.malaymail.com/news/sports/2023/10/11/host-nations-from-uk-ireland-set-to-enter-euro-2028-qualifying/95568","keywords":["Euro 2028"],"creator":null,"video_url":null,"description":"LONDON, Oct 11 — England, Scotland, Wales, Northern Ireland and the Republic of Ireland will enter qualifying for Euro 2...","content":"LONDON, Oct 11 — England, Scotland, Wales, Northern Ireland and the Republic of Ireland will enter qualifying for Euro 2028 despite being named hosts, the head of the English Football Association (FA) said on Tuesday. Uefa awarded the tournament to the five-nation bid after it was unopposed, with Italy and Turkey agreeing to co-host the 2032 European Championship. However, not all the hosts will be guaranteed passage to the 24-team tournament, according to FA chief executive Mark Bullingham. Uefa are reportedly planning to reserve two spots for the best two performing host nations that fail to qualify. England have only failed to qualify once for the Euro since 1984, when it was a 16-team tournament in 2008. But making major tournaments has been a far tougher task for the other four hosts. Northern Ireland have only reached one European Championship in their history. Wales’ only two appearances in the competition have come since it was expanded to a 24-team tournament. Scotland’s qualification for Euro 2020 was their first for any major tournament since 1998, while the Republic of Ireland are currently ranked 55th in the world. “From our point of view, it’s great to be taking part in qualifying and we want to get everyone (all five nations) there,” Bullingham told Sky Sports. “It is better to play in a tournament where it matters and we have competitive games. We’re looking forward to that. “It’s always been part of our discussions with the other countries and Uefa that we would take part in qualifying. We think with the new format of European football that’s the right thing to do.” ‘Good partnership’ England is set to provide six of the 10 venues; Wembley and the Tottenham Hotspur Stadium in London, Manchester City’s Etihad Stadium, Newcastle’s St James’ Park, Villa Park in Birmingham and Everton’s new stadium in Liverpool. Belfast, Cardiff, Dublin and Glasgow will be the other host cities. “It’s a really good partnership. We know we’re going to have five games in Northern Ireland, six in Wales, Scotland and Ireland,” added Bullingham. “It’s brilliant those countries are going to get a significant portion of games, particularly if they end up with some of their own home games - it will really excite the countries.” Football Association of Wales chief executive Noel Mooney confirmed Cardiff was bidding to host the opening match. “Cardiff would be perfect for the opening match,” said Mooney. The Welsh capital, Glasgow, Dublin and Wembley are expected to be handed quarter-finals. However, there remain doubts about the proposed Belfast venue at Casement Park. Plans to redevelop the derelict site into a 34,000-capacity venue have been mired in controversy and hit by delays. Wembley is also set to host both semi-finals and final as it did at Euro 2020. The final two years ago was marred by scenes of violence as supporters stormed the gates to access the stadium. But Bullingham said Uefa had no hesitation in returning to the home of English football for a showpiece occasion. “They know we’ve spent a lot of money upgrading the stadium. They’re really confident we can deliver a brilliant Euros and that’s what we’ll do,” added Bullingham. — AFP","pubDate":"2023-10-10 23:57:58","image_url":null,"source_id":"malaymail","source_priority":105894,"country":["malaysia","singapore"],"category":["sports"],"language":"english"},{"article_id":"8f4a321c1bd579b3310e1b0f38418ede","title":"Has Joao Cancelo made Barcelona better? ","link":"https://www.barcablaugranes.com/2023/10/11/23911742/has-joao-cancelo-made-barcelona-better","keywords":null,"creator":["Nick Batlle"],"video_url":null,"description":null,"content":"This isn’t the same Barcelona that won La Liga a few months ago. That team was led by the heroics of Marc-Andre ter Stegen who tied Francisco Liano for the most clean sheets in Spanish history at 26. The German keeper played in front of a four-man backline that for the majority of the season used a center-back, Ronald Araujo or Jules Kounde, to neutralize dangerous counter attacks that plagued the team the year before. Playing this way wasn’t the plan. Understandably, Xavi wasn’t convinced by Sergino Dest or Sergi Roberto, and was quickly turned off by new signing Hector Bellerin. That left the manager with no choice but to improvise, which led him to realizing that Barcelona was actually quite well off with the defensive approach to the full-back position. No longer was Barcelona shaking their head, and lamenting unforced errors that were costing the team points in the past. It actually felt good to have a sense of calm and security in the back, which turned to excitement when Araujo started putting Vinicius Junior, and other world class wingers, in his pocket. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images If it weren’t for the injuries to these defenders during the Champions League group stage, it’s worth imagining what could have been. In the end, however, Barcelona did claim the league title as a result of their consistent defending, conceding only 20 goals, which is astonishing when you consider that the next best defensive team was Atletico Madrid who allowed 33. But all along, there was a sense that this approach couldn’t continue. As effective as it was, a Barcelona team needed to play like a Barcelona team, and that meant playing total football, which necessarily required attacking ability and skill from the full-backs. On the left side, Alejandro Balde revealed himself as a full-back of the future, but identifying a proven playmaker for the right side remained priority number one. Photo by Fran Santiago/Getty Images And so began mission Joao Cancelo, which was completed right before the close of the summer transfer window. Since his arrival, the Portuguese international has appeared in every game, and in every game, he has made his presence felt. Cancelo is not shy. He wants the ball, and when he has it, he has the confidence to make something happen. Xavi has given him the green light to read the game and express himself. The result has been dangerous balls that have led to assists and goals during clutch moments. With injuries to critical talent in the attack, Barcelona has relied on the creativity of Cancelo, and they are privileged to know if other injuries should occur, they have a versatile player on their hands who can step in and contribute at a high level. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images But the question remains whether Barcelona is a better team this year. In answering that question, Cancelo is front and center, because for better or worse, he is a focal point of this team from a tactical point of view. Ter Stegen has had early struggles, missing saves he would normally make, and looking shaky while playing out of the back. Against Granada, Jules Kounde was caught in a challenging, but manageable, one versus one situation. A battle he ultimately lost, with Barcelona giving up a second early goal. How much blame should be given to the keeper and center-backs? Have they let down the team? After all, this Barcelona squad has already surrendered 10 goals, which means they’re on track to allow in more than 40. In my opinion, Kounde has been excellent, and with Araujo, Andreas Christensen, and Inigo Martinez, Barcelona have enough talent on the backline to stabilize the defense going forward. I one hundred percent believe in Ter Stegen as well. Photo by Fran Santiago/Getty Images The problem is tactical in that Cancelo and Balde are playing high up the field. That means the team must be better on the ball. First order of business, limit the silly turnovers in the midfield. It’s not fair to point the finger at center backs when you’re asking them to constantly put out fires that shouldn’t be created in the first place. Second, Barcelona needs to be more dangerous in the way they attack if this is the approach they want to take. It doesn’t make sense to use extra playmakers if the team doesn’t attack better as a result of it. When you look at the evidence, this is a difficult assessment to make when considering Cancelo. He is definitely one of the most effective attacking players on the team, and Barcelona honestly seems to rely on him for their best moments high up the field. But his presence, with the way he likes to play, also makes the defense more vulnerable. You never know where he’s going to be at any point in time, which leaves a player like Kounde out on an island, especially when you aren’t playing with a true defensive midfielder to help out. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images So what’s the solution? Drop Cancelo all together, and replace him with Kounde or Araujo? Play him in a new position? Maybe as part of a double pivot with Oriol Romeu in a 3-2-4-1 a la Manchester City? Or continue as is with Cancelo playing full-back in the traditional 4-3-3? In the short term, the injury situation will limit Xavi’s choices. Surely, he’ll want Cancelo on the field, especially with El Clasico on the horizon. Real Madrid, however, are no longer playing 4-3-3 with traditional wingers. Does that change the calculation at all? Photo by Florencia Tan Jun/Getty Images These are big questions, and maybe the answer is to go back to what was working last season, especially if Kounde and Araujo willingly allow it. But that will also require players like Pedri, Frenkie de Jong, and Raphinha to get back from injury. In the meantime, regardless of who’s on the field, Barcelona need to be smart, and do the basic things right, regardless of their tactical approach. Take care of the ball. When in doubt, show you can keep it. Especially against teams that play in a low block. And when Cancelo is on the field, maybe their best defense is to press aggressively high up the field, and not rely so much on building from the back. Frankly, they need Frenkie and Pedri in order for that to be effective. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images Whatever approach they take, Xavi needs his men to be well drilled and focused on the mission. So far, it’s been inconsistent. Let’s hope they get healthy, and have a run of games to figure out who they are, and how they want to play. When in doubt, don’t forget what got you so far last season. As the saying goes, it’s the defense that wins championships.","pubDate":"2023-10-10 23:00:00","image_url":null,"source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"27f8097b5fad30ee3e0ee40db05b4ddb","title":"EFL Trophy: Derby County goalkeeper Josh Vickers returns with win after death of wife Laura","link":"https://www.newsr.in/n/Sports/1zpnzuphar/EFL-Trophy-Derby-County-goalkeeper-Josh-Vickers-returns.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Josh Vickers helps Derby County to victory in the EFL Trophy as he returns to football for the first time since the death of his wife. Reported by BBC Sport 2 hours ago.","content":"Tuesday, 10 October 2023 ( 3 hours ago ) Josh Vickers helps Derby County to victory in the EFL Trophy as he returns to football for the first time since the death of his wife. 👓 View full article","pubDate":"2023-10-10 22:00:55","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"711b52a61d8a1785e3299f05afff1790","title":"Papers: PL faces calls from clubs to respond to Israel-Hamas war","link":"https://www.skysports.com/football/news/20876/12982070/premier-league-faces-calls-from-clubs-to-provide-formal-response-to-israel-hamas-war-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Wednesday's newspapers...","content":"All the top stories and transfer rumours from Wednesday's newspapers... DAILY MAIL The Premier League is facing calls from clubs to provide a formal response to the outbreak of war in Israel, with executives at several of them unhappy at the sport's silence since last Friday's terrorist attack by Hamas. Netherlands head coach Ronald Koeman has admitted he is still bitter about Ryan Gravenberch rejecting a national team call-up last month. Manchester United are in a dilemma over what to do with the notoriously leaky roof at Old Trafford. Tottenham defender Eric Dier and former team-mate Matt Doherty have been trading one-word blows on social media after the latter gave away a penalty in Sunday's 1-1 draw against Aston Villa. Manchester United are in discussions to extend the contract of exciting teenage forward Omari Forson who has been named in the England elite development squad (formerly known as U20s) for games against Romania and Portugal during the international break. Stream the Premier League and more with NOW for £21 a month for six months Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Antony's ex-girlfriend Gabriela Cavallin will hold a formal interview with Greater Manchester Police on Thursday. THE SUN Jadon Sancho has \"no relationship\" with manager Erik ten Hag, according to reports. Cristiano Ronaldo is reportedly determined to play at the 2026 World Cup. Italy and Turkey will co-host Euro 2032, despite the joint bid breaching Uefa's own regulations - the European football governing body's rule states that joint-hosts must be neighbouring countries. Chris Coleman has resigned as Atromitos boss in Greece. DAILY MIRROR Jamaica have opened the door to Mason Greenwood resurrecting his international career - three years after the forward was capped by England. Sir Jim Ratcliffe took a share of a £75m dividend after the Mercedes Formula 1 team recorded a significant jump in profits. Spain's Jenni Hermoso has claimed that her image has been tarnished following the unsolicited kiss from former president Luis Rubiales, with the striker adding that \"no-one protected me\". Brentford striker Ivan Toney is keen on a move to Arsenal when his eight-month ban for breaching the FA's betting rules is up in January. Chelsea forward Nicolas Jackson has undergone a minor operation on his wrist - although he is set to be available for the visit of Arsenal when club football returns after the international break. THE ATHLETIC Victor Francos, the Spanish Secretary of State for Sports, believes their men's national team could have done more to support the women's side following former federation president Luis Rubiales' kiss on Jenni Hermoso. West Brom midfielder John Swift will miss six weeks of action with a calf injury. Serie A side Salernitana have appointed Filippo Inzaghi as their new head coach. Diego Alonso has been appointed as Sevilla head coach on a deal until the end of the season. 50 Cent has agreed to sponsor Welsh football team AFC Rumney's girls U14 team. NHL players won't be allowed to put Pride-themed tape on their sticks while on the ice this season as part of a decision made by the board of governors in June. DAILY TELEGRAPH The Football Association's slow response to the terror attacks in Israel has been condemned by its former chairman, the Jewish business executive David Bernstein. Tottenham Hotspur are offering support to the club's Israeli winger Manor Solomon over the Hamas attacks in his home country. Football Association chief executive Mark Bullingham expects Euro 2028 to transform facilities for the grassroots game after describing current standards in the country as \"embarrassing\". Israel Dagg, the former All Black, has expressed his concern for the future of the game in New Zealand ahead of their Rugby World Cup quarter-final against Ireland, believing that \"we're losing the heart and the grassroots of New Zealand rugby\". England players have been playing at the Cricket World Cup wearing different shirts because of a printing error on their Castore kits. THE GUARDIAN Premier League clubs are wary of being seen to take sides in the Middle East conflict and are awaiting guidance from the league over how to commemorate the victims of the attacks in Israel. DAILY EXPRESS The Glazer family will remain Manchester United owners for the January transfer window if they delay their takeover decision beyond November, according to reports. Donny van de Beek could make a return to the Eredivisie as he continues to be frozen out at Manchester United. THE TIMES UK and Ireland have been confirmed by Uefa as the hosts of Euro 2028 with the organisers promising affordable tickets for fans. The World Cup-winning coach Jorge Vilda has denied putting pressure on Spain midfielder Jenni Hermoso to downplay the unsolicited kiss she received from Luis Rubiales, the former president of the Spanish FA. More than 3,600 tickets are still available for England's Rugby World Cup quarter-final against Fiji in Marseille on Sunday, suggesting that fans are yet to be convinced by Steve Borthwick's side. The ECB will hold talks over the international schedule in 2028 to decide whether to leave a gap in the English summer schedule to accommodate the Los Angeles Olympic Games. DAILY RECORD Trent Alexander-Arnold has bizarrely name-dropped former Rangers and Hibs star Brandon Barker as one of the toughest opponents he's ever faced. SCOTTISH SUN Rangers have yet to make a final decision on their next manager. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-10 22:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"838864aea1b52b2bea4c391283934106","title":"Baseball, cricket e lacrosse (ri)bussano alla porta dei Giochi","link":"https://www.laregione.ch/sport/altri-sport/1704027/baseball-cricket-e-lacrosse-ri-bussano-alla-porta-dei-giochi","keywords":["OLIMPIADI"],"creator":null,"video_url":null,"description":"Cinque nuove proposte nel programma delle Olimpiadi di Los Angeles del 2028. Dovranno però superare lo scoglio del Congresso del Cio, che inizia domenica","content":"141esima sessione del Cio, il Comitato olimpico internazionale. Come a ogni nuova edizione dei Giochi olimpici, il comitato organizzatore della città ospitante ha la possibilità di suggerire delle aggiunte ai 28 sport presenti nel programma standard, con discipline più vicine agli interessi dei propri connazionali o che possono attrarre l'attenzione delle nuove generazioni: così hanno fatto i promotori dell'edizione di Los Angeles, e forse in pochi sanno che dei cinque sport che chiedono di entrare a far parte del cartellone il cricket è secondo soltanto al calcio quanto a popolarità globale ben 2,5 miliardi di appassionati, un miliardo dei quali nella sola India, ciò che gli conferisce un enorme forza pensando che la votazione si terrà proprio a Mumbai. Riuscisse a ottenere i voti necessari, il ritorno del cricket alle Olimpiadi colmerebbe una lacuna che dura da oltre un secolo, visto che la sua unica presenza ai Giochi risale addirittura all'edizione 1900 a Parigi. Tuttavia, la durata delle partite del cricket mal si adatta ai tempi della programmazione olimpica, e così sarebbe disputato nel formato accelerato, il cosiddetto Twenty20. Le altre new-entry proposte guardano invece decisamente al mondo sportivo nordamericano. Il baseball (il softball nella versione al femminile) è una religione negli Stati Uniti – oltre che in Giappone, dove peraltro è stato protagonista ai Tokyo 2021, ma non lo sarà più a Parigi –, lo squash è un simbolo della cosiddetta ‘american way of life’, mentre lacrosse e flag football sono ampiamente praticati soprattutto nelle scuole. Il lacrosse, tra l'altro, ha dei precedenti olimpici risalenti agli inizi del secolo scorso (1904 e nel 1908) ed è stato presente come sport dimostrativo nelle edizioni del 1928, 1932 e 1948. Un possibile fattore negativo potrebbe essere proprio la sua connotazione molto nordamericana e scolastica, e inoltre richiede un'attrezzatura piuttosto costosa che ne frena la diffusione nei Paesi meno ricchi. Anche la candidatura dello squash non è esente da pecche, la principale delle quali è la quasi assenza di test sulla capacità di attrarre pubblico televisivo e oltretutto nella fattispeciea si tratterebbe di un debutto olimpico assoluto, al pari del flag football, una versione ridotta e senza contatto fisico del football americano, che ha molto successo tra le donne ma rischia di avere a sua volta scarso appeal negli altri continenti.","pubDate":"2023-10-10 21:46:48","image_url":"https://media.laregione.ch/files/domains/laregione.ch/images/4c3q/1csm2.jpg?v=2","source_id":"laregione","source_priority":4191229,"country":["switzerland"],"category":["sports"],"language":"italian"},{"article_id":"6be44393d5a8ea99b021b155c4668027","title":"Football fan gets on pitch and mocks rivals - who throw tennis balls at his head","link":"https://www.dailystar.co.uk/sport/football/swindon-fan-reading-tennis-balls-31157451","keywords":["Sport"],"creator":null,"video_url":null,"description":"One brave Swindon Town fan invaded the pitch before giving stick to Reading fans who lobbed tennis balls at him, but the Royals had the last laugh","content":"A fan got pelted with tennis balls and other objects as he mocked furious fans after getting onto the pitch at the Select Car Leasing Stadium. Tuesday night proved to be a welcome break from action for Reading as they hosted the League Two side in the EFL Trophy. The Royals’ early season has been marred by talks of administration and points deductions following relegation last season - . Reading find themselves currently in 22nd place in the table after having four points deducted, but even without the deduction, Ruben Selles’ side would still be in the relegation zone. Recent weeks and months have seen Reading fans stage protests against their owner Dai Yongge, including throwing tennis balls onto the pitch. And seemingly those tennis balls are now a permanent fixture of Royals faithful’s matchday attire as furious fans launched tennis balls at a Swindon supporter who had run onto the pitch to mock the home supporters. The Swindon fan ran over to the Reading supporters before hand gestures were exchanged, seeing the Robins fan continue to goad the home fans by holding his arms out and appearing to chant at them as tennis balls and other items were launched from the stands. Stewards could be seen holding back aggressive fans who attempted to charge the Swindon fan. Eventually, a steward appeared to take the fan off the pitch, but before he found himself man-handled, he took himself off and gave himself up. But just as the 5-0 scoreline to the hosts on the night, Reading fans got the last say as he was foolishly taken down an exit by two stewards past the raging home fans who continued to pelt and abuse the man as he was slowly dragged past them. In a rare night to remember for Reading fans, Harvey Knibbs scored a hat-trick, before injury-time goals from Paul Mukairu and Harlee Dean at the end of the second half sealed a dominant display.","pubDate":"2023-10-10 21:45:08","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31157399.ece/ALTERNATES/s98/0_Screenshot-2023-10-10-at-221311.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"73ccaa1ad89114591fd88be336568fcd","title":"Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card","link":"https://www.dailymail.co.uk/sport/football/article-12616111/Howard-Webb-Man-City-Mateo-Kovacic-fortunate-1-0-Arsenal-Martin-Odegaard-Declan-Rice.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"KIERAN GILL: Speaking for the first time since the Diaz debacle on Match Officials Mic'd Up programme, Webb confessed that mistake harmed the refereeing body's reputation.","content":"Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card Gabriel Martinelli scored the only goal to help Arsenal defeat Manchester City Howard Webb was appearing on Match Officials Mic'd Up with Michael Owen Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Kieran Gill for the Daily Mail Published: 19:38, 10 October 2023 | Updated: 22:32, 10 October 2023 e-mail 309 shares 121 View comments Manchester City 's Mateo Kovacic should have seen red against Arsenal , Howard Webb admitted on Tuesday night, as the refereeing body PGMOL owned up to yet another major mistake. For the second successive weekend, the biggest game in the Premier League was overshadowed by an officiating error. Referee Michael Oliver failed to dismiss Kovacic when he fouled Declan Rice while already on a yellow card, a week after Luis Diaz's opener for Liverpool at Tottenham was wrongly disallowed for offside. Speaking for the first time since the Diaz debacle on the PGMOL's Match Officials Mic'd Up programme, Webb confessed that mistake harmed the refereeing body's reputation. Webb admitted Kovacic was fortunate to escape a straight red for a foul on Martin Odegaard , for which he only received a yellow, saying: 'This is clearly a poor tackle and I'm confident if a red card had been given by Michael Oliver on the day, it would have been a very straightforward \"check complete\", but he doesn't.' Howard Webb admitted that Mateo Kovacic was fortunate to remain on the pitch on Sunday Kovacic came under heavy scrutiny for this two robust challenges against Arsenal Man City's Croatian midfielder first fouled Martin Odegaard before a challenge on Declan Rice Your browser does not support iframes. On Kovacic's follow-up foul on Rice, Webb said: 'Second yellows are something the VAR is not able to get involved in. 'But he was extremely fortunate to stay on the field. (Oliver) doesn't want to have a negative impact on the game by overreacting to something… but it is also true that if you under-react you have a negative impact. 'He will realise the second one should have been a yellow card, which would have seen Kovacic sent off.' Numerous pundits and former referees have voiced their own opinions in the ensuing days, with Gary Neville and Mark Clattenburg both claiming that the player should have seen the red. The show is designed to help fans understand more about the refereeing process in the top-flight, with certain VAR calls and real-time decisions dissected on television. Tuesday evening's programme saw Webb and pundit Michael Owen discuss the controversial disallowed Luis Diaz goal from Liverpool's defeat to Tottenham the weekend previous. The goal was disallowed despite the player being clearly onside, due to a miscommunication by the VARs who thought they were checking to confirm the goal was onside, rather than offside. Kovacic avoided a second yellow for a challenge on Declan Rice - which Webb admitted was wrong PGMOL chief Webb was joined by former Liverpool and Man United forward Michael Owen IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Share or comment on this article: Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card e-mail 309 shares Add comment Comments 121 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-10 21:32:35","image_url":"https://i.dailymail.co.uk/1s/2023/10/10/20/76395225-0-image-a-22_1696965393339.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"226c7e74eb6b7d606fbb5950c4e51432","title":"Striker Bojan Miovski warns Aberdeen ‘are not scared of anyone’ in Europe","link":"https://www.pressandjournal.co.uk/fp/sport/football/aberdeen-fc/6215812/bojan-miovski-warns-aberdeen-fear-no-club-in-europe/","keywords":["Aberdeen FC","Aberdeen","Barry Robson","Bojan Miovski","Europa Conference League"],"creator":["Sean Wallace"],"video_url":null,"description":"The North Macedonian is relishing the challenge of facing Europa Conference League Group G leaders PAOK.","content":"Goal hero Bojan Miovski has warned Aberdeen have no fear of any club in the Europa Conference League, including group leaders PAOK. The Dons face Greek side PAOK in their next Group G game at Pittodrie on Thursday, October 26. PAOK boast a 100% record from their opening two group games having defeated German Bundesliga giants Eintracht Frankfurt (2-1) and Finnish champions HJK Helsinki (3-2). Scottish Premiership Hearts were crushed 6-1 on aggregate by PAOK in the Europa Conference League play-off in in August. Miovski, who has netted three goals in Europe this season, insists Aberdeen “are not scared” of any club in Europe. He said: “PAOK has started the group well but it is OK. “We aren’t scared of anyone. “When we played in Germany, we showed courage and that we can be good on the ball as well. “We know we might not have a lot of time on the ball and we have to concentrate. “And we are looking forward to the next game against PAOK.” PAOK racking up victories In-form PAOK have won 11 of their previous 15 matches in all competitions and sit third in the Greek Super League 1 table. Their only game between beating Eintracht Frankfurt and facing Aberdeen is a home league clash with Atromitos on Sunday, October 22. PAOK were Conference League quarter-finalists in 2022, losing 3-1 to Marseille on aggregate. The Greek outfit have reached the Europa League group stage and progressed to the knock-out round on multiple occasions in the past decade. Miovski said: “We will fully analyse the HJK game then in Europe our full focus will be on PAOK.” BM 9⃣ | — Aberdeen FC (@AberdeenFC) Frustration at missed opportunities are competing in the group stages of Europe for the first time since the 2007-08 UEFA Cup. The of the Euro groups. His headed equaliser could only salvage a point from a game he accepts the Dons engineered enough scoring chances to win. He said: “For me personally it was a great experience because it was only my second game in the group stages. “We will take the point against HJK but are disappointed because we had chances to win the game. “It was good to get off the mark in the group. “We had chances as after my goal Duk had a one-on-one. “It was a great moment to win the game. “The stadium atmosphere was unbelievable and I felt we had them at that moment. “We pushed until the finish but ended up with a point.” Learning lessons in Euro group stage Striker Miovski has delivered in Europe having scored in three of the Dons fixtures on the Continental stage this season. He netted in both legs of th The 24-year-old also impressed in the narrow loss to Eintracht Frankfurt before netting against HJK Helsinki. Miovski has now scored eight goals in all competitions this season. The striker insists valuable Euro lessons will be learned from the goal conceded against HJK Helsinki. He said: “We conceded an easy goal from nothing, a throw-in. “Sometimes we need to work really hard to score ourselves so that was a bit disappointing. “However, it is something we will learn from.” Miovski set to face Ukraine in Euro 2024 qualifier After a hectic schedule balancing Euro group-stage action with domestic commitments the Dons can recharge during the international break. However there is no rest for Miovski who is currently on international duty with North Macedonia. Capped 13 times, Miovski is in contention to start against Ukraine in a Euro 2024 Group C clash on Saturday. The match will be played at the Epet Centre in Prague, Czech Republic due to the ongoing war in Ukraine. North Macedonia are level on seven points with second-placed Italy, with England topping the group. On Tuesday October 17 North Macedonia also host Armenia in a friendly. Miovski said: “The game with Ukraine is the most important in the group. “It is played in Prague and we are looking forward to it.”","pubDate":"2023-10-10 21:30:07","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/10/20876907_53500113-xu67nl06-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"55fcd1b1e1e02102cd73fe2306054cd4","title":"Harry Kane says he'll 'never regret' leaving Spurs – even if they win the Premier League","link":"https://www.dailystar.co.uk/sport/football/harry-kane-bayern-tottenhan-ange-31156838","keywords":["Sport"],"creator":null,"video_url":null,"description":"Harry Kane would love to see Tottenham stun English football by winning the Premier League under Ange Postecoglou after leaving for Bayern Munich","content":"insists he’ll never regret leaving Tottenham – even if his former club win the under Ange Postecoglou. While Kane is enjoying life in Germany, there might be some jealousy to see his former club flying high in the under their new Aussie boss. But he actually wants to see them keep it up and win the title. There won’t be any regret if they do and he’s over in Germany winning the Bundesliga. “I have made it clear my whole career I am a fan and I would love to see Tottenham do well,” said Kane. “There is no other team in the Premier League I would want to win than Tottenham. “To experience a new league, if I got to 40 and I was retired and I looked back and never played in another league I would have always wondered what it would have been like. So now I am here, I am excited and it will always be a decision I never regret.” Kane has scored 59 goals for England to be the nation’s record goalscorer while he also holds the record at 280 goals with . It is that record which earned him the £86m move to Bayern in the summer but he believes he’s yet to hit his peak. The England captain believes he’s got plenty of time yet and he can emulate the likes of , , Robert Lewandowski and Zlatan Ibrahimovic by still plundering goals well into his 30s. “There is definitely room for improvement,” he said. “I have been coming to a stage over the last year or two when it has been coming together, having the experience, knowing your body, knowing the way you want to play, playing in high-pressure games. “When you look at a lot of the top-level players – Ronaldos, Messis, Lewandowskis, Ibrahimovich – they have almost got better as they hit 30. In a lot of sports that happens as well. Everything is maybe settled in your personal life. “You have got family, you have got kids – so that side is all settled. You are comfortable with your body, you are comfortable mentally where you are at and that just allows you to focus on the football. “The perception in sport or football in general is you hit 30 and people start to think the end. But the way I am looking at it is that I almost have the second half of my career. “I played in the first team at Spurs from 20 or 21 so I have had nine or 10 years at the highest level and I am hoping for another eight or nine years at the highest level again. It all depends. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month “You see some players who want to have a different change or challenge so I would never be able to tell you what I will do but at the moment, I just want to keep playing. I think, with everything, with recovery, sports science and the way the game has been and adapted, it has allowed players to play for longer. We may have a bit more information over what the players had in the past. “But when you look at the players you said [Ronaldo, Messi and Lewandowski]. That makes me believe and shows it is possible to play until your late thirties and that is what I am planning to do.”","pubDate":"2023-10-10 21:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31156858.ece/ALTERNATES/s98/0_Untitled-design-87.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"40685014ba3fd40798a80e55b228a8d0","title":"Roughriders look to clinch playoff spot Friday in Calgary","link":"https://leaderpost.com/sports/football/cfl/saskatchewan-roughriders/sports-riders-look-to-clinch-playoff-spot-against-stamps","keywords":["CFL","Football","Saskatchewan Roughriders","Sports"],"creator":["Taylor Shire"],"video_url":null,"description":"With the season series on the line, the Riders can book their post-season spot this week against the Stampeders","content":"Article content Despite a five-game losing streak, the Saskatchewan Roughriders still control their own fate when it comes to the CFL playoff race. Heading into a Week 19 road game against the 4-11 Calgary Stampeders on Friday (7:30 p.m., TSN), the 6-10 Riders can officially clinch a spot in the post-season with a victory. “You want to always control your own fate and we still have control of that,” Riders’ head coach Craig Dickenson said after practice at Mosaic Stadium on Tuesday. “There’s a few other teams in this league that don’t and it’s tough to motivate those guys when they know they’re already out.” Entering this Friday’s game, the Stamps not only trail the Riders by four points in the West Division standings, but the season series — and standings tiebreaker — is also on the line after the Riders beat Calgary 29-26 in overtime in Week 3 , which was followed by a Stamps 33-31 win in Week 6, when quarterback Trevor Harris was injured. If the Riders lose on Friday, then it sets up for a crucial final two weeks of the season for both teams. For Calgary to get in, they would need a Saskatchewan loss in their Week 20 game against the 13-2 Toronto Argonauts on Oct. 21. The Stampeders would need to beat the 11-5 B.C. Lions on Oct. 20 or beat the 12-4 Winnipeg Blue Bombers on Oct. 27. If Saskatchewan loses to Calgary and then beats Toronto, then the Stamps would have to win both of their games to leapfrog the Riders for the third and final playoff spot in the West Division. The Riders have a bye in the final week of the season. “We’re steering the ship for our own destiny,” said quarterback Jake Dolegala. “We win this week, we’re in and that’s just what we’ve got to do.” While the Riders enter Friday’s game on a five-game skid, after Saturday’s 38-13 loss to the Hamilton Tiger-Cats , the Stampeders haven’t been playing well of late either, having lost six of their last seven games, including three straight contents. “We feel very fortunate,” said Dickenson. “We’ve been lucky in a lot of ways that other teams have lost and we’re still in the mix. “But we’ve got to take advantage of that.” Upon their return to the practice field on Tuesday , Dickenson had a number of veteran players, plus general manager Jeremy O’Day, address the team as they get set for the final two games of the season. The message? “We want better energy, we want to play with a little more emotion and we need to execute,” said the head coach. “We talked a lot about those three things and that we need all of them in order to be successful. “You can’t have one without the other two and expect to be successful.” As the Riders returned for Day 1 of practice on Tuesday, several players missed the workout. Linebacker Derrick Moncrief (shoulder/neck), linebacker T.J. Brunson (neck), receiver Tevin Jones (hamstring), defensive back Jaxon Ford (hamstring) and defensive lineman Charbel Dabire (illness) did not participate. Neither did defensive back Jeremy Clark (knee) who missed last week’s game against Hamilton. The Riders added another player to the roster on Tuesday, signing American defensive back Abu Daramy-Swaray. This season, the 27-year-old played five games with the Winnipeg Blue Bombers, making 23 tackles and a forced fumble. He was released from the Bombers’ practice roster last week. Prior to his time in the CFL, Daramy-Swaray spent time with the NFL’s Cincinnati Bengals, the XFL’s Arlington Renegades and the German Football League’s Potsdam Royals. The 5-foot-9, 176-pounder played college football at Colgate University where he racked up 155 tackles, 25 pass breakups and five interceptions in 44 games, while also serving as a punt and kickoff returner. tshire@postmedia.com Share this Story : Roughriders look to clinch playoff spot Friday in Calgary Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr","pubDate":"2023-10-10 21:19:22","image_url":null,"source_id":"leaderpost","source_priority":72082,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"34d12e00dc90620c5ff8012dd9627294","title":"Host nations from UK, Ireland set to enter Euro 2028 qualifying","link":"https://www.malaymail.com/news/sports/2023/10/11/host-nations-from-uk-ireland-set-to-enter-euro-2028-qualifying/95568","keywords":["Euro 2028"],"creator":null,"video_url":null,"description":"LONDON, Oct 11 — England, Scotland, Wales, Northern Ireland and the Republic of Ireland will enter qualifying for Euro 2...","content":"LONDON, Oct 11 — England, Scotland, Wales, Northern Ireland and the Republic of Ireland will enter qualifying for Euro 2028 despite being named hosts, the head of the English Football Association (FA) said on Tuesday. Uefa awarded the tournament to the five-nation bid after it was unopposed, with Italy and Turkey agreeing to co-host the 2032 European Championship. However, not all the hosts will be guaranteed passage to the 24-team tournament, according to FA chief executive Mark Bullingham. Uefa are reportedly planning to reserve two spots for the best two performing host nations that fail to qualify. England have only failed to qualify once for the Euro since 1984, when it was a 16-team tournament in 2008. But making major tournaments has been a far tougher task for the other four hosts. Northern Ireland have only reached one European Championship in their history. Wales’ only two appearances in the competition have come since it was expanded to a 24-team tournament. Scotland’s qualification for Euro 2020 was their first for any major tournament since 1998, while the Republic of Ireland are currently ranked 55th in the world. “From our point of view, it’s great to be taking part in qualifying and we want to get everyone (all five nations) there,” Bullingham told Sky Sports. “It is better to play in a tournament where it matters and we have competitive games. We’re looking forward to that. “It’s always been part of our discussions with the other countries and Uefa that we would take part in qualifying. We think with the new format of European football that’s the right thing to do.” ‘Good partnership’ England is set to provide six of the 10 venues; Wembley and the Tottenham Hotspur Stadium in London, Manchester City’s Etihad Stadium, Newcastle’s St James’ Park, Villa Park in Birmingham and Everton’s new stadium in Liverpool. Belfast, Cardiff, Dublin and Glasgow will be the other host cities. “It’s a really good partnership. We know we’re going to have five games in Northern Ireland, six in Wales, Scotland and Ireland,” added Bullingham. “It’s brilliant those countries are going to get a significant portion of games, particularly if they end up with some of their own home games - it will really excite the countries.” Football Association of Wales chief executive Noel Mooney confirmed Cardiff was bidding to host the opening match. “Cardiff would be perfect for the opening match,” said Mooney. The Welsh capital, Glasgow, Dublin and Wembley are expected to be handed quarter-finals. However, there remain doubts about the proposed Belfast venue at Casement Park. Plans to redevelop the derelict site into a 34,000-capacity venue have been mired in controversy and hit by delays. Wembley is also set to host both semi-finals and final as it did at Euro 2020. The final two years ago was marred by scenes of violence as supporters stormed the gates to access the stadium. But Bullingham said Uefa had no hesitation in returning to the home of English football for a showpiece occasion. “They know we’ve spent a lot of money upgrading the stadium. They’re really confident we can deliver a brilliant Euros and that’s what we’ll do,” added Bullingham. — AFP","pubDate":"2023-10-10 23:57:58","image_url":null,"source_id":"malaymail","source_priority":105894,"country":["malaysia","singapore"],"category":["sports"],"language":"english"},{"article_id":"8f4a321c1bd579b3310e1b0f38418ede","title":"Has Joao Cancelo made Barcelona better? ","link":"https://www.barcablaugranes.com/2023/10/11/23911742/has-joao-cancelo-made-barcelona-better","keywords":null,"creator":["Nick Batlle"],"video_url":null,"description":null,"content":"This isn’t the same Barcelona that won La Liga a few months ago. That team was led by the heroics of Marc-Andre ter Stegen who tied Francisco Liano for the most clean sheets in Spanish history at 26. The German keeper played in front of a four-man backline that for the majority of the season used a center-back, Ronald Araujo or Jules Kounde, to neutralize dangerous counter attacks that plagued the team the year before. Playing this way wasn’t the plan. Understandably, Xavi wasn’t convinced by Sergino Dest or Sergi Roberto, and was quickly turned off by new signing Hector Bellerin. That left the manager with no choice but to improvise, which led him to realizing that Barcelona was actually quite well off with the defensive approach to the full-back position. No longer was Barcelona shaking their head, and lamenting unforced errors that were costing the team points in the past. It actually felt good to have a sense of calm and security in the back, which turned to excitement when Araujo started putting Vinicius Junior, and other world class wingers, in his pocket. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images If it weren’t for the injuries to these defenders during the Champions League group stage, it’s worth imagining what could have been. In the end, however, Barcelona did claim the league title as a result of their consistent defending, conceding only 20 goals, which is astonishing when you consider that the next best defensive team was Atletico Madrid who allowed 33. But all along, there was a sense that this approach couldn’t continue. As effective as it was, a Barcelona team needed to play like a Barcelona team, and that meant playing total football, which necessarily required attacking ability and skill from the full-backs. On the left side, Alejandro Balde revealed himself as a full-back of the future, but identifying a proven playmaker for the right side remained priority number one. Photo by Fran Santiago/Getty Images And so began mission Joao Cancelo, which was completed right before the close of the summer transfer window. Since his arrival, the Portuguese international has appeared in every game, and in every game, he has made his presence felt. Cancelo is not shy. He wants the ball, and when he has it, he has the confidence to make something happen. Xavi has given him the green light to read the game and express himself. The result has been dangerous balls that have led to assists and goals during clutch moments. With injuries to critical talent in the attack, Barcelona has relied on the creativity of Cancelo, and they are privileged to know if other injuries should occur, they have a versatile player on their hands who can step in and contribute at a high level. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images But the question remains whether Barcelona is a better team this year. In answering that question, Cancelo is front and center, because for better or worse, he is a focal point of this team from a tactical point of view. Ter Stegen has had early struggles, missing saves he would normally make, and looking shaky while playing out of the back. Against Granada, Jules Kounde was caught in a challenging, but manageable, one versus one situation. A battle he ultimately lost, with Barcelona giving up a second early goal. How much blame should be given to the keeper and center-backs? Have they let down the team? After all, this Barcelona squad has already surrendered 10 goals, which means they’re on track to allow in more than 40. In my opinion, Kounde has been excellent, and with Araujo, Andreas Christensen, and Inigo Martinez, Barcelona have enough talent on the backline to stabilize the defense going forward. I one hundred percent believe in Ter Stegen as well. Photo by Fran Santiago/Getty Images The problem is tactical in that Cancelo and Balde are playing high up the field. That means the team must be better on the ball. First order of business, limit the silly turnovers in the midfield. It’s not fair to point the finger at center backs when you’re asking them to constantly put out fires that shouldn’t be created in the first place. Second, Barcelona needs to be more dangerous in the way they attack if this is the approach they want to take. It doesn’t make sense to use extra playmakers if the team doesn’t attack better as a result of it. When you look at the evidence, this is a difficult assessment to make when considering Cancelo. He is definitely one of the most effective attacking players on the team, and Barcelona honestly seems to rely on him for their best moments high up the field. But his presence, with the way he likes to play, also makes the defense more vulnerable. You never know where he’s going to be at any point in time, which leaves a player like Kounde out on an island, especially when you aren’t playing with a true defensive midfielder to help out. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images So what’s the solution? Drop Cancelo all together, and replace him with Kounde or Araujo? Play him in a new position? Maybe as part of a double pivot with Oriol Romeu in a 3-2-4-1 a la Manchester City? Or continue as is with Cancelo playing full-back in the traditional 4-3-3? In the short term, the injury situation will limit Xavi’s choices. Surely, he’ll want Cancelo on the field, especially with El Clasico on the horizon. Real Madrid, however, are no longer playing 4-3-3 with traditional wingers. Does that change the calculation at all? Photo by Florencia Tan Jun/Getty Images These are big questions, and maybe the answer is to go back to what was working last season, especially if Kounde and Araujo willingly allow it. But that will also require players like Pedri, Frenkie de Jong, and Raphinha to get back from injury. In the meantime, regardless of who’s on the field, Barcelona need to be smart, and do the basic things right, regardless of their tactical approach. Take care of the ball. When in doubt, show you can keep it. Especially against teams that play in a low block. And when Cancelo is on the field, maybe their best defense is to press aggressively high up the field, and not rely so much on building from the back. Frankly, they need Frenkie and Pedri in order for that to be effective. Photo by Jose Breton/Pics Action/NurPhoto via Getty Images Whatever approach they take, Xavi needs his men to be well drilled and focused on the mission. So far, it’s been inconsistent. Let’s hope they get healthy, and have a run of games to figure out who they are, and how they want to play. When in doubt, don’t forget what got you so far last season. As the saying goes, it’s the defense that wins championships.","pubDate":"2023-10-10 23:00:00","image_url":null,"source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"27f8097b5fad30ee3e0ee40db05b4ddb","title":"EFL Trophy: Derby County goalkeeper Josh Vickers returns with win after death of wife Laura","link":"https://www.newsr.in/n/Sports/1zpnzuphar/EFL-Trophy-Derby-County-goalkeeper-Josh-Vickers-returns.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Josh Vickers helps Derby County to victory in the EFL Trophy as he returns to football for the first time since the death of his wife. Reported by BBC Sport 2 hours ago.","content":"Tuesday, 10 October 2023 ( 3 hours ago ) Josh Vickers helps Derby County to victory in the EFL Trophy as he returns to football for the first time since the death of his wife. 👓 View full article","pubDate":"2023-10-10 22:00:55","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"711b52a61d8a1785e3299f05afff1790","title":"Papers: PL faces calls from clubs to respond to Israel-Hamas war","link":"https://www.skysports.com/football/news/20876/12982070/premier-league-faces-calls-from-clubs-to-provide-formal-response-to-israel-hamas-war-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Wednesday's newspapers...","content":"All the top stories and transfer rumours from Wednesday's newspapers... DAILY MAIL The Premier League is facing calls from clubs to provide a formal response to the outbreak of war in Israel, with executives at several of them unhappy at the sport's silence since last Friday's terrorist attack by Hamas. Netherlands head coach Ronald Koeman has admitted he is still bitter about Ryan Gravenberch rejecting a national team call-up last month. Manchester United are in a dilemma over what to do with the notoriously leaky roof at Old Trafford. Tottenham defender Eric Dier and former team-mate Matt Doherty have been trading one-word blows on social media after the latter gave away a penalty in Sunday's 1-1 draw against Aston Villa. Manchester United are in discussions to extend the contract of exciting teenage forward Omari Forson who has been named in the England elite development squad (formerly known as U20s) for games against Romania and Portugal during the international break. Stream the Premier League and more with NOW for £21 a month for six months Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Antony's ex-girlfriend Gabriela Cavallin will hold a formal interview with Greater Manchester Police on Thursday. THE SUN Jadon Sancho has \"no relationship\" with manager Erik ten Hag, according to reports. Cristiano Ronaldo is reportedly determined to play at the 2026 World Cup. Italy and Turkey will co-host Euro 2032, despite the joint bid breaching Uefa's own regulations - the European football governing body's rule states that joint-hosts must be neighbouring countries. Chris Coleman has resigned as Atromitos boss in Greece. DAILY MIRROR Jamaica have opened the door to Mason Greenwood resurrecting his international career - three years after the forward was capped by England. Sir Jim Ratcliffe took a share of a £75m dividend after the Mercedes Formula 1 team recorded a significant jump in profits. Spain's Jenni Hermoso has claimed that her image has been tarnished following the unsolicited kiss from former president Luis Rubiales, with the striker adding that \"no-one protected me\". Brentford striker Ivan Toney is keen on a move to Arsenal when his eight-month ban for breaching the FA's betting rules is up in January. Chelsea forward Nicolas Jackson has undergone a minor operation on his wrist - although he is set to be available for the visit of Arsenal when club football returns after the international break. THE ATHLETIC Victor Francos, the Spanish Secretary of State for Sports, believes their men's national team could have done more to support the women's side following former federation president Luis Rubiales' kiss on Jenni Hermoso. West Brom midfielder John Swift will miss six weeks of action with a calf injury. Serie A side Salernitana have appointed Filippo Inzaghi as their new head coach. Diego Alonso has been appointed as Sevilla head coach on a deal until the end of the season. 50 Cent has agreed to sponsor Welsh football team AFC Rumney's girls U14 team. NHL players won't be allowed to put Pride-themed tape on their sticks while on the ice this season as part of a decision made by the board of governors in June. DAILY TELEGRAPH The Football Association's slow response to the terror attacks in Israel has been condemned by its former chairman, the Jewish business executive David Bernstein. Tottenham Hotspur are offering support to the club's Israeli winger Manor Solomon over the Hamas attacks in his home country. Football Association chief executive Mark Bullingham expects Euro 2028 to transform facilities for the grassroots game after describing current standards in the country as \"embarrassing\". Israel Dagg, the former All Black, has expressed his concern for the future of the game in New Zealand ahead of their Rugby World Cup quarter-final against Ireland, believing that \"we're losing the heart and the grassroots of New Zealand rugby\". England players have been playing at the Cricket World Cup wearing different shirts because of a printing error on their Castore kits. THE GUARDIAN Premier League clubs are wary of being seen to take sides in the Middle East conflict and are awaiting guidance from the league over how to commemorate the victims of the attacks in Israel. DAILY EXPRESS The Glazer family will remain Manchester United owners for the January transfer window if they delay their takeover decision beyond November, according to reports. Donny van de Beek could make a return to the Eredivisie as he continues to be frozen out at Manchester United. THE TIMES UK and Ireland have been confirmed by Uefa as the hosts of Euro 2028 with the organisers promising affordable tickets for fans. The World Cup-winning coach Jorge Vilda has denied putting pressure on Spain midfielder Jenni Hermoso to downplay the unsolicited kiss she received from Luis Rubiales, the former president of the Spanish FA. More than 3,600 tickets are still available for England's Rugby World Cup quarter-final against Fiji in Marseille on Sunday, suggesting that fans are yet to be convinced by Steve Borthwick's side. The ECB will hold talks over the international schedule in 2028 to decide whether to leave a gap in the English summer schedule to accommodate the Los Angeles Olympic Games. DAILY RECORD Trent Alexander-Arnold has bizarrely name-dropped former Rangers and Hibs star Brandon Barker as one of the toughest opponents he's ever faced. SCOTTISH SUN Rangers have yet to make a final decision on their next manager. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-10 22:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"838864aea1b52b2bea4c391283934106","title":"Baseball, cricket e lacrosse (ri)bussano alla porta dei Giochi","link":"https://www.laregione.ch/sport/altri-sport/1704027/baseball-cricket-e-lacrosse-ri-bussano-alla-porta-dei-giochi","keywords":["OLIMPIADI"],"creator":null,"video_url":null,"description":"Cinque nuove proposte nel programma delle Olimpiadi di Los Angeles del 2028. Dovranno però superare lo scoglio del Congresso del Cio, che inizia domenica","content":"141esima sessione del Cio, il Comitato olimpico internazionale. Come a ogni nuova edizione dei Giochi olimpici, il comitato organizzatore della città ospitante ha la possibilità di suggerire delle aggiunte ai 28 sport presenti nel programma standard, con discipline più vicine agli interessi dei propri connazionali o che possono attrarre l'attenzione delle nuove generazioni: così hanno fatto i promotori dell'edizione di Los Angeles, e forse in pochi sanno che dei cinque sport che chiedono di entrare a far parte del cartellone il cricket è secondo soltanto al calcio quanto a popolarità globale ben 2,5 miliardi di appassionati, un miliardo dei quali nella sola India, ciò che gli conferisce un enorme forza pensando che la votazione si terrà proprio a Mumbai. Riuscisse a ottenere i voti necessari, il ritorno del cricket alle Olimpiadi colmerebbe una lacuna che dura da oltre un secolo, visto che la sua unica presenza ai Giochi risale addirittura all'edizione 1900 a Parigi. Tuttavia, la durata delle partite del cricket mal si adatta ai tempi della programmazione olimpica, e così sarebbe disputato nel formato accelerato, il cosiddetto Twenty20. Le altre new-entry proposte guardano invece decisamente al mondo sportivo nordamericano. Il baseball (il softball nella versione al femminile) è una religione negli Stati Uniti – oltre che in Giappone, dove peraltro è stato protagonista ai Tokyo 2021, ma non lo sarà più a Parigi –, lo squash è un simbolo della cosiddetta ‘american way of life’, mentre lacrosse e flag football sono ampiamente praticati soprattutto nelle scuole. Il lacrosse, tra l'altro, ha dei precedenti olimpici risalenti agli inizi del secolo scorso (1904 e nel 1908) ed è stato presente come sport dimostrativo nelle edizioni del 1928, 1932 e 1948. Un possibile fattore negativo potrebbe essere proprio la sua connotazione molto nordamericana e scolastica, e inoltre richiede un'attrezzatura piuttosto costosa che ne frena la diffusione nei Paesi meno ricchi. Anche la candidatura dello squash non è esente da pecche, la principale delle quali è la quasi assenza di test sulla capacità di attrarre pubblico televisivo e oltretutto nella fattispeciea si tratterebbe di un debutto olimpico assoluto, al pari del flag football, una versione ridotta e senza contatto fisico del football americano, che ha molto successo tra le donne ma rischia di avere a sua volta scarso appeal negli altri continenti.","pubDate":"2023-10-10 21:46:48","image_url":"https://media.laregione.ch/files/domains/laregione.ch/images/4c3q/1csm2.jpg?v=2","source_id":"laregione","source_priority":4191229,"country":["switzerland"],"category":["sports"],"language":"italian"},{"article_id":"6be44393d5a8ea99b021b155c4668027","title":"Football fan gets on pitch and mocks rivals - who throw tennis balls at his head","link":"https://www.dailystar.co.uk/sport/football/swindon-fan-reading-tennis-balls-31157451","keywords":["Sport"],"creator":null,"video_url":null,"description":"One brave Swindon Town fan invaded the pitch before giving stick to Reading fans who lobbed tennis balls at him, but the Royals had the last laugh","content":"A fan got pelted with tennis balls and other objects as he mocked furious fans after getting onto the pitch at the Select Car Leasing Stadium. Tuesday night proved to be a welcome break from action for Reading as they hosted the League Two side in the EFL Trophy. The Royals’ early season has been marred by talks of administration and points deductions following relegation last season - . Reading find themselves currently in 22nd place in the table after having four points deducted, but even without the deduction, Ruben Selles’ side would still be in the relegation zone. Recent weeks and months have seen Reading fans stage protests against their owner Dai Yongge, including throwing tennis balls onto the pitch. And seemingly those tennis balls are now a permanent fixture of Royals faithful’s matchday attire as furious fans launched tennis balls at a Swindon supporter who had run onto the pitch to mock the home supporters. The Swindon fan ran over to the Reading supporters before hand gestures were exchanged, seeing the Robins fan continue to goad the home fans by holding his arms out and appearing to chant at them as tennis balls and other items were launched from the stands. Stewards could be seen holding back aggressive fans who attempted to charge the Swindon fan. Eventually, a steward appeared to take the fan off the pitch, but before he found himself man-handled, he took himself off and gave himself up. But just as the 5-0 scoreline to the hosts on the night, Reading fans got the last say as he was foolishly taken down an exit by two stewards past the raging home fans who continued to pelt and abuse the man as he was slowly dragged past them. In a rare night to remember for Reading fans, Harvey Knibbs scored a hat-trick, before injury-time goals from Paul Mukairu and Harlee Dean at the end of the second half sealed a dominant display.","pubDate":"2023-10-10 21:45:08","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31157399.ece/ALTERNATES/s98/0_Screenshot-2023-10-10-at-221311.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"73ccaa1ad89114591fd88be336568fcd","title":"Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card","link":"https://www.dailymail.co.uk/sport/football/article-12616111/Howard-Webb-Man-City-Mateo-Kovacic-fortunate-1-0-Arsenal-Martin-Odegaard-Declan-Rice.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"KIERAN GILL: Speaking for the first time since the Diaz debacle on Match Officials Mic'd Up programme, Webb confessed that mistake harmed the refereeing body's reputation.","content":"Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card Gabriel Martinelli scored the only goal to help Arsenal defeat Manchester City Howard Webb was appearing on Match Officials Mic'd Up with Michael Owen Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Kieran Gill for the Daily Mail Published: 19:38, 10 October 2023 | Updated: 22:32, 10 October 2023 e-mail 309 shares 121 View comments Manchester City 's Mateo Kovacic should have seen red against Arsenal , Howard Webb admitted on Tuesday night, as the refereeing body PGMOL owned up to yet another major mistake. For the second successive weekend, the biggest game in the Premier League was overshadowed by an officiating error. Referee Michael Oliver failed to dismiss Kovacic when he fouled Declan Rice while already on a yellow card, a week after Luis Diaz's opener for Liverpool at Tottenham was wrongly disallowed for offside. Speaking for the first time since the Diaz debacle on the PGMOL's Match Officials Mic'd Up programme, Webb confessed that mistake harmed the refereeing body's reputation. Webb admitted Kovacic was fortunate to escape a straight red for a foul on Martin Odegaard , for which he only received a yellow, saying: 'This is clearly a poor tackle and I'm confident if a red card had been given by Michael Oliver on the day, it would have been a very straightforward \"check complete\", but he doesn't.' Howard Webb admitted that Mateo Kovacic was fortunate to remain on the pitch on Sunday Kovacic came under heavy scrutiny for this two robust challenges against Arsenal Man City's Croatian midfielder first fouled Martin Odegaard before a challenge on Declan Rice Your browser does not support iframes. On Kovacic's follow-up foul on Rice, Webb said: 'Second yellows are something the VAR is not able to get involved in. 'But he was extremely fortunate to stay on the field. (Oliver) doesn't want to have a negative impact on the game by overreacting to something… but it is also true that if you under-react you have a negative impact. 'He will realise the second one should have been a yellow card, which would have seen Kovacic sent off.' Numerous pundits and former referees have voiced their own opinions in the ensuing days, with Gary Neville and Mark Clattenburg both claiming that the player should have seen the red. The show is designed to help fans understand more about the refereeing process in the top-flight, with certain VAR calls and real-time decisions dissected on television. Tuesday evening's programme saw Webb and pundit Michael Owen discuss the controversial disallowed Luis Diaz goal from Liverpool's defeat to Tottenham the weekend previous. The goal was disallowed despite the player being clearly onside, due to a miscommunication by the VARs who thought they were checking to confirm the goal was onside, rather than offside. Kovacic avoided a second yellow for a challenge on Declan Rice - which Webb admitted was wrong PGMOL chief Webb was joined by former Liverpool and Man United forward Michael Owen IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Share or comment on this article: Howard Webb admits Mateo Kovacic should have been sent off in Man City's 1-0 defeat by Arsenal after Michael Oliver failed to show him a second yellow card e-mail 309 shares Add comment Comments 121 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-10 21:32:35","image_url":"https://i.dailymail.co.uk/1s/2023/10/10/20/76395225-0-image-a-22_1696965393339.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"226c7e74eb6b7d606fbb5950c4e51432","title":"Striker Bojan Miovski warns Aberdeen ‘are not scared of anyone’ in Europe","link":"https://www.pressandjournal.co.uk/fp/sport/football/aberdeen-fc/6215812/bojan-miovski-warns-aberdeen-fear-no-club-in-europe/","keywords":["Aberdeen FC","Aberdeen","Barry Robson","Bojan Miovski","Europa Conference League"],"creator":["Sean Wallace"],"video_url":null,"description":"The North Macedonian is relishing the challenge of facing Europa Conference League Group G leaders PAOK.","content":"Goal hero Bojan Miovski has warned Aberdeen have no fear of any club in the Europa Conference League, including group leaders PAOK. The Dons face Greek side PAOK in their next Group G game at Pittodrie on Thursday, October 26. PAOK boast a 100% record from their opening two group games having defeated German Bundesliga giants Eintracht Frankfurt (2-1) and Finnish champions HJK Helsinki (3-2). Scottish Premiership Hearts were crushed 6-1 on aggregate by PAOK in the Europa Conference League play-off in in August. Miovski, who has netted three goals in Europe this season, insists Aberdeen “are not scared” of any club in Europe. He said: “PAOK has started the group well but it is OK. “We aren’t scared of anyone. “When we played in Germany, we showed courage and that we can be good on the ball as well. “We know we might not have a lot of time on the ball and we have to concentrate. “And we are looking forward to the next game against PAOK.” PAOK racking up victories In-form PAOK have won 11 of their previous 15 matches in all competitions and sit third in the Greek Super League 1 table. Their only game between beating Eintracht Frankfurt and facing Aberdeen is a home league clash with Atromitos on Sunday, October 22. PAOK were Conference League quarter-finalists in 2022, losing 3-1 to Marseille on aggregate. The Greek outfit have reached the Europa League group stage and progressed to the knock-out round on multiple occasions in the past decade. Miovski said: “We will fully analyse the HJK game then in Europe our full focus will be on PAOK.” BM 9⃣ | — Aberdeen FC (@AberdeenFC) Frustration at missed opportunities are competing in the group stages of Europe for the first time since the 2007-08 UEFA Cup. The of the Euro groups. His headed equaliser could only salvage a point from a game he accepts the Dons engineered enough scoring chances to win. He said: “For me personally it was a great experience because it was only my second game in the group stages. “We will take the point against HJK but are disappointed because we had chances to win the game. “It was good to get off the mark in the group. “We had chances as after my goal Duk had a one-on-one. “It was a great moment to win the game. “The stadium atmosphere was unbelievable and I felt we had them at that moment. “We pushed until the finish but ended up with a point.” Learning lessons in Euro group stage Striker Miovski has delivered in Europe having scored in three of the Dons fixtures on the Continental stage this season. He netted in both legs of th The 24-year-old also impressed in the narrow loss to Eintracht Frankfurt before netting against HJK Helsinki. Miovski has now scored eight goals in all competitions this season. The striker insists valuable Euro lessons will be learned from the goal conceded against HJK Helsinki. He said: “We conceded an easy goal from nothing, a throw-in. “Sometimes we need to work really hard to score ourselves so that was a bit disappointing. “However, it is something we will learn from.” Miovski set to face Ukraine in Euro 2024 qualifier After a hectic schedule balancing Euro group-stage action with domestic commitments the Dons can recharge during the international break. However there is no rest for Miovski who is currently on international duty with North Macedonia. Capped 13 times, Miovski is in contention to start against Ukraine in a Euro 2024 Group C clash on Saturday. The match will be played at the Epet Centre in Prague, Czech Republic due to the ongoing war in Ukraine. North Macedonia are level on seven points with second-placed Italy, with England topping the group. On Tuesday October 17 North Macedonia also host Armenia in a friendly. Miovski said: “The game with Ukraine is the most important in the group. “It is played in Prague and we are looking forward to it.”","pubDate":"2023-10-10 21:30:07","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/10/20876907_53500113-xu67nl06-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"55fcd1b1e1e02102cd73fe2306054cd4","title":"Harry Kane says he'll 'never regret' leaving Spurs – even if they win the Premier League","link":"https://www.dailystar.co.uk/sport/football/harry-kane-bayern-tottenhan-ange-31156838","keywords":["Sport"],"creator":null,"video_url":null,"description":"Harry Kane would love to see Tottenham stun English football by winning the Premier League under Ange Postecoglou after leaving for Bayern Munich","content":"insists he’ll never regret leaving Tottenham – even if his former club win the under Ange Postecoglou. While Kane is enjoying life in Germany, there might be some jealousy to see his former club flying high in the under their new Aussie boss. But he actually wants to see them keep it up and win the title. There won’t be any regret if they do and he’s over in Germany winning the Bundesliga. “I have made it clear my whole career I am a fan and I would love to see Tottenham do well,” said Kane. “There is no other team in the Premier League I would want to win than Tottenham. “To experience a new league, if I got to 40 and I was retired and I looked back and never played in another league I would have always wondered what it would have been like. So now I am here, I am excited and it will always be a decision I never regret.” Kane has scored 59 goals for England to be the nation’s record goalscorer while he also holds the record at 280 goals with . It is that record which earned him the £86m move to Bayern in the summer but he believes he’s yet to hit his peak. The England captain believes he’s got plenty of time yet and he can emulate the likes of , , Robert Lewandowski and Zlatan Ibrahimovic by still plundering goals well into his 30s. “There is definitely room for improvement,” he said. “I have been coming to a stage over the last year or two when it has been coming together, having the experience, knowing your body, knowing the way you want to play, playing in high-pressure games. “When you look at a lot of the top-level players – Ronaldos, Messis, Lewandowskis, Ibrahimovich – they have almost got better as they hit 30. In a lot of sports that happens as well. Everything is maybe settled in your personal life. “You have got family, you have got kids – so that side is all settled. You are comfortable with your body, you are comfortable mentally where you are at and that just allows you to focus on the football. “The perception in sport or football in general is you hit 30 and people start to think the end. But the way I am looking at it is that I almost have the second half of my career. “I played in the first team at Spurs from 20 or 21 so I have had nine or 10 years at the highest level and I am hoping for another eight or nine years at the highest level again. It all depends. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month “You see some players who want to have a different change or challenge so I would never be able to tell you what I will do but at the moment, I just want to keep playing. I think, with everything, with recovery, sports science and the way the game has been and adapted, it has allowed players to play for longer. We may have a bit more information over what the players had in the past. “But when you look at the players you said [Ronaldo, Messi and Lewandowski]. That makes me believe and shows it is possible to play until your late thirties and that is what I am planning to do.”","pubDate":"2023-10-10 21:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31156858.ece/ALTERNATES/s98/0_Untitled-design-87.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"40685014ba3fd40798a80e55b228a8d0","title":"Roughriders look to clinch playoff spot Friday in Calgary","link":"https://leaderpost.com/sports/football/cfl/saskatchewan-roughriders/sports-riders-look-to-clinch-playoff-spot-against-stamps","keywords":["CFL","Football","Saskatchewan Roughriders","Sports"],"creator":["Taylor Shire"],"video_url":null,"description":"With the season series on the line, the Riders can book their post-season spot this week against the Stampeders","content":"Article content Despite a five-game losing streak, the Saskatchewan Roughriders still control their own fate when it comes to the CFL playoff race. Heading into a Week 19 road game against the 4-11 Calgary Stampeders on Friday (7:30 p.m., TSN), the 6-10 Riders can officially clinch a spot in the post-season with a victory. “You want to always control your own fate and we still have control of that,” Riders’ head coach Craig Dickenson said after practice at Mosaic Stadium on Tuesday. “There’s a few other teams in this league that don’t and it’s tough to motivate those guys when they know they’re already out.” Entering this Friday’s game, the Stamps not only trail the Riders by four points in the West Division standings, but the season series — and standings tiebreaker — is also on the line after the Riders beat Calgary 29-26 in overtime in Week 3 , which was followed by a Stamps 33-31 win in Week 6, when quarterback Trevor Harris was injured. If the Riders lose on Friday, then it sets up for a crucial final two weeks of the season for both teams. For Calgary to get in, they would need a Saskatchewan loss in their Week 20 game against the 13-2 Toronto Argonauts on Oct. 21. The Stampeders would need to beat the 11-5 B.C. Lions on Oct. 20 or beat the 12-4 Winnipeg Blue Bombers on Oct. 27. If Saskatchewan loses to Calgary and then beats Toronto, then the Stamps would have to win both of their games to leapfrog the Riders for the third and final playoff spot in the West Division. The Riders have a bye in the final week of the season. “We’re steering the ship for our own destiny,” said quarterback Jake Dolegala. “We win this week, we’re in and that’s just what we’ve got to do.” While the Riders enter Friday’s game on a five-game skid, after Saturday’s 38-13 loss to the Hamilton Tiger-Cats , the Stampeders haven’t been playing well of late either, having lost six of their last seven games, including three straight contents. “We feel very fortunate,” said Dickenson. “We’ve been lucky in a lot of ways that other teams have lost and we’re still in the mix. “But we’ve got to take advantage of that.” Upon their return to the practice field on Tuesday , Dickenson had a number of veteran players, plus general manager Jeremy O’Day, address the team as they get set for the final two games of the season. The message? “We want better energy, we want to play with a little more emotion and we need to execute,” said the head coach. “We talked a lot about those three things and that we need all of them in order to be successful. “You can’t have one without the other two and expect to be successful.” As the Riders returned for Day 1 of practice on Tuesday, several players missed the workout. Linebacker Derrick Moncrief (shoulder/neck), linebacker T.J. Brunson (neck), receiver Tevin Jones (hamstring), defensive back Jaxon Ford (hamstring) and defensive lineman Charbel Dabire (illness) did not participate. Neither did defensive back Jeremy Clark (knee) who missed last week’s game against Hamilton. The Riders added another player to the roster on Tuesday, signing American defensive back Abu Daramy-Swaray. This season, the 27-year-old played five games with the Winnipeg Blue Bombers, making 23 tackles and a forced fumble. He was released from the Bombers’ practice roster last week. Prior to his time in the CFL, Daramy-Swaray spent time with the NFL’s Cincinnati Bengals, the XFL’s Arlington Renegades and the German Football League’s Potsdam Royals. The 5-foot-9, 176-pounder played college football at Colgate University where he racked up 155 tackles, 25 pass breakups and five interceptions in 44 games, while also serving as a punt and kickoff returner. tshire@postmedia.com Share this Story : Roughriders look to clinch playoff spot Friday in Calgary Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr","pubDate":"2023-10-10 21:19:22","image_url":null,"source_id":"leaderpost","source_priority":72082,"country":["canada"],"category":["sports"],"language":"english"}]}