{"newsArray":[{"title":"Fernando Hierro’s Spain in 2018 among all 15 World Cup Fair Play Trophy winners","link":"https://www.hitc.com/en-gb/2022/11/09/hierros-spain-in-2018-among-all-15-world-cup-fair-play-trophy-winners/?utm_source=rss&utm_medium=rss&utm_campaign=hierros-spain-in-2018-among-all-15-world-cup-fair-play-trophy-winners","keywords":["Brazil Football Team","Competitions","England Football Team","FIFA World Cup","Football","Spain Football Team","Teams","qatar world cup"],"creator":["Kyle Archer"],"video_url":null,"description":"The 2022 World Cup in Qatar is just around the corner, so HITC Football has taken a look at every winner of the FIFA Fair... The post Fernando Hierro’s Spain in 2018 among all 15 World Cup Fair Play Trophy winners appeared first on HITC.","content":"The 2022 World Cup in Qatar is just around the corner, so HITC Football has taken a look at every winner of the FIFA Fair Play Trophy. Fernando Hierro’s Spain were the last recipient. Hierro oversaw a disciplined unit in Russia four years ago after he stepped in to manage La Roja. The Royal Spanish Football Federation (RFEF) fired Julen Lopetegui two days before their opening game. Hierro was serving as the national side’s sporting director at the time. The RFEF fired Lopetegui on the eve of Russia 2018 after Real Madrid announced he would replace Zinedine Zidane. He accepted Los Blancos’ offer to coach the La Liga side without informing the RFEF of his negotiations, the RFEF claimed. He was unbeaten after 20 games. Photo by Sefa Karacan/Anadolu Agency/Getty Images Spain would go on to top Group B at the 2018 World Cup from Portugal, Iran and Morocco. But the host nation, Russia, ended La Roja’s journey in the Round of 16. Sbornaya took the 2010 champions all the way to penalties after a 1-1 draw, before emerging as 4-3 winners. WORLD CUP: WHO IS QATAR BOSS FELIX SANCHEZ, WHO STARTED AT BARCELONA? FIFA still gave Spain its most recent Fair Play Trophy at a World Cup. It recognises the team or teams that record the best disciplinary record and/or show sportsmanship among those to reach the second round. FIFA introduced it in 1970 and gave an actual trophy from 1982. So, with Qatar 2022 now just around the corner, HITC Football has taken a look back at all 15 previous winners of the FIFA Fair Play Trophy at each World Cup since the 1970 edition. There have been multiple winners at just two of the 13 tournaments with the award so far. 1970: Peru won the first FIFA Fair Play Trophy at the Mexico World Cup Peru won the first FIFA Fair Play Trophy at the 1970 World Cup in Mexico. La Blanquirroja reached the quarter-finals before losing 4-2 to Brazil in Guadalajara. The South Americans were also the only nation to make the knockout stages without receiving a single caution. 1974: West Germany won the World Cup Fair Play Trophy on home soil West Germany hosted the World Cup in 1974 and won the second FIFA Fair Play Trophy. It was the lesser of their two titles that year, though, as they also sealed a second World Cup title. West Germany went through the summer having only received three yellow cards. WORLD CUP: SENEGAL BOSS CISSE PLAYED FOR BIRMINGHAM AND PORTSMOUTH 1978: Argentina won the Fair Play Trophy while hosting the World Cup Argentina won the Fair Play Trophy on home soil in 1978 as La Albiceleste hosted and won their first World Cup in 1978. Mario Kempes fired Argentina to glory with a Golden Boot-winning six goals. While referees only showed Argentina four yellow cards over their ties. Photo by Alessandro Sabattini/Getty Images 1982: Brazil won the first physical Fair Play Trophy at the Spain World Cup Brazil won the first physical Fair Play Trophy in 1982 as Spain hosted the World Cup. The Selecao only made the second group stage that year as Italy pipped the South Americans for a semi-final slot. But Brazil left Europe after only receiving two yellow cards in five ties. 1986: Brazil won a successive Fair Play Trophy on their trip to Mexico Brazil sealed a successive Fair Play Trophy on their trip to Mexico for the 1986 World Cup. The Selecao reached the quarter-finals before losing 4-3 on penalties to France after a 1-1 draw. The South Americans also only earned three yellow cards through their five fixtures. 1990: England won their first World Cup Fair Play Trophy at Italia 90 England won their first FIFA Fair Play Trophy at a World Cup at Italia 90 as the Three Lions finished fourth. They received six yellow cards over their ties en route to losing to the host nation in the third-place play-off. It was England’s best finish since their only title in 1966. WORLD CUP: EVRA’S REVOLT AND ANELKA’S EXPULSION TAINTED FRANCE’S DIRE 2010 1994: Brazil produced the best disciplinary record once again in the USA Brazil again produced the best disciplinary record to set the standards in the United States of America in 1994. The Selecao won yet another FIFA Fair Play Award at the World Cup as they lifted the fourth of their five titles. Even though they received eight yellows and a red. 1998: England shared the FIFA gong as the host nation, France, won big France and England shared the Fair Play Trophy in 1998 as the former went on to win their first World Cup title. Les Bleus achieved global success on home soil at a tournament that had 10 yellow cards and a dismissal for two bookings. England had five yellows and a red. Photo by Tim De Waele/Getty Images 2002: Belgium won the disciplinary award in Japan and South Korea Belgium won the Fair Play Trophy at the first World Cup held in Asia in 2002 as Japan and South Korea co-hosted the event. The Red Devils only made the Round of 16 before losing to eventual champions Brazil. They also received seven yellow cards over their four games. 2006: Brazil and Spain shared the gong as Germany hosted the World Cup Brazil and Spain shared the Fair Play Trophy in 2006 while Germany hosted the World Cup. Even though the Selecao earned 11 yellow cards to La Roja’s six. Brazil also only made the quarter-finals before losing to France, who had eliminated Spain during the Round of 16. WORLD CUP: WHY GERMANY 2006 WENT WRONG FOR ENGLAND’S GOLDEN GENERATION 2010: Spain won their first World Cup and a Fair Play Trophy in South Africa Spain won their first – and so far only – World Cup title at the 2010 World Cup in South Africa. Vicente del Bosque’s side also earned the Fair Play Trophy and the first – and so far only – World Cup to be held in Africa. La Roja received eight yellow cards during their ties. 2014: Colombia produced the best disciplinary record on Brazilian soil Colombia earned recognition from FIFA for their fair play at the 2014 World Cup in Brazil. Los Cafeteros topped Group C with three wins from three and eliminated Uruguay in the last 16 before losing to Brazil. The South Americans also only received five yellow cards. 2018: Hierro oversaw a disciplined Spain side as their interim boss in Russia FIFA awarded Spain the most recent Fair Play Trophy at a World Cup ahead of Qatar 2022 at Russia 2018. La Roja stood out during difficult circumstances with Lopetegui’s late firing and Hierro stepping in. Referees only showed Spanish players two yellow cards in four ties. Photo by Peter Lous/Soccrates/Getty Images The post Fernando Hierro’s Spain in 2018 among all 15 World Cup Fair Play Trophy winners appeared first on HITC.","pubDate":"2022-11-09 06:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"L'essentiel du sport dans nos régions. L'attente pour Olivier Giroud, l'espoir pour Amine Gouiri, le départ pour la Route du Rhum... les infos de ce mercredi 9 novembre","link":"https://www.ledauphine.com/sport/2022/11/09/l-attente-pour-olivier-giroud-l-espoir-pour-amine-gouiri-le-depart-pour-la-route-du-rhum-les-infos-de-ce-mercredi-9-novembre","keywords":["Sport","Sport national","Fil Info","Edition Annecy / Rumilly / Les Aravis","Edition Annonay / Nord Ardèche","Edition Aubenas / Privas / Vallée du Rhône","Edition Bourgoin-Jallieu / Nord-Isère","Edition Chambéry / Aix-les-Bains","Edition Grand Genève / Chablais / Ain","Edition Grenoble / Agglomération","Edition Grésivaudan / Oisans","Edition Hautes-Alpes / Alpes de Haute-Provence","Edition La Tour-du-Pin / Nord-Isère","Edition Mont-Blanc / Arve","Edition Montélimar / Drôme Provençale","Edition Provençale","Edition Romans / Nord Drôme","Edition Tarentaise / Maurienne","Edition Valence / Rhône Crussol / Vallée de la Drôme","Edition Vienne / Roussillon","Edition Voiron / Saint-Marcellin","Hautes-Alpes","Haute-Savoie","Savoie","Isère","Ain","Haute-Provence","Drôme","Vaucluse","Ardèche","Galerie Média","Galerie photo","Galerie Sport"],"creator":null,"video_url":null,"description":"Le buteur isérois va savoir ce mecredi soir s'il va disputer sa troisième Coupe du monde de football ; le jeune attaquant isérois de Rennes est nommé pour être le meilleur joueur d'octobre en Ligue 1 après un très beau mois ; la Route du Rhum va se lancer ce mercredi avec 5 skippers régionaux dans sa flotte… voici l'essentiel de l'actualité sportive régionale de ce mercredi 9 novembre.","content":null,"pubDate":"2022-11-09 05:30:00","image_url":"https://cdn-s-www.ledauphine.com/images/EC64C47E-4C60-4C95-B8B4-9C9C1DB64662/NW_listB/football-coupe-du-monde-alors-que-didier-deschamps-va-annoncer-sa-liste-officielle-pour-le-mondial-au-qatar-ce-mercredi-au-jt-de-tf1-a-partir-de-20h-olivier-giroud-va-savoir-s-il-va-bien-disputer-sa-troisieme-coupe-du-monde-fort-de-ses-dernieres-prestations-avec-les-bleus-et-le-milan-l-attaquant-grenoblois-de-36-ans-semble-incontournable-photo-maxppp-christophe-petit-tesson-1667952622.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Football. Karim Benzema à Lyon vendredi pour présenter son Ballon d’Or ?","link":"https://www.ledauphine.com/sport/2022/11/09/karim-benzema-attendu-a-lyon-vendredi-pour-presenter-son-ballon-d-or","keywords":["Sport","Football","OL (Olympique Lyonnais)","Sport national","Fil Info"],"creator":null,"video_url":null,"description":"Trois semaines après avoir remporté le Ballon d'or, Karim Benzema serait à Lyon ce vendredi 11 novembre pour présenter son trophée au Groupama Stadium à la mi-temps de la rencontre entre l'OL et Nice, comptant pour la 15e journée de Ligue 1, selon le site Olympique et Lyonnais, confirmé par RMC Sport.","content":null,"pubDate":"2022-11-09 05:05:00","image_url":"https://cdn-s-www.ledauphine.com/images/35C36200-9A78-41F5-A495-D17F261EF512/NW_listB/karim-benzema-photo-maxppp-1667935867.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Football / Chronique. Laurent Paganelli : « Avec ce but face à Lyon, Gigot est devenu un héros populaire »","link":"https://www.ledauphine.com/sport/2022/11/08/le-coup-franc-de-paga-avec-ce-but-face-a-lyon-gigot-est-devenu-un-heros-populaire","keywords":["Sport","Football","OM (Olympique de Marseille)","Ligue 1 (Football)","Avignon","Avignon-bassin","Edition Provençale","Vaucluse"],"creator":null,"video_url":null,"description":"« Quand j’entraînais à la MJC Avignon, je l’avais comme jeune joueur en débutant de 4 à 7 ans.","content":null,"pubDate":"2022-11-09 05:05:00","image_url":"https://cdn-s-www.ledauphine.com/images/36C85F92-AD6A-4EEC-9268-59752292D567/NW_listB/photo-le-dl-ch-agostinis-1667943092.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Daily Schmankerl: The aftermath of Bayern Munich vs. Werder Bremen; Toni Kroos talks Pep’s impact; Napoli’s Khvicha Kvaratskhelia is the next big thing on the transfer market; FC Barcelona eyeing Youssofa Moukoko; and MORE!","link":"https://www.bavarianfootballworks.com/2022/11/9/23438390/bayern-munich-werder-bremen-kroos-pep-napolis-khvicha-kvaratskhelia-transfer-fc-barcelona-moukoko","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Photo by Adam Pretty/Getty Images Bayern Munich crushed Werder Bremen. Die Folgen: Bayern’s 6-1 win over Bremen (Bavarian Football Works) Bayern Munich got started early and often against Werder Bremen in a fantastic 6-1 win that showed how truly dominant this squad can be. Let’s get right to it! Here are some quick hitters on the match: Julian Nagelsmann did not make any crazy changes to his lineup. Lucas Hernandez pushed out to left-back with Alphonso Davies banged up. Serge Gnabry got the call at right-wing over Leroy Sane and Kingsley Coman as well: STARTING XI Here is how we lineup for the last home match of the year! #FCBSVW pic.twitter.com/isUs3tmNDx— FC Bayern US (@FCBayernUS) November 8, 2022 If you missed the ESPN pregame coverage, you missed an appearance from former Dallas Cowboys great Michael Irvin: Michael Irvin is really looking forward to Bayern's finger-licking defense pic.twitter.com/7MQe7lfTfc— ESPN+ (@ESPNPlus) November 8, 2022 Jamal Musiala rebounded from a somewhat off game over the weekend to get the scoring started in the 6th minute. Nagelsmann is going to have a hell of a time keeping Musiala out of the lineup when everyone is healthy — and I don’t think the manager is going to play him at wing. Werder Bremen would quickly nullify that Bayern Munich lead when Mitchell Weiser slide a perfect pass to Anthony Jung, who took advantage of the Bayern Munich backline being asleep at the wheel. Noussair Mazraoui looked completely caught off-guard when he realized Jung slipped behind him. I would not say Serge Gnabry, who was playing as a right-wing was really busting it to get back and help defensively either. Perhaps you could argue that Benjamin Pavard was also sucked too far over, but to me, Mazraoui needed to cover that area far better than he did. One thing that Bayern Munich misses without Matthijs de Ligt is a vocal leader, who directs traffic on the backline. I’m not going to crush Mazraoui too much for the goal — it was more of a total breakdown on the backline — but I think the talk of him being ready to take over for Pavard is a little premature. There is definitely some work that needs to be done. Bayern Munich looked like it would re-take the lead when Gnabry drew a penalty and Eric Maxim Choupo-Moting did a poor job from the spot (I may have PTSD from watching so missed penalty attempts over the past week) as Jiri Pavlenka saved it. I am always a proponent of the person drawing the PK, actually taking it (unless you just have a money man like Robert Lewandowski taking it). I’d have been okay with Gnabry taking it for sure. In the 20th minute Sadio Mané picked up a knock was replaced by Leroy Sané. With the World Cup so close, it is always tough to see a player pick up an injury. Gnabry would get his due in the 23rd minute when he curled in a perfect shot. It was such a terrific finish from Gnabry. The Germany international is so, so good when he is on his game. Minutes later Leon Goretzka made a terrific run and received a perfect feed from Joshua Kimmich for a goal before Sane set up Gnabry for another goal to make it 4-1 in the 28th minute. I can’t really say enough about the effort of Goretzka on his play, the touch of Kimmich’s pass, the unselfishness of Sané, and the relentless run of Gnabry. Just tremendous play from the boys. Gnabry eventually got his deserved hat trick in the second half. Mathys Tel also made a sensation run with the ball and scored a pretty wild goal that would have earned him a ton of guff if he has missed. Overall, what can you say? Bayern Munch was outstanding and dominated the match. If you missed our Initial Analysis, Match Awards, Observations, or Postgame Podcast, give them a look or a listen: Kroos says Pep was best fit for him (Sport Bild) Real Madrid midfielder Toni Kroos has a very interesting take on which coach in his career was “best” for his game: Kroos says of Guardiola: “If I have to choose a coach who is perfect for my game, it is Guardiola. I really enjoyed the year with him, it improved me a lot.” After the 2014 World Cup, he moved to Real Madrid for €25m. And that, although Kroos explains: “Guardiola fought until the last day so that I could stay with Bayern.” The reason for his departure was not the coach, but the lack of appreciation of the Bayern bosses. After he could not agree on a contract extension with the German record champions, Kroos made the turn. Do you ever sometimes wonder how things might have been different if Kroos had stuck around Bayern Munich? Bavarian Podcast Works: Weekend Warm-up Podcast Season 2, Episode 18 Bayern Munich finished off a dominant Champions League run, Germany got some unexpected injury news, and Benjamin Pavard’s tenure at Bayern Munich could be coming to an end — right as he is hitting his peak as a player. As always, there is a TON to talk about, so this is what we have on tap for this episode: Bayern Munich’s incredible Champions League run. A quick look at Bayern Munich’s possible Champions League draw — and a look at what kind of coverage is in store on BFW. Eric Maxim Choupo-Moting to....Manchester United? Benjamin Pavard is hitting his prime...and now he’s like leaving Bayern Munich. Timo Werner’s injury for Germany, what that means for Hansi Flick’s roster, and is Toni Kroos coming back? My TV watching has suffered as the Phillies have gone on this incredible run. Kvaratskhelia is a wanted man! (@FabrizioRomano) Napoli’s Khvicha Kvaratskhelia is one of the most coveted players in Europe at the moment. Can he stay hot long enough for some big club to throw nine figures at the Italian club? ▫️ “I offered Khvicha Kvaratskhelia to many top clubs”▫️ “They didn’t trust a Georgian guy, they missed on scouting”▫️ “He was available on the market, here’s what happened”. Clubs & more behind the scenes… Interview to agent Christian Emile: https://t.co/tBPKQ4UnsL pic.twitter.com/uCbcpECbVj— Fabrizio Romano (@FabrizioRomano) November 1, 2022 According to reports compiled by 90Min.com, Liverpool and Chelsea FC are both very interested in the Napoli star: Napoli’s breakout talent Khvicha Kvaratskhelia has been linked with Liverpool and Chelsea but could cost up to €100m. United eyeing Leipzig’s Haidara (Fichajes) Manchester United wants RB Leipzig midfielder Amadou Haidara: Manchester United, which will have to play the Europa League Playoff in February, seeks to continue improving its project little by little with interesting steps. That already thinking about the key of the winter market, they have as their objective some punctual touch-ups in the Erik Ten Hag squad with some incorporation. The 24-year-old Malian is a footballer who performs at a high level in the Bundesliga with the German club that will be in the knockout stages of the Europa League in any case. An extremely interesting footballer for the British team that should not involve a large outlay, as Tribal Football reveals. Bavarian Podcast Works Season 5, Episode 19 (Bavarian Football Works) So the Champions league draw is over, which is the reason why we delayed recording this podcast until Monday so we could talk about who Bayern Munich will play in the Round of 16. It turned out to be Paris Saint-German, a team we’ve faced a number of times in the last few years. Boasting an attack with the likes of Leo Messi, Neymar, and Mbappe, the Parisians have a formidable XI that can beat any team on their day. Meanwhile there is also the game against Werder Bremen on Tuesday, which is worth discussing because we need to talk about how Julian Nagelsmann will fare with the World Cup looming. So lots to talk about in a quick pod. In this episode, INNN and Schnitzel discuss: How we feel about drawing PSG yet again. How the World Cup could affect the tie — in terms of both fatigue and mentality. Is this the must-watch game of the Round of 16? Will former Bayern youngster Renato Sanches play in the tie? PSG’s attack vs Bayern’s defense — how they stack up. The playbook to stop Leo Messi. Joshua Kimmich vs Marco Verratti and the midfield battle. What about the rest of the Bundesliga — how will RB Leipzig, Borussia Dortmund, and Eintracht Frankfurt fare? Moving onto the Werder Bremen preview — how does Bremen stack up? Why Bremen are like the Fulham of the Bundesliga (Schnitzel explains). Nagelsmann’s options to replace Phonzie, and the overall fullback conundrum. INNN laments the downfall of the Muller Mafia. Barca closing in on Silva? (Sport via 90Min.com) FC Barcelona could be getting serious about Manchester City’s Bernardo Silva once more: Barcelona will revive their interest in Manchester City midfielder Bernardo Silva following Gerard Pique’s retirement, as not having to pay the Spaniard’s wages has cleared up space to move for the Portuguese midfielder. (Sport) Barca eyeing Moukoko? (Fichajes) FC Barcelona could also be plotting a move for Borussia Dortmund striker Youssofa Moukoko, who might also have his eye on a future outside of BVB: According to Sport, Youssoufa Moukoko is on the agenda for the next transfer window. At 17 years old, the German striker has become the youngest player to reach 10 goals in the Bundesliga. Free agent at the end of the season, the arrival of the Teutonic attacker would not represent a great investment for the Catalans. However, the Catalans will have to overcome tough competition to get the services of the young attacker. His contractual condition makes him one of the great market opportunities and teams like Real Madrid, Juventus and Liverpool have already set their sights on him. For his part, the player does not rule out renewing his contract with Borussia Dortmund.","pubDate":"2022-11-09 05:00:00","image_url":null,"source_id":"bavarianfootballworks","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"EPL: Mikel Arteta wants Arsenal’s summer signing out of Emirates","link":"https://dailypost.ng/2022/11/09/epl-mikel-arteta-wants-arsenals-summer-signing-out-of-emirates/","keywords":["Sport","arsenal","emirates","EPL","Mikel Arteta"],"creator":["John Owen Nwachukwu"],"video_url":null,"description":"Arsenal boss, Mikel Arteta wants one of his summer recruits, Marquinhos out of the club in January. The Gunners’ boss wants to send the midfielder on loan in order to create space for some arrivals. The Brazilian teenager joined the Gunners from Sao Paulo for £3million over the summer of 2022. Marquinhos has scored one […] EPL: Mikel Arteta wants Arsenal’s summer signing out of Emirates","content":"Daily Post Nigeria EPL: Mikel Arteta wants Arsenal’s summer signing out of Emirates Home News Politics Metro Entertainment Sport Sport EPL: Mikel Arteta wants Arsenal’s summer signing out of Emirates Published on November 9, 2022 By John Owen Nwachukwu Arsenal boss, Mikel Arteta wants one of his summer recruits, Marquinhos out of the club in January. The Gunners’ boss wants to send the midfielder on loan in order to create space for some arrivals. The Brazilian teenager joined the Gunners from Sao Paulo for £3million over the summer of 2022. Marquinhos has scored one and provided as many assists in four games for Arsenal. The Evening Standard reports that Arsenal are now willing to allow him leave on loan in order to receive more regular first-team football. While Arteta did not send him on loan immediately after signing him in June was due to Arsenal’s involvement in Europa League. Related Topics: arsenal emirates EPL Mikel Arteta Up Next LaLiga: Lewandowski, Pique sent off as Barcelona go 5pts clear of Real Madrid Don't Miss LaLiga: Xavi reacts as Barcelona beat Osasuna, go 5pts clear of Real Madrid You may like EPL: Tim Sherwood picks surprise club to challenge Man City for title if Arsenal fails EPL: They will win it by 10 to 15pts – Gary Neville predicts title winners EPL: You must pay over odds – Teddy Sheringham tells Man Utd two players to sign EPL: Without them, Arteta’s men will drop – Rio Ferdinand reveals Arsenal’s two most important players EPL: Shut your mouth – Sherwood blasts Ten Hag over comments on Ronaldo EPL: Graeme Souness excludes Man Utd, Chelsea from Top 4 finish this season Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2022-11-09 04:54:32","image_url":null,"source_id":"dailypost","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Carabao Cup: I’d have stayed at Brighton – Potter admits ahead of Man City clash","link":"https://dailypost.ng/2022/11/09/carabao-cup-id-have-stayed-at-brighton-potter-admits-ahead-of-man-city-clash/","keywords":["Sport","Brighton","Carabao Cup","man city","Potter"],"creator":["Ifreke Inyang"],"video_url":null,"description":"Chelsea boss, Graham Potter has said he is ready for the extra scrutiny and pressure at Stamford Bridge. According to him, he would have stayed at Brighton if he wanted an easy life. Potter replaced Thomas Tuchel in September and oversaw a fine start, before successive defeats in the Premier League to Brighton and Arsenal. […] Carabao Cup: I’d have stayed at Brighton – Potter admits ahead of Man City clash","content":"Chelsea boss, Graham Potter has said he is ready for the extra scrutiny and pressure at Stamford Bridge. According to him, he would have stayed at Brighton if he wanted an easy life. Potter replaced Thomas Tuchel in September and oversaw a fine start, before successive defeats in the Premier League to Brighton and Arsenal. Chelsea are now 13 points adrift of top spot. They face a huge Carabao Cup third round clash against Manchester City and then their final league fixture before the World Cup break at high-flying Newcastle United. Chelsea managers typically come under pressure following a poor run, but new co-owners Todd Boehly and Clearlake Capital have been keen to stress they have a long-term vision with Potter at the helm. When asked about the working environment at the club, Potter said on Tuesday: “I would say it is a little bit unfair to assess Chelsea now because the change of ownership has happened. We are on a new direction, a new path and ultimately that is part of the challenge. “If I wanted a nice easy life, I could have quite easily stayed working at Brighton in the Premier League and signed a new contract and been absolutely OK. “And I wouldn’t have had too many questions about myself or pressure or sacking or anything like that.” He added that “one of the reasons to come here as there were many, it’s a fantastic football club, potentially one of the best in the world that can compete for any major trophy.” Carabao Cup: I’d have stayed at Brighton – Potter admits ahead of Man City clash","pubDate":"2022-11-09 04:48:24","image_url":null,"source_id":"dailypost","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Transferts - PSG : Campos se heurte à un nouveau mur sur le mercato","link":"https://le10sport.com/football/mercato/transferts-psg-campos-se-heurte-a-un-nouveau-mur-sur-le-mercato-620886","keywords":null,"creator":null,"video_url":null,"description":"En tant que conseiller football du PSG, Luis Campos aurait des vues sur Victor Osimhen qui pourrait ne pas s’éterniser du côté du Napoli au vu de l’intérêt du club de la capitale, mais aussi celui de…","content":"En tant que conseiller football du PSG, Luis Campos aurait des vues sur Victor Osimhen qui pourrait ne pas s’éterniser du côté du Napoli au vu de l’intérêt du club de la capitale, mais aussi celui de Tottenham. En marge du mercato estival de 2023, Luis Campos aimerait réussir là où il a échoué lors de la dernière intersaison. En effet, après le départ d’ Arnaud Kalimuendo au Stade Rennais , Christophe Galtier réclamait le recrutement d’un avant-centre en août dernier. Les noms de Marcus Rashford et de Rafael Leao ont été liés au PSG, mais aucun des deux attaquants n’ont déposé leurs valises au Paris Saint-Germain. Conseiller football du PSG , Luis Campos a coché le nom d’un autre buteur sur le marché des transferts à en croire les informations divulguées par Média Foot, en la personne de Victor Osimhen . Mercato - PSG : Quand le clan Messi lâchait un vu à Leonardo https://t.co/89mvTB82Sg pic.twitter.com/8gKGfwAEwR D’après les informations divulguées par le journaliste Rudy Galetti , le PSG serait contrait de se frotter à Tottenham . La cause ? L’équipe entraînée par Antonio Conte saurait que l’avenir d’ Harry Kane pourrait ne pas s’écrire dans le nord de Londres en raison notamment de l’intérêt du Bayern Munich . Pour le remplacer, Galetti affirme que Tottenham se pencherait sur la situation de Victor Osimhen .","pubDate":"2022-11-09 04:45:00","image_url":"https://le10static.com/img/cache/article/100x63/0000/0021/216077.jpeg","source_id":"le10sport","country":["france"],"category":["sports"],"language":"french"},{"title":"Bengals-Steelers flexed out of Sunday Night Football in Week 11","link":"https://www.wcpo.com/sports/football/bengals/bengals-steelers-flexed-out-of-sunday-night-football-in-week-11-chiefs-chargers-moved-to-prime-time","keywords":null,"creator":null,"video_url":null,"description":"The AFC West matchup between the Kansas City Chiefs and Los Angeles Chargers was moved to the 8:20 p.m. slot on Nov. 20. Bengals-Steelers was moved to 4:25 p.m. on CBS.","content":"CINCINNATI — The Bengals will no longer play on Sunday Night Football during Week 11, the NFL announced. Instead, the AFC West matchup between the Kansas City Chiefs and Los Angeles Chargers was moved to the 8:20 p.m. slot on Nov. 20. Bengals-Steelers was moved to 4:25 p.m. on CBS. The NFL started implementing a flexible schedule for Sunday Night Football in 2006 to make sure \"quality matchups\" were played on prime time. The league allows flex schedules twice between Weeks 5-10 and then again between Weeks 11-17. Cincinnati doesn't appear phased by the change, posting on social media a clip of quarterback Joe Burrow talking about how he does not care when or where he plays with the caption, \"Our official statement in response to being flexed out of Sunday Night Football.\" \"I don't care about any of that,\" Burrow said in a video from a previous press conference. \"I'll play at 6 a.m., in the middle of the field somewhere, I don't care.\" Our official statement in response to being flexed out of Sunday Night Football. pic.twitter.com/CMkGBBZ571 The Bengals have already been on prime time on several occasions this season. The team faced the Ravens on Sunday Night Football on Oct. 9, losing on a last-second field goal by Justin Tucker. The Bengals also played the Dolphins and Browns during Monday Night Football and Thursday Night Football, respectively. Week 11 was not the last time Bengals fans would have seen their favorite team play at night. Cincinnati hosts the Buffalo Bills Monday, Jan. 2 at 8:30 p.m. on WCPO 9.","pubDate":"2022-11-09 03:54:02","image_url":null,"source_id":"wcpo","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"End Of An Era For Uruguayan Strike Duo Luiz Suarez and Edinson Cavani","link":"https://sports.ndtv.com/football/end-of-an-era-for-uruguayan-strike-duo-luiz-suarez-and-edinson-cavani-3502854","keywords":["Football"],"creator":["AFP"],"video_url":null,"description":"For the last decade and a half, Uruguay's national football team has been led by a formidable attacking duo but now veterans Luis Suarez and Edinson Cavani are heading into their final World Cup with...","content":null,"pubDate":"2022-11-09 03:31:39","image_url":"https://c.ndtvimg.com/2021-05/10agchj_luis-suarez-afp_625x300_21_May_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Socceroos' Souttar unscathed in comeback","link":"https://www.perthnow.com.au/sport/soccer/socceroos-souttar-unscathed-in-comeback-c-8803757","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"Socceroos defender Harry Souttar says he is ecstatic to have emerged unscathed from his return to top-level football after a knee reconstruction.","content":"Socceroos defender Harry Souttar feels stiff and sore but ecstatic after returning to top-level football from an injury-enforced year out. The imposing centre-back said his return for Stoke City overnight Australian time could not have gone better. Just hours after being named in Australia's 26-man squad for the World Cup, Souttar played 90 minutes in Stoke's 2-0 win over Luton in the English Championship - his comeback to elite football after a knee reconstruction. \"A little bit stiff, a little bit sore, the calves are a little bit tight, but I feel fine,\" he told Stoke's website. \"I got through OK, no injuries. So just happy to be out there.\" Souttar suffered a torn anterior cruciate ligament in his right knee when playing for the Socceroos against Saudi Arabia in a World Cup qualifier on November 11 last year. \"When I done my injury ... the first thing I thought of was, 'Right, I have got a year to get fit for the World Cup',\" he said. \"As the weeks went by and the months went by, it was kind of looking like it was going to be touch and go. \"I am just grateful I made it.\" Souttar played four games of increasing match minutes for Stoke's under-23 side before his first-team recall. \"I feel good, I feel fit,\" he said. \"I have done a lot of work behind the scenes trying to get my body back fit. \"I am not as fit as I would like to be, because it takes five-to-10 games to get to what I was before. \"But I feel really, really good ... just ecstatic to be back out there.\"","pubDate":"2022-11-09 03:16:44","image_url":"https://images.perthnow.com.au/publication/C-8803757/bdbbaef1de40ce2b5a84c76212c90da1453218f0-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Nigerian-born Footballer, Dansu, Making Waves In USA","link":"https://leadership.ng/nigerian-born-footballer-dansu-making-waves-in-usa/","keywords":["Sports"],"creator":["Isaiah Benjamin"],"video_url":null,"description":"Gabriel Dansu may not be a familiar name to Nigerian football fans despite starting his football career in Lagos, commercial nerve centre of the country. The Nigerian born 5’9 inches tall central midfielder began his football career with Splendid Youth FC of Lagos in 2010, before leaving for Abuja football club, Ako FC where he […]","content":"Gabriel Dansu may not be a familiar name to Nigerian football fans despite starting his football career in Lagos, commercial nerve centre of the country. The Nigerian born 5’9 inches tall central midfielder began his football career with Splendid Youth FC of Lagos in 2010, before leaving for Abuja football club, Ako FC where he spent two years before leaving the shores of Nigeria to join African United FC in the United States of America (USA) in 2017, spent seasons at the Club with remarkable achievements. In his quest to improve on his professional football career, Nigerian switched to Selecta FC, still in the United States and played for one season. The right-footed Gabriel Dansu who can also effectively play as a winger, currently plays for Pittsburgh City FC in United Premier Soccer League, the USA fourth division football league and has been valued at several thousands of US Dollars as he continues to win the admiration of clubs and scouts both within and outside the US due to his excellent passing ability, ball control, dribbling, shooting and shielding attribute skills. Experts are of the opinion that Dannsu’s mobility, sharp and lethal understanding of the round leather game playing prowess is worthy of being taking advantage of in the Nigerian teams.","pubDate":"2022-11-09 03:02:37","image_url":null,"source_id":"leadership","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"2022/2023 Season: Bagudu Approves N60m For Kebbi Utd FC","link":"https://leadership.ng/2022-2023-season-bagudu-approves-n60m-for-kebbi-utd-fc/","keywords":["Sports"],"creator":["Kabir Wurma"],"video_url":null,"description":"Kebbi state Governor, Abubakar Atiku Bagudu has given the approval of the immediate release of sixty million naira to the state United Football club (FC) for its activities in 2022-2023. Chairman Nigerian Football Federation in the state, Abubakar CHika Ladan who disclosed this yesterday to leadership in Birnin kebbi said it is part of the […]","content":"Kebbi state Governor, Abubakar Atiku Bagudu has given the approval of the immediate release of sixty million naira to the state United Football club (FC) for its activities in 2022-2023. Chairman Nigerian Football Federation in the state, Abubakar CHika Ladan who disclosed this yesterday to leadership in Birnin kebbi said it is part of the governor’s efforts to empower youth and promote sporting activities in the state. Ladan added that the governor also approved another one hundred and forty three million, five hundred thousand Naira (N143,500,000.00) for the one – year operation of Kebbi State United Football Academy. The governor also mandated that the fund should be used to cater for Under 13, Under 15, Under 17, Under 19 and under 23 sets of the Academy, in collaboration with Break Management Agency of Portugal, which has been empowered by the state government to serve as a management consultant. The chairman also disclosed that within one year, twelve players of kebbi united and the academy have been invited for trials in Europe and middle east and their result is being awaited, stressing that kebbi state would be a major football player in Nigeria and abroad.","pubDate":"2022-11-09 02:58:23","image_url":null,"source_id":"leadership","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"College Football Playoff rankings winners and losers headlined by Alabama, Clemson","link":"https://ca.sports.yahoo.com/news/college-football-playoff-rankings-winners-011232064.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-09 02:52:00","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"College Football Playoff Ranking Reaction: TCU Gets Its Due Respect","link":"https://www.si.com/college/2022/11/09/college-football-playoff-rankings-tcu-clemson-texas-notre-dame","keywords":["News And Analysis","HP Feature","College","College Football"],"creator":["Pat Forde"],"video_url":null,"description":"The Horned Frogs vaulted into the top four as one of the country’s last undefeated teams. Plus, more on the ACC’s struggles and high spots for bluebloods.","content":"With half of the College Football Playoff selection committee’s top six teams losing over the weekend, a Tuesday shakeup was inevitable. We got it . This wasn’t a free-fall, but we saw a series of significant drops for Tennessee, Alabama and Clemson that could have long-term effects. Let’s do a full review of what the committee did, breaking down the good, the bad and the ugly. Ranking undefeated TCU fourth and one-loss Tennessee fifth is merited. The Volunteers have some very good wins over No. 9 Alabama and No. 7 LSU on the road, and the selection committee is giving them some tangible credit for thumping No. 24 Kentucky as well. But that loss to Georgia had to leave a mark, and it did. Selection committee chairman Boo Corrigan said on a teleconference Tuesday that his group viewed both the Volunteers’ 14-point loss and Oregon’s 46-point loss to the No. 1 Bulldogs as one-sided, and they were. Everyone on the committee watched Georgia 27, Tennessee 13. It wasn’t a close game. Meanwhile, there was no longer any rhetoric about TCU being an incomplete team or having to make comebacks to stay undefeated. Instead, a body of work that includes wins over six teams with winning records was respected. And the depth of the Big 12 has to carry some weight as well. Quarterback Max Duggan has the Horned Frogs in position to control their own destiny to the playoff. Raymond Carlin III/USA TODAY Sports “There are no layups in the Big 12,” TCU coach Sonny Dykes said on ESPN. He’s right, now that Kansas is no longer a doormat. Moving TCU up three spots from the first week’s top 25 seems like a market correction after a slight undervaluing of the Horned Frogs last week. They’re now clearly in control of their own destiny—win out, and they’ll make the playoff. Lose one, and it gets interesting. They face what might be their biggest test of the season to date Saturday at No. 18 Texas. The Atlantic Coast Conference is in the weakest playoff position of the Power 5 conferences after Clemson plummeted from No. 4 to No. 10 and league members Wake Forest and Syracuse exited the top 25. Other than the Tigers, the only ranked ACC teams this week are North Carolina (No. 15), North Carolina State (No. 16) and new arrival Florida State (No. 23). Clemson already has played the Wolfpack and Seminoles and could meet the Tar Heels in the ACC title game, but there aren’t a lot of remaining opportunities for it to improve its position. The rest of the Power 5 conferences all have at least one team ranked ahead of Clemson. The SEC has four ahead of the Tigers, with a chance that all four could stay ahead of them going forward. The Pac-12 has two ahead (Oregon at sixth and USC eighth) and two close behind (UCLA 12th and Utah 13th), and each of those teams have multiple opportunities for resume-enhancing wins coming up. Clemson sitting at 10th behind two-loss Alabama at No. 9 reinforces what we all suspected after Saturday: There’s a strong chance of having a playoff without either of them for the first time in its nine-year history. The Crimson Tide have a good resume-enhancing opportunity Saturday at Mississippi that could be enough to vault them past No. 8 USC, which plays Colorado. But USC has two superior opponents to close the regular season (No. 12 UCLA and No. 20 Notre Dame) compared to Bama finishing against Austin Peay and the worst Auburn team in years. Unless LSU collapses and opens a backdoor opportunity for Alabama to win the SEC West and upset Georgia in the league championship game, it stands to reason that the Tide are out. Don’t ever discount the value of big brands. Exhibits A and B: Texas and Notre Dame. The Longhorns (6–3) are the top-ranked three-loss team at No. 18. The Fighting Irish (6–3) check in at No. 20. That’s despite the fact both have lost to games to unranked teams: Texas was beaten by Texas Tech and Oklahoma State; Notre Dame lost to a team tied for fourth in the Sun Belt East (Marshall) and the last-place team in the Pac-12 (Stanford). But bad losses don’t seem to stick to bluebloods. Which is at least consistent through much of college football’s history. Texas has one win over a ranked team (at Kansas State Saturday) which allowed it to vault up six spots. Notre Dame has at least beaten two ranked teams in Clemson and North Carolina (another factor that hurts the ACC’s overall standing). Having those two in the top 20 does help future opponents, at least. TCU has an opportunity to pick up another quality win Saturday in Austin, and USC has the same chance when it hosts Notre Dame on Nov. 26. At least the committee didn’t put either the Horns or Irish ahead of 8–1 Tulane, which is playing No. 22 UCF Saturday in a game of great consequence not only in the American Athletic Conference but the race for the Group of 5’s New Years Six bowl bid as well. More College Football Coverage:","pubDate":"2022-11-09 02:38:37","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzNjE2MTQ2NzE5NTgxNjgw/max-duggan.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Fantasy Football Week 10 Waiver Wire: Jimmy Garoppolo, Jaylen Warren, Darnell Mooney among better options - CBS Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3d3dy5jYnNzcG9ydHMuY29tL2ZhbnRhc3kvZm9vdGJhbGwvbmV3cy9mYW50YXN5LWZvb3RiYWxsLXdlZWstMTAtd2FpdmVyLXdpcmUtamltbXktZ2Fyb3Bwb2xvLWpheWxlbi13YXJyZW4tZGFybmVsbC1tb29uZXktYW1vbmctYmV0dGVyLW9wdGlvbnMv0gGbAWh0dHBzOi8vd3d3LmNic3Nwb3J0cy5jb20vZmFudGFzeS9mb290YmFsbC9uZXdzL2ZhbnRhc3ktZm9vdGJhbGwtd2Vlay0xMC13YWl2ZXItd2lyZS1qaW1teS1nYXJvcHBvbG8tamF5bGVuLXdhcnJlbi1kYXJuZWxsLW1vb25leS1hbW9uZy1iZXR0ZXItb3B0aW9ucy9hbXAv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Fantasy Football Week 10 Waiver Wire: Jimmy Garoppolo, Jaylen Warren, Darnell Mooney among better options  CBS SportsFantasy Football Waiver Wire Pickups, Week 10: Adds to help your playoff push  Yahoo SportsWeek 10 State of the Main Slate + Salary Standouts  The Fantasy FootballersWaiver Wire Analysis: Week 10  Establish The RunFantasy Football Week 10: Tight End rankings  Yahoo Sports","content":null,"pubDate":"2022-11-09 02:22:00","image_url":null,"source_id":"google","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022: 'Qatar is a mistake,' admits former President Sepp Blatter on hosting rights","link":"https://www.indiatvnews.com/sports/football/fifa-world-cup-2022-qatar-is-a-mistake-admits-former-president-sepp-blatter-on-hosting-rights-2022-11-09-822396","keywords":null,"creator":null,"video_url":null,"description":"Former President of FIFA Sepp Blatter has admitted that awarding Qatar the hosting rights for the FIFA World Cup 2022 was a mistake. Blatter, who is now cleared of charge for fraud during his spell as the President of FIFA spoke to the media on Tuesday where he admitted that FIFA made a big mistake as the tournament hampered the usual football calendar with its winter edition.","content":"Former President of FIFA Sepp Blatter has admitted that awarding Qatar the hosting rights for the FIFA World Cup 2022 was a mistake. Blatter, who is now cleared of charge for fraud during his spell as the President of FIFA spoke to the media on Tuesday where he admitted that FIFA made a big mistake as the tournament hampered the usual football calendar with its winter edition. \"Qatar is a mistake,\" Blatter said in conversation with Swiss newspaper Tages Anzeiger adding that \"the choice was bad.\" Blatter, who led FIFA for 17 years, has also been embroiled in accusations of corruption during his tenure. He was cleared of fraud by a Swiss court in June. The prosecutors have appealed the ruling. “It is too small of a country. Football and the World Cup are too big for it,\" Blatter said of Qatar, the first country in the Middle East to host the tournament. \"Since then, social considerations and human rights are taken into account,\" he said. Blatter further added that FIFA in 2012 amended the criteria it used to select host countries in light of concerns over the working conditions at tournament-related construction sites in Qatar. Blatter said he will be watching the tournament, which kicks off in less than two weeks, from his home in Zurich. The FIFA World Cup is all set to take the center stage in less than two weeks as 32 teams will gather in Qatar. This will be the first time that the FIFA World Cup will be played in the winter months of November and December. The FIFA World Cup is usually scheduled in June and July which guarantees the smooth functioning of the club season. However, with the FIFA World Cup taking place, the club season will now take a pause as teams fight for ultimate glory. Teams like Brazil, Argentina, and France are the heavy favourites to clinch the title with the final taking place on November (18) in Doha.","pubDate":"2022-11-09 02:14:17","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: 'This is a team of destiny'; North football set for first Dakota Bowl appearance in 22 years.","link":"https://www.inforum.com/sports/prep/watch-this-is-a-team-of-destiny-north-football-set-for-first-dakota-bowl-appearance-in-22-years","keywords":null,"creator":null,"video_url":null,"description":"Fargo North will face Jamestown in the 11A championship game live on WDAY Friday","content":"FARGO — It has been 22 years since Fargo North football played for a title. Spartans coach Adam Roland told his team they are in this game by choice, not by chance. \"Coach Roland said this is a team of destiny,\" said senior lineman Adam Jarski. Fargo North football is on a mission this year. \"Growing up as a kid and coming to the games and watching the team not really succeed and finally getting the success and being on the team just feels great,\" said junior running back Peder Haugo. Their path to the dakota bowl hasn’t been without challenges. After a 4-0 start, the Spartans lost back-to-back games to Fargo South and Red River, then finished the season with losses to West Fargo and Jamestown. ADVERTISEMENT \"We kind of got complacent after our first four wins of the regular season,\" Haugo said. \"Those losses really brought the fuel back to fire.\" North already got it’s revenge against rival South in the semifinals. Now, they get a chance at complete redemption with another shot at Jamestown: the team that eliminated North in last year’s semis “If we play how we know we can play we have a wonderful shot at winning this game,\" Jarski said. “Once in a lifetime,\" said senior linebacker Ethan Latterner. \"You're not going to be a part of something like this ever again, so you want to make the most of it. I think that's what we're really gunning for this Friday.\" It truly is ‘once in a lifetime.' None of these players were alive when North won its last championship in 2000. “We haven't lifted that trophy in 22 years. We want to be the ones to do it,\" Latterner said. Hence the 'team of destiny' mantra. “Enjoy the moment, enjoy the time, and when it's time to go out and play the game of football, play it with everything you have,\" Roland said. ADVERTISEMENT You can watch North's 11A championship game against Jamestown live on WDAY as part of all-day Dakota Bowl coverage. Games can also be streamed live on WDAY Sports+.","pubDate":"2022-11-09 02:10:19","image_url":null,"source_id":"inforum","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Football flasher cashing in after wild act","link":"https://www.cairnspost.com.au/sport/football/football-fan-who-went-viral-after-flashing-cashing-in-on-the-act/news-story/018ea80cf8d0200e53c97b85a99acb57","keywords":["Football","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"A football fan has started her own OnlyFans account after raunchy celebration made her an overnight internet sensation.","content":null,"pubDate":"2022-11-09 01:58:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"AIFF to appoint 50 referees on contractual basis","link":"https://www.tribuneindia.com/news/sports/aiff-to-appoint-50-referees-on-contractual-basis-449049","keywords":null,"creator":null,"video_url":null,"description":"New Delhi Aiming to lift the standard of refereeing in the country, the All India Football Federation (AIFF) is set to appoint 50 referees on contractual basis. AIFF president Kalyan Chaubey said that the standard of refereeing can be improved if the Indian referees earn enough money to work full time on their profession. \"In state leagues, a referee gets Rs 2500 to Rs 5000, and in national leagues from Rs 8000 to Rs 10,000. We have decided that 50 referees will be appointed and they will be given salary between Rs 50,000 to Rs 80,000 per month,\" Chaubey said. Pune Yoddhas play out draw with Warriors in PKL UP Yoddhas grabbed a last-gasp point to tie their Pro Kabaddi League match against Bengal Warriors 41-41 here today. Later, Dabang Delhi beat Telugu Titans 40-33. Zurich Ex-FIFA boss Sepp Blatter: Qatar WC a 'mistake' Sepp Blatter, the president of FIFA when the organisation selected Qatar in 2010 to host the upcoming World Cup, now says the choice was a \"mistake\". Qatar is being panned for not having nearly enough infrastructure in addition to allegations of corruption, human rights violations and poor working conditions. \"It is too small of a country,\" Blatter said. Buenos Aires World Cup: Nearly 6,000 Argentine fans banned Violent fans involved in illegal associations and even those in debt for food dues are part of a list of 6,000 Argentines who will not be allowed to enter World Cup stadiums in Qatar. — Agencies","content":"New Delhi Aiming to lift the standard of refereeing in the country, the All India Football Federation (AIFF) is set to appoint 50 referees on contractual basis. AIFF president Kalyan Chaubey said that the standard of refereeing can be improved if the Indian referees earn enough money to work full time on their profession. “In state leagues, a referee gets Rs 2500 to Rs 5000, and in national leagues from Rs 8000 to Rs 10,000. We have decided that 50 referees will be appointed and they will be given salary between Rs 50,000 to Rs 80,000 per month,” Chaubey said. Pune Yoddhas play out draw with Warriors in PKL UP Yoddhas grabbed a last-gasp point to tie their Pro Kabaddi League match against Bengal Warriors 41-41 here today. Later, Dabang Delhi beat Telugu Titans 40-33. Zurich Ex-FIFA boss Sepp Blatter: Qatar WC a ‘mistake’ Sepp Blatter, the president of FIFA when the organisation selected Qatar in 2010 to host the upcoming World Cup, now says the choice was a “mistake”. Qatar is being panned for not having nearly enough infrastructure in addition to allegations of corruption, human rights violations and poor working conditions. “It is too small of a country,” Blatter said. Buenos Aires World Cup: Nearly 6,000 Argentine fans banned Violent fans involved in illegal associations and even those in debt for food dues are part of a list of 6,000 Argentines who will not be allowed to enter World Cup stadiums in Qatar. — Agencies","pubDate":"2022-11-09 01:41:42","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_437822247.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"College Football Playoff rankings - Analysis, 12-team field - ESPN","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vd3d3LmVzcG4uY29tL2NvbGxlZ2UtZm9vdGJhbGwvc3RvcnkvXy9pZC8zNDk4MDk1OC9jb2xsZWdlLWZvb3RiYWxsLXBsYXlvZmYtcmFua2luZ3MtYW5hbHlzaXMtMTItdGVhbS1maWVsZNIBf2h0dHBzOi8vd3d3LmVzcG4uY29tL2NvbGxlZ2UtZm9vdGJhbGwvc3RvcnkvXy9pZC8zNDk4MDk1OC9jb2xsZWdlLWZvb3RiYWxsLXBsYXlvZmYtcmFua2luZ3MtYW5hbHlzaXMtMTItdGVhbS1maWVsZD9wbGF0Zm9ybT1hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"College Football Playoff rankings - Analysis, 12-team field  ESPNPredicting the top 10 of the second Playoff poll of 2022  Saturday Down SouthMichigan moves to No. 3 in latest AP poll after dominating Rutgers  WLNSGeorgia claims top spot in CFP's rankings after emphatic win  ESPNGeorgia, Oregon ace latest tests while Alabama, Clemson flop in CBS Sports grades  247Sports","content":null,"pubDate":"2022-11-09 01:30:00","image_url":null,"source_id":"google","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"CFP rankings: Who won, who should be angry and what a 12-team field would look like","link":"https://www.espn.com/college-football/story/_/id/34980958/college-football-playoff-rankings-analysis-12-team-field?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"Things we learned, who should be upset, a 12-team preview and top teams' credentials as the College Football Playoff committee reveals its second ranking.","content":"With Georgia now the undisputed No. 1 team in the country, the biggest debate for the selection committee in its second ranking was at No. 4, where undefeated TCU earned the spot ahead of one-loss No. 5 Tennessee following the Vols' loss to Georgia on Saturday. No. 2 Ohio State was joined by No. 3 Michigan, setting up a top-four showdown between the two rivals in a regular-season finale that will determine the Big Ten's best hope for a semifinalist. At No. 6, one-loss Oregon remains the Pac-12's top contender, but the league has four teams in the top 13, including No. 8 USC and No. 12 UCLA which could also finish as one-loss conference champions. This ranking wasn't exactly unexpected, but it provided more clues as to what could happen on Selection Day: Jump to: Anger Index | 12-team bracket | Résumés | Tennessee is still able to finish in the top four With No. 2 Ohio State and No. 3 Michigan still having to face each other, and Tennessee likely to run the table and finish 11-1, there will be an opportunity for some controversy. The Vols end the regular season against unranked opponents Mizzou (4-5), South Carolina (6-3) and Vanderbilt (3-6). With Tennessee ahead of No. 6 Oregon, it sets the stage for what could be an extremely lengthy debate in the committee meeting room if Tennessee finishes 11-1 and Oregon finishes as a one-loss Pac-12 champion. They both lost to Georgia -- and it wasn't pretty for either of them. It wouldn't be the first time an SEC team finished in the top four without winning its division. In 2017, Alabama started 11-0 but lost its last game to rival Auburn. It also happened in the Big Ten in 2016, when Ohio State finished in the top four without winning its division. Tennessee is currently No. 2 in ESPN's strength of record metric and No. 2 in strength of schedule. It has two of the best wins in the country, against Alabama and at LSU. Only once has the CFP committee snubbed a one-loss SEC team -- when No. 5 Texas A&M was left out in 2020. It's not unprecedented, but it's certainly not easy to finish in the top four without a conference title. Right now, the committee thinks Tennessee is the better team, but a conference championship against a ranked opponent could give Oregon the push it needs, along with regular-season wins against No. 13 Utah and now No. 25 Washington. The margin for error is slim, but No. 4 TCU controls its playoff path An undefeated TCU is in. One loss, though, and the Frogs could be looking up at the Pac-12 champion and/or Tennessee. By putting TCU in the top four this week, the committee showed its willingness to do so on Selection Day if TCU can remain unscathed -- especially considering the Frogs have the No. 1 remaining schedule strength in the country. They could add to their résumé Saturday with a win at Texas, which is now the committee's No. 18 team, and they end the season with games at Baylor and at home against Iowa State. ESPN's FPI projects TCU will lose its back-to-back road games, though, which would eliminate the Frogs and the entire Big 12 from the mix. LSU holds the key to SEC chaos At No. 7, LSU is exactly where it was expected to be -- the committee's highest-ranked two-loss team, but still behind No. 5 Tennessee because of the Oct. 8 head-to-head result. That doesn't mean, though, that two-loss LSU can't or won't move up. If the Tigers somehow run the table and beat Georgia to win the SEC, they would likely become the first two-loss team in the CFP. Then the selection committee would also have a 12-1 Georgia team to consider as the SEC runner-up, and the 11-1 Vols who hammered the SEC champs 40-13 in Baton Rouge during the regular season. So then what? It would depend in large part on what happened in the other Power 5 conference championship games. It's a stretch to imagine the committee would really take three SEC teams, but if two-loss Utah wins the Pac-12, the Big 12 has a two-loss conference champion, and the loser of Ohio State-Michigan is beaten soundly, it's not impossible. Especially considering the poor shape the ACC is in ... The ACC is in the worst shape of the Power 5 conferences Clemson's loss at Notre Dame was devastating, as the Tigers sank to No. 10, but that wasn't the only casualty. Clemson was banking on wins against Syracuse and Wake Forest to impress the committee -- and it was enough last week -- but both of those teams dropped out of the Top 25 on Tuesday after they suffered their third losses. Clemson's best win is now against No. 16 NC State. Even at No. 10, there are enough other contenders ahead of them -- and even behind them in the Pac-12 -- that have more opportunities to leap the Tigers. With the win, though, Notre Dame was ranked at No. 20 this week, which is a boost for Ohio State's résumé, and could also help USC down the stretch. No. 17 Tulane and No. 22 UCF could be playing for a New Year's Six bowl. The two best teams in the American Athletic Conference face each other on Saturday. The highest-ranked conference champion from the Group of 5 is guaranteed to earn a spot in a New Year's Six bowl, so the winner of Saturday's game will take the lead for that spot. -- Heather Dinich Anger index The initial committee rankings are bound to anger some fan bases, but they also set a stage for what's to come. They offer a window into the committee's perceptions, which allows every fan base to have an inkling of where the chips might fall in subsequent rankings. So when it comes to the second top 25, it's less about who's being snubbed and more about how the committee applies new logic to teams that defies the explanations offered just a week earlier. In other words, this week's Anger Index is all about context. The committee may have loved you a week ago, but now, you're just another team with a few axes to grind. So, who's angry after the second set of rankings? 1. Clemson Tigers (8-1) The loss to Notre Dame was ugly, that much is clear. And Clemson has some big questions on offense right now. But the Tigers were good enough to be No. 4 a week ago, good enough that Notre Dame's win moved the Irish from unranked into the top 20, and good enough that they're still the clear favorite to win the ACC. So, why drop Clemson all the way to No. 10? Here's a quick comparison: Team A: No. 8 strength of record, four wins over FPI top-40 teams, 9.4 points per game margin vs. Power 5, two one-possession wins over currently unranked teams, 29th in offensive efficiency, 26th in defensive efficiency Team B: No. 10 strength of record, one win over FPI top-40 teams, 8.9 points per game margin vs. Power 5, three one-possession wins over currently unranked teams, second in offensive efficiency, 76th in defensive efficiency You can probably guess that Team A is Clemson. Team B? That's USC, ranked two spots higher despite its best win coming by three over Oregon State. For as bad as Clemson looked against Notre Dame, it still has wins over NC State, Wake Forest, Syracuse and Florida State. Yes, the Notre Dame loss is the most recent data point, but the committee is supposed to differ from things like the AP poll by starting fresh each week, evaluating the resume as a whole -- not just giving more weight to the thing they saw most recently. And let's also be clear about that Notre Dame loss. It was an implosion by Clemson more than it was a true drubbing by Notre Dame. The Irish got a touchdown on special teams, a pick six and another TD following an interception deep in Clemson territory. The fact is, Clemson's offense is a bit of a mess right now. But is that so much more concerning than a USC defense that just gave up 35 to Cal? Or an Alabama defense that couldn't stop LSU in crunch time? Or an LSU team with one more loss (including to a Florida State team that Clemson beat)? No one in Clemson should be feeling good right now. There's much work to be done to right the ship. But this feels like an overcorrection that's looking entirely at the final score of the most recent game and ignoring all the things the committee liked about the Tigers a week earlier. 2. UCLA Bruins (8-1) There is one Pac-12 team that is clearly better than UCLA, and that's Oregon. The Ducks beat UCLA convincingly in Eugene on Oct. 22. So we understand why Oregon is ranked higher. But six spots higher? With USC somehow in between? UCLA beat Utah. USC lost to Utah. USC is ranked higher than UCLA. Make that make sense. You can't. Even Utah, which was drubbed by the Bruins and has one more loss, is just one spot behind UCLA. Is the Cal university board slipping a few sawbucks to the committee just to spite UCLA for its move to the Big Ten? Otherwise, there's simply no cause to have the Bruins as the second-lowest ranked one-loss Power 5 team. 3. Tennessee Volunteers (8-1) Let's get this straight. A week ago, Tennessee was the best team in the country with easily the best resume. Then the Vols go to Georgia, lose to the new No. 1 team in weather that did little to help Hendon Hooker and the offense, and suddenly they're No. 5? Meanwhile, ahead of Tennessee in the pecking order is TCU, which jumped from seven to four, despite struggling to get past Texas Tech. Ohio State jumped Tennessee even though the Buckeyes looked bad against woeful Northwestern. Michigan, too, jumped Tennessee despite losing to Rutgers at the half. ESPN's strength of record still says Tennessee is the second-best team in the country. Just because the Volunteers happened to run into the juggernaut that is Georgia shouldn't negate all that came before. Just ask Oregon. 4. Liberty Flames (8-1) A failed two-point conversion against Wake Forest (who was ranked just a week ago) is the only blemish on Liberty's resume. Last week, they went to Fayetteville and beat Arkansas (aren't SEC wins supposed to count double?). The Flames have solid wins over Southern Miss, UAB and BYU, too. And so the question must be asked: What does Hugh Freeze need to do to sweeten the deal enough to get Liberty ranked? 5. Kansas Jayhawks (6-3) There are five ranked 6-3 teams. Kansas is not one of them. This shows that the committee, much like Stanford, does not like fun. Kansas has two wins over FPI top-40 teams. That's the same number as Florida State and Kentucky. Kansas beat Oklahoma State. Texas did not. Oh, and we all know what happened the last time Kansas and Texas faced off head-to-head. The committee doesn't need to care about bottom few teams in the top-25, so let's enjoy the ride, folks. Rank Kansas. It's the right thing to do. -- David Hale How a 12-team playoff would look Everyone with the power to expand the College Football Playoff wants the field to grow to 12 teams in time for the 2024 season. But currently, expansion is scheduled to begin in 2026. So while discussions continue on how to move up the timeline, we're taking a look at how a 12-team playoff would look today based on the already-determined model released by the commissioners and presidents. The field will be composed of the selection committee's six highest-ranked conference champions and its next six highest-ranked teams. The four highest-ranked conference champions will earn the top seeds and a first-round bye. The other eight teams will play in the first round, with the higher seeds hosting the lower seeds on campus or at another site of their choice. Here's what the playoff would look like if the 12-team format were in place today: Seeds with byes 1. Georgia 2. Ohio State 3. TCU 4. Oregon Remaining seeds (conference champs in bold ) 5. Michigan 6. Tennessee 7. LSU 8. USC 9. Alabama 10. Clemson 11. Ole Miss 12. Tulane First-round games: No. 12 Tulane @ No. 5 Michigan No. 11 Ole Miss @ No. 6 Tennessee No. 10 Clemson @ No. 7 LSU No. 9 Alabama @ No. 8 USC Quarterfinal games: No. 9 Alabama-No. 8 USC winner vs. No. 1 Georgia No. 10 Clemson-No. 7 LSU winner vs. No. 2 Ohio State No. 11 Ole Miss-No. 6 Tennessee winner vs. No. 3 TCU No. 12 Tulane-No. 5 Michigan winner vs. No. 4 Oregon Top 10 résumés No. 1 Georgia Record: 9-0 | SOS: 47 | SOR: 1 Biggest win: Nov. 5 vs. Tennessee 27-13 Biggest remaining regular-season game: Saturday at Mississippi State Last playoff appearance: 2022 CFP National championship, No. 3 Georgia 33, No. 1 Alabama 18 No. 2 Ohio State Record: 9-0 | SOS: 53 | SOR: 3 Biggest win: Oct. 29 at Penn State 44-31 Biggest remaining regular-season game: Nov. 26 vs. Michigan Last playoff appearance: 2021 CFP National Championship, No. 1 Alabama 52, No. 3 Ohio State 24 No. 3 Michigan Record: 9-0 | SOS: 73 | SOR: 5 Biggest win: Oct. 15 vs. Penn State 41-17 Biggest remaining regular-season game: Nov. 26 at Ohio State Last playoff appearance: 2022 Playoff Semifinal at the Orange Bowl, No. 3 Georgia 34, No. 2 Michigan 11 No. 4 TCU Record: 9-0 | SOS: 68 | SOR: 4 Biggest win: Oct. 22 vs. Kansas State 38-28 Biggest remaining regular-season game: Saturday at Texas Last playoff appearance: Never No. 5 Tennessee Record: 8-1 | SOS: 2 | SOR: 2 Biggest win: Oct. 8 at LSU 40-13 Biggest remaining regular-season game: Nov. 19 at South Carolina Last playoff appearance: Never No. 6 Oregon Record: 8-1 | SOS: 27 | SOR: 6 Biggest win: Oct. 22 vs. UCLA 45-30 Biggest remaining regular-season game: Nov. 19 vs. Utah Last playoff appearance: 2015 CFP National Championship, No. 4 Ohio State 42, No. 2 Oregon 20 No. 7 LSU Record: 7-2 | SOS: 8 | SOR: 7 Biggest win: Nov. 5 vs. Alabama 32-31 Biggest remaining regular-season game: Nov. 26 at Texas A&M Last playoff appearance: 2020 CFP National Championship: No. 1 LSU 42, No. 3 Clemson 25 No. 8 USC Record: 8-1 | SOS: 64 | SOR: 10 Biggest win: Sept. 24 at Oregon State Biggest remaining regular-season game: Nov. 19 at UCLA Last playoff appearance: Never No. 9 Alabama Record: 7-2 | SOS : 6 | SOR : 9 Biggest win: Sept. 10 at Texas 20-19 Biggest remaining regular-season game: Saturday at Ole Miss Last playoff appearance: 2022 CFP National Championship, No. 3 Georgia 33, No. 1 Alabama 18 No. 10 Clemson Record: 8-1 | SOS: 55 | SOR: 8 Biggest win: Oct. 1 vs. NC State 30-20 Biggest remaining regular-season game: Nov. 26 vs. South Carolina Last playoff appearance: 2021 Playoff Semifinal at the Sugar Bowl, No. 3 Ohio State 49, No. 2 Clemson 28","pubDate":"2022-11-09 01:29:53","image_url":null,"source_id":"espn","country":["united states of america","united kingdom","india","australia","singapore","canada"],"category":["sports"],"language":"english"},{"title":"College Football Playoff rankings snub UCLA, but Bruins can make up ground quickly","link":"https://www.latimes.com/sports/story/2022-11-08/college-football-playoff-rankings-ucla-usc","keywords":null,"creator":["J. Brady McCollough"],"video_url":null,"description":"The path still remains clear for both USC and UCLA for the College Football Playoff as the committee ranked them No. 8 and 12 this week.","content":"The path still remains clear for both USC and UCLA for the College Football Playoff as the committee ranked them No. 8 and 12 this week.","pubDate":"2022-11-09 01:15:33","image_url":"https://ca-times.brightspotcdn.com/dims4/default/14250ab/2147483647/strip/true/crop/3600x2400+0+0/resize/1500x1000!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff0%2F9c%2Fba1c30d04041b6c9588b61323ebb%2Fucla-arizona-st-football-13313.jpg","source_id":"latimes","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Michigan football moves up to No. 3 in latest College Football Playoff rankings","link":"http://rssfeeds.freep.com/~/718900028/0/freep/sports~Michigan-football-moves-up-to-No-in-latest-College-Football-Playoff-rankings/","keywords":null,"creator":["Tony Garcia"," Detroit Free Press"],"video_url":null,"description":"One week after Michigan football was ranked outside the top four the initial 2022 College Football Playoff rankings, the Wolverines are now No. 3.       ","content":null,"pubDate":"2022-11-09 01:05:39","image_url":"https://www.gannett-cdn.com/presto/2022/11/06/PDTF/c1e7af3c-0a39-44a7-b976-5fb0694df656-AP_Michigan_Rutgers_Football.jpg","source_id":"freep","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Alabama, Clemson fall out of top six in historic CFP rankings","link":"https://nypost.com/2022/11/08/alabama-clemson-out-of-top-six-in-historic-cfp-rankings/","keywords":null,"creator":["Associated Press"],"video_url":null,"description":"This is the first time since the College Football Playoff rankings began in 2014 that neither Clemson nor Alabama have been ranked in the top six.","content":"Georgia was the new No. 1 in the College Football Playoff rankings Tuesday night, followed by Ohio State, Michigan and TCU. The Bulldogs’ rise from No. 3 was no surprise after their dominant victory against previously top-ranked Tennessee on Saturday. Clemson, which was No. 4 in the selection committee’s first rankings last week, also lost, clearing way for changes in the top four. Ohio State stayed at two. The Buckeyes’ Big Ten rival, Michigan moved up from five to three. TCU jumped three spots to No. 4, putting the nation’s four unbeaten teams at the top of the rankings. Tennessee fell to No. 5 and was followed by Oregon from the Pac-12 and LSU, which jumped three spots to seventh after the Tigers knocked off Alabama. Clemson fell to 10th and Alabama dropped from sixth to ninth after its second loss of the season. This is the first time since the College Football Playoff rankings began in 2014 that neither Clemson nor Alabama have been ranked in the top six. There has never been a College Football Playoff without the Tigers and the Crimson Tide, which have combined to win five of the eight CFP championships.","pubDate":"2022-11-09 01:01:09","image_url":"https://nypost.com/wp-content/uploads/sites/2/2022/11/dabo-swinney-clemson-cfp-rankings.jpg?quality=90&strip=all","source_id":"nypost","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"How a 12-Team College Football Playoff Would Look After Week 10","link":"https://www.si.com/college/2022/11/09/cfp-rankings-week-10-12-team-playoff","keywords":["News And Analysis","HP Feature","College","College Football"],"creator":["Ross Dellenger"],"video_url":null,"description":"Some of the sport’s heavyweights would clash in first-round matchups in the latest mock playoff with the CFP selection committee’s Week 10 rankings.","content":"A Tigers-versus-Tiger clash in Tiger Stadium? How about Nick Saban at the Coliseum or an all-SEC clash in Knoxville? Well, we’ve got great news for you: If an expanded 12-team playoff were to be selected today using the CFP’s most recent rankings, we’d have all that (along with a potential Michigan-Oregon quarterfinal in the Rose Bowl … hello!). The bad news: We don’t really know when an expanded playoff will be implemented ( 2024, 2025 and at the latest 2026 ), because the group of conference commissioners haven’t yet agreed on final details. In the meantime, we can let our imagination run wild. When you look at the below bracket, please keep in mind that we are using the same expansion model adopted this summer : (1) the six highest-ranked champs get automatic berths; (2) the next six highest-ranked teams get at-large spots; (3) byes go to the top four conference champs; and (4) first-round games are played at the better seed’s home stadium, and quarterfinals and semifinals are played in a rotation of six bowls. 1. Georgia (SEC champion) Sugar Bowl 2. Ohio State (Big Ten champion) Orange Bowl 3. TCU (Big 12 champion) Cotton Bowl 4. Oregon (Pac-12 champion) Rose Bowl – Semifinals: Peach (No. 1 v No. 4) and Fiesta (No. 2 v No. 3) – 5. Michigan (Big Ten at large) 12. Tulane (American champion) Ann Arbor, Mich. - 6. Tennessee (SEC at large) 11. Ole Miss (SEC at large) Knoxville, Tenn. - 7. LSU (SEC at large) 10. Clemson (ACC champion) Baton Rouge - 8. USC (Pac-12 at large) 9. Alabama (SEC at large) Los Angeles More College Football Coverage:","pubDate":"2022-11-09 00:57:09","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzNjE0NDQ3MjU0NzA5Njk5/brian-kelly-dabo-swinney.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"第11週のサンデーナイトフットボールがチーフス対チャージャーズに変更","link":"https://nfljapan.com/headlines/82512","keywords":["NFL","カンザスシティ・チーフス","ロサンゼルス・チャージャーズ"],"creator":["NFL JAPAN.COM"],"video_url":null,"description":"NFLは現地8日（火）、2022年シーズン初のスケジュール変更を発表した。 シーズン第11週の11月20日（日）に行われるカンザスシティ・チーフス対ロサンゼルス・チャージャーズの一戦は、サンデーナイトフットボールとして開 […]","content":"NFLは現地8日（火）、2022年シーズン初のスケジュール変更を発表した。 シーズン第11週の11月20日（日）に行われるカンザスシティ・チーフス対ロサンゼルス・チャージャーズの一戦は、サンデーナイトフットボールとして開催されることになった。アメリカ東部時間20時20分【日本時間11月21日（月）10時20分】キックオフ予定のこの試合は、『NBC』が中継する。 このAFC（アメリカン・フットボール・リーグ）西地区対決は、当初予定されていたシンシナティ・ベンガルズ対ピッツバーグ・スティーラーズの試合に代わるものだ。ベンガルズ対スティーラーズは、チーフス対チャージャーズが放送される予定だった『CBS』のアメリカ東部時間16時25分【日本時間11月21日6時25分】の枠に移動する。 2006年、NFLはサンデーナイトフットボールに“フレキシブルスケジューリング方式”を導入した。フレキシブルスケジューリングは、その週の日曜夜にレベルの高い対戦カードを確保し、驚くようなチームがプライムタイムにプレーする機会を提供する。フレキシブルスケジューリングは第5週から第10週までと、第11週から第17週までの計2回で適用される。 Our official statement in response to being flexed out of Sunday Night Football. pic.twitter.com/CMkGBBZ571 — Cincinnati Bengals (@Bengals) November 8, 2022 「試合がサンデーナイトフットボールから変更になったことに対する公式声明」 「そのことに関してはなにも気にしてない。たとえ試合が朝6時からでも、どこかのフィールドの真ん中でプレーするさ。どうでもいいよ」 【AK】","pubDate":"2022-11-09 00:56:29","image_url":null,"source_id":"nfljapan","country":["japan"],"category":["sports"],"language":"japanese"},{"title":"Georgia Lands Top Spot in Second CFB Playoff Rankings","link":"https://www.si.com/college/2022/11/09/second-college-football-playoff-rankings-georgia-michigan","keywords":["College Football","Wire","College","Breaking"],"creator":["Wilton Jackson"],"video_url":null,"description":"The second College Football Playoff rankings of the season have been released, with the Bulldogs sitting at No. 1.","content":"The second College Football Playoff rankings of the season have been released, with the Bulldogs sitting at No. 1.Georgia leaped to the No. 1 spot in the second College Football Playoff rankings that were released Tuesday. After a stunning slew of losses in Week 10, three of the top six teams from last week—Tennessee, Clemson and Alabama—fell in the rankings while their competitors rose. It also marks the first time in the history of CFP rankings that neither the Crimson Tide nor the Tigers ranked in the top six teams. Georgia, which entered its SEC East clash with former No. 1 Tennessee ranked No. 3 in the first CFP rankings, defeated the Volunteers 27–13 in a raucous environment Saturday at Sanford Stadium. After the reigning national champions, the rest of the top six was rounded out by Ohio State (9–0), Michigan (9–0), TCU (9–0), Tennessee (8–1) and Oregon (8–1). After the rankings were released, CFP chair Boo Corrigan said the committee favored TCU over Tennessee at No. 4 because of the Horned Frogs’ ability to win.“We value wins. They continue to find a way to win and not give up those points in the second half.”Forde: Forde-Yard Dash: Who’s in Pole Position to Be a Coach of the Year?The Volunteers, which held the top spot in the first CFP rankings, dropped to No. 5 following their loss. Tennessee will look to rebound in a home game against Missouri on Saturday.The Wolverines dismantled Rutgers, 52–17, and will prepare to face Nebraska this weekend. Ohio State seemingly slid by Northwestern, 21-7, as the weather played a part in the Buckeyes’ struggles. Ohio State is set to face Indiana in the Horseshoe on Saturday.Alabama suffered a 32–31 overtime loss to LSU at Tiger Stadium, putting the Crimson Tide at No. 9 with a ranked matchup against No. 11 Ole Miss on Saturday afternoon. Meanwhile, TCU pulled away in the second half of its game against unranked Texas Tech on Saturday to remain undefeated. But the Horned Frogs will be tested this weekend with a ranked road matchup against No. 18 Texas in an Austin showdown.Here are the full second College Football Playoff rankings. GeorgiaOhio StateMichiganTCUTennesseeOregonLSUSouthern CaliforniaAlabamaClemsonOle MissUCLAUtahPenn StateNorth CarolinaNC StateTulaneTexasKansas StateNotre Dame IllinoisUCFFlorida StateKentuckyWashingtonMore College Football Coverage: Tennessee Drops in AP College Football Poll After Loss at GeorgiaBowl Projections: Predicting All 41 College Football MatchupsSI’s Top 10 After a Playoff-Shaking Day in College Football","pubDate":"2022-11-09 00:37:49","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzNjE0MjIzOTE2NDEwMzA3/georgia-football-.png","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Georgia, OSU, Michigan, TCU latest CFP top four","link":"https://www.espn.com/college-football/story/_/id/34981606/georgia-claims-top-spot-cfp-rankings-emphatic-win?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"Georgia, the defending national champion, took over the top spot in the College Football Playoff Top 25 rankings released on ESPN Tuesday night, after the Bulldogs' impressive 27-13 win over previous No. 1 Tennessee last weekend.","content":"Georgia took over the top spot in the College Football Playoff Top 25 rankings released Tuesday night, after its impressive 27-13 win over previous No. 1 Tennessee last weekend. Meanwhile, TCU jumped three spots into the No. 4 spot headed into its big Saturday showdown at No. 18 Texas. \"They've got six wins over teams who are .500 or better,\" CFP chair Boo Corrigan, the athletic director at NC State, said on the ESPN telecast regarding the Horned Frogs. \"As you know, we value wins.\" Ohio State is No. 2 and rival Michigan landed at No. 3. It came as no surprise to see Georgia (9-0) move to No. 1. The defending national champion looked very much the part in the victory over the Vols, holding Tennessee quarterback Hendon Hooker to 195 yards passing, zero touchdowns and one interception. The Vols dropped four spots to No. 5, and as the top-ranked one-loss team, their CFP hopes remain very much alive. \"Tennessee is a really good team, with big wins, and again, we're still early in this process,\" Corrigan said. Tennessee is one spot ahead of Oregon, the highest ranked team from the Pac-12. Pac-12 contenders Oregon, USC and UCLA all have one loss, but the committee has the Ducks slotted highest. USC is at No. 8, while UCLA is ranked No. 12. \"They've won eight consecutive games,\" Corrigan said of Oregon. \"Again, we're looking at the overall body of work. ... And they've been very impressive.\" If Tennessee wins out, the Vols could be in position to make it into the CFP as a one-loss non-conference champion, depending on how everything shakes out around them. The SEC has had multiple teams make the CFP twice -- including last season. As for TCU, moving into the Top 4 is validation for its undefeated season. Last week, the committee had the undefeated Horned Frogs at No. 7, behind one-loss Alabama, in large part because they needed multiple fourth-quarter comebacks to remain undefeated. Though TCU trailed Texas Tech headed into the fourth quarter this past weekend and needed another comeback to win, the Horned Frogs benefitted in these rankings from losses by Tennessee, Alabama and Clemson. \"This is early in the process, I have a lot of faith in the committee,\" TCU coach Sonny Dykes said on the ESPN telecast. \"At the end of the day, we've played a good schedule, and we have a really tough schedule ahead of us. .... But I appreciate the fact that they value wins.\" TCU will meet Texas on Saturday night. \"Our guys have completely jumped in and they believe in what they're doing,\" Dykes said. \"It's fun to see guys invest in each other and value each other. ... I love this group and they are a blast to coach.\" Alabama, which lost to LSU in overtime, stayed in the Top 10 despite the loss and is ranked No. 9. LSU moved up three spots to No. 7 as the highest-ranked two-loss team - leaving opening the possibility that it could be the first two-loss team to make the CFP if it wins out as SEC champions. Clemson, which got blown out 35-14 on the road against Notre Dame, dropped from No. 4 to No. 10. The Tigers will need to win out, plus get help and chaos around them to keep any shot at another playoff berth alive.","pubDate":"2022-11-09 00:32:30","image_url":null,"source_id":"espn","country":["united states of america","united kingdom","india","australia","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Lawyer Says Wolverines Player Started Tunnel Fight After MSU-Michigan","link":"https://www.si.com/college/2022/11/09/lawyer-wolverines-player-started-tunnel-fight-after-msu-michigan-game","keywords":["Wire","College Football","Breaking","College"],"creator":["Madeline Coleman"],"video_url":null,"description":"Two videos captured separate fights that occurred in Michigan’s tunnel following the Wolverines’ 29–7 victory over their rivals.","content":"Two videos captured separate fights that occurred in Michigan’s tunnel following the Wolverines’ 29–7 victory over their rivals. View the original article to see embedded media. Dave Diamond, the lawyer representing a Michigan State football player involved in the tunnel assault a few weekends ago, claimed that a Michigan player actually started it. The Los Angeles-based lawyer released a statement saying a Wolverine “engaged with Spartan athletes with his helmet and a swinging punch.”“The media has taken the bait from a coach and master victim and his howls at the moon. We have learned that the UM player started the altercation. Eyewitnesses have described it as charging with his helmet and throwing a punch,” the attorney said. He continued, “the justice system is designed for impartiality. The repeated ‘hail to the victims’ song and dance does not contribute to the fact-finding mission. Where were the screams from Ann Arbor to criminally charge Coach Howard with assault or Devin Bush with felony vandalism. The silence was palpitating. The hypocrisy is painful. While we acknowledge wrongdoing by all parties, this is not an incident that warrants criminal charges being filed.“We have seen similar behavior and even worse on the gridiron and suddenly because it happens in a tunnel, known for incompetent security and poor post-game management, there are calls for criminal charges. My client is a young man who responded to the situation before him.”Michigan State has suspended at least eight players in connection with the Oct. 30 incident as of Nov. 1. Two videos shared on social media captured two different altercations, and one Michigan player—defensive back Gemon Green, who allegedly was hit with a helmet—plans to press charges. Wolverines coach Jim Harbaugh confirmed on Oct. 31 that there is “an ongoing police investigation” and called the incident “egregious.” “It’s sickening to watch the videos. The ones that are on social media right now and also the ABC tunnel cam—it’s in a higher elevation, it shows much more of what took place. As I said, those are sickening to watch.”Malcolm Jones, Justin White, Jacoby Windham, Brandon Wright, Tank Brown, Khary Crump, Angelo Grose and Zion Young are the Spartans who have been suspended thus far. Coach Mel Tucker released a statement Sunday morning after the game and followed it up during his Monday press conference, expressing his disappointment. “We’re not here to make any excuses for the behaviors on Saturday,” he said. “They are unacceptable. It is also very important to say we honor the traditions of the Big Ten Conference, including the Michigan–Michigan State rivalry game. We have a responsibility to uphold the values of this great university.“We are deeply sorry to both universities, the conference, our fans, alumni, supporters and, of course, all of our student-athletes, past and present.”The University of Michigan Police Department and the Big Ten are also conducting investigations. According to Diamond, a Michigan player’s relative went through security and confronted a Spartans player. He said in the statement, “why were the UM players allowed in the tunnel and rather than criticize an MSU employee for not engaging with 6 foot 6-inch giants, we must ask ourselves about the Michigan security in the tunnel.“... this case does not warrant a criminal filing. Speaking with the Detective investigating the case, I am comforted by his impartiality.”","pubDate":"2022-11-09 00:25:09","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzNjEzODU1ODkxNDAwMTc2/michigan-michigan-state.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"}]}