{"newsArray":[{"title":"Wolves confirm eight player departures but keep door open for Adama Traore","link":"https://www.birminghammail.co.uk/sport/football/football-news/wolves-confirm-eight-player-departures-27047910","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Chris Watson)"],"video_url":null,"description":"Wolverhampton Wanderers news from BirminghamLive as Wolves announce that Joao Moutinho and Diego Costa are among those leaving Molineux this summer","content":"Wolverhampton Wanderers have confirmed that Joao Moutinho will leave the club this summer along with Diego Costa - but have not ruled out the possibility of Adama Traore staying at Molineux. All three players are coming to the end of their current contracts with Wolves. And an update has now been given on the situation following the end of the 2022-23 season. The club said in a statement: \" Moutinho passed the 200-appearance mark for Wolves appearance under (Julen) Lopetegui earlier this calendar year, during the fifth year of a glittering career in old gold, after he joined the club from Monaco during the summer of 2018. Player of the Season following his debut campaign, Moutinho scored a collection of stunning goals for the club and was a midfield ever-present alongside Ruben Neves for much of his time at Molineux but will now move on to pastures new this summer.\" READ MORE: Goncalo Guedes makes Wolves stance clear as fresh transfer details emerge READ MORE: Wolves join race for £40m player amid Newcastle and Aston Villa interest Wolves sporting director Matt Hobbs said: \"Joao’s going to go down as one of the best players to ever pull on the old gold, in my opinion. He was an integral part of the team the entire time he was here. Our success over the last four or five years, he’s been instrumental in. So, he now departs with nothing but thanks from the football club. “Everything he does is meticulous. He’s shown a lot of the younger players what you have to do to look after yourself and have a good career in the game. When he first came to the club, he was a big part of the culture change, because of his work ethic and how he managed himself before and after training. He definitely raised the levels and expectations amongst the players themselves. “When he came in, we had a huge Portuguese contingent, and he was a hero to a lot of the guys for what he’d achieved in both club and international football. He just had that presence and people wanted to follow what he was he doing. We thank Joao for all he did at Wolves and wish him the best of luck for the future.” Costa was drafted in amid a striker crisis and made 25 appearances in his nine-month spell at Molineux, helping the team retain their Premier League status. Hobbs said: “Diego came off the back of Sasa’s [Kalajdzic] injury and has been incredible whilst he’s been here, the way he’s bought into the club, the values and the culture. On the pitch, he’s shown that he still has a lot to offer and off the pitch he’s been an incredible teammate, especially for the young Brazilians like Joao [Gomes] and Matheus [Cunha] – he’s been a real asset for them. “We’ve seen the relationship he’s had with the women’s team, where he was in the gym in the evenings and they came in and formed friendships, and he was very supportive of them. I can’t thank him enough for everything he’s done over the season – he was a really important part of what we managed to achieve, staying in the Premier League. “It feels the natural time to part ways because he was on a one-year contract. There was some internal conversations and we felt this was right. I’ve got no doubt that Diego will get another club off the back of his performances for sure. If a club calls me to ask about the person, he’ll get nothing but praise from me.” Traore , meanwhile, is free to speak to other clubs after five years - and 194 appearances - at Wolves but Hobbs said: “As the manager said in his press conferences recently, Adama is a player we’d like to keep and we’re still talking to him. He’s now out of contract, but it doesn’t mean there’s not an opportunity to still come to an agreement, so conversations will be ongoing. He’s probably earned the right to understand what else is out there. “He’s a great guy around the place, always happy and friendly, so on every level we’d like to keep him. Sometimes it’s not possible, but we’ll certainly be trying. We hope we can come to an agreement but let’s see what happens over the next few weeks.” Elsewhere, six members of the under-21s squad will be leaving the club this summer - Taylor Perry, Luke Matheson, Michael Agboola, Lee Harkin, Jack Hodnett and Jack Scott. Hobbs added: “There are some good players in there, but we’re keen on keeping pathways clear for the younger players. We like to keep our average age young across the 18s and 21s, so some of these boys get to a stage where we have to make the decision for us, but also for them to start a career in men’s football. “Jack Scott, for example, has already got a new club and there’s a lot of interest in all the boys. For us, it’s the right time for both sides, one so we can move 16 and 17-year-olds into the 21s and for them to start a career. “The reality is, to reach our first-team is really tough, but there’s a lot of players who will have good careers and we think holding on to them for too long, and sending them on loans where they never really feel part of it, is not fair. It’s about finding the right time to say off you go, when they have options to get themselves going.” The club statement concluded: \"Everyone at Wolves thanks all those players departing the club this summer for their effort and wish them the best of luck in the future.\" WOLVES PLAYERS OUT OF CONTRACT THIS SUMMER First team Diego Costa Joao Moutinho Adama Traore Under-21 Michael Agboola Lee Harkin Jack Hodnett Luke Matheson Taylor Perry Jack Scott Do you have a parting message for Joao Moutinho? And would you like Adama Traore to stay? Let us know in the comments section . READ NEXT: 'Desperately poor' - Wolves player ratings vs Arsenal as Lopetegui's side are hammered Wolves manager's 'little miracle' warning as talks continue after Arsenal defeat Nuno inflicts misery on Cristiano Ronaldo as Wolves hero bounces back from Tottenham Neves Dawson, Lemina and Semedo - Wolves' best player this season Wolves boss explains Costa, Neto and Podence absence at Arsenal","pubDate":"2023-06-02 20:27:08","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27047925.ece/ALTERNATES/s615/0_Wolverhampton-Wanderers-v-Aston-Villa-Premier-League.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"World Test Championship final is no Ashes curtain-raiser, says Cummins","link":"https://www.brisbanetimes.com.au/sport/cricket/world-test-championship-final-is-no-ashes-curtain-raiser-says-cummins-20230530-p5dceq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Australian captain has implored media not to overlook his side’s achievement in making the Lord’s decider against India - but questions remain over where the WTC - and indeed Test cricket itself - fit into the game’s future.","content":"As Pat Cummins prepares to lead Australia into their first World Test Championship final , the national captain is adamant the achievement of his side in making the play-off should not be lost amid cricket’s cluttered calendar. Squeezed as it is between the Indian Premier League and The Ashes, an event designed to enhance the standing of Test cricket is looking more like a filler event sandwiched between the multibillion dollar T20 league and the game’s oldest rivalry. “We’ve got India in the World Test Championship final first, which I think a lot of people forgot,” Cummins said as he and his players prepare to meet India at the Oval from Wednesday. He has been talking the WTC final up all summer. Australia are aiming to join inaugural champions New Zealand as winners of the biennial event while India, runners-up to the Kiwis in 2021, are looking to go one better. Australia missed out on that first final by the narrowest of margins after losing their last home series to the Indians. “I think being new, it probably didn’t hit us until the game was actually played, and you saw over there [in England] New Zealand did well and you wish you were there,” Cummins said at the start of the Australian Test summer last year, searching for meaning heading into a series against a nondescript West Indian side. “It feels like second time around it’s got a little bit more on it. It felt like a big missed opportunity that first one. So it certainly gives a bit more context to every series now, something big to play for. Opposing captains Rohit Sharma of India and Pat Cummins with the Border–Gavaskar Trophy in February. They meet again in the World Test Championship final, beginning on Wednesday. Credit: Getty Images “The big series, say Ashes or India series where you play four or five Test matches, are obviously big battles, whereas the more common series where you play two or three in a series, it [the World Test Championship] gives them a bit more global context and something a bit extra to play for.” There is uncertainly about where the WTC final fits into the game’s pecking order, as David Warner highlighted when he asked if it should be made a three-Test series. “It’s an interesting one, how you see it as a player and then how you see it as an administrator,” Warner said. “What’s the common goal? Is that the pinnacle now? To win the World Test Championship? “Or is it winning the big series: India in India, Ashes away, Ashes home? As a player, every Test match I play I obviously want to win. So they’re all big to me. It’s actually a hard one to answer.” New Zealand won the inaugural World Championship Final in 2021. Credit: Getty India have won their last four Test series against Australia, two home and two away, so if Australia defeat India in the WTC final, can they really claim to be the best Test team in the world? “It’s a difficult one,” Warner said, before going through the ups and downs of those series. “You can say both teams have played really well in the last two years so from our perspective, when you play one game, I don’t think it really rewards the team who’s actually played well. If it’s a three game series, then it might be a little bit different, but one game shouldn’t just be the result of ‘you’re crowned champions’. That first final in 2021 was played eleven years after it was mooted by the International Cricket Council, as Twenty20 cricket exploded and fabulously wealthy IPL franchises plucked players from international cricket around the globe to service an ever-growing window. Loading The IPL’s grip on world cricket has become ever even firmer since then, with IPL franchises taking over T20 teams in the Carribean Premier League and, most recently, being instrumental in the setting up of T20 leagues in South Africa, the UAE and now the United States. Cashed-up Saudi Arabi is also cosying up to cricket, sponsoring the IPL and other major events possibly with an eye to having IPL franchises play in a Saudi competition. Cummins believes cricket’s calendar will continue to bend to the will of the IPL and its global franchises, cutting deeper into Australia’s once sacred cricketing summer. He agrees that Trent Boult epitomises the player of the future, after the champion left-arm seamer rejected a New Zealand contract and chose to play only major international events between his lucrative T20 assignments. “It’s been coming for a while, but I think it is here now,” Cummins said. “International cricket doesn’t have a monopoly on players’ time, like it did in the past. The IPL changed that a decade ago, but there’s just going to be more and more content that creeps in, so I think we’ve got to be proactive about that. “We have to keep making playing for Australia as special as we can, keeping a high performance to get every single player wanting to play for Australia as much as we can. That’s going to be the challenge. I think it’s upon us now, and we’ve got to start thinking about that quite deeply. I think fast-forward a few years time, a 12-month international calendar might look a little bit different.” Trent Boult bowling in the IPL. Boult knocked back a contract with New Zealand to play more T20 franchise cricket. Credit: AP Cummins believes there will come a time when a player has to gain a release from their T20 franchise to represent their country, in the same way that soccer players need a release from their clubs to play internationals. “When you’re talking about some of the opportunities that may be provided through the franchises, I don’t think you can blame players that might take that option ,” said Cummins, who in 2019 became the most expensive overseas IPL player when he signed for the Kolkata Knight Riders on a contract worth $3.17million. “I see the day where that [a franchise release] happens. I think it’s reality. You’ve seen it in other sports. So again, we’ve got to keep selling why playing for Australia is so special. And making sure there is some flexibility to try and get the best out of these guys. We still want the best players winning World Cups for us, winning big series. But obviously, there’s more competing interests than there were in the past.” Australian Cricketers’ Association president Shane Watson, the former Australian allrounder, agrees. Shane Watson playing in the IPL during 2019. Credit: AP “That’s why things are starting to quicken up, and it’s moving towards a more world football model, where you play for your club, employed by your club, and you get released to play for your country,” Watson told this masthead in a three-part series on the rise and rise of the IPL. ICC chair Greg Barclay agrees that countries must be adaptable with their best players. “It’s massively important that there is flexibility and latitude given to the arrangements with players to ensure they are supported to play international cricket, but they’re also given the opportunity to supplement their incomes,” Barclay said. Loading A year after his retirement, Adam Gilchrist pointed to the future while delivering the Marylebone Cricket Club’s annual Colin Cowdrey Lecture in 2009. Describing Test cricket as “arguably one of the greatest sporting contests ever devised”, Gilchrist described it as an “anachronism” which will “never come close to providing the cold hard cash needed to maintain and grow the game.” “To preserve its future, which we must - less is in fact more - that we should go back to the future where there were fewer Test matches, but a lot more important ones, and where the best cricketers of the day played closer to 50 Tests in their career, not 150.” Administrators have much to ponder when it comes to the future of Test cricket, and the World Test Championship’s place in the game. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket India International Cricket Council Cricket Australia Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Seriously, how else was Origin I going to end?","link":"https://www.brisbanetimes.com.au/sport/nrl/seriously-how-else-was-origin-i-going-to-end-20230602-p5ddfm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter FitzSimons"],"video_url":null,"description":"The Blues looked good, but the Maroons were never going to lose to the Washington Generals.","content":"Rugby league is a simple game. Twenty-six men chase a ball for 80 minutes and at the end, the Queenslanders always win. Yes, with apologies to Gary Lineker. He would have said that, had he followed Origin. But ain’t it the truth? At least, even when NSW does occasionally scratch a win in a match or even a series, doesn’t it seem like both are just the backdrop for the next fabulous Queensland win against all odds? Origin is fabulous sporting theatre just like mother used to make but looking at the last four decades of it, who can say that Queensland and NSW are actually equal co-stars? When they give out the awards, isn’t it Queensland always going for Best Actor, while the best NSW can hope for is Best Supporting Actor? Actually, worse still, are the Blues now not the modern equivalent of the Washington Generals, the team that travels with the Harlem Globetrotters and whose primary role is to act as foils for the Globetrotters’ genius? Didn’t it feel like that? “Everyone got it? The Washington General Blues will grab the lead with fourteen minutes to go and everyone will think, ‘Hey, for once the Generals are going to win!’ But here’s the superb drama of it. In that final burst, we Globetrotter Maroons – even though a man down – will do some razzle dazzle moves to get the ball moving about, get it to the wings and leave you General Blues either wrong-footed or flat-footed as we zip past. And then, with the whole game in the balance and some fools still thinking the General Blues might still pull out a miracle win, we’ll get our prop to outleap your captain and fullback to score the winning try, as the crowd roars and the fat lady sings!” Queensland celebrate at full-time. Credit: Getty This is not to say that NSW is not trying with everything they have in them, nor that I personally have the first clue as to how they can do better. But when they lose a match like that, one more time finding a way to snatch defeat from the jaws of victory despite dominating in just about every facet of play, surely a few different expressions of WTAF are in order? Origin is a great sporting spectacle, and never more electric than when Queensland pulls out victories against all odds. It’s just that there have been so many such victories over the years that those of us south of the Tweed are in danger of being electrocuted. The A-League? Yep, it’s grand final time The A-League grand final is on this weekend? Why weren’t we told ? I don’t mean this as a sneering aside, only as an observation that while there really has been something of an inspiring renaissance of Australian soccer at the international level, with the sterling form of the Socceroos in the World Cup, I am not sure I recall a period where the domestic game was so invisible. Can you? Melbourne City star Marco Tilio. Credit: Getty Images I am not being unkind, I said! Tonight at “Commbank Stadium” wherever that is, the Central Coast Mariners play Melbourne City to decide who is the foremost club in the country. Have you heard talk of either team during the season? I have not. The last time I remember the Mariners making the news was when Usain Bolt briefly turned out for them in that disastrous experiment, yes? Since then, pretty much radio silence. And I am sure Melbourne City is a fine team with fine players, but . . . I can’t quite say I’ve ever heard of them at all. That’s it. You get on with your day. I will stand by for a blizzard of tweets and emails pointing out, not unfairly, that the Super Rugby comp is also pretty bloody invisible these days. Finally, a bullish day for the Bears And speaking of finding new and creative ways to lose, TFF’s light riposte last week about the North Sydney Bears famous propensity to do exactly that inevitably brought forth a few howls from the Lower North Shore’s still beating heart: those who still believe in the Bears, and still yearn for the day they will make their rightful return to the principal league comp. For they will bloody well have us all know, and I quote: “that the diehard Bears fans, who have not stopped following them even in NSW Cup competition as they are now, were treated to one of the clubs biggest comebacks ever last month.” For yes, the Bears are leading that comp and recently found them up against the Bulldogs who are coming second. At half-time, see, they were down 22-4. But did the Bears fold? Did they, HELL! No. They are the mighty Bears, the incarnation of the glory days . . . to come, and scored four superb tries in the second half to win the game 24-22. So there. My key correspondent finishes: “They showed all the determination to never give up that you would expect of a competition frontrunner. We can only hope that the NRL sees the light and returns them to their rightful place in the top tier. Bring back the Bears!” That mob is unstoppable, and in the end must surely get there, yes? Bring back the Far North Sydney Bears and put them on the Central Coast, sharing the field with the Mariners, and playing a few games a year at the most beautiful oval in Sydney, North Sydney Oval. You know it makes sense. It’s for all the world, but not until T20 is finished Sorry, what? And nor did you know that the “World Test Championship” gets underway next Wednesday in London at The Oval, between Australia and India? How could that be? It is Test cricket’s answer to the World Cup and the winner will, I guess, be the official World Champions until the next one is played. So, why is there so little chatter about it? I guess it’s because, as discussed T20 has pretty much eaten up not only most of cricket, but most of the press about it. This World Test Championship, after all, is really only being played now, as the two months of the Indian Premier League T20 has just finished meaning players are now available. And while all short forms of the game used to be squeezed around the Test cricket calendar, it is now quite the reverse – and Test cricket is really little more than the quaint version of the game. Yes, you and I are looking forward to the Ashes, but that is pretty much because we are over 50 years old. Those younger than 30 have heard of Test cricket, but never really liked the sound of it. What they said Coach Billy Slater on his Queenslanders: “But I’ll tell you what, there is a lot of guts and determination and courage in this footy team. We needed to play like Queenslanders for Queenslanders and our trait as Queenslanders [is] never give up. Queenslanders go through drought, they go through cyclones, they go through floods, they go through a lot of adversity – and we try and represent our people in that way as well.” I know, I know. Queenslander! QUEENSLANDER! Paul Vautin in commentary: “Origin is the simplest rugby league to play. You want your big boofhead forwards doing the job and if you’ve got a winger that can fall over the line and score a try, you’re done. That’s all there is to it.” At least so long as you are a . . . QUEENSLANDER! Otherwise, it seems a little more complicated. Cronulla Sharks player Wade Graham on MMM, on the essence of playing State of Origin, even from the bench: “You’ve got to be prepared and ready to play from the word dot.“ Former England captain Mike Brearley trying to get his head around Bazball: “Like everyone else, I’m fascinated to see what happens with Benbuzz.” Australian tennis player Kimberly Birrell on coming back from injury: “It was like a catch-22. I could be at home, trying not to think about tennis, and that’s hard to avoid, because I love watching tennis. So I felt like I only really had one option to get back there and actually be a part of it.” Geva Mentor, centre, with teammates earlier this month. Credit: Getty Images Collingwood Magpies netball player Geva Mentor on the team withdrawing from Super Netball: “I want common sense to prevail. I want everyone to get in a room and put egos aside and just nut this out. There are lives at stake now. It’s people who have to pay mortgages, who don’t know where their next income is coming from. We have a whole lot of people who will be unemployed.” Victor Radley making mixed metaphors while talking about his headbutt which saw him suspended for three weeks: “I was smashing my head against a wall on Saturday and Sunday, not for any other reason than, ‘Why?’ It just happened so fast. I have been an idiot since five or six years old, fighting with my brother. So sometimes these things come out.” Somewhere, I imagine, Victor the Inflictor’s brother is still nursing a sore head? Novak Djokovic serves to Aleksandar Kovacevic on day two of the French Open. Credit: Getty Images Sam Kerr after Chelsea won its fourth league title in a row: “I just do whatever, I keep lifting these trophies, and I don’t really care what people say about me honestly. I’m in the greatest team in England. I’m happy, the team’s happy. It’s not about me, it’s about the team.” Eddie McGuire on business people who get into sports administration: “There are a lot of people in football who are dumb-arses.” MS Dhoni after yet another IPL title and why he likes playing with Ambati Rayudu: “The special thing about Rayudu if he’s on the field he always gives his 100%.” Oh. And one more thing. “He’s also like me who doesn’t use a phone a lot.” What Novak Djokovic wrote on the camera after his first-round French Open win: “Kosovo is the heart of Serbia. Stop violence.” Adam Goodes: “If I’m only known for football, I’ve failed.” Tennis player Daniil Medvedev: “Today, because [of the] wind, dry court, I had a mouthful of clay since probably the third game of the match, and I don’t like it. I don’t know if people like to eat clay, to have clay in their bags, their shoes, the socks, white socks; you can throw them to garbage after clay season. Maybe some people like it. I don’t.” I think Nadal probably does, or at least used to? Team of the Week Melbourne City and Central Coast Mariners. Contesting the A-League grand final later today. Nope, me neither. Had no clue. Shame on us all. (See item.) Loading Liam Hendriks. The Australian baseballer who was diagnosed with stage 4 non-Hodgkin lymphoma made it back to the major leagues. Chennai Super Kings . Needing 10 from the last two balls got a 6 and 4 to win their fifth title in a match that finished around 1.30am, India time. Miami Heat. Made the NBA Finals as an eighth seed and prevented the Boston Celtics from making an improbable 0-3 comeback. Queensland. Nearly every stat was against them, bar the only one that matters, the final score. Watch State of Origin exclusively live and free on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Fitz Files For subscribers NRL 2023 Peter FitzSimons is a journalist and columnist with The Sydney Morning Herald. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"The season so far: The stars, the shocks, and all the big moments","link":"https://www.brisbanetimes.com.au/sport/afl/the-season-so-far-the-stars-the-shocks-and-all-the-big-moments-20230529-p5dc0a.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"There has been much to dissect in an intriguing opening half of the 2023 AFL season. What is clear is that as the run home approaches, there is plenty on the line for all clubs.","content":"Whether it be the dash of Collingwood’s Nick Daicos or the eloquence of Darcy Moore, the poise of the Western Bulldogs’ Marcus Bontempelli, the rash of star rookies, the resurgence of the Bombers and Saints, or the disappearing act that is Carlton and West Coast, there has been much to dissect through an intriguing first half of season 2023. There have, as always, been plenty of headline-grabbing issues off the field. The stars of season 2023 ... so far. Credit: Stephen Kiprillis On the field, there are a few trends emerging that could shape who ultimately holds aloft the premiership cup come the last Saturday in September. As the bye rounds play out and the 18 teams each take a mid-season breather over the coming weeks, The Age takes a look at how this must-watch campaign is shaping up at the halfway point. Loading What the statistics say Champion Data boffins say that while there haven’t been many significant changes in game trends from last season, the league’s determination to open up scoring is having an impact. That may not be obvious when it comes to the slumping Blues over the past month, or the injury-plagued Eagles, but, overall, there is an average of 12.2 goals a game - the most since 2017. The standing-the-mark rule has encouraged teams to attack more through the corridor, and look at how exciting that is when the Magpies are in full flight and running in waves. The move to four field umpires this season had many fans concerned there would be over-officiating, and the game would become bogged down in free kicks. That hasn’t eventuated, for teams are averaging only 18.6 free kicks against, the fewest since 2015, excluding the pandemic-impacted 2020 season. There has been an increase in ball-ups, with 31.6 a game, the most in the past 12 years. There is a belief among clubs that it is as a result of umpires wanting to keep play moving quickly, rather than risking too many ugly scrums, which began to blight the sport through the mid-2010s. A quick ball-up can also avoid second and third tackles, thereby reducing the risk of sling tackles - and serious head knocks - when players become frustrated. Loading Around the ground stoppages have hit 65.4 a game, the most since 2019, a result of teams flooding forward or back. Super sub The AFL’s decision to reintroduce the all-purpose substitute, the 23rd man, has not only ensured added health and safety, but also introduced an added tactical edge. Statistics show there is almost parity through a round in terms of the sub being used to replace an injured player, or activated to add fresh legs late in a game. What appears universal, though, is that clubs want to be able to publicly name their 23rd man at selection, so that player does not need to be named as an “out”. Essendon veteran Dyson Heppell and Richmond counterpart Trent Cotchin had their futures called into question when they were technically omitted, only to be used as the substitute. “Yep. It just makes sense [to be able to name 23],” Essendon coach, and former AFL general manager of football Brad Scott, said. “But having worked at the AFL I know that the lawyers would hate that because they’ve got to re-write the entire rule book because the rule book’s written around 22 players. So they’ve got to change a lot of things.” Big-impact forwards: Cats stars Jeremy Cameron and Tom Hawkins, and Carlton gun Charlie Curnow. Credit: The Age Forward focus If the battle for the Coleman Medal is any guide, the key forward is back, for nine of the top 10 goalkickers are key talls. The outlier is Brisbane Lions dynamo Charlie Cameron. Of the top 10, it’s been great to see Eagle Oscar Allen and Gold Coast’s Ben King return from serious injury, while roaming Cat Jeremy Cameron began the season with such force he had claims to being the league’s best player . Is this the year of the Bont? Marcus Bontempelli has been in Brownlow Medal-winning form. Credit: AFL Photos Brownlow Medal bounty Bontempelli, the Western Bulldogs captain, could already have a handful of games with maximum votes, such is the form the champion midfielder has been in. The defection of Josh Dunkley to the Lions has allowed Bontempelli to spend more time as an inside mid, and he has flourished alongside a typically robust season from Tom Liberatore and Jack Macrae, and the dash of Bailey Smith. Is this the year of the Bont? As for Nick Daicos, well, what hasn’t been said about the Magpies phenom? The dashing half-back is a master creator, and has had at least 40 touches three times. Melbourne midfielder-forward Christian Petracca is also enjoying a strong campaign, while Port Adelaide’s Zak Butters is also a frontrunner, highlighted by 41 disposals and two goals in the wet against the Demons. One name who wasn’t in favour with the bookies through the pre-season was Jordan Dawson, but the Adelaide captaincy is clearly having a positive impact on him. The former Swan is one of the league’s most versatile players. He is also one of the best ball users. On the rise Recruiters say Will Ashcroft could have easily played senior football last year should he have been eligible, such has been the impact the powerful Brisbane Lions’ father-son product has had. This includes his goal-of-the-year contender against Fremantle , when he anticipated the tap from a bounce close to goal, tapped the ball to himself with his right hand, regathered it in mid-air and, while under pressure, used the outside of his right foot to tap through a goal. It may be another year of tumult at North Melbourne, with coach Alastair Clarkson stepping away in his first year at the club , but in young midfielders George Wardlaw and Harry Sheezel, the future is bright. Sheezel is averaging a team-high 27.6 touches a game, while Wardlaw found himself matched up on Scott Pendlebury in only his second game. We have also liked St Kilda’s Mattaes Phillipou, Hawthorn’s Josh Weddle, Greater Western Sydney’s Finn Callaghan, and Gold Coast’s Bailey Humphrey, whose late goal helped the Suns hold on against the Bulldogs. Hornet’s nest A shout-out to Jason Horne-Francis, who has let his actions on the field do the talking when it came to the ridiculous booing he has endured. His decision to leave North Melbourne after one season may have given reason for Kangaroos’ fans to vent their displeasure, but when Magpies’ fans showered him with boos in round one, and supporters of other clubs followed, it was time for the industry as a whole to take a look at itself. Jason Horne-Francis has endured spectator booing, but the Power star has responded with strong on-field form. Credit: Getty Images “I don’t think many players like it when they get booed. I try not to take it in, but I do hear it. With all the pressure on the outside I can let it get into my head a little bit,” Horne-Francis told this masthead in April . “I understand the North supporters’ side of it. I was a young kid and I made the courageous decision to come home, and they are understandably disappointed. I’m just a bit confused about why Collingwood, Sydney and Bulldogs supporters ... why they would boo me.” Horne-Francis will soon be one of the league’s best midfielders. More of this, please Magpies skipper Moore has emerged as the league’s best defender. His ability to stop an opponent, and read the play before intercepting, has been a sight to behold. This included an equal all-time high of 10 intercept marks against the Blues. However, it’s his speech post the Anzac Day clash, where the Pies overcame a 28-point deficit against Essendon , that is etched in the memory. In part, Moore said: “I want to thank and mention all men and women who are serving our country’s interests, both at home and abroad, in war and in peacekeeping operations. “It means a lot to me and the team and the whole club that we can commemorate your service and your sacrifice today by doing what we do. So thank you for your service. “To the veterans, there are over 600,000 veterans in this country who have returned from service, we also extend our thanks to you for your sacrifice and we hope that again, doing what we do today, somehow honours your legacy and what you’ve done for our country. Thank you to those 600,000 veterans as well.” Powerful stand One of the season’s most powerful moments came when Western Bulldogs Indigenous star Jamarra Ugle-Hagan recreated Nicky Winmar’s iconic response to racial abuse , lifting his jumper and pointing to his skin after kicking a goal against the Brisbane Lions at Marvel Stadium. Ugle-Hagan had been racially abused by a spectator in the clash against St Kilda a week earlier. Powerful stands: Nicky Winmar and Jamarra Ugle-Hagan lifting their jumpers. Credit: Wayne Ludbey; Getty Images “I just want to see someone point them out instead of me having to contact the club and say this happened,” Ugle-Hagan said. “I’d rather like someone in the fans point them out, let them know it’s not the right thing to say. And that goes with any race, not just in Aboriginal and Indigenous boys and girls. It’s all racism, it’s making a stance and just it only takes a little bit just to make a comment like: ‘It’s not the best thing to say’ ... just pulling them up on the spot. It’s just going to help and make it better for us’.” Said Winmar: “It’s up to the new generations to reinforce the stance I made back in 1993. I’m still here, still involved with the issue, but it’s been 30 years now, it’s like a big relay race, time to pass on the baton.” Loading Many happy returns Brad Scott, the former North Melbourne coach, has rebuilt Essendon , particularly defensively, in his first year at the Hangar. The Bombers were exploited through the middle of the ground last season, but they are now covering for each other. Ross Lyon was recalled for a second go-round at St Kilda, the Saints having dismissed Brett Ratten after missing the finals last season. He, too, has transformed the Saints with his defensive DNA, but the question is whether the Saints can avoid a repeat of the post-bye collapse they endured last year. Ratten, meanwhile, is the caretaker coach at North Melbourne, Clarkson having stepped aside for physical and mental health reasons while dealing with the fallout from the Hawthorn racism case. Clarkson has denied all allegations against him and the AFL made no findings against Clarkson, Chris Fagan and Jason Burt when it reached an agreement with the families to close the league’s investigation. Farewell to a Buddy It hasn’t been a great season for Lance Franklin , the goalkicking champion held goalless four times in his eight games. The Swans still direct much of their attack to him, but it’s the balanced attack they had against the Blues at the SCG that coach John Longmire really needs. This almost certainly is Franklin’s final season. Regardless of how the Swans go, it’s time to thank the Hawk and Swans great for what he has done for the sport. Andrew Brayshaw is enjoying another strong season, and is one of the league’s best midfielders. Credit: Getty Images Western woes Adam Simpson may be contracted until the end of 2025, but we find it hard to think he will remain in charge if the Eagles fail to win another game. That would mean only three wins across two full seasons. Yes, there have been injuries, and pandemic fallout early last season, but that’s not good enough. Meanwhile, the Dockers have adopted a more attacking ethos over the past month, and have become a force. Andrew Brayshaw is a pleasure to watch. Blue skies no more Coach Michael Voss is a man under immense pressure, for the Blues are limping, and there has been boardroom agitation, with Craig Mathieson stepping down after expressing his displeasure about the team’s performance in Sydney. Key forward Harry McKay must resolve his goalkicking woes , while teams are exploiting Brownlow medallist Patrick Cripps on the rebound. Surely the Blues won’t make Voss the fall guy if the rot continues? Farewell to Tiger greats: Trent Cotchin and Jack Riewoldt are almost certainly in their final seasons. Credit: Getty Images Meanwhile, at Punt Road, Damien Hardwick stepped down as coach , having helped to rebuild the club into a power with premierships in 2017, ’19 and ’20. Hardwick, understanding flag hopes for this year had extinguished, said he had no more to give, and it appears the Tigers, as currently constituted, have little left, for they almost certainly now will not make the finals. It’s time for a fond farewell for Cotchin and Jack Riewoldt. Coaching capers Stuart Dew, Ken Hinkley and Matthew Nicks all deserve applause. Dew is constantly under pressure because the Suns are yet to play finals in their short history, but this may be the year. Hinkley, in the final year of his contract, has the Power firmly in the premiership hunt, and could yet remain at Alberton. Nicks, after finishing 18th, 15th and 14th, has the young and emerging Crows playing exhilarating football, and they appear destined to make the finals. Amid off-field drama, Fagan has maintained his on-field focus to ensure the Brisbane Lions are pressing for the flag, while victories over the Swans and Cats have reinforced the rebuilding Giants made the right call in appointing Adam Kingsley. Heavyweight battle The Cats have had injury issues, and desperately need skipper Patrick Dangerfield to return. For the second time this season, they have dropped three straight, but coach Chris Scott has adopted a measured approach. Are they the team to beat? Can the Magpies, with Jordan De Goey having a headline-free dominant season, maintain the rage? The Demons have failed back-to-back “audits”, and, like the Saints, hope to avoid another stumble post the bye. Clayton Oliver, hurry back. What is clear is that as the run home approaches, there is plenty on the line - for all clubs. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Collingwood Magpies Carlton Blues Essendon Bombers Richmond Tigers Analysis Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Steven Gerrard 'in top three' candidates for Leeds United job after Aston Villa exit","link":"https://www.birminghammail.co.uk/sport/football/football-news/steven-gerrard-in-top-three-27047553","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Bruna Reis)"],"video_url":null,"description":"Latest Aston Villa news from BirminghamLive as Steven Gerrard among the favourites for Leeds United job","content":"Steven Gerrard is reportedly one of three candidates being considered by Leeds United, as he eyes a return to management following his Aston Villa exit. Sam Allardyce, who was in charge for just four games, has left the club following their relegation to the Championship. Leeds finished 19th in the table, five points from safety. After speaking to the Leeds hierarchy, Allardyce admitted : \"At this stage in my career I am not sure taking on this challenge, which is potentially a long-term project, is something I could commit to. But I wish the club every success for the future and hope the club returns to the Premier League, where they belong.\" READ MORE: Alex Moreno posts five-word update after Aston Villa injury blow READ MORE: Dwight Yorke says Unai Emery has done what Steven Gerrard failed to do at Aston Villa As the Yorkshire club look to appoint a new head coach in the next couple of weeks, Gerrard is said to be among the top three contenders, reports The Telegraph . Former Bournemouth boss Scott Parker and West Brom boss Carlos Corberan are also options. In addition, Gerrard is said to be interested in the job, while Corberan has a £2million buy-out clause inserted in his contract. As for Parker, he was sacked by Club Brugge in March and has previously guided the Cherries to Premier League promotion on two occasions. Although Gerrard is one of the candidates currently being considered, Leeds plan to run a through recruitment process and are said to have a \"large number of enquiries from agents and managers\" interested in taking over at Elland Road. However, there is some complication with the process given that there could be a change of ownership. At this stage, it is unclear whether 49ers Enterprises, who own 44 per cent of the club, will buy-out the majority stake which is held by chairman Andrea Radrizzani. Would Gerrard be the right man for the Leeds job? Tell us in the comments section... READ NEXT LIVE: Aston Villa transfer news LIVE: £35m Tammy Abraham update & Joao Felix links Former Aston Villa midfielder released after Premier League promotion Diego Simeone sends Joao Felix transfer message to Aston Villa after Chelsea decision Aston Villa ‘to rival’ Newcastle United for transfer after Arsenal ‘talks’ Aston Villa confirm two more pre-season games including exciting Champions League friendly Tim Sherwood predicted Aston Villa fate after Randy Lerner chat Harvey Barnes next club odds as Aston Villa shoot to the top of the list","pubDate":"2023-06-02 18:23:40","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26616919.ece/ALTERNATES/s615/0_GettyImages-1476731831.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Капитанът на РБ Лайпциг: В Берлин вече се чувстваме у дома си","link":"https://gong.bg/football-sviat/germania/multimedia/video/kapitanyt-na-rb-lajpcig-v-berlin-veche-se-chuvstvame-u-doma-si-738220","keywords":["no"],"creator":null,"video_url":null,"description":"РБ Лайпциг е определян за фаворит във финала на турнира за Купата на Германия по футбол срещу Айнтрахт Франкфурт, а капитанът Вили Орбан заяви, че тимът бързо свиква със завръщането си в Берлин, където ще се играе мачът в събота. Клубът от Лайпциг спечели първия си голям трофей през миналия сезон, побе...","content":"РБ Лайпциг е определян за фаворит във финала на турнира за Купата на Германия по футбол срещу Айнтрахт Франкфурт, а капитанът Вили Орбан заяви, че тимът бързо свиква със завръщането си в Берлин, където ще се играе мачът в събота. Клубът от Лайпциг спечели първия си голям трофей през миналия сезон, побеждавайки Фрайбург, а сега отново ще опита да стигне до отличието на „Олимпиащадион“. „Тук сме за четвърти път в последните пет години. Ситуацията е почти като да се прибираме у дома. Очакваме мача с нетърпение. Имаме огромен шанс да защитим трофея. Не са много отборите, които са постигали това“, коментира Орбан на пресконференция по-рано днес. Байерн Мюнхен, който победи РБ Лайпциг във финала през 2019-а, бе последният тим, който е достигал до четири финала за пет години (2016-2020). Баварците са и последният състав, който успява да защити трофея – през 2014-а и 2020 година. Роденият в Лайпциг старши треньор Марко Розе се стреми към първото си сериозно отличие в Германия, след като преди е бил начело на Локомотив Лайпциг, Борусия Мьонхенгладбах и Борусия Дортмунд. Той изведе отбора до третото място в Бундеслигата, а Айнтрахт Франкфурт завърши на седма позиция. „Финалът не може да се сравнява с първенството, където съставите се срещат два пъти. Няма значение кой е фаворит. В дадения ден всеки може да победи всеки. Тук сме, за да спечелим. Трябва да направим последната крачка“, заяви Розе, който има две шампионски титли и Купа на Австрия с РБ Залцбург. Автор: Кремена Младенова/БТА","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"НА ЖИВО: Локомотив Пловдив - Черно море 1:0, Димитър Илиев откри","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/na-zhivo-lokomotiv-plovdiv-cherno-more-10-dimityr-iliev-otkri-738203","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Локомотив Пловдив победи Черно море с 2:1 на „Лаута“ и приближи опонента си на само точка при оставащ един кръг до края на първенството (53 срещу 54 пункта в полза на варненци). Всички голове в срещата между петия и шестия във временното класиране паднаха през втората част на мача. Първо Димитър Илиев откри, възползвайки се от чудесно подаване на Петър Андреев от десния фланг. Четвърт час преди края на мача Мишаел Алвес изравни, след което провокира феновете на „черно-белите“ при радостта си. Развръзката дойде в последните пет минути, когато Цветомир Панов препъна Димитър Илиев в наказателното поле. Първоначално Георги Димитров не отсъди нищо, но след преглед с ВАР посочи бялата точка. Джовани реализира много хладнокръвно наказателния удар и донесе победата за „смърфовете“. В деветата минута удар на Мазир Сула профуча над напречната греда. Локо отвърна с шут на Дион - също неточен. Велислав Василев бе намерен на скорост в наказателното поле на домакините и опита подаване, но Трупе пресече в най-ключовия миг. В 18-ата минута жпит за изненадващ изстрел направи и Василев, но Хоркаш се намеси добре. След точно половин час игра Хорхе Сегура се извиси над всички и с глава засече центриране на Джовани, но не успя да отклони топката, така че тя да влети в мрежата на Георгиев. Шест минути преди края на частта бързо изпълнение на фал намери Едгар Пашеко зад отбраната на Локомотив. Крилото обаче си затвори ъгъла за стрелба и прати топката в аут. В последните секунди Цветомир Панове се отчете с важна намеса в отбрана, пресичайки пас на Джовани при контраатака на \"черно-белите\". start-photo.bg 46 снимки В началото на вторите 45 минути Джовани осъществи впечатляващ ред, минавайки през няколко играчи на Черно море. Завършващият удар на бразилеца обаче му изневери. Две минути по-късно Локомотив Пловдив откри с точно изпълнение на Димитър Илиев. Капитанът на \"черно-белите\" се възползва от страхотен успореден пас от дясното крило, дошъл от Петър Андреев. Черно море изравни четвърт час преди края чрез резервата Мишаел Алвес. Наглед обречено центриране на Николай Златев от фал бе отклонено от самата аутлиния от Живко Атанасов, който с отиграването си успя да достави и качествено подаване, което Мишаел засече с глава за 1:1. В предпоследната от редовните 90 минути Локомотив Пловдив поведе с 2:1. Джовани реализира много технично дузпа, отсъдена за нарушение на Цветомир Панов срещу Димитър Илиев. Наказателният удар бе преразгледан и от системата ВАР. FT / Локомотив Пловдив - Черно море 2:1 1:0 Димитър Илиев 52` 1:1 Мишаел Алвес 76` 2:1 Джовани 89` (д) Локомотив Пловдив: 23 Динко Хоркаш, 99 Джовани Трупе, 4 Мартин Паскалев, 91 Хорхе Сегура, 50 Йосип Томашевич, 15 Пиер Зебли, 6 Христо Иванов, 33 Георги Каракашев, 14 Димитър Илиев, 7 Бабакар Дион, 10 Джовани Старши треньор: Александър Томаш Черно море: 22 Георги Георгиев, 3 Живко Атанасов, 4 Росен Стефанов, 6 Виктор Попов, 2 Цветомир Панов, 10 Велислав Василев, 23 Едгар Пашеко, 77 Стефан Велев, 35 Арлинд Дакай, 8 Мазир Сула, 86 Исмаил Иса Старши треньор: Илиан Илиев","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"ФА Къп: Преди кръга (02.06.2023)","link":"https://gong.bg/football-sviat/anglia/multimedia/video/fa-kyp-predi-kryga-02.06.2023-738219","keywords":["no"],"creator":null,"video_url":null,"description":"Този уикенд се отбелязва 100-годишнината на финалите за ФА Къп на \"Уембли\" с един епохален мач - Манчестър Юнайтед срещу Манчестър Сити. Червената и синята половина на Манчестър никога не са срещали на финал и това поражда още по-голям интерес. Предаването тази седмица е посветено на финала - Сити сре...","content":"Този уикенд се отбелязва 100-годишнината на финалите за ФА Къп на \"Уембли\" с един епохален мач - Манчестър Юнайтед срещу Манчестър Сити. Червената и синята половина на Манчестър никога не са срещали на финал и това поражда още по-голям интерес. Предаването тази седмица е посветено на финала - Сити срещу Юнайтед. \"Гражданите\" преследват втори трофей по пътя към мечтания требъл този сезон. \"Червените дяволи\" пък излизат за първа купа от 2016 година. Кои играчи обаче могат да направят разликата в мача? Вижте всичко преди утрешния финал за ФА Къп във видеото","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Еуфорията сред феновете на Наполи след спечелената титла","link":"https://gong.bg/football-sviat/italia/multimedia/video/euforiiata-sred-fenovete-na-napoli-sled-spechelenata-titla-738217","keywords":["no"],"creator":null,"video_url":null,"description":"Нова вълна от еуфория заля Неапол преди последния мач на Наполи за сезона, след който шампионската купа ще бъде връчена на отбора. В неделя тимът на Лучано Спалети приема Сампдория, а заявките за билети са близо 100 000. Трибуните на стадион \"Диего Марадона\" обаче разполагат само с 55 хиляди места. Какво к...","content":"Нова вълна от еуфория заля Неапол преди последния мач на Наполи за сезона, след който шампионската купа ще бъде връчена на отбора. В неделя тимът на Лучано Спалети приема Сампдория, а заявките за билети са близо 100 000. Трибуните на стадион \"Диего Марадона\" обаче разполагат само с 55 хиляди места. Какво казаха феновете на Наполи пред пратеника на NOVA в Неапол - Ивайло Пампулов - вижте във видеото","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/","link":"https://gong.bg/bg-football/multimedia/video/lokomotiv-plovdiv-cherno-more-00-pyrvo-poluvreme-738218","keywords":["no"],"creator":null,"video_url":null,"description":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/....","content":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/.","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Wolves confirm eight player departures but keep door open for Adama Traore","link":"https://www.birminghammail.co.uk/sport/football/football-news/wolves-confirm-eight-player-departures-27047910","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Chris Watson)"],"video_url":null,"description":"Wolverhampton Wanderers news from BirminghamLive as Wolves announce that Joao Moutinho and Diego Costa are among those leaving Molineux this summer","content":"Wolverhampton Wanderers have confirmed that Joao Moutinho will leave the club this summer along with Diego Costa - but have not ruled out the possibility of Adama Traore staying at Molineux. All three players are coming to the end of their current contracts with Wolves. And an update has now been given on the situation following the end of the 2022-23 season. The club said in a statement: \" Moutinho passed the 200-appearance mark for Wolves appearance under (Julen) Lopetegui earlier this calendar year, during the fifth year of a glittering career in old gold, after he joined the club from Monaco during the summer of 2018. Player of the Season following his debut campaign, Moutinho scored a collection of stunning goals for the club and was a midfield ever-present alongside Ruben Neves for much of his time at Molineux but will now move on to pastures new this summer.\" READ MORE: Goncalo Guedes makes Wolves stance clear as fresh transfer details emerge READ MORE: Wolves join race for £40m player amid Newcastle and Aston Villa interest Wolves sporting director Matt Hobbs said: \"Joao’s going to go down as one of the best players to ever pull on the old gold, in my opinion. He was an integral part of the team the entire time he was here. Our success over the last four or five years, he’s been instrumental in. So, he now departs with nothing but thanks from the football club. “Everything he does is meticulous. He’s shown a lot of the younger players what you have to do to look after yourself and have a good career in the game. When he first came to the club, he was a big part of the culture change, because of his work ethic and how he managed himself before and after training. He definitely raised the levels and expectations amongst the players themselves. “When he came in, we had a huge Portuguese contingent, and he was a hero to a lot of the guys for what he’d achieved in both club and international football. He just had that presence and people wanted to follow what he was he doing. We thank Joao for all he did at Wolves and wish him the best of luck for the future.” Costa was drafted in amid a striker crisis and made 25 appearances in his nine-month spell at Molineux, helping the team retain their Premier League status. Hobbs said: “Diego came off the back of Sasa’s [Kalajdzic] injury and has been incredible whilst he’s been here, the way he’s bought into the club, the values and the culture. On the pitch, he’s shown that he still has a lot to offer and off the pitch he’s been an incredible teammate, especially for the young Brazilians like Joao [Gomes] and Matheus [Cunha] – he’s been a real asset for them. “We’ve seen the relationship he’s had with the women’s team, where he was in the gym in the evenings and they came in and formed friendships, and he was very supportive of them. I can’t thank him enough for everything he’s done over the season – he was a really important part of what we managed to achieve, staying in the Premier League. “It feels the natural time to part ways because he was on a one-year contract. There was some internal conversations and we felt this was right. I’ve got no doubt that Diego will get another club off the back of his performances for sure. If a club calls me to ask about the person, he’ll get nothing but praise from me.” Traore , meanwhile, is free to speak to other clubs after five years - and 194 appearances - at Wolves but Hobbs said: “As the manager said in his press conferences recently, Adama is a player we’d like to keep and we’re still talking to him. He’s now out of contract, but it doesn’t mean there’s not an opportunity to still come to an agreement, so conversations will be ongoing. He’s probably earned the right to understand what else is out there. “He’s a great guy around the place, always happy and friendly, so on every level we’d like to keep him. Sometimes it’s not possible, but we’ll certainly be trying. We hope we can come to an agreement but let’s see what happens over the next few weeks.” Elsewhere, six members of the under-21s squad will be leaving the club this summer - Taylor Perry, Luke Matheson, Michael Agboola, Lee Harkin, Jack Hodnett and Jack Scott. Hobbs added: “There are some good players in there, but we’re keen on keeping pathways clear for the younger players. We like to keep our average age young across the 18s and 21s, so some of these boys get to a stage where we have to make the decision for us, but also for them to start a career in men’s football. “Jack Scott, for example, has already got a new club and there’s a lot of interest in all the boys. For us, it’s the right time for both sides, one so we can move 16 and 17-year-olds into the 21s and for them to start a career. “The reality is, to reach our first-team is really tough, but there’s a lot of players who will have good careers and we think holding on to them for too long, and sending them on loans where they never really feel part of it, is not fair. It’s about finding the right time to say off you go, when they have options to get themselves going.” The club statement concluded: \"Everyone at Wolves thanks all those players departing the club this summer for their effort and wish them the best of luck in the future.\" WOLVES PLAYERS OUT OF CONTRACT THIS SUMMER First team Diego Costa Joao Moutinho Adama Traore Under-21 Michael Agboola Lee Harkin Jack Hodnett Luke Matheson Taylor Perry Jack Scott Do you have a parting message for Joao Moutinho? And would you like Adama Traore to stay? Let us know in the comments section . READ NEXT: 'Desperately poor' - Wolves player ratings vs Arsenal as Lopetegui's side are hammered Wolves manager's 'little miracle' warning as talks continue after Arsenal defeat Nuno inflicts misery on Cristiano Ronaldo as Wolves hero bounces back from Tottenham Neves Dawson, Lemina and Semedo - Wolves' best player this season Wolves boss explains Costa, Neto and Podence absence at Arsenal","pubDate":"2023-06-02 20:27:08","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27047925.ece/ALTERNATES/s615/0_Wolverhampton-Wanderers-v-Aston-Villa-Premier-League.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"World Test Championship final is no Ashes curtain-raiser, says Cummins","link":"https://www.brisbanetimes.com.au/sport/cricket/world-test-championship-final-is-no-ashes-curtain-raiser-says-cummins-20230530-p5dceq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Australian captain has implored media not to overlook his side’s achievement in making the Lord’s decider against India - but questions remain over where the WTC - and indeed Test cricket itself - fit into the game’s future.","content":"As Pat Cummins prepares to lead Australia into their first World Test Championship final , the national captain is adamant the achievement of his side in making the play-off should not be lost amid cricket’s cluttered calendar. Squeezed as it is between the Indian Premier League and The Ashes, an event designed to enhance the standing of Test cricket is looking more like a filler event sandwiched between the multibillion dollar T20 league and the game’s oldest rivalry. “We’ve got India in the World Test Championship final first, which I think a lot of people forgot,” Cummins said as he and his players prepare to meet India at the Oval from Wednesday. He has been talking the WTC final up all summer. Australia are aiming to join inaugural champions New Zealand as winners of the biennial event while India, runners-up to the Kiwis in 2021, are looking to go one better. Australia missed out on that first final by the narrowest of margins after losing their last home series to the Indians. “I think being new, it probably didn’t hit us until the game was actually played, and you saw over there [in England] New Zealand did well and you wish you were there,” Cummins said at the start of the Australian Test summer last year, searching for meaning heading into a series against a nondescript West Indian side. “It feels like second time around it’s got a little bit more on it. It felt like a big missed opportunity that first one. So it certainly gives a bit more context to every series now, something big to play for. Opposing captains Rohit Sharma of India and Pat Cummins with the Border–Gavaskar Trophy in February. They meet again in the World Test Championship final, beginning on Wednesday. Credit: Getty Images “The big series, say Ashes or India series where you play four or five Test matches, are obviously big battles, whereas the more common series where you play two or three in a series, it [the World Test Championship] gives them a bit more global context and something a bit extra to play for.” There is uncertainly about where the WTC final fits into the game’s pecking order, as David Warner highlighted when he asked if it should be made a three-Test series. “It’s an interesting one, how you see it as a player and then how you see it as an administrator,” Warner said. “What’s the common goal? Is that the pinnacle now? To win the World Test Championship? “Or is it winning the big series: India in India, Ashes away, Ashes home? As a player, every Test match I play I obviously want to win. So they’re all big to me. It’s actually a hard one to answer.” New Zealand won the inaugural World Championship Final in 2021. Credit: Getty India have won their last four Test series against Australia, two home and two away, so if Australia defeat India in the WTC final, can they really claim to be the best Test team in the world? “It’s a difficult one,” Warner said, before going through the ups and downs of those series. “You can say both teams have played really well in the last two years so from our perspective, when you play one game, I don’t think it really rewards the team who’s actually played well. If it’s a three game series, then it might be a little bit different, but one game shouldn’t just be the result of ‘you’re crowned champions’. That first final in 2021 was played eleven years after it was mooted by the International Cricket Council, as Twenty20 cricket exploded and fabulously wealthy IPL franchises plucked players from international cricket around the globe to service an ever-growing window. Loading The IPL’s grip on world cricket has become ever even firmer since then, with IPL franchises taking over T20 teams in the Carribean Premier League and, most recently, being instrumental in the setting up of T20 leagues in South Africa, the UAE and now the United States. Cashed-up Saudi Arabi is also cosying up to cricket, sponsoring the IPL and other major events possibly with an eye to having IPL franchises play in a Saudi competition. Cummins believes cricket’s calendar will continue to bend to the will of the IPL and its global franchises, cutting deeper into Australia’s once sacred cricketing summer. He agrees that Trent Boult epitomises the player of the future, after the champion left-arm seamer rejected a New Zealand contract and chose to play only major international events between his lucrative T20 assignments. “It’s been coming for a while, but I think it is here now,” Cummins said. “International cricket doesn’t have a monopoly on players’ time, like it did in the past. The IPL changed that a decade ago, but there’s just going to be more and more content that creeps in, so I think we’ve got to be proactive about that. “We have to keep making playing for Australia as special as we can, keeping a high performance to get every single player wanting to play for Australia as much as we can. That’s going to be the challenge. I think it’s upon us now, and we’ve got to start thinking about that quite deeply. I think fast-forward a few years time, a 12-month international calendar might look a little bit different.” Trent Boult bowling in the IPL. Boult knocked back a contract with New Zealand to play more T20 franchise cricket. Credit: AP Cummins believes there will come a time when a player has to gain a release from their T20 franchise to represent their country, in the same way that soccer players need a release from their clubs to play internationals. “When you’re talking about some of the opportunities that may be provided through the franchises, I don’t think you can blame players that might take that option ,” said Cummins, who in 2019 became the most expensive overseas IPL player when he signed for the Kolkata Knight Riders on a contract worth $3.17million. “I see the day where that [a franchise release] happens. I think it’s reality. You’ve seen it in other sports. So again, we’ve got to keep selling why playing for Australia is so special. And making sure there is some flexibility to try and get the best out of these guys. We still want the best players winning World Cups for us, winning big series. But obviously, there’s more competing interests than there were in the past.” Australian Cricketers’ Association president Shane Watson, the former Australian allrounder, agrees. Shane Watson playing in the IPL during 2019. Credit: AP “That’s why things are starting to quicken up, and it’s moving towards a more world football model, where you play for your club, employed by your club, and you get released to play for your country,” Watson told this masthead in a three-part series on the rise and rise of the IPL. ICC chair Greg Barclay agrees that countries must be adaptable with their best players. “It’s massively important that there is flexibility and latitude given to the arrangements with players to ensure they are supported to play international cricket, but they’re also given the opportunity to supplement their incomes,” Barclay said. Loading A year after his retirement, Adam Gilchrist pointed to the future while delivering the Marylebone Cricket Club’s annual Colin Cowdrey Lecture in 2009. Describing Test cricket as “arguably one of the greatest sporting contests ever devised”, Gilchrist described it as an “anachronism” which will “never come close to providing the cold hard cash needed to maintain and grow the game.” “To preserve its future, which we must - less is in fact more - that we should go back to the future where there were fewer Test matches, but a lot more important ones, and where the best cricketers of the day played closer to 50 Tests in their career, not 150.” Administrators have much to ponder when it comes to the future of Test cricket, and the World Test Championship’s place in the game. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket India International Cricket Council Cricket Australia Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Seriously, how else was Origin I going to end?","link":"https://www.brisbanetimes.com.au/sport/nrl/seriously-how-else-was-origin-i-going-to-end-20230602-p5ddfm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter FitzSimons"],"video_url":null,"description":"The Blues looked good, but the Maroons were never going to lose to the Washington Generals.","content":"Rugby league is a simple game. Twenty-six men chase a ball for 80 minutes and at the end, the Queenslanders always win. Yes, with apologies to Gary Lineker. He would have said that, had he followed Origin. But ain’t it the truth? At least, even when NSW does occasionally scratch a win in a match or even a series, doesn’t it seem like both are just the backdrop for the next fabulous Queensland win against all odds? Origin is fabulous sporting theatre just like mother used to make but looking at the last four decades of it, who can say that Queensland and NSW are actually equal co-stars? When they give out the awards, isn’t it Queensland always going for Best Actor, while the best NSW can hope for is Best Supporting Actor? Actually, worse still, are the Blues now not the modern equivalent of the Washington Generals, the team that travels with the Harlem Globetrotters and whose primary role is to act as foils for the Globetrotters’ genius? Didn’t it feel like that? “Everyone got it? The Washington General Blues will grab the lead with fourteen minutes to go and everyone will think, ‘Hey, for once the Generals are going to win!’ But here’s the superb drama of it. In that final burst, we Globetrotter Maroons – even though a man down – will do some razzle dazzle moves to get the ball moving about, get it to the wings and leave you General Blues either wrong-footed or flat-footed as we zip past. And then, with the whole game in the balance and some fools still thinking the General Blues might still pull out a miracle win, we’ll get our prop to outleap your captain and fullback to score the winning try, as the crowd roars and the fat lady sings!” Queensland celebrate at full-time. Credit: Getty This is not to say that NSW is not trying with everything they have in them, nor that I personally have the first clue as to how they can do better. But when they lose a match like that, one more time finding a way to snatch defeat from the jaws of victory despite dominating in just about every facet of play, surely a few different expressions of WTAF are in order? Origin is a great sporting spectacle, and never more electric than when Queensland pulls out victories against all odds. It’s just that there have been so many such victories over the years that those of us south of the Tweed are in danger of being electrocuted. The A-League? Yep, it’s grand final time The A-League grand final is on this weekend? Why weren’t we told ? I don’t mean this as a sneering aside, only as an observation that while there really has been something of an inspiring renaissance of Australian soccer at the international level, with the sterling form of the Socceroos in the World Cup, I am not sure I recall a period where the domestic game was so invisible. Can you? Melbourne City star Marco Tilio. Credit: Getty Images I am not being unkind, I said! Tonight at “Commbank Stadium” wherever that is, the Central Coast Mariners play Melbourne City to decide who is the foremost club in the country. Have you heard talk of either team during the season? I have not. The last time I remember the Mariners making the news was when Usain Bolt briefly turned out for them in that disastrous experiment, yes? Since then, pretty much radio silence. And I am sure Melbourne City is a fine team with fine players, but . . . I can’t quite say I’ve ever heard of them at all. That’s it. You get on with your day. I will stand by for a blizzard of tweets and emails pointing out, not unfairly, that the Super Rugby comp is also pretty bloody invisible these days. Finally, a bullish day for the Bears And speaking of finding new and creative ways to lose, TFF’s light riposte last week about the North Sydney Bears famous propensity to do exactly that inevitably brought forth a few howls from the Lower North Shore’s still beating heart: those who still believe in the Bears, and still yearn for the day they will make their rightful return to the principal league comp. For they will bloody well have us all know, and I quote: “that the diehard Bears fans, who have not stopped following them even in NSW Cup competition as they are now, were treated to one of the clubs biggest comebacks ever last month.” For yes, the Bears are leading that comp and recently found them up against the Bulldogs who are coming second. At half-time, see, they were down 22-4. But did the Bears fold? Did they, HELL! No. They are the mighty Bears, the incarnation of the glory days . . . to come, and scored four superb tries in the second half to win the game 24-22. So there. My key correspondent finishes: “They showed all the determination to never give up that you would expect of a competition frontrunner. We can only hope that the NRL sees the light and returns them to their rightful place in the top tier. Bring back the Bears!” That mob is unstoppable, and in the end must surely get there, yes? Bring back the Far North Sydney Bears and put them on the Central Coast, sharing the field with the Mariners, and playing a few games a year at the most beautiful oval in Sydney, North Sydney Oval. You know it makes sense. It’s for all the world, but not until T20 is finished Sorry, what? And nor did you know that the “World Test Championship” gets underway next Wednesday in London at The Oval, between Australia and India? How could that be? It is Test cricket’s answer to the World Cup and the winner will, I guess, be the official World Champions until the next one is played. So, why is there so little chatter about it? I guess it’s because, as discussed T20 has pretty much eaten up not only most of cricket, but most of the press about it. This World Test Championship, after all, is really only being played now, as the two months of the Indian Premier League T20 has just finished meaning players are now available. And while all short forms of the game used to be squeezed around the Test cricket calendar, it is now quite the reverse – and Test cricket is really little more than the quaint version of the game. Yes, you and I are looking forward to the Ashes, but that is pretty much because we are over 50 years old. Those younger than 30 have heard of Test cricket, but never really liked the sound of it. What they said Coach Billy Slater on his Queenslanders: “But I’ll tell you what, there is a lot of guts and determination and courage in this footy team. We needed to play like Queenslanders for Queenslanders and our trait as Queenslanders [is] never give up. Queenslanders go through drought, they go through cyclones, they go through floods, they go through a lot of adversity – and we try and represent our people in that way as well.” I know, I know. Queenslander! QUEENSLANDER! Paul Vautin in commentary: “Origin is the simplest rugby league to play. You want your big boofhead forwards doing the job and if you’ve got a winger that can fall over the line and score a try, you’re done. That’s all there is to it.” At least so long as you are a . . . QUEENSLANDER! Otherwise, it seems a little more complicated. Cronulla Sharks player Wade Graham on MMM, on the essence of playing State of Origin, even from the bench: “You’ve got to be prepared and ready to play from the word dot.“ Former England captain Mike Brearley trying to get his head around Bazball: “Like everyone else, I’m fascinated to see what happens with Benbuzz.” Australian tennis player Kimberly Birrell on coming back from injury: “It was like a catch-22. I could be at home, trying not to think about tennis, and that’s hard to avoid, because I love watching tennis. So I felt like I only really had one option to get back there and actually be a part of it.” Geva Mentor, centre, with teammates earlier this month. Credit: Getty Images Collingwood Magpies netball player Geva Mentor on the team withdrawing from Super Netball: “I want common sense to prevail. I want everyone to get in a room and put egos aside and just nut this out. There are lives at stake now. It’s people who have to pay mortgages, who don’t know where their next income is coming from. We have a whole lot of people who will be unemployed.” Victor Radley making mixed metaphors while talking about his headbutt which saw him suspended for three weeks: “I was smashing my head against a wall on Saturday and Sunday, not for any other reason than, ‘Why?’ It just happened so fast. I have been an idiot since five or six years old, fighting with my brother. So sometimes these things come out.” Somewhere, I imagine, Victor the Inflictor’s brother is still nursing a sore head? Novak Djokovic serves to Aleksandar Kovacevic on day two of the French Open. Credit: Getty Images Sam Kerr after Chelsea won its fourth league title in a row: “I just do whatever, I keep lifting these trophies, and I don’t really care what people say about me honestly. I’m in the greatest team in England. I’m happy, the team’s happy. It’s not about me, it’s about the team.” Eddie McGuire on business people who get into sports administration: “There are a lot of people in football who are dumb-arses.” MS Dhoni after yet another IPL title and why he likes playing with Ambati Rayudu: “The special thing about Rayudu if he’s on the field he always gives his 100%.” Oh. And one more thing. “He’s also like me who doesn’t use a phone a lot.” What Novak Djokovic wrote on the camera after his first-round French Open win: “Kosovo is the heart of Serbia. Stop violence.” Adam Goodes: “If I’m only known for football, I’ve failed.” Tennis player Daniil Medvedev: “Today, because [of the] wind, dry court, I had a mouthful of clay since probably the third game of the match, and I don’t like it. I don’t know if people like to eat clay, to have clay in their bags, their shoes, the socks, white socks; you can throw them to garbage after clay season. Maybe some people like it. I don’t.” I think Nadal probably does, or at least used to? Team of the Week Melbourne City and Central Coast Mariners. Contesting the A-League grand final later today. Nope, me neither. Had no clue. Shame on us all. (See item.) Loading Liam Hendriks. The Australian baseballer who was diagnosed with stage 4 non-Hodgkin lymphoma made it back to the major leagues. Chennai Super Kings . Needing 10 from the last two balls got a 6 and 4 to win their fifth title in a match that finished around 1.30am, India time. Miami Heat. Made the NBA Finals as an eighth seed and prevented the Boston Celtics from making an improbable 0-3 comeback. Queensland. Nearly every stat was against them, bar the only one that matters, the final score. Watch State of Origin exclusively live and free on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Fitz Files For subscribers NRL 2023 Peter FitzSimons is a journalist and columnist with The Sydney Morning Herald. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"The season so far: The stars, the shocks, and all the big moments","link":"https://www.brisbanetimes.com.au/sport/afl/the-season-so-far-the-stars-the-shocks-and-all-the-big-moments-20230529-p5dc0a.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"There has been much to dissect in an intriguing opening half of the 2023 AFL season. What is clear is that as the run home approaches, there is plenty on the line for all clubs.","content":"Whether it be the dash of Collingwood’s Nick Daicos or the eloquence of Darcy Moore, the poise of the Western Bulldogs’ Marcus Bontempelli, the rash of star rookies, the resurgence of the Bombers and Saints, or the disappearing act that is Carlton and West Coast, there has been much to dissect through an intriguing first half of season 2023. There have, as always, been plenty of headline-grabbing issues off the field. The stars of season 2023 ... so far. Credit: Stephen Kiprillis On the field, there are a few trends emerging that could shape who ultimately holds aloft the premiership cup come the last Saturday in September. As the bye rounds play out and the 18 teams each take a mid-season breather over the coming weeks, The Age takes a look at how this must-watch campaign is shaping up at the halfway point. Loading What the statistics say Champion Data boffins say that while there haven’t been many significant changes in game trends from last season, the league’s determination to open up scoring is having an impact. That may not be obvious when it comes to the slumping Blues over the past month, or the injury-plagued Eagles, but, overall, there is an average of 12.2 goals a game - the most since 2017. The standing-the-mark rule has encouraged teams to attack more through the corridor, and look at how exciting that is when the Magpies are in full flight and running in waves. The move to four field umpires this season had many fans concerned there would be over-officiating, and the game would become bogged down in free kicks. That hasn’t eventuated, for teams are averaging only 18.6 free kicks against, the fewest since 2015, excluding the pandemic-impacted 2020 season. There has been an increase in ball-ups, with 31.6 a game, the most in the past 12 years. There is a belief among clubs that it is as a result of umpires wanting to keep play moving quickly, rather than risking too many ugly scrums, which began to blight the sport through the mid-2010s. A quick ball-up can also avoid second and third tackles, thereby reducing the risk of sling tackles - and serious head knocks - when players become frustrated. Loading Around the ground stoppages have hit 65.4 a game, the most since 2019, a result of teams flooding forward or back. Super sub The AFL’s decision to reintroduce the all-purpose substitute, the 23rd man, has not only ensured added health and safety, but also introduced an added tactical edge. Statistics show there is almost parity through a round in terms of the sub being used to replace an injured player, or activated to add fresh legs late in a game. What appears universal, though, is that clubs want to be able to publicly name their 23rd man at selection, so that player does not need to be named as an “out”. Essendon veteran Dyson Heppell and Richmond counterpart Trent Cotchin had their futures called into question when they were technically omitted, only to be used as the substitute. “Yep. It just makes sense [to be able to name 23],” Essendon coach, and former AFL general manager of football Brad Scott, said. “But having worked at the AFL I know that the lawyers would hate that because they’ve got to re-write the entire rule book because the rule book’s written around 22 players. So they’ve got to change a lot of things.” Big-impact forwards: Cats stars Jeremy Cameron and Tom Hawkins, and Carlton gun Charlie Curnow. Credit: The Age Forward focus If the battle for the Coleman Medal is any guide, the key forward is back, for nine of the top 10 goalkickers are key talls. The outlier is Brisbane Lions dynamo Charlie Cameron. Of the top 10, it’s been great to see Eagle Oscar Allen and Gold Coast’s Ben King return from serious injury, while roaming Cat Jeremy Cameron began the season with such force he had claims to being the league’s best player . Is this the year of the Bont? Marcus Bontempelli has been in Brownlow Medal-winning form. Credit: AFL Photos Brownlow Medal bounty Bontempelli, the Western Bulldogs captain, could already have a handful of games with maximum votes, such is the form the champion midfielder has been in. The defection of Josh Dunkley to the Lions has allowed Bontempelli to spend more time as an inside mid, and he has flourished alongside a typically robust season from Tom Liberatore and Jack Macrae, and the dash of Bailey Smith. Is this the year of the Bont? As for Nick Daicos, well, what hasn’t been said about the Magpies phenom? The dashing half-back is a master creator, and has had at least 40 touches three times. Melbourne midfielder-forward Christian Petracca is also enjoying a strong campaign, while Port Adelaide’s Zak Butters is also a frontrunner, highlighted by 41 disposals and two goals in the wet against the Demons. One name who wasn’t in favour with the bookies through the pre-season was Jordan Dawson, but the Adelaide captaincy is clearly having a positive impact on him. The former Swan is one of the league’s most versatile players. He is also one of the best ball users. On the rise Recruiters say Will Ashcroft could have easily played senior football last year should he have been eligible, such has been the impact the powerful Brisbane Lions’ father-son product has had. This includes his goal-of-the-year contender against Fremantle , when he anticipated the tap from a bounce close to goal, tapped the ball to himself with his right hand, regathered it in mid-air and, while under pressure, used the outside of his right foot to tap through a goal. It may be another year of tumult at North Melbourne, with coach Alastair Clarkson stepping away in his first year at the club , but in young midfielders George Wardlaw and Harry Sheezel, the future is bright. Sheezel is averaging a team-high 27.6 touches a game, while Wardlaw found himself matched up on Scott Pendlebury in only his second game. We have also liked St Kilda’s Mattaes Phillipou, Hawthorn’s Josh Weddle, Greater Western Sydney’s Finn Callaghan, and Gold Coast’s Bailey Humphrey, whose late goal helped the Suns hold on against the Bulldogs. Hornet’s nest A shout-out to Jason Horne-Francis, who has let his actions on the field do the talking when it came to the ridiculous booing he has endured. His decision to leave North Melbourne after one season may have given reason for Kangaroos’ fans to vent their displeasure, but when Magpies’ fans showered him with boos in round one, and supporters of other clubs followed, it was time for the industry as a whole to take a look at itself. Jason Horne-Francis has endured spectator booing, but the Power star has responded with strong on-field form. Credit: Getty Images “I don’t think many players like it when they get booed. I try not to take it in, but I do hear it. With all the pressure on the outside I can let it get into my head a little bit,” Horne-Francis told this masthead in April . “I understand the North supporters’ side of it. I was a young kid and I made the courageous decision to come home, and they are understandably disappointed. I’m just a bit confused about why Collingwood, Sydney and Bulldogs supporters ... why they would boo me.” Horne-Francis will soon be one of the league’s best midfielders. More of this, please Magpies skipper Moore has emerged as the league’s best defender. His ability to stop an opponent, and read the play before intercepting, has been a sight to behold. This included an equal all-time high of 10 intercept marks against the Blues. However, it’s his speech post the Anzac Day clash, where the Pies overcame a 28-point deficit against Essendon , that is etched in the memory. In part, Moore said: “I want to thank and mention all men and women who are serving our country’s interests, both at home and abroad, in war and in peacekeeping operations. “It means a lot to me and the team and the whole club that we can commemorate your service and your sacrifice today by doing what we do. So thank you for your service. “To the veterans, there are over 600,000 veterans in this country who have returned from service, we also extend our thanks to you for your sacrifice and we hope that again, doing what we do today, somehow honours your legacy and what you’ve done for our country. Thank you to those 600,000 veterans as well.” Powerful stand One of the season’s most powerful moments came when Western Bulldogs Indigenous star Jamarra Ugle-Hagan recreated Nicky Winmar’s iconic response to racial abuse , lifting his jumper and pointing to his skin after kicking a goal against the Brisbane Lions at Marvel Stadium. Ugle-Hagan had been racially abused by a spectator in the clash against St Kilda a week earlier. Powerful stands: Nicky Winmar and Jamarra Ugle-Hagan lifting their jumpers. Credit: Wayne Ludbey; Getty Images “I just want to see someone point them out instead of me having to contact the club and say this happened,” Ugle-Hagan said. “I’d rather like someone in the fans point them out, let them know it’s not the right thing to say. And that goes with any race, not just in Aboriginal and Indigenous boys and girls. It’s all racism, it’s making a stance and just it only takes a little bit just to make a comment like: ‘It’s not the best thing to say’ ... just pulling them up on the spot. It’s just going to help and make it better for us’.” Said Winmar: “It’s up to the new generations to reinforce the stance I made back in 1993. I’m still here, still involved with the issue, but it’s been 30 years now, it’s like a big relay race, time to pass on the baton.” Loading Many happy returns Brad Scott, the former North Melbourne coach, has rebuilt Essendon , particularly defensively, in his first year at the Hangar. The Bombers were exploited through the middle of the ground last season, but they are now covering for each other. Ross Lyon was recalled for a second go-round at St Kilda, the Saints having dismissed Brett Ratten after missing the finals last season. He, too, has transformed the Saints with his defensive DNA, but the question is whether the Saints can avoid a repeat of the post-bye collapse they endured last year. Ratten, meanwhile, is the caretaker coach at North Melbourne, Clarkson having stepped aside for physical and mental health reasons while dealing with the fallout from the Hawthorn racism case. Clarkson has denied all allegations against him and the AFL made no findings against Clarkson, Chris Fagan and Jason Burt when it reached an agreement with the families to close the league’s investigation. Farewell to a Buddy It hasn’t been a great season for Lance Franklin , the goalkicking champion held goalless four times in his eight games. The Swans still direct much of their attack to him, but it’s the balanced attack they had against the Blues at the SCG that coach John Longmire really needs. This almost certainly is Franklin’s final season. Regardless of how the Swans go, it’s time to thank the Hawk and Swans great for what he has done for the sport. Andrew Brayshaw is enjoying another strong season, and is one of the league’s best midfielders. Credit: Getty Images Western woes Adam Simpson may be contracted until the end of 2025, but we find it hard to think he will remain in charge if the Eagles fail to win another game. That would mean only three wins across two full seasons. Yes, there have been injuries, and pandemic fallout early last season, but that’s not good enough. Meanwhile, the Dockers have adopted a more attacking ethos over the past month, and have become a force. Andrew Brayshaw is a pleasure to watch. Blue skies no more Coach Michael Voss is a man under immense pressure, for the Blues are limping, and there has been boardroom agitation, with Craig Mathieson stepping down after expressing his displeasure about the team’s performance in Sydney. Key forward Harry McKay must resolve his goalkicking woes , while teams are exploiting Brownlow medallist Patrick Cripps on the rebound. Surely the Blues won’t make Voss the fall guy if the rot continues? Farewell to Tiger greats: Trent Cotchin and Jack Riewoldt are almost certainly in their final seasons. Credit: Getty Images Meanwhile, at Punt Road, Damien Hardwick stepped down as coach , having helped to rebuild the club into a power with premierships in 2017, ’19 and ’20. Hardwick, understanding flag hopes for this year had extinguished, said he had no more to give, and it appears the Tigers, as currently constituted, have little left, for they almost certainly now will not make the finals. It’s time for a fond farewell for Cotchin and Jack Riewoldt. Coaching capers Stuart Dew, Ken Hinkley and Matthew Nicks all deserve applause. Dew is constantly under pressure because the Suns are yet to play finals in their short history, but this may be the year. Hinkley, in the final year of his contract, has the Power firmly in the premiership hunt, and could yet remain at Alberton. Nicks, after finishing 18th, 15th and 14th, has the young and emerging Crows playing exhilarating football, and they appear destined to make the finals. Amid off-field drama, Fagan has maintained his on-field focus to ensure the Brisbane Lions are pressing for the flag, while victories over the Swans and Cats have reinforced the rebuilding Giants made the right call in appointing Adam Kingsley. Heavyweight battle The Cats have had injury issues, and desperately need skipper Patrick Dangerfield to return. For the second time this season, they have dropped three straight, but coach Chris Scott has adopted a measured approach. Are they the team to beat? Can the Magpies, with Jordan De Goey having a headline-free dominant season, maintain the rage? The Demons have failed back-to-back “audits”, and, like the Saints, hope to avoid another stumble post the bye. Clayton Oliver, hurry back. What is clear is that as the run home approaches, there is plenty on the line - for all clubs. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Collingwood Magpies Carlton Blues Essendon Bombers Richmond Tigers Analysis Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Steven Gerrard 'in top three' candidates for Leeds United job after Aston Villa exit","link":"https://www.birminghammail.co.uk/sport/football/football-news/steven-gerrard-in-top-three-27047553","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Bruna Reis)"],"video_url":null,"description":"Latest Aston Villa news from BirminghamLive as Steven Gerrard among the favourites for Leeds United job","content":"Steven Gerrard is reportedly one of three candidates being considered by Leeds United, as he eyes a return to management following his Aston Villa exit. Sam Allardyce, who was in charge for just four games, has left the club following their relegation to the Championship. Leeds finished 19th in the table, five points from safety. After speaking to the Leeds hierarchy, Allardyce admitted : \"At this stage in my career I am not sure taking on this challenge, which is potentially a long-term project, is something I could commit to. But I wish the club every success for the future and hope the club returns to the Premier League, where they belong.\" READ MORE: Alex Moreno posts five-word update after Aston Villa injury blow READ MORE: Dwight Yorke says Unai Emery has done what Steven Gerrard failed to do at Aston Villa As the Yorkshire club look to appoint a new head coach in the next couple of weeks, Gerrard is said to be among the top three contenders, reports The Telegraph . Former Bournemouth boss Scott Parker and West Brom boss Carlos Corberan are also options. In addition, Gerrard is said to be interested in the job, while Corberan has a £2million buy-out clause inserted in his contract. As for Parker, he was sacked by Club Brugge in March and has previously guided the Cherries to Premier League promotion on two occasions. Although Gerrard is one of the candidates currently being considered, Leeds plan to run a through recruitment process and are said to have a \"large number of enquiries from agents and managers\" interested in taking over at Elland Road. However, there is some complication with the process given that there could be a change of ownership. At this stage, it is unclear whether 49ers Enterprises, who own 44 per cent of the club, will buy-out the majority stake which is held by chairman Andrea Radrizzani. Would Gerrard be the right man for the Leeds job? Tell us in the comments section... READ NEXT LIVE: Aston Villa transfer news LIVE: £35m Tammy Abraham update & Joao Felix links Former Aston Villa midfielder released after Premier League promotion Diego Simeone sends Joao Felix transfer message to Aston Villa after Chelsea decision Aston Villa ‘to rival’ Newcastle United for transfer after Arsenal ‘talks’ Aston Villa confirm two more pre-season games including exciting Champions League friendly Tim Sherwood predicted Aston Villa fate after Randy Lerner chat Harvey Barnes next club odds as Aston Villa shoot to the top of the list","pubDate":"2023-06-02 18:23:40","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26616919.ece/ALTERNATES/s615/0_GettyImages-1476731831.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Капитанът на РБ Лайпциг: В Берлин вече се чувстваме у дома си","link":"https://gong.bg/football-sviat/germania/multimedia/video/kapitanyt-na-rb-lajpcig-v-berlin-veche-se-chuvstvame-u-doma-si-738220","keywords":["no"],"creator":null,"video_url":null,"description":"РБ Лайпциг е определян за фаворит във финала на турнира за Купата на Германия по футбол срещу Айнтрахт Франкфурт, а капитанът Вили Орбан заяви, че тимът бързо свиква със завръщането си в Берлин, където ще се играе мачът в събота. Клубът от Лайпциг спечели първия си голям трофей през миналия сезон, побе...","content":"РБ Лайпциг е определян за фаворит във финала на турнира за Купата на Германия по футбол срещу Айнтрахт Франкфурт, а капитанът Вили Орбан заяви, че тимът бързо свиква със завръщането си в Берлин, където ще се играе мачът в събота. Клубът от Лайпциг спечели първия си голям трофей през миналия сезон, побеждавайки Фрайбург, а сега отново ще опита да стигне до отличието на „Олимпиащадион“. „Тук сме за четвърти път в последните пет години. Ситуацията е почти като да се прибираме у дома. Очакваме мача с нетърпение. Имаме огромен шанс да защитим трофея. Не са много отборите, които са постигали това“, коментира Орбан на пресконференция по-рано днес. Байерн Мюнхен, който победи РБ Лайпциг във финала през 2019-а, бе последният тим, който е достигал до четири финала за пет години (2016-2020). Баварците са и последният състав, който успява да защити трофея – през 2014-а и 2020 година. Роденият в Лайпциг старши треньор Марко Розе се стреми към първото си сериозно отличие в Германия, след като преди е бил начело на Локомотив Лайпциг, Борусия Мьонхенгладбах и Борусия Дортмунд. Той изведе отбора до третото място в Бундеслигата, а Айнтрахт Франкфурт завърши на седма позиция. „Финалът не може да се сравнява с първенството, където съставите се срещат два пъти. Няма значение кой е фаворит. В дадения ден всеки може да победи всеки. Тук сме, за да спечелим. Трябва да направим последната крачка“, заяви Розе, който има две шампионски титли и Купа на Австрия с РБ Залцбург. Автор: Кремена Младенова/БТА","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"НА ЖИВО: Локомотив Пловдив - Черно море 1:0, Димитър Илиев откри","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/na-zhivo-lokomotiv-plovdiv-cherno-more-10-dimityr-iliev-otkri-738203","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Локомотив Пловдив победи Черно море с 2:1 на „Лаута“ и приближи опонента си на само точка при оставащ един кръг до края на първенството (53 срещу 54 пункта в полза на варненци). Всички голове в срещата между петия и шестия във временното класиране паднаха през втората част на мача. Първо Димитър Илиев откри, възползвайки се от чудесно подаване на Петър Андреев от десния фланг. Четвърт час преди края на мача Мишаел Алвес изравни, след което провокира феновете на „черно-белите“ при радостта си. Развръзката дойде в последните пет минути, когато Цветомир Панов препъна Димитър Илиев в наказателното поле. Първоначално Георги Димитров не отсъди нищо, но след преглед с ВАР посочи бялата точка. Джовани реализира много хладнокръвно наказателния удар и донесе победата за „смърфовете“. В деветата минута удар на Мазир Сула профуча над напречната греда. Локо отвърна с шут на Дион - също неточен. Велислав Василев бе намерен на скорост в наказателното поле на домакините и опита подаване, но Трупе пресече в най-ключовия миг. В 18-ата минута жпит за изненадващ изстрел направи и Василев, но Хоркаш се намеси добре. След точно половин час игра Хорхе Сегура се извиси над всички и с глава засече центриране на Джовани, но не успя да отклони топката, така че тя да влети в мрежата на Георгиев. Шест минути преди края на частта бързо изпълнение на фал намери Едгар Пашеко зад отбраната на Локомотив. Крилото обаче си затвори ъгъла за стрелба и прати топката в аут. В последните секунди Цветомир Панове се отчете с важна намеса в отбрана, пресичайки пас на Джовани при контраатака на \"черно-белите\". start-photo.bg 46 снимки В началото на вторите 45 минути Джовани осъществи впечатляващ ред, минавайки през няколко играчи на Черно море. Завършващият удар на бразилеца обаче му изневери. Две минути по-късно Локомотив Пловдив откри с точно изпълнение на Димитър Илиев. Капитанът на \"черно-белите\" се възползва от страхотен успореден пас от дясното крило, дошъл от Петър Андреев. Черно море изравни четвърт час преди края чрез резервата Мишаел Алвес. Наглед обречено центриране на Николай Златев от фал бе отклонено от самата аутлиния от Живко Атанасов, който с отиграването си успя да достави и качествено подаване, което Мишаел засече с глава за 1:1. В предпоследната от редовните 90 минути Локомотив Пловдив поведе с 2:1. Джовани реализира много технично дузпа, отсъдена за нарушение на Цветомир Панов срещу Димитър Илиев. Наказателният удар бе преразгледан и от системата ВАР. FT / Локомотив Пловдив - Черно море 2:1 1:0 Димитър Илиев 52` 1:1 Мишаел Алвес 76` 2:1 Джовани 89` (д) Локомотив Пловдив: 23 Динко Хоркаш, 99 Джовани Трупе, 4 Мартин Паскалев, 91 Хорхе Сегура, 50 Йосип Томашевич, 15 Пиер Зебли, 6 Христо Иванов, 33 Георги Каракашев, 14 Димитър Илиев, 7 Бабакар Дион, 10 Джовани Старши треньор: Александър Томаш Черно море: 22 Георги Георгиев, 3 Живко Атанасов, 4 Росен Стефанов, 6 Виктор Попов, 2 Цветомир Панов, 10 Велислав Василев, 23 Едгар Пашеко, 77 Стефан Велев, 35 Арлинд Дакай, 8 Мазир Сула, 86 Исмаил Иса Старши треньор: Илиан Илиев","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"ФА Къп: Преди кръга (02.06.2023)","link":"https://gong.bg/football-sviat/anglia/multimedia/video/fa-kyp-predi-kryga-02.06.2023-738219","keywords":["no"],"creator":null,"video_url":null,"description":"Този уикенд се отбелязва 100-годишнината на финалите за ФА Къп на \"Уембли\" с един епохален мач - Манчестър Юнайтед срещу Манчестър Сити. Червената и синята половина на Манчестър никога не са срещали на финал и това поражда още по-голям интерес. Предаването тази седмица е посветено на финала - Сити сре...","content":"Този уикенд се отбелязва 100-годишнината на финалите за ФА Къп на \"Уембли\" с един епохален мач - Манчестър Юнайтед срещу Манчестър Сити. Червената и синята половина на Манчестър никога не са срещали на финал и това поражда още по-голям интерес. Предаването тази седмица е посветено на финала - Сити срещу Юнайтед. \"Гражданите\" преследват втори трофей по пътя към мечтания требъл този сезон. \"Червените дяволи\" пък излизат за първа купа от 2016 година. Кои играчи обаче могат да направят разликата в мача? Вижте всичко преди утрешния финал за ФА Къп във видеото","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Еуфорията сред феновете на Наполи след спечелената титла","link":"https://gong.bg/football-sviat/italia/multimedia/video/euforiiata-sred-fenovete-na-napoli-sled-spechelenata-titla-738217","keywords":["no"],"creator":null,"video_url":null,"description":"Нова вълна от еуфория заля Неапол преди последния мач на Наполи за сезона, след който шампионската купа ще бъде връчена на отбора. В неделя тимът на Лучано Спалети приема Сампдория, а заявките за билети са близо 100 000. Трибуните на стадион \"Диего Марадона\" обаче разполагат само с 55 хиляди места. Какво к...","content":"Нова вълна от еуфория заля Неапол преди последния мач на Наполи за сезона, след който шампионската купа ще бъде връчена на отбора. В неделя тимът на Лучано Спалети приема Сампдория, а заявките за билети са близо 100 000. Трибуните на стадион \"Диего Марадона\" обаче разполагат само с 55 хиляди места. Какво казаха феновете на Наполи пред пратеника на NOVA в Неапол - Ивайло Пампулов - вижте във видеото","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/","link":"https://gong.bg/bg-football/multimedia/video/lokomotiv-plovdiv-cherno-more-00-pyrvo-poluvreme-738218","keywords":["no"],"creator":null,"video_url":null,"description":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/....","content":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/.","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Wolves confirm eight player departures but keep door open for Adama Traore","link":"https://www.birminghammail.co.uk/sport/football/football-news/wolves-confirm-eight-player-departures-27047910","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Chris Watson)"],"video_url":null,"description":"Wolverhampton Wanderers news from BirminghamLive as Wolves announce that Joao Moutinho and Diego Costa are among those leaving Molineux this summer","content":"Wolverhampton Wanderers have confirmed that Joao Moutinho will leave the club this summer along with Diego Costa - but have not ruled out the possibility of Adama Traore staying at Molineux. All three players are coming to the end of their current contracts with Wolves. And an update has now been given on the situation following the end of the 2022-23 season. The club said in a statement: \" Moutinho passed the 200-appearance mark for Wolves appearance under (Julen) Lopetegui earlier this calendar year, during the fifth year of a glittering career in old gold, after he joined the club from Monaco during the summer of 2018. Player of the Season following his debut campaign, Moutinho scored a collection of stunning goals for the club and was a midfield ever-present alongside Ruben Neves for much of his time at Molineux but will now move on to pastures new this summer.\" READ MORE: Goncalo Guedes makes Wolves stance clear as fresh transfer details emerge READ MORE: Wolves join race for £40m player amid Newcastle and Aston Villa interest Wolves sporting director Matt Hobbs said: \"Joao’s going to go down as one of the best players to ever pull on the old gold, in my opinion. He was an integral part of the team the entire time he was here. Our success over the last four or five years, he’s been instrumental in. So, he now departs with nothing but thanks from the football club. “Everything he does is meticulous. He’s shown a lot of the younger players what you have to do to look after yourself and have a good career in the game. When he first came to the club, he was a big part of the culture change, because of his work ethic and how he managed himself before and after training. He definitely raised the levels and expectations amongst the players themselves. “When he came in, we had a huge Portuguese contingent, and he was a hero to a lot of the guys for what he’d achieved in both club and international football. He just had that presence and people wanted to follow what he was he doing. We thank Joao for all he did at Wolves and wish him the best of luck for the future.” Costa was drafted in amid a striker crisis and made 25 appearances in his nine-month spell at Molineux, helping the team retain their Premier League status. Hobbs said: “Diego came off the back of Sasa’s [Kalajdzic] injury and has been incredible whilst he’s been here, the way he’s bought into the club, the values and the culture. On the pitch, he’s shown that he still has a lot to offer and off the pitch he’s been an incredible teammate, especially for the young Brazilians like Joao [Gomes] and Matheus [Cunha] – he’s been a real asset for them. “We’ve seen the relationship he’s had with the women’s team, where he was in the gym in the evenings and they came in and formed friendships, and he was very supportive of them. I can’t thank him enough for everything he’s done over the season – he was a really important part of what we managed to achieve, staying in the Premier League. “It feels the natural time to part ways because he was on a one-year contract. There was some internal conversations and we felt this was right. I’ve got no doubt that Diego will get another club off the back of his performances for sure. If a club calls me to ask about the person, he’ll get nothing but praise from me.” Traore , meanwhile, is free to speak to other clubs after five years - and 194 appearances - at Wolves but Hobbs said: “As the manager said in his press conferences recently, Adama is a player we’d like to keep and we’re still talking to him. He’s now out of contract, but it doesn’t mean there’s not an opportunity to still come to an agreement, so conversations will be ongoing. He’s probably earned the right to understand what else is out there. “He’s a great guy around the place, always happy and friendly, so on every level we’d like to keep him. Sometimes it’s not possible, but we’ll certainly be trying. We hope we can come to an agreement but let’s see what happens over the next few weeks.” Elsewhere, six members of the under-21s squad will be leaving the club this summer - Taylor Perry, Luke Matheson, Michael Agboola, Lee Harkin, Jack Hodnett and Jack Scott. Hobbs added: “There are some good players in there, but we’re keen on keeping pathways clear for the younger players. We like to keep our average age young across the 18s and 21s, so some of these boys get to a stage where we have to make the decision for us, but also for them to start a career in men’s football. “Jack Scott, for example, has already got a new club and there’s a lot of interest in all the boys. For us, it’s the right time for both sides, one so we can move 16 and 17-year-olds into the 21s and for them to start a career. “The reality is, to reach our first-team is really tough, but there’s a lot of players who will have good careers and we think holding on to them for too long, and sending them on loans where they never really feel part of it, is not fair. It’s about finding the right time to say off you go, when they have options to get themselves going.” The club statement concluded: \"Everyone at Wolves thanks all those players departing the club this summer for their effort and wish them the best of luck in the future.\" WOLVES PLAYERS OUT OF CONTRACT THIS SUMMER First team Diego Costa Joao Moutinho Adama Traore Under-21 Michael Agboola Lee Harkin Jack Hodnett Luke Matheson Taylor Perry Jack Scott Do you have a parting message for Joao Moutinho? And would you like Adama Traore to stay? Let us know in the comments section . READ NEXT: 'Desperately poor' - Wolves player ratings vs Arsenal as Lopetegui's side are hammered Wolves manager's 'little miracle' warning as talks continue after Arsenal defeat Nuno inflicts misery on Cristiano Ronaldo as Wolves hero bounces back from Tottenham Neves Dawson, Lemina and Semedo - Wolves' best player this season Wolves boss explains Costa, Neto and Podence absence at Arsenal","pubDate":"2023-06-02 20:27:08","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27047925.ece/ALTERNATES/s615/0_Wolverhampton-Wanderers-v-Aston-Villa-Premier-League.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"World Test Championship final is no Ashes curtain-raiser, says Cummins","link":"https://www.brisbanetimes.com.au/sport/cricket/world-test-championship-final-is-no-ashes-curtain-raiser-says-cummins-20230530-p5dceq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Australian captain has implored media not to overlook his side’s achievement in making the Lord’s decider against India - but questions remain over where the WTC - and indeed Test cricket itself - fit into the game’s future.","content":"As Pat Cummins prepares to lead Australia into their first World Test Championship final , the national captain is adamant the achievement of his side in making the play-off should not be lost amid cricket’s cluttered calendar. Squeezed as it is between the Indian Premier League and The Ashes, an event designed to enhance the standing of Test cricket is looking more like a filler event sandwiched between the multibillion dollar T20 league and the game’s oldest rivalry. “We’ve got India in the World Test Championship final first, which I think a lot of people forgot,” Cummins said as he and his players prepare to meet India at the Oval from Wednesday. He has been talking the WTC final up all summer. Australia are aiming to join inaugural champions New Zealand as winners of the biennial event while India, runners-up to the Kiwis in 2021, are looking to go one better. Australia missed out on that first final by the narrowest of margins after losing their last home series to the Indians. “I think being new, it probably didn’t hit us until the game was actually played, and you saw over there [in England] New Zealand did well and you wish you were there,” Cummins said at the start of the Australian Test summer last year, searching for meaning heading into a series against a nondescript West Indian side. “It feels like second time around it’s got a little bit more on it. It felt like a big missed opportunity that first one. So it certainly gives a bit more context to every series now, something big to play for. Opposing captains Rohit Sharma of India and Pat Cummins with the Border–Gavaskar Trophy in February. They meet again in the World Test Championship final, beginning on Wednesday. Credit: Getty Images “The big series, say Ashes or India series where you play four or five Test matches, are obviously big battles, whereas the more common series where you play two or three in a series, it [the World Test Championship] gives them a bit more global context and something a bit extra to play for.” There is uncertainly about where the WTC final fits into the game’s pecking order, as David Warner highlighted when he asked if it should be made a three-Test series. “It’s an interesting one, how you see it as a player and then how you see it as an administrator,” Warner said. “What’s the common goal? Is that the pinnacle now? To win the World Test Championship? “Or is it winning the big series: India in India, Ashes away, Ashes home? As a player, every Test match I play I obviously want to win. So they’re all big to me. It’s actually a hard one to answer.” New Zealand won the inaugural World Championship Final in 2021. Credit: Getty India have won their last four Test series against Australia, two home and two away, so if Australia defeat India in the WTC final, can they really claim to be the best Test team in the world? “It’s a difficult one,” Warner said, before going through the ups and downs of those series. “You can say both teams have played really well in the last two years so from our perspective, when you play one game, I don’t think it really rewards the team who’s actually played well. If it’s a three game series, then it might be a little bit different, but one game shouldn’t just be the result of ‘you’re crowned champions’. That first final in 2021 was played eleven years after it was mooted by the International Cricket Council, as Twenty20 cricket exploded and fabulously wealthy IPL franchises plucked players from international cricket around the globe to service an ever-growing window. Loading The IPL’s grip on world cricket has become ever even firmer since then, with IPL franchises taking over T20 teams in the Carribean Premier League and, most recently, being instrumental in the setting up of T20 leagues in South Africa, the UAE and now the United States. Cashed-up Saudi Arabi is also cosying up to cricket, sponsoring the IPL and other major events possibly with an eye to having IPL franchises play in a Saudi competition. Cummins believes cricket’s calendar will continue to bend to the will of the IPL and its global franchises, cutting deeper into Australia’s once sacred cricketing summer. He agrees that Trent Boult epitomises the player of the future, after the champion left-arm seamer rejected a New Zealand contract and chose to play only major international events between his lucrative T20 assignments. “It’s been coming for a while, but I think it is here now,” Cummins said. “International cricket doesn’t have a monopoly on players’ time, like it did in the past. The IPL changed that a decade ago, but there’s just going to be more and more content that creeps in, so I think we’ve got to be proactive about that. “We have to keep making playing for Australia as special as we can, keeping a high performance to get every single player wanting to play for Australia as much as we can. That’s going to be the challenge. I think it’s upon us now, and we’ve got to start thinking about that quite deeply. I think fast-forward a few years time, a 12-month international calendar might look a little bit different.” Trent Boult bowling in the IPL. Boult knocked back a contract with New Zealand to play more T20 franchise cricket. Credit: AP Cummins believes there will come a time when a player has to gain a release from their T20 franchise to represent their country, in the same way that soccer players need a release from their clubs to play internationals. “When you’re talking about some of the opportunities that may be provided through the franchises, I don’t think you can blame players that might take that option ,” said Cummins, who in 2019 became the most expensive overseas IPL player when he signed for the Kolkata Knight Riders on a contract worth $3.17million. “I see the day where that [a franchise release] happens. I think it’s reality. You’ve seen it in other sports. So again, we’ve got to keep selling why playing for Australia is so special. And making sure there is some flexibility to try and get the best out of these guys. We still want the best players winning World Cups for us, winning big series. But obviously, there’s more competing interests than there were in the past.” Australian Cricketers’ Association president Shane Watson, the former Australian allrounder, agrees. Shane Watson playing in the IPL during 2019. Credit: AP “That’s why things are starting to quicken up, and it’s moving towards a more world football model, where you play for your club, employed by your club, and you get released to play for your country,” Watson told this masthead in a three-part series on the rise and rise of the IPL. ICC chair Greg Barclay agrees that countries must be adaptable with their best players. “It’s massively important that there is flexibility and latitude given to the arrangements with players to ensure they are supported to play international cricket, but they’re also given the opportunity to supplement their incomes,” Barclay said. Loading A year after his retirement, Adam Gilchrist pointed to the future while delivering the Marylebone Cricket Club’s annual Colin Cowdrey Lecture in 2009. Describing Test cricket as “arguably one of the greatest sporting contests ever devised”, Gilchrist described it as an “anachronism” which will “never come close to providing the cold hard cash needed to maintain and grow the game.” “To preserve its future, which we must - less is in fact more - that we should go back to the future where there were fewer Test matches, but a lot more important ones, and where the best cricketers of the day played closer to 50 Tests in their career, not 150.” Administrators have much to ponder when it comes to the future of Test cricket, and the World Test Championship’s place in the game. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket India International Cricket Council Cricket Australia Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Seriously, how else was Origin I going to end?","link":"https://www.brisbanetimes.com.au/sport/nrl/seriously-how-else-was-origin-i-going-to-end-20230602-p5ddfm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter FitzSimons"],"video_url":null,"description":"The Blues looked good, but the Maroons were never going to lose to the Washington Generals.","content":"Rugby league is a simple game. Twenty-six men chase a ball for 80 minutes and at the end, the Queenslanders always win. Yes, with apologies to Gary Lineker. He would have said that, had he followed Origin. But ain’t it the truth? At least, even when NSW does occasionally scratch a win in a match or even a series, doesn’t it seem like both are just the backdrop for the next fabulous Queensland win against all odds? Origin is fabulous sporting theatre just like mother used to make but looking at the last four decades of it, who can say that Queensland and NSW are actually equal co-stars? When they give out the awards, isn’t it Queensland always going for Best Actor, while the best NSW can hope for is Best Supporting Actor? Actually, worse still, are the Blues now not the modern equivalent of the Washington Generals, the team that travels with the Harlem Globetrotters and whose primary role is to act as foils for the Globetrotters’ genius? Didn’t it feel like that? “Everyone got it? The Washington General Blues will grab the lead with fourteen minutes to go and everyone will think, ‘Hey, for once the Generals are going to win!’ But here’s the superb drama of it. In that final burst, we Globetrotter Maroons – even though a man down – will do some razzle dazzle moves to get the ball moving about, get it to the wings and leave you General Blues either wrong-footed or flat-footed as we zip past. And then, with the whole game in the balance and some fools still thinking the General Blues might still pull out a miracle win, we’ll get our prop to outleap your captain and fullback to score the winning try, as the crowd roars and the fat lady sings!” Queensland celebrate at full-time. Credit: Getty This is not to say that NSW is not trying with everything they have in them, nor that I personally have the first clue as to how they can do better. But when they lose a match like that, one more time finding a way to snatch defeat from the jaws of victory despite dominating in just about every facet of play, surely a few different expressions of WTAF are in order? Origin is a great sporting spectacle, and never more electric than when Queensland pulls out victories against all odds. It’s just that there have been so many such victories over the years that those of us south of the Tweed are in danger of being electrocuted. The A-League? Yep, it’s grand final time The A-League grand final is on this weekend? Why weren’t we told ? I don’t mean this as a sneering aside, only as an observation that while there really has been something of an inspiring renaissance of Australian soccer at the international level, with the sterling form of the Socceroos in the World Cup, I am not sure I recall a period where the domestic game was so invisible. Can you? Melbourne City star Marco Tilio. Credit: Getty Images I am not being unkind, I said! Tonight at “Commbank Stadium” wherever that is, the Central Coast Mariners play Melbourne City to decide who is the foremost club in the country. Have you heard talk of either team during the season? I have not. The last time I remember the Mariners making the news was when Usain Bolt briefly turned out for them in that disastrous experiment, yes? Since then, pretty much radio silence. And I am sure Melbourne City is a fine team with fine players, but . . . I can’t quite say I’ve ever heard of them at all. That’s it. You get on with your day. I will stand by for a blizzard of tweets and emails pointing out, not unfairly, that the Super Rugby comp is also pretty bloody invisible these days. Finally, a bullish day for the Bears And speaking of finding new and creative ways to lose, TFF’s light riposte last week about the North Sydney Bears famous propensity to do exactly that inevitably brought forth a few howls from the Lower North Shore’s still beating heart: those who still believe in the Bears, and still yearn for the day they will make their rightful return to the principal league comp. For they will bloody well have us all know, and I quote: “that the diehard Bears fans, who have not stopped following them even in NSW Cup competition as they are now, were treated to one of the clubs biggest comebacks ever last month.” For yes, the Bears are leading that comp and recently found them up against the Bulldogs who are coming second. At half-time, see, they were down 22-4. But did the Bears fold? Did they, HELL! No. They are the mighty Bears, the incarnation of the glory days . . . to come, and scored four superb tries in the second half to win the game 24-22. So there. My key correspondent finishes: “They showed all the determination to never give up that you would expect of a competition frontrunner. We can only hope that the NRL sees the light and returns them to their rightful place in the top tier. Bring back the Bears!” That mob is unstoppable, and in the end must surely get there, yes? Bring back the Far North Sydney Bears and put them on the Central Coast, sharing the field with the Mariners, and playing a few games a year at the most beautiful oval in Sydney, North Sydney Oval. You know it makes sense. It’s for all the world, but not until T20 is finished Sorry, what? And nor did you know that the “World Test Championship” gets underway next Wednesday in London at The Oval, between Australia and India? How could that be? It is Test cricket’s answer to the World Cup and the winner will, I guess, be the official World Champions until the next one is played. So, why is there so little chatter about it? I guess it’s because, as discussed T20 has pretty much eaten up not only most of cricket, but most of the press about it. This World Test Championship, after all, is really only being played now, as the two months of the Indian Premier League T20 has just finished meaning players are now available. And while all short forms of the game used to be squeezed around the Test cricket calendar, it is now quite the reverse – and Test cricket is really little more than the quaint version of the game. Yes, you and I are looking forward to the Ashes, but that is pretty much because we are over 50 years old. Those younger than 30 have heard of Test cricket, but never really liked the sound of it. What they said Coach Billy Slater on his Queenslanders: “But I’ll tell you what, there is a lot of guts and determination and courage in this footy team. We needed to play like Queenslanders for Queenslanders and our trait as Queenslanders [is] never give up. Queenslanders go through drought, they go through cyclones, they go through floods, they go through a lot of adversity – and we try and represent our people in that way as well.” I know, I know. Queenslander! QUEENSLANDER! Paul Vautin in commentary: “Origin is the simplest rugby league to play. You want your big boofhead forwards doing the job and if you’ve got a winger that can fall over the line and score a try, you’re done. That’s all there is to it.” At least so long as you are a . . . QUEENSLANDER! Otherwise, it seems a little more complicated. Cronulla Sharks player Wade Graham on MMM, on the essence of playing State of Origin, even from the bench: “You’ve got to be prepared and ready to play from the word dot.“ Former England captain Mike Brearley trying to get his head around Bazball: “Like everyone else, I’m fascinated to see what happens with Benbuzz.” Australian tennis player Kimberly Birrell on coming back from injury: “It was like a catch-22. I could be at home, trying not to think about tennis, and that’s hard to avoid, because I love watching tennis. So I felt like I only really had one option to get back there and actually be a part of it.” Geva Mentor, centre, with teammates earlier this month. Credit: Getty Images Collingwood Magpies netball player Geva Mentor on the team withdrawing from Super Netball: “I want common sense to prevail. I want everyone to get in a room and put egos aside and just nut this out. There are lives at stake now. It’s people who have to pay mortgages, who don’t know where their next income is coming from. We have a whole lot of people who will be unemployed.” Victor Radley making mixed metaphors while talking about his headbutt which saw him suspended for three weeks: “I was smashing my head against a wall on Saturday and Sunday, not for any other reason than, ‘Why?’ It just happened so fast. I have been an idiot since five or six years old, fighting with my brother. So sometimes these things come out.” Somewhere, I imagine, Victor the Inflictor’s brother is still nursing a sore head? Novak Djokovic serves to Aleksandar Kovacevic on day two of the French Open. Credit: Getty Images Sam Kerr after Chelsea won its fourth league title in a row: “I just do whatever, I keep lifting these trophies, and I don’t really care what people say about me honestly. I’m in the greatest team in England. I’m happy, the team’s happy. It’s not about me, it’s about the team.” Eddie McGuire on business people who get into sports administration: “There are a lot of people in football who are dumb-arses.” MS Dhoni after yet another IPL title and why he likes playing with Ambati Rayudu: “The special thing about Rayudu if he’s on the field he always gives his 100%.” Oh. And one more thing. “He’s also like me who doesn’t use a phone a lot.” What Novak Djokovic wrote on the camera after his first-round French Open win: “Kosovo is the heart of Serbia. Stop violence.” Adam Goodes: “If I’m only known for football, I’ve failed.” Tennis player Daniil Medvedev: “Today, because [of the] wind, dry court, I had a mouthful of clay since probably the third game of the match, and I don’t like it. I don’t know if people like to eat clay, to have clay in their bags, their shoes, the socks, white socks; you can throw them to garbage after clay season. Maybe some people like it. I don’t.” I think Nadal probably does, or at least used to? Team of the Week Melbourne City and Central Coast Mariners. Contesting the A-League grand final later today. Nope, me neither. Had no clue. Shame on us all. (See item.) Loading Liam Hendriks. The Australian baseballer who was diagnosed with stage 4 non-Hodgkin lymphoma made it back to the major leagues. Chennai Super Kings . Needing 10 from the last two balls got a 6 and 4 to win their fifth title in a match that finished around 1.30am, India time. Miami Heat. Made the NBA Finals as an eighth seed and prevented the Boston Celtics from making an improbable 0-3 comeback. Queensland. Nearly every stat was against them, bar the only one that matters, the final score. Watch State of Origin exclusively live and free on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Fitz Files For subscribers NRL 2023 Peter FitzSimons is a journalist and columnist with The Sydney Morning Herald. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"The season so far: The stars, the shocks, and all the big moments","link":"https://www.brisbanetimes.com.au/sport/afl/the-season-so-far-the-stars-the-shocks-and-all-the-big-moments-20230529-p5dc0a.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"There has been much to dissect in an intriguing opening half of the 2023 AFL season. What is clear is that as the run home approaches, there is plenty on the line for all clubs.","content":"Whether it be the dash of Collingwood’s Nick Daicos or the eloquence of Darcy Moore, the poise of the Western Bulldogs’ Marcus Bontempelli, the rash of star rookies, the resurgence of the Bombers and Saints, or the disappearing act that is Carlton and West Coast, there has been much to dissect through an intriguing first half of season 2023. There have, as always, been plenty of headline-grabbing issues off the field. The stars of season 2023 ... so far. Credit: Stephen Kiprillis On the field, there are a few trends emerging that could shape who ultimately holds aloft the premiership cup come the last Saturday in September. As the bye rounds play out and the 18 teams each take a mid-season breather over the coming weeks, The Age takes a look at how this must-watch campaign is shaping up at the halfway point. Loading What the statistics say Champion Data boffins say that while there haven’t been many significant changes in game trends from last season, the league’s determination to open up scoring is having an impact. That may not be obvious when it comes to the slumping Blues over the past month, or the injury-plagued Eagles, but, overall, there is an average of 12.2 goals a game - the most since 2017. The standing-the-mark rule has encouraged teams to attack more through the corridor, and look at how exciting that is when the Magpies are in full flight and running in waves. The move to four field umpires this season had many fans concerned there would be over-officiating, and the game would become bogged down in free kicks. That hasn’t eventuated, for teams are averaging only 18.6 free kicks against, the fewest since 2015, excluding the pandemic-impacted 2020 season. There has been an increase in ball-ups, with 31.6 a game, the most in the past 12 years. There is a belief among clubs that it is as a result of umpires wanting to keep play moving quickly, rather than risking too many ugly scrums, which began to blight the sport through the mid-2010s. A quick ball-up can also avoid second and third tackles, thereby reducing the risk of sling tackles - and serious head knocks - when players become frustrated. Loading Around the ground stoppages have hit 65.4 a game, the most since 2019, a result of teams flooding forward or back. Super sub The AFL’s decision to reintroduce the all-purpose substitute, the 23rd man, has not only ensured added health and safety, but also introduced an added tactical edge. Statistics show there is almost parity through a round in terms of the sub being used to replace an injured player, or activated to add fresh legs late in a game. What appears universal, though, is that clubs want to be able to publicly name their 23rd man at selection, so that player does not need to be named as an “out”. Essendon veteran Dyson Heppell and Richmond counterpart Trent Cotchin had their futures called into question when they were technically omitted, only to be used as the substitute. “Yep. It just makes sense [to be able to name 23],” Essendon coach, and former AFL general manager of football Brad Scott, said. “But having worked at the AFL I know that the lawyers would hate that because they’ve got to re-write the entire rule book because the rule book’s written around 22 players. So they’ve got to change a lot of things.” Big-impact forwards: Cats stars Jeremy Cameron and Tom Hawkins, and Carlton gun Charlie Curnow. Credit: The Age Forward focus If the battle for the Coleman Medal is any guide, the key forward is back, for nine of the top 10 goalkickers are key talls. The outlier is Brisbane Lions dynamo Charlie Cameron. Of the top 10, it’s been great to see Eagle Oscar Allen and Gold Coast’s Ben King return from serious injury, while roaming Cat Jeremy Cameron began the season with such force he had claims to being the league’s best player . Is this the year of the Bont? Marcus Bontempelli has been in Brownlow Medal-winning form. Credit: AFL Photos Brownlow Medal bounty Bontempelli, the Western Bulldogs captain, could already have a handful of games with maximum votes, such is the form the champion midfielder has been in. The defection of Josh Dunkley to the Lions has allowed Bontempelli to spend more time as an inside mid, and he has flourished alongside a typically robust season from Tom Liberatore and Jack Macrae, and the dash of Bailey Smith. Is this the year of the Bont? As for Nick Daicos, well, what hasn’t been said about the Magpies phenom? The dashing half-back is a master creator, and has had at least 40 touches three times. Melbourne midfielder-forward Christian Petracca is also enjoying a strong campaign, while Port Adelaide’s Zak Butters is also a frontrunner, highlighted by 41 disposals and two goals in the wet against the Demons. One name who wasn’t in favour with the bookies through the pre-season was Jordan Dawson, but the Adelaide captaincy is clearly having a positive impact on him. The former Swan is one of the league’s most versatile players. He is also one of the best ball users. On the rise Recruiters say Will Ashcroft could have easily played senior football last year should he have been eligible, such has been the impact the powerful Brisbane Lions’ father-son product has had. This includes his goal-of-the-year contender against Fremantle , when he anticipated the tap from a bounce close to goal, tapped the ball to himself with his right hand, regathered it in mid-air and, while under pressure, used the outside of his right foot to tap through a goal. It may be another year of tumult at North Melbourne, with coach Alastair Clarkson stepping away in his first year at the club , but in young midfielders George Wardlaw and Harry Sheezel, the future is bright. Sheezel is averaging a team-high 27.6 touches a game, while Wardlaw found himself matched up on Scott Pendlebury in only his second game. We have also liked St Kilda’s Mattaes Phillipou, Hawthorn’s Josh Weddle, Greater Western Sydney’s Finn Callaghan, and Gold Coast’s Bailey Humphrey, whose late goal helped the Suns hold on against the Bulldogs. Hornet’s nest A shout-out to Jason Horne-Francis, who has let his actions on the field do the talking when it came to the ridiculous booing he has endured. His decision to leave North Melbourne after one season may have given reason for Kangaroos’ fans to vent their displeasure, but when Magpies’ fans showered him with boos in round one, and supporters of other clubs followed, it was time for the industry as a whole to take a look at itself. Jason Horne-Francis has endured spectator booing, but the Power star has responded with strong on-field form. Credit: Getty Images “I don’t think many players like it when they get booed. I try not to take it in, but I do hear it. With all the pressure on the outside I can let it get into my head a little bit,” Horne-Francis told this masthead in April . “I understand the North supporters’ side of it. I was a young kid and I made the courageous decision to come home, and they are understandably disappointed. I’m just a bit confused about why Collingwood, Sydney and Bulldogs supporters ... why they would boo me.” Horne-Francis will soon be one of the league’s best midfielders. More of this, please Magpies skipper Moore has emerged as the league’s best defender. His ability to stop an opponent, and read the play before intercepting, has been a sight to behold. This included an equal all-time high of 10 intercept marks against the Blues. However, it’s his speech post the Anzac Day clash, where the Pies overcame a 28-point deficit against Essendon , that is etched in the memory. In part, Moore said: “I want to thank and mention all men and women who are serving our country’s interests, both at home and abroad, in war and in peacekeeping operations. “It means a lot to me and the team and the whole club that we can commemorate your service and your sacrifice today by doing what we do. So thank you for your service. “To the veterans, there are over 600,000 veterans in this country who have returned from service, we also extend our thanks to you for your sacrifice and we hope that again, doing what we do today, somehow honours your legacy and what you’ve done for our country. Thank you to those 600,000 veterans as well.” Powerful stand One of the season’s most powerful moments came when Western Bulldogs Indigenous star Jamarra Ugle-Hagan recreated Nicky Winmar’s iconic response to racial abuse , lifting his jumper and pointing to his skin after kicking a goal against the Brisbane Lions at Marvel Stadium. Ugle-Hagan had been racially abused by a spectator in the clash against St Kilda a week earlier. Powerful stands: Nicky Winmar and Jamarra Ugle-Hagan lifting their jumpers. Credit: Wayne Ludbey; Getty Images “I just want to see someone point them out instead of me having to contact the club and say this happened,” Ugle-Hagan said. “I’d rather like someone in the fans point them out, let them know it’s not the right thing to say. And that goes with any race, not just in Aboriginal and Indigenous boys and girls. It’s all racism, it’s making a stance and just it only takes a little bit just to make a comment like: ‘It’s not the best thing to say’ ... just pulling them up on the spot. It’s just going to help and make it better for us’.” Said Winmar: “It’s up to the new generations to reinforce the stance I made back in 1993. I’m still here, still involved with the issue, but it’s been 30 years now, it’s like a big relay race, time to pass on the baton.” Loading Many happy returns Brad Scott, the former North Melbourne coach, has rebuilt Essendon , particularly defensively, in his first year at the Hangar. The Bombers were exploited through the middle of the ground last season, but they are now covering for each other. Ross Lyon was recalled for a second go-round at St Kilda, the Saints having dismissed Brett Ratten after missing the finals last season. He, too, has transformed the Saints with his defensive DNA, but the question is whether the Saints can avoid a repeat of the post-bye collapse they endured last year. Ratten, meanwhile, is the caretaker coach at North Melbourne, Clarkson having stepped aside for physical and mental health reasons while dealing with the fallout from the Hawthorn racism case. Clarkson has denied all allegations against him and the AFL made no findings against Clarkson, Chris Fagan and Jason Burt when it reached an agreement with the families to close the league’s investigation. Farewell to a Buddy It hasn’t been a great season for Lance Franklin , the goalkicking champion held goalless four times in his eight games. The Swans still direct much of their attack to him, but it’s the balanced attack they had against the Blues at the SCG that coach John Longmire really needs. This almost certainly is Franklin’s final season. Regardless of how the Swans go, it’s time to thank the Hawk and Swans great for what he has done for the sport. Andrew Brayshaw is enjoying another strong season, and is one of the league’s best midfielders. Credit: Getty Images Western woes Adam Simpson may be contracted until the end of 2025, but we find it hard to think he will remain in charge if the Eagles fail to win another game. That would mean only three wins across two full seasons. Yes, there have been injuries, and pandemic fallout early last season, but that’s not good enough. Meanwhile, the Dockers have adopted a more attacking ethos over the past month, and have become a force. Andrew Brayshaw is a pleasure to watch. Blue skies no more Coach Michael Voss is a man under immense pressure, for the Blues are limping, and there has been boardroom agitation, with Craig Mathieson stepping down after expressing his displeasure about the team’s performance in Sydney. Key forward Harry McKay must resolve his goalkicking woes , while teams are exploiting Brownlow medallist Patrick Cripps on the rebound. Surely the Blues won’t make Voss the fall guy if the rot continues? Farewell to Tiger greats: Trent Cotchin and Jack Riewoldt are almost certainly in their final seasons. Credit: Getty Images Meanwhile, at Punt Road, Damien Hardwick stepped down as coach , having helped to rebuild the club into a power with premierships in 2017, ’19 and ’20. Hardwick, understanding flag hopes for this year had extinguished, said he had no more to give, and it appears the Tigers, as currently constituted, have little left, for they almost certainly now will not make the finals. It’s time for a fond farewell for Cotchin and Jack Riewoldt. Coaching capers Stuart Dew, Ken Hinkley and Matthew Nicks all deserve applause. Dew is constantly under pressure because the Suns are yet to play finals in their short history, but this may be the year. Hinkley, in the final year of his contract, has the Power firmly in the premiership hunt, and could yet remain at Alberton. Nicks, after finishing 18th, 15th and 14th, has the young and emerging Crows playing exhilarating football, and they appear destined to make the finals. Amid off-field drama, Fagan has maintained his on-field focus to ensure the Brisbane Lions are pressing for the flag, while victories over the Swans and Cats have reinforced the rebuilding Giants made the right call in appointing Adam Kingsley. Heavyweight battle The Cats have had injury issues, and desperately need skipper Patrick Dangerfield to return. For the second time this season, they have dropped three straight, but coach Chris Scott has adopted a measured approach. Are they the team to beat? Can the Magpies, with Jordan De Goey having a headline-free dominant season, maintain the rage? The Demons have failed back-to-back “audits”, and, like the Saints, hope to avoid another stumble post the bye. Clayton Oliver, hurry back. What is clear is that as the run home approaches, there is plenty on the line - for all clubs. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Collingwood Magpies Carlton Blues Essendon Bombers Richmond Tigers Analysis Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-02 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Steven Gerrard 'in top three' candidates for Leeds United job after Aston Villa exit","link":"https://www.birminghammail.co.uk/sport/football/football-news/steven-gerrard-in-top-three-27047553","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Bruna Reis)"],"video_url":null,"description":"Latest Aston Villa news from BirminghamLive as Steven Gerrard among the favourites for Leeds United job","content":"Steven Gerrard is reportedly one of three candidates being considered by Leeds United, as he eyes a return to management following his Aston Villa exit. Sam Allardyce, who was in charge for just four games, has left the club following their relegation to the Championship. Leeds finished 19th in the table, five points from safety. After speaking to the Leeds hierarchy, Allardyce admitted : \"At this stage in my career I am not sure taking on this challenge, which is potentially a long-term project, is something I could commit to. But I wish the club every success for the future and hope the club returns to the Premier League, where they belong.\" READ MORE: Alex Moreno posts five-word update after Aston Villa injury blow READ MORE: Dwight Yorke says Unai Emery has done what Steven Gerrard failed to do at Aston Villa As the Yorkshire club look to appoint a new head coach in the next couple of weeks, Gerrard is said to be among the top three contenders, reports The Telegraph . Former Bournemouth boss Scott Parker and West Brom boss Carlos Corberan are also options. In addition, Gerrard is said to be interested in the job, while Corberan has a £2million buy-out clause inserted in his contract. As for Parker, he was sacked by Club Brugge in March and has previously guided the Cherries to Premier League promotion on two occasions. Although Gerrard is one of the candidates currently being considered, Leeds plan to run a through recruitment process and are said to have a \"large number of enquiries from agents and managers\" interested in taking over at Elland Road. However, there is some complication with the process given that there could be a change of ownership. At this stage, it is unclear whether 49ers Enterprises, who own 44 per cent of the club, will buy-out the majority stake which is held by chairman Andrea Radrizzani. Would Gerrard be the right man for the Leeds job? Tell us in the comments section... READ NEXT LIVE: Aston Villa transfer news LIVE: £35m Tammy Abraham update & Joao Felix links Former Aston Villa midfielder released after Premier League promotion Diego Simeone sends Joao Felix transfer message to Aston Villa after Chelsea decision Aston Villa ‘to rival’ Newcastle United for transfer after Arsenal ‘talks’ Aston Villa confirm two more pre-season games including exciting Champions League friendly Tim Sherwood predicted Aston Villa fate after Randy Lerner chat Harvey Barnes next club odds as Aston Villa shoot to the top of the list","pubDate":"2023-06-02 18:23:40","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26616919.ece/ALTERNATES/s615/0_GettyImages-1476731831.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Капитанът на РБ Лайпциг: В Берлин вече се чувстваме у дома си","link":"https://gong.bg/football-sviat/germania/multimedia/video/kapitanyt-na-rb-lajpcig-v-berlin-veche-se-chuvstvame-u-doma-si-738220","keywords":["no"],"creator":null,"video_url":null,"description":"РБ Лайпциг е определян за фаворит във финала на турнира за Купата на Германия по футбол срещу Айнтрахт Франкфурт, а капитанът Вили Орбан заяви, че тимът бързо свиква със завръщането си в Берлин, където ще се играе мачът в събота. Клубът от Лайпциг спечели първия си голям трофей през миналия сезон, побе...","content":"РБ Лайпциг е определян за фаворит във финала на турнира за Купата на Германия по футбол срещу Айнтрахт Франкфурт, а капитанът Вили Орбан заяви, че тимът бързо свиква със завръщането си в Берлин, където ще се играе мачът в събота. Клубът от Лайпциг спечели първия си голям трофей през миналия сезон, побеждавайки Фрайбург, а сега отново ще опита да стигне до отличието на „Олимпиащадион“. „Тук сме за четвърти път в последните пет години. Ситуацията е почти като да се прибираме у дома. Очакваме мача с нетърпение. Имаме огромен шанс да защитим трофея. Не са много отборите, които са постигали това“, коментира Орбан на пресконференция по-рано днес. Байерн Мюнхен, който победи РБ Лайпциг във финала през 2019-а, бе последният тим, който е достигал до четири финала за пет години (2016-2020). Баварците са и последният състав, който успява да защити трофея – през 2014-а и 2020 година. Роденият в Лайпциг старши треньор Марко Розе се стреми към първото си сериозно отличие в Германия, след като преди е бил начело на Локомотив Лайпциг, Борусия Мьонхенгладбах и Борусия Дортмунд. Той изведе отбора до третото място в Бундеслигата, а Айнтрахт Франкфурт завърши на седма позиция. „Финалът не може да се сравнява с първенството, където съставите се срещат два пъти. Няма значение кой е фаворит. В дадения ден всеки може да победи всеки. Тук сме, за да спечелим. Трябва да направим последната крачка“, заяви Розе, който има две шампионски титли и Купа на Австрия с РБ Залцбург. Автор: Кремена Младенова/БТА","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"НА ЖИВО: Локомотив Пловдив - Черно море 1:0, Димитър Илиев откри","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/na-zhivo-lokomotiv-plovdiv-cherno-more-10-dimityr-iliev-otkri-738203","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Локомотив Пловдив победи Черно море с 2:1 на „Лаута“ и приближи опонента си на само точка при оставащ един кръг до края на първенството (53 срещу 54 пункта в полза на варненци). Всички голове в срещата между петия и шестия във временното класиране паднаха през втората част на мача. Първо Димитър Илиев откри, възползвайки се от чудесно подаване на Петър Андреев от десния фланг. Четвърт час преди края на мача Мишаел Алвес изравни, след което провокира феновете на „черно-белите“ при радостта си. Развръзката дойде в последните пет минути, когато Цветомир Панов препъна Димитър Илиев в наказателното поле. Първоначално Георги Димитров не отсъди нищо, но след преглед с ВАР посочи бялата точка. Джовани реализира много хладнокръвно наказателния удар и донесе победата за „смърфовете“. В деветата минута удар на Мазир Сула профуча над напречната греда. Локо отвърна с шут на Дион - също неточен. Велислав Василев бе намерен на скорост в наказателното поле на домакините и опита подаване, но Трупе пресече в най-ключовия миг. В 18-ата минута жпит за изненадващ изстрел направи и Василев, но Хоркаш се намеси добре. След точно половин час игра Хорхе Сегура се извиси над всички и с глава засече центриране на Джовани, но не успя да отклони топката, така че тя да влети в мрежата на Георгиев. Шест минути преди края на частта бързо изпълнение на фал намери Едгар Пашеко зад отбраната на Локомотив. Крилото обаче си затвори ъгъла за стрелба и прати топката в аут. В последните секунди Цветомир Панове се отчете с важна намеса в отбрана, пресичайки пас на Джовани при контраатака на \"черно-белите\". start-photo.bg 46 снимки В началото на вторите 45 минути Джовани осъществи впечатляващ ред, минавайки през няколко играчи на Черно море. Завършващият удар на бразилеца обаче му изневери. Две минути по-късно Локомотив Пловдив откри с точно изпълнение на Димитър Илиев. Капитанът на \"черно-белите\" се възползва от страхотен успореден пас от дясното крило, дошъл от Петър Андреев. Черно море изравни четвърт час преди края чрез резервата Мишаел Алвес. Наглед обречено центриране на Николай Златев от фал бе отклонено от самата аутлиния от Живко Атанасов, който с отиграването си успя да достави и качествено подаване, което Мишаел засече с глава за 1:1. В предпоследната от редовните 90 минути Локомотив Пловдив поведе с 2:1. Джовани реализира много технично дузпа, отсъдена за нарушение на Цветомир Панов срещу Димитър Илиев. Наказателният удар бе преразгледан и от системата ВАР. FT / Локомотив Пловдив - Черно море 2:1 1:0 Димитър Илиев 52` 1:1 Мишаел Алвес 76` 2:1 Джовани 89` (д) Локомотив Пловдив: 23 Динко Хоркаш, 99 Джовани Трупе, 4 Мартин Паскалев, 91 Хорхе Сегура, 50 Йосип Томашевич, 15 Пиер Зебли, 6 Христо Иванов, 33 Георги Каракашев, 14 Димитър Илиев, 7 Бабакар Дион, 10 Джовани Старши треньор: Александър Томаш Черно море: 22 Георги Георгиев, 3 Живко Атанасов, 4 Росен Стефанов, 6 Виктор Попов, 2 Цветомир Панов, 10 Велислав Василев, 23 Едгар Пашеко, 77 Стефан Велев, 35 Арлинд Дакай, 8 Мазир Сула, 86 Исмаил Иса Старши треньор: Илиан Илиев","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"ФА Къп: Преди кръга (02.06.2023)","link":"https://gong.bg/football-sviat/anglia/multimedia/video/fa-kyp-predi-kryga-02.06.2023-738219","keywords":["no"],"creator":null,"video_url":null,"description":"Този уикенд се отбелязва 100-годишнината на финалите за ФА Къп на \"Уембли\" с един епохален мач - Манчестър Юнайтед срещу Манчестър Сити. Червената и синята половина на Манчестър никога не са срещали на финал и това поражда още по-голям интерес. Предаването тази седмица е посветено на финала - Сити сре...","content":"Този уикенд се отбелязва 100-годишнината на финалите за ФА Къп на \"Уембли\" с един епохален мач - Манчестър Юнайтед срещу Манчестър Сити. Червената и синята половина на Манчестър никога не са срещали на финал и това поражда още по-голям интерес. Предаването тази седмица е посветено на финала - Сити срещу Юнайтед. \"Гражданите\" преследват втори трофей по пътя към мечтания требъл този сезон. \"Червените дяволи\" пък излизат за първа купа от 2016 година. Кои играчи обаче могат да направят разликата в мача? Вижте всичко преди утрешния финал за ФА Къп във видеото","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Еуфорията сред феновете на Наполи след спечелената титла","link":"https://gong.bg/football-sviat/italia/multimedia/video/euforiiata-sred-fenovete-na-napoli-sled-spechelenata-titla-738217","keywords":["no"],"creator":null,"video_url":null,"description":"Нова вълна от еуфория заля Неапол преди последния мач на Наполи за сезона, след който шампионската купа ще бъде връчена на отбора. В неделя тимът на Лучано Спалети приема Сампдория, а заявките за билети са близо 100 000. Трибуните на стадион \"Диего Марадона\" обаче разполагат само с 55 хиляди места. Какво к...","content":"Нова вълна от еуфория заля Неапол преди последния мач на Наполи за сезона, след който шампионската купа ще бъде връчена на отбора. В неделя тимът на Лучано Спалети приема Сампдория, а заявките за билети са близо 100 000. Трибуните на стадион \"Диего Марадона\" обаче разполагат само с 55 хиляди места. Какво казаха феновете на Наполи пред пратеника на NOVA в Неапол - Ивайло Пампулов - вижте във видеото","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/","link":"https://gong.bg/bg-football/multimedia/video/lokomotiv-plovdiv-cherno-more-00-pyrvo-poluvreme-738218","keywords":["no"],"creator":null,"video_url":null,"description":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/....","content":"Локомотив Пловдив - Черно море 0:0 /първо полувреме/.","pubDate":"2023-06-02 18:18:23","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"}]}