{"newsArray":[{"article_id":"09d5b8f73ab0d228cd0ef896221ce932","title":"Soccerladuma | Rashford's Brother & Agent Arrested","link":"https://www.snl24.com/soccerladuma/international/manchester-united/rashfords-brother-agent-arrested-20231109","keywords":null,"creator":null,"video_url":null,"description":"Manchester United star Marcus Rashford's brother and agent has reportedly been arrested for an alleged crime he committed while in the United States of America last month.","content":"Manchester United star Marcus Rashford's brother and agent has reportedly been arrested for an alleged crime he committed while in the United States of America last month. As first reported by , Rashford's brother Dane was arrested in Miami, Florida, on charges relating to domestic abuse back on 20 October. The charge was first registered as misdemeanour battery four days after his arrest, but has since been upgraded to a domestic violence case, with it believed he punched his girlfriend in the face after taking her phone to look at her text messages. According to Miami-Dade County police records, Dane's bond of $1,500 (R27 600) was paid by his sister Chantelle Maynard a week after his arrest. While the player representative is now out of jail, he is due to appear in court, with a hearing believed to be set for 27 November. Dane is the head of DN May Sports Management, of which younger brother Marcus is a client, although it is said his other sibling, Dwaine, directly manages the footballer. The news broke minutes before the Red Devils' took on Danish giants FC Copenhagen in the UEFA Champions League on Wednesday night, in which United's No. 10 was sent off in the first half. Despite Dane having to return to the US for his hearing later this month, it remains unclear if the Englishman has stayed in the country. \"The case is still active, at the moment I haven't been able to get hold of the victim,\" Daysi Vega-Mendez, the assistant state prosecutor for Miami Dade County, said. \"Our office is trying to get hold of the UK Embassy because we need permission to speak to the victim. \"I am not sure whether they are still in the United States or if they have left the country. I understand they were on vacation. \"Technically once you are charged, you are not supposed to leave the country. When a person is given a bond if they leave, they surrender that bond.” You must be to read and post comments.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/9534/2f28008f9c6849eb8151576f5188085c.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"ea9fa5e9b3c4e2cd6304e241c7a05816","title":"Soccerladuma | Johnson Opens Up On Possible Permanent Chiefs Stay","link":"https://www.snl24.com/soccerladuma/local/premiership/kaizer-chiefs/johnson-opens-up-on-possible-permanent-chiefs-stay-20231109","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs' interim coach Cavin Johnson has opened up on the possibility of taking over the club's head coaching role on a permanent basis.","content":"Kaizer Chiefs' interim coach Cavin Johnson has opened up on the possibility of taking over the club's head coaching role on a permanent basis. After a slow start in what was his first match against Golden Arrows, Johnson and his Chiefs side managed to bag their first win since he was instated following a 3-2 win over struggling Cape Town Spurs in front of an empty FNB Stadium on Wednesday. Johnson had 10 days in which he could fine-tune his preparations and the differences, although small, were there to see. For periods of the match, Chiefs played some scintillating football, particularly in the first half where they dominated and scored two goals. Johnson has emphasized on returning to the Chiefs way and if his second match is anything to go by, then he is on the right track. Naturally, talk of the 64-year-old taking over the reins on a permanent basis has surfaced and now the coach has opened up on whether he would like to make his interim appointment a permanent one. “It’s something that appeals to me. But there’s something bigger that appeals to me. I’ve been to some of the biggest teams in the world and I worked with one of the biggest teams in the world and when I say this team has got that potential. I think you need to bring from a bigger team and put it in this team but not as a head coach. A head coach will be changed in any club. This team is not where its supposed to be and maybe with the little knowledge that I have, I think this team can be as big as it should be,” he told journalists. “There’s a cloth for me that needs to be shown to the rest of the world and I think this team has got it. So whether I’m the head coach or the interim coach, I’ve come to this team because there is something that nobody else has,” he continued. Johnson's next test will undoubtedly be his biggest as his side take on Orlando Pirates in a Soweto Derby on Saturday.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/7083/e74085ab7993482ebecfc7d11e521071.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"3f6d6beeb3bf75c7b9a2449d8615f0aa","title":"Soccerladuma | Two PSL Clubs Chasing Argentinian Striker?","link":"https://www.snl24.com/soccerladuma/local/siyagobhoza/claudio-spinelli-two-psl-clubs-chasing-argentinian-striker-20231109","keywords":null,"creator":null,"video_url":null,"description":"South African clubs in the Premiership are interested in an Argentine striker who has professional football experience in South America and Europe, the Siya crew understands.","content":"You must be to read and post comments.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/9536/3015ebb18a8e47208aa215a316f648ea.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"c924a174235f475734a6b8d76b62fc95","title":"Soccerladuma | Real Madrid 'Make' Massive Decision On Mbappe Transfer","link":"https://www.snl24.com/soccerladuma/international/messi-ronaldo-neymar-mbappe-watch/real-madrid-make-massive-decision-on-mbappe-transfer-20231109","keywords":null,"creator":null,"video_url":null,"description":"Real Madrid have reportedly come to a massive decision regarding their pursuit of French superstar Kylian Mbappe.","content":"Real Madrid have reportedly come to a massive decision regarding their pursuit of French superstar Kylian Mbappe. Another captivating chapter has been added to the story involving Los Blancos and the Bondy native. The Spanish giants' interest in the forward is well documented, dating all the way to his days as an AS Monaco prodigy, and after he moved to Paris Saint-Germain in 2017, the links have only intensified. According to though, Los Merengues' have now ruled out signing the soon-to-be free agent. The 24-year-old is in the final months of his current PSG deal, and from January 2024, will be able to sign for any club he wishes, but Real are said to have called time on their pursuit of the 2018 FIFA World Cup winner and are believed to have done this for three reasons. The first is because he would upset the wage structure of the club if he were to arrive, especially seeing as he would command exorbitant wages as a free agent. The second reason is that his signing would go against the club's recent transfer policy of signing young stars. Vinicius Junior, Rodrygo, Eduardo Camavinga, Jude Bellingham, Endrick and Arda Guler are footballers who were signed just as they were about to turn 20. The third reason is because the club, and its fans, remember how the forward rejected them in 2022 when he was in a similar situation. According to however, all the news that has emerged from Spain is to preserve Real's public image in case the attacker decides against signing with the record European champions once again. The French media outlet did maintain that some of the chiefs at Valdebebas are open to abandoning the move for Mbappe, but club president Florentino Perez is believed to still be very much interested in luring the prolific attacker to his club. You must be to read and post comments.","pubDate":"2023-11-09 08:22:31","image_url":"https://cdn.24.co.za/files/Cms/General/d/9286/931c53e7de7341e391fca825749dfc4e.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"9f338bca5c8f53015cd2b74cfd27ba0d","title":"Michael Schumacher health condition must be kept private, says close F1 pal","link":"https://www.dailystar.co.uk/sport/f1/michael-schumacher-condition-private-pal-31396935","keywords":["Sport"],"creator":null,"video_url":null,"description":"Details surrounding Michael Schumacher's health condition have been kept from the public since his horrific skiing accident in 2013, and a friend of the family says it needs to stay that way","content":"A friend of says the legend's health condition must always remain private. The seven-time world champion hasn't been seen in public since he suffered catastrophic injuries in a skiing accident in 2013. Little is known is about his condition, and friend of the family Timo Glock, who is himself a former F1 driver, insists it needs to stay that way. Speaking to , Glock says he's in touch with Mick Schumacher, but refuses to ask the 24-year-old about his father's health out of respect. He said: \"I keep in contact with Mick Schumacher as he and I get along well. \"I've also known other members of his family for a very long time, but I try not to impose on their privacy. I respect their right to be private, and I don't discuss Michael's condition with them.'' Glock claimed Schumacher was a very private person on race day, but away from the sport he was different animal. \"I spent a lot of time off-track with Michael, and it didn't matter what we did,\" the 41-year-old said. \"He was very open, super friendly, and a really nice guy. People thought he wasn't!'' Glock began his F1 career in 2004, driving for now defunct constructors Jordan Ford before later joining Toyota. In 2008 and 2009 he achieved back-to-back 10th-place finishes in the Drivers' Championship - a career best. He then competed for Virgin Racing before leaving the circuit in 2012. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Schumacher, meanwhile, won seven Drivers' Championships; in 1994, 1995, 2000, 2001, 2002, 2003 and 2004. He spent the bulk of his illustrious career with Ferrari, winning five world titles with the Italian constructors. He retired in 2012, a year before his skiing accident.","pubDate":"2023-11-09 07:52:11","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31397049.ece/ALTERNATES/s98/1_F1-Grand-Prix-of-China-Race.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dca993bf2bc1bfc68415ef5971a1a74a","title":"‘Could have chosen better words’: May walks back Pies comments after ‘crazy backlash’","link":"https://www.foxsports.com.au/afl/teams/melbourne-demons/afl-2023-steven-may-backflips-on-collingwood-criticism-from-best-and-fairest-speech-melbourne-demons-culture-latest-news/news-story/d99945eca61f99b6dab263bd65a95281","keywords":null,"creator":null,"video_url":null,"description":"Star Melbourne defender Steven May has conceded he “probably could have chosen better words” after throwing shade at Collingwood at last month’s best and fairest, but says he was surprised by the backlash over his comments.","content":"Star Melbourne defender Steven May has conceded he “probably could have chosen better words” after throwing shade at Collingwood at last month’s best and fairest, but says he was surprised by the backlash over his comments. A candid May said at the event the Demons “should have smoked” the Magpies in the clubs’ qualifying final and that Melbourne was “so much better” than the eventual premiers. May’s comments sparked criticism from the football world amid questions of Melbourne’s culture as part of a tumultuous off-season for the club after consecutive straight-sets finals exits. Watch every match of The ICC Men’s Cricket World Cup Live with no ad breaks in play on Kayo Sports. Join Kayo now and start streaming instantly > Grand Final AFL Sep 30 2:30pm AEST FT Collingwood 90 Brisbane 86 MATCH CENTRE *Odds are current as of 9th November 2023, 6:49pm AEST VIEW ALL SCORES Grundy opens up on Demons departure | 01:14 Speaking at Oaks Day at Flemington Racecourse on Thursday, May admitted his remarks might’ve gone too far despite claiming he was simply speaking honestly at an intimate club event. “You want to have that belief and I’m a bit like that,” he told Channel 7. “I wasn’t having an interview at the time with all you guys, I was speaking to our Melbourne members and my teammates. “Probably could have chosen some better words, but the backlash was pretty crazy considering those guys all got a medal around their neck and are loving life and I’m in Japan after going out in straight sets.” Also speaking at Oaks Day, Melbourne skipper Max Gawn admitted the club needed to take a look in the mirror and “have some conversations” after an eventful few months. It’s included Joel Smith receiving a provisional suspension for testing positive to cocaine in season and concerns around Clayton Oliver’s behaviour after the star midfielder was admitted to hospital for a head injury caused by a seizure. Gawn was hopeful the Demons could bounce back and even grow from the trying circumstances. ﻿“I feel like with adversity hopefully we can get through stuff like this,” Gawn told Channel 7. “Obviously I agree we got to have some conversations. Our culture in a way has been relatively successful in the last three or four years, but there is bits that’s happened. “We need to have a conversation, we need to talk about it and make sure we can all get on the straight and narrow, and hopefully with this adversity comes a fair bit of greatness.”","pubDate":"2023-11-09 07:43:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"a0ac29665bb67f133a48699fb9f0f20f","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.northwaleschronicle.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2b8ebfe93c07786f42b35ff5a2607a36","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.northwalespioneer.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.northwalespioneer.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"971ee4e7cb0ee06ee23cb5d87c105ac1","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.southwalesguardian.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"What the papers say Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. Social media round-up ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) Players to watch : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.southwalesguardian.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"78a03e8420b4b6adf1080c5ee322953a","title":"Papers: Chelsea transfer chief faces questions after Hayes departure","link":"https://www.skysports.com/football/news/20876/13003798/paul-winstanley-facing-questions-from-chelsea-bosses-after-emma-hayes-shock-departure-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Thursday's newspapers...","content":"All the top stories and transfer rumours from Thursday's newspapers... DAILY MAIL Chelsea sporting director Paul Winstanley is facing questions from the club's owners following Emma Hayes' shock announcement that she is leaving at the end of the season, after he 'dithered' over offering her a new contract. Jos Buttler insisted that he intends to lead England in their white-ball fixtures against West Indies in the Caribbean next month, despite their dismal showing at the Cricket World Cup. Premier League shareholders will vote on a temporary ban involving incoming loan signings between clubs with the same owners later this month, meaning Newcastle would not be able to arrange deals for players - like Al Hilal midfielder Ruben Neves - in Saudi Arabia. Nuno Espirito Santo and Karim Benzema were caught up in a serious argument on Monday ahead of the former Tottenham boss' sacking from Al Ittihad, with the details of their argument now leaked by a Saudi Arabian outlet. Arsenal and referee chiefs remain at loggerheads with the Premier League club set to cite decisions that have gone against them since last season in their next meeting in a bid to prove a pattern. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Eberechi Eze is close to signing a new contract with Crystal Palace after reaching an agreement in principle with the club over fresh terms. Real Madrid will reportedly prioritise a move for Jamal Musiala if they are unable to secure the signing of long-term target Kylian Mbappe. DAILY MIRROR Jose Mourinho has emerged as a candidate to be the permanent Al Ittihad manager - and the Roma boss has already claimed Cristiano Ronaldo has helped persuade him to one day move to Saudi Arabia. Marcel Brands has confirmed Everton were interested in signing now-Liverpool winger Luis Diaz back in 2021, but Rafael Benitez prevented the club from completing a deal. Jack Grealish has admitted he is at risk of losing his place in Manchester City's team if he does not start scoring more goals. Cricket is set to introduce a type of 'shot-clock' to the game in a bid to speed up play and avoid a similar 'timed out' fiasco that occurred during the Sri Lanka vs Bangladesh clash. Francis Cummins is back in rugby league after the ex-Great Britain international was appointed Hull FC's head of emerging talent. Damon Hill believes Mercedes' aerodynamics department will struggle to close the gap on Formula 1's dominant team Red Bull. Tiger Woods has revealed he will be returning to golf in January as part of his new endeavour with Rory McIlroy when they launch The Golf League. Gareth Southgate will not accept any sick notes for England's final Euro qualifiers. DAILY EXPRESS Erik ten Hag could miss out on his transfer priority if Sir Jim Ratcliffe isn't quick in overseeing his planned appointments in Manchester United's sporting department. United are preparing to be active in the January transfer window but will face limitations, especially if Sir Jim doesn't make an early statement, according to reports. Please use Chrome browser for a more accessible video player Khephren Thuram has admitted that he was 'happy' to be linked with top clubs during the summer. Liverpool were among those reportedly interested in the OGC Nice midfielder, whose superb start to the campaign will once again leave him in high demand when the transfer window reopens in January. Arsenal boss Mikel Arteta may already have the long-term answer to his striker problems. The Gunners are linked with signing a new frontman but loan star Mika Biereth, who has scored four in five in the Scottish Premiership this season is proving that he could have a big future ahead of him. THE TIMES Eoin Morgan has described England as a \"sinking ship\" and accused the senior players, captain and coach of shirking responsibility by sending out assistant coach Carl Hopkinson to face the media before the Netherlands match. Clubs relegated from the Premier League will be able to spend a higher proportion of their income on player wages than their Sky Bet Championship rivals under the terms of a proposed financial settlement. Plans for a rugby Club World Cup have been pushed back and are unlikely to come to fruition until 2028 at the earliest. Eddie Jones has said that he would \"definitely be interested\" in a second stint as the Japan head coach having resigned from his post in charge of Australia after a disastrous World Cup. US Open organisers have doubled down on the controversial decision not to host a wheelchair event next year and will instead offer players financial grants to cover lost earnings of more than £1 million. THE SUN World Cup-style VAR is set to arrive in the Premier League next season. Club bosses voted against semi-automated offside technology and its \"limb-tracking\" cameras last summer, despite it being installed by top-flight clubs in UEFA competitions. Cristiano Ronaldo's ex-Portugal boss Fernando Santos has explained his dramatic feud with the legend he still regards as \"like a son to me\". Real Madrid have sensationally ruled out a swoop for Kylian Mbappe, according to reports. Madrid's stance is set to put Premier League teams on red alert. DAILY TELEGRAPH John McGinn has revealed that his goal celebration is a gesture of support for his young nephew Jack, who is forced to wear eye protectors when he plays football. DAILY STAR Anthony Joshua revealed he's not friendly with Tyson Fury during a sit-down with Louis Theroux. DAILY RECORD The Tartan Army face a mad scramble for Euro 2024 tickets as UEFA is reportedly set to cap the allocation for the SFA and other national associations to just 9,500 tickets per game. Motherwell have slammed fans for their pyro display against St Johnstone at McDiarmid Park. Rangers are investigating two major options with Ibrox that could dwarf neighbours Celtic. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 8pm Tuesday.","pubDate":"2023-11-09 07:30:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"09d5b8f73ab0d228cd0ef896221ce932","title":"Soccerladuma | Rashford's Brother & Agent Arrested","link":"https://www.snl24.com/soccerladuma/international/manchester-united/rashfords-brother-agent-arrested-20231109","keywords":null,"creator":null,"video_url":null,"description":"Manchester United star Marcus Rashford's brother and agent has reportedly been arrested for an alleged crime he committed while in the United States of America last month.","content":"Manchester United star Marcus Rashford's brother and agent has reportedly been arrested for an alleged crime he committed while in the United States of America last month. As first reported by , Rashford's brother Dane was arrested in Miami, Florida, on charges relating to domestic abuse back on 20 October. The charge was first registered as misdemeanour battery four days after his arrest, but has since been upgraded to a domestic violence case, with it believed he punched his girlfriend in the face after taking her phone to look at her text messages. According to Miami-Dade County police records, Dane's bond of $1,500 (R27 600) was paid by his sister Chantelle Maynard a week after his arrest. While the player representative is now out of jail, he is due to appear in court, with a hearing believed to be set for 27 November. Dane is the head of DN May Sports Management, of which younger brother Marcus is a client, although it is said his other sibling, Dwaine, directly manages the footballer. The news broke minutes before the Red Devils' took on Danish giants FC Copenhagen in the UEFA Champions League on Wednesday night, in which United's No. 10 was sent off in the first half. Despite Dane having to return to the US for his hearing later this month, it remains unclear if the Englishman has stayed in the country. \"The case is still active, at the moment I haven't been able to get hold of the victim,\" Daysi Vega-Mendez, the assistant state prosecutor for Miami Dade County, said. \"Our office is trying to get hold of the UK Embassy because we need permission to speak to the victim. \"I am not sure whether they are still in the United States or if they have left the country. I understand they were on vacation. \"Technically once you are charged, you are not supposed to leave the country. When a person is given a bond if they leave, they surrender that bond.” You must be to read and post comments.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/9534/2f28008f9c6849eb8151576f5188085c.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"ea9fa5e9b3c4e2cd6304e241c7a05816","title":"Soccerladuma | Johnson Opens Up On Possible Permanent Chiefs Stay","link":"https://www.snl24.com/soccerladuma/local/premiership/kaizer-chiefs/johnson-opens-up-on-possible-permanent-chiefs-stay-20231109","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs' interim coach Cavin Johnson has opened up on the possibility of taking over the club's head coaching role on a permanent basis.","content":"Kaizer Chiefs' interim coach Cavin Johnson has opened up on the possibility of taking over the club's head coaching role on a permanent basis. After a slow start in what was his first match against Golden Arrows, Johnson and his Chiefs side managed to bag their first win since he was instated following a 3-2 win over struggling Cape Town Spurs in front of an empty FNB Stadium on Wednesday. Johnson had 10 days in which he could fine-tune his preparations and the differences, although small, were there to see. For periods of the match, Chiefs played some scintillating football, particularly in the first half where they dominated and scored two goals. Johnson has emphasized on returning to the Chiefs way and if his second match is anything to go by, then he is on the right track. Naturally, talk of the 64-year-old taking over the reins on a permanent basis has surfaced and now the coach has opened up on whether he would like to make his interim appointment a permanent one. “It’s something that appeals to me. But there’s something bigger that appeals to me. I’ve been to some of the biggest teams in the world and I worked with one of the biggest teams in the world and when I say this team has got that potential. I think you need to bring from a bigger team and put it in this team but not as a head coach. A head coach will be changed in any club. This team is not where its supposed to be and maybe with the little knowledge that I have, I think this team can be as big as it should be,” he told journalists. “There’s a cloth for me that needs to be shown to the rest of the world and I think this team has got it. So whether I’m the head coach or the interim coach, I’ve come to this team because there is something that nobody else has,” he continued. Johnson's next test will undoubtedly be his biggest as his side take on Orlando Pirates in a Soweto Derby on Saturday.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/7083/e74085ab7993482ebecfc7d11e521071.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"3f6d6beeb3bf75c7b9a2449d8615f0aa","title":"Soccerladuma | Two PSL Clubs Chasing Argentinian Striker?","link":"https://www.snl24.com/soccerladuma/local/siyagobhoza/claudio-spinelli-two-psl-clubs-chasing-argentinian-striker-20231109","keywords":null,"creator":null,"video_url":null,"description":"South African clubs in the Premiership are interested in an Argentine striker who has professional football experience in South America and Europe, the Siya crew understands.","content":"You must be to read and post comments.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/9536/3015ebb18a8e47208aa215a316f648ea.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"c924a174235f475734a6b8d76b62fc95","title":"Soccerladuma | Real Madrid 'Make' Massive Decision On Mbappe Transfer","link":"https://www.snl24.com/soccerladuma/international/messi-ronaldo-neymar-mbappe-watch/real-madrid-make-massive-decision-on-mbappe-transfer-20231109","keywords":null,"creator":null,"video_url":null,"description":"Real Madrid have reportedly come to a massive decision regarding their pursuit of French superstar Kylian Mbappe.","content":"Real Madrid have reportedly come to a massive decision regarding their pursuit of French superstar Kylian Mbappe. Another captivating chapter has been added to the story involving Los Blancos and the Bondy native. The Spanish giants' interest in the forward is well documented, dating all the way to his days as an AS Monaco prodigy, and after he moved to Paris Saint-Germain in 2017, the links have only intensified. According to though, Los Merengues' have now ruled out signing the soon-to-be free agent. The 24-year-old is in the final months of his current PSG deal, and from January 2024, will be able to sign for any club he wishes, but Real are said to have called time on their pursuit of the 2018 FIFA World Cup winner and are believed to have done this for three reasons. The first is because he would upset the wage structure of the club if he were to arrive, especially seeing as he would command exorbitant wages as a free agent. The second reason is that his signing would go against the club's recent transfer policy of signing young stars. Vinicius Junior, Rodrygo, Eduardo Camavinga, Jude Bellingham, Endrick and Arda Guler are footballers who were signed just as they were about to turn 20. The third reason is because the club, and its fans, remember how the forward rejected them in 2022 when he was in a similar situation. According to however, all the news that has emerged from Spain is to preserve Real's public image in case the attacker decides against signing with the record European champions once again. The French media outlet did maintain that some of the chiefs at Valdebebas are open to abandoning the move for Mbappe, but club president Florentino Perez is believed to still be very much interested in luring the prolific attacker to his club. You must be to read and post comments.","pubDate":"2023-11-09 08:22:31","image_url":"https://cdn.24.co.za/files/Cms/General/d/9286/931c53e7de7341e391fca825749dfc4e.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"9f338bca5c8f53015cd2b74cfd27ba0d","title":"Michael Schumacher health condition must be kept private, says close F1 pal","link":"https://www.dailystar.co.uk/sport/f1/michael-schumacher-condition-private-pal-31396935","keywords":["Sport"],"creator":null,"video_url":null,"description":"Details surrounding Michael Schumacher's health condition have been kept from the public since his horrific skiing accident in 2013, and a friend of the family says it needs to stay that way","content":"A friend of says the legend's health condition must always remain private. The seven-time world champion hasn't been seen in public since he suffered catastrophic injuries in a skiing accident in 2013. Little is known is about his condition, and friend of the family Timo Glock, who is himself a former F1 driver, insists it needs to stay that way. Speaking to , Glock says he's in touch with Mick Schumacher, but refuses to ask the 24-year-old about his father's health out of respect. He said: \"I keep in contact with Mick Schumacher as he and I get along well. \"I've also known other members of his family for a very long time, but I try not to impose on their privacy. I respect their right to be private, and I don't discuss Michael's condition with them.'' Glock claimed Schumacher was a very private person on race day, but away from the sport he was different animal. \"I spent a lot of time off-track with Michael, and it didn't matter what we did,\" the 41-year-old said. \"He was very open, super friendly, and a really nice guy. People thought he wasn't!'' Glock began his F1 career in 2004, driving for now defunct constructors Jordan Ford before later joining Toyota. In 2008 and 2009 he achieved back-to-back 10th-place finishes in the Drivers' Championship - a career best. He then competed for Virgin Racing before leaving the circuit in 2012. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Schumacher, meanwhile, won seven Drivers' Championships; in 1994, 1995, 2000, 2001, 2002, 2003 and 2004. He spent the bulk of his illustrious career with Ferrari, winning five world titles with the Italian constructors. He retired in 2012, a year before his skiing accident.","pubDate":"2023-11-09 07:52:11","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31397049.ece/ALTERNATES/s98/1_F1-Grand-Prix-of-China-Race.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dca993bf2bc1bfc68415ef5971a1a74a","title":"‘Could have chosen better words’: May walks back Pies comments after ‘crazy backlash’","link":"https://www.foxsports.com.au/afl/teams/melbourne-demons/afl-2023-steven-may-backflips-on-collingwood-criticism-from-best-and-fairest-speech-melbourne-demons-culture-latest-news/news-story/d99945eca61f99b6dab263bd65a95281","keywords":null,"creator":null,"video_url":null,"description":"Star Melbourne defender Steven May has conceded he “probably could have chosen better words” after throwing shade at Collingwood at last month’s best and fairest, but says he was surprised by the backlash over his comments.","content":"Star Melbourne defender Steven May has conceded he “probably could have chosen better words” after throwing shade at Collingwood at last month’s best and fairest, but says he was surprised by the backlash over his comments. A candid May said at the event the Demons “should have smoked” the Magpies in the clubs’ qualifying final and that Melbourne was “so much better” than the eventual premiers. May’s comments sparked criticism from the football world amid questions of Melbourne’s culture as part of a tumultuous off-season for the club after consecutive straight-sets finals exits. Watch every match of The ICC Men’s Cricket World Cup Live with no ad breaks in play on Kayo Sports. Join Kayo now and start streaming instantly > Grand Final AFL Sep 30 2:30pm AEST FT Collingwood 90 Brisbane 86 MATCH CENTRE *Odds are current as of 9th November 2023, 6:49pm AEST VIEW ALL SCORES Grundy opens up on Demons departure | 01:14 Speaking at Oaks Day at Flemington Racecourse on Thursday, May admitted his remarks might’ve gone too far despite claiming he was simply speaking honestly at an intimate club event. “You want to have that belief and I’m a bit like that,” he told Channel 7. “I wasn’t having an interview at the time with all you guys, I was speaking to our Melbourne members and my teammates. “Probably could have chosen some better words, but the backlash was pretty crazy considering those guys all got a medal around their neck and are loving life and I’m in Japan after going out in straight sets.” Also speaking at Oaks Day, Melbourne skipper Max Gawn admitted the club needed to take a look in the mirror and “have some conversations” after an eventful few months. It’s included Joel Smith receiving a provisional suspension for testing positive to cocaine in season and concerns around Clayton Oliver’s behaviour after the star midfielder was admitted to hospital for a head injury caused by a seizure. Gawn was hopeful the Demons could bounce back and even grow from the trying circumstances. ﻿“I feel like with adversity hopefully we can get through stuff like this,” Gawn told Channel 7. “Obviously I agree we got to have some conversations. Our culture in a way has been relatively successful in the last three or four years, but there is bits that’s happened. “We need to have a conversation, we need to talk about it and make sure we can all get on the straight and narrow, and hopefully with this adversity comes a fair bit of greatness.”","pubDate":"2023-11-09 07:43:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"a0ac29665bb67f133a48699fb9f0f20f","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.northwaleschronicle.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2b8ebfe93c07786f42b35ff5a2607a36","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.northwalespioneer.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.northwalespioneer.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"971ee4e7cb0ee06ee23cb5d87c105ac1","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.southwalesguardian.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"What the papers say Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. Social media round-up ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) Players to watch : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.southwalesguardian.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"78a03e8420b4b6adf1080c5ee322953a","title":"Papers: Chelsea transfer chief faces questions after Hayes departure","link":"https://www.skysports.com/football/news/20876/13003798/paul-winstanley-facing-questions-from-chelsea-bosses-after-emma-hayes-shock-departure-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Thursday's newspapers...","content":"All the top stories and transfer rumours from Thursday's newspapers... DAILY MAIL Chelsea sporting director Paul Winstanley is facing questions from the club's owners following Emma Hayes' shock announcement that she is leaving at the end of the season, after he 'dithered' over offering her a new contract. Jos Buttler insisted that he intends to lead England in their white-ball fixtures against West Indies in the Caribbean next month, despite their dismal showing at the Cricket World Cup. Premier League shareholders will vote on a temporary ban involving incoming loan signings between clubs with the same owners later this month, meaning Newcastle would not be able to arrange deals for players - like Al Hilal midfielder Ruben Neves - in Saudi Arabia. Nuno Espirito Santo and Karim Benzema were caught up in a serious argument on Monday ahead of the former Tottenham boss' sacking from Al Ittihad, with the details of their argument now leaked by a Saudi Arabian outlet. Arsenal and referee chiefs remain at loggerheads with the Premier League club set to cite decisions that have gone against them since last season in their next meeting in a bid to prove a pattern. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Eberechi Eze is close to signing a new contract with Crystal Palace after reaching an agreement in principle with the club over fresh terms. Real Madrid will reportedly prioritise a move for Jamal Musiala if they are unable to secure the signing of long-term target Kylian Mbappe. DAILY MIRROR Jose Mourinho has emerged as a candidate to be the permanent Al Ittihad manager - and the Roma boss has already claimed Cristiano Ronaldo has helped persuade him to one day move to Saudi Arabia. Marcel Brands has confirmed Everton were interested in signing now-Liverpool winger Luis Diaz back in 2021, but Rafael Benitez prevented the club from completing a deal. Jack Grealish has admitted he is at risk of losing his place in Manchester City's team if he does not start scoring more goals. Cricket is set to introduce a type of 'shot-clock' to the game in a bid to speed up play and avoid a similar 'timed out' fiasco that occurred during the Sri Lanka vs Bangladesh clash. Francis Cummins is back in rugby league after the ex-Great Britain international was appointed Hull FC's head of emerging talent. Damon Hill believes Mercedes' aerodynamics department will struggle to close the gap on Formula 1's dominant team Red Bull. Tiger Woods has revealed he will be returning to golf in January as part of his new endeavour with Rory McIlroy when they launch The Golf League. Gareth Southgate will not accept any sick notes for England's final Euro qualifiers. DAILY EXPRESS Erik ten Hag could miss out on his transfer priority if Sir Jim Ratcliffe isn't quick in overseeing his planned appointments in Manchester United's sporting department. United are preparing to be active in the January transfer window but will face limitations, especially if Sir Jim doesn't make an early statement, according to reports. Please use Chrome browser for a more accessible video player Khephren Thuram has admitted that he was 'happy' to be linked with top clubs during the summer. Liverpool were among those reportedly interested in the OGC Nice midfielder, whose superb start to the campaign will once again leave him in high demand when the transfer window reopens in January. Arsenal boss Mikel Arteta may already have the long-term answer to his striker problems. The Gunners are linked with signing a new frontman but loan star Mika Biereth, who has scored four in five in the Scottish Premiership this season is proving that he could have a big future ahead of him. THE TIMES Eoin Morgan has described England as a \"sinking ship\" and accused the senior players, captain and coach of shirking responsibility by sending out assistant coach Carl Hopkinson to face the media before the Netherlands match. Clubs relegated from the Premier League will be able to spend a higher proportion of their income on player wages than their Sky Bet Championship rivals under the terms of a proposed financial settlement. Plans for a rugby Club World Cup have been pushed back and are unlikely to come to fruition until 2028 at the earliest. Eddie Jones has said that he would \"definitely be interested\" in a second stint as the Japan head coach having resigned from his post in charge of Australia after a disastrous World Cup. US Open organisers have doubled down on the controversial decision not to host a wheelchair event next year and will instead offer players financial grants to cover lost earnings of more than £1 million. THE SUN World Cup-style VAR is set to arrive in the Premier League next season. Club bosses voted against semi-automated offside technology and its \"limb-tracking\" cameras last summer, despite it being installed by top-flight clubs in UEFA competitions. Cristiano Ronaldo's ex-Portugal boss Fernando Santos has explained his dramatic feud with the legend he still regards as \"like a son to me\". Real Madrid have sensationally ruled out a swoop for Kylian Mbappe, according to reports. Madrid's stance is set to put Premier League teams on red alert. DAILY TELEGRAPH John McGinn has revealed that his goal celebration is a gesture of support for his young nephew Jack, who is forced to wear eye protectors when he plays football. DAILY STAR Anthony Joshua revealed he's not friendly with Tyson Fury during a sit-down with Louis Theroux. DAILY RECORD The Tartan Army face a mad scramble for Euro 2024 tickets as UEFA is reportedly set to cap the allocation for the SFA and other national associations to just 9,500 tickets per game. Motherwell have slammed fans for their pyro display against St Johnstone at McDiarmid Park. Rangers are investigating two major options with Ibrox that could dwarf neighbours Celtic. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 8pm Tuesday.","pubDate":"2023-11-09 07:30:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"09d5b8f73ab0d228cd0ef896221ce932","title":"Soccerladuma | Rashford's Brother & Agent Arrested","link":"https://www.snl24.com/soccerladuma/international/manchester-united/rashfords-brother-agent-arrested-20231109","keywords":null,"creator":null,"video_url":null,"description":"Manchester United star Marcus Rashford's brother and agent has reportedly been arrested for an alleged crime he committed while in the United States of America last month.","content":"Manchester United star Marcus Rashford's brother and agent has reportedly been arrested for an alleged crime he committed while in the United States of America last month. As first reported by , Rashford's brother Dane was arrested in Miami, Florida, on charges relating to domestic abuse back on 20 October. The charge was first registered as misdemeanour battery four days after his arrest, but has since been upgraded to a domestic violence case, with it believed he punched his girlfriend in the face after taking her phone to look at her text messages. According to Miami-Dade County police records, Dane's bond of $1,500 (R27 600) was paid by his sister Chantelle Maynard a week after his arrest. While the player representative is now out of jail, he is due to appear in court, with a hearing believed to be set for 27 November. Dane is the head of DN May Sports Management, of which younger brother Marcus is a client, although it is said his other sibling, Dwaine, directly manages the footballer. The news broke minutes before the Red Devils' took on Danish giants FC Copenhagen in the UEFA Champions League on Wednesday night, in which United's No. 10 was sent off in the first half. Despite Dane having to return to the US for his hearing later this month, it remains unclear if the Englishman has stayed in the country. \"The case is still active, at the moment I haven't been able to get hold of the victim,\" Daysi Vega-Mendez, the assistant state prosecutor for Miami Dade County, said. \"Our office is trying to get hold of the UK Embassy because we need permission to speak to the victim. \"I am not sure whether they are still in the United States or if they have left the country. I understand they were on vacation. \"Technically once you are charged, you are not supposed to leave the country. When a person is given a bond if they leave, they surrender that bond.” You must be to read and post comments.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/9534/2f28008f9c6849eb8151576f5188085c.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"ea9fa5e9b3c4e2cd6304e241c7a05816","title":"Soccerladuma | Johnson Opens Up On Possible Permanent Chiefs Stay","link":"https://www.snl24.com/soccerladuma/local/premiership/kaizer-chiefs/johnson-opens-up-on-possible-permanent-chiefs-stay-20231109","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs' interim coach Cavin Johnson has opened up on the possibility of taking over the club's head coaching role on a permanent basis.","content":"Kaizer Chiefs' interim coach Cavin Johnson has opened up on the possibility of taking over the club's head coaching role on a permanent basis. After a slow start in what was his first match against Golden Arrows, Johnson and his Chiefs side managed to bag their first win since he was instated following a 3-2 win over struggling Cape Town Spurs in front of an empty FNB Stadium on Wednesday. Johnson had 10 days in which he could fine-tune his preparations and the differences, although small, were there to see. For periods of the match, Chiefs played some scintillating football, particularly in the first half where they dominated and scored two goals. Johnson has emphasized on returning to the Chiefs way and if his second match is anything to go by, then he is on the right track. Naturally, talk of the 64-year-old taking over the reins on a permanent basis has surfaced and now the coach has opened up on whether he would like to make his interim appointment a permanent one. “It’s something that appeals to me. But there’s something bigger that appeals to me. I’ve been to some of the biggest teams in the world and I worked with one of the biggest teams in the world and when I say this team has got that potential. I think you need to bring from a bigger team and put it in this team but not as a head coach. A head coach will be changed in any club. This team is not where its supposed to be and maybe with the little knowledge that I have, I think this team can be as big as it should be,” he told journalists. “There’s a cloth for me that needs to be shown to the rest of the world and I think this team has got it. So whether I’m the head coach or the interim coach, I’ve come to this team because there is something that nobody else has,” he continued. Johnson's next test will undoubtedly be his biggest as his side take on Orlando Pirates in a Soweto Derby on Saturday.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/7083/e74085ab7993482ebecfc7d11e521071.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"3f6d6beeb3bf75c7b9a2449d8615f0aa","title":"Soccerladuma | Two PSL Clubs Chasing Argentinian Striker?","link":"https://www.snl24.com/soccerladuma/local/siyagobhoza/claudio-spinelli-two-psl-clubs-chasing-argentinian-striker-20231109","keywords":null,"creator":null,"video_url":null,"description":"South African clubs in the Premiership are interested in an Argentine striker who has professional football experience in South America and Europe, the Siya crew understands.","content":"You must be to read and post comments.","pubDate":"2023-11-09 08:33:42","image_url":"https://cdn.24.co.za/files/Cms/General/d/9536/3015ebb18a8e47208aa215a316f648ea.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"c924a174235f475734a6b8d76b62fc95","title":"Soccerladuma | Real Madrid 'Make' Massive Decision On Mbappe Transfer","link":"https://www.snl24.com/soccerladuma/international/messi-ronaldo-neymar-mbappe-watch/real-madrid-make-massive-decision-on-mbappe-transfer-20231109","keywords":null,"creator":null,"video_url":null,"description":"Real Madrid have reportedly come to a massive decision regarding their pursuit of French superstar Kylian Mbappe.","content":"Real Madrid have reportedly come to a massive decision regarding their pursuit of French superstar Kylian Mbappe. Another captivating chapter has been added to the story involving Los Blancos and the Bondy native. The Spanish giants' interest in the forward is well documented, dating all the way to his days as an AS Monaco prodigy, and after he moved to Paris Saint-Germain in 2017, the links have only intensified. According to though, Los Merengues' have now ruled out signing the soon-to-be free agent. The 24-year-old is in the final months of his current PSG deal, and from January 2024, will be able to sign for any club he wishes, but Real are said to have called time on their pursuit of the 2018 FIFA World Cup winner and are believed to have done this for three reasons. The first is because he would upset the wage structure of the club if he were to arrive, especially seeing as he would command exorbitant wages as a free agent. The second reason is that his signing would go against the club's recent transfer policy of signing young stars. Vinicius Junior, Rodrygo, Eduardo Camavinga, Jude Bellingham, Endrick and Arda Guler are footballers who were signed just as they were about to turn 20. The third reason is because the club, and its fans, remember how the forward rejected them in 2022 when he was in a similar situation. According to however, all the news that has emerged from Spain is to preserve Real's public image in case the attacker decides against signing with the record European champions once again. The French media outlet did maintain that some of the chiefs at Valdebebas are open to abandoning the move for Mbappe, but club president Florentino Perez is believed to still be very much interested in luring the prolific attacker to his club. You must be to read and post comments.","pubDate":"2023-11-09 08:22:31","image_url":"https://cdn.24.co.za/files/Cms/General/d/9286/931c53e7de7341e391fca825749dfc4e.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"9f338bca5c8f53015cd2b74cfd27ba0d","title":"Michael Schumacher health condition must be kept private, says close F1 pal","link":"https://www.dailystar.co.uk/sport/f1/michael-schumacher-condition-private-pal-31396935","keywords":["Sport"],"creator":null,"video_url":null,"description":"Details surrounding Michael Schumacher's health condition have been kept from the public since his horrific skiing accident in 2013, and a friend of the family says it needs to stay that way","content":"A friend of says the legend's health condition must always remain private. The seven-time world champion hasn't been seen in public since he suffered catastrophic injuries in a skiing accident in 2013. Little is known is about his condition, and friend of the family Timo Glock, who is himself a former F1 driver, insists it needs to stay that way. Speaking to , Glock says he's in touch with Mick Schumacher, but refuses to ask the 24-year-old about his father's health out of respect. He said: \"I keep in contact with Mick Schumacher as he and I get along well. \"I've also known other members of his family for a very long time, but I try not to impose on their privacy. I respect their right to be private, and I don't discuss Michael's condition with them.'' Glock claimed Schumacher was a very private person on race day, but away from the sport he was different animal. \"I spent a lot of time off-track with Michael, and it didn't matter what we did,\" the 41-year-old said. \"He was very open, super friendly, and a really nice guy. People thought he wasn't!'' Glock began his F1 career in 2004, driving for now defunct constructors Jordan Ford before later joining Toyota. In 2008 and 2009 he achieved back-to-back 10th-place finishes in the Drivers' Championship - a career best. He then competed for Virgin Racing before leaving the circuit in 2012. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Schumacher, meanwhile, won seven Drivers' Championships; in 1994, 1995, 2000, 2001, 2002, 2003 and 2004. He spent the bulk of his illustrious career with Ferrari, winning five world titles with the Italian constructors. He retired in 2012, a year before his skiing accident.","pubDate":"2023-11-09 07:52:11","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31397049.ece/ALTERNATES/s98/1_F1-Grand-Prix-of-China-Race.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dca993bf2bc1bfc68415ef5971a1a74a","title":"‘Could have chosen better words’: May walks back Pies comments after ‘crazy backlash’","link":"https://www.foxsports.com.au/afl/teams/melbourne-demons/afl-2023-steven-may-backflips-on-collingwood-criticism-from-best-and-fairest-speech-melbourne-demons-culture-latest-news/news-story/d99945eca61f99b6dab263bd65a95281","keywords":null,"creator":null,"video_url":null,"description":"Star Melbourne defender Steven May has conceded he “probably could have chosen better words” after throwing shade at Collingwood at last month’s best and fairest, but says he was surprised by the backlash over his comments.","content":"Star Melbourne defender Steven May has conceded he “probably could have chosen better words” after throwing shade at Collingwood at last month’s best and fairest, but says he was surprised by the backlash over his comments. A candid May said at the event the Demons “should have smoked” the Magpies in the clubs’ qualifying final and that Melbourne was “so much better” than the eventual premiers. May’s comments sparked criticism from the football world amid questions of Melbourne’s culture as part of a tumultuous off-season for the club after consecutive straight-sets finals exits. Watch every match of The ICC Men’s Cricket World Cup Live with no ad breaks in play on Kayo Sports. Join Kayo now and start streaming instantly > Grand Final AFL Sep 30 2:30pm AEST FT Collingwood 90 Brisbane 86 MATCH CENTRE *Odds are current as of 9th November 2023, 6:49pm AEST VIEW ALL SCORES Grundy opens up on Demons departure | 01:14 Speaking at Oaks Day at Flemington Racecourse on Thursday, May admitted his remarks might’ve gone too far despite claiming he was simply speaking honestly at an intimate club event. “You want to have that belief and I’m a bit like that,” he told Channel 7. “I wasn’t having an interview at the time with all you guys, I was speaking to our Melbourne members and my teammates. “Probably could have chosen some better words, but the backlash was pretty crazy considering those guys all got a medal around their neck and are loving life and I’m in Japan after going out in straight sets.” Also speaking at Oaks Day, Melbourne skipper Max Gawn admitted the club needed to take a look in the mirror and “have some conversations” after an eventful few months. It’s included Joel Smith receiving a provisional suspension for testing positive to cocaine in season and concerns around Clayton Oliver’s behaviour after the star midfielder was admitted to hospital for a head injury caused by a seizure. Gawn was hopeful the Demons could bounce back and even grow from the trying circumstances. ﻿“I feel like with adversity hopefully we can get through stuff like this,” Gawn told Channel 7. “Obviously I agree we got to have some conversations. Our culture in a way has been relatively successful in the last three or four years, but there is bits that’s happened. “We need to have a conversation, we need to talk about it and make sure we can all get on the straight and narrow, and hopefully with this adversity comes a fair bit of greatness.”","pubDate":"2023-11-09 07:43:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"a0ac29665bb67f133a48699fb9f0f20f","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.northwaleschronicle.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2b8ebfe93c07786f42b35ff5a2607a36","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.northwalespioneer.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.northwalespioneer.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"971ee4e7cb0ee06ee23cb5d87c105ac1","title":"Football rumours: Newcastle interested in Kalvin Phillips and Ruben Neves","link":"https://www.southwalesguardian.co.uk/sport/national/23911664.football-rumours-newcastle-interested-kalvin-phillips-ruben-neves/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kalvin Phillips has played just four games for Manchester City this season.","content":"What the papers say Newcastle boss Eddie Howe is reportedly weighing up making a bid for Manchester City midfielder and Al-Hilal’s in January, according to the i newspaper. Phillips has fallen out of favour at Manchester City, while the Mirror reports a meeting between Premier League shareholders could block Newcastle’s move for Neves as both Newcastle and Al-Hilal are owned by Saudi Arabia’s Public Investment Fund. Crystal Palace forward is close to signing a new contract with the club after he reportedly agreed to the deal in principle, the Daily Mail reports. The Mirror says Bayern Munich will join the race to sign 24-year-old Real Sociedad midfielder . Zubimendi has played 12 games in LaLiga this season with a goal and an assist. Social media round-up ⚪⚪ Tottenham are reportedly in a battle with Jose Mourinho and Roma to sign in-form Genoa winger Albert Gudmundsson… But does Ange Postecoglou really need another wide player? — TEAMtalk (@TEAMtalk) ✍️ Premier League to rush through vote to block Newcastle signing Ruben Neves — Mirror Football (@MirrorFootball) Players to watch : Fabrizio Romano reports the Manchester United forward is expected to leave the Old Trafford in the January transfer window. : Clubs from the Saudi Pro League are interested in the 31-year-old Manchester United midfielder, according to 90min.","pubDate":"2023-11-09 07:32:31","image_url":"https://www.southwalesguardian.co.uk/resources/images/17423181/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"78a03e8420b4b6adf1080c5ee322953a","title":"Papers: Chelsea transfer chief faces questions after Hayes departure","link":"https://www.skysports.com/football/news/20876/13003798/paul-winstanley-facing-questions-from-chelsea-bosses-after-emma-hayes-shock-departure-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Thursday's newspapers...","content":"All the top stories and transfer rumours from Thursday's newspapers... DAILY MAIL Chelsea sporting director Paul Winstanley is facing questions from the club's owners following Emma Hayes' shock announcement that she is leaving at the end of the season, after he 'dithered' over offering her a new contract. Jos Buttler insisted that he intends to lead England in their white-ball fixtures against West Indies in the Caribbean next month, despite their dismal showing at the Cricket World Cup. Premier League shareholders will vote on a temporary ban involving incoming loan signings between clubs with the same owners later this month, meaning Newcastle would not be able to arrange deals for players - like Al Hilal midfielder Ruben Neves - in Saudi Arabia. Nuno Espirito Santo and Karim Benzema were caught up in a serious argument on Monday ahead of the former Tottenham boss' sacking from Al Ittihad, with the details of their argument now leaked by a Saudi Arabian outlet. Arsenal and referee chiefs remain at loggerheads with the Premier League club set to cite decisions that have gone against them since last season in their next meeting in a bid to prove a pattern. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Eberechi Eze is close to signing a new contract with Crystal Palace after reaching an agreement in principle with the club over fresh terms. Real Madrid will reportedly prioritise a move for Jamal Musiala if they are unable to secure the signing of long-term target Kylian Mbappe. DAILY MIRROR Jose Mourinho has emerged as a candidate to be the permanent Al Ittihad manager - and the Roma boss has already claimed Cristiano Ronaldo has helped persuade him to one day move to Saudi Arabia. Marcel Brands has confirmed Everton were interested in signing now-Liverpool winger Luis Diaz back in 2021, but Rafael Benitez prevented the club from completing a deal. Jack Grealish has admitted he is at risk of losing his place in Manchester City's team if he does not start scoring more goals. Cricket is set to introduce a type of 'shot-clock' to the game in a bid to speed up play and avoid a similar 'timed out' fiasco that occurred during the Sri Lanka vs Bangladesh clash. Francis Cummins is back in rugby league after the ex-Great Britain international was appointed Hull FC's head of emerging talent. Damon Hill believes Mercedes' aerodynamics department will struggle to close the gap on Formula 1's dominant team Red Bull. Tiger Woods has revealed he will be returning to golf in January as part of his new endeavour with Rory McIlroy when they launch The Golf League. Gareth Southgate will not accept any sick notes for England's final Euro qualifiers. DAILY EXPRESS Erik ten Hag could miss out on his transfer priority if Sir Jim Ratcliffe isn't quick in overseeing his planned appointments in Manchester United's sporting department. United are preparing to be active in the January transfer window but will face limitations, especially if Sir Jim doesn't make an early statement, according to reports. Please use Chrome browser for a more accessible video player Khephren Thuram has admitted that he was 'happy' to be linked with top clubs during the summer. Liverpool were among those reportedly interested in the OGC Nice midfielder, whose superb start to the campaign will once again leave him in high demand when the transfer window reopens in January. Arsenal boss Mikel Arteta may already have the long-term answer to his striker problems. The Gunners are linked with signing a new frontman but loan star Mika Biereth, who has scored four in five in the Scottish Premiership this season is proving that he could have a big future ahead of him. THE TIMES Eoin Morgan has described England as a \"sinking ship\" and accused the senior players, captain and coach of shirking responsibility by sending out assistant coach Carl Hopkinson to face the media before the Netherlands match. Clubs relegated from the Premier League will be able to spend a higher proportion of their income on player wages than their Sky Bet Championship rivals under the terms of a proposed financial settlement. Plans for a rugby Club World Cup have been pushed back and are unlikely to come to fruition until 2028 at the earliest. Eddie Jones has said that he would \"definitely be interested\" in a second stint as the Japan head coach having resigned from his post in charge of Australia after a disastrous World Cup. US Open organisers have doubled down on the controversial decision not to host a wheelchair event next year and will instead offer players financial grants to cover lost earnings of more than £1 million. THE SUN World Cup-style VAR is set to arrive in the Premier League next season. Club bosses voted against semi-automated offside technology and its \"limb-tracking\" cameras last summer, despite it being installed by top-flight clubs in UEFA competitions. Cristiano Ronaldo's ex-Portugal boss Fernando Santos has explained his dramatic feud with the legend he still regards as \"like a son to me\". Real Madrid have sensationally ruled out a swoop for Kylian Mbappe, according to reports. Madrid's stance is set to put Premier League teams on red alert. DAILY TELEGRAPH John McGinn has revealed that his goal celebration is a gesture of support for his young nephew Jack, who is forced to wear eye protectors when he plays football. DAILY STAR Anthony Joshua revealed he's not friendly with Tyson Fury during a sit-down with Louis Theroux. DAILY RECORD The Tartan Army face a mad scramble for Euro 2024 tickets as UEFA is reportedly set to cap the allocation for the SFA and other national associations to just 9,500 tickets per game. Motherwell have slammed fans for their pyro display against St Johnstone at McDiarmid Park. Rangers are investigating two major options with Ibrox that could dwarf neighbours Celtic. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 8pm Tuesday.","pubDate":"2023-11-09 07:30:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"}]}