{"newsArray":[{"article_id":"0cc5feff18e92f18b7cac6d6b2852b6d","title":"The return of hooliganism is turning European football into a lethal battleground & why English fans are targets","link":"https://www.thesun.ie/sport/11843518/return-hooliganism-european-football/","keywords":["Football","Sport","Champions League","Crime","Europa League","Features","Hooligans","Police","Print Features","The Sun Newspaper","UEFA"],"creator":["Grant Rollings"],"video_url":null,"description":null,"content":"THEY once called it the English disease, but football violence is now damaging the image of the beautiful game across Europe – and spreading to other sports. This week Turkey has stopped all footie matches indefinitely after a referee was punched to the ground on the pitch by a club president. And Greece banned fans from top-flight football games for two months after violence erupted between rival volleyball supporters in Athens, severely injuring a police officer. Meanwhile, France is considering barring away supporters after a fan was stabbed to death ten days ago. In January an Italian motorway was closed when rival supporters piled into each other, and a year ago crowds of Croatia’s Dinamo Zagreb fans delivered Nazi salutes in unison on the streets of Milan. Across the continent, authorities are struggling to control hooliganism — often aimed at travelling English fans, who receive massive police protection as continental supporters try to test their reputation for street brawling. Two months ago in Milan a Newcastle United fan was stabbed in the stomach by a machete-wielding yob in a balaclava. This season was Brighton and Hove Albion’s first taste of competitive European football. But last month in Athens, tear gas aimed by police at riotous fans of the defeated home team AEK ended up choking Brighton supporters. In May, West Ham players tried to intervene when hooded fans of Dutch side AZ Alkmaar piled into the section of the stadium where the English team’s families were sitting. Football’s ruling bodies fear the return of the hooliganism from decades ago, which in 1985 saw English teams banned from Europe for five years after the deaths of 39 mostly Italian fans in the riot at the Heysel Stadium in Brussels. In August Uefa president Aleksander Ceferin said of the violence: “This is the cancer of football and those are not football fans. “We have to say enough, we have to stop this.” Then came Monday’s graphic display of football’s ugly side. Faruk Koca , president of Turkish side MKE Ankaragucu , ran on to the pitch and struck referee Halil Umut Meler in the face, landing him in hospital. The Turkish Football Federation then indefinitely postponed all games. Turkey’s “ultra fans” are notorious for carrying weapons, supposedly to kill opponents. Fenerbahce has a fan group called Kill For You, and in 2000 Galatasaray hooligans stabbed two Leeds United fans to death. There are also stringent new fan restrictions in neighbouring Greece, where on Monday the government announced that teams would have to play in empty stadiums. It followed two deaths in bloody clashes between supporters this year alone. In February a 19-year-old student was bludgeoned to death in Thessaloniki just for saying he supported a rival team, then in August a 29-year-old AEK Athens supporter was stabbed to death by a Dinamo Zagreb thug. And not having matches to attend might not even stop the violence, as fan rivalry spreads between sports. The ban on football fans came after police were attacked with flares, stones and petrol bombs outside an Athens volleyball stadium last week after a match between Olympiakos and Panathinaikos , who are also bitter football foes. Government spokesman Pavlos Marinakis said: “For years, criminals in the guise of fans have been committing serious crimes by critically injuring and killing people.” Brighton fans experienced those crazed elements at the end of last month in the Greek capital. The police tried to subdue rioting AEK Athens yobs with tear gas at the end of the game, but it drifted over to the away fans as well, and some Brighton fans had to be treated by paramedics. Life-long Seagulls fan Mike Purser, 54, told The Sun: “They tear-gassed their fans who were waiting for us to come out. “It blew back into the stadium. They locked us in and wouldn’t let us go down, but as soon as it happened, they took us down and gave us water.” The previous month in Marseille , the risk of things turning ugly meant Brighton fans had to be closely guarded. The French side’s ultras have attacked their own training ground and have a reputation for being the country’s most rabid fans. Property developer Mike continued: “Marseille was like a military performance to get to the ground. We had to be there three or four hours before kick-off. “Coming out was a palaver because they wouldn’t let us go down into the concourse. People were struggling because it was so hot and I saw some people passing out.” In September three men were arrested outside a Glasgow hostel after fans of Rangers and Spanish side Real Betis clashed following their Europa League match in the city. The fighting saw windows smashed and security locking the hostel with Betis fans inside in a bid to bring the violence to an end. Tartan Army fans have a reputation for being boisterous but well-behaved, with recent flashpoints on foreign trips emerging when police target supporters. Footage of a Spanish cop beating a Scotland fan emerged ahead of the side’s Euro 2024 qualifier in Seville in October. In February French police came in for criticism when Uefa said that Liverpool and Real Madrid fans could have died because the 2022 Champions League final in Paris was handled so badly by heavy-handed cops. The authorities already ban away fans from historically troublesome games, but may go further after a Nantes fan died during a fight with Nice supporters earlier this month . Trouble often breaks out away from stadiums. Newcastle fan Eddie McKay, 58, was slashed three times as he walked to his Milan hotel before his side played AC Milan . It is not uncommon for thugs to find out which bars the English fans are drinking in and to arrive spoiling for a fight. West Ham supporter Alfie Barker, 33, believes English fans are targeted. He said: “Two Belgian fans came up to me and my brother in a Brussels bar and asked, ‘Do you want a fight?’ We said no, but they didn’t go away. “It was just because we were speaking English. We weren’t wearing West Ham kits — I never have the team’s colours on in Europe.” West Ham supporters have seen a lot of trouble on the European mainland in the past couple of years. Eintracht Frankfurt fans were filmed charging towards Hammers supporters in a Seville bar in March 2022, Belgian side Anderlecht apologised for their fans throwing seats at West Ham supporters in October that year and at the AFAS Stadion in Alkmaar, Holland in May, the club’s fans were assaulted in their seats. West Ham boss David Moyes said after the Alkmaar game: “Was I worried? Yeah, my family were there and I had friends in that section.” Eintracht’s yobs are developing an unsavoury reputation. This year 50 German police officers were injured by them in Frankfurt and cars were set alight when they clashed with cops in Naples, even though they had been banned from Napoli’s stadium. But West Ham supporters also got into trouble for throwing objects on to the pitch in Genk, Belgium, and setting off flares in Prague. And there are certainly signs that the “English disease” is making a comeback in Britain. Last season the police made the highest number of arrests at football matches in England and Wales for nearly a decade. In 2022-23 there were 2,264 football-related arrests, up 66 on the previous figure, and the worst since 2013-14. There have been several pitch invasions, including one in January in which Arsenal keeper Aaron Ramsdale was kicked in the back. There was also great shame at the Euro 2020 final two years ago when England fans tried to storm into Wembley Stadium. But the most violent disturbance at a game in recent years in England was arguably the one at Villa Park in Birmingham at the end of November. Fans from Polish side Legia Warsaw threw flares at police and attacked their horses. Unless clubs across the Continent can stamp out the rising tide of often organised unrest, families will be afraid to attend matches, while some fans won’t go to Europe for fear of ending up bloodied or bruised. For supporters who are not used to the hooliganism of the 1980s it has been a shock. West Ham fan Alfie added: “I didn’t see trouble at matches until we went into Europe.”","pubDate":"2023-12-13 00:05:22","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/faruk-koca-president-mke-ankaragucu-865657999-1.jpg?strip=all&w=960","source_id":"thesun_ie","source_priority":45285,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"57fe9283b7614e96484d1b69ea016e86","title":"The return of hooliganism is turning European football into a lethal battleground & why English fans are targets","link":"https://www.thescottishsun.co.uk/sport/11650028/return-hooliganism-european-football/","keywords":["Football","Sport","Champions League","Crime","Police","The Sun Newspaper"],"creator":["Grant Rollings"],"video_url":null,"description":null,"content":"THEY once called it the English disease, but football violence is now damaging the image of the beautiful game across Europe – and spreading to other sports. This week Turkey has stopped all footie matches indefinitely after a referee was punched to the ground on the pitch by a club president. 11 Referee Halil Umut Meler is clobbered by Faruk Koca Credit: Getty 11 Ref Meler holds his face as Koca looks on Credit: EPA 11 Meler was in hospital after the attack Credit: Getty 11 President of the Turkish team MKE Ankaragücü, at the end of Monday’s game Credit: Getty And Greece banned fans from top-flight football games for two months after violence erupted between rival volleyball supporters in Athens, severely injuring a police officer. Meanwhile, France is considering barring away supporters after a fan was stabbed to death ten days ago. In January an Italian motorway was closed when rival supporters piled into each other, and a year ago crowds of Croatia’s Dinamo Zagreb fans delivered Nazi salutes in unison on the streets of Milan. Across the continent, authorities are struggling to control hooliganism — often aimed at travelling English fans, who receive massive police protection as continental supporters try to test their reputation for street brawling. Two months ago in Milan a Newcastle United fan was stabbed in the stomach by a machete-wielding yob in a balaclava. This season was Brighton and Hove Albion’s first taste of competitive European football. But last month in Athens, tear gas aimed by police at riotous fans of the defeated home team AEK ended up choking Brighton supporters. In May, West Ham players tried to intervene when hooded fans of Dutch side AZ Alkmaar piled into the section of the stadium where the English team’s families were sitting. Most read in Football TO BE FRANK Ex-Rangers star sacked as boss by two clubs after total of just NINETEEN games IN THE MIX Gers in three-horse race for Everton ace Holgate as Toffees eye loan recall move IT'S A VARCE It's incredible Rangers haven't conceded penalty since I retired jokes Brown SECRECY ROW SNP 'kept lid on Scotland's top cop's driving scandal for three weeks' Football’s ruling bodies fear the return of the hooliganism from decades ago, which in 1985 saw English teams banned from Europe for five years after the deaths of 39 mostly Italian fans in the riot at the Heysel Stadium in Brussels. In August Uefa president Aleksander Ceferin said of the violence: “This is the cancer of football and those are not football fans. “We have to say enough, we have to stop this.” Then came Monday’s graphic display of football’s ugly side. Faruk Koca , president of Turkish side MKE Ankaragucu , ran on to the pitch and struck referee Halil Umut Meler in the face, landing him in hospital. The Turkish Football Federation then indefinitely postponed all games. Turkey’s “ultra fans” are notorious for carrying weapons, supposedly to kill opponents. Fenerbahce has a fan group called Kill For You, and in 2000 Galatasaray hooligans stabbed two Leeds United fans to death. Empty stadiums There are also stringent new fan restrictions in neighbouring Greece, where on Monday the government announced that teams would have to play in empty stadiums. It followed two deaths in bloody clashes between supporters this year alone. In February a 19-year-old student was bludgeoned to death in Thessaloniki just for saying he supported a rival team, then in August a 29-year-old AEK Athens supporter was stabbed to death by a Dinamo Zagreb thug. And not having matches to attend might not even stop the violence, as fan rivalry spreads between sports. The ban on football fans came after police were attacked with flares, stones and petrol bombs outside an Athens volleyball stadium last week after a match between Olympiakos and Panathinaikos , who are also bitter football foes. Government spokesman Pavlos Marinakis said: “For years, criminals in the guise of fans have been committing serious crimes by critically injuring and killing people.” Brighton fans experienced those crazed elements at the end of last month in the Greek capital. The police tried to subdue rioting AEK Athens yobs with tear gas at the end of the game, but it drifted over to the away fans as well, and some Brighton fans had to be treated by paramedics. 11 Dinamo Zagreb thugs give the Nazi salute on a march last year in Milan Credit: Twitter 11 Legia Warsaw mob throw flares at police and horses last month at Aston Villa Credit: Reuters Life-long Seagulls fan Mike Purser, 54, told The Sun: “They tear-gassed their fans who were waiting for us to come out. “It blew back into the stadium. They locked us in and wouldn’t let us go down, but as soon as it happened, they took us down and gave us water.” The previous month in Marseille, the risk of things turning ugly meant Brighton fans had to be closely guarded. The French side’s ultras have attacked their own training ground and have a reputation for being the country’s most rabid fans. Property developer Mike continued: “Marseille was like a military performance to get to the ground. We had to be there three or four hours before kick-off. “Coming out was a palaver because they wouldn’t let us go down into the concourse. People were struggling because it was so hot and I saw some people passing out.” In September three men were arrested outside a Glasgow hostel after fans of Rangers and Spanish side Real Betis clashed following their Europa League match in the city. The fighting saw windows smashed and security locking the hostel with Betis fans inside in a bid to bring the violence to an end. Tartan Army fans have a reputation for being boisterous but well-behaved, with recent flashpoints on foreign trips emerging when police target supporters. Footage of a Spanish cop beating a Scotland fan emerged ahead of the side’s Euro 2024 qualifier in Seville in October. In February French police came in for criticism when Uefa said that Liverpool and Real Madrid fans could have died because the 2022 Champions League final in Paris was handled so badly by heavy-handed cops. The authorities already ban away fans from historically troublesome games, but may go further after a Nantes fan died during a fight with Nice supporters earlier this month . 11 Clash in Naples as police come under attack from Eintracht Frankfurt yobs in March Credit: Rex 11 Trouble after a hooded AZ Alkmaar gang charged Hammers fans Credit: Getty Trouble often breaks out away from stadiums. Newcastle fan Eddie McKay, 58, was slashed three times as he walked to his Milan hotel before his side played AC Milan . It is not uncommon for thugs to find out which bars the English fans are drinking in and to arrive spoiling for a fight. West Ham supporter Alfie Barker, 33, believes English fans are targeted. He said: “Two Belgian fans came up to me and my brother in a Brussels bar and asked, ‘Do you want a fight?’ We said no, but they didn’t go away. “It was just because we were speaking English. We weren’t wearing West Ham kits — I never have the team’s colours on in Europe.” West Ham supporters have seen a lot of trouble on the European mainland in the past couple of years. Eintracht Frankfurt fans were filmed charging towards Hammers supporters in a Seville bar in March 2022, Belgian side Anderlecht apologised for their fans throwing seats at West Ham supporters in October that year and at the AFAS Stadion in Alkmaar, Holland in May, the club’s fans were assaulted in their seats. West Ham boss David Moyes said after the Alkmaar game: “Was I worried? Yeah, my family were there and I had friends in that section.” Eintracht’s yobs are developing an unsavoury reputation. This year 50 German police officers were injured by them in Frankfurt and cars were set alight when they clashed with cops in Naples, even though they had been banned from Napoli’s stadium. But West Ham supporters also got into trouble for throwing objects on to the pitch in Genk, Belgium, and setting off flares in Prague. 11 Hammers fan Alfie Barker said: 'I didn’t see trouble at matches until we went into Europe' Credit: The West Ham Way Channel/Youtube And there are certainly signs that the “English disease” is making a comeback in Britain. Last season the police made the highest number of arrests at football matches in England and Wales for nearly a decade. In 2022-23 there were 2,264 football-related arrests, up 66 on the previous figure, and the worst since 2013-14. There have been several pitch invasions, including one in January in which Arsenal keeper Aaron Ramsdale was kicked in the back. There was also great shame at the Euro 2020 final two years ago when England fans tried to storm into Wembley Stadium. But the most violent disturbance at a game in recent years in England was arguably the one at Villa Park in Birmingham at the end of November. Fans from Polish side Legia Warsaw threw flares at police and attacked their horses. Unless clubs across the Continent can stamp out the rising tide of often organised unrest, families will be afraid to attend matches, while some fans won’t go to Europe for fear of ending up bloodied or bruised. Read more on the Scottish Sun PERFECT FIT I have big boobs and I'm skinny, finding sports bras is a hot mess, until now AISLE SAY Me & my husband don’t share a bed for a good reason - our marriage isn't over For supporters who are not used to the hooliganism of the 1980s it has been a shock. West Ham fan Alfie added: “I didn’t see trouble at matches until we went into Europe.” 11 A PSV Eindhoven fan waves a flare at a Dutch league game Credit: AFP 11 Panathinaikos fans with their traditional display of pyrotechnics Credit: Getty","pubDate":"2023-12-13 00:05:22","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/faruk-koca-president-mke-ankaragucu-865657999-1.jpg?strip=all&w=960","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ea23a8d06ac9cd8819ac0beff0baffa4","title":"Mercato : Il prive le PSG d’un attaquant et jubile","link":"https://le10sport.com/football/mercato/mercato-il-prive-le-psg-dun-attaquant-et-jubile-675284","keywords":null,"creator":null,"video_url":null,"description":"En fin de contrat avec le Borussia Mönchengladbach en fin de saison dernière, Marcus Thuram aurait pu être l’un des gros coups du Paris Saint-Germain selon nos informations. L’attaquant français a…","content":"En fin de contrat avec le Borussia Mönchengladbach en fin de saison dernière, Marcus Thuram aurait pu être l’un des gros coups du Paris Saint-Germain selon nos informations. L’attaquant français a finalement décidé de poursuivre sa carrière en Serie A du côté de l’Inter, où il semble déjà faire l’unanimité. Luis Campos a réalisé d'excellentes choses pendant le dernier mercato estival, mais il aurait pu faire mieux. Nous vous avons en effet révélé sur le10sport.com que le Portugais a connu plusieurs échecs au PSG , notamment avec une star montante de l’ équipe de France de Didier Deschamps . PSG : Il glisse déjà un nom pour succéder à Luis Enrique https://t.co/0WpqHqYnD1 pic.twitter.com/KI7hQOjXwX Il s’agit de Marcus Thuram , qui était un coup extrêmement intéressant, puisqu’il était libre de tout contrat cet été. Mais il a finalement snobé le PSG ainsi que son ami Kylian Mbappé pour choisir l’ Inter , comme il l’a récemment confié. « Il sait très bien pourquoi je ne suis pas venu à Paris (...) C’était une question de feeling. L’Inter était-là il y a deux ans. L’Inter m’a toujours vu comme un numéro 9 et donc c’était un choix limpide » a expliqué le joueur, dans un entretien diffusé sur Canal+ . Et si le PSG se mord les doigts d’être passé à côté de ce coup, du côté de l’ Inter on est aux anges, surtout avec les prestations plus qu’abouties de Marcus Thuram depuis le début de la saison. Interrogé sur cette opération ce mardi, Giuseppe Marotta a d’ailleurs tenu à féliciter son directeur sportif. « Thuram a été une grande intuition de Piero Ausilio » a déclaré l’administrateur délégué de l’Inter, au micro de Sky Sport « Nous l'avons soutenu et nous sommes tous contents de ce qu'il fait. Il a un grand potentiel et peut jouer un rôle encore plus important que ce qu'il fait actuellement ».","pubDate":"2023-12-13 00:00:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/222312.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b001c5c6bd2a8fc3b3fccc2b0d990f87","title":"Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race","link":"https://www.dailymail.co.uk/sport/football/article-12856749/Declan-Rice-Arsenal-emergency-centre-back.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The England international has been an ever-present in midfield for his new side, helping them in another Premier League title chase and to the top of their group in the Champions League.","content":"Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race Rice played half an hour in defence for Arsenal against PSV coming off the bench William Saliba and Gabriel started the game as injury issues start to mount again CHRIS SUTTON: I was RIGHT to call Man United players ‘snakes’ last week - IAKO By Lewis Browning For Mailonline Published: 17:32 EST, 12 December 2023 | Updated: 18:58 EST, 12 December 2023 e-mail 5 View comments Mikel Arteta has revealed that he is willing to use Declan Rice in defence as an 'emergency'. Rice has been one of the signings of the season in the Premier League after joining the Gunners for £105million from West Ham . The England international has been an ever-present in midfield for his new side, helping them in another Premier League title chase and to the top of their group in the Champions League . Arsenal have had a relatively drama-free campaign so far, but are prepared should they hit any stumbling blocks as they look to win their first Premier League title since 2004. After his side drew 1-1 with PSV in their final Champions League group game , Arteta praised Rice and revealed his plans for the 24-year-old going forward following an experiment on Tuesday. Declan Rice (pictured) is Arsenal's 'emergency' centre back, Mikel Arteta has confirmed Rice played half an hour in defence for Arsenal during their Champions League game against PSV on Tuesday Arteta (pictured) said Rice is 'a good option' to cover at the back if needed for the Gunners Your browser does not support iframes. 'We are very short at the back and I really wanted to try if something happens, how we're going to resolve that situation,' he said. 'I thought he was really good. 'He has played there before. We have to try as if we have an emergency we have to understand and to be sure that we can fill that gap in the right way. 'He has a lot of composure on the ball, he wins a lot of duels for a player of his size and he has done it in the past. He is a good option.' Rice played half an hour at centre back for Arsenal against PSV, coming on as a substitute for William Saliba with the group already won before the game. Gabriel (left) and William Saliba (right) have been Arsenal's first-choice defendive pair but injuries are starting to pile up Jurrien Timber is one of the defenders who are currently out injured for Arsenal, with similar happening last year IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement Arsenal have had to deal with injuries to the likes of Jurrien Timber and Takehiro Tomiyasu, meaning Saliba and Gabriel started the game in the Netherlands despite it meaning nothing. Ben White and Jakub Kiwior can also play in the middle of defence, but it seems Arteta prefers them in wide defensive positions, with Kiwior starting at left back and White coming on and playing right back in the game. Arsenal's title hopes were dealt a blow last year when Saliba suffered an injury and Rob Holding was forced to deputise before being dropped for Kiwior. Arteta will hope his side are better prepared for any issues this term, however, with Rice able to cover on the right side on the defence if needed. Champions League Mikel Arteta Share or comment on this article: Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-12 23:58:21","image_url":"https://i.dailymail.co.uk/1s/2023/12/12/23/78890065-0-image-a-51_1702422611125.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"94737c0169abf66383187308deb6305e","title":"Tommy DeVito’s legendary Giants story is Linsanity all over again with one big difference","link":"https://nypost.com/2023/12/12/sports/tommy-devito-is-linsanity-all-over-again-with-one-big-difference/","keywords":null,"creator":["Mike Vaccaro"],"video_url":null,"description":"In some ways it is unfair to compare what DeVito has done to what Jeremy Lin did during the peak of his phenomena in the winter of 2012, and we’ll get to that later. But in some ways, some impossible-to-dispute ways, it’s as if we’re merely seeing an old movie remade.","content":"It is important to remember just how profound the despair was, before. It is essential to consider how all the joy of a season had been drained from the Giants, how all the optimism of last year had dissolved in a slovenly pile of injuries and sloppy play and general failure. Incompetence had led to inconsequence. And when that happens, a franchise buckles and bleeds. The Giants were buckled, figuratively and literally, when Tommy DeVito trotted onto the field to replace Tyrod Taylor on the grim afternoon of Oct. 29 at MetLife Stadium, and they were bleeding when he did the same in relief of Daniel Jones a week later inside the sterile milieu of Las Vegas’ Allegiant Stadium. And look at them now. Look at him now. “It’s his job,” Giants coach Brian Daboll said after Monday’s scintillating 24-22 win over Green Bay. “Calm. Cool. Poised. Collected,” said Saquon Barkley. “Let’s go win the game,” The Man himself told his teammates in the huddle with 93 seconds left Monday night, trailing by one. “It’s on us, on the offense.” In truth, it was on him, and he not only accepted that burden, he relished it. And then delivered. In so many ways this seems like a Frank Merriwell once-in-a-lifetime story. And yet in some ways it feels remarkably familiar, especially if you remember almost a dozen years back, on the other side of the Hudson River. In some ways it is unfair to compare what DeVito has done to what Jeremy Lin did during the peak of his phenomena in the winter of 2012, and we’ll get to that later. But in some ways, some impossible-to-dispute ways, it’s as if we’re merely seeing an old movie remade, the names and the sports changed to protect the innocent, a retelling of “Rudy” starring Tanner Buchanan instead of Sean Astin. “It felt like we were hovering because that’s how loud and energetic this was, and it was a magical moment. I’ve never experienced something like that before or after.” That’s Jeremy Lin, speaking in the terrific short documentary available on MAX, “38 at the Garden,” recalling the moment when Linsanity reached its irrefutable apex: the evening of Feb. 10, 2012, inside Madison Square Garden. The Knicks were playing the Lakers, Kobe Bryant’s annual trip to New York City. The Lin phenomenon was only six days old, but it was already something. That night it became Something. That night, he dropped 38 points on 13-for-23 shooting, added seven assists. Prior to the game, Mamba had said, “I don’t even know what he’s done.” Lin gave him an up-close demonstration. And the Garden shook from its foundation across the final seven minutes straight of the Knicks’ 92-85 win. MetLife Stadium was occupied by too many Packers fans, abandoned by too many Giants fans who opted against a late Monday night commitment, so the thunder might not have equaled what happened at the Garden back in 2012. But the ones who stayed tried to carry the night. And just as Knicks fans helped deliver Lin, so would Giants fans help supply DeVito with maximum mojo, one critical completion after another on the final drive. “It’s just basketball,” Lin said before the increasingly swollen media brigade in 2012. “You try do it the same way as you did in college or high school or on the playground. You try to keep it simple.” “It’s just football,” Tommy DeVito said late Monday night. “You try to go score on every drive.” This is the latest parallel. There are so many others. Let’s start where this column started: The Giants forced to send their third-string quarterback in against the Jets, allowing him one forever moment — a touchdown run that gave the Giants a lead — but then vapor-locked him in Bubble Wrap, kept him that way the rest of the game, kept it on him when they needed to summon him the following week in Vegas. And … well, the times he was allowed to throw those first few weeks, you thought you understood why. He’d played plenty in college at big-shot schools Syracuse and Illinois. He’d been a high school star just up the road at Don Bosco Prep. He threw two TD passes against Dallas in his first start, but by then the Cowboys were mostly playing their walk-ons in a 49-17 bludgeoning. He looked overmatched. He looked, in truth, the way Jeremy Lin looked his first nine games as a Knick in 2011-12: 3.6 points per game, 40 percent shooting, only one attempt from 3. He was so timid that when he played at all, Mike D’Antoni didn’t just use the Bubble Wrap, he practically asked him to play in a Hazmat suit. Lin was so sure he was about to be released that one morning in Miami, weeks before his emergence, he attended the Heat’s pregame chapel service. At one point, the congregants were asked if they had any special intentions. One hand was raised. “What do you want to pray for?” the chaplain asked. “Not to get cut again,” Jeremy Lin said. It all started for Lin on a Saturday night, Feb. 4, 25 points against the Nets at the Garden. Beforehand, a friend had advised: “No holding back. Be Jeremy Lin tonight.” In “38 at the Garden” Lin said, “Getting into the shower afterward I didn’t know if it was water from the shower or tears in my eyes but I was like: ‘They can’t cut me now. They can’t cut me now. ‘They can’t cut me now.’ ” Lin had come to the Garden from his brother’s apartment, where he was staying on the couch; DeVito came to practice the week before his first start in Washington from his parents’ house in Cedar Grove, where he sleeps on his childhood bed. He threw three TDs that day. Since being overmatched against Dallas, he’s 3-0 and has thrown five TDs, zero picks, completed 72 percent of his passes, has a rating of 119.8. One last similarity: In the same way Jeremy Lin’s swagger multiplied every time he played in the winter of 2012, so has Tommy DeVito’s in the fall of 2023. “He loves the game of football,” Daboll said. “I think when you deal with the guy, I don’t think he makes it bigger than it is, either.” There would be worse things for Tommy DeVito than to take this quirky symmetry the distance, you know. Lin played nine years in the NBA, won a championship with Toronto in his last year, earned somewhere in the neighborhood of $65 million. At 35 years old, he is still playing alongside his brother, Joseph, for the New Taipei Kings in the Taiwan pro league. He’s averaging 21 points a game for the 7-0, first-place Kings. In its entirety, what we know as Linsanity lasted only 19 days, from the moment he checked into the game against the Nets until the Heat of LeBron/Wade/Bosch made it their mission to bully him into a 1-for-11, eight-turnover nightmare in Miami. He had some fine games after that, then got hurt, and had some terrific games with the Rockets, with the Lakers, with the Hornets and the Nets, the Hawks and the Raptors. Fine. But not a phenom. DeVito has an entire football life before him. At worst, he can probably bank on being a 10- to 12-year backup in the NFL now. Josh McCown earned $52.3 million that way — and the price for competent quarterbacking will never go down. At best? Well, put it this way. Brian Daboll fielded his first few questions Tuesday drawing him into a different comparison, this one concerning an out-of-nowhere quarterback he used to coach, a fellow by the name of Brady. “We’re four games in,” he replied. “But I do appreciate the question.” The rest of us can simply appreciate DeVito’s football homage to Lin, which as of Wednesday will celebrate its 23rd day, already four days longer than Linsanity lasted. At some point, he’ll earn his own name for it; his preference would probably be, simply, “veteran NFL quarterback.” For now, we’ll enjoy. It’s been a long time. How long? Remember the night Jeremy Lin magically dropped out of the sky against the Nets? That was the night before the Giants won their last Super Bowl. That’s how long.","pubDate":"2023-12-12 23:56:44","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-erw0tsjpe-1702424494098.jpg?quality=90&strip=all&1702406605","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"eb84da45f6191cb7e5aa5fc20a46018e","title":"Man United and Sevilla tumble out of European competition after Champions League losses","link":"https://www.winnipegfreepress.com/sports/soccer/2023/12/12/man-united-and-sevilla-tumble-out-of-european-competition-after-champions-league-losses","keywords":["Soccer"],"creator":["Jerome Pugmire, The Associated Press"],"video_url":null,"description":"PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Both teams were eliminated from […]","content":"PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Read this article for free: Already have an account? To continue reading, please subscribe: * PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Both teams were eliminated from European competition Tuesday night to finish bottom of their groups. Three-time Champions League winner United needed to beat Bayern Munich at home and hope for a favorable result in the other Group A game but lost 1-0 to the six-time winner. Instead, unheralded Danish side Copenhagen qualified in second place after beating Turkish team Galatasaray 1-0 at home. Galatasaray finished third to qualify for the Europa League knockout round playoff above last-place United — which sustained 4-3 losses at Bayern and Copenhagen and conceded 15 goals in six games. It is only the fourth time a Premier League team has finished bottom of its Champions League group. Earlier on, defending Europa League champion Sevilla — which has won the Europa League seven times — lost 2-1 at Lens to finish bottom of Group B as the French team finished third. Fans started leaving 10 minutes before the end at Old Trafford and others booed United’s players at the final whistle to heap the pressure on manager Erik Ten Hag. After winger Kingsley Coman neatly scored Bayern’s goal in the 71st minute, the away fans goaded United’s supporters with a rendition of “Football’s Coming Home” — a popular English soccer chant coined at the 1996 European Championship, where England lost to Germany in the semifinals — followed by “Auf Wiedersehen!” (So Long!). Ten Hag saw burly central defender Harry Maguire limping off near the end of the first half after appearing to injure his groin. United was punished when striker Harry Kane set up Coman as Bayern cut through a static defense with ease. Over in Denmark, midfielder Lukas Lerager scored for Copenhagen in the 58th. Coach Jacob Neestrup sprinted onto the field to celebrate with his jubilant players at the end. Italian champion Napoli advanced to the last 16 after beating Portuguese side Braga 2-0 at home to finish second in Group C, which had already been won by Real Madrid. African player of the year Victor Osimhen, who last season helped Napoli to its first Italian league title in 33 years, got Napoli’s second goal to continue his return to form. There was a rare soccer sight when veteran Croatia midfielder Luka Modric — the 2018 men’s Ballon d’Or winner — missed a penalty as Madrid fell behind but won 3-2 at Union Berlin. Forward Joselu scored twice as record 14-time champion Madrid finished with a perfect record. Braga finished third to reach the Europa League playoff. Last year’s Champions League runner-up Inter Milan and Spanish club Real Sociedad had already qualified from Group D and drew 0-0 in Italy, meaning Sociedad topped the group on goal difference. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. Arthur Cabral’s backheel goal in stoppage time gave Benfica a 3-1 win at Austrian side Salzburg in the other game to secure a place in the Europa League playoffs. In the other early match, striker Eddie Nketiah scored his first Champions League goal as Group B winner Arsenal drew 1-1 at second-place PSV Eindhoven in a match between qualified teams. Group winners are seeded in the last-16 draw on Dec. 18 and avoid each other. Teams also cannot be drawn against an opponent from their own country. The Europa League draw is held the same day. ___ AP soccer: https://apnews.com/hub/Soccer Advertisement Advertisement","pubDate":"2023-12-12 23:54:59","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"45442aa7d2bd6c895fd2a547d1bbffd1","title":"Justin Jefferson limited in Tuesday's practice","link":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/justin-jefferson-limited-in-tuesdays-practice","keywords":null,"creator":null,"video_url":null,"description":"Vikings receiver Justin Jefferson has a chest injury that knocked him out of Sunday's game against the Raiders.","content":"Vikings receiver Justin Jefferson has a chest injury that knocked him out of Sunday’s game against the Raiders. Coach Kevin O’Connell called Jefferson day to day on Monday. On Tuesday, the Vikings listed Jefferson as limited in practice. He played only 13 of 72 snaps Sunday in his return, having missed the previous seven game with a hamstring injury. Jefferson went to a local hospital for evaluation but returned home with the team. Jefferson had two catches for 27 yards against the Raiders, giving him 38 receptions for 598 yards and three touchdowns this season. Running back Alexander Mattison (ankle), receiver Jalen Nailor (concussion) and offensive tackle Brian O’Neill (ankle) did not practice Tuesday. Offensive guard Ed Ingram (hip) and offensive guard Dalton Risner (ankle) were limited.","pubDate":"2023-12-12 23:54:27","image_url":null,"source_id":"profootballtalk","source_priority":267,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"63908a21b1ad5ef5031e3c45edc05e1a","title":"Braeden Carrington to step away from Gophers men’s basketball program","link":"https://www.inforum.com/sports/college/braeden-carrington-to-step-away-from-gophers-mens-basketball-program","keywords":null,"creator":["Andy Greder / St. Paul Pioneer Press"],"video_url":null,"description":"Carrington has played through injuries to start all 10 games for the Gophers.","content":"Gophers sophomore guard Braeden Carrington is taking an indefinite break from the U men’s basketball program to focus on his mental health. “There’s areas of my life I am looking to improve and must step away from the program and put myself first,” Carrington wrote on X on Tuesday. “I plan on returning to the team when the time is right. For now please respect my space and allow me to ultimately do what’s best for me. Thank you Gopher fans.” MORE COLLEGE SPORTS: Ongoing list of Bison football commits for 2024 recruiting class, including decommit headed to Kansas State 1h ago Dragons soar to unprecedented No. 2 ranking in D-II men's basketball poll 1h ago Bison players support Roehl, say Montana the priority this week 2h ago Ohio State retains No. 1 ranking in USA Hockey / The Rink Live women's poll 2h ago Gophers head coach Ben Johnson added in a statement: “We fully support Braeden as he takes this time to focus on his mental health. Myself, our administration and our team will do whatever we can to help him and I admire Braeden for his courage. We will be here to assist him every step of the way.” Carrington has played through injuries to start all 10 games for the Gophers going into Tuesday’s home game against IUPUI. The Brooklyn Park native is the U’s best perimeter defender. He is averaging 5.8 points and 4.7 rebounds in 24.7 minutes per game this season. ADVERTISEMENT Gophers football: Prior Lake defensive lineman Jide Abasiri decommits after USC visit The second shoe has dropped on one of three high school players with questionable commitments to the Gophers football program. Prior Lake defensive lineman Jide Abasiri said Monday he has de-committed from the Gophers recruiting class for 2024. The three-star prospect is coming off a visit to USC last weekend. Abasiri, who is listed at 6-foot-5 and 290 pounds, committed to Minnesota in March. He was set to follow two Prior Lake players to Dinkytown, until the Trojans started showing interest, including a scholarship offer in November. After Abasiri made the announcement, fellow Prior Lake alums turned Gophers, Greg Johnson and Martin Owusu, posted emoji faces with questioning expressions on the social media site X. Minnesota has had five total de-commitments from next year’s class. Two more are feared by the U to be coming down the pike. Esko, Minn., safety Koi Perich visited Ohio State this weekend, while Gaylord, Mich., linebacker Brady Pretzlaff took a trip to Michigan State. Former U defensive coordinator Joe Rossi, who recruited Pretzlaff to Minnesota, is now set to be the Spartans’ new DC. ______________________________________________________ This story was written by one of our partner news agencies. Forum Communications Company uses content from agencies such as Reuters, Kaiser Health News, Tribune News Service and others to provide a wider range of news to our readers. Learn more about the news services FCC uses here . Share Share this article News reporting News reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags MINNESOTA GOLDEN GOPHERS COLLEGE BASKETBALL","pubDate":"2023-12-12 23:53:20","image_url":null,"source_id":"inforum","source_priority":14163,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"71d106be6ada4a23250665b0bd599fe0","title":"Danilo 'out for FOUR MONTHS' as Rangers told it's worst case scenario after striker's injury scan","link":"https://www.dailyrecord.co.uk/sport/football/danilo-out-four-months-rangers-31660791","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Robbie Copeland)"],"video_url":null,"description":"It's reported Danilo will be out until April with his knee injury.","content":"Danilo goes off injured against Hearts (Image: SNS Group) Get the latest Rangers news from Record Sport with our daily newsletter. More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Rangers news from Record Sport with our daily newsletter. Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rangers will be without striker Danilo for four months after scans confirmed the worst case scenario for his knee injury. Danilo went off against Hearts and Philippe Clement had initially been hopeful he would see him back in contention just after the winter break. But according to the Scottish Sun , the 24-year-old has taken a serious blow and will be out until April. It comes after Danilo missed a chunk of the season earlier this year with a facial injury as he's been stricken with bad luck since his £7m move to Rangers . Clement had lamented his back luck on the injury front but he'll now turn to Cyriel Dessers and Kemar Roofe between now and January, when he hopes to recruit a new striker. Even before the extent of Danilo's injury was confirmed, Clement said: “We will look to bring someone in, it will be one of the priorities. But it’s up to the other strikers to show they’re ready. Read More Related Articles Man United branded 'the Celtic of English football' as Jason Cundy claims Hoops are LAUGHING at struggling Ten Hag Read More Related Articles 'Confident' Rangers advertise tickets for fan snaps with Viaplay Cup days BEFORE Aberdeen final “We know that Kemar is just out of an injury also and has a history of consecutive injuries. We need to take that into account, it’s no use just to throw him on the pitch and then he’s out also. “Kemar is not ready to play 90 minutes. I don’t want to put all the pressure on Abdallah to score goals, I expect it from other positions. “I haven’t had a chance to play him as a central striker in training because we haven’t had enough wingers in training. It’s about the players showing they are ready to play for a club like Rangers with all the expectations that brings.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Rangers FC Danilo Philippe Clement Cyriel Dessers Kemar Roofe","pubDate":"2023-12-12 23:51:56","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31633590.ece/ALTERNATES/s615/0_Heart-of-Midlothian-v-Rangers-FC-Cinch-Scottish-Premiership.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ff7c4f33dff2b4b4a15558cfd4124999","title":"AFL in meltdown over spinning wheel of death","link":"https://www.cairnspost.com.au/sport/afl/afl-in-meltdown-over-gather-round-spinning-wheel-of-death/news-story/41630c4259c6f46f7118da6aafca8293","keywords":["AFL","AFL Teams","Sport news and galleries"],"creator":[""],"video_url":null,"description":"Footy fans are in up in arms after the AFL’s Gather Round ticket release descended into a farce this week.","content":"AFL Don't miss out on the headlines from AFL. Followed categories will be added to My News. Footy fans are in up in arms after the AFL’s Gather Round ticket release descended into a farce this week. The second instalment of the hugely successful 2023 event created record interest when tickets went on sale this week. The fixtures for the festival round of football — where all 18 teams will play out of South Australia — from April 4 through to April 7 were released last month. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start Your Free Trial Today > Tickets for three of the blockbuster matches have sold out in record time — including the opening match of the weekend between the Crows and Melbourne at the Adelaide Oval. The AFL announced on Tuesday more than 100,000 tickets were sold during the 24-hour priority window for AFL and club members before tickets were made available to the general public. Collingwood players with Nicky Winmar before their Gather Round match at the Adelaide Oval. Pic: Michael Klein. The suburban stadium clashes at Norwood Oval — Brisbane against North Melbourne and Richmond against St Kilda — have also sold out. Many footy diehard fans missed out on the seats they wanted — and vented their fury after wasting their time on the Ticketek website. It was so nice, we had to do it twice ð Gather Round in South Australia, round four, 2024: https://t.co/zpq9akrEuI pic.twitter.com/nP2eKR3J18 — AFL (@AFL) November 12, 2023 Footy fans on Twitter and Reddit claimed they had been left waiting in the Ticketek “lounge” for more than an hour before striking out on tickets. Others have claimed they received error messages stating that their special membership codes were not valid — and thus were unable to purchase tickets during the special window. The Adelaide Advertiser’s editor at-large Paul Starick described the Ticketek system as a “spinning wheel of death” . After all that, I canât even get my seat, let alone my bay ð¤·ð½ââï¸ @Adelaide_FC https://t.co/1WRsjVNuSM — John (@jbabz84) December 11, 2023 . @Ticketek_AU got in at 12pm yet your system told me my AFL Gather Round barcodes were invalid. I then refresh and at 12:01pm all tickets are sold out. How is this possible? — Jeremy (@JemBeano) December 11, 2023 It would be cheaper to fly to South Australia and watch the AFL Gather Round games in a pub than have to deal with @Ticketek_AU #AFL #GatherRound — Shaegan Vishal î¨ (@shaeganvishal) December 11, 2023 Every second in the Ticketek lounge my anger increases #AFL — Leonardo Puglisi (@Leo_Puglisi6) December 11, 2023 Ticketek on Tuesday night responded to the backlash with a spokesperson telling news.com.au: “The demand for Gather Round tickets for the 2024 AFL season has grown significantly in the Event’s second year, with demand up by over 130 per cent from 2023. “During the pre-sale, we had over 20,000 customers in the Ticketek Lounge to purchase tickets for Gather Round. Customers spent on average 6 minutes in the lounge. GWS vs Hawthorn at Norwood Oval. IMAGE/Russell Millard “The General Public on sale commenced at 12pm ACDT today (Tuesday). Ticket sales peaked at just under 3,000 tickets per minute, which is in line with the fastest AFL on sale to date, and consistent with the demand for recent touring artists Taylor Swift and Coldplay.” The league has made changes to the 2023 Gather round format with two matches to be played in the Adelaide Hills in 2024. Hopes of taking a game to the iconic Barossa Valley wine region fell apart earlier this year, prompting the league to turn back towards the sole game played in Mt Barker in 2023. More Coverage AFL star’s big news is Cornes’ worst nightmare AFL responds after coroner calls for change The AFL will next year play two fixtures at the country football ground, featuring Sydney, West Coast, Gold Coast and GWS. The AFL in April announced Gather Round is staying in Adelaide for three more years with former CEO Gillon McLachlan striking a deal with South Australian Premier Peter Malinauskas. With the host city being widely applauded for its stellar job of creating a party atmosphere in the City of Churches, there was almost no opposition to the “Magic Round” concept returning to Adelaide for the foreseeable future. Originally published as AFL in meltdown over Gather Round spinning wheel of death More related stories AFL Carlton v Collingwood Grand Final: Our way-too-early predictions It was in play deep into 2023, but our experts are predicting two of the AFL’s biggest clubs will face off for all the marbles in 2024. Agree? HAVE YOUR SAY on our 2024 predictions here. Read more AFL Decade of Dees? Melbourne’s ‘10 year’ flag play despite finals flops A bold prediction back in 2020 set the wheels in motion for two premierships and despite some troubles in finals, Melbourne has doubled down on a plan to stay in the flag hunt for the long run. Read more","pubDate":"2023-12-12 23:50:00","image_url":null,"source_id":"cairnspost","source_priority":626680,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0cc5feff18e92f18b7cac6d6b2852b6d","title":"The return of hooliganism is turning European football into a lethal battleground & why English fans are targets","link":"https://www.thesun.ie/sport/11843518/return-hooliganism-european-football/","keywords":["Football","Sport","Champions League","Crime","Europa League","Features","Hooligans","Police","Print Features","The Sun Newspaper","UEFA"],"creator":["Grant Rollings"],"video_url":null,"description":null,"content":"THEY once called it the English disease, but football violence is now damaging the image of the beautiful game across Europe – and spreading to other sports. This week Turkey has stopped all footie matches indefinitely after a referee was punched to the ground on the pitch by a club president. And Greece banned fans from top-flight football games for two months after violence erupted between rival volleyball supporters in Athens, severely injuring a police officer. Meanwhile, France is considering barring away supporters after a fan was stabbed to death ten days ago. In January an Italian motorway was closed when rival supporters piled into each other, and a year ago crowds of Croatia’s Dinamo Zagreb fans delivered Nazi salutes in unison on the streets of Milan. Across the continent, authorities are struggling to control hooliganism — often aimed at travelling English fans, who receive massive police protection as continental supporters try to test their reputation for street brawling. Two months ago in Milan a Newcastle United fan was stabbed in the stomach by a machete-wielding yob in a balaclava. This season was Brighton and Hove Albion’s first taste of competitive European football. But last month in Athens, tear gas aimed by police at riotous fans of the defeated home team AEK ended up choking Brighton supporters. In May, West Ham players tried to intervene when hooded fans of Dutch side AZ Alkmaar piled into the section of the stadium where the English team’s families were sitting. Football’s ruling bodies fear the return of the hooliganism from decades ago, which in 1985 saw English teams banned from Europe for five years after the deaths of 39 mostly Italian fans in the riot at the Heysel Stadium in Brussels. In August Uefa president Aleksander Ceferin said of the violence: “This is the cancer of football and those are not football fans. “We have to say enough, we have to stop this.” Then came Monday’s graphic display of football’s ugly side. Faruk Koca , president of Turkish side MKE Ankaragucu , ran on to the pitch and struck referee Halil Umut Meler in the face, landing him in hospital. The Turkish Football Federation then indefinitely postponed all games. Turkey’s “ultra fans” are notorious for carrying weapons, supposedly to kill opponents. Fenerbahce has a fan group called Kill For You, and in 2000 Galatasaray hooligans stabbed two Leeds United fans to death. There are also stringent new fan restrictions in neighbouring Greece, where on Monday the government announced that teams would have to play in empty stadiums. It followed two deaths in bloody clashes between supporters this year alone. In February a 19-year-old student was bludgeoned to death in Thessaloniki just for saying he supported a rival team, then in August a 29-year-old AEK Athens supporter was stabbed to death by a Dinamo Zagreb thug. And not having matches to attend might not even stop the violence, as fan rivalry spreads between sports. The ban on football fans came after police were attacked with flares, stones and petrol bombs outside an Athens volleyball stadium last week after a match between Olympiakos and Panathinaikos , who are also bitter football foes. Government spokesman Pavlos Marinakis said: “For years, criminals in the guise of fans have been committing serious crimes by critically injuring and killing people.” Brighton fans experienced those crazed elements at the end of last month in the Greek capital. The police tried to subdue rioting AEK Athens yobs with tear gas at the end of the game, but it drifted over to the away fans as well, and some Brighton fans had to be treated by paramedics. Life-long Seagulls fan Mike Purser, 54, told The Sun: “They tear-gassed their fans who were waiting for us to come out. “It blew back into the stadium. They locked us in and wouldn’t let us go down, but as soon as it happened, they took us down and gave us water.” The previous month in Marseille , the risk of things turning ugly meant Brighton fans had to be closely guarded. The French side’s ultras have attacked their own training ground and have a reputation for being the country’s most rabid fans. Property developer Mike continued: “Marseille was like a military performance to get to the ground. We had to be there three or four hours before kick-off. “Coming out was a palaver because they wouldn’t let us go down into the concourse. People were struggling because it was so hot and I saw some people passing out.” In September three men were arrested outside a Glasgow hostel after fans of Rangers and Spanish side Real Betis clashed following their Europa League match in the city. The fighting saw windows smashed and security locking the hostel with Betis fans inside in a bid to bring the violence to an end. Tartan Army fans have a reputation for being boisterous but well-behaved, with recent flashpoints on foreign trips emerging when police target supporters. Footage of a Spanish cop beating a Scotland fan emerged ahead of the side’s Euro 2024 qualifier in Seville in October. In February French police came in for criticism when Uefa said that Liverpool and Real Madrid fans could have died because the 2022 Champions League final in Paris was handled so badly by heavy-handed cops. The authorities already ban away fans from historically troublesome games, but may go further after a Nantes fan died during a fight with Nice supporters earlier this month . Trouble often breaks out away from stadiums. Newcastle fan Eddie McKay, 58, was slashed three times as he walked to his Milan hotel before his side played AC Milan . It is not uncommon for thugs to find out which bars the English fans are drinking in and to arrive spoiling for a fight. West Ham supporter Alfie Barker, 33, believes English fans are targeted. He said: “Two Belgian fans came up to me and my brother in a Brussels bar and asked, ‘Do you want a fight?’ We said no, but they didn’t go away. “It was just because we were speaking English. We weren’t wearing West Ham kits — I never have the team’s colours on in Europe.” West Ham supporters have seen a lot of trouble on the European mainland in the past couple of years. Eintracht Frankfurt fans were filmed charging towards Hammers supporters in a Seville bar in March 2022, Belgian side Anderlecht apologised for their fans throwing seats at West Ham supporters in October that year and at the AFAS Stadion in Alkmaar, Holland in May, the club’s fans were assaulted in their seats. West Ham boss David Moyes said after the Alkmaar game: “Was I worried? Yeah, my family were there and I had friends in that section.” Eintracht’s yobs are developing an unsavoury reputation. This year 50 German police officers were injured by them in Frankfurt and cars were set alight when they clashed with cops in Naples, even though they had been banned from Napoli’s stadium. But West Ham supporters also got into trouble for throwing objects on to the pitch in Genk, Belgium, and setting off flares in Prague. And there are certainly signs that the “English disease” is making a comeback in Britain. Last season the police made the highest number of arrests at football matches in England and Wales for nearly a decade. In 2022-23 there were 2,264 football-related arrests, up 66 on the previous figure, and the worst since 2013-14. There have been several pitch invasions, including one in January in which Arsenal keeper Aaron Ramsdale was kicked in the back. There was also great shame at the Euro 2020 final two years ago when England fans tried to storm into Wembley Stadium. But the most violent disturbance at a game in recent years in England was arguably the one at Villa Park in Birmingham at the end of November. Fans from Polish side Legia Warsaw threw flares at police and attacked their horses. Unless clubs across the Continent can stamp out the rising tide of often organised unrest, families will be afraid to attend matches, while some fans won’t go to Europe for fear of ending up bloodied or bruised. For supporters who are not used to the hooliganism of the 1980s it has been a shock. West Ham fan Alfie added: “I didn’t see trouble at matches until we went into Europe.”","pubDate":"2023-12-13 00:05:22","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/faruk-koca-president-mke-ankaragucu-865657999-1.jpg?strip=all&w=960","source_id":"thesun_ie","source_priority":45285,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"57fe9283b7614e96484d1b69ea016e86","title":"The return of hooliganism is turning European football into a lethal battleground & why English fans are targets","link":"https://www.thescottishsun.co.uk/sport/11650028/return-hooliganism-european-football/","keywords":["Football","Sport","Champions League","Crime","Police","The Sun Newspaper"],"creator":["Grant Rollings"],"video_url":null,"description":null,"content":"THEY once called it the English disease, but football violence is now damaging the image of the beautiful game across Europe – and spreading to other sports. This week Turkey has stopped all footie matches indefinitely after a referee was punched to the ground on the pitch by a club president. 11 Referee Halil Umut Meler is clobbered by Faruk Koca Credit: Getty 11 Ref Meler holds his face as Koca looks on Credit: EPA 11 Meler was in hospital after the attack Credit: Getty 11 President of the Turkish team MKE Ankaragücü, at the end of Monday’s game Credit: Getty And Greece banned fans from top-flight football games for two months after violence erupted between rival volleyball supporters in Athens, severely injuring a police officer. Meanwhile, France is considering barring away supporters after a fan was stabbed to death ten days ago. In January an Italian motorway was closed when rival supporters piled into each other, and a year ago crowds of Croatia’s Dinamo Zagreb fans delivered Nazi salutes in unison on the streets of Milan. Across the continent, authorities are struggling to control hooliganism — often aimed at travelling English fans, who receive massive police protection as continental supporters try to test their reputation for street brawling. Two months ago in Milan a Newcastle United fan was stabbed in the stomach by a machete-wielding yob in a balaclava. This season was Brighton and Hove Albion’s first taste of competitive European football. But last month in Athens, tear gas aimed by police at riotous fans of the defeated home team AEK ended up choking Brighton supporters. In May, West Ham players tried to intervene when hooded fans of Dutch side AZ Alkmaar piled into the section of the stadium where the English team’s families were sitting. Most read in Football TO BE FRANK Ex-Rangers star sacked as boss by two clubs after total of just NINETEEN games IN THE MIX Gers in three-horse race for Everton ace Holgate as Toffees eye loan recall move IT'S A VARCE It's incredible Rangers haven't conceded penalty since I retired jokes Brown SECRECY ROW SNP 'kept lid on Scotland's top cop's driving scandal for three weeks' Football’s ruling bodies fear the return of the hooliganism from decades ago, which in 1985 saw English teams banned from Europe for five years after the deaths of 39 mostly Italian fans in the riot at the Heysel Stadium in Brussels. In August Uefa president Aleksander Ceferin said of the violence: “This is the cancer of football and those are not football fans. “We have to say enough, we have to stop this.” Then came Monday’s graphic display of football’s ugly side. Faruk Koca , president of Turkish side MKE Ankaragucu , ran on to the pitch and struck referee Halil Umut Meler in the face, landing him in hospital. The Turkish Football Federation then indefinitely postponed all games. Turkey’s “ultra fans” are notorious for carrying weapons, supposedly to kill opponents. Fenerbahce has a fan group called Kill For You, and in 2000 Galatasaray hooligans stabbed two Leeds United fans to death. Empty stadiums There are also stringent new fan restrictions in neighbouring Greece, where on Monday the government announced that teams would have to play in empty stadiums. It followed two deaths in bloody clashes between supporters this year alone. In February a 19-year-old student was bludgeoned to death in Thessaloniki just for saying he supported a rival team, then in August a 29-year-old AEK Athens supporter was stabbed to death by a Dinamo Zagreb thug. And not having matches to attend might not even stop the violence, as fan rivalry spreads between sports. The ban on football fans came after police were attacked with flares, stones and petrol bombs outside an Athens volleyball stadium last week after a match between Olympiakos and Panathinaikos , who are also bitter football foes. Government spokesman Pavlos Marinakis said: “For years, criminals in the guise of fans have been committing serious crimes by critically injuring and killing people.” Brighton fans experienced those crazed elements at the end of last month in the Greek capital. The police tried to subdue rioting AEK Athens yobs with tear gas at the end of the game, but it drifted over to the away fans as well, and some Brighton fans had to be treated by paramedics. 11 Dinamo Zagreb thugs give the Nazi salute on a march last year in Milan Credit: Twitter 11 Legia Warsaw mob throw flares at police and horses last month at Aston Villa Credit: Reuters Life-long Seagulls fan Mike Purser, 54, told The Sun: “They tear-gassed their fans who were waiting for us to come out. “It blew back into the stadium. They locked us in and wouldn’t let us go down, but as soon as it happened, they took us down and gave us water.” The previous month in Marseille, the risk of things turning ugly meant Brighton fans had to be closely guarded. The French side’s ultras have attacked their own training ground and have a reputation for being the country’s most rabid fans. Property developer Mike continued: “Marseille was like a military performance to get to the ground. We had to be there three or four hours before kick-off. “Coming out was a palaver because they wouldn’t let us go down into the concourse. People were struggling because it was so hot and I saw some people passing out.” In September three men were arrested outside a Glasgow hostel after fans of Rangers and Spanish side Real Betis clashed following their Europa League match in the city. The fighting saw windows smashed and security locking the hostel with Betis fans inside in a bid to bring the violence to an end. Tartan Army fans have a reputation for being boisterous but well-behaved, with recent flashpoints on foreign trips emerging when police target supporters. Footage of a Spanish cop beating a Scotland fan emerged ahead of the side’s Euro 2024 qualifier in Seville in October. In February French police came in for criticism when Uefa said that Liverpool and Real Madrid fans could have died because the 2022 Champions League final in Paris was handled so badly by heavy-handed cops. The authorities already ban away fans from historically troublesome games, but may go further after a Nantes fan died during a fight with Nice supporters earlier this month . 11 Clash in Naples as police come under attack from Eintracht Frankfurt yobs in March Credit: Rex 11 Trouble after a hooded AZ Alkmaar gang charged Hammers fans Credit: Getty Trouble often breaks out away from stadiums. Newcastle fan Eddie McKay, 58, was slashed three times as he walked to his Milan hotel before his side played AC Milan . It is not uncommon for thugs to find out which bars the English fans are drinking in and to arrive spoiling for a fight. West Ham supporter Alfie Barker, 33, believes English fans are targeted. He said: “Two Belgian fans came up to me and my brother in a Brussels bar and asked, ‘Do you want a fight?’ We said no, but they didn’t go away. “It was just because we were speaking English. We weren’t wearing West Ham kits — I never have the team’s colours on in Europe.” West Ham supporters have seen a lot of trouble on the European mainland in the past couple of years. Eintracht Frankfurt fans were filmed charging towards Hammers supporters in a Seville bar in March 2022, Belgian side Anderlecht apologised for their fans throwing seats at West Ham supporters in October that year and at the AFAS Stadion in Alkmaar, Holland in May, the club’s fans were assaulted in their seats. West Ham boss David Moyes said after the Alkmaar game: “Was I worried? Yeah, my family were there and I had friends in that section.” Eintracht’s yobs are developing an unsavoury reputation. This year 50 German police officers were injured by them in Frankfurt and cars were set alight when they clashed with cops in Naples, even though they had been banned from Napoli’s stadium. But West Ham supporters also got into trouble for throwing objects on to the pitch in Genk, Belgium, and setting off flares in Prague. 11 Hammers fan Alfie Barker said: 'I didn’t see trouble at matches until we went into Europe' Credit: The West Ham Way Channel/Youtube And there are certainly signs that the “English disease” is making a comeback in Britain. Last season the police made the highest number of arrests at football matches in England and Wales for nearly a decade. In 2022-23 there were 2,264 football-related arrests, up 66 on the previous figure, and the worst since 2013-14. There have been several pitch invasions, including one in January in which Arsenal keeper Aaron Ramsdale was kicked in the back. There was also great shame at the Euro 2020 final two years ago when England fans tried to storm into Wembley Stadium. But the most violent disturbance at a game in recent years in England was arguably the one at Villa Park in Birmingham at the end of November. Fans from Polish side Legia Warsaw threw flares at police and attacked their horses. Unless clubs across the Continent can stamp out the rising tide of often organised unrest, families will be afraid to attend matches, while some fans won’t go to Europe for fear of ending up bloodied or bruised. Read more on the Scottish Sun PERFECT FIT I have big boobs and I'm skinny, finding sports bras is a hot mess, until now AISLE SAY Me & my husband don’t share a bed for a good reason - our marriage isn't over For supporters who are not used to the hooliganism of the 1980s it has been a shock. West Ham fan Alfie added: “I didn’t see trouble at matches until we went into Europe.” 11 A PSV Eindhoven fan waves a flare at a Dutch league game Credit: AFP 11 Panathinaikos fans with their traditional display of pyrotechnics Credit: Getty","pubDate":"2023-12-13 00:05:22","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/faruk-koca-president-mke-ankaragucu-865657999-1.jpg?strip=all&w=960","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ea23a8d06ac9cd8819ac0beff0baffa4","title":"Mercato : Il prive le PSG d’un attaquant et jubile","link":"https://le10sport.com/football/mercato/mercato-il-prive-le-psg-dun-attaquant-et-jubile-675284","keywords":null,"creator":null,"video_url":null,"description":"En fin de contrat avec le Borussia Mönchengladbach en fin de saison dernière, Marcus Thuram aurait pu être l’un des gros coups du Paris Saint-Germain selon nos informations. L’attaquant français a…","content":"En fin de contrat avec le Borussia Mönchengladbach en fin de saison dernière, Marcus Thuram aurait pu être l’un des gros coups du Paris Saint-Germain selon nos informations. L’attaquant français a finalement décidé de poursuivre sa carrière en Serie A du côté de l’Inter, où il semble déjà faire l’unanimité. Luis Campos a réalisé d'excellentes choses pendant le dernier mercato estival, mais il aurait pu faire mieux. Nous vous avons en effet révélé sur le10sport.com que le Portugais a connu plusieurs échecs au PSG , notamment avec une star montante de l’ équipe de France de Didier Deschamps . PSG : Il glisse déjà un nom pour succéder à Luis Enrique https://t.co/0WpqHqYnD1 pic.twitter.com/KI7hQOjXwX Il s’agit de Marcus Thuram , qui était un coup extrêmement intéressant, puisqu’il était libre de tout contrat cet été. Mais il a finalement snobé le PSG ainsi que son ami Kylian Mbappé pour choisir l’ Inter , comme il l’a récemment confié. « Il sait très bien pourquoi je ne suis pas venu à Paris (...) C’était une question de feeling. L’Inter était-là il y a deux ans. L’Inter m’a toujours vu comme un numéro 9 et donc c’était un choix limpide » a expliqué le joueur, dans un entretien diffusé sur Canal+ . Et si le PSG se mord les doigts d’être passé à côté de ce coup, du côté de l’ Inter on est aux anges, surtout avec les prestations plus qu’abouties de Marcus Thuram depuis le début de la saison. Interrogé sur cette opération ce mardi, Giuseppe Marotta a d’ailleurs tenu à féliciter son directeur sportif. « Thuram a été une grande intuition de Piero Ausilio » a déclaré l’administrateur délégué de l’Inter, au micro de Sky Sport « Nous l'avons soutenu et nous sommes tous contents de ce qu'il fait. Il a un grand potentiel et peut jouer un rôle encore plus important que ce qu'il fait actuellement ».","pubDate":"2023-12-13 00:00:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/222312.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b001c5c6bd2a8fc3b3fccc2b0d990f87","title":"Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race","link":"https://www.dailymail.co.uk/sport/football/article-12856749/Declan-Rice-Arsenal-emergency-centre-back.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The England international has been an ever-present in midfield for his new side, helping them in another Premier League title chase and to the top of their group in the Champions League.","content":"Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race Rice played half an hour in defence for Arsenal against PSV coming off the bench William Saliba and Gabriel started the game as injury issues start to mount again CHRIS SUTTON: I was RIGHT to call Man United players ‘snakes’ last week - IAKO By Lewis Browning For Mailonline Published: 17:32 EST, 12 December 2023 | Updated: 18:58 EST, 12 December 2023 e-mail 5 View comments Mikel Arteta has revealed that he is willing to use Declan Rice in defence as an 'emergency'. Rice has been one of the signings of the season in the Premier League after joining the Gunners for £105million from West Ham . The England international has been an ever-present in midfield for his new side, helping them in another Premier League title chase and to the top of their group in the Champions League . Arsenal have had a relatively drama-free campaign so far, but are prepared should they hit any stumbling blocks as they look to win their first Premier League title since 2004. After his side drew 1-1 with PSV in their final Champions League group game , Arteta praised Rice and revealed his plans for the 24-year-old going forward following an experiment on Tuesday. Declan Rice (pictured) is Arsenal's 'emergency' centre back, Mikel Arteta has confirmed Rice played half an hour in defence for Arsenal during their Champions League game against PSV on Tuesday Arteta (pictured) said Rice is 'a good option' to cover at the back if needed for the Gunners Your browser does not support iframes. 'We are very short at the back and I really wanted to try if something happens, how we're going to resolve that situation,' he said. 'I thought he was really good. 'He has played there before. We have to try as if we have an emergency we have to understand and to be sure that we can fill that gap in the right way. 'He has a lot of composure on the ball, he wins a lot of duels for a player of his size and he has done it in the past. He is a good option.' Rice played half an hour at centre back for Arsenal against PSV, coming on as a substitute for William Saliba with the group already won before the game. Gabriel (left) and William Saliba (right) have been Arsenal's first-choice defendive pair but injuries are starting to pile up Jurrien Timber is one of the defenders who are currently out injured for Arsenal, with similar happening last year IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement Arsenal have had to deal with injuries to the likes of Jurrien Timber and Takehiro Tomiyasu, meaning Saliba and Gabriel started the game in the Netherlands despite it meaning nothing. Ben White and Jakub Kiwior can also play in the middle of defence, but it seems Arteta prefers them in wide defensive positions, with Kiwior starting at left back and White coming on and playing right back in the game. Arsenal's title hopes were dealt a blow last year when Saliba suffered an injury and Rob Holding was forced to deputise before being dropped for Kiwior. Arteta will hope his side are better prepared for any issues this term, however, with Rice able to cover on the right side on the defence if needed. Champions League Mikel Arteta Share or comment on this article: Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-12 23:58:21","image_url":"https://i.dailymail.co.uk/1s/2023/12/12/23/78890065-0-image-a-51_1702422611125.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"94737c0169abf66383187308deb6305e","title":"Tommy DeVito’s legendary Giants story is Linsanity all over again with one big difference","link":"https://nypost.com/2023/12/12/sports/tommy-devito-is-linsanity-all-over-again-with-one-big-difference/","keywords":null,"creator":["Mike Vaccaro"],"video_url":null,"description":"In some ways it is unfair to compare what DeVito has done to what Jeremy Lin did during the peak of his phenomena in the winter of 2012, and we’ll get to that later. But in some ways, some impossible-to-dispute ways, it’s as if we’re merely seeing an old movie remade.","content":"It is important to remember just how profound the despair was, before. It is essential to consider how all the joy of a season had been drained from the Giants, how all the optimism of last year had dissolved in a slovenly pile of injuries and sloppy play and general failure. Incompetence had led to inconsequence. And when that happens, a franchise buckles and bleeds. The Giants were buckled, figuratively and literally, when Tommy DeVito trotted onto the field to replace Tyrod Taylor on the grim afternoon of Oct. 29 at MetLife Stadium, and they were bleeding when he did the same in relief of Daniel Jones a week later inside the sterile milieu of Las Vegas’ Allegiant Stadium. And look at them now. Look at him now. “It’s his job,” Giants coach Brian Daboll said after Monday’s scintillating 24-22 win over Green Bay. “Calm. Cool. Poised. Collected,” said Saquon Barkley. “Let’s go win the game,” The Man himself told his teammates in the huddle with 93 seconds left Monday night, trailing by one. “It’s on us, on the offense.” In truth, it was on him, and he not only accepted that burden, he relished it. And then delivered. In so many ways this seems like a Frank Merriwell once-in-a-lifetime story. And yet in some ways it feels remarkably familiar, especially if you remember almost a dozen years back, on the other side of the Hudson River. In some ways it is unfair to compare what DeVito has done to what Jeremy Lin did during the peak of his phenomena in the winter of 2012, and we’ll get to that later. But in some ways, some impossible-to-dispute ways, it’s as if we’re merely seeing an old movie remade, the names and the sports changed to protect the innocent, a retelling of “Rudy” starring Tanner Buchanan instead of Sean Astin. “It felt like we were hovering because that’s how loud and energetic this was, and it was a magical moment. I’ve never experienced something like that before or after.” That’s Jeremy Lin, speaking in the terrific short documentary available on MAX, “38 at the Garden,” recalling the moment when Linsanity reached its irrefutable apex: the evening of Feb. 10, 2012, inside Madison Square Garden. The Knicks were playing the Lakers, Kobe Bryant’s annual trip to New York City. The Lin phenomenon was only six days old, but it was already something. That night it became Something. That night, he dropped 38 points on 13-for-23 shooting, added seven assists. Prior to the game, Mamba had said, “I don’t even know what he’s done.” Lin gave him an up-close demonstration. And the Garden shook from its foundation across the final seven minutes straight of the Knicks’ 92-85 win. MetLife Stadium was occupied by too many Packers fans, abandoned by too many Giants fans who opted against a late Monday night commitment, so the thunder might not have equaled what happened at the Garden back in 2012. But the ones who stayed tried to carry the night. And just as Knicks fans helped deliver Lin, so would Giants fans help supply DeVito with maximum mojo, one critical completion after another on the final drive. “It’s just basketball,” Lin said before the increasingly swollen media brigade in 2012. “You try do it the same way as you did in college or high school or on the playground. You try to keep it simple.” “It’s just football,” Tommy DeVito said late Monday night. “You try to go score on every drive.” This is the latest parallel. There are so many others. Let’s start where this column started: The Giants forced to send their third-string quarterback in against the Jets, allowing him one forever moment — a touchdown run that gave the Giants a lead — but then vapor-locked him in Bubble Wrap, kept him that way the rest of the game, kept it on him when they needed to summon him the following week in Vegas. And … well, the times he was allowed to throw those first few weeks, you thought you understood why. He’d played plenty in college at big-shot schools Syracuse and Illinois. He’d been a high school star just up the road at Don Bosco Prep. He threw two TD passes against Dallas in his first start, but by then the Cowboys were mostly playing their walk-ons in a 49-17 bludgeoning. He looked overmatched. He looked, in truth, the way Jeremy Lin looked his first nine games as a Knick in 2011-12: 3.6 points per game, 40 percent shooting, only one attempt from 3. He was so timid that when he played at all, Mike D’Antoni didn’t just use the Bubble Wrap, he practically asked him to play in a Hazmat suit. Lin was so sure he was about to be released that one morning in Miami, weeks before his emergence, he attended the Heat’s pregame chapel service. At one point, the congregants were asked if they had any special intentions. One hand was raised. “What do you want to pray for?” the chaplain asked. “Not to get cut again,” Jeremy Lin said. It all started for Lin on a Saturday night, Feb. 4, 25 points against the Nets at the Garden. Beforehand, a friend had advised: “No holding back. Be Jeremy Lin tonight.” In “38 at the Garden” Lin said, “Getting into the shower afterward I didn’t know if it was water from the shower or tears in my eyes but I was like: ‘They can’t cut me now. They can’t cut me now. ‘They can’t cut me now.’ ” Lin had come to the Garden from his brother’s apartment, where he was staying on the couch; DeVito came to practice the week before his first start in Washington from his parents’ house in Cedar Grove, where he sleeps on his childhood bed. He threw three TDs that day. Since being overmatched against Dallas, he’s 3-0 and has thrown five TDs, zero picks, completed 72 percent of his passes, has a rating of 119.8. One last similarity: In the same way Jeremy Lin’s swagger multiplied every time he played in the winter of 2012, so has Tommy DeVito’s in the fall of 2023. “He loves the game of football,” Daboll said. “I think when you deal with the guy, I don’t think he makes it bigger than it is, either.” There would be worse things for Tommy DeVito than to take this quirky symmetry the distance, you know. Lin played nine years in the NBA, won a championship with Toronto in his last year, earned somewhere in the neighborhood of $65 million. At 35 years old, he is still playing alongside his brother, Joseph, for the New Taipei Kings in the Taiwan pro league. He’s averaging 21 points a game for the 7-0, first-place Kings. In its entirety, what we know as Linsanity lasted only 19 days, from the moment he checked into the game against the Nets until the Heat of LeBron/Wade/Bosch made it their mission to bully him into a 1-for-11, eight-turnover nightmare in Miami. He had some fine games after that, then got hurt, and had some terrific games with the Rockets, with the Lakers, with the Hornets and the Nets, the Hawks and the Raptors. Fine. But not a phenom. DeVito has an entire football life before him. At worst, he can probably bank on being a 10- to 12-year backup in the NFL now. Josh McCown earned $52.3 million that way — and the price for competent quarterbacking will never go down. At best? Well, put it this way. Brian Daboll fielded his first few questions Tuesday drawing him into a different comparison, this one concerning an out-of-nowhere quarterback he used to coach, a fellow by the name of Brady. “We’re four games in,” he replied. “But I do appreciate the question.” The rest of us can simply appreciate DeVito’s football homage to Lin, which as of Wednesday will celebrate its 23rd day, already four days longer than Linsanity lasted. At some point, he’ll earn his own name for it; his preference would probably be, simply, “veteran NFL quarterback.” For now, we’ll enjoy. It’s been a long time. How long? Remember the night Jeremy Lin magically dropped out of the sky against the Nets? That was the night before the Giants won their last Super Bowl. That’s how long.","pubDate":"2023-12-12 23:56:44","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-erw0tsjpe-1702424494098.jpg?quality=90&strip=all&1702406605","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"eb84da45f6191cb7e5aa5fc20a46018e","title":"Man United and Sevilla tumble out of European competition after Champions League losses","link":"https://www.winnipegfreepress.com/sports/soccer/2023/12/12/man-united-and-sevilla-tumble-out-of-european-competition-after-champions-league-losses","keywords":["Soccer"],"creator":["Jerome Pugmire, The Associated Press"],"video_url":null,"description":"PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Both teams were eliminated from […]","content":"PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Read this article for free: Already have an account? To continue reading, please subscribe: * PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Both teams were eliminated from European competition Tuesday night to finish bottom of their groups. Three-time Champions League winner United needed to beat Bayern Munich at home and hope for a favorable result in the other Group A game but lost 1-0 to the six-time winner. Instead, unheralded Danish side Copenhagen qualified in second place after beating Turkish team Galatasaray 1-0 at home. Galatasaray finished third to qualify for the Europa League knockout round playoff above last-place United — which sustained 4-3 losses at Bayern and Copenhagen and conceded 15 goals in six games. It is only the fourth time a Premier League team has finished bottom of its Champions League group. Earlier on, defending Europa League champion Sevilla — which has won the Europa League seven times — lost 2-1 at Lens to finish bottom of Group B as the French team finished third. Fans started leaving 10 minutes before the end at Old Trafford and others booed United’s players at the final whistle to heap the pressure on manager Erik Ten Hag. After winger Kingsley Coman neatly scored Bayern’s goal in the 71st minute, the away fans goaded United’s supporters with a rendition of “Football’s Coming Home” — a popular English soccer chant coined at the 1996 European Championship, where England lost to Germany in the semifinals — followed by “Auf Wiedersehen!” (So Long!). Ten Hag saw burly central defender Harry Maguire limping off near the end of the first half after appearing to injure his groin. United was punished when striker Harry Kane set up Coman as Bayern cut through a static defense with ease. Over in Denmark, midfielder Lukas Lerager scored for Copenhagen in the 58th. Coach Jacob Neestrup sprinted onto the field to celebrate with his jubilant players at the end. Italian champion Napoli advanced to the last 16 after beating Portuguese side Braga 2-0 at home to finish second in Group C, which had already been won by Real Madrid. African player of the year Victor Osimhen, who last season helped Napoli to its first Italian league title in 33 years, got Napoli’s second goal to continue his return to form. There was a rare soccer sight when veteran Croatia midfielder Luka Modric — the 2018 men’s Ballon d’Or winner — missed a penalty as Madrid fell behind but won 3-2 at Union Berlin. Forward Joselu scored twice as record 14-time champion Madrid finished with a perfect record. Braga finished third to reach the Europa League playoff. Last year’s Champions League runner-up Inter Milan and Spanish club Real Sociedad had already qualified from Group D and drew 0-0 in Italy, meaning Sociedad topped the group on goal difference. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. Arthur Cabral’s backheel goal in stoppage time gave Benfica a 3-1 win at Austrian side Salzburg in the other game to secure a place in the Europa League playoffs. In the other early match, striker Eddie Nketiah scored his first Champions League goal as Group B winner Arsenal drew 1-1 at second-place PSV Eindhoven in a match between qualified teams. Group winners are seeded in the last-16 draw on Dec. 18 and avoid each other. Teams also cannot be drawn against an opponent from their own country. The Europa League draw is held the same day. ___ AP soccer: https://apnews.com/hub/Soccer Advertisement Advertisement","pubDate":"2023-12-12 23:54:59","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"45442aa7d2bd6c895fd2a547d1bbffd1","title":"Justin Jefferson limited in Tuesday's practice","link":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/justin-jefferson-limited-in-tuesdays-practice","keywords":null,"creator":null,"video_url":null,"description":"Vikings receiver Justin Jefferson has a chest injury that knocked him out of Sunday's game against the Raiders.","content":"Vikings receiver Justin Jefferson has a chest injury that knocked him out of Sunday’s game against the Raiders. Coach Kevin O’Connell called Jefferson day to day on Monday. On Tuesday, the Vikings listed Jefferson as limited in practice. He played only 13 of 72 snaps Sunday in his return, having missed the previous seven game with a hamstring injury. Jefferson went to a local hospital for evaluation but returned home with the team. Jefferson had two catches for 27 yards against the Raiders, giving him 38 receptions for 598 yards and three touchdowns this season. Running back Alexander Mattison (ankle), receiver Jalen Nailor (concussion) and offensive tackle Brian O’Neill (ankle) did not practice Tuesday. Offensive guard Ed Ingram (hip) and offensive guard Dalton Risner (ankle) were limited.","pubDate":"2023-12-12 23:54:27","image_url":null,"source_id":"profootballtalk","source_priority":267,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"63908a21b1ad5ef5031e3c45edc05e1a","title":"Braeden Carrington to step away from Gophers men’s basketball program","link":"https://www.inforum.com/sports/college/braeden-carrington-to-step-away-from-gophers-mens-basketball-program","keywords":null,"creator":["Andy Greder / St. Paul Pioneer Press"],"video_url":null,"description":"Carrington has played through injuries to start all 10 games for the Gophers.","content":"Gophers sophomore guard Braeden Carrington is taking an indefinite break from the U men’s basketball program to focus on his mental health. “There’s areas of my life I am looking to improve and must step away from the program and put myself first,” Carrington wrote on X on Tuesday. “I plan on returning to the team when the time is right. For now please respect my space and allow me to ultimately do what’s best for me. Thank you Gopher fans.” MORE COLLEGE SPORTS: Ongoing list of Bison football commits for 2024 recruiting class, including decommit headed to Kansas State 1h ago Dragons soar to unprecedented No. 2 ranking in D-II men's basketball poll 1h ago Bison players support Roehl, say Montana the priority this week 2h ago Ohio State retains No. 1 ranking in USA Hockey / The Rink Live women's poll 2h ago Gophers head coach Ben Johnson added in a statement: “We fully support Braeden as he takes this time to focus on his mental health. Myself, our administration and our team will do whatever we can to help him and I admire Braeden for his courage. We will be here to assist him every step of the way.” Carrington has played through injuries to start all 10 games for the Gophers going into Tuesday’s home game against IUPUI. The Brooklyn Park native is the U’s best perimeter defender. He is averaging 5.8 points and 4.7 rebounds in 24.7 minutes per game this season. ADVERTISEMENT Gophers football: Prior Lake defensive lineman Jide Abasiri decommits after USC visit The second shoe has dropped on one of three high school players with questionable commitments to the Gophers football program. Prior Lake defensive lineman Jide Abasiri said Monday he has de-committed from the Gophers recruiting class for 2024. The three-star prospect is coming off a visit to USC last weekend. Abasiri, who is listed at 6-foot-5 and 290 pounds, committed to Minnesota in March. He was set to follow two Prior Lake players to Dinkytown, until the Trojans started showing interest, including a scholarship offer in November. After Abasiri made the announcement, fellow Prior Lake alums turned Gophers, Greg Johnson and Martin Owusu, posted emoji faces with questioning expressions on the social media site X. Minnesota has had five total de-commitments from next year’s class. Two more are feared by the U to be coming down the pike. Esko, Minn., safety Koi Perich visited Ohio State this weekend, while Gaylord, Mich., linebacker Brady Pretzlaff took a trip to Michigan State. Former U defensive coordinator Joe Rossi, who recruited Pretzlaff to Minnesota, is now set to be the Spartans’ new DC. ______________________________________________________ This story was written by one of our partner news agencies. Forum Communications Company uses content from agencies such as Reuters, Kaiser Health News, Tribune News Service and others to provide a wider range of news to our readers. Learn more about the news services FCC uses here . Share Share this article News reporting News reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags MINNESOTA GOLDEN GOPHERS COLLEGE BASKETBALL","pubDate":"2023-12-12 23:53:20","image_url":null,"source_id":"inforum","source_priority":14163,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"71d106be6ada4a23250665b0bd599fe0","title":"Danilo 'out for FOUR MONTHS' as Rangers told it's worst case scenario after striker's injury scan","link":"https://www.dailyrecord.co.uk/sport/football/danilo-out-four-months-rangers-31660791","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Robbie Copeland)"],"video_url":null,"description":"It's reported Danilo will be out until April with his knee injury.","content":"Danilo goes off injured against Hearts (Image: SNS Group) Get the latest Rangers news from Record Sport with our daily newsletter. More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Rangers news from Record Sport with our daily newsletter. Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rangers will be without striker Danilo for four months after scans confirmed the worst case scenario for his knee injury. Danilo went off against Hearts and Philippe Clement had initially been hopeful he would see him back in contention just after the winter break. But according to the Scottish Sun , the 24-year-old has taken a serious blow and will be out until April. It comes after Danilo missed a chunk of the season earlier this year with a facial injury as he's been stricken with bad luck since his £7m move to Rangers . Clement had lamented his back luck on the injury front but he'll now turn to Cyriel Dessers and Kemar Roofe between now and January, when he hopes to recruit a new striker. Even before the extent of Danilo's injury was confirmed, Clement said: “We will look to bring someone in, it will be one of the priorities. But it’s up to the other strikers to show they’re ready. Read More Related Articles Man United branded 'the Celtic of English football' as Jason Cundy claims Hoops are LAUGHING at struggling Ten Hag Read More Related Articles 'Confident' Rangers advertise tickets for fan snaps with Viaplay Cup days BEFORE Aberdeen final “We know that Kemar is just out of an injury also and has a history of consecutive injuries. We need to take that into account, it’s no use just to throw him on the pitch and then he’s out also. “Kemar is not ready to play 90 minutes. I don’t want to put all the pressure on Abdallah to score goals, I expect it from other positions. “I haven’t had a chance to play him as a central striker in training because we haven’t had enough wingers in training. It’s about the players showing they are ready to play for a club like Rangers with all the expectations that brings.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Rangers FC Danilo Philippe Clement Cyriel Dessers Kemar Roofe","pubDate":"2023-12-12 23:51:56","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31633590.ece/ALTERNATES/s615/0_Heart-of-Midlothian-v-Rangers-FC-Cinch-Scottish-Premiership.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ff7c4f33dff2b4b4a15558cfd4124999","title":"AFL in meltdown over spinning wheel of death","link":"https://www.cairnspost.com.au/sport/afl/afl-in-meltdown-over-gather-round-spinning-wheel-of-death/news-story/41630c4259c6f46f7118da6aafca8293","keywords":["AFL","AFL Teams","Sport news and galleries"],"creator":[""],"video_url":null,"description":"Footy fans are in up in arms after the AFL’s Gather Round ticket release descended into a farce this week.","content":"AFL Don't miss out on the headlines from AFL. Followed categories will be added to My News. Footy fans are in up in arms after the AFL’s Gather Round ticket release descended into a farce this week. The second instalment of the hugely successful 2023 event created record interest when tickets went on sale this week. The fixtures for the festival round of football — where all 18 teams will play out of South Australia — from April 4 through to April 7 were released last month. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start Your Free Trial Today > Tickets for three of the blockbuster matches have sold out in record time — including the opening match of the weekend between the Crows and Melbourne at the Adelaide Oval. The AFL announced on Tuesday more than 100,000 tickets were sold during the 24-hour priority window for AFL and club members before tickets were made available to the general public. Collingwood players with Nicky Winmar before their Gather Round match at the Adelaide Oval. Pic: Michael Klein. The suburban stadium clashes at Norwood Oval — Brisbane against North Melbourne and Richmond against St Kilda — have also sold out. Many footy diehard fans missed out on the seats they wanted — and vented their fury after wasting their time on the Ticketek website. It was so nice, we had to do it twice ð Gather Round in South Australia, round four, 2024: https://t.co/zpq9akrEuI pic.twitter.com/nP2eKR3J18 — AFL (@AFL) November 12, 2023 Footy fans on Twitter and Reddit claimed they had been left waiting in the Ticketek “lounge” for more than an hour before striking out on tickets. Others have claimed they received error messages stating that their special membership codes were not valid — and thus were unable to purchase tickets during the special window. The Adelaide Advertiser’s editor at-large Paul Starick described the Ticketek system as a “spinning wheel of death” . After all that, I canât even get my seat, let alone my bay ð¤·ð½ââï¸ @Adelaide_FC https://t.co/1WRsjVNuSM — John (@jbabz84) December 11, 2023 . @Ticketek_AU got in at 12pm yet your system told me my AFL Gather Round barcodes were invalid. I then refresh and at 12:01pm all tickets are sold out. How is this possible? — Jeremy (@JemBeano) December 11, 2023 It would be cheaper to fly to South Australia and watch the AFL Gather Round games in a pub than have to deal with @Ticketek_AU #AFL #GatherRound — Shaegan Vishal î¨ (@shaeganvishal) December 11, 2023 Every second in the Ticketek lounge my anger increases #AFL — Leonardo Puglisi (@Leo_Puglisi6) December 11, 2023 Ticketek on Tuesday night responded to the backlash with a spokesperson telling news.com.au: “The demand for Gather Round tickets for the 2024 AFL season has grown significantly in the Event’s second year, with demand up by over 130 per cent from 2023. “During the pre-sale, we had over 20,000 customers in the Ticketek Lounge to purchase tickets for Gather Round. Customers spent on average 6 minutes in the lounge. GWS vs Hawthorn at Norwood Oval. IMAGE/Russell Millard “The General Public on sale commenced at 12pm ACDT today (Tuesday). Ticket sales peaked at just under 3,000 tickets per minute, which is in line with the fastest AFL on sale to date, and consistent with the demand for recent touring artists Taylor Swift and Coldplay.” The league has made changes to the 2023 Gather round format with two matches to be played in the Adelaide Hills in 2024. Hopes of taking a game to the iconic Barossa Valley wine region fell apart earlier this year, prompting the league to turn back towards the sole game played in Mt Barker in 2023. More Coverage AFL star’s big news is Cornes’ worst nightmare AFL responds after coroner calls for change The AFL will next year play two fixtures at the country football ground, featuring Sydney, West Coast, Gold Coast and GWS. The AFL in April announced Gather Round is staying in Adelaide for three more years with former CEO Gillon McLachlan striking a deal with South Australian Premier Peter Malinauskas. With the host city being widely applauded for its stellar job of creating a party atmosphere in the City of Churches, there was almost no opposition to the “Magic Round” concept returning to Adelaide for the foreseeable future. Originally published as AFL in meltdown over Gather Round spinning wheel of death More related stories AFL Carlton v Collingwood Grand Final: Our way-too-early predictions It was in play deep into 2023, but our experts are predicting two of the AFL’s biggest clubs will face off for all the marbles in 2024. Agree? HAVE YOUR SAY on our 2024 predictions here. Read more AFL Decade of Dees? Melbourne’s ‘10 year’ flag play despite finals flops A bold prediction back in 2020 set the wheels in motion for two premierships and despite some troubles in finals, Melbourne has doubled down on a plan to stay in the flag hunt for the long run. Read more","pubDate":"2023-12-12 23:50:00","image_url":null,"source_id":"cairnspost","source_priority":626680,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0cc5feff18e92f18b7cac6d6b2852b6d","title":"The return of hooliganism is turning European football into a lethal battleground & why English fans are targets","link":"https://www.thesun.ie/sport/11843518/return-hooliganism-european-football/","keywords":["Football","Sport","Champions League","Crime","Europa League","Features","Hooligans","Police","Print Features","The Sun Newspaper","UEFA"],"creator":["Grant Rollings"],"video_url":null,"description":null,"content":"THEY once called it the English disease, but football violence is now damaging the image of the beautiful game across Europe – and spreading to other sports. This week Turkey has stopped all footie matches indefinitely after a referee was punched to the ground on the pitch by a club president. And Greece banned fans from top-flight football games for two months after violence erupted between rival volleyball supporters in Athens, severely injuring a police officer. Meanwhile, France is considering barring away supporters after a fan was stabbed to death ten days ago. In January an Italian motorway was closed when rival supporters piled into each other, and a year ago crowds of Croatia’s Dinamo Zagreb fans delivered Nazi salutes in unison on the streets of Milan. Across the continent, authorities are struggling to control hooliganism — often aimed at travelling English fans, who receive massive police protection as continental supporters try to test their reputation for street brawling. Two months ago in Milan a Newcastle United fan was stabbed in the stomach by a machete-wielding yob in a balaclava. This season was Brighton and Hove Albion’s first taste of competitive European football. But last month in Athens, tear gas aimed by police at riotous fans of the defeated home team AEK ended up choking Brighton supporters. In May, West Ham players tried to intervene when hooded fans of Dutch side AZ Alkmaar piled into the section of the stadium where the English team’s families were sitting. Football’s ruling bodies fear the return of the hooliganism from decades ago, which in 1985 saw English teams banned from Europe for five years after the deaths of 39 mostly Italian fans in the riot at the Heysel Stadium in Brussels. In August Uefa president Aleksander Ceferin said of the violence: “This is the cancer of football and those are not football fans. “We have to say enough, we have to stop this.” Then came Monday’s graphic display of football’s ugly side. Faruk Koca , president of Turkish side MKE Ankaragucu , ran on to the pitch and struck referee Halil Umut Meler in the face, landing him in hospital. The Turkish Football Federation then indefinitely postponed all games. Turkey’s “ultra fans” are notorious for carrying weapons, supposedly to kill opponents. Fenerbahce has a fan group called Kill For You, and in 2000 Galatasaray hooligans stabbed two Leeds United fans to death. There are also stringent new fan restrictions in neighbouring Greece, where on Monday the government announced that teams would have to play in empty stadiums. It followed two deaths in bloody clashes between supporters this year alone. In February a 19-year-old student was bludgeoned to death in Thessaloniki just for saying he supported a rival team, then in August a 29-year-old AEK Athens supporter was stabbed to death by a Dinamo Zagreb thug. And not having matches to attend might not even stop the violence, as fan rivalry spreads between sports. The ban on football fans came after police were attacked with flares, stones and petrol bombs outside an Athens volleyball stadium last week after a match between Olympiakos and Panathinaikos , who are also bitter football foes. Government spokesman Pavlos Marinakis said: “For years, criminals in the guise of fans have been committing serious crimes by critically injuring and killing people.” Brighton fans experienced those crazed elements at the end of last month in the Greek capital. The police tried to subdue rioting AEK Athens yobs with tear gas at the end of the game, but it drifted over to the away fans as well, and some Brighton fans had to be treated by paramedics. Life-long Seagulls fan Mike Purser, 54, told The Sun: “They tear-gassed their fans who were waiting for us to come out. “It blew back into the stadium. They locked us in and wouldn’t let us go down, but as soon as it happened, they took us down and gave us water.” The previous month in Marseille , the risk of things turning ugly meant Brighton fans had to be closely guarded. The French side’s ultras have attacked their own training ground and have a reputation for being the country’s most rabid fans. Property developer Mike continued: “Marseille was like a military performance to get to the ground. We had to be there three or four hours before kick-off. “Coming out was a palaver because they wouldn’t let us go down into the concourse. People were struggling because it was so hot and I saw some people passing out.” In September three men were arrested outside a Glasgow hostel after fans of Rangers and Spanish side Real Betis clashed following their Europa League match in the city. The fighting saw windows smashed and security locking the hostel with Betis fans inside in a bid to bring the violence to an end. Tartan Army fans have a reputation for being boisterous but well-behaved, with recent flashpoints on foreign trips emerging when police target supporters. Footage of a Spanish cop beating a Scotland fan emerged ahead of the side’s Euro 2024 qualifier in Seville in October. In February French police came in for criticism when Uefa said that Liverpool and Real Madrid fans could have died because the 2022 Champions League final in Paris was handled so badly by heavy-handed cops. The authorities already ban away fans from historically troublesome games, but may go further after a Nantes fan died during a fight with Nice supporters earlier this month . Trouble often breaks out away from stadiums. Newcastle fan Eddie McKay, 58, was slashed three times as he walked to his Milan hotel before his side played AC Milan . It is not uncommon for thugs to find out which bars the English fans are drinking in and to arrive spoiling for a fight. West Ham supporter Alfie Barker, 33, believes English fans are targeted. He said: “Two Belgian fans came up to me and my brother in a Brussels bar and asked, ‘Do you want a fight?’ We said no, but they didn’t go away. “It was just because we were speaking English. We weren’t wearing West Ham kits — I never have the team’s colours on in Europe.” West Ham supporters have seen a lot of trouble on the European mainland in the past couple of years. Eintracht Frankfurt fans were filmed charging towards Hammers supporters in a Seville bar in March 2022, Belgian side Anderlecht apologised for their fans throwing seats at West Ham supporters in October that year and at the AFAS Stadion in Alkmaar, Holland in May, the club’s fans were assaulted in their seats. West Ham boss David Moyes said after the Alkmaar game: “Was I worried? Yeah, my family were there and I had friends in that section.” Eintracht’s yobs are developing an unsavoury reputation. This year 50 German police officers were injured by them in Frankfurt and cars were set alight when they clashed with cops in Naples, even though they had been banned from Napoli’s stadium. But West Ham supporters also got into trouble for throwing objects on to the pitch in Genk, Belgium, and setting off flares in Prague. And there are certainly signs that the “English disease” is making a comeback in Britain. Last season the police made the highest number of arrests at football matches in England and Wales for nearly a decade. In 2022-23 there were 2,264 football-related arrests, up 66 on the previous figure, and the worst since 2013-14. There have been several pitch invasions, including one in January in which Arsenal keeper Aaron Ramsdale was kicked in the back. There was also great shame at the Euro 2020 final two years ago when England fans tried to storm into Wembley Stadium. But the most violent disturbance at a game in recent years in England was arguably the one at Villa Park in Birmingham at the end of November. Fans from Polish side Legia Warsaw threw flares at police and attacked their horses. Unless clubs across the Continent can stamp out the rising tide of often organised unrest, families will be afraid to attend matches, while some fans won’t go to Europe for fear of ending up bloodied or bruised. For supporters who are not used to the hooliganism of the 1980s it has been a shock. West Ham fan Alfie added: “I didn’t see trouble at matches until we went into Europe.”","pubDate":"2023-12-13 00:05:22","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/faruk-koca-president-mke-ankaragucu-865657999-1.jpg?strip=all&w=960","source_id":"thesun_ie","source_priority":45285,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"57fe9283b7614e96484d1b69ea016e86","title":"The return of hooliganism is turning European football into a lethal battleground & why English fans are targets","link":"https://www.thescottishsun.co.uk/sport/11650028/return-hooliganism-european-football/","keywords":["Football","Sport","Champions League","Crime","Police","The Sun Newspaper"],"creator":["Grant Rollings"],"video_url":null,"description":null,"content":"THEY once called it the English disease, but football violence is now damaging the image of the beautiful game across Europe – and spreading to other sports. This week Turkey has stopped all footie matches indefinitely after a referee was punched to the ground on the pitch by a club president. 11 Referee Halil Umut Meler is clobbered by Faruk Koca Credit: Getty 11 Ref Meler holds his face as Koca looks on Credit: EPA 11 Meler was in hospital after the attack Credit: Getty 11 President of the Turkish team MKE Ankaragücü, at the end of Monday’s game Credit: Getty And Greece banned fans from top-flight football games for two months after violence erupted between rival volleyball supporters in Athens, severely injuring a police officer. Meanwhile, France is considering barring away supporters after a fan was stabbed to death ten days ago. In January an Italian motorway was closed when rival supporters piled into each other, and a year ago crowds of Croatia’s Dinamo Zagreb fans delivered Nazi salutes in unison on the streets of Milan. Across the continent, authorities are struggling to control hooliganism — often aimed at travelling English fans, who receive massive police protection as continental supporters try to test their reputation for street brawling. Two months ago in Milan a Newcastle United fan was stabbed in the stomach by a machete-wielding yob in a balaclava. This season was Brighton and Hove Albion’s first taste of competitive European football. But last month in Athens, tear gas aimed by police at riotous fans of the defeated home team AEK ended up choking Brighton supporters. In May, West Ham players tried to intervene when hooded fans of Dutch side AZ Alkmaar piled into the section of the stadium where the English team’s families were sitting. Most read in Football TO BE FRANK Ex-Rangers star sacked as boss by two clubs after total of just NINETEEN games IN THE MIX Gers in three-horse race for Everton ace Holgate as Toffees eye loan recall move IT'S A VARCE It's incredible Rangers haven't conceded penalty since I retired jokes Brown SECRECY ROW SNP 'kept lid on Scotland's top cop's driving scandal for three weeks' Football’s ruling bodies fear the return of the hooliganism from decades ago, which in 1985 saw English teams banned from Europe for five years after the deaths of 39 mostly Italian fans in the riot at the Heysel Stadium in Brussels. In August Uefa president Aleksander Ceferin said of the violence: “This is the cancer of football and those are not football fans. “We have to say enough, we have to stop this.” Then came Monday’s graphic display of football’s ugly side. Faruk Koca , president of Turkish side MKE Ankaragucu , ran on to the pitch and struck referee Halil Umut Meler in the face, landing him in hospital. The Turkish Football Federation then indefinitely postponed all games. Turkey’s “ultra fans” are notorious for carrying weapons, supposedly to kill opponents. Fenerbahce has a fan group called Kill For You, and in 2000 Galatasaray hooligans stabbed two Leeds United fans to death. Empty stadiums There are also stringent new fan restrictions in neighbouring Greece, where on Monday the government announced that teams would have to play in empty stadiums. It followed two deaths in bloody clashes between supporters this year alone. In February a 19-year-old student was bludgeoned to death in Thessaloniki just for saying he supported a rival team, then in August a 29-year-old AEK Athens supporter was stabbed to death by a Dinamo Zagreb thug. And not having matches to attend might not even stop the violence, as fan rivalry spreads between sports. The ban on football fans came after police were attacked with flares, stones and petrol bombs outside an Athens volleyball stadium last week after a match between Olympiakos and Panathinaikos , who are also bitter football foes. Government spokesman Pavlos Marinakis said: “For years, criminals in the guise of fans have been committing serious crimes by critically injuring and killing people.” Brighton fans experienced those crazed elements at the end of last month in the Greek capital. The police tried to subdue rioting AEK Athens yobs with tear gas at the end of the game, but it drifted over to the away fans as well, and some Brighton fans had to be treated by paramedics. 11 Dinamo Zagreb thugs give the Nazi salute on a march last year in Milan Credit: Twitter 11 Legia Warsaw mob throw flares at police and horses last month at Aston Villa Credit: Reuters Life-long Seagulls fan Mike Purser, 54, told The Sun: “They tear-gassed their fans who were waiting for us to come out. “It blew back into the stadium. They locked us in and wouldn’t let us go down, but as soon as it happened, they took us down and gave us water.” The previous month in Marseille, the risk of things turning ugly meant Brighton fans had to be closely guarded. The French side’s ultras have attacked their own training ground and have a reputation for being the country’s most rabid fans. Property developer Mike continued: “Marseille was like a military performance to get to the ground. We had to be there three or four hours before kick-off. “Coming out was a palaver because they wouldn’t let us go down into the concourse. People were struggling because it was so hot and I saw some people passing out.” In September three men were arrested outside a Glasgow hostel after fans of Rangers and Spanish side Real Betis clashed following their Europa League match in the city. The fighting saw windows smashed and security locking the hostel with Betis fans inside in a bid to bring the violence to an end. Tartan Army fans have a reputation for being boisterous but well-behaved, with recent flashpoints on foreign trips emerging when police target supporters. Footage of a Spanish cop beating a Scotland fan emerged ahead of the side’s Euro 2024 qualifier in Seville in October. In February French police came in for criticism when Uefa said that Liverpool and Real Madrid fans could have died because the 2022 Champions League final in Paris was handled so badly by heavy-handed cops. The authorities already ban away fans from historically troublesome games, but may go further after a Nantes fan died during a fight with Nice supporters earlier this month . 11 Clash in Naples as police come under attack from Eintracht Frankfurt yobs in March Credit: Rex 11 Trouble after a hooded AZ Alkmaar gang charged Hammers fans Credit: Getty Trouble often breaks out away from stadiums. Newcastle fan Eddie McKay, 58, was slashed three times as he walked to his Milan hotel before his side played AC Milan . It is not uncommon for thugs to find out which bars the English fans are drinking in and to arrive spoiling for a fight. West Ham supporter Alfie Barker, 33, believes English fans are targeted. He said: “Two Belgian fans came up to me and my brother in a Brussels bar and asked, ‘Do you want a fight?’ We said no, but they didn’t go away. “It was just because we were speaking English. We weren’t wearing West Ham kits — I never have the team’s colours on in Europe.” West Ham supporters have seen a lot of trouble on the European mainland in the past couple of years. Eintracht Frankfurt fans were filmed charging towards Hammers supporters in a Seville bar in March 2022, Belgian side Anderlecht apologised for their fans throwing seats at West Ham supporters in October that year and at the AFAS Stadion in Alkmaar, Holland in May, the club’s fans were assaulted in their seats. West Ham boss David Moyes said after the Alkmaar game: “Was I worried? Yeah, my family were there and I had friends in that section.” Eintracht’s yobs are developing an unsavoury reputation. This year 50 German police officers were injured by them in Frankfurt and cars were set alight when they clashed with cops in Naples, even though they had been banned from Napoli’s stadium. But West Ham supporters also got into trouble for throwing objects on to the pitch in Genk, Belgium, and setting off flares in Prague. 11 Hammers fan Alfie Barker said: 'I didn’t see trouble at matches until we went into Europe' Credit: The West Ham Way Channel/Youtube And there are certainly signs that the “English disease” is making a comeback in Britain. Last season the police made the highest number of arrests at football matches in England and Wales for nearly a decade. In 2022-23 there were 2,264 football-related arrests, up 66 on the previous figure, and the worst since 2013-14. There have been several pitch invasions, including one in January in which Arsenal keeper Aaron Ramsdale was kicked in the back. There was also great shame at the Euro 2020 final two years ago when England fans tried to storm into Wembley Stadium. But the most violent disturbance at a game in recent years in England was arguably the one at Villa Park in Birmingham at the end of November. Fans from Polish side Legia Warsaw threw flares at police and attacked their horses. Unless clubs across the Continent can stamp out the rising tide of often organised unrest, families will be afraid to attend matches, while some fans won’t go to Europe for fear of ending up bloodied or bruised. Read more on the Scottish Sun PERFECT FIT I have big boobs and I'm skinny, finding sports bras is a hot mess, until now AISLE SAY Me & my husband don’t share a bed for a good reason - our marriage isn't over For supporters who are not used to the hooliganism of the 1980s it has been a shock. West Ham fan Alfie added: “I didn’t see trouble at matches until we went into Europe.” 11 A PSV Eindhoven fan waves a flare at a Dutch league game Credit: AFP 11 Panathinaikos fans with their traditional display of pyrotechnics Credit: Getty","pubDate":"2023-12-13 00:05:22","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/faruk-koca-president-mke-ankaragucu-865657999-1.jpg?strip=all&w=960","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ea23a8d06ac9cd8819ac0beff0baffa4","title":"Mercato : Il prive le PSG d’un attaquant et jubile","link":"https://le10sport.com/football/mercato/mercato-il-prive-le-psg-dun-attaquant-et-jubile-675284","keywords":null,"creator":null,"video_url":null,"description":"En fin de contrat avec le Borussia Mönchengladbach en fin de saison dernière, Marcus Thuram aurait pu être l’un des gros coups du Paris Saint-Germain selon nos informations. L’attaquant français a…","content":"En fin de contrat avec le Borussia Mönchengladbach en fin de saison dernière, Marcus Thuram aurait pu être l’un des gros coups du Paris Saint-Germain selon nos informations. L’attaquant français a finalement décidé de poursuivre sa carrière en Serie A du côté de l’Inter, où il semble déjà faire l’unanimité. Luis Campos a réalisé d'excellentes choses pendant le dernier mercato estival, mais il aurait pu faire mieux. Nous vous avons en effet révélé sur le10sport.com que le Portugais a connu plusieurs échecs au PSG , notamment avec une star montante de l’ équipe de France de Didier Deschamps . PSG : Il glisse déjà un nom pour succéder à Luis Enrique https://t.co/0WpqHqYnD1 pic.twitter.com/KI7hQOjXwX Il s’agit de Marcus Thuram , qui était un coup extrêmement intéressant, puisqu’il était libre de tout contrat cet été. Mais il a finalement snobé le PSG ainsi que son ami Kylian Mbappé pour choisir l’ Inter , comme il l’a récemment confié. « Il sait très bien pourquoi je ne suis pas venu à Paris (...) C’était une question de feeling. L’Inter était-là il y a deux ans. L’Inter m’a toujours vu comme un numéro 9 et donc c’était un choix limpide » a expliqué le joueur, dans un entretien diffusé sur Canal+ . Et si le PSG se mord les doigts d’être passé à côté de ce coup, du côté de l’ Inter on est aux anges, surtout avec les prestations plus qu’abouties de Marcus Thuram depuis le début de la saison. Interrogé sur cette opération ce mardi, Giuseppe Marotta a d’ailleurs tenu à féliciter son directeur sportif. « Thuram a été une grande intuition de Piero Ausilio » a déclaré l’administrateur délégué de l’Inter, au micro de Sky Sport « Nous l'avons soutenu et nous sommes tous contents de ce qu'il fait. Il a un grand potentiel et peut jouer un rôle encore plus important que ce qu'il fait actuellement ».","pubDate":"2023-12-13 00:00:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/222312.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b001c5c6bd2a8fc3b3fccc2b0d990f87","title":"Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race","link":"https://www.dailymail.co.uk/sport/football/article-12856749/Declan-Rice-Arsenal-emergency-centre-back.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The England international has been an ever-present in midfield for his new side, helping them in another Premier League title chase and to the top of their group in the Champions League.","content":"Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race Rice played half an hour in defence for Arsenal against PSV coming off the bench William Saliba and Gabriel started the game as injury issues start to mount again CHRIS SUTTON: I was RIGHT to call Man United players ‘snakes’ last week - IAKO By Lewis Browning For Mailonline Published: 17:32 EST, 12 December 2023 | Updated: 18:58 EST, 12 December 2023 e-mail 5 View comments Mikel Arteta has revealed that he is willing to use Declan Rice in defence as an 'emergency'. Rice has been one of the signings of the season in the Premier League after joining the Gunners for £105million from West Ham . The England international has been an ever-present in midfield for his new side, helping them in another Premier League title chase and to the top of their group in the Champions League . Arsenal have had a relatively drama-free campaign so far, but are prepared should they hit any stumbling blocks as they look to win their first Premier League title since 2004. After his side drew 1-1 with PSV in their final Champions League group game , Arteta praised Rice and revealed his plans for the 24-year-old going forward following an experiment on Tuesday. Declan Rice (pictured) is Arsenal's 'emergency' centre back, Mikel Arteta has confirmed Rice played half an hour in defence for Arsenal during their Champions League game against PSV on Tuesday Arteta (pictured) said Rice is 'a good option' to cover at the back if needed for the Gunners Your browser does not support iframes. 'We are very short at the back and I really wanted to try if something happens, how we're going to resolve that situation,' he said. 'I thought he was really good. 'He has played there before. We have to try as if we have an emergency we have to understand and to be sure that we can fill that gap in the right way. 'He has a lot of composure on the ball, he wins a lot of duels for a player of his size and he has done it in the past. He is a good option.' Rice played half an hour at centre back for Arsenal against PSV, coming on as a substitute for William Saliba with the group already won before the game. Gabriel (left) and William Saliba (right) have been Arsenal's first-choice defendive pair but injuries are starting to pile up Jurrien Timber is one of the defenders who are currently out injured for Arsenal, with similar happening last year IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement Arsenal have had to deal with injuries to the likes of Jurrien Timber and Takehiro Tomiyasu, meaning Saliba and Gabriel started the game in the Netherlands despite it meaning nothing. Ben White and Jakub Kiwior can also play in the middle of defence, but it seems Arteta prefers them in wide defensive positions, with Kiwior starting at left back and White coming on and playing right back in the game. Arsenal's title hopes were dealt a blow last year when Saliba suffered an injury and Rob Holding was forced to deputise before being dropped for Kiwior. Arteta will hope his side are better prepared for any issues this term, however, with Rice able to cover on the right side on the defence if needed. Champions League Mikel Arteta Share or comment on this article: Declan Rice is Arsenal's 'emergency centre back', Mikel Arteta reveals after the midfielder plays in defence during PSV draw... with Gunners looking to avoid repeat of injury issues from last season's title race e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-12 23:58:21","image_url":"https://i.dailymail.co.uk/1s/2023/12/12/23/78890065-0-image-a-51_1702422611125.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"94737c0169abf66383187308deb6305e","title":"Tommy DeVito’s legendary Giants story is Linsanity all over again with one big difference","link":"https://nypost.com/2023/12/12/sports/tommy-devito-is-linsanity-all-over-again-with-one-big-difference/","keywords":null,"creator":["Mike Vaccaro"],"video_url":null,"description":"In some ways it is unfair to compare what DeVito has done to what Jeremy Lin did during the peak of his phenomena in the winter of 2012, and we’ll get to that later. But in some ways, some impossible-to-dispute ways, it’s as if we’re merely seeing an old movie remade.","content":"It is important to remember just how profound the despair was, before. It is essential to consider how all the joy of a season had been drained from the Giants, how all the optimism of last year had dissolved in a slovenly pile of injuries and sloppy play and general failure. Incompetence had led to inconsequence. And when that happens, a franchise buckles and bleeds. The Giants were buckled, figuratively and literally, when Tommy DeVito trotted onto the field to replace Tyrod Taylor on the grim afternoon of Oct. 29 at MetLife Stadium, and they were bleeding when he did the same in relief of Daniel Jones a week later inside the sterile milieu of Las Vegas’ Allegiant Stadium. And look at them now. Look at him now. “It’s his job,” Giants coach Brian Daboll said after Monday’s scintillating 24-22 win over Green Bay. “Calm. Cool. Poised. Collected,” said Saquon Barkley. “Let’s go win the game,” The Man himself told his teammates in the huddle with 93 seconds left Monday night, trailing by one. “It’s on us, on the offense.” In truth, it was on him, and he not only accepted that burden, he relished it. And then delivered. In so many ways this seems like a Frank Merriwell once-in-a-lifetime story. And yet in some ways it feels remarkably familiar, especially if you remember almost a dozen years back, on the other side of the Hudson River. In some ways it is unfair to compare what DeVito has done to what Jeremy Lin did during the peak of his phenomena in the winter of 2012, and we’ll get to that later. But in some ways, some impossible-to-dispute ways, it’s as if we’re merely seeing an old movie remade, the names and the sports changed to protect the innocent, a retelling of “Rudy” starring Tanner Buchanan instead of Sean Astin. “It felt like we were hovering because that’s how loud and energetic this was, and it was a magical moment. I’ve never experienced something like that before or after.” That’s Jeremy Lin, speaking in the terrific short documentary available on MAX, “38 at the Garden,” recalling the moment when Linsanity reached its irrefutable apex: the evening of Feb. 10, 2012, inside Madison Square Garden. The Knicks were playing the Lakers, Kobe Bryant’s annual trip to New York City. The Lin phenomenon was only six days old, but it was already something. That night it became Something. That night, he dropped 38 points on 13-for-23 shooting, added seven assists. Prior to the game, Mamba had said, “I don’t even know what he’s done.” Lin gave him an up-close demonstration. And the Garden shook from its foundation across the final seven minutes straight of the Knicks’ 92-85 win. MetLife Stadium was occupied by too many Packers fans, abandoned by too many Giants fans who opted against a late Monday night commitment, so the thunder might not have equaled what happened at the Garden back in 2012. But the ones who stayed tried to carry the night. And just as Knicks fans helped deliver Lin, so would Giants fans help supply DeVito with maximum mojo, one critical completion after another on the final drive. “It’s just basketball,” Lin said before the increasingly swollen media brigade in 2012. “You try do it the same way as you did in college or high school or on the playground. You try to keep it simple.” “It’s just football,” Tommy DeVito said late Monday night. “You try to go score on every drive.” This is the latest parallel. There are so many others. Let’s start where this column started: The Giants forced to send their third-string quarterback in against the Jets, allowing him one forever moment — a touchdown run that gave the Giants a lead — but then vapor-locked him in Bubble Wrap, kept him that way the rest of the game, kept it on him when they needed to summon him the following week in Vegas. And … well, the times he was allowed to throw those first few weeks, you thought you understood why. He’d played plenty in college at big-shot schools Syracuse and Illinois. He’d been a high school star just up the road at Don Bosco Prep. He threw two TD passes against Dallas in his first start, but by then the Cowboys were mostly playing their walk-ons in a 49-17 bludgeoning. He looked overmatched. He looked, in truth, the way Jeremy Lin looked his first nine games as a Knick in 2011-12: 3.6 points per game, 40 percent shooting, only one attempt from 3. He was so timid that when he played at all, Mike D’Antoni didn’t just use the Bubble Wrap, he practically asked him to play in a Hazmat suit. Lin was so sure he was about to be released that one morning in Miami, weeks before his emergence, he attended the Heat’s pregame chapel service. At one point, the congregants were asked if they had any special intentions. One hand was raised. “What do you want to pray for?” the chaplain asked. “Not to get cut again,” Jeremy Lin said. It all started for Lin on a Saturday night, Feb. 4, 25 points against the Nets at the Garden. Beforehand, a friend had advised: “No holding back. Be Jeremy Lin tonight.” In “38 at the Garden” Lin said, “Getting into the shower afterward I didn’t know if it was water from the shower or tears in my eyes but I was like: ‘They can’t cut me now. They can’t cut me now. ‘They can’t cut me now.’ ” Lin had come to the Garden from his brother’s apartment, where he was staying on the couch; DeVito came to practice the week before his first start in Washington from his parents’ house in Cedar Grove, where he sleeps on his childhood bed. He threw three TDs that day. Since being overmatched against Dallas, he’s 3-0 and has thrown five TDs, zero picks, completed 72 percent of his passes, has a rating of 119.8. One last similarity: In the same way Jeremy Lin’s swagger multiplied every time he played in the winter of 2012, so has Tommy DeVito’s in the fall of 2023. “He loves the game of football,” Daboll said. “I think when you deal with the guy, I don’t think he makes it bigger than it is, either.” There would be worse things for Tommy DeVito than to take this quirky symmetry the distance, you know. Lin played nine years in the NBA, won a championship with Toronto in his last year, earned somewhere in the neighborhood of $65 million. At 35 years old, he is still playing alongside his brother, Joseph, for the New Taipei Kings in the Taiwan pro league. He’s averaging 21 points a game for the 7-0, first-place Kings. In its entirety, what we know as Linsanity lasted only 19 days, from the moment he checked into the game against the Nets until the Heat of LeBron/Wade/Bosch made it their mission to bully him into a 1-for-11, eight-turnover nightmare in Miami. He had some fine games after that, then got hurt, and had some terrific games with the Rockets, with the Lakers, with the Hornets and the Nets, the Hawks and the Raptors. Fine. But not a phenom. DeVito has an entire football life before him. At worst, he can probably bank on being a 10- to 12-year backup in the NFL now. Josh McCown earned $52.3 million that way — and the price for competent quarterbacking will never go down. At best? Well, put it this way. Brian Daboll fielded his first few questions Tuesday drawing him into a different comparison, this one concerning an out-of-nowhere quarterback he used to coach, a fellow by the name of Brady. “We’re four games in,” he replied. “But I do appreciate the question.” The rest of us can simply appreciate DeVito’s football homage to Lin, which as of Wednesday will celebrate its 23rd day, already four days longer than Linsanity lasted. At some point, he’ll earn his own name for it; his preference would probably be, simply, “veteran NFL quarterback.” For now, we’ll enjoy. It’s been a long time. How long? Remember the night Jeremy Lin magically dropped out of the sky against the Nets? That was the night before the Giants won their last Super Bowl. That’s how long.","pubDate":"2023-12-12 23:56:44","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-erw0tsjpe-1702424494098.jpg?quality=90&strip=all&1702406605","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"eb84da45f6191cb7e5aa5fc20a46018e","title":"Man United and Sevilla tumble out of European competition after Champions League losses","link":"https://www.winnipegfreepress.com/sports/soccer/2023/12/12/man-united-and-sevilla-tumble-out-of-european-competition-after-champions-league-losses","keywords":["Soccer"],"creator":["Jerome Pugmire, The Associated Press"],"video_url":null,"description":"PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Both teams were eliminated from […]","content":"PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Read this article for free: Already have an account? To continue reading, please subscribe: * PARIS (AP) — The Champions League proved too tough for Manchester United and Sevilla. Now, even the consolation Europa League spot is out of reach. Both teams were eliminated from European competition Tuesday night to finish bottom of their groups. Three-time Champions League winner United needed to beat Bayern Munich at home and hope for a favorable result in the other Group A game but lost 1-0 to the six-time winner. Instead, unheralded Danish side Copenhagen qualified in second place after beating Turkish team Galatasaray 1-0 at home. Galatasaray finished third to qualify for the Europa League knockout round playoff above last-place United — which sustained 4-3 losses at Bayern and Copenhagen and conceded 15 goals in six games. It is only the fourth time a Premier League team has finished bottom of its Champions League group. Earlier on, defending Europa League champion Sevilla — which has won the Europa League seven times — lost 2-1 at Lens to finish bottom of Group B as the French team finished third. Fans started leaving 10 minutes before the end at Old Trafford and others booed United’s players at the final whistle to heap the pressure on manager Erik Ten Hag. After winger Kingsley Coman neatly scored Bayern’s goal in the 71st minute, the away fans goaded United’s supporters with a rendition of “Football’s Coming Home” — a popular English soccer chant coined at the 1996 European Championship, where England lost to Germany in the semifinals — followed by “Auf Wiedersehen!” (So Long!). Ten Hag saw burly central defender Harry Maguire limping off near the end of the first half after appearing to injure his groin. United was punished when striker Harry Kane set up Coman as Bayern cut through a static defense with ease. Over in Denmark, midfielder Lukas Lerager scored for Copenhagen in the 58th. Coach Jacob Neestrup sprinted onto the field to celebrate with his jubilant players at the end. Italian champion Napoli advanced to the last 16 after beating Portuguese side Braga 2-0 at home to finish second in Group C, which had already been won by Real Madrid. African player of the year Victor Osimhen, who last season helped Napoli to its first Italian league title in 33 years, got Napoli’s second goal to continue his return to form. There was a rare soccer sight when veteran Croatia midfielder Luka Modric — the 2018 men’s Ballon d’Or winner — missed a penalty as Madrid fell behind but won 3-2 at Union Berlin. Forward Joselu scored twice as record 14-time champion Madrid finished with a perfect record. Braga finished third to reach the Europa League playoff. Last year’s Champions League runner-up Inter Milan and Spanish club Real Sociedad had already qualified from Group D and drew 0-0 in Italy, meaning Sociedad topped the group on goal difference. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. Arthur Cabral’s backheel goal in stoppage time gave Benfica a 3-1 win at Austrian side Salzburg in the other game to secure a place in the Europa League playoffs. In the other early match, striker Eddie Nketiah scored his first Champions League goal as Group B winner Arsenal drew 1-1 at second-place PSV Eindhoven in a match between qualified teams. Group winners are seeded in the last-16 draw on Dec. 18 and avoid each other. Teams also cannot be drawn against an opponent from their own country. The Europa League draw is held the same day. ___ AP soccer: https://apnews.com/hub/Soccer Advertisement Advertisement","pubDate":"2023-12-12 23:54:59","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"45442aa7d2bd6c895fd2a547d1bbffd1","title":"Justin Jefferson limited in Tuesday's practice","link":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/justin-jefferson-limited-in-tuesdays-practice","keywords":null,"creator":null,"video_url":null,"description":"Vikings receiver Justin Jefferson has a chest injury that knocked him out of Sunday's game against the Raiders.","content":"Vikings receiver Justin Jefferson has a chest injury that knocked him out of Sunday’s game against the Raiders. Coach Kevin O’Connell called Jefferson day to day on Monday. On Tuesday, the Vikings listed Jefferson as limited in practice. He played only 13 of 72 snaps Sunday in his return, having missed the previous seven game with a hamstring injury. Jefferson went to a local hospital for evaluation but returned home with the team. Jefferson had two catches for 27 yards against the Raiders, giving him 38 receptions for 598 yards and three touchdowns this season. Running back Alexander Mattison (ankle), receiver Jalen Nailor (concussion) and offensive tackle Brian O’Neill (ankle) did not practice Tuesday. Offensive guard Ed Ingram (hip) and offensive guard Dalton Risner (ankle) were limited.","pubDate":"2023-12-12 23:54:27","image_url":null,"source_id":"profootballtalk","source_priority":267,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"63908a21b1ad5ef5031e3c45edc05e1a","title":"Braeden Carrington to step away from Gophers men’s basketball program","link":"https://www.inforum.com/sports/college/braeden-carrington-to-step-away-from-gophers-mens-basketball-program","keywords":null,"creator":["Andy Greder / St. Paul Pioneer Press"],"video_url":null,"description":"Carrington has played through injuries to start all 10 games for the Gophers.","content":"Gophers sophomore guard Braeden Carrington is taking an indefinite break from the U men’s basketball program to focus on his mental health. “There’s areas of my life I am looking to improve and must step away from the program and put myself first,” Carrington wrote on X on Tuesday. “I plan on returning to the team when the time is right. For now please respect my space and allow me to ultimately do what’s best for me. Thank you Gopher fans.” MORE COLLEGE SPORTS: Ongoing list of Bison football commits for 2024 recruiting class, including decommit headed to Kansas State 1h ago Dragons soar to unprecedented No. 2 ranking in D-II men's basketball poll 1h ago Bison players support Roehl, say Montana the priority this week 2h ago Ohio State retains No. 1 ranking in USA Hockey / The Rink Live women's poll 2h ago Gophers head coach Ben Johnson added in a statement: “We fully support Braeden as he takes this time to focus on his mental health. Myself, our administration and our team will do whatever we can to help him and I admire Braeden for his courage. We will be here to assist him every step of the way.” Carrington has played through injuries to start all 10 games for the Gophers going into Tuesday’s home game against IUPUI. The Brooklyn Park native is the U’s best perimeter defender. He is averaging 5.8 points and 4.7 rebounds in 24.7 minutes per game this season. ADVERTISEMENT Gophers football: Prior Lake defensive lineman Jide Abasiri decommits after USC visit The second shoe has dropped on one of three high school players with questionable commitments to the Gophers football program. Prior Lake defensive lineman Jide Abasiri said Monday he has de-committed from the Gophers recruiting class for 2024. The three-star prospect is coming off a visit to USC last weekend. Abasiri, who is listed at 6-foot-5 and 290 pounds, committed to Minnesota in March. He was set to follow two Prior Lake players to Dinkytown, until the Trojans started showing interest, including a scholarship offer in November. After Abasiri made the announcement, fellow Prior Lake alums turned Gophers, Greg Johnson and Martin Owusu, posted emoji faces with questioning expressions on the social media site X. Minnesota has had five total de-commitments from next year’s class. Two more are feared by the U to be coming down the pike. Esko, Minn., safety Koi Perich visited Ohio State this weekend, while Gaylord, Mich., linebacker Brady Pretzlaff took a trip to Michigan State. Former U defensive coordinator Joe Rossi, who recruited Pretzlaff to Minnesota, is now set to be the Spartans’ new DC. ______________________________________________________ This story was written by one of our partner news agencies. Forum Communications Company uses content from agencies such as Reuters, Kaiser Health News, Tribune News Service and others to provide a wider range of news to our readers. Learn more about the news services FCC uses here . Share Share this article News reporting News reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags MINNESOTA GOLDEN GOPHERS COLLEGE BASKETBALL","pubDate":"2023-12-12 23:53:20","image_url":null,"source_id":"inforum","source_priority":14163,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"71d106be6ada4a23250665b0bd599fe0","title":"Danilo 'out for FOUR MONTHS' as Rangers told it's worst case scenario after striker's injury scan","link":"https://www.dailyrecord.co.uk/sport/football/danilo-out-four-months-rangers-31660791","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Robbie Copeland)"],"video_url":null,"description":"It's reported Danilo will be out until April with his knee injury.","content":"Danilo goes off injured against Hearts (Image: SNS Group) Get the latest Rangers news from Record Sport with our daily newsletter. More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Rangers news from Record Sport with our daily newsletter. Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rangers will be without striker Danilo for four months after scans confirmed the worst case scenario for his knee injury. Danilo went off against Hearts and Philippe Clement had initially been hopeful he would see him back in contention just after the winter break. But according to the Scottish Sun , the 24-year-old has taken a serious blow and will be out until April. It comes after Danilo missed a chunk of the season earlier this year with a facial injury as he's been stricken with bad luck since his £7m move to Rangers . Clement had lamented his back luck on the injury front but he'll now turn to Cyriel Dessers and Kemar Roofe between now and January, when he hopes to recruit a new striker. Even before the extent of Danilo's injury was confirmed, Clement said: “We will look to bring someone in, it will be one of the priorities. But it’s up to the other strikers to show they’re ready. Read More Related Articles Man United branded 'the Celtic of English football' as Jason Cundy claims Hoops are LAUGHING at struggling Ten Hag Read More Related Articles 'Confident' Rangers advertise tickets for fan snaps with Viaplay Cup days BEFORE Aberdeen final “We know that Kemar is just out of an injury also and has a history of consecutive injuries. We need to take that into account, it’s no use just to throw him on the pitch and then he’s out also. “Kemar is not ready to play 90 minutes. I don’t want to put all the pressure on Abdallah to score goals, I expect it from other positions. “I haven’t had a chance to play him as a central striker in training because we haven’t had enough wingers in training. It’s about the players showing they are ready to play for a club like Rangers with all the expectations that brings.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Rangers FC Danilo Philippe Clement Cyriel Dessers Kemar Roofe","pubDate":"2023-12-12 23:51:56","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31633590.ece/ALTERNATES/s615/0_Heart-of-Midlothian-v-Rangers-FC-Cinch-Scottish-Premiership.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ff7c4f33dff2b4b4a15558cfd4124999","title":"AFL in meltdown over spinning wheel of death","link":"https://www.cairnspost.com.au/sport/afl/afl-in-meltdown-over-gather-round-spinning-wheel-of-death/news-story/41630c4259c6f46f7118da6aafca8293","keywords":["AFL","AFL Teams","Sport news and galleries"],"creator":[""],"video_url":null,"description":"Footy fans are in up in arms after the AFL’s Gather Round ticket release descended into a farce this week.","content":"AFL Don't miss out on the headlines from AFL. Followed categories will be added to My News. Footy fans are in up in arms after the AFL’s Gather Round ticket release descended into a farce this week. The second instalment of the hugely successful 2023 event created record interest when tickets went on sale this week. The fixtures for the festival round of football — where all 18 teams will play out of South Australia — from April 4 through to April 7 were released last month. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start Your Free Trial Today > Tickets for three of the blockbuster matches have sold out in record time — including the opening match of the weekend between the Crows and Melbourne at the Adelaide Oval. The AFL announced on Tuesday more than 100,000 tickets were sold during the 24-hour priority window for AFL and club members before tickets were made available to the general public. Collingwood players with Nicky Winmar before their Gather Round match at the Adelaide Oval. Pic: Michael Klein. The suburban stadium clashes at Norwood Oval — Brisbane against North Melbourne and Richmond against St Kilda — have also sold out. Many footy diehard fans missed out on the seats they wanted — and vented their fury after wasting their time on the Ticketek website. It was so nice, we had to do it twice ð Gather Round in South Australia, round four, 2024: https://t.co/zpq9akrEuI pic.twitter.com/nP2eKR3J18 — AFL (@AFL) November 12, 2023 Footy fans on Twitter and Reddit claimed they had been left waiting in the Ticketek “lounge” for more than an hour before striking out on tickets. Others have claimed they received error messages stating that their special membership codes were not valid — and thus were unable to purchase tickets during the special window. The Adelaide Advertiser’s editor at-large Paul Starick described the Ticketek system as a “spinning wheel of death” . After all that, I canât even get my seat, let alone my bay ð¤·ð½ââï¸ @Adelaide_FC https://t.co/1WRsjVNuSM — John (@jbabz84) December 11, 2023 . @Ticketek_AU got in at 12pm yet your system told me my AFL Gather Round barcodes were invalid. I then refresh and at 12:01pm all tickets are sold out. How is this possible? — Jeremy (@JemBeano) December 11, 2023 It would be cheaper to fly to South Australia and watch the AFL Gather Round games in a pub than have to deal with @Ticketek_AU #AFL #GatherRound — Shaegan Vishal î¨ (@shaeganvishal) December 11, 2023 Every second in the Ticketek lounge my anger increases #AFL — Leonardo Puglisi (@Leo_Puglisi6) December 11, 2023 Ticketek on Tuesday night responded to the backlash with a spokesperson telling news.com.au: “The demand for Gather Round tickets for the 2024 AFL season has grown significantly in the Event’s second year, with demand up by over 130 per cent from 2023. “During the pre-sale, we had over 20,000 customers in the Ticketek Lounge to purchase tickets for Gather Round. Customers spent on average 6 minutes in the lounge. GWS vs Hawthorn at Norwood Oval. IMAGE/Russell Millard “The General Public on sale commenced at 12pm ACDT today (Tuesday). Ticket sales peaked at just under 3,000 tickets per minute, which is in line with the fastest AFL on sale to date, and consistent with the demand for recent touring artists Taylor Swift and Coldplay.” The league has made changes to the 2023 Gather round format with two matches to be played in the Adelaide Hills in 2024. Hopes of taking a game to the iconic Barossa Valley wine region fell apart earlier this year, prompting the league to turn back towards the sole game played in Mt Barker in 2023. More Coverage AFL star’s big news is Cornes’ worst nightmare AFL responds after coroner calls for change The AFL will next year play two fixtures at the country football ground, featuring Sydney, West Coast, Gold Coast and GWS. The AFL in April announced Gather Round is staying in Adelaide for three more years with former CEO Gillon McLachlan striking a deal with South Australian Premier Peter Malinauskas. With the host city being widely applauded for its stellar job of creating a party atmosphere in the City of Churches, there was almost no opposition to the “Magic Round” concept returning to Adelaide for the foreseeable future. Originally published as AFL in meltdown over Gather Round spinning wheel of death More related stories AFL Carlton v Collingwood Grand Final: Our way-too-early predictions It was in play deep into 2023, but our experts are predicting two of the AFL’s biggest clubs will face off for all the marbles in 2024. Agree? HAVE YOUR SAY on our 2024 predictions here. Read more AFL Decade of Dees? Melbourne’s ‘10 year’ flag play despite finals flops A bold prediction back in 2020 set the wheels in motion for two premierships and despite some troubles in finals, Melbourne has doubled down on a plan to stay in the flag hunt for the long run. Read more","pubDate":"2023-12-12 23:50:00","image_url":null,"source_id":"cairnspost","source_priority":626680,"country":["australia"],"category":["sports"],"language":"english"}]}