{"newsArray":[{"title":"The day cricket died? Embarrassing scenes at MCG","link":"https://www.couriermail.com.au/sport/cricket/australia-v-england-up-to-half-of-australias-team-could-be-playing-their-final-odi-on-home-soil/news-story/ec8bd684cf41ddb1f514624e73217b48","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"A headcount of the sparse MCG crowd which had filtered in for the start of the","content":"dead-rubber third ODI between Australia and England would have been deflatingfor Cricket Australia officials. At first glance there appeared to be maybe 1000 people in the ground to seeAustralia’s best possible ODI line-up, minus rested fast bowler Mitchell Starcand injured Glenn Maxwell, take on the old enemy England. The official attendance was listed on Twitter as 4524 shortly after play started at 2.20pm.The result of too much cricket, with even Australian players spread around the country inother teams, or putting their feet up in Perth like Cameron Green, has deliveredwaning interest in the national team’s pursuits. While the average crowd for the only three ODIs ever played at the MCG in November isover 17,000, that sort of figure attending on a cloudy Tuesday in Melbourne seemedfanciful. On the field Australia resisted the urge to unleash wild thing Riley Meredith for thethird and final clash, instead including Sean Abbott for Ashton Agar, withcaptain Pat Cummins back in charge, taking the reins from Josh Hazlewood. England won the toss, and put Australia in to bat, with the two teams entering the arena to applause which sounded more like golf claps than the rousing support which was their greeting in days gone by.With the sound of leather and willow set to echo around the empty ground, it looms as a likely miserable MCG one-day send-off for a host of players who could potentially be playing their final 50-over international at the venue.Next year’s World Cup in India shapes as the potential end of an era for this Australian team, given the exhausting demands of the schedule makes it unrealistic for many senior players to continue in 50-over cricket.There is still plenty of water to go under the bridge until any firm decisions are made, but it’s possible Tuesday’s dead rubber against England could be the last ever ODI outing in Australia for David Warner, Mitchell Starc, Steve Smith, Pat Cummins, Josh Hazlewood and Marcus Stoinis.For Warner, Starc, Smith, Cummins and Hazlewood it would be a fitting venue should it indeed be their last ODI on home soil, given it’s where they lifted the World Cup trophy in 2015.Perhaps selectors will hope that a couple of those stars will forge on a little longer than the World Cup in 12 months’ time to help with a smoother transition, but unless a player is planning on battling through to the 2027 World Cup in South Africa, then it seems an opportune time to usher in a new era.cricket greats pollAustralia won’t play another ODI on home soil until January 2024 against the West Indies, and a handful of Australian stars have already begun to forecast the scaling back of playing all three formats.“I don’t think playing three formats is something I can do for a long period of time moving forward now,” Starc said over the weekend.“Not the way it’s scheduled these days. It’s certainly impossible at the moment to play every game as a three-format player.“Tests always first (priority). Tests are far above white ball. I’ll decide on the rest as I go and where my body’s at and how I feel about it. I’d love to, selection and form pending, very much like to continue playing Test cricket as long as we can.”Warner said last week that while he is shooting for the 2024 Twenty20 World Cup, this could be his final 12 months in Test cricket.“Test cricket will probably be the first one to fall off,” Warner said on Triple M’s Deadset Legends.“Because that’s how it will pan out. The T20 World Cup is in 2024, (one-day) World Cup next year.“Potentially it could be my last 12 months in Test cricket.“But I love the white-ball game. It’s amazing.”Smith was half joking when he suggested back in September he might not play one-day cricket that much longer – but he would be 38 by the time a 2027 World Cup comes around.“I’m getting old myself, so I’m probably the next one to retire,” he said earlier this year. “So we’ll see.”SCBBL PROMOThere is a feeling that Cummins may only captain the one-day team as a one-year mission through to next year’s World Cup.He is younger than his fellow quicks at 29 and so could play on in 50-over cricket, but the reality is the demands of the schedule force him to rest from ODI cricket so often that it’s questionable whether it’s sustainable for him to continue in the format, given captaining and performing in the Test arena is his No.1 priority.The bowlers may well try and forge onto the T20 World Cup in 2024, but overall it would appear that over the next 18 months they will follow the lead of England’s James Anderson and Stuart Broad and focus on being Test specialists.It could become a natural juncture for Australia to follow an English model of having a clearer division between white ball and red ball specialists.","pubDate":"2022-11-22 03:45:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jagadeesan breaks List A world record","link":"https://www.tribuneindia.com/news/sports/jagadeesan-breaks-list-a-world-record-453488","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru, November 21Tamil Nadu batter Narayan Jagadeesan shattered the world record for the highest individual score in men's List A cricket by hammering a 141-ball 277 against Arunachal Pradesh in the Vijay Hazare Trophy today.Also, Tamil Nadu became the first team to breach the 500-mark in List A cricket before winning the Group C match by 435 runs, making it the biggest victory margin at this level. The previous record was Somerset's 346-run win over Devon in 1990.The 26-year-old Jagadeesan also became the first player to score five consecutive centuries in men's List A cricket.He also went past Alistair Brown and Rohit Sharma to set a new record for the highest individual score. Brown's previous high of 268 for Surrey came against Glamorgan in 2002.The previous Indian record of 264 by Rohit had come in an ODI against Sri Lanka.Brief scores: Tamil Nadu 506/2 in 50 overs (Jagadeesan 277, Sudharsan 154); Arunachal Pradesh 71 all out in 28.4 overs (Siddharth 5/12) by 435 runs.","content":null,"pubDate":"2022-11-22 03:41:14","image_url":"https://www.tribuneindia.com/Content/images/rss-tribune-thumb.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia vs England Live Cricket Score and Commentary, 3rd ODI at Melbourne","link":"https://www.firstpost.com/firstcricket/sports-news/australia-vs-england-live-cricket-score-commentary-3rd-odi-at-melbourne-11670521.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Australia vs England Live Cricket Score and Commentary, 3rd ODI at Melbourne","content":"Toss news: England won the toss and opted to field in the Melbourne ODI.Playing XIs: Pat Cummins is back as the captain of Australia.Australia XI: David Warner, Travis Head, Steven Smith, Marnus Labuschagne, Alex Carey(w), Mitchell Marsh, Marcus Stoinis, Sean Abbott, Pat Cummins(c), Adam Zampa, Josh HazlewoodEngland XI: Jason Roy, Philip Salt, Dawid Malan, James Vince, Sam Billings, Jos Buttler(w/c), Chris Woakes, Sam Curran, Liam Dawson, David Willey, Olly StonePreview: Australia have already clinched the three-match series by winning the first two ODIs. The hosts won the first ODI by 6 wickets and beat England by 72 runs in the second ODI.England will look to salvage some pride by collecting a consolation win on Tuesday while the hosts will be looking to complete a series sweep over the reigning ODI and T20 world champions. England’s openers have filed to do well in both the ODIs so far and the team will hope for a better start from them at Melbourne to give Australia a tough fight The Aussies have been pretty good overall.Squads:England: Jason Roy, Philip Salt, Dawid Malan, James Vince, Sam Billings(w), Moeen Ali, Chris Woakes, Sam Curran, Liam Dawson, David Willey, Adil Rashid, Jos Buttler(c), Chris Jordan, Olly Stone, Luke WoodAustralia: David Warner, Travis Head, Steven Smith, Marnus Labuschagne, Alex Carey(w), Mitchell Marsh, Marcus Stoinis, Pat Cummins(c), Adam Zampa, Josh Hazlewood, Sean Abbott, Josh Inglis,Riley Meredith, Cameron GreenRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-22 03:20:34","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Australia-vs-England-live-score.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"‘I was shocked’: Cricket star tests positive","link":"https://www.themercury.com.au/sport/cricket/big-bash/i-was-shocked-perth-scorchers-import-laurie-evans-tests-positive-for-a-banned-substance/news-story/3ddd841c6f8e5fd4f03878da37776f89","keywords":["Big Bash News","Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Perth Scorchers import Laurie Evans has tested positive for a banned substance during a routine anti-doping test in August, putting the England batter at risk of missing the upcoming Big Bash League.","content":"The 35-year-old, who played 15 matches for the Scorchers last season, has strenuously denied any wrongdoing.Watch BBLI12. Every game live and ad-break free during play on Kayo. New to Kayo? Start your free trial now >“I was shocked to be told that an anti-doping sample I provided in August 2022 tested positive for trace amounts of a banned substance,” Evans said in a statement via the Professional Cricketers’ Association.“I believe passionately in clean sport and I have never taken any banned substances. I do not know what caused the positive test but my team and I are investigating how this could have happened and I am doing everything possible to find out.“Due to the confidentiality of the process, I cannot say any more at this stage but I would like to thank my family for supporting me at this very distressing time.”The highest penalty for a doping violation is a two-year ban.Evans was player of the match in last summer’s BBL final against the Sydney Sixers, scoring an unbeaten 76 (41) at Marvel Stadium to help the Scorchers secure their fourth title.He plundered 361 runs at 40.11 in last summer’s Big Bash, finishing as the Scorchers’ third-highest run-scorer of the tournament.Following successful winter with Surry and the Manchester Originals in The Hundred, Evans was retained by the Scorchers on a gold contract at the inaugural BBL Draft.“Surrey CCC have been made aware that Laurie Evans has returned a positive anti-doping test result, relating to a sample provided in August this year,” Surrey said in a statement.“We have been in discussion with Laurie and his representatives and understand he intends to investigate this result.“We will make no further comment until the process has concluded.”The Scorchers’ season gets underway at Perth Stadium on Saturday, December 17 with a grand final rematch against the Sixers.","pubDate":"2022-11-22 02:17:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"India Team: जिसकी तुलना विस्फोटक सहवाग से होती है, वह 17 महीने से टीम से बाहर; ऐसे तो खत्म हो जाएगा कैरियर","link":"https://hindi.news18.com/news/sports/cricket-india-cricket-team-prithvi-shaw-not-getting-replace-who-was-compared-to-explosive-virender-sehwag-out-of-national-team-for-17-months-4935821.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India Cricket Team: भारत के पूर्व धुरंधर ओपनर वीरेंद्र सहवाग से एक युवा बल्लेबाज की तुलना होती है, उसमें वह काबिलियत है भी और घरेलू क्रिकेट में लगातार अपने बल्ले से कमाल कर रहा है, उसके बाद भी धाकड़ बल्लेबाज को टीम इंडिया में जगह नहीं मिल पा रही है और वह 17 महीने से टीम से बाहर है.","content":"युवा बल्लेबाज टीम इंडिया में जगह बनाने के लिए 17 महीने से प्रयास कर रहा है. (BCCI Twitter Page) नई दिल्ली. टी20 में दुनिया के नंबर वन बल्लेबाज सूर्यकुमार यादव की खास शैली और विस्फोटक अंदाज की तारीफ दिग्गज कर रहे हैं. न्यूजीलैंड के खिलाफ खेली गई है सूर्या की शतकीय पारी ने दिग्गजों को अपना मुरीद बना दिया है. हर कोई उन्हें बेस्ट बता रहा है, लेकिन न्यूजीलैंड के वेटरन गेंदबाज टिम साउदी ऐसा नहीं मानते हैं. वह कहते हैं भारत ने दुनिया को बहुत से ऐसे बल्लेबाज दिए हैं, जिन्होंने न केवल टी20 बल्कि तीनों फार्मेट में बेहतरीन रहे हैं. उन बेहतरीनों में एक थे वीरेंद्र सेहवाग, जो गेंदबाजों के खिलाफ बेधड़क, बेखौफ और विस्फोटक अंदाज में बल्लेबाजी करते थे. सेहवाग की वही झलक भारत के एक और युवा बल्लेबाज में दिखाई देती है, लेकिन वह पिछले 17 महीने से टीम से बाहर चल रहा है. हम बात कर रहे हैं घरेलू क्रिकेट में मुंबई का प्रतिनिधित्व करने वाले पृथ्वी शॉ की, उन्होंने भारत के लिए अब तक 12 मैच खेले हैं. हालांकि इसमें वनडे की संख्या 6 है, जबकि 5 टेस्ट और 1 ही टी20 इंटरनेशनल मैच है. शॉ लगातार खुद को घरेलू क्रिकेट में साबित कर रहे हैं लेकिन टीम इंडिया में उन्हें बुलावा नहीं आ रहा है. उन्हें टी20 वर्ल्ड कप के लिए भी टीम में जगह नहीं मिल पाई थी. शॉ ने अपना आखिरी इंटरनेशनल मैच टी20 के तौर पर श्रीलंका के खिलाफ जुलाई 2021 में खेला था. पृथ्वी हाल में विजय हजारे ट्रॉफी वनडे टूर्नामेंट में मुंबई के लिए खेलते नजर आए थे. अच्छी शुरुआत देने वाले ओपनर टीम इंडिया में कई युवाओं को मौके मिल रहे हैं, लेकिन पृथ्वी को अपनी बारी का इंतजार है. पृथ्वी बेहद तेज शुरुआत देने की काबिलियत रखते हैं. उन्होंने मिजोरम के खिलाफ अपने पिछले वनडे मैच में 138 के स्ट्राइक रेट से रन बनाए. पृथ्वी ने 39 गेंदों पर 8 चौके और 2 छक्के लगाते हुए 54 रन ठोक डाले. वह ओपनिंग की जिम्मेदारी निभाते हैं और ऐसे में एक तेज शुरुआत वह टीम को दिला सकते हैं. संजू सैमसन को मौका नहीं देने पर फैंस के निशाने पर आए हार्दिक पंड्या, सोशल मीडिया पर जमकर निकाली भड़ास T20 World Cup की करारी हार के बाद वेस्टइंडीज के निकोलस पूरन ने दिया कप्तानी से इस्तीफा VIDEO: सूर्यकुमार यादव ने किया अपनी कामयाबी का खुलासा, कहा- सचिन सर और विराट भाई से… टी20 में जमा चुके हैं शतक पृथ्वी ने अभी तक अपने करियर में एक ही टी20 इंटरनेशनल मैच खेला है. दाएं हाथ के इस बल्लेबाज ने 5 टेस्ट, 6 वनडे भी खेले हैं. उन्होंने टेस्ट में एक शतक और 2 अर्धशतक लगाते हुए 339 रन बनाए हैं. वहीं, वनडे में उन्होंने 31.5 के औसत से 189 रन बनाए. टी20 मैच में वह श्रीलंका के खिलाफ खाता नहीं खोल पाए थे. वह टी20 के ओवरऑल करियर में 92 मैचों में 2401 रन बना चुके हैं जिसमें एक शतक और 18 अर्धशतक शामिल हैं. घरेलू क्रिकेट में ठोंक चुके हैं 20 शतक पृथ्वी शॉ फर्स्ट क्लास में 11 और लिस्ट ए में 9 शतक ठोक चुके हैं. आईपीएल 2022 में ही 10 मैचों में दो अर्धशतक की बदौलत 283 रन बनाया था. इसके बाद दलीप ट्रॉफी में उन्होंने शानदार प्रदर्शन किया है. पिछले महीने उन्होंने नार्थ जोन के खिलाफ 113 और साउथ जोन के खिलाफ 60 और 142 रनों की पारी खेली थी. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Prithvi Shaw , Rohit sharma , Shubman gill , Team india , Virat Kohli , Virendra Sehwag इस महीने 15,000 रुपये से भी कम की कीमत पर मिल रहे हैं ये धांसू 5जी फोन, देखें इनके फीचर्स कमजोर मंगल को मजबूती देता है गुड़ का दान, मंगलवार को करें इन 5 वस्तुओं का दान Kartik Aaryan B'day: 'प्यार का पंचनामा' से 'फ्रेडी' तक यूं लोगों को दीवाना बना रहा है ये बायोटेक्नोलॉजी स्टूडेंट","pubDate":"2022-11-22 02:00:58","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/11/Team-india-14-1-16680169723x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs NZ Dream11 prediction: Fantasy cricket tips for India vs New Zealand 3rd T20I match in Napier","link":"https://www.dnaindia.com/cricket/report-ind-vs-nz-dream11-prediction-fantasy-cricket-tips-for-india-vs-new-zealand-3rd-t20i-match-suryakumar-yadav-3004310","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Check out fantasy XI for the upcoming 3rd T20I match between India-New Zealand that will be played in Napier.","content":"India and New Zealand will be locking horns for one last time in the 3-match T20I series on Tuesday in Napier. The series currently stands at 1-0 in favor of India, with one game to go. READ: FIFA World Cup 2022: Gereth Bale scores as Wales plays a draw against USA in group B encounter After an abandoned first game, India made a stellar start to the series by winning the second match by 65 runs. Suryakumar Yadav’s sensational form with the bat (111* off 51) helped India post 191 runs while batting first. The home side was bundled out for a mere 126. Deepak Hooda picked 4 wickets while Chahal and Siraj hunted 2 scalps each. India has gained an unassailable lead in the series and will be hoping to wrap another game in their favor here. On the other hand, New Zealand will be aiming to level the series by winning this one. Suggested Playing XI for IND vs NZ Dream11 Team: Keepers – Devon Conway (C), Finn Allen Batsmen – Kane Williamson, Suryakumar Yadav, Glenn Phillips, Shreyas Iyer (VC) All-rounders – Mitchell Santner, Hardik Pandya Bowlers – Tim Southee, Lockie Ferguson, Arshdeep Singh READ: 'Does it make sense': Dinesh Karthik suggests radical change in format of Vijay Hazare Trophy, know why India vs New Zealand probable XI India : Ishan Kishan, Rishabh Pant(wk), Suryakumar Yadav, Shreyas Iyer, Deepak Hooda, Hardik Pandya, Washington Sundar, Bhuvneshwar Kumar, Arshdeep Singh, Mohammed Siraj, Yuzvendra Chahal New Zealand : Tim Southee (c), Glenn Phillips, Finn Allen, Mark Chapman, Lockie Ferguson, Devon Conway, James Neesham, Mitchell Santner, Adam Milne, Daryl Joseph Mitchell, Ish Sodhi.","pubDate":"2022-11-22 01:49:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Warner hits out at Australia captaincy saga","link":"https://www.thenews.com.pk/print/1012462-warner-hits-out-at-australia-captaincy-saga","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: A frustrated David Warner on Monday said he was “not a criminal” and everyone should have the right to appeal as Cricket Australia paved the way for his lifetime leadership ban to be lifted.The dynamic opener and former Test vice-captain was banned from any leadership role in...","content":null,"pubDate":"2022-11-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Cricket world erupts after bowler's 'pathetic' act sparks controversy","link":"https://au.sports.yahoo.com/cricket-2022-bowler-pathetic-act-sparks-controversy-230404470.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-21 23:04:04","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-11/b37c3220-69ed-11ed-bb9f-b6dcf01263a3","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"David Warner's brutal swipe at Cricket Australia: 'Not a criminal'","link":"https://au.sports.yahoo.com/cricket-2022-david-warner-brutal-swipe-at-cricket-australia-leadership-ban-222020834.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-21 22:20:59","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-11/4768aee0-69ea-11ed-bbb9-c11b27a92f9c","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"How Hungry Are You: Blue Jays ace Alek Manoah calls out Yankees’ Cole - Sportsnet.ca","link":"https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8vd3d3LnNwb3J0c25ldC5jYS9tbGIvYXJ0aWNsZS9ob3ctaHVuZ3J5LWFyZS15b3UtYWxlay1tYW5vYWgtY2FsbHMtb3V0LWZlbGxvdy1hbC1lYXN0LWFjZS_SAWBodHRwczovL3d3dy5zcG9ydHNuZXQuY2EvbWxiL2hvdy1odW5ncnktYXJlLXlvdS1hbGVrLW1hbm9haC1jYWxscy1vdXQtZmVsbG93LWFsLWVhc3QtYWNlL3NuLWFtcC8?oc=5","keywords":null,"creator":null,"video_url":null,"description":"How Hungry Are You: Blue Jays ace Alek Manoah calls out Yankees’ Cole  Sportsnet.caAlek Manoah Swallows Whole Cricket? | How Hungry Are You? Season 5, Episode 2  SPORTSNETHow Hungry Are You? Alek Manoah calls Cole worst cheater ever and swallows a whole cricket  Sportsnet.caView Full Coverage on Google News","content":null,"pubDate":"2022-11-21 22:00:00","image_url":null,"source_id":"google","country":["canada"],"category":["sports"],"language":"english"},{"title":"Teenage cricket prodigy earns Aussie call-up","link":"https://www.themercury.com.au/sport/cricket/teenage-prodigy-pheobe-litchfield-and-former-irish-international-kim-garth-earn-maiden-australian-callup/news-story/37e0d376ff7888c6e9d6c6b5598c9f33","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Sydney Thunder batting prodigy Phoebe Litchfield has earned her maiden call-up to the Australian team, named in a 15-player squad for December’s T20 tour of India.","content":"Australia will travel to the sub-continent next month for a five-match series against India as the Commonwealth Games champions begin preparations for the 2023 T20 World Cup in South Africa.Litchfield and Melbourne Stars all-rounder Kim Garth, who previously represented Ireland in 35 ODIs and 51 T20Is between 2010 and 2019, were named in the Australian squad for the first time. Hobart Hurricanes all-rounder Heather Graham, who is yet to make her T20I debut, was also included.Watch the Weber WBBL. Every game live and ad-break free during play on Fox Cricket, available on Kayo. New to Kayo? Start your free trial now >Adelaide Strikers spinner Amanda-Jade Wellington has been dropped, while Brisbane Heat wicketkeeper Georgia Redmayne and Sydney Sixers batter Erin Burns also missed out.“These five matches form an important part of the team’s preparations for the upcoming T20 World Cup in South Africa as well as providing an opportunity for some players to gain some experience in Indian conditions,” national selector Shawn Flegler said in a statement.“India will be a good test; they’re a strong side and the two teams have had some good battles in recent times.” Sixers wicketkeeper Alyssa Healy will captain Australia for the first time, with incumbent skipper Meg Lanning still unavailable for selection as she continues her indefinite break from the game.The Australians will also be without veteran batter Rachael Haynes, who announced her retirement from international cricket in September, while Adelaide Strikers skipper Tahlia McGrath has been named vice-captain.“Without Meg and Rachael, this series will provide opportunities for players particularly in the top order, so we’re looking forward to seeing who puts their hand up,” Flegler said.“Alyssa will get the chance to lead the side in Meg’s absence which is exciting, and Tahlia will no doubt take plenty from being her deputy. She’s worked hard on developing that side of her game and thoroughly deserves the opportunity.”Litchfield, who made her WBBL debut in 2019 as a 16-year-old, was earmarked as a future Australian cricketer from a young age.The left-hander became a stalwart for the Thunder and the Breakers while juggling school and university commitments, earning a call-up to the Australia A squad earlier this year.The teenager proved her worth by finishing the three-match series against England A as the highest run-scorer, cracking back-to-back fifties in Canberra.“I look at the top-order for Australia, and they’re amazing,” Litchfield told news.com.au earlier this year.“It’s going to take a lot more runs to put my name up, or for a few people to retire I think for me to get an opportunity.“I’d love to be playing cricket for Australia. It’s one of my goals, and I think if I can keep getting better, opportunities will come up.”Litchfield was the Thunder’s highest run-scorer this season, plundering 280 runs at 23.33 with two fifties.“The really pleasing thing for Pheobes is she’s not getting too distracted or caught up in all the commentary,” Haynes told news.com.au last month.“It’s speaking for itself at the moment, in terms of her putting some performances on the board. She’s certainly not alone in doing that, and that’s really exciting for the game.”Garth, born in Dublin, made her international debut in 2010 as a 14-year-old before becoming a stalwart of the Irish national team.The right-hander, named Ireland‘s women’s player of the decade, scored 1210 runs and claimed 65 wickets for the country of her birth before relocating to Australia in 2020.Garth obtained permanent residency soon after, making her eligible to represent Australia under International Cricket Council regulations.“The ultimate reason I made the decision (to move to Australia) was because I wanted to play cricket for a living,” she told cricket.com.au last year.“To be on a full-time contract and play WNCL and WBBL as a local and play cricket for a living so I didn’t have to have another job like I did back home.“If there comes a time where I’ve had a couple of good seasons and I’ve qualified as a local, if an opportunity came (to play for Australia) that’d be awesome.”Garth, named the Stars’ Player of the Year in 2021, scored 115 runs and claimed 12 wickets in the WBBL this summer.The first T20 between India and Australia gets underway at Mumbai’s D.Y. Patil Stadium on Saturday, December 10, with the first ball scheduled for 12.30pm AEDT.Australia T20 squad for India tourAlyssa Healy (c)Tahlia McGrath (vc)Darcie Brown Nicola Carey Ashleigh Gardner Kim Garth Heather GrahamGrace Harris Jess JonassenAlana King Phoebe Litchfield Beth Mooney Ellyse Perry Megan SchuttAnnabel Sutherland","pubDate":"2022-11-21 21:10:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Made her mark’: Teen phenom gets Aussie call-up","link":"https://www.themercury.com.au/sport/cricket/phoebe-litchfield-included-in-australian-squad-for-india/news-story/328a06b72be73ee8d5db88f3f615a129","keywords":["Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Teenage batting phenom Phoebe Litchfield is one step closer to an international call-up after being included in a 15-player squad for Australia’s upcoming tour of India.","content":"The 19-year-old and former Irish bowler Kim Garth were the standout inclusions in the group which will be captain by Alyssa Healy in the absence of Meg Lanning. Tasmanian all-rounder Heather Graham also earned a call-up on the back of 237 runs and eight wickets for the Hobart Hurricanes in the WBBL. National selection chief Shawn Flegler said Litchfield had taken her game “to another level” in the WBBL this season for the Sydney Thunder, finish the season as the team’s leading run-scorer with 280 runs and two half-centuries. The selections, for five T20 games India, come just over two months before Australia heads to South Africa to defend the T20 World Cup title Lanning’s team won in 2020. “We’ve had an eye on Phoebe for a while and she’s really taken her game to the next level this summer,” Flegler said. “She’s made her mark at the top of the order for the Sydney Thunder and we’re looking forward to seeing what she can do in Australian colours.“These five matches form an important part of the team’s preparations for the upcoming T20 World Cup in South Africa as well as providing an opportunity for some players to gain some experience in Indian conditions.”Veteran all-rounder Ellyse Perry held her spot after a bumper WBBL with the bat but there will be no Lanning, who remains on a self-imposed break, with vice-captain Rachael Haynes also moving in to retirement. Healy will lead the team having been elevated to vice-captaincy after Haynes announcement. “Without Meg and Rachael, this series will provide opportunities for players particularly in the top order, so we’re looking forward to seeing who puts their hand up,” Flegler said. “It’s pleasing to have been able to reward Phoebe, Kim and Heather for strong form throughout the WBBL and hopefully they get the chance to show what they can do at some stage during the series.”Garth, an opening bowler, could get her first turn in Australian colours having begun her international career with Ireland as a 14-year-old, before going on to play more than 100 games for her country of birth. Now 26 and an Australian citizen, she has been starring for Victoria and the Melbourne Stars in the Big Bash.“Kim’s another who’s been in our thinking, she’s had a couple of strong seasons with the ball and adds extra depth to our pace bowling stocks,” Flegler said. . “Heather hasn’t had many opportunities to break into the side, but she’s toiled away with both bat and ball in domestic cricket. She adds depth to the middle order and provides Shelley and Alyssa with another pace bowling option.”The Australians will play five T2os in India from December 9-20AUSTRALIAN SQUADAlyssa Healy (C), Tahlia McGrath, Darcie Brown, Nicola Carey, Ashleigh Gardner, Kim Garth, Heather Graham, Grace Harris, Jess Jonassen, Alana King, Phoebe Litchfield, Beth Mooney, Ellyse Perry, Megan Schutt, Annabel Sutherland AUSTRALIAN TOUR OF INDIA1st T20I: Friday, 9 December, DY Patil Stadium, Mumbai, 7pm local time/12:30am AEDT2nd T20I: Sunday, 11 December, DY Patil Stadium, Mumbai, 7pm local time/12:30am AEDT3rd T20I: Wednesday, 14 December, Brabourne Stadium, Mumbai, 7pm local time/12:30am AEDT4th T20I: Saturday, 17 December, Brabourne Stadium, Mumbai, 7pm local time/12:30am AEDT5th T20I: Tuesday, 20 December, Brabourne Stadium, Mumbai, 7pm local time/12:30am AEDT","pubDate":"2022-11-21 21:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps captain Kane Williamson to miss third T20 against India to attend medical appointment","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-captain-kane-williamson-to-miss-third-t20-against-india-to-attend-medical-appointment/","keywords":null,"creator":null,"video_url":null,"description":"Black Caps captain Kane Williamson will miss the third T20 against India in Napier on Tuesday to attend a pre-arranged medical appointment. Auckland Aces batter Mark Chapman will join the T20 squad in Napier today. Williamson will rejoin the Black Caps on Wednesday when the ODI squad assembles in Auckland ahead of the series opener at Eden Park on Friday. Coach Gary Stead said the medical appointment had nothing to do with Williamson’s historic elbow complaint. “Kane’s been trying to get this booked in for a while now, but unfortunately it hasn’t been able to fit into our schedule,” Stead said. “The health and well-being of our players and staff is paramount, and we look forward to seeing him in Auckland.” Stead said Chapman was excited to be back with the squad after featuring in the recent T20 World Cup and Tri-Series in Christchurch. “He’s a quality player who offers good versatility in the order.” Stead confirmed Tim Southee will captain the side for the third and final match at McLean Park on Tuesday night at 7:30pm. The Black Caps trail the series 1-0 after losing the second T20 at the Bay Oval in Mount Maunganui on Sunday night. The first T20 in Wellington was cancelled due to rain.","content":"Black Caps captain Kane Williamson will miss the third T20 against India in Napier on Tuesday to attend a pre-arranged medical appointment. Auckland Aces batter Mark Chapman will join the T20 squad in Napier today. Williamson will rejoin the Black Caps on Wednesday when the ODI squad assembles in Auckland ahead of the series opener at Eden Park on Friday. Coach Gary Stead said the medical appointment had nothing to do with Williamson’s historic elbow complaint. “Kane’s been trying to get this booked in for a while now, but unfortunately it hasn’t been able to fit into our schedule,” Stead said. “The health and well-being of our players and staff is paramount, and we look forward to seeing him in Auckland.” Stead said Chapman was excited to be back with the squad after featuring in the recent T20 World Cup and Tri-Series in Christchurch. “He’s a quality player who offers good versatility in the order.” Stead confirmed Tim Southee will captain the side for the third and final match at McLean Park on Tuesday night at 7:30pm. The Black Caps trail the series 1-0 after at the Bay Oval in Mount Maunganui on Sunday night. The first T20 in Wellington was cancelled due to rain.","pubDate":"2022-11-21 20:20:29","image_url":"https://www.newstalkzb.co.nz/media/x3nbjqwi/kane-williamson-in-action-during-the-second-t20-against-india-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Kreeda Bharati felicitates Cricketer Bagal","link":"https://thenorthlines.com/kreeda-bharati-felicitates-cricketer-bagal/","keywords":["Jammu","Jammu Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Correspondent Jammu, Nov 21: Kreeda Bharati Jammu and Kashmir today felicitated former India cricketer, Surinder Singh Bagal on being appointed as selector by the Uttrakhand Cricket Association. “Vice president of the Kreeda Bharati J&K, Surinder has made us feel proud by becoming first cricketer from the Union Territory to get such an appointment outside […] The post Kreeda Bharati felicitates Cricketer Bagal appeared first on Northlines.","content":"NL Correspondent Jammu , Nov 21: Kreeda Bharati Jammu and Kashmir today felicitated former India cricketer, Surinder Singh Bagal on being appointed as selector by the Uttrakhand Cricket Association. “Vice president of the Kreeda Bharati J&K, Surinder has made us feel proud by becoming first cricketer from the Union Territory to get such an appointment outside the his home State,” said president of the Kreeda Bharati J&K, Shiv Kumar Sharma. The felicitation took place during a meeting of the Kreeda Bharati to discuss and finalise participation of J&K in the ‘ National Khel Sangam’ at Luknow in Uttar Pradesh from next month. “The meeting was called to finalise and discuss in detail the representation of J&K at the National event in UP. All the members of the UT executive committee attended today’s meeting,” informed general secretary of the Kreeda Bharati J&K, RC Vaid. Further, detailed discussions took place over expansion of the J&K unit at the district level and tehsil level. “We are close to finalisation of the constitution of eight districts units of Jammu Division of the Kreeda Bharati with the sole aim to support the Government initiatives to involve people from all the age groups to active sports activities,” mentioned vice president of the organisation, Sunil Mahajan. The meeting was also attended by Raj Kumar, Ashutosh Sharma and Sanjeev Sharma.","pubDate":"2022-11-21 18:50:56","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand, 3rd T20I: Will Umran Malik and Sanju Samson get a chance?","link":"https://kashmirreader.com/2022/11/21/india-vs-new-zealand-3rd-t20i-will-umran-malik-and-sanju-samson-get-a-chance/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"NAPIER: A drastic change in approach is need of the hour for India but question remains if the likes of Umran Malik and Sanju Samson will be tested in third and final T20 against New Zealand here on Tuesday. India were expected to try out a bunch of players after another World Cup debacle but […]","content":"NAPIER: A drastic change in approach is need of the hour for India but question remains if the likes of Umran Malik and Sanju Samson will be tested in third and final T20 against New Zealand here on Tuesday. India were expected to try out a bunch of players after another World Cup debacle but if the team combination for the second T20 was any indication, they seemed reluctant to start with a clean slate. Take out the individual brilliance of Suryakumar Yadav, the team would have struggled to post 160 on Sunday, a grim reminder of its travails in the World Cup Down Under. India’s powerplay approach has been a major concern. Rishabh Pant was tried at the top with Ishan Kishan in the second game but the move did not work. Considering Pant’s class, one can expect him to fire in the series-decider. Samson is another batter who can make instant impact but the team did not start with him. Going by skipper Hardik Pandya’s post match comments, the management is unlikely to make too many changes for the third T20. India lead the series 1-0 with the series opener washed out. “I don’t know (about changes for the next game). I’d like to give everyone in the squad a chance but it’s just one more game, so it’s a bit tough,” said Hardik, who is seen as the next full captain in the shortest format. Shubman Gill was in the running for opening too in the absence of senior players but the team went ahead with two left-handers. He is likely to get his chances only in the ODI series to follow. Pandya is keen on having more batters who can bowl in the playing eleven and Deepak Hooda has given him one option. However, the biggest disappointment was the non-inclusion of Umran Malik in the first game. It has been proved that there is a pressing needed for an out and out pace bowler in T20 cricket and the New Zealand series is crucial to the development of the Jammu and Kashmir-based tearaway pacer. In Jasprit Bumrah’s absence, Malik, who played three T20s earlier this year, should be exposed to the pressure of playing a top team and given a long run. Playing his first game in a while, Yuzvendra Chahal showed why he should be a regular in the team but fellow wrist spinner Kuldeep Yadav might only get to play the ODIs. Facing a must win scenario, New Zealand will take the field without their skipper Kane Williamson who will miss the game to due to a pre-arranged medical appointment. In his absence, the team will rely even more on opener Finn Allen and Glenn Phillips down the order to put the opposition under pressure. The home bowlers leaked way too many runs in the death overs and they will be looking to correct that. New Zealand will also have to find a way to stop Surya, who is in the form of his life. “Suryakumar played an in incredible innings out there. Everyone watched in amazement, some of the shots be played. We have had a few discussions already and we will have few more tomorrow before the game around how to combat him,” said New Zealand head coach Gary Stead. Squads: India: Hardik Pandya (c), Rishabh Pant, Ishan Kishan, Shubman Gill, Deepak Hooda, Suryakumar Yadav, Shreyas Iyer, Sanju Samson, Washington Sundar, Yuzvendra Chahal, Kuldeep Yadav, Harshal Patel, Mohammed Siraj, Bhuvneshwar Kumar, Arshdeep Singh, Umran Malik —PTI India vs New Zealand, 3rd T20I: Will Umran Malik and Sanju Samson get a chance? added by Press Trust of India on 11:59 pm November 21, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-21 18:29:11","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Williamson to miss third T20I","link":"https://kashmirreader.com/2022/11/21/williamson-to-miss-third-t20i/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Napier: New Zealand skipper Kane Williamson will miss the third and final T20 against India to attend a pre-arrange medical appointment. Mark Chapman has been named as Williamson’s replacement in the squad. Senior pacer Tim Southee will lead the side in his absence. Williamson will rejoin the squad on Wednesday when the ODI squad assembles […]","content":"Napier: New Zealand skipper Kane Williamson will miss the third and final T20 against India to attend a pre-arrange medical appointment. Mark Chapman has been named as Williamson’s replacement in the squad. Senior pacer Tim Southee will lead the side in his absence. Williamson will rejoin the squad on Wednesday when the ODI squad assembles in Auckland ahead of the series opener at Eden Park on Friday. New Zealand head coach Gary Stead said the medical appointment had nothing to do with Williamson’s recurring elbow issue. “Kane’s been trying to get this booked in for a while now, but unfortunately it hasn’t been able to fit into our schedule,” Stead said in a statement issued by New Zealand Cricket. “The health and well-being of our players and staff is paramount, and we look forward to seeing him in Auckland.” India lead the T20I series 1-0. Williamson had made 61 off 52 balls in a losing cause on Sunday. Stead said Chapman was excited to be back after featuring in the recent T20 World Cup and Tri Series in Christchurch. “He’s a quality player who offers good versatility in the order,” he added. The Hong Kong-born cricketer has played seven ODIs and 40 T20s for New Zealand. —PTI Williamson to miss third T20I added by Press Trust of India on 11:59 pm November 21, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-21 18:29:03","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Would love to play IPL cricket: Joe Root","link":"https://thenewsglory.com/would-love-to-play-ipl-cricket-joe-root/","keywords":["Sports","Cricket","India","IPL","Joe Root"],"creator":["The News Glory"],"video_url":null,"description":"Former England Test cricket team captain Joe Root has expressed his desire to play in the upcoming IPL 2023 season. Root is regarded as England’s all-time best batsman in Test cricket. He also said that he is considering adding his name to the auction for the upcoming season. Root is known as one of the […]","content":"Former England Test cricket team captain Joe Root has expressed his desire to play in the upcoming IPL 2023 season. Root is regarded as England’s all-time best batsman in Test cricket. He also said that he is considering adding his name to the auction for the upcoming season. Root is known as one of the Fab4 players of modern day cricket. The 31-year-old has been playing for England since 2012. He has played 124 Tests and 158 ODIs. He has scored 10,504 runs including 28 centuries in Test cricket. He is also the number 1 batsman in Test cricket. In this context, he said that he wants to play IPL cricket. He opted out of the auction saying he wanted to focus on Test cricket during the 2022 season. He has played a total of 32 T20 Internationals for England. “I am seriously considering participating in the IPL auction. It would be great to get a place in it. I think playing T20 cricket for the next two years will be a good exposure. I distanced myself from this format. Now it’s time to play with it. “I’m not really thinking about retirement,” Rudd said.","pubDate":"2022-11-21 18:28:09","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"East Delhi emerge victorious at National Doctors Cricket Tournament","link":"https://telanganatoday.com/east-delhi-emerge-victorious-at-national-doctors-cricket-tournament","keywords":["Hyderabad","News","Sport","National Doctors Cricket Tournament"],"creator":["Telangana Today"],"video_url":null,"description":"East Delhi team bagged top honours in the second national Doctors Cricket Tournament held at the SCG Cricket Ground","content":"Hyderabad: East Delhi team bagged top honours in the second national Doctors Cricket Tournament held at the SCG Cricket Ground, Hyderabad on Sunday. The East Delhi team defeated Star Maharashtra in the summit clash to clinch the title. Dr Pankaj Yadav was adjudged as the Man of the Series. Dr Srinath and Dr Ramneesh were the Best Batter of the Tournament and Best Bowler of the Tournament respectively.  ","pubDate":"2022-11-21 17:58:06","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Who is Wilton Sampaio and what matches has the World Cup VAR official refereed before?","link":"https://www.thescottishsun.co.uk/sport/football/2769476/wilton-sampaio-world-cup-var-official/","keywords":["Football","Sport","World Cup","Explainers"],"creator":["Joe Miles"],"video_url":null,"description":null,"content":"FIFA have picked 13 referees from around the world to take charge of the video replays in Russia. VAR will be used at the World Cup this summer for the first time in history in a bid to make the game as fair as possible. Wilton Sampaio has been a listed referee for Fiifa since 2013Aizar Raldes Who is Wilton Sampaio? Sampaio was born in 1981 in Teresina de Goias, Brazil. The 36-year-old will be a video assistant referee at the World Cup this summer. He was elected as one of the best referees in the 2012 Campeonato Brasileiro Serie A champions. Sampaio is known in Brazil for handing out yellow cards at every possible occasion. The Brazilian impressed the Fifa officials during his VAR trainingReuters After officiating three Copa Libertadores matches last season, the Brazilian produced 14 yellow cards and one red card. And he handed out 12 yellow cards after two Campeonato Brasileiro Serie A matches. Has he refereed at a World Cup competition? The competition in Russia will be Brazilian’s first ever job at a World Cup. He has refereed international matches at U17 and U15 level. USA 0 WALES 0 Gareth Bale STARTS huge Group B clash as Wales seek victory - lates UNACCEPTABLE Sutton left livid with football authorities as he slams Iran \"embarrassment\" Highs & lows Six of Gio van Bronckhorst's best days as Rangers manager and six of his worst NOT IN TOP 10 Ally McCoist roasted over Gers job by World Cup commentary pal Jon Champion Tough test New Gers boss’ first game lined up in closed-door clash with Championship side THE LO DOWN Williams F1 team reveal Logan Sargeant as replacement for Latifi next season NOT GOT THE GIGG Why is Ryan Giggs not Wales manager at the 2022 World Cup? OUT OF THE BLUE New name emerges as Gers manager contender and installed among favourites KANE PAIN England star Harry Kane spotted limping with ankle strapped after knock vs Iran CRICKET LEGEND Tributes paid after death of English cricket player and umpire and Lloyds Has he used VAR before? Video assistant referees are not used in the Brazilian leagues, but he was selected by Fifa after he excelled in the VAR seminars. Speaking to Globo, he said: “The feeling is very joyful. “It is a dream come true, to be able to work in a World Cup, my first in the professional category. “I tried my best to prepare to be among the selected , in the theoretical and practical parts. “The goal now is keep improving until the trip to Russia.” Dream Team World Cup - Sign up to win £100k Enter for FREE £50m budget and 20 transfers throughout the tournament Play to win £100k top price and a share of £175k prizepot SIGN UP FOR DREAM TEAM WORLD CUP NOW  ","pubDate":"2022-11-21 16:40:34","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Jeremy Lloyds dead at 68: Tributes paid to English cricket umpire and former Somerset star","link":"https://www.thescottishsun.co.uk/sport/9800115/jeremy-lloyds-dead-tributes-england-cricket-somerset/","keywords":["Sport","Cricket","Gloucestershire cricket team"],"creator":["Dylan Terry"],"video_url":null,"description":null,"content":"FORMER English cricketer and umpire Jeremy Lloyds has passed away at the age of 68. He registered 4,036 runs and 133 wickets for Somerset between 1979 and 1984. AlamyAs a player Lloyds was a left-handed batter and right arm off-break bowler[/caption] AlamyHe later made his name as a cricket umpire[/caption] And Lloyds then went on to play for Gloucestershire between 1985 and 1991 where he managed 6,400 runs and 188 wickets. Somerset paid tribute to their ex-player on Monday afternoon. Speaking on Twitter, the club said: “Everyone associated with Somerset County Cricket Club is deeply saddened to hear that former player Jeremy Lloyds has passed away.” Lloyds was appointed to the ECB’s First Class umpires list in 1998. READ MORE IN SPORT FALLING APART England's World Cup hangover worsens as they lose ODI series to Australia And he went on to be a part of the ICC International Panel between 2003 and 2006. He took charge of his final match in September 2020. And it fittingly took place between his two former clubs Somerset at Gloucestershire. Tributes poured in on social media following the death of the former cricketer. Most read in Sport OUT OF THE BLUE New name emerges as Gers manager contender and installed among favourites TOP TARGET Gers hero Alex Rae names front runner to replace van Bronckhorst after sacking BLUE BOSS Michael Beale ODDS ON to be next Rangers boss as Steven Gerrard drops out running FOOTIE TRAGEDY Swiss football mourns as former star, 27, dies after jumping from building Homecoming Graeme Souness reveals Steven Gerrard chat and weighs up Ibrox return chances NEW BOSZ? Ex-Lyon and Ajax boss Peter Bosz 'in the running' for Rangers job One person said: “Terribly sad. A good batsman and off-spinner who did even better at Gloucester when he moved.” Another added: “A player who made the best of what he had and a very fine umpire. Sad news for sure. RIP Jeremy.” And a third said: “This is terrible news One of the super nice umpires on the circuit when I played.”","pubDate":"2022-11-21 16:38:26","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi 2022 Live Scores Updates: Gujarat Giants 0 - 4 U. P. Yoddhas; Thalaivas beat Warriors in a close contest","link":"https://www.firstpost.com/sports/pro-kabaddi-2022-live-up-yoddas-vs-gujarat-giants-tamil-thalaivas-vs-bengal-warriors-live-streaming-pkl-season-9-match-latest-updates-11669651.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"Pro Kabaddi 2022 Live Scores Updates: Gujarat Giants 0 - 4 U. P. Yoddhas; Thalaivas beat Warriors in a close contest","content":"Sports Pro Kabaddi 2022 Live Scores Updates: Gujarat Giants 27 - 28 U. P. Yoddhas; Thalaivas beat Warriors in a close contest Pro Kabaddi League Live Scores and Updates: Tamil Thalaivas have an edge over Bengal Warriors in the first match. Gujarat Giants to face U.P. Yoddhas in the second match Bansal Shah November 21, 2022 20:17:19 IST PKL Live. ProKabaddi/ Twitter Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 2nd half | 15′ UP Yoddhas have once again gained the lead, but Gujarat Giants are tailing in and not allowing the Yoddhas to go away with the lead. They have once again sent Pardeep Narwal back to the bench. Gujarat Giants 27 – 28 U. P. Yoddhas Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 2nd half | 10′ Gujarat Giants have now managed to gain lead for the first time in the match. This is turning out to be some exciting action of Kabaddi. Yoddhas under sheer pressure. Gujarat Giants 25 – 24 U. P. Yoddhas Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 2nd half | 7′ Gujarat Giants have made a tremendous comeback in the second half and have reduced the Yoddhas’ lead to just four from 10 at the end of the first half. We might be in for a close finish here! Gujarat Giants 21 – 23 U. P. Yoddhas Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 20′ End of the first half and the Yoddhas have completely dominated the Giants. Gujarat will have to pull out some miracle to make a comeback in the second game. Meanwhile, Pardeep Narwal has been on a high and is one point short of another super-10. Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas Pardeep Narwal has completed 1500 raid points! A big achievement for the all-time Pro Kabaddi star! An all-time champion. Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 10′ UP Yoddhas are cruising away with a massive lead against Gujarat Giants. The first 10 minutes have been completely dominated by them Gujarat Giants 4 – 13 U. P. Yoddhas Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 17′ U.P. Yoddhas have started with a three-point lead, bagging multiple tackle points to start the match. Gujarat Giants are reeling at number 11 on the points table. Can they topple UP Yoddhas today or not? Gujarat Giants 0 – 4 U. P. Yoddhas Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Tamil Thalaivas have made a super tackle and that has given them a three-point lead with less than 20 seconds left in the game! And two more raid points to end the match. That looked so so close and Thalaivas were looking short of experience in the final moments, but they have come back bagging four points in last two raids – first a super tackle against Maninder Singh and the next a two-point raid by Visvanath! Thalaivas have won the contest! Tamil Thalaivas 35 – 30 Bengal Warriors Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Bengal Warriors have taken a review as the referees have awarded a point to Tamil Thalaivas. And they have lost the review. Thalaivas have a three-point lead now and less than 2 minutes left in the match. Tamil Thalaivas 31 – 29 Bengal Warriors Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Under 4 minutes left and Tamil Thalaivas have a two-point lead over Bengal Warriors! Thalaiavas winning will push them to eighth on the points table and Warriors shall face the heat of the defeat. Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Hello and Welcome to the live coverage on Day 38 of the Pro Kabaddi League. Its a double header and Tamil Thalaivas have a lead over Bengal Warriors in the first match of the day. Gujarat Giants will face U.P. Yoddhas in the next match. Preview: Tamil Thailavas face Bengal Warriors in the doubleheader on Monday, followed by U. P. Yoddhas face-off against Gujarat Giants. Tamil Thalaivas are lingering at ninth on the points table, whereas Bengal Warriors are on the edge to jump to the top six and qualify for the playoffs. In the second match of the day, U.P. Yoddhas are comfortably placed in the fourth position, and have been in fine form except for their loss in the last match against Jaipur Pink Panthers. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 21, 2022 21:34:53 IST TAGS: Kabaddi Pkl Season 9 Pro Kabaddi 2022","pubDate":"2022-11-21 15:18:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Pro-Kabaddi-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Women’s cricket | Andhra batter Meghana making her return count in style","link":"https://www.thehindu.com/sport/cricket/womens-cricket-andhra-batter-meghana-making-her-return-count-in-style/article66165676.ece","keywords":null,"creator":["\n        P. K. Ajith Kumar  \n    "],"video_url":null,"description":"Not only has the stroke-player earned her place back in India’s T20I team, but she also made her WODI debut","content":null,"pubDate":"2022-11-21 15:17:08","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 2022: टेस्ट क्रिकेट खेलने के सवाल पर सूर्यकुमार यादव का जवाब, कहा- आ रहा है, वो भी आ रहा है","link":"https://www.abplive.com/sports/cricket/indian-batsman-suryakumar-yadav-said-that-he-is-hopeful-that-he-will-get-chance-to-play-in-test-cricket-soon-2264393","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Suryakumar Yadav On Test Cricket: भारतीय बल्लेबाज सूर्यकुमार यादव का शानदार फॉर्म जारी है. दरअसल, ऑस्ट्रेलिया में टी20 वर्ल्ड कप के बाद अब न्यूजीलैंड के खिलाफ सीरीज में सूर्यकुमार यादव का बल्ला जमकर बोल रहा है. न्यूजीलैंड के खिलाफ दूसरे टी20 मैच में सूर्यकुमार यादव ने नाबाद शतकीय पारी खेली. इस भारतीय बल्लेबाज ने 51 गेंदों पर नाबाद 111 रनों की पारी खेली. इस साल सूर्यकुमार यादव का यह दूसरा टी20 शतक है. इससे पहले इंग्लैंड के खिलाफ सूर्यकुमार यादव ने अपने करियर का पहला शतक बनाया था. अब फैंस का मानना है कि इस खिलाड़ी को टेस्ट क्रिकेट में आजमाना चाहिए. 'आ रहा है, वो भी आ रहा है' सूर्यकुमार यादव से जब टेस्ट क्रिकेट खेलने पर सवाल किया गया तो उन्होंने मजेदार जवाब दिया. दरअसल, उन्होंने कहा कि आ रहा है, वो भी आ रहा है. सूर्यकुमार यादव ने कहा कि मैंने इससे पहले रेड बॉल क्रिकेट खेला है. मैंने मुंबई के लिए घरेलू क्रिकेट में रेड बॉल क्रिकेट खेला है. फर्स्ट क्लास करियर के दौरान मुझे रेड बॉल क्रिकेट खेलने में कोई परेशानी नहीं हुई. साथ ही इस भारतीय बल्लेबाज ने कहा कि मुझे टेस्ट फॉर्मेट खेलने का ठीक-ठाक अनुभव है. 'जल्द ही मुझे भारत के लिए टेस्ट क्रिकेट खेलने का मौका मिलेगा' सूर्यकुमार यादव ने कहा कि मुझे टेस्ट क्रिकेट खेलने में काफी मजा आता है. मैं हमेशा इस फॉर्मेट को एंजॉय करता रहा हूं. मुझे उम्मीद है कि जल्द ही मुझे भारत के लिए टेस्ट क्रिकेट खेलने का मौका मिलेगा. गौरतलब है कि शुक्रवार को सूर्यकुमार यादव ने न्यूजीलैंड के खिलाफ दूसरे टी20 मैच में शानदार शतकीय पारी खेली. उन्होंने 51 गेंदों पर नाबाद 111 रन बना डाले. सूर्यकुमार यादव ने अपनी पारी के दौरान 11 चौके और 7 छक्के जड़े. अब इस सीरीज का तीसरा और आखिरी मैच मंगलवार को नेपियर में खेला जाएगा. फिलहाल, टीम इंडिया इस सीरीज में 1-0 से आगे है. ये भी पढ़ें- Wasim Akram: वसीम अकरम का दर्द- पाकिस्तान में बुलाते हैं मैच फिक्सर, जबकि भारत में... टी20 वर्ल्ड कप में खराब प्रदर्शन के बाद वेस्टइंडीज टीम में होगा बड़ा बदलाव, रोवमैन पॉवेल बनेंगे लिमिटेड ओवर्स के नए कप्तान!","content":null,"pubDate":"2022-11-21 15:02:44","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Pro Kabaddi 2022 Live Scores Updates: Tamil Thalaivas 29 - 26 Bengal Warriors","link":"http://www.firstpost.com/sports/pro-kabaddi-2022-live-up-yoddas-vs-gujarat-giants-tamil-thalaivas-bengal-vs-warriors-live-streaming-pkl-season-9-match-latest-updates-11669651.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"Pro Kabaddi 2022 Live Scores Updates: Tamil Thalaivas 29 - 26 Bengal Warriors","content":"Sports Pro Kabaddi 2022 Live Scores Updates: Gujarat Giants 10 - 20 U. P. Yoddhas; Thalaivas beat Warriors in a close contest Pro Kabaddi League Live Scores and Updates: Tamil Thalaivas have an edge over Bengal Warriors in the first match. Gujarat Giants to face U.P. Yoddhas in the second match Bansal Shah November 21, 2022 20:17:19 IST PKL Live. ProKabaddi/ Twitter Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas End of the first half and the Yoddhas have completely dominated the Giants. Gujarat will have to pull out some miracle to make a comeback in the second game. Meanwhile, Pardeep Narwal has been on a high and is one point short of another super-10. Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas Pardeep Narwal has completed 1500 raid points! A big achievement for the all-time Pro Kabaddi star! An all-time champion. Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 10′ UP Yoddhas are cruising away with a massive lead against Gujarat Giants. The first 10 minutes have been completely dominated by them Gujarat Giants 4 – 13 U. P. Yoddhas Pro Kabaddi League Live Gujarat Titans vs U. P. Yoddhas 17′ U.P. Yoddhas have started with a three-point lead, bagging multiple tackle points to start the match. Gujarat Giants are reeling at number 11 on the points table. Can they topple UP Yoddhas today or not? Gujarat Giants 0 – 4 U. P. Yoddhas Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Tamil Thalaivas have made a super tackle and that has given them a three-point lead with less than 20 seconds left in the game! And two more raid points to end the match. That looked so so close and Thalaivas were looking short of experience in the final moments, but they have come back bagging four points in last two raids – first a super tackle against Maninder Singh and the next a two-point raid by Visvanath! Thalaivas have won the contest! Tamil Thalaivas 35 – 30 Bengal Warriors Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Bengal Warriors have taken a review as the referees have awarded a point to Tamil Thalaivas. And they have lost the review. Thalaivas have a three-point lead now and less than 2 minutes left in the match. Tamil Thalaivas 31 – 29 Bengal Warriors Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Under 4 minutes left and Tamil Thalaivas have a two-point lead over Bengal Warriors! Thalaiavas winning will push them to eighth on the points table and Warriors shall face the heat of the defeat. Pro Kabaddi League Live Tamil Thalaivas vs Bengal Warriors Hello and Welcome to the live coverage on Day 38 of the Pro Kabaddi League. Its a double header and Tamil Thalaivas have a lead over Bengal Warriors in the first match of the day. Gujarat Giants will face U.P. Yoddhas in the next match. Preview: Tamil Thailavas face Bengal Warriors in the doubleheader on Monday, followed by U. P. Yoddhas face-off against Gujarat Giants. Tamil Thalaivas are lingering at ninth on the points table, whereas Bengal Warriors are on the edge to jump to the top six and qualify for the playoffs. In the second match of the day, U.P. Yoddhas are comfortably placed in the fourth position, and have been in fine form except for their loss in the last match against Jaipur Pink Panthers. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 21, 2022 21:09:54 IST TAGS: Kabaddi Pkl Season 9 Pro Kabaddi 2022","pubDate":"2022-11-21 14:50:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Pro-Kabaddi-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Eat, sleep, ton, repeat: ‘Proud’ N Jagadeesan shatters records in dream season","link":"https://www.firstpost.com/firstcricket/sports-news/eat-sleep-ton-repeat-proud-n-jagadeesan-shatters-records-in-dream-season-11669471.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"Eat, sleep, ton, repeat: ‘Proud’ N Jagadeesan shatters records in dream season","content":"277, 128, 168, 107, 114*. Five games, five tons and N Jagadeesan has owned the ongoing Vijay Hazare Trophy with bucket loads of runs for Tamil Nadu at top of the order. While the four hundreds on the trot had everyone talking, it was the domination against Arunachal Pradesh that made him the toast of social media on Monday afternoon.277 runs off 141 balls in an innings laced with 25 4s and 15 6s is no ordinary feat. Even if it came against Arunachal Pradesh. The right-hander rewrote record books during the knock and became the only player to hit five List A hundreds on the trot. He overtook Kumar Sangakkara, Alviro Petersen, and Devdutt Padikkal who had earlier managed four consecutive hundreds in the format. Jagadeesan’s 277 is also the highest individual score in men’s List A cricket as the previous best was 268 by Alistair Brown back in 2002. Yes, 20 years ago!The wicketkeeper-batter got out in the 42nd over and certainly had lot of time and deliveries to overhaul the 300-run mark. It’s not every day that a player accumulates these many runs in a single innings, that too in a 50-over format, and the disappointment of missing the milestone was evident in his voice after a record-breaking day.“The ball was there… I went with my instinct and went through with the shot. It is going to haunt me for a very long time but I am really happy with the effort,” N Jagadeesan tells cricketnext.com in an exclusive chat.The contest between Tamil Nadu and Arunachal Pradesh was the 100th fixture of the ongoing Vijay Hazare Trophy and it was a memorable day for Jagadeesan, and Tamil Nadu. The 26-year-old has been on song this season and he says it’s been the pre-season work and the outings with his team India Cements in the Chennai league which helped him hit the right zone before the domestic season got underway.“I feel it was the Chennai league which kind of put me in the right zone. In the five matches I played, I had two hundreds and three fifties which kind of put me in the right zone. A lot of work, continuous work, has happened behind the scene and I am extremely proud to see the results. My TN coach, coach Prasanna, my father, and everyone has put in a lot of work with me. It’s been a disciplined and cautious effort which I have put in, day in and day out with them, and now the results are coming my way,” says a very proud Jagadeesan.#Jagadeesan (277) misses out on triple hundred. Gets a big ovation from teammates after world record List A score. @sportstarweb #VijayHazareTrophy2022 pic.twitter.com/s8CKYgUXsc— Ashwin Achal (@AshwinAchal) November 21, 2022 Control the controllableJust a few days back, CSK decided to release N Jagadeesan but the “bad news” didn’t affect his preparations and mindset for the ongoing season as he went about scoring runs with a lot of consistency and domination. The stumper has been around the circuit for a long time and always had the reputation of clearing the ropes with ease and hitting the ball really long and far, but this season saw a very patient and composed Jagadeesan in the middle.“The franchise decided to release me and it was something not in my hands. Obviously, it is bad news for a cricketer to be released by a franchise but I have no control over that. What I do have control over is my process, my preparation, and my cricket. I cautiously wanted to bat with the mindset of batting long this season and am very proud to see it come off so well. My mindset was to just focus on the present and what I can control, so it was only my batting and how I can do my best there. The ball does a bit early on here in Bengaluru so I cautiously wanted to see off the first few overs and then build my innings from there on, and bat deep and long,” reveals Jagadeesan.It is not just Jagadeesan who was happy to see the way things have come off for him this season. Baba Aparajith, who has also led Tamil Nadu in the past, was very proud of his teammate’s run and was quick to point out the change he has seen this year.“I think the biggest change I would say, from the outside which I have seen, is the way he is building and controlling the innings. That has been brilliant and the manner in which he is pacing his knocks has been really good,” says Aparajith.Aparajith, who bats in the middle order in the fifty-over format, has not had a good hit in the middle yet because of the consistency shown by the pair of Jagadeesan and Sai Sudarshan at top of the order. The all-rounder isn’t complaining and is very pleased with the openers’ show.“It’s good for the team, no? I mean it’s so good to have the kind of starts they have given us this season and put us in such a good position. And to be honest Jagadeesan’s record will be here for a very long time. It’s not easy to score five hundreds on the trot in the format. The consistency has been absolutely brilliant and am very happy and proud of his efforts,” says Aparajith.While spirits were very high in the Tamil Nadu camp, opposition Arunachal Pradesh were on a leather hunt as the Baba Indrajith-led unit scored a mammoth 501. As many as 45 boundaries and 17 sixes were hit during TN’s innings. Arunachal Pradesh batsman Techi Doria saw the carnage from close quarters and noted that Jagadeesan was in a destructive mood right from the word go.‘Wo maarne hi aaya tha’“Wo maarne hi aaya tha (he came with a mindset to go after the bowling) and played his shots. The wicket was good for batting and he kept scoring runs with ease,” says Doria after a long day in the field. Did Doria keep count of the balls lost? “(laughs) bahut bhar gaya, itna dhyaan nahi diya (quite a few went missing but didn’t really keep count)”.Arunachal Pradesh failed to up a fight against Tamil Nadu but Doria feels the side will only learn from these experiences and more games against top teams will give them invaluable experience.“Even Tamil Nadu would have started someday, right? So the same is for us. They have been playing for a long time and we will only get better playing games and learning from the players we see. The more games we play on turf, the better we will get. It’s a matter of time and more game time and we will be up there with these teams,” says Doria.Business as usualAfter a record-shattering day, Jagadeesan has returned to his room and will repeat the process before prepping for the next fixture. With not much time between games, the right-hander prefers to rest and sleep well to be in the right zone before taking the field. So 100 No.6 loading?“(laughs) As I said I will stay in the present and just keep repeating what I have been doing. I would say I’m in a really good space at the moment and enjoying my cricket. The whole idea is to keep it moving,” says Jagadeesan.The stumper was disappointed to fall just 23 runs short of what would have been the first triple hundred in the format but is not losing too much sleep over it and signs off on an optimistic note.“If this has happened, that would too”.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-21 13:56:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/N-jagadeesan.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy: Jagadeesan Breaks World Record In Tamil Nadu's Win","link":"https://sports.ndtv.com/cricket/vijay-hazare-trophy-narayan-jagadeesan-breaks-world-record-for-highest-ever-list-a-score-in-tamil-nadus-huge-win-3540707","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"Narayan Jagadeesan shattered the world record for the highest ever individual score in men's List A cricket against Arunachal Pradesh while Tamil Nadu became the first team to breach the 500-mark in...","content":null,"pubDate":"2022-11-21 13:49:23","image_url":"https://c.ndtvimg.com/2022-11/h58pghto_narayan-jagadeesan-twitter_120x90_21_November_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Intimidation at the goalie spot…Indian Test team also needs Suryakumar. Why?","link":"https://thenewsglory.com/intimidation-at-the-goalie-spot-indian-test-team-also-needs-suryakumar-why/","keywords":["Sports","Cricket","India","online special","Rohit","Rohit Sharma","surya kumar yadav","Suryakumar Yadav","Virat","Virat Kohli","World Cup"],"creator":["The News Glory"],"video_url":null,"description":"What we lost in the recently concluded T20 World Cup was only realized on Sunday when Suryakumar Yadav was bowled at the 3rd position. This is the game, this is what we lost in the T20 World Cup. And Suryakumar Yadav’s type of batting is something Test cricket needs. Regarding this, Suryakumar Yadav said in […]","content":"What we lost in the recently concluded T20 World Cup was only realized on Sunday when Suryakumar Yadav was bowled at the 3rd position. This is the game, this is what we lost in the T20 World Cup. And Suryakumar Yadav’s type of batting is something Test cricket needs. Regarding this, Suryakumar Yadav said in a brief interview with ‘ESPN Cric Info’, “I will come, the time has come. In first-class cricket, he has considerable experience with the red ball. So I will come… I will come and leave,” he hinted. Rohit Sharma, KL Rahul showed bravery in speech. Bhammy was the reason for his exit from the 2021 T20. A new age was born in 2022. Captain Rohit Sharma was issuing slogans like ‘Padayana Ghaziyum’. In the end, he could only see that he was unable to hit. No wonder Rohit Sharma was stumped; Because here in the IPL series itself, we have seen left-arm fast bowlers including Mosin Khan take him down. After talking about acha pocha, the world cup went like a Vadivelu joke called ‘sona mutha pocha’. Now, it’s nice to see the youngsters playing under the leadership of Hardik Pandya. T20 cricket is for them. The commercial potential of T20 cricket will quickly become popular all over the world. It’s nature also holds the veteran players in so easily that they can’t get rid of it. We are watching Kane Williamson play. It’s time for him, in fact, to retire from T20. Rohit Sharma has also come of age to retire from T20 cricket. Even though Virat Kohli has been mixed in the T20 World Cup, yesterday we got a glimpse of the score we would get if Suryakumar Yadav comes in at No. 3. Virat Kohli, in the same down, scores his first 20 runs in just 24-25 balls. If he then stands till the end, he raises the strike rate. But he ends up scoring 50 off 40 balls and 60 off 50 balls. But Suryakumar scored 111 runs off 51 balls with 11 fours and 7 sixes in the same down. That too in the last stage he blasted 17, 18, 22 in 3 overs. Hardik Pandya’s biggest ego was scoring 2 runs twice in the last over. It was because of his mistake that Saudi scored a hat-trick. Suryakumar Yadav did not come to strike in the last over. Is this how a captain thinks? We have already seen that he bowled without giving a strike to Dinesh Karthik. Netizens have started talking about the popularity of fellow player Hardik Pandya. So Suryakumar will score more than 100 runs in 50 balls. Others can score only 60 runs. This is the benefit of dropping Suryakumar in front. This is what we have lost in World Cup T20 cricket. It can be said that Virat Kohli is the reason why we were able to win some matches in the World Cup. But, it is a matter of talking about what happened. But our fear is that if he had dropped Suryakumar down, maybe Kohli and Rohit would have started and Suryakumar Yadav would have taken the score to 200 in the semi-final against England. Because against England, Suryakumar chased down a big target and scored an impressive century. Watching Suryakumar’s game, it is clear that we have left some such tricks in the World Cup. Taking this as an example, the bowlers of the world will surely tremble if they try Suryakumar in Test matches soon. He can’t stop the fielders at the places where he hits shots. Suryakumar’s stunning shots at such places makes it impossible not to consider that he will shine in Test cricket as well.","pubDate":"2022-11-21 13:23:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Suryakumar's exceptional innings was the difference: Tim Southee","link":"https://www.sentinelassam.com/sports/cricket/suryakumars-exceptional-innings-was-the-difference-tim-southee-624504","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Senior New Zealand pacer Tim Southee praised India’s in-form batter Suryakumar Yadav for shining in the visitors’ 65-run win in the second T20I at Bay Oval","content":"MOUNT MAUNGANUI: Senior New Zealand pacer Tim Southee praised India's in-form batter Suryakumar Yadav for shining in the visitors' 65-run win in the second T20I at Bay Oval, calling his unbeaten 111 an 'exceptional innings' which eventually made a difference to the first innings total.From being 57 off 35 balls at the end of the 16th over, Suryakumar smacked 54 runs off his last 16 balls to propel India to a challenging score. Eventually, the bowlers came to the party to bowl out New Zealand for 126 all out in 18.5 overs. \"Anytime a player gets a hundred in a T20 match, it's quite often the difference. You look at the rest of the side, and how the others battled, his innings was a class apart. He got them to a score which was more than what we had hoped for. But it was an exceptional innings and was the difference between restricting India to 175-180 and them getting above 190,\" said Southee in the post-match press conference. Further talking about Suryakumar's knock, where he reached the three-figure mark in 49 balls, Southee remarked, \"He's a player who can hit you in a number of areas. So, he's had a great 12-18 months in IPL and international cricket. He put up a pretty impressive knock today. The guys have now got 48 hours to re-assess and come up with something for Napier.\" In a forgettable day for New Zealand, Southee brought some cheer by picking his second T20I hat-trick, taking out Hardik Pandya, Deepak Hooda and Washington Sundar on consecutive deliveries to achieve the landmark in the final over of India's innings. \"I guess got a bit lucky there with bowling the last over and couple of those found the fielders. Feels really well as sometimes you bowl well and not get the rewards, and then there are times like today where you bowl and get couple of them at the end. On another day, that would go over the fence for six. Makes the day a bit better,\" he added. New Zealand's bowlers didn't have a great outing as a collective, with Suryakumar taking boundaries off every bowler, including Southee. But the senior right-arm fast-bowler refused to delve deep into the indifferent bowling performance from the Blackcaps. IANS Also Read:   Tim Southee, Trent Boult devastate West Indies batting Also watch:","pubDate":"2022-11-21 13:23:02","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/21/414561-southi-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Big task for Assam in Cooch Behar Trophy match","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/big-task-for-assam-in-cooch-behar-trophy-match-624495","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Assam required another 351 runs to win against Saurashtra in the Cooch Behar Trophy match at Sarushtra","content":"Our Sports ReporterGUWAHATI: Assam required another 351 runs to win against Saurashtra in the Cooch Behar Trophy match at Sarushtra on Monday. In the second innings Saurashtra bowled out 303 and Assam were 18-2 at stumps on Sunday. Brief scores: Saurashtra 1st innings 160, Assam 1st innings 95, Saurashtra 2nd innings 303, Ansh Gosai 113, Raxit Mehta 83, Nishant Singhania 4-88, Assam 2nd innings 18-2. Also Read:  Assam thrash Sikkim in Cooch Behar Trophy Cricket Also watch:","pubDate":"2022-11-21 12:55:27","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/21/414551-cricket2.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Assam lose to Madhya Pradesh by big margin in U-25 State A Trophy Cricket","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/assam-lose-to-madhya-pradesh-by-big-margin-in-u-25-state-a-trophy-cricket-624493","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Madhya Pradesh defeated Assam by a huge margin of 225 runs in the U-25 State A Trophy Cricket at Jaipur today.","content":"Our Sports ReporterGUWAHATI: Madhya Pradesh defeated Assam by a huge margin of 225 runs in the U-25 State A Trophy Cricket at Jaipur today. Elected to bat, Madhya Pradesh scored 339-6 in their 50 overs. Harsh Gawali (118) scored a century and Rishabh Chouhan contributed 78. Darshan Rajbongshi (3-57) was the most successful bowler for Assam. Later Assam bowled out 114 in 27.3 overs. Nibir Deka (25) was the top scorer and Priyagshu Shukla bagged 4-29. Also Read:  Swarupam smashes ton as Assam beat Karnataka in Vijay Hazare CricketAlso Watch:","pubDate":"2022-11-21 12:51:57","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/21/414550-cri.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}